{
  "pages": [
    {
      "url": "https://artsgarage.org/category/board-spotlight/",
      "is_candidate": false,
      "has_email": true,
      "text": "Search\nCategories\nArt Exhibits\nBlog\nBoard Spotlight\nDonor Spotlight\nFeatured\nGeneral News\nMarjorie's Minutes\nMeet Our Staff\nNews & Notes\nVolunteer Spotlight\nRecent Posts\nWorld Photography Day\nDate: Aug  19, 2025\nGallery Spotlight\nDate: Aug  11, 2025\nEmployee Spotlight – August 2025\nDate: Aug  11, 2025\nMarjorie’s Minutes – August 2025\nDate: Aug  11, 2025\nCall to Submissions- Delray Stories: Fighting for Freedom\nDate: Jul  14, 2025\nStay In The\nLoop On Our\nEvents!\nJoin our Newsletter\n13\nJan\nBoard Spotlight – Dick Lowenthal\nHi, my name is Dick Lowenthal and I’m proud to be Chairman of The Board of Directors at Arts Garage. I’ve been on the board for about eight years now and we’ve had some very exciting times, some difficult times through covid and everything, but we’ve survived and are doing […]\n12\nAug\nJake Sanders – Employee Spotlight\nMy name is Jake Sanders, I’m the Operations Manager. I spent the last decade working in non-government entities, nonprofits, performing arts, arts and culture, and with the Cultural Council. Seeing the type of programing, the type of educational programing, arts, mentorship, and how it’s bringing all of those artistic disciplines […]\n12\nAug\nBoard Spotlight – John Engle\nMy name is John Engle, and the majority of my background is in software design and development. Mainly, I worked as a product manager and, you know, very used to the idea of delivering what people are asking for. You know, I always thought it [Arts Garage] was very interesting, […]\n13\nMay\nBoard Spotlight – Steven G. Rappaport\nMy name is Steve Rappaport. I was just recently appointed to this Board of Directors for Arts Garage. I’m a condominium and HOA attorney by trade, but I’ve been living in this area for over 20 years and am a huge, huge music fan and big concert goer. The opportunity […]\n8\nApr\nLynn Ferguson – Board Spotlight\nMy name is Lynn Ferguson and I’ve been involved with the Arts Garage since it opened in 2011. I came here to hear a Jazz concert and fell in love. I was blown away by the whole atmosphere. So I asked if I could volunteer, and then they asked me […]\n8\nDec\nDavid Crespo – Board Spotlight\nMy name is David Crespo. I’m originally from New York, and I moved here to Delray Beach eight years ago. I had owned a property here for over 18 years, but decided to finally move here permanently eight years ago. What brought me to Delray Beach was my mother in […]\n10\nNov\nElise Rubenstein – Board Spotlight\nHi, my name is Elise Rubenstein, and I live here in Delray Beach, Florida. My life in philanthropy began in Baltimore. I have been a board member of the JCC for quite a long time and also very involved in our Jewish community and our federation in Baltimore. But in […]\n11\nSep\nRobin Greene – Board Spotlight\nHi, my name is Robin Greene, I am an infant/toddler development specialist, I work with children, and I just love music. I use music in my work, and on the weekends coming to Arts Garage is my favorite thing to do. We were fortunate to become friends with the Halberg’s […]\n10\nJun\nBoard Spotlight – Steve Weber\n﻿ We are grateful for our board and all that they do for Arts Garage. Through their dedication, Arts Garage is rapidly becoming the #1 arts destination in South Florida. This month we sat down with board member, avid volunteer, and Band of Angels donor (3 years in a row) Steve Weber. […]\n10\nMar\nJack Varsalona\nJack Varsalona, our newest addition to the Board of Directors at Arts Garage, is passionate about education. An alumnus of the University of Delaware, Jack earned his BS in History and Economics, a double master’s degree in Special Education and Administration, and a PhD in Educational Leadership and Psychology. His […]\nWorld Photography Day\nDate: Aug  19, 2025\nGallery Spotlight\nDate: Aug  11, 2025\nEmployee Spotlight – August 2025\nDate: Aug  11, 2025\nMarjorie’s Minutes – August 2025\nDate: Aug  11, 2025\nCall to Submissions- Delray Stories: Fighting for Freedom\nDate: Jul  14, 2025\nPosts navigation\n1\n2\n→",
      "emails": [
        "info@artsgarage.org",
        "mackay@newhavenfuneralsnq.com.au"
      ]
    },
    {
      "url": "https://artsgarage.org/call-to-artists/",
      "is_candidate": false,
      "has_email": true,
      "text": "Starry, Starry Night\nNight — a realm where a different set of rules, social systems, and star-lit environments come alive. Under streetlights and shadows, the night unveils hidden layers of time, speed, and perception, fostering excitement and giving the unknown space to roam. It reveals what the daylight conceals, offering a unique perspective on the dreamers and the worlds they inhabit. We invite artists to submit work that explores the mysteries of the night, the vastness of the sky, and the vibrant life that thrives in darkness. Whether your art captures the natural world, the cosmos, or the emotions evoked by nighttime, we welcome your creative interpretations for this exhibition.\nSubmission deadline: Sept 22\nExhibit Dates: NOVEMBER 7, 2025 –DECEMBER 29, 2025\nApply",
      "emails": [
        "info@artsgarage.org",
        "mackay@newhavenfuneralsnq.com.au"
      ]
    },
    {
      "url": "https://artsgarage.org/category/meet-our-staff/",
      "is_candidate": false,
      "has_email": true,
      "text": "Search\nCategories\nArt Exhibits\nBlog\nBoard Spotlight\nDonor Spotlight\nFeatured\nGeneral News\nMarjorie's Minutes\nMeet Our Staff\nNews & Notes\nVolunteer Spotlight\nRecent Posts\nWorld Photography Day\nDate: Aug  19, 2025\nGallery Spotlight\nDate: Aug  11, 2025\nEmployee Spotlight – August 2025\nDate: Aug  11, 2025\nMarjorie’s Minutes – August 2025\nDate: Aug  11, 2025\nCall to Submissions- Delray Stories: Fighting for Freedom\nDate: Jul  14, 2025\nStay In The\nLoop On Our\nEvents!\nJoin our Newsletter\n12\nMay\nEmployee Spotlight – Joseph Montagnino\nMy name is Joseph Montagnino. I’m currently a senior studying film at FAU in the College of Multimedia Studies. Here at Arts Garage, I do a number of tasks. I’m referred to in-house as a floater. That means anything from box office to pretty much anywhere they need help. I’ve […]\n10\nFeb\nKatlyn Menjivar – Employee Spotlight\nHi, my name is Katlyn Menjivar, I’m the Chief Administrator here at Arts Garage, and I grew up on Long Island, New York. I came here to go to college and went to Palm Beach Atlantic University. Specifically, I really had a passion, and still have a passion, for producing […]\n9\nOct\nAdriana Gioeni – Employee Spotlight\nHi, my name is Adriana Gioeni. I was born and raised here, in Boca Raton, Florida, and I’m a graduate of FAU. I heard about Arts Garage at FAU; my drawing professor had her classes introduce us to Arts Garage so we could be in the gallery which was really […]\n13\nMay\nMeet the Staff – Set the Stage\nHi, my name is Mojena, I’m an actress, theater trained as well as film, and I just love every aspect of theatre.  My name is Bethany Renee, I graduated from Palm Beach Atlantic University in 2023 with a BFA in theater, and this will be my third year at Arts […]\n12\nFeb\nKaren King – Employee Spotlight\nI kind of consider myself a professional human. I’m not like a professional at a lot of things, except for really like the thing I’m probably the most professional at is being in the human experience. And so, I’m very much a creature of expression, which dance, and other forms […]\n8\nJan\nKellie Rentz – Employee Spotlight\nHello from Arts Garage, my name is Kellie and I am the new Grants Manager here. I’m originally from Florida, born and raised. I have a background in music as a music educator, performer and have my degree actually from Florida State University. However, I worked the last ten years […]\n8\nDec\nKeyshliany Perez & Alexa Rosenberger – Employee Spotlight\nA: Hi, I’m Alexa. I am one of the marketing assistants here at Arts Garage. Before I was here, I was in school. I graduated with a degree in communications and I also studied journalism. K: Hi, I’m Keyshliany Perez. I went to FAU. I majored in marketing, and then […]\n10\nNov\nLatifah AlSaad – Employee Spotlight\nHi there. My name is Latifah AlSaad. I am one of the graphic designers here at Arts Garage. When I was younger, my mom got me involved in a lot of arts and crafts, which nurtured this love for creativity. So growing up, I always knew that I had to […]\n6\nOct\nAmber Williams- Employee Spotlight\nHi, my name is Amber Williams. I am the Contract Manager at Arts Garage. I am the person that receives the contracts from the artists and makes sure that they have all the materials that they need in order to send to the marketing team so it can get promoted […]\n11\nSep\nAndie Gomez & Mary Ann Canuso – Employee Spotlight\nM: My name is Mary Ann Canuso and I moved to Delray Beach from Manhattan about 12-13 years ago, and just about the same time that Arts Garage started.  A: I came to Delray Beach in 2008 after retiring from the government for 35 years.   M: Arts Garage was one […]\nWorld Photography Day\nDate: Aug  19, 2025\nGallery Spotlight\nDate: Aug  11, 2025\nEmployee Spotlight – August 2025\nDate: Aug  11, 2025\nMarjorie’s Minutes – August 2025\nDate: Aug  11, 2025\nCall to Submissions- Delray Stories: Fighting for Freedom\nDate: Jul  14, 2025\nPosts navigation\n1\n2\n3\n→",
      "emails": [
        "info@artsgarage.org",
        "mackay@newhavenfuneralsnq.com.au"
      ]
    },
    {
      "url": "https://artsgarage.org/event/jazz-java-latin-jazz-rhythms-and-musicians/",
      "is_candidate": false,
      "has_email": true,
      "text": "« All Events\nNotices\nJazz & Java: Latin Jazz – Rhythms and Musicians\nOctober 16 @ 10:00 am\n-\n11:30 am\n$155 (Including Fees)\nEvent header\nNavigation\n«\nAll Arts Open Mic\nNicole Henry Returns – Friday\n»\n#tribe-events-header\nEvent featured image, but exclude link\nEvent content\nJoin Professor Richard Lowenthal as he presents Latin music starting with Spanish song forms, African rhythms and harmonies, and influences from Cuba, Brazil and many Caribbean rhythms. He will demonstrate how they combined with American ballad and blues, jazz and rock, and other contemporary forms. There will be several listening examples from the past 100 years, with the emphasis on Jazz and Latin groups, that include: Louis Armstrong and Jelly Roll Morton, Xavier Cugat, Tito Puente, Machito and Charlie Parker and Dizzy Gillespie, The Buena Vista Social Club, Paquito D’Rivera, Arturo Sandoval, Chucho Valdés, and Stan Getz, among others. The class will listen to different types of rhythms, such as cha-cha-cha, mambo, rhumba, bossa nova, samba and the percussion instruments involved in the music. All are welcome to see and hear how Jazz and Latin music are connected.\nInstructor Bio:\nRichard Lowenthal, Professor Emeritus, is a noted Jazz Educator, Conductor, and performer for the past 55 years. Professor Lowenthal founded the Jazz Department at the prestigious Manhattan School of Music and was Chair of the Department as well as conductor of the award-winning Jazz Orchestra for 19 years.\nIn addition, he also started the Jazz Program at New Jersey City University, one of the first Universities to offer a Jazz Degree in the state. Dick instituted the Jazz and Java Series as part of the Adult Education Program at the Arts Garage and it was the first of its kind in the state of Florida. His performance credits include conductor of the Special Unit of the Glenn Miller Orchestra and contractor and trumpeter for Clark Terry, Mel Torme, Tony Bennett and Nancy Wilson. He also played trumpet with Machito’s Afro- Cuban Band during the 1960’s. He is currently chair of the Board of directors of the Arts Garage.\nREGISTER\n.tribe-events-single-event-description\n+ Google Calendar\n+ Add to iCalendar\n.tribe-events-cal-links\nEvent meta\nDetails\nDate:\nOctober 16\nTime:\n10:00 am - 11:30 am\nCost:\n$155 (Including Fees)\nAdult Arts Education\nOrganizer\nArts Garage\nPhone:\n561-450-6357\nEmail:\ninfo@artsgarage.org\nWebsite:\nartsgarage.org\nVenue\nArts Garage\n94 NE 2nd Ave\nDelray Beach\n,\nFL\n33444\nUnited States\n+ Google Map\nPhone:\n561-450-6357\nWebsite:\nartsgarage.org\n#post-x\nEvent footer\nNavigation\n«\nAll Arts Open Mic\nNicole Henry Returns – Friday\n»\n#tribe-events-footer\n#tribe-events-content\n#tribe-events\nThis calendar is powered by The Events Calendar.\nhttp://evnt.is/18wn",
      "emails": [
        "info@artsgarage.org",
        "mackay@newhavenfuneralsnq.com.au"
      ]
    },
    {
      "url": "https://artsgarage.org/about/",
      "is_candidate": false,
      "has_email": true,
      "text": "Connecting our community to the world through the Arts.\nOur vision drives all of our decisions at Arts Garage. Our programs bring established global performers and renowned regional talent into our South Florida multicultural community — students and adults, locals and tourists, people of all ages, income levels, and backgrounds – all who share a love of the arts.\nCommunity is a hallmark of our work at Arts Garage. We provide a wide variety of music genres and art disciplines to reach everyone in our community.\n#AccessForAll\nisn’t just our tagline: it is the cornerstone of our programs, outreach & community collaborations, staffing, and marketing.\n<div class=\"call-to-action cta-fixed after-white-50 position-relative\">\n\t\t\t\t\t<div class=\"container\">\n\t\t\t\t\t\t<div class=\"row justify-content-center\">\n\t\t\t\t\t\t\t<div class=\"col-lg-12 col-md-12\">\n\t\t\t\t\t\t\t\t<div class=\"d-flex align-items-center stay-loop bg-cover\" style=\"background: #232d89 url(/images/cta-bg.jpg)no-repeat center;\">\n\t\t\t\t\t\t\t\t   \t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t</div>\n\t\t\t\t</div>\nOUR MISSION\nArts Garage delivers innovative, diverse, meaningful and accessible visual and performing arts experiences to Delray Beach and the South Florida community.\nMusic\nArts Garage hosts nearly 1,000 performers on our stage each year. From Grammy Award-winning musicians – big bands to singer-songwriters, our captivating shows span an eclectic range of musical styles including Jazz, Blues, Soul, Latin music and more. These diverse rhythms bring dynamic and culturally enriching experiences to our community, making Arts Garage a hub for musical exploration and appreciation.\nVisual Arts\nThe Marshall Family Foundation Gallery at Arts Garage champions regional and emerging visual artists by showcasing works that engage our eclectic audience. All artists have a reception, aligned with Delray Beach’s monthly Art Walk, drawing people to their exhibit. Helping local artists gain exposure and earn money through the sale of their work to collectors, our gallery curates six themed exhibits, showcasing over 30 artists each year.\nArts Education\nWith both adult and children’s arts education programming, Arts Garage provides a variety of opportunities for locals to grow their talents and knowledge of the Visual & Performing Arts. Acting classes and Jazz lectures engage adults in the pursuit of their passions, and summer camp and after-school opportunities provide enrichment in the arts for children & youth. Our  Artists-in-Residence (AiR) series at Arts Garage engages the community through master classes, lectures, and other experiences for youth, underserved members, and lifelong learners.\nComedy\nThe Art of Laughter, our monthly stand-up comedy series, presents a masterful blend of wit, talent, and charm by top-tier professional and nationally touring comedians. Our featured comedians offer a wide range of comedic styles with notable appearances on Comedy Central, America’s Got Talent, CONAN, The Late Late Show with James Corden, Kevin Hart’s LOL Network, Netflix and more.\nTheatre\nArts Garage intentionally stages plays that inspire meaningful conversations through innovative and thought-provoking productions. From dramas to comedies, our season consists of three professional shows written by cutting-edge, dynamic playwrights from around the country. Curated to address universally relevant themes, theatre at Arts Garage actively engages our community by inspiring young thespians and awakening our creative selves.\nVolunteers\nVolunteers make our mission possible! Since 2011, our volunteers have dedicated over 85,000 hours providing valuable assistance with patron support, events setup, and ushering performances. By offering our volunteers the opportunity to attend shows as patrons, they too can enjoy world-class events presented at Arts Garage. To show our appreciation, we host volunteer celebrations three times a year with fun, interactive art-based activities.\nAccess to All\nArts Garage connects our community to the world through the arts.\nThis vision is founded on our commitment to provide access to Arts & Culture for everyone. Our pARTner Program and our many community collaborations allow us to engage our entire community, providing over 1,000 free tickets annually ensuring that everyone has an opportunity to attend our events.\nRead our Blog\n19 Aug: World Photography Day [...]\nWhen was the last time you looked at a photo and felt something? Whether it’s joy, nostalgia, or empathy, photography […]\nRead More\n11 Aug: Gallery Spotlight [...]\nJessica Kirby: I’m Jess Kirby, I’m a surrealist painter, and I focus primarily on traditional mediums like acrylic paint and […]\nRead More\n11 Aug: Employee Spotlight – August 2025 [...]\nI’m Francesca, and I am the Program and Admin Assistant. A little bit about me is that I graduated last […]\nRead More\n11 Aug: Marjorie’s Minutes – Augus [...]\nHello, everybody, it’s Marjorie Waldo with Marjorie’s Minutes for August of 2025. If you can believe it, I’m telling you […]\nRead More\nView all blogs\nJoin Our Email List\ndictate label visibility\nEmail Address\nDescription Above\nDescription Below\nHoneypot Trap\nList ID\nThe form that is being submitted! Used to display error/success messages above the correct form\nSubmit Button\nSubscribe!\nNonce Security Check\nMailchimp Form generated by Easy Forms for Mailchimp v6.8.6 (https://wordpress.org/plugins/yikes-inc-easy-mailchimp-extender/)\ndictate label visibility\nEmail Address\nDescription Above\nDescription Below\nHoneypot Trap\nList ID\nThe form that is being submitted! Used to display error/success messages above the correct form\nSubmit Button\nSubscribe!\nNonce Security Check\nMailchimp Form generated by Easy Forms for Mailchimp v6.8.6 (https://wordpress.org/plugins/yikes-inc-easy-mailchimp-extender/)",
      "emails": [
        "info@artsgarage.org",
        "mackay@newhavenfuneralsnq.com.au"
      ]
    },
    {
      "url": "https://artsgarage.org/sponsor-an-event/",
      "is_candidate": false,
      "has_email": true,
      "text": "<img src=\"/images/fg1.jpg\" class=\"img-responsive\">\nSponsor an Event\nSponsoring an event at Arts Garage allows us to deliver innovative, diverse, meaningful and accessible visual and performing arts experiences to Delray Beach and the South Florida community. Pick your favorite discipline of the arts and share your passion! Sponsorship opportunities are available for music performances, standup comedy, theatre and more! When you sponsor an event, your name will be featured in our program, on our website, and on stage on the night of the event.\nContact Us Directly\nSponsorship Opportunities\nRanky Tanky\nNovember 16, 2024 @ 8:00 pm\n-\n10:00 pm\n<div class=\"genre_data\"><p><span>Genre:</span> </p></div>\n﻿ In collaboration with the Spady Cultural Heritage Museum This Grammy Award-winning, Charleston, SC-based quintet, performs timeless music born from the Gullah culture of the southeastern Sea Islands. Their debut album was featured on NPR’s Fresh Air with Terry Gross and the TODAY show. It also soared to the #1 […]",
      "emails": [
        "info@artsgarage.org",
        "mackay@newhavenfuneralsnq.com.au",
        "marjorie@artsgarage.org"
      ]
    },
    {
      "url": "http://artsgarage.org/events/",
      "is_candidate": false,
      "has_email": true,
      "text": "Title Bar\nPhoto View Title\nUpcoming Events\nTribe Bar\nEvents Search and Views Navigation\nShow Events Search\nEvents Search\nDate\nSearch\nSort by Event Type\nMusic\nComedy\nOpen Mic\nTheatre\nYouth Arts Education\nAdult Arts Education\n<option value=\"#\">Theatre</option>\n\t\t\t\t\t\t<option value=\"#\">Open Mics</option>\nEvent Views Navigation\nView As\nList\nMonth\nDay\nPhoto\nMain Events Content\nNotices\nPhoto View Header\nHeader Navigation\nDisplay Previous Page Navigation\n«\nPrevious Events\nDisplay Next Page Navigation\nNext Events\n»\n#tribe-events-header\nEvents Loop\nList of Events\n.tribe-events-photo-grid-sizer empty element, only used for element sizing\nEvent\nEvent Title\nFrench Swing Collective\nEvent Meta\nAugust 29 @ 8:00 pm\n-\n10:00 pm\n.tribe-events-event-meta\nEvent Content\nFrench Swing Collective falls under the umbrella of the French Horn Collective, created by Paris-born singer-songwriter and multi-instrumentalist Vincent Raffard. Seeking new rhythms and cross-cultural collaborations, Vincent assembled a group of world-class musicians from across the globe, and something magical took shape. PERFORMER BIO: French Swing Collective is a Miami-based…\n/.tribe-events-event-details\n/.tribe-events-photo-event-wrap\nEvent\nEvent Title\nThe Dirty Doors – A Tribute to The Doors\nEvent Meta\nAugust 30 @ 8:00 pm\n-\n10:00 pm\n.tribe-events-event-meta\nEvent Content\nThe Dirty Doors perform the songs of The Doors accurately and energetically. This four-piece band faithfully recreates the magic of a Doors concert in sound and stage presence with all the classic hits like “Light My Fire,” “Riders On The Storm,” “Hello, I Love You,” and “L.A. Woman” for audiences…\n/.tribe-events-event-details\n/.tribe-events-photo-event-wrap\nEvent\nEvent Title\nComedy Open Mic\nEvent Meta\nSeptember 2 @ 8:00 pm\n-\n10:30 pm\n|\nRecurring Event\n(See all)\nAn event every month that begins at 8:00 pm on day First of the month, repeating until December 31, 2025\n.tribe-events-event-meta\nEvent Content\nCall for comedians! Join us for Comedy Open Mic Night on the 1st Tuesday of the month. Open Mic Guidelines Tickets purchased online: $10 Tickets purchased through the Box Office: $15 A QR code will be provided upon arrival to facilitate online ticket purchases. Performers: FREE - Performer registration…\n/.tribe-events-event-details\n/.tribe-events-photo-event-wrap\nEvent\nEvent Title\nThe Art of laughter with Headliner Ahren Belisle ft. Michael Glatzmaier\nEvent Meta\nSeptember 5 @ 8:00 pm\n-\n10:00 pm\n.tribe-events-event-meta\nEvent Content\nAhren Belisle brings his \"Unmuted\" comedy tour to Arts Garage! Known for his sharp, quick wit, Ahren delivers hilarious insights on everything from dating to living with cerebral palsy—all while navigating life as a mute comedian. Using his phone to communicate, he breaks boundaries and brings a unique voice to…\n/.tribe-events-event-details\n/.tribe-events-photo-event-wrap\nEvent\nEvent Title\nSelwyn Birchwood Returns\nEvent Meta\nSeptember 6 @ 8:00 pm\n-\n10:00 pm\n.tribe-events-event-meta\nEvent Content\nBirchwood’s high-octane blues—at once deeply rooted, funky and up-to-the-minute—are played with passion and honest emotion. With his band feeding off his drive and exuberance, the striking 6’3″ young man with his trademark Afro roams the stage (often barefoot), ripping out memorable guitar licks with ease, his soulful, rocks-and-gravel vocals firing…\n/.tribe-events-event-details\n/.tribe-events-photo-event-wrap\nEvent\nEvent Title\nAll Arts Open Mic\nEvent Meta\nSeptember 9 @ 8:00 pm\n-\n10:30 pm\n|\nRecurring Event\n(See all)\nAn event every month that begins at 8:00 pm on day Second of the month, repeating until December 31, 2025\n.tribe-events-event-meta\nEvent Content\nCalling all artists, writers, or musicians looking for a spot in the limelight! Join us for All Arts Open Mic Night on the 2nd Tuesday of every month! If you’ve been working on a song, a poem, a rap, or a riff that you want to show off, this…\n/.tribe-events-event-details\n/.tribe-events-photo-event-wrap\nEvent\nEvent Title\nKemuel Roig\nEvent Meta\nSeptember 12 @ 8:00 pm\n-\n10:00 pm\n.tribe-events-event-meta\nEvent Content\nExperience an electrifying night of Latin jazz with the trio of Cuban-born virtuoso pianist Kemuel Roig, featuring extraordinary musicians José Majito Aguilera on percussion and Manuel Orza on bass. This dynamic ensemble blends Afro-Cuban rhythms, virtuosic piano improvisations, and deep musical synergy, delivering fresh interpretations of jazz classics and original…\n/.tribe-events-event-details\n/.tribe-events-photo-event-wrap\nEvent\nEvent Title\nThe Betty Fox Band Returns\nEvent Meta\nSeptember 13 @ 8:00 pm\n-\n10:00 pm\n.tribe-events-event-meta\nEvent Content\nWith an extensive background in gospel and a lifelong passion for soul music, Betty Fox has come a long way from her southern roots to headlining festivals and captivating thousands with her raw swagger and unwavering talent. Once the 2015 representative of the Suncoast Blues Society, an International Blues Challenge…\n/.tribe-events-event-details\n/.tribe-events-photo-event-wrap\nEvent\nEvent Title\nSpoken Word Open Mic: Poetry, Storytelling & Lyrics\nEvent Meta\nSeptember 16 @ 8:00 pm\n-\n10:30 pm\n|\nRecurring Event\n(See all)\nAn event every month that begins at 8:00 pm on day Third of the month, repeating until December 16, 2025\n.tribe-events-event-meta\nEvent Content\nInviting poets, storytellers & songwriters to share your original work with a supportive audience on the Arts Garage stage! Join us for Spoken Word Open Mic Night on the 3rd Tuesday of every month. Open Mic Guidelines Tickets purchased online: $10 Tickets purchased through the Box Office: $15 A QR…\n/.tribe-events-event-details\n/.tribe-events-photo-event-wrap\nEvent\nEvent Title\nBARELY MANILOW: The #1 Longest Running Tribute to Barry Manilow\nEvent Meta\nSeptember 19 @ 8:00 pm\n-\n10:00 pm\n.tribe-events-event-meta\nEvent Content\nOne of the best-selling artists of the 70’s comes to life in this tribute to the “Greatest Showman” in Adult Contemporary music, Barry Manilow. Barely Manilow pays homage to Barry with unique storytelling, spot on vocals and first-class instrumentation. You’ll be singing along to every top 10 hit from this…\n/.tribe-events-event-details\n/.tribe-events-photo-event-wrap\nEvent\nEvent Title\nBACHACO\nEvent Meta\nSeptember 20 @ 8:00 pm\n-\n10:00 pm\n.tribe-events-event-meta\nEvent Content\nBACHACO delivers an electrifying live show that fuses high-energy reggae, Afro-Caribbean rhythms, and Latin rock into an unforgettable bilingual experience. Fronted by Venezuelan singer-songwriter Eddy Morillo, the band’s dynamic performance invites audiences to dance, reflect, and celebrate cultural unity through groove. With powerful original songs like “SA SA SA,” “LOOSEN…\n/.tribe-events-event-details\n/.tribe-events-photo-event-wrap\nEvent\nEvent Title\nSunflower Soul: A Celebration of Susan’s Love for Music\nEvent Meta\nSeptember 21 @ 6:00 pm\n.tribe-events-event-meta\nEvent Content\nSunflower is a playful, creative learning community—and a shining model of what education can be—right here in Delray Beach, FL! We empower kids and families to grow confident, curious, and compassionate through hands-on experiences in play, nature, and the arts. Our programs support early childhood, parenting, and reach under-resourced students…\n/.tribe-events-event-details\n/.tribe-events-photo-event-wrap\nEvent\nEvent Title\nEric Johanson\nEvent Meta\nSeptember 26 @ 8:00 pm\n-\n10:00 pm\n.tribe-events-event-meta\nEvent Content\nEric Johanson (New Orleans) stands at the forefront of modern blues music with his groundbreaking album, The Deep and the Dirty. Released on Ruf Records, his album skyrocketed to #1 on the Billboard Blues charts, cementing Johanson's status as a trailblazing force in contemporary blues and rock music. His electrifying…\n/.tribe-events-event-details\n/.tribe-events-photo-event-wrap\nEvent\nEvent Title\nWOR – A Tribute to the Women of Rock\nEvent Meta\nSeptember 27 @ 8:00 pm\n-\n10:00 pm\n.tribe-events-event-meta\nEvent Content\n﻿ Women of Rock Tribute is more than a show—it’s a riotous, reverent, high-octane love letter to the women who made rock louder, bolder, and unforgettable. PERFORMER BIO: The Women of Rock Tribute Turns Up the Volume on a Legacy of Legends. If you were ever moved by the raw…\n/.tribe-events-event-details\n/.tribe-events-photo-event-wrap\nEvent\nEvent Title\nThe Art of Laughter with Headliner Tom Briscoe ft. Richie Minervini\nEvent Meta\nOctober 3 @ 8:00 pm\n-\n10:00 pm\n.tribe-events-event-meta\nEvent Content\nTom Briscoe's show is a clever, clean one-person comedy show about his futile quest for generational and cultural harmony. \"It's Not Mansplaining; It's Old Mansplaining\" with Tom Briscoe is a hilarious celebration of getting older and how to enjoy the ride of the generational divide. Tom Briscoe is a Florida…\n/.tribe-events-event-details\n/.tribe-events-photo-event-wrap\nEvent\nEvent Title\nRamble On: The Mighty Zeppelin\nEvent Meta\nOctober 4 @ 8:00 pm\n-\n10:00 pm\n.tribe-events-event-meta\nEvent Content\nBrace yourself for the thunderous sound and raw energy of **Ramble On**, the nation’s premier Led Zeppelin tribute, featuring elite musicians from the world-renowned Classic Albums Live series. This powerhouse act captures the look, feel, and electrifying stage presence of the real Zeppelin, delivering note-perfect performances that transport fans straight…\n/.tribe-events-event-details\n/.tribe-events-photo-event-wrap\nEvent\nEvent Title\nPhil Varca & The SlamJammers\nEvent Meta\nOctober 5 @ 7:00 pm\n-\n8:30 pm\n.tribe-events-event-meta\nEvent Content\n2025 marks 36 years together for this New York-based 3-piece rockin' blues band whose Stevie Ray Vaughan/Hendrix influences can be easily recognized. While the bands typical critically acclaimed \"concert set\" includes almost all original music plus a few songs which pay tribute to those who have inspired them ...at…\n/.tribe-events-event-details\n/.tribe-events-photo-event-wrap\nEvent\nEvent Title\nComedy Open Mic\nEvent Meta\nOctober 7 @ 8:00 pm\n-\n10:30 pm\n|\nRecurring Event\n(See all)\nAn event every month that begins at 8:00 pm on day First of the month, repeating until December 31, 2025\n.tribe-events-event-meta\nEvent Content\nCall for comedians! Join us for Comedy Open Mic Night on the 1st Tuesday of the month. Open Mic Guidelines Tickets purchased online: $10 Tickets purchased through the Box Office: $15 A QR code will be provided upon arrival to facilitate online ticket purchases. Performers: FREE - Performer registration…\n/.tribe-events-event-details\n/.tribe-events-photo-event-wrap\nEvent\nEvent Title\nStray Dogs\nEvent Meta\nOctober 10 @ 8:00 pm\n-\n10:00 pm\n.tribe-events-event-meta\nEvent Content\nAnother Great Tribute Band courtesy of Tom Porter The \"core four\" have been together for more than a decade (Ken - vocals, Lou - Guitar, Tom - Bass, Peter - Drums) and have performed hundreds of shows. They are joined by the uniquely talented guitarist & vocalist Tim D'Andrea, and…\n/.tribe-events-event-details\n/.tribe-events-photo-event-wrap\nEvent\nEvent Title\nThe Café on Main by Jeff Perlman 2pm\nEvent Meta\nOctober 11 @ 2:00 pm\n-\n4:00 pm\n.tribe-events-event-meta\nEvent Content\n﻿ The Café on Main is a play about love. The play takes place in a Long Island café run by a world-wise proprietor who watches life unfold at a prime table. Inspired by the song “Moon River”, The Café on Main speaks to the mysteries of love and life,…\n/.tribe-events-event-details\n/.tribe-events-photo-event-wrap\nEvent\nEvent Title\nThe Café on Main by Jeff Perlman 8pm\nEvent Meta\nOctober 11 @ 8:00 pm\n-\n10:00 pm\n.tribe-events-event-meta\nEvent Content\nThe Café on Main is a play about love. The play takes place in a Long Island café run by a world-wise proprietor who watches life unfold at a prime table. Inspired by the song “Moon River”, The Café on Main speaks to the mysteries of love and life, the…\n/.tribe-events-event-details\n/.tribe-events-photo-event-wrap\nEvent\nEvent Title\nFrank Vignola & Vinny Raniolo\nEvent Meta\nOctober 12 @ 7:00 pm\n-\n8:30 pm\n.tribe-events-event-meta\nEvent Content\nFrank Vignola’s stunning virtuosity has made him the guitarist of choice for many of the world's top musicians, including Ringo Starr, Madonna, Donald Fagen, Wynton Marsalis, Tommy Emmanuel, Mark O'Connor, Boston Pops, New York Pops, and guitar legend Les Paul, who named Vignola to his \"Five Most Admired Guitarists List\"…\n/.tribe-events-event-details\n/.tribe-events-photo-event-wrap\nEvent\nEvent Title\nAll Arts Open Mic\nEvent Meta\nOctober 14 @ 8:00 pm\n-\n10:30 pm\n|\nRecurring Event\n(See all)\nAn event every month that begins at 8:00 pm on day Second of the month, repeating until December 31, 2025\n.tribe-events-event-meta\nEvent Content\nCalling all artists, writers, or musicians looking for a spot in the limelight! Join us for All Arts Open Mic Night on the 2nd Tuesday of every month! If you’ve been working on a song, a poem, a rap, or a riff that you want to show off, this…\n/.tribe-events-event-details\n/.tribe-events-photo-event-wrap\nEvent\nEvent Title\nJazz & Java: Latin Jazz – Rhythms and Musicians\nEvent Meta\nOctober 16 @ 10:00 am\n-\n11:30 am\n.tribe-events-event-meta\nEvent Content\nJoin Professor Richard Lowenthal as he presents Latin music starting with Spanish song forms, African rhythms and harmonies, and influences from Cuba, Brazil and many Caribbean rhythms. He will demonstrate how they combined with American ballad and blues, jazz and rock, and other contemporary forms. There will be several…\n/.tribe-events-event-details\n/.tribe-events-photo-event-wrap\nEvent\nEvent Title\nNicole Henry Returns – Friday\nEvent Meta\nOctober 17 @ 8:00 pm\n-\n10:00 pm\n.tribe-events-event-meta\nEvent Content\nNicole Henry is no stranger to the Arts Garage family, and on October 17 & 18, this South Florida favorite will return with her newest show that’s filled with jazz to classic soul, and a sprinkling of everything in between. All About Jazz proclaims, “Henry is a vocalist of beautiful…\n/.tribe-events-event-details\n/.tribe-events-photo-event-wrap\n.tribe-events-photo-gutter-sizer empty element, only used for element sizing\n.tribe-events-loop\nList Footer\nFooter Navigation\nDisplay Previous Page Navigation\n«\nPrevious Events\nDisplay Next Page Navigation\nNext Events\n»\n#tribe-events-footer\n+ Export Events\n#tribe-events-content\n#tribe-events-content-wrapper\n#tribe-events\nThis calendar is powered by The Events Calendar.\nhttp://evnt.is/18wn",
      "emails": [
        "info@artsgarage.org",
        "mackay@newhavenfuneralsnq.com.au"
      ]
    },
    {
      "url": "https://artsgarage.org/staff/",
      "is_candidate": false,
      "has_email": true,
      "text": "<div class=\"space-10\"></div><p>\t“Every expression of art represents a diversity of cultures and experiences. When we provide our community the opportunity and access to arts programming, we create a vehicle for transformation — for individuals, for communities, and for the globe.”\n\t\n<strong>–Marjorie Waldo, President and CEO, Arts Garage</strong></p>\nMeet Our Staff\nMarjorie Waldo\nPresident & CEO\nSee Bio\nSuzanne Haley\nHouse Manager\nKatlyn Menjivar\nChief Administrator\nDarius Ward\nContract & Facility Manager\nNaja Hardmon\nArt Curator\nSeth Weaver\nMarketing Director\nKeyshliany Pérez\nMarketing Coordinator\nLatifah AlSaad\nGraphic Designer\nAdriana Gioeni\nGraphic Designer\nMichelle Diaz\nArtistic Director of Theatre\nMary Ann Canuso\nGroup Sales Manager & Box Office\nAndrea Gomez\nVolunteer Coordinator & Box Office\nNarcisse Wilson\nBox Office\nJoseph Montagnino\nAssistant House\nKaren King\nBartender\nFaith Joyce\nMarketing Assistant\nFrancesca Peuguero\nAdmin & Programming Assistant\nIzmira Santiago\nDirector of Development & Community Engagement\nLori Estrella-Auger\nAssistant House",
      "emails": [
        "info@artsgarage.org",
        "mackay@newhavenfuneralsnq.com.au"
      ]
    },
    {
      "url": "https://artsgarage.org/board-of-directors/",
      "is_candidate": false,
      "has_email": true,
      "text": "Richard Lowenthal, Chair\nDick Lowenthal has been a Jazz Educator for over 50 years. He was Chair and founder of the prestigious Jazz Department at the Manhattan School of Music and developed the Jazz Department at New Jersey City University, where he is a Professor Emeritus. He received a Bachelor of Music from the The University of Michigan and a Masters in Trumpet from the Juilliard School of Music. He was Vice-President of the International Association of Jazz Educators and chair of the National Music Council. As a performer Dick has played with Clark Terry, Bill Watrous, Mel Torme, Tony Bennett, Nancy Wilson, and Cher. He has conducted the Special Unit of the Glenn Miller Orchestra on tours of Japan, Poland, cruise ships, Presidential functions and the Tony Awards. Dick started the very successful Adult Education Program at Arts Garage that is called Jazz and Java. He became Chair of Arts Garage in October of 2023.\n<div class=\"d-flex social-client\">\n\t\t\t\t\t\t\t\t\t<a href=\"\" target=\"_blank\" style=\"background:#023e8a;\"><i class=\"fa fa-facebook\"></i></a>\n\t\t\t\t\t\t\t\t\t<a href=\"\" target=\"_blank\" style=\"background:#34b5d0;\"><i class=\"fa fa-twitter\"></i></a>\n\t\t\t\t\t\t\t\t</div>\nSteven G. Rappaport, Vice Chair\nSteven G. Rappaport is an Equity Partner in the Community Associations Practice Group at Sachs Sax Caplan Law Firm. With extensive experience spanning over two decades, Mr. Rappaport handles transactional matters for the firm’s community association clients, including drafting amendments to governing documents, attending Board meetings and elections, handling covenant enforcement disputes, and providing opinions on all aspects of association issues. Admitted to the Bar in Florida in 2003 and in the District of Columbia in 2001, Steven obtained his J.D. from Georgetown University Law Center, where he actively contributed to esteemed legal publications. He graduated magna cum laude with a B.A. in Political Science from the University of Florida in 1998.\nIn addition to his legal practice, Steven has served as a Board Member and Committee Chair for several organizations including the Palm Beach County Fair Housing and Equal Employment Board, South Palm Beach County Bar Association, and Community Associations Institute (CAI) Florida Legislative Alliance.\n<div class=\"d-flex social-client\">\n\t\t\t\t\t\t\t\t\t<a href=\"\" target=\"_blank\" style=\"background:#023e8a;\"><i class=\"fa fa-facebook\"></i></a>\n\t\t\t\t\t\t\t\t\t<a href=\"\" target=\"_blank\" style=\"background:#34b5d0;\"><i class=\"fa fa-twitter\"></i></a>\n\t\t\t\t\t\t\t\t</div>\nMark Burns, Secretary\nMark Burns is the Chief Operating Officer at BlueIvy Communications, a Delray Beach-based boutique communications and public relations agency with offices in West Palm Beach and Delray Beach. Originally from Baltimore, Maryland, Mark moved to Delray Beach in 2014 and was the owner-operator of an Orangetheory Fitness Studio before joining BlueIvy in 2016. Mark is a member of the Impact 100 Men of Palm Beach County and Former Chair and current Advisory Committee member of WiseTribe. Mark is a co-founder of Delray Beach-basedrunning group, Pineapple Run Crew, and in 2022 served as the Volunteer Team Manager at the World Maccabi Games in Israel. He is also a member of the Greater Delray Beach Chamber of Commerce and the Palm Beach Chamber of Commerce. Combining his love of live music and the arts with a passion for improving the local community, Mark became a board member of the Arts Garage in 2023.\n<div class=\"d-flex social-client\">\n\t\t\t\t\t\t\t\t\t<a href=\"\" target=\"_blank\" style=\"background:#023e8a;\"><i class=\"fa fa-facebook\"></i></a>\n\t\t\t\t\t\t\t\t\t<a href=\"\" target=\"_blank\" style=\"background:#34b5d0;\"><i class=\"fa fa-twitter\"></i></a>\n\t\t\t\t\t\t\t\t</div>\nJack Varsalona, Treasurer\nJack recently retired as President of Wilmington University in Delaware. He holds a BA, MA and Ph.D. from the University of Delaware. From 1975-78, he was Principal of Ursuline Academy, a prominent Catholic school in Wilmington. He was then Director of Development at the University of Delaware from 1978-81 and served as an education aide in the cabinet of former Delaware governor, Pete DuPont. Before becoming 3rd president of then Wilmington College, Jack was a professor and then Executive Vice President for Academic and Student Affairs. He was quickly promoted to EVP and Provost and in 2005 was elected President by the Board of Trustees. During his tenure, Wilmington College became a University, enrollment doubled, three new campuses were opened, and partnerships with community colleges in NJ, MD and Delaware were developed to provide a “feeder” system. He has served on the boards of a variety of organizations and has won numerous awards for his community leadership.\n<div class=\"d-flex social-client\">\n\t\t\t\t\t\t\t\t\t<a href=\"\" target=\"_blank\" style=\"background:#023e8a;\"><i class=\"fa fa-facebook\"></i></a>\n\t\t\t\t\t\t\t\t\t<a href=\"\" target=\"_blank\" style=\"background:#34b5d0;\"><i class=\"fa fa-twitter\"></i></a>\n\t\t\t\t\t\t\t\t</div>\nChuck Halberg, Director\nChuck Halberg began his career in construction in Michigan in 1975 and has been a resident of Florida since 1980 and a Florida Licensed General Contractor since 1986.  A South Florida Construction Management Executive, Chuck has worked for three different top 200 National Builders and has overseen the construction of over 2500 residential units, 3500 apartments, a ten-story high rise, 800,000 square feet of commercial space and a 220-bed nursing home.  Chuck has many personal strengths in business relations including product development, budget management, quality control, and customer satisfaction.\nChuck has been active in the Delray Beach community since 1991, serving as a volunteer and supporting many Non-Profits including Delray Citizens for Delray Police, the Achievement Center for Children & Families, The Miracle League, The Spady Museum, The Delray Beach Chamber of Commerce and many others. In addition, he has been on various City of Delray Boards including the Affordable Housing Board and the Planning and Zoning Board among others.\n<div class=\"d-flex social-client\">\n\t\t\t\t\t\t\t\t\t<a href=\"\" target=\"_blank\" style=\"background:#023e8a;\"><i class=\"fa fa-facebook\"></i></a>\n\t\t\t\t\t\t\t\t\t<a href=\"\" target=\"_blank\" style=\"background:#34b5d0;\"><i class=\"fa fa-twitter\"></i></a>\n\t\t\t\t\t\t\t\t</div>\nSusan Owens, Director\nSusan, a Delray Beach resident who maintains a home in her native state of New Jersey, is currently President and Managing Member of several real estate partnerships.\nSusan has had a passion for the Arts since early childhood. Her summers were spent in varying Arts programs from Interlochen, Michigan to The Aspen Music Festival in Colorado. She worked as a freelance musician in New York City after graduating with a Bachelor’s of Music degree from the University of Michigan in Ann Arbor.\nA firm believer in both the positive and powerful impact of the Arts on society, Susan feels very lucky to have been both an employee and supporter at City Center Theater in NYC. Following her passion for helping people raise awareness and civil rights, Susan has served as a National Board member of Lambda Legal, as well as Chaired numerous annual Fundraisers having helped raise hundreds of thousands of dollars.\n<div class=\"d-flex social-client\">\n\t\t\t\t\t\t\t\t\t<a href=\"\" target=\"_blank\" style=\"background:#023e8a;\"><i class=\"fa fa-facebook\"></i></a>\n\t\t\t\t\t\t\t\t\t<a href=\"\" target=\"_blank\" style=\"background:#34b5d0;\"><i class=\"fa fa-twitter\"></i></a>\n\t\t\t\t\t\t\t\t</div>\nRobin Greene, Director\nRobin Greene has devoted her life to Special Education with children from 0 to 3 year old in classrooms and privately in New York and South Florida.\nRobin loves music and even includes music in many of her sessions with children.  She finds that music is one of the best ways to reach people of all ages and make them happy.  Children learn words through music and improve their social skills.\nRobin grew up in a musical  family – her mother was a singer and both her parents believed strongly in the arts and culture.\nRobin and her husband Stephen love giving back to their community.  Their family supports the Miracle League and other organizations including Arts Garage.  Robin loves what Arts Garage brings to others – smiling faces, dancing and the enjoyment the shows bring.  Robin is passionate about music and about Arts Garage.\n<div class=\"d-flex social-client\">\n\t\t\t\t\t\t\t\t\t<a href=\"\" target=\"_blank\" style=\"background:#023e8a;\"><i class=\"fa fa-facebook\"></i></a>\n\t\t\t\t\t\t\t\t\t<a href=\"\" target=\"_blank\" style=\"background:#34b5d0;\"><i class=\"fa fa-twitter\"></i></a>\n\t\t\t\t\t\t\t\t</div>\nElise Rubenstein, Director\nAs a Board member of the Jewish Community Center in Baltimore for 15 years, I have planned events, been involved with fundraising, sat on Nominating Committees and other strategic planning for the Center. Presently, I am the Chair of Governance, with a committee of 12 people that work on issues around Board Engagement, Vision and Mission statements, Nominating and DEI. Our JCC has a 500-person performance theater, and I have been involved with decision making around programming, capital improvements and staffing.\nI have also been involved with the Walter’s Art Museum in Baltimore. I was a member of the Women’s Committee, which was responsible for creating and running fundraising event for the Museum.\nMy husband and I are also supporters of the Freeman Stage, which is a 4,000-person venue near our home in Delaware. We love the arts and feel its important to support the venues where we live! So thrilled to be a part of the Arts Garage Family and support their amazing efforts to advance all the arts in Delray!\n<div class=\"d-flex social-client\">\n\t\t\t\t\t\t\t\t\t<a href=\"\" target=\"_blank\" style=\"background:#023e8a;\"><i class=\"fa fa-facebook\"></i></a>\n\t\t\t\t\t\t\t\t\t<a href=\"\" target=\"_blank\" style=\"background:#34b5d0;\"><i class=\"fa fa-twitter\"></i></a>\n\t\t\t\t\t\t\t\t</div>\nJohn Engle, Director\nJohn embarked on a dynamic journey within IT and software development over 40 years ago. With a distinguished 24-year tenure at a single company, he joined a young startup of about 190 people and contributed to its growth into a global leader with over 13,000 employees after a major merger. Beginning in Quality Assurance, John honed his skills in product excellence and reliability, then advanced through roles as a product analyst, product manager, and people manager. His keen understanding of market needs, user experience, and unique “outside the box” approach drove successful product launches and enhancements that propelled the company’s growth.\nIn addition to his corporate achievements, John has dedicated himself to community leadership. He served for three years as the President of the Cannery Row HOA board, fostering community engagement and effective governance. Now in a semi-retired capacity, John channels his passion for innovation into real estate investing and development, leveraging his extensive leadership experience to create and enhance communities beyond the digital realm.\n<div class=\"d-flex social-client\">\n\t\t\t\t\t\t\t\t\t<a href=\"\" target=\"_blank\" style=\"background:#023e8a;\"><i class=\"fa fa-facebook\"></i></a>\n\t\t\t\t\t\t\t\t\t<a href=\"\" target=\"_blank\" style=\"background:#34b5d0;\"><i class=\"fa fa-twitter\"></i></a>\n\t\t\t\t\t\t\t\t</div>\nPatricia Glass Schuman, Director\nPatricia Glass Schuman, librarian, publisher, artist, and free speech activist, co-founded Neal-Schuman Publishers with John Vincent Neal. Pat is a graduate of the University of Cincinnati and Columbia University. She was the first woman elected Treasurer of the American Library Association and was later elected its President.\nA founder of ALA’s Advocacy Network and the Neal-Schuman Foundation, Pat also served as Chair of the New York Metropolitan Reference and Research Library Agency (METRO) and held board positions with Friends of Libraries U.S.A., the Trejo Foster Foundation, and the New York University Publishing Center.\nHer advocacy work has led to appearances on more than 70 radio and television programs, including a feature on Washington Week in Review. The author or editor of five books and over 100 journal articles, she has lectured nationally and internationally, testified before the U.S. Congress, and served as a visiting professor at numerous universities.\nHer many honors include the ALA Equality Award, the Joseph W. Lippincott Award, and Distinguished Alumni Awards from both the University of Cincinnati and Columbia University. She recently received the American Library Association’s highest honor, Honorary Membership. Pat was also recently featured as an emerging artist at Arts Garage.\n<div class=\"d-flex social-client\">\n\t\t\t\t\t\t\t\t\t<a href=\"\" target=\"_blank\" style=\"background:#023e8a;\"><i class=\"fa fa-facebook\"></i></a>\n\t\t\t\t\t\t\t\t\t<a href=\"\" target=\"_blank\" style=\"background:#34b5d0;\"><i class=\"fa fa-twitter\"></i></a>\n\t\t\t\t\t\t\t\t</div>\nRonnie Dunayer, Ex-Officio\nRonnie is a Professional Golf Instructor. Over the past 20 years, she has devoted herself to the sport of golf as an instructor, sports psychologist, and event planner, and she has taught in South Florida for nearly a decade. Her experience includes coordinating specialized programs for adults and junior golfers as well as for people with various disabilities. A graduate of Adelphi University, she earned a Master’s Degree in Psychology and specialized in working with athletes. The blending of technical and mechanical knowledge combined with an understanding of the mental components of the sport contributes to her success rate with varied students.\n<div class=\"d-flex social-client\">\n\t\t\t\t\t\t\t\t\t<a href=\"\" target=\"_blank\" style=\"background:#023e8a;\"><i class=\"fa fa-facebook\"></i></a>\n\t\t\t\t\t\t\t\t\t<a href=\"\" target=\"_blank\" style=\"background:#34b5d0;\"><i class=\"fa fa-twitter\"></i></a>\n\t\t\t\t\t\t\t\t</div>\nLynn Ferguson, Ex-Officio\nA Northwestern University graduate, Lynn received a master’s degree from the University of Detroit, After more than 30 years of teaching high school mathematics in Michigan, she retired and moved to Orlando Florida, where she finally had time to pursue her lifelong love of oil painting. There, she joined the Central Florida Women’s League in 2002 and served on the Service Committee, Scholarship Committee, Fundraising Committee, and Arts and Culture Committee, which she co-chaired, She also co-chaired the golf tournament fundraiser for two years and served as the league president in 2007; she was on the Foundation board for the next three years. In addition, Lynn co-founded and was president of the “Friends of Orlando Ballet.” There she grew the “Friends” to a membership of 150 and was responsible for raising approximately $60,000 a year. Lynn started the Arts Garage Guild in October 2011 and, as president, has built the membership to more than 230 members. She has also served on the Board of Directors of the Arts Garage since its inception in October 2011.\n<div class=\"d-flex social-client\">\n\t\t\t\t\t\t\t\t\t<a href=\"\" target=\"_blank\" style=\"background:#023e8a;\"><i class=\"fa fa-facebook\"></i></a>\n\t\t\t\t\t\t\t\t\t<a href=\"\" target=\"_blank\" style=\"background:#34b5d0;\"><i class=\"fa fa-twitter\"></i></a>\n\t\t\t\t\t\t\t\t</div>\nPaula Tishok, Director\nPaula Tishok brings a wealth of leadership and nonprofit governance experience across the arts, healthcare, and education sectors. With a professional background that spans Westin Hotels, Westinghouse Electric Corporation, and Tenet Healthcare, Tishok has consistently held senior roles in financial operations and strategic planning.\nA lifelong supporter of the arts and education, she has served on the boards of The Studios of Key West, Wilson College, and the Alumnae Association of Wilson College, among others. Since relocating to Delray Beach from Key West last year, she has quickly immersed herself in the city’s dynamic and flourishing arts landscape.\n<div class=\"d-flex social-client\">\n\t\t\t\t\t\t\t\t\t<a href=\"\" target=\"_blank\" style=\"background:#023e8a;\"><i class=\"fa fa-facebook\"></i></a>\n\t\t\t\t\t\t\t\t\t<a href=\"\" target=\"_blank\" style=\"background:#34b5d0;\"><i class=\"fa fa-twitter\"></i></a>\n\t\t\t\t\t\t\t\t</div>\nDavid Plaza, Director\nDavid Plaza is a Managing Director and Wealth Management Advisor with Merrill Lynch Wealth Management. With nearly four decades of experience in the financial services industry, Plaza holds both the Certified Private Wealth Advisor® and CERTIFIED FINANCIAL PLANNER® designations. He has earned numerous accolades, including multiple placements on Forbes’ “Best-in-State Wealth Advisors” and Barron’s “Top 1,200 Financial Advisors” lists.\nPlaza is a passionate advocate for the arts, having served on the boards of numerous cultural and educational institutions. His civic contributions include leadership roles with the Philadelphia Film Society, the Delaware Symphony Orchestra, the Wilmington Music School, and the Art Consortium of Delaware. He has also supported education through his board work with Ursuline Academy and has been recognized with the Paul Harris Fellow Award for his service with the Wilmington Rotary. A seasoned community builder, Plaza was also the founder and former president of the Wilmington Business Group.\n<div class=\"d-flex social-client\">\n\t\t\t\t\t\t\t\t\t<a href=\"\" target=\"_blank\" style=\"background:#023e8a;\"><i class=\"fa fa-facebook\"></i></a>\n\t\t\t\t\t\t\t\t\t<a href=\"\" target=\"_blank\" style=\"background:#34b5d0;\"><i class=\"fa fa-twitter\"></i></a>\n\t\t\t\t\t\t\t\t</div>",
      "emails": [
        "info@artsgarage.org",
        "mackay@newhavenfuneralsnq.com.au"
      ]
    },
    {
      "url": "https://artsgarage.org/annual-members-2/",
      "is_candidate": false,
      "has_email": true,
      "text": "Become an Annual Member",
      "emails": [
        "info@artsgarage.org",
        "mackay@newhavenfuneralsnq.com.au"
      ]
    }
  ],
  "all_links": [
    "https://artsgarage.org/event/nicole-henry-returns-friday/",
    "https://artsgarage.org/defendthearts/",
    "https://artsgarage.org/category/board-spotlight/",
    "http://artsgarage.org/",
    "https://artsgarage.org/email-sign-up/",
    "https://artsgarage.org/call-to-artists/",
    "https://artsgarage.org/blog/",
    "http://artsgarage.org/events/category/events/comedy/",
    "https://artsgarage.org/sponsors/",
    "https://artsgarage.org/category/general-news/",
    "https://artsgarage.org/category/meet-our-staff/",
    "https://artsgarage.org/event/all-arts-open-mic-night-44/2025-09-09/",
    "https://artsgarage.org/media/",
    "https://artsgarage.org/event/eric-johanson-2/",
    "https://artsgarage.org/group-rates/",
    "https://artsgarage.org/category/blog/",
    "mailto:info@artsgarage.org",
    "https://artsgarage.org/events/",
    "https://artsgarage.org/event/jazz-java-latin-jazz-rhythms-and-musicians/",
    "https://artsgarage.org/event/bachaco/",
    "https://artsgarage.org/event/barely-manilow-the-1-longest-running-tribute-to-barry-manilow/",
    "https://artsgarage.org/marjories-minutes-august-2025/",
    "https://artsgarage.org/category/volunteer-spotlight/",
    "https://artsgarage.org/heartfelt-2/",
    "https://artsgarage.org/event/selwyn-birchwood-returns-3/",
    "https://artsgarage.org/about/",
    "https://artsgarage.org/category/art-exhibits/",
    "https://artsgarage.org/event/frank-vignola-vinny-raniolo/",
    "https://artsgarage.org/youth-classes-2/",
    "https://artsgarage.org/sponsor-an-event/",
    "https://artsgarage.org/event/sunflower-soul-a-celebration-of-susans-love-for-music/",
    "https://artsgarage.org/air-series/",
    "https://artsgarage.org/event/comedy-night-36/2025-10-07/",
    "https://artsgarage.org/event/all-arts-open-mic-night-44/2025-10-14/",
    "https://artsgarage.org/event/the-cafe-on-main-by-jeff-perlman-8pm/",
    "https://artsgarage.org/employment-opportunities/",
    "http://artsgarage.org/events/",
    "https://artsgarage.org/from-our-hearts-to-your-homes-storytime-with-chris-bell/",
    "https://artsgarage.org/does-music-make-you-smarter/",
    "https://artsgarage.org/event/ramble-on-the-mighty-zeppelin/",
    "https://artsgarage.org/donations/",
    "https://artsgarage.org/photos/",
    "https://artsgarage.org/exhibits/",
    "https://artsgarage.org/adult-classes/",
    "https://artsgarage.org/event/the-art-of-laughter-with-headliner-tom-briscoe-ft-richie-minervini/",
    "https://artsgarage.org/performance-submissions/",
    "https://artsgarage.org/category/marjories-minutes/",
    "https://artsgarage.org/event/the-cafe-on-main-by-jeff-perlman/",
    "https://artsgarage.org/celebrating-legacy/",
    "https://artsgarage.org/hotels/",
    "https://artsgarage.org/event/stray-dogs-2/",
    "https://artsgarage.org/directions/",
    "https://artsgarage.org/staff/",
    "https://artsgarage.org/membership/",
    "https://artsgarage.org/world-photography-day/",
    "https://artsgarage.org/facility-rental/",
    "https://artsgarage.org/internship-program/",
    "https://artsgarage.org/donor/virginia-harvey-kimmel/",
    "https://artsgarage.org/employee-spotlight-august-2025/",
    "https://artsgarage.org/faqs/",
    "https://artsgarage.org/event/comedy-night-36/2025-09-02/",
    "https://artsgarage.org/",
    "https://artsgarage.org/event/the-art-of-laughter-with-headliner-ahren-belisle-ft-michael-glatzmaier/",
    "https://artsgarage.org/event/kemuel-roig/",
    "https://artsgarage.org/event/the-betty-fox-band-returns/",
    "https://artsgarage.org/classes/",
    "https://artsgarage.org/event/french-swing-collective/",
    "https://artsgarage.org/celebrating-legacy-photo-book/",
    "https://artsgarage.org/gallery-spotlight/",
    "https://artsgarage.org/partner-program/",
    "https://artsgarage.org/news/",
    "https://artsgarage.org/board-of-directors/",
    "https://artsgarage.org/art-gallery/",
    "https://artsgarage.org/seating-chart/",
    "https://artsgarage.org/from-our-hearts-to-your-homes-story-time-with-chief-javaro-sims/",
    "https://artsgarage.org/event/phil-varca-and-the-slam-jammers/",
    "https://artsgarage.org/art-submissions/",
    "https://artsgarage.org/event/comedy-night-36/all/",
    "https://artsgarage.org/bar-menu/",
    "https://artsgarage.org/event/the-dirty-doors-a-tribute-to-the-doors-2/",
    "https://artsgarage.org/annual-members-2/",
    "https://artsgarage.org/event/spoken-word-open-mic-poetry-storytelling-lyrics/2025-09-16/",
    "https://artsgarage.org/support/",
    "https://artsgarage.org/event/spoken-word-open-mic-poetry-storytelling-lyrics/all/",
    "https://artsgarage.org/get-in-touch/",
    "https://artsgarage.org/events/category/places/",
    "https://artsgarage.org/event/wor-a-tribute-women-of-rock/",
    "https://artsgarage.org/volunteer/",
    "https://artsgarage.org/category/featured/",
    "https://artsgarage.org/events/?ical=1",
    "https://artsgarage.org/event/all-arts-open-mic-night-44/all/",
    "https://artsgarage.org/call-to-submissions-delray-stories-fighting-for-freedom/",
    "https://artsgarage.org/band-of-angels/",
    "https://artsgarage.org/accessibility/",
    "https://artsgarage.org/category/donor-spotlight/",
    "https://artsgarage.org/category/news-notes/",
    "https://artsgarage.org/annual-report-2024/",
    "https://artsgarage.org/our-staff/marjorie-waldo/",
    "http://artsgarage.org/events/category/events/theatre",
    "https://artsgarage.org/marjories-minutes-december-2023-2/"
  ],
  "candidate_links": [
    "https://artsgarage.org/category/board-spotlight/",
    "https://artsgarage.org/call-to-artists/",
    "https://artsgarage.org/category/meet-our-staff/",
    "https://artsgarage.org/event/jazz-java-latin-jazz-rhythms-and-musicians/",
    "https://artsgarage.org/about/",
    "https://artsgarage.org/sponsor-an-event/",
    "http://artsgarage.org/events/",
    "https://artsgarage.org/staff/",
    "https://artsgarage.org/board-of-directors/",
    "https://artsgarage.org/annual-members-2/",
    "https://artsgarage.org/events/?ical=1"
  ],
  "visited": [
    "http://artsgarage.org/",
    "http://artsgarage.org/about",
    "http://artsgarage.org/contact",
    "http://artsgarage.org/staff",
    "http://artsgarage.org/team",
    "http://artsgarage.org/board",
    "http://artsgarage.org/directory",
    "http://artsgarage.org/events",
    "http://artsgarage.org/sitemap.xml",
    "http://artsgarage.org/council",
    "http://artsgarage.org/leadership",
    "http://artsgarage.org/management",
    "http://artsgarage.org/producers",
    "http://artsgarage.org/support",
    "http://artsgarage.org/crew",
    "http://artsgarage.org/members",
    "http://artsgarage.org/bios",
    "http://artsgarage.org/people",
    "http://artsgarage.org/artists",
    "http://artsgarage.org/musicians",
    "http://artsgarage.org/faculty",
    "http://artsgarage.org/administration",
    "https://artsgarage.org/category/board-spotlight/",
    "https://artsgarage.org/call-to-artists/",
    "https://artsgarage.org/category/meet-our-staff/",
    "https://artsgarage.org/event/jazz-java-latin-jazz-rhythms-and-musicians/",
    "https://artsgarage.org/about/",
    "https://artsgarage.org/sponsor-an-event/",
    "http://artsgarage.org/events/",
    "https://artsgarage.org/staff/",
    "https://artsgarage.org/board-of-directors/",
    "https://artsgarage.org/annual-members-2/",
    "https://artsgarage.org/events/?ical=1"
  ],
  "base_url": "http://artsgarage.org/"
}