{
  "pages": [
    {
      "url": "http://www.athleticmotiongolfclub.com/memberships",
      "is_candidate": false,
      "has_email": true,
      "text": "Club membership\nTour Membership\nHourly Rental\nComparison\nFAQ\nContact\nLogin\nJoin\nJoin Now To Save\nNo initiation fee\n$2,500\nSelect the membership option below that fits you best to seize this limited-time offer.\nFounder's Special\nThank you for considering joining the AMGC family.  We’d like to give you a gift to help make this an easy decision for you and your game.\n$2,500\nWe’re waiving the $2,500 initiation fee!  We won’t be able to do this for long, so be sure to take advantage it’s available.\nYou've Got Options\nWe want you to have options because one size doesn't fit all. Compare the different membership plans below. Then choose the best fit for you.\nMost Popular\nCLUB Memberships\nThe CLUB Membership is perfect for golfers who enjoy playing their game into shape.  Get situational practice and play without spending countless hours beating balls outdoors. Tap the button below to join and create your account.\nSchedule up to 3 hrs at a time\nHave up to 3 hrs at any time reserved in the simulator bays.\nPractice, play, and compete\nPlay and practice on world-famous courses. Compete in our local and national tournaments without ever having to pack a bag or book a flight.\nPriority lessons and discounts\nSchedule private lessons with Shaun and Mike, and receive member pricing on lessons with our certified instructors and fitters.\nCLUB Membership - Monthly\nThis is a monthly membership\n$297\n/mo\nIncludes:\nDaily access\nUp to 3 hrs Booking\nNo simulator fees\nClub & ball data\nVideo analysis\nAMG lesson priority\nLesson discounts\n8 guests/mo\nTournament access\nPrice lock guarantee\nMonthly Join Here\nCLUB Membership - Yearly\nThis is an annual membership\n$2,997\n/yr\nIncludes:\nSave $600 paying annually\nAll the same features\nAnnual Join Here\nExclusive\nTOUR Membership\nThe TOUR Membership is designed to provide the most dedicated golfers with everything they need to hone their game. The included 3D sessions will ensure focused improvement in the most effective way possible.\nSchedule up to 6 hrs at a time\nHave up to 6 hrs at any time reserved in the simulator bays.\n$2,000 of private AMG lessons\nIncludes private session with Mike and Shaun each quarter (\n$2,000 value\n).\nAfter hours access\nHave access AMGC outside of normal business hours.\nTOUR Membership\nThis is an annual membership\n$7,997\n/yr\nIncludes everything in CLUB plus:\nAfter hours access\nUp to 6 hrs Booking\nGEARS 3D\nDual force plate data\nSam Puttlab\nPrivate AMG lessons\n20 guests/mo\nTournaments included\nPrice lock guarantee\nJoin Here\nRent By The Hour\nHOURLY Bay Rental\nIn town for just a short time? Our hourly Trackman Bay rentals are a great way to get quality practice in while on a business trip or with the family.\n1 hr bookings (up to 4 players per bay)\nHave 1 hr at any time reserved in the simulator bays.\nHourly Bay Rental\nUp to Four (4) Players Per Bay\n$75\n/hr\nIncludes:\nHourly access\n1 hr reservations\nClub data\nBall flight data\nVideo analysis\nBook Here\nSide-by-Side Comparison\nHourly Rental\n$75\n/hr\nRent by the hour\nBook\nCLUB Member\n$2,997\n/yr\nMonthly or Annual\nJoin\nTOUR Member\n$7,997\n/yr\nAnnual membership\nJoin\nScheduling\nHitting bays (website/app)\nLessons (website/app)\nClub fitting (website/app)\nAccess\nHrs reserved at a time\n1 hr\n3 hrs*\n6 hrs*\nAvailability\n8am-8pm\n8am-8pm\n6am-10pm\nMobile phone\nkey-card access\nN/A\nN/A\nGuest passes/mo\nN/A\n8\n20\nAdd immediate\nfamily members\nN/A\nAvailable\nTechnology\nMulti-angle video analysis\nTrackman club/ball flight\ndata (saveable)\nGASP dual force plates\nAvailable\nAvailable\nGEARS Golf 3D\nAvailable\nAvailable\nSam Puttlab\nAvailable\nAvailable\nServices\nLessons\nAvailable\nDiscounted\nClinics and Schools\nAvailable\nAvailable\nDiscounted\nClub fitting\nAvailable\nDiscounted\n* Hours may be booked consecutively or spread across days/weeks. Once an hour is used, it may replaced by another reservation. This only limits the number of reservations that can held at any one time. This system ensures bookings are fair and equitable while preventing the possibility of monopolising the finite resource of available reservations.\nCorporate Memberships\nAnd Events\nCorporate memberships and events are available. Please contact us for more information.\nContact us\nFrequently Asked Questions\nDo I have to sign a contract when I join?\nNo. You are free to cancel your membership at anytime for any reason. You will have access for the remainder of your pre-paid membership term, but you will not be renewed or charged again.\nCancelations MUST be made in writing by emailing support@athleticmotiongolf.com.\nIf I need to cancel, do you offer refunds?\nYes. The refund policies for each membership level are as follows:\nBASE Membership: you may receive a refund for the balance in your member account.\nCLUB Membership: you may receive a refund for any unused months remaining on your annual plan. You will not receive a refund for current or past months based on your plan start date.\nTOUR Membership: you may receive a refund for any unused months remaining on your annual plan. You will not receive a refund for current or past months based on your plan start date.\nCan I change memberships if I want to?\nOf course. We can change your membership at the front desk for you, or you can login to the website (and app) and make the changes at anytime.\nDo I need to be TOUR Member to get lessons from Mike and Shaun?\nNo. Although membership perks offer huge savings, you will always be able to book lessons, clinics, AMG schools, and events. You can book them all from your phone or computer once logged into your account.\nCan I book lessons, clinics, schools and fittings if I'm not a member?\nYes. You'll just need to create an account on the website or app. Once you have an account set up, you'll be able to book any of our services a la carte.\nCan I bring family members?\nYes. Immediate family members (spouse and children living at home) are included in the TOUR Membership. CLUB Members can add family members to their membership for a small charge. BASE members can pay for additional members when they visit as well.\nCan I stay longer than 1-2 hrs at the BASE/CLUB member levels?  What If I want to stay longer?\nWe want to make sure all members get the experience they expect. To respect all members, we have 2 hr limits on hitting bay reservations for BASE/CLUB members. If you've made a reservation during a slow period, and there are no reservations scheduled after you, you are welcome to continue playing. Keep in mind that the AMGC experience is not like a driving range, this is like working on your game in a microwave. If you're practicing the right way, with all the feedback available, practicing longer than 2 hrs can often be detrimental.\nStill have questions?\nLet us know how we can help.\nContact us\n1230 Winter Garden Vineland Rd, Suite 108\nWinter Garden, FL 34787\nHome\nLogin\nContact Us\nConsult your doctor prior to any training within our products, videos, or website. Nothing on this page, any of our websites, or any of our content or curriculum is a promise or guarantee of results, and we do not offer any legal, medical, tax or other professional advice. By using our training, you understand that the information in our products are based on our training experience only and is not professional medical advice. Consult your doctor prior to any training within our products, videos, or website.\nCopyright 2023 | Athletic Motion Golf Club | All Rights Reserved",
      "emails": [
        "support@athleticmotiongolf.com"
      ]
    }
  ],
  "all_links": [
    "http://www.athleticmotiongolfclub.com/memberships",
    "http://www.athleticmotiongolfclub.com/club-fitting",
    "http://www.athleticmotiongolfclub.com/old-home",
    "http://www.athleticmotiongolfclub.com/lessons",
    "http://www.athleticmotiongolfclub.com/",
    "http://www.athleticmotiongolfclub.com/facility",
    "https://www.athleticmotiongolfclub.com/club-fitting#Fitting-Menu"
  ],
  "candidate_links": [
    "http://www.athleticmotiongolfclub.com/memberships"
  ],
  "visited": [
    "http://www.athleticmotiongolfclub.com/",
    "http://www.athleticmotiongolfclub.com/about",
    "http://www.athleticmotiongolfclub.com/contact",
    "http://www.athleticmotiongolfclub.com/staff",
    "http://www.athleticmotiongolfclub.com/team",
    "http://www.athleticmotiongolfclub.com/board",
    "http://www.athleticmotiongolfclub.com/directory",
    "http://www.athleticmotiongolfclub.com/events",
    "http://www.athleticmotiongolfclub.com/sitemap.xml",
    "http://www.athleticmotiongolfclub.com/council",
    "http://www.athleticmotiongolfclub.com/leadership",
    "http://www.athleticmotiongolfclub.com/management",
    "http://www.athleticmotiongolfclub.com/producers",
    "http://www.athleticmotiongolfclub.com/support",
    "http://www.athleticmotiongolfclub.com/crew",
    "http://www.athleticmotiongolfclub.com/members",
    "http://www.athleticmotiongolfclub.com/bios",
    "http://www.athleticmotiongolfclub.com/people",
    "http://www.athleticmotiongolfclub.com/artists",
    "http://www.athleticmotiongolfclub.com/musicians",
    "http://www.athleticmotiongolfclub.com/faculty",
    "http://www.athleticmotiongolfclub.com/administration",
    "http://www.athleticmotiongolfclub.com/memberships"
  ],
  "base_url": "http://www.athleticmotiongolfclub.com/"
}