{
  "pages": [
    {
      "url": "https://www.balibarwines.com/#9348b19c-e100-4b57-87f3-917139bec823",
      "is_candidate": false,
      "has_email": true,
      "text": "ONLINE ORDERING (Coming Soon)\nHome\nORDERING (Coming Soon)\nMENUS\nABOUT US\nPHOTO GALLERY\nCONTACT US\nMore\nHome\nORDERING (Coming Soon)\nMENUS\nABOUT US\nPHOTO GALLERY\nCONTACT US\nHome\nORDERING (Coming Soon)\nMENUS\nABOUT US\nPHOTO GALLERY\nCONTACT US\nBalibar Wines & Grinds\nBalibar Wines & Grinds\nBalibar Wines & Grinds\nBalibar Wines & Grinds\nBalibar Wines & Grinds\nBalibar Wines & Grinds\nBalibar Wines & Grinds\nBalibar Wines & Grinds\nWine Bar, Coffee House, Beer Garden, & Craft Cocktails\nOffering Charcuterie Boards, Small Plates, Bakery Items, and Desserts\nBalibar Wines & Grinds\n110 McLeod Street, Merritt Island, Florida 32953\n(321) 355-2344\nBaliHouseLLC@gmail.com\nHours of Operation\nMon\n06:30 am – 04:00 pm\nTue\n06:30 am – 04:00 pm\nWed\n06:30 am – 10:00 pm\nThu\n06:30 am – 10:00 pm\nFri\n06:30 am – 11:00 pm\nSat\n08:00 am – 11:00 pm\nSun\n08:00 am – 08:00 pm\nFollow us on social media for updates.\nContact Us\nDrop us a line!\nName*\nEmail*\nSend\nThis site is protected by reCAPTCHA and the Google\nPrivacy Policy\nand\nTerms of Service\napply.\nCopyright © 2025 - Balibar Wines & Grinds - All Rights Reserved.\nHome\nORDERING (Coming Soon)\nMENUS\nABOUT US\nPHOTO GALLERY\nCONTACT US",
      "emails": [
        "balihousellc@gmail.com"
      ]
    },
    {
      "url": "https://www.balibarwines.com/about-us",
      "is_candidate": false,
      "has_email": false,
      "text": "ONLINE ORDERING (Coming Soon)\nHome\nORDERING (Coming Soon)\nMENUS\nABOUT US\nPHOTO GALLERY\nCONTACT US\nMore\nHome\nORDERING (Coming Soon)\nMENUS\nABOUT US\nPHOTO GALLERY\nCONTACT US\nHome\nORDERING (Coming Soon)\nMENUS\nABOUT US\nPHOTO GALLERY\nCONTACT US\nAbout Balibar Wines & Grinds\nLocal Family Owned\nExperience the Best in Every Sip\nLocal Family Owned\nAt Balibar Wines & Grinds, we are more than just a wine bar and coffee shop—we are a family passionate about bringing people together over exceptional drinks and genuine hospitality. As proud members of this community, we believe in creating a welcoming space where neighbors, friends, and visitors can connect, relax, and enjoy thoughtfull\nShow More\nAt Balibar Wines & Grinds, we are more than just a wine bar and coffee shop—we are a family passionate about bringing people together over exceptional drinks and genuine hospitality. As proud members of this community, we believe in creating a welcoming space where neighbors, friends, and visitors can connect, relax, and enjoy thoughtfully curated offerings.\nOur journey began with a shared love for fine wine, expertly crafted coffee, and the simple joy of gathering around great company.  With deep roots in Merritt Island and Brevard County, we have always been inspired by the sense of community that makes this place so special. Our mission is to bring that same warmth and connection into every cup poured and every glass shared.\nWe take pride in selecting the finest wines and coffees, ensuring that every sip reflects quality, passion, and craftsmanship. More than just serving drinks, we strive to create experiences—where a morning coffee sets the perfect tone for the day and an evening wine selection becomes a memorable moment.\nAt Balibar Wines & Grinds, hospitality is at the heart of everything we do. We believe that exceptional service goes beyond the table—it’s about fostering relationships, supporting our local community, and making every guest feel like family. Whether you’re here for a quiet morning escape, an afternoon pick-me-up, or a night of celebration, we welcome you with open arms.\nShow Less\nOur Philosophy\nExperience the Best in Every Sip\nLocal Family Owned\nAt Balibar Wines & Grinds, we believe in the art of exceptional hospitality. Our mission is to create and deliver a warm and inviting space where our community can gather, connect, and indulge in the finest selections of wine, beer, cocktails, coffee, and tea. We are committed to offering first-class beverages and service, with a delight\nShow More\nAt Balibar Wines & Grinds, we believe in the art of exceptional hospitality. Our mission is to create and deliver a warm and inviting space where our community can gather, connect, and indulge in the finest selections of wine, beer, cocktails, coffee, and tea. We are committed to offering first-class beverages and service, with a delightful menu of small plate and flatbread options, blending craftsmanship with passion to elevate every experience.\nWe take pride in curating a thoughtful selection of wines, coffees, and teas, sourced with integrity and served with expertise. Our coffee roaster is local to Brevard County, and our wines are selected from biodynamic, organic, and/or environmentally responsible vineyards. Whether you seek a quiet morning retreat with a perfectly brewed espresso or an evening celebration over a glass of fine wine, craft beer, or specialty cocktail, our space is designed to inspire moments of joy, relaxation, and discovery.\nHospitality is at the heart of what we do. Our team is dedicated to personalized service, ensuring every guest feels welcomed, valued, and at home. Through knowledge, warmth, and attention to detail, we aim to cultivate an atmosphere where connections flourish, conversations flow, and the simple pleasures of life are savored.\nAt Balibar Wines & Grinds, we don’t just serve drinks—we create experiences that linger, just like the perfect finish on a fine wine or the last sip of a rich espresso.\nShow Less\nExperience the Best in Every Sip\nExperience the Best in Every Sip\nExperience the Best in Every Sip\nAt Balibar Wines & Grinds, we take pride in offering an exceptional selection of beverages crafted for every taste and occasion. From the first morning coffee to the last evening toast, we are dedicated to bringing you the finest in quality, flavor, and craftsmanship.\nOur curated wine list features an exquisite collection of fine wines f\nShow More\nAt Balibar Wines & Grinds, we take pride in offering an exceptional selection of beverages crafted for every taste and occasion. From the first morning coffee to the last evening toast, we are dedicated to bringing you the finest in quality, flavor, and craftsmanship.\nOur curated wine list features an exquisite collection of fine wines from renowned vineyards and hidden gems, ensuring a perfect pour for every palate. For those who appreciate the art of brewing, our selection of craft beers showcases both local favorites and popular selections, each chosen for its depth and character.\nElevating the cocktail experience, we offer specialty wine-based cocktails—expertly crafted and full of vibrant flavors, designed to bring a fresh and innovative twist to classic favorites.\nCoffee lovers will find comfort in our thoughtfully sourced, high-quality coffees, brewed with precision to highlight the rich, bold, and nuanced flavors of every bean. Our tea selection is equally refined, offering a variety of soothing and invigorating blends for every moment of the day.\nFor those seeking a health-conscious option, our refreshing Big Dog Kombucha selections provide a non-alcoholic, delicious, probiotic-packed alternative, crafted locally with love for wellness without compromising on taste.\nShow Less\nCopyright © 2025 - Balibar Wines & Grinds - All Rights Reserved.\nHome\nORDERING (Coming Soon)\nMENUS\nABOUT US\nPHOTO GALLERY\nCONTACT US",
      "emails": []
    }
  ],
  "all_links": [
    "https://www.balibarwines.com/",
    "https://www.balibarwines.com/photo-gallery",
    "https://www.balibarwines.com/menus-1",
    "http://www.balibarwines.com",
    "https://www.balibarwines.com/#9348b19c-e100-4b57-87f3-917139bec823",
    "https://www.balibarwines.com/about-us"
  ],
  "candidate_links": [
    "https://www.balibarwines.com/#9348b19c-e100-4b57-87f3-917139bec823",
    "https://www.balibarwines.com/about-us"
  ],
  "visited": [
    "https://www.balibarwines.com/",
    "https://www.balibarwines.com/about",
    "https://www.balibarwines.com/contact",
    "https://www.balibarwines.com/staff",
    "https://www.balibarwines.com/team",
    "https://www.balibarwines.com/board",
    "https://www.balibarwines.com/directory",
    "https://www.balibarwines.com/events",
    "https://www.balibarwines.com/sitemap.xml",
    "https://www.balibarwines.com/council",
    "https://www.balibarwines.com/leadership",
    "https://www.balibarwines.com/management",
    "https://www.balibarwines.com/producers",
    "https://www.balibarwines.com/support",
    "https://www.balibarwines.com/crew",
    "https://www.balibarwines.com/members",
    "https://www.balibarwines.com/bios",
    "https://www.balibarwines.com/people",
    "https://www.balibarwines.com/artists",
    "https://www.balibarwines.com/musicians",
    "https://www.balibarwines.com/faculty",
    "https://www.balibarwines.com/administration",
    "https://www.balibarwines.com/#9348b19c-e100-4b57-87f3-917139bec823",
    "https://www.balibarwines.com/about-us"
  ],
  "base_url": "https://www.balibarwines.com/"
}