{
  "pages": [
    {
      "url": "https://baysidewaters.com/contact-us/",
      "is_candidate": false,
      "has_email": true,
      "text": "Bayside Waters Privacy Policy\nThis Privacy Policy describes how Bayside Waters collects, uses, and discloses your personal information.\nThis Privacy Policy should be read in conjunction with our Terms of Service, and any other policy, agreement, or terms which may affect your relationship with us.\nI. SCOPE OF THIS POLICY\nThis Privacy Policy applies to https://www.baysidewaters.com including all its sub-domains and other websites that link to this Privacy Policy, when accessing and using them in the United States, as well as any of our other services and tools that might be made available by us from time to time, including offline tools, surveys, applications, services, advertisements, events, and promotions (collectively, “Services”).\nWe may provide links to external-party websites that are not owned by Bayside Waters. Bayside Waters has no control over external-party privacy practices and assumes no responsibility in connection with your use of external-party websites, applications, or any other services offered by other parties. Any external-party services are governed by the privacy policies appearing on those sites and applications.\nBy using the Services, you signify your consent to this Privacy Policy and the Terms of Service for the use of our Services. If you do not agree to this Privacy Policy or Terms of Service for the use of our Services, please do not use our Services.\nII. INFORMATION THAT WE COLLECT OR RECEIVE\nWe collect and receive information from and about you by different means, including, without limitation: (i) information you submit or provide to us; (ii) information collected automatically and manually; and (iii) information provided to us by other sources. Some of the information we collect and receive includes “personal information,” which is generally information that identifies, relates to, describes, is reasonably capable of being associated with, or could reasonably be linked, directly or indirectly, with you. Personal information does not include information that is publicly available, de-identified, aggregated, or otherwise exempted by applicable laws.  The information we may collect will vary and depend on the nature of your relationship with us and the reason(s) for providing/collecting the information.\nA. Information You Submit or Provide to Us\nWe or our vendors collect the information that you directly provide to us, such as when you enter it on a webpage, submit an online form, use a chat feature we may offer, or include it in an email that you send to us in relation to our Services. In addition, we may collect information through relevant business support processes, during the registration or account creation processes, and through other business functions where we ask you to provide information, including:\nContact Information (e.g., name, email or mailing address, or phone number);\nAccount Administration Information (e.g., username, password, or security questions);\nCommunications (e.g., information you submit through our interactive chat feature or through other communications with us, including potential customer service call recordings);\nPayments and financial information (e.g., information necessary to process transactions, conduct due diligence, as part of an application, or for other business needs);\nEmployment-related information and education information (e.g., information you may provide when applying for a job, or which may be included as part of an application);\nDemographic information (e.g., ethnicity, sex, gender, birth date, age, languages spoken, disability, housing status, household size, household type, family members, marital status, annual income, desired housing characteristics and desired housing location or community);\nLocation information (e.g., geolocation inferred from your access to our websites or from your device); and\nCommercial records, customer records, and preference information (e.g., your purchase history, leasing details, rental history, property records, tenant data, and related information).\nYour use of interactive features we may offer on our Services is voluntary, and we may retain the information that you submit through these features. If you participate in interactive chat, either with a virtual or live agent, the contents of the chat may be captured by us or our service provider and kept as a transcript. If you use these features, you understand that our vendors may process the information obtained through the feature to provide the Service on our behalf.\nIf you submit personal information of other people to us, e.g., when participating in a resident referral program we may offer, you represent that you have permission and authority to provide us with such personal information.  If you do not have permission, please do not provide us with their information.\nB. Types of Information Collected Automatically\nWe may automatically or manually collect information related to your use of Services.   For example, data collected in this manner may include:\nWeb Browsing Data. When you use our Services, our servers may automatically record information, including information that your browser or mobile device sends when you visit or use our Services.\nTechnical Information. We may collect certain technical information about your computer systems or about your visits to our online environments when you use our Services.\nDevice Information. We may collect information about the device you are using to access our Services, including what type of device it is, what operating system you are using, device settings, unique device identifiers and crash data.\nCookie Data. Depending on how you are accessing our online environments, we may use “cookies” (a small text file sent by your device each time you visit our websites, unique to your Bayside Waters account or your browser). When we use cookies, we may use “session” cookies (that last until you close your browser) or “persistent” cookies (that last until you or your browser delete them). For example, we may use cookies to remember your personal preferences, such as sections of our Services that you visit frequently, your user ID or other settings so you do not have to set them up every time you visit our Services. Some of the cookies we use may be associated with your Bayside Waters account (including information about you, such as the email address you gave us), and other cookies are not. In addition, we may use web beacons, pixels, or other web programming code or embedded scripts.\nAnalytics Data. We may use Google Analytics or other providers for analytics services. We may also implement Google Analytics Advertising Features such as remarketing with analytics and interest-based ads. We may use first-party cookies or other first-party identifiers as well as third-party cookies or other third-party identifiers to, e.g., deliver advertisements, measure your interests, and/or personalize content. For more information on how Google Analytics uses data collected through our services, visit http://www.google.com/policies/privacy/partners. To opt out of Google Analytics cookies, visit https://tools.google.com/dlpage/gaoptout or download the Google Analytics Opt-Out Browser Add-On.\nSensory Data.  In order to provide you with the best possible support, prevent fraud, and improve our Services.  We may also use surveillance cameras on our property in order to provide security.\nC. Information Provided to Us by Other Sources\nTo improve the quality of our Services, and to carry out research and analysis, we and our vendors may supplement the information we collect with information from other sources, such as publicly available information, commercially available sources, and information from our business partners or other third parties.\nIII. USE OF INFORMATION\nWe may use the information we collect through the Services or otherwise obtain for a number of purposes including to:\nProvide our Services;\nUnderstand and improve our operations, Services, and performance;\nAssist in customer service and transactions;\nGenerate feedback regarding the Services which we offer;\nConduct research or for analytics purposes;\nDevelop new Services;\nDeliver marketing communications or promotional materials that may be of interest to you;\nImprove the services we provide and the usefulness of the Services;\nCustomize our users’ experience when using the Services;\nProtect ourselves and our users; and/or\nComply with applicable laws.\nIV. WHY WE MAY DISCLOSE INFORMATION\nWe may disclose your personal information with other parties as follows:\nProvision of Services. We may disclose your personal information with our business partners, vendors, and service providers in order to provide our Services, including as necessary for financial transactions, to conduct due diligence, to detect and prevent fraud, to comply with applicable laws and/or contractual obligations, to ensure quality of our Services, and as otherwise necessary to support our Services.\nLaw Enforcement, Judicial, Administrative, or Regulatory Disclosures. When we believe in good faith that the law requires disclosure or that disclosure is necessary to protect or enforce the rights, property, safety, or security of ourselves or others.\nBusiness Transfers. In connection with sale of the applicable business, a portion of the business, or certain stock and/or assets, or a corporate merger, consolidation, restructuring, or other corporate change including, without limitation, during the course of any due diligence process.\nMarketing and Advertisements. We may disclose your personal information to our vendors or third parties to facilitate marketing and provide you with advertisements which may interest you.\nSweepstakes, Contests, and Promotions. We may offer sweepstakes, contests, and other promotions (each, a “Promotion”), including Promotions jointly sponsored or offered by third parties which may require submitting personal information.  If you voluntarily choose to enter a Promotion, your information may be disclosed to us, our co-sponsors, service providers, and other third parties, including for administrative purposes and as required by law (e.g., on a winner’s list). By entering, you are agreeing to the official rules that govern that Promotion, which may include consent to additional or differing data practices from those contained in this Privacy Policy.  Please review those rules carefully.\nV. CHOICES YOU HAVE ABOUT YOUR INFORMATION\nYou may always limit the amount and type of information that we collect from you by choosing not to enter or provide information requested from you on our Services. However, some of our features and Services can only be provided to you if you provide us with requested information (including, in some instances, personal information). Some of the Services offered may ask whether you wish to opt out or opt into our contact lists for offers, promotions and additional Services that may be of interest to you.\nVI. DO NOT TRACK SIGNALS\nSome web browsers may transmit “Do-Not-Track” signals to websites with which the browser communicates. As with many other companies, we do not currently respond to these signals.\nVII. HOW WE SECURE YOUR INFORMATION\nBayside Waters is committed to protecting the confidentiality and security of your information against unauthorized access and disclosure. We only disclose your personal information to our personnel or others who need to know the information to service your account or to provide our Services, and as otherwise permitted or required by law. We maintain strict physical, electronic, and procedural safeguards to protect your information.\nVIII. OUR POLICY ON THE INFORMATION OF CHILDREN\nBayside Waters does not seek or knowingly collect personal information from children under the age of thirteen (13), and we request that children do not provide information through the Services. If you are a parent or guardian and become aware that your child has provided us with information, please contact us using one of the methods specified below, and we will work with you to address the issue.\nIX. INTERNATIONAL TRANSFERS\nWe are a United States company and we provide our Services subject to United States law. However, we may transfer information to our affiliates, vendors, and business partners in other countries around the world, subject to applicable laws, and as a result personal information may be transferred to, processed, and stored in the other countries. As such, courts, law enforcement, and authorities in other countries may, in certain circumstances, be entitled to access your personal information. By using the Services or providing us with any information through the Services, you consent to this potential transfer, processing and storage of your information, and you acknowledge that other countries and jurisdictions may not provide the same privacy protections and their privacy laws may not be as comprehensive as those in the United States or in the country where you reside or are a citizen.\nX. CHANGES TO THE PRIVACY POLICY\nWe reserve the right to amend this Privacy Policy at any time to reflect technological advancements, legal and regulatory changes and good business practices or otherwise at our discretion subject to applicable laws. If we make any changes, a new Privacy Policy will reflect those changes and the effective date of the revised Privacy Policy will be set forth at the top of the Privacy Policy.\nYour continued use of the Services after we make changes to this Privacy Policy is deemed to be acceptance of those changes, so please check this Privacy Policy periodically for updates.\nXI. HOW TO CONTACT US\nIf you have any questions or comments about this Privacy Policy or the ways in which we use information subject to this statement, please do not hesitate to\ncontact us by emailing info@baysidewaters.com, writing to 19709 US Highway 19 N, Clearwater, FL 33764, or calling us at 727.531.4476.",
      "emails": [
        "info@baysidewaters.com"
      ]
    }
  ],
  "all_links": [
    "https://baysidewaters.com/available-homes/?home_id=6499",
    "https://baysidewaters.com/lifestyle/",
    "https://baysidewaters.com/location/",
    "https://baysidewaters.com/available-homes/?home_id=11399",
    "https://baysidewaters.com/contact-us/",
    "mailto:info@baysidewaters.com",
    "https://baysidewaters.com/available-homes/?home_id=2430",
    "https://baysidewaters.com/gallery/",
    "https://baysidewaters.com/SPECIALS/",
    "https://baysidewaters.com/amenities/",
    "https://baysidewaters.com/brochure-download/",
    "https://baysidewaters.com/available-homes/",
    "https://baysidewaters.com/faq/",
    "https://baysidewaters.com",
    "https://baysidewaters.com/specials/",
    "https://baysidewaters.com/#newsletter",
    "https://baysidewaters.com/"
  ],
  "candidate_links": [
    "https://baysidewaters.com/contact-us/"
  ],
  "visited": [
    "https://baysidewaters.com/?utm_source=GMB&utm_medium=organic",
    "https://baysidewaters.com/about",
    "https://baysidewaters.com/contact",
    "https://baysidewaters.com/staff",
    "https://baysidewaters.com/team",
    "https://baysidewaters.com/board",
    "https://baysidewaters.com/directory",
    "https://baysidewaters.com/events",
    "https://baysidewaters.com/sitemap.xml",
    "https://baysidewaters.com/council",
    "https://baysidewaters.com/leadership",
    "https://baysidewaters.com/management",
    "https://baysidewaters.com/producers",
    "https://baysidewaters.com/support",
    "https://baysidewaters.com/crew",
    "https://baysidewaters.com/members",
    "https://baysidewaters.com/bios",
    "https://baysidewaters.com/people",
    "https://baysidewaters.com/artists",
    "https://baysidewaters.com/musicians",
    "https://baysidewaters.com/faculty",
    "https://baysidewaters.com/administration",
    "https://baysidewaters.com/contact-us/"
  ],
  "base_url": "https://baysidewaters.com/?utm_source=GMB&utm_medium=organic"
}