{
  "pages": [
    {
      "url": "https://www.belleaircc.com/about-us",
      "is_candidate": false,
      "has_email": false,
      "text": "2025.1.416.462\nSTART MASTER PAGE\nSkip to main content\nHome\nAbout Us\nMembership\nGolf\nAthletics\nAmenities\nContact Us\nLogin\nend header\nStart Dynamic Page\nBegin Mini-Page 20624\nEnd Mini-Page 20624\nBegin Mini-Page 20625\nAbout Us\nEnd Mini-Page 20625\nend banner\nBegin Mini-Page 20626\nFlorida’s First Golf Course – Established in 1897\nHow It All Began\nThe grand tradition of Belleair Country Club golf began over a hundred\r\nyears ago when Henry Bradley Plant, founder of the Plant system of railroads and Steamboats selected this site to construct a winter golf resort in 1897. He had six holes built with elevated greens, the surfaces of which were crushed seashells. At that time, the fairways were rough with indigenous grass, as it was assumed that sophisticated grasses could not be grown in Florida.\nBy 1899, under the guidance of Joseph J. Eldridge, the layout had expanded to nine holes and the greens had been “upgraded” to sand surfaces. On June 23, 1899, Henry Plant died, leaving his son, Morton F. Plant, to complete the dream he had started. Morton Plant succeeded in completing his father’s dream, and more.\nMorton began experimenting with topsoil, grasses, and fertilizers, refusing to accept the notion that better golf course grasses could not be grown successfully in Florida. He went so far as to have several railroad cars full of rich Indiana topsoil brought to Belleair. Morton Plant laid the foundation for the rich and lush appearance of the Belleair Country Club’s golf courses as they are today. In fact, it has been observed that the Club’s grass greens were the first in the South.\nDuring 1909, the West Golf Course grew to eighteen holes and by 1915, to thirty-six holes, implementing the design of the popular and brilliant golf course architect, Donald J. Ross. Today’s layouts are essentially as Ross designed them, although the sequence of holes has changed.\nWho We Are\nA Gulf Coast paradise and historical landmark, perched on one of the highest points of Clearwater Bay, Belleair Country Club proclaims the first golf course in Florida. The rolling courses feature lush landscape with beautifully appointed, freely flowing ponds and creeks. Belleair Country Club is situated in the heart of Belleair, a designated bird sanctuary, with an ever-changing panorama. The prevalence of wildlife, with the golf courses and grounds being their permanent home, are an added delight to the golfer-naturalist. The palm trees gently swaying in the gulf breezes, with the sun sparkling on the serene waters of Clearwater Bay will enhance all the senses for a game of golf like no other.\nGrounded in tradition, elegantly designed and portrayed in beauty, BCC is a personal and private paradise. It is among the few waterside courses in the area. We are proud of our pristine facilities. It was designed to be a place where comfort, unequaled style and exclusivity unite. The functionally appointed Sports Center is a place where mind, body and spirit can be healthfully fortified. Rigorous workouts mixed with friendly competition can be achieved on our har-tru tennis courts and pickleball courts, or a leisure croquet game is available for our members. Yes, this is another added amenity to your membership, along with a secluded Marina. Here at Belleair Country Club you will discover a veritable community, a personal getaway to relax in leisure or to energize in sport.\nFamily First Mindset -  We pride ourselves in being a very family-oriented Club. Our membership options encompass the whole family and we host events for children (Kids Fun Night, holiday events, poolside parties, camps and clinics) and adults alike!\nWhere We’re Going\nAs our membership grows and evolves, we want to do the same. We are always looking for ways to improve your Club – recent projects include the West Golf Course renovation, construction of two new croquet courts and a bocce ball court, two new pickleball courts, eight new slips in the marina, and an additional group exercise room. More projects are in the works and as a member you get to be part of the excitement!\nOur History at a Glance\nBelleair Country Club is grounded in history and tradition. This is where Presidents Ronald Reagan, Jimmy Carter, Gerald Ford, George H. W. Bush and Barrack Obama have played golf or visited. This is where movie stars and Hall of Famers like Babe Ruth and Stan Musial and Joe DiMaggio and Tom Seaver, and scores of corporate executives have walked the bright fairways – where Walter Hagen shot a world record 62, where Arnold Palmer once turned in a dazzling 65 and Donald Ross worked his architectural magic. It’s where the Vanderbilts, Mellons, Rockefellers and Du Ponts arrived in their own luxurious rail cars to enjoy golf and the other available amenities. And it’s where the legendary West Golf Course, restored and renovated in 2022 has received rave reviews from the nation’s leading golf media.\n1897\n–\nBillionaire Henry Bradley Plant opens his majestic Belleview Hotel and six-hole golf course. Those holes were basically located in the general area of Nos. 1, 2, 3 and 18 of today’s West Course.\n1899 –\nUnder the guidance of Joseph J. Eldridge, the six-hole course is expanded to nine holes and greens upgraded to sand surfaces.\n1899 –\nHenry Plant dies at age 80. Responsibility for the golf courses falls to the hands of son Morton F. Plant who had three passions – yachting, golf and baseball.\n1900 –\nLawrence “Laurie” Auchterlonie appointed Belleair’s first golf professional. Auchterlonie remains in the position through 1910 and became the first of three BCC pros to win the coveted U. S. Open golf tournament, winning in 1902 at Garden City (N. Y.) Golf Club. Laurie was the older brother of Willie Auchterlonie who captured The (British) Open in 1893. Laurie Auchterlonie returns to his native Scotland in 1911.\n1909 –\nThe golf course grows to 18 holes and by 1915 to 36 when legendary golf course architect Donald J. Ross is commissioned to design two 18-hole layouts, then known as Belleview Course No. 1 and Belleview Course No. 2. Morton Plant gives Ross an open checkbook to draft the courses and make them more appealing to guests visiting the luxury resort.\n1910 –\nAlex Smith succeeds Laurie Auchterlonie as golf professional and becomes  the second BCC pro to win the U. S. Open. Smith won in 1906 at Onwentsia Club, Lake Forest, Ill., and won for BCC at Philadelphia Cricket Club in 1910. His brother Macdonald was an assistant for a spell at BCC.\n1914 –\nM. L. Ballard, writing in Golf Magazine, states “Mr. Ross laid out two fine 18-hole courses, modern in design and up to date in every way. The lay of the ground presented many unusually good natural features which lent themselves to the formation of fine golf holes and this was used to the best advantage.”\n1920 –\nGolf courses renamed West and East.\n1920 –\nThe Coe Road Casino, a two-story Spanish-styled casino with a grand dining room, opens near the Belleview Hotel and the golf courses. It becomes a favorite, especially for the hotel guests and golfers who participated in the many tournaments, including the nationally known PGA Florida West Coast Open.\n1923 –\nLegendary golfer Walter Hagen, playing in the Florida West Coast Open at Belleair Country Club, sets a then world record 62 enroute to the tournament title.\n1924 –\nDonald Ross, at the peak of his design career, returns to Belleair to completely renovate, upgrade and improve the two golf courses. His designs were an integral part of the massive renovation of the West Course in 2022. The Ross drawings were followed and much of the course was returned to those designs.\n1930 –\nBilly Burke, a\r\nfavorite in the Clearwater area, becomes BCC golf professional in 1930, a\r\nposition he holds until 1943 when the club closed during World War II. Burke\r\ngave Belleair the unbelievable distinction of three U. S. Open winners when he\r\nwon in 1931 at Inverness in a 72-hole playoff over George Von Elm, longest\r\nplayoff in major golf championship history. Burke won 13 PGA Tour events,\r\nincluding the 1932 Florida West Course Open at Belleair C.C. The PGA Hall of\r\nFamer moved to Clearwater Country Club in 1946 where he remained until 1962.\n1935 –\nOver 2,000 fans\r\nturn out on March 1st at Belleair Country Club to watch the\r\nlegendary Bobby Jones, Horton Smith, Billy Burke and Ky Laffoon in a four-ball\r\nexhibition. Burke, Belleair’s golf pro who won the 1931 U. S. Open, and Jones\r\ndefeat Smith and Laffoon in a close match when Smith misses an18-inch putt on\r\nthe last hole.\n1\n943 –\nThe hotel and golf courses are leased to the U. S. Army Air Corps. Where Walter Hagen, Gene Sarazen and Babe Ruth, and hundreds of others slammed their drives they are now being used as drill grounds for over 3,000 medical technician trainees.\n1946 –\nHarvey Meeks appointed golf course grounds superintendent with Harvey Phillips his assistant and charged with returning the courses back to playing condition following their used during World War II by the U. S. Army.\n1949 –\nAfter being raided several times, the Coe Road Casino closes on Feb. 25th when it is raided by Pinellas Country Sheriff Todd Tucker and his deputies.\n1971 –\nThe golf courses and surrounding acreage are sold to U. S. Steel;  the club becomes the Belleview Biltmore Country Club with an announcement it will be open 12 months each year.\n1971 –\nWilliam C. (Bill) Conway, an assistant since 1962, is appointed Director of Golf, a position he holds until he retires on Jan. 1, 2005.\n1977 –\nUnder the U. S. Steel umbrella, the club opens its new 20,000-square foot clubhouse at a cost of $2.5 million. As an aside, the old pro shop was actually the clubhouse with small locker rooms. These locker rooms were seldom used, but the attendant was on duty to shine members’ shoes.\n1977 –\nEgon C. Jorgenson becomes Belleair Country Club’s general manager.\n1978 –\nHarvey Phillips succeeds Harvey Meeks as golf course grounds superintendent.\n1978 –\nFirst two of seven tennis courts are constructed. Two more are added in 1980, two more in 1998 and a seventh in 2005. Lights and Har-Tru all-weather surfaces added over the years.\n1986 –\nWith an 11th hour deal on Dec. 30, 1986, Clearwater realtor Bobby Byrd sells the golf courses, tennis courts and country club building to the membership – forming the Belleview Biltmore Country Club, Inc., which becomes the Belleair Country Club, the name it went by in the early years. The $15 million deal occurs after an unexpected flurry of negotiations when it appeared U. S. had reached an agreement with Bernard F. Powell, proprietor of the Belleview Biltmore Hotel. If that had happened, the golf courses would have become public. Instead, without any warning, U. S. Steel in November of 1986, announces a multi-layered deal has been worked out with Byrd. He, in turn, almost immediately sells the country club to its members.\n1987 –\nDuncan J. MacLennan becomes Belleair Country Club’s first president.\n1989 –\nOn March 1, Rick Wahl appointed grounds superintendent, succeeding Harvey Phillips.\n1991 –\nEgon Jorgenson retires as general manager.\n1992 –\nTom Philbrook appointed BCC general manager; holds the position through 1994.\n1995 –\nTerry Boyes appointed BCC general manager and holds position through 1996.\n1997 –\nEgon Jorgenson returns as interim general manager through June.  On July 1, Edward J. Shaughnessy is appointed general manager and chief operating officer. Shaughnessy immediately undertakes upgrading every facet of the club. During his reign it becomes one of the foremost family-oriented clubs in Florida, if not the nation.\n2000\r\n–\nAfter twice rejecting expansion and upgrades to the clubhouse in 1994 and 1995,\r\nthe project which added 30,000 square feet is completed at a cost of\r\n$6,000,000   It includes a men’s lounge, second-floor\r\nrestrooms, a second-floor bar (Sam Parks Lounge) the golf pro shop, expanded\r\nand upgraded men’s and women’s locker room, a new air-conditioned system and a\r\nsmall portion of the clubhouse as a fitness center is completed.\n2000\n– As part of the\r\nclubhouse expansion and upgrade, the stately second-floor lounge is named The\r\nSam Parks Lounge in honor of longtime Belleair Country Club member Sam\r\nParks Jr., who won the 1935 U. S. Open at Oakmont C. C. Parks became a BCC\r\nmember in the late 1970s, giving the club four U.S. Open winners. Memorabilia\r\nfrom his Open victory at Oakmont C. C. is displayed in the lounge.  Parks died in 1997 at age 87.\n2001—\nUnder the impetus of the late Walter Cooper, Belleair C. C. adds croquet to its long list of available sports for members. Cooper donates $10,000 for construction of the court and  Zip Long adds another $10,000 donation just 8 days before his death.\n2003 –\nThe West Golf Course is renovated at a cost of $2.7 million.\n2005 –\nJim Slattery, an assistant, is promoted to  Director of Golf, succeeding retiring Bill Conway. Slattery becomes only the seventh holding that position in the history of Belleair Country Club.\n2005 –\nThe East Golf\r\nCourse renovated at a cost of $4 million.\n2007 –\nDesigned by architect Sol Fleischman, a fitness/sports center and an Olympic-size swimming pool are opened at a cost of $2 million.  Although the center is primarily used by members for exercise and fitness, a wide range of group classes is offered, including the various types of yoga, spinning, Pilates, strength training boots camps and even routines for golfers with specialized equipment.\n2007 –\nIn December, the “Great Recession” begins. During a 19-month period of the recession, the club loses 300 families and is down to 610 golf members. By contrast, there are now over 850 golf members and a five-year waiting list. A dramatic reduction in spending and other measures directed by General Manager Ed Shaughnessy and unbelievable loyalty from the remaining members keeps the club alive. Complicating the issue is an $11,635,741 debt created by construction of the Sports Center and renovations to the West and East golf courses.  That was the largest debt the club has ever incurred.\n2007 –\nWith the addition of the heated and cooled swimming pool the club “dives”  into the Country Club Swimming and Diving Association of Pinellas County. Swimmers range in age from 4 to 18, with over 100 involved. Belleair Country Club also sponsors a Master’s swimming program.\n2008 –\nOn Jan. 30th, Andy Neiswender is appointed grounds superintendent and director of facilities and operations. He succeeds Rick Wahl who resigned in 2007.\n2009 –\nOn May 31st, what was then the crumbling Belleview Biltmore Hotel, closes. Greatly reduced in size and moved 100 yards, the completed refurbished structure to its original décor, reopens as the Belleview Inn on Dec. 5, 2018 under the umbrella of St. Petersburg, Florida-based JMC Development, which had obtained the property and constructed town houses and condo buildings named the Belleview Place community.\n2015 –\nDuring a membership Town Hall meeting in December, with club president Jim Evans presiding, a $2.3 million 27,887 square-foot Maintenance Center is approved.\n2016 –\nConstruction of the new Maintenance Center is completed, including a reception area, management offices, employee break room and a meeting room. The new facility also includes approximately 2,000 feet for servicing and maintaining the golf equipment, plus a large, covered area for equipment storage.\n2016 –\nEarly planning is begun to restore/renovate the West Golf Course.  Hal Bodley is appointed chairman of a diverse Golf Course Renovation Committee that is responsible for choosing an architectural firm, engineer and designs for the project. Quality of water and its supply is a major concern, prompting renovation/restoration planning. Superintendent Andy Neiswender states the urgency to renovate the greens and fairways. Greens have a life expectancy of about 15 years.\n2016 –\nWith consideration to make the existing peninsula on Clearwater Bay below the current No. 6 hole a new par-3 seventh hole, negotiations for a purchase/lease with the Town of Belleair began. Belleair Country Club currently owns one-half of the peninsula, the town the southern half.\n2017 –\nThe Fry/Straka golf course architectural firm is chosen for renovation of the West Golf Course. A key early decision is to move from a greens-bunkers-fairways renovation to a full-blown redo of the West Course, using the original Donald Rose designs as a guide. These drawings, from 1924, are obtained from extensive Ross files at the Tufts Archives in Pinehurst, N. C.\n2018 –\nBelleair Country Club’s Hal Bodley, chairman of the Golf Course Renovation Committee, makes a lengthy presentation to the Town of Belleair commissioners detailing the club’s plan for the golf hole. A special video rendering of what the hole will look like is shown.\n2019 –\nAfter a series of “Town Hall” membership meetings restoration/renovation of the West Course is overwhelmingly approved for an estimated cost of $6 million.\n2019 –\nTwo “Waterfall West” public meetings are held by the Town of Belleair on the area where BCC is hopeful of obtaining the land for a par-3 golf hole. J. P. Murphy, the town’s manager, tells the group he is basically opposed “because it would eliminate public access to the area overlooking Clearwater Bay.”\n2020 –\nOn June 15 at a special meeting, the Belleair Country Club Board of Directors, after a long discussion, approves the lease by a 5-4 vote. Terms: An initial payment of $350,000, followed by $20,000 annually for 30 years. On Aug. 4, the Town of Belleair Commission, meeting via Zoom, approves BCC’s long-term lease for the parcel of land listed as Waterfall West (the northern tip of Hallett Park on Bayview Drive). Finally obtaining \"The Peninsula\" paves the way for construction of the par-3 golf hole overlooking Clearwater Bay. Vote is 3-0, with Mayor Gary H. Katica (ill) and Tom Kurey (abstaining because of conflict) not voting.\n2020 –\nOn March 15th a ceremonial groundbreaking is held along with a festive Sunday afternoon celebration and a “wacky” golf tournament. However, then club president Bob Wayland tells members that there will be a delay because of COVID related permitting issues.  The delay actually extended two years.\n2021 –\nFollowing a two-year delay, with escalating costs, the membership approves an additional cost of $2.8 million for restoration/renovation of the West Course. That brings the total cost to $8.8 million with construction to begin in 2022.\n2021 –\nDr. David Dieterich is appointed chairman of the 17-person East Golf Course renovation committee. Monthly planning meetings begin.\n2022 –\nBelleair Country Club celebrates its 125th Anniversary with special events during the year and publication of a 179-page coffee table style history book (authored by Hal Bodley).\n2022 –\nRyan Orr, playing with Major League pitcher Ryan Weber, shoots 58 to on Jan. 4th to better his own club record on the East Course of 59 set in 2020. He also holds the record at 60 set on Sept. 20, 2020. Enroute to his record 58 he has an Eagle on No. 2 and birdies 10 of his last 12 holes.\n2022 –\nOn March 22nd, a second ceremonial groundbreaking is held to signal start of the West Golf Course restoration/renovation.\n2022 –\nRon Campbell and Mark Rometty win the 35th annual Belleair Country Club Member-Guest Golf Tournament, last major event to be played on the West Course before renovation.\n2022 -\nAfter closing ceremonies on Sunday, March 20th, renovation and restoration of the West Course begins on March 21st, start of the eight-month project.\n2022 –\nThe Fry/Straka golf course architecture firm is chosen for the East Course renovation. It is asked to begin submitting designs for the renovation. A decision is  made to move from a greens-bunkers-fairways renovation to a full-blown redo of the East Course.\n2022 –\nAs part of the West Golf Course restoration/renovation, the original croquet court is relocated adjacent to the club’s main entrance with a second regulation court added. This location, especially under lights after dark, has created a picturesque scene as members and guests arrive at the club. A new starter/ croquet building with shaded porch is added.\n2022 –\nAfter late-afternoon Grand Opening ceremonies on Nov. 30th, with a ribbon cutting and a large crowd of members in attendance, including Scottish bagpiper Bill Howard, restoration and renovation of the West Golf Course is completed. The first foursome of Roger Peters, Lynn Morse, Earle Cooper and Gary Keene tee off at 7 a.m. on Dec. 1. At the same time, West Course Renovation Chairman Hal Bodley, instrumental in negotiating a lease agreement with the Town of Belleair for the new par-3, seventh overlooking Clearwater Bay, was given the honor of hitting the first ball on what became the West Course’s signature hole.Total cost was slightly under $9 million.\n2022-2024 –\nAs the new West Golf Course matures, reviews by national publications are positive and outstanding. Many of the leading golf journalists visit Belleair and play the course. Returning the West to the original Ross designs headlined most of the reports with awesome praise. Returning to the Donald Ross turf lines, with significantly expanded play areas, also included new-look fairways that meander and curve around hazards, with natural streams restored that wind around the course, adding additional strategy to a round of golf. One of the most controversial additions are the “cop mounds,” a bunker in reverse. In time, most players embrace them.\n2023 –\nGolf Director Jim Slattery elected to the PGA’s North Florida Section Hall of Fame. Slattery is inducted along with touring pros Paul Azinger, now an NBC-TV golf analyst who won the 1993 PGA Championship, and Jim Furyk, who won the 2003 U. S. Open.\n2023 –\nBocce ball court constructed and opened with about 60 members attending ceremonies. The court is located directly next to the croquet courts. Bocce is derived from a game played in the Roman Empire.\n2023 –\nMembership overwhelmingly approves complete renovation of the East Course. Included in the Master Plan is a practice putting green, short-term practice area, and an expanded range. The practice facility will more than double in size – from 36,500 square feet to over 75,000 square feet. The hitting area from the mats will be 350 yards long, accommodating the club’s longest hitters.\n2023 –\nRenovation and expansion of the Sports Center begins. New and improved locker rooms, state-of-the art fitness equipment and additional square footage is included in the project at a cost of $2,000,000. The Belleair Country Club Croquet Club is recognized as the 2023 Club of the year by the National Croquet Association\n2024 –\nThe Sam Parks Lounge is expanded to the previously outdoor dining area.\n2024 –\nBelleair Country Club’s restored/renovated West Course is rated tied for fourth place in Golfweek’s Best Private Courses in Florida. The Donald Ross course is ranked 77th in the magazine’s Top Classic Courses all of the United States. To be rated fourth, the West Course was judged by an international panel of raters.\nEnd Mini-Page 20626\nend one-column\nBegin Mini-Page 20642\nEnd Mini-Page 20642\nBegin Mini-Page 20643\nFind Your Home Away from Home\nLearn More About Our Membership Options\nMembership Inquiry\nEnd Mini-Page 20643\nEnd Dynamic Page / ID: 234\nOne Country Club Lane Belleair, Florida 33756\n(727) 461-7171\nCopyright © 2023 All rights reserved. Site by\nClubessential\nSite Scripts\nHide Click to Edits:\nFED Scripts\nBegin Mini-Page 20579\nEnd Mini-Page 20579\nCWS & Content Load\nBegin Mini-Page 20580\nFull Width Nice Forms CSS\nEnd Mini-Page 20580\nEND MASTER PAGE\nDesktop Bottom",
      "emails": []
    },
    {
      "url": "https://www.belleaircc.com/contact-us",
      "is_candidate": false,
      "has_email": false,
      "text": "2025.1.416.462\nSTART MASTER PAGE\nSkip to main content\nHome\nAbout Us\nMembership\nGolf\nAthletics\nAmenities\nContact Us\nLogin\nend header\nStart Dynamic Page\nBegin Mini-Page 20639\nEnd Mini-Page 20639\nBegin Mini-Page 20640\nContact Us\nEnd Mini-Page 20640\nend banner\nBegin Mini-Page 20713\nEnd Mini-Page 20713\nBegin Mini-Page 20714\nWe would love to hear from you!\n1 Country Club Lane Belleair, FL 33756-2098\n727-461-7171\n[email protected]\n(membership inquiries) or\n[email protected]\n(wedding/banquet inquiries)\nEnd Mini-Page 20714\nend card-panels\nBegin Mini-Page 20717\nGeneral Manager/Chief Operating Officer\nEd Shaughnessy, CCM\nEd\n@belleaircc.com\nAssistant General Manager\nMark Poppleton\nMark\n@belleaircc.com\nAssistant General Manager\nPaul Liptak, CEC\nPaull\n@belleaircc.com\nChief Financial Officer\nElaine Wahl, CPA\nElaine\n@belleaircc.com\nDirector of Member Services\nCourtney Cochran\nCourtney\n@belleaircc.com\nDirector of Golf\nJim Slattery, PGA\nJim\n@belleaircc.com\nExecutive Chef\nJoe Walsh\nJoe\n@belleaircc.com\nDirector of Catering\nJoanne Walker\nJoanne\n@belleaircc.com\nDirector of Food and Beverage\nChai Mekadenaumporn\nChai\n@belleaircc.com\nDirector of Tennis & Pickleball\nDrew Wager\nDrew\n@belleaircc.com\nGolf Shop Manager & Buyer\nMyra Merta\nMyra\n@belleaircc.com\nGolf Course Superintendent\nAndy Neiswender\nAndyN\n@belleaircc.com\nDirector of Operations\nJoey Quintana\nJoey\n@belleaircc.com\nDining Room Manager\nTom Brusini\nTom\n@belleaircc.com\nSports Center Manager\nJustin Jerichow\nJustin\n@belleaircc.com\nBreakers Swim Coach\nEric Johnson\nEric\n@belleaircc.com\nExecutive Assistant\nMadison Manusky\nMadison\n@belleaircc.com\nEnd Mini-Page 20717\nend one-column\nEnd Dynamic Page / ID: 262\nOne Country Club Lane Belleair, Florida 33756\n(727) 461-7171\nCopyright © 2023 All rights reserved. Site by\nClubessential\nSite Scripts\nHide Click to Edits:\nFED Scripts\nBegin Mini-Page 20579\nEnd Mini-Page 20579\nCWS & Content Load\nBegin Mini-Page 20580\nFull Width Nice Forms CSS\nEnd Mini-Page 20580\nEND MASTER PAGE\nDesktop Bottom",
      "emails": []
    }
  ],
  "all_links": [
    "https://www.belleaircc.com/about-us",
    "https://www.belleaircc.com/amenities",
    "https://www.belleaircc.com/athletics",
    "https://www.belleaircc.com/membership",
    "https://www.belleaircc.com/contact-us",
    "https://www.belleaircc.com/",
    "https://www.belleaircc.com/home",
    "https://www.belleaircc.com/login",
    "https://www.belleaircc.com/golf"
  ],
  "candidate_links": [
    "https://www.belleaircc.com/about-us",
    "https://www.belleaircc.com/contact-us"
  ],
  "visited": [
    "http://www.belleaircc.com/",
    "http://www.belleaircc.com/about",
    "http://www.belleaircc.com/contact",
    "http://www.belleaircc.com/staff",
    "http://www.belleaircc.com/team",
    "http://www.belleaircc.com/board",
    "http://www.belleaircc.com/directory",
    "http://www.belleaircc.com/events",
    "http://www.belleaircc.com/sitemap.xml",
    "http://www.belleaircc.com/council",
    "http://www.belleaircc.com/leadership",
    "http://www.belleaircc.com/management",
    "http://www.belleaircc.com/producers",
    "http://www.belleaircc.com/support",
    "http://www.belleaircc.com/crew",
    "http://www.belleaircc.com/members",
    "http://www.belleaircc.com/bios",
    "http://www.belleaircc.com/people",
    "http://www.belleaircc.com/artists",
    "http://www.belleaircc.com/musicians",
    "http://www.belleaircc.com/faculty",
    "http://www.belleaircc.com/administration",
    "https://www.belleaircc.com/about-us",
    "https://www.belleaircc.com/contact-us"
  ],
  "base_url": "http://www.belleaircc.com/"
}