{
  "pages": [
    {
      "url": "http://bocagrove.org/about.html",
      "is_candidate": false,
      "has_email": true,
      "text": "About Us\nCherish the Lifestyle\nHistory\nGrove Life\nIn the news\nBoca Grove Cares\nDiscover the pinnacle of luxurious living at Boca Grove.\nWelcome to Boca Grove, the pinnacle of luxurious living in the heart of Boca Raton. Our\n                            exquisite golf and country club community is a serene oasis where residents enjoy a coveted\n                            lifestyle unmatched by any other.\nAt Boca Grove, we believe in living life to the fullest.\nThat's why we've created a community that embodies the highest standards of sophistication,\n                            exclusivity, and refinement. Our members have access to a wealth of world-class amenities,\n                            including an 18-hole championship golf course, state-of-the-art tennis\n                            facility, and a stunning clubhouse that sets the standard for luxury. But Boca Grove is more\n                            than just a place to live. It's a community of like-minded individuals who share a passion\n                            for excellence and a commitment to living\n                            life on their own terms.\nWhether you're mingling with friends at one of our exclusive events, indulging in a gourmet\n                            meal at our world-class restaurant, or simply lounging by the pool, you'll find that life at\n                            Boca Grove is the ultimate expression of luxury and sophistication.\n                            So if you're looking for a place to call home, a place where you can live life to the\n                            fullest, look no further than Boca Grove. Our commitment to excellence is unparalleled, and\n                            our dedication to our members is unwavering.\n                            Join us today and experience the pinnacle of luxurious living in the heart of Boca Raton.\nWith the best location in Boca Raton, Boca Grove is centrally located, directly across from\n                            the Glades Road turnpike exit. We are conveniently located near premier shopping and\n                            fabulous restaurants, and less than six miles from the beach, Boca Grove boasts\n                            more accessibility to beautiful South Florida than any other club in the area. Near Boca\n                            Raton Regional Hospital, one of the best in the state, as well as Top-Rated \"A\" Level\n                            schools at all levels, K through 12, public and\n                            private.\nDiscover\n                            Tradition\nOwn the Lifestyle\nPrime real estate opportunities in Boca Raton's premier country club.\nAt Boca Grove, you can do more than just enjoy a premier country club\n                            lifestyle - you can own it. Boca Grove offers a variety of exquisite homes for sale, in\n                            different settings and styles, for a residential living experience like\n                            nowhere else.\nChoose from seven exclusive subdivisions, each a distinct community of\n                            its own, with unique features, locations and views. Luxurious residences range from upscale,\n                            low-maintenance condominiums and townhomes to zero-lot-line single-family\n                            homes and lavish estate homes, all in a secure, gated environment. Boca Grove has the\n                            perfect home for you.\nEverything you've imagined living in a country club community to be is\n                            here. Sweeping golf course views. Luxurious homes with fine features and finishes.\n                            Picturesque lake views. Unrivaled services and amenities.\nIsn't it time to get the home you've always dreamed of, in a beautiful\n                            country club setting? Or that second home, nestled away from the hustle and bustle of your\n                            busy life. Whatever your desire, whatever your style, Boca Grove\n                            has the perfect home for you.\n<p class=\"mt-3 fade-up\">Ready to see what's available? Click here for our current listing of homes for sale at Boca Grove.</p>\nExplore\n                            Membership\nOur Story...\nTake a walk through time and learn more about our roots\nFounded in 1983 by the LaBonte family, Boca Grove is more than a golf and\n                        tennis clubâitâs a living reflection of Boca Ratonâs evolution. Members still remember when\n                        orange trees lined the fairways, and you could pick fruit during harvest season. âThat orange\n                        grove is a big part of our history,â says Jennifer M. Jolly, the clubâs General Manager. âWeâve\n                        changed with the times, but we havenât changed who we are.â\nEnjoy Our Latest Videos on YouTube\n<h2 class=\"fade-up my-3\">The perfect way to experience everything Boca Grove has to offer.</h2>\nDiscover the ultimate in luxury living with membership at Boca Grove, the\n                        most exclusive golf and country club in Boca Raton. As a member, you'll enjoy access to\n                        top-notch amenities, personalized service, and exclusive events that\n                        showcase the finest in culinary and recreational experiences.\nPrevious\nNext\nWatch Videos\n                        Now\nGrove Life: The Boca Grove Newsletter\nStay in touch with all that's happening at Boca Grove.\nGrove Life is our official Boca Grove newsletter. Each issue is chock-full\n                        of news and information about everything that's happening in our country club community,\n                        including social events, golf, tennis and fitness activities, special\n                        dining events, photos from past activities, and lots more. Read our latest issues by clicking on\n                        any of the covers below.\nBoca Grove is in the news!\nEveryone's talking about the Boca Grove lifestyle. Find all the latest news\n                        here in our News Room, where Boca Grove shines in the spotlight and shares the boutique\n                        lifestyle that our members love. Read our latest press releases and\n                        see our latest media coverage here.\nMedia\n                                articles, features, and more.\n<li class=\"nav-item tab-item-2\" role=\"presentation\">\n                            <button class=\"nav-link\" id=\"profile-tab\" data-bs-toggle=\"tab\" data-bs-target=\"#profile-tab-pane\" type=\"button\" role=\"tab\" aria-controls=\"profile-tab-pane\" aria-selected=\"false\">Greater Boca Raton Chamber of Commerce Radio Show\n                            </button>\n                        </li>\n                        <li class=\"nav-item\" role=\"presentation\">\n                            <button class=\"nav-link\" id=\"contact-tab\" data-bs-toggle=\"tab\" data-bs-target=\"#contact-tab-pane\" type=\"button\" role=\"tab\" aria-controls=\"contact-tab-pane\" aria-selected=\"false\">Links Magazine\n                            </button>\n                        </li>\nMedia\n                                    articles, features, and more.\nBoca Grove Golf & Tennis Club\nBoca Grove featured in Club & Resort\n                                                        Business Magazine:\nTop Ranked Aquatics & Pools 2022\n#1 in Florida\n#7 in the Country\nJennifer Jolly feature in The Form (\n                                                        Spring/Summer 2022 issue)\nChef Dominick Laudia featured in\nClub Resort\n                                                            Chef\n(December 2020)\nDigital Advertising (November 2020)\nClub Management Magazine (page 30\n)\nClub & Resport Business - August 2020\nBoca Raton Observer - April 2020\nThe Golf Insiders Radio\n                                                        Show with Jennifer Jolly at 40:00\nBoca Grove featured in Golf Central Magazine\n                                                        - September 2019\nBoca Grove Awarded Country Club of the Year by Luxury Travel Guide\n                                                    -  January 2019\nAward\nInterview\nBoca Grove Spotlight in Links Magazine - December 2018\nBoca Chamber Radio Business Spotlights of Boca Grove with Director\n                                                    of Marketing and Membership Jennifer Jolly. - November 2018\nBoca Chamber Business Profile of Boca Grove Director of Marketing\n                                                    and Membership, Jennifer Jolly - October 2018\nExecutive Chef Dominick Laudia in the Boca Raton Observer\n                                                    - October 2018 Edition\nMartina Navratilova Interviewed at Boca Grove - August 21, 2018\nSUPERSpotlight in Golf Central Magazine with Rafael Barajas, CGCS -\n                                                    August 2018\nBoca Grove Announces New General Manager and COO - October 27,\n                                                    2017\nBoca Grove Director of Golf Course Operations Rafael Barajas Elected\n                                                    Secretary/Treasurer of Golf Course Superintendents Association of\n                                                    America - July 11, 2017\nBoca Grove Adds Pickleball Courts - June 21, 2017\nExecutive Chef Dominick Laudia in the Sun Sentinel. - August 28,\n                                                    2016\nTimes Square Billboard - July 2016\nBoca Grove Golf and Tennis Clubâs Executive Chef Awarded American\n                                                    Culinary Federation 2016 National Chef Professionalism Award\n                                                    - July 22, 2016\nBoca Grove Golf and Tennis Club's Executive Chef Provides Unique\n                                                    Experiences for Members - June 28, 2016\nBoca Grove Juniors Swinging to the Top - June 27, 2016\nJunior Golfers Take to the Course at Boca Grove to Claim the South\n                                                    Florida Junior PGA Championship Title - June 17, 2016\nExecutive Chef Dominick Laudia is in Today's Grocer. - May 25,\n                                                    2016\nBoca Grove Golf and Tennis Clubâs Executive Chef Awarded 2016\n                                                    Southeast American Culinary Federation Professional Chef Award\n                                                    - March 21, 2016\nBoca Grove Welcomes Seasoned Golf Course Superintendent to the Helm\n                                                    - December 14, 2015\nBoca Grove is in the Boca Raton Forum - November 18, 2015\nBoca Grove Realtor Showcase on October 22, 2015 was the Best Yet!\n                                                    - November 5, 2015\nTennis Pro, Grigor Dimitrov, and Tennis Legend, Ivan Lendl, Put Some\n                                                    Racquets to the Test at Boca Grove Golf & Tennis Club\n                                                    - August 3, 2015\nTennis Pro Kevin Anderson Trains for French Open at Boca Grove -\n                                                    April 17, 2015\nâYappy Hourâ Returns to Boca Grove Golf & Tennis Club - March\n                                                    20, 2015\nBoca Grove Golf & Tennis Announces Non-Resident Annual Golf\n                                                    Membership - January 2015\nBoca Grove's Executive Chef Awarded for Outstanding Professionalism\n                                                    and Community Involvement - December 23, 2014\nBoca Grove featured on CountryClubsinFlorida.com - December 9, 2014\nBoca Grove in SunSentinel - Interfaith event feeds more than 5,000\n                                                    for Thanksgiving - December 1, 2014\nYoung Athletes Crowned SFPGA Junior Champions at Boca Grove - June\n                                                    20, 2014\nBoca Grove in January issue of Boca Exposure - Boca Grove a host\n                                                    facility for the 2014 ITF!\nBoca Grove Publishes Case Study on ezLocator Pin Management\n                                                    Technology - May 20, 2014\nSpain Victorious in 2014 ITF Seniors World Championships Italia Cup\n                                                    Hosted by Boca Grove  - April 28, 2014\nBoca Grove to Host the Italia Cup for the 2014 ITF Seniors World\n                                                    Championships - February 28, 2014\nBoca Grove to Partner with The Allianz Championship Summer Golf\n                                                    Series,\nJM Lexus Drive Fore The Green  - June 5, 2013\nTennis Director Richard Centerbar Named 2013 USPTA Florida Pro of\n                                                    the Year - April 5, 2013\nOlympic Gold Medalist and US Open Champion Andy Murray Returns to\n                                                    Boca Grove - April 11, 2013\nBoca Grove to Host Golf Tournament Benefitting The First Tee of the\n                                                    Palm Beaches - January 1, 2013\nGreater Boca Raton Chamber of Commerce Radio Show\nEvery week Boca Grove's Director of Marketing and Membership Jennifer Jolly gets\n                                        to share a little bit about Boca Grove and what is happening behind our\n                                        gates.\nDecember 2018 Podcasts:\nBoca\n                                                Grove Executive Chef Dominick Laudia\nBoca\n                                                Grove Food and Beverage Cooking Events\nBoca\n                                                Grove Executive Chef Dominick Laudia's Community Involvement\nNovember 2018 Podcasts:\nBoca\n                                                Grove History\nBoca\n                                                Grove Changes and Updates\nBoca\n                                                Grove Thanksgiving and Holiday Junior Camp\nBoca\n                                                Grove Cares with Kevin Anderson's Cause for Paws Event\nLinks Magazine\nDecember 2018\nBoca Grove Cares!\n\"Boca Grove Cares\" is the community involvement initiative at Boca\n                            Grove. For us, giving back to the community is all about \"Time, Talent and Treasure\"!\nOur community involvement includes multiple events during the year\n                            including hosting junior golf tournaments, serving the less fortunate by cooking or baking\n                            and walking for good causes.\n<h4 class=\"fade-up my-3\">Jennifer M. Jolly, General Manager of Boca Grove, is proud to have just received the Jay DiPietro, CCM Most Valuable Member Award for her club efforts during the pandemic.</h4>\n                        <p class=\"mt-4 fade-up fw-bold\">\n                            <a href=\"contact.html\" class=\"btn btn-outline-dark rounded-0 fs-5 p-md-3 me-3\">\n                            Click here\n                        </a><span class=\"d-block d-lg-inline mt-3 mt-lg-0\">to find out more about this news!</span>\n07/25/2023:\n                                Education Foundation, Red Apple Supplies\nEducation\n                                Foundation: Red Apple Supplies\nRoberto Rodriguez,\n                                Making a Difference\nBoca Grove Good News\n                                03.11.23\nA Jolly View\n                                \"Horseplay\" - February 23, 2023\nEquine\n                                Assisted Therapies\n<div class=\"row mt-5\">\n                <div class=\"col-md-6 pe-4 golf1-bg\"></div>\n                <div class=\"col-md-6 ps-4 py-5\">\n                    <h3>BREAKING NEWS!</h3>\n                    <p>Jennifer M. Jolly, General Manager of Boca Grove, is proud to have just received the Jay DiPietro, CCM Most Valuable Member Award for her club efforts during the pandemic.</p>\n                    <p>Since our inception, the Florida Chapter has been recognized by various associations and charities for our leadership, commitment to excellence and philanthropy efforts. Our members are leaders in their communities and clubs.</p>\n                    <p>The Jay DiPietro Award, previously known as the Most Valuable Member Award is awarded annually to a Chapter member who through their service or by their actions are most deserving of the recognition of their peers. Such services or\n                        actions may have come at the Chapter or Regional level, be directly related to FLCMAA programs or activities or to those who provided outstanding service in their club community.</p>\n                    <p>In addition to the pandemic, we are also:</p>\n                    <ul>\n                        <li>managing a $11.5M renovation project scheduled to open in September;</li>\n                        <li>successfully completed the vote to merge our club with our POA; and</li>\n                        <li>Jolly is one of only 61 women worldwide to carry the CCM designation</li>\n                    </ul>\n                    <p>Jolly has been recognized for her outstanding service to our community including:</p>\n                    <ul>\n                        <li>serving on the Board of the Greater Boca Chamber of Commerce;</li>\n                        <li>active member of Rotary International through Boca Ratonâs Sunshine Rotary;</li>\n                        <li>active in many local charities including Best Foot Forward, Boys &amp; Girls Club, Equine Assisted Therapy of South Florida, Florence Fuller, George Snow Schloarship Foundation, Nat King Cole Generation Hope, SOS Childrenâs Village\n                            and Unicorn Foundation just to name a few!</li>\n                    </ul>\n                    <h3>Congratulations Jennifer! We are so proud to have you as our leader!</h3>\n\n                    <hr> <a href=\"https://bocagrove.org/getmedia/5d2df243-6cb2-47c8-b2aa-7bddb67051fa/BG_Cares_Equine_Assisted_Therapies_02_21_23_AD_v07.aspx\" target=\"_blank\">A Jolly View \"Horseplay\" - February 23, 2023</a>\n                    <br>\n                    <a href=\"https://bocagrove.org/getmedia/0899ca1d-5c6b-40f4-b221-fc78b39f81f9/2023_03_10_23_PHILIP_GABES_BABY.aspx\" target=\"_blank\"> Boca Grove Good News 03.11.23</a>\n                    <hr>\n                    <h3>\"Boca Grove Cares\" Campaigns</h3>\n                    <ul class=\"li-styled\">\n                        <li>Meals on Wheels \"Pie it Forward\"</li>\n                        <li>Boca Helping Hands</li>\n                        <li>Navy SEALs Fund</li>\n                    </ul>\n                </div>\n            </div>\n<div class=\"row pt-5\">\n                <div class=\"col-md-8\">\n\n                    <h3>\"Boca Grove Cares\" Campaigns</h3>\n                    <ul class=\"li-styled\">\n                        <li>Meals on Wheels \"Pie it Forward\"</li>\n                        <li>Boca Helping Hands</li>\n                        <li>Navy SEALs Fund</li>\n                    </ul>\n\n                </div>\n            </div>\nContact\nBoca Grove, 21351 Whitaker Drive Boca Raton, FL 33433\n561-487-5300\n561-488-4895\ncontact@bocagrove.org\nLinks\nGolf\n/\nThe Curve\n/\nRacquet Sports\n/\nDining & Social\nHome\n/\nAbout\n/\nCareer\n/\nContact\n<hr class=\"w-25 my-4\">\nPrivacy Policy\n© 2023 Boca Grove. All rights reserved.",
      "emails": [
        "contact@bocagrove.org"
      ]
    },
    {
      "url": "http://bocagrove.org/contact.html",
      "is_candidate": false,
      "has_email": true,
      "text": "Contact Us\nLeave us a message, for anything you need\nMembership Inquiry\nPlease complete the form below and our team will be in touch.\nContact Information\nFirst Name:*\nPlease enter your first name.\nLast Name:*\nPlease enter your last name.\nAddress 1:\nAddress 2:\nCity:\nState:\nPostal Code:\nHow should we contact you?\nHome Phone:*\nPlease enter your phone number.\nEmail Address:*\nPlease enter a valid email.\nComments or Additional Information:\nHow did you hear about us?:*\nRealtor\nCurrent Member\nFormer Member\nGoogle Search\nOther Internet Search\nDrove by Course\nOther\nContact\nBoca Grove, 21351 Whitaker Drive Boca Raton, FL 33433\n561-487-5300\n561-488-4895\ncontact@bocagrove.org\nLinks\nGolf\n/\nThe Curve\n/\nRacquet Sports\n/\nDining & Social\nHome\n/\nAbout\n/\nCareer\n/\nContact\n<hr class=\"w-25 my-4\">\nPrivacy Policy\n© 2023 Boca Grove. All rights reserved.",
      "emails": [
        "contact@bocagrove.org"
      ]
    },
    {
      "url": "http://bocagrove.org/membership.html",
      "is_candidate": false,
      "has_email": true,
      "text": "Membership\nCherish the Lifestyle\nExperience the ultimate in elegance and exclusivity with a membership at Boca Grove. From exhilarating rounds of golf to luxurious evenings in the Grove Room, members enjoy a lifestyle unmatched by any other country club community\n                            in the world. As a mandatory membership community, Boca Grove offers something for everyone, whether you're an avid golfer, tennis player, or simply enjoy the finest in culinary and recreational experiences.\nBe a part of this rich tradition. Enjoy the luxurious amenities reserved for members. Delight in the lifestyle of this illustrious community. Join the distinguished roster of Boca Grove members.\nPrime real estate opportunities in Boca Raton's premier country club.\nAt Boca Grove, you can do more than just enjoy a premier country club lifestyle - you can own it. Boca Grove offers a variety of exquisite homes for sale, in different settings and styles, for a residential living experience\n                                like nowhere else.\nChoose from seven exclusive subdivisions, each a distinct community of its own, with unique features, locations and views. Luxurious residences range from upscale, low-maintenance condominiums and townhomes to zero-lot-line\n                                single-family homes and lavish estate homes, all in a secure, gated environment. Boca Grove has the perfect home for you.\nEverything you've imagined living in a country club community to be is here. Sweeping golf course views. Luxurious homes with fine features and finishes. Picturesque lake views. Unrivaled services and amenities.\nIsn't it time to get the home you've always dreamed of, in a beautiful country club setting? Or that second home, nestled away from the hustle and bustle of your busy life. Whatever your desire, whatever your style, Boca Grove\n                                has the perfect home for you.\nReady to see what's available?\nClick here\nfor our current listing of homes for sale at Boca Grove.\nCONTACT US TODAY\nCommunity & Real Estate\nSeven unique subdivisions offer something for every homebuyer.\nAt Boca Grove, you can choose from a variety of luxurious residences in seven exclusive subdivisions. Each subdivision in a distinct community unto itself, with a unique setting, ambience, and style of homes that truly sets it apart.\n                        Whatever your preference, Boca Grove has the perfect home for you.\n1.\nChateau\nL\nuxury condominiums in a sleek, six-story building. Enjoy a full suite of amenities including concierge service and your own private elevator to take you directly to your residence. An intimate collection\n                                    of 24 condos, each with its own two car garage.\n2.\nCoventry\nS\ningle-family living at its finest. 30 beautiful zero-lot-line homes featuring picturesque golf course views on the first and sixth fairways.\n3.\nEstates\nS\npacious single-family estate homes in an intimate setting. Only 13 homes in all; half of which overlook the fifteenth hole.\n4.\nGardens in the Grove\nC\nharming garden homes offering convenience and luxury. 24 residences located in two buildings, with convenient parking underneath. Residents enjoy a private pool and meeting room.\n5.\nIslands in the Grove\nA\nn idyllic community of 56 single-family homes. Residents enjoy private backyards and gorgeous lake views.\n6.\nLos Rayos\nA\nmixed community comprised of 24 luxurious townhouses and ten single-family zero-lot-line homes. The best of both worlds.\n7.\nSingle Family Homes\nB\noca Groveâs community of single-family homes provides all the ambiance of a traditional old fashioned neighborhood. 250 single family custom homes set among tree lined sidewalks. The prefect setting\n                                    for neighbors to become friends.\n<div class=\"col-md-6 px-md-0\">\n                    <p class=\"text-white w-max-600\">Take a bird's-eye look at Boca Grove Plantation with our property map. See how thoughtfully planned and conveniently set each of our seven distinct subdivisions are within the community, with the clubhouse at the center of it all.\n                        Homes are naturally woven throughout the property, among lakes, fairways, and lush landscaping. It's the ideal setting for the perfect country club lifestyle.</p>\n                </div>\n                <div class=\"col-md-6 px-md-0 ps-md-3\">\n\n                    <a class=\"btn btn-outline-light fs-5 rounded-0 py-2 p-lg-5 w-100 text-uppercas\" href=\"https://bocagrove.clubhouseonline-e3.net/getmedia/a5466184-a798-44f0-8d76-9c9acef92dce/site_map-1a.aspx\" target=\"_blank\">Boca Grove Plantation Property Map</a>\n\n                </div>\nDisclaimer\nThe information in this website is provided for promotional purposes only. Boca Grove does not claim ownership of the real estate listings. Content including property details, pricing or imaging on this website have not been independently\n                            verified and cannot be guaranteed. All information offered within this website should be independently verified by a real estate professional. Boca Grove assumes no responsibility for the accuracy or appropriateness of the\n                            information, data, opinions, advice or statements. By visiting the Boca Grove website, you are doing so at your own risk.\nIn providing links to the other sites, Boca Grove is in no way acting as a publisher or disseminator of the material contained on those other sites and does not seek to monitor or control such sites. A link to another site should\n                            not be construed to mean that Boca Grove is affiliated or associated with the same.\nBoca Grove accepts no liability for any losses or damages (whether direct, indirect, special, consequential or otherwise) arising out of errors or omissions contained in this website. Boca Grove reserves the right to update, add,\n                            amend, remove, replace or change any part of the website content, including but not limited to functionality and navigation at any time without prior notice. Boca Grove shall not be liable for distortion of data arising from\n                            any technical fault including transmission errors, technical defects, interruptions, third party interventions or viruses.\nWebsite content is provided at the readerâs own risk and the reader will not hold the parties involved in creating, producing or delivering this information liable for any loss, injury, claim, liability, or damage of any kind resulting\n                            in any way from any errors in or omissions from the information. Laws and taxes vary from state to state. You should consult with your individual CPA or tax attorney when purchasing or selling real estate.\nTHE CONTENT MAY NOT BE ACCURATE, UP TO DATE, COMPLETE OR UNTAMPERED, AND IS NOT TO BE RELIED UPON.\nTHE CONTENT SHOULD NOT BE INTERPRETED AS A RECOMMENDATION FOR ANY SPECIFIC PRODUCT OR SERVICE, USE OR COURSE OF ACTION. YOU SHOULD NOT ACT OR RELY ON ANY OF THE CONTENT WITHOUT SEEKING ADVICE OF A LAWYER OR OTHER QUALIFIED PROFESSIONAL.\nTHE INFO PROVIDED IS NOT INTENDED TO SUBSTITUTE FOR THE ADVICE OF A LAWYER OR OTHER QUALIFIED PROFESSIONAL.\nSAFETY & SECURITY\nThe safety of our residents is our top priority. To that end, we employ a dedicated and experienced group of security personnel who ensure that our gated community is secure around the clock.\nOur streets are patrolled daily and in addition to daytime and nighttime thermal imaging cameras stationed at the perimeter of our property, we also utilize a convenient emergency notification system for critical phone and text communications to our residents.\n                                Additional technology we offer includes a gate access mobile app by which residents may conveniently add guests to their entry lists day or night.\nIn addition, a mass notification system called CodeRED is utilized by our community that sends personalized emergency alert messages via call or text to members that register with Boca Grove.\nEnjoy peace of mind at Boca Grove, whether you will be a full-time resident or will consider us your home away from home!\nAvailable Country Club Memberships\nAt Boca Grove, we hold our members to the highest standards of excellence, and all memberships are subject to a thorough background check, as permitted by law. Join our community today and discover why Boca Grove is the premier destination for those who\n                            demand the very best in life.\n<p class=\"fade-up my-3\">Choose from a range of exclusive membership options tailored to fit your unique lifestyle and preferences, and join the discerning few who demand the very best in life.\n                        </p>\nExplore our community and contact us today to Take the First Step toward Joining Boca Grove.\nEquity Membership for Boca Grove Residents\nWhether putting on the green or serving on clay, Boca Grove is your escape from the everyday.\nWhen you live in the country club community of Boca Grove, you're afforded a number of exclusive amenities just for equity members. For the golfer, we offer 18-holes of championship golf with no tee times. While the\n                                        hazards are as challenging as ever, playing this coveted course has never been easier. Members enjoy unlimited use of the course, without paying green fees. Just pay golf cart rental fees or own a personal golf\n                                        cart and this course is your personal playground.\nNot into golf? Work out in the fitness center then luxuriate in the pool. Play Doubles or Get into Pickleball then enjoy dinner in Windows. Live life at a new level of luxury, with a Boca Grove.\n<div class=\"accordion-item\">\n                            <h2 class=\"accordion-header\" id=\"flush-headingTwo\">\n                                <button class=\"accordion-button collapsed\" type=\"button\" data-bs-toggle=\"collapse\" data-bs-target=\"#flush-collapseTwo\" aria-expanded=\"false\" aria-controls=\"flush-collapseTwo\">\n                                    The Boca Grove Builder/Renovator Program\n\n                            </button>\n                            </h2>\n                            <div id=\"flush-collapseTwo\" class=\"accordion-collapse collapse\" aria-labelledby=\"flush-headingTwo\" data-bs-parent=\"#accordionFlushExample\">\n                                <div class=\"accordion-body\">\n                                    <p class=\"my-3 fade-up\">Renovate properties inside the community, without having to become a full-fledged member.</p>\n                                    <p class=\"my-3 fade-up\">In Boca Grove, we don't allow restrictive membership structures to stagnate the redevelopment of homes inside the community. With the Boca Grove exclusive Builder/Renovator Program, highly-qualified builders can renovate\n                                        properties inside the community without becoming a long-term, full-fledged member.</p>\n                                    <p class=\"my-3 fade-up\">As part of the Builder/Renovator Program, simply pay the required fees at the time that you purchase the home. Once the property is rehabilitated and sold to a third party that becomes an equity member, you'll receive\n                                        back all fees, less funds due to the Club.</p>\n                                </div>\n                            </div>\n                        </div>\n<a href=\"contact.html\" class=\"btn btn-outline-light rounded-0 fs-5 p-md-2 me-3\">\n                        Message us\n                    </a>\n                    <span class=\"d-block d-lg-inline mt-3 mt-lg-0\">to learn More About Boca Grove's Membership Options</span>\nMembership Inquiry\nPlease complete the form below and we will provide you the information you need.\nWhether you're interested in the Resident Equity or Builder's Program membership options, complete the form below and we will provide you the information you need.\nContact Information\nFirst Name:*\nPlease enter your first name.\nLast Name:*\nPlease enter your last name.\nAddress 1:\nAddress 2:\nCity:\nState:\nPostal Code:\nHow should we contact you?\nHome Phone:*\nPlease enter your phone number.\nEmail Address:*\nPlease enter a valid email.\nComments or Additional Information:\nHow did you hear about us?:*\nRealtor\nCurrent Member\nFormer Member\nGoogle Search\nOther Internet Search\nDrove by Course\nOther\nContact\nBoca Grove, 21351 Whitaker Drive Boca Raton, FL 33433\n561-487-5300\n561-488-4895\ncontact@bocagrove.org\nLinks\nGolf\n/\nThe Curve\n/\nRacquet Sports\n/\nDining & Social\nHome\n/\nAbout\n/\nCareer\n/\nContact\n<hr class=\"w-25 my-4\">\nPrivacy Policy\n© 2023 Boca Grove. All rights reserved.",
      "emails": [
        "contact@bocagrove.org"
      ]
    }
  ],
  "all_links": [
    "http://bocagrove.org/privacy-policy.html",
    "http://bocagrove.org/dining-and-social.html",
    "http://bocagrove.org/golf.html",
    "http://bocagrove.org/about.html",
    "http://bocagrove.org/glimpse.html",
    "http://bocagrove.org/racquet-sports.html",
    "http://bocagrove.org/contact.html",
    "http://bocagrove.org/index.html",
    "http://bocagrove.org/membership.html#real-estate",
    "http://bocagrove.org/membership.html",
    "http://bocagrove.org/the-curve.html"
  ],
  "candidate_links": [
    "http://bocagrove.org/about.html",
    "http://bocagrove.org/contact.html",
    "http://bocagrove.org/membership.html"
  ],
  "visited": [
    "http://bocagrove.org/",
    "http://bocagrove.org/about",
    "http://bocagrove.org/contact",
    "http://bocagrove.org/staff",
    "http://bocagrove.org/team",
    "http://bocagrove.org/board",
    "http://bocagrove.org/directory",
    "http://bocagrove.org/events",
    "http://bocagrove.org/sitemap.xml",
    "http://bocagrove.org/council",
    "http://bocagrove.org/leadership",
    "http://bocagrove.org/management",
    "http://bocagrove.org/producers",
    "http://bocagrove.org/support",
    "http://bocagrove.org/crew",
    "http://bocagrove.org/members",
    "http://bocagrove.org/bios",
    "http://bocagrove.org/people",
    "http://bocagrove.org/artists",
    "http://bocagrove.org/musicians",
    "http://bocagrove.org/faculty",
    "http://bocagrove.org/administration",
    "http://bocagrove.org/about.html",
    "http://bocagrove.org/contact.html",
    "http://bocagrove.org/membership.html"
  ],
  "base_url": "http://bocagrove.org/"
}