{
  "pages": [
    {
      "url": "http://www.bocawoodscc.com/realestate",
      "is_candidate": false,
      "has_email": false,
      "text": "Google Tag Manager (noscript)\nEnd Google Tag Manager (noscript)\nAbout the Club\nMembership\nRequest Information\nMeet the Team\nPhilanthropy\nLifestyle\nCommunity Overview\nSocial & Clubs\nReal Estate\nEvents & Videos\nClub Tour\nGolf\nThe Lakes Course\nThe Woods Course\nMeet our Golf Pros\nRacquet Sports\nTennis\nPickleball\nBocce\nMeet our Racquet Sports Team\nWellness\nFitness\nSpa Services\nMeet our Wellness Team\nDining\nOverview\nMeet our F&B Team\nContact Us\nGet in Touch\nDirections\nCareers\nimage\nMenu\nAbout the Club\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nMembership\nRequest Information\nMeet the Team\nPhilanthropy\nLifestyle\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nCommunity Overview\nSocial & Clubs\nReal Estate\nEvents & Videos\nClub Tour\nGolf\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nThe Lakes Course\nThe Woods Course\nMeet our Golf Pros\nRacquet Sports\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nTennis\nPickleball\nBocce\nMeet our Racquet Sports Team\nWellness\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nFitness\nSpa Services\nMeet our Wellness Team\nDining\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nOverview\nMeet our F&B Team\nContact Us\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nGet in Touch\nDirections\nCareers\nimage\nMember Login\nxml version='1.0' encoding='UTF-8'?\nReal Estate\nIt’s Time to Embrace the Lifestyle You have Dreamed of\nPRIME REAL ESTATE IN BOCA RATON\nThere has never been a better time to choose a community which will afford you the unparalleled lifestyle our members enjoy.\nBoca Woods is set in a lushly landscaped and secure environment surrounded by two outstanding championship golf courses. Select your new home from a variety of custom designed estate homes or easy to maintain, light and spacious patio homes. Our 645 contemporary floor plans were designed with volume ceilings and large windows affording magnificent views of wide green fairways and sparkling lakes. The comfortable floor plans make our community most attractive for buyers in search of intimate club living and easy golf access. Most homes come complete with a swimming pool, two or three car garages, and a place to park your own private golf cart.\nBoca Woods is a professionally managed, financially stable member-owned mandatory membership club, with 24-hour gated security, and Valet service at the Clubhouse when you want to enjoy an array of resort-style amenities, dining and socializing.\nContact Membership\nShow Web Content (Article), Last Updated By:\nCOMMUNITY MAP\nBoca Woods is the Perfect Community for an Active Lifestyle\nEnjoy a great workout biking or strolling the three-mile loop on Boca Woods Lane around the community and enjoy the beautiful views. Boca Woods' main entrance is located on State Road 441, between Palmetto Park Road and Glades Road in Boca Raton. Our private resident's entrance is located just west of State Road 441 on Palmetto Park Road.\nShow Web Content (Article), Last Updated By:\n<div class=\"footer-logo\">\r\n\t\t\t\t\t\t\t\t<img alt=\"Boca Woods CC logo\" title=\"Boca Woods Country Club\" src=\"https://www.bocawoodscc.com/BocaWoodsCC-theme/images/club-images/footer-logo.png\"/>\r\n\t\t\t\t\t\t\t</div>\n10471 Boca Woods Ln. Boca Raton, FL 33428\nPhone:\n561.487.2800\nMember Login\nContact Us\nCareers\nMap & Directions\n<ul>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"viewprofile\">My Info</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"calendar-of-events\">Calendar Of Events</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"racquet-sports\">Racquet Sports</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"golf\">Golf</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"overview-contact\">Contact Us</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"careers\">Careers</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"https://goo.gl/maps/8bxYph6UKRuqRsB3A\" target=\"_blank\">Map & Directions</a></li>\r\n\t\t\t\t\t\t\t\t</ul>\n© Boca Woods Country Club\nPowered by\nNorthstar Technologies\nFollow Us\nMember Login\nHome Banner\nInner Banner",
      "emails": []
    },
    {
      "url": "https://www.bocawoodscc.com/meet-the-pros-wellness",
      "is_candidate": false,
      "has_email": false,
      "text": "Google Tag Manager (noscript)\nEnd Google Tag Manager (noscript)\nAbout the Club\nMembership\nRequest Information\nMeet the Team\nPhilanthropy\nLifestyle\nCommunity Overview\nSocial & Clubs\nReal Estate\nEvents & Videos\nClub Tour\nGolf\nThe Lakes Course\nThe Woods Course\nMeet our Golf Pros\nRacquet Sports\nTennis\nPickleball\nBocce\nMeet our Racquet Sports Team\nWellness\nFitness\nSpa Services\nMeet our Wellness Team\nDining\nOverview\nMeet our F&B Team\nContact Us\nGet in Touch\nDirections\nCareers\nimage\nMenu\nAbout the Club\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nMembership\nRequest Information\nMeet the Team\nPhilanthropy\nLifestyle\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nCommunity Overview\nSocial & Clubs\nReal Estate\nEvents & Videos\nClub Tour\nGolf\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nThe Lakes Course\nThe Woods Course\nMeet our Golf Pros\nRacquet Sports\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nTennis\nPickleball\nBocce\nMeet our Racquet Sports Team\nWellness\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nFitness\nSpa Services\nMeet our Wellness Team\nDining\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nOverview\nMeet our F&B Team\nContact Us\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nGet in Touch\nDirections\nCareers\nimage\nMember Login\nMeet our Wellness Team\nShannon Watt\nDirector of Wellness\n561.487.2800 Ext:207\nShannon Watt has been the Director of Fitness at Boca Woods for the past 17 years. Over the past years, she has developed long-lasting relationships with our Members of this community. Having a community of Members and fellow staff to help share in life’s biggest celebrations has been really rewarding. It is like a family away from home. I enjoy taking part of the health and wellness of our Members, by helping them improve their golf swing, endurance for racquet sports, or just improving working with them to improve their overall strength.\nShannon is a graduate of Florida Atlantic University with a Bachelor’s Degree in Exercise Science and Health Promotions. She is a Certified Health Fitness Specialist through the American College of Sports Medicine, and she has certifications in Water and Group Fitness. She is also a Certified Titleist Performance Institute Golf Fitness instructor that specializes in prehabilitation and post-rehabilitation golf fitness and functional training.\nBarbara Crayon, CPT\nPersonal Trainer\nOriginally from New York City, graduated with a degree in Sociology from Queens College. Attended the Cambridge School of Business and the Swedish Massage Institute In Manhattan. Upon moving to Boca Raton studied at the Fitness Institute and is certified as a personal trainer through ACE as well as a water fitness instructor through the U.S. Water Fitness Association. Barbara has been in the wellness industry for 40 years. She currently teaches boot camp, water aerobics, and is a personal trainer in the gym and in the pool.\nMichelle Travick\nPersonal Trainer\nMichelle earned her Bachelor’s degree in Sports and Health Sciences from American Public University, and is currently working on a Master’s degree in Public Health. She is also certified from the National Strength and Conditioning Association. In addition, Michelle attended the Institute for Integrative Nutrition in New York City, and is a certified Holistic Health Counselor with a focus in nutrition. Michelle has an extensive background in dance and performance arts, and worked professionally as a dancer before beginning a career in exercise and fitness. On a personal note, she is the mother of two beautiful children, enjoys an active and healthy lifestyle, and using health and fitness to inspire others to live the lives of their dreams.\nYana Strenkman\nNail Technician\n561.487.2800 Ext:203\nYana Has over 35 years of experience providing meticulous Manicure and Pedicures and Waxing services.\nYana is here on Mondays by appointment.\nPlease call 561-487-2800 ext. 203 to make your appointment!\nEkaterina Motyakina\nNail Technician\nEkaterina has over 8 years of experience providing meticulous Manicure and Pedicures.\nShe stays current on styles and trends and can do Gel and Dip Powder and Extensions, brow/lash tint and face waxing.\nEkaterina is here on Tuesday Wednesday Thursday!\nGiselle Seibert\nNail Technician\nGiselle has 20 years of experience in the beauty industry, Giselle specializes in Spa Manicures, Pedicures, Gel Polish, Dazzle Dry Polish, and Paraffin Treatments.\nHer passion for creativity and meticulous attention to detail are matched only by her dedication to exceptional customer service. Known for her personalized approach, Giselle is committed to helping her clients look and feel their absolute best.\nGiselle is available for appointments on Fridays.\nJanine Glickman\nMassage Therapist & Esthetician\nJanine has 26 years of experience with massage and esthetician work.  She is a graduate of the Swedish Institute of Massage therapy in New York City and expanded her love of skincare with attending the Aveda Institute.\nShe performs massage and facials, including dermaplaning, high frequency, red light and many more modalities.\nJanine is available by appointment on Tuesday mornings, Thursdays and Fridays.\nChristine Falzone\nMassage Therapist\nChristine has over 10 years of experience in massage therapy, she is able to perceive and address the unique needs of each client.\nShe works with integrated holistic practices that align the mind, body and soul, by using such techniques like; energy healing, meditation and bodywork.\nHer passion for healing and empowering individuals to connect with their inner selves to live more fulfilling, authentic and harmonious lives.\nChristine is available by appointment on Monday, Wednesday and Saturday morning.\nKay Sainchuk\nPersonal Trainer\nKay is originally from Ukraine. She has been a trainer for over five years and loves working with people of different fitness levels. She has experience in HIIT, post rehabilitation and sport specific training. She wants to help you discover the benefits of training, and she’s here to guide you every step of the way.\nSuyapa Hernandez\nHair Stylist\nSuyapa’s passion is her career as a professional hair stylist with over 20 years experience working as a salon manager in the Regis Corporation in Miami, Hollywood and Hallandale. Suyapa is a Matrix color professional, and she has keratin certification. She looks forward to meeting the members at Boca Woods Country Club.\nNicole Trombetto\nPersonal Trainer\nNicole has been in the wellness and fitness space for over twenty years. She is a native of Pittsburgh, PA where she completed her BA in Dance Pedagogy. She is a graduate from The Pittsburgh School of Pain Management 900-hour program with an emphasis on Travell and Simon Myofascial Trigger Point Therapy. Nicole also graduated from the National Personal Training Institute 600-hour state approved program and has been a Certified Personal Trainer with NASM since 2005. Continuing her education, she graduated from Lynn University where she obtained her MBA in Healthcare and Sports Management. Most recently, she completed a one-year program for Health Coaching from the Institute of Integrative Nutrition (IN).Nicole has the following certifications: Health and Wellness Coaching and Mat Pilates from The Spencer Institute, Osteoporosis Fitness Specialist from MedFit Classroom and Menopause Coaching Specialist from Girls Gone Strong. An additional specialty Nicole has studied is the MELT Method created by Sue Hitzmann with the hand and foot treatment plus full roller. When she is not training clients, she stays active with her three high energy children.\nJonathon De Souza\nPersonal  Trainer\nJonathon has a background in Sports Medicine and\nFitness Technology. He speaks 3 languages, (English, Spanish & Portuguese).\nHe has been a Personal Trainer for over four years. He is a power lifting athlete and is active in that\ncommunity.\nHe specializes in\nFacilitative Stretching. It helps with client mobility and flexibility.\nHe is looking forward to helping the member’s with their goals.\nShow Web Content (Article), Last Updated By:\nWant to contact our Wellness Team?\nREQUEST MORE INFORMATION\nPlease fill out our online form to learn more about Boca Woods Country Club.\nClick here to Contact Us\nShow Web Content (Article), Last Updated By:\n<div class=\"footer-logo\">\r\n\t\t\t\t\t\t\t\t<img alt=\"Boca Woods CC logo\" title=\"Boca Woods Country Club\" src=\"https://www.bocawoodscc.com/BocaWoodsCC-theme/images/club-images/footer-logo.png\"/>\r\n\t\t\t\t\t\t\t</div>\n10471 Boca Woods Ln. Boca Raton, FL 33428\nPhone:\n561.487.2800\nMember Login\nContact Us\nCareers\nMap & Directions\n<ul>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"viewprofile\">My Info</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"calendar-of-events\">Calendar Of Events</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"racquet-sports\">Racquet Sports</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"golf\">Golf</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"overview-contact\">Contact Us</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"careers\">Careers</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"https://goo.gl/maps/8bxYph6UKRuqRsB3A\" target=\"_blank\">Map & Directions</a></li>\r\n\t\t\t\t\t\t\t\t</ul>\n© Boca Woods Country Club\nPowered by\nNorthstar Technologies\nFollow Us\nMember Login\nHome Banner\nInner Banner",
      "emails": []
    },
    {
      "url": "https://www.bocawoodscc.com/meet-the-team",
      "is_candidate": false,
      "has_email": true,
      "text": "Google Tag Manager (noscript)\nEnd Google Tag Manager (noscript)\nAbout the Club\nMembership\nRequest Information\nMeet the Team\nPhilanthropy\nLifestyle\nCommunity Overview\nSocial & Clubs\nReal Estate\nEvents & Videos\nClub Tour\nGolf\nThe Lakes Course\nThe Woods Course\nMeet our Golf Pros\nRacquet Sports\nTennis\nPickleball\nBocce\nMeet our Racquet Sports Team\nWellness\nFitness\nSpa Services\nMeet our Wellness Team\nDining\nOverview\nMeet our F&B Team\nContact Us\nGet in Touch\nDirections\nCareers\nimage\nMenu\nAbout the Club\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nMembership\nRequest Information\nMeet the Team\nPhilanthropy\nLifestyle\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nCommunity Overview\nSocial & Clubs\nReal Estate\nEvents & Videos\nClub Tour\nGolf\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nThe Lakes Course\nThe Woods Course\nMeet our Golf Pros\nRacquet Sports\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nTennis\nPickleball\nBocce\nMeet our Racquet Sports Team\nWellness\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nFitness\nSpa Services\nMeet our Wellness Team\nDining\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nOverview\nMeet our F&B Team\nContact Us\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nGet in Touch\nDirections\nCareers\nimage\nMember Login\nMeet our F&B Team\nCULINARY STAFF\nJeffrey Terentieff\nExecutive Chef\n561.487.2800 ext: 126\nOriginally born and raised in Connecticut, Chef Jeff Terentieff hails from a family deeply rooted in the food and beverage industry. After a decorated service in the U.S. Army, he attended The Culinary Institute of America. Relocating to Boca Raton in 1999, Jeff continued to carve his path in upscale restaurants.\nIn 2006, he made the leap into the world of country clubs starting at Boca West Country Club, and quickly working his way up to the role of Executive Sous Chef. After 10 years he was offered his first Executive chef position at Gleneagles Golf & Country Club in Delray Beach and then at Aberdeen Golf & Country Club in Boynton Beach.\nMost recently, Jeff returned to Boca West, overseeing a substantial $13 million annual F&B operation, and playing a pivotal role in the $70 million clubhouse renovation. Jeff currently resides in East Boca with his 3 young children. He loves to cook at home as well as engulf himself in all things related. Jeff is an avid golfer, active church member, gym fanatic, and lover of all things outdoors.\nRowan Newman\nExecutive Sous Chef\n561.487.2800 ext: 127\nRowan Newman joined Boca Woods in 2021. He has almost 20 years of experience working in Palm Beach County Country Clubs. He started his career at Boca West Country Club as an international employee from Capetown, South Africa. This is where he worked his way into a management training program that allowed him to stay on staff year-round. He remained at Boca West for nearly ten years, where he gained the knowledge to work every outlet of the seven fullservice restaurants on site, his favorite being the fine dining steak house.\nWhen given the opportunity to further his career, Rowan moved to Hunters Run Country Club in Boynton Beach in 2013. This is where he began broadening his knowledge of food, menu writing, and teamwork as a Sous Chef. He remained at Hunters Run until now, and he is excited to be a part of such a talented management team that is so passionate about their crafts. He looks forward to adding his expertise to the group. Rowan is a Boca Raton resident where he lives with his wife and children.\nDevlin Page\nDirector of Dining Operations\n[email protected]\n(561) 487-2800 ext.143\nDevlin Wilkie-Page is an experienced Senior Food and Beverage Manager with nearly a decade in the hospitality industry. His career began in the United States under the H2B visa program at Gleneagles Country Club, laying a strong foundation for his growth in the field. Over the years, Devlin has gained valuable experience across prestigious clubs, including Ridgewood Country Club, the River Club, and the Atlanta Athletic Club, managing diverse dining and event operations.\nServing as Senior Food and Beverage Manager at the Atlanta Athletic Club in Georgia, Devlin oversees menu development, staff recruitment, inventory management, and member relations, with a focus on financial efficiency and quality service. His expertise in banquet and event management, relationship-building, and strategic operations is complemented by his active involvement in the Georgia Chapter of the Club Management Association of America.\nDevlin is excited to bring his experience and dedication to Boca Woods as he joins the team, eager to deliver high-quality dining experiences and build meaningful relationships with Members.\nJordan Findlay\nFood& Beverage Operations Manager\n[email protected]\n(561) 487-2800 ext.135\nJordan Findlay, hailing from South Africa, embarked on his American journey on a H2B visa. His rise in the hospitality industry is marked by his tenure at various esteemed country clubs on the East Coast of the USA.\nStarting as a server assistant in 2016, Jordan's dedication and passion led him to ascend in the industry through the roles of Server, Captain, Food and Beverage Supervisor which all built is foundation to his current role as Operations Manager, where he now oversees complex operations and ensures excellence in service.\nWith a keen focus on fine dining experiences, Jordan grew his expertise with renowned establishments such as Boca West Country Club, Ibis Country Club, Baltusrol Golf Club, and more.\nHis journey reflects a commitment to creating unforgettable events, delivering exceptional service, and orchestrating lively parties.\nJordan's passion for learning and advancing his education is a driving force in his career. Committed to personal and professional growth, he continues to seek opportunities to expand his knowledge and skills in the dynamic field of hospitality. His continuous expansion of his education sets the stage for a promising and evolving career in the industry.\nShow Web Content (Article), Last Updated By:\nShow Web Content (Article), Last Updated By:\n<h1>\n\tTake Out Menus\n</h1>\n\n<p>\n\tTo place your to-go order call 561.487.2800 and select option 1 for Dining.<br>\n\tScroll down to see all the To Go Menus available.\n</p>\n\n<p>\n\tWeekday Breakfast To-Go<br>\n\t7 days a week 7:00 AM &#8211; 11:00 AM<br>\n\tPick-up at valet\n</p>\n <p>\n\t<img alt=\"Weekday Breakfast\" src=\"/documents/10184/15473/Weekday+Breakfast.jpg\">\n</p>\n\n<h2>\n\tWeekend Dine-In Breakfast Service\n</h2>\n\n<p>\n\tSaturday & Sunday 8:00 AM &#8211; 11:00 AM<br>\n\tA la carte service only\n</p>\n\n<p>\n\t<a class=\"btn btn-primary\" href=\"#.\" target=\"_blank\">View Menu</a>\n</p>\n\n<hr>\n <p>\n\t<img alt=\"Weekend Dine-In Breakfast\" src=\"/documents/10184/15473/Weekend+Dine-In+Breakfast.jpg\">\n</p>\n<h3>\n\tThe Woods Sunday Brunch - Dine In\n</h3>\n\n<p>\n\t11:30 AM &#8211; 2:30 PM<br>\n\tDress Code: GA<br>\n\t(Bar Bite Menu also available)\n</p>\n\n<p>\n\t<a class=\"btn btn-primary\" href=\"#.\" target=\"_blank\">View Menu</a>\n</p>\n\n<hr>\n<h3>\n\tSunday Brunch To-Go\n</h3>\n\n<p>\n\t11:30 AM &#8211; 2:30 PM<br>\n\tPick up at Valet<br>\n\t(Bar Bite Menu also available)\n</p>\n\n<p>\n\t<a class=\"btn btn-primary\" href=\"#.\" target=\"_blank\">View Menu</a>\n</p>\n\n<hr>\n <p>\n\t<img alt=\"Sundaybrunch\" src=\"/documents/10184/15473/sundaybrunch.jpg\">\n</p>\n<h3>\n\tDaily Soup & Sweets To-Go\n</h3>\n <p>\n\t<img alt=\"Daily Soup\" src=\"/documents/10184/15473/Daily+Soup.jpg\">\n</p>\n\n<h3>\n\tLunch Dine In & To-Go Menu\n</h3>\n\n<p>\n\tAvailable Monday - Saturday 11:30 AM - 2:30 PM\n</p>\n\n<p>\n\t<a class=\"btn btn-primary\" href=\"#.\" target=\"_blank\">View Menu</a>\n</p>\n\n<hr>\n <p>\n\t<img alt=\"Lunch Dine In\" src=\"/documents/10184/15473/Lunch_Dine.jpg\">\n</p>  <p>\n\t<img alt=\"Lunch Dine In\" src=\"/documents/10184/15473/wood2.jpg\">\n</p>\n<h3>\n\tDinner To-Go Menu\n</h3>\n\n<p>\n\tAlways available Monday - Sunday 4:00 PM - 6:00 PM\n</p>\n\n<p>\n\t<a class=\"btn btn-primary\" href=\"#.\" target=\"_blank\">View Menu</a>\n</p>\n\n<hr>\n <p>\n\t<img alt=\"Lunch Dine In\" src=\"/documents/10184/15473/Dinner+To-Go.jpg\">\n</p>\n<h3>\n\tSpecials for the Week To-Go\n</h3>\n\n<p>\n\tPick up Monday - Sunday 4:00 PM - 6:00 PM\n</p>\n\n<p>\n\t<a class=\"btn btn-primary\" href=\"#.\" target=\"_blank\">View Menu</a>\n</p>\n\n<hr>\n <p>\n\t<img alt=\"Specials for the Week To-Go\" src=\"/documents/10184/15473/Specials+for+the+Week.jpg\">\n</p>\n<h3>\n\tFriday Dinner Service\n</h3>\n\n<p>\n\tLimited Seating<br>\n\tMain Dining Room, Lounge, & Sunset Terrace<br>\n\tFriday 5:30 PM - 8:00 PM<br>\n\tReservations can be booked two weeks in advance with Club Reception<br>\n\tDress Code: GA\n</p>\n\n<p>\n\t<a class=\"btn btn-primary\" href=\"#.\" target=\"_blank\">View Menu</a>\n</p>\n\n<hr>\n <p>\n\t<img alt=\"Friday Dinner\" src=\"/documents/10184/15473/Friday-Dinner-ka56bVMv.jpg\">\n</p>\n<h3>\n\tBar Bites, Casual Dinner & House Sushi Happy Hour in The Woods\n</h3>\n\n<p>\n\tBar Bites Daily: 11:30 AM - 5:30 PM<br>\n\tWednesday Casual Dinner: 5:30 PM - 7:30 PM<br>\n\tLimited Seating in the Lounge & Sunset Terrace<br>\n\tNo reservations - first come first serve<br>\n\tDress Code: GA\n</p>\n\n<p>\n\t<a class=\"btn btn-primary\" href=\"#.\" target=\"_blank\">View Menu</a>\n</p>\n <p>\n\t<img alt=\"Baskets Bars\" src=\"/documents/10184/15473/BarBites.jpg\">\n</p>\n\n<p>\n\t<img alt=\"Bar Bites Casual Dinner\" src=\"/documents/10184/15473/baskets-gAPy2TeI.jpg\">\n</p>\n\n<p>\n\t<img alt=\"House Sushi\" src=\"/documents/10184/15473/house-sushi.jpg\">\n</p>  <h3>\n\tDress Code\n</h3>\n\n<p>\n\tGA (shorts appropriate)<br>\n\tCurrent Club guest rules apply subject to availability.\n</p>\n\n<h3>\n\tClub Policy\n</h3>\n\n<p>\n\tBoca Woods policy requires all unvaccinated and vaccinated people to social distance and wear a face mask in all public spaces indoors.\n</p>\n\n<h3>\n\tCatering\n</h3>\n\n<p>\n\tContact Food & Beverage Department<br>\n\t561-487.2800 ext. 137 or email <a href=\"mailto:fbadmin@bocawoodscc.com\">fbadmin@bocawoodscc.com</a><br>\n\tfor more information.\n</p>\n\n<h3>\n\tPrivate Events\n</h3>\n\n<p>\n\tPlease contact David Sweet, Assistant General Manager, at <a href=\"tel:+5614872800\">561.487.2800</a> x280<br>\n\tor email <a href=\"mailto:dsweet@bocawoodscc.com\">dsweet@bocawoodscc.com</a> for your next special event:<br>\n\twedding anniversaries, birthdays or special celebrations.\n</p>\n\n<h3>\n\tThe Bar at Boca Woods\n</h3>\n\n<p>\n\tHappy Hour daily from 11:30 AM - 5:30 PM<br>\n\tHalf off well drinks, domestic beer, and house wine.<br>\n\tSelect premium drinks - $2 off.<br>\n\tThe bar is open until 7:30 PM on Wednesday for Casual Dining.\n</p>\n\n<p>\n\t<img alt=\"House Sushi\" src=\"/documents/10184/15473/bar.jpg\">\n</p>\nShow Web Content (Article), Last Updated By:\nWant to contact our Dining Team?\nREQUEST MORE INFORMATION\nPlease fill out our online form to learn more about Boca Woods Country Club.\nClick here to Contact Us\nShow Web Content (Article), Last Updated By:\n<div class=\"footer-logo\">\r\n\t\t\t\t\t\t\t\t<img alt=\"Boca Woods CC logo\" title=\"Boca Woods Country Club\" src=\"https://www.bocawoodscc.com/BocaWoodsCC-theme/images/club-images/footer-logo.png\"/>\r\n\t\t\t\t\t\t\t</div>\n10471 Boca Woods Ln. Boca Raton, FL 33428\nPhone:\n561.487.2800\nMember Login\nContact Us\nCareers\nMap & Directions\n<ul>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"viewprofile\">My Info</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"calendar-of-events\">Calendar Of Events</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"racquet-sports\">Racquet Sports</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"golf\">Golf</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"overview-contact\">Contact Us</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"careers\">Careers</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"https://goo.gl/maps/8bxYph6UKRuqRsB3A\" target=\"_blank\">Map & Directions</a></li>\r\n\t\t\t\t\t\t\t\t</ul>\n© Boca Woods Country Club\nPowered by\nNorthstar Technologies\nFollow Us\nMember Login\nHome Banner\nInner Banner",
      "emails": [
        "dsweet@bocawoodscc.com",
        "fbadmin@bocawoodscc.com"
      ]
    },
    {
      "url": "http://www.bocawoodscc.com/fitness",
      "is_candidate": false,
      "has_email": false,
      "text": "Google Tag Manager (noscript)\nEnd Google Tag Manager (noscript)\nAbout the Club\nMembership\nRequest Information\nMeet the Team\nPhilanthropy\nLifestyle\nCommunity Overview\nSocial & Clubs\nReal Estate\nEvents & Videos\nClub Tour\nGolf\nThe Lakes Course\nThe Woods Course\nMeet our Golf Pros\nRacquet Sports\nTennis\nPickleball\nBocce\nMeet our Racquet Sports Team\nWellness\nFitness\nSpa Services\nMeet our Wellness Team\nDining\nOverview\nMeet our F&B Team\nContact Us\nGet in Touch\nDirections\nCareers\nimage\nMenu\nAbout the Club\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nMembership\nRequest Information\nMeet the Team\nPhilanthropy\nLifestyle\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nCommunity Overview\nSocial & Clubs\nReal Estate\nEvents & Videos\nClub Tour\nGolf\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nThe Lakes Course\nThe Woods Course\nMeet our Golf Pros\nRacquet Sports\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nTennis\nPickleball\nBocce\nMeet our Racquet Sports Team\nWellness\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nFitness\nSpa Services\nMeet our Wellness Team\nDining\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nOverview\nMeet our F&B Team\nContact Us\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nGet in Touch\nDirections\nCareers\nimage\nMember Login\nrequired for background video, and will serve as the video's \"poster/cover\" image\nBACKGROUND VIDEO LAYER\n<li data-transition=\"fade\"> <img src=\"/documents/10184/16903/meettheprosfitness.jpg\" id=\"html-generator-img-02\" alt=\"slider\" data-bgposition=\"center center\" data-bgfit=\"cover\" data-bgrepeat=\"no-repeat\" data-bgparallax=\"0\" class=\"rev-slidebg\" data-no-retina> \n    <div class=\"tp-caption NotGeneric-SubTitle main-slider-custom-head-pub-home\" data-x=\"['center','center','center','center']\" data-hoffset=\"['0','0','0','0']\" data-y=\"['middle','middle','middle','middle']\" data-voffset=\"['0','0','0','0']\" data-width=\"none\" data-height=\"none\" data-whitespace=\"nowrap\" data-transform_idle=\"o:1;\" data-transform_in=\"y:50px;opacity:1;s:1500;e:Power3.easeOut;\" data-transform_out=\"x:0;y:0;z:0;rX:0;rY:0;rZ:0;sX:0.9;sY:0.9;skX:0;skY:0;opacity:0;s:1000;e:Power3.easeInOut;s:1000;e:Power3.easeInOut;\" data-start=\"1000\" data-splitin=\"none\" data-splitout=\"none\" data-responsive_offset=\"on\" style=\"z-index: 7; white-space: nowrap;text-align:center;\"> \n     <div class=\"rev-slider-heading\"> \n      <h1 id=\"html-generator-head-1\">Welcome To</h1> \n      <h1 id=\"html-generator-head-2\">Manito Golf & Country Club</h1> \n     </div> \n    </div> </li>\n<div class=\"tp-static-layers slider-down-arrow\" onclick=\"slider_scrollDown();\"> \n\t<p>Scroll Down</p>\n\t</div>\n<img src=\"/documents/10184/16903/meettheprosfitness.jpg\" alt=\"slider\" class=\"rev-slidebg\" data-bgposition=\"center center\" data-bgfit=\"cover\"  data-bgrepeat=\"repeat\">\nxml version='1.0' encoding='UTF-8'?\nFitness\nLife Lived Actively\nBoca Woods Fitness\nThe Boca Woods Fitness Center\nCan't make it to a \"live\" workout class? Boca Woods offers Zoom virtual fitness. Choose from a variety of classes that are available on your schedule from the comfort of home.\n<p>\n\tWith a variety of exercise options utilizing the latest equipment and an outdoor heated salt water swimming pool, it&#39;s easy to live well and maintain a healthy lifestyle at Boca Woods.\n</p>\nGroup Fitness\nBoca Woods offers Wexer on demand virtual fitness. Choose from a variety of classes that are available on your schedule in the Aerobics Room.\nFeatured Fitness Classes\nBoot Camp\nTai Chi\nWater Aerobics\nBalance Classes\nStrength Training\nGolf Exercise\nPilates\n<div class=\"table-responsive\">\n\t<table cellpadding=\"4\" cellspacing=\"4\" class=\"table table-striped\" width=\"100%\">\n\t\t<tbody>\n\t\t\t<tr>\n\t\t\t\t<td>\n\t\t\t\t\tPilates\n\t\t\t\t</td>\n\t\t\t\t<td>\n\t\t\t\t\tYoga Boot\n\t\t\t\t</td>\n\t\t\t\t<td>\n\t\t\t\t\tCamp\n\t\t\t\t</td>\n\t\t\t</tr>\n\t\t\t<tr>\n\t\t\t\t<td>\n\t\t\t\t\tZumba\n\t\t\t\t</td>\n\t\t\t\t<td>\n\t\t\t\t\tWater Aerobics\n\t\t\t\t</td>\n\t\t\t\t<td>\n\t\t\t\t\tSports-Specific Classes\n\t\t\t\t</td>\n\t\t\t</tr>\n\t\t</tbody>\n\t</table>\n</div>\nPersonal Training\nPersonal training is offered in half hour, 45 minute, and one hour sessions. For increased flexibility, choose a 15 minute stretch session.\n<p>\n\tRelax and relieve sore muscles with a half hour, one hour, or 90 minute massage. To melt away tension, try our hot stone massage therapy.\n</p>\nShow Web Content (Article), Last Updated By:\n<div class=\"footer-logo\">\r\n\t\t\t\t\t\t\t\t<img alt=\"Boca Woods CC logo\" title=\"Boca Woods Country Club\" src=\"https://www.bocawoodscc.com/BocaWoodsCC-theme/images/club-images/footer-logo.png\"/>\r\n\t\t\t\t\t\t\t</div>\n10471 Boca Woods Ln. Boca Raton, FL 33428\nPhone:\n561.487.2800\nMember Login\nContact Us\nCareers\nMap & Directions\n<ul>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"viewprofile\">My Info</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"calendar-of-events\">Calendar Of Events</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"racquet-sports\">Racquet Sports</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"golf\">Golf</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"overview-contact\">Contact Us</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"careers\">Careers</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"https://goo.gl/maps/8bxYph6UKRuqRsB3A\" target=\"_blank\">Map & Directions</a></li>\r\n\t\t\t\t\t\t\t\t</ul>\n© Boca Woods Country Club\nPowered by\nNorthstar Technologies\nFollow Us\nMember Login\nHome Banner\nInner Banner",
      "emails": []
    },
    {
      "url": "http://www.bocawoodscc.com/overview",
      "is_candidate": false,
      "has_email": false,
      "text": "Google Tag Manager (noscript)\nEnd Google Tag Manager (noscript)\nAbout the Club\nMembership\nRequest Information\nMeet the Team\nPhilanthropy\nLifestyle\nCommunity Overview\nSocial & Clubs\nReal Estate\nEvents & Videos\nClub Tour\nGolf\nThe Lakes Course\nThe Woods Course\nMeet our Golf Pros\nRacquet Sports\nTennis\nPickleball\nBocce\nMeet our Racquet Sports Team\nWellness\nFitness\nSpa Services\nMeet our Wellness Team\nDining\nOverview\nMeet our F&B Team\nContact Us\nGet in Touch\nDirections\nCareers\nimage\nMenu\nAbout the Club\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nMembership\nRequest Information\nMeet the Team\nPhilanthropy\nLifestyle\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nCommunity Overview\nSocial & Clubs\nReal Estate\nEvents & Videos\nClub Tour\nGolf\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nThe Lakes Course\nThe Woods Course\nMeet our Golf Pros\nRacquet Sports\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nTennis\nPickleball\nBocce\nMeet our Racquet Sports Team\nWellness\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nFitness\nSpa Services\nMeet our Wellness Team\nDining\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nOverview\nMeet our F&B Team\nContact Us\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nGet in Touch\nDirections\nCareers\nimage\nMember Login\nxml version='1.0' encoding='UTF-8'?\nCommunity Overview\nWhere Neighbors Become Friends\nA Private Club Lifestyle\nBoca Woods Country Club is nestled in the heart of Boca Raton and just minutes from two miles of beautiful white sandy Boca Raton Beaches. Located in Palm Beach County, Boca Raton offers residents an assortment of casual and fine dining, world-class shopping and entertainment venues.\nBoca Woods Country Club welcomes members to Palm Beach living, in an upscale community, to enjoy an active lifestyle that is set in a relaxed and comfortable golf and country club private residential community. It's a family friendly community where neighbors become friends and friends are like family. Members embrace a complete lifestyle with an array of resort-style amenities including 36-holes of spectacular golf, 7 Har Tru tennis courts, pickleball, modern Fitness Center, card rooms and an elegant-contemporary clubhouse for dining and socializing. Lifelong friendships are made while enjoying a life well lived.\nWelcome lifestyle, welcome convenience, welcome home to Boca Woods, and experience a life well played.\nLearn more about Real Estate\nShow Web Content (Article), Last Updated By:\nShow Web Content (Article), Last Updated By:\n<div class=\"footer-logo\">\r\n\t\t\t\t\t\t\t\t<img alt=\"Boca Woods CC logo\" title=\"Boca Woods Country Club\" src=\"https://www.bocawoodscc.com/BocaWoodsCC-theme/images/club-images/footer-logo.png\"/>\r\n\t\t\t\t\t\t\t</div>\n10471 Boca Woods Ln. Boca Raton, FL 33428\nPhone:\n561.487.2800\nMember Login\nContact Us\nCareers\nMap & Directions\n<ul>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"viewprofile\">My Info</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"calendar-of-events\">Calendar Of Events</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"racquet-sports\">Racquet Sports</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"golf\">Golf</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"overview-contact\">Contact Us</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"careers\">Careers</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"https://goo.gl/maps/8bxYph6UKRuqRsB3A\" target=\"_blank\">Map & Directions</a></li>\r\n\t\t\t\t\t\t\t\t</ul>\n© Boca Woods Country Club\nPowered by\nNorthstar Technologies\nFollow Us\nMember Login\nHome Banner\nInner Banner",
      "emails": []
    },
    {
      "url": "http://www.bocawoodscc.com/social-clubs",
      "is_candidate": false,
      "has_email": false,
      "text": "Google Tag Manager (noscript)\nEnd Google Tag Manager (noscript)\nAbout the Club\nMembership\nRequest Information\nMeet the Team\nPhilanthropy\nLifestyle\nCommunity Overview\nSocial & Clubs\nReal Estate\nEvents & Videos\nClub Tour\nGolf\nThe Lakes Course\nThe Woods Course\nMeet our Golf Pros\nRacquet Sports\nTennis\nPickleball\nBocce\nMeet our Racquet Sports Team\nWellness\nFitness\nSpa Services\nMeet our Wellness Team\nDining\nOverview\nMeet our F&B Team\nContact Us\nGet in Touch\nDirections\nCareers\nimage\nMenu\nAbout the Club\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nMembership\nRequest Information\nMeet the Team\nPhilanthropy\nLifestyle\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nCommunity Overview\nSocial & Clubs\nReal Estate\nEvents & Videos\nClub Tour\nGolf\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nThe Lakes Course\nThe Woods Course\nMeet our Golf Pros\nRacquet Sports\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nTennis\nPickleball\nBocce\nMeet our Racquet Sports Team\nWellness\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nFitness\nSpa Services\nMeet our Wellness Team\nDining\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nOverview\nMeet our F&B Team\nContact Us\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nGet in Touch\nDirections\nCareers\nimage\nMember Login\nxml version='1.0' encoding='UTF-8'?\nSocial & Clubs\nRECREATION AND SOCIALIZATION\nBoca Woods is a family friendly community located in west Boca Raton that offers a multitude of popular events, activities, and game nights for the whole family to enjoy.\nFrom dinner dances, comedy shows and live concerts to friendly entertainment poolside, there is always something interesting happening at Boca Woods.\nEnjoy special events and meet your neighbors by joining one of our social clubs, such as the Women’s Club, Gardening Club, Singles Club or Fishing Club.\nAfternoons are a great time to socialize and perfect your bridge, canasta or Mahjong skills during a game with friends.\nShow Web Content (Article), Last Updated By:\nSingles Club\nBoca Woods has many singles ready to mingle! We have increased the opportunity for single members to meet and socialize with others, not only at our club, but with thirteen other clubs in the area. We joined interclub and participate in varied activities. We have created a lifestyle that our singles can enjoy, based on member feedback and questionnaires.\nActivities include an opening breakfast, theatre, restaurants, museums, day trips, speakers, overnight trips, socials with other clubs, historical bus trips, cruise, show time evenings, and many more exciting events. Our prospects are limitless. Activities are provided each month in season for our Singles.\nJewish Cultural Club\nMembers of the Jewish Culture Club get together monthly in season on a Wednesday evening at 7:30 PM to enjoy cultural fun, entertainment, lectures and programs. Knowledge of Yiddish is not necessary. Annual membership $20.  Watch your email for season schedule.\nWomen's Club\nThe Boca Woods Women’s Club is an organization of socialization, culture, philanthropy and FUN!\nThe monthly Monday morning lectures offer a variety of informational and amusing topics that members enjoy together as we sip our coffee or tea. We go on two to three trips each season, ranging from museums to tours of local places of interest to boat rides!\nEach year the Women's Club awards four scholarships to deserving nursing students from the Lynn School of Nursing at FAU. They have also donated  to Hospice of Palm Beach County, as well as other deserving organizations, such as Wounded Warriors and Make A Wish.\nThe two biggest events of the year are our Opening Breakfast, where friends reunite after the summer season ends and the Snowbirds return, and our Gala Luncheon. It is at our Gala Luncheon that we meet the scholarship recipients, raise money for a selected charity through raffle sales, and enjoy an upscale meal while enjoying entertainment.\nThe Women’s Club is open to all Boca Woods members, and offers something for everyone.\nAstronomy Club\nGarden Club\nPrivate Book Clubs\nShow Web Content (Article), Last Updated By:\nShowing loader image code starts\noverlay to disable all screen when loader image is shown\nShowing loader image code ends\nGallery\n<div class=\"footer-logo\">\r\n\t\t\t\t\t\t\t\t<img alt=\"Boca Woods CC logo\" title=\"Boca Woods Country Club\" src=\"https://www.bocawoodscc.com/BocaWoodsCC-theme/images/club-images/footer-logo.png\"/>\r\n\t\t\t\t\t\t\t</div>\n10471 Boca Woods Ln. Boca Raton, FL 33428\nPhone:\n561.487.2800\nMember Login\nContact Us\nCareers\nMap & Directions\n<ul>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"viewprofile\">My Info</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"calendar-of-events\">Calendar Of Events</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"racquet-sports\">Racquet Sports</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"golf\">Golf</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"overview-contact\">Contact Us</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"careers\">Careers</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"https://goo.gl/maps/8bxYph6UKRuqRsB3A\" target=\"_blank\">Map & Directions</a></li>\r\n\t\t\t\t\t\t\t\t</ul>\n© Boca Woods Country Club\nPowered by\nNorthstar Technologies\nFollow Us\nMember Login\nHome Banner\nInner Banner",
      "emails": []
    },
    {
      "url": "https://www.bocawoodscc.com/meet-the-team-membership",
      "is_candidate": false,
      "has_email": false,
      "text": "Google Tag Manager (noscript)\nEnd Google Tag Manager (noscript)\nAbout the Club\nMembership\nRequest Information\nMeet the Team\nPhilanthropy\nLifestyle\nCommunity Overview\nSocial & Clubs\nReal Estate\nEvents & Videos\nClub Tour\nGolf\nThe Lakes Course\nThe Woods Course\nMeet our Golf Pros\nRacquet Sports\nTennis\nPickleball\nBocce\nMeet our Racquet Sports Team\nWellness\nFitness\nSpa Services\nMeet our Wellness Team\nDining\nOverview\nMeet our F&B Team\nContact Us\nGet in Touch\nDirections\nCareers\nimage\nMenu\nAbout the Club\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nMembership\nRequest Information\nMeet the Team\nPhilanthropy\nLifestyle\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nCommunity Overview\nSocial & Clubs\nReal Estate\nEvents & Videos\nClub Tour\nGolf\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nThe Lakes Course\nThe Woods Course\nMeet our Golf Pros\nRacquet Sports\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nTennis\nPickleball\nBocce\nMeet our Racquet Sports Team\nWellness\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nFitness\nSpa Services\nMeet our Wellness Team\nDining\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nOverview\nMeet our F&B Team\nContact Us\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nGet in Touch\nDirections\nCareers\nimage\nMember Login\nxml version='1.0' encoding='UTF-8'?\nMeet the Team\nDavid Sweet\nGeneral Manager, COO\n561.487.2800 Ext:280\nDavid Sweet serves as General Manager/COO. His responsibilities include Club leadership, community development initiatives, Club governance, facilities management, interdepartmental coordination and project management. He also serves as a staff liaison for the Board of Governors, Executive Committee, Long Range Planning Committee and Strategic Planning Committee. David collaborates with Members and staff implementing widely successful programming, facilities upgrades and software/hardware upgrades focused on improvement of the employee and Member experience.\nPreviously, David served as director of dining operations for the platinum designated Woodfield Country Club, where he oversaw and supported dining operations that gross $6M annually. David was well-loved in the dining rooms for his genuine nature, commitment and responsiveness.\nDavid was recruited for the Woodfield Country Club from New England where he served in leadership roles supporting casual dining and luxury hotels. Graduating fourth in his class at university, summa cum laude, with degrees in hospitality management and restaurant management, David values hard work and recognizes contributions at every level are important to the success of a business.\nFollowing university, he joined Ritz-Carlton, Boston as a supervisor in the stewarding department. David quickly formed bonds and developed strong working relationships across all departments; he was promoted to department head within six months and later went on to oversee three of the departments within the hotel whose annual food and beverage revenues exceeded $13M.\nDavid was raised in upstate New York where his parents still live. He attended university at Johnson & Wales in Rhode Island where he met his wife and started his family. Today, Jaime and his two beautiful girls, Cailey and Emma-Natalie reside in Boca Raton since 2012.\nRick Cooke\nChief Financial Officer\n561.487.2800 Ext:115\nRick most currently played an integral role as Chief Financial Officer overseeing two of Canada's largest clubs. As a key member of the Executive team, he operates at the highest echelon of the Clubs, contributing to its mission and vision and has earned the trust and respect of the Board of Directors and Management.\nBeyond financial expertise, he understands all club operations, spanning food and beverage services, sports development, social connections, and golf course management. What sets him apart is his ability to handle the financial aspects and also consider the qualitative factors that enhance member satisfaction and engagement. Notably, Rick has expressed a passion for teaching and is committed to nurturing talent and fostering growth.\nA strong advocate for continuous improvement and lifelong learning, his dedication is evident in his professional achievements, including earning the CPA, CGA designation, the chartered manager designation (C. Mgr.), and the prestigious club manager designation (CCM). Rick is well-positioned to assume the role of Chief Financial Officer at Boca Woods Country Club.\nMarcy Green\nPOA Director\n561.487.2800 Ext:208\nWith various service leadership and management experiences in her career – from working with Country Clubs, Hospitality Jobs, the Director of Operations of the Tampa Convention Center, JetBlue Airways Management, and Special Education – Marcy landed where she belongs: here at Boca Woods as the Property Director of 645 beautiful homes.\nWithin her tenure at Boca Woods that started in 2015, she has completed numerous improvements to the community including renovation to the Residents’ Only Gate. Marcy is the staff liaison for the combined ACC and Security Committee, and West Boca Council. She attends many of the other Committees to make sure that the POA remains involved and updated. Marcy manages and works closely with the Security Team, daily. Residents frequently call her the “Go-To person” for many of the things they need. Multitasking is her specialty, and attention to detail is something that she strongly believes in. It shows in the upkeep of the properties within the Community.\nOriginally from Hewlett, New York, Marcy enjoys speaking with residents who graduated from the same High School! She attended Buffalo State College, earning a Marketing Degree. She is mother to three lovely gentlemen and has been married 28 years to her best friend. Marcy loves what she does, and she works hard so it shows each and every day.\nKyle Hillhouse\nDirector of Clubhouse Operations\n561.487.2800 Ext:111\nBorn and raised in the vibrant landscapes of South Africa, Kyle’s journey in the hospitality industry began in 2014 in Boca Raton. FL. Boca West Country Club served as the launching pad for his career, commencing in the H2B international, seasonal work visa program. The H2B experience enabled him to traverse the North American hospitality scene, leading him to Fiddler's Elbow Country Club. Starting as a banquet server, his dedication and passion quickly propelled him to the roles of Banquet Supervisor and eventually Banquet Manager. During his tenure at Fiddlers Elbow, he was granted an employment-based green card.\nKyle shifted focus to food and beverage management during the Club's busy seasons. This experience set the stage for the next chapter in his career, in which he was recruited by a prominent private restaurant group. As General Manager of their highest-volume restaurant, Kyle honed his financial acumen and leadership skills, gaining invaluable experience in the restaurant world.\nDriven by a profound love for the Club environment, he returned to his roots and joined the Atlanta Athletic Club (ranked third-best Athletic Club in the country). As Director of Food & Beverage, Kyle broadened his expertise, laying the foundation for his position as Director of Clubhouse Operations for Boca Woods Country Club. In this role, Kyle will take responsibility for further developing the business metrics that drive Culinary, Food & Beverage and other Clubhouse-based departments.\nKyle is thrilled to join the Boca Woods Team and is excited to continue doing what he loves most—taking care of people and ensuring unforgettable moments for the Members at Boca Woods Country Club. He looks forward to contributing to the Club's legacy and enhancing both Member and team member experiences.\nAdriane Wright\nDirector of People & Culture\n561.487.2800 Ext:118\nAdriane is a military officer's daughter who began grade school overseas, graduated high school in the U.S., and lived in 4 states before settling in Palm Beach County. She holds a master’s degree in strategic HR Management, a bachelor’s degree in Business Administration, obtained a series 215 license in retirement and benefits, and achieved accredited education in employment law. Her passion for contributing to the evident progression of career driven professionals ignites her love of the HR field.\nPrior to joining Boca Woods Country Club, she held the role of Regional Director for Fortune 500 Companies like Hewlett Packard, SEI Investments, Fidelity Investments, Mutual of Omaha, and Blue Cross Blue Shield. Additionally, she has over 10 years of executive leadership experience overseeing all aspects of the HR function in the hospitality and private club sector for Wyndham Hotels and Resorts, Marriott, and Jupiter Island Club.\nAdriane has excelled in her career in the Human Relations field and has a reputation for cultivating people-centric cultures, building resilient teams, and producing strong leadership. She’s passionate about community initiatives and philanthropic activities. Her dedicated commitment to these projects earned her the vote of Advocacy Chairperson for the Junior League of the Palm Beaches.\nIn her leisure time, Adriane most enjoys sharing her unique gift of song which has allowed her to be featured on several televised programs and radio broadcasts in North Carolina, Tennessee, Virginia, and Florida. But she still considers her most esteemed achievement as being \"mom\" to one amazing Johnson & Wales University alumna, Bryonna, and one adorable toy poodle, Charlie.\nMeg Friedlander\nDirector of Member Engagement\n561.487.2800 Ext:147\nMeg is a Florida native and graduate of the University of South Florida. With a deep passion for community and family engagement, she began her career at the Jewish Community Center of Boynton Beach in 2009. While at the JCC, she served in various roles, including preschool teacher, summer camp administrator, after-school administrator, and after-school director. Meg also spent considerable time in the accounting department, as both a payroll coordinator and an accounting supervisor.\nIn 2018, driven by her passion for people, Meg made the decision to leave finance and return to the world of programming. She took on the role of Social Director at Valencia Falls, where she led all events and activities for a vibrant, 55-and-up active lifestyle community, bringing her creativity, networking skills, and talent to the role.\nMeg became the Lifestyle Director at Valencia Bay in 2022. She has successfully planned, marketed, and executed a diverse range of social events, including holiday gatherings, activities, lectures, concerts, seasonal show series, and more. With her warm and fun-loving personality, Meg has cultivated strong relationships with residents, resulting in increased participation in community activities.\nThis experience positions Meg with exceptional interpersonal skills required to elevate the Membership Department for Boca Woods. As Director of Member Engagement, Meg will be focused on building relationships and helping Members get the most out of their experience!\nOutside of work, Meg’s happy place is the beach and she can usually be found there most weekends.She enjoys cruising, live music, and spending time with her two children and their beloved cat, Cleo.\nTrudy Smith\nExecutive Administrator\n561.487.2800 Ext:383\nTrudy Smith, Executive Administrator, brings a wealth of experience to Boca Woods Country Club. Originally from Jamaica, she embarked on her administrative career at Xerox before seizing an opportunity to serve as the Executive Assistant at Southerland Healthcare Solutions, leading to her relocation to Florida in 2014. Prior to her current role at Boca Woods, Trudy contributed her skills as an Administrative Assistant at Mednax. She joined the Boca Woods team in April 2022.\nBeyond the office, Trudy resides in Margate, Florida, where she treasures quality moments with her family. Whether it be cozy movie nights at home or exploring local eateries, she brings the same warmth and dedication to her personal life as she does to her professional endeavors. Recognized for her fabulous earrings, Trudy's personality leaves a lasting impression on colleagues and friends alike.\nShow Web Content (Article), Last Updated By:\nWant to contact our Membership Team?\nREQUEST MORE INFORMATION\nPlease fill out our online form to learn more about Boca Woods Country Club.\nClick here to Contact Us\nShow Web Content (Article), Last Updated By:\n<div class=\"footer-logo\">\r\n\t\t\t\t\t\t\t\t<img alt=\"Boca Woods CC logo\" title=\"Boca Woods Country Club\" src=\"https://www.bocawoodscc.com/BocaWoodsCC-theme/images/club-images/footer-logo.png\"/>\r\n\t\t\t\t\t\t\t</div>\n10471 Boca Woods Ln. Boca Raton, FL 33428\nPhone:\n561.487.2800\nMember Login\nContact Us\nCareers\nMap & Directions\n<ul>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"viewprofile\">My Info</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"calendar-of-events\">Calendar Of Events</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"racquet-sports\">Racquet Sports</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"golf\">Golf</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"overview-contact\">Contact Us</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"careers\">Careers</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"https://goo.gl/maps/8bxYph6UKRuqRsB3A\" target=\"_blank\">Map & Directions</a></li>\r\n\t\t\t\t\t\t\t\t</ul>\n© Boca Woods Country Club\nPowered by\nNorthstar Technologies\nFollow Us\nMember Login\nHome Banner\nInner Banner",
      "emails": []
    },
    {
      "url": "https://www.bocawoodscc.com/events-and-videos",
      "is_candidate": false,
      "has_email": false,
      "text": "Google Tag Manager (noscript)\nEnd Google Tag Manager (noscript)\nAbout the Club\nMembership\nRequest Information\nMeet the Team\nPhilanthropy\nLifestyle\nCommunity Overview\nSocial & Clubs\nReal Estate\nEvents & Videos\nClub Tour\nGolf\nThe Lakes Course\nThe Woods Course\nMeet our Golf Pros\nRacquet Sports\nTennis\nPickleball\nBocce\nMeet our Racquet Sports Team\nWellness\nFitness\nSpa Services\nMeet our Wellness Team\nDining\nOverview\nMeet our F&B Team\nContact Us\nGet in Touch\nDirections\nCareers\nimage\nMenu\nAbout the Club\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nMembership\nRequest Information\nMeet the Team\nPhilanthropy\nLifestyle\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nCommunity Overview\nSocial & Clubs\nReal Estate\nEvents & Videos\nClub Tour\nGolf\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nThe Lakes Course\nThe Woods Course\nMeet our Golf Pros\nRacquet Sports\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nTennis\nPickleball\nBocce\nMeet our Racquet Sports Team\nWellness\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nFitness\nSpa Services\nMeet our Wellness Team\nDining\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nOverview\nMeet our F&B Team\nContact Us\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nGet in Touch\nDirections\nCareers\nimage\nMember Login\nxml version='1.0' encoding='UTF-8'?\nEvents & Videos\nEXPERIENCE LIFE AT BOCA WOODS\nA first class, private residential golf, racquet sports and fitness minded community on the Southeast coast of Florida.\nExperience the Boca Woods Lifestyle.\nLuxury living in one of South Florida's top residential communities\n<h4>\n\tBoca Woods Members Ringing in the New Year<br>\n\tCelebrate special events and socialize just steps from home.\n</h4>\n<div class=\"custom-resp-container\">\n\t<iframe allowfullscreen=\"\" class=\"cst-responsive-iframe\" frameborder=\"0\" height=\"360\" src=\"https://player.vimeo.com/video/137635942\" width=\"100%\"></iframe>\n</div>\nRoaring 20's Season Kickoff Celebration\nMembers enjoy fun events year round at Boca Woods\nShow Web Content (Article), Last Updated By:\n<div class=\"footer-logo\">\r\n\t\t\t\t\t\t\t\t<img alt=\"Boca Woods CC logo\" title=\"Boca Woods Country Club\" src=\"https://www.bocawoodscc.com/BocaWoodsCC-theme/images/club-images/footer-logo.png\"/>\r\n\t\t\t\t\t\t\t</div>\n10471 Boca Woods Ln. Boca Raton, FL 33428\nPhone:\n561.487.2800\nMember Login\nContact Us\nCareers\nMap & Directions\n<ul>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"viewprofile\">My Info</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"calendar-of-events\">Calendar Of Events</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"racquet-sports\">Racquet Sports</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"golf\">Golf</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"overview-contact\">Contact Us</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"careers\">Careers</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"https://goo.gl/maps/8bxYph6UKRuqRsB3A\" target=\"_blank\">Map & Directions</a></li>\r\n\t\t\t\t\t\t\t\t</ul>\n© Boca Woods Country Club\nPowered by\nNorthstar Technologies\nFollow Us\nMember Login\nHome Banner\nInner Banner",
      "emails": []
    },
    {
      "url": "https://www.bocawoodscc.com/contact-us",
      "is_candidate": false,
      "has_email": true,
      "text": "Google Tag Manager (noscript)\nEnd Google Tag Manager (noscript)\nAbout the Club\nMembership\nRequest Information\nMeet the Team\nPhilanthropy\nLifestyle\nCommunity Overview\nSocial & Clubs\nReal Estate\nEvents & Videos\nClub Tour\nGolf\nThe Lakes Course\nThe Woods Course\nMeet our Golf Pros\nRacquet Sports\nTennis\nPickleball\nBocce\nMeet our Racquet Sports Team\nWellness\nFitness\nSpa Services\nMeet our Wellness Team\nDining\nOverview\nMeet our F&B Team\nContact Us\nGet in Touch\nDirections\nCareers\nimage\nMenu\nAbout the Club\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nMembership\nRequest Information\nMeet the Team\nPhilanthropy\nLifestyle\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nCommunity Overview\nSocial & Clubs\nReal Estate\nEvents & Videos\nClub Tour\nGolf\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nThe Lakes Course\nThe Woods Course\nMeet our Golf Pros\nRacquet Sports\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nTennis\nPickleball\nBocce\nMeet our Racquet Sports Team\nWellness\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nFitness\nSpa Services\nMeet our Wellness Team\nDining\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nOverview\nMeet our F&B Team\nContact Us\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nGet in Touch\nDirections\nCareers\nimage\nMember Login\nxml version='1.0' encoding='UTF-8'?\nGet in Touch\nWe'd Love To Hear From You\nGet in Touch with Boca Woods\nLearn more about private country club life at Boca Woods by contacting Membership.\nRequest more Information\nClubhouse\n561.487.2800\nMembership Office\n561.487.2800 > Ext:147\nPro Shop\n561.487.2800 > Ext:131\nRacquet Sports Office\n561.487.2800 > Ext:134\nHuman Resources\n561.487.2800 > Ext:118\nShow Web Content (Article), Last Updated By:\n<div class=\"footer-logo\">\r\n\t\t\t\t\t\t\t\t<img alt=\"Boca Woods CC logo\" title=\"Boca Woods Country Club\" src=\"https://www.bocawoodscc.com/BocaWoodsCC-theme/images/club-images/footer-logo.png\"/>\r\n\t\t\t\t\t\t\t</div>\n10471 Boca Woods Ln. Boca Raton, FL 33428\nPhone:\n561.487.2800\nMember Login\nContact Us\nCareers\nMap & Directions\n<ul>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"viewprofile\">My Info</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"calendar-of-events\">Calendar Of Events</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"racquet-sports\">Racquet Sports</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"golf\">Golf</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"overview-contact\">Contact Us</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"careers\">Careers</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"https://goo.gl/maps/8bxYph6UKRuqRsB3A\" target=\"_blank\">Map & Directions</a></li>\r\n\t\t\t\t\t\t\t\t</ul>\n© Boca Woods Country Club\nPowered by\nNorthstar Technologies\nFollow Us\nMember Login\nHome Banner\nInner Banner",
      "emails": [
        "administrativeoffices@bocawoodscc.com",
        "hrbw@bocawoodscc.com",
        "jmoe@bocawoodscc.com",
        "membership@bocawoodscc.com",
        "tennis@bocawoodscc.com"
      ]
    },
    {
      "url": "https://www.bocawoodscc.com/meet-the-pros-racquets",
      "is_candidate": false,
      "has_email": false,
      "text": "Google Tag Manager (noscript)\nEnd Google Tag Manager (noscript)\nAbout the Club\nMembership\nRequest Information\nMeet the Team\nPhilanthropy\nLifestyle\nCommunity Overview\nSocial & Clubs\nReal Estate\nEvents & Videos\nClub Tour\nGolf\nThe Lakes Course\nThe Woods Course\nMeet our Golf Pros\nRacquet Sports\nTennis\nPickleball\nBocce\nMeet our Racquet Sports Team\nWellness\nFitness\nSpa Services\nMeet our Wellness Team\nDining\nOverview\nMeet our F&B Team\nContact Us\nGet in Touch\nDirections\nCareers\nimage\nMenu\nAbout the Club\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nMembership\nRequest Information\nMeet the Team\nPhilanthropy\nLifestyle\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nCommunity Overview\nSocial & Clubs\nReal Estate\nEvents & Videos\nClub Tour\nGolf\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nThe Lakes Course\nThe Woods Course\nMeet our Golf Pros\nRacquet Sports\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nTennis\nPickleball\nBocce\nMeet our Racquet Sports Team\nWellness\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nFitness\nSpa Services\nMeet our Wellness Team\nDining\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nOverview\nMeet our F&B Team\nContact Us\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nGet in Touch\nDirections\nCareers\nimage\nMember Login\nMeet our Racquet Sports Team\nKeith Lipp\nUSPTA Elite Professional Director of Racquet Sports\n[email protected]\n561.487.2800 Ext:134\nKeith was born and raised in Simi Valley, California, where he first discovered his passion for tennis. It was here that he began playing junior tennis and quickly made a name for himself. His dedication and hard work paid off when he earned a ranking of number one as a junior tennis player in the Boys 12’s and 14’s.\nKeith’s commitment to excellence in tennis has been evident throughout his career. He is a highly respected RSPA Elite Professional, the highest certification level granted by the Racquet Sports Professional Association. Over the past 27 years, Keith has built a strong reputation as a tennis professional, not only for his on-court skills but also for his ability to develop facility programs as well.\nIn addition to his accomplishments as a coach, Keith also served as the President of the Boca Raton District for the USPTA Florida Division from 2011 to 2018, contributing to the growth and development of the tennis community in South Florida. His leadership and dedication to the sport have been recognized on multiple occasions. He was named District Tennis Professional of the Year twice, in 2006 and 2010, and in 2013, he was honored as President of the District of the Year.\nKeith's passion for tennis is also shared by his family. He is a proud father to two children, Ava, 13, and Gavin, 9, both of whom are avid tennis players. Keith cherishes the time he spends on the courts with his children, enjoying the opportunity to bond with them while sharing his love for the game. Whether coaching them or playing together, these moments are among the most rewarding of his career. Keith’s family is a central part of his life, and he takes great joy in seeing them grow both as athletes and as individuals.\nChristian Sewing\nPPR (Professional Pickleball Registry) RSPA (Racquet Sports Professionals Association)\n[email protected]\n561.487.2800 Ext:134\nChristian is a devoted husband and father of two, who began his tennis journey at the age of six in his hometown of Guayaquil, Ecuador. His passion for the sport led him to his first coaching experience at just 17 years old in Germany. This early opportunity ignited his love for teaching and propelled his career as a coach. One of Christian's proudest achievements was coaching his daughter, who went on to become a top-ranked tennis player.\nShe reached an impressive #125 in the WTA world rankings and #9 in the ITF junior world rankings, solidifying Christian’s reputation as an expert coach. His role as her coach allowed him to travel globally, gaining diverse experiences across the professional tennis circuit.\nRecognizing a new opportunity in the rapidly growing sport of Pickleball, Christian transitioned to coaching the sport, applying his vast knowledge from tennis. His coaching philosophy, which emphasizes patience, professionalism, and a friendly approach, has made him a sought-after coach in this new field as well. His daughter now competes as a Professional Pickleball Player at the highest level, continuing the family’s tradition of excellence in sports. Christian holds an Associate of Arts (AA) degree in Health and Science, and he remains passionate about teaching, learning, and self-improvement. Both on and off the court, Christian strives to maintain a positive and professional attitude, helping others improve and enjoy their journey in sports\nHayden Wilfong\nUSPTA, PPR, PTR and PPTA\n[email protected]\n561.487.2800 Ext:134\nHayden Wilfong is from Winchester, Virginia. After excelling all 4 years in college tennis at Methodist University. Hayden is certified with the USPTA, PPR, PTR and PPTA, ensuring expertise in tennis instruction and management. Hayden graduated with a degree in Marketing and a concentration in Professional Tennis Management.\nHayden has worked at five top 100 tennis clubs across from Shooting Star in Jackson Hole, WY, Philadelphia Cricket club in Philadelphia, PA, Chevy Chase Club in Washington, D.C., and Houston Country Club in Houston, TX.\nShow Web Content (Article), Last Updated By:\nWant to contact our Racquet Sports Team?\nREQUEST MORE INFORMATION\nPlease fill out our online form to learn more about Boca Woods Country Club.\nClick here to Contact Us\nShow Web Content (Article), Last Updated By:\n<div class=\"footer-logo\">\r\n\t\t\t\t\t\t\t\t<img alt=\"Boca Woods CC logo\" title=\"Boca Woods Country Club\" src=\"https://www.bocawoodscc.com/BocaWoodsCC-theme/images/club-images/footer-logo.png\"/>\r\n\t\t\t\t\t\t\t</div>\n10471 Boca Woods Ln. Boca Raton, FL 33428\nPhone:\n561.487.2800\nMember Login\nContact Us\nCareers\nMap & Directions\n<ul>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"viewprofile\">My Info</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"calendar-of-events\">Calendar Of Events</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"racquet-sports\">Racquet Sports</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"golf\">Golf</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"overview-contact\">Contact Us</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"careers\">Careers</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"https://goo.gl/maps/8bxYph6UKRuqRsB3A\" target=\"_blank\">Map & Directions</a></li>\r\n\t\t\t\t\t\t\t\t</ul>\n© Boca Woods Country Club\nPowered by\nNorthstar Technologies\nFollow Us\nMember Login\nHome Banner\nInner Banner",
      "emails": []
    },
    {
      "url": "https://www.bocawoodscc.com/membership",
      "is_candidate": false,
      "has_email": false,
      "text": "Google Tag Manager (noscript)\nEnd Google Tag Manager (noscript)\nAbout the Club\nMembership\nRequest Information\nMeet the Team\nPhilanthropy\nLifestyle\nCommunity Overview\nSocial & Clubs\nReal Estate\nEvents & Videos\nClub Tour\nGolf\nThe Lakes Course\nThe Woods Course\nMeet our Golf Pros\nRacquet Sports\nTennis\nPickleball\nBocce\nMeet our Racquet Sports Team\nWellness\nFitness\nSpa Services\nMeet our Wellness Team\nDining\nOverview\nMeet our F&B Team\nContact Us\nGet in Touch\nDirections\nCareers\nimage\nMenu\nAbout the Club\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nMembership\nRequest Information\nMeet the Team\nPhilanthropy\nLifestyle\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nCommunity Overview\nSocial & Clubs\nReal Estate\nEvents & Videos\nClub Tour\nGolf\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nThe Lakes Course\nThe Woods Course\nMeet our Golf Pros\nRacquet Sports\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nTennis\nPickleball\nBocce\nMeet our Racquet Sports Team\nWellness\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nFitness\nSpa Services\nMeet our Wellness Team\nDining\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nOverview\nMeet our F&B Team\nContact Us\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nGet in Touch\nDirections\nCareers\nimage\nMember Login\nxml version='1.0' encoding='UTF-8'?\nAbout\nPalm Beach Golf and Country Club Membership\nMembers of Boca Woods Country Club enjoy outstanding amenities within a\nPremier Golf Community lifestyle!\nBoca Woods Country Club offers an unparalleled private Club experience, featuring two championship 18-hole golf courses and an array of world-class amenities that define the essence of refined Country Club living. Nestled in the heart of west Boca Raton, the Club enjoys a prime location just minutes from pristine beaches, exquisite dining, premier shopping, and renowned cultural arts centers, with the vibrant cities of Fort Lauderdale and West Palm Beach within easy reach.\nAs a premier private residential golf and Country Club Community, Boca Woods is the perfect place to call home in Palm Beach County. New Members are drawn to its meticulously maintained golf courses, warm and welcoming atmosphere, and an extraordinary selection of resort-style amenities. The Clubhouse underwent an extensive renovation in 2022, transforming it into an elegant and inviting centerpiece for social gatherings, fine dining, and entertainment. That same year, the Sports Complex was completed, offering state-of-the-art fitness facilities, rejuvenating spa services, and a professionally curated Pro Shop.\nIn December 2023, the highly anticipated renovation of the Woods Course, masterfully redesigned by renowned golf course architect Rees Jones, was finalized, further enhancing the exceptional golf experience at Boca Woods. Every detail of the Club is designed to elevate the Country Club lifestyle, making now the perfect time to embrace the life you have always envisioned.\nBoca Woods Country Club Brochure\nShow Web Content (Article), Last Updated By:\n<div class=\"footer-logo\">\r\n\t\t\t\t\t\t\t\t<img alt=\"Boca Woods CC logo\" title=\"Boca Woods Country Club\" src=\"https://www.bocawoodscc.com/BocaWoodsCC-theme/images/club-images/footer-logo.png\"/>\r\n\t\t\t\t\t\t\t</div>\n10471 Boca Woods Ln. Boca Raton, FL 33428\nPhone:\n561.487.2800\nMember Login\nContact Us\nCareers\nMap & Directions\n<ul>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"viewprofile\">My Info</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"calendar-of-events\">Calendar Of Events</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"racquet-sports\">Racquet Sports</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"golf\">Golf</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"overview-contact\">Contact Us</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"careers\">Careers</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"https://goo.gl/maps/8bxYph6UKRuqRsB3A\" target=\"_blank\">Map & Directions</a></li>\r\n\t\t\t\t\t\t\t\t</ul>\n© Boca Woods Country Club\nPowered by\nNorthstar Technologies\nFollow Us\nMember Login\nHome Banner\nInner Banner",
      "emails": []
    },
    {
      "url": "http://www.bocawoodscc.com/overview-contact",
      "is_candidate": false,
      "has_email": true,
      "text": "Google Tag Manager (noscript)\nEnd Google Tag Manager (noscript)\nAbout the Club\nMembership\nRequest Information\nMeet the Team\nPhilanthropy\nLifestyle\nCommunity Overview\nSocial & Clubs\nReal Estate\nEvents & Videos\nClub Tour\nGolf\nThe Lakes Course\nThe Woods Course\nMeet our Golf Pros\nRacquet Sports\nTennis\nPickleball\nBocce\nMeet our Racquet Sports Team\nWellness\nFitness\nSpa Services\nMeet our Wellness Team\nDining\nOverview\nMeet our F&B Team\nContact Us\nGet in Touch\nDirections\nCareers\nimage\nMenu\nAbout the Club\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nMembership\nRequest Information\nMeet the Team\nPhilanthropy\nLifestyle\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nCommunity Overview\nSocial & Clubs\nReal Estate\nEvents & Videos\nClub Tour\nGolf\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nThe Lakes Course\nThe Woods Course\nMeet our Golf Pros\nRacquet Sports\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nTennis\nPickleball\nBocce\nMeet our Racquet Sports Team\nWellness\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nFitness\nSpa Services\nMeet our Wellness Team\nDining\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nOverview\nMeet our F&B Team\nContact Us\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nGet in Touch\nDirections\nCareers\nimage\nMember Login\nxml version='1.0' encoding='UTF-8'?\nGet in Touch\nWe'd Love To Hear From You\nGet in Touch with Boca Woods\nLearn more about private country club life at Boca Woods by contacting Membership.\nRequest more Information\nClubhouse\n561.487.2800\nMembership Office\n561.487.2800 > Ext:147\nPro Shop\n561.487.2800 > Ext:131\nRacquet Sports Office\n561.487.2800 > Ext:134\nHuman Resources\n561.487.2800 > Ext:118\nShow Web Content (Article), Last Updated By:\n<div class=\"footer-logo\">\r\n\t\t\t\t\t\t\t\t<img alt=\"Boca Woods CC logo\" title=\"Boca Woods Country Club\" src=\"https://www.bocawoodscc.com/BocaWoodsCC-theme/images/club-images/footer-logo.png\"/>\r\n\t\t\t\t\t\t\t</div>\n10471 Boca Woods Ln. Boca Raton, FL 33428\nPhone:\n561.487.2800\nMember Login\nContact Us\nCareers\nMap & Directions\n<ul>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"viewprofile\">My Info</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"calendar-of-events\">Calendar Of Events</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"racquet-sports\">Racquet Sports</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"golf\">Golf</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"overview-contact\">Contact Us</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"careers\">Careers</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"https://goo.gl/maps/8bxYph6UKRuqRsB3A\" target=\"_blank\">Map & Directions</a></li>\r\n\t\t\t\t\t\t\t\t</ul>\n© Boca Woods Country Club\nPowered by\nNorthstar Technologies\nFollow Us\nMember Login\nHome Banner\nInner Banner",
      "emails": [
        "administrativeoffices@bocawoodscc.com",
        "hrbw@bocawoodscc.com",
        "jmoe@bocawoodscc.com",
        "membership@bocawoodscc.com",
        "tennis@bocawoodscc.com"
      ]
    },
    {
      "url": "https://www.bocawoodscc.com/home",
      "is_candidate": false,
      "has_email": false,
      "text": "Google Tag Manager (noscript)\nEnd Google Tag Manager (noscript)\nAbout the Club\nMembership\nRequest Information\nMeet the Team\nPhilanthropy\nLifestyle\nCommunity Overview\nSocial & Clubs\nReal Estate\nEvents & Videos\nClub Tour\nGolf\nThe Lakes Course\nThe Woods Course\nMeet our Golf Pros\nRacquet Sports\nTennis\nPickleball\nBocce\nMeet our Racquet Sports Team\nWellness\nFitness\nSpa Services\nMeet our Wellness Team\nDining\nOverview\nMeet our F&B Team\nContact Us\nGet in Touch\nDirections\nCareers\nimage\nMenu\nAbout the Club\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nMembership\nRequest Information\nMeet the Team\nPhilanthropy\nLifestyle\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nCommunity Overview\nSocial & Clubs\nReal Estate\nEvents & Videos\nClub Tour\nGolf\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nThe Lakes Course\nThe Woods Course\nMeet our Golf Pros\nRacquet Sports\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nTennis\nPickleball\nBocce\nMeet our Racquet Sports Team\nWellness\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nFitness\nSpa Services\nMeet our Wellness Team\nDining\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nOverview\nMeet our F&B Team\nContact Us\n<img class=\"viewChangeImage\" src=\"/navigation-portlet/images/next.png\" style=\"display:inline-block\"/>\nGet in Touch\nDirections\nCareers\nimage\nMember Login\nrequired for background video, and will serve as the video's \"poster/cover\" image\nBACKGROUND VIDEO LAYER\n<li data-transition=\"fade\"> <img src=\"/documents/10180/1021729/homeslide-1.jpg\" id=\"html-generator-img-02\" alt=\"slider\" data-bgposition=\"center center\" data-bgfit=\"cover\" data-bgrepeat=\"no-repeat\" data-bgparallax=\"0\" class=\"rev-slidebg\" data-no-retina> \n    <div class=\"tp-caption NotGeneric-SubTitle main-slider-custom-head-pub-home\" data-x=\"['center','center','center','center']\" data-hoffset=\"['0','0','0','0']\" data-y=\"['middle','middle','middle','middle']\" data-voffset=\"['0','0','0','0']\" data-width=\"none\" data-height=\"none\" data-whitespace=\"nowrap\" data-transform_idle=\"o:1;\" data-transform_in=\"y:50px;opacity:1;s:1500;e:Power3.easeOut;\" data-transform_out=\"x:0;y:0;z:0;rX:0;rY:0;rZ:0;sX:0.9;sY:0.9;skX:0;skY:0;opacity:0;s:1000;e:Power3.easeInOut;s:1000;e:Power3.easeInOut;\" data-start=\"1000\" data-splitin=\"none\" data-splitout=\"none\" data-responsive_offset=\"on\" style=\"z-index: 7; white-space: nowrap;text-align:center;\"> \n     <div class=\"rev-slider-heading\"> \n      <h1 id=\"html-generator-head-1\">Welcome To</h1> \n      <h1 id=\"html-generator-head-2\">Manito Golf & Country Club</h1> \n     </div> \n    </div> </li>\n<div class=\"tp-static-layers slider-down-arrow\" onclick=\"slider_scrollDown();\"> \n\t<p>Scroll Down</p>\n\t</div>\n<img src=\"/documents/10180/278618/Copy+of+my_account.JPG\" alt=\"slider\" class=\"rev-slidebg\" data-bgposition=\"center center\" data-bgfit=\"cover\"  data-bgrepeat=\"repeat\">\nExperience\nClick to Learn More\nView more\nPlay\nClick to Learn More\nView more\nSavor\nClick to Learn More\nView more\nWelcome to Boca Woods\nBoca Woods Country Club offers an unparalleled private Club experience, featuring two championship 18-hole golf courses and an array of world-class amenities that define the essence of refined Country Club living. Nestled in the heart of west Boca Raton, the Club enjoys a prime location just minutes from pristine beaches, exquisite dining, premier shopping, and renowned cultural arts centers, with the vibrant cities of Fort Lauderdale and West Palm Beach within easy reach.\nAs a premier private residential golf and Country Club Community, Boca Woods is the perfect place to call home in Palm Beach County. New Members are drawn to its meticulously maintained golf courses, warm and welcoming atmosphere, and an extraordinary selection of resort-style amenities. The Clubhouse underwent an extensive renovation in 2022, transforming it into an elegant and inviting centerpiece for social gatherings, fine dining, and entertainment. That same year, the Sports Complex was completed, offering state-of-the-art fitness facilities, rejuvenating spa services, and a professionally curated Pro Shop.\nIn December 2023, the highly anticipated renovation of the Woods Course, masterfully redesigned by renowned golf course architect Rees Jones, was finalized, further enhancing the exceptional golf experience at Boca Woods. Every detail of the Club is designed to elevate the Country Club lifestyle, making now the perfect time to embrace the life you have always envisioned.\nVision Statement\nBoca Woods Country Club is dedicated to providing a Residential Country Club lifestyle featuring a Community and Club culture characterized by friendliness, civility and respect for its Members and staff in an overall setting of refinement and casual elegance.\nShow Web Content (Article), Last Updated By:\nLifestyle at South Palm Beach Florida\nBoca Woods Country Club is nestled in the heart of Boca Raton and just minutes from beautiful white sandy beaches of South Palm Beach County at Florida is the place to look.\nBoca Woods Country Club welcomes members to an upscale and active lifestyle set in a relaxed and comfortable country club setting.\nMore About Lifestyle\nSocial Club at Boca Raton\nEnjoy dinner dances, comedy shows, live concerts and more! There is always something interesting happening here at Boca Woods Country near Boca Raton, Florida\nGather in the Club House for special events and meet your neighbors by joining one of our social clubs. Get together with friends over a game of bridge, canasta or Mahjongg.\nMore About Clubs\nBoca Woods Homes\nLive and play at Boca Woods Country Club. A private golf and country club community situated on 660 spacious acres of breathtaking property with 645 estate and patio homes overlooking two 18-hole golf courses with beautiful lake and fairway views. Boca Woods is conveniently located in west Boca Raton, on the southeast coast of Florida.\nMORE ABOUT REAL ESTATE\nFitness and Spa\nThe Fitness & Spa at Boca Woods Country Club are located upstairs in our new Sports Complex building. Picturesque views of both tee #1 of our Lakes and Woods Courses, members can exercise on a variety of the latest fitness equipment, watch the onboard TV and take in the beautiful view. The spa includes a variety of amenities including salon services, salt room, massage and relaxation areas.\nMore About Fitness\n<div class=\"footer-logo\">\r\n\t\t\t\t\t\t\t\t<img alt=\"Boca Woods CC logo\" title=\"Boca Woods Country Club\" src=\"https://www.bocawoodscc.com/BocaWoodsCC-theme/images/club-images/footer-logo.png\"/>\r\n\t\t\t\t\t\t\t</div>\n10471 Boca Woods Ln. Boca Raton, FL 33428\nPhone:\n561.487.2800\nMember Login\nContact Us\nCareers\nMap & Directions\n<ul>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"viewprofile\">My Info</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"calendar-of-events\">Calendar Of Events</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"racquet-sports\">Racquet Sports</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"golf\">Golf</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"overview-contact\">Contact Us</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"careers\">Careers</a></li>\r\n\t\t\t\t\t\t\t\t\t<li><a href=\"https://goo.gl/maps/8bxYph6UKRuqRsB3A\" target=\"_blank\">Map & Directions</a></li>\r\n\t\t\t\t\t\t\t\t</ul>\n© Boca Woods Country Club\nPowered by\nNorthstar Technologies\nFollow Us\nMember Login\nHome Banner\nInner Banner",
      "emails": []
    }
  ],
  "all_links": [
    "https://www.bocawoodscc.com/meet-the-pros",
    "http://www.bocawoodscc.com/realestate",
    "https://www.bocawoodscc.com/meet-the-pros-wellness",
    "https://www.bocawoodscc.com/the-lakes-course",
    "https://www.bocawoodscc.com/fitness",
    "https://www.bocawoodscc.com/meet-the-team",
    "https://www.bocawoodscc.com/clubtour",
    "http://www.bocawoodscc.com/fitness",
    "http://www.bocawoodscc.com/overview",
    "http://www.bocawoodscc.com/social-clubs",
    "https://www.bocawoodscc.com/spa-services",
    "https://www.bocawoodscc.com/dining",
    "https://www.bocawoodscc.com/request-information",
    "https://www.bocawoodscc.com/meet-the-team-membership",
    "http://www.bocawoodscc.com/home",
    "https://www.bocawoodscc.com/racquet-sports",
    "https://www.bocawoodscc.com/careers",
    "https://www.bocawoodscc.com/events-and-videos",
    "http://www.bocawoodscc.com/request-information",
    "https://www.bocawoodscc.com/tennis",
    "https://www.bocawoodscc.com/social-clubs",
    "https://www.bocawoodscc.com/contact-us",
    "http://www.bocawoodscc.com/careers",
    "https://www.bocawoodscc.com/meet-the-pros-racquets",
    "https://www.bocawoodscc.com/the-woods-course",
    "http://www.bocawoodscc.com/overview-golf",
    "http://www.bocawoodscc.com/overview-dining",
    "https://www.bocawoodscc.com/overview-dining",
    "https://www.bocawoodscc.com/directions-phone-numbers",
    "https://www.bocawoodscc.com/overview-contact",
    "https://www.bocawoodscc.com/membership",
    "https://www.bocawoodscc.com/wellness",
    "https://www.bocawoodscc.com/golf",
    "http://www.bocawoodscc.com/login",
    "https://www.bocawoodscc.com/realestate",
    "https://www.bocawoodscc.com/pickleball",
    "http://www.bocawoodscc.com/overview-contact",
    "https://www.bocawoodscc.com/press-releases",
    "https://www.bocawoodscc.com/bocce",
    "https://www.bocawoodscc.com/home",
    "https://www.bocawoodscc.com/60",
    "https://www.bocawoodscc.com/overview",
    "https://www.bocawoodscc.com/lifestyle"
  ],
  "candidate_links": [
    "http://www.bocawoodscc.com/realestate",
    "https://www.bocawoodscc.com/meet-the-pros-wellness",
    "https://www.bocawoodscc.com/meet-the-team",
    "http://www.bocawoodscc.com/fitness",
    "http://www.bocawoodscc.com/overview",
    "http://www.bocawoodscc.com/social-clubs",
    "https://www.bocawoodscc.com/meet-the-team-membership",
    "https://www.bocawoodscc.com/events-and-videos",
    "https://www.bocawoodscc.com/contact-us",
    "https://www.bocawoodscc.com/meet-the-pros-racquets",
    "https://www.bocawoodscc.com/membership",
    "http://www.bocawoodscc.com/overview-contact",
    "https://www.bocawoodscc.com/home"
  ],
  "visited": [
    "http://www.bocawoodscc.com/",
    "http://www.bocawoodscc.com/about",
    "http://www.bocawoodscc.com/contact",
    "http://www.bocawoodscc.com/staff",
    "http://www.bocawoodscc.com/team",
    "http://www.bocawoodscc.com/board",
    "http://www.bocawoodscc.com/directory",
    "http://www.bocawoodscc.com/events",
    "http://www.bocawoodscc.com/sitemap.xml",
    "http://www.bocawoodscc.com/council",
    "http://www.bocawoodscc.com/leadership",
    "http://www.bocawoodscc.com/management",
    "http://www.bocawoodscc.com/producers",
    "http://www.bocawoodscc.com/support",
    "http://www.bocawoodscc.com/crew",
    "http://www.bocawoodscc.com/members",
    "http://www.bocawoodscc.com/bios",
    "http://www.bocawoodscc.com/people",
    "http://www.bocawoodscc.com/artists",
    "http://www.bocawoodscc.com/musicians",
    "http://www.bocawoodscc.com/faculty",
    "http://www.bocawoodscc.com/administration",
    "http://www.bocawoodscc.com/realestate",
    "https://www.bocawoodscc.com/meet-the-pros-wellness",
    "https://www.bocawoodscc.com/meet-the-team",
    "http://www.bocawoodscc.com/fitness",
    "http://www.bocawoodscc.com/overview",
    "http://www.bocawoodscc.com/social-clubs",
    "https://www.bocawoodscc.com/meet-the-team-membership",
    "https://www.bocawoodscc.com/events-and-videos",
    "https://www.bocawoodscc.com/contact-us",
    "https://www.bocawoodscc.com/meet-the-pros-racquets",
    "https://www.bocawoodscc.com/membership",
    "http://www.bocawoodscc.com/overview-contact",
    "https://www.bocawoodscc.com/home"
  ],
  "base_url": "http://www.bocawoodscc.com/"
}