{
  "pages": [
    {
      "url": "https://www.bocairecc.com/contact-us",
      "is_candidate": false,
      "has_email": false,
      "text": "2025.1.416.462\nSTART MASTER PAGE\nSkip to main content\nAbout Bocaire\nAbout Bocaire\nMeet the Team\nCommunity & Directions\nDining & Lifestyle\nGolf\nAmenities\nRacquet Sports\nAquatics Center\nWellness & Fitness\nMembership\nContact Us\nReal Estate\nMember Login\nend header\nStart Dynamic Page\nBegin Mini-Page 20311\nEnd Mini-Page 20311\nend banner\nBegin Mini-Page 20312\nContact Us\nEnd Mini-Page 20312\nend intro\nend bg-watermark\nBegin Mini-Page 20390\nEnd Mini-Page 20390\nBegin Mini-Page 20391\nBocaire Country Club\n4989 Bocaire Blvd,\nBoca Raton, FL 33487\nClub Reception:\n(561) 997-6556\nMembership:\n(561) 998-1615\n[email protected]\nEnd Mini-Page 20391\nend card-panels\nEnd Dynamic Page / ID: 116\nDiscover the Lifestyle at\n@bocairecountryclub\nElfsight Instagram Feed | Bocaire Country Club\nAbout Bocaire\nDining & Lifestyle\nGolf\nAmenities\nMembership\nContact Us\nReal Estate\nMember Login\nFacebook\nYouTube\nInstagram\nLinkedIn\n© 2025 Bocaire Country Club\nSite by\nClubessential\nTogether, We are Bocaire\nSite Scripts\nHide Click to Edits:\nFED Scripts\nBegin Mini-Page 20170\nEnd Mini-Page 20170\nCWS & Content Load\nBegin Mini-Page 20171\nEnd Mini-Page 20171\nEND MASTER PAGE",
      "emails": []
    },
    {
      "url": "https://www.bocairecc.com/membership",
      "is_candidate": false,
      "has_email": false,
      "text": "2025.1.416.462\nSTART MASTER PAGE\nSkip to main content\nAbout Bocaire\nAbout Bocaire\nMeet the Team\nCommunity & Directions\nDining & Lifestyle\nGolf\nAmenities\nRacquet Sports\nAquatics Center\nWellness & Fitness\nMembership\nContact Us\nReal Estate\nMember Login\nend header\nStart Dynamic Page\nBegin Mini-Page 20295\nEnd Mini-Page 20295\nend banner\nBegin Mini-Page 20296\nMembership\nWhere Community Comes First\nBocaire is the smallest and most intimate country club in the area. Our close-knit, welcoming community is what sets us apart. From the moment you arrive, you'll feel the warmth and inclusivity that make Bocaire feel like home.Whether you're hitting the golf course, playing racquet sports, enjoying a game of cards, dining with friends, staying fit, or simply relaxing by the pool, you'll always find friendly faces.  Our unique \"one up, two down\" membership is one of a kind. This means full access to all club amenities not only for members, but also their children, grandchildren, and parents—at no additional cost. There are no membership cards here—because we don’t need them. Our dedicated staff knows every member by name and are an integral part of the Bocaire family. At Bocaire, you're not just joining a club—you’re becoming part of a warm, vibrant community that feels like family.\nEnd Mini-Page 20296\nBegin Mini-Page 20478\nRequest a Tour\nEnd Mini-Page 20478\n[if lt IE 9]>\r\n    <script type=\"text/javascript\" src=\"a_master/NET/RegistrationManager/Scripts/flashcanvas.js\"></script>\r\n    <![endif]\n* First Name\n* Last Name\n* Email Address\n* Phone Number\n* Desired Date\n* Comments\n* Denotes Required Field\nSaving Information...Please Wait\nend intro\nend bg-watermark\nEnd Dynamic Page / ID: 108\nDiscover the Lifestyle at\n@bocairecountryclub\nElfsight Instagram Feed | Bocaire Country Club\nAbout Bocaire\nDining & Lifestyle\nGolf\nAmenities\nMembership\nContact Us\nReal Estate\nMember Login\nFacebook\nYouTube\nInstagram\nLinkedIn\n© 2025 Bocaire Country Club\nSite by\nClubessential\nTogether, We are Bocaire\nSite Scripts\nHide Click to Edits:\nFED Scripts\nBegin Mini-Page 20170\nEnd Mini-Page 20170\nCWS & Content Load\nBegin Mini-Page 20171\nEnd Mini-Page 20171\nEND MASTER PAGE",
      "emails": []
    },
    {
      "url": "https://www.bocairecc.com/about-bocaire",
      "is_candidate": false,
      "has_email": false,
      "text": "2025.1.416.462\nSTART MASTER PAGE\nSkip to main content\nAbout Bocaire\nAbout Bocaire\nMeet the Team\nCommunity & Directions\nDining & Lifestyle\nGolf\nAmenities\nRacquet Sports\nAquatics Center\nWellness & Fitness\nMembership\nContact Us\nReal Estate\nMember Login\nend header\nStart Dynamic Page\nBegin Mini-Page 20287\nEnd Mini-Page 20287\nend banner\nBegin Mini-Page 20288\nAbout Bocaire\nCasual Sophistication & An Unsurpassed Lifestyle\nBocaire Country Club is an exclusive, premier private club with a limited number of memberships. With 239 custom-built homes, each set on a minimum of 1/3 acre, you're surrounded by magnificent fairways and serene lakes. Our members and guests receive exceptional and personal attention from our professional staff who take pride in ensuring incredible service is the standard. Our intimate club is like an extended family. Experience the service and amenities you deserve. You belong at Bocaire.Vi\nVision Statement\nAt Bocaire Country Club, our desire is to create an intimate and inclusive haven with readily accessible amenities where luxury, leisure, and community converge. We strive to provide an unparalleled country club experience, offering beautiful amenities, personalized service, and a welcoming atmosphere that fosters lasting connections. Our commitment is to create a refined environment that caters to the interests and desires of our members. Through meticulous attention to detail, we aim to exceed expectations while continuously elevating and setting new standards of excellence in hospitality.\nMission Statement\nOur mission is to maintain and continuously improve our golf course and club facilities for present and future members and guests while consistently providing a rewarding membership experience that encompasses exceptional recreational amenities, unparalleled hospitality, and personalized service. Bocaire Country Club is committed to maintaining financial stability and providing exceptional value for our members while fostering a warm, inviting atmosphere that promotes camaraderie and social connections among our members and their families.\nEnd Mini-Page 20288\nend intro\nend bg-watermark\nStart Tabs\n3.4.1\nCore Values\nBegin Mini-Page 20385\nMember-Focused\nWe prioritize the needs and preferences of our members in all decision-making and aim to exceed their expectations.\nExcellence\nWe strive for excellence in all aspects of our operations, including the quality of our facilities, services, and staff.\nCommunity\nWe foster a strong sense of community among our members and staff, creating a welcoming and inclusive environment.\nIntegrity\nWe conduct all business with the highest standards of honesty, fairness, and ethical behavior.\nProfessionalism\nWe expect all staff to maintain a high level of professionalism in their interactions with members and guests.\nRespect\nWe treat all our members, guests, and employees with respect, regardless of their background, status, or opinions.\nSustainability\nWe are committed to sustainable practices that minimize our environmental impact and contribute to the well-being of future generations.\nLearning & Growth\nWe encourage continuous learning and growth among our staff and members, providing opportunities for education, training, and personal development.\nTradition\nWe honor and preserve the rich traditions and history of our club while also embracing innovation and progress.\nGiving Back\nWe support and contribute to charitable causes and organizations in our local community and beyond.\nEnd Mini-Page 20385\nEnd Tabs\nEnd Dynamic Page / ID: 104\nDiscover the Lifestyle at\n@bocairecountryclub\nElfsight Instagram Feed | Bocaire Country Club\nAbout Bocaire\nDining & Lifestyle\nGolf\nAmenities\nMembership\nContact Us\nReal Estate\nMember Login\nFacebook\nYouTube\nInstagram\nLinkedIn\n© 2025 Bocaire Country Club\nSite by\nClubessential\nTogether, We are Bocaire\nSite Scripts\nHide Click to Edits:\nFED Scripts\nBegin Mini-Page 20170\nEnd Mini-Page 20170\nCWS & Content Load\nBegin Mini-Page 20171\nEnd Mini-Page 20171\nEND MASTER PAGE",
      "emails": []
    },
    {
      "url": "https://www.bocairecc.com/meet-the-team",
      "is_candidate": false,
      "has_email": false,
      "text": "2025.1.416.462\nSTART MASTER PAGE\nSkip to main content\nAbout Bocaire\nAbout Bocaire\nMeet the Team\nCommunity & Directions\nDining & Lifestyle\nGolf\nAmenities\nRacquet Sports\nAquatics Center\nWellness & Fitness\nMembership\nContact Us\nReal Estate\nMember Login\nend header\nStart Dynamic Page\nBegin Mini-Page 20291\nEnd Mini-Page 20291\nend banner\nBegin Mini-Page 20292\nMeet the Team\nLoraine Ellis Vienne\nGeneral Manager / COO\nLoraine Ellis Vienne, CCM, CCE, CAM\nis a respected leader in the hospitality industry, known for her visionary leadership, unwavering dedication to excellence, and her ability to foster inclusive, engaged environments for both members and employees alike. With a focus on strategic growth and long-term planning, Loraine guides the club and community operations with a blend of innovation, operational expertise, and a deep passion for leadership development. Her approach empowers employees to cultivate their own authentic leadership style while aligning the organization with its broader mission and future vision.\nAndré Smith\nAssistant General Manager\nAndré Smith is the Assistant General Manager. He wears many hats and collaborates closely with both the General Manager/COO and the Department Heads to ensure the smooth day-to-day operations of the Club. André serves as the Director of Operations and oversees all aspects of the Clubhouse Operations including the dining venues. André has a background in technology and is well versed in the P.O.S. and I.T. needs of the Club.\nMurray Zirman\nController\nMurray Zirman, joined us as our Controller in April of 2024. He oversees all aspects of the monthly financials, working with the Department Heads and the General Manager/COO. He also works with the General Manager/COO to develop the Annual Operating, Capital and HOA budgets.\nSandy Michaels-Riffe\nMembership Director\nSandy enhances the member experience and ensures a smooth club transition for all new club members. She manages the membership database, conducts outreach for new members, provides updated marketing materials, manages the club directory and continually manages the governing documents and rules making sure they are current. She facilitates communications and activities for the members in conjunction with the Communications Coordinator.\nCamelia Pino\nProperty Manager\nAs the Property Manager for Bocaire, Camelia is charged with enforcing community rules and regulations, as well as coordination of property maintenance for common areas, such as the front entrance, the guard house, shrubbery, signs, street lights, walks, irrigation, and other improvements located within the Association property. She also ensure the community complies with local laws and manage the Association's budget. Camelia is the liaison between residents and the Architectural Rreview Board, handling resident construction and improvement requests. Additionally, she assists with maintaining harmonious community relations.\nLena Mali\nCommunications Coordinator\nLena Mali fills the new position of Communications Coordinator. She has been enhancing the Club’s communication strategies by adding social media posts, re-branding marketing content and crafting materials for newsletters, social media, and the Club’s website to ensure our messaging is both consistent and effective. She works closely with various departments to promote their events, updates, and member engagement, helping to create a vibrant and informed community.\nCorey Johnson\nDirector of Golf\nAs the Director of Golf, Corey is responsible for managing the entire Golf Operation at Bocaire. From running tournaments, to player development for both juniors and adults, programming and events, and managing the retail operation of the Golf Shop, he wears many hats on a daily basis. Corey has a great team of professionals at his side. Whether it’s your golf game or your golf cart, his team is here to help you will all of your member needs!\nKC Henderson\nGolf Course Superintendent\nAs the Golf Course Superintendent, KC and his team oversee 100 acres of turf, 25 acres of landscape and maintain roughly 50+ pieces of equipment here at Bocaire Country Club. He is also responsible for a maintenance facility that spans 13,000 square feet over 3 buildings and includes an environmental wash station for equipment. Besides providing a beautiful golf course for Bocaire Country Club, KC loves speaking to the members and educating them on the various agronomic practices he and his team carry out on the golf course.\nEdyie Harris\nDirector of Wellness & Aquatics\nIn her role as Director of Wellness & Aquatics, Edyie oversees all daily operations of the fitness center, group exercise classes, aquatics center, cycle, and Pilates studios along with Bocaire Bliss spa services. This includes administrative responsibilities, program development, policy implementation, marketing and communications and maintenance of all areas of wellness. She also enjoys personal training with our members. It is her collective goal, as a Wellness Team, to offer a positive, encouraging, clean and welcoming environment that our members want to come to and are proud to share with their family and friends.\nDan Lepadatu\nDirector of Racquet Sports\nAs a Director of Racquet Sports, Dan is responsible for managing the entire Racquet Sports Operation, from maintaining the tennis and pickleball courts in the best shape possible, to programming and organizing all activities, social events, clinics, tournaments and championships. Dan also coordinates Bocaire’s four competitive Tennis Teams, organizing team practices and supervising home matches. He develops modern programs for tennis and pickleball player development, cardio clinics and junior camps. His goal as a Team of Racquet Professionals is to create an environment that inspires players of all ages and levels, providing an opportunity to meet new friends, sharpen their game and have fun!\nMauricio Faria\nClub Engineer\nAs the Club Engineer, Mauricio and his team oversee the entire Clubhouse and Facilities Maintenance operation. This includes preventative maintenance programs for equipment and Housekeeping services here at Bocaire Country Club. His service to the members of Bocaire has spanned over 23 years.\nJay Prisco\nExecutive Chef\nAs the Executive Chef, Jay is responsible for the management and oversight of all culinary operations. He is responsible for assuring a high standard of quality in product selection, presentation, and preparation of the member's culinary experience. He is responsible for the creation of menus and daily recipes to provide members with an extraordinary dining experience. Chef is always willing to address member specific dietary needs and accommodates special requests.\nFrenel Vertus\nDirector of Food & Beverage\nFrenel Vertus is the Director of Food and Beverage. He oversees the entire Food & Beverage department, from catering and restaurant operations to staffing and budget management. He oversees the hiring, training, and evaluation of staff members. Frenel works to ensure a high quality Food and Beverage standard and service, providing an outstanding member experience.\nJoel Tabernilla\nAssistant F&B Manager\nJoel has been with Bocaire in the Food and Beverage department for over ten years. He oversees the dining room operations to ensure an excellent member experience. Joel works to ensure a high standard of service which provides an outstanding experience for our members.\nLeah Robbins\nMember Relations Specialist\nAs the Member Relations Specialist, Leah is on hand Monday through Friday at the Concierge Desk assisting members with making their dining reservations, managing the daily \"To Go Orders\", assisting with special menu orders, providing concierge services and answering the many questions that can come through the front desk. She is the smiling voice on the phone and is happy to connect the members to the appropriate Department Head when requesting information. She excels at working with the Bocaire membership in ensuring all their needs are met!\nEnd Mini-Page 20292\nend intro\nend bg-watermark\nEnd Dynamic Page / ID: 106\nDiscover the Lifestyle at\n@bocairecountryclub\nElfsight Instagram Feed | Bocaire Country Club\nAbout Bocaire\nDining & Lifestyle\nGolf\nAmenities\nMembership\nContact Us\nReal Estate\nMember Login\nFacebook\nYouTube\nInstagram\nLinkedIn\n© 2025 Bocaire Country Club\nSite by\nClubessential\nTogether, We are Bocaire\nSite Scripts\nHide Click to Edits:\nFED Scripts\nBegin Mini-Page 20170\nEnd Mini-Page 20170\nCWS & Content Load\nBegin Mini-Page 20171\nEnd Mini-Page 20171\nEND MASTER PAGE",
      "emails": []
    }
  ],
  "all_links": [
    "https://www.bocairecc.com/",
    "http://www.bocairecc.com/golf",
    "https://www.bocairecc.com/default.aspx?p=TrackHyperlink&URL=https%3a%2f%2fwww.youtube.com%2fchannel%2fUC4bXIQhM_HxJ68Vu2fdtOgw&ssid=112388300434&fid=14233816540",
    "https://www.bocairecc.com/member-login",
    "https://www.bocairecc.com/dining-and-lifestyle",
    "https://www.bocairecc.com/wellness-and-fitness",
    "https://www.bocairecc.com/contact-us",
    "https://www.bocairecc.com/racquet-sports",
    "https://www.bocairecc.com/community-and-directions",
    "https://www.bocairecc.com/aquatics-center",
    "https://www.bocairecc.com/membership",
    "https://www.bocairecc.com/about-bocaire",
    "https://www.bocairecc.com/default.aspx?p=TrackHyperlink&URL=https%3a%2f%2fwww.linkedin.com%2fcompany%2fbocaire-country-club&ssid=112388547592&fid=14233816540",
    "https://www.bocairecc.com/default.aspx?p=TrackHyperlink&URL=https%3a%2f%2fwww.facebook.com%2fbocairecountryclub%2f&ssid=112388176855&fid=14233816540",
    "http://www.bocairecc.com/membership#tour",
    "http://www.bocairecc.com/racquet-sports",
    "https://www.bocairecc.com/golf",
    "https://www.bocairecc.com/meet-the-team",
    "http://www.bocairecc.com/dining-and-lifestyle",
    "https://www.bocairecc.com/default.aspx?p=TrackHyperlink&URL=https%3a%2f%2fwww.homes.com%2fhomes-for-sale%2f%3fsk%3dOoujc2WWdgqVqPdQW6SKxrF-o1LpLmjzP7pXqjwbHk8%26bb%3di6_pshjwuG5jjjR&ssid=112382986537&fid=14233816540",
    "https://www.bocairecc.com/default.aspx?p=TrackHyperlink&URL=https%3a%2f%2fwww.instagram.com%2fbocairecountryclub%2f&ssid=112388424013&fid=14233816540"
  ],
  "candidate_links": [
    "https://www.bocairecc.com/contact-us",
    "https://www.bocairecc.com/membership",
    "https://www.bocairecc.com/about-bocaire",
    "https://www.bocairecc.com/meet-the-team"
  ],
  "visited": [
    "http://www.bocairecc.com/",
    "http://www.bocairecc.com/about",
    "http://www.bocairecc.com/contact",
    "http://www.bocairecc.com/staff",
    "http://www.bocairecc.com/team",
    "http://www.bocairecc.com/board",
    "http://www.bocairecc.com/directory",
    "http://www.bocairecc.com/events",
    "http://www.bocairecc.com/sitemap.xml",
    "http://www.bocairecc.com/council",
    "http://www.bocairecc.com/leadership",
    "http://www.bocairecc.com/management",
    "http://www.bocairecc.com/producers",
    "http://www.bocairecc.com/support",
    "http://www.bocairecc.com/crew",
    "http://www.bocairecc.com/members",
    "http://www.bocairecc.com/bios",
    "http://www.bocairecc.com/people",
    "http://www.bocairecc.com/artists",
    "http://www.bocairecc.com/musicians",
    "http://www.bocairecc.com/faculty",
    "http://www.bocairecc.com/administration",
    "https://www.bocairecc.com/contact-us",
    "https://www.bocairecc.com/membership",
    "https://www.bocairecc.com/about-bocaire",
    "https://www.bocairecc.com/meet-the-team"
  ],
  "base_url": "http://www.bocairecc.com/"
}