{
  "pages": [
    {
      "url": "https://bogeysgolfsuites.com/contact",
      "is_candidate": false,
      "has_email": true,
      "text": "Get in Touch\nReady to plan your group event or party at Bogeys? Use our\nEvent Request Form\nto get details!\nStay Connected\nFollow\nFollow\nFollow\nPlay. Practice. Party.\nSunday – Thursday: 10AM – 10PM\nFriday – Saturday: 10AM – 11PM\nName\nPhone\nEmail Address\nMessage\nSubmit\n\nPhone\n(850) 304-7171\n\nEmail\nInfo@BogeysGolfSuites.com\n\nVisit\n9410 University Pkwy, Suite B\nPensacola, FL 32514",
      "emails": [
        "info@bogeysgolfsuites.com"
      ]
    },
    {
      "url": "https://bogeysgolfsuites.com/join-team",
      "is_candidate": false,
      "has_email": true,
      "text": "Join the Team\nLooking for a great job in Pensacola?\nCome join the Bogeys Family\nBogeys is a premier high-end golf suite venue and grill offering exceptional dining experiences, state-of-the-art indoor golf simulators, and a luxurious atmosphere for guests to enjoy.  Our mission is to create a fun environment where patrons of all ages can make memories and have an unforgettable gaming experience. We believe in the well-being of our team and what a difference that can make for our valued customers’ experience here.  We know by creating a safe and unique place to gather, we will be a meaningful part of our community.\nAvailable Positions\n\nBartender\nInvolves a blend of bartending duties, providing demonstrations and instructions on our golf simulators, and ensuring a memorable experience for our guests.\nApply Now\n\nServer\nThis role involves a blend of serving duties, providing demonstrations and instructions on our golf simulators, and ensuring a memorable experience for our guests.\nApply Now\n\ncook\nCome work in our cafe-style kitchen preparing and cooking a variety of delicious dishes for our customers. The ideal candidate should have a love for culinary arts, a strong attention to detail, and exceptional customer service.\nApply Now",
      "emails": [
        "info@bogeysgolfsuites.com"
      ]
    },
    {
      "url": "https://bogeysgolfsuites.com/parties-events",
      "is_candidate": false,
      "has_email": true,
      "text": "private parties & Group events\nLet’s party! Bogeys is the perfect party lounge for your group event. We offer a fantastic range of indoor sports, games, and activities for your celebration. Mix a little friendly competition with our delicious food and drink menu to create an unforgettable group event!\nPlan Your Event\ngroup events: 20 people or more\nvip party rooms\nRound up the crew and reserve our private VIP room! It features two multi-sport simulators, two booths, and plenty of room for 15 people or more!\nPrivate VIP room: 2 Booths\n$110 per Hour\n$75 Food & Beverage minimum per Hour\nSummer Kids Parties\nLooking for the best\nkids summer party\nidea that’s active, exciting, and budget-friendly? Bogey’s Golf Suites has you covered with our all-new\nweekday party package\n!\nFor just\n$225\n, host up to\n10 kids\nfor\n2 hours\nof fun in our cool, air-conditioned venue — perfect for summer birthdays, end-of-school celebrations, or just beating the Florida heat.\nLearn More\nLeave the party Hosting to us\nWe offer all-inclusive packages that are perfect for your group event of 20 or more. Bogeys matches incredible in-suite service with epic gameplay, food, and drinks so you can enjoy connecting and celebrating.\nBook your party\nLet’s Plan the Best Party or Event\n\nCompany Events\nEntertain corporate clients or “team build” with your work crew in a unique, super fun setting to celebrate, play, and party!\n\nBirthday Parties\nReady to throw the most epic birthday party? You’ve come to the right place. Come battle your buddies and celebrate with virtual sports & gameplay.\n\nSchool & Church Events\nWe offer the perfect event packages for schools, churches, and other organizations to get out together for bonding and celebration.\n\nFundraisers\nAre you raising money for a good cause? Have the good folks who care gather somewhere awesome! Whether it’s a large group or a full venue rental, we’ve got you covered.\n\nHoliday Parties\nGet your swing on while you celebrate the season! Get up to Bogeys for an epic holiday bash or festive office celebration. Play, practice, and party in the merriest atmosphere.\n\nGraduation Parties\nToss that cap and get up to the ultimate destination to make memories! We meticulously plan out the perfect vibes, providing your favorite virtual sports, games, food, and drinks for you and your loved ones.\nGroup Event Form\nFull Name\nRequested Event Date\nPhone Number\nEmail Address\nNumber of Guests\nPreferred Start Time\nCompany, Organization, or Team Name\nHow did you hear about Bogeys Golf Suites & Sports Bar?\nHow did you hear about Bogeys Golf Suites & Sports Bar?\nSocial Media\nSearch Engine\nAnother Website\nReferral\nEmail\nBogeys Team Member\nWe appreciate your interest in hosting your group event here at Bogeys! Tell us a little about your gathering .\nFULL SEND! Just confirm we can connect with you and plan the perfect event:\nFULL SEND! Just confirm we can connect with you and plan the perfect event:\nI confirm I am over 18 years of age and by submitting this form, I agree to allow Bogeys to contact me regarding my group event.\nSubmit\nCome party with us\nEnjoy Pensacola’s New Event space\nLooking for the perfect party spot to entertain everyone? We’re here to help you host corporate clients, bond with colleagues, and celebrate your special days with family and friends.\nWe recommend you reserve your party as far in advance as you can. Just use our Group Event Form to get planning with us.",
      "emails": [
        "info@bogeysgolfsuites.com"
      ]
    }
  ],
  "all_links": [
    "https://bogeysgolfsuites.com/golf-suites",
    "https://bogeysgolfsuites.com/contact",
    "https://bogeysgolfsuites.com/join-team",
    "https://bogeysgolfsuites.com/summer-kids-parties",
    "https://bogeysgolfsuites.com/specials",
    "https://bogeysgolfsuites.com/menu",
    "https://bogeysgolfsuites.com/",
    "mailto:info@bogeysgolfsuites.com",
    "https://bogeysgolfsuites.com/indoor-golf-league",
    "https://bogeysgolfsuites.com/parties-events"
  ],
  "candidate_links": [
    "https://bogeysgolfsuites.com/contact",
    "https://bogeysgolfsuites.com/join-team",
    "https://bogeysgolfsuites.com/parties-events"
  ],
  "visited": [
    "https://bogeysgolfsuites.com/",
    "https://bogeysgolfsuites.com/about",
    "https://bogeysgolfsuites.com/contact",
    "https://bogeysgolfsuites.com/staff",
    "https://bogeysgolfsuites.com/team",
    "https://bogeysgolfsuites.com/board",
    "https://bogeysgolfsuites.com/directory",
    "https://bogeysgolfsuites.com/events",
    "https://bogeysgolfsuites.com/sitemap.xml",
    "https://bogeysgolfsuites.com/council",
    "https://bogeysgolfsuites.com/leadership",
    "https://bogeysgolfsuites.com/management",
    "https://bogeysgolfsuites.com/producers",
    "https://bogeysgolfsuites.com/support",
    "https://bogeysgolfsuites.com/crew",
    "https://bogeysgolfsuites.com/members",
    "https://bogeysgolfsuites.com/bios",
    "https://bogeysgolfsuites.com/people",
    "https://bogeysgolfsuites.com/artists",
    "https://bogeysgolfsuites.com/musicians",
    "https://bogeysgolfsuites.com/faculty",
    "https://bogeysgolfsuites.com/administration",
    "https://bogeysgolfsuites.com/contact",
    "https://bogeysgolfsuites.com/join-team",
    "https://bogeysgolfsuites.com/parties-events"
  ],
  "base_url": "https://bogeysgolfsuites.com/"
}