{
  "pages": [
    {
      "url": "https://bradfordcountyfl.gov/contact-us/",
      "is_candidate": false,
      "has_email": false,
      "text": "Contact Us\nCarolyn Spooner, Chair\nDanny Riddick, Vice Chair\nScott Kornegay, County Manager\n945 N. Temple Ave\nStarke, FL 32091\nEmail:\n[email protected]\nPhone:\n(904) 966-6280\nContact Us\nName\n*\nPhone\n*\nEmail\n*\nMessage\n*\nCaptcha\nSubmit\nIf you are human, leave this field blank.\nContact Us\nCarolyn Spooner, Chair\nDanny Riddick, Vice Chair\nScott Kornegay, County Manager\n945 N. Temple Ave\nStarke, FL 32091\nEmail:\n[email protected]\nPhone:\n(904) 966-6280\nContact Us\nName\n*\nPhone\n*\nEmail\n*\nMessage\n*\nCaptcha\nSubmit\nIf you are human, leave this field blank.",
      "emails": []
    },
    {
      "url": "https://bradfordcountyfl.gov/fire-rescue/",
      "is_candidate": false,
      "has_email": false,
      "text": "Fire/Rescue\nYour Commissioners\nYour Government\nCounty Departments\nBusiness & Development\nI Want To\nFire / Rescue\nAttention: This page is not monitored continuously.\n*If you are experiencing an emergency, please contact 9-1-1 immediately.*\nOn behalf of the men and women of our department, welcome to our page. We at Bradford County Fire Rescue are dedicated to providing the highest quality care possible to the citizens of and those passing through Bradford County Florida. Driven by COMPASSION for our community, ADVOCACY for our patients, a sense of RESPONSIBILITY, and continuing EDUCATION, we assist the citizens we serve.\nBradford County Emergency Medical Services was established on September 19th, 1983 by the Board of County Commissioners. On October 1\nst\nlater that year, the first call for service was received. Prior to then, EMS services had been provided by Bradford County Hospital, Inc. since 1976.On October 1, 2020 the Bradford County Fire Rescue Department was created by the Board of County Commissioners combining Fire and EMS services.\nPresently, our department staffs five Advanced Life Support (ALS) transport units strategically located throughout the county. We respond to approximately 5,800 emergency calls for service each year. We also staff three Fire Engines strategically throughout the county.\nOn this site you will find a host of information about our department. We hope you find our website interesting and useful, and hope you come back often, as new content and features are added regularly.\nCore Values of the Department\nHONOR\nThe enormous commitment necessary to perform the department’s tasks requires excellence of character. We inspire each other through pride in our unit, which is a belief that every action reflects on all personnel, both past and present.\nDEDICATION\nA commitment to the objectives of our mission is an essential part of our code of conduct. The faithful observance of duty calls for us to fulfill our obligations professionally, honestly, and compassionately.\nPREPAREDNESS\nBy combining all of the components of our core values, BCFR will maintain its constant state of readiness to meet all threats and challenges, both traditional and new.\nEmployment\nCommunity Paramedic Intake Form\nFire Prevention & Safety\nAmbulance Billing\nNotice of Privacy Practices\nContact Information\nHeadquarters\nBradford County Fire Rescue\n945-C North Temple Avenue\nStarke, Florida 32091\n(904) 966-6911\nAdministrative Officers\nBen Carter, Chief\nOffice: 904-966-6906\n[email protected]\nDylan Rodgers, Division Chief\nOffice: 904-966-6903\n[email protected]\nChris Cooksey, Fire Marshal\nOffice: 904-966-6202\n[email protected]\nJeremy Loomis, Training Captain\n[email protected]\nDr. Matthew Odom Medical Director\n904-966-6911\nLike us on Facebook\nBradford County Fire Rescue Facebook\nFire/Rescue\nYour Commissioners\nYour Government\nCounty Departments\nBusiness & Development\nI Want To\nFire / Rescue\nAttention: This page is not monitored continuously.\n*If you are experiencing an emergency, please contact 9-1-1 immediately.*\nOn behalf of the men and women of our department, welcome to our page. We at Bradford County Fire Rescue are dedicated to providing the highest quality care possible to the citizens of and those passing through Bradford County Florida. Driven by COMPASSION for our community, ADVOCACY for our patients, a sense of RESPONSIBILITY, and continuing EDUCATION, we assist the citizens we serve.\nBradford County Emergency Medical Services was established on September 19th, 1983 by the Board of County Commissioners. On October 1\nst\nlater that year, the first call for service was received. Prior to then, EMS services had been provided by Bradford County Hospital, Inc. since 1976.On October 1, 2020 the Bradford County Fire Rescue Department was created by the Board of County Commissioners combining Fire and EMS services.\nPresently, our department staffs five Advanced Life Support (ALS) transport units strategically located throughout the county. We respond to approximately 5,800 emergency calls for service each year. We also staff three Fire Engines strategically throughout the county.\nOn this site you will find a host of information about our department. We hope you find our website interesting and useful, and hope you come back often, as new content and features are added regularly.\nCore Values of the Department\nHONOR\nThe enormous commitment necessary to perform the department’s tasks requires excellence of character. We inspire each other through pride in our unit, which is a belief that every action reflects on all personnel, both past and present.\nDEDICATION\nA commitment to the objectives of our mission is an essential part of our code of conduct. The faithful observance of duty calls for us to fulfill our obligations professionally, honestly, and compassionately.\nPREPAREDNESS\nBy combining all of the components of our core values, BCFR will maintain its constant state of readiness to meet all threats and challenges, both traditional and new.\nEmployment\nCommunity Paramedic Intake Form\nFire Prevention & Safety\nAmbulance Billing\nNotice of Privacy Practices\nContact Information\nHeadquarters\nBradford County Fire Rescue\n945-C North Temple Avenue\nStarke, Florida 32091\n(904) 966-6911\nAdministrative Officers\nBen Carter, Chief\nOffice: 904-966-6906\n[email protected]\nDylan Rodgers, Division Chief\nOffice: 904-966-6903\n[email protected]\nChris Cooksey, Fire Marshal\nOffice: 904-966-6202\n[email protected]\nJeremy Loomis, Training Captain\n[email protected]\nDr. Matthew Odom Medical Director\n904-966-6911\nLike us on Facebook\nBradford County Fire Rescue Facebook",
      "emails": []
    },
    {
      "url": "https://bradfordcountyfl.gov/county-commisisoners/",
      "is_candidate": false,
      "has_email": false,
      "text": "YOUR COMMISSIONERS\nCarolyn Spooner\nDistrict 1\nKenny Thompson\nDistrict 2\nChris Dougherty\nDistrict 3\nDanny Riddick\nDistrict 4\nDiane Andrews\nDistrict 5\nMission Statement\nThe mission of the Board of County Commissioners of Bradford County, Florida is to protect the health, safety and welfare of and to positively impact the lives of the citizens of our community through the provision of high-quality, cost-effective local government services.\nVision Statement\nWe are a small, close-knit, rural community and it is the vision of the Board of County Commissioners of Bradford County, Florida that we recognize and retain that history, culture and identity as we work diligently to grow and develop into a modern, streamlined, high-functioning local government that strives for excellence in the preservation of the health, safety and welfare of our citizens and the promotion- of the unique opportunities available in our community which make Bradford County a place that people want to live and work.\nValues Statements\nRespect: Treat everyone with dignity and respect while promoting civic pride and building a workforce that is strong and that values the people we represent.\nHonesty and Integrity: Honor our word and be transparent in all that we do, to ensure that our citizens know that our methods are honest and can be trusted.\nCommunication: Work to communicate and find time for needed meetings, to ensure we are providing the services we were elected to provide and to do so in an open and transparent fashion.\nInnovation/Accountability: Always strive to find ways to improve our county, and continuously look for ideas or methods that make us one of the most cost-effective counties while providing accountability to those we serve, including making an effort to conserve fiscal resources and seek all appropriate grant opportunities.\nTeamwork: Make an effort to build on our relationships with community partners in Starke, Lawtey, Hampton and Brooker as well as Constitutional Officers, who are all working towards making Bradford County better. Have workshops where everyone could be involved and promote brainstorming — great ideas come out of these type meetings.\nPolitical Communication: Invite our Representative and Senator to meet with us and openly discuss our needs, and seek ideas from their knowledge. Ensure that we are present when discussions are made that concerns decisions for Bradford County. We must be a voice for our county, collectively as well as individually.\nLast updated 10/28/2021 4:15:32 PM\nContact Your County Commissioner\nThe Bradford County Board of County Commissioners is a five-member board elected to serve the citizens of Bradford County. Commissioners are elected for a four-year term by voters in the district they represent. The Board of County Commissioners establish local government policy and manage operation of the County Administration, County Public Works Department, Fire/Emergency Medical Services, Land Use Administration, SHIP, Solid Waste, County Recreation, Building Department, Economic Development, Veteran Services, Agricultural Extension Office, and Maintenance. The Board of County Commissioners adopts the millage rate annually and approves the County budget, which determines the expenditures and revenue necessary to operate all County Services. Florida Statutes Chapter 125 establishes the powers and duties of the Board of County Commissioners.",
      "emails": []
    },
    {
      "url": "https://bradfordcountyfl.gov/public-works/",
      "is_candidate": false,
      "has_email": false,
      "text": "Slide 4\nSlide 1\nSlide 3\nSlide 2\nPublic Works\nAbout Public Works\nMaintenance\nMosquito Control\nTransport Infrastructure\nSolid Waste Services\nPublic Works\nThe mission of the Public Works Department is to preserve the County’s investment in its roadways, bridges, facilities, and environment by planning, implementing and administrating maintenance, inspection and reconstruction programs:\nTo provide effective, efficient, safe and environmentally sensitive mosquito control services.\nTo preserve, protect, and improve the environment by promoting recycling and proper solid waste handling and management practices in our community.\nTo provide all county fleet equipment users with the support services they require.\nTo provide all public roads with signs and signals.\nTo provide support services during natural disasters or other emergencies.\nJob Openings\nInterested applicants can either\nprint an application here,\nor stop by the Road Department/Public Works office to receive an application. Once your application is filled out, please bring it to the Road Department with a front and back copy of your driver’s license.\nDaily Work Schedules\nTo view this content, you need to have JavaScript enabled in your browser.\nTo do so, please follow these instructions\n.\nLoading...\nName\nSize\nModified\nAscending\nDescending\nThumbnails view\nList view\nNo options...\nContact Information\nJason Dodds\nPublic Works Director\n[email protected]\nRick Stevenson\nMaintenance\n[email protected]\nDale Hayes\nRoad Department\n[email protected]\nDottie Hansen\nAdministrative Assistant\n[email protected]\nBradford County Public Works\n812 North Grand Street\nStarke, FL 32091\n(p) 904-966-6243\nOffice Hours\nMonday-Thursday – 6:30am-4:30pm",
      "emails": []
    },
    {
      "url": "https://bradfordcountyfl.gov/clerk-to-the-board/",
      "is_candidate": false,
      "has_email": false,
      "text": "Clerk to the Board\nArticle V and Article VIII of the Florida Constitution provide the basis for the role of the Clerk. Pursuant to these sections of the Florida Constitution the offices of clerks of the circuit courts in each county is designated as the “ex officio clerk of the board of county commissioners, auditor, recorder, and custodian of all county funds.”\nDuties as Ex officio Clerk of the Board of County Commissioners\n1. Keep the records and minutes of the Board of County Commissioners\n2. Custodian of the Board seal and has the authority to affix the seal to any instrument when necessary\n3. Give copies of writings in his or her custody as the Clerk of the Board of County Commissioners\n4. Perform such other duties as the Board may direct\nDuties as Custodian and Accountant of County Funds\n1. Keeping the Board’s accounts\n2. Receiving and depositing funds of the county\n3. Keeping an accurate and complete set of books\n4. Investing excess county funds\nDuties as County Auditor\n1. Verify expenditures are for lawful and public purpose\n2. Inspect and examine all accounts of the Board at all times\n3. Act as a “watchdog” of Board financial activities\nClerk to the Board\nArticle V and Article VIII of the Florida Constitution provide the basis for the role of the Clerk. Pursuant to these sections of the Florida Constitution the offices of clerks of the circuit courts in each county is designated as the “ex officio clerk of the board of county commissioners, auditor, recorder, and custodian of all county funds.”\nDuties as Ex officio Clerk of the Board of County Commissioners\n1. Keep the records and minutes of the Board of County Commissioners\n2. Custodian of the Board seal and has the authority to affix the seal to any instrument when necessary\n3. Give copies of writings in his or her custody as the Clerk of the Board of County Commissioners\n4. Perform such other duties as the Board may direct\nDuties as Custodian and Accountant of County Funds\n1. Keeping the Board’s accounts\n2. Receiving and depositing funds of the county\n3. Keeping an accurate and complete set of books\n4. Investing excess county funds\nDuties as County Auditor\n1. Verify expenditures are for lawful and public purpose\n2. Inspect and examine all accounts of the Board at all times\n3. Act as a “watchdog” of Board financial activities",
      "emails": []
    },
    {
      "url": "https://bradfordcountyfl.gov/fire-rescue/fire-prevention-safety/",
      "is_candidate": false,
      "has_email": false,
      "text": "Fire Prevention & Safety\nYour Commissioners\nYour Government\nCounty Departments\nBusiness & Development\nI Want To\nFire Prevention & Safety\nSmoke Detectors\nProper placement of smoke detectors in a home.\nSmoke detectors are one of the most important safety features of any home. As the name implies, smoke detectors sound an alarm to alert inhabitants of the home to the presence of smoke that may be caused by a fire. Proper placement of smoke detectors, therefore, is key so you are always alerted to the presence of smoke.\nNumber of smoke detectors.\nAt the very least, you will want to use at least one smoke detector for each bedroom. The ideally protected house is one that also has a detector in the living room, and any other living area. Also place detectors in hallways that connect each bedroom to each other. You can place detectors near, but not in kitchens. Each level of the home should be protected with smoke detectors.\nHeight\nPlace smoke detectors either on the ceiling facing downward at the floor or high on the wall facing the inside of the room. Whichever type of placement you choose, make sure to not place a detector in a corner, smoke tends not to collect in these so-called “dead corners”. If you choose the wall placement, make sure to leave at least 4 to 6 inches clearance between the detector and the ceiling, but do not place them any lower than that.\nPlacement\nNever install a smoke detector near a venting duct used by a central heat system. Vents can blow smoke away from the detector, inhibiting its ability to detect the smoke. To save yourself trouble in the long run, spend some time choosing a location for the smoke detector that meets all safety requirements discussed above but that is also easily accessible for maintenance and battery replacement. Change batteries at least once a year.\nFire Safety\nAccording to Ready.gov, a fire can go from a hazard to life-threatening in a matter of minutes. If a fire starts while you’re asleep, you need to get out fast! A full quarter of home fire deaths are caused by fires that started in the bedroom, according to the National Fire Protection Association.\nPractice fire drills.\nDespite there being over a million residential fires each year, only a third of American households have a fire escape plan. Schedule a twice-yearly fire drill, and make one of those at night. This way you and your family are truly prepared. With a fire, every second counts, so practice your escape plan quickly. In case smoke makes it dark, practice with your eyes closed or a bandana over your head to see if you can feel your way out. If a fire starts outside your bedroom, practice crawling low to the ground toward the door. Practice touching the door knob before opening it. If it’s hot to touch, go to your other route and practice unrolling your safety escape ladders. Confirm that you can easily open your bedroom window. Practice the stop, drop, and roll in case you catch on fire.\nRegularly maintain smoke detectors.\nSmoke alarms reduce your risk of dying by fire by half. Choose smoke alarms with sealed-in 10-year lithium battery. If your house is currently using hard-wire smoke alarms, replace them with battery-powered models or install battery-powered models as backups. Each month, test the alarm and clear it of dust. Every year, replace the batteries. Every 10 years, replace the smoke alarm unit. Get a separate carbon monoxide alarm and place one outside your bedroom so you’ll wake up if it starts to beep.\nRemove obvious fire hazards.\nDo not light candles in your bedroom. Avoid using space heaters in the bedroom. Never smoke in your bedroom. If you have a rug in your bedroom, avoid running electrical cords under it. Regularly check that all of the electronics in your bedroom are not showing frays or damage to the wires, and if so, replace them immediately. If you live in an older home, hire a professional to come take a look at your wiring and replace anything that’s old.\nCarbon Monoxide – Understanding the Risk\nWhat is carbon monoxide?\nCarbon monoxide is an odorless, colorless and toxic gas. Because it is impossible to see, taste or smell the toxic fumes, CO can kill you before you are aware it is in your home. At lower levels of exposure, CO causes mild effects that are often mistaken for the flu. These symptoms include headaches, dizziness, disorientation, nausea and fatigue. The effects of CO exposure can vary greatly from person to person depending on age, overall health and the concentration and length of exposure.\nWhere does carbon monoxide come from?\nCO gas can come from several sources: gas-fired appliances, charcoal grills, wood-burning furnaces or fireplaces and motor vehicles.\nWho is at risk?\nEveryone is at risk for CO poisoning. Medical experts believe that unborn babies, infants, children, senior citizens and people with heart or lung problems are at even greater risk for CO poisoning. Protect yourself and your family from CO poisoning by installing at least one carbon monoxide alarm with an audible warning signal near the sleeping areas and outside individual bedrooms. Carbon monoxide alarms measure levels of CO over time and are designed to sound an alarm before an average, healthy adult would experience symptoms. It is very possible that you may not be experiencing symptoms when you hear the alarm. This does not mean that CO is not present. Have a qualified professional check all fuel burning appliances, furnaces, venting and chimney systems at least once a year. Never use your range or oven to help heat your home and never use a charcoal grill or hibachi in your home or garage. Never keep a car running in a garage. Even if the garage doors are open, normal circulation will not provide enough fresh air to reliably prevent a dangerous buildup of CO. When purchasing an existing home, have a qualified technician evaluate the integrity of the heating and cooking systems, as well as the sealed spaces between the garage and house. The presence of a carbon monoxide alarm in your home can save your life in the event of CO buildup. If your carbon monoxide alarm activates call 9-1-1.\nAre you prepared for a Natural Disaster?\nThe Bradford County Fire Rescue department is committed to educating residents by providing public awareness of what to do in case of a natural disaster.\n“Shelter in Place”\nIn the event of a hazardous materials release the fire or police department may ask residents to “shelter in place” or stay indoors until the release can be contained. To shelter in place means to stay in hour home, close all windows and doors, bring your pets in, and turn off your heating and air conditioning. Stay indoors, and monitor television and radio announcements for further instructions. Shelter in place is preferable to evacuation when it is not feasible to move a large amount of people in a short period of time, or to expose them to a hazardous material. Do not hesitate to call 9-1-1 if there is an emergency during the shelter in place order.\nEvacuation\nAn evacuation order may be authorized by public safety personnel. An evacuation order will be given in the event residents need to leave their homes quickly, but in a calm and orderly fashion. A shelter location such as a church, school, or other property will be detailed in the evacuation order. You can also seek shelter at a family or friends home that is far away from the emergency incident. If an evacuation order is given please take only essential items or your family disaster care kit with you, lock your home, and leave immediately. If you do not have transportation, emergency responders can arrange transportation. Know two ways out of your residential area in case one is blocked. Monitor television and radio for further information on the length of the evacuation order.\nFamily Disaster Supply Kit (for at least 72 hours)\nIf you cannot leave your home, or need to evacuate immediately and cannot return for several days you need to have a disaster kit readily available with essential items. Here is what you need:\none gallon of water per person per day for three days\ncanned meat/fruit/vegetables\nbattery operated radio and extra batteries\npaper cups/plates/utensils\nflashlight and extra batteries\ncash or traveler checks\nnon-electric can opener\ntoiletries\nsoap and liquid detergent\npersonal hygiene items\nrain gear\nshoes or work boots\nblankets or sleeping bags\nbaby items\nprescription medicines\na first aid kit\nContact Information\nHeadquarters\nBradford County Fire Rescue\n945-C North Temple Avenue\nStarke, Florida 32091\n(904) 966-6911\nAdministrative Officers\nBen Carter, Chief\nOffice: 904-966-6906\n[email protected]\nDylan Rodgers, Division Chief\nOffice: 904-966-6903\n[email protected]\nChris Cooksey, Fire Marshal\nOffice: 904-966-6202\n[email protected]\nJeremy Loomis, Training Captain\n[email protected]\nDr. Matthew Odom Medical Director\n904-966-6911\nLike us on Facebook\nBradford County Fire Rescue Facebook\nFire Prevention & Safety\nYour Commissioners\nYour Government\nCounty Departments\nBusiness & Development\nI Want To\nFire Prevention & Safety\nSmoke Detectors\nProper placement of smoke detectors in a home.\nSmoke detectors are one of the most important safety features of any home. As the name implies, smoke detectors sound an alarm to alert inhabitants of the home to the presence of smoke that may be caused by a fire. Proper placement of smoke detectors, therefore, is key so you are always alerted to the presence of smoke.\nNumber of smoke detectors.\nAt the very least, you will want to use at least one smoke detector for each bedroom. The ideally protected house is one that also has a detector in the living room, and any other living area. Also place detectors in hallways that connect each bedroom to each other. You can place detectors near, but not in kitchens. Each level of the home should be protected with smoke detectors.\nHeight\nPlace smoke detectors either on the ceiling facing downward at the floor or high on the wall facing the inside of the room. Whichever type of placement you choose, make sure to not place a detector in a corner, smoke tends not to collect in these so-called “dead corners”. If you choose the wall placement, make sure to leave at least 4 to 6 inches clearance between the detector and the ceiling, but do not place them any lower than that.\nPlacement\nNever install a smoke detector near a venting duct used by a central heat system. Vents can blow smoke away from the detector, inhibiting its ability to detect the smoke. To save yourself trouble in the long run, spend some time choosing a location for the smoke detector that meets all safety requirements discussed above but that is also easily accessible for maintenance and battery replacement. Change batteries at least once a year.\nFire Safety\nAccording to Ready.gov, a fire can go from a hazard to life-threatening in a matter of minutes. If a fire starts while you’re asleep, you need to get out fast! A full quarter of home fire deaths are caused by fires that started in the bedroom, according to the National Fire Protection Association.\nPractice fire drills.\nDespite there being over a million residential fires each year, only a third of American households have a fire escape plan. Schedule a twice-yearly fire drill, and make one of those at night. This way you and your family are truly prepared. With a fire, every second counts, so practice your escape plan quickly. In case smoke makes it dark, practice with your eyes closed or a bandana over your head to see if you can feel your way out. If a fire starts outside your bedroom, practice crawling low to the ground toward the door. Practice touching the door knob before opening it. If it’s hot to touch, go to your other route and practice unrolling your safety escape ladders. Confirm that you can easily open your bedroom window. Practice the stop, drop, and roll in case you catch on fire.\nRegularly maintain smoke detectors.\nSmoke alarms reduce your risk of dying by fire by half. Choose smoke alarms with sealed-in 10-year lithium battery. If your house is currently using hard-wire smoke alarms, replace them with battery-powered models or install battery-powered models as backups. Each month, test the alarm and clear it of dust. Every year, replace the batteries. Every 10 years, replace the smoke alarm unit. Get a separate carbon monoxide alarm and place one outside your bedroom so you’ll wake up if it starts to beep.\nRemove obvious fire hazards.\nDo not light candles in your bedroom. Avoid using space heaters in the bedroom. Never smoke in your bedroom. If you have a rug in your bedroom, avoid running electrical cords under it. Regularly check that all of the electronics in your bedroom are not showing frays or damage to the wires, and if so, replace them immediately. If you live in an older home, hire a professional to come take a look at your wiring and replace anything that’s old.\nCarbon Monoxide – Understanding the Risk\nWhat is carbon monoxide?\nCarbon monoxide is an odorless, colorless and toxic gas. Because it is impossible to see, taste or smell the toxic fumes, CO can kill you before you are aware it is in your home. At lower levels of exposure, CO causes mild effects that are often mistaken for the flu. These symptoms include headaches, dizziness, disorientation, nausea and fatigue. The effects of CO exposure can vary greatly from person to person depending on age, overall health and the concentration and length of exposure.\nWhere does carbon monoxide come from?\nCO gas can come from several sources: gas-fired appliances, charcoal grills, wood-burning furnaces or fireplaces and motor vehicles.\nWho is at risk?\nEveryone is at risk for CO poisoning. Medical experts believe that unborn babies, infants, children, senior citizens and people with heart or lung problems are at even greater risk for CO poisoning. Protect yourself and your family from CO poisoning by installing at least one carbon monoxide alarm with an audible warning signal near the sleeping areas and outside individual bedrooms. Carbon monoxide alarms measure levels of CO over time and are designed to sound an alarm before an average, healthy adult would experience symptoms. It is very possible that you may not be experiencing symptoms when you hear the alarm. This does not mean that CO is not present. Have a qualified professional check all fuel burning appliances, furnaces, venting and chimney systems at least once a year. Never use your range or oven to help heat your home and never use a charcoal grill or hibachi in your home or garage. Never keep a car running in a garage. Even if the garage doors are open, normal circulation will not provide enough fresh air to reliably prevent a dangerous buildup of CO. When purchasing an existing home, have a qualified technician evaluate the integrity of the heating and cooking systems, as well as the sealed spaces between the garage and house. The presence of a carbon monoxide alarm in your home can save your life in the event of CO buildup. If your carbon monoxide alarm activates call 9-1-1.\nAre you prepared for a Natural Disaster?\nThe Bradford County Fire Rescue department is committed to educating residents by providing public awareness of what to do in case of a natural disaster.\n“Shelter in Place”\nIn the event of a hazardous materials release the fire or police department may ask residents to “shelter in place” or stay indoors until the release can be contained. To shelter in place means to stay in hour home, close all windows and doors, bring your pets in, and turn off your heating and air conditioning. Stay indoors, and monitor television and radio announcements for further instructions. Shelter in place is preferable to evacuation when it is not feasible to move a large amount of people in a short period of time, or to expose them to a hazardous material. Do not hesitate to call 9-1-1 if there is an emergency during the shelter in place order.\nEvacuation\nAn evacuation order may be authorized by public safety personnel. An evacuation order will be given in the event residents need to leave their homes quickly, but in a calm and orderly fashion. A shelter location such as a church, school, or other property will be detailed in the evacuation order. You can also seek shelter at a family or friends home that is far away from the emergency incident. If an evacuation order is given please take only essential items or your family disaster care kit with you, lock your home, and leave immediately. If you do not have transportation, emergency responders can arrange transportation. Know two ways out of your residential area in case one is blocked. Monitor television and radio for further information on the length of the evacuation order.\nFamily Disaster Supply Kit (for at least 72 hours)\nIf you cannot leave your home, or need to evacuate immediately and cannot return for several days you need to have a disaster kit readily available with essential items. Here is what you need:\none gallon of water per person per day for three days\ncanned meat/fruit/vegetables\nbattery operated radio and extra batteries\npaper cups/plates/utensils\nflashlight and extra batteries\ncash or traveler checks\nnon-electric can opener\ntoiletries\nsoap and liquid detergent\npersonal hygiene items\nrain gear\nshoes or work boots\nblankets or sleeping bags\nbaby items\nprescription medicines\na first aid kit\nContact Information\nHeadquarters\nBradford County Fire Rescue\n945-C North Temple Avenue\nStarke, Florida 32091\n(904) 966-6911\nAdministrative Officers\nBen Carter, Chief\nOffice: 904-966-6906\n[email protected]\nDylan Rodgers, Division Chief\nOffice: 904-966-6903\n[email protected]\nChris Cooksey, Fire Marshal\nOffice: 904-966-6202\n[email protected]\nJeremy Loomis, Training Captain\n[email protected]\nDr. Matthew Odom Medical Director\n904-966-6911\nLike us on Facebook\nBradford County Fire Rescue Facebook",
      "emails": []
    },
    {
      "url": "https://bradfordcountyfl.gov/building-zoning/fire-prevention/",
      "is_candidate": false,
      "has_email": false,
      "text": "Fire Prevention\nYour Commissioners\nYour Government\nCounty Departments\nBusiness & Development\nI Want To\nBradford County FL. Building Zoning, & Fire Prevention located at the Court House:\nPhysical Address: 945 N. Temple Ave, Starke FL 32091\nMailing Address: P.O. Box B Starke FL 32091\nM-TH 8AM-4:30PM, 12-12:30PM CLOSED FOR LUNCH\nFRI 8AM-1:30PM NOT CLOSED FOR LUNCH\nClosed: December 24th & 25th\n2025: January 1st, 20th, April 18th, May 26th, June 19th, July 4th, September 1st, November 11th,27th & 28th, December 24th, 25th, 26th.\nFire Prevention\nThe Bradford County Fire Prevention Office is at 945 N. Temple Ave Starke Fl. Inside the Building & Zoning Dept.  Fire Prevention is customer orientated, devoted to reducing the losses due to fire, explosions and dangerous conditions. To achieve this goal the Fire Prevention Office is active in public education, plan review, annual inspections, community planning and community risk reduction.\nFL Fire Prevention Code is the 8th edition.\nFire Prevention Codes/Standards:\nThe Fire Prevention Department enforces the\nFla. Fire Prevention Code\nAll NFPA codes and standards can be viewed at the\nState Fire Marshal’s\nwebsite. This site will also help you with information to keep you and your family safe.\nRemember you can submit applications online, in person or by mail. If you need an annual inspection you must call 904-966-6223 Ex 2 to schedule and pay.\nFire Prevention & Inspections\nFire Applications & Change of Occupancy\nSite/Plan Review/Inspections\nSmoke Alarms & Fire Safety Tips\nISO Ratings\nContact Information\nBuilding Zoning & Fire Prevention\n945- F N. Temple Ave\nStarke Fl. 32091\n[email protected]\n904-966-6202 or 904-966-6223 Ex 2\nFire Prevention\nYour Commissioners\nYour Government\nCounty Departments\nBusiness & Development\nI Want To\nBradford County FL. Building Zoning, & Fire Prevention located at the Court House:\nPhysical Address: 945 N. Temple Ave, Starke FL 32091\nMailing Address: P.O. Box B Starke FL 32091\nM-TH 8AM-4:30PM, 12-12:30PM CLOSED FOR LUNCH\nFRI 8AM-1:30PM NOT CLOSED FOR LUNCH\nClosed: December 24th & 25th\n2025: January 1st, 20th, April 18th, May 26th, June 19th, July 4th, September 1st, November 11th,27th & 28th, December 24th, 25th, 26th.\nFire Prevention\nThe Bradford County Fire Prevention Office is at 945 N. Temple Ave Starke Fl. Inside the Building & Zoning Dept.  Fire Prevention is customer orientated, devoted to reducing the losses due to fire, explosions and dangerous conditions. To achieve this goal the Fire Prevention Office is active in public education, plan review, annual inspections, community planning and community risk reduction.\nFL Fire Prevention Code is the 8th edition.\nFire Prevention Codes/Standards:\nThe Fire Prevention Department enforces the\nFla. Fire Prevention Code\nAll NFPA codes and standards can be viewed at the\nState Fire Marshal’s\nwebsite. This site will also help you with information to keep you and your family safe.\nRemember you can submit applications online, in person or by mail. If you need an annual inspection you must call 904-966-6223 Ex 2 to schedule and pay.\nFire Prevention & Inspections\nFire Applications & Change of Occupancy\nSite/Plan Review/Inspections\nSmoke Alarms & Fire Safety Tips\nISO Ratings\nContact Information\nBuilding Zoning & Fire Prevention\n945- F N. Temple Ave\nStarke Fl. 32091\n[email protected]\n904-966-6202 or 904-966-6223 Ex 2",
      "emails": []
    }
  ],
  "all_links": [
    "https://bradfordcountyfl.gov/contact-us/",
    "https://bradfordcountyfl.gov/events/today/",
    "https://bradfordcountyfl.gov/government/district-3-christopher-dougherty/",
    "https://bradfordcountyfl.gov/fire-rescue/",
    "https://bradfordcountyfl.gov/senior-center/",
    "https://bradfordcountyfl.gov/government/district-4-danny-riddick/",
    "https://bradfordcountyfl.gov/county-commisisoners/",
    "https://bradfordcountyfl.gov/government/health-facilities-authority/",
    "https://bradfordcountyfl.gov/public-works/",
    "https://bradfordcountyfl.gov/public-works/maintenance/",
    "https://bradfordcountyfl.gov/nefedc/",
    "https://bradfordcountyfl.gov/building-zoning/",
    "https://bradfordcountyfl.gov/community-development/",
    "https://bradfordcountyfl.gov/information-technology/",
    "https://bradfordcountyfl.gov/gis/",
    "https://bradfordcountyfl.gov/apply-for-a-job/",
    "https://bradfordcountyfl.gov/parks-recreation-department/",
    "https://bradfordcountyfl.gov/county-manager/",
    "https://bradfordcountyfl.gov/clerk-to-the-board/",
    "https://bradfordcountyfl.gov/veterans-affairs/",
    "https://bradfordcountyfl.gov/zoning",
    "http://www.bradfordcountyfl.gov/cdn-cgi/l/email-protection#cc9fafa3b8b89387a3bea2a9abadb58c8ebeada8aaa3bea88fa3b9a2b8b58aa0e2aba3ba",
    "https://bradfordcountyfl.gov/government/county-budgets-reports/",
    "https://bradfordcountyfl.gov/public-works/solid-waste-services/",
    "https://bradfordcountyfl.gov/our-mission-vision-and-values/",
    "https://bradfordcountyfl.gov/building-zoning/fire-prevention/smoke-alarms-fire-safety-tips/",
    "https://bradfordcountyfl.gov/event/daily-schedule-27/",
    "https://bradfordcountyfl.gov/event/daily-work-schedule-march-5-2025/",
    "https://bradfordcountyfl.gov/public-notices/",
    "https://bradfordcountyfl.gov/public-works/mosquito-control/",
    "http://www.bradfordcountyfl.gov/cdn-cgi/l/email-protection#762515190202293d1904181311170f36340417121019041235190318020f301a58111900b4d6",
    "https://bradfordcountyfl.gov/fire-rescue/ambulance-billing",
    "http://www.bradfordcountyfl.gov/cdn-cgi/l/email-protection#5d0e3e3229290216322f33383a3c241d1f2f3c393b322f391e32283329241b31733a322b9ffd",
    "https://bradfordcountyfl.gov/fire-rescue/fire-prevention-safety/",
    "https://bradfordcountyfl.gov/bid-advertisements/",
    "https://bradfordcountyfl.gov/",
    "https://bradfordcountyfl.gov/meetings-agendas/",
    "http://www.bradfordcountyfl.gov/cdn-cgi/l/email-protection#2f7c4c405b5b7064405d414a484e566f6d5d4e4b49405d4b6c405a415b56694301484059ed8f",
    "https://bradfordcountyfl.gov/government/district-5-diane-andrews/",
    "https://bradfordcountyfl.gov/events/list/",
    "https://bradfordcountyfl.gov/government/district-2-kenny-thompson/",
    "https://bradfordcountyfl.gov/events/month/",
    "http://www.bradfordcountyfl.gov/cdn-cgi/l/email-protection#c497a7abb0b09b8fabb6aaa1a3a5bd8486b6a5a0a2abb6a087abb1aab0bd82a8eaa3abb20664",
    "https://bradfordcountyfl.gov/building-zoning/fire-prevention/",
    "https://bradfordcountyfl.gov/events/list/?eventDisplay=past",
    "https://bradfordcountyfl.gov/public-works/transport-infrastructure/",
    "https://bradfordcountyfl.gov/government/district-1-carolyn-spooner/",
    "https://bradfordcountyfl.gov/government/county-attorney/",
    "https://bradfordcountyfl.gov"
  ],
  "candidate_links": [
    "https://bradfordcountyfl.gov/contact-us/",
    "https://bradfordcountyfl.gov/fire-rescue/",
    "https://bradfordcountyfl.gov/county-commisisoners/",
    "https://bradfordcountyfl.gov/public-works/",
    "https://bradfordcountyfl.gov/clerk-to-the-board/",
    "https://bradfordcountyfl.gov/fire-rescue/fire-prevention-safety/",
    "https://bradfordcountyfl.gov/building-zoning/fire-prevention/"
  ],
  "visited": [
    "http://www.bradfordcountyfl.gov/parks",
    "http://www.bradfordcountyfl.gov/about",
    "http://www.bradfordcountyfl.gov/contact",
    "http://www.bradfordcountyfl.gov/staff",
    "http://www.bradfordcountyfl.gov/team",
    "http://www.bradfordcountyfl.gov/board",
    "http://www.bradfordcountyfl.gov/directory",
    "http://www.bradfordcountyfl.gov/events",
    "http://www.bradfordcountyfl.gov/sitemap.xml",
    "http://www.bradfordcountyfl.gov/council",
    "http://www.bradfordcountyfl.gov/leadership",
    "http://www.bradfordcountyfl.gov/management",
    "http://www.bradfordcountyfl.gov/producers",
    "http://www.bradfordcountyfl.gov/support",
    "http://www.bradfordcountyfl.gov/crew",
    "http://www.bradfordcountyfl.gov/members",
    "http://www.bradfordcountyfl.gov/bios",
    "http://www.bradfordcountyfl.gov/people",
    "http://www.bradfordcountyfl.gov/artists",
    "http://www.bradfordcountyfl.gov/musicians",
    "http://www.bradfordcountyfl.gov/faculty",
    "http://www.bradfordcountyfl.gov/administration",
    "https://bradfordcountyfl.gov/contact-us/",
    "https://bradfordcountyfl.gov/fire-rescue/",
    "https://bradfordcountyfl.gov/county-commisisoners/",
    "https://bradfordcountyfl.gov/public-works/",
    "https://bradfordcountyfl.gov/clerk-to-the-board/",
    "https://bradfordcountyfl.gov/fire-rescue/fire-prevention-safety/",
    "https://bradfordcountyfl.gov/building-zoning/fire-prevention/"
  ],
  "base_url": "http://www.bradfordcountyfl.gov/parks"
}