{
  "pages": [
    {
      "url": "https://brimstonewoodfiregrill.com/groups-events/",
      "is_candidate": false,
      "has_email": false,
      "text": "Private Events\nLet Us Host Your Private Event in Pembroke Pines\nWe can’t wait to host your next private event or corporate get-together. We know you’ll love working with our expert planners and award-winning chefs to create a signature meal that will amaze your best friends, family and colleagues. With our incredibly diverse offerings crafted in our from-scratch kitchen, we will help you curate an unforgettable shindig that will make you the envy of the party (aren’t you always?).\nVIEW OUR EVENTS MENU\nSUBMIT EVENT REQUEST\n3D Tour of our Pembroke Pines Event Space\nPembroke Pines\nVenue\nTucked in the heart of Pembroke Pines, Brimstone Woodfire Grill is the perfect spot for any occasion. Our restaurant blends rustic charm with modern elegance to create a cozy, welcoming vibe. Whether you’re planning a romantic dinner, a family get-together, or a big celebration, we’ve got you covered. Our private dining rooms in Pembroke Pines offer flexible spaces, a charming outdoor patio, and a lively bar area, all centered around our signature woodfire grill. The mouthwatering aroma of grilled dishes and the warm glow of the fire set the perfect mood for your event. At Brimstone Woodfire Grill, we’re all about creating unforgettable moments with outstanding service, delicious food, and a setting that feels just right.\nVIEW OUR EVENTS MENU\nCorporate Event Venue\nin Pembroke Pines\nBrimstone Woodfire Grill is a top choice for corporate events in Pembroke Pines, offering a perfect mix of sophisticated ambiance and exceptional dining. Whether you’re hosting a business meeting or a large corporate gathering, our private dining rooms and comfortable outdoor patio provide a professional yet welcoming setting. The rustic elegance of our decor, paired with the warmth of our woodfire grill, sets the ideal tone for any corporate event. With a menu full of gourmet dishes and a dedicated team to handle every detail, Brimstone Woodfire Grill ensures your corporate event in Pembroke Pines is both impressive and unforgettable.\nSUBMIT EVENT REQUEST\nPembroke Pines\nBanquet Hall\nBrimstone Woodfire Grill offers an exceptional banquet hall experience in Pembroke Pines, combining elegance with a warm, inviting atmosphere. With a spacious banquet hall, private dining rooms, and a charming outdoor patio, we’re perfect for gatherings of any size. Our woodfire-grilled cuisine, paired with a curated selection of wines and cocktails, ensures a memorable dining experience. With impeccable service and attention to detail, Brimstone Woodfire Grill is Pembroke Pines’ top choice for stylish celebrations.\nVIEW OUR EVENTS MENU\nPembroke Pines Private Event Space\nCelebrate your next private event in Pembroke Pines at Brimstone Woodfire Grill, where elegance meets comfort. Our versatile spaces, including rustic interiors and a cozy outdoor patio, are perfect for gatherings of any size, from family reunions to milestone birthdays. With delicious cuisine, a welcoming atmosphere, and attentive service, we’ll make your event unforgettable. Choose Brimstone Woodfire Grill for a celebration to remember.\nVIEW OUR EVENTS MENU\nSUBMIT EVENT REQUEST\nTestimonials\n“We recently held our Thanksgiving lunch at Brimstone, and it was an incredible experience. The staff was welcoming, attentive, and ensured that all of our needs were met. The food and drinks were fantastic, and our group had plenty of options to accommodate dietary restrictions. Highly recommend!”\n“I had my baby shower at Brimstone and couldn’t be happier. The team made the planning process easy and stress-free, and on the day of the event, the staff was incredibly attentive. Many guests commented on how great both the food and service were—so grateful for a wonderful experience!”\n“Brimstone is our go-to restaurant for special occasions. The atmosphere, food, and service never disappoint. It’s the perfect place to celebrate, whether it’s a casual night out or a special event!”\nLocated Inside Shops at Pembroke Gardens\n14575 SW 5th Street\nPembroke Pines, FL 33027\nPhone\n954.430.2333\nEvent Inquiries\nSubmit Here\nPrivacy Policy\nOpt-Out Preferences",
      "emails": []
    },
    {
      "url": "https://brimstonewoodfiregrill.com/events/",
      "is_candidate": false,
      "has_email": false,
      "text": "Located Inside Shops at Pembroke Gardens\n14575 SW 5th Street\nPembroke Pines, FL 33027\nPhone\n954.430.2333\nEvent Inquiries\nSubmit Here\nPrivacy Policy\nOpt-Out Preferences",
      "emails": []
    }
  ],
  "all_links": [
    "https://brimstonewoodfiregrill.com/groups-events/",
    "https://brimstonewoodfiregrill.com/",
    "https://brimstonewoodfiregrill.com/events/",
    "http://www.brimstonewoodfiregrill.com/",
    "https://brimstonewoodfiregrill.com/brunch-pembroke-pines/",
    "https://brimstonewoodfiregrill.com/ourstory/",
    "https://brimstonewoodfiregrill.com/dining-in-pembroke-pines/",
    "https://brimstonewoodfiregrill.com/blog/",
    "https://brimstonewoodfiregrill.com/?page_id=48",
    "https://brimstonewoodfiregrill.com/happy-hour-pembroke-pines/",
    "https://brimstonewoodfiregrill.com/breast-cancer-awareness-month-oct-2024/",
    "https://brimstonewoodfiregrill.com/?page_id=50",
    "https://brimstonewoodfiregrill.com/?page_id=49",
    "https://brimstonewoodfiregrill.com/gallery",
    "https://brimstonewoodfiregrill.com/opt-out-preferences/",
    "https://brimstonewoodfiregrill.com/privacy-policy/"
  ],
  "candidate_links": [
    "https://brimstonewoodfiregrill.com/groups-events/",
    "https://brimstonewoodfiregrill.com/events/"
  ],
  "visited": [
    "http://www.brimstonewoodfiregrill.com/",
    "http://www.brimstonewoodfiregrill.com/about",
    "http://www.brimstonewoodfiregrill.com/contact",
    "http://www.brimstonewoodfiregrill.com/staff",
    "http://www.brimstonewoodfiregrill.com/team",
    "http://www.brimstonewoodfiregrill.com/board",
    "http://www.brimstonewoodfiregrill.com/directory",
    "http://www.brimstonewoodfiregrill.com/events",
    "http://www.brimstonewoodfiregrill.com/sitemap.xml",
    "http://www.brimstonewoodfiregrill.com/council",
    "http://www.brimstonewoodfiregrill.com/leadership",
    "http://www.brimstonewoodfiregrill.com/management",
    "http://www.brimstonewoodfiregrill.com/producers",
    "http://www.brimstonewoodfiregrill.com/support",
    "http://www.brimstonewoodfiregrill.com/crew",
    "http://www.brimstonewoodfiregrill.com/members",
    "http://www.brimstonewoodfiregrill.com/bios",
    "http://www.brimstonewoodfiregrill.com/people",
    "http://www.brimstonewoodfiregrill.com/artists",
    "http://www.brimstonewoodfiregrill.com/musicians",
    "http://www.brimstonewoodfiregrill.com/faculty",
    "http://www.brimstonewoodfiregrill.com/administration",
    "https://brimstonewoodfiregrill.com/groups-events/",
    "https://brimstonewoodfiregrill.com/events/"
  ],
  "base_url": "http://www.brimstonewoodfiregrill.com/"
}