{
  "pages": [
    {
      "url": "https://www.campgordonjohnston.com/visit/about-the-museum/",
      "is_candidate": false,
      "has_email": true,
      "text": "Home\nVisit\nPlan a Visit\nAbout the Museum\nCamp Gordon Johnston Day-Veterans Parade & Dice Run\nSpecial Exhibits & Events\nLearn\nHistory of Camp Gordon Johnston\nExhibits\nOutreach: Educators & Students, Presentations and Tours\nThe Amphibian Newsletter\nHonor\nUnit Histories\nTribute to the Veterans\nMotor Pool\nGive\nGiving Options\nBecome a Member\nDonate an Artifact\nCapital Expansion\nContact\nYou are here:\nHome\n/\nVisit\n/\nAbout the Museum\nAbout the Museum\nThe Mission of the Camp Gordon Johnston WWII Museum is to honor and preserve the heritage of the men who trained at Camp Gordon Johnston in Carrabelle during WWII. We share the real stories of the dedication, fears and heroism of the quarter of a million men who served and trained at Camp Gordon Johnston at our museum The museum promotes not only the history of WWII, but also portrays the gigantic effort that our nation poured into this conflict.\nThe Museum has compiled an extensive history of the various units that trained here, as well as a photographic display of the area and life as it existed at the camp. Furthermore, the Camp Gordon Johnston veterans have contributed the artifacts brought back from battles overseas, along with uniforms, mess kits, and all sorts of souvenirs, too numerous to name.\nSee the HONOR tab on this website for unit and personnel histories.\nThe Camp Gordon Johnston Museum has been nationally honored by the Smithsonian Magazine for three straight years. Admission is free and all visitors are welcome. For group tours or individual visits outside of normal hours, call the Museum at (850) 697-8575 for additional arrangements. Tours are welcome and WWII veterans will be given special consideration. A wheelchair is available.\nThe Camp Gordon Johnston Association also participates in parades and educational historic events and welcomes field trips from schools, clubs and other organizations. To request for our participation in an events\nplease contact us.\nOur Roots\nEarly in 1995 a group of North Florida people began speculating on the possibility of forming a Camp Gordon Johnston Association and holding reunions of men and women who served there. It was soon discovered that a whole lot of people were electrified by the idea, and we began holding regular meetings in Lanark Village or Carrabelle. The result was a smashing first reunion March 1-3, 1996. The reunions were great fun and well attended. The men and women who served came to Camp Gordon Johnston from every state in the Union during World War II and came from every state for the reunions too. From this grew the desire and need for an actual museum.\nThe museum also preserves an oral history, preserving the experiences of our veterans. Many of these stories are told in our publication, the Amphibian, official newspaper of the Camp Gordon Johnston Museum. To access our latest issue\nclick here\n.\nCamp Gordon Johnston Museum wins\na 2021 Florida Preservation Award\nCamp Gordon Johnston WWII Museum was recognized by the Florida Trust for Historic Preservation with a 2021 Florida Preservation Award. These Florida Preservation Awards recognize people, organizations and communities who have worked to protect Florida’s extraordinary history and heritage.\nThe Florida Preservation Award nominations “are made by the public with award recipients selected by a five-member jury from around the state representing a variety of backgrounds and experience” according to the press release from the Florida Trust for Historic Preservation.\nCamp Gordon Johnston Museum was awarded Noteworthy Achievement in the category of Preservation Education/Media. The mission of the Camp Gordon Johnston WWII Museum is to honor and preserve the heritage of the men and women who trained at Camp Gordon Johnston. As part of its museum development efforts, the Camp Gordon Johnston Association successfully obtained funding to research, design, produce and install exhibits featuring ten interior panels, a retractable banner display unit, 3,000 new informational brochures and the fabrication and installation of six outdoor interpretive signs, display structures, graphic panels and design standards manuals. Both the indoor and outdoor panels have furthered the educational component of the Camp Gordon Johnston Museum with new research and interpretation presented in a professionally designed format. These educational efforts are especially important as there are increasingly fewer WWII veterans attending Camp Gordon Johnston events.\nFor more information, contact the Camp Gordon Johnston Museum at (850) 697-8575 or museum@campgordonjohnston.com or go to https://www.floridatrust.org/2021-florida-preservation-awards. Camp Gordon Johnston WWII Museum is located in Carrabelle, directly across from Carrabelle Public Beach Park at 1873 Hwy 98 West. Funded in part by the Franklin County Tourist Development Council.\nReturn to HOME\nAbout the Museum\nThe Mission of the Camp Gordon Johnston WWII Museum is to honor and preserve the heritage of the men who trained at Camp Gordon Johnston in Carrabelle during WWII. We share the real stories of the dedication, fears and heroism of the quarter of a million men who served and trained at Camp Gordon Johnston at our museum The museum promotes not only the history of WWII, but also portrays the gigantic effort that our nation poured into this conflict.\nThe Museum has compiled an extensive history of the various units that trained here, as well as a photographic display of the area and life as it existed at the camp. Furthermore, the Camp Gordon Johnston veterans have contributed the artifacts brought back from battles overseas, along with uniforms, mess kits, and all sorts of souvenirs, too numerous to name.\nSee the HONOR tab on this website for unit and personnel histories.\nThe Camp Gordon Johnston Museum has been nationally honored by the Smithsonian Magazine for three straight years. Admission is free and all visitors are welcome. For group tours or individual visits outside of normal hours, call the Museum at (850) 697-8575 for additional arrangements. Tours are welcome and WWII veterans will be given special consideration. A wheelchair is available.\nThe Camp Gordon Johnston Association also participates in parades and educational historic events and welcomes field trips from schools, clubs and other organizations. To request for our participation in an events\nplease contact us.\nOur Roots\nEarly in 1995 a group of North Florida people began speculating on the possibility of forming a Camp Gordon Johnston Association and holding reunions of men and women who served there. It was soon discovered that a whole lot of people were electrified by the idea, and we began holding regular meetings in Lanark Village or Carrabelle. The result was a smashing first reunion March 1-3, 1996. The reunions were great fun and well attended. The men and women who served came to Camp Gordon Johnston from every state in the Union during World War II and came from every state for the reunions too. From this grew the desire and need for an actual museum.\nThe museum also preserves an oral history, preserving the experiences of our veterans. Many of these stories are told in our publication, the Amphibian, official newspaper of the Camp Gordon Johnston Museum. To access our latest issue\nclick here\n.\nCamp Gordon Johnston Museum wins\na 2021 Florida Preservation Award\nCamp Gordon Johnston WWII Museum was recognized by the Florida Trust for Historic Preservation with a 2021 Florida Preservation Award. These Florida Preservation Awards recognize people, organizations and communities who have worked to protect Florida’s extraordinary history and heritage.\nThe Florida Preservation Award nominations “are made by the public with award recipients selected by a five-member jury from around the state representing a variety of backgrounds and experience” according to the press release from the Florida Trust for Historic Preservation.\nCamp Gordon Johnston Museum was awarded Noteworthy Achievement in the category of Preservation Education/Media. The mission of the Camp Gordon Johnston WWII Museum is to honor and preserve the heritage of the men and women who trained at Camp Gordon Johnston. As part of its museum development efforts, the Camp Gordon Johnston Association successfully obtained funding to research, design, produce and install exhibits featuring ten interior panels, a retractable banner display unit, 3,000 new informational brochures and the fabrication and installation of six outdoor interpretive signs, display structures, graphic panels and design standards manuals. Both the indoor and outdoor panels have furthered the educational component of the Camp Gordon Johnston Museum with new research and interpretation presented in a professionally designed format. These educational efforts are especially important as there are increasingly fewer WWII veterans attending Camp Gordon Johnston events.\nFor more information, contact the Camp Gordon Johnston Museum at (850) 697-8575 or museum@campgordonjohnston.com or go to https://www.floridatrust.org/2021-florida-preservation-awards. Camp Gordon Johnston WWII Museum is located in Carrabelle, directly across from Carrabelle Public Beach Park at 1873 Hwy 98 West. Funded in part by the Franklin County Tourist Development Council.\nReturn to HOME\nVisit Us\nTuesday - Saturday 11:00 a.m. to 5:00 p.m.\nClosed Sunday and Monday\nThe museum is located at across the street from Carrabelle Beach.\n1873 Highway 98 West\nCarrabelle, FL 32322\nGet the Newsletter\nFirst Name\nLast Name\nEmail address:\nLeave this field empty if you're human:\nP.O. Box 1334\nCarrabelle, Florida 32322\n(850) 697-8575\nmuseum@campgordonjohnston.com\nVisit\nPlan a Visit\nCamp Gordon Johnston Day-Veterans Parade & Dice Run\nAbout\nLearn\nOutreach: Educators & Students, Presentations and Tours\nThe Amphibian\nExhibits\nHistory\nHonor\nUnit Histories\nTribute to the Veterans\nGive\nBecome a Member\nCapital Expansion\nDonate an Artifact\nGiving Options",
      "emails": [
        "museum@campgordonjohnston.com"
      ]
    },
    {
      "url": "https://www.campgordonjohnston.com/visit/special-events/",
      "is_candidate": false,
      "has_email": true,
      "text": "Home\nVisit\nPlan a Visit\nAbout the Museum\nCamp Gordon Johnston Day-Veterans Parade & Dice Run\nSpecial Exhibits & Events\nLearn\nHistory of Camp Gordon Johnston\nExhibits\nOutreach: Educators & Students, Presentations and Tours\nThe Amphibian Newsletter\nHonor\nUnit Histories\nTribute to the Veterans\nMotor Pool\nGive\nGiving Options\nBecome a Member\nDonate an Artifact\nCapital Expansion\nContact\nYou are here:\nHome\n/\nVisit\n/\nSpecial Exhibits & Events\nSpecial Exhibits & Events\nSpecial Exhibit for Sept. 2-Oct. 4:\nPhilippines Campaign\nInvasion of Leyte, Philippines, 20 Oct 1944. Hell Breaks Loose Overhead as Philippines Liberators Strike. US Coast Guard-manned landings barges sweep toward the beaches of Leyte Island at H-Hour as American and Japanese planes dual to death overhead.\nCamp Gordon Johnston WWII Museum in Carrabelle is presenting a special exhibit on the Philippines campaign. This exhibit will open on Tuesday, September 2 and be on display until Saturday, October 4. The museum is open every Tuesday through Saturday from 11 am to 5 pm ET. There is no charge for admission, but donations are gladly accepted.\nVisitors are invited to learn about the Japanese assault on the Philippines including the Bataan Death March, a brutal forced march of Allied prisoners of war through tropical heat, humidity, and rain. Thousands died along the way due to being starved and beaten and being denied medical care.\nA squad leader points out a suspected Japanese position at the edge of Balete Pass, near Baguio, where troops of the 25th Infantry Division are in fierce combat with Japanese forces. 23 March 1945.\nThe exhibit also explores the long campaign to liberate the islands, starting with the U. S. landing at Leyte on October 20, 1944. In an effort to hold Leyte at all costs, Japan sent five naval forces to challenge the American fleet, leading to the largest and most complex naval battle of World War II, the massive Leyte Gulf Naval Campaign.\nThe 38th Infantry Division, which trained at Camp Gordon Johnston, earned the nickname “Avengers of Bataan”. This division played a critical role in this campaign. In December 1944, they landed at Leyte under enemy fire with the battle still raging. In the spring of 1945, they fought a tough campaign at Zig Zag Pass in Luzon. After intense combat, the division had cleared Bataan and accepted the formal surrender of two of the most powerful Japanese army groups in the Philippines. General Douglas MacArthur is said to have personally honored them with the title “Avengers of Bataan” for their victory.\nFunded in part by the Franklin County Tourist Development Council.\nSaturday, September 20:\nMuseum Day\nALL THREE CARRABELLE MUSEUMS JOIN\nTOGETHER FOR MUSEUM DAY\nCarrabelle’s three museums will open their doors\nfree of charge on Saturday, September 20 as part of the annual Museum Day celebration\n. In honor of this day, Camp Gordon Johnston WWII Museum, Carrabelle History Museum, and Crooked River Lighthouse Museum invite you to Carrabelle FL for special activities and exhibits.\nCamp Gordon Johnston Museum will be open from 11 am – 5 pm.\nCarrabelle History Museum will be open from 10 am – 5 pm. Crooked River Lighthouse will be open from 9 am – 5 pm. Guests can also enjoy the Country Farmer’s Market from 9 am-1 pm at Crooked River Lighthouse Park with local crafts, baked goods and area produce.\nEach year, Museum Day goes beyond getting visitors through museum doors; it shines a spotlight on incredible culture and history exhibits.\nThis year’s theme, “Signals & Stories: Communication Across Time\n” will explore flashing beacons, radio calls, whispered tales and the signals that shaped our community and beyond. Each of Carrabelle’s museums will commemorate the theme with their own focus.\nCamp Gordon Johnston Museum will feature wartime communication through radio signals, codes, and stories of those who trained at the camp.\nCrooked River Lighthouse will highlight maritime signals like daymarks, semaphore flags and light signals. The Carrabelle History Museum will focus on storytelling through personal stories, community signals, and vintage postcards.\nGuests can take part in hands-on activities and discover how these signals reveal cultural traditions and  military valor. From lighthouse beams to military radios to family stories, the Forgotten Coast has long relied on signals to carry meaning across time. This year’s exhibits uncover how Carrabelle’s people, places, and artifacts served as beacons—communicating to residents and visitors through leadership, and legend.\nGuests can enjoy activities and discover how the Forgotten Coast has long relied on signals to carry meaning across time. These exhibits uncover how the people, places, and artifacts of our area served as beacons—sharing messages through leadership and legend. Funded in part by the Franklin County Tourist Development Council.\nINFORMATION ON THE MUSEUMS\nCamp Gordon Johnston WWII Museum\n– Honors the military men and women as well as civilian personnel who trained and worked in Carrabelle and Franklin County during 1942 through 1946. The museum houses numerous displays of military artifacts, photos and memorabilia of many types. Camp Gordon Johnston WWII Museum is located at 1873 Highway 98 West, directly across from Carrabelle Beach where military troops practiced D-Day beach assaults. Saturday hours 11 am-5 pm.\nwww.campgordonjohnston.com/\nCarrabelle History Museum\n– Features local artifacts and exhibits including Carrabelle’s Native American people, Shipwrecks of Dog Island, the Steamship “Tarpon”, the original “World’s Smallest Police Station”, Carrabelle industry and culture (seafood, lumber and more) and families from the pioneer days to the present. Carrabelle History Museum is located at 106 SE Avenue B, Carrabelle, FL. Saturday hours 10 am-5 pm.\nwww.carrabellehistorymuseum.org\nCrooked River Lighthouse\n–\nThe history and the science of the lighthouse are displayed through interesting exhibits, including a historical setting of the early 1900’s, various lighthouse beacons, the methods of constructing a skeletal tower lighthouse, plus the lighthouse’s original 1895 Fresnel lens! Also on display are the original Keeper’s House clock, a barometer, an antique glass fire grenade, and more. Crooked River Lighthouse is located at 1975 Hwy 98 West, Carrabelle. Saturday hours 9 am-5 pm.\nwww.crookedriverlighthouse.com\nPast Events\nSidney A. Winchester Building Dedication at Camp Gordon Johnston Museum\nThe Camp Gordon Johnston Association and WWII Museum was honored to dedicate our museum building on September 21, 2019  to the late\nSidney A. Winchester\n, a Carrabelle native, U. S. Army veteran and key supporter of Camp Gordon Johnston Museum. We were joined by U.S. Congressman Neal Dunn, M.D. (FL-02) who made two very special presentations during the ceremony. Congressman Dunn presented a container of sand from Utah Beach, Normandy, France to the Camp Gordon Johnston WWII Museum and then presented an American Flag that had  flown over the U.S. Capitol Building in Washington D.C. to Sidney Winchester’s wife, Bobbye, who accepted the flag on behalf of the Museum in honor of Sidney’s service both as a paratrooper with the 82nd Airborne and as a charter member and champion of the Camp Gordon Johnston Association. The sand from Utah Beach and the flag will be on display at the Museum.  Also on this day, Camp Gordon Johnston Museum celebrated Smithsonian magazine’s 15th annual Museum Day. This national celebration honors museums that follow the example of the Smithsonian with free admission.\nClick Here to see the Video\nof the Dedication Ceremony and Congressman Neal Dunn’s special presentations. Thanks to Mayor Brenda La Paz for this video!\nClick here to learn more about these events\n.\nReturn to HOME\nSpecial Exhibits & Events\nSpecial Exhibit for Sept. 2-Oct. 4:\nPhilippines Campaign\nInvasion of Leyte, Philippines, 20 Oct 1944. Hell Breaks Loose Overhead as Philippines Liberators Strike. US Coast Guard-manned landings barges sweep toward the beaches of Leyte Island at H-Hour as American and Japanese planes dual to death overhead.\nCamp Gordon Johnston WWII Museum in Carrabelle is presenting a special exhibit on the Philippines campaign. This exhibit will open on Tuesday, September 2 and be on display until Saturday, October 4. The museum is open every Tuesday through Saturday from 11 am to 5 pm ET. There is no charge for admission, but donations are gladly accepted.\nVisitors are invited to learn about the Japanese assault on the Philippines including the Bataan Death March, a brutal forced march of Allied prisoners of war through tropical heat, humidity, and rain. Thousands died along the way due to being starved and beaten and being denied medical care.\nA squad leader points out a suspected Japanese position at the edge of Balete Pass, near Baguio, where troops of the 25th Infantry Division are in fierce combat with Japanese forces. 23 March 1945.\nThe exhibit also explores the long campaign to liberate the islands, starting with the U. S. landing at Leyte on October 20, 1944. In an effort to hold Leyte at all costs, Japan sent five naval forces to challenge the American fleet, leading to the largest and most complex naval battle of World War II, the massive Leyte Gulf Naval Campaign.\nThe 38th Infantry Division, which trained at Camp Gordon Johnston, earned the nickname “Avengers of Bataan”. This division played a critical role in this campaign. In December 1944, they landed at Leyte under enemy fire with the battle still raging. In the spring of 1945, they fought a tough campaign at Zig Zag Pass in Luzon. After intense combat, the division had cleared Bataan and accepted the formal surrender of two of the most powerful Japanese army groups in the Philippines. General Douglas MacArthur is said to have personally honored them with the title “Avengers of Bataan” for their victory.\nFunded in part by the Franklin County Tourist Development Council.\nSaturday, September 20:\nMuseum Day\nALL THREE CARRABELLE MUSEUMS JOIN\nTOGETHER FOR MUSEUM DAY\nCarrabelle’s three museums will open their doors\nfree of charge on Saturday, September 20 as part of the annual Museum Day celebration\n. In honor of this day, Camp Gordon Johnston WWII Museum, Carrabelle History Museum, and Crooked River Lighthouse Museum invite you to Carrabelle FL for special activities and exhibits.\nCamp Gordon Johnston Museum will be open from 11 am – 5 pm.\nCarrabelle History Museum will be open from 10 am – 5 pm. Crooked River Lighthouse will be open from 9 am – 5 pm. Guests can also enjoy the Country Farmer’s Market from 9 am-1 pm at Crooked River Lighthouse Park with local crafts, baked goods and area produce.\nEach year, Museum Day goes beyond getting visitors through museum doors; it shines a spotlight on incredible culture and history exhibits.\nThis year’s theme, “Signals & Stories: Communication Across Time\n” will explore flashing beacons, radio calls, whispered tales and the signals that shaped our community and beyond. Each of Carrabelle’s museums will commemorate the theme with their own focus.\nCamp Gordon Johnston Museum will feature wartime communication through radio signals, codes, and stories of those who trained at the camp.\nCrooked River Lighthouse will highlight maritime signals like daymarks, semaphore flags and light signals. The Carrabelle History Museum will focus on storytelling through personal stories, community signals, and vintage postcards.\nGuests can take part in hands-on activities and discover how these signals reveal cultural traditions and  military valor. From lighthouse beams to military radios to family stories, the Forgotten Coast has long relied on signals to carry meaning across time. This year’s exhibits uncover how Carrabelle’s people, places, and artifacts served as beacons—communicating to residents and visitors through leadership, and legend.\nGuests can enjoy activities and discover how the Forgotten Coast has long relied on signals to carry meaning across time. These exhibits uncover how the people, places, and artifacts of our area served as beacons—sharing messages through leadership and legend. Funded in part by the Franklin County Tourist Development Council.\nINFORMATION ON THE MUSEUMS\nCamp Gordon Johnston WWII Museum\n– Honors the military men and women as well as civilian personnel who trained and worked in Carrabelle and Franklin County during 1942 through 1946. The museum houses numerous displays of military artifacts, photos and memorabilia of many types. Camp Gordon Johnston WWII Museum is located at 1873 Highway 98 West, directly across from Carrabelle Beach where military troops practiced D-Day beach assaults. Saturday hours 11 am-5 pm.\nwww.campgordonjohnston.com/\nCarrabelle History Museum\n– Features local artifacts and exhibits including Carrabelle’s Native American people, Shipwrecks of Dog Island, the Steamship “Tarpon”, the original “World’s Smallest Police Station”, Carrabelle industry and culture (seafood, lumber and more) and families from the pioneer days to the present. Carrabelle History Museum is located at 106 SE Avenue B, Carrabelle, FL. Saturday hours 10 am-5 pm.\nwww.carrabellehistorymuseum.org\nCrooked River Lighthouse\n–\nThe history and the science of the lighthouse are displayed through interesting exhibits, including a historical setting of the early 1900’s, various lighthouse beacons, the methods of constructing a skeletal tower lighthouse, plus the lighthouse’s original 1895 Fresnel lens! Also on display are the original Keeper’s House clock, a barometer, an antique glass fire grenade, and more. Crooked River Lighthouse is located at 1975 Hwy 98 West, Carrabelle. Saturday hours 9 am-5 pm.\nwww.crookedriverlighthouse.com\nPast Events\nSidney A. Winchester Building Dedication at Camp Gordon Johnston Museum\nThe Camp Gordon Johnston Association and WWII Museum was honored to dedicate our museum building on September 21, 2019  to the late\nSidney A. Winchester\n, a Carrabelle native, U. S. Army veteran and key supporter of Camp Gordon Johnston Museum. We were joined by U.S. Congressman Neal Dunn, M.D. (FL-02) who made two very special presentations during the ceremony. Congressman Dunn presented a container of sand from Utah Beach, Normandy, France to the Camp Gordon Johnston WWII Museum and then presented an American Flag that had  flown over the U.S. Capitol Building in Washington D.C. to Sidney Winchester’s wife, Bobbye, who accepted the flag on behalf of the Museum in honor of Sidney’s service both as a paratrooper with the 82nd Airborne and as a charter member and champion of the Camp Gordon Johnston Association. The sand from Utah Beach and the flag will be on display at the Museum.  Also on this day, Camp Gordon Johnston Museum celebrated Smithsonian magazine’s 15th annual Museum Day. This national celebration honors museums that follow the example of the Smithsonian with free admission.\nClick Here to see the Video\nof the Dedication Ceremony and Congressman Neal Dunn’s special presentations. Thanks to Mayor Brenda La Paz for this video!\nClick here to learn more about these events\n.\nReturn to HOME\nVisit Us\nTuesday - Saturday 11:00 a.m. to 5:00 p.m.\nClosed Sunday and Monday\nThe museum is located at across the street from Carrabelle Beach.\n1873 Highway 98 West\nCarrabelle, FL 32322\nGet the Newsletter\nFirst Name\nLast Name\nEmail address:\nLeave this field empty if you're human:\nP.O. Box 1334\nCarrabelle, Florida 32322\n(850) 697-8575\nmuseum@campgordonjohnston.com\nVisit\nPlan a Visit\nCamp Gordon Johnston Day-Veterans Parade & Dice Run\nAbout\nLearn\nOutreach: Educators & Students, Presentations and Tours\nThe Amphibian\nExhibits\nHistory\nHonor\nUnit Histories\nTribute to the Veterans\nGive\nBecome a Member\nCapital Expansion\nDonate an Artifact\nGiving Options",
      "emails": [
        "museum@campgordonjohnston.com"
      ]
    },
    {
      "url": "https://www.campgordonjohnston.com/contact/",
      "is_candidate": false,
      "has_email": true,
      "text": "Home\nVisit\nPlan a Visit\nAbout the Museum\nCamp Gordon Johnston Day-Veterans Parade & Dice Run\nSpecial Exhibits & Events\nLearn\nHistory of Camp Gordon Johnston\nExhibits\nOutreach: Educators & Students, Presentations and Tours\nThe Amphibian Newsletter\nHonor\nUnit Histories\nTribute to the Veterans\nMotor Pool\nGive\nGiving Options\nBecome a Member\nDonate an Artifact\nCapital Expansion\nContact\nYou are here:\nHome\n/\nContact\nContact\nMailing Address:\nP.O. Box 1334\nCarrabelle, Florida 32322\n(850) 697-8575\narchivist@campgordonjohnston.com\nInterested in donating an artifact?\nemail:\nCurator\nYou can also connect with the Museum via social media on\nFacebook\n.\nNotice: JavaScript is required for this content.\nContact\nMailing Address:\nP.O. Box 1334\nCarrabelle, Florida 32322\n(850) 697-8575\narchivist@campgordonjohnston.com\nInterested in donating an artifact?\nemail:\nCurator\nYou can also connect with the Museum via social media on\nFacebook\n.\nNotice: JavaScript is required for this content.\nVisit Us\nTuesday - Saturday 11:00 a.m. to 5:00 p.m.\nClosed Sunday and Monday\nThe museum is located at across the street from Carrabelle Beach.\n1873 Highway 98 West\nCarrabelle, FL 32322\nGet the Newsletter\nFirst Name\nLast Name\nEmail address:\nLeave this field empty if you're human:\nP.O. Box 1334\nCarrabelle, Florida 32322\n(850) 697-8575\nmuseum@campgordonjohnston.com\nVisit\nPlan a Visit\nCamp Gordon Johnston Day-Veterans Parade & Dice Run\nAbout\nLearn\nOutreach: Educators & Students, Presentations and Tours\nThe Amphibian\nExhibits\nHistory\nHonor\nUnit Histories\nTribute to the Veterans\nGive\nBecome a Member\nCapital Expansion\nDonate an Artifact\nGiving Options",
      "emails": [
        "archivist@campgordonjohnston.com",
        "curator@campgordonjohnston.com",
        "museum@campgordonjohnston.com"
      ]
    },
    {
      "url": "https://www.facebook.com/CGJ.Museum/",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    }
  ],
  "all_links": [
    "https://www.campgordonjohnston.com/learn/educators-students/",
    "https://www.campgordonjohnston.com/give/",
    "https://www.campgordonjohnston.com/honor/tribute-to-the-veterans/",
    "https://www.campgordonjohnston.com/",
    "https://www.campgordonjohnston.com/learn/exhibits/",
    "https://www.campgordonjohnston.com/visit/about-the-museum/",
    "https://www.campgordonjohnston.com/give/become-a-member/",
    "https://www.campgordonjohnston.com/visit/",
    "https://www.campgordonjohnston.com/visit/special-events/",
    "https://www.campgordonjohnston.com/give/giving-options/",
    "https://www.campgordonjohnston.com/learn/the-amphibian-newsletter/",
    "https://www.campgordonjohnston.com/contact/",
    "https://www.campgordonjohnston.com/motor-pool/",
    "https://www.campgordonjohnston.com/learn/history-of-camp-gordon-johnston/",
    "https://www.campgordonjohnston.com/give/donate-an-artifact/",
    "https://www.campgordonjohnston.com/honor/unit-histories/",
    "https://www.campgordonjohnston.com/give/capital-expansion/",
    "https://www.campgordonjohnston.com/visit/cgj-days/",
    "https://www.campgordonjohnston.com/wp-content/uploads/2021/07/IMG_0177a-compressed.jpg",
    "https://www.campgordonjohnston.com/privacy-policy/",
    "https://www.campgordonjohnston.com/visit/plan-a-visit/"
  ],
  "candidate_links": [
    "https://www.campgordonjohnston.com/visit/about-the-museum/",
    "https://www.campgordonjohnston.com/visit/special-events/",
    "https://www.campgordonjohnston.com/contact/",
    "https://www.facebook.com/CGJ.Museum/"
  ],
  "visited": [
    "https://www.campgordonjohnston.com/",
    "https://www.campgordonjohnston.com/about",
    "https://www.campgordonjohnston.com/contact",
    "https://www.campgordonjohnston.com/staff",
    "https://www.campgordonjohnston.com/team",
    "https://www.campgordonjohnston.com/board",
    "https://www.campgordonjohnston.com/directory",
    "https://www.campgordonjohnston.com/events",
    "https://www.campgordonjohnston.com/sitemap.xml",
    "https://www.campgordonjohnston.com/council",
    "https://www.campgordonjohnston.com/leadership",
    "https://www.campgordonjohnston.com/management",
    "https://www.campgordonjohnston.com/producers",
    "https://www.campgordonjohnston.com/support",
    "https://www.campgordonjohnston.com/crew",
    "https://www.campgordonjohnston.com/members",
    "https://www.campgordonjohnston.com/bios",
    "https://www.campgordonjohnston.com/people",
    "https://www.campgordonjohnston.com/artists",
    "https://www.campgordonjohnston.com/musicians",
    "https://www.campgordonjohnston.com/faculty",
    "https://www.campgordonjohnston.com/administration",
    "https://www.campgordonjohnston.com/visit/about-the-museum/",
    "https://www.campgordonjohnston.com/visit/special-events/",
    "https://www.campgordonjohnston.com/contact/",
    "https://www.facebook.com/CGJ.Museum/"
  ],
  "base_url": "https://www.campgordonjohnston.com/"
}