{
  "pages": [
    {
      "url": "https://capaacademy.com/index.php/about-us/",
      "is_candidate": false,
      "has_email": true,
      "text": "Our director\nAbout Cornella Nalls\n/.sc_title\nCornella Nalls, CapaAcademy@gmail.com, childcare provider, singer, actor, teacher.\nHi! I’m Cornella Nalls – owner and director of Creative Academy of the Performing Arts (C.A.P.A). Growing up in a Christian household, my grandmother would always take me to church. There I developed a love for the performing arts. The church we attended had a junior choir that I was a member of. The youth ministry at the church also put on short productions for events such as Easter and Christmas.\nBy the time I turned eleven years old, my mother opened her first daycare center for children. As I grew older my mother taught me how to be an effective teacher and how to run the business. During the same time, I performed in theatre productions in high school, then in college and into adulthood. As a young adult I realized very quickly that I had two passions in life. I loved teaching children and performing at the theatre. When I figured out what my passions were, my purpose in life was also birthed. I decided to open a preschool that focuses on teaching through the performing arts.\nI have worked in Early Childhood Education for nineteen years. I have a Child Development Associates with a VPK Endorsement and Directors Credential through the Department of Children and Families. I am C.P.R, First AID and A.E.D certified through the Red Cross. In the Spring of 2020, I will graduate with a degree in Early Childhood Education. I have performed in community theatre for twenty-one years and stage-managed productions for twelve years. I was trained to read music and play an instrument under the tutelage of Abe Alexander. For two years I studied theatre under the direction of Professor Julie Gagne (Chair of the Valencia Character Company). I have been in a total of seventeen productions at theatres spanning from Florida to Georgia. I still perform at community theatres locally and take classes through the Department of Children and Families. I understand that I will never get too old to work on and perfect my craft.\nWhen I am not teaching at the preschool or performing at the theatre, I enjoy being a wife and mother. My family and I love going to the beach, Matanzas Inlet, jet skiing, snorkeling, fishing and visiting other countries. Traveling is the best way for me to learn about other people and their cultures. I am a lover of documentaries, superhero series like The Flash, Super Girl, The Arrow and reading books or watching shows that deal with Science.\nI like learning about our world, animals, and how things work based on a scientific analysis. Photography is another thing that I love to do. I have covered many nature, family, weddings and graduation photo shoots. Making tutus are fun for me as well. I love to sew.\nIf you would like to learn more about our school’s curriculum, programs or would like a tour please contact us at:\nPhone: (386) 313-5029\nEmail: info@capaacademy.com\nThank you for reading my story! Please feel free to look around our website. Have a fantastic day.\n-Cornella A Nalls\ntestimonials\nWhat Our Parents Say\n/.sc_title\n“My daughter loves C.A.P.A. and so do I. She is learning to sing, dance, play musical instruments all while being enrolled as a Florida Virtual Student. We are looking forward to an amazing school year!”\nStephanie Jamison\n“This is a very unique program and much needed in our community. The owner is a wonderful person full of love and ambition. Your children will definitely enjoy her program, I highly recommend.”\nMonica Anderson\n/.sc_testimonials\n.entry-content",
      "emails": [
        "capaacademy@gmail.com",
        "info@capaacademy.com"
      ]
    },
    {
      "url": "https://www.facebook.com/CreativeAcademy19",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    }
  ],
  "all_links": [
    "https://capaacademy.com/index.php/contacts/",
    "https://capaacademy.com/index.php/about-us/",
    "https://capaacademy.com/index.php/services/communication/",
    "https://capaacademy.com/",
    "https://capaacademy.com/index.php/services/two/",
    "https://capaacademy.com/index.php/our-rates/",
    "https://capaacademy.com/index.php/services/nurturing/",
    "https://capaacademy.com/index.php/services/education/",
    "https://capaacademy.com/index.php/services/nutrition/",
    "https://capaacademy.com/index.php/services/learn/",
    "https://capaacademy.com/index.php/services/fun/"
  ],
  "candidate_links": [
    "https://capaacademy.com/index.php/about-us/",
    "https://www.facebook.com/CreativeAcademy19"
  ],
  "visited": [
    "http://capaacademy.com/",
    "http://capaacademy.com/about",
    "http://capaacademy.com/contact",
    "http://capaacademy.com/staff",
    "http://capaacademy.com/team",
    "http://capaacademy.com/board",
    "http://capaacademy.com/directory",
    "http://capaacademy.com/events",
    "http://capaacademy.com/sitemap.xml",
    "http://capaacademy.com/council",
    "http://capaacademy.com/leadership",
    "http://capaacademy.com/management",
    "http://capaacademy.com/producers",
    "http://capaacademy.com/support",
    "http://capaacademy.com/crew",
    "http://capaacademy.com/members",
    "http://capaacademy.com/bios",
    "http://capaacademy.com/people",
    "http://capaacademy.com/artists",
    "http://capaacademy.com/musicians",
    "http://capaacademy.com/faculty",
    "http://capaacademy.com/administration",
    "https://capaacademy.com/index.php/about-us/",
    "https://www.facebook.com/CreativeAcademy19"
  ],
  "base_url": "http://capaacademy.com/"
}