{
  "pages": [
    {
      "url": "https://castawayfloridakeys.com/andrew-zimmern-5-questions-about-lionfish-with-john-mirabella/",
      "is_candidate": false,
      "has_email": true,
      "text": "Andrew Zimmern 5 Questions About Lionfish With John Mirabella\nLatest Article for Andrew Zimmern Click here to read it online.\n5 Questions: John Mirabella\nDoing His Part to Eradicate Lionfish\nJohn Mirabella is on a mission to bring attention to the devastating lionfish invasion in the Atlantic Ocean, Caribbean and Gulf of Mexico. With no natural predators in this part of the world beyond humans, the rapidly growing populations may be one of the biggest environmental disasters these waters will ever face. Armed with venomous spines, they prey on unsuspecting fish, eating anything and everything in sight at alarming rates. About five years ago, Mirabella decided he needed to do his part on a local level. He dives for lionfish daily before serving the fish at his\nrestaurant\nin several different preparations, including sushi, sashimi, and more traditionally with lemon, white wine, garlic and capers. He hosts an annual spearfishing tournament to raise awareness of the invasion, and represented Florida at this year’s Sustainable Seafood Conference in New Orleans. If you’re in the Keys, a meal at\nCastaways\nin Marathon should definitely be on your docket.\nAndrewZimmern.com: Where did lionfish come from? How long have they been in the Atlantic Ocean?\nJohn Mirabella: Lionfish were first discovered in U.S. waters in the 1980s, but in small numbers. There is some credit given to Hurricane Andrew which was in 1992 flooding aquarium stores in Miami and releasing lionfish into our waters. My personal belief is that a small release in Miami would not have populated the Caribbean and Gulf Coast since the prevailing currents are from South to North. They are native to the Indo-Pacific where their population is much lower due to natural predation.\nREAD:\nNational Geographic’s “5 Myths About Lionfish”\nAZ.com: Why are the huge populations detrimental to the Atlantic Ocean’s ecosystem?\nJM: The problem with lionfish in their non-native habitat is that they have no natural predators and their population is growing unchecked at an alarming rate. They are ambush predators and park themselves on populations of baby fish (fish fry) and gobble them up quickly; our nurseries are under siege.\nAZ.com: When did you start spearfishing lionfish? What made you decide that this was an important cause?\nJM: I began spearfishing lionfish about 4 years ago, maybe 5. I dive with a group of friends one of whom, Adolphus Busch IV, is an avid conservationist and he really pushed for it.\nAZ.com: What solutions are in the works to tackle the lionfish invasion?\nJM: Divers are the most effective method of removing lionfish on a localized basis, but the problem is that the lionfish are found from the shoreline down to 1000 feet deep. Divers aren’t likely to go much past 200 feet for safety reasons. The Director of NOAA, Dan Basta, told me there are some experimental traps in the works.\nAZ.com: What’s the biggest challenge you face fishing for and preparing lionfish?\nJM: The biggest challenge is the expense and risks associated with diving for lionfish. We are diving to deeper and deeper depths to find large populations of lionfish and bigger sizes, which are more practical for serving in the restaurant. The risk of being spined is also significant. It is very painful and can put key people out of work depending on the severity of the sting. Since I run my own boat and pay for expenses, it is hard to keep the price of lionfish I’m serving in line with customer expectations since they don’t realize what it costs to put them on the table.\nAZ.com: On a good day,  how many can you catch?\nJM: On a good day we get 50 to 75 fish, which may be 55 to 70 pounds. The yield of usable fillets is less than 25 percent always and under 20 percent if the fish are smaller.\nAZ.com: How do you prepare them in your restaurant? Do you find people are hesitant to try lionfish?\nJM: We serve them as sushi, sashimi, usuzukuri, tacos and as an entree prepared many different ways. The most popular are our King Of The Jungle sushi roll (pictured above) and Lionfish Wreckdiver-Style (lionfish cooked in white wine with lemon, capers, and fresh herbs). Some people are hesitant but once they try it, most are addicted.\nAZ.com: Beyond your own restaurant\nCastaways\n, what are a few of your favorite restaurants in the Keys?\nJM: I like to eat out as often as I can get away. Barracuda Bistro in Marathon,\nMichaels\nin Key West,\nSquare Grouper\nin Cudjoe Key are a few of my favorites.\nAZ.com: What’s in your fridge?\nJM: Well, I don’t eat at home often so in my fridge is… champagne, The Prisoner wine, OJ, Tomato juice for me, V8 for my girlfriend, Forbidden cream liqueur, diet ginger beer, Bud Light Chelada’s, clamato, vodka, coconut water, many varieties of hard cheese and beef jerky, yogurt, hot sauce and leftovers in styro boxes. In my freezer are berries and venison.\nAbout John Mirabella\nJohn Mirabella and his dive team are out on the waters each day helping rid the Florida Keys National Marine Sanctuary of the invasive lionfish which have taken over the local waters and have multiplied profusely.  John Mirabella owns a restaurant in Marathon, Florida, where he serves the fresh lionfish on his menu.  He is the original leader of serving lionfish on Florida Keys menus. He is the premier vendor on the invasive species, promoting its edibility throughout South Florida.  John Mirabella and Castaway Restaurant are also very much involved with a yearly lionfish tournament to help raise awareness for the invasive species and his lionfish recipes have been featured in National Geographic.  He is deserving of being a 2015 Seafood Champion for making lionfish a popular and sustainable fish to eat.",
      "emails": [
        "info@jonesn4sushi.com"
      ]
    }
  ],
  "all_links": [
    "https://castawayfloridakeys.com/nice-nod-from-trivago-magazine/",
    "https://castawayfloridakeys.com/castaway-florida-keys-featured-in-coastal-living-magazine/",
    "https://castawayfloridakeys.com/travel-leisure-magazine-mention/",
    "https://castawayfloridakeys.com/andrew-zimmern-5-questions-about-lionfish-with-john-mirabella/",
    "https://castawayfloridakeys.com/knoxville-daily-sun-castaway-article/",
    "https://castawayfloridakeys.com/wp-content/uploads/2023/11/BEER-AND-LIBATIONS.pdf",
    "https://castawayfloridakeys.com/page/2/?et_blog",
    "https://castawayfloridakeys.com/reservations/",
    "https://castawayfloridakeys.com/wp-content/uploads/2023/11/BREAKFAST.pdf",
    "https://castawayfloridakeys.com/wp-content/uploads/2023/11/DINNER-AND-SUSHI-2023.pdf",
    "https://castawayfloridakeys.com/john-mirabella-is-the-the-lionfish-king-of-the-florida-keys/",
    "https://castawayfloridakeys.com/emerald-topaz-jade-with-castaway/",
    "https://castawayfloridakeys.com/cousteau-iuu-task-force-highlight-seaweb-seafood-summit-lineup/",
    "https://castawayfloridakeys.com/",
    "https://castawayfloridakeys.com/wp-content/uploads/2023/11/LUNCH-SPECIALS-with-APPS-2023.pdf",
    "https://castawayfloridakeys.com/wp-content/uploads/2023/11/KIDS-MENU-OCEAN-LIFE-WORD-SEARCH-AND-TIC-TAC-TOE-2023.pdf",
    "https://castawayfloridakeys.com/vickey-flip-flop-article/",
    "https://castawayfloridakeys.com/news/",
    "https://castawayfloridakeys.com/in-search-of-the-best-key-lime-pie-in-the-florida-keys/",
    "https://castawayfloridakeys.com/national-geographic-traveler-food-castaways/",
    "https://castawayfloridakeys.com/david-lang-gourmet-food-trip-florida-keys/"
  ],
  "candidate_links": [
    "https://castawayfloridakeys.com/andrew-zimmern-5-questions-about-lionfish-with-john-mirabella/"
  ],
  "visited": [
    "https://castawayfloridakeys.com/",
    "https://castawayfloridakeys.com/about",
    "https://castawayfloridakeys.com/contact",
    "https://castawayfloridakeys.com/staff",
    "https://castawayfloridakeys.com/team",
    "https://castawayfloridakeys.com/board",
    "https://castawayfloridakeys.com/directory",
    "https://castawayfloridakeys.com/events",
    "https://castawayfloridakeys.com/sitemap.xml",
    "https://castawayfloridakeys.com/council",
    "https://castawayfloridakeys.com/leadership",
    "https://castawayfloridakeys.com/management",
    "https://castawayfloridakeys.com/producers",
    "https://castawayfloridakeys.com/support",
    "https://castawayfloridakeys.com/crew",
    "https://castawayfloridakeys.com/members",
    "https://castawayfloridakeys.com/bios",
    "https://castawayfloridakeys.com/people",
    "https://castawayfloridakeys.com/artists",
    "https://castawayfloridakeys.com/musicians",
    "https://castawayfloridakeys.com/faculty",
    "https://castawayfloridakeys.com/administration",
    "https://castawayfloridakeys.com/andrew-zimmern-5-questions-about-lionfish-with-john-mirabella/"
  ],
  "base_url": "https://castawayfloridakeys.com/"
}