{
  "pages": [
    {
      "url": "https://coastaldayzbrewery.com/about",
      "is_candidate": false,
      "has_email": false,
      "text": "Brewery in Fort Myers, Florida\nLocated in Downtown Fort Myers, we’re a micro-brewery with decades of experience in the industry and a love for good beer and good times.\nCurrent Hours\nMonday-Thursday 2:30pm-9pm\nFriday: 12:30pm-10pm\nSaturday 12:00pm-10pm\nSunday:  11am-8pm\nWith 16 tapz, we’ve got our staples like\nSeaz The Day Hazy IPA\nand\nBeach Hound Brown\n, and regularly feature a few specialty and guest tapz also.\nInside the brewery, you’ll find friendly faces and a chill atmosphere while you enjoy one of our beer flights. Outside, you can relax under an umbrella on the patio and watch the world go by as you and your favorite people (and pets) spend the day or night in our downtown paradise.\nWe regularly have food vendors serving inside the brewery (find out who and when\nhere\n) and you can also bring your own food in or have some delivered.\nUnfortunately, due to our limited size, layout, and chill atmosphere, we are unable to provide space or entertainment for children.\nParking\nHours\nDirections\nWith a passion for beer and wanting to create a local place to visit with old friendz, meet new friendz and hang with fur-friendz, Coastal Dayz Brewery was created in April of 2018.  The Bethune family, hailing from Colorado, fell in love with the Fort Myers area and started their craft beer journey in a small corner building on McGregor.  With Gary’s passion for beer, Lisa’s mind for business, Alana’s marketing talent and of course little Ruby’s guidance (The Bethune’s miniature Aussie), Coastal Dayz Brewery became exactly what they hoped for.\nWithin a year, the brewery was growing more than expected and Gary needed someone to assist with brewing.  Little did everyone know that the young man hired would become the future of the brewery! Alex Tatko came into the brewery as an assistant brewer in 2019 with a love of craft beer after graduating law school and discovering his passion is in the craft beer industry. With a homebrew contest win under his belt and lots of accolades he immediately proved he was a hard-working young man and became an invaluable asset to the brewery.\nThe relationship between The Bethune’s and Alex became more family than business.  After only a year with the company, Alex quickly became the head brewer.  You might say he did too good of a job!  By working as hard as he did, the Bethune’s realized they didn’t need to spend so many hours there.  In 2022, being able to work less hours convinced the Bethune’s it was time to sell the business and enjoy retirement.\nKnowing the sale of the brewery was becoming a reality, Alex stepped in and used his hard work and love for the brewery to show the Bethune’s that he was the right person to buy the business.  Possibly one of the youngest sole owners of a brewery in Southwest Florida, the Bethune’s couldn’t be prouder of where the brewery is headed.  By adding his own experience, brewing talent, and ambition to take the Coastal brand to another level, Coastal Dayz Brewery has begun the next chapter with more beer choices, more fun events and is still the perfect place to visit with old friendz, meet new ones and enjoy a brew with those fur-buddiez!",
      "emails": []
    },
    {
      "url": "https://coastaldayzbrewery.com/events",
      "is_candidate": false,
      "has_email": false,
      "text": "Upcoming Food & Events\nAug\n30\n1:00pm - 6:00pm\nDave’s Mobile Pizza and More\nAug\n31\n11:00am - 5:00pm\nSunday Funday: Brunch & Live Music Bingo – Every Sunday\nSep\n1\n2:30pm - 8:30pm\nFree Beer Mondays: From A to Z\nSep\n1\n5:00pm - 8:00pm\nFood Truck: The Flying Dog",
      "emails": []
    },
    {
      "url": "https://coastaldayzbrewery.com/our-brewz#anchor-3408",
      "is_candidate": false,
      "has_email": false,
      "text": "Our Brewz\nStaples\nTap #01 Wannabe Blonde $7\n16oz\n/\n4.6% ABV\nLight, crisp and delicious. No fancy additions to this easy drinking, all-malt summer ale. A perfect choice for a craft-brew first timer, this Blonde goes down easy and will keep you wanting more on a sizzling summer day.\nTap #02 Gulf Coast Gold $7\n16oz\n/\n5.2% ABV\nThis all-grain golden ale is another great choice for craft beer first-timers. Gulf Coast is a step above the light and crisp Wannabe Blonde with a slightly stronger flavor profile. Pale malt and very mild Cascade and German Hallertau hop additions keep it light and fun with more character and substance.\nTap #03 Homeport Honey Wheat $7\n16oz\n/\n5.5% ABV\nAn American Wheat style beer given a light honey flavor by using specialty malt rather than honey additions. Northern Brewer and Czech Saaz hops lead to a pleasant, slightly complex, summertime American honey wheat beer.\nTap #04 Amberjack Amber Ale $7\n16oz\n/\n5.2% ABV\nAn American Amber Ale with flaked rye brings a delightful balance of malt and hops. This all grain brew has generous Cascade hop additions that give it a medium-bodied mouth feel and citrusy floral tones.\nTap #05 Beach Hound Brown $7\n16oz\n/\n4.7% ABV\nA true southern English style nut brown with hints of delightful nuttiness and the delicate herbal tones of the famous Kent Goldings hops. Smooth and malty, this caramel color beauty is an all-malt, year-round favorite.\nTap #07 Pirate’s Porter $7\n16oz\n/\n6.2% ABV\nA robust, dark beer with a light, foamy head. This is the true adult milk shake of beers! A higher ABV than the normal porter recipe gives it a bit of a kick but a malty mouth feel and flavor. It’s best flavor potential is met slightly warmer than when first poured, so let her sit a bit.\nTap #08 Seaz The Day IPA $8\n16oz\n/\n6.8% ABV\nThis double dry hopped hazy IPA is a sun-soaked, hop lover’s hazy dream. Crisp, fruity and juicy with aggressive Magnum, Falconer’s, and Citra hop additions. Restrained bitterness and intense fruity flavor make this brew a must-try!\nTap #09 Portside Pale Ale $7\n16oz\n/\n6.3% ABV\nMedium-bodied and refreshingly bold pale ale with a “just right” light and foamy head! Don’t let the low hop aroma fool you… Citra hops add a delightful bitterness with a classic citrus and tropical fruit, big hop flavor.\nTap #10 Bombay Double IPA $8\n16oz\n/\n8.2% ABV\nNamed from the origin of this beer style, our IPA bears massive quantities of Chinook, Mosaic and Simcoe hop additions! Not for the faint of heart or the first timer in a craft beer establishment, but this hop-bomb will certainly please the most discerning craft beer pallet.\nTap #11 Rock-N-Reef Irish Red $7\n16oz\n/\n6% ABV\nWhile originally derived from an English Bitter with less hop character, an Irish Red Ale has become a go-to style in many breweries throughout America. With an amber hue, this slightly sweet yet crisp beer has delicate flavors of toffee, caramel, and a hint of biscuit followed by a subtle roasted dryness. Unlike other styles, this beer holds very little bitterness and leans more toward a malty palette.\nOur Specialtiez\nTap #06 The Great Pumpkin Ale $8.00\n16oz\n/\n6.6% ABV\nWhat did the pumpkinz say at happy hour? Let’s get smashed! It’z that time of the year again! In this festive brew you will find rich malty caramel notes contributed by the grainz, but you also can’t forget the star of this beer! Pumpkinz! Over 200lbs of roasted pumpkinz and a pinch of grandma’s special spice blend were added to create our favorite holiday brew, A Pumpkin Ale! The final addition of Madagascar vanilla beanz provide another layer that rounds out this flavorful brew!\nTap #12 Lazy Rayz Session IPA $8\n16oz\n/\n4.0% ABV\nDrift into easy living with Lazy Rayz, our laid-back American Session IPA made for sun-soaked afternoons. Bursting with waves of citrus and a touch of tropical hop character from Citra & Amarillo hops, it’s light on ABV but bursting with flavor. No matter where you find yourself, Lazy Rayz is your summer sipper all day long!\nTap #13 Captain Kona’s Black IPA $8\n16oz\n/\n5.2% ABV\nOf course, we had to brew a beer in Kona’s (our brewery kitten) honor and of course it had to be a black IPA! While this beer plays tricks on your eye, it is still very much an IPA at heart. The heavy addition of hops will give your tastebuds a whirlwind experience of flavors from citrus to earthy to even slight piney notes. The addition of Calypso hops pays homage to Kona’s sister who was named after the hop Calypso.\nTap #14 Starboard Sour: Pineapple Mango $8\n16oz\n/\n4.2% ABV\nThis brew was handcrafted with an abundance of fresh pineapple and mango to create one delightful beer. With a pinch of lactose and a splash of vanilla, this refreshing brew will quench the most parched palettes!\nTap #15 Sea Breeze Seltzer: $7 *Flavor Varies*\n16oz\n/\n4% ABV\nHard seltzers are here! We’ll have rotating flavors so if you see one you like, better swing by and get ya some!!\nTap-It Tuezday – Florida Lager 8/25\n16oz\n/\nVaries ABV\nTap-It Tuezday is a specialty SMALL batch brew released every Tuezday!  Please check Facebook, Instagram and Untappd for weekly Tap-It’z!\nAnd we’re sorry, no discounts and no keg sales on these, they only yield one keg anyway!\nOther Alcoholic Optionz\n3 Daughters Cider: Key Lime – Raspberry Lemonade Cider – Pineapple ($6 Can)\n12oz\n/\n5.5% ABV\nThe Key Lime cider is a hard apple cider blended with key lime juice for a uniquely Florida taste. The semi-sweet apple flavor is nicely balanced by the tart, zesty key lime juice.\nTart and fruity, the Raspberry Lemonade cider is a boozy spin on a summer classic.  You can practically taste the cool shade!\nBursting with tropical pineapple flavor, this crisp and slightly tangy cider captures the essence of Florida’s sunny beaches and vibrant citrus groves.\n3 Daughters Vodka Soda – Orange Creamsicle ($6 Can)\n12oz\n/\n4.8% ABV\nCool vanilla and bright orange swirl together in a light and refreshing spiked treat.\nNutrls: Pineapple or Watermelon ($6/can)\n12oz\n/\n4.5% ABV\nNÜTRL is a refreshingly tasty, sessionable, 100 calorie vodka seltzer made with simple ingredients like real vodka, seltzer, and real juice. NÜTRL is a light and refreshing drink for adults 21+.\nSurfside: Vodka Iced Tea / Vodka Peach Iced Tea ($6/can)\n12oz\n/\n4.5% ABV\nSurfside is made with vodka, real tea, real juice, has only 100 calories, 2 grams of sugar & 0 bubbles!\nWine $8\n8oz\n/\nVaries ABV\nRed\n: We offer a Cabernet Sauvignon and a Merlot.\nWhite\n: We offer a Sauvignon Blanc and a Chardonnay.\nNon-Alcoholic Optionz\nNon-Alcoholic 21+: Tortuga Beverages – Raspberry Delta 9 Drink  ($12/Can)\n16oz\n/\n0.0 ABV\nNon-Alcoholic: Botanical Brewing Company (Kava) Orange Cream or Peach ($9/Can) – Coming Soon\n12oz\n/\n0.0% ABV\nAre you looking for a refreshing drink without the buzz? Local brewery Botanical Brewing Company has the solution. With two flavors, Orange Cream & Peach, you’re sure to relax with each sip.\nNon-Alcoholic: NA Beers ($6/can)\n12oz\n/\n0.0% ABV\nNot feeling alcohol, we got you covered! We have multiple options for NA Beer from some of the best in the business.\nNon-Alcoholic: Soda, Iced Tea, Lemonade\nVaries\n/\n0.0% ABV\nTo Go, Gifts & Event Information!\nCans To-Go\n12oz\n/\nVaries ABV\nWe offer 12oz cans to go ($4 Each)! Below is our current inventory:\nWannabe Blonde 12oz can\nBeachHound Brown 12oz Can\nHomeport Honey Wheat 12oz can\nGulf Coast Gold 12oz can\nBombay IPA 12oz can\nSeaz The Day Hazy IPA 12oz can\nWant To See Something Else In Cans? Let Us Know!\nGift Cards\n/\nABV\nGift Cards:  Available at the brewery in any amount.\nVirtual Gift Cards:  Available by phone and can be sent via email or text.  Please call the brewery prior to 3pm.  If we are un-available, please leave a call back number or email\n[email protected]\nand we can set up a time to call you!  (239) 204-9665.\nGrowlers To-Go\n64oz\n/\nVaries ABV\n64oz glass Coastal Dayz logo growlers are $10.\nGrowler fill prices vary by style $21 – $36.  Not all specialty brewz are available for growler fills.\nYou may bring your own (CLEAN growler) or purchase ourz.\nWe are sorry, small mouth 32oz growlers can’t be filled.  All other 32oz growlers are 1/2 price of a normal 64oz growler.\nKeg Sales – Please Email/Call Ahead\n1/6 or 1/2 BBL\n/\nVaries ABV\n[email protected]\nor (239) 204-9665\nAll keg sales require a $75 keg deposit on 1/6 and $120 keg deposit on 1/2 BBL.\nStandard 1/6 Keg $108, Premium 1/6 Keg $122 (Approx. 40 pints)\nStandard 1/2 BBL $320, Premium 1/2 BBL $370 (Approx. 122 pints)\nPremium brewz are Seaz The Day IPA, Portside Pale, Bombay IPA and Specialties.\nTap Alerts\nOf course you want us to notify you when we tap something new, right?!\nYour Email Address\n*\nName\nThis field is for validation purposes and should be left unchanged.",
      "emails": []
    },
    {
      "url": "https://coastaldayzbrewery.com/contact",
      "is_candidate": false,
      "has_email": true,
      "text": "Message in a bottle? Carrier pigeon?\nTry an email first and let’s see how that goes!\nTo let us know how much you love our brewery and our brewz or if you have any questions or want to collab for an event? Email sayhi@coastaldayzbrewery.com or call us at (239) 204-9665.\nCurrent Hours\nMonday-Thursday 2:30pm-9pm\nFriday: 12:30pm-10pm\nSaturday 12:00pm-10pm\nSunday:  11am-8pm\nAre pets allowed at the brewery?\nWe love pets so much it’s almost a requirement that you bring one. Don’t have one? That’s ok, you’ll find friendship here. Just don’t hump anyone’s leg and we’ll be cool.\nPlease ensure that your pet is friendly, leashed at all times and behaved in social situations.\nAre children allowed at the brewery?\nUnfortunately, due to our limited size, layout, and chill atmosphere, we are unable to provide space or entertainment for children.\nWhat about food?\nWe regularly welcome in various food vendors that serve up delicious items on location. Also, feel free to get something delivered, or bring your own. Publix is right across the street, and a Publix sub pairs very well with all of our brewz.\nWant some pizza? Order from our local supporter’s Downtown House of Pizza (DHOP)!\nWhere do I park?\nThere are several spaces behind our building off Victoria Ave. Visual learner?\nView this handy map\nI want merchandize!\nAwesome! We love to see our customers supporting our brewery with some\nswag\n. We’ll have an online store soon, but in the meantime, stop into the brewery and pick something out. We’ve got a ton of tshirts, hats, growlers and more.\nStalk us online\nInstagram:\n@coastaldayzbrewery\nFacebook:\nfb.com/coastaldayzbrewery\nUntappd:\nView Profile",
      "emails": [
        "sayhi@coastaldayzbrewery.com"
      ]
    }
  ],
  "all_links": [
    "https://coastaldayzbrewery.com",
    "https://coastaldayzbrewery.com/our-brewz#anchor-140",
    "https://coastaldayzbrewery.com/our-brewz#anchor-3364",
    "https://coastaldayzbrewery.com/our-brewz#anchor-3421",
    "https://coastaldayzbrewery.com/our-brewz#anchor-2486",
    "https://coastaldayzbrewery.com/events/food-truck-the-flying-dog-15/",
    "https://coastaldayzbrewery.com/about",
    "https://coastaldayzbrewery.com/our-brewz#anchor-3296",
    "https://coastaldayzbrewery.com/our-brewz#anchor-3304",
    "https://coastaldayzbrewery.com/our-brewz#anchor-662",
    "https://coastaldayzbrewery.com/events/free-beer-mondays-from-a-to-z-49/",
    "https://coastaldayzbrewery.com/our-brewz#anchor-3320",
    "https://coastaldayzbrewery.com/our-brewz#anchor-148",
    "https://coastaldayzbrewery.com/location",
    "https://coastaldayzbrewery.com/our-brewz#anchor-679",
    "https://coastaldayzbrewery.com/events/sunday-funday-brunch-live-music-bingo-every-sunday-57/",
    "https://coastaldayzbrewery.com/credits",
    "https://coastaldayzbrewery.com/our-brewz#anchor-2076",
    "https://coastaldayzbrewery.com/2018/08/30/pet-friendly-brewery-in-fort-myers-florida/",
    "https://coastaldayzbrewery.com/events",
    "https://coastaldayzbrewery.com/our-brewz#anchor-3408",
    "https://coastaldayzbrewery.com/our-brewz#anchor-141",
    "https://coastaldayzbrewery.com/our-brewz#anchor-2140",
    "https://coastaldayzbrewery.com/contact/#anchor-hours",
    "https://coastaldayzbrewery.com/parking/",
    "https://coastaldayzbrewery.com/our-brewz",
    "https://coastaldayzbrewery.com/news",
    "https://coastaldayzbrewery.com/our-brewz#anchor-2744",
    "https://coastaldayzbrewery.com/our-brewz#anchor-137",
    "https://coastaldayzbrewery.com/our-brewz#anchor-145",
    "https://coastaldayzbrewery.com/our-brewz#anchor-1127",
    "https://coastaldayzbrewery.com/our-brewz#anchor-146",
    "https://coastaldayzbrewery.com/our-brewz#anchor-2139",
    "https://coastaldayzbrewery.com/contact",
    "https://coastaldayzbrewery.com/our-brewz#anchor-2218",
    "https://coastaldayzbrewery.com/our-brewz#anchor-2819",
    "https://coastaldayzbrewery.com/store",
    "https://coastaldayzbrewery.com/store/",
    "https://coastaldayzbrewery.com/events/daves-mobile-pizza-and-more-55/",
    "https://coastaldayzbrewery.com/our-brewz#anchor-144",
    "https://coastaldayzbrewery.com/our-brewz#anchor-142",
    "https://coastaldayzbrewery.com/our-brewz#anchor-1581"
  ],
  "candidate_links": [
    "https://coastaldayzbrewery.com/about",
    "https://coastaldayzbrewery.com/events",
    "https://coastaldayzbrewery.com/our-brewz#anchor-3408",
    "https://coastaldayzbrewery.com/contact"
  ],
  "visited": [
    "https://www.coastaldayzbrewery.com/",
    "https://www.coastaldayzbrewery.com/about",
    "https://www.coastaldayzbrewery.com/contact",
    "https://www.coastaldayzbrewery.com/staff",
    "https://www.coastaldayzbrewery.com/team",
    "https://www.coastaldayzbrewery.com/board",
    "https://www.coastaldayzbrewery.com/directory",
    "https://www.coastaldayzbrewery.com/events",
    "https://www.coastaldayzbrewery.com/sitemap.xml",
    "https://www.coastaldayzbrewery.com/council",
    "https://www.coastaldayzbrewery.com/leadership",
    "https://www.coastaldayzbrewery.com/management",
    "https://www.coastaldayzbrewery.com/producers",
    "https://www.coastaldayzbrewery.com/support",
    "https://www.coastaldayzbrewery.com/crew",
    "https://www.coastaldayzbrewery.com/members",
    "https://www.coastaldayzbrewery.com/bios",
    "https://www.coastaldayzbrewery.com/people",
    "https://www.coastaldayzbrewery.com/artists",
    "https://www.coastaldayzbrewery.com/musicians",
    "https://www.coastaldayzbrewery.com/faculty",
    "https://www.coastaldayzbrewery.com/administration",
    "https://coastaldayzbrewery.com/about",
    "https://coastaldayzbrewery.com/events",
    "https://coastaldayzbrewery.com/our-brewz#anchor-3408",
    "https://coastaldayzbrewery.com/contact"
  ],
  "base_url": "https://www.coastaldayzbrewery.com/"
}