{
  "pages": [
    {
      "url": "https://cobaltrestaurant.com/about",
      "is_candidate": false,
      "has_email": true,
      "text": "Google Tag Manager (noscript)\nEnd Google Tag Manager (noscript)\nReservations\nContact\nPress\nHeaton's\nMenus\nAbout\nMeet the Team\nEvents\nPrivate Dining\nPhotos\nOpen Menu\nxml version=\"1.0\" encoding=\"UTF-8\"?\nxml version=\"1.0\" encoding=\"UTF-8\"?\nMenus\nAbout\nMeet the Team\nEvents\nPrivate Dining\nPhotos\nReservations\nContact\nPress\nHeaton's\nour story\nOceanside dining in vero beach\nInspired by the colorful history of the Treasure Coast, Cobalt strives to deliver an adventurous escape to all its guest, whether they're from out of town or just around the block. Cobalt offers several distinct scenes: that of our poolside grill, our lounge, and our beachfront dining room. You can also escape to our alfresco bar and grill at Heaton's.\nAt Cobalt and Heaton's, we do our best to give back to the beautiful beach around us. We’re honored to share our stretch of Vero Beach with the local sea turtle population, and we do our part by turning off our outdoor lights at select times in the mating cycle to help our vulnerable neighbors survive and thrive. We are a proud business partner of the\nIndian River County Sea Turtle Conservation Plan.\nTo help out our local reefs, our oyster shells get donated back to the St. Lucie's Oyster Reef Restoration Program.\nDress Code\nDress Code is Casual Resort Wear - Shorts, Sandals are Okay, No Bathing Suits for Dinner.\nMeet Our Team\nEvents and specials\nFrom live music to happy hour, discover the latest happenings at Cobalt and Heaton's.\nView Upcoming Events\nHeaton's\nExperience Al Fresco dining at the all new Heaton's Vero Beach.\nView Menu\nHOURS\nBRUNCH\nMonday - Friday: 7:30AM - 2:30PM\nSaturday - Sunday: 8AM - 3PM\nHAPPY HOUR\nDaily: 4PM - 5PM\nDINNER\nDaily: 5PM - 9PM\nBAR (Drink Service)\nDaily until 10PM\nCobalt will be closed for private events on December 2, 9, 13, & 31.\nCobalt will be closed Jan 6 - 26, 2026 for restaurant updates.\nMAKE A RESERVATION\nVisit Us\n3500 Ocean Drive\nVero Beach, FL 32963\n772.469.1060\ninfo@cobaltrestaurant.com\nPark on us!\nEnjoy complimentary Valet Parking when dining at Cobalt or Heaton's. Valid for up to three hours.\nLet's Stay in Touch\nEmail Address\nFacebook\nInstagram\nTripAdvisor\nKimpton Vero Beach Hotel & Spa\nPrivacy & Legal\nYour CA Privacy Rights\nA Kimpton Restaurant\nGift Cards\nCAREERS\nGoogle Analytics\nEnd Google Analytics",
      "emails": [
        "info@cobaltrestaurant.com"
      ]
    },
    {
      "url": "https://cobaltrestaurant.com/our-team",
      "is_candidate": false,
      "has_email": true,
      "text": "Google Tag Manager (noscript)\nEnd Google Tag Manager (noscript)\nReservations\nContact\nPress\nHeaton's\nMenus\nAbout\nMeet the Team\nEvents\nPrivate Dining\nPhotos\nOpen Menu\nxml version=\"1.0\" encoding=\"UTF-8\"?\nxml version=\"1.0\" encoding=\"UTF-8\"?\nMenus\nAbout\nMeet the Team\nEvents\nPrivate Dining\nPhotos\nReservations\nContact\nPress\nHeaton's\nour Team\nMeet Our Team\nDIRECTOR OF FOOD & BEVERAGE, MARCO FANELLI\nMarco Fanelli is the Director of Food & Beverage at the Kimpton Vero Beach Hotel & Spa. He has 15 years of hospitality experience, ranging from fine dining to independent restaurants.\nBorn and raised in Long Island, New York, Marco’s love for restaurants started at an early age in his family’s restaurant, where, over the years, he worked his way up the ranks. While in school for Hospitality Management at the University of Central Florida, he kick started his hotel career with an internship at the J.W. Marriott, Orlando Grande Lakes. Upon graduation, he cut his teeth with stints in New Orleans, Dallas & Denver at prestigious hotel brands such as The Ritz-Carlton and Four Seasons Hotels. With robust experience in banquets, fine dining and hotel operations under his belt, he moved to Vero Beach in November of 2018, where joined Kimpton Hotels & Restaurants and he oversees the daily food & beverage operations at the beautiful beachfront resort.\nAssistant general manager, jeffrey gillespie\nJeffrey’s passion for food and beverage began in the city of brotherly love. Having studied hospitality management at Walnut Hill College, he took a job serving at Bibou BYOB that has accumulated accolades from the NYT, Philadelphia Inquirer, and allowed him to develop a knowledge of fine wine and elegant service. Jeffrey went on to open Le Cheri where he curated their beverage program and would guide neighborhood folks and oenophiles alike through the restaurants impressive French & Swiss wine list. After Le Cheri, Jeffrey had the opportunity to reopen a newly renovated Bibou as General Manager. Here he was able to elevate the dining experience and refine the service to accentuate the new tasting menu concept and hone that knowledge of fine wine even more.\nJeffrey joined the Kimpton Vero Beach Hotel and Spa family in April of 2022 as a restaurant manager overseeing both Cobalt and Heaton’s restaurants. Jeffrey has built a great relationship with the team around him and utilizes their strengths to best accommodate the guests. He has a hands-on approach to management and likes to lead by example.\nOutside of work Jeffrey loves to spend time on the golf course, the beach, and on the river in his kayak. Jeffrey has developed a palate for tequila and loves to sip on a nice reposado from time to time.\nExecutive chef, matt lange\nMatt Lange joins Kimpton Vero Beach Hotel & Spa as Executive Chef.\nMatt honed his skills in hotel kitchens such as the Omni Orlando Hotel at Champions Gate, Rosen Shingle Creek, and Peabody Hotel Orlando. He even took to the seas as sous chef for Silversea Cruises LTD in the Baltic Sea. Following his European stint, Matt returned to solid ground to join the team at Michelin-starred NoMi Kitchen inside Park Hyatt Chicago. His four and a half year tenure at NoMi Kitchen influenced his culinary direction focusing on seasonal, refined American cooking.\nIn 2015, he joined Loews Chicago Hotel, where he held various positions including Executive Sous Chef of the hotel. In late 2017, he was tapped to open the new concept LIVE! By Loews in St. Louis, located atop the famed Cardinals stadium.\nChef Matt joined Kimpton Vero Beach Hotel & Spa in early 2022 and is excited to bring his commitment to quality to the resort’s menus. He applies many of the same methods to running a successful kitchen as he would a coach of a sports team. “I believe developing the culture is an extremely important element in the kitchen,” he explains. “It is what keeps the team excited, motivated, and generating quality dishes. I feel it is essential that everyone understands that it is a team effort and that collaboration is what makes a great kitchen.”\nWhen not in the kitchen, he can be found on the golf course perfecting his swing or fishing, or spending quality time with his family.\nsommelier, erin o'keefe\nErin O’Keefe is the new Sommelier at Kimpton Vero Beach Hotel & Spa. She oversees the wine program for the beachfront resort, Cobalt, and Heaton’s.\nErin is creating a wine list that is welcoming to all and will transport you around the world. This program includes wines with little intervention, where the winemaker has allowed the terroir to shine in such a way that visiting Cobalt is a first-class seat to the best wineries. A rosé from Provence and the coastal breeze will leave you with the sensation of standing in a vineyard in the South of France; and a Brunello from Montalcino that will transport you to the sweeping countryside of Tuscany and make you wonder if those palm trees are actually cypress trees.\nBorn in Petoskey, Michigan, Erin was introduced to the restaurant world in 2010 when she helped her mom open a family restaurant, The Twisted Olive. The coastal Mediterranean inspired restaurant was such a success it spurred the interest of Master Sommelier Ron Edwards who created one of Michigan’s most unique wine lists for them. Through his guidance and training Erin went on to get wine certifications and in the fall of 2017 Erin began an internship on a Champagne Vineyard in Charly-sur-Marne, France, Baron Fuente. She spent that fall in Champagne learning the ins and outs of production.\nDuring 2020 Erin took the opportunity to complete her Wine Spirit and Education Trust Level 2 certification through the Napa Valley Wine Academy and begin her own wine collection to make the most of having more time at home. She also started a blind tasting group, a skill that she is working on perfecting as part of her preparation for her WSET Level 3 certification.\nWine lovers of all levels will enjoy the knowledge Erin has to offer.\nlead bartender, jacob turner\nJacob Turner isn’t just a gin enthusiast – he’s a walking canvas. (No, really: ask him about his gin tattoo.) He brings unmistakable passion, along with a wealth of experience and a genuine love of hospitality, to Cobalt and our sister restaurant,\nHeaton's\n, where he develops and oversees our menus of craft cocktails, beers, wines, and spirits. A veteran of local favorite Southern Social, where he crafted an artful selection of house-made syrups, shrubs, and infusions, he is known among locals and regular visitors to Vero Beach alike for his boldly flavored, seasonal libations. His work in catering makes him a natural choice to design beverage menus for events of all sizes, and his warm presence behind the bar will make you feel instantly at ease, whether you are joining us for a hard-earned vacation or just a much-needed happy hour.\nEvents and specials\nFrom live music to happy hour, discover the latest happenings at Cobalt and Heaton's Reef.\nView Upcoming Events\nHeaton's\nDine al fresco at our poolside bar and grill.\nLearn More\nHOURS\nBRUNCH\nMonday - Friday: 7:30AM - 2:30PM\nSaturday - Sunday: 8AM - 3PM\nHAPPY HOUR\nDaily: 4PM - 5PM\nDINNER\nDaily: 5PM - 9PM\nBAR (Drink Service)\nDaily until 10PM\nCobalt will be closed for private events on December 2, 9, 13, & 31.\nCobalt will be closed Jan 6 - 26, 2026 for restaurant updates.\nMAKE A RESERVATION\nVisit Us\n3500 Ocean Drive\nVero Beach, FL 32963\n772.469.1060\ninfo@cobaltrestaurant.com\nPark on us!\nEnjoy complimentary Valet Parking when dining at Cobalt or Heaton's. Valid for up to three hours.\nLet's Stay in Touch\nEmail Address\nFacebook\nInstagram\nTripAdvisor\nKimpton Vero Beach Hotel & Spa\nPrivacy & Legal\nYour CA Privacy Rights\nA Kimpton Restaurant\nGift Cards\nCAREERS\nGoogle Analytics\nEnd Google Analytics",
      "emails": [
        "info@cobaltrestaurant.com"
      ]
    },
    {
      "url": "https://cobaltrestaurant.com/events-specials",
      "is_candidate": false,
      "has_email": true,
      "text": "Google Tag Manager (noscript)\nEnd Google Tag Manager (noscript)\nReservations\nContact\nPress\nHeaton's\nMenus\nAbout\nMeet the Team\nEvents\nPrivate Dining\nPhotos\nOpen Menu\nxml version=\"1.0\" encoding=\"UTF-8\"?\nxml version=\"1.0\" encoding=\"UTF-8\"?\nMenus\nAbout\nMeet the Team\nEvents\nPrivate Dining\nPhotos\nReservations\nContact\nPress\nHeaton's\nEvents & specials\nUpcoming Events\nFrom live music to holiday happy hours, there's always something going on at Cobalt.\nSelect a date to check out what's happening.\nMarkham Wine dinner\nNovember 5 | 6PM - 9PM\nJoin Markham Winemaker Kimberlee Nicholls and Chef Matt Lange to taste through five expertly paired expressions from one of the most well known Napa Valley Wineries, Markham!\nBook Now\nSt. Supery Wine DInner\nNovember 19 | 6:00 PM\nJoin St. Supery Winery and Chef Matt Lange for a 5 wine, 5 course dinner at Cobalt. Venture through multiple varietals, single vineyards and blends for a broad wine dinner showing the depth of St. Supery in Napa Valley!\nGet Tickets\nCeretto Wine Dinner\nDecember 10 | 6PM - 9PM\nJoin Julie Pepi and Chef Matt Lange for a one-of-a-kind five-course dinner, featuring some of the most unique and small production wines that Ceretto has to offer.\nGet Tickets\nMotown TUesdays\nEvery Tuesday\n6:00 PM\nJoin us every Tuesday for Motown Tuesdays.\nFriday Night Live\nEvery 1st Friday of the Month\n8:30 PM\nJoin us for Friday Night Live with Traxx Entertainment.\nHOURS\nBRUNCH\nMonday - Friday: 7:30AM - 2:30PM\nSaturday - Sunday: 8AM - 3PM\nHAPPY HOUR\nDaily: 4PM - 5PM\nDINNER\nDaily: 5PM - 9PM\nBAR (Drink Service)\nDaily until 10PM\nCobalt will be closed for private events on December 2, 9, 13, & 31.\nCobalt will be closed Jan 6 - 26, 2026 for restaurant updates.\nMAKE A RESERVATION\nVisit Us\n3500 Ocean Drive\nVero Beach, FL 32963\n772.469.1060\ninfo@cobaltrestaurant.com\nPark on us!\nEnjoy complimentary Valet Parking when dining at Cobalt or Heaton's. Valid for up to three hours.\nLet's Stay in Touch\nEmail Address\nFacebook\nInstagram\nTripAdvisor\nKimpton Vero Beach Hotel & Spa\nPrivacy & Legal\nYour CA Privacy Rights\nA Kimpton Restaurant\nGift Cards\nCAREERS\nGoogle Analytics\nEnd Google Analytics",
      "emails": [
        "info@cobaltrestaurant.com"
      ]
    }
  ],
  "all_links": [
    "https://cobaltrestaurant.com/about",
    "https://cobaltrestaurant.com/photos",
    "https://cobaltrestaurant.com/our-team",
    "https://cobaltrestaurant.com/menu",
    "https://cobaltrestaurant.com/private-dining",
    "https://cobaltrestaurant.com/events-specials",
    "mailto:info@cobaltrestaurant.com",
    "https://cobaltrestaurant.com/press",
    "https://cobaltrestaurant.com/"
  ],
  "candidate_links": [
    "https://cobaltrestaurant.com/about",
    "https://cobaltrestaurant.com/our-team",
    "https://cobaltrestaurant.com/events-specials"
  ],
  "visited": [
    "https://cobaltrestaurant.com/",
    "https://cobaltrestaurant.com/about",
    "https://cobaltrestaurant.com/contact",
    "https://cobaltrestaurant.com/staff",
    "https://cobaltrestaurant.com/team",
    "https://cobaltrestaurant.com/board",
    "https://cobaltrestaurant.com/directory",
    "https://cobaltrestaurant.com/events",
    "https://cobaltrestaurant.com/sitemap.xml",
    "https://cobaltrestaurant.com/council",
    "https://cobaltrestaurant.com/leadership",
    "https://cobaltrestaurant.com/management",
    "https://cobaltrestaurant.com/producers",
    "https://cobaltrestaurant.com/support",
    "https://cobaltrestaurant.com/crew",
    "https://cobaltrestaurant.com/members",
    "https://cobaltrestaurant.com/bios",
    "https://cobaltrestaurant.com/people",
    "https://cobaltrestaurant.com/artists",
    "https://cobaltrestaurant.com/musicians",
    "https://cobaltrestaurant.com/faculty",
    "https://cobaltrestaurant.com/administration",
    "https://cobaltrestaurant.com/about",
    "https://cobaltrestaurant.com/our-team",
    "https://cobaltrestaurant.com/events-specials"
  ],
  "base_url": "https://cobaltrestaurant.com/"
}