{
  "pages": [
    {
      "url": "http://www.connerscornmaze.com/about-the-farm",
      "is_candidate": false,
      "has_email": true,
      "text": "FALL FESTIVAL October 3rd - October 25th! \n2025 SEASON PASSES AVAILABLE NOW\nHome\nTicket Info / Activities\n2025 Events\nField Trips\nParties & Events\nThe Maze\nAbout the Farm\nMORE\nFAQs\nFOOD TRUCK COURT 2024\nMore\nHome\nTicket Info / Activities\n2025 Events\nField Trips\nParties & Events\nThe Maze\nAbout the Farm\nMORE\nFAQs\nFOOD TRUCK COURT 2024\nHome\nTicket Info / Activities\n2025 Events\nField Trips\nParties & Events\nThe Maze\nAbout the Farm\nMORE\nFAQs\nFOOD TRUCK COURT 2024\nAbout Us\nThe Conner Family Story\nThe Conner Family Story\nThe Conner Family Story\nThe Conner Family Story\nThe Conner Family Story\nIn December 2002, two weeks before Christmas, Eddie Conner, a 5th generation farmer in Nassau County, found himself out of a job. A knock at the door that day, 2 hours before it was reported on the TV, brought the news that Mr. Conner and 88 other poultry growers were effectively put out of business. Tyson was closing the doors to their poultry operation in north Florida.\nAs fate would have it, Amanda McLendon, the Conner’s daughter, and a friend, Beth Gregory, who worked at Farm Bureau in Callahan, had read about and visited a corn maze in Jennings FL two years before.  They returned so excited they wanted Mr. Conner to open a maze on the family farm immediately!!!  Mr. Conner, having his hands full with 4 poultry houses, producing approx. 400,000 chickens a year, plus cattle and hay, told Amanda she was crazy.  He did not have time for such nonsense.\nAs the days went by, after Tyson closing, the Conner’s were concerned about what they would do to make a living.  As they discussed  various options, God brought to their memory the trip Amanda and Beth had made to a maze in Jennings, and now maybe it would be something to try.  So they prayed and ask God to guide them, did some research on the internet, talked to their children, and visited two Florida mazes.  After the farmer who owned the maze in Jennings made the statement, “It has been the most fun in farming I have ever had”; the Conner’s took a giant leap of faith and joined the Maize organization.\nThen The Work Began...\nHaving replanted the maze 3 times due to the weather, Conner’s A-Maize-Ing Acres finally opened October 18, 2003.  The Conner’s inaugural season was a huge success, helping approximately 12,000 people “Get Lost” while being dedicated to providing a place where families, can come together and enjoy good clean fun.  Conner’s A-Maize-Ing Acres was host to over 6,000 school children on field trips their first year.  The teachers and students gave the Conner’s high marks on education, organization and a whole lot of good carefree fun.\nThe Conner’s strive to educate the public on the importance of agriculture and the American farmer.\nThey are quick to tell you that without God’s blessings and the help of family, friends and their church family, they could have never made it.\nMeet our farm family\nMr. Eddie and Mrs. Betty Jean\nMr. Eddie and Mrs. Betty Jean\nMr. Eddie and Mrs. Betty Jean\nRaised on the farm with his siblings, Mr Eddie helped his family farm this land for years. At the age of 18, Eddie enlisted in the Army and fought in the Vietnam War. Soon after his return, Betty Jean and Eddie were married in 1972 and together they farmed and raised their children (Amanda, Eddie II and  Matthew) with the help of the Lord\nShow More\nRaised on the farm with his siblings, Mr Eddie helped his family farm this land for years. At the age of 18, Eddie enlisted in the Army and fought in the Vietnam War. Soon after his return, Betty Jean and Eddie were married in 1972 and together they farmed and raised their children (Amanda, Eddie II and  Matthew) with the help of the Lord. They continue to farm with their Children and Grandchildren.\nShow Less\nOur Staff\nMr. Eddie and Mrs. Betty Jean\nMr. Eddie and Mrs. Betty Jean\nMany of the staff are family members and friends. Among those who have worked closely with the Conner's are: Conner son Lil' Eddie, Michelle, Sarah and her family, Kylie and so many more. They continue to be grateful for all the support, love and prayers from the fabulous farm hands they employ each year. After a brief morning prayer, the\nShow More\nMany of the staff are family members and friends. Among those who have worked closely with the Conner's are: Conner son Lil' Eddie, Michelle, Sarah and her family, Kylie and so many more. They continue to be grateful for all the support, love and prayers from the fabulous farm hands they employ each year. After a brief morning prayer, the farm hands are ready to greet and assist guests and help make their day special.\nShow Less\nThe McLendon Girls\nMr. Eddie and Mrs. Betty Jean\nThe McLendon Girls\nAmanda Conner McLendon is the oldest child born to Eddie and Betty Jean Conner.   Helping her parents, she manages the farm  while it is opened to guests throughout the year and together with her husband has raised their three beautiful daughters on the farm where they enjoy working together as family.   Hope, Kara and Cierra McLendon (\nShow More\nAmanda Conner McLendon is the oldest child born to Eddie and Betty Jean Conner.   Helping her parents, she manages the farm  while it is opened to guests throughout the year and together with her husband has raised their three beautiful daughters on the farm where they enjoy working together as family.   Hope, Kara and Cierra McLendon (aka \"the girls\") are a big part of the Fall Season attractions as well as everyday farm life.\nShow Less\nThe Conners\nMeet the Farmer, Mr. Eddie, & his Daughter, Amanda McLendon!\nPhoto Gallery\nTHANK YOU!\nFaithful Farmhands of 2020\nSign up to become a Vendor at the farm\nSign up here\n2025 Events\nField Trips\nThe Maze\nAbout the Farm\nJoin our Team\nConner's A-Maize-Ing Acres\n19856 County Road 121 Hilliard, Fl 32046\n904-879-5453\n/\ninfo@connerscornmaze.com\nCopyright © 2019 Conner's A-Maize-Ing Acres by JandA Group - All Rights Reserved.\nUnder Florida law, an agritourism operator is not liable for injury or death of, or damage or loss to, a participant in an agritourism activity conducted at this agritourism location if such injury, death, damage, or loss results from the inherent risks of the agritourism activity. Inherent risks of agritourism activities include, among others, risks of injury inherent to land, equipment, and animals, as well as the potential for you to act in a negligent manner that may contribute to your injury, death, damage, or loss. You are assuming the risk of participating in this agritourism activity.\"\nBlessed shalt thou be when thou comest in,  and blessed shalt thou be when thou goest out.\"  Deut. 28:6\nPowered by",
      "emails": [
        "info@connerscornmaze.com"
      ]
    },
    {
      "url": "http://www.connerscornmaze.com/join-our-team-1",
      "is_candidate": false,
      "has_email": true,
      "text": "FALL FESTIVAL October 3rd - October 25th! \n2025 SEASON PASSES AVAILABLE NOW\nHome\nTicket Info / Activities\n2025 Events\nField Trips\nParties & Events\nThe Maze\nAbout the Farm\nMORE\nFAQs\nFOOD TRUCK COURT 2024\nMore\nHome\nTicket Info / Activities\n2025 Events\nField Trips\nParties & Events\nThe Maze\nAbout the Farm\nMORE\nFAQs\nFOOD TRUCK COURT 2024\nHome\nTicket Info / Activities\n2025 Events\nField Trips\nParties & Events\nThe Maze\nAbout the Farm\nMORE\nFAQs\nFOOD TRUCK COURT 2024\nDownload Application\nCornmaze job application 2023\n(docx)\nDownload\nWe will be accepting applications via email to\nfarmgirls4ever@hotmail.com\n. We will contact you after we receive your application. Please contact Amanda at 904-710-6240 if you have any questions.\nOpportunities\nPumpkin Delivery and Setup\nPumpkin Delivery and Setup\nPumpkin Delivery and Setup\nWould you like to help unload and setup our pumpkins? This will be a 5 hour commitment. We do offer a free pass and pumpkin for anyone willing to help us. Please select the sign up button if interested. A confirmation text and email will be sent if selected.\nDates to be determined.\nPumpkin Delivery and Setup\nPumpkin Delivery and Setup\nEmployee Training Day\nPumpkin Delivery and Setup\nEmployee Training Day\nAre you previous employee who needs to sign up for our training days?\nhttps://book.peek.com/s/79db5309-8c89-4d8d-bfb4-25498d67cbf7/l7RDe\n2025 Events\nField Trips\nThe Maze\nAbout the Farm\nJoin our Team\nConner's A-Maize-Ing Acres\n19856 County Road 121 Hilliard, Fl 32046\n904-879-5453\n/\ninfo@connerscornmaze.com\nCopyright © 2019 Conner's A-Maize-Ing Acres by JandA Group - All Rights Reserved.\nUnder Florida law, an agritourism operator is not liable for injury or death of, or damage or loss to, a participant in an agritourism activity conducted at this agritourism location if such injury, death, damage, or loss results from the inherent risks of the agritourism activity. Inherent risks of agritourism activities include, among others, risks of injury inherent to land, equipment, and animals, as well as the potential for you to act in a negligent manner that may contribute to your injury, death, damage, or loss. You are assuming the risk of participating in this agritourism activity.\"\nBlessed shalt thou be when thou comest in,  and blessed shalt thou be when thou goest out.\"  Deut. 28:6\nPowered by",
      "emails": [
        "farmgirls4ever@hotmail.com",
        "info@connerscornmaze.com"
      ]
    },
    {
      "url": "http://www.connerscornmaze.com/2025-events",
      "is_candidate": false,
      "has_email": true,
      "text": "FALL FESTIVAL October 3rd - October 25th! \n2025 SEASON PASSES AVAILABLE NOW\nHome\nTicket Info / Activities\n2025 Events\nField Trips\nParties & Events\nThe Maze\nAbout the Farm\nMORE\nFAQs\nFOOD TRUCK COURT 2024\nMore\nHome\nTicket Info / Activities\n2025 Events\nField Trips\nParties & Events\nThe Maze\nAbout the Farm\nMORE\nFAQs\nFOOD TRUCK COURT 2024\nHome\nTicket Info / Activities\n2025 Events\nField Trips\nParties & Events\nThe Maze\nAbout the Farm\nMORE\nFAQs\nFOOD TRUCK COURT 2024\nExperience Conner's A-Maize-Ing Acres 2025 EVENTS\nWe’re excited for the 2025 season and are busy getting ready for all of you to have a farmtastic fun time!\n2025 Fall Festival at Conners A-Maize-Ing Acres\nPeaceful Friday - October 3rd\nOctober 3rd - 4pm to 10pm\nEscape the rush and discover a quieter, more enjoyable farm experience by visiting us on Fridays!\nBe the first to visit the farm this fall!\nOur farm is buzzing with excitement while offering you the tranquility you deserve.\nEnjoy a leisurely day filled with delicious bites from our food trucks, engage in delightful farm activities, and soak up the scenic surroundings. It's the ultimate blend of fun and relaxation, perfectly timed before the weekend crowds roll in. Whether it's a family outing or a solo adventure, Fridays at the farm are simply unbeatable. We hope to see you there soon!\nOpening Saturday - October 4th Fall Vendor Market & Grandparents Day\nToday we're celebrating the special bond between grandparents and grandchildren\nwith an exciting\nGrandparent's Day event from\n10am to 10 pm!\nWhat better way to honor this cherished relationship than with a day full of laughter and joy on the farm?\nGrandparents enter free when accompanied by their grandchildren, making it a wonderful opportunity for family bonding.\nOur event features a delightful\nVendor Market (10am to 4pm)\nwith a variety of mouth-watering options from food trucks, and farmtastic activities that guarantee a memorable day for all ages.\nWhether it’s enjoying the fresh air, indulging in tasty treats, or exploring the lively vendor stalls, there’s something for everyone. Don’t miss experiencing family fun at its finest—make sure to bring your loved ones for a picture-perfect day on the farm!\nPeaceful Fridays - October 10th & 17th\nOctober 10th - 4pm to 10pm\nOctober 17th - 4pm to 10pm\nEscape the rush and discover a quieter, more enjoyable farm experience by visiting us on Fridays!\nOur farm is buzzing with excitement while offering you the tranquility you deserve.\nEnjoy a leisurely day filled with delicious bites from our food trucks, engage in delightful farm activities, and soak up the scenic surroundings. It's the ultimate blend of fun and relaxation, perfectly timed before the weekend crowds roll in. Whether it's a family outing or a solo adventure, Fridays at the farm are simply unbeatable. We hope to see you there soon!\nRedneck Olympics - October11th\nOctober 11th from 10am to 10pm\nHeads up, fun-seekers!\nWe are thrilled to announce a full day of Farmtastic Fun with our upcoming\nRedneck Olympic Games\nscheduled from 11am to 2pm!\nWe’ve lined up a thrilling day filled with exciting farm activities and delectable treats from our diverse food trucks. Whether you’re in it to compete or just enjoy the spectacle, there is something for everyone.\nDon’t miss out on this unique experience that promises excitement, laughter, and a day to remember.\nBe sure to look out for our sign-up sheet going live in October to guarantee your spot in the fun!\nOctober 17th & 18th - Non Scary Sunset Wagon Rides\nReady for a magical adventure?\nBegin your evening at sunset and journey through the woods on a magical wagon ride!\nOn cloudless nights when the stars are beautifully bright and abundant, fall in love with the serenity & peacefullness  of the country.\nOctober 17th & 18th\nNon scary magical wagon rides\nPumpkinfest - October 18th\nMark your calendars for\nOctober 18th, 10am to 10pm\nand prepare for a day filled with excitement, flavors, and farm-inspired adventure! From 10 AM to 10 PM, our Farmtastic Farm offers a delightful mix of activities for all ages. Enjoy a diverse selection of food options from our mouth-watering food trucks, engage in exciting farm activities, and create memorable moments with your loved ones in a vibrant setting. Whether you're seeking a relaxing day outdoors or a family-friendly adventure, we have it all covered. Make sure to join us for this Farmtastic  day.\nField of Screams - October 24th\nAre you ready to face your fears?\nThe Field of Screams is back for two nights of heart-pounding excitement on\nOctober 24th and 25th, from dark until 10pm.\nThis exclusive reservation-only event promises to deliver terror beyond your wildest nightmares, featuring terrifying haunts and the best local food trucks to keep you fueled amidst the scares. Whether you're a thrill-seeker or just looking for an unforgettable night out, this is your chance to experience a terrifyingly good time.\nFall Fun Day - October 25th\nGet ready for an unforgettable family adventure at our\nTrick or Treat Scavenger Hunt\nOctober 25th, from 10 AM to 5 PM!\nThe first 200 kids will snag a goody bag, and our thrilling\nCostume Contest kicks off at 3 PM\nDon’t miss your chance to win!\nWith food trucks, exciting farm activities, and tons of Farmtastic Fun, there's something for everyone.\n~~~Daytime maze closes at 5pm~~~\nFor the brave-hearted, dare to enter the FIELD OF SCREAMS\nfrom dark to 10 PM (reservations required).\nSee you on the farm!\n(Field of Screams - RESERVATION ONLY\nDARK TO 10PM\nAutism and Related Disabilities Day - November 1st\nAutism and Related Disabilities Day - November 1st\nAutism and Related Disabilities Fun Day\nBrought to you by\nNortheast Florida Advocates for The Arc\nNassau\nNovember 1st—a special day crafted for families seeking a supportive and fun environment.\nThis unique event offers exclusive access to our farm, free from the usual crowds and distractions, ensuring a comfortable experience for everyone. Engage with the thoughtfully designed educational booths and explore the farm at your own pace. The event is strictly by reservation, and tickets will be available soon. Don’t miss this opportunity for your family to enjoy a day filled with fun, learning, and community connection. Stay tuned for ticket release and secure your spot for an unforgettable experience!\nPraise in the Maize - Nov 1st\nAutism and Related Disabilities Day - November 1st\nJoin us for\n\"Praise in the Maize\"\nSaturday, November 1st,  6 pm to 10 pm!\nImmerse yourself in an evening of uplifting praise and worship under a canopy of stars. This event offers more than just music; enjoy a live Praise & Worship band, a meaningful devotional message, and the farm's nighttime wonders, including a wagon ride\nand moonlit maze.\nGather around the campfire to roast marshmallows or savor s'mores, and treat your taste buds at our  selection of food, dessert, and coffee trucks available on-site.\nWhether you're drawn by the spiritual journey, the captivating activities, or simply the joy of community, this event promises something for everyone. Bring along family and friends for an inspiring night of connection and celebration. Admissions details will be announced soon – keep an eye out and join us as we light up the night with joy and praise!\nVeteran’s Day - Nov. 11th\nVeteran’s Day - Nov. 11th\nJoin us on November 11th, 10am to 2pm\nto honor the brave individuals who have served our country.\nOur Veterans Day celebration starts at 10 AM and offers a perfect blend of gratitude and entertainment.\nAt 11 AM, we'll be hosting a special ceremony to recognize the sacrifices of our Veterans, and you're invited\nto be a part of it.\nAfterward, immerse yourself in the festive atmosphere with a variety of food trucks ready to satisfy your cravings, and enjoy the farm activities designed\nfor both kids and adults.\nIt’s a day brimming with Farmtastic fun and community spirit.\nWe’d love to see you there.\nFREE ADMISSION for\nVeterans & Active Military, their spouses and dependent children.\nPeaceful Friday Tickets\nGeneral Admission Tickets\nField of Screams Tickets\nPraise in the Maize Tickets\nSeason Pass\n2025 Events\nField Trips\nThe Maze\nAbout the Farm\nJoin our Team\nConner's A-Maize-Ing Acres\n19856 County Road 121 Hilliard, Fl 32046\n904-879-5453\n/\ninfo@connerscornmaze.com\nCopyright © 2019 Conner's A-Maize-Ing Acres by JandA Group - All Rights Reserved.\nUnder Florida law, an agritourism operator is not liable for injury or death of, or damage or loss to, a participant in an agritourism activity conducted at this agritourism location if such injury, death, damage, or loss results from the inherent risks of the agritourism activity. Inherent risks of agritourism activities include, among others, risks of injury inherent to land, equipment, and animals, as well as the potential for you to act in a negligent manner that may contribute to your injury, death, damage, or loss. You are assuming the risk of participating in this agritourism activity.\"\nBlessed shalt thou be when thou comest in,  and blessed shalt thou be when thou goest out.\"  Deut. 28:6\nPowered by",
      "emails": [
        "info@connerscornmaze.com"
      ]
    },
    {
      "url": "http://www.connerscornmaze.com/parties-%26-events",
      "is_candidate": false,
      "has_email": true,
      "text": "FALL FESTIVAL October 3rd - October 25th! \n2025 SEASON PASSES AVAILABLE NOW\nHome\nTicket Info / Activities\n2025 Events\nField Trips\nParties & Events\nThe Maze\nAbout the Farm\nMORE\nFAQs\nFOOD TRUCK COURT 2024\nMore\nHome\nTicket Info / Activities\n2025 Events\nField Trips\nParties & Events\nThe Maze\nAbout the Farm\nMORE\nFAQs\nFOOD TRUCK COURT 2024\nHome\nTicket Info / Activities\n2025 Events\nField Trips\nParties & Events\nThe Maze\nAbout the Farm\nMORE\nFAQs\nFOOD TRUCK COURT 2024\nFarmtastic Birthdays and Special Events\nIn Season Birthday Parties\nWant to give your child a Birthday Party\nthey and their friends will be talking about forever?\nBook your party where the fun and good times never end!!!\n$450 for 30 people 3hrs. in our party barn area.\nYou and your guest are welcome to stay at the farm\nfrom the time it opens to closing.\n$10 each additional guest\nwagon ride, Cow train and Animal barn included.\nPay Deposit Here\nOff Season Birthday Parties\n$450 for 3hrs. for up to 50 people\n$10 each additional person $100 each additional hour.\nIncluded: Large covered barn with picnic tables & play area\nAdd Ons\nWagon ride - to feed the cows- $100\nCow train - to ride guest around the farm, see all the farm sights, visit and feed the animals at the barn $50\nFire pits- 2 fire pits , 2 s'mores per guest with attendant\n*Only available during cold months* $200\nHorse Rides * contact us for pricing\nPay Deposit here\nLARGE GROUPS & EVENTS   (Deposit $500.00)\nPay Deposit here\nPhoto Gallery\n2025 Events\nField Trips\nThe Maze\nAbout the Farm\nJoin our Team\nConner's A-Maize-Ing Acres\n19856 County Road 121 Hilliard, Fl 32046\n904-879-5453\n/\ninfo@connerscornmaze.com\nCopyright © 2019 Conner's A-Maize-Ing Acres by JandA Group - All Rights Reserved.\nUnder Florida law, an agritourism operator is not liable for injury or death of, or damage or loss to, a participant in an agritourism activity conducted at this agritourism location if such injury, death, damage, or loss results from the inherent risks of the agritourism activity. Inherent risks of agritourism activities include, among others, risks of injury inherent to land, equipment, and animals, as well as the potential for you to act in a negligent manner that may contribute to your injury, death, damage, or loss. You are assuming the risk of participating in this agritourism activity.\"\nBlessed shalt thou be when thou comest in,  and blessed shalt thou be when thou goest out.\"  Deut. 28:6\nPowered by",
      "emails": [
        "info@connerscornmaze.com"
      ]
    },
    {
      "url": "https://www.facebook.com/ConnersAmazingAcres/",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    }
  ],
  "all_links": [
    "http://www.connerscornmaze.com/about-the-farm",
    "http://www.connerscornmaze.com/ticket-info-%2F-activities",
    "http://www.connerscornmaze.com/food-truck-court-2024",
    "http://www.connerscornmaze.com/join-our-team-1",
    "http://www.connerscornmaze.com/2025-events",
    "http://www.connerscornmaze.com/the-maze",
    "http://www.connerscornmaze.com/ticket-info-%2F-activities#bea55a54-ae28-40f8-97ce-a0848b1ece4c",
    "http://www.connerscornmaze.com/",
    "http://www.connerscornmaze.com/field-trips",
    "https://connerscornmaze.com/tickets?olsPage=cart",
    "http://www.connerscornmaze.com/parties-%26-events",
    "http://www.connerscornmaze.com/faqs"
  ],
  "candidate_links": [
    "http://www.connerscornmaze.com/about-the-farm",
    "http://www.connerscornmaze.com/join-our-team-1",
    "http://www.connerscornmaze.com/2025-events",
    "http://www.connerscornmaze.com/parties-%26-events",
    "https://www.facebook.com/ConnersAmazingAcres/"
  ],
  "visited": [
    "http://www.connerscornmaze.com/",
    "http://www.connerscornmaze.com/about",
    "http://www.connerscornmaze.com/contact",
    "http://www.connerscornmaze.com/staff",
    "http://www.connerscornmaze.com/team",
    "http://www.connerscornmaze.com/board",
    "http://www.connerscornmaze.com/directory",
    "http://www.connerscornmaze.com/events",
    "http://www.connerscornmaze.com/sitemap.xml",
    "http://www.connerscornmaze.com/council",
    "http://www.connerscornmaze.com/leadership",
    "http://www.connerscornmaze.com/management",
    "http://www.connerscornmaze.com/producers",
    "http://www.connerscornmaze.com/support",
    "http://www.connerscornmaze.com/crew",
    "http://www.connerscornmaze.com/members",
    "http://www.connerscornmaze.com/bios",
    "http://www.connerscornmaze.com/people",
    "http://www.connerscornmaze.com/artists",
    "http://www.connerscornmaze.com/musicians",
    "http://www.connerscornmaze.com/faculty",
    "http://www.connerscornmaze.com/administration",
    "http://www.connerscornmaze.com/about-the-farm",
    "http://www.connerscornmaze.com/join-our-team-1",
    "http://www.connerscornmaze.com/2025-events",
    "http://www.connerscornmaze.com/parties-%26-events",
    "https://www.facebook.com/ConnersAmazingAcres/"
  ],
  "base_url": "http://www.connerscornmaze.com/"
}