{
  "pages": [
    {
      "url": "http://www.coppbrewery.com/about-us",
      "is_candidate": false,
      "has_email": true,
      "text": "Home\nAbout Us\nOnline Store\nMore\nHome\nAbout Us\nOnline Store\nHome\nAbout Us\nOnline Store\nWhy Copp? It's the family name.\nFran Copp\nBorn and raised in Pennsylvania, Fran is from generations of Copp farmers. Making his way to Crystal River, Florida after college, Fran became a math teacher.  He taught math and coached sports for the Citrus County School system until his retirement. Following his passion for math and beer, Fran was drawn to the science of brewing.  Over the years he honed his skills to produce traditional, award-winning craft beers and has continued to perfect his creations ever since.\nCopp Brewery and Winery\n2007\nCopp Winery, Inc. opened its doors to the public in June 2007, as both a winery and wine bar.  As such, Copp Winery is able to produce high quality wines and offer them for sale by both the bottle and glass at their Crystal River Florida location.   But there was something missing.  Many friends, family and neighbors had tasted and fell in love with the quality craft beers Fran Copp had been producing at home for years.\n2012\nIn November 2011, Copp Winery was granted a brewpub license by the state and received federal approval in March 2012.  It was the first and ONLY winery in the State of Florida to hold such distinction!  Copp added a microbrewery and it wasn't long before word and popularity spread.\n2013\nIn April 2013, Copp Winery and Brewery upgraded its brewpub license to a full brewery license. This enabled Copp to sell and fill growlers with their craft beer so patrons can enjoy that fresh from the tap taste at home & away.\n2014\nCopp Winery and Brewery enlarged its brewing system and began distribution of Copp Beer in April 2014.  Copp beer quickly found a place on tap at many local restaurants and bars and is now available throughout central and northern Florida.\n2016\nIn June 2016, Copp Winery Inc. Acquired a large stand-alone building on State Road 44 in Crystal River. It’s been a long process, but after nearly 6 years the new Copp Brewery and Winery location opened with the addition of a full-service restaurant, The Prohibition Grill.\nMay 2022 - new location in Crystal River, Florida opened.\nCopyright © 2024 Copp Winery and Brewery - All Rights Reserved.\nPowered by\nGoDaddy\nPrivacy Policy\nTerms and Conditions",
      "emails": [
        "luciano@latinotype.com"
      ]
    }
  ],
  "all_links": [
    "http://www.coppbrewery.com/about-us",
    "https://coppbrewery.com/online-store?olsPage=cart",
    "http://www.coppbrewery.com/photo-gallery",
    "http://www.coppbrewery.com/privacy-policy",
    "http://www.coppbrewery.com/terms-and-conditions",
    "http://www.coppbrewery.com/",
    "http://www.coppbrewery.com/online-store"
  ],
  "candidate_links": [
    "http://www.coppbrewery.com/about-us"
  ],
  "visited": [
    "http://www.coppbrewery.com/",
    "http://www.coppbrewery.com/about",
    "http://www.coppbrewery.com/contact",
    "http://www.coppbrewery.com/staff",
    "http://www.coppbrewery.com/team",
    "http://www.coppbrewery.com/board",
    "http://www.coppbrewery.com/directory",
    "http://www.coppbrewery.com/events",
    "http://www.coppbrewery.com/sitemap.xml",
    "http://www.coppbrewery.com/council",
    "http://www.coppbrewery.com/leadership",
    "http://www.coppbrewery.com/management",
    "http://www.coppbrewery.com/producers",
    "http://www.coppbrewery.com/support",
    "http://www.coppbrewery.com/crew",
    "http://www.coppbrewery.com/members",
    "http://www.coppbrewery.com/bios",
    "http://www.coppbrewery.com/people",
    "http://www.coppbrewery.com/artists",
    "http://www.coppbrewery.com/musicians",
    "http://www.coppbrewery.com/faculty",
    "http://www.coppbrewery.com/administration",
    "http://www.coppbrewery.com/about-us"
  ],
  "base_url": "http://www.coppbrewery.com/"
}