{
  "pages": [
    {
      "url": "http://www.cypressrun.com/contact",
      "is_candidate": false,
      "has_email": true,
      "text": "#bannerText\n#bannerImage\nLeave a Message\nWe want to hear from you! Your questions and concerns are of the utmost importance to us. Please use the form to request additional information about our course, services and promotions. We’d also like to encourage you let us know how we’re doing.\nFirst Name\n*\nLast Name\n*\nEmail\n*\nPhone Number\n*\nComments\nContact Us\nCypress Run Golf Club\n2669 St Andrews Blvd Tarpon Springs, FL 34688\nPhone:\n(727) 938-3774\nPro Shop:\n(727) 937-3191\nGrille Room:\n(727)\n888-3078\nsteve.martin@cypressrun.com\n#content",
      "emails": [
        "shaun.mccormick@cypressrun.com",
        "steve.martin@cypressrun.com"
      ]
    },
    {
      "url": "http://www.cypressrun.com/membership",
      "is_candidate": false,
      "has_email": true,
      "text": "Membership\n#bannerText\n#bannerImage\nMembership Information\nFrom the layout of the property to the attitude of the membership, love of the game is paramount.\nAt Cypress Run Golf Club, our commitment to the love of the game is not just a philosophy – it's the very essence of who we are.\nOur meticulously designed course is a testament to our dedication to golf in all its forms. With every golfer in mind, we've crafted a course that accommodates every level of ability. From the championship tees, the course stretches to an impressive 7,001 yards, setting the stage for tournament-level play. For those who seek a slightly gentler challenge, our forward tees bring the course's length to a more approachable 5,372 yards without sacrificing the essence of the game.\nWe also have a Toptracer Driving Range where you can do everything from work on your game to bring your game to a new level or play a casual round of virtual golf on iconic golf courses such as Pebble Beach and St. Andrews.\nWhether you're a seasoned pro or a newcomer to the sport, our course and facilities offer an experience tailored to your skill and enjoyment. Join us at Cypress Run Golf Club, where the love of the game thrives at every tee.\nFull Golf Membership\nLimited Availability\nFull Golf Members are extended Full Privileges of the Golf Course, Toptracer Range and Clubhouse.\nFull Golf Members are subject to an Initiation Fee and Monthly Dues as published in the Club’s Fee Schedule.\nFull Golf Membership is offered in both Single and Family Plans. Family Plans included Spouse or significant other and all children residing in the home 23 years of age and under.\nFull Golf Members may make tee times up to fourteen (14) days in advance.\nFull Golf Members may host guests and pay the customary Guest of Member rate\nYoung Associate Membership\nLimited Availability to those that are 40 and under years of age.\nYoung Associate Golf Members are extended Full Privileges of the Golf Course, Toptracer Range and Clubhouse.\nYoung Associate Members are subject to an Initiation Fee and Monthly Dues as published in the Club’s Fee Schedule.\nThe Young Associate Golf Membership is offered in both Single and Family Plans. Family Plans included Spouse or significant other and all children residing in the home 23 years of age and under.\nYoung Associate Golf Members may make tee times up to fourteen (14) days in advance.\nYoung Associate Members may host guests and pay the customary Guest of Member rate\nExecutive Golf Membership\nLimited Availability\nExecutive Members have unlimited use of the Golf Course, Toptracer Range and Clubhouse.\nExecutive Members are subject to an Initiation Fee and Monthly Dues as published in the Club’s Fee Schedule.\nThe Executive Membership is an Individual Membership that includes family Clubhouse access.\nExecutive Members may make tee times up to seven (7) days in advance.\nExecutive Members will be charged the Executive Rate which includes Green Fees and Cart Fees.\nExecutive Members may host guests and pay the customary Guest of Member rate.\nExecutive Members may play in a limited number of Club Plaque Events at the Executive rate.\nSocial Membership\nLimited Availability\nSocial Members are extended unlimited use of the Clubhouse.\nSocial memberships are subject to an Initiation Fee and Monthly Dues as published in the Club’s Fee Schedule.\nSocial Members may play golf three times a calendar year at the customary Guest of member rate.\nTennis & Pickleball Social Membership\nLimited Availability\nTennis Members are Social Members and have unlimited use of the Tennis & Pickleball Courts and Clubhouse.\nTennis Members are subject to an Initiation Fee and Monthly Dues as published in the Club’s Fee Schedule.\nThe Tennis Membership is a Family Membership that includes family Clubhouse access.\nTennis Members have limited access to the Toptracer range and Golf Course six times a year.\nTennis Members may make court times up to seven (7) days in advance.\nTennis Members may host guests and pay the customary Guest of Member rate.\nPickleball Only with Social Membership option available\nMemberships do not have a Food and Beverage Minimum an\nd will not be charged Operating Assessments.\n#content",
      "emails": [
        "steve.martin@cypressrun.com"
      ]
    },
    {
      "url": "http://www.cypressrun.com/membership/what-members-are-saying",
      "is_candidate": false,
      "has_email": true,
      "text": "#bannerText\n#bannerImage\nWhen I’m not busy chasing after receivers and another Superbowl ring, I love to spend time here at my club. You can’t find a more generous and helpful staff anywhere in the area, and Cypress Run’s family oriented nature makes it a touchdown with my wife and kids.\n– Ronde Barber – All Pro Cornerback, Tampa Bay Buccaneers\nCypress Run is where great golf begins and lasting friendships are made.\n– Mary Kohlbry\nI’ve lived in Cypress Run for 20 years, and never get tired of playing the course. It’s always a challenge with alot of character, and always in great shape. If you can play well here, you can play anywhere with confidence.\n– Ron May – Financial Advisor\nCypress Run is about much more than it’s exceptional golf course. It is also about a warm, welcoming Membership and a total Golf Club experience.\n– Dick Dempster – Former President & CEO of Black and Decker\nGREAT COURSE!!! Best conditioned course in all of Tampa Bay.\n– Mike Sollinger – Former President Property Advisors\nI’ve been a member of Cypress Run for 30 years. I choose to be here because of the pristine fairways, greens that roll true and the course challenge that make this one of the best golf experiences in the entire Tampa Bay area.\n– Ron Salhany\nAs new golfers in 1996, my husband and I searched half of Pinellas County for a golf club. We were taken by Cypress Run’s pristine golf course and the quality dining at the clubhouse. In a very short time we discovered the camaraderie of the Cypress Run members! We were immediately welcomed by many and soon had so many new friends that the club became a major part of our social life. With an extremely active women’s association that caters to both high and low handicappers alike, an active couples program, and superb teaching Professionals, both of us felt we had made the right choice. Now, fourteen years later, we’re sure we did!\n– Bob & Dean La Ferriere\n#content",
      "emails": [
        "steve.martin@cypressrun.com"
      ]
    },
    {
      "url": "http://www.cypressrun.com/dining-and-special-events",
      "is_candidate": false,
      "has_email": true,
      "text": "Weddings\n#bannerText\n#bannerImage\nWhether you are planning a Bridal Luncheon, Shower, Rehearsal Dinner, Wedding Ceremony, Reception or another special occasion, Cypress Run Golf Club can handle every detail. Our personalized approach allows us to tailor your special day to your exact specifications capitalizing on your wants, needs and desires.  We do not merely want to meet your expectations; our goal is to exceed them.\nFind Us On\nQuotes from Cypress Run Brides and Grooms\nThank you so much for all you did to make our wedding so very special. Who says you need months to arrange a wedding? With your amazing assistance it was done in four days! Everything from the outdoor setting, to the music, to the food and flowers was perfect! We really can’t thank you enough. We received so many compliments all due to your excellent recommendations. Please thank your staff for all of their help too.\n– Sincerely Anne & Don\nI wanted to thank you for such an incredible day and so many great memories, it was truly a dream come true and a perfect wedding! Thank you so much for helping put it all together, what a pleasure it was to work with you and the Cypress Run team.\n– Mrs. Emily Hall (just because I can sign my name like that now, haha!)\nThanks again for everything! Both the rehersal and wedding events went off without a hitch! You even got the weather to be just perfect! We appreciate all you did to help make Andy and Emily’s wedding a very special event.\n– Adele & Robie\nThank you, Thank you, Thank you, everything was just wonderful. We heard nothing but praises from our guests and the food was even better than we sampled at our tasting. The room was perfect and every detail was taken care of. The treats in the room where I and my bridesmaids got ready was a very nice surprise  thank you. We will be recommending Cypress Run to all of our friends who wish to have the very best.\n– Petra & David\nWords cannot convey the absolutely amazing time we had last night at the\nwedding\n. You and the entire team at Cypress Run were the talk of the town. From the service, to the smiles, food and drink, EVERYONE is raving! We have some very picky (and sometimes snooty) people and all they could do was express how phenomenal the event was. The amount of effort and care in the help of decorating was so kind and I was especially grateful. The service staff was spectacular! They went out of their way to make us feel like royalty and it was especially heartwarming and awesome for me to finally breathe and take it all in. Dan, our personal attendant was beyond. Keep him, keep him! The bartenders, servers…ALL are incredible! You…I’m sending extra big hugs filled with gratitude for going above and beyond to make sure I was happy. Thank you is genuinely not enough and you deserve a raise! The chef was SPECTACULAR! Every single person wants the bruschetta! And the chicken…the steak…for the few bites I had…it was perfection.\nThank you for creating my vision and making it the best night of our lives!\n- Christine NOETHEN!\nThank you so much to everyone at Cypress Run for making our day so special. They were very helpful and made it a stress free process. The day was perfect and everyone had fantastic time. Also the food was delicious several people told me it was the best catered meal that they have had at wedding. Robin was so thoughtful and packed two meals and cake for us to take home after the wedding.\nThank you for everything,\n– Carie and Joe Ricardo\nMy wedding at cypress run was so much more than I could have imagined! Cypress run was so flexible with everything! My wedding was stress free from start to finish! All my guests had such a great time and the food so delicious and everything was more than we could have asked for!!\n– Jaclyn\nWedding Request\nFirst Name\n*\nLast Name\n*\nEmail\n*\nPhone Number\n*\nComments\n#content",
      "emails": [
        "steve.martin@cypressrun.com"
      ]
    }
  ],
  "all_links": [
    "http://www.cypressrun.com/golf/course-tour",
    "http://www.cypressrun.com/awards",
    "http://www.cypressrun.com/golf/top-tracer",
    "http://www.cypressrun.com/member-login",
    "http://www.cypressrun.com/contact",
    "http://www.cypressrun.com/golf/scorecard",
    "http://www.cypressrun.com/golf/the-golf-shop",
    "http://www.cypressrun.com/dining-and-special-events/weddings",
    "http://www.cypressrun.com/membership",
    "http://www.cypressrun.com/",
    "http://www.cypressrun.com/dining-and-special-events/member-dining",
    "http://www.cypressrun.com/golf/practice-facilities",
    "http://www.cypressrun.com/golf/golf-course-designer",
    "http://www.cypressrun.com/tennis-and-pickelball",
    "http://www.cypressrun.com/golf/course-history",
    "http://www.cypressrun.com/membership/what-members-are-saying",
    "http://www.cypressrun.com/dining-and-special-events",
    "mailto:steve.martin@cypressrun.com",
    "http://www.cypressrun.com/golf",
    "mailto:shaun.mccormick@cypressrun.com"
  ],
  "candidate_links": [
    "http://www.cypressrun.com/contact",
    "http://www.cypressrun.com/membership",
    "http://www.cypressrun.com/membership/what-members-are-saying",
    "http://www.cypressrun.com/dining-and-special-events"
  ],
  "visited": [
    "http://www.cypressrun.com/",
    "http://www.cypressrun.com/about",
    "http://www.cypressrun.com/contact",
    "http://www.cypressrun.com/staff",
    "http://www.cypressrun.com/team",
    "http://www.cypressrun.com/board",
    "http://www.cypressrun.com/directory",
    "http://www.cypressrun.com/events",
    "http://www.cypressrun.com/sitemap.xml",
    "http://www.cypressrun.com/council",
    "http://www.cypressrun.com/leadership",
    "http://www.cypressrun.com/management",
    "http://www.cypressrun.com/producers",
    "http://www.cypressrun.com/support",
    "http://www.cypressrun.com/crew",
    "http://www.cypressrun.com/members",
    "http://www.cypressrun.com/bios",
    "http://www.cypressrun.com/people",
    "http://www.cypressrun.com/artists",
    "http://www.cypressrun.com/musicians",
    "http://www.cypressrun.com/faculty",
    "http://www.cypressrun.com/administration",
    "http://www.cypressrun.com/contact",
    "http://www.cypressrun.com/membership",
    "http://www.cypressrun.com/membership/what-members-are-saying",
    "http://www.cypressrun.com/dining-and-special-events"
  ],
  "base_url": "http://www.cypressrun.com/"
}