{
  "pages": [
    {
      "url": "https://dunedinfilmfestival.org/contact-us",
      "is_candidate": false,
      "has_email": true,
      "text": "8th Annual Dunedin International Film Festival - January 22nd - 25th, 2026\nHome\nAbout Us\nBecome a Member\nSponsor\nTickets\nAccommodations\nContact Us\nAward Winners\nVolunteer\nDunedin Youth FIlm School\nMore\nHome\nAbout Us\nBecome a Member\nSponsor\nTickets\nAccommodations\nContact Us\nAward Winners\nVolunteer\nDunedin Youth FIlm School\nSign In\nCreate Account\nMy Account\nSigned in as:\nfiller@godaddy.com\nMy Account\nSign out\nSigned in as:\nfiller@godaddy.com\nHome\nAbout Us\nBecome a Member\nSponsor\nTickets\nAccommodations\nContact Us\nAward Winners\nVolunteer\nDunedin Youth FIlm School\nAccount\nMy Account\nSign out\nSign In\nMy Account\nContact Us\nGet involved!\nName\nEmail*\nWhere did you hear about us?\nSend\nThis site is protected by reCAPTCHA and the Google\nPrivacy Policy\nand\nTerms of Service\napply.\nFind more ways to help!\nA nonprofit is as strong as the community that holds it up. Together, we can do more than we can do alone. Let's bring our abilities and passions together to make art real.\nThere are many ways to join us and support our mission. Contact us to find out  more about volunteer opportunities, fundraising events, and ways that you can get  our message to your friends and family.\nDunedin Film Festival Inc.\nHOB Brewing Co., Huntley Avenue, Dunedin, FL, USA\n(407) 491-7576\nSubscribe\nLearn more about our upcoming events, fundraisers, and more!\nEmail Address\nSign up\nBrought to you by Dunedin Film Festival\nDunedin, Florida - Home of the Toronto Blue Jays Spring Training\nCopyright © 2026 Dunedin Film Festival Inc. - All Rights Reserved.\nPowered by",
      "emails": [
        "dave@lab6.com",
        "filler@godaddy.com",
        "info@indiantypefoundry.com"
      ]
    },
    {
      "url": "https://dunedinfilmfestival.org/about-us",
      "is_candidate": false,
      "has_email": true,
      "text": "8th Annual Dunedin International Film Festival - January 22nd - 25th, 2026\nHome\nAbout Us\nBecome a Member\nSponsor\nTickets\nAccommodations\nContact Us\nAward Winners\nVolunteer\nDunedin Youth FIlm School\nMore\nHome\nAbout Us\nBecome a Member\nSponsor\nTickets\nAccommodations\nContact Us\nAward Winners\nVolunteer\nDunedin Youth FIlm School\nSign In\nCreate Account\nMy Account\nSigned in as:\nfiller@godaddy.com\nMy Account\nSign out\nSigned in as:\nfiller@godaddy.com\nHome\nAbout Us\nBecome a Member\nSponsor\nTickets\nAccommodations\nContact Us\nAward Winners\nVolunteer\nDunedin Youth FIlm School\nAccount\nMy Account\nSign out\nSign In\nMy Account\nFounded in 2018, the Dunedin International Film Festival (DIFF) is dedicated to celebrating the art of filmmaking and fostering a vibrant cultural exchange in the heart of Dunedin, Florida. Bringing together filmmakers, artists, and film enthusiasts from across the globe, DIFF showcases diverse, thought-provoking films that inspire conversation, creativity, and community connection. Our festival is a platform for independent filmmakers to share their unique voices, while also creating opportunities for local talent to shine.\nThe festival is fueled by a passionate team of industry professionals, including production experts, directors, and artists, who are committed to growing the film industry in Dunedin and the surrounding areas. From the support of community-driven volunteers to the leadership of seasoned filmmakers and creative directors, DIFF is a hub for innovation, collaboration, and artistic expression. Whether you're a filmmaker, an enthusiast, or simply a lover of great stories, the Dunedin International Film Festival invites you to experience the magic of cinema in a welcoming and inspiring environment.\nBoard of Directors\nMonique McLaughlin\nMonique McLaughlin\nMonique McLaughlin\nMonique McLaughlin\n, a seasoned makeup and hair veteran, brings a wealth of experience to the Dunedin Film Festival board. Her impressive portfolio spans print, television, commercial, and film, showcasing her talent across diverse platforms. Known for her versatility and ability to work with all skin tones and hair textures, Monique excels on set, often completing and transitioning looks with remarkable speed. Her expertise and creativity make her a valuable asset to the festival and the film community.\nStef Simach\nMonique McLaughlin\nMonique McLaughlin\nStef Simach\nis the host of the Dunedin Film Festival Podcast and a board member of the Dunedin Film Festival. With over 10 years of experience in business strategy and culture coaching, Stef helps organizations align people and profits through purposeful, transformative change.\nStef developed the concept of “Change Experience,” a method focused on growth through self-discovery and evolution. By fostering inclusive, resilient cultures, Stef empowers individuals and teams to break through limitations and make lasting, impactful change.\nVicky Van Winkle\nMonique McLaughlin\nVicky Van Winkle\nVicky Van Winkle\nis a versatile artist and live model, contributing to the fine arts community through her work and offering her form as inspiration for other artists. Her passion for creative expression extends into cinema, where she is both an avid film lover and a knowledgeable critic.\nAs a board member of the Dunedin International Film Festival, Vicky plays an active role in supporting international cinema and bringing unique film experiences to her local community. Her involvement with the festival highlights her commitment to the arts and her dedication to fostering a love for independent and foreign films.\nDavid Brownlow\nAvi Feddergreen\nVicky Van Winkle\nDavid Brownlow\nis an Amerian sound engineer. He has experience in all forms of production sound recording for film and television having worked for major studios, cable networks, TV news, independent production companies, and on commercials. At the 47th Primetime Emmy Awards in 1995 Brownlow was awarded with the Emmy for Outstanding Sound Mixing for a Drama Miniseries or a Special for their work on \"Buffalo Girls\". He has worked on such films as\nHoosiers\n(1986),\nWhat's Eating Gilbert Grape\n(1993), and\nIn the Valley of Elah\n(2007). Brownlow and his fellow sound engineers\nAndy Koyama\nand\nBeau Borders\nare nominated for an Academy Award for Best Sound for the 2013 film\nLone Survivor\n.\nJaime Witt\nAvi Feddergreen\nAvi Feddergreen\nJaime Witt, Treasurer of the Dunedin International Film Festival,\nbrings more than 20 years of expertise in Accounting and Business, with the last decade dedicated to running her own firm specializing in tax, nonprofit, and small business accounting. She earned her bachelor’s degree in Accounting and Business Administration from the University of South Florida and holds a PHR certification in Human Resources, blending financial insight with organizational leadership.\nAlongside her professional accomplishments, Jaime has a deep appreciation for filmmaking and the power of storytelling. She is inspired by the way ideas evolve into unique works of art and is committed to helping DIFF grow its local and international presence while highlighting the creativity of new and emerging filmmakers.\nAvi Feddergreen\nAvi Feddergreen\nAvi Feddergreen\nAvi Federgreen\nhas over thirty years of experience in the Canadian film industry, producing more than seventy films, including\nHome Free\n,\nOne Week\n, and\nClapboard Jungle\n. He created the Indiecan10K & Indiecan20K First Feature Initiatives, helping produce eight first features in Canada. Federgreen has also directed a short film,\nRed Balloon\n, two MOWs, and two network TV episodes, with his feature\nHome Free\nnow submitted to festivals.\nIn 2011, Federgreen founded Indiecan Entertainment and later launched Red Water Entertainment in 2022, focusing on genre films. In 2024, he introduced Pride Pictures, dedicated to LGBTQ2S+ films. With over 200 films released in Canada and 100 in the U.S., his companies continue to thrive, and Indiecan Entertainment International now handles international sales.\nJulie Chalhoub\nJanette Donoghue\nJanette Donoghue\nJulie Chalhoub\nis an accomplished broadcast television editor and award-winning documentary editor. She has worked across various genres, known for her ability to craft compelling, emotionally resonant stories. Julie is also a board member for the Sunscreen Film Festival and the Dunedin International Film Festival, supporting independent filmmakers and promoting the arts.\nPassionate about animals, especially dogs, Julie actively supports local rescue organizations through donations and advocacy. Her dedication to both her career and community reflects her commitment to making a positive impact.\nJanette Donoghue\nJanette Donoghue\nJanette Donoghue\nJanette Donoghue\nis a dedicated philanthropist and community member actively involved with the Dunedin Film Festival and the Dunedin Chamber of Commerce. As an events coordinator, she focuses on initiatives that promote arts and culture, enriching the local community. Her passion for non-profit organizations drives her commitment to fostering creative projects that benefit Dunedin. Janette's efforts not only support the festival but also strengthen the cultural fabric of the community she loves.\nAngela Kennedy\nJanette Donoghue\nAngela Kennedy\nAngela Kennedy\nis a board member of the Dunedin Film Festival, bringing a diverse background in human resources to her role. She currently serves as an HR Consultant at MammothHR and HRAnswerLink, and has experience as an HR Generalist at Kass Shuler Law Firm and as a Recruiting Specialist at HSN. Angela holds a B.A. in English Literature and Criminology from the University of South Florida, where she graduated in 2004. Originally from Tampa, Florida, she is passionate about supporting the arts and community through her involvement in the festival.\nBoard of Directors\nCameron Ilan\nJesika Freeman\nJesika Freeman\nCameron Ilan\nis the President & Director of Programming for the Dunedin Film Festival. Cameron’s passion for filmmaking began at a young age, growing up on film sets in Orlando, Florida, during the 1980s and 1990s. With a rich foundation in the world of cinema, she went on to serve on the board of directors for the Downtown Los Angeles Film Festival while also working in luxury brand advertising in Hollywood, CA. Today, Cameron is the President and Director of Programming for the Dunedin Film Festival, where she continues to share her extensive expertise and love for film with audiences and filmmakers alike.\nJesika Freeman\nJesika Freeman\nJesika Freeman\nJesika Freeman is the\nChair of the Board for the Dunedin Film Festival. She is a proud resident of Dunedin for over a decade, Jesika Freeman brings her deep passion for community service to the Dunedin Film Festival as the Chair of the Board. With a warm and welcoming presence, she plays a key role at the Box Office, where she greets filmmakers, visitors, and locals alike, creating an inviting atmosphere for all who experience the festival. Beyond her work with the film festival, Jesika serves on the Auxiliary Board of VFW Post 2550, where she actively supports veterans and their families, further demonstrating her dedication to service and her beloved community of Dunedin.\nPaul Cook\nJesika Freeman\nKatie Ducharme Processi\nPaul Cook\n, also known as DJ BackBone, is a prominent figure in Pinellas County's music scene, hosting specialty music nights and running MultiPlayer Agency, where he specializes in creating Instant Parties and enhancing private and corporate events. In addition to his event work, Paul teaches music theory to aspiring DJs at local schools. He also serves as the Treasurer of the Dunedin Film Festival, where he brings his expertise in organization and passion for the arts to the table.\nKatie Ducharme Processi\nKatie Ducharme Processi\nKatie Ducharme Processi\nKatie Ducharme Processi\nhas been performing professionally since the age of six, with a career spanning both singing and acting. In addition to her work as an actor, she is a licensed realtor. Katie is also an active member of the Architectural Review Committee for the City of Dunedin and has proudly served as the official National Anthem singer for the Toronto Blue Jays Spring Training since 2014, where she performs both the Canadian and American Anthems.\nDina Smeltz\nKatie Ducharme Processi\nBlair Barnette\nDina Smeltz\nserves as the Secretary of the Dunedin Film Festival. A public opinion polling expert, she is the Vice President of Public Opinion and Foreign Policy at the Chicago Council on Global Affairs. A proud Dunedin resident, Dina studied Russian and East European politics and history at the University of Michigan, where she developed a deep appreciation for the power of impactful films.\nBlair Barnette\nKatie Ducharme Processi\nBlair Barnette\nLondon-based Production Designer\nBlair Barnette\nhas designed and art directed major film and television productions across the UK, USA, and Europe. Currently, she serves as the Chair of the British Film Designers Guild, a committee member of Artscenico, and is also a member of Women in Film and TV, contributing her expertise and passion to the industry on an international scale.\nYhali Ilan\nJustin Catacchio\nSeth Walker\nYhali Ilan\nis the creative art director of the Dunedin Film Festival and is widely recognized for his caricature and mural work in Downtown Dunedin, Florida. As the founder of the Dunedin Art Cave, Yhali is a leading figure in the city’s art scene, driving creative projects and art initiatives throughout Dunedin. His vibrant murals can be seen at locations such as Blur Nightclub, the Pinellas Art Cave, and Bon Appétit, contributing to the city's dynamic artistic landscape.\nSeth Walker\nJustin Catacchio\nSeth Walker\nSeth Walker\nis a content creator for Dunedin and Dunedin TV, and a lifelong resident dedicated to supporting the growing film industry in his hometown. Seth produces, writes, and directs Florida local films, bringing his passion for storytelling and his commitment to the local film community to every project he undertakes.\nJustin Catacchio\nJustin Catacchio\nJustin Catacchio\nJustin Catacchio\nis a television, stage, and motion picture production professional based in Dunedin, Florida. He hosted and produced\nGood Morning Dunedin\nfor DunedinTV and has nurtured a lifelong love for cinema, which has fueled his enthusiasm for the Dunedin International Film Festival since its inception.\nKim Kenda\nAusten Van Der Bleek\nJustin Catacchio\nKim Kenda\nbrings a strong background in multimedia communications, making her an invaluable asset to the Dunedin International Film Festival. Her passion for cinema drives her dedication to showcasing diverse films, and she believes in the power of film to foster community connections and inspire meaningful dialogue.\nAusten Van Der Bleek\nAusten Van Der Bleek\nAusten Van Der Bleek\nAusten van der Bleek\nis the Creative Director of Open House Conspiracy, with a deep dedication to his craft that earned him the title of 'Best Club DJ' in the 2019\nBest of the Bay\nawards. Austen has performed at renowned events such as SXSW, Detroit’s Movement Electronic Music Festival, Hulaween, and Okeechobee Music & Arts Festival, establishing himself as a prominent figure in the electronic music scene.\nIris Reyes\nAusten Van Der Bleek\nAusten Van Der Bleek\nIris Reyes\nis a filmmaker based in Pinellas County and a member of WIFT-Tampa Bay. With career experience as a director, 1st AD, and script supervisor, Iris brings a wealth of knowledge to the film industry. Passionate about strengthening the film community in Florida, she volunteers her time to support local projects. Her expertise lies in production coordination, production management, and locations. Iris is also the president of the Tampa Bay Latin International Film Festival, where she leads efforts to highlight diverse voices in cinema.\nBrought to you by Dunedin Film Festival\nDunedin, Florida - Home of the Toronto Blue Jays Spring Training\nCopyright © 2026 Dunedin Film Festival Inc. - All Rights Reserved.\nPowered by",
      "emails": [
        "dave@lab6.com",
        "filler@godaddy.com",
        "info@indiantypefoundry.com"
      ]
    },
    {
      "url": "https://www.facebook.com/diffestival",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    }
  ],
  "all_links": [
    "https://dunedinfilmfestival.org/award-winners",
    "https://dunedinfilmfestival.org/tickets",
    "https://dunedinfilmfestival.org/volunteer",
    "https://dunedinfilmfestival.org/dunedin-youth-film-school",
    "https://dunedinfilmfestival.org/become-a-member",
    "https://dunedinfilmfestival.org/contact-us",
    "https://dunedinfilmfestival.org/m/account",
    "https://dunedinfilmfestival.org/accommodations",
    "https://dunedinfilmfestival.org/m/create-account",
    "https://dunedinfilmfestival.org/sponsor",
    "https://dunedinfilmfestival.org/about-us",
    "https://dunedinfilmfestival.org/"
  ],
  "candidate_links": [
    "https://dunedinfilmfestival.org/contact-us",
    "https://dunedinfilmfestival.org/about-us",
    "https://www.facebook.com/diffestival"
  ],
  "visited": [
    "https://dunedinfilmfestival.org/",
    "https://dunedinfilmfestival.org/about",
    "https://dunedinfilmfestival.org/contact",
    "https://dunedinfilmfestival.org/staff",
    "https://dunedinfilmfestival.org/team",
    "https://dunedinfilmfestival.org/board",
    "https://dunedinfilmfestival.org/directory",
    "https://dunedinfilmfestival.org/events",
    "https://dunedinfilmfestival.org/sitemap.xml",
    "https://dunedinfilmfestival.org/council",
    "https://dunedinfilmfestival.org/leadership",
    "https://dunedinfilmfestival.org/management",
    "https://dunedinfilmfestival.org/producers",
    "https://dunedinfilmfestival.org/support",
    "https://dunedinfilmfestival.org/crew",
    "https://dunedinfilmfestival.org/members",
    "https://dunedinfilmfestival.org/bios",
    "https://dunedinfilmfestival.org/people",
    "https://dunedinfilmfestival.org/artists",
    "https://dunedinfilmfestival.org/musicians",
    "https://dunedinfilmfestival.org/faculty",
    "https://dunedinfilmfestival.org/administration",
    "https://dunedinfilmfestival.org/contact-us",
    "https://dunedinfilmfestival.org/about-us",
    "https://www.facebook.com/diffestival"
  ],
  "base_url": "https://dunedinfilmfestival.org/"
}