{
  "pages": [
    {
      "url": "https://eventsbydubsdread.com/events-by-dubsdread-home/events-by-dubsdread-about/",
      "is_candidate": false,
      "has_email": true,
      "text": "Why Choose Us\nEvents by Dubsdread is Orlando’s premier catering and event services company, delivering Culinary Excellence served with Southern Charm. Our team’s diverse background and extensive experience mean that every aspect of your event is in expert hands. We collaborate closely with you to bring your dreams to life, ensuring a seamless and stress-free experience. From planning to execution, we are committed to excellence, making your special day truly unforgettable.\nOur Team\nOur team brings over a century of combined experience to ensure your wedding or event is nothing short of incredible. Meet the talented individuals whose expertise and dedication will make your special day unforgettable.\nCarissa Llewellyn-Burns\nDirector of Operations\nCarissa joined the company in 2013. A communications and journalism graduate of Shippensburg University, she moved from Pennsylvania to Florida for sunshine and job opportunities. She began her career with Dubsdread as a banquet server and has worked her way through every position in the office to learn each aspect of the operation and is proud to be part of the amazing team. When she is not at work, Carissa enjoys time with her husband, Tyler, her crazy kiddos Connor and Cameron and her fur child, Roxy.\nChristiana Bullard\nBanquet Sales Manager\nAn Orlando native and a UCF graduate, Christiana worked in advertising before joining Dubsdread in 2005. She found the hospitality industry far more entertaining and mentally stimulating. Christiana enjoys humorous clients, problem-solving, and working with great colleagues. When she is not at work, she enjoys watching UCF football, going to the gym and spending time with her three “kids:” her daughter, husband and dog.\nDavid Osmola\nSenior Wedding & Event Coordinator\nDavid joined the Dubsdread team in 2008 and is our Senior Wedding and Event Coordinator. Before coming on board, he worked in customer service positions in the wedding and airline industries. David strives to make every bride’s dream a reality, allowing his attention to detail and customer service skills to shine through. When he is not at work, David enjoys spending time with his friends and his dog, Sweet Pea, and visiting family in Michigan.\nMichelle Edmiston\nEvent Specialist/Sales Representative\nMichelle joined the team in 2017 and wears many hats, managing the property at The Highland Manor being one of them.  She grew up working in a family friend’s restaurant and expanded that knowledge working at country clubs, event venues, hotels and stadiums. After nearly three decades, she still loves helping her client's vision become a reality. When Michelle is not planning an event, she spends time with her husband Jay, son Blake, two rescue dogs and her vast extended family.\nShanna Paris\nEvent Specialist/Sales Representative\nShanna has been at Dubsdread since 2017. An Event Management graduate of the University of Central Florida’s Rosen College of Hospitality, she began her career with local wedding and destination event management companies. Since 2000, Shanna has planned weddings and events throughout the Orlando area, helping planners worldwide execute their corporate gatherings. At Dubsdread, she can focus on her passion to help brides make their day unique and personal. Shanna enjoys time with her four favorite guys when she’s not at work: her dog Giggsy, her sons Liam and Alfie and her husband Josh.\nPeighton Ballant\nEvent Specialist/Sales Representative\nPeighton is a native of Orlando and joined Dubsdread in 2018. In 2021, she earned her Event Management degree at the University of Central Florida’s Rosen College of Hospitality. Before joining the events team, Peighton was a hostess at The Tap Room at Dubsdread. Peighton enjoys working with prospective brides to discover what they are most interested in bringing to their special day and how to make those ideas come to life. When not at work, she enjoys caring for Dexter, her cat-child, going to the beach, hanging out with friends, and being a UCF Knight football fan.\nRoxy Llewellyn-Burns\nEBanquet Operations Ambassador\nRoxy joined the team in January 2015. A Pet Smart’s Elite Obedience School graduate, she parlayed her training into a unique and valued office position. Roxy’s favorite role is greeting guests and fulfilling her Events by Dubsdread ambassador duties. When not at work, Roxy enjoys playing fetch with her humans, licking her brothers, belly rubs, treats, being completely spoiled and days at the doggie spa.\nKristen Berry\nWedding & Event Coordinator\nKristen joined the Dubsdread team as a catering captain in 2021 before transitioning to a wedding and event coordinator. She graduated with a degree in the arts and found she preferred the people-oriented nature, pacing, and problem-solving that comes with working in the service industry. Kristen enjoys planning, facilitating, and contributing to creating joyous occasions. When she is not at work, she loves traveling, cooking, working on creative projects and hanging out with her two cats, Diana and Henry.\nGet Inspired\nFollow us on Instagram\nGet Started\nSubmit an Inquiry",
      "emails": [
        "info@eventsbydubsdread.com"
      ]
    },
    {
      "url": "https://eventsbydubsdread.com/events-by-dubsdread-home/",
      "is_candidate": false,
      "has_email": true,
      "text": "Explore Orlando's Best Venues & Catering Services\nThe Highland Manor\nExclusively Managed Venue\nAzalea Lodge at Mead Botanical Garden\nExclusively Managed Venue\nHistoric Dubsdread\nExclusively Managed Venue\nUpcoming Events\nThere’s always something fun happening at Events by Dubsdread venues, and this season is no different. Learn more about our upcoming public events.\nLearn More\nEvent and Catering Services\nWelcome to Central Florida’s premier events and catering company, where we bring your vision to life. Our team specializes in weddings, corporate events, and special celebrations, crafting tailored experiences with exquisite cuisine and exceptional Orlando venues. We offer premium catering services at our exclusive Orlando locations and top venues across Central Florida, including the Winter Park Event Center, Orlando Science Center, and Harry P. Leu Gardens, as a preferred partner. Additionally, we are at your service for in-home or business catering.\nInquire Today\nCatering\nHighlights of Events by Dubsdread:\nWhether you’re planning an executive meeting for 20, a party for 100, or an Orlando wedding for 350 people, we promise to deliver Culinary Excellence served with Southern Charm that compliments the venue, the event, and you!\nAll-Inclusive or A La Carte Menus\nPlated, Heavy Hors D’oeuvres, or Buffet Options\nMix and Mingle Appetizers, Cocktail Hours, or Full Meals\nBreakfast, Brunch, Lunch, and Dinner Options\nLarge or Small Events – No Caps or Limits on Guest Counts\nLearn More\nGet Inspired\nFollow us on Instagram\nGet Started\nSubmit an Inquiry",
      "emails": [
        "info@eventsbydubsdread.com"
      ]
    },
    {
      "url": "https://eventsbydubsdread.com/the-highland-manor-home/#about_highland",
      "is_candidate": false,
      "has_email": true,
      "text": "Weddings\nThe Highland Manor\nParties & Events\nThe Highland Manor\nCatering & Cuisine\nThe Highland Manor\nThe Highland Manor\nGrand historic vintage elegance and Southern charm come together to create the perfect backdrop for your special event at\nThe Highland Manor\n, a premier\nwedding venue near Orlando\n. With beautiful panoramic views of rolling hills, ancient oak trees, and wide verandahs, this one-of-a-kind estate is a stunning setting for\nOrlando weddings\n, upscale parties, and corporate events.\nThe gracious interiors of this 110-year-old historic building are rich with polished wood, crystal flourishes, and vintage details that make every photo shine and every guest feel transported. Whether you’re planning an intimate ceremony or a large celebration, The Highland Manor provides an unforgettable canvas for your dream day.\nWeddings\nOur authentic, historic Apopka manor home offers a timeless setting for your love story. With a wide wrap-around porch, elegant metal roof, and antique details both inside and out, this charming\nOrlando-area wedding venue\nexudes grace, sophistication, and Southern hospitality.\nExclusively managed by Events by Dubsdread\n, we bring award-winning food and service to every celebration. Couples seeking a truly unique\nwedding venue in Orlando\nappreciate the variety and versatility of our four distinct spaces:\nThe Crystal Ballroom\n– ideal for glamorous receptions with sparkling ambiance\nThe Oak Room\n– rich in warmth and character, perfect for smaller ceremonies or dinners\nThe Glass Verandah\n– offering gorgeous natural light and scenic views\nThe Oak Bar\n– a stylish space for cocktails and mingling\nWhether you’re planning a micro wedding for 20 or a grand affair for up to 350 guests, we provide the flexibility to accommodate your vision. We offer indoor and outdoor\nwedding venue\noptions, including our showstopping\n110-year-old oak tree\n, a beloved setting for outdoor ceremonies in the greater\nOrlando wedding\nscene.\nVenue Rental Includes:\nTables, chairs, china, glassware, silverware, and standard house linens\nCeremony and reception timeframes of 5 hours (or 4 hours for reception-only events, with optional extensions)\nAccess to on-site bridal suite and get-ready rooms\nBrunch, afternoon, and evening timeframes available\nFlexible pricing with discounts based on season, day of the week, and time of day\nConvenient on-site parking\nHilton Garden Inn directly next door for your guests’ lodging needs\nLocated just outside of\nOrlando\nin the heart of historic Apopka, The Highland Manor offers the perfect balance of elegance, accessibility, and tranquility, making it a top-rated\nwedding venue near Orlando\nfor couples from all over Central Florida and beyond.\nView Brochure\nYou Get More Than a Venue - We Are at Your Service\nWhen you plan your wedding with\nEvents by Dubsdread\n, you get more than a beautiful location—you get a team dedicated to making your special day flawless. Our expert Event Specialists guide you from start to finish, combining deep experience with heartfelt service to help make your\nOrlando wedding\nunforgettable.\nFrom the moment you book, our team becomes a part of yours, helping with every detail, timeline, and transition. It’s this personalized touch that sets The Highland Manor apart from other\nwedding venues in Orlando\n.\nAt Your Service\nOur coordinators are renowned for their service and hospitality, which you simply won’t find elsewhere. Whether you’re planning your ceremony under our grand oak or inside the Crystal Ballroom, we ensure everything flows effortlessly.\nPRE-EVENT SERVICES:\nTasting for Four – curated to match your preferences and wedding style.\nCeremony and reception layout planning to maximize beauty and functionality.\nVendor coordination and guidance to help you choose the best in Orlando.\nOptional planning sessions and a final 1–2-hour planning meeting.\nRehearsal coordination for on-site events.\nDAY-OF SERVICES:\nVendor check-in and timeline management.\nFull-day coordination and execution of your wedding schedule.\nFloral distribution for family and wedding party.\nCake cutting coordination and timeline transitions.\nGuest greeters and placement of favors, centerpieces, and place cards.\nA personal butler for the wedding couple—because you deserve to be pampered.\nWhether it’s your first planning meeting or your final farewell wave as newlyweds, we’re honored to support every moment of your big day.\nInquire Today\nParties & Events\nLet's Celebrate\nThe Highland Manor isn’t just one of Central Florida’s most loved\nwedding venues\n—it’s also a top destination for private parties, milestone celebrations, and corporate gatherings near\nOrlando\n. Whether you’re planning a rehearsal dinner, retirement party, or holiday bash, our venue delivers memorable moments with elegance and ease.\nFrom cozy rooms to wide-open event halls, we offer flexible layouts to match your vision, complete with award-winning cuisine and impeccable service. Our event team works closely with you to reflect your style and occasion, customizing every detail from seating to menus.\nPopular Celebrations Include:\nRehearsal Dinners\nAnniversary Parties\nBaby & Bridal Showers\nHoliday Parties\nCorporate Luncheons and Appreciation Events\nProduct Launches, Lectures, and Leadership Retreats\nCelebrations of Life\nWe offer seating setups for sit-down receptions, theater-style events, cocktail mingling, or a creative mix of styles, giving you endless flexibility in our beautiful indoor and outdoor spaces.\nInquire Today\nCatering\nDining Together\nFood is a centerpiece of every great event, and as one of the few full-service\nOrlando wedding venues\nwith in-house catering, The Highland Manor proudly offers a menu that’s as memorable as the setting. We offer flexible dining styles, including plated meals, buffet-style feasts, and elegant hors d’oeuvres receptions.\nYour menu is built around your tastes, cultural traditions, dietary needs, and budget. Our experienced chefs craft every dish with precision and flair, helping elevate your event experience beyond expectations.\nGuest Favorites Include:\nBoursin-stuffed chicken with herb crust\nFilet mignon with mushroom merlot sauce\nMaryland-style jumbo lump crab cakes\nParmesan-crusted fresh catch of the day\nHandmade mushroom ravioli and other vegetarian/gluten-free options\nLooking for a twist? Our themed stations are always a hit:\nI-Do Barbecue Buffet\n: brined chicken, smoked tri-tip, hush puppies, and candied bacon skewers\nBuild-Your-Own Brunch Buffet\n: mimosa bars, omelet stations, and eggs Benedict\nFun Food Bars\n: shrimp & grits, sliders, mini pancakes, mac & cheese, and even nitro popcorn\nSweet Extras\n: s’mores stations, bottomless mimosas, cotton candy bubbly bars, and late-night treats\nWith so many options and professional culinary guidance, your guests will be raving long after the last bite.\nView Menus\nGet Inspired\nFollow us on Instagram\nGet Started\nSubmit an Inquiry",
      "emails": [
        "info@eventsbydubsdread.com"
      ]
    },
    {
      "url": "https://eventsbydubsdread.com/",
      "is_candidate": false,
      "has_email": true,
      "text": "Explore Orlando's Best Venues & Catering Services\nThe Highland Manor\nExclusively Managed Venue\nAzalea Lodge at Mead Botanical Garden\nExclusively Managed Venue\nHistoric Dubsdread\nExclusively Managed Venue\nUpcoming Events\nThere’s always something fun happening at Events by Dubsdread venues, and this season is no different. Learn more about our upcoming public events.\nLearn More\nEvent and Catering Services\nWelcome to Central Florida’s premier events and catering company, where we bring your vision to life. Our team specializes in weddings, corporate events, and special celebrations, crafting tailored experiences with exquisite cuisine and exceptional Orlando venues. We offer premium catering services at our exclusive Orlando locations and top venues across Central Florida, including the Winter Park Event Center, Orlando Science Center, and Harry P. Leu Gardens, as a preferred partner. Additionally, we are at your service for in-home or business catering.\nInquire Today\nCatering\nHighlights of Events by Dubsdread:\nWhether you’re planning an executive meeting for 20, a party for 100, or an Orlando wedding for 350 people, we promise to deliver Culinary Excellence served with Southern Charm that compliments the venue, the event, and you!\nAll-Inclusive or A La Carte Menus\nPlated, Heavy Hors D’oeuvres, or Buffet Options\nMix and Mingle Appetizers, Cocktail Hours, or Full Meals\nBreakfast, Brunch, Lunch, and Dinner Options\nLarge or Small Events – No Caps or Limits on Guest Counts\nLearn More\nGet Inspired\nFollow us on Instagram\nGet Started\nSubmit an Inquiry",
      "emails": [
        "info@eventsbydubsdread.com"
      ]
    },
    {
      "url": "https://eventsbydubsdread.com/the-highland-manor-home/#events_highland",
      "is_candidate": false,
      "has_email": true,
      "text": "Weddings\nThe Highland Manor\nParties & Events\nThe Highland Manor\nCatering & Cuisine\nThe Highland Manor\nThe Highland Manor\nGrand historic vintage elegance and Southern charm come together to create the perfect backdrop for your special event at\nThe Highland Manor\n, a premier\nwedding venue near Orlando\n. With beautiful panoramic views of rolling hills, ancient oak trees, and wide verandahs, this one-of-a-kind estate is a stunning setting for\nOrlando weddings\n, upscale parties, and corporate events.\nThe gracious interiors of this 110-year-old historic building are rich with polished wood, crystal flourishes, and vintage details that make every photo shine and every guest feel transported. Whether you’re planning an intimate ceremony or a large celebration, The Highland Manor provides an unforgettable canvas for your dream day.\nWeddings\nOur authentic, historic Apopka manor home offers a timeless setting for your love story. With a wide wrap-around porch, elegant metal roof, and antique details both inside and out, this charming\nOrlando-area wedding venue\nexudes grace, sophistication, and Southern hospitality.\nExclusively managed by Events by Dubsdread\n, we bring award-winning food and service to every celebration. Couples seeking a truly unique\nwedding venue in Orlando\nappreciate the variety and versatility of our four distinct spaces:\nThe Crystal Ballroom\n– ideal for glamorous receptions with sparkling ambiance\nThe Oak Room\n– rich in warmth and character, perfect for smaller ceremonies or dinners\nThe Glass Verandah\n– offering gorgeous natural light and scenic views\nThe Oak Bar\n– a stylish space for cocktails and mingling\nWhether you’re planning a micro wedding for 20 or a grand affair for up to 350 guests, we provide the flexibility to accommodate your vision. We offer indoor and outdoor\nwedding venue\noptions, including our showstopping\n110-year-old oak tree\n, a beloved setting for outdoor ceremonies in the greater\nOrlando wedding\nscene.\nVenue Rental Includes:\nTables, chairs, china, glassware, silverware, and standard house linens\nCeremony and reception timeframes of 5 hours (or 4 hours for reception-only events, with optional extensions)\nAccess to on-site bridal suite and get-ready rooms\nBrunch, afternoon, and evening timeframes available\nFlexible pricing with discounts based on season, day of the week, and time of day\nConvenient on-site parking\nHilton Garden Inn directly next door for your guests’ lodging needs\nLocated just outside of\nOrlando\nin the heart of historic Apopka, The Highland Manor offers the perfect balance of elegance, accessibility, and tranquility, making it a top-rated\nwedding venue near Orlando\nfor couples from all over Central Florida and beyond.\nView Brochure\nYou Get More Than a Venue - We Are at Your Service\nWhen you plan your wedding with\nEvents by Dubsdread\n, you get more than a beautiful location—you get a team dedicated to making your special day flawless. Our expert Event Specialists guide you from start to finish, combining deep experience with heartfelt service to help make your\nOrlando wedding\nunforgettable.\nFrom the moment you book, our team becomes a part of yours, helping with every detail, timeline, and transition. It’s this personalized touch that sets The Highland Manor apart from other\nwedding venues in Orlando\n.\nAt Your Service\nOur coordinators are renowned for their service and hospitality, which you simply won’t find elsewhere. Whether you’re planning your ceremony under our grand oak or inside the Crystal Ballroom, we ensure everything flows effortlessly.\nPRE-EVENT SERVICES:\nTasting for Four – curated to match your preferences and wedding style.\nCeremony and reception layout planning to maximize beauty and functionality.\nVendor coordination and guidance to help you choose the best in Orlando.\nOptional planning sessions and a final 1–2-hour planning meeting.\nRehearsal coordination for on-site events.\nDAY-OF SERVICES:\nVendor check-in and timeline management.\nFull-day coordination and execution of your wedding schedule.\nFloral distribution for family and wedding party.\nCake cutting coordination and timeline transitions.\nGuest greeters and placement of favors, centerpieces, and place cards.\nA personal butler for the wedding couple—because you deserve to be pampered.\nWhether it’s your first planning meeting or your final farewell wave as newlyweds, we’re honored to support every moment of your big day.\nInquire Today\nParties & Events\nLet's Celebrate\nThe Highland Manor isn’t just one of Central Florida’s most loved\nwedding venues\n—it’s also a top destination for private parties, milestone celebrations, and corporate gatherings near\nOrlando\n. Whether you’re planning a rehearsal dinner, retirement party, or holiday bash, our venue delivers memorable moments with elegance and ease.\nFrom cozy rooms to wide-open event halls, we offer flexible layouts to match your vision, complete with award-winning cuisine and impeccable service. Our event team works closely with you to reflect your style and occasion, customizing every detail from seating to menus.\nPopular Celebrations Include:\nRehearsal Dinners\nAnniversary Parties\nBaby & Bridal Showers\nHoliday Parties\nCorporate Luncheons and Appreciation Events\nProduct Launches, Lectures, and Leadership Retreats\nCelebrations of Life\nWe offer seating setups for sit-down receptions, theater-style events, cocktail mingling, or a creative mix of styles, giving you endless flexibility in our beautiful indoor and outdoor spaces.\nInquire Today\nCatering\nDining Together\nFood is a centerpiece of every great event, and as one of the few full-service\nOrlando wedding venues\nwith in-house catering, The Highland Manor proudly offers a menu that’s as memorable as the setting. We offer flexible dining styles, including plated meals, buffet-style feasts, and elegant hors d’oeuvres receptions.\nYour menu is built around your tastes, cultural traditions, dietary needs, and budget. Our experienced chefs craft every dish with precision and flair, helping elevate your event experience beyond expectations.\nGuest Favorites Include:\nBoursin-stuffed chicken with herb crust\nFilet mignon with mushroom merlot sauce\nMaryland-style jumbo lump crab cakes\nParmesan-crusted fresh catch of the day\nHandmade mushroom ravioli and other vegetarian/gluten-free options\nLooking for a twist? Our themed stations are always a hit:\nI-Do Barbecue Buffet\n: brined chicken, smoked tri-tip, hush puppies, and candied bacon skewers\nBuild-Your-Own Brunch Buffet\n: mimosa bars, omelet stations, and eggs Benedict\nFun Food Bars\n: shrimp & grits, sliders, mini pancakes, mac & cheese, and even nitro popcorn\nSweet Extras\n: s’mores stations, bottomless mimosas, cotton candy bubbly bars, and late-night treats\nWith so many options and professional culinary guidance, your guests will be raving long after the last bite.\nView Menus\nGet Inspired\nFollow us on Instagram\nGet Started\nSubmit an Inquiry",
      "emails": [
        "info@eventsbydubsdread.com"
      ]
    },
    {
      "url": "https://eventsbydubsdread.com/events-by-dubsdread-home/events-by-dubsdread-contact-us/",
      "is_candidate": false,
      "has_email": true,
      "text": "Contact Us\nQuestions about our venues, services, date availability, tours, or anything else? Just ask! We’re happy to answer them.\nYou can reach us through:\nCall:\n407-650-9558\nText:\n844-533-0002\nEmail:\ninfo@eventsbydubsdread.com\nOr through the following inquiry forms and we’ll respond within one business day.\nAddress\nAzalea Lodge at Mead Botanical Garden:\n1300 S. Denning Drive\nWinter Park, FL 32789\nSubmit an Inquiry\nEvents by Dubsdread Catering Services:\n549 West Par Street\nOrlando, FL 32804\nSubmit an Inquiry\nHistoric Dubsdread Ballroom:\n549 West Par Street\nOrlando, FL 32804\nSubmit an Inquiry\nThe Highland Manor:\n604 East Main Street\nApopka, FL 32703\nSubmit an Inquiry",
      "emails": [
        "info@eventsbydubsdread.com"
      ]
    },
    {
      "url": "https://m.facebook.com/EventsbyDubsdread/",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    }
  ],
  "all_links": [
    "https://eventsbydubsdread.com/the-highland-manor-home/the-highland-manor-faq/",
    "https://eventsbydubsdread.com/events-by-dubsdread-home/events-by-dubsdread-about/",
    "https://eventsbydubsdread.com/the-highland-manor-home/#catering_highland",
    "https://eventsbydubsdread.com/privacy-statement/",
    "https://eventsbydubsdread.com/events-by-dubsdread-home/",
    "https://eventsbydubsdread.com/events-by-dubsdread-home/events-by-dubsdread-blog/",
    "https://eventsbydubsdread.com/application-for-employment/",
    "https://eventsbydubsdread.com/historic-dubsdread-home/",
    "https://eventsbydubsdread.com/the-highland-manor-home/#about_highland",
    "https://eventsbydubsdread.com/",
    "https://eventsbydubsdread.com/events-by-dubsdread-home/events-by-dubsdread-contact-us",
    "https://eventsbydubsdread.com/events-by-dubsdread-home/events-by-dubsdread-catering/#catering_menus",
    "https://eventsbydubsdread.com/events-by-dubsdread-home/events-by-dubsdread-gallery/",
    "https://eventsbydubsdread.com/events-by-dubsdread-contact-us/",
    "https://eventsbydubsdread.com/the-highland-manor-home/#events_highland",
    "https://eventsbydubsdread.com/events-by-dubsdread-home/events-by-dubsdread-catering/",
    "https://eventsbydubsdread.com/events-by-dubsdread-home/events-by-dubsdread-weddings/",
    "https://eventsbydubsdread.com/the-highland-manor-home/",
    "https://eventsbydubsdread.com/historic-dubsdread-home/historic-dubsdread-gallery/",
    "https://eventsbydubsdread.com/the-highland-manor-home/the-highland-manor-gallery/",
    "https://eventsbydubsdread.com/pricing-guide",
    "https://eventsbydubsdread.com/pricing-guide/",
    "https://eventsbydubsdread.com/events-by-dubsdread-home/events-by-dubsdread-contact-us/",
    "https://eventsbydubsdread.com/azalea-lodge-at-mead-botanical-garden-home/",
    "https://eventsbydubsdread.com/the-highland-manor-home/the-highland-manor-blog/",
    "https://eventsbydubsdread.com/wedding-event-venue-partners/",
    "https://eventsbydubsdread.com/the-highland-manor-home/#weddings_highland",
    "https://eventsbydubsdread.com/events-by-dubsdread-home/events-by-dubsdread-weddings/#wedding_brochures"
  ],
  "candidate_links": [
    "https://eventsbydubsdread.com/events-by-dubsdread-home/events-by-dubsdread-about/",
    "https://eventsbydubsdread.com/events-by-dubsdread-home/",
    "https://eventsbydubsdread.com/the-highland-manor-home/#about_highland",
    "https://eventsbydubsdread.com/",
    "https://eventsbydubsdread.com/the-highland-manor-home/#events_highland",
    "https://eventsbydubsdread.com/events-by-dubsdread-home/events-by-dubsdread-contact-us/",
    "https://m.facebook.com/EventsbyDubsdread/"
  ],
  "visited": [
    "https://eventsbydubsdread.com/the-highland-manor-home/",
    "https://eventsbydubsdread.com/about",
    "https://eventsbydubsdread.com/contact",
    "https://eventsbydubsdread.com/staff",
    "https://eventsbydubsdread.com/team",
    "https://eventsbydubsdread.com/board",
    "https://eventsbydubsdread.com/directory",
    "https://eventsbydubsdread.com/events",
    "https://eventsbydubsdread.com/sitemap.xml",
    "https://eventsbydubsdread.com/council",
    "https://eventsbydubsdread.com/leadership",
    "https://eventsbydubsdread.com/management",
    "https://eventsbydubsdread.com/producers",
    "https://eventsbydubsdread.com/support",
    "https://eventsbydubsdread.com/crew",
    "https://eventsbydubsdread.com/members",
    "https://eventsbydubsdread.com/bios",
    "https://eventsbydubsdread.com/people",
    "https://eventsbydubsdread.com/artists",
    "https://eventsbydubsdread.com/musicians",
    "https://eventsbydubsdread.com/faculty",
    "https://eventsbydubsdread.com/administration",
    "https://eventsbydubsdread.com/events-by-dubsdread-home/events-by-dubsdread-about/",
    "https://eventsbydubsdread.com/events-by-dubsdread-home/",
    "https://eventsbydubsdread.com/the-highland-manor-home/#about_highland",
    "https://eventsbydubsdread.com/",
    "https://eventsbydubsdread.com/the-highland-manor-home/#events_highland",
    "https://eventsbydubsdread.com/events-by-dubsdread-home/events-by-dubsdread-contact-us/",
    "https://m.facebook.com/EventsbyDubsdread/"
  ],
  "base_url": "https://eventsbydubsdread.com/the-highland-manor-home/"
}