{
  "pages": [
    {
      "url": "http://www.fbcgraceville.com/leadership/",
      "is_candidate": false,
      "has_email": false,
      "text": "Our Leadership\nLearn more about our staff and leaders\nMinisterial Staff\nNaethan Hendrix, Senior Pastor\nNaethan is married to his stunning wife, Hannah, and they have three children. He was born in southern California and grew up in southeast Georgia. Naethan was converted through the gospel ministry of his parents and local church. He attended the Baptist College of Florida (BA) and The Southern Baptist Theological Seminary (M.Div, D.Min). Prior to becoming the pastor of FBC Graceville, Naethan served for fourteen years with Stafford Baptist Church in Stafford, VA, in the areas of church planting and pastoral ministry.",
      "emails": []
    },
    {
      "url": "http://www.fbcgraceville.com/about/",
      "is_candidate": false,
      "has_email": false,
      "text": "Our Beliefs\nLearn more about what we believe, who we are, and why we exist\nOur Confession of faith\nWhat we believe together is the most important thing about First Baptist Church. We affirm the historic creeds of the Church and cooperate with the Southern Baptist Convention for the sake of missions and theological training. We affirm the Baptist Faith and Message, 2000, as a faithful summary of the Bible’s teaching about God, Scripture, Man, Christ, Redemption, and the Church. Our common confession of these biblical truths unifies us as a local church and helps guard us from error. From the time of the Apostles to today, Christians have laid out doctrine (beliefs) in brief, definitive statements. As those who know God, we believe it necessary to set forth in a concise fashion the cornerstone truths of this church as guided by Scripture. All who join FBC are required to affirm our Confession of Faith. This statement registers our belief in historic Christianity, evangelical Christianity, believer’s baptism, and congregational polity. Once we as members agree to the statement, we are responsible for believing and living in accordance with it.\nClick Here to Read the BFM 2000\nOur Membership Covenant\nSecond in importance to what we believe together as a church is how we live together as a local church. The Membership Covenant of FBC summarizes the biblical requirements of membership and, our commitment to God and one another as members of Christ’s Church. It forms the ethics, or the moral principles, of our worldview and holds out a biblical standard by which we live. Our affirmation of this agreement follows the practice of believers throughout the centuries who have pledged to God and one another to live out the gospel in community. We require all new members to affirm the Membership Covenant before joining the church. We also reaffirm our commitment to the covenant from time-to-time when we gather together. By featuring the covenant in our life together, we strive to protect ourselves from individual and corporate sin. Of equal importance, we spur one another on to live in light of a greater covenant, one initiated by love, sealed by sacrifice, and kept for eternity by our Savior, Jesus Christ.\nClick Here to Read Our Covenant\nOur Vision:\nCreated, Called, and Commissioned\nAs those who have been redeemed by the blood of Jesus Christ, we want to bring him glory. The main way we glorify God is through our life together as a church, manifesting the love of Jesus through our love for each other (John 13.35). We gather together every Lord’s Day to sing God’s truth, pray God’s will, hear God’s Word, and care for one another. And we serve side by side to see Jesus worshipped and recognized as the true King both here and to the ends of the earth.\nTo this end we joyfully recognize that we have been\nCREATED\nfor the glory of God\n(Eph 1.11-14; 3.10, 20-21; Is 43.6-7; 1 Cor 10.31),\nCALLED\nto be holy\n(John 17.17; 1 Pet 1.14-16; 2.4-5, 9-12; 1 Cor 1.2; Rom 12.1-2)\n, and\nCOMMISSIONED\nto make disciples of Jesus Christ\n(Matt 28.18-20; John 17.17-18; 1 Tim 3.14-16; cf. Matt 16.13-20; 18.15-20).",
      "emails": []
    },
    {
      "url": "http://www.fbcgraceville.com/contact/",
      "is_candidate": false,
      "has_email": false,
      "text": "Contact\nHere's how to get in touch\nMeeting Address:\n987 8th Ave., Graceville, FL 32440\nMailing Address:\nPO Box 565, Graceville, FL 32440\nPhone Number:\n850.263.3323\nSend us an email to get in touch:\nYour Name (required)\nYour Email (required)\nSubject\nYour Message",
      "emails": []
    }
  ],
  "all_links": [
    "http://www.fbcgraceville.com/leadership/",
    "http://www.fbcgraceville.com/",
    "http://www.fbcgraceville.com/what-is-the-gospel/",
    "http://www.fbcgraceville.com/may-19-2024/",
    "http://www.fbcgraceville.com/may-26-2024/",
    "http://www.fbcgraceville.com/sermon-archive/",
    "http://www.fbcgraceville.com/about/",
    "http://www.fbcgraceville.com/contact/",
    "http://www.fbcgraceville.com/visit/",
    "http://www.fbcgraceville.com/online/"
  ],
  "candidate_links": [
    "http://www.fbcgraceville.com/leadership/",
    "http://www.fbcgraceville.com/about/",
    "http://www.fbcgraceville.com/contact/"
  ],
  "visited": [
    "http://www.fbcgraceville.com",
    "http://www.fbcgraceville.com/about",
    "http://www.fbcgraceville.com/contact",
    "http://www.fbcgraceville.com/staff",
    "http://www.fbcgraceville.com/team",
    "http://www.fbcgraceville.com/board",
    "http://www.fbcgraceville.com/directory",
    "http://www.fbcgraceville.com/events",
    "http://www.fbcgraceville.com/sitemap.xml",
    "http://www.fbcgraceville.com/council",
    "http://www.fbcgraceville.com/leadership",
    "http://www.fbcgraceville.com/management",
    "http://www.fbcgraceville.com/producers",
    "http://www.fbcgraceville.com/support",
    "http://www.fbcgraceville.com/crew",
    "http://www.fbcgraceville.com/members",
    "http://www.fbcgraceville.com/bios",
    "http://www.fbcgraceville.com/people",
    "http://www.fbcgraceville.com/artists",
    "http://www.fbcgraceville.com/musicians",
    "http://www.fbcgraceville.com/faculty",
    "http://www.fbcgraceville.com/administration",
    "http://www.fbcgraceville.com/leadership/",
    "http://www.fbcgraceville.com/about/",
    "http://www.fbcgraceville.com/contact/"
  ],
  "base_url": "http://www.fbcgraceville.com"
}