{
  "pages": [
    {
      "url": "https://fcfcamp.com/contact-us/",
      "is_candidate": false,
      "has_email": false,
      "text": "Address\n:\n2309 Flat Creek Rd, Chattahoochee, FL 32324\nPhone\n:\n(850) 442-3333\nContact Form\nName\nEmail Address\nMessage\n1 + 12\n=\nSubmit",
      "emails": []
    },
    {
      "url": "https://fcfcamp.com/about-us/",
      "is_candidate": false,
      "has_email": false,
      "text": "Book Now\nThank you for visiting Flat Creek Family Campground and RV Park! Below you will find a little about us! We have included some reviews, and some local information, but if you still have questions be sure to call us! We have the best reviews around because we go the extra mile for our guests!\nBook Now\nDiane Newman-Bent\n—\n5 star\nThis campground is the best we’ve visited so far. We were suppose to stay for a week but we are staying for a month. The personal attention from the hosts for our comfort is impeccable !! The clean facilities are phenomenal. The environment is peaceful and charming. The pricing is perfect and it is close I-10 but you can’t even tell I-10 is there. If you are traveling on 10 East or West and need a one night or are interested in a very peaceful camping experience, this is the place to go. There is a pool, playground, horseshoes, outside kitchen & fire pit (for everyone’s use) it also has accommodations for camping in tents cabins and all the way up to Class A’s. Love this place…\nJan McCabe\n—\n5 star\nWe love this place…Contrary to what their page says they are open. We go there every chance we get but we stay in the cabins. We just purchased an RV and are planning to go in a couple of weeks.\nKaren Cloukey Rizzo-Kinneair\n—\n4 star\nWe stayed there this past weekend because there was evacuating from the east coast of Florida. We were fortunate that there was a cancellation. The sites were clean, staff very helpful, restrooms/shower area VERY clean, clean pool and a nice congregating area with a fire pit that is lit all the time by staff. The owners, who we found out are the new owners of this campground, were extremely hospitable and he\nlpful. Rates were posted rates and very reasonable. Campground is very wooded, HOWEVER the trees are all cutback so as not to touch the tallest of RVs! No worries there. They are in the midst of updating the electrical and modifications to the campground. Most campers rolled in on Thursday, Oct 6th and Friday, Oct 7th, the owners bought pizza for all!!!! We were ALL appreciative to say the least! NEW OWNERS were thrilled to have a packed campground. I wish we were closer than (278 miles away) because this would be a DEF campground that we would frequent but we will be going back either way!\nWe wish nothing but the best for the new owners! You will not be disappointed to GLAMP at Triple Cs Campground and RV Park.\nKaren and Ron\nBook Now\nAbout Us but\nAbout Us because",
      "emails": []
    }
  ],
  "all_links": [
    "https://fcfcamp.com/gallery/",
    "https://fcfcamp.com/contact-us/",
    "https://fcfcamp.com/amenities/",
    "https://fcfcamp.com/location/",
    "https://fcfcamp.com/wp-content/uploads/2025/05/7I1A9063.jpg",
    "http://fcfcamp.com/book-now/",
    "https://fcfcamp.com/local-information/",
    "https://fcfcamp.com/",
    "https://fcfcamp.com/rates-and-features/",
    "https://fcfcamp.com/about-us/",
    "https://fcfcamp.com/faqs/",
    "http://fcfcamp.com/gallery",
    "https://fcfcamp.com/wp-content/uploads/2025/05/7I1A9081.jpg",
    "https://fcfcamp.com/wp-content/uploads/2025/05/7I1A9025.jpg",
    "https://fcfcamp.com/wp-content/uploads/2025/05/7I1A9034.jpg"
  ],
  "candidate_links": [
    "https://fcfcamp.com/contact-us/",
    "https://fcfcamp.com/about-us/"
  ],
  "visited": [
    "http://fcfcamp.com/",
    "http://fcfcamp.com/about",
    "http://fcfcamp.com/contact",
    "http://fcfcamp.com/staff",
    "http://fcfcamp.com/team",
    "http://fcfcamp.com/board",
    "http://fcfcamp.com/directory",
    "http://fcfcamp.com/events",
    "http://fcfcamp.com/sitemap.xml",
    "http://fcfcamp.com/council",
    "http://fcfcamp.com/leadership",
    "http://fcfcamp.com/management",
    "http://fcfcamp.com/producers",
    "http://fcfcamp.com/support",
    "http://fcfcamp.com/crew",
    "http://fcfcamp.com/members",
    "http://fcfcamp.com/bios",
    "http://fcfcamp.com/people",
    "http://fcfcamp.com/artists",
    "http://fcfcamp.com/musicians",
    "http://fcfcamp.com/faculty",
    "http://fcfcamp.com/administration",
    "https://fcfcamp.com/contact-us/",
    "https://fcfcamp.com/about-us/"
  ],
  "base_url": "http://fcfcamp.com/"
}