{
  "pages": [
    {
      "url": "https://filmfervor.com/about/",
      "is_candidate": false,
      "has_email": false,
      "text": "Skip to content\nHome\nBlog\nNewsletter\nSubmit Your Film\nAbout\nContact\nHome\nBlog\nNewsletter\nSubmit Your Film\nAbout\nContact\nAbout\nWHAT IS FILM FERVOR?\nFilm Fervor was born out of a need to help promote independent films from around the world. Around 40,000 independent films are made and submitted to festivals, video sharing sites and private websites every year.\nWith all that volume, it is easy to get lost in the crowd and fade to anonymity. Sadly, there are sites out there that say they will promote your film and guarantee you will get into festivals and be seen by millions but that’s just not true.\nFilm Fervor aims to reach a massive audience of filmmakers and film fans through YouTube\n(\nSubscribe on YouTube\n) , Podcasts, film reviews (\nsubmit a film for review\n), equipment reviews, tutorials on film making, and be a sounding board for people just starting out.\nAs a bridge between festivals, online distribution and social networking, Film Fervor has been designed to showcase the guests rather than our own products or services. Although we will monetize with affiliate links and sponsorship, we will only provide valuable content to our listeners through both affiliate products and the selection of sponsors we accept.\nSo, if you are an independent filmmaker and you need to have your films promoted to people and spread the word, contact us and join the community of fellow filmmakers from around the world\nWHAT KIND OF STUFF CAN I FIND ON FILM FERVOR?\nThe short answer is: The independent film world. The long answer is that we have many interests, ranging from film reviews, film festival coverage, equipment tests and reviews, tutorials, distribution, funding, and marketing of films. Film Fervor is the place where we’ll explore these topics in detail to arm you with the best information we can give to inform your decisions on how to pursue your film making career.\nThe number one rule of Film Fervor is simple. We want to make Film Fervor the place where you go for help making your independent film.\nI WANT YOU TO REVIEW SOMETHING SPECIFIC\nIf you’re a film equipment manufacturer and you would like us to test your product, please send us an email describing the product. Let us know what it does, how it helps filmmakers, and what your expectations are with the product.\nIf you’re on the fence about a particular product and don’t want to bite the bullet until you see an in-depth review, taking it through its paces in a week-long marathon, send us a message!\nWe’re always eager to help you make informed decisions on what products to buy, rent, or avoid all together.\nI WANT TO BE ON THE PODCAST\nAbsolutely! We love to talk about films and the film making process with people in the trenches and would love to have you on the podcast.\nAll interviews are conducted over RiversideFM and we ask that you have a decent sounding microphone and that you have a quiet environment to record in.\nThe interviews take about 30-45 minutes to complete with a few minutes in pre-interview chat where we get to know one another a bit, do some sound checks, and generally chat about your work.\nWe say we like to follow a clear and concise format for our show, that way my listeners can know what to expect day in and day out from each of the filmmakers I interview (but sometimes we digress) . Some of the questions include:\nTell us a little about your journey as a filmmaker.\nWhat are some of the failures and hardships you’ve encountered and overcome as a filmmaker?\nPlease tell us what your breakout film was and how that got you noticed.\nWhat’s the biggest lesson you’ve learned about film making since you started?\nIf you could have your dream cast for your next feature, who would it be and why?\nPlease tell us a little about what it’s like day-to-day as a creator / director.\nHow do you go about finding your talent?\nIf you could go back to the beginning of your career and tell your younger self something, what would it be?\nSo, what are you currently working on and do you have any trailers up?\nVery quickly, tell us the logline and a bit about your next project.\nSo, after these points we generally like to discuss your current works and when you are going to release your next/first piece.\nFinally, as a shameless obsessive about cinema gear, we  like to discuss your favorite cameras, lenses and equipment that you have as your daily use and what you like / would like to get a hold of for your next film.\nPlease feel free to talk about your past, current and future works as well as any promotions or services you offer in your area. I am always happy to help promote fellow filmmakers!\nJust fill out the info\nhere\nand we’ll be in touch!\nI DON’T LIKE THE RATING YOU GAVE MY FILM IN YOUR REVIEW\nPlease understand that our goal is to provide feedback and information based on our own in-house criteria. All reviews, everywhere, are based on opinion and everyone is free to disagree with the opinions of others.\nThat being said, when we post our fair, but firm, reviews of films or products, we won’t change those opinions unless the issues we’ve pointed out are corrected.\nAbout\nBuild Your Film Business\nIndependent Film Festivals\nContact\nAbout\nBuild Your Film Business\nIndependent Film Festivals\nContact\nFilm Fervor\nCopyright © Film Fervor, All Rights Reserved",
      "emails": []
    },
    {
      "url": "https://filmfervor.com/contact/",
      "is_candidate": false,
      "has_email": false,
      "text": "Skip to content\nHome\nBlog\nNewsletter\nSubmit Your Film\nAbout\nContact\nHome\nBlog\nNewsletter\nSubmit Your Film\nAbout\nContact\nContact\nAbout\nBuild Your Film Business\nIndependent Film Festivals\nContact\nAbout\nBuild Your Film Business\nIndependent Film Festivals\nContact\nFilm Fervor\nCopyright © Film Fervor, All Rights Reserved",
      "emails": []
    },
    {
      "url": "https://www.facebook.com/FilmFervorProductions/",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    }
  ],
  "all_links": [
    "https://filmfervor.com/reviews/",
    "https://filmfervor.com/blog/how-to-build-a-dedicated-fan-base-for-your-indie-film-production-company/",
    "https://filmfervor.com/",
    "https://filmfervor.com/wp-content/uploads/2016/03/LogoFullWide.jpg",
    "https://filmfervor.com/films/dating-audrey/",
    "https://filmfervor.com/blog/breaking-free-from-the-big-studio-system-the-power-of-independent-filmmaking/",
    "https://go.filmfervor.com",
    "https://filmfervor.com/blog/is-the-sun-setting-on-netflix/",
    "https://filmfervor.com/films/the-human-supremacist/",
    "https://filmfervor.com/blog/10-youtube-channels-every-filmmaker-should-follow-to-level-up-their-craft/",
    "https://filmfervor.com/blog/beetlejuice-beetlejuice/",
    "http://go.filmfervor.com/newsletter",
    "https://filmfervor.com/news/",
    "https://filmfervor.com/blog/grassroots-film-marketing-a-case-study-on-its-always-sunny-in-philadelphia/",
    "https://filmfervor.com/films/egg/",
    "https://filmfervor.com/festivals/",
    "https://filmfervor.com/films/the-haunted-hotel/",
    "http://go.filmfervor.com",
    "https://filmfervor.com",
    "https://filmfervor.com/films/keep-it-in-the-dark/",
    "https://filmfervor.com/about/",
    "https://filmfervor.com/films/vice-grip-2024/",
    "https://filmfervor.com/films/fishtank/",
    "https://filmfervor.com/contact/",
    "https://filmfervor.com/films/cut-to-the-chase/",
    "https://filmfervor.com/submit-your-film/"
  ],
  "candidate_links": [
    "https://filmfervor.com/about/",
    "https://filmfervor.com/contact/",
    "https://www.facebook.com/FilmFervorProductions/"
  ],
  "visited": [
    "http://www.filmfervor.com/",
    "http://www.filmfervor.com/about",
    "http://www.filmfervor.com/contact",
    "http://www.filmfervor.com/staff",
    "http://www.filmfervor.com/team",
    "http://www.filmfervor.com/board",
    "http://www.filmfervor.com/directory",
    "http://www.filmfervor.com/events",
    "http://www.filmfervor.com/sitemap.xml",
    "http://www.filmfervor.com/council",
    "http://www.filmfervor.com/leadership",
    "http://www.filmfervor.com/management",
    "http://www.filmfervor.com/producers",
    "http://www.filmfervor.com/support",
    "http://www.filmfervor.com/crew",
    "http://www.filmfervor.com/members",
    "http://www.filmfervor.com/bios",
    "http://www.filmfervor.com/people",
    "http://www.filmfervor.com/artists",
    "http://www.filmfervor.com/musicians",
    "http://www.filmfervor.com/faculty",
    "http://www.filmfervor.com/administration",
    "https://filmfervor.com/about/",
    "https://filmfervor.com/contact/",
    "https://www.facebook.com/FilmFervorProductions/"
  ],
  "base_url": "http://www.filmfervor.com/"
}