{
  "pages": [
    {
      "url": "https://finnegansway.com/about-us/",
      "is_candidate": false,
      "has_email": false,
      "text": "Logo\nGood Food\nGood Food - Great Atmosphere\nLocals\nWhere the Locals Hangout\nAddress\n1344 Ocean Drive - Miami Beach\nHome\nAbout Us\nFood Menu\nDrink Menu\nSpecials\nOnline Ordering\nWelcome to Finnegan’s Way\nA vibrant Irish pub and sports bar nestled in the heart of South Beach at 1344 Ocean Drive, Miami Beach, FL 33139. Since our establishment, we’ve become a cherished destination for both locals and visitors seeking a lively atmosphere, delectable food, and refreshing drinks.\nOur Story\nSituated along the iconic Ocean Drive, Finnegan’s Way offers an open-air setting that captures the essence of Miami Beach’s dynamic energy. Our establishment is designed to provide guests with a relaxed yet spirited environment, perfect for enjoying the coastal breeze, watching your favorite sports, or simply unwinding with friends.\nCulinary Delights\nOur menu boasts a diverse selection of dishes to satisfy any craving. From hearty breakfasts served daily to savory lunch and dinner options, there’s something for everyone. Signature items include our famous Live Maine Lobster with an old family shrimp stuffing recipe, BBQ chicken, ribs, breakfast pizza, filet mignon, and the classic corned beef and cabbage. Don’t miss our popular lobster ravioli and mac & cheese, favorites among our regulars. We also offer a variety of appetizers, sandwiches, pizzas, and desserts to round out your dining experience.\nDrinks & Entertainment\nAt Finnegan’s Way, we pride ourselves on our extensive drink menu, featuring a wide range of beers, wines, and cocktails to complement your meal. With over 35 televisions strategically placed throughout the venue, you won’t miss a moment of the action, whether it’s the big game or your favorite sports event.\nThe Finnegan’s Experience\nOur friendly and attentive staff are dedicated to providing exceptional service, ensuring that every visit is memorable. Whether you’re here for a casual meal, a night out with friends, or to catch the latest sports action, Finnegan’s Way offers a welcoming atmosphere that keeps guests coming back.\nVisit Us\nLocated in the historic Miami Beach Art Deco District, Finnegan’s Way is easily accessible and surrounded by the vibrant culture and nightlife that South Beach is renowned for. We invite you to join us and experience the perfect blend of Irish pub charm and Miami Beach flair.",
      "emails": []
    }
  ],
  "all_links": [
    "https://finnegansway.com/about-us/",
    "https://finnegansway.com/food-menu/",
    "https://finnegansway.com/specials/",
    "https://finnegansway.com/drink-menu/",
    "https://finnegansway.com/",
    "https://finnegansway.com",
    "https://finnegansway.com/online-ordering-for-pick-up/"
  ],
  "candidate_links": [
    "https://finnegansway.com/about-us/"
  ],
  "visited": [
    "http://www.finnegansway.com/",
    "http://www.finnegansway.com/about",
    "http://www.finnegansway.com/contact",
    "http://www.finnegansway.com/staff",
    "http://www.finnegansway.com/team",
    "http://www.finnegansway.com/board",
    "http://www.finnegansway.com/directory",
    "http://www.finnegansway.com/events",
    "http://www.finnegansway.com/sitemap.xml",
    "http://www.finnegansway.com/council",
    "http://www.finnegansway.com/leadership",
    "http://www.finnegansway.com/management",
    "http://www.finnegansway.com/producers",
    "http://www.finnegansway.com/support",
    "http://www.finnegansway.com/crew",
    "http://www.finnegansway.com/members",
    "http://www.finnegansway.com/bios",
    "http://www.finnegansway.com/people",
    "http://www.finnegansway.com/artists",
    "http://www.finnegansway.com/musicians",
    "http://www.finnegansway.com/faculty",
    "http://www.finnegansway.com/administration",
    "https://finnegansway.com/about-us/"
  ],
  "base_url": "http://www.finnegansway.com/"
}