{
  "pages": [
    {
      "url": "https://flhorsepark.com/contact/",
      "is_candidate": false,
      "has_email": false,
      "text": "Contact\nAddress: 11008 South Hwy 475 Ocala, FL 34480\nPhone: 352-307-6699\nGo back\nYour message has been sent\nName\n(required)\nWarning\nEmail\n(required)\nWarning\nWebsite\nWarning\nComment\n(required)\nWarning\nWould you like to stay up to date by recieving our Newsletter?\nSign me up!\nNo\nWarning\nWarning.\nSubmit\nΔ\nLike this:\nLike\nLoading...\n#post-##\nContact\nAddress: 11008 South Hwy 475 Ocala, FL 34480\nPhone: 352-307-6699\nGo back\nYour message has been sent\nName\n(required)\nWarning\nEmail\n(required)\nWarning\nWebsite\nWarning\nComment\n(required)\nWarning\nWould you like to stay up to date by recieving our Newsletter?\nSign me up!\nNo\nWarning\nWarning.\nSubmit\nΔ\nLike this:\nLike\nLoading...",
      "emails": []
    },
    {
      "url": "https://flhorsepark.com/board-of-directors/",
      "is_candidate": false,
      "has_email": false,
      "text": "Board Of Directors\nCarol Dover\nChairperson\nCarol Dover has served as President/CEO of the more than 10,000 member Florida Restaurant and Lodging Association (FRLA) since July of 1995.\nRead More\nDover is a professional association manager, a lobbyist, a former government insider, and a Florida State University Dedman School of Hospitality graduate with a degree in Hotel and Restaurant Management. As the FRLA’s President/CEO, Dover works to protect, educate, and promote the diverse interests of Florida’s hospitality industry before the Florida Legislature and lobbying against unfair government regulation. The industry represents a $76.1 billion industry, 23% of Florida’s economy, $4.6 billion in sales tax revenue, and over one million employees, making it Florida’s largest employer. She also serves as a member of the Board of Directors for the National Restaurant Association, National Restaurant Association Education Foundation, Council of State Restaurant Associations, International Society of Hotel Association Executives, VISIT FLORIDA, Florida Tourism Commission, Florida TaxWatch, and the Florida Horse Park.\nLonny (Taylor) Powell\nFirst Vice–Chair\nHorse Park First Vice Chair Lonny Powell of Dunnellon is CEO of Ocala-based Florida Thoroughbred Breeders and Owners Association.\nRead More\nThe FTBOA represents the economic development, political, public relations and leadership interests of North Americas second largest Thoroughbred breeding markets breeders, horse and farm owners. In tandem Powell also serves as Publisher & CEO of Florida Equine Communications (Horse Capital Digest, Florida Horse, Wire to Wire) and executive director of Florida Thoroughbred Charities among others.\nA third generation horseman whose late father was a jockey, Powell has owned race and show/competition horses throughout his life. A big believer in stepping up to serve the community and industry when called upon, he has served as a Florida Horse Park and Agricultural Center board member since 2014 and has filled past offices of chair, 2 nd vice-chair and secretary. Powell represents the state’s equine industry as a member of the state-appointed Animal Industry Trade Council while also representing the Florida and Marion County industry on international trade missions. He also serves on the board of the Ocala/Marion County Chamber & Economic Partnerships and is immediate secretary and director of the Florida Society of Association Executives. In 2015 FTBOA received the coveted FSAE Association of the Year as well as the high honor of CEP Non Profit of the Year awards. Best known for his strategic, public relations and leadership abilities, Powell has served in a variety of equine top executive capacities including CEO of the nation’s premier race track, Santa Anita of Arcadia, CA, president of Racing Commissioner’s International, director of the University of AZ Race Track Industry Program and chief compliance office and chair of policy & internal review for You.bet.com. Immediately prior to his arrival in Florida in 2012, Powell served as a member of Arizona Governor Jan Brewer’s Cabinet as well as administrative law judge. Much of his responsibility was in the areas of regulation, enforcement and administration of pari-mutuel racing, boxing and mixed martial arts on behalf of the state and governor.\nEdward McNamara\nSecond Vice-Chair\nWinning Edge Saddlery is a family business founded by Edward McNamara, an avid polo player who was taught horsemanship through the United States Pony Club and has a background in managing large scale equestrian operations.\nRead More\nHe is now joined by his son Patrick McNamara who also plays Polo. The McNamara’s and their staff hold years of experience in multiple disciplines including hunters and jumpers, eventing, dressage and Fox Hunting.\nJim Strickland\nSecretary\nJim Strickland and his family own and operate Strickland Ranch in Myakka City, Florida. The ranch was started by Mr. Strickland’s father, Hiram Strickland, in 1938.\nRead More\nThey proudly produce beef cattle. Mr. Strickland is actively involved in his local community. He has been heavily involved with the Farm Bureau for over 20 years serving on the Beef Advisory Committee and the International Trade Task Force. Jim is a board member of the Florida Horse Park in Ocala, FL and the National Cattlemen’s Association Political Action Committee vice chair. He is a past president of the Florida Cattlemen’s Association, current chairman for the Florida Cattlemen’s Foundation and has worked with the Manatee County Fair Board for over 15 years.\nJoseph M. O’Farrell III\nTreasurer\nJoseph M. O’Farrell, III is a native of Ocala, Florida. His passion for thoroughbreds comes from growing up on the family farm, Ocala Stud. In his early years, O’Farrell worked on the farm mowing fields and feeding and caring for the farm’s yearlings.\nRead More\nA member of the Boy Scouts of America, he earned his Eagle Scout award in 1994. After high school in Ocala, he went off to Erskine College in Due West, South Carolina where he was a student athlete on the tennis team. In 1999, O’Farrell graduated with a Bachelor’s degree in Business Administration with emphasis in Accounting. After college, he went to work for The South Financial Group and Carolina First Bank in Anderson, South Carolina. In 2004, he moved back to Ocala and became a manager at Ocala Stud, handling the financial side of the farm. In late 2004, O’Farrell purchased the broodmare Lady Discreet along with his brother David and Ocala Stud as partners. In 2009, Lady Discreet became the producer of Calder Oaks winner Chary, by Montbrook. Ocala Stud has been a perennial leading Florida commercial breeder and has either solely or in partnership bred more than 100 stakes winners, including Eclipse Award winning Musical Romance, and current graded stakes winners Turbulent Descent, Tackleberry, Rigoletta, Gourmet Dinner, and Shadowbdancing. Ocala Stud currently stands popular stallions High Cotton, Montbrook, In Summation, Gottcha Gold, Adios Charlie, and Silver Tree. Joseph married Alicia W. O’Farrell in 2007. Their son Joseph “Michael” O’Farrell, IV was born in 2008.\nGreg Allen\nGreg Allen is the Vice President of Finance and Accounting for Branch Properties, Inc. (dba Seminole Feed).\nRead More\nPrior to joining the company in 1983, he was a Partner at Duggan, Joiner, Birkenmeyer, Stafford and Furman, PA. Greg has been a Member of the Florida Institute of Certified Public Accountants since 1984 and has held many offices in the local chapter, as well as serving on the State Board of Governors. He is also a member of the American Institute of Certified Public Accountants since 1984. In service to the community, Greg is a member of the Metropolitan Ocala Rotary Club which recognized him as a Paul Harris Fellow in 2007. In 2009 he earned the Service Above Self Award. He graduated from the first class of Leadership Ocala/Marion in 1988 and has served on the Board of Directors of the Ocala/Marion County Chamber of Commerce.\nJoy Maxwell Carr\nJoy Maxwell Carr, a graduate of Carrollton School of the Sacred Heart in Miami, Florida received her undergraduate degree from the University of Miami and she received her J.D. degree from the University of Miami in Miami, Florida.\nRead More\nMs. Carr was admitted to the Florida Bar in 1976 and served as an Assistant State Attorney in the 11th Judicial Circuit, in that capacity she served as a Division Chief and Major Crimes Prosecutor as well as serving in the Organized Crime section under State Attorneys Richard Gerstein and Janet Reno from 1976 to 1982. After leaving the State Attorneys office she went into private practice and formed the law firm of Carr and Carr P.A. where she is a senior partner to this day. Ms. Carr for the next several years had a varied practice including criminal defense, real estate, personal injury, divorce, probate and guardianship litigation. Ms. Carr has tried in excess of 200 jury trials and has both prosecuted and represented multiple defendants who are on Florida’s death row. Ms. Carr for the past 20 years has practiced exclusively in the area of Probate, Guardianship and Trusts in all counties across the State of Florida. Ms. Carr has and does serve on numerous committees at a local and statewide level representing the interest of the probate, guardianship and trust sector of the 11th Judicial Circuit. Ms. Carr was for three years the past Chair of the Dade County Bar Probate and Guardianship Committee and is presently the Vice Chair of that Committee and is also a member of the Real Estate Probate and Trust Section of the Florida Bar where she is an active participant on both the Guardianship Committee and the Trust Litigation Committee. Ms. Carr served three years as a member of the Board of Directors of the Dade County Bar Assoc. from which she has received numerous awards for her service both to the indigent as Pro Bono attorney of the year and for her service to the Probate Bar. Ms. Carr is now or has been a member of the American Bar Association and the Cuban American Bar Association, the Florida Association of Women’s lawyers, the Dade County Association of Trial lawyers, the Florida Association of Trial Lawyers and the American Academy of Trial lawyers. She has also been an annual EAGLE contributor with the Florida Academy of Trial lawyers. Ms. Carr is bilingual and fluent in Spanish having majored in Spanish at the University of Miami.\nJoy Maxwell Carr has owned and shown horses her entire life. Joy Carr currently owns farms in the Homestead area where she keeps and trains American Saddlebred, Arabians and half Arabian horses and stands her Arabian breeding stallion to the public. Joy Carr has owned and or showed numerous World Champion Saddlebreds as well as National Champion Arabians. Joy Carr still actively Competes in Arabian and American Saddlebred shows both state wide and across the country as well as support local and regional events. Joy Carr has owned horses or personally competed in the following divisions; Driving, English, Western, Trail, Sidesaddle, Costume, Halter, Hunt, Working Cow, Reining, and others. Joy Carr has been awarded the Sportsmanship award by the Arabian Horse Show Association of Florida and served as delegate to the National Arabian convention from Florida on numerous occasions. She has also served as the representative from the Arabian and National Show Horse divisions to various UPHA committees.\nJoy Carr has been actively associated with the rescue and rehabilitation of dogs, cats and horses for over 40 years and has run and operated the Rescue Booth for Arabian and other horses both at the Arabian National Horse show and other locations throughout the United States. Her stories of her rescues have been published in the Saddle Horse Report and other magazines devoted to the horse for her rescue of American Saddlebred Horses from slaughter. Joy Carr has been on the board of the South Florida SPCA for horses. She has owned and shown multiple Champion and National Specialty winning Working and Terriers breeds over the years but is not presently active in the showing of dogs due to other commitments.\nJoy Carr was the youngest person to be nominated by the 11th Judicial Circuit Nominating Commission on two occasions for a Judgeship in Dade County Florida by then Governor Graham at the age of 23. Over the past 30 years she has chaired or served on dozens of Judicial campaigns as well as the Campaign committees to re-elect the Dade County State Attorney and the Dade County Public Defender. Joy Carr has also served or been actively involved in the campaigns of numerous United State legislators and congressmen.\nCarol C. Clark, DVM, Diplomate ACVIM\nGraduated from Texas A&M University in 1991.\nRead More\nCompleted internship at Peterson & Smith 1991-1992 and internal medicine residency at the University of Florida 1992-1995. Board certified by the American College of Veterinary Internal Medicine in 1995. Joined Peterson & Smith in 1996 to run the equine neonatal ICU, and manage the hospital’s internal medicine cases, became a partner in 2004. Major clinical interests: neonatology, neurology, cardiology, and ophthalmology.\nCecil Dunn\nA Judge, licensed in nine disciplines. A Registered Steward, current Board Member and Committee Member of six committees of the United States Equestrian Federation. Cecile served as Vice President of this Organization (formerly the American Horse Shows Association).\nRead More\nDirector of the Equine Science Departments at three major colleges and universities, she has spent a 37 year career in higher education. She developed curriculum in all aspects of Equine Education including Business Management, Marketing, and Equine Law. She was selected three times to receive the Who’s Who of Colleges and Universities Outstanding Teachers Award.\nJudging and Stewardign more than five hundred horse shows worldwide, Cecile has been an instructor and coach for various seats of horsemanship, including English and Western as well as Driving. A presenter of Clinics both in the US as well as Australia, South Africa, Canada, and the UK. She received the Outstanding Judges Award and Stewards Award from the Arabian Professional Horseman’s Association.\nOther activities include serving on the Advisory Board of the Scottsdale Community College Equine Program, United Professional Horseman’s Association, Saddle Seat World Cup Board, and past Board member of the North American Riding for the Handicapped.\nOriginally from South Florida, Cecile returned to Central Florida in August of 2001 when she retired from teaching. She lives on a small farm in Lady Lake where she spends her free time driving her ponies and working with several horse associations. She was appointed by the Florida Agriculture Commissioner to the Board of the Florida Horse Park, where she served as Vice President, and currently is a Board Member of the Park. She is a past Director of the Arabian Horse Association and currently is on the Education and Evaluation Commission.\nIn Two Thousand Fifteen she has been awarded two Lifetime Achievement Awards. One from the International Friesian Show Horse Association, the other from the Arabian Horse Association.\nBoard Of Directors\nCarol Dover\nChairperson\nCarol Dover has served as President/CEO of the more than 10,000 member Florida Restaurant and Lodging Association (FRLA) since July of 1995.\nRead More\nDover is a professional association manager, a lobbyist, a former government insider, and a Florida State University Dedman School of Hospitality graduate with a degree in Hotel and Restaurant Management. As the FRLA’s President/CEO, Dover works to protect, educate, and promote the diverse interests of Florida’s hospitality industry before the Florida Legislature and lobbying against unfair government regulation. The industry represents a $76.1 billion industry, 23% of Florida’s economy, $4.6 billion in sales tax revenue, and over one million employees, making it Florida’s largest employer. She also serves as a member of the Board of Directors for the National Restaurant Association, National Restaurant Association Education Foundation, Council of State Restaurant Associations, International Society of Hotel Association Executives, VISIT FLORIDA, Florida Tourism Commission, Florida TaxWatch, and the Florida Horse Park.\nLonny (Taylor) Powell\nFirst Vice–Chair\nHorse Park First Vice Chair Lonny Powell of Dunnellon is CEO of Ocala-based Florida Thoroughbred Breeders and Owners Association.\nRead More\nThe FTBOA represents the economic development, political, public relations and leadership interests of North Americas second largest Thoroughbred breeding markets breeders, horse and farm owners. In tandem Powell also serves as Publisher & CEO of Florida Equine Communications (Horse Capital Digest, Florida Horse, Wire to Wire) and executive director of Florida Thoroughbred Charities among others.\nA third generation horseman whose late father was a jockey, Powell has owned race and show/competition horses throughout his life. A big believer in stepping up to serve the community and industry when called upon, he has served as a Florida Horse Park and Agricultural Center board member since 2014 and has filled past offices of chair, 2 nd vice-chair and secretary. Powell represents the state’s equine industry as a member of the state-appointed Animal Industry Trade Council while also representing the Florida and Marion County industry on international trade missions. He also serves on the board of the Ocala/Marion County Chamber & Economic Partnerships and is immediate secretary and director of the Florida Society of Association Executives. In 2015 FTBOA received the coveted FSAE Association of the Year as well as the high honor of CEP Non Profit of the Year awards. Best known for his strategic, public relations and leadership abilities, Powell has served in a variety of equine top executive capacities including CEO of the nation’s premier race track, Santa Anita of Arcadia, CA, president of Racing Commissioner’s International, director of the University of AZ Race Track Industry Program and chief compliance office and chair of policy & internal review for You.bet.com. Immediately prior to his arrival in Florida in 2012, Powell served as a member of Arizona Governor Jan Brewer’s Cabinet as well as administrative law judge. Much of his responsibility was in the areas of regulation, enforcement and administration of pari-mutuel racing, boxing and mixed martial arts on behalf of the state and governor.\nEdward McNamara\nSecond Vice-Chair\nWinning Edge Saddlery is a family business founded by Edward McNamara, an avid polo player who was taught horsemanship through the United States Pony Club and has a background in managing large scale equestrian operations.\nRead More\nHe is now joined by his son Patrick McNamara who also plays Polo. The McNamara’s and their staff hold years of experience in multiple disciplines including hunters and jumpers, eventing, dressage and Fox Hunting.\nJim Strickland\nSecretary\nJim Strickland and his family own and operate Strickland Ranch in Myakka City, Florida. The ranch was started by Mr. Strickland’s father, Hiram Strickland, in 1938.\nRead More\nThey proudly produce beef cattle. Mr. Strickland is actively involved in his local community. He has been heavily involved with the Farm Bureau for over 20 years serving on the Beef Advisory Committee and the International Trade Task Force. Jim is a board member of the Florida Horse Park in Ocala, FL and the National Cattlemen’s Association Political Action Committee vice chair. He is a past president of the Florida Cattlemen’s Association, current chairman for the Florida Cattlemen’s Foundation and has worked with the Manatee County Fair Board for over 15 years.\nJoseph M. O’Farrell III\nTreasurer\nJoseph M. O’Farrell, III is a native of Ocala, Florida. His passion for thoroughbreds comes from growing up on the family farm, Ocala Stud. In his early years, O’Farrell worked on the farm mowing fields and feeding and caring for the farm’s yearlings.\nRead More\nA member of the Boy Scouts of America, he earned his Eagle Scout award in 1994. After high school in Ocala, he went off to Erskine College in Due West, South Carolina where he was a student athlete on the tennis team. In 1999, O’Farrell graduated with a Bachelor’s degree in Business Administration with emphasis in Accounting. After college, he went to work for The South Financial Group and Carolina First Bank in Anderson, South Carolina. In 2004, he moved back to Ocala and became a manager at Ocala Stud, handling the financial side of the farm. In late 2004, O’Farrell purchased the broodmare Lady Discreet along with his brother David and Ocala Stud as partners. In 2009, Lady Discreet became the producer of Calder Oaks winner Chary, by Montbrook. Ocala Stud has been a perennial leading Florida commercial breeder and has either solely or in partnership bred more than 100 stakes winners, including Eclipse Award winning Musical Romance, and current graded stakes winners Turbulent Descent, Tackleberry, Rigoletta, Gourmet Dinner, and Shadowbdancing. Ocala Stud currently stands popular stallions High Cotton, Montbrook, In Summation, Gottcha Gold, Adios Charlie, and Silver Tree. Joseph married Alicia W. O’Farrell in 2007. Their son Joseph “Michael” O’Farrell, IV was born in 2008.\nGreg Allen\nGreg Allen is the Vice President of Finance and Accounting for Branch Properties, Inc. (dba Seminole Feed).\nRead More\nPrior to joining the company in 1983, he was a Partner at Duggan, Joiner, Birkenmeyer, Stafford and Furman, PA. Greg has been a Member of the Florida Institute of Certified Public Accountants since 1984 and has held many offices in the local chapter, as well as serving on the State Board of Governors. He is also a member of the American Institute of Certified Public Accountants since 1984. In service to the community, Greg is a member of the Metropolitan Ocala Rotary Club which recognized him as a Paul Harris Fellow in 2007. In 2009 he earned the Service Above Self Award. He graduated from the first class of Leadership Ocala/Marion in 1988 and has served on the Board of Directors of the Ocala/Marion County Chamber of Commerce.\nJoy Maxwell Carr\nJoy Maxwell Carr, a graduate of Carrollton School of the Sacred Heart in Miami, Florida received her undergraduate degree from the University of Miami and she received her J.D. degree from the University of Miami in Miami, Florida.\nRead More\nMs. Carr was admitted to the Florida Bar in 1976 and served as an Assistant State Attorney in the 11th Judicial Circuit, in that capacity she served as a Division Chief and Major Crimes Prosecutor as well as serving in the Organized Crime section under State Attorneys Richard Gerstein and Janet Reno from 1976 to 1982. After leaving the State Attorneys office she went into private practice and formed the law firm of Carr and Carr P.A. where she is a senior partner to this day. Ms. Carr for the next several years had a varied practice including criminal defense, real estate, personal injury, divorce, probate and guardianship litigation. Ms. Carr has tried in excess of 200 jury trials and has both prosecuted and represented multiple defendants who are on Florida’s death row. Ms. Carr for the past 20 years has practiced exclusively in the area of Probate, Guardianship and Trusts in all counties across the State of Florida. Ms. Carr has and does serve on numerous committees at a local and statewide level representing the interest of the probate, guardianship and trust sector of the 11th Judicial Circuit. Ms. Carr was for three years the past Chair of the Dade County Bar Probate and Guardianship Committee and is presently the Vice Chair of that Committee and is also a member of the Real Estate Probate and Trust Section of the Florida Bar where she is an active participant on both the Guardianship Committee and the Trust Litigation Committee. Ms. Carr served three years as a member of the Board of Directors of the Dade County Bar Assoc. from which she has received numerous awards for her service both to the indigent as Pro Bono attorney of the year and for her service to the Probate Bar. Ms. Carr is now or has been a member of the American Bar Association and the Cuban American Bar Association, the Florida Association of Women’s lawyers, the Dade County Association of Trial lawyers, the Florida Association of Trial Lawyers and the American Academy of Trial lawyers. She has also been an annual EAGLE contributor with the Florida Academy of Trial lawyers. Ms. Carr is bilingual and fluent in Spanish having majored in Spanish at the University of Miami.\nJoy Maxwell Carr has owned and shown horses her entire life. Joy Carr currently owns farms in the Homestead area where she keeps and trains American Saddlebred, Arabians and half Arabian horses and stands her Arabian breeding stallion to the public. Joy Carr has owned and or showed numerous World Champion Saddlebreds as well as National Champion Arabians. Joy Carr still actively Competes in Arabian and American Saddlebred shows both state wide and across the country as well as support local and regional events. Joy Carr has owned horses or personally competed in the following divisions; Driving, English, Western, Trail, Sidesaddle, Costume, Halter, Hunt, Working Cow, Reining, and others. Joy Carr has been awarded the Sportsmanship award by the Arabian Horse Show Association of Florida and served as delegate to the National Arabian convention from Florida on numerous occasions. She has also served as the representative from the Arabian and National Show Horse divisions to various UPHA committees.\nJoy Carr has been actively associated with the rescue and rehabilitation of dogs, cats and horses for over 40 years and has run and operated the Rescue Booth for Arabian and other horses both at the Arabian National Horse show and other locations throughout the United States. Her stories of her rescues have been published in the Saddle Horse Report and other magazines devoted to the horse for her rescue of American Saddlebred Horses from slaughter. Joy Carr has been on the board of the South Florida SPCA for horses. She has owned and shown multiple Champion and National Specialty winning Working and Terriers breeds over the years but is not presently active in the showing of dogs due to other commitments.\nJoy Carr was the youngest person to be nominated by the 11th Judicial Circuit Nominating Commission on two occasions for a Judgeship in Dade County Florida by then Governor Graham at the age of 23. Over the past 30 years she has chaired or served on dozens of Judicial campaigns as well as the Campaign committees to re-elect the Dade County State Attorney and the Dade County Public Defender. Joy Carr has also served or been actively involved in the campaigns of numerous United State legislators and congressmen.\nCarol C. Clark, DVM, Diplomate ACVIM\nGraduated from Texas A&M University in 1991.\nRead More\nCompleted internship at Peterson & Smith 1991-1992 and internal medicine residency at the University of Florida 1992-1995. Board certified by the American College of Veterinary Internal Medicine in 1995. Joined Peterson & Smith in 1996 to run the equine neonatal ICU, and manage the hospital’s internal medicine cases, became a partner in 2004. Major clinical interests: neonatology, neurology, cardiology, and ophthalmology.\nCecil Dunn\nA Judge, licensed in nine disciplines. A Registered Steward, current Board Member and Committee Member of six committees of the United States Equestrian Federation. Cecile served as Vice President of this Organization (formerly the American Horse Shows Association).\nRead More\nDirector of the Equine Science Departments at three major colleges and universities, she has spent a 37 year career in higher education. She developed curriculum in all aspects of Equine Education including Business Management, Marketing, and Equine Law. She was selected three times to receive the Who’s Who of Colleges and Universities Outstanding Teachers Award.\nJudging and Stewardign more than five hundred horse shows worldwide, Cecile has been an instructor and coach for various seats of horsemanship, including English and Western as well as Driving. A presenter of Clinics both in the US as well as Australia, South Africa, Canada, and the UK. She received the Outstanding Judges Award and Stewards Award from the Arabian Professional Horseman’s Association.\nOther activities include serving on the Advisory Board of the Scottsdale Community College Equine Program, United Professional Horseman’s Association, Saddle Seat World Cup Board, and past Board member of the North American Riding for the Handicapped.\nOriginally from South Florida, Cecile returned to Central Florida in August of 2001 when she retired from teaching. She lives on a small farm in Lady Lake where she spends her free time driving her ponies and working with several horse associations. She was appointed by the Florida Agriculture Commissioner to the Board of the Florida Horse Park, where she served as Vice President, and currently is a Board Member of the Park. She is a past Director of the Arabian Horse Association and currently is on the Education and Evaluation Commission.\nIn Two Thousand Fifteen she has been awarded two Lifetime Achievement Awards. One from the International Friesian Show Horse Association, the other from the Arabian Horse Association.",
      "emails": []
    },
    {
      "url": "https://flhorsepark.com/calender-of-events/",
      "is_candidate": false,
      "has_email": false,
      "text": "Calendar of Events\n<\nAugust\n<\n2025\n>\nSeptember\nOctober\n>\n«\n»\nMon\nTue\nWed\nThu\nFri\nSat\nSun\n1\n2\n3\n4\n5\nFHSAA Cross Country Meet\nFHSAA Cross Country Meet\nAll day\n05/09/2025\nFlorida Horse Park\n11008 S Hwy 475, Ocala, FL 34480\nFlorida High School Cross Country meet. Admission fee.\nhttps://fhsaa.com/sports/cross\n6\nFHSAA Cross Country Meet\nFHSAA Cross Country Meet\nAll day\n06/09/2025\nFlorida Horse Park\n11008 S Hwy 475, Ocala, FL 34480\nFlorida High School Cross Country meet. Admission fee.\nhttps://fhsaa.com/sports/cross\n7\n8\n9\n10\n11\n12\n13\nMounted Drill Team\nMounted Drill Team\nAll day\n13/09/2025\nFlorida Horse Park\n11008 S Hwy 475, Ocala, FL 34480\nDrill Team competition where horses and riders perform choreographed patterns in unison.\nhttps://ssmdta.com/page/\n14\nMounted Drill Team\nMounted Drill Team\nAll day\n14/09/2025\nFlorida Horse Park\n11008 S Hwy 475, Ocala, FL 34480\nDrill Team competition where horses and riders perform choreographed patterns in unison.\nhttps://ssmdta.com/page/\n15\n16\n17\n18\n19\n20\nPOP Schooling Show\nPOP Schooling Show\nAll day\n20/09/2025\nEmily Holmes\nFlorida Horse Park\n11008 S Hwy 475, Ocala, FL 34480\nhttps://flhorsepark.com/pop-shows/\n21\nPOP Schooling Show\nPOP Schooling Show\nAll day\n21/09/2025\nEmily Holmes\nFlorida Horse Park\n11008 S Hwy 475, Ocala, FL 34480\nhttps://flhorsepark.com/pop-shows/\n22\n23\n24\n25\n26\nLets Go Show All Breed Open Show\nLets Go Show All Breed Open Show\nAll day\n26/09/2025\nMichele Svenningsen\nFlorida Horse Park, West Entrance\n11851 SW 16th Avenue, Ocala, FL\nhttp://wegoshow.com\n27\nLets Go Show All Breed Open Show\nLets Go Show All Breed Open Show\nAll day\n27/09/2025\nMichele Svenningsen\nFlorida Horse Park, West Entrance\n11851 SW 16th Avenue, Ocala, FL\nhttp://wegoshow.com\nMarion Saddle Club\nMarion Saddle Club\nAll day\n27/09/2025\nKelly Myers\nFlorida Horse Park, West Entrance\n11851 SW 16th Avenue, Ocala, FL\nhttps://www.mschorseshows.net/\n28\nLets Go Show All Breed Open Show\nLets Go Show All Breed Open Show\nAll day\n28/09/2025\nMichele Svenningsen\nFlorida Horse Park, West Entrance\n11851 SW 16th Avenue, Ocala, FL\nhttp://wegoshow.com\n29\n30\nOctober\nOctober\nOctober\nOctober\nOctober\nShare this:\nClick to share on X (Opens in new window)\nX\nClick to share on Facebook (Opens in new window)\nFacebook\nLike this:\nLike\nLoading...\n#post-##\nCalendar of Events\n<\nAugust\n<\n2025\n>\nSeptember\nOctober\n>\n«\n»\nMon\nTue\nWed\nThu\nFri\nSat\nSun\n1\n2\n3\n4\n5\nFHSAA Cross Country Meet\nFHSAA Cross Country Meet\nAll day\n05/09/2025\nFlorida Horse Park\n11008 S Hwy 475, Ocala, FL 34480\nFlorida High School Cross Country meet. Admission fee.\nhttps://fhsaa.com/sports/cross\n6\nFHSAA Cross Country Meet\nFHSAA Cross Country Meet\nAll day\n06/09/2025\nFlorida Horse Park\n11008 S Hwy 475, Ocala, FL 34480\nFlorida High School Cross Country meet. Admission fee.\nhttps://fhsaa.com/sports/cross\n7\n8\n9\n10\n11\n12\n13\nMounted Drill Team\nMounted Drill Team\nAll day\n13/09/2025\nFlorida Horse Park\n11008 S Hwy 475, Ocala, FL 34480\nDrill Team competition where horses and riders perform choreographed patterns in unison.\nhttps://ssmdta.com/page/\n14\nMounted Drill Team\nMounted Drill Team\nAll day\n14/09/2025\nFlorida Horse Park\n11008 S Hwy 475, Ocala, FL 34480\nDrill Team competition where horses and riders perform choreographed patterns in unison.\nhttps://ssmdta.com/page/\n15\n16\n17\n18\n19\n20\nPOP Schooling Show\nPOP Schooling Show\nAll day\n20/09/2025\nEmily Holmes\nFlorida Horse Park\n11008 S Hwy 475, Ocala, FL 34480\nhttps://flhorsepark.com/pop-shows/\n21\nPOP Schooling Show\nPOP Schooling Show\nAll day\n21/09/2025\nEmily Holmes\nFlorida Horse Park\n11008 S Hwy 475, Ocala, FL 34480\nhttps://flhorsepark.com/pop-shows/\n22\n23\n24\n25\n26\nLets Go Show All Breed Open Show\nLets Go Show All Breed Open Show\nAll day\n26/09/2025\nMichele Svenningsen\nFlorida Horse Park, West Entrance\n11851 SW 16th Avenue, Ocala, FL\nhttp://wegoshow.com\n27\nLets Go Show All Breed Open Show\nLets Go Show All Breed Open Show\nAll day\n27/09/2025\nMichele Svenningsen\nFlorida Horse Park, West Entrance\n11851 SW 16th Avenue, Ocala, FL\nhttp://wegoshow.com\nMarion Saddle Club\nMarion Saddle Club\nAll day\n27/09/2025\nKelly Myers\nFlorida Horse Park, West Entrance\n11851 SW 16th Avenue, Ocala, FL\nhttps://www.mschorseshows.net/\n28\nLets Go Show All Breed Open Show\nLets Go Show All Breed Open Show\nAll day\n28/09/2025\nMichele Svenningsen\nFlorida Horse Park, West Entrance\n11851 SW 16th Avenue, Ocala, FL\nhttp://wegoshow.com\n29\n30\nOctober\nOctober\nOctober\nOctober\nOctober\nShare this:\nClick to share on X (Opens in new window)\nX\nClick to share on Facebook (Opens in new window)\nFacebook\nLike this:\nLike\nLoading...",
      "emails": []
    },
    {
      "url": "https://flhorsepark.com/ocala-eventing-series/event-officials-personnel/",
      "is_candidate": false,
      "has_email": false,
      "text": "Event Officials + Personnel\nEventing Personnel Page\nCrisis Management Plan\nContracts + Invoices\nIf you haven’t completed a W9, this year, please click here:\nContract + Invoice + W9 Form\nRepeat personnel, please complete this form:\nContract + Invoice NO W9\nShare this:\nClick to share on X (Opens in new window)\nX\nClick to share on Facebook (Opens in new window)\nFacebook\nLike this:\nLike\nLoading...\n#post-##\nEvent Officials + Personnel\nEventing Personnel Page\nCrisis Management Plan\nContracts + Invoices\nIf you haven’t completed a W9, this year, please click here:\nContract + Invoice + W9 Form\nRepeat personnel, please complete this form:\nContract + Invoice NO W9\nShare this:\nClick to share on X (Opens in new window)\nX\nClick to share on Facebook (Opens in new window)\nFacebook\nLike this:\nLike\nLoading...",
      "emails": []
    },
    {
      "url": "https://flhorsepark.com/staff-directory/",
      "is_candidate": false,
      "has_email": true,
      "text": "Staff Directory\nJason Reynolds\nExecutive Director\njreynolds@flhorsepark.com\nKristen Wilkinson\nController\nkwilkinson@flhorsepark.com\nKim VanDerWalt\nEvents Coordinator\nkvanderwalt@flhorsepark.com\nMatt Bell\nFacilities Manager\nmaintenance@flhorsepark.com\nFacilities Team:\nGary Eikner\nShare this:\nClick to share on X (Opens in new window)\nX\nClick to share on Facebook (Opens in new window)\nFacebook\nLike this:\nLike\nLoading...\n#post-##\nStaff Directory\nJason Reynolds\nExecutive Director\njreynolds@flhorsepark.com\nKristen Wilkinson\nController\nkwilkinson@flhorsepark.com\nKim VanDerWalt\nEvents Coordinator\nkvanderwalt@flhorsepark.com\nMatt Bell\nFacilities Manager\nmaintenance@flhorsepark.com\nFacilities Team:\nGary Eikner\nShare this:\nClick to share on X (Opens in new window)\nX\nClick to share on Facebook (Opens in new window)\nFacebook\nLike this:\nLike\nLoading...",
      "emails": [
        "jreynolds@flhorsepark.com",
        "kvanderwalt@flhorsepark.com",
        "kwilkinson@flhorsepark.com",
        "maintenance@flhorsepark.com"
      ]
    },
    {
      "url": "https://www.facebook.com/FloridaHorsePark/",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    }
  ],
  "all_links": [
    "https://flhorsepark.com/jim-strickland-photo/",
    "https://flhorsepark.com/staff-directory/18518150_10212986166359078_3279974525928129190_o/",
    "https://flhorsepark.com/staff-directory/img-9557/",
    "https://flhorsepark.com/board-of-directors/?share=facebook",
    "https://flhorsepark.com/event/frvta-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2/",
    "https://flhorsepark.com/hotel-partners/",
    "https://flhorsepark.com/press-releases/",
    "https://flhorsepark.com/board-of-directors/?share=twitter",
    "https://flhorsepark.com/public-access-policy/",
    "https://flhorsepark.com/pop-shows/",
    "https://flhorsepark.com/event/frvta-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2/",
    "http://www.flhorsepark.com/",
    "https://flhorsepark.com/",
    "https://flhorsepark.com/contact/",
    "https://flhorsepark.com/facility-rental/",
    "https://flhorsepark.com/handicap-accessibility/",
    "https://flhorsepark.com/board-of-directors/chester-headshot-2021/",
    "https://flhorsepark.com/board-of-directors/image0-1/",
    "https://flhorsepark.com/ocala-eventing-series/",
    "https://flhorsepark.com/amenities/",
    "https://flhorsepark.com/vendors/",
    "https://flhorsepark.com/release-of-liability/",
    "https://flhorsepark.com/staff-directory/?share=twitter",
    "https://flhorsepark.com/events/page/2/",
    "https://flhorsepark.com/board-of-directors/",
    "http://www.flhorsepark.com/contact/",
    "https://flhorsepark.com/sponsorship-opportunities/",
    "https://flhorsepark.com/q-a/",
    "https://flhorsepark.com/volunteer/",
    "https://flhorsepark.com/calender-of-events/",
    "https://flhorsepark.com/event/florida-mopar-2-2-2-2-3-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-3-2-2-2-2/",
    "https://flhorsepark.com/event/florida-mopar-2-2-2-2-3-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-3-2/",
    "https://flhorsepark.com/staff-directory/?share=facebook",
    "https://flhorsepark.com/map-of-the-park/",
    "https://flhorsepark.com/event/frvta-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2/",
    "https://flhorsepark.com/event/frvta-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2/",
    "https://flhorsepark.com/event/florida-mopar-2-2-2-2-3-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-3-2-2-2/",
    "https://flhorsepark.com/event/florida-mopar-2-2-2-2-3-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-3-2-2/",
    "https://flhorsepark.com/ocala-eventing-series/event-officials-personnel/",
    "https://flhorsepark.com/staff-directory/",
    "https://flhorsepark.com/event/frvta-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2/",
    "https://flhorsepark.com/event/frvta-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2-2/",
    "https://flhorsepark.com/facility/",
    "https://flhorsepark.com/vendors/fhp-fundraiser/"
  ],
  "candidate_links": [
    "https://flhorsepark.com/contact/",
    "https://flhorsepark.com/board-of-directors/",
    "https://flhorsepark.com/calender-of-events/",
    "https://flhorsepark.com/ocala-eventing-series/event-officials-personnel/",
    "https://flhorsepark.com/staff-directory/",
    "https://www.facebook.com/FloridaHorsePark/"
  ],
  "visited": [
    "http://www.flhorsepark.com/",
    "http://www.flhorsepark.com/about",
    "http://www.flhorsepark.com/contact",
    "http://www.flhorsepark.com/staff",
    "http://www.flhorsepark.com/team",
    "http://www.flhorsepark.com/board",
    "http://www.flhorsepark.com/directory",
    "http://www.flhorsepark.com/events",
    "http://www.flhorsepark.com/sitemap.xml",
    "http://www.flhorsepark.com/council",
    "http://www.flhorsepark.com/leadership",
    "http://www.flhorsepark.com/management",
    "http://www.flhorsepark.com/producers",
    "http://www.flhorsepark.com/support",
    "http://www.flhorsepark.com/crew",
    "http://www.flhorsepark.com/members",
    "http://www.flhorsepark.com/bios",
    "http://www.flhorsepark.com/people",
    "http://www.flhorsepark.com/artists",
    "http://www.flhorsepark.com/musicians",
    "http://www.flhorsepark.com/faculty",
    "http://www.flhorsepark.com/administration",
    "https://flhorsepark.com/contact/",
    "https://flhorsepark.com/board-of-directors/",
    "https://flhorsepark.com/calender-of-events/",
    "https://flhorsepark.com/ocala-eventing-series/event-officials-personnel/",
    "https://flhorsepark.com/staff-directory/",
    "https://www.facebook.com/FloridaHorsePark/"
  ],
  "base_url": "http://www.flhorsepark.com/"
}