{
  "pages": [
    {
      "url": "https://www.florabama.com/daily-events",
      "is_candidate": false,
      "has_email": false,
      "text": "========= Site Content =========\nHome\nAbout\nAbout Us\nArticles\nGallery\nVideos\nHey Y'all\nEvents\nAnnual Events\nDaily Events\nFlora-Bama Church\nTickets\nLive Music\nFood\nOyster Bar\nOle River Grill\nYacht Club\nStore\nMarina\nContact\nContact\nStories\nHome\nAbout\nAbout Us\nArticles\nGallery\nVideos\nHey Y'all\nEvents\nAnnual Events\nDaily Events\nFlora-Bama Church\nTickets\nLive Music\nFood\nOyster Bar\nOle River Grill\nYacht Club\nStore\nMarina\nContact\nContact\nStories\nnavigation placeholders\nDaily Events\nFlora-Bama\nDaily Events\n365 days of FUN\nCome check out Ladies Night, Membership Night, Free Bingo, Monday through Friday, or one of the many other events during the week at Flora-Bama. Don't forget to visit the\nChurch\non Sundays where \"It's OK to not be OK\".\nSee the full list of daily events below or check out the Annual Events\nHERE\nSlide title\nAlways a special night at the Bama!\nButton\nSlide title\nChurch on the beach every Sunday\nButton\nSlide title\nBingo Afternoons!\nButton\nSlide title\nThursday nights, Members get their first drink free (value up to $6)\nButton\nDaily Details\nBelow\nJoin Our Team\nFlora-Bama is always seeking great new members\nApply Here\nLocation\n17401 Perdido Key Dr.\nPerdido Key, FL. 32507\nBamily List\nGet notified of tickets, events and sales\nCall\n(251) 980-5118\nGood Times and Good Music since 1964.\nRegulatory\nDoor Policy\nPrivacy Policy\nADA Information\nNews Room\nJoin The Bamily\nOther Pages\nFlora-Bama Marina\nFlora-Bama Liquor & Lotto\nFlora-Bama Store\nFlora-Bama Yacht Club\nOle River Grill\nBar Working Hours\nMon - Sun\n11:00 am\n-\n2:30 am\nGift Shop Hours\nMon - Sun\n9:00 am\n-\n2:30 am\n© 2025\nAll Rights Reserved | Flora-Bama\nAdd full CSS and Javascript before the close tag of the body if needed\n========= JS Section =========\nLoad jQuery\nEnd Load jQuery\nInjecting site-wide before scripts\nEnd Injecting site-wide to the head\nHEAD RT JS Include\nEnd of HEAD RT JS Include\nphotoswipe markup\nRoot element of PhotoSwipe. Must have class pswp.\nBackground of PhotoSwipe. \n         It's a separate element as animating opacity is faster than rgba().\nSlides wrapper with overflow:hidden.\nContainer that holds slides. \n            PhotoSwipe keeps only 3 of them in the DOM to save memory.\n            Don't modify these 3 pswp__item elements, data is added later on.\nDefault (PhotoSwipeUI_Default) interface on top of sliding area. Can be changed.\nControls are self-explanatory. Order can be changed.\nPreloader demo http://codepen.io/dimsemenov/pen/yyBWoR\nelement will get class pswp__preloader--active when preloader is running\nAlias: 9a97c64c\nShare by:\nEnd Script tags\nSite Wide Html Markup\nSite Wide Html Markup",
      "emails": []
    },
    {
      "url": "https://www.florabama.com/contact",
      "is_candidate": false,
      "has_email": true,
      "text": "========= Site Content =========\nHome\nAbout\nAbout Us\nArticles\nGallery\nVideos\nHey Y'all\nEvents\nAnnual Events\nDaily Events\nFlora-Bama Church\nTickets\nLive Music\nFood\nOyster Bar\nOle River Grill\nYacht Club\nStore\nMarina\nContact\nContact\nStories\nHome\nAbout\nAbout Us\nArticles\nGallery\nVideos\nHey Y'all\nEvents\nAnnual Events\nDaily Events\nFlora-Bama Church\nTickets\nLive Music\nFood\nOyster Bar\nOle River Grill\nYacht Club\nStore\nMarina\nContact\nContact\nStories\nnavigation placeholders\nCome See Us\nContact Us\nWe do not take reservations or call ahead for seating, as all of our restaurants are casual dining, first-come, first-serve restaurants.\nLocation\n17401 Perdido Key Dr.\nPerdido Key, FL. 32507\nEmail\ninfo@florabama.com\nCall\n(251) 980-5118\nAsk Us\nWe love to hear from you, but first check out our answers to the most asked questions below.\nHack to initialise popups\nAt 6pm, only those ages 18 and older will be permitted entry. Those who are 18 to 20 years old can stay all night as long as they are in the door by 10PM with no re-entry.\nCover charge will apply daily beginning at 6PM. Those who are 18 to 20 years old can stay all night as long as they are in the door by 10PM with no re-entry.\n$5 for 21yrs & older\n$20 for 18-21yrs\nATTENTION: The Flora-Bama is located in the state of Florida and Florida law states that we DO NOT accept LA Wallet / Digital ID's. All customers need to have a physical (current) ID to gain entrance into the Flora-Bama.\nDaily: Gift Shop - 9am to 2:30am and Flora-Bama Lounge & Oyster Bar - 11am to 2:30am\nWe're family friendly for all ages every day until 6pm. At 6pm, only those ages 18 and older will be permitted entry. Those who are 18 to 20 years old can stay all night as long as they are in the door by 10PM with no re-entry.\nWe also have two dine-in restaurants located across the street: Flora-Bama Yacht Club and Flora-Bama Ole River Grill. Both open daily at 11AM and both are family friendly all hours of operation!\n• Ole River Grill will be open from 11AM - 9PM Sun-Thurs and 11AM - 10PM Fri - Sat.\n• Flora-Bama Yacht Club will be open from 11AM - 9PM Sunday through Thursday and 11AM - 10PM Friday & Saturday.\nNO.\nThe Flora-Bama is located in the state of Florida and Florida law states that we DO NOT accept LA Wallet / Digital ID's. All customers need to have a physical (current) ID to gain entrance into the Flora-Bama.\nForms of ID Accepted:\nCurrent, non-expired driver's license, current passport, military, or state issued. We do not accept any paper ID's or digital ID's.\nYes, of course! You are welcome to utilize the beach behind the Flora-Bama and can walk through to the boardwalk for access beginning at 10AM daily.\nNO OUTSIDE ALCOHOL OR COOLERS ALLOWED through our doors or on our premises, though you are welcome to bring your beach bag essentials, chairs, towels etc.\nPlease note that Food & Alcohol Sales begin daily at 11AM (live music begins daily at 12PM).\nYes. Free bingo is Monday - Friday from 1p-4p in the Tent Stage.\nWe love bachelor and bachelorette parties! You can visit\nHERE\nto get some ideas and we look forward to seeing your group at the Flora-Bama.\nWe appreciate your interest in joining the Flora-Bama music scene! Please use the following link to submit your information to our Entertainment Department and they will contact you back: www.florabama.com/entertainers. You can also send your EPK/email request to booking@florabama.com.\nWe do ask that you please bear with us as our team acquires a large amount of requests each day from those interested in playing at one of our  Flora-Bama music venues. Hope to see ya around soon! You can also send an email request to booking@florabama.com\nWell, of course our recipe is infamous for being a best kept secret... but think of it as an adult frozen milkshake sure to kick up a good time!\nUnfortunately, our licensing does not permit us to selll Bushwackers to-go or by the gallon...but we'd love to have you over for some cold snacks!\nThere are lots of great places to stay and within walking distance or just a short Uber or car ride away! We would suggest MEDITERRANEAN WEST or PHOENIX X, both are beachfront and located adjacent to the Flora-Bama.\nYou can always look into our local property management companies for availability --> Brett/Robinson (all Phoenix condos in Gulf Shores and Orange Beach), Meyer Real Estate, Kaiser Realty and Luxury Coastal Vacations just to name a few.\nMake sure to check out this luxury condo, located at the Mediterranean West next door to the Flora-Bama: https://www.luxurycoastalvacations.com/gulf-coast-vacation-rentals/mediterranean-west-802\nWe sure do... and Worship on the Water has actually become almost as famous as the bar! Join us on Sunday's for one of our two Worship Services held at 9AM and 11AM under the Tent behind the Flora-Bama. No fancy Sunday dress necessary, feel free to come casual while you enjoy the good word and live music throughout the service. Afterwards, stick around for some grub at either the FLora-Bama Oyster Bar or visit our resturants located across the street: The Flora-Bama Yacht Club and Flora-Bama Ole River Grill, both open daily at 11AM and family friendly all hours of operation.\nWe are open 365 days a year with live music every day as well. Come on by and meet the Bamily!\nThe Flora-Bama is a place where we encourage people of all walks of life to gather together, enjoy live music, food, drinks and create lasting memories with friends while making some new friendships along the way. This has historically included our furry friends as well, as the Flora-Bama loves animals and knows that many of our awesome patrons are pet owners (as are our owners!). Upon considering a tremendous amount of factors over a lengthy and difficult process, we have unfortunately decided to no longer allow dogs at the Flora-Bama, Flora-Bama Yacht Club, and Flora-Bama Ole River Grill moving forward. We have come to this decision with the ultimate intent of providing the safest, cleanest, and most positive atmosphere for our patrons to enjoy while on property. We truly appreciate your business and will continue to do our absolute best to create an environment for our customers that translates into lasting and enjoyable memories. Please be patient with us during this transition, as this was a very tough, but necessary choice. We look forward to seeing everyone this season and will miss our K-9 pals!\nYes, there are several areas for you to smoke. Though we do have very strict rules about what you can smoke ... meaning, nothing illegal.\nIf you're not looking to rent your watersport fun from the Flora-Bama Marina, then you can contact Ike's Beach Service to inquire more info on the Parasailing, Banana Boats and Beach Chair availabilty located beachside behind the Flora-Bama. Ike's Beach Attendants are out there daily (during season) and will be happy to help! You can also find contact information for Ike's Beach Service here: https://www.ikesbeachservice.com/\nYou have 45 days to return items for a full refund, with or without a receipt. Items must still have their original tags.\nFlora-Bama produces more than 100 events every year, so there is limited availability to host outside events. Please answer these questions\nHERE\nso our event team can follow up with you with more information regarding your request.\nEmail Us\nPlease select a subject and one of our Team members will get in touch with you soon.\nJoin Our Team\nFlora-Bama is always seeking great new members\nApply Here\nLocation\n17401 Perdido Key Dr.\nPerdido Key, FL. 32507\nBamily List\nGet notified of tickets, events and sales\nCall\n(251) 980-5118\nGood Times and Good Music since 1964.\nRegulatory\nDoor Policy\nPrivacy Policy\nADA Information\nNews Room\nJoin The Bamily\nOther Pages\nFlora-Bama Marina\nFlora-Bama Liquor & Lotto\nFlora-Bama Store\nFlora-Bama Yacht Club\nOle River Grill\nBar Working Hours\nMon - Sun\n11:00 am\n-\n2:30 am\nGift Shop Hours\nMon - Sun\n9:00 am\n-\n2:30 am\n© 2025\nAll Rights Reserved | Flora-Bama\nAdd full CSS and Javascript before the close tag of the body if needed\n========= JS Section =========\nLoad jQuery\nEnd Load jQuery\nInjecting site-wide before scripts\nEnd Injecting site-wide to the head\nHEAD RT JS Include\nEnd of HEAD RT JS Include\nphotoswipe markup\nRoot element of PhotoSwipe. Must have class pswp.\nBackground of PhotoSwipe. \n         It's a separate element as animating opacity is faster than rgba().\nSlides wrapper with overflow:hidden.\nContainer that holds slides. \n            PhotoSwipe keeps only 3 of them in the DOM to save memory.\n            Don't modify these 3 pswp__item elements, data is added later on.\nDefault (PhotoSwipeUI_Default) interface on top of sliding area. Can be changed.\nControls are self-explanatory. Order can be changed.\nPreloader demo http://codepen.io/dimsemenov/pen/yyBWoR\nelement will get class pswp__preloader--active when preloader is running\nAlias: 9a97c64c\nShare by:\nEnd Script tags\nSite Wide Html Markup\nSite Wide Html Markup",
      "emails": [
        "booking@florabama.com",
        "info@florabama.com"
      ]
    },
    {
      "url": "https://www.florabama.com/annual-events",
      "is_candidate": false,
      "has_email": false,
      "text": "========= Site Content =========\nHome\nAbout\nAbout Us\nArticles\nGallery\nVideos\nHey Y'all\nEvents\nAnnual Events\nDaily Events\nFlora-Bama Church\nTickets\nLive Music\nFood\nOyster Bar\nOle River Grill\nYacht Club\nStore\nMarina\nContact\nContact\nStories\nHome\nAbout\nAbout Us\nArticles\nGallery\nVideos\nHey Y'all\nEvents\nAnnual Events\nDaily Events\nFlora-Bama Church\nTickets\nLive Music\nFood\nOyster Bar\nOle River Grill\nYacht Club\nStore\nMarina\nContact\nContact\nStories\nnavigation placeholders\nEvents\nAnnual Events of the\nFlora-Bama\nThe most famous beach bar in the country, the Flora-Bama Lounge, has numerous Annual Events during the year. Our regular guests plan their schedules around our beach concerts, fishing rodeos, chili cook-offs, marathons and much more. Check out the schedule below for the complete list. If you would like to know about our WEEKLY EVENTS please click\nHERE\nSome events may be ticketed and you can purchase those through our website\nHERE\n.\nSlide title\nPolar Bear Dip\nButton\nSlide title\nOktoberfest\nButton\nSlide title\nNew Year's Eve\nButton\nSlide title\nMullet Toss\nButton\nSlide title\nChristmas Pot Luck\nButton\nSlide title\nBulls On The Beach\nButton\nSlide title\nBeach Run\nButton\nSlide title\nHalloween\nButton\nSlide title\nAnnual Beach Run/Walk\nButton\nSlide title\nSuper Chili Bowl Cook-Off\nButton\nSlide title\nEaster Egg Hunt\nButton\nLegendary Events At\nFlora-Bama\nPolar Bear Dip\nJanuary 1st, 2025\nAfter celebrating New Year's Eve at the Flora-Bama there is only one way to start the new year .... by taking a plunge into the Gulf of Mexico with a few thousand of your friends.\nRead More\nSuper Chili Bowl Cook-Off\nSaturday, February 8th, 2025\nThe Chili Bowl Cook-Off raises funds for the American Cancer Society. Enter your team for a great event or come taste the fantastic recipes. All proceeds go to charity.\nRead More\nBoozy Bee Spelling Bee\nSunday, March 9th\nHave you been personally victimized by a grade school spelling bee that left you questioning whether you really knew English? Get your revenge by signing up for our Boozy Adult Spelling Bee!\nRead More\nFlora-Bama Annual Beach Run/Walk\nSaturday, March 15th, 2025\nAnnual Beach Run/Walk for America's Warriors will be the best run of the year!  The start and end point is right here at the Flora-Bama and we run entirely on the beach!\nRead More\nMullet Man Triathlon\nSaturday, April 12th, 2025\nThe Mullet Man Triathlon has proven to be a definite addition to the Annual Interstate Mullet Toss® and Gulf Coast’s Greatest Beach Party . This is our 24th Annual Mullet Man Triathlon!\nRead More\nEaster Egg Hunt & Bunny Drop\nSaturday, April 19th, 2025\nHappy Easter to everybunny! Kids' crafts and face painting in the tent. Festivities will begin at 11AM.\nRead More\nMullet Swing Golf Classic\nWednesday, April 23rd, 2025\nNow THIS is the way to play golf! The 25th Annual Mullet Swing Golf Classic will be a 4-person scramble. Maximum handicap per player is 30. This will fill up fast so book your team!\nRead More\nInterstate Mullet Toss & Beach Party\nApril 25th-27th, 2025\nThe Interstate Mullet Toss & Gulf Coast’s Greatest Beach Party is legendary. What started as just a reason to party has become one of the biggest beach parties on the coast.\nRead More\nBikini & Hot Body Contest\nHeld on: Mullet Toss Weekend (Friday & Saturday), Memorial Day Weekend, 4th of July Weekend and Labor Day Weekend\nIt wouldn't be a beach bar without a few bikini contest. Top 3 finalist have a chance to win $5,000 so register now.\nRead More\nThe Bushwacker's 50th B-Day Bash\nMay 31st, 2025\nHappy birthday, you delicious adult masterpiece! Everyone's favorite cocktail, the world famous Flora-Bama Bushwacker is turning 50 and we're throwing a party to celebrate!\nRead More\nFlora-Bama Fishing Rodeo\nJune 6,7  & Awards On 8th, 2025\nThe 'Funnest' Fishing Tournament on the Gulf Coast -  the Annual Fishing Rodeo is the \"Every Mans\" fishing rodeo! Just like the Flora-Bama, you don't have to be a VIP to fish with us!\nRead More\nFlora-Bama Freedom Run\nSaturday, July 5th, 2025\nThis patriotic run features two courses: The 4-Mile Run/Walk Course or the 1-Mile Fun Run/Walk! Break out your best red, white and blue attire to make this run scream AMERICA!\nRead More\nJuly 4th Party\nJuly 4th\nThe 4th of July Party at Flora-Bama is Legendary! Come to the beach and enjoy a Bikini Contest, Live Music, Freedom Run, fireworks with Red-White-Blue fun!\nRead More\nSandstock\nSaturday, August 9th\nFlora-Bama's ode to Woodstock - join us for Sandstock! Wear your favorite hippie attire on Saturday, August 9th, as the Flora-Bama goes back in time! Festivities are all day with live music from the 60's, themed food, and decor.\nRead More\nBulls On The Beach\nSept. 4th - 6th, 2025\nBulls On The Beach is one of Flora-Bama's most anticipated events of the year! Bring the family out to experience the ultimate adrenaline rush with three nights of live rodeo action.\nRead More\nOktoberFest\nSunday, Oct. 12th, 2025\nBreak out your lederhosen for Flora-Bama's Oktoberfest. A great event for beer and food lovers. Earn a free stein and enjoy a complimentary German food from the buffet.\nRead More\nHalloween Contest\nOctober 31st\nOn All Hallow's Eve, the Flora-Bama is THE place to be! Better bring your costume \"A Game\" our contenders go over the top to compete for prizes in our annual Halloween Costume contest.\nRead More\nFrank Brown's Songwriters Festival\nNov. 6th - 16th, 2025\nThe Annual Frank Brown International Songwriters’ Festival will feature more than 200 nationally acclaimed songwriters. The festival is  for songwriters and musicians from all over the world.\nRead More\nFlora-Bama's Thanksgiving Potluck\nThanksgiving Day - Thursday, November 27th, 2025\nWe are so thankful each year for the wonderful guests, fantastic team members and amazing surroundings. The Flora-Bama invites you to eat, drink and be thankful at our tradition.\nRead More\nSanta Drop At Flora-Bama\nSaturday, December 6th, 2025\nWe kick-off the Christmas holidays with our annual Santa Drop here at the World Famous Flora-Bama!  See Santa skydive onto our white sandy beaches then jump in line in the Tent for Santa pics!\nRead More\nAnnual Christmas Potluck\nChristmas Day, Dec. 25th\nWhether you have been naughty or nice the Flora-Bama Christmas Potluck is a time for gathering of friends and family. Just bring a side dish and friend we have the meats covered.\nRead More\nMake It To The Line Run/Walk\nSaturday, December 27th, 2025\nRun, jog, walk or crawl at the Annual Make It To The Line 4-miler fun run/walk. This is a great family event and proceeds go to the Secret Santa Fund to benefit local families in need.\nRead More\nFlora-Bama's New Year's Eve Bash\nDecember 31st, 2025\nThe Flora-Bama is THE place to be on New Year’s Eve! Live music on all three stages. Food, party favors, and a midnight champagne toast to good times On The Line as we ring in the New Year, Flora-Bama style!\nRead More\nJoin Our Team\nFlora-Bama is always seeking great new members\nApply Here\nLocation\n17401 Perdido Key Dr.\nPerdido Key, FL. 32507\nBamily List\nGet notified of tickets, events and sales\nCall\n(251) 980-5118\nGood Times and Good Music since 1964.\nRegulatory\nDoor Policy\nPrivacy Policy\nADA Information\nNews Room\nJoin The Bamily\nOther Pages\nFlora-Bama Marina\nFlora-Bama Liquor & Lotto\nFlora-Bama Store\nFlora-Bama Yacht Club\nOle River Grill\nBar Working Hours\nMon - Sun\n11:00 am\n-\n2:30 am\nGift Shop Hours\nMon - Sun\n9:00 am\n-\n2:30 am\n© 2025\nAll Rights Reserved | Flora-Bama\nAdd full CSS and Javascript before the close tag of the body if needed\n========= JS Section =========\nLoad jQuery\nEnd Load jQuery\nInjecting site-wide before scripts\nEnd Injecting site-wide to the head\nHEAD RT JS Include\nEnd of HEAD RT JS Include\nphotoswipe markup\nRoot element of PhotoSwipe. Must have class pswp.\nBackground of PhotoSwipe. \n         It's a separate element as animating opacity is faster than rgba().\nSlides wrapper with overflow:hidden.\nContainer that holds slides. \n            PhotoSwipe keeps only 3 of them in the DOM to save memory.\n            Don't modify these 3 pswp__item elements, data is added later on.\nDefault (PhotoSwipeUI_Default) interface on top of sliding area. Can be changed.\nControls are self-explanatory. Order can be changed.\nPreloader demo http://codepen.io/dimsemenov/pen/yyBWoR\nelement will get class pswp__preloader--active when preloader is running\nAlias: 9a97c64c\nShare by:\nEnd Script tags\nSite Wide Html Markup\nSite Wide Html Markup",
      "emails": []
    },
    {
      "url": "https://www.florabama.com/about-us",
      "is_candidate": false,
      "has_email": false,
      "text": "========= Site Content =========\nHome\nAbout\nAbout Us\nArticles\nGallery\nVideos\nHey Y'all\nEvents\nAnnual Events\nDaily Events\nFlora-Bama Church\nTickets\nLive Music\nFood\nOyster Bar\nOle River Grill\nYacht Club\nStore\nMarina\nContact\nContact\nStories\nHome\nAbout\nAbout Us\nArticles\nGallery\nVideos\nHey Y'all\nEvents\nAnnual Events\nDaily Events\nFlora-Bama Church\nTickets\nLive Music\nFood\nOyster Bar\nOle River Grill\nYacht Club\nStore\nMarina\nContact\nContact\nStories\nnavigation placeholders\nAbout Us\nTHE LEGEND OF THE\nFLORA-BAMA\nThere are many stories about how the most famous beach bar in the country, the Flora-Bama Lounge, became the iconic location it is today. Some of the stories are even true and a few others were thought up on a local bar stool. The truth is that in 1962 the State of Florida gave the State of Alabama two miles of beach front land in return for the construction of the Perdido Pass Bridge. The Tampary family (Father Ted with sons Connie and Tony) decided to build a small bar and package store on the new State Line. The Flora-Bama was originally constructed in 1964, two years after the road was completed. In the early days of the Flora-Bama, the lounge was practically the only thing in the area. As traffic began to increase along the new highway, business grew and the lounge grew to match it with new construction added piecemeal to accommodate the larger crowds. At the time it was established Escambia County, Florida, in which it is located was \"wet\" while across the line Baldwin County, Alabama, was \"dry\".\nThe Tamparys created a camaraderie rarely found among people of all ages and walks of life. Joseph Gilchrist purchased the tiny lounge and package store on April 17, 1978, and made live music a daily staple. Joined in 1986, by partner Pat McClellan, together they created calendar events like the “Interstate Mullet Toss” and the “Frank Brown Songwriter’s Festival,” named after the early, imposing night watchman.\nIn 2009, John McInnis and Cameron Price became co-owners of the Flora-Bama, along with Joe and Pat, to carry it into the next 50 years. Together these four owners have carried on the tradition of making the Country's Best Beach Bar a place where everyone feels comfortable and leaves smiling. Today the live music at the Flora-Bama consist of local favorites to Platinum selling recording artist. The events range from chili cookoffs and fishing rodeos to the Annual Mullet Toss and big beach front concerts. The best part is there is always someone and something different going on at the Flora-Bama every day and you never know who is going to be sitting next to you.\nFlora-Bama\nThe Owners\nBuilding a legendary location takes dedicated ownership who cares for the team, community, quality and our beloved guests.\nSay Hello To Joe, Pat, John and Cam\nAround the Flora-Bama the owners like to be called by their first names. They are dedicated to making every day better for our community. They provide support to local charities and provide assistance to returning troops. Next time you are at The Flora-Bama come say hello.\nBest\nHonky Tonk\nOyster Bar\nLive Music\nSunset Viewing\nDance Spot\nBushwackers\nOn The Beach\nSongs About The Flora-Bama\nYes, many people have written and recorded songs about the Flora-Bama over the years. As we always say \" you never know who you are going to see at the Flora-Bama\" or who is going to mention it in a book, song or video. Here are some famous examples.\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nThe Flora-Bama has been described in many ways. Some call us a beach bar. Others have mentioned live music, oyster bar, dance floors, beach views and so many other adjectives. As long as you like fun for all ages in a fantastic location on the beach then feel free to describe the Flora-Bama how you like. BUT we like to say that we are the ONLY Honky Tonk On The Beach! See how news from around the nation describes the Flora-Bama by clicking\nHERE\n.\nFLORA-BAMA MOTTO\n\"To always be responsive and sensitive to the human dignity of others. To grant equal respect to all who enter the Flora-Bama, expecting the same in return. To ensure our guests enjoy the magic of the Flora-Bama, leave safe and happy and come to visit us again with new friends.\"\nGIVES BACK\nThe Flora-Bama encourages everyone to invest in their community and the well-being of others. Here are a few of the organizations we assist annually. In total the Flora-Bama provides donations to over 30 charities each year.\nYouth Reach\nThis faith-based long-term, residential ministry offers a healthy and stable environment to receive emotional healing and valuable life skills.\nRead More\nSt Jude Childre's Hospital\nSt. Jude is leading the way the world understands, treats and defeats childhood cancer and other life-threatening diseases.\nRead More\nLeukemia Society\nCure leukemia, lymphoma, Hodgkin's disease and myeloma, and improve the quality of life of patients and their families.\nRead More\nJoin Our Team\nFlora-Bama is always seeking great new members\nApply Here\nLocation\n17401 Perdido Key Dr.\nPerdido Key, FL. 32507\nBamily List\nGet notified of tickets, events and sales\nCall\n(251) 980-5118\nGood Times and Good Music since 1964.\nRegulatory\nDoor Policy\nPrivacy Policy\nADA Information\nNews Room\nJoin The Bamily\nOther Pages\nFlora-Bama Marina\nFlora-Bama Liquor & Lotto\nFlora-Bama Store\nFlora-Bama Yacht Club\nOle River Grill\nBar Working Hours\nMon - Sun\n11:00 am\n-\n2:30 am\nGift Shop Hours\nMon - Sun\n9:00 am\n-\n2:30 am\n© 2025\nAll Rights Reserved | Flora-Bama\nAdd full CSS and Javascript before the close tag of the body if needed\n========= JS Section =========\nLoad jQuery\nEnd Load jQuery\nInjecting site-wide before scripts\nEnd Injecting site-wide to the head\nHEAD RT JS Include\nEnd of HEAD RT JS Include\nphotoswipe markup\nRoot element of PhotoSwipe. Must have class pswp.\nBackground of PhotoSwipe. \n         It's a separate element as animating opacity is faster than rgba().\nSlides wrapper with overflow:hidden.\nContainer that holds slides. \n            PhotoSwipe keeps only 3 of them in the DOM to save memory.\n            Don't modify these 3 pswp__item elements, data is added later on.\nDefault (PhotoSwipeUI_Default) interface on top of sliding area. Can be changed.\nControls are self-explanatory. Order can be changed.\nPreloader demo http://codepen.io/dimsemenov/pen/yyBWoR\nelement will get class pswp__preloader--active when preloader is running\nAlias: 9a97c64c\nShare by:\nEnd Script tags\nSite Wide Html Markup\nSite Wide Html Markup",
      "emails": []
    }
  ],
  "all_links": [
    "https://www.florabama.com/oyster-bar",
    "https://www.florabama.com/news-room",
    "https://www.florabama.com/application",
    "https://www.florabama.com/daily-events",
    "https://www.florabama.com/flora-bama-bushwacker",
    "https://www.florabama.com/privacy-policy",
    "https://www.florabama.com/door-policy",
    "https://www.florabama.com/gallery",
    "https://www.florabama.com/contact",
    "https://www.florabama.com/flora-bama-church",
    "https://www.florabama.com/hey_yall",
    "https://www.florabama.com/tickets",
    "https://www.florabama.com/annual-events",
    "https://www.florabama.com/bachelorette-party",
    "https://www.florabama.com/live-music",
    "https://www.florabama.com/articles",
    "https://www.florabama.com/ABOUT",
    "https://www.florabama.com/about-us",
    "https://www.florabama.com/videos",
    "https://www.florabama.com/ada-information",
    "https://www.florabama.com/",
    "https://www.florabama.com/stories"
  ],
  "candidate_links": [
    "https://www.florabama.com/daily-events",
    "https://www.florabama.com/contact",
    "https://www.florabama.com/annual-events",
    "https://www.florabama.com/about-us"
  ],
  "visited": [
    "https://www.florabama.com/",
    "https://www.florabama.com/about",
    "https://www.florabama.com/contact",
    "https://www.florabama.com/staff",
    "https://www.florabama.com/team",
    "https://www.florabama.com/board",
    "https://www.florabama.com/directory",
    "https://www.florabama.com/events",
    "https://www.florabama.com/sitemap.xml",
    "https://www.florabama.com/council",
    "https://www.florabama.com/leadership",
    "https://www.florabama.com/management",
    "https://www.florabama.com/producers",
    "https://www.florabama.com/support",
    "https://www.florabama.com/crew",
    "https://www.florabama.com/members",
    "https://www.florabama.com/bios",
    "https://www.florabama.com/people",
    "https://www.florabama.com/artists",
    "https://www.florabama.com/musicians",
    "https://www.florabama.com/faculty",
    "https://www.florabama.com/administration",
    "https://www.florabama.com/daily-events",
    "https://www.florabama.com/contact",
    "https://www.florabama.com/annual-events",
    "https://www.florabama.com/about-us"
  ],
  "base_url": "https://www.florabama.com/"
}