{
  "pages": [
    {
      "url": "https://fun-spot.com/about/contact-us/",
      "is_candidate": false,
      "has_email": false,
      "text": "Contact Us for More Fun Spot America Theme Parks Information\nContact us for your additional questions and feedback about the HUGE fun for children, tweens, teens, families and groups at Fun Spot America parks. Whether you need park details about hours, upcoming events or attractions, our dedicated Fun Spot Guest Specialists will answer your questions!\nFun Spot America – Orlando:\n5700 Fun Spot Way Orlando,\nFL, 32819\n407-363-3867\nI-Drive near Universal!\nFun Spot America – Kissimmee:\n2850 Florida Plaza Blvd Kissimmee,\nFL, 34746\n407-363-3867\nHwy 192 near Disney!\nContact us at\n407-363-3867\nor email\n[email protected]\nwith any questions, concerns, comments or feedback.\nFun Spot America – Orlando:\n5700 Fun Spot Way Orlando,\nFL, 32819\n407-363-3867\nI-Drive near Universal!\nFun Spot America – Kissimmee:\n2850 Florida Plaza Blvd Kissimmee,\nFL, 34746\n407-363-3867\nHwy 192 near Disney!\n#GoldenRuleProject\n[if lt IE 9]><script>document.createElement('video');</script><![endif]\nhttps://www.youtube.com/watch?v=5aEPG41JWWQ\nWe’re Open!\nhttps://youtu.be/342RFt-s4KM\nBUY TICKETS NOW",
      "emails": []
    },
    {
      "url": "https://fun-spot.com/group-events/corporate-events/",
      "is_candidate": false,
      "has_email": false,
      "text": "Corporate Events\nHave Your Best Day at Work Ever!\nWhether planning a team-building activity, celebrating your best of the best or hosting an employee family fun day, Fun Spot America Theme Parks hits the spot for corporate outings!\nOur parks create a FUN backdrop with several customizable indoor/outdoor event spaces, A/V options, full-service catering and, of course, thrilling rides for the whole family. Whether it’s smaller workshop groups of 15 guests, or awesomely enjoyable company events of 6,000+, our dedicated event managers will work with your event needs to create your best day at work ever!\nCall us at\n407-363-3867\n, email\n[email protected]\nor fill out the form below to book your next event.\nLet Us Cater Your Special Event\nWe offer catering for corporate events. Indoor seating is available for up to 200 people and outdoor covered seating is available for up to 350 people.\nCorporate Event Testimonials\nGroup Inquiry Form\nLet Us Cater Your Special Event\nWe offer catering for corporate events. Indoor seating is available for up to 200 people and outdoor covered seating is available for up to 350 people.",
      "emails": []
    },
    {
      "url": "https://fun-spot.com/about/",
      "is_candidate": false,
      "has_email": false,
      "text": "About Fun Spot America Theme Parks\nAt Fun Spot America we strive to provide Safe-Clean-Fun to our guests and their families so they can have their #BestDayEver\nOUR MISSION\nCelebrating people,creating fun and making memories.\nGOLDEN RULE\nLife is GREAT when YOU treat others the way YOU want others to treat YOU!\nOur History\nFun Spot America Theme Parks is a family-owned business with a long history in our industry. Our Founder, John Arie, Sr has been a part of the entertainment park industry since 1969. John operated and ran several small tracks from 1969 through 1978.\nIn 1979, John opened Fun N Wheels on International Drive, which was and still is the heart of the tourist corridor in Orlando, Florida.  Fun N Wheels in Orlando was the first themed action park with multiple tracks, family rides, and an open-air arcade. It featured the world’s second slick track and central Florida’s first figure 8 bridge tracks. The concept was well-received by locals and tourists alike.\nIn 1988 John opened his second Fun N Wheels in Kissimmee, Florida, just minutes from Disney World. Both locations became a staple in the community and proved to be very successful. John sold the Fun N Wheels properties in 1988 and continued to manage the parks until 1991. In 1990 John opened the first Fun Spot in Myrtle Beach, South Carolina, and shortly after opened the Virginia Beach location. In 1994, John created the world’s first sprint track, delivering the best side-by-side racing excitement in a concession kart environment. John also developed aviation-inspired guardrails that provide the safest, most efficient, visually pleasing guardrail system in the industry.\nIn 1997 he moved the Fun Spot brand to Orlando and began construction of the Orlando park on the North end of International Drive, close to his original Fun N Wheels location. The Orlando park opened on December 24th, 1997, and introduced our patented design of multi-level tracks that became our signature.\nIn 2004 we purchased the world’s tallest Skycoaster, and in 2007 we expanded that attraction to the 9 acres of tracks, family/thrill rides, and an arcade at the Kissimmee location. In June 2013, Fun Spot Action Park underwent a 15‐acre renovation and expansion including a name change to Fun Spot America! The Orlando location now boasts Orlando’s first wooden roller coaster along with the second-tallest SkyCoaster in the world, the tallest being at our Kissimmee location. In 2017 the Mine Blower wooden roller coaster opened at Kissimmee Park and features the only wooden roller coaster that goes upside down in the Southeast United States.\nThe year 2017 also brought expansion outside of Florida when Fun Spot America acquired an existing park in Fayetteville, Georgia, and renamed it Fun Spot America Atlanta. The Atlanta location boasts our largest four-story go-kart track, The Samson. Standing at 40 feet tall and 1,800 feet long the track is Georgia’s first and only multi-level go-kart-track. Atlanta is also home to a new Ferris Wheel, Batting Cages, and more fun for the whole family.\nWith the continued support of our local community and a strong belief in the practicing of “The Golden Rule”, we hope to continue to grow and provide Safe-Clean-Fun for all.\nOUR MISSION\nCelebrating people,creating fun and making memories.\nGOLDEN RULE\nLife is GREAT when YOU treat others the way YOU want others to treat YOU!\n#GoldenRuleProject\n[if lt IE 9]><script>document.createElement('video');</script><![endif]\nhttps://www.youtube.com/watch?v=5aEPG41JWWQ\nWe’re Open!\nhttps://youtu.be/342RFt-s4KM\nBUY TICKETS NOW",
      "emails": []
    },
    {
      "url": "https://fun-spot.com/group-events/",
      "is_candidate": false,
      "has_email": false,
      "text": "Host Your Next Group Event at Fun Spot\nGroup events are meant to be FUN. At Fun Spot, whether you’re planning an event for 15 or 5,000 guests, we offer the perfect destination for safe, clean fun for all occasions, ages and group sizes. Check out all the benefits and features of our group events, and contact us to reserve yours today!\nCorporate Events\nWhether you’re planning a team-building activity, celebrating your best of the best or hosting an employee family fun day, Fun Spot hits the spot for corporate outings!\nLEARN MORE\nSchool Field Trips\nFun Spot is the perfect destination for class field trips or summer camp outings for all grade levels, offering educational experiences that incorporate fast-paced thrills and hands-on activities.\nLEARN MORE\nScout Days\nJoin us for Scout Days at Fun Spot America in Orlando on June 11th and 16th, 2025! Arrive at 9 AM for a day packed with unlimited rides, a cheese pizza meal, an educational session with a build your own roller coaster lesson, an egg drop challenge, and more. Plus, every scout will receive an exclusive Fun Spot Patch.\nLEARN MORE\nBenefits of Group Events at Fun Spot\nUnlimited access to go-karts, roller coasters and rides (SkyCoaster not included)\nAn ideal event destination for guests of all ages and groups of all sizes\nConvenient locations in Orlando and Kissimmee\nA personal, warm staff welcome for large groups right from your bus or van upon arrival\nTeam support in all aspects of each group event, including planning, setup and operation\nExclusive access to the entire park, if needed\nAvailable Group Event Features\nGrandstand seating\nStage area and video screens\nSpecial lighting and audio support\nDrink and food bars with servers and bar staff\nTable and chair setup for any size group\nSouvenir cup/unlimited soda, food vouchers and pizza specials available\nGuidelines for Group Events\n15-person minimum\nReservations required at least 72 hours in advance with a non-refundable deposit\nGroups must arrive together\nReady to Get Started?\nFill out the form below to book your next group event at Fun Spot, and we’ll get back to you shortly to set up your event!",
      "emails": []
    },
    {
      "url": "https://fun-spot.com/orlando-events/",
      "is_candidate": false,
      "has_email": false,
      "text": "Orlando Events\nLimited-Time Florida Resident Deal — Starts Sept. 2nd!\nStarting September 2, Florida residents can enjoy 50% off a Single Day Fun Pass — just $34.95! That means more rides, more laughs and more memories at a price made for locals. This special offer is available …\nSeason Pass Deal — Starts August 22nd!\nMake memories that last all year (and then some)! From August 22 – October 31, grab your Season Pass for $104.95 or go all-in with the Ultimate Season Pass for $249.95. Passes valid through December 31, 2026. …\nDon’t Pack Up Summer Just Yet\nDon’t Pack Up Summer Just Yet The school buses are back, the kids are already “forgetting” their homework, and pumpkin spice is creeping onto every menu within a 50-mile radius. And if that wasn’t enough, somehow stores …\nNight of Gold\nJoin us on Saturday, September 13th, 2025, for an evening of fellowship at the Christian youth event of the year: Night of Gold at Fun Spot!\nSpecial Moments\nAt Fun Spot, we’re more than just rides — we’re about creating those unforgettable memories you’ll talk about for years. With free parking, free admission and parks that stay open late, it’s easy to swing by for a spontaneous visit or …\nLimited-Time Florida Resident Deal — Starts Sept. 2nd!\nStarting September 2, Florida residents can enjoy 50% off a Single Day Fun Pass — just $34.95! That means more rides, more laughs and more memories at a price made for locals. This special offer is available …\nSeason Pass Deal — Starts August 22nd!\nMake memories that last all year (and then some)! From August 22 – October 31, grab your Season Pass for $104.95 or go all-in with the Ultimate Season Pass for $249.95. Passes valid through December 31, 2026. …\nDon’t Pack Up Summer Just Yet\nDon’t Pack Up Summer Just Yet The school buses are back, the kids are already “forgetting” their homework, and pumpkin spice is creeping onto every menu within a 50-mile radius. And if that wasn’t enough, somehow stores …\nNight of Gold\nJoin us on Saturday, September 13th, 2025, for an evening of fellowship at the Christian youth event of the year: Night of Gold at Fun Spot!\nSpecial Moments\nAt Fun Spot, we’re more than just rides — we’re about creating those unforgettable memories you’ll talk about for years. With free parking, free admission and parks that stay open late, it’s easy to swing by for a spontaneous visit or …\n#GoldenRuleProject\n[if lt IE 9]><script>document.createElement('video');</script><![endif]\nhttps://www.youtube.com/watch?v=5aEPG41JWWQ\nWe’re Open!\nhttps://youtu.be/342RFt-s4KM\nBUY TICKETS NOW",
      "emails": []
    },
    {
      "url": "https://fun-spot.com/kissimmee-events/",
      "is_candidate": false,
      "has_email": false,
      "text": "Kissimmee Events\nLimited-Time Florida Resident Deal — Starts Sept. 2nd!\nStarting September 2, Florida residents can enjoy 50% off a Single Day Fun Pass — just $34.95! That means more rides, more laughs and more memories at a price made for locals. This special offer is available …\nSeason Pass Deal — Starts August 22nd!\nMake memories that last all year (and then some)! From August 22 – October 31, grab your Season Pass for $104.95 or go all-in with the Ultimate Season Pass for $249.95. Passes valid through December 31, 2026. …\nDon’t Pack Up Summer Just Yet\nDon’t Pack Up Summer Just Yet The school buses are back, the kids are already “forgetting” their homework, and pumpkin spice is creeping onto every menu within a 50-mile radius. And if that wasn’t enough, somehow stores …\nSpecial Moments\nAt Fun Spot, we’re more than just rides — we’re about creating those unforgettable memories you’ll talk about for years. With free parking, free admission and parks that stay open late, it’s easy to swing by for a spontaneous visit or …\nLimited-Time Florida Resident Deal — Starts Sept. 2nd!\nStarting September 2, Florida residents can enjoy 50% off a Single Day Fun Pass — just $34.95! That means more rides, more laughs and more memories at a price made for locals. This special offer is available …\nSeason Pass Deal — Starts August 22nd!\nMake memories that last all year (and then some)! From August 22 – October 31, grab your Season Pass for $104.95 or go all-in with the Ultimate Season Pass for $249.95. Passes valid through December 31, 2026. …\nDon’t Pack Up Summer Just Yet\nDon’t Pack Up Summer Just Yet The school buses are back, the kids are already “forgetting” their homework, and pumpkin spice is creeping onto every menu within a 50-mile radius. And if that wasn’t enough, somehow stores …\nSpecial Moments\nAt Fun Spot, we’re more than just rides — we’re about creating those unforgettable memories you’ll talk about for years. With free parking, free admission and parks that stay open late, it’s easy to swing by for a spontaneous visit or …\n#GoldenRuleProject\n[if lt IE 9]><script>document.createElement('video');</script><![endif]\nhttps://www.youtube.com/watch?v=5aEPG41JWWQ\nWe’re Open!\nhttps://youtu.be/342RFt-s4KM\nBUY TICKETS NOW",
      "emails": []
    },
    {
      "url": "https://fun-spot.com/group-events/sales-team/",
      "is_candidate": false,
      "has_email": false,
      "text": "Sales Team\nOur Sales Team is here to help with your Group and Corporate Events. We create a customized experience for every one of our guests to ensure safe-clean-fun is had by all.\nGroup Event Inquiries",
      "emails": []
    },
    {
      "url": "https://fun-spot.com/about/our-team-is-here-to-serve-you/",
      "is_candidate": false,
      "has_email": false,
      "text": "Our Leadership Team\nWe have a strong history of working with and hiring quality individuals with strong values. Here are some of our Corporate Officers and Department Heads Bios.\nJohn Arie, Jr.\nOwner & Chief Executive Officer\nThe face of FUN SPOT! John is our media spokesperson as well as our Owner and Chief Executive Officer. John has played an active role in the go-kart amusement industry since he was a young man, and he has worked in every aspect of the family-owned business. John graduated high school in 1996 and with each stride in his career, he has remained educated with the current operational and management courses to keep him on the cutting edge of the industry and prepare himself for his current position as CEO of this multi-level, multi-million dollar family-owned attraction. John has been voted and selected by the Orlando Business Journal as the “Top 40 under 40” for 2007, and he was voted as one of the “Top 10 Men to Watch” in 2009. John is also active in his community and serves as a sports coach at his local YMCA. However, John’s pride and joy in his life is his wife and best friend, Tracy and his children TJ and Alexis.\nJohn Arie, Sr.\nFounder\nJohn Arie first started in the industry in 1969 and quickly realized he had a passion for the business and wanted to own and operate his own attraction. In 1975 John opened his first operation in Ocean City Maryland which featured two tracks in the heart of the tourist district. This was the start to a long and successful career as John used his creative spirit and drive to push the limits of the traditional track and park designs that were common at the time. John owned and operated several action parks through the years until he felt the challenge to really go HUGE and develop multi-level tracks. John’s designs were US Patented and they became a  reality in June of 1998 when Fun Spot Action Park officially opened in Orlando Florida.  After several years of success, John opened the second location in Kissimmee Florida which featured just one SkyCoaster attraction but over the years he developed it to a 10-acre multiple ride and go-kart track theme park. In 2013 John expanded the Orlando property from 5 acres to 15 acres and added Orlando’s only wooden roller coaster along with other thrill/ family rides and a new brand name emerged: FUN SPOT AMERICA THEME PARKS.\nTracy Arie\nBusiness Relations Director\nTracy Arie has played an active part in the Amusement industry for over 25 years. Tracy has been a key player at Fun Spot since day one. Tracy has worked in almost every department, from Operations, Accounting, HR to communications and business relations. She is dedicated to the continued success of Fun Spot, and to her husband, John as he leads the company, as the CEO. Tracy and John have been married since 1998 and are proud parents of their 2 children, TJ, and Alexis Arie. Tracy is a certified personal trainer and sports nutrition specialist. She spent many years helping and coaching the Fun Spot team to lead a healthier lifestyle.\nAndre Corbin\nRegional General Manager\nAndre brings a lot of enthusiasm to Fun Spot Attractions. He started in the industry at John Arie’s Fun ‘N Wheels Amusement Park in 1988; when John Arie opened Fun Spot Action Park in 1997, Andre came on board shortly thereafter. In 2006, Andre moved into the Track Department’s Sr. Lead position and again in 2008, Andre excelled into the role of Manager on Duty for Orlando’s Fun Spot Action Park. In 2013, as our park expanded from five-acres to 15-acres Andre accepted yet another challenge to become Fun Spot America’s, Director of Operations. As of 2019 he is now the Regional General Manager of Fun Spot America Theme Parks.\nTim Eggers\nDirector of Operations, Orlando\nTim Eggers began his Fun Spot journey in 2009 when he was only 19 years old. He imagined Fun Spot would only be a second job to pay for his car insurance. Tim quickly realized that Fun Spot is more than just a job, but a career path. He began his career at our Kissimmee location where he took his first step into a leadership role in the Rides department. It was not long after his first promotion that his talents were requested at the Orlando location in which he eagerly stepped into with the intention to make the biggest difference possible. Tim continued learning and growing as a leader and manager until stepping into his current role as the Director of Operations at the Orlando park in December 2020. Tim’s passion is helping others develop and achieve their full potential. He believes there is no greater pleasure in life than to give and to serve. Tim is grateful and thankful to work for a company that honors God in all practices and is excited to see the blessings that await Fun Spot America’s future.\nScott Stewart\nDirector of Operations, Kissimmee\nScott has been a member of the Fun Spot America family since 1997, where he was on the construction team for our Orlando park. Scott then worked as a Manager on Duty and Director of Operations in our Orlando location until 2012, where he developed his passion for guest service and people. Scott also served in the US Navy for four years, and while working at Fun Spot America he earned his Bachelor’s Degree in Business Management. In 2012, he left Fun Spot America for a new adventure in Alaska, but couldn’t stay away and returned in 2019 as Manager on Duty for our Orlando location. Later in 2019, he was transferred to Kissimmee where he is the current Director of Operations.\nEric Bitler\nDirector of Operations, Atlanta\nEric started his journey with Fun Spot back in 2012. After one year working with Benner’s Amusements at the Kissimmee location, he came on board with Fun Spot as a Food and Beverage Lead. His energy and passion for the department earned him the role of Food and Beverage Department Manager in 2015. After winning the Employee of the Year award in 2016, Eric looked to play a bigger role for the company by accepting the position of Manager on Duty in Kissimmee in 2017. As Fun Spot’s newest location in Georgia continued to grow and new opportunities arose, Eric packed his bags and moved to Georgia in 2018 to become Director of Operations for Fun Spot Atlanta.\nMichael Benner\nChief Financial Officer\nMichael Benner is our Chief Financial Officer for Fun Spot America – Orlando, and Kissimmee Florida.  He started his career in 1991 with the purchase of his first concession stand.  From 1991 through 2007, he ran his own Food and Beverage business traveling to Fairs and Festivals across Pennsylvania.  After 16-years of running his own business, Mike decided it was time for a change of scenery (and weather) and moved to the Sunshine State, where he was offered a vendor location in Fun Spot Kissimmee.  In addition to operating Food and Beverage locations in the park, Mike was always looking for ways to expand and grow the Food and Beverage Department and regularly contributed to Fun Spot in any way possible.  In 2012, Mike was offered the position of Director of Food and Beverage, and was tasked with the expansion of the Food and Beverage Department of Fun Spot America, Orlando, in 2018 Mike was promoted to Chief Revenue Officer and in 2019 was elevated to our Chief Financial Officer.\nJustina Fiocco\nSenior Vice President of Human Resources\nWith over two decades of people operations experience, Justina served as the Senior Vice President of Human Resources at Fun Spot America Theme Parks since September 2023. They hold a SHRM-CP certification and a BAS in Business and Organizational Leadership. As a servant leader, Justina is dedicated to fostering a culture of trust, inclusion, and high performance. They are responsible for driving key HR initiatives that align with the company’s strategic goals, including talent management, employee relations, and performance optimization. Before joining Fun Spot, Justina made a significant impact at Publix Super Markets and F.I.R.S.T. Institute where they managed and motivated large, diverse teams across multiple roles. They spearheaded innovative cross-training programs, and consistently exceeded performance targets, all while fostering a positive and inclusive workplace culture.\nRenee Patterson\nSenior Vice President of Sales\nAs Director of Sales, Renee is in charge of all sales operations. Renee also directs the Fun Spot Hospitality Team, who liaises with all guest services representatives, hotel concierges and front desk personnel, ticket brokers, time-share representatives, and any other authorized ticket vendor. Renee and the Hospitality Team provide brochures, marketing materials, and information about Fun Spot’s three locations to everyone working in the field of hospitality and guest services.\nReece Youmans\nSenior Vice President of Food & Beverage\nReece Youmans is a seasoned hospitality professional with a wealth of experience in themed restaurant operations, joining Fun Spot America in May 2022. His career has been primarily focused on major Orlando attractions, including extensive work at both Walt Disney and Universal Orlando properties. Reece has managed high-profile establishments such as Rainforest Café, Fulton’s Crabhouse, and Jimmy Buffett’s Margaritaville. He previously owned Hometown Restaurants, operating multiple locations in Tampa/St. Petersburg. A former college athlete, Reece played football at Southern Illinois University, which instilled in him a strong sense of teamwork and leadership. Reece is passionate about global cuisine and eagerly explores new culinary experiences, embodying an adventurous “try anything once” approach to food.\nMark Harrison\nChief of Maintenance\nMark has been with John Arie for 30+years. Mark began in 1985 at Fun N Wheels and has worked in all aspects of the business. He supervises and oversees what we believe to be the BEST maintenance department in the family amusement park industry. The department is skilled and proficient in all the mechanical, pneumatic, and electrical requirements of the park’s operations. Mark is the face of our park’s equipment safety procedures and coordinates the bi-annual inspections with the Florida Department of Agriculture, Fair Rides Division. August of 2018 Mark was promoted to our Chief of Maintenance and oversees all three current locations.",
      "emails": []
    }
  ],
  "all_links": [
    "https://fun-spot.com/team/michael-benner/",
    "https://fun-spot.com/category/orlando-events/",
    "https://fun-spot.com/team/justina-fiocco/",
    "https://fun-spot.com/dont-pack-up-summer-just-yet/",
    "https://fun-spot.com/orlando/orlando-go-karts/",
    "https://fun-spot.com/fun-spot-gives-back/",
    "https://fun-spot.com/kissimmee/kissimmee-thrill-rides/",
    "https://fun-spot.com/team/tracy-arie/",
    "https://fun-spot.com/about/safe-clean-fun/",
    "http://www.fun-spot.com/cdn-cgi/l/email-protection",
    "https://fun-spot.com/about/2025-fun-spot-season-pass-benefits/",
    "http://www.fun-spot.com/team/page/2/",
    "https://fun-spot.com/orlando/thrill-rides/",
    "https://fun-spot.com/orlando/plan-your-visit/",
    "https://fun-spot.com/orlando/orlando-park-map/",
    "https://fun-spot.com/park-comparison",
    "https://fun-spot.com/about/contact-us/",
    "https://fun-spot.com/kissimmee/plan-your-visit/",
    "http://fun-spot.com/orlando/",
    "http://fun-spot.com/kissimmee/",
    "https://fun-spot.com/team/director-of-sales/",
    "https://fun-spot.com/team/eric-bitler/",
    "https://fun-spot.com/florida-resident-deal/",
    "http://www.fun-spot.com/category/orlando/fun-spot-news/",
    "https://hotels.fun-spot.com/package/info/14750/7911",
    "https://fun-spot.com/team/john-arie-jr/",
    "https://fun-spot.com/orlando/",
    "https://fun-spot.com/kissimmee/kissimmee-go-karts/",
    "https://hotels.fun-spot.com/hotel/list/14747/m3926",
    "https://fun-spot.com/",
    "https://fun-spot.com/orlando/orlando-arcade-and-midway/",
    "https://fun-spot.com/special-moments-2025/",
    "https://fun-spot.com/cookies-and-consent-policy/",
    "https://fun-spot.com/group-events/corporate-events/",
    "https://fun-spot.com/night-of-gold/",
    "https://fun-spot.com/about/",
    "https://fun-spot.com/team/tim-eggers/",
    "https://fun-spot.com/team/andre-corbin/",
    "https://fun-spot.com/kissimmee/kissimmee-family-rides/",
    "https://fun-spot.com/kissimmee/kissimmee-kiddie-rides/",
    "https://fun-spot.com/team/scott-stewart/",
    "https://fun-spot.com/orlando-cabana-rental/",
    "https://fun-spot.com/golden-rule-project/",
    "https://fun-spot.com/birthday-packages/#ultimate-party-package",
    "https://fun-spot.com/chauffeur-pass/",
    "https://fun-spot.com/group-events/",
    "https://fun-spot.com/orlando/roller-coasters/",
    "https://fun-spot.com/orlando-events/",
    "https://fun-spot.com/orl-one-day-dining-deal/",
    "https://fun-spot.com/accessibility-policy/",
    "https://fun-spot.com/kissimmee-dining/",
    "https://fun-spot.com/about/careers/",
    "https://hotels.fun-spot.com/hotel/list/14750/m3927",
    "http://fun-spot.com/about-fun-spot/fun-spot-news/",
    "https://fun-spot.com/orlando/orlando-family-rides/",
    "https://fun-spot.com/season-pass-deal-starts-august-22nd/",
    "https://fun-spot.com/kissimmee-events/",
    "https://fun-spot.com/splash-pad/",
    "https://fun-spot.com/privacy-policy/",
    "https://fun-spot.com/orlando/gatorspot/",
    "https://hotels.fun-spot.com/package/info/14747/7904",
    "https://fun-spot.com/orlando-dining/",
    "https://fun-spot.com/group-events/sales-team/",
    "https://fun-spot.com/kissimmee/kissimmee-arcade-and-midway/",
    "https://fun-spot.com/kissimmee/",
    "https://fun-spot.com/about/fun-spot-news/",
    "https://fun-spot.com/policies-and-frequently-asked-questions/",
    "https://fun-spot.com/about/our-team-is-here-to-serve-you/",
    "https://fun-spot.com/group-events/field-trips-school-groups/",
    "https://fun-spot.com/orlando/orlando-kiddie-rides-page/",
    "https://fun-spot.com/team/john-arie-sr/",
    "https://fun-spot.com/fl-school-spirit-nights/",
    "https://fun-spot.com/kissimmee/kissimmee-park-map/",
    "https://fun-spot.com/kissimmee/kissimmee-roller-coasters/"
  ],
  "candidate_links": [
    "https://fun-spot.com/about/contact-us/",
    "https://fun-spot.com/group-events/corporate-events/",
    "https://fun-spot.com/about/",
    "https://fun-spot.com/group-events/",
    "https://fun-spot.com/orlando-events/",
    "https://fun-spot.com/kissimmee-events/",
    "https://fun-spot.com/group-events/sales-team/",
    "https://fun-spot.com/about/our-team-is-here-to-serve-you/"
  ],
  "visited": [
    "http://www.fun-spot.com/",
    "http://www.fun-spot.com/about",
    "http://www.fun-spot.com/contact",
    "http://www.fun-spot.com/staff",
    "http://www.fun-spot.com/team",
    "http://www.fun-spot.com/board",
    "http://www.fun-spot.com/directory",
    "http://www.fun-spot.com/events",
    "http://www.fun-spot.com/sitemap.xml",
    "http://www.fun-spot.com/council",
    "http://www.fun-spot.com/leadership",
    "http://www.fun-spot.com/management",
    "http://www.fun-spot.com/producers",
    "http://www.fun-spot.com/support",
    "http://www.fun-spot.com/crew",
    "http://www.fun-spot.com/members",
    "http://www.fun-spot.com/bios",
    "http://www.fun-spot.com/people",
    "http://www.fun-spot.com/artists",
    "http://www.fun-spot.com/musicians",
    "http://www.fun-spot.com/faculty",
    "http://www.fun-spot.com/administration",
    "https://fun-spot.com/about/contact-us/",
    "https://fun-spot.com/group-events/corporate-events/",
    "https://fun-spot.com/about/",
    "https://fun-spot.com/group-events/",
    "https://fun-spot.com/orlando-events/",
    "https://fun-spot.com/kissimmee-events/",
    "https://fun-spot.com/group-events/sales-team/",
    "https://fun-spot.com/about/our-team-is-here-to-serve-you/"
  ],
  "base_url": "http://www.fun-spot.com/"
}