{
  "pages": [
    {
      "url": "https://gigglewaters.com/about-us/",
      "is_candidate": false,
      "has_email": true,
      "text": "MENU\nMENU\nORDER TO GO\nABOUT US\nABOUT US\nGIGGLES FOR GOOD\nPRESS ROOM\nCAREERS\nFOOD TRUCKS\nFRANCHISING\nMOVIES\nSPECIAL EVENTS\nAbout Us\nIf you wanted a cocktail in the late 1920s, you’d ask for a “giggle water”; an alcoholic beverage and the namesake inspiration for Gigglewaters, the restaurant, bar, and one screen classic movie theater in the heart of downtown Safety Harbor.\nSince 2018\nWhen owners Richie Wilson & Rachel Fine moved to Florida from Brooklyn in 2015, they were happy to trade snow for sunshine. They missed some of their favorite New York City haunts and started conceptualizing a way to bring some of those best gems together to create a truly unique dining and entertainment experience for their new hometown. Missing the old architecture of NYC, they decided to create a speakeasy-style establishment that celebrated the prohibition era and found the perfect building with a rich history in the heart of downtown Safety Harbor. They added tin ceilings, Edison lighting, and a custom bar built of upcycled wood from the historic Belleview Biltmore, circa 1897.\nAnd while the look may be swanky, the menu is anything but pretentious. It’s classic American comfort food, kicked up a notch- over a dozen unique, delicious pure Wagyu beef burgers, bacon-wrapped deep-fried quarter-pound hot dogs piled high, housemade Butcher Block Bacon soaked in bourbon & brown sugar, ridiculous mac & cheeses and an award-winning cocktail list. They incorporated some of their NYC favorites, like Frito pie and ricotta cheesecake. The menu is as craveable as it is inspired and was featured on Travel Channel’s Man v. Food for that reason.\nYou can join us for a meal in the dining room or you can walk through the double doors in the back and into an intimate, 32-seat movie theater that shows classic movies while you eat. We show an array of favorites, from The Goonies to The Godfather. The theater is full service; the entire menu is available while you watch (or sing-a-long to) your favorite flick. You can see this month’s movie lineup and get your $5 tickets\nHERE\n.\nGigglewaters isn’t just a restaurant, it’s an experience. We’ve had proposals and full weddings, hosted family reunions, watched Die Hard on Christmas and rang in every New Years Eve with our infamous Rocky Picture Show four course dinner event. We believe in bringing people together to a place of a thousand good times. Your best night out, an experience you can’t help but love. Stop in and grab a “giggle water” with us today!\nMeet the Owners!\nFRANK FINE - PRESIDENT\nFrank has over 30 years of hotel and restaurant experience and served as SVP of American Inns Management, specializing in crisis management and company development with hotels and restaurants in Arizona, Nevada and California. He directly oversaw 75 hotels, restaurants and marinas and owned a number of his own. Frank is also a nationally certified counselor who specializes in critical incidents. He has been deployed as a first responder at the World Trade Center at 9/11, after major hurricanes, shootings and other national disasters for the past 30 years.\nRACHEL WILSON - CEO\nRachel has more than 10 years of experience in franchised business management with supplemental education companies. She has worked in television for a number of years as well, hosting multiple TV shows for Howard Stern and as a ghost hunter on The Travel Channel. Rachel directed the build-out of the flagship Gigglewaters and was its first General Manager. She built the brand and drove operational and marketing strategy from day one.\nRICHARD WILSON - CCO\nRichie spent 17 years as Senior Broadcast Producer of the Howard Stern Show. Richie is also well known as the inventor of the viral sensation “Shittens“, which Redbook said, “broke the internet”. Here at Gigglewaters, Richie drove the creative direction, from decor and design to movie selections and creative promotions.\nAwards\nGigglewaters is honored to have been recognized as winners of the following awards:\n2018\nBest of the Bay\nBest New Restaurant\nBeer & Burger Throwdown\nBest Signature Burger\n2019\nBest of the Bay\nBest Cocktails\nBest Brunch\nBest Brunch for Boozing\nBest Whiskey Bar\nBest Tequila Bar\nBest Grilled Cheese\n2nd Runner Up for Best All Around Restaurant, Behind Bern’s Steak House\n2020\nBest of the Bay\nBest Burgers\nBest Whiskey Bar\nBest Neighborhood Bar in Pinellas County\nBest of Safety Harbor\nBest Gourmet Popcorn\n2021\nTampa Bay Times: Best of the Best\nBest Cocktail Bar in Tampa Bay\nBest Neighborhood Bar in Tampa Bay\nBest of the Bay\nBest Neighborhood Bar in Pinellas\nBest Safety Harbor Restaurant\nBest Grilled Cheese\nBest Gourmet Popcorn\n2022\nTampa Bay Times: Best of the Best\nBest Hamburger Restaurant\nBest Brunch\nBest Cocktail Bar\nBest Romantic Restaurant\nBest Neighborhood Bar\nBest of the Bay\nBest Whiskey Bar\nBest NeighborhoodBar Pinellas\nBest of Safety Harbor\nBest Waitstaff\nBest Grilled Cheese\nTime Out\nNamed one of the 11 Best Restaurants in Tampa\nVisit St. Pete/Clearwater\nBest Cocktails\nFeatured on Cooking Channel’s Man vs. Food\nJOIN OUR NEWSLETTER!\nJoin the fun. We promise not to spam you.\nThank you for your interest in Gigglewaters!\nName\nEmail\nwebsource\nSubscribe\nFollow Us\nContact Us\n727.669.7077\ninfo@gigglewaters.com\nQuick Links\nMenu\nFood Trucks\nOrder to Go\nAbout Us\nGiggles for Good\nPress Room\nCareers\nFranchising\nPurchase Tickets\nLocation\nGigglewaters\n737 Main Street\nSafety Harbor, FL 34695\nView on map\nMon-Thurs: 11am-10pm\nFri: 11am-11pm\nSat: 10am-11pm\nSun: 9am-9pm\nPrivate parties: Our 32-seat movie theater is available for private rentals!\nEmail\nevents@gigglewaters.com\nto schedule your party today.\nReservations are not required or accepted. For parties of 12 or more, please email\nevents@gigglewaters.com\n.\nCopyright © 2022 Gigglewaters, LLC | Terms & Conditions & Privacy Policy",
      "emails": [
        "events@gigglewaters.com",
        "info@gigglewaters.com"
      ]
    },
    {
      "url": "http://gigglewaters.com/franchise",
      "is_candidate": false,
      "has_email": false,
      "text": "Own A Gigglewaters Franchise\nKim\n2024-07-09T12:50:44+00:00\nRequest Franchise Information\nInterested in learning more about our franchise opportunities? Fill out the form below and someone from our team will reach out!\nFirst Name\n*\nLast Name\n*\nEmail\n*\nPhone\n*\nState\n*\nState of Interest:*\nAlabama\nAlaska\nArizona\nArkansas\nCalifornia\nColorado\nConnecticut\nDelaware\nDistrict Of Columbia\nFlorida\nGeorgia\nHawaii\nIdaho\nIllinois\nIndiana\nIowa\nKansas\nKentucky\nLouisiana\nMaine\nMaryland\nMassachusetts\nMichigan\nMinnesota\nMississippi\nMissouri\nMontana\nNebraska\nNevada\nNew Hampshire\nNew Jersey\nNew Mexico\nNew York\nNorth Carolina\nNorth Dakota\nOhio\nOklahoma\nOregon\nPennsylvania\nRhode Island\nSouth Carolina\nSouth Dakota\nTennessee\nTexas\nUtah\nVermont\nVirginia\nWashington\nWest Virginia\nWisconsin\nWyoming\nArmed Forces (AA)\nArmed Forces (AE)\nArmed Forces (AP)\nCity\n*\nCash to Invest\n*\nCash to Invest:\n$100,000 - $250,000\n$250,000 - $500,000\n$500,000 - $1,000,000\n$1,000,000 +\nType of Franchise\n*\nInterested in:\nBrick & Mortar\nFoodtruck\nBoth Brick & Mortar & Foodtruck\nComments\nBy clicking the ‘Submit’ button below, you understand that a local representative of the Gigglewaters franchise development team will follow up with a short conversation to answer any questions you may have. You consent to be contacted by SMS text and marketing messages; message and data rates may apply and you may opt-out at any time.\nSubmit\nThank you for your interest in a Gigglewaters franchise. We will reach out to you soon to schedule a call!\n×\nThere was an error trying to send your message. Please try again later.\n×\nFirst Name\n*\nLast Name\n*\nEmail\n*\nPhone\n*\nState\n*\nState of Interest:*\nAlabama\nAlaska\nArizona\nArkansas\nCalifornia\nColorado\nConnecticut\nDelaware\nDistrict Of Columbia\nFlorida\nGeorgia\nHawaii\nIdaho\nIllinois\nIndiana\nIowa\nKansas\nKentucky\nLouisiana\nMaine\nMaryland\nMassachusetts\nMichigan\nMinnesota\nMississippi\nMissouri\nMontana\nNebraska\nNevada\nNew Hampshire\nNew Jersey\nNew Mexico\nNew York\nNorth Carolina\nNorth Dakota\nOhio\nOklahoma\nOregon\nPennsylvania\nRhode Island\nSouth Carolina\nSouth Dakota\nTennessee\nTexas\nUtah\nVermont\nVirginia\nWashington\nWest Virginia\nWisconsin\nWyoming\nArmed Forces (AA)\nArmed Forces (AE)\nArmed Forces (AP)\nCity\n*\nCash to Invest\n*\nCash to Invest:\n$100,000 - $250,000\n$250,000 - $500,000\n$500,000 - $1,000,000\n$1,000,000 +\nType of Franchise\n*\nInterested in:\nBrick & Mortar\nFoodtruck\nBoth Brick & Mortar & Foodtruck\nComments\nBy clicking the ‘Submit’ button below, you understand that a local representative of the Gigglewaters franchise development team will follow up with a short conversation to answer any questions you may have. You consent to be contacted by SMS text and marketing messages; message and data rates may apply and you may opt-out at any time.\nSubmit\nThank you for your interest in a Gigglewaters franchise. We will reach out to you soon to schedule a call!\n×\nThere was an error trying to send your message. Please try again later.\n×\nWe believe in bringing people together to a place of a thousand good times.\nYour best night out, an experience you can’t help but love.\n“Gigglewaters\n®\nhas emerged as a place that makes visitors feel like they are living a celluloid dream.”\n(-USA Today)\nYou’ve never been to a restaurant like this.\nGigglewaters\n®\nis more than just a culinary destination; it’s an immersive dining experience that transcends the ordinary. From the moment you step through our doors, you’ll feel the energy and excitement that sets us apart. With award-winning cuisine, innovative cocktails, and an intimate movie theater, Gigglewaters\n®\noffers a unique blend of nostalgia and community that you just won’t find anywhere else. Gigglewaters\n®\nisn’t just another restaurant—it’s an experience waiting to be discovered.\nRequest Info\nExperience the magic of bringing people together.\nWe’re looking for trailblazers.\nDo you ever look around at the established franchise brands with hundreds of units and wonder what it would have been like to be one of the first? To have your choice of prime territories? To work hand-in-hand with the founders as you brought a proven concept to the masses? To be more than just another number in the system, but a pioneer that helped build a legacy from the beginning? That’s what’s on the table right now at Gigglewaters. And these opportunities don’t arise every day.\nBe a trailblazer in the Gigglewaters franchise family and seize the opportunity to claim your territory as one of our inaugural franchisees. Sure, it’s fresh ground, but that’s precisely where the magic lies. And while the concept is new, our senior executives have a combined 40 years of restaurant and franchising experience. Together, we’ll work shoulder to shoulder to build something bigger than ourselves. Become one of the first franchisees at Gigglewaters and, as a torchbearer, carve your path in the history of our brand. Join us in shaping the future of dining and entertainment.\nBrick & Mortar\nOur full service restaurant, bar & one screen classic movie theater is unlike any concept we’ve come across and we’re looking for people who are equally extraordinary. From finding a location, to build out, grand opening & ongoing operations, we’ll be there to support you every step of the way. If you’ve ever dreamed of owning your own Gigglewaters\n®\n, click the button below and take the first step.\nRequest Info\nFood Trucks\nOur Gigglewaters\n®\nMobile Kitchen combines our award-winning food with the excitement of life on the road! Set your own schedule, be your own boss and bring the Giggles to a neighborhood near you! Our state-of-the-art Food Trucks and Trailers set the standard for a mobile Gigglewaters experience. If you’ve always wanted to live a life full of adventure and travel while running a show-stopping Food Truck, click the button below and get started today.\nRequest Info\nInvest in a place of a thousand good times.\nIf you’ve dreamed of owning your own location, where your financial success is directly related to how well you hold to Gigglewaters’\n®\ncore values, implement the systems we’ve developed, connect with your community & ensure that guests truly\nhave their best night out,\nwe’d love to invite you to join the Gigglewaters family of franchisees.\n• Brick & Mortar •\n$718K – $1.29M\nInitial Investment\n$59,500\nFranchise Fee*\n$1M\nRequired Net Worth\n$350K\nLiquid Capital\n• Food Truck •\n$113K – $381K\nInitial Investment\n$37,850\nFranchise Fee*\n$450K\nRequired Net Worth\n$100K\nLiquid Capital\nFind Out if you Qualify\n*Franchise Fee is Included in the Initial Investment.\nThe people behind the magic.\nFrank Fine\nPresident\nRead Bio\n×\nFrank Fine, President\nFrank has over 30 years of hotel and restaurant experience and served as SVP of American Inns Management, specializing in crisis management and company development with hotels and restaurants in Arizona, Nevada and California. He directly oversaw 75 hotels, restaurants and marinas and owned a number of his own. Frank is also a nationally certified counselor who specializes in critical incidents. He has been deployed as a first responder at the World Trade Center at 9/11, after major hurricanes, shootings and other national disasters for the past 30 years.\nFavorite Movie:\nA Few Good Men\nRachel Wilson\nChief Executive Officer\nRead Bio\n×\nRachel Wilson, Chief Executive Officer\nRachel brings over a decade of experience in franchised business management within the supplemental education sector, at one point serving as Vice President of US Operations and leading nationwide field support for franchisees. Before this, she founded a successful marketing company in New York City with a diverse client portfolio that included a prominent grocery store chain, 50 radio stations, and a major casino. Rachel spearheaded the development of the flagship Gigglewaters location, serving as its first General Manager. From day one, she built the brand and drove both operational and marketing strategies, establishing Gigglewaters as a premier destination.\nFavorite Movie:\nLabyrinth\nRichard Wilson\nChief Creative Officer\nRead Bio\n×\nRichard Wilson, Chief Creative Officer\nRichie spent 17 years as Senior Broadcast Producer of the Howard Stern Show. Richie is also well known as the inventor of the viral sensation “Shittens“, which Redbook said, “broke the internet”. Here at Gigglewaters, Richie drove the creative direction, from decor and design to movie selections and creative promotions.\nFavorite Movie:\nGoodfellas\nIn business for yourself, but never by yourself.\nThe Gigglewaters\n®\nteam is with you every step of the way. We’ve worked hard over the past few years to build out a system and develop a support team so that you’re not in this alone. You’ll undergo an extensive hands-on training program where you’ll learn the critical details of operating your very own Gigglewaters. This training includes time in the field learning the ropes in our corporate store, working hand-in-hand with the key leadership staff at our Home Office, as well as on-site training at your location when you open. Our training and support helps you master everything you need to know to run a Gigglewaters. From how to hire and inspire a team to greatness, manage payroll, run inventories and track cost of goods, handle scheduling and recruiting, use technology to track key metrics, to marketing through community partnerships- we’re here as a resource and we’re in it with you for the long haul.\nWe don’t stop when you start.\nOf course we’ll be at your Grand Opening. But our commitment to you goes far beyond that. You can count on long term, ongoing support from the entire corporate team. We believe it’s extraordinarily important to schedule regular check-ins to make sure operations are running smoothly, target metrics are being met and you’re achieving your fiscal goals. We take pride in our leadership team truly being just a phone call away.\nFAQs\nHave questions about franchising a Gigglewaters\n®\n? Read our FAQs below.\nWhere are the current franchise opportunities?\nWe are looking to open the initial franchise locations in Florida, focusing primarily throughout West Central Florida to start.\nAm I expected to work in my Gigglewaters restaurant?\nIt’s important to be an engaged owner with your finger on the pulse of your business. We expect that our owners will be involved in the daily business and do not allow passive investors. That being said, an owner-operator could have partners in their franchise that are passive investors.\nHow much capital do I need to invest?\nWe require a minimum of $100K in liquid assets and a $450K net worth for the food truck and a minimum of $350K in liquid assets and a $1M net worth for the brick and mortar.\nWhat is your initial franchise fee and ongoing royalty fees?\nOur Initial Franchise Fee for a Brick & Mortar is $59,500, the Royalty Fee is 5% of Gross Sales and the Ad Fund is 1% of Gross Sales. Our Initial Franchise Fee for a Food Truck is $37,850. Food Truck Royalties are 5% of sales against a monthly minimum, and the Ad Fund is 1% of Gross Sales.\nCan I get financing?\nAlthough Gigglewaters does not provide direct financing, we have experience working with third-party lenders who can assist you in obtaining the necessary funding to launch your business. The market offers a wide range of financing options, and with the guidance of a third-party lender, you can gain a comprehensive understanding of the available choices and select the one that best suits your needs.\nLet’s see if you qualify!\nWill I have a territory?\nYes. Our Brick & Mortar agreement stipulates a 5 mile radius/10 mile diameter* from another brick & mortar location. Our Food Truck territories are based on contiguous zip codes of 500,000 population*, excluding a half mile radius from any established Brick & Mortar. *Exceptions are listed in the FDD for densely populated areas.\nI have never run a restaurant before. Is Gigglewaters still a good business opportunity for me?\nYou can definitely still own and operate a Gigglewaters\n®\nbecause we give you all the training and support you need. We’re looking for candidates with a willingness to work hard and a great attitude; we can teach you the rest.\nWhat kind of neighborhood does Gigglewaters need to thrive?\nAn ideal neighborhood is a walkable, lively community. We appeal to all ages- we’ve got first dates, young families & retirees all enjoying the classic movies, delicious food, and award-winning cocktails. There’s something for everyone in every community.\nCan I invest in just the food truck?\nYes! The food truck is a standalone franchise opportunity for those investors looking for a lower cost mobile business. It’s also a great way to get started in the Gigglewaters franchise family with potential to expand to a brick and mortar restaurant! We have options for both trucks and trailers, with an Initial Investment starting from only $113,000!\nWhat kind of training and support can I expect to receive?\nWe have a comprehensive, 4-week training program where we’ll teach you all facets of the business. That training is a combination of virtual, in-person and hands-on in our flagship location in Safety Harbor, and then additional on-site training will be provided at your Gigglewaters location. Training and support continues well after your opening; we’re always here to help.\nHow do I get started?\nSimply complete and submit the brief\ninquiry form below\nnow and someone from our Franchise Development team will contact you shortly.\nWe Don’t Just Make a Burger\nWe Make a Difference.\nWe’ve won countless awards, including ‘Best Burger in Tampa Bay’, ‘Best Cocktails’, ‘Best Brunch’, and more. However, that’s not what we’re most proud of at Gigglewaters\n®\n. It’s a program we created called “Giggles for Good”.\nfusion-row\nOwn A Gigglewaters Franchise\nKim\n2024-07-09T12:50:44+00:00\nRequest Franchise Information\nInterested in learning more about our franchise opportunities? Fill out the form below and someone from our team will reach out!\nFirst Name\n*\nLast Name\n*\nEmail\n*\nPhone\n*\nState\n*\nState of Interest:*\nAlabama\nAlaska\nArizona\nArkansas\nCalifornia\nColorado\nConnecticut\nDelaware\nDistrict Of Columbia\nFlorida\nGeorgia\nHawaii\nIdaho\nIllinois\nIndiana\nIowa\nKansas\nKentucky\nLouisiana\nMaine\nMaryland\nMassachusetts\nMichigan\nMinnesota\nMississippi\nMissouri\nMontana\nNebraska\nNevada\nNew Hampshire\nNew Jersey\nNew Mexico\nNew York\nNorth Carolina\nNorth Dakota\nOhio\nOklahoma\nOregon\nPennsylvania\nRhode Island\nSouth Carolina\nSouth Dakota\nTennessee\nTexas\nUtah\nVermont\nVirginia\nWashington\nWest Virginia\nWisconsin\nWyoming\nArmed Forces (AA)\nArmed Forces (AE)\nArmed Forces (AP)\nCity\n*\nCash to Invest\n*\nCash to Invest:\n$100,000 - $250,000\n$250,000 - $500,000\n$500,000 - $1,000,000\n$1,000,000 +\nType of Franchise\n*\nInterested in:\nBrick & Mortar\nFoodtruck\nBoth Brick & Mortar & Foodtruck\nComments\nBy clicking the ‘Submit’ button below, you understand that a local representative of the Gigglewaters franchise development team will follow up with a short conversation to answer any questions you may have. You consent to be contacted by SMS text and marketing messages; message and data rates may apply and you may opt-out at any time.\nSubmit\nThank you for your interest in a Gigglewaters franchise. We will reach out to you soon to schedule a call!\n×\nThere was an error trying to send your message. Please try again later.\n×\nFirst Name\n*\nLast Name\n*\nEmail\n*\nPhone\n*\nState\n*\nState of Interest:*\nAlabama\nAlaska\nArizona\nArkansas\nCalifornia\nColorado\nConnecticut\nDelaware\nDistrict Of Columbia\nFlorida\nGeorgia\nHawaii\nIdaho\nIllinois\nIndiana\nIowa\nKansas\nKentucky\nLouisiana\nMaine\nMaryland\nMassachusetts\nMichigan\nMinnesota\nMississippi\nMissouri\nMontana\nNebraska\nNevada\nNew Hampshire\nNew Jersey\nNew Mexico\nNew York\nNorth Carolina\nNorth Dakota\nOhio\nOklahoma\nOregon\nPennsylvania\nRhode Island\nSouth Carolina\nSouth Dakota\nTennessee\nTexas\nUtah\nVermont\nVirginia\nWashington\nWest Virginia\nWisconsin\nWyoming\nArmed Forces (AA)\nArmed Forces (AE)\nArmed Forces (AP)\nCity\n*\nCash to Invest\n*\nCash to Invest:\n$100,000 - $250,000\n$250,000 - $500,000\n$500,000 - $1,000,000\n$1,000,000 +\nType of Franchise\n*\nInterested in:\nBrick & Mortar\nFoodtruck\nBoth Brick & Mortar & Foodtruck\nComments\nBy clicking the ‘Submit’ button below, you understand that a local representative of the Gigglewaters franchise development team will follow up with a short conversation to answer any questions you may have. You consent to be contacted by SMS text and marketing messages; message and data rates may apply and you may opt-out at any time.\nSubmit\nThank you for your interest in a Gigglewaters franchise. We will reach out to you soon to schedule a call!\n×\nThere was an error trying to send your message. Please try again later.\n×\nWe believe in bringing people together to a place of a thousand good times.\nYour best night out, an experience you can’t help but love.\n“Gigglewaters\n®\nhas emerged as a place that makes visitors feel like they are living a celluloid dream.”\n(-USA Today)\nYou’ve never been to a restaurant like this.\nGigglewaters\n®\nis more than just a culinary destination; it’s an immersive dining experience that transcends the ordinary. From the moment you step through our doors, you’ll feel the energy and excitement that sets us apart. With award-winning cuisine, innovative cocktails, and an intimate movie theater, Gigglewaters\n®\noffers a unique blend of nostalgia and community that you just won’t find anywhere else. Gigglewaters\n®\nisn’t just another restaurant—it’s an experience waiting to be discovered.\nRequest Info\nExperience the magic of bringing people together.\nWe’re looking for trailblazers.\nDo you ever look around at the established franchise brands with hundreds of units and wonder what it would have been like to be one of the first? To have your choice of prime territories? To work hand-in-hand with the founders as you brought a proven concept to the masses? To be more than just another number in the system, but a pioneer that helped build a legacy from the beginning? That’s what’s on the table right now at Gigglewaters. And these opportunities don’t arise every day.\nBe a trailblazer in the Gigglewaters franchise family and seize the opportunity to claim your territory as one of our inaugural franchisees. Sure, it’s fresh ground, but that’s precisely where the magic lies. And while the concept is new, our senior executives have a combined 40 years of restaurant and franchising experience. Together, we’ll work shoulder to shoulder to build something bigger than ourselves. Become one of the first franchisees at Gigglewaters and, as a torchbearer, carve your path in the history of our brand. Join us in shaping the future of dining and entertainment.\nBrick & Mortar\nOur full service restaurant, bar & one screen classic movie theater is unlike any concept we’ve come across and we’re looking for people who are equally extraordinary. From finding a location, to build out, grand opening & ongoing operations, we’ll be there to support you every step of the way. If you’ve ever dreamed of owning your own Gigglewaters\n®\n, click the button below and take the first step.\nRequest Info\nFood Trucks\nOur Gigglewaters\n®\nMobile Kitchen combines our award-winning food with the excitement of life on the road! Set your own schedule, be your own boss and bring the Giggles to a neighborhood near you! Our state-of-the-art Food Trucks and Trailers set the standard for a mobile Gigglewaters experience. If you’ve always wanted to live a life full of adventure and travel while running a show-stopping Food Truck, click the button below and get started today.\nRequest Info\nInvest in a place of a thousand good times.\nIf you’ve dreamed of owning your own location, where your financial success is directly related to how well you hold to Gigglewaters’\n®\ncore values, implement the systems we’ve developed, connect with your community & ensure that guests truly\nhave their best night out,\nwe’d love to invite you to join the Gigglewaters family of franchisees.\n• Brick & Mortar •\n$718K – $1.29M\nInitial Investment\n$59,500\nFranchise Fee*\n$1M\nRequired Net Worth\n$350K\nLiquid Capital\n• Food Truck •\n$113K – $381K\nInitial Investment\n$37,850\nFranchise Fee*\n$450K\nRequired Net Worth\n$100K\nLiquid Capital\nFind Out if you Qualify\n*Franchise Fee is Included in the Initial Investment.\nThe people behind the magic.\nFrank Fine\nPresident\nRead Bio\n×\nFrank Fine, President\nFrank has over 30 years of hotel and restaurant experience and served as SVP of American Inns Management, specializing in crisis management and company development with hotels and restaurants in Arizona, Nevada and California. He directly oversaw 75 hotels, restaurants and marinas and owned a number of his own. Frank is also a nationally certified counselor who specializes in critical incidents. He has been deployed as a first responder at the World Trade Center at 9/11, after major hurricanes, shootings and other national disasters for the past 30 years.\nFavorite Movie:\nA Few Good Men\nRachel Wilson\nChief Executive Officer\nRead Bio\n×\nRachel Wilson, Chief Executive Officer\nRachel brings over a decade of experience in franchised business management within the supplemental education sector, at one point serving as Vice President of US Operations and leading nationwide field support for franchisees. Before this, she founded a successful marketing company in New York City with a diverse client portfolio that included a prominent grocery store chain, 50 radio stations, and a major casino. Rachel spearheaded the development of the flagship Gigglewaters location, serving as its first General Manager. From day one, she built the brand and drove both operational and marketing strategies, establishing Gigglewaters as a premier destination.\nFavorite Movie:\nLabyrinth\nRichard Wilson\nChief Creative Officer\nRead Bio\n×\nRichard Wilson, Chief Creative Officer\nRichie spent 17 years as Senior Broadcast Producer of the Howard Stern Show. Richie is also well known as the inventor of the viral sensation “Shittens“, which Redbook said, “broke the internet”. Here at Gigglewaters, Richie drove the creative direction, from decor and design to movie selections and creative promotions.\nFavorite Movie:\nGoodfellas\nIn business for yourself, but never by yourself.\nThe Gigglewaters\n®\nteam is with you every step of the way. We’ve worked hard over the past few years to build out a system and develop a support team so that you’re not in this alone. You’ll undergo an extensive hands-on training program where you’ll learn the critical details of operating your very own Gigglewaters. This training includes time in the field learning the ropes in our corporate store, working hand-in-hand with the key leadership staff at our Home Office, as well as on-site training at your location when you open. Our training and support helps you master everything you need to know to run a Gigglewaters. From how to hire and inspire a team to greatness, manage payroll, run inventories and track cost of goods, handle scheduling and recruiting, use technology to track key metrics, to marketing through community partnerships- we’re here as a resource and we’re in it with you for the long haul.\nWe don’t stop when you start.\nOf course we’ll be at your Grand Opening. But our commitment to you goes far beyond that. You can count on long term, ongoing support from the entire corporate team. We believe it’s extraordinarily important to schedule regular check-ins to make sure operations are running smoothly, target metrics are being met and you’re achieving your fiscal goals. We take pride in our leadership team truly being just a phone call away.\nFAQs\nHave questions about franchising a Gigglewaters\n®\n? Read our FAQs below.\nWhere are the current franchise opportunities?\nWe are looking to open the initial franchise locations in Florida, focusing primarily throughout West Central Florida to start.\nAm I expected to work in my Gigglewaters restaurant?\nIt’s important to be an engaged owner with your finger on the pulse of your business. We expect that our owners will be involved in the daily business and do not allow passive investors. That being said, an owner-operator could have partners in their franchise that are passive investors.\nHow much capital do I need to invest?\nWe require a minimum of $100K in liquid assets and a $450K net worth for the food truck and a minimum of $350K in liquid assets and a $1M net worth for the brick and mortar.\nWhat is your initial franchise fee and ongoing royalty fees?\nOur Initial Franchise Fee for a Brick & Mortar is $59,500, the Royalty Fee is 5% of Gross Sales and the Ad Fund is 1% of Gross Sales. Our Initial Franchise Fee for a Food Truck is $37,850. Food Truck Royalties are 5% of sales against a monthly minimum, and the Ad Fund is 1% of Gross Sales.\nCan I get financing?\nAlthough Gigglewaters does not provide direct financing, we have experience working with third-party lenders who can assist you in obtaining the necessary funding to launch your business. The market offers a wide range of financing options, and with the guidance of a third-party lender, you can gain a comprehensive understanding of the available choices and select the one that best suits your needs.\nLet’s see if you qualify!\nWill I have a territory?\nYes. Our Brick & Mortar agreement stipulates a 5 mile radius/10 mile diameter* from another brick & mortar location. Our Food Truck territories are based on contiguous zip codes of 500,000 population*, excluding a half mile radius from any established Brick & Mortar. *Exceptions are listed in the FDD for densely populated areas.\nI have never run a restaurant before. Is Gigglewaters still a good business opportunity for me?\nYou can definitely still own and operate a Gigglewaters\n®\nbecause we give you all the training and support you need. We’re looking for candidates with a willingness to work hard and a great attitude; we can teach you the rest.\nWhat kind of neighborhood does Gigglewaters need to thrive?\nAn ideal neighborhood is a walkable, lively community. We appeal to all ages- we’ve got first dates, young families & retirees all enjoying the classic movies, delicious food, and award-winning cocktails. There’s something for everyone in every community.\nCan I invest in just the food truck?\nYes! The food truck is a standalone franchise opportunity for those investors looking for a lower cost mobile business. It’s also a great way to get started in the Gigglewaters franchise family with potential to expand to a brick and mortar restaurant! We have options for both trucks and trailers, with an Initial Investment starting from only $113,000!\nWhat kind of training and support can I expect to receive?\nWe have a comprehensive, 4-week training program where we’ll teach you all facets of the business. That training is a combination of virtual, in-person and hands-on in our flagship location in Safety Harbor, and then additional on-site training will be provided at your Gigglewaters location. Training and support continues well after your opening; we’re always here to help.\nHow do I get started?\nSimply complete and submit the brief\ninquiry form below\nnow and someone from our Franchise Development team will contact you shortly.\nWe Don’t Just Make a Burger\nWe Make a Difference.\nWe’ve won countless awards, including ‘Best Burger in Tampa Bay’, ‘Best Cocktails’, ‘Best Brunch’, and more. However, that’s not what we’re most proud of at Gigglewaters\n®\n. It’s a program we created called “Giggles for Good”.\nGo to Top",
      "emails": []
    }
  ],
  "all_links": [
    "https://gigglewaters.com/foodtrucks/",
    "https://gigglewaters.com/menu/",
    "mailto:info@gigglewaters.com",
    "https://gigglewaters.com/about-us/",
    "https://gigglewaters.com/franchise/",
    "http://gigglewaters.com/menu",
    "https://gigglewaters.com/careers/",
    "https://gigglewaters.com/movies/",
    "mailto:events@gigglewaters.com",
    "http://gigglewaters.com/careers",
    "http://gigglewaters.com/foodtrucks/",
    "http://gigglewaters.com/franchise",
    "https://gigglewaters.com/",
    "http://gigglewaters.com/about-us",
    "http://gigglewaters.com/giggles-for-good",
    "https://gigglewaters.com/giggles-for-good",
    "https://gigglewaters.com/menu",
    "https://gigglewaters.com/press-room/"
  ],
  "candidate_links": [
    "https://gigglewaters.com/about-us/",
    "mailto:events@gigglewaters.com",
    "http://gigglewaters.com/franchise"
  ],
  "visited": [
    "http://gigglewaters.com/",
    "http://gigglewaters.com/about",
    "http://gigglewaters.com/contact",
    "http://gigglewaters.com/staff",
    "http://gigglewaters.com/team",
    "http://gigglewaters.com/board",
    "http://gigglewaters.com/directory",
    "http://gigglewaters.com/events",
    "http://gigglewaters.com/sitemap.xml",
    "http://gigglewaters.com/council",
    "http://gigglewaters.com/leadership",
    "http://gigglewaters.com/management",
    "http://gigglewaters.com/producers",
    "http://gigglewaters.com/support",
    "http://gigglewaters.com/crew",
    "http://gigglewaters.com/members",
    "http://gigglewaters.com/bios",
    "http://gigglewaters.com/people",
    "http://gigglewaters.com/artists",
    "http://gigglewaters.com/musicians",
    "http://gigglewaters.com/faculty",
    "http://gigglewaters.com/administration",
    "https://gigglewaters.com/about-us/",
    "mailto:events@gigglewaters.com",
    "http://gigglewaters.com/franchise"
  ],
  "base_url": "http://gigglewaters.com/"
}