{
  "pages": [
    {
      "url": "https://www.golfcollective.com/terms-and-conditions",
      "is_candidate": false,
      "has_email": true,
      "text": "Home\nFAQs\nBlog\nPolicies\nMore\nUse tab to navigate through the menu items.\nMember Log In\nComprehensive\nTerms & Conditions\nPrivacy Policy\nTerms and Conditions\nMembership Agreement\nWaiver and Release of Liability\nWelcome!\nThe material appearing on this website\nhttps://www.golfcollective.com\n(this “Site”), is provided as information about Golf Collective’s business, community, and people, and as a platform for online connection. The owner of this Site, Golf Collective and its directors, agents, employees and affiliates assume no responsibility or liability for any consequence resulting directly or indirectly from any action or inaction you take based on the information found on the Site or material linked to this Site.\nAny information on this Site is provided for promotional or informational purposes only and is not to be relied upon as a professional opinion. By using this Site, you accept and agree that following and using any information or recommendation provided on this Site is at your own risk.\nPRIVACY POLICY\nGolf Collective understands how important your privacy is. This privacy policy (the “\nPrivacy Policy\n”) sets out the privacy policies and practices for Golf Collective, LLC  and its subsidiaries and affiliates (collectively, “\nGolf Collective\n”) with respect to how Golf Collective collects your personal information. It also describes how Golf Collective maintains, uses, and discloses personal information. This Privacy Policy applies to information collected from you by Golf Collective via the Site. This Privacy Policy also sets out how you can access certain information that Golf Collective may collect about you.\nIn this Privacy Policy, personal information means information about an individual whose identity is apparent or can be reasonably ascertained from the information as further defined under applicable privacy laws (“\nPersonal Information\n”).\n​\nPlease note that the Site may contain links to other third-party websites that are not controlled or operated by Golf Collective. All of these third parties are listed in section 4.4 of this Agreement. This Privacy Policy does not apply to such third-party websites, and Golf Collective is not responsible for the content of such third-party websites or the privacy practices of such third parties. Golf Collective encourages you to request and review the privacy policies of any third parties upon disclosing your Personal Information to such parties or when visiting such third-party websites.\n​\n1. Consent of Collection of Information.\nBy submitting Personal Information to Golf Collective and its Site or any of its service providers, you agree and consent to the collection of your Personal Information and consent to the use, disclosure and transfer of your Personal Information in accordance with the provisions of this Privacy Policy. You may always refuse or withdraw your consent by contacting Golf Collective at\nadmin@golfcollective.com\n. You understand that if you withdraw your consent, Golf Collective may not be able to continue to offer its services and provide its information to you.\n​\n​\n2. Children Under 18.\nThe Site is not intended for children under eighteen (18) years of age. No one under age 18 may provide any Personal Information to or on the Site. Golf Collective does not knowingly collect Personal Information from children under 18. If you are under 18, do not use or provide any information on the Site or through any of its features, register on the Site, make any purchases through the Site, use any of the interactive or public comment features of the Site, or provide any information about yourself to us, including your name, address, telephone number, email address, or any screen name or user name you may use. If Golf Collective learns we have collected or received Personal Information from a child under 18 without verification of parental consent, we will delete that information. If you believe Golf Collective might have any information from or about a child under 18, please contact us at\nadmin@golfcollective.com\n.\n​\n3. Revisions to this Privacy Policy.\nGolf Collective  reserves the right, in Golf Collective’s sole discretion, to change, modify, add or remove portions of this Privacy Policy at any time and from time to time, without prior notice to you. Golf Collective will treat your continued use of the Site following such revision as your acceptance of the revised terms. All revisions will be posted to the Site and will apply to any Personal Information collected on or after the date posted. Golf Collective will obtain the necessary consents required under applicable privacy laws if it seeks to collect, use or disclose your Personal Information for purposes other than those to which consent has been obtained, unless otherwise required or permitted by law.\n​\n4. What Personal Information does Golf Collective collect and how is it processed?\n4.1 What do we collect?\nGolf Collective may directly collect your name, address, phone number and email address. There may be other information you provide but that will not be collected by Golf Collective and instead will be collected by the third parties Golf Collective works with as outlined in 4.4.\n4.2 Email.\nWe may send you a newsletter or other promotional materials through email. We will only contact you through our newsletter for promotional or informational purposes. Subscribing to our newsletters is optional and you will always be able to unsubscribe.\n​\n4.3 Phone Number.\nWe may collect your phone number and we may contact you via phone to contact you or if we feel there is information which would be beneficial to share with you. In accordance with everything outlined in this Privacy Policy, if you do not want to be reached by phone, you can ask us not to contact you via phone or you can choose not to share your phone number.\n4.4 Third Parties.\nGolf Collective may work with third party applications in order to provide you with the best services on the Site. These organizations may collect Personal Information from you in order to provide you with the services, including your name and contact information. Specifically, the third parties Golf Collective may work with on the Site are listed below. We’ve included links to their privacy policies to ensure you are comfortable using them.\n4.4.1\nFacebook:\nhttps://www.facebook.com/privacy/policy,\n4.4.2\nInstagram:\nhttps://privacycenter.instagram.com/policy,\n4.4.3\nGoogle Drive:\nhttps://policies.google.com/privacy?hl=en\n4.4.4\nWix:\nhttps://www.wix.com/about/privacy,\n4.4.5\nYourGolfBooking:\nhttps://yourgolfbooking.com/legal/terms/privacy-policy-27-04-2021,\n4.4.6\nUbiquiti Unifi:\nhttps://www.ui.com/legal/privacypolicy/,\n4.4.7\nTrackman:\nhttps://www.trackman.com/legal/privacy-policy\n5. How will Golf Collective use your Personal Information?\nYour Personal Information will be used to provide you with promotional and informative materials and offers and deliver the products and services you can purchase or subscribe to from the Site. Specifically:\n5.1\nYour credit card information will not be kept by Golf Collective but instead by one of the third parties listed in section 4.4 above;\n5.2\nYour name and e-mail address are collected but will not actually be stored on the Site. Any information captured will be processed through third party websites in section 4.4 above;\n​\n5.3\nYour phone number may be used to contact you via phone if there is information we would like to share which we feel would benefit you;\n​\n5.4\nIf you subscribe to our newsletter your Personal Information will be used to send the newsletter to you;\n​\n5.5\nIf we send you the Newsletter for marketing purposes, we will send you emails about promotions, special events and other information. You can opt not to receive these emails from us by either clicking “unsubscribe” at the bottom of the email when you receive it or by sending an email that includes your email address and a request that you not receive our promotional emails;\n​\n5.6\nWe may use your Personal Information to respond when you submit a question or suggestion to us, or when you request assistance regarding a service or product you purchased.\n​\n5.7\nWe may share your information if we believe in good faith that disclosure of your information is required to protect your safety or the safety of others, to investigate a fraud, or to respond to a government, judicial or other legal request or to comply with the law;\n​\n5.8\nWe may also share certain aggregated, anonymized information with a third-party provider in order to assist us in improving the Site.\n6. Storing Your Personal Information.\nGolf Collective’s web service may store your Personal Information when you interact with the Site. Golf Collective will be happy to delete any of your Personal Information that it holds upon a written request made by you. Your Personal Information will be safely disposed of by Golf Collective.\n7. Storing Your Phone Number.\nYour phone number will be kept in the phone or contacts database of Golf Collective and associates. Wherever it is stored, it will always be protected with a password and will never be shared with third parties without your permission.\n​\n8. We Play by The Rules.\nThe Site and Golf Collective abide by all relevant United States federal and State privacy laws in all aspects of our operations. This Privacy Policy is also compliant with GDPR and CCPA regulations. If you have any questions about our legal compliance, feel free to reach out to\nadmin@golfcollective.com\n.\n9. Affiliate Relationships.\nPlease assume that, for every recommendation or link we provide, the following holds true: we have become aware of a product or service that we think may be of interest to people who visit our website. After we do our own research and decide this item is of value to ourselves, our community, or our clients, we choose to promote that item and are compensated when our readers click on the link or purchase the product or service. (That compensation comes from our affiliate, not you). Regardless of compensation, we only mention products and services that we believe in and feel would be a benefit to you.\n10. Do Not Track Signals.\nGolf Collective currently does not recognize or respond to browser-initiated Do Not Track (DNT) signals, as the Internet industry is currently still working on Do Not Track standards and there is no accepted standard on how to respond to such signals.\n11. Analytics.\nThe Site keeps the following information from your visits to our webpage:\n11.1\nVisitor information to improve our customer engagement which tells us where and when people visit the Site and how long they stay there; and\n​\n​\n11.2\nIP information for website and server security.\n​\n12. Cookies.\nThe Site uses ‘cookies’ to keep a record of the number of times you’ve visited the Site and how you interacted with the Site during each visit. In addition to this, the Site also uses cookies which are not absolutely essential for your use of the Site. Your continued use of the Site serves as consent for these cookies.\n12.1\nA cookie is a small text file that gets sent by the servers of the Site to your hard drive and can only be read and interpreted by the Site’s servers. No Personal Information is stored in the cookie and there is nothing on it which can identify you personally.\n​\n​\n12.2\nCookies have an important function in how you interact while visiting the Site, ensuring the usability of the Site’s different features, helping the Site understand your preferences, and thus can improve your experience on the Site. If you do not want cookies from the Site, simply adjust the settings in your web browser to disable cookies. This may change the way you access the Site and may also render some of the Site’s features unusable, but of course it is your choice to do so.\n​\n13. Disclosure of Personal Information.\nGolf Collective will NEVER sell or license any Personal Information we collect from you. Golf Collective is not liable for any disclosure of your Personal Information by any third party, particularly the ones outlined in section 4.4 above. By purchasing the services and products offered by Golf Collective, you agree to be bound to and consent to the provisions of our third parties’ privacy policies. In the event that Golf Collective changes its practices, you will be notified and you will be able to opt-out of Golf Collective using your Personal Information by contacting us at\nadmin@golfcollective.com\n.\n14. Choice of Laws and Venue.\nThis Privacy Policy and the use of the Site are governed by the laws of the United States and the State of Florida . The parties agree to irrevocably submit all claims to the exclusive jurisdiction of the courts of the State of Florida . If a dispute arises, we agree to first resolve it through binding arbitration to take place in the State of Florida .\n15. Your Consent.\nBy choosing to provide Golf Collective with your Personal Information you are consenting to its collection, use and disclosure in accordance with the principles outlined in this Privacy Policy. If you are under the age of 18, you must not provide any Personal Information to us without the consent of your parent or guardian, or as otherwise provided for by applicable law.\n16. Protecting Your Privacy.\nGolf Collective is committed to protecting your privacy. Security measures, such as using passwords on servers and computers, and locked cabinets where Personal Information is stored have been adopted to protect your Personal Information against loss or theft, unauthorized access, disclosure, copying, use or modification. Online transactions are completed using third party applications outlined in section 4.4 above. Please refer to the third parties’ privacy policies, of which links have been provided above, for clarification on how your transaction and Personal Information will be handled. Golf Collective makes no promises, warranties or representations about the manner in which your Personal Information is handled by third parties and bears no liability whatsoever for their use of them.\n17. Verifying your Identity.\nGolf Collective will ask you to verify your identity when you contact us  or submit a request regarding your Personal Information. Golf Collective will ask you to provide sufficient information that allows us to reasonably verify that you are the person who we collected Personal Information about.\n18. The Internet Can Be Unreliable.\nThe internet is, by its nature, inherently open and subject to interception of information. We cannot guarantee that the information you provide to Golf Collective over the internet or otherwise will not be intercepted by third parties while it is being communicated by means that are outside of Golf Collective’s control.\n​\n19. Verifying and Amending Your Personal Information.\nGolf Collective tries to ensure that all Personal Information about you that is in our possession is accurate, complete and up-to-date. Please contact us at\nadmin@golfcollective.com\nto advise us of any changes to your Personal Information. You may request access to the Personal Information held by Golf Collective at any time or seek to make corrections to it.\n20. Resolving your concerns.\nIf you have any questions or concerns about Golf Collective's Personal Information collection, use and disclosure practices, please let us know at\nadmin@golfcollective.com\nand we will do our best to help you.\nTERMS AND CONDITIONS\nPlease read the following carefully! Your access to and use of this Site is subject to legally binding terms and conditions which you accept and agree to by accessing this Site.\nThe following terms and conditions (“\nTerms and Conditions\n”) form a binding agreement (this “\nAgreement\n”) between you and Golf Collective, LLC, a  Limited Liability Company  operating out of the State of Florida  (“\nGolf Collective\n”). Golf Collective may modify, amend, supplement and replace these Terms and Conditions at any time without providing you with advance notice. Your continued use of this Site after any change means you have accepted the changed Terms and Conditions.\n1. Copyright.\nAll materials created by Golf Collective on the Site are protected by United States copyright laws as original works. The absence of a registered copyright symbol does not mean that such materials are not protected as belonging to Golf Collective.\n2. Links to Third Party Websites.\nThis Site may contain links to third party websites. All such linked sites, materials and pages are not under the control of Golf Collective and Golf Collective is not responsible for the content contained in any linked website nor for any losses or damages you may incur as a result of the use of any third party website. Golf Collective accepts no liability for any errors or omissions contained in third party websites. These links are provided to improve your use of this Site, enable you to connect with Golf Collective on various platforms, help Golf Collective offer the easiest services for you and conduct transactions.\n​\n3. Use License.\nIf Golf Collective has materials on the Site which you can download, permission is granted to download copies of the materials for personal, non-commercial viewing only. This is the grant of a license, not a transfer of title, and under this license you may not:\n3.1\nmodify or copy the materials;\n​\n3.2\nuse the materials for any commercial purpose or for any public display (commercial or non-commercial);\n​\n3.3\ntransfer the materials to another person or “mirror” the materials on any other server.\nThis license shall automatically terminate if you violate any of these restrictions and may be terminated by Golf Collective at any time. Upon terminating your viewing of these materials or upon the termination of this license, you must destroy any downloaded materials in your possession, whether in electronic or printed format.\n​\n4. Refunds\n. Our refund policy for any of the services or products sold on the Site is as follows:  We will refund the prorated value of the unused portion of the membership.\n​\n5. Disclaimer\n. Our goal is to share information in an informative, open, and honest way. That being said, any information and services provided on or through the Site is for informational and educational purposes only. What we share is the opinion and perspective of Golf Collective.  The information and education is not intended or implied to supplement or replace professional advice. Before taking any action, please make sure you consult with a professional.\n​\n6. No Guarantees\n. We make\nno guarantees\nabout any particular results or benefits that you’ll get from our Site, our products or services. We will do everything to give you the tools to succeed, but we make no guarantees. We cannot be any more clear about this: we make no promises regarding results and make no guarantees whatsoever.\n7. Site Terms of Use Modifications\n. Golf Collective may revise these Terms and Conditions for its Site at any time without notice. By continuing to use the Site after Golf Collective modifies this Agreement, you are agreeing to be bound by the updated version of this Agreement.\n​\n8. Limitation of Liability\n. In no event shall Golf Collective or its affiliates be liable for any damages (including, without limitation, damages for loss of data or profit, or due to business interruption) arising out of the use or inability to view or use the materials or content on the Site, even if Golf Collective has been notified orally or in writing of the possibility of such damage.\n​\n9. Choice of Laws and Venue\n. The parties agree to irrevocably submit all claims relating to Golf Collective’s Site to the exclusive jurisdiction of the courts of the State of Florida  without regard to its conflict of law provisions.\n​\n10. Indemnity\n. As a condition of your use of this Site, you indemnify Golf Collective and its directors and affiliates from and against any and all liabilities, expenses (including legal fees) and damages arising out of claims resulting or arising from your use of this Site.\n11. Entire Agreement\n. These Terms and Conditions and any other legal notices, policies and guidelines of Golf Collective linked to these Terms and Conditions or contained on this Site constitute the entire agreement between you and Golf Collective relating to your use of this Site and supersede any prior understandings or agreements (whether oral or written), claims, representations, and understandings of the parties regarding such subject matter. This Agreement may not be amended or modified except by Golf Collective. If for any reason a court of competent jurisdiction finds any provision or portion of these Terms and Conditions to be unenforceable, that portion or provision shall be enforced to the maximum extent permissible so as to effectuate the intent of the parties as reflected by that provision, and the remainder of these Terms and Conditions shall continue in full force and effect. Failure by Golf Collective to enforce or exercise any provision of these Terms and Conditions shall not constitute a waiver of that right. Paragraph headings are for reference only.\nGOLF COLLECTIVE MEMBERSHIP AGREEMENT\nWelcome to Our Community!\nThe following Studio Membership Agreement (the “\nAgreement\n”) will clearly communicate our expectations in having you as part of our exciting and innovative golf community. If you have any questions please let us know as we want to make sure we are all on the same page moving forward.\nIn exchange for membership access to Golf Collective’s facility and simulators, you agree to be bound by the following conditions.\n​\n1. Parties.\nThis Agreement is made between Golf Collective, LLC, a Limited Liability Company operating out of the State of Florida (“\nGolf Collective\n,” “\nwe\n,” “\nour\n,” and “\nus\n”) and you, the undersigned (electronically) or person who has clicked “I Agree” (or something similar) to this Agreement (“\nyou\n” and “\nyour\n”).\n2. Services.\nWe promise to provide you with access to our studio and the use of our facilities, as well as access to our regularly scheduled classes (either online or in-person) at Golf Collective (the “Membership”), according to the terms of this Agreement, and as outlined in Schedule “A” Memberships below.\n​\n3. Term.\nThis Agreement will be binding upon your Membership payment and will last for the time specified in Schedule “A” Memberships below, as specified online, or as agreed upon between us (the “Term”).\n​\n4. Termination.\nTo terminate this Agreement, please let us know in writing or via email prior to the desired termination date. Any Payments made will not be refunded, unless as specified in the refund policy listed below. Please note that if you violate any of the terms of this Agreement, Golf Collective may terminate this Agreement effective immediately and you will not be entitled to any refunds or any continued working relationship with Golf Collective.\n5. Our Commitment to You.\nThrough your Membership, Golf Collective is committed to providing you with the opportunity and support to have fun, enjoy our state of the art facilities and improve all aspects of your game.\n6. Code of Conduct.\nYou agree to be prudent and respectful while using the simulator and all of the golf equipment in our unsupervised space. We ask you to be mindful when using any equipment to ensure that the next person can enjoy it as well. Most importantly, we ask you to please start and stop on time, as once your session with the simulator has ended, another member's time will begin and we ask you to be punctual and ensure your space is as clean as you found it.\n6.1 No Alcohol.\nPlease note that we are not permitted to have any alcoholic beverages permitted anywhere on the premises. We kindly as you not to bring in any alcohol to our space. In the event we discover you have broken this rule, we reserve the right to terminate your membership effective immediately.\n7. Surveillance.\nAs we have a state of the art facility which is not always supervised, you understand that we will keep cameras recording 24/7 to watch what happens in the facility. We are doing this for your security and safety. If you have any issues with this, please raise it to us before signing this Agreement.\n8. Scheduling.\nPlease consult Golf Collective or refer to our available schedule of classes for the exact scheduling and time of our classes.\n9. Payment.\nYou agree to pay the price, including the possibility of recurring payments (“\nRecurring Payment\n”), of the Membership as outlined below in Schedule “A” (the “\nPayment\n”). All Payments, prices and costs are in USD.\n9.1\nThe Payment price outlined in Schedule “A” is subject to taxes and additional fees. Any subsequent changes to the Payment price will not affect the validity of this Agreement.\n​\n9.2\nPayment is due upon completed purchase of the Membership and must be made in full prior to the start of your Membership.\n10. Fluctuation of Payments.\nYou understand that we reserve the right to change our prices and that in your acceptance of these new prices and continued payment, you continue to be bound to all the terms of this Agreement. We will always provide at least 30 days notice before raising any prices and we will communicate with you to ensure you are aware of any changes.\n11. Cancellation of Membership.\nYou can cancel your Membership at any time, as you like. You will not be refunded for any payments and once you cancel your membership, you will no longer be able to access the facility. Please only cancel once you have used up all of your hours or at the end of the month, so you get the maximum value with us.\n12. Recurring Payments.\nIf your Payment includes Recurring Payments, you authorize Golf Collective to maintain your account information and charge that account automatically upon the renewal of the Membership, or as otherwise specified, with no further action required by you.\n12.1.\nGolf Collective will charge your method of payment as outlined in Schedule “A” for the Recurring Payment. We will notify you seven (7) days before the Payment charge.\n13. Payment Failure.\nIn the event that your Payment fails, your Membership access will be temporarily suspended until we receive your Payment. In the event of three failed payments, you understand that Golf Collective may contract a collection agency to collect the money from you.\n14. Late Cancellation.\nIf you cannot make a session, and cancel with more than 24 hours notice, you will receive a session credit. If you give late notice of cancellation (anything less than 24 hours), you will be considered a no-show and your session will not be rescheduled or refunded. We will handle exceptions on a case by case basis and make all decisions with unilateral and unfettered discretion.\n15. Refunds.\nOur refund policy is as follows: All sales are final. Memberships are non-refundable and non-transferable.\n16. Legal Fees.\nYou will be responsible for any and all legal fees incurred by Golf Collective regarding any potential chargeback issues (for example, if you want to issue a chargeback or contest a payment).\n17. No Guarantees.\nGolf Collective cannot guarantee any particular success from participating in our classes or from our Membership. We promise to provide you with the opportunity, classes and support to achieve your goals, but any success and results ultimately depends on your commitment.\n17.1\nGolf Collective also cannot guarantee that all of your actions during your Membership will be supervised. This Agreement to receive a Membership and related services does not include any express or implied guarantee of supervision.\n18. Studio Closure.\nIf our studio and facilities are forced to close due to COVID-19, a natural disaster, or other unavoidable circumstance, the Membership continues with online content.\n19. Force Majeure.\nGolf Collective will not be liable for any failure or delay regarding the Membership if such failure or delay is: beyond the reasonable control of Golf Collective, could not have been reasonably foreseen or provided against, or due to events such as a pandemic, natural disaster, or other Act of God. In such an event, you will not be entitled to any refunds or recovery.\n20. Substitute Services.\nGolf Collective has the right to substitute services. This means that if we ever need to switch to online classes or asynchronous virtual offerings due to circumstances beyond our control, we have the right to such a substitution for in person classes.\n​\n21. Waiver +  Guest Waiver Sign.\nBefore your Membership can begin, you must sign our Waiver Agreement form.\nPlease read it and make sure you understand it. You need to sign that form as well as this Agreement so that we can be absolutely sure you understand and agree to it.\nFurther, you understand that if you bring any guests into our facility, it is\nyour responsibility to ensure they sign a Waiver\n. You may provide your guests with the link to the waiver found in the reservation confirmation email. There will be iPads placed at the entrance to the facility for your guests to sign before they may enter.\n21.1.\nIf we discover you bring a guest who does not sign a Waiver, that will serve as a breach of this Agreement and we can terminate your membership without any refund. Please let us know if you have any questions.\n​\n22. Indemnity.\nYou hereby fully indemnify Golf Collective, LLC and any of its members, directors, officers, employees, contractors, volunteers, agents, executors, administrators, successors, family members and assigns (the “\nReleased Parties\n”) from any liability and damages arising from death, personal injuries or loss/damage to personal property to your or any guests who you may bring to the facility.\n23. Standard Legal Things. Choice of Laws and Venue.\nThis Agreement will be governed exclusively by the laws of the State of Florida. The parties agree to irrevocably submit all claims to the exclusive jurisdiction of the courts of the State of Florida.\nSeverability.\nIf any provisions of this Agreement are invalid or unenforceable, the other provisions in the Agreement will remain in full force and effect.\nEntire Agreement.\nThis Agreement constitutes the entire Agreement between the parties and replaces any prior agreements.\nWaiver of Breach.\nThe waiver by Golf Collective of any breach by you of any provision of this Agreement will not be taken to be a waiver of any further breaches by you.\nCounterparts.\nThis Agreement may be signed by any number of counterparts, each of which is an original, and all of which taken together constitute one single document.\nOnline Agreement.\nWe agree that this Agreement may be signed electronically or agreed to by having you click “I Agree”  (or something similar), the effect of which will be the same as if we signed the Agreement by hand and the intention of which is that both parties desire to be bound by all the terms of the Agreement.\n​\nSCHEDULE “A” MEMBERSHIPS\nBronze Membership\nCost: USD $197\nRenewal: Monthly\nDetails:\nDaily 1-hour reservations\nReserve 7-days in advance\nAccess from 6 AM - 10 PM daily\n1 authorized user\n​\nSilver Membership\nCost: USD $240\nRenewal: Monthly\nDetails:\nDaily 1-hour reservations\nReserve 14-days in advance\nReserve 2-hours two times per month\nAccess from 6 AM - 10 PM daily\n1 authorized user\n​\nGold Membership\nCost: USD $350\nRenewal: Monthly\nDetails:\nDaily 1-hour reservations\nReserve 21-days in advance\nReserve 2-hours two times per month\nReserve 3-hours two times per month\nAccess from 6 AM - 10 PM daily\n1 authorized user\n​\nWAIVE\nR AND RELEASE OF LIABILITY\n​\nAll participants must agree to the waiver and release of liability.\n​\nWelcome! Before participating in Golf Collective’s services, we need you to thoroughly read, understand, and agree to this Waiver and Release of Liability (the “\nWaiver\n”). The purpose of this Waiver is to clearly communicate some risks of participating with us, and to have you release Golf Collective of any liability if you get injured or if any of your things are lost, stolen or broken, or if anything else goes wrong while you are enjoying our facility. Please be aware that if you do not sign this Waiver and agree to its terms, you will not be permitted to use our golf simulators or facilities.\n​\nIf you are a minor in the State of Florida (under 18 years old) or in your place of residence, your legal guardian must also sign this Waiver on your behalf.\n​\nPLEASE READ CAREFULLY TO MAKE SURE YOU UNDERSTAND THIS WAIVER.\nPLEASE ASK QUESTIONS IF ANYTHING IS UNCLEAR. WE ARE HERE TO SUPPORT YOU. BY SIGNING THIS YOU AGREE YOU ARE SIGNING AWAY YOUR LEGAL RIGHTS TO SUE, AND YOU AGREE TO BE BOUND BY ALL THE TERMS OF THIS WAIVER.\n​\n1. Parties.\nWe are Golf Collective, LLC, a Limited Liability Company based in the State of Florida. In this Waiver, we will refer to ourselves as “\nGolf Collective\n,” “\nus\n,” “\nwe\n,”  and “\nour\n.” We’ll refer to you, the undersigned (electronically or by hand), or the person who has clicked “I Agree” (or something similar) to this Waiver, as “\nyou\n” or “\nyour\n.”\n​\n2. The Activities.\nAs part of your services with Golf Collective, you may participate, in person or online, in engaging and innovative golf simulator activities, events, workshops and more, all of which may involve but are not limited to the following (“\nActivities\n”)\n​\n2.1 Anything and everything related to golf, playing golf on a screen simulator and utilizing golf movements. This includes but is not limited to: dynamic lateral movements, flexibility training, body weight movement, locomotor movements, mobility, range of motion movement, and breathing.\n​\n2.2 The Activities involve playing golf indoors with a screen simulator. This means that you will be swinging golf clubs and hitting golf clubs indoors either by yourself or around other people.\n​\n2.3 All Activities are entirely unsupervised, which means that you need to be especially careful to mind your own personal space and always be aware and careful of what is going on around you.\n​\n3. Equipment.\nIn the course of the Activities, you may use a variety of equipment, which could include but is not limited to: golf clubs, golf balls and simulator screens to play your round on (the “\nEquipment\n”). Please do not use any equipment not instructed by Golf Collective.\n​\n4. Inherent Risks.\nYou understand that participation in the Activities may pose inherent risks, some more serious than others. These risks can result in serious harm and injuries that could change your quality of life, your ability to earn an income and, in very rare and extreme circumstances, could even result in death.\n​\n4.1\nRisks of physical injury may include but are not limited to things like muscle tears, strains, and other musculoskeletal injuries, sprains, fractures, broken bones, cardiovascular complications, high blood pressure, dehydration, dizziness, fainting, concussion, concussion like syndromes, PTSD.\n​\n4.2\nThere is a real and serious risk of getting hit with a golf ball or a golf club, whether it be from your swing and your group or another group around you.\n​\n4.3\nThere are increased risks posed by participating in the Activities, as there is no in-person supervision or space provided for you. You will therefore need to ensure the safety of the Activities, using your judgment on how to best practice them, not acting inappropriately or attempting anything you feel unsure of doing.\n​\n4.4\nWe would like to emphasize that your release of our liability is not limited in any way to these risks. The risks listed above are only examples. To be completely clear, you are agreeing not to sue us at all.\n​\n5. Affirmation of Health.\nBy participating in any Activities with Golf Collective, you affirm that you have sought medical advice regarding your fitness or are certain of your ability to engage in the Activities.\nIf you have any pre-existing medical conditions (e.g. asthma, diabetes, heart disease), physical injuries, weakness, are pregnant, post-natal or post-surgery, you should consult with your doctor first before engaging in the Activities.\nPlease communicate and inform us IMMEDIATELY if at any point you do not feel well during the Activities.\n​\n6. Voluntary Assumption of Risk.\nYou certify that you have read this Waiver and understand the risks of participating in the Activities with Golf Collective. By signing this Waiver or clicking “I Agree” (or something similar), you are showing your voluntary engagement and assumption of the risks of the Activities.\n​\n7. Lost or Stolen Personal Items.\nYou agree that it is solely your responsibility to safeguard your personal items, and Golf Collective is in no way responsible for any of your personal property that is damaged, lost, or stolen before, during, or after your participation in the Activities.\n​\n8. Release, Waiver and Indemnity.\nYou hereby release, hold harmless, indemnify and waive any claims against Golf Collective, LLC and its members, owners, directors, officers, contractors, employees, affiliates, volunteers, associates, landlords, agents, executors, administrators, successors, family members and assigns (the “\nReleased Parties\n”) with respect to any and all liability and damages incurred during, or in any way associated with, your participation in the Activities with Golf Collective, however caused,\nincluding as a result of the\nReleased Parties’\nnegligence\n, including but not limited to damage to or loss of personal property, personal injuries, death, illness, or any cause of action related to premises liability. You are releasing the Released Parties at your own risk and you agree to forfeit any and all forms of legal recourse which may be available to you, including but not limited to any form of damages, as a result of your participation in the Activities. You agree that this provision applies to you, your family, heirs, executors or anyone else who may be able to bring a legal action on your behalf in the future.\n​\n9. Continued Agreement.\nAgreement to this Waiver will act as your continued agreement to all ensuing Activities and any further interactions with Golf Collective, whether in person, online, or via video conferencing tool.\n​\n10. General Legal Provisions.\nChoice of Laws and Venue. This Waiver will be governed exclusively by the laws of the State of Florida. The parties agree to irrevocably submit all claims to the exclusive jurisdiction of the courts of the State of Florida.\nSeverability\n. If any terms or provisions of this Waiver are invalid or unenforceable, the other provisions in the Waiver will remain in full force and effect.\nEntire Agreement\n. This Waiver constitutes the entire agreement between the parties and replaces any prior agreements.\nOnline Agreement\n. The parties agree that this Waiver may be signed electronically or agreed to by having you click “I Agree” (or something similar), the effect of which will be the same as signing by hand.\nComprehensive\nTerms & Conditions\nPrivacy Policy\nTerms and Conditions\nMembership Agreement\nWaiver and Release of Liability\nWelcome!\nThe material appearing on this website\nhttps://www.golfcollective.com\n(this “Site”), is provided as information about Golf Collective’s business, community, and people, and as a platform for online connection. The owner of this Site, Golf Collective and its directors, agents, employees and affiliates assume no responsibility or liability for any consequence resulting directly or indirectly from any action or inaction you take based on the information found on the Site or material linked to this Site.\nAny information on this Site is provided for promotional or informational purposes only and is not to be relied upon as a professional opinion. By using this Site, you accept and agree that following and using any information or recommendation provided on this Site is at your own risk.\nPRIVACY POLICY\nGolf Collective understands how important your privacy is. This privacy policy (the “\nPrivacy Policy\n”) sets out the privacy policies and practices for Golf Collective, LLC  and its subsidiaries and affiliates (collectively, “\nGolf Collective\n”) with respect to how Golf Collective collects your personal information. It also describes how Golf Collective maintains, uses, and discloses personal information. This Privacy Policy applies to information collected from you by Golf Collective via the Site. This Privacy Policy also sets out how you can access certain information that Golf Collective may collect about you.\nIn this Privacy Policy, personal information means information about an individual whose identity is apparent or can be reasonably ascertained from the information as further defined under applicable privacy laws (“\nPersonal Information\n”).\n​\nPlease note that the Site may contain links to other third-party websites that are not controlled or operated by Golf Collective. All of these third parties are listed in section 4.4 of this Agreement. This Privacy Policy does not apply to such third-party websites, and Golf Collective is not responsible for the content of such third-party websites or the privacy practices of such third parties. Golf Collective encourages you to request and review the privacy policies of any third parties upon disclosing your Personal Information to such parties or when visiting such third-party websites.\n​\n1. Consent of Collection of Information.\nBy submitting Personal Information to Golf Collective and its Site or any of its service providers, you agree and consent to the collection of your Personal Information and consent to the use, disclosure and transfer of your Personal Information in accordance with the provisions of this Privacy Policy. You may always refuse or withdraw your consent by contacting Golf Collective at\nadmin@golfcollective.com\n. You understand that if you withdraw your consent, Golf Collective may not be able to continue to offer its services and provide its information to you.\n​\n​\n2. Children Under 18.\nThe Site is not intended for children under eighteen (18) years of age. No one under age 18 may provide any Personal Information to or on the Site. Golf Collective does not knowingly collect Personal Information from children under 18. If you are under 18, do not use or provide any information on the Site or through any of its features, register on the Site, make any purchases through the Site, use any of the interactive or public comment features of the Site, or provide any information about yourself to us, including your name, address, telephone number, email address, or any screen name or user name you may use. If Golf Collective learns we have collected or received Personal Information from a child under 18 without verification of parental consent, we will delete that information. If you believe Golf Collective might have any information from or about a child under 18, please contact us at\nadmin@golfcollective.com\n.\n​\n3. Revisions to this Privacy Policy.\nGolf Collective  reserves the right, in Golf Collective’s sole discretion, to change, modify, add or remove portions of this Privacy Policy at any time and from time to time, without prior notice to you. Golf Collective will treat your continued use of the Site following such revision as your acceptance of the revised terms. All revisions will be posted to the Site and will apply to any Personal Information collected on or after the date posted. Golf Collective will obtain the necessary consents required under applicable privacy laws if it seeks to collect, use or disclose your Personal Information for purposes other than those to which consent has been obtained, unless otherwise required or permitted by law.\n​\n4. What Personal Information does Golf Collective collect and how is it processed?\n4.1 What do we collect?\nGolf Collective may directly collect your name, address, phone number and email address. There may be other information you provide but that will not be collected by Golf Collective and instead will be collected by the third parties Golf Collective works with as outlined in 4.4.\n4.2 Email.\nWe may send you a newsletter or other promotional materials through email. We will only contact you through our newsletter for promotional or informational purposes. Subscribing to our newsletters is optional and you will always be able to unsubscribe.\n​\n4.3 Phone Number.\nWe may collect your phone number and we may contact you via phone to contact you or if we feel there is information which would be beneficial to share with you. In accordance with everything outlined in this Privacy Policy, if you do not want to be reached by phone, you can ask us not to contact you via phone or you can choose not to share your phone number.\n4.4 Third Parties.\nGolf Collective may work with third party applications in order to provide you with the best services on the Site. These organizations may collect Personal Information from you in order to provide you with the services, including your name and contact information. Specifically, the third parties Golf Collective may work with on the Site are listed below. We’ve included links to their privacy policies to ensure you are comfortable using them.\n4.4.1\nFacebook:\nhttps://www.facebook.com/privacy/policy,\n4.4.2\nInstagram:\nhttps://privacycenter.instagram.com/policy,\n4.4.3\nGoogle Drive:\nhttps://policies.google.com/privacy?hl=en\n4.4.4\nWix:\nhttps://www.wix.com/about/privacy,\n4.4.5\nYourGolfBooking:\nhttps://yourgolfbooking.com/legal/terms/privacy-policy-27-04-2021,\n4.4.6\nUbiquiti Unifi:\nhttps://www.ui.com/legal/privacypolicy/,\n4.4.7\nTrackman:\nhttps://www.trackman.com/legal/privacy-policy\n5. How will Golf Collective use your Personal Information?\nYour Personal Information will be used to provide you with promotional and informative materials and offers and deliver the products and services you can purchase or subscribe to from the Site. Specifically:\n5.1\nYour credit card information will not be kept by Golf Collective but instead by one of the third parties listed in section 4.4 above;\n5.2\nYour name and e-mail address are collected but will not actually be stored on the Site. Any information captured will be processed through third party websites in section 4.4 above;\n​\n5.3\nYour phone number may be used to contact you via phone if there is information we would like to share which we feel would benefit you;\n​\n5.4\nIf you subscribe to our newsletter your Personal Information will be used to send the newsletter to you;\n​\n5.5\nIf we send you the Newsletter for marketing purposes, we will send you emails about promotions, special events and other information. You can opt not to receive these emails from us by either clicking “unsubscribe” at the bottom of the email when you receive it or by sending an email that includes your email address and a request that you not receive our promotional emails;\n​\n5.6\nWe may use your Personal Information to respond when you submit a question or suggestion to us, or when you request assistance regarding a service or product you purchased.\n​\n5.7\nWe may share your information if we believe in good faith that disclosure of your information is required to protect your safety or the safety of others, to investigate a fraud, or to respond to a government, judicial or other legal request or to comply with the law;\n​\n5.8\nWe may also share certain aggregated, anonymized information with a third-party provider in order to assist us in improving the Site.\n6. Storing Your Personal Information.\nGolf Collective’s web service may store your Personal Information when you interact with the Site. Golf Collective will be happy to delete any of your Personal Information that it holds upon a written request made by you. Your Personal Information will be safely disposed of by Golf Collective.\n7. Storing Your Phone Number.\nYour phone number will be kept in the phone or contacts database of Golf Collective and associates. Wherever it is stored, it will always be protected with a password and will never be shared with third parties without your permission.\n​\n8. We Play by The Rules.\nThe Site and Golf Collective abide by all relevant United States federal and State privacy laws in all aspects of our operations. This Privacy Policy is also compliant with GDPR and CCPA regulations. If you have any questions about our legal compliance, feel free to reach out to\nadmin@golfcollective.com\n.\n9. Affiliate Relationships.\nPlease assume that, for every recommendation or link we provide, the following holds true: we have become aware of a product or service that we think may be of interest to people who visit our website. After we do our own research and decide this item is of value to ourselves, our community, or our clients, we choose to promote that item and are compensated when our readers click on the link or purchase the product or service. (That compensation comes from our affiliate, not you). Regardless of compensation, we only mention products and services that we believe in and feel would be a benefit to you.\n10. Do Not Track Signals.\nGolf Collective currently does not recognize or respond to browser-initiated Do Not Track (DNT) signals, as the Internet industry is currently still working on Do Not Track standards and there is no accepted standard on how to respond to such signals.\n11. Analytics.\nThe Site keeps the following information from your visits to our webpage:\n11.1\nVisitor information to improve our customer engagement which tells us where and when people visit the Site and how long they stay there; and\n​\n​\n11.2\nIP information for website and server security.\n​\n12. Cookies.\nThe Site uses ‘cookies’ to keep a record of the number of times you’ve visited the Site and how you interacted with the Site during each visit. In addition to this, the Site also uses cookies which are not absolutely essential for your use of the Site. Your continued use of the Site serves as consent for these cookies.\n12.1\nA cookie is a small text file that gets sent by the servers of the Site to your hard drive and can only be read and interpreted by the Site’s servers. No Personal Information is stored in the cookie and there is nothing on it which can identify you personally.\n​\n​\n12.2\nCookies have an important function in how you interact while visiting the Site, ensuring the usability of the Site’s different features, helping the Site understand your preferences, and thus can improve your experience on the Site. If you do not want cookies from the Site, simply adjust the settings in your web browser to disable cookies. This may change the way you access the Site and may also render some of the Site’s features unusable, but of course it is your choice to do so.\n​\n13. Disclosure of Personal Information.\nGolf Collective will NEVER sell or license any Personal Information we collect from you. Golf Collective is not liable for any disclosure of your Personal Information by any third party, particularly the ones outlined in section 4.4 above. By purchasing the services and products offered by Golf Collective, you agree to be bound to and consent to the provisions of our third parties’ privacy policies. In the event that Golf Collective changes its practices, you will be notified and you will be able to opt-out of Golf Collective using your Personal Information by contacting us at\nadmin@golfcollective.com\n.\n14. Choice of Laws and Venue.\nThis Privacy Policy and the use of the Site are governed by the laws of the United States and the State of Florida . The parties agree to irrevocably submit all claims to the exclusive jurisdiction of the courts of the State of Florida . If a dispute arises, we agree to first resolve it through binding arbitration to take place in the State of Florida .\n15. Your Consent.\nBy choosing to provide Golf Collective with your Personal Information you are consenting to its collection, use and disclosure in accordance with the principles outlined in this Privacy Policy. If you are under the age of 18, you must not provide any Personal Information to us without the consent of your parent or guardian, or as otherwise provided for by applicable law.\n16. Protecting Your Privacy.\nGolf Collective is committed to protecting your privacy. Security measures, such as using passwords on servers and computers, and locked cabinets where Personal Information is stored have been adopted to protect your Personal Information against loss or theft, unauthorized access, disclosure, copying, use or modification. Online transactions are completed using third party applications outlined in section 4.4 above. Please refer to the third parties’ privacy policies, of which links have been provided above, for clarification on how your transaction and Personal Information will be handled. Golf Collective makes no promises, warranties or representations about the manner in which your Personal Information is handled by third parties and bears no liability whatsoever for their use of them.\n17. Verifying your Identity.\nGolf Collective will ask you to verify your identity when you contact us  or submit a request regarding your Personal Information. Golf Collective will ask you to provide sufficient information that allows us to reasonably verify that you are the person who we collected Personal Information about.\n18. The Internet Can Be Unreliable.\nThe internet is, by its nature, inherently open and subject to interception of information. We cannot guarantee that the information you provide to Golf Collective over the internet or otherwise will not be intercepted by third parties while it is being communicated by means that are outside of Golf Collective’s control.\n​\n19. Verifying and Amending Your Personal Information.\nGolf Collective tries to ensure that all Personal Information about you that is in our possession is accurate, complete and up-to-date. Please contact us at\nadmin@golfcollective.com\nto advise us of any changes to your Personal Information. You may request access to the Personal Information held by Golf Collective at any time or seek to make corrections to it.\n20. Resolving your concerns.\nIf you have any questions or concerns about Golf Collective's Personal Information collection, use and disclosure practices, please let us know at\nadmin@golfcollective.com\nand we will do our best to help you.\nTERMS AND CONDITIONS\nPlease read the following carefully! Your access to and use of this Site is subject to legally binding terms and conditions which you accept and agree to by accessing this Site.\nThe following terms and conditions (“\nTerms and Conditions\n”) form a binding agreement (this “\nAgreement\n”) between you and Golf Collective, LLC, a  Limited Liability Company  operating out of the State of Florida  (“\nGolf Collective\n”). Golf Collective may modify, amend, supplement and replace these Terms and Conditions at any time without providing you with advance notice. Your continued use of this Site after any change means you have accepted the changed Terms and Conditions.\n1. Copyright.\nAll materials created by Golf Collective on the Site are protected by United States copyright laws as original works. The absence of a registered copyright symbol does not mean that such materials are not protected as belonging to Golf Collective.\n2. Links to Third Party Websites.\nThis Site may contain links to third party websites. All such linked sites, materials and pages are not under the control of Golf Collective and Golf Collective is not responsible for the content contained in any linked website nor for any losses or damages you may incur as a result of the use of any third party website. Golf Collective accepts no liability for any errors or omissions contained in third party websites. These links are provided to improve your use of this Site, enable you to connect with Golf Collective on various platforms, help Golf Collective offer the easiest services for you and conduct transactions.\n​\n3. Use License.\nIf Golf Collective has materials on the Site which you can download, permission is granted to download copies of the materials for personal, non-commercial viewing only. This is the grant of a license, not a transfer of title, and under this license you may not:\n3.1\nmodify or copy the materials;\n​\n3.2\nuse the materials for any commercial purpose or for any public display (commercial or non-commercial);\n​\n3.3\ntransfer the materials to another person or “mirror” the materials on any other server.\nThis license shall automatically terminate if you violate any of these restrictions and may be terminated by Golf Collective at any time. Upon terminating your viewing of these materials or upon the termination of this license, you must destroy any downloaded materials in your possession, whether in electronic or printed format.\n​\n4. Refunds\n. Our refund policy for any of the services or products sold on the Site is as follows:  We will refund the prorated value of the unused portion of the membership.\n​\n5. Disclaimer\n. Our goal is to share information in an informative, open, and honest way. That being said, any information and services provided on or through the Site is for informational and educational purposes only. What we share is the opinion and perspective of Golf Collective.  The information and education is not intended or implied to supplement or replace professional advice. Before taking any action, please make sure you consult with a professional.\n​\n6. No Guarantees\n. We make\nno guarantees\nabout any particular results or benefits that you’ll get from our Site, our products or services. We will do everything to give you the tools to succeed, but we make no guarantees. We cannot be any more clear about this: we make no promises regarding results and make no guarantees whatsoever.\n7. Site Terms of Use Modifications\n. Golf Collective may revise these Terms and Conditions for its Site at any time without notice. By continuing to use the Site after Golf Collective modifies this Agreement, you are agreeing to be bound by the updated version of this Agreement.\n​\n8. Limitation of Liability\n. In no event shall Golf Collective or its affiliates be liable for any damages (including, without limitation, damages for loss of data or profit, or due to business interruption) arising out of the use or inability to view or use the materials or content on the Site, even if Golf Collective has been notified orally or in writing of the possibility of such damage.\n​\n9. Choice of Laws and Venue\n. The parties agree to irrevocably submit all claims relating to Golf Collective’s Site to the exclusive jurisdiction of the courts of the State of Florida  without regard to its conflict of law provisions.\n​\n10. Indemnity\n. As a condition of your use of this Site, you indemnify Golf Collective and its directors and affiliates from and against any and all liabilities, expenses (including legal fees) and damages arising out of claims resulting or arising from your use of this Site.\n11. Entire Agreement\n. These Terms and Conditions and any other legal notices, policies and guidelines of Golf Collective linked to these Terms and Conditions or contained on this Site constitute the entire agreement between you and Golf Collective relating to your use of this Site and supersede any prior understandings or agreements (whether oral or written), claims, representations, and understandings of the parties regarding such subject matter. This Agreement may not be amended or modified except by Golf Collective. If for any reason a court of competent jurisdiction finds any provision or portion of these Terms and Conditions to be unenforceable, that portion or provision shall be enforced to the maximum extent permissible so as to effectuate the intent of the parties as reflected by that provision, and the remainder of these Terms and Conditions shall continue in full force and effect. Failure by Golf Collective to enforce or exercise any provision of these Terms and Conditions shall not constitute a waiver of that right. Paragraph headings are for reference only.\nGOLF COLLECTIVE MEMBERSHIP AGREEMENT\nWelcome to Our Community!\nThe following Studio Membership Agreement (the “\nAgreement\n”) will clearly communicate our expectations in having you as part of our exciting and innovative golf community. If you have any questions please let us know as we want to make sure we are all on the same page moving forward.\nIn exchange for membership access to Golf Collective’s facility and simulators, you agree to be bound by the following conditions.\n​\n1. Parties.\nThis Agreement is made between Golf Collective, LLC, a Limited Liability Company operating out of the State of Florida (“\nGolf Collective\n,” “\nwe\n,” “\nour\n,” and “\nus\n”) and you, the undersigned (electronically) or person who has clicked “I Agree” (or something similar) to this Agreement (“\nyou\n” and “\nyour\n”).\n2. Services.\nWe promise to provide you with access to our studio and the use of our facilities, as well as access to our regularly scheduled classes (either online or in-person) at Golf Collective (the “Membership”), according to the terms of this Agreement, and as outlined in Schedule “A” Memberships below.\n​\n3. Term.\nThis Agreement will be binding upon your Membership payment and will last for the time specified in Schedule “A” Memberships below, as specified online, or as agreed upon between us (the “Term”).\n​\n4. Termination.\nTo terminate this Agreement, please let us know in writing or via email prior to the desired termination date. Any Payments made will not be refunded, unless as specified in the refund policy listed below. Please note that if you violate any of the terms of this Agreement, Golf Collective may terminate this Agreement effective immediately and you will not be entitled to any refunds or any continued working relationship with Golf Collective.\n5. Our Commitment to You.\nThrough your Membership, Golf Collective is committed to providing you with the opportunity and support to have fun, enjoy our state of the art facilities and improve all aspects of your game.\n6. Code of Conduct.\nYou agree to be prudent and respectful while using the simulator and all of the golf equipment in our unsupervised space. We ask you to be mindful when using any equipment to ensure that the next person can enjoy it as well. Most importantly, we ask you to please start and stop on time, as once your session with the simulator has ended, another member's time will begin and we ask you to be punctual and ensure your space is as clean as you found it.\n6.1 No Alcohol.\nPlease note that we are not permitted to have any alcoholic beverages permitted anywhere on the premises. We kindly as you not to bring in any alcohol to our space. In the event we discover you have broken this rule, we reserve the right to terminate your membership effective immediately.\n7. Surveillance.\nAs we have a state of the art facility which is not always supervised, you understand that we will keep cameras recording 24/7 to watch what happens in the facility. We are doing this for your security and safety. If you have any issues with this, please raise it to us before signing this Agreement.\n8. Scheduling.\nPlease consult Golf Collective or refer to our available schedule of classes for the exact scheduling and time of our classes.\n9. Payment.\nYou agree to pay the price, including the possibility of recurring payments (“\nRecurring Payment\n”), of the Membership as outlined below in Schedule “A” (the “\nPayment\n”). All Payments, prices and costs are in USD.\n9.1\nThe Payment price outlined in Schedule “A” is subject to taxes and additional fees. Any subsequent changes to the Payment price will not affect the validity of this Agreement.\n​\n9.2\nPayment is due upon completed purchase of the Membership and must be made in full prior to the start of your Membership.\n10. Fluctuation of Payments.\nYou understand that we reserve the right to change our prices and that in your acceptance of these new prices and continued payment, you continue to be bound to all the terms of this Agreement. We will always provide at least 30 days notice before raising any prices and we will communicate with you to ensure you are aware of any changes.\n11. Cancellation of Membership.\nYou can cancel your Membership at any time, as you like. You will not be refunded for any payments and once you cancel your membership, you will no longer be able to access the facility. Please only cancel once you have used up all of your hours or at the end of the month, so you get the maximum value with us.\n12. Recurring Payments.\nIf your Payment includes Recurring Payments, you authorize Golf Collective to maintain your account information and charge that account automatically upon the renewal of the Membership, or as otherwise specified, with no further action required by you.\n12.1.\nGolf Collective will charge your method of payment as outlined in Schedule “A” for the Recurring Payment. We will notify you seven (7) days before the Payment charge.\n13. Payment Failure.\nIn the event that your Payment fails, your Membership access will be temporarily suspended until we receive your Payment. In the event of three failed payments, you understand that Golf Collective may contract a collection agency to collect the money from you.\n14. Late Cancellation.\nIf you cannot make a session, and cancel with more than 24 hours notice, you will receive a session credit. If you give late notice of cancellation (anything less than 24 hours), you will be considered a no-show and your session will not be rescheduled or refunded. We will handle exceptions on a case by case basis and make all decisions with unilateral and unfettered discretion.\n15. Refunds.\nOur refund policy is as follows: All sales are final. Memberships are non-refundable and non-transferable.\n16. Legal Fees.\nYou will be responsible for any and all legal fees incurred by Golf Collective regarding any potential chargeback issues (for example, if you want to issue a chargeback or contest a payment).\n17. No Guarantees.\nGolf Collective cannot guarantee any particular success from participating in our classes or from our Membership. We promise to provide you with the opportunity, classes and support to achieve your goals, but any success and results ultimately depends on your commitment.\n17.1\nGolf Collective also cannot guarantee that all of your actions during your Membership will be supervised. This Agreement to receive a Membership and related services does not include any express or implied guarantee of supervision.\n18. Studio Closure.\nIf our studio and facilities are forced to close due to COVID-19, a natural disaster, or other unavoidable circumstance, the Membership continues with online content.\n19. Force Majeure.\nGolf Collective will not be liable for any failure or delay regarding the Membership if such failure or delay is: beyond the reasonable control of Golf Collective, could not have been reasonably foreseen or provided against, or due to events such as a pandemic, natural disaster, or other Act of God. In such an event, you will not be entitled to any refunds or recovery.\n20. Substitute Services.\nGolf Collective has the right to substitute services. This means that if we ever need to switch to online classes or asynchronous virtual offerings due to circumstances beyond our control, we have the right to such a substitution for in person classes.\n​\n21. Waiver +  Guest Waiver Sign.\nBefore your Membership can begin, you must sign our Waiver Agreement form.\nPlease read it and make sure you understand it. You need to sign that form as well as this Agreement so that we can be absolutely sure you understand and agree to it.\nFurther, you understand that if you bring any guests into our facility, it is\nyour responsibility to ensure they sign a Waiver\n. You may provide your guests with the link to the waiver found in the reservation confirmation email. There will be iPads placed at the entrance to the facility for your guests to sign before they may enter.\n21.1.\nIf we discover you bring a guest who does not sign a Waiver, that will serve as a breach of this Agreement and we can terminate your membership without any refund. Please let us know if you have any questions.\n​\n22. Indemnity.\nYou hereby fully indemnify Golf Collective, LLC and any of its members, directors, officers, employees, contractors, volunteers, agents, executors, administrators, successors, family members and assigns (the “\nReleased Parties\n”) from any liability and damages arising from death, personal injuries or loss/damage to personal property to your or any guests who you may bring to the facility.\n23. Standard Legal Things. Choice of Laws and Venue.\nThis Agreement will be governed exclusively by the laws of the State of Florida. The parties agree to irrevocably submit all claims to the exclusive jurisdiction of the courts of the State of Florida.\nSeverability.\nIf any provisions of this Agreement are invalid or unenforceable, the other provisions in the Agreement will remain in full force and effect.\nEntire Agreement.\nThis Agreement constitutes the entire Agreement between the parties and replaces any prior agreements.\nWaiver of Breach.\nThe waiver by Golf Collective of any breach by you of any provision of this Agreement will not be taken to be a waiver of any further breaches by you.\nCounterparts.\nThis Agreement may be signed by any number of counterparts, each of which is an original, and all of which taken together constitute one single document.\nOnline Agreement.\nWe agree that this Agreement may be signed electronically or agreed to by having you click “I Agree”  (or something similar), the effect of which will be the same as if we signed the Agreement by hand and the intention of which is that both parties desire to be bound by all the terms of the Agreement.\n​\nSCHEDULE “A” MEMBERSHIPS\nBronze Membership\nCost: USD $197\nRenewal: Monthly\nDetails:\nDaily 1-hour reservations\nReserve 7-days in advance\nAccess from 6 AM - 10 PM daily\n1 authorized user\n​\nSilver Membership\nCost: USD $240\nRenewal: Monthly\nDetails:\nDaily 1-hour reservations\nReserve 14-days in advance\nReserve 2-hours two times per month\nAccess from 6 AM - 10 PM daily\n1 authorized user\n​\nGold Membership\nCost: USD $350\nRenewal: Monthly\nDetails:\nDaily 1-hour reservations\nReserve 21-days in advance\nReserve 2-hours two times per month\nReserve 3-hours two times per month\nAccess from 6 AM - 10 PM daily\n1 authorized user\n​\nWAIVE\nR AND RELEASE OF LIABILITY\n​\nAll participants must agree to the waiver and release of liability.\n​\nWelcome! Before participating in Golf Collective’s services, we need you to thoroughly read, understand, and agree to this Waiver and Release of Liability (the “\nWaiver\n”). The purpose of this Waiver is to clearly communicate some risks of participating with us, and to have you release Golf Collective of any liability if you get injured or if any of your things are lost, stolen or broken, or if anything else goes wrong while you are enjoying our facility. Please be aware that if you do not sign this Waiver and agree to its terms, you will not be permitted to use our golf simulators or facilities.\n​\nIf you are a minor in the State of Florida (under 18 years old) or in your place of residence, your legal guardian must also sign this Waiver on your behalf.\n​\nPLEASE READ CAREFULLY TO MAKE SURE YOU UNDERSTAND THIS WAIVER.\nPLEASE ASK QUESTIONS IF ANYTHING IS UNCLEAR. WE ARE HERE TO SUPPORT YOU. BY SIGNING THIS YOU AGREE YOU ARE SIGNING AWAY YOUR LEGAL RIGHTS TO SUE, AND YOU AGREE TO BE BOUND BY ALL THE TERMS OF THIS WAIVER.\n​\n1. Parties.\nWe are Golf Collective, LLC, a Limited Liability Company based in the State of Florida. In this Waiver, we will refer to ourselves as “\nGolf Collective\n,” “\nus\n,” “\nwe\n,”  and “\nour\n.” We’ll refer to you, the undersigned (electronically or by hand), or the person who has clicked “I Agree” (or something similar) to this Waiver, as “\nyou\n” or “\nyour\n.”\n​\n2. The Activities.\nAs part of your services with Golf Collective, you may participate, in person or online, in engaging and innovative golf simulator activities, events, workshops and more, all of which may involve but are not limited to the following (“\nActivities\n”)\n​\n2.1 Anything and everything related to golf, playing golf on a screen simulator and utilizing golf movements. This includes but is not limited to: dynamic lateral movements, flexibility training, body weight movement, locomotor movements, mobility, range of motion movement, and breathing.\n​\n2.2 The Activities involve playing golf indoors with a screen simulator. This means that you will be swinging golf clubs and hitting golf clubs indoors either by yourself or around other people.\n​\n2.3 All Activities are entirely unsupervised, which means that you need to be especially careful to mind your own personal space and always be aware and careful of what is going on around you.\n​\n3. Equipment.\nIn the course of the Activities, you may use a variety of equipment, which could include but is not limited to: golf clubs, golf balls and simulator screens to play your round on (the “\nEquipment\n”). Please do not use any equipment not instructed by Golf Collective.\n​\n4. Inherent Risks.\nYou understand that participation in the Activities may pose inherent risks, some more serious than others. These risks can result in serious harm and injuries that could change your quality of life, your ability to earn an income and, in very rare and extreme circumstances, could even result in death.\n​\n4.1\nRisks of physical injury may include but are not limited to things like muscle tears, strains, and other musculoskeletal injuries, sprains, fractures, broken bones, cardiovascular complications, high blood pressure, dehydration, dizziness, fainting, concussion, concussion like syndromes, PTSD.\n​\n4.2\nThere is a real and serious risk of getting hit with a golf ball or a golf club, whether it be from your swing and your group or another group around you.\n​\n4.3\nThere are increased risks posed by participating in the Activities, as there is no in-person supervision or space provided for you. You will therefore need to ensure the safety of the Activities, using your judgment on how to best practice them, not acting inappropriately or attempting anything you feel unsure of doing.\n​\n4.4\nWe would like to emphasize that your release of our liability is not limited in any way to these risks. The risks listed above are only examples. To be completely clear, you are agreeing not to sue us at all.\n​\n5. Affirmation of Health.\nBy participating in any Activities with Golf Collective, you affirm that you have sought medical advice regarding your fitness or are certain of your ability to engage in the Activities.\nIf you have any pre-existing medical conditions (e.g. asthma, diabetes, heart disease), physical injuries, weakness, are pregnant, post-natal or post-surgery, you should consult with your doctor first before engaging in the Activities.\nPlease communicate and inform us IMMEDIATELY if at any point you do not feel well during the Activities.\n​\n6. Voluntary Assumption of Risk.\nYou certify that you have read this Waiver and understand the risks of participating in the Activities with Golf Collective. By signing this Waiver or clicking “I Agree” (or something similar), you are showing your voluntary engagement and assumption of the risks of the Activities.\n​\n7. Lost or Stolen Personal Items.\nYou agree that it is solely your responsibility to safeguard your personal items, and Golf Collective is in no way responsible for any of your personal property that is damaged, lost, or stolen before, during, or after your participation in the Activities.\n​\n8. Release, Waiver and Indemnity.\nYou hereby release, hold harmless, indemnify and waive any claims against Golf Collective, LLC and its members, owners, directors, officers, contractors, employees, affiliates, volunteers, associates, landlords, agents, executors, administrators, successors, family members and assigns (the “\nReleased Parties\n”) with respect to any and all liability and damages incurred during, or in any way associated with, your participation in the Activities with Golf Collective, however caused,\nincluding as a result of the\nReleased Parties’\nnegligence\n, including but not limited to damage to or loss of personal property, personal injuries, death, illness, or any cause of action related to premises liability. You are releasing the Released Parties at your own risk and you agree to forfeit any and all forms of legal recourse which may be available to you, including but not limited to any form of damages, as a result of your participation in the Activities. You agree that this provision applies to you, your family, heirs, executors or anyone else who may be able to bring a legal action on your behalf in the future.\n​\n9. Continued Agreement.\nAgreement to this Waiver will act as your continued agreement to all ensuing Activities and any further interactions with Golf Collective, whether in person, online, or via video conferencing tool.\n​\n10. General Legal Provisions.\nChoice of Laws and Venue. This Waiver will be governed exclusively by the laws of the State of Florida. The parties agree to irrevocably submit all claims to the exclusive jurisdiction of the courts of the State of Florida.\nSeverability\n. If any terms or provisions of this Waiver are invalid or unenforceable, the other provisions in the Waiver will remain in full force and effect.\nEntire Agreement\n. This Waiver constitutes the entire agreement between the parties and replaces any prior agreements.\nOnline Agreement\n. The parties agree that this Waiver may be signed electronically or agreed to by having you click “I Agree” (or something similar), the effect of which will be the same as signing by hand.",
      "emails": [
        "18d2f96d279149989b95faf0a4b41882@sentry-next.wixpress.com",
        "2062d0a4929b45348643784b5cb39c36@sentry.wixpress.com",
        "271e9fa3230b4eec94b02bf95780f5f2@sentry.wixpress.com",
        "460ff4620fa44cba8df530afde949785@sentry.wixpress.com",
        "5d1795a2db124a268f1e1bd88f503500@sentry.wixpress.com",
        "605a7baede844d278b89dc95ae0a9123@sentry-next.wixpress.com",
        "88170cb0c9d64f94b5821ca7fd2d55a4@sentry-next.wixpress.com",
        "8c4075d5481d476e945486754f783364@sentry.io",
        "8eb368c655b84e029ed79ad7a5c1718e@sentry.wixpress.com",
        "98b21aa53d68482b8414e892d9af0e5f@sentry-next.wixpress.com",
        "9a65e97ebe8141fca0c4fd686f70996b@sentry.wixpress.com",
        "admin@golfcollective.com",
        "c183baa23371454f99f417f6616b724d@sentry.wixpress.com",
        "dd0a55ccb8124b9c9d938e3acf41f8aa@sentry.wixpress.com",
        "ed436f5053144538958ad06a5005e99a@sentry.wixpress.com",
        "f36cc48fb72b4d298c835f2793cf3b84@sentry-next.wixpress.com"
      ]
    }
  ],
  "all_links": [
    "https://www.golfcollective.com/faq",
    "https://www.golfcollective.com/terms-and-conditions",
    "https://www.golfcollective.com/policies",
    "https://www.golfcollective.com/blog",
    "https://www.golfcollective.com"
  ],
  "candidate_links": [
    "https://www.golfcollective.com/terms-and-conditions"
  ],
  "visited": [
    "https://www.golfcollective.com/?utm_source=google&utm_medium=wix_google_business_profile&utm_campaign=2436683530975558323",
    "https://www.golfcollective.com/about",
    "https://www.golfcollective.com/contact",
    "https://www.golfcollective.com/staff",
    "https://www.golfcollective.com/team",
    "https://www.golfcollective.com/board",
    "https://www.golfcollective.com/directory",
    "https://www.golfcollective.com/events",
    "https://www.golfcollective.com/sitemap.xml",
    "https://www.golfcollective.com/council",
    "https://www.golfcollective.com/leadership",
    "https://www.golfcollective.com/management",
    "https://www.golfcollective.com/producers",
    "https://www.golfcollective.com/support",
    "https://www.golfcollective.com/crew",
    "https://www.golfcollective.com/members",
    "https://www.golfcollective.com/bios",
    "https://www.golfcollective.com/people",
    "https://www.golfcollective.com/artists",
    "https://www.golfcollective.com/musicians",
    "https://www.golfcollective.com/faculty",
    "https://www.golfcollective.com/administration",
    "https://www.golfcollective.com/terms-and-conditions"
  ],
  "base_url": "https://www.golfcollective.com/?utm_source=google&utm_medium=wix_google_business_profile&utm_campaign=2436683530975558323"
}