{
  "pages": [
    {
      "url": "https://www.golfarcadia.com/events",
      "is_candidate": false,
      "has_email": false,
      "text": "HOME\nRATES\nCLINICS / LESSONS\nRANGE\nEVENTS\nSTAFF\nBANQUET ROOM RENTAL\nJUNIOR GOLF\nHOME\nRATES\nCLINICS / LESSONS\nRANGE\nEVENTS\nSTAFF\nBANQUET ROOM RENTAL\nJUNIOR GOLF\nMore\nHOME\nRATES\nCLINICS / LESSONS\nRANGE\nEVENTS\nSTAFF\nBANQUET ROOM RENTAL\nJUNIOR GOLF\nHOME\nRATES\nCLINICS / LESSONS\nRANGE\nEVENTS\nSTAFF\nBANQUET ROOM RENTAL\nJUNIOR GOLF\nCOMING EVENTS\njune\nJune 16-20, 2025\nJunior Summer Camp\n8am\n-\n12:00pm\nArcadia Golf Course\nEvent Details\nJune 16-20, 2025\nJunior Summer Camp\nGolf instruction, fun activities and golf course play! $250 for individual, $200 per child if registering as two or more.\n8am\n-\n12:00pm\nArcadia Golf Course\nCopyright © 2025 Arcadia Municipal Golf Course - All Rights Reserved.\nHOME\nRATES\nCLINICS / LESSONS\nRANGE\nEVENTS\nSTAFF\nBANQUET ROOM RENTAL\nJUNIOR GOLF\nPowered by",
      "emails": []
    },
    {
      "url": "https://www.golfarcadia.com/staff",
      "is_candidate": false,
      "has_email": false,
      "text": "HOME\nRATES\nCLINICS / LESSONS\nRANGE\nEVENTS\nSTAFF\nBANQUET ROOM RENTAL\nJUNIOR GOLF\nHOME\nRATES\nCLINICS / LESSONS\nRANGE\nEVENTS\nSTAFF\nBANQUET ROOM RENTAL\nJUNIOR GOLF\nMore\nHOME\nRATES\nCLINICS / LESSONS\nRANGE\nEVENTS\nSTAFF\nBANQUET ROOM RENTAL\nJUNIOR GOLF\nHOME\nRATES\nCLINICS / LESSONS\nRANGE\nEVENTS\nSTAFF\nBANQUET ROOM RENTAL\nJUNIOR GOLF\nDirector of Golf,  Jeff Gibson, PGA\nJeff Gibson was born in Houston, Texas and raised outside of the Dallas-Ft. Worth area in Colleyville, Texas.  When he was about 14 years old, his father, who worked for General Electric, was transferred to Tampa.  The family settled in Temple Terrace, which is on the Northeast side of Tampa.\nTemple Terrace was a hot bed of golf in the 1960s, probably producing more great and near great players than any community in the country.  While attending King High School there, Jeff played football his sophomore and senior years and golf the entire time he attended King.  His sophomore year, the golf team at King was called the greatest high school team ever by Sports Illustrated.  Jeff qualified with an average 9-hole score of 38.5 and was the 8th man on the team.  PGA stars Gary Koch and Eddie Pierce anchored the team, along with Philip Reed and Brian Hawke.  The level of play at Temple Terrace was so high that failing to win a State Championship in 1971, after two straight years of being number one in the State, was considered failure.\nJeff attended Pensacola Junior College on a golf scholarship and played for two years.  He then worked for a number of years before returning to the game, playing and teaching.  Although never able to play on the PGA Tour, Jeff did compete in Mini-Tour events across the SE United States, as well as in PGA Club Pro events.  Jeff won the 2005 NFPGA Senior Match Play Championship and reached the final 36-hole Sectional Qualifier for the US Open twice.\nAlong the way, Jeff became one of the most noted golf instructors in West Florida, owning and operating Gibson Golf Academy.  His students competed Nationally in the US Amateur, US Open, US Junior Boys and Junior Girls, US Publinks, and the Florida, Georgia, Texas and Connecticut State High School Championships. Jeff also worked for the University of South Florida, Tampa, as an Adjunct Instructor teaching golf for the University.\nJeff is married to Deedra Griffith Gibson, who works at the University of South Florida, Tampa.  Deedra is a native-born Floridian. They have two children, Patrick and Kelsey Whitmer.  Kelsey is married to Jeremy Whitmer of Brooksville.  Jeff and Deedra have three grandchildren, all girls.  Jeff‘s mother, Jannie Wylie Gibson, still lives in Temple Terrace.\nIn his spare time, Jeff enjoys reading, playing his guitar, fishing and some hunting.  Jeff still loves to play golf.\nAnn applegate, operations manager\nAnn was raised in East Central Indiana, the next to youngest of a combined family consisting of 12 children.  Ann lost her father while a senior in high school and went to work shortly thereafter.\nAnn moved to Northern Indiana, where her parents had a summer cottage on a small lake chain. There she began working in the office of a local construction company.  Ann married the owner of that company about 9 years later and continued to assist her husband with the construction business.  When the construction business declined in the area, they decided to move into Handyman Services rather than continue to build houses.\nThey began to winter in Florida in the early 1990's, closing the business until they returned in the spring. When business slowed, Ann took a job as office manager for a seasonal campground in Northeast Indiana. To stay busy while wintering in Arcadia, Ann took a part-time seasonal position at the golf course and also managed the office of the small mobile home park where they wintered. They continued to travel back to Indiana in the spring and return to Arcadia in the fall until his death in 2017.\nIn the spring of 2017, Ann moved to Arcadia as a permanent resident and began working full time for the golf course.  Ann was promoted to Operations Manager shortly after Jeff Gibson became Director of Golf, in 2018.\nWhile Ann does not play golf, she has learned a lot about the game.\nAnn loves to read, crocheting. and needlepoint\nCopyright © 2025 Arcadia Municipal Golf Course - All Rights Reserved.\nHOME\nRATES\nCLINICS / LESSONS\nRANGE\nEVENTS\nSTAFF\nBANQUET ROOM RENTAL\nJUNIOR GOLF\nPowered by",
      "emails": []
    }
  ],
  "all_links": [
    "https://www.golfarcadia.com/junior-golf",
    "https://www.golfarcadia.com/range",
    "https://www.golfarcadia.com/rates",
    "https://www.golfarcadia.com/home",
    "https://www.golfarcadia.com/banquet-room-rental",
    "https://www.golfarcadia.com/clinics-%2F-lessons",
    "https://www.golfarcadia.com/events",
    "https://www.golfarcadia.com/staff"
  ],
  "candidate_links": [
    "https://www.golfarcadia.com/events",
    "https://www.golfarcadia.com/staff"
  ],
  "visited": [
    "https://www.golfarcadia.com/",
    "https://www.golfarcadia.com/about",
    "https://www.golfarcadia.com/contact",
    "https://www.golfarcadia.com/staff",
    "https://www.golfarcadia.com/team",
    "https://www.golfarcadia.com/board",
    "https://www.golfarcadia.com/directory",
    "https://www.golfarcadia.com/events",
    "https://www.golfarcadia.com/sitemap.xml",
    "https://www.golfarcadia.com/council",
    "https://www.golfarcadia.com/leadership",
    "https://www.golfarcadia.com/management",
    "https://www.golfarcadia.com/producers",
    "https://www.golfarcadia.com/support",
    "https://www.golfarcadia.com/crew",
    "https://www.golfarcadia.com/members",
    "https://www.golfarcadia.com/bios",
    "https://www.golfarcadia.com/people",
    "https://www.golfarcadia.com/artists",
    "https://www.golfarcadia.com/musicians",
    "https://www.golfarcadia.com/faculty",
    "https://www.golfarcadia.com/administration",
    "https://www.golfarcadia.com/events",
    "https://www.golfarcadia.com/staff"
  ],
  "base_url": "https://www.golfarcadia.com/"
}