{
  "pages": [
    {
      "url": "https://golfusion.com/team/",
      "is_candidate": false,
      "has_email": true,
      "text": "Expert Team\nGolfusion's\nperformance coaching is grounded in the pursuit of producing effective results through optimal efficiency. With this in mind, we have taken great care to consolidate a highly motivated and skilled team.\nDylan Ross\nPGA\nFounder / Director Of Player Development\nDylan’s upbringing in Scotland paved the way for his journey in the world of golf.\nMore About Dylan\nDylan’s upbringing in Scotland paved the way for his journey in the world of golf. He holds the prestigious title of a Class “A” member of The Professional Golfers’ Association of Great Britain & Ireland. His PGA training took place at the historic Royal Aberdeen Golf Club, which is the sixth oldest golf course in the world. He not only graduated with ‘Distinction’ but also clinched their highly esteemed ‘National Scholarship’ during his time there.\nAfter competing on the Mexican PGA and South American Tours, Dylan discovered his true calling in teaching and coaching. He went on to impart his expertise at some of Mexico’s most renowned golf clubs. The Mexican Golf Federation recognized his skills and appointed Dylan as their National Coach, a position he held for a remarkable 8 years.\nDylan’s dedication to coaching led him to attain some of the industry’s most sought-after certifications, further enhancing his teaching abilities. In 2015, he reached the esteemed status of ‘Master Teacher,’ which is the highest honor an instructor can receive from U.S. Kids Golf. Remarkably, he became the first PGA Professional from Europe to earn this distinction.\nSince establishing Dylan Ross Golf in 2008, he has been actively involved in training golf players of all skill levels. He has introduced hundreds of newcomers to the game and has also played a pivotal role in supporting multiple tour professionals in achieving their dreams. In recognition of his outstanding contributions to the field of golf, The PGA awarded him the distinguished title of an ‘Advanced Fellow’ member in 2018.\nKai Fusser\nM.S.\nGolf Fitness Specialist\nKai’s journey in professional sports began as both a competitor and, later, as a coach and trainer.\nMore About Kai\nKai, originally hailing from Germany, possesses a master’s degree in Nautical Engineering from the University of Oldenburg in Germany. His journey in professional sports began as both a competitor and, later, as a coach and trainer.\nKai’s innovative workout philosophy was instrumental in training one of the greatest athletes to ever grace the game, Annika Sorenstam. Under his guidance, Annika achieved an astounding 72 wins worldwide, including 10 major championships. In addition to Annika’s success, golfers under Kai’s tutelage have secured a total of 15 Major Championships and over 150 tournament victories across the LPGA, PGA, European Tour, and Japanese LPGA.\nKai’s expertise extends beyond physical training. He is a certified facilitator for the Pacific Institute’s Investment in Excellence course, which focuses on developing the right attitude for success through cognitive psychology. Kai is a sought-after speaker and educator, frequently invited to share his program with organizations such as the LPGA, German PGA, and various universities and expert summits.\nHis contributions to the world of golf and fitness have garnered media attention, with features in prominent outlets such as Golf Magazine, Golf World, Japanese Golf Digest, German Golf Journal, Golf Fitness Magazine, Waterski Magazine, ESPN, USA Today, 60 Minutes, Golf Channel, and more.\nKai is also a published author, with notable works including “Weight Training for Golf: The Ultimate Guide” and “Weight Training for Women’s Golf,” both considered comprehensive resources for golf fitness. Furthermore, he has produced the highly acclaimed “Kai Fitness for Golf” series, which has garnered significant popularity among golf enthusiasts.\nBrian Paxton\nPT\nRehabilitation and Performance Therapy\nDr. Brian Paxton, a South Georgia native, brings over 23 years of experience in golf rehabilitation and performance training, blending revolutionary techniques from across the globe into a truly unique approach.\nMore About Brian\nDr. Brian Paxton, a South Georgia native, brings over 23 years of experience in golf rehabilitation and performance training, blending revolutionary techniques from across the globe into a truly unique approach. His expertise has supported athletes at the highest levels, including those on the PGA, LPGA, Korn Ferry, NFL, and USTA/WTA tours. Dr. Paxton’s approach is grounded in a deep understanding of biomechanics, human movement, and injury recovery, enabling him to offer personalized treatments that optimize both performance and recovery.\nDr. Paxton has an extensive background in advanced techniques such as Stecco fascial Manipulation, Active Release Techniques, the Fascial Distortion Method, Vojta Therapy, Dynamic Neuromuscular Stabilization (DNS), and methods from the Postural Restoration Institute, among many others. These diverse, cutting-edge treatment methods, combined with his certifications in TPI Medical 2 and TPI Fitness 2, allow him to approach each client’s needs with a multifaceted, tailored solution that is truly unparalleled.\nDr. Paxton also underwent a two-year mentorship under Tom Boers, known as the “Spine Savior” of the PGA Tour, which helped him refine his manual therapy skills and performance rehabilitation techniques. This mentorship, along with his global training, has equipped Dr. Paxton with an eclectic toolkit of techniques to address and optimize performance for clients in ways that traditional therapies cannot.\nAt Golfusion, Dr. Paxton’s individualized treatments are designed to elevate your game, enhance your movement, and help you recover more effectively. Whether you’re a professional athlete or someone looking to improve your functional movement and well-being, Dr. Paxton’s unique expertise will take your performance to the next level.\nJoaquin Lolas\nPerformance Golf Coach\nJoaquin was among the highly talented junior golfers recruited by Florida State on a full scholarship.\nMore About Joaquin\nJoaquin, originally from Lima, Peru, was among the highly talented junior golfers recruited by Florida State on a full scholarship. Notably, the team also included major winner Brooks Koepka and multiple Tour winner Daniel Berger as its members. Prior to embarking on his professional career, Joaquin achieved victory in the Mexican International Championship. He also competed in multiple seasons on the PGA Tour Latino-America, accumulating an impressive total of 15 international wins over a six-year period, with his lowest competitive round being an impressive 64.\nCurrently, Joaquin is dedicated to sharing his extensive knowledge of the game with fellow golf enthusiasts. He holds a TPI Certification and, for the past five years, has delved into the realms of neuroscience and EQ performance as they relate to golf. His commitment in this area has earned him the GYRA Golf Certification.\nDrishti Karumbaya\nGolf Coach\nDrishti is an NCAA All-American and a coach helping golfers grow their game from the inside out.\nMore About Drishti\nDrishti Karumbaya is a Golfusion Coach with a unique blend of international experience, collegiate success, and a passion for player development. Born in Mysuru, India, Drishti quickly climbed the junior ranks, earning national recognition and multiple wins before heading to the U.S. for college golf.\nA two-time WGCA All-American and former team captain at Cal State East Bay, she recorded 11 top-five finishes, including two tournament victories, and was nominated for the 2023 NCAA Woman of the Year in recognition of her achievements on and off the course. She now serves as Assistant Coach for the women’s golf team at Palm Beach Atlantic University, where she supports players through technical training, strategic coaching, and academic mentorship.\nAt Golfusion West Palm Beach, Drishti brings her energy, insight, and love for the game to every session. Certified in Vision54 Mental Performance and R&A Rules Refereeing, she helps golfers of all levels grow their skills, strengthen their mindset, and rediscover the joy of the game.\nTina Fusser\nHolistic Health Coach\nTina is an inspiring, passionate and sought-after fitness and health leader, expert, and coach.\nMore About Tina\nTina is an inspiring, passionate and sought-after fitness and health leader, expert, and coach for over 25 years. Tina’s mission to guide others to a deeper understanding of healthy living and balance comes from deep within. As a former competitive athlete, Tina truly understands the importance of continually exploring proven new ways and techniques in the world of health and fitness.\nUnique in the health and wellness industry, Tina’s extensive and empowering wellness solutions range from helping others reach a greater fitness level, improving mobility for daily life and incorporating natural solutions for a more balanced life. Besides golf specific strength training and mobility; yoga, breathwork, and meditation for golf are offered. Her greatest joy is to see her clients get results.\nTina is one of very few coaches in the US who holds a wide and unique range of health and fitness certifications including TPI, personal training, group fitness, cycling, CrossFit, mobility, yoga, and meditation. She’s also a nutrition coach, essential oils expert, and certified forest therapy guide.\nLou Zenteno\nMBA, MPhil\nCo-founder / Managing Partner\nLou’s work blends wisdom traditions, rigorous science, organization and management.\nMore About Lou\nLourdes is a systems thinker, an innovative and integrative professional, and above all, a purpose-driven strategist. She is actively curious about systems design, transformative experiences, as well as collaborative and collective intelligence processes that moves individuals and groups towards flourishing. Her guiding principles are light, love, and life.\nHer work blends wisdom traditions, rigorous science, and organizational and management frameworks.\nHer studies includes Systems and Industrial Engineering with a major in Quality (Black Belt Six Sigma); an MBA from Grenoble Ècole de Management, France, and a M. Phil. in Ecosynomics from the Institute for Strategic Clarity, USA.\nBook a Tour\nBook Your Assessment",
      "emails": [
        "info@golfusion.com"
      ]
    },
    {
      "url": "https://golfusion.com/gf-loop-play/",
      "is_candidate": false,
      "has_email": true,
      "text": "Play\nReinforce confidence\nFollowing an improvement in skillset development, it is time to simulate peak performance in a playing environment. Our goal is to instill confidence that the changes made are fully synthesized, enabling you to handle pressure and consistently achieve lower scores.\nWhat We Offer\nGolf Trips\nGolfusion have built over the years a unique collaboration with Bonnie Wee Golf. They are a Scottish based company that offer a fully customized experience from the courses you play, transportation, accommodation, and so much more. You just relax and let their tour manager an expert in hospitality, take care of your every need. After taking students over to play some of the finest courses, with over 600 in Scotland and more than 400 in Ireland, every time our golfers can’t wait to return.\nHost a Group\nBring together friends, family, or colleagues for a group golf outing. We help organize everything from tee times to catering, creating an event that’s enjoyable for everyone, regardless of their golfing experience. Perfect for team-building events, celebrations, and friendly competitions.\nTournaments\nChallenge yourself and other and test your skills in a competitive setting with our tournaments. Whether you're aiming for glory or just a fun day on the greens, our tournaments provide the perfect environment for golfers of all skill levels to enjoy and compete.\nSpecial Events\nMake your next gathering unforgettable with a golf-centered special event. From corporate retreats to milestone celebrations, Golfusion offers unique experiences on and off the course, complete with professional coordination to ensure every detail aligns with your vision.\nGet More Info\nLearn\nTrain\nPlay\nRecover",
      "emails": [
        "info@golfusion.com"
      ]
    }
  ],
  "all_links": [
    "https://golfusion.com/gf-loop-recover/",
    "https://golfusion.com/team/",
    "https://golfusion.com/cognitive-performance/",
    "https://golfusion.com/initial-assessment/",
    "https://golfusion.com/gf-loop-learn/",
    "https://golfusion.com/gf-loop-play/",
    "https://golfusion.com",
    "https://golfusion.com/",
    "https://golfusion.com/our-tools/",
    "https://golfusion.com/initial-assessment",
    "https://golfusion.com/holistic-coaching/",
    "https://golfusion.com/gf-loop-train/"
  ],
  "candidate_links": [
    "https://golfusion.com/team/",
    "https://golfusion.com/gf-loop-play/"
  ],
  "visited": [
    "https://golfusion.com/",
    "https://golfusion.com/about",
    "https://golfusion.com/contact",
    "https://golfusion.com/staff",
    "https://golfusion.com/team",
    "https://golfusion.com/board",
    "https://golfusion.com/directory",
    "https://golfusion.com/events",
    "https://golfusion.com/sitemap.xml",
    "https://golfusion.com/council",
    "https://golfusion.com/leadership",
    "https://golfusion.com/management",
    "https://golfusion.com/producers",
    "https://golfusion.com/support",
    "https://golfusion.com/crew",
    "https://golfusion.com/members",
    "https://golfusion.com/bios",
    "https://golfusion.com/people",
    "https://golfusion.com/artists",
    "https://golfusion.com/musicians",
    "https://golfusion.com/faculty",
    "https://golfusion.com/administration",
    "https://golfusion.com/team/",
    "https://golfusion.com/gf-loop-play/"
  ],
  "base_url": "https://golfusion.com/"
}