{
  "pages": [
    {
      "url": "http://www.graffitiamericanburgerbar.com/contact-our-restaurant",
      "is_candidate": false,
      "has_email": true,
      "text": "========= Site Content =========\nReview Us On Google!\nView Our Specials\n904-372-9985\nHome\nAbout\nMenu\nSpecials\nOrder Online\nContact\nCareers\nGallery\nPage title is hidden in css for new responsive sites. It is left here only so we don't break old sites. Don't copy it to new layouts\nContact\nnavigation placeholders\nHere to Help! Contact Graffiti AMerican Burger BAr in Jacksonville BEach, FL\nContact Us\nFirst Name\nLast Name\nEmail\nPhone\nMessage\nThank you for contacting us.\nWe will get back to you as soon as possible.\nOops, there was an error sending your message.\nPlease try again later.\nYou can count on us for amazing food – call now at\n904-372-9985\n.\nHome\nAbout\nMenu\nSpecials\nOrder Online\nContact\nCareers\nGallery\nPhone:\n904-372-9985\nAddress :   265 5\nth\nAve N,\n﻿\nJacksonville Beach, FL 32250\nContact Information\nBUSINESS HOURS\nMon - Sun\n11:00 am\n-\n11:00 pm\nHappy Hour:\nMon - Fri 2:00 pm - 6:00 pm\nHalf Priced:\nWine\nWell Drinks\nDomestic Draft Beer\nContent, including images, displayed on this website is protected by copyright laws. Downloading, republication, retransmission or reproduction of content on this website is strictly prohibited.\nTerms of Use\n|\nPrivacy Policy\nAdd full CSS and Javascript before the close tag of the body if needed\n========= JS Section =========\nLoad jQuery\nEnd Load jQuery\nInjecting site-wide before scripts\nEnd Injecting site-wide to the head\nHEAD RT JS Include\nEnd of HEAD RT JS Include\nphotoswipe markup\nRoot element of PhotoSwipe. Must have class pswp.\nBackground of PhotoSwipe. \n         It's a separate element as animating opacity is faster than rgba().\nSlides wrapper with overflow:hidden.\nContainer that holds slides. \n            PhotoSwipe keeps only 3 of them in the DOM to save memory.\n            Don't modify these 3 pswp__item elements, data is added later on.\nDefault (PhotoSwipeUI_Default) interface on top of sliding area. Can be changed.\nControls are self-explanatory. Order can be changed.\nPreloader demo http://codepen.io/dimsemenov/pen/yyBWoR\nelement will get class pswp__preloader--active when preloader is running\nAlias: f12d045c\nShare by:\nEnd Script tags\nBegin Body End Markup\nEnd Body End Markup\nSite Wide Html Markup\nSite Wide Html Markup\nBegin Product Custom HTML Markup\nEnd Product Custom HTML Markup",
      "emails": [
        "your@email.com"
      ]
    },
    {
      "url": "http://www.graffitiamericanburgerbar.com/about-our-restaurant",
      "is_candidate": false,
      "has_email": true,
      "text": "========= Site Content =========\nReview Us On Google!\nView Our Specials\n904-372-9985\nHome\nAbout\nMenu\nSpecials\nOrder Online\nContact\nCareers\nGallery\nPage title is hidden in css for new responsive sites. It is left here only so we don't break old sites. Don't copy it to new layouts\nAbout\nnavigation placeholders\nOur Story: Graffiti American Burger BAr in Jacksonville Beach, FL\nWelcome to Graffiti American Burger Bar! We serve 100% Angus Beef Burgers that are hormone and antibiotic-free, with just about any topping you could want! Our menu selections range from award-winning Wings, Flatbread, and Wraps to scrumptious Salads and killer Zucchini Fries!\nKick back in our casual neighborhood setting, full-service bar, and receive friendly service from our all-star staff. Enjoy the hand-painted graffiti on the walls and tables by local artists. Bring your family, co-workers, date, private parties, heck, even bring your dog (on the patio). Watch the big game on our multiple high-def TVs, or turn up your favorite tunes. At Graffiti American Burger Bar, we keep things simple. ~More gratitude and less attitude~ Good friends, good times, and great food!\nFrequently Asked Questions\nWhere can I find a Graffiti American Burger Bar\n265 5th Avenue N,\nJacksonville Beach, FL 32250\nLocated 3 blocks from the beach\nI want to start working at Graffiti American Burger Bar. How do I do so?\nWe’re glad you want to be part of our team! Please come fill out our application form in person or on our Careers page.\nWhat kind of food do you serve?\nWe only serve the best food in town. Whether you’re in for our famous fresh Burgers or our killer Zucchini Fries – we’re the place for you. Take a look at our full menu.\nDoes Graffiti American Burger Bar support any charities?\nWe believe in giving back to the surrounding community. Reach out to our General Manager to get involved\nI want to keep up with Graffiti American Burger Bar!\nIf you want to keep up with us and learn about our new locations and specials, follow us on Facebook and Instagram.\nYour burger can’t be THAT good!\nOh, but it is! Check out our awards to see a list of our recent awards – including multiple “Best Burger” awards!\nGiving Back to the Community\nGraffiti American Burger Bar supports many local charities. We give back to our surroundings for a better community and a better world.\nCoalition for the Homeless of Central Florida\nOur mission is to transform the lives of homeless men, women, and children by providing crucial services to end their crisis of homelessness.\nRunning For Brews\nRunning For Brews is for all those who enjoy getting out and breaking a sweat amongst other fellow runners and then topping it off with an awesome craft brew and some great conversation.\nBase Camp Children’s Cancer Foundation\nBASE Camp Children’s Cancer Foundation provides a year-round base of support for children and families facing the challenge of living with cancer and other life-threatening hematological illnesses.\nPet Rescue by Judy\nPet Rescue By Judy is a private, non-profit organization dedicated to the rescue of cats and dogs. We spay and neuter all of our animals. They also are given their required shots and examined by a Vet to make sure they have no health issues; if the animals have health issues, they are treated for those issues.\nRelay for Life\nRelay For Life is a fun-filled overnight event designed to celebrate survivorship and raise money for research and programs of your American Cancer Society. During the event, teams of people gather at schools, fairgrounds, or parks and take turns walking or running laps. Each team tries to keep at least one team member on the track at all times.\nKnights of Columbus\nThe Knights of Columbus is a Catholic fraternal service organization that witnesses to its principles of charity, unity, and fraternity through spiritual and corporal works of mercy locally and globally. The Knights also promotes the Catholic faith through evangelization initiatives. It offers financial security to its members and their families through highly-rated financial products and services.\nRunway to Hope\nRunway To Hope raises funds and addresses the needs of the children and families impacted by pediatric cancer. We provide money for research, trials, equipment, and family assistance. In addition to lending our support and efforts to the needs of these children and families, we are dedicated to imparting a legacy that will inspire others to make a difference in the fight against pediatric cancer.\nBrookshire Fund\nThe Brookshire Fund is organized exclusively for charitable and educational purposes. The Brookshire Fund is organized exclusively for one or more of the purposes as specified in Section 501(c)(3) of the Internal Revenue Code. The purpose of the Brookshire Fund is to promote and support the educational causes of Brookshire Elementary School through fundraising charitable contribution efforts and to provide financial assistance to prioritized projects.\nPink Heals\nWe drive pink fire trucks and pink police cars across America, bringing the “Cares Enough to Wear Pink” and Pink Heals Movement to a city near you! We simply provide a program for your community leaders to adopt, helping them fundraise for people rather than causes. We focus our labor of love on the women of this country and wage war on anything that may harm her, starting with cancer!\nRally for the Cure\nSusan G. Komen® is honored to benefit from Rally for the Cure®, presented by Condé Nast Rally for the Cure is a grassroots program that works to support Komen’s commitment to awareness as the first step in eliminating breast cancer through volunteer organized golf, tennis, and social events. Rally empowers people to support the mission of Susan G. Komen by spreading awareness in their community through an activity they are passionate about. – See more at:\nKomen.org\nPress and Awards\nposition relative\nposition absolute\nORLANDO’S BEST BURGER\nOctober 9, 2023\nI visit the Orlando area so much that it makes sense that I add this category. So here it is, what I believe are the 6 Best Burgers in the Orlando area, vote and one will take away a Best Orlando Burger Burger Beast Burgie Award (that was more than a mouthful) in early 2015.                                                                                                            Read The Entire Article\nORLANDO’S BEST BURGER – BEST OF ORLANDO 2014\nOctober 9, 2023\nBeth’s Burger Bar in downtown Orlando promises to be a late-night big kid’s diner. The restaurant features a highly-customizable build-a-burger website, dozens of import and domestic beer choices, and several wines. With a plethora of board games, bingo nights, beer pong, and daily food and drink specials, Beth’s Burger Bar aims to satisfy the kid inside all of us.                                                                                                            Read The Entire Article\nGRAFFITI JUNKTION SET FOR EARLY APRIL OPENING ON CHURCH STREET\nOctober 9, 2023\nGreg Peters is staging an assault on the Central Florida restaurant scene and Church Street is next in his sights.                                                                                                            “We opened in Winter Springs a week ago, Dr. Phillips on Sunday, Church Street in three weeks and Lake Nona opens in five weeks,” said Peters, co-owner of Graffiti Junktion, about the company’s recent rapid expansion. “There were delays with the Church Street renovation, but once they were cleared up, everything happened at once.”                                                                                                            The casual, burger-centric eatery has been a staple of the downtown Orlando menu with its Thornton Park location. The company’s expansion to Church Street actually began in March 2014 with the more high-end Cafe Red concept. The venue closed about six months later.                                                                                                            Read The Entire Article\nORLANDO’S BEST BURGER\nOctober 9, 2023\nThe burger. That slice of Americana that can be eaten anytime of the day, and anytime of the year.                                                                                                            It’s pretty hard to find a person that doesn’t enjoy a nice, juicy burger. It’s one of those comfort foods that not many Americans can live without, and rightfully so. It’s super easy to make, and you can pair the burger with anything. You can have it solo, or with cheese. You can add onions, bacon, or whatever your heart desires.                                                                                                            That’s what makes the burger such a perfect food item, and why in Orlando, great burger places are on every corner. There are too many great burger restaurants in Orlando, so let’s narrow it down to the top three best burger joints in Orlando. With these three, you will be in burger heaven!                                                                                                            Read The Entire Article\nORLANDO’S BEST SPORTS BAR – BEST OF ORLANDO 2014\nOctober 9, 2023\nWe’ve all fallen into this trap. You excitedly enter your friend’s house to catch the big game, and lo and behold, the TV is tiny, there’s nowhere to sit, the beer is warm, and the food looks like it traveled 3000 miles to get there. Avoid the heartbreak, and visit one of these sports bars named the best in and around Boston by Orlando A-List voters.                                                                                     Read The Entire Article\nGRAFFITI JUNKTION, PAPA MURPHY’S & MORE DEBUT NEW LOCATIONS IN CENTRAL FLORIDA\nOctober 9, 2023\nOrlando’s culinary scene is kicking off the New Year with several new locations of popular chains in the area, as well as a new opportunity for restaurant space in downtown Orlando.                                                                                     First up, Papa Murphy’s take-and-bake pizza concept will host a grand opening this weekend for its new Oviedo location. This will be the Vancouver, Wash.-based chain’s fourth location in Central Florida, including Apopka, Lake Mary and Ocoee. Central Florida franchisee Scottie Cahill says he plans to open additional locations this year.                                                                                     “The Orlando area has the right demographics for the Papa Murphy’s concept, and we’ll continue to build momentum through additional locations and enhanced advertising programs,” Cahill said in a prepared statement.                                                                                     Read The Entire Article\nRATED #2 IN USA TODAY’S 10 BEST\nOctober 9, 2023\nThornton Park Area’s Best Restaurants: This fun, local burger joint now has five locations around the city of Orlando, but Thornton Park is where it all started. Bold colors, bold burgers, great happy hours (early and late!) and a universally friendly atmosphere welcomes everyone from the young to the young-at-heart. And who doesn’t love a creative sandwich served alongside a cold beer? The entire place, inside and out, is ablaze with colorful art. Graffiti Junktion’s Thornton Park outpost sits right in the middle of the area’s tiny-but-charming business district, outdoor seating allows diners to soak up the atmosphere while scarfing down sweet potato fries. Win-win.                                                                                                            View Entire Article\nBEST NON-CHAIN BURGER – BEST OF ORLANDO 2013\nOctober 9, 2023\nYou might call them the class of 72: the winners of our annual Best of Orlando poll in six dozen categories.                                                                                                            Readers picked their favorites in everything from golf courses to tattoo parlors, TV news teams to theater, burgers to bloggers. So dig in!                                                                                                            Read The Entire Article\nVOTED BEST CHILI – LAKE MARY CHILI COOK OFF\nOctober 9, 2023\nGraffiti Junktion’s Burger Bar location in Jacksonville Beach offers up mouthfuls.                                                      Now an Orlando-based chain wants to leave its mark on the local burger scene, too. Its quite literal about leaving marks.\nMEATAHOLICS: HERE’S MECCA\nOctober 9, 2023\nGraffiti Junktion’s Burger Bar location in Jacksonville Beach offers up mouthfuls.                                                      Now an Orlando-based chain wants to leave its mark on the local burger scene, too. Its quite literal about leaving marks.\nMore Posts\nWe’d love to hear from you! Call our friendly team at\n904-372-9985\n.\nHome\nAbout\nMenu\nSpecials\nOrder Online\nContact\nCareers\nGallery\nPhone:\n904-372-9985\nAddress :   265 5\nth\nAve N,\n﻿\nJacksonville Beach, FL 32250\nContact Information\nBUSINESS HOURS\nMon - Sun\n11:00 am\n-\n11:00 pm\nHappy Hour:\nMon - Fri 2:00 pm - 6:00 pm\nHalf Priced:\nWine\nWell Drinks\nDomestic Draft Beer\nContent, including images, displayed on this website is protected by copyright laws. Downloading, republication, retransmission or reproduction of content on this website is strictly prohibited.\nTerms of Use\n|\nPrivacy Policy\nAdd full CSS and Javascript before the close tag of the body if needed\n========= JS Section =========\nLoad jQuery\nEnd Load jQuery\nInjecting site-wide before scripts\nEnd Injecting site-wide to the head\nHEAD RT JS Include\nEnd of HEAD RT JS Include\nphotoswipe markup\nRoot element of PhotoSwipe. Must have class pswp.\nBackground of PhotoSwipe. \n         It's a separate element as animating opacity is faster than rgba().\nSlides wrapper with overflow:hidden.\nContainer that holds slides. \n            PhotoSwipe keeps only 3 of them in the DOM to save memory.\n            Don't modify these 3 pswp__item elements, data is added later on.\nDefault (PhotoSwipeUI_Default) interface on top of sliding area. Can be changed.\nControls are self-explanatory. Order can be changed.\nPreloader demo http://codepen.io/dimsemenov/pen/yyBWoR\nelement will get class pswp__preloader--active when preloader is running\nAlias: f12d045c\nShare by:\nEnd Script tags\nBegin Body End Markup\nEnd Body End Markup\nSite Wide Html Markup\nSite Wide Html Markup\nBegin Product Custom HTML Markup\nEnd Product Custom HTML Markup",
      "emails": [
        "your@email.com"
      ]
    }
  ],
  "all_links": [
    "http://www.graffitiamericanburgerbar.com/restaurant-food-gallery",
    "http://www.graffitiamericanburgerbar.com/restaurant-career-applications",
    "http://www.graffitiamericanburgerbar.com/contact-our-restaurant",
    "http://www.graffitiamericanburgerbar.com/",
    "http://www.graffitiamericanburgerbar.com/specials1f941ed4",
    "http://www.graffitiamericanburgerbar.com/burgers-beers-restaurant-menu",
    "http://www.graffitiamericanburgerbar.com/about-our-restaurant"
  ],
  "candidate_links": [
    "http://www.graffitiamericanburgerbar.com/contact-our-restaurant",
    "http://www.graffitiamericanburgerbar.com/about-our-restaurant"
  ],
  "visited": [
    "http://www.graffitiamericanburgerbar.com/",
    "http://www.graffitiamericanburgerbar.com/about",
    "http://www.graffitiamericanburgerbar.com/contact",
    "http://www.graffitiamericanburgerbar.com/staff",
    "http://www.graffitiamericanburgerbar.com/team",
    "http://www.graffitiamericanburgerbar.com/board",
    "http://www.graffitiamericanburgerbar.com/directory",
    "http://www.graffitiamericanburgerbar.com/events",
    "http://www.graffitiamericanburgerbar.com/sitemap.xml",
    "http://www.graffitiamericanburgerbar.com/council",
    "http://www.graffitiamericanburgerbar.com/leadership",
    "http://www.graffitiamericanburgerbar.com/management",
    "http://www.graffitiamericanburgerbar.com/producers",
    "http://www.graffitiamericanburgerbar.com/support",
    "http://www.graffitiamericanburgerbar.com/crew",
    "http://www.graffitiamericanburgerbar.com/members",
    "http://www.graffitiamericanburgerbar.com/bios",
    "http://www.graffitiamericanburgerbar.com/people",
    "http://www.graffitiamericanburgerbar.com/artists",
    "http://www.graffitiamericanburgerbar.com/musicians",
    "http://www.graffitiamericanburgerbar.com/faculty",
    "http://www.graffitiamericanburgerbar.com/administration",
    "http://www.graffitiamericanburgerbar.com/contact-our-restaurant",
    "http://www.graffitiamericanburgerbar.com/about-our-restaurant"
  ],
  "base_url": "http://www.graffitiamericanburgerbar.com/"
}