{
  "pages": [
    {
      "url": "https://www.grandelakes.com/things-to-do/fall",
      "is_candidate": false,
      "has_email": true,
      "text": "Home\nEvents/Activities\nFall\nFall at Grande Lakes\nEmbrace an eternal summer at Grande Lakes Orlando this autumn. Our resort offers an impressive range of activities and unique culinary experiences that will make your holiday exceptional. Designed for families and couples, the resort masterfully combines excitement and serenity, making it a dream fall destination.\nView Fall Newsletter\nfor Fall at Grande Lakes\nFeatured Event\nFall at Grande Lakes\nGet ready for a memorable fall at Grande Lakes with a line-up of events that the whole family will enjoy. The Da Vinci Lawn will be bustling with activities like fall crafts, laser skeet shooting, pumpkin decorating, archery, and canoeing. The amusement continues with games, face painting, a petting zoo, and a DJ. Expect charming cottages, each offering an array of food and beverage options. Plus, you'll discover unique treasures from local vendors across Central Florida, showcasing items you simply can't find anywhere else. Don't let this fall pass you by without experiencing Grande Lakes Orlando.\nTickets:\nGeneral admission is free to overnight guests, please RSVP.\nTickets must be purchased to access advanced features and exclusive activities like: laser skeet shooting, archery, and pumpkin painting.\nPurchase Tickets - Fall at Grande Lakes\nPurchase Tickets\nfor Fall at Grande Lakes\nLearn More\nof Fall at Grande Lakes\nLocation: Da Vinci Lawn\nDates: Saturday, October 11 – Sunday, October 12, 2025\nHours: 10:00 am - 2:00 pm\nClose Expand Option\nFall at Grande Lakes\nLocation: Da Vinci Lawn\nDates: Saturday, October 11 – Sunday, October 12, 2025\nHours: 10:00 am - 2:00 pm\nOpen to the public\nParking: $40 plus tax\nValet parking: $58 plus tax\nLive Music: Enjoy performances that will set the perfect mood for the season.\nMaster Falconer Demonstrations: Witness the incredible skills of our master falconer.\nFishing with Captain Mark: Learn tips and tricks from our resident angler.\nMeet Farmer Leslie: Get to know the heart and soul behind our farm-to-table experiences.\nFamily Lawn Games: Challenge your family to bocce ball, cornhole, chess, air hockey, foosball, ping pong and more.\nRitz Kids Animal Encounters: Meet the adorable resident animals.\nCulinary Delights: Savor curated food and beverages crafted by our talented culinary team.\nMagic Encounters: Be amazed by our Resident Magician, America's Got Talent Finalist, Drew Thomas!\nAlso, train rides, face painting and balloon artists!\nClose\nGo to previous slide\nGo to next slide\nThanksgiving\nSpecial Events\nKnife & Spoon Thanksgiving Dinner\nevent details\nKnife & Spoon Thanksgiving Dinner\nLocation: Knife & Spoon\nDate: November 27, 2025\nTime: 5:30 pm – 10:00 pm\nReservation Required\nbuy tickets-Knife & Spoon Thanksgiving Dinner\nReserve Table\nReserve Table about Knife & Spoon Thanksgiving Dinner\nIndulge in an unforgettable holiday feast at Knife & Spoon. Our a la carte Thanksgiving menu will feature an array of elevated traditional dishes.\nClose\nHighball & Harvest Thanksgiving Buffet\nevent details\nHighball & Harvest Thanksgiving Buffet\nLocation: Highball & Harvest\nDate: November 27, 2025\nTime: 3:00 pm – 9:00 pm\nReservation Required\nbuy tickets-Highball & Harvest Thanksgiving Buffet\nReserve Table\nReserve Table about Highball & Harvest Thanksgiving Buffet\nTaste the joy of Thanksgiving with a sumptuous buffet at Highball & Harvest. A banquet of traditional favorites like turkey and stuffing, along with succulent seafood and fresh salads await you. Bring your family and friends to our welcoming table and soak in the festive atmosphere.\nClose\nPrimo Thanksgiving Dinner\nevent details\nPrimo Thanksgiving Dinner\nLocation: Primo\nDate: November 27, 2025\nTime: 5:30 pm – 10:00 pm\nReservation Required\nbuy tickets-Primo Thanksgiving Dinner\nReserve Table\nReserve Table about Primo Thanksgiving Dinner\nTurn this Thanksgiving into a special occasion with an outstanding meal from our award-winning restaurant. Seize the opportunity to indulge in our exclusive holiday menu meticulously curated for Thanksgiving.\nClose\nCitron Thanksgiving Buffet\nevent details\nCitron Thanksgiving Buffet\nLocation: Citron\nDate: November 27, 2025\nTime: 3:00 pm – 8:00 pm\nReservation Required\nbuy tickets-Citron Thanksgiving Buffet\nReserve Table\nReserve Table about Citron Thanksgiving Buffet\nJoin us for a spectacular Thanksgiving feast. Our buffet is loaded with all your seasonal favorites, promising a delightful experience for guests of all ages.\nClose\nThanksgiving Macy’s Day Parade\nevent details\nThanksgiving Macy’s Day Parade\nLocation: Knife Burger\nDate: November 27, 2025\nTime: 9:00 am – 11:00 am\nComplimentary\nBe a part of the excitement! Come to the Knife Burger party and experience the spectacle of the Macy's Day Parade.\nClose\nTurkey To Go\nevent details\nTurkey To Go\nLocation: porté-cochere\nDate: November 27, 2025\nTime: 11:00 am – 1:00 pm\nReservation Required\nbuy tickets-Turkey To Go\nOrder Now\nOrder Now about Turkey To Go\nFor those celebrating Thanksgiving at home, The Ritz-Carlton is offering a complete holiday dinner for up to six people available for pick up on Thanksgiving day. The traditional Thanksgiving dinner includes a 14-16 pound whole roasted turkey complemented with side dishes including parker house rolls, mashed potatoes, sweet potato casserole, green bean casserole, honey glazed carrots, traditional cranberry sauce, and turkey and sage gravy with traditional stuffing. You'll also receive our Whisper Creek Farm Seminole pumpkin soup and a kale salad with cranberry vinaigrette dressing, cornbread croutons and beets. Take your pick of pumpkin pie, apple crumble, or chocolate pecan pie for dessert. Additional sides are available for purchase.\nOrders may be picked up on November 27, 2025, at The Ritz-Carlton Plaza, porté-cochere.\nPick up: 11/27 at your selected time.\nClose\nOther Fall\nSpecial Events\nHighball & Harvest Magical Dining\nevent details\nHighball & Harvest Magical Dining\nHighball & Harvest\nDates: August 15 - September 30, 2025\n5:30 pm - 10:00 pm\n$60\nbuy tickets-Highball & Harvest Magical Dining\nReserve Table\nReserve Table about Highball & Harvest Magical Dining\nMenu\nEnjoy a fantastic dining experience at Highball & Harvest during Magical Dining. Our set menu offers a variety of beloved dishes, promising an amazing meal at great value.\nClose\nPrimo Campari Dinner Series\nevent details\nPrimo Campari Dinner Series\nPrimo\nDates: 9/12, 10/3, 11/17, 12/5, 01/2\n6:00 pm\nReservation Required\nbuy tickets-Primo Campari Dinner Series\nReserve Table\nReserve Table about Primo Campari Dinner Series\nExperience a bespoke four-course dinner at Primo, featuring cocktails by Seanna Fenemore. Celebrate locality, sustainability, and community at the Primo Campari Series.\nClose\nThe Magic Show: Haunted Edition\nevent details\nThe Magic Show: Haunted Edition\nSelect Date\nbuy tickets-The Magic Show: Haunted Edition\nLearn More\nLearn More about The Magic Show: Haunted Edition\nStep into the opulent halls of The Ritz-Carlton, where luxury and legend intertwine for a spellbinding night of ghost stories, comedy, and logic-defying illusions. Join AGT Finalist Drew Thomas and his enchanting ensemble of spirits for a Halloween show unlike anything you have ever seen.\nExperience a ghostly night of mind-bending magic, chilling comedy, and supernatural surprises. This is not your typical Halloween show - it's a world-class, spine tingling spectacle where spirits refuse to be ignored.\nClose\nGrande Lakes Trick Or Treat\nevent details\nGrande Lakes Trick Or Treat\nLocation: JW Marriott Front Desk\nDate: October 31, 2025\nTime: 5:00 pm – 7:00 pm\nComplimentary\nParticipate in a self-guided trick or treat adventure at JW Marriott. Visit the front desk to pick up your spooky map and explore all the haunted spots.\nClose",
      "emails": [
        "grandelakesleads@marriott.com"
      ]
    },
    {
      "url": "https://www.grandelakes.com/things-to-do/winter",
      "is_candidate": false,
      "has_email": true,
      "text": "Home\nEvents/Activities\nWinter\nWarm up this Holiday Season\nWinter at Grande Lakes\nCelebrate the festive season with friends and loved ones surrounded by the enchantment of Grande Lakes. From delicious treats to tantalizing feasts, guests will delight in a variety of festive experiences that will create memories that last a lifetime.\nBook Early & Save\nFestive Escape Package\nMake this festive season unforgettable at Grande Lakes! Glide into excitement at our new ice skating rink, warm up by the firepits, and discover unique treasures at the Winter Wonderland Market. Relax in our cozy holiday hideaway and indulge in lavish feasts for a culinary delight. It's the perfect holiday destination, filled with festive cheer and joyful celebrations.\nFestive Escape Package\nThe Ritz-Carlton\nfor Festive Escape Package\nJW Marriott\nabout Festive Escape Package\nPromo Code: THM\nDates: November 27, 2025 - January 03, 2026\nGo to previous slide\nGo to next slide\nFestive\nSpecial Events\nIce Skating\nevent details\nIce Skating\nThe Da Vinci Lawn\nNovember 27, 2025 - January 3, 2026\n4:00pm - 9:00pm\n$25\nbuy tickets-Ice Skating\nTickets\nTickets about Ice Skating\nExperience our brand-new ice skating rink by the scenic lake with your loved ones. Skating under the winter sky is the perfect festive activity that will bring joy and happiness to everyone. So, come and join us for some winter fun!\nClose\nWinter Wonderland Market\nevent details\nWinter Wonderland Market\nDa Vinci Lawn\nDecember 12, 13, 19, 20, 26, 27\n4:00pm - 8:00pm\nDiscover the bliss of the holiday season with our Winter Wonderland Market. Stroll amongst European-inspired cottages featuring traditional holiday delicacies, tasty beverages, and local artisan crafts. This holiday affair includes hourly snowfall and many advent surprises that the entire family will enjoy.\nClose\nFestive Firepit Experience\nevent details\nFestive Firepit Experience\nDa Vinci Lawn\nNovember 27, 2025 - January 3, 2026\n4:30pm - 6:30pm and 7pm - 9pm\nWarm up this winter with our cozy fire pits next to the ice skating rink. Treat yourself to fresh fruit, chips & dip, and a tableside cocoa cart. Enhance your experience further with wine and champagne.\nClose\nGingerbread School\nevent details\nGingerbread School\nLocation: Lobby Lounge\nDates: November 29 & 30. December 6, 7, 13, 14, 19, 20, 21, 2025\nTimes: 9:00 am – 11:00 am, 12:00 pm – 2:00 pm, 3:00 pm – 5:00 pm\nReservation Required\nbuy tickets-Gingerbread School\nReserve Now\nReserve Now about Gingerbread School\nJoin the pastry team to build your own gingerbread house. The fun-filled activity begins by building the house with pre-baked gingerbread panels on a wooden foundation. Then, guests can select from dozens of different types of candy and other edible details to decorate and personalize their gingerbread house.\nClose\nSanta’s Teddy Bear Tea\nevent details\nSanta’s Teddy Bear Tea\nLocation: Lobby Lounge\nDates: December 6, 7, 13, 14, 19, 20, 21, 2025\nTime: 11:00 am & 1:00 pm\nReservation Required\nbuy tickets-Santa’s Teddy Bear Tea\nReserve Now\nReserve Now about Santa’s Teddy Bear Tea\nSip into the holidays with the most cherished tradition. Choose from our lavish selection of teas and savor thoughtfully curated sweets and culinary delights. Engage with crafts, storytelling, live entertainment, and a special visit from Santa Claus.\nEnjoy our delicious salmon, cucumber, egg and turkey sandwiches. Our tea service also offers homemade pastries and desserts, including Orange Cranberry Scones with Lemon Curd and Devonshire Cream, Strawberries with Whipped Cream and Grande Marnier, Macarons, and seasonal Tartlets.\nClose\nThe Magic Show: Holiday Edition\nevent details\nThe Magic Show: Holiday Edition\nSelect Dates\nbuy tickets-The Magic Show: Holiday Edition\nLearn More\nLearn More about The Magic Show: Holiday Edition\nPrepare for an extraordinary event presented by acclaimed magician and America's Got Talent finalist, Drew Thomas and his award-winning colleagues. The Magic show combines mind-bending magic, large-scale illusions, and humor to create an electrifying atmosphere. This show will captivate you with suspense and immersive audience participation, promising an unforgettable evening brimming with laughter and wonder.\nClose\nNew Year's Eve\nSpecial Events\nNew Year’s Eve Firework Cabanas\nevent details\nNew Year’s Eve Firework Cabanas\nLocation: Oasis Cabanas\nDate: Saturday\nTime: 9:00 pm – 12:30 am\nReservations Required\nbuy tickets-New Year’s Eve Firework Cabanas\nReserve Now\nReserve Now about New Year’s Eve Firework Cabanas\nCelebrate the New Year in style at the Oasis Firework Cabanas, the ultimate al fresco experience at Grande Lakes. You will enjoy a spectacular view of the lake and the fireworks, while savoring champagne and caviar. Don't miss this exclusive opportunity ring in 2025 with elegance and excitement. Reserve your Cabana today and get ready for an unforgettable night.\nClose",
      "emails": [
        "grandelakesleads@marriott.com"
      ]
    },
    {
      "url": "https://www.grandelakes.com/things-to-do",
      "is_candidate": false,
      "has_email": true,
      "text": "Home\nEvents/Activities\nSeasonal\nExperiences\nGrande Lakes is your go-to destination for year-round entertainment. Our wide array of activities, designed to cater to all ages, ensures your visit is brimming with fun, adventure, and unforgettable experiences.\nView Summer Newsletter\nfor Seasonal\nExperiences\nSpring\nSummer\nFall\nwinter\nGo to previous slide\nGo to next slide\nThe Upcoming Event Awaits.\nGLO Summer Fireworks\nVIEW FULL CALENDAR\nof The Upcoming Event Awaits.\nGo to previous slide\nGo to next slide\nplanning\nYour\ntrip\nAt Grande Lakes Orlando, every day is unique and filled with exciting opportunities. Our resort's privileged location offers guests so much variety that we made the burden of planning the ideal vacation effortless. Discover our itineraries, day trips and recommendations to enhance your Orlando retreat.\nFAMILY\nCouples\nWork-Play\nWellness\nFoodies\nOutdoor Enthusiasts\nGirls' Getaway\nGuys' Getaway\nMulti-Generational\nGo to previous slide\nGo to next slide\nThe Magic Show\nPrepare for an extraordinary event presented by acclaimed magician and America's Got Talent finalist, Drew Thomas and his award-winning colleagues. The Magic Show combines mind-bending magic, large-scale illusions, and humor to create an electrifying atmosphere. This show will captivate you with suspense and immersive audience participation, promising an unforgettable evening brimming with laughter and wonder.\nBook Today\nfor The Magic Show\nGrande Lakes Sports\nAdventure calls at Grande Lakes, a 500-acre tropical paradise boasting a variety of outdoor activities. Sports lovers and recreational enthusiasts alike will find plenty to enjoy. Experience the thrill of falconry, or take an eco-tour around our property. For early risers, we offer a sunrise safari, while fishing fans can spend a peaceful day fishing on our serene lakes. Let the adventure begin.\nExplore\nfor Grande Lakes Sports\nGolf Where Legends Play\nThe Ritz-Carlton golf course, home to the PNC Championship, is a golfer's oasis, complete with challenging greens, expansive fairways, and strategic hazards. Our recognition as a Certified Audubon Cooperative Sanctuary also highlights our dedication to environmental preservation, enhancing your gaming experience.\nLearn More\nfor Golf Where Legends Play\nTennis & Pickle Ball\nFeaturing two tennis courts and two pickle ball courts, getting in the game is a breeze at Grande Lakes. Play a friendly match or take a lesson, no matter your skill or age. Break a sweat by enrolling in a tennis cardio clinic, where you'll learn the basics of the game while receiving a full cardio workout.\nFor court reservations and lessons call\n(407) 393-4900.\nphoto concierge\nCapture priceless moments with your loved ones with our exceptional photography service. Relish the opportunity to connect, play, and share time together in a stunning tropical setting. Reserve your photo shoot at the Photography Concierge in The Ritz-Carlton.\nBook Now\nPrevious\nNext\nBocce Ball\nTake pleasure in a classic game of bocce ball on our two outdoor courts located poolside. Along with the game, enjoy the comfort of private cabanas and the breathtaking view of Grande Lake.\nRESERVE - Bocce Ball\nRESERVE\nfor Bocce Ball\nRitz Kids\nOur Ritz Kids program promises to thoroughly entertain our younger guests. We offer a variety of fun and engaging activities including storytelling, animal care lessons, arts and crafts, and physical activities.\nLearn More\nfor Ritz Kids\nLOCAL\nAttractions\nGrande Lakes Orlando's prime location lets you explore Central Florida with ease. Enjoy popular theme parks, shopping malls, sports arenas and entertainment venues within a short drive. Plus, we offer a free shuttle bus to theme parks.\nSea World\nIf you're a fan of marine life, this sprawling aquatic theme park is a dream come true. Just a quick ten-minutes drive from Grande Lakes, it offers a world of immersive animal encounters, captivating shows and adrenaline-pumping rides.\nUniversal Orlando\nThe ultimate destination for Hollywood enthusiasts is within a 20-minutes from the resort. With numerous theme parks like Universal Studios for movie fans, Islands of Adventure for thrill-seekers, Volcano Bay for water enthusiasts, and City Walk for those seeking entertainment, it's a must-visit destination.\nWalt Disney World\nFind a world of magic and excitement at Walt Disney World, featuring seven diverse theme parks. From the futuristic Epcot and enchanting Magic Kingdom to the exotic Animal Kingdom, all are conveniently located within a 25-minute drive.\nKia Center\nThis versatile arena is home to the NBA's Orlando Magic and so much more. It's the pulse of entertainment in the city, showcasing concerts, comedy shows, and kid-friendly performances. Sports enthusiasts can also catch professional hockey and action-packed arena football games.\nThe Mall at Millenia\nOrlando's premium mall is a treasure trove of over 150 retailers and restaurants. Here, you can find luxury brands such as Louis Vuitton, Tory Burch, Burberry, and Chanel, all under one roof.\nThe Florida Mall\nThis vibrant indoor mall offers a diverse mix of more than 250 retail and dining outlets. Enhanced with family-friendly attractions like the Crayola Experience, it's a prefect family day out.\nOrlando Premium Outlets\nDiscover unbeatable discounts on top designer and retailer items at one of the country's largest outlets.\nGo to previous slide\nGo to next slide",
      "emails": [
        "grandelakesleads@marriott.com"
      ]
    }
  ],
  "all_links": [
    "https://www.grandelakes.com/things-to-do/waterpark",
    "https://www.grandelakes.com/things-to-do/itineraries",
    "https://www.grandelakes.com/local-attractions",
    "https://www.grandelakes.com/donations",
    "https://www.grandelakes.com/terms-of-use",
    "https://www.grandelakes.com/our-resort/universal-orlando-resort-partnership",
    "https://www.grandelakes.com/rooms-suites/jw-marriott",
    "https://www.grandelakes.com/rooms-suites/the-ritz-carlton-club",
    "https://www.grandelakes.com/things-to-do/itineraries/foodies",
    "https://www.grandelakes.com/frequently-asked-questions",
    "https://www.grandelakes.com/things-to-do/itineraries/couples",
    "https://www.grandelakes.com/",
    "https://www.grandelakes.com/meetings-weddings",
    "https://www.grandelakes.com/resourcefiles/pdf/jw-marriott-shipping-fees.pdf",
    "https://www.grandelakes.com/things-to-do/fall",
    "https://www.grandelakes.com/things-to-do/itineraries/wellness",
    "https://www.grandelakes.com/our-resort/resort-map",
    "https://www.grandelakes.com/things-to-do/itineraries/family",
    "https://www.grandelakes.com/specials/jw-marriott",
    "https://www.grandelakes.com/our-resort/grande-lakes-stories",
    "https://www.grandelakes.com/things-to-do/kids-programs",
    "https://www.grandelakes.com/dining/the-ritz-carlton",
    "https://www.grandelakes.com/things-to-do/grand-lakes-sports",
    "https://www.grandelakes.com/meetings-weddings/start-planning",
    "https://www.grandelakes.com/rooms-suites/the-ritz-carlton",
    "https://www.grandelakes.com/things-to-do/spa",
    "https://www.grandelakes.com/dining/jw-marriott",
    "https://www.grandelakes.com/resourcefiles/pdf/vitale-menu-6-23-25.pdf",
    "https://www.grandelakes.com/resourcefiles/pdf/bleu-menu-7-18-24.pdf",
    "https://www.grandelakes.com/specials/the-ritz-carlton",
    "https://www.grandelakes.com/dining",
    "https://www.grandelakes.com/press",
    "https://www.grandelakes.com/tracking/click-location-map.aspx",
    "https://www.grandelakes.com/things-to-do/pools-cabanas",
    "https://www.grandelakes.com/things-to-do/golf",
    "https://www.grandelakes.com/ResourceFiles/restaurant-pdf-menus/fairways-menu-6-27-2024.pdf",
    "https://www.grandelakes.com/site-map",
    "https://www.grandelakes.com/our-resort/destination",
    "https://www.grandelakes.com/resourcefiles/pdf/lobby-lounge-menu-6-26-25.pdf",
    "https://www.grandelakes.com/accessibility",
    "https://www.grandelakes.com/things-to-do/shopping",
    "https://www.grandelakes.com/rooms-suites/luxury-residences",
    "https://www.grandelakes.com/our-resort/conservation",
    "https://www.grandelakes.com/rooms-suites/jw-marriot-renovation",
    "https://www.grandelakes.com/photos",
    "https://www.grandelakes.com/resourcefiles/pdf/mcorz-shipping-fees.pdf",
    "https://www.grandelakes.com/things-to-do/winter",
    "https://www.grandelakes.com/directions",
    "https://www.grandelakes.com/things-to-do",
    "https://www.grandelakes.com/meetings-weddings#WeddingVenuesSection"
  ],
  "candidate_links": [
    "https://www.grandelakes.com/things-to-do/fall",
    "https://www.grandelakes.com/things-to-do/winter",
    "https://www.grandelakes.com/things-to-do"
  ],
  "visited": [
    "https://www.grandelakes.com/dining/fairways-pub%20?",
    "https://www.grandelakes.com/about",
    "https://www.grandelakes.com/contact",
    "https://www.grandelakes.com/staff",
    "https://www.grandelakes.com/team",
    "https://www.grandelakes.com/board",
    "https://www.grandelakes.com/directory",
    "https://www.grandelakes.com/events",
    "https://www.grandelakes.com/sitemap.xml",
    "https://www.grandelakes.com/council",
    "https://www.grandelakes.com/leadership",
    "https://www.grandelakes.com/management",
    "https://www.grandelakes.com/producers",
    "https://www.grandelakes.com/support",
    "https://www.grandelakes.com/crew",
    "https://www.grandelakes.com/members",
    "https://www.grandelakes.com/bios",
    "https://www.grandelakes.com/people",
    "https://www.grandelakes.com/artists",
    "https://www.grandelakes.com/musicians",
    "https://www.grandelakes.com/faculty",
    "https://www.grandelakes.com/administration",
    "https://www.grandelakes.com/things-to-do/fall",
    "https://www.grandelakes.com/things-to-do/winter",
    "https://www.grandelakes.com/things-to-do"
  ],
  "base_url": "https://www.grandelakes.com/dining/fairways-pub%20?"
}