{
  "pages": [
    {
      "url": "https://www.grandcentralbrew.com/contact/",
      "is_candidate": false,
      "has_email": true,
      "text": "Brewery, Taproom and Beer Garden in St. Petersburg, FL\nCONTACT\nGet in Touch with Grand Central Brewhouse\nReady to connect with Grand Central Brewhouse? Whether you’re planning a visit, have questions about our craft beers, or want to discuss your next big event, we’re excited to hear from you!\nSEND US A MESSAGE\nSwing by Grand Central Brewhouse, your go-to St. Petersburg brewing company, for exceptional craft beers and exciting brewery events. Thinking about hosting a private gathering? Reach out by phone or email to plan an unforgettable event with us.\nAddress\n2340 Central Ave, St. Petersburg, FL 33712\nHours\nSun – Wed:\n12pm – 10pm\nThurs:\n12pm – 11pm\nFri – Sat\n: 12pm – 12am\n*After 9pm:\n21 & Up Only\ncontact\nPhone:\n727-202-6071\nEmail\n:\n[email protected]\nSEND US A MESSAGE\nFill out the form below and we will be in touch with you\nFirst Name\nLast Name\nEmail\nPhone\nMessage\nGET IN TOUCH WITH US\nSkaFest is back this Saturday!\nLager’s Not Dead: SkaFest Vol. 3 hits Grand Central Brewhouse on Saturday, August 30 from 1 PM to 10 PM, and it’s shaping up to be one of the best yet.\nThe lineup:\n💥 Eric Best – 1 PM - 1:45PM\n💥 Over Wait Mammal – 2 PM - 2:45 PM\n💥 Saganaki Bomb Squad – 3 PM - 3:45 PM\n💥 Chilled Monkey Brains – 4 PM - 5 PM\n💥 Floridaze – 5:15 PM - 6:30 PM\n💥 Control This! – 6:45 PM - 7:45 PM\n💥 Victims of Circumstance – 8 PM - 9:45 PM\nWe’ll have a wide array of fresh lagers pouring all day, a misting tent to keep you cool, and vendors like JB’s Hot Dogs, Churned Ice Cream, and Planet Retro hanging out for the day.\nThis event takes place in the Beer Garden and will be held rain or shine. We have plenty of tent coverage set up for the occasion.\n*Performance times are subject to change.\nSee you at SkaFest!\n36\n0\nOpen post by grandcentralbrewhouse with ID 17981312699736682\n36\n0\nOn Friday, August 29 at 6 PM Ultra Vinyl takes the stage with a set full of hits from across the decades. This Tampa Bay-based cover band brings a polished, high-energy performance that’s perfect for fans of live music you know and love. Whether you’re here to dance or just enjoy a great show with a beer in hand, Ultra Vinyl delivers the soundtrack.\n4\n0\nOpen post by grandcentralbrewhouse with ID 18058524002105109\n4\n0\n21\n2\nOpen post by grandcentralbrewhouse with ID 17853359745469320\n21\n2\nOn Saturday, August 23 at 6 PM The Rich Sheldon Band brings their blend of soulful Americana, folk, and roots rock to Grand Central Brewhouse. With influences ranging from the Grateful Dead and Bob Marley to Dylan and The Beatles, Rich and his band deliver a mix of original tunes, bluesy ballads, and jam-worthy covers that feel timeless.\n7\n0\nOpen post by grandcentralbrewhouse with ID 17975079755875857\n7\n0\nWe’re proud to be a sponsor of the St. Pete Shuffleboard Club, one of the most iconic and community-driven spots in town!\nFall League registration is now open! Get your teams together and lock in your spot:\n•\tMonday Teams League: September 29 - November 17\n•\tTuesday Singles League: September 30 - November 11\n•\tTuesday Rookie Teams League: September 30 - November 18\n•\tWednesday Teams League: October 1 - November 19\nYou’ll see GCB beers poured throughout the season and, if you keep your eyes open, some familiar faces on the courts too. Our Head Brewer Zac has been playing shuffle here for nearly a decade!\nGet signed up and we’ll see you at the courts this fall!\n29\n2\nOpen post by grandcentralbrewhouse with ID 17935484499072826\n29\n2\nWednesday, August 27, St. Pete Stand Up brings their comedy showcase to Grand Central Brewhouse for the very first time. To celebrate, the first 20 tickets are only $5 (plus Eventbrite fees).\nSpend your Wednesday night laughing with some of Florida’s top comedians and enjoy the chance for surprise drop-ins from talent across the country.\nGrab your early tickets at the link in our bio.\n10\n0\nOpen post by grandcentralbrewhouse with ID 17880149421374346\n10\n0\nShoeless Soul joins us this Saturday at 6 PM!\nFormed in 2010 when guitarist and songwriter Rene connected with bassist Sladjan Vidic at an open mic, Shoeless Soul has been crafting a sound all their own for well over a decade.Their music blends reggae, pop, jazz, and rock into something that’s as tight and polished as it is playful and spontaneous.\nTheir shows are filled with catchy hooks, tasteful jams, and an energy that’s impossible not to feel. Named “Best Fusion Band” in Creative Loafing’s Best of the Bay, Shoeless Soul has built a loyal following through their chemistry on stage and their ability to bend genres while keeping every song fresh.\nCome grab a beer and catch a set that promises to be as fun to watch as it is to hear.\n11\n0\nOpen post by grandcentralbrewhouse with ID 18013860500594286\n11\n0\nGCB is entering a new Era. Stay tuned for what we’re dropping soon. 😉\nHint: TS12 - Track 4\n🫶\n151\n8\nOpen post by grandcentralbrewhouse with ID 18051647390624095\n151\n8\nFriday, August 15 at 7 PM, fan favorite Hot Tonic Orchestra returns to the beer garden. Led by Victoria Woods and Josh Hindmarsh, this powerhouse group features a rotating cast of top-tier musicians and delivers a sound that’s been described as Postmodern Jukebox meets Amy Winehouse. Expect jazz fused with Latin rhythms, funk, and soul, all wrapped in fresh, original arrangements\n18\n0\nOpen post by grandcentralbrewhouse with ID 18135603175382491\n18\n0\nFor the third year in a row, we’re heading to Sweden to pour at Brewskival, one of the most exciting beer festivals in the world! It’s an honor to be on the lineup with so many incredible breweries and connect with beer lovers from all over.\nEric’s already booked his ticket. If you’ve ever thought about making the trip, this is the year to do it. Come experience the festival, explore the scene, and share a beer with us in Sweden.\n153\n6\nOpen post by grandcentralbrewhouse with ID 18070767952886637\n153\n6\nSunday, August 10 at 2 PM, Josh’s Jazz Trio returns to the beer garden. Expect smooth grooves, dynamic improvisation, and classic jazz standards performed with style. It’s the perfect way to ease into your afternoon with a world class beer and some top-tier musicianship.\n12\n0\nOpen post by grandcentralbrewhouse with ID 18044348054322557\n12\n0\nSaturday, August 9 at 7 PM, the Brek Milo Trio returns to the beer garden. Brek blends intimate, lyrical songwriting with impressive guitar work, creating a set that is both heartfelt and musically rich. It is a great way to spend a summer evening, filled with thoughtful lyrics, layered melodies, and serious musicianship.\n9\n0\nOpen post by grandcentralbrewhouse with ID 18062152556209604\n9\n0\nLoad More\nBLog\nEmployee Portal\n© Grand Central Brewhouse, St. Petersburg, FL |\nPrivacy Policy\n| Powered & Designed by\nBrewing Sites\nHome\nAbout\nOn Tap\nOur Beer\nFood\nCommunity\nVisit\nEvents\nPrivate Events\nContact\nHome\nAbout\nOn Tap\nOur Beer\nFood\nCommunity\nVisit\nEvents\nPrivate Events\nContact\nFacebook\nInstagram",
      "emails": [
        "info@grandcentralbrew.com"
      ]
    },
    {
      "url": "https://www.grandcentralbrew.com/about/",
      "is_candidate": false,
      "has_email": true,
      "text": "Brewery, Taproom and Beer Garden in St. Petersburg, FL\nGrand Central Brewhouse Overview\nGrand Central Brewhouse is a cornerstone of St. Pete’s Grand Central District, offering specialty craft beers and a community-focused environment. The brewery is known for its quality lagers and ales, welcoming spaces, and engaging local events.\nHistory and Philosophy\nLocated in St. Petersburg, Florida, Grand Central Brewhouse was established to foster community and craft high-quality beers. It operates on a philosophy of giving back, donating a portion of proceeds to local charities.\nThe emphasis is on tradition and quality ingredients, ensuring that every beer honors its roots. The two-story establishment features a taproom and beer garden, making it an inviting space for all.\nBrewing Process and Techniques\nGrand Central Brewhouse takes pride in its meticulous brewing process. Using time-honored ingredients, the brewery offers a range of artisanal lagers. European serving tank technology ensures each beer’s distinct flavors are perfectly preserved from tank to glass.\nFrom golden and crisp to dark and malty, their beers cater to diverse tastes. The emphasis on quality is evident in every aspect, right down to the thoughtfully selected glassware.\nLocation and Community\nSituated steps away from Central Avenue, the brewery provides an urban retreat with expansive indoor and outdoor spaces. The dog-friendly environment encourages bonding and memory-making among visitors.\nFood from LALA St. Pete complements the beer experience. The venue also offers options for private events, making it a versatile space for community gatherings.\nGCB’s origins stem from a simple love of beer and craft breweries.  After many years in the insurance business, Owner and Founder Kevin Milkey wanted to establish a new craft brewery in the community he feels very passionate about.  The initial plan was to follow the path of most US craft breweries and convert an old warehouse, gas station, garage, or factory into a brewery, but then Kevin came across a large vacant lot for sale on Central Avenue in the heart of the Grand Central District and thought that was a perfect location for a new brewery.   While discussing initial architectural plans with architect Tim Clemmons, we determined that the lot was big enough for two buildings, the second of which could be a restaurant which would provide food service for the brewery customers. So, what started out as an idea to renovate an old building into a small brewery became a new construction project with not one, but two buildings, each with a second floor and terrace and a large beer garden out back.\nLong before GCB opened, breweries and pubs were a frequent destination when\ntraveling. Many ideas incorporated into Grand Central Brewhouse came from\nvisits to breweries and pubs from around the world. The most notable being\nserving beer directly from serving tanks, which is more common in Europe\nthan in the US. The shiny copper serving tanks suspended above the main bar\nis the first thing your eyes are drawn to when entering GCB. In addition to\nthe design features of the brewery, our story is not complete without\nmentioning the emphasis of employees and giving back to the community. The\ngoal was to establish a new brewery with a focus on the employees, with an\nemphasis on fair pay, employee well-being and quality of life. Employees\nare the heart of any business, and it’s of utmost importance that everyone\nis treated fairly and with respect in a work environment where people are\nhappy at work. Lastly, sustainability and giving back to the community are\ningrained in our culture. Additional information about our community\ninitiatives and sustainability can be found in the Community section of\nthis website.\nOUR TEAM\nInside Look: The Grand Central Brewhouse Story\nGrand Central Brewhouse (GCB) combines a passion for craft beer with innovative brewing techniques and community-focused initiatives. Discover how GCB’s collaborative team, mission-driven approach, commitment to sustainability, and strong code of conduct make it a standout in the craft beer industry.\nKevin Milkey\nFounder and CEO\nAfter retiring from a successful career in insurance, Kevin has decided to take his talents to the craft beer industry. Exactly what those talents are remains debatable. But what is not debatable is his love of beer and spending time at craft breweries. Prior to establishing Grand Central Brewhouse, Kevin was one of the three original employees at American Strategic Insurance, more commonly known as ASI, a property insurance company based in St. Petersburg.\nAfter 21 years at ASI and following the acquisition of ASI by Progressive Insurance Group, Kevin retired from ASI. But long before he retired, he dreamt of owning a craft brewery someday. Kevin was an early enthusiast of craft beers, long before most people had heard of craft beers or microbrews. Before any craft breweries opened locally, Kevin regularly stopped into Shep’s on Fourth Street to pick up new craft beer to sample from around the country.\nKevin, his wife Jeanne, and son Jack love to travel and craft breweries, pubs, beer halls, and beer tours became a significant part of the itinerary wherever they traveled in both the U.S. and Europe. The laid-back environment and large variety of innovative beers at craft breweries presented the ideal combination to spend quality time.\nIn recent years, the brewery stops have become “research” trips. Kevin has incorporated many ideas from breweries and pubs from around the world into his vision for Grand Central Brewhouse, most notably serving beer directly from serving tanks. Kevin has also completed the Brewing Arts Program offered by USF St. Petersburg where he not only learned how to brew beer but gained foundational knowledge of owning and operating a brewery.\nKevin moved to Florida from New York City in 1991 and quickly fell in love with the Tampa Bay area. Away from the brewery, Kevin is very active in the community, sitting on two charitable boards and supporting several local non-profits through the Milkey Family Foundation he established with Jeanne to support local charities in the St. Petersburg area. He is a huge sports fan and enthusiastically supports our Tampa Bay professional teams. An avid runner, Kevin has completed 11 marathons, which helps complement his other passion, beer.\nZac Collins\nHead Brewer\nZac has been at GCB since opening day.  Here’s a little background in his own words: ”As far back as I can remember, I always wanted to be a brewer. I’ve always been a fan of craft beer, along with other luxury intoxicants, but I haven’t always been able to afford them so like any enterprising young gentleman I found a way to get my beers for free. I brewed at St. Pete Brewing Co. and then Arkane Aleworks and now I brew at Grand Central Brewhouse. I always get asked the same questions so I’ll just answer them here; yes, my job is cooler than yours. Yes, I graduated law school and yes, you can find Joe Scribbleshoots modeling pictures online.”\nMatthew O’Connell\nGeneral Manager\nMatt joined the Grand Central Brewhouse team as our General Manager in July 2021.\nHis love for craft beer began while attending Florida State University. While earning his degrees in Entrepreneurship and Business Management, he also took on a Beverage Sciences minor through the school of Hospitality. The classes themselves taught about wine, beer, spirits, and other beverages (Juices, Coffee, Tea) but it was “Ales and Lagers of the World” that changed his entire career path. Matt learned about the world’s many beer drinking regions and the styles that they developed, malting, brewing horticulture, the fermentation process and the distribution chain, but actually getting to drink beer in class and discover the different flavor profiles is what got him obsessed. After class, he used to go to Proof Beer Bar (Before it was a brewery) so that he could further his “research” and also collect the sweet glassware from their brewery giveaways. He became so focused on beer his parents bought him a homebrew recipes book that Christmas and started gathering equipment to brew his very first batch.\nAfter college, Matt moved to Boston, Massachusetts in 2012 and got hired at Harpoon Brewery as a Beer Hall Captain, tending bar, giving tours, selling merchandise and working festivals. After 2 years of city life and 2 of the worst winters on record, Matt headed for greener pastures and warmer weather in Saint Petersburg. He immediately got hired at the new Green Bench Brewing Company in the fall of 2014 and started out as a bartender. Over the next seven years, Matt worked his way through the front of the house, from shift lead, to cider and mead assistant, then event coordinator and finally, General Manager. Along the way he gained extensive knowledge of barrel aging and foeders, wild yeast and mixed culture fermentation, cider and mead production, and an appreciation for lager. He also made some lifelong friends along the way.\nDuring the Pandemic, Matt contemplated a new career path due to all the uncertainty surrounding the Craft Beer Industry and his own fears of burnout. It was then that he got a text from now Head Brewer Zac Collins asking if he was interested in a new role. After two meetings and day to think it over, Matt decided to keep his love of beer alive and join the Grand Central crew to continue his passion for lagers.\nWhen Matt isn’t pouring beers, fixing something around our tasting room or swinging off a ladder changing lightbulbs or hanging decorations, he likes to spend his free time with his beautiful wife Chelsy and their son Aidan. He enjoys traveling, food, video games, dogs, and fishing.\nStacy Maynard\nEvent Planner\nStacy has been beertending at Grand Central Brewhouse since day one. With no previous beertending experience she was equally excited and nervous to share her talents in the craft beer scene and learn more about the beer she enjoys. Her only knowledge of craft beer at this point was based off of informal lessons from friends in the beer industry, specifically at Hops and Props. Stacy continued to work full time at Bank OZK, looking at the brewery job as something fun to do on the side. Stacy quickly became one of the many staff members at GCB who is Cicerone Certified.\nStacy later learned of a position opening at Grand Central Brewhouse for an event planner for public events, which she graciously accepted. She had always thought an event planner role would be fun and more suiting to her personality but wasn’t sure it was in the cards considering her banking and finance background. She was leaving an over 15 year career in banking. Stacy quickly realized this career change was the right move and not long after was asked to take on the private events at GCB as well.\nStacy moved to Tampa Bay at the age of 11 with her family from Trinidad and Tobago and has loved everything Tampa Bay ever since. Outside of the brewery, Stacy is an active volunteer in the community, and with her church. Stacy is a member of the Pink Boots Society and recently attended her first of many Craft Brewers Conferences. She is a huge Green Bay Packers fan, though tries to support the Bucs as much as she can. Though no formal accomplishments, she enjoys rollerblading and biking often.\nEric Trinosky\nBrewer\nEric joined GCB in March 2022 and this is his story: “Some years ago—never mind how long precisely—having little or no money in my purse, and nothing particular to interest me in my current profession, I thought I would give home brewing a try and see what might lay in store for me.  It has now become a way I have of driving off the spleen and regulating the circulation. Working for the last 12 years in the brewing industry, refining my skills and techniques, has culminated in my employment here at Grand Central. I was born in a small town in Central Indiana And I can breathe in that small town Gonna die in a small town Oh, and that’s probably where they’ll bury me.”\nTeamwork Makes the Dream Work:\nThe Collaborative Efforts at Grand Central Brewhouse\nAt GCB, collaboration is key. This passion project began with Kevin Milkey, a former insurance professional turned brewery owner. His vision brought together an experienced team, including brewers Zac Collins and Eric Trinoskey and General Manager Matt O’Connell. Zac and Eric’s brewing expertise blend well with Matt’s extensive experience in craft beer operations and event management.\nThe team at GCB shares ideas and draws inspiration from global brewery visits. A notable feature is serving beer directly from copper serving tanks, a European tradition. This collaborative spirit ensures GCB offers a unique, high-quality experience that sets it apart.\nKevin Milkey\nFounder and CEO\nAfter retiring from a successful career in insurance, Kevin has decided to take his talents to the craft beer industry. Exactly what those talents are remains debatable. But what is not debatable is his love of beer and spending time at craft breweries. Prior to establishing Grand Central Brewhouse, Kevin was one of the three original employees at American Strategic Insurance, more commonly known as ASI, a property insurance company based in St. Petersburg.\nAfter 21 years at ASI and following the acquisition of ASI by Progressive Insurance Group, Kevin retired from ASI. But long before he retired, he dreamt of owning a craft brewery someday. Kevin was an early enthusiast of craft beers, long before most people had heard of craft beers or microbrews. Before any craft breweries opened locally, Kevin regularly stopped into Shep’s on Fourth Street to pick up new craft beer to sample from around the country.\nKevin, his wife Jeanne, and son Jack love to travel and craft breweries, pubs, beer halls, and beer tours became a significant part of the itinerary wherever they traveled in both the U.S. and Europe. The laid-back environment and large variety of innovative beers at craft breweries presented the ideal combination to spend quality time.\nIn recent years, the brewery stops have become “research” trips. Kevin has incorporated many ideas from breweries and pubs from around the world into his vision for Grand Central Brewhouse, most notably serving beer directly from serving tanks. Kevin has also completed the Brewing Arts Program offered by USF St. Petersburg where he not only learned how to brew beer but gained foundational knowledge of owning and operating a brewery.\nKevin moved to Florida from New York City in 1991 and quickly fell in love with the Tampa Bay area. Away from the brewery, Kevin is very active in the community, sitting on two charitable boards and supporting several local non-profits through the Milkey Family Foundation he established with Jeanne to support local charities in the St. Petersburg area. He is a huge sports fan and enthusiastically supports our Tampa Bay professional teams. An avid runner, Kevin has completed 11 marathons, which helps complement his other passion, beer.\nZac Collins\nHead Brewer\nZac has been at GCB since opening day.  Here’s a little background in his own words: ”As far back as I can remember, I always wanted to be a brewer. I’ve always been a fan of craft beer, along with other luxury intoxicants, but I haven’t always been able to afford them so like any enterprising young gentleman I found a way to get my beers for free. I brewed at St. Pete Brewing Co. and then Arkane Aleworks and now I brew at Grand Central Brewhouse. I always get asked the same questions so I’ll just answer them here; yes, my job is cooler than yours. Yes, I graduated law school and yes, you can find Joe Scribbleshoots modeling pictures online.”\nMatthew O’Connell\nGeneral Manager\nMatt joined the Grand Central Brewhouse team as our General Manager in July 2021.\nHis love for craft beer began while attending Florida State University. While earning his degrees in Entrepreneurship and Business Management, he also took on a Beverage Sciences minor through the school of Hospitality. The classes themselves taught about wine, beer, spirits, and other beverages (Juices, Coffee, Tea) but it was “Ales and Lagers of the World” that changed his entire career path. Matt learned about the world’s many beer drinking regions and the styles that they developed, malting, brewing horticulture, the fermentation process and the distribution chain, but actually getting to drink beer in class and discover the different flavor profiles is what got him obsessed. After class, he used to go to Proof Beer Bar (Before it was a brewery) so that he could further his “research” and also collect the sweet glassware from their brewery giveaways. He became so focused on beer his parents bought him a homebrew recipes book that Christmas and started gathering equipment to brew his very first batch.\nAfter college, Matt moved to Boston, Massachusetts in 2012 and got hired at Harpoon Brewery as a Beer Hall Captain, tending bar, giving tours, selling merchandise and working festivals. After 2 years of city life and 2 of the worst winters on record, Matt headed for greener pastures and warmer weather in Saint Petersburg. He immediately got hired at the new Green Bench Brewing Company in the fall of 2014 and started out as a bartender. Over the next seven years, Matt worked his way through the front of the house, from shift lead, to cider and mead assistant, then event coordinator and finally, General Manager. Along the way he gained extensive knowledge of barrel aging and foeders, wild yeast and mixed culture fermentation, cider and mead production, and an appreciation for lager. He also made some lifelong friends along the way.\nDuring the Pandemic, Matt contemplated a new career path due to all the uncertainty surrounding the Craft Beer Industry and his own fears of burnout. It was then that he got a text from now Head Brewer Zac Collins asking if he was interested in a new role. After two meetings and day to think it over, Matt decided to keep his love of beer alive and join the Grand Central crew to continue his passion for lagers.\nWhen Matt isn’t pouring beers, fixing something around our tasting room or swinging off a ladder changing lightbulbs or hanging decorations, he likes to spend his free time with his beautiful wife Chelsy and their son Aidan. He enjoys traveling, food, video games, dogs, and fishing.\nStacy Maynard\nEvent Planner\nStacy has been beertending at Grand Central Brewhouse since day one. With no previous beertending experience she was equally excited and nervous to share her talents in the craft beer scene and learn more about the beer she enjoys. Her only knowledge of craft beer at this point was based off of informal lessons from friends in the beer industry, specifically at Hops and Props. Stacy continued to work full time at Bank OZK, looking at the brewery job as something fun to do on the side. Stacy quickly became one of the many staff members at GCB who is Cicerone Certified.\nStacy later learned of a position opening at Grand Central Brewhouse for an event planner for public events, which she graciously accepted. She had always thought an event planner role would be fun and more suiting to her personality but wasn’t sure it was in the cards considering her banking and finance background. She was leaving an over 15 year career in banking. Stacy quickly realized this career change was the right move and not long after was asked to take on the private events at GCB as well.\nStacy moved to Tampa Bay at the age of 11 with her family from Trinidad and Tobago and has loved everything Tampa Bay ever since. Outside of the brewery, Stacy is an active volunteer in the community, and with her church. Stacy is a member of the Pink Boots Society and recently attended her first of many Craft Brewers Conferences. She is a huge Green Bay Packers fan, though tries to support the Bucs as much as she can. Though no formal accomplishments, she enjoys rollerblading and biking often.\nEric Trinosky\nBrewer\nEric joined GCB in March 2022 and this is his story: “Some years ago—never mind how long precisely—having little or no money in my purse, and nothing particular to interest me in my current profession, I thought I would give home brewing a try and see what might lay in store for me.  It has now become a way I have of driving off the spleen and regulating the circulation. Working for the last 12 years in the brewing industry, refining my skills and techniques, has culminated in my employment here at Grand Central. I was born in a small town in Central Indiana And I can breathe in that small town Gonna die in a small town Oh, and that’s probably where they’ll bury me.”\nMISSION\nTaste the Difference: Grand Central Brewhouse's Mission in Action\nGCB’s mission is evident in every pint. Kevin Milkey’s dedication to craft beer, developed over years of global travel and study, informs the brewery’s approach. Whether it’s an IPA, Lager, Ale, or Sour, each brew aims to deliver distinct flavor profiles to delight your palate. The focus isn’t just on brewing; it’s on creating an experience that showcases the richness and diversity of craft beer.\nServing beer from copper tanks emphasizes freshness and quality, enhancing your tasting experience. This detail underscores GCB’s commitment to bringing innovative brewing techniques to the local community.\nGrand Central Brewhouse was designed to be an integral part of the community; a comfortable neighborhood meeting place, with a variety of indoor and outdoor spaces, highlighted by a large beer garden, from which to relax and enjoy a craft beer with friends and family.  People are the heart of this city and therefore, the heart of our mission. Grand Central Brewhouse will be a spot for the community to come together, make memories, and taste quality, craft beer.\nA place for beer enthusiasts and casual consumers alike, Grand Central Brewhouse’s drink menu features a wide variety of lagers and a full range of ales using the highest quality ingredients available.  Lagers are very under-represented in the craft beer arena, but most beer drinkers prefer lagers, especially on a warm Florida day. So, we will fill the void with a nice selection of light, amber and darker lagers.  Our Ales will include pale ales, IPAs and darker ales such as porters and stouts, wheat beers, plus some funky and sour beers.   Quality and drinkability will be of utmost importance.\nThe Triple Bottom Line\nGrand Central Brewhouse's Recipe for Success\nGCB’s success is built on three pillars: people, planet, and profit. Fair wages and a positive work environment are priorities, reflecting a deep commitment to employee well-being. Sustainability is equally important; GCB integrates eco-friendly practices into daily operations to minimize environmental impact.\nCommunity engagement is another cornerstone. Through the Brew Good program, GCB supports local non-profits, contributing to the broader St. Petersburg community. This holistic approach not only defines GCB’s business model but ensures that every pint poured positively impacts more than just your taste buds.\nGrand Central Brewhouse will be a Triple Bottom Line business.  Of utmost importance to our mission is our goal of Sustainability by equally emphasizing Social and Environmental concerns as well Economic, also known as the three P’s: People, Planet and Profit.  We will measure our success based on our impact on our community and positive impact on the environment in addition to traditional profit margins. For the People/Social Equity bottom line, we will emphasize fair pay, employee well-being and quality of life in addition to giving back to our community. For the Planet/Environmental bottom line, we strive to be stewards of the environment by continually reducing our carbon footprint by utilizing solar power, sky lights and other green building practices in addition to reducing toxins and waste as well as developing water conservation practices. Regarding Profit, to be a successful sustainable organization, the company must be profitable.  Profit is necessary for creating employment, spurring innovation and it plays an integral part in meeting our social and environmental goals.\nCode Of Conduct\nBrews and Behavior: How to Stay in Line with\nGrand Central Brewhouse's Code of Conduct\nGCB maintains a strong code of conduct rooted in respect, inclusivity, and community focus. This isn’t just about brewing great beer—it’s about fostering a welcoming environment. Employees and patrons alike are expected to uphold these values, ensuring everyone enjoys their time at the brewery.\nKevin emphasizes the importance of fair treatment and respect for all, creating a positive atmosphere. This commitment to integrity and quality makes GCB not only a great place to enjoy craft beer but a respectful, welcoming community hub.\nThe following Code of Conduct applies to all: Employees, Customers (taproom, private events, on-line, social media), Accounts, Vendors, Partners, Collaborators, and Contractors. All Grand Central Brewhouse employees are expected to know and follow the Code of Conduct. Failure to do so may result in disciplinary action, up to and including termination of employment.\nValues and Expected Behavior\nAt Grand Central Brewhouse (GCB) we value honesty, integrity, and fairness. We believe in everyone’s right to celebrate, work, relax, and come together to enjoy craft beer in a safe, welcoming environment. Any acts of abuse, homophobia, misogyny, racism, or sexism will not be tolerated. GCB employees are expected to do their utmost to create a supportive work environment, where everyone has the opportunity to reach their fullest potential, and be free from harassment, intimidation, bias, and unlawful discrimination. Our core values are strengthened when every person has a voice and is encouraged to contribute. Equity, diversity, inclusion, and anti-racism are an active process that requires continuous commitment to accomplish our mission.\nUnacceptable Behaviors\nGCB is committed to a workplace free of\nharassment\n,\nbullying\n,\ndiscrimination\n, and\nretaliation\n. We define these acts clearly;\nharassment\nis the act of systematic and/or continued unwanted and annoying actions of one party or group, including threats and demands. Harassment can be any action verbal, visual, or physical that denigrates or shows hostility or aversion towards an individual because of any protected characteristic.\nBullying\nis an ongoing and deliberate misuse of power in relationships through repeated verbal, physical, and/or social behavior that intends to cause physical, social, and/or psychological harm.\nDiscrimination\nis treating a party differently or denying or granting a benefit to an individual because of the individual’s protected characteristic.\nRetaliation\nis when an individual takes negative action against another person who files a formal complaint about discrimination or harassment.\nSafe and Healthy Workplace\nWe are committed to a safe, healthy, and violence-free work environment. Behavior that poses risk to the safety, health or security of GCB employees, our extended workforce, or customers is prohibited. If you become aware of a risk to the safety, health, or security of our workplace, you should report it to a manager or any owner immediately. If it is life-threatening or an emergency, call your local police, fire, or other emergency responders first, and then report it to a manager or owner.\nViolations of Code of Conduct\nViolations will be taken seriously and can result in a written warning, suspension, termination, or other consequences. Employees who repeatedly violate the Code of Conduct will be terminated. Customers who repeatedly violate the Code of Conduct will be banned. Vendors who repeatedly violate the Code of Conduct will no longer be used.\nReporting Violations\nAny reported incidents are immediately investigated by management, and if necessary/requested, an independent party. Employees, vendors, and customers are encouraged to report violations to Kevin Milkey (Owner/CEO), at\n[email protected]\nor Amie Miller (Manager), at\n[email protected]\nin a manner that is most comfortable to them. This can be in-person, in-writing, and/or anonymous. You may also send an email to,\n[email protected]\n.\nSkaFest is back this Saturday!\nLager’s Not Dead: SkaFest Vol. 3 hits Grand Central Brewhouse on Saturday, August 30 from 1 PM to 10 PM, and it’s shaping up to be one of the best yet.\nThe lineup:\n💥 Eric Best – 1 PM - 1:45PM\n💥 Over Wait Mammal – 2 PM - 2:45 PM\n💥 Saganaki Bomb Squad – 3 PM - 3:45 PM\n💥 Chilled Monkey Brains – 4 PM - 5 PM\n💥 Floridaze – 5:15 PM - 6:30 PM\n💥 Control This! – 6:45 PM - 7:45 PM\n💥 Victims of Circumstance – 8 PM - 9:45 PM\nWe’ll have a wide array of fresh lagers pouring all day, a misting tent to keep you cool, and vendors like JB’s Hot Dogs, Churned Ice Cream, and Planet Retro hanging out for the day.\nThis event takes place in the Beer Garden and will be held rain or shine. We have plenty of tent coverage set up for the occasion.\n*Performance times are subject to change.\nSee you at SkaFest!\n36\n0\nOpen post by grandcentralbrewhouse with ID 17981312699736682\n36\n0\nOn Friday, August 29 at 6 PM Ultra Vinyl takes the stage with a set full of hits from across the decades. This Tampa Bay-based cover band brings a polished, high-energy performance that’s perfect for fans of live music you know and love. Whether you’re here to dance or just enjoy a great show with a beer in hand, Ultra Vinyl delivers the soundtrack.\n4\n0\nOpen post by grandcentralbrewhouse with ID 18058524002105109\n4\n0\n21\n2\nOpen post by grandcentralbrewhouse with ID 17853359745469320\n21\n2\nOn Saturday, August 23 at 6 PM The Rich Sheldon Band brings their blend of soulful Americana, folk, and roots rock to Grand Central Brewhouse. With influences ranging from the Grateful Dead and Bob Marley to Dylan and The Beatles, Rich and his band deliver a mix of original tunes, bluesy ballads, and jam-worthy covers that feel timeless.\n7\n0\nOpen post by grandcentralbrewhouse with ID 17975079755875857\n7\n0\nWe’re proud to be a sponsor of the St. Pete Shuffleboard Club, one of the most iconic and community-driven spots in town!\nFall League registration is now open! Get your teams together and lock in your spot:\n•\tMonday Teams League: September 29 - November 17\n•\tTuesday Singles League: September 30 - November 11\n•\tTuesday Rookie Teams League: September 30 - November 18\n•\tWednesday Teams League: October 1 - November 19\nYou’ll see GCB beers poured throughout the season and, if you keep your eyes open, some familiar faces on the courts too. Our Head Brewer Zac has been playing shuffle here for nearly a decade!\nGet signed up and we’ll see you at the courts this fall!\n29\n2\nOpen post by grandcentralbrewhouse with ID 17935484499072826\n29\n2\nWednesday, August 27, St. Pete Stand Up brings their comedy showcase to Grand Central Brewhouse for the very first time. To celebrate, the first 20 tickets are only $5 (plus Eventbrite fees).\nSpend your Wednesday night laughing with some of Florida’s top comedians and enjoy the chance for surprise drop-ins from talent across the country.\nGrab your early tickets at the link in our bio.\n10\n0\nOpen post by grandcentralbrewhouse with ID 17880149421374346\n10\n0\nShoeless Soul joins us this Saturday at 6 PM!\nFormed in 2010 when guitarist and songwriter Rene connected with bassist Sladjan Vidic at an open mic, Shoeless Soul has been crafting a sound all their own for well over a decade.Their music blends reggae, pop, jazz, and rock into something that’s as tight and polished as it is playful and spontaneous.\nTheir shows are filled with catchy hooks, tasteful jams, and an energy that’s impossible not to feel. Named “Best Fusion Band” in Creative Loafing’s Best of the Bay, Shoeless Soul has built a loyal following through their chemistry on stage and their ability to bend genres while keeping every song fresh.\nCome grab a beer and catch a set that promises to be as fun to watch as it is to hear.\n11\n0\nOpen post by grandcentralbrewhouse with ID 18013860500594286\n11\n0\nGCB is entering a new Era. Stay tuned for what we’re dropping soon. 😉\nHint: TS12 - Track 4\n🫶\n151\n8\nOpen post by grandcentralbrewhouse with ID 18051647390624095\n151\n8\nFriday, August 15 at 7 PM, fan favorite Hot Tonic Orchestra returns to the beer garden. Led by Victoria Woods and Josh Hindmarsh, this powerhouse group features a rotating cast of top-tier musicians and delivers a sound that’s been described as Postmodern Jukebox meets Amy Winehouse. Expect jazz fused with Latin rhythms, funk, and soul, all wrapped in fresh, original arrangements\n18\n0\nOpen post by grandcentralbrewhouse with ID 18135603175382491\n18\n0\nFor the third year in a row, we’re heading to Sweden to pour at Brewskival, one of the most exciting beer festivals in the world! It’s an honor to be on the lineup with so many incredible breweries and connect with beer lovers from all over.\nEric’s already booked his ticket. If you’ve ever thought about making the trip, this is the year to do it. Come experience the festival, explore the scene, and share a beer with us in Sweden.\n153\n6\nOpen post by grandcentralbrewhouse with ID 18070767952886637\n153\n6\nSunday, August 10 at 2 PM, Josh’s Jazz Trio returns to the beer garden. Expect smooth grooves, dynamic improvisation, and classic jazz standards performed with style. It’s the perfect way to ease into your afternoon with a world class beer and some top-tier musicianship.\n12\n0\nOpen post by grandcentralbrewhouse with ID 18044348054322557\n12\n0\nSaturday, August 9 at 7 PM, the Brek Milo Trio returns to the beer garden. Brek blends intimate, lyrical songwriting with impressive guitar work, creating a set that is both heartfelt and musically rich. It is a great way to spend a summer evening, filled with thoughtful lyrics, layered melodies, and serious musicianship.\n9\n0\nOpen post by grandcentralbrewhouse with ID 18062152556209604\n9\n0\nLoad More\nBLog\nEmployee Portal\n© Grand Central Brewhouse, St. Petersburg, FL |\nPrivacy Policy\n| Powered & Designed by\nBrewing Sites\nHome\nAbout\nOn Tap\nOur Beer\nFood\nCommunity\nVisit\nEvents\nPrivate Events\nContact\nHome\nAbout\nOn Tap\nOur Beer\nFood\nCommunity\nVisit\nEvents\nPrivate Events\nContact\nFacebook\nInstagram",
      "emails": [
        "info@grandcentralbrew.com"
      ]
    },
    {
      "url": "https://www.grandcentralbrew.com/events/",
      "is_candidate": false,
      "has_email": true,
      "text": "Brewery, Taproom and Beer Garden in St. Petersburg, FL\nBREWERY EVENTS\nCheers to Fun: Discover Exciting Events at Our Craft Beer Brewery\nLooking for the ultimate craft beer brewery experience? Grand Central Brewhouse stands out not only for its exceptional craft beers but also for its dynamic and engaging events. Dive into our lively taproom and immerse yourself in the exciting activities we offer throughout the week.\nTrivia Night Triumphs\nEvery week, join us for an electrifying Trivia Night. Bring your friends, test your knowledge, and enjoy our top-notch craft beers in a spirited atmosphere. The competition heats up with exciting prizes, making for a fun and memorable evening.\nMusic and Relaxation\nOn select nights, immerse yourself in intimate music sessions in our cozy Stammstisch. Enjoy a local singer/songwriter playing a curated selection of tunes, browse through records, and take in the atmosphere while savoring our renowned craft beers. The perfect setting for a relaxed yet engaging evening.\nLive Music Fridays, Saturdays and Sundays\nCelebrate the end of the week and all weekend with live music in our Beer Garden. Discover new artists and enjoy our exceptional craft beers in a vibrant setting. Rain or shine, our indoor space ensures the music and fun continue unabated.\nSpecial Celebrations\nLook out for special occasions at Grand Central Brewhouse that offer unique perks and opportunities to connect with fellow beer enthusiasts. Enjoy our finest craft beers and be part of a community that celebrates great brews and good times.\nAt Grand Central Brewhouse, every visit promises a chance to enjoy outstanding craft beer and vibrant events. Join us at our craft beer brewery and make every pint part of an unforgettable experience.\nUpcoming Events\nComments Box SVG icons\nUsed for the like, share, comment, and reaction icons\nLager's NOT Dead! - SKAFEST Vol. 3\nAug 30,\n1:00pm\n-\nAug 30,\n10:00pm\n2340 Central Avenue, Saint Petersburg, FL, United States, Florida 33712\nMap\nSkaFest is back!!\nLager’s Not Dead: SkaFest Vol. 3 hits Grand Central Brewhouse on Saturday, August 30 from 1 PM to 10 PM, and it’s shaping up to be one of the best yet.\nThe lineup:\n💥 Eric Best – 1 PM - 1:45PM\n💥 Over Wait Mammal – 2 PM - 2:45 PM\n💥 Saganaki Bomb Squad – 3 PM - 3:45 PM\n💥 Chilled Monkey Brains – 4 PM - 5 PM\n💥 Floridaze – 5:15 PM - 6:30 PM\n💥 Control This! – 6:45 PM - 7:45 PM\n💥 Victims of Circumstance – 8 PM - 9:45 PM\nWe’ll have a wide array of fresh lagers pouring all day, a misting tent to keep you cool, and vendors like JB’s Hot Dogs, Churned Ice Cream, and Planet Retro hanging out for the day.\nMark your calendars, tell your friends and family, and make sure to wear your dancing shoes.\nThis is an outdoor event. All precautions will be taken in case of inclement weather. Performance times may vary.\nSee you at SkaFest!\n...\nSee More\nSee Less\n743 interested  ·  96 going\nView on Facebook\n·\nShare Event\nShare on Facebook SkaFest   is   back!!...\nShare on Twitter SkaFest   is   back!!...\nShare on Linked In SkaFest   is   back!!...\nShare by Email SkaFest   is   back!!...\nThe Fernando Cruz Trio Live at GCB!\nAug 31,\n2:00pm\n2340 Central Avenue, Saint Petersburg, FL, United States, Florida 33712\nMap\nOn Sunday, August 31 at 2 PM The Fernando Cruz Trio returns to Grand Central Brewhouse for an afternoon of rich, expressive jazz led by saxophonist, composer, and educator Fernando Cruz. A standout in the Florida music scene, Fernando brings a deep, soulful energy to the stage inspired by legends like Coltrane, Rollins, and Parker. Join us for a performance that blends technical mastery with heartfelt improvisation.\n...\nSee More\nSee Less\n23 interested  ·  1 going\nView on Facebook\n·\nShare Event\nShare on Facebook On   Sunday,   August   31...\nShare on Twitter On   Sunday,   August   31...\nShare on Linked In On   Sunday,   August   31...\nShare by Email On   Sunday,   August   31...\nPinellas Run Club\nSep 4,\n6:30pm\n2340 Central Avenue, Saint Petersburg, FL, United States, Florida 33712\nMap\nPinellas Run Club meets on September 4th at 6:30 PM right here at the brewery. After a quick overview, runners and walkers head out for a their chosen distance route. After the run enjoy $2 off GCB beers. It’s one of the biggest run clubs in the area and always a great time.\n20 interested  ·  4 going\nView on Facebook\n·\nShare Event\nShare on Facebook Pinellas   Run   Club  ...\nShare on Twitter Pinellas   Run   Club  ...\nShare on Linked In Pinellas   Run   Club  ...\nShare by Email Pinellas   Run   Club  ...\nCrisis the Jazz Project Live at GCB!\nSep 5,\n6:00pm\n2340 Central Avenue, Saint Petersburg, FL, United States, Florida 33712\nMap\nOn Friday, September 5 at 6 PM Crisis the Jazz Project returns to GCB!\nIf you haven’t heard of them before, they are a jazz project featuring members of well-known Tampa Bay bands stepping outside their usual sound. Blending their backgrounds into something unexpected, this group brings a fresh take on jazz with familiar faces in less familiar territory. Catch them live and see what happens when musicians push past the edges of their genre.\n...\nSee More\nSee Less\n34 interested  ·  1 going\nView on Facebook\n·\nShare Event\nShare on Facebook On   Friday,   September...\nShare on Twitter On   Friday,   September...\nShare on Linked In On   Friday,   September...\nShare by Email On   Friday,   September...\nSpeak Easy Live at GCB!\nSep 6,\n7:00pm\n2340 Central Avenue, Saint Petersburg, FL, United States, Florida 33712\nMap\nSpeak Easy returns to GCB On September 6th at 7PM with their signature blend of groove-heavy rhythm, catchy lyrics, and high-energy performance. Since forming at USFSP in 2017, they’ve become a staple of the St. Pete music scene and have played stages across Florida including Gasparilla Music Fest, Clearwater Jazz Fest, and the Floridian Social Club. Expect electric guitar solos, tight harmonies, and a sound that’s sure to move a crowd.\n...\nSee More\nSee Less\n7 interested  ·  1 going\nView on Facebook\n·\nShare Event\nShare on Facebook Speak   Easy   returns  ...\nShare on Twitter Speak   Easy   returns  ...\nShare on Linked In Speak   Easy   returns  ...\nShare by Email Speak   Easy   returns  ...\nThe Sundaes Live at GCB!\nSep 7,\n5:00pm\n2340 Central Avenue, Saint Petersburg, FL, United States, Florida 33712\nMap\nJoin us on Sunday, September 7 at 5 PM when The Sundaes take the stage for a Sunday night set you won’t want to miss. If you could piece together a supergroup whose harmonies could stretch the weekend just a little longer, this would be it. Each member brings their own talent and energy, coming together to create a sound that feels equal parts timeless and feel-good. Come hang.\n41 interested  ·  7 going\nView on Facebook\n·\nShare Event\nShare on Facebook Join   us   on   Sunday,  ...\nShare on Twitter Join   us   on   Sunday,  ...\nShare on Linked In Join   us   on   Sunday,  ...\nShare by Email Join   us   on   Sunday,  ...\nLoad more\nSkaFest is back this Saturday!\nLager’s Not Dead: SkaFest Vol. 3 hits Grand Central Brewhouse on Saturday, August 30 from 1 PM to 10 PM, and it’s shaping up to be one of the best yet.\nThe lineup:\n💥 Eric Best – 1 PM - 1:45PM\n💥 Over Wait Mammal – 2 PM - 2:45 PM\n💥 Saganaki Bomb Squad – 3 PM - 3:45 PM\n💥 Chilled Monkey Brains – 4 PM - 5 PM\n💥 Floridaze – 5:15 PM - 6:30 PM\n💥 Control This! – 6:45 PM - 7:45 PM\n💥 Victims of Circumstance – 8 PM - 9:45 PM\nWe’ll have a wide array of fresh lagers pouring all day, a misting tent to keep you cool, and vendors like JB’s Hot Dogs, Churned Ice Cream, and Planet Retro hanging out for the day.\nThis event takes place in the Beer Garden and will be held rain or shine. We have plenty of tent coverage set up for the occasion.\n*Performance times are subject to change.\nSee you at SkaFest!\n36\n0\nOpen post by grandcentralbrewhouse with ID 17981312699736682\n36\n0\nOn Friday, August 29 at 6 PM Ultra Vinyl takes the stage with a set full of hits from across the decades. This Tampa Bay-based cover band brings a polished, high-energy performance that’s perfect for fans of live music you know and love. Whether you’re here to dance or just enjoy a great show with a beer in hand, Ultra Vinyl delivers the soundtrack.\n4\n0\nOpen post by grandcentralbrewhouse with ID 18058524002105109\n4\n0\n21\n2\nOpen post by grandcentralbrewhouse with ID 17853359745469320\n21\n2\nOn Saturday, August 23 at 6 PM The Rich Sheldon Band brings their blend of soulful Americana, folk, and roots rock to Grand Central Brewhouse. With influences ranging from the Grateful Dead and Bob Marley to Dylan and The Beatles, Rich and his band deliver a mix of original tunes, bluesy ballads, and jam-worthy covers that feel timeless.\n7\n0\nOpen post by grandcentralbrewhouse with ID 17975079755875857\n7\n0\nWe’re proud to be a sponsor of the St. Pete Shuffleboard Club, one of the most iconic and community-driven spots in town!\nFall League registration is now open! Get your teams together and lock in your spot:\n•\tMonday Teams League: September 29 - November 17\n•\tTuesday Singles League: September 30 - November 11\n•\tTuesday Rookie Teams League: September 30 - November 18\n•\tWednesday Teams League: October 1 - November 19\nYou’ll see GCB beers poured throughout the season and, if you keep your eyes open, some familiar faces on the courts too. Our Head Brewer Zac has been playing shuffle here for nearly a decade!\nGet signed up and we’ll see you at the courts this fall!\n29\n2\nOpen post by grandcentralbrewhouse with ID 17935484499072826\n29\n2\nWednesday, August 27, St. Pete Stand Up brings their comedy showcase to Grand Central Brewhouse for the very first time. To celebrate, the first 20 tickets are only $5 (plus Eventbrite fees).\nSpend your Wednesday night laughing with some of Florida’s top comedians and enjoy the chance for surprise drop-ins from talent across the country.\nGrab your early tickets at the link in our bio.\n10\n0\nOpen post by grandcentralbrewhouse with ID 17880149421374346\n10\n0\nShoeless Soul joins us this Saturday at 6 PM!\nFormed in 2010 when guitarist and songwriter Rene connected with bassist Sladjan Vidic at an open mic, Shoeless Soul has been crafting a sound all their own for well over a decade.Their music blends reggae, pop, jazz, and rock into something that’s as tight and polished as it is playful and spontaneous.\nTheir shows are filled with catchy hooks, tasteful jams, and an energy that’s impossible not to feel. Named “Best Fusion Band” in Creative Loafing’s Best of the Bay, Shoeless Soul has built a loyal following through their chemistry on stage and their ability to bend genres while keeping every song fresh.\nCome grab a beer and catch a set that promises to be as fun to watch as it is to hear.\n11\n0\nOpen post by grandcentralbrewhouse with ID 18013860500594286\n11\n0\nGCB is entering a new Era. Stay tuned for what we’re dropping soon. 😉\nHint: TS12 - Track 4\n🫶\n151\n8\nOpen post by grandcentralbrewhouse with ID 18051647390624095\n151\n8\nFriday, August 15 at 7 PM, fan favorite Hot Tonic Orchestra returns to the beer garden. Led by Victoria Woods and Josh Hindmarsh, this powerhouse group features a rotating cast of top-tier musicians and delivers a sound that’s been described as Postmodern Jukebox meets Amy Winehouse. Expect jazz fused with Latin rhythms, funk, and soul, all wrapped in fresh, original arrangements\n18\n0\nOpen post by grandcentralbrewhouse with ID 18135603175382491\n18\n0\nFor the third year in a row, we’re heading to Sweden to pour at Brewskival, one of the most exciting beer festivals in the world! It’s an honor to be on the lineup with so many incredible breweries and connect with beer lovers from all over.\nEric’s already booked his ticket. If you’ve ever thought about making the trip, this is the year to do it. Come experience the festival, explore the scene, and share a beer with us in Sweden.\n153\n6\nOpen post by grandcentralbrewhouse with ID 18070767952886637\n153\n6\nSunday, August 10 at 2 PM, Josh’s Jazz Trio returns to the beer garden. Expect smooth grooves, dynamic improvisation, and classic jazz standards performed with style. It’s the perfect way to ease into your afternoon with a world class beer and some top-tier musicianship.\n12\n0\nOpen post by grandcentralbrewhouse with ID 18044348054322557\n12\n0\nSaturday, August 9 at 7 PM, the Brek Milo Trio returns to the beer garden. Brek blends intimate, lyrical songwriting with impressive guitar work, creating a set that is both heartfelt and musically rich. It is a great way to spend a summer evening, filled with thoughtful lyrics, layered melodies, and serious musicianship.\n9\n0\nOpen post by grandcentralbrewhouse with ID 18062152556209604\n9\n0\nLoad More\nBLog\nEmployee Portal\n© Grand Central Brewhouse, St. Petersburg, FL |\nPrivacy Policy\n| Powered & Designed by\nBrewing Sites\nHome\nAbout\nOn Tap\nOur Beer\nFood\nCommunity\nVisit\nEvents\nPrivate Events\nContact\nHome\nAbout\nOn Tap\nOur Beer\nFood\nCommunity\nVisit\nEvents\nPrivate Events\nContact\nFacebook\nInstagram",
      "emails": [
        "info@grandcentralbrew.com"
      ]
    },
    {
      "url": "https://www.grandcentralbrew.com/about/#team",
      "is_candidate": false,
      "has_email": true,
      "text": "Brewery, Taproom and Beer Garden in St. Petersburg, FL\nGrand Central Brewhouse Overview\nGrand Central Brewhouse is a cornerstone of St. Pete’s Grand Central District, offering specialty craft beers and a community-focused environment. The brewery is known for its quality lagers and ales, welcoming spaces, and engaging local events.\nHistory and Philosophy\nLocated in St. Petersburg, Florida, Grand Central Brewhouse was established to foster community and craft high-quality beers. It operates on a philosophy of giving back, donating a portion of proceeds to local charities.\nThe emphasis is on tradition and quality ingredients, ensuring that every beer honors its roots. The two-story establishment features a taproom and beer garden, making it an inviting space for all.\nBrewing Process and Techniques\nGrand Central Brewhouse takes pride in its meticulous brewing process. Using time-honored ingredients, the brewery offers a range of artisanal lagers. European serving tank technology ensures each beer’s distinct flavors are perfectly preserved from tank to glass.\nFrom golden and crisp to dark and malty, their beers cater to diverse tastes. The emphasis on quality is evident in every aspect, right down to the thoughtfully selected glassware.\nLocation and Community\nSituated steps away from Central Avenue, the brewery provides an urban retreat with expansive indoor and outdoor spaces. The dog-friendly environment encourages bonding and memory-making among visitors.\nFood from LALA St. Pete complements the beer experience. The venue also offers options for private events, making it a versatile space for community gatherings.\nGCB’s origins stem from a simple love of beer and craft breweries.  After many years in the insurance business, Owner and Founder Kevin Milkey wanted to establish a new craft brewery in the community he feels very passionate about.  The initial plan was to follow the path of most US craft breweries and convert an old warehouse, gas station, garage, or factory into a brewery, but then Kevin came across a large vacant lot for sale on Central Avenue in the heart of the Grand Central District and thought that was a perfect location for a new brewery.   While discussing initial architectural plans with architect Tim Clemmons, we determined that the lot was big enough for two buildings, the second of which could be a restaurant which would provide food service for the brewery customers. So, what started out as an idea to renovate an old building into a small brewery became a new construction project with not one, but two buildings, each with a second floor and terrace and a large beer garden out back.\nLong before GCB opened, breweries and pubs were a frequent destination when\ntraveling. Many ideas incorporated into Grand Central Brewhouse came from\nvisits to breweries and pubs from around the world. The most notable being\nserving beer directly from serving tanks, which is more common in Europe\nthan in the US. The shiny copper serving tanks suspended above the main bar\nis the first thing your eyes are drawn to when entering GCB. In addition to\nthe design features of the brewery, our story is not complete without\nmentioning the emphasis of employees and giving back to the community. The\ngoal was to establish a new brewery with a focus on the employees, with an\nemphasis on fair pay, employee well-being and quality of life. Employees\nare the heart of any business, and it’s of utmost importance that everyone\nis treated fairly and with respect in a work environment where people are\nhappy at work. Lastly, sustainability and giving back to the community are\ningrained in our culture. Additional information about our community\ninitiatives and sustainability can be found in the Community section of\nthis website.\nOUR TEAM\nInside Look: The Grand Central Brewhouse Story\nGrand Central Brewhouse (GCB) combines a passion for craft beer with innovative brewing techniques and community-focused initiatives. Discover how GCB’s collaborative team, mission-driven approach, commitment to sustainability, and strong code of conduct make it a standout in the craft beer industry.\nKevin Milkey\nFounder and CEO\nAfter retiring from a successful career in insurance, Kevin has decided to take his talents to the craft beer industry. Exactly what those talents are remains debatable. But what is not debatable is his love of beer and spending time at craft breweries. Prior to establishing Grand Central Brewhouse, Kevin was one of the three original employees at American Strategic Insurance, more commonly known as ASI, a property insurance company based in St. Petersburg.\nAfter 21 years at ASI and following the acquisition of ASI by Progressive Insurance Group, Kevin retired from ASI. But long before he retired, he dreamt of owning a craft brewery someday. Kevin was an early enthusiast of craft beers, long before most people had heard of craft beers or microbrews. Before any craft breweries opened locally, Kevin regularly stopped into Shep’s on Fourth Street to pick up new craft beer to sample from around the country.\nKevin, his wife Jeanne, and son Jack love to travel and craft breweries, pubs, beer halls, and beer tours became a significant part of the itinerary wherever they traveled in both the U.S. and Europe. The laid-back environment and large variety of innovative beers at craft breweries presented the ideal combination to spend quality time.\nIn recent years, the brewery stops have become “research” trips. Kevin has incorporated many ideas from breweries and pubs from around the world into his vision for Grand Central Brewhouse, most notably serving beer directly from serving tanks. Kevin has also completed the Brewing Arts Program offered by USF St. Petersburg where he not only learned how to brew beer but gained foundational knowledge of owning and operating a brewery.\nKevin moved to Florida from New York City in 1991 and quickly fell in love with the Tampa Bay area. Away from the brewery, Kevin is very active in the community, sitting on two charitable boards and supporting several local non-profits through the Milkey Family Foundation he established with Jeanne to support local charities in the St. Petersburg area. He is a huge sports fan and enthusiastically supports our Tampa Bay professional teams. An avid runner, Kevin has completed 11 marathons, which helps complement his other passion, beer.\nZac Collins\nHead Brewer\nZac has been at GCB since opening day.  Here’s a little background in his own words: ”As far back as I can remember, I always wanted to be a brewer. I’ve always been a fan of craft beer, along with other luxury intoxicants, but I haven’t always been able to afford them so like any enterprising young gentleman I found a way to get my beers for free. I brewed at St. Pete Brewing Co. and then Arkane Aleworks and now I brew at Grand Central Brewhouse. I always get asked the same questions so I’ll just answer them here; yes, my job is cooler than yours. Yes, I graduated law school and yes, you can find Joe Scribbleshoots modeling pictures online.”\nMatthew O’Connell\nGeneral Manager\nMatt joined the Grand Central Brewhouse team as our General Manager in July 2021.\nHis love for craft beer began while attending Florida State University. While earning his degrees in Entrepreneurship and Business Management, he also took on a Beverage Sciences minor through the school of Hospitality. The classes themselves taught about wine, beer, spirits, and other beverages (Juices, Coffee, Tea) but it was “Ales and Lagers of the World” that changed his entire career path. Matt learned about the world’s many beer drinking regions and the styles that they developed, malting, brewing horticulture, the fermentation process and the distribution chain, but actually getting to drink beer in class and discover the different flavor profiles is what got him obsessed. After class, he used to go to Proof Beer Bar (Before it was a brewery) so that he could further his “research” and also collect the sweet glassware from their brewery giveaways. He became so focused on beer his parents bought him a homebrew recipes book that Christmas and started gathering equipment to brew his very first batch.\nAfter college, Matt moved to Boston, Massachusetts in 2012 and got hired at Harpoon Brewery as a Beer Hall Captain, tending bar, giving tours, selling merchandise and working festivals. After 2 years of city life and 2 of the worst winters on record, Matt headed for greener pastures and warmer weather in Saint Petersburg. He immediately got hired at the new Green Bench Brewing Company in the fall of 2014 and started out as a bartender. Over the next seven years, Matt worked his way through the front of the house, from shift lead, to cider and mead assistant, then event coordinator and finally, General Manager. Along the way he gained extensive knowledge of barrel aging and foeders, wild yeast and mixed culture fermentation, cider and mead production, and an appreciation for lager. He also made some lifelong friends along the way.\nDuring the Pandemic, Matt contemplated a new career path due to all the uncertainty surrounding the Craft Beer Industry and his own fears of burnout. It was then that he got a text from now Head Brewer Zac Collins asking if he was interested in a new role. After two meetings and day to think it over, Matt decided to keep his love of beer alive and join the Grand Central crew to continue his passion for lagers.\nWhen Matt isn’t pouring beers, fixing something around our tasting room or swinging off a ladder changing lightbulbs or hanging decorations, he likes to spend his free time with his beautiful wife Chelsy and their son Aidan. He enjoys traveling, food, video games, dogs, and fishing.\nStacy Maynard\nEvent Planner\nStacy has been beertending at Grand Central Brewhouse since day one. With no previous beertending experience she was equally excited and nervous to share her talents in the craft beer scene and learn more about the beer she enjoys. Her only knowledge of craft beer at this point was based off of informal lessons from friends in the beer industry, specifically at Hops and Props. Stacy continued to work full time at Bank OZK, looking at the brewery job as something fun to do on the side. Stacy quickly became one of the many staff members at GCB who is Cicerone Certified.\nStacy later learned of a position opening at Grand Central Brewhouse for an event planner for public events, which she graciously accepted. She had always thought an event planner role would be fun and more suiting to her personality but wasn’t sure it was in the cards considering her banking and finance background. She was leaving an over 15 year career in banking. Stacy quickly realized this career change was the right move and not long after was asked to take on the private events at GCB as well.\nStacy moved to Tampa Bay at the age of 11 with her family from Trinidad and Tobago and has loved everything Tampa Bay ever since. Outside of the brewery, Stacy is an active volunteer in the community, and with her church. Stacy is a member of the Pink Boots Society and recently attended her first of many Craft Brewers Conferences. She is a huge Green Bay Packers fan, though tries to support the Bucs as much as she can. Though no formal accomplishments, she enjoys rollerblading and biking often.\nEric Trinosky\nBrewer\nEric joined GCB in March 2022 and this is his story: “Some years ago—never mind how long precisely—having little or no money in my purse, and nothing particular to interest me in my current profession, I thought I would give home brewing a try and see what might lay in store for me.  It has now become a way I have of driving off the spleen and regulating the circulation. Working for the last 12 years in the brewing industry, refining my skills and techniques, has culminated in my employment here at Grand Central. I was born in a small town in Central Indiana And I can breathe in that small town Gonna die in a small town Oh, and that’s probably where they’ll bury me.”\nTeamwork Makes the Dream Work:\nThe Collaborative Efforts at Grand Central Brewhouse\nAt GCB, collaboration is key. This passion project began with Kevin Milkey, a former insurance professional turned brewery owner. His vision brought together an experienced team, including brewers Zac Collins and Eric Trinoskey and General Manager Matt O’Connell. Zac and Eric’s brewing expertise blend well with Matt’s extensive experience in craft beer operations and event management.\nThe team at GCB shares ideas and draws inspiration from global brewery visits. A notable feature is serving beer directly from copper serving tanks, a European tradition. This collaborative spirit ensures GCB offers a unique, high-quality experience that sets it apart.\nKevin Milkey\nFounder and CEO\nAfter retiring from a successful career in insurance, Kevin has decided to take his talents to the craft beer industry. Exactly what those talents are remains debatable. But what is not debatable is his love of beer and spending time at craft breweries. Prior to establishing Grand Central Brewhouse, Kevin was one of the three original employees at American Strategic Insurance, more commonly known as ASI, a property insurance company based in St. Petersburg.\nAfter 21 years at ASI and following the acquisition of ASI by Progressive Insurance Group, Kevin retired from ASI. But long before he retired, he dreamt of owning a craft brewery someday. Kevin was an early enthusiast of craft beers, long before most people had heard of craft beers or microbrews. Before any craft breweries opened locally, Kevin regularly stopped into Shep’s on Fourth Street to pick up new craft beer to sample from around the country.\nKevin, his wife Jeanne, and son Jack love to travel and craft breweries, pubs, beer halls, and beer tours became a significant part of the itinerary wherever they traveled in both the U.S. and Europe. The laid-back environment and large variety of innovative beers at craft breweries presented the ideal combination to spend quality time.\nIn recent years, the brewery stops have become “research” trips. Kevin has incorporated many ideas from breweries and pubs from around the world into his vision for Grand Central Brewhouse, most notably serving beer directly from serving tanks. Kevin has also completed the Brewing Arts Program offered by USF St. Petersburg where he not only learned how to brew beer but gained foundational knowledge of owning and operating a brewery.\nKevin moved to Florida from New York City in 1991 and quickly fell in love with the Tampa Bay area. Away from the brewery, Kevin is very active in the community, sitting on two charitable boards and supporting several local non-profits through the Milkey Family Foundation he established with Jeanne to support local charities in the St. Petersburg area. He is a huge sports fan and enthusiastically supports our Tampa Bay professional teams. An avid runner, Kevin has completed 11 marathons, which helps complement his other passion, beer.\nZac Collins\nHead Brewer\nZac has been at GCB since opening day.  Here’s a little background in his own words: ”As far back as I can remember, I always wanted to be a brewer. I’ve always been a fan of craft beer, along with other luxury intoxicants, but I haven’t always been able to afford them so like any enterprising young gentleman I found a way to get my beers for free. I brewed at St. Pete Brewing Co. and then Arkane Aleworks and now I brew at Grand Central Brewhouse. I always get asked the same questions so I’ll just answer them here; yes, my job is cooler than yours. Yes, I graduated law school and yes, you can find Joe Scribbleshoots modeling pictures online.”\nMatthew O’Connell\nGeneral Manager\nMatt joined the Grand Central Brewhouse team as our General Manager in July 2021.\nHis love for craft beer began while attending Florida State University. While earning his degrees in Entrepreneurship and Business Management, he also took on a Beverage Sciences minor through the school of Hospitality. The classes themselves taught about wine, beer, spirits, and other beverages (Juices, Coffee, Tea) but it was “Ales and Lagers of the World” that changed his entire career path. Matt learned about the world’s many beer drinking regions and the styles that they developed, malting, brewing horticulture, the fermentation process and the distribution chain, but actually getting to drink beer in class and discover the different flavor profiles is what got him obsessed. After class, he used to go to Proof Beer Bar (Before it was a brewery) so that he could further his “research” and also collect the sweet glassware from their brewery giveaways. He became so focused on beer his parents bought him a homebrew recipes book that Christmas and started gathering equipment to brew his very first batch.\nAfter college, Matt moved to Boston, Massachusetts in 2012 and got hired at Harpoon Brewery as a Beer Hall Captain, tending bar, giving tours, selling merchandise and working festivals. After 2 years of city life and 2 of the worst winters on record, Matt headed for greener pastures and warmer weather in Saint Petersburg. He immediately got hired at the new Green Bench Brewing Company in the fall of 2014 and started out as a bartender. Over the next seven years, Matt worked his way through the front of the house, from shift lead, to cider and mead assistant, then event coordinator and finally, General Manager. Along the way he gained extensive knowledge of barrel aging and foeders, wild yeast and mixed culture fermentation, cider and mead production, and an appreciation for lager. He also made some lifelong friends along the way.\nDuring the Pandemic, Matt contemplated a new career path due to all the uncertainty surrounding the Craft Beer Industry and his own fears of burnout. It was then that he got a text from now Head Brewer Zac Collins asking if he was interested in a new role. After two meetings and day to think it over, Matt decided to keep his love of beer alive and join the Grand Central crew to continue his passion for lagers.\nWhen Matt isn’t pouring beers, fixing something around our tasting room or swinging off a ladder changing lightbulbs or hanging decorations, he likes to spend his free time with his beautiful wife Chelsy and their son Aidan. He enjoys traveling, food, video games, dogs, and fishing.\nStacy Maynard\nEvent Planner\nStacy has been beertending at Grand Central Brewhouse since day one. With no previous beertending experience she was equally excited and nervous to share her talents in the craft beer scene and learn more about the beer she enjoys. Her only knowledge of craft beer at this point was based off of informal lessons from friends in the beer industry, specifically at Hops and Props. Stacy continued to work full time at Bank OZK, looking at the brewery job as something fun to do on the side. Stacy quickly became one of the many staff members at GCB who is Cicerone Certified.\nStacy later learned of a position opening at Grand Central Brewhouse for an event planner for public events, which she graciously accepted. She had always thought an event planner role would be fun and more suiting to her personality but wasn’t sure it was in the cards considering her banking and finance background. She was leaving an over 15 year career in banking. Stacy quickly realized this career change was the right move and not long after was asked to take on the private events at GCB as well.\nStacy moved to Tampa Bay at the age of 11 with her family from Trinidad and Tobago and has loved everything Tampa Bay ever since. Outside of the brewery, Stacy is an active volunteer in the community, and with her church. Stacy is a member of the Pink Boots Society and recently attended her first of many Craft Brewers Conferences. She is a huge Green Bay Packers fan, though tries to support the Bucs as much as she can. Though no formal accomplishments, she enjoys rollerblading and biking often.\nEric Trinosky\nBrewer\nEric joined GCB in March 2022 and this is his story: “Some years ago—never mind how long precisely—having little or no money in my purse, and nothing particular to interest me in my current profession, I thought I would give home brewing a try and see what might lay in store for me.  It has now become a way I have of driving off the spleen and regulating the circulation. Working for the last 12 years in the brewing industry, refining my skills and techniques, has culminated in my employment here at Grand Central. I was born in a small town in Central Indiana And I can breathe in that small town Gonna die in a small town Oh, and that’s probably where they’ll bury me.”\nMISSION\nTaste the Difference: Grand Central Brewhouse's Mission in Action\nGCB’s mission is evident in every pint. Kevin Milkey’s dedication to craft beer, developed over years of global travel and study, informs the brewery’s approach. Whether it’s an IPA, Lager, Ale, or Sour, each brew aims to deliver distinct flavor profiles to delight your palate. The focus isn’t just on brewing; it’s on creating an experience that showcases the richness and diversity of craft beer.\nServing beer from copper tanks emphasizes freshness and quality, enhancing your tasting experience. This detail underscores GCB’s commitment to bringing innovative brewing techniques to the local community.\nGrand Central Brewhouse was designed to be an integral part of the community; a comfortable neighborhood meeting place, with a variety of indoor and outdoor spaces, highlighted by a large beer garden, from which to relax and enjoy a craft beer with friends and family.  People are the heart of this city and therefore, the heart of our mission. Grand Central Brewhouse will be a spot for the community to come together, make memories, and taste quality, craft beer.\nA place for beer enthusiasts and casual consumers alike, Grand Central Brewhouse’s drink menu features a wide variety of lagers and a full range of ales using the highest quality ingredients available.  Lagers are very under-represented in the craft beer arena, but most beer drinkers prefer lagers, especially on a warm Florida day. So, we will fill the void with a nice selection of light, amber and darker lagers.  Our Ales will include pale ales, IPAs and darker ales such as porters and stouts, wheat beers, plus some funky and sour beers.   Quality and drinkability will be of utmost importance.\nThe Triple Bottom Line\nGrand Central Brewhouse's Recipe for Success\nGCB’s success is built on three pillars: people, planet, and profit. Fair wages and a positive work environment are priorities, reflecting a deep commitment to employee well-being. Sustainability is equally important; GCB integrates eco-friendly practices into daily operations to minimize environmental impact.\nCommunity engagement is another cornerstone. Through the Brew Good program, GCB supports local non-profits, contributing to the broader St. Petersburg community. This holistic approach not only defines GCB’s business model but ensures that every pint poured positively impacts more than just your taste buds.\nGrand Central Brewhouse will be a Triple Bottom Line business.  Of utmost importance to our mission is our goal of Sustainability by equally emphasizing Social and Environmental concerns as well Economic, also known as the three P’s: People, Planet and Profit.  We will measure our success based on our impact on our community and positive impact on the environment in addition to traditional profit margins. For the People/Social Equity bottom line, we will emphasize fair pay, employee well-being and quality of life in addition to giving back to our community. For the Planet/Environmental bottom line, we strive to be stewards of the environment by continually reducing our carbon footprint by utilizing solar power, sky lights and other green building practices in addition to reducing toxins and waste as well as developing water conservation practices. Regarding Profit, to be a successful sustainable organization, the company must be profitable.  Profit is necessary for creating employment, spurring innovation and it plays an integral part in meeting our social and environmental goals.\nCode Of Conduct\nBrews and Behavior: How to Stay in Line with\nGrand Central Brewhouse's Code of Conduct\nGCB maintains a strong code of conduct rooted in respect, inclusivity, and community focus. This isn’t just about brewing great beer—it’s about fostering a welcoming environment. Employees and patrons alike are expected to uphold these values, ensuring everyone enjoys their time at the brewery.\nKevin emphasizes the importance of fair treatment and respect for all, creating a positive atmosphere. This commitment to integrity and quality makes GCB not only a great place to enjoy craft beer but a respectful, welcoming community hub.\nThe following Code of Conduct applies to all: Employees, Customers (taproom, private events, on-line, social media), Accounts, Vendors, Partners, Collaborators, and Contractors. All Grand Central Brewhouse employees are expected to know and follow the Code of Conduct. Failure to do so may result in disciplinary action, up to and including termination of employment.\nValues and Expected Behavior\nAt Grand Central Brewhouse (GCB) we value honesty, integrity, and fairness. We believe in everyone’s right to celebrate, work, relax, and come together to enjoy craft beer in a safe, welcoming environment. Any acts of abuse, homophobia, misogyny, racism, or sexism will not be tolerated. GCB employees are expected to do their utmost to create a supportive work environment, where everyone has the opportunity to reach their fullest potential, and be free from harassment, intimidation, bias, and unlawful discrimination. Our core values are strengthened when every person has a voice and is encouraged to contribute. Equity, diversity, inclusion, and anti-racism are an active process that requires continuous commitment to accomplish our mission.\nUnacceptable Behaviors\nGCB is committed to a workplace free of\nharassment\n,\nbullying\n,\ndiscrimination\n, and\nretaliation\n. We define these acts clearly;\nharassment\nis the act of systematic and/or continued unwanted and annoying actions of one party or group, including threats and demands. Harassment can be any action verbal, visual, or physical that denigrates or shows hostility or aversion towards an individual because of any protected characteristic.\nBullying\nis an ongoing and deliberate misuse of power in relationships through repeated verbal, physical, and/or social behavior that intends to cause physical, social, and/or psychological harm.\nDiscrimination\nis treating a party differently or denying or granting a benefit to an individual because of the individual’s protected characteristic.\nRetaliation\nis when an individual takes negative action against another person who files a formal complaint about discrimination or harassment.\nSafe and Healthy Workplace\nWe are committed to a safe, healthy, and violence-free work environment. Behavior that poses risk to the safety, health or security of GCB employees, our extended workforce, or customers is prohibited. If you become aware of a risk to the safety, health, or security of our workplace, you should report it to a manager or any owner immediately. If it is life-threatening or an emergency, call your local police, fire, or other emergency responders first, and then report it to a manager or owner.\nViolations of Code of Conduct\nViolations will be taken seriously and can result in a written warning, suspension, termination, or other consequences. Employees who repeatedly violate the Code of Conduct will be terminated. Customers who repeatedly violate the Code of Conduct will be banned. Vendors who repeatedly violate the Code of Conduct will no longer be used.\nReporting Violations\nAny reported incidents are immediately investigated by management, and if necessary/requested, an independent party. Employees, vendors, and customers are encouraged to report violations to Kevin Milkey (Owner/CEO), at\n[email protected]\nor Amie Miller (Manager), at\n[email protected]\nin a manner that is most comfortable to them. This can be in-person, in-writing, and/or anonymous. You may also send an email to,\n[email protected]\n.\nSkaFest is back this Saturday!\nLager’s Not Dead: SkaFest Vol. 3 hits Grand Central Brewhouse on Saturday, August 30 from 1 PM to 10 PM, and it’s shaping up to be one of the best yet.\nThe lineup:\n💥 Eric Best – 1 PM - 1:45PM\n💥 Over Wait Mammal – 2 PM - 2:45 PM\n💥 Saganaki Bomb Squad – 3 PM - 3:45 PM\n💥 Chilled Monkey Brains – 4 PM - 5 PM\n💥 Floridaze – 5:15 PM - 6:30 PM\n💥 Control This! – 6:45 PM - 7:45 PM\n💥 Victims of Circumstance – 8 PM - 9:45 PM\nWe’ll have a wide array of fresh lagers pouring all day, a misting tent to keep you cool, and vendors like JB’s Hot Dogs, Churned Ice Cream, and Planet Retro hanging out for the day.\nThis event takes place in the Beer Garden and will be held rain or shine. We have plenty of tent coverage set up for the occasion.\n*Performance times are subject to change.\nSee you at SkaFest!\n36\n0\nOpen post by grandcentralbrewhouse with ID 17981312699736682\n36\n0\nOn Friday, August 29 at 6 PM Ultra Vinyl takes the stage with a set full of hits from across the decades. This Tampa Bay-based cover band brings a polished, high-energy performance that’s perfect for fans of live music you know and love. Whether you’re here to dance or just enjoy a great show with a beer in hand, Ultra Vinyl delivers the soundtrack.\n4\n0\nOpen post by grandcentralbrewhouse with ID 18058524002105109\n4\n0\n21\n2\nOpen post by grandcentralbrewhouse with ID 17853359745469320\n21\n2\nOn Saturday, August 23 at 6 PM The Rich Sheldon Band brings their blend of soulful Americana, folk, and roots rock to Grand Central Brewhouse. With influences ranging from the Grateful Dead and Bob Marley to Dylan and The Beatles, Rich and his band deliver a mix of original tunes, bluesy ballads, and jam-worthy covers that feel timeless.\n7\n0\nOpen post by grandcentralbrewhouse with ID 17975079755875857\n7\n0\nWe’re proud to be a sponsor of the St. Pete Shuffleboard Club, one of the most iconic and community-driven spots in town!\nFall League registration is now open! Get your teams together and lock in your spot:\n•\tMonday Teams League: September 29 - November 17\n•\tTuesday Singles League: September 30 - November 11\n•\tTuesday Rookie Teams League: September 30 - November 18\n•\tWednesday Teams League: October 1 - November 19\nYou’ll see GCB beers poured throughout the season and, if you keep your eyes open, some familiar faces on the courts too. Our Head Brewer Zac has been playing shuffle here for nearly a decade!\nGet signed up and we’ll see you at the courts this fall!\n29\n2\nOpen post by grandcentralbrewhouse with ID 17935484499072826\n29\n2\nWednesday, August 27, St. Pete Stand Up brings their comedy showcase to Grand Central Brewhouse for the very first time. To celebrate, the first 20 tickets are only $5 (plus Eventbrite fees).\nSpend your Wednesday night laughing with some of Florida’s top comedians and enjoy the chance for surprise drop-ins from talent across the country.\nGrab your early tickets at the link in our bio.\n10\n0\nOpen post by grandcentralbrewhouse with ID 17880149421374346\n10\n0\nShoeless Soul joins us this Saturday at 6 PM!\nFormed in 2010 when guitarist and songwriter Rene connected with bassist Sladjan Vidic at an open mic, Shoeless Soul has been crafting a sound all their own for well over a decade.Their music blends reggae, pop, jazz, and rock into something that’s as tight and polished as it is playful and spontaneous.\nTheir shows are filled with catchy hooks, tasteful jams, and an energy that’s impossible not to feel. Named “Best Fusion Band” in Creative Loafing’s Best of the Bay, Shoeless Soul has built a loyal following through their chemistry on stage and their ability to bend genres while keeping every song fresh.\nCome grab a beer and catch a set that promises to be as fun to watch as it is to hear.\n11\n0\nOpen post by grandcentralbrewhouse with ID 18013860500594286\n11\n0\nGCB is entering a new Era. Stay tuned for what we’re dropping soon. 😉\nHint: TS12 - Track 4\n🫶\n151\n8\nOpen post by grandcentralbrewhouse with ID 18051647390624095\n151\n8\nFriday, August 15 at 7 PM, fan favorite Hot Tonic Orchestra returns to the beer garden. Led by Victoria Woods and Josh Hindmarsh, this powerhouse group features a rotating cast of top-tier musicians and delivers a sound that’s been described as Postmodern Jukebox meets Amy Winehouse. Expect jazz fused with Latin rhythms, funk, and soul, all wrapped in fresh, original arrangements\n18\n0\nOpen post by grandcentralbrewhouse with ID 18135603175382491\n18\n0\nFor the third year in a row, we’re heading to Sweden to pour at Brewskival, one of the most exciting beer festivals in the world! It’s an honor to be on the lineup with so many incredible breweries and connect with beer lovers from all over.\nEric’s already booked his ticket. If you’ve ever thought about making the trip, this is the year to do it. Come experience the festival, explore the scene, and share a beer with us in Sweden.\n153\n6\nOpen post by grandcentralbrewhouse with ID 18070767952886637\n153\n6\nSunday, August 10 at 2 PM, Josh’s Jazz Trio returns to the beer garden. Expect smooth grooves, dynamic improvisation, and classic jazz standards performed with style. It’s the perfect way to ease into your afternoon with a world class beer and some top-tier musicianship.\n12\n0\nOpen post by grandcentralbrewhouse with ID 18044348054322557\n12\n0\nSaturday, August 9 at 7 PM, the Brek Milo Trio returns to the beer garden. Brek blends intimate, lyrical songwriting with impressive guitar work, creating a set that is both heartfelt and musically rich. It is a great way to spend a summer evening, filled with thoughtful lyrics, layered melodies, and serious musicianship.\n9\n0\nOpen post by grandcentralbrewhouse with ID 18062152556209604\n9\n0\nLoad More\nBLog\nEmployee Portal\n© Grand Central Brewhouse, St. Petersburg, FL |\nPrivacy Policy\n| Powered & Designed by\nBrewing Sites\nHome\nAbout\nOn Tap\nOur Beer\nFood\nCommunity\nVisit\nEvents\nPrivate Events\nContact\nHome\nAbout\nOn Tap\nOur Beer\nFood\nCommunity\nVisit\nEvents\nPrivate Events\nContact\nFacebook\nInstagram",
      "emails": [
        "info@grandcentralbrew.com"
      ]
    },
    {
      "url": "https://www.grandcentralbrew.com/private-events/",
      "is_candidate": false,
      "has_email": true,
      "text": "Brewery, Taproom and Beer Garden in St. Petersburg, FL\nPRIVATE EVENTS\nHost Unforgettable Brewery Events at Grand Central Brewhouse\nLooking for the perfect venue for your next private event? Grand Central Brewhouse is your go-to destination for unforgettable brewery events. From corporate gatherings to personal celebrations, our craft beer brewery offers exceptional spaces that cater to all your needs.\nPrivate Event Spaces\nElevate your event with our unique spaces designed to make every gathering special.\nStammtisch Room\nThis intimate setting is ideal for cozy gatherings, providing a warm atmosphere and a curated craft beer experience. Whether you’re hosting a small team meeting or a personal celebration, the Stammtisch Room creates an inviting and memorable environment.\nTerrace\nPerfect for larger groups, our scenic second-floor terrace overlooks the taproom and adds a touch of sophistication to your event. Enjoy the vibrant atmosphere of our craft beer brewery while making the most of this open-air setting.\nEasy Booking for Brewery Events\nBooking your private event at Grand Central Brewhouse is a breeze. Simply fill out our easy online form with your contact details and event information. We handle the rest, ensuring that your brewery event is tailored to your needs and runs smoothly.\nWhy Choose Us?\nOur craft beer brewery isn’t just about great beer—it’s about creating memorable experiences. Whether you’re celebrating a milestone or organizing a corporate function, Grand Central Brewhouse offers the ideal backdrop for your brewery events. Enjoy exceptional spaces, personalized service, and, of course, outstanding craft beers.\nPlan your next private event at Grand Central Brewhouse and discover why we are the premier choice for brewery events in St. Petersburg.\nBOOK NOW\nSkaFest is back this Saturday!\nLager’s Not Dead: SkaFest Vol. 3 hits Grand Central Brewhouse on Saturday, August 30 from 1 PM to 10 PM, and it’s shaping up to be one of the best yet.\nThe lineup:\n💥 Eric Best – 1 PM - 1:45PM\n💥 Over Wait Mammal – 2 PM - 2:45 PM\n💥 Saganaki Bomb Squad – 3 PM - 3:45 PM\n💥 Chilled Monkey Brains – 4 PM - 5 PM\n💥 Floridaze – 5:15 PM - 6:30 PM\n💥 Control This! – 6:45 PM - 7:45 PM\n💥 Victims of Circumstance – 8 PM - 9:45 PM\nWe’ll have a wide array of fresh lagers pouring all day, a misting tent to keep you cool, and vendors like JB’s Hot Dogs, Churned Ice Cream, and Planet Retro hanging out for the day.\nThis event takes place in the Beer Garden and will be held rain or shine. We have plenty of tent coverage set up for the occasion.\n*Performance times are subject to change.\nSee you at SkaFest!\n36\n0\nOpen post by grandcentralbrewhouse with ID 17981312699736682\n36\n0\nOn Friday, August 29 at 6 PM Ultra Vinyl takes the stage with a set full of hits from across the decades. This Tampa Bay-based cover band brings a polished, high-energy performance that’s perfect for fans of live music you know and love. Whether you’re here to dance or just enjoy a great show with a beer in hand, Ultra Vinyl delivers the soundtrack.\n4\n0\nOpen post by grandcentralbrewhouse with ID 18058524002105109\n4\n0\n21\n2\nOpen post by grandcentralbrewhouse with ID 17853359745469320\n21\n2\nOn Saturday, August 23 at 6 PM The Rich Sheldon Band brings their blend of soulful Americana, folk, and roots rock to Grand Central Brewhouse. With influences ranging from the Grateful Dead and Bob Marley to Dylan and The Beatles, Rich and his band deliver a mix of original tunes, bluesy ballads, and jam-worthy covers that feel timeless.\n7\n0\nOpen post by grandcentralbrewhouse with ID 17975079755875857\n7\n0\nWe’re proud to be a sponsor of the St. Pete Shuffleboard Club, one of the most iconic and community-driven spots in town!\nFall League registration is now open! Get your teams together and lock in your spot:\n•\tMonday Teams League: September 29 - November 17\n•\tTuesday Singles League: September 30 - November 11\n•\tTuesday Rookie Teams League: September 30 - November 18\n•\tWednesday Teams League: October 1 - November 19\nYou’ll see GCB beers poured throughout the season and, if you keep your eyes open, some familiar faces on the courts too. Our Head Brewer Zac has been playing shuffle here for nearly a decade!\nGet signed up and we’ll see you at the courts this fall!\n29\n2\nOpen post by grandcentralbrewhouse with ID 17935484499072826\n29\n2\nWednesday, August 27, St. Pete Stand Up brings their comedy showcase to Grand Central Brewhouse for the very first time. To celebrate, the first 20 tickets are only $5 (plus Eventbrite fees).\nSpend your Wednesday night laughing with some of Florida’s top comedians and enjoy the chance for surprise drop-ins from talent across the country.\nGrab your early tickets at the link in our bio.\n10\n0\nOpen post by grandcentralbrewhouse with ID 17880149421374346\n10\n0\nShoeless Soul joins us this Saturday at 6 PM!\nFormed in 2010 when guitarist and songwriter Rene connected with bassist Sladjan Vidic at an open mic, Shoeless Soul has been crafting a sound all their own for well over a decade.Their music blends reggae, pop, jazz, and rock into something that’s as tight and polished as it is playful and spontaneous.\nTheir shows are filled with catchy hooks, tasteful jams, and an energy that’s impossible not to feel. Named “Best Fusion Band” in Creative Loafing’s Best of the Bay, Shoeless Soul has built a loyal following through their chemistry on stage and their ability to bend genres while keeping every song fresh.\nCome grab a beer and catch a set that promises to be as fun to watch as it is to hear.\n11\n0\nOpen post by grandcentralbrewhouse with ID 18013860500594286\n11\n0\nGCB is entering a new Era. Stay tuned for what we’re dropping soon. 😉\nHint: TS12 - Track 4\n🫶\n151\n8\nOpen post by grandcentralbrewhouse with ID 18051647390624095\n151\n8\nFriday, August 15 at 7 PM, fan favorite Hot Tonic Orchestra returns to the beer garden. Led by Victoria Woods and Josh Hindmarsh, this powerhouse group features a rotating cast of top-tier musicians and delivers a sound that’s been described as Postmodern Jukebox meets Amy Winehouse. Expect jazz fused with Latin rhythms, funk, and soul, all wrapped in fresh, original arrangements\n18\n0\nOpen post by grandcentralbrewhouse with ID 18135603175382491\n18\n0\nFor the third year in a row, we’re heading to Sweden to pour at Brewskival, one of the most exciting beer festivals in the world! It’s an honor to be on the lineup with so many incredible breweries and connect with beer lovers from all over.\nEric’s already booked his ticket. If you’ve ever thought about making the trip, this is the year to do it. Come experience the festival, explore the scene, and share a beer with us in Sweden.\n153\n6\nOpen post by grandcentralbrewhouse with ID 18070767952886637\n153\n6\nSunday, August 10 at 2 PM, Josh’s Jazz Trio returns to the beer garden. Expect smooth grooves, dynamic improvisation, and classic jazz standards performed with style. It’s the perfect way to ease into your afternoon with a world class beer and some top-tier musicianship.\n12\n0\nOpen post by grandcentralbrewhouse with ID 18044348054322557\n12\n0\nSaturday, August 9 at 7 PM, the Brek Milo Trio returns to the beer garden. Brek blends intimate, lyrical songwriting with impressive guitar work, creating a set that is both heartfelt and musically rich. It is a great way to spend a summer evening, filled with thoughtful lyrics, layered melodies, and serious musicianship.\n9\n0\nOpen post by grandcentralbrewhouse with ID 18062152556209604\n9\n0\nLoad More\nBLog\nEmployee Portal\n© Grand Central Brewhouse, St. Petersburg, FL |\nPrivacy Policy\n| Powered & Designed by\nBrewing Sites\nHome\nAbout\nOn Tap\nOur Beer\nFood\nCommunity\nVisit\nEvents\nPrivate Events\nContact\nHome\nAbout\nOn Tap\nOur Beer\nFood\nCommunity\nVisit\nEvents\nPrivate Events\nContact\nFacebook\nInstagram",
      "emails": [
        "info@grandcentralbrew.com"
      ]
    }
  ],
  "all_links": [
    "https://www.grandcentralbrew.com/contact/",
    "https://www.grandcentralbrew.com/beer/",
    "https://www.grandcentralbrew.com/visit/#stammtisch",
    "https://www.grandcentralbrew.com/about/",
    "https://www.grandcentralbrew.com/food/",
    "https://www.grandcentralbrew.com/visit/",
    "https://www.grandcentralbrew.com/events/",
    "https://www.grandcentralbrew.com/on-tap/",
    "https://www.grandcentralbrew.com/cdn-cgi/l/email-protection#a798d4d2c5cdc2c4d39ae1c6c4c2c5c8c8cc818497949f9cc5c8c3de9acfd3d3d7d48294e68295e18295e1c1c6c4c2c5c8c8cc89c4c8ca8295e1c2d1c2c9d3d48295e19696929f94979f9695919493979492908295978a829597829597e4d5ced4ced4829597d3cfc2829597edc6dddd829597f7d5c8cdc2c4d3829597ebced1c2829597c6d3829597e0e4e58295968295978a829597f4c2d7829597928295e4829597918294e69797d7ca",
    "https://www.grandcentralbrew.com/news",
    "https://www.grandcentralbrew.com/cdn-cgi/l/email-protection#350a4640575f5056410873545650575a5a5e131605060d0e575a514c085d4141454610067410077310077353545650575a5a5e1b565a581007735043505b4146100773020201010c020d0604030d0105040710070518100705664550545e1007057054464c100705795c4350100705544110070572767710070410070518100705665045100705031007761007050210067405054558",
    "https://www.grandcentralbrew.com/about/#code",
    "https://www.grandcentralbrew.com/food/#lala",
    "https://www.grandcentralbrew.com/about/#mission",
    "https://www.grandcentralbrew.com/cdn-cgi/l/email-protection#4c25222a230c2b3e2d22282f2922383e2d202e3e293b622f2321",
    "https://www.grandcentralbrew.com/community/#sustainability",
    "https://www.grandcentralbrew.com/cdn-cgi/l/email-protection#c1a8afa7ae81a6b3a0afa5a2a4afb5b3a0ada3b3a4b6efa2aeac",
    "https://www.grandcentralbrew.com/cdn-cgi/l/email-protection#07387472656d6264733a416664626568686c212437343f3c6568637e3a6f73737774223446223541223541616664626568686c2964686a2235416271626973742235413636363e35333f343534333335333e332235372a2235374b6660627522353074223537494853223537436266632235362235372a223537544c464142545322353751686b29223537342235372a2235374672602235373437223544223537362234463737776a2235372a223537467260223537343722354422353736372234463737776a",
    "https://www.grandcentralbrew.com/cdn-cgi/l/email-protection#490824202c092e3b28272d2a2c273d3b28252b3b2c3e672a2624",
    "https://www.grandcentralbrew.com/cdn-cgi/l/email-protection#f2cd81879098979186cfb4939197909d9d99d4d1c2c1cac9909d968bcf9a86868281d7c1b3d7c0b4d7c0b494939197909d9d99dc919d9fd7c0b49784979c8681d7c0b4c5c6cac1c6c3cacbc3c3c2c5c7c7cbd7c0c2dfd7c0c2a69a97d7c0c2b497809c939c969dd7c0c2b1808788d7c0c2a6809b9dd7c0c2be9b8497d7c0c29386d7c0c2b5b1b0d7c0c3d7c0c2dfd7c0c2b38795d7c0c2c1c3d7c0b1d7c0c2c0d7c1b3c2c2829f",
    "https://www.grandcentralbrew.com/wp-content/uploads/sbr-feed-images/google-01_30_2025ChIJ6ZtlbzbjwogRdKznFBYwPDIChrisRedfield-0-640.jpg",
    "https://www.grandcentralbrew.com/private-events/#book",
    "https://www.grandcentralbrew.com/wp-content/uploads/2022/08/HOME_Room-for-All-1.jpg",
    "https://www.grandcentralbrew.com/wp-content/uploads/2022/08/Taproom-1.jpg",
    "https://www.grandcentralbrew.com/cdn-cgi/l/email-protection#533a3d353c133421323d3730363d2721323f312136247d303c3e",
    "https://www.grandcentralbrew.com/cdn-cgi/l/email-protection#f0cf8385929a959384cdb6919395929f9f9bd6d3c0c3c8cb929f9489cd9884848083d5c3b1d5c2b6d5c2b696919395929f9f9bde939f9dd5c2b69586959e8483d5c2b6c1c0c6c1c9c0c2c7c9c6c0c5c6c8c0c1d5c2c0ddd5c2c0a49895d5c2c0a3859e94919583d5c2c0bc998695d5c2c09184d5c2c0b7b3b2d5c2c1d5c2c0ddd5c2c0a39580d5c2c0c7d5c2b3d5c2c0c5d5c3b1c0c0809d",
    "https://www.grandcentralbrew.com",
    "https://www.grandcentralbrew.com/cdn-cgi/l/email-protection#46793533242c2325327b002725232429292d606576757e7d2429223f7b2e32323635637507637400637400202725232429292d6825292b6374002330232832356374007176767273747170707576717f7f7f6374766b637476162f28232a2a2735637476143328637476052a33246374766374766b63747615233663747672637405637476706375077576362b",
    "https://www.grandcentralbrew.com/about/#team",
    "https://www.grandcentralbrew.com/visit/#terrace",
    "https://www.grandcentralbrew.com/wp-content/uploads/2022/08/Beer-Garden-1.jpg",
    "https://www.grandcentralbrew.com/cdn-cgi/l/email-protection#e48d8a828ba48396858a8087818a9096858886968193ca878b89",
    "https://www.grandcentralbrew.com/cdn-cgi/l/email-protection#39725c4f5057795e4b58575d5a5c574d4b58555b4b5c4e175a5654",
    "https://www.grandcentralbrew.com/wp-content/uploads/2022/08/Terrace-1-.jpg",
    "https://www.grandcentralbrew.com/privacy-policy",
    "https://www.grandcentralbrew.com/cdn-cgi/l/email-protection#e0898e868fa08792818e8483858e9492818c82928597ce838f8d",
    "https://www.grandcentralbrew.com/visit",
    "https://www.grandcentralbrew.com/community/",
    "https://www.grandcentralbrew.com/employee-portal",
    "https://www.grandcentralbrew.com/visit/#beer",
    "https://www.grandcentralbrew.com/wp-content/uploads/sbr-feed-images/google-01_30_2025ChIJ6ZtlbzbjwogRdKznFBYwPDIChrisRedfield-1-640.jpg",
    "https://www.grandcentralbrew.com/cdn-cgi/l/email-protection#f59c9b939ab59287949b9196909b8187949997879082db969a98",
    "https://www.grandcentralbrew.com/private-events/",
    "https://www.grandcentralbrew.com/food/#menu",
    "https://www.grandcentralbrew.com/"
  ],
  "candidate_links": [
    "https://www.grandcentralbrew.com/contact/",
    "https://www.grandcentralbrew.com/about/",
    "https://www.grandcentralbrew.com/events/",
    "https://www.grandcentralbrew.com/about/#team",
    "https://www.grandcentralbrew.com/private-events/"
  ],
  "visited": [
    "https://www.grandcentralbrew.com/",
    "https://www.grandcentralbrew.com/about",
    "https://www.grandcentralbrew.com/contact",
    "https://www.grandcentralbrew.com/staff",
    "https://www.grandcentralbrew.com/team",
    "https://www.grandcentralbrew.com/board",
    "https://www.grandcentralbrew.com/directory",
    "https://www.grandcentralbrew.com/events",
    "https://www.grandcentralbrew.com/sitemap.xml",
    "https://www.grandcentralbrew.com/council",
    "https://www.grandcentralbrew.com/leadership",
    "https://www.grandcentralbrew.com/management",
    "https://www.grandcentralbrew.com/producers",
    "https://www.grandcentralbrew.com/support",
    "https://www.grandcentralbrew.com/crew",
    "https://www.grandcentralbrew.com/members",
    "https://www.grandcentralbrew.com/bios",
    "https://www.grandcentralbrew.com/people",
    "https://www.grandcentralbrew.com/artists",
    "https://www.grandcentralbrew.com/musicians",
    "https://www.grandcentralbrew.com/faculty",
    "https://www.grandcentralbrew.com/administration",
    "https://www.grandcentralbrew.com/contact/",
    "https://www.grandcentralbrew.com/about/",
    "https://www.grandcentralbrew.com/events/",
    "https://www.grandcentralbrew.com/about/#team",
    "https://www.grandcentralbrew.com/private-events/"
  ],
  "base_url": "https://www.grandcentralbrew.com/"
}