{
  "pages": [
    {
      "url": "https://grandharbor.com/contact/",
      "is_candidate": false,
      "has_email": true,
      "text": "Contact Us\nThank you for visiting\nGrand Harbor Golf and Beach Club.\nFor general inquiries, please contact us at\n772-778-9000\nor complete the form below. A member of our team will respond to you promptly.\nGrand Harbor – Main Clubhouse\n4985 Club Terrace\nVero Beach, FL 32967\nGrand Harbor Beach Club\n8500 Highway A1A,\nVero Beach, Florida 32963\nName\nEmail\nAddress\nMessage\nSUBMIT\nContact Us\nThank you for visiting\nGrand Harbor Golf and Beach Club.\nFor general inquiries, please contact us at\n772-778-9000\nor complete the form below. A member of our team will respond to you promptly.\nThank you for visiting\nGrand Harbor Golf and Beach Club.\nFor general inquiries, please contact us at\n772-778-9000\nor complete the form below. A member of our team will respond to you promptly.\nGrand Harbor – Main Clubhouse\n4985 Club Terrace\nVero Beach, FL 32967\nGrand Harbor Beach Club\n8500 Highway A1A,\nVero Beach, Florida 32963\nName\nEmail\nAddress\nMessage\nSUBMIT\nGrand Harbor – Main Clubhouse\n4985 Club Terrace\nVero Beach, FL 32967\nGrand Harbor Beach Club\n8500 Highway A1A,\nVero Beach, Florida 32963\nName\nEmail\nAddress\nMessage\nSUBMIT\nClubhouse:\n4985 Club Terrace,\nVero Beach, Florida 32967\n772-778-9000\nBeach Club:\n8500 Highway A1A,\nVero Beach, Florida 32963\n772-231-2600\nTwitter\nInstagram\nFacebook-f\nPhone-alt\nEnvelope\nQuick Links\nAbout\nMembership\nMembership Portal\nTerms of Service\nContact Us\nINQUIRE TODAY\nFirst Name\nLast Name\nEmail\nAddress\nMessage\nSUBMIT",
      "emails": [
        "membership@grandharbor.com"
      ]
    },
    {
      "url": "https://member.grandharbor.com/member-login",
      "is_candidate": false,
      "has_email": true,
      "text": "#bannerText\n#bannerImage\nMember Login\nMember Sign In\nUsername:\n»Clear\nPassword:\nForgot your password?\nStay signed in until I sign out\nLOGIN INSTRUCTIONS\nUsername\n: your member number and for spouse add the letter A\nExample - 01111 and for Spouse - 01111A\n*Please Note: If your member number is less than 5 digits,\nyou will need to add zeros to the front.\nExamples -\nMember #234's username would be 00234\nMember #1234's username would be 01234\nPassword\n: your last name\nExample - Smith\n*You will be prompted to update your password after logging in.\n#content",
      "emails": [
        "membership@grandharbor.com"
      ]
    },
    {
      "url": "https://grandharbor.com/about/",
      "is_candidate": false,
      "has_email": true,
      "text": "OUR STORY\nCONTINUOUSLY ELEVATING CLUB LIFE\nFOR OUR MEMBERSHIP\nOur membership is at the heart of our story. Everything we do is designed to enhance their club experience. Located in beautiful Vero Beach, we provide unparalleled opportunities for leisure and recreation. From our two thoughtfully designed and exciting golf courses to the tranquil expanse of our Beach Club, every day at Grand Harbor is a chance to live exceptionally.\nEXPERIENCE GRAND HARBOR\nOUR STAFF\nMichael Gibson\nGeneral Manager\nLEARN MORE\nTroy Pare\nDirector of Golf\nLEARN MORE\nJosh Breda\nDirector of Agronomy\nLEARN MORE\nRico Hosena\nBeach Club Executive Chef\nLEARN MORE\nJoe Ferro\nExecutive Chef\nLEARN MORE\nTim Blouin\nExecutive Pastry Chef\nLEARN MORE\nMarco Osorio\nDirector of Sports\nLEARN MORE\nJodi Vogt\nDirector of Membership\nLEARN MORE\nMatt depino\nDirector of Facilities and Construction\nTONY ALBANO\nManager of Information Systems\nDonna rainbow\nBeach Club Manager\nWalter Ruiz\nF&B Operations Manager\nRobby Gutermuth\nClubhouse Operations Manager\nJoel Brown\nAssistant F&B Manager\nAndrian Bitere\nManager in Development\nJennifer Moore\nChief Financial Officer\nJoy Hernandez\nDirector of Human Resources\nGrand Harbor is indeed GRAND with an amazing membership and staff!\nDeb Fletcher, Grand Harbor Member\nEXPERIENCE GRAND HARBOR\nOUR STORY\nCONTINUOUSLY ELEVATING CLUB LIFE\nFOR OUR MEMBERSHIP\nOur membership is at the heart of our story. Everything we do is designed to enhance their club experience. Located in beautiful Vero Beach, we provide unparalleled opportunities for leisure and recreation. From our two thoughtfully designed and exciting golf courses to the tranquil expanse of our Beach Club, every day at Grand Harbor is a chance to live exceptionally.\nEXPERIENCE GRAND HARBOR\nCONTINUOUSLY ELEVATING CLUB LIFE\nFOR OUR MEMBERSHIP\nOur membership is at the heart of our story. Everything we do is designed to enhance their club experience. Located in beautiful Vero Beach, we provide unparalleled opportunities for leisure and recreation. From our two thoughtfully designed and exciting golf courses to the tranquil expanse of our Beach Club, every day at Grand Harbor is a chance to live exceptionally.\nEXPERIENCE GRAND HARBOR\nOUR STAFF\nMichael Gibson\nGeneral Manager\nLEARN MORE\nMichael Gibson\nGeneral Manager\nLEARN MORE\nTroy Pare\nDirector of Golf\nLEARN MORE\nJosh Breda\nDirector of Agronomy\nLEARN MORE\nRico Hosena\nBeach Club Executive Chef\nLEARN MORE\nJoe Ferro\nExecutive Chef\nLEARN MORE\nTroy Pare\nDirector of Golf\nLEARN MORE\nJosh Breda\nDirector of Agronomy\nLEARN MORE\nRico Hosena\nBeach Club Executive Chef\nLEARN MORE\nJoe Ferro\nExecutive Chef\nLEARN MORE\nTroy Pare\nDirector of Golf\nLEARN MORE\nJosh Breda\nDirector of Agronomy\nLEARN MORE\nRico Hosena\nBeach Club Executive Chef\nLEARN MORE\nJoe Ferro\nExecutive Chef\nLEARN MORE\nTim Blouin\nExecutive Pastry Chef\nLEARN MORE\nMarco Osorio\nDirector of Sports\nLEARN MORE\nJodi Vogt\nDirector of Membership\nLEARN MORE\nMatt depino\nDirector of Facilities and Construction\nTONY ALBANO\nManager of Information Systems\nDonna rainbow\nBeach Club Manager\nWalter Ruiz\nF&B Operations Manager\nRobby Gutermuth\nClubhouse Operations Manager\nJoel Brown\nAssistant F&B Manager\nAndrian Bitere\nManager in Development\nJennifer Moore\nChief Financial Officer\nJoy Hernandez\nDirector of Human Resources\nGrand Harbor is indeed GRAND with an amazing membership and staff!\nDeb Fletcher, Grand Harbor Member\nTim Blouin\nExecutive Pastry Chef\nLEARN MORE\nMarco Osorio\nDirector of Sports\nLEARN MORE\nJodi Vogt\nDirector of Membership\nLEARN MORE\nMatt depino\nDirector of Facilities and Construction\nTim Blouin\nExecutive Pastry Chef\nLEARN MORE\nMarco Osorio\nDirector of Sports\nLEARN MORE\nJodi Vogt\nDirector of Membership\nLEARN MORE\nMatt depino\nDirector of Facilities and Construction\nTONY ALBANO\nManager of Information Systems\nDonna rainbow\nBeach Club Manager\nWalter Ruiz\nF&B Operations Manager\nRobby Gutermuth\nClubhouse Operations Manager\nTONY ALBANO\nManager of Information Systems\nDonna rainbow\nBeach Club Manager\nWalter Ruiz\nF&B Operations Manager\nRobby Gutermuth\nClubhouse Operations Manager\nJoel Brown\nAssistant F&B Manager\nAndrian Bitere\nManager in Development\nJennifer Moore\nChief Financial Officer\nJoy Hernandez\nDirector of Human Resources\nJoel Brown\nAssistant F&B Manager\nAndrian Bitere\nManager in Development\nJennifer Moore\nChief Financial Officer\nJoy Hernandez\nDirector of Human Resources\nEXPERIENCE GRAND HARBOR\nClubhouse:\n4985 Club Terrace,\nVero Beach, Florida 32967\n772-778-9000\nBeach Club:\n8500 Highway A1A,\nVero Beach, Florida 32963\n772-231-2600\nTwitter\nInstagram\nFacebook-f\nPhone-alt\nEnvelope\nQuick Links\nAbout\nMembership\nMembership Portal\nTerms of Service\nContact Us\nINQUIRE TODAY\nFirst Name\nLast Name\nEmail\nAddress\nMessage\nSUBMIT\nMichael Gibson\nGeneral Manager\nMichael Gibson’s professional achievements span over three decades of excellence in the golf and hospitality industry. He has been a dedicated member of the CMAA Seminole Region Charity Golf Tournament Committee over 25 years, showcasing his commitment to charitable causes. Michael served as General Manager at Old Marsh Golf Club, where he helped achieve six years of Platinum Clubs of America status and Emerald Distinguished Club honors. He participated in the 2014 Boca Ballroom Battle, raising over $50,000 for the George Snow Scholarship Fund. Under his leadership, Boca Grove was named a Top 100 Golf Shop by the Association of Golf Merchandisers in 2019 and won Country Club of the Year from Luxury Travel Guide.\nMichael has served as General Manager of Grand Harbor Golf & Beach Club for nearly four years, following the transition from developer ownership to a member-owned club. During his tenure, the Club has gained 400+ new members, and his leadership was instrumental in earning the Distinguished Clubs of America award. Michael’s dedication to the Club and its members is unwavering, continuously enhancing the member experience. Living grand has never been better!\nTroy Pare\nDirector of Golf at Grand Harbor\nTroy Pare, originally from Rhode Island, has been a golf professional for 27 years, with 17 years as a Head Golf Professional/Director of Golf. He began his current role as Director of Golf at Grand Harbor Golf and Beach Club in Vero Beach, Florida, on March 4, 2021, where he also works on the membership team. Prior to Grand Harbor, Troy served as Head Golf Professional at Ledgemont Country Club and as Director of Operations & Head Golf Professional at The Preserve at Boulder Hills, a private club offering outdoor activities like golf, hunting, and fly fishing. He was also the Head Golf Professional at Wannamoisett Country Club in Rumford, Rhode Island. Married for 23 years with two teenage boys, Troy thrives in the busy, multi-tasking environment of Grand Harbor.\nJosh Breda\nDirector of Agronomy\nJosh Breda is the Director of Agronomy at Grand Harbor, bringing over 24 years of experience in agronomy and golf course maintenance. He holds a Bachelor of Science degree in Turfgrass Science from Clemson University and has previously worked at renowned clubs such as The Ford Plantation in Richmond Hill, GA, The Savannah Golf Club, The Polo Club in Boca Raton, and Riddell’s Bay Golf Club in Warwick, Bermuda. With a passion for working outdoors and a love for the game of golf, Josh finds his favorite aspect of working at Grand Harbor to be the close-knit team atmosphere and the opportunity to maintain beautiful, world-class golf courses. His day-to-day responsibilities include overseeing all aspects of turf management, coordinating with the grounds team, and ensuring the courses are in top condition for members and guests throughout the year.\nRico Hosena\nExecutive Chef at Grand Harbor\nChef Rico Hosena has been in the kitchen since 1989, working and training with chefs from all over the world. He started working for the five-star luxury resort, Sofitel Philippine Plaza Manila. This is where Rico learned to be versatile in all food and beverage operations, starting as a cook and then learning the ropes as a waiter and guest services professional.\nIn 2007 Rico came to America on an H2B program, where he met Michael Gibson working at Old Marsh Golf Club. Every six months, he would travel north and work at other restaurants and Clubs including Kiawah Island, Mountain Air Country Club and Martha’s Vineyard. In April 2021, Rico had the opportunity to join Michael again when he was offered the position as Executive Chef of the Beach Club.\nRico’s goal has been to elevate the dining experience by offering exceptional restaurant-quality food, breaking away from the typical country club fare. With his team, he is turning the vision of creating the best restaurant in Vero Beach into a reality.\nJoe Ferro\nExecutive Chef\nJoe began his career in Buffalo, NY at popular restaurants Le Metro Bistro and Bakery and The Left Bank, expanding his culinary knowledge in these scratch kitchens. He soon became Executive Chef at the historic Buffalo Launch Club, the world’s oldest power boating club. Following his passion for food and cooking, he moved to South Florida. Eventually he joined the team at Table 26, later taking over as Executive Chef. Years later he moved on the The Club at Admirals Cove (AC) as Executive Sous Chef.\nAfter five years at AC, Joe took on the role of Executive Chef at Grand Harbor. Joe aims to leave his culinary mark by creating a home where his creative vision and extensive expertise can flourish. His ability to blend traditional techniques with modern flair sets him apart, making him a standout in the industry.\nTim Blouin\nExecutive Pastry Chef\nTim Blouin began his career at Grand Harbor in 2001, though his culinary journey started long before that. Originally from Nashua, New Hampshire, Tim discovered his passion for cooking in high school, studying Culinary Arts. He went on to attend New Hampshire College Culinary Institute and briefly trained at a culinary school in Northern France. His early career was filled with seasonal work, spending summers at The Harbor View Hotel on Martha’s Vineyard and winters at The Village at Breckenridge in Colorado. Tim’s true passion for pastry ignited when he trained under Master Pastry Chef Steven James at The Balsams Grand Resort in Dixville Notch, New Hampshire. Chef James introduced him to pastry competitions and arranged opportunities to work with top pastry chefs during the off-seasons at prestigious locations such as Mohonk Mountain House in New York, The Cloister on Sea Island in Georgia, Kingsmill Resort in Virginia, and The American Club in Wisconsin.\nTim eventually found his way to Vero Beach, Florida, after visiting a friend working at Windsor, and the rest is history. Tim is one of Grand Harbor’s “sweetest” assets, bringing passion and expertise to every creation. With his personal touch, each dessert becomes a true masterpiece!\nMarco Osorio\nDirector of Sports\nWith a career spanning over 20 years, Marco has a unique background as an ATP player, high-performance coach, tournament organizer, and club manager. He reached the top 200 in both singles and doubles and, as a Davis Cup player for Mexico, claimed victories over Roger Federer and the Bryan brothers. After retiring from professional tennis, Marco became one of Mexico’s top high-performance coaches, mentoring multiple national champions and serving as Davis Cup Captain.\nMarco has also organized over 50 world-class tournaments, earning five International Tennis Federation (ITF) awards for hosting the best “Grade A” tournaments globally—events as prestigious as the Grand Slams. In club management, he served as COO of Mexico’s largest sports club organization and successfully turned around the Vero Beach Tennis Club after purchasing it in 2011. He later became General Manager of the Boulevard.\nSince 2018, Marco has worked at Grand Harbor, first as Head Tennis Professional and then as Tennis Director. In 2021, he took on a dual role as Sports Director and Tournament Director for the Vero Beach International Tennis Open. Marco also holds three graduate degrees, including an MBA, and frequently speaks at sports and tennis conferences worldwide.\nJodi Vogt\nDirector of Membership\nJodi is the Director of Membership at Grand Harbor, where she finds joy in both welcoming prospective members and building lasting relationships with current ones. She enjoys meeting new people, giving tours of the club, and sharing the unique experiences Grand Harbor has to offer. Along with handling the membership application process, Jodi ensures a smooth and personalized experience for each new member.\nWith a background in psychology, sociology, and nonprofit management, Jodi brings a warm and thoughtful approach to her work, making every member feel welcome and appreciated at Grand Harbor.",
      "emails": [
        "membership@grandharbor.com"
      ]
    },
    {
      "url": "https://grandharbor.com/contact-grand-harbor/",
      "is_candidate": false,
      "has_email": true,
      "text": "Contact Us\nThank you for visiting\nGrand Harbor Golf and Beach Club.\nFor general inquiries, please contact us at\n772-778-9000\nor complete the form below. A member of our team will respond to you promptly.\nGrand Harbor – Main Clubhouse\n4985 Club Terrace\nVero Beach, FL 32967\nGrand Harbor Beach Club\n8500 Highway A1A,\nVero Beach, Florida 32963\nName\nEmail\nAddress\nMessage\nSUBMIT\nContact Us\nThank you for visiting\nGrand Harbor Golf and Beach Club.\nFor general inquiries, please contact us at\n772-778-9000\nor complete the form below. A member of our team will respond to you promptly.\nThank you for visiting\nGrand Harbor Golf and Beach Club.\nFor general inquiries, please contact us at\n772-778-9000\nor complete the form below. A member of our team will respond to you promptly.\nGrand Harbor – Main Clubhouse\n4985 Club Terrace\nVero Beach, FL 32967\nGrand Harbor Beach Club\n8500 Highway A1A,\nVero Beach, Florida 32963\nName\nEmail\nAddress\nMessage\nSUBMIT\nGrand Harbor – Main Clubhouse\n4985 Club Terrace\nVero Beach, FL 32967\nGrand Harbor Beach Club\n8500 Highway A1A,\nVero Beach, Florida 32963\nName\nEmail\nAddress\nMessage\nSUBMIT\nClubhouse:\n4985 Club Terrace,\nVero Beach, Florida 32967\n772-778-9000\nBeach Club:\n8500 Highway A1A,\nVero Beach, Florida 32963\n772-231-2600\nTwitter\nInstagram\nFacebook-f\nPhone-alt\nEnvelope\nQuick Links\nAbout\nMembership\nMembership Portal\nTerms of Service\nContact Us\nINQUIRE TODAY\nFirst Name\nLast Name\nEmail\nAddress\nMessage\nSUBMIT",
      "emails": [
        "membership@grandharbor.com"
      ]
    },
    {
      "url": "https://grandharbor.com/membership/",
      "is_candidate": false,
      "has_email": true,
      "text": "Membership\nLIVE LIFE EXCEPTIONALLY\nCamaraderie defines the essence of Grand Harbor, the premier private club of Vero Beach. From playing a round of golf along the tranquil waters of the Indian River Lagoon to dining along the pristine Atlantic coastal beach, we invite you to create lasting memories at Grand Harbor.\nWhether you’re making new friends or reconnecting with familiar faces, enjoy friendly competition on the pickleball courts or surrender to the serenity of service in one of our Grand Harbor beach chairs. Savor a Chef’s Table experience curated by our world-renowned chefs, where each dish is crafted to create a memorable dining experience, perfectly complemented by fine wine and exquisite cuisine. Venture onto our championship golf courses, where each hole offers a unique challenge and the opportunity to spot various species of birds on this Audubon-certified property. With every swing, immerse yourself in the beauty of nature, adding a delightful touch of discovery to your Florida escape.\nVIEW OUR MONTHLY NEWSLETTER, GRAND LIFE\nJoin us at Grand Harbor, where life is not just lived,\nit’s celebrated.\nMembership is available to both residents and non-residents of Grand Harbor.\nFull Membership\nWith full use of golf, tennis, the Beach Club, and social facilities, members and their family* have access to all of the amenities available at Grand Harbor.\nSix-day priority sign-up to reserve golf tee times\nSix-day priority sign-up to reserve racquet sport court times\nNo greens fees or court fees\nUnlimited use of the Range\nVertical Family Privilege\n*Includes grandparents, parents, children, grandchildren, and great-grandchildren of the member and spouse or significant other not living within 100 miles of the club\nSports Membership\nEnjoy full use of the golf, racquet sports, Beach Club, and social facilities.\n12 rounds of golf October 1 – May 1\nUnlimited golf May 2 – September 30\nUnlimited use of the practice facilities\nThree-day priority sign-up to reserve golf tee times\nSix-day priority sign-up to reserve racquet sport court times\nNo court fees\nLimited Time Offers\n1-Year Trial Membership\nEnjoy the benefits of a Full Membership for 1 year without the initiation fee.\n110% of Full Membership dues\nSummer Membership\nWant to experience all that Grand Harbor Golf & Beach Club have to offer? Enjoy Full Membership benefits* from May 1 – September 30.\nThis is a one-time opportunity to experience Grand Harbor Golf & Beach Club. You may not join as a summer member in future years.\n*Summer Members do not receive the vertical family privilege.\nFeatured News\nAward-winning host and journalist Parker Kelley dives into the Grand Harbor Golf & Beach Club lifestyle, highlighting our amenities and vibrant community.\nMembership Inquiry\nFill out the form below for more information.\nName\nEmail\nAddress\nMessage\nHow did you hear about us?\nHow did you hear about us?\nSearch Engine (Google, Yahoo, etc.)\nInternet Advertisement\nSocial Media (Facebook, Instagram, etc.)\nNewspaper or Publication\nRecommended by a Friend\nSUBMIT\nWe really enjoy living at Grand Harbor because of everything it offers to members: golfing, tennis, pickleball, bocce, the fitness\ncenter with exercise classes, the Beach Club, great food and drinks,\nfrequent event\ns, and most importantly, the wonderful friendships and\nfellowship. There's never a dull moment, always something to do and\nfriends to see!\nSteve and Tracy Mooney, Grand Harbor Members\nMembership\nLIVE LIFE EXCEPTIONALLY\nCamaraderie defines the essence of Grand Harbor, the premier private club of Vero Beach. From playing a round of golf along the tranquil waters of the Indian River Lagoon to dining along the pristine Atlantic coastal beach, we invite you to create lasting memories at Grand Harbor.\nWhether you’re making new friends or reconnecting with familiar faces, enjoy friendly competition on the pickleball courts or surrender to the serenity of service in one of our Grand Harbor beach chairs. Savor a Chef’s Table experience curated by our world-renowned chefs, where each dish is crafted to create a memorable dining experience, perfectly complemented by fine wine and exquisite cuisine. Venture onto our championship golf courses, where each hole offers a unique challenge and the opportunity to spot various species of birds on this Audubon-certified property. With every swing, immerse yourself in the beauty of nature, adding a delightful touch of discovery to your Florida escape.\nVIEW OUR MONTHLY NEWSLETTER, GRAND LIFE\nLIVE LIFE EXCEPTIONALLY\nCamaraderie defines the essence of Grand Harbor, the premier private club of Vero Beach. From playing a round of golf along the tranquil waters of the Indian River Lagoon to dining along the pristine Atlantic coastal beach, we invite you to create lasting memories at Grand Harbor.\nWhether you’re making new friends or reconnecting with familiar faces, enjoy friendly competition on the pickleball courts or surrender to the serenity of service in one of our Grand Harbor beach chairs. Savor a Chef’s Table experience curated by our world-renowned chefs, where each dish is crafted to create a memorable dining experience, perfectly complemented by fine wine and exquisite cuisine. Venture onto our championship golf courses, where each hole offers a unique challenge and the opportunity to spot various species of birds on this Audubon-certified property. With every swing, immerse yourself in the beauty of nature, adding a delightful touch of discovery to your Florida escape.\nVIEW OUR MONTHLY NEWSLETTER, GRAND LIFE\nJoin us at Grand Harbor, where life is not just lived,\nit’s celebrated.\nMembership is available to both residents and non-residents of Grand Harbor.\nFull Membership\nWith full use of golf, tennis, the Beach Club, and social facilities, members and their family* have access to all of the amenities available at Grand Harbor.\nSix-day priority sign-up to reserve golf tee times\nSix-day priority sign-up to reserve racquet sport court times\nNo greens fees or court fees\nUnlimited use of the Range\nVertical Family Privilege\n*Includes grandparents, parents, children, grandchildren, and great-grandchildren of the member and spouse or significant other not living within 100 miles of the club\nSports Membership\nEnjoy full use of the golf, racquet sports, Beach Club, and social facilities.\n12 rounds of golf October 1 – May 1\nUnlimited golf May 2 – September 30\nUnlimited use of the practice facilities\nThree-day priority sign-up to reserve golf tee times\nSix-day priority sign-up to reserve racquet sport court times\nNo court fees\nFull Membership\nWith full use of golf, tennis, the Beach Club, and social facilities, members and their family* have access to all of the amenities available at Grand Harbor.\nSix-day priority sign-up to reserve golf tee times\nSix-day priority sign-up to reserve racquet sport court times\nNo greens fees or court fees\nUnlimited use of the Range\nVertical Family Privilege\n*Includes grandparents, parents, children, grandchildren, and great-grandchildren of the member and spouse or significant other not living within 100 miles of the club\nFull Membership\nWith full use of golf, tennis, the Beach Club, and social facilities, members and their family* have access to all of the amenities available at Grand Harbor.\nSix-day priority sign-up to reserve golf tee times\nSix-day priority sign-up to reserve racquet sport court times\nNo greens fees or court fees\nUnlimited use of the Range\nVertical Family Privilege\n*Includes grandparents, parents, children, grandchildren, and great-grandchildren of the member and spouse or significant other not living within 100 miles of the club\nSports Membership\nEnjoy full use of the golf, racquet sports, Beach Club, and social facilities.\n12 rounds of golf October 1 – May 1\nUnlimited golf May 2 – September 30\nUnlimited use of the practice facilities\nThree-day priority sign-up to reserve golf tee times\nSix-day priority sign-up to reserve racquet sport court times\nNo court fees\nSports Membership\nEnjoy full use of the golf, racquet sports, Beach Club, and social facilities.\n12 rounds of golf October 1 – May 1\nUnlimited golf May 2 – September 30\nUnlimited use of the practice facilities\nThree-day priority sign-up to reserve golf tee times\nSix-day priority sign-up to reserve racquet sport court times\nNo court fees\nLimited Time Offers\n1-Year Trial Membership\nEnjoy the benefits of a Full Membership for 1 year without the initiation fee.\n110% of Full Membership dues\nSummer Membership\nWant to experience all that Grand Harbor Golf & Beach Club have to offer? Enjoy Full Membership benefits* from May 1 – September 30.\nThis is a one-time opportunity to experience Grand Harbor Golf & Beach Club. You may not join as a summer member in future years.\n*Summer Members do not receive the vertical family privilege.\n1-Year Trial Membership\nEnjoy the benefits of a Full Membership for 1 year without the initiation fee.\n110% of Full Membership dues\n1-Year Trial Membership\nEnjoy the benefits of a Full Membership for 1 year without the initiation fee.\n110% of Full Membership dues\nSummer Membership\nWant to experience all that Grand Harbor Golf & Beach Club have to offer? Enjoy Full Membership benefits* from May 1 – September 30.\nThis is a one-time opportunity to experience Grand Harbor Golf & Beach Club. You may not join as a summer member in future years.\n*Summer Members do not receive the vertical family privilege.\nSummer Membership\nWant to experience all that Grand Harbor Golf & Beach Club have to offer? Enjoy Full Membership benefits* from May 1 – September 30.\nThis is a one-time opportunity to experience Grand Harbor Golf & Beach Club. You may not join as a summer member in future years.\n*Summer Members do not receive the vertical family privilege.\nFeatured News\nAward-winning host and journalist Parker Kelley dives into the Grand Harbor Golf & Beach Club lifestyle, highlighting our amenities and vibrant community.\nMembership Inquiry\nFill out the form below for more information.\nName\nEmail\nAddress\nMessage\nHow did you hear about us?\nHow did you hear about us?\nSearch Engine (Google, Yahoo, etc.)\nInternet Advertisement\nSocial Media (Facebook, Instagram, etc.)\nNewspaper or Publication\nRecommended by a Friend\nSUBMIT\nWe really enjoy living at Grand Harbor because of everything it offers to members: golfing, tennis, pickleball, bocce, the fitness\ncenter with exercise classes, the Beach Club, great food and drinks,\nfrequent event\ns, and most importantly, the wonderful friendships and\nfellowship. There's never a dull moment, always something to do and\nfriends to see!\nSteve and Tracy Mooney, Grand Harbor Members\nClubhouse:\n4985 Club Terrace,\nVero Beach, Florida 32967\n772-778-9000\nBeach Club:\n8500 Highway A1A,\nVero Beach, Florida 32963\n772-231-2600\nTwitter\nInstagram\nFacebook-f\nPhone-alt\nEnvelope\nQuick Links\nAbout\nMembership\nMembership Portal\nTerms of Service\nContact Us\nINQUIRE TODAY\nFirst Name\nLast Name\nEmail\nAddress\nMessage\nSUBMIT",
      "emails": [
        "membership@grandharbor.com"
      ]
    }
  ],
  "all_links": [
    "https://grandharbor.com/contact/",
    "https://grandharbor.com/",
    "https://grandharbor.com/tennis/",
    "https://grandharbor.com/wp-content/uploads/2024/09/Grand-Harbor-Oceanfront-Beach3.webp",
    "https://member.grandharbor.com/grand-life-public-archive",
    "https://member.grandharbor.com/member-login",
    "https://grandharbor.com/about/",
    "https://grandharbor.com/wp-content/uploads/2023/12/Grand-Harbor-Chefs-Table-04-OPTIMIZED.webp",
    "https://grandharbor.com/wp-content/uploads/2023/10/Grand-Harbor-Beach-Umbrella-Cocktail.webp",
    "https://grandharbor.com/wp-content/uploads/2023/12/Clubhouse-Sunset-OPTIMIZED-scaled.webp",
    "https://grandharbor.com/golf/",
    "http://grandharbor.com/terms-of-service/",
    "https://grandharbor.com/experiences/",
    "https://grandharbor.com/dining/",
    "https://grandharbor.com/wp-content/uploads/2023/10/Grand-Harbor-Golf-Club-swinging.webp",
    "https://grandharbor.com/wp-content/uploads/2023/10/grand-harbor-social-event.webp",
    "https://grandharbor.com/wp-content/uploads/2023/12/Group-of-Golfers-OPTIMIZED.webp",
    "https://grandharbor.com/wp-content/uploads/2023/10/grand-harbor-member-playing-tennis.webp",
    "https://grandharbor.com/beach-club/",
    "mailto:membership@grandharbor.com",
    "https://grandharbor.com/fitness/",
    "https://grandharbor.com/wp-content/uploads/2023/12/Grand-Harbor-Chefs-Table-07-OPTIMIZED.webp",
    "https://grandharbor.com/membership",
    "http://grandharbor.com/",
    "https://grandharbor.com/wp-content/uploads/2023/12/ShellRoomOpening.26January2023.BobJoy-6-OPTIMIZED.webp",
    "https://grandharbor.com/wp-content/uploads/2024/08/PL-Grand-Harbor-BC-Aerial-D-2.webp",
    "https://grandharbor.com/contact-grand-harbor/",
    "https://grandharbor.com/membership/",
    "https://grandharbor.com/wp-content/uploads/2024/08/Grand-Harbor-Golf-Pillar.webp"
  ],
  "candidate_links": [
    "https://grandharbor.com/contact/",
    "https://member.grandharbor.com/member-login",
    "https://grandharbor.com/about/",
    "https://grandharbor.com/contact-grand-harbor/",
    "https://grandharbor.com/membership/"
  ],
  "visited": [
    "https://grandharbor.com/",
    "https://grandharbor.com/about",
    "https://grandharbor.com/contact",
    "https://grandharbor.com/staff",
    "https://grandharbor.com/team",
    "https://grandharbor.com/board",
    "https://grandharbor.com/directory",
    "https://grandharbor.com/events",
    "https://grandharbor.com/sitemap.xml",
    "https://grandharbor.com/council",
    "https://grandharbor.com/leadership",
    "https://grandharbor.com/management",
    "https://grandharbor.com/producers",
    "https://grandharbor.com/support",
    "https://grandharbor.com/crew",
    "https://grandharbor.com/members",
    "https://grandharbor.com/bios",
    "https://grandharbor.com/people",
    "https://grandharbor.com/artists",
    "https://grandharbor.com/musicians",
    "https://grandharbor.com/faculty",
    "https://grandharbor.com/administration",
    "https://grandharbor.com/contact/",
    "https://member.grandharbor.com/member-login",
    "https://grandharbor.com/about/",
    "https://grandharbor.com/contact-grand-harbor/",
    "https://grandharbor.com/membership/"
  ],
  "base_url": "https://grandharbor.com/"
}