{
  "pages": [
    {
      "url": "https://gulfharborsyc.com/about-us/",
      "is_candidate": false,
      "has_email": false,
      "text": "ABOUT GULF HARBORS YACHT CLUB\nABOUT GULF HARBORS YACHT CLUB\nGulf Harbors Yacht Club\nwelcomes all who would like to meet new friends, enjoy the outstanding view, partake in many different social events, support the community, and enjoy the best food and drinks in the area.\nOur Purpose\nFor over fifty years, the Gulf Harbors Yacht Club has warmly welcomed everyone interested in boating events, dining in a friendly atmosphere, and meeting new friends. Boat ownership is not a requirement for joining Gulf Harbors Yacht Club; neither is living in the Gulf Harbors neighborhoods.\nGulf Harbors Yacht Club welcomes all.\nOur History\nOn March 15, 1965, the Officers and Board of Directors of the Floramar Cruise Club, Inc. adopted a resolution to amend the Articles of Incorporation, changing the Club’s name to\nGulf Harbors Yacht Club, Inc.\nThe new organization received its charter on April 27, 1965 and was registered with Lloyds Registry on May 5, 1965.\nThe Club was commissioned on June 19, 1965 with Harry Cadenhead serving as its first commodore. The Club occupied a residential type building at #16 Floramar Terrace owned by the Lindrick Corp., a subsidiary of the Henry Crown & Co., Chicago, and developers of Gulf Harbors, from 1965 to 1973. Rent was $15.00 per month plus utilities. This building was demolished in 1973 to make way for construction of the Sea Castle condominiums.\nClub meetings were held in the auditorium of Clearwater Federal Savings & Loan Assn. for a short time. Then meetings and parties took place in the Gulf Harbors Civic Association Building until 1978. In 1972, the Lindrick Corp. offered to donate a strip of land on the North Channel in the present Gulf Harbors Beach Club Estates area.\nThis offer was withdrawn early in 1975, and on April 7, 1975, the company gave the Club a letter of intent to conclude our final location on the North Channel at the west end of Marine Parkway in the Gulf Harbors Woodlands Community. At a regular meeting on May 10, 1976, the membership authorized the building committee, headed by Rear Commodore Harold R. Haney, to proceed with plans for the construction of a clubhouse on the new site. With the help of many officers and members, the building was completed and commissioned on February 12, 1978.\nIOBG Chapter\nThe International Order of the Blue Gavel (IOBG) is an international organization made up of Past Commodores from qualified yacht clubs. Its primary mission is to promote the highest ideals of yachting; preserve yacht club customs and traditions; and provide social, educational and humanitarian programs. In doing so, it also recognizes past commodores from the international yachting community.\nThe IOBG is governed by an International Board of Directors, Regional Districts and local Chapters. All of Florida is\nDistrict 8\nwhere the previous Director was Karen Shea from our GHYC. Karen also served as the South East Vice President and was instrumental in bringing into the fold of the IOBG the Hemmingway Yacht Club of Cuba. The current President of District 8 is Kathy Hockenberry, previously affiliated with the GHYC. Three past GHYC commodores have also led District 8: John Snow 1990, John Button 2001 and Joe King 2005.\nLocally, our GHYC IOBG Chapter was chartered on October 10, 1982. The current president is Maria Reza, vice president Jeff Ruggiero, Secretary Bill Gilmore and Treasurer Karen Shea. The GHYC Chapter (11 members) meets six times a year and is responsible for the GHYC annual Change of Watch and the Commodore’s Ball.\nThe chapter has provided significant monetary support to the Club’s youth sailing camp, started and hosted for numerous years the GHYC Member(s) of the Year recognition program and has hosted numerous other events like the Pig Roast, Spaghetti Feast, fish fries and memorial events.\nThe Gulf Harbors Yacht Club offers reciprocity to all International Order of the Blue Gavel (IOBG) members with a valid membership card.\n727-849-4559\n3926 Marine Parkway\nNew Port Richey, FL 34652\nEmail Us\nClick to Review Us on Google",
      "emails": []
    },
    {
      "url": "https://gulfharborsyc.com/about-us/leadership/",
      "is_candidate": false,
      "has_email": false,
      "text": "LEADERSHIP\nLEADERSHIP\n(Front Row, Left to Right)\nTami Handler, Director; Jeanne Angus, Future Planning; Carol Shepard, House; Johanna Thirkill, Membership Director; Pat Hermann, Fleet Champlain\n(Back Row)\nBill Gilmour, P/C Advisor; Ken Skaggs, Secretary; Paul Schroder, Fleet Captain; Mark Morningstar, Rear Commodore; Brian Zamorski, Commodore; Rich Cantwell, Vice Commodore; Steve Wilsey, Treasurer; Tom Mitchell, By Laws\nNot Pictured: Nancy Mann, Fleet Surgeon; Sherri Weiler, Anchorettes President.\nBridge\nCommodore\nVice Commodore\nRear Commodore\nBrian Zamorski\nRich Cantwell\nMark Morningstar\n#tablepress-3 from cache\nStaff Officers & Directors\nTitle\nName\nTitle\nName\nSecretary\nKen Skaggs\nMembership Chair\nJohanna Thirkill\nTreasurer\nSteve Wilsey\nFuture Planning\nJeanne Angus\nFleet Captain\nPaul Schroder\nHouse\nCarol Shepard\nP/C Advisor\nBill Gilmour\nLounge\nMark Morningstar\nAnchorettes\nPresident\nSherri Weiler\nDirector\nTami Handler\n#tablepress-4 from cache\nAppointments and Committees\nTITLE\nNAME\nTITLE\nNAME\nDockmaster\nTBD\nGaming\nPat Hermann-P/C Karen Shea\nFleet Chaplain\nPat Hermann\nIOBG President\nP/C Maria Reza\nFleet Surgeon\nNancy Mann\nPublicity\nJudi Pobst\nSergeant at Arms\nTom Mann\nBanquets\nDebi Toth/Tami Handler\nGalley/Lounge\nBrian Zamorski/Mark Morningstar\nSergeant at Arms\nTom Mann\nBy-Laws & Rules Chair\nTom Mitchell\nSocail\nDora Cantwell\nScholarship\nJeanne Angus\\Claudia Cox\nSocial Media\nJudi Pobst\nFinance & Budgets\nRich Cantwell\nSoundings Editor\nBrian Zamorski\nCommunications\nDebi Toth\nTLC\nSharon Lyle\n#tablepress-5 from cache\n727-849-4559\n3926 Marine Parkway\nNew Port Richey, FL 34652\nEmail Us\nClick to Review Us on Google",
      "emails": []
    },
    {
      "url": "https://gulfharborsyc.com/community-service/charity-support/",
      "is_candidate": false,
      "has_email": false,
      "text": "CHARITY SUPPORT\nCHARITY SUPPORT\nMembers of the Gulf Harbors Yacht Club are active in community service, both in their private lives and as Club members. Each year, the Club is privileged to support one or more local charities with monetary donations.\nWe have been able to assist many charities, including:\nPasco Kids First\nFostering Hope\nSPCA\nToys for Tots\nGulf Harbors Yacht Club is also a\nToys for Tots\ncollection site.  Historically, our members’ generosity has filled more than 4 overflowing boxes with toys and bicycles to support this important effort.\nPACE Center for Girls\nAnnual Children’s Christmas Party\nAnother way Gulf Harbors Yacht Club gives back to the community. Area children are invited to join us for a Saturday lunch and meet Santa party, where carols are sung and Santa arrives by boat with presents for all.\nOne Community Now\nSt. Vincent de Paul Food Bank\nWe are very proud of our donations to the St. Vincent de Paul food bank.  Our contributions assist the charity in distributing food to local families in need.\nThe efforts of our\nAnchorettes\nmakes much of this possible.\n727-849-4559\n3926 Marine Parkway\nNew Port Richey, FL 34652\nEmail Us\nClick to Review Us on Google",
      "emails": []
    },
    {
      "url": "https://gulfharborsyc.com/event-venue/",
      "is_candidate": false,
      "has_email": false,
      "text": "EVENT VENUE\nEVENT VENUE\nEvent Venue\nGulf Harbors Yacht Club\noffers the finest on-the-water din\ning and banquet facilities in the area. With the greatest view of the North Channel in New Port Richey, there is no better location for a lovely sunset wedding ceremony than on the grounds of Gulf Harbor Yacht Club.\nThe lounge area overlooks the beautiful North Channel with a screened lanai and lovely grounds. The perfect combination for outdoor ceremonies, complimented by the fabulous sunsets. The elegant dining room can accommodate up to 100 persons. Our dining room & lounge, together can accommodate 140. Our dance floor is perfect for the bride and groom’s first dance or for an anniversary waltz by the happy couple celebrating any number of years together.\nOur talented chef and dedicated staff will work closely with you to ensure that your event will be as perfect as possible. Chef David is a graduate of\nThe Culinary Institute of America\nand has been with GHYC for 10 years. Our Mixologist has been pouring our favorite drinks for 20 years and the waitstaff of 7 years will work to make your guests feel like members.\nOur outstanding staff will make your plated dinners elegant and delicious.\n727-849-4559\n3926 Marine Parkway\nNew Port Richey, FL 34652\nEmail Us\nClick to Review Us on Google",
      "emails": []
    }
  ],
  "all_links": [
    "https://gulfharborsyc.com/community-service/anchorettes/fashion-show/",
    "https://gulfharborsyc.com/community-service/north-channel-clean-up/",
    "https://gulfharborsyc.com/community-service/anchorettes/",
    "https://gulfharborsyc.com/facilities/burgee-lounge-galley/#burgee",
    "https://gulfharborsyc.com/community-service/student-scholarships/",
    "https://gulfharborsyc.com/privacy-policy/",
    "https://gulfharborsyc.com/about-us/#history",
    "https://gulfharborsyc.com",
    "https://gulfharborsyc.com/about-us/#iobg",
    "https://gulfharborsyc.com/burgee-lounge-galley/",
    "https://gulfharborsyc.com/join-us/",
    "https://gulfharborsyc.com/activities/calendar/",
    "https://gulfharborsyc.com/activities/regatta/",
    "https://gulfharborsyc.com/about-us/",
    "https://gulfharborsyc.com/about-us/leadership/",
    "https://gulfharborsyc.com/",
    "https://gulfharborsyc.com/community-service/charity-support/",
    "https://gulfharborsyc.com/community-service/",
    "https://gulfharborsyc.com/event-venue/",
    "https://gulfharborsyc.com/facilities/#transient",
    "https://gulfharborsyc.com/docks-slips",
    "https://gulfharborsyc.com/contact-us/",
    "https://gulfharborsyc.com/activities/",
    "https://gulfharborsyc.com/about-us/#purpose",
    "https://gulfharborsyc.com/about-us/location/"
  ],
  "candidate_links": [
    "https://gulfharborsyc.com/about-us/",
    "https://gulfharborsyc.com/about-us/leadership/",
    "https://gulfharborsyc.com/community-service/charity-support/",
    "https://gulfharborsyc.com/event-venue/"
  ],
  "visited": [
    "https://gulfharborsyc.com/",
    "https://gulfharborsyc.com/about",
    "https://gulfharborsyc.com/contact",
    "https://gulfharborsyc.com/staff",
    "https://gulfharborsyc.com/team",
    "https://gulfharborsyc.com/board",
    "https://gulfharborsyc.com/directory",
    "https://gulfharborsyc.com/events",
    "https://gulfharborsyc.com/sitemap.xml",
    "https://gulfharborsyc.com/council",
    "https://gulfharborsyc.com/leadership",
    "https://gulfharborsyc.com/management",
    "https://gulfharborsyc.com/producers",
    "https://gulfharborsyc.com/support",
    "https://gulfharborsyc.com/crew",
    "https://gulfharborsyc.com/members",
    "https://gulfharborsyc.com/bios",
    "https://gulfharborsyc.com/people",
    "https://gulfharborsyc.com/artists",
    "https://gulfharborsyc.com/musicians",
    "https://gulfharborsyc.com/faculty",
    "https://gulfharborsyc.com/administration",
    "https://gulfharborsyc.com/about-us/",
    "https://gulfharborsyc.com/about-us/leadership/",
    "https://gulfharborsyc.com/community-service/charity-support/",
    "https://gulfharborsyc.com/event-venue/"
  ],
  "base_url": "https://gulfharborsyc.com/"
}