{
  "pages": [
    {
      "url": "https://heatonsverobeach.com/events",
      "is_candidate": false,
      "has_email": true,
      "text": "Google Tag Manager (noscript)\nEnd Google Tag Manager (noscript)\nMenu\nAbout\nGroup Dining\nEvents\nPress\nGallery\nReservations\nInstagram\nOpen Menu\nxml version=\"1.0\" encoding=\"UTF-8\"?\nxml version=\"1.0\" encoding=\"UTF-8\"?\nMenu\nAbout\nGroup Dining\nEvents\nPress\nGallery\nReservations\nInstagram\nA Soundtrack for the Shore\nAs lovers of live performances, Heaton’s frequently invites top local and regional musicians to join us, playing live at the edge of the ocean. Throughout the week, we invite you to explore our entertainment offerings, all of which allow you to step seamlessly from the warm sand into the cool sound of music.\nLive Music Schedule\nSelect a date to check out what's happening.\nFeatured Events\nMotown Halloween\nOctober 31 | 6:00pm - 9:00pm\nA Motown Halloween Party at Heaton’s featuring MR. MOTOWN\nRaffles | Giveaways | $250 Costume Contest Prize\nReservations recommended.\nReserve Your Spot\nBeach Bonfire\nNovember 8\nLive Music 6:00pm - 9:00pm | Bar Until 11:00pm\nEnjoy food and drinks on the beach, plus a live performance by Easter Harbor. Hang out afterward for drink specials at Heaton's Bar until 11pm. Free event, no tickets required!\n'\nPhone:\n(772) 469-4444\nGeneral Inquiries:\nInfo@heatonsverobeach.com\nPress Inquiries:\nPress@heatonsverobeach.com\nHeaton's HOURs\nLunch\nFri - Sun | 11AM - 3PM\nHappy Hour\nDaily | 3PM - 4PM\nDinner\nFri - Sat | 5PM - 9PM\nBar (With Food Service)\nDaily | 11AM - 9PM\nAddress\n3500 Ocean Drive, Vero Beach, FL 32963\nPark on us!\nEnjoy complimentary Valet Parking when dining at Cobalt or Heaton's. Valid for up to three hours.\nHeaton's will be closed for private events on 11/7, 11/15, 11/22, 12/5, 12/12.\nMake a Reservation\nStay In Touch\nEmail Address\nInstagram\nFacebook\nKimpton Vero Beach Hotel and Spa\nA Kimpton Restaurant\nPrivacy & Legal\nYour CA Privacy Rights\nCareers",
      "emails": [
        "info@heatonsverobeach.com",
        "press@heatonsverobeach.com"
      ]
    },
    {
      "url": "https://heatonsverobeach.com/about",
      "is_candidate": false,
      "has_email": true,
      "text": "Google Tag Manager (noscript)\nEnd Google Tag Manager (noscript)\nMenu\nAbout\nGroup Dining\nEvents\nPress\nGallery\nReservations\nInstagram\nOpen Menu\nxml version=\"1.0\" encoding=\"UTF-8\"?\nxml version=\"1.0\" encoding=\"UTF-8\"?\nMenu\nAbout\nGroup Dining\nEvents\nPress\nGallery\nReservations\nInstagram\nSeaside eats and oceanfront drinks\nVero (Italian) adjective: “veh-ROH” – true\nIf Vero Beach is the “true” beach of Florida’s Atlantic coast, then Heaton’s is its “true” oceanfront restaurant. Steps from the sand, we offer lunch and dinner daily, with  waterfront, sweeping ocean vistas by day, and a crackling firepit by night.\nMeet Our Team\nJacob Turner, Lead Bartender\nJacob Turner isn’t just a gin enthusiast – he’s a walking canvas. (No, really: ask him about his gin tattoo.) He brings unmistakable passion, along with a wealth of experience and a genuine love of hospitality, to Heaton’s and our sister restaurant\nCobalt\n, where he develops and oversees our menus of craft cocktails, beers, wines, and spirits. A veteran of local favorite Southern Social, where he crafted an artful selection of house-made syrups, shrubs, and infusions, he is known among locals and regular visitors to Vero Beach alike for his boldly flavored, seasonal libations. His work in catering makes him a natural choice to design beverage menus for events of all sizes, and his warm presence behind the bar will make you feel instantly at ease, whether you are joining us for a hard-earned vacation or just a much-needed happy hour.\nMatt Lange, Executive Chef\nMatt Lange joins Kimpton Vero Beach Hotel & Spa as Executive Chef.\nChef Matt honed his skills in hotel kitchens such as the Omni Orlando Hotel at Champions Gate, Rosen Shingle Creek, and Peabody Hotel Orlando. He even took to the seas as sous chef for Silversea Cruises LTD in the Baltic Sea. Following his European stint, Matt returned to solid ground to join the team at Michelin-starred NoMi Kitchen inside Park Hyatt Chicago. His four and a half year tenure at NoMi Kitchen influenced his culinary direction focusing on seasonal, refined American cooking.\nIn 2015, he joined Loews Chicago Hotel, where he held various positions including Executive Sous Chef of the hotel. In late 2017, he was tapped to open the new concept LIVE! By Loews in St. Louis, located atop the famed Cardinals stadium.\nChef Matt joined Kimpton Vero Beach Hotel & Spa in early 2022 and is excited to bring his commitment to quality to the resort’s menus. He applies many of the same methods to running a successful kitchen as he would a coach of a sports team. “I believe developing the culture is an extremely important element in the kitchen,” he explains. “It is what keeps the team excited, motivated, and generating quality dishes. I feel it is essential that everyone understands that it is a team effort and that collaboration is what makes a great kitchen.”\nWhen not in the kitchen, he can be found on the golf course perfecting his swing or fishing, or spending quality time with his family.\nErin O'Keefe, Sommelier\nErin O’Keefe is the new Sommelier at Kimpton Vero Beach Hotel & Spa. She oversees the wine program for the beachfront resort, Cobalt, and Heaton’s.\nErin is creating a wine list that is welcoming to all and will transport you around the world. This program includes wines with little intervention, where the winemaker has allowed the terroir to shine in such a way that visiting Cobalt is a first-class seat to the best wineries. A rosé from Provence and the coastal breeze will leave you with the sensation of standing in a vineyard in the South of France; and a Brunello from Montalcino that will transport you to the sweeping countryside of Tuscany and make you wonder if those palm trees are actually cypress trees.\nBorn in Petoskey, Michigan, Erin was introduced to the restaurant world in 2010 when she helped her mom open a family restaurant, The Twisted Olive. The coastal Mediterranean inspired restaurant was such a success it spurred the interest of Master Sommelier Ron Edwards who created one of Michigan’s most unique wine lists for them. Through his guidance and training Erin went on to get wine certifications and in the fall of 2017 Erin began an internship on a Champagne Vineyard in Charly-sur-Marne, France, Baron Fuente. She spent that fall in Champagne learning the ins and outs of production.\nDuring 2020 Erin took the opportunity to complete her Wine Spirit and Education Trust Level 2 certification through the Napa Valley Wine Academy and begin her own wine collection to make the most of having more time at home. She also started a blind tasting group, a skill that she is working on perfecting as part of her preparation for her WSET Level 3 certification.\nWine lovers of all levels will enjoy the knowledge Erin has to offer.\nMarco Fanelli, General Manager\nGeneral Manager Marco Fanelli oversees food and beverage across the Kimpton Vero Beach Hotel & Spa, bringing the same gracious hospitality of Heaton’s to our sister restaurant,\nCobalt\nand our in-room dining program. His career has taken him from his family restaurant on Long Island to the University of Central Florida, where he studied Hospitality Management. Working with Marriott, the Ritz-Carlton and the Four Seasons taught him to make each experience unique and special, and prepared him to oversee our welcoming hotel and restaurants in picture-perfect Vero Beach. You’ll often see him at Heaton’s, checking in on your experience and working closely with his expert team to be sure that our food, drinks and service match our beautiful surroundings.\nJeffret Gillespie, Assistant General Manager\nJeffrey’s passion for food and beverage began in the city of brotherly love. Having studied hospitality management at Walnut Hill College, he took a job serving at Bibou BYOB that has accumulated accolades from the NYT, Philadelphia Inquirer, and allowed him to develop a knowledge of fine wine and elegant service. Jeffrey went on to open Le Cheri where he curated their beverage program and would guide neighborhood folks and oenophiles alike through the restaurant's impressive French & Swiss wine list. After Le Cheri, Jeffrey had the opportunity to reopen a newly renovated Bibou as General Manager. Here he was able to elevate the dining experience and refine the service to accentuate the new tasting menu concept and hone that knowledge of fine wine even more.\nJeffrey joined the Kimpton Vero Beach Hotel and Spa family in April of 2022 as a restaurant manager overseeing both Cobalt and Heaton’s restaurants. Jeffrey has built a great relationship with the team around him and utilizes their strengths to best accommodate the guests. He has a hands-on approach to management and likes to lead by example.\nOutside of work Jeffrey loves to spend time on the golf course, the beach, and on the river in his kayak. Jeffrey has developed a palate for tequila and loves to sip on a nice reposado from time to time.\n'\nPhone:\n(772) 469-4444\nGeneral Inquiries:\nInfo@heatonsverobeach.com\nPress Inquiries:\nPress@heatonsverobeach.com\nHeaton's HOURs\nLunch\nFri - Sun | 11AM - 3PM\nHappy Hour\nDaily | 3PM - 4PM\nDinner\nFri - Sat | 5PM - 9PM\nBar (With Food Service)\nDaily | 11AM - 9PM\nAddress\n3500 Ocean Drive, Vero Beach, FL 32963\nPark on us!\nEnjoy complimentary Valet Parking when dining at Cobalt or Heaton's. Valid for up to three hours.\nHeaton's will be closed for private events on 11/7, 11/15, 11/22, 12/5, 12/12.\nMake a Reservation\nStay In Touch\nEmail Address\nInstagram\nFacebook\nKimpton Vero Beach Hotel and Spa\nA Kimpton Restaurant\nPrivacy & Legal\nYour CA Privacy Rights\nCareers",
      "emails": [
        "info@heatonsverobeach.com",
        "press@heatonsverobeach.com"
      ]
    }
  ],
  "all_links": [
    "mailto:Info@heatonsverobeach.com?subject=General%20Inquiry%20Heaton's",
    "mailto:Press@heatonsverobeach.com?subject=Press%20Inquiry%20Heaton's",
    "https://heatonsverobeach.com/private-dining",
    "https://heatonsverobeach.com/",
    "https://heatonsverobeach.com/menu",
    "https://heatonsverobeach.com/events",
    "https://heatonsverobeach.com/about",
    "https://heatonsverobeach.com/gallery",
    "https://heatonsverobeach.com/press"
  ],
  "candidate_links": [
    "https://heatonsverobeach.com/events",
    "https://heatonsverobeach.com/about"
  ],
  "visited": [
    "https://heatonsverobeach.com/",
    "https://heatonsverobeach.com/about",
    "https://heatonsverobeach.com/contact",
    "https://heatonsverobeach.com/staff",
    "https://heatonsverobeach.com/team",
    "https://heatonsverobeach.com/board",
    "https://heatonsverobeach.com/directory",
    "https://heatonsverobeach.com/events",
    "https://heatonsverobeach.com/sitemap.xml",
    "https://heatonsverobeach.com/council",
    "https://heatonsverobeach.com/leadership",
    "https://heatonsverobeach.com/management",
    "https://heatonsverobeach.com/producers",
    "https://heatonsverobeach.com/support",
    "https://heatonsverobeach.com/crew",
    "https://heatonsverobeach.com/members",
    "https://heatonsverobeach.com/bios",
    "https://heatonsverobeach.com/people",
    "https://heatonsverobeach.com/artists",
    "https://heatonsverobeach.com/musicians",
    "https://heatonsverobeach.com/faculty",
    "https://heatonsverobeach.com/administration",
    "https://heatonsverobeach.com/events",
    "https://heatonsverobeach.com/about"
  ],
  "base_url": "https://heatonsverobeach.com/"
}