{
  "pages": [
    {
      "url": "https://hiddenlakesgolfclub.com/memberships/",
      "is_candidate": false,
      "has_email": true,
      "text": "Membership\nSingle and Couple Memberships available.\nAnnual Golf Members can play an unlimited amount of golf throughout the year.\n7-day advanced tee times.\nAnnual Trail Fees available.\nJuniors in high school or younger are included in any annual golf membership.\nNo additional charge to walk and walking permitted any time throughout the year.\nMotorized carts can be rented by the round or on an annual basis.\n15% Discount on Pro Shop Merchandise, excluding balls, gloves, clubs and sale items.\nIndividual and Couple Memberships available.\n7-Day advanced tee times.\nWalk at any time.\n15% Discount on Pro Shop Merchandise, excluding balls, gloves, clubs, and sale items.\nSingle and Couple Memberships available.\nAnnual Golf Members can play an unlimited amount of golf after noon throughout the year.\n7-day advanced tee times.\nAnnual Trail Fees available..\nJuniors in high school or younger are included in any annual golf membership.\nNo additional charge to walk and walking permitted any time throughout the year.\nMotorized carts can be rented by the round or on an annual basis.\n15% Discount on Pro Shop Merchandise, excluding balls, gloves, clubs and sale items.\nOptional Discounted Driving Range plans.\nSingle and Family Memberships available.\nSummer Golf Members can play unlimited golf from May 1 through October 31 or December 31. (6 or 8-month season available – both start May 1st).\n7-day advanced tee times.\nAnnual Trail Fees are available.\nNo additional charge to walk, and walking is permitted any time throughout the year.\nMotorized carts can be rented by the round.\n15% Discount on Pro Shop Merchandise, excluding balls, gloves, clubs, and sale items.\nUnlimited Golf May 1 – October 31, 2025\nPlay any time of the day & any day of the Week.\nMandatory cart fee of $25 for 18 holes & $15 for 9 holes.\nMake Tee Times up to a week in advance.\nMember discounts in the Pro Shop.\nAvailable on an individual basis for juniors ages 18 or below or if enrolled in college, age 22 and below.\nJunior Golf Members can play an unlimited amount of golf throughout the year.\n7-day advanced tee times.\nComplimentary use of the Driving Range and Practice Green.\nNo additional charge to walk and walking permitted any time throughout the year.\nMotorized carts can be rented by the round or on an annual basis. Must have a valid driver’s license to rent cart.\n15% Discount on Pro Shop Merchandise, excluding balls, gloves, clubs and sale items.\nName\n(Required)\nFirst\nLast\nEmail\n(Required)\nPhone\n(Required)\nMembership of Interest\n(Required)\nAnnual Golf Membership\nSizzlin' Summer Golf Membership\nSummer Membership\nLimited Golf Membership\nJunior Golf Membership\nOther\nAdditional Comments\nhCaptcha\nΔ\nLocation:\n35 Fairgreen Avenue\nNew Smyrna Beach, FL 32168\nPhone:\n(386) 427-4138",
      "emails": [
        "robert@hiddenlakesgolfclub.com"
      ]
    },
    {
      "url": "https://hiddenlakesgolfclub.com/course-details/",
      "is_candidate": false,
      "has_email": false,
      "text": "Course Details\nLooking for an enjoyable time playing golf on a well-conditioned public course at reasonable rates? Then you’ve come to the right place! Our New Smyrna Beach par 69 golf course has 6 par threes, 9 par fours and 3 par fives. We pride ourselves in our friendly and knowledgeable staff, terrific course conditions, and fun course layout, and can’t wait to show you a great time on our well-loved course.\nOne of the first things you need to know about Hidden Lakes is that we take course conditions seriously. As genuine golf nuts ourselves, we strive for the best course conditions possible. The course winds through large pines and stately oaks, along the pristine Turnbull Bay estuary and through beautiful lakes and winding creeks. With a variety of long and short holes, Hidden Lakes offers a fair and fun challenge to golfers of all skill levels.\nThe manicured practice facility provides everything a golfer needs, and the short game area is fantastic! From short chips, flop shots, bunker shots and up to 40 yard pitches you can hone your short game at the short game area. Our large putting green has a variety of slopes to work on putting mechanics. The putting green is the perfect place to settle the match with a putt off!\nLocation:\n35 Fairgreen Avenue\nNew Smyrna Beach, FL 32168\nPhone:\n(386) 427-4138",
      "emails": []
    },
    {
      "url": "https://hiddenlakesgolfclub.com/contact-us/",
      "is_candidate": false,
      "has_email": true,
      "text": "Leave us a message!\nWe want to hear from you. Your questions and concerns are of the utmost importance to us. Please use the form below to request additional information about our course, services and promotions. We’d also like to encourage you to voice any concerns you may have and let us know how we’re doing in our efforts to provide the best facility we can possibly provide.\nclose column table wrapper. Autoclose: 1\nMobile\nMobile\nPhone:\n386-427-4138\nHidden Lakes Golf Club\n35 Fairgreen Avenue\nNew Smyrna Beach, FL 32168\nMobile\nMobile\nEmail:\nrobert@hiddenlakesgolfclub.com\nclose column table wrapper. Autoclose: 1\nContact Us\nYour Name\n*\nFirst\nLast\nPhone\n*\nEmail\n*\nPlease Include Any Additional Details\n*\nhCaptcha\nX/Twitter\nThis field is for validation purposes and should be left unchanged.\nΔ\nclose column table wrapper. Autoclose: 1\nWe want to hear from you. Your questions and concerns are of the utmost importance to us. Please use the form below to request additional information about our course, services and promotions. We’d also like to encourage you to voice any concerns you may have and let us know how we’re doing in our efforts to provide the best facility we can possibly provide.\nMobile\nMobile\nPhone:\n386-427-4138\nHidden Lakes Golf Club\n35 Fairgreen Avenue\nNew Smyrna Beach, FL 32168\nMobile\nMobile\nEmail:\nrobert@hiddenlakesgolfclub.com\nContact Us\nYour Name\n*\nFirst\nLast\nPhone\n*\nEmail\n*\nPlease Include Any Additional Details\n*\nhCaptcha\nX/Twitter\nThis field is for validation purposes and should be left unchanged.\nΔ\nLocation:\n35 Fairgreen Avenue\nNew Smyrna Beach, FL 32168\nPhone:\n(386) 427-4138",
      "emails": [
        "robert@hiddenlakesgolfclub.com"
      ]
    },
    {
      "url": "https://hiddenlakesgolfclub.com/meet-the-team/",
      "is_candidate": false,
      "has_email": true,
      "text": "Meet the Team\nHidden Lakes prides itself in providing quality golf experience to everyone who visits our course. But, more than that, we pride ourselves in showing everyone a great time, and that starts with our staff. Everyone you meet on the Hidden Lakes staff offers impressive knowledge of our course as well as quality service not just because it’s our job, but also because we genuinely love the game and genuinely love our course. We can’t wait to welcome you!\nRead more\nRobert Schwab, the PGA Director of Golf and General Manager, is responsible for all areas of the golf operation including the Pro Shop, golf instruction and conducting tournaments. He became a member of the PGA Quarter Century Club in 2018.\nA third generation PGA Golf Professional, Robert has a lifetime of experience in the golf industry. He has been at the helm of Hidden Lakes since 2007 where his responsibilities are broad-ranging. Robert enjoys teaching golfers of all ages and skill levels. His positive attitude and ability to simplify the golf swing keep him busy on the range. Under his direction, Hidden Lakes provides individual lessons as well as clinics for beginners, ladies and juniors.\nRobert is a graduate of Jacksonville University and played 4 years of collegiate golf for the Dolphins earning All-America Scholar honors his senior year. Prior to Hidden Lakes, he worked at Sugar Mill Country Club for 15 years, 11 as the Director of Golf.\nA resident of New Smyrna Beach since 1991, Robert and his wife Jenni raised their two boys in New Smyrna Beach and call it home. Being the family friendly golf club, Hidden Lakes and Robert Schwab make a great team!\nContact Robert at (386) 427-4138 or email at\nrobert@hiddenlakesgolfclub.com\n.\nRead more\nA Florida native and Ponce Inlet resident, Grant got serious about his golf game while in the Hidden Lakes Junior Program a few short years ago. Shortly thereafter, he began working in the cart barn and expressed an interest in making golf his career. He quickly moved into the Pro Shop. He is a sponge when it comes to seeking and gaining knowledge about all areas of the Golf Operation and the Golf Swing. Grant is a polite, easy to like young man that is mature beyond his years. He is in the PGA PGM program currently!\nRead more\nIan was born and raised here in New Smyrna Beach. His parents introduced him into the game of golf at age 3. Growing up it was rare not to find Ian practicing or playing at one of the New Smyrna golf courses. After high school he decided to accept a golf scholarship offer from Flagler College in St. Augustine. There he helped Flagler reach the National Championship 3 times, he had one individual tournament win and was named an All-American his senior season. After graduating with a bachelor’s degree in business administration he decided to chase his dream and play golf professionally. In 2010, he won the Indian River Open at the New Smyrna Beach municipal golf course with rounds of 68-64. He would go on to win one more professional tournament. In 2013 he decided to shift paths and become a teaching professional.\nA bit about what makes Hidden Lakes home for Ian:\n“I was fortunate growing up in New Smyrna Beach, both Hidden Lakes and the municipal golf course welcomed and encouraged junior golfers to fall in love with the game. My instructor, PGA Professional Stu Sirbaugh, was a huge part of my success in the game of golf. Stu was very generous with his time and was always available when I needed help with my game. That really stuck with me, and now it’s my turn to give back and share my knowledge with today’s youth. I plan on carrying on what Robert and others have done here to make junior golf such a success.”\nRead more\nA native of Ocean City Maryland, a fan of the Orioles and the Maryland Terrapins, Jim knows a thing or two about Blue Crabs and all things Maryland. He served his country honorably in the Army and made a career in the wholesale plumbing, Heating and Air Conditioning Business. Jim ended up in Volusia County with the Carrier Corporation as a Territory Manager. Jim was a loyal Hidden Lakes customer while working. When he retired, he began working in the Pro Shop. Jim will tell you he began playing here because he enjoyed the people. Interestingly, that may be why he got the job.\nRead more\nA Boston native from North Quincy with the accent to back it up.  Mike is a huge hockey fan and ardently roots for the Bruins and New England Patriots.  Mike has a diverse background working in many fields such as computer operations, law enforcement and the newspaper industry.  After a stint living in Charleston, South Carolina, Mike and his wife moved to New Smyrna Beach where he began playing at Hidden Lakes.  After working a season as a starter, he moved into the Pro Shop.  Mike loves to talk hockey & enjoys the consistent banter with customers in the Pro Shop.\nLocation:\n35 Fairgreen Avenue\nNew Smyrna Beach, FL 32168\nPhone:\n(386) 427-4138",
      "emails": [
        "robert@hiddenlakesgolfclub.com"
      ]
    }
  ],
  "all_links": [
    "https://hiddenlakesgolfclub.com/gallery/",
    "https://hiddenlakesgolfclub.com/my-account/",
    "https://hiddenlakesgolfclub.com/meetings-special-occasions/",
    "https://hiddenlakesgolfclub.com/memberships/",
    "https://hiddenlakesgolfclub.com/events/month/?ical=1",
    "mailto:robert@hiddenlakesgolfclub.com",
    "https://hiddenlakesgolfclub.com/events/",
    "https://hiddenlakesgolfclub.com/course-details/",
    "https://hiddenlakesgolfclub.com/golf-simulator/",
    "https://hiddenlakesgolfclub.com/join-e-club/",
    "https://hiddenlakesgolfclub.com/events/month/2025-09/",
    "webcal://hiddenlakesgolfclub.com/?post_type=tribe_events&ical=1&eventDisplay=list",
    "https://hiddenlakesgolfclub.com/online-store/",
    "https://hiddenlakesgolfclub.com/events/month/?outlook-ical=1",
    "https://hiddenlakesgolfclub.com/",
    "https://hiddenlakesgolfclub.com/rates/",
    "https://hiddenlakesgolfclub.com/teaching-and-clinics/",
    "https://hiddenlakesgolfclub.com/19th-hole-restaurant/",
    "https://hiddenlakesgolfclub.com/golf-course-news/",
    "https://hiddenlakesgolfclub.com/junior-golf/",
    "https://hiddenlakesgolfclub.com/shop/",
    "https://hiddenlakesgolfclub.com/wp-content/uploads/2025/07/2024-2025-Annual-Memberships-single-page.pdf",
    "https://hiddenlakesgolfclub.com/tournaments/",
    "https://hiddenlakesgolfclub.com/driving-range/",
    "https://hiddenlakesgolfclub.com/events/month/2025-07/",
    "https://hiddenlakesgolfclub.com/find-golf-partners/",
    "http://www.hiddenlakesgolfclub.com/contact-us",
    "https://hiddenlakesgolfclub.com/events/list/",
    "https://hiddenlakesgolfclub.com/contact-us/",
    "https://hiddenlakesgolfclub.com/events/month/",
    "https://hiddenlakesgolfclub.com/cart/",
    "https://hiddenlakesgolfclub.com/meet-the-team/",
    "https://hiddenlakesgolfclub.com/events/today/"
  ],
  "candidate_links": [
    "https://hiddenlakesgolfclub.com/memberships/",
    "mailto:robert@hiddenlakesgolfclub.com",
    "https://hiddenlakesgolfclub.com/course-details/",
    "https://hiddenlakesgolfclub.com/contact-us/",
    "https://hiddenlakesgolfclub.com/meet-the-team/"
  ],
  "visited": [
    "http://www.hiddenlakesgolfclub.com/?utm_source=gmb&utm_medium=gmb&utm_campaign=sept&utm_term=main",
    "http://www.hiddenlakesgolfclub.com/about",
    "http://www.hiddenlakesgolfclub.com/contact",
    "http://www.hiddenlakesgolfclub.com/staff",
    "http://www.hiddenlakesgolfclub.com/team",
    "http://www.hiddenlakesgolfclub.com/board",
    "http://www.hiddenlakesgolfclub.com/directory",
    "http://www.hiddenlakesgolfclub.com/events",
    "http://www.hiddenlakesgolfclub.com/sitemap.xml",
    "http://www.hiddenlakesgolfclub.com/council",
    "http://www.hiddenlakesgolfclub.com/leadership",
    "http://www.hiddenlakesgolfclub.com/management",
    "http://www.hiddenlakesgolfclub.com/producers",
    "http://www.hiddenlakesgolfclub.com/support",
    "http://www.hiddenlakesgolfclub.com/crew",
    "http://www.hiddenlakesgolfclub.com/members",
    "http://www.hiddenlakesgolfclub.com/bios",
    "http://www.hiddenlakesgolfclub.com/people",
    "http://www.hiddenlakesgolfclub.com/artists",
    "http://www.hiddenlakesgolfclub.com/musicians",
    "http://www.hiddenlakesgolfclub.com/faculty",
    "http://www.hiddenlakesgolfclub.com/administration",
    "https://hiddenlakesgolfclub.com/memberships/",
    "mailto:robert@hiddenlakesgolfclub.com",
    "https://hiddenlakesgolfclub.com/course-details/",
    "https://hiddenlakesgolfclub.com/contact-us/",
    "https://hiddenlakesgolfclub.com/meet-the-team/"
  ],
  "base_url": "http://www.hiddenlakesgolfclub.com/?utm_source=gmb&utm_medium=gmb&utm_campaign=sept&utm_term=main"
}