{
  "pages": [
    {
      "url": "https://homehost.llc/contact-us",
      "is_candidate": false,
      "has_email": false,
      "text": "Contact Us\nLet's Connect\n/blockText\n/blockContent\n/blockContainer\nGIVE US A CALL\nCall Us:\n(305) 923-3337\n/blockText\n/blockContent\n/blockContainer\nOr Contact Us Online\nSubmit the form below to connect with us.\n/blockText\n/blockContent\n/blockContainer\n/blockContent\n/blockContainer",
      "emails": []
    },
    {
      "url": "https://homehost.llc/about-our-key-west-and-high-springs-properties",
      "is_candidate": false,
      "has_email": false,
      "text": "About Our Key West and High Springs Properties\nExplore Our Premier Vacation Properties\nOur luxurious rentals in Key West and High Springs are tailored to create the ultimate dream experience for every traveler.\nREACH OUT NOW\n305-923-3337\n/blockText\n/blockContent\n/blockContainer\nAbout Us\nAt Home Host Management LLC, we redefine the vacation experience by offering a diverse portfolio of properties designed to meet the needs of every guest.  As a vacation home rental management leader, we prioritize guest satisfaction and property maintenance. Whether you're seeking a romantic retreat for two or a spacious haven for up to twelve guests, our rentals provide the ideal setting for relaxation and enjoyment. Experience seamless hospitality and thoughtfully designed rental spaces that will make your stay unforgettable.\nBook with us today!\nBook Now\n(305) 923-3337\n/blockText\n/blockContent\n/blockContainer\nWhy Choose Our Properties\nShawn and Adele own and operate Home Host - a vacation rental management company. They strive to provide all the creature comforts necessary for the perfect vacation. There are many reasons why their properties are so special – ideal locations, exotic interiors, close attention to artistic detail, and exceptional hospitality.  Our focus on vacation property management ensures that every rental is meticulously maintained and ready for your arrival. You will find that any Home Host property will bring you unparalleled comfort, privacy, and relaxation. Shawn is a professional treasure hunter and TV personality on Discovery Channel’s show “Treasure Quest.” Adele is an avid ocean enthusiast and museum educator. They are both frequent world travelers. Adele is from New Guinea, and Shawn is from New England. \"Our Key West properties are closer to Cuba than the nearest Walmart, the climate is designated tropica,l and the air is salty – What more does a good vacation need?\"\n/blockText\n/blockContent\n/blockContainer\nYour Guide to Our Properties\nWe proudly offer exceptional vacation rentals in two of Florida's most desirable locations: Key West and High Springs. Each destination boasts its unique charm and attractions, providing a wide range of experiences tailored for different types of travelers.  Our commitment to excellence in vacation rental agencies ensures a place to stay and a complete experience to enhance your getaway.\n/blockText\n/blockContent\n/blockContainer\nKey West Rentals: Your Luxurious Tropical Escape\nWe offer exquisite rentals in Key West, where island charm meets modern luxury. Our properties are thoughtfully designed to provide both comfort and elegance, from spacious layouts and stunning ocean views to beautifully decorated interiors reflecting this tropical paradise's vibrant character.  With personalized service, we handle every aspect of vacation property management to ensure your stay exceeds expectations. Whether you’re lounging by the pool, enjoying gourmet dining, or exploring the rich culture of Key West!\nOur Properties\nHigh Springs Rentals: Nature’s Playground Awaits\nOur rental properties offer the perfect gateway to outdoor exploration and adventure in the heart of High Springs. This picturesque town is known for its crystal-clear springs and lush landscapes, making it a favorite destination for nature lovers. Our rentals are designed with modern amenities and cozy interiors.  As part of our comprehensive vacation home rental management services, we facilitate unique experiences that allow you to enjoy the best of High Springs. That means you can spend more time enjoying activities such as SCUBA diving or tubing in the springs, hiking scenic trails, or visiting local festivals!\nOur Properties\nYour Perfect Vacation Awaits\nAt Home Host Management LLC, we understand that your vacation is precious. Explore our short-term rentals, and let us help you craft the perfect vacation you will cherish for years to come!\nBook Now\n(305) 923-3337\n/blockText\n/blockContent\n/blockContainer",
      "emails": []
    }
  ],
  "all_links": [
    "https://homehost.llc/vacation-rentals-in-key-west-and-high-springs",
    "https://homehost.llc/reach-out-now",
    "https://homehost.llc/around-the-area-key-west-and-high-springs",
    "https://homehost.llc/faqs",
    "https://homehost.llc/blog",
    "https://homehost.llc/",
    "https://homehost.llc/property-management",
    "https://homehost.llc/contact-us",
    "https://homehost.llc/our-properties",
    "https://homehost.llc/privacy-policy",
    "https://homehost.llc/about-our-key-west-and-high-springs-properties",
    "https://homehost.llc/post-a-review"
  ],
  "candidate_links": [
    "https://homehost.llc/contact-us",
    "https://homehost.llc/about-our-key-west-and-high-springs-properties"
  ],
  "visited": [
    "https://homehost.llc/",
    "https://homehost.llc/about",
    "https://homehost.llc/contact",
    "https://homehost.llc/staff",
    "https://homehost.llc/team",
    "https://homehost.llc/board",
    "https://homehost.llc/directory",
    "https://homehost.llc/events",
    "https://homehost.llc/sitemap.xml",
    "https://homehost.llc/council",
    "https://homehost.llc/leadership",
    "https://homehost.llc/management",
    "https://homehost.llc/producers",
    "https://homehost.llc/support",
    "https://homehost.llc/crew",
    "https://homehost.llc/members",
    "https://homehost.llc/bios",
    "https://homehost.llc/people",
    "https://homehost.llc/artists",
    "https://homehost.llc/musicians",
    "https://homehost.llc/faculty",
    "https://homehost.llc/administration",
    "https://homehost.llc/contact-us",
    "https://homehost.llc/about-our-key-west-and-high-springs-properties"
  ],
  "base_url": "https://homehost.llc/"
}