{
  "pages": [
    {
      "url": "https://www.hoptinger.com/about",
      "is_candidate": false,
      "has_email": true,
      "text": "$\n$\n$\n$\n$\nABOUT US\n/$\n$\nHoptinger is a modern “Baverican” bier garden. We have more than 60 taps devoted to carefully selected craft beer along with a full liquor bar to serve countless libations and creations. We offer a unique menu of creative sausage dogs and other loosely Bavarian-inspired gastro pub food.\nThe back story of how Hoptinger came to be is different than most. Our recipes, culture and love of craft beer was passed along to us from an ancient civilization devoted to beer and sausage making for generations. SCROLL below to read the FULL legend.\n/$\n$\nSCROLL\n/$\n/$\n/$\n$\n$\n$\n$\n$\nTHE\nLEGEND &\nBEYOND\n/$\n$\nWe believe in good food, good company and adventurous times.\n/$\n$\nTHE LEGEND\n/$\n$\nLOCATIONS\n/$\n/$\n$\n/$\n/$\n/$\n/$\nAbout\n/$\n$\nTHE LEGEND\n$\n$\n$\n/$\n$\nHOW THE WURST WAS WON\n/$\n$\nThe Legend of Hoptinger\n/$\n$\n/$\n$\nCOLONEL\n/$\n$\nThe\n/$\n$\nThe story of the Hoptinger Bier Garden and Sausage House begins with a retired Gulf War colonel named Falke. Falke had lost his right arm in the war and hasn’t done much aside from drinking cheap beer and fixing up his home. It was just like any other night when Falke walked into his local bar. The bartender looked unusually different. Falke asked for “the usual,” but instead received a beer he didn’t recognize. Falke picked up the bottle with his left hand. A rabbit leapt across mountains on the label. At a closer look, Falke noticed the rabbit had tiny antlers and fangs. Intrigued and with not much thought, he took a sip. And with the second sip, his eyes slammed shut against his will. His body contracted and blackness immediately consumed his vision.\n/$\n$\n/$\n$\nHOPTINGER\n/$\n$\nThe\n/$\n$\nFalke was woken up by the sound of movement on the gravel floor. A tiny rodent with antlers scurried in the darkness before his feet. It whispered to Falke happily and said it would get him out of there. It started to chew at the ropes above his head. Within a few moments, the Colonel’s hands were freed and his body fell heavily on top of his knees. In front of him sat a Hoptinger, rabbit body, antlers and tiny fangs. This one was lucky enough to get wings. Its wings were pressed closely to its back and blended well with the brown and grey coloring of its fur. Falke blinked three times slowly to focus on the creature. It looked at him with a fondness, like they’ve met before. There was no time to linger. The Hoptinger led the way out of the factory. Up, down, right, left, and down again. The duo ran fast through the fog and trees until the Hoptinger stopped in front of Falke’s feet and said they had arrived. that bound his hands on a hook from the low ceiling. Falke’s feet barely touched the ground. He drifted into sleep and pictured his small home. alke followed the Hoptinger again vertically down a stone staircase that led to a door hidden by a curtain of vines. The creature pushed open the door with his antlers.\n/$\n$\nPROPHECY\n/$\n$\nThe\n/$\n$\n/$\n$\nThe door opened into a room that was filled with members of the Bruvarian rebel force. Around a rectangular brown table sat the remaining leaders. There was a blonde man, a dark-haired man and ginger man. Each drank biers respective in color. Women and children took up the remainder of floor space. Colonel Falke saw an old, plump woman on the opposite side of the room push her way through the crowd. She stopped just before the Colonel and stared down at his missing arm for a moment too long. She introduced herself as Lady Weissel and pointed to the wall.\n​\nAs legend goes, a carved wall displayed a man with a skewer for a right arm riding a flying pig. In the background, a Hoptinger jumped in front of a landscape of mountains. Falke’s memory came back for a moment. He remembered being at the bar. He remembered the label on the strange bottle. A one-armed man? Weissel looked at him and said he was the one. She talked about the war and the foul Count Mudger who crept out of the wicked forest and destroyed their lands. He stole their ancient and sacred recipe book which they built their lives upon! Without it, she said, they have nothing. Her mother carved one of her visions into the wall after her sons were enslaved and husband killed. Their people are forced to work in his factory as slaves. She asked for his help, to fulfill the prophecy and defeat Count Mudger for the sake of their survival.\n​\nA Bruvarian man smiled and placed his hand on Falke’s shoulder. “Get us that recipe book. It’s everything,” he said. “It’s a week’s walk to the mountains in the north. Once you see Stout Lake, you’re halfway. You must find the skewer arm.\n/$\n$\nIt was the second day of the journey and sun was setting. Hop was very excited about looking for the skewer arm. It could be anywhere, he said. This frustrated Falke, he didn’t know where to even look. They decided to rest at the edge of the sudsy brown lake that was blanketed by fog. Hop went on and on about the beauty of this land before the invasion. All Hop’s memories made Falke want to see it all restored to it’s former glory. They both grew tired.\nAs legend goes, just as the sun lowered to the left, the moon rose above the fog on the right and connected light with the sun’s final beams at the surface of the stout. A single beam sparkled and pointed perfectly to a spot just a few feet into the water. The right reflected off something. Hop yelled, “Do you see it?! Grab it! Grab it!” Falke approached the lake and walked in. He was in waist-deep stout when his vision met the light’s end. The skewer stoke straight up out of the abyss and reached for him. Falke got closer, bent his knees and grabbed the handle of the skewer. With a mighty pull upwards, the skewer arm broke free of the silt. Falke turned to the shore and with his arm extended, held it up in the air proudly.\nHe shook the gunk off the skewer arm and fastened it to where his prosthetic arm used to be. A perfect fit. They started to brainstorm ways for Falke to get on top of the flying pig as they continued their journey. That was the only part of their mission that was literally set in stone. The rest was up to them.\n/$\n/$\n/$\n$\n$\n$\nBRUVANIA\n/$\n$\nAs It Was...\n/$\n$\nOnce upon a time, there was magical a land of bier and sausage which rested on the edge of a very mysterious forest. This magical land of bier and sausage was called Bruvania and its people were known as the Bruvarians. As the legend goes, every piece of Bruvania was alive with the stuff. Not just any drink and meat, but the best wurst and the best bier that the world had ever known! The plants that grew throughout the village sprouted not flowers or roses, but glasses and steins. Long links of smoked sausage hung across the doorways of every home to greet those who might be hungry. Keg Zeppelins filled with brews flew high above the hop gardens and disappeared into the clouds. Boats made of giant links floated in frothy, golden lakes with carbonated currents. It was known that Hoptingers inhabited the land.\n/$\n/$\n/$\n$\n$\n$\nWAR TORN\n/$\n$\nBruvania\n/$\n$\nAs legend goes, Colonel Falke couldn’t remember what happened after he took that sip. All he could see now, was fog. It looked like a warzone. A field to the right was set on fire. Falke saw the fire was coming from a floating keg in the sky. Behind him was a dark forest who tops disappeared into the even darker sky. Afraid, the Colonel walked away from the forest and moved forward towards a village he saw to the left. It was hard to see anything clearly though the thick fog, but Falke concluded this village was abandoned. Suddenly, Falke spotted two large figures ahead of him. They were ten feet tall and had extremely broad shoulders. Giants? The figures spotted Falke and angled themselves toward him. As they emerged out of the fog, Falke saw what they were. Pigataurs. The angry swine squealed and tackled Falke, who was too confused to move, and tied his arms behind the lower of his back. The two pig people marched Falke on the gravel road, through the fog, a mile uphill up and ended in front of a giant silver factory. There was a sign outside the metal gates that said “Dunkelbocken,” and adjacent to it was a symbol, two crossed hammers, and a star. The pig people walked Falke up the steps to the entrance of the metal building.\n/$\n$\nDUNKELBOCKEN\n/$\n$\nMr.\n/$\n$\nMachines in the factory pumped and moved a flesh-colored mush from one side of a conveyer belt to the other that was then funneled into sausage casings. Falke saw about a dozen bearded men were the ones who worked the machines. They looked defeated, unhappy and dirty. They were slaves. Several of these bearded men worked together to pour a hot brown liquid from one huge container to another. Falke knew this was a bier making process. The Colonel expected the smell to be satisfying. Instead, he smelt corruption and iron.\nA slender man now stood above him with both arms crossed. The man wore a black suit with the symbol from the entrance of the factory stitched onto a chest pocket. His shoes were pointy, as well as his nose and fingernails. Thin mustache, black hair and eyes that pierced Falke’s own. His name was Count Mudger, and he was in charge of this factory. Mudger pressed Falke to find out where he came from, but Falke didn’t crack. Instead, he spit on the creepy man’s shoes. Mudger, appalled, turned away from Falke and walked towards a large book that was placed in a glass case against the wall. He pressed his thin fingers against the glass and lingered there for a moment. Falke wondered what that book was. The pigs grabbed Falke’s underarms and dragged him away from the production room and down a cement tunnel without lights. They grunted and smiled at each other as they lifted his arms above his head and hung the rope that bound his hands on a hook from the low ceiling. Falke’s feet barely touched the ground. He drifted into sleep and pictured his small home.\n/$\n/$\n/$\n$\n$\n$\nThe\n/$\n$\nSKEWER ARM\n/$\n$\nThe\n/$\n$\nSKEWER ARM\n/$\n$\n/$\n$\nIt was the second day of the journey and sun was setting. Hop was very excited about looking for the skewer arm. It could be anywhere, he said. This frustrated Falke, he didn’t know where to even look. They decided to rest at the edge of the sudsy brown lake that was blanketed by fog. Hop went on and on about the beauty of this land before the invasion. All Hop’s memories made Falke want to see it all restored to it’s former glory. They both grew tired.\nAs legend goes, just as the sun lowered to the left, the moon rose above the fog on the right and connected light with the sun’s final beams at the surface of the stout. A single beam sparkled and pointed perfectly to a spot just a few feet into the water. The right reflected off something. Hop yelled, “Do you see it?! Grab it! Grab it!” Falke approached the lake and walked in. He was in waist-deep stout when his vision met the light’s end. The skewer stoke straight up out of the abyss and reached for him. Falke got closer, bent his knees and grabbed the handle of the skewer. With a mighty pull upwards, the skewer arm broke free of the silt. Falke turned to the shore and with his arm extended, held it up in the air proudly.\nHe shook the gunk off the skewer arm and fastened it to where his prosthetic arm used to be. A perfect fit. They started to brainstorm ways for Falke to get on top of the flying pig as they continued their journey. That was the only part of their mission that was literally set in stone. The rest was up to them.\n/$\n/$\n/$\n$\n$\n$\n/$\n$\nFALL OF MUDGER\n/$\n$\nThe\n/$\n$\nAnd that’s how our story ends. Well, not completely. Falke successfully destroyed Mudger’s factory with a powerful lightning attack. Outside the factory, he was accompanied by the entire Bruvarian rebel force who drove Count Mudger and all his swine out of the burning factory and pushed them back into the dark forest where they came from all those years ago.\nThe Pigataurs were cowards and fled without hesitation. But Mudger tried to take the recipe book with him as he ran toward the forest. The Count was stopped by Hop, who fought to the death to retrieve the book. As sad as it was, Hop was able to stall Mudger long enough for the Bruvarians to catch up and kill Mudger before he had the chance to escape into the forest with the recipes. Hop’s sacrifice was not taken gently. Everyone mourned the loss of their friend, especially Falke.\n/$\n/$\n/$\n/$\n$\n$\n$\n$\n/$\n$\nWURSTROLLEN\n/$\n$\nThe\n/$\n$\n/$\n$\nFalke was gifted the sacred recipe book by the Bruvarians. They wanted him to take their recipes back to Earth so everyone would know about Bruvania, their story and their revolution. Falke accepted the gift and was sent back to Earth the same way he arrived in Bruvania, with a sip of bier. Falke closed his eyes when he sipped the bier in Bruvania and opened his eyes to see his living room back on Earth. His wood floors. The Bruvarian recipe book was in his lap. He still had the skewer arm attached to his prosthetic elbow. Falke thought about Hop.\nAs legend goes, Falke went on to open Hoptinger Bier Garden & Sausage House, using their recipes, to pay homage to the adventure that no one would believe could have happened to an average guy like him.\n/$\n$\nEND!\n/$\n$\nDas\n/$\n/$\n/$\n/$\n/$\n$\n$\n$\nABOUT US\n/$\n$\nHoptinger is a modern “Baverican” bier garden. We have more than 60 taps devoted to carefully selected craft beer along with a full liquor bar to serve countless libations and creations. We offer a unique menu of creative sausage dogs and other loosely Bavarian-inspired gastro pub food.\nThe back story of how Hoptinger came to be is different than most. Our recipes, culture and love of craft beer was passed along to us from an ancient civilization devoted to beer and sausage making for generations. SCROLL below to read the FULL legend.\n/$\n$\nSCROLL\n/$\n/$\n/$\n$\n$\n$\n$\n$\nTHE\nLEGEND &\nBEYOND\n/$\n$\nWe believe in good food, good company and adventurous times.\n/$\n$\nTHE LEGEND\n/$\n$\nLOCATIONS\n/$\n/$\n$\n/$\n/$\n/$\n/$\nAbout\n$\n$\nABOUT US\n/$\n$\nHoptinger is a modern “Baverican” bier garden. We have more than 60 taps devoted to carefully selected craft beer along with a full liquor bar to serve countless libations and creations. We offer a unique menu of creative sausage dogs and other loosely Bavarian-inspired gastro pub food.\nThe back story of how Hoptinger came to be is different than most. Our recipes, culture and love of craft beer was passed along to us from an ancient civilization devoted to beer and sausage making for generations. SCROLL below to read the FULL legend.\n/$\n$\nSCROLL\n/$\n/$\n$\n$\n$\n$\nTHE\nLEGEND &\nBEYOND\n/$\n$\nWe believe in good food, good company and adventurous times.\n/$\n$\nTHE LEGEND\n/$\n$\nLOCATIONS\n/$\n/$\n$\n/$\n/$\n/$\n$\n$\nTHE\nLEGEND &\nBEYOND\n/$\n$\nWe believe in good food, good company and adventurous times.\n/$\n$\nTHE LEGEND\n/$\n$\nLOCATIONS\n/$\n/$\n$\n/$\nTHE LEGEND\n$\n$\n$\n/$\n$\nHOW THE WURST WAS WON\n/$\n$\nThe Legend of Hoptinger\n/$\n$\n/$\n$\nCOLONEL\n/$\n$\nThe\n/$\n$\nThe story of the Hoptinger Bier Garden and Sausage House begins with a retired Gulf War colonel named Falke. Falke had lost his right arm in the war and hasn’t done much aside from drinking cheap beer and fixing up his home. It was just like any other night when Falke walked into his local bar. The bartender looked unusually different. Falke asked for “the usual,” but instead received a beer he didn’t recognize. Falke picked up the bottle with his left hand. A rabbit leapt across mountains on the label. At a closer look, Falke noticed the rabbit had tiny antlers and fangs. Intrigued and with not much thought, he took a sip. And with the second sip, his eyes slammed shut against his will. His body contracted and blackness immediately consumed his vision.\n/$\n$\n/$\n$\nHOPTINGER\n/$\n$\nThe\n/$\n$\nFalke was woken up by the sound of movement on the gravel floor. A tiny rodent with antlers scurried in the darkness before his feet. It whispered to Falke happily and said it would get him out of there. It started to chew at the ropes above his head. Within a few moments, the Colonel’s hands were freed and his body fell heavily on top of his knees. In front of him sat a Hoptinger, rabbit body, antlers and tiny fangs. This one was lucky enough to get wings. Its wings were pressed closely to its back and blended well with the brown and grey coloring of its fur. Falke blinked three times slowly to focus on the creature. It looked at him with a fondness, like they’ve met before. There was no time to linger. The Hoptinger led the way out of the factory. Up, down, right, left, and down again. The duo ran fast through the fog and trees until the Hoptinger stopped in front of Falke’s feet and said they had arrived. that bound his hands on a hook from the low ceiling. Falke’s feet barely touched the ground. He drifted into sleep and pictured his small home. alke followed the Hoptinger again vertically down a stone staircase that led to a door hidden by a curtain of vines. The creature pushed open the door with his antlers.\n/$\n$\nPROPHECY\n/$\n$\nThe\n/$\n$\n/$\n$\nThe door opened into a room that was filled with members of the Bruvarian rebel force. Around a rectangular brown table sat the remaining leaders. There was a blonde man, a dark-haired man and ginger man. Each drank biers respective in color. Women and children took up the remainder of floor space. Colonel Falke saw an old, plump woman on the opposite side of the room push her way through the crowd. She stopped just before the Colonel and stared down at his missing arm for a moment too long. She introduced herself as Lady Weissel and pointed to the wall.\n​\nAs legend goes, a carved wall displayed a man with a skewer for a right arm riding a flying pig. In the background, a Hoptinger jumped in front of a landscape of mountains. Falke’s memory came back for a moment. He remembered being at the bar. He remembered the label on the strange bottle. A one-armed man? Weissel looked at him and said he was the one. She talked about the war and the foul Count Mudger who crept out of the wicked forest and destroyed their lands. He stole their ancient and sacred recipe book which they built their lives upon! Without it, she said, they have nothing. Her mother carved one of her visions into the wall after her sons were enslaved and husband killed. Their people are forced to work in his factory as slaves. She asked for his help, to fulfill the prophecy and defeat Count Mudger for the sake of their survival.\n​\nA Bruvarian man smiled and placed his hand on Falke’s shoulder. “Get us that recipe book. It’s everything,” he said. “It’s a week’s walk to the mountains in the north. Once you see Stout Lake, you’re halfway. You must find the skewer arm.\n/$\n$\nIt was the second day of the journey and sun was setting. Hop was very excited about looking for the skewer arm. It could be anywhere, he said. This frustrated Falke, he didn’t know where to even look. They decided to rest at the edge of the sudsy brown lake that was blanketed by fog. Hop went on and on about the beauty of this land before the invasion. All Hop’s memories made Falke want to see it all restored to it’s former glory. They both grew tired.\nAs legend goes, just as the sun lowered to the left, the moon rose above the fog on the right and connected light with the sun’s final beams at the surface of the stout. A single beam sparkled and pointed perfectly to a spot just a few feet into the water. The right reflected off something. Hop yelled, “Do you see it?! Grab it! Grab it!” Falke approached the lake and walked in. He was in waist-deep stout when his vision met the light’s end. The skewer stoke straight up out of the abyss and reached for him. Falke got closer, bent his knees and grabbed the handle of the skewer. With a mighty pull upwards, the skewer arm broke free of the silt. Falke turned to the shore and with his arm extended, held it up in the air proudly.\nHe shook the gunk off the skewer arm and fastened it to where his prosthetic arm used to be. A perfect fit. They started to brainstorm ways for Falke to get on top of the flying pig as they continued their journey. That was the only part of their mission that was literally set in stone. The rest was up to them.\n/$\n/$\n/$\n$\n$\n$\nBRUVANIA\n/$\n$\nAs It Was...\n/$\n$\nOnce upon a time, there was magical a land of bier and sausage which rested on the edge of a very mysterious forest. This magical land of bier and sausage was called Bruvania and its people were known as the Bruvarians. As the legend goes, every piece of Bruvania was alive with the stuff. Not just any drink and meat, but the best wurst and the best bier that the world had ever known! The plants that grew throughout the village sprouted not flowers or roses, but glasses and steins. Long links of smoked sausage hung across the doorways of every home to greet those who might be hungry. Keg Zeppelins filled with brews flew high above the hop gardens and disappeared into the clouds. Boats made of giant links floated in frothy, golden lakes with carbonated currents. It was known that Hoptingers inhabited the land.\n/$\n/$\n/$\n$\n$\n$\nWAR TORN\n/$\n$\nBruvania\n/$\n$\nAs legend goes, Colonel Falke couldn’t remember what happened after he took that sip. All he could see now, was fog. It looked like a warzone. A field to the right was set on fire. Falke saw the fire was coming from a floating keg in the sky. Behind him was a dark forest who tops disappeared into the even darker sky. Afraid, the Colonel walked away from the forest and moved forward towards a village he saw to the left. It was hard to see anything clearly though the thick fog, but Falke concluded this village was abandoned. Suddenly, Falke spotted two large figures ahead of him. They were ten feet tall and had extremely broad shoulders. Giants? The figures spotted Falke and angled themselves toward him. As they emerged out of the fog, Falke saw what they were. Pigataurs. The angry swine squealed and tackled Falke, who was too confused to move, and tied his arms behind the lower of his back. The two pig people marched Falke on the gravel road, through the fog, a mile uphill up and ended in front of a giant silver factory. There was a sign outside the metal gates that said “Dunkelbocken,” and adjacent to it was a symbol, two crossed hammers, and a star. The pig people walked Falke up the steps to the entrance of the metal building.\n/$\n$\nDUNKELBOCKEN\n/$\n$\nMr.\n/$\n$\nMachines in the factory pumped and moved a flesh-colored mush from one side of a conveyer belt to the other that was then funneled into sausage casings. Falke saw about a dozen bearded men were the ones who worked the machines. They looked defeated, unhappy and dirty. They were slaves. Several of these bearded men worked together to pour a hot brown liquid from one huge container to another. Falke knew this was a bier making process. The Colonel expected the smell to be satisfying. Instead, he smelt corruption and iron.\nA slender man now stood above him with both arms crossed. The man wore a black suit with the symbol from the entrance of the factory stitched onto a chest pocket. His shoes were pointy, as well as his nose and fingernails. Thin mustache, black hair and eyes that pierced Falke’s own. His name was Count Mudger, and he was in charge of this factory. Mudger pressed Falke to find out where he came from, but Falke didn’t crack. Instead, he spit on the creepy man’s shoes. Mudger, appalled, turned away from Falke and walked towards a large book that was placed in a glass case against the wall. He pressed his thin fingers against the glass and lingered there for a moment. Falke wondered what that book was. The pigs grabbed Falke’s underarms and dragged him away from the production room and down a cement tunnel without lights. They grunted and smiled at each other as they lifted his arms above his head and hung the rope that bound his hands on a hook from the low ceiling. Falke’s feet barely touched the ground. He drifted into sleep and pictured his small home.\n/$\n/$\n/$\n$\n$\n$\nThe\n/$\n$\nSKEWER ARM\n/$\n$\nThe\n/$\n$\nSKEWER ARM\n/$\n$\n/$\n$\nIt was the second day of the journey and sun was setting. Hop was very excited about looking for the skewer arm. It could be anywhere, he said. This frustrated Falke, he didn’t know where to even look. They decided to rest at the edge of the sudsy brown lake that was blanketed by fog. Hop went on and on about the beauty of this land before the invasion. All Hop’s memories made Falke want to see it all restored to it’s former glory. They both grew tired.\nAs legend goes, just as the sun lowered to the left, the moon rose above the fog on the right and connected light with the sun’s final beams at the surface of the stout. A single beam sparkled and pointed perfectly to a spot just a few feet into the water. The right reflected off something. Hop yelled, “Do you see it?! Grab it! Grab it!” Falke approached the lake and walked in. He was in waist-deep stout when his vision met the light’s end. The skewer stoke straight up out of the abyss and reached for him. Falke got closer, bent his knees and grabbed the handle of the skewer. With a mighty pull upwards, the skewer arm broke free of the silt. Falke turned to the shore and with his arm extended, held it up in the air proudly.\nHe shook the gunk off the skewer arm and fastened it to where his prosthetic arm used to be. A perfect fit. They started to brainstorm ways for Falke to get on top of the flying pig as they continued their journey. That was the only part of their mission that was literally set in stone. The rest was up to them.\n/$\n/$\n/$\n$\n$\n$\n/$\n$\nFALL OF MUDGER\n/$\n$\nThe\n/$\n$\nAnd that’s how our story ends. Well, not completely. Falke successfully destroyed Mudger’s factory with a powerful lightning attack. Outside the factory, he was accompanied by the entire Bruvarian rebel force who drove Count Mudger and all his swine out of the burning factory and pushed them back into the dark forest where they came from all those years ago.\nThe Pigataurs were cowards and fled without hesitation. But Mudger tried to take the recipe book with him as he ran toward the forest. The Count was stopped by Hop, who fought to the death to retrieve the book. As sad as it was, Hop was able to stall Mudger long enough for the Bruvarians to catch up and kill Mudger before he had the chance to escape into the forest with the recipes. Hop’s sacrifice was not taken gently. Everyone mourned the loss of their friend, especially Falke.\n/$\n/$\n/$\n$\n$\n/$\n$\nHOW THE WURST WAS WON\n/$\n$\nThe Legend of Hoptinger\n/$\n$\n/$\n$\nCOLONEL\n/$\n$\nThe\n/$\n$\nThe story of the Hoptinger Bier Garden and Sausage House begins with a retired Gulf War colonel named Falke. Falke had lost his right arm in the war and hasn’t done much aside from drinking cheap beer and fixing up his home. It was just like any other night when Falke walked into his local bar. The bartender looked unusually different. Falke asked for “the usual,” but instead received a beer he didn’t recognize. Falke picked up the bottle with his left hand. A rabbit leapt across mountains on the label. At a closer look, Falke noticed the rabbit had tiny antlers and fangs. Intrigued and with not much thought, he took a sip. And with the second sip, his eyes slammed shut against his will. His body contracted and blackness immediately consumed his vision.\n/$\n$\n/$\n$\nHOPTINGER\n/$\n$\nThe\n/$\n$\nFalke was woken up by the sound of movement on the gravel floor. A tiny rodent with antlers scurried in the darkness before his feet. It whispered to Falke happily and said it would get him out of there. It started to chew at the ropes above his head. Within a few moments, the Colonel’s hands were freed and his body fell heavily on top of his knees. In front of him sat a Hoptinger, rabbit body, antlers and tiny fangs. This one was lucky enough to get wings. Its wings were pressed closely to its back and blended well with the brown and grey coloring of its fur. Falke blinked three times slowly to focus on the creature. It looked at him with a fondness, like they’ve met before. There was no time to linger. The Hoptinger led the way out of the factory. Up, down, right, left, and down again. The duo ran fast through the fog and trees until the Hoptinger stopped in front of Falke’s feet and said they had arrived. that bound his hands on a hook from the low ceiling. Falke’s feet barely touched the ground. He drifted into sleep and pictured his small home. alke followed the Hoptinger again vertically down a stone staircase that led to a door hidden by a curtain of vines. The creature pushed open the door with his antlers.\n/$\n$\nPROPHECY\n/$\n$\nThe\n/$\n$\n/$\n$\nThe door opened into a room that was filled with members of the Bruvarian rebel force. Around a rectangular brown table sat the remaining leaders. There was a blonde man, a dark-haired man and ginger man. Each drank biers respective in color. Women and children took up the remainder of floor space. Colonel Falke saw an old, plump woman on the opposite side of the room push her way through the crowd. She stopped just before the Colonel and stared down at his missing arm for a moment too long. She introduced herself as Lady Weissel and pointed to the wall.\n​\nAs legend goes, a carved wall displayed a man with a skewer for a right arm riding a flying pig. In the background, a Hoptinger jumped in front of a landscape of mountains. Falke’s memory came back for a moment. He remembered being at the bar. He remembered the label on the strange bottle. A one-armed man? Weissel looked at him and said he was the one. She talked about the war and the foul Count Mudger who crept out of the wicked forest and destroyed their lands. He stole their ancient and sacred recipe book which they built their lives upon! Without it, she said, they have nothing. Her mother carved one of her visions into the wall after her sons were enslaved and husband killed. Their people are forced to work in his factory as slaves. She asked for his help, to fulfill the prophecy and defeat Count Mudger for the sake of their survival.\n​\nA Bruvarian man smiled and placed his hand on Falke’s shoulder. “Get us that recipe book. It’s everything,” he said. “It’s a week’s walk to the mountains in the north. Once you see Stout Lake, you’re halfway. You must find the skewer arm.\n/$\n$\nIt was the second day of the journey and sun was setting. Hop was very excited about looking for the skewer arm. It could be anywhere, he said. This frustrated Falke, he didn’t know where to even look. They decided to rest at the edge of the sudsy brown lake that was blanketed by fog. Hop went on and on about the beauty of this land before the invasion. All Hop’s memories made Falke want to see it all restored to it’s former glory. They both grew tired.\nAs legend goes, just as the sun lowered to the left, the moon rose above the fog on the right and connected light with the sun’s final beams at the surface of the stout. A single beam sparkled and pointed perfectly to a spot just a few feet into the water. The right reflected off something. Hop yelled, “Do you see it?! Grab it! Grab it!” Falke approached the lake and walked in. He was in waist-deep stout when his vision met the light’s end. The skewer stoke straight up out of the abyss and reached for him. Falke got closer, bent his knees and grabbed the handle of the skewer. With a mighty pull upwards, the skewer arm broke free of the silt. Falke turned to the shore and with his arm extended, held it up in the air proudly.\nHe shook the gunk off the skewer arm and fastened it to where his prosthetic arm used to be. A perfect fit. They started to brainstorm ways for Falke to get on top of the flying pig as they continued their journey. That was the only part of their mission that was literally set in stone. The rest was up to them.\n/$\n/$\n$\n$\nBRUVANIA\n/$\n$\nAs It Was...\n/$\n$\nOnce upon a time, there was magical a land of bier and sausage which rested on the edge of a very mysterious forest. This magical land of bier and sausage was called Bruvania and its people were known as the Bruvarians. As the legend goes, every piece of Bruvania was alive with the stuff. Not just any drink and meat, but the best wurst and the best bier that the world had ever known! The plants that grew throughout the village sprouted not flowers or roses, but glasses and steins. Long links of smoked sausage hung across the doorways of every home to greet those who might be hungry. Keg Zeppelins filled with brews flew high above the hop gardens and disappeared into the clouds. Boats made of giant links floated in frothy, golden lakes with carbonated currents. It was known that Hoptingers inhabited the land.\n/$\n/$\n$\n$\nWAR TORN\n/$\n$\nBruvania\n/$\n$\nAs legend goes, Colonel Falke couldn’t remember what happened after he took that sip. All he could see now, was fog. It looked like a warzone. A field to the right was set on fire. Falke saw the fire was coming from a floating keg in the sky. Behind him was a dark forest who tops disappeared into the even darker sky. Afraid, the Colonel walked away from the forest and moved forward towards a village he saw to the left. It was hard to see anything clearly though the thick fog, but Falke concluded this village was abandoned. Suddenly, Falke spotted two large figures ahead of him. They were ten feet tall and had extremely broad shoulders. Giants? The figures spotted Falke and angled themselves toward him. As they emerged out of the fog, Falke saw what they were. Pigataurs. The angry swine squealed and tackled Falke, who was too confused to move, and tied his arms behind the lower of his back. The two pig people marched Falke on the gravel road, through the fog, a mile uphill up and ended in front of a giant silver factory. There was a sign outside the metal gates that said “Dunkelbocken,” and adjacent to it was a symbol, two crossed hammers, and a star. The pig people walked Falke up the steps to the entrance of the metal building.\n/$\n$\nDUNKELBOCKEN\n/$\n$\nMr.\n/$\n$\nMachines in the factory pumped and moved a flesh-colored mush from one side of a conveyer belt to the other that was then funneled into sausage casings. Falke saw about a dozen bearded men were the ones who worked the machines. They looked defeated, unhappy and dirty. They were slaves. Several of these bearded men worked together to pour a hot brown liquid from one huge container to another. Falke knew this was a bier making process. The Colonel expected the smell to be satisfying. Instead, he smelt corruption and iron.\nA slender man now stood above him with both arms crossed. The man wore a black suit with the symbol from the entrance of the factory stitched onto a chest pocket. His shoes were pointy, as well as his nose and fingernails. Thin mustache, black hair and eyes that pierced Falke’s own. His name was Count Mudger, and he was in charge of this factory. Mudger pressed Falke to find out where he came from, but Falke didn’t crack. Instead, he spit on the creepy man’s shoes. Mudger, appalled, turned away from Falke and walked towards a large book that was placed in a glass case against the wall. He pressed his thin fingers against the glass and lingered there for a moment. Falke wondered what that book was. The pigs grabbed Falke’s underarms and dragged him away from the production room and down a cement tunnel without lights. They grunted and smiled at each other as they lifted his arms above his head and hung the rope that bound his hands on a hook from the low ceiling. Falke’s feet barely touched the ground. He drifted into sleep and pictured his small home.\n/$\n/$\n$\n$\nThe\n/$\n$\nSKEWER ARM\n/$\n$\nThe\n/$\n$\nSKEWER ARM\n/$\n$\n/$\n$\nIt was the second day of the journey and sun was setting. Hop was very excited about looking for the skewer arm. It could be anywhere, he said. This frustrated Falke, he didn’t know where to even look. They decided to rest at the edge of the sudsy brown lake that was blanketed by fog. Hop went on and on about the beauty of this land before the invasion. All Hop’s memories made Falke want to see it all restored to it’s former glory. They both grew tired.\nAs legend goes, just as the sun lowered to the left, the moon rose above the fog on the right and connected light with the sun’s final beams at the surface of the stout. A single beam sparkled and pointed perfectly to a spot just a few feet into the water. The right reflected off something. Hop yelled, “Do you see it?! Grab it! Grab it!” Falke approached the lake and walked in. He was in waist-deep stout when his vision met the light’s end. The skewer stoke straight up out of the abyss and reached for him. Falke got closer, bent his knees and grabbed the handle of the skewer. With a mighty pull upwards, the skewer arm broke free of the silt. Falke turned to the shore and with his arm extended, held it up in the air proudly.\nHe shook the gunk off the skewer arm and fastened it to where his prosthetic arm used to be. A perfect fit. They started to brainstorm ways for Falke to get on top of the flying pig as they continued their journey. That was the only part of their mission that was literally set in stone. The rest was up to them.\n/$\n/$\n$\n$\n/$\n$\nFALL OF MUDGER\n/$\n$\nThe\n/$\n$\nAnd that’s how our story ends. Well, not completely. Falke successfully destroyed Mudger’s factory with a powerful lightning attack. Outside the factory, he was accompanied by the entire Bruvarian rebel force who drove Count Mudger and all his swine out of the burning factory and pushed them back into the dark forest where they came from all those years ago.\nThe Pigataurs were cowards and fled without hesitation. But Mudger tried to take the recipe book with him as he ran toward the forest. The Count was stopped by Hop, who fought to the death to retrieve the book. As sad as it was, Hop was able to stall Mudger long enough for the Bruvarians to catch up and kill Mudger before he had the chance to escape into the forest with the recipes. Hop’s sacrifice was not taken gently. Everyone mourned the loss of their friend, especially Falke.\n/$\n/$\n$\n$\n$\n/$\n$\nWURSTROLLEN\n/$\n$\nThe\n/$\n$\n/$\n$\nFalke was gifted the sacred recipe book by the Bruvarians. They wanted him to take their recipes back to Earth so everyone would know about Bruvania, their story and their revolution. Falke accepted the gift and was sent back to Earth the same way he arrived in Bruvania, with a sip of bier. Falke closed his eyes when he sipped the bier in Bruvania and opened his eyes to see his living room back on Earth. His wood floors. The Bruvarian recipe book was in his lap. He still had the skewer arm attached to his prosthetic elbow. Falke thought about Hop.\nAs legend goes, Falke went on to open Hoptinger Bier Garden & Sausage House, using their recipes, to pay homage to the adventure that no one would believe could have happened to an average guy like him.\n/$\n$\nEND!\n/$\n$\nDas\n/$\n/$\n/$\n$\n$\n/$\n$\nWURSTROLLEN\n/$\n$\nThe\n/$\n$\n/$\n$\nFalke was gifted the sacred recipe book by the Bruvarians. They wanted him to take their recipes back to Earth so everyone would know about Bruvania, their story and their revolution. Falke accepted the gift and was sent back to Earth the same way he arrived in Bruvania, with a sip of bier. Falke closed his eyes when he sipped the bier in Bruvania and opened his eyes to see his living room back on Earth. His wood floors. The Bruvarian recipe book was in his lap. He still had the skewer arm attached to his prosthetic elbow. Falke thought about Hop.\nAs legend goes, Falke went on to open Hoptinger Bier Garden & Sausage House, using their recipes, to pay homage to the adventure that no one would believe could have happened to an average guy like him.\n/$\n$\nEND!\n/$\n$\nDas\n/$\n/$\n$\n$\nHours & Info\n/$\n$\n​\n​\nMonday                  11 AM - 2 AM\nTuesday                  11 AM - 2 AM\nWednesday            11 AM - 2 AM\nThursday                 11 AM - 2 AM\nFriday                       11 AM - 2 AM\nSaturday                  10 AM - 2 AM\nSunday                     10 AM\n- 2 AM\n/$\n/$\n$\n$\nHop On!\n/$\n$\nSubscribe to our newsletter for insider discounts, special and happenings!\n/$\n$\n$\n$\n/$\n$\n>\n/$\n$\nThanks for submitting!\n/$\n/$\n/$\n/$\n$\n$\nFollow Us\n/$\n$\n/$\n$\n#Hoptinger\n/$\n$\nHoptinger Bier Garden & Sausage House.\nAll Rights Reserved\n/$\n/$",
      "emails": [
        "59f3fdbcc4da44ab841236a7406e9b3b@sentry.wixpress.com",
        "605a7baede844d278b89dc95ae0a9123@sentry-next.wixpress.com",
        "79baaa8e09c746d2b7401643b99792e0@sentry.wixpress.com",
        "8c4075d5481d476e945486754f783364@sentry.io",
        "8eb368c655b84e029ed79ad7a5c1718e@sentry.wixpress.com",
        "e0b4d631da7b4200828051f7f9c783e3@sentry-next.wixpress.com"
      ]
    },
    {
      "url": "https://www.hoptinger.com/private-events-contact",
      "is_candidate": false,
      "has_email": true,
      "text": "$\n$\n$\n$\n$\nPRIVATE EVENTS\n/$\n/$\n/$\n/$\n$\n$\n$\n$\nHAVE A QUESTION OR READY TO BOOK AN EVENT?\n/$\n$\nSubmit the form below and our team will be in touch to help you create an unforgettable experience.\n/$\n$\n$\n$\nFirst Name\n/$\n$\nPhone\n/$\n$\nPreferred Location\nChoose an option\n/$\n$\nLast Name\n/$\n$\nPreferred Date of Event\n/$\n$\nEstimated Number of Guests\nChoose an option\n/$\n$\nEmail\n/$\n$\nIs Your Date Flexible?\nChoose an option\n/$\n$\nSEND\n/$\n$\nThank you for your inquiry! Our events team will contact you within 24-48 hours to begin planning your special occasion.\n/$\n/$\n/$\n/$\n/$\n/$\n/$\n$\n$\n$\nPRIVATE EVENTS\n/$\n/$\n/$\n$\n$\nPRIVATE EVENTS\n/$\n/$\n$\n$\n$\nHAVE A QUESTION OR READY TO BOOK AN EVENT?\n/$\n$\nSubmit the form below and our team will be in touch to help you create an unforgettable experience.\n/$\n$\n$\n$\nFirst Name\n/$\n$\nPhone\n/$\n$\nPreferred Location\nChoose an option\n/$\n$\nLast Name\n/$\n$\nPreferred Date of Event\n/$\n$\nEstimated Number of Guests\nChoose an option\n/$\n$\nEmail\n/$\n$\nIs Your Date Flexible?\nChoose an option\n/$\n$\nSEND\n/$\n$\nThank you for your inquiry! Our events team will contact you within 24-48 hours to begin planning your special occasion.\n/$\n/$\n/$\n/$\n/$\n$\n$\nHAVE A QUESTION OR READY TO BOOK AN EVENT?\n/$\n$\nSubmit the form below and our team will be in touch to help you create an unforgettable experience.\n/$\n$\n$\n$\nFirst Name\n/$\n$\nPhone\n/$\n$\nPreferred Location\nChoose an option\n/$\n$\nLast Name\n/$\n$\nPreferred Date of Event\n/$\n$\nEstimated Number of Guests\nChoose an option\n/$\n$\nEmail\n/$\n$\nIs Your Date Flexible?\nChoose an option\n/$\n$\nSEND\n/$\n$\nThank you for your inquiry! Our events team will contact you within 24-48 hours to begin planning your special occasion.\n/$\n/$\n/$\n/$\n$\n$\nHours & Info\n/$\n$\n​\n​\nMonday                  11 AM - 2 AM\nTuesday                  11 AM - 2 AM\nWednesday            11 AM - 2 AM\nThursday                 11 AM - 2 AM\nFriday                       11 AM - 2 AM\nSaturday                  10 AM - 2 AM\nSunday                     10 AM\n- 2 AM\n/$\n/$\n$\n$\nHop On!\n/$\n$\nSubscribe to our newsletter for insider discounts, special and happenings!\n/$\n$\n$\n$\n/$\n$\n>\n/$\n$\nThanks for submitting!\n/$\n/$\n/$\n/$\n$\n$\nFollow Us\n/$\n$\n/$\n$\n#Hoptinger\n/$\n$\nHoptinger Bier Garden & Sausage House.\nAll Rights Reserved\n/$\n/$",
      "emails": [
        "59f3fdbcc4da44ab841236a7406e9b3b@sentry.wixpress.com",
        "605a7baede844d278b89dc95ae0a9123@sentry-next.wixpress.com",
        "79baaa8e09c746d2b7401643b99792e0@sentry.wixpress.com",
        "8c4075d5481d476e945486754f783364@sentry.io",
        "8eb368c655b84e029ed79ad7a5c1718e@sentry.wixpress.com",
        "e0b4d631da7b4200828051f7f9c783e3@sentry-next.wixpress.com"
      ]
    },
    {
      "url": "https://www.hoptinger.com/contact",
      "is_candidate": false,
      "has_email": true,
      "text": "$\n$\n$\n$\n$\nCONTACT\n/$\n/$\n/$\n/$\n$\n$\n$\n$\nSAY HELLO!\n/$\n$\nInterested in hosting an event at Hoptinger? Have a beer recommendation? Just want to send us a love note? Fill out the form below and we will get back to you shortly!\n​\n**Please do not contact “Special Events” if you wish to call ahead for a lunch or dinner reservation. Give us a call at the location you plan to visit! Thank you!\n/$\n$\n$\nWho would you like to contact?\n/$\n$\n/$\n$\n/$\n$\n/$\n$\n/$\n$\n/$\n$\nSubmit\n/$\n$\nThanks for submitting!\n/$\n/$\n/$\n/$\n/$\n$\n$\n$\n$\nWORK AT HOP!\n/$\n$\nTo apply for employment, please fill out this\napplication form\nand bring with you to one of our locations.\n​\n/$\n$\nAPPLY ONLINE\n/$\n/$\n/$\n/$\n/$\n$\n$\n$\nCONTACT\n/$\n/$\n/$\n$\n$\nCONTACT\n/$\n/$\n$\n$\n$\nSAY HELLO!\n/$\n$\nInterested in hosting an event at Hoptinger? Have a beer recommendation? Just want to send us a love note? Fill out the form below and we will get back to you shortly!\n​\n**Please do not contact “Special Events” if you wish to call ahead for a lunch or dinner reservation. Give us a call at the location you plan to visit! Thank you!\n/$\n$\n$\nWho would you like to contact?\n/$\n$\n/$\n$\n/$\n$\n/$\n$\n/$\n$\n/$\n$\nSubmit\n/$\n$\nThanks for submitting!\n/$\n/$\n/$\n/$\n$\n$\nSAY HELLO!\n/$\n$\nInterested in hosting an event at Hoptinger? Have a beer recommendation? Just want to send us a love note? Fill out the form below and we will get back to you shortly!\n​\n**Please do not contact “Special Events” if you wish to call ahead for a lunch or dinner reservation. Give us a call at the location you plan to visit! Thank you!\n/$\n$\n$\nWho would you like to contact?\n/$\n$\n/$\n$\n/$\n$\n/$\n$\n/$\n$\n/$\n$\nSubmit\n/$\n$\nThanks for submitting!\n/$\n/$\n/$\n$\n$\n$\nWORK AT HOP!\n/$\n$\nTo apply for employment, please fill out this\napplication form\nand bring with you to one of our locations.\n​\n/$\n$\nAPPLY ONLINE\n/$\n/$\n/$\n$\n$\nWORK AT HOP!\n/$\n$\nTo apply for employment, please fill out this\napplication form\nand bring with you to one of our locations.\n​\n/$\n$\nAPPLY ONLINE\n/$\n/$\n$\n$\nHours & Info\n/$\n$\n​\n​\nMonday                  11 AM - 2 AM\nTuesday                  11 AM - 2 AM\nWednesday            11 AM - 2 AM\nThursday                 11 AM - 2 AM\nFriday                       11 AM - 2 AM\nSaturday                  10 AM - 2 AM\nSunday                     10 AM\n- 2 AM\n/$\n/$\n$\n$\nHop On!\n/$\n$\nSubscribe to our newsletter for insider discounts, special and happenings!\n/$\n$\n$\n$\n/$\n$\n>\n/$\n$\nThanks for submitting!\n/$\n/$\n/$\n/$\n$\n$\nFollow Us\n/$\n$\n/$\n$\n#Hoptinger\n/$\n$\nHoptinger Bier Garden & Sausage House.\nAll Rights Reserved\n/$\n/$",
      "emails": [
        "59f3fdbcc4da44ab841236a7406e9b3b@sentry.wixpress.com",
        "605a7baede844d278b89dc95ae0a9123@sentry-next.wixpress.com",
        "79baaa8e09c746d2b7401643b99792e0@sentry.wixpress.com",
        "8c4075d5481d476e945486754f783364@sentry.io",
        "8eb368c655b84e029ed79ad7a5c1718e@sentry.wixpress.com",
        "e0b4d631da7b4200828051f7f9c783e3@sentry-next.wixpress.com"
      ]
    }
  ],
  "all_links": [
    "https://www.hoptinger.com/menu",
    "https://www.hoptinger.com/weekly-happenings",
    "https://www.hoptinger.com/jacksonville-beach",
    "https://www.hoptinger.com/locations",
    "https://www.hoptinger.com/5points",
    "https://www.hoptinger.com/private-events-decoyclub",
    "https://www.hoptinger.com/about",
    "https://www.hoptinger.com/private-events-5points",
    "https://www.hoptinger.com/private-events-contact",
    "https://www.hoptinger.com/_files/ugd/d27ad0_4a9a7e77f17a413789a563b5b49906ee.pdf",
    "https://www.hoptinger.com/contact",
    "https://www.hoptinger.com",
    "https://www.hoptinger.com/private-events-jb"
  ],
  "candidate_links": [
    "https://www.hoptinger.com/about",
    "https://www.hoptinger.com/private-events-contact",
    "https://www.hoptinger.com/contact"
  ],
  "visited": [
    "http://hoptinger.com/",
    "http://hoptinger.com/about",
    "http://hoptinger.com/contact",
    "http://hoptinger.com/staff",
    "http://hoptinger.com/team",
    "http://hoptinger.com/board",
    "http://hoptinger.com/directory",
    "http://hoptinger.com/events",
    "http://hoptinger.com/sitemap.xml",
    "http://hoptinger.com/council",
    "http://hoptinger.com/leadership",
    "http://hoptinger.com/management",
    "http://hoptinger.com/producers",
    "http://hoptinger.com/support",
    "http://hoptinger.com/crew",
    "http://hoptinger.com/members",
    "http://hoptinger.com/bios",
    "http://hoptinger.com/people",
    "http://hoptinger.com/artists",
    "http://hoptinger.com/musicians",
    "http://hoptinger.com/faculty",
    "http://hoptinger.com/administration",
    "https://www.hoptinger.com/about",
    "https://www.hoptinger.com/private-events-contact",
    "https://www.hoptinger.com/contact"
  ],
  "base_url": "http://hoptinger.com/"
}