{
  "pages": [
    {
      "url": "http://www.hpgcc.com/Dining_Events_(1)/Weddings_Events_(1)",
      "is_candidate": false,
      "has_email": true,
      "text": "Planning an Event?\nHome\nDining & Events\nWeddings & Events\nWeddings & Events\nThank you for considering Heritage Palms Golf and Country Club for your upcoming event or celebration.  Heritage Palms is a private member-owned club; however, we are proud to host a limited number of \"outside\" events throughout the year. If you are searching for a special venue to celebrate your occasion, please reach out to\n[email protected]\n.\nHeritage Palms Golf & Country Club\n10420 Washingtonia Palm Way\nFort Myers, FL 33966\nTHis is one item with icon and text\nPhone:\n239-278-9090\nTHis is one item with icon and text\nTHis is one item with icon and text\nFax: 239-278-0888\nTHis is one item with icon and text\nTHis is one item with icon and text\n© 2025  Heritage Palms Golf & Country Club. All Rights Reserved.\nPowered by Jonas Club Software",
      "emails": [
        "gnb_logo2@4x.aspx"
      ]
    },
    {
      "url": "http://www.hpgcc.com/About",
      "is_candidate": false,
      "has_email": true,
      "text": "Home\nAbout\nAbout Us\nHeritage Palms Golf & Country Club is a Member- owned gated community, with 1,662 residents. Established in 1999 and completed in 2006. We are located in Fort Myers, Florida off of Six Mile Cypress, between Colonial Boulevard & Daniels Parkway. Our community is laid out on over 800 acres featuring two immaculate 18-hole golf courses designed by Azinger & Lewis surrounded by Single Family Homes, Luxury Twin Villas, 2-story Verandas, and 4-story Terrace Condominiums, in addition to the 38 acre fresh water lake, which also serves as the Club’s aqua range.\nIdeally located close to everything, but set apart in a private quiet community. Heritage Palms features a boulevard entrance that focuses on a 12 foot high waterfall that cascades down to a rock pool. A palm lined inlet welcomes you at the entrance off Six Mile Cypress. It boasts a renovated Clubhouse with a picturesque view of the centrally located 38 acre lake- a favorite for weddings, banquets and special events. The Clubhouse restaurants offer both formal and informal dining. Surrounding the Clubhouse are Golf & Tennis pro shops, heated swimming pools, lighted Har-Tru tennis courts with stadium court, Pickleball courts, aqua range, and putting & chipping practice greens.\nAdjacent to the Clubhouse is the two-story Activity Center.  The member's only facility provides a grand hall for community meetings, fitness classes and social activities.  The exercise room, locker rooms, and Aerobic studio, and lending library are all conveniently located within this facility.\nThe Lodge is a second 5,000 square foot Clubhouse is a member’s only facility that can only be accessed with a member card. It also houses a large gathering room, a card room, bocce courts, and the famous pool side Tiki Bar & Grill. The resort swimming pool, water fall and hot tub area is the main social watering hole.\nPlease explore our website and discover all Heritage Palms Golf & Country Club has to offer. Play a round of golf, grab a bite to eat in Clubhouse Grill Room and see for yourself what the rest of the Southwest Florida community already knows: when it comes to standards… we’re simply THE BEST!\nMission Statement\nTo provide Members and guests extraordinary golf and amenity experience in a safe environment at a reasonable cost.\nVision & Values\nHeritage Palms Golf & Country Club\n10420 Washingtonia Palm Way\nFort Myers, FL 33966\nTHis is one item with icon and text\nPhone:\n239-278-9090\nTHis is one item with icon and text\nTHis is one item with icon and text\nFax: 239-278-0888\nTHis is one item with icon and text\nTHis is one item with icon and text\n© 2025  Heritage Palms Golf & Country Club. All Rights Reserved.\nPowered by Jonas Club Software",
      "emails": [
        "gnb_logo2@4x.aspx"
      ]
    },
    {
      "url": "http://www.hpgcc.com/Dining_Events",
      "is_candidate": false,
      "has_email": true,
      "text": "Home\nDining & Events (1)\nDining & Events\nThe Food and Beverage team at Heritage Palms is staffed by friendly individuals who are ready to serve you with a personalized experience no matter where you choose to dine! All venues are cashless. Members and transfer members must charge all goods and services to their house account.  No individual point of sale charges will be accepted.  Reciprocals, public or guests can pay by credit card  (Visa, MasterCard, or American Express) for golf and restaurant services.\nPalms Dining Room\nThe Palms Dining Room is located in our newly-renovated Clubhouse.  It boasts a picturesque view through expansive windows overlooking our 38-acre lake, making it the perfect place to enjoy a dinner with friends, neighbors and guests.  The restaurant offers upscale fine dining, with a wide range of selections prepared by our Executive Chef.  The extensive menu features extraordinary buffets, and theme nights sure to please everyone.\nGrill Room\nThe Grill Room is open every day for lunch and dinner, and offers a more casual dining experience.  The restaurant offers lighter fare, ranging from soups, appetizers and salads to burgers and sandwiches.  Pizza is also on the menu prepared in our new double stack conveyor belt pizza oven.  The Grill Room sports a huge, well-stocked bar, eighteen ceiling fans, and thirteen televisions for your viewing pleasure.  Join us indoors or in the open air on our enclosed, roofed patio graced by a gas fireplace.\nTiki Bar & Grill\nThe Tiki Bar & Grill is located poolside at the Lodge and open daily to members and transfer members. It has its own full-service bar and kitchen. The Tiki Bar & Grill serves breakfast daily and also offers an expanded bar and grill menu including healthy choice entrees.  In season, live entertainment is featured every Friday night.\nCabana\nThe Cabana is open daily to members and guests. This snack house is located by the Clubhouse pool and can easily serve pool users, golfers, tennis players and other guests.  The Cabana serves offers delicious breakfast sandwiches, a light lunch menu, snacks, and beverages.\nEvents Gallery\nHeritage Palms Golf & Country Club\n10420 Washingtonia Palm Way\nFort Myers, FL 33966\nTHis is one item with icon and text\nPhone:\n239-278-9090\nTHis is one item with icon and text\nTHis is one item with icon and text\nFax: 239-278-0888\nTHis is one item with icon and text\nTHis is one item with icon and text\n© 2025  Heritage Palms Golf & Country Club. All Rights Reserved.\nPowered by Jonas Club Software",
      "emails": [
        "gnb_logo2@4x.aspx"
      ]
    },
    {
      "url": "http://www.hpgcc.com/About/Map_Directions_(1)",
      "is_candidate": false,
      "has_email": true,
      "text": "Home\nAbout\nContact & Directions\nContact & Directions\nAddress\nHeritage Palms Golf & Country Club\n10420 Washingtonia Palm Way\nFort Myers, FL 33966\nPhone & Fax\nPhone: 239-278-9090\nFax: 239-278-0888\nContact Us\nUse the form below to send us an email.\nName:\n*\nFirst Name Last Name\nE-mail:\n*\nPhone Number:\n(\n)\n-\nFirst three digits\nSecond three digits\nLast four digits\nPlease indicate if you are:\nMember\nTransfer Member\nTo better help us assist you please indicate if you are a member or transfer member\nMessage/ Comment:\n*\nSafety & Gatehouse\nEmergencies\n24 hours a day, 7 days a week; for medical, fire or police emergencies, call 911; for vehicle accidents when there is damage to another’s property or injuries, call 911. After hours or on the weekends, if non-emergency assistance is needed, call the gatehouse at 239-277-9273 and the officer will direct your inquiry to the proper staff member. Please report any suspicious activity to the Gatehouse or the Fort Myers Police Department (239) 321-7700.\nAED Locations\nLocation of AED’s should be in probable areas where a person may su\u001cffer a sudden cardiac arrest, SCA, as well as place the AED in a location that is easily accessible. This often turns out to be reception areas, lobbies, lunch rooms, centrally-located restrooms. Also keep in mind foot tra\u001fffic patterns and places where people tend to congregate and facilities where high risk activity might occur.\nOur AED’s are found:\nMap of Locations\nOne AED is located in the hallway of the Lodge.\nOne AED is located in the Clubhouse near the hostess stand.\nOne AED is located in the Golf Pro Shop hallway.\nOne AED is located at the Clubhouse pool near the Cabana.\nOne AED is located in the Activity Center Lobby.\nOne AED is located in the Golf Course Maintenance o\u001fce entrance.\nOne AED is located in the Patrol Vehicle.\nPermanent Visitors List: Please keep in mind that you may call, fax or e-mail the names of frequent visitors that you want to add to your permanent visitors list. By placing these names on a permanent list, you do not have to call the gatehouse each time one of these visitors enter HPGCC.\nPlease Note:\nIf not on a permanent visitor’s list, you must call each time you are expecting a guest.\nIf someone comes unannounced, the gatehouse will call you.\nIf your information, address or telephone, is not updated in the computer and we cannot get in touch with you, your guest will not be allowed in to HPGCC.\nCommunity Traffic\nStop signs have been placed throughout the community. Please be safe and observe the 25 mph speed limit. For your safety and the safety of others, please refrain from walking or jogging in the community roadways.\nTraffic Violations\nTraffic violations are applicable to speeding and reckless driving within the Heritage Palms Community. This includes excessive speeding, dangerous driving and other conduct that affects the health and safety of others.\nTraffic violations include but are not limited to the following:\n• Speeding in excess of speed limits posted in the community\n• Running a stop sign\n• Ignoring round-about signage\n• Gate entrance and exit violation\nAny violations of traffic rules will result in the following disciplinary action\na. First Violation - Member will be sent a warning letter\nb. Subsequent violations – Each subsequent violation will add 10 days to the   previous gate pass deactivation along with a $200 fine for each subsequent violation.\nc. More than three violations in any (12) month period may result in further enforcement actions by the Board of Directors.\nd. A violation by one member of the Family may result in the suspension of all other family members privileges.\nAfter two years without a violation, the process begins anew. Any subsequent violation within a two year period after a previous one, continues the disciplinary process.\nParking Violations\nAny parking in a clearly marked no parking zone or restricted area outlined in the rules and regulations will result in the following:\na. $65 fine for each violation.\nb. Three of more parking violations will result in larger fines and suspensions as determined by the Board of Directors.\nThe Ft. Myers Police Department will patrol the streets of Heritage Palms Community on a regular basis and will issue tickets for parking and traffic violations.\nIn cases where large club activities are being held with limited parking available, security may direct or permit parking in no parking areas at the Clubhouse.\nLightening Warning\nThis club has no lightning detection device or alarm system. In the event of inclement weather, golfers should immediately leave the course and seek shelter. Golfers play at their own risk. Lightning strikes may cause serious injury or death.\nWildlife\nPlease do not feed the alligators, ducks, raccoons or any other wildlife! For all wildlife inquires please contact CDD District Manager Cal Teague at 245-7118 ext. 301, (Cell) 233-4437, or via\nEmail\n.\nSecurity & Gatehouse Contacts\nDan Davis\nDirector of Security\n239-839-8525\n[email protected]\nGatehouse\n239-277-9273\n[email protected]\nHeritage Palms Golf & Country Club\n10420 Washingtonia Palm Way\nFort Myers, FL 33966\nTHis is one item with icon and text\nPhone:\n239-278-9090\nTHis is one item with icon and text\nTHis is one item with icon and text\nFax: 239-278-0888\nTHis is one item with icon and text\nTHis is one item with icon and text\n© 2025  Heritage Palms Golf & Country Club. All Rights Reserved.\nPowered by Jonas Club Software",
      "emails": [
        "gnb_logo2@4x.aspx"
      ]
    }
  ],
  "all_links": [
    "http://www.hpgcc.com/Club_Lifestyle/Golf",
    "http://www.hpgcc.com/Dining_Events_(1)/Weddings_Events_(1)",
    "http://www.hpgcc.com/Community/News_Around_the_Club",
    "https://www.hpgcc.com/Governance/ARC-_Architectural_Review_Committee",
    "http://www.hpgcc.com/Club_Lifestyle/Racquet_Sports",
    "http://www.hpgcc.com/About",
    "http://www.hpgcc.com/Club_Lifestyle",
    "http://www.hpgcc.com/default.aspx",
    "http://www.hpgcc.com/roster/membervalidation.aspx",
    "http://www.hpgcc.com/About/Mission_Values",
    "http://www.hpgcc.com/About/History_(1)",
    "http://www.hpgcc.com/Real_Estate",
    "http://www.hpgcc.com/Community",
    "http://www.hpgcc.com/Club_Lifestyle/Fitness_Wellness_(1)",
    "http://www.hpgcc.com/Community/Employment",
    "http://www.hpgcc.com/Home",
    "http://www.hpgcc.com/Dining_Events",
    "http://www.hpgcc.com/About/Map_Directions_(1)",
    "http://www.hpgcc.com/resetpassword.aspx"
  ],
  "candidate_links": [
    "http://www.hpgcc.com/Dining_Events_(1)/Weddings_Events_(1)",
    "http://www.hpgcc.com/About",
    "http://www.hpgcc.com/Dining_Events",
    "http://www.hpgcc.com/About/Map_Directions_(1)"
  ],
  "visited": [
    "http://www.hpgcc.com/",
    "http://www.hpgcc.com/about",
    "http://www.hpgcc.com/contact",
    "http://www.hpgcc.com/staff",
    "http://www.hpgcc.com/team",
    "http://www.hpgcc.com/board",
    "http://www.hpgcc.com/directory",
    "http://www.hpgcc.com/events",
    "http://www.hpgcc.com/sitemap.xml",
    "http://www.hpgcc.com/council",
    "http://www.hpgcc.com/leadership",
    "http://www.hpgcc.com/management",
    "http://www.hpgcc.com/producers",
    "http://www.hpgcc.com/support",
    "http://www.hpgcc.com/crew",
    "http://www.hpgcc.com/members",
    "http://www.hpgcc.com/bios",
    "http://www.hpgcc.com/people",
    "http://www.hpgcc.com/artists",
    "http://www.hpgcc.com/musicians",
    "http://www.hpgcc.com/faculty",
    "http://www.hpgcc.com/administration",
    "http://www.hpgcc.com/Dining_Events_(1)/Weddings_Events_(1)",
    "http://www.hpgcc.com/About",
    "http://www.hpgcc.com/Dining_Events",
    "http://www.hpgcc.com/About/Map_Directions_(1)"
  ],
  "base_url": "http://www.hpgcc.com/"
}