{
  "pages": [
    {
      "url": "https://hunterspringskayak.com/about-us/contact/",
      "is_candidate": false,
      "has_email": true,
      "text": "Contact Us\nHave lots of Questions?\nYour email address will not be published. required fields are marked *\nYour name\nEmail\nSuject\nMessage\nSend message\nOur Digits...\nOur Address\n36 NE 4th Street \nCrystal River, FL 34429\nEmail\nmanager@hunterspringskayaks.com\nContact\nHSK: 352.228.4715 \n •\nMTD: 352.795.1333\nHours of Operation\n7 Days a Week: 8am - 5pm\nWhere to find us...\nGet Direction\nContact Us\nWhere to find us...\nGet Direction\nThe premiere outfitter for your Nature Coast experience on the Nature Coast of Florida.\nFacebook\nInstagram\nTripadvisor\nYelp\nServices\nKayaks\nManatee Tours\nSunset Cruises\nScalloping\nAbout\nContact Us\nFAQ\nTestimonial\nContact Us\n352-228-4715\nmanager@hunterspringskayaks.com\n36 NE 4th Street\nCrystal River, FL 34428\n© 2022 Hunter Springs Kayak & Tours • All rights reserved\nThe premiere outfitter for your Nature Coast experience on the Nature Coast of Florida.\nFacebook\nInstagram\nTripadvisor\nYelp\nServices\nKayaks\nManatee Tours\nSunset Cruises\nScalloping\nAbout\nContact Us\nFAQ\nTestimonial\nContact Us\n352-228-4715\nmanager@hunterspringskayaks.com\n36 NE 4th Street\nCrystal River, FL 34428\n© 2022 Hunter Springs Kayak & Tours • All rights reserved",
      "emails": [
        "%20manager@hunterspringskayaks.com",
        "info@hunterspringskayaks.com",
        "manager@hunterspringskayaks.com"
      ]
    },
    {
      "url": "https://hunterspringskayak.com/about-florida-manatees/",
      "is_candidate": false,
      "has_email": true,
      "text": "Are you Ready to Meet\na Manatee?\nAre you Ready to Meet a Manatee?\nTest your Knowledge…\nDid You Know...\n#1\nBeginning in November, the manatees begin to make their way into the springs.\n#2\nManatees eat tender seagrasses that grow in Florida’s springs until the end of March.\n#3\nAveraging approximately 10 feet long, manatees can tip the scales at up to 3,500 pounds!\n#4\nVisitors to Hunter Springs Kayak and Manatee Tour and Dive can get up and close and personal with these amazing creatures with our incredible selection of watercraft and guided manatee tours.\n#5\nWe are open 7 days a week and provide everything you need to create memories that will last a lifetime, whether you are going solo or bringing family and friends.\n#6\nYou can book your adventure right now with the click of a button!\nBook Online Now\nBefore You Go, You Need to Know…\nFlorida Manatees are heavily protected by the Florida Wildlife Commission and there are rules and regulations that must be followed for this imperiled creature to remain a natural resource for all to enjoy.\nManatees are protected by the Marine Mammal Protection Act of 1972, the Endangered Species Act of 1973, and the Florida Manatee Sanctuary Act of 1978. It is illegal to feed, harass, harm, pursue, hunt, shoot, wound, kill, annoy, or molest manatees.\nOur experienced team of staff, in-water guides, and seasoned captains are local experts on how to best view and swim with these ancient creatures. We offer both public and private tours with limited capacity, as well as the largest selection of personal watercraft on the gulf coast.\nNow that you're a Manatee Expert...\nExplore Adventures!\nAre you Ready to Meet\na Manatee?\nAre you Ready to Meet a Manatee?\nTest your Knowledge…\nThe premiere outfitter for your Nature Coast experience on the Nature Coast of Florida.\nFacebook\nInstagram\nTripadvisor\nYelp\nServices\nKayaks\nManatee Tours\nSunset Cruises\nScalloping\nAbout\nContact Us\nFAQ\nTestimonial\nContact Us\n352-228-4715\nmanager@hunterspringskayaks.com\n36 NE 4th Street\nCrystal River, FL 34428\n© 2022 Hunter Springs Kayak & Tours • All rights reserved\nThe premiere outfitter for your Nature Coast experience on the Nature Coast of Florida.\nFacebook\nInstagram\nTripadvisor\nYelp\nServices\nKayaks\nManatee Tours\nSunset Cruises\nScalloping\nAbout\nContact Us\nFAQ\nTestimonial\nContact Us\n352-228-4715\nmanager@hunterspringskayaks.com\n36 NE 4th Street\nCrystal River, FL 34428\n© 2022 Hunter Springs Kayak & Tours • All rights reserved",
      "emails": [
        "%20manager@hunterspringskayaks.com",
        "info@hunterspringskayaks.com",
        "manager@hunterspringskayaks.com"
      ]
    },
    {
      "url": "https://hunterspringskayak.com/about-us/",
      "is_candidate": false,
      "has_email": true,
      "text": "Proudly Serving Florida’s\nNature Coast for\n10+ Years!\nProudly Serving Florida’s Nature Coast for 10+ Years!\nFor over a decade...\nHunter Springs Kayak and Manatee Tour and Dive have been the leading adventure specialists in the Crystal River area. Located in the heart of Florida’s legendary Nature Coast, we launch into Kings Bay and its many tributaries including, Three Sisters, Jurassic, King, Hunter, House, and Idiot’s Delight Springs.\nOur experienced in-water guides and captains ensure that every visitor receives the assistance that they need to make their trip magical. From advice on planning your self-guided tours, to what vessel will best serve you, we are here to help! With the largest selection of watercraft in the area, we have everything you need to create memories that will last a lifetime.\nWe feature both public and private\neco-tours\n, as well\nhourly rentals\nfor stand up paddleboards, kayaks, canoes, clear-bottom kayaks, and more! We’re also proud to offer daily\nsunset cruises\nand\nscallop-hunting\nadventures\n.\nReserve your spot today or give us a call at\n(352) 228-4715\nto learn more.\nReserve Now!\nWhy Choose Us?\nOver 10 Years Experience\nSafety First\nProfessional Guides\nReviews\nGood stuff here\nJames Mosey\nSeptember 22, 2022\nThis place is amazing .. employees are really nice and helpful,  please go early,  time on the water goes fast and you need time to really enjoy the\n... read more\nareas of the springs\nJacqueline Cuevas\nSeptember 21, 2022\nWe had a great time. Very helpful.\nTony Carter\nSeptember 21, 2022\nFriendly staff, great service 👍🏻they have a bathroom and outside changing rooms onsite. Tip: park your car at the kayak place and walk to the loading dock. Or else you\n... read more\nwill have to pay for parking. It’s a short walk. And Don’t forget to wear a lots of Sun screen out there.\nJonathan Wang\nSeptember 20, 2022\nCat and Bryan were awesome. They did a great job ensuring we saw manatees. They also made sure to explain all gear and best practices. The entire staff went above\n... read more\nand beyond to make us feel welcomed and enjoy the experience. Gloria was cheerful, patient and peppy when I called to ask some questions prior to booking. I definitely recommend this company and this crew!!\nLaTeshia Williams\nSeptember 19, 2022\nStaff was excellent. Was easy to get a kayak rented and go out. My daughter lost our car keys when she accidentally flipped over and the workers came to try\n... read more\nto search the water. Unfortunately we never found them but again a big shout out for coming to try to help.\nJill Nadeau\nSeptember 18, 2022\nCat was an outstanding tour guide. She is passionate about what she does and determined to show you a good time. The manatees were amazing. Cat found beautiful springs to\n... read more\nshow us that weren’t on any maps.\nDon Stoppe\nSeptember 17, 2022\nGreat place to rent kayak to trip up to Three Sisters springs. They also rent dry boxes and snorkel gear just in case you forgot yours. Gift shop there as\n... read more\nwell.\nkaren mccoy\nSeptember 17, 2022\nSpectacular trip from beginning to end.   Staff was superb and informative and super friendly.  Best kayaking trip to date.\nPatty McLemore\nSeptember 15, 2022\nThe people in the office are dripping with kindness and the folks at the launch point are no different. They have awesome local recommendations and tips and tricks for paddling\n... read more\naround. Go with Hunter springs kayaks!\nSable Schroff\nSeptember 15, 2022\nGreat time!\nRyan Mazur\nSeptember 15, 2022\nVery professional,very friendly,I wish the price was a little cheaper,the dry box should be free.we paid enough for the kayak.\nmark human\nSeptember 15, 2022\nHad a blast with my bff Patty on Sunday. Very friendly staff and service. Had a beautiful day, The water is so pretty and the wildlife didn't disappoint! Thank you.\n... read more\nI  will be seeing you again 😊✌️\nLori Tucker\nSeptember 15, 2022\nBeautiful place very helpful staff !!!\nDawid Lelis\nSeptember 8, 2022\nSwimming with manatees tour guide was an experience and absolutely amazing 😍 They provided wetsuits, goggles with a snorkel    Brian and Cat were so informational! They are\n... read more\nfriendly, funny and so helpful. They even offered anti fog spray for others swimming along to ensure they also have a great experience and were able to see. We saw a sleeping manatee named triangle, a mother manatee and a curious baby manatee. They also took us to see the bubbling spring. This was a core memory for me. BEST GIRLS DAY EVER!!  #manateesandmemories\nYesenia Monzon\nSeptember 8, 2022\nGreat spot, super friendly staff and everything easy to book and find. I appreciated the video at the beginning about how to interact with the manatees. My husband and I\n... read more\nwent on the dive trip and liked it so much we rented kayaks the next morning to explore the bay on our own.  Tanya and Matt were awesome guides, and super knowledgeable. I'd recommend this to anyone wanting to see the amazing natural beauty of this place. It was accessable to all skill levels, including older children. 100% worth it!\nKatie Foster\nSeptember 8, 2022\nFriendly and very knowledgeable of the area\nchad fish\nSeptember 8, 2022\nVery accommodating. We book online for 12:30 and upon getting to the shop we requested for a change to 10:00 and they made it possible. Thanks Hunter Spring Kayak! We\n... read more\nenjoyed our kayaking to Three Sisters Spring. Amazing!!!\nRafaelita Oftedahl\nSeptember 8, 2022\nVery good\nEinav Hochberg\nSeptember 8, 2022\nThis service was friendly and attentive. Definitely recommended!\nCarla Tovar\nSeptember 8, 2022\nVery friendly and helpful staff!  This was my first time kayaking and I will certainly try to make it a regular experience.\nFlo Herald\nSeptember 8, 2022\nAwesome place...awesome people!!! Reasonable, easy and fun! We MUST go again! The woman who answered my call was an absolute 😇 and took very good care of us. She made\n... read more\nour experience so AMAZING! Highly recommended!!!\nShannon Kay\nSeptember 8, 2022\nAlways a great experience! Friendly staff and beautiful scenery always brings us back!\nSamantha watkins\nSeptember 8, 2022\nThis place is absolutely amazing 🤩 with the most friendly people ever. Super great experience and recommend 10000% give them a try you will not be disappointed AT ALL.\nJennifer Curry\nSeptember 8, 2022\nQuick check in and everyone was very friendly and accommodating! This is the 2nd time we rented from them and we will do it again! We kayak with our 2\n... read more\nkids (9 and 2 yr old) and everyone has a great time!\nJustyna Calderone\nSeptember 8, 2022\nGreat time out in Kings Bay with my 3 hour kayak rental through Hunter Springs Kayak! Saw manatees and had a refreshing swim in Three Sisters Springs! Highly recommend with\n... read more\na super convenient location!\nTyler Christian\nSeptember 8, 2022\nStaff was courteous. Answered all our questions,  being a first timer me and my were a bit nervous but the staff was were very patient. Loved the colorful ambience,\n... read more\nWill highly recommend and love to do again.\nAmber Bhatnagar\nSeptember 8, 2022\nPeople are friendly and informative. Process was easy. Equipment was all good. Had a great time.\nDanny Salvatore\nSeptember 8, 2022\nWe had a great time! The check in and waivers can be completed online, which makes getting to the water even faster on the day of your trip. There is\n... read more\na video, that was about 10 minutes long, you watch prior to getting in the kayaks. The equipment was in good shape and the staff was friendly and helpful. We really enjoyed our time and can’t wait to come back again!\nJourney InWander\nSeptember 7, 2022\nHad the best time!!!! We did a kayak rental in the afternoon and then took part in there very 1st pirate invasion dinner cruise in the evening the food was\n... read more\nawesome. Worth every penny. The staff was so awesome and we will definitely use this company again. Thank you for showing us an amazing day.\nMike T\nSeptember 7, 2022\nThis place was amazing! We knew we wanted to rent but didn't know when. They helped us as a walk up at the shop, friendly, funny, knowledgeable... good people. The\n... read more\nguys at the dock were patient as I got in the water and very helpful getting back out. Again very friendly. So happy to find them!\nDanielle Provin\nAugust 7, 2022\nHad a great day on the water with my family. Ladies at the office were very friendly, the gentlemen launching and helping bring in the kayaks were also friendly and\n... read more\nvery helpful. Everyone we interacted with at Hunter was great, even though it was definitely a very busy Saturday. Will absolutely use y'all again next time we're down here! Always worth the trip to see the springs and manatees.\nAmanda Leigh\nAugust 7, 2022\nBeing new to FL and traveling 2 hours to see Crystal River, the first Kayak place we found ( next to World of shells) I walked in and politely asked\n... read more\nif there were kayaks to rent she said no in a huff. I asked if there was anything to rent, she again same tone said no. Thankfully she did refer us to Hunter Springs Kayaks! The atmosphere, the friendliness and professionalism was definitely 5 star.  We played corn hole while we waited for our time slot.  I highly recommend Hunter for all your rental needs! Melissa was especially nice and helpful! Thank you all at Hunter for a great experience with my 15 yo daughter and her friend who are visiting from Wa state.  Worth the drive!!!\nStephanie *\nAugust 7, 2022\nWe had an absolute wonderful time on our manatee tour! The tour guides were accommodating, kind, and we appreciated their authentic care for the marine life. We got to practice\n... read more\nthe appropriate swimming techniques prior to the manatee experience which made getting to see the manatee more fun and less intimidating. We even got to swim into the Three Sisters Springs which was a beautiful, and what seems like, a once in a life time experience! Our only advice to future customers would be to get a case for your phone and take pictures independently. The tour guide took awesome ones for us, but the price for the photo package was steep.\nHillary Henry\nJuly 7, 2022\nMy best friend (my beautiful Wife) and I needed some thing to do for our together day off.  We have been wanting for some time now to visit 3\n... read more\nsister Springs.  I was not sure how to go about visiting the Springs so I called around. The best call I made and what made the final destination decision for us to visit the springs was calling Hunter Springs kayak.  I was greeted over the phone by Kim. She was able to answer all my questions kindly, sweetly and with great patience.  We figured it was our best bet to know where hunter Springs kayak was located so we can make the rental of a kayak easier for the next day.  We were greeted by Jamie and Q who were outstanding!  Personality - awesome and very laid back. They made all the arrangements for me it was just an experience that cannot be fully explained in words. You had to be there.  The experience was definitely 5 star service!  Instructions were given on how to get to the Springs, the team at the launch site was great and the instuctional video was highly informative. Rent a kayak for a minimum of 5 hours. There is more to see than you can imagine.If you decide to see 3 Sisters Spring use Hunter Springs Kayak - you won't be disappointed. Location 5 stars! Price 5 stars! Staff 10 stars !!! Happy kayaking 🙂\nden izzy\nJune 7, 2022\nSweet and friendly staff.  Good instructions.  We had been informed by the Three Sisters Springs Visitor Center that there were no manatees as it was out of season.\n... read more\nBut Hunter Spring Kayaks were more optimistic and recommended us a kayak trip and showed us on a map where there would be the greatest chance of seeing them.  And it paid off!  We saw about 5 manatees in total on the trip and also had the opportunity to swim with them.  So I can only recommend Hunter Spring Kayaks, they know what they are talking about.\nMette Zacho\nMay 7, 2022\nFANTASTIC family experience with captain Brian and our guide Matt yesterday! Groupon voucher redemption was simple and quick. Information provided on phone prior to coming was helpful, great customer service\n... read more\nand communication! Location easy to find, free parking right there. These people care about manatees. Every staff member was awesome. Matt was knowledgeable, took great care of us and kept up safe. He was super patient and friendly. Brian made sure to find manatees for us and we were able to have 3 or 4 different experiences at various locations. Nothing was rushed, everything was clean and safe and clearly explained. We swam in 3 Sisters which was the most beautiful experience! Even my 15 yr old son enjoyed it which says a lot! I’m not at all athletic in my 40s and was still able to have a great time and experience everything. An absolutely perfect morning on the water and we will be back for sure!\nP Bee\nMay 7, 2022\nWe had the best experience on our Guided Eco Tour with Hunter Springs Kayaks! Our tour guide Matthew was very knowledgeable and made sure that everyone had a good experience\n... read more\neven though there were many different levels of experience with kayaking. He went above and beyond to make sure our two kids had a good time. We got to see lots of manatees and it was the highlight of our trip! We would definitely do it again!  It was easy to book online and when I called a few weeks prior to our trip to switch times, they were very helpful. They also took pictures as part of our package, so we could snorkel around and enjoy ourselves and still have documentation of our tour. The majority of our family voted this as their favorite part of our trip over DisneyWorld. Definitely a must do!!\nElizabeth Davies\nMarch 7, 2022\nMy best friend (my beautiful Wife) and I needed some thing to do for our together day off.  We have been wanting for some time now to visit 3\n... read more\nsister Springs.  I was not sure how to go about visiting the Springs so I called around. The best call I made and what made the final destination decision for us to visit the springs was calling Hunter Springs kayak.  I was greeted over the phone by Kim. She was able to answer all my questions kindly, sweetly and with great patience.  We figured it was our best bet to know where hunter Springs kayak was located so we can make the rental of a kayak easier for the next day.  We were greeted by Jamie and Q who were outstanding!  Personality - awesome and very laid back. They made all the arrangements for me it was just an experience that cannot be fully explained in words. You had to be there.  The experience was definitely 5 star service!  Instructions were given on how to get to the Springs, the team at the launch site was great and the instuctional video was highly informative. Rent a kayak for a minimum of 5 hours. There is more to see than you can imagine.If you decide to see 3 Sisters Spring use Hunter Springs Kayak - you won't be disappointed. Location 5 stars! Price 5 stars! Staff 10 stars !!! Happy kayaking 🙂\nden izzy\nJune 7, 2022\nSweet and friendly staff.  Good instructions.  We had been informed by the Three Sisters Springs Visitor Center that there were no manatees as it was out of season.\n... read more\nBut Hunter Spring Kayaks were more optimistic and recommended us a kayak trip and showed us on a map where there would be the greatest chance of seeing them.  And it paid off!  We saw about 5 manatees in total on the trip and also had the opportunity to swim with them.  So I can only recommend Hunter Spring Kayaks, they know what they are talking about.\nMette Zacho\nMay 7, 2022\nProudly Serving Florida’s\nNature Coast for\n10+ Years!\nProudly Serving Florida’s Nature Coast for 10+ Years!\nThe premiere outfitter for your Nature Coast experience on the Nature Coast of Florida.\nFacebook\nInstagram\nTripadvisor\nYelp\nServices\nKayaks\nManatee Tours\nSunset Cruises\nScalloping\nAbout\nContact Us\nFAQ\nTestimonial\nContact Us\n352-228-4715\nmanager@hunterspringskayaks.com\n36 NE 4th Street\nCrystal River, FL 34428\n© 2022 Hunter Springs Kayak & Tours • All rights reserved\nThe premiere outfitter for your Nature Coast experience on the Nature Coast of Florida.\nFacebook\nInstagram\nTripadvisor\nYelp\nServices\nKayaks\nManatee Tours\nSunset Cruises\nScalloping\nAbout\nContact Us\nFAQ\nTestimonial\nContact Us\n352-228-4715\nmanager@hunterspringskayaks.com\n36 NE 4th Street\nCrystal River, FL 34428\n© 2022 Hunter Springs Kayak & Tours • All rights reserved",
      "emails": [
        "%20manager@hunterspringskayaks.com",
        "info@hunterspringskayaks.com",
        "manager@hunterspringskayaks.com"
      ]
    }
  ],
  "all_links": [
    "https://hunterspringskayak.com/about-us/contact/",
    "https://hunterspringskayak.com/kayaking/",
    "https://hunterspringskayak.com/about-us/f-a-q/",
    "https://hunterspringskayak.com/",
    "https://hunterspringskayak.com/manatee-tours/",
    "https://hunterspringskayak.com/about-florida-manatees/",
    "https://hunterspringskayak.com/about-us/",
    "https://hunterspringskayak.com",
    "https://hunterspringskayak.com/scallops-more/"
  ],
  "candidate_links": [
    "https://hunterspringskayak.com/about-us/contact/",
    "https://hunterspringskayak.com/about-florida-manatees/",
    "https://hunterspringskayak.com/about-us/"
  ],
  "visited": [
    "http://hunterspringskayak.com/",
    "http://hunterspringskayak.com/about",
    "http://hunterspringskayak.com/contact",
    "http://hunterspringskayak.com/staff",
    "http://hunterspringskayak.com/team",
    "http://hunterspringskayak.com/board",
    "http://hunterspringskayak.com/directory",
    "http://hunterspringskayak.com/events",
    "http://hunterspringskayak.com/sitemap.xml",
    "http://hunterspringskayak.com/council",
    "http://hunterspringskayak.com/leadership",
    "http://hunterspringskayak.com/management",
    "http://hunterspringskayak.com/producers",
    "http://hunterspringskayak.com/support",
    "http://hunterspringskayak.com/crew",
    "http://hunterspringskayak.com/members",
    "http://hunterspringskayak.com/bios",
    "http://hunterspringskayak.com/people",
    "http://hunterspringskayak.com/artists",
    "http://hunterspringskayak.com/musicians",
    "http://hunterspringskayak.com/faculty",
    "http://hunterspringskayak.com/administration",
    "https://hunterspringskayak.com/about-us/contact/",
    "https://hunterspringskayak.com/about-florida-manatees/",
    "https://hunterspringskayak.com/about-us/"
  ],
  "base_url": "http://hunterspringskayak.com/"
}