{
  "pages": [
    {
      "url": "https://indianpassrawbar.com/contact/",
      "is_candidate": false,
      "has_email": true,
      "text": "Skip to content\n(850) 227-1670\nOur Menu\nOur History\nCustomer Reviews\nArea Links\nContact\nMondays: Closed\nTues to Sun: 12 PM - 9 PM\n(850) 227-1670\nGet Directions\nContact\nFeel free to reach out to us using the contact information below – we look forward to hearing from you!\nCall Us\n(850) 227-1670\nFind Us\n8391 County Road 30A\nPort St. Joe, FL 32456\nVisit Us\nMondays: Closed\nTues to Sun: 12 PM to 9 PM\nContact Us\n[email protected]\nWhen folks used to call Jimmy Mac for directions, chances are he would tell them with his jumbo-size Panhandle drawl, “Just follow somebody. You almost got to know we’re here. We’re a word-of-mouth kind of place.” Truth is, most local folks would rather lead you here than tell you how to find us, anyway.\nView Our Menu\nMondays: Closed\nTues to Sun: 12 PM - 9 PM\n(850) 227-1670\n8391 County Rd 30A\nPort St. Joe, FL 32456\n[email protected]\n©2025 Indian Pass Raw Bar.\n        All rights reserved.\nPrivacy Policy\nSitemap\nSite by KMA",
      "emails": [
        "ndnpassmere@gmail.com"
      ]
    },
    {
      "url": "http://www.indianpassrawbar.com/about/",
      "is_candidate": false,
      "has_email": false,
      "text": "Skip to content\n(850) 227-1670\nOur Menu\nOur History\nCustomer Reviews\nArea Links\nContact\nMondays: Closed\nTues to Sun: 12 PM - 9 PM\n(850) 227-1670\nGet Directions\nOur History\nMade for The Community\nA staple of local culture,\nIndian Pass Raw Bar\nhas served the Indian Pass community and surrounding areas since 1903, when the McNeill family first began a turpentine enterprise in the area. James McNeill Sr. was a pioneer of his time, homesteading and building his business in the little-traveled or tamed wilderness that was the turn-of-the-century North Florida. After a rapid expansion of his business, he opened a commissary and company store to serve the turpentine business’s multiple employees and their families, and when the highway was completed in 1929, the store moved to its present location to take advantage of new passing traffic as well.\nIn the 1930s, the store added gas pumps to accommodate travelers on the new highway, and James’ wife, Gypsie opened up a tearoom on the right side of the building serving tea and sandwiches. By the time James and Gypsie’s son James McNeill Jr., aka “Jimmie”, came of age and took his place as the head of the family business, it sold everything from gasoline to soft-serve ice cream. Jimmie’s wife, Betty, was once quoted as saying, “If we don’t have it, you don’t need it!”\nThe Birth of The Raw Bar\nWhen Jimmie came home from the war in 1947, the family turpentine business had largely lost its relevance, and Jimmie began working at a local oyster shucking house. Jimmie was a brilliant businessman, and with time, he would evolve from working in the shucking house to growing his own seafood business, The Indian Pass Seafood Company, with over 100 acres of oyster leases and multiple shucking houses. Jimmie would sell oysters from Apalachicola to New York City, and incorporated the company in 1982.\nIn 1985, Hurricane Kate struck a devastating blow to the area, devastating the family’s oyster leases and filling the store with water.\nThe Indian Pass Seafood\ncompany was stuck with a huge inventory of seafood and multiple coolers severely damaged or not working. In a last-ditch effort and stroke of genius, Jimmie’s son, Jimmie Mac, proposed cooking off the seafood and selling it by the pound. Locals loved it, and soon the demand for this tasty by-the-pound seafood grew, and thus the modern\nIndian Pass Raw Bar\nconcept was born.\nThe Legacy of Jimmie Mac\nJimmie Mac was a gregarious man with a knack and passion for entertaining. His jovial spirit and love for live music transformed what was once a roadside store into a bustling restaurant and tourist attraction. His “what happens on the porch stays on the porch” attitude kept generations of locals and tourists alike returning year after year, and under his supervision, the restaurant grew in popularity more than anyone could have expected. Soon, the restaurant would be featured in countless food television programs as well as articles by the NY Times, Forbes,\nSouthern Living\n, and more. Celebrities from Johnny Cash to Ted Nugent graced the doors, and songwriting legends wrote songs of Jimmie Mac and this little piece of paradise he created.\nSadly, Jimmie Mac passed away in March 2020. They say, “Legends never die,” and so his legacy lives on, particularly through his children Jennifer, Meredith, Katie Mac, and Austin, who now operate the family restaurant.\nWhen Jimmie Mac passed, the restaurant was closed for remodeling after\nCategory 5 Hurricane Michael\nonce again flooded the building with water. In the summer of 2020, the McNeill children reopened the doors again with a spectacular new addition of a stage and courtyard dedicated to Jimmie Mac. His children have maintained the Raw Bar’s rustic, no-frills charm, delicious food, and old-school serve-yourself system while adding improvements to modernize and keep up with the pace of an ever-changing world. The McNeills hope to honor their rich coastal history and family legacy by continuing to serve you and your families, just as we have for nearly 100 years.\nWe invite you to come as you are and enjoy the new and improved—but effortlessly classic—Indian Pass Raw Bar.\nView Our Menu\nMondays: Closed\nTues to Sun: 12 PM - 9 PM\n(850) 227-1670\n8391 County Rd 30A\nPort St. Joe, FL 32456\n[email protected]\n©2025 Indian Pass Raw Bar.\n        All rights reserved.\nPrivacy Policy\nSitemap\nSite by KMA",
      "emails": []
    }
  ],
  "all_links": [
    "https://indianpassrawbar.com/contact/",
    "https://indianpassrawbar.com/about/",
    "http://www.indianpassrawbar.com/about/",
    "http://www.indianpassrawbar.com/cdn-cgi/l/email-protection#87e9e3e9f7e6f4f4eae2f5e2c7e0eae6eeeba9e4e8ea",
    "http://www.indianpassrawbar.com/menu/",
    "https://indianpassrawbar.com/customer-reviews/",
    "http://www.indianpassrawbar.com/cdn-cgi/l/email-protection#046a606a7465777769617661446369656d682a676b69",
    "https://indianpassrawbar.com/area-links/",
    "https://indianpassrawbar.com/menu/",
    "http://www.indianpassrawbar.com/privacy-policy/",
    "http://www.indianpassrawbar.com/sitemap.xml",
    "http://www.indianpassrawbar.com/cdn-cgi/l/email-protection#1c7278726c7d6f6f71796e795c7b717d7570327f7371",
    "http://www.indianpassrawbar.com/cdn-cgi/l/email-protection#bbd5dfd5cbdac8c8d6dec9defbdcd6dad2d795d8d4d6",
    "http://www.indianpassrawbar.com/"
  ],
  "candidate_links": [
    "https://indianpassrawbar.com/contact/",
    "http://www.indianpassrawbar.com/about/"
  ],
  "visited": [
    "http://www.indianpassrawbar.com/",
    "http://www.indianpassrawbar.com/about",
    "http://www.indianpassrawbar.com/contact",
    "http://www.indianpassrawbar.com/staff",
    "http://www.indianpassrawbar.com/team",
    "http://www.indianpassrawbar.com/board",
    "http://www.indianpassrawbar.com/directory",
    "http://www.indianpassrawbar.com/events",
    "http://www.indianpassrawbar.com/sitemap.xml",
    "http://www.indianpassrawbar.com/council",
    "http://www.indianpassrawbar.com/leadership",
    "http://www.indianpassrawbar.com/management",
    "http://www.indianpassrawbar.com/producers",
    "http://www.indianpassrawbar.com/support",
    "http://www.indianpassrawbar.com/crew",
    "http://www.indianpassrawbar.com/members",
    "http://www.indianpassrawbar.com/bios",
    "http://www.indianpassrawbar.com/people",
    "http://www.indianpassrawbar.com/artists",
    "http://www.indianpassrawbar.com/musicians",
    "http://www.indianpassrawbar.com/faculty",
    "http://www.indianpassrawbar.com/administration",
    "https://indianpassrawbar.com/contact/",
    "http://www.indianpassrawbar.com/about/"
  ],
  "base_url": "http://www.indianpassrawbar.com/"
}