{
  "pages": [
    {
      "url": "https://italian-club.org/host-your-event/",
      "is_candidate": false,
      "has_email": false,
      "text": "HOST YOUR EVENT\nOur three-story building, founded over 100 years ago, is an architectural masterpiece laced with elegance and historic beauty. Perfectly located in the historic district of Ybor City, this beautifully restored, classically elegant building provides the perfect venue for someone looking for an all-in-one facility.  We offer three distinctive rooms, each with a personality and style of their own.  The building has three levels; the Cantina on the first floor, the Theater on the second floor and the Grand Ballroom on the third floor. With three floors of event space, The Italian Club has the unique appeal of being able to accommodate a wedding ceremony, cocktail hour and reception in three separate locations, all with a cultivated charm of their own.\nCapitano Grand Ballroom\nLocated on the top floor of this historic venue, is the Capitano Family Grand Ballroom. It is the crowning jewel of Ybor City’s Italian Club. Decorated with hand-painted floral motif ceiling and alabaster chandeliers, it is perfect for wedding receptions, galas, award banquets and celebrations.  The elegance and charm of the grand ballroom will  make lasting impressions and memories of a lifetime.\nConnie Spoto Walter Theater\nSet in the middle of the Italian Club building is the Connie Spoto Walter Theater. Designed with tall expansive windows and wood flooring this theater is set to host any stage performance, awards banquet or wedding ceremony. The theater was once the center for productions such as operas, plays and concerts for many world famous celebrities.  The room’s traditional embellishments still exist today.\nClub Cantina\nThe Cantina, located on the first floor of the Italian Club building was a gathering place for many of the Italian Club Members. Men would meet to discuss the day’s events and play dominoes or billiards while sipping on a glass of wine. Today the Cantina offers a Mediterranean Café style atmosphere for more casual event or cocktail reception area. The room is perfect for themed celebrations, hosting cigar bars and other social events.\nClick Here To Download Our Photo Brochure\nIf you are interested in hosting an event at the Club, or would like more information about our venue, please complete the form below and a member of the staff will be in touch with you soon!\n*\nName\n*\nEmail\n*\nPhone\nDate of Event\nMore Details\nDo Not Fill This Out\nRead all of our wedding reviews on our\nThe Italian Club of Tampa\nStorefront at\n.host-your-event\nthe-content",
      "emails": []
    },
    {
      "url": "https://italian-club.org/events/",
      "is_candidate": false,
      "has_email": true,
      "text": "UPCOMING EVENTS\nCheck out the upcoming events and activities taking place at the Italian Club of Tampa!\nThe events listed below are being hosted by the Italian Club and/or our affiliates. Please click on the flyers to get detailed event information. If you would to purchase tickets to any of our upcoming events, please click the link provided or call the phone number listed on the event. Proceeds from our events benefit the Italian Club Building & Cultural Trust Fund, a registered 501C3 organization (Certificate #:59-2708291) dedicated to the ongoing preservation of our historical facility and the commitment to the Club mission statement.\nITALIAN CLUB ANNUAL MEMBERSHIP DRIVE\nFriday, September 5th – 5pm-8pm\nGET TICKETS:\nGet tickets by\nCLICKING HERE!\nEVENT DETAILS\n–\nWe invite you to join us as the Italian Club hosts our ANNUAL MEMBERSHIP DRIVE on Friday, September 5th from 5pm-8pm! This annual event will include exclusive new membership discounts, along with meet & greets with members of our Krewe, Ladies Auxiliary, and more! We encourage you to bring your friends, families, coworkers, and neighbors to experience the Italian Club and learn more about our Club. Attendees will enjoy guided historical tours of the Club, exclusive discounts on new membership, incredible live music, and more!  This event is open to Club Members and Public by ADVANCED Ticket Purchase Only. Tickets for this event are just $5 each, which provides every attendee with a complimentary dessert! There are no refunds.  In addition, attendees are invited to join us in our 1st Floor Club Cantina for our monthly First Friday Happy Hour, with dueling pianos entertainment! Our catering team, led by Chef Luigi from Trattoria Pasquale, will offer a delicious Italian Dinner for just $20 per person. A full cash/credit bar will be available, with specials all night, including our two-for-one Italian wine deal and signature Italian cocktails!  Questions? Call (813) 248-3316 or email mark@italian-club.org\nTHIS EVENT IS OPEN TO THE PUBLIC!\nFIRST FRIDAY HAPPY HOUR WITH DUELING PIANOS!\nFriday, September 5th – 5pm-8pm\nFREE TO ATTEND!\nNo tickets, No reservation!\nEVENT DETAILS\n–\nFirst Fridays at the Italian Club is a new concept in happy hour nightlife, combining delicious food and great drinks with fun live entertainment, making for a fun, casual night out with friends and family! Home of the Buy-One-Get-One Italian Wine deal!  Our Club Cantina will be transformed into a fun, social dueling piano bar – with incredible live music and more. We will be serving up a delicious homemade Italian meal for just $20 courtesy of our friends at Trattoria Pasquale! All our meals include our signature house salad and famous garlic breadsticks. The entree will change each month. Dinner availability is limited, so come early!   Questions? Call (813) 248-3316 or email mark@italian-club.org\nTHIS EVENT IS OPEN TO THE PUBLIC!\nDESTINATION SPAIN! A FOOD & WINE EVENT\nFriday, September 19th – 6pm-8pm\nGET TICKETS:\nGet tickets by\nCLICKING HERE!\nEVENT DETAILS\n–\nPrepare to be immersed in the delicious flavors of Spain, as the Italian Club kicks of Hispanic Heritage Month hosting “Destination Spain: A Food & Wine Experience”. This social event will offer attendees the opportunity to sample over 50 different wines from Spain & Portugal, with the beautiful sounds of Espana filling the room from our special surprise entertainment. Guests will enjoy one of a kind grazing table with assorted meats, cheese, and tapas along with tasting tables from local caterers and restaurateurs providing sample bites celebrating the essence of Spanish and Mediterranean cuisine. This is a wine buyers event! We will offer exclusive pricing available ONLY at this event for the purchase of wines by the case.  There are two options for attendance – a General Admission ($65) ticket or our VIP Tables ($595). Members receive a $10 discount on General Admission Tickets with valid promo code. This event is 21 & over only. Pricing is inclusive of taxes & fees; tickets are only available online; no refunds. Questions? Call (813) 248-3316 or email mark@italian-club.org\nTHIS EVENT IS OPEN TO THE PUBLIC!\nSWING DANCE NIGHT WITH THE LES ELGART ORCHESTRA & JIMMY DORSEY ORCHESTRA\nSaturday, September 27th – 730pm-11pm\nGET TICKETS:\nGet tickets by\nCLICKING HERE!\nEVENT DETAILS\n–\nJoin us for a very special evening, as the Italian Club of Tampa welcomes two of the greatest names of the swing era, combining forces to create their finest big band ever!!  The Jimmy Dorsey and Les Elgart Legacy All-Star 18-Piece Orchestra – featuring the greatest hits of the “Jukebox Kings” of the 1940’s and 50’s.  This remarkable evening will take place on Saturday, September 27th from 730pm-11pm in our large hardwood second-floor, with a nearly 30ft x 40ft dance floor, so our guests can dance the night away!  A full cash/credit bar will be available with specials available all night.  There are two ticket options available, $45 VIP Table Seating (tables seat 10 guests) or $35 General Admission (standing high top tables or chairs around perimeter of the room). Prices includes all taxes and service charges; no refunds are available. Members receive 10% off all tickets. Questions? Call (813) 248-3316 or email mark@italian-club.org\nTHIS EVENT IS OPEN TO THE PUBLIC!\nFALL 2025 ITALIAN LANGUAGE PROGRAM\nClasses Start Late-September; Eight (8) Week Course\nREGISTER TODAY\nYou can enroll in our Italian Language Program by\nCLICKING HERE!\nPROGRAM DETAILS\n–\nJoin us as we begin our Fall Session of our expansive Italian Language Program starting in September 2025.  Our Language Instructor, Leona Xharra, with Ciao Bella Gente!, will be offering Level 1, Level 2, Level 3, and Level 4 classes as part of our popular and expanding Italian Language Program. Classes will begin in late-September and continue for an 8-week period ending in mid-November.  Classes will be held in the Italian Club located at 1731 E. 7th Ave in historic Ybor City.  The class fees include in-person instruction, our language textbook, and parking. Enrollment is only available online!  Class sizes are limited to 20 students per class.  Payment is expected at the time of sign up; no refunds.  Class related materials such as books and parking passes will be distributed at the first class. Thank you for your support of the Club and our Italian Language Program!\nCLASSES ARE OPEN TO THE PUBLIC!\nFIRST FRIDAY HAPPY HOUR WITH DUELING PIANOS!\nFriday, October 3rd – 5pm-8pm\nFREE TO ATTEND!\nNo tickets, No reservation!\nEVENT DETAILS\n–\nFirst Fridays at the Italian Club is a new concept in happy hour nightlife, combining delicious food and great drinks with fun live entertainment, making for a fun, casual night out with friends and family! Home of the Buy-One-Get-One Italian Wine deal!  Our Club Cantina will be transformed into a fun, social dueling piano bar – with incredible live music and more. We will be serving up a delicious homemade Italian meal for just $20 courtesy of our friends at Trattoria Pasquale! All our meals include our signature house salad and famous garlic breadsticks. The entree will change each month. Dinner availability is limited, so come early!   Questions? Call (813) 248-3316 or email mark@italian-club.org\nTHIS EVENT IS OPEN TO THE PUBLIC!\nORCHESTRA FUEGO LIVE! LATIN MUSIC NIGHT\nSaturday, October 4th – 8pm-12am\nGENERAL TICKETS:\nGet tickets by\nCLICKING HERE!\nVIP TICKETS:\nGet tickets by\nCLICKING HERE!\nEVENT DETAILS\n–\nTampa, are you ready? The Italian Club Tampa proudly presents an unforgettable night of salsa, sabor, and swing as the internationally acclaimed Orchestra Fuego sets Ybor City ablaze on Saturday, October 4th, 2025 — and you won’t want to miss a single beat! Grab your dance shoes and your best moves! We’re powering through the evening with high energy hits from our brand new album “Mambo Mania” alongside all your Fuego favorites. From blistering Mambo grooves to soulful Salsa melodies, we’re serving the full Fuego experience.  PLUS – the incredible Vaya DJ will be spinning the hottest Latin beats before, between, and after our sets, keeping the floor ignited with Salsa, Bachata, Merengue, and more all night long.  Come early, enjoy the Italian Club’s classic ambiance and full bar, then dance the night away with one of the world’s top independent Salsa bands and Tampa’s own Latin vibes master, Vaya DJ!  Orchestra Fuego is bringing the HEAT to Tampa — let’s make this a night to remember!  Questions? Call (813) 248-3316 or email mark@italian-club.org\nTHIS EVENT IS OPEN TO THE PUBLIC!\nBREAKROOM ENTERTAINMENT PRESENTS: HOLLYWOOD PARODIES ON ICE\nSaturday, October 10th or October 11th – Show at 8pm\nGET TICKETS:\nGet tickets by\nCLICKING HERE!\nEVENT DETAILS\n–\nFollowing the success of TikTok sensation Disney Parodies On Ice and Broadway Parodies On Ice (14 million views and counting!), the Breakroom gang returns to lampoon your favorite songs from the movies!  Featuring fan-favorite theme tunes to films like Titanic, 9 to 5, Grease, Jurassic Park, The Greatest Showman, Ghostbusters, and many more, this one-of-a-kind, cabaret-style comedy concert performance is sure to be a crowd pleaser!  Two show options – Friday, October 10 (8pm) OR Saturday, October 11 (8pm).  Doors open 30 minutes before showtime. Cabaret-style table seating is open, first-come, first served. No refunds. THIS PERFORMANCE CONTAINS ADULT LANGUAGE AND MAY NOT BE SUITABLE FOR CHILDREN UNDER 13.  PLEASE NOTE: THIS IS NOT AN ACTUAL ICE-SKATING SHOW.  Questions? Email pedro@breakroomtampa.com\nTHIS EVENT IS OPEN TO THE PUBLIC!\nSAVE THE DATE: BOCCE BOWL 2025 TOURNAMENT FUNDRAISER\nTHREE DAYS – Friday October 10th, Saturday October 11th, Sunday October 12th!\nEVENT DETAILS\n–\nWe have some exciting news with you – the Club’s annual bocce tournament fundraiser will return in 2025, and it is getting even bigger!  With the help of our sponsors, donors, and volunteers, the Club was able to fundraise over $30,000 for our nonprofit endeavors during last year’s event.  The response from our sponsors and participants was that it was an overwhelming success, incredible new location, and simply… “you have got to do this again!”\r\nMark your calendars for the return of BOCCE BOWL, the Italian Club’s annual bocce tournament, now expending into a three-day event over Columbus Day Weekend – starting Friday October 10th, and continuing through Saturday, October 11th, and Sunday October 12th.  The Club will once again host this event in an exclusive VIP location in Ybor City, teaming up with local businesses and donors to make this one of the biggest bocce events in our community!  More details on this event, including sponsor packages and team packages will be released soon – anyone wanting to play in this tournament should save these dates!  Questions? Call (813) 248-3316 or email mark@italian-club.org\nTHIS EVENT IS OPEN TO THE PUBLIC!\nFIRST FRIDAY HAPPY HOUR WITH DUELING PIANOS!\nFriday, November 7th – 5pm-8pm\nFREE TO ATTEND!\nNo tickets, No reservation!\nEVENT DETAILS\n–\nFirst Fridays at the Italian Club is a new concept in happy hour nightlife, combining delicious food and great drinks with fun live entertainment, making for a fun, casual night out with friends and family! Home of the Buy-One-Get-One Italian Wine deal!  Our Club Cantina will be transformed into a fun, social dueling piano bar – with incredible live music and more. We will be serving up a delicious homemade Italian meal for just $20 courtesy of our friends at Trattoria Pasquale! All our meals include our signature house salad and famous garlic breadsticks. The entree will change each month. Dinner availability is limited, so come early!   Questions? Call (813) 248-3316 or email mark@italian-club.org\nTHIS EVENT IS OPEN TO THE PUBLIC!\nSAVE THE DATE: A SINATRA CLASSIC CHRISTMAS – TWO NIGHTS!\nThursday December 4th & Friday December 5th 2025\nEVENT DETAILS\n–\nJoin us as we welcome RICK MICHEL and his 7-piece big band orchestra for an evening celebrating the holiday season! Rick Michel, who has performed and headlined in Las Vegas since 1981, will present “A Sinatra Classic Christmas”, a show focusing on the classic music of Frank Sinatra, Dean Martin, Sammy Davis Jr., Bing Crosby, and many more! Michel salutes and interprets “Ol’ Blue Eyes” standards. Michel has been called “the closest thing to Sinatra we have ever heard” by “Variety.”  This is not a Frank Sinatra impersonation show, but rather an evening to celebrating the classic holiday favorites sung by some of the greatest artists of our time.  Tables seat 8 guests, and a cash/credit bar will be available.  THESE SHOWS WILL SELL OUT!  We anticipate tickets going on sale in during the upcoming summer 2025, so please mark your calendars for this incredible night of live music.  More details on this event coming soon!  Questions? Call (813) 248-3316 or email mark@italian-club.org\nTHIS EVENT IS OPEN TO THE PUBLIC!\nthe-content",
      "emails": [
        "mark@italian-club.org",
        "pedro@breakroomtampa.com"
      ]
    },
    {
      "url": "https://italian-club.org/contact-us/",
      "is_candidate": false,
      "has_email": false,
      "text": "CONTACT US\nThe Italian Club of Tampa\nis located in the heart of Ybor City’s Historic District.  Our building is located at\n1731 E. 7th Avenue, Tampa, FL 33605\nContact Us & Join Our Mailing List\n*\nName\n*\nEmail\nPhone\nQuestions/Comments\nDo Not Fill This Out\nthe-content",
      "emails": []
    },
    {
      "url": "https://italian-club.org/board-of-directors/",
      "is_candidate": false,
      "has_email": false,
      "text": "BOARD OF DIRECTORS\nSal Guagliardo\nBoard President\nDonald Bodie\nVice President\nJay Anthony\nTreasurer\nTownsend Belt\nSecretary\n.row\n.bodMembers\nItalian Club of Tampa Mission Statement\n:\nThe mission of L’Unione Italiana is to preserve and honor the culture, traditions and heritage of the Italian Community and to maintain the historical facility as a functioning memorial to the working class immigrants. We will support this mission through the dues and contributions provided by the members, their families, friends, and government. In return, we will add value to the membership by providing social activities, fellowship, Italian arts and culture; these activities will provide for growth and stability in the membership, creating a safe and comfortable environment for our members, their families, and the community.\n.bodPage\nthe-content",
      "emails": []
    },
    {
      "url": "https://italian-club.org/club-membership/",
      "is_candidate": false,
      "has_email": true,
      "text": "CLUB MEMBERSHIP\nITALIAN CLUB ANNUAL MEMBERSHIP DRIVE\nFriday, September 5th – 5pm-8pm\nGET TICKETS:\nGet tickets by\nCLICKING HERE!\nEVENT DETAILS\n–\nWe invite you to join us as the Italian Club hosts our ANNUAL MEMBERSHIP DRIVE on Friday, September 5th from 5pm-8pm! This annual event will include exclusive new membership discounts, along with meet & greets with members of our Krewe, Ladies Auxiliary, and more! We encourage you to bring your friends, families, coworkers, and neighbors to experience the Italian Club and learn more about our Club. Attendees will enjoy guided historical tours of the Club, exclusive discounts on new membership, incredible live music, and more!  This event is open to Club Members and Public by ADVANCED Ticket Purchase Only. Tickets for this event are just $5 each, which provides every attendee with a complimentary dessert! There are no refunds.  In addition, attendees are invited to join us in our 1st Floor Club Cantina for our monthly First Friday Happy Hour, with dueling pianos entertainment! Our catering team, led by Chef Luigi from Trattoria Pasquale, will offer a delicious Italian Dinner for just $20 per person. A full cash/credit bar will be available, with specials all night, including our two-for-one Italian wine deal and signature Italian cocktails!  Questions? Call (813) 248-3316 or email mark@italian-club.org\nTHIS EVENT IS OPEN TO THE PUBLIC!\nThe Italian Club of Tampa has become an integral part of the community, and we strive to fulfill our mission each and every day. That mission is to preserve and honor the culture, traditions and heritage of the Italian Community and to maintain the historical facility as a functioning memorial to the working-class immigrants. Our most important method of honoring this mission is through the dues and contributions provided by the members, their families, friends, and local businesses. In return we will add value to the membership by providing social activities, fellowship, Italian arts and culture; these activities will provide for growth and stability in the membership, creating a safe and comfortable environment for both members and their families. Membership privileges also entitle you to bi-monthly newsletters and mailers, discounts on facility rentals, preferred status and discounts on select Italian Club Socials and Ybor City functions.\nWe offer a variety of events and activities throughout the year for our members and the community at large.  Our events focus on celebrating the Italian culture and traditions in new and exciting ways.  We work diligently to target new audiences, from all communities – both for membership and for event attendees.  Here are just a few examples of the events we host each year:\nKrewe Socials & Parties\nFirst Friday Happy Hour\nSpaghetti Dinners\nWine Tastings\nBocce Tournaments\nHoliday Events & Parties\nMother’s Day Events\nCasino Nights\nVariety Shows & Opera Nights\nSanta Lucia Celebrations\nFashion Shows\nKids Events & Programs\nYbor Parade Parties\nLive Music Concerts\nMember Outings & Trips\nand so much more!\nWe are always happy to welcome new members, whether from the Italian Community or from all walks of life. As you may be aware membership dues are essential to the club’s continued viability and revitalization efforts. We thank you for your support and we look forward to working with you to help our membership grow. Each and every one of you are part of a family, the Italian Club family, and together we can make anything happen.  Special thank you to our DaVinci Business Contributors below:\nAudit Liaison\nSteve & Chris Antinori\nBellas Italian Cafe\nThe Belt Family\nThe Bodie Family\nCastellano Dentistry\nCertaPro Painters\nDona Anello PA, Realtor\nDutton Law Group\nEugene & Celeste Greco\nMary & Terry Greco-Smith\nSunny Florida Dairy\nDan Iovino\nTampa Pulmonary Institute\nJEM Glass\nLigori & Ligori Law\nJoseph & Jennifer Mantione\nMr. G’s Foods\nMr. Joseph Nuccio\nSIMWins\nRalph The Lawyer\nRita Carlinos Catering\nYbor Land\nThe Balloon Genie\nTradecraft Financial Group\nYbor City Chamber of Commerce\nYellow Cab of Tampa\nBECOME A MEMBER OF THE CLUB TODAY!\nThe Club offers a variety of membership options, to include:\nGeneral Membership ($200/year)\n– this level would provide membership to one individual\nFamily Membership ($250/year)\n– this level would provide membership to one-two adults, and any dependent children living within the household.\nDaVinci Membership ($550/year)\n– the level is a business level membership; which will also include parents and dependent children; this membership level is tax deductible\nAll Memberships include an allocation towards our organizations\nBuilding Preservation Reserve Fund\n– a long-term initiative that funds our building preservation and revitalization. The purpose of this account is to set aside moneys that the board has identified for use to defray the future costs related to repair or replacement of, or additions to, the major components that the organization is obligated to maintain. This is vital to the long-term preservation of our historic building, which is the home of our membership, and the backbone of our mission. The goal is to ensure that both our building and organization are here for future generations.\nTO BECOME A MEMBER\n– Please complete the form application below and click “submit”.  Once submitted, the application will be sent to our office directly, and you will be contact by a member of our staff so that we can complete your registration process.  You can also click the link below to print our application, which can then be completed and mail to us along with your payment. Please make checks payable to: Italian Club of Tampa, 1731 E. 7th Avenue, Tampa, FL 33605\nClick Here To Download A Membership Application\nItalian Club Membership Application\nSelect your preferred level of membership; all memberships are processed annually; and are nonrefundable\nIndividual $200 – Provides membership for a single individual\nFamily $250 – Provides membership for parents and dependent children\nDaVinci $550 – Provides for a business level membership; which will also include parents and dependent children; this membership level is tax deductible\nPrimary Card Member’s First Name:\n*\nPrimary Card Member’s Last Name:\n*\nBusiness Name (for Davinci Memberships only):\nPreferred Mailing Address:\nCity:\nState:\nZip:\nEmail:\nHome Phone:\nCell Phone:\n*\n**for Family and Davinci Memberships only, please list the name of the spouse and dependent children living in the household**\nSpouse Name:\nSpouse Email:\nChild:\nChild:\nChild:\nChild:\nPrimary Member Employer / Occupation:\nSpouse Employer / Occupation:\nIf you know a current Member, please list them as a sponsor (not required):\nIf you do not have a sponsor, you may leave this line blank and a membership committee member will be your sponsor.\nSponsor Full Name:\n[if !IE | (gte IE 8)]\nI would like to assist the Club by serving on the following committees:\n[endif]\n[if lt IE 8]>\r\n<label id=\"title44\" class=\"desc\">\r\nI would like to assist the Club by serving on the following committees\r\n</label>\r\n<![endif]\nBuilding\nFood Prep\nGrants\nMembership\nSocial\nCemetery\nGovernance\nCultural\nFundraising\nWebsite\nLadies Auxiliary**\nKrewe Of Italia**\n**Please Note: additional fees/dues apply for both our Krewe of Italia and our Italian Club Ladies Auxiliary Program\nOther Area of Expertise\nDo Not Fill This Out\nthe-content\nItalian Club Membership Application\nSelect your preferred level of membership; all memberships are processed annually; and are nonrefundable\n**for Family and Davinci Memberships only, please list the name of the spouse and dependent children living in the household**\nIf you know a current Member, please list them as a sponsor (not required):\nIf you do not have a sponsor, you may leave this line blank and a membership committee member will be your sponsor.\n**Please Note: additional fees/dues apply for both our Krewe of Italia and our Italian Club Ladies Auxiliary Program",
      "emails": [
        "mark@italian-club.org"
      ]
    },
    {
      "url": "https://www.facebook.com/lunione.italiana",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    },
    {
      "url": "https://www.facebook.com/italiancluboftampa/",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    }
  ],
  "all_links": [
    "https://italian-club.org/wp-content/uploads/2025/07/Italian-Club-First-Friday-Dueling-Piano.jpeg",
    "https://italian-club.org/wp-content/uploads/2025/03/Sinatra-Christmas-Save-The-Date-2025.png",
    "https://italian-club.org/wp-content/uploads/2021/09/wedding-dining-setup-crop.jpg",
    "https://italian-club.org/wp-content/uploads/2021/09/3-4-17JohnsonWedding-487-crop.jpg",
    "https://italian-club.org/host-your-event/",
    "https://italian-club.org/wp-content/uploads/2021/09/190719538_4229999767022485_4383463434758480554_n-crop.jpg",
    "https://italian-club.org/cemetery-search/",
    "https://italian-club.org/events/",
    "https://italian-club.org/wp-content/uploads/2025/07/ICOT-Membership-Drive.jpeg",
    "https://italian-club.org/wp-content/uploads/2021/09/8.22.21-Tie-The-Knot-Italian-Club-EH-026-1.jpg",
    "https://italian-club.org/contact-us/",
    "https://italian-club.org/seo-page/",
    "https://italian-club.org/history/",
    "https://italian-club.org/festa-italiana/",
    "https://italian-club.org",
    "https://italian-club.org/italian-invitational/",
    "https://italian-club.org/",
    "https://italian-club.org/wp-content/uploads/2025/03/SAVE-THE-DATE-2025-Bocce-Bowl-Fundraiser-scaled.jpeg",
    "https://italian-club.org/cemetery/",
    "https://italian-club.org/board-of-directors/",
    "https://italian-club.org/newsletter/",
    "https://italian-club.org/club-membership/",
    "https://italian-club.org/wp-content/uploads/2021/09/3-4-17JohnsonWedding-1104-crop.jpg",
    "https://italian-club.org/wp-content/uploads/2025/08/Destination-Spain-Wine-2025.png",
    "https://italian-club.org/wp-content/uploads/2025/07/IC-Swing-Dance-Night-2025.jpeg",
    "https://italian-club.org/ladies-auxillary/",
    "https://italian-club.org/wp-content/uploads/2025/07/ICOT-Fall2025-Language.jpeg",
    "https://italian-club.org/wp-content/uploads/2025/09/parodiesposter-scaled.png",
    "https://italian-club.org/wp-content/uploads/2021/09/ERINTOMOWEDDING0627-crop.jpg",
    "https://italian-club.org/donate/",
    "https://italian-club.org/krewe-of-italia/",
    "https://italian-club.org/wp-content/uploads/2025/08/Event-Flyers-Untitled-Page-2025-08-28T095729.741-scaled.jpeg"
  ],
  "candidate_links": [
    "https://italian-club.org/host-your-event/",
    "https://italian-club.org/events/",
    "https://italian-club.org/contact-us/",
    "https://italian-club.org/board-of-directors/",
    "https://italian-club.org/club-membership/",
    "https://www.facebook.com/lunione.italiana",
    "https://www.facebook.com/italiancluboftampa/"
  ],
  "visited": [
    "http://www.italian-club.org/",
    "http://www.italian-club.org/about",
    "http://www.italian-club.org/contact",
    "http://www.italian-club.org/staff",
    "http://www.italian-club.org/team",
    "http://www.italian-club.org/board",
    "http://www.italian-club.org/directory",
    "http://www.italian-club.org/events",
    "http://www.italian-club.org/sitemap.xml",
    "http://www.italian-club.org/council",
    "http://www.italian-club.org/leadership",
    "http://www.italian-club.org/management",
    "http://www.italian-club.org/producers",
    "http://www.italian-club.org/support",
    "http://www.italian-club.org/crew",
    "http://www.italian-club.org/members",
    "http://www.italian-club.org/bios",
    "http://www.italian-club.org/people",
    "http://www.italian-club.org/artists",
    "http://www.italian-club.org/musicians",
    "http://www.italian-club.org/faculty",
    "http://www.italian-club.org/administration",
    "https://italian-club.org/host-your-event/",
    "https://italian-club.org/events/",
    "https://italian-club.org/contact-us/",
    "https://italian-club.org/board-of-directors/",
    "https://italian-club.org/club-membership/",
    "https://www.facebook.com/lunione.italiana",
    "https://www.facebook.com/italiancluboftampa/"
  ],
  "base_url": "http://www.italian-club.org/"
}