{
  "pages": [
    {
      "url": "https://www.jaxgcc.com/weddings-and-events",
      "is_candidate": false,
      "has_email": false,
      "text": "2025.1.416.462\nSTART MASTER PAGE\nSkip to main content\nAbout Us\nClub History\nDirections to Club\nCareers\nBlueprint for Tomorrow\nGolf\nCourse Overview\nClub Amenities\nFitness\nSocial Events & Photo Gallery\nRacquet\nMassage Therapy\nKids Activities\nAquatics\nDining\nWeddings & Events\nMembership\nMembership Information Request\nMember Login\nend header\nStart Dynamic Page\nBegin Mini-Page 20797\nEnd Mini-Page 20797\nend banner\nBegin Mini-Page 20798\nWeddings & Events\nWe Create. You Celebrate. That's Jax Golf.\nWhether you are planning a Jacksonville wedding, business meeting, special event, or at-home catering function, our professional staff is here to help no matter the size or occasion. We welcome the opportunity to service your event with the elegance and style Jacksonville Golf & Country Club has come to represent. We pride ourselves on attention to detail and exceeding your expectations. With full-service catering, our Executive Chef will prepare distinctively delicious cuisine; and our highly experienced team will guide you effortlessly every step of the way. Your event will be a memorable occasion for you and your guests.\nAt Jacksonville Golf & Country Club, we make your wedding dream a reality. Centrally located in Jacksonville with incredible views of the golf course and lake, our private wedding venue is the ideal setting for the ceremony and reception you have always wanted. The clubhouse offers an unbelievable venue for hosting up to 200 guests for an event or reception. Our wedding pavilion is perfect for your outdoor ceremony. On your big day, our experienced wedding staff will free you from worry and stress allowing you to fully enjoy your once in a lifetime experience. With an elegant and custom culinary meal specifically prepared by our highly experienced team, we will take care of every detail subtly, attentively and thoroughly.\nParties and Private Events\nNo matter the celebration or event at hand, Jacksonville Golf and Country Club’s special event staff will anticipate your every need. Our elegantly appointed clubhouse is ideal for gatherings up to 200 people. For a special touch, expand your event to the wraparound Veranda, outdoor Lawn or Garden Terrace overlooking the golf course. For a smaller group, the Library or Boardroom is perfect for an intimate dinner party.\nRehearsal Dinners\nBaby & Bridal Showers\nGraduations\nRetirements\nCelebrations of Life\nHoliday Parties\nSweet 16\nBar & Bat Mitzvahs\nClass Reunions\nCorporate Outings\nCharity Fundraisers\nEnd Mini-Page 20798\nBegin Photo Album 1129\nEnd Photo Album 1129\nBegin Mini-Page 21121\nEvent Inquiries\nEnd Mini-Page 21121\n[if lt IE 9]>\r\n    <script type=\"text/javascript\" src=\"a_master/NET/RegistrationManager/Scripts/flashcanvas.js\"></script>\r\n    <![endif]\n* First Name:\n* Last Name:\n* Phone Number:\n* Email Address:\n* Event Type\nWedding\nBirthday\nCorporate Event\nOther\nAnniversary\nBaby Shower\nQuinceanera\n* Request Date of Event:\n* Requested Time of Day:\nAM\nPM\n* Alternative Request Date\n* Approx. Number of Guests:\n*  Additional Comments:\n* Denotes Required Field\nSaving Information...Please Wait\nend one-column\nEnd Dynamic Page / ID: 323\n3985 Hunt Club Road.Jacksonville, FL 32224\n(904) 223-5555\n(904) 223-9971\nContact Us\nJacksonville Golf & Country Club Copyright 2025. All rights reserved. Site by\nClubessential\nFacebook\nInstagram\nYoutube\nSite Scripts\nHide Click to Edits:\nFED Scripts\nBegin Mini-Page 20674\nEnd Mini-Page 20674\nCWS & Content Load\nBegin Mini-Page 20675\nEnd Mini-Page 20675\nRequest Membership Info\nEND MASTER PAGE",
      "emails": []
    },
    {
      "url": "https://www.jaxgcc.com/default.aspx?p=TrackHyperlink&URL=club-history&ssid=112409432443&fid=14194271260",
      "is_candidate": false,
      "has_email": false,
      "text": "2025.1.416.462\nSTART MASTER PAGE\nSkip to main content\nAbout Us\nClub History\nDirections to Club\nCareers\nBlueprint for Tomorrow\nGolf\nCourse Overview\nClub Amenities\nFitness\nSocial Events & Photo Gallery\nRacquet\nMassage Therapy\nKids Activities\nAquatics\nDining\nWeddings & Events\nMembership\nMembership Information Request\nMember Login\nend header\nStart Dynamic Page\nBegin Mini-Page 20876\nEnd Mini-Page 20876\nend banner\nBegin Mini-Page 20877\nClub History\nSince 1989...\nJacksonville Golf & Country Club stands as a captivating and picturesque destination in North Florida, showcasing a gracious low country-style clubhouse nestled on gently rolling terrain. Enveloped by abundant tree cover, serene fresh water lakes, and thriving wildlife, this idyllic setting is situated along the North East Coast of Florida.\nThe story of Jacksonville Golf & Country Club began in June 1987 when 732 acres were acquired for $10.4 million, marking the inception of Arvida's third community in greater Jacksonville, known as \"Jacksonville Country Club.\" In the Spring of 1988, the groundbreaking ceremony for the Club's 18-hole golf course took place, designed by golf course architect Clyde Johnston with player consultant Fuzzy Zoeller. The completion of the brick entry to Hunt Club Road in June 1989 set a prestigious tone for the community.\nAs a controlled access Arvida Community and a private, Member-owned Club, Jacksonville Golf & Country Club welcomed its first residents in the fall of 1989, with the inaugural round of golf played on the course in November of the same year. The year 1990 proved to be significant as JGCC hosted various prestigious golf events, including the Florida Mid-Amateur Golf Championship, the U.S. Amateur Qualifying Match, and the North Florida PGA Professionals Match Play Championship. In 1990, CBS Sport announcer Steve Melnyk nominated the JGCC course for the title of \"Best New Private Course in America.\" In 1993, JGCC served as the venue for the Florida State Amateur Championship.\nDespite facing challenges, such as a freeze in December 1989 that led to water damage and subsequent restoration of the clubhouse by March 1990, Jacksonville Golf & Country Club's reputation continued to flourish. In January 1991, Golfweek recognized the club as one of the \"Top Fifty Most Distinctive Development Courses in the Southeast.\"\nApril 1998 marked a significant transition for the Club, as ownership and management shifted from Arvida to the Club Membership. The Equity Membership allowed Club Members to acquire a share of ownership through the purchase of their home/property in Jacksonville Golf & Country Club. Non-Equity Memberships, which exclude a community property purchase, are also available in limited numbers. Currently boasting just under 800 Members, we look forward to the possibility of welcoming you into our esteemed Membership!\nFun Fact: In 1995, K-Mart shot a national commercial featuring Fuzzy Zoeller at Jacksonville Golf & Country Club!\nEnd Mini-Page 20877\nend one-column\nEnd Dynamic Page / ID: 363\n3985 Hunt Club Road.Jacksonville, FL 32224\n(904) 223-5555\n(904) 223-9971\nContact Us\nJacksonville Golf & Country Club Copyright 2025. All rights reserved. Site by\nClubessential\nFacebook\nInstagram\nYoutube\nSite Scripts\nHide Click to Edits:\nFED Scripts\nBegin Mini-Page 20674\nEnd Mini-Page 20674\nCWS & Content Load\nBegin Mini-Page 20675\nEnd Mini-Page 20675\nRequest Membership Info\nEND MASTER PAGE",
      "emails": []
    },
    {
      "url": "https://www.jaxgcc.com//default.aspx?p=dynamicmodule&pageid=367&ssid=100425&vnf=1",
      "is_candidate": false,
      "has_email": false,
      "text": "2025.1.416.462\nSTART MASTER PAGE\nSkip to main content\nAbout Us\nClub History\nDirections to Club\nCareers\nBlueprint for Tomorrow\nGolf\nCourse Overview\nClub Amenities\nFitness\nSocial Events & Photo Gallery\nRacquet\nMassage Therapy\nKids Activities\nAquatics\nDining\nWeddings & Events\nMembership\nMembership Information Request\nMember Login\nend header\nStart Dynamic Page\nBegin Mini-Page 20912\nEnd Mini-Page 20912\nend banner\nBegin Mini-Page 20913\nMembership Information Request\nPlease fill out this form to receive more information on Jacksonville Golf & Country Club Membership.\nEnd Mini-Page 20913\n[if lt IE 9]>\r\n    <script type=\"text/javascript\" src=\"a_master/NET/RegistrationManager/Scripts/flashcanvas.js\"></script>\r\n    <![endif]\n* First Name:\n* Last Name:\nStreet Address:\nCity:\nState:\nZip Code:\nPhone Number:\nCell Phone Number:\n* Email:\nClub Interests:\nGolf\nFitness\nDining\nPrivate Events\nPool\nKids' Activities\nTennis\nSpa\nSocial Events\nAre you currently living in or are you moving into the Jacksonville Golf and Country Club Community in the next 6-months?\nYes\nNo\nHave you ever been to Jacksonville Golf & Country Club?\nYes\nNo\nDo you know any Members of the Club?\nYes\nNo\nIf yes, what is their name?\nHow did you hear about us?\nReferred by a current member\nSocial media (Instagram, Facebook, etc.)\nClub website\nDirect mail / Club brochure\nReal estate agent referral\nOther (please specify)\nWord of mouth (non-member)\nOnline search (Google, Bing, etc.)\nAttended an event at the club\nPrint advertisement (Magazine, Newspaper, etc.)\nOther\nAdditional Comments:\n* Denotes Required Field\nSaving Information...Please Wait\nend one-column\nEnd Dynamic Page / ID: 367\n3985 Hunt Club Road.Jacksonville, FL 32224\n(904) 223-5555\n(904) 223-9971\nContact Us\nJacksonville Golf & Country Club Copyright 2025. All rights reserved. Site by\nClubessential\nFacebook\nInstagram\nYoutube\nSite Scripts\nHide Click to Edits:\nFED Scripts\nBegin Mini-Page 20674\nEnd Mini-Page 20674\nCWS & Content Load\nBegin Mini-Page 20675\nEnd Mini-Page 20675\nRequest Membership Info\nEND MASTER PAGE",
      "emails": []
    },
    {
      "url": "https://www.jaxgcc.com/membership",
      "is_candidate": false,
      "has_email": false,
      "text": "2025.1.416.462\nSTART MASTER PAGE\nSkip to main content\nAbout Us\nClub History\nDirections to Club\nCareers\nBlueprint for Tomorrow\nGolf\nCourse Overview\nClub Amenities\nFitness\nSocial Events & Photo Gallery\nRacquet\nMassage Therapy\nKids Activities\nAquatics\nDining\nWeddings & Events\nMembership\nMembership Information Request\nMember Login\nend header\nStart Dynamic Page\nBegin Mini-Page 20799\nEnd Mini-Page 20799\nend banner\nBegin Mini-Page 20800\nMembership\nIt's all about coming together at the Club\nNo matter where you live in the area, no matter what your main interests are, Membership at Jacksonville Golf & Country Club is about coming together and enjoying togetherness.\nExperience the ultimate in leisure and recreation! Tee off on a stunning 18-hole golf course, rally on 10 top-tier Har-Tru tennis courts, or dive into the fast-paced fun of 6 pickleball courts. Stay active every day at our fitness center, with energizing group exercise classes and refreshing aqua aerobics. Bring the whole family for exciting kids' events, junior camps, and a competitive swim team. Indulge in exceptional dining, vibrant social gatherings, exclusive wine tastings, and happy hour specials. Relax in our heated pool and discover endless ways to play, connect, and unwind!\nClick on \"Membership Inquiry\" to reach out to Jennifer Jones, Membership Director to learn more on how to become part of the Club!\nRequest Information\nMembership Options\nEnd Mini-Page 20800\nFull Membership\nBegin Mini-Page 20899\nEnjoy preferred access to all Club facilities and dining rooms, including unlimited ﬁtness and pool usage. Full members may play golf, tennis or pickleball without golf greens fees or court fees. Cart fees apply. Sign up 7 days in advance for golf and court times.\nEnd Mini-Page 20899\nSports Membership\nBegin Mini-Page 20900\nEnjoy preferred access to tennis, pickleball, and golf along with all Club facilities and dining rooms, including unlimited ﬁtness and pool usage. Sports members are not required to pay greens fees Tuesday through Friday (except holidays). Sports members have three-day advance sign-up privilege to reserve golf tee times for those days. Sports members may reserve tee times for weekend and holiday play with two days advance notice, play is restricted to after noon only and member greens fees apply. Weekend and holiday mornings can only be played as a guest of a Full member and will require payment of the appropriate guest fees. Cart fees apply. A seven-day advance sign-up privilege is given to reserve court times.\nEnd Mini-Page 20900\nRacquet Membership\nBegin Mini-Page 20901\nEnjoy preferred access to tennis and pickleball along with all social privileges. Racquet Sports members enjoy a 7-day advance sign-up for court times and may play golf up to six times per year by paying appropriate greens and cart fees. Racquet Sports members enjoy a 2-day advance sign-up for golf times. Saturday and Sunday golf is restricted to tee times after noon. The golf practice area may only be used by players with scheduled tee times.\nEnd Mini-Page 20901\nSocial Membership\nBegin Mini-Page 20902\nEnjoy access to all Club facilities and dining rooms, including unlimited ﬁtness and pool usage. Social members may play golf up to six times per year and tennis or pickleball up to six times per year by paying appropriate golf greens fees, cart fees and court fees. Sign up 2 days in advance for golf and court times. Saturday and Sunday golf is restricted to tee times after noon. The golf practice area may only be used by players with scheduled tee times.\nEnd Mini-Page 20902\nBegin Mini-Page 20903\nSee What Our Members Are Saying\nEnd Mini-Page 20903\nStart Tabs\n3.4.1\nSarah Franklin\nThe Remaley Family\nJoe Valinho\nMyrle & Ed Robinson\nRebecca & Greg Steele\nAllison Carbonneau\nDavid Anderson\nThe Stampers\nBegin Mini-Page 21136\nEnd Mini-Page 21136\nBegin Mini-Page 20905\nWe have lived in the community and been members of the club for over 9 years! We are raising our 2 young kids at the club and we thoroughly enjoy all the family activities the club has to offer from holiday\r\ncelebrations, kids' theme nights, summer camp, swim and tennis. We love having dinner at the club on Friday nights with live music and weekly dinner specials all while being surrounded by great friends we have made while being members here! We are avid users of the club fitness center and love the convenience of having the gym so close with free fitness classes we can enjoy. The golf course is gorgeous with pristine fairways and immaculately maintained greens which is why it was voted “Best Golf Course of Jacksonville” two years in a row! The Club is always such a welcoming place to visit where the staff knows your name and there are various dining, social and sporting events to cater to all members of your family. We love being a part of the club!\n-The Remaley Family\nEnd Mini-Page 20905\nBegin Mini-Page 20907\nTo live in Jacksonville Golf & Country Club was always a dream every time I drove by the beautifully manicured entrance and the long, white fencing. Today, 25 years later, I dream my children will appreciate their times of fun, friendship and, most importantly, the family of Jacksonville Golf and Country Club, where one day their family will call this special place home.\n-Joe Valinho\nEnd Mini-Page 20907\nBegin Mini-Page 20906\nJacksonville Golf & Country Club has been our home for 25 years. We continue to be happy and satisfied with all aspects of living in a gated Community. With both of us having served on numerous boards and committees\r\nin the neighborhood and at the Club, we have found that the residents here want\r\na safe and peaceful place to live and want to help us keep it a pristine Community.\n-Myrle & Ed Robinson\nEnd Mini-Page 20906\nBegin Mini-Page 20908\nWe joined Jacksonville Golf & Country Club nearly seven years ago and are truly enjoying all the benefits the Club offers! Much of the attraction for us initially was the casual elegance of the Clubhouse itself, and we were delighted as we got to know the staff who really make it special. We have found the Club to be a wonderful place to meet friends and neighbors, with its varied dining options and activities. There is always something to do and we take advantage of the many special events as well as everyday amenities. With a beautiful golf course, state-of-the-art tennis facility, pool and fitness classes from yoga to spinning, there is so much to choose from! And, we especially appreciate that the Club activities attract families and all age groups. This helps create a great environment for everyone and encourages participation in all the Club offers! All the more reason, we love it here...\n-Rebecca & Greg Steele\nEnd Mini-Page 20908\nBegin Mini-Page 20909\nEnd Mini-Page 20909\nBegin Mini-Page 20910\nEnd Mini-Page 20910\nBegin Mini-Page 20911\nEnd Mini-Page 20911\nEnd Tabs\nend one-column\nEnd Dynamic Page / ID: 324\n3985 Hunt Club Road.Jacksonville, FL 32224\n(904) 223-5555\n(904) 223-9971\nContact Us\nJacksonville Golf & Country Club Copyright 2025. All rights reserved. Site by\nClubessential\nFacebook\nInstagram\nYoutube\nSite Scripts\nHide Click to Edits:\nFED Scripts\nBegin Mini-Page 20674\nEnd Mini-Page 20674\nCWS & Content Load\nBegin Mini-Page 20675\nEnd Mini-Page 20675\nRequest Membership Info\nEND MASTER PAGE",
      "emails": []
    },
    {
      "url": "https://www.jaxgcc.com/default.aspx?p=TrackHyperlink&URL=Default.aspx%3fp%3dDynamicModule%26pageid%3d311%26ssid%3d100388%26vnf%3d1&ssid=112415982130&fid=14194271260",
      "is_candidate": false,
      "has_email": false,
      "text": "2025.1.416.462\nSTART MASTER PAGE\nSkip to main content\nAbout Us\nClub History\nDirections to Club\nCareers\nBlueprint for Tomorrow\nGolf\nCourse Overview\nClub Amenities\nFitness\nSocial Events & Photo Gallery\nRacquet\nMassage Therapy\nKids Activities\nAquatics\nDining\nWeddings & Events\nMembership\nMembership Information Request\nMember Login\nend header\nStart Dynamic Page\nBegin Mini-Page 20773\nEnd Mini-Page 20773\nend banner\nBegin Mini-Page 20774\nDirections to Club\nJacksonville Golf & Country Club\n3985 Hunt Club Road\nJacksonville, Florida 32224\nPhone:\n904-223-5555\nFax: 904-223-9971\nEnd Mini-Page 20774\nend one-column\nEnd Dynamic Page / ID: 311\n3985 Hunt Club Road.Jacksonville, FL 32224\n(904) 223-5555\n(904) 223-9971\nContact Us\nJacksonville Golf & Country Club Copyright 2025. All rights reserved. Site by\nClubessential\nFacebook\nInstagram\nYoutube\nSite Scripts\nHide Click to Edits:\nFED Scripts\nBegin Mini-Page 20674\nEnd Mini-Page 20674\nCWS & Content Load\nBegin Mini-Page 20675\nEnd Mini-Page 20675\nRequest Membership Info\nEND MASTER PAGE",
      "emails": []
    },
    {
      "url": "https://www.jaxgcc.com/Membership-Information-Request",
      "is_candidate": false,
      "has_email": false,
      "text": "2025.1.416.462\nSTART MASTER PAGE\nSkip to main content\nAbout Us\nClub History\nDirections to Club\nCareers\nBlueprint for Tomorrow\nGolf\nCourse Overview\nClub Amenities\nFitness\nSocial Events & Photo Gallery\nRacquet\nMassage Therapy\nKids Activities\nAquatics\nDining\nWeddings & Events\nMembership\nMembership Information Request\nMember Login\nend header\nStart Dynamic Page\nBegin Mini-Page 20912\nEnd Mini-Page 20912\nend banner\nBegin Mini-Page 20913\nMembership Information Request\nPlease fill out this form to receive more information on Jacksonville Golf & Country Club Membership.\nEnd Mini-Page 20913\n[if lt IE 9]>\r\n    <script type=\"text/javascript\" src=\"a_master/NET/RegistrationManager/Scripts/flashcanvas.js\"></script>\r\n    <![endif]\n* First Name:\n* Last Name:\nStreet Address:\nCity:\nState:\nZip Code:\nPhone Number:\nCell Phone Number:\n* Email:\nClub Interests:\nGolf\nFitness\nDining\nPrivate Events\nPool\nKids' Activities\nTennis\nSpa\nSocial Events\nAre you currently living in or are you moving into the Jacksonville Golf and Country Club Community in the next 6-months?\nYes\nNo\nHave you ever been to Jacksonville Golf & Country Club?\nYes\nNo\nDo you know any Members of the Club?\nYes\nNo\nIf yes, what is their name?\nHow did you hear about us?\nReferred by a current member\nSocial media (Instagram, Facebook, etc.)\nClub website\nDirect mail / Club brochure\nReal estate agent referral\nOther (please specify)\nWord of mouth (non-member)\nOnline search (Google, Bing, etc.)\nAttended an event at the club\nPrint advertisement (Magazine, Newspaper, etc.)\nOther\nAdditional Comments:\n* Denotes Required Field\nSaving Information...Please Wait\nend one-column\nEnd Dynamic Page / ID: 367\n3985 Hunt Club Road.Jacksonville, FL 32224\n(904) 223-5555\n(904) 223-9971\nContact Us\nJacksonville Golf & Country Club Copyright 2025. All rights reserved. Site by\nClubessential\nFacebook\nInstagram\nYoutube\nSite Scripts\nHide Click to Edits:\nFED Scripts\nBegin Mini-Page 20674\nEnd Mini-Page 20674\nCWS & Content Load\nBegin Mini-Page 20675\nEnd Mini-Page 20675\nRequest Membership Info\nEND MASTER PAGE",
      "emails": []
    },
    {
      "url": "https://www.jaxgcc.com/Social-Events",
      "is_candidate": false,
      "has_email": false,
      "text": "2025.1.416.462\nSTART MASTER PAGE\nSkip to main content\nAbout Us\nClub History\nDirections to Club\nCareers\nBlueprint for Tomorrow\nGolf\nCourse Overview\nClub Amenities\nFitness\nSocial Events & Photo Gallery\nRacquet\nMassage Therapy\nKids Activities\nAquatics\nDining\nWeddings & Events\nMembership\nMembership Information Request\nMember Login\nend header\nStart Dynamic Page\nBegin Mini-Page 20785\nEnd Mini-Page 20785\nend banner\nBegin Mini-Page 20786\nSocial Events & Photo Gallery\nJacksonville Golf & Country Club’s social calendar is booked with dozens of special events such as...\nArt & Wine Festival\nOutdoor Music & Entertainment Events\nNew Membership Mixers\nWine Tastings\nFall Festival\nBreakfast with Santa\nValentines Dinner\nEggcellent Family Night\nLabor Day Celebration\nAdult Halloween Party\nGrinchmas\nChristmas Dinner with Carriage Rides\nEaster Egg Hunt\nEaster Brunch\nFather/Daughter & Mother/Son Events\nCookouts at the Pool\nOyster Roast & Bluegrass Concert\nJax Bash\nMemorial Day Event\nPumpkinpalooza & Pumpkin Patch\nSanta Photos\nFamily Gingerbread House Making\nIsland Night\nOktoberfest\nKentucky Derby Party\nCinco de Mayo Fiesta\nMember Holiday Party\nSuperbowl Watch Party\nTrivia Nights\n4th Of July Celebration\nMonster Family Dance Party\nAnnual Tree Lighting\nEnd Mini-Page 20786\nBegin Photo Album 1119\nEnd Photo Album 1119\nend one-column\nEnd Dynamic Page / ID: 317\n3985 Hunt Club Road.Jacksonville, FL 32224\n(904) 223-5555\n(904) 223-9971\nContact Us\nJacksonville Golf & Country Club Copyright 2025. All rights reserved. Site by\nClubessential\nFacebook\nInstagram\nYoutube\nSite Scripts\nHide Click to Edits:\nFED Scripts\nBegin Mini-Page 20674\nEnd Mini-Page 20674\nCWS & Content Load\nBegin Mini-Page 20675\nEnd Mini-Page 20675\nRequest Membership Info\nEND MASTER PAGE",
      "emails": []
    }
  ],
  "all_links": [
    "https://www.jaxgcc.com/default.aspx?p=DynamicModule&pageid=322&ssid=100399&vnf=1",
    "https://www.jaxgcc.com/default.aspx?p=DynamicModule&pageid=320&ssid=100397&vnf=1",
    "https://www.jaxgcc.com/careers",
    "https://www.jaxgcc.com/weddings-and-events",
    "https://www.jaxgcc.com/default.aspx?p=TrackHyperlink&URL=club-history&ssid=112409432443&fid=14194271260",
    "https://www.jaxgcc.com/course-overview",
    "https://www.jaxgcc.com/default.aspx?p=TrackHyperlink&URL=https%3a%2f%2fwww.youtube.com%2f%40JaxGolf&ssid=112422161080&fid=14194271260",
    "https://www.jaxgcc.com/fitness",
    "https://www.jaxgcc.com/default.aspx?p=DynamicModule&pageid=313&ssid=100390&vnf=1",
    "https://www.jaxgcc.com/dining",
    "https://www.jaxgcc.com/default.aspx?p=TrackHyperlink&URL=https%3a%2f%2fwww.facebook.com%2fjaxgcc&ssid=112398557491&fid=14194271260",
    "https://www.jaxgcc.com/massage-therapy",
    "https://www.jaxgcc.com//default.aspx?p=dynamicmodule&pageid=367&ssid=100425&vnf=1",
    "https://www.jaxgcc.com/aquatics",
    "https://www.jaxgcc.com/racquets",
    "https://www.jaxgcc.com/default.aspx?p=TrackHyperlink&URL=course-overview&ssid=112417341499&fid=14194271260",
    "https://www.jaxgcc.com/member-login",
    "https://www.jaxgcc.com/default.aspx?p=DynamicModule&pageid=318&ssid=100395&vnf=1",
    "https://www.jaxgcc.com/default.aspx?p=TrackHyperlink&URL=fitness&ssid=112410173917&fid=14194271260",
    "https://www.jaxgcc.com/membership",
    "https://www.jaxgcc.com/default.aspx?p=TrackHyperlink&URL=Default.aspx%3fp%3dDynamicModule%26pageid%3d311%26ssid%3d100388%26vnf%3d1&ssid=112415982130&fid=14194271260",
    "https://www.jaxgcc.com/",
    "https://www.jaxgcc.com/directions-to-club",
    "https://www.jaxgcc.com/club-history",
    "https://www.jaxgcc.com/default.aspx?p=DynamicModule&pageid=324&ssid=100401&vnf=1",
    "https://www.jaxgcc.com/Membership-Information-Request",
    "https://www.jaxgcc.com/Social-Events",
    "https://www.jaxgcc.com/Kids-Activities",
    "https://www.jaxgcc.com/default.aspx?p=TrackHyperlink&URL=https%3a%2f%2fwww.instagram.com%2fjacksonvillegolf%2f&ssid=112398681070&fid=14194271260"
  ],
  "candidate_links": [
    "https://www.jaxgcc.com/weddings-and-events",
    "https://www.jaxgcc.com/default.aspx?p=TrackHyperlink&URL=club-history&ssid=112409432443&fid=14194271260",
    "https://www.jaxgcc.com//default.aspx?p=dynamicmodule&pageid=367&ssid=100425&vnf=1",
    "https://www.jaxgcc.com/membership",
    "https://www.jaxgcc.com/default.aspx?p=TrackHyperlink&URL=Default.aspx%3fp%3dDynamicModule%26pageid%3d311%26ssid%3d100388%26vnf%3d1&ssid=112415982130&fid=14194271260",
    "https://www.jaxgcc.com/Membership-Information-Request",
    "https://www.jaxgcc.com/Social-Events"
  ],
  "visited": [
    "https://www.jaxgcc.com/?utm_source=GMB&utm_medium=organic&utm_campaign=LocalSearch",
    "https://www.jaxgcc.com/about",
    "https://www.jaxgcc.com/contact",
    "https://www.jaxgcc.com/staff",
    "https://www.jaxgcc.com/team",
    "https://www.jaxgcc.com/board",
    "https://www.jaxgcc.com/directory",
    "https://www.jaxgcc.com/events",
    "https://www.jaxgcc.com/sitemap.xml",
    "https://www.jaxgcc.com/council",
    "https://www.jaxgcc.com/leadership",
    "https://www.jaxgcc.com/management",
    "https://www.jaxgcc.com/producers",
    "https://www.jaxgcc.com/support",
    "https://www.jaxgcc.com/crew",
    "https://www.jaxgcc.com/members",
    "https://www.jaxgcc.com/bios",
    "https://www.jaxgcc.com/people",
    "https://www.jaxgcc.com/artists",
    "https://www.jaxgcc.com/musicians",
    "https://www.jaxgcc.com/faculty",
    "https://www.jaxgcc.com/administration",
    "https://www.jaxgcc.com/weddings-and-events",
    "https://www.jaxgcc.com/default.aspx?p=TrackHyperlink&URL=club-history&ssid=112409432443&fid=14194271260",
    "https://www.jaxgcc.com//default.aspx?p=dynamicmodule&pageid=367&ssid=100425&vnf=1",
    "https://www.jaxgcc.com/membership",
    "https://www.jaxgcc.com/default.aspx?p=TrackHyperlink&URL=Default.aspx%3fp%3dDynamicModule%26pageid%3d311%26ssid%3d100388%26vnf%3d1&ssid=112415982130&fid=14194271260",
    "https://www.jaxgcc.com/Membership-Information-Request",
    "https://www.jaxgcc.com/Social-Events"
  ],
  "base_url": "https://www.jaxgcc.com/?utm_source=GMB&utm_medium=organic&utm_campaign=LocalSearch"
}