{
  "pages": [
    {
      "url": "https://kensingtoncc.com/contact/",
      "is_candidate": false,
      "has_email": true,
      "text": "How can we help?\nContact us here\nLocated in the Heart of beautiful Naples, FL\n2700 Pine Ridge Road.\nNaples, FL 34109\n(239) 920 2991\nPlease use this form for general inquries about Kensington Golf & Country Club.\nName\n*\nE-mail Address\n*\nPhone Number\n*\nComments\n0 / 180\nSend Message",
      "emails": [
        "john@doe.com"
      ]
    },
    {
      "url": "https://kensingtoncc.com/management-team/",
      "is_candidate": false,
      "has_email": false,
      "text": "Focused around You\nOur Management Team\nOur staff has decades of experience in Club Management, Hospitality, Customer Experience, and more.\nDave Krzywonos\nGeneral Manager\nE-Mail\nKelly Bowers\nMembership & Marketing Director\nE-Mail\nRali Bineva\nExecutive Administrator\nE-Mail\nKate Jantzen\nDirector of Administration & Communications\nE-Mail\nJohn Metzinger\nDirector of Golf\nE-Mail\nLanny Clark\nDirector of Golf Course Operations\nE-Mail\nRalph Feraco, CEC AAC\nExecutive Chef\nE-Mail\nLaura Corbett\nClubhouse Manager\nE-Mail\nColby Brooks\nEvents & Banquet Manager\nE-Mail\nKristy Breuler\nDirector of Fitness & Spa\nE-Mail\nBryan Twente\nDirector of Court Sports\nE-Mail\nKevin Mendez\nFacilities Manager\nE-Mail",
      "emails": []
    },
    {
      "url": "https://kensingtoncc.com/membership-types/",
      "is_candidate": false,
      "has_email": false,
      "text": "A Membership that’s focused around you\nExperience the perfect blend of elegance and community at Kensington Golf & Country Club with a Membership that fits your lifestyle.\nAvailable to both residents and non-residents\nFull Golf Membership\nFull Golf Members enjoy access to all the amenities at Kensington including the newly renovated, walkable Robert Trent Jones Jr. golf course, driving range, practice area, fitness center, pool, and court sports – bocce, tennis and pickleball. Full Golf Members can also enjoy an upscale dining experience in the Clubhouse or a more relaxed dining experience at our outdoor dining venue, Brighton Pointe.\nSport Membership\nSport Members enjoy unlimited access to golf in the off-season, and limited access to golf during peak season. Sport Members also have unlimited use of the driving range, practice area, fitness center, pool, and court sports – bocce, tennis and pickleball year-round. Sport Members can also enjoy an upscale dining experience in the Clubhouse or a more relaxed dining experience at our outdoor dining venue, Brighton Pointe.\nSocial Membership\nSocial Members enjoy access to fitness center, pool, and court sports – bocce, tennis and pickleball. Social Members\ncan also enjoy an upscale dining experience in the Clubhouse or a more relaxed dining experience at our outdoor dining venue, Brighton Pointe.\nMeet our Membership Director\nKelly Bowers\nDirector of Membership & Marketing\nKelly joined the Kensington Team in 2017 as the Event and Banquet Manager for the Club.  She has lived in Southwest Florida for over 35 years.  Kelly has a degree in Marketing from Florida State University.  Kelly’s career has been spent working in various Clubs and in different roles but Membership has become her passion. She enjoys meeting new people and the opportunity to help create lasting friendships.\nKelly can be reached at\n239-213-1983\nE-Mail\nExplore the opportunities and excitement that come with a membership at Kensington.\n1.Take a Tour and\nexplore Kensington\nTake a first-hand look at all the amenities, meet our team, and get a feel of our community.\n2. Choose a membership\nthat fits your lifestyle.\nOur membership director will help you find the right type of membership for you and get you integrated into our thriving community.\n3. Enjoy a club focused\naround you.\nImmerse yourself in the unparalleled amenities, indulge in our premier golf course, and experience the vibrant social life paired with our exquisite cuisine.\nSchedule a Tour",
      "emails": []
    },
    {
      "url": "https://kensingtoncc.com/dining/",
      "is_candidate": false,
      "has_email": false,
      "text": "Savor, Celebrate, Repeat:\nYour Kensington Dining Experience\nDiscover the Culinary Magic of Kensington Naples\nSignature Dish: Asian Shrimp Salad\nMemorable Moments, Every Meal\nAt Kensington, dining isn’t just a meal; it’s an experience. From our relaxed yet refined Kensington Dining Room to the casual elegance of the Mayfair Grill, each venue exudes its unique charm. For those seeking a picturesque outdoor setting, Brighton Pointe offers magnificent views down the 18th hole, the perfect backdrop for enjoying a drink, lunch, or dinner.\nThe Kensington dining experience goes beyond exceptional cuisine. It’s about creating lasting memories with fellow Members. Join us for exclusive wine dinners, theme-inspired dinner nights and even tribute band concerts. Our Welcome Back Celebration, Breakfast with the Bunny, Brunch with Santa and Derby Party are legendary events that bring our Kensington family closer together.\nThe creative menus, curated by Chef Ralph and his talented team, are designed to tantalize your taste buds. Each venue boasts panoramic views of the golf course, offering a visual feast that perfectly complements the culinary delights. Whether you’re enjoying the balcony on the main level or the covered terrace for outdoor dining, every meal at Kensington is a symphony of flavors, a celebration of community, and an experience you’ll cherish.\nImmerse yourself in the art of dining at Kensington, where every bite tells a story and every moment is a culinary masterpiece.\nCulinary Excellence Beyond Compare:\nMeet Chef Ralph\nWhen it comes to culinary excellence, Kensington stands as the epitome of gastronomic delight. Our award-winning Executive Chef, Ralph, has earned a place of honor in the culinary world, receiving the prestigious “Golden Toque” award. This coveted recognition, originally hailing from France, is a testament to Chef Ralph’s dedication, passion, and two decades of culinary expertise. Membership in this exclusive Order of the Golden Toque is reserved for the top one hundred lifetime members in the nation.\nExecutive Chef Ralph Feraco CEC, AAC the 2017 national winner of the Dr. L.J. Minor Chef Professionalism Award by the National Culinary Federation (ACF), exemplifies the highest standard of professionalism through certification, continuing education and training, culinary competitions, and community involvement. Feraco has been an ACF member for over 25 years, serving as president of the Caxambas Chapter of Naples and Marco Island from 2005 to 2009. In 2006, he was inducted into the American Academy of Chefs. He also is involved in the Naples Chaine de Rotisseurs.\nThroughout his career, Chef Feraco has earned a variety of culinary recognitions, including a gold medal at the 2008 and 2009 ACF Culinary Cups, gold and silver medals at the international Culinary Olympics, and Chef of the Year honors from the ACF Caxambas Chapter (2004) and Long Island Chapter (1995).\nChef Feraco also is actively involved in the local community. He serves as an advisory board member of the Greater Naples YMCA, Culinary & Hospitality Education Foundation, and Lorenzo Walker Technical College. As a local ACF chapter president, he established a student membership program. He also provides guidance to students preparing for competitions and presents at the Golden Gate High School Academy of Culinary Arts.\nExecutive Chef Ralph Feraco CEC, AAC\nSocial Connections at Kensington\nAt Kensington, the joy of dining extends beyond exquisite cuisine; it’s a gateway to a vibrant social tapestry. Our extensive social calendar, boasting more than 100 annual events, ensures that there’s always something extraordinary happening.\nIt’s all about the art of connection, where Members come together to forge new friendships and celebrate life. Our diverse Membership, including families, accomplished professionals, and community leaders, forms a tapestry of enriching experiences and cherished friendships. At Kensington, exclusivity is not in our vocabulary – everyone is welcomed with open arms.\nThese social bonds manifest in an array of interest-based groups that cater to all passions. Whether you’re a bookworm or a card enthusiast, an artist at heart or a wine connoisseur, there’s a place for you. Each year we strive to offer a variety of on and off campus events for our Members. Our Mens’ and Ladies’ Book Clubs, spirited Mah Jongg sessions, strategic Bridge groups, lively Canasta gatherings, Art Guild for the creative souls, Wine Club for oenophiles, and even cooking classes for aspiring chefs are just a glimpse of the rich tapestry of social activities.\nBut it doesn’t stop there; the spirit of competition and camaraderie shines through in games like Bocce and Pickleball, where every serve is a chance to make new memories. At Kensington, our social calendar is as diverse as our Members, and it’s the laughter, shared moments, and bonds formed over meals that make our community truly exceptional. Join us in celebrating the art of connection, where every dish is a chance to create lifelong memories.\nSchedule a Tour",
      "emails": []
    },
    {
      "url": "https://kensingtoncc.com/weddings-events/",
      "is_candidate": false,
      "has_email": true,
      "text": "Enjoy your Event.\nLeave the rest to us.\nNaples’ Premier Event Space for Weddings, Business Gatherings, Corporate Meetings, and more.\nSchedule a Consultation\nEnjoy your event\nwithout the stress\nYour vision,\nimpeccably executed\nCreate unforgettable\nmoments together\nSeamless Celebrations:\nExpert Event Management at Kensington\nPlanning a special event should be a joyous experience filled with excitement and anticipation. We understand that the intricacies of event coordination can often feel overwhelming, leaving you uncertain about where to begin. At Kensington, we have transformed hundreds of visions into reality, crafting unforgettable events that leave lasting memories.\nLet our dedicated on-site event planner guide you through every step of the process. From envisioning the perfect layout to orchestrating seamless logistics, our planner becomes your trusted partner, creating an event that reflects your unique style and vision.\nSchedule a Consultation\nElevate Your Occasion\nOn-Site Event Planner\nFlexible Indoor and Outdoor Spaces\nStunning Meeting Rooms\nIn-House Catering provided by Executive Chef Ralph Feraco\nInternet Access and AV Support\nYou Bring the Occasion, We Provide the Service\nBirthday Parties\nWeddings\nCelebrations of Life\nAnniversary Parties\nHoliday Parties\nQuinceanera\nBusiness Meetings\nSeminars\nLuncheons\nDinners\nWhere Elegance Meets Expertise\nExperience the perfect blend of elegance and expertise as we craft your event, leaving you with nothing but delightful memories\nWeddings\nImagine a wedding venue where dreams come true. Kensington Golf & Country Club provides an idyllic setting for your big day. Our professional team takes care of every aspect, leaving you free to relish the joyous moments. Walk down the aisle with confidence, knowing that our experienced staff has meticulously crafted an environment that embodies your love story.\nDownload Wedding Packages\nEvents\nAt Kensington, we offer a variety of event spaces that cater to your needs. Whether it’s an intimate gathering or a grand celebration, our venues provide an elegant backdrop that can be tailored to your vision. From refined interiors to picturesque outdoor settings, each space carries its own charm.\nDownload A la Carte Guide\nWe know you want your event to be a stress-free experience.\nWe take pride in transforming your event into a seamless and memorable occasion. Whether it’s a wedding, anniversary, corporate gala, or any other special milestone, our team dedicates themselves to curating an experience that exceeds expectations. From concept to execution, we ensure that every detail is executed flawlessly.\nSchedule a Consultation\nAt Kensington, we’ve helped hundreds of couples experience an unforgettable day to celebrate their love. As a\nCertified Wedding Venue\n, we have a knowledgeable wedding planner on-site that can handle all the details for you. Our award-winning chef and culinary team, along with our experienced staff, can tackle all the logistics, so you can focus on making memories.\nAmazing Wedding Venue and Team!\nThe entire staff at Kensington was amazing to work with throughout our wedding planning process! For context, our wedding was postponed due to Hurricane Ian and we needed to change venues without a ton of lead time, and Kensington made that process so seamless. Colby and everyone we encountered was so great to work with and they were flexible in our requests and truly went above and beyond to make sure our day was as special as it could be. The venue and grounds looks absolutely beautiful — we had ceremony + cocktail hour outside and went inside for reception and dancing. I was at first weary of an indoor ballroom wedding, but Colby and the rest of our vendor team worked tireless to truly transform the room and we could not be more thankful. My husband and I (and all of our guests!) had an amazing experience at Kensington and I would definitely, definitely recommend the venue to future couples!\nEmily G.\nMarried on 05/13/2023\nThe Most Outstanding Wedding Experience Ever\nFrom start to finish, Kensington was top notch. Colby Brooks was the best. Always responsive to our needs and went above and beyond the entire day.\nBill\nMarried on 04/22/2023\nThe perfect country club venue for a Naples wedding!\nMy husband and I got married at Kensington in February, and it was the perfect venue! Both their indoor and outdoor spaces are gorgeous, they have a very large bridal suite as well as groom’s suite…so there is plenty of space to get ready and/or take photos before the wedding and to safely store your stuff during the wedding/overnight. I had an outdoor ceremony on the courtyard, with my reception being indoors, but another great thing about Kensington is that they have a back-up indoor space in case of unfortunate weather…and it is still beautiful! Also, the food was delicious and the service was impeccable. Unlike some of the other country clubs in Naples that I had considered for a venue, the staff and the wedding coordinator at Kensington seem to actually value the weddings…rather than see them as a nuisance to the community. For this reason, they run everything like a well-oiled machine and have great procedures and well-trained staff prepared for anything and everything. Not only that, but – between how beautiful the grounds and the clubhouse spaces are, how great the food and service is, and the central location…the pricing is pretty unbeatable. There are many other country clubs in Naples that are not even as nice as Kensington (or are equally so) that charge way more for things that Kensington includes in their wedding packages. Rather than itemize every little item and service they make it very easy to choose your menu, and they include a lot of things in their wedding package pricing that other country clubs add additional fees for..that make their costs much higher for an experience that is not better. All of those factors made Kensington the obvious choice of venue for me, and I’m glad I chose it because everything went absolutely perfect! I cannot thank Colby, Kelly, and the entire staff there for everything they did to make my day perfect!\nJordan H.\nMarried on 02/18/2023\nMeet with our Events team\nLet’s meet and discuss your next event and special gathering. Fill out the form below and we will be in touch.\nName\n*\nPhone Number\n*\nE-mail Address\n*\nPreferred Method of Contact\n*\nE-Mail\nPhone\nDesired Event Date\n*\nEvent Type\n*\nWedding\nLuncheon\nBirthday\nAnniversary\nBusiness Dinner\nBaby Shower\nOther\nEstimated Attendance\n*\nAdditional Event Information\n0 / 400\nSend Message",
      "emails": [
        "john@doe.com"
      ]
    }
  ],
  "all_links": [
    "https://kensingtoncc.com/contact/",
    "https://kensingtoncc.com/press-release-renovation/",
    "https://kensingtoncc.com/cdn-cgi/l/email-protection#ea878f87888f989982839aaa818f849983848d9e85848989c4898587",
    "https://kensingtoncc.com/cdn-cgi/l/email-protection#e2a5afa289878c918b8c85968d8c8181cc818d8f",
    "https://kensingtoncc.com/wp-content/uploads/2023/09/Kensington-Naples-Staff-Mixing-Cocktail-before-Dinner@2x.jpg",
    "https://kensingtoncc.com/cdn-cgi/l/email-protection#0a7e6f646463797a78654a616f647963646d7e6564696924696567",
    "https://kensingtoncc.com/privacy-policy/",
    "https://kensingtoncc.com/cdn-cgi/l/email-protection#a5c4c1c8cccbe5cec0cbd6cccbc2d1cacbc6c68bc6cac8",
    "https://kensingtoncc.com/cdn-cgi/l/email-protection#0a474f47484f585942435a4a414f445943444d5e4544494924494547",
    "https://kensingtoncc.com/cdn-cgi/l/email-protection#0665696b6b73686f6567726f696875466d6368756f686172696865652865696b",
    "https://kensingtoncc.com/cdn-cgi/l/email-protection#fe98d8ddcecdc6c59c9a978c9b9d8a918cbe959b908d9790998a91909d9dd09d9193",
    "https://kensingtoncc.com/wp-content/uploads/2023/09/Kensington-Naples-Golf-Clocktower@2x.jpg",
    "https://kensingtoncc.com/careers/",
    "https://kensingtoncc.com/wp-content/uploads/2023/09/young-asian-children-tennis-player-on-outdoor-blue-court.jpg",
    "https://kensingtoncc.com/cdn-cgi/l/email-protection#064b434b444354554e4f56464d4348554f484152494845452845494b",
    "https://kensingtoncc.com/cdn-cgi/l/email-protection#187b707d7e6a7e58737d766b71767f6c77767b7b367b7775",
    "https://kensingtoncc.com/cdn-cgi/l/email-protection#16707f6278736565727f647375627964567d7378657f787162797875753875797b",
    "https://kensingtoncc.com/court-sports/bocce/",
    "https://kensingtoncc.com/management-team/",
    "https://kensingtoncc.com/court-sports/tennis/",
    "https://kensingtoncc.com/cdn-cgi/l/email-protection#3b767e76797e696873726b7b707e756872757c6f7475787815787476",
    "https://kensingtoncc.com/membership-types/",
    "https://kensingtoncc.com/wp-content/uploads/2025/07/KGCC-New-Pool-and-Umbrella-with-sunshine.jpg",
    "https://kensingtoncc.com/cdn-cgi/l/email-protection#ed808c84839988838c838e88ad8688839e84838a9982838e8ec38e8280",
    "https://kensingtoncc.com/cdn-cgi/l/email-protection#54303d263137203b263b32333b3832143f313a273d3a33203b3a37377a373b39",
    "https://kensingtoncc.com/cdn-cgi/l/email-protection#2a474f47484f585942435a6a414f445943444d5e4544494904494547",
    "https://kensingtoncc.com/",
    "https://kensingtoncc.com/robert-trent-jones-jr-golf-course/",
    "https://kensingtoncc.com/dining/",
    "https://kensingtoncc.com/schedule-a-tour/",
    "https://members.kensingtoncc.com/web/pages/login",
    "https://kensingtoncc.com/weddings-events/",
    "https://kensingtoncc.com/court-sports/",
    "https://kensingtoncc.com/cdn-cgi/l/email-protection#94f1e2f1fae0e7d4fff1fae7fdfaf3e0fbfaf7f7baf7fbf9",
    "https://kensingtoncc.com/fitness/",
    "https://kensingtoncc.com/robert-trent-jones-jr-golf-course/audubon-certification/",
    "https://kensingtoncc.com/cdn-cgi/l/email-protection#9be8eeebfee9dbf0fef5e8f2f5fceff4f5f8f8b5f8f4f6",
    "https://kensingtoncc.com/court-sports/pickleball/",
    "https://kensingtoncc.com/cdn-cgi/l/email-protection#dc9199919e998e8f94958c9c9799928f95929b8893929f9ff29f9391"
  ],
  "candidate_links": [
    "https://kensingtoncc.com/contact/",
    "https://kensingtoncc.com/management-team/",
    "https://kensingtoncc.com/membership-types/",
    "https://kensingtoncc.com/dining/",
    "https://kensingtoncc.com/weddings-events/"
  ],
  "visited": [
    "https://kensingtoncc.com/",
    "https://kensingtoncc.com/about",
    "https://kensingtoncc.com/contact",
    "https://kensingtoncc.com/staff",
    "https://kensingtoncc.com/team",
    "https://kensingtoncc.com/board",
    "https://kensingtoncc.com/directory",
    "https://kensingtoncc.com/events",
    "https://kensingtoncc.com/sitemap.xml",
    "https://kensingtoncc.com/council",
    "https://kensingtoncc.com/leadership",
    "https://kensingtoncc.com/management",
    "https://kensingtoncc.com/producers",
    "https://kensingtoncc.com/support",
    "https://kensingtoncc.com/crew",
    "https://kensingtoncc.com/members",
    "https://kensingtoncc.com/bios",
    "https://kensingtoncc.com/people",
    "https://kensingtoncc.com/artists",
    "https://kensingtoncc.com/musicians",
    "https://kensingtoncc.com/faculty",
    "https://kensingtoncc.com/administration",
    "https://kensingtoncc.com/contact/",
    "https://kensingtoncc.com/management-team/",
    "https://kensingtoncc.com/membership-types/",
    "https://kensingtoncc.com/dining/",
    "https://kensingtoncc.com/weddings-events/"
  ],
  "base_url": "https://kensingtoncc.com/"
}