{
  "pages": [
    {
      "url": "https://koabay.surf/about/",
      "is_candidate": false,
      "has_email": false,
      "text": "A community  unlike  any other\nIntentionally crafting a natural, honest and inclusive environment where visitors, residents, and professionals have fun, keep fit, and feel part of a community that shares their passion and respect for surfing, the ocean, people, and our planet.\nOUR PILLARS\nA natural, honest and inclusive environment where visitors, residents, and professionals have fun, keep fit, and feel part of a community that shares their passion and respect for surfing, the ocean, people, and our planet.\nWaves\nHundreds of perfect waves every hour. Anchored by the world’s most successful and sustainable man-made wave tech.\nResort\nA vibrant mix of residential, retail, and lodging options curated for leisure and living like nowhere else.\nLifestyle\nPromoting lifelong wellness and connection with others and nature, grounded in Blue zone principles.\nDiscover all that Koa Bay has to offer\n204 acres on\nFlorida’s Atlantic coast\n410,000 sf of\nretail and office\n1,104\nresidences\nAnchored by a\nWavegarden Cove\nTwo hotels\nwith 272 rooms\nUnlimited surf, healthy eating, functional training and yoga\nDiscover all that Koa Bay has to offer\n204 acres on\nFlorida’s Atlantic coast\n410,000 sf of\nretail and office\n1,104\nresidences\nAnchored by a\nWavegarden Cove\nTwo hotels\nwith 272 rooms\nUnlimited surf, healthy eating, functional training and yoga\nOUR TEAM\nChad LaBonte\nFounder & Co-Chief Executive Officer\nBryant Grigsby\nFounder & Co-Chief Executive Officer\nBrandon Ripley\nFounder & Chief Commercial Officer\nChad is a business leader and entrepreneur with over 30 years of experience in the real estate industry. He has developed deep expertise in land development, acquisitions and dispositions, property management, leasing, and the development of retail centers and large-scale master-planned communities. He also has extensive experience structuring financing—through both debt and equity—for the development and acquisition of commercial real estate assets.\nAs Managing Partner of Devcon Enterprises, Chad is currently spearheading the development of a 200-acre project in Fort Pierce, Florida, featuring residential units, commercial space, hotels, and a Wavegarden-powered surf lagoon. In addition to his real estate ventures, Chad has launched and invested in multiple start-up businesses across diverse sectors such as retail, fitness, hospitality, and real estate. These ventures have equipped him with a broad and deep understanding of business development, capitalization, and operational management. Driven by a passion for innovation and community impact, Chad brings a unique blend of strategic vision and hands-on experience to every endeavor he pursues.\nBryant is driven by a relentless curiosity and a passion for pushing boundaries in multiple arenas, from medtech to astronomy to outdoor adventure sports. Bryant continues to make a profound impact on the industries he serves, shaping the future of technology and inspiring others to embrace innovation, humanity, and the outdoors.\nAs an early adult, Bryant’s passion for outdoor adventure and exploration led him to the US Olympic Canoe and Kayak teams where he was the 1995 Olympic Fest C2 Team Champion. This love of the outdoors turned to a desire to share these types of experiences by co-founding Adrenaline Sports Resort (ASR) – an outdoor adventure park company. His love of outdoor adventure also led him to the University of California’s Lick Observatory, where he served as Staff Astronomer. This enthusiasm for astronomy materialized into 5 awards and 24 publications authored and co-authored by Bryant.\nAs an engineering leader, Bryant has held positions as Global Director at Align (the makers of Invisalign) and Director of Engineering for Oxford Instruments and has worked with several medtech and biotech startups. Bryant has been named on four patents and has won 5 awards for innovation, industrial design, and engineering.\nIn 2021, Bryant joined Phoenix DeVentures – a medical device development and manufacturing firm – where he quickly streamlined the engineering department and directed expansion into 2 new states. Bryant and his team are key spearheads in the effort to reduce cancer risk and environmental harm by introducing a safe and effective alternative to EtO sterilization. In March of 2025 Bryant successfully sold Phoenix DeVentures to Indo-MiM LDT and rebranded it PDV MedTech.\nBrandon is a seasoned business development executive with over 30 years of experience working with global brands and multinational corporations to identify unmet market needs and drive growth. He builds and leads multidisciplinary teams and forges strategic partnerships to enable successful market entry, revenue acceleration, and margin expansion. As Global Director, Brandon provided strategic direction and oversaw the expansion and commercialization of his department’s global supply chain services doubling YOY volumes and profit margins. Currently serving as Chief Commercial Officer of Waterbourne, he is responsible for site identification, business development, partnerships, programming, community relations, and government affairs at both the state and local levels. A lifelong outdoor enthusiast and waterman, Brandon immediately recognized the transformational potential of Olympic-standard, water-based adventure parks and has been a driving force in building Waterbourne’s world-class team of industry experts, shaping its business model, and cultivating a pipeline of development opportunities. Passionate about breaking down barriers to outdoor adventure, Brandon is committed to making high-quality outdoor experiences accessible to all.\nDavid Hepp\nChief Operating Officer\nJason Pouncy\nVice President of Business Development & Strategy\nStacey Hepp\nChief Marketing Officer\nDave\nis a seasoned operator and strategic thinker with over two decades of leadership in the paddlesports and outdoor recreation industries. A former 10-time U.S. National Team member and Olympic alternate in whitewater slalom (2000 & 2004), Dave has dedicated his career to advancing world-class whitewater experiences. He opened and led operations at the U.S. National Whitewater Center, served as VP of Riversport Rapids in Oklahoma City, and directed staffing and operations for Montgomery Whitewater. As the only person to open and operate the world’s three largest artificial whitewater parks, he has also consulted for the International Canoe Federation and Vector WERO Whitewater Park in New Zealand. In addition to his paddlesports leadership, Dave brings experience in real estate sales, site selection, and development in the Carolinas, specializing in industrial, multifamily, and retail properties. His entrepreneurial approach focuses on driving economic impact and community engagement through outdoor recreation and Olympic training sites.\nJason brings over 20 years of experience generating value for stakeholders through applied strategy and execution. He has a proven track record of navigating complex scenarios including managing private equity portfolio holdings, M&A, distress, and repositioning. Jason worked in the Turnaround Group at American Capital, a publicly traded private equity firm with $100B+  in assets under management, where he focused on building, funding, and executing plans to drive enterprise value for portfolio companies in challenging economic conditions. Prior to that, Jason was with Monitor Group’s MAST vertical, advising companies on carve-outs, war-game scenarios, and post-merger integrations. His clients ranged from energy firms like Ensco-Noble to biopharma leaders such as Roche-Genentech and multinationals like Franz Haniel & Cie. GmbH. He began his career at UBS Warburg’s Healthcare Investment Banking Group in Manhattan, executing financings and mergers in health care REITs, biotech, and managed care. Jason is an avid surfer, backcountry athlete, and a Winter Wildlands Alliance board member.\nStacey brings deep expertise in marketing, branding, and sales, with a proven track record of building and strengthening partnerships across the sports and entertainment industries. Her work has consistently focused on elevating local communities—from grassroots initiatives to the Olympic level. With past roles including Director of Sports Marketing and Events at the Orlando Conference Management Group, Managing Director of Marketing at USA Softball, and Marketing Director at USA Canoe and Kayak, Stacey offers a unique perspective and skill set that positions Waterbourne to seize transformative opportunities in the growing adventure park and experiential real estate sectors. Her ability to clearly articulate and champion innovative visions enables Waterbourne to craft compelling campaigns, uncover new partnerships, and expand brand presence through powerful storytelling. Stacey is also a strong believer in the role of social and corporate responsibility as a foundation of business success.\nChristian Cernich\nManager of Market Research & Development\nScott Shipley\nStrategic Advisor, Whitewater Venue Design & Athlete Experience\nGina Sanchez\nFinance Strategy Advisor\nChristian brings a unique combination of market research expertise, business development insight, and industry-specific knowledge to the surf park space. With five years of experience in sales, marketing, and lead generation in the home renovation sector, he transitioned into strategic consulting and founded Cernich Consulting to merge his passion for surfing with real estate development. A lifelong surfer, Christian has spent the past six years conducting global market research—visiting nearly every commercially viable surf park technology in the world to assess business models, financial performance, and long-term viability. Drawing on this first hand research, he has developed membership programs, pricing strategies, and revenue models tailored to the unique demands of surf parks. His data-driven insights have informed a comprehensive development approach that directly addresses one of the industry’s core challenges: achieving long-term profitability beyond stand-alone attractions.\nScott is an accomplished engineer and world-renowned athlete who has dedicated his career to creating whitewater recreation venues across the globe. His rare combination of expertise—as a former Olympic kayaker and a river engineer with over 20 years of experience—sets him apart in the industry.\nScott’s portfolio includes some of the most iconic whitewater parks in the world, such as the London Olympic Whitewater Park for the 2012 Games, the U.S. National Whitewater Center, and the 2028 Olympic venue at Oklahoma City’s Riversport Rapids. His designs have earned consistent acclaim for both their aesthetic appeal and functional excellence, receiving recognition in major publications like Time Magazine’s list of the World’s Best Places. His work has also received numerous engineering honors, including two 2024 ACEC Excellence Awards in Colorado and Alabama.\nBeyond engineering, Scott is a three-time Olympian and four-time whitewater world champion. His elite athletic background gives him a deep understanding of the needs of both recreational users and competitive athletes. This perspective has helped shape venues that serve millions of first-time paddlers while also hosting national and international competitions. His attention to user experience has produced parks that far exceed expectations—drawing elite athletes from around the world and inspiring millions to discover the thrill of whitewater.\nClick for more info »\nGina is a nationally recognized investment strategist with over two decades of experience in global markets, asset allocation, and financial strategy. She is the Founder and CEO of Chantico Global, a consulting firm with offices in Los Angeles and London that advises global pension funds, foundations, and family offices, as well as Chantico Technology, where she developed Caminos – a next-generation, web-based platform for investment management. As Chief Market Strategist at Lido Advisors and a longtime contributor to CNBC, Gina brings sharp market insight to institutions and individual investors alike. In recent year, she broadened her work to include ESG and other sustainable investment practices.\nEarlier in her career, she was Director of Equity and Asset Allocation at Roubini Global Economics and Co-Lead Portfolio Manager at American Century Investments, where she became the firm’s youngest-ever portfolio manager, overseeing more than $6.5 billion in assets.\nGina also previously led public investment portfolios at the Ford Foundation and The California Endowment. Gina is deeply engaged in volunteer leadership, serving on the board of Cedars-Sinai and as an advisory member to\nthe Public Company Accounting Oversight Board,\nUCLA Anderson School of Management, and the Hispanic Scholarship Fund.\nJonny Moran\nSenior Advisor, Experiential Development & IP Strategy\nKatharina Houser\nChief Financial Advisor\nEric Cernich\nReal Estate Development Advisor\nJonny Moran is a visionary leader in the theme park and live entertainment industry, known for creating world-class attractions and delivering significant business growth. With a career spanning investment banking to C-level leadership, Jonny brings a rare blend of creative vision, financial acumen, and operational excellence.\nHe played a pivotal role in developing some of the most iconic experiences in the sector, including Universal’s $500M\nWizarding World of Harry Potter\nand the €30M Ohana Hotel in Berlin. At Universal Studios Hollywood, his innovative approach to dynamic pricing doubled EBITDA, while his leadership of Universal’s IP licensing business delivered over 100% revenue growth in just two years.\nJonny has consistently pushed the boundaries of what’s possible in guest experiences—expanding Universal’s reach with new ventures like\nUniversal Horror Unleashed\nin Las Vegas, launching industry-defining events such as\nRunning Universal\n, and introducing transformative technology platforms to enhance operations and engagement.\nRecognized as one of the industry’s most influential executives, Jonny was named to the Blooloop 50 in 2023. He was also the youngest Vice President in Universal Parks’ corporate history and later served as a C-level executive at Parques Reunidos. He began his career at JPMorgan and holds an MBA from Harvard Business School.\nJonny’s passion lies in shaping immersive destinations that connect people, stories, and brands—transforming them into lasting cultural icons.\nKathy is a highly accomplished financial and operational executive with over 25 years of experience in real estate development, investment, and strategic planning. As Chief Financial Officer of The Robert Green Company, she directed financial operations for 40 entities, managing cash flow, risk, HR, IT, and investor relations for hospitality and mixed-use projects across the Western U.S. Katharina previously served as CFO for The Lansing Companies and Devcon Development, where she led financial strategy, structured complex investments, and supported large-scale land and commercial development initiatives. Her background also includes leadership roles in modular construction, insurance brokerage, and student housing, where she consistently delivered financial insight, operational efficiency, and regulatory compliance. Kathy is a licensed CPA and real estate broker and is known for driving results in fast-paced, evolving environments.\nEric Cernich is a seasoned real estate developer and serial entrepreneur with over 40 years of experience spanning construction, entitlements, acquisitions, and repositioning across all major asset classes.\nHe has successfully navigated multiple market cycles and led numerous ventures from concept through completion.\nAs Principal of Oxbow Partners, he leads a platform that has executed over $2.5 billion in investments across 15 states, with a focus on creatively transforming undervalued infill properties into high-performing assets. His entrepreneurial ventures include founding\nLongboard Magazine\n, operating an international surfboard blank manufacturing business, and leading a global hotel licensing initiative with Boardriders to develop Quiksilver-branded resorts. Previously named one of Orange County’s top homebuilders, Eric also serves as CFO of Peace Thru Surf, a nonprofit sharing the joy of surfing and ocean stewardship with underserved communities worldwide.\nEric’s career reflects decades of strategic leadership, hands-on execution, and entrepreneurial expertise across multiple industries.\nOri Vincente\nEngineering Strategy & Project Advisor\nOri is a seasoned engineering executive with over 18 years of experience leading high-value surf park and wave technology projects worldwide. He has led developments exceeding $130M, with a proven track record in feasibility, engineering, and execution. At Westlake International, he closed a $4.5 million wave tech contract in Brazil and reduced development costs by 35% through vendor optimization. As Senior Product Manager at the World Surf League, Ori led the design, construction, testing, and launch of groundbreaking man-made wave technology—overseeing product development, R&D, feasibility, and project management—while also cutting project costs by $15 million and boosting operational capacity by 50%. He has secured over $9.5 million in international sales and holds two patents in wave technology innovation. Over 12 years at WhiteWater, Ori held progressive roles in engineering, product development, and international business development—leading global teams and managing major installations across five continents. Ori combines deep technical expertise with strong business insight, making him a key asset for investors focused on scalable, de-risked surf park ventures.\nOUR TEAM\nChad LaBonte\nFounder & Co-Chief Executive Officer\nChad is a business leader and entrepreneur  with over 30 years of experience in the real estate industry. He has developed deep expertise in land development, acquisitions and dispositions, property management, leasing, and the development of retail centers and large-scale master-planned communities. He also has extensive experience structuring financing—through both debt and equity—for the development and acquisition of commercial real estate assets.\nAs Managing Partner of Devcon Enterprises, Chad is currently spearheading the development of a 200-acre project in Fort Pierce, Florida, featuring residential units, commercial space, hotels, and a Wavegarden-powered surf lagoon. In addition to his real estate ventures, Chad has launched and invested in multiple start-up businesses across diverse sectors such as retail, fitness, hospitality, and real estate. These ventures have equipped him with a broad and deep understanding of business development, capitalization, and operational management. Driven by a passion for innovation and community impact, Chad brings a unique blend of strategic vision and hands-on experience to every endeavor he pursues.\nBryant Grigsby\nFounder & Co-Chief Executive Officer\nBryant is driven by a relentless curiosity and a passion for pushing boundaries in multiple arenas, from medtech to astronomy to outdoor adventure sports. Bryant continues to make a profound impact on the industries he serves, shaping the future of technology and inspiring others to embrace innovation, humanity, and the outdoors.\nAs an early adult, Bryant’s passion for outdoor adventure and exploration led him to the US Olympic Canoe and Kayak teams where he was the 1995 Olympic Fest C2 Team Champion. This love of the outdoors turned to a desire to share these types of experiences by co-founding Adrenaline Sports Resort (ASR) – an outdoor adventure park company. His love of outdoor adventure also led him to the University of California’s Lick Observatory, where he served as Staff Astronomer. This enthusiasm for astronomy materialized into 5 awards and 24 publications authored and co-authored by Bryant.\nAs an engineering leader, Bryant has held positions as Global Director at Align (the makers of Invisalign) and Director of Engineering for Oxford Instruments and has worked with several medtech and biotech startups. Bryant has been named on four patents and has won 5 awards for innovation, industrial design, and engineering.\nIn 2021, Bryant joined Phoenix DeVentures – a medical device development and manufacturing firm – where he quickly streamlined the engineering department and directed expansion into 2 new states. Bryant and his team are key spearheads in the effort to reduce cancer risk and environmental harm by introducing a safe and effective alternative to EtO sterilization. In March of 2025 Bryant successfully sold Phoenix DeVentures to Indo-MiM LDT and rebranded it PDV MedTech.\nBrandon Ripley\nFounder & Chief Commercial Officer\nBrandon is a seasoned business development executive with over 30 years of experience working with global brands and multinational corporations to identify unmet market needs and drive growth. He builds and leads multidisciplinary teams and forges strategic partnerships to enable successful market entry, revenue acceleration, and margin expansion. As Global Director, Brandon provided strategic direction and oversaw the expansion and commercialization of his department’s global supply chain services doubling YOY volumes and profit margins. Currently serving as Chief Commercial Officer of Waterbourne, he is responsible for site identification, business development, partnerships, programming, community relations, and government affairs at both the state and local levels. A lifelong outdoor enthusiast and waterman, Brandon immediately recognized the transformational potential of Olympic-standard, water-based adventure parks and has been a driving force in building Waterbourne’s world-class team of industry experts, shaping its business model, and cultivating a pipeline of development opportunities. Passionate about breaking down barriers to outdoor adventure, Brandon is committed to making high-quality outdoor experiences accessible to all.\nDavid Hepp\nChief Operating Officer\nDave\nis a seasoned operator and strategic thinker with over two decades of leadership in the paddlesports and outdoor recreation industries. A former 10-time U.S. National Team member and Olympic alternate in whitewater slalom (2000 & 2004), Dave has dedicated his career to advancing world-class whitewater experiences. He opened and led operations at the U.S. National Whitewater Center, served as VP of Riversport Rapids in Oklahoma City, and directed staffing and operations for Montgomery Whitewater. As the only person to open and operate the world’s three largest artificial whitewater parks, he has also consulted for the International Canoe Federation and Vector WERO Whitewater Park in New Zealand. In addition to his paddlesports leadership, Dave brings experience in real estate sales, site selection, and development in the Carolinas, specializing in industrial, multifamily, and retail properties. His entrepreneurial approach focuses on driving economic impact and community engagement through outdoor recreation and Olympic training sites.\nJason Pouncy\nVice President of Business Development & Strategy\nJason brings over 20 years of experience generating value for stakeholders through applied strategy and execution. He has a proven track record of navigating complex scenarios including managing private equity portfolio holdings, M&A, distress, and repositioning. Jason worked in the Turnaround Group at American Capital, a publicly traded private equity firm with $100B+  in assets under management, where he focused on building, funding, and executing plans to drive enterprise value for portfolio companies in challenging economic conditions. Prior to that, Jason was with Monitor Group’s MAST vertical, advising companies on carve-outs, war-game scenarios, and post-merger integrations. His clients ranged from energy firms like Ensco-Noble to biopharma leaders such as Roche-Genentech and multinationals like Franz Haniel & Cie. GmbH. He began his career at UBS Warburg’s Healthcare Investment Banking Group in Manhattan, executing financings and mergers in health care REITs, biotech, and managed care. Jason is an avid surfer, backcountry athlete, and a Winter Wildlands Alliance board member.\nStacey Hepp\nChief Marketing Officer\nStacey brings deep expertise in marketing, branding, and sales, with a proven track record of building and strengthening partnerships across the sports and entertainment industries. Her work has consistently focused on elevating local communities—from grassroots initiatives to the Olympic level. With past roles including Director of Sports Marketing and Events at the Orlando Conference Management Group, Managing Director of Marketing at USA Softball, and Marketing Director at USA Canoe and Kayak, Stacey offers a unique perspective and skill set that positions Waterbourne to seize transformative opportunities in the growing adventure park and experiential real estate sectors. Her ability to clearly articulate and champion innovative visions enables Waterbourne to craft compelling campaigns, uncover new partnerships, and expand brand presence through powerful storytelling. Stacey is also a strong believer in the role of social and corporate responsibility as a foundation of business success.\nChristian Cernich\nManager of Market Research & Development\nChristian brings a unique combination of market research expertise, business development insight, and industry-specific knowledge to the surf park space. With five years of experience in sales, marketing, and lead generation in the home renovation sector, he transitioned into strategic consulting and founded Cernich Consulting to merge his passion for surfing with real estate development. A lifelong surfer, Christian has spent the past six years conducting global market research—visiting nearly every commercially viable surf park technology in the world to assess business models, financial performance, and long-term viability. Drawing on this first hand research, he has developed membership programs, pricing strategies, and revenue models tailored to the unique demands of surf parks. His data-driven insights have informed a comprehensive development approach that directly addresses one of the industry’s core challenges: achieving long-term profitability beyond stand-alone attractions.\nScott Shipley\nStrategic Advisor, Whitewater Venue Design & Athlete Experience\nScott is an accomplished engineer and world-renowned athlete who has dedicated his career to creating whitewater recreation venues across the globe. His rare combination of expertise—as a former Olympic kayaker and a river engineer with over 20 years of experience—sets him apart in the industry.\nScott’s portfolio includes some of the most iconic whitewater parks in the world, such as the London Olympic Whitewater Park for the 2012 Games, the U.S. National Whitewater Center, and the 2028 Olympic venue at Oklahoma City’s Riversport Rapids. His designs have earned consistent acclaim for both their aesthetic appeal and functional excellence, receiving recognition in major publications like Time Magazine’s list of the World’s Best Places. His work has also received numerous engineering honors, including two 2024 ACEC Excellence Awards in Colorado and Alabama.\nBeyond engineering, Scott is a three-time Olympian and four-time whitewater world champion. His elite athletic background gives him a deep understanding of the needs of both recreational users and competitive athletes. This perspective has helped shape venues that serve millions of first-time paddlers while also hosting national and international competitions. His attention to user experience has produced parks that far exceed expectations—drawing elite athletes from around the world and inspiring millions to discover the thrill of whitewater.\nClick for more info »\nGina Sanchez\nFinance Strategy Advisor\nGina is a nationally recognized investment strategist with over two decades of experience in global markets, asset allocation, and financial strategy. She is the Founder and CEO of Chantico Global, a consulting firm with offices in Los Angeles and London that advises global pension funds, foundations, and family offices, as well as Chantico Technology, where she developed Caminos – a next-generation, web-based platform for investment management. As Chief Market Strategist at Lido Advisors and a longtime contributor to CNBC, Gina brings sharp market insight to institutions and individual investors alike. In recent year, she broadened her work to include ESG and other sustainable investment practices.\nEarlier in her career, she was Director of Equity and Asset Allocation at Roubini Global Economics and Co-Lead Portfolio Manager at American Century Investments, where she became the firm’s youngest-ever portfolio manager, overseeing more than $6.5 billion in assets.\nGina also previously led public investment portfolios at the Ford Foundation and The California Endowment. Gina is deeply engaged in volunteer leadership, serving on the board of Cedars-Sinai and as an advisory member to\nthe Public Company Accounting Oversight Board,\nUCLA Anderson School of Management, and the Hispanic Scholarship Fund.\nJonny Moran\nSenior Advisor, Experiential Development & IP Strategy\nJonny Moran is a visionary leader in the theme park and live entertainment industry, known for creating world-class attractions and delivering significant business growth. With a career spanning investment banking to C-level leadership, Jonny brings a rare blend of creative vision, financial acumen, and operational excellence.\nHe played a pivotal role in developing some of the most iconic experiences in the sector, including Universal’s $500M\nWizarding World of Harry Potter\nand the €30M Ohana Hotel in Berlin. At Universal Studios Hollywood, his innovative approach to dynamic pricing doubled EBITDA, while his leadership of Universal’s IP licensing business delivered over 100% revenue growth in just two years.\nJonny has consistently pushed the boundaries of what’s possible in guest experiences—expanding Universal’s reach with new ventures like\nUniversal Horror Unleashed\nin Las Vegas, launching industry-defining events such as\nRunning Universal\n, and introducing transformative technology platforms to enhance operations and engagement.\nRecognized as one of the industry’s most influential executives, Jonny was named to the Blooloop 50 in 2023. He was also the youngest Vice President in Universal Parks’ corporate history and later served as a C-level executive at Parques Reunidos. He began his career at JPMorgan and holds an MBA from Harvard Business School.\nJonny’s passion lies in shaping immersive destinations that connect people, stories, and brands—transforming them into lasting cultural icons.\nKatharina Houser\nChief Financial Advisor\nKathy is a highly accomplished financial and operational executive with over 25 years of experience in real estate development, investment, and strategic planning. As Chief Financial Officer of The Robert Green Company, she directed financial operations for 40 entities, managing cash flow, risk, HR, IT, and investor relations for hospitality and mixed-use projects across the Western U.S. Katharina previously served as CFO for The Lansing Companies and Devcon Development, where she led financial strategy, structured complex investments, and supported large-scale land and commercial development initiatives. Her background also includes leadership roles in modular construction, insurance brokerage, and student housing, where she consistently delivered financial insight, operational efficiency, and regulatory compliance. Kathy is a licensed CPA and real estate broker and is known for driving results in fast-paced, evolving environments.\nEric Cernich\nReal Estate Development Advisor\nEric Cernich is a seasoned real estate developer and serial entrepreneur with over 40 years of experience spanning construction, entitlements, acquisitions, and repositioning across all major asset classes.\nHe has successfully navigated multiple market cycles and led numerous ventures from concept through completion.\nAs Principal of Oxbow Partners, he leads a platform that has executed over $2.5 billion in investments across 15 states, with a focus on creatively transforming undervalued infill properties into high-performing assets. His entrepreneurial ventures include founding\nLongboard Magazine\n, operating an international surfboard blank manufacturing business, and leading a global hotel licensing initiative with Boardriders to develop Quiksilver-branded resorts. Previously named one of Orange County’s top homebuilders, Eric also serves as CFO of Peace Thru Surf, a nonprofit sharing the joy of surfing and ocean stewardship with underserved communities worldwide.\nEric’s career reflects decades of strategic leadership, hands-on execution, and entrepreneurial expertise across multiple industries.\nOri Vincente\nEngineering Strategy & Project Advisor\nOri is a seasoned engineering executive with over 18 years of experience leading high-value surf park and wave technology projects worldwide. He has led developments exceeding $130M, with a proven track record in feasibility, engineering, and execution. At Westlake International, he closed a $4.5 million wave tech contract in Brazil and reduced development costs by 35% through vendor optimization. As Senior Product Manager at the World Surf League, Ori led the design, construction, testing, and launch of groundbreaking man-made wave technology—overseeing product development, R&D, feasibility, and project management—while also cutting project costs by $15 million and boosting operational capacity by 50%. He has secured over $9.5 million in international sales and holds two patents in wave technology innovation. Over 12 years at WhiteWater, Ori held progressive roles in engineering, product development, and international business development—leading global teams and managing major installations across five continents. Ori combines deep technical expertise with strong business insight, making him a key asset for investors focused on scalable, de-risked surf park ventures.\nOur Partners\nDevcon Enterprises\nWith 45 years of experience,\nDevcon Enterprises’\nroots are in the planning, construction and management of multi-family housing, retail and office properties. Over the last several years, Devcon has acquired, permitted, and sold thousands of acres in Florida, successfully obtaining entitlements for six master-planned communities. Devcon continues to be synonymous with integrity, quality and innovation.\nWavegarden\nWavegarden\nis a cutting-edge engineering company dedicated to the research, design, manufacture, installation and operation of world-class wave generating systems and surfing lagoons. For over a decade they have developed leading-edge wave technologies to create the most realistic surfing experience available outside of the ocean. Focusing on maximizing user experience and minimizing energy consumption, they have tested many different methods of producing waves, with the underlying aim of attaining the simplest, most efficient, most reliable technologies possible.\nWith 7 surf parks in operation (Aläia Bay-Switzerland, Wave Park-South Korea, Urbnsurf-Melbourne, The Wave-Bristol, Praia da Grama-Brazil, WG HQ-Spain, and Surf Snowdonia-Wales) and several other Wavegarden Coves in construction (Surfland-Brazil, The Wave-London, Dsrt Surf-Coachella, Urbnsurf-Sydney), and more than 30 projects in development across 5 continents in the coming years, Wavegarden is considered by discerning investors to be the market leader in the rapidly emerging sector of wave generation technology\nUNIT Surf Pool\nUNIT Surf Pool\noffers innovative artificial surf technology that creates an adjustable deepwater rapid wave in any environment, near or far from the ocean. The brand creates access to authentic surf experiences with a focus on sustainable and eco-friendly engineering and design.\nArquitectonica\nFounded in 1977,\nArquitectonicaGEO\ncontinues to push the limits of design with its innovative use of materials, geometry, pattern and color to introduce a new brand of humanistic modern design to the world.\nFetterhoff Company, Inc (FCI)\nFetterhoff Company\nis a professional consulting corporation specializing in construction project management, owner’s representation and research services. Fetterhoff Company was established in 1992 and has been engaged as design and construction managers on some of the most prominent commercial development projects around the world. Our success in delivering these one-of-a-kind marquee venues has provided our team with unmatched experience and knowledge on very large, challenging projects with short schedules and extremely high expectations. Our staff has management experience on hundreds of projects across the US and worldwide with a total project value exceeding $20 billion.\nArquitectonicaGEO\nDEAN MEAD\nBOHLER\nCAPTEC ENGINEERING Inc.\nEW CONSULTANTS Inc.\nO’ROURKE ENGINEERING & PLANNING\nANDERSEN ANDRE CONSULTING ENGINEERS, INC.\nCoastal Construction\nA Waterbourne Property\nWaterbourne was conceived by Devcon Enterprises and Adrenaline Sports Resorts. It is comprised of professionals with design, build and operating experience delivering large-scale, water-centric adventure parks. Waterbourne is focused on creating active communities centered around manmade waves and whitewater rapids and grounded in Blue Zone principles. Waterbourne’s dedication to delighting residents and guests with an unmatched experience positions each project for strong demand across demographics, interest in commercial spaces, and premiums for our residences.\nLive the Koa Bay Lifestyle.\nDiscover available residences leveraging surf as a central amenity\nExplore\nNews & Updates\nBREAKING GROUND ON THE LAKE AT KOA BAY: A new experience anchored in the world’s first floating surf pool\nBREAKING GROUND ON THE LAKE AT KOA BAY: A new experience anchored in the world’s first floating surf pool\nRead More\nMembership Deposits Are Now Being Accepted!\nMembership Deposits Are Now Being Accepted!\nRead More\nHAVE FURTHER QUESTIONS?\nFrequently Asked Questions\nBREAKING GROUND ON THE LAKE AT KOA BAY: A new experience anchored in the world’s first floating surf pool\nBREAKING GROUND ON THE LAKE AT KOA BAY: A new experience anchored in the world’s first floating surf pool\nRead More\nMembership Deposits Are Now Being Accepted!\nMembership Deposits Are Now Being Accepted!\nRead More\n\"\n*\n\" indicates required fields\nFirst Name\n*\nLast Name\n*\nEmail\n*\nI’m Interested in\n*\nPlease Select\nNews & Updates\nPurchasing a Home\nMedia Inquiries\nSurfing at Koa Bay\nInvestor Materials\nMailing List Consent\n*\nBy clicking \"Continue,\" I am consenting to receive email communications & updates from Koa Bay and future Waterbourne properties.\n*\nTerms of Use Consent\n*\nI agree to the\nTerms of Use\nand acknowledge that my information will be used as described in Koa Bay’s\nPrivacy Policy\n.\n*\nreCAPTCHA\nCompany\nThis field is for validation purposes and should be left unchanged.",
      "emails": []
    },
    {
      "url": "https://koabay.surf/contact/",
      "is_candidate": false,
      "has_email": false,
      "text": "Get in on the next golden age of surfing\n\"\n*\n\" indicates required fields\nFirst Name\n*\nLast Name\n*\nEmail\n*\nPhone\ninquiry type\n*\ninquiry type*\nGeneral Information\nSurf Club Membership\nMedia Inquiries\nRent a Home\nBuy a Home\nMessage\nMailing List Consent\nAdd me to the Koa Bay mailing list\nreCAPTCHA\nName\nThis field is for validation purposes and should be left unchanged.\nFREQUENTLY ASKED QUESTIONS\nHave a question about Koa Bay? Select a topic to explore frequently asked questions. If you can’t find the question or answer you’re looking for, please reach out.\nWhat is Koa Bay?\nKoa Bay is a residential community featuring a Wavegarden Cove surfing lagoon and is designed for families and individuals who seek an active lifestyle.\nWhere is Koa Bay?\nKoa Bay is located on Midway Road just off of I-95 on Florida’s Treasure Coast. Koa Bay enjoys year-round tropical temperatures and is within one hour of two major airports.\nAre membership deposits refundable?\nYes. You may request a refund for any reason and 100% of your deposit will be refunded to the original form of payment.\nDo you have to be a surfer to enjoy Koa Bay?\nAbsolutely not. Koa Bay was designed to support all types of residents. Our amenities and design will appeal to surfers and non-surfers alike. Many of our prospective members have one surfer in the family or kids who are interested in making surfing part of their lives.\nWhen will Koa Bay be ready for me to move in?\nWe are breaking ground at Koa Bay in October of 2024 and the first residences are estimated to be completed by the 4th quarter of 2026.\nWhat other benefits are there to becoming a member at Koa Bay?\nSee the\namenities section\n. Every day, we are adding more exciting features for our members.\nWhat forms of payment are accepted for deposits?\nWe accept ACH, credit, debit, or check payments. Our online payment portal allows for easy and secure transactions.\nCan I invest in Koa Bay without becoming a resident?\nYes. See our\nFounding Members\nsection for more information.\nCan I schedule a visit?\nYes. Use our contact form and a Koa Bay representative will call to arrange a visit.\nCan non-members surf at Koa Bay?\nYes. Koa Bay welcomes the public to surf at the facility. We offer a full line of\ndiscount packages\n, lessons, and camps.\nIs there any opportunity in the future to recoup the Initiation Fee if I move or no longer want to be a member?\nThe Membership Initiation Fee is fully refundable on a one in, one out basis.  So, when you want or need to resign you notify the Club in writing and the Club will refund your initiation fee when a new member is admitted.\nIf I’m a Surf Club Member is there an additional cost for surfing sessions?\nAs a Surf Club member there is no additional fee on top of the annual dues for surf sessions.\nWhat is the expected range for the annual dues?\nThe annual dues are based on the number of family members attributed to the Membership. First member: $7,000. Second member: $3,500. Subsequent members: $1,750. So, for a family of three the annual dues will be $12,500.\nAre the member benefits available to be shared with guests?\nYes, members can have guests at the resort who will receive a discounted guest price for the activities of their choosing. And, of course, share in the member’s other benefits like discounts on F&B and merchandise at the surf shop.\nCan member benefits be shared with guests even if the member is not present at the property?\nGuests will not have to be accompanied by the member but, unaccompanied guest visits will be limited and unaccompanied guest will not get certain benefits from the members perks like the ability to book surf sessions in advance, as an example.\nWhat percentage of the wave pool time will be provided to members vs non-members / general public?\nPart of a member’s package of benefits is advance booking of surf sessions and member only surf times. So, a sufficient percentage of surf time will always be available to members (and their guests). We anticipate that when the residence and memberships are fully subscribed there will be limited access for the general public unless you are a guest of the hotel.\nBesides unlimited surf sessions, what other activities are included with my Membership?\nMembers receive unlimited “beach access” which includes the PumpTrac Skate Park, the Free Solo Climbing Wall over water, beach volleyball and other games, the use of the UNIT Surf Pool and other activities on the Koa Bay lake.\nHow does the Full Residential Membership work?\nFull Residential Membership requires you to own a home in Koa Bay. However, if the Wavegarden Cove is operational before your home is ready for occupancy you can still surf when you want. The benefit of reserving a membership spot now is it grants you priority to choose your preferred home site and floor plan when they become available.\nThe initiation fee of $45,000 is a one-time fee that includes your household family members that want to surf. The initiation fee is returned if your family decides in the future to resign as a member of the surf club. For example, if you sell your home and move.\nThe annual dues that you will pay is based on the number of surfers you will have in your household. For the first surfer it is $7,000, the second surfer is $3,500 and subsequent surfers are $1,750 each. So, for a family with three surfers the annual dues will be $12,500. This grants you unlimited surf at the Wavegarden Cove and the UNIT Surf Pool in Koa Bay’s lake. Also, you and your family will have priority access to all the other activities offered at the Club including kayaking, SUP and E-Foil surfing on the lake, use of the SURFtracks surfpark, solo climbing over water, beach volleyball and more.\nAll details of the Full Residential Membership will be included in the forthcoming Membership Documents.\nHow does the Fractional Residential Membership work?\nThis is a shared ownership program that allows you and your family to purchase a 1/8th fraction of a resort residence at Koa Bay. (Note, you can purchase as many fractions as you want, up to 8). This grants you 40 days of use per year. While you are in residence you get unlimited surf sessions at the Wavegarden Cove and UNIT Surf Pool in Koa Bay’s lake. Also, you and your family will have priority access to all the other activities offered at the Club including kayaking, SUP and E-Foil surfing on the lake, use of the SURFtracks surfpark, solo climbing over water, beach volleyball and more.\nThe one-time initiation fee for a 1/8th Membership is $5,650. The annual dues for the first household surfer is $875, the second surfer is $438 and subsequent surfers are $219 each. So, for a family of three surfers the total annual dues will be $1,532.. The great thing about the resort residence is they will be surfside offering ‘surf in, surf out’ ability to the Wavegarden Cove.\nFractional Residence floor plans and pricing will be published soon. All details of the Fractional Residential Membership will be included in the forthcoming Membership Documents.\nInvestor FAQ\nWhat exactly am I investing in?\nYou are investing in Surf Koa Bay, LLC (SKB), the entity formed by the founders of Koa Bay to build, own, and operate the surf resort. SKB generates revenue from multiple sources, including:\nSurf sessions\nFood and beverage sales\nMembership dues\nRetail sales\nLake and other recreational activities\nA share of the hotel’s profits\nWhen you invest, you own Units of SKB and share in the profits from these revenue streams.\nWhat is a Founding Member?\nFounding Member is one of the first 100 investors in the surf resort at Koa Bay. As both an investor and a member of the Surf Club, you receive a unique combination of financial benefits (through your ownership in Surf Koa Bay, LLC) and exclusive membership perks (including priority access to surf sessions, special events, and more).\nDo I need to be an accredited investor?\nYes. All Founding Members must meet the requirements of an accredited investor as defined by the Securities and Exchange Commission (SEC).\nWhat is the minimum investment?\nThe minimum investment is $200,000.\nAs a Founding Member, are there any additional costs?\nNon-resident Founding Members: Pay discounted rates from 20-50% on surf sessions, food and beverage purchases, retail items, guest fees, and other services and optional amenities.\nResident Founding Members: If you own a residence at Koa Bay, you will pay annual Surf Club dues, which cover all surf sessions and grant you full membership privileges (see details below).\nIf I own a home at Koa Bay, what additional costs are there, if any?\nAnnual Surf Club Dues: Resident Founding Members pay annual dues based on the number of family members on the membership.\nFirst member: $7,000\nSecond member: $3,500\nEach additional member: $1,750\nFor example, a family of three would pay $12,500 per year. These dues include unlimited surf sessions and use of all other resort amenities.\n*Initiation Fee Waived: As a Founding Member, you do not pay the one-time Surf Club initiation fee.\nDoes the Founding Membership include my spouse?\nAs a Non-resident Founding Member your spouse and children under the age of 25 are included in your Founding Membership. However, all family members are subject to the same terms as the sponsoring Member.\nAs a Resident member you and your family are subject to paying annual dues (see details below).\nAre there any homeowner association (HOA) fees at Koa Bay?\nYes. If you own a home at Koa Bay, in addition to your Surf Club dues, there will be HOA fees to cover community-wide maintenance, security, and landscaping. Specific details and fee structures will be available in your homeowners’ documents when available.\nDo I have to own a home at Koa Bay to be a Founding Member?\nNo. You can become a Founding Member without purchasing real estate at Koa Bay. However, if you do decide to live in the community, Founding Members get priority when selecting homes and home sites.\nCan I use my home at Koa Bay for rental income?\nYes. However, there is a 30-day minimum on rentals. This policy helps maintain a healthy, close-knit community and ensures that all residents can fully enjoy the Koa Bay lifestyle without frequent turnover from short-term rentals.\nDoes Koa Bay have an Investor Relations (IR) function?\nYes. As a Founding Member, you will receive regular updates, news, and investor reports. Our investor relations professionals are also available to answer any questions you may have about your investment.\nWhat wave technology does Koa Bay use?\nWe will be utilizing state-of-the-art wave-generating technology from Wavegarden designed to produce consistent, high-quality waves suitable for every skill level—from beginners to seasoned surfers. The property also includes a UNIT Surf Pool floating in the community’s lake which creates world-class standing waves.\nWhen is Koa Bay scheduled to open?\nConstruction timelines can vary based on permitting and other factors. Some residential phases and the lake amenity, including the UNIT Surf Pool is anticipated to be available by the 4th quarter of 2025. We anticipate the Wavegarden surfing lagoon will open in mid to late 2027. Additional amenities and residential phases becoming available thereafter.\nIs Koa Bay open to the public or private for members only?\nKoa Bay is primarily a private community with membership-based access to the surf resort. However, in the early years of operations the resort will be open to the public until all the residence and surf club memberships are sold. After that certain amenities may be accessible to the public including select dining options, retail, spa and wellness offerings.  Founding Members, residents and their guests receive priority access and exclusive privileges.\nWho can I contact for more information or to schedule a visit?\nYou can reach our team by:\n- Chad LaBonte -\n[email protected]\nWe would be happy to discuss membership, investment details, or schedule a site tour.\nWhat if I need to transfer or sell my Membership?\nMembership transfers and sales are allowed however,  they are subject to certain terms and conditions outlined in the Membership Agreement. If you plan to sell or otherwise transfer your interest, please contact us so we can guide you through the appropriate process.\nWhy does Koa Bay utilize Wavegarden and UNIT Surf Pool technologies?\nEach technology provides a distinct surf experience—giving surfers options with respect to how that want to progress their craft. It allows for less crowding, more surfing, and therefore greater revenue generation.\nCan you tell me more about UNIT Surf?\nThere are 4 UNIT Surf Pools in operation worldwide, with 5 more in development. Standing waves are growing in popularity among surfers because of their consistency and ease of access. UNIT Surf Pool creates a focused environment for technical surf training and progression, making it an advantageous tool in Surf Park developments and complementary to larger traveling wave technologies. Learn more about UNIT at\nsurf-pool.com/surf-it\n.\nWhere can I learn more about Wavegarden?\nLearn more at\nwavegarden.com\n.\nCan I use the surf package I purchase for the UNIT Surf Pool and the Wavegarden Cove?\nYes. The Bronze, Silver, Gold, and Centennial surf packages can be used for surf sessions on the UNIT Surf Pool or the Wavegarden Cove.\nWhat are the home types and prices of the homes at Koa Bay?\nThere are a variety of proposed home types at Koa Bay. Including, 2 – 3 bedroom townhomes, 3 – 5 bedroom villas and estate homes, 2 – 3 bedroom condominium units in the lake front midrise buildings, and the surfside bungalows and resort residence. We do not have set prices yet for the homes but we anticipate starting prices will range from the low 400’s to the mid 900’s. Final floor plans and elevations will be published soon as well.\n\"\n*\n\" indicates required fields\nFirst Name\n*\nLast Name\n*\nEmail\n*\nPhone\ninquiry type\n*\ninquiry type*\nGeneral Information\nSurf Club Membership\nMedia Inquiries\nRent a Home\nBuy a Home\nMessage\nMailing List Consent\nAdd me to the Koa Bay mailing list\nreCAPTCHA\nName\nThis field is for validation purposes and should be left unchanged.\n\"\n*\n\" indicates required fields\nFirst Name\n*\nLast Name\n*\nEmail\n*\nI’m Interested in\n*\nPlease Select\nNews & Updates\nPurchasing a Home\nMedia Inquiries\nSurfing at Koa Bay\nInvestor Materials\nMailing List Consent\n*\nBy clicking \"Continue,\" I am consenting to receive email communications & updates from Koa Bay and future Waterbourne properties.\n*\nTerms of Use Consent\n*\nI agree to the\nTerms of Use\nand acknowledge that my information will be used as described in Koa Bay’s\nPrivacy Policy\n.\n*\nreCAPTCHA\nComments\nThis field is for validation purposes and should be left unchanged.",
      "emails": []
    }
  ],
  "all_links": [
    "https://koabay.surf/waves/",
    "https://koabay.surf/contact/#faq",
    "https://koabay.surf/lifestyle/#amenities",
    "https://koabay.surf/privacy-policy/#disclaimer",
    "https://koabay.surf/waves",
    "https://koabay.surf/resort",
    "https://koabay.surf/lifestyle",
    "https://koabay.surf/about/",
    "https://koabay.surf/privacy-policy",
    "https://koabay.surf/surfing-club/breaking-ground-on-the-lake-at-koa-bay-a-new-experience-anchored-in-the-worlds-first-floating-surf-pool/",
    "https://koabay.surf/invest/",
    "https://koabay.surf/privacy-policy/",
    "https://koabay.surf/cdn-cgi/l/email-protection#0f6c676e6b4f6b6a796c6061226a617b6a7d7f7d667c6a7c216c6062",
    "https://koabay.surf/surfing-club/membership-deposits-are-now-being-accepted/",
    "https://koabay.surf/resort/",
    "https://koabay.surf/contact/",
    "https://koabay.surf/",
    "https://koabay.surf/waves/#the-lake-at-koa-bay",
    "https://koabay.surf/lifestyle/"
  ],
  "candidate_links": [
    "https://koabay.surf/about/",
    "https://koabay.surf/contact/"
  ],
  "visited": [
    "https://koabay.surf/",
    "https://koabay.surf/about",
    "https://koabay.surf/contact",
    "https://koabay.surf/staff",
    "https://koabay.surf/team",
    "https://koabay.surf/board",
    "https://koabay.surf/directory",
    "https://koabay.surf/events",
    "https://koabay.surf/sitemap.xml",
    "https://koabay.surf/council",
    "https://koabay.surf/leadership",
    "https://koabay.surf/management",
    "https://koabay.surf/producers",
    "https://koabay.surf/support",
    "https://koabay.surf/crew",
    "https://koabay.surf/members",
    "https://koabay.surf/bios",
    "https://koabay.surf/people",
    "https://koabay.surf/artists",
    "https://koabay.surf/musicians",
    "https://koabay.surf/faculty",
    "https://koabay.surf/administration",
    "https://koabay.surf/about/",
    "https://koabay.surf/contact/"
  ],
  "base_url": "https://koabay.surf/"
}