{
  "pages": [
    {
      "url": "https://lakeside-inn.com/contact-us/",
      "is_candidate": false,
      "has_email": false,
      "text": "BACK TO LOCATION\nContact Us\nName\nEmail Address\nSubject\nMessage\nSEND\nCLICK MAP FOR DIRECTIONS",
      "emails": []
    },
    {
      "url": "https://lakeside-inn.com/about-us/",
      "is_candidate": false,
      "has_email": false,
      "text": "Lakeside Inn of Mount Dora – Florida’s Most Historic Hotel\nLakeside Inn 1906\nHistoric Timeline\nGrounds Map\nLocation\nContact Us\nLive Camera\nThe historic Lakeside Inn, located in the heart of the Mount Dora historic district, overlooking Lake Dora, opened in 1883, is the oldest continuously-operated hotel in the State of Florida.\nAs one passes through the stone entry gates one quickly enters an unique place, distinct from any other Florida destination. Viewing the beautifully landscaped grounds and the collection of cheery yellow and white buildings, all overlooking Lake Dora, one is aware instantly of the historic significance of this classic and lovely Inn.\nThe 141-year-old Lakeside Inn is not just another typical Florida hotel, it stands as a landmark to Florida tourism. Built in 1883, Lakeside Inn is the oldest continuously-operating hotel in the state of Florida. The Civil War had only ended eighteen years previously and the South was rebuilding. People of means were traveling once again and for those in the cold northern states, the lure of sunshine and warmer weather was as much of a draw then as it is today. It was the Victorian Era and leisure activities like bird watching, fishing, picnics and reading were all the rage. During this era, this Central Florida Lakes Region became an extremely popular destination and, thus, hotels and resorts began appearing in every town and around every lake. The first guests to travel to Lakeside Inn, then called the Alexander House, were true pioneers, since the typical journey from New York would take approximately a week. Most guests would arrive by lake steamer from Jacksonville through the Harris Chain of Lakes and the Dora Canal, as rail service to Mount Dora was still years away.\nThe Roaring 20’s saw Henry Flagler establish rail service down the entire east coast of Florida, all the way to Key West. Large, luxurious hotels were built and the allure of the Central Florida Lakes Region declined, so many hotels and resorts suffered. The Great Depression soon followed leading to the demise of still many more. Eventually, one-by-one, each met its own unique fate due to neglect, fires or redevelopment of the real estate. Lakeside Inn is the last remaining Victorian Era hotel still standing here in Central Florida.\nMany prominent and historic figures have appreciated the gracious comfort of Lakeside Inn over the years. After the completion of his presidency in 1929, President Calvin Coolidge and his wife Grace chose Lakeside Inn for a month-long vacation from the New England winter (January 11 – February 12, 1930) and remain, to this day, the most distinguished of the Inn’s guests. When not fishing, boating or picking local oranges, they relaxed on the grand verandah rocking chairs and watched stunning sunsets over Lake Dora as guests do today. Lakeside Inn was also the film set for the 1981 John Schlesinger movie,\nHonky Tonk Freeway\n.\nListed on the National Register of Historic Places, the venerable Lakeside Inn is the oldest continuously-operated hotel in the State of Florida. The Inn is privately-held and the current owners are committed to its restoration and preservation. Lakeside Inn currently features 90 comfortably-appointed guest rooms and suites, The Beauclaire and The Verandah for dining, Tremain’s Tavern with its weekly schedule of great entertainment and classic cocktail menu, the poolside Waterside Bar and The GateHouse, a shop featuring an enticing array of local art, crafts and select indigenous Central Florida gift items. Lakeside Inn also offers a variety of indoor function rooms and picturesque outdoor venues perfect for hosting a wide variety of social and business events.\nLakeside Inn Aerial Tour Video\nRestoration\nWork to fully restore and preserve Lakeside Inn began in January of 2011, when it was purchased by Jim and Alexandra Gunderson. After years of deferred attention, the historic Lakeside Inn was near the end. Work began immediately and has never stopped. We continue to make upgrades and improve upon the Inn we all love so much.\nWe invite and encourage you to come and enjoy the truly unique experience of staying in Florida’s Most Historic Hotel. The floors may creak, but you will also experience something uniquely real and indeed very special. Certainly a piece of Florida history that is well worth saving and preserving. We are committed to this effort and if you approve of what we are doing, we encourage you to become a “Friend of the Inn” and follow our progress through occasional visits and through our regular\nnewsletter\n.\nImage Gallery\nVisit Our Sister Property",
      "emails": []
    }
  ],
  "all_links": [
    "https://lakeside-inn.com/wp-content/uploads/2024/09/aerial-lake-2.jpg",
    "https://lakeside-inn.com/wp-content/uploads/2024/09/hotel-w-sidebldgs.jpg",
    "https://lakeside-inn.com/contact-us/",
    "https://lakeside-inn.com/wp-content/uploads/2024/09/lakeside-inn-dsc_6737.jpg",
    "https://lakeside-inn.com/wp-content/uploads/2024/09/pool02.jpg",
    "https://lakeside-inn.com/grounds-map/",
    "https://lakeside-inn.com/weddings/",
    "https://lakeside-inn.com/wp-content/uploads/2024/09/dsc_6742.jpg",
    "https://lakeside-inn.com/wp-content/uploads/2024/09/sunset-cottage.jpg",
    "https://lakeside-inn.com/location/",
    "https://lakeside-inn.com/wp-content/uploads/2024/09/dsc_6774.jpg",
    "https://lakeside-inn.com/meetings/",
    "https://lakeside-inn.com/wp-content/uploads/2024/09/dsc_6823.jpg",
    "https://lakeside-inn.com/wp-content/uploads/2024/09/beach-sunset.jpg",
    "https://lakeside-inn.com/the-gatehouse/",
    "https://lakeside-inn.com/wp-content/uploads/2024/09/pool03.jpg",
    "https://lakeside-inn.com/wp-content/uploads/2024/09/dsc_6740.jpg",
    "https://lakeside-inn.com/wp-content/uploads/2024/09/dsc_6739.jpg",
    "https://lakeside-inn.com/wp-content/uploads/2024/09/aerial1-2.jpg",
    "https://lakeside-inn.com/wp-content/uploads/2024/09/dsc_6769.jpg",
    "https://lakeside-inn.com/wp-content/uploads/2024/09/hotel-front-angle.jpg",
    "https://lakeside-inn.com/history/",
    "https://lakeside-inn.com/wp-content/uploads/2024/09/hotel-front-w-lawn.jpg",
    "https://lakeside-inn.com/accommodations-page/",
    "https://lakeside-inn.com/gallery/",
    "https://lakeside-inn.com/dining/",
    "https://lakeside-inn.com/wp-content/uploads/2024/09/hotel-front.jpg",
    "https://lakeside-inn.com/wp-content/uploads/2024/09/summer-sale-2.jpg",
    "https://lakeside-inn.com/blog/",
    "https://lakeside-inn.com/wp-content/uploads/2024/09/dsc_6915.jpg",
    "https://lakeside-inn.com/wp-content/uploads/2024/09/dsc_6783.jpg",
    "https://lakeside-inn.com/wp-content/uploads/2024/09/dsc_6832.jpg",
    "https://lakeside-inn.com/about-us/",
    "https://lakeside-inn.com/wp-content/uploads/2024/09/lakeside-lions.jpg",
    "https://lakeside-inn.com/wp-content/uploads/2024/09/dsc_6780.jpg",
    "https://lakeside-inn.com/wp-content/uploads/2024/09/dsc_6784.jpg",
    "https://lakeside-inn.com/",
    "https://lakeside-inn.com/wp-content/uploads/2024/09/aerial-docks.jpg",
    "https://lakeside-inn.com/wp-content/uploads/2024/09/dsc_6786.jpg",
    "https://lakeside-inn.com/live-cam/"
  ],
  "candidate_links": [
    "https://lakeside-inn.com/contact-us/",
    "https://lakeside-inn.com/about-us/"
  ],
  "visited": [
    "https://www.lakeside-inn.com/dining/tremain-s-tavern.html",
    "https://www.lakeside-inn.com/about",
    "https://www.lakeside-inn.com/contact",
    "https://www.lakeside-inn.com/staff",
    "https://www.lakeside-inn.com/team",
    "https://www.lakeside-inn.com/board",
    "https://www.lakeside-inn.com/directory",
    "https://www.lakeside-inn.com/events",
    "https://www.lakeside-inn.com/sitemap.xml",
    "https://www.lakeside-inn.com/council",
    "https://www.lakeside-inn.com/leadership",
    "https://www.lakeside-inn.com/management",
    "https://www.lakeside-inn.com/producers",
    "https://www.lakeside-inn.com/support",
    "https://www.lakeside-inn.com/crew",
    "https://www.lakeside-inn.com/members",
    "https://www.lakeside-inn.com/bios",
    "https://www.lakeside-inn.com/people",
    "https://www.lakeside-inn.com/artists",
    "https://www.lakeside-inn.com/musicians",
    "https://www.lakeside-inn.com/faculty",
    "https://www.lakeside-inn.com/administration",
    "https://lakeside-inn.com/contact-us/",
    "https://lakeside-inn.com/about-us/"
  ],
  "base_url": "https://www.lakeside-inn.com/dining/tremain-s-tavern.html"
}