{
  "pages": [
    {
      "url": "http://www.legacytheatrect.org/support-us",
      "is_candidate": false,
      "has_email": true,
      "text": "Anchoring the Arts — A Legacy of Impact\nYour support…\nEnsures live theatre remains accessible\nto all by keeping ticket prices affordable.\nEmpowers the next generation of artists\nthrough transformative arts education programs.\nChampions innovation in the arts\nby funding the creation of groundbreaking new works and visionary productions.\nExpands Legacy Theatre’s reach\nby fostering dynamic partnerships with renowned local and national arts organizations.\nThe Legacy Theatre Anchor Society is an exclusive group of generous supporters who ensure that theatre remains vibrant, accessible, and innovative.\nEnhance Your Experience\nAccess • Events • Perks\nLighthouse Level ($1,000–$2,499)\nListing in the Digital Program, Website, and Lobby Video Screen\nInvitations to Special Events\nInvitation to the Annual Anchor Society Celebration Dinner with the Executive Artistic Director\nBeacon Level ($2,500–$4,999)\nAll benefits from the Lighthouse Level\nA signed show playbill\nConstellation Level ($5,000–$9,999)\nAll benefits from the Beacon Level.\nName displayed on the Donor Wall in the lobby, showcasing key supporters.\nEarly access to Season Tickets\nNorth Star Level ($10,000–$24,999)\nAll benefits from the Constellation Level\nProducing Partner credit on a production of your choice\nCelestial Level ($25,000+)\nAll benefits from the North Star Level\nPrivate pre-show reception for the donor and guests (up to 6 people)\nClick here to Anchor the Arts with your gift\nAnchoring the Arts — A Legacy of Impact\nYour support…\nEnsures live theatre remains accessible\nto all by keeping ticket prices affordable.\nEmpowers the next generation of artists\nthrough transformative arts education programs.\nChampions innovation in the arts\nby funding the creation of groundbreaking new works and visionary productions.\nExpands Legacy Theatre’s reach\nby fostering dynamic partnerships with renowned local and national arts organizations.\nThe Legacy Theatre Anchor Society is an exclusive group of generous supporters who ensure that theatre remains vibrant, accessible, and innovative.\nEnhance Your Experience\nAccess • Events • Perks\nLighthouse Level ($1,000–$2,499)\nListing in the Digital Program, Website, and Lobby Video Screen\nInvitations to Special Events\nInvitation to the Annual Anchor Society Celebration Dinner with the Executive Artistic Director\nBeacon Level ($2,500–$4,999)\nAll benefits from the Lighthouse Level\nA signed show playbill\nConstellation Level ($5,000–$9,999)\nAll benefits from the Beacon Level.\nName displayed on the Donor Wall in the lobby, showcasing key supporters.\nEarly access to Season Tickets\nNorth Star Level ($10,000–$24,999)\nAll benefits from the Constellation Level\nProducing Partner credit on a production of your choice\nCelestial Level ($25,000+)\nAll benefits from the North Star Level\nPrivate pre-show reception for the donor and guests (up to 6 people)\nClick here to Anchor the Arts with your gift\nAnchoring the Arts — A Legacy of Impact\nYour support…\nEnsures live theatre remains accessible\nto all by keeping ticket prices affordable.\nEmpowers the next generation of artists\nthrough transformative arts education programs.\nChampions innovation in the arts\nby funding the creation of groundbreaking new works and visionary productions.\nExpands Legacy Theatre’s reach\nby fostering dynamic partnerships with renowned local and national arts organizations.\nThe Legacy Theatre Anchor Society is an exclusive group of generous supporters who ensure that theatre remains vibrant, accessible, and innovative.\nEnhance Your Experience\nAccess • Events • Perks\nLighthouse Level ($1,000–$2,499)\nListing in the Digital Program, Website, and Lobby Video Screen\nInvitations to Special Events\nInvitation to the Annual Anchor Society Celebration Dinner with the Executive Artistic Director\nBeacon Level ($2,500–$4,999)\nAll benefits from the Lighthouse Level\nA signed show playbill\nConstellation Level ($5,000–$9,999)\nAll benefits from the Beacon Level.\nName displayed on the Donor Wall in the lobby, showcasing key supporters.\nEarly access to Season Tickets\nNorth Star Level ($10,000–$24,999)\nAll benefits from the Constellation Level\nProducing Partner credit on a production of your choice\nCelestial Level ($25,000+)\nAll benefits from the North Star Level\nPrivate pre-show reception for the donor and guests (up to 6 people)\nClick here to Anchor the Arts with your gift\nBox Office: (203) 315-1901\nClick Here for Box Office Hours\nThe Legacy Theatre, Inc., 128 Thimble Islands Road, Branford, CT 06405\nEmail:\nInfo@LegacyTheatreCT.org\nSign Up for Legacy's Mailing List\nDonate Now!",
      "emails": [
        "info@legacytheatrect.org",
        "user@domain.com"
      ]
    },
    {
      "url": "http://www.legacytheatrect.org/about-1",
      "is_candidate": false,
      "has_email": true,
      "text": "Our Mission\nThe Legacy Theatre is a professional theater company that enhances the Connecticut Shoreline's quality of life by offering live theater, educational opportunities, and related programs for all.\nOur Vision\nLegacy Theatre envisions itself as a nationally-recognized cultural hub along the Connecticut Shoreline, uniting audiences through timeless classical works and fresh contemporary theatre. Legacy is dedicated to becoming a dynamic incubator of emerging works, nurturing the next generation of visionary theatre-makers and inspiring a lifelong love for the arts in audiences of all ages.\nOur Mission\nThe Legacy Theatre is a professional theater company that enhances the Connecticut Shoreline's quality of life by offering live theater, educational opportunities, and related programs for all.\nOur Vision\nLegacy Theatre envisions itself as a nationally-recognized cultural hub along the Connecticut Shoreline, uniting audiences through timeless classical works and fresh contemporary theatre. Legacy is dedicated to becoming a dynamic incubator of emerging works, nurturing the next generation of visionary theatre-makers and inspiring a lifelong love for the arts in audiences of all ages.\nOur Mission\nThe Legacy Theatre is a professional theater company that enhances the Connecticut Shoreline's quality of life by offering live theater, educational opportunities, and related programs for all.\nOur Vision\nLegacy Theatre envisions itself as a nationally-recognized cultural hub along the Connecticut Shoreline, uniting audiences through timeless classical works and fresh contemporary theatre. Legacy is dedicated to becoming a dynamic incubator of emerging works, nurturing the next generation of visionary theatre-makers and inspiring a lifelong love for the arts in audiences of all ages.\nBox Office: (203) 315-1901\nClick Here for Box Office Hours\nThe Legacy Theatre, Inc., 128 Thimble Islands Road, Branford, CT 06405\nEmail:\nInfo@LegacyTheatreCT.org\nSign Up for Legacy's Mailing List\nDonate Now!",
      "emails": [
        "info@legacytheatrect.org",
        "user@domain.com"
      ]
    },
    {
      "url": "http://www.legacytheatrect.org/team",
      "is_candidate": false,
      "has_email": true,
      "text": "Meet the Team\nLeadership\nKeely Baisden Knudsen\nExecutive\nArtistic Director and Co-Founder\nAn award winning director, Keely has performed, directed, and choreographed internationally in plays, musicals, operas, and dance companies in hundreds of theatrical productions and has performed in 48 of the United States and in the UK. Realizing her vision of a new theater company on the Connecticut Shoreline, Keely’s ideals of inspiring, inclusive work that uplifts the human spirit and connects communities formalized in the creation of the Legacy Theatre with Co-Founder Stephanie Stiefel Williams, a performing colleague and dear friend. Keely has directed, choreographed, and taught a myriad of performing arts courses at such institutions as Quinnipiac University, Yale University, Fairfield University, Hartt School of Drama, Southern Connecticut State University, Westminster College, and was the Director of Education of New Haven’s acclaimed Elm Shakespeare Company for several years. Additionally a composer/lyricist and playwright, she is a member of ASCAP and a writer/curator for Rewls Productions (www.rewlsproductions.us). Her directing has been heralded by the\nArts Paper\nas “…visually striking, emotionally moving” and “captivating” and of her direction of\nHamlet\nit was said, “Knudsen has made the notoriously difficult Shakespearean language accessible.” Her creation of the Wheel Life Theatre Troupe has been an especially rewarding program as she acts and directs with those who ambulate with crutches and wheelchairs. Her BFA is from New York University’s Tisch School of the Arts, at which she graduated first in the class, and she received her Masters Degree in Drama on full scholarship from The Royal Scottish Academy of Music and Drama in Glasgow. Keely, her husband Brian, and five children (Saviah, Liviana, Wynter, Emery, and Reeves) reside in Guilford, CT, where she thoroughly enjoys running the Legacy with a tremendous staff and community support.\nKeely@LegacyTheatreCT.org\nStephanie Stiefel Williams\nCo-Founder and Chair of the Board\nStephanie Stiefel Williams is an active and versatile performer in musicals, concerts, and plays and has appeared in numerous locations throughout the Northeast. A member of Actor’s Equity Association, she has appeared professionally in a variety of roles at venues such as Broadway’s Marriott Marquis, Legacy Theatre, Hartford Stage Company, Foxwoods’ Fox Theatre, Atlantic City’s Tropicana, Turning Stone Casino, and the Garde Arts Center. Among these roles, her favorites include Aldonza in\nMan of La Mancha\n, Anita in\nWest Side Story\n, Lola in\nDamn Yankees\n, Maria in\nThe Sound of Music\n, and Guenevere in\nCamelot\n. Although her professional focus has been in musical theatre, she also has been engaged frequently as a concert soloist, as well as an a cappella ensemble singer. Locally, Stephanie is a proud founder, repertory member, and trustee president at Legacy Theatre where she recently starred in the critically acclaimed productions of\nThe Musical of Musicals (the Musical!)\n,\nI Do! I Do!\n, and\nBarefoot in the Park\n. She also appeared as a featured vocalist in the wildly popular\nMack is Back!\n. In addition to her work with Legacy, Stephanie sits on the Performing Arts Advisory Council at the University of Notre Dame and has been a member of the Board of Trustees at the Goodspeed Opera House. She has become involved on a producing level with critically-acclaimed productions of\nGypsy\nand\nShowboat\nin London’s West End, the revival of\nSweeney Todd\nin New York, and Broadway’s\nEscape to Margaritaville\n. As a former Miss Connecticut, she represented our state at the Miss America Pageant in Atlantic City. She holds a Bachelor of Arts, magna cum laude, from Fairfield University and a Juris Doctorate with honors from the University of Connecticut School of Law. Stephanie is the proud mother of two adult children, Valerie and Rick, and lives in Guilford with her wonderful husband, Luke.\nStaff\nJeff Zeitlin\nManaging Director\nA long-time resident of Guilford, CT, Jeff’s love of theatre was taken to the next level in 2016 when his daughter joined the Guilford High School Theatre Arts program. Jeff served as a Board Member of the school’s Theatre Arts Parents Support. He then became the GHSTA Box Office Manager and Front of House Advisor for GHSTA students. He continues in that volunteer role today. Prior to joining Legacy Jeff was an usher at The Ivoryton Playhouse, as well as a House Manager at The Katherine Hepburn Cultural Arts Center (“The Kate”) in Old Saybrook. Upon learning of the development of The Legacy Theatre, he was taken by the plans for the historic building and the prospect of bringing high quality Broadway productions and performers to the shoreline in our intimate setting. He joined Legacy in 2021, prior to the start of our inaugural season. Jeff’s community involvement also extends to Guilford A Better Chance where he is a member of the Board of Directors, and as the Box Office partner for Guilford High School’s music department for their annual Holiday Concerts by the Green. In his Legacy role, Jeff loves to meet and greet patrons from nearby and far-away. From Jeff Z: “The complete theater experience starts when we welcome you to our theatre and doesn’t end until we have a chance to say thank you for coming and hope to see you again!”\nJeff@LegacyTheatreCT.org\nAnne Runolfsson\nDevelopment Director\nAnne Runolfsson has worked professionally in the theater for the past 40 years, a career path driven by passion and a fierce belief in the importance and value of the arts. Having spent much of her career onstage with starring roles on Broadway, off-Broadway, National Tours, Regional theaters, and as a soloist with symphony orchestras all over the world, she has also produced, written and directed for the theater. Fueled by a fervent desire to help secure funding opportunities for live theater, theater education and theater artists, Anne joined the Legacy Theatre part-time in the role of Development Manager in 2022. While serving in that position, which included the launching of the Annual Giving Society, overseeing the annual appeal (surpassing the annual fundraising goal), securing institutional giving, grant writing, major gift cultivation, donor stewardship, CRM management, and the planning and execution of all fundraising events, she realized that her passion had shifted from being onstage to one of raising money for the arts. Anne is greatly honored to serve in the role of Development Director for Legacy Theatre and would love to meet you and hear YOUR story of why the arts matter.\nAnne@LegacyTheatreCT.org\nColin Sheehan\nAssociate Artistic Director\nColin is the Arts, Culture & Special Events Coordinator for the Town of Branford,\nDirector of The Branford High School Performing Arts’ Spring Musical, and Co-Founder and Co-Artistic Director of\nShoreline Theatre Company. He graduated from Branford High School and continues his studies at Wagner College, receiving with a B.A. in Theatre and\nSpeech Performance. In 2003, he made his Broadway debut in the closing night production of\nLes Misérable\ns. Colin has appeared on television and has produced, directed, hosted and performed all over the country and at sea with The Broadway Cruise, Nickelodeon Cruise & R Family Vacations. He is a philanthropist and has raised funds and awareness for organizations in Branford and beyond. Colin is a former Branford Community Foundation Board Member, Beacon Award Winner, Broadway World CT Award Winning Director and Guncle to ClaireBear and Emma Kay! For more information, visit: ColinSheehanEvents.com.\nColin@LegacyTheatreCT.org\nMary Lee Weber\nCommunity & Employee Relations\nMary Lee Weber is a Marketing and Communications consultant who has lived in Branford since 1988. She held the position of Director of Marketing and Community Development for the ABC affiliate WTNH-8 for 17 years where she was responsible for non-traditional revenue and community partnerships. With a local creative team she Executive Produced a short documentary for the Stony Creek Museum called\nBorn at The Water’s Edge\n. It features interviews and information about the Thimble Islands and the history of Stony Creek including brief segments about Legacy Theatre, the Stony Creek Fife and Drum Corps and the Quarry. Mary Lee also helped with the Legacy Theatre productions while they were in residence at the Stony Creek Museum in 2018-19. She joined Legacy to help with Marketing and Community Outreach and is thrilled to play even a small part in helping Legacy bring theatre back to Stony Creek.\nMaryLee@LegacyTheatreCT.org\nLauren Salatto-Rosenay, Esq.\nSocial Media Manager\nLauren is excited to return “home” to the Legacy Theatre as its Social Media Manager. She rejoins the team after a brief hiatus to pursue her Juris Doctor degree and begin her career as an entertainment and intellectual property attorney at Bamert Regan PLLC, where she continues to practice. Lauren's deep roots in theater span a wide range of roles, such as work as an actor, director, designer, stage manager, playwright, and theater critic (Connecticut Critics Circle), including work Off-Broadway. Previously, she served as Legacy Theatre’s Company Manager during its inaugural season. Lauren has been involved in many Legacy Theatre productions throughout the years, including as a stage manager for numerous shows and as a performer in\nA Midsummer Night’s Dream\n, where she played Titania. Lauren also co-wrote\nJoan Joyce! The Musical\n, which premiered at Legacy Theatre in 2021 and played to consecutive sold-out shows.\nJoan Joyce! The Musical\nrecently had a successful second run at the Seven Angels Theatre in October 2023. Some of Lauren's favorite acting credits include Audrey in\nLittle Shop of Horrors\n, Matilde in\nThe Clean House\n(directed by Keely Baisden Knudsen), and the Baker’s Wife in\nInto the Woods\n. Lauren graduated from Quinnipiac University summa cum laude receiving the President’s Scholarship Award, double majoring in theater and communications. She also graduated from Albany Law School summa cum laude after completing a two-year accelerated program. Lauren is thrilled to be sharing Legacy Theatre’s wonderful lineup of performances, classes, and events with the community.\nLauren@LegacyTheatreCT.org\nElaine Cappiello\nDevelopment Associate\nElaine joins the Legacy Theatre team after being an active member of the Madison, CT community, where she volunteered in the schools for several years. Prior to moving to CT, Elaine worked at New York Public Library, both in their Theatre and Performing Arts Archive (TOFT) and Development and Government Affairs offices; as well as the Alumni Relations offices at Parsons School of Design and Columbia College at Columbia University. She earned a B.A. in English from Chatham University in Pittsburgh, PA, and attended the Arts Administration Program at the University of Akron in Akron, OH before moving to New York City. Elaine’s interests outside of Legacy Theatre include genetic genealogy and supporting her children in the various music programs at Daniel Hand High School and along the Shoreline.\nElaine@LegacyTheatreCT.org\nBoard of Trustees\nStephanie Williams,\nPresident\nJana Shea,\nVice President\nKatina Gionteris,\nSecretary\nLuke Williams,\nTreasurer\nToni Burt\nDamian Doria\nCharles Grady\nBrian Knudsen\nSonja LaBarbera\nMary Pepe\nJames Roday Rodriguez\nTom Shea\nKeely Baisden Knudsen,\nEx-Officio\nAdvisory Council\nBob and Maryann Babcock\nBetty Ann Donegan\nCarol and Tom Gagliardi\nMelodie Lane\nEunice Lasala\nBonnie and Andy McKirdy\nBob and Jeanette Mobeck\nGreg Nobile\nPatrick and Stacey Ruwe\nBarry and Patti Sinoway\nHal Spitzer\nMeet the Team\nLeadership\nKeely Baisden Knudsen\nExecutive\nArtistic Director and Co-Founder\nAn award winning director, Keely has performed, directed, and choreographed internationally in plays, musicals, operas, and dance companies in hundreds of theatrical productions and has performed in 48 of the United States and in the UK. Realizing her vision of a new theater company on the Connecticut Shoreline, Keely’s ideals of inspiring, inclusive work that uplifts the human spirit and connects communities formalized in the creation of the Legacy Theatre with Co-Founder Stephanie Stiefel Williams, a performing colleague and dear friend. Keely has directed, choreographed, and taught a myriad of performing arts courses at such institutions as Quinnipiac University, Yale University, Fairfield University, Hartt School of Drama, Southern Connecticut State University, Westminster College, and was the Director of Education of New Haven’s acclaimed Elm Shakespeare Company for several years. Additionally a composer/lyricist and playwright, she is a member of ASCAP and a writer/curator for Rewls Productions (www.rewlsproductions.us). Her directing has been heralded by the\nArts Paper\nas “…visually striking, emotionally moving” and “captivating” and of her direction of\nHamlet\nit was said, “Knudsen has made the notoriously difficult Shakespearean language accessible.” Her creation of the Wheel Life Theatre Troupe has been an especially rewarding program as she acts and directs with those who ambulate with crutches and wheelchairs. Her BFA is from New York University’s Tisch School of the Arts, at which she graduated first in the class, and she received her Masters Degree in Drama on full scholarship from The Royal Scottish Academy of Music and Drama in Glasgow. Keely, her husband Brian, and five children (Saviah, Liviana, Wynter, Emery, and Reeves) reside in Guilford, CT, where she thoroughly enjoys running the Legacy with a tremendous staff and community support.\nKeely@LegacyTheatreCT.org\nStephanie Stiefel Williams\nCo-Founder and Chair of the Board\nStephanie Stiefel Williams is an active and versatile performer in musicals, concerts, and plays and has appeared in numerous locations throughout the Northeast. A member of Actor’s Equity Association, she has appeared professionally in a variety of roles at venues such as Broadway’s Marriott Marquis, Legacy Theatre, Hartford Stage Company, Foxwoods’ Fox Theatre, Atlantic City’s Tropicana, Turning Stone Casino, and the Garde Arts Center. Among these roles, her favorites include Aldonza in\nMan of La Mancha\n, Anita in\nWest Side Story\n, Lola in\nDamn Yankees\n, Maria in\nThe Sound of Music\n, and Guenevere in\nCamelot\n. Although her professional focus has been in musical theatre, she also has been engaged frequently as a concert soloist, as well as an a cappella ensemble singer. Locally, Stephanie is a proud founder, repertory member, and trustee president at Legacy Theatre where she recently starred in the critically acclaimed productions of\nThe Musical of Musicals (the Musical!)\n,\nI Do! I Do!\n, and\nBarefoot in the Park\n. She also appeared as a featured vocalist in the wildly popular\nMack is Back!\n. In addition to her work with Legacy, Stephanie sits on the Performing Arts Advisory Council at the University of Notre Dame and has been a member of the Board of Trustees at the Goodspeed Opera House. She has become involved on a producing level with critically-acclaimed productions of\nGypsy\nand\nShowboat\nin London’s West End, the revival of\nSweeney Todd\nin New York, and Broadway’s\nEscape to Margaritaville\n. As a former Miss Connecticut, she represented our state at the Miss America Pageant in Atlantic City. She holds a Bachelor of Arts, magna cum laude, from Fairfield University and a Juris Doctorate with honors from the University of Connecticut School of Law. Stephanie is the proud mother of two adult children, Valerie and Rick, and lives in Guilford with her wonderful husband, Luke.\nStaff\nJeff Zeitlin\nManaging Director\nA long-time resident of Guilford, CT, Jeff’s love of theatre was taken to the next level in 2016 when his daughter joined the Guilford High School Theatre Arts program. Jeff served as a Board Member of the school’s Theatre Arts Parents Support. He then became the GHSTA Box Office Manager and Front of House Advisor for GHSTA students. He continues in that volunteer role today. Prior to joining Legacy Jeff was an usher at The Ivoryton Playhouse, as well as a House Manager at The Katherine Hepburn Cultural Arts Center (“The Kate”) in Old Saybrook. Upon learning of the development of The Legacy Theatre, he was taken by the plans for the historic building and the prospect of bringing high quality Broadway productions and performers to the shoreline in our intimate setting. He joined Legacy in 2021, prior to the start of our inaugural season. Jeff’s community involvement also extends to Guilford A Better Chance where he is a member of the Board of Directors, and as the Box Office partner for Guilford High School’s music department for their annual Holiday Concerts by the Green. In his Legacy role, Jeff loves to meet and greet patrons from nearby and far-away. From Jeff Z: “The complete theater experience starts when we welcome you to our theatre and doesn’t end until we have a chance to say thank you for coming and hope to see you again!”\nJeff@LegacyTheatreCT.org\nAnne Runolfsson\nDevelopment Director\nAnne Runolfsson has worked professionally in the theater for the past 40 years, a career path driven by passion and a fierce belief in the importance and value of the arts. Having spent much of her career onstage with starring roles on Broadway, off-Broadway, National Tours, Regional theaters, and as a soloist with symphony orchestras all over the world, she has also produced, written and directed for the theater. Fueled by a fervent desire to help secure funding opportunities for live theater, theater education and theater artists, Anne joined the Legacy Theatre part-time in the role of Development Manager in 2022. While serving in that position, which included the launching of the Annual Giving Society, overseeing the annual appeal (surpassing the annual fundraising goal), securing institutional giving, grant writing, major gift cultivation, donor stewardship, CRM management, and the planning and execution of all fundraising events, she realized that her passion had shifted from being onstage to one of raising money for the arts. Anne is greatly honored to serve in the role of Development Director for Legacy Theatre and would love to meet you and hear YOUR story of why the arts matter.\nAnne@LegacyTheatreCT.org\nColin Sheehan\nAssociate Artistic Director\nColin is the Arts, Culture & Special Events Coordinator for the Town of Branford,\nDirector of The Branford High School Performing Arts’ Spring Musical, and Co-Founder and Co-Artistic Director of\nShoreline Theatre Company. He graduated from Branford High School and continues his studies at Wagner College, receiving with a B.A. in Theatre and\nSpeech Performance. In 2003, he made his Broadway debut in the closing night production of\nLes Misérable\ns. Colin has appeared on television and has produced, directed, hosted and performed all over the country and at sea with The Broadway Cruise, Nickelodeon Cruise & R Family Vacations. He is a philanthropist and has raised funds and awareness for organizations in Branford and beyond. Colin is a former Branford Community Foundation Board Member, Beacon Award Winner, Broadway World CT Award Winning Director and Guncle to ClaireBear and Emma Kay! For more information, visit: ColinSheehanEvents.com.\nColin@LegacyTheatreCT.org\nMary Lee Weber\nCommunity & Employee Relations\nMary Lee Weber is a Marketing and Communications consultant who has lived in Branford since 1988. She held the position of Director of Marketing and Community Development for the ABC affiliate WTNH-8 for 17 years where she was responsible for non-traditional revenue and community partnerships. With a local creative team she Executive Produced a short documentary for the Stony Creek Museum called\nBorn at The Water’s Edge\n. It features interviews and information about the Thimble Islands and the history of Stony Creek including brief segments about Legacy Theatre, the Stony Creek Fife and Drum Corps and the Quarry. Mary Lee also helped with the Legacy Theatre productions while they were in residence at the Stony Creek Museum in 2018-19. She joined Legacy to help with Marketing and Community Outreach and is thrilled to play even a small part in helping Legacy bring theatre back to Stony Creek.\nMaryLee@LegacyTheatreCT.org\nLauren Salatto-Rosenay, Esq.\nSocial Media Manager\nLauren is excited to return “home” to the Legacy Theatre as its Social Media Manager. She rejoins the team after a brief hiatus to pursue her Juris Doctor degree and begin her career as an entertainment and intellectual property attorney at Bamert Regan PLLC, where she continues to practice. Lauren's deep roots in theater span a wide range of roles, such as work as an actor, director, designer, stage manager, playwright, and theater critic (Connecticut Critics Circle), including work Off-Broadway. Previously, she served as Legacy Theatre’s Company Manager during its inaugural season. Lauren has been involved in many Legacy Theatre productions throughout the years, including as a stage manager for numerous shows and as a performer in\nA Midsummer Night’s Dream\n, where she played Titania. Lauren also co-wrote\nJoan Joyce! The Musical\n, which premiered at Legacy Theatre in 2021 and played to consecutive sold-out shows.\nJoan Joyce! The Musical\nrecently had a successful second run at the Seven Angels Theatre in October 2023. Some of Lauren's favorite acting credits include Audrey in\nLittle Shop of Horrors\n, Matilde in\nThe Clean House\n(directed by Keely Baisden Knudsen), and the Baker’s Wife in\nInto the Woods\n. Lauren graduated from Quinnipiac University summa cum laude receiving the President’s Scholarship Award, double majoring in theater and communications. She also graduated from Albany Law School summa cum laude after completing a two-year accelerated program. Lauren is thrilled to be sharing Legacy Theatre’s wonderful lineup of performances, classes, and events with the community.\nLauren@LegacyTheatreCT.org\nElaine Cappiello\nDevelopment Associate\nElaine joins the Legacy Theatre team after being an active member of the Madison, CT community, where she volunteered in the schools for several years. Prior to moving to CT, Elaine worked at New York Public Library, both in their Theatre and Performing Arts Archive (TOFT) and Development and Government Affairs offices; as well as the Alumni Relations offices at Parsons School of Design and Columbia College at Columbia University. She earned a B.A. in English from Chatham University in Pittsburgh, PA, and attended the Arts Administration Program at the University of Akron in Akron, OH before moving to New York City. Elaine’s interests outside of Legacy Theatre include genetic genealogy and supporting her children in the various music programs at Daniel Hand High School and along the Shoreline.\nElaine@LegacyTheatreCT.org\nBoard of Trustees\nStephanie Williams,\nPresident\nJana Shea,\nVice President\nKatina Gionteris,\nSecretary\nLuke Williams,\nTreasurer\nToni Burt\nDamian Doria\nCharles Grady\nBrian Knudsen\nSonja LaBarbera\nMary Pepe\nJames Roday Rodriguez\nTom Shea\nKeely Baisden Knudsen,\nEx-Officio\nAdvisory Council\nBob and Maryann Babcock\nBetty Ann Donegan\nCarol and Tom Gagliardi\nMelodie Lane\nEunice Lasala\nBonnie and Andy McKirdy\nBob and Jeanette Mobeck\nGreg Nobile\nPatrick and Stacey Ruwe\nBarry and Patti Sinoway\nHal Spitzer\nMeet the Team\nLeadership\nKeely Baisden Knudsen\nExecutive\nArtistic Director and Co-Founder\nAn award winning director, Keely has performed, directed, and choreographed internationally in plays, musicals, operas, and dance companies in hundreds of theatrical productions and has performed in 48 of the United States and in the UK. Realizing her vision of a new theater company on the Connecticut Shoreline, Keely’s ideals of inspiring, inclusive work that uplifts the human spirit and connects communities formalized in the creation of the Legacy Theatre with Co-Founder Stephanie Stiefel Williams, a performing colleague and dear friend. Keely has directed, choreographed, and taught a myriad of performing arts courses at such institutions as Quinnipiac University, Yale University, Fairfield University, Hartt School of Drama, Southern Connecticut State University, Westminster College, and was the Director of Education of New Haven’s acclaimed Elm Shakespeare Company for several years. Additionally a composer/lyricist and playwright, she is a member of ASCAP and a writer/curator for Rewls Productions (www.rewlsproductions.us). Her directing has been heralded by the\nArts Paper\nas “…visually striking, emotionally moving” and “captivating” and of her direction of\nHamlet\nit was said, “Knudsen has made the notoriously difficult Shakespearean language accessible.” Her creation of the Wheel Life Theatre Troupe has been an especially rewarding program as she acts and directs with those who ambulate with crutches and wheelchairs. Her BFA is from New York University’s Tisch School of the Arts, at which she graduated first in the class, and she received her Masters Degree in Drama on full scholarship from The Royal Scottish Academy of Music and Drama in Glasgow. Keely, her husband Brian, and five children (Saviah, Liviana, Wynter, Emery, and Reeves) reside in Guilford, CT, where she thoroughly enjoys running the Legacy with a tremendous staff and community support.\nKeely@LegacyTheatreCT.org\nStephanie Stiefel Williams\nCo-Founder and Chair of the Board\nStephanie Stiefel Williams is an active and versatile performer in musicals, concerts, and plays and has appeared in numerous locations throughout the Northeast. A member of Actor’s Equity Association, she has appeared professionally in a variety of roles at venues such as Broadway’s Marriott Marquis, Legacy Theatre, Hartford Stage Company, Foxwoods’ Fox Theatre, Atlantic City’s Tropicana, Turning Stone Casino, and the Garde Arts Center. Among these roles, her favorites include Aldonza in\nMan of La Mancha\n, Anita in\nWest Side Story\n, Lola in\nDamn Yankees\n, Maria in\nThe Sound of Music\n, and Guenevere in\nCamelot\n. Although her professional focus has been in musical theatre, she also has been engaged frequently as a concert soloist, as well as an a cappella ensemble singer. Locally, Stephanie is a proud founder, repertory member, and trustee president at Legacy Theatre where she recently starred in the critically acclaimed productions of\nThe Musical of Musicals (the Musical!)\n,\nI Do! I Do!\n, and\nBarefoot in the Park\n. She also appeared as a featured vocalist in the wildly popular\nMack is Back!\n. In addition to her work with Legacy, Stephanie sits on the Performing Arts Advisory Council at the University of Notre Dame and has been a member of the Board of Trustees at the Goodspeed Opera House. She has become involved on a producing level with critically-acclaimed productions of\nGypsy\nand\nShowboat\nin London’s West End, the revival of\nSweeney Todd\nin New York, and Broadway’s\nEscape to Margaritaville\n. As a former Miss Connecticut, she represented our state at the Miss America Pageant in Atlantic City. She holds a Bachelor of Arts, magna cum laude, from Fairfield University and a Juris Doctorate with honors from the University of Connecticut School of Law. Stephanie is the proud mother of two adult children, Valerie and Rick, and lives in Guilford with her wonderful husband, Luke.\nStaff\nJeff Zeitlin\nManaging Director\nA long-time resident of Guilford, CT, Jeff’s love of theatre was taken to the next level in 2016 when his daughter joined the Guilford High School Theatre Arts program. Jeff served as a Board Member of the school’s Theatre Arts Parents Support. He then became the GHSTA Box Office Manager and Front of House Advisor for GHSTA students. He continues in that volunteer role today. Prior to joining Legacy Jeff was an usher at The Ivoryton Playhouse, as well as a House Manager at The Katherine Hepburn Cultural Arts Center (“The Kate”) in Old Saybrook. Upon learning of the development of The Legacy Theatre, he was taken by the plans for the historic building and the prospect of bringing high quality Broadway productions and performers to the shoreline in our intimate setting. He joined Legacy in 2021, prior to the start of our inaugural season. Jeff’s community involvement also extends to Guilford A Better Chance where he is a member of the Board of Directors, and as the Box Office partner for Guilford High School’s music department for their annual Holiday Concerts by the Green. In his Legacy role, Jeff loves to meet and greet patrons from nearby and far-away. From Jeff Z: “The complete theater experience starts when we welcome you to our theatre and doesn’t end until we have a chance to say thank you for coming and hope to see you again!”\nJeff@LegacyTheatreCT.org\nAnne Runolfsson\nDevelopment Director\nAnne Runolfsson has worked professionally in the theater for the past 40 years, a career path driven by passion and a fierce belief in the importance and value of the arts. Having spent much of her career onstage with starring roles on Broadway, off-Broadway, National Tours, Regional theaters, and as a soloist with symphony orchestras all over the world, she has also produced, written and directed for the theater. Fueled by a fervent desire to help secure funding opportunities for live theater, theater education and theater artists, Anne joined the Legacy Theatre part-time in the role of Development Manager in 2022. While serving in that position, which included the launching of the Annual Giving Society, overseeing the annual appeal (surpassing the annual fundraising goal), securing institutional giving, grant writing, major gift cultivation, donor stewardship, CRM management, and the planning and execution of all fundraising events, she realized that her passion had shifted from being onstage to one of raising money for the arts. Anne is greatly honored to serve in the role of Development Director for Legacy Theatre and would love to meet you and hear YOUR story of why the arts matter.\nAnne@LegacyTheatreCT.org\nColin Sheehan\nAssociate Artistic Director\nColin is the Arts, Culture & Special Events Coordinator for the Town of Branford,\nDirector of The Branford High School Performing Arts’ Spring Musical, and Co-Founder and Co-Artistic Director of\nShoreline Theatre Company. He graduated from Branford High School and continues his studies at Wagner College, receiving with a B.A. in Theatre and\nSpeech Performance. In 2003, he made his Broadway debut in the closing night production of\nLes Misérable\ns. Colin has appeared on television and has produced, directed, hosted and performed all over the country and at sea with The Broadway Cruise, Nickelodeon Cruise & R Family Vacations. He is a philanthropist and has raised funds and awareness for organizations in Branford and beyond. Colin is a former Branford Community Foundation Board Member, Beacon Award Winner, Broadway World CT Award Winning Director and Guncle to ClaireBear and Emma Kay! For more information, visit: ColinSheehanEvents.com.\nColin@LegacyTheatreCT.org\nMary Lee Weber\nCommunity & Employee Relations\nMary Lee Weber is a Marketing and Communications consultant who has lived in Branford since 1988. She held the position of Director of Marketing and Community Development for the ABC affiliate WTNH-8 for 17 years where she was responsible for non-traditional revenue and community partnerships. With a local creative team she Executive Produced a short documentary for the Stony Creek Museum called\nBorn at The Water’s Edge\n. It features interviews and information about the Thimble Islands and the history of Stony Creek including brief segments about Legacy Theatre, the Stony Creek Fife and Drum Corps and the Quarry. Mary Lee also helped with the Legacy Theatre productions while they were in residence at the Stony Creek Museum in 2018-19. She joined Legacy to help with Marketing and Community Outreach and is thrilled to play even a small part in helping Legacy bring theatre back to Stony Creek.\nMaryLee@LegacyTheatreCT.org\nLauren Salatto-Rosenay, Esq.\nSocial Media Manager\nLauren is excited to return “home” to the Legacy Theatre as its Social Media Manager. She rejoins the team after a brief hiatus to pursue her Juris Doctor degree and begin her career as an entertainment and intellectual property attorney at Bamert Regan PLLC, where she continues to practice. Lauren's deep roots in theater span a wide range of roles, such as work as an actor, director, designer, stage manager, playwright, and theater critic (Connecticut Critics Circle), including work Off-Broadway. Previously, she served as Legacy Theatre’s Company Manager during its inaugural season. Lauren has been involved in many Legacy Theatre productions throughout the years, including as a stage manager for numerous shows and as a performer in\nA Midsummer Night’s Dream\n, where she played Titania. Lauren also co-wrote\nJoan Joyce! The Musical\n, which premiered at Legacy Theatre in 2021 and played to consecutive sold-out shows.\nJoan Joyce! The Musical\nrecently had a successful second run at the Seven Angels Theatre in October 2023. Some of Lauren's favorite acting credits include Audrey in\nLittle Shop of Horrors\n, Matilde in\nThe Clean House\n(directed by Keely Baisden Knudsen), and the Baker’s Wife in\nInto the Woods\n. Lauren graduated from Quinnipiac University summa cum laude receiving the President’s Scholarship Award, double majoring in theater and communications. She also graduated from Albany Law School summa cum laude after completing a two-year accelerated program. Lauren is thrilled to be sharing Legacy Theatre’s wonderful lineup of performances, classes, and events with the community.\nLauren@LegacyTheatreCT.org\nElaine Cappiello\nDevelopment Associate\nElaine joins the Legacy Theatre team after being an active member of the Madison, CT community, where she volunteered in the schools for several years. Prior to moving to CT, Elaine worked at New York Public Library, both in their Theatre and Performing Arts Archive (TOFT) and Development and Government Affairs offices; as well as the Alumni Relations offices at Parsons School of Design and Columbia College at Columbia University. She earned a B.A. in English from Chatham University in Pittsburgh, PA, and attended the Arts Administration Program at the University of Akron in Akron, OH before moving to New York City. Elaine’s interests outside of Legacy Theatre include genetic genealogy and supporting her children in the various music programs at Daniel Hand High School and along the Shoreline.\nElaine@LegacyTheatreCT.org\nBoard of Trustees\nStephanie Williams,\nPresident\nJana Shea,\nVice President\nKatina Gionteris,\nSecretary\nLuke Williams,\nTreasurer\nToni Burt\nDamian Doria\nCharles Grady\nBrian Knudsen\nSonja LaBarbera\nMary Pepe\nJames Roday Rodriguez\nTom Shea\nKeely Baisden Knudsen,\nEx-Officio\nAdvisory Council\nBob and Maryann Babcock\nBetty Ann Donegan\nCarol and Tom Gagliardi\nMelodie Lane\nEunice Lasala\nBonnie and Andy McKirdy\nBob and Jeanette Mobeck\nGreg Nobile\nPatrick and Stacey Ruwe\nBarry and Patti Sinoway\nHal Spitzer\nBox Office: (203) 315-1901\nClick Here for Box Office Hours\nThe Legacy Theatre, Inc., 128 Thimble Islands Road, Branford, CT 06405\nEmail:\nInfo@LegacyTheatreCT.org\nSign Up for Legacy's Mailing List\nDonate Now!",
      "emails": [
        "anne@legacytheatrect.org",
        "colin@legacytheatrect.org",
        "elaine@legacytheatrect.org",
        "info@legacytheatrect.org",
        "jeff@legacytheatrect.org",
        "keely@legacytheatrect.org",
        "lauren@legacytheatrect.org",
        "marylee@legacytheatrect.org",
        "user@domain.com"
      ]
    },
    {
      "url": "http://www.legacytheatrect.org/donor-and-sponsors",
      "is_candidate": false,
      "has_email": true,
      "text": "Thank You!\nThank you to our Namers\nWe apologize for any omissions!\nPlease send edits or additions to\ninfo@legacytheatrect.org\nThank You!\nThank you to our Namers\nWe apologize for any omissions!\nPlease send edits or additions to\ninfo@legacytheatrect.org\nThank You!\nThank you to our Namers\nWe apologize for any omissions!\nPlease send edits or additions to\ninfo@legacytheatrect.org\nBox Office: (203) 315-1901\nClick Here for Box Office Hours\nThe Legacy Theatre, Inc., 128 Thimble Islands Road, Branford, CT 06405\nEmail:\nInfo@LegacyTheatreCT.org\nSign Up for Legacy's Mailing List\nDonate Now!",
      "emails": [
        "info@legacytheatrect.org",
        "user@domain.com"
      ]
    },
    {
      "url": "http://www.legacytheatrect.org/contact",
      "is_candidate": false,
      "has_email": true,
      "text": "Contact Us\nBox Office\n(203) 315-1901\nAddress\nThe Legacy Theatre, Inc.\n128 Thimble Islands Road\nBranford, Connecticut 06405\nEmail\nInfo@LegacyTheatreCT.org\n﻿\nGet Involved!\nVolunteer Opportunities at The Legacy\nSign Up for Legacy’s Email Newsletters\nContact Us\nBox Office\n(203) 315-1901\nAddress\nThe Legacy Theatre, Inc.\n128 Thimble Islands Road\nBranford, Connecticut 06405\nEmail\nInfo@LegacyTheatreCT.org\n﻿\nGet Involved!\nVolunteer Opportunities at The Legacy\nSign Up for Legacy’s Email Newsletters\nContact Us\nBox Office\n(203) 315-1901\nAddress\nThe Legacy Theatre, Inc.\n128 Thimble Islands Road\nBranford, Connecticut 06405\nEmail\nInfo@LegacyTheatreCT.org\n﻿\nGet Involved!\nVolunteer Opportunities at The Legacy\nSign Up for Legacy’s Email Newsletters\nBox Office: (203) 315-1901\nClick Here for Box Office Hours\nThe Legacy Theatre, Inc., 128 Thimble Islands Road, Branford, CT 06405\nEmail:\nInfo@LegacyTheatreCT.org\nSign Up for Legacy's Mailing List\nDonate Now!",
      "emails": [
        "info@legacytheatrect.org",
        "user@domain.com"
      ]
    },
    {
      "url": "https://www.facebook.com/LegacyTheatreCT/",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    }
  ],
  "all_links": [
    "http://www.legacytheatrect.org/cart",
    "http://www.legacytheatrect.org/boxoffice",
    "http://www.legacytheatrect.org/support-us",
    "http://www.legacytheatrect.org/school-field-trips",
    "http://www.legacytheatrect.org/press",
    "http://www.legacytheatrect.org/past-seasons",
    "http://www.legacytheatrect.org/become-a-sponsor",
    "http://www.legacytheatrect.org/buy-a-program-ad",
    "http://www.legacytheatrect.org/2025-sunday-broadway-concert-series",
    "http://www.legacytheatrect.org/legends-of-the-60s",
    "http://www.legacytheatrect.org/donate",
    "http://www.legacytheatrect.org/about-1",
    "http://www.legacytheatrect.org/naming-opportunities",
    "http://www.legacytheatrect.org/now-hiring",
    "http://www.legacytheatrect.org/team",
    "http://www.legacytheatrect.org/the-colorful-hat-circus",
    "http://www.legacytheatrect.org/classes",
    "http://www.legacytheatrect.org/lets-get-together",
    "http://www.legacytheatrect.org/rising-stars",
    "http://www.legacytheatrect.org/s/Legacy_NamingOpportunities_A.pdf",
    "http://www.legacytheatrect.org/on-stage",
    "http://www.legacytheatrect.org/box-office-legacy-merchandise",
    "http://www.legacytheatrect.org/livestream",
    "http://www.legacytheatrect.org/directions-parking",
    "http://www.legacytheatrect.org/donor-and-sponsors",
    "http://www.legacytheatrect.org/volunteer",
    "http://www.legacytheatrect.org/submissions",
    "https://www.legacytheatrect.org/",
    "http://www.legacytheatrect.org/sweeney-todd",
    "http://www.legacytheatrect.org/contact",
    "http://www.legacytheatrect.org/faq",
    "http://www.legacytheatrect.org/program-archive",
    "http://www.legacytheatrect.org/anchor-society",
    "http://www.legacytheatrect.org/education",
    "http://www.legacytheatrect.org/stand-up-speak-out",
    "http://www.legacytheatrect.org/history",
    "http://www.legacytheatrect.org/2025-family-series",
    "http://www.legacytheatrect.org/scrooge-and-marley",
    "http://www.legacytheatrect.org/2025-mainstage-season",
    "http://www.legacytheatrect.org/peter-and-wendy-2025",
    "http://www.legacytheatrect.org/stage-door-medium-live-2025",
    "http://www.legacytheatrect.org/the-joke-show",
    "http://www.legacytheatrect.org/where-is-everybody",
    "http://www.legacytheatrect.org/plan-your-visit",
    "http://www.legacytheatrect.org/take-5-gala",
    "http://www.legacytheatrect.org/magic-of-lyn",
    "http://www.legacytheatrect.org/wheel-life-theatre-troupe",
    "http://www.legacytheatrect.org/auditions",
    "http://www.legacytheatrect.org/artist-residencies",
    "http://www.legacytheatrect.org/accessibility",
    "http://www.legacytheatrect.org/restoring",
    "http://www.legacytheatrect.org/long-days",
    "http://www.legacytheatrect.org/waffle-friends-a-puppet-palooza",
    "http://www.legacytheatrect.org/work-with-us",
    "http://www.legacytheatrect.org/noises-off",
    "http://www.legacytheatrect.org/the-creeker",
    "http://www.legacytheatrect.org/",
    "http://www.legacytheatrect.org/legacy-conservatory",
    "http://www.legacytheatrect.org/m4m",
    "http://www.legacytheatrect.org/our-mission",
    "http://www.legacytheatrect.org/the-feud"
  ],
  "candidate_links": [
    "http://www.legacytheatrect.org/support-us",
    "http://www.legacytheatrect.org/about-1",
    "http://www.legacytheatrect.org/team",
    "http://www.legacytheatrect.org/donor-and-sponsors",
    "http://www.legacytheatrect.org/contact",
    "https://www.facebook.com/LegacyTheatreCT/"
  ],
  "visited": [
    "http://www.legacytheatrect.org/",
    "http://www.legacytheatrect.org/about",
    "http://www.legacytheatrect.org/contact",
    "http://www.legacytheatrect.org/staff",
    "http://www.legacytheatrect.org/team",
    "http://www.legacytheatrect.org/board",
    "http://www.legacytheatrect.org/directory",
    "http://www.legacytheatrect.org/events",
    "http://www.legacytheatrect.org/sitemap.xml",
    "http://www.legacytheatrect.org/council",
    "http://www.legacytheatrect.org/leadership",
    "http://www.legacytheatrect.org/management",
    "http://www.legacytheatrect.org/producers",
    "http://www.legacytheatrect.org/support",
    "http://www.legacytheatrect.org/crew",
    "http://www.legacytheatrect.org/members",
    "http://www.legacytheatrect.org/bios",
    "http://www.legacytheatrect.org/people",
    "http://www.legacytheatrect.org/artists",
    "http://www.legacytheatrect.org/musicians",
    "http://www.legacytheatrect.org/faculty",
    "http://www.legacytheatrect.org/administration",
    "http://www.legacytheatrect.org/support-us",
    "http://www.legacytheatrect.org/about-1",
    "http://www.legacytheatrect.org/team",
    "http://www.legacytheatrect.org/donor-and-sponsors",
    "http://www.legacytheatrect.org/contact",
    "https://www.facebook.com/LegacyTheatreCT/"
  ],
  "base_url": "http://www.legacytheatrect.org/"
}