{
  "pages": [
    {
      "url": "https://www.legendscc.com/contact-us",
      "is_candidate": false,
      "has_email": false,
      "text": "Begin Mini-Page 21093\nEnd Mini-Page 21093\nContact Us\nBegin Mini-Page 21094\nLegends Golf & Country Club\n8600 Legends Boulevard, Fort Myers, FL 33912\nLegends Golf & Country Club is located on Daniels Parkway (exit 131) just off I-75. Go west .5 miles to Fiddlesticks Blvd and turn left. Drive 1.3 miles to Legends Boulevard and turn right. Once you are through the gate the Clubhouse is located approximately .5 miles on the left. Legends is conveniently located near Fort Myers Beach and Sanibel Island as well as several shopping venues, including Bell Tower Shops and Gulf Coast Town Center.\nClubhouse\n(239) 561-8740\nClubhouse (Fax)\n(239) 561-8742\nGolf Shop\n(239) 561-7757\nGolf Shop (Fax)\n(239) 561-7767\nEnd Mini-Page 21094\ncontainer",
      "emails": []
    },
    {
      "url": "https://www.legendscc.com/host-an-event",
      "is_candidate": false,
      "has_email": false,
      "text": "Begin Mini-Page 21075\nEnd Mini-Page 21075\nHost an Event\nBegin Mini-Page 21076\nWhether you are saying \"I do\" or celebrating a monumental life event, let Legends Golf & Country Club help create the perfect day!\nHere at Legends we work hard not only to MEET your expectations, but to EXCEED them.  Our energetic team of banquet professionals and gourmet Chefs are prepared to organize your next function right down to the very last detail, leaving you and your guests to enjoy a fun filled day.\nWith the clubs indoor and outdoor venues, we can successfully host weddings, rehearsal dinners, corporate gatherings, bar mitzvahs, birthday celebrations, memorial receptions, and golf events. You will be surrounded by the tranquil beauty of our course, making it a perfect backdrop for incredible wedding photos. Picturesque windows along our entire Dining Room offer your guests spectacular views.\nLet our team of culinary Chef's create the perfect \"fine\" dining experience with customized menus for your event.  Whether it's a plated entree or buffet style meal you won't be disappointed!\nLegends promises to make your special day one you and your guests won't forget!\nFor more information, please contact Lisa Korf at\n(239) 561-8740\next.116 or email\n[email protected]\n.\nEnd Mini-Page 21076\nStart Tabs\n3.4.1\nWeddings\nSpecial Events\nPrivate Event Inquiries\nBegin Mini-Page 21122\nCongratulations on Your Engagement!\nHere at Legends you won’t find wedding packages already put together…whether you are looking for a grand celebration or an intimate gathering of family and friends...we work with you to create the perfect backdrop for your special day or evening celebration. From a dramatic sunset cocktail hour to an outdoor reception under the stars...we deliver the wedding you’ve always imagined! Our understated décor makes it easy to reflect your unique style! Our picturesque windows along our entire Dining Room overlook the tranquil beauty of our course.  Our experienced, attentive staff will take care of every detail so you can enjoy every moment of your special day. With each wedding or banquet Legends hosts we take pride assisting in making every wedding a unique event.\nCeremony & Reception details you will want to keep in mind when considering the Legends:\nPrivate country club setting\nSeating in our Main Dining room for up to 200 guests\nIndoor Wedding Receptions\nBridal Suite\nExceptional attention to detail\n\"Fine Dining Experience\" the Legendary Way!\nIf you would like more information or to schedule a tour, please contact Lisa Korf at\n(239) 561-8740\nx116 or via email at\n[email protected]\n.\nWe look forward to making your special day one you and your guests won't forget!\nEnd Mini-Page 21122\nBegin Mini-Page 21123\nHost your next Special Event at Legends.\nLegends is one of the most desirable locations in Southwest Florida. We are minutes away from Fort Myers International Airport, Interstate 75, numerous shopping venues and several hotels.\nWe provide professional in-house catering with a powerful setting overlooking our waterfall pool and golf course. We work hard to live up to our reputation for dependability, promising not only to MEET your expectations, but to EXCEED them. Our energetic team of banquet professionals and gourmet Chef's are prepared to organize your next function right down to the very last detail. With the clubs indoor and outdoor venues, we can successfully host weddings, rehearsal dinners, corporate gatherings, bar mitzvahs, birthday celebrations, memorial receptions, and golf events.\nClubhouse Details:\nA formal dining room that seats up to 200\nSweeping views of the golf course\nWould you have it any other way, or the Legendary Way?\nFor more information or to schedule a tour, please contact Lisa Korf at\n(239) 561-8740\next. 116 or via email at\n[email protected]\n.\nEnd Mini-Page 21123\nBegin Mini-Page 21124\nWe'd Love To Hear From You!\nWhen it comes to saying two little words that will wonderfully change your life forever and ever, a very special venue is needed to fully honor this most magical of days.\nEnd Mini-Page 21124\n[if lt IE 9]>\r\n    <script type=\"text/javascript\" src=\"a_master/NET/RegistrationManager/Scripts/flashcanvas.js\"></script>\r\n    <![endif]\nFirst Name\nLast Name\nEmail\nPhone\nType of Event\nWedding\nGraduation\nAnniversary\nBaptism\nHoliday Party\nTournament\nBirthday Party\nOther\nIf Other, please specify:\nEvent Date Requested\nHow did you hear about us?\nQuestions & Comments\nSaving Information...Please Wait\nEnd Tabs\ncontainer",
      "emails": []
    }
  ],
  "all_links": [
    "https://www.legendscc.com/golf",
    "https://www.legendscc.com/real-estate/properties-for-sale-rent",
    "https://www.legendscc.com/contact-us",
    "https://www.legendscc.com/",
    "https://www.legendscc.com/member-login",
    "https://www.legendscc.com/real-estate",
    "https://www.legendscc.com/guest-policies",
    "https://www.legendscc.com/the-club",
    "https://www.legendscc.com/employment",
    "https://www.legendscc.com/host-an-event",
    "https://www.legendscc.com/golf/course-tour",
    "https://www.legendscc.com/club-lifestyle"
  ],
  "candidate_links": [
    "https://www.legendscc.com/contact-us",
    "https://www.legendscc.com/host-an-event"
  ],
  "visited": [
    "http://legendscc.com/",
    "http://legendscc.com/about",
    "http://legendscc.com/contact",
    "http://legendscc.com/staff",
    "http://legendscc.com/team",
    "http://legendscc.com/board",
    "http://legendscc.com/directory",
    "http://legendscc.com/events",
    "http://legendscc.com/sitemap.xml",
    "http://legendscc.com/council",
    "http://legendscc.com/leadership",
    "http://legendscc.com/management",
    "http://legendscc.com/producers",
    "http://legendscc.com/support",
    "http://legendscc.com/crew",
    "http://legendscc.com/members",
    "http://legendscc.com/bios",
    "http://legendscc.com/people",
    "http://legendscc.com/artists",
    "http://legendscc.com/musicians",
    "http://legendscc.com/faculty",
    "http://legendscc.com/administration",
    "https://www.legendscc.com/contact-us",
    "https://www.legendscc.com/host-an-event"
  ],
  "base_url": "http://legendscc.com/"
}