{
  "pages": [
    {
      "url": "https://www.legion.org/information-center/news/community/2025/july/post-provides-hope-support-amidst-tragedy-of-texas-flooding",
      "is_candidate": false,
      "has_email": false,
      "text": "About\nOrganization\nLeadership\nReports\nMedia Toolkit\nAmerican Legion Family\nAll About\nAdvocacy\nBe The One\nGrassroots Action Center\nLegislative\nNational Affairs\nYouth Support\nAdvocacy Center\nMembership & Services\nJoin The American Legion\nRenew Membership\nMember Discounts\nResources\nVeterans Services\nAll Membership & Services\nGet Involved\nYouth Programs\nCommunity Programs\nMeetings\nScholarships\nAll Programs\nInformation Center\nIn the Media\nCalendar\nTraining\nLibrary & Museum\nHonor & Remembrance\nAll Information Center\nFind a Post\nFind a Service Officer\nMyLegion.org\nShop Online\nJoin\nRenew\nDonate\nHome\nInformation Center\nNews\nPost provides hope, support amidst tragedy of Texas flooding\nJuly 10, 2025\nPost provides hope, support amidst tragedy of Texas flooding\nCommunity\nNews\n(Post 208 Facebook photo)\nAmerican Legion Post 208 in Kerrville has set up a relief area for both those impacted by the flooding and those first responders performing search and rescue. And the support from other Legion posts has been overwhelming.\nOn Independence Day, heavy showers from earlier in the week caused massive flooding in Kerr County, Texas. In less than an hour, the Guadalupe River rose 26 feet, according to state officials.\nThe results were devastating. With summer camps in place and vacationers in the area, the death toll has risen to 120 people as of July 10. More than 170 people remain missing.\nAnd as first responders continue their daily searches, they’ve found support in the form of the American Legion Family from Post 208 in Kerrville. Just two days after the flooding, the post set up a relief area for first responders, providing snacks, clothing, supplies and more, while also providing a place to sleep.\nDonations have poured into the post, including from Legion posts in Texas and elsewhere (see below). Items also have been made available to members of the community impacted by the flood.\nThe effort actually started with Post 208 looking out for a fellow veteran service organization. “Our post actually sits on the Guadalupe River. And the water did come up Friday morning to the road, but fortunately it did not get to the actual door of our post,” Auxiliary Unit 208 Treasurer-Secretary Lisa Valdez said. “So, by the grace of God we were spared. The VFW in town was not as lucky.”\nWhen Valdez learned that VFW Post 1480 had been flooded and didn’t know when it would be able to reopen, she reached out to Post 208 Commander Robert Garcia. A group text to the post Legion Family’s leadership led to a cleanup effort at Post 1480 the next morning. And that set the wheels in motion.\n“People in town started posting on social media what they were needed,” Valdez said. “We have a bingo hall. Robert and I and his wife (Post 208 First Vice Commander Veronica Garcia) got to talking together … and I said, ‘Why don’t we open our bingo hall, and we’ll start taking donations?’ We just put it out there, and it was just crazy.”\nValdez said Post 208 previously had hosted large district and state Legion events and already had a network in place. “We just started getting phone calls,” she said. “Robert said, ‘We’ll take all the donations’ because people were turning them away. Some places just wanted monetary donations. And we knew we had first responders coming in.”\nValdez was able to pick the brain of her brother, a former firefighter who took part in swiftwater rescue following Hurricane Katrina, to find out what supplies would be needed.\n“We put out a list, and other posts were calling us,” Valdez said. “They just started sending trucks from Missouri and Florida and everywhere. And from San Antonio, people were coming. And we just started stacking donations in a spot where first responders can come in and basically shop for free. Pick up toothbrushes, toothpaste, clean underwear, socks. We’ve got rubber boots in there in case their boots get worn out. A lot of bug spray and ant killer.”\nValdez said the outpouring of donations and support from other American Legion posts has left her “humbled by their outreach and their love.”\nThe post – which is located next to the central command center where Texas Gov. Greg Abbott and Department of Homeland Secretary Kristi Noem have been working from – also has a mobile medical truck in the parking lot to assist those who experience heat exhaustion or other issues. And a portion of the post hall has been set aside for Kerr County residents to pick up food and supplies as well.\nThe post has basically been operating from 6 a.m. to midnight, but two members of the post have been staying the night to be with the first responders sleeping there. Those hours likely will continue through next week.\nThat kind of dedication doesn’t surprise Valdez, who said she became passionate about Post 208’s Legion Family two years ago after her husband lost his job and she was able to pick up extra work at the post. “I’m grateful for that,” she said. “And because of that, I donate my time back to them every chance I get. It is a family. Whenever someone here needs something, we’re on it. We don’t hesitate.”\nAnd though she said down the road she may look back at what that Legion Family has provided during an overwhelming tragedy, now is not the time for that kind of reflection.\n“Honestly, after it’s all said and done, I would feel very proud … of our post efforts,” she said. “Right now, the mood is very solemn. It’s very hectic. It’s hard to feel anything but sadness right now. It’s just heartbreaking.\n“We’re on the river, so there’s (rescue and recovery) helicopters flying over every five minutes, and every time it does it’s just gut-wrenching. And every day the body count gets higher.”\nTexas Strong.\nAcross the state, Texas Legion posts have stepped up to assist Post 208 with its efforts. The following are just A FEW examples of how other posts in the state are supporting Post 208 in its efforts. Please share your efforts at Legiontown under\nVolunteering\n.\n·\nIn Helotes, American Legion Post 309 teamed with VFW Post 7108 and Texas State Rep. Josey Garcia to deliver supplies to Post 208. Post 309 continues to collect supplies for future deliveries.\n·\nIn League City, S. Mike Lacy Post 554 coordinated a community relief assistance effort that included collecting cleaning supplies, insect spray, clothing, drinks and other items. The post said it would make as many trips as needed to deliver items to the impacted area.\n·\nIn Seguin, American Legion Post 245’s Legion Family began collecting supplies on July 6 and took its first truckload for first responders two days later. “We sent everything that had to do with flashlights, batteries, insect repellent, water — everything for first responders,”\nPost 245 Commander Felisa Ramirez said.\n“I got a text from one of them saying we need more articles down there, but they’re going to stop at some of the little smaller communities that maybe aren’t getting as much publicity, but are also not getting a lot of response or assistance.” The post continues to accept donations for future deliveries.\n·\nIn Huntsville, Sam Houston Post 95 collected monetary donations for Kerrville families. The donations will be delivered this weekend during the department convention in Austin.  “We are Texas proud and need to be there to help when we are called!” the post wrote on its Facebook page.\n·\nIn Harlingen, American Legion Post 205 made a call for items that included blankets, non-perishable food, toiletries, bottled water, cleaning supplies and baby food.\n·\nIn Somerset, American Legion Post 443 donated six cots and picked up six more from American Legion Post 300 in San Antonio. The cots were delivered to Post 208, along with a pallet of water. While members of Post 443 were in Kerrville, they delivered clothing from Post 208 to St. Vincent Church for distribution. “Thank you American Legion Post 208 in Kerrville Tx for leading the charge and providing a place for victims, 1st responders and volunteers to rest. ONE TEAM ONE FIGHT!!” Post 443 wrote on its Facebook page.\n·\nIn Converse, William M. Randolph made a callout for donations of cots and socks for first responders providing relief efforts.\n·\nIn San Antonio, Post 592 learned of the need for cots and water for both Post 208 members and the first responders who have been sleeping at the post each night and were forced to do so on the ground. The request for 20 to 25 cots was met and was to be delivered to the post.\n·\nAlso in San Antonio, John F. Kennedy Post 485 teamed with other entities to collect non-perishable food for Kerrville.\nNationwide Support\n. Help for those affected by the Kerrville flooding and those providing relief efforts hasn’t been limited to the Lone Star State. Legionnaires and other organizations from as far away as Virginia have offered their assistance as well.\nFrom Colorado, online community Disgruntled Vets teamed with the nonprofit 22 Until None to create an Amazon wish list for people to purchase much-needed items for those on the ground in Kerrville. Disgruntled Vets founder Ryan Hemhauser, a member of American Legion Post 5 in Colorado Springs, moved quickly after learning about the flooding.\n“After hearing about the flooding in Texas, I immediately reached out to our partners at 22 Until None to find a way to help,” Hemhauser said. “We contacted over 20 organizations before connecting with the Grunt Style Foundation, who directed us to Post 208. From there, we worked directly with (Post 208 First Vice Commander Veronica Garcia) to get her a wishlist of urgently needed items. Thanks to our national veteran network, we helped facilitate over 1,500 packages and more than $40,000 in donations sent directly to the post.\n“As a Legionnaire at Post 5 in Colorado, I’ve seen what happens when veterans come together for a cause bigger than ourselves. From Colorado wildfires to hurricanes in New Jersey, I’ve witnessed the power of long-term support – and I’m proud we could stand with Post 208 when it mattered most.”\nIn Virginia, Department Historian David Wallace put out a call for donations on the Department of Virginia’s Facebook page, asking for donations of gift cards and checks. The department will accept donations through July 16.\nAnd in Florida, members of Post 83’s Legion Family in Macclenny organized a donation drive to be delivered to Post 208 later this month. Solicitated items include water, baby food and diapers, pet food and clothing.\nA reminder that Legionnaires and posts in Texas impacted by the flooding are eligible for National Emergency Fund grants. Click\nhere\nfor more information.\nCommunity\nShareThis BEGIN\nShareThis END\nad space",
      "emails": []
    },
    {
      "url": "https://www.legion.org/about/leadership",
      "is_candidate": false,
      "has_email": false,
      "text": "About\nOrganization\nLeadership\nReports\nMedia Toolkit\nAmerican Legion Family\nAll About\nAdvocacy\nBe The One\nGrassroots Action Center\nLegislative\nNational Affairs\nYouth Support\nAdvocacy Center\nMembership & Services\nJoin The American Legion\nRenew Membership\nMember Discounts\nResources\nVeterans Services\nAll Membership & Services\nGet Involved\nYouth Programs\nCommunity Programs\nMeetings\nScholarships\nAll Programs\nInformation Center\nIn the Media\nCalendar\nTraining\nLibrary & Museum\nHonor & Remembrance\nAll Information Center\nFind a Post\nFind a Service Officer\nMyLegion.org\nShop Online\nJoin\nRenew\nDonate\nHome\nAbout the American Legion\nLeadership\nNational Leadership\nThe American Legion is led by dedicated volunteers and staff whose mission is to carry out the resolutions of the membership, serve veterans and their families, advocate on behalf of the U.S. Armed Forces, mentor youth and promote Americanism.\nNational Commander\nElected annually, the national commander is chief executive officer of The American Legion, with full power to enforce the provisions of the organization’s Constitution, By-Laws and resolutions.\nNational Officers\nAmerican Legion national officers are appointed to provide leadership, direction and inspiration throughout the organization.\nNational Vice Commanders\nNational vice commanders of The American Legion support the national commander in multiple capacities in various regions throughout the country.\nNational Executive Committee\nThe national commander, five national vice commanders, one National Executive Committeeman, and one alternate elected by each department comprise the National Executive Committee.\nCommissions and Committees\nThe Commissions and Committees of The American Legion play a vital role in shaping policies and initiatives that address the needs of veterans and their families.\nDonate to The American Legion\nA Foundation of Hope\nI was about to give up... I wouldn’t have known where to go.\nKorean War Army veteran Willie Alvin Cousin\n, who received long-overdue and wrongly denied VA disability benefits after his case was reopened and won by American Legion Department Service Officer K. Robert Lewis\nThese were important things. It helped them not get behind in their rent... It helped them put food in the refrigerator.\nCoast Guard Vice Commandant Adm. Charlie Ray\n, after American Legion Temporary Financial Assistance helped more than 3,120 children whose active-duty families were affected by the federal government shutdown.\nYour donation provides hope for disabled veterans and children in need.\nDonate Now",
      "emails": []
    },
    {
      "url": "http://www.legion.org/contact/internal-affairs/regional-contacts",
      "is_candidate": false,
      "has_email": true,
      "text": "About\nOrganization\nLeadership\nReports\nMedia Toolkit\nAmerican Legion Family\nAll About\nAdvocacy\nBe The One\nGrassroots Action Center\nLegislative\nNational Affairs\nYouth Support\nAdvocacy Center\nMembership & Services\nJoin The American Legion\nRenew Membership\nMember Discounts\nResources\nVeterans Services\nAll Membership & Services\nGet Involved\nYouth Programs\nCommunity Programs\nMeetings\nScholarships\nAll Programs\nInformation Center\nIn the Media\nCalendar\nTraining\nLibrary & Museum\nHonor & Remembrance\nAll Information Center\nFind a Post\nFind a Service Officer\nMyLegion.org\nShop Online\nJoin\nRenew\nDonate\nHome\nContact Us\nContact Internal Affairs\nRegional Contacts\nRegional Contacts\nThe American Legion is broken down into regions based on the five elected national vice commanders. A regional liaison from the Internal Affairs & Membership Division is assigned to each region to assist people with their questions. These questions can be regarding procedures, processes and programs within The American Legion, how to start a new post or revitalize an existing one or general inquiries.\nCentral Region Liaison:\nIL, IN, KY, MI, OH, WI, WV\nEric D. Smith (IN)\n317-630-1328\nesmith@legion.org\nMidwest Region Liaison:\nIA, KS, MN, MO, ND, NE, OK, SD\nNick Arnett (MO)\n317-630-1326\nnarnett@legion.org\nNortheast Region Liaison:\nCT, DC, DE, FR, MA, ME, MD, NH, NJ, NY, PA, RI, VT\nMark A. Woodsmall (IN)\n317-630-1265\nmwoodsmall@legion.org\nSoutheast Region Liaison:\nAL, AR, FL, GA, LA, MS, NC, PR, SC, TN, TX, VA\nMichael Walker (IN)\n317-630-1372\nmwalker@legion.org\nWestern Region Liaison:\nAK, AZ, CA, CO, HI, ID, LT, MT, NM, NV, OR, PH, UT, WA, WY\nMichele Steinmetz (CA)\n317-630-1379\nmsteinmetz@legion.org",
      "emails": [
        "esmith@legion.org",
        "msteinmetz@legion.org",
        "mwalker@legion.org",
        "mwoodsmall@legion.org",
        "narnett@legion.org"
      ]
    },
    {
      "url": "https://www.legion.org/information-center/news/community/2025/june/posts-legion-family-continues-to-provide-vital-support-for-local-veterans-cemetery",
      "is_candidate": false,
      "has_email": false,
      "text": "About\nOrganization\nLeadership\nReports\nMedia Toolkit\nAmerican Legion Family\nAll About\nAdvocacy\nBe The One\nGrassroots Action Center\nLegislative\nNational Affairs\nYouth Support\nAdvocacy Center\nMembership & Services\nJoin The American Legion\nRenew Membership\nMember Discounts\nResources\nVeterans Services\nAll Membership & Services\nGet Involved\nYouth Programs\nCommunity Programs\nMeetings\nScholarships\nAll Programs\nInformation Center\nIn the Media\nCalendar\nTraining\nLibrary & Museum\nHonor & Remembrance\nAll Information Center\nFind a Post\nFind a Service Officer\nMyLegion.org\nShop Online\nJoin\nRenew\nDonate\nHome\nInformation Center\nNews\nPost’s Legion Family continues to provide vital support for local veterans cemetery\nJune 18, 2025\nPost’s Legion Family continues to provide vital support for local veterans cemetery\nCommunity\nNews\n(Missouri Veterans Cemetery-Bloomfield Facebook photo)\nIn 11 years, Missouri Post 114 in Sikeston has raised more than $300,000 for the Missouri Veterans Cemetery in Bloomfield.\nFor 11 years, Henry Meldrun Post 114 in Sikeston, Mo., has made fundraising for the\nMissouri Veterans Cemetery in nearby Bloomfield a passion project. It started with the purchase of a new bell tower at the cemetery and has grown from there – including one of the post’s Legion Family’s largest donations ever to the cemetery earlier this month.\nWith this year’s $43,801 donation, Post 114 has now surpassed more than $300,000 to the cemetery. Those donations have gone on to fund central heat and air, a state-of-the-art sound system for the committal shelter, LED lighting for the flagpoles, grounds upkeep and landscaping, and a new fountain in the cemetery’s lake.\nPost 114 Service Officer Blair Moran, who serves as president of the cemetery’s Assistance League – the nonprofit fundraising arm of the cemetery – said the donations have been vital for the cemetery.\n“We’ve been able to enhance the cemetery because of these large donations,” Moran said. “It’s been a godsend for us at the cemetery. This money’s gone to good use.”\nThe donated funds are raised through a two-day event that takes place in the spring; this year’s took place April 25-26 and included an American Legion Riders Chapter 114 Poker Run, a cornhole tournament, a live auction and a barbecue cook-off that this year drew more than 20 teams. Moran said the event is a team effort, led by American Legion Auxiliary Unit 114 and event chairman Vickie Wilson.\nThe cemetery isn’t the only beneficiary of Post 114’s generosity. Moran said through the post’s gaming machines, it has been able to donate more than $1 million over the past 10 years to the Missouri Education Revenue Fund, which provides the state and local funding that supports public education in Missouri. The money comes from the revenue from state-provided Lotto machines at Post 114.\nBut fundraising for the Missouri Veterans Cemetery in Bloomfield remains a priority, and Moran said the effort wouldn’t be as successful without partners.\n“I think our community appreciates the cemetery,” he said. “We have 5,200 interred at the cemetery now. We get wonderful support from the businesses and individuals in the Sikeston community for this endeavor. They think it’s a wonderful cause, and they come up and make nice donations to help us make these big donations each year to the cemetery.”\nCommunity\nShareThis BEGIN\nShareThis END\nad space",
      "emails": []
    },
    {
      "url": "https://www.legion.org/advocacy/be-the-one/be-the-one-training",
      "is_candidate": false,
      "has_email": false,
      "text": "About\nOrganization\nLeadership\nReports\nMedia Toolkit\nAmerican Legion Family\nAll About\nAdvocacy\nBe The One\nGrassroots Action Center\nLegislative\nNational Affairs\nYouth Support\nAdvocacy Center\nMembership & Services\nJoin The American Legion\nRenew Membership\nMember Discounts\nResources\nVeterans Services\nAll Membership & Services\nGet Involved\nYouth Programs\nCommunity Programs\nMeetings\nScholarships\nAll Programs\nInformation Center\nIn the Media\nCalendar\nTraining\nLibrary & Museum\nHonor & Remembrance\nAll Information Center\nFind a Post\nFind a Service Officer\nMyLegion.org\nShop Online\nJoin\nRenew\nDonate\nHome\nAdvocacy\nBe The One\nBe The One Training\nBe The One Training\nAs part of The American Legion Be the One mission to end veteran suicide, we have joined forces with Columbia University to develop training for those who want to learn more about interacting and responding with veterans who may be in crisis.\nAfter the training, participants will be able to:\nUse the Columbia Suicide Severity Rating Scale to determine at-risk individuals.\nIdentify risk factors and warning signs\nOutline the types of suicidal ideation and four behaviors that indicate imminent risk.\nCommunicate effectively with an individual who may be at risk of hurting themselves.\nMembers of The American Legion Family are encouraged to take part in this training and share the training with their communities. Check back to this page or subscribe to\nThe American Legion Online Update newsletter\nto receive information about new training opportunities as they become available.\nIMPORTANT NOTE:\nAll attendees will be asked to complete an online survey before the class and upon completion. These surveys help track the effectiveness of the training and allow us to plan for future development.\nCLICK HERE TO COMPLETE THE PRE-SESSION SURVEY.\nUPCOMING ONLINE SESSIONS\nTuesday, Sept. 9: 2:30-4 p.m. EST\nRegister here\nWednesday, Sept. 17: 5:30-7 p.m. EST\nRegister here\nMonday, Sept. 22: 2:30-4 p.m. EST\nRegister here\nDownload the FREE Be The One Mobile App\nThis veteran-focused version of the Columbia Protocol app, sponsored by The American Legion, uses the Columbia-Suicide Severity Rating Scale (C-SSRS), the most evidence-supported tool of its kind, is a simple series of questions that anyone can use anywhere in the world to help prevent suicide.",
      "emails": []
    },
    {
      "url": "https://www.legion.org/member-services",
      "is_candidate": false,
      "has_email": false,
      "text": "About\nOrganization\nLeadership\nReports\nMedia Toolkit\nAmerican Legion Family\nAll About\nAdvocacy\nBe The One\nGrassroots Action Center\nLegislative\nNational Affairs\nYouth Support\nAdvocacy Center\nMembership & Services\nJoin The American Legion\nRenew Membership\nMember Discounts\nResources\nVeterans Services\nAll Membership & Services\nGet Involved\nYouth Programs\nCommunity Programs\nMeetings\nScholarships\nAll Programs\nInformation Center\nIn the Media\nCalendar\nTraining\nLibrary & Museum\nHonor & Remembrance\nAll Information Center\nFind a Post\nFind a Service Officer\nMyLegion.org\nShop Online\nJoin\nRenew\nDonate\nHome\nMembership & Services\nMembership & Services\nMembership in The American Legion opens the door to services and resources designed to assist both members and all veterans, while building camaraderie through access to local posts.\nJoin The American Legion\nJoin The American Legion to connect with fellow veterans, gain a voice in our nation's capital, and receive a subscription to The American Legion Magazine.\nRenew Membership\nRenew your membership to stay connected, make a difference, and ensure continued support for veterans and their families.\nMember Discounts\nTake advantage of exclusive member discounts and save on a variety of products and services through The American Legion's discount providers.\nVeterans Services\nThe American Legion is committed to empowering veterans by providing the tools and information they need to thrive in civilian life, including assistance in careers, education, health, benefits, and financial services.\nResources\nAccess resources to connect with local posts, service officers, and find reunions and memorials/monuments.\nMembership Standings\nLatest updates for Departments and Posts on Membership Standings.\nCommunity News\nCommunity\nNew York Legionnaire to compete in Mrs. America\nAug 11, 2025\nCommunity\nPost provides hope, support amidst tragedy of Texas flooding\nJul 10, 2025\nCommunity\nPost’s annual generosity includes new minivan for homeless veterans facility\nJul 09, 2025\nCommunity\nPost stepping up to assist community following flooding\nJun 26, 2025\nCommunity\nPost’s Legion Family continues to provide vital support for local veterans cemetery\nJun 18, 2025\nCommunity\nFledgling post making an impact on local veterans, community\nMay 28, 2025\nCommunity\nPost, Student Veterans of America chapter team with others to assist Korean War veteran\nMay 14, 2025\nCommunity\nPosts opening up their doors to communities on American Legion Family Day\nApr 23, 2025\nCommunity\nAuxiliary unit leading Month of the Military Child observance\nApr 09, 2025\nCommunity\nPost using BBQ competition to raise money for VCF\nApr 02, 2025\nIf we need pagination\nIf we need navigation buttons\nDonate to The American Legion\nA Foundation of Hope\nI was about to give up... I wouldn’t have known where to go.\nKorean War Army veteran Willie Alvin Cousin\n, who received long-overdue and wrongly denied VA disability benefits after his case was reopened and won by American Legion Department Service Officer K. Robert Lewis\nThese were important things. It helped them not get behind in their rent... It helped them put food in the refrigerator.\nCoast Guard Vice Commandant Adm. Charlie Ray\n, after American Legion Temporary Financial Assistance helped more than 3,120 children whose active-duty families were affected by the federal government shutdown.\nYour donation provides hope for disabled veterans and children in need.\nDonate Now",
      "emails": []
    },
    {
      "url": "https://www.legion.org/advocacy/youth-support",
      "is_candidate": false,
      "has_email": false,
      "text": "About\nOrganization\nLeadership\nReports\nMedia Toolkit\nAmerican Legion Family\nAll About\nAdvocacy\nBe The One\nGrassroots Action Center\nLegislative\nNational Affairs\nYouth Support\nAdvocacy Center\nMembership & Services\nJoin The American Legion\nRenew Membership\nMember Discounts\nResources\nVeterans Services\nAll Membership & Services\nGet Involved\nYouth Programs\nCommunity Programs\nMeetings\nScholarships\nAll Programs\nInformation Center\nIn the Media\nCalendar\nTraining\nLibrary & Museum\nHonor & Remembrance\nAll Information Center\nFind a Post\nFind a Service Officer\nMyLegion.org\nShop Online\nJoin\nRenew\nDonate\nHome\nAdvocacy\nYouth Support\nYouth Support\nThe American Legion has a proud tradition of supporting our nation’s youth. The organization was founded on this principle in 1919, when Children & Youth was declared one of the Legion’s four pillars.\nAbout\nLearn more about our programs and initiatives aimed at ensuring their well-being and protecting the interests of children and families.\nPublications\nPublications related to The American Legion's youth support initiatives, including awards, conference presentations, and informational brochures.\nResources\nResources focused on community education, substance abuse prevention, victim services, and various youth organizations and programs.\nDonate to The American Legion\nA Foundation of Hope\nI was about to give up... I wouldn’t have known where to go.\nKorean War Army veteran Willie Alvin Cousin\n, who received long-overdue and wrongly denied VA disability benefits after his case was reopened and won by American Legion Department Service Officer K. Robert Lewis\nThese were important things. It helped them not get behind in their rent... It helped them put food in the refrigerator.\nCoast Guard Vice Commandant Adm. Charlie Ray\n, after American Legion Temporary Financial Assistance helped more than 3,120 children whose active-duty families were affected by the federal government shutdown.\nYour donation provides hope for disabled veterans and children in need.\nDonate Now",
      "emails": []
    },
    {
      "url": "https://www.legion.org/member-services/membership-standings",
      "is_candidate": false,
      "has_email": false,
      "text": "About\nOrganization\nLeadership\nReports\nMedia Toolkit\nAmerican Legion Family\nAll About\nAdvocacy\nBe The One\nGrassroots Action Center\nLegislative\nNational Affairs\nYouth Support\nAdvocacy Center\nMembership & Services\nJoin The American Legion\nRenew Membership\nMember Discounts\nResources\nVeterans Services\nAll Membership & Services\nGet Involved\nYouth Programs\nCommunity Programs\nMeetings\nScholarships\nAll Programs\nInformation Center\nIn the Media\nCalendar\nTraining\nLibrary & Museum\nHonor & Remembrance\nAll Information Center\nFind a Post\nFind a Service Officer\nMyLegion.org\nShop Online\nJoin\nRenew\nDonate\nHome\nMembership & Services\nMembership Standings\nMembership Standings\nThis page is intended for national headquarters, department staff or other designated staff to access the national membership report. These documents can be used as a tool by membership staff at all levels to track their individual, department, and regional goals.\nDownload the Department Membership file\nDownload the SAL Membership file",
      "emails": []
    },
    {
      "url": "https://www.legion.org/about",
      "is_candidate": false,
      "has_email": false,
      "text": "About\nOrganization\nLeadership\nReports\nMedia Toolkit\nAmerican Legion Family\nAll About\nAdvocacy\nBe The One\nGrassroots Action Center\nLegislative\nNational Affairs\nYouth Support\nAdvocacy Center\nMembership & Services\nJoin The American Legion\nRenew Membership\nMember Discounts\nResources\nVeterans Services\nAll Membership & Services\nGet Involved\nYouth Programs\nCommunity Programs\nMeetings\nScholarships\nAll Programs\nInformation Center\nIn the Media\nCalendar\nTraining\nLibrary & Museum\nHonor & Remembrance\nAll Information Center\nFind a Post\nFind a Service Officer\nMyLegion.org\nShop Online\nJoin\nRenew\nDonate\nHome\nAbout the American Legion\nAdvocating for Veterans Since 1919\nFounded by an Act of Congress after World War I, The American Legion fiercely advocates for the unique needs of every generation of veterans, service members, and their families who pledge to protect our nation. Today, we are committed to destigmatizing mental health support, offering peer-to-peer resources, and empowering everyone to Be The One in the fight to end veteran suicide.\nOrganization\nThe American Legion was chartered and incorporated by Congress in 1919 as a patriotic veterans organization devoted to mutual helpfulness.\nLeadership\nThe National Leadership of The American Legion is dedicated to guiding the organization in its mission to serve veterans and their families.\nReports\nAnnual Reports, Membership Impact Reports, and the Legislative Agenda, highlighting our initiatives and achievements.\nMedia Toolkit\nThe American Legion's Media Toolkit includes logos, brand guidelines, media contacts, and more.\nAmerican Legion Family\nThe American Legion Family unites to support veterans, their families, and communities.\nDonate to The American Legion\nA Foundation of Hope\nI was about to give up... I wouldn’t have known where to go.\nKorean War Army veteran Willie Alvin Cousin\n, who received long-overdue and wrongly denied VA disability benefits after his case was reopened and won by American Legion Department Service Officer K. Robert Lewis\nThese were important things. It helped them not get behind in their rent... It helped them put food in the refrigerator.\nCoast Guard Vice Commandant Adm. Charlie Ray\n, after American Legion Temporary Financial Assistance helped more than 3,120 children whose active-duty families were affected by the federal government shutdown.\nYour donation provides hope for disabled veterans and children in need.\nDonate Now",
      "emails": []
    },
    {
      "url": "https://www.legion.org/get-involved/youth-programs/baseball",
      "is_candidate": false,
      "has_email": false,
      "text": "About\nOrganization\nLeadership\nReports\nMedia Toolkit\nAmerican Legion Family\nAll About\nAdvocacy\nBe The One\nGrassroots Action Center\nLegislative\nNational Affairs\nYouth Support\nAdvocacy Center\nMembership & Services\nJoin The American Legion\nRenew Membership\nMember Discounts\nResources\nVeterans Services\nAll Membership & Services\nGet Involved\nYouth Programs\nCommunity Programs\nMeetings\nScholarships\nAll Programs\nInformation Center\nIn the Media\nCalendar\nTraining\nLibrary & Museum\nHonor & Remembrance\nAll Information Center\nFind a Post\nFind a Service Officer\nMyLegion.org\nShop Online\nJoin\nRenew\nDonate\nHome\nGet Involved\nYouth Programs\nBaseball\nAmerican Legion Baseball\nCONGRATULATIONS to 2025 American Legion World Series Champions, Chesapeake (Va.) Post 280!\nRead Finals Recap\nView Final Standings\nWatch Championship Game Highlights\nCourage, Respect, Citizenship\nAmerican Legion Baseball is a national institution, having thrived through a world war, several national tragedies, and times of great prosperity as well as great despair.\nSince its inception in 1925, American Legion Baseball’s reputation as one of the most successful and tradition-rich amateur athletic leagues has endured. Today, the program registers teams in all 50 states plus Canada. Each year young people, ages 13 to 19, participate. Countless ALB alumni have also gone on to play in college and professional baseball, with 82 inducted into the Baseball Hall of Fame.\nAbout American Legion Baseball\nad space\nCONGRATULATIONS 2025 AMERICAN LEGION WORLD SERIES CHAMPIONS!\nChesapeake brings Virginia its 2nd American Legion World Series title\nPost 280 joins Midlothian as Virginia teams to win American Legion Baseball’s championship.\nChampionship Recap\nWatch Highlights\n2025 American Legion World Series Awards\nThe 2025 American Legion Baseball awards were announced Tuesday night after the championship game of the 98th American Legion World Series.\n2025 Recipients\n2025 ALB Player of the Year\nLATEST HIGHLIGHTS FROM SHELBY\n#ALWS25 Virginia captures 2025 American Legion World Series\n(Video opens in a modal)\nChesapeake Va. Post 280 wins 2025 American Legion World Series\n(Video opens in a modal)\n#25ALWS Virginia beats Texas to take 2024 American Legion Baseball World Series Title\n(Video opens in a modal)\n2025 American Legion World Series Championship Game Highlights\n(Video opens in a modal)\n#ALWS25  The countdown is on for the Championship Game\n(Video opens in a modal)\nThe countdown is on for The 2025 American Legion World Series Championship Game\n(Video opens in a modal)\nGame 14 Highlights: 2025 American Legion World Series Semi-Finals\n(Video opens in a modal)\nGame 13 Highlights: 2025 American Legion World Series Semifinals Game 1\n(Video opens in a modal)\nSemi-Finals Teams: 2025 American Legion World Series\n(Video opens in a modal)\nGame 12 Highlights: 2025 American Legion World Series\n(Video opens in a modal)\nGame 11 Highlights: 2025 American Legion World Series\n(Video opens in a modal)\nGame 10 Highlights: 2025 American Legion World Series\n(Video opens in a modal)\nGame 9 Highlights: 2025 American Legion World Series\n(Video opens in a modal)\n#ALWS25 - Shelby N.C. youth proud of their role during The American Legion World Series\n(Video opens in a modal)\n#ALWS25 - Blackman High School Blaze Battalion continues American Legion World Series tradition\n(Video opens in a modal)\n#ALWS25 - Chesapeake Va., Post 280 teammates share bittersweet victory in Game 2\n(Video opens in a modal)\nShelby N.C. youth proud of their role during The American Legion World Series\n(Video opens in a modal)\nDay 2 Highlights: 2025 American Legion Baseball World Series\n(Video opens in a modal)\nGame 8 Highlights: 2025 American Legion World Series\n(Video opens in a modal)\nGame 7 Highlights: 2025 American Legion World Series\n(Video opens in a modal)\nGame 6 Highlights: 2025 American Legion World Series\n(Video opens in a modal)\nBlackman High School Blaze Battalion honored to continue American Legion World Series tradition\n(Video opens in a modal)\nGame 5 Highlights: 2025 American Legion World Series\n(Video opens in a modal)\nDay 1 Highlights: 2025 American Legion Baseball World Series\n(Video opens in a modal)\nGame 4 Highlights: 2025 American Legion World Series\n(Video opens in a modal)\nBittersweet win for Chesapeake, Va., Post 280 in Game 2 of 2025 American Legion  World Series\n(Video opens in a modal)\nGame 3 Highlights: 2025 American Legion World Series\n(Video opens in a modal)\nGame 2 Highlights: 2025 American Legion World Series\n(Video opens in a modal)\nGame 1 Highlights: 2025 American Legion World Series\n(Video opens in a modal)\nThe 2025 American Legion World Series Begins\n(Video opens in a modal)\nIf we need pagination\nIf we need navigation buttons\nCONGRATULATIONS, CENTENNIAL CLASSIC CHAMPIONS!\nMinnesota rallies to win Centennial Classic\nThe American Legion Baseball team representing Glenwood/Lowry (Minn.) Posts 187/253 might want to add “stay resilient” to any team mottos.\nAfter their resilience helped them rally for a win Saturday in the Centennial Classic in Milbank, S.D., it paid off again in a big way in Sunday’s championship game.\nGame Recap\nWatch on YouTube\nCENTENNIAL\nCelebrate a century of American Legion Baseball with facts on each Department's baseball history and sharing your own memories as a player or coach in the Legion Baseball program.\nCENTENNIAL POP-UP SHOP\nSHOW YOUR SPIRIT! Get your American Legion Baseball Centennial merch, only available for a limited time! This new online store includes an array of merchandise to celebrate American Legion Baseball’s 100th birthday.\nHow to Participate\nInformation about players, coaches and volunteers.\nLEARN MORE\nAMERICAN LEGION BASEBALL\nCODE OF SPORTSMANSHIP\n\"I will keep the\nrules\n, Keep\nfaith\nwith my teammates,\nKeep my\ntemper\n, Keep myself\nfit\n,\nKeep a\nstout heart\nin defeat, Keep\npride\nunder in victory,\nKeep a\nsound soul\n, a\nclean mind\n, and a\nhealthy body\n.\"\nDrafted in 1925 and officially adopted in 1928, this code has remained unchanged for the past century.\nFInd a Team\nFind an American Legion Baseball team in your community.\nSEARCH YOUR AREA\nTournaments\nView or register a Legion Baseball tournament.\nLEARN MORE\nAwards\nView award recipients throughout history.\nVIEW HERE\nResources\nHelpful resources and policies for navigating the season.\nLearn More\nState Links\nFind information on your state's American Legion Baseball website.\nFind your state\nBaseball News\nBaseball\n‘Maybe there’s some balloons in these baseballs’\nSep 02, 2025\nRichard Walker\nBaseball\nRevisit the 2025 American Legion World Series in stories, photos and videos\nSep 02, 2025\nBaseball\nHouse resolution introduced to honor American Legion Baseball’s centennial\nAug 28, 2025\nBaseball\nChesapeake brings Virginia its 2nd American Legion World Series title\nAug 19, 2025\nRichard Walker\nBaseball\n2025 American Legion World Series awards announced\nAug 19, 2025\nBaseball\nVirginia’s Stubbe named 2025 Legion Baseball Player of the Year\nAug 19, 2025\nRichard Walker\nBaseball\nIt’s Virginia vs. Texas for the 2025 ALWS title\nAug 19, 2025\nBaseball\nALWS Game 13: Virginia punches ticket to title game\nAug 18, 2025\nRichard Walker\nBaseball\nALWS Game 14: Texas headed back to championship game\nAug 18, 2025\nRichard Walker\nBaseball\nSemifinals set for 2025 American Legion World Series\nAug 18, 2025\nIf we need pagination\nIf we need navigation buttons\nCONTACT US\nFind American Baseball contacts in your state.\nRelationships",
      "emails": []
    },
    {
      "url": "https://www.legion.org/about/leadership/national-vice-commanders",
      "is_candidate": false,
      "has_email": false,
      "text": "About\nOrganization\nLeadership\nReports\nMedia Toolkit\nAmerican Legion Family\nAll About\nAdvocacy\nBe The One\nGrassroots Action Center\nLegislative\nNational Affairs\nYouth Support\nAdvocacy Center\nMembership & Services\nJoin The American Legion\nRenew Membership\nMember Discounts\nResources\nVeterans Services\nAll Membership & Services\nGet Involved\nYouth Programs\nCommunity Programs\nMeetings\nScholarships\nAll Programs\nInformation Center\nIn the Media\nCalendar\nTraining\nLibrary & Museum\nHonor & Remembrance\nAll Information Center\nFind a Post\nFind a Service Officer\nMyLegion.org\nShop Online\nJoin\nRenew\nDonate\nHome\nAbout the American Legion\nLeadership\nNational Vice Commanders\nNational Vice Commanders\nElected at the national convention, five vice commanders act as representatives of the national commander. They may preside over meetings of the National Executive Committee or the national convention, and perform other duties for the commander. No two vice commanders can be chosen from the same department during the same year.",
      "emails": []
    },
    {
      "url": "https://www.legion.org/contact",
      "is_candidate": false,
      "has_email": false,
      "text": "About\nOrganization\nLeadership\nReports\nMedia Toolkit\nAmerican Legion Family\nAll About\nAdvocacy\nBe The One\nGrassroots Action Center\nLegislative\nNational Affairs\nYouth Support\nAdvocacy Center\nMembership & Services\nJoin The American Legion\nRenew Membership\nMember Discounts\nResources\nVeterans Services\nAll Membership & Services\nGet Involved\nYouth Programs\nCommunity Programs\nMeetings\nScholarships\nAll Programs\nInformation Center\nIn the Media\nCalendar\nTraining\nLibrary & Museum\nHonor & Remembrance\nAll Information Center\nFind a Post\nFind a Service Officer\nMyLegion.org\nShop Online\nJoin\nRenew\nDonate\nHome\nContact Us\nContact Us\nService & Support Directory\nVeterans Crisis Line\nFor immediate assistance call 988 and press 1.\nVisit VeteransCrisisLine.net\nBenefits and Claims Assistance\nAccredited American Legion service officers are specially trained to offer expert assistance, at no cost, to veterans and their families.\nFind a Service Officer\nCustomer Service\nMembership dues, Paid Up For Life (PUFL), magazine subscriptions, and additional membership-related services and questions.\n(800) 433-3318\nSend E-mail\nmyLegion Support\nReceive technical assistance for the\nmyLegion.org\nwebsite.\n(833) 253-9995 (Toll Free)\nSend E-mail\nEmblem Sale\ns\nOrder inquiries, product availability, and merchandise issues.\n(888) 453-4466\nSend E-mail\nMedia Relations\nPress inquiries, public statements, and media collaboration.\n(317) 630-1298\nSend E-mail\nNational Headquarters Divisions\nAmericanism and Children & Youth\nAmerican Legion Baseball, Boys State / Nation,\nChild Welfare Foundation (CWF),\nFlag Education,\nJunior Shooting Sports,\nOratorical Contest,\nScholarships, Scouting,\nTemporary Financial Assistance, and\nYouth Cadet Law Enforcement.\n(317) 630-1203\nSend E-mail\nFund Development\nQuestions regarding estate-planning resources, making a financial gift, donor recognition, information on giving options such as gifts of stocks, bonds, retirement assets, cash, insurance, business interests, bequests, wills, and beneficiary designations. Notify us that you have named The American Legion in your estate plan, we want to honor you on our Heritage Society listing.\n(833) 257-0955\nSend E-mail\nConvention & Meetings\nNational Convention, other meetings, and Color Guard.\n(317) 630-1313\nSend E-mail\nFinance\nDepartment accounts and organizational financial questions.\n(317) 630-1200\nSend E-mail\nHuman Resources\nQuestions regarding career opportunities at The American Legion National Headquarters.\n(317) 630-1346\nSend E-mail\nInternal Affairs & Membership\nMembership programs and policies, Paid Up For Life, post information and concerns, Legion Riders, National Emergency Fund, and the Sons of The American Legion.\nView Regional Contacts\n(317) 630-1327\nSend E-mail\nLegislative\nFederal government issues and legislation.\n(202) 861-2700\nSend E-mail\nLibrary and Museum\nAmerican Legion history, memorabilia, and resolutions.\n(317) 630-1366\nSend E-mail\nMedia & Communications\nArticle references, magazine requests, Vet Voice, and advertising information.\n(317) 630-1272\nSend E-mail\nNational Security\nMilitary, national security, foreign relations, retirement benefits, and ceremonies.\n(202) 263-5750\nSend E-mail\nVeterans Affairs & Rehabilitation\nAssistance with claims and benefits, health concerns, and veterans' cemeteries.\n(202) 263-5759\nSend E-mail\nVeterans Employment & Education\nVeteran employment, support for homeless veterans, and veterans' preference.\n(202) 861-2700\nSend E-mail\nThe American Legion National Headquarters\n700 N. Pennsylvania St.\nP.O. Box 1055\nIndianapolis, IN 46206\nTelephone: (317) 630-1200\nFax: (317) 630-1223\nThe American Legion Washington Office\n1608 K St. N.W.\nWashington, DC 20006\nTelephone: (202) 861-2700\nFax: (202) 833-4452\nJohn H. Geiger Operations Center\n5745 Lee Road\nIndianapolis, IN 46216\nTelephone: (317) 860-3100\nFax: (317) 860-3001",
      "emails": []
    },
    {
      "url": "https://www.legion.org/renew",
      "is_candidate": false,
      "has_email": false,
      "text": "About\nOrganization\nLeadership\nReports\nMedia Toolkit\nAmerican Legion Family\nAll About\nAdvocacy\nBe The One\nGrassroots Action Center\nLegislative\nNational Affairs\nYouth Support\nAdvocacy Center\nMembership & Services\nJoin The American Legion\nRenew Membership\nMember Discounts\nResources\nVeterans Services\nAll Membership & Services\nGet Involved\nYouth Programs\nCommunity Programs\nMeetings\nScholarships\nAll Programs\nInformation Center\nIn the Media\nCalendar\nTraining\nLibrary & Museum\nHonor & Remembrance\nAll Information Center\nFind a Post\nFind a Service Officer\nMyLegion.org\nShop Online\nJoin\nRenew\nDonate\nHome\nRenew Membership\nRenew Your American Legion Membership\nRenew Today\nWhy Your Membership Matters\nFamily, Community, and Purpose\nThe American Legion stands as a beacon of inclusivity and camaraderie, offering a welcoming embrace to veterans and their families from all walks of life. Serving as more than just a gathering place, it fosters a sense of belonging and understanding within the veteran community, transcending differences, and uniting individuals under a shared bond of service. Legionnaires and their family members can also be eligible for a myriad of financial grants during times of financial hardship, natural disasters, or even for educational scholarships.\nRenew for Benefits\nAccredited American Legion service officers are specially trained to provide expert assistance, free of charge, to veterans and their families. Your membership also helps support American Legion Department Service Officers nationwide who assist veterans in preparing claims and obtaining their full military healthcare benefits through the VA.\nContinued Advocacy on Capitol Hill\nThe American Legion is the nation's most influential, effective, and dependable advocate of veteran affairs fighting for better active-duty pay, improved housing for active-duty families and helping to ensure that the VA's medical system can properly care for veterans.\nStay Informed\nOur nation's leaders speak directly to citizens on the pages of The American Legion Magazine. The American Legion's organizational goals are promoted using the words of talented writers, professional journalists and world leaders.\nKeep your benefits coming!\nRenew Today\nMembership expires December 31",
      "emails": []
    },
    {
      "url": "https://www.legion.org/about/leadership/constitutional-officers",
      "is_candidate": false,
      "has_email": false,
      "text": "About\nOrganization\nLeadership\nReports\nMedia Toolkit\nAmerican Legion Family\nAll About\nAdvocacy\nBe The One\nGrassroots Action Center\nLegislative\nNational Affairs\nYouth Support\nAdvocacy Center\nMembership & Services\nJoin The American Legion\nRenew Membership\nMember Discounts\nResources\nVeterans Services\nAll Membership & Services\nGet Involved\nYouth Programs\nCommunity Programs\nMeetings\nScholarships\nAll Programs\nInformation Center\nIn the Media\nCalendar\nTraining\nLibrary & Museum\nHonor & Remembrance\nAll Information Center\nFind a Post\nFind a Service Officer\nMyLegion.org\nShop Online\nJoin\nRenew\nDonate\nHome\nAbout the American Legion\nLeadership\nNational Constitutional Officers\nNational Constitutional Officers\nIn addition to the national commander and vice commanders, six national constitutional officers are appointed annually by vote of the National Executive Committee. They are the adjutant, treasurer, judge advocate, historian, chaplain and sergeant-at-arms. Officers elected by the national convention take office upon adjournment and serve until the end of the next convention.",
      "emails": []
    },
    {
      "url": "https://www.legion.org/information-center/news/community/2025/may/post-student-veterans-of-america-chapter-team-with-others-to-assist-korean-war-veteran",
      "is_candidate": false,
      "has_email": false,
      "text": "About\nOrganization\nLeadership\nReports\nMedia Toolkit\nAmerican Legion Family\nAll About\nAdvocacy\nBe The One\nGrassroots Action Center\nLegislative\nNational Affairs\nYouth Support\nAdvocacy Center\nMembership & Services\nJoin The American Legion\nRenew Membership\nMember Discounts\nResources\nVeterans Services\nAll Membership & Services\nGet Involved\nYouth Programs\nCommunity Programs\nMeetings\nScholarships\nAll Programs\nInformation Center\nIn the Media\nCalendar\nTraining\nLibrary & Museum\nHonor & Remembrance\nAll Information Center\nFind a Post\nFind a Service Officer\nMyLegion.org\nShop Online\nJoin\nRenew\nDonate\nHome\nInformation Center\nNews\nPost, Student Veterans of America chapter team with others to assist Korean War veteran\nMay 14, 2025\nPost, Student Veterans of America chapter team with others to assist Korean War veteran\nCommunity\nNews\n(Georgia Southern University Division of Public Safety Facebook photo)\nGeorgia Post 90 and SVA’s Georgia Southern University-Statesboro chapter joined with a fraternity and the university’s police department to clean up veteran’s yard, help with home maintenance.\nAround two years ago, Korean War-era veteran Danny Duncan received assistance with his U.S. Department of Veterans Affairs benefits claim from Statesboro, Ga., Dexter Allen American Legion Post 90 service officer Bobby Godwin. A few months later, Duncan joined the post.\nGodwin began driving Duncan to and from his various medical appointments. That’s when Godwin noticed that Duncan’s home and yard needed some work. Walking around the yard was dangerous because of the presence of rusted steel and iron, and broken glass. Inside, items that had accumulated over decades made it difficult for Duncan and his wife to get around.\n“I got to know him and got to know his house and the disarray it really was in,” Godwin said. “He can’t get out there and (clean it up).”\nThat prompted Godwin, also Post 90’s commander, to organize a clean-up effort. He first proposed the idea at a post meeting and then reached out to the nearby Georgia Southern University (GSU) Division of Public Safety, who helped him make connections on campus.\nThe result was a collaboration between Post 90, GSU public safety officials, the university’s Student Veterans of America (SVA) chapter and Kappa Alpha fraternity. The four entities performed much-needed yard work, home maintenance and other tasks on the couple’s property.\nSVA Chapter President Joe Jaurgui, who served in the U.S. Army from 2006-2014 before being medically retired, said answering the call to help Duncan – someone he’d never met – was an easy decision.\n“We didn’t have to know him,” Jaurgui said. “He was a veteran in need, and we’re an organization that’s there to pretty much help or do whatever we can to prop up other vets. That’s what we’re there for. We’re trying to do some more engagement with our community and (veteran service organizations). Just trying to be a good student organization but providing for the veterans in our community too.”\nGodwin said being able to help Duncan – and incorporating other groups and agencies in the process – “is a really great feeling, especially getting all the different groups to come together. It was life-changing for Danny and his wife because now she can move around. She had fallen a few times, and when you’re older like that and you fall, it’s a big deal.\n“It’s an awesome feeling knowing that all these people came together to help a wartime veteran like that and make his life much easier for him.”\nJaurgui said going beyond just assisting fellow student veterans is a part of what SVA represents. “We’re there to advocate for our military-connected students, but we’re also there to impact our community and our veterans in those communities,” he said. “So if there’s ever a need that arises, we’re there to respond. It doesn’t take anything to just go and help someone – to be a good steward and try to be helpful when you can.”\nPost 90 had crossed paths with the SVA chapter prior to the cleanup effort. The chapter conducts biweekly meetings, which Godwin now attends as a Post 90 representative. At one of those meetings, it was shared that The Vault, an on-campus apartment complex, had to close in early April because of structural issues. Both Post 90 and the SVA chapter then set out to assist the veterans who were forced to vacate\nPost 90 provided a space for program coordinators from the VA Supportive Services for Veterans Families Program from both Augusta and Savannah to assist veterans with rehousing. The SVA chapter, meanwhile, worked to put residents who are military dependents in contact with the school’s dean and military services office to figure out a course of action. The chapter also put into place mechanisms to be able to respond quicker if a similar incident happens in the future.\nThe collaboration between Post 90 and its SVA counterparts didn’t end with the cleanup effort. On May 10, the post hosted an “End of Semester Bash” attended by 43 people and included games, a cookout and camaraderie shared by the post’s Legion family and the college students.\nIt’s important to continue that relationship. “Us, as a veterans student organization on campus, we want to bridge that gap between the veteran community that’s not attending school,” said Jaurgui, who is four classes from graduating. “At some point, we’re not going to be attending school any longer. Some of us might actually stay in that area. If we don’t stay in the area, it’s a place where we know we can go … if they ever need anything.”\nGodwin also sees the relationship as a long-term win for both organizations. “In my opinion, by forming this relationship, it helps the Legion in the future,” he said. “As these young people graduate and start going back to their places they choose to live, they might get involved in a Legion post there because of the work we’re doing with them now. The Legion needs more young people involved, and this is a good way to get into the community, work with them hand in hand and grow the Legion at the same time.”\nCommunity\nShareThis BEGIN\nShareThis END\nad space",
      "emails": []
    },
    {
      "url": "https://www.facebook.com/americanlegionhq",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    }
  ],
  "all_links": [
    "https://www.legion.org/information-center/news/community/2025/july/post-provides-hope-support-amidst-tragedy-of-texas-flooding",
    "http://www.legion.org/contact/convention-meetings",
    "https://www.legion.org/about/reports",
    "https://www.legion.org/about/leadership",
    "http://www.legion.org/contact/emblem-sales",
    "https://www.legion.org/information-center/news/community/2025/july/posts-annual-generosity-includes-new-minivan-for-homeless-veterans-facility",
    "https://www.legion.org/member-services/veterans-services",
    "http://www.legion.org/contact/veterans-employment-education",
    "http://www.legion.org/contact/internal-affairs/regional-contacts",
    "https://www.legion.org/information-center",
    "https://www.legion.org/information-center/in-the-media/publications",
    "https://www.legion.org/about/leadership/national-executive-committee",
    "https://www.legion.org/information-center/library-museum",
    "https://www.legion.org/member-services/veterans-services/veterans-health",
    "https://www.legion.org/faq",
    "https://www.legion.org/get-involved/youth-programs",
    "http://emblem.legion.org/emailpromotion.asp?key=LEGION&dest=https://emblem.legion.org/American-Flags/departments/756/",
    "https://www.legion.org/advocacy/legislative",
    "https://www.legion.org/information-center/news/community/2025/june/posts-legion-family-continues-to-provide-vital-support-for-local-veterans-cemetery",
    "http://www.legion.org/contact/library-museum",
    "https://www.legion.org/about/leadership/commissions-committees",
    "http://emblem.legion.org/emailpromotion.asp?key=LEGION&dest=http://emblem.legion.org/",
    "https://www.legion.org/member-services/discount-center",
    "https://www.legion.org/about/media-toolkits",
    "https://www.legion.org/advocacy",
    "https://www.legion.org/terms-and-conditions",
    "http://www.legion.org/",
    "http://www.legion.org/contact/legislative",
    "https://www.legion.org/information-center/training",
    "http://www.legion.org/contact/customer-service",
    "https://www.legion.org/get-involved/youth-programs/junior-shooting-sports",
    "https://www.legion.org/information-center/news/community/2025/april/post-using-bbq-competition-to-raise-money-for-vcf",
    "https://www.legion.org/advocacy/be-the-one/be-the-one-training",
    "https://www.legion.org/get-involved/meetings",
    "https://www.legion.org/information-center/news/community/2025/april/posts-opening-up-their-doors-to-communities-on-american-legion-family-day",
    "https://www.legion.org/member-services",
    "https://www.legion.org/about/leadership/nationalcommander",
    "https://www.legion.org/member-services/veterans-services/veterans-benefits/find-a-veteran-service-officer",
    "https://www.legion.org/advocacy/youth-support",
    "https://www.legion.org/member-services/membership-standings",
    "http://www.legion.org/contact/internal-affairs",
    "https://www.legion.org/information-center/news/membership/2025/september/august-impact-champions-crowned-convention-conducted-and-an-sal-milestone-reached",
    "https://www.legion.org/about",
    "https://www.legion.org/advocacy/be-the-one/be-the-one-resources-and-media",
    "https://www.legion.org/get-involved/youth-programs/baseball",
    "https://www.legion.org/about/leadership/national-vice-commanders",
    "https://www.legion.org/member-services/resources",
    "http://www.legion.org/contact/media-communications",
    "https://www.legion.org/about/organization",
    "http://www.legion.org/about/organization/national-alliances/army-navy-game",
    "https://www.legion.org/privacy-policy",
    "http://www.legion.org/contact/americanism",
    "http://www.legion.org/information-center",
    "https://www.legion.org/information-center/calendar",
    "http://www.legion.org/contact/mylegion-support",
    "https://www.legion.org/contact",
    "http://www.legion.org/contact/media-relations",
    "https://www.legion.org/advertise",
    "https://www.legion.org/advocacy/be-the-one",
    "https://www.legion.org/ada-compliance",
    "https://www.legion.org/get-involved",
    "http://www.legion.org/member-services/veterans-services/veterans-benefits/find-a-veteran-service-officer",
    "https://www.legion.org/get-involved/youth-programs/boys-state-boys-nation",
    "https://www.legion.org/information-center/news/community/2025/june/post-stepping-up-to-assist-community-following-flooding",
    "https://www.legion.org/get-involved/community-programs",
    "https://www.legion.org/sitemap",
    "https://www.legion.org/about/american-legion-family",
    "https://www.legion.org/renew",
    "https://www.legion.org/about/leadership/constitutional-officers",
    "https://www.legion.org/",
    "https://www.legion.org/join",
    "https://www.legion.org/information-center/news/community/2025/may/post-student-veterans-of-america-chapter-team-with-others-to-assist-korean-war-veteran",
    "https://www.legion.org/information-center/news/community/2025/may/fledgling-post-making-an-impact-on-local-veterans-community",
    "https://www.legion.org/information-center/in-the-media",
    "https://www.legion.org/information-center/in-the-media/tango-alpha-lima-guest-nomination",
    "https://www.legion.org/information-center/news/community/2025/april/auxiliary-unit-leading-month-of-the-military-child-observance",
    "http://www.legion.org/contact/charitable-giving",
    "https://www.legion.org/get-involved/scholarships",
    "http://www.legion.org/contact/finance",
    "http://www.legion.org/contact/veterans-affairs-rehabilitation",
    "https://www.legion.org/information-center/news/security/2025/september/nato-says-its-making-process-on-catching-up-to-russian-war-machine",
    "https://www.legion.org/member-services/veterans-services/veterans-education",
    "https://www.legion.org",
    "http://www.legion.org/contact/national-security",
    "https://www.legion.org/information-center/honor-remembrance",
    "https://www.legion.org/information-center/news/honor/2025/september/family-connections-sought-for-wwii-cemetery-in-the-netherlands",
    "https://www.legion.org/advocacy/national-affairs",
    "https://www.legion.org/information-center/news/community/2025/august/new-york-legionnaire-to-compete-in-mrs-america",
    "http://www.legion.org/contact/human-resources",
    "https://www.legion.org/information-center/news/planned-giving/2025/september/helping-children-tomorrow"
  ],
  "candidate_links": [
    "https://www.legion.org/information-center/news/community/2025/july/post-provides-hope-support-amidst-tragedy-of-texas-flooding",
    "https://www.legion.org/about/leadership",
    "http://www.legion.org/contact/internal-affairs/regional-contacts",
    "https://www.legion.org/information-center/news/community/2025/june/posts-legion-family-continues-to-provide-vital-support-for-local-veterans-cemetery",
    "https://www.legion.org/advocacy/be-the-one/be-the-one-training",
    "https://www.legion.org/member-services",
    "https://www.legion.org/advocacy/youth-support",
    "https://www.legion.org/member-services/membership-standings",
    "https://www.legion.org/about",
    "https://www.legion.org/get-involved/youth-programs/baseball",
    "https://www.legion.org/about/leadership/national-vice-commanders",
    "https://www.legion.org/contact",
    "https://www.legion.org/renew",
    "https://www.legion.org/about/leadership/constitutional-officers",
    "https://www.legion.org/information-center/news/community/2025/may/post-student-veterans-of-america-chapter-team-with-others-to-assist-korean-war-veteran",
    "https://www.facebook.com/americanlegionhq"
  ],
  "visited": [
    "http://www.legion.org/",
    "http://www.legion.org/about",
    "http://www.legion.org/contact",
    "http://www.legion.org/staff",
    "http://www.legion.org/team",
    "http://www.legion.org/board",
    "http://www.legion.org/directory",
    "http://www.legion.org/events",
    "http://www.legion.org/sitemap.xml",
    "http://www.legion.org/council",
    "http://www.legion.org/leadership",
    "http://www.legion.org/management",
    "http://www.legion.org/producers",
    "http://www.legion.org/support",
    "http://www.legion.org/crew",
    "http://www.legion.org/members",
    "http://www.legion.org/bios",
    "http://www.legion.org/people",
    "http://www.legion.org/artists",
    "http://www.legion.org/musicians",
    "http://www.legion.org/faculty",
    "http://www.legion.org/administration",
    "https://www.legion.org/information-center/news/community/2025/july/post-provides-hope-support-amidst-tragedy-of-texas-flooding",
    "https://www.legion.org/about/leadership",
    "http://www.legion.org/contact/internal-affairs/regional-contacts",
    "https://www.legion.org/information-center/news/community/2025/june/posts-legion-family-continues-to-provide-vital-support-for-local-veterans-cemetery",
    "https://www.legion.org/advocacy/be-the-one/be-the-one-training",
    "https://www.legion.org/member-services",
    "https://www.legion.org/advocacy/youth-support",
    "https://www.legion.org/member-services/membership-standings",
    "https://www.legion.org/about",
    "https://www.legion.org/get-involved/youth-programs/baseball",
    "https://www.legion.org/about/leadership/national-vice-commanders",
    "https://www.legion.org/contact",
    "https://www.legion.org/renew",
    "https://www.legion.org/about/leadership/constitutional-officers",
    "https://www.legion.org/information-center/news/community/2025/may/post-student-veterans-of-america-chapter-team-with-others-to-assist-korean-war-veteran",
    "https://www.facebook.com/americanlegionhq"
  ],
  "base_url": "http://www.legion.org/"
}