{
  "pages": [
    {
      "url": "https://www.lessings.com/corporate/about#contact_us",
      "is_candidate": false,
      "has_email": true,
      "text": "Google Tag Manager (noscript)\nEnd Google Tag Manager (noscript)\nSkip to Main Content\nGo to Accessbility Settings\nTo Shop Lessing’s Gift Cards,\nclick here\nmenu\nABOUT\nOur Mission\nOur Company\nOur People\nOur Story\nIn the News\nAwards\nJoin Our Team\nContact Us\nWEDDINGS\nEvents\nSeasonal Events\nWedding Showcases\nExclusives & Packages\nLocations\nNew Venues\nLong Island\nNYC - Westchester\nFlorida\nRESTAURANTS\nEvents\nSeasonal Events\nLocations\nLong Island\nNew York City\nFlorida\nCountry Clubs\nPopup Kitchens\nCountry Clubs\nGrill Room at Timber Point\nThe Bethpage Public House\nThe Grill Room at West Sayville\nThe Turn at Port Jefferson\nThe Terrace at 360 East\nOFF‑PREMISE\nNew York\nEast End\nBrecknock Hall\nMontauk Manor\nParrish Art Museum\nPeconic River Herb Farm\nPindar Vineyards\nSalt Air Farm\nLong Island\nParks and Picnics\nThe Bates House\nVanderbilt\nUpstate New York\nKindred Creeks Farm\nNew York City\n630 Second\nCentral Park\nF. Ottomanelli By The Water\nGolf & Body\nHammerstein Ballroom\nMetropolitan Pavilion\nMidtown Loft\nPenn Plaza Pavilion\nRamscale Studio\nStudio 450\nStudio 525\nThe Altman Building\nThe Pillars\nUkrainian Institute\nFlorida\n5 Star Hospitality\nLessing's Events\nConnecticut\nThe Knowlton\nPRIVATE EVENTS\nEvent Spaces\nLong Island\nNYC-Westchester\nFlorida\nRestaurants\nLong Island\nNew York City\nFlorida\nFOOD SERVICE\nMANAGEMENT SERVICES\nEMERGENCY DINING\nHOTEL\nHOME\nABOUT\nWEDDINGS\nRESTAURANTS\nOFF PREMISE CATERING\nPRIVATE EVENTS\nFOOD SERVICE\nMANAGEMENT SERVICES\nEMERGENCY DINING\nHOTEL\nGIFT CARDS\nREWARDS\nSITE MAP\nCONTACT\nnavigate_before\npause_circle_filled\nnavigate_next\nOUR MISSION\nOUR CORE VALUES\nOUR COMPANY\nOUR PEOPLE\nOUR STORY\nIN THE NEWS\nAWARDS\nJOIN OUR TEAM\nCONTACT US\nOUR MISSION\nLessing's... A Legacy of Remarkable Hospitality.\nTo continue our 135-year tradition of innovation and excellence - providing unique restaurant concepts, exclusive wedding venues, distinctive catering, and skillfully executed food service management.\nOUR CORE VALUES\nGrowth:\nLearning sparked by curiosity drives our passion for continuous improvement.\nInnovation:\nWe challenge the status quo with forward-thinking, and constantly adapt to ever-changing demands.\nDiversity:\nWe seek, welcome, and respect diverse perceptions, backgrounds, and experiences.\nHospitality:\nRemarkable actions create memorable experiences.\nIntegrity:\nWe are genuine people guided by morals.\nLegacy:\nHonoring the traditions of our past, we build the legacy of our future.\nOUR COMPANY\nLessing’s Hospitality Group is comprised of over 100 locations throughout the Northeast and Florida. Lessing’s operates 23 wedding and catering venues, 16 full-service restaurants, over 75 corporate and academic dining centers, a historic inn, and a presidential yacht. Steeped in 135 years of tradition, Lessing’s Hospitality Group’s focus is on providing each guest and client with unique, personalized experiences and remarkable hospitality.\nOUR PEOPLE\nStephen M Lessing\nChairman\nMichael Lessing\nChief Executive Officer\nJohn Lessing\nSenior Advisor\nScott McKelvey\nChief Financial Officer\nLawrence Lessing\nChief Operating Officer\nEllen Barrett\nExecutive Vice President\nHuman Resources\nMark Lessing\nExecutive Vice President\nRestaurants\nJohn S. Lessing Jr.\nExecutive Vice President\nFacilities & Maintenance\nKevin Lessing\nExecutive Vice President\nLFSM Group\nHolly Lynch\nVice President of Finance\nSteve Kirschbaum\nVice President of Catering\nNortheast\nMichele Palischak\nVice President of Catering\nSouth Florida\nGrant Lieberman\nVice President of Technology\nPeter Lessing\nDirector of System Analytics\nDavid Lessing\nDirector of Business Development\nGuy Reuge\nChef Emeritus Senior Advisor\nWilliam Muzio\nCorporate Executive Chef\nRestaurants\nEddie Michaels\nCorporate Executive Chef\nCatering\nOUR STORY\nA FAMILY OF INNOVATORS (1890-1940)\nThe oldest family-owned, continuously operated, highly diverse food service company in the United States is Lessing’s Hospitality Group in Great River, New York. The company was founded by Maxwell Lessing in 1890 and is operated to this day by 15 family members representing six generations of Lessing's. This highly diversified company feeds more than 40,000 guests a day at over 120 corporate, educational, country club and manufacturing plant locations throughout the Northeast and Florida. Lessing’s Hospitality Group also operates 23 high-end wedding and catering venues, 1 nightclub, 16 full service restaurants, 3 virtual kitchens, and a historic inn. The Lessing family has provided food service to New Yorkers for 135 years without interruption. Both the longevity and the success of this legacy company is unprecedented, especially in the food service and restaurant business.\n\"I decided to see if I could discover the secret to this family's success. What was it about the Lessing clan that set them apart from countless other restaurant companies that have come and gone from the food service scene? One hundred and thirty years in business is remarkable enough, but to have the same family operate the company the entire time is unheard of. My research into the company's history revealed the secret immediately.\"\nTHE LUNCH COUNTER\nMaxwell Lessing was an innovator. He responded to the explosion of the urban worker population in the 1890's by opening the first convenient lunch counter in New York's Financial District. For the first time in American history, workers who lived in boarding houses that supplied meals left home to go to work, forsaking one of their free meals. They had little time and less money for lunch. In addition, women were joining the work force in droves during this era and began to patronize places they once dared not enter, climbing onto lunch counter stools and venturing into cafes in the evening without escorts.\nBy 1893 the country had slipped into a severe four-year recession, and the self-service lunches available in saloons on the honor system began to suffer an enormous amount of theft. One after another, saloon owners were forced to eliminate these lunches. Maxwell again saw their setback as his opportunity, and he responded by expanding his low-price, pay-as-you-go lunch counter operation to multiple locations in office buildings around Wall Street.\nTHE COMMISSARY\nThen, he innovated again. With multiple locations to service, Maxwell established a commissary on Jones Lane close to his lunch counters in the Wall Street area. From the commissary he would prepare baked goods, sliced meats, salads, soups and hot foods to deliver to his locations and serve the long lines of office workers, who were rapidly running out of places to eat. Maxwell's commissary on Jones Lane was the first multi-unit restaurant commissary in the United States.\nTHE SANDWICH\nThe commissary concept was an innovation well before its time and led to another innovation that would become an American food staple - the sandwich. Maxwell didn't invent the sandwich, but Lessing’s Hospitality Group was the first company to serve sandwiches at lunch counters in New York City. Workers could either eat them at the lunch counters or take them away and enjoy them on a park bench or back in the quiet of their office.\nTHE COKE\nGreat innovators not only create innovative products, but also recognize innovation when they see it. Dr. Pemberton, perhaps one of the greatest innovators of all time, created Coca-Cola in 1886. In 1890, Asa G. Candler, the legendary President of the Coca-Cola Company, began to distribute coke syrup to soda fountains outside Atlanta. Maxwell Lessing was the first New York restaurateur to buy Coca-Cola syrup and serve Coke to his customers. The introduction of both the sandwich and the Coke by one small lunch counter operator in 1890's New York was an almost unimaginable great leap forward in food service.\nAccording to a New York Public Library exhibit on New York culture,\n\"of the three meals that mark the American day, lunch is the one that acquired its modern identity here on the streets of New York.\"\nTHE 1920'S\nThe 1920's is an important decade in Lessing history as it marked the birth of the modern restaurant industry. Maxwell had incorporated Lessing’s Hospitality Group in 1917 and was joined in the business by his son, Lawrence, in the 20's. The advent of national prohibition stripped away liquor profits, shifting emphasis to low-price, high volume food service. More people ate out than ever before. Famous pre-war restaurants closed, while cafeterias, luncheonettes and tearooms thrived.\nTHE LOCATION\nBy the late 1920's, Lessing’s Hospitality Group was serving meals to New York's workforce in as many as 20 locations, thanks to Lawrence's  great innovation.  He strategically acquired lunch counter space in the lobbies of newly constructed office buildings, among them the lunchrooms at 1 Broadway, 40 Wall Street, The Woolworth Building (at the time the tallest building in the world), the Equitable Building at 120 Broadway and The New York Stock Exchange.  It was the fulfillment of the now famous restaurant chain mantra, LOCATION-LOCATION-LOCATION. Ray Kroc took the words right out of Lawrence's mouth.\nCONTRACT FOOD SERVICE\nIn 1928, American Cable and Wireless decided to include an employee cafeteria in their new office building. Providing employees with a cafeteria was an innovation in itself in 1928, however Lawrence’s vision trumped even the cafeteria idea. Already operating a nascent multi-unit food service operation out of the Lessing’s Hospitality Group commissary on Jones Lane, he presented American Cable with a proposition. Rather than American Cable executives having to manage a large cafeteria with all the headaches inherent in such an operation, Lessing’s Hospitality Group would manage it for them on a contract basis. For a fee, Lawrence and his staff would take care of everything. With that one creative impulse, the contract food service industry was born in New York City. The Lessing innovation gene had struck again, and Lessing’s Hospitality Group was off and running in an entirely new industry.\nRESTAURANT CHAIN\nBy the 1930's, retail stores saw the wisdom in the conveniently located lunch counter and decided to get into the act. The lunch counter business exploded in dense urban centers, giving rise to iconic restaurant chains such as Schrafft's, Childs, Horn & Hardart, Lofts' and Bickford's. It is worth noting that of all these famous restaurant chains, only Lessing’s Hospitality Group is still in business.\nTHE WAR YEARS\nWith the Japanese attack on Pearl Harbor in 1941, New York City was transformed into the metropolitan hub of America's massive war effort. Every inch of office space in the buildings around Wall Street, where the Lessing’s Hospitality Group chain of coffee shops was located, was given over to the war effort in one way or another. In a laboratory at Columbia University, Enrico Fermi began work on atomic particles that led to the top-secret development of the atomic bomb, called the Manhattan Project. This work on uranium enrichment took place in secret offices located in the Woolworth building above the Lessing’s Hospitality Group coffee shop. Across the Brooklyn Bridge, the Pfizer Company converted an enormous ice plant into history's first penicillin factory and began the wartime manufacture of their life-saving discovery. The Brooklyn Navy Yard quickly became the world's largest shipbuilding facility, employing more than 75,000 people by 1942. The port of New York became the primary point of embarkation for the millions of U.S. soldiers shipped overseas to the war zone. Between 1942 and 1945, 1.86 million New Yorkers themselves joined the armed forces.\nLawrence responded to New York's exploding demand to feed millions of non-combatant wartime support personnel by rapidly expanding the company's coffee shop locations to five additional buildings in lower Manhattan and doubling the commissary staff on Jones Lane. Like so many other iconic American companies who responded to wartime demand, Lessing’s Hospitality Group emerged from the war a more substantial and professional company prepared to thrive during the post war economic boom that would engulf the nation.\nLAWRENCE LESSING JR.\nThe \"Happy Days\" of the 1950's were the perfect setting for Lawrence's innovative personality. Prior to the rise of American consumerism brought on by World War II, small businessmen saw themselves as humble shopkeepers. They were good at working hard tending to the nuts and bolts of their businesses. Small food service operators were usually good in the kitchen and rarely stepped out from behind the counter to embrace the bigger picture. Lawrence, however, saw the potential of making connections with the movers and shakers of the industries booming around him. He decided to leave the day to day operations to trusted employees while he told the Lessing story to decision makers who could use Lessing’s expertise but didn't know it yet. This innovative change in the role of the humble shopkeeper transformed Lessing from a little lunch counter operator into a highly regarded food service contractor. He called on every company executive who would listen, and before long Lessing’s Hospitality Group began to handle the food service for America's corporate giants like New York Trust, Chemical Bank, Reynolds & Co., Smith Barney, Goldman Sachs, Regis Paper and the New York Stock Exchange.\nTHE NEXT GENERATION\nBecause of Lawrence's success in making Lessing’s Hospitality Group a well-known name in food service management, the company was becoming a far more substantial and complex firm by the end of the 1950's. It was time for the next generation of Lessings to step up and guide the company into the modern age. Lawrence's son John, known as Jack, joined the company in 1958 and John's brother Lawrence III, known as Larry, followed a year later. Inspired by their father's love of the business, and with the Lessing gene working its particular magic, the brothers adopted very different roles in guiding Lessing’s Hospitality Group. Jack, like his father, was an expansive visionary who could connect with the wide variety of constituents that Lessing’s Hospitality Group now served, while Larry put his orderly logical mind to the task of managing the now highly complex, day-to-day business.\nTHE 1960'S AND 70'S\nThe 60's and 70's were very difficult for food service in the New York metropolitan area. For the first time in history, the population of New York City began to decline. Wartime industries either closed or moved to more economic locations. The New York City economic boom created by the war and the immediate post war period had created formidable competition. Companies such as Schrafft's, Child's, Savarin, Horn and Hardart and Stouffer's were all competing for both the coffee shop and the food service management dollar. The Wall Street banks would suffer two major recessions, and an industry reorganization moved most of the corporate headquarters' employees away from Wall Street. Culinary unions were ascendant during this period, and they eventually organized the Lessing bakers at 155 West 19th Street. The food service boom had ended, and the decades of the 60's and 70's would challenge the Lessing brothers to find new methods and new markets in which to do business.\nCITY MOUSE - COUNTRY MOUSE\nMillions of Americans followed Abraham Levitt's lead and moved to the suburbs in the 1950's. Living in Islip, Long Island, the Lessings were no strangers to the suburbs. Therefore, it was natural for them to expand their business beyond their Wall Street operations. They signed food service management contracts to feed Maxson Electronics, American Airlines, Michelin Tire and Great American Insurance Co. These strategic moves would change the face of their business and prove to be the salvation of the company. Jack and Larry successfully combined strategic thinking, aggressive marketing and careful management of detail to guide Lessing’s Hospitality Group through the two most difficult economic decades in modern food service history. As Manhattan became a more competitive market, the brothers expanded the company to the suburbs and continued the transformation of their company from a local chain of office building lunch counters to a regional food service management powerhouse. Another instinctive choice by the next generation of Lessings kept the company growing and thriving when others had failed.\nDIVERSIFICATION (1980 - PRESENT)\nTight-knit Irish clans are often guided by an invisible hand. When I asked Jack, the Chairman of Lessing’s Hospitality Group, when the family first got into the retail restaurant business he answered, \"It wasn't until 1977. My mother, a devout Irish Catholic, never wanted the family to sell liquor.\"\nBut in 1977, a friend of Jack's told him that the only bar in Breezy Point (the now world-famous New York Irish police and fireman's community destroyed in Hurricane Sandy) was for sale. The Bay Terrace Bar was the only pub in a community of 3,800 homes occupied by New York's firefighters and policemen. \"It was a gold mine,\" Jack said. \"We used to sell 250 cases of beer on a Saturday night. That was a lot of beer in 1977.\" He was hooked. The family began to diversify beyond contract food service into the retail restaurant business at just the right time.\nContract food service, a business that Lessing’s Hospitality Group had originated and built for 40 years, was becoming a commodity business by the late 1970s. Once the industry saw the food service market niche that Lessing’s Hospitality Group had created, everyone got into the business. Big corporations like Servomation and the Canteen Corporation joined hundreds of small independent contractors in increasing competition, until there were 8 or 9 bids submitted on every account. \"Our B&I business was still strong because our customers were loyal, but it became harder and harder to make a profit in contract food service,\" Jack said. He saw how the cash flow from the Bay Terrace Bar could supplement the reliable but slim margins in contract food service, so he began to diversify into retail restaurants.\nTHE MAIN STREET INNOVATION\nPrior to the 1980s, restaurant chains were not well received on Long Island, so few national chains bothered to open units in one of the nation's most densely populated suburbs. Long Islanders seemed to gravitate more towards local restaurants. The Lessings knew that any restaurant they opened must feel like a \"local joint\". They watched the success of the Bay Terrace Bar and waited for the Lessing innovation impulse to kick in. Eventually, they decided to open cafes that would serve the local clientele along Montauk Highway, the road that had become the Main Street of Long Island's South Shore villages. They would locate them in historic town buildings that the long-time residents were familiar with. In 1978, the Lessings opened their first Main Street restaurant in the historic post office building that had served the town of Babylon for many years. The Post Office Café quickly came to be considered a local place Babylon customers felt comfortable and at home in, and it has been going strong ever since.\nEXPANSION\nBy the 1980s, the Main Streets along Long Island's South Shore were becoming gentrified by the growth of more modern shopping centers opening on Sunrise Highway.\nWith the Post Office Café booming, the Lessings migrated east along Montauk Highway to the little town of Bay Shore and opened their second Main Street Restaurant in the town's original fire house. The youth of Suffolk County instantly made the Firehouse the most popular young club on all of Long Island. Thirty years later the Lessings purchased the historic Southside Hotel, Bay Shore's original \"local joint\" across the street from the Firehouse.\nHistory will record that Lessing’s Hospitality Group’s “Main Street restaurant” concept ignited a revival movement that has brought these historic Long Island Main Streets back to life.\nWhen the original library closed in Farmingdale, Long Island, the Lessings bought the building and opened another Main Street restaurant, the Library Café. Each restaurant's success drove the Lessings along the same strategic path – find and purchase historic Long Island buildings that were icons to the local clientele. They opened Maxwell's on Main Street in Islip and bought the Huntington landmark, Finnegan's, perhaps the most \"local\" of all their Main Street pubs and cafés.\nCONCESSIONS\nDuring the 1970s and 80s, Lessing’s Hospitality Group was also operating over 100 concession locations at state, county and town parks from Montauk to Long Beach. They were the biggest picnic caterers in the state, at times feeding as many as 10,000 people. They operated the concessions at the now legendary Hecksher State Park, Eisenhower Park, Bethpage State Park, Sunken Meadow and Tobay Beach.\nFINE DINING\nIn the 90s, the Lessings made another strategic decision when they began operating the most historic and iconic building of all, the Three Village Inn in Stony Brook, Long Island. Built in 1751, the Three Village Inn had served as a summerhouse, a Women's Exchange, a simple tearoom and a fine country inn. In this historic location, the Lessings expanded beyond their pub and cafe style Main Street restaurants to enter the fine dining segment with their now famous Mirabelle Restaurant & Tavern.\nCOMBINING INNOVATIONS\nThe Saxon Arms restaurant in Oakdale enjoyed the best waterfront view of the Great South Bay anywhere on Long Island. Lessing’s Hospitality Group bought this local favorite, changed the name to (what else?) View, refurbished the building and the menu and now operates the most popular dockside restaurant on Long Island's South Shore.\nCATERING\nThe insight to appeal to local tastes by instantly becoming part of the local cultural heritage was a brilliant innovation. During the 1990s, the Lessings began a rapid expansion into the catering business by utilizing the same innovative instinct that served them so well in retail restaurants.\nLong Island was comprised of rural farms and small seaport villages until the turn of the 20th century, when the great family fortunes created by the industrial revolution built vast estates on Long Island. More than 1,200 grand estates were built along the North Shore's \"Gold Coast\" of Great Gatsby fame. Many of these mansions remain in existence throughout Long Island to this day.\nBy the 1950s, grand-estate living was going out of style, and many of the mansions were turned over to colleges, charities and religious orders. Knowing that these estates were considered the best addresses in many local towns and villages, the Lessings decided to lease, license, or buy them for catering locations. What local bride would not want to be married in the grandest estate house in her village?\nLessing’s Hospitality Group now offers Long Island brides the opportunity to hold their wedding reception at Bourne Mansion, Whitby Castle, Chateau at Coindre Hall, Mansion at Timber Point, Mansion at West Sayville, The Vineyards in Aquebogue and Estate at Three Village Inn, to name just a few. These iconic locations have become so popular that Lessing’s Hospitality Group now caters more than 1,000 weddings a year.\nIN THE PRESENT\nFrom the beginning, Maxwell Lessing set out to be a trailblazer in the food and beverage industry.  Today Lessing’s Hospitality Group continues to be an industry leader, and the company is still managed by the present generation of Lessings, who carry out Maxwell’s legacy every day. Most recently, Lessing's has expanded  their portfolio to Florida, with the Crane Club at Tesoro, Charlie & Joe's at Love Street and now, New York City with Ellen's Stardust Diner & The Iridium.\nAUTHOR'S NOTE\nIn this history I have attempted to reveal the secrets of longevity and consistency that enabled Lessing’s Hospitality Group to survive and thrive for 135 years in the world's most competitive food service market. How did each generation attract the next generation into the business? How did they survive ever-changing tastes, a volatile commodity market, two world wars, the Great Depression and the Great Recession, inevitable family squabbles, an increasingly contentious legal environment and stiff competition from well-financed public companies? What was the magic?\nEach Lessing generation, from Maxwell to the present, never took survival for granted. They responded to changing market conditions with CREATIVE INNOVATION.\nAuthor, Francis Bennett, freelance writer\nIN THE NEWS\nHealthy Eating: Long Island hospitals provide food for life\nLong Island Business News announces 2025 Icon Honors\nLIBN: Après the pandemic: restaurants going full steam ahead\nPalm Beach North Podcast: Building a Legacy: Michael Lessing On Six Generations of Hospitality\nIn The Lead: Family Owned Businesses\nLong Island Restaurant Week begins Sunday\nLes Paul Remembered In Exhibit Opening Monday\nThese LI restaurants rank among world’s best for wine: Wine Spectator\nHidden Gems: Meet Lawrence Lessing of Lessing’s Hospitality Group\nLessing's Hospitality Group: Catering Remarkable Hospitality Services through Tailored Packages\nDO GOOD\nCharlie & Joe’s delivers 6,800 pantry boxes to needy\nBlaze Pizza donates pizzas to Good Samaritan\nNewsday - Healthcare Worker Discounts\nGreater Long Island - Lessing's Donates 5,000 Meals\nLong Island Restaurant News - Spread The Cheer\nSustainable Brands - Hatch DoGood Pancakes\nLI Restaurant News - Veterans Day\nGreater Long Island - Lessing's Gives Back On Veterans Day\nLIBN - Hospitality Group Gives Back on Veterans Day\nLong Island Press - Lessing's Helps FCA Celebrate 135 Years\nGreater Long Island - Lessing's Helps FCA Celebrate 135 Years\nPatch - Creek Cleanup\nLIBN - Creek Cleanup\nNewsday - Creek Cleanup\nStony Brook Creek Cleanup Video Footage\nGreater Long Island - Stony Brook Creek Cleanup\nTotal Food Service - Lessing's Hospitality Group Takes Initiative to \"Do Good\" for Earth Day\nThe List Magazine - Lessing's is Doing Good\nNewsday - Working to Ease Long Island Hunger\nBrentwood-Central Islip Patch - Lessing's Hospitality Group Launces \"Do Good\" Initiative\nAWARDS\nJOIN OUR TEAM\nA leader in the hospitality industry since 1890, Lessing's Hospitality Group offers many possibilities for employment and advancement.\nApply today.\nLink to database - <ul><p>No careers have been posted at this time.</p></ul>\nCONTACT US\nCorporate Headquarters\n3500 Sunrise Highway\nBldg 100, Suite 100\nGreat River, NY 11739\n631.567.8200\nSend Email\nNew York City Office\n950 3rd Avenue\nFloor 16\nNew York, NY 10019\n212.764.3450\nSend Email\nFlorida Office\n825 S US Highway 1\n2nd Floor, Suite 230\nJupiter, FL 33477\n561.768.9118\nSend Email\nSITE MAP\nCONTACT\nPRIVACY STATEMENT\nTERMS OF USE\nTERMS FOR ONLINE PURCHASES\nACCESSIBILITY\n<li><a href=\"https://twitter.com/lessingsinc\" target=\"_blank\"><img src=\"https://www.lessings.com/corporate/webimages/_core/s_social_icon_twitter.png\" alt=\"Twitter\" /></a></li>\n© 2025 Lessing's Hospitality Group. All rights reserved.\nkeyboard_arrow_up\narrow navigation\nscroll to top\nfixed box\nset submenus for WCAG",
      "emails": [
        "info@lessings.com"
      ]
    },
    {
      "url": "https://www.lessings.com/corporate/contact",
      "is_candidate": false,
      "has_email": true,
      "text": "Google Tag Manager (noscript)\nEnd Google Tag Manager (noscript)\nSkip to Main Content\nGo to Accessbility Settings\nTo Shop Lessing’s Gift Cards,\nclick here\nmenu\nABOUT\nOur Mission\nOur Company\nOur People\nOur Story\nIn the News\nAwards\nJoin Our Team\nContact Us\nWEDDINGS\nEvents\nSeasonal Events\nWedding Showcases\nExclusives & Packages\nLocations\nNew Venues\nLong Island\nNYC - Westchester\nFlorida\nRESTAURANTS\nEvents\nSeasonal Events\nLocations\nLong Island\nNew York City\nFlorida\nCountry Clubs\nPopup Kitchens\nCountry Clubs\nGrill Room at Timber Point\nThe Bethpage Public House\nThe Grill Room at West Sayville\nThe Turn at Port Jefferson\nThe Terrace at 360 East\nOFF‑PREMISE\nNew York\nEast End\nBrecknock Hall\nMontauk Manor\nParrish Art Museum\nPeconic River Herb Farm\nPindar Vineyards\nSalt Air Farm\nLong Island\nParks and Picnics\nThe Bates House\nVanderbilt\nUpstate New York\nKindred Creeks Farm\nNew York City\n630 Second\nCentral Park\nF. Ottomanelli By The Water\nGolf & Body\nHammerstein Ballroom\nMetropolitan Pavilion\nMidtown Loft\nPenn Plaza Pavilion\nRamscale Studio\nStudio 450\nStudio 525\nThe Altman Building\nThe Pillars\nUkrainian Institute\nFlorida\n5 Star Hospitality\nLessing's Events\nConnecticut\nThe Knowlton\nPRIVATE EVENTS\nEvent Spaces\nLong Island\nNYC-Westchester\nFlorida\nRestaurants\nLong Island\nNew York City\nFlorida\nFOOD SERVICE\nMANAGEMENT SERVICES\nEMERGENCY DINING\nHOTEL\nHOME\nABOUT\nWEDDINGS\nRESTAURANTS\nOFF PREMISE CATERING\nPRIVATE EVENTS\nFOOD SERVICE\nMANAGEMENT SERVICES\nEMERGENCY DINING\nHOTEL\nGIFT CARDS\nREWARDS\nSITE MAP\nCONTACT\nnavigate_before\npause_circle_filled\nnavigate_next\nCorporate Headquarters\n3500 Sunrise Highway\nBldg 100, Suite 100\nGreat River, NY 11739\n631-567-8200\nSend Email\nNew York City Office\n950 3rd Avenue\n16th Floor\nNew York, NY 10019\n212-764-3450\nSend Email\nFlorida Office\n825 S US Highway 1\n2nd Floor, Suite 230\nJupiter, FL 33477\n561-768-9118\nSend Email\nWedding Venues\n360° East at Montauk Downs\nMontauk, New York\n631-483-5025\nSend Email\n5 Star Hospitality\nPalm Beach Gardens, Florida\n561-719-4317\nSend Email\n630 Second Avenue\nNew York, New York\n631-484-5209\nSend Email\nBourne Mansion\nOakdale, New York\n631-277-7800\nSend Email\nChateau at Coindre Hall\nHuntington, New York\n631-751-0339\nSend Email\nCrane Club at Tesoro\nPort St. Lucie, Florida\n772-200-2662\nSend Email\nEssex Club\nBrentwood, New York\n631-524-5502\nSend Email\nEstate at Three Village Inn\nStony Brook, New York\n631-751-0339\nSend Email\nF. Ottomanelli By The Water\nLong Island City, New York\n516-921-5707\nSend Email\nHarmony Vineyards\nSt. James, New York\n631-484-5209\nSend Email\nHeritage Club at Bethpage\nFarmingdale, New York\n516-927-8380\nSend Email\nHoney Fitz\nJupiter, Florida\n561-693-5063\nSend Email\nJewish Theological Seminary\nNew York, New York\n212-678-8822\nSend Email\nKravis Events\nWest Palm Beach, Florida\n561-651-4444\nSend Email\nLady Jean Ranch\nJupiter, Florida\n561-745-1300\nSend Email\nLessing's Events\nWest Palm Beach, Florida\n631-335-0432\nSend Email\nMansion at Timber Point\nGreat River, New York\n631-581-0022\nSend Email\nNorth Palm Beach Country Club\nNorth Palm Beach, Florida\n561-691-3431\nSend Email\nPavilion at Sunken Meadow\nKings Park, New York\n631-269-6850\nSend Email\nPelican Club\nJupiter, Florida\n561-693-5063\nSend Email\nPort Jefferson Country Club\nPort Jefferson, New York\n631-473-1440\nSend Email\nStonebridge Country Club\nSmithtown, New York\n631-656-6899\nSend Email\nTemple Chaverim\nPlainview, New York\n516-779-1930\nSend Email\nThe Barn at Old Bethpage\nOld Bethpage, New York\n516-921-5707\nSend Email\nThe Mansion at Oyster Bay\nWoodbury, New York\n516-921-5707\nSend Email\nThe Mansion at West Sayville\nWest Sayville, New York\n631-589-0022\nSend Email\nThe Vineyards at Aquebogue\nAquebogue, New York\n631-722-3200\nSend Email\nWeddings at Bayberry\nIslip, New York\n631-210-0011\nSend Email\nWeddings at View\nOakdale, New York\n631-589-2694\nSend Email\nWhitby Castle\nRye, New York\n914-777-2053\nSend Email\nRestaurants\nBayberry\nIslip, New York\n631-210-0011\nSend Email\nEllen's Stardust Diner\nNew York, New York\n212-956-5151\nSend Email\nFinnegan's\nHuntington, New York\n631-423-9696\nSend Email\nGoldy's Gems\nBay Shore, New York\n631-665-9596\nSend Email\nIridium\nNew York, New York\n212-582-2121\nSend Email\nLibrary Café\nFarmingdale, New York\n516-752-7678\nSend Email\nLucky Shuck\nJupiter, Florida\n561-532-3331\nSend Email\nMirabelle Tavern\nStony Brook, New York\n631-751-0555\nSend Email\nPost Office Café\nBabylon, New York\n631-669-9224\nSend Email\nSandbar\nCold Spring Harbor, New York\n631-498-6188\nSend Email\nThe Beacon\nJupiter, Florida\n561-532-3280\nSend Email\nThe Clubhouse at North Palm Beach\nNorth Palm Beach, Florida\n561-691-3430\nSend Email\nThe Tacklebox\nJupiter, Florida\n561-532-3332\nSend Email\nTopside at the Beacon\nJupiter, Florida\n561-532-3270\nSend Email\nView\nOakdale, New York\n631-589-2694\nSend Email\nWeddings at Bayberry\nIslip, New York\n631-210-0011\nSend Email\nSITE MAP\nCONTACT\nPRIVACY STATEMENT\nTERMS OF USE\nTERMS FOR ONLINE PURCHASES\nACCESSIBILITY\n<li><a href=\"https://twitter.com/lessingsinc\" target=\"_blank\"><img src=\"https://www.lessings.com/corporate/webimages/_core/s_social_icon_twitter.png\" alt=\"Twitter\" /></a></li>\n© 2025 Lessing's Hospitality Group. All rights reserved.\nkeyboard_arrow_up\narrow navigation\nscroll to top\nfixed box\nset submenus for WCAG",
      "emails": [
        "akhan@lessings.com",
        "bkneisel@lessings.com",
        "blodato@lessings.com",
        "dcoffaro@lessings.com",
        "dsheehan@lessings.com",
        "fwichser@lessings.com",
        "glodato@lessings.com",
        "gschneider@lessings.com",
        "info@bayberryislip.com",
        "info@ellensstardustdiner.com",
        "info@lessings.com",
        "info@lovestreetjupiter.com",
        "info@luckyshuckjupiter.com",
        "info@northpalmbeachcc.com",
        "info@templechaverim.org",
        "info@thebeaconjupiter.com",
        "info@theiridium.com",
        "info@topsidejupiter.com",
        "jdobbins@lessings.com",
        "jolsen@lessings.com",
        "jscalice@lessings.com",
        "lmaffettone@lessings.com",
        "lmaiorino@lessings.com",
        "miked@lessings.com",
        "mikel@lessings.com",
        "mpalischak@lessings.com",
        "offpremisefl@lessings.com",
        "rmoran@lessings.com",
        "rrenna@lessings.com",
        "skirchsbaum@lessings.com",
        "skirschbaum@lessings.com",
        "smcgaw@lessings.com",
        "smelita@lessings.com",
        "sriccio@lessings.com",
        "tbyrnes@lessings.com",
        "tmostafa@lessings.com"
      ]
    },
    {
      "url": "https://www.lessings.com/corporate/about",
      "is_candidate": false,
      "has_email": true,
      "text": "Google Tag Manager (noscript)\nEnd Google Tag Manager (noscript)\nSkip to Main Content\nGo to Accessbility Settings\nTo Shop Lessing’s Gift Cards,\nclick here\nmenu\nABOUT\nOur Mission\nOur Company\nOur People\nOur Story\nIn the News\nAwards\nJoin Our Team\nContact Us\nWEDDINGS\nEvents\nSeasonal Events\nWedding Showcases\nExclusives & Packages\nLocations\nNew Venues\nLong Island\nNYC - Westchester\nFlorida\nRESTAURANTS\nEvents\nSeasonal Events\nLocations\nLong Island\nNew York City\nFlorida\nCountry Clubs\nPopup Kitchens\nCountry Clubs\nGrill Room at Timber Point\nThe Bethpage Public House\nThe Grill Room at West Sayville\nThe Turn at Port Jefferson\nThe Terrace at 360 East\nOFF‑PREMISE\nNew York\nEast End\nBrecknock Hall\nMontauk Manor\nParrish Art Museum\nPeconic River Herb Farm\nPindar Vineyards\nSalt Air Farm\nLong Island\nParks and Picnics\nThe Bates House\nVanderbilt\nUpstate New York\nKindred Creeks Farm\nNew York City\n630 Second\nCentral Park\nF. Ottomanelli By The Water\nGolf & Body\nHammerstein Ballroom\nMetropolitan Pavilion\nMidtown Loft\nPenn Plaza Pavilion\nRamscale Studio\nStudio 450\nStudio 525\nThe Altman Building\nThe Pillars\nUkrainian Institute\nFlorida\n5 Star Hospitality\nLessing's Events\nConnecticut\nThe Knowlton\nPRIVATE EVENTS\nEvent Spaces\nLong Island\nNYC-Westchester\nFlorida\nRestaurants\nLong Island\nNew York City\nFlorida\nFOOD SERVICE\nMANAGEMENT SERVICES\nEMERGENCY DINING\nHOTEL\nHOME\nABOUT\nWEDDINGS\nRESTAURANTS\nOFF PREMISE CATERING\nPRIVATE EVENTS\nFOOD SERVICE\nMANAGEMENT SERVICES\nEMERGENCY DINING\nHOTEL\nGIFT CARDS\nREWARDS\nSITE MAP\nCONTACT\nnavigate_before\npause_circle_filled\nnavigate_next\nOUR MISSION\nOUR CORE VALUES\nOUR COMPANY\nOUR PEOPLE\nOUR STORY\nIN THE NEWS\nAWARDS\nJOIN OUR TEAM\nCONTACT US\nOUR MISSION\nLessing's... A Legacy of Remarkable Hospitality.\nTo continue our 135-year tradition of innovation and excellence - providing unique restaurant concepts, exclusive wedding venues, distinctive catering, and skillfully executed food service management.\nOUR CORE VALUES\nGrowth:\nLearning sparked by curiosity drives our passion for continuous improvement.\nInnovation:\nWe challenge the status quo with forward-thinking, and constantly adapt to ever-changing demands.\nDiversity:\nWe seek, welcome, and respect diverse perceptions, backgrounds, and experiences.\nHospitality:\nRemarkable actions create memorable experiences.\nIntegrity:\nWe are genuine people guided by morals.\nLegacy:\nHonoring the traditions of our past, we build the legacy of our future.\nOUR COMPANY\nLessing’s Hospitality Group is comprised of over 100 locations throughout the Northeast and Florida. Lessing’s operates 23 wedding and catering venues, 16 full-service restaurants, over 75 corporate and academic dining centers, a historic inn, and a presidential yacht. Steeped in 135 years of tradition, Lessing’s Hospitality Group’s focus is on providing each guest and client with unique, personalized experiences and remarkable hospitality.\nOUR PEOPLE\nStephen M Lessing\nChairman\nMichael Lessing\nChief Executive Officer\nJohn Lessing\nSenior Advisor\nScott McKelvey\nChief Financial Officer\nLawrence Lessing\nChief Operating Officer\nEllen Barrett\nExecutive Vice President\nHuman Resources\nMark Lessing\nExecutive Vice President\nRestaurants\nJohn S. Lessing Jr.\nExecutive Vice President\nFacilities & Maintenance\nKevin Lessing\nExecutive Vice President\nLFSM Group\nHolly Lynch\nVice President of Finance\nSteve Kirschbaum\nVice President of Catering\nNortheast\nMichele Palischak\nVice President of Catering\nSouth Florida\nGrant Lieberman\nVice President of Technology\nPeter Lessing\nDirector of System Analytics\nDavid Lessing\nDirector of Business Development\nGuy Reuge\nChef Emeritus Senior Advisor\nWilliam Muzio\nCorporate Executive Chef\nRestaurants\nEddie Michaels\nCorporate Executive Chef\nCatering\nOUR STORY\nA FAMILY OF INNOVATORS (1890-1940)\nThe oldest family-owned, continuously operated, highly diverse food service company in the United States is Lessing’s Hospitality Group in Great River, New York. The company was founded by Maxwell Lessing in 1890 and is operated to this day by 15 family members representing six generations of Lessing's. This highly diversified company feeds more than 40,000 guests a day at over 120 corporate, educational, country club and manufacturing plant locations throughout the Northeast and Florida. Lessing’s Hospitality Group also operates 23 high-end wedding and catering venues, 1 nightclub, 16 full service restaurants, 3 virtual kitchens, and a historic inn. The Lessing family has provided food service to New Yorkers for 135 years without interruption. Both the longevity and the success of this legacy company is unprecedented, especially in the food service and restaurant business.\n\"I decided to see if I could discover the secret to this family's success. What was it about the Lessing clan that set them apart from countless other restaurant companies that have come and gone from the food service scene? One hundred and thirty years in business is remarkable enough, but to have the same family operate the company the entire time is unheard of. My research into the company's history revealed the secret immediately.\"\nTHE LUNCH COUNTER\nMaxwell Lessing was an innovator. He responded to the explosion of the urban worker population in the 1890's by opening the first convenient lunch counter in New York's Financial District. For the first time in American history, workers who lived in boarding houses that supplied meals left home to go to work, forsaking one of their free meals. They had little time and less money for lunch. In addition, women were joining the work force in droves during this era and began to patronize places they once dared not enter, climbing onto lunch counter stools and venturing into cafes in the evening without escorts.\nBy 1893 the country had slipped into a severe four-year recession, and the self-service lunches available in saloons on the honor system began to suffer an enormous amount of theft. One after another, saloon owners were forced to eliminate these lunches. Maxwell again saw their setback as his opportunity, and he responded by expanding his low-price, pay-as-you-go lunch counter operation to multiple locations in office buildings around Wall Street.\nTHE COMMISSARY\nThen, he innovated again. With multiple locations to service, Maxwell established a commissary on Jones Lane close to his lunch counters in the Wall Street area. From the commissary he would prepare baked goods, sliced meats, salads, soups and hot foods to deliver to his locations and serve the long lines of office workers, who were rapidly running out of places to eat. Maxwell's commissary on Jones Lane was the first multi-unit restaurant commissary in the United States.\nTHE SANDWICH\nThe commissary concept was an innovation well before its time and led to another innovation that would become an American food staple - the sandwich. Maxwell didn't invent the sandwich, but Lessing’s Hospitality Group was the first company to serve sandwiches at lunch counters in New York City. Workers could either eat them at the lunch counters or take them away and enjoy them on a park bench or back in the quiet of their office.\nTHE COKE\nGreat innovators not only create innovative products, but also recognize innovation when they see it. Dr. Pemberton, perhaps one of the greatest innovators of all time, created Coca-Cola in 1886. In 1890, Asa G. Candler, the legendary President of the Coca-Cola Company, began to distribute coke syrup to soda fountains outside Atlanta. Maxwell Lessing was the first New York restaurateur to buy Coca-Cola syrup and serve Coke to his customers. The introduction of both the sandwich and the Coke by one small lunch counter operator in 1890's New York was an almost unimaginable great leap forward in food service.\nAccording to a New York Public Library exhibit on New York culture,\n\"of the three meals that mark the American day, lunch is the one that acquired its modern identity here on the streets of New York.\"\nTHE 1920'S\nThe 1920's is an important decade in Lessing history as it marked the birth of the modern restaurant industry. Maxwell had incorporated Lessing’s Hospitality Group in 1917 and was joined in the business by his son, Lawrence, in the 20's. The advent of national prohibition stripped away liquor profits, shifting emphasis to low-price, high volume food service. More people ate out than ever before. Famous pre-war restaurants closed, while cafeterias, luncheonettes and tearooms thrived.\nTHE LOCATION\nBy the late 1920's, Lessing’s Hospitality Group was serving meals to New York's workforce in as many as 20 locations, thanks to Lawrence's  great innovation.  He strategically acquired lunch counter space in the lobbies of newly constructed office buildings, among them the lunchrooms at 1 Broadway, 40 Wall Street, The Woolworth Building (at the time the tallest building in the world), the Equitable Building at 120 Broadway and The New York Stock Exchange.  It was the fulfillment of the now famous restaurant chain mantra, LOCATION-LOCATION-LOCATION. Ray Kroc took the words right out of Lawrence's mouth.\nCONTRACT FOOD SERVICE\nIn 1928, American Cable and Wireless decided to include an employee cafeteria in their new office building. Providing employees with a cafeteria was an innovation in itself in 1928, however Lawrence’s vision trumped even the cafeteria idea. Already operating a nascent multi-unit food service operation out of the Lessing’s Hospitality Group commissary on Jones Lane, he presented American Cable with a proposition. Rather than American Cable executives having to manage a large cafeteria with all the headaches inherent in such an operation, Lessing’s Hospitality Group would manage it for them on a contract basis. For a fee, Lawrence and his staff would take care of everything. With that one creative impulse, the contract food service industry was born in New York City. The Lessing innovation gene had struck again, and Lessing’s Hospitality Group was off and running in an entirely new industry.\nRESTAURANT CHAIN\nBy the 1930's, retail stores saw the wisdom in the conveniently located lunch counter and decided to get into the act. The lunch counter business exploded in dense urban centers, giving rise to iconic restaurant chains such as Schrafft's, Childs, Horn & Hardart, Lofts' and Bickford's. It is worth noting that of all these famous restaurant chains, only Lessing’s Hospitality Group is still in business.\nTHE WAR YEARS\nWith the Japanese attack on Pearl Harbor in 1941, New York City was transformed into the metropolitan hub of America's massive war effort. Every inch of office space in the buildings around Wall Street, where the Lessing’s Hospitality Group chain of coffee shops was located, was given over to the war effort in one way or another. In a laboratory at Columbia University, Enrico Fermi began work on atomic particles that led to the top-secret development of the atomic bomb, called the Manhattan Project. This work on uranium enrichment took place in secret offices located in the Woolworth building above the Lessing’s Hospitality Group coffee shop. Across the Brooklyn Bridge, the Pfizer Company converted an enormous ice plant into history's first penicillin factory and began the wartime manufacture of their life-saving discovery. The Brooklyn Navy Yard quickly became the world's largest shipbuilding facility, employing more than 75,000 people by 1942. The port of New York became the primary point of embarkation for the millions of U.S. soldiers shipped overseas to the war zone. Between 1942 and 1945, 1.86 million New Yorkers themselves joined the armed forces.\nLawrence responded to New York's exploding demand to feed millions of non-combatant wartime support personnel by rapidly expanding the company's coffee shop locations to five additional buildings in lower Manhattan and doubling the commissary staff on Jones Lane. Like so many other iconic American companies who responded to wartime demand, Lessing’s Hospitality Group emerged from the war a more substantial and professional company prepared to thrive during the post war economic boom that would engulf the nation.\nLAWRENCE LESSING JR.\nThe \"Happy Days\" of the 1950's were the perfect setting for Lawrence's innovative personality. Prior to the rise of American consumerism brought on by World War II, small businessmen saw themselves as humble shopkeepers. They were good at working hard tending to the nuts and bolts of their businesses. Small food service operators were usually good in the kitchen and rarely stepped out from behind the counter to embrace the bigger picture. Lawrence, however, saw the potential of making connections with the movers and shakers of the industries booming around him. He decided to leave the day to day operations to trusted employees while he told the Lessing story to decision makers who could use Lessing’s expertise but didn't know it yet. This innovative change in the role of the humble shopkeeper transformed Lessing from a little lunch counter operator into a highly regarded food service contractor. He called on every company executive who would listen, and before long Lessing’s Hospitality Group began to handle the food service for America's corporate giants like New York Trust, Chemical Bank, Reynolds & Co., Smith Barney, Goldman Sachs, Regis Paper and the New York Stock Exchange.\nTHE NEXT GENERATION\nBecause of Lawrence's success in making Lessing’s Hospitality Group a well-known name in food service management, the company was becoming a far more substantial and complex firm by the end of the 1950's. It was time for the next generation of Lessings to step up and guide the company into the modern age. Lawrence's son John, known as Jack, joined the company in 1958 and John's brother Lawrence III, known as Larry, followed a year later. Inspired by their father's love of the business, and with the Lessing gene working its particular magic, the brothers adopted very different roles in guiding Lessing’s Hospitality Group. Jack, like his father, was an expansive visionary who could connect with the wide variety of constituents that Lessing’s Hospitality Group now served, while Larry put his orderly logical mind to the task of managing the now highly complex, day-to-day business.\nTHE 1960'S AND 70'S\nThe 60's and 70's were very difficult for food service in the New York metropolitan area. For the first time in history, the population of New York City began to decline. Wartime industries either closed or moved to more economic locations. The New York City economic boom created by the war and the immediate post war period had created formidable competition. Companies such as Schrafft's, Child's, Savarin, Horn and Hardart and Stouffer's were all competing for both the coffee shop and the food service management dollar. The Wall Street banks would suffer two major recessions, and an industry reorganization moved most of the corporate headquarters' employees away from Wall Street. Culinary unions were ascendant during this period, and they eventually organized the Lessing bakers at 155 West 19th Street. The food service boom had ended, and the decades of the 60's and 70's would challenge the Lessing brothers to find new methods and new markets in which to do business.\nCITY MOUSE - COUNTRY MOUSE\nMillions of Americans followed Abraham Levitt's lead and moved to the suburbs in the 1950's. Living in Islip, Long Island, the Lessings were no strangers to the suburbs. Therefore, it was natural for them to expand their business beyond their Wall Street operations. They signed food service management contracts to feed Maxson Electronics, American Airlines, Michelin Tire and Great American Insurance Co. These strategic moves would change the face of their business and prove to be the salvation of the company. Jack and Larry successfully combined strategic thinking, aggressive marketing and careful management of detail to guide Lessing’s Hospitality Group through the two most difficult economic decades in modern food service history. As Manhattan became a more competitive market, the brothers expanded the company to the suburbs and continued the transformation of their company from a local chain of office building lunch counters to a regional food service management powerhouse. Another instinctive choice by the next generation of Lessings kept the company growing and thriving when others had failed.\nDIVERSIFICATION (1980 - PRESENT)\nTight-knit Irish clans are often guided by an invisible hand. When I asked Jack, the Chairman of Lessing’s Hospitality Group, when the family first got into the retail restaurant business he answered, \"It wasn't until 1977. My mother, a devout Irish Catholic, never wanted the family to sell liquor.\"\nBut in 1977, a friend of Jack's told him that the only bar in Breezy Point (the now world-famous New York Irish police and fireman's community destroyed in Hurricane Sandy) was for sale. The Bay Terrace Bar was the only pub in a community of 3,800 homes occupied by New York's firefighters and policemen. \"It was a gold mine,\" Jack said. \"We used to sell 250 cases of beer on a Saturday night. That was a lot of beer in 1977.\" He was hooked. The family began to diversify beyond contract food service into the retail restaurant business at just the right time.\nContract food service, a business that Lessing’s Hospitality Group had originated and built for 40 years, was becoming a commodity business by the late 1970s. Once the industry saw the food service market niche that Lessing’s Hospitality Group had created, everyone got into the business. Big corporations like Servomation and the Canteen Corporation joined hundreds of small independent contractors in increasing competition, until there were 8 or 9 bids submitted on every account. \"Our B&I business was still strong because our customers were loyal, but it became harder and harder to make a profit in contract food service,\" Jack said. He saw how the cash flow from the Bay Terrace Bar could supplement the reliable but slim margins in contract food service, so he began to diversify into retail restaurants.\nTHE MAIN STREET INNOVATION\nPrior to the 1980s, restaurant chains were not well received on Long Island, so few national chains bothered to open units in one of the nation's most densely populated suburbs. Long Islanders seemed to gravitate more towards local restaurants. The Lessings knew that any restaurant they opened must feel like a \"local joint\". They watched the success of the Bay Terrace Bar and waited for the Lessing innovation impulse to kick in. Eventually, they decided to open cafes that would serve the local clientele along Montauk Highway, the road that had become the Main Street of Long Island's South Shore villages. They would locate them in historic town buildings that the long-time residents were familiar with. In 1978, the Lessings opened their first Main Street restaurant in the historic post office building that had served the town of Babylon for many years. The Post Office Café quickly came to be considered a local place Babylon customers felt comfortable and at home in, and it has been going strong ever since.\nEXPANSION\nBy the 1980s, the Main Streets along Long Island's South Shore were becoming gentrified by the growth of more modern shopping centers opening on Sunrise Highway.\nWith the Post Office Café booming, the Lessings migrated east along Montauk Highway to the little town of Bay Shore and opened their second Main Street Restaurant in the town's original fire house. The youth of Suffolk County instantly made the Firehouse the most popular young club on all of Long Island. Thirty years later the Lessings purchased the historic Southside Hotel, Bay Shore's original \"local joint\" across the street from the Firehouse.\nHistory will record that Lessing’s Hospitality Group’s “Main Street restaurant” concept ignited a revival movement that has brought these historic Long Island Main Streets back to life.\nWhen the original library closed in Farmingdale, Long Island, the Lessings bought the building and opened another Main Street restaurant, the Library Café. Each restaurant's success drove the Lessings along the same strategic path – find and purchase historic Long Island buildings that were icons to the local clientele. They opened Maxwell's on Main Street in Islip and bought the Huntington landmark, Finnegan's, perhaps the most \"local\" of all their Main Street pubs and cafés.\nCONCESSIONS\nDuring the 1970s and 80s, Lessing’s Hospitality Group was also operating over 100 concession locations at state, county and town parks from Montauk to Long Beach. They were the biggest picnic caterers in the state, at times feeding as many as 10,000 people. They operated the concessions at the now legendary Hecksher State Park, Eisenhower Park, Bethpage State Park, Sunken Meadow and Tobay Beach.\nFINE DINING\nIn the 90s, the Lessings made another strategic decision when they began operating the most historic and iconic building of all, the Three Village Inn in Stony Brook, Long Island. Built in 1751, the Three Village Inn had served as a summerhouse, a Women's Exchange, a simple tearoom and a fine country inn. In this historic location, the Lessings expanded beyond their pub and cafe style Main Street restaurants to enter the fine dining segment with their now famous Mirabelle Restaurant & Tavern.\nCOMBINING INNOVATIONS\nThe Saxon Arms restaurant in Oakdale enjoyed the best waterfront view of the Great South Bay anywhere on Long Island. Lessing’s Hospitality Group bought this local favorite, changed the name to (what else?) View, refurbished the building and the menu and now operates the most popular dockside restaurant on Long Island's South Shore.\nCATERING\nThe insight to appeal to local tastes by instantly becoming part of the local cultural heritage was a brilliant innovation. During the 1990s, the Lessings began a rapid expansion into the catering business by utilizing the same innovative instinct that served them so well in retail restaurants.\nLong Island was comprised of rural farms and small seaport villages until the turn of the 20th century, when the great family fortunes created by the industrial revolution built vast estates on Long Island. More than 1,200 grand estates were built along the North Shore's \"Gold Coast\" of Great Gatsby fame. Many of these mansions remain in existence throughout Long Island to this day.\nBy the 1950s, grand-estate living was going out of style, and many of the mansions were turned over to colleges, charities and religious orders. Knowing that these estates were considered the best addresses in many local towns and villages, the Lessings decided to lease, license, or buy them for catering locations. What local bride would not want to be married in the grandest estate house in her village?\nLessing’s Hospitality Group now offers Long Island brides the opportunity to hold their wedding reception at Bourne Mansion, Whitby Castle, Chateau at Coindre Hall, Mansion at Timber Point, Mansion at West Sayville, The Vineyards in Aquebogue and Estate at Three Village Inn, to name just a few. These iconic locations have become so popular that Lessing’s Hospitality Group now caters more than 1,000 weddings a year.\nIN THE PRESENT\nFrom the beginning, Maxwell Lessing set out to be a trailblazer in the food and beverage industry.  Today Lessing’s Hospitality Group continues to be an industry leader, and the company is still managed by the present generation of Lessings, who carry out Maxwell’s legacy every day. Most recently, Lessing's has expanded  their portfolio to Florida, with the Crane Club at Tesoro, Charlie & Joe's at Love Street and now, New York City with Ellen's Stardust Diner & The Iridium.\nAUTHOR'S NOTE\nIn this history I have attempted to reveal the secrets of longevity and consistency that enabled Lessing’s Hospitality Group to survive and thrive for 135 years in the world's most competitive food service market. How did each generation attract the next generation into the business? How did they survive ever-changing tastes, a volatile commodity market, two world wars, the Great Depression and the Great Recession, inevitable family squabbles, an increasingly contentious legal environment and stiff competition from well-financed public companies? What was the magic?\nEach Lessing generation, from Maxwell to the present, never took survival for granted. They responded to changing market conditions with CREATIVE INNOVATION.\nAuthor, Francis Bennett, freelance writer\nIN THE NEWS\nHealthy Eating: Long Island hospitals provide food for life\nLong Island Business News announces 2025 Icon Honors\nLIBN: Après the pandemic: restaurants going full steam ahead\nPalm Beach North Podcast: Building a Legacy: Michael Lessing On Six Generations of Hospitality\nIn The Lead: Family Owned Businesses\nLong Island Restaurant Week begins Sunday\nLes Paul Remembered In Exhibit Opening Monday\nThese LI restaurants rank among world’s best for wine: Wine Spectator\nHidden Gems: Meet Lawrence Lessing of Lessing’s Hospitality Group\nLessing's Hospitality Group: Catering Remarkable Hospitality Services through Tailored Packages\nDO GOOD\nCharlie & Joe’s delivers 6,800 pantry boxes to needy\nBlaze Pizza donates pizzas to Good Samaritan\nNewsday - Healthcare Worker Discounts\nGreater Long Island - Lessing's Donates 5,000 Meals\nLong Island Restaurant News - Spread The Cheer\nSustainable Brands - Hatch DoGood Pancakes\nLI Restaurant News - Veterans Day\nGreater Long Island - Lessing's Gives Back On Veterans Day\nLIBN - Hospitality Group Gives Back on Veterans Day\nLong Island Press - Lessing's Helps FCA Celebrate 135 Years\nGreater Long Island - Lessing's Helps FCA Celebrate 135 Years\nPatch - Creek Cleanup\nLIBN - Creek Cleanup\nNewsday - Creek Cleanup\nStony Brook Creek Cleanup Video Footage\nGreater Long Island - Stony Brook Creek Cleanup\nTotal Food Service - Lessing's Hospitality Group Takes Initiative to \"Do Good\" for Earth Day\nThe List Magazine - Lessing's is Doing Good\nNewsday - Working to Ease Long Island Hunger\nBrentwood-Central Islip Patch - Lessing's Hospitality Group Launces \"Do Good\" Initiative\nAWARDS\nJOIN OUR TEAM\nA leader in the hospitality industry since 1890, Lessing's Hospitality Group offers many possibilities for employment and advancement.\nApply today.\nLink to database - <ul><p>No careers have been posted at this time.</p></ul>\nCONTACT US\nCorporate Headquarters\n3500 Sunrise Highway\nBldg 100, Suite 100\nGreat River, NY 11739\n631.567.8200\nSend Email\nNew York City Office\n950 3rd Avenue\nFloor 16\nNew York, NY 10019\n212.764.3450\nSend Email\nFlorida Office\n825 S US Highway 1\n2nd Floor, Suite 230\nJupiter, FL 33477\n561.768.9118\nSend Email\nSITE MAP\nCONTACT\nPRIVACY STATEMENT\nTERMS OF USE\nTERMS FOR ONLINE PURCHASES\nACCESSIBILITY\n<li><a href=\"https://twitter.com/lessingsinc\" target=\"_blank\"><img src=\"https://www.lessings.com/corporate/webimages/_core/s_social_icon_twitter.png\" alt=\"Twitter\" /></a></li>\n© 2025 Lessing's Hospitality Group. All rights reserved.\nkeyboard_arrow_up\narrow navigation\nscroll to top\nfixed box\nset submenus for WCAG",
      "emails": [
        "info@lessings.com"
      ]
    },
    {
      "url": "https://www.lessings.com/corporate/events/seasonal-events-series",
      "is_candidate": false,
      "has_email": false,
      "text": "Google Tag Manager (noscript)\nEnd Google Tag Manager (noscript)\nSkip to Main Content\nGo to Accessbility Settings\nTo Shop Lessing’s Gift Cards,\nclick here\nmenu\nABOUT\nOur Mission\nOur Company\nOur People\nOur Story\nIn the News\nAwards\nJoin Our Team\nContact Us\nWEDDINGS\nEvents\nSeasonal Events\nWedding Showcases\nExclusives & Packages\nLocations\nNew Venues\nLong Island\nNYC - Westchester\nFlorida\nRESTAURANTS\nEvents\nSeasonal Events\nLocations\nLong Island\nNew York City\nFlorida\nCountry Clubs\nPopup Kitchens\nCountry Clubs\nGrill Room at Timber Point\nThe Bethpage Public House\nThe Grill Room at West Sayville\nThe Turn at Port Jefferson\nThe Terrace at 360 East\nOFF‑PREMISE\nNew York\nEast End\nBrecknock Hall\nMontauk Manor\nParrish Art Museum\nPeconic River Herb Farm\nPindar Vineyards\nSalt Air Farm\nLong Island\nParks and Picnics\nThe Bates House\nVanderbilt\nUpstate New York\nKindred Creeks Farm\nNew York City\n630 Second\nCentral Park\nF. Ottomanelli By The Water\nGolf & Body\nHammerstein Ballroom\nMetropolitan Pavilion\nMidtown Loft\nPenn Plaza Pavilion\nRamscale Studio\nStudio 450\nStudio 525\nThe Altman Building\nThe Pillars\nUkrainian Institute\nFlorida\n5 Star Hospitality\nLessing's Events\nConnecticut\nThe Knowlton\nPRIVATE EVENTS\nEvent Spaces\nLong Island\nNYC-Westchester\nFlorida\nRestaurants\nLong Island\nNew York City\nFlorida\nFOOD SERVICE\nMANAGEMENT SERVICES\nEMERGENCY DINING\nHOTEL\nHOME\nABOUT\nWEDDINGS\nRESTAURANTS\nOFF PREMISE CATERING\nPRIVATE EVENTS\nFOOD SERVICE\nMANAGEMENT SERVICES\nEMERGENCY DINING\nHOTEL\nGIFT CARDS\nREWARDS\nSITE MAP\nCONTACT\nnavigate_before\npause_circle_filled\nnavigate_next\nSEASONAL EVENTS\nSummer Events\nVenue\nDate\nEvent\nCity/State\nTime\nPost Office Café\nLove Island Watch Party\nBabylon, NY\nDetails\nView\nSummer Specials\nOakdale, NY\nDetails\nView\nSummer Friday VIP Experience\nOakdale, NY\n7pm - late\nDetails\nPort Jefferson Country Club\nSunset On The Sound Happy Hour\nPort Jefferson, NY\nDetails\nHoliday Parties\nVenue\nDate\nEvent\nCity/State\nTime\nBayberry\nBook Early and Save\nIslip, NY\nDetails\nCrane Club at Tesoro\nBook Your Holiday Party & Save!\nPort St. Lucie, FL\nDetails\nFinnegan's\nBook Early and Save\nHuntington, NY\nDetails\nGoldy's Gems\nBook Early and Save\nBay Shore, NY\nDetails\nLibrary Café\nBook Early and Save\nFarmingdale, NY\nDetails\nMirabelle Tavern\nBook Early and Save\nStony Brook, NY\nDetails\nPost Office Café\nBook Early and Save\nBabylon, NY\nDetails\nSandbar\nBook Early and Save\nCold Spring Harbor, NY\nDetails\nView\nBook Your Holiday Party Early & Save!\nOakdale, NY\nDetails\nThe Mansion at West Sayville\nHoliday Parties at The Mansion at West Sayville\nWest Sayville, NY\nDetails\nWhitby Castle\nBook Your Holiday Party Early and Save!\nRye, NY\nDetails\nSummer Events\nLove Island Watch Party\nPost Office Café\nBabylon, NY\nDetails\nSummer Specials\nView\nOakdale, NY\nDetails\nSummer Friday VIP Experience\nView\nOakdale, NY\n7pm - late\nDetails\nSunset On The Sound Happy Hour\nPort Jefferson Country Club\nPort Jefferson, NY\nDetails\nHoliday Parties\nBook Early and Save\nBayberry\nIslip, NY\nDetails\nBook Your Holiday Party & Save!\nCrane Club at Tesoro\nPort St. Lucie, FL\nDetails\nBook Early and Save\nFinnegan's\nHuntington, NY\nDetails\nBook Early and Save\nGoldy's Gems\nBay Shore, NY\nDetails\nBook Early and Save\nLibrary Café\nFarmingdale, NY\nDetails\nBook Early and Save\nMirabelle Tavern\nStony Brook, NY\nDetails\nBook Early and Save\nPost Office Café\nBabylon, NY\nDetails\nBook Early and Save\nSandbar\nCold Spring Harbor, NY\nDetails\nBook Your Holiday Party Early & Save!\nView\nOakdale, NY\nDetails\nHoliday Parties at The Mansion at West Sayville\nThe Mansion at West Sayville\nWest Sayville, NY\nDetails\nBook Your Holiday Party Early and Save!\nWhitby Castle\nRye, NY\nDetails\nSITE MAP\nCONTACT\nPRIVACY STATEMENT\nTERMS OF USE\nTERMS FOR ONLINE PURCHASES\nACCESSIBILITY\n<li><a href=\"https://twitter.com/lessingsinc\" target=\"_blank\"><img src=\"https://www.lessings.com/corporate/webimages/_core/s_social_icon_twitter.png\" alt=\"Twitter\" /></a></li>\n© 2025 Lessing's Hospitality Group. All rights reserved.\nkeyboard_arrow_up\narrow navigation\nscroll to top\nfixed box\nset submenus for WCAG",
      "emails": []
    },
    {
      "url": "https://www.lessings.com/corporate/corporate-and-social-events",
      "is_candidate": false,
      "has_email": false,
      "text": "Google Tag Manager (noscript)\nEnd Google Tag Manager (noscript)\nSkip to Main Content\nGo to Accessbility Settings\nTo Shop Lessing’s Gift Cards,\nclick here\nmenu\nABOUT\nOur Mission\nOur Company\nOur People\nOur Story\nIn the News\nAwards\nJoin Our Team\nContact Us\nWEDDINGS\nEvents\nSeasonal Events\nWedding Showcases\nExclusives & Packages\nLocations\nNew Venues\nLong Island\nNYC - Westchester\nFlorida\nRESTAURANTS\nEvents\nSeasonal Events\nLocations\nLong Island\nNew York City\nFlorida\nCountry Clubs\nPopup Kitchens\nCountry Clubs\nGrill Room at Timber Point\nThe Bethpage Public House\nThe Grill Room at West Sayville\nThe Turn at Port Jefferson\nThe Terrace at 360 East\nOFF‑PREMISE\nNew York\nEast End\nBrecknock Hall\nMontauk Manor\nParrish Art Museum\nPeconic River Herb Farm\nPindar Vineyards\nSalt Air Farm\nLong Island\nParks and Picnics\nThe Bates House\nVanderbilt\nUpstate New York\nKindred Creeks Farm\nNew York City\n630 Second\nCentral Park\nF. Ottomanelli By The Water\nGolf & Body\nHammerstein Ballroom\nMetropolitan Pavilion\nMidtown Loft\nPenn Plaza Pavilion\nRamscale Studio\nStudio 450\nStudio 525\nThe Altman Building\nThe Pillars\nUkrainian Institute\nFlorida\n5 Star Hospitality\nLessing's Events\nConnecticut\nThe Knowlton\nPRIVATE EVENTS\nEvent Spaces\nLong Island\nNYC-Westchester\nFlorida\nRestaurants\nLong Island\nNew York City\nFlorida\nFOOD SERVICE\nMANAGEMENT SERVICES\nEMERGENCY DINING\nHOTEL\nHOME\nABOUT\nWEDDINGS\nRESTAURANTS\nOFF PREMISE CATERING\nPRIVATE EVENTS\nFOOD SERVICE\nMANAGEMENT SERVICES\nEMERGENCY DINING\nHOTEL\nGIFT CARDS\nREWARDS\nSITE MAP\nCONTACT\nnavigate_before\npause_circle_filled\nnavigate_next\nCorporate and Social Events\nThe Lessing's corporate and social events team is founded upon 135 years of experience and led by renowned chefs. We are a team of world-class caterers and restaurant leaders who execute exceptional events from corporate and social to extravagant private affairs and intimate cocktail parties. Now spanning from Westchester to Florida we offer access to a variety of venues throughout New York, across Long Island and into Florida.\nBeach & Waterfronts\nCountry Clubs\nEvent Spaces\nMansions\nRestaurant\nVineyards\nEvent Spaces\nRestaurants\nLong Island Event Spaces\n360° East at Montauk Downs\nMontauk, NY\nBourne Mansion\nOakdale, NY\nChateau at Coindre Hall\nHuntington, NY\nEssex Club\nBrentwood, NY\nEstate at Three Village Inn\nStony Brook, NY\nHarmony Vineyards\nSt. James, NY\nHeritage Club at Bethpage\nFarmingdale, NY\nMansion at Timber Point\nGreat River, NY\nPavilion at Sunken Meadow\nKings Park, NY\nPort Jefferson Country Club\nPort Jefferson, NY\nStonebridge Country Club\nSmithtown, NY\nTemple Chaverim\nPlainview, NY\nThe Barn at Old Bethpage\nOld Bethpage, NY\nThe Mansion at Oyster Bay\nWoodbury, NY\nThe Mansion at West Sayville\nWest Sayville, NY\nThe Vineyards at Aquebogue\nAquebogue, NY\nWeddings at Bayberry\nIslip, NY\nWestchester and New York City Event Spaces\n630 Second Avenue\nNew York, NY\nWhitby Castle\nRye, NY\nJewish Theological Seminary\nNew York, NY\nF. Ottomanelli By The Water\nLong Island City, NY\nFlorida Event Spaces\nPelican Club\nJupiter, FL\nCrane Club at Tesoro\nPort St. Lucie, FL\nKravis Events\nWest Palm Beach, FL\nHoney Fitz\nJupiter, FL\nNorth Palm Beach Country Club\nNorth Palm Beach, FL\nLady Jean Ranch\nJupiter, FL\nLessing's Events\nWest Palm Beach, FL\nLong Island Restaurants\nBayberry\nIslip, NY\nFinnegan's\nHuntington, NY\nGoldy's Gems\nBay Shore, NY\nLibrary Café\nFarmingdale, NY\nMirabelle Tavern\nStony Brook, NY\nPost Office Café\nBabylon, NY\nSandbar\nCold Spring Harbor, NY\nView\nOakdale, NY\nHatch Brunch\nHuntington, NY\nNew York City Restaurants\nEllen's Stardust Diner\nNew York, NY\nIridium\nNew York, NY\nFlorida Restaurants\nThe Beacon\nJupiter, FL\nTopside at the Beacon\nJupiter, FL\nLucky Shuck\nJupiter, FL\nHatch Brunch\nFort Lauderdale, FL\nThe Clubhouse at North Palm Beach\nNorth Palm Beach, FL\nSITE MAP\nCONTACT\nPRIVACY STATEMENT\nTERMS OF USE\nTERMS FOR ONLINE PURCHASES\nACCESSIBILITY\n<li><a href=\"https://twitter.com/lessingsinc\" target=\"_blank\"><img src=\"https://www.lessings.com/corporate/webimages/_core/s_social_icon_twitter.png\" alt=\"Twitter\" /></a></li>\n© 2025 Lessing's Hospitality Group. All rights reserved.\nkeyboard_arrow_up\narrow navigation\nscroll to top\nfixed box\nset submenus for WCAG",
      "emails": []
    },
    {
      "url": "https://www.lessings.com/corporate/about#join_our_team",
      "is_candidate": false,
      "has_email": true,
      "text": "Google Tag Manager (noscript)\nEnd Google Tag Manager (noscript)\nSkip to Main Content\nGo to Accessbility Settings\nTo Shop Lessing’s Gift Cards,\nclick here\nmenu\nABOUT\nOur Mission\nOur Company\nOur People\nOur Story\nIn the News\nAwards\nJoin Our Team\nContact Us\nWEDDINGS\nEvents\nSeasonal Events\nWedding Showcases\nExclusives & Packages\nLocations\nNew Venues\nLong Island\nNYC - Westchester\nFlorida\nRESTAURANTS\nEvents\nSeasonal Events\nLocations\nLong Island\nNew York City\nFlorida\nCountry Clubs\nPopup Kitchens\nCountry Clubs\nGrill Room at Timber Point\nThe Bethpage Public House\nThe Grill Room at West Sayville\nThe Turn at Port Jefferson\nThe Terrace at 360 East\nOFF‑PREMISE\nNew York\nEast End\nBrecknock Hall\nMontauk Manor\nParrish Art Museum\nPeconic River Herb Farm\nPindar Vineyards\nSalt Air Farm\nLong Island\nParks and Picnics\nThe Bates House\nVanderbilt\nUpstate New York\nKindred Creeks Farm\nNew York City\n630 Second\nCentral Park\nF. Ottomanelli By The Water\nGolf & Body\nHammerstein Ballroom\nMetropolitan Pavilion\nMidtown Loft\nPenn Plaza Pavilion\nRamscale Studio\nStudio 450\nStudio 525\nThe Altman Building\nThe Pillars\nUkrainian Institute\nFlorida\n5 Star Hospitality\nLessing's Events\nConnecticut\nThe Knowlton\nPRIVATE EVENTS\nEvent Spaces\nLong Island\nNYC-Westchester\nFlorida\nRestaurants\nLong Island\nNew York City\nFlorida\nFOOD SERVICE\nMANAGEMENT SERVICES\nEMERGENCY DINING\nHOTEL\nHOME\nABOUT\nWEDDINGS\nRESTAURANTS\nOFF PREMISE CATERING\nPRIVATE EVENTS\nFOOD SERVICE\nMANAGEMENT SERVICES\nEMERGENCY DINING\nHOTEL\nGIFT CARDS\nREWARDS\nSITE MAP\nCONTACT\nnavigate_before\npause_circle_filled\nnavigate_next\nOUR MISSION\nOUR CORE VALUES\nOUR COMPANY\nOUR PEOPLE\nOUR STORY\nIN THE NEWS\nAWARDS\nJOIN OUR TEAM\nCONTACT US\nOUR MISSION\nLessing's... A Legacy of Remarkable Hospitality.\nTo continue our 135-year tradition of innovation and excellence - providing unique restaurant concepts, exclusive wedding venues, distinctive catering, and skillfully executed food service management.\nOUR CORE VALUES\nGrowth:\nLearning sparked by curiosity drives our passion for continuous improvement.\nInnovation:\nWe challenge the status quo with forward-thinking, and constantly adapt to ever-changing demands.\nDiversity:\nWe seek, welcome, and respect diverse perceptions, backgrounds, and experiences.\nHospitality:\nRemarkable actions create memorable experiences.\nIntegrity:\nWe are genuine people guided by morals.\nLegacy:\nHonoring the traditions of our past, we build the legacy of our future.\nOUR COMPANY\nLessing’s Hospitality Group is comprised of over 100 locations throughout the Northeast and Florida. Lessing’s operates 23 wedding and catering venues, 16 full-service restaurants, over 75 corporate and academic dining centers, a historic inn, and a presidential yacht. Steeped in 135 years of tradition, Lessing’s Hospitality Group’s focus is on providing each guest and client with unique, personalized experiences and remarkable hospitality.\nOUR PEOPLE\nStephen M Lessing\nChairman\nMichael Lessing\nChief Executive Officer\nJohn Lessing\nSenior Advisor\nScott McKelvey\nChief Financial Officer\nLawrence Lessing\nChief Operating Officer\nEllen Barrett\nExecutive Vice President\nHuman Resources\nMark Lessing\nExecutive Vice President\nRestaurants\nJohn S. Lessing Jr.\nExecutive Vice President\nFacilities & Maintenance\nKevin Lessing\nExecutive Vice President\nLFSM Group\nHolly Lynch\nVice President of Finance\nSteve Kirschbaum\nVice President of Catering\nNortheast\nMichele Palischak\nVice President of Catering\nSouth Florida\nGrant Lieberman\nVice President of Technology\nPeter Lessing\nDirector of System Analytics\nDavid Lessing\nDirector of Business Development\nGuy Reuge\nChef Emeritus Senior Advisor\nWilliam Muzio\nCorporate Executive Chef\nRestaurants\nEddie Michaels\nCorporate Executive Chef\nCatering\nOUR STORY\nA FAMILY OF INNOVATORS (1890-1940)\nThe oldest family-owned, continuously operated, highly diverse food service company in the United States is Lessing’s Hospitality Group in Great River, New York. The company was founded by Maxwell Lessing in 1890 and is operated to this day by 15 family members representing six generations of Lessing's. This highly diversified company feeds more than 40,000 guests a day at over 120 corporate, educational, country club and manufacturing plant locations throughout the Northeast and Florida. Lessing’s Hospitality Group also operates 23 high-end wedding and catering venues, 1 nightclub, 16 full service restaurants, 3 virtual kitchens, and a historic inn. The Lessing family has provided food service to New Yorkers for 135 years without interruption. Both the longevity and the success of this legacy company is unprecedented, especially in the food service and restaurant business.\n\"I decided to see if I could discover the secret to this family's success. What was it about the Lessing clan that set them apart from countless other restaurant companies that have come and gone from the food service scene? One hundred and thirty years in business is remarkable enough, but to have the same family operate the company the entire time is unheard of. My research into the company's history revealed the secret immediately.\"\nTHE LUNCH COUNTER\nMaxwell Lessing was an innovator. He responded to the explosion of the urban worker population in the 1890's by opening the first convenient lunch counter in New York's Financial District. For the first time in American history, workers who lived in boarding houses that supplied meals left home to go to work, forsaking one of their free meals. They had little time and less money for lunch. In addition, women were joining the work force in droves during this era and began to patronize places they once dared not enter, climbing onto lunch counter stools and venturing into cafes in the evening without escorts.\nBy 1893 the country had slipped into a severe four-year recession, and the self-service lunches available in saloons on the honor system began to suffer an enormous amount of theft. One after another, saloon owners were forced to eliminate these lunches. Maxwell again saw their setback as his opportunity, and he responded by expanding his low-price, pay-as-you-go lunch counter operation to multiple locations in office buildings around Wall Street.\nTHE COMMISSARY\nThen, he innovated again. With multiple locations to service, Maxwell established a commissary on Jones Lane close to his lunch counters in the Wall Street area. From the commissary he would prepare baked goods, sliced meats, salads, soups and hot foods to deliver to his locations and serve the long lines of office workers, who were rapidly running out of places to eat. Maxwell's commissary on Jones Lane was the first multi-unit restaurant commissary in the United States.\nTHE SANDWICH\nThe commissary concept was an innovation well before its time and led to another innovation that would become an American food staple - the sandwich. Maxwell didn't invent the sandwich, but Lessing’s Hospitality Group was the first company to serve sandwiches at lunch counters in New York City. Workers could either eat them at the lunch counters or take them away and enjoy them on a park bench or back in the quiet of their office.\nTHE COKE\nGreat innovators not only create innovative products, but also recognize innovation when they see it. Dr. Pemberton, perhaps one of the greatest innovators of all time, created Coca-Cola in 1886. In 1890, Asa G. Candler, the legendary President of the Coca-Cola Company, began to distribute coke syrup to soda fountains outside Atlanta. Maxwell Lessing was the first New York restaurateur to buy Coca-Cola syrup and serve Coke to his customers. The introduction of both the sandwich and the Coke by one small lunch counter operator in 1890's New York was an almost unimaginable great leap forward in food service.\nAccording to a New York Public Library exhibit on New York culture,\n\"of the three meals that mark the American day, lunch is the one that acquired its modern identity here on the streets of New York.\"\nTHE 1920'S\nThe 1920's is an important decade in Lessing history as it marked the birth of the modern restaurant industry. Maxwell had incorporated Lessing’s Hospitality Group in 1917 and was joined in the business by his son, Lawrence, in the 20's. The advent of national prohibition stripped away liquor profits, shifting emphasis to low-price, high volume food service. More people ate out than ever before. Famous pre-war restaurants closed, while cafeterias, luncheonettes and tearooms thrived.\nTHE LOCATION\nBy the late 1920's, Lessing’s Hospitality Group was serving meals to New York's workforce in as many as 20 locations, thanks to Lawrence's  great innovation.  He strategically acquired lunch counter space in the lobbies of newly constructed office buildings, among them the lunchrooms at 1 Broadway, 40 Wall Street, The Woolworth Building (at the time the tallest building in the world), the Equitable Building at 120 Broadway and The New York Stock Exchange.  It was the fulfillment of the now famous restaurant chain mantra, LOCATION-LOCATION-LOCATION. Ray Kroc took the words right out of Lawrence's mouth.\nCONTRACT FOOD SERVICE\nIn 1928, American Cable and Wireless decided to include an employee cafeteria in their new office building. Providing employees with a cafeteria was an innovation in itself in 1928, however Lawrence’s vision trumped even the cafeteria idea. Already operating a nascent multi-unit food service operation out of the Lessing’s Hospitality Group commissary on Jones Lane, he presented American Cable with a proposition. Rather than American Cable executives having to manage a large cafeteria with all the headaches inherent in such an operation, Lessing’s Hospitality Group would manage it for them on a contract basis. For a fee, Lawrence and his staff would take care of everything. With that one creative impulse, the contract food service industry was born in New York City. The Lessing innovation gene had struck again, and Lessing’s Hospitality Group was off and running in an entirely new industry.\nRESTAURANT CHAIN\nBy the 1930's, retail stores saw the wisdom in the conveniently located lunch counter and decided to get into the act. The lunch counter business exploded in dense urban centers, giving rise to iconic restaurant chains such as Schrafft's, Childs, Horn & Hardart, Lofts' and Bickford's. It is worth noting that of all these famous restaurant chains, only Lessing’s Hospitality Group is still in business.\nTHE WAR YEARS\nWith the Japanese attack on Pearl Harbor in 1941, New York City was transformed into the metropolitan hub of America's massive war effort. Every inch of office space in the buildings around Wall Street, where the Lessing’s Hospitality Group chain of coffee shops was located, was given over to the war effort in one way or another. In a laboratory at Columbia University, Enrico Fermi began work on atomic particles that led to the top-secret development of the atomic bomb, called the Manhattan Project. This work on uranium enrichment took place in secret offices located in the Woolworth building above the Lessing’s Hospitality Group coffee shop. Across the Brooklyn Bridge, the Pfizer Company converted an enormous ice plant into history's first penicillin factory and began the wartime manufacture of their life-saving discovery. The Brooklyn Navy Yard quickly became the world's largest shipbuilding facility, employing more than 75,000 people by 1942. The port of New York became the primary point of embarkation for the millions of U.S. soldiers shipped overseas to the war zone. Between 1942 and 1945, 1.86 million New Yorkers themselves joined the armed forces.\nLawrence responded to New York's exploding demand to feed millions of non-combatant wartime support personnel by rapidly expanding the company's coffee shop locations to five additional buildings in lower Manhattan and doubling the commissary staff on Jones Lane. Like so many other iconic American companies who responded to wartime demand, Lessing’s Hospitality Group emerged from the war a more substantial and professional company prepared to thrive during the post war economic boom that would engulf the nation.\nLAWRENCE LESSING JR.\nThe \"Happy Days\" of the 1950's were the perfect setting for Lawrence's innovative personality. Prior to the rise of American consumerism brought on by World War II, small businessmen saw themselves as humble shopkeepers. They were good at working hard tending to the nuts and bolts of their businesses. Small food service operators were usually good in the kitchen and rarely stepped out from behind the counter to embrace the bigger picture. Lawrence, however, saw the potential of making connections with the movers and shakers of the industries booming around him. He decided to leave the day to day operations to trusted employees while he told the Lessing story to decision makers who could use Lessing’s expertise but didn't know it yet. This innovative change in the role of the humble shopkeeper transformed Lessing from a little lunch counter operator into a highly regarded food service contractor. He called on every company executive who would listen, and before long Lessing’s Hospitality Group began to handle the food service for America's corporate giants like New York Trust, Chemical Bank, Reynolds & Co., Smith Barney, Goldman Sachs, Regis Paper and the New York Stock Exchange.\nTHE NEXT GENERATION\nBecause of Lawrence's success in making Lessing’s Hospitality Group a well-known name in food service management, the company was becoming a far more substantial and complex firm by the end of the 1950's. It was time for the next generation of Lessings to step up and guide the company into the modern age. Lawrence's son John, known as Jack, joined the company in 1958 and John's brother Lawrence III, known as Larry, followed a year later. Inspired by their father's love of the business, and with the Lessing gene working its particular magic, the brothers adopted very different roles in guiding Lessing’s Hospitality Group. Jack, like his father, was an expansive visionary who could connect with the wide variety of constituents that Lessing’s Hospitality Group now served, while Larry put his orderly logical mind to the task of managing the now highly complex, day-to-day business.\nTHE 1960'S AND 70'S\nThe 60's and 70's were very difficult for food service in the New York metropolitan area. For the first time in history, the population of New York City began to decline. Wartime industries either closed or moved to more economic locations. The New York City economic boom created by the war and the immediate post war period had created formidable competition. Companies such as Schrafft's, Child's, Savarin, Horn and Hardart and Stouffer's were all competing for both the coffee shop and the food service management dollar. The Wall Street banks would suffer two major recessions, and an industry reorganization moved most of the corporate headquarters' employees away from Wall Street. Culinary unions were ascendant during this period, and they eventually organized the Lessing bakers at 155 West 19th Street. The food service boom had ended, and the decades of the 60's and 70's would challenge the Lessing brothers to find new methods and new markets in which to do business.\nCITY MOUSE - COUNTRY MOUSE\nMillions of Americans followed Abraham Levitt's lead and moved to the suburbs in the 1950's. Living in Islip, Long Island, the Lessings were no strangers to the suburbs. Therefore, it was natural for them to expand their business beyond their Wall Street operations. They signed food service management contracts to feed Maxson Electronics, American Airlines, Michelin Tire and Great American Insurance Co. These strategic moves would change the face of their business and prove to be the salvation of the company. Jack and Larry successfully combined strategic thinking, aggressive marketing and careful management of detail to guide Lessing’s Hospitality Group through the two most difficult economic decades in modern food service history. As Manhattan became a more competitive market, the brothers expanded the company to the suburbs and continued the transformation of their company from a local chain of office building lunch counters to a regional food service management powerhouse. Another instinctive choice by the next generation of Lessings kept the company growing and thriving when others had failed.\nDIVERSIFICATION (1980 - PRESENT)\nTight-knit Irish clans are often guided by an invisible hand. When I asked Jack, the Chairman of Lessing’s Hospitality Group, when the family first got into the retail restaurant business he answered, \"It wasn't until 1977. My mother, a devout Irish Catholic, never wanted the family to sell liquor.\"\nBut in 1977, a friend of Jack's told him that the only bar in Breezy Point (the now world-famous New York Irish police and fireman's community destroyed in Hurricane Sandy) was for sale. The Bay Terrace Bar was the only pub in a community of 3,800 homes occupied by New York's firefighters and policemen. \"It was a gold mine,\" Jack said. \"We used to sell 250 cases of beer on a Saturday night. That was a lot of beer in 1977.\" He was hooked. The family began to diversify beyond contract food service into the retail restaurant business at just the right time.\nContract food service, a business that Lessing’s Hospitality Group had originated and built for 40 years, was becoming a commodity business by the late 1970s. Once the industry saw the food service market niche that Lessing’s Hospitality Group had created, everyone got into the business. Big corporations like Servomation and the Canteen Corporation joined hundreds of small independent contractors in increasing competition, until there were 8 or 9 bids submitted on every account. \"Our B&I business was still strong because our customers were loyal, but it became harder and harder to make a profit in contract food service,\" Jack said. He saw how the cash flow from the Bay Terrace Bar could supplement the reliable but slim margins in contract food service, so he began to diversify into retail restaurants.\nTHE MAIN STREET INNOVATION\nPrior to the 1980s, restaurant chains were not well received on Long Island, so few national chains bothered to open units in one of the nation's most densely populated suburbs. Long Islanders seemed to gravitate more towards local restaurants. The Lessings knew that any restaurant they opened must feel like a \"local joint\". They watched the success of the Bay Terrace Bar and waited for the Lessing innovation impulse to kick in. Eventually, they decided to open cafes that would serve the local clientele along Montauk Highway, the road that had become the Main Street of Long Island's South Shore villages. They would locate them in historic town buildings that the long-time residents were familiar with. In 1978, the Lessings opened their first Main Street restaurant in the historic post office building that had served the town of Babylon for many years. The Post Office Café quickly came to be considered a local place Babylon customers felt comfortable and at home in, and it has been going strong ever since.\nEXPANSION\nBy the 1980s, the Main Streets along Long Island's South Shore were becoming gentrified by the growth of more modern shopping centers opening on Sunrise Highway.\nWith the Post Office Café booming, the Lessings migrated east along Montauk Highway to the little town of Bay Shore and opened their second Main Street Restaurant in the town's original fire house. The youth of Suffolk County instantly made the Firehouse the most popular young club on all of Long Island. Thirty years later the Lessings purchased the historic Southside Hotel, Bay Shore's original \"local joint\" across the street from the Firehouse.\nHistory will record that Lessing’s Hospitality Group’s “Main Street restaurant” concept ignited a revival movement that has brought these historic Long Island Main Streets back to life.\nWhen the original library closed in Farmingdale, Long Island, the Lessings bought the building and opened another Main Street restaurant, the Library Café. Each restaurant's success drove the Lessings along the same strategic path – find and purchase historic Long Island buildings that were icons to the local clientele. They opened Maxwell's on Main Street in Islip and bought the Huntington landmark, Finnegan's, perhaps the most \"local\" of all their Main Street pubs and cafés.\nCONCESSIONS\nDuring the 1970s and 80s, Lessing’s Hospitality Group was also operating over 100 concession locations at state, county and town parks from Montauk to Long Beach. They were the biggest picnic caterers in the state, at times feeding as many as 10,000 people. They operated the concessions at the now legendary Hecksher State Park, Eisenhower Park, Bethpage State Park, Sunken Meadow and Tobay Beach.\nFINE DINING\nIn the 90s, the Lessings made another strategic decision when they began operating the most historic and iconic building of all, the Three Village Inn in Stony Brook, Long Island. Built in 1751, the Three Village Inn had served as a summerhouse, a Women's Exchange, a simple tearoom and a fine country inn. In this historic location, the Lessings expanded beyond their pub and cafe style Main Street restaurants to enter the fine dining segment with their now famous Mirabelle Restaurant & Tavern.\nCOMBINING INNOVATIONS\nThe Saxon Arms restaurant in Oakdale enjoyed the best waterfront view of the Great South Bay anywhere on Long Island. Lessing’s Hospitality Group bought this local favorite, changed the name to (what else?) View, refurbished the building and the menu and now operates the most popular dockside restaurant on Long Island's South Shore.\nCATERING\nThe insight to appeal to local tastes by instantly becoming part of the local cultural heritage was a brilliant innovation. During the 1990s, the Lessings began a rapid expansion into the catering business by utilizing the same innovative instinct that served them so well in retail restaurants.\nLong Island was comprised of rural farms and small seaport villages until the turn of the 20th century, when the great family fortunes created by the industrial revolution built vast estates on Long Island. More than 1,200 grand estates were built along the North Shore's \"Gold Coast\" of Great Gatsby fame. Many of these mansions remain in existence throughout Long Island to this day.\nBy the 1950s, grand-estate living was going out of style, and many of the mansions were turned over to colleges, charities and religious orders. Knowing that these estates were considered the best addresses in many local towns and villages, the Lessings decided to lease, license, or buy them for catering locations. What local bride would not want to be married in the grandest estate house in her village?\nLessing’s Hospitality Group now offers Long Island brides the opportunity to hold their wedding reception at Bourne Mansion, Whitby Castle, Chateau at Coindre Hall, Mansion at Timber Point, Mansion at West Sayville, The Vineyards in Aquebogue and Estate at Three Village Inn, to name just a few. These iconic locations have become so popular that Lessing’s Hospitality Group now caters more than 1,000 weddings a year.\nIN THE PRESENT\nFrom the beginning, Maxwell Lessing set out to be a trailblazer in the food and beverage industry.  Today Lessing’s Hospitality Group continues to be an industry leader, and the company is still managed by the present generation of Lessings, who carry out Maxwell’s legacy every day. Most recently, Lessing's has expanded  their portfolio to Florida, with the Crane Club at Tesoro, Charlie & Joe's at Love Street and now, New York City with Ellen's Stardust Diner & The Iridium.\nAUTHOR'S NOTE\nIn this history I have attempted to reveal the secrets of longevity and consistency that enabled Lessing’s Hospitality Group to survive and thrive for 135 years in the world's most competitive food service market. How did each generation attract the next generation into the business? How did they survive ever-changing tastes, a volatile commodity market, two world wars, the Great Depression and the Great Recession, inevitable family squabbles, an increasingly contentious legal environment and stiff competition from well-financed public companies? What was the magic?\nEach Lessing generation, from Maxwell to the present, never took survival for granted. They responded to changing market conditions with CREATIVE INNOVATION.\nAuthor, Francis Bennett, freelance writer\nIN THE NEWS\nHealthy Eating: Long Island hospitals provide food for life\nLong Island Business News announces 2025 Icon Honors\nLIBN: Après the pandemic: restaurants going full steam ahead\nPalm Beach North Podcast: Building a Legacy: Michael Lessing On Six Generations of Hospitality\nIn The Lead: Family Owned Businesses\nLong Island Restaurant Week begins Sunday\nLes Paul Remembered In Exhibit Opening Monday\nThese LI restaurants rank among world’s best for wine: Wine Spectator\nHidden Gems: Meet Lawrence Lessing of Lessing’s Hospitality Group\nLessing's Hospitality Group: Catering Remarkable Hospitality Services through Tailored Packages\nDO GOOD\nCharlie & Joe’s delivers 6,800 pantry boxes to needy\nBlaze Pizza donates pizzas to Good Samaritan\nNewsday - Healthcare Worker Discounts\nGreater Long Island - Lessing's Donates 5,000 Meals\nLong Island Restaurant News - Spread The Cheer\nSustainable Brands - Hatch DoGood Pancakes\nLI Restaurant News - Veterans Day\nGreater Long Island - Lessing's Gives Back On Veterans Day\nLIBN - Hospitality Group Gives Back on Veterans Day\nLong Island Press - Lessing's Helps FCA Celebrate 135 Years\nGreater Long Island - Lessing's Helps FCA Celebrate 135 Years\nPatch - Creek Cleanup\nLIBN - Creek Cleanup\nNewsday - Creek Cleanup\nStony Brook Creek Cleanup Video Footage\nGreater Long Island - Stony Brook Creek Cleanup\nTotal Food Service - Lessing's Hospitality Group Takes Initiative to \"Do Good\" for Earth Day\nThe List Magazine - Lessing's is Doing Good\nNewsday - Working to Ease Long Island Hunger\nBrentwood-Central Islip Patch - Lessing's Hospitality Group Launces \"Do Good\" Initiative\nAWARDS\nJOIN OUR TEAM\nA leader in the hospitality industry since 1890, Lessing's Hospitality Group offers many possibilities for employment and advancement.\nApply today.\nLink to database - <ul><p>No careers have been posted at this time.</p></ul>\nCONTACT US\nCorporate Headquarters\n3500 Sunrise Highway\nBldg 100, Suite 100\nGreat River, NY 11739\n631.567.8200\nSend Email\nNew York City Office\n950 3rd Avenue\nFloor 16\nNew York, NY 10019\n212.764.3450\nSend Email\nFlorida Office\n825 S US Highway 1\n2nd Floor, Suite 230\nJupiter, FL 33477\n561.768.9118\nSend Email\nSITE MAP\nCONTACT\nPRIVACY STATEMENT\nTERMS OF USE\nTERMS FOR ONLINE PURCHASES\nACCESSIBILITY\n<li><a href=\"https://twitter.com/lessingsinc\" target=\"_blank\"><img src=\"https://www.lessings.com/corporate/webimages/_core/s_social_icon_twitter.png\" alt=\"Twitter\" /></a></li>\n© 2025 Lessing's Hospitality Group. All rights reserved.\nkeyboard_arrow_up\narrow navigation\nscroll to top\nfixed box\nset submenus for WCAG",
      "emails": [
        "info@lessings.com"
      ]
    },
    {
      "url": "https://www.lessings.com/corporate/weddings/venue/lessings-events",
      "is_candidate": false,
      "has_email": false,
      "text": "Google Tag Manager (noscript)\nEnd Google Tag Manager (noscript)\nSkip to Main Content\nGo to Accessbility Settings\nTo Shop Lessing’s Gift Cards,\nclick here\nmenu\nABOUT\nOur Mission\nOur Company\nOur People\nOur Story\nIn the News\nAwards\nJoin Our Team\nContact Us\nWEDDINGS\nEvents\nSeasonal Events\nWedding Showcases\nExclusives & Packages\nLocations\nNew Venues\nLong Island\nNYC - Westchester\nFlorida\nRESTAURANTS\nEvents\nSeasonal Events\nLocations\nLong Island\nNew York City\nFlorida\nCountry Clubs\nPopup Kitchens\nCountry Clubs\nGrill Room at Timber Point\nThe Bethpage Public House\nThe Grill Room at West Sayville\nThe Turn at Port Jefferson\nThe Terrace at 360 East\nOFF‑PREMISE\nNew York\nEast End\nBrecknock Hall\nMontauk Manor\nParrish Art Museum\nPeconic River Herb Farm\nPindar Vineyards\nSalt Air Farm\nLong Island\nParks and Picnics\nThe Bates House\nVanderbilt\nUpstate New York\nKindred Creeks Farm\nNew York City\n630 Second\nCentral Park\nF. Ottomanelli By The Water\nGolf & Body\nHammerstein Ballroom\nMetropolitan Pavilion\nMidtown Loft\nPenn Plaza Pavilion\nRamscale Studio\nStudio 450\nStudio 525\nThe Altman Building\nThe Pillars\nUkrainian Institute\nFlorida\n5 Star Hospitality\nLessing's Events\nConnecticut\nThe Knowlton\nPRIVATE EVENTS\nEvent Spaces\nLong Island\nNYC-Westchester\nFlorida\nRestaurants\nLong Island\nNew York City\nFlorida\nFOOD SERVICE\nMANAGEMENT SERVICES\nEMERGENCY DINING\nHOTEL\nHOME\nABOUT\nWEDDINGS\nRESTAURANTS\nOFF PREMISE CATERING\nPRIVATE EVENTS\nFOOD SERVICE\nMANAGEMENT SERVICES\nEMERGENCY DINING\nHOTEL\nGIFT CARDS\nREWARDS\nSITE MAP\nCONTACT\nnavigate_before\npause_circle_filled\nnavigate_next\nMENUS\nGALLERY\nVENUE INFORMATION\nREQUEST INFORMATION\nBROCHURE\nMAILING LIST\nDIRECTIONS\nStriving for excellence, the Lessing’s Events Off-Premise team, comprised of renowned chefs and 135 years of experience, are leaders in the hospitality\r\nindustry as world-class caterers. Hosting corporate events, fundraisers, extravagant private affairs and more, Lessing’s Events is proud to offer their clients\r\nthe best of the best. Lessing’s is excited to offer our services across South Florida, from Delray Beach to Palm Beach and as far north as Port St. Lucie.\n5745 Columbia Circle\nWest Palm Beach, FL 33407\nTel: 631-335-0432\nLocation Type:\nEvent Spaces\nbethpage public house\nMENUS\nSocial Events\nLessing's Events\nGALLERY\nBOOKING INFORMATION\nPrice range per person:\nCall For Details\nRoom fee:\nSubject to Venue Selection\nAdvanced booking required:\nYes\nAdvanced deposit required:\nCall For Details\nSeasonal pricing flexibility:\nYes\nRoom availability (hours):\nAll Hours\nSITE MAP\nCONTACT\nPRIVACY STATEMENT\nTERMS OF USE\nTERMS FOR ONLINE PURCHASES\nACCESSIBILITY\n<li><a href=\"https://twitter.com/lessingsinc\" target=\"_blank\"><img src=\"https://www.lessings.com/corporate/webimages/_core/s_social_icon_twitter.png\" alt=\"Twitter\" /></a></li>\n© 2025 Lessing's Hospitality Group. All rights reserved.\nkeyboard_arrow_up\narrow navigation\nscroll to top\nfixed box\nset submenus for WCAG\nStart of HubSpot Embed Code\nEnd of HubSpot Embed Code",
      "emails": []
    },
    {
      "url": "https://www.lessings.com/corporate/about#people",
      "is_candidate": false,
      "has_email": true,
      "text": "Google Tag Manager (noscript)\nEnd Google Tag Manager (noscript)\nSkip to Main Content\nGo to Accessbility Settings\nTo Shop Lessing’s Gift Cards,\nclick here\nmenu\nABOUT\nOur Mission\nOur Company\nOur People\nOur Story\nIn the News\nAwards\nJoin Our Team\nContact Us\nWEDDINGS\nEvents\nSeasonal Events\nWedding Showcases\nExclusives & Packages\nLocations\nNew Venues\nLong Island\nNYC - Westchester\nFlorida\nRESTAURANTS\nEvents\nSeasonal Events\nLocations\nLong Island\nNew York City\nFlorida\nCountry Clubs\nPopup Kitchens\nCountry Clubs\nGrill Room at Timber Point\nThe Bethpage Public House\nThe Grill Room at West Sayville\nThe Turn at Port Jefferson\nThe Terrace at 360 East\nOFF‑PREMISE\nNew York\nEast End\nBrecknock Hall\nMontauk Manor\nParrish Art Museum\nPeconic River Herb Farm\nPindar Vineyards\nSalt Air Farm\nLong Island\nParks and Picnics\nThe Bates House\nVanderbilt\nUpstate New York\nKindred Creeks Farm\nNew York City\n630 Second\nCentral Park\nF. Ottomanelli By The Water\nGolf & Body\nHammerstein Ballroom\nMetropolitan Pavilion\nMidtown Loft\nPenn Plaza Pavilion\nRamscale Studio\nStudio 450\nStudio 525\nThe Altman Building\nThe Pillars\nUkrainian Institute\nFlorida\n5 Star Hospitality\nLessing's Events\nConnecticut\nThe Knowlton\nPRIVATE EVENTS\nEvent Spaces\nLong Island\nNYC-Westchester\nFlorida\nRestaurants\nLong Island\nNew York City\nFlorida\nFOOD SERVICE\nMANAGEMENT SERVICES\nEMERGENCY DINING\nHOTEL\nHOME\nABOUT\nWEDDINGS\nRESTAURANTS\nOFF PREMISE CATERING\nPRIVATE EVENTS\nFOOD SERVICE\nMANAGEMENT SERVICES\nEMERGENCY DINING\nHOTEL\nGIFT CARDS\nREWARDS\nSITE MAP\nCONTACT\nnavigate_before\npause_circle_filled\nnavigate_next\nOUR MISSION\nOUR CORE VALUES\nOUR COMPANY\nOUR PEOPLE\nOUR STORY\nIN THE NEWS\nAWARDS\nJOIN OUR TEAM\nCONTACT US\nOUR MISSION\nLessing's... A Legacy of Remarkable Hospitality.\nTo continue our 135-year tradition of innovation and excellence - providing unique restaurant concepts, exclusive wedding venues, distinctive catering, and skillfully executed food service management.\nOUR CORE VALUES\nGrowth:\nLearning sparked by curiosity drives our passion for continuous improvement.\nInnovation:\nWe challenge the status quo with forward-thinking, and constantly adapt to ever-changing demands.\nDiversity:\nWe seek, welcome, and respect diverse perceptions, backgrounds, and experiences.\nHospitality:\nRemarkable actions create memorable experiences.\nIntegrity:\nWe are genuine people guided by morals.\nLegacy:\nHonoring the traditions of our past, we build the legacy of our future.\nOUR COMPANY\nLessing’s Hospitality Group is comprised of over 100 locations throughout the Northeast and Florida. Lessing’s operates 23 wedding and catering venues, 16 full-service restaurants, over 75 corporate and academic dining centers, a historic inn, and a presidential yacht. Steeped in 135 years of tradition, Lessing’s Hospitality Group’s focus is on providing each guest and client with unique, personalized experiences and remarkable hospitality.\nOUR PEOPLE\nStephen M Lessing\nChairman\nMichael Lessing\nChief Executive Officer\nJohn Lessing\nSenior Advisor\nScott McKelvey\nChief Financial Officer\nLawrence Lessing\nChief Operating Officer\nEllen Barrett\nExecutive Vice President\nHuman Resources\nMark Lessing\nExecutive Vice President\nRestaurants\nJohn S. Lessing Jr.\nExecutive Vice President\nFacilities & Maintenance\nKevin Lessing\nExecutive Vice President\nLFSM Group\nHolly Lynch\nVice President of Finance\nSteve Kirschbaum\nVice President of Catering\nNortheast\nMichele Palischak\nVice President of Catering\nSouth Florida\nGrant Lieberman\nVice President of Technology\nPeter Lessing\nDirector of System Analytics\nDavid Lessing\nDirector of Business Development\nGuy Reuge\nChef Emeritus Senior Advisor\nWilliam Muzio\nCorporate Executive Chef\nRestaurants\nEddie Michaels\nCorporate Executive Chef\nCatering\nOUR STORY\nA FAMILY OF INNOVATORS (1890-1940)\nThe oldest family-owned, continuously operated, highly diverse food service company in the United States is Lessing’s Hospitality Group in Great River, New York. The company was founded by Maxwell Lessing in 1890 and is operated to this day by 15 family members representing six generations of Lessing's. This highly diversified company feeds more than 40,000 guests a day at over 120 corporate, educational, country club and manufacturing plant locations throughout the Northeast and Florida. Lessing’s Hospitality Group also operates 23 high-end wedding and catering venues, 1 nightclub, 16 full service restaurants, 3 virtual kitchens, and a historic inn. The Lessing family has provided food service to New Yorkers for 135 years without interruption. Both the longevity and the success of this legacy company is unprecedented, especially in the food service and restaurant business.\n\"I decided to see if I could discover the secret to this family's success. What was it about the Lessing clan that set them apart from countless other restaurant companies that have come and gone from the food service scene? One hundred and thirty years in business is remarkable enough, but to have the same family operate the company the entire time is unheard of. My research into the company's history revealed the secret immediately.\"\nTHE LUNCH COUNTER\nMaxwell Lessing was an innovator. He responded to the explosion of the urban worker population in the 1890's by opening the first convenient lunch counter in New York's Financial District. For the first time in American history, workers who lived in boarding houses that supplied meals left home to go to work, forsaking one of their free meals. They had little time and less money for lunch. In addition, women were joining the work force in droves during this era and began to patronize places they once dared not enter, climbing onto lunch counter stools and venturing into cafes in the evening without escorts.\nBy 1893 the country had slipped into a severe four-year recession, and the self-service lunches available in saloons on the honor system began to suffer an enormous amount of theft. One after another, saloon owners were forced to eliminate these lunches. Maxwell again saw their setback as his opportunity, and he responded by expanding his low-price, pay-as-you-go lunch counter operation to multiple locations in office buildings around Wall Street.\nTHE COMMISSARY\nThen, he innovated again. With multiple locations to service, Maxwell established a commissary on Jones Lane close to his lunch counters in the Wall Street area. From the commissary he would prepare baked goods, sliced meats, salads, soups and hot foods to deliver to his locations and serve the long lines of office workers, who were rapidly running out of places to eat. Maxwell's commissary on Jones Lane was the first multi-unit restaurant commissary in the United States.\nTHE SANDWICH\nThe commissary concept was an innovation well before its time and led to another innovation that would become an American food staple - the sandwich. Maxwell didn't invent the sandwich, but Lessing’s Hospitality Group was the first company to serve sandwiches at lunch counters in New York City. Workers could either eat them at the lunch counters or take them away and enjoy them on a park bench or back in the quiet of their office.\nTHE COKE\nGreat innovators not only create innovative products, but also recognize innovation when they see it. Dr. Pemberton, perhaps one of the greatest innovators of all time, created Coca-Cola in 1886. In 1890, Asa G. Candler, the legendary President of the Coca-Cola Company, began to distribute coke syrup to soda fountains outside Atlanta. Maxwell Lessing was the first New York restaurateur to buy Coca-Cola syrup and serve Coke to his customers. The introduction of both the sandwich and the Coke by one small lunch counter operator in 1890's New York was an almost unimaginable great leap forward in food service.\nAccording to a New York Public Library exhibit on New York culture,\n\"of the three meals that mark the American day, lunch is the one that acquired its modern identity here on the streets of New York.\"\nTHE 1920'S\nThe 1920's is an important decade in Lessing history as it marked the birth of the modern restaurant industry. Maxwell had incorporated Lessing’s Hospitality Group in 1917 and was joined in the business by his son, Lawrence, in the 20's. The advent of national prohibition stripped away liquor profits, shifting emphasis to low-price, high volume food service. More people ate out than ever before. Famous pre-war restaurants closed, while cafeterias, luncheonettes and tearooms thrived.\nTHE LOCATION\nBy the late 1920's, Lessing’s Hospitality Group was serving meals to New York's workforce in as many as 20 locations, thanks to Lawrence's  great innovation.  He strategically acquired lunch counter space in the lobbies of newly constructed office buildings, among them the lunchrooms at 1 Broadway, 40 Wall Street, The Woolworth Building (at the time the tallest building in the world), the Equitable Building at 120 Broadway and The New York Stock Exchange.  It was the fulfillment of the now famous restaurant chain mantra, LOCATION-LOCATION-LOCATION. Ray Kroc took the words right out of Lawrence's mouth.\nCONTRACT FOOD SERVICE\nIn 1928, American Cable and Wireless decided to include an employee cafeteria in their new office building. Providing employees with a cafeteria was an innovation in itself in 1928, however Lawrence’s vision trumped even the cafeteria idea. Already operating a nascent multi-unit food service operation out of the Lessing’s Hospitality Group commissary on Jones Lane, he presented American Cable with a proposition. Rather than American Cable executives having to manage a large cafeteria with all the headaches inherent in such an operation, Lessing’s Hospitality Group would manage it for them on a contract basis. For a fee, Lawrence and his staff would take care of everything. With that one creative impulse, the contract food service industry was born in New York City. The Lessing innovation gene had struck again, and Lessing’s Hospitality Group was off and running in an entirely new industry.\nRESTAURANT CHAIN\nBy the 1930's, retail stores saw the wisdom in the conveniently located lunch counter and decided to get into the act. The lunch counter business exploded in dense urban centers, giving rise to iconic restaurant chains such as Schrafft's, Childs, Horn & Hardart, Lofts' and Bickford's. It is worth noting that of all these famous restaurant chains, only Lessing’s Hospitality Group is still in business.\nTHE WAR YEARS\nWith the Japanese attack on Pearl Harbor in 1941, New York City was transformed into the metropolitan hub of America's massive war effort. Every inch of office space in the buildings around Wall Street, where the Lessing’s Hospitality Group chain of coffee shops was located, was given over to the war effort in one way or another. In a laboratory at Columbia University, Enrico Fermi began work on atomic particles that led to the top-secret development of the atomic bomb, called the Manhattan Project. This work on uranium enrichment took place in secret offices located in the Woolworth building above the Lessing’s Hospitality Group coffee shop. Across the Brooklyn Bridge, the Pfizer Company converted an enormous ice plant into history's first penicillin factory and began the wartime manufacture of their life-saving discovery. The Brooklyn Navy Yard quickly became the world's largest shipbuilding facility, employing more than 75,000 people by 1942. The port of New York became the primary point of embarkation for the millions of U.S. soldiers shipped overseas to the war zone. Between 1942 and 1945, 1.86 million New Yorkers themselves joined the armed forces.\nLawrence responded to New York's exploding demand to feed millions of non-combatant wartime support personnel by rapidly expanding the company's coffee shop locations to five additional buildings in lower Manhattan and doubling the commissary staff on Jones Lane. Like so many other iconic American companies who responded to wartime demand, Lessing’s Hospitality Group emerged from the war a more substantial and professional company prepared to thrive during the post war economic boom that would engulf the nation.\nLAWRENCE LESSING JR.\nThe \"Happy Days\" of the 1950's were the perfect setting for Lawrence's innovative personality. Prior to the rise of American consumerism brought on by World War II, small businessmen saw themselves as humble shopkeepers. They were good at working hard tending to the nuts and bolts of their businesses. Small food service operators were usually good in the kitchen and rarely stepped out from behind the counter to embrace the bigger picture. Lawrence, however, saw the potential of making connections with the movers and shakers of the industries booming around him. He decided to leave the day to day operations to trusted employees while he told the Lessing story to decision makers who could use Lessing’s expertise but didn't know it yet. This innovative change in the role of the humble shopkeeper transformed Lessing from a little lunch counter operator into a highly regarded food service contractor. He called on every company executive who would listen, and before long Lessing’s Hospitality Group began to handle the food service for America's corporate giants like New York Trust, Chemical Bank, Reynolds & Co., Smith Barney, Goldman Sachs, Regis Paper and the New York Stock Exchange.\nTHE NEXT GENERATION\nBecause of Lawrence's success in making Lessing’s Hospitality Group a well-known name in food service management, the company was becoming a far more substantial and complex firm by the end of the 1950's. It was time for the next generation of Lessings to step up and guide the company into the modern age. Lawrence's son John, known as Jack, joined the company in 1958 and John's brother Lawrence III, known as Larry, followed a year later. Inspired by their father's love of the business, and with the Lessing gene working its particular magic, the brothers adopted very different roles in guiding Lessing’s Hospitality Group. Jack, like his father, was an expansive visionary who could connect with the wide variety of constituents that Lessing’s Hospitality Group now served, while Larry put his orderly logical mind to the task of managing the now highly complex, day-to-day business.\nTHE 1960'S AND 70'S\nThe 60's and 70's were very difficult for food service in the New York metropolitan area. For the first time in history, the population of New York City began to decline. Wartime industries either closed or moved to more economic locations. The New York City economic boom created by the war and the immediate post war period had created formidable competition. Companies such as Schrafft's, Child's, Savarin, Horn and Hardart and Stouffer's were all competing for both the coffee shop and the food service management dollar. The Wall Street banks would suffer two major recessions, and an industry reorganization moved most of the corporate headquarters' employees away from Wall Street. Culinary unions were ascendant during this period, and they eventually organized the Lessing bakers at 155 West 19th Street. The food service boom had ended, and the decades of the 60's and 70's would challenge the Lessing brothers to find new methods and new markets in which to do business.\nCITY MOUSE - COUNTRY MOUSE\nMillions of Americans followed Abraham Levitt's lead and moved to the suburbs in the 1950's. Living in Islip, Long Island, the Lessings were no strangers to the suburbs. Therefore, it was natural for them to expand their business beyond their Wall Street operations. They signed food service management contracts to feed Maxson Electronics, American Airlines, Michelin Tire and Great American Insurance Co. These strategic moves would change the face of their business and prove to be the salvation of the company. Jack and Larry successfully combined strategic thinking, aggressive marketing and careful management of detail to guide Lessing’s Hospitality Group through the two most difficult economic decades in modern food service history. As Manhattan became a more competitive market, the brothers expanded the company to the suburbs and continued the transformation of their company from a local chain of office building lunch counters to a regional food service management powerhouse. Another instinctive choice by the next generation of Lessings kept the company growing and thriving when others had failed.\nDIVERSIFICATION (1980 - PRESENT)\nTight-knit Irish clans are often guided by an invisible hand. When I asked Jack, the Chairman of Lessing’s Hospitality Group, when the family first got into the retail restaurant business he answered, \"It wasn't until 1977. My mother, a devout Irish Catholic, never wanted the family to sell liquor.\"\nBut in 1977, a friend of Jack's told him that the only bar in Breezy Point (the now world-famous New York Irish police and fireman's community destroyed in Hurricane Sandy) was for sale. The Bay Terrace Bar was the only pub in a community of 3,800 homes occupied by New York's firefighters and policemen. \"It was a gold mine,\" Jack said. \"We used to sell 250 cases of beer on a Saturday night. That was a lot of beer in 1977.\" He was hooked. The family began to diversify beyond contract food service into the retail restaurant business at just the right time.\nContract food service, a business that Lessing’s Hospitality Group had originated and built for 40 years, was becoming a commodity business by the late 1970s. Once the industry saw the food service market niche that Lessing’s Hospitality Group had created, everyone got into the business. Big corporations like Servomation and the Canteen Corporation joined hundreds of small independent contractors in increasing competition, until there were 8 or 9 bids submitted on every account. \"Our B&I business was still strong because our customers were loyal, but it became harder and harder to make a profit in contract food service,\" Jack said. He saw how the cash flow from the Bay Terrace Bar could supplement the reliable but slim margins in contract food service, so he began to diversify into retail restaurants.\nTHE MAIN STREET INNOVATION\nPrior to the 1980s, restaurant chains were not well received on Long Island, so few national chains bothered to open units in one of the nation's most densely populated suburbs. Long Islanders seemed to gravitate more towards local restaurants. The Lessings knew that any restaurant they opened must feel like a \"local joint\". They watched the success of the Bay Terrace Bar and waited for the Lessing innovation impulse to kick in. Eventually, they decided to open cafes that would serve the local clientele along Montauk Highway, the road that had become the Main Street of Long Island's South Shore villages. They would locate them in historic town buildings that the long-time residents were familiar with. In 1978, the Lessings opened their first Main Street restaurant in the historic post office building that had served the town of Babylon for many years. The Post Office Café quickly came to be considered a local place Babylon customers felt comfortable and at home in, and it has been going strong ever since.\nEXPANSION\nBy the 1980s, the Main Streets along Long Island's South Shore were becoming gentrified by the growth of more modern shopping centers opening on Sunrise Highway.\nWith the Post Office Café booming, the Lessings migrated east along Montauk Highway to the little town of Bay Shore and opened their second Main Street Restaurant in the town's original fire house. The youth of Suffolk County instantly made the Firehouse the most popular young club on all of Long Island. Thirty years later the Lessings purchased the historic Southside Hotel, Bay Shore's original \"local joint\" across the street from the Firehouse.\nHistory will record that Lessing’s Hospitality Group’s “Main Street restaurant” concept ignited a revival movement that has brought these historic Long Island Main Streets back to life.\nWhen the original library closed in Farmingdale, Long Island, the Lessings bought the building and opened another Main Street restaurant, the Library Café. Each restaurant's success drove the Lessings along the same strategic path – find and purchase historic Long Island buildings that were icons to the local clientele. They opened Maxwell's on Main Street in Islip and bought the Huntington landmark, Finnegan's, perhaps the most \"local\" of all their Main Street pubs and cafés.\nCONCESSIONS\nDuring the 1970s and 80s, Lessing’s Hospitality Group was also operating over 100 concession locations at state, county and town parks from Montauk to Long Beach. They were the biggest picnic caterers in the state, at times feeding as many as 10,000 people. They operated the concessions at the now legendary Hecksher State Park, Eisenhower Park, Bethpage State Park, Sunken Meadow and Tobay Beach.\nFINE DINING\nIn the 90s, the Lessings made another strategic decision when they began operating the most historic and iconic building of all, the Three Village Inn in Stony Brook, Long Island. Built in 1751, the Three Village Inn had served as a summerhouse, a Women's Exchange, a simple tearoom and a fine country inn. In this historic location, the Lessings expanded beyond their pub and cafe style Main Street restaurants to enter the fine dining segment with their now famous Mirabelle Restaurant & Tavern.\nCOMBINING INNOVATIONS\nThe Saxon Arms restaurant in Oakdale enjoyed the best waterfront view of the Great South Bay anywhere on Long Island. Lessing’s Hospitality Group bought this local favorite, changed the name to (what else?) View, refurbished the building and the menu and now operates the most popular dockside restaurant on Long Island's South Shore.\nCATERING\nThe insight to appeal to local tastes by instantly becoming part of the local cultural heritage was a brilliant innovation. During the 1990s, the Lessings began a rapid expansion into the catering business by utilizing the same innovative instinct that served them so well in retail restaurants.\nLong Island was comprised of rural farms and small seaport villages until the turn of the 20th century, when the great family fortunes created by the industrial revolution built vast estates on Long Island. More than 1,200 grand estates were built along the North Shore's \"Gold Coast\" of Great Gatsby fame. Many of these mansions remain in existence throughout Long Island to this day.\nBy the 1950s, grand-estate living was going out of style, and many of the mansions were turned over to colleges, charities and religious orders. Knowing that these estates were considered the best addresses in many local towns and villages, the Lessings decided to lease, license, or buy them for catering locations. What local bride would not want to be married in the grandest estate house in her village?\nLessing’s Hospitality Group now offers Long Island brides the opportunity to hold their wedding reception at Bourne Mansion, Whitby Castle, Chateau at Coindre Hall, Mansion at Timber Point, Mansion at West Sayville, The Vineyards in Aquebogue and Estate at Three Village Inn, to name just a few. These iconic locations have become so popular that Lessing’s Hospitality Group now caters more than 1,000 weddings a year.\nIN THE PRESENT\nFrom the beginning, Maxwell Lessing set out to be a trailblazer in the food and beverage industry.  Today Lessing’s Hospitality Group continues to be an industry leader, and the company is still managed by the present generation of Lessings, who carry out Maxwell’s legacy every day. Most recently, Lessing's has expanded  their portfolio to Florida, with the Crane Club at Tesoro, Charlie & Joe's at Love Street and now, New York City with Ellen's Stardust Diner & The Iridium.\nAUTHOR'S NOTE\nIn this history I have attempted to reveal the secrets of longevity and consistency that enabled Lessing’s Hospitality Group to survive and thrive for 135 years in the world's most competitive food service market. How did each generation attract the next generation into the business? How did they survive ever-changing tastes, a volatile commodity market, two world wars, the Great Depression and the Great Recession, inevitable family squabbles, an increasingly contentious legal environment and stiff competition from well-financed public companies? What was the magic?\nEach Lessing generation, from Maxwell to the present, never took survival for granted. They responded to changing market conditions with CREATIVE INNOVATION.\nAuthor, Francis Bennett, freelance writer\nIN THE NEWS\nHealthy Eating: Long Island hospitals provide food for life\nLong Island Business News announces 2025 Icon Honors\nLIBN: Après the pandemic: restaurants going full steam ahead\nPalm Beach North Podcast: Building a Legacy: Michael Lessing On Six Generations of Hospitality\nIn The Lead: Family Owned Businesses\nLong Island Restaurant Week begins Sunday\nLes Paul Remembered In Exhibit Opening Monday\nThese LI restaurants rank among world’s best for wine: Wine Spectator\nHidden Gems: Meet Lawrence Lessing of Lessing’s Hospitality Group\nLessing's Hospitality Group: Catering Remarkable Hospitality Services through Tailored Packages\nDO GOOD\nCharlie & Joe’s delivers 6,800 pantry boxes to needy\nBlaze Pizza donates pizzas to Good Samaritan\nNewsday - Healthcare Worker Discounts\nGreater Long Island - Lessing's Donates 5,000 Meals\nLong Island Restaurant News - Spread The Cheer\nSustainable Brands - Hatch DoGood Pancakes\nLI Restaurant News - Veterans Day\nGreater Long Island - Lessing's Gives Back On Veterans Day\nLIBN - Hospitality Group Gives Back on Veterans Day\nLong Island Press - Lessing's Helps FCA Celebrate 135 Years\nGreater Long Island - Lessing's Helps FCA Celebrate 135 Years\nPatch - Creek Cleanup\nLIBN - Creek Cleanup\nNewsday - Creek Cleanup\nStony Brook Creek Cleanup Video Footage\nGreater Long Island - Stony Brook Creek Cleanup\nTotal Food Service - Lessing's Hospitality Group Takes Initiative to \"Do Good\" for Earth Day\nThe List Magazine - Lessing's is Doing Good\nNewsday - Working to Ease Long Island Hunger\nBrentwood-Central Islip Patch - Lessing's Hospitality Group Launces \"Do Good\" Initiative\nAWARDS\nJOIN OUR TEAM\nA leader in the hospitality industry since 1890, Lessing's Hospitality Group offers many possibilities for employment and advancement.\nApply today.\nLink to database - <ul><p>No careers have been posted at this time.</p></ul>\nCONTACT US\nCorporate Headquarters\n3500 Sunrise Highway\nBldg 100, Suite 100\nGreat River, NY 11739\n631.567.8200\nSend Email\nNew York City Office\n950 3rd Avenue\nFloor 16\nNew York, NY 10019\n212.764.3450\nSend Email\nFlorida Office\n825 S US Highway 1\n2nd Floor, Suite 230\nJupiter, FL 33477\n561.768.9118\nSend Email\nSITE MAP\nCONTACT\nPRIVACY STATEMENT\nTERMS OF USE\nTERMS FOR ONLINE PURCHASES\nACCESSIBILITY\n<li><a href=\"https://twitter.com/lessingsinc\" target=\"_blank\"><img src=\"https://www.lessings.com/corporate/webimages/_core/s_social_icon_twitter.png\" alt=\"Twitter\" /></a></li>\n© 2025 Lessing's Hospitality Group. All rights reserved.\nkeyboard_arrow_up\narrow navigation\nscroll to top\nfixed box\nset submenus for WCAG",
      "emails": [
        "info@lessings.com"
      ]
    },
    {
      "url": "https://www.lessings.com/corporate/weddings/venue/kravis-events",
      "is_candidate": false,
      "has_email": false,
      "text": "Google Tag Manager (noscript)\nEnd Google Tag Manager (noscript)\nSkip to Main Content\nGo to Accessbility Settings\nTo Shop Lessing’s Gift Cards,\nclick here\nmenu\nABOUT\nOur Mission\nOur Company\nOur People\nOur Story\nIn the News\nAwards\nJoin Our Team\nContact Us\nWEDDINGS\nEvents\nSeasonal Events\nWedding Showcases\nExclusives & Packages\nLocations\nNew Venues\nLong Island\nNYC - Westchester\nFlorida\nRESTAURANTS\nEvents\nSeasonal Events\nLocations\nLong Island\nNew York City\nFlorida\nCountry Clubs\nPopup Kitchens\nCountry Clubs\nGrill Room at Timber Point\nThe Bethpage Public House\nThe Grill Room at West Sayville\nThe Turn at Port Jefferson\nThe Terrace at 360 East\nOFF‑PREMISE\nNew York\nEast End\nBrecknock Hall\nMontauk Manor\nParrish Art Museum\nPeconic River Herb Farm\nPindar Vineyards\nSalt Air Farm\nLong Island\nParks and Picnics\nThe Bates House\nVanderbilt\nUpstate New York\nKindred Creeks Farm\nNew York City\n630 Second\nCentral Park\nF. Ottomanelli By The Water\nGolf & Body\nHammerstein Ballroom\nMetropolitan Pavilion\nMidtown Loft\nPenn Plaza Pavilion\nRamscale Studio\nStudio 450\nStudio 525\nThe Altman Building\nThe Pillars\nUkrainian Institute\nFlorida\n5 Star Hospitality\nLessing's Events\nConnecticut\nThe Knowlton\nPRIVATE EVENTS\nEvent Spaces\nLong Island\nNYC-Westchester\nFlorida\nRestaurants\nLong Island\nNew York City\nFlorida\nFOOD SERVICE\nMANAGEMENT SERVICES\nEMERGENCY DINING\nHOTEL\nHOME\nABOUT\nWEDDINGS\nRESTAURANTS\nOFF PREMISE CATERING\nPRIVATE EVENTS\nFOOD SERVICE\nMANAGEMENT SERVICES\nEMERGENCY DINING\nHOTEL\nGIFT CARDS\nREWARDS\nSITE MAP\nCONTACT\nnavigate_before\npause_circle_filled\nnavigate_next\nSCHEDULE A TOUR\nMENUS\nVIRTUAL TOUR\nGALLERY\nVENUE INFORMATION\nREQUEST INFORMATION\nPARTNERS\nMAILING LIST\nAWARDS\nDIRECTIONS\nStep into a world of grandeur at the Kravis Center Events, the perfect venue for your next memorable celebration or corporate gathering. Our majestic ballroom, accommodating up to 700 guests, provides an awe-inspiring backdrop for any event, from grand galas to dynamic conferences. Experience the seamless integration of top-tier technology, professional event management, and unparalleled service. With Kravis Center, your event isn't just another date on the calendar—it's the social highlight of the year.\n701 Okeechobee Boulevard\nWest Palm Beach, FL 33401\nTel: 561-651-4444\nLocation Type:\nEvent Spaces\nbethpage public house\nMENUS\nWeddings\nWedding Menu\nWedding Guidelines\nSocial Events\nReception Menu\nBreakfast Buffet\nPlated Breakfast\nBoxed Lunch\nLunch Buffet\nPlated Lunch\nPlated Dinner\nCoffee Break\nTraditional Prom\nPremium Prom\nKravis Events Catering\nBar Packages\nDinner Menu\nOutside Catering\nVIRTUAL TOUR\nGALLERY\nIN THE NEWS\nKravis Center Names New Caterer - Broadway World\nVENUE INFORMATION\nCapacity (reception):\n700\nCapacity (dinner):\n700\nMax. affairs (at same time):\n2\nSeparate reception room:\nYes\nOutdoor reception area:\nNo\nOutdoor cocktail area:\nNo\nTerrace:\nNo\nDance floor:\nYes\nValet parking:\nUpon Request\nCoat check:\nUpon Request\nAir conditioned:\nYes\nOff premise available:\nYes\nIn-house party planner:\nNo\nLive music allowed:\nYes\nDJ allowed:\nYes\nAV equipment available:\nYes\nGuest accommodations:\nNo\nCuisine:\nAmerican\nKosher available:\nYes\nKitchen on premises:\nYes\nMust use in-house caterer:\nYes\nMust use in-house liquor:\nYes\nCeremony:\nYes\nBridal changing room:\nYes\nBOOKING INFORMATION\nPrice range per person:\nCall For Details\nAdvanced booking required:\nCall For Details\nAdvanced deposit required:\nYes\nSeasonal pricing flexibility:\nYes\nRoom availability (hours):\nAll Hours\nPARTNERS\nCAKES & DESSERTS\nEarth & Sugar\nPhone: 561.225.1260\nSweet Tiers Custom Cake Shoppe\nPhone: 772.546.8822\nWebsite:\nhttp://www.sweettierscustomcakes.com\nFLORAL & DESIGN\nCreative Florals\nPhone: 561.227.9102\nWebsite:\nhttp://www.creativefloralsfl.com\nDalsimer Atlas\nPhone: 561.483.2600\nWebsite:\nhttp://www.dalsimeratlas.com\nDaniel Events\nPhone: 800.660.2562\nWebsite:\nhttp://www.danielevents.com\nEvents by Robyn Von\nPhone: 561.856.9912\nWebsite:\nhttp://www.eventsbyrobynvon.com\nHarbour Bay Florist\nPhone: 772.221.1009\nWebsite:\nhttp://www.harbourbayflorist.com\nOrange Blossoms\nPhone: 561.568.0528\nWebsite:\nhttp://www.orangeblossomsflorals.com\nRenny & Reed\nPhone: 561.776.1122\nWebsite:\nhttp://www.rennyandreed.com\nSimply Flowers\nPhone: 561.530. 7786\nWebsite:\nhttp://www.simplyflowerspbfl.com\nSouthern Floral Company\nPhone: 561.818.4461\nWebsite:\nhttp://www.southernfloralcompanyfl.com\nSpecial Event Resource & Design Group\nPhone: 561.686. 7757\nWebsite:\nhttp://www.specialeventresource.com\nXquisite Events\nPhone: 561.988.9798\nWebsite:\nhttp://www.xefla.com\nGUEST ACCOMMODATIONS\nJupiter Beach Resort\nPhone: 561.746.2511\nWebsite:\nhttp://www.jupiterbeachresort.com\nWyndham Grand at Harbourside\nPhone: 561.273.6600\nWebsite:\nhttp://www.wyndhamgrandjupiter.com\nMAKEUP AND HAIR ARTISTRY\nDreamz Hair Studio\nPhone: 561.320.9195\nWebsite:\nhttp://www.dreamzhairstudio.com\nIvy & Lace Hair and Makeup\nPhone: 513.328.1610\nKate Blake Artistry Makeup\nPhone: 772.233.5770\nKiss This Makeup\nPhone: 877.977.5411\nWebsite:\nhttp://www.kissthismakeup.com\nMUSIC & ENTERTAINMENT\nAbsolute DJ's & Events - FL\nPhone: 561.895.0142\nWebsite:\nhttp://www.absolutedjsfl.com\nBay Kings Band\nPhone: 813.784.6077\nWebsite:\nhttp://www.baykingsband.com\nCustom DJ Services\nPhone: 561.221.3335\nWebsite:\nhttp://www.customdjservices.com\nDJ Donny\nPhone: 561.632.7323\nWebsite:\nhttp://www.djdonnyevents.com\nHeat Wave\nPhone: 954.748.8555\nWebsite:\nhttp://www.heatwavemusic.com\nKenny Mondo Productions\nPhone: 561.790.5555\nWebsite:\nhttp://www.kennymondo.com\nMike Sipe Productions\nPhone: 954.782.9118\nWebsite:\nhttp://www.themikesipe.com\nRock With U\nPhone: 954.404.6547\nWebsite:\nhttp://www.rockwithu.com\nSeegers Sound\nPhone: 954.637.3777\nWebsite:\nhttp://www.seegerssound.com\nSound Events DJs\nPhone: 954.505.4175\nWebsite:\nhttp://www.soundeventdjs.com\nThe Headliners\nPhone: 772.781.7415\nWebsite:\nhttp://www.theheadlinersband.com\nTropics Entertainment\nPhone: 305.531.3468\nWebsite:\nhttp://www.tropicsentertainment.com\nPHOTOGRAPHY/VIDEO\nInfinite Loop\nPhone: 561.692.3212\nWebsite:\nhttp://www.infiniteloopphoto.com\nJack Bates Photography\nPhone: 561.316.7044\nWebsite:\nhttp://www.jackbatesphotography.com\nJessica Bordner Photography\nPhone: 561.758.5131\nWebsite:\nhttp://www.jessicabordner.com\nKarla Korn Photography\nPhone: 484.554.4700\nWebsite:\nhttp://www.karlakorn.com\nKey Moments\nPhone: 870.283.1255\nWebsite:\nhttp://www.keymomentsphoto.com\nPark Avenue Studio - FL\nPhone: 561.770.9677\nWebsite:\nhttps://www.parkavestudio.com\nPineapple Films\nPhone: 561.818.8992\nWebsite:\nhttps://pineapplefilms.com\nSamantha Farmer\nPhone: 321.223.1877\nWebsite:\nhttp://www.samanthafarmerphotography.com\nSara Kauss Photography\nPhone: 561.301.7911\nWebsite:\nhttp://www.sarakauss.com\nStarfish Studios\nPhone: 561.376.3730\nWebsite:\nhttp://www.starfishstudiosfl.com\nTRANSPORTATION\nBus One Limo\nPhone: 561.758.7377\nWebsite:\nhttp://www.bus-one.com\nMolly's Trolleys\nPhone: 561.838.9511\nWebsite:\nhttp://www.mollystrolleys.com\nPontiki\nPhone: 833.766.8454\nZeke's Golf Cart Taxis\nPhone: 561.846.0411\nWebsite:\nhttp://www.zekesgolfcarttaxi.com\nWEDDING PLANNERS\n59 and Bluebell\nPhone: 561.310.4343\nWebsite:\nhttp://www.59andbluebell.com\nBreezy Bridal\nPhone: 561.339.4560\nCourtney Paige Events\nPhone: 772.631.6968\nStunning & Brilliant Events\nPhone: 561.354.8972\nThe Golden Pineapple Event Company\nPhone: 561.779.9982\nYour Sparkling Event\nPhone: 561.667.4448\nWebsite:\nhttp://www.yoursparklingevent.com\nAWARDS\nSITE MAP\nCONTACT\nPRIVACY STATEMENT\nTERMS OF USE\nTERMS FOR ONLINE PURCHASES\nACCESSIBILITY\n<li><a href=\"https://twitter.com/lessingsinc\" target=\"_blank\"><img src=\"https://www.lessings.com/corporate/webimages/_core/s_social_icon_twitter.png\" alt=\"Twitter\" /></a></li>\n© 2025 Lessing's Hospitality Group. All rights reserved.\nkeyboard_arrow_up\narrow navigation\nscroll to top\nfixed box\nset submenus for WCAG\nStart of HubSpot Embed Code\nEnd of HubSpot Embed Code",
      "emails": []
    },
    {
      "url": "https://www.lessings.com/corporate/management-services",
      "is_candidate": false,
      "has_email": false,
      "text": "Google Tag Manager (noscript)\nEnd Google Tag Manager (noscript)\nSkip to Main Content\nGo to Accessbility Settings\nTo Shop Lessing’s Gift Cards,\nclick here\nmenu\nABOUT\nOur Mission\nOur Company\nOur People\nOur Story\nIn the News\nAwards\nJoin Our Team\nContact Us\nWEDDINGS\nEvents\nSeasonal Events\nWedding Showcases\nExclusives & Packages\nLocations\nNew Venues\nLong Island\nNYC - Westchester\nFlorida\nRESTAURANTS\nEvents\nSeasonal Events\nLocations\nLong Island\nNew York City\nFlorida\nCountry Clubs\nPopup Kitchens\nCountry Clubs\nGrill Room at Timber Point\nThe Bethpage Public House\nThe Grill Room at West Sayville\nThe Turn at Port Jefferson\nThe Terrace at 360 East\nOFF‑PREMISE\nNew York\nEast End\nBrecknock Hall\nMontauk Manor\nParrish Art Museum\nPeconic River Herb Farm\nPindar Vineyards\nSalt Air Farm\nLong Island\nParks and Picnics\nThe Bates House\nVanderbilt\nUpstate New York\nKindred Creeks Farm\nNew York City\n630 Second\nCentral Park\nF. Ottomanelli By The Water\nGolf & Body\nHammerstein Ballroom\nMetropolitan Pavilion\nMidtown Loft\nPenn Plaza Pavilion\nRamscale Studio\nStudio 450\nStudio 525\nThe Altman Building\nThe Pillars\nUkrainian Institute\nFlorida\n5 Star Hospitality\nLessing's Events\nConnecticut\nThe Knowlton\nPRIVATE EVENTS\nEvent Spaces\nLong Island\nNYC-Westchester\nFlorida\nRestaurants\nLong Island\nNew York City\nFlorida\nFOOD SERVICE\nMANAGEMENT SERVICES\nEMERGENCY DINING\nHOTEL\nHOME\nABOUT\nWEDDINGS\nRESTAURANTS\nOFF PREMISE CATERING\nPRIVATE EVENTS\nFOOD SERVICE\nMANAGEMENT SERVICES\nEMERGENCY DINING\nHOTEL\nGIFT CARDS\nREWARDS\nSITE MAP\nCONTACT\nnavigate_before\npause_circle_filled\nnavigate_next\nA History of\nSuccess & Remarkable Hospitality\nYour Partner to Success\nLet's Partner Together\nLessing’s Management Services is an innovative restaurant, food service & hotel management company committed to helping hospitality brands manage uncertainty and operate sustainably in today’s changing industry. Our experience working with properties of all sizes and a unique approach to client care, proves we’re ready to help your business thrive under new leadership.\nLessing’s Management Services believes three pillars lead to success.\nOperations Management\nTeam hiring and training\nMarketing, advertising, branding\nAccounting and finance\nVirus and safety protocols\nBack of House Management\nInventory management and ordering supervision\nRecipe development\nBanquet and catering execution\nRoom keeping and sanitary guidelines\nFront of House Management\nService guidelines and training\nFood safety and alcohol service direction\nHotel guest management\nThe Personal Touch\nLessing’s has set the bar for the highest standards in the hospitality industry. We recognize that your needs are different from other restaurants – you are unique and we’re ready to and able to help. Our clients have chosen us because we acknowledge that every situation is personal, and it takes a company who cares to be able to work alongside with you. That’s why we have clients like Charlie Joe’s at Love Street and others. That’s why we’re the ones who can help you make the best of your situation.\nA History of Success to Help a Changing Industry\nFounded in 1890, Lessing’s Hospitality Group is a sixth-generation, family-owned company comprised of over 100 locations throughout the Northeast and Florida. Today, Lessing’s operates 20 wedding and catering venues, 20 full-service restaurants, 2 pop-up kitchen concepts, over 60 corporate and academic dining centers, and a historic inn. Steeped in over 135 years of tradition, but adapting to a constantly changing industry, Lessing’s Hospitality Group’s focus is on providing remarkable customer experiences and positive client returns on investment.\nDriven by the same values as their founder Maxwell Lessing, Lessing’s continues to grow in a competitive market. Our desire for continuous improvement keeps us adapting and shifting. We continue to sharpen our processes for operational efficiencies, marketing strategies, and technical applications.  Fueled by a legacy of remarkable hospitality, we have adapted to meet the needs of restaurants and hotels, streamlined operations and ultimately worked with our clients to make them successful. Let's work together.\nIN THE NEWS\n7 Year Old Steals the Show - Today Show\nFox 5 New York: Experience the magic of Ellen's Stardust Diner in Times Square\nSparking Waterfront Views\nCBS New York: Uniquely New York with Rachel Holt\nWoman Around Town: Ellen Hart Sturm, Owner of Ellen's Stardust Diner, a Quintessential New Yorker, and a 1959 Miss Subway\nForbes: Eating and Having Fun at Ellen's Stardust—In The Heart Of New York\n880 CBS News: Ellen Sturm Interview\nBroadway News: Nathan Lane on finding the humor in aging for his 25th Broadway bow\nThe Broadway Show TV: Perry and The Singing Waiter\nThe City Guide: The Best Restaurants for Valentine's Day in NYC\nThe Scout Guide: A New Jupiter Waterfront, Courtesy of Charlie and Joe\nTGIF The Palm Beach Post: Agua Alfresco Our Series of waterfront-restaurant guides begins in Jupiter\nThe Enlightened Mindset: Where to Eat Before a Broadway Show: 5 Best Restaurants & Reviews\nOprah Daily: 30 of the Best Diners Across America\nCountry Living: 30 Best Diners Across America\nForbes: I Want To Be A Part Of It...New York, New York And On Location Tours!\nThe Palm Beach Post: Get gooey! Best mac and cheese restaurant specials for National Mac and Cheese Day\nThe Palm Beach Post: Hot dining discounts for summer are here! From seafood to Italian, there's a restaurant deal for you\nThe Palm Beaches: EVENTS ROUNDUP: WHAT TO DO THIS JUNE IN THE PALM BEACHES\nNewsbreak: Restaurant guide: Top picks for Easter brunch, Passover meal deals, plus takeout options\nOur Clients\nCONTACT US\nCorporate Headquarters\nBldg 100, Suite 100\nGreat River, NY 11739\n631.567.8200\nNew York City Office\n950 3rd Avenue\n16th Floor\nNew York, NY 10019\n212.764.3450\nFlorida Office\n825 S US Highway 1\n2nd Floor, Suite 230\nJupiter, FL 33477\n561.693.5352\nYour Name\n*\nrequired\nYour Email\n*\nrequired\nYour Phone\nDescription of Management Service Request\n*\nrequired\nType the numbers into the validation box\nValidation box\nType the numbers into the box\nrequired\n(invalid)\nSITE MAP\nCONTACT\nPRIVACY STATEMENT\nTERMS OF USE\nTERMS FOR ONLINE PURCHASES\nACCESSIBILITY\n<li><a href=\"https://twitter.com/lessingsinc\" target=\"_blank\"><img src=\"https://www.lessings.com/corporate/webimages/_core/s_social_icon_twitter.png\" alt=\"Twitter\" /></a></li>\n© 2025 Lessing's Hospitality Group. All rights reserved.\nkeyboard_arrow_up\narrow navigation\nscroll to top\nfixed box\nset submenus for WCAG",
      "emails": []
    },
    {
      "url": "https://www.lessings.com/food_service.aspx",
      "is_candidate": false,
      "has_email": false,
      "text": "Google Tag Manager (noscript)\nEnd Google Tag Manager (noscript)\nSkip to Main Content\nGo to Accessbility Settings\nTo Shop Lessing’s Gift Cards,\nclick here\nmenu\nABOUT\nOur Mission\nOur Company\nOur People\nOur Story\nIn the News\nAwards\nJoin Our Team\nContact Us\nWEDDINGS\nEvents\nSeasonal Events\nWedding Showcases\nExclusives & Packages\nLocations\nNew Venues\nLong Island\nNYC - Westchester\nFlorida\nRESTAURANTS\nEvents\nSeasonal Events\nLocations\nLong Island\nNew York City\nFlorida\nCountry Clubs\nPopup Kitchens\nCountry Clubs\nGrill Room at Timber Point\nThe Bethpage Public House\nThe Grill Room at West Sayville\nThe Turn at Port Jefferson\nThe Terrace at 360 East\nOFF‑PREMISE\nNew York\nEast End\nBrecknock Hall\nMontauk Manor\nParrish Art Museum\nPeconic River Herb Farm\nPindar Vineyards\nSalt Air Farm\nLong Island\nParks and Picnics\nThe Bates House\nVanderbilt\nUpstate New York\nKindred Creeks Farm\nNew York City\n630 Second\nCentral Park\nF. Ottomanelli By The Water\nGolf & Body\nHammerstein Ballroom\nMetropolitan Pavilion\nMidtown Loft\nPenn Plaza Pavilion\nRamscale Studio\nStudio 450\nStudio 525\nThe Altman Building\nThe Pillars\nUkrainian Institute\nFlorida\n5 Star Hospitality\nLessing's Events\nConnecticut\nThe Knowlton\nPRIVATE EVENTS\nEvent Spaces\nLong Island\nNYC-Westchester\nFlorida\nRestaurants\nLong Island\nNew York City\nFlorida\nFOOD SERVICE\nMANAGEMENT SERVICES\nEMERGENCY DINING\nHOTEL\nHOME\nABOUT\nWEDDINGS\nRESTAURANTS\nOFF PREMISE CATERING\nPRIVATE EVENTS\nFOOD SERVICE\nMANAGEMENT SERVICES\nEMERGENCY DINING\nHOTEL\nGIFT CARDS\nREWARDS\nSITE MAP\nCONTACT\nnavigate_before\npause_circle_filled\nnavigate_next\nERROR ENCOUNTERED\nWe're sorry, but an unexpected error was encountered. You can do one of the following:\nGo back and try again.\nGo to Lessing's home page.\nSITE MAP\nCONTACT\nPRIVACY STATEMENT\nTERMS OF USE\nTERMS FOR ONLINE PURCHASES\nACCESSIBILITY\n<li><a href=\"https://twitter.com/lessingsinc\" target=\"_blank\"><img src=\"https://www.lessings.com/corporate/webimages/_core/s_social_icon_twitter.png\" alt=\"Twitter\" /></a></li>\n© 2025 Lessing's Hospitality Group. All rights reserved.\nkeyboard_arrow_up\narrow navigation\nscroll to top\nfixed box\nset submenus for WCAG",
      "emails": []
    }
  ],
  "all_links": [
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2022711_113511_000.jpg",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2022225_12542_000.jpg",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2022225_124644_000.jpg",
    "https://www.lessings.com/corporate/off-premise-catering-details#pindar-vineyards",
    "https://www.lessings.com/corporate/weddings/menu/crane-club-at-tesoro-wedding-menu-menu/79/17317",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2022225_131747_000.jpg",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2022711_11391_000.jpg",
    "https://www.lessings.com/corporate/weddings/venue/port-jefferson-country-club#the_turn",
    "https://www.lessings.com/corporate/weddings/venue/bourne-mansion",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2022711_115736_000.jpg",
    "https://www.lessings.com/corporate/terms-of-use",
    "https://www.lessings.com/corporate/restaurants#country-clubs",
    "https://www.lessings.com/corporate/off-premise-catering-details#studio-450",
    "https://www.lessings.com/corporate/weddings/venue/the-mansion-at-west-sayville#the_grill_room_ws",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2021831_125525_000.jpg",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2021831_125241_000.jpg",
    "https://www.lessings.com/corporate/weddings/venue/mansion-at-timber-point",
    "https://www.lessings.com/corporate/off-premise-catering-details#kindred-creeks-farm",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2022524_125915_000.jpg",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2022711_114515_000.jpg",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2022524_13516_000.jpg",
    "https://www.lessings.com/corporate/weddings/venue/essex-club",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2022711_11350_000.jpg",
    "https://www.lessings.com/corporate/weddings",
    "https://www.lessings.com/corporate/off-premise-catering-details#midtown-loft",
    "https://www.lessings.com/corporate/events/wedding-showcases/69/venues",
    "https://www.lessings.com/corporate/weddings/venue/pavilion-at-sunken-meadow",
    "https://www.lessings.com/corporate/weddings#long-island",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2022524_13110_000.jpg",
    "https://www.lessings.com/corporate/about#contact_us",
    "https://www.lessings.com/corporate/weddings#nyc-westchester",
    "https://www.lessings.com/corporate/off-premise-catering-details#salt-air-farm",
    "https://www.lessings.com/corporate/contact",
    "https://www.lessings.com/corporate/off-premise-catering-details#the-altman-building",
    "https://www.lessings.com/corporate/site-map",
    "https://www.lessings.com/corporate/off-premise-catering-details#peconic-river-herb-farm",
    "https://www.lessings.com/corporate/events/exclusives-and-packages",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2022524_125830_000.jpg",
    "https://www.lessings.com/corporate/about#awards",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2021831_124844_000.jpg",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2022225_12505_000.jpg",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2022711_115919_000.jpg",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2022711_114620_000.jpg",
    "https://www.lessings.com/corporate/about#our_story",
    "https://www.lessings.com/corporate/off-premise-catering-details#parks-and-picnics",
    "https://www.lessings.com/corporate/weddings/venue/the-vineyards-at-aquebogue",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2021831_124617_000.jpg",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2022711_114740_000.jpg",
    "https://www.lessings.com/corporate/restaurants#long-island",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2021831_12551_000.jpg",
    "https://www.lessings.com/corporate/off-premise-catering-details#vanderbilt-museum-and-planetarium",
    "https://www.lessings.com/corporate/corporate-and-social-events#restaurants-long-island",
    "https://www.lessings.com/corporate/about",
    "https://www.lessings.com/corporate/events/seasonal-events-series",
    "https://www.lessings.com/corporate/weddings/venue/pelican-club",
    "https://www.lessings.com/hotel.aspx",
    "https://www.lessings.com/corporate/food-service",
    "https://www.lessings.com/corporate/corporate-and-social-events#events-florida",
    "https://www.lessings.com/corporate/weddings/venue/chateau-at-coindre-hall",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2022711_115447_000.jpg",
    "https://www.lessings.com/corporate/corporate-and-social-events#events-long-island",
    "https://www.lessings.com/corporate/off-premise-catering-details#central-park",
    "https://www.lessings.com/corporate/weddings/venue/port-jefferson-country-club",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2022711_115931_000.jpg",
    "https://www.lessings.com/corporate/off-premise-catering-details#the-pillars",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2021831_125222_000.jpg",
    "https://www.lessings.com/corporate/weddings/venue/the-mansion-at-west-sayville",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2021831_12496_000.jpg",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/mailing-list/79/join",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2022225_125446_000.jpg",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/contact/79/options",
    "https://www.lessings.com/corporate/corporate-and-social-events",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2022711_114719_000.jpg",
    "https://www.lessings.com/corporate/off-premise-catering-details#ramscale-studio",
    "https://www.lessings.com/corporate/weddings#new-venues",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/event/book-your-holiday-party--save/79/9362/details",
    "https://www.lessings.com/corporate/off-premise-catering-details#the-bates-house",
    "https://www.lessings.com/corporate/off-premise-catering-details#ukrainian-institute",
    "https://www.lessings.com/corporate/accessibility",
    "https://www.lessings.com/corporate/off-premise-catering-details#the-knowlton",
    "https://www.lessings.com/corporate/weddings/venue/mansion-at-timber-point#grill_room",
    "https://www.lessings.com/corporate/off-premise-catering-details#montauk-manor",
    "https://www.lessings.com/corporate/weddings/venue/jewish-theological-seminary",
    "https://www.lessings.com/corporate/weddings/venue/harmony-vineyards",
    "https://www.lessings.com/corporate/corporate-and-social-events#restaurants-nyc",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2022711_115823_000.jpg",
    "https://www.lessings.com/corporate/reward-card",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2021831_125548_000.jpg",
    "https://www.lessings.com/corporate/off-premise-catering-details#metropolitan-pavilion",
    "https://www.lessings.com/corporate/corporate-and-social-events#events-nyc-westchester",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2022524_125750_000.jpg",
    "https://www.lessings.com/corporate/off-premise-catering",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2022225_124653_000.jpg",
    "https://www.lessings.com/corporate/about#in_the_news",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2022711_11584_000.jpg",
    "https://www.lessings.com/corporate/weddings/venue/630-second-avenue",
    "https://www.lessings.com/corporate/about#join_our_team",
    "https://www.lessings.com/off_premise_catering.aspx",
    "https://www.lessings.com/corporate/weddings/venue/lessings-events",
    "https://www.lessings.com/corporate/weddings/venue/heritage-club-at-bethpage",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro",
    "https://www.lessings.com/corporate/off-premise-catering-details#hammerstein-ballroom",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2022524_13452_000.jpg",
    "https://www.lessings.com/corporate/weddings/venue/the-mansion-at-oyster-bay",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2021831_125612_000.jpg",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2022225_125428_000.jpg",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2022711_113351_000.jpg",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2022711_115855_000.jpg",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2022711_1200_000.jpg",
    "https://www.lessings.com/corporate/privacy-statement",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2021831_124552_000.jpg",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2021831_125444_000.jpg",
    "https://www.lessings.com/corporate/weddings/venue/360-east-at-montauk-downs#the_terrace",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2022711_12126_000.jpg",
    "https://www.lessings.com/corporate/about#people",
    "https://www.lessings.com/corporate/corporate-and-social-events#restaurants-florida",
    "https://www.lessings.com/corporate/weddings/venue/stonebridge-country-club",
    "https://www.lessings.com/blaze_pizza.aspx",
    "https://www.lessings.com/corporate/weddings/venue/f-ottomanelli-by-the-water",
    "https://www.lessings.com/corporate/weddings/venue/whitby-castle",
    "https://www.lessings.com/corporate/off-premise-catering-details#parrish-art-museum",
    "https://www.lessings.com/corporate/about#mission_statement",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2022225_125734_000.jpg",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2022711_113420_000.jpg",
    "https://www.lessings.com/corporate/restaurants#new-york-city",
    "https://www.lessings.com/corporate/off-premise-catering-details#brecknock-hall",
    "https://www.lessings.com/corporate/weddings/venue/360-east-at-montauk-downs",
    "https://www.lessings.com/corporate/weddings/venue/temple-chaverim",
    "https://www.lessings.com/corporate/restaurants#florida",
    "https://www.lessings.com/corporate/terms-of-service",
    "https://www.lessings.com/corporate/weddings/venue/the-barn-at-old-bethpage",
    "https://www.lessings.com/corporate/weddings/venue/kravis-events",
    "https://www.lessings.com/corporate/restaurants#popup-kitchens",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2022711_115323_000.jpg",
    "https://www.lessings.com/corporate/restaurants",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2022711_115520_000.jpg",
    "https://www.lessings.com/corporate/weddings/venue/heritage-club-at-bethpage#public_house",
    "https://www.lessings.com/corporate/weddings/menu/crane-club-at-tesoro-wedding-brunch-menu/79/20360",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2021831_124938_000.jpg",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2022711_11472_000.jpg",
    "https://www.lessings.com/corporate/management-services",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2022225_124628_000.jpg",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2022524_13557_000.jpg",
    "https://www.lessings.com/corporate/off-premise-catering-details#penn-plaza-pavilion",
    "https://www.lessings.com/private_events.aspx",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2022711_12415_000.jpg",
    "https://www.lessings.com/corporate/hotel",
    "https://www.lessings.com/corporate/off-premise-catering-details#f-ottomanelli-by-the-water",
    "https://www.lessings.com/corporate/home",
    "https://www.lessings.com/corporate/off-premise-catering-details#golf-and-body",
    "https://www.lessings.com/corporate/off-premise-catering-details#630-second",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2022225_124719_000.jpg",
    "https://www.lessings.com/food_service.aspx",
    "https://www.lessings.com/corporate/weddings#florida",
    "https://www.lessings.com/corporate/gift-card",
    "https://www.lessings.com/corporate/emergency-dining",
    "https://www.lessings.com/corporate/off-premise-catering-details#studio-525",
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro/photo/view/file/2022225_124541_000.jpg",
    "https://www.lessings.com/corporate/about#company"
  ],
  "candidate_links": [
    "https://www.lessings.com/corporate/about#contact_us",
    "https://www.lessings.com/corporate/contact",
    "https://www.lessings.com/corporate/about",
    "https://www.lessings.com/corporate/events/seasonal-events-series",
    "https://www.lessings.com/corporate/corporate-and-social-events",
    "https://www.lessings.com/corporate/about#join_our_team",
    "https://www.lessings.com/corporate/weddings/venue/lessings-events",
    "https://www.lessings.com/corporate/about#people",
    "https://www.lessings.com/corporate/weddings/venue/kravis-events",
    "https://www.lessings.com/corporate/management-services",
    "https://www.lessings.com/food_service.aspx"
  ],
  "visited": [
    "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro",
    "https://www.lessings.com/about",
    "https://www.lessings.com/contact",
    "https://www.lessings.com/staff",
    "https://www.lessings.com/team",
    "https://www.lessings.com/board",
    "https://www.lessings.com/directory",
    "https://www.lessings.com/events",
    "https://www.lessings.com/sitemap.xml",
    "https://www.lessings.com/council",
    "https://www.lessings.com/leadership",
    "https://www.lessings.com/management",
    "https://www.lessings.com/producers",
    "https://www.lessings.com/support",
    "https://www.lessings.com/crew",
    "https://www.lessings.com/members",
    "https://www.lessings.com/bios",
    "https://www.lessings.com/people",
    "https://www.lessings.com/artists",
    "https://www.lessings.com/musicians",
    "https://www.lessings.com/faculty",
    "https://www.lessings.com/administration",
    "https://www.lessings.com/corporate/about#contact_us",
    "https://www.lessings.com/corporate/contact",
    "https://www.lessings.com/corporate/about",
    "https://www.lessings.com/corporate/events/seasonal-events-series",
    "https://www.lessings.com/corporate/corporate-and-social-events",
    "https://www.lessings.com/corporate/about#join_our_team",
    "https://www.lessings.com/corporate/weddings/venue/lessings-events",
    "https://www.lessings.com/corporate/about#people",
    "https://www.lessings.com/corporate/weddings/venue/kravis-events",
    "https://www.lessings.com/corporate/management-services",
    "https://www.lessings.com/food_service.aspx"
  ],
  "base_url": "https://www.lessings.com/corporate/weddings/venue/crane-club-at-tesoro"
}