{
  "pages": [
    {
      "url": "http://www.lexingtoncountryclub.com/Weddings_Events_(1)",
      "is_candidate": false,
      "has_email": false,
      "text": "Weddings & Events\nWelcome to Lexington Country Club\nWe woud like to thank you for your interest in Lexington Country Club for your special day. When you select Lexington Country Club as a site for your wedding, you can rest assured that you will be creating memories that will last a lifetime. Our seasoned team of professionals and Executive Chef will work to turn your vision into reality.\nOur Catering Manager will give you a taste of what Lexington Country Club can offer to make your occasion perfetly unique. Whether you are planning a small private party, a large corporate event, or something in between, we are eager to work with you to design an affair that is a personal reflection of your style.\nIncluded in our planner is a variety of menus, beverage pricing and general banquet information and policies. We are able to provide you with contacts for all local florists, entertainers and photographers that we have worked with to assist.\nEvent Information\nBanquets\nOn buffets, the Club will provide ample amountsfor the guaranteed number of guests anticipatied to assure guests of a well-stocked table and presentation. With this policy, we decline carry out containers during or after buffet service.\nThe Club reserves the right to substitue an alternative banquet room based on any changes in the number of attendees or program. Your private room is reserved exclusiley for your guests.\nAll food and beverage items must be supplied, served and prepared by Lexington Country Club. Special occasion cakes are the only exception to this policy and are subjet to a $1.00 cake cutting fee per person.\nAll menu selections must be submitted to the Catering Manager at least two weeks prior to your event.\nState law requires that all alcoholic beverages be consumed on the Club premises and must be purchaes from the Club. Club personell must manage beverage service.\nManagement reserves the right to refuse service of alcoholic beverages to any person under the age of 21 or anyone who appears to be intoxicated.\nAll prices quotes prior to 90 days are subject to change without notice due to all the flucuations in the market.\nThe guaranteed number of guests shall be provided to the Club seven business days prior to the event. The Club will prepare 3% over the guaranteed number for unexpected guests. If the percentage of unexpected guests is higher than 5%, the Club reserves the right to serve whatever is availbale at the time. If a guarantee is not provided to the Club seven days prior to the event, the Club will prepare for the esimated number of guests and bill accordingly to that number or the actual number of guests, whichever is higher.\nThe Club will not assume any responsibility for loss or damage of any merchandise or articles left at the Club prior to, during or following the event.\nMenus\nCatering Packet\nFor special events pricing please contact:\nTara Pierce\n[email protected]\n(239) 215-9508\nFees and Restrictions\nA date booked will be considered confirmed upon receipt of a $600.00 deposit. Fifty percent (50%) of the balance is due 30 days prior to the event, the remaining fifty percent (50%) is due seven (7) business days prior to the event. All deposits will be applied to your final bill unless a cancellation occurs. In the event of a cancellation, our refund schedule is as flows:\nMore than 90 days - full refund of deposit\n61 - 90 days - 50% of deposit\n30 - 60 days - 25% of deposit\nLess than 30 days - no refund of deposit\nRooms are subject to a room rental fee for a 4-hour event. Overtime charges of $500.00 per hour will be incurred beginning 30 minutes after the 4th hour.\nAny questions regarding your bar bill must be addressed at the conclusion of your event. Adjustments cannot be made later since all empty bottles will be disposed of after the function.\nAll services subject to 20% service charge and aplicable state tax.\nLexington Reception Sites\nThe Vista Ballroom\nOur Vista Ballroom offers an exceptional location for your memorable event. The Vista offers a panoramic and breathtaking view of the beautifully manicured Gordon Lewis designed golf course. It accommodates up to 150 people. Can be reserved as the whole room or can be divided in half for smaller functions.\nThe Waterford & Wedgewood Rooms\nOur Waterford & Wedgwood Rooms can be reserved separately for parties of 20 or less or can be combined to make room for up to 41 guests. These elegant rooms make the perfect setting for a small rehearsal dinner.\nThe Clubhouse\nThe whole Clubhouse can be reserved for your special day. Limited availability. Includes the Vista Ballroom, Grille Room, Lounge & Patio.\nBanquet Space\nCapacity\nDuration\nFacility Charge\nVista Ballroom\n150\n4 hours\n$600\nNorth or South Vista\n74\n4 hours\n$300\nSeasons Room\n100\n4 hours\n$300\nVista & Seasons Room\n260\n4 hours\n$1000\nThe Clubhouse\n300+\n4 hours\n$1500\nWaterford & Wedgewood Rooms\n40\n4 hours\n$400\n* Facility Charges include event space, set-up/break-down, staff, ivory or white table clothes and napkins, china, flatware, stemware, tables, chairs, 1 mirror & candle votive per table and accessory tables.\n** Room minimums may be required based on time of year or day of services.\nIncluded in with our Vista Ballroom:\nIvory or White Tablecloths & Napkins\nMirror (1 per table)\nVotives\nDance Floor\nAdditional Services & Rentals:\nIce Sculptures\nChocolate Fountain\nChair Covers\nCeremony Chairs & Setup\nLexington Offers Additional Services & Rentals\nIf you have any questions regarding the above information, would like more information, or to discuss menu options please contact Tara Pierce at (239) 215-9508.",
      "emails": []
    }
  ],
  "all_links": [
    "http://www.lexingtoncountryclub.com/Weddings",
    "https://lexingtoncountryclub.com/Dining-at-LCC",
    "http://www.lexingtoncountryclub.com/Our_Club_(1)/Careers",
    "http://www.lexingtoncountryclub.com/getmedia/778cc85f-a589-4dc3-907c-9566cc7f70c1/Lexington_Country_Club_Values.aspx",
    "http://www.lexingtoncountryclub.com/Weddings_Events_(1)",
    "http://www.lexingtoncountryclub.com/Sports",
    "http://www.lexingtoncountryclub.com/Home",
    "http://www.lexingtoncountryclub.com/Service_Requests",
    "http://www.lexingtoncountryclub.com/Real_Estate_Information",
    "http://www.lexingtoncountryclub.com/Our_Club_(1)"
  ],
  "candidate_links": [
    "http://www.lexingtoncountryclub.com/Weddings_Events_(1)"
  ],
  "visited": [
    "http://www.lexingtoncountryclub.com/",
    "http://www.lexingtoncountryclub.com/about",
    "http://www.lexingtoncountryclub.com/contact",
    "http://www.lexingtoncountryclub.com/staff",
    "http://www.lexingtoncountryclub.com/team",
    "http://www.lexingtoncountryclub.com/board",
    "http://www.lexingtoncountryclub.com/directory",
    "http://www.lexingtoncountryclub.com/events",
    "http://www.lexingtoncountryclub.com/sitemap.xml",
    "http://www.lexingtoncountryclub.com/council",
    "http://www.lexingtoncountryclub.com/leadership",
    "http://www.lexingtoncountryclub.com/management",
    "http://www.lexingtoncountryclub.com/producers",
    "http://www.lexingtoncountryclub.com/support",
    "http://www.lexingtoncountryclub.com/crew",
    "http://www.lexingtoncountryclub.com/members",
    "http://www.lexingtoncountryclub.com/bios",
    "http://www.lexingtoncountryclub.com/people",
    "http://www.lexingtoncountryclub.com/artists",
    "http://www.lexingtoncountryclub.com/musicians",
    "http://www.lexingtoncountryclub.com/faculty",
    "http://www.lexingtoncountryclub.com/administration",
    "http://www.lexingtoncountryclub.com/Weddings_Events_(1)"
  ],
  "base_url": "http://www.lexingtoncountryclub.com/"
}