{
  "pages": [
    {
      "url": "https://longbranchrestandride.com/about/",
      "is_candidate": false,
      "has_email": false,
      "text": "About Us\nLong Branch is a safe, tranquil, and dog-friendly RV campground and horse park, where people can relax, refresh, and care for their animals. Nestled within the heart of old Florida, we offer stunning natural scenery, exceptional privacy, and ample space for your needs. Whether you’re a weary traveler or avid eco-tourist, you’ll find your home away from home at Long Branch.\nBook Your Stay\nWho We Are\nOur small, privately owned and operated RV and horse park lends itself to the old Florida simple country life. We are a quiet, safe place with big shady oaks, where you can set up camp, relax, and enjoy yourself and nature.\nWhere We're Located\nWe sit on over 360 acres just off US 129 and 48th Street, north of I-10 and south of the Spirit of the Suwannee Music Park and I-75. Our spacious campground is only 2.5 miles from amenities in town, such as Walmart, restaurants, fuel, feed and tack shops, auto services and dealers, salons, liquor stores, and shopping. There are great local veterinarians, farriers, and, of course, Shands Live Oak Regional Medical Center.\nOur Values\nWe believe everyone deserves privacy, tranquility, and security during their camping experience. Thanks to the convenience of town, we can keep our camp amenities and therefore our fees to a minimum. We focus on comfort and safety, prioritizing your relaxation and wellness while ensuring you have what you need for your camper and animals.\nWe cherish every opportunity to create great memories with good friends. As a small, intimate park, we continually strive to create a restorative, helpful community — one that cares about our guests, their animals, and the environment.\nWe look forward to sharing this piece of old Florida with you and yours. Book your stay today.\nOur Space\nThis map shows the lay of our land and provides details on where to locate our amenities.\nView Map\nCome See for Yourself\nBook Your Stay",
      "emails": []
    },
    {
      "url": "https://longbranchrestandride.com/contact-us/",
      "is_candidate": false,
      "has_email": true,
      "text": "Contact Us\nTraveling or camping in north central Florida? We’d love for you to join us at our spacious, secluded RV and horse campground. Whatever you need for your camper and animals, we offer friendly, flexible options.\nTo book your stay, please call or text us to make a reservation.\nYou may also email us with reservation requests or any questions. (Texting or calling is quicker than email.)\nPhone:\n904-544-0406\nEmail:\nlongbranchrestandride@yahoo.com\nDirections and Address\nAddress:\n4690 89th Rd, Live Oak, FL 32060\n30.365757161821467, -82.92638773864194\nDirections:\nIf driving from I-10, use exit #283 and go north on US 129 for 2.5 miles, then turn right on 48th Street. This dead-ends into the campground entrance. Do not turn left on 89th Rd. The entrance is at the end of 48th St.\nIf driving south on I-75 from Georgia, use exit #451 and drive south on US-129 towards Live Oak. Go 1 mile past Ag station, then turn left onto 48th Street. It dead-ends into our driveway.\nIf driving north on I-75, exit onto I-10 West. Take the second exit #283 north onto US-129. Go 2.5 miles, then make a right on 48th Street. It dead-ends into the campground entrance.\nHow to Book Your Camping Stay\nRates and Payment\nWhen you call to make your reservation, we’ll confirm the total due upon booking.\nA deposit is required for most weekly and monthly reservations.\nSome rentals require a minimum stay, due in full at the time of booking:\nWe do not accept credit cards yet (hopefully very soon) — currently, only money orders, cash, or checks payable to Long Branch Rest & Ride. Upon arrival, please wrap your money order, cash, or check wrapped in your signed waiver and drop in the white mailbox in front of the yellow farmhouse in the driveway.\nCancellation Policy\nReservations made for the off-season may be canceled for future booking credit with 3 weeks’ notice. High season requires a 6-week notice.\nDrive-Ups & Same-Day Requests\nMust be previously cleared by phone or text reservation. Space permitting. Must arrive before sundown. You may call or text 904-544-0406 to inquire. No voicemails: If you do not get an immediate response, that is not a confirmation to enter. We cannot always be available to answer. However, if you have a horse\nemergency\n, proceed in carefully, find an empty paddock, and secure. Sign the waiver, follow the payment procedure, and call back in the morning. Check website for fees.\nBefore You Arrive\nPlease download and complete the waiver & release form and submit it with your deposit.\nIf traveling with horse(s), you must also include a copy of your Coggins certificate and health certificate before you can unload your horse(s).\nHave Other Questions?\nPlease feel free to contact us at any time with any questions you have. We’ll respond to you within 24 hours.\nFirst Name\n*\nLast Name\n*\nEmail Address\n*\nPhone\n*\nMessage\nSend Message",
      "emails": [
        "longbranchrestandride@yahoo.com"
      ]
    }
  ],
  "all_links": [
    "https://longbranchrestandride.com/about/",
    "https://longbranchrestandride.com/home/",
    "https://longbranchrestandride.com/gallery/",
    "https://longbranchrestandride.com",
    "https://longbranchrestandride.com/horses/",
    "https://longbranchrestandride.com/",
    "https://longbranchrestandride.com/contact-us/",
    "https://longbranchrestandride.com/map",
    "https://longbranchrestandride.com/campers/"
  ],
  "candidate_links": [
    "https://longbranchrestandride.com/about/",
    "https://longbranchrestandride.com/contact-us/"
  ],
  "visited": [
    "http://longbranchrestandride.com/",
    "http://longbranchrestandride.com/about",
    "http://longbranchrestandride.com/contact",
    "http://longbranchrestandride.com/staff",
    "http://longbranchrestandride.com/team",
    "http://longbranchrestandride.com/board",
    "http://longbranchrestandride.com/directory",
    "http://longbranchrestandride.com/events",
    "http://longbranchrestandride.com/sitemap.xml",
    "http://longbranchrestandride.com/council",
    "http://longbranchrestandride.com/leadership",
    "http://longbranchrestandride.com/management",
    "http://longbranchrestandride.com/producers",
    "http://longbranchrestandride.com/support",
    "http://longbranchrestandride.com/crew",
    "http://longbranchrestandride.com/members",
    "http://longbranchrestandride.com/bios",
    "http://longbranchrestandride.com/people",
    "http://longbranchrestandride.com/artists",
    "http://longbranchrestandride.com/musicians",
    "http://longbranchrestandride.com/faculty",
    "http://longbranchrestandride.com/administration",
    "https://longbranchrestandride.com/about/",
    "https://longbranchrestandride.com/contact-us/"
  ],
  "base_url": "http://longbranchrestandride.com/"
}