{
  "pages": [
    {
      "url": "http://maineventtalent.com/event-entertainment-request",
      "is_candidate": false,
      "has_email": false,
      "text": "NEED ENTERTAINMENT FOR AN EVENT OR PARTY?\nMain Event Talent Agency has an extensive roster of talent of all genres, (i.e., solo artists, duos, trio, bands, disk jockeys, novelty acts, etc.). We will help you find the right entertainment that suits your needs, complies with your budget, enhances your desired atmosphere, compliments your theme,  and suits your demographic.\nPlease fill out the form below with some initial information and we will contact you to discuss in more detail before suggesting entertainment options.\nYour Name\nEvent/Organization Name\nPhone (plus Ext. if applicable)\nYour Email\nDate of Event\n1925\n1926\n1927\n1928\n1929\n1930\n1931\n1932\n1933\n1934\n1935\n1936\n1937\n1938\n1939\n1940\n1941\n1942\n1943\n1944\n1945\n1946\n1947\n1948\n1949\n1950\n1951\n1952\n1953\n1954\n1955\n1956\n1957\n1958\n1959\n1960\n1961\n1962\n1963\n1964\n1965\n1966\n1967\n1968\n1969\n1970\n1971\n1972\n1973\n1974\n1975\n1976\n1977\n1978\n1979\n1980\n1981\n1982\n1983\n1984\n1985\n1986\n1987\n1988\n1989\n1990\n1991\n1992\n1993\n1994\n1995\n1996\n1997\n1998\n1999\n2000\n2001\n2002\n2003\n2004\n2005\n2006\n2007\n2008\n2009\n2010\n2011\n2012\n2013\n2014\n2015\n2016\n2017\n2018\n2019\n2020\n2021\n2022\n2023\n2024\n2025\n2026\n2027\n2028\n2029\n2030\n2031\n2032\n2033\n2034\n2035\nJanuary\nFebruary\nMarch\nApril\nMay\nJune\nJuly\nAugust\nSeptember\nOctober\nNovember\nDecember\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\nPerformance Hours (start to finish)?\nEvent Location / Address\nCompany/Billing Address (if different from location)\nWhat kind of event are you having? (Corporate, wedding, birthday party, etc)\nApprox. # of Guests\nAge range of Guests\nIs there a theme? If so, what is it?\nGenre(s) of music you'd prefer (i.e., top 40, rock, pop, oldies, jazz, blues, reggae, country, ethnic, etc.)\nBudget (How much have you allocated for entertainment? Please provide an estimated range of price)\nIs Certificate of Insurance \"COI\" Required by Venue/Host Site?\nYes\nNo\nUnsure\nMessage/Notes\nMain Event Talent Agency • FL TA Lic. #594 • © All rights reserved",
      "emails": []
    },
    {
      "url": "http://maineventtalent.com/about-us",
      "is_candidate": false,
      "has_email": false,
      "text": "Something important you should know about us...\nAt Main Event Talent Agency, our mission is simple: to provide unparalleled service and top-tier entertainment tailored to elevate every occasion.\nWe care about our clients and are dedicated to your success.\nWe prioritize our clients, offering a hands-on approach that goes beyond the standard talent agency experience. Our commitment extends to assisting with graphics, promotions, and actionable marketing insights, aiming to enhance your sales and overall success. Understanding the economic challenges faced by local businesses, we work closely within budget limitations while ensuring the delivery of quality entertainment that boosts your revenue.\nClick here\nto read more details about our extensive services.\nEmpowering our Artists.\nWe believe in nurturing our talent. Through in-depth consultations and detailed gig sheets, we empower our musicians not only as exceptional performers but also as partners in promoting your business. From understanding audience demographics to facilitating increased footfall, we guide our artists to maximize their impact on your venue or event. We prioritize professionalism, stressing the importance of punctuality, presentation, and a customer-centric approach.\nCrafting Unforgettable Moments\n.\nYour event deserves the perfect soundtrack. We understand the transformative power of music and aim to curate an atmosphere that exceeds your expectations. Our commitment to excellence begins with a thorough understanding of your event's unique needs. When you engage with us, expect a personalized experience—we'll ask the right questions to ensure the entertainment we suggest is an ideal fit for your vision.\nCredentials.\nMain Event Talent Agency is licensed through the Florida Department of Business and Professional Regulations in Tallahassee [Talent Agency License #594] and\nand is bonded by State Farm Insurance Company in compliance with state law.\nClick here\nto view TA license status on MyFlorida.com\nClick here\nto review our list of satisfied customers.\nClick here\nto meet the Main Event Talent Agency team.\nClick here\nto read \"Advice for Cover Bands\"\nMain Event Talent Agency • FL TA Lic. #594 • © All rights reserved",
      "emails": []
    },
    {
      "url": "http://maineventtalent.com/staff",
      "is_candidate": false,
      "has_email": false,
      "text": "The faces of Main Event Talent Agency...\nJudy Blem\nDen Mother of Rock 'n Roll\nJudy Blem has been booking and promoting gigs and special events in South Florida since January of 1991. She began her illustrious career as a talent agent working at Musicians Exchange™ for 8 years, (1991-1998). In September of 1998, she applied for and received her talent agency license and MAIN EVENT TALENT AGENCY was born.\nJudy has booked over 75,000 gigs and special events in over\n600 venues\nin South Florida (and beyond) over the years. She loves live music and the bands with whom she works and is extremely dedicated to the South Florida music scene. She also does graphic design work, promotions and marketing, event planning, band development, and volunteers her time to several non-profit organizations.  She's one busy lady and she wouldn't have it any other way!\nJudy was \"a chorus geek,\" two-term president of SPHS drama club, founder of an award-winning thespian troupe, a member of Meistersingers and Performing Arts, and a member of Plantation Players Theater Company.  In college, she was a writer and performer in an improv comedy group called \"The Insomniac Players,\" she hosted open mic nights, and in the early 90's, she produced and hosted a comedy series for Discovery Cruise Line.\nJudy graduated from Florida State University in 1985, College of Communications, and has a BA in Advertising & Marketing.\nOn a personal note, Judy has been married to Tom since November of 1991 and is the proud Mother of two incredible young men. Sean graduated from the University of South Florida with a degree in International Finance, and currently holds a senior management position with Bank of America. Devin graduated from the University of Florida with a degree in computer science and joined the Main Event Team in 2021.\nJudy is a member of ASCAP.  One of her biggest thrills was having a song licensed by DirecTV for a series called \"Full Circle.\"\nClick here\nto listen to \"Until You Kissed Me Like That\" [Written by Judy Blem & Billy Livesay © 2011]\nClick here\nto read Judy's \"\nAdvice for Cover Bands\n\"\nArticle Published Sept 2010 in WeMerge Arts & Entertainment Magazine\nJames Robinette\nShaker of Hands, Kisser of Babies\nJames \"Jimi\" Robinette has been an entertainer since he was a teenager.  He picked up the drums when he was just a kid and later switched to singing. Formerly a Retrospect Records signed recording artist who toured nationally, Jimi founded and fronts one of South Florida's longest-running cover bands \"Riverdown,\" as well two incredibly popular premier tribute bands \"Southern Blood\" and \"The Freebirds.\" He's a powerhouse vocalist and successful band leader who understands the \"business side\" of being in a band.\nHaving spent years in sales, Jimi combines his corporate knowledge of sales, marketing and customer care with his personal knowledge of the music industry. Jimi has a strong work ethic and believes in servicing accounts in person rather than chatting on the phone - which explains why this man is always on the run. His dedication and personal service is second to none.\nMain Event Talent Agency • FL TA Lic. #594 • © All rights reserved",
      "emails": []
    },
    {
      "url": "http://maineventtalent.com/contact-us",
      "is_candidate": false,
      "has_email": false,
      "text": "Need Music? Contact Us Today For a Free Quote\nPlease fill in the “Booking Request Form” (blue button below) to help us understand your entertainment needs\nBOOKING REQUEST FORM\nName\nEmail\nMessage\nATTENTION:\nBANDS / MUSICIANS:\nIf you are interested in working with the agency,\nplease visit this page for instructions:\n\"\nArtist-Submissions\n\"\n[Do NOT use \"contact form\" on this page]\nHave questions?\nPlease feel free to call our office 954-429-0401\nOr use the e-mail form to drop us a note.\nMain Event Talent Agency\n4950 NW 102nd Drive\nCoral Springs FL 33076\nMain Event Talent Agency • FL TA Lic. #594 • © All rights reserved",
      "emails": []
    }
  ],
  "all_links": [
    "http://maineventtalent.com/artist-submissions",
    "http://maineventtalent.com/event-entertainment-request",
    "http://maineventtalent.com/services",
    "http://maineventtalent.com/user_sessions/logout",
    "http://maineventtalent.com/kissed-me-like-that",
    "https://maineventtalent.com/artist-submissions",
    "http://maineventtalent.com/fllaw.cfm",
    "http://maineventtalent.com/media",
    "http://maineventtalent.com/client-list",
    "http://maineventtalent.com/talent-roster",
    "https://maineventtalent.com/event-entertainment-request",
    "http://maineventtalent.com/graphic-design",
    "http://maineventtalent.com/about-us",
    "http://maineventtalent.com/staff",
    "http://maineventtalent.com/home",
    "http://maineventtalent.com/contact-us"
  ],
  "candidate_links": [
    "http://maineventtalent.com/event-entertainment-request",
    "http://maineventtalent.com/about-us",
    "http://maineventtalent.com/staff",
    "http://maineventtalent.com/contact-us"
  ],
  "visited": [
    "http://maineventtalent.com/",
    "http://maineventtalent.com/about",
    "http://maineventtalent.com/contact",
    "http://maineventtalent.com/staff",
    "http://maineventtalent.com/team",
    "http://maineventtalent.com/board",
    "http://maineventtalent.com/directory",
    "http://maineventtalent.com/events",
    "http://maineventtalent.com/sitemap.xml",
    "http://maineventtalent.com/event-entertainment-request",
    "http://maineventtalent.com/about-us",
    "http://maineventtalent.com/staff",
    "http://maineventtalent.com/contact-us"
  ],
  "base_url": "http://maineventtalent.com/"
}