{
  "pages": [
    {
      "url": "https://www.manateeperformingartscenter.com/staff/",
      "is_candidate": false,
      "has_email": true,
      "text": "Staff\n.nv-page-title\n.nv-page-title-wrap\n“The mission of the Florida Cultural Group, Inc. is to create, entertain and\nstrengthen\nan artistic, creative, curious and thriving community by bringing people together\n.”\nEMAIL\nJanene M. Amick\nCAP®, CFRE\nChief Cheerleader & CEO\nFlorida Cultural Group, Inc.\nJanene M. Amick’s impressive background paints a picture of a dynamic and dedicated leader, deeply committed to both her community and the arts. As the CEO of the Florid Cultural Group and its Manatee Performing Arts Center (MPAC) campus, her entrepreneurial spirit is evident, as she has successfully guided the organization for nearly two decades. Her leadership philosophy, “Lead with your Strengths,” suggests a focus on empowerment, collaboration, and the cultivation of individual and collective talents.\nHaving joined the company formally known as Manatee Players, Inc. in 2005, Janene’s tenure speaks to both her loyalty to the organization and her strategic vision for its growth. Her cross-sector experience spans the arts, marketing, corporate entrepreneurship, and nonprofit management, which enables her to bring a comprehensive and innovative approach to her role.\nJanene is highly recognized in her community, where she has earned numerous accolades for her leadership and volunteerism, including the prestigious Ed Hunzeker Hospitality Leadership Award (2019) and the Lifetime Achievement Award for community volunteer service in 2017. She has also been recognized as one of BIZ (941) 2012’s People to Watch, underscoring her influence and role as a change-maker in the region.\nIn addition to her work at MPAC, Janene has served in various leadership capacities, including as Past President of the Bradenton Kiwanis Club, a board member of the MCR Health Board of Directors, and an appointed Commissioner of the Bradenton Housing Authority. Her extensive involvement with organizations like the VFW Women’s Auxiliary, the American Fundraising Professionals (AFP), and the Bradenton Area Cultural Advisory Committee further reflects her commitment to strengthening the local nonprofit and cultural sectors.\nHer educational achievements are equally impressive, with certifications in nonprofit management, philanthropy, and fundraising. Janene’s designation as a Certified Fund-Raising Executive (CFRE) and Chartered Advisor in Philanthropy (CAP) positions her as an expert in nonprofit management and strategic fundraising. Her Executive Education Certificate in Nonprofit Management from Harvard University further underscores her commitment to continual learning and professional growth.\nAt the heart of Janene’s work is a passion for nonprofit collaborations and partnerships. She thrives on providing others with opportunities to shine and fostering a sense of community impact through shared experiences and initiatives.\nThrough her leadership, Janene Amick continues to play a pivotal role in the cultural, philanthropic, and social landscape of Bradenton and beyond. Her focus on community-building and her relentless dedication to the arts have left a lasting impression on the region.\nShow more\nShow less\nEMAIL\nRick Kerby\nProducing Artistic Director\nRick Kerby is a distinguished figure in the performing arts, renowned for his extensive career as both a performer and director. As the Producing Artistic Director of the Manatee Players, he has been instrumental in shaping the theater’s artistic vision for over two decades, earning accolades such as the “Master Director” title from Sarasota Magazine in 2013 and multiple Handy Awards.\nBefore his tenure in Bradenton, Rick’s performance career spanned over thirty countries and all fifty U.S. states. He graced Broadway stages and national tours, including productions like A Match Made in Heaven and Yankee Doodle Dandy. His international tours featured roles in Seven Brides for Seven Brothers, The Best Little Whorehouse in Texas, and Oklahoma!, where he also served as dance captain. Beyond theater, Rick performed aboard major cruise lines such as Royal Viking, Holland America, and Norwegian, and appeared in Las Vegas venues like the Aladdin Hotel and Bally’s Casino.\nIn his role as Entertainment Director for the USO of Metropolitan New York, Rick organized the Miss USO Contest and led a troupe that performed internationally, with appearances on The Today Show, Good Morning America, Macy’s Thanksgiving Day Parade, and The Miss America Pageant.\nRick’s commitment to education is evident through his teaching positions at institutions like Wagner College and The Academy of Music and Dramatic Arts in New York City. He has also held leadership roles at the Florida Theatre Conference, the Florida Association of Community Theaters, and the American Association of Community Theatres, where he is a past president.\nAs a published author, Rick co-authored “Dream: Tales from the Pikes Peak Writers,” a collection of short stories.\nHe also authored “Improv with Older Actors,” a guidebook accompanied by a flash card set designed to facilitate improvisational activities for senior performers.\nRick Kerby’s multifaceted career underscores his unwavering dedication to the performing arts, significantly influencing both regional and national theater communities.\nShow more\nShow less\nEMAIL\nJeff Evans\nComptroller\nThe Comptroller is responsible for preparing financial statements, processing deposits, and payments, maintaining cash controls, managing the payroll and human resources administration, audit preparation, and maintaining all financial accounts.\nThe Comptroller is responsible for preparing financial statements, processing deposits, and payments, maintaining cash controls, managing the payroll and human resources administration, audit preparation, and maintaining all financial accounts.\nJeff is retired from a 45-year career in the financial services industry which encompassed senior and executive management roles in banking, brokerage, and mutual fund servicing.\nJeff, his wife, Nitza, and daughter, Alina, moved to Florida from New Jersey in 2005. When Alina first appeared in one of our shows in 2009, Jeff got involved as a tech volunteer. He has since been a Board member and served as our Treasurer and Board Chair. He has been the Comptroller since 2017.\nShow more\nShow less\nEMAIL\nKristin Ribble\nProduction Manager\nThe Production Manager is responsible for coordinating the rehearsal schedules, technical needs and budget of all in-house produced productions. The Production Manager acts as the liaison among the production team and between the production team, including Guest Directors, and the Producing Artistic Director.\nKristin started her current position as the Production Manager for Manatee Players in July of 2008, celebrating her 10 year anniversary this year! She has been involved, either onstage or behind the scenes, in over 130 productions since the age of 12, and she has Stage Managed over 60 productions here at MPAC! Most recently she served as Stage Manager for our productions of HUNCHBACK OF NOTRE DAME, A LITTLE NIGHT MUSIC, THE PRODUCERS, BOYNTON BEACH CLUB, LITTLE SHOP, ASSASSINS, and 42nd STREET! Some of her favorite stage management experiences here include INTO THE WOODS, TARZAN, SHREK, LES MISERABLES, MISS SAIGON, FIDDLER ON THE ROOF, MY ONE AND ONLY, EVITA, ANYTHING GOES, WHITE CHRISTMAS, AIDA, SEVEN BRIDES FOR SEVEN BROTHERS, CRAZY FOR YOU, WILL ROGERS FOLLIES, GYPSY, OKLAHOMA, CHICAGO, DAMN YANKEES, BIG RIVER, ELEPHANT MAN, and PIPPIN. She was also proud to be the stage manager of the AACT award winning productions of SUNDAY IN THE PARK WITH GEORGE and SWEENEY TODD. Kristin graduated with a BS in psychology with honors from University of Florida and worked for several years as a social worker and case manager serving at-risk youth in Manatee County. Although Kristin has been involved with many other theatre companies, she considers MPAC to be her second home and is proud to be a part of the staff of such a wonderful company! “\nThank you to the many volunteer crew members, hard-working stage managers, and dedicated staff members who make coming to work a treat!\n”\nShow more\nShow less\nEMAIL\nAnn Colonna\nCommunity Engagement Director\nAnn Colonna is a dedicated community leader and the Community Engagement Director for the Florida Cultural Group, a role she began in October 2024. With a passion for fostering connections and giving back, Ann brings extensive experience in community outreach, mentorship, and organizational leadership to the group’s mission.\nOriginally from the Shenandoah Valley of Virginia, Ann attended High Point University in High Point, North Carolina, where she began developing her professional foundation. After a successful career in the staffing and sales industry, Ann transitioned to the nonprofit sector, seeking to make a more direct and lasting impact on her community.\nIn addition to her role with the Florida Cultural Group, Ann is deeply involved in local mentorship through Take Stock in Children of Manatee County and Hillsborough County. She currently mentors three students and has successfully guided three others through graduation. Among her mentees, one has joined the U.S. Marine Corps, and two are pursuing their college education. Ann’s commitment to mentorship and her belief in the power of education have made a lasting impact on her students’ lives.\nAnn is also a graduate of Leadership Manatee and serves as the President of the Leadership Manatee Alumni Association, where she continues to promote leadership development and community engagement across the region. Her work with Leadership Manatee has solidified her as a key figure in shaping local leaders and fostering collaboration within the community.\nOutside of her professional and volunteer work, Ann enjoys traveling and spending time with her family and friends. Her enthusiasm for building relationships and empowering others.\nShow more\nShow less\nEMAIL\nCaren Brady\nResident Costume Designer/Costume Shop Manager\nCaren Brady’s exemplary 37-year career in the theatre world reflects both her dedication and versatility in the realm of costume design. As the Resident Costume Designer and Costume Shop Manager at Manatee Performing Arts Center, which she joined in 2022, Caren brings a wealth of experience to every production she works on, a skillset honed through her extensive background in costume design, costume rental, and production management.\nA native of Ohio, Caren’s educational foundation was built at Bluffton College, where she earned her degree in theatre. Her career began at Stagecraft Theatrical in Cincinnati, where she not only worked in costume design but also expanded her role to owning and renaming the company to Cincinnati Costume Company. This entrepreneurial spirit set the stage for her later work with various production companies across the United States.\nThroughout her career, Caren has designed costumes for a wide range of productions, including plays, musicals, ballet, modern dance, television, and film. Among her favorite projects are My Fair Lady, Titanic, Gypsy, Something Rotten, and The Wizard of Oz—each of which demonstrates her ability to translate the artistic vision of a production into vibrant and fitting costume design.\nIn addition to her professional accomplishments, Caren is a proud mother to her son Joe and his wife, Helena, and a dedicated pet parent to her mutt dog, Leon, rounding out a life that blends creativity with family.\nHer passion for theatre and costume design continues to inspire those around her, making her a key figure in the artistic communities she serves.\nShow more\nShow less\nEMAIL\nIsabella Onken\nAssociate\nIsabella joined the Florida Cultural Group after graduating from Florida Gulf Coast University, where she dual-majored in Theatre and Communication. In May of 2023, she began an internship with Manatee Performing Arts Center, gaining invaluable hands-on experience that led to her official position on the staff in August 2023. She is thrilled to be in a role where she can apply her education while serving her local community.\nAs part of the development team, Isabella is a facilitator to the organization and its patrons. She manages donations, sales, and funds with an eye on the future, working closely with staff and volunteers to help sustain the theatre’s growth. While her primary focus is on the longevity of the theatre and ensuring its continued success, Isabella uses her “jack-of-all-trades” enthusiasm to assist wherever possible. Whether it’s helping with day-to-day operations or supporting larger initiatives, she’s always ready to lend a hand.\nWhen Isabella isn’t in the office, she’s likely on stage. She made her debut with us in the highly successful Rocky Horror Show in 2023.  Behind the scenes, Isabella plays an active role in supporting productions, whether she’s selling tickets to the latest show or working with Ralph Nurmela to paint sets in the Kiwanis Blackbox Theatre.\nAn accomplished writer, Isabella has been published multiple times for her poetry and is a dedicated participant in National Novel Writing Month (NaNoWriMo) every year. She is also a proud member of Our Ladies’ Rosary Makers at the national level and has been crafting rosaries since 2014.\nIsabella is incredibly proud of the opportunity to contribute to the artistic and cultural community and is excited to continue her journey of growth and service. Who knows where you’ll see her next, but she’ll be rallying support for Manatee Performing Arts Center every step of the way.\nShow more\nShow less\nLarry Crouse\nThomas Anderson",
      "emails": [
        "ann@flculturalgroup.org",
        "artisticdirector@manateeperformingartscenter.com",
        "ceo@flculturalgroup.org",
        "finance@manateeperformingartscenter.com",
        "production@manateeperformingartscenter.com"
      ]
    },
    {
      "url": "https://www.manateeperformingartscenter.com/board-directors/",
      "is_candidate": false,
      "has_email": false,
      "text": "Board of Directors\nJohn C. Diem – Chair\nJohn grew up in Bradenton and is a graduate of the University of Florida. He is part owner of Southern Ag, a wholesale supplier of growth and control products to the turf and horticultural industries. Generations of his family have been active with the Manatee Players since it’s inception and it has always been a part of his life that he likes to share with others. He lives in Bradenton with his wife Kim and has two adult children Johnny and Courtney. He especially enjoys time on the water and is active with other professional horticultural association boards.\nJames Thielen – Vice Chair\nJim and his late wife, Meredith, moved to Manatee County from Illinois in 2002. He has been in the IT / Cybersecurity industry for 40+ years working for companies like Discover Card, Sears Technology Services, IBM and AT&T. Jim currently is a project manager within AT&T managing encryption services but is in the process of retiring in early 2024. Besides his corporate work he also has been a dedicated supporter of non-profits over the years.\nJim and his partner, Kathie, truly enjoys the Manatee Performing Arts Center and is a long-time supporter of theater. He looks forward to being able to work with the volunteers and staff to achieve the organization’s mission and goals.\nJohn Tucker, Jr. – Treasurer\nJohn and his wife Diane moved to Bradenton in 1988. John is a retired financial advisor from Edward Jones Investments. He has a BS from Auburn University and an MBA from The George Washington University. John is a past president of the Bradenton Country Club and he has been on the Board of Directors for the Kiwanis Club of Bradenton and the Kiwanis Club of Bradenton Foundation. John and Diane reside in Palmetto.\nMickey Palmer – Secretary\nMickey Palmer was born and raised in Bradenton and attended local public schools. He has been a member of the Florida Bar for over 40 years and was the County Attorney for Manatee County for the last nine years of his full-time career. Presently, he practices law on a part-time basis with the Bradenton-based law firm Grimes Hawkins Gladfelter and Galvano. Mickey obtained his bachelor’s degree in business management from Florida State University and his juris doctor from the Cumberland School of Law at Samford University. He is a member and past President of the Manatee County Bar Association, a past board member of the Gulf Coast South Health Education Center, a past board member, President and tutor for the Manatee County Literacy Council, and is a former member of the Bradenton Rotary Club. Mickey has one adult son, Evan, who has excelled in the local culinary business.\nSharon Barhorst – Member\nSharon and her husband Ray moved to Manatee County in 1997. Sharon has a BA in Anthropology from Wright State University in Dayton, Ohio. Sharon and her husband worked together as a team to install Tyler Technologies iasWorld computer software for the Manatee County Property Appraiser’s office. Sharon retired from Tyler Technologies as a Senior Vice President to pursue her passion of helping local not for profits. Sharon has served on many local not for profit boards from Big Brothers Big Sisters of the Sun Coast, Manatee County American Red Cross and Bradenton Kiwanis Club. Sharon was actively involved in her High School plays and looks forward to volunteering for the Manatee Performing Arts Center.\nJack Hawkins – Member\nJack Hawkins has been a lifelong resident of Bradenton since 1958 – over 60 years. After receiving his law degree from Ole Miss Law School in 1978, he returned to Bradenton with his wife, Paula, and they have resided in Bradenton since that time. Jack is a Partner in the law firm Grimes Hawkins Gladfelter and Galvano, P.L. Jack has been active in many charitable and non-profit boards over the years, serving as president or board chair of the\nfollowing organizations: Manatee County Bar Association, Kiwanis Club of Bradenton, Just for Girls, the Bradenton Kiwanis Foundation (twice) and the Boys and Girls Club of Bradenton.\nJohn Hroncich – Member\nBiography will be available soon.\nDr. Melvin Price – Member\nDr. Price is from Philadelphia, PA. He attended Marquette University in Milwaukee, Wisconsin. He is currently a Podiatrist specializing in Foot & Ankle surgery. He serves as a VP of Medical Affairs for MCR Health. He also serves on the Diabetes Advisory Council for the State of Florida.\nDr. Price enjoys playing the saxophone and has performed at the Manatee Performing Arts Center many times. He lives in Bradenton with his wife Phyllis and has two adult children and three grandchildren.\nPeter Ruscoe – Member\nPeter and his wife Mary Martha have been Manatee County Residents for more than 4 decades. After discovering Manatee Players, they promptly became season ticket holders. Peter is a retired computer professional, working in the UK, Chile, Brazil and the United States. His last job was right here in Bradenton. He is a local actor, having appeared in a number of productions with Manatee Players, The Island Players and The Players of Sarasota. He has a passion for the arts – especially dramatic, and is honored to be part of the magnificent vision of The Florida Cultural Group.\nCarol Sciarrabba – Member\nCarol, recently retired, began her career at Hartwick College in Upstate NY. Prior to moving to Florida, during her tenure at Hartwick, her professional career consisted of Director of Computer Operations and Director of Human Resources. Continuing to pursue her career goals, she became Manager of Benefits for Mallinckrodt Pharmaceuticals which was then acquired by Tyco International. She later moved to the Carolinas and started her career with Edward Jones, during which time she was awarded the opportunity of becoming a limited partner of the firm. Carol has a Bachelor of Arts degree in Business Administration and a Master’s degree in Organizational Management. On a more personal note, I have always loved the theater and would go to NYC for Broadway shows. I have thoroughly enjoyed the caliber of performances at Manatee Performing Arts, and look forward to being part of the team and fulfilling my position on the board.\nTom Seguin\nJim Wolfe – Member\nJim Wolfe grew up in Ohio, and has a B.S. in Chemical Engineering from the University of Dayton and an M.S. in Chemical Engineering from Lehigh University. With a passion for innovation and creativity, Jim has held a range of senior level Technical, Business Development and Marketing leadership positions for global companies such as Unilever, Church and Dwight, Firmenich and Takasago. Jim retired to the Bradenton area in 2017.\nIn addition to Jim’s business experience, he has close to 50 years experience working with Community Theaters in Ohio, Pennsylvania, New Jersey, New York and now Florida. He has prior theater Board experience having served as VP of Productions, and then as VP of Marketing for Town and Country Players in Bucks Country, PA.  Since 2017, Jim has been an enthusiastic supporter of Manatee Performing Arts Center/ He  has appeared in numerous MPAC productions including\nThe Music Man\nand\nSunset Boulevard\nduring the 2022-2023 season.\nShannon Glasgow – Member\nShannon and his wife, Morgan, are proud lifelong residents of Manatee County, where Morgan’s family roots go back six generations. Shannon serves as President of USA Fence, a family-owned business that has been serving the community for over 50 years. Deeply committed to giving back, Shannon and Morgan donate their time and resources to numerous local causes, including the Hernando De Soto Historical Foundation, the City of Bradenton Blue Foundation, and an annual Christmas Tree Donation to Manatee County first responders, among others. Shannon and his family live in Palmetto and have three grown children: Savannah, Kolin, and Marina.\nChairman’s Circle\nSteve Bayard, Linda Diem, John Hargreaves, Pat Pickelseimer, Dr. Anthony Pizzo, Jim Reynolds, Nina Richardson, Dr. John “Jack” Schlegel, Priscilla Schlegel, Tom Sparks, Arline Spino, Dr. Steve Tinsworth, Hal West, Mary Zabin",
      "emails": []
    },
    {
      "url": "https://www.manateeperformingartscenter.com/calendar/",
      "is_candidate": false,
      "has_email": true,
      "text": "Calendar\n.nv-page-title\n.nv-page-title-wrap\n[ics_calendar url=”https://outlook.office365.com/owa/calendar/5a494f87a6d84c6184428d40fb95449f@manateeperformingartscenter.com/45195d4f05a649beb2c9a9cf8893e6af5895921848586088249/calendar.ics” view=”month” color=”#702938″ linktitles=”true”]",
      "emails": [
        "5a494f87a6d84c6184428d40fb95449f@manateeperformingartscenter.com"
      ]
    },
    {
      "url": "https://www.manateeperformingartscenter.com/contact/",
      "is_candidate": false,
      "has_email": false,
      "text": "Contact\n.nv-page-title\n.nv-page-title-wrap\nInfo\nFacebook\nTwitter\nInstagram\nYouTube\nManatee Performing Arts Center\nThe Florida Cultural Group, Inc.\n502 Third Avenue West\nBradenton, FL 34205\nAdministrative Offices\n941-749-1111\nFAX: 941-896-8131\nProduction Offices\n941-748-0111\nTicket/Box Office\n941-748-5875\nSign-up for our Newsletter!\nSign Up Here\nBy signing up for our newsletter you are granting the Manatee Performing Arts Center permission to email you. You can revoke permission at any time using the SafeUnsubscribe® link, found at the bottom of every email. We take your privacy seriously (to see for yourself, please read this\nEmail Privacy Policy\n). Emails are serviced by Constant Contact.\nEmail\nThe below form is for general questions only. Please refer to our\nStaff Page\nto contact our staff individually.",
      "emails": []
    },
    {
      "url": "https://facebook.com/manateepac",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    }
  ],
  "all_links": [
    "https://www.manateeperformingartscenter.com/terry-lee-goffee-as-johnny-cash/",
    "https://www.manateeperformingartscenter.com/seating-chart/",
    "https://www.manateeperformingartscenter.com/wp/wp-content/uploads/2016/06/janene-amick-lrg.jpg",
    "https://www.manateeperformingartscenter.com/student-ambassador-program/",
    "https://www.manateeperformingartscenter.com/bequest/",
    "https://www.manateeperformingartscenter.com/exhibitions/",
    "https://www.manateeperformingartscenter.com/accessibility/",
    "https://www.manateeperformingartscenter.com/",
    "https://www.manateeperformingartscenter.com/awards/",
    "https://www.manateeperformingartscenter.com/leave-seat-behind/",
    "https://manateeperformingartscenter.com/backstage-tour",
    "https://www.manateeperformingartscenter.com/volunteering/",
    "https://www.manateeperformingartscenter.com/wp/wp-content/uploads/2019/12/John-Tucker_LowRes-scaled.jpg",
    "https://www.manateeperformingartscenter.com/education/",
    "https://www.manateeperformingartscenter.com/wp/wp-content/uploads/Scholarship-Application-Education-05.28.24.pdf",
    "https://www.manateeperformingartscenter.com/wp/wp-content/uploads/2014/09/rick_kerby2014.jpg",
    "https://www.manateeperformingartscenter.com/staff/",
    "https://www.manateeperformingartscenter.com/privacy-policy/",
    "https://www.manateeperformingartscenter.com/gutenberg-the-musical/",
    "https://www.manateeperformingartscenter.com/legal/",
    "https://www.manateeperformingartscenter.com/frozen/",
    "https://www.manateeperformingartscenter.com/auditions/",
    "https://www.manateeperformingartscenter.com/misery/",
    "https://www.manateeperformingartscenter.com/terms-of-use/",
    "https://www.manateeperformingartscenter.com/backdrop-rental/",
    "https://www.manateeperformingartscenter.com/faq/",
    "https://www.manateeperformingartscenter.com/2025-26-manatee-players-season/",
    "https://www.manateeperformingartscenter.com/rentals/",
    "https://www.manateeperformingartscenter.com/the-caribbean-chillers-a-tribute-to-jimmy-buffet/",
    "https://www.manateeperformingartscenter.com/history/",
    "https://www.manateeperformingartscenter.com/board-directors/",
    "https://www.manateeperformingartscenter.com/calendar/",
    "https://www.manateeperformingartscenter.com/contact/",
    "https://www.manateeperformingartscenter.com/wp/wp-content/uploads/2019/12/John-Diem_LowRes-scaled.jpg",
    "https://www.manateeperformingartscenter.com/reviews/",
    "https://www.manateeperformingartscenter.com/directions-parking/",
    "https://www.manateeperformingartscenter.com/hello-dolly/",
    "https://www.manateeperformingartscenter.com/backstage-tour/",
    "https://www.manateeperformingartscenter.com/hotel-alabama-tributes-to-the-eagles-and-alabama/"
  ],
  "candidate_links": [
    "https://www.manateeperformingartscenter.com/staff/",
    "https://www.manateeperformingartscenter.com/board-directors/",
    "https://www.manateeperformingartscenter.com/calendar/",
    "https://www.manateeperformingartscenter.com/contact/",
    "https://facebook.com/manateepac"
  ],
  "visited": [
    "http://www.manateeperformingartscenter.com/",
    "http://www.manateeperformingartscenter.com/about",
    "http://www.manateeperformingartscenter.com/contact",
    "http://www.manateeperformingartscenter.com/staff",
    "http://www.manateeperformingartscenter.com/team",
    "http://www.manateeperformingartscenter.com/board",
    "http://www.manateeperformingartscenter.com/directory",
    "http://www.manateeperformingartscenter.com/events",
    "http://www.manateeperformingartscenter.com/sitemap.xml",
    "http://www.manateeperformingartscenter.com/council",
    "http://www.manateeperformingartscenter.com/leadership",
    "http://www.manateeperformingartscenter.com/management",
    "http://www.manateeperformingartscenter.com/producers",
    "http://www.manateeperformingartscenter.com/support",
    "http://www.manateeperformingartscenter.com/crew",
    "http://www.manateeperformingartscenter.com/members",
    "http://www.manateeperformingartscenter.com/bios",
    "http://www.manateeperformingartscenter.com/people",
    "http://www.manateeperformingartscenter.com/artists",
    "http://www.manateeperformingartscenter.com/musicians",
    "http://www.manateeperformingartscenter.com/faculty",
    "http://www.manateeperformingartscenter.com/administration",
    "https://www.manateeperformingartscenter.com/staff/",
    "https://www.manateeperformingartscenter.com/board-directors/",
    "https://www.manateeperformingartscenter.com/calendar/",
    "https://www.manateeperformingartscenter.com/contact/",
    "https://facebook.com/manateepac"
  ],
  "base_url": "http://www.manateeperformingartscenter.com/"
}