{
  "pages": [
    {
      "url": "https://www.marcoislandart.org/support-the-art-center/",
      "is_candidate": false,
      "has_email": true,
      "text": "Join and Support\nThere are many great (numerous) ways to support the Art Center and several options are actually 100% tax-deductible! We welcome any and all interest in supporting our mission.\nWe are a 501c3 non-profit organization. We rely on membership dues and donations.\nYour generous donations help us keep the cost of classes and educational programs low, provide summer and fall programs for youth and teens and cover regular operating costs required to keep our doors open and free to everyone.\nMarco Island Center for the Arts is not a city service, however, we are grateful for a wonderful relationship with the City of Marco Island and for the donations and support of the many community groups and friends in the area that help us further our mission. Your donations help make sure the Art Center can continue to operate in and positively impact our community for many years to come​\nPlease consider making a donation, or becoming a Sponsor of future fundraising or other exciting Events and Programs.\nBecome a Member\nDonate Now\nBecome a Volunteer\nDid you know?\nA new universal charitable deduction allows taxpayers who do not itemize their returns to receive a tax deduction of up to $300 for cash charitable donations to 501(c)(3) nonprofit organizations during the calendar year.\nFor taxpayers that itemize returns, the limit on the total percentage of Adjusted Gross Income (AGI) eligible for the charitable deduction has been lifted. For questions regarding these new deductions, please consult your tax advisor.",
      "emails": [
        "info@marcoislandart.org"
      ]
    },
    {
      "url": "https://www.marcoislandart.org/events-calendar/",
      "is_candidate": false,
      "has_email": true,
      "text": "Upcoming Events for Marco Island Center for the Arts\nArts Center Theatre production listings click\nhere\nVenturino Comedy Series listings click\nhere\nEventON Calendar\nDate\nTitle\nJump Months\nCurrent Month\nJanuary\nFebruary\nMarch\nApril\nMay\nJune\nJuly\nAugust\nSeptember\nOctober\nNovember\nDecember\n2023\n2024\n2025\n2026\n2027\n3\nEvent Name\nMon\nTue\nWed\nThu\nFri\nSat\nSun\nEvents List\nevo_events_list_box\nEventON End",
      "emails": [
        "info@marcoislandart.org"
      ]
    },
    {
      "url": "https://www.marcoislandart.org/family-events/",
      "is_candidate": false,
      "has_email": true,
      "text": "Fun For the Whole Family\nMarco Island Center for the Arts welcomes you to join the Art Family as we work every year to broaden the scope of activities and events for all ages.   The Art Center offers selected family-friendly activities that encourage our community of parents, grandparents, and youth to join together in celebrating art.\nEventON Calendar\nCurrent Month\nEvents List\nNo Events\nevo_events_list_box\nEventON End",
      "emails": [
        "info@marcoislandart.org"
      ]
    },
    {
      "url": "https://www.marcoislandart.org/about-our-team/",
      "is_candidate": false,
      "has_email": true,
      "text": "Meet your Art Center Family\n\\\nHyla Crane\nExecutive Director\n\\\nKayla Goss\nExecutive Assistant\n\\\nMyriam Kriel\nCreative Manager\n\\\nTommaso Billitteri\nFacilities Maintenance Technician\n\\\nDebbie Kuindersma\nDirector of Finance\n\\\nPatricia Mills\nCommunications Manager\n\\\nMarsha Sherwin\nGift Gallery Associate\nArt Center Address\n1010 Winterberry Drive\nMarco Island, FL 34145\nTelephone 239-394-4221\nFax 239-394-7812\nArts Center Theater Address\nMarco Town Center 1089 N. Collier Blvd.\nFollow Us\nFollow\nFollow\nFollow\nFollow",
      "emails": [
        "info@marcoislandart.org"
      ]
    },
    {
      "url": "https://www.marcoislandart.org/call-to-artist/",
      "is_candidate": false,
      "has_email": true,
      "text": "Submit Your Work\nEach year Marco Island Center for the Arts has several open calls to submit art for an exhibition in our Rush and Lauritzen Galleries.  These exhibitions are usually themed so that the art that is submitted has a general cohesiveness and will offer an artistic expression of the theme.  To submit your work for one of our CTA shows please print the submission waiver and tags and submit with the artwork at the time of intake.\nMarco Island Center for the Arts is inclusive and provide equal and equitable opportunities for all artists who submit artwork.  All applicants will be considered without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status or other applicable legally protected characteristics.  We do not just accept diversity – we celebrate it and thrive on it for the benefit of all.\nAll 2D submissions for Call to Artists and Shows are required to follow the following instruction guidelines\n(courtesy of David Fuller of the Gallery Committee who took the time to create an easy to understand guide)\nDOWNLOAD HANGING GUIDLINES HERE\nFor general CTA art submissions to the Marco Island Art Center, please click below to download the required form\n2024-2025 Call to artists\nKeeping it cool (open CTA)\nIntake  July 31, 2025 10am-Noon\nExhibition open to all artists\nShow dates:August 4-September 30, 2025\nReception: August 12, 2025 and September 9, 2025\n5:30pm-7pm\nClick Here to Download Exhibition Waiver for  KEEPING IT COOL! CTA\n2025-2026 Call to Artists\nEntry fees apply to Members, and “Summertime” exhibitions\nPcs    Member Non-Member\n1      $20    $25\n2      $25     $30\n3      $30    $35\nMini Masters (CTA)\nIntake  December 5, 2025\nMini Masters is a fundraiser that runs concurrent with Holiday Clay Exhibition\nArtists will donate small piece that will be listed as a $50 purchase price (each piece should be marked at this price)\n(no larger than 5×7 in frame)\nDates: December 8- January 6, 2026\nThe display will be hung in Rush Gallery\nClick Here to Download Mini Masters Waiver\nMember Exhibition (CTA)\nIntake  February 26, 2026 10am-Noon\nExhibition Open to all Member Artists\nShow dates: March 2- 24, 2026\nReception: March 10, 2026 5:30pm-7pm\nClick Here to Download Member Show Exhibition Waiver\nAdult Student Show (CTA)\nIntake  March 26, 2026 10am-Noon\nExhibition open to current Adult Students\nShow dates: March 30-April 28, 2026\nReception: April 14, 2026 5:30pm-7pm\nClick Here to Download Exhibition Waiver for  Adult Student Exhibition\n\"SUMMERTIME\" (CTA)\nIntake  July 30, 2026 10am-Noon\nExhibition open to anyone\nShow dates: August 3-September 29, 2026\nReception: August 11, 2026 and September 8, 2026 5:30pm-7pm\nClick Here to Download Exhibition Waiver for \"Summertime\" Exhibition\nELIGIBILITY\nThe Center’s call-to-artist exhibits are open to all artists unless otherwise stated.\nCATEGORIES\nAudio Visual\nClay\nFiber\nGlass\nGraphic art\nJewelry\nMixed media\nPainting\nPhotography\nSculpture\nSUBMISSIONS\nSubmissions are accepted either in-person or by filling in the form below.\nThe deadline for online submissions is one day prior and in-person same day submissions are accepted.\nFor in-person submissions, submissions can be accepted in person the day of intake however we ask that you please download, print, and bring in the waiver with your in-person submission on the day of intake.\nWaiver for Call to artist paper submission\n.\nNUMBER OF SUBMISSIONS\n3 piece maximum per artist in CTA gallery shows with the exception of the Adult Student and Member Shows where the maximum is 2 pieces per artist. Both diptych and triptych work count as 1 piece each.\nENTRY RULES\nWork must be original and not previously exhibited in the Center for the Art’s galleries or gift shop.* There will be no giclées or enhanced giclées allowed.\nWork must be completed within the past three years.\nPieces must be for sale at a price set by the artist prior to intake.*\nA 30% commission is retained by the Center for the Arts on all members’ sales, and a 40% commission is retained on all non-members’ sales.\nAll 2D work must be ready to hang with wires. Wires must be wrapped and taped and set to hang 3 inches from top of the frame. No saw tooth hangers allowed.\nAll 2D work must be framed unless 1 1/2 inch deep Gallery wrap. Gallery wrapped-canvas must have no exposed staples and the edges must be painted and finished.\n3D pieces must be ready to display. Pedestals are limited.\nSize limitations:* – Size includes the size of the artwork including the frame.\n• 2D/wall art: 36″ x 48″ maximum.\n• 3D/pedestal art: 14″ maximum foot print/base and 4′ maximum height.\n• 3D/floor art: 3.5′ x 3.5′ width x 7′ height.\nDirty or scratched mats or frames will not be accepted. All frames must be sturdy and presentable.\nAV entries must be entered with their own projection & sound system, or on a laptop computer that does not exceed size requirements of other media.*\n* Exceptions may be approved by the Executive Director and/or gallery committee at their discretion – Requests for exception to any of these rules must be made a minimum of one week prior to intake date. Art that has not been pre-approved will not be accepted upon intake.\nENTRY FEES\nAll artists who participate in a call to artist show must pay the following entry fees: (no fees for the Adult Student CTA)\nMembers:\n$20 for 1 piece\n$25 for 2 pieces\n$30 for 3 pieces\nNon-members:\n$25 for 1 piece\n$30 for 2 pieces\n$35 for 3 pieces\nJUDGING\nSubmitted art will be judged in accordance with the specified theme and quality standards. Winners will then be chosen.\nAWARDS\nFor each mixed media judged art show the Center for the Arts will announce 1st, 2nd, and 3rd place winners and 2 honorable mentions. Winners will be awarded ribbons. No entry fee will be required for the Adult Student show but it will be judged and ribbons will be awarded\nDELIVERY AND PICK-UP\nAll work must be delivered directly to the Center for the Arts on the date and during the time provided on the call to artist schedule. Entries that arrive early, late or after show is hung will not be accepted. End-of-show pick-up times are listed on the Call-to-Artists schedule. (Exceptions may be made upon request by the Executive Director and/or gallery committee.)\nRECEPTION\nArt receptions are held each month on Second Tuesday.\nEND OF SHOW\nThis is mandatory. At intake you will receive notification of what date to pick up your work. We do not have sufficient storage for all work, therefore all participants must make arrangements for pick-up or they may be charged a storage fee of $5 a day. The Center for the Arts is NOT responsible for work that is not picked up, and if after one month the artwork has not been picked up by the artist responsible it will be considered a donation and become part of our inventory.\nTo submit work for consideration for an exhibition in\nLa Petite Galerie (ONLY) as seen in above photo,\nplease fill out the form below and click the\nNEXT\nbutton at the bottom of the page to upload required attachments (bio/cv, artist statement, and 3-5 jpegs of artist’s work).\nSend email of pieces and information to\nPatricia@marcoisland.org\nNotice: JavaScript is required for this content.\nThat data is being printed as a workaround to page builders reordering the order of the scripts loaded",
      "emails": [
        "info@marcoislandart.org",
        "patricia@marcoisland.org"
      ]
    },
    {
      "url": "https://www.marcoislandart.org/contact/",
      "is_candidate": false,
      "has_email": true,
      "text": "Hours\n:\nMon – Fri\n9:00 a.m. to 4:00 p.m.\n(not counting special events)\nLocation:\n1010 Winterberry Drive\nMarco Island, Florida\n34145, United States\nPhone:\n+1-239-394-4221\nEmail:\ninfo@marcoislandart.org\nWebsite Contact Form\nName\nEmail Address\nMessage\n15 + 15\n=\nSubmit",
      "emails": [
        "info@marcoislandart.org"
      ]
    },
    {
      "url": "https://www.marcoislandart.org/support-the-center/become-a-member/",
      "is_candidate": false,
      "has_email": true,
      "text": "Become A Member or Renew your Membership\nAs a member of the Marco Island Center for the Arts, you help to support programming unique to the Art Center, and most importantly you have an opportunity to contribute to and support local, state, and national programs in the arts.\nThe 2025-2026 membership season begins October 1, 2025\nAdvanced 2025-2026 membership sales begin April 1, 2025.\nMonthly art exhibitions with signature 2\nnd\nTuesday Art receptions\nOver 100 classes and workshops for adult students\nChildren and youth summer workshops\nMusical Interlude Series\nArts Center Theatre\nOutdoor arts and crafts shows\nCars as Art\nAnd more…\nAdditionally, throughout the year we offer numerous cultural experiences and fundraising events that incorporate the arts and are in collaboration with other organizations.\n– NEW –\nMarco Island Center for the Arts has joined the North American Reciprocal Museum (NARM) Association, making it possible for Art Center Members with a\nDual/Family, Friend, Benefactor or Angel Membership\nto receive free admission, gift shop discounts, and other benefits at more than 1,000 museums in North America. All you have to do is present your Art Center Membership Card with a gold North American reciprocal to receive benefits. For a list of participating institutions and more details,\nhttps://narmassociation.org/\n.  Please call the institution that you plan to visit prior to your arrival to verify reciprocal admission and other benefits.\nAll members receive the following benefits:\nIndividual Membership\n$\n85\nReduced entry fees for juried exhibition\nEligibility in\nMembers Only\nexhibitions\nReduced open studio rates\nMember-artists selling in our gift gallery and Lauritzen, Rush and La Petite galleries receive 10% more on sales\n20% discount on most classes and workshops\n5% discount on gift gallery purchases\nOpen invitation for you and a friend to monthly gallery receptions\nDiscount on Musical Interludes concerts\nDiscount on Arts Center Theatre tickets\nJoin Now\nDual/Family\n$\n135\nReduced entry fees for juried exhibition\nEligibility in\nMembers Only\nexhibitions\nReduced open studio rates\nMember-artists selling in our gift gallery and Lauritzen, Rush and La Petite galleries receive 10% more on sales\n20% discount on most classes and workshops\n5% discount on gift gallery purchases\nDiscount on Musical Interludes concerts\nDiscount on Arts Center Theatre tickets\nFor Your whole Household\nNARM reciprocal benefits\nJoin Now\nFriend, Benefactor and Art Angel members receive additional benefits:\nMarco Island Center for the Arts has joined the\nNorth American Reciprocal Museum (NARM) Association\n, making it possible for Art Center Members with a\nDual/Family, Friend, Benefactor or Angel Membership\nto receive free admission, gift shop discounts, and other benefits at more than 1,000 museums in North America. All you have to do is present your Art Center Membership Card with a gold North American reciprocal to receive benefits. For a list of participating institutions and more details visit\nNARM\n.  Please call the institution that you plan to visit prior to your arrival to verify reciprocal admission and other benefits.\nFriend\n$\n250\nReduced entry fees for juried exhibition\nEligibility in\nMembers Only\nexhibitions\nReduced open studio rates\nMember-artists selling in our gift gallery and Lauritzen, Rush and La Petite galleries receive 10% more on sales\n20% discount on most classes and workshops\n5% discount on gift gallery purchases\nDiscount on Musical Interludes concerts\nDiscount on Arts Center Theatre tickets\nPLUS\nAn increase to 10% discount on gift gallery purchases\nNARM reciprocal benefits\nJoin Now\nBenefactor\n$\n500\nReduced entry fees for juried exhibition\nEligibility in\nMembers Only\nexhibitions\nReduced open studio rates\nMember-artists selling in our gift gallery and Lauritzen, Rush and La Petite galleries receive 10% more on sales\n20% discount on most classes and workshops\n5% discount on gift gallery purchases\nDiscount on Musical Interludes concerts\nDiscount on Arts Center Theatre tickets\nPLUS\nAn increase to 15% discount on gift gallery purchases\nNARM reciprocal benefits\nJoin Now\nArt Angel\n$\n1,000\nReduced entry fees for juried exhibition\nEligibility in\nMembers Only\nexhibitions\nReduced open studio rates\nMember-artists selling in our gift gallery and Lauritzen, Rush and La Petite galleries receive 10% more on sales\n20% discount on most classes and workshops\n5% discount on gift gallery purchases\nDiscount on Musical Interludes concerts\nDiscount on Arts Center Theatre tickets\nPLUS\n5% discount on Lauritzen, Rush and La Petite gallery art purchases\n15% discount on gift gallery purchases\nNARM reciprocal benefits\nOne individual membership to give as a gift\nNotification of invitation-only events\nJoin Now\nAre you a Student?\nIf you are a high school or college student (age 22 or younger), we offer a special $12/year membership just for you!\nJoin Now",
      "emails": [
        "info@marcoislandart.org"
      ]
    },
    {
      "url": "https://www.marcoislandart.org/our-events/outdoor-events/",
      "is_candidate": false,
      "has_email": true,
      "text": "More than a building…\nThe Center for the Arts is more than a building.  The spacious grounds of the Center include space for many returning fairs, festivals, and events.\nArts and Crafts Fairs\nOutdoor Art and Craft Shows\nSaturday -Sunday, Jan 17- 18, 2026\nSaturday-Sunday Feb 7-8, 2026\nSaturday -Sunday, Mar 28 – 29, 2026\nThere is no charge to attend any of the Outdoor Art Shows.\nThese outdoor arts and craft fairs are organized by Pam Patullo and potential vendors can reach her at 732-682-3230 or by email at ppatullocreations@msn.com\nCars as Art\nMagnificent vintage cars are displayed and judged by professional artists and not car experts.  The awards are always a surprise.   This event has become a must-attend event for car lovers and enthusiasts in the greater Southwest Florida region. Suggested donation $5 per person.\nTBA",
      "emails": [
        "info@marcoislandart.org",
        "ppatullocreations@msn.com"
      ]
    },
    {
      "url": "https://www.marcoislandart.org/board-of-directors/",
      "is_candidate": false,
      "has_email": true,
      "text": "Board of Directors\nGarry Wheeler\n– President\nDiana Bellini\n– Vice President\nJohn Dougherty\n– Treasurer\nCharlane King\n– Secretary\nCynthia Springer-\nChair of Governance and Nominating\nCharlie Blum\nDavid Caruso\nPatrick Huey\nChristine Koppel\nKathleen Kostecki\nAlicia O’Neill\nStephen Rakoczy\nGina Marie Sisbarro\nEMERITUS BOARD MEMBERS\nJim Richards (President Emeritus)\nSue Darrow\nDawn Henderson\nJohn James\nBruce Robertson\nKenneth Stroud\nMary Zemel",
      "emails": [
        "info@marcoislandart.org"
      ]
    },
    {
      "url": "http://www.facebook.com/marcoislandcenterforthearts",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    },
    {
      "url": "https://www.facebook.com/marcoislandcenterforthearts/",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    }
  ],
  "all_links": [
    "https://www.marcoislandart.org/support-the-art-center/",
    "https://www.marcoislandart.org/events-calendar/",
    "https://www.marcoislandart.org/current-exhibition/",
    "https://www.marcoislandart.org/manhattan-short/",
    "https://www.marcoislandart.org/our-mission/",
    "https://www.marcoislandart.org/my-account/",
    "https://www.marcoislandart.org/art-center-resources/",
    "https://www.marcoislandart.org/terms-and-conditions/",
    "https://www.marcoislandart.org/family-events/",
    "https://www.marcoislandart.org/acting-and-theatre-workshops/",
    "https://www.marcoislandart.org/2025-2026-season-tickets/",
    "https://www.marcoislandart.org/group-ticket-policy/",
    "https://www.marcoislandart.org/support-the-center/volunteer/",
    "https://www.marcoislandart.org/cart/",
    "https://www.marcoislandart.org/high-school-art-show-and-competition/",
    "https://marcoislandart.org/support-the-center/become-a-member/",
    "https://marcoislandart.org/exhibition-calendar/",
    "https://marcoislandart.org/classes-and-workshops/",
    "https://www.marcoislandart.org/become-a-sponsor/",
    "https://www.marcoislandart.org/festival-of-trees/",
    "https://www.marcoislandart.org/events/collage-pick-and-creat-marjorie-pesek-pes-910-col/",
    "https://www.marcoislandart.org/children-and-youth-2/",
    "https://www.marcoislandart.org/live-entertainment/",
    "https://www.marcoislandart.org/virtual-classes/",
    "https://www.marcoislandart.org/",
    "https://www.marcoislandart.org/about-our-team/",
    "https://www.marcoislandart.org/call-to-artist/",
    "https://www.marcoislandart.org/contact/",
    "https://www.marcoislandart.org/support-the-center/become-a-member/",
    "https://www.marcoislandart.org/classes-and-workshops/",
    "https://www.marcoislandart.org/arts-center-theatre/",
    "https://www.marcoislandart.org/space-time-capsule/",
    "https://www.marcoislandart.org/annual-appeal/",
    "https://www.marcoislandart.org/marco-island-old-world-christmas-bazaar-market/",
    "https://www.marcoislandart.org/about-adult-education/instructors/",
    "https://www.marcoislandart.org/planned-giving-legacy-society/",
    "https://marcoislandart.org/support-the-center/donate/",
    "https://marcoislandart.org/current-exhibition/",
    "https://marcoislandart.org/events-calendar/",
    "https://www.marcoislandart.org/annual-gala/",
    "https://www.marcoislandart.org/childrens-summer-classes/",
    "https://www.marcoislandart.org/history/",
    "https://www.marcoislandart.org/our-events/gallery-reception/",
    "https://www.marcoislandart.org/our-events/outdoor-events/",
    "https://www.marcoislandart.org/artist-of-the-year/",
    "https://www.marcoislandart.org/musical-interludes/",
    "https://www.marcoislandart.org/comedy-series/",
    "https://www.marcoislandart.org/arts-center-theatre-audition/",
    "https://marcoislandart.org/support-the-art-center/",
    "https://www.marcoislandart.org/support-the-center/annual-golf-tournament/",
    "https://www.marcoislandart.org/resources/",
    "https://www.marcoislandart.org/exhibition-calendar/",
    "https://www.marcoislandart.org/about-our-team/press-media/",
    "https://www.marcoislandart.org/board-of-directors/",
    "https://www.marcoislandart.org/support-the-center/donate/"
  ],
  "candidate_links": [
    "https://www.marcoislandart.org/support-the-art-center/",
    "https://www.marcoislandart.org/events-calendar/",
    "https://www.marcoislandart.org/family-events/",
    "https://www.marcoislandart.org/about-our-team/",
    "https://www.marcoislandart.org/call-to-artist/",
    "https://www.marcoislandart.org/contact/",
    "https://www.marcoislandart.org/support-the-center/become-a-member/",
    "https://www.marcoislandart.org/our-events/outdoor-events/",
    "https://www.marcoislandart.org/board-of-directors/",
    "http://www.facebook.com/marcoislandcenterforthearts",
    "https://www.facebook.com/marcoislandcenterforthearts/"
  ],
  "visited": [
    "http://marcoislandart.org/",
    "http://marcoislandart.org/about",
    "http://marcoislandart.org/contact",
    "http://marcoislandart.org/staff",
    "http://marcoislandart.org/team",
    "http://marcoislandart.org/board",
    "http://marcoislandart.org/directory",
    "http://marcoislandart.org/events",
    "http://marcoislandart.org/sitemap.xml",
    "http://marcoislandart.org/council",
    "http://marcoislandart.org/leadership",
    "http://marcoislandart.org/management",
    "http://marcoislandart.org/producers",
    "http://marcoislandart.org/support",
    "http://marcoislandart.org/crew",
    "http://marcoislandart.org/members",
    "http://marcoislandart.org/bios",
    "http://marcoislandart.org/people",
    "http://marcoislandart.org/artists",
    "http://marcoislandart.org/musicians",
    "http://marcoislandart.org/faculty",
    "http://marcoislandart.org/administration",
    "https://www.marcoislandart.org/support-the-art-center/",
    "https://www.marcoislandart.org/events-calendar/",
    "https://www.marcoislandart.org/family-events/",
    "https://www.marcoislandart.org/about-our-team/",
    "https://www.marcoislandart.org/call-to-artist/",
    "https://www.marcoislandart.org/contact/",
    "https://www.marcoislandart.org/support-the-center/become-a-member/",
    "https://www.marcoislandart.org/our-events/outdoor-events/",
    "https://www.marcoislandart.org/board-of-directors/",
    "http://www.facebook.com/marcoislandcenterforthearts",
    "https://www.facebook.com/marcoislandcenterforthearts/"
  ],
  "base_url": "http://marcoislandart.org/"
}