{
  "pages": [
    {
      "url": "http://mehaffeysjewelry.com/pages/about-us",
      "is_candidate": false,
      "has_email": true,
      "text": "Home\nAbout Us\nAbout Us\nDiscover timeless elegance at, where tradition meets innovation. Experience impeccable craftsmanship and personalized service for all your jewelry needs.\nHISTORY\nFor over\nyears,\nhas been one of the most trusted names in jewelry in the\nregion. We are a well-established jewelry store that has grown with our community from a small store to a multiple brand jewelry retailer. We have served generations of families as their trusted jeweler for brilliant diamonds, beautiful fine jewelry, elegant watches, treasured gifts, custom made styles and expert jewelry repairs.\nis committed to make every customer \"feel at home\" with our personalized service and our classic to cutting edge jewelry designs. Our years of experience and services have built a legacy of integrity and trust with our customers.\nAt\nour mission has always been a tradition of trust, high ethical standards, knowledge of our jewelry products and services, fair pricing and value to our customers.\nPROMISE\nOur Promise at\nis to provide our customers with a shopping experience that will exceed their expectations of our store, our merchandise and our service.\nwill accomplish this by:\n• Providing you with exceptional attention with every visit to our store.\n• Helping you celebrate your life's special occasions.\n• Providing superior value in terms of merchandise quality, price, selection and satisfaction.\n• A commitment to conduct ourselves with integrity and exceed our customer's expectations in every facet of our business.\nWe realize that individual taste, styling and design are extremely important to you when you decide to make your jewelry purchase. Our aim is to provide quality services and products with the highest degree of customer satisfaction. Our globally sourced designs help to express your unique personality and suit your lifestyle. We will personally help you to select the exact style & design that will celebrate the important occasions and milestones of your life.\nSERVICES\nAll\nproducts come with the service and quality upon which we have built our reputation over the last\nyears. Service after the sale is equally as important as the sale itself.\nprovides reliable quality, trustworthy expertise and a commitment to service like none other. We stand behind your purchase because we believe in the quality of our jewelry and value the longevity of a personal and special relationship with you. There are moments in life that transcends the everyday, and\nis here to make those moments sparkle!\nWe offer our customers a wide range of designs to celebrate the important moments of their life. Our personal relations with our customers have grown over the years and we value the trust you have placed upon us. We help you to select the perfect style to suit your lifestyle. For us no question is too insignificant. You will receive our personal service and detail attention to every purchase you will make.\nPRODUCTS\nWe have a fabulous collection of classic to contemporary jewelry designs and unique styles that nurture your emotions and enhance the joy of gift giving and receiving. The inspiration for our jewelry designs comes from you, our customers, as well as the jewelry trade shows that we attend to source the latest and most innovative jewelry products from across the globe. At\n, you will find a wide selection of fine jewelry, from exquisite Bridals, gorgeous Fashion Rings, beautiful Earrings & Pendants, to attractive Bracelets as well as many Unique and Custom Styles. Our spectacular selection of jewelry is available with a variety of high quality diamonds, emeralds, rubies, sapphires, tanzanite, pearls, aquamarine and other semi-precious gemstones. We have a stunning collection of gold and silver jewelry, as well as many fine watch brands to provide you with a wide range of choice for every occasion.\nAlways competitively priced,\nis committed to being your vital link to the world of beautiful jewelry!\nQUALITY\nguarantees you full satisfaction and value for your money. We are obsessive about quality. We deal with the finest manufacturers across the globe that follow the highest standards of workmanship. We inspect every piece of jewelry and makes sure it follows our strict internal standards of quality control. Our approach makes it possible to offer our customer ultimate satisfaction from every perspective, be it precious metal casting, stone setting, polishing, finishing, style & designs or before & after sales services. No question is too insignificant. You will receive personalized service and you can expect our strict attention to every detail.\nWe personally select each piece of jewelry, diamonds and gemstones in our cases. Since we sell only what we ourselves carefully selected and inspected, we have unrivalled quality control. At our store you can compare different pieces side by side, see, feel and appreciate the difference quality makes.\nSTAFF\nAt\nthe passion for beautiful jewelry and friendly service is obvious. From our buyers who scour the world for that perfect gift, to our friendly sales team whose vast knowledge of both products and people can help guide you through the most difficult of purchasing decisions. From engagement rings and anniversary bands to that perfect Christmas and Valentines Day gift,\noffers you the ultimate shopping experience.\nWhen you buy from us, you will get good advice from a professional, someone who eats, breathes and sleeps jewelry. We have gemological training, read professional journals to keep up to date, travel to trade fairs and seminars and learn all about the products we offer. We can help you be an educated buyer and choose the jewelry that is just right for your lifestyle. We assure you that your visit with us will be pleasant.\nSTORE\nWe realize that individual taste, styling and design are extremely important to you when you decide to make your jewelry purchase. Our aim is to provide quality services and products with the highest degree of customer satisfaction. Our globally sourced designs help to express your unique personality and suit your lifestyle. We will personally help you to select the exact style & design that will celebrate the important occasions and milestones of your life.\nContact Us / Location\nPlease Visit\nat the following location.\nEmail:\nPhone:\nOpening Hours:\nWhy Shop Us\nWhy Shop Us - Reasons to Buy from an Independent Jeweler\nA Neighbor You Can Trust\nBuying jewelry is all about trust. You can trust us because we are an active part of your community. We support local charities and volunteer our time to support local causes. We are here for you and your neighbors and will serve you above and beyond what a corporate business would because we know that word of mouth is the lifeblood of a local business. Make sure when you have a good experience, you tell your friends too!\nGrowing With You\nAs we get older, we sometimes get larger too. We will make sure your jewelry grows with you by resizing your rings and adding links to bracelets, necklaces and watches. If you become very successful later in life, you may want to upgrade an engagement ring, without replacing it, by adding a match to your original center diamond and a larger center diamond between them. Our relationship with you will last a lifetime. In fact, for many families, it stretches for generations.\nIndividual Style\nIn a world where mass production and volume retail is becoming more common, many people settle for cookie-cutter jewelry. Volume retailers order every style by the thousands. You’ll see anything you buy there over and over, even when you travel to other towns. But when you buy from us, you can choose styles that have been hand selected just for your individual taste. In fact we keep individual customers in mind when we go on buying trips and may select something just for you. You will receive individual service that you can never get from a huge corporation that buys in bulk for all its stores.\nNot Just a Face in the Crowd\nYou are important to us: as a friend, a neighbor, and an individual, not just another face in the crowd. We will remember your anniversary and will even know which style your spouse tried on during a recent visit. And we will help you build a wardrobe that works: we can suggest some earrings to match a necklace you bought last year. When you take a big step in your life, like getting engaged or celebrating the birth of a child, we understand how important it is to make the moment match the emotion and can help you personalize your purchase.\nCare & Cleaning\nNot only do we care about you, but we care about your jewelry too! Cleaning rings, bracelets, necklaces, and earrings keeps them beautiful. Bring in your rings every year or two to have the prongs checked to make sure that you never lose a gemstone. We offer this as a free service to customers. When your jewelry looks good, we look good too! Only a local jeweler cares to make sure that your jewelry stays beautiful forever..\nCompetitive Pricing\nYou might be surprised at how competitive we can be. We belong to a powerful buying group which multiples our buying power by hundreds of stores so we can negotiate excellent values on the jewelry we select for you. We travel far & wide to buy our diamonds direct from the source and choose each diamond we sell for maximum beauty and value. Don’t be fooled by the deceptive 80 percent off offers that clog your mailbox: we offer you honest value every day.\nProfessional Advice\nWhen you buy at a chain store or a mass merchant, the person behind the counter might have sold auto parts or ice cream the week before. When you buy from us, you will get good advice from a professional, someone who eats, breathes and sleeps jewelry. We have gemological training, read professional journals to keep up to date, travel to trade fairs and seminars and learn all about the products we offer. We can help you be an educated buyer and choose the jewelry that is just right for your lifestyle.\nAuthorized Dealers\nWe are an authorized dealer for all the brands we carry. This is especially important for watch brands, since grey market watches are often not covered by warranties. In fact, they might even be fakes! The makers of respected brands know that we will stand behind their products with the right kind of product education and after-sales support. As an authorized dealer, we also have access to the latest, most in-demand styles of the season. Make sure the brand you buy is legitimate by buying it in our store.\nAttention to Detail\nWe personally selects each piece of jewelry and gemstone in our cases. We don't sell jewelry from some central warehouse. Since we sell only what we ourselves carefully select, we have unrivalled quality control. When a mass merchant buys thousand of items, often deliveries are only spot-checked. Since we care enough to look carefully at every jewelry piece before buying it, shouldn't you? If you buy from a website or from TV, the piece you receive may not be what you are expecting. At our store you can compare different pieces side by side, see the difference diamond qualities make, and also try on jewelry before you buy.\nDesigns of Your Dreams\nIf you're not getting what you want, we can find it or make it for you. If it’s something simple, you might find it in the catalogs from our preferred suppliers and it can be special ordered for you. And we also offer custom jewelry, with your choice of design and gemstones. You can remake an old piece that you don’t wear or make your jewelry design a reality; it’s up to you, let us making your jewelry dreams come true.\nHome\nSearch\nCollection\nuser\nAccount\nCart\n0\n0 items",
      "emails": [
        "example@domain.com",
        "info@stagheaddesigns.com",
        "john@example.com"
      ]
    },
    {
      "url": "http://mehaffeysjewelry.com/pages/contact-us",
      "is_candidate": false,
      "has_email": true,
      "text": "Home\nContact Us\nContact Us\nName\nPhone number\nEmail\n*\nComment\n*\nGet In Touch!\nWe'd love to hear from you - please use the form to send us your message or ideas.\nStore Hours:\nHome\nSearch\nCollection\nuser\nAccount\nCart\n0\n0 items",
      "emails": [
        "example@domain.com",
        "info@stagheaddesigns.com",
        "john@example.com"
      ]
    },
    {
      "url": "https://www.facebook.com/Mehaffeysjewelry",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    }
  ],
  "all_links": [
    "http://mehaffeysjewelry.com/products/stackable-hexagon-shape-diamond-fashion-ring-408a7moadfgyg",
    "http://mehaffeysjewelry.com/collections/jewelry-pendants-necklaces-fashion-pendants",
    "http://mehaffeysjewelry.com/collections/jewelry-earrings-long-earrings",
    "http://mehaffeysjewelry.com/collections/jewelry-pendants-necklaces-geometric-pendants",
    "http://mehaffeysjewelry.com/search?q=gemstone-bracelets*&type=product",
    "http://mehaffeysjewelry.com/collections/jewelry-engagement-semi-mount-rings",
    "http://mehaffeysjewelry.com/collections/allison-kaufman",
    "http://mehaffeysjewelry.com/collections/jewelry-engagement-matching-bands",
    "http://mehaffeysjewelry.com/pages/faqs",
    "http://mehaffeysjewelry.com/collections/jewelry-earrings-fashion-earrings",
    "http://mehaffeysjewelry.com/collections/ashi",
    "http://mehaffeysjewelry.com/products/stackable-hexagon-shape-diamond-fashion-ring-406a8moadfgyg",
    "http://mehaffeysjewelry.com/cart",
    "http://mehaffeysjewelry.com/collections/vendors?q=ASHI",
    "http://mehaffeysjewelry.com/collections/jewelry-bracelets-bangles-lariat-bracelets",
    "http://mehaffeysjewelry.com/collections/jewelry-rings-diamond-rings",
    "http://mehaffeysjewelry.com/collections/jewelry-lovebright-pendants-necklaces",
    "http://mehaffeysjewelry.com/collections/jewelry-rings-stackable-bands",
    "http://mehaffeysjewelry.com/search?q=diamond-rings*&type=product",
    "http://mehaffeysjewelry.com/pages/designers",
    "http://mehaffeysjewelry.com/collections/jewelry-pendants-necklaces",
    "http://mehaffeysjewelry.com/products/hexagon-shape-diamond-fashion-ring-403a8moadfsyg",
    "http://mehaffeysjewelry.com/collections/jewelry-rings-2stone-rings",
    "http://mehaffeysjewelry.com/collections/jewelry-engagement-engagement-rings",
    "http://mehaffeysjewelry.com/collections/jewelry-bracelets-bangles-bangles",
    "http://mehaffeysjewelry.com/collections/jewelry-silver-jewelry",
    "http://mehaffeysjewelry.com/collections/jewelry-pendants-necklaces-solitaire-pendants",
    "http://mehaffeysjewelry.com/collections/jewelry-engagement-wedding-bands",
    "http://mehaffeysjewelry.com/collections/jewelry-emotion-diamonds",
    "http://mehaffeysjewelry.com/collections/jewelry-lovebright-bracelets-bangles",
    "http://mehaffeysjewelry.com/account/register",
    "http://mehaffeysjewelry.com/collections/jewelry-lovebright",
    "http://mehaffeysjewelry.com/search?q=gemstone-pendants*&type=product",
    "http://mehaffeysjewelry.com/products/round-shape-halo-lovebright-diamond-fashion-ring-157e5moadfgwy",
    "http://mehaffeysjewelry.com/account/login",
    "http://mehaffeysjewelry.com/pages/financing",
    "http://mehaffeysjewelry.com/collections/jewelry-pendants-necklaces-cross-pendants",
    "http://mehaffeysjewelry.com/pages/store-location",
    "http://mehaffeysjewelry.com/collections/jewelry-lovebright-bridals-matching-bands",
    "http://mehaffeysjewelry.com/collections/jewelry-engagement-wedding-band-sets",
    "http://mehaffeysjewelry.com/pages/jewelry-repair",
    "http://mehaffeysjewelry.com/collections/jewelry-rings-promise-rings",
    "http://mehaffeysjewelry.com/pages/education",
    "http://mehaffeysjewelry.com/collections/jewelry-bracelets-bangles",
    "http://mehaffeysjewelry.com/new-in",
    "http://mehaffeysjewelry.com/collections/jewelry-lovebright-bridals-past-present-future",
    "http://mehaffeysjewelry.com/collections/jewelry-pendants-necklaces-circle-pendants",
    "http://mehaffeysjewelry.com/pages/about-us",
    "http://mehaffeysjewelry.com/collections/jewelry-bracelets-bangles-stackable-bangles",
    "http://mehaffeysjewelry.com/pages/watch-repair",
    "http://mehaffeysjewelry.com/collections/jewelry-rings-his-hers-duos",
    "http://mehaffeysjewelry.com/pages/contact-us",
    "http://mehaffeysjewelry.com/collections/jewelry-pendants-necklaces-diamond-pendants",
    "http://mehaffeysjewelry.com/products/heart-shape-lovebright-essential-diamond-engagement-ring-126d6moadfgwg",
    "http://mehaffeysjewelry.com/collections/jewelry-lovebright-essentials",
    "http://mehaffeysjewelry.com/collections/jewelry-engagement-bridal-sets",
    "http://mehaffeysjewelry.com/collections/jewelry-pendants-necklaces-2stone-pendants",
    "http://mehaffeysjewelry.com/pages/we-buy-gold",
    "http://mehaffeysjewelry.com/search?q=fashion-earrings*&type=product",
    "http://mehaffeysjewelry.com/",
    "http://mehaffeysjewelry.com/collections/jewelry-lovebright-bridals",
    "http://mehaffeysjewelry.com/collections/jewelry-lovebright-bridals-engagement-rings",
    "http://mehaffeysjewelry.com/pages/engagement",
    "http://mehaffeysjewelry.com/pages/setup-an-appointment",
    "http://mehaffeysjewelry.com/collections/jewelry-engagement-past-present-future",
    "http://mehaffeysjewelry.com/collections/jewelry-pendants-necklaces-journey-pendants",
    "http://mehaffeysjewelry.com/search?q=bridal-sets*&type=product",
    "http://mehaffeysjewelry.com/products/baguette-diamond-fashion-band-376e0moadfgwg-1-60",
    "http://mehaffeysjewelry.com/collections/jewelry-earrings-earring-jackets",
    "http://mehaffeysjewelry.com/products/alternate-gemstone-diamond-band-46665moadfgemyg",
    "http://mehaffeysjewelry.com/collections/jewelry-pendants-necklaces-heart-pendants",
    "http://mehaffeysjewelry.com/collections/jewelry-earrings-gemstone-earrings",
    "http://mehaffeysjewelry.com/collections/jewelry-lovebright-bridals-bridal-sets",
    "http://mehaffeysjewelry.com/products/oval-shape-gemstone-petite-diamond-fashion-ring-41238moadtsrbyg",
    "http://mehaffeysjewelry.com/pages/wish-list",
    "http://mehaffeysjewelry.com/pages/custom-jewelry-design",
    "http://mehaffeysjewelry.com/products/alternate-gemstone-diamond-wedding-band-46653moadfgemyg",
    "http://mehaffeysjewelry.com/collections/jewelry-earrings",
    "http://mehaffeysjewelry.com/collections/jewelry-pendants-necklaces-gemstone-pendants",
    "http://mehaffeysjewelry.com/collections/jewelry-pendants-necklaces-past-present-future",
    "http://mehaffeysjewelry.com/collections/jewelry-engagement",
    "http://mehaffeysjewelry.com/collections/jewelry-earrings-solitaire-studs",
    "http://mehaffeysjewelry.com/collections/jewelry-pendants-necklaces-station-necklaces",
    "http://mehaffeysjewelry.com/account/login#recover",
    "http://mehaffeysjewelry.com/collections/jewelry-rings",
    "http://mehaffeysjewelry.com/collections/jewelry-bracelets-bangles-gemstone-bracelets",
    "http://mehaffeysjewelry.com/search?q=engagement-rings*&type=product",
    "http://mehaffeysjewelry.com/collections/jewelry-lovebright-rings",
    "http://mehaffeysjewelry.com/pages/testimonials",
    "http://mehaffeysjewelry.com/collections/citizen",
    "http://mehaffeysjewelry.com/collections/jewelry-pendants-necklaces-necklaces",
    "http://mehaffeysjewelry.com/collections/jewelry-fusion-diamonds",
    "http://mehaffeysjewelry.com/collections/jewelry-champagne-diamonds",
    "http://mehaffeysjewelry.com/collections",
    "http://mehaffeysjewelry.com/collections/jewelry-rings-gemstone-rings",
    "http://mehaffeysjewelry.com/products/heart-shape-lovebright-essential-diamond-engagement-ring-126d3moadfgwg",
    "http://mehaffeysjewelry.com/collections/jewelry-engagement-wraps-inserts",
    "http://mehaffeysjewelry.com/collections/jewelry-earrings-2stone-earrings",
    "http://mehaffeysjewelry.com/collections/jewelry-earrings-past-present-future",
    "http://mehaffeysjewelry.com/collections/jewelry-bracelets-bangles-diamond-bracelets",
    "http://mehaffeysjewelry.com/collections/jewelry-earrings-hoop-earrings",
    "http://mehaffeysjewelry.com/collections/jewelry-engagement-solitaire",
    "http://mehaffeysjewelry.com/collections/jewelry-earrings-diamond-earrings",
    "http://mehaffeysjewelry.com/collections/jewelry-earrings-journey-earrings",
    "http://mehaffeysjewelry.com/collections/jewelry-rings-fashion-rings",
    "http://mehaffeysjewelry.com/products/alternate-gemstone-diamond-band-46665moadfgspwg-0-35"
  ],
  "candidate_links": [
    "http://mehaffeysjewelry.com/pages/about-us",
    "http://mehaffeysjewelry.com/pages/contact-us",
    "https://www.facebook.com/Mehaffeysjewelry"
  ],
  "visited": [
    "http://mehaffeysjewelry.com/",
    "http://mehaffeysjewelry.com/about",
    "http://mehaffeysjewelry.com/contact",
    "http://mehaffeysjewelry.com/staff",
    "http://mehaffeysjewelry.com/team",
    "http://mehaffeysjewelry.com/board",
    "http://mehaffeysjewelry.com/directory",
    "http://mehaffeysjewelry.com/events",
    "http://mehaffeysjewelry.com/sitemap.xml",
    "http://mehaffeysjewelry.com/council",
    "http://mehaffeysjewelry.com/leadership",
    "http://mehaffeysjewelry.com/management",
    "http://mehaffeysjewelry.com/producers",
    "http://mehaffeysjewelry.com/support",
    "http://mehaffeysjewelry.com/crew",
    "http://mehaffeysjewelry.com/members",
    "http://mehaffeysjewelry.com/bios",
    "http://mehaffeysjewelry.com/people",
    "http://mehaffeysjewelry.com/artists",
    "http://mehaffeysjewelry.com/musicians",
    "http://mehaffeysjewelry.com/faculty",
    "http://mehaffeysjewelry.com/administration",
    "http://mehaffeysjewelry.com/pages/about-us",
    "http://mehaffeysjewelry.com/pages/contact-us",
    "https://www.facebook.com/Mehaffeysjewelry"
  ],
  "base_url": "http://mehaffeysjewelry.com/"
}