{
  "pages": [
    {
      "url": "https://metzliquors.com/events",
      "is_candidate": false,
      "has_email": true,
      "text": "EVENTS\nWe are excited to announce Metz 1 is now offering THC infused seltzers for you to enjoy. Two different dosages, two different brands, both great flavors!\nMetz 1 & 2\nNFL Pass – Join us to catch the games\nEvery sunday\nmetz 1 & 2\nNFL Sundays – food on the house!\nEvery sunday",
      "emails": [
        "metzliquors@gmail.com"
      ]
    },
    {
      "url": "https://metzliquors.com/about",
      "is_candidate": false,
      "has_email": true,
      "text": "ABOUT US\nOur Story\nEstablished in 1951, Metz Liquors has been a staple in the Daytona Beach Shores area, initially opening its doors as a grocery store. Over the years owners Ed and Ann Metz expanded their business to include a bar and package store, later adding a second bar and package store North of the original location by 1960. The families dedication to providing exceptional service led them to open a third location near the Dunlawton causeway and a full bar and package store on US1 in South Daytona.\nTragedy struck in 1967 with the sudden loss of Ed Metz. Ann Metz took the reins and, with the help of her brothers Bob and Josie Donohue, continued to manage the business. Bob played a crucial role as the general manager, working closely with Ann for many years.\nToday Metz Liquors remains a family-run business, with Ann’s son Peter leading the way alongside two of his children, Joe & Julie. Despite the changes over the years, Metz Liquors continues to operate as one of the longest family-owned businesses in town. We take pride in our deep rooted family spirit and are honored to serve the community that has been apart of our journey for over seven decades.\nOur Mission\nWhen visiting any of our establishments, we strive to bring you the ultimate relaxing experience. Whether you live one mile away or 100 miles away, we want you to feel like family.\n2 Great Locations\nExperience the best of both worlds at our family-run lounges. No matter which you choose, you’ll find exceptional service and a welcoming atmosphere. Visit us today and discover your new favorite spot!\nMetz 1\nBar & Lounge\nMetz 2\nLiquor store & Lounge\nWhat We’re Known For\nWe’re known for having a friendly & cozy atmosphere that you can enjoy 7 day’s a week! We have much to offer that includes but is not limited to a liquor & package store, home to a wide selection of liquors, spirits, wines, beers, and more. We have 2 lounges with full service bars for your enjoyment.\nWhat To Expect\nWhen visiting Metz Lounges, we do our very best to make sure out customers are treated as our number one priority. When anyone walks through our doors they can expect to have a fun and safe experience. We love celebrating all occasions with our customers, whether it be a birthday, holiday, or even passing that exam that you’ve been studying so hard for!",
      "emails": [
        "metzliquors@gmail.com"
      ]
    },
    {
      "url": "https://www.facebook.com/metz.liquors.lounges/",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    }
  ],
  "all_links": [
    "https://metzliquors.com/",
    "http://www.metzliquors.com",
    "https://metzliquors.com/locations",
    "https://metzliquors.com/events",
    "https://metzliquors.com/about"
  ],
  "candidate_links": [
    "https://metzliquors.com/events",
    "https://metzliquors.com/about",
    "https://www.facebook.com/metz.liquors.lounges/"
  ],
  "visited": [
    "http://metzliquors.com/",
    "http://metzliquors.com/about",
    "http://metzliquors.com/contact",
    "http://metzliquors.com/staff",
    "http://metzliquors.com/team",
    "http://metzliquors.com/board",
    "http://metzliquors.com/directory",
    "http://metzliquors.com/events",
    "http://metzliquors.com/sitemap.xml",
    "http://metzliquors.com/council",
    "http://metzliquors.com/leadership",
    "http://metzliquors.com/management",
    "http://metzliquors.com/producers",
    "http://metzliquors.com/support",
    "http://metzliquors.com/crew",
    "http://metzliquors.com/members",
    "http://metzliquors.com/bios",
    "http://metzliquors.com/people",
    "http://metzliquors.com/artists",
    "http://metzliquors.com/musicians",
    "http://metzliquors.com/faculty",
    "http://metzliquors.com/administration",
    "https://metzliquors.com/events",
    "https://metzliquors.com/about",
    "https://www.facebook.com/metz.liquors.lounges/"
  ],
  "base_url": "http://metzliquors.com/"
}