{
  "pages": [
    {
      "url": "http://miamidade.gov/global/government/boards/community-image-advisory-board.page",
      "is_candidate": false,
      "has_email": false,
      "text": "Row 01 - Column 01\nls:begin[component-1553655066004]\nHome\n>\nParks, Recreation and Open Spaces\n>\nCommunity Image Advisory Board\nls:end[component-1553655066004]\nls:begin[component-1591293127163]\nHTML\nCommunity Image Advisory Board\nShare:\nls:end[component-1591293127163]\nRow 02 - Column 01\nls:begin[component-1591293127134]\nHTML\nProgram Goals\nTo clean and green our community.\nGarner support countywide from municipalities, public agencies, and private organizations to improve the way our community looks.\nBuild the framework for long-term streetscape improvements and seek funding for \"great streets\" projects.\nDevelop plans with other agencies to build walkable, livable streetscapes.\nFacilitate aesthetic improvement and greening projects along major corridors.\nPublish and implement the Gateway Standards for Planting and Maintenance and the Miami-Dade Street Tree Master Plan.\nProtect the public investment in landscaping by ensuring that the plants are properly maintained (fertilizing, watering, pruning)\nEliminate trash and litter along our main roadways and transportation gateways.\nProvide opportunities for corporate citizenship and seek sponsors.\nCoordinate volunteer events that supplement governmental efforts.\nServe as a liaison for agencies and organizations responsible for gateway maintenance issues.\nChallenges\nThe vast majority of Miami-Dade's visitors arrive via airplane or cruise ship. From the moment their feet touch our soil, they begin to develop an image of what our County looks like and whether they are pleased with their surroundings. From that first moment, the notion continues to develop of whether he/she will revisit our County.\nAfter assessing our community, many major arteries have been identified in need of enhancement, although the Community Image Advisory Board is confronted with several constraints to accomplishing the goals set forth. They include:\nGraffiti\nWhich although can be easily masked by a fresh coat of paint, can just as easily be re-vandalized the following day.\nLitter\nA persistent problem in our community and costs you, the taxpayer, lots of money. The best way to address our litter problem is through education. Crews can continue to remove the debris, but if residents and visitors do not modify their habits, the problem will continue to exist. Educating the public about the impacts of their actions continues to be a challenge.\nNo space to plant\nAn ongoing challenge for Miami-Dade County due to an over emphasis on grey infrastructure which has in turn, limited green space and opportunities to enhance areas through tree plantings.\nAbsence of color\nHaving colorful landscaping will add to the overall pleasant feeling of our surroundings. Visitors expect to arrive in Miami and see cool tropical colors and lush, flowering trees, not barren roadways.\nPoor quality of lack of landscaping\nThere are locations that would tremendously improve with the addition of ornamental foliage. Funding to plant the new growth is an issue, but the continued maintenance of what has been planted is a larger concern. Some areas are harsh environments in need of frequent irrigation and care and although may not considered bare, may be unsightly due to overgrowth and untamed branches.\nLack of tree canopy\nAdequate tree canopy is vital to the environment and economic well being of our community and as a result, the Public Works RAAM division has been busy planting trees in order to restore the canopy lost during the 2005 Hurricane season. In September 2006 a total of 2,800 Trees were planted. The Office of Community Image will be conducting a Tree Canopy assessment in 2007 using GIS technology in collaboration with the City of Miami and American Forests in order to have a more accurate percentage of tree canopy throughout Miami-Dade County. Stay tuned!\nHurricanes\nThe last comprehensive study of tree canopy in Miami-Dade County, reported the unincorporated area averaged only about 10 percent tree canopy, with some municipalities showing as little as one to two percent tree cover. This problem has only been exacerbated by the increased frequency of hurricanes in Florida in 2004 and 2005, which have magnified the loss of tree canopy in Miami-Dade County. It is estimated that 10,000 trees were lost in County parks and 20% of County planted trees in the rights of way are gone.\nSubcommittees\nThe Community Image Advisory Board is currently comprised of four committees:\nLandscape Committee\nPreviews landscape design for transportation projects and identifies resources to enhance the aesthetics of transportation corridors, gateways and connections.\nMarketing and Education Committee\nDevelops a large-scale anti-litter campaign, the annual poster contest, and coordinating community outreach efforts.\nTree Canopy Committee\nFinds opportunities for the expansion of our community's tree coverage.\nTransportation Corridors and Gateways Committee\nServes as a liaison between the Community Image Advisory Board and the Transit/Transportation agencies in our community.\nls:end[component-1591293127134]\nRow 02 - Column 02\nls:begin[component-1591293127164]\nHTML\nContact Us\nCommunity Image Advisory Board\n275 NW 2nd Street, Suite 540\nMiami, Florida 33128\nPatrice Gillespie Smith\nCommunity Image Manager Parks, Recreation, and Open Spaces\nAdministrative Offices:\n305-755-7801\nls:end[component-1591293127164]\nParks, Recreation and Open Spaces\nChristina White\nDirector\nHickman Building\n275 NW 2nd Street, \r\n\r\n                 Miami, FL  33128\n305-755-7800\nContact Us\n|\nAbout Us\nRequest Public Records\nRow 03\nRow 04 - Column 01\nRow 04 - Column 02\nRow 05\nCommunity Image Advisory Board\nShare:\nProgram Goals\nTo clean and green our community.\nGarner support countywide from municipalities, public agencies, and private organizations to improve the way our community looks.\nBuild the framework for long-term streetscape improvements and seek funding for \"great streets\" projects.\nDevelop plans with other agencies to build walkable, livable streetscapes.\nFacilitate aesthetic improvement and greening projects along major corridors.\nPublish and implement the Gateway Standards for Planting and Maintenance and the Miami-Dade Street Tree Master Plan.\nProtect the public investment in landscaping by ensuring that the plants are properly maintained (fertilizing, watering, pruning)\nEliminate trash and litter along our main roadways and transportation gateways.\nProvide opportunities for corporate citizenship and seek sponsors.\nCoordinate volunteer events that supplement governmental efforts.\nServe as a liaison for agencies and organizations responsible for gateway maintenance issues.\nChallenges\nThe vast majority of Miami-Dade's visitors arrive via airplane or cruise ship. From the moment their feet touch our soil, they begin to develop an image of what our County looks like and whether they are pleased with their surroundings. From that first moment, the notion continues to develop of whether he/she will revisit our County.\nAfter assessing our community, many major arteries have been identified in need of enhancement, although the Community Image Advisory Board is confronted with several constraints to accomplishing the goals set forth. They include:\nGraffiti\nWhich although can be easily masked by a fresh coat of paint, can just as easily be re-vandalized the following day.\nLitter\nA persistent problem in our community and costs you, the taxpayer, lots of money. The best way to address our litter problem is through education. Crews can continue to remove the debris, but if residents and visitors do not modify their habits, the problem will continue to exist. Educating the public about the impacts of their actions continues to be a challenge.\nNo space to plant\nAn ongoing challenge for Miami-Dade County due to an over emphasis on grey infrastructure which has in turn, limited green space and opportunities to enhance areas through tree plantings.\nAbsence of color\nHaving colorful landscaping will add to the overall pleasant feeling of our surroundings. Visitors expect to arrive in Miami and see cool tropical colors and lush, flowering trees, not barren roadways.\nPoor quality of lack of landscaping\nThere are locations that would tremendously improve with the addition of ornamental foliage. Funding to plant the new growth is an issue, but the continued maintenance of what has been planted is a larger concern. Some areas are harsh environments in need of frequent irrigation and care and although may not considered bare, may be unsightly due to overgrowth and untamed branches.\nLack of tree canopy\nAdequate tree canopy is vital to the environment and economic well being of our community and as a result, the Public Works RAAM division has been busy planting trees in order to restore the canopy lost during the 2005 Hurricane season. In September 2006 a total of 2,800 Trees were planted. The Office of Community Image will be conducting a Tree Canopy assessment in 2007 using GIS technology in collaboration with the City of Miami and American Forests in order to have a more accurate percentage of tree canopy throughout Miami-Dade County. Stay tuned!\nHurricanes\nThe last comprehensive study of tree canopy in Miami-Dade County, reported the unincorporated area averaged only about 10 percent tree canopy, with some municipalities showing as little as one to two percent tree cover. This problem has only been exacerbated by the increased frequency of hurricanes in Florida in 2004 and 2005, which have magnified the loss of tree canopy in Miami-Dade County. It is estimated that 10,000 trees were lost in County parks and 20% of County planted trees in the rights of way are gone.\nSubcommittees\nThe Community Image Advisory Board is currently comprised of four committees:\nLandscape Committee\nPreviews landscape design for transportation projects and identifies resources to enhance the aesthetics of transportation corridors, gateways and connections.\nMarketing and Education Committee\nDevelops a large-scale anti-litter campaign, the annual poster contest, and coordinating community outreach efforts.\nTree Canopy Committee\nFinds opportunities for the expansion of our community's tree coverage.\nTransportation Corridors and Gateways Committee\nServes as a liaison between the Community Image Advisory Board and the Transit/Transportation agencies in our community.\nContact Us\nCommunity Image Advisory Board\n275 NW 2nd Street, Suite 540\nMiami, Florida 33128\nPatrice Gillespie Smith\nCommunity Image Manager Parks, Recreation, and Open Spaces\nAdministrative Offices:\n305-755-7801\nMiami-Dade County Facebook - Opens a warning dialog\nMiami-Dade County Twitter - Opens a warning dialog\nMiami-Dade County Instagram - Opens a warning dialog\nMiami-Dade County TV  - Opens a warning dialog\nFeedback\nchat",
      "emails": []
    },
    {
      "url": "http://miamidade.gov/global/service.page?Mduid_service=ser1540308012341709",
      "is_candidate": false,
      "has_email": false,
      "text": "Content\nls:begin[component-1576157007547]\nNatural Areas Management\nShare:\nls:end[component-1576157007547]\nDetails\nls:begin[component-1633006828275]\nls:end[component-1633006828275]\nls:begin[component-1576157007548]\nThe Natural Areas Management Division (NAM) of the Miami-Dade County Parks, Recreation and Open Spaces Department is responsible for the restoration and management of over 45 nature preserves and the on-the-ground maintenance of over 80 nature preserves, totaling more than 26,000 acres of land. Our primary responsibility is to control invasive species to help preserve our native habitats, which are surrounded by an urban and agricultural landscape from which exotic plants easily escape and invade our natural areas. Our crews have thirty years’ experience maintaining and restoring south Florida's delicate upland and wetland habitats. NAM provides natural resources management services as well as scientific and environmental expertise to various county, state and federal agencies.\nMini EcoModel Exhibit\nMiami-Dade County’s natural areas are home to a wide variety of plant and animal species. Many of these species are unique to south Florida, and some are found nowhere else in the world. NAM’s mini ecomodels are 3-D replicas of four natural habitats, which can all be found within a Miami-Dade County park near you.\nThank you for scanning the QRCode on the NAM mini ecomodel display. Please find the interpretive translations for each mini ecomodel in the links below.\nPine Rockland\nEnglish\nSpanish\nCreole\nMangrove Forest\nEnglish\nSpanish\nCreole\nCoastal Dunes\nEnglish\nSpanish\nCreole\nTropical Harwood Hammock\nEnglish\nSpanish\nCreole\nAbout Us\nMission:\nTo restore, protect and manage Miami-Dade County's natural environment through conservation, resource management, environmental partnerships, and community outreach and to preserve these areas for present and future generations.\nHistory\nIn 1991 the Parks Department established the Natural Areas Management Division to initiate active management of the natural areas under its jurisdiction. The groundwork for the program was funded by an Elizabeth Ordway Dunn Foundation grant which allowed Miami-Dade Parks, The Nature Conservancy, and Fairchild Tropical Botanic Garden to form a conservation partnership.\nToday, over 26,000 acres of native habitats occur on over 125 sites in Miami-Dade's nature preserve system, including globally-endangered pine rocklands, hammocks, scrub, wetlands, and coastal dunes. Less than 1% of Miami-Dade County's original 185,000 acres\nof forest remain, making these remnant forests and wetlands particularly important and sensitive resources. The diversity of plant species found within the County's preserves is incredible; more than 60 species are found nowhere else in the world. These natural areas also provide food and shelter resources to native wildlife and serve as critical resting and feeding areas for migrating birds. Miami-Dade's natural areas are also focal points for environmental education, nature study, wildlife observation and other passive recreation activities.\nUnfortunately, South Florida's hospitable environment has also favored the colonization of many invasive, non-native plant species. Over the last century, humans have introduced hundreds of plants from all parts of the world to south Florida. Most have caused no significant problems but some have become invasive, causing negative impacts by competing with native species for limited resources such as space, light and nutrients. With few or no natural enemies to control their growth, some highly invasive species such as Australian pine, Brazilian pepper, melaleuca, and air potato vine are capable of completely displacing native habitats.\nPartnerships\nNatural Areas Management forms integral partnerships with different agencies, conservation organizations, schools, and other entities to maximize natural resource management and protection for south Florida's native habitats and species, including:\nMiami-Dade County Environmentally Endangered Lands Program\nFairchild Tropical Botanical Garden\nEverglades Cooperative Invasive Species Management Area\nFlorida Forest Service\nFlorida Fish and Wildlife Conservation Commission\nU.S. Department of Agriculture\nTERRA Environmental Research Institute\nls:end[component-1576157007548]\nls:begin[component-1576157007549]\nls:end[component-1576157007549]\nls:begin[component-1591293135219]\nls:end[component-1591293135219]\nls:begin[component-1597976997022]\nls:end[component-1597976997022]\nls:begin[component-1594584299551]\nHTML\nls:end[component-1594584299551]\nRight Navigation\nls:begin[component-1576157007551]\nOnline Options\nNatural Areas Research Permit\nls:end[component-1576157007551]\nls:begin[component-1600143562090]\nls:end[component-1600143562090]\nls:begin[component-1576157007553]\nls:end[component-1576157007553]\nls:begin[component-1599220279834]\nls:end[component-1599220279834]\nls:begin[component-1576157007554]\nHTML\nParks, Recreation and Open Spaces\nChristina White, \n            Director\nHickman Building\n275 NW 2nd Street, \n             Miami, FL  33128\n305-755-7800\nContact Us\n|\nAbout Us\nRequest Public Records\nls:end[component-1576157007554]\nMiami-Dade County Facebook - Opens a warning dialog\nMiami-Dade County Instagram - Opens a warning dialog\nMiami-Dade County Youtube - Opens a warning dialog\nMiami-Dade County X - Opens a warning dialog\nFeedback\nchat",
      "emails": []
    },
    {
      "url": "https://www.miamidade.gov/global/disclaimer/about-miami-dade-county.page",
      "is_candidate": false,
      "has_email": false,
      "text": "Row 01 - Column 01\nls:begin[component-1553655066004]\nHome\n>\nAbout Miami-Dade County\nls:end[component-1553655066004]\nls:begin[component-1591293134004]\nHTML\nAbout Miami-Dade County\nShare:\nls:end[component-1591293134004]\nRow 02 - Column 01\nls:begin[component-1591293134005]\nHTML\nThe estimated County\npopulation\nwas 2,673,837 in 2022.\nLocation\nMiami-Dade County encompasses more than 2,000 square miles (larger than the states of Rhode Island and Delaware). One-third of Miami-Dade County is located in Everglades National Park. Our community is located along the southeast tip of the Florida peninsula. It is bounded by Biscayne Bay and the Atlantic Ocean to the east, Everglades National Park to the west, the Florida Keys to the south, and Broward County to the North.\nGovernance\nThe Miami-Dade\nBoard of County Commissioners\nis the governing body of unincorporated Miami-Dade County and has broad, regional powers to establish policies for Miami-Dade County services. The government provides major metropolitan services countywide and city-type services for residents of unincorporated areas.\nMiami-Dade has a\nMayor\nwith the power to veto Commission action items. In January 2007, the Mayor was given additional powers providing for the oversight of the day-to-day operations of Miami-Dade. The Mayor can only serve two terms of four years.\nThrough\nordinances and resolutions\n, the 13-member Commission sets policies and establishes laws for the community. Miami-Dade County is structured into 13 districts. Residents choose only from among candidates running in the district in which they live. Commissioners are chosen in non-partisan, single-district elections and can serve two four-year staggered terms, with elections scheduled every two years.\nIn November 2012, the Miami-Dade County Term Limit Amendment was approved, modifying the County charter to establish term limits of two consecutive four-year terms.\nMunicipalities\nThe most populous county in Florida, Miami-Dade County is home to\n34 incorporated municipalities\n, cities, towns and villages, as well as to unincorporated communities and neighborhoods. The City of Miami is the largest municipality, followed by Hialeah, Miami Gardens, Miami Beach, North Miami and Coral Gables.\nUnincorporated Municipal Service Area (UMSA)\nThe areas of the County that do not fall within municipal boundaries comprise the unincorporated area of Miami-Dade. With a population exceeding one million people, the unincorporated area, if declared a city, would form the largest city in Florida and one of the largest in the nation.\nHistory\nFrom the coral reefs to the Everglades the unique subtropical environment of South Florida makes this area unlike any other in the United States. Four hundred years ago the area was a center of international rivalry between the English and French to the north and the Spanish to the south. When the United States gained possession of Florida, the major industry was “wrecking” – living off the spoils from shipwrecks caused by sailing too close to the coral reefs. Early settlements were located near the Miami River and Biscayne Bay. In 1825 a lighthouse was built on Key Biscayne to warn passing ships of the dangerous reefs.\nThe modern era began with the arrival of Henry Flagler’s railroad in 1896. A system of drainage canals began to crisscross the area after the turn of the century. The destruction of mangroves and draining swampland created new land for settlers. In the 1920s a real estate boom changed the area as new subdivisions and tourist resorts were built. From one winter season to the next the City of Miami changed so rapidly that visitors remarked that it had “grown like magic” and Miami came to be know as the \"Magic City.\"\nDuring World War II the military brought thousands of troops to the area for training. When the war ended many returned with their families to live here permanently. A growth surge in population followed the war and the number of tourists began a steady increase as advancements in transportation helped Miami-Dade become a year-round resort.\nToday’s Miami International Airport helps make the county the North American gateway to Latin America and the Caribbean.\nIn the 1960s thousands of refugees from Cuba began coming into the area. In the 1990s Haitians fled their homeland to come here seeking a better life. Emigration helped the County’s population surpass one million in 1962. Today many different ethnic groups and cultures live in this modern metropolitan community.\nWhen European ships first arrived on the South Florida coast Native American peoples called the Tequesta already inhabited the area.\nThe first people to live in the area, perhaps as long as 10,000 years ago, were nomads following herds of big game animals such as mammoth and bison. As these animals became extinct, the people turned to smaller game, along with fish and shellfish. Miami-Dade County’s archaeologist has uncovered evidence of these early peoples. The county is one of a very few to have its own archeologist on staff.\nIn 1998 archaeologists uncovered the “Miami Circle,” a series of holes cut into the oolitic limestone forming a 38-foot diameter circle located on the south side of the mouth of the Miami River. Radiocarbon testing of artifacts found at the site suggests that it is about 2,000 years old and that it served as a ceremonial site long after the arrival of the Europeans.\nJuan Ponce de Leon visited the area in 1513. Two years after founding St. Augustine, Spanish Admiral Pedro Menendez de Aviles established the first European mission on the Miami River’s north bank in 1567. Hostile Indians and mosquitoes soon forced them to leave. The Spanish controlled Florida for the next 250 years, bringing with them modern weapons and diseases that eventually caused the Tequestas to vanish. In the early 1800s a few Bahamian families accepted Spain’s offer of land and began to settle and farm land along the Miami River.\nSpain sold Florida to the United States for five million dollars in 1821. By 1830 the Bahamian lands along the river were purchased and became a slave plantation. A barracks built by the slaves was relocated to downtown’s Lummus Park in the 1920s.\nA series of wars against the Seminoles kept the environment hostile to settlers. During the Second Seminole War army troops and navy sailors built Fort Dallas on the north bank of the mouth of the Miami River. At the end of the nineteenth century Henry Flagler built his elegant Royal Palm Hotel on the site so that travelers on his train would have a place to stay when they came to Miami.\nWhen the county was created in 1836, it stretched from Indian Key to Jupiter inlet. By the late 1890s there were fewer than 1,000 residents in all of Dade County.\nIndian Key was the first county seat, home to a new courthouse where the bounty from wrecked ships was awarded. The Key West courts were too busy and too far from the eastern keys, so locals persuaded the state to split Monroe and form a new county.\nIn 1844 the County seat was moved to Miami. Six years later a census reported 96 residents living the area.\nFollowing the Civil War and the passing of the Homestead Act, determined homesteaders slowly began staking claims and farming the land.\nRapid development followed the arrival of the railroad 1896. The City of Miami was incorporated later that year with 344 voters.\nThe real estate boom of the 1920s was interrupted by a major hurricane and halted by the stock market crash and the Great Depression. On August 24, 1992 one of the country’s worst disasters caused more than $20 billion in damage when Hurricane Andrew hit Miami-Dade County.\nSince that time communities have been rebuilt and today tourism and transportation continue to be the major local industries.\nNotes\nMiami\n-- The name comes from Mayaimi, which means \"very large lake\" and probably refers to Lake Okeechobee. The Miami River marked the beginning of a canoe trail through the Everglades to the big lake.\nDade\n– On February 4, 1836 the Florida legislature voted to name the new county for Major Francis Langhorne Dade who was massacred by Indians in north central Florida at the beginning of the Second Seminole War on December 28, 1835.\nStatistics\nPortMiami, the Cruise Capital of the World, broke the world passenger record in 2018 with 5,591,839 passengers.\nMiami International Airport is the third largest U.S. airport for international passengers (21.9 million in 2018) and first for international freight (1,952,810 tons in 2018)\nMIA set a new all-time record for annual passenger traffic with 45 million passengers in 2018, over 122,000 passengers each day\nFourth largest public school district in the United States (2018)\nPopulation: 2,761,581 (larger than 15 states!)\nPercentage of population foreign-born: 52.9 percent\nMedian household income: $46,338\nRegistered vehicles: 2,154,913\nElectric Customers: 1,008,149 (2008)\nMiami-Dade County Water Customers: More than 400.000\nMiami-Dade County Wastewater Customers: More than 360,000\nWater Usage: More than 300 million gallons per day\nClimate:\nAverage Annual Temperature: 76 degrees\nAverage Annual Low Temperature: 59\nAverage Annual High Temperature: 89\nAverage Annual Precipitation: 58 inches\nAverage Annual Chance of Sunshine: 70 percent\nAverage Annual Relative Humidity: 84 percent (morning); 63 percent (afternoon)\nAverage Annual Wind Speed: 9 mph\nElevation: 12 feet\nTwo national parks:\nEverglades National Park (521,591 acres)\nBiscayne National Park (181,000 acres)\nRegistered Voters: 1,438,414\nTotal Housing Units: 1,031,955\nls:end[component-1591293134005]\nRow 02 - Column 02\nHTML\nHelp and Support\nMiami-Dade Home\nPrivacy and Security Notice\nADA Notice\nPublic Accommodations\nDisclaimer\nAbout Miami-Dade\nRow 03\nRow 04 - Column 01\nRow 04 - Column 02\nRow 05\nAbout Miami-Dade County\nShare:\nThe estimated County\npopulation\nwas 2,673,837 in 2022.\nLocation\nMiami-Dade County encompasses more than 2,000 square miles (larger than the states of Rhode Island and Delaware). One-third of Miami-Dade County is located in Everglades National Park. Our community is located along the southeast tip of the Florida peninsula. It is bounded by Biscayne Bay and the Atlantic Ocean to the east, Everglades National Park to the west, the Florida Keys to the south, and Broward County to the North.\nGovernance\nThe Miami-Dade\nBoard of County Commissioners\nis the governing body of unincorporated Miami-Dade County and has broad, regional powers to establish policies for Miami-Dade County services. The government provides major metropolitan services countywide and city-type services for residents of unincorporated areas.\nMiami-Dade has a\nMayor\nwith the power to veto Commission action items. In January 2007, the Mayor was given additional powers providing for the oversight of the day-to-day operations of Miami-Dade. The Mayor can only serve two terms of four years.\nThrough\nordinances and resolutions\n, the 13-member Commission sets policies and establishes laws for the community. Miami-Dade County is structured into 13 districts. Residents choose only from among candidates running in the district in which they live. Commissioners are chosen in non-partisan, single-district elections and can serve two four-year staggered terms, with elections scheduled every two years.\nIn November 2012, the Miami-Dade County Term Limit Amendment was approved, modifying the County charter to establish term limits of two consecutive four-year terms.\nMunicipalities\nThe most populous county in Florida, Miami-Dade County is home to\n34 incorporated municipalities\n, cities, towns and villages, as well as to unincorporated communities and neighborhoods. The City of Miami is the largest municipality, followed by Hialeah, Miami Gardens, Miami Beach, North Miami and Coral Gables.\nUnincorporated Municipal Service Area (UMSA)\nThe areas of the County that do not fall within municipal boundaries comprise the unincorporated area of Miami-Dade. With a population exceeding one million people, the unincorporated area, if declared a city, would form the largest city in Florida and one of the largest in the nation.\nHistory\nFrom the coral reefs to the Everglades the unique subtropical environment of South Florida makes this area unlike any other in the United States. Four hundred years ago the area was a center of international rivalry between the English and French to the north and the Spanish to the south. When the United States gained possession of Florida, the major industry was “wrecking” – living off the spoils from shipwrecks caused by sailing too close to the coral reefs. Early settlements were located near the Miami River and Biscayne Bay. In 1825 a lighthouse was built on Key Biscayne to warn passing ships of the dangerous reefs.\nThe modern era began with the arrival of Henry Flagler’s railroad in 1896. A system of drainage canals began to crisscross the area after the turn of the century. The destruction of mangroves and draining swampland created new land for settlers. In the 1920s a real estate boom changed the area as new subdivisions and tourist resorts were built. From one winter season to the next the City of Miami changed so rapidly that visitors remarked that it had “grown like magic” and Miami came to be know as the \"Magic City.\"\nDuring World War II the military brought thousands of troops to the area for training. When the war ended many returned with their families to live here permanently. A growth surge in population followed the war and the number of tourists began a steady increase as advancements in transportation helped Miami-Dade become a year-round resort.\nToday’s Miami International Airport helps make the county the North American gateway to Latin America and the Caribbean.\nIn the 1960s thousands of refugees from Cuba began coming into the area. In the 1990s Haitians fled their homeland to come here seeking a better life. Emigration helped the County’s population surpass one million in 1962. Today many different ethnic groups and cultures live in this modern metropolitan community.\nWhen European ships first arrived on the South Florida coast Native American peoples called the Tequesta already inhabited the area.\nThe first people to live in the area, perhaps as long as 10,000 years ago, were nomads following herds of big game animals such as mammoth and bison. As these animals became extinct, the people turned to smaller game, along with fish and shellfish. Miami-Dade County’s archaeologist has uncovered evidence of these early peoples. The county is one of a very few to have its own archeologist on staff.\nIn 1998 archaeologists uncovered the “Miami Circle,” a series of holes cut into the oolitic limestone forming a 38-foot diameter circle located on the south side of the mouth of the Miami River. Radiocarbon testing of artifacts found at the site suggests that it is about 2,000 years old and that it served as a ceremonial site long after the arrival of the Europeans.\nJuan Ponce de Leon visited the area in 1513. Two years after founding St. Augustine, Spanish Admiral Pedro Menendez de Aviles established the first European mission on the Miami River’s north bank in 1567. Hostile Indians and mosquitoes soon forced them to leave. The Spanish controlled Florida for the next 250 years, bringing with them modern weapons and diseases that eventually caused the Tequestas to vanish. In the early 1800s a few Bahamian families accepted Spain’s offer of land and began to settle and farm land along the Miami River.\nSpain sold Florida to the United States for five million dollars in 1821. By 1830 the Bahamian lands along the river were purchased and became a slave plantation. A barracks built by the slaves was relocated to downtown’s Lummus Park in the 1920s.\nA series of wars against the Seminoles kept the environment hostile to settlers. During the Second Seminole War army troops and navy sailors built Fort Dallas on the north bank of the mouth of the Miami River. At the end of the nineteenth century Henry Flagler built his elegant Royal Palm Hotel on the site so that travelers on his train would have a place to stay when they came to Miami.\nWhen the county was created in 1836, it stretched from Indian Key to Jupiter inlet. By the late 1890s there were fewer than 1,000 residents in all of Dade County.\nIndian Key was the first county seat, home to a new courthouse where the bounty from wrecked ships was awarded. The Key West courts were too busy and too far from the eastern keys, so locals persuaded the state to split Monroe and form a new county.\nIn 1844 the County seat was moved to Miami. Six years later a census reported 96 residents living the area.\nFollowing the Civil War and the passing of the Homestead Act, determined homesteaders slowly began staking claims and farming the land.\nRapid development followed the arrival of the railroad 1896. The City of Miami was incorporated later that year with 344 voters.\nThe real estate boom of the 1920s was interrupted by a major hurricane and halted by the stock market crash and the Great Depression. On August 24, 1992 one of the country’s worst disasters caused more than $20 billion in damage when Hurricane Andrew hit Miami-Dade County.\nSince that time communities have been rebuilt and today tourism and transportation continue to be the major local industries.\nNotes\nMiami\n-- The name comes from Mayaimi, which means \"very large lake\" and probably refers to Lake Okeechobee. The Miami River marked the beginning of a canoe trail through the Everglades to the big lake.\nDade\n– On February 4, 1836 the Florida legislature voted to name the new county for Major Francis Langhorne Dade who was massacred by Indians in north central Florida at the beginning of the Second Seminole War on December 28, 1835.\nStatistics\nPortMiami, the Cruise Capital of the World, broke the world passenger record in 2018 with 5,591,839 passengers.\nMiami International Airport is the third largest U.S. airport for international passengers (21.9 million in 2018) and first for international freight (1,952,810 tons in 2018)\nMIA set a new all-time record for annual passenger traffic with 45 million passengers in 2018, over 122,000 passengers each day\nFourth largest public school district in the United States (2018)\nPopulation: 2,761,581 (larger than 15 states!)\nPercentage of population foreign-born: 52.9 percent\nMedian household income: $46,338\nRegistered vehicles: 2,154,913\nElectric Customers: 1,008,149 (2008)\nMiami-Dade County Water Customers: More than 400.000\nMiami-Dade County Wastewater Customers: More than 360,000\nWater Usage: More than 300 million gallons per day\nClimate:\nAverage Annual Temperature: 76 degrees\nAverage Annual Low Temperature: 59\nAverage Annual High Temperature: 89\nAverage Annual Precipitation: 58 inches\nAverage Annual Chance of Sunshine: 70 percent\nAverage Annual Relative Humidity: 84 percent (morning); 63 percent (afternoon)\nAverage Annual Wind Speed: 9 mph\nElevation: 12 feet\nTwo national parks:\nEverglades National Park (521,591 acres)\nBiscayne National Park (181,000 acres)\nRegistered Voters: 1,438,414\nTotal Housing Units: 1,031,955\nMiami-Dade County Facebook - Opens a warning dialog\nMiami-Dade County Instagram - Opens a warning dialog\nMiami-Dade County Youtube - Opens a warning dialog\nMiami-Dade County X - Opens a warning dialog\nFeedback\nchat",
      "emails": []
    },
    {
      "url": "http://miamidade.gov/global/recreation/park-directory.page",
      "is_candidate": false,
      "has_email": false,
      "text": "Row 01 - Column 01\nls:begin[component-1553655066004]\nHome\n>\nParks, Recreation and Open Spaces\n>\nPark and Marina Directory\nls:end[component-1553655066004]\nls:begin[component-1570807332421]\nHTML\nPark and Marina Directory\nShare:\nls:end[component-1570807332421]\nRow 02 - Column 01\nls:begin[component-1594584299198]\nHTML\nA-E\n27th Ave Teen Center (Boxing)\nA.D. (Doug) Barnes Park\nAcadia Park\nAlonzo Kelly Park\nAmelia Earhart Park\nArch Creek Park\nArcola Lakes Park\nArcola Lakes Senior Center\nArthur Woodard Park\nArvida Park\nBal Harbour Beach\nBanyan Drive Park\nBanyan Park\nBen Shavis Legacy Park\nBent Tree Park\nBill Bird Marina at Haulover Park\nBill Sadowski Preserve\nBird Lakes Park\nBiscado Park\nBiscayne Gardens Park\nBiscayne Shores & Gardens Park\nBiscayne Trail (East side of canal)\nBlack Creek Trail (Along C-1 Canal)\nBlack Point Park & Marina\nBonanza Ranch Estates Park\nBoys and Girls Club- Kendall Unit (fka K-Land)\nBriar Bay Golf Course\nBriar Bay Park\nBroadmoor Park/School\nBrothers to the Rescue Memorial Park\nCalusa Club Estates Park\nCamp Greynolds\nCamp Matecumbe\nCamp Owaissa Bauer\nCaribbean Park\nCastellow Hammock Preserve & Nature Center\nChapman Field Park\nCharles Burr Park\nCharles Deering Estate\nCherry Grove Park\nChittohatchee Park at Honey Hill\nChuck Pezoldt Park\nCinco De Mayo Park\nClaire Rosichan Park\nColonial Drive Park\nConcord Park\nContinental Park\nCoral Estates Park\nCoral Gables Wayside Park\nCoral Villas Park\nCountry Club of Miami\nCountry Club of Miami South Park\nCountry Club of Miami Tot Lot\nCountry Lake Park\nCountry Village Park\nCrandon Golf Course\nCrandon Marina\nCrandon Nature Center\nCrandon Park\nCrandon Park Amusement Center\nCrandon Tennis Center\nCutler Ridge Skate Park\nDebbie Curtin Park\nDeerwood Bonita Lakes Park\nDevon Aire Park\nDomino Park\nDrew Park\nEden Lakes Park\nEureka Park\nEureka Villas Park\nEverglades Archers Range\nF-O\nFairchild Tropical Botanical Garden\nFerguson Park\nForest Lakes Park\nFrancisco Human Rights Park\nFruit & Spice Park\nGeneral Serafin Sanchez Park\nGladeview Park\nGlenwood Park\nGold Coast Railroad Museum\nGratigny Plateau Park\nGreynolds Golf\nGreynolds Park\nGwen Cherry Park\nHammocks Community Park\nHaulover Beach\nHaulover Park\nHerbert Hoover Marina at Homestead Bayfront Park\nHighland Oaks Park\nHomestead Air Reserve Park\nHomestead Bayfront Park\nInternational Gardens Park\nIves Estates Park\nIves Estates Tennis Center\nIves Estates Tot Lot\nJefferson Reaves, Sr. Park\nJL (Joe) and Enid W. Demps Park\nJoseph Caleb Community Center\nKendale Lakes Park\nKendale Park\nKendall Green Park\nKendall Indian Hammocks Park\nKendall Soccer Park\nKevin Broils Park\nKings Grant Park\nKings Meadow Park\nK-Land Park\nLago Mar Park\nLake Stevens Park\nLarchmont Park\nLarry and Penny Thompson Memorial Park and Campground\nLeisure Park\nLincoln Estates Park\nLittle River Park\nLive Like Bella Park\nLosner Park\nMartin Luther King Blvd (NW 62 St)\nMartin Luther King, Jr. Memorial Park\nMarva Y. Bannerman Park & Pool\nMatheson Hammock Marina\nMatheson Hammock Park\nMcMillan Park\nMiami Beach\nMilitary Trail Park\nMiller Drive Park\nMillers Pond Park\nMilton E. Thompson Park\nModel Cities Bike Path\nModello Park\nModello Wayside Park\nModera Colonnade Park\nNaranja Lakes Park\nNaranja Park\nNixon Smiley Pineland Preserve\nNorman and Jean Reach Park\nNorth Glade Park\nNorth Pointe Community Center\nNorth Shorecrest Park\nNorth Trail Park\nNorthwest Highlands Park\nOak Creek Park\nOak Grove Park\nOak Park\nOjus Park\nOld Cutler Bike Path\nOld Cutler Rest Stop\nOlinda Park\nOlympic Park\nP-Z\nPalm Springs North Pool (NW) at Norman and Jean Reach Park\nPalmetto Golf Course\nPalmetto Mini-Golf\nPalmland Park\nPartners for Youth Park\nPelican Harbor Marina\nPine Ridge B.M.X. Park\nPlaza Licenciado Benito Juarez\nPreston B. Bird & Mary Heinlein Fruit & Spice Park\nPrincetonian Park\nQuail Roost Park\nRichmond Triangle Park\nRoberta Hunter Park\nRock Ridge Park\nRockdale Park\nRockway Park\nRocky Creek Park\nRon Ehmann Park\nRoyale Green Park\nRuben Dario Park\nSabal Chase Park\nSan Jacinto Park\nSandpiper Park\nSchenley Park\nSeminole Wayside Park\nSerena Lakes Park\nSgt. Joseph Delancy Richmond Heights Park\nSharman Park\nSidney Wynn Park at Arcola\nSierra Park\nSnake Creek Trail\nSnapper Creek Park\nSnapper Creek Trail\nSoar Park\nSouth Dade Park\nSouth Dade Trail\nSouthern Estates Park\nSouthridge Park\nSpanish Lakes Park\nSugarwood Park\nSun Lakes Park\nSunkist Park\nSunset Heights Park\nSunset Park\nSunny Isles Beach\nSurfside Beach\nTamiami Canal Park\nTamiami Lakes Park\nTamiami Park\nTamiami Trail Park\nThree Lakes Park\nTrail Glades Range\nTree Island Park\nTropical Estates Park\nTropical Park\nVirginia Key\nWalter A. White Park\nWater Oaks Park\nWest Kendale Lakes Park\nWest Kendall District Park\nWest Little River Park\nWestbrook Park\nWestwind Lakes Park\nWestwood Tennis\nWilbur B. Bell Park\nWild Lime Park\nWilliam Randolph Community Park\nWinston Linear Park\nThe Women's Park\nZoo Miami\nls:end[component-1594584299198]\nRow 02 - Column 02\nls:begin[component-1548263017602]\nParks, Recreation and Open Spaces\nChristina White\nDirector\nHickman Building\n275 NW 2nd Street, \r\n\r\n                 Miami, FL  33128\n305-755-7800\nContact Us\n|\nAbout Us\nRequest Public Records\nls:end[component-1548263017602]\nRow 03\nls:begin[component-1587516712915]\nHTML\nPA-04-FL-4337-PW-08406 PN 37492 - Pursuant to Executive Order 11988 and 44 CFR Part 9.12, final notice is hereby given of FEMA’s intent to provide funding for the following project under the Public Assistance (PA) Program. You can read more in the\npublic notice\n.\nPA-04-FL-4337-PW-08411 PN 37518 - Pursuant to Executive Order 11988 and 44 CFR Part 9.12, final notice is hereby given of FEMA’s intent to provide funding for the following project under the Public Assistance (PA) Program. You can read more in the\npublic notice\n.\nPA-04-FL-4337-PW-08496 PN 37519 - Pursuant to Executive Order 11988 and 44 CFR Part 9.12, final notice is hereby given of FEMA’s intent to provide funding for the following project under the Public Assistance (PA) Program. You can read more in the\npublic notice\n.\nls:end[component-1587516712915]\nRow 04 - Column 01\nRow 04 - Column 02\nRow 05\nPark and Marina Directory\nShare:\nA-E\n27th Ave Teen Center (Boxing)\nA.D. (Doug) Barnes Park\nAcadia Park\nAlonzo Kelly Park\nAmelia Earhart Park\nArch Creek Park\nArcola Lakes Park\nArcola Lakes Senior Center\nArthur Woodard Park\nArvida Park\nBal Harbour Beach\nBanyan Drive Park\nBanyan Park\nBen Shavis Legacy Park\nBent Tree Park\nBill Bird Marina at Haulover Park\nBill Sadowski Preserve\nBird Lakes Park\nBiscado Park\nBiscayne Gardens Park\nBiscayne Shores & Gardens Park\nBiscayne Trail (East side of canal)\nBlack Creek Trail (Along C-1 Canal)\nBlack Point Park & Marina\nBonanza Ranch Estates Park\nBoys and Girls Club- Kendall Unit (fka K-Land)\nBriar Bay Golf Course\nBriar Bay Park\nBroadmoor Park/School\nBrothers to the Rescue Memorial Park\nCalusa Club Estates Park\nCamp Greynolds\nCamp Matecumbe\nCamp Owaissa Bauer\nCaribbean Park\nCastellow Hammock Preserve & Nature Center\nChapman Field Park\nCharles Burr Park\nCharles Deering Estate\nCherry Grove Park\nChittohatchee Park at Honey Hill\nChuck Pezoldt Park\nCinco De Mayo Park\nClaire Rosichan Park\nColonial Drive Park\nConcord Park\nContinental Park\nCoral Estates Park\nCoral Gables Wayside Park\nCoral Villas Park\nCountry Club of Miami\nCountry Club of Miami South Park\nCountry Club of Miami Tot Lot\nCountry Lake Park\nCountry Village Park\nCrandon Golf Course\nCrandon Marina\nCrandon Nature Center\nCrandon Park\nCrandon Park Amusement Center\nCrandon Tennis Center\nCutler Ridge Skate Park\nDebbie Curtin Park\nDeerwood Bonita Lakes Park\nDevon Aire Park\nDomino Park\nDrew Park\nEden Lakes Park\nEureka Park\nEureka Villas Park\nEverglades Archers Range\nF-O\nFairchild Tropical Botanical Garden\nFerguson Park\nForest Lakes Park\nFrancisco Human Rights Park\nFruit & Spice Park\nGeneral Serafin Sanchez Park\nGladeview Park\nGlenwood Park\nGold Coast Railroad Museum\nGratigny Plateau Park\nGreynolds Golf\nGreynolds Park\nGwen Cherry Park\nHammocks Community Park\nHaulover Beach\nHaulover Park\nHerbert Hoover Marina at Homestead Bayfront Park\nHighland Oaks Park\nHomestead Air Reserve Park\nHomestead Bayfront Park\nInternational Gardens Park\nIves Estates Park\nIves Estates Tennis Center\nIves Estates Tot Lot\nJefferson Reaves, Sr. Park\nJL (Joe) and Enid W. Demps Park\nJoseph Caleb Community Center\nKendale Lakes Park\nKendale Park\nKendall Green Park\nKendall Indian Hammocks Park\nKendall Soccer Park\nKevin Broils Park\nKings Grant Park\nKings Meadow Park\nK-Land Park\nLago Mar Park\nLake Stevens Park\nLarchmont Park\nLarry and Penny Thompson Memorial Park and Campground\nLeisure Park\nLincoln Estates Park\nLittle River Park\nLive Like Bella Park\nLosner Park\nMartin Luther King Blvd (NW 62 St)\nMartin Luther King, Jr. Memorial Park\nMarva Y. Bannerman Park & Pool\nMatheson Hammock Marina\nMatheson Hammock Park\nMcMillan Park\nMiami Beach\nMilitary Trail Park\nMiller Drive Park\nMillers Pond Park\nMilton E. Thompson Park\nModel Cities Bike Path\nModello Park\nModello Wayside Park\nModera Colonnade Park\nNaranja Lakes Park\nNaranja Park\nNixon Smiley Pineland Preserve\nNorman and Jean Reach Park\nNorth Glade Park\nNorth Pointe Community Center\nNorth Shorecrest Park\nNorth Trail Park\nNorthwest Highlands Park\nOak Creek Park\nOak Grove Park\nOak Park\nOjus Park\nOld Cutler Bike Path\nOld Cutler Rest Stop\nOlinda Park\nOlympic Park\nP-Z\nPalm Springs North Pool (NW) at Norman and Jean Reach Park\nPalmetto Golf Course\nPalmetto Mini-Golf\nPalmland Park\nPartners for Youth Park\nPelican Harbor Marina\nPine Ridge B.M.X. Park\nPlaza Licenciado Benito Juarez\nPreston B. Bird & Mary Heinlein Fruit & Spice Park\nPrincetonian Park\nQuail Roost Park\nRichmond Triangle Park\nRoberta Hunter Park\nRock Ridge Park\nRockdale Park\nRockway Park\nRocky Creek Park\nRon Ehmann Park\nRoyale Green Park\nRuben Dario Park\nSabal Chase Park\nSan Jacinto Park\nSandpiper Park\nSchenley Park\nSeminole Wayside Park\nSerena Lakes Park\nSgt. Joseph Delancy Richmond Heights Park\nSharman Park\nSidney Wynn Park at Arcola\nSierra Park\nSnake Creek Trail\nSnapper Creek Park\nSnapper Creek Trail\nSoar Park\nSouth Dade Park\nSouth Dade Trail\nSouthern Estates Park\nSouthridge Park\nSpanish Lakes Park\nSugarwood Park\nSun Lakes Park\nSunkist Park\nSunset Heights Park\nSunset Park\nSunny Isles Beach\nSurfside Beach\nTamiami Canal Park\nTamiami Lakes Park\nTamiami Park\nTamiami Trail Park\nThree Lakes Park\nTrail Glades Range\nTree Island Park\nTropical Estates Park\nTropical Park\nVirginia Key\nWalter A. White Park\nWater Oaks Park\nWest Kendale Lakes Park\nWest Kendall District Park\nWest Little River Park\nWestbrook Park\nWestwind Lakes Park\nWestwood Tennis\nWilbur B. Bell Park\nWild Lime Park\nWilliam Randolph Community Park\nWinston Linear Park\nThe Women's Park\nZoo Miami\nPA-04-FL-4337-PW-08406 PN 37492 - Pursuant to Executive Order 11988 and 44 CFR Part 9.12, final notice is hereby given of FEMA’s intent to provide funding for the following project under the Public Assistance (PA) Program. You can read more in the\npublic notice\n.\nPA-04-FL-4337-PW-08411 PN 37518 - Pursuant to Executive Order 11988 and 44 CFR Part 9.12, final notice is hereby given of FEMA’s intent to provide funding for the following project under the Public Assistance (PA) Program. You can read more in the\npublic notice\n.\nPA-04-FL-4337-PW-08496 PN 37519 - Pursuant to Executive Order 11988 and 44 CFR Part 9.12, final notice is hereby given of FEMA’s intent to provide funding for the following project under the Public Assistance (PA) Program. You can read more in the\npublic notice\n.\nMiami-Dade County Facebook - Opens a warning dialog\nMiami-Dade County Instagram - Opens a warning dialog\nMiami-Dade County Youtube - Opens a warning dialog\nMiami-Dade County X - Opens a warning dialog\nFeedback\nchat",
      "emails": []
    },
    {
      "url": "http://miamidade.gov/global/service.page?Mduid_service=ser1540327239557614",
      "is_candidate": false,
      "has_email": false,
      "text": "Content\nls:begin[component-1576157007547]\nJoin the Parks Team\nShare:\nls:end[component-1576157007547]\nDetails\nls:begin[component-1633006828275]\nls:end[component-1633006828275]\nls:begin[component-1576157007548]\nDo you have a passion for parks? Join the Miami-Dade Parks' team of enthusiastic, customer-focused dedicated team of professionals who are making a difference in the lives of the Miami-Dade County community!\nMiami-Dade Parks is recruiting for a variety of positions, including full-time, part-time, volunteers, and internship opportunities. For a full list of employment opportunities, visit the\nCounty jobs\nwebpage.\nRegular Employment Opportunities\nMiami-Dade County offers excellent benefits, which includes medical, dental, optional vision, and disability insurance; optional 457 pre-tax savings plans, optional flexible spending accounts, 13 paid holidays, one birthday holiday, and three floating holidays, paid vacation and sick leave, employee contributory membership in the Florida Retirement System, Tuition Refund Program, and career advancement opportunities.\nNote:\nBenefits are for full-time County employees only.\nUpcoming Job Fairs\nTuesday, April 29\n2 p.m. - 6 p.m.\nJ.L. (JOE) & ENID DEMPS PARK\n11350 SW 216 Street, Miami, FL\nWednesday, May 7\n2 p.m.- 6 p.m.\nGWEN CHERRY PARK\n7090 NW 22 Avenue, Miami, FL\nParks Service Aide (Part-Time) - $15.45 per hour\nHigh school diploma or GED. Three (3) months of experience in customer contact, recreation, or general labor are required. Must possess a Driver's License.\nMust be able to work days, nights, holidays and weekends on a varied work schedule. This position will work with children within our Recreation and Programs.\nPROS Recreation Service Aide (Part-Time) - $15.45 per hour\nHigh school diploma or GED. Three (3) months of experience in customer contact, recreation, or general labor are required. Must possess a Driver's License.\nMust be able to work days, nights, holidays and weekends on a varied work schedule. This position will work with children within our Recreation and Programs.\nPool Parks Service Aide (Part-Time) - $15.45 per hour\nHigh school diploma or GED. Three (3) months of experience in customer contact, recreation, or general labor are required. Must possess a Driver's License.\nMust be able to work days, nights, holidays and weekends on a varied work schedule. This position will work with children within our Recreation and Programs.\nPool/Lake Lifeguard (Part-Time) - $16.48 per hour\nMust possess certifications in adult, infant/child and two-person CPR, first aid and lifeguarding provided by the Red Cross, YMCA or other nationally recognized aquatic training program. Must be 17 years of age. Must successfully complete a high-risk physical exam, including drug/alcohol screening; meet vision standard of 20/40 each eye uncorrected; and successfully complete the Miami Dade County lifeguard skills test. Continued employment requires successful completion of skills test and physical exam, including vision standard, on demand and maintenance of all required certifications.\nSenior Pool/Lake Lifeguard (Part-Time) - $18.48 per hour\nOne season of experience as a Pool/Lake Lifeguard or equivalent is required. Must possess certifications in adult, infant/child and two-person CPR, first aid, lifeguarding and water safety instruction provided by the Red Cross, YMCA or other nationally recognized aquatic training program. Must be 17 years of age. Must successfully complete a high-risk physical exam, including drug/alcohol screening; meet vision standard of 20/40 each eye uncorrected; and successfully complete the Miami-Dade County lifeguard skills test. Continued employment requires successful completion of skills test and physical exam, including vision standard, on demand and maintenance of all required certifications.\nPool Manager - $22.17 per hour\nMinimum age 18 years. One season as Pool/Lake Lifeguard 2 or equivalent is required. Must possess and maintain current certifications in CPR for the Professional Rescuer, First Aid, Lifeguard Training and Water Safety Instructor, provided by the Red Cross, Y.M.C.A. or other nationally recognized aquatic training program. Pool operations experience and pool operator license preferred.\nAutomotive Equipment Operator 1 (Full-Time) - $17.17 per hour\nEighth grade. Six months experience operating light equipment, such as tractors and trucks, dump trucks, water tank trucks, or similar equipment are required.\nMust possess a CDL/Class B. A driving performance test will be given at the time of the interview.\nLandscape Technician (Full-Time) - $16.48 per hour\nHigh school diploma or GED. One year experience in professional landscape maintenance and installation is required. Must possess a valid Driver’s License. Must obtain the Landscape Technician certification within the probationary period.\nVisit the\nCounty jobs\nwebpage for a full list of employment opportunities.\nls:end[component-1576157007548]\nls:begin[component-1576157007549]\nls:end[component-1576157007549]\nls:begin[component-1591293135219]\nls:end[component-1591293135219]\nls:begin[component-1597976997022]\nls:end[component-1597976997022]\nls:begin[component-1594584299551]\nHTML\nls:end[component-1594584299551]\nRight Navigation\nls:begin[component-1576157007551]\nOnline Options\nApply for a job\nls:end[component-1576157007551]\nls:begin[component-1600143562090]\nls:end[component-1600143562090]\nls:begin[component-1576157007553]\nRelated Services\nInternships at Parks\nVolunteer at Parks\nls:end[component-1576157007553]\nls:begin[component-1599220279834]\nls:end[component-1599220279834]\nls:begin[component-1576157007554]\nHTML\nParks, Recreation and Open Spaces\nChristina White, \n            Director\nHickman Building\n275 NW 2nd Street, \n             Miami, FL  33128\n305-755-7800\nContact Us\n|\nAbout Us\nRequest Public Records\nls:end[component-1576157007554]\nMiami-Dade County Facebook - Opens a warning dialog\nMiami-Dade County Instagram - Opens a warning dialog\nMiami-Dade County Youtube - Opens a warning dialog\nMiami-Dade County X - Opens a warning dialog\nFeedback\nchat",
      "emails": []
    },
    {
      "url": "http://miamidade.gov/global/recreation/about-parks.page",
      "is_candidate": false,
      "has_email": false,
      "text": "Row 01 - Column 01\nls:begin[component-1553655066004]\nHome\n>\nParks, Recreation and Open Spaces\n>\nAbout Parks\nls:end[component-1553655066004]\nls:begin[component-1570807331880]\nHTML\nAbout Miami-Dade Parks\nShare:\nls:end[component-1570807331880]\nRow 02 - Column 01\nls:begin[component-1597976999557]\nHTML\nMission and Values\nMission\n:\nWe create outstanding Recreational, Natural and Cultural experiences to enrich you and enhance the quality of life for our community for this and future generations.\nVision:\nConnecting people and parks for life.\nValues\nOutstanding Customer Service\nMiami-Dade Parks, Recreation and Open Spaces provides outstanding customer service exemplified by a professional, effective, efficient, considerate and friendly attitude towards our community, visitors and co-workers.\nEnthusiastic Attitude and Teamwork\nMiami-Dade Parks, Recreation and Open Spaces works as a team based on respect for our co-workers, our community and our environment. Teamwork embodies loyalty to the Department's mission, vision, core values and goals in order to deliver outstanding parks and programs.\nAccountability and Integrity\nMiami-Dade Parks, Recreation and Open Spaces is responsive to the community we serve by building public trust and confidence. We provide dependable, consistent and quality facilities and programs.\nCreativity and Innovation\nMiami-Dade Parks, Recreation and Open Spaces fosters and supports innovative, dynamic and creative solutions, programs and projects placing the Department as a leader in our profession.\nStewardship\nMiami-Dade Parks, Recreation and Open Spaces is a responsible and committed steward of the community's physical, natural and cultural resources creating a legacy for this and future generations.\nInclusiveness and Accessibility\nMiami-Dade Parks, Recreation and Open Spaces provides parks, facilities and programs that are inclusive of the diverse residents of our community and are accessible to those with disabilities.\nLeadership and Professional Development\nMiami-Dade Parks, Recreation and Open Spaces fosters and supports life long professional development, training and mentorship by providing education and professional development opportunities which demonstrate best management, technical and leadership practices.\nExcellence\nMiami-Dade Parks, Recreation and Open Spaces fosters and supports excellence and professionalism in carrying out our mission, vision, and goals for the delivery of outstanding parks, programs and facilities.\nThe Parks Foundation of Miami-Dade\nMiami-Dade County Parks is supported by The Parks Foundation of Miami-Dade a non-profit 501(c)3 organization supporting the Miami-Dade County Parks, Recreation and Open Spaces Department's efforts to further develop Miami-Dade County's world-class parks system for residents and visitors.\nIts mission is to create a healthier, more livable and sustainable Miami community by ensuring the implementation of the Parks Open Space Master Plan and the development of year-round park and recreation programs for local children, adults and people with disabilities\nWireless Miami-Dade\nIn 2008, three of Miami-Dade County's largest public parks-Tropical, Tamiami and Goulds began providing free wireless service to residents and visitors as part of a pilot program. Since then, over 100,000 users have logged on. Due to the success of this pilot program, wireless service will be included in select future parks and in some parks being upgraded.\nThe success of the pilot program has reinforced the goal of Wireless Miami-Dade - to create an environment that is technologically appealing to residents, visitors and businesses; to establish and maintain a sense of community safety; and to reach out to underserved residents. So far, we've concentrated on providing municipal Wi-Fi to residents to shrink the economic obstacles associated with access and deployment. But, more importantly, we want to improve residents' experiences when utilizing County services. So, we began to ask ourselves: what else makes sense today?\nBased on our successful pilot program, we decided to expand our pilot to Metrorail and Metrobus. Since the pilot launch, wireless access has improved the transit experience for commuters, transit workers and has been an added convenience for the residents of Miami-Dade County. Wireless routers have been installed on four coaches serving a total of 20 trains throughout the entire rail network and in two 95 Express Buses.\nToday, riders can hop on a train or bus, and check e-mails, read the newspaper online, or just surf the web on laptops, hand held devices, Kindles and iPads - for free - before they even arrive at the office. It's all about convenience and making the Miami-Dade transit experience better.\nWe're moving forward… embracing new technology and improving service for our residents.\nOur Heritage\nMiami-Dade Parks began as a Division of the County Road and Bridge Department in 1929, planting trees along our community's highways. A.D. Barnes, a leader in the National Parks, Recreation and Open Space movement, persuaded Commodore Matheson to donate 80 acres of land for, the first county park, Matheson Hammock Park.\nMiami-Dade Parks now manages more than 13,500 acres and has more than 280 parks, recreational facilities and greenways. It continues to provide outstanding recreational facilities and programming to more than 2.5 million residents and visitors, making it one of the nation’s largest and busiest leisure service agencies.\nA three-time national Gold medal winner for excellence in Parks administration, it is the only municipal park system of its size to be awarded National Accreditation from the Commission on Accreditation of Parks, Recreation and Open Space Agencies.\nHeritage Parks\nParks are significant assets of a community's heritage. They are places of social and cultural gatherings, places of nature's beauty and places where we simply play.\nIn Miami-Dade, we have 75 years of parks that have enriched our lives and environment. Miami-Dade Parks is proud to preserve that heritage. We have designated seven parks that have played a vital role in this community's history, environment and recreational and cultural experiences.\nls:end[component-1597976999557]\nRow 02 - Column 02\nls:begin[component-1570807331881]\nHTML\nAccommodations for persons with disabilities\nTo request materials in accessible format, sign language interpreters, and/or any accommodation to participate in any Miami-Dade Parks sponsored program or meeting, contact Gisel Prado,\n305-755-7848\nor\n[email protected]\nat least 7 days in advance to initiate your request. TTY users may also call 711 (Florida Relay Service).\nls:end[component-1570807331881]\nls:begin[component-1570807331885]\nHTML\nGet Involved\nJoin our Team\nCitizens Advisory Committe\nInternships\nVolunteer\nls:end[component-1570807331885]\nParks, Recreation and Open Spaces\nChristina White\nDirector\nHickman Building\n275 NW 2nd Street, \r\n\r\n                 Miami, FL  33128\n305-755-7800\nContact Us\n|\nAbout Us\nRequest Public Records\nRow 03\nRow 04 - Column 01\nRow 04 - Column 02\nRow 05\nAbout Miami-Dade Parks\nShare:\nMission and Values\nMission\n:\nWe create outstanding Recreational, Natural and Cultural experiences to enrich you and enhance the quality of life for our community for this and future generations.\nVision:\nConnecting people and parks for life.\nValues\nOutstanding Customer Service\nMiami-Dade Parks, Recreation and Open Spaces provides outstanding customer service exemplified by a professional, effective, efficient, considerate and friendly attitude towards our community, visitors and co-workers.\nEnthusiastic Attitude and Teamwork\nMiami-Dade Parks, Recreation and Open Spaces works as a team based on respect for our co-workers, our community and our environment. Teamwork embodies loyalty to the Department's mission, vision, core values and goals in order to deliver outstanding parks and programs.\nAccountability and Integrity\nMiami-Dade Parks, Recreation and Open Spaces is responsive to the community we serve by building public trust and confidence. We provide dependable, consistent and quality facilities and programs.\nCreativity and Innovation\nMiami-Dade Parks, Recreation and Open Spaces fosters and supports innovative, dynamic and creative solutions, programs and projects placing the Department as a leader in our profession.\nStewardship\nMiami-Dade Parks, Recreation and Open Spaces is a responsible and committed steward of the community's physical, natural and cultural resources creating a legacy for this and future generations.\nInclusiveness and Accessibility\nMiami-Dade Parks, Recreation and Open Spaces provides parks, facilities and programs that are inclusive of the diverse residents of our community and are accessible to those with disabilities.\nLeadership and Professional Development\nMiami-Dade Parks, Recreation and Open Spaces fosters and supports life long professional development, training and mentorship by providing education and professional development opportunities which demonstrate best management, technical and leadership practices.\nExcellence\nMiami-Dade Parks, Recreation and Open Spaces fosters and supports excellence and professionalism in carrying out our mission, vision, and goals for the delivery of outstanding parks, programs and facilities.\nThe Parks Foundation of Miami-Dade\nMiami-Dade County Parks is supported by The Parks Foundation of Miami-Dade a non-profit 501(c)3 organization supporting the Miami-Dade County Parks, Recreation and Open Spaces Department's efforts to further develop Miami-Dade County's world-class parks system for residents and visitors.\nIts mission is to create a healthier, more livable and sustainable Miami community by ensuring the implementation of the Parks Open Space Master Plan and the development of year-round park and recreation programs for local children, adults and people with disabilities\nWireless Miami-Dade\nIn 2008, three of Miami-Dade County's largest public parks-Tropical, Tamiami and Goulds began providing free wireless service to residents and visitors as part of a pilot program. Since then, over 100,000 users have logged on. Due to the success of this pilot program, wireless service will be included in select future parks and in some parks being upgraded.\nThe success of the pilot program has reinforced the goal of Wireless Miami-Dade - to create an environment that is technologically appealing to residents, visitors and businesses; to establish and maintain a sense of community safety; and to reach out to underserved residents. So far, we've concentrated on providing municipal Wi-Fi to residents to shrink the economic obstacles associated with access and deployment. But, more importantly, we want to improve residents' experiences when utilizing County services. So, we began to ask ourselves: what else makes sense today?\nBased on our successful pilot program, we decided to expand our pilot to Metrorail and Metrobus. Since the pilot launch, wireless access has improved the transit experience for commuters, transit workers and has been an added convenience for the residents of Miami-Dade County. Wireless routers have been installed on four coaches serving a total of 20 trains throughout the entire rail network and in two 95 Express Buses.\nToday, riders can hop on a train or bus, and check e-mails, read the newspaper online, or just surf the web on laptops, hand held devices, Kindles and iPads - for free - before they even arrive at the office. It's all about convenience and making the Miami-Dade transit experience better.\nWe're moving forward… embracing new technology and improving service for our residents.\nOur Heritage\nMiami-Dade Parks began as a Division of the County Road and Bridge Department in 1929, planting trees along our community's highways. A.D. Barnes, a leader in the National Parks, Recreation and Open Space movement, persuaded Commodore Matheson to donate 80 acres of land for, the first county park, Matheson Hammock Park.\nMiami-Dade Parks now manages more than 13,500 acres and has more than 280 parks, recreational facilities and greenways. It continues to provide outstanding recreational facilities and programming to more than 2.5 million residents and visitors, making it one of the nation’s largest and busiest leisure service agencies.\nA three-time national Gold medal winner for excellence in Parks administration, it is the only municipal park system of its size to be awarded National Accreditation from the Commission on Accreditation of Parks, Recreation and Open Space Agencies.\nHeritage Parks\nParks are significant assets of a community's heritage. They are places of social and cultural gatherings, places of nature's beauty and places where we simply play.\nIn Miami-Dade, we have 75 years of parks that have enriched our lives and environment. Miami-Dade Parks is proud to preserve that heritage. We have designated seven parks that have played a vital role in this community's history, environment and recreational and cultural experiences.\nAccommodations for persons with disabilities\nTo request materials in accessible format, sign language interpreters, and/or any accommodation to participate in any Miami-Dade Parks sponsored program or meeting, contact Gisel Prado,\n305-755-7848\nor\n[email protected]\nat least 7 days in advance to initiate your request. TTY users may also call 711 (Florida Relay Service).\nGet Involved\nJoin our Team\nCitizens Advisory Committe\nInternships\nVolunteer\nMiami-Dade County Facebook - Opens a warning dialog\nMiami-Dade County Twitter - Opens a warning dialog\nMiami-Dade County Instagram - Opens a warning dialog\nMiami-Dade County TV  - Opens a warning dialog\nFeedback\nchat",
      "emails": []
    },
    {
      "url": "http://miamidade.gov/global/calendar/parks.page",
      "is_candidate": false,
      "has_email": false,
      "text": "Row 01 - Column 01\nls:begin[component-1563896280231]\nls:end[component-1563896280231]\nls:begin[component-1563896280296]\nls:end[component-1563896280296]\nls:begin[component-1563896280297]\nHTML\nParks, Recreation and Open Spaces Events\nShare:\nls:end[component-1563896280297]\nls:begin[component-1563896280298]\nHTML\nls:end[component-1563896280298]\nRow 02 - Column 01\nRow 02 - Column 02\nRow 03\nRow 04 - Column 01\nRow 04 - Column 02\nRow 05\nParks, Recreation and Open Spaces Events\nShare:\nMiami-Dade County Facebook - Opens a warning dialog\nMiami-Dade County Instagram - Opens a warning dialog\nMiami-Dade County Youtube - Opens a warning dialog\nMiami-Dade County X - Opens a warning dialog\nFeedback\nchat",
      "emails": []
    },
    {
      "url": "https://www.miamidade.gov/global/government/commission/home.page",
      "is_candidate": false,
      "has_email": false,
      "text": "Board of County Commissioners\n311\nHelp\nFeedback\nMeet Your Commissioners\nSearch Legislation\nInside the BCC\nNews & Events\nMeeting Calendar\nGovernment Meetings\nWatch Videos\nRelated Links\nMeet Your Commissioners\nSearch Legislation\nInside the BCC\nNews & Events\nMeeting Calendar\nGovernment Meetings\nWatch Videos\nRelated Links\nMeet Your Commissioners\nSearch Legislation\nInside the BCC\nNews & Events\nMeeting Calendar\nGovernment Meetings\nWatch Videos\nRelated Links\nRow 01 - Column 01\nls:begin[component-1553655066004]\nHome\n>\nYour Government\n>\nBoard of County Commissioners\nls:end[component-1553655066004]\nls:begin[component-1596804987270]\nHTML\nWelcome to the Board of County Commissioners (BCC)\nShare:\nThe Board of County Commissioners consists of the individuals elected in 13 districts to represent you. Because our government is strengthened by civic participation and increased involvement from our citizens, our website offers information to help bring Miami-Dade County government closer to you.\nls:end[component-1596804987270]\nls:begin[component-1596804987285]\nHTML\nMeet Your Commissioners\nls:end[component-1596804987285]\nRow 02 - Column 01\nls:begin[component-1596804987283]\nHTML\nChairman\nAnthony Rodriguez\nVice Chairman\nKionne L. Mcghee\nls:end[component-1596804987283]\nRow 02 - Column 02\nls:begin[component-1596804987284]\nHTML\nWho is My Commissioner?\nls:end[component-1596804987284]\nls:begin[component-1696211721135]\nHTML\nRow 03\nls:begin[component-1596804987299]\nHTML\nOliver G. Gilbert, III\nDistrict 1\nMarleine Bastien\nDistrict 2\nKeon Hardemon\nDistrict 3\nMicky Steinberg\nDistrict 4\nEileen Higgins\nDistrict 5\nNatalie Milian Orbis\nDistrict 6\nRaquel A. Regalado\nDistrict 7\nDanielle Cohen Higgins\nDistrict 8\nKionne L. McGhee\nDistrict 9\nAnthony Rodriguez\nDistrict 10\nRoberto J. Gonzalez\nDistrict 11\nJuan Carlos \"JC\" Bermudez\nDistrict 12\nRené Garcia\nDistrict 13\nls:end[component-1596804987299]\nls:begin[component-1596804987382]\nHTML\nSearch Legislation\nQuickly search legislative records using a keyword or phrase.\nKeyword Search\nUse this Legislative Search to locate the record(s) desired. Any search query can be used, from Resolution Number or Requestor to File Type or Title.\nAdvanced Search\nAvailable reports include Meeting Attendance, Voting Record, Matter Requester, Matter Sponsor and Legislative Index.\nLegislative Reports\nls:end[component-1596804987382]\nls:begin[component-1596804987340]\nHTML\nInside the BCC\nOffice of the Chair\nThe Chair presides over all the Miami-Dade Board of County Commissioners meetings and appoints the chairpersons, vice chairpersons, and members of all commission committees. Additionally, oversees other boards and offices under his purview.\nOffice of the Chair\nAgenda Coordination\nThe Office of Agenda Coordination coordinates the legislative process for Miami-Dade County.\nAgenda Coordination\nCommission Auditor\nThe Commission Auditor works on the fiscal operations of County departments and makes findings as to whether the fiscal and legislative policy directions are efficiently and effectively implemented.\nCommission Auditor\nCommunity Advocacy\nThe Office of Community Advocacy coordinates events and initiatives, promotes productive community relations and cultural understanding for a better quality of life for all County residents.\nCommunity Advocacy\nIntergovernmental Affairs\nThe Office of Intergovernmental Affairs ensures that Miami-Dade County's legislative agendas at all levels of government are properly prepared, effectively communicated and adopted in a manner that benefits our community's needs.\nIntergovernmental Affairs\nInternational Trade Consortium\nThe International Trade Consortium addresses issues affecting international trade, assists staff in yearly measurable objectives, program priorities, and recommends the agency's budget for consideration by the Mayor and County Commission.\nInternational Trade Consortium\nMedia Division\nThe Board of County Commissioners' (BCC) Media Division is the communications link between the Board of County Commissioners and residents. The division is available to direct media inquiries, arrange interview requests, coordinate public records requests and supply commission-related materials to the news media.\nMedia Division\nOffice of Policy and Budgetary Affairs\nThe Office of Policy and Budgetary Affairs (OPBA) provides budget, management, and policy support to the Board of County Commissioners.\nOffice of Policy and Budgetary Affairs\nProtocol Division\nProtocol prepares appropriate official awards and documents for formal presentations encompassing a vast assortment of functions of local, national and international consequence.\nProtocol\nls:end[component-1596804987340]\nRow 04 - Column 01\nls:begin[component-1596804987434]\nHTML\nNews & Events\nRead the latest edition of The Chamber Gazette\nThe Chamber Gazette is a quarterly publication and community outreach tool created and produced by the Division of Media of the Miami-Dade Board of County Commissioners.\nls:end[component-1596804987434]\nRow 04 - Column 02\nls:begin[component-1739156973161]\nHTML\nMeeting Calendar\nView 2025 Meeting Calendar\nls:end[component-1739156973161]\nRow 05\nWatch Government Meetings\nThe general public can watch Miami-Dade County meetings on webcast when available. To provide comments at a meeting, the public can either attend the meeting in person or leave a voice message on a phone number listed in the meeting notice on the County calendar or legal advertisement.\nWatch Meetings\nls:begin[component-1688387856398]\nHTML\nWomen's Hall of Fame\nThe Miami-Dade County Board of County Commissioners established the Miami-Dade County\nWomen’s Hall of Fame\nin 2021 to recognize and honor women who have improved the quality of life of individuals and communities throughout Miami-Dade County. The Hall of Fame honors women who have made significant contributions to the improvement of life for women and for all residents of Miami-Dade County and preserves the legacies of important women whose contributions to Miami-Dade County should not be forgotten.\nls:end[component-1688387856398]\nls:begin[component-1596804987448]\nHTML\nWatch Videos\nls:end[component-1596804987448]\nWelcome to the Board of County Commissioners (BCC)\nShare:\nThe Board of County Commissioners consists of the individuals elected in 13 districts to represent you. Because our government is strengthened by civic participation and increased involvement from our citizens, our website offers information to help bring Miami-Dade County government closer to you.\nMeet Your Commissioners\nChairman\nAnthony Rodriguez\nVice Chairman\nKionne L. Mcghee\nWho is My Commissioner?\nOliver G. Gilbert, III\nDistrict 1\nMarleine Bastien\nDistrict 2\nKeon Hardemon\nDistrict 3\nMicky Steinberg\nDistrict 4\nEileen Higgins\nDistrict 5\nNatalie Milian Orbis\nDistrict 6\nRaquel A. Regalado\nDistrict 7\nDanielle Cohen Higgins\nDistrict 8\nKionne L. McGhee\nDistrict 9\nAnthony Rodriguez\nDistrict 10\nRoberto J. Gonzalez\nDistrict 11\nJuan Carlos \"JC\" Bermudez\nDistrict 12\nRené Garcia\nDistrict 13\nSearch Legislation\nQuickly search legislative records using a keyword or phrase.\nKeyword Search\nUse this Legislative Search to locate the record(s) desired. Any search query can be used, from Resolution Number or Requestor to File Type or Title.\nAdvanced Search\nAvailable reports include Meeting Attendance, Voting Record, Matter Requester, Matter Sponsor and Legislative Index.\nLegislative Reports\nInside the BCC\nOffice of the Chair\nThe Chair presides over all the Miami-Dade Board of County Commissioners meetings and appoints the chairpersons, vice chairpersons, and members of all commission committees. Additionally, oversees other boards and offices under his purview.\nOffice of the Chair\nAgenda Coordination\nThe Office of Agenda Coordination coordinates the legislative process for Miami-Dade County.\nAgenda Coordination\nCommission Auditor\nThe Commission Auditor works on the fiscal operations of County departments and makes findings as to whether the fiscal and legislative policy directions are efficiently and effectively implemented.\nCommission Auditor\nCommunity Advocacy\nThe Office of Community Advocacy coordinates events and initiatives, promotes productive community relations and cultural understanding for a better quality of life for all County residents.\nCommunity Advocacy\nIntergovernmental Affairs\nThe Office of Intergovernmental Affairs ensures that Miami-Dade County's legislative agendas at all levels of government are properly prepared, effectively communicated and adopted in a manner that benefits our community's needs.\nIntergovernmental Affairs\nInternational Trade Consortium\nThe International Trade Consortium addresses issues affecting international trade, assists staff in yearly measurable objectives, program priorities, and recommends the agency's budget for consideration by the Mayor and County Commission.\nInternational Trade Consortium\nMedia Division\nThe Board of County Commissioners' (BCC) Media Division is the communications link between the Board of County Commissioners and residents. The division is available to direct media inquiries, arrange interview requests, coordinate public records requests and supply commission-related materials to the news media.\nMedia Division\nOffice of Policy and Budgetary Affairs\nThe Office of Policy and Budgetary Affairs (OPBA) provides budget, management, and policy support to the Board of County Commissioners.\nOffice of Policy and Budgetary Affairs\nProtocol Division\nProtocol prepares appropriate official awards and documents for formal presentations encompassing a vast assortment of functions of local, national and international consequence.\nProtocol\nNews & Events\nRead the latest edition of The Chamber Gazette\nThe Chamber Gazette is a quarterly publication and community outreach tool created and produced by the Division of Media of the Miami-Dade Board of County Commissioners.\nMeeting Calendar\nView 2025 Meeting Calendar\nWatch Government Meetings\nThe general public can watch Miami-Dade County meetings on webcast when available. To provide comments at a meeting, the public can either attend the meeting in person or leave a voice message on a phone number listed in the meeting notice on the County calendar or legal advertisement.\nWatch Meetings\nWomen's Hall of Fame\nThe Miami-Dade County Board of County Commissioners established the Miami-Dade County\nWomen’s Hall of Fame\nin 2021 to recognize and honor women who have improved the quality of life of individuals and communities throughout Miami-Dade County. The Hall of Fame honors women who have made significant contributions to the improvement of life for women and for all residents of Miami-Dade County and preserves the legacies of important women whose contributions to Miami-Dade County should not be forgotten.\nWatch Videos\nRelated Links\nAbout the Board of County Commissioners\nOffice of the Mayor\nPress Releases\nMedia Division\nClerk of the Board\nCommission on Ethics and Public Trust\nCounty Attorney's Office\nServices Near You\nMiami-Dade County Facebook - Opens a warning dialog\nMiami-Dade County Instagram - Opens a warning dialog\nMiami-Dade County Youtube - Opens a warning dialog\nMiami-Dade County X - Opens a warning dialog\nFeedback\nchat",
      "emails": []
    },
    {
      "url": "http://miamidade.gov/global/navigation/agency-directory-boards.page",
      "is_candidate": false,
      "has_email": false,
      "text": "Row 01 - Column 01\nls:begin[component-1553655066004]\nHome\n>\nYour Government\n>\nBoards\nls:end[component-1553655066004]\nls:begin[component-1686619083896]\nHTML\nAgency Directory\nShare:\nls:end[component-1686619083896]\nls:begin[component-1562596079442]\nHTML\nRow 02 - Column 01\nRow 02 - Column 02\nRow 03\nRow 04 - Column 01\nRow 04 - Column 02\nRow 05\nAgency Directory\nShare:\nMiami-Dade County Facebook - Opens a warning dialog\nMiami-Dade County Instagram - Opens a warning dialog\nMiami-Dade County Youtube - Opens a warning dialog\nMiami-Dade County X - Opens a warning dialog\nFeedback\nchat",
      "emails": []
    },
    {
      "url": "https://www.miamidade.gov/global/social-media.page",
      "is_candidate": false,
      "has_email": false,
      "text": "Row 01 - Column 01\nls:begin[component-1553655066004]\nHome\n>\nNews & Social Media\n>\nSocial Media\nls:end[component-1553655066004]\nls:begin[component-1590365311341]\nHTML\nSocial Media\nShare:\nls:end[component-1590365311341]\nRow 02 - Column 01\nls:begin[component-1590365311342]\nHTML\nStay up to date on the latest Miami-Dade County happenings, collaborate on solutions and speak out on the issues that matter to you. Because the more engaged you are, the better off we all are. Follow us today!\nUnder Florida law, all content on these Social Media pages are subject to the public records law,\nChapter 119, Florida Statutes\n. By becoming a fan of these pages, posting comments or messaging these pages, your information will be a matter of public record. Miami-Dade County is required to retain this information in accordance with the State of Florida retention schedule. This may include information on your own page.\nls:end[component-1590365311342]\nls:begin[component-1590365311445]\nHTML\nFollow Us\n@MiamiDadecounty\n@MiamiDadeCounty\n@MiamiDadeCounty\n@MiamiDadeCounty\nls:end[component-1590365311445]\nls:begin[component-1590365311479]\nHTML\nFind Accounts by Social Network\nFacebook\nMiami-Dade County\nAfrican Heritage Cultural Arts Center\nAll Kids Included\nAnimal Services\nAviation\nBlack Affairs Advisory Board\nBoard of County Commissioners\nCitizens' Independent Transportation Trust\nCommunity Action and Human Services\nCommunity Advocacy\nCorrections and Rehabilitation\nCourts\nCultural Affairs\nCulture Shock Miami\nDeering Estate\n(Parks)\nDennis C. Moss Cultural Arts Center\n(Cultural Affairs)\nDistrict 1\nDistrict 2\nDistrict 4\nDistrict 5\nDistrict 6\nDistrict 7\nDistrict 8\nDistrict 9\nDistrict 10\nDistrict 11\nDistrict 12\nDistrict 13\nEconomic Advocacy Trust\nEmergency Management\nEnding the HIV Epidemic\n(formerly Getting 2 Zero)\nEthics\nFilmiami\n(Regulatory and Economic Resources)\nFire Rescue\nGolf Miami-Dade\n(Parks)\nHistoryMiami\nHomeless Trust\nHousing Finance Authority\nHuman Resources\nInternal Services\nJackson Health System\nJuvenile Services\nLesbian, Gay, Bisexual, Transgender Queer Advisory Board\nLibrary\nLove-In Music Fest at Greynolds Park\nManagement and Budget\nMayor\nMedical Examiner\nMiami-Dade 311\nMiami-Dade County Asian American Advisory Board\nMiami-Dade County Auditorium\nMiami-Dade Goodwill Ambassador (GWA)\nMiami-Dade International Trade Consortium\nMiami-Dade Unidentified Persons\nMillion Trees Miami\nMosquito Control\nOffice of Resilience\nOpt Out of Opioids\nParks, Recreation and Open Spaces\nPeople & Internal Services\nPerez Art Museum Miami\nPortMiami\nRegulatory and Economic Resources\nSolid Waste Management\nStrategic Procurement Department\nTrail Glades Gun Range\nTransportation and Public Works\n(Transit)\nVizcaya Museum and Gardens\nWater and Sewer\nYouth Commission\n(Juvenile Services)\nZoo Miami\n(Parks)\nX, formerly known as Twitter\nMiami-Dade County\nAfrican Heritage Cultural Arts Center\nAnimal Services\nAviation\nBlack Affairs Advisory Board\nBoard of County Commissioners\nCitizens' Independent Transportation Trust\nCommunity Advocacy\nCorrections and Rehabilitation\nCourts\nCultural Affairs\nCulture Shock\nDeering Estate at Cutler\n(Parks)\nDennis C. Moss Cultural Arts Center\n(Cultural Affairs)\nDistrict 1\nDistrict 2\nDistrict 4\nDistrict 5\nDistrict 6\nDistrict 7\nDistrict 8\nDistrict 9\nDistrict 10\nDistrict 11\nDistrict 12\nDistrict 13\nEco Adventures\n(Parks)\nEconomic Advocacy Trust\nEmergency Management\nEnding the HIV Epidemic\n(formerly Getting 2 Zero)\nFilmiami\n(Regulatory and Economic Resources)\nFire Rescue\nFruit and Spice Park\n(Parks)\nGolf Miami-Dade\n(Parks)\nHistoryMiami\nHomeless Trust\nHuman Resources\nInformation Technology\nInternal Services\nJackson Health System\nJuvenile Services\nLesbian, Gay, Bisexual, Transgender Queer Advisory Board\nLibrary\nManagement and Budget\nMayor\nMiami-Dade 311\nMiami-Dade County Asian American Advisory Board\nMiami-Dade International Trade Consortium\nMosquito Control\nOffice of Resilience\nOpt Out of Opioids\nParks, Recreation and Open Spaces\nPeople & Internal Services\nPerez Art Museum Miami\nPortMiami\nRegulatory and Economic Resources\nSolid Waste Management\nDepartment Director\nStrategic Procurement Department\nTransportation and Public Works\nTransportation\n(IRideMDT)\nTransportation Planning Organization\nVizcaya Museum and Gardens\nWater and Sewer\nYouth Commission\nZoo Miami\nInstagram\nMiami-Dade County\nAfrican Heritage Cultural Arts Center\nAll Kids Included\nAnimal Services\nArt in Public Places - Cultural Affairs\nAviation\nBlack Affairs Advisory Board\nBoard of County Commissioners\nCamp Owaissa Bauer\nCitizens' Independent Transportation Trust\nCommunity Action and Human Services\nCommunity Advocacy\nCorrections and Rehabilitation\nCulture Shock\nDeering Estate at Cutler\n(Parks)\nDennis C. Moss Cultural Arts Center\n(Cultural Affairs)\nDistrict 1\nDistrict 2\nDistrict 3\nDistrict 4\nDistrict 5\nDistrict 6\nDistrict 7\nDistrict 8\nDistrict 9\nDistrict 10\nDistrict 11\nDistrict 12\nDistrict 13\nEconomic Advocacy Trust\nEnding the HIV Epidemic\n(formerly Getting 2 Zero)\nFilMiami\nFire Rescue\nGolf Miami-Dade\n(Parks)\nHistoryMiami\nHomeless Trust\nInformation Technology\nInternal Services\nJuvenile Services\nLesbian, Gay, Bisexual, Transgender Queer Advisory Board\nLibrary\nMayor\nMedical Examiner\nMiami-Dade County Asian American Advisory Board\nMiami-Dade County Auditorium\nMiami-Dade International Trade Consortium\nMillion Trees\nMosquito Control\nOffice of Resilience\nOpt Out of Opioids\nParks, Recreation and Open Spaces\nPeople & Internal Services\nPortMiami\nRegulatory and Economic Resources\nSolid Waste Management\nStrategic Procurement Department\nTransportation and Public Works\nVizcaya Museum & Gardens\nYouth Commission\n(Juvenile Services)\nWater and Sewer\nZoo Miami\nLinkedIn\nMiami-Dade County\nCitizens' Independent Transportation Trust\nCorrections and Rehabilitation\nCulture Shock Miami\nHistoryMiami\nHuman Resources\nInformation Technology\nInternal Services\nManagement and Budget\nMiami-Dade International Trade Consortium\nMiami International Airport\nParks, Recreation and Open Spaces\nPeople & Internal Operations\nPortMiami\nSolid Waste Management\nStrategic Procurement Department\nTransportation and Public Works\nWater and Sewer\nMiami-Dade County Youth Commission\n(Juvenile Services)\nMiami-Dade International Trade Consortium\nYouTube\nMiami-Dade County\nAviation\nCommunity Advocacy\nFilMiami\nFire Rescue\nHistoryMiami\nMetropolitan Planning Organization\nParks, Recreation and Open Spaces\nVizcaya Museum & Gardens\nNextdoor\nMiami-Dade County\nFoursquare\nCountry Club of Miami\n(Parks)\nCrandon Golf at Key Biscayne\n(Parks)\nGreynolds Golf Course\n(Parks)\nHistoryMiami\nPalmetto Golf Course\n(Parks)\nVimeo\nAviation\nls:end[component-1590365311479]\nRow 02 - Column 02\nls:begin[component-1595106023624]\nCommunications and Customer Experience\nInson Kim\nDirector\nStephen P. Clark Center\n111 NW 1st Street, \r\n\r\n                 Miami, FL  33128\n305-375-5527\nContact Us\nRequest Public Records\nls:end[component-1595106023624]\nRow 03\nls:begin[component-1590365311492]\nHTML\nSocial Media Policy\nMiami-Dade County recognizes and appreciates the rights of all members of our online community to free speech and freedom of expression. This page and all comments posted, however, are regularly monitored by administrators and, while comments will not be edited by County personnel, a comment may be deleted if it violates the social media policy described here.\nComments should be related to the posted topic for the social media page or post. The social media accounts are not meant for comments that do not directly relate to the purpose or topic of the social media website or for service requests. For general comments or communications concerning a department, please contact 311 or on X at\n@miamidade311\n.\nThe following is prohibited on all Miami-Dade County social media pages:\nThe use of obscene, crude, defamatory, threatening, sexually prurient or harassing language\nPersonal attacks of any kind or offensive comments that advocate unlawful discrimination on the basis of race, creed, color, national origin, age, religion, gender, sexual orientation, marital status, physical or mental disability\nComments advocating illegal activity or posting of material that violates copyrights or trademarks of others\nPersonally identifiable information; material of a sexually prurient nature; commercial solicitations unless on behalf of the County\nStatements that endanger public health, safety and security or statements that encourage, provide advice for or solicit the commission of a criminal act\nContent that violates intellectual property or copyright laws\nComments promoting or opposing any person campaigning for election to a political office, or promotion or advertisement of a business or commercial transaction\nUsers are subject to the host site's Terms of Use. Any user in violation of the Terms of Use will be reported. For more information, consult the host website's Terms of Use directly –\nFacebook\n,\nX\n,\nInstagram\n. This Social Media Policy is subject to amendment or modification at any time. Social media sites are a public forum, any content posted is subject to public records retention and disclosure pursuant to Florida law. Opinions expressed by visitors to this page do not necessarily reflect the opinions of Miami-Dade County government.\nls:end[component-1590365311492]\nRow 04 - Column 01\nRow 04 - Column 02\nRow 05\nSocial Media\nShare:\nStay up to date on the latest Miami-Dade County happenings, collaborate on solutions and speak out on the issues that matter to you. Because the more engaged you are, the better off we all are. Follow us today!\nUnder Florida law, all content on these Social Media pages are subject to the public records law,\nChapter 119, Florida Statutes\n. By becoming a fan of these pages, posting comments or messaging these pages, your information will be a matter of public record. Miami-Dade County is required to retain this information in accordance with the State of Florida retention schedule. This may include information on your own page.\nFollow Us\n@MiamiDadecounty\n@MiamiDadeCounty\n@MiamiDadeCounty\n@MiamiDadeCounty\nFind Accounts by Social Network\nFacebook\nMiami-Dade County\nAfrican Heritage Cultural Arts Center\nAll Kids Included\nAnimal Services\nAviation\nBlack Affairs Advisory Board\nBoard of County Commissioners\nCitizens' Independent Transportation Trust\nCommunity Action and Human Services\nCommunity Advocacy\nCorrections and Rehabilitation\nCourts\nCultural Affairs\nCulture Shock Miami\nDeering Estate\n(Parks)\nDennis C. Moss Cultural Arts Center\n(Cultural Affairs)\nDistrict 1\nDistrict 2\nDistrict 4\nDistrict 5\nDistrict 6\nDistrict 7\nDistrict 8\nDistrict 9\nDistrict 10\nDistrict 11\nDistrict 12\nDistrict 13\nEconomic Advocacy Trust\nEmergency Management\nEnding the HIV Epidemic\n(formerly Getting 2 Zero)\nEthics\nFilmiami\n(Regulatory and Economic Resources)\nFire Rescue\nGolf Miami-Dade\n(Parks)\nHistoryMiami\nHomeless Trust\nHousing Finance Authority\nHuman Resources\nInternal Services\nJackson Health System\nJuvenile Services\nLesbian, Gay, Bisexual, Transgender Queer Advisory Board\nLibrary\nLove-In Music Fest at Greynolds Park\nManagement and Budget\nMayor\nMedical Examiner\nMiami-Dade 311\nMiami-Dade County Asian American Advisory Board\nMiami-Dade County Auditorium\nMiami-Dade Goodwill Ambassador (GWA)\nMiami-Dade International Trade Consortium\nMiami-Dade Unidentified Persons\nMillion Trees Miami\nMosquito Control\nOffice of Resilience\nOpt Out of Opioids\nParks, Recreation and Open Spaces\nPeople & Internal Services\nPerez Art Museum Miami\nPortMiami\nRegulatory and Economic Resources\nSolid Waste Management\nStrategic Procurement Department\nTrail Glades Gun Range\nTransportation and Public Works\n(Transit)\nVizcaya Museum and Gardens\nWater and Sewer\nYouth Commission\n(Juvenile Services)\nZoo Miami\n(Parks)\nX, formerly known as Twitter\nMiami-Dade County\nAfrican Heritage Cultural Arts Center\nAnimal Services\nAviation\nBlack Affairs Advisory Board\nBoard of County Commissioners\nCitizens' Independent Transportation Trust\nCommunity Advocacy\nCorrections and Rehabilitation\nCourts\nCultural Affairs\nCulture Shock\nDeering Estate at Cutler\n(Parks)\nDennis C. Moss Cultural Arts Center\n(Cultural Affairs)\nDistrict 1\nDistrict 2\nDistrict 4\nDistrict 5\nDistrict 6\nDistrict 7\nDistrict 8\nDistrict 9\nDistrict 10\nDistrict 11\nDistrict 12\nDistrict 13\nEco Adventures\n(Parks)\nEconomic Advocacy Trust\nEmergency Management\nEnding the HIV Epidemic\n(formerly Getting 2 Zero)\nFilmiami\n(Regulatory and Economic Resources)\nFire Rescue\nFruit and Spice Park\n(Parks)\nGolf Miami-Dade\n(Parks)\nHistoryMiami\nHomeless Trust\nHuman Resources\nInformation Technology\nInternal Services\nJackson Health System\nJuvenile Services\nLesbian, Gay, Bisexual, Transgender Queer Advisory Board\nLibrary\nManagement and Budget\nMayor\nMiami-Dade 311\nMiami-Dade County Asian American Advisory Board\nMiami-Dade International Trade Consortium\nMosquito Control\nOffice of Resilience\nOpt Out of Opioids\nParks, Recreation and Open Spaces\nPeople & Internal Services\nPerez Art Museum Miami\nPortMiami\nRegulatory and Economic Resources\nSolid Waste Management\nDepartment Director\nStrategic Procurement Department\nTransportation and Public Works\nTransportation\n(IRideMDT)\nTransportation Planning Organization\nVizcaya Museum and Gardens\nWater and Sewer\nYouth Commission\nZoo Miami\nInstagram\nMiami-Dade County\nAfrican Heritage Cultural Arts Center\nAll Kids Included\nAnimal Services\nArt in Public Places - Cultural Affairs\nAviation\nBlack Affairs Advisory Board\nBoard of County Commissioners\nCamp Owaissa Bauer\nCitizens' Independent Transportation Trust\nCommunity Action and Human Services\nCommunity Advocacy\nCorrections and Rehabilitation\nCulture Shock\nDeering Estate at Cutler\n(Parks)\nDennis C. Moss Cultural Arts Center\n(Cultural Affairs)\nDistrict 1\nDistrict 2\nDistrict 3\nDistrict 4\nDistrict 5\nDistrict 6\nDistrict 7\nDistrict 8\nDistrict 9\nDistrict 10\nDistrict 11\nDistrict 12\nDistrict 13\nEconomic Advocacy Trust\nEnding the HIV Epidemic\n(formerly Getting 2 Zero)\nFilMiami\nFire Rescue\nGolf Miami-Dade\n(Parks)\nHistoryMiami\nHomeless Trust\nInformation Technology\nInternal Services\nJuvenile Services\nLesbian, Gay, Bisexual, Transgender Queer Advisory Board\nLibrary\nMayor\nMedical Examiner\nMiami-Dade County Asian American Advisory Board\nMiami-Dade County Auditorium\nMiami-Dade International Trade Consortium\nMillion Trees\nMosquito Control\nOffice of Resilience\nOpt Out of Opioids\nParks, Recreation and Open Spaces\nPeople & Internal Services\nPortMiami\nRegulatory and Economic Resources\nSolid Waste Management\nStrategic Procurement Department\nTransportation and Public Works\nVizcaya Museum & Gardens\nYouth Commission\n(Juvenile Services)\nWater and Sewer\nZoo Miami\nLinkedIn\nMiami-Dade County\nCitizens' Independent Transportation Trust\nCorrections and Rehabilitation\nCulture Shock Miami\nHistoryMiami\nHuman Resources\nInformation Technology\nInternal Services\nManagement and Budget\nMiami-Dade International Trade Consortium\nMiami International Airport\nParks, Recreation and Open Spaces\nPeople & Internal Operations\nPortMiami\nSolid Waste Management\nStrategic Procurement Department\nTransportation and Public Works\nWater and Sewer\nMiami-Dade County Youth Commission\n(Juvenile Services)\nMiami-Dade International Trade Consortium\nYouTube\nMiami-Dade County\nAviation\nCommunity Advocacy\nFilMiami\nFire Rescue\nHistoryMiami\nMetropolitan Planning Organization\nParks, Recreation and Open Spaces\nVizcaya Museum & Gardens\nNextdoor\nMiami-Dade County\nFoursquare\nCountry Club of Miami\n(Parks)\nCrandon Golf at Key Biscayne\n(Parks)\nGreynolds Golf Course\n(Parks)\nHistoryMiami\nPalmetto Golf Course\n(Parks)\nVimeo\nAviation\nSocial Media Policy\nMiami-Dade County recognizes and appreciates the rights of all members of our online community to free speech and freedom of expression. This page and all comments posted, however, are regularly monitored by administrators and, while comments will not be edited by County personnel, a comment may be deleted if it violates the social media policy described here.\nComments should be related to the posted topic for the social media page or post. The social media accounts are not meant for comments that do not directly relate to the purpose or topic of the social media website or for service requests. For general comments or communications concerning a department, please contact 311 or on X at\n@miamidade311\n.\nThe following is prohibited on all Miami-Dade County social media pages:\nThe use of obscene, crude, defamatory, threatening, sexually prurient or harassing language\nPersonal attacks of any kind or offensive comments that advocate unlawful discrimination on the basis of race, creed, color, national origin, age, religion, gender, sexual orientation, marital status, physical or mental disability\nComments advocating illegal activity or posting of material that violates copyrights or trademarks of others\nPersonally identifiable information; material of a sexually prurient nature; commercial solicitations unless on behalf of the County\nStatements that endanger public health, safety and security or statements that encourage, provide advice for or solicit the commission of a criminal act\nContent that violates intellectual property or copyright laws\nComments promoting or opposing any person campaigning for election to a political office, or promotion or advertisement of a business or commercial transaction\nUsers are subject to the host site's Terms of Use. Any user in violation of the Terms of Use will be reported. For more information, consult the host website's Terms of Use directly –\nFacebook\n,\nX\n,\nInstagram\n. This Social Media Policy is subject to amendment or modification at any time. Social media sites are a public forum, any content posted is subject to public records retention and disclosure pursuant to Florida law. Opinions expressed by visitors to this page do not necessarily reflect the opinions of Miami-Dade County government.\nMiami-Dade County Facebook - Opens a warning dialog\nMiami-Dade County Instagram - Opens a warning dialog\nMiami-Dade County Youtube - Opens a warning dialog\nMiami-Dade County X - Opens a warning dialog\nFeedback\nchat",
      "emails": []
    },
    {
      "url": "https://www.miamidade.gov/global/calendar/parks.page",
      "is_candidate": false,
      "has_email": false,
      "text": "Row 01 - Column 01\nls:begin[component-1563896280231]\nls:end[component-1563896280231]\nls:begin[component-1563896280296]\nls:end[component-1563896280296]\nls:begin[component-1563896280297]\nHTML\nParks, Recreation and Open Spaces Events\nShare:\nls:end[component-1563896280297]\nls:begin[component-1563896280298]\nHTML\nls:end[component-1563896280298]\nRow 02 - Column 01\nRow 02 - Column 02\nRow 03\nRow 04 - Column 01\nRow 04 - Column 02\nRow 05\nParks, Recreation and Open Spaces Events\nShare:\nMiami-Dade County Facebook - Opens a warning dialog\nMiami-Dade County Instagram - Opens a warning dialog\nMiami-Dade County Youtube - Opens a warning dialog\nMiami-Dade County X - Opens a warning dialog\nFeedback\nchat",
      "emails": []
    },
    {
      "url": "http://miamidade.gov/global/recreation/contact-parks.page",
      "is_candidate": false,
      "has_email": false,
      "text": "Row 01 - Column 01\nls:begin[component-1553655066004]\nHome\n>\nParks, Recreation and Open Spaces\n>\nContact Parks\nls:end[component-1553655066004]\nls:begin[component-1570807332251]\nHTML\nContact Parks\nShare:\nls:end[component-1570807332251]\nRow 02 - Column 01\nls:begin[component-1599220281508]\nHTML\nMiami-Dade County\nParks, Recreation and Open Spaces\n275 NW 2nd Street\nMiami, Florida 33128\nAdministrative Offices:\n305-755-7800\nBryan M. Eichler\n, MPA, ENV SP\nAsst. Director - PROS Stewardship & Conservation Operations\nDevin M. Meheen\n, PGA, CMAA\nAssistant Director - PROS Stewardship & Destinations\nJoe Cornely\nAssistant Director Planning, Design, and Construction Excellence Division\nls:end[component-1599220281508]\nRow 02 - Column 02\nls:begin[component-1570807332400]\nHTML\nPublic Records Request\nDavid Livingstone\nPublic Records Custodian\nParks, Recreation and Open Spaces\n272 NW 2ND Street\nSuite 555\nMiami, Fl 33128\n[email protected]\n305-755-7824\nMiami-Dade County has a\npublic records management tool\nthat allows you to request and track its status online. Create a new account or log in to submit and see updates to your public records requests.\nls:end[component-1570807332400]\nls:begin[component-1541877939422]\nParks, Recreation and Open Spaces\nChristina White\nDirector\nHickman Building\n275 NW 2nd Street, \r\n\r\n                 Miami, FL  33128\n305-755-7800\nContact Us\n|\nAbout Us\nRequest Public Records\nls:end[component-1541877939422]\nRow 03\nRow 04 - Column 01\nRow 04 - Column 02\nRow 05\nContact Parks\nShare:\nMiami-Dade County\nParks, Recreation and Open Spaces\n275 NW 2nd Street\nMiami, Florida 33128\nAdministrative Offices:\n305-755-7800\nBryan M. Eichler\n, MPA, ENV SP\nAsst. Director - PROS Stewardship & Conservation Operations\nDevin M. Meheen\n, PGA, CMAA\nAssistant Director - PROS Stewardship & Destinations\nJoe Cornely\nAssistant Director Planning, Design, and Construction Excellence Division\nPublic Records Request\nDavid Livingstone\nPublic Records Custodian\nParks, Recreation and Open Spaces\n272 NW 2ND Street\nSuite 555\nMiami, Fl 33128\n[email protected]\n305-755-7824\nMiami-Dade County has a\npublic records management tool\nthat allows you to request and track its status online. Create a new account or log in to submit and see updates to your public records requests.\nMiami-Dade County Facebook - Opens a warning dialog\nMiami-Dade County Instagram - Opens a warning dialog\nMiami-Dade County Youtube - Opens a warning dialog\nMiami-Dade County X - Opens a warning dialog\nFeedback\nchat",
      "emails": []
    },
    {
      "url": "https://www.miamidade.gov/global/311/home.page",
      "is_candidate": false,
      "has_email": false,
      "text": "Welcome to Miami-Dade 311\nThe Miami-Dade County 311 Contact Center offers convenient access to essential County and City of Miami services. Whether you need to report an issue, schedule an appointment with a County Department, or check the progress of a request you've already submitted, 311 is available to assist you.\nSubmit a Service Request\nRow 01 - Column 01\nls:begin[component-1553655066004]\nHome\n>\nCommunications and Customer Experience\n>\n311 Contact Center\nls:end[component-1553655066004]\nls:begin[component-1717410926488]\nHTML\n311 Contact Center\nShare:\nMiami-Dade County's 311 Contact Center serves as a primary channel for accessing non-emergency government services and information in English, Spanish and Haitian Creole. Residents can call 311 to obtain information about local government services, report issues, request services and ask questions.\nls:end[component-1717410926488]\nHTML\nls:begin[component-1736394197025]\nHTML\nThe 311 Service Center located at the North Dade Justice Center is temporarily closed.  The\n311 Service Centers\nlocated at the Herbert S. Saffir Permitting and Inspection Center and South Dade Government Center remain open.  You may also report service concerns\nonline\nor through the 311 App available in the\nApp Store\nand\nAndroid\n.\nls:end[component-1736394197025]\nHTML\nls:begin[component-1717410927938]\nHTML\nWays to Connect\nThe 311 service is available through multiple channels, including phone, online, mobile app, email, social media and in-person visits. It is designed to provide a single point of contact for a variety of Miami-Dade County and City of Miami services, making it easier for residents to connect with their local government. By offering various contact methods and multilingual support, Miami-Dade County aims to enhance community engagement, streamline service delivery and ensure residents have access to the resources they need in the manner they prefer.\nls:end[component-1717410927938]\nRow 02 - Column 01\nls:begin[component-1717410926517]\nHTML\nCall 311\nBy dialing 311 or 305-468-5900 (outside Miami-Dade County), you can receive personalized customer service in English, Spanish or Haitian Creole.\nThe 311 Contact Center is open Monday through Friday from 7 a.m. to 7 p.m. and Saturday from 8 a.m. to 5 p.m., while closed on Sundays and holidays. Individuals with hearing or speech disabilities can connect through Florida Relay by dialing 711.\nls:end[component-1717410926517]\nRow 02 - Column 02\nls:begin[component-1717410926489]\nHTML\n311 Direct Mobile App\nDownload the 311 Direct mobile app to report issues, request services and ask questions on-the-go from your mobile device.\nAvailable on the App Store\nAvailable on Android\nls:end[component-1717410926489]\nRow 03\nls:begin[component-1717410926555]\nHTML\nls:end[component-1717410926555]\nls:begin[component-1717410926516]\nHTML\nReport Online: 311 Direct\nReport neighborhood problems, request services and more to 311 online. You can either remain anonymous or include your contact information for follow-up.\nEmail 311\nEmail\n[email protected]\nwith as much information as possible and 311 will respond with a service request number or provide an answer to your question.\nVisit a 311 Service Center\nVisit one of the three 311 Service Centers in North, South, or West Miami-Dade County, and a 311 specialist will provide in-person assistance.\nls:end[component-1717410926516]\nls:begin[component-1717410926533]\nHTML\nEngage on Social Media\nFollow the 311 Contact Center on Facebook and X (formerly known as Twitter) to stay connected. Reach out and ask questions, address concerns and provide feedback through your preferred social media network. Additionally, visit 311's official YouTube playlist to explore a wide range of informational videos that inform, engage and empower our community by providing valuable information, resources and insights about non-emergency government services.\nFacebook\nJoin the 311 Facebook community to stay connected with Miami-Dade County.\nX (formerly Twitter)\nJoin the conversation on X, formerly known as Twitter, to engage via social media.\nYouTube\nWatch informative videos featured on 311's official YouTube playlist.\nls:end[component-1717410926533]\nRow 04 - Column 01\nls:begin[component-1717410926506]\nHTML\nFrequently Asked Questions\nResidents can call 311 to report issues such as potholes, overgrown medians and missed garbage service. 311 also accepts and processes service requests for Miami-Dade County and the City of Miami such as bulky waste pickup, mosquito inspections and illegal dumping.\nHow else can 311 be reached by phone?\nThe 311 Center can also be reached by dialing 305-468-5900.\nIndividuals with a hearing or speech disability can call Florida Relay at 711\nSome cable companies such as U-verse and Comcast have not activated direct dialing to 311\nSome mobile phone carriers do not recognize 311\nWhat kind of information does 311 provide?\nAnything you want to know about local government services. A few examples include:\nWho is my County Commissioner?\nWhere is the closest bus stop near my house?\nWhat items can I place in a bulky trash pile?\nWhere can I get a Transit Easy Card?\nWhere is the nearest Trash and Recycling Center and when is it open?\nWhen is the next election?\nHow do I get Homestead Exemption?\nWhat type of services can the public get through 311?\nExamples of service requests include:\nReplace a damaged garbage or recycling cart\nRequest an inspection for mosquito breeding at your property\nAsk for a pothole to be repaired\nTrip planning services from Miami-Dade Transit\nReport a neighborhood code violation such as overgrown lots or junk and trash piles\nReport an issue with a traffic sign or traffic signal\nls:end[component-1717410926506]\nRow 04 - Column 02\nls:begin[component-1717410926537]\nCommunications and Customer Experience\nInson Kim\nDirector\nStephen P. Clark Center\n111 NW 1st Street, \r\n\r\n                 Miami, FL  33128\n305-375-5527\nContact Us\nRequest Public Records\nls:end[component-1717410926537]\nRow 05\n311 Contact Center\nShare:\nMiami-Dade County's 311 Contact Center serves as a primary channel for accessing non-emergency government services and information in English, Spanish and Haitian Creole. Residents can call 311 to obtain information about local government services, report issues, request services and ask questions.\nThe 311 Service Center located at the North Dade Justice Center is temporarily closed.  The\n311 Service Centers\nlocated at the Herbert S. Saffir Permitting and Inspection Center and South Dade Government Center remain open.  You may also report service concerns\nonline\nor through the 311 App available in the\nApp Store\nand\nAndroid\n.\nWays to Connect\nThe 311 service is available through multiple channels, including phone, online, mobile app, email, social media and in-person visits. It is designed to provide a single point of contact for a variety of Miami-Dade County and City of Miami services, making it easier for residents to connect with their local government. By offering various contact methods and multilingual support, Miami-Dade County aims to enhance community engagement, streamline service delivery and ensure residents have access to the resources they need in the manner they prefer.\nCall 311\nBy dialing 311 or 305-468-5900 (outside Miami-Dade County), you can receive personalized customer service in English, Spanish or Haitian Creole.\nThe 311 Contact Center is open Monday through Friday from 7 a.m. to 7 p.m. and Saturday from 8 a.m. to 5 p.m., while closed on Sundays and holidays. Individuals with hearing or speech disabilities can connect through Florida Relay by dialing 711.\n311 Direct Mobile App\nDownload the 311 Direct mobile app to report issues, request services and ask questions on-the-go from your mobile device.\nAvailable on the App Store\nAvailable on Android\nReport Online: 311 Direct\nReport neighborhood problems, request services and more to 311 online. You can either remain anonymous or include your contact information for follow-up.\nEmail 311\nEmail\n[email protected]\nwith as much information as possible and 311 will respond with a service request number or provide an answer to your question.\nVisit a 311 Service Center\nVisit one of the three 311 Service Centers in North, South, or West Miami-Dade County, and a 311 specialist will provide in-person assistance.\nEngage on Social Media\nFollow the 311 Contact Center on Facebook and X (formerly known as Twitter) to stay connected. Reach out and ask questions, address concerns and provide feedback through your preferred social media network. Additionally, visit 311's official YouTube playlist to explore a wide range of informational videos that inform, engage and empower our community by providing valuable information, resources and insights about non-emergency government services.\nFacebook\nJoin the 311 Facebook community to stay connected with Miami-Dade County.\nX (formerly Twitter)\nJoin the conversation on X, formerly known as Twitter, to engage via social media.\nYouTube\nWatch informative videos featured on 311's official YouTube playlist.\nFrequently Asked Questions\nResidents can call 311 to report issues such as potholes, overgrown medians and missed garbage service. 311 also accepts and processes service requests for Miami-Dade County and the City of Miami such as bulky waste pickup, mosquito inspections and illegal dumping.\nHow else can 311 be reached by phone?\nThe 311 Center can also be reached by dialing 305-468-5900.\nIndividuals with a hearing or speech disability can call Florida Relay at 711\nSome cable companies such as U-verse and Comcast have not activated direct dialing to 311\nSome mobile phone carriers do not recognize 311\nWhat kind of information does 311 provide?\nAnything you want to know about local government services. A few examples include:\nWho is my County Commissioner?\nWhere is the closest bus stop near my house?\nWhat items can I place in a bulky trash pile?\nWhere can I get a Transit Easy Card?\nWhere is the nearest Trash and Recycling Center and when is it open?\nWhen is the next election?\nHow do I get Homestead Exemption?\nWhat type of services can the public get through 311?\nExamples of service requests include:\nReplace a damaged garbage or recycling cart\nRequest an inspection for mosquito breeding at your property\nAsk for a pothole to be repaired\nTrip planning services from Miami-Dade Transit\nReport a neighborhood code violation such as overgrown lots or junk and trash piles\nReport an issue with a traffic sign or traffic signal\nMiami-Dade County Facebook - Opens a warning dialog\nMiami-Dade County Instagram - Opens a warning dialog\nMiami-Dade County Youtube - Opens a warning dialog\nMiami-Dade County X - Opens a warning dialog\nFeedback\nchat",
      "emails": []
    },
    {
      "url": "https://www.miamidade.gov/global/navigation/service-index.page",
      "is_candidate": false,
      "has_email": false,
      "text": "Row 01 - Column 01\nls:begin[component-1553655066004]\nHome\n>\nServices & Information\nls:end[component-1553655066004]\nls:begin[component-1650302293978]\nHTML\nServices & Information\nShare:\nls:end[component-1650302293978]\nRow 02 - Column 01\nls:begin[component-1646063340809]\nHTML\nRow 02 - Column 02\nls:begin[component-1687452113862]\nHTML\nOnline Services\nBulky Waste Pickup\nCounty Jobs\nInmate Search\nMotor Vehicle Registration\nPay Taxes\nProperty Search\nTransit Pass\nWater Bill\nView Online Services\nls:end[component-1687452113862]\nRow 03\nRow 04 - Column 01\nRow 04 - Column 02\nRow 05\nServices & Information\nShare:\nOnline Services\nBulky Waste Pickup\nCounty Jobs\nInmate Search\nMotor Vehicle Registration\nPay Taxes\nProperty Search\nTransit Pass\nWater Bill\nView Online Services\nMiami-Dade County Facebook - Opens a warning dialog\nMiami-Dade County Instagram - Opens a warning dialog\nMiami-Dade County Youtube - Opens a warning dialog\nMiami-Dade County X - Opens a warning dialog\nFeedback\nchat",
      "emails": []
    },
    {
      "url": "http://miamidade.gov/global/calendar/global.page",
      "is_candidate": false,
      "has_email": false,
      "text": "Row 01 - Column 01\nls:begin[component-1563896274063]\nHome\n>\nNews & Social Media\n>\nMeetings & Events\nls:end[component-1563896274063]\nls:begin[component-1561908444592]\nHTML\nCounty Calendar\nShare:\nls:end[component-1561908444592]\nls:begin[component-1654215017139]\nHTML\nls:end[component-1654215017139]\nRow 02 - Column 01\nRow 02 - Column 02\nRow 03\nRow 04 - Column 01\nRow 04 - Column 02\nRow 05\nCounty Calendar\nShare:\nMiami-Dade County Facebook - Opens a warning dialog\nMiami-Dade County Instagram - Opens a warning dialog\nMiami-Dade County Youtube - Opens a warning dialog\nMiami-Dade County X - Opens a warning dialog\nFeedback\nchat",
      "emails": []
    }
  ],
  "all_links": [
    "http://miamidade.gov/myemployee/home.page",
    "https://www.miamidade.gov/global/service.page?Mduid_service=ser154084154373792",
    "http://miamidade.gov/global/service.page?Mduid_service=ser1531245203713389",
    "http://miamidade.gov/global/water/my-account.page",
    "https://www.miamidade.gov/govaction/home.asp",
    "http://miamidade.gov/global/navigation/agency-directory-departments.page",
    "https://www.miamidade.gov/global/service.page?Mduid_service=ser1471983592974680",
    "http://miamidade.gov/global/government/mayor/home.page",
    "http://miamidade.gov/global/recreation/cooperative-extension.page",
    "http://miamidade.gov/global/recreation/ludlam-trail/home.page",
    "http://miamidade.gov/global/service.page?Mduid_service=ser1495050709633152",
    "https://www.miamidade.gov/global/service.page?Mduid_service=ser1539115164198414",
    "http://miamidade.gov/global/navigation/agency-directory-offices.page",
    "https://www.miamidade.gov/global/service.page?Mduid_service=ser14716214303986",
    "https://www.miamidade.gov/global/rss-news.page",
    "http://miamidade.gov/global/navigation/service-index.page?INTERESTCATEGORY=recreation-culture",
    "http://miamidade.gov/global/navigation/service-index.page?INTERESTCATEGORY=housing-social-services",
    "http://miamidade.gov/global/transportation/transit-pass.page",
    "http://miamidade.gov/global/government/boards/community-image-advisory-board.page",
    "https://www.miamidade.gov/global/recreation/cooperative-extension.page",
    "http://miamidade.gov/global/recreation/ecoadventures/home.page",
    "http://miamidade.gov/global/publicrecords/search.page",
    "http://miamidade.gov/global/home.page",
    "http://miamidade.gov/global/311/home.page",
    "https://www.miamidade.gov/global/home.page",
    "http://miamidade.gov/global/navigation/service-index.page",
    "http://miamidade.gov/global/service.page?Mduid_service=ser1464878994935803",
    "https://www.miamidade.gov/global/service.page?Mduid_service=ser1495050709633152",
    "http://miamidade.gov/global/service.page?Mduid_service=ser1540308012341709",
    "http://miamidade.gov/global/humanresources/jobs/home.page",
    "http://miamidade.gov/global/service.page?Mduid_service=ser1501010041747308",
    "https://www.miamidade.gov/global/recreation/family-fun.page",
    "http://miamidade.gov/global/navigation/constitutional-offices.page",
    "http://miamidade.gov/global/navigation/online-services.page",
    "http://miamidade.gov/global/navigation/service-index.page?INTERESTCATEGORY=jobs-employment",
    "https://www.miamidade.gov/Apps/PA/PropertySearch/#/",
    "https://www.miamidade.gov/global/disclaimer/ada-notice.page",
    "http://miamidade.gov/global/navigation/service-index.page?INTERESTCATEGORY=elections-voting",
    "http://miamidade.gov/global/humanresources/benefits/home.page",
    "https://www.miamidade.gov/global/government/transparency/home.page",
    "https://www.miamidade.gov/global/disclaimer/about-miami-dade-county.page",
    "http://miamidade.gov/global/service.page?Mduid_service=ser1495124677094485",
    "http://miamidade.gov/cdn-cgi/l/email-protection#1e59776d7b72304e6c7f7a715e73777f73777a7f7a7b30797168",
    "http://miamidade.gov/global/humanresources/training/home.page",
    "http://miamidade.gov/global/recreation/park-directory.page",
    "http://miamidade.gov/global/navigation/agency-directory-trusts.page",
    "https://www.miamidade.gov/global/service.page?Mduid_service=ser1471553938267408",
    "https://www.miamidade.gov/parksmasterplan/library/OSMP_FINAL_REPORT_entiredocument.pdf",
    "https://www.miamidade.gov/global/calendar/global.page",
    "http://miamidade.gov/global/mobile-applications.page",
    "http://miamidade.gov/global/recreation/parksmasterplan/home.page",
    "http://miamidade.gov/global/webcasting/virtual-meeting.page",
    "http://miamidade.gov/global/service.page?Mduid_service=ser1525897456437343",
    "http://miamidade.gov/global/navigation/service-index.page?INTERESTCATEGORY=courts-records",
    "http://miamidade.gov/global/service.page?Mduid_service=ser1539979868346153",
    "http://miamidade.gov/global/rss-news.page",
    "https://www.miamidade.gov/global/service.page?Mduid_service=ser1470943010772421",
    "http://miamidade.gov/global/navigation/agency-directory-elected.page",
    "https://www.miamidade.gov/global/service.page?Mduid_service=ser1539102476686691",
    "https://www.miamidade.gov/global/service.page?Mduid_service=ser1495115031663185",
    "http://miamidade.gov/global/service.page?Mduid_service=ser1540327239557614",
    "http://miamidade.gov/global/news-item.page?Mduid_news=news1525121846527557",
    "http://miamidade.gov/global/humanresources/fair-employment/home.page",
    "http://miamidade.gov/global/navigation/service-index.page?INTERESTCATEGORY=home-property",
    "http://miamidade.gov/global/humanresources/labor-relations/home.page",
    "http://miamidade.gov/global/management/budget/home.page",
    "http://miamidade.gov/global/navigation/prindex.page",
    "http://miamidade.gov/global/recreation/about-parks.page",
    "http://miamidade.gov/global/navigation/prindex.page?ORGANIZATION=org1462997233134731",
    "http://miamidade.gov/global/navigation/service-index.page?INTERESTCATEGORY=public-safety",
    "http://miamidade.gov/global/calendar/parks.page",
    "https://www.miamidade.gov/311direct/#/form/c08/PRKFCSVC",
    "https://www.miamidade.gov/global/government/commission/home.page",
    "https://www.miamidade.gov/global/recreation/just-for-kids.page",
    "http://miamidade.gov/employee/discounts.page",
    "http://miamidade.gov/global/navigation/service-index.page?INTERESTCATEGORY=travel-transportation",
    "https://www.miamidade.gov/global/publicrecords/search.page",
    "https://www.miamidade.gov/global/webcasting/home.page",
    "http://miamidade.gov/employee/pay-compensation.page",
    "http://miamidade.gov/global/recreation/marine-conservation-program.page",
    "https://www.miamidade.gov/global/service.page?Mduid_service=ser1531245203713389",
    "https://www.miamidade.gov/global/mobile-applications.page",
    "https://www.miamidade.gov/global/service.page?Mduid_service=ser1540829216925585",
    "http://miamidade.gov/global/login.page",
    "http://miamidade.gov/global/navigation/agency-directory-boards.page",
    "http://miamidade.gov/global/recreation/zoom-backgrounds.page",
    "https://www.miamidade.gov/global/navigation/legal-ad-index.page",
    "http://miamidade.gov/global/social-media.page",
    "http://miamidade.gov/global/webcasting/home.page",
    "https://www.miamidade.gov/global/social-media.page",
    "http://miamidade.gov/global/service.page?Mduid_service=ser148069212998189",
    "http://miamidade.gov/global/recreation/rules-regulations.page",
    "http://miamidade.gov/global/navigation/service-index.page?INTERESTCATEGORY=environment-resilience",
    "https://www.miamidade.gov/global/service.page?Mduid_service=ser1531255192150175",
    "https://www.miamidade.gov/global/navigation/service-index.page?ORGANIZATION=org1462997233134731",
    "https://www.miamidade.gov/global/disclaimer/disclaimer.page",
    "http://miamidade.gov/global/navigation/service-index.page?INTERESTCATEGORY=animals-pets",
    "http://miamidade.gov/global/recreation/home.page",
    "http://miamidade.gov/global/service.page?Mduid_service=ser1539114258088854",
    "http://miamidade.gov/global/navigation/service-index.page?INTERESTCATEGORY=business-industry",
    "http://miamidade.gov/global/navigation/news-index.page",
    "http://miamidade.gov/global/service.page?Mduid_service=ser1539959088340547",
    "https://www.miamidade.gov/global/disclaimer/privacy-and-security.page",
    "http://miamidade.gov/global/recreation/west-matheson/home.page",
    "http://miamidade.gov/global/recreation/state-legislators.page",
    "https://www.miamidade.gov/global/calendar/parks.page",
    "https://www.miamidade.gov/global/government/committees/citizens-advisory-committee.page",
    "http://miamidade.gov/global/government/biographies/parks-recreation-open-spaces.page",
    "http://miamidade.gov/global/navigation/agency-directory.page",
    "http://miamidade.gov/global/taxcollector/home.page",
    "http://miamidade.gov/global/navigation/audit-index.page",
    "http://miamidade.gov/global/recreation/contact-parks.page",
    "http://miamidade.gov/global/government/transparency/home.page",
    "https://www.miamidade.gov/global/service.page?Mduid_service=ser1487079040880248",
    "https://www.miamidade.gov/global/311/home.page",
    "http://miamidade.gov/global/navigation/service-index.page?INTERESTCATEGORY=building-development",
    "http://miamidade.gov/global/service.page?Mduid_service=ser1491494549439906",
    "https://www.miamidade.gov/global/navigation/service-index.page",
    "http://miamidade.gov/global/calendar/global.page",
    "http://miamidade.gov/global/navigation/legal-ad-index.page"
  ],
  "candidate_links": [
    "http://miamidade.gov/global/government/boards/community-image-advisory-board.page",
    "http://miamidade.gov/global/service.page?Mduid_service=ser1540308012341709",
    "https://www.miamidade.gov/global/disclaimer/about-miami-dade-county.page",
    "http://miamidade.gov/global/recreation/park-directory.page",
    "http://miamidade.gov/global/service.page?Mduid_service=ser1540327239557614",
    "http://miamidade.gov/global/recreation/about-parks.page",
    "http://miamidade.gov/global/calendar/parks.page",
    "https://www.miamidade.gov/global/government/commission/home.page",
    "http://miamidade.gov/global/navigation/agency-directory-boards.page",
    "https://www.miamidade.gov/global/social-media.page",
    "https://www.miamidade.gov/global/calendar/parks.page",
    "http://miamidade.gov/global/recreation/contact-parks.page",
    "https://www.miamidade.gov/global/311/home.page",
    "https://www.miamidade.gov/global/navigation/service-index.page",
    "http://miamidade.gov/global/calendar/global.page"
  ],
  "visited": [
    "http://miamidade.gov/parks",
    "http://miamidade.gov/about",
    "http://miamidade.gov/contact",
    "http://miamidade.gov/staff",
    "http://miamidade.gov/team",
    "http://miamidade.gov/board",
    "http://miamidade.gov/directory",
    "http://miamidade.gov/events",
    "http://miamidade.gov/sitemap.xml",
    "http://miamidade.gov/council",
    "http://miamidade.gov/leadership",
    "http://miamidade.gov/management",
    "http://miamidade.gov/producers",
    "http://miamidade.gov/support",
    "http://miamidade.gov/crew",
    "http://miamidade.gov/members",
    "http://miamidade.gov/bios",
    "http://miamidade.gov/people",
    "http://miamidade.gov/artists",
    "http://miamidade.gov/musicians",
    "http://miamidade.gov/faculty",
    "http://miamidade.gov/administration",
    "http://miamidade.gov/global/government/boards/community-image-advisory-board.page",
    "http://miamidade.gov/global/service.page?Mduid_service=ser1540308012341709",
    "https://www.miamidade.gov/global/disclaimer/about-miami-dade-county.page",
    "http://miamidade.gov/global/recreation/park-directory.page",
    "http://miamidade.gov/global/service.page?Mduid_service=ser1540327239557614",
    "http://miamidade.gov/global/recreation/about-parks.page",
    "http://miamidade.gov/global/calendar/parks.page",
    "https://www.miamidade.gov/global/government/commission/home.page",
    "http://miamidade.gov/global/navigation/agency-directory-boards.page",
    "https://www.miamidade.gov/global/social-media.page",
    "https://www.miamidade.gov/global/calendar/parks.page",
    "http://miamidade.gov/global/recreation/contact-parks.page",
    "https://www.miamidade.gov/global/311/home.page",
    "https://www.miamidade.gov/global/navigation/service-index.page",
    "http://miamidade.gov/global/calendar/global.page"
  ],
  "base_url": "http://miamidade.gov/parks"
}