{
  "pages": [
    {
      "url": "https://mikerisogolf.com/about/",
      "is_candidate": false,
      "has_email": true,
      "text": "About\nMike started\nteaching golf professionally\nover 38 years ago. Time has revealed some basic truths that are reflected in his approach to teaching golf lessons.\nMuch of today’s instruction is centered around trying to get students to swing like the tour pros swing. But the average golfer doesn’t have the physical build, world class teachers, a trainer, a mental coach, or the time to hit thousands of practice balls each week.\nHis teaching focuses on communicating core fundamentals, as simply and clearly as possible. Information is shared in ways that’s easily understood and applied, by students of all skill levels.\nMike Riso Golf\nstarted in 2003, and offers golfers a combination of services making golf easier and more enjoyable. Our webpage mikerisogolf.com, is a reliable source of golf swing and short game instruction, and golf club education. The business golf coaching programs were developed for working professionals who want to create deeper levels of networking and client relationships.\nOur main goal:\nto help golfers find fundamentally sound guidance for their golf games, and help those in the business world use the game of golf to increase their presence in the marketplace.\nThe name\nRelax and Golf\nwas the brainchild of my wife, Nance. She envisioned combining the best parts of Mike Riso Golf with simple yoga postures to help students become more flexible, and at the same time reduce tension many golfers experience on the course, and in their everyday lives.\nThrough the use of videos, golf tips, golf-specific stretches, guidance on clubs, and simple yoga postures, the ‘Relax and Golf Club’ offers clients a membership that helps them excel both on the course and in their daily lives.\nSwing in Time Golf Shop\nstarted in Williamsville, New York in 1989. It was run by brothers Mike and Frank Riso. The shop specialized in professional golf instruction, and made-to-order golf clubs. Its décor reflected nostalgic shops of the 1920’s and 30’s, and gave the shop its distinct feel.\nSwing In Time was truly about old fashioned service. Considered a specialty golf shop, it was decorated with antiuqe golf memorabilia,\ngiving it a unique ambiance.",
      "emails": [
        "mike@mikeriso.com"
      ]
    },
    {
      "url": "https://mikerisogolf.com/contact/",
      "is_candidate": false,
      "has_email": true,
      "text": "Contact\nMichael Riso, B.S.\nGolf Teaching Professional, PGA Associate\nPeak Performance Coach\nEFT Advanced Practitioner\nTeaching at: Clearwater Country Club and Largo Golf Course.\nPhone:  727-776-8380\nEmail:\nmike@mikeriso.com\nOr fill out the contact form below.",
      "emails": [
        "mike@mikeriso.com"
      ]
    },
    {
      "url": "https://mikerisogolf.com/about/about-mike/golf-professional-instructor/",
      "is_candidate": false,
      "has_email": true,
      "text": "About Golf Teaching Professional Mike Riso\nMike started teaching golf professionally over 38 years ago. Three decades of teaching has revealed powerful, yet simple principles to help golf students of all skill levels. These principles are equally valuable whether you’re a beginner or a seasoned player.\nMike focuses on these core fundamentals, teaching them simply and clearly, and helping each student quickly reach their potential.\nIf you’re facing challenges putting, that’s where we’ll begin. If you’re struggling with chipping, we’ll hone in on creating consistency around the greens. If a loss of distance is a problem, we’ll find the flaw and correct it.\nIt doesn’t matter which areas are weak, the answers are close at hand, and are applied during your first lesson. Improvement is immediate, and with some practice these changes become permanent!\nMike at age 20.\nFlexibility comes more easily when we’re younger, and as we age it becomes even more important in creating distance. Although more flexible at age 20, by doing a series of golf stretches and yoga, at age 58 I’m nearly as flexible as when I was in college. With a little practice you can gain more flexibility too!\nMike at age 58.\nBy staying flexible as we age, we’re better able to maintain the coordination needed to make solid contact, increase our clubhead speed to add distance, and create a balanced finish. By using a series of golf specific stretches, anyone can regain their flexibility!\nMike Riso\nAmong his many other qualifications, Mike Riso is a PGA Coach, and you can\nsee his profile on the PGA website\nby clicking\nHERE\n.",
      "emails": [
        "mike@mikeriso.com"
      ]
    }
  ],
  "all_links": [
    "https://mikerisogolf.com/golf-instruction/articles/are-correctly-fitting-clubs-more-important-than-swing/",
    "https://mikerisogolf.com/about/about-mike/swing-in-time-golf-shop/",
    "https://mikerisogolf.com/privacy-policy/",
    "https://mikerisogolf.com/about/",
    "https://mikerisogolf.com/about/about-mike/mike-riso-golf/",
    "https://mikerisogolf.com/about/about-mike/relax-and-golf/",
    "https://mikerisogolf.com/contact/",
    "https://mikerisogolf.com/simple-golf-instruction/",
    "https://mikerisogolf.com/about/about-mike/golf-professional-instructor/",
    "https://mikerisogolf.com/about/about-mike/what-students-are-saying/",
    "https://mikerisogolf.com/antique-golf-clubs-for-sale-2/",
    "https://mikerisogolf.com/golf-lessons-clearwater/",
    "https://mikerisogolf.com/golf-instruction/articles/",
    "https://mikerisogolf.com/",
    "https://mikerisogolf.com/golf-instruction/",
    "https://mikerisogolf.com/golf-instruction/articles/is-swing-more-important-than-correctly-fitting-clubs/"
  ],
  "candidate_links": [
    "https://mikerisogolf.com/about/",
    "https://mikerisogolf.com/contact/",
    "https://mikerisogolf.com/about/about-mike/golf-professional-instructor/"
  ],
  "visited": [
    "https://mikerisogolf.com/",
    "https://mikerisogolf.com/about",
    "https://mikerisogolf.com/contact",
    "https://mikerisogolf.com/staff",
    "https://mikerisogolf.com/team",
    "https://mikerisogolf.com/board",
    "https://mikerisogolf.com/directory",
    "https://mikerisogolf.com/events",
    "https://mikerisogolf.com/sitemap.xml",
    "https://mikerisogolf.com/council",
    "https://mikerisogolf.com/leadership",
    "https://mikerisogolf.com/management",
    "https://mikerisogolf.com/producers",
    "https://mikerisogolf.com/support",
    "https://mikerisogolf.com/crew",
    "https://mikerisogolf.com/members",
    "https://mikerisogolf.com/bios",
    "https://mikerisogolf.com/people",
    "https://mikerisogolf.com/artists",
    "https://mikerisogolf.com/musicians",
    "https://mikerisogolf.com/faculty",
    "https://mikerisogolf.com/administration",
    "https://mikerisogolf.com/about/",
    "https://mikerisogolf.com/contact/",
    "https://mikerisogolf.com/about/about-mike/golf-professional-instructor/"
  ],
  "base_url": "https://mikerisogolf.com/"
}