{
  "pages": [
    {
      "url": "https://millersjumptime.com/contact_us/",
      "is_candidate": false,
      "has_email": true,
      "text": "Contact Us\n3943 Cedar Hammock Trail, St Cloud, FL, USA\nMillersjumptime@gmail.com\n(407)-908-9169\nSend Message",
      "emails": [
        "millersjumptime@gmail.com",
        "preact@10.5.13.compat.module.min.js",
        "preact@10.5.13.devtools.module.js",
        "preact@10.5.13.hooks.module.js",
        "preact@10.5.13.module.js"
      ]
    },
    {
      "url": "https://millersjumptime.com/about_us/",
      "is_candidate": false,
      "has_email": true,
      "text": "Family and Veteran Owned Business\nCollapsable\nThe Millers\nWelcome to the Miller Family! My name is Blake Miller, and I am the owner of Millers Jump Time Entertainment! My wife, Sarah and our three lovely children, Bryden, Mia, and little Noah are so fortunate enough to meet you. Yes, these little ones will most likely want to come and help their daddy and mommy set up your equipment! Don't worry when we get there, they usually just beg Sarah and I to go on the inflatable we are setting up. They can't get enough of the joy these inflatables bring and we are thrilled to have the opportunity to do this full time. A little back story about us, we actually come from everywhere, haha. Yes, we moved a lot due to me serving as a United States Marine and that brought great memories. After leaving the Marine Corps, Sarah and I adventured back to our hometown New Orleans, LA. Sarah working as a full-time mom, still had the time to become one of the top Dental assistant in the lower part of Louisiana. As for myself, I ventured out to become a sheriff's deputy for our hometown. After feeling like we were not in the place we wanted to be. Sarah and I decided to move to the great state of Florida and become the first business owner in our family! Now as you can see, we have been fortunate enough to become one of the top-rated party rental companies who's goals are to provide the biggest and best equipment for your party. As a young and growing family, we have wanted to run a company who you as a customer can count on. If its providing only tables and chairs, to providing a huge order from Inflatables, concessions, music, catering, event designing, and decor. We got you covered! When my wife and I began the process of building this company, we took a step back into realizing what you as a customer expect from a top-rated company. If i could picture your idea and make it happened, with no stresses and hassle free booking. Then you figured its a no-brainer, right! Well that's we thought in our decision making. Lets pick the high-quality equipment that cost more to buy and looks better for our customers. For our company we understand prices may be high during times, but we promised to deliver never used, cheap, or dirty equipment. We hand picked the top inflatables, with commerical graded certified concessions and party equipment. So take a chance on what could be the start of your only party rental company you need in your contacts. Thank you and see you at your next event!\nRead More\nWater Slides\nLooking for an exciting way to beat the heat and add some fun to your next event? Look no further than our water slide rentals! We offer a wide range of water slides that are perfect for birthday parties, corporate events, school functions, and more.\nOur water slides are not only safe and reliable but also designed to provide hours of entertainment for both kids and adults. With various sizes and themes available, you can choose the perfect water slide to suit your event's needs and preferences.\nOur team takes pride in delivering exceptional customer service and ensuring that your water slide rental experience is hassle-free. We handle everything from delivery to setup, so you can focus on enjoying your event without any worries.\nSafety is our top priority, which is why all of our water slides are regularly inspected and maintained to meet the highest industry standards. Our trained staff will also provide you with all the necessary safety instructions to ensure a fun and secure experience for everyone.\nIn addition to water slides, we also offer other party rental equipment such as bounce houses, obstacle courses, and concession stands. You can create the ultimate party package by combining different rentals to suit your specific needs.\nDon't let the summer heat ruin your event. Contact us today to book one of our exciting water slide rentals and make a splash at your next gathering.\nBounce Houses\nLooking for an exciting addition to your next event or party? Look no further than bounce house rentals! Bounce houses, also known as inflatable castles or moonwalks, are a fantastic way to keep children entertained and active for hours.\nAt Millers Jump Time, we offer a wide range of bounce house rentals to suit any event or theme. Our collection includes everything from traditional bounce houses with colorful designs to themed bounce houses featuring popular characters or movie themes. Whether you're hosting a birthday party, school carnival, corporate event, or any other gathering, our bounce houses are sure to be a hit with kids of all ages.\nSafety is our top priority, which is why all of our bounce houses are made from high-quality, durable materials that meet industry safety standards. Our units are regularly inspected and cleaned to ensure they are in excellent condition for every rental. Additionally, we provide safety instructions and guidelines to ensure a worry-free experience for both parents and children.\nRenting a bounce house from us is a breeze. Our friendly and knowledgeable staff will guide you through the rental process, helping you choose the perfect bounce house for your event. We offer flexible rental periods to accommodate your schedule, whether you need the bounce house for a few hours or an entire day.\nTo make your event even more memorable, we also offer additional party rental options such as inflatable slides, obstacle courses, and interactive games. These add-ons can be combined with our bounce houses to create the ultimate entertainment experience for your guests.\nDon't let your next event be ordinary - make it extraordinary with bounce house rentals from Millers Jump Time. Contact us today to book your rental and ensure a day of fun, laughter, and unforgettable memories!\nBackyard Tents\nWelcome to our backyard tent rentals service! We understand the importance of creating memorable outdoor events, and our goal is to provide you with the perfect tent for your backyard gathering. Whether you're hosting a birthday party, wedding reception, or corporate event, our wide range of tent options will ensure that your guests are comfortable and protected from the elements.\nHere are some reasons why you should choose our backyard tent rentals:\n1. Variety of tent sizes: We offer tents in various sizes to accommodate any number of guests. From small intimate gatherings to large parties, we have the perfect tent to suit your needs.\n2. High-quality materials: Our tents are made from durable and weather-resistant materials, ensuring that they can withstand any outdoor conditions. You can enjoy your event without worrying about unexpected weather changes.\n3. Professional installation: Our team of experienced professionals will handle the installation and setup of the tent, ensuring that it is securely and safely installed in your backyard. We take care of all the details, so you can focus on enjoying your event.\n4. Customization options: We understand that every event is unique, which is why we offer customization options for our tents. From lighting and flooring to decor and accessories, we can help you create a personalized and unforgettable atmosphere.\n5. Affordable prices: We believe that hosting a memorable event shouldn't break the bank. Our backyard tent rentals are competitively priced, allowing you to stay within your budget without compromising on quality.\n6. Excellent customer service: Our dedicated team is always available to answer any questions and provide assistance throughout the rental process. We are committed to ensuring your satisfaction and making your event a success.\nDon't let limited indoor space hold you back from hosting the event of your dreams. With our backyard tent rentals, you can create a beautiful and comfortable outdoor setting that will leave a lasting impression on your guests. Contact us today to discuss your requirements and reserve the perfect tent for your backyard gathering.",
      "emails": [
        "preact@10.5.13.compat.module.min.js",
        "preact@10.5.13.devtools.module.js",
        "preact@10.5.13.hooks.module.js",
        "preact@10.5.13.module.js"
      ]
    }
  ],
  "all_links": [
    "https://millersjumptime.com/category/tent-rentals/",
    "https://millersjumptime.com/order-by-date/?show_instructions=1",
    "https://millersjumptime.com/school-events/",
    "https://millersjumptime.com/photo_gallery/",
    "https://millersjumptime.com/service_area/",
    "https://www.millersjumptime.com/all_products/",
    "https://millersjumptime.com/all_products/",
    "https://millersjumptime.com/testimonials/",
    "https://millersjumptime.com/category/water-slide-rentals/",
    "https://millersjumptime.com/",
    "https://millersjumptime.com/items/22ft-game-changer-waterslide-rental/",
    "https://millersjumptime.com/category/water_slide_rentals/",
    "https://millersjumptime.com/cart/",
    "https://www.millersjumptime.com/order-by-date/?show_instructions=1",
    "https://millersjumptime.com/privacy_policy/",
    "https://millersjumptime.com/category/table-and-chair-rentals/",
    "https://millersjumptime.com/frequently_asked_questions/",
    "https://www.millersjumptime.com/category/party_packages/",
    "https://millersjumptime.com/contact_us/",
    "https://www.millersjumptime.com/category/bounce_house_rentals/",
    "https://millersjumptime.com/about_us/",
    "https://millersjumptime.com/category/",
    "https://millersjumptime.com/raincheck_policy/",
    "https://www.millersjumptime.com/category/water_slide_rentals/"
  ],
  "candidate_links": [
    "https://millersjumptime.com/contact_us/",
    "https://millersjumptime.com/about_us/"
  ],
  "visited": [
    "https://millersjumptime.com/",
    "https://millersjumptime.com/about",
    "https://millersjumptime.com/contact",
    "https://millersjumptime.com/staff",
    "https://millersjumptime.com/team",
    "https://millersjumptime.com/board",
    "https://millersjumptime.com/directory",
    "https://millersjumptime.com/events",
    "https://millersjumptime.com/sitemap.xml",
    "https://millersjumptime.com/council",
    "https://millersjumptime.com/leadership",
    "https://millersjumptime.com/management",
    "https://millersjumptime.com/producers",
    "https://millersjumptime.com/support",
    "https://millersjumptime.com/crew",
    "https://millersjumptime.com/members",
    "https://millersjumptime.com/bios",
    "https://millersjumptime.com/people",
    "https://millersjumptime.com/artists",
    "https://millersjumptime.com/musicians",
    "https://millersjumptime.com/faculty",
    "https://millersjumptime.com/administration",
    "https://millersjumptime.com/contact_us/",
    "https://millersjumptime.com/about_us/"
  ],
  "base_url": "https://millersjumptime.com/"
}