{
  "pages": [
    {
      "url": "http://www.moas.org/rentals/private-and-corporate-events/index",
      "is_candidate": false,
      "has_email": true,
      "text": "Private & Corporate Rentals\nWelcome to our corporate event venues! Whether you're hosting a meeting, conference, or special event, the Museum of Arts & Sciences and the Cici and Hyatt Brown Museum of Art offer stunning settings that will impress your guests. From our unique Train Station to our architecturally stunning Main Event Space, our venues are sure to leave a lasting impression.\nPerfect venue for:\nCorporate & Non-Profit Events\n• Cocktail Receptions • Seated Dinners • Meetings and Retreats • Holiday Parties • Lectures and Conference • Film Screenings • Expos\nSocial Events\n• Birthday Parties • Anniversary Parties • Bridal or Baby Shower • Engagement Photos\nImage Credit: From the left, second image - Debra Eby Photography\nPlease note that all tours of rental spaces must be booked in advance to ensure that a representative from the Events Department is onsite to assist your needs. Please contact\nrentals@moas.org\nto schedule your tour today\nContact our Rentals Department\nTake a Virtual Tour of the Cici and Hyatt Brown Museum of Art\nCici and Hyatt Brown Museum of Art\nCici and Hyatt Brown Museum of Art\nThe Florida Room\nClick to View More Photos of the Florida Room\nLocated as you enter the Cici and Hyatt Brown Museum of Art at MOAS, the Main Event Space offers tall ceilings and an architecturally stunning design that is guaranteed to make any event a unique and sophisticated experience.\nIdeal for: Receptions, cocktail parties, corporate functions, and educational events\nOccupancy:\nBanquet Seating - 145\nCocktail Reception - 200\nTheater Styles - 200\nAdditional Features: Built-in sound system\nCici and Hyatt Brown Museum of Art\nAdventHealth Courtyard\nClick to View More Photos of the AdventHealth Courtyard\nThe Courtyard at the Cici and Hyatt Brown Museum of Art at MOAS is a stunning outdoor space. This venue features a wrap-around lanai, outdoor fans, and doors leading directly into the Main Event Space and the Marketplace Cafe.\nOccupancy:\nBanquet Seating - 216\nCocktail Reception - 274\nTheater Styles - 288\nAdditional Features: Built-in sound system\nCici and Hyatt Brown Museum of Art\nConsolidated Tomoka Education Room\nClick to View More Photos of the Consolidated Tomoka Education Room\nThe Education Room at the Cici and Hyatt Brown Museum of Art at MOAS is a multi-purpose space that can be used for a variety of rental functions. This room is equipped with an LCD projector and screen and is ideal for programs that require tables, chairs, or a more educational environment. The Education Room also makes a great space for smaller receptions, parties, or as a buffet room for large functions that take place in the Main Event Space.\nOccupancy:\nBanquet Seating - 45\nCocktail Reception - 60\nTheater Styles - 70\nClassroom - 42\nCici and Hyatt Brown Museum of Art\nChris and Charlie Lydecker Conference Room\nClick to View More Photos of the Chris and Charlie Lydecker Conference Room\nThe Conference Room at the Cici and Hyatt Brown Museum of Art at MOAS is equipped with a 22-person board table, additional office chairs around the room, and an LCD projector and screen. This room is perfect for small meetings.\nOccupancy: 40 Chairs, 22-person board table\nMuseum of Arts & Sciences\nMuseum of Arts & Sciences\nL. Gale Lemerand Wing Main Hall\nClick to View More Photos of the Lemerand Wing Main Hall\nThe Lemerand Wing Main Hall is the largest rental space at the Museum of Arts & Sciences. The Main Hall was designed to hold ceremonies, receptions, or private corporate dinners. This space can easily accommodate large groups and presentations and can be combined with the rental of the adjacent Lobby for pre-event receptions or cocktail hours.\nTake a Virtual Tour of the L. Gale Lemerand Wing\nOccupancy:\nBanquet Seating - 220\nCocktail Reception - 350\nClassroom - 215\nTheater Style - 400\nRight Image Credit: Debra Eby Photography\nMuseum of Arts & Sciences\nGary R. Libby Entry Court\nClick to View More Photos of the Entry Court\nThe Entry Court is located in the center of the Museum just beyond the new lobby entrance and acts as a rotating exhibition gallery. The space is perfect for reception or dinner with close access to the catering kitchen.\nTake a Virtual Tour of the Gary R. Libby Entry Court\nOccupancy:\nBanquet Seating - 80\nCocktail Reception - 125\nMuseum of Arts & Sciences\nRoot Hall\nClick to View More Photos of Root Hall\nRoot Hall in the Museum of Arts & Sciences is the perfect spot for birthday parties, receptions, or dinners. Root Hall is located in the center of the Museum adjacent to the Auditorium and offers direct access to a catering kitchen.\nTake a Virtual Tour of Root Hall\nOccupancy:\nBanquet Seating - 136\nCocktail Reception - 179\nClassroom - 96\nTheater Style - 188\nMuseum of Arts & Sciences\nRoot Family Auditorium\nThe Root Family Auditorium in the Museum of Arts & Sciences is equipped with 266 seats and is perfect for lectures, seminars, performances, and film showcasing. This space is equipped with a full sound room, and two green rooms. Piano is available for an additional $200 fee.\nTake a Virtual Tour of the Root Family Auditorium\nOccupancy: 266 Seats\nMuseum of Arts & Sciences\nRoot Family Museum Train Station\nClick to View More Photos of the Root Family Museum Train Station\nThe Root Family Museum Train Station at the Museum of Arts & Sciences is a unique space that is perfect for any social event or seated dinner featuring two trains outlining the event space and large columns down the middle giving you the true feeling of being inside a real train station.\nTake a Virtual Tour of the Root Family Train Station\nOccupancy:\nBanquet Seating - 96\nCocktail Reception - 126\nImage Credit: Neil Carter Photography\nMuseum of Arts & Sciences\nLowell and Nancy Lohman Planetarium\nFor a truly unique experience, the Lowell and Nancy Lohman Planetarium at the Museum of Arts & Sciences is equipped with 94 seats making it the perfect space for meetings, lectures, conferences, and concerts under the stars. The adjacent lobby also makes a great space to hold a small mixer before a show.\nTake a Virtual Tour of the Lowell and Nancy Lohman Planetarium\nOccupancy: 94 Seats\n2025 Exhibit Sponsors\nSponsored in part by the State of Florida, Department of State, Division of Arts and Culture, the Florida Council on Arts and Culture, and the National Endowment for the Arts.",
      "emails": [
        "rentals@moas.org"
      ]
    },
    {
      "url": "http://www.moas.org/support/membership/index",
      "is_candidate": false,
      "has_email": true,
      "text": "Support MOAS\nMembership\nBecoming a member of the Museum of Arts & Sciences is like joining an extended family of people who like you, would like to take full advantage of all of the wonderful resources that MOAS has to offer. MOAS complements its diverse collections with an equally broad assortment of\nprograms, lectures, and events\n.\nFor more information on Membership call 386-255-0285 or email\nmembership@moas.org\nJoin as a MOAS Member or Renew Your Membership Online >\nJoin as a Donor Society Member or Renew Your Membership Online >\nMOAS General Membership\nINDIVIDUAL ADULT: $50 | INDIVIDUAL SENIOR*/STUDENT/MILITARY: $40 | DUAL ADULT: $70 | DUAL SENIOR*/STUDENT/MILITARY: $55 | FAMILY: $90 | ****FRIEND OF MOAS: $250\nFree unlimited general admission to MOAS, the\nCici and Hyatt Brown Museum of Art\n, and\nLowell and Nancy Lohman Family Planetarium\nfor one year.**\nInvitations to select events including member preview days for new exhibits and exclusive member-only events.\nExclusive discounts at the Museum store, classes, and workshops.\n2 complimentary guest passes per year.\nReciprocity for general admission at participating SERM museums.***\n10% off food and beverage items in the MOAS Marketplace.\n10% off on rental spaces.\n* Senior Membership available for person(s) 65 years of age and older. Family Membership includes two adults and all children under 18 living in a household.\n** Not valid for specially ticketed programs, events, and exhibits including Second Saturday Laser Rock Shows\n*** Some participating museums restrict benefits. \"Family\" benefits are defined by each participating institution.\n**** Friend of MOAS memberships includes up to 4 adults in the house and receives NARM benefits.\nDonor Societies\nPATRON'S CIRCLE: $500 | DIRECTOR'S CIRCLE: $1,000\n* SMITHSONIAN AFFILIATE MEMBERSHIP ADD-ON INCLUDED\nPatron's Circle and Donor's Circle benefits include all the benefits of the General Membership Program including...\nPatron's Circle\nAnnual passes for 4 adults and all children in the household. Exclusive invitations to VIP events for member and one guest. Membership also includes NARM & SERM benefits. ($230 tax deduction for member)\nDirector's Circle\nInvitation for member and one guest to attend the Annual Dinner. Annual passes for 4 adults and all children in the household. Exclusive invitations to VIP events for member and one guest. Membership also includes NARM & SERM benefits. ($440 tax deduction for member)\nAdditional MOAS Member Benefits\nSmithsonian Add-on Affiliate Membership Program\n* SMITHSONIAN ADD-ON AVAILABLE: $25 ANNUALLY\nFor current or renewing members, please call guest relations to add-on the Smithsonian Affiliate Member program. For new members, add-on available at check-out.\nThis specialty add on features several exciting benefits, including:\nReciprocal benefits at over 200 participating Museums\nA year of Smithsonian magazine\nA personalized membership card\nMember-only discounts at Smithsonian affiliates.\nA benefit to General Membership members is the opportunity to become \"Affiliate members\" of the Smithsonian for an additional annual fee of $25. Smithsonian Affiliate membership is included with all Donor Society memberships.\nMore Information >\nCrayola Experience - Orlando, FL\nMOAS members receive discounted admission on General Admission and Annual Passes to the Crayola Experience in Orlando, FL. To purchase your tickets visit\ntickets.crayolaexperience.com/venues\nand type in the store name of \"MOAS\"\nReciprocal Museum Benefits\nAs a benefit to General Membership or Renaissance Society members, the Museum of Arts & Sciences offers reciprocal museum privileges to over 1000 museums in the U.S., Canada, and Mexico.\nView Reciprocal Museum Benefits >\n2025 Exhibit Sponsors\nSponsored in part by the State of Florida, Department of State, Division of Arts and Culture, the Florida Council on Arts and Culture, and the National Endowment for the Arts.",
      "emails": [
        "membership@moas.org"
      ]
    },
    {
      "url": "http://www.moas.org/support/member-events/index",
      "is_candidate": false,
      "has_email": false,
      "text": "Member Events\nList View\nCalendar View\n2025 Exhibit Sponsors\nSponsored in part by the State of Florida, Department of State, Division of Arts and Culture, the Florida Council on Arts and Culture, and the National Endowment for the Arts.",
      "emails": []
    },
    {
      "url": "http://www.moas.org/about/board-of-trustees/index",
      "is_candidate": false,
      "has_email": false,
      "text": "About MOAS\n2025 Board of Trustees\nExecutive Committee\nTrustees\n2025 Exhibit Sponsors\nSponsored in part by the State of Florida, Department of State, Division of Arts and Culture, the Florida Council on Arts and Culture, and the National Endowment for the Arts.",
      "emails": []
    },
    {
      "url": "http://www.moas.org/whats-happening/events/index",
      "is_candidate": false,
      "has_email": false,
      "text": "What's Happening\nUpcoming Events\nList View\nCalendar View\n2025 Exhibit Sponsors\nSponsored in part by the State of Florida, Department of State, Division of Arts and Culture, the Florida Council on Arts and Culture, and the National Endowment for the Arts.",
      "emails": []
    },
    {
      "url": "http://www.moas.org/rentals-form/index",
      "is_candidate": false,
      "has_email": false,
      "text": "Rental Inquiry\n2025 Exhibit Sponsors\nSponsored in part by the State of Florida, Department of State, Division of Arts and Culture, the Florida Council on Arts and Culture, and the National Endowment for the Arts.",
      "emails": []
    },
    {
      "url": "http://www.moas.org/Event-Resources-6-389.html",
      "is_candidate": false,
      "has_email": false,
      "text": "Event Resources & Pricing\nEvent Policies and Packages\n2025 Exhibit Sponsors\nSponsored in part by the State of Florida, Department of State, Division of Arts and Culture, the Florida Council on Arts and Culture, and the National Endowment for the Arts.",
      "emails": []
    },
    {
      "url": "http://www.moas.org/about/staff-directory/index",
      "is_candidate": false,
      "has_email": true,
      "text": "About MOAS\nStaff Directory\nMuseum Front Desk\n(386) 255-0285\nCEO\nTabitha Schmidt\nFinance Department\nRachel Hardy\nChief Financial Officer\nrhardy@moas.org\next. 336\nJonathan Dewey\nAccounts Payable & Payroll Specialist\njdewey@moas.org\next. 349\nCuratorial Department\nTamara Joy\nSenior Director of Curatorial Affairs / Gary R. Libby Curator of Art\ntjoy@moas.org\next. 316\nJames \"Zach\" Zacharias\nSenior Curator of History\nzach@moas.org\next. 344\nStephanie Shaw\nRegistrar / Collection & Visual Information Specialist\nsshaw@moas.org\next. 316\nRyan Lowry\nExhibition Manager\nrlowry@moas.org\next. 346\nPlanetarium Department\nSeth Mayo\nCurator of Science\nsmayo@moas.org\next. 337\nChristian Traverson\nPlanetarium Manager & Assistant Curator of Science\nchristian@moas.org\next. 313\nOperations Department\nWillis Chico\nChief Operating Officer & Director of Human Resources\nwchico@moas.org\next. 340\nKelly Clapsaddle\nRentals Manager\nkclapsaddle@moas.org\next. 348\nEducation Department\nNicole Messervy\nYouth & Family Programs Manager\nnicolem@moas.org\next. 333\nCaitlyn Montgomery\nEducation Coordinator\ngroupinfo@moas.org\next. 312\nAdvancement Department\nJonna \"JJ\" Royer\nCAO\njroyer@moas.org\next. 209\nJenelle Codianne\nDirector of Design\njenelle@moas.org\next. 320\nClaire Mitchell\nAssistant Director of Advancement\nclaire@moas.org\next. 347\nTrey King\nAdvancement Specialist\ntking@moas.org\next. 315\nClarissa Leon\nAltru Database Coordinator\nclarissa@moas.org\next. 339\nCampus Services\nDennis Sweeney\nDirector of Facilities\ndennis@moas.org\next. 351\nJohn Bruce\nChief of Security\njohn@moas.org\next. 203\n2025 Exhibit Sponsors\nSponsored in part by the State of Florida, Department of State, Division of Arts and Culture, the Florida Council on Arts and Culture, and the National Endowment for the Arts.",
      "emails": [
        "christian@moas.org",
        "claire@moas.org",
        "clarissa@moas.org",
        "dennis@moas.org",
        "groupinfo@moas.org",
        "jdewey@moas.org",
        "jenelle@moas.org",
        "john@moas.org",
        "jroyer@moas.org",
        "kclapsaddle@moas.org",
        "nicolem@moas.org",
        "rhardy@moas.org",
        "rlowry@moas.org",
        "smayo@moas.org",
        "sshaw@moas.org",
        "tjoy@moas.org",
        "tking@moas.org",
        "wchico@moas.org",
        "zach@moas.org"
      ]
    },
    {
      "url": "http://www.moas.org/about/index",
      "is_candidate": false,
      "has_email": false,
      "text": "About MOAS\nAbout the Museum\nThe Museum of Arts & Sciences (MOAS) is the primary art, science and history museum in Central Florida. The area’s largest museum, MOAS is nationally accredited by the American Alliance of Museums and is a Smithsonian Institution Affiliate.\nMission Statement\nTo ignite curiosity and connection to art, science, and history that creates a lasting impact with our communities.\nVision\nWe strive to be a cornerstone of our communities where all minds are expanded and spirits are sparked, creating deeper connections to the world using the nexus of art, science, and history.\nExplore the Future of the Museum\nWe’re excited to share the vision for the next chapter of our museum’s journey. Stay up-to-date on how upcoming construction will enhance our spaces, expand our facilities, and create a more dynamic experience for visitors. Visit\nMOAS Future\nto learn more about how we’re shaping the future of art, science, and history.\nThe History of MOAS\n1955\nThe Museum of Arts & Sciences is a not-for-profit educational institution founded in 1955.\n1962\nThe Museum of Arts & Sciences was chartered by the State of Florida in 1962. The Museum is accredited by the American Association of Museums and is an affiliate of the Smithsonian Institution. Programs are sponsored in part by the State of Florida, Department of State, Division of Cultural Affairs, the Florida Arts Council, the National Endowment for the Arts and the County of Volusia.\n1975\nThe impressive 13-foot tall skeleton of the Eremotherium laurilardi or Giant Ground Sloth was excavated in 1975 and dates back approximately 130,000 years. The Volusia County Giant Ground Sloth is the best preserved and most complete fossil of this species in North America and now resides in the Prehistory of Florida Gallery within the MOAS West Wing.\n1986\nThe Kenneth Worcester Dow and Mary Mohan Dow Gallery of American Art is a 4,000 square-foot exhibition that opened in 1986. The gallery presents and interprets, in historical context, 300 years of American painting, sculpture, pewter, silver, period furniture, and decorative arts.\n1995\nThe Cuban Foundation Fine and Folk Art Museum contains one of the largest collections of Cuban art outside of Cuba. This rich gallery was reinstalled in 1995 with the inclusion of pre-Columbian Taino pottery and Spanish Colonia artifacts in silver, rare woods, and tortoiseshell.\n1996\nEstablished in 1996, the William and Helena Schulte Gallery of Chinese Art showcases 84 objects from the Museum's collection, including large interpretive panels on Chinese history and society. T'ang and Wei horses, Han and Ming tomb figures, Ch'ing gemstone carvings and Ming blue and white objects are amoung the many other cultural items.\n2001\nThe 24,000 square-foot Root Wing opened in October 2001 and houses the Root Family Museum which encompasses 20th century American culture and technological artifacts relating to the history of Coca-Cola. The Root Family Museum also contains a Train Station that includes two rail cars and a railroad exhibit that gives great insight into the lives of early American industrialists.\n2005\nThe Kim A. Klancke, M.D. and Marsha L. Klancke Environmental Education Complex in Tuscawilla Preserve opened in Spring 2005. Nature trails throughout the 90-acre preserve in adjacent Tuscawilla Park are maintained by MOAS.\n2008\nThe Charles and Linda Williams Children's Museum opened in 2008 and is the first hands-on science center in Volusia County. This 9,300 square-foot space houses more than fifteen professionally designed interactive exhibits, geared especially towards children, that demonstrate various principles of science, engineering, and physics.\n2011\nThe Helene B. Roberson Visible Storage Building is a state-of-the-art, 4,000 square-foot addition that was added to the Museum in 2011. The facility stores and displays important works from the Museum's collection in a glass-fronted, open storage format. It is the only such facility for art and decorative objects in Florida.\n2014\nThe Planetarium, renamed the Lowell and Nancy Lohman Family Planetarium in 2019, is a 94-seat facility housed in a beautifully designed new building. The 40 ft. diameter dome structure and sound system changes the whole experience for viewers as they engage in the wonders of the universe. The Lohman Planetarium features a brand new OmniStar™ digital projector which expands the Planetarium's capabilities significantly. Besides star shows, the Lohman Planetarium also has the ability to play full-dome HD movies of all types and genres. The new planetarium opened in August 2014.\n2015\nThe Cici and Hyatt Brown Museum of Art opened in February 2015 and is home to the most extensive collection of Florida art in the world. The 26,000 square-foot Museum features a collection of Florida themed oil and watercolor paintings dating back to the early 1800's. The entire collection consists of over 2,600 paintings. The size and scope of the collection lends itself perfectly to illustrating the many stories that can be told about the geography and natural history of Florida.\n2015\nThe new West Wing of the Museum opened in October 2015. The West Wing was originally built on a dip in the property and flooded in May 2009 due to heavy rains. The Museum was able to obtain FEMA funding that was matched in part by a Volusia County ECHO Grant and funding from the Museum to make reconstruction possible.\nLearn More About MOAS\nBoard of Trustees\nStaff Directory\nEmployment\nInternships\nArts & Sciences Magazine\nMOAS Blog\nAnnual Report\nCharitable Donations\nStrategic Plan\n2025 Exhibit Sponsors\nSponsored in part by the State of Florida, Department of State, Division of Arts and Culture, the Florida Council on Arts and Culture, and the National Endowment for the Arts.",
      "emails": []
    },
    {
      "url": "http://www.moas.org/support/index",
      "is_candidate": false,
      "has_email": false,
      "text": "Support MOAS\nBecome a MOAS Member Today!\nBecoming a member of the Museum of Arts & Sciences is like joining an extended family of people who like you, would like to take full advantage of all of the wonderful resources that MOAS has to offer:\nUnlimited general admission\nWorld class cultural campus\nEducational programs and lectures\nSocial events and exhibit openings\nHelp MOAS continue to shine as a premier cultural destination in Florida and the Southeast. Together, we can continue to grow the cultural arts in our community.\nBecome a MOAS Member Today!\nMembership Opportunities\nGive the Gift of Membership!\nClick Here\nDonor Societies\nUpgrade your MOAS Membership by joining one of our Donor Societies, an exclusive group of supporters that bring renewed energy to our membership and revitalization to the endeavors of the Museum of Arts & Sciences. By joining a Donor Society, you will help foster the growth of the Museum and help further develop the cultural heart of our community.\nMore Info\nVolunteer\nAn enormous amount of help is given to the Museum by people who are volunteers. From keeping the Museum store running to giving guided tours, volunteers undertake an astonishing range of tasks. Volunteers range from school students and graduates gaining work experience to retired individuals who bring a lifetime of skills with them. MOAS is looking for friendly and enthusiastic volunteers to support the Museum's services and community activities.\nMore Info\nMOAS Guild\nThe Members of the Guild are an incredibly dynamic group whose mission is to promote the welfare of the Museum through its many programs and activities. The Guild offers members many opportunities to use their skills by working on many projects including The Halifax Art Festival and the Children's Museum Golf Classic. The Guild also organizes informative monthly meetings, social events, and field trips, which offer an opportunity to get acquainted with like-minded people who have a common goal.\nMore Info\nCuratorial Department Inquiries\nThe Museum of Arts & Sciences welcomes the donation of objects that will help to enhance our current collections. As outlined below, the Museum follows a policy of selective acquisition. Each donation request is thoughtfully considered by the Curatorial Department, Executive Director, and appropriate governing committees to determine if the gift is in line with the specific criteria for the acquisition and acceptance of donations, as outlined in the Museum’s Collection Management Policy; any object accepted into the Museum’s Collection should be consistent with the institution’s mission, be historically or culturally relevant, and be properly preserved.\nMore Info\nExhibit Sponsors\nHelp us to bring world-class exhibitions to the Museum of Arts & Sciences. The Museum welcomes over 90,000 visitors to its exhibits, classes, and programs each year. Our audience is a diverse as our exhibitions, including art lovers, history enthusiasts, and life-long learners.\nMore Info\nTraveling Exhibits\nThe Museum of Arts & Sciences (MOAS) is happy to offer a selection of traveling exhibitions for rent to venues across the nation. The traveling exhibits listed below are open to any venue that would be interested in hosting a MOAS exhibition.\nMore Info\nMember Events\nThere are no upcoming events at this time.\nSee More Member Events\n2025 Exhibit Sponsors\nSponsored in part by the State of Florida, Department of State, Division of Arts and Culture, the Florida Council on Arts and Culture, and the National Endowment for the Arts.",
      "emails": []
    },
    {
      "url": "https://www.facebook.com/moasdaytona/",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    }
  ],
  "all_links": [
    "http://www.moas.org/explore/tuscawilla-preserve/index",
    "http://www.moas.org/explore/cici-and-hyatt-brown-museum-of-art/index",
    "http://www.moas.org/z/user/privacy/index",
    "http://www.moas.org/support/donor-society/index",
    "http://www.moas.org/explore/planetarium/index",
    "http://www.moas.org/Passport-Gala",
    "http://www.moas.org/education/family-science-nights/index",
    "http://www.moas.org/Marketplace-at-MOAS",
    "http://www.moas.org/Code-of-Conduct",
    "http://www.moas.org/explore/root-family-museum/index",
    "http://www.moas.org/explore/north-wing/index",
    "http://www.moas.org/about/blog/index",
    "http://www.moas.org/",
    "http://www.moas.org/explore/Lemerand-wing/index",
    "http://www.moas.org/Guild-of-the-Museum-of-Arts---Sciences-6-199.html",
    "http://www.moas.org/rentals/private-and-corporate-events/index",
    "http://www.moas.org/Museum-of-Arts---Sciences-Annual-Report-6-333.html",
    "http://www.moas.org/Object-Donation-Request-6-26571.html",
    "http://www.moas.org/rentals/exclusivevendors",
    "http://www.moas.org/support/membership/index",
    "http://www.moas.org/whats-happening/index",
    "http://www.moas.org/join-mailing-list/",
    "http://www.moas.org/rentals/index",
    "http://www.moas.org/support/renaissance-society/index",
    "http://www.moas.org/visit/plan/index",
    "http://www.moas.org/press-releases/index",
    "http://www.moas.org/support/member-events/index",
    "http://www.moas.org/visit/admission/index",
    "http://www.moas.org/Curatorial-Department-Inquiries-6-26571.html",
    "http://www.moas.org/about/board-of-trustees/index",
    "http://www.moas.org/whats-happening/events/index",
    "http://www.moas.org/education/index",
    "http://www.moas.org/rentals-form/index",
    "http://www.moas.org/explore/index",
    "http://www.moas.org/visit/index",
    "http://www.moas.org/whats-happening/current-exhibits/index",
    "http://www.moas.org/Event-Resources-6-389.html",
    "http://www.moas.org/Campaign",
    "http://www.moas.org/Shoosty-Bugs--An-Art-Infestation-6-26788.html",
    "http://www.moas.org/support/major-sponsors/index",
    "http://www.moas.org/z/misc/site-map/index",
    "http://www.moas.org/education/field-trips/index",
    "http://www.moas.org/rentalphotography",
    "http://www.moas.org/support/major-sponsors/index?&zsid=26",
    "http://www.moas.org/Crown-Jewel-Campaign-6-26622.html",
    "http://www.moas.org/about/arts-and-sciences-magazine/index",
    "http://www.moas.org/Bugs-Outside-the-Box--Discover-the-Art-Within-the-Sciences-6-26789.html",
    "http://www.moas.org/about/staff-directory/index",
    "http://www.moas.org/rentals/weddings-and-receptions/index",
    "http://www.moas.org/about/index",
    "http://www.moas.org/support/index",
    "http://www.moas.org/Strategic-Plan-6-25731.html",
    "http://www.moas.org/moas-in-the-news/index",
    "http://www.moas.org/visit/tours-and-group-visits/index",
    "http://www.moas.org/about/internships/index",
    "http://www.moas.org/explore/charles-and-linda-williams-children-museum/index",
    "http://www.moas.org/about/employment/index",
    "http://www.moas.org/support/volunteer/index",
    "http://www.moas.org/Tide-Pool--Exploring-Coastal-Communities-6-26043.html",
    "http://www.moas.org/general-information/index",
    "http://www.moas.org/education/summer-learning-institute/index",
    "http://www.moas.org/Traveling-Exhibits.html?&zsid=14",
    "http://www.moas.org/whats-happening/planetarium-shows/index",
    "http://www.moas.org/It-s-a-Ship-Show--Florida-s-Maritime-Canvas-6-26787.html",
    "http://www.moas.org/whats-happening/upcoming-exhibits/index",
    "http://www.moas.org/Charitable-Donation-Requests-6-346.html",
    "http://www.moas.org/education/outreach/index"
  ],
  "candidate_links": [
    "http://www.moas.org/rentals/private-and-corporate-events/index",
    "http://www.moas.org/support/membership/index",
    "http://www.moas.org/support/member-events/index",
    "http://www.moas.org/about/board-of-trustees/index",
    "http://www.moas.org/whats-happening/events/index",
    "http://www.moas.org/rentals-form/index",
    "http://www.moas.org/Event-Resources-6-389.html",
    "http://www.moas.org/about/staff-directory/index",
    "http://www.moas.org/about/index",
    "http://www.moas.org/support/index",
    "https://www.facebook.com/moasdaytona/"
  ],
  "visited": [
    "http://www.moas.org/",
    "http://www.moas.org/about",
    "http://www.moas.org/contact",
    "http://www.moas.org/staff",
    "http://www.moas.org/team",
    "http://www.moas.org/board",
    "http://www.moas.org/directory",
    "http://www.moas.org/events",
    "http://www.moas.org/sitemap.xml",
    "http://www.moas.org/council",
    "http://www.moas.org/leadership",
    "http://www.moas.org/management",
    "http://www.moas.org/producers",
    "http://www.moas.org/support",
    "http://www.moas.org/crew",
    "http://www.moas.org/members",
    "http://www.moas.org/bios",
    "http://www.moas.org/people",
    "http://www.moas.org/artists",
    "http://www.moas.org/musicians",
    "http://www.moas.org/faculty",
    "http://www.moas.org/administration",
    "http://www.moas.org/rentals/private-and-corporate-events/index",
    "http://www.moas.org/support/membership/index",
    "http://www.moas.org/support/member-events/index",
    "http://www.moas.org/about/board-of-trustees/index",
    "http://www.moas.org/whats-happening/events/index",
    "http://www.moas.org/rentals-form/index",
    "http://www.moas.org/Event-Resources-6-389.html",
    "http://www.moas.org/about/staff-directory/index",
    "http://www.moas.org/about/index",
    "http://www.moas.org/support/index",
    "https://www.facebook.com/moasdaytona/"
  ],
  "base_url": "http://www.moas.org/"
}