{
  "pages": [
    {
      "url": "https://morikami.org/event-calendar/",
      "is_candidate": false,
      "has_email": true,
      "text": "",
      "emails": [
        "morikami@pbc.gov"
      ]
    },
    {
      "url": "https://morikami.org/contact-us/",
      "is_candidate": false,
      "has_email": true,
      "text": "General Inquiries\nMain line: (561) 495-0233\nAdmissions: (561)  233-1342\nmorikami@pbc.gov\n4000 Morikami Park Road, Delray Beach, FL 33446\nDepartments\nCornell Cafe\n561- 233-1366 |\ncornellcafe@yahoo.com\nFor catering services please ask for Christy Chen.\nCafe Information:\nhttps://morikami.org/cornell-cafe/\nCuratorial / Exhibitions\nMuseum General Inquiries – Carla Stansifer |\ncstansifer@pbc.gov\n| 561-233-1317\nMuseum Information:\nhttps://morikami.org/museum/\nGarden General Inquiries – Heather Grzybek |\nhgrzybek@pbc.gov\n| 561-233-1359\nGarden Information:\nhttps://morikami.org/gardens/\nPlant Guide:\nRoji-en: A Guide to the Plants\nDonations\nMonetary – Sharyn Samuels |\nssamuels@pbc.gov\n| 561-233-1316\nArt/Artifacts – James Rodgers |\njrodgers@pbc.gov\n| 561-233-1335\nGarden – Heather Grzybek |\nhgrzybek@pbc.gov\n| 561-233-1359\nDONATING TO OUR MUSEUM COLLECTION\nThank you for your interest in donating objects to the permanent collection of the Morikami Museum and Japanese Gardens. Please email the Collections Manager/Registrar,\nJames Rodgers\nwith a picture and a description of what you would like to donate.  He will respond at his earliest convenience.\nEducation\nGeneral Inquiries – Wendy Lo |\nwlo@pbc.gov\n| 561-233-1328\nEducational Program Enrollment & Inquires – Ayano Hamilton |\nahamilton1@pbc.gov\n| 561-233-1367\nOutreach Programs –\npark-mmoutreach@pbc.gov\n|\nStroll for Well-Being Program – Ayano Hamilton |\nmorikamistroll@pbc.gov\n| 561-233-1367\nTour Information – Misuzu Lyden |\nMLyden@pbc.gov\n| 561-233-1330\nFacility Rentals (Weddings & Corporate Events)\nFacility Rental Manager – Alanna Keating | 561-233-1304 |\nakeating@pbc.gov\nFacility Rental Coordinator – Julia Medeiros | 561-233-1305 |\njmedeiros@pbcgov.org\nInformation on Booking a Private Event:\nhttps://morikami.org/private-event/\nPhotography and Videography:\nhttps://morikami.org/photography-and-videography/\nPreferred Vendors:\nhttps://morikami.org/preferred-vendors/\nRental Inquiry Form:\nhttps://morikami.org/rental-inquiry-form/\nSpacing, Fees, & Guidelines:\nhttps://morikami.org/spacing-fees-guidelines/\nWeddings & Ceremonies:\nhttps://morikami.org/weddings-ceremonies/\nFinance\nGeneral Inquiries – Don Blackman |\ndblackman@pbc.gov\n| 561-233-1363\nMarketing\nMarketing & Cultural Events – Miwako Patton |\nmpatton@pbc.gov\n| 561-233-1349\nVisitor Experience & Cultural Events – Lisa Niven |\nlniven@pbc.gov\n| 561-233-1348\nMedia & Press – Sally Shorr |\nsally@thebuzzagency.net\nWebsite – Keven Roustan |\nkroustan@pbc.gov\n| 561-233-1319\nA/V Technician | Joe Angello |\nJAngello@pbc.gov\n| 561-233-1318\nMembership\nGeneral Inquiries – Ginger Solano | 561-233-1315  |\nmorikamimembers@pbc.gov\nMembership Information:\nhttps://morikami.org/join/\nMuseum Store\nGeneral Inquiries – Irene (Chenyun) Zhang | 561-233-1325 |\nCZhang@pbc.gov\nMuseum Store:\nhttps://morikami.org/store/\n| 561-233-1312 |\nmmstore@pbc.gov\nSponsorship\nGeneral Inquiries – Sharyn Samuels | 561-233-1316 |\nssamuels@pbc.gov\nSponsorship Information:\nhttps://morikami.org/donate/#corporate\nVolunteer & Docent Information\nVolunteer Coordinator – Brandon McGowan | 561-233-1331 |\nbmcgowan@pbc.gov\nVolunteer Information:\nhttps://morikami.org/volunteer/\nBoard of Trustees\nPalm Beach County and the Board of Trustees of Morikami, Inc. have been partners in bringing Morikami’s services to the public since opening in 1977. The park and building are the property of Palm Beach County. Morikami Inc., a non-profit corporation, provides financial backing from membership, donations, grants and other revenue-producing activities, and volunteer support for all aspects of the institution’s operations.\nLearn about the Board of Trustees\nOfficers\nRandal J. Baker | President\nBio\nRosie Puello Burkman | Vice President\nBio\nRobin S. May | 2nd Vice President\nBio\nChristine Carton | Secretary / Treasurer\nBio\nTrustees\nBob Keady\nBio\nJuan Nogueras\nBio\nKevin Cooper\nBio\nLauren Eder\nBio\nNorma C. Geller\nBio\nMickey Rosenzweig\nBio\nIndira Persaud | Palm Beach County Representative\nBonnie White-Lemay | Museum Director\nPalm Beach County Commissioners\nCommissioner\nMaria G. Marino, Mayor\n(District 1)\nCommissioner\nSara Baxter, Vice Mayor\n(District 6)\nCommissioner\nGregg K. Weiss\n(District 2)\nCommissioner\nJoel G. Flores\n(District 3)\nCommissioner\nMarci Woodward\n(District 4)\nCommissioner\nMaria Sachs\n(District 5)\nCommissioner\nBobby Powell Jr.\n(District 7)\nPalm Beach County Executive Staff\nVerdenia C. Baker\n, County Administrator\nIsamí C. Ayala-Collazo\n, Assistant County Administrator\nPatrick Rutter\n, Assistant County Administrator\nReginald K. Duren\n, Assistant County Administrator\nTammy Fields\n, Assistant County Administrator\nTodd J. Bonlarron\n, Assistant County Administrator\nJennifer Cirillo\n, Director of Parks & Recreation\nBoard Meetings\nThe Full Board of Trustees meetings will be held on the 3rd Wednesday of every month unless otherwise noted, from\n4:30-6:00 p.m.\nMeetings will take place in the\nSakai Room\nat Morikami.\nMeeting Date\nTime\nJanuary 15\n4:30pm\nFebruary 19\n4:30pm\nMarch 19\n4:30pm\nApril 16 (Annual Meeting and Year-in-Review)\n4:30pm\nMay 21\n4:30pm\nJune 18\n4:30pm\nJuly 16 (Budget Workshop)\n4:30pm\nAugust 20\n4:30pm\nSeptember 17\n4:30pm\nOctober 15\n4:30pm\nNovember 19\n4:30pm\nDecember 10 (2nd Wednesday)\n4:30pm\nCommittee Meetings\nAll dates and times are subject to change and Committee Meetings are set by the chairperson of each committee. If you plan to attend a meeting, please call ahead (561-233-1350) to confirm date, time, and exact location.\nThe\nCommittee on Collections\nmeetings are held on an as needed basis.\nThe\nDevelopment Committee\nmeetings are held on the 2nd Friday of the month at 11:30am.\nThe\nEducation Program & Cultural Events Committee\nmeetings are held on an as needed basis.\nThe\nExecutive Committee\nmeetings are held on an as needed basis.\nThe\nFacilities Committee\nmeetings are held on an as needed basis.\nThe\nGovernance & Scholarship Committee\nmeetings are held on an as needed basis.\nThe\nFinance, Budget, and Endowment Committee\nmeetings are held on the 3rd Wednesday of the month at 3:30pm in Morikami’s Conference Room.\nThe\nBonsai Garden Committee\nmeetings are held on an as needed basis.",
      "emails": [
        "ahamilton1@pbc.gov",
        "akeating@pbc.gov",
        "bmcgowan@pbc.gov",
        "cornellcafe@yahoo.com",
        "cstansifer@pbc.gov",
        "czhang@pbc.gov",
        "dblackman@pbc.gov",
        "hgrzybek@pbc.gov",
        "jangello@pbc.gov",
        "jmedeiros@pbcgov.org",
        "jrodgers@pbc.gov",
        "kroustan@pbc.gov",
        "lniven@pbc.gov",
        "mlyden@pbc.gov",
        "mmstore@pbc.gov",
        "morikami@pbc.gov",
        "morikamimembers@pbc.gov",
        "morikamistroll@pbc.gov",
        "mpatton@pbc.gov",
        "park-mmoutreach@pbc.gov",
        "sally@thebuzzagency.net",
        "ssamuels@pbc.gov"
      ]
    },
    {
      "url": "https://morikami.org/about/",
      "is_candidate": false,
      "has_email": true,
      "text": "Our History\nMorikami Museum and Japanese Gardens celebrate a rich, century-old connection between Japan and South Florida. In the early 1900s, a group of young Japanese farmers, led by Jo Sakai, established the Yamato Colony in northern Boca Raton. Named after an ancient term for Japan, this small agricultural community aimed to introduce innovative farming practices to Florida. The settlers primarily grew pineapples and winter vegetables, but faced challenges like competition and economic changes that made farming difficult.\nDespite hardships, the colony grew to include families, blending Japanese traditions with life in Florida. However, by the 1940s, most colonists had left or returned to Japan. During World War II, the U.S. government took over much of the land for military use. George Sukeji Morikami, one of the last remaining settlers, stayed and later donated his land to Palm Beach County. This gift led to the creation of Morikami Park, which opened in 1977 as a cultural and educational center honoring the Yamato Colony’s legacy.\nWorking alongside his friends, neighbors, and the Palm Beach County Department of Parks and Recreation, George Morikami helped transform his personal history into a lasting legacy—building a bridge of cultural understanding between George’s two homelands. Today, the Morikami Museum and Japanese Gardens features traditional Japanese architecture, three exhibition galleries, a theater, and an authentic tea house. The 16-acre Japanese gardens reflect a variety of historical styles from across Japan, thoughtfully arranged to form one harmonious landscape. With close to 7,500 art objects and artifacts, including tea ceremony items and textiles, the Morikami offers visitors a deep, immersive experience of Japanese culture and its enduring connection to Florida.\nOur Mission\nOur mission at Morikami Museum and Japanese Gardens is\nto engage a diverse audience by presenting Japanese cultural experiences that educate and inspire.\nSince its opening in 1977, Morikami has been a center for Japanese arts and culture in South Florida. With rotating exhibitions, tea ceremonies performed monthly (October through May) and educational outreach programs with local schools, libraries, and organizations, Morikami strives to spread appreciation for the living culture of Japan.\nMuseum\nThe original building, the\nYamato-kan\n, is modeled after a Japanese villa. It features a ring of exhibition rooms surrounding an open-air courtyard with a dry garden of gravel, pebbles, and small boulders. The Yamato-kan offers exhibits that chronicle the history of the Yamato Colony and the design philosophy of garden designer Hoichi Kurisu.\nThe principal museum building opened in 1993 to meet popular demand for more programming and versatile facilities and to satisfy the needs of a growing community. The museum’s architecture is inspired by traditional Japanese design. The building features three exhibition galleries, a 226-seat theater, an authentic tea house with a viewing gallery, classrooms, a museum store, the Cornell Cafe, and lakeside terraces for a panoramic view while dining.\nThe Morikami Collections house more than 7,000 Japanese art objects and artifacts, including a 500-piece collection of tea ceremony items, more than 200 textile pieces, and fine art acquisitions.\nGardens\nThe 16 acres that surround Morikami’s two museum buildings include expansive Japanese gardens with strolling paths, resting areas, our world-class bonsai collection and lakes teeming with koi and other wildlife. The wider 200-acre park features nature trails, pine forests and picnic areas.\nIn 2001, Morikami completed a major garden expansion and renovation. The new gardens reflect major periods of Japanese garden design, from the eighth to the 20th century, and serve as an outdoor extension of the museum. According to the garden designer,\nHoichi Kurisu\n, each garden is intended to express the character and ideas of a unique counterpart in Japan without attempting to duplicate those gardens, and seamlessly flow together as one garden.\nMorikami Museum and Japanese Gardens, with its unique gardens and collections, is one of Palm Beach County’s most treasured cultural attractions. Located in a tranquil natural setting, Morikami invites visitors to explore its many facets and discover Florida’s heritage and its connection with Japan.\nYamato Colony\nPioneering Japanese in Florida\nWhy do we find the name Yamato, an ancient name for Japan, here in Palm Beach County? Because the Yamato Colony was once a small community of Japanese farmers in present-day northern Boca Raton. The story of the Yamato Colony begins with Jo Sakai’s visit to Florida in 1903. Sakai hailed from Miyazu, Japan, and was a recent graduate of New York University. He signed an agreement with the Florida East Coast Railway to locate a proposed colony of Japanese farmers in the Boca Raton area. Shortly afterward, he returned to Japan to recruit settlers and bring them to Florida. At first, young, single men joined the Yamato Colony. For several years, these settlers grew pineapples for shipment to markets in the north. By the end of the first decade of the century, competition from Cuban pineapples had caused many area growers, including Yamato colonists, to turn to winter vegetables. Few of the settlers remained in Yamato for very long, but those who did sometimes returned to Japan briefly to marry and bring wives to the colony. Families soon grew. Ironically, prosperity during World War I and the land “boom” of the 1920s resulted in many settlers leaving. By the beginning of World War II, few Japanese remained. In May of 1942, farmland in the Yamato area still owned by Japanese settlers was confiscated by the U. S. government for a military installation. While the pioneering community of Japanese settlers are gone forever, Yamato’s name remains today.\nThe exhibition, now housed in the Yamato-kan, has been financed in part with Historical Museums Grants-in-Aid Program assistance provided by the Division of Historical Resources, Florida Department of State, Secretary of State.\nClick here to see images from the Yamato Colony in the Morikami Collection\nPart I: An Idea is Born\nThe story of the Yamato Colony begins with the visit to Florida in November and December of 1903 by a 29-year-old Japanese man named Jo Sakai. Sakai approached the Jacksonville Board of Trade with the idea of establishing one or more Japanese agricultural colonies in Florida. The reaction to his proposal in both business and political circles was immediately enthusiastic. Sakai soon found himself on a whirlwind tour of the state to inspect possible sites for the first of the proposed colonies.\nPortrait of a Colony Founder\nJo Sakai, founder of the Yamato Colony, was born October 7, 1874 in the castle town of Miyazu, Japan. Given the name Kamosu, he was the fourth of seven children born into a former samurai household. He traveled to the United States in 1895 upon completing the equivalent of a high school education in Japan. After visiting Florida in 1903, he returned to Japan early the following year to recruit settlers and investors for his colony project. He finally established the Yamato Colony on a permanent site early in the summer of 1905. He promoted the colony effort tirelessly throughout the remainder of his life. On August 21, 1923 he died of tuberculosis in Asheville, North Carolina, where he had gone to retire. He was 49 years old.\nNothing Less than the Transformation of Florida Agriculture\nFlorida business and political leaders supported Sakai’s plan for a Japanese colony because they believed that the project would introduce new crops and farming techniques to the state. They expected the Yamato Colony to provide a model that farmers could emulate to improve the profitability of Florida agriculture. In the decades since the Civil War had devastated the South’s economy, agricultural interests experimented with Japanese crops to help revitalize the region. It was only natural that the assistance of the Japanese themselves would eventually be sought in such ventures.\nThe Colony Site\nThe Japanese colony was established in early summer of 1905 on lands previously occupied by an enterprise called the Keystone Plantation. It was located in the tiny community then known as Wyman, situated midway between Delray Beach and Boca Raton. Access to the plantation, and later the colony, was available from Dixie Highway by a primitive railroad crossing at what has since become known as Yamato Road. Plantation lands extended north and south of the future road about one mile in either direction. The western boundary of the property was in the vicinity of present-day Interstate 95. The colonists soon built homes on the property, west and south of the crossing into the colony land. Later a railroad station and a school were established nearby.\nPart II – Diary of a Colony\nDiary of Henry Tamemasu Kamiya\nHenry Kamiya kept a diary from June 1, 1914 to June 25, 1941. He began it some ten years after his arrival in the Boca Raton area, and continued it until just before he left south Florida to join the family of his eldest daughter in California. Entries are typically terse, but give a brief glimpse of the kind of life he led in Yamato. One of the most dramatic events to be recorded in the diary occurs on its first page, when fire swept through the Kamiya family home on June 3, 1914.\nDaily Life in a Small Florida Town\nYamato was principally a farming community, with a few of the settlers branching out into other commercial endeavors. Leisure activities included family and community gatherings like shooting pool, playing\nhanafuda\n(a card game), and making ice cream at one of the settlers’ homes. Japanese influence on the lives of the settlers was slight. Meals were a combination of Japanese and American fare. The Japanese language was spoken at home only by the adults. Only one of the homes had a Japanese-style bath. Japanese annual events were ignored or were pale shadows of observances in Japan.\nOne Woman’s Story\nThe first woman known to have traveled from Japan to join the Yamato Colony was Sada Sakai, wife of the colony founder. Theirs was an arranged marriage, the wedding taking place within weeks of Jo Sakai’s return to Japan early in 1907, when the two met face-to-face for the first time. Several of the marriages of colony settlers occurred in the same manner. Sada Sakai later confided to her daughters that, on first meeting, their father did not quite match her image of the ideal mate. Furthermore, she had no desire to leave Japan, but her brother convinced her to accept Sakai’s offer of marriage. Arriving in Florida, she found the colony a disappointment after Sakai had apparently described it as larger and more settled.\nYoung Americans\nBy the end of the first decade of the century, families were growing in Yamato, but only with difficulty. The first child born in the colony, Jo Sakai’s son Hiroshi, died before the age of two, and the only family known to have joined the settlement, that of F. Tahara, his French-born wife Claire, and their two children, did not remain for long. Other children, however, soon followed. At last, it seemed as if Sakai’s hope for a stable community would be realized. In fact, Yamato families were hardly more likely to remain rooted than its single men. Of the seven Japanese families known to have resided in Yamato, only two stayed long enough for children to reach adulthood.\nPart III – George Sukeji Morikami\nIn many ways George Sukeji Morikami was typical of the settlers recruited by Yamato’s organizers. He joined the colony at a young age, was unmarried, and did not plan to remain in South Florida for more than a few years. Far from Jo Sakai’s ideal, this profile held little promise for the long-term stability of the colony. Paradoxically, Morikami would become the last of the original colonists to remain in Palm Beach County. Ultimately, his is the classic immigrant’s story — an ambitious young man seeking opportunity travels to America to make a better life for himself. Through hard work and ingenuity George Morikami found prosperity here, achieving a personal worth in the hundreds of thousands, if not millions, of dollars. Despite this, he was a man of simple tastes for whom the trappings of wealth meant little. He preferred to live out his life simply, finding pleasure in his closeness to nature. Toward the end, he lived reclusively in a mobile home on land he had purchased in the closing days of World War II —land that would become Morikami Park.\nA Timeless Gift\nGeorge Morikami acquired much of the land that would become Morikami Park in the closing days of World War II. Almost 20 years later, he began what would become a 10-year campaign to give the land away, first to the city of Delray Beach and later to Palm Beach County. The county finally accepted the elderly farmer’s generous gift in 1973.\nPart IV – The Diminishing South Florida Community\nAlthough property was still owned by some former residents, only three Japanese households existed in the Yamato area by the early 1940s. The dream of a noble experiment that would revolutionize Florida’s agriculture had long been forgotten. As the United States went to war with Japan, Federal Judge John W. Holland signed the order that emphatically ended Yamato’s existence. His action awarded immediate possession of nearly 6,000 acres in the Yamato area to the federal government for creating an Army Air Corps technical training facility.\nNeighbors of the Japanese\nThe Yamato area was previously called Wyman, home to the families of other settlers before the arrival of the Japanese. These families remained in the area as neighbors of the colonists, their children attending school at the one-room Yamato schoolhouse and playing with the children of the Japanese. By the 1920s, a community of Bahamian immigrants had also grown up adjacent to the Japanese colony. During the war years, the Bahamian neighbors of the few remaining Japanese were moved, at government expense, houses and all, to Delray Beach, where they formed a new neighborhood still called New Town today.\nThe Spanish River Papers\nThe Boca Raton Historical Society has reprinted historical newspaper articles and published original correspondence from Jo Sakai and others on the founding of the Yamato Colony in The Spanish River Papers, Volume VII, no. 2 and Volume VI, no. 1. To read these newspaper articles, please click here.\nOur Founder: George Morikami\nMorikami Museum and Japanese Gardens celebrate a more than century-old connection between Japan and South Florida. In the early 1900s, a group of young Japanese farmers arrived in what is now northern Boca Raton and formed an agricultural colony they called Yamato, an ancient name for Japan. The colony’s farming endeavors were ultimately unsustainable. Consequently, almost all original colony members returned to Japan. In the mid-1970s, one of the last remaining settlers, George Sukeji Morikami, then in his 80s, donated his land to Palm Beach County with the wish for it to become a park to preserve the memory of the Yamato Colony.\nTogether with his friends, neighbors, and the Palm Beach County Department of Parks and Recreation, George’s simple dream took on a new dimension. With the opening of the Morikami Museum and Japanese Gardens in 1977, a living monument was created, building a bridge of cultural understanding between George Morikami’s two homelands.",
      "emails": [
        "morikami@pbc.gov"
      ]
    },
    {
      "url": "https://morikami.org/board-of-trustees-biographies/",
      "is_candidate": false,
      "has_email": true,
      "text": "Meet the Morikami Museum and Japanese Gardens Board of Trustees\nWe invite you to get to know both our new and current board members and learn about the people who help shape the future of Morikami Museum and Japanese Gardens. Discover more about each of them below!\nRandal Baker | President\nRandal has been a member of the Morikami Museum and Japanese Gardens Board of Trustees since 1995. Over the past 20+ years, he has held various positions on the board, including Treasurer, 1st Vice President, and President. His current term as Board President began in February 2022.\nRandal moved to Palm Beach County in 1985 after being hired by IBM. He worked in the IBM West Palm Beach sales office until 2001, when he joined Champion Solutions Group, an IBM Reseller in Boca Raton. After two acquisitions, Randal now works for CDW as a Client Executive, overseeing major customers in both South Florida and the New York/New Jersey regions. He has developed a deep passion for the Morikami and remains committed to building the board with like-minded professionals who can help elevate the Museum, while also raising funds to bring the Morikami master plan to fruition.\nRandal served in the United States Air Force before earning Bachelor of Science degrees in Mathematics and Computer Science from Purdue University. He later received an MBA from Nova Southeastern University and continues his education whenever possible. Randal is married to Michael Gallacher, and they have two children, Lilliana and Benny. The family resides in Boynton Beach but enjoys vacationing at their retreats in New Orleans and the Dominican Republic.\nRosie Puello Burkman | Vice-President\nRosie rejoined the Morikami Museum and Japanese Gardens Board of Trustees in 2022. She is deeply passionate about the institution, its culture, and its dedicated team. Rosie has spent over 25 years working at JM Family Enterprises in Deerfield Beach. She is currently Vice President of Corporate Services, where she oversees the company’s philanthropic efforts, focusing on supporting the communities where their associates live and work.\nRosie and her husband, Kent, have been long-time residents of Boca Raton and have two children.\nRobin May | 2nd Vice President\nRobin was elected to the Board of Trustees in 2017. A native New Yorker, Robin learned the value of philanthropy and volunteerism from her parents at an early age. She has long admired Japanese art, history, and literature. Robin became involved with the Morikami due to her appreciation for the positive impact of Japanese culture, especially through programs like Stroll for Well-Being.\nShe is a past president of the Stephen Gaynor School Parents Association in NYC and the Friends Auxiliary of the Boca Raton Museum of Art, where she currently serves on the committee for their Lecture Series. Robin has also served on the boards of the Caring Community of Greenwich Village (NYC) and the Museum of Art, Dadeland, FL. She is currently a member of the committee that organizes Boca Regional Hospital’s annual golf tournament. Robin splits her time between NYC and Boca Raton, FL, and has two grown sons and a daughter-in-law.\nChristine Carton | Secretary / Treasurer\nChristine was born in Lyon, France, and moved to New York City in 1968. There, she worked as a research associate at Columbia Presbyterian Hospital, Sloan Kettering, and Mount Sinai Hospital. In 1990, Christine moved to Boca Raton with her husband, Marvyn, and their son, Jeremy. While Jeremy was a student at Saint Andrews School, Christine was involved with the parents’ association.\nShe joined the Morikami Museum in 1995, becoming an active supporter and serving as a board member for several terms. Christine has led multiple fundraising campaigns, helped create educational programs, and played a key role in founding The Morikami Book Club, which focuses exclusively on Japanese authors and subjects.\nThe trustees are listed alphabetically by first name.\nBob Keady | Trustee\nBob joined the Morikami Museum and Japanese Gardens Board of Trustees in 2024.\nWith a 40-year professional career in Aerospace, Bob had the opportunity to travel extensively worldwide, often visiting Japan. These experiences led him to develop a strong appreciation for the Japanese people and culture, which he believes will add value to his role as a Trustee.\nBob has served on corporate and advisory boards for multinational companies. He graduated from the University of Notre Dame, earned a graduate degree from Purdue University, and is a private pilot with several ratings. Bob is married to Bridget, whom he met in Tokyo, and they have two daughters.\nJuan Nogueras | Trustee\nJuan Nogueras was elected to the Board of Trustees in 2020. “The Morikami is a magical place. The beauty of the gardens and the quality of the exhibitions are invaluable assets to our community. I am proud to have the opportunity to help grow and further develop this remarkable institution.”\nDr. Nogueras is a colorectal surgeon on staff at Cleveland Clinic, Florida, where he has served as Chief of Staff, Chief Medical Officer, and Chairman of the Division of Surgery since joining in 1991. He received his undergraduate education at Princeton University and his medical degree from Jefferson Medical College in Philadelphia, PA.\nJuan resides in Parkland, Florida, with his wife, Michele Ann. They have three adult children and three grandchildren.\nKevin Cooper | Trustee\nKevin joined the Board of Trustees in 2024. He has served on other community trustee boards, including The Boca Raton Museum of Art and the Boca Raton Symphonia. He believes that these institutions are essential for the community today and for future generations.\nOriginally from Knoxville, Tennessee, Kevin has lived in Boca Raton since 1992. He has a family office practice with Raymond James. Kevin is married to Tricia, and they have three children: Austin, Grant, and Emma. The family divides their time between Boca Raton and Diamond Cove, Maine.\nLauren Eder | Trustee\nLauren joined the Board of Trustees of the Morikami Museum and Japanese Gardens in 2024.\nLauren is Professor Emeritus at Rider University, where she taught information systems and international business for over 25 years. She holds a PhD and MBA from Drexel University and a BS from Boston University. As a Fulbright Specialist, she taught the first doctoral seminar in Information Systems at the Universidad de Panama. Another highlight of her career was collaborating with faculty and students in Dong Thap, Vietnam, to create a microcredit program that helped many women start small businesses and learn to save. This program continues to support many families today.\nLauren is involved with several nonprofit boards. Outside her professional interests, she enjoys ceramics, horticulture, and Ikenobo Ikebana, the classical art of Japanese flower arranging. Lauren is married to Scott Eder, and they have two grown children and several grandchildren.\nMickey Rosenzweig | Trustee\nMickey Rosenzweig joined the Morikami Museum and Japanese Gardens Board of Trustees in 2024. He is the Founder, President, and CEO of Rosenzweig Financial Services, a financial practice he established in 1979. With over 40 years of experience, Mickey specializes in life and disability insurance, retirement planning, and estate planning. He has held leadership roles in prominent organizations, such as the Estate Planning Council of New York City and the American College, where he has made significant contributions to the financial services industry.\nIn addition to his professional accomplishments, Mickey has supported several charitable and nonprofit organizations, including the American Cancer Society and State of Israel Bonds. He has received numerous awards for his work in philanthropy and leadership. Mickey’s wealth of experience and commitment to community service make him a valuable asset to the Morikami Board as the Museum continues its mission to share Japanese culture and engage with the community.\nNorma Geller | Trustee\nNorma was first introduced to the Morikami Museum and Japanese Gardens in the winter of 1992 when she and her husband Albert visited Florida from Cleveland, Ohio. At the time, she was undergoing cancer treatment and, between treatments, visited the Museum and prayed by the lake for her recovery. Her prayers were answered, and she has been cancer-free for 32 years. She often says, “My ‘Stroll for Well-Being’ was the lake and prayers.”\nIn March 2000, Norma and Albert became members of the Museum. Over the years, she has volunteered at events, participated in Ikebana classes, and served as a board member for many years. After learning about the need to renovate the library in 2019, she donated the funds for the new Sakai Room in memory of her husband, Albert. The room serves multiple purposes, and Norma is proud to have been involved in transforming the library into a valuable, well-used space. She currently serves on the Museum’s Development Committee and attends board meetings in Florida or via Zoom when in Cleveland.\nNorma is also active with the Israel Tennis and Education Centers, Friendship Circle, and John Carroll University, where she earned her undergraduate degree. She holds a Master’s in Social Work from Case Western Reserve University and served for many years on the Case Comprehensive Cancer Center Board in Cleveland. The Morikami Museum and Gardens holds a special place in her heart, and she says she will always be a member.\nBack to the Contact Us Page",
      "emails": [
        "morikami@pbc.gov"
      ]
    },
    {
      "url": "https://morikami.org/private-event/",
      "is_candidate": false,
      "has_email": true,
      "text": "Morikami Museum and Japanese Gardens has become one of South Florida’s premier rental facilities for an extensive array of social events, from a sunset wedding ceremony overlooking the lake, to cocktails and dinner on the terrace with views of the gardens.  Host a corporate presentation in the theater, or even a special anniversary celebration.\nMorikami provides a distinctive venue for the most discerning hosts. There are romantic sites in the gardens that are ideal for a variety of ceremonies, and Morikami offers many different packages to accommodate parties large and small. In addition, the gardens, which feature several Japanese bridges, waterfalls, and other beautifully landscaped areas, offer a unique backdrop for formal portrait photography.\nWeddings & Ceremonies\n.entry-header\n.wpsp-content-wrap\nwp-show-posts-inner\nPhotography and Videography\n.entry-header\n.wpsp-content-wrap\nwp-show-posts-inner\nSpacing, Fees, & Guidelines\n.entry-header\n.wpsp-content-wrap\nwp-show-posts-inner\nPreferred Vendors\n.entry-header\n.wpsp-content-wrap\nwp-show-posts-inner\nRental Inquiry Form\n.entry-header\n.wpsp-content-wrap\nwp-show-posts-inner\n.wp-show-posts\nWeddings & Ceremonies\n.entry-header\n.wpsp-content-wrap\nwp-show-posts-inner\nPhotography and Videography\n.entry-header\n.wpsp-content-wrap\nwp-show-posts-inner\nSpacing, Fees, & Guidelines\n.entry-header\n.wpsp-content-wrap\nwp-show-posts-inner\nPreferred Vendors\n.entry-header\n.wpsp-content-wrap\nwp-show-posts-inner\nRental Inquiry Form\n.entry-header\n.wpsp-content-wrap\nwp-show-posts-inner\nWeddings & Ceremonies\n.entry-header\n.wpsp-content-wrap\nwp-show-posts-inner\nPhotography and Videography\n.entry-header\n.wpsp-content-wrap\nwp-show-posts-inner\nSpacing, Fees, & Guidelines\n.entry-header\n.wpsp-content-wrap\nwp-show-posts-inner\nPreferred Vendors\n.entry-header\n.wpsp-content-wrap\nwp-show-posts-inner\nRental Inquiry Form\n.entry-header\n.wpsp-content-wrap\nwp-show-posts-inner",
      "emails": [
        "morikami@pbc.gov"
      ]
    },
    {
      "url": "https://morikami.org/upcoming-events/",
      "is_candidate": false,
      "has_email": true,
      "text": "All programs are open for registration on August 1st of each year for the upcoming season. Each season runs from October through the summer of the next year.\nExperience the Garden Early\nMember Morning Walks\nOpen to all Morikami Members\nWe are excited to announce the start of a unique program - Member Morning Walks. This is an exclusive opportunity for our valued members to experience the gardens in the calm of morning, before the hustle and bustle of the day begins.\r\n\r\nEvery Wednesday and Friday, you can escape into the serene beauty of our lush …\n9:00AM, Wednesday, September 3, 2025\nMorikami Gardens\nShow more dates\n9:00AM, Friday, September 5, 2025\nMorikami Gardens\n9:00AM, Wednesday, September 10, 2025\nMorikami Gardens\n9:00AM, Friday, September 12, 2025\nMorikami Gardens\n9:00AM, Wednesday, September 17, 2025\nMorikami Gardens\n9:00AM, Friday, September 19, 2025\nMorikami Gardens\n9:00AM, Wednesday, September 24, 2025\nMorikami Gardens\n9:00AM, Friday, September 26, 2025\nMorikami Gardens\nmore details\nAdult Workshop\nNerikomi Ceramic Workshop\nNerikomi is a hand-building pattern technique made with colored clay, by mixing colored clay and then press it together. “Neri” means to mix, and “komi” means to press. The clay is layered in different patterns to create a block of clay. After, you slice the block into thin layers. Finally, you make a pattern in a repetitive (or abstract) way from these slices to create different objects. In this workshop students will learn in the first class to create a patterned block of two colors of clay. The second class will be dedicated to cut the slabs and transform them into nice trays, plates or vessels.\n10:00AM, Saturday, September 6, 2025\nOki Education Center\nregister here\nShow more dates\n10:00AM, Saturday, October 25, 2025\nOki Education Center\nregister here\n10:00AM, Saturday, June 6, 2026\nOki Education Center\nregister here\nmore details\nCraft activity for kids of all ages\nFamily Fun Day: Sports Day Hachimaki\nStart off the school year strong with a hachimaki, a Japanese headband!\n12:00PM, Saturday, September 6, 2025\nKamiya Room (Classroom A)\nmore details\nTea Ceremony Class\nSado: Beginner I & II\nThursday or Sunday Sessions\nExpand upon your knowledge of Japanese tea ceremony in this hands-on class. Perform traditional Japanese tea ceremony, with its ever-evolving seasonal subtleties, in the authentic Seishin-an Tea House under the guidance of instructor Yoshiko Hardick. The tea ceremony changes from month to month and from season to season.\n10:15AM, Sunday, September 7, 2025\nTea House\nShow more dates\n10:15AM, Thursday, September 11, 2025\nTea House\n10:15AM, Sunday, October 5, 2025\nTea House\n10:15AM, Thursday, October 9, 2025\nTea House\n10:15AM, Sunday, November 2, 2025\nTea House\n10:15AM, Thursday, November 6, 2025\nTea House\n10:15AM, Sunday, December 7, 2025\nTea House\n10:15AM, Thursday, December 11, 2025\nTea House\n10:15AM, Sunday, January 4, 2026\nTea House\n10:15AM, Thursday, January 8, 2026\nTea House\n10:15AM, Monday, February 2, 2026\nTea House\n10:15AM, Thursday, February 5, 2026\nTea House\n10:15AM, Sunday, March 8, 2026\nTea House\n10:15AM, Thursday, March 12, 2026\nTea House\n10:15AM, Sunday, April 12, 2026\nTea House\n10:15AM, Thursday, April 16, 2026\nTea House\n10:15AM, Sunday, May 3, 2026\nTea House\n10:15AM, Thursday, May 7, 2026\nTea House\n10:15AM, Sunday, May 31, 2026\nTea House\n10:15AM, Thursday, June 4, 2026\nTea House\n10:15AM, Sunday, July 5, 2026\nTea House\n10:15AM, Thursday, July 9, 2026\nTea House\n10:15AM, Sunday, September 13, 2026\nTea House\n10:15AM, Thursday, September 17, 2026\nTea House\nmore details\nTea Ceremony Class\nSado: Intermediate Classes\nExpand upon your knowledge of Japanese tea ceremony in this hands-on class. Perform traditional Japanese tea ceremony, with its ever-evolving seasonal subtleties, in the authentic Seishin-an Tea House under the guidance of instructor Yoshiko Hardick. The tea ceremony changes from month to month and from season to season.\n1:00PM, Sunday, September 7, 2025\nTea House\nShow more dates\n1:00PM, Thursday, September 11, 2025\nTea House\n1:00PM, Sunday, October 5, 2025\nTea House\n1:00PM, Thursday, October 9, 2025\nTea House\n1:00PM, Sunday, November 2, 2025\nTea House\n1:00PM, Thursday, November 6, 2025\nTea House\n1:00PM, Sunday, December 7, 2025\nTea House\n1:00PM, Thursday, December 11, 2025\nTea House\n1:00PM, Sunday, January 4, 2026\nTea House\n1:00PM, Thursday, January 8, 2026\nTea House\n1:00PM, Sunday, February 1, 2026\nTea House\n1:00PM, Thursday, February 5, 2026\nTea House\n1:00PM, Sunday, March 8, 2026\nTea House\n1:00PM, Thursday, March 12, 2026\nTea House\n1:00PM, Sunday, April 12, 2026\nTea House\n1:00PM, Thursday, April 16, 2026\nTea House\n1:00PM, Sunday, May 3, 2026\nTea House\n1:00PM, Thursday, May 7, 2026\nTea House\n1:00PM, Sunday, May 31, 2026\nTea House\n1:00PM, Thursday, June 4, 2026\nTea House\n1:00PM, Sunday, July 5, 2026\nTea House\n1:00PM, Thursday, July 9, 2026\nTea House\n1:00PM, Sunday, September 13, 2026\nTea House\n1:00PM, Thursday, September 17, 2026\nTea House\nmore details\nSunset Stroll\n2025 Sunset Stroll Dates and Special Performances:\r\n\r\nSeptember 11, 2025 \r\n\r\n \t\r\n\r\n \t“ The Journey of Japanese Fashion: Heisei (1989–2019) to Reiwa (2019–Present)“ Fashion Show, inspired & hosted by Mirai Con\r\n\r\n\r\n\r\nThis cultural fashion show showcases the evolution of Japanese fashion through the Heisei and Reiwa eras. Expect a visually stunning and informative experience with a Mirai …\n5:30PM, Thursday, September 11, 2025\nMorikami Museum & Japanese Gardens\nPurchase Tickets\nmore details\nAdult Workshop\nKyudo: The Basics of Japanese Archery 101 Workshop\nThe beginners Kyudo workshop will provide an introduction to the equipment used for Kyudo practice as well as the training attire. Those attending will receive instruction in the 8 basic stages required for the correct shooting of a bow. This includes posture, form, and shooting stance. Please note that participants will not be shooting an actual bow and arrow in this workshop, but will be using a Kyudo rubber bow as a beginner.\n10:00AM, Saturday, September 13, 2025\nOki Education Center\nRegister Here\nShow more dates\n10:00AM, Saturday, May 9, 2026\nOki Education Center\nRegister Here\nmore details\nTraditional Japanese Instrument\nKoto Workshop\nKoto is a traditional Japanese stringed instrument first introduced to Japan from China in the 7th-8th centuries. Learn the fascinating history of this exquisite instrument and how to play it in this one-day introductory workshop. Instruments will be provided for participants to use in the workshop. To further your studies on the koto, sign-up for our koto class series or summer guest artist workshops.\n10:30AM, Saturday, September 13, 2025\nMorikami Theater\nRegister Here\nShow more dates\n10:30AM, Saturday, September 12, 2026\nMorikami Theater\nRegister Here\nmore details\nSado: Tea Ceremony Workshop\nOmotesenke School\nThis workshop teaches the basics of sadō – The Way of Tea – necessary to understand the aesthetics of sadō and to fully enjoy the tea ceremony itself. Participants become familiar with how to participate as a guest, how to make a bowl of tea, and serve it.\n1:00PM, Saturday, September 13, 2025\nTea House\nRegister Here\nShow more dates\n1:00PM, Saturday, June 6, 2026\nTea House\nRegister Here\n1:00PM, Saturday, September 26, 2026\nTea House\nRegister Here\nmore details\nThe Art of Bonsai\nBonsai means “a tree in a tray.” The art of bonsai creates the illusion of age and maturity of a tree which has developed and sustained the effects of nature for many years. Students of bonsai learn to artfully trim and train a tree in a container. Beginner and Intermediate Students welcome!\n9:00AM, Sunday, September 28, 2025\nOki Education Center\nShow more dates\n9:00AM, Sunday, November 9, 2025\nOki Education Center\n9:00AM, Sunday, January 4, 2026\nOki Education Center\n9:00AM, Sunday, February 8, 2026\nOki Education Center\n9:00AM, Sunday, March 22, 2026\nOki Education Center\nmore details\nJapanese Traditional Instrument\nKoto Class\nKoto is a traditional Japanese stringed instrument first introduced to Japan from China in the 7th-8th centuries. Learn about the history, culture and techniques in how to play this exquisite instrument in this 5-week course. Instruments will be provided for participants to use in the class.\n10:30AM, Saturday, October 4, 2025\nMorikami Theater\nShow more dates\n10:30AM, Saturday, November 8, 2025\nMorikami Theater\n10:30AM, Saturday, January 10, 2026\nMorikami Theater\n10:30AM, Saturday, February 21, 2026\nMorikami Theater\nmore details\nIntroduction to Japanese Language\nNihongo Language: Level I & II\nSunday Sessions\nThese preliminary levels introduce basic survival Japanese, grammar, and hiragana writing and reading. Topics include, but are not limited to, meeting people, shopping, and dining. Each level has 3 parts (Part 1, Part 2, Part 3) which should be taken sequentially before you can move on to the next level.\n10:15AM, Sunday, October 5, 2025\nIn-Person or Virtual\nShow more dates\n10:15AM, Sunday, January 4, 2026\nIn-Person or Virtual\n10:15AM, Sunday, March 1, 2026\nIn-Person or Virtual\nmore details\nIntroduction to Japanese Language\nNihongo Language: Level III & IV\nSunday Sessions\nLevel III introduces kanji and starts with a review of hiragana and katakana. Part 1 focuses on reading and writing kanji before moving into the textbook in Part 2. Topics include, but are not limited to, planning a trip, talking about past experiences, and getting advice. Part 1-3 sessions of each level should be taken sequentially as a series. Each level has 3 parts (Part 1, Part 2, Part 3) which should be taken sequentially before you can move on to the next level.\r\n\r\nLevel IV, the concluding level uses a more complex sentence structure and introduces new kanji and a review of kanji from previous levels. Topics and grammar points include, but are not limited to, using quotations, expressing potentiality, and making hypothetical statements.\n12:30PM, Sunday, October 5, 2025\nKamiya Room (Classroom A)\nShow more dates\n12:30PM, Sunday, January 4, 2026\nKamiya Room (Classroom A)\n12:30PM, Sunday, March 1, 2026\nKamiya Room (Classroom A)\nmore details\nIkebana Flower Arrangement\nIkebana Ikenobo Class\nFlower arranging, ikebana, is a traditional Japanese art form spanning centuries. Ikebana has various different schools of study, each with unique philosophies and aesthetics. Dating back to the 15th century, the Ikenobo School is the oldest and most traditional. Students in this course learn the basic principles and style of Ikenobo, creating fresh flower arrangements each week to take home and enjoy. Beginners welcome!\n11:00AM, Tuesday, October 7, 2025\nOki Education Center\nShow more dates\n11:00AM, Tuesday, November 4, 2025\nOki Education Center\n11:00AM, Tuesday, December 2, 2025\nOki Education Center\n11:00AM, Tuesday, January 6, 2026\nOki Education Center\n11:00AM, Tuesday, February 3, 2026\nOki Education Center\n11:00AM, Tuesday, March 3, 2026\nOki Education Center\n11:00AM, Tuesday, April 7, 2026\nOki Education Center\n11:00AM, Tuesday, May 5, 2026\nOki Education Center\nmore details\nJapanese Drums\nTaiko Class\nTaiko is a Japanese word, which means a Japanese drumming style, a drum group, drum music and a drum itself. There are a wide variety of shapes and sizes of taiko.  Learn about the history, culture, and techniques of how to play this exquisite instrument in this 5-week course. Instruments will be provided for participants to use in the class.\n2:30PM, Tuesday, October 7, 2025\nMorikami Theater\nShow more dates\n2:30PM, Tuesday, November 11, 2025\nMorikami Theater\n2:30PM, Tuesday, January 6, 2026\nMorikami Theater\n2:30PM, Tuesday, February 17, 2026\nMorikami Theater\n2:30PM, Tuesday, March 31, 2026\nMorikami Theater\nmore details\nIkebana Flower Arrangement\nIkebana Sogetsu Class\nFlower arranging, ikebana, is a traditional Japanese art form spanning centuries. Ikebana has various different schools of study, each with unique philosophies and aesthetics. The Sogetsu School is a contemporary school which focuses on the creativity and individuality of ikebana. The idea is that ikebana can be done by anyone, anywhere, with almost anything. Students will learn the basics of Sogetsu and create pieces each week to take home and enjoy. Beginners and Intermediate students welcome!\n10:30AM, Wednesday, October 8, 2025\nOki Education Center\nShow more dates\n10:30AM, Wednesday, November 5, 2025\nOki Education Center\n10:30AM, Wednesday, December 3, 2025\nOki Education Center\n10:30AM, Wednesday, January 7, 2026\nOki Education Center\n10:30AM, Wednesday, February 4, 2026\nOki Education Center\n10:30AM, Wednesday, March 4, 2026\nOki Education Center\n10:30AM, Wednesday, April 1, 2026\nOki Education Center\n10:30AM, Wednesday, April 29, 2026\nOki Education Center\n10:30AM, Wednesday, May 27, 2026\nOki Education Center\nmore details\nMorikami Book Club\nOpen to all Morikami Members\nEmbark on a thrilling literary journey with Benefactor member Christine Carton and fellow Morikami members as they kick off a brand new season of riveting book explorations!\r\nTo join the Morikami Book Club, please reach out to Christine Carton at christinec@gate.net.\r\nAll meetings will be held on the second Wednesday of each month at 12 pm at …\n12:00PM, Wednesday, October 8, 2025\nMorikami Museum & Japanese Gardens\nShow more dates\n12:00PM, Wednesday, November 12, 2025\nMorikami Museum & Japanese Gardens\n12:00PM, Wednesday, December 10, 2025\nMorikami Museum & Japanese Gardens\n12:00PM, Wednesday, January 14, 2026\nMorikami Museum & Japanese Gardens\n12:00PM, Wednesday, February 11, 2026\nMorikami Museum & Japanese Gardens\n12:00PM, Wednesday, March 11, 2026\nMorikami Museum & Japanese Gardens\n12:00PM, Wednesday, April 8, 2026\nMorikami Museum & Japanese Gardens\n12:00PM, Friday, May 8, 2026\nMorikami Museum & Japanese Gardens\n12:00PM, Wednesday, May 13, 2026\nMorikami Museum & Japanese Gardens\n12:00PM, Wednesday, June 10, 2026\nMorikami Museum & Japanese Gardens\nmore details\nAdult Workshop\nShibori Indigo Workshop\nThe use of indigo dye, or aizome, has a long and cherished history in Japan. The deep blue colors for which Japanese textiles are celebrated come from the leaves of the tade ai, a plant introduced to Japan from China in the sixth century. Shibori is a Japanese technique of manual resist dyeing used to make patterns on fabrics. Learn various shibori techniques and get a chance to make your own shibori creation.\n10:00AM, Saturday, October 11, 2025\nOki Education Center\nRegister Here\nShow more dates\n10:00AM, Saturday, November 15, 2025\nOki Education Center\nRegister Here\n10:00AM, Saturday, February 21, 2026\nOki Education Center\nRegister Here\n10:00AM, Saturday, March 14, 2026\nOki Education Center\nRegister Here\nmore details\nSpanish Haiku Poetry Workshop\nLearn the art of Japanese haiku poetry in Spanish! In this workshop learn how to develop and create your haiku with your Spanish speaking instructor from Cinco Books and using a handy book to help you structure your poem.\r\n2025-2026 Schedule\r\nDate\r\n\r\n \tSaturday, October 11, 2025\r\n\r\nTime\r\n\r\n \t11:00am - 12:00pm\r\n\r\nPrice\r\n\r\n \t$45\r\n\r\nLocation\r\n\r\n \tKamiya Room in the main museum building\r\n\r\nSuggested …\n11:00AM, Saturday, October 11, 2025\nKamiya Room (Classroom A)\nRegister Here\nmore details\nJapanese Traditional Tea Ceremony\nThe Way Of Tea: Sado Demonstration\nObserve Japanese sado, an ever-changing demonstration rich in seasonal subtleties. Your involvement in the true spirit of sado — harmony (wa), reverence (kei), purity (sei), tranquility (jaku) will help you bring a calm perspective into your busy life.\n12:00PM, Saturday, October 11, 2025\nMorikami Theater\nShow more dates\n12:00PM, Saturday, November 15, 2025\nMorikami Theater\n2:00PM, Saturday, December 13, 2025\nMorikami Theater\n12:00PM, Saturday, January 17, 2026\nMorikami Theater\n12:00PM, Saturday, February 7, 2026\nMorikami Theater\n12:00PM, Saturday, March 14, 2026\nMorikami Theater\n12:00PM, Saturday, April 18, 2026\nMorikami Theater\n12:00PM, Saturday, May 16, 2026\nMorikami Theater\nmore details\nAdult Workshop\nButoh Dance Workshop\nButoh, a type of Japanese dance theater came on the scene in 1959 and over the decades has grown beyond Japan and onto the international scene.\n11:00AM, Saturday, October 18, 2025\nMorikami Theater\nRegister Here\nShow more dates\n11:00AM, Saturday, April 11, 2026\nMorikami Theater\nRegister Here\nmore details\nUnderwritten by Linda and Michael Sonnenreich\nFilm: Perfect Days\nHirayama works as a toilet cleaner in Tokyo. He seems content with his simple life. He follows a structured everyday life and dedicates his free time to his passion for music and books. Hirayama also has a fondness for trees and photographs them. More of his past is gradually revealed through a series of unexpected encounters.\n7:00PM, Friday, October 24, 2025\nMorikami Theater\nPurchase Tickets\nmore details\nCraft activity for kids of all ages\nFamily Fun Day: Origami Bat\nBeware of flying bats this Halloween! Learn how to fold your own flying origami komori, bat, for a spooky Halloween\n12:00PM, Saturday, October 25, 2025\nKamiya Room (Classroom A)\nmore details\nAdult Workshop\nIntroduction to the Art of Kintsugi\nClaudia Henao is a glass and floral artist. She is a self-taught artist, with a 20 years career spanning from when she traveled and lived in Europe for around 17 years with her family.  Always surrounded and inspired by nature, her artistic creativity started to include floral design with her glass work a few years ago. Mrs. Henao started mixing glass and natural elements in her work which allows for a very unique and magical experience for the eye. Her creative repertoire encompasses unique botanical pieces like jewelry, huts, glasses, etc.\n10:00AM, Saturday, November 1, 2025\nOki Education Center\nShow more dates\n10:00AM, Saturday, January 24, 2026\nOki Education Center\n10:00AM, Saturday, May 30, 2026\nOki Education Center\nRegister Here\nmore details\nTalk by Artist Mariko Kusumoto\nSpeaker Series: My Creative Journey\nLearn about Kusumoto’s journey as an artist, beginning with her undergraduate studies working in 2-dimensional medium (oil painting and printmaking), and then her 18-year career as a metalsmith, and how she transitioned into working with fabrics.  As new opportunities presented themselves, the direction of her work was able to evolve by allowing her instinct to lead her. Through that evolution her career has been like a journey.\n1:00PM, Friday, November 7, 2025\nMorikami Theater\nmore details\n>\n>>\nAll programs are open for registration on August 1st of each year for the upcoming season. Each season runs from October through the summer of the next year.\nExperience the Garden Early\nMember Morning Walks\nOpen to all Morikami Members\nWe are excited to announce the start of a unique program - Member Morning Walks. This is an exclusive opportunity for our valued members to experience the gardens in the calm of morning, before the hustle and bustle of the day begins.\r\n\r\nEvery Wednesday and Friday, you can escape into the serene beauty of our lush …\n9:00AM, Wednesday, September 3, 2025\nMorikami Gardens\nShow more dates\n9:00AM, Friday, September 5, 2025\nMorikami Gardens\n9:00AM, Wednesday, September 10, 2025\nMorikami Gardens\n9:00AM, Friday, September 12, 2025\nMorikami Gardens\n9:00AM, Wednesday, September 17, 2025\nMorikami Gardens\n9:00AM, Friday, September 19, 2025\nMorikami Gardens\n9:00AM, Wednesday, September 24, 2025\nMorikami Gardens\n9:00AM, Friday, September 26, 2025\nMorikami Gardens\nmore details\nAdult Workshop\nNerikomi Ceramic Workshop\nNerikomi is a hand-building pattern technique made with colored clay, by mixing colored clay and then press it together. “Neri” means to mix, and “komi” means to press. The clay is layered in different patterns to create a block of clay. After, you slice the block into thin layers. Finally, you make a pattern in a repetitive (or abstract) way from these slices to create different objects. In this workshop students will learn in the first class to create a patterned block of two colors of clay. The second class will be dedicated to cut the slabs and transform them into nice trays, plates or vessels.\n10:00AM, Saturday, September 6, 2025\nOki Education Center\nregister here\nShow more dates\n10:00AM, Saturday, October 25, 2025\nOki Education Center\nregister here\n10:00AM, Saturday, June 6, 2026\nOki Education Center\nregister here\nmore details\nCraft activity for kids of all ages\nFamily Fun Day: Sports Day Hachimaki\nStart off the school year strong with a hachimaki, a Japanese headband!\n12:00PM, Saturday, September 6, 2025\nKamiya Room (Classroom A)\nmore details\nTea Ceremony Class\nSado: Beginner I & II\nThursday or Sunday Sessions\nExpand upon your knowledge of Japanese tea ceremony in this hands-on class. Perform traditional Japanese tea ceremony, with its ever-evolving seasonal subtleties, in the authentic Seishin-an Tea House under the guidance of instructor Yoshiko Hardick. The tea ceremony changes from month to month and from season to season.\n10:15AM, Sunday, September 7, 2025\nTea House\nShow more dates\n10:15AM, Thursday, September 11, 2025\nTea House\n10:15AM, Sunday, October 5, 2025\nTea House\n10:15AM, Thursday, October 9, 2025\nTea House\n10:15AM, Sunday, November 2, 2025\nTea House\n10:15AM, Thursday, November 6, 2025\nTea House\n10:15AM, Sunday, December 7, 2025\nTea House\n10:15AM, Thursday, December 11, 2025\nTea House\n10:15AM, Sunday, January 4, 2026\nTea House\n10:15AM, Thursday, January 8, 2026\nTea House\n10:15AM, Monday, February 2, 2026\nTea House\n10:15AM, Thursday, February 5, 2026\nTea House\n10:15AM, Sunday, March 8, 2026\nTea House\n10:15AM, Thursday, March 12, 2026\nTea House\n10:15AM, Sunday, April 12, 2026\nTea House\n10:15AM, Thursday, April 16, 2026\nTea House\n10:15AM, Sunday, May 3, 2026\nTea House\n10:15AM, Thursday, May 7, 2026\nTea House\n10:15AM, Sunday, May 31, 2026\nTea House\n10:15AM, Thursday, June 4, 2026\nTea House\n10:15AM, Sunday, July 5, 2026\nTea House\n10:15AM, Thursday, July 9, 2026\nTea House\n10:15AM, Sunday, September 13, 2026\nTea House\n10:15AM, Thursday, September 17, 2026\nTea House\nmore details\nTea Ceremony Class\nSado: Intermediate Classes\nExpand upon your knowledge of Japanese tea ceremony in this hands-on class. Perform traditional Japanese tea ceremony, with its ever-evolving seasonal subtleties, in the authentic Seishin-an Tea House under the guidance of instructor Yoshiko Hardick. The tea ceremony changes from month to month and from season to season.\n1:00PM, Sunday, September 7, 2025\nTea House\nShow more dates\n1:00PM, Thursday, September 11, 2025\nTea House\n1:00PM, Sunday, October 5, 2025\nTea House\n1:00PM, Thursday, October 9, 2025\nTea House\n1:00PM, Sunday, November 2, 2025\nTea House\n1:00PM, Thursday, November 6, 2025\nTea House\n1:00PM, Sunday, December 7, 2025\nTea House\n1:00PM, Thursday, December 11, 2025\nTea House\n1:00PM, Sunday, January 4, 2026\nTea House\n1:00PM, Thursday, January 8, 2026\nTea House\n1:00PM, Sunday, February 1, 2026\nTea House\n1:00PM, Thursday, February 5, 2026\nTea House\n1:00PM, Sunday, March 8, 2026\nTea House\n1:00PM, Thursday, March 12, 2026\nTea House\n1:00PM, Sunday, April 12, 2026\nTea House\n1:00PM, Thursday, April 16, 2026\nTea House\n1:00PM, Sunday, May 3, 2026\nTea House\n1:00PM, Thursday, May 7, 2026\nTea House\n1:00PM, Sunday, May 31, 2026\nTea House\n1:00PM, Thursday, June 4, 2026\nTea House\n1:00PM, Sunday, July 5, 2026\nTea House\n1:00PM, Thursday, July 9, 2026\nTea House\n1:00PM, Sunday, September 13, 2026\nTea House\n1:00PM, Thursday, September 17, 2026\nTea House\nmore details\nSunset Stroll\n2025 Sunset Stroll Dates and Special Performances:\r\n\r\nSeptember 11, 2025 \r\n\r\n \t\r\n\r\n \t“ The Journey of Japanese Fashion: Heisei (1989–2019) to Reiwa (2019–Present)“ Fashion Show, inspired & hosted by Mirai Con\r\n\r\n\r\n\r\nThis cultural fashion show showcases the evolution of Japanese fashion through the Heisei and Reiwa eras. Expect a visually stunning and informative experience with a Mirai …\n5:30PM, Thursday, September 11, 2025\nMorikami Museum & Japanese Gardens\nPurchase Tickets\nmore details\nAdult Workshop\nKyudo: The Basics of Japanese Archery 101 Workshop\nThe beginners Kyudo workshop will provide an introduction to the equipment used for Kyudo practice as well as the training attire. Those attending will receive instruction in the 8 basic stages required for the correct shooting of a bow. This includes posture, form, and shooting stance. Please note that participants will not be shooting an actual bow and arrow in this workshop, but will be using a Kyudo rubber bow as a beginner.\n10:00AM, Saturday, September 13, 2025\nOki Education Center\nRegister Here\nShow more dates\n10:00AM, Saturday, May 9, 2026\nOki Education Center\nRegister Here\nmore details\nTraditional Japanese Instrument\nKoto Workshop\nKoto is a traditional Japanese stringed instrument first introduced to Japan from China in the 7th-8th centuries. Learn the fascinating history of this exquisite instrument and how to play it in this one-day introductory workshop. Instruments will be provided for participants to use in the workshop. To further your studies on the koto, sign-up for our koto class series or summer guest artist workshops.\n10:30AM, Saturday, September 13, 2025\nMorikami Theater\nRegister Here\nShow more dates\n10:30AM, Saturday, September 12, 2026\nMorikami Theater\nRegister Here\nmore details\nSado: Tea Ceremony Workshop\nOmotesenke School\nThis workshop teaches the basics of sadō – The Way of Tea – necessary to understand the aesthetics of sadō and to fully enjoy the tea ceremony itself. Participants become familiar with how to participate as a guest, how to make a bowl of tea, and serve it.\n1:00PM, Saturday, September 13, 2025\nTea House\nRegister Here\nShow more dates\n1:00PM, Saturday, June 6, 2026\nTea House\nRegister Here\n1:00PM, Saturday, September 26, 2026\nTea House\nRegister Here\nmore details\nThe Art of Bonsai\nBonsai means “a tree in a tray.” The art of bonsai creates the illusion of age and maturity of a tree which has developed and sustained the effects of nature for many years. Students of bonsai learn to artfully trim and train a tree in a container. Beginner and Intermediate Students welcome!\n9:00AM, Sunday, September 28, 2025\nOki Education Center\nShow more dates\n9:00AM, Sunday, November 9, 2025\nOki Education Center\n9:00AM, Sunday, January 4, 2026\nOki Education Center\n9:00AM, Sunday, February 8, 2026\nOki Education Center\n9:00AM, Sunday, March 22, 2026\nOki Education Center\nmore details\nJapanese Traditional Instrument\nKoto Class\nKoto is a traditional Japanese stringed instrument first introduced to Japan from China in the 7th-8th centuries. Learn about the history, culture and techniques in how to play this exquisite instrument in this 5-week course. Instruments will be provided for participants to use in the class.\n10:30AM, Saturday, October 4, 2025\nMorikami Theater\nShow more dates\n10:30AM, Saturday, November 8, 2025\nMorikami Theater\n10:30AM, Saturday, January 10, 2026\nMorikami Theater\n10:30AM, Saturday, February 21, 2026\nMorikami Theater\nmore details\nIntroduction to Japanese Language\nNihongo Language: Level I & II\nSunday Sessions\nThese preliminary levels introduce basic survival Japanese, grammar, and hiragana writing and reading. Topics include, but are not limited to, meeting people, shopping, and dining. Each level has 3 parts (Part 1, Part 2, Part 3) which should be taken sequentially before you can move on to the next level.\n10:15AM, Sunday, October 5, 2025\nIn-Person or Virtual\nShow more dates\n10:15AM, Sunday, January 4, 2026\nIn-Person or Virtual\n10:15AM, Sunday, March 1, 2026\nIn-Person or Virtual\nmore details\nIntroduction to Japanese Language\nNihongo Language: Level III & IV\nSunday Sessions\nLevel III introduces kanji and starts with a review of hiragana and katakana. Part 1 focuses on reading and writing kanji before moving into the textbook in Part 2. Topics include, but are not limited to, planning a trip, talking about past experiences, and getting advice. Part 1-3 sessions of each level should be taken sequentially as a series. Each level has 3 parts (Part 1, Part 2, Part 3) which should be taken sequentially before you can move on to the next level.\r\n\r\nLevel IV, the concluding level uses a more complex sentence structure and introduces new kanji and a review of kanji from previous levels. Topics and grammar points include, but are not limited to, using quotations, expressing potentiality, and making hypothetical statements.\n12:30PM, Sunday, October 5, 2025\nKamiya Room (Classroom A)\nShow more dates\n12:30PM, Sunday, January 4, 2026\nKamiya Room (Classroom A)\n12:30PM, Sunday, March 1, 2026\nKamiya Room (Classroom A)\nmore details\nIkebana Flower Arrangement\nIkebana Ikenobo Class\nFlower arranging, ikebana, is a traditional Japanese art form spanning centuries. Ikebana has various different schools of study, each with unique philosophies and aesthetics. Dating back to the 15th century, the Ikenobo School is the oldest and most traditional. Students in this course learn the basic principles and style of Ikenobo, creating fresh flower arrangements each week to take home and enjoy. Beginners welcome!\n11:00AM, Tuesday, October 7, 2025\nOki Education Center\nShow more dates\n11:00AM, Tuesday, November 4, 2025\nOki Education Center\n11:00AM, Tuesday, December 2, 2025\nOki Education Center\n11:00AM, Tuesday, January 6, 2026\nOki Education Center\n11:00AM, Tuesday, February 3, 2026\nOki Education Center\n11:00AM, Tuesday, March 3, 2026\nOki Education Center\n11:00AM, Tuesday, April 7, 2026\nOki Education Center\n11:00AM, Tuesday, May 5, 2026\nOki Education Center\nmore details\nJapanese Drums\nTaiko Class\nTaiko is a Japanese word, which means a Japanese drumming style, a drum group, drum music and a drum itself. There are a wide variety of shapes and sizes of taiko.  Learn about the history, culture, and techniques of how to play this exquisite instrument in this 5-week course. Instruments will be provided for participants to use in the class.\n2:30PM, Tuesday, October 7, 2025\nMorikami Theater\nShow more dates\n2:30PM, Tuesday, November 11, 2025\nMorikami Theater\n2:30PM, Tuesday, January 6, 2026\nMorikami Theater\n2:30PM, Tuesday, February 17, 2026\nMorikami Theater\n2:30PM, Tuesday, March 31, 2026\nMorikami Theater\nmore details\nIkebana Flower Arrangement\nIkebana Sogetsu Class\nFlower arranging, ikebana, is a traditional Japanese art form spanning centuries. Ikebana has various different schools of study, each with unique philosophies and aesthetics. The Sogetsu School is a contemporary school which focuses on the creativity and individuality of ikebana. The idea is that ikebana can be done by anyone, anywhere, with almost anything. Students will learn the basics of Sogetsu and create pieces each week to take home and enjoy. Beginners and Intermediate students welcome!\n10:30AM, Wednesday, October 8, 2025\nOki Education Center\nShow more dates\n10:30AM, Wednesday, November 5, 2025\nOki Education Center\n10:30AM, Wednesday, December 3, 2025\nOki Education Center\n10:30AM, Wednesday, January 7, 2026\nOki Education Center\n10:30AM, Wednesday, February 4, 2026\nOki Education Center\n10:30AM, Wednesday, March 4, 2026\nOki Education Center\n10:30AM, Wednesday, April 1, 2026\nOki Education Center\n10:30AM, Wednesday, April 29, 2026\nOki Education Center\n10:30AM, Wednesday, May 27, 2026\nOki Education Center\nmore details\nMorikami Book Club\nOpen to all Morikami Members\nEmbark on a thrilling literary journey with Benefactor member Christine Carton and fellow Morikami members as they kick off a brand new season of riveting book explorations!\r\nTo join the Morikami Book Club, please reach out to Christine Carton at christinec@gate.net.\r\nAll meetings will be held on the second Wednesday of each month at 12 pm at …\n12:00PM, Wednesday, October 8, 2025\nMorikami Museum & Japanese Gardens\nShow more dates\n12:00PM, Wednesday, November 12, 2025\nMorikami Museum & Japanese Gardens\n12:00PM, Wednesday, December 10, 2025\nMorikami Museum & Japanese Gardens\n12:00PM, Wednesday, January 14, 2026\nMorikami Museum & Japanese Gardens\n12:00PM, Wednesday, February 11, 2026\nMorikami Museum & Japanese Gardens\n12:00PM, Wednesday, March 11, 2026\nMorikami Museum & Japanese Gardens\n12:00PM, Wednesday, April 8, 2026\nMorikami Museum & Japanese Gardens\n12:00PM, Friday, May 8, 2026\nMorikami Museum & Japanese Gardens\n12:00PM, Wednesday, May 13, 2026\nMorikami Museum & Japanese Gardens\n12:00PM, Wednesday, June 10, 2026\nMorikami Museum & Japanese Gardens\nmore details\nAdult Workshop\nShibori Indigo Workshop\nThe use of indigo dye, or aizome, has a long and cherished history in Japan. The deep blue colors for which Japanese textiles are celebrated come from the leaves of the tade ai, a plant introduced to Japan from China in the sixth century. Shibori is a Japanese technique of manual resist dyeing used to make patterns on fabrics. Learn various shibori techniques and get a chance to make your own shibori creation.\n10:00AM, Saturday, October 11, 2025\nOki Education Center\nRegister Here\nShow more dates\n10:00AM, Saturday, November 15, 2025\nOki Education Center\nRegister Here\n10:00AM, Saturday, February 21, 2026\nOki Education Center\nRegister Here\n10:00AM, Saturday, March 14, 2026\nOki Education Center\nRegister Here\nmore details\nSpanish Haiku Poetry Workshop\nLearn the art of Japanese haiku poetry in Spanish! In this workshop learn how to develop and create your haiku with your Spanish speaking instructor from Cinco Books and using a handy book to help you structure your poem.\r\n2025-2026 Schedule\r\nDate\r\n\r\n \tSaturday, October 11, 2025\r\n\r\nTime\r\n\r\n \t11:00am - 12:00pm\r\n\r\nPrice\r\n\r\n \t$45\r\n\r\nLocation\r\n\r\n \tKamiya Room in the main museum building\r\n\r\nSuggested …\n11:00AM, Saturday, October 11, 2025\nKamiya Room (Classroom A)\nRegister Here\nmore details\nJapanese Traditional Tea Ceremony\nThe Way Of Tea: Sado Demonstration\nObserve Japanese sado, an ever-changing demonstration rich in seasonal subtleties. Your involvement in the true spirit of sado — harmony (wa), reverence (kei), purity (sei), tranquility (jaku) will help you bring a calm perspective into your busy life.\n12:00PM, Saturday, October 11, 2025\nMorikami Theater\nShow more dates\n12:00PM, Saturday, November 15, 2025\nMorikami Theater\n2:00PM, Saturday, December 13, 2025\nMorikami Theater\n12:00PM, Saturday, January 17, 2026\nMorikami Theater\n12:00PM, Saturday, February 7, 2026\nMorikami Theater\n12:00PM, Saturday, March 14, 2026\nMorikami Theater\n12:00PM, Saturday, April 18, 2026\nMorikami Theater\n12:00PM, Saturday, May 16, 2026\nMorikami Theater\nmore details\nAdult Workshop\nButoh Dance Workshop\nButoh, a type of Japanese dance theater came on the scene in 1959 and over the decades has grown beyond Japan and onto the international scene.\n11:00AM, Saturday, October 18, 2025\nMorikami Theater\nRegister Here\nShow more dates\n11:00AM, Saturday, April 11, 2026\nMorikami Theater\nRegister Here\nmore details\nUnderwritten by Linda and Michael Sonnenreich\nFilm: Perfect Days\nHirayama works as a toilet cleaner in Tokyo. He seems content with his simple life. He follows a structured everyday life and dedicates his free time to his passion for music and books. Hirayama also has a fondness for trees and photographs them. More of his past is gradually revealed through a series of unexpected encounters.\n7:00PM, Friday, October 24, 2025\nMorikami Theater\nPurchase Tickets\nmore details\nCraft activity for kids of all ages\nFamily Fun Day: Origami Bat\nBeware of flying bats this Halloween! Learn how to fold your own flying origami komori, bat, for a spooky Halloween\n12:00PM, Saturday, October 25, 2025\nKamiya Room (Classroom A)\nmore details\nAdult Workshop\nIntroduction to the Art of Kintsugi\nClaudia Henao is a glass and floral artist. She is a self-taught artist, with a 20 years career spanning from when she traveled and lived in Europe for around 17 years with her family.  Always surrounded and inspired by nature, her artistic creativity started to include floral design with her glass work a few years ago. Mrs. Henao started mixing glass and natural elements in her work which allows for a very unique and magical experience for the eye. Her creative repertoire encompasses unique botanical pieces like jewelry, huts, glasses, etc.\n10:00AM, Saturday, November 1, 2025\nOki Education Center\nShow more dates\n10:00AM, Saturday, January 24, 2026\nOki Education Center\n10:00AM, Saturday, May 30, 2026\nOki Education Center\nRegister Here\nmore details\nTalk by Artist Mariko Kusumoto\nSpeaker Series: My Creative Journey\nLearn about Kusumoto’s journey as an artist, beginning with her undergraduate studies working in 2-dimensional medium (oil painting and printmaking), and then her 18-year career as a metalsmith, and how she transitioned into working with fabrics.  As new opportunities presented themselves, the direction of her work was able to evolve by allowing her instinct to lead her. Through that evolution her career has been like a journey.\n1:00PM, Friday, November 7, 2025\nMorikami Theater\nmore details\n>\n>>",
      "emails": [
        "christinec@gate.net",
        "morikami@pbc.gov"
      ]
    },
    {
      "url": "https://morikami.org/my-account/subscriptions/",
      "is_candidate": false,
      "has_email": true,
      "text": "How to Renew\nLogin\nUsername or email address\n*\nRequired\nPassword\n*\nRequired\nRemember me\nLog in\nLost your password?\nRegister\nEmail address\n*\nRequired\nA link to set a new password will be sent to your email address.\nSubscribe to our mailing list\nYour personal data will be used to support your experience throughout this website, to manage access to your account, and for other purposes described in our\nprivacy policy\n.\nRegister\nLearn more about the benefits of your membership by visiting our Member FAQs page.\nMember FAQs\nAll Morikami members have access to their membership account via our website. First time users can create a new password and activate their account by clicking the link provided below and following a few simple steps.\nActivate Your Account\nHow to Renew\nLogin\nUsername or email address\n*\nRequired\nPassword\n*\nRequired\nRemember me\nLog in\nLost your password?\nRegister\nEmail address\n*\nRequired\nA link to set a new password will be sent to your email address.\nSubscribe to our mailing list\nYour personal data will be used to support your experience throughout this website, to manage access to your account, and for other purposes described in our\nprivacy policy\n.\nRegister\nLearn more about the benefits of your membership by visiting our Member FAQs page.\nMember FAQs\nAll Morikami members have access to their membership account via our website. First time users can create a new password and activate their account by clicking the link provided below and following a few simple steps.\nActivate Your Account",
      "emails": [
        "morikami@pbc.gov"
      ]
    },
    {
      "url": "https://morikami.org/contact-us",
      "is_candidate": false,
      "has_email": true,
      "text": "General Inquiries\nMain line: (561) 495-0233\nAdmissions: (561)  233-1342\nmorikami@pbc.gov\n4000 Morikami Park Road, Delray Beach, FL 33446\nDepartments\nCornell Cafe\n561- 233-1366 |\ncornellcafe@yahoo.com\nFor catering services please ask for Christy Chen.\nCafe Information:\nhttps://morikami.org/cornell-cafe/\nCuratorial / Exhibitions\nMuseum General Inquiries – Carla Stansifer |\ncstansifer@pbc.gov\n| 561-233-1317\nMuseum Information:\nhttps://morikami.org/museum/\nGarden General Inquiries – Heather Grzybek |\nhgrzybek@pbc.gov\n| 561-233-1359\nGarden Information:\nhttps://morikami.org/gardens/\nPlant Guide:\nRoji-en: A Guide to the Plants\nDonations\nMonetary – Sharyn Samuels |\nssamuels@pbc.gov\n| 561-233-1316\nArt/Artifacts – James Rodgers |\njrodgers@pbc.gov\n| 561-233-1335\nGarden – Heather Grzybek |\nhgrzybek@pbc.gov\n| 561-233-1359\nDONATING TO OUR MUSEUM COLLECTION\nThank you for your interest in donating objects to the permanent collection of the Morikami Museum and Japanese Gardens. Please email the Collections Manager/Registrar,\nJames Rodgers\nwith a picture and a description of what you would like to donate.  He will respond at his earliest convenience.\nEducation\nGeneral Inquiries – Wendy Lo |\nwlo@pbc.gov\n| 561-233-1328\nEducational Program Enrollment & Inquires – Ayano Hamilton |\nahamilton1@pbc.gov\n| 561-233-1367\nOutreach Programs –\npark-mmoutreach@pbc.gov\n|\nStroll for Well-Being Program – Ayano Hamilton |\nmorikamistroll@pbc.gov\n| 561-233-1367\nTour Information – Misuzu Lyden |\nMLyden@pbc.gov\n| 561-233-1330\nFacility Rentals (Weddings & Corporate Events)\nFacility Rental Manager – Alanna Keating | 561-233-1304 |\nakeating@pbc.gov\nFacility Rental Coordinator – Julia Medeiros | 561-233-1305 |\njmedeiros@pbcgov.org\nInformation on Booking a Private Event:\nhttps://morikami.org/private-event/\nPhotography and Videography:\nhttps://morikami.org/photography-and-videography/\nPreferred Vendors:\nhttps://morikami.org/preferred-vendors/\nRental Inquiry Form:\nhttps://morikami.org/rental-inquiry-form/\nSpacing, Fees, & Guidelines:\nhttps://morikami.org/spacing-fees-guidelines/\nWeddings & Ceremonies:\nhttps://morikami.org/weddings-ceremonies/\nFinance\nGeneral Inquiries – Don Blackman |\ndblackman@pbc.gov\n| 561-233-1363\nMarketing\nMarketing & Cultural Events – Miwako Patton |\nmpatton@pbc.gov\n| 561-233-1349\nVisitor Experience & Cultural Events – Lisa Niven |\nlniven@pbc.gov\n| 561-233-1348\nMedia & Press – Sally Shorr |\nsally@thebuzzagency.net\nWebsite – Keven Roustan |\nkroustan@pbc.gov\n| 561-233-1319\nA/V Technician | Joe Angello |\nJAngello@pbc.gov\n| 561-233-1318\nMembership\nGeneral Inquiries – Ginger Solano | 561-233-1315  |\nmorikamimembers@pbc.gov\nMembership Information:\nhttps://morikami.org/join/\nMuseum Store\nGeneral Inquiries – Irene (Chenyun) Zhang | 561-233-1325 |\nCZhang@pbc.gov\nMuseum Store:\nhttps://morikami.org/store/\n| 561-233-1312 |\nmmstore@pbc.gov\nSponsorship\nGeneral Inquiries – Sharyn Samuels | 561-233-1316 |\nssamuels@pbc.gov\nSponsorship Information:\nhttps://morikami.org/donate/#corporate\nVolunteer & Docent Information\nVolunteer Coordinator – Brandon McGowan | 561-233-1331 |\nbmcgowan@pbc.gov\nVolunteer Information:\nhttps://morikami.org/volunteer/\nBoard of Trustees\nPalm Beach County and the Board of Trustees of Morikami, Inc. have been partners in bringing Morikami’s services to the public since opening in 1977. The park and building are the property of Palm Beach County. Morikami Inc., a non-profit corporation, provides financial backing from membership, donations, grants and other revenue-producing activities, and volunteer support for all aspects of the institution’s operations.\nLearn about the Board of Trustees\nOfficers\nRandal J. Baker | President\nBio\nRosie Puello Burkman | Vice President\nBio\nRobin S. May | 2nd Vice President\nBio\nChristine Carton | Secretary / Treasurer\nBio\nTrustees\nBob Keady\nBio\nJuan Nogueras\nBio\nKevin Cooper\nBio\nLauren Eder\nBio\nNorma C. Geller\nBio\nMickey Rosenzweig\nBio\nIndira Persaud | Palm Beach County Representative\nBonnie White-Lemay | Museum Director\nPalm Beach County Commissioners\nCommissioner\nMaria G. Marino, Mayor\n(District 1)\nCommissioner\nSara Baxter, Vice Mayor\n(District 6)\nCommissioner\nGregg K. Weiss\n(District 2)\nCommissioner\nJoel G. Flores\n(District 3)\nCommissioner\nMarci Woodward\n(District 4)\nCommissioner\nMaria Sachs\n(District 5)\nCommissioner\nBobby Powell Jr.\n(District 7)\nPalm Beach County Executive Staff\nVerdenia C. Baker\n, County Administrator\nIsamí C. Ayala-Collazo\n, Assistant County Administrator\nPatrick Rutter\n, Assistant County Administrator\nReginald K. Duren\n, Assistant County Administrator\nTammy Fields\n, Assistant County Administrator\nTodd J. Bonlarron\n, Assistant County Administrator\nJennifer Cirillo\n, Director of Parks & Recreation\nBoard Meetings\nThe Full Board of Trustees meetings will be held on the 3rd Wednesday of every month unless otherwise noted, from\n4:30-6:00 p.m.\nMeetings will take place in the\nSakai Room\nat Morikami.\nMeeting Date\nTime\nJanuary 15\n4:30pm\nFebruary 19\n4:30pm\nMarch 19\n4:30pm\nApril 16 (Annual Meeting and Year-in-Review)\n4:30pm\nMay 21\n4:30pm\nJune 18\n4:30pm\nJuly 16 (Budget Workshop)\n4:30pm\nAugust 20\n4:30pm\nSeptember 17\n4:30pm\nOctober 15\n4:30pm\nNovember 19\n4:30pm\nDecember 10 (2nd Wednesday)\n4:30pm\nCommittee Meetings\nAll dates and times are subject to change and Committee Meetings are set by the chairperson of each committee. If you plan to attend a meeting, please call ahead (561-233-1350) to confirm date, time, and exact location.\nThe\nCommittee on Collections\nmeetings are held on an as needed basis.\nThe\nDevelopment Committee\nmeetings are held on the 2nd Friday of the month at 11:30am.\nThe\nEducation Program & Cultural Events Committee\nmeetings are held on an as needed basis.\nThe\nExecutive Committee\nmeetings are held on an as needed basis.\nThe\nFacilities Committee\nmeetings are held on an as needed basis.\nThe\nGovernance & Scholarship Committee\nmeetings are held on an as needed basis.\nThe\nFinance, Budget, and Endowment Committee\nmeetings are held on the 3rd Wednesday of the month at 3:30pm in Morikami’s Conference Room.\nThe\nBonsai Garden Committee\nmeetings are held on an as needed basis.",
      "emails": [
        "ahamilton1@pbc.gov",
        "akeating@pbc.gov",
        "bmcgowan@pbc.gov",
        "cornellcafe@yahoo.com",
        "cstansifer@pbc.gov",
        "czhang@pbc.gov",
        "dblackman@pbc.gov",
        "hgrzybek@pbc.gov",
        "jangello@pbc.gov",
        "jmedeiros@pbcgov.org",
        "jrodgers@pbc.gov",
        "kroustan@pbc.gov",
        "lniven@pbc.gov",
        "mlyden@pbc.gov",
        "mmstore@pbc.gov",
        "morikami@pbc.gov",
        "morikamimembers@pbc.gov",
        "morikamistroll@pbc.gov",
        "mpatton@pbc.gov",
        "park-mmoutreach@pbc.gov",
        "sally@thebuzzagency.net",
        "ssamuels@pbc.gov"
      ]
    },
    {
      "url": "https://morikami.org/upcoming-events/members-only/",
      "is_candidate": false,
      "has_email": true,
      "text": "Morikami membership offers many benefits, but exclusive invites to members-only events like exhibit opening receptions is one of the most exciting. See below for this season’s members-only events (or check out the event calendar), and come back soon as we add more members-only events throughout the year!\nMember Birthday Discount\nMorikami Book Club\nMember Morning Walks\nNobu Hotel Member Special\nExperience the Garden Early\nMember Morning Walks\nOpen to all Morikami Members\nWe are excited to announce the start of a unique program - Member Morning Walks. This is an exclusive opportunity for our valued members to experience the gardens in the calm of morning, before the hustle and bustle of the day begins.\r\n\r\nEvery Wednesday and Friday, you can escape into the serene beauty of our lush …\n9:00AM, Wednesday, September 3, 2025\nMorikami Gardens\nShow more dates\n9:00AM, Friday, September 5, 2025\nMorikami Gardens\n9:00AM, Wednesday, September 10, 2025\nMorikami Gardens\n9:00AM, Friday, September 12, 2025\nMorikami Gardens\n9:00AM, Wednesday, September 17, 2025\nMorikami Gardens\n9:00AM, Friday, September 19, 2025\nMorikami Gardens\n9:00AM, Wednesday, September 24, 2025\nMorikami Gardens\n9:00AM, Friday, September 26, 2025\nMorikami Gardens\nmore details\nMorikami Book Club\nOpen to all Morikami Members\nEmbark on a thrilling literary journey with Benefactor member Christine Carton and fellow Morikami members as they kick off a brand new season of riveting book explorations!\r\nTo join the Morikami Book Club, please reach out to Christine Carton at christinec@gate.net.\r\nAll meetings will be held on the second Wednesday of each month at 12 pm at …\n12:00PM, Wednesday, October 8, 2025\nMorikami Museum & Japanese Gardens\nShow more dates\n12:00PM, Wednesday, November 12, 2025\nMorikami Museum & Japanese Gardens\n12:00PM, Wednesday, December 10, 2025\nMorikami Museum & Japanese Gardens\n12:00PM, Wednesday, January 14, 2026\nMorikami Museum & Japanese Gardens\n12:00PM, Wednesday, February 11, 2026\nMorikami Museum & Japanese Gardens\n12:00PM, Wednesday, March 11, 2026\nMorikami Museum & Japanese Gardens\n12:00PM, Wednesday, April 8, 2026\nMorikami Museum & Japanese Gardens\n12:00PM, Friday, May 8, 2026\nMorikami Museum & Japanese Gardens\n12:00PM, Wednesday, May 13, 2026\nMorikami Museum & Japanese Gardens\n12:00PM, Wednesday, June 10, 2026\nMorikami Museum & Japanese Gardens\nmore details\nMorikami membership offers many benefits, but exclusive invites to members-only events like exhibit opening receptions is one of the most exciting. See below for this season’s members-only events (or check out the event calendar), and come back soon as we add more members-only events throughout the year!\nMember Birthday Discount\nMorikami Book Club\nMember Morning Walks\nNobu Hotel Member Special\nExperience the Garden Early\nMember Morning Walks\nOpen to all Morikami Members\nWe are excited to announce the start of a unique program - Member Morning Walks. This is an exclusive opportunity for our valued members to experience the gardens in the calm of morning, before the hustle and bustle of the day begins.\r\n\r\nEvery Wednesday and Friday, you can escape into the serene beauty of our lush …\n9:00AM, Wednesday, September 3, 2025\nMorikami Gardens\nShow more dates\n9:00AM, Friday, September 5, 2025\nMorikami Gardens\n9:00AM, Wednesday, September 10, 2025\nMorikami Gardens\n9:00AM, Friday, September 12, 2025\nMorikami Gardens\n9:00AM, Wednesday, September 17, 2025\nMorikami Gardens\n9:00AM, Friday, September 19, 2025\nMorikami Gardens\n9:00AM, Wednesday, September 24, 2025\nMorikami Gardens\n9:00AM, Friday, September 26, 2025\nMorikami Gardens\nmore details\nMorikami Book Club\nOpen to all Morikami Members\nEmbark on a thrilling literary journey with Benefactor member Christine Carton and fellow Morikami members as they kick off a brand new season of riveting book explorations!\r\nTo join the Morikami Book Club, please reach out to Christine Carton at christinec@gate.net.\r\nAll meetings will be held on the second Wednesday of each month at 12 pm at …\n12:00PM, Wednesday, October 8, 2025\nMorikami Museum & Japanese Gardens\nShow more dates\n12:00PM, Wednesday, November 12, 2025\nMorikami Museum & Japanese Gardens\n12:00PM, Wednesday, December 10, 2025\nMorikami Museum & Japanese Gardens\n12:00PM, Wednesday, January 14, 2026\nMorikami Museum & Japanese Gardens\n12:00PM, Wednesday, February 11, 2026\nMorikami Museum & Japanese Gardens\n12:00PM, Wednesday, March 11, 2026\nMorikami Museum & Japanese Gardens\n12:00PM, Wednesday, April 8, 2026\nMorikami Museum & Japanese Gardens\n12:00PM, Friday, May 8, 2026\nMorikami Museum & Japanese Gardens\n12:00PM, Wednesday, May 13, 2026\nMorikami Museum & Japanese Gardens\n12:00PM, Wednesday, June 10, 2026\nMorikami Museum & Japanese Gardens\nmore details",
      "emails": [
        "christinec@gate.net",
        "morikami@pbc.gov"
      ]
    },
    {
      "url": "https://morikami.org/donate/",
      "is_candidate": false,
      "has_email": true,
      "text": "Have a stake in our future – support Morikami Museum and Japanese Gardens. Your contributions support exhibits, educational programs, lectures, demonstrations, and specialized training and maintenance of our Japanese gardens. Help us fulfill our mission by making an investment in our work.\nDonate Online Now\nAnnual Giving\nThe Annual Fund at Morikami Museum and Japanese Gardens provides a vital source of unrestricted income to support every facet of museum activity, from our educational programs, onsite and at schools, to maintaining and expanding the museum’s collection, to presenting diverse and thought-provoking exhibitions and lecture programs of the highest quality. When you make a gift of any size you are providing invaluable support for promoting Japanese culture and for the conservation, protection and presentation of Japanese art.\nWhat your 100% tax-deductible dollars support\n:\nEducation:\nOur educational programs teach not only about the history, art and lifestyle of Japan, they also highlight the contributions and heritage of early immigrants to South Florida, and encourage children to seek similarities, as opposed to differences, in all foreign cultures.\nExhibitions:\nWe are the only museum in the nation devoted specifically to the arts and humanities of Japan, we strive to present innovative exhibits that further understanding and appreciation of all aspects of Japanese art and culture.\nAcquisitions:\nMorikami’s collections committee seeks additional funding to supplement our permanent collection of over 7,000 examples of Japanese fine art, crafts and objects of daily life.\nConservation:\nSpecialists from around the nation help us conserve and repair our valued collection.  Your support of this crucial work will ensure our artifacts receive the care and attention they need.\nCultivation:\nOur specially designed Japanese gardens serve as the background for our colorful festivals attended by tens of thousands of visitors yearly, while also providing healing environments utilized by thousands including those in the wounded warrior program. While there are hundreds of Japanese Gardens in North America, Morikami Museum and Japanese Gardens ranks among the top.\nGifts in Honor or Memory\nCelebrate a loved one with a gift to Morikami Museum and Japanese Gardens. You can recognize a loved one while supporting the collections, exhibitions, and educational programs of Morikami. Your contribution will be acknowledged with a gift card informing the person being honored of your generosity and commitment, or if you wish to remember someone who appreciated Morikami during their lifetime with a memorial gift, your contribution will be acknowledged with a personal gift message to the family or friends you designate. For details, please contact Sharyn Samuels at\n561-233-1316\n.\nGive in Honor or Memory\nNaming Opportunities\nHelping to support the gardens, developing more cultural programs, and improving the lives of our community is made easy through our naming opportunities. You can honor a loved one by naming a space ( like the theater, main gallery, or the lobby), a spot in the garden (such as our front entrance garden, a bridge, gate, lantern, or bench), or even an event, festival or performance. For details, please contact Alanna Keating at\n561-233-1304\n.\nPlanned Giving\nPlanned gifts are an important part of Morikami’s development program. Over the years, bequests of all sizes have played an important role in the growth of Morikami Museum and Japanese Gardens. Without George Sukeji Morikami’s vision and the gift of land, Morikami and its wonderful contribution to our community would not exist. Another significant bequest came from George D. and Harriett W. Cornell, for whom our renowned gardens and café are named. You can also help ensure that future generations are able to experience Morikami through a planned gift. For details, please contact Sharyn Samuels at\n561-233-1316\n.\nCorporate Sponsorship\nCorporations have a long tradition of investing in their local community by supporting the arts. We recognize that economic changes have caused companies to seek multi-faceted partnerships that benefit the community and help market their products or services to a specific audience. Strategic philanthropy is at the heart of the Museum’s corporate partner program. We work closely with our sponsors to build partnerships that provide valuable benefits to the community and increase a company’s visibility with key constituents. Our visitors represent a range of diverse and passionate groups that participate in Morikami’s varied year-round events. Let us build a sponsorship package to meet your specific demographic focus, and we will enthusiastically carry your message to the audience that suits you best.\nWe work closely with our sponsors to build partnerships that provide valuable benefits to the community and increase a company’s visibility with key constituents.\nExposure Opportunities\nRotating and permanent exhibits with diverse and thought-provoking themes, attracting some 200,000 visitors each year.\nLectures featuring world-renowned presenters, partially funded by The National Endowment for the Humanities\nConcerts and special performances that feature artists from the U.S. and Japan.\nYouth programs enriching the lives of 8,500 children each year.\nBenefits\nIn return for providing critical annual support of our programs that serve diverse sections of the community, companies can enjoy many advantages including invitations to VIP events, use of the museum for corporate hospitality, discounts, and, most importantly,\nvisibility\n. For additional information or to discuss a customized campaign for your company, please contact Sharyn Samuels at 561-233-1316.\nDonate to our Collection\nThe Museum currently collects outstanding examples of Japanese visual culture – inclusive of, but not limited to – the areas of painting, prints, textiles, ceramics, sculpture, photography, architecture and design. The museum donation process is a lengthy one. If you have objects for consideration, please send images and contact information to\nMorikami@pbcgov.org\nattention Museum Curator.",
      "emails": [
        "morikami@pbc.gov",
        "morikami@pbcgov.org"
      ]
    }
  ],
  "all_links": [
    "https://morikami.org/job-opportunities/",
    "https://morikami.org/windsocks/",
    "https://morikami.org/tea/",
    "https://morikami.org/stroll/",
    "https://morikami.org/exhibition-merchandise/",
    "https://morikami.org/community/",
    "https://morikami.org/subscribe/",
    "https://morikami.org/board-of-trustees-biographies/#Kevin",
    "https://morikami.org/cornell-cafe/",
    "https://morikami.org/weddings-ceremonies/",
    "https://morikami.org/board-of-trustees-biographies/#Bob",
    "https://morikami.org/bonsai-collection/",
    "https://morikami.org/socks/",
    "https://morikami.org/puzzles/",
    "https://morikami.org/hats/",
    "https://morikami.org/upcoming-events/cultural-demos/",
    "https://morikami.org/event/mori-stories-kamishibai-folktales-2/",
    "https://morikami.org/past-exhibitions/",
    "https://morikami.org/bags-wallets/",
    "https://morikami.org/privacy-policy/",
    "https://morikami.org/tableware/",
    "http://www.morikami.org/upcoming-events/",
    "https://morikami.org/event/virtual-family-fun-days/",
    "https://morikami.org/decor/",
    "https://morikami.org/become-a-sponsor/",
    "https://morikami.org/event-calendar/",
    "http://www.morikami.org/event-calendar/",
    "https://morikami.org/event/koto-workshop/",
    "https://morikami.org/contact-us/",
    "https://morikami.org/event/morikami-book-club/",
    "https://morikami.org/board-of-trustees-biographies/#Mickey",
    "https://morikami.org/store/",
    "https://morikami.org/hours-admission/#getting-here",
    "https://morikami.org/cart/",
    "https://morikami.org/traditional-japanese-clothing/",
    "https://morikami.org/",
    "https://morikami.org/about/",
    "https://morikami.org/photo-policy-and-faqs/",
    "https://morikami.org/donate/#planned",
    "https://morikami.org/home-decor/",
    "https://morikami.org/board-of-trustees-biographies/#Robin",
    "https://morikami.org/online-exhibitions/",
    "https://morikami.org/outreach-ambassador-program/",
    "https://morikami.org/t-shirts/",
    "https://morikami.org/preferred-vendors/",
    "https://morikami.org/tea-house/",
    "https://morikami.org/donate/#collection",
    "https://morikami.org/books/",
    "https://morikami.org/board-of-trustees-biographies/#Christine",
    "https://morikami.org/photography-and-videography/",
    "https://morikami.org/board-of-trustees-biographies/#Rosie",
    "https://morikami.org/donate/#annual-giving",
    "https://morikami.org/board-of-trustees-biographies/",
    "https://morikami.org/birthday-discount-for-morikami-museum-members/",
    "https://morikami.org/personal-care/",
    "https://morikami.org/houseware/",
    "https://morikami.org/plan-your-visit/",
    "https://morikami.org/educational-resources/",
    "https://morikami.org/miscellaneous/",
    "https://morikami.org/yamato-island/",
    "https://morikami.org/rain-chains/",
    "https://morikami.org/jewelry/",
    "https://morikami.org/donate/#corporate",
    "https://morikami.org/books-stationery/",
    "https://morikami.org/origami/",
    "https://morikami.org/gardens/",
    "https://morikami.org/current-exhibitions/",
    "https://morikami.org/traditional-japanese/",
    "https://morikami.org/event/member-morning-walks/",
    "https://morikami.org/roji-en/",
    "https://morikami.org/garden-gallery/",
    "https://morikami.org/private-event/",
    "https://morikami.org/plant-seeds/",
    "https://morikami.org/board-of-trustees-biographies/#Randal",
    "https://morikami.org/board-of-trustees-biographies/#Juan",
    "https://morikami.org/upcoming-events/family-fun/",
    "https://morikami.org/museum/",
    "https://morikami.org/garden/",
    "https://morikami.org/scarves-shawls/",
    "https://morikami.org/asagi-maeda-jewelry/",
    "https://morikami.org/nobu/",
    "https://morikami.org/apparel-accessories/",
    "https://morikami.org/board-of-trustees-biographies/#Norma",
    "https://morikami.org/upcoming-events/",
    "https://morikami.org/board-of-trustees-biographies/#Lauren",
    "https://morikami.org/upcoming-exhibitions/",
    "https://morikami.org/tours/",
    "https://morikami.org/craft-play/",
    "https://morikami.org/donate/#honor",
    "https://morikami.org/wp-login.php?action=logout&redirect_to=https%3A%2F%2Fmorikami.org%2Fmy-account%2F&_wpnonce=12f18834bb",
    "https://morikami.org/roji-en/#designer",
    "https://morikami.org/upcoming-events/special-programs/",
    "https://morikami.org/collections/",
    "https://morikami.org/souvenirs/",
    "https://morikami.org/checkout/",
    "https://morikami.org/fans/",
    "https://morikami.org/spacing-fees-guidelines/",
    "https://morikami.org/event/sunset-stroll/",
    "https://morikami.org/incense/",
    "https://morikami.org/hours-admission/",
    "https://morikami.org/wind-bells/",
    "https://morikami.org/my-account/subscriptions/",
    "https://morikami.org/product/support-morikami/",
    "https://morikami.org/upcoming-events/classes/",
    "https://morikami.org/rental-inquiry-form/",
    "https://morikami.org/my-account/lost-password/",
    "https://morikami.org/yamato-colony/",
    "https://morikami.org/volunteer/",
    "https://morikami.org/upcoming-events/workshops/",
    "https://morikami.org/contact-us",
    "https://morikami.org/upcoming-events/members-only/",
    "https://morikami.org/join/",
    "https://morikami.org/donate/",
    "https://morikami.org/stationery/",
    "https://morikami.org/my-account/"
  ],
  "candidate_links": [
    "https://morikami.org/event-calendar/",
    "https://morikami.org/contact-us/",
    "https://morikami.org/about/",
    "https://morikami.org/board-of-trustees-biographies/",
    "https://morikami.org/private-event/",
    "https://morikami.org/upcoming-events/",
    "https://morikami.org/my-account/subscriptions/",
    "https://morikami.org/contact-us",
    "https://morikami.org/upcoming-events/members-only/",
    "https://morikami.org/donate/"
  ],
  "visited": [
    "http://www.morikami.org/",
    "http://www.morikami.org/about",
    "http://www.morikami.org/contact",
    "http://www.morikami.org/staff",
    "http://www.morikami.org/team",
    "http://www.morikami.org/board",
    "http://www.morikami.org/directory",
    "http://www.morikami.org/events",
    "http://www.morikami.org/sitemap.xml",
    "http://www.morikami.org/council",
    "http://www.morikami.org/leadership",
    "http://www.morikami.org/management",
    "http://www.morikami.org/producers",
    "http://www.morikami.org/support",
    "http://www.morikami.org/crew",
    "http://www.morikami.org/members",
    "http://www.morikami.org/bios",
    "http://www.morikami.org/people",
    "http://www.morikami.org/artists",
    "http://www.morikami.org/musicians",
    "http://www.morikami.org/faculty",
    "http://www.morikami.org/administration",
    "https://morikami.org/event-calendar/",
    "https://morikami.org/contact-us/",
    "https://morikami.org/about/",
    "https://morikami.org/board-of-trustees-biographies/",
    "https://morikami.org/private-event/",
    "https://morikami.org/upcoming-events/",
    "https://morikami.org/my-account/subscriptions/",
    "https://morikami.org/contact-us",
    "https://morikami.org/upcoming-events/members-only/",
    "https://morikami.org/donate/"
  ],
  "base_url": "http://www.morikami.org/"
}