{
  "pages": [
    {
      "url": "https://morninggloryeatery.com/contact-us/",
      "is_candidate": false,
      "has_email": false,
      "text": "Contact Us\nWe Cater! And Deliver Catering to Surrounding Areas.\nGive us a call at\n321.775.5700\nAnyone that goes can feel like its home with the home-cooked meals and friendly welcoming service. Welcome to MORNING GLORY in Satellite Beach, it feels like HOME! It’s a place where family and friends come together for breakfast!\nName\n*\nEmail\n*\nPhone\n*\nMessage\nMorning Glory\nPhone\n: 321-775-5700\nAddress:\n1753 Highway A1A Satellite Beach, FL 33937\nBusiness Hours:\n7 AM to 2 PM (Tuesday – Sunday)\nClosed on Mondays\nHoliday Hours Subject to Change\n– (Check Google for Holiday Hours)",
      "emails": []
    },
    {
      "url": "https://morninggloryeatery.com/about-us/",
      "is_candidate": false,
      "has_email": false,
      "text": "About Us\nOUR STORY:\nMorning Glory Satellite Beach- An opportunity that came up a little unexpectedly. We found out that the neighbor to the north of us was moving into a bigger space up the road and that would leave the “breakfast” spot on the end of the plaza vacant.\nAfter talking about it for a few days, we decided that we could take this opportunity to add another location close to where our original dinner restaurant “Pappagallos” is and get the chance to put in a totally different menu for Satellite Beach Florida Breakfast. The idea for a brunch restaurant seemed like the best idea. We all had experience with breakfast menus from a place we had a few years back,and the decision to totally remodel the place that was vacant and create a brunch spot on the beach was born.\nMorning Glory was the chosen name since the menu will consist of more than just traditional breakfast food. We’ll be adding a charbroil grill for killer burgers, chicken sandwiches and a more extensive coffee menu to accompany Satellite Beach Florida Breakfast on the beach.\nMorning glory will also allow us to accept catering events that we had to previously turned away. You see, next door at Pappagallos, when folks wanted to host a private party at Pappagallos we would have to turn them away. An event with 50 or more people would force us to close the main dining room and that just wouldn’t go over well for our regular dining guests. With the addition of Morning Glory, we look forward to hosting events for our local community for up to 80 people in a private dining room complete with an outside patio deck. Morning Glory will close normally at 3:00 pm in the afternoon so an evening event will be perfect for those folks needing a place for rehearsal dinners, anniversary parties or any kind of event that will bring a large party together whether a brunch or dinner scene works best.\nRemodeling for Morning Glory has become quite an undertaking. When we first went to look at the space we noticed that the restrooms were located in the middle of the building with only one exit to the covered patio directly next to the existing bathroom exits. That just didn’t go with our vision for a bright, open, beachside Satellite Beach Florida Breakfast eatery.Our remodel became a little more involved than we originally planned but we were committed to a long-term plan and not a quick ,sign-change-fresh-coat-of-paint type of remodel. Morning Glory will be totally new from the block walls in fresh relocated restrooms, another window and service door recently added to open up the space and allow patrons more of the gorgeous views of the ocean.\nWhile getting ready for Morning Glory to open, we decided to open next door at Pappagallos for weekend brunch. It’s a chance for us to give a sampling of our upcoming menu and a chance to try new products before we make the leap next door to a full-blown brunch-style and Satellite Beach Florida Breakfast eatery.\nAnother benefit to us being our own neighbor is the ability to host deck parties on the weekend. We will be able to add some live music, keep both patios open serving 2 entirely different menus but allowing our guests to enjoy the same family-friendly environment. Part of the remodel means that even the decor, table tops, and seating will have to be new. Nothing was left behind. Since the space was stripped to the bare walls, literally everything was transformed.\nBeing at Pappagallos over the last 30 years, I have often been asked, “Do you ever go home?” Somewhere along the way, I started answering that with, ”I am home.” Don’t take that the wrong way, but we all spend so much time and effort in what we do that when we get the chance to redo or remodel a restaurant it becomes like building a new space to invite your friends to come hang out. That is why furniture and dining room setup all become so important because we do spend more time at “work” than we spend at home .\nMorning Glory will follow the same example set forth by its older sister restaurant Pappagallo’s. By that, I mean some of the chain restaurants or fancier places you may come across may have nice decor, but it’s the same no matter where you are in the country or even the world. If you recognize the sign, you know what the inside will look like. We don’t work that way. All of us at Pappagallos and Morning Glory really set these places up like we are having friends over for dinner, brunch or a Satellite Beach Florida Breakfast party.\nThe pizza bar at Pappagallos is actually in the dining room so we can see all of our guests coming in and getting to say “Hello” between pies spinning over head. I couldn’t figure out a way to crack eggs at the table for Morning Glory, but a horseshoe shaped bar and a long open window to the kitchen will allow us the ability to greet and see our friends as they come in to see the “new” place.\nDescribing Morning Glory is a little difficult because I’m trying to describe what we are trying to bring to this community without giving away too many details on what we want you to see when we’re ready. I will tell you that we take pride in every detail of what we do. We couldn’t find tables we liked (or tables that we thought fit into our plan) so we decided to build them ourselves. So when you do come in to enjoy a cup of coffee or a fresh made brunch item, keep in mind that everything was made fresh for you right down to the table you’re sitting at.\nMorning Glory has a tentative opening date for October and as equipment has already started to arrive, we are all getting increasingly excited to bring Satellite Beach something just a bit different than what we are accustomed to. Morning Glory will open with a totally different menu than Pappagallo’s made and served, yet it is still made and served by some of the same friendly people you’ve come to know over the years.\nWe look forward to showing our local community our new Satellite Beach Florida Breakfast place and the menu options we know they will enjoy. Thanks again for a great 30 years in the pizza business and here’s to the next 30 years of cracking eggs and flipping pancakes for our friends were having over for brunch.\n-Dave",
      "emails": []
    }
  ],
  "all_links": [
    "https://morninggloryeatery.com/gallery-of-glory/",
    "https://morninggloryeatery.com/thedifference/",
    "https://morninggloryeatery.com/book-a-party/",
    "https://morninggloryeatery.com/testimonials/",
    "https://morninggloryeatery.com/contact-us/",
    "http://morninggloryeatery.com/sitemap/",
    "http://morninggloryeatery.com/beach-cam",
    "https://morninggloryeatery.com/",
    "http://morninggloryeatery.com/menu/",
    "https://morninggloryeatery.com/catering/",
    "https://morninggloryeatery.com/about-us/",
    "https://morninggloryeatery.com/in-the-news/",
    "https://morninggloryeatery.com/now-hiring/"
  ],
  "candidate_links": [
    "https://morninggloryeatery.com/contact-us/",
    "https://morninggloryeatery.com/about-us/"
  ],
  "visited": [
    "http://morninggloryeatery.com/",
    "http://morninggloryeatery.com/about",
    "http://morninggloryeatery.com/contact",
    "http://morninggloryeatery.com/staff",
    "http://morninggloryeatery.com/team",
    "http://morninggloryeatery.com/board",
    "http://morninggloryeatery.com/directory",
    "http://morninggloryeatery.com/events",
    "http://morninggloryeatery.com/sitemap.xml",
    "http://morninggloryeatery.com/council",
    "http://morninggloryeatery.com/leadership",
    "http://morninggloryeatery.com/management",
    "http://morninggloryeatery.com/producers",
    "http://morninggloryeatery.com/support",
    "http://morninggloryeatery.com/crew",
    "http://morninggloryeatery.com/members",
    "http://morninggloryeatery.com/bios",
    "http://morninggloryeatery.com/people",
    "http://morninggloryeatery.com/artists",
    "http://morninggloryeatery.com/musicians",
    "http://morninggloryeatery.com/faculty",
    "http://morninggloryeatery.com/administration",
    "https://morninggloryeatery.com/contact-us/",
    "https://morninggloryeatery.com/about-us/"
  ],
  "base_url": "http://morninggloryeatery.com/"
}