{
  "pages": [
    {
      "url": "https://naplesperformingartscenter.com/contact/",
      "is_candidate": false,
      "has_email": true,
      "text": "Contact Us\nHome\n›\nContact Us\n.breadcrumbs\nAll Content\nPost Container\nContact Us\nNaples Performing Arts Center\n5450 YMCA Road\nNaples, FL 34109\nPhone: 239.325.8789\nBusiness Hours\nMonday – Friday 10 a.m. to 6 p.m.\nSaturday – Appointment Only\nSunday – Closed\nEnd Next / Prev and Social Share\nEnd About the author\nEnd Post Container\nComments Container\nEnd Respond Form\nEnd Comments Container\nEnd blog List",
      "emails": [
        "info@naplesperformingartscenter.com"
      ]
    },
    {
      "url": "https://naplesperformingartscenter.com/teams/",
      "is_candidate": false,
      "has_email": true,
      "text": "teams\nHome\n›\nteams\n.breadcrumbs\nAll Content\nPost Container\nteams\nLori Oliver, President and Founder\nGabriella Bodocs\nJohnny & Lisa PerMar\nLori\nOliver\nPresident and Founder\nLily\nShandro\nDirector of Operations\nEnd Next / Prev and Social Share\nEnd About the author\nEnd Post Container\nComments Container\nEnd Respond Form\nEnd Comments Container\nEnd blog List\nNaples Performing Arts Center\n5450 YMCA Rd\nNaples, FL 34109\nPhone: 239.325.8789",
      "emails": [
        "info@naplesperformingartscenter.com"
      ]
    },
    {
      "url": "https://naplesperformingartscenter.com/category/special-events/",
      "is_candidate": false,
      "has_email": true,
      "text": "Category:\nSpecial Events\nHome\n›\nCategory \"Special Events\"\n.breadcrumbs\nCategory:\nSpecial Events\nAll Content\nWicked Fun! Kids Night!\nImage\nAugust 21, 2025\nNews\n,\nSpecial Events\nadminnpac\nClick Here to Register Friday, September 12th 5:30-8:30PM Ages 4-12 (Must be potty-trained) $35 Minimum of 6 students required.\nDetails\nPerform Like a Broadway Star- Featuring Wicked, The Greatest Showman and Newsies!\nImage\nMay 7, 2025\nActing\n,\nClasses\n,\nMaster Class\n,\nNews\n,\nSpecial Events\nadminnpac\nWork with Broadway performer Michael Lee Brown on perfecting your audition technique! Star of Dear Evan Hansen on Broadway! Has worked and performed with stars like Gaten Matarazzo, Ben Platt, Mike Faist, Jordan Fisher, Sam Pauly, Corbin Bleu, and many others! Perform like a Broadway Star! Acting & Singing for the Stage! Featuring Wicked, The\nDetails\nSounds of Spring 2025\nImage\nMarch 17, 2025\nShowcases\n,\nSpecial Events\nadminnpac\nWhen: Sunday, June 1st What: Our annual spring showcase featuring our talented students! Students who are in private vocal and/or instrumental lessons or in our musical theater department are welcome to perform. There is a $25 participation fee per student and a maximum of two songs/numbers per student allowed. Once registered, you can work with\nDetails\nMaster Classes with Adam Boreland\nImage\nFebruary 10, 2025\nClasses\n,\nDance\n,\nNews\n,\nSpecial Events\n,\nUncategorized\nadminnpac\nHigh Energy Jazz, Contemporary and Ballet with Adam Boreland Adam Boreland has been a part of the professional ballet world for over 15 years. Proud first student of Sell’s Broadway Dance Company. Adam trained at San Francisco Ballet School & Orlando Ballet School. He held professional contracts at Texas Ballet Theater & Orlando Ballet along\nDetails\nDaddy Daughter Dance 2025\nImage\nJanuary 2, 2025\nFundraisers\n,\nNews\n,\nSpecial Events\nadminnpac\nNaples Performing Arts Center presents our annual Daddy-Daughter Dance! Take your daughter on a date! Naples Performing Arts Center’s annual Daddy-Daughter Dance! Games, snacks, meet a princess and win prizes! Don’t miss out on making forever memories! All ages are welcome. $120 entrance fee per duo. $40 for each additional daughter. Saturday, February 8, 2025\nDetails\nJodie Langel Vocal Workshop and Lessons\nImage\nDecember 7, 2024\nActing\n,\nCenterStage\n,\nClasses\n,\nJuniorStage\n,\nMainStage\n,\nMaster Class\n,\nNews\n,\nSpecial Events\nadminnpac\nHow to Belt Like A Broadway Star class is a collaborative class where students learn the tools and fundamentals of how to belt safely and correctly from Broadway actress and Tik Tok star Jodie Langel. Learn how to sing contemporary musical theater and shape vowels correctly and learn to sing like never before and see instant changes! Jodie will work with as many students as possible in the class time provided. Register by January 1st! Workshop\nDetails\nSwiftie Bash\nImage\nNovember 21, 2024\nCenterStage\n,\nDance\n,\nFundraisers\n,\nJuniorStage\n,\nNews\n,\nSpecial Events\nadminnpac\nCelebrate Taylor Swift’s birthday in style at our Swiftie Bash! Join us for a day of dancing, karaoke, and crafting friendship bracelets just like Taylor! Enjoy fun snacks, play games, and make lasting memories with fellow fans. Whether you’re singing your favorite tunes or creating your own Swift-inspired art, there’s something for everyone to enjoy. Come\nDetails\nFall and Winter Camps\nImage\nNovember 5, 2024\nCenterStage\n,\nJuniorStage\n,\nNews\n,\nSpecial Events\n,\nSummer Camps\n,\nWinter Camp\nadminnpac\nNot sure what to do with your child when school is out during fall and winter breaks? Let one of our trained and qualified staff keep them entertained and active all day long! Campers will enjoy our interactive curriculum that includes holiday-themed games, crafts, activities, and more! Holiday Camps at NPAC provide children with safe, fun,\nDetails\nParents Night Out\nImage\nSeptember 9, 2024\nFundraisers\n,\nSpecial Events\nadminnpac\nParents Night Out Parents, enjoy a well-deserved night out! Drop the kids off for a fun-filled evening on Friday, September 13th from 5:30-8:30 PM. For just $35 per child (ages 4-12), they’ll enjoy pizza, crafts, and games! Don’t miss out on this exciting opportunity for some Friday night fun! Click Here to Register Friday, September\nDetails\nThe ERAs Workshop\nImage\nAugust 14, 2024\nActing\n,\nClasses\n,\nJuniorStage\n,\nSpecial Events\nadminnpac\nAn NPAC Acting Academy Class The ERAs Workshop Storytelling through Songs Students will learn how to break apart a song and analyze how to best tell the story that the lyrics convey. This class will teach students strategies about how to dissect lyrics and match their meaning to the story they are meant to tell.\nDetails\nEnd blog List\nPagination\n1\n2\n3\n4\n…\n8\nEnd Pagination\nEnd sidebar\nAll Content",
      "emails": [
        "info@naplesperformingartscenter.com"
      ]
    },
    {
      "url": "https://naplesperformingartscenter.com/staff/",
      "is_candidate": false,
      "has_email": true,
      "text": "Staff & Faculty\nHome\n›\nStaff & Faculty\n.breadcrumbs\nAll Content\nPost Container\nStaff & Faculty\nLori Oliver\nArtistic Director & Founder\nAs a mother of two,\nLori Oliver\nsaw the need to act on her dream to create one place where children could grow their confidence and receive exceptional, classical training in the performing arts.\nLori’s vision and enthusiasm for learning is evident in all aspects of this not-for-profit organization from music and dance lessons to bright lights of the musical theater stage.\nWith a talented team around her, Lori focuses much of her time as director of NPAC’s musical theater program. Recent directing credits include Thoroughly Modern Millie, Chicago, Seussical Jr, Newsies, Matilda and Frozen Jr.\nGrowing up in Dayton, Ohio, Lori attended a school that specialized in the performing arts. She was in her first show, “The King and I,” at age five and continued with lead and ensemble roles through high school. Lori earned a bachelor’s degree in behavioral sciences and psychology from North Central University in Minneapolis. She went on to pursue a master’s degree in educational psychology at Bradley University.\nLori Oliver has added her keen eye for direction to some of southwest Florida’s largest community events. For seven years, Lori directed a local version of “Dancing with the Stars” benefiting Literacy Volunteers of Collier County. She directed entertainment at the 2012 grand opening gala for the Golisano Children’s Museum of Naples, the 2013 American Girl Fashion Show, and the 2015 Patriot Pops performance at Artis—Naples among other big name events.\nIn the summer of 2015, Lori launched “I’m a Star” — the first-of-its-kind program which gives special needs children the opportunity to train in musical theater and feel the joy of performing on stage.\nShe credits her love for the performing arts from years of watching her mom direct a 100 voice choir at her dad’s church.\nLori is married to former NBC2 News Anchor Chad Oliver. The two met while partnering and winning “Best Dance” during the 2011 “Dancing with the Stars” for Literacy. The couples lives in Bonita Springs with two children, Allie and Luke, who both take part in NPAC’s Main Stage Productions.\nLily Jano\nChief Operations Officer\nLily Jano\nis very honored to be a member of the NPAC community. She comes from a background of business administration with a passion for customer service. She loves helping with improving the NPAC experience and watching students experience community through the arts. Lily’s greatest joy and motivation in life is her son, Jordan-Thomas. In her free time she enjoys entertaining, trying new restaurants, spending time with family, and taking Jordan-Thomas to enjoy the world.\nJennifer Murray\nProduction Manager\nJennifer Murray\nhas been involved behind the scenes as a volunteer at NPAC for many years, but is thrilled to finally be joining the team! You may remember her work from our 2016 production of Hairspray where she designed the costumes and set. Jennifer holds a BFA in Design/Technical Theater from Syracuse University and has been working in the industry for over a decade. She has worked in many different positions at various theater companies, including Costume Designer, Wardrobe Supervisor, Props Artisan, Development Coordinator, Event Coordinator and of course, a Production Manager. For the last five years, Jennifer transferred her skills and worked as a Design Assistant at one of the top Interior Design firms in Naples, Collins and Dupont Design Group. She is excited to use her education and experience to help take NPAC to the next level!\nKristina Adamski\nDirector of Dance/ Dance Instructor\nKristina Adamski\ncomes to NPAC with a background in elementary education, a veteran studio owner, dance teacher, choreographer and competition judge. Kristina loves to work with students of all ages and ability levels. She specializes in Tap, Acro, Ballet and Jazz technique. She is the creator of the Prima Dance Curriculum for students and children’s book, “Today in Ballet”. Kristina is excited to be part of the NPAC family and looks forward to building “Pulse Dance”, a dance program for students ages 2 and up.\nLivy LaChance\nAdmin/Production Associate\nLivy LaChance\nis a graduate of Gulf Coast High School and could not be more thrilled to be a part of the NPAC team. With over seven years of experience in musical theatre, Livy has developed a deep passion for all aspects of the performing arts. She has had the joy of performing with NPAC since 2022. Beyond the stage, she also finds great fulfillment in working behind the scenes, such as Stage Managing. Livy values the sense of community and creativity that NPAC brings, and she looks forward to sharing her love for the arts and contributing to an environment where others can thrive and express themselves on and off the stage.\nJanet Dacal\nVocal/Acting Instructor\nJanet Dacal\n(born in\nLos Angeles, California\n) is an American actress, singer, and performer in musical theatre. She received the\nDrama Desk Award\nfor her performance in the\nBroadway\nmusical\nIn the Heights\n.\nIn 2004, Dacal made her Broadway debut in the original cast of\nGood Vibrations\n.\n[4]\nShe then originated the role of\nbeauty salon worker\nCarla in the 2007\noff-Broadway\nmusical\nIn the Heights\n, for which she won a\nDrama Desk Award\n.\n[5]\nDacal reprised this role for the musical’s 2008 Broadway transfer.\n[6]\n[7]\nIn addition to playing Carla, she understudied\nKaren Olivo\nas Vanessa and\nMandy Gonzalez\nas Nina and had gone on for both roles.\n[1]\nShe has appeared in a\nMusicals Tonight!\nconcert in New York City,\n[8]\nand also performed with the cast of\nIn the Heights\nat the “\nBroadway in Bryant Park\n” festival in July 2009.\n[9]\nShe returned to\nIn the Heights\non February 19, 2010, as Nina Rosario, playing her last performance in August 2010.\n[10]\n[11]\nDacal appeared in the\nOff-Broadway\nproduction of\nByzantium\n. Regionally, she has appeared in a\nSouth Florida\nproduction of\nFive Course Love\n, for which she received a\nCarbonell Award\nnomination.\n[12]\nAt the\n2011 Outback Bowl\n, held on January 1, 2011, in\nTampa\n, Florida, Dacal performed “\nThe Star-Spangled Banner\n“.\n[13]\nShe participated in the\nYoung People’s Chorus\nfundraising gala\n, titled\nDreamer\n, at the\nFrederick P. Rose Hall\nin the\nLincoln Center for the Performing Arts\non March 7, 2011.\n[14]\nDacal then starred in several out-of-town tryouts of the musical\nWonderland\n, for which she received encouraging reviews.\n[15]\n[16]\n[17]\nThe\nSarasota Herald-Tribune\nwrote that she had “a strong voice and presence.”\n[18]\nDacal reprised her role as Alice in the\nBroadway\nproduction of the musical at the\nMarquis Theatre\n, which began performances in March 2011.\n[19]\n[20]\nHowever, after negative reviews and bad ticket sales, the production closed on May 15, 2011.\n[21]\nFrom July to November 2017, Dacal starred in the limited-run musical\nPrince of Broadway\nwhere she was a leading performer.\n[22]\nFrom January 3, 2020, until the March 2020\ncoronavirus shutdown\n, Dacal played Dina in the national tour of\nThe Band’s Visit\n. She resumed playing Dina when the tour restarted in autumn 2021.\nDan Dickout, PhD., MMus.\nPiano/Guitar/Viola/Violin/Vocal  Instructor\nDan Dickout\nhas a PhD in Behavioral Life Skills Counseling from International College of Behavioral Counseling and a Master of Music Degree from Boston University. He has taught violin, viola, piano and voice for over 40 years.  In addition to years of private music instruction, Dan spent 12 years as Conservatory of Music Instructor at Norther Lights College in British Columbia, Canada, where he taught college level classes, conducted string ensembles and taught applied music.  Dan has taught students of all ages and is known for his patience and quality results as a music teacher.  Professional Memberships include: National Association of Teachers of Singing, Tampa Bay Chapter Member NATS, American String Teachers Association, Southwest Florida Music Teachers Association, Florida Music Teachers Association, Music Teachers National Association.\nAmanda Massengill\nVocal/Piano Instructor\nAmanda Massengill,\noriginally from Jackson, TN, has been a musician, teacher, and performer for over seventeen years. Her primary instruments are her voice, piano, and conducting. She holds three music degrees from Austin Peay State University in Clarksville, Tennessee and Southern Illinois University in Carbondale, Illinois. In her career, she has performed several roles such as “The Grand Duchess of Monte Blanco” in A Dinner Engagement, “Gretel” from Humperdinck’s Hansel and Gretel, and smaller, choral roles in The Sorcerer and Dido and Aeneas. She has performed as a soloist and chorister in Sydney, Australia, New York City, and rehearsed under the baton of legendary conductors. Currently, she performs regularly with the Naples Philharmonic Chorus in Naples, Florida. In her spare time, Amanda enjoys fitness and nutrition, psychology, interior design, fashion, and sports. Her music tastes vary wildly as she is an avid music lover of all genres and time periods.\nSteven Zvengowski\nPiano/Guitar Instructor\nDr. Steven Zvengrowski\nstarted his music interests at the school where the movie “Fame” was based upon, the High School of Music and Art, NYC. He received a B.S. in music education from the Crane School of Music, SUNY Potsdam, NY; MM in music theory from Indiana University, Bloomington, IN; and Ph.D. in music education/music theory from Northwestern University, Evanston, IL. He is a senior professor and former associate dean and chair of the music department and director of the Hartwick College Summer Music Festival and Institute at Hartwick College, Oneonta, NY. He is also an instructor of music at Blue Ridge Community College (Continuing Education Department and formerly Director of Education at the Brevard Music Center Summer Music Festival and Institute), Brevard, NC. He has taught all levels of music from elementary school to college that includes directing choruses and teaching classes in music education, guitar, piano, music theory, and music history. Steven enjoys teaching at NPAC and working with students of all ages from beginners to advanced.\nMichael Lee Brown\nVocal/Acting Instructor\nMichael Lee Brown\nis a previous Evan Hansen from the six time Tony Award and Grammy winning musical Dear Evan Hansen on Broadway. In addition to playing the title role, he covered the other two male leads (Connor and Jared), and is the first person ever to have performed all three roles on Broadway. Michael has most recently performed Off-Broadway, starring alongside Tony Award winner Judy Kaye in the play “Til Death,” and in various regional theater productions such as: Torch Song Trilogy at the Studio Theater in Washington, DC under the direction of infamous director Michael Kahn. He has been seen on television in shows like Prodigal Son, Happyish, and live performances with the Dear Evan Hansen company at the Macy’s Thanksgiving Day Parade and on The Today Show, where he received an Emmy Award. Michael is a songwriter as well, having enjoyed various sold out concerts at venues like 54 Below, Green Room 42 and Chelsea’s Table & Stage, and has music that premiered on Billboard and can be heard on all streaming services world-wide. His latest song “Storm” has been featured on various music charts.\nKelsey Byalikov\nDance Instructor\nKelsey Byalikov\nis originally from Kalamazoo, MI where she started dancing in her teenage years after being a competitive gymnast. As an award winning competitive dancer she went on to attended The Ailey School in New York City where she studied ballet, pointe, jazz, horton, graham, theater dance, improv, partnering, west african and multiple other styles. This training lead her to a beautiful career of 12 years as a professional dancer! Owing to Kelsey’s extensive training and talent she has most recently performed with the National Tour of Hamilton, where she had the privilege of performing along side Lin Manuel Miranda in Puerto Rico! She was also seen in episodes of Saturday Night Live, The National Tour of Dirty Dancing, worked for companies such as Disney and Holland America Cruise Line, and performed in multiple shows throughout Las Vegas. Kelsey is excited to share her knowledge and passion with the next groups of rising stars!\nSierra Williams\nI’m a STAR Instructor\nSierra Williams\nis a first grade teacher and childhood dancer, born and raised in Naples, Florida. She began her dance journey at the age of 7 where she developed a deep love for movement, discipline, and expression. After 7 years in the classroom, Sierra has expanded her role to teach dance to children with special needs, a space where her passion for inclusion and creativity truly come to life. With a background in early childhood education and a heart for empowering every child, Sierra believes in the magic that happens when learning and movement meet.\nRobin Azzopardi\nProjectionist\nRobin Azzopardi\ngrew up in New York and started dancing at the age of 3.  She became a student dance teacher by the time she was 12.  She has performed in many shows and absolutely loves the world of performance!  Robin attended Southern Connecticut State University in New Haven, CT where she majored in Business Administration.  Robin moved to Naples in 2008 with her husband Dave and 2 daughters, Julia and Sarah.  Robin made her NPAC stage debut July 2021 in the production of Godspell as Lazarus.  She looks forward to making her next stage appearance!\nEnd Next / Prev and Social Share\nEnd About the author\nEnd Post Container\nComments Container\nEnd Respond Form\nEnd Comments Container\nEnd blog List\nNaples Performing Arts Center\n5450 YMCA Rd\nNaples, FL 34109\nPhone: 239.325.8789",
      "emails": [
        "info@naplesperformingartscenter.com"
      ]
    },
    {
      "url": "https://naplesperformingartscenter.com/about-im-a-star/",
      "is_candidate": false,
      "has_email": true,
      "text": "About “I’m a STAR”\nHome\n›\nAbout “I’m a STAR”\n.breadcrumbs\nAll Content\nPost Container\nAbout “I’m a STAR”\nI’m a STAR\nNPAC’s Musical Theater Program\nFor people with physical and intellectual challenges\nClick Here to Watch NPAC’s I’m a STAR special spotlight on NBC2 (November 2018)\nNaples – There wasn’t a dry eye in the theater during June’s\nI’m a Star\nperformances\nat Naples Performing Arts Center.  “These are the most beautiful people I’ve ever met,” said a tearful Lori Oliver, founder & CEO of Naples Performing Arts Center.  “These children and adults have the chance to challenge themselves in the awesome Special Olympics program, but they don’t have the opportunity to shine on the stage. I wanted to give them the opportunity to be a star!”\nOliver started the\nI’m a Star program\nin 2015 to give students with intellectual challenges not only the ability to perform for friends and family, but also to learn theater vocabulary, choreography, and team work.\nEach participant chose what they would like to work on during the six week training program.  Through a combination of Oliver’s direction and Broadway Buddies, young mentors from Naples Performing Arts Center’s musical theater company, participants performed acts that included smash hits from musical theater, challenging ballroom dance numbers, and even standup comedy!\nTickets for the initial showing quickly sold-out.  Sixty people were turned away at the door, so Oliver added a second encore performance. Lizzy Castro, one of the participants stated, “We really are stars!”\nThis summer,\nI’m a Star\ngrew to 30 participants, ranging in age from 11 to 52.\nThe\nI’m a Star\nstudents and Broadway Buddies would end every rehearsal in a huddle. “All hands in”, shouted Oliver.  “On three, 1…2…3…”  and with a loud and excited roar all would yell, “I’m a Star!”  Mission accomplished!\nNaples Performing Arts Center is a not-for-profit 501(c)(3) organization which offers\nI’m a Star\nfree of charge to participants through generous community support.  NPAC is currently raising money to offer year-round curriculum and performance opportunities for\nI’m a Star.\nEnd Next / Prev and Social Share\nEnd About the author\nEnd Post Container\nComments Container\nEnd Respond Form\nEnd Comments Container\nEnd blog List\nNaples Performing Arts Center\n5450 YMCA Rd\nNaples, FL 34109\nPhone: 239.325.8789",
      "emails": [
        "info@naplesperformingartscenter.com"
      ]
    },
    {
      "url": "https://naplesperformingartscenter.com/about-npac/",
      "is_candidate": false,
      "has_email": true,
      "text": "About NPAC\nHome\n›\nAbout NPAC\n.breadcrumbs\nAll Content\nPost Container\nAbout NPAC\nEstablished in 2012, The Naples Performing Arts Center provides excellence in arts education through a diverse curriculum, while fostering creativity, building self-esteem, developing our students’ love for the arts and equipping them with life skills.\nAll students, regardless of their ethnicity, intellectual capabilities and financial status, should have the opportunity to participate in the arts and develop these life skills. NPAC was started in 2012 by Founder and President,\nLori Oliver\n. She believes in providing the community with a venue for children to have access to performing arts education. NPAC offers a School of Dance, School of Drama and the School of Music where students can develop their skills and talents.\nNPAC also offers a year round program for\nstudents with special needs\n. The “I’m a Star” program gives students with intellectual challenges numerous opportunities to be “stars” and shine on the stage. Every week they are challenged with their music theory curriculum, vocal and acting classes, and specially designed choreography. Every child should have the opportunity to be a STAR!\nNPAC has the privilege of going into local classrooms to fill the gap where the arts programs have been removed. For example, Oliver spent a considerable amount of time in Immokalee after seeing the complete lack of artistic opportunities. She taught students there how to audition and awarded 20 gifted children the opportunity to train at NPAC. We are honored to have students from Immokalee High participating in our current production of “Hairspray” with 100% scholarships!\nNPAC has provided transportation to our theater and back two times a week for each of these students. These young people are incredibly talented and they have huge dreams to be singers, piano players, stage performers – but they do not have the resources to receive the training to accomplish those dreams. Many of these students never could have imagined that a place like NPAC would believe in them enough to give them these kinds of opportunities. With the help and support of our community, we can make these dreams come true for these children.\nThis is just the beginning of what NPAC is going to do. We hope you will catch the vision and join us in making a difference in the lives of so many children.\nIn 2015 NPAC became a 501(c)(3) non-for- profit organization. We now offer performing arts education to all people in the SWFL community!\nEnd Next / Prev and Social Share\nEnd About the author\nEnd Post Container\nComments Container\nEnd Respond Form\nEnd Comments Container\nEnd blog List\nNaples Performing Arts Center\n5450 YMCA Rd\nNaples, FL 34109\nPhone: 239.325.8789",
      "emails": [
        "info@naplesperformingartscenter.com"
      ]
    },
    {
      "url": "https://www.facebook.com/lorimichelleoliver?fref=ts",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    },
    {
      "url": "https://www.facebook.com/naplesperformingartscenter/?fref=ts",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    }
  ],
  "all_links": [
    "https://naplesperformingartscenter.com/music/violinviola-lessons/",
    "https://naplesperformingartscenter.com/contact/",
    "https://naplesperformingartscenter.com/wp-content/uploads/2025/06/FRONT-3.png",
    "https://naplesperformingartscenter.com/faq/",
    "https://naplesperformingartscenter.com/2025/08/wicked-fun-kids-night/",
    "https://naplesperformingartscenter.com/music/voice-lessons/",
    "https://naplesperformingartscenter.com/category/shows/dance-shows/",
    "https://naplesperformingartscenter.com/music/music-policies-procedures/",
    "https://naplesperformingartscenter.com/auditions-2/",
    "https://naplesperformingartscenter.com/music/",
    "https://naplesperformingartscenter.com/teams/",
    "https://naplesperformingartscenter.com/drama/theater-policies-procedures/",
    "https://naplesperformingartscenter.com/cast-resources/",
    "https://naplesperformingartscenter.com/news-2/",
    "https://naplesperformingartscenter.com/category/special-events/",
    "https://naplesperformingartscenter.com/wp-content/uploads/2025/08/musical-theatre-dance-class-banner-ad.png",
    "https://naplesperformingartscenter.com/donate-to-npac/",
    "https://naplesperformingartscenter.com/category/classes/",
    "https://naplesperformingartscenter.com/2020/09/sponsorships/",
    "https://naplesperformingartscenter.com/wp-content/uploads/2025/08/wicked-ad-banner.png",
    "https://naplesperformingartscenter.com/staff/",
    "https://naplesperformingartscenter.com/im-a-star/",
    "https://naplesperformingartscenter.com/music/piano-lessons/",
    "https://naplesperformingartscenter.com/music/guitar-lessons/",
    "https://naplesperformingartscenter.com/about-im-a-star/",
    "https://naplesperformingartscenter.com/faculty/lori/",
    "https://naplesperformingartscenter.com/category/shows/juniorstage/",
    "https://naplesperformingartscenter.com/annie-jr-auditions/",
    "https://naplesperformingartscenter.com/news/",
    "https://naplesperformingartscenter.com/",
    "https://naplesperformingartscenter.com/local-entertainment/",
    "https://naplesperformingartscenter.com/dance/",
    "https://naplesperformingartscenter.com/adult-dance-class/",
    "https://naplesperformingartscenter.com/2022-summer-season-auditions/",
    "https://naplesperformingartscenter.com/about-npac/",
    "https://naplesperformingartscenter.com/drama/",
    "https://naplesperformingartscenter.com/volunteer-at-npac/",
    "https://naplesperformingartscenter.com/school-of-rock-auditions/",
    "https://naplesperformingartscenter.com/mainstageauditions/",
    "https://naplesperformingartscenter.com/category/news/",
    "https://naplesperformingartscenter.com/2021/02/ymcapartnership/",
    "https://naplesperformingartscenter.com/category/shows/",
    "https://naplesperformingartscenter.com/newsies-cast-resources/",
    "https://naplesperformingartscenter.com/index/",
    "https://naplesperformingartscenter.com/slider-test-page/",
    "https://naplesperformingartscenter.com/2025/08/musical-theater-dance-class/",
    "https://naplesperformingartscenter.com/pippin-choreo-videos/",
    "https://naplesperformingartscenter.com/2021/10/were-hiring/",
    "https://naplesperformingartscenter.com/2025/08/im-a-star-dance/",
    "https://naplesperformingartscenter.com/category/classes/dance/",
    "https://naplesperformingartscenter.com/2020/05/npac-media/",
    "https://naplesperformingartscenter.com/sponsors/",
    "https://naplesperformingartscenter.com/become-a-sponsor/",
    "https://naplesperformingartscenter.com/a-chorus-line-private-information/",
    "https://naplesperformingartscenter.com/drama/private-acting-lessons/",
    "https://naplesperformingartscenter.com/music/trumpetandsaxophone-lessons/",
    "https://naplesperformingartscenter.com/category/shows/auditions/",
    "https://naplesperformingartscenter.com/contact/faqs/",
    "https://naplesperformingartscenter.com/2025/07/pulse-dance-fall-2025/",
    "https://naplesperformingartscenter.com/staff/gabriella/",
    "https://naplesperformingartscenter.com/jtf-2023/",
    "https://naplesperformingartscenter.com/staff/johnny-lisa/",
    "https://naplesperformingartscenter.com/thank-you-for-signing-up/",
    "https://naplesperformingartscenter.com/?page_id=1278&preview=true"
  ],
  "candidate_links": [
    "https://naplesperformingartscenter.com/contact/",
    "https://naplesperformingartscenter.com/teams/",
    "https://naplesperformingartscenter.com/category/special-events/",
    "https://naplesperformingartscenter.com/staff/",
    "https://naplesperformingartscenter.com/about-im-a-star/",
    "https://naplesperformingartscenter.com/about-npac/",
    "https://www.facebook.com/lorimichelleoliver?fref=ts",
    "https://www.facebook.com/naplesperformingartscenter/?fref=ts"
  ],
  "visited": [
    "http://www.naplesperformingartscenter.com/",
    "http://www.naplesperformingartscenter.com/about",
    "http://www.naplesperformingartscenter.com/contact",
    "http://www.naplesperformingartscenter.com/staff",
    "http://www.naplesperformingartscenter.com/team",
    "http://www.naplesperformingartscenter.com/board",
    "http://www.naplesperformingartscenter.com/directory",
    "http://www.naplesperformingartscenter.com/events",
    "http://www.naplesperformingartscenter.com/sitemap.xml",
    "http://www.naplesperformingartscenter.com/council",
    "http://www.naplesperformingartscenter.com/leadership",
    "http://www.naplesperformingartscenter.com/management",
    "http://www.naplesperformingartscenter.com/producers",
    "http://www.naplesperformingartscenter.com/support",
    "http://www.naplesperformingartscenter.com/crew",
    "http://www.naplesperformingartscenter.com/members",
    "http://www.naplesperformingartscenter.com/bios",
    "http://www.naplesperformingartscenter.com/people",
    "http://www.naplesperformingartscenter.com/artists",
    "http://www.naplesperformingartscenter.com/musicians",
    "http://www.naplesperformingartscenter.com/faculty",
    "http://www.naplesperformingartscenter.com/administration",
    "https://naplesperformingartscenter.com/contact/",
    "https://naplesperformingartscenter.com/teams/",
    "https://naplesperformingartscenter.com/category/special-events/",
    "https://naplesperformingartscenter.com/staff/",
    "https://naplesperformingartscenter.com/about-im-a-star/",
    "https://naplesperformingartscenter.com/about-npac/",
    "https://www.facebook.com/lorimichelleoliver?fref=ts",
    "https://www.facebook.com/naplesperformingartscenter/?fref=ts"
  ],
  "base_url": "http://www.naplesperformingartscenter.com/"
}