{
  "pages": [
    {
      "url": "https://naplespicasso.com/events/list/?eventDisplay=past",
      "is_candidate": false,
      "has_email": true,
      "text": "naplespicasso@gmail.com\n239-297-0352\nFacebook-f\nInstagram\nVisitors\nArt Show Calender\nFAQ – Visitors\nArtists\nArt Show Calender\nHow to Apply – Artists\nDisplay Requirements Art Festival\nSpace Numbers\nPhoto Gallery\nFAQ – Artists\nArtist Network\nSPONSORS and PARTNERS\nEXHIBITOR GALLERY\nCONTACTS\nMenu\nVisitors\nArt Show Calender\nFAQ – Visitors\nArtists\nArt Show Calender\nHow to Apply – Artists\nDisplay Requirements Art Festival\nSpace Numbers\nPhoto Gallery\nFAQ – Artists\nArtist Network\nSPONSORS and PARTNERS\nEXHIBITOR GALLERY\nCONTACTS\n6 events found.\nEvents Search and Views Navigation\nSearch\nEnter Keyword. Search for Events by Keyword.\nFind Events\nEvent Views Navigation\nList\nList\nMonth\nDay\nToday\n1/27/2024\nJanuary 27, 2024\n-\n9/6/2025\nNow\nSelect date.\nJanuary 2024\nSat\n27\nFeatured\nJanuary 27, 2024 @ 10:00\n-\n18:00\nMercato Art Celebration\nMercato Naples\n9110 Strada Pl, Naples, United States\nExperience the sophisticated, fun, and vibrant Mercato Art Celebration Art Show hosted by Naples Picasso Events. This all-day extravaganza offers Naples residents and visitors the perfect blend of shopping under the sunshine and memorable evenings filled with dining, drinks, entertainment, and captivating Fine Art from renowned national and international artists. Immerse yourself in an atmosphere […]\nFree\nSun\n28\nFeatured\nJanuary 28, 2024 @ 9:00\n-\n15:00\nMercato Art Celebration\nMercato Naples\n9110 Strada Pl, Naples, United States\nExperience the sophisticated, fun, and vibrant Mercato Art Celebration Art Show hosted by Naples Picasso Events. This all-day extravaganza offers Naples residents and visitors the perfect blend of shopping under the sunshine and memorable evenings filled with dining, drinks, entertainment, and captivating Fine Art from renowned national and international artists. Immerse yourself in an atmosphere […]\nFree\nMarch 2024\nSat\n16\nMarch 16, 2024 @ 10:00\n-\n18:00\nBayfront Art Show\nBayfront Naples\n465 Bayfront Place, Naples, FL, United States\nStep right up! Dive into a world bursting with color and creativity. From hometown heroes to global art rockstars, we've got it all: vibrant paintings, cool ceramics, digital masterpieces, and more unique finds than you can imagine. Bayfront is rolling out the red carpet for you! We’re shutting down the streets so you can stroll, […]\nFree\nSun\n17\nMarch 17, 2024 @ 10:00\n-\n18:00\nBayfront Art Show\nBayfront Naples\n465 Bayfront Place, Naples, FL, United States\nStep right up! Dive into a world bursting with color and creativity. From hometown heroes to global art rockstars, we've got it all: vibrant paintings, cool ceramics, digital masterpieces, and more unique finds than you can imagine. Bayfront is rolling out the red carpet for you! We’re shutting down the streets so you can stroll, […]\nFree\nJanuary 2025\nSat\n25\nJanuary 25 @ 10:00\n-\nJanuary 26 @ 17:00\n2nd Annual Mercato Art Celebration\nMercato Naples\n9110 Strada Pl, Naples, United States\nExperience the sophisticated, fun, and vibrant 2nd Annual Mercato Art Celebration Art Show hosted by Naples Picasso Events. This all-day extravaganza offers Naples residents and visitors the perfect blend of shopping under the sunshine and memorable evenings filled with dining, drinks, entertainment, and captivating Fine Art from renowned national and international artists. Come to the […]\nMarch 2025\nSat\n29\nMarch 29 @ 10:00\n-\nMarch 30 @ 16:00\nLongboat Key Art Splash\nLongboat Key Art Splash\n600 Bay Isles Road, Longboat Key, FL, United States\nPrepare to experience the vibrant and engaging Longboat Key Town Center Green! Conveniently located near Publix on Bay Isles Road (600 Bay Isles Road, Longboat Key, FL 34228 TOWNCENTER GREEN), this public space is the ideal venue for a community festival. With a beautiful park area, you’ll have ample space to relax and enjoy the […]\nPrevious\nEvents\nToday\nNext\nEvents\nSubscribe to calendar\nGoogle Calendar\niCalendar\nOutlook 365\nOutlook Live\nExport .ics file\nExport Outlook .ics file\nThis calendar is powered by The Events Calendar.\nhttp://evnt.is/18wn\nFeatured\nJanuary 27, 2024 @ 10:00\n-\n18:00\nMercato Art Celebration\nMercato Naples\n9110 Strada Pl, Naples, United States\nExperience the sophisticated, fun, and vibrant Mercato Art Celebration Art Show hosted by Naples Picasso Events. This all-day extravaganza offers Naples residents and visitors the perfect blend of shopping under the sunshine and memorable evenings filled with dining, drinks, entertainment, and captivating Fine Art from renowned national and international artists. Immerse yourself in an atmosphere […]\nFree\nFeatured\nJanuary 28, 2024 @ 9:00\n-\n15:00\nMercato Art Celebration\nMercato Naples\n9110 Strada Pl, Naples, United States\nExperience the sophisticated, fun, and vibrant Mercato Art Celebration Art Show hosted by Naples Picasso Events. This all-day extravaganza offers Naples residents and visitors the perfect blend of shopping under the sunshine and memorable evenings filled with dining, drinks, entertainment, and captivating Fine Art from renowned national and international artists. Immerse yourself in an atmosphere […]\nFree\nMarch 16, 2024 @ 10:00\n-\n18:00\nBayfront Art Show\nBayfront Naples\n465 Bayfront Place, Naples, FL, United States\nStep right up! Dive into a world bursting with color and creativity. From hometown heroes to global art rockstars, we've got it all: vibrant paintings, cool ceramics, digital masterpieces, and more unique finds than you can imagine. Bayfront is rolling out the red carpet for you! We’re shutting down the streets so you can stroll, […]\nFree\nMarch 17, 2024 @ 10:00\n-\n18:00\nBayfront Art Show\nBayfront Naples\n465 Bayfront Place, Naples, FL, United States\nStep right up! Dive into a world bursting with color and creativity. From hometown heroes to global art rockstars, we've got it all: vibrant paintings, cool ceramics, digital masterpieces, and more unique finds than you can imagine. Bayfront is rolling out the red carpet for you! We’re shutting down the streets so you can stroll, […]\nFree\nJanuary 25 @ 10:00\n-\nJanuary 26 @ 17:00\n2nd Annual Mercato Art Celebration\nMercato Naples\n9110 Strada Pl, Naples, United States\nExperience the sophisticated, fun, and vibrant 2nd Annual Mercato Art Celebration Art Show hosted by Naples Picasso Events. This all-day extravaganza offers Naples residents and visitors the perfect blend of shopping under the sunshine and memorable evenings filled with dining, drinks, entertainment, and captivating Fine Art from renowned national and international artists. Come to the […]\nMarch 29 @ 10:00\n-\nMarch 30 @ 16:00\nLongboat Key Art Splash\nLongboat Key Art Splash\n600 Bay Isles Road, Longboat Key, FL, United States\nPrepare to experience the vibrant and engaging Longboat Key Town Center Green! Conveniently located near Publix on Bay Isles Road (600 Bay Isles Road, Longboat Key, FL 34228 TOWNCENTER GREEN), this public space is the ideal venue for a community festival. With a beautiful park area, you’ll have ample space to relax and enjoy the […]\nJOIN US\nBecome an Exhibitor\nBecome a Sponsor\nBecome a Food Vendor\nTestimonials\nQUICK LINKS\nAbout Us\nZapplication\nPrivacy Policy\nArtist Network\nCONTACT\n2321 Davis Blvd. Naples, FL 34104\n239-297-0352\nnaplespicasso@gmail.com\nFacebook-f\nInstagram\nJOIN US\nBecome an Exhibitor\nBecome a Sponsor\nBecome a Food Vendor\nTestimonials\nQUICK LINKS\nAbout Us\nZapplication\nPrivacy Policy\nArtist Network\nCONTACT\n2321 Davis Blvd. Naples, FL 34104\n239-297-0352\nnaplespicasso@gmail.com\nFacebook-f\nInstagram\n© 2025 Naplespicasso | All Rights Reserved",
      "emails": [
        "naplespicasso@gmail.com"
      ]
    },
    {
      "url": "http://www.naplespicasso.com/about-us/",
      "is_candidate": false,
      "has_email": true,
      "text": "naplespicasso@gmail.com\n239-297-0352\nFacebook-f\nInstagram\nVisitors\nArt Show Calender\nFAQ – Visitors\nArtists\nArt Show Calender\nHow to Apply – Artists\nDisplay Requirements Art Festival\nSpace Numbers\nPhoto Gallery\nFAQ – Artists\nArtist Network\nSPONSORS and PARTNERS\nEXHIBITOR GALLERY\nCONTACTS\nMenu\nVisitors\nArt Show Calender\nFAQ – Visitors\nArtists\nArt Show Calender\nHow to Apply – Artists\nDisplay Requirements Art Festival\nSpace Numbers\nPhoto Gallery\nFAQ – Artists\nArtist Network\nSPONSORS and PARTNERS\nEXHIBITOR GALLERY\nCONTACTS\nAbout Us\nNaples Picasso Events\n\"Picasso's Vision, Unmatched Quality: Art Shows and Events That Leave a Lasting Impression\"\nWelcome to Naples Picasso Events! With decades of experience in organizing high-caliber weddings, corporate events, galas, and more, we stand as the premier destination for those looking to curate unforgettable moments. Dive into the vibrant world of art, weddings, and events, where each occasion is masterfully crafted to exceed expectations.\nMeet Patrick Beneš, the mastermind behind Naples Picasso Events. Hailing from Germany, Patrick made his move to the United States in 2018, carrying with him extensive experience spanning numerous industries such as airline, retail, hospitality, professional event management, and real estate. His expertise is rooted in leadership roles that prioritize clear business strategies, adaptability, and achieving tangible results. One of Patrick’s standout qualities is his ability to communicate and forge strong relationships, ensuring that artists and clients alike feel understood and valued.\nHaving honed his skills as a General Manager in the event sphere for a considerable time, Patrick made a seamless transition into the art arena in 2022. As the Director of Events for a distinguished Non-Profit Art Institute, he uplifted art shows to unmatched standards in safety, quality, and execution, positioning them among the top ranks nationwide. In 2023, he channeled his passion and proficiency into Naples Picasso Events. Here, his commitment to professionalism, attention to detail, and personable approach make every art show and event extraordinary.\nAt Naples Picasso Events, we believe in genuine relationships. Be it artists, brides-to-be, or corporate clients, Patrick’s approach emphasizes understanding and addressing the distinct needs of each. Artists, especially emerging talents, find a nurturing environment, with Patrick guiding them in carving out their unique artistic paths and setting them up for success.\nIn the search for an unparalleled art show experience, wedding, corporate event, gala, or fundraiser? Naples Picasso Events promises events that highlight extraordinary artists, craft dream weddings, design impactful corporate gatherings, and overall, leave an indelible mark on all participants.\nJoin us in this adventure of artistry and excellence. Allow Naples Picasso Events to elevate your events to new pinnacles of success.\nJOIN US\nBecome an Exhibitor\nBecome a Sponsor\nBecome a Food Vendor\nTestimonials\nQUICK LINKS\nAbout Us\nZapplication\nPrivacy Policy\nArtist Network\nCONTACT\n2321 Davis Blvd. Naples, FL 34104\n239-297-0352\nnaplespicasso@gmail.com\nFacebook-f\nInstagram\nJOIN US\nBecome an Exhibitor\nBecome a Sponsor\nBecome a Food Vendor\nTestimonials\nQUICK LINKS\nAbout Us\nZapplication\nPrivacy Policy\nArtist Network\nCONTACT\n2321 Davis Blvd. Naples, FL 34104\n239-297-0352\nnaplespicasso@gmail.com\nFacebook-f\nInstagram\n© 2025 Naplespicasso | All Rights Reserved",
      "emails": [
        "naplespicasso@gmail.com"
      ]
    },
    {
      "url": "https://naplespicasso.com/faq-artists/",
      "is_candidate": false,
      "has_email": true,
      "text": "naplespicasso@gmail.com\n239-297-0352\nFacebook-f\nInstagram\nVisitors\nArt Show Calender\nFAQ – Visitors\nArtists\nArt Show Calender\nHow to Apply – Artists\nDisplay Requirements Art Festival\nSpace Numbers\nPhoto Gallery\nFAQ – Artists\nArtist Network\nSPONSORS and PARTNERS\nEXHIBITOR GALLERY\nCONTACTS\nMenu\nVisitors\nArt Show Calender\nFAQ – Visitors\nArtists\nArt Show Calender\nHow to Apply – Artists\nDisplay Requirements Art Festival\nSpace Numbers\nPhoto Gallery\nFAQ – Artists\nArtist Network\nSPONSORS and PARTNERS\nEXHIBITOR GALLERY\nCONTACTS\nFAQ – Artists\nFrequently Asked Questions\nArtist FAQ's\nApplication requirements for shows: To apply for our shows, please visit www.zapplication.org or visit our become an Exhibitor page, where you will find a detailed outline of all the necessary steps.\nDisplay picture requirement: For our outdoor events, it is mandatory to provide an outdoor display picture (Booth Shot) during the jurying process. Failure to include this picture will result in your application not being considered. We recommend setting up a display in your backyard or any suitable location to capture the essence of your booth. The display photos you submit must accurately represent the booth you will set up at our shows. It’s crucial to maintain consistency, as any significant deviations may lead to removal from the show. We emphasize that your display is equally important as your artwork.\nRegarding show deadlines: We generally do not have specific deadlines for most of our art shows. However, if an art show does have a deadline, it will be clearly indicated. The art shows will close once we have reached the maximum number of juried exhibitors for the available space. It’s important to note that many of our art shows and categories may close early, so we recommend applying as soon as the application becomes available.\nBringing pets to shows: At Naples Picasso Events, we welcome both artists/crafters and patrons to bring their dogs to our outdoor shows. However, we kindly request that your pet is friendly, gentle, well-behaved, and kept on a leash. It’s important to ensure that your dog doesn’t disturb your neighbors. Please note that not all outdoor events are pet-friendly, so we recommend checking the show location rules prior to your arrival with your pet.\nSales tax collection: As per government laws, all sales of tangible goods must be taxed. Sales tax rates vary depending on the state, county, and sometimes the city. It is your responsibility to research, collect, and report your sales and taxes accordingly. We recommend contacting the local department of revenue for the show venue to obtain additional information. In some cases, the local tax office may request a list of exhibitors, and we are obligated to comply with their requirements.\nClassification of artwork as fine art or craft: If you are unsure about the category in which your work falls, you can email your photos and description to naplespicasso@gmail.com for review. Please include a letter requesting a review for classification under art or craft, along with a biography explaining your artistic process. Our committee will assess your work based on our guidelines and inform you of the appropriate classification. Please note that this step does not guarantee acceptance into a particular show.\nWaitlist procedure: If a show or category is already closed, you have the option to apply for the waitlist. You can submit your application in the same manner as usual (via Zapplication or paper application) and indicate “WAITLIST” next to the closed show if applying on paper. The show fee will not be cashed unless we contact you and you accept a spot in the show. If you are not accepted, your deposit will be returned. Please keep in mind that you may not know if you are accepted until the week of the show, although in rare cases, we may contact waitlisted artists up to 30 days prior to the show due to cancellations. It’s advisable to contact us at the beginning of the week preceding the show to check for availability and provide your best contact number. Final notifications will be sent after the show layout is completed.\nFriday night set up: Due to logistical constraints on street venues, we are unable to facilitate Friday night set up for most of our events. Your confirmation letter will indicate whether a show has a Friday set up. This detail is determined by the property or host city and cannot be changed once their decision is made.\nAcceptance notification timeline: The jurying process typically takes between 2 to 4 weeks, although it may take longer when new applications are received. Applying early ensures that you won’t be left wondering close to the show date. If you apply near the show date, your application will be expedited through our system. We appreciate your patience, as our office receives numerous applications daily. Each submission is carefully reviewed for completeness and accuracy. If you haven’t received a confirmation before the week of the show, feel free to contact our office. It is your responsibility to follow up on your application, and if you haven’t received any confirmation, we recommend contacting our office. Outdated email addresses may also contribute to a lack of communication.\nPayment procedures for deposits and balances: Separate checks should be provided for all deposits, as acceptance into some shows doesn’t guarantee acceptance into others. By sending separate checks, we can return the money for shows you are not confirmed for or place you on the waitlist. However, account balances may be paid using a single check. Please indicate the shows you are paying for in the memo section of your check.\nApplying for multiple shows: Since each of our shows is juried separately, you must apply to each one individually. Acceptance into one show does not guarantee acceptance into others. Complete applications, including photos of your work and display, are required for consideration. Incomplete applications will not be accepted.\nRequesting space for a show: You may make a space request when submitting your deposit/booth fee or no later than 3 weeks prior to the show. Requests must be made before the show layout is completed. Please contact our office or email your request. Verbally making requests to a show coordinator will not be recorded. While we do our best to accommodate requests, there are no guarantees, especially if multiple exhibitors request the same space. The final decision will depend on space availability and the overall aesthetic of the show.\nBalances due: Payment at the show will not be accepted. If full payment, including the late fee, is not received by the Friday before the show, you may not be allowed to participate, and your space may be given to another exhibitor. To ensure a smooth process, please contact our offices to confirm receipt of your payment prior to participation. Repeated late payments may result in the loss of art show participation.\nAdverse weather and booth protection: We cannot reschedule shows for future weekends in the event of adverse weather due to our full calendar of events. If inclement weather is expected, please check our website or contact our office for updates on show status. Our shows are held rain or shine, and we do not cancel in advance. If a show is canceled due to a decision by the property or host city, we will make every effort to notify you in advance. However, no credits or refunds will be issued if we are unable to cancel prior to making logistical or advertising arrangements. The decision and timeline for cancellation will be at our discretion. If a show is canceled on-site due to hazardous weather conditions, credits or refunds will not be issued. It is your responsibility to ensure that your tent is sturdy enough to withstand harsh weather conditions. When purchasing a dome tent, inquire about its maximum wind and rain resistance. Adequate weights should be placed on each tent leg, with a standard recommendation of 50 pounds per leg. Tents must also be certified flame-retardant dome canopies.\nPlease bring a copy of the certificate to the shows.\nFoldable and “Pop-Up” Tents are NOT permitted.Only Dome Tents are\npermitted\nlike Trimmline, Lighdome, Finale, CraftHut or similar.\nBefore staking your tent on any surface other than grass or hard dirt, please consult with the Naples Picasso Events.\nHandmade artwork requirement: It is crucial that the work you display is your own and handmade. We strictly prohibit the sale of buy-sell items, kits, or mass-produced products at all our art shows.\nAttending the booth personally: At Naples Picasso Evens, we value the opportunity for attendees to meet the artist/crafter personally. Therefore, it is mandatory that the actual artist/crafter is present at their booth throughout the entire duration of the art show.\nFull participation in the show: Exhibitors are required to attend and occupy their booths for the entire duration of the show. Partial participation for a single day is not permitted.\nArtist FAQ's\nApplication requirements for shows: To apply for our shows, please visit www.zapplication.org or visit our become an Exhibitor page, where you will find a detailed outline of all the necessary steps.\nDisplay picture requirement: For our outdoor events, it is mandatory to provide an outdoor display picture (Booth Shot) during the jurying process. Failure to include this picture will result in your application not being considered. We recommend setting up a display in your backyard or any suitable location to capture the essence of your booth. The display photos you submit must accurately represent the booth you will set up at our shows. It’s crucial to maintain consistency, as any significant deviations may lead to removal from the show. We emphasize that your display is equally important as your artwork.\nRegarding show deadlines: We generally do not have specific deadlines for most of our art shows. However, if an art show does have a deadline, it will be clearly indicated. The art shows will close once we have reached the maximum number of juried exhibitors for the available space. It’s important to note that many of our art shows and categories may close early, so we recommend applying as soon as the application becomes available.\nBringing pets to shows: At Naples Picasso Events, we welcome both artists/crafters and patrons to bring their dogs to our outdoor shows. However, we kindly request that your pet is friendly, gentle, well-behaved, and kept on a leash. It’s important to ensure that your dog doesn’t disturb your neighbors. Please note that not all outdoor events are pet-friendly, so we recommend checking the show location rules prior to your arrival with your pet.\nSales tax collection: As per government laws, all sales of tangible goods must be taxed. Sales tax rates vary depending on the state, county, and sometimes the city. It is your responsibility to research, collect, and report your sales and taxes accordingly. We recommend contacting the local department of revenue for the show venue to obtain additional information. In some cases, the local tax office may request a list of exhibitors, and we are obligated to comply with their requirements.\nClassification of artwork as fine art or craft: If you are unsure about the category in which your work falls, you can email your photos and description to naplespicasso@gmail.com for review. Please include a letter requesting a review for classification under art or craft, along with a biography explaining your artistic process. Our committee will assess your work based on our guidelines and inform you of the appropriate classification. Please note that this step does not guarantee acceptance into a particular show.\nWaitlist procedure: If a show or category is already closed, you have the option to apply for the waitlist. You can submit your application in the same manner as usual (via Zapplication or paper application) and indicate “WAITLIST” next to the closed show if applying on paper. The show fee will not be cashed unless we contact you and you accept a spot in the show. If you are not accepted, your deposit will be returned. Please keep in mind that you may not know if you are accepted until the week of the show, although in rare cases, we may contact waitlisted artists up to 30 days prior to the show due to cancellations. It’s advisable to contact us at the beginning of the week preceding the show to check for availability and provide your best contact number. Final notifications will be sent after the show layout is completed.\nFriday night set up: Due to logistical constraints on street venues, we are unable to facilitate Friday night set up for most of our events. Your confirmation letter will indicate whether a show has a Friday set up. This detail is determined by the property or host city and cannot be changed once their decision is made.\nAcceptance notification timeline: The jurying process typically takes between 2 to 4 weeks, although it may take longer when new applications are received. Applying early ensures that you won’t be left wondering close to the show date. If you apply near the show date, your application will be expedited through our system. We appreciate your patience, as our office receives numerous applications daily. Each submission is carefully reviewed for completeness and accuracy. If you haven’t received a confirmation before the week of the show, feel free to contact our office. It is your responsibility to follow up on your application, and if you haven’t received any confirmation, we recommend contacting our office. Outdated email addresses may also contribute to a lack of communication.\nPayment procedures for deposits and balances: Separate checks should be provided for all deposits, as acceptance into some shows doesn’t guarantee acceptance into others. By sending separate checks, we can return the money for shows you are not confirmed for or place you on the waitlist. However, account balances may be paid using a single check. Please indicate the shows you are paying for in the memo section of your check.\nApplying for multiple shows: Since each of our shows is juried separately, you must apply to each one individually. Acceptance into one show does not guarantee acceptance into others. Complete applications, including photos of your work and display, are required for consideration. Incomplete applications will not be accepted.\nRequesting space for a show: You may make a space request when submitting your deposit/booth fee or no later than 3 weeks prior to the show. Requests must be made before the show layout is completed. Please contact our office or email your request. Verbally making requests to a show coordinator will not be recorded. While we do our best to accommodate requests, there are no guarantees, especially if multiple exhibitors request the same space. The final decision will depend on space availability and the overall aesthetic of the show.\nBalances due: Payment at the show will not be accepted. If full payment, including the late fee, is not received by the Friday before the show, you may not be allowed to participate, and your space may be given to another exhibitor. To ensure a smooth process, please contact our offices to confirm receipt of your payment prior to participation. Repeated late payments may result in the loss of art show participation.\nAdverse weather and booth protection: We cannot reschedule shows for future weekends in the event of adverse weather due to our full calendar of events. If inclement weather is expected, please check our website or contact our office for updates on show status. Our shows are held rain or shine, and we do not cancel in advance. If a show is canceled due to a decision by the property or host city, we will make every effort to notify you in advance. However, no credits or refunds will be issued if we are unable to cancel prior to making logistical or advertising arrangements. The decision and timeline for cancellation will be at our discretion. If a show is canceled on-site due to hazardous weather conditions, credits or refunds will not be issued. It is your responsibility to ensure that your tent is sturdy enough to withstand harsh weather conditions. When purchasing a dome tent, inquire about its maximum wind and rain resistance. Adequate weights should be placed on each tent leg, with a standard recommendation of 50 pounds per leg. Tents must also be certified flame-retardant dome canopies.\nPlease bring a copy of the certificate to the shows.\nFoldable and “Pop-Up” Tents are NOT permitted.Only Dome Tents are\npermitted\nlike Trimmline, Lighdome, Finale, CraftHut or similar.\nBefore staking your tent on any surface other than grass or hard dirt, please consult with the Naples Picasso Events.\nHandmade artwork requirement: It is crucial that the work you display is your own and handmade. We strictly prohibit the sale of buy-sell items, kits, or mass-produced products at all our art shows.\nAttending the booth personally: At Naples Picasso Evens, we value the opportunity for attendees to meet the artist/crafter personally. Therefore, it is mandatory that the actual artist/crafter is present at their booth throughout the entire duration of the art show.\nFull participation in the show: Exhibitors are required to attend and occupy their booths for the entire duration of the show. Partial participation for a single day is not permitted.\nJOIN US\nBecome an Exhibitor\nBecome a Sponsor\nBecome a Food Vendor\nTestimonials\nQUICK LINKS\nAbout Us\nZapplication\nPrivacy Policy\nArtist Network\nCONTACT\n2321 Davis Blvd. Naples, FL 34104\n239-297-0352\nnaplespicasso@gmail.com\nFacebook-f\nInstagram\nJOIN US\nBecome an Exhibitor\nBecome a Sponsor\nBecome a Food Vendor\nTestimonials\nQUICK LINKS\nAbout Us\nZapplication\nPrivacy Policy\nArtist Network\nCONTACT\n2321 Davis Blvd. Naples, FL 34104\n239-297-0352\nnaplespicasso@gmail.com\nFacebook-f\nInstagram\n© 2025 Naplespicasso | All Rights Reserved",
      "emails": [
        "naplespicasso@gmail.com"
      ]
    },
    {
      "url": "https://naplespicasso.com/how-to-apply-artists/",
      "is_candidate": false,
      "has_email": true,
      "text": "naplespicasso@gmail.com\n239-297-0352\nFacebook-f\nInstagram\nVisitors\nArt Show Calender\nFAQ – Visitors\nArtists\nArt Show Calender\nHow to Apply – Artists\nDisplay Requirements Art Festival\nSpace Numbers\nPhoto Gallery\nFAQ – Artists\nArtist Network\nSPONSORS and PARTNERS\nEXHIBITOR GALLERY\nCONTACTS\nMenu\nVisitors\nArt Show Calender\nFAQ – Visitors\nArtists\nArt Show Calender\nHow to Apply – Artists\nDisplay Requirements Art Festival\nSpace Numbers\nPhoto Gallery\nFAQ – Artists\nArtist Network\nSPONSORS and PARTNERS\nEXHIBITOR GALLERY\nCONTACTS\nHow to Apply – Artists\nHow to apply to Naples Picasso Events.\nAll Naples Picasso Events can be conveniently accessed through ZAPPLICATION (www.zapplication.org) .\nAs a proud, paperless company, we encourage artists to use this platform for a streamlined application process. If you have any inquiries regarding Zapplication, feel free to reach out at 303-629-1166.\nTo be considered for any of our shows, please ensure that you provide the following:\nPhotos of your work: Kindly submit three to four high-quality images showcasing your artwork and a Booth Shot. These visuals play a significant role in the evaluation process.\nDisplay photo: We require one outdoor display photo, as indoor images are not acceptable. It’s important that we see your complete display, including your white 10’x10′ Dome tent. Please set up a 10×10 display to demonstrate how you will present your work within the white tent.\nJury fees (non-refundable): Each art show requires a $39 application processing fee/jury fee.\nArt Show fees: The show fees are conveniently listed on Zapplication. Alternatively, you can get in touch with our offices via email or phone to inquire about the fee for each show, as prices may vary. It’s important to note that show fees are to be paid after receiving an invitation to the show. Submitting the show fee confirms your acceptance of the invitation, our policies and the legal agreement and secures your space in the art show. We kindly request that you make the payment promptly upon receiving your invitation.\nArtist statements: We value your unique perspective as an artist. Please include an artist statement in all Zapplication applications to provide insight into your work and your artistic journey.\nWe appreciate your interest in Naples Picasso Events and look forward to reviewing your applications. If you have any further questions or require assistance, please don’t hesitate to reach out to us.\nRevised Policies and Procedures for Naples Picasso Events Art Shows\nGeneral Policies\nEligibility and Conditions for Acceptance\nAll artwork submitted for display and sale at a Naples Picasso Events Art Show must be designed and executed by the artist who applies.\nBy applying, artists certify that the images provided represent their original work, including both design and production.\nArtwork displayed and sold at any Naples Picasso Events Art Show must be consistent with the work represented in the application images. A Quality Control Committee member will inspect all booths during the show to ensure compliance.\nBooths are intended for individual exhibiting artists only, following the “one artist per booth” principle. Sharing booths between multiple artists is not allowed.\nCollaborating Artists\nArtists who collaborate on single works of art may apply as a single exhibitor under the following conditions: a. Artistic collaborations involve two individuals working together from creative planning to the completion of the artwork. b. Collaborations must be of an artistic nature and not a business collaboration where individuals contribute only to ancillary production or administrative processes (e.g., framing, printing, accounting). c. Collaborations must be identified on the application, and the collaborative efforts of each artist must be clearly defined in the artist statement. d. Acceptance of applications for a single booth space by collaborating artists is at the discretion of the Naples Picasso Events. e. Both collaborating artists must be present during all show hours.\nArtwork solely created by apprentices or employees of the applicant will not be accepted.\nCommercial agents, dealers, manufacturers, or buy/sell vendors are strictly prohibited from participating or acting as proxies for artists.\nArtwork created from commercially available molds, patterns, kits, or other commercial methods, embellished objects, or artwork produced in studios involved in volume production is not permitted.\nArtwork made from ready-made items like clothing or furniture with painted, dyed, or added embellishments will not be accepted.\nArtwork on display may not be copies of masters, advertisements, widely circulated photographs, or violate copyright laws, including registered trademarks.\nNo posters, laser prints, t-shirts, postcards, calendars, cards, or other promotional items are permitted.\nWait List\nFor juried shows, a waitlist will be selected based on jury scores in each category. Wait-listed artists will be invited to participate as cancellations occur in their particular category. For other shows, a waitlist will be selected from accepted applicants based on the date of application. Wait-listed artists can be accepted up to and including the day of the Art Show. They will be notified by phone or email when a booth becomes available. Artists are responsible for ensuring their contact information is up to date and that they can be reached at short notice.\nNo Show Policy\nArtists who do not register and/or notify Naples Picasso Events (239-297-0352) by 7:00 am on the first day of the Art Show will be considered a “no show.” As a result, their assigned booth space(s) and ancillary services (such as parking spaces) will be forfeited without a refund.\nHealth and Safety Policy\nThe health and safety of artists, Naples Picasso Events employees, contractors, volunteers, and visitors are paramount. In organizing and managing the Art Show, we adhere to all applicable mandates, guidelines, and instructions from health experts and government officials. We will publish personal health and safety requirements for your information and compliance.\nArtist’s Responsibility for Health and Safety\nArtists must consider the safety and health of others while present at the Art Show. They should take all necessary precautions to prevent the spread of infections or illness, including complying with all health, sanitation, and COVID-specific mandates, guidelines, and instructions from health experts, government officials, and the Art Show Manager.\nInsurance Requirements\nParticipating artists must maintain general liability insurance, including bodily injury and property damage liability, in an amount not less than $1 million for the duration of the Art Show. Proof of such insurance (Certificate of Insurance – COI), listing Naples Picasso Events, 2321 Davis Blvd., Naples, FL 34104, as an additional insured must be provided no later than four weeks before the Art Show. For guidance on artist insurance, you may refer to the following link: https://www.actinsurance.com; Naples Picasso Events is not affiliated with this site and is not responsible for its content.\nRules and Regulations\nAcceptance to the Art Show is non-transferable.\nThe Art Show is a drug- and alcohol-free environment. Artists are not allowed to smoke in their booths or between booths.\nAccepted artists must be present in their booths during all Art Show hours. No agents, representatives, family members, or friends may substitute for the accepted artists’ attendance.\nOnly artwork in the category accepted through the jury process may be exhibited. Naples Picasso Events reserves the right to remove any artwork not complying with Art Show applications, policies, and requirements.\nArtists who close their booths before the designated closing hour will not be permitted to return the following day and/or apply for participation in subsequent years.\nArtists must comply with all Art Show and governmental safety requirements.\nTents: Only professional outdoor exhibition canopies such as Lightdome, Extreme Canopies, Trimmline, and similar styles or brands may be used or professional popup tents.\nWeights: The City Fire Marshal requires all tents to be secured with at least 25 lb. weights on each tent leg, totaling a minimum of 100 lbs. per tent. A Naples Picasso Events Quality Control Committee member will inspect each tent for weights, which must be installed and accessible for inspection at all times. Tents secured by structural or artwork weight solutions may be accepted at the discretion of the inspectors and Fire Marshal, provided such solutions are in place for the duration of the Art Show. Failure to properly secure a tent may result in immediate exclusion from the Art Show.\nFire Extinguishers: The City Fire Marshal and Naples Picasso Events City Permit require each tent to have a fire extinguisher. A Naples Picasso Events Quality Control Committee member will inspect each tent for a fire extinguisher. Failure to have the required equipment may result in immediate exclusion from the Art Show. A fire extinguisher may be purchased from Naples Picasso Events for $40, subject to availability.\nTables must be covered and skirted to the ground safely for visitors.\nNo two-dimensional artwork may be displayed on the ground.\nNaples Picasso Events sets setup and Breakdown procedures in collaboration with local officials to ensure safe and efficient entry and exit from the Art Show area. All artists must follow specific setup and breakdown directions.\nArtists must only park in designated artist parking areas, as specified in the artist information packet. Failure to comply may result in disqualification from future Art Shows. Premium parking spaces may be reserved for select Art Shows through Naples Picasso Events, subject to availability.\nDiscount/sales signs, ribbons, and awards from previous or other shows are prohibited.\nThe Naples Picasso Events ID Sign must be displayed prominently at the front of the booth, visible to visitors, staff, and officials.\nEach exhibitor is responsible for collecting and remitting Florida State sales tax to the Florida Department of Revenue. For more information on sales tax, you may visit:\nhttps://floridarevenue.com/taxes/taxesfees/Pages/sales_tax.aspx\nLegal Agreement\nNAPLES PICASSO EVENTS ART SHOW AGREEMENT\nIn consideration of my participation in the Naples Picasso Event’s Art Show on xxx xxx, xxx, I agree to the following:\nDefinitions\n“NPE shall mean the Naples Picasso Events\n“Artist” shall represent the exhibiting artist\n“Artist Parties” shall refer to the Artist’s employees, agents, customers, visitors, invitees, licensees, contractors, and designees.\nAcknowledgment\nThe Artist acknowledges receiving, reading, understanding, and agreeing to comply with all NPE’s Art Show Policies, Procedures, Rules, and Regulations, the Art Show Manager’s instructions, and any event-specific schedules and requirements.\nFees and Refunds\n3.1. Fees\nThe Artist agrees to pay all fees by the stated payment deadlines. Booth fees for this Art Show are due no later than xxx xx, 20xx. Failure to submit all required documents and booth fees by this date will automatically cancel the Artist’s participation. 3.2. Refunds\nApplication and Parking Fees are non-refundable.\nBooth Fees:\nCancellations should be submitted in writing no later than 60 days before the scheduled art show. In the event of a timely cancellation, you will be eligible for credit equivalent to the full amount of art show fees paid. This credit will remain valid for a period of 1 year, providing you with the opportunity to utilize it towards future art show participation.\nRefunds will not be provided under normal circumstances, except in cases where Naples Picasso Events has canceled a show with sufficient advance notice. Once logistical and advertising arrangements have been finalized for a show, any subsequent cancellation will not warrant a refund in accordance with our policies. This policy extends to all situations, including those arising from such as access restrictions, venue damage, war, terrorism, acts of God, fire, flood, hurricanes, tornados, weather, national or local calamity, national or local pandemic, riot, civil disorder, actions or regulations by public authorities, or any unforeseen occurrence or labor dispute, including strikes or lockouts as stated in the application. It is important to note that regardless of whether you have paid the total amount or not, you remain responsible for settling the outstanding balance. While we acknowledge that unforeseen circumstances can occur unexpectedly, we regretfully cannot make any exceptions to this policy.\n3. Cancellation/Refund Exception for Force Majeure\nIf the Art Fair is canceled or interrupted due to reasons beyond NPE’s control, such as access restrictions, venue damage, war, terrorism, acts of God, fire, flood, weather, national or local calamity, national or local pandemic, riot, civil disorder, actions or regulations by public authorities, or any unforeseen occurrence or labor dispute, including strikes or lockouts, NPE may, in its sole discretion, credit booth fees to future events. Neither the Artist nor NPE shall be liable to the other for any damages caused. Credits must be used within 12 months of the event or will be considered earned by NPE and non-refundable.\nArtist Registration, Booth Set Up, and Attendance 4.1. The artist must be present and provide valid photo identification at registration. 4.2. Artist agrees to comply with the Load-In and Set-Up Schedule determined by NPE in collaboration with local officials and in conformance with City requirements and NPE’s event permit. Booth set-up must be completed between xx:xx am and xx:xx am on xxx, xxx x, xxxx. All vehicles must be out of the setup area by xx: xx am. No parking or unloading outside the scheduled times is allowed. Violators may be subject to fines and future exclusion from NPE Art Shows. 4.3. The Artist agrees to be present in their booth during all the Art Show posted hours. Art Show hours are from xx am to xx pm.\nArtist Representation of Original Artwork\nThe Artist represents that all artwork submitted for the jury process and displayed for sale at the Art Show is original work designed and executed by the Artist. All work exhibited must be for sale. Mass-produced objects, kits, molds, embellished objects, commercial reproductions, or exhibitor posters are prohibited. Artists may only display and sell work in the medium they applied for. NPE reserves the right to advise the Artist regarding non-compliant artwork and take necessary action, including requiring immediate removal of non-compliant artwork, asking the Artist to leave the Art Show, and denying the Artist participation in future Art Shows.\nRules, Regulations, Applicable Laws, and Professional Conduct\nThe Artist agrees to abide by all federal, state, and local rules, regulations, and laws applicable to the Art Show. The Artist acknowledges that the Art Show is a public event open to attendees of all ages, interests, and backgrounds and agrees to represent themselves and NPE civilly and professionally.\nUse of Images 7.1. By Naples Picasso Events “NPE”\nThe Artist grants NPE, its agents, assigns, and employees permission to use photographs, video, and other recordings of the Artist’s displays and artwork for promotional, marketing, and/or educational purposes without remuneration to the Artist. This permission includes use in news releases, print, television, social media, and NPE websites. 7.2. By the Artist\nPhotographs, videos, and other recordings taken by the Artist or Artist Parties during or as a result of participating in the Art Show are subject to scrutiny and approval by NPE in its sole and absolute discretion. NPE may require the removal of any images or recordings deemed inappropriate or otherwise unacceptable for any reason. Failure to comply may result in removal from the Art Show, exclusion from future Art Shows, or legal remedies exercised by NPE against the Artist.\nUse of Reviews and Testimonials\nThe Artist grants permission to NPE, its agents, assigns, and employees to reference or use reviews or testimonials published or posted by the Artist about the NPE Art Show for marketing purposes.\nCanopies and Display Requirements\nThe Artist agrees to adhere to the “Exhibition Canopy and Display Requirements” specified in the Artist Information Guide. These requirements ensure the safety and protection of artists, patrons, and artwork. Only professional outdoor exhibition canopies meeting the specified criteria may be used. Suppose the Artist does not possess a suitable canopy or is physically incapable of setting one up. In that case, it is the Artist’s responsibility to explore and arrange for third-party rental solutions. Stockpiling or storing equipment, artwork, materials, or supplies in public view near the booth or on sidewalks is prohibited. The Artist understands that non-compliance with these requirements will result in immediate removal from the Art Show and acknowledges sole responsibility for protecting and securing their artwork and materials.\nParking\nThe Artist agrees to the “Parking Requirements” specified in the Artist Information Guide. Compliance with these requirements is mandatory as designated by the City and NPE’s permit. Non-compliance may result in immediate removal from the Art Show and denied participation in future Art Shows.\nInsurance\nThe Artist agrees to provide proof of general liability insurance, including bodily injury and property damage liability, in an amount not less than $1 million, listing Naples Picasso Events 2321 Davis Blvd. Naples, FL 34104, as an additional insured, by xxxx xx, 20xx.\nLiability and Release\nThe Artist, as a result of this, releases, indemnifies and holds harmless Naples Picasso Events, the City of Naples, Collier County their employees, volunteers, representatives, assignees, affiliated organizations, vendors, and suppliers from any and all claims, losses, liabilities, demands, damages, theft, or costs (including attorney’s fees) arising before, during, or after the Art Show due to negligence, failure to perform under this Agreement, or other acts, foreseen or unforeseen. The Artist further releases Naples Picasso Events, Collier County, and the City of Naples from all actions, claims, and demands for injury, death, or damage to personal property, equipment, or artwork. The Artist is encouraged to carry liability, personal injury, theft, and event interruption/cancellation insurance for their artwork and personal protection.\nKnowing and Voluntary Execution\nThe Artist acknowledges having carefully read and fully understood the contents of this Agreement. The Artist understands that failure to comply with this Agreement and the Art Show regulations will result in removal from the Art Show. This Agreement constitutes a legally enforceable contract and release of liability between the Artist and Naples Picasso Events, and the Artist signs it voluntarily.\nBy signing this Agreement, the Artist acknowledges their understanding and acceptance of all the policies, procedures, rules, and regulations outlined herein for the Naples Picasso Events Art Shows organized by Naples Picasso Events.\nJOIN US\nBecome an Exhibitor\nBecome a Sponsor\nBecome a Food Vendor\nTestimonials\nQUICK LINKS\nAbout Us\nZapplication\nPrivacy Policy\nArtist Network\nCONTACT\n2321 Davis Blvd. Naples, FL 34104\n239-297-0352\nnaplespicasso@gmail.com\nFacebook-f\nInstagram\nJOIN US\nBecome an Exhibitor\nBecome a Sponsor\nBecome a Food Vendor\nTestimonials\nQUICK LINKS\nAbout Us\nZapplication\nPrivacy Policy\nArtist Network\nCONTACT\n2321 Davis Blvd. Naples, FL 34104\n239-297-0352\nnaplespicasso@gmail.com\nFacebook-f\nInstagram\n© 2025 Naplespicasso | All Rights Reserved",
      "emails": [
        "naplespicasso@gmail.com"
      ]
    },
    {
      "url": "https://naplespicasso.com/contacts/",
      "is_candidate": false,
      "has_email": true,
      "text": "naplespicasso@gmail.com\n239-297-0352\nFacebook-f\nInstagram\nVisitors\nArt Show Calender\nFAQ – Visitors\nArtists\nArt Show Calender\nHow to Apply – Artists\nDisplay Requirements Art Festival\nSpace Numbers\nPhoto Gallery\nFAQ – Artists\nArtist Network\nSPONSORS and PARTNERS\nEXHIBITOR GALLERY\nCONTACTS\nMenu\nVisitors\nArt Show Calender\nFAQ – Visitors\nArtists\nArt Show Calender\nHow to Apply – Artists\nDisplay Requirements Art Festival\nSpace Numbers\nPhoto Gallery\nFAQ – Artists\nArtist Network\nSPONSORS and PARTNERS\nEXHIBITOR GALLERY\nCONTACTS\nCONTACTS\nGet In Touch\nWe would love to hear from you! For inquiries, feedback, or any questions, please don’t hesitate to contact us. Fill out the form below or reach out to us directly via email or phone. We look forward to connecting with you at Naples Picasso Events.\nName\nEmail\nSubject\nAddress\nMessage\nSend\nNaples Picasso Events LLC\n2321 Davis Blvd. ,Naples, Florida 34104\n239-297-0352\nnaplespicasso@mail.com\nFacebook-f\nInstagram\nJOIN US\nBecome an Exhibitor\nBecome a Sponsor\nBecome a Food Vendor\nTestimonials\nQUICK LINKS\nAbout Us\nZapplication\nPrivacy Policy\nArtist Network\nCONTACT\n2321 Davis Blvd. Naples, FL 34104\n239-297-0352\nnaplespicasso@gmail.com\nFacebook-f\nInstagram\nJOIN US\nBecome an Exhibitor\nBecome a Sponsor\nBecome a Food Vendor\nTestimonials\nQUICK LINKS\nAbout Us\nZapplication\nPrivacy Policy\nArtist Network\nCONTACT\n2321 Davis Blvd. Naples, FL 34104\n239-297-0352\nnaplespicasso@gmail.com\nFacebook-f\nInstagram\n© 2025 Naplespicasso | All Rights Reserved",
      "emails": [
        "naplespicasso@gmail.com",
        "naplespicasso@mail.com"
      ]
    },
    {
      "url": "https://www.facebook.com/groups/picassoartistnetwork",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    },
    {
      "url": "https://m.facebook.com/groups/picassoartistnetwork?wtsid=rdr_0mFzFqXL0hcqibZF9",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    }
  ],
  "all_links": [
    "https://naplespicasso.com/events/list/?eventDisplay=past",
    "https://naplespicasso.com/events/list/?ical=1",
    "https://naplespicasso.com/exhibitor-gallery/",
    "https://naplespicasso.com/events/month/",
    "http://www.naplespicasso.com/testimonials/",
    "https://naplespicasso.com/faq-visitors/",
    "http://www.naplespicasso.com/become-a-food-vendor/",
    "http://www.naplespicasso.com/how-to-apply/",
    "http://www.naplespicasso.com/about-us/",
    "https://naplespicasso.com/photo-gallery/",
    "http://www.naplespicasso.com/",
    "https://naplespicasso.com/faq-artists/",
    "https://naplespicasso.com/sponsors/",
    "http://www.naplespicasso.com/art-festival-calender/",
    "https://naplespicasso.com/space-numbers/",
    "http://www.naplespicasso.com/festival-calender/",
    "https://naplespicasso.com/event/longboat-key-art-splash-2nd-annual/",
    "https://naplespicasso.com/how-to-apply-artists/",
    "http://www.naplespicasso.com/become-an-exhibitor/",
    "https://naplespicasso.com/events/today/",
    "https://naplespicasso.com/contacts/",
    "https://naplespicasso.com/art-festival-calender/",
    "http://www.naplespicasso.com/privacy-policy/",
    "https://naplespicasso.com/events/list/?outlook-ical=1",
    "https://naplespicasso.com/events/list/",
    "https://naplespicasso.com/display-requirements-art-festival/",
    "https://naplespicasso.com/event/mercato-art-celebration-3rd-annual/",
    "https://naplespicasso.com/festival-calender/"
  ],
  "candidate_links": [
    "https://naplespicasso.com/events/list/?eventDisplay=past",
    "http://www.naplespicasso.com/about-us/",
    "https://naplespicasso.com/faq-artists/",
    "https://naplespicasso.com/how-to-apply-artists/",
    "https://naplespicasso.com/contacts/",
    "https://www.facebook.com/groups/picassoartistnetwork",
    "https://m.facebook.com/groups/picassoartistnetwork?wtsid=rdr_0mFzFqXL0hcqibZF9"
  ],
  "visited": [
    "http://www.naplespicasso.com/",
    "http://www.naplespicasso.com/about",
    "http://www.naplespicasso.com/contact",
    "http://www.naplespicasso.com/staff",
    "http://www.naplespicasso.com/team",
    "http://www.naplespicasso.com/board",
    "http://www.naplespicasso.com/directory",
    "http://www.naplespicasso.com/events",
    "http://www.naplespicasso.com/sitemap.xml",
    "http://www.naplespicasso.com/council",
    "http://www.naplespicasso.com/leadership",
    "http://www.naplespicasso.com/management",
    "http://www.naplespicasso.com/producers",
    "http://www.naplespicasso.com/support",
    "http://www.naplespicasso.com/crew",
    "http://www.naplespicasso.com/members",
    "http://www.naplespicasso.com/bios",
    "http://www.naplespicasso.com/people",
    "http://www.naplespicasso.com/artists",
    "http://www.naplespicasso.com/musicians",
    "http://www.naplespicasso.com/faculty",
    "http://www.naplespicasso.com/administration",
    "https://naplespicasso.com/events/list/?eventDisplay=past",
    "http://www.naplespicasso.com/about-us/",
    "https://naplespicasso.com/faq-artists/",
    "https://naplespicasso.com/how-to-apply-artists/",
    "https://naplespicasso.com/contacts/",
    "https://www.facebook.com/groups/picassoartistnetwork",
    "https://m.facebook.com/groups/picassoartistnetwork?wtsid=rdr_0mFzFqXL0hcqibZF9"
  ],
  "base_url": "http://www.naplespicasso.com/"
}