{
  "pages": [
    {
      "url": "https://nikkibeach.com/about/",
      "is_candidate": false,
      "has_email": false,
      "text": "At Nikki Beach, we blend music, dining, entertainment, fashion, film and art into one incredible experience.\nOur Story\nEstablished by entrepreneurs Jack and Lucia Penrod,\nNikki Beach Hospitality Group\nepitomizes barefoot luxury hospitality, curating transformative lifestyle experiences through its collection of Nikki Beach properties including iconic beach clubs, resorts, residences, dining concepts, and pop-ups as well as the group’s new restaurant concept,\nLucia\n. Located in some of the world’s most sought-after travel destinations worldwide, Nikki Beach is recognized among the world’s best beach clubs and resorts.\nNikki Beach stands as a global haven for unforgettable moments, seamlessly blending music, dining, entertainment, fashion, film, and art to create unparalleled celebrations. Beyond travel experiences, Nikki Beach extends its reach with a lifestyle division, featuring boutiques and an e-commerce shop.\nIn 2024, the brand introduced Lucia, a groundbreaking restaurant and beach concept within the Nikki Beach Hospitality Group portfolio. Lucia promises to redefine culinary excellence and immersive dining, blending Cuisine du Soleil with vibrant, seasonally changing decor. Across the brand’s expanding endeavors, Nikki Beach Hospitality Group continues to set new benchmarks in crafting luxury travel and lifestyle experiences.\nBehind the Brand\nJack and Lucia Penrod built a hospitality legacy that transformed the industry and continues to set the standard for luxury lifestyle brands. Starting from modest beginnings, Jack rose from a McDonald’s line cook to one of the largest franchise owners in the company, leveraging his success and marketing prowess to open multiple bars and restaurants in South Florida. In 1984, Lucia, who had recently moved from Nicaragua to Miami, joined Jack’s team to manage the exclusive Jockey Club of Miami. She soon became Project Manager and then PR Director for the launch of Penrod’s at 1 Ocean Drive. The couple married in 1995 and continued to collaborate on innovative ventures.\nWhen Jack’s 18-year-old daughter, Nicole, was tragically killed in a car accident, the couple chose to honor and celebrate her life by transforming the pool area at Penrod’s into a beautiful butterfly garden named Cafe Nikki in her honor. Built on the philosophy of ‘Celebrating Life,’ the property combined music, dining, entertainment, fashion, film, and art among all-white décor and international cuisine, all designed with Nicole in mind. The garden drew an affluent new clientele to the property, and at the request of many guests, Jack expanded the property onto the beach. In 1998, the first Nikki Beach was born, and today, as the brand has expanded globally, the design and ambiance of each Nikki Beach location is still inspired by Nicole’s vivacious spirit.\nAs Nikki Beach continues to grow, Lucia remains at the helm as Cofounder, Owner & CEO, carrying forward the vision she and Jack built together. With support from a global team that has become a family, she ensures that the ‘Celebration of Life’ philosophy continues to resonate with loyal clients and new guests every year.\nMusic\nAt our venues, an immersive musical experience awaits.\nAt Nikki Beach, music is at the heart of your experience, guiding you from relaxed morning tunes to lively beats as the day heats up. Our resident and guest DJs curate an exciting mix of chill, deep, Afro, and Latin house, along with timeless classics and current hits, creating the perfect vibe for every moment.\nWhether you’re unwinding in a serene section of a resort or enjoying upbeat rhythms in one of our beach clubs, our carefully selected playlists ensure our signature Celebration of Life atmosphere is always in full swing.\nEntertainment\nAt the heart of our brand is a commitment to entertainment. Our passionate teams infuse energy into every experience, ensuring that every day feels special. Enjoy live singers and DJs at our beach clubs, complemented by spectacular performances from dancers and aerialists during special events.\nWe also create memorable moments through a diverse range of activities at our resorts — from tranquil spa sessions and serene beachfront yoga to adventurous paddleboarding — catering to every guest’s desire for enjoyment and relaxation.\nDining\nOur menus blend signature regional dishes with international flavors from our stunning global locations. Focusing on fresh, coastal cuisine, we offer memorable dining experiences featuring tableside cooking, oversized sharing platters, and beautifully presented plates designed to be enjoyed with family and friends. Sip on creative cocktails, fine wines, or flowing rosé during leisurely lunches or sun-soaked afternoons.\nFriendly service and comforting dishes blend to create our signature barefoot luxury atmosphere.\nFashion\nWith fashion-forward guests in mind, we feature stylish lifestyle boutiques at many of our locations worldwide along with a dedicated shop website, showcasing curated resort wear styles and exclusive co-branded capsule collections that embody the effortless Nikki Beach vibe.\nOur venues come alive as guests display their unique styles, enhanced by ongoing fashion pop-ups and collaborations that let you shop the latest trends. At Nikki Beach, every moment is an opportunity to elevate your style and experience.\nFilm\nSince our first pop-up at the Cannes Film Festival in 2003, we’ve hosted premiere parties, dinners, and exclusive events at top film festivals like Cannes, Toronto, Sundance, and Venice.\nOur love for film enhances the Nikki Beach experience, allowing you to immerse yourself in the glamour and excitement that surrounds the world of cinema.\nArt\nNikki Beach’s dedication to the arts spans many forms, from supporting local artists to hosting exhibitions. Nikki Beach Founder and Owner Jack Penrod commissioned Sasha de Saint-Tropez to create an artistic memorial to his late daughter Nicole, which is displayed at each Nikki Beach location.\nThe arts in all forms are represented throughout our Nikki Beach locations.\nCareers\nJoin our team\n(opens in new tab)\nBusiness Expansion\nFind out more\n(opens in new tab)",
      "emails": []
    },
    {
      "url": "https://nikkibeach.com/contact/",
      "is_candidate": false,
      "has_email": true,
      "text": "Get in touch\nGeneral Feedback\ninfo@nikkibeach.com\nPress Enquiries\npress@nikkibeach.com\nNew Business Development\nbusinessdevelopment@nikkibeach.com\nEntertainment Collaborations\nentertainment@nikkibeach.com\n1 Ocean Drive\nMiami Beach, FL 33139,\nUSA\n1 Ocean Drive\nMiami Beach, FL 33139,\nUSA\nGet directions\n(opens in new tab)",
      "emails": [
        "businessdevelopment@nikkibeach.com",
        "entertainment@nikkibeach.com",
        "info@nikkibeach.com",
        "press@nikkibeach.com"
      ]
    },
    {
      "url": "https://nikkibeach.com/miami-beach/contact/",
      "is_candidate": false,
      "has_email": true,
      "text": "Hours\nBeach\nDaily\n11AM- 6PM\nRestaurant\nMonday - Thursday\n12PM – 6PM\nFriday - Sunday\n12PM – 7PM\nAmazing Sundays Brunch\n11AM – 4PM\nAfter-Brunch Menu\n4PM – 8PM\nBoutique\nDaily\n12PM – 5PM\nContact\nAddress\nNikki Beach Miami Beach\n1 Ocean Drive\nMiami Beach, FL 33139\nUSA\nContact phone\n+ 1 305 321 5238\nContact email\nreservations.miamibeach@nikkibeach.com\nBoat coordinates\n25°46’9.2″N 80°7’56.1″W\nGet directions\n(opens in new tab)",
      "emails": [
        "reservations.miamibeach@nikkibeach.com"
      ]
    }
  ],
  "all_links": [
    "https://nikkibeach.com/santorini/",
    "mailto:press@nikkibeach.com",
    "https://nikkibeach.com/miami-beach/menus/",
    "https://nikkibeach.com/santorini/dine-drink/nikki-beach-restaurant-beach-club/",
    "https://nikkibeach.com/press/",
    "https://nikkibeach.com/miami-beach/app/app-uploads/sites/2/2025/06/BG5A5241-expanded-e1749548699773.jpg",
    "https://nikkibeach.com/baku/dine-drink/nikki-beach-restaurant-beach-club/",
    "mailto:entertainment@nikkibeach.com",
    "https://nikkibeach.com/miami-beach/app/app-uploads/sites/2/2024/08/3.jpg",
    "https://nikkibeach.com/about/",
    "https://nikkibeach.com/contact/",
    "https://nikkibeach.com/baku/nikki-beach-restaurant-beach-club/",
    "https://nikkibeach.com",
    "https://nikkibeach.com/terms-conditions/",
    "https://nikkibeach.com/porto-heli/dine-drink/nikki-beach-restaurant-beach-club/",
    "https://nikkibeach.com/mallorca",
    "https://nikkibeach.com/koh-samui/dine-drink/nikki-beach-restaurant-beach-club/",
    "https://nikkibeach.com/saint-tropez",
    "https://shop.nikkibeach.com/",
    "https://nikkibeach.com/miami-beach/reservation-door-policy/",
    "https://nikkibeach.com/costa-smeralda",
    "https://nikkibeach.com/monte-carlo",
    "https://nikkibeach.com/koh-samui/",
    "https://nikkibeach.com/branded-residences/",
    "https://nikkibeach.com/miami-beach/gallery/",
    "https://nikkibeach.com/miami-beach/privacy-policy/",
    "https://nikkibeach.com/miami-beach/",
    "https://nikkibeach.com/miami-beach/accessibility/",
    "https://nikkibeach.com/porto-cervo",
    "https://nikkibeach.com/saint-barth",
    "https://nikkibeach.com/miami-beach/sitemap/",
    "https://nikkibeach.com/miami-beach/happenings/",
    "https://nikkibeach.com/",
    "https://nikkibeach.com/ibiza",
    "https://nikkibeach.com/santorini",
    "https://nikkibeach.com/miami-beach/cookie-policy/",
    "https://nikkibeach.com/privacy-policy/",
    "mailto:info@nikkibeach.com",
    "https://nikkibeach.com/koh-samui",
    "https://nikkibeach.com/miami-beach/meetings-events/#form",
    "https://nikkibeach.com/cookie-policy/",
    "https://nikkibeach.com/accessibility/",
    "https://nikkibeach.com/porto-heli",
    "https://nikkibeach.com/dubai/dine-drink/nikki-beach-restaurant-beach-club/",
    "https://nikkibeach.com/miami-beach/terms-conditions/",
    "https://nikkibeach.com/marbella",
    "https://nikkibeach.com/nikki-cares/",
    "mailto:businessdevelopment@nikkibeach.com",
    "https://nikkibeach.com/miami-beach/contact/",
    "https://nikkibeach.com/dubai",
    "https://shop.nikkibeach.com",
    "https://nikkibeach.com/miami-beach/meetings-events/",
    "https://nikkibeach.com/sitemap/",
    "mailto:reservations.miamibeach@nikkibeach.com",
    "https://nikkibeach.com/porto-heli/"
  ],
  "candidate_links": [
    "https://nikkibeach.com/about/",
    "https://nikkibeach.com/contact/",
    "https://nikkibeach.com/miami-beach/contact/"
  ],
  "visited": [
    "https://nikkibeach.com/miami-beach/",
    "https://nikkibeach.com/about",
    "https://nikkibeach.com/contact",
    "https://nikkibeach.com/staff",
    "https://nikkibeach.com/team",
    "https://nikkibeach.com/board",
    "https://nikkibeach.com/directory",
    "https://nikkibeach.com/events",
    "https://nikkibeach.com/sitemap.xml",
    "https://nikkibeach.com/council",
    "https://nikkibeach.com/leadership",
    "https://nikkibeach.com/management",
    "https://nikkibeach.com/producers",
    "https://nikkibeach.com/support",
    "https://nikkibeach.com/crew",
    "https://nikkibeach.com/members",
    "https://nikkibeach.com/bios",
    "https://nikkibeach.com/people",
    "https://nikkibeach.com/artists",
    "https://nikkibeach.com/musicians",
    "https://nikkibeach.com/faculty",
    "https://nikkibeach.com/administration",
    "https://nikkibeach.com/about/",
    "https://nikkibeach.com/contact/",
    "https://nikkibeach.com/miami-beach/contact/"
  ],
  "base_url": "https://nikkibeach.com/miami-beach/"
}