{
  "pages": [
    {
      "url": "https://www.northmiamibrewfest.com/policies/#contact",
      "is_candidate": false,
      "has_email": false,
      "text": "Policies\nGET YOUR TICKETS\nTicket Policy\nBrewFest is organized by The Florida International University Board of Trustees (“BrewFest Organizer”). Any purchase or possession of tickets (including wristbands and credentials, the “Ticket(s)”) for the BrewFest constitutes the irrevocable acceptance of, and the agreement to be bound by, all of the terms and conditions contained herein, by ticketholder as either the purchaser, custodian or bearer of the Ticket(s) (hereinafter referred to as “Holder”, and/or “You”). Holder further acknowledges and agrees that BrewFest Organizer may, from time to time, modify, add, remove, supplement, amend, update or otherwise revise any or all of the terms and conditions contained herein, without advanced, direct or individual notification to you and such revisions shall, at the sole and absolute option of FIU, relate back to the date of purchase. IF YOU DO NOT AGREE TO BE BOUND BY THESE TERMS AND CONDITIONS, DO NOT PURCHASE AND/OR USE TICKET(S).\nMUST BE 21 YEARS OF AGE OR OLDER\nAll ticketholders must be 21 years of age or older.  No minors, including infants and toddlers, are permitted on site at BrewFest. Proof of age is required. No alcohol is served to minors.  BrewFest Organizer reserves the right to deny service.\nHEALTH AND SAFETY\nHolder acknowledges that, in addition to other BrewFest Organizer’s rules and requirements, BrewFest Organizer has put in place preventative measures and rules to reduce the risk of spread of COVID-19; all of them set forth in the Code of Conduct, posted at go.fiu.edu/BrewFestConduct. The Code of Conduct may be updated and changed from time to time and is effective immediately upon posting such changes on the website.  All attendees (including ticket holders, sponsors, speakers, media, exhibitors and other participants) must abide by the aforementioned Code of Conduct at all times.  Anyone found to be in violation of any of such terms will be asked to immediately leave the event, without refund.\nDRINKING & DRIVING POLICY\nAs a responsible member of the community, BrewFest Organizer recognizes the concern about alcohol use and drinking and driving. BrewFest Organizer’s policy is to encourage responsible consumption of products at the BrewFest.  If Holder believes that his/her driving ability may be impaired or that Holder cannot safely operate a motor vehicle, please speak with a BrewFest representative who may arrange for transportation to Holder’s destination point. Non-alcoholic beverages are available.\nALCOHOL\nIt is understood that some beers may run out before the end of the event. NO CONTAINERS OF ANY ALCOHOLIC BEVERAGE, OPENED OR UNOPENED, MAY BE BROUGHT ON TO OR REMOVED FROM THIS SITE FOR ANY REASON. Any container, purse, bag or other property in Holder’s possession is subject to inspection by BrewFest security while entering event, during event or during departure from event.\nNO PETS ALLOWED\nONLY SERVICE ANIMALS, AS DEFINED BY FEDERAL AND FLORIDA LAW, ARE PERMITTED.  For more information, please refer to the U.S. Department of Justice guidance for service animals.\nREFUNDS\nALL SALES ARE FINAL. No refunds or exchanges, except as provided for herein. Unauthorized or unlawful resale or attempted resale of this ticket is grounds for seizure and cancellation of all admission privileges without compensation.\nINCLEMENT WEATHER/FORCE MAJEURE\nBrewFest Organizer accepts no responsibility, financial or otherwise, and does not provide refunds, for event cancellation, delay or interruption because of inclement weather.\nUpon the occurrence of the event cancellation due to reasons, including but not limited to, events outside the BrewFest Organizer’s reasonable control such as acts of God, public health emergencies (including,  but not limited to, as a result of epidemics and pandemics), riots, wars, insurrection of military power, civil rebellion, production delays, strikes, hurricanes, tropical storms, earthquakes, floods, natural disasters, any federal, state or local government law, order, or regulation, order of any court or jurisdiction,  BrewFest Organizer shall, at its sole and absolute discretion (a) have the right, but not the obligation, to issue a refund to Holders, OR shall at its sole and absolute discretion, (b) elect to postpone the event OR (c) cancel the event without further legal or financial obligation or liability to Holder, including the obligation to issue a refund or to reschedule the event. If the BrewFest Organizer elects to issue a refund, an amount equivalent to the face value of Ticket(s) less any applicable fees shall be refunded to the payment method by which the purchase was originally made. Under no circumstances shall Holder be entitled to a refund of any shipping, handling or other processing fees.\nRIGHT TO USE YOUR NAME, VOICE, IMAGE & LIKENESS\nNo Holder’s cameras or recording devices are permitted. By using this ticket, Holder grants BrewFest Organizer and its affiliates and licensees the irrevocable, transferable, perpetual right and license to record, publish, print, display and use (by photograph, film, tape, aural devices and any other method or device) the Holder’s name, voice, image and likeness while at BrewFest (the “Recordings”), and to use such Recordings for any and all purposes, in any and all media now known or hereafter devised.\nASSUMPTION OF ALL RISKS\nWHILE ATTENDING THE FESTIVAL, YOU WILL BE EXPOSED TO MANY PEOPLE, AND AN INHERENT RISK OF EXPOSURE TO COMMUNICABLE DISEASE OR ILLNESS, SUCH AS COVID-19, EXISTS IN ANY PUBLIC PLACE WHERE PEOPLE ARE PRESENT.  Holder voluntarily assumes all risks, hazards and dangers incidental to the event for which the ticket is issued, whether occurring prior to, during, or after the event, including but not limited to those of communicable disease. Each Holder voluntarily waives all claims against the BrewFest Organizer, ticket issuer, event sponsors or venue owner. Holder voluntarily agrees that the BrewFest Organizer, and its officers, directors, affiliates, employees and agents acting by and through it, are expressly released by Holder from any claim incidental to the event or purpose for which the ticket is issued. Holder agrees to INDEMNIFY AND HOLD HARMLESS BrewFest Organizer, the City of North Miami, and their directors, officers, employees, volunteers, agents, and representatives from any and all claims, demands, actions and costs which might arise out of Holder’s participation in BrewFest, even though such claims, demands, actions and costs may have been caused by the negligence of BrewFest Organizer, its directors, officers, employees, volunteers, agents and representatives. BrewFest Organizer is not responsible for lost or stolen articles at the event for which this ticket grants admission.\nACKNOWLEDGEMENT\nEntry into the BrewFest event constitutes acceptance of the above terms and conditions.\nCode of conduct\nAll attendees (including ticket holders, sponsors, speakers, media, exhibitors, vendors, venue staff, student scholars, volunteers, partners and other participants) of the North Miami BrewFest (“BrewFest”) must abide this Code of Conduct.  Anyone found to be in violation of these Terms will be asked to leave the Event immediately.\nPurpose\nWe believe that BrewFest should be enjoyed by all attendees. As such, we are committed to providing a safe and welcoming environment for all. We invite all attendees to help us realize a safe and positive event experience for everyone.\nExpected Behavior\nPlease be courteous and respectful to those around you and refrain from behavior that interferes with others’ ability to enjoy BrewFest. Adjacent venues are visited by members of the public; please be respectful to all patrons of these locations.  Refrain from demeaning, discriminatory or harassing behavior and speech. Be mindful of your surroundings and of your fellow attendees. Alert BrewFest organizers if you notice a dangerous situation or someone in distress. Wear your wristband and, if one is provided to you, your credential, at all times while at BrewFest. You are required to comply with all requests from BrewFest staff regarding operational and emergency procedures and to comply with the following Health and Safety Guidelines.\nHealth and Safety Guidelines\nThe North Miami BrewFest (“BrewFest”) recommends that all attendees, exhibitors, sponsors, vendors, staff, student scholars and volunteers at our event sanitize their hands upon entering the venue and maintain social distancing.\nThe BrewFest Health and Safety Guidelines are developed in consultation with the FIU Healthcare Committee on COVID-19 Health & Safety Protocols which follows guidance from the Centers for Disease Control and Prevention (CDC), the State of Florida Department of Health and Miami-Dade County.\nThese BrewFest Health and Safety Guidelines will be continually updated as new public health information becomes available.\nUnacceptable Behavior.\nUnacceptable behavior will not be tolerated by any attendee. Anyone asked to stop unacceptable behavior is expected to immediately comply. If anyone is found to be engaging in unacceptable behavior, BrewFest organizers may take any action they deem appropriate, up to and including expulsion from the event without warning or refund and if appropriate, involvement of local law enforcement.\nUnacceptable behaviors include:\nIntimidating, harassing, abusive, discriminatory, derogatory, or demeaning conduct by any attendee of BrewFest or related event activities.\nPhysical or verbal abuse, intimidation, threats, annoyance, harassment, stalking, pushing, shoving or use of any physical force whatsoever against any person, which in any way creates a disturbance that is disruptive or dangerous, or creates apprehension in a person, as determined by BrewFest staff, in their sole discretion.\nPossession of a weapon or any item that can be used as a weapon, which may be used to threaten or cause injury to others if used in a certain manner.  Weapons of any kind are expressly prohibited at BrewFest in accordance with Florida Statutes Section 790.115, except as provided by Florida law.\nDestroying or vandalizing of personal property or event site or materials.\nBoisterous, lewd or offensive behavior or language, including but not limited to, sexually explicit language or conduct, profanity, obscene gestures, or racial, religious, gender identity or ethnic slurs.\nPossessing any open can, bottle or other receptacle containing any alcoholic beverages, except in areas specifically designated for the consumption of alcohol or being intoxicated, as determined by BrewFest staff. Please drink responsibly.\nPossessing any illegal substance, including but not limited to narcotics, marijuana, or other illegal drugs. The use or abuse of illegal substances anywhere in the BrewFest venue is prohibited.\nSmoking, except in designated areas.\nAssembling for the purpose of, or resulting in, disturbing the peace, or committing any unlawful act or engaging in any offensive behavior.\nAny illegal activity not already covered above.\nFailure to obey any of the rules or regulations of BrewFest or instructions of BrewFest staff, especially non-compliance with the BrewFest Health & Safety Guidelines.\nBag Policy\nAll ticketed guests must adhere to the following BrewFest bag policy:\nCONTACT US\nSend us any questions, comments, or inquiries and we will get back to you as soon as possible.\nName\nCompany\nEmail Address\nPhone Number\nMessage\nSubmit",
      "emails": []
    },
    {
      "url": "https://www.northmiamibrewfest.com/about/#contact",
      "is_candidate": false,
      "has_email": true,
      "text": "About\nGET YOUR TICKETS\nLEARN. BREW. TASTE\nNorth Miami BrewFest is a one-day festival featuring some of the best breweries in South Florida and their one-of-a-kind beers. Our mission is to contribute to brewing science education and innovation for the craft brew industry, brewpubs and home brew organizations.\nSee our brewers\nFIU CHAPLIN SCHOOL OF HOSPITALITY & TOURISM MANAGEMENT\nNorth Miami BrewFest began as a student project led by hospitality management students at the Chaplin School of Hospitality & Tourism Management at FIU. Proceeds from the North Miami BrewFest support the FIU Chaplin School of Hospitality & Tourism Management and its Brewing Science program.\nlearn more\nLOCATION\nNoMi Village 12351 NW 7th Avenue, North Miami, FL 33168\ngoogle map location and directions\nFREE GUEST PARKING\nAll parking in the City of North Miami is free. Street parking is also available.\nFree parking is available in the Trinity Church (12685 NW 7th Avenue) and Javan Lumber (12721 NW 7th Avenue) parking lots, just north of The Nomi Village. It is a leisurely 9 minute walk from the parking lot to the festival main entrance.\nFREE GUEST TROLLEY\nNorth Miami BrewFest is offering a free ADA trolley this year. There will be two trolley stops for guests, one at the main entrance to The Nomi Village and one in between the free public parking lots at Javan Lumber and Trinity Church, which are just three-and-a-half blocks north of Nomi Village.\nFAQ\nWhen and where is the event?\nThe North Miami BrewFest is on Saturday, November 16, 2024, from 4:00PM to 8:00PM in NoMi Village 12351 NW 7th Ave, North Miami, FL 33168.\nDo I have to pay for Parking?\nNope. Parking in the City of North Miami is totally free. View\na parking map\n.\nCan I bring my own food & drink to the Event?\nNo. Outside food and drink are prohibited. Your ticket price includes all food and beverage samples.\nCan I bring my children to the Event?\nNo, this is a 21 and older event.  Absolutely no one below the age of 21, including infants and toddlers, is permitted at the event.\nCan I bring my pet to the Event?\nNO PETS ALLOWED. ONLY SERVICE ANIMALS PERMITTED. Service animals are defined as dogs that are individually trained to do work or perform tasks for people with disabilities. For more information, please refer to the\nU.S. Department of Justice website\n.\nWhat happens if there is bad weather?\nThe North Miami BrewFest event will happen rain or shine! All tickets are non-refundable.\nWhat is the dress code?\nAs a general guideline, we suggest “smart casual” attire and we encourage you to wear comfortable shoes so you can make the most of our large event.\nWhat items are prohibited at the event?\nProhibited items include but are not limited to: outside food and beverages, drugs, weapons, backpacks, large bags, and suitcases.\nClick here to view our bag policy\n. NO PETS ALLOWED, ONLY SERVICE ANIMALS.\nI have dietary restrictions; can you accommodate me?\nWe cannot guarantee that participating chefs and restaurants will prepare dishes without common allergens including nuts, dairy, gluten, etc. or that there will be vegetarian options available. If you have any other questions regarding your specific dietary restrictions, please email us at\nbrewfest@fiu.edu\n.\nCan I bring my own seating?\nNo, external seating is prohibited at the event. There are high-top tables and limited seating throughout the event. Guests with General Admission tickets should expect to stand. VIP tickets are available and include access to additional limited seating in the VIP Lounge.\nWhat if I can no longer attend the event?\nWe apologize for any inconvenience, but just like a concert of sporting event, there are no refunds.  This event will occur, rain or shine.\nWhat charity does the North Miami BrewFest support?\nLEARN. BREW. TASTE. 100% of the net proceeds benefit the Chaplin School of Hospitality & Tourism Management’s Brewing Program at Florida International University. To date, more than 600 student scholars have utilized the Festival as an interactive educational platform to gain real-world experience in the hospitality industry.\nCONTACT US\nSend us any questions, comments, or inquiries and we will get back to you as soon as possible.\nName\nCompany\nEmail Address\nPhone Number\nMessage\nSubmit",
      "emails": [
        "brewfest@fiu.edu"
      ]
    },
    {
      "url": "https://www.northmiamibrewfest.com/about/",
      "is_candidate": false,
      "has_email": true,
      "text": "About\nGET YOUR TICKETS\nLEARN. BREW. TASTE\nNorth Miami BrewFest is a one-day festival featuring some of the best breweries in South Florida and their one-of-a-kind beers. Our mission is to contribute to brewing science education and innovation for the craft brew industry, brewpubs and home brew organizations.\nSee our brewers\nFIU CHAPLIN SCHOOL OF HOSPITALITY & TOURISM MANAGEMENT\nNorth Miami BrewFest began as a student project led by hospitality management students at the Chaplin School of Hospitality & Tourism Management at FIU. Proceeds from the North Miami BrewFest support the FIU Chaplin School of Hospitality & Tourism Management and its Brewing Science program.\nlearn more\nLOCATION\nNoMi Village 12351 NW 7th Avenue, North Miami, FL 33168\ngoogle map location and directions\nFREE GUEST PARKING\nAll parking in the City of North Miami is free. Street parking is also available.\nFree parking is available in the Trinity Church (12685 NW 7th Avenue) and Javan Lumber (12721 NW 7th Avenue) parking lots, just north of The Nomi Village. It is a leisurely 9 minute walk from the parking lot to the festival main entrance.\nFREE GUEST TROLLEY\nNorth Miami BrewFest is offering a free ADA trolley this year. There will be two trolley stops for guests, one at the main entrance to The Nomi Village and one in between the free public parking lots at Javan Lumber and Trinity Church, which are just three-and-a-half blocks north of Nomi Village.\nFAQ\nWhen and where is the event?\nThe North Miami BrewFest is on Saturday, November 16, 2024, from 4:00PM to 8:00PM in NoMi Village 12351 NW 7th Ave, North Miami, FL 33168.\nDo I have to pay for Parking?\nNope. Parking in the City of North Miami is totally free. View\na parking map\n.\nCan I bring my own food & drink to the Event?\nNo. Outside food and drink are prohibited. Your ticket price includes all food and beverage samples.\nCan I bring my children to the Event?\nNo, this is a 21 and older event.  Absolutely no one below the age of 21, including infants and toddlers, is permitted at the event.\nCan I bring my pet to the Event?\nNO PETS ALLOWED. ONLY SERVICE ANIMALS PERMITTED. Service animals are defined as dogs that are individually trained to do work or perform tasks for people with disabilities. For more information, please refer to the\nU.S. Department of Justice website\n.\nWhat happens if there is bad weather?\nThe North Miami BrewFest event will happen rain or shine! All tickets are non-refundable.\nWhat is the dress code?\nAs a general guideline, we suggest “smart casual” attire and we encourage you to wear comfortable shoes so you can make the most of our large event.\nWhat items are prohibited at the event?\nProhibited items include but are not limited to: outside food and beverages, drugs, weapons, backpacks, large bags, and suitcases.\nClick here to view our bag policy\n. NO PETS ALLOWED, ONLY SERVICE ANIMALS.\nI have dietary restrictions; can you accommodate me?\nWe cannot guarantee that participating chefs and restaurants will prepare dishes without common allergens including nuts, dairy, gluten, etc. or that there will be vegetarian options available. If you have any other questions regarding your specific dietary restrictions, please email us at\nbrewfest@fiu.edu\n.\nCan I bring my own seating?\nNo, external seating is prohibited at the event. There are high-top tables and limited seating throughout the event. Guests with General Admission tickets should expect to stand. VIP tickets are available and include access to additional limited seating in the VIP Lounge.\nWhat if I can no longer attend the event?\nWe apologize for any inconvenience, but just like a concert of sporting event, there are no refunds.  This event will occur, rain or shine.\nWhat charity does the North Miami BrewFest support?\nLEARN. BREW. TASTE. 100% of the net proceeds benefit the Chaplin School of Hospitality & Tourism Management’s Brewing Program at Florida International University. To date, more than 600 student scholars have utilized the Festival as an interactive educational platform to gain real-world experience in the hospitality industry.\nCONTACT US\nSend us any questions, comments, or inquiries and we will get back to you as soon as possible.\nName\nCompany\nEmail Address\nPhone Number\nMessage\nSubmit",
      "emails": [
        "brewfest@fiu.edu"
      ]
    },
    {
      "url": "https://www.facebook.com/NomiBrewfest",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    }
  ],
  "all_links": [
    "https://www.northmiamibrewfest.com/policies/#ticket",
    "https://www.northmiamibrewfest.com/media/",
    "https://www.northmiamibrewfest.com/media/#photos",
    "https://www.northmiamibrewfest.com/policies/#bag",
    "https://www.northmiamibrewfest.com/experience/#restaurants",
    "https://www.northmiamibrewfest.com/experience/#breweries",
    "https://www.northmiamibrewfest.com/sponsors/",
    "https://www.northmiamibrewfest.com/policies/#health",
    "https://www.northmiamibrewfest.com/policies/#contact",
    "https://www.northmiamibrewfest.com/media/#video",
    "https://www.northmiamibrewfest.com/policies/#code",
    "https://www.northmiamibrewfest.com/about/#contact",
    "https://www.northmiamibrewfest.com/wp-content/uploads/2023/11/BREWFEST-Attendees-PARKING-MAP2.pdf",
    "https://www.northmiamibrewfest.com/",
    "https://www.northmiamibrewfest.com/about/",
    "https://www.northmiamibrewfest.com/promo-tools/",
    "https://www.northmiamibrewfest.com/about/#location",
    "https://www.northmiamibrewfest.com/#becomesponsor",
    "https://www.northmiamibrewfest.com/about/#faq"
  ],
  "candidate_links": [
    "https://www.northmiamibrewfest.com/policies/#contact",
    "https://www.northmiamibrewfest.com/about/#contact",
    "https://www.northmiamibrewfest.com/about/",
    "https://www.facebook.com/NomiBrewfest"
  ],
  "visited": [
    "https://www.northmiamibrewfest.com/",
    "https://www.northmiamibrewfest.com/about",
    "https://www.northmiamibrewfest.com/contact",
    "https://www.northmiamibrewfest.com/staff",
    "https://www.northmiamibrewfest.com/team",
    "https://www.northmiamibrewfest.com/board",
    "https://www.northmiamibrewfest.com/directory",
    "https://www.northmiamibrewfest.com/events",
    "https://www.northmiamibrewfest.com/sitemap.xml",
    "https://www.northmiamibrewfest.com/council",
    "https://www.northmiamibrewfest.com/leadership",
    "https://www.northmiamibrewfest.com/management",
    "https://www.northmiamibrewfest.com/producers",
    "https://www.northmiamibrewfest.com/support",
    "https://www.northmiamibrewfest.com/crew",
    "https://www.northmiamibrewfest.com/members",
    "https://www.northmiamibrewfest.com/bios",
    "https://www.northmiamibrewfest.com/people",
    "https://www.northmiamibrewfest.com/artists",
    "https://www.northmiamibrewfest.com/musicians",
    "https://www.northmiamibrewfest.com/faculty",
    "https://www.northmiamibrewfest.com/administration",
    "https://www.northmiamibrewfest.com/policies/#contact",
    "https://www.northmiamibrewfest.com/about/#contact",
    "https://www.northmiamibrewfest.com/about/",
    "https://www.facebook.com/NomiBrewfest"
  ],
  "base_url": "https://www.northmiamibrewfest.com/"
}