{
  "pages": [
    {
      "url": "https://nuberooftop.com/contact/",
      "is_candidate": false,
      "has_email": false,
      "text": "Contact Nubé Rooftop\nWhether you’re reserving a table or looking for more information, our team is here to assist you and ensure a seamless experience.\nContact us today, and let us elevate your journey at Fort Lauderdale’s premier rooftop destination, where sunset hues fade to starry nights, and every detail is designed to enchant.\nRESERVE NOW\nPHONE NUMBER:\n954-525-6823\nLOCATION\nBeach House Fort Lauderdale, A Hilton Resort\n505 N Fort Lauderdale Beach Blvd., 26th Floor\nFort Lauderdale, Florida 33304\nNubé welcomes all guests 21 and over.\nInquire\nTo inquire about your reservation or to ask a general question, please use the contact form below.\nPlease do not use this form for solicitation of goods or services.\nPlease enable JavaScript in your browser to complete this form.\nPlease enable JavaScript in your browser to complete this form.\nName\n*\nEmail\n*\nPhone Number\n*\nMessage\n*\n.wpforms-field-container\nSubmit\n.wpforms-container",
      "emails": []
    },
    {
      "url": "https://nuberooftop.com/about/",
      "is_candidate": false,
      "has_email": false,
      "text": "Meet You In The Clouds\nWhere the sky’s embrace meets ocean’s gaze, atop the 26th floor of the Beach House Fort Lauderdale, a Hilton Resort. Nubé offers panoramic ocean views, craft cocktails & shareable plates.\nInspired by its surroundings, our whimsical menu of crafted cocktails reflects a coastal flair in an atmosphere that seamlessly blends lounge vibes with dining. Our rooftop provides both indoor and outdoor seating options, featuring a wraparound glass balcony and walls that vanish into the breathtaking ocean views.\nAs sunset hues fade to starry nights, sit seaside on the sky terrace, enjoy an intimate setting at the Solstice Bar and Lounge, and embrace the sky-high energy at the Lunar Bar, where the outside melds seamlessly with the inside.\nReserve a table for your next night out\nRESERVE NOW",
      "emails": []
    },
    {
      "url": "https://nuberooftop.com/private-events/corporate-events-fort-lauderdale/",
      "is_candidate": false,
      "has_email": false,
      "text": "Corporate Events in Fort Lauderdale\nNubé Rooftop invites you to elevate your corporate gatherings above the cityscape. Nestled on the 26th floor of the Beach House Fort Lauderdale, A Hilton Resort, our oceanfront sanctuary is a refined retreat where panoramic views, bespoke service, and a serene coastal breeze create an unforgettable backdrop for your business celebrations.\nOur rooftop venue sets the perfect stage for everything from intimate executive meetings to grand celebrations, wrapped in the serenity of ocean breezes and panoramic cityscapes. With thoughtfully curated spaces and tailored services, your event unfolds effortlessly within our sky-high oasis, a place where professionalism meets poetic elegance, and every detail is thoughtfully curated to inspire connection and creativity.\nTypes of Corporate Events We Host\nOur rooftop venue is designed to accommodate a wide variety of business occasions, including:\nExecutive retreats & leadership summits\nTeam-building experiences\nProduct launches & brand activations\nHoliday parties & celebrations\nNetworking mixers & client appreciation events\nTraining sessions & workshops\nCorporate dinners and business luncheons\nEach event benefits from our refined ambiance, panoramic views, and attentive service, creating a setting where connections deepen and ideas take flight.\nPrivate Event Spaces Designed to Inspire\nNubé Rooftop boasts versatile spaces crafted for business events of all sizes, blending coastal charm with refined sophistication:\nFull Venue:\nHost up to 240 guests with exclusive access to every sky-high corner of Nubé, ideal for gala dinners, product launches, and large-scale gatherings.\nLunar Bar\n: An intimate setting for up to 50 guests, perfect for cocktail receptions or networking mixers amid chic design and captivating views.\nFirepit Area\n: Cozy and inviting, this space accommodates up to 40 guests, providing a relaxed atmosphere for team-building or casual after-hours events under the stars.\nSky Terrace\n: A serene spot for up to 30 guests, where ocean breezes and sky-wide vistas create the ideal backdrop for focused discussions or executive retreats.\nExplore our private event spaces through our virtual tour and envision your next corporate gathering elevated to new heights.\nVirtual Tour\nA Setting Designed for Wonder\nHigh above the shoreline, Nubé Rooftop offers an atmosphere that’s as awe-inspiring as the occasion itself. As the sun dips below the horizon and stars begin to shimmer above, your gathering transforms into an experience, effortlessly elegant and entirely unforgettable.\nEvery celebration is paired with panoramic views, glowing ambiance, and the gentle rhythm of waves far below.\nWhy Choose Nubé Rooftop for Corporate Events?\nNubé Rooftop offers more than just a venue, it delivers an unparalleled experience.\nPanoramic views of the Atlantic Ocean and city skyline set a breathtaking tone for every moment.\nSeamless indoor-outdoor flow allows your guests to mingle effortlessly in spaces filled with natural light and fresh sea air.\nCustom culinary creations and artisanal cocktails designed to impress and energize your team.\nPrime location atop the Beach House Fort Lauderdale, a Hilton Resort, moments from the beach and the city’s premier hotels.\nSTART PLANNING YOUR CORPORATE EVENT\nReady to Elevate Your Corporate Event?\nFill out the contact form below to connect with our dedicated events team and start planning an unforgettable corporate experience in Fort Lauderdale at Nubé Rooftop, where your success is celebrated among the clouds.\nPrivate Event Software powered by Tripleseat",
      "emails": []
    },
    {
      "url": "https://nuberooftop.com/events-fort-lauderdale/",
      "is_candidate": false,
      "has_email": false,
      "text": "Rooftop Entertainment & Events\non Fort Lauderdale Beach\nAbove the shoreline, Nubé offers a setting where moments become memories, framed by endless sky and shimmering sea. Enjoy gatherings that celebrate taste, music, and connection, where sunsets unfold in gentle hues and each evening is crafted to linger beautifully in your memory.\nUpcoming Events\nNubé’s calendar features a rotating collection of refined experiences designed to surprise and delight. From melodic evenings to inspired culinary moments, each event is shaped by the rhythm of the ocean and the glow of our rooftop setting.\nMonthly Lunar Rising Full Moon Parties\nCelebrate under the sky’s brightest glow with an evening of crafted bites, spirited cocktails, and coastal inspiration as the full moon ascends.\nSeptember 7th\nOctober 7th\nHalloween Cocktails\nOctober 13–21\nDare to drink in the dark side with our Nightmare Manor–inspired cocktails. Each hauntingly crafted sip teases the senses with spooky elegance, setting the stage for Halloween at Nubé.\nNightmare Manor\nOctober 31\nStep into the clouds for a hauntingly chic Halloween soirée. With eerie beats, sky-high vibes, and cocktails to match, Nube becomes your Nightmare Manor for one unforgettable night.\nFort Lauderdale International Boat Show\nOctober 29 – November 2\nSet your sights sky-high during Boat Show week. After a day of exploring the docks, come drift above it all at Nubé. Sip handcrafted cocktails, enjoy elevated bites, and soak in sweeping oceanfront views as Fort Lauderdale’s most iconic week takes over the city.\nRESERVE NOW",
      "emails": []
    },
    {
      "url": "https://nuberooftop.com/private-events/",
      "is_candidate": false,
      "has_email": false,
      "text": "Private Events in Fort Lauderdale\nNubé, a celestial haven perched atop the 26th floor of the Beach House Fort Lauderdale, A Hilton Resort, where the oceans embrace meets the boundless sky. Vast open spaces that seem limitless with glass balcony and walls that disappear into the oceanic views.\nAscend to unparalleled heights with our exclusive event spaces, including the intimate Lounge, Sky Terrace, and Fire Pit area. Whether hosting a breakfast, lunch, sunset cocktail reception, or soirée under the stars, our venue provides an ideal setting for gatherings ranging from 20 to 240 guests.\nBOOK NOW\nOur Private Event Spaces\nNubé Rooftop offers versatile private party venues in Fort Lauderdale, accommodating gatherings of all sizes. From intimate groups of 30 to full-venue events for up to 240 guests, we have the perfect private event space to suit your needs.\nFull Venue - 240 guests\nLunar Bar - Up to 50 guests\nFirepit area - Up to 40 guests\nSky Terrace - Up to 30 guests\nExplore our private party spaces to find the ideal setting for your next event in our virtual tour.\nVIRTUAL TOUR\nWe Host a Variety of Private Events\nNubé Rooftop accommodates various private rooftop rentals on Fort Lauderdale Beach.\nHost your next celebration at Nubé, featuring celestial views and exceptional service.\nBirthdays\nCorporate  gatherings and meetings\nCorporate Cocktail Parties\nGroup Happy Hours\nNetworking events\nHoliday parties\nBachelor and bachelorette parties\nAnniversary celebrations\nCocktail reception\nWedding dinner rehearsals\n...and more\nBook Your Soirée In The Sky\nFor booking and inquiries, please complete the online form above or call us at\n954-525-9001.\nPrivate Event Software powered by Tripleseat\nPrivate Event FAQs\nHow far in advance should I book my private event?\nWe recommend booking at least 4–6 weeks in advance to secure your preferred date and time, especially during peak season.\nIs there a food and beverage minimum for private events?\nYes, food and beverage minimums vary depending on the date, time, and space reserved. Contact our events team at 954-525-9001 for specific pricing.\nCan I bring my own decorations?\nYes, outside decorations are allowed, but they must be pre-approved by our events team. Open flames, confetti, and adhesives that may damage surfaces are not permitted.\nDo you provide catering and bar services?\nYes, we offer customized catering and bar packages to enhance your event experience. For additional information, contact the Events team at 954-525-9001.\nIs there a weather contingency plan for outdoor events?\nYes, we have contingency options available in case of inclement weather. Our team will discuss alternative arrangements with you when booking your event.\nIs parking available for guests?\nYes, valet parking is available at the Beach House Fort Lauderdale, A Hilton Resort. Additional parking options may be available nearby.\nDo you offer AV equipment for presentations or speeches?\nYes, we provide AV equipment, including microphones and screens, upon request. Please let us know your requirements in advance.",
      "emails": []
    },
    {
      "url": "https://www.facebook.com/nuberooftop/",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    }
  ],
  "all_links": [
    "https://nuberooftop.com/rooftop-celebrations-fort-lauderdale-beach/",
    "https://nuberooftop.com/contact/",
    "https://nuberooftop.com/menu",
    "https://nuberooftop.com",
    "https://nuberooftop.com/news/",
    "https://nuberooftop.com/happy-hour/",
    "https://nuberooftop.com/about/",
    "https://nuberooftop.com/reservations",
    "https://nuberooftop.com/brunch/",
    "https://nuberooftop.com/faq/",
    "https://nuberooftop.com/menu/",
    "https://nuberooftop.com/reservations/",
    "https://nuberooftop.com/private-events/corporate-events-fort-lauderdale/",
    "https://nuberooftop.com/events-fort-lauderdale/",
    "https://nuberooftop.com/private-events/",
    "https://nuberooftop.com/private-events/weddings-fort-lauderdale/"
  ],
  "candidate_links": [
    "https://nuberooftop.com/contact/",
    "https://nuberooftop.com/about/",
    "https://nuberooftop.com/private-events/corporate-events-fort-lauderdale/",
    "https://nuberooftop.com/events-fort-lauderdale/",
    "https://nuberooftop.com/private-events/",
    "https://www.facebook.com/nuberooftop/"
  ],
  "visited": [
    "https://nuberooftop.com/",
    "https://nuberooftop.com/about",
    "https://nuberooftop.com/contact",
    "https://nuberooftop.com/staff",
    "https://nuberooftop.com/team",
    "https://nuberooftop.com/board",
    "https://nuberooftop.com/directory",
    "https://nuberooftop.com/events",
    "https://nuberooftop.com/sitemap.xml",
    "https://nuberooftop.com/council",
    "https://nuberooftop.com/leadership",
    "https://nuberooftop.com/management",
    "https://nuberooftop.com/producers",
    "https://nuberooftop.com/support",
    "https://nuberooftop.com/crew",
    "https://nuberooftop.com/members",
    "https://nuberooftop.com/bios",
    "https://nuberooftop.com/people",
    "https://nuberooftop.com/artists",
    "https://nuberooftop.com/musicians",
    "https://nuberooftop.com/faculty",
    "https://nuberooftop.com/administration",
    "https://nuberooftop.com/contact/",
    "https://nuberooftop.com/about/",
    "https://nuberooftop.com/private-events/corporate-events-fort-lauderdale/",
    "https://nuberooftop.com/events-fort-lauderdale/",
    "https://nuberooftop.com/private-events/",
    "https://www.facebook.com/nuberooftop/"
  ],
  "base_url": "https://nuberooftop.com/"
}