{
  "pages": [
    {
      "url": "https://ocalapalmsgolf.com/about-us/",
      "is_candidate": false,
      "has_email": false,
      "text": "About Us\nOcala Palms Golf Course is a unique eighteen-hole layout, measuring 6500 yards (par 72) from the back tees.\nBefore or after your round, you’ll find the Ocala Palms Cafe the perfect place to enjoy a cold beverage and tasty snacks as you relive the highlights of rounds past and present. Ocala Palms offers an excellent value in membership and is the perfect place to make new freinds while enjoying our facilities.\nView Our Rates\n|\nHole Description\nOcala Palms Golf Course is a unique eighteen-hole layout, measuring 6500 yards (par 72) from the back tees.\nBefore or after your round, you’ll find the Ocala Palms Cafe the perfect place to enjoy a cold beverage and tasty snacks as you relive the highlights of rounds past and present. Ocala Palms offers an excellent value in membership and is the perfect place to make new freinds while enjoying our facilities.\nRates\nTee Times can be booked by calling the Pro Shop at\n(352)732-4653\n.\nAll rates include cart and all prices are taxable..\nTimeframe\n9-Holes\n18-Holes\nBefore 11AM\n$28+tax\n$46+tax\nAfter 11AM\n$26+tax\n$41+tax\nHole-by-Hole Description\nScorecard\nFront 9\n#1\n#2\n#3\n#4\n#5\n#6\n#7\n#8\n#9\nShort relatively easy starting hole measuring 327 yards from the back tees.  There is a fairway bunker located on the right side of the fairway to catch errant tee shots. Additionally two greenside bunkers located on left and right sides of the green will collect approach shots that are off target\nPar 5 measuring 572 yards, rated as the most difficult hole.  A water hazard is located short and right of the fairway when shooting from the tips, not in play from other tees.  Additional trouble can be found from the water located over the bridge or from the bunker to the left of the green.\nTricky par 4 measuring 372 yards.  Water is located short and right of the fairway.  Tee shots should be aimed down the left side of the fairway. Tee shots hit 20 yards beyond the 150 yard marker on the right side of the fairway, will find a water hazard.  To reach the green approach shots must carry the hazard.  For the faint of heart, there is a bail out area to the left of the green. Tough green to putt.\nUphill 188 yard par 3.  Usually plays longer than its measured yardage. Try to stay below the hole on the green and avoid the bunkers left and right.\nRelatively short, straight par 5 at 508 yards.  Avoid bunker left of fairway with tee shot.  Excess roll if you can reach the top of the hill.  There is a drainage retention area left and short of the green.\n190 yard par 3 with bunker directly in front of the green. You probably should consider hitting one more club because you are hitting your tee shot to an elevated green, but beware of the bunker behind the green.\n325 yard par 4 that doglegs right.  Stay left of the bunker.  Short to medium iron required for second shot to elevated green.  Avoid bunker short left of green.\nShort 294 yard par 4 dogleg right.  Stay left of palm trees on right guarding the corner.  If you decide to try and drive the green, be careful of out of bounds to the right and over the green. Bunkers can be found straight through the fairway and just over the green.\nGood finishing hole for the front 9. 426 yard par 4 with an abundance of trouble.  Avoid bunkers on left and water to the right.  Medium iron required for second shot.  Green has a false front that prevents many balls from running up onto the green.\nBack 9\n#10\n#11\n#12\n#13\n#14\n#15\n#16\n#17\n#18\nStraight away 375 yard par 4 to begin the back 9.  Fairway bunker on right side of the fairway and a retention area left.  Greenside bunker on the right.\nLong dogleg left 566 yard par 5.  Greenside bunkers on left and right make it difficult to hit this green in two.  Stay right side of fairway.\nPicturesque, 147 yard par 3.  Small bunker located long and left of the green.\nLong difficult par 4 measuring 479 from the championship tees.  There is one bunker to the right of the fairway at the 150 yards from the green.  A drainage area collects balls that venture too far ahead of the 150 yard marker in the fairway.  The green is sloped from back to front.\nShort 302 yard par 4.  However, don’t let the short length fool you into thinking this is an easy hole.  A drainage area lies through the fairway and the green is surrounded by water on three sides.\nShort par 3 measuring only 134 yards.  However, this hole is located at the highest elevation on the course allowing the wind to wreak havoc on poorly struck golf balls.  Balls that land short of the putting surface will not run up the false front.\n327 yard par 4 with water left and out of bounds to the right.  Narrow green that should be approached with a short iron or wedge.\nStraight away par 5 475 yards grip it and rip it.  Bunkers protect the green in front.\nTough finishing hole 398 yards.  Trouble is lurking everywhere.  Out of bounds leftand fairway bunkers on the left and right.  Tee shot should favor the right shot for an easier approach to the green.\nCopyright © 2019 Ocala Palms Golf Course • 5174 NW 26TH Street, Ocala, FL 34482 • Phone:\n(352) 732-4653",
      "emails": []
    },
    {
      "url": "https://ocalapalmsgolf.com/contact/",
      "is_candidate": false,
      "has_email": false,
      "text": "Contact Us\nOcala Palms Golf & Country Club\n5174 NW 26th Street\nOcala, FL 34482\nPhone:\n(352) 732-4653\nContact Us\nFirst Name\n*\nLast Name\n*\nPhone Number\n*\nRequest for more info subject\n*\nMembership Inquiry\nInstruction Inquiry\nTournament & Event Inquiry\nOther\nComments\nreCAPTCHA\nIf you are human, leave this field blank.\nSubmit\nCopyright © 2019 Ocala Palms Golf Course • 5174 NW 26TH Street, Ocala, FL 34482 • Phone:\n(352) 732-4653",
      "emails": []
    },
    {
      "url": "https://ocalapalmsgolf.com/membership/",
      "is_candidate": false,
      "has_email": false,
      "text": "Membership\nWe know there is no shortage of great courses in the Ocala area, but allow me a few minutes of your time and I’ll explain why Ocala Palms is the most exciting course in Central Florida with the best membership value.\nMembership are open to the public. To request more information, please call us at (352) 732-4653\nReasons to Join:\n1. A Great Golf Club Has to Start With Great Golf!\nUnsurpassed views, well-appointed surroundings and an expertly-trained staff are the hallmarks of our unwavering pursuit of excellence. Featuring multiple sets of tees, Ocala Palms is truly playable and enjoyable for players of any skill level, from tour professionals to juniors.\n3. An Excellent Range to Hone Your Game\nIf working on your game is your idea of fun, then Ocala Palms has the type of range where you can happily practice from dawn to dusk. It’s the ideal place for you to work out the kinks in your game and perfect your swing. To aid in your quest for lower scores, our staff of PGA Professionals are ready and willing to help you improve!\n5. The Golf Shop at Ocala Palms is your full-service golfing headquarters.\nThe Pro Shop at Ocala Palms is not just a golf shop – think of it as your full-service golfing headquarters. Here you’ll have access to a range of golf apparel, shoes, equipment and accessories.\nYou’ll find that we offer most items at comparable prices to many of the discount golf stores and members are entitled to exclusive discounts. When looking for help with your game or just looking for the perfect gift, ask one of our friendly Golf Operations team members for assistance – whatever your needs may be, our team is always happy to provide you with quick, knowledgeable, and friendly service.\n7. Location, Location, Location!\nOcala is conveniently located one mile from I-75. Perfect for a quick morning round or an early evening game before dinner.\n2. Stunning Views, Cool Drinks, Casual Dining and Special Occasions of Every Kind!\nAfter your round, Ocala Palms is the perfect setting to entertain old friends or make some new ones!\n4. World Class Golf Instruction\nAt Ocala Palms, we provide instruction to players of all levels.  We understand that everybody has different athletic abilities and skill levels. We personalize instruction to suit each player’s body type, ability, skill level and aspirations. We know that better posture, correct alignment and improved swinging techniques make for a better score and a more enjoyable game of golf!\n6. A Full Calendar of Tournaments and Social Events to Enjoy\nOcala Palms offers active groups of every makeup and size, from juniors to seniors, from serious to recreational and from singles to couples. In fact, you name it and we already have the perfect group for you. You’ll enjoy a full calendar of golf events in which to test your skills along with a delightful selection of social events to share with family and friends.\nOcala Palms also offers superior networking opportunities. Our membership roster is an interesting group of professional men and women, entrepreneurs and executives.\n8. Amazing Membership Value!\nWith a host of benefits, great course conditions, and an amazing executive team to serve our members, you’d expect to pay a great deal more for membership than we are offering. In fact, most members are surprised by the terrific value of our memberships.\nCopyright © 2019 Ocala Palms Golf Course • 5174 NW 26TH Street, Ocala, FL 34482 • Phone:\n(352) 732-4653",
      "emails": []
    },
    {
      "url": "https://ocalapalmsgolf.com/contact",
      "is_candidate": false,
      "has_email": false,
      "text": "Contact Us\nOcala Palms Golf & Country Club\n5174 NW 26th Street\nOcala, FL 34482\nPhone:\n(352) 732-4653\nContact Us\nFirst Name\n*\nLast Name\n*\nPhone Number\n*\nRequest for more info subject\n*\nMembership Inquiry\nInstruction Inquiry\nTournament & Event Inquiry\nOther\nComments\nreCAPTCHA\nIf you are human, leave this field blank.\nSubmit\nCopyright © 2019 Ocala Palms Golf Course • 5174 NW 26TH Street, Ocala, FL 34482 • Phone:\n(352) 732-4653",
      "emails": []
    }
  ],
  "all_links": [
    "https://ocalapalmsgolf.com/wp-content/uploads/2017/01/Ocala-Palms-Scorecard.png",
    "https://ocalapalmsgolf.com/about-us/",
    "https://ocalapalmsgolf.com/contact/",
    "https://ocalapalmsgolf.com/membership/",
    "https://ocalapalmsgolf.com/contact",
    "https://ocalapalmsgolf.com/tournaments/",
    "https://ocalapalmsgolf.com/instruction/",
    "https://ocalapalmsgolf.com/"
  ],
  "candidate_links": [
    "https://ocalapalmsgolf.com/about-us/",
    "https://ocalapalmsgolf.com/contact/",
    "https://ocalapalmsgolf.com/membership/",
    "https://ocalapalmsgolf.com/contact"
  ],
  "visited": [
    "https://ocalapalmsgolf.com/",
    "https://ocalapalmsgolf.com/about",
    "https://ocalapalmsgolf.com/contact",
    "https://ocalapalmsgolf.com/staff",
    "https://ocalapalmsgolf.com/team",
    "https://ocalapalmsgolf.com/board",
    "https://ocalapalmsgolf.com/directory",
    "https://ocalapalmsgolf.com/events",
    "https://ocalapalmsgolf.com/sitemap.xml",
    "https://ocalapalmsgolf.com/council",
    "https://ocalapalmsgolf.com/leadership",
    "https://ocalapalmsgolf.com/management",
    "https://ocalapalmsgolf.com/producers",
    "https://ocalapalmsgolf.com/support",
    "https://ocalapalmsgolf.com/crew",
    "https://ocalapalmsgolf.com/members",
    "https://ocalapalmsgolf.com/bios",
    "https://ocalapalmsgolf.com/people",
    "https://ocalapalmsgolf.com/artists",
    "https://ocalapalmsgolf.com/musicians",
    "https://ocalapalmsgolf.com/faculty",
    "https://ocalapalmsgolf.com/administration",
    "https://ocalapalmsgolf.com/about-us/",
    "https://ocalapalmsgolf.com/contact/",
    "https://ocalapalmsgolf.com/membership/",
    "https://ocalapalmsgolf.com/contact"
  ],
  "base_url": "https://ocalapalmsgolf.com/"
}