{
  "pages": [
    {
      "url": "https://ocoeelakeshorecenter.com/about-us/",
      "is_candidate": false,
      "has_email": true,
      "text": "Frequently Asked Questions\nHow far in advance can I book a rental?\nThe Ocoee Lakeshore Center can be booked 18 months in advance. Reservations are open to the public on the first business day of the month. (Ex. You can book December 13, 2026 on June 1, 2025)\nAre my rates subject to change once I’ve signed a contract?\nSigned contracts 12-18 months prior to the event date are subject to an increase of 10% or less of your contracted rate. If your rental is within 364 days your contracted rate will not change.\nWhat is the process for reserving a rental space?\nReserving a rental requires you to fill out a Facility Use Application with Parks and Recreation personnel. Rentals are on a first come first serve basis and require a 50% of the rental rate to secure your date. The remaining 50% balance and damage deposit is due 30 days prior to the Event date.\nWhen can I come by to make my reservation and sign my contract?\nFacility Use Applications must be signed in person Monday through Friday, 9:30am to 4:00pm by appointment. Please call ahead to schedule tours and to check staff availability. (407) 877-5803\nCan you pencil me in for a rental?\nCourtesy holds may be accepted and are held for a maximum of seven (7) days. At that time, it is not guaranteed that Parks and Recreation staff will call you prior to your courtesy hold expiration. Courtesy holds can be made in person or by phone. Unfortunately, seven day holds do not apply to reopened dates due to cancellations.\nIs there a Damage or Security Deposit in addition to my rental charge?\nA Damage Deposit of $750 is required for all rentals of the Ocoee Lakeshore Center\nHow late can I stay?\nYour event must end and all guests must vacate the premises by the end of your rental time. We do not rent past 12 a.m.\nWhat if we’re having a great time and stay later than our rental period?\nYou will be charged the standard hourly rate for any time that you are in the building past your rental period. There is no discount unless it is booked beforehand in your contract. No events can pass 12 a.m.\nCan I choose my own vendors?\nAll vendors must have insurance and submitted to OLC staff to be approved by the City of Ocoee. The kitchen is available for chilling or warming food and storing only.\nWill I receive a refund if we leave early?\nNo refunds will be given. Please follow your contract time accordingly.\nCan I have a DJ or band in the Grand Ballroom for my reception?\nYes. The DJ must be a registered and approved vendor. The City of Ocoee has a standing noise ordinance which will be provided to the DJ/band.\nCan I have music outside on the patio and/or Events Center?\nWritten approval from the Parks and Recreation Department is required for any music to be played outdoors.\nCan I have items delivered, such as from my caterer, florist, DJ, etc?\nYou must arrange for your deliveries to occur during your rental period. If you need to get in earlier, you must adjust your eight hour block to appropriately include the time you wish to enter. Delivery is available through the main building entrances unless otherwise noted. Do not block building entrances. Parks and Recreation staff are not authorized to sign for your deliveries, so you must provide an authorized person to sign for any deliveries; and due to space and security concerns, items cannot be stored for your event.\nCan I come anytime and view the building, to meet my caterer or florist, etc?\nPlease contact the Parks and Recreation Department office at (407) 877-5803 to make your appointment, reschedule or cancel an event, or for additional facility information.\nWhen do I hold my ceremony rehearsal?\nA one hour block for rehearsals is included in your Rental Rate. Rehearsals may be scheduled 30 days in advance and must take place Monday – Thursday (excluding Holidays) between 8:00am and 4:30pm based on availability.\nCan my flower girl throw rose petals?\nOnly natural flower petals are permitted in the plaza. All other loose objects like rice (including puffed rice or biodegradable rice), birdseed, silk flower petals, confetti, glitter or other similar materials (i.e. such as pearls, crystals, rhinestones, etc.) may not be used inside or outside the Ocoee Lakeshore Center. Bubbles are only permitted outside.\nCan I use sparklers for my wedding exit?\nSparklers are permitted outside of the Ocoee Lakeshore Center for your exit. However, all sparklers must be disposed of properly meaning the used sparklers must be discarded in a bucket or water or sand provided by the Renter. Failure to dispose of sparklers properly will result in a loss of the Damage Deposit.\nHow may I decorate?\nDecorations are permitted within reason. They must be approved by the Parks and Recreation staff no less than ten (10) days prior to your event and must be removed at the conclusion of your event. Decorations may not be affixed to the walls, doors, windows, window coverings, painted surfaces or hung from the ceiling. The use of tape, tacks, nails, staples, etc. are not permitted to attach your decorations. Fog/smoke machines, dry ice, and/ or open flames are not permitted. However, the use of candles enclosed in glass, such as votive and hurricane lamps may be permitted with prior approval. Rice, birdseed, silk flower petals, glitter, confetti, or other similar decorations are prohibited. The use of helium balloons are allowed in the Ocoee Lakeshore Center, however, if helium balloons become detached from a display, the labor cost to retrieve the balloons will be charged to the renter.\nCan I serve alcohol?\nAll alcoholic beverages must be served via your select caterer. Please contact your select caterer to learn their policies and procedures regarding alcohol service. A copy of the liquor liability binder must be submitted 30 days prior to the event date. If the event is reserved in less than 30 days, the renter has 5 days from the contract date to summit the liquor liability binder, otherwise forfeits the privilege and incurs a $25 fee. The City of Ocoee supports responsible drinking at all times.\nHow many parking spaces are available?\nThe Ocoee Lakeshore Center can accommodate 117 vehicles. Overflow parking is available for larger groups if necessary.\nSchedule a Tour Now",
      "emails": [
        "reservations@ocoee.org"
      ]
    },
    {
      "url": "http://www.ocoeelakeshorecenter.com/contact-us/",
      "is_candidate": false,
      "has_email": true,
      "text": "Facilitating community building through hosting events and occasions, come plan your stunning event with us. The Ocoee Lakeshore Center features several indoor and outdoor spaces suitable for all types and sizes of events, with most of the spaces being available as a package or separately based on your desires and event size.\nRequest Information\nTo request information and inquire about availability for your upcoming event please fill out the form below and a Parks and Recreation staff member will contact you.\nContact Information (all fill in boxes)\nHow did you hear about our venue?\nHow did you hear about us?\nSocial Media\nFriend/Family\nGoogle Search\nAttended Previous Event\nPerfect Wedding Guide\nWedding Venue Map\nThe Knot\nWedding Wire\nOther\nContact Information\n125 North Lakeshore Dr. Ocoee, FL 34761\nPhone:\n407-877-5803\nEmail:\nReservations@ocoee.org\nOFFICE HOURS:\nMonday – Friday: 8:00am – 5:00pm\nReservations for appointments now available\nSchedule a Tour",
      "emails": [
        "reservations@ocoee.org"
      ]
    },
    {
      "url": "https://ocoeelakeshorecenter.com/events/",
      "is_candidate": false,
      "has_email": true,
      "text": "Special Events\nProms, retirement parties, baby showers, quinceaneras, and more! The Ocoee Lakeshore Center, Withers-Maguire House, and our Outdoor Areas can accommodate a wide range of parties and celebrations all year long. Your imagination is the only limit! Let’s start planning your next event today.\nContact Us\nWeddings\nSituated on the serene Starke Lake with lush lawns and the adjacent restored, historic Withers-Maguire House, the Ocoee Lakeshore Center is the perfect setting for your once in a lifetime day. Intimate weddings can be held under the white pavilion nestled under the oak trees. Larger ceremonies and receptions will find that the ballroom and Lakeview Room are the perfect way to celebrate inside. We can’t wait to host your special day!\nContact Us\nCorporate Events\nWith state of the art audio visual systems and WIFI in not just the ballrooms but throughout the facility, we’re fully equipped to handle corporate meetings, luncheons, ceremonies, team-building events, and more! Our versatile layout allows for many different configurations to support a multitude of events and activities. We often partner with the\nWest Orange Chamber of Commerce\nfor a multitude of events throughout the year. Tell us your event details and we’ll help you build your vision.\nContact Us\nSchedule a Tour Now",
      "emails": [
        "reservations@ocoee.org"
      ]
    },
    {
      "url": "https://ocoeelakeshorecenter.com/contact-us/",
      "is_candidate": false,
      "has_email": true,
      "text": "Facilitating community building through hosting events and occasions, come plan your stunning event with us. The Ocoee Lakeshore Center features several indoor and outdoor spaces suitable for all types and sizes of events, with most of the spaces being available as a package or separately based on your desires and event size.\nRequest Information\nTo request information and inquire about availability for your upcoming event please fill out the form below and a Parks and Recreation staff member will contact you.\nContact Information (all fill in boxes)\nHow did you hear about our venue?\nHow did you hear about us?\nSocial Media\nFriend/Family\nGoogle Search\nAttended Previous Event\nPerfect Wedding Guide\nWedding Venue Map\nThe Knot\nWedding Wire\nOther\nContact Information\n125 North Lakeshore Dr. Ocoee, FL 34761\nPhone:\n407-877-5803\nEmail:\nReservations@ocoee.org\nOFFICE HOURS:\nMonday – Friday: 8:00am – 5:00pm\nReservations for appointments now available\nSchedule a Tour",
      "emails": [
        "reservations@ocoee.org"
      ]
    },
    {
      "url": "https://www.facebook.com/OcoeeLakeshoreCenter/",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    }
  ],
  "all_links": [
    "https://ocoeelakeshorecenter.com/blog/",
    "https://ocoeelakeshorecenter.com/about-us/",
    "https://ocoeelakeshorecenter.com/lakeshore-center/",
    "https://ocoeelakeshorecenter.com/gallery/",
    "https://ocoeelakeshorecenter.com/author/beatcreative/",
    "http://www.ocoeelakeshorecenter.com/contact-us/",
    "http://www.ocoeelakeshorecenter.com/schedule-a-tour/",
    "https://ocoeelakeshorecenter.com/events/",
    "https://ocoeelakeshorecenter.com/ison-center/",
    "http://www.ocoeelakeshorecenter.com/accessibility/",
    "http://www.ocoeelakeshorecenter.com/lakeshore-center/",
    "https://ocoeelakeshorecenter.com/schedule-a-tour/",
    "https://ocoeelakeshorecenter.com/",
    "http://www.ocoeelakeshorecenter.com/about-us/",
    "https://ocoeelakeshorecenter.com/small-meetings-big-impact-utilizing-olcs-intimate-spaces-for-workshops-and-seminars/",
    "https://ocoeelakeshorecenter.com/contact-us/",
    "http://ocoeelakeshorecenter.com",
    "https://ocoeelakeshorecenter.com/summer-soirees-cocktail-hours-enjoy-the-summer-before-it-slips-away/",
    "http://www.ocoeelakeshorecenter.com/withers-maguire-house/",
    "http://www.ocoeelakeshorecenter.com/bill-breeze-park/",
    "https://ocoeelakeshorecenter.com/making-your-milestone-moments-shine-host-birthday-parties-and-anniversaries-at-ocoee-lakeshore-center/",
    "https://ocoeelakeshorecenter.com/outdoor-options/",
    "https://ocoeelakeshorecenter.com/venue/",
    "https://ocoeelakeshorecenter.com/withers-maguire-house/"
  ],
  "candidate_links": [
    "https://ocoeelakeshorecenter.com/about-us/",
    "http://www.ocoeelakeshorecenter.com/contact-us/",
    "https://ocoeelakeshorecenter.com/events/",
    "https://ocoeelakeshorecenter.com/contact-us/",
    "https://www.facebook.com/OcoeeLakeshoreCenter/"
  ],
  "visited": [
    "http://www.ocoeelakeshorecenter.com/",
    "http://www.ocoeelakeshorecenter.com/about",
    "http://www.ocoeelakeshorecenter.com/contact",
    "http://www.ocoeelakeshorecenter.com/staff",
    "http://www.ocoeelakeshorecenter.com/team",
    "http://www.ocoeelakeshorecenter.com/board",
    "http://www.ocoeelakeshorecenter.com/directory",
    "http://www.ocoeelakeshorecenter.com/events",
    "http://www.ocoeelakeshorecenter.com/sitemap.xml",
    "http://www.ocoeelakeshorecenter.com/council",
    "http://www.ocoeelakeshorecenter.com/leadership",
    "http://www.ocoeelakeshorecenter.com/management",
    "http://www.ocoeelakeshorecenter.com/producers",
    "http://www.ocoeelakeshorecenter.com/support",
    "http://www.ocoeelakeshorecenter.com/crew",
    "http://www.ocoeelakeshorecenter.com/members",
    "http://www.ocoeelakeshorecenter.com/bios",
    "http://www.ocoeelakeshorecenter.com/people",
    "http://www.ocoeelakeshorecenter.com/artists",
    "http://www.ocoeelakeshorecenter.com/musicians",
    "http://www.ocoeelakeshorecenter.com/faculty",
    "http://www.ocoeelakeshorecenter.com/administration",
    "https://ocoeelakeshorecenter.com/about-us/",
    "http://www.ocoeelakeshorecenter.com/contact-us/",
    "https://ocoeelakeshorecenter.com/events/",
    "https://ocoeelakeshorecenter.com/contact-us/",
    "https://www.facebook.com/OcoeeLakeshoreCenter/"
  ],
  "base_url": "http://www.ocoeelakeshorecenter.com/"
}