{
  "pages": [
    {
      "url": "https://operanaples.org/home/education/resident-artists-program/",
      "is_candidate": false,
      "has_email": true,
      "text": "Resident Artists Program\nThe Resident Artists Program offers emerging young artists invaluable performance experience as they develop their professional opera careers. Selected through a highly competitive national search, four singers reside in Naples during the peak season and are given training and performance opportunities including principal and secondary roles in productions at the Wang Opera Center and at the Festival Under the Stars. Additionally, the singers perform a children's opera for an in-school tour and present standard operatic repertoire in numerous community outreach performances. Opera Naples staff, supplemented by area professional artists, provide coaching, instruction and career advice. Singers receive a weekly stipend, a travel stipend and housing.\nAt Opera Naples not only did I add two new roles to my repertoire working with one of the best conductors in our business, but I had so many opportunities to try new repertoire in coaching and in concert. I also enjoyed meaningful opportunities engaging with the community and all while enjoying south Florida in the winter! My time at Opera Naples was formative and fun.\nMegan Moore\nMezzo Soprano\nProgram Dates\nJanuary 19 – March 15, 2026\nLocation\nNaples, Florida U.S.A\nProductions and Roles\nScalia/Ginsburg\nby Derrick Wang\nFebruary 21 and 22, 2026 at The Wang Opera Center.  Performed in English.\nJustice Ruth Bader Ginsburg,\nmezzo soprano\nand\nsoprano\n(double cast)\nJustice Antonin Scalia,\ntenor\nThe Commentator,\nbass-baritone\nL'elisir d'amore\nby Gaetano Donizetti\nMarch 12 and 14, 2026 in Baker Park.  Performed in Italian with orchestra, conducted by Ramón Tebar.\nGianetta, soprano\nChorus, mezzo-soprano, tenor, and bass-baritone\nT\nurandot\nby Giacomo Puccini\nMarch 11 and 13, 2026 in Baker Park.  Performed in Italian with orchestra, conducted by Ramón Tebar.\nPang,\ntenor\nPing,\nbaritone\nChorus\n, soprano and mezzo-soprano\nMahler's Fourth Symphony\nMarch 1, 2026 with the Florida Philharmonic\nSoprano soloist\nIn addition to performing in the mainstage productions, the Resident Artists will be the featured soloists on three concerts with piano:\nAn Evening of Opera’s Greatest Hits, Voices of Triumph\nand\nStars and Standards: An American Songbook Celebration\nnotionvc: 06d40147-5170-493f-b2d0-e2f2a900dfd7\n. The Artists will also perform a mini opera for a school engagement tour and perform standard operatic repertoire in community concerts. Artists will receive regular coaching on production roles and standard repertoire.\nWho are the Resident Artists?\nResident Artists are emerging professionals who participate in an artistically challenging residency program with Opera Naples. They receive training and perform in mainstage productions, in-school programs and community outreach concerts and events.\nIn the 2025-26 season, Opera Naples will engage 4 Resident Artists – a soprano, mezzo-soprano, tenor and baritone.\nHow are Resident Artists compensated?\nArtists will receive $4,000 over the course of the residency divided into biweekly stipends of $1,000. Opera Naples will provide local housing and a travel stipend.\nLocal transportation is NOT provided. Naples has limited public transportation, and housing is not within walking distance to the opera center, so it is necessary for Resident Artists to have their own vehicles.\nPast Resident Artists\nApplication Process\nSubmit the following items via\nYAP Tracker.com\nApplication Form\nRésumé\n3 Professional References\nHeadshot\n3 Recorded Arias\nof contrasting styles and languages, preferably\n        video files.\nOne English\nselection is required.\n$25.00 application fee\nApply Here\nThe Resident Artist Program is supported by a grant from the\nFlorida Theatrical Association.\nThank you!\n.fl-post-content",
      "emails": [
        "ralbaugh@operanaples.org"
      ]
    },
    {
      "url": "https://operanaples.org/personnel-category/admin-staff/",
      "is_candidate": false,
      "has_email": true,
      "text": "Google Tag Manager (noscript)\nEnd Google Tag Manager (noscript)\nSkip to content\nAbout\nVisit\nPeople\nLease our Venue\nGallery\nMedia Resources\nCommunity Outreach\nUpcoming\nFestival Under the Stars\nToast to Opera Events\nOpera Naples Gala: Imperial Enchantment\nAround the World with Maestro Ramón Tebar\nSupport\nJoin Opera Naples\nGift Cards\nDonate\nName Your Seat\nSponsorship Opportunities\nDonor Acknowledgement\nEducation\nLuciano Pavarotti Foundation Opera Naples International Voice Competition\nResident Artists Program\nOpera Naples Youth Company\nIn-School Tour\nGet Involved!\nJoin Opera Naples\nVolunteer\nOpen Auditions!\nAdmin Staff\nBroughton\nJuly 11, 2025\nPosted in\nAdmin Staff\nRead More\nKyle\nApril 25, 2022\nPosted in\nAdmin Staff\nRead More\nSummers\nJune 19, 2020\nPosted in\nAdmin Staff\nRead More\nFrank\nJune 19, 2020\nPosted in\nAdmin Staff\nRead More\nAlbaugh\nJune 19, 2020\nPosted in\nAdmin Staff\nRead More\n.fl-page-content\nVisit\nOpera Naples\n2408 Linwood Ave\nNaples, FL 34112\nBox Office\n(239) 844-SING\nnotionvc: fe57eddd-0a2c-4ffd-8468-71451b08a764\nralbaugh@operanaples.org\nStudent Tickets Available\nIn-Season Box Office Hours\nMonday - Friday\n10am - 4pm\nnotionvc: 4e94285c-4882-4ece-b1bb-c351f883bf16\nConnect\nPlease enter your name.\nPlease enter a valid email address.\nSubscribe!\nSomething went wrong. Please check your entries and try again.\nMission\nOur mission is to be a professional opera company known for excellence and innovation by presenting quality opera, musical performances, education and community engagement programs.\n© 2024 Opera Naples. | Development & Hosting by\nB3 Marketing\n.fl-page\n×\nScroll To Top\nGoogle Tag Manager (noscript)\nEnd Google Tag Manager (noscript)",
      "emails": [
        "ralbaugh@operanaples.org"
      ]
    },
    {
      "url": "https://operanaples.org/home/about/",
      "is_candidate": false,
      "has_email": true,
      "text": "About\nSince 2006, Opera Naples brings internationally acclaimed artists to perform in some of the most beloved operas and world-class performances, earning significant praise from both critics and patrons. Just two years after its inception, Opera Naples was named Best Performing Arts Group by Gulfshore Life magazine! A community-based, nonprofit arts organization rooted in volunteerism, education and audience engagement, Opera Naples conducts an educational outreach program in local schools and an artist-in-residence program for emerging opera singers and the Opera Naples Academy, a 10-day intensive for exceptional professional opera singers to train with such opera luminaries as Sherrill Milnes, Veronica Villaroel, Manny Perez and Maestro Ramón Tebar. Opera Naples produces a full season of opera and concerts in its permanent home, the Wang Opera Center and its annual Festival Under the Stars in downtown Naples’ Cambier Park.\nnotionvc: e1d79040-2c02-4a3d-9426-859449fa272c\nMission Statement:\nTo be a professional opera company known for excellence and innovation by presenting quality opera, musical performances, education and community engagement programs.\nBeginnings\nThe company made its official debut with a Viennese-style New Year’s ball on the eve of 2006. Since then its many performances in a wide variety of venues have consistently earned rave reviews and standing ovations. Just two years after its inception, Opera Naples was named Best Performing Arts Group by Gulfshore Life magazine\nIn its first decade, the company has presented such well-known grand operas as\nLa bohème, Carmen, Cosi fan Tutte, Don Giovanni, Faust, Elijah, Eugene Onegin, Il Trovatore, La Traviata, Madama Butterfly, Nabucco, Rigoletto, The Barber of Seville, Pagliacci, The Magic Flute\nand\nTosca\n. It has staged modern works such as\nLa Tragedie de Carmen, Maria de Buenos Aires, Tango, The Medium\nand\nThe Telephone\nand has produced major choral works such as Verdi’s Requiem. It has staged performances in venues ranging from the Artis–Naples Hayes Hall to local churches, schools, retirement communities and a public park.\nOpera Naples has become firmly established as the city’s opera company and an important part of the cultural life of the region. We are proud to have earned local, regional and state government support and are very grateful to our sponsors, donors and patrons who continue to encourage us and grow in number.\nThe David and Cecile Wang Opera Center\nThe David and Cecile Wang Opera Center serves as the centerpiece of the Davis Triangle Redevelopment Zone in east Naples, an area specifically focused on Culture and the Arts. The purchase of the land and the construction of the facility were funded mainly by private donors and supplemented through grants from the State of Florida. The resulting complex, which features administrative offices, rehearsal rooms, set and costume storage areas and the Judy and John Hushon Theatre, is devoted equally to public musical performance and to the education of multiple age levels and is believed to be the first of its kind in SW Florida. Opera Naples (the Wang Center's resident organization) currently stages professional chamber operas and concerts, as well as presents young artists’ auditions and performances on site.  It also uses the facility to routinely collaborate with many other local artistic groups, such as Artis-Naples, TheatreZone and the music department of Florida's Gulf Coast University.  Finally, the facility's performing spaces are also made available to a wide variety of local community groups. For more information on leasing the Wang Opera Center please go to the\n\"Lease our Venue\"\ntab located under the \"About\" tab.\nStrategic Objectives\nAttract a growing audience by producing a range of quality operatic and musical productions\nAchieve short-term financial health and establish a sound financial footing for the future\nIncrease individual donations from the current level of $400,000 to at least $800,000 by 2024\nIdentify and secure desirable, cost-effective performance venues that meet artistic requirements\nExpand educational and community engagement programs\nStrengthen Board and Staff\nEnhance and promote the image, brand and reputation of Opera Naples\nGuild of Opera Naples.\nBeing a Guild Member is a wonderful opportunity to go behind the scenes, meet cast members and experience the life of a theatrical operation firsthand while knowing you are helping to keep opera alive in their community.\nPremier event space.\nHost spectacular receptions, recitals, concerts and conferences in our large event space in the heart of Naples. Enjoy theatrical lighting, sound and projection with up to 320 tiered seats and 120 cafe-style seats.\nLease our Venue\nSupporting our community.\nJoin us in our mission to provide powerful and insightful performances and help our community grow culturally through education and outreach to all ages and stages.\nSupport our Mission\n.fl-post-content",
      "emails": [
        "ralbaugh@operanaples.org"
      ]
    },
    {
      "url": "https://operanaples.org/toast-to-opera-events-2025/",
      "is_candidate": false,
      "has_email": true,
      "text": "Learn about Opera composers, historical context, story, characters and musical themes at our themed Toast to Operas! Meet the cast, and more!",
      "emails": [
        "ralbaugh@operanaples.org"
      ]
    },
    {
      "url": "https://operanaples.org/home/about/people/",
      "is_candidate": false,
      "has_email": true,
      "text": "People\nThe dedicated board, staff and administration that supports and fosters our dedicated organization.\nDirectors\nMelanie Kalnins\nExecutive Director\nButton trigger modal\nBio\nEmail\nModal\nKalnins\n×\nMelanie is a seasoned arts administrator with over two decades of experience at premier arts organizations. While she began her professional career in the advertising sales office of CBS Television Networks in Chicago, she quickly determined that her true passion was a career in the arts. For 20 years, she served the legendary Chicago Symphony Orchestra Association in a variety of marketing roles including Director of Marketing and Business Analysis. During her tenure with the CSOA, she increased revenues by $5 million through creative marketing promotions and a sophisticated dynamic pricing strategy. Locally, Melanie served at Artis—Naples as Vice President of Marketing and Patron Engagement where she quickly learned to understand the Southwest Florida market and media landscape. Melanie was first introduced to Opera Naples when she was hired to do marketing and publicity work for the Opera Naples 2024 Festival Under the Stars, and she is pleased to now serve the organization in a more expanded role.\nMelanie is a proud graduate of Northwestern University, where she majored in Communications Studies with a minor in Integrated Arts. An accomplished vocalist and pianist, she also has a background in performing in community and professional musical theater productions as well as singing in Chicago rock bands.\nRamón Tebar\nArtistic and Music Director\nButton trigger modal\nBio\nModal\nTebar\n×\nSpanish Conductor Ramón Tebar is currently Principal Conductor in Association with the Orquesta de Valencia, as well as Artistic and Music Director of Opera Naples. He was previously Artistic Director of the Florida Grand Opera and Principal Guest Conductor of Valencia’s Palau de les Arts Reina Sofia.\nAlongside his work in Valencia, the 2022/23 season will see Ramón Tebar make his debuts with the Cincinnati Symphony, the Calgary Philharmonic, the Copenhagen Philharmonic, Norrlandsoperans Syfoniorkester, the Würth Philharmoniker, and at the Frankfurt Opera with a new production of Saverio Mercadante’s Francesca da Rimini. This season he will also return to the Teatro Colón to conduct Bizet’s Les pêcheurs de perles, and to the Szczecin Philharmonic and the Basque National Orchestra in Bilbao for concerts. Ramón Tebar will also direct Opera Naples third annual Festival Under the Stars.\nRamón Tebar is considered one of the leading Spanish conductors of his generation. Acclaimed for his musical versatility, compelling interpretations and orchestra building skills, conductor Ramón Tebar’s international reputation in both the opera and orchestral arenas continues to expand. Among the orchestras and opera companies he has conducted and will conduct are: Philharmonia Orchestra, Cincinnati Symphony, St. Petersburg Symphony, Moscow State Symphony, Malasyan Philharmonic, Orchestre de Rouen, Het Gelders Orkest, Bulgarian National Radio Symphony, Munich Radio Symphony, Prague Philharmonia, Spanish National Orchestra (OCNE), Spanish Radio Television Orchestra (ORTVE), Barcelona Symphony Orchestra (OBC), Galicia Symphony Orchestra (OSG), Valencia Orchestra,…Teatro Regio di Torino, Teatro Regio di Parma, Cincinnati Opera, Teatro Colón (Buenos Aires), Gran Teatre del Liceu, Kremlin Palace, Royal Festival Hall, Kölner Philharmonie, Concertgebouw Amsterdam, Wiener Staatsoper,…\nRamón Tebar has been recognized with various honors and awards, including the Henry C. Clark Conductor of the Year Award by Florida Grand Opera in 2010 and 2013, The Miami Herald as “Top 20 under 40” and “100 españoles by Marca España”. In 2014, he was bestowed the Cross of Officer of the Order of Mérito Civil in recognition of his cultural accomplishments by His Majesty, the King of Spain Felipe VI.\nTebar has recorded for UNIVERSAL MUSIC, UNITEL CLASSICA and DECCA.\nBoard\nOfficers\nBronwen Adams\nCo-Chair, Trustee\nEmail\nModal\nAdams\n×\nLarry Ost\nCo-Chair, Trustee\nButton trigger modal\nBio\nModal\nOst\n×\nLarry Ost\nis the former Chief Executive Officer of a multinational manufacturing company.  He is a member of the Chaine des Rotisseurs and of the Circumnavigators Club. He brings his extensive skills in management and planning to the Board.\nGerald Goldberg\nChairman Emeritus\nButton trigger modal\nBio\nModal\nGoldberg\n×\nGerald Goldberg\nis one of the Founders of Opera Naples and served as Chairman and as General Director of the organization for many years.  An aerospace engineer by training, Mr. Goldberg is also a real estate developer and is a member of Naples Board of Realtors.\nLinda Kehoe\nSecretary of the Board, Director\nButton trigger modal\nBio\nModal\nKehoe\n×\nLinda Kehoe\nis Secretary of the Board of Directors. Linda brings to the board the organizational skills she developed as National Account Manager for AT&T.  She is a member of the Naples Sailing and Yacht Club. She has hosted Resident Artists and Opera Naples Academy students at her home in Naples.  Mrs. Kehoe spends the summer in Cooperstown, New York.\nTrustees\nJan Burrus\nButton trigger modal\nBio\nModal\nBurrus\n×\nJan Burrus\nis the retired Chief Executive Officer of GMI Signage Co.  She has been a managing partner in several commercial and real estate ventures, including development and management of properties in several states.\nSally Gleason\nButton trigger modal\nBio\nModal\nGleason\n×\nSally Gleason\nis the former President and member of the Executive Committee of Grand Rapids Opera.  She was a Public Relations Officer, Special Events, for Seyferth and Associates.  Mrs. Gleason is a co-founder of the Women’s Giving Circle of SW Florida and is the former communications director of the Christ Child Society of Naples.\nJohn Pepe\nVice Chairman\nButton trigger modal\nBio\nModal\nPepe\n×\nJohn Pepe\nis Vice Chairman and Treasurer of Opera Naples.  He is the Chairman and Co-Founder of Hydraforce, Inc., and President of JMP Investments LLC. He has served on a number of non-profit boards, including the Order of St. Francis Hospital Group, the St. Anthony Medical Center and Patricia D. Pepe Center for Cancer Care in Rockford, Illinois.  He is an adviser to the Venture Capital Committee of OSF Health Care and is a member of the Italian Cultural Society of Naples.\nBoard of Directors\nDr. Krzysztof Biernacki, DMA | University Partner\nButton trigger modal\nBio\nModal\nBiernacki, DMA | University Partner\n×\nDr. Krzysztof Biernacki\nis the newly appointed Director of Bower School of Music & the Arts.  Prior to FGCU, he has held the position of Professor of Voice and Director of Opera at the University of North Florida where he distinguished himself as an award-winning professor, international performer, opera stage director and academic administrator.  He is a frequent recitalist performing a wide range of art song repertoire in numerous European languages.  His recent engagements include solo recitals at international music festivals in Spain, Italy, Germany, Poland, Bulgaria, Macedonia, Serbia, France, Norway and Canada.  He is a researcher of vocal works by Polish composer Karol Szymanowski and his recording of Szymanowski’s art songs titled “In the Mists” is available on MSR Classic label.  As an opera singer he appeared in principal roles with Vancouver Opera, Manitoba Opera, Calgary Opera, Orchestra London Canada and Banff Center for Performing Arts. His concert appearances include Vancouver Symphony Orchestra, North Czech Philharmonic, Orchestre Philharmonique du Nouveau Monde in Montreal and Jacksonville Symphony Orchestra. As an opera stage director, he directed over 30 opera productions at UNF, University of British Columbia, Jacksonville Symphony and European Music Academy in the Czech Republic.  In 2007 he established a highly successful UNF Opera Ensemble and UNF Opera Study Abroad Program in Europe where he directed full opera productions in professional opera theaters every summer.  Dr. Biernacki is a graduate of University of Manitoba, University of Western Ontario and University of British Columbia.  Since 2012 he has served as the Assistant director of UNF School of Music, Director of Graduate Studies and Artistic Director of Cummer Family Foundation Chamber Music Series.\nMoira Fennessey\nButton trigger modal\nBio\nModal\nFennessey\n×\nMoira Fennessey\nwas a special speech audiologist and Director of Special Gifted Education for the New Jersey State Department of Education.  Mrs. Fennessey is active in the Italian Cultural Society, the Italian American Foundation, Chaine des Rotisseurs, Legatus, and the Latchkey League.  She brings her skills in event planning and in governance to the Board.\nLivio Ferrari\nButton trigger modal\nBio\nModal\nFerrari\n×\nLivio Ferrari\nis a co-founder of Opera Naples and the owner of Ferrari Fitness Center.\nElizabeth Harrington\nButton trigger modal\nBio\nModal\nHarrington\n×\nElizabeth Harrington began her career in Brand Management at Procter and Gamble. Then she joined the J. Walter Thompson advertising firm as Vice President of Client Services. She was recruited to Quaker Oats as Vice President of Strategy & Marketing and CEO of their Adcom subsidiary. While at Quaker, she was a member of the team which conducted one of the first American joint ventures in China. She then joined A.T. Kearney as a Partner of their Global Strategy practice. Ms. Harrington was recruited to Pillsbury – GrandMet as Vice President and General Manager of Asia. Then she joined PricewaterhouseCoopers as a Partner of their Global Strategy and China practices. When she retired from PwC, she became North American Publisher of Hurun Report, Asia’s leading business media platform. She has been privileged to serve on the boards of directors of the Chicago Mercantile Exchange, the Warranty Group, United Charities Chicago and the American Advertising Federation.\nEric Kalnins\nButton trigger modal\nBio\nModal\nKalnins\n×\nEric Kalnins, TEP, J.D., LL.M., is Managing Partner of Ice Miller, LLP’s Naples law office.  He practices in the areas of business structuring, tax, estate planning and the family office market.  Prior to making his home in Naples, he was in Chicago for over 20 years and was a Governing Member with the Chicago Symphony Orchestra and remains a member of the Chicago Yacht Club.  When not golfing, or spending time with his wife and three children, Mr. Kalnins teaches as an adjunct professor of law at Ave Maria School of Law in Naples, and acts as Honorary Consul for the Republic of Latvia.\nJan Kantor\nButton trigger modal\nBio\nModal\nKantor\n×\nJan Kantor is the founder and owner of Success Systems, a business consulting firm that helps organizations improve internal communication, leadership, teamwork, and overall business performance. A resident of Naples, Florida for over 50 years, Jan is a respected voice in business and civic leadership throughout Southwest Florida.\nOriginally from Miami, Jan began his radio career at age 16, turning a hobby into a profession. After moving to Southwest Florida in 1973, he and a partner acquired two local radio stations and led them to great success. He sold his share of the stations in 1982, retired briefly, then launched Success Systems to address the growing need for business development resources in the region. The firm also offers executive coaching to help leaders clarify vision, improve execution, and drive meaningful growth.\nJan has been instrumental in shaping leadership programs across the area. He served on the charter steering committees for Leadership Lee (1985) and Leadership Southwest Florida (1989) and was a founder and first chairman of Leadership Bonita. In 2009, he established the Leadership Collier Alumni Association, which continues to thrive today. He was honored as Director of the Year by the Bonita Springs Area Chamber Board of Directors. Jan serves currently as the Chairman of the Leadership Collier Foundation.\nA longtime columnist for local publications, Jan is also the author of Inspiring People in the Workplace, a practical guide to motivating and leading others. He is married to Kim Ciccarelli Kantor, and together they remain active in the community they’ve long called home.\nSusan Mullin\nButton trigger modal\nBio\nModal\nMullin\n×\nSusan Mullin retired from the investment business in Boston where she was a securities trader for Wellington Management and Lehman Brothers. Subsequently, she was a Guardian ad Litem in the Boston Juvenile Court and now is a panel member on the Citizens Foster Care Review Board in Naples. She is a member of the Royal Poinciana Golf Club Scholarship Committee and was a member of the Board there for 6 years.\nKathleen Field Orr\nButton trigger modal\nBio\nModal\nOrr\n×\nKathleen Field Orr, a native of Chicagoland, has practiced law for over fifty years in Illinois and is a Senior Partner at the law firm of Ottosen, DiNolfo, Hasenbalg & Castaldo, Ltd. Ms. Orr has focused her law practice in the area of local government law and has concentrated in all areas of municipal law and municipal finance. In addition to serving as Special Counsel to approximately 40 municipalities in the State of Illinois, she is currently serving as City Attorney of the United City of Yorkville, Illinois, and Village Attorney of the Village of West Dundee, Illinois, the Village of Carbon Cliff, Illinois, and the Village of Flossmoor, Illinois.\nWhen not involved in matters of law she is a Governing Member of the Chicago Symphony Orchestra and on the Board of Directors of the Illinois Philharmonic Orchestra for over 40 years where she has served as President and a member of its Executive Board. Ms. Orr’s interest in Opera is evidenced by her season subscription for over thirty years to the Lyric Opera of Chicago and hopes to be active as Opera Naples continues to broaden its presence and importance in Southwest Florida.\nMelody Sawyer Richardson\nButton trigger modal\nBio\nModal\nMelody Sawyer Richardson\n×\nMelody was raised in Cincinnati in a family that prized education, appreciated the arts, and instilled a core value that it is important always to support and give back to the community in which you live. She earned her bachelor’s degree from the University of Cincinnati (magna cum laude, Phi Beta Kappa), a master’s degree in social work from Ohio State, and her MBA and law degrees from Rutgers University, where she was on the Law Review.\nAfter a successful twenty-three-year career working in New York City as an attorney at a Wall Street law firm, Chase Manhattan Bank, and then as general counsel for a real estate developer in New Jersey, she returned to Cincinnati to restore her family home in Hyde Park, to work in real estate, and to devote her time to serving on arts, civic, and historic preservation boards.\nFrom 2006 to 2010, Ms. Richardson served as Director, Commercial Division of the Comey & Shepherd City Office, and was named Industry Top Producer in 2007. She has served as a board member for George Washington’s Mount Vernon, the U.S. Department of State Diplomatic Reception Rooms Oversight Board in Washington, D.C. and Winterthur, the Henry Francis Dupont Estate in Wilmington, Delaware. She has served as board chair for the Cincinnati Symphony Orchestra, Cincinnati Ballet, and the Southwest Ohio Regional Transit Authority. She has also volunteered on the boards of the Cincinnati Chamber Orchestra, Cincinnati Opera, May Festival, Contemporary Arts Center, and the Society for the Prevention of Cruelty to Animals. In 2020, she was honored as one of 100 Influential Women in the Arts by Cincinnati’s Arts and the Power of Her. From 2008 through 2014, she was named to Cincy Business Magazine Power 100. She has one grown son, Peter Chabris, married to Lynn, and two grandchildren Sophie, 20 and Crisper, 15.\nShe became a property owner in Naples, Florida in 2008 and spends most of her time here in her condominium in the Venetian Village area of Naples. She also has a condominium in Cincinnati, Ohio. She currently serves on the Boards of Opera Naples and the Red Cross-Florida Gulf Coast to Heartland Chapter.\nStaff\nRita Albaugh\nDirector of Box Office and Volunteers\nButton trigger modal\nBio\nEmail\nModal\nAlbaugh\n×\nRita Albaugh is Box Office Manager for Opera Naples where she has overseen ticket sales and provided excellent customer service for 40+ productions. She is renowned for her versatility, attention to detail, passion for opera and devotion to promoting a lifelong love for music and the arts. Rita is a founding charter member of the local chapter of the women’s group Soroptimist of Naples where she served as president, director of membership/publicity and recording secretary. She is a successful grant writer and coordinated fundraising events to benefit PACE Center for Girls, the Shelter for Abused Women and Children, the Alzheimer’s Association – Gulf Coast Chapter, the Alzheimer’s Support Network of Naples, the Neighborhood Health Clinic, and Humane Society Naples. Rita has overseen Opera Naples’ 100+ volunteer member group, arranged schedules for staff operations and assisted the executive team with financial statements and accounting reports, marketing efforts, proofreading, caterers, and valets. She was Box Office Manager and Group Sales Manager for TheatreZone, and has a background in marketing, elder care, and at Texas Instruments in Dallas, Texas, in college and professional staffing as well as a buyer in the research division.\nNora Lastre Broughton\nFinance and Administration Manager\nButton trigger modal\nBio\nModal\nBroughton\n×\nNora is an experienced arts administrator and professional violinist with several years of performance and leadership experience in South Florida’s cultural scene. She previously served as General Manager and COO of the Southwest Florida Symphony, where she oversaw finances, operations and organizational planning. Originally from Cuba, she holds a Bachelor’s degree in Music from the Music Conservatory of Aragon, Spain and a Professional Performance Certificate from Lynn University. Her dual background allows her to align fiscal responsibility with creative vision—making her especially attuned to the needs of performing arts organizations like Opera Naples.\nnotionvc: 32127d89-c768-4d22-a734-a940763b67d2\nRobin Shuford Frank\nMusic Administrator, Chorus Master, Director of Education and Community Outreach\nButton trigger modal\nBio\nEmail\nModal\nFrank\n×\nRobin Shuford Frank is Director of Education and Community Outreach, Chorus Master, and Music Administrator for Opera Naples. She manages Opera Naples professional Resident Artist Program, Student Apprentice Program, Elementary School tours, and community engagement programs. An accomplished pianist, she is Musical Director for community and youth productions, a rehearsal pianist for main productions, and performs as a collaborative pianist. Frank is the accompanist for The Festival Singers of Florida and performs with the Naples Philharmonic and The Naples Players. She is a frequently sought guest accompanist for choral festivals and has performed and taught masterclasses in China and Indonesia. Frank is also an Adjunct Professor in the Bower School of Music at Florida Gulf Coast University. Frank’s previous employment includes Adjunct Professor at Palm Beach Atlantic University, Pianist and Coach with Opera New Jersey, rehearsal pianist at Palm Beach Opera, and Artist in Residence at Bak Middle School of the Arts. She has a Masters degree in Accompanying and Vocal Coaching from Westminster Choir College and a Bachelors degree in Music Education from The Florida State University.\nKent Kyle\nDirector of Development and Operations\nButton trigger modal\nBio\nEmail\nModal\nKyle\n×\nKent has dedicated himself to building arts and environmental based organizations of impact to the greater Naples community, most recently with Naples Botanical Garden, Inc. as Planned and Major Gifts Development Officer, and Gulfshore Playhouse, Inc. as Director of Corporate and Foundation Relations. Kent has served on local finance committees and is treasurer of a national genealogical society. He was an investment professional beginning with Prudential Securities in NYC, Fleet Enterprises in NJ, and ultimately as a Senior Trust Officer with Merchants Trust Company in Burlington, VT. He holds a Master of Science in Finance from FIU, a Bachelor of Arts in Political Economics from Middlebury College, and certification from The Fund Raising School at the Indiana University Lilly Family School of Philanthropy. He is a past individual member of Greater Naples Area Planned Giving Council, Association of Fundraising Professionals, the FL Southwest Chapter of the Association of Fundraising Professionals, and was organizationally active with the Central American Botanic Garden Network and the American Public Gardens Association.\nLeah Summers\nArtistic Coordinator\nButton trigger modal\nBio\nEmail\nModal\nSummers\n×\nLeah has appeared extensively throughout Europe and the US. She has performed leading roles at the Vienna Staatsoper, Deutsche Oper Berlin, Hamburg Opera, New York City Opera, Dallas Opera, Opera Colorado, Santa Fe Opera, Opera Naples, Pittsburgh Opera, Juilliard Opera Center, Opera Orchestra of New York with Eve Queller at Carnegie Hall. A soloist with the NY Chamber Orchestra, the Ensemble Musica Sacra in Salzburg, the Tanglewood Music Festival Orchestra, the New Juilliard Ensemble, the New York Festival of Song and Music Niagara in Canada. She has recorded Mahler’s 8th Symphony with the Dallas Symphony and solo songs by Stephan Volpe.\nA recipient of a Fulbright scholarship to Universität für Musik und darstellende Kunst in Vienna, Austria, a Herbert von Karajan grant from the Vienna Staatsoper, a William Matheus Sullivan career grant, and a finalist of the Richard Tucker Foundation Awards. She is a graduate of the University of Miami and the Juilliard School in NYC.\nContract Services\nYB Productions | Production Support\nApplause Marketing | Program Book Advertising\nB3 Marketing | Marketing Support\nGary Kelson | Sales Development\nSupport Opera Naples!\nYour financial contribution provides the solid fiscal base on which locally produced grand opera can grow and thrive in Southwest Florida.\nYour gift is a critical part of our operation that not only provides education and outreach programs to adults and students throughout the region but also allows us to continue offering tickets to our performances at prices that are accessible to the entire community. Naming opportunities for Season, Production, Performance and Artist sponsorships are also available.\nMake a Gift\n.fl-post-content",
      "emails": [
        "bronwenadams@aol.com",
        "kkyle@operanaples.org",
        "lsummers@operanaples.org",
        "mkalnins@operanaples.org",
        "ralbaugh@operanaples.org",
        "rfrank@operanaples.org"
      ]
    },
    {
      "url": "https://operanaples.org/personnel-category/academy-faculty/",
      "is_candidate": false,
      "has_email": true,
      "text": "Google Tag Manager (noscript)\nEnd Google Tag Manager (noscript)\nSkip to content\nAbout\nVisit\nPeople\nLease our Venue\nGallery\nMedia Resources\nCommunity Outreach\nUpcoming\nFestival Under the Stars\nToast to Opera Events\nOpera Naples Gala: Imperial Enchantment\nAround the World with Maestro Ramón Tebar\nSupport\nJoin Opera Naples\nGift Cards\nDonate\nName Your Seat\nSponsorship Opportunities\nDonor Acknowledgement\nEducation\nLuciano Pavarotti Foundation Opera Naples International Voice Competition\nResident Artists Program\nOpera Naples Youth Company\nIn-School Tour\nGet Involved!\nJoin Opera Naples\nVolunteer\nOpen Auditions!\nAcademy Faculty\nBilgili\nDecember 30, 2024\nPosted in\nAcademy Faculty\nRead More\nColabianchi\nDecember 30, 2024\nPosted in\nAcademy Faculty\nRead More\nYelena Kurdina\nNovember 22, 2024\nPosted in\nAcademy Faculty\nRead More\nManny Perez\nNovember 22, 2024\nPosted in\nAcademy Faculty\nRead More\nMaria Todaro\nNovember 19, 2024\nPosted in\nAcademy Faculty\nRead More\nLouis Otey\nNovember 19, 2024\nPosted in\nAcademy Faculty\nRead More\nNicoletta Pavarotti\nNovember 19, 2024\nPosted in\nAcademy Faculty\nRead More\nMatheson\nNovember 19, 2024\nPosted in\nAcademy Faculty\nRead More\nBruce Ford\nNovember 19, 2024\nPosted in\nAcademy Faculty\nRead More\nDr. Krzysztof Biernacki, DMA | University Partner\nNovember 19, 2024\nPosted in\nAcademy Faculty\nRead More\n1\n2\nNext »\n.fl-page-content\nVisit\nOpera Naples\n2408 Linwood Ave\nNaples, FL 34112\nBox Office\n(239) 844-SING\nnotionvc: fe57eddd-0a2c-4ffd-8468-71451b08a764\nralbaugh@operanaples.org\nStudent Tickets Available\nIn-Season Box Office Hours\nMonday - Friday\n10am - 4pm\nnotionvc: 4e94285c-4882-4ece-b1bb-c351f883bf16\nConnect\nPlease enter your name.\nPlease enter a valid email address.\nSubscribe!\nSomething went wrong. Please check your entries and try again.\nMission\nOur mission is to be a professional opera company known for excellence and innovation by presenting quality opera, musical performances, education and community engagement programs.\n© 2024 Opera Naples. | Development & Hosting by\nB3 Marketing\n.fl-page\n×\nScroll To Top\nGoogle Tag Manager (noscript)\nEnd Google Tag Manager (noscript)",
      "emails": [
        "ralbaugh@operanaples.org"
      ]
    },
    {
      "url": "https://operanaples.org/home/support/",
      "is_candidate": false,
      "has_email": true,
      "text": "Make an Impact\nWe need YOU more than ever to continue bringing the joy of opera to you and our community.\nMake a Gift\nYour tax-deductible unrestricted do­nations, large and small, make it possible for Opera Naples to continue its mission, its many artistic and educational programs and ongoing improve­ments to the Wang Opera Center. We couldn’t do it without you!\nSupport ON with a Gift\nJoin the Millennium Club\nTo keep this important art form alive in our community, Opera Naples’ Millennium Club members make a yearly commitment of support. As a member, you’ll have opportunities to learn what it takes to bring the magic to life and to meet internationally acclaimed artists in small group settings as well as enjoying the company of fellow VIPs.\nLearn More\nDonor Acknowledgement\nWith heartfelt thanks, Opera Naples acknowledges our generous sponsors who make the grandest of art forms thrive in Southwest Florida. Click below to see the patrons who have made contributions in the past twelve months. This list is updated on a quarterly basis.\nView our Donors\nFinancial Disclosure\nA COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES BY CALLING TOLL-FREE (800-435- 7352) WITHIN THE STATE. REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL, OR RECOMMENDATION BY THE STATE.\"\nGuild of Opera Naples.\nBeing a Guild Member is a wonderful opportunity to go behind the scenes, meet cast members and experience the life of a theatrical operation firsthand while knowing you are helping to keep opera alive in their community.\nBecome a Guild Member\nPremier event space.\nHost spectacular receptions, recitals, concerts, and conferences in our large event space in the heart of Naples. Enjoy theatrical lighting, sound and projection with up to 320 tiered seats and 120 cafe-style seats.\nLease our Venue\nSupporting our community.\nJoin us in our mission to provide powerful and insightful performances and help our community grow culturally through education and outreach to all ages and stages.\nSupport our Mission\n.fl-post-content",
      "emails": [
        "ralbaugh@operanaples.org"
      ]
    },
    {
      "url": "http://www.operanaples.org/home/support/",
      "is_candidate": false,
      "has_email": true,
      "text": "Make an Impact\nWe need YOU more than ever to continue bringing the joy of opera to you and our community.\nMake a Gift\nYour tax-deductible unrestricted do­nations, large and small, make it possible for Opera Naples to continue its mission, its many artistic and educational programs and ongoing improve­ments to the Wang Opera Center. We couldn’t do it without you!\nSupport ON with a Gift\nJoin the Millennium Club\nTo keep this important art form alive in our community, Opera Naples’ Millennium Club members make a yearly commitment of support. As a member, you’ll have opportunities to learn what it takes to bring the magic to life and to meet internationally acclaimed artists in small group settings as well as enjoying the company of fellow VIPs.\nLearn More\nDonor Acknowledgement\nWith heartfelt thanks, Opera Naples acknowledges our generous sponsors who make the grandest of art forms thrive in Southwest Florida. Click below to see the patrons who have made contributions in the past twelve months. This list is updated on a quarterly basis.\nView our Donors\nFinancial Disclosure\nA COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES BY CALLING TOLL-FREE (800-435- 7352) WITHIN THE STATE. REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL, OR RECOMMENDATION BY THE STATE.\"\nGuild of Opera Naples.\nBeing a Guild Member is a wonderful opportunity to go behind the scenes, meet cast members and experience the life of a theatrical operation firsthand while knowing you are helping to keep opera alive in their community.\nBecome a Guild Member\nPremier event space.\nHost spectacular receptions, recitals, concerts, and conferences in our large event space in the heart of Naples. Enjoy theatrical lighting, sound and projection with up to 320 tiered seats and 120 cafe-style seats.\nLease our Venue\nSupporting our community.\nJoin us in our mission to provide powerful and insightful performances and help our community grow culturally through education and outreach to all ages and stages.\nSupport our Mission\n.fl-post-content",
      "emails": [
        "ralbaugh@operanaples.org"
      ]
    },
    {
      "url": "https://operanaples.org/personnel-category/board-members/board-of-directors/",
      "is_candidate": false,
      "has_email": true,
      "text": "Google Tag Manager (noscript)\nEnd Google Tag Manager (noscript)\nSkip to content\nAbout\nVisit\nPeople\nLease our Venue\nGallery\nMedia Resources\nCommunity Outreach\nUpcoming\nFestival Under the Stars\nToast to Opera Events\nOpera Naples Gala: Imperial Enchantment\nAround the World with Maestro Ramón Tebar\nSupport\nJoin Opera Naples\nGift Cards\nDonate\nName Your Seat\nSponsorship Opportunities\nDonor Acknowledgement\nEducation\nLuciano Pavarotti Foundation Opera Naples International Voice Competition\nResident Artists Program\nOpera Naples Youth Company\nIn-School Tour\nGet Involved!\nJoin Opera Naples\nVolunteer\nOpen Auditions!\nBoard of Directors\nOrr\nJune 9, 2025\nPosted in\nBoard of Directors\nRead More\nKantor\nMay 13, 2025\nPosted in\nBoard of Directors\nRead More\nHarrington\nApril 8, 2025\nPosted in\nBoard Members\n,\nBoard of Directors\nRead More\nKalnins\nFebruary 18, 2025\nPosted in\nBoard Members\n,\nBoard of Directors\nRead More\nMelody Sawyer Richardson\nNovember 15, 2024\nPosted in\nBoard Members\n,\nBoard of Directors\nRead More\nBiernacki, DMA | University Partner\nJune 11, 2021\nPosted in\nBoard Members\n,\nBoard of Directors\nRead More\nMullin\nJanuary 25, 2021\nPosted in\nBoard Members\n,\nBoard of Directors\nRead More\nFerrari\nJune 21, 2020\nPosted in\nBoard Members\n,\nBoard of Directors\nRead More\nFennessey\nJune 21, 2020\nPosted in\nBoard Members\n,\nBoard of Directors\nRead More\n.fl-page-content\nVisit\nOpera Naples\n2408 Linwood Ave\nNaples, FL 34112\nBox Office\n(239) 844-SING\nnotionvc: fe57eddd-0a2c-4ffd-8468-71451b08a764\nralbaugh@operanaples.org\nStudent Tickets Available\nIn-Season Box Office Hours\nMonday - Friday\n10am - 4pm\nnotionvc: 4e94285c-4882-4ece-b1bb-c351f883bf16\nConnect\nPlease enter your name.\nPlease enter a valid email address.\nSubscribe!\nSomething went wrong. Please check your entries and try again.\nMission\nOur mission is to be a professional opera company known for excellence and innovation by presenting quality opera, musical performances, education and community engagement programs.\n© 2024 Opera Naples. | Development & Hosting by\nB3 Marketing\n.fl-page\n×\nScroll To Top\nGoogle Tag Manager (noscript)\nEnd Google Tag Manager (noscript)",
      "emails": [
        "ralbaugh@operanaples.org"
      ]
    },
    {
      "url": "https://operanaples.org/personnel-category/board-members/",
      "is_candidate": false,
      "has_email": true,
      "text": "Google Tag Manager (noscript)\nEnd Google Tag Manager (noscript)\nSkip to content\nAbout\nVisit\nPeople\nLease our Venue\nGallery\nMedia Resources\nCommunity Outreach\nUpcoming\nFestival Under the Stars\nToast to Opera Events\nOpera Naples Gala: Imperial Enchantment\nAround the World with Maestro Ramón Tebar\nSupport\nJoin Opera Naples\nGift Cards\nDonate\nName Your Seat\nSponsorship Opportunities\nDonor Acknowledgement\nEducation\nLuciano Pavarotti Foundation Opera Naples International Voice Competition\nResident Artists Program\nOpera Naples Youth Company\nIn-School Tour\nGet Involved!\nJoin Opera Naples\nVolunteer\nOpen Auditions!\nBoard Members\nOrr\nJune 9, 2025\nPosted in\nBoard of Directors\nRead More\nKantor\nMay 13, 2025\nPosted in\nBoard of Directors\nRead More\nHarrington\nApril 8, 2025\nPosted in\nBoard Members\n,\nBoard of Directors\nRead More\nKalnins\nFebruary 18, 2025\nPosted in\nBoard Members\n,\nBoard of Directors\nRead More\nMelody Sawyer Richardson\nNovember 15, 2024\nPosted in\nBoard Members\n,\nBoard of Directors\nRead More\nKalnins\nAugust 15, 2024\nPosted in\nDirectors\nRead More\nTebar\nAugust 23, 2023\nPosted in\nBoard Members\n,\nDirectors\nRead More\nBiernacki, DMA | University Partner\nJune 11, 2021\nPosted in\nBoard Members\n,\nBoard of Directors\nRead More\nMullin\nJanuary 25, 2021\nPosted in\nBoard Members\n,\nBoard of Directors\nRead More\nOst\nJune 21, 2020\nPosted in\nBoard Members\n,\nOfficers\nRead More\n1\n2\nNext »\n.fl-page-content\nVisit\nOpera Naples\n2408 Linwood Ave\nNaples, FL 34112\nBox Office\n(239) 844-SING\nnotionvc: fe57eddd-0a2c-4ffd-8468-71451b08a764\nralbaugh@operanaples.org\nStudent Tickets Available\nIn-Season Box Office Hours\nMonday - Friday\n10am - 4pm\nnotionvc: 4e94285c-4882-4ece-b1bb-c351f883bf16\nConnect\nPlease enter your name.\nPlease enter a valid email address.\nSubscribe!\nSomething went wrong. Please check your entries and try again.\nMission\nOur mission is to be a professional opera company known for excellence and innovation by presenting quality opera, musical performances, education and community engagement programs.\n© 2024 Opera Naples. | Development & Hosting by\nB3 Marketing\n.fl-page\n×\nScroll To Top\nGoogle Tag Manager (noscript)\nEnd Google Tag Manager (noscript)",
      "emails": [
        "ralbaugh@operanaples.org"
      ]
    },
    {
      "url": "https://www.facebook.com/OperaNaples/",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    }
  ],
  "all_links": [
    "https://operanaples.org/home/education/resident-artists-program/",
    "https://operanaples.org/experience-maestro-ramon-tebar-around-the-world-trips/",
    "https://operanaples.org/personnel-category/admin-staff/",
    "https://operanaples.org/home/support/donor-acknowledgement/",
    "https://operanaples.org/announcements/opera-naples-announces-call-for-applicants-for-2026-luciano-pavarotti-foundation-opera-naples-international-voice-competition/",
    "https://operanaples.org/staff/kantor/",
    "https://operanaples.org/staff/lotito/",
    "https://operanaples.org/home/about/",
    "https://operanaples.org/staff/field-orr/",
    "http://www.operanaples.org/venue/opera-naples/",
    "https://operanaples.org/home/education/",
    "https://operanaples.org/personnel-category/resident-artist/",
    "https://operanaples.org/announcements/print-brand-sponsorship-opportunities-now-available/",
    "https://operanaples.org/staff/manny-perez/",
    "https://operanaples.org/home/education/in-school-tour/",
    "http://www.operanaples.org/home/support/donate/",
    "https://operanaples.org/funding-initiatives/print-brand-sponsorship-opportunities-now-available/",
    "https://operanaples.org/announcements/opera-naples-celebrates-2024-25-season-revenue-growth-organization-expasion/",
    "https://operanaples.org/toast-to-opera-events-2025/",
    "https://operanaples.org/home/about/media-resources/",
    "https://operanaples.org/home/about/people/",
    "https://operanaples.org/opera-naples-festival-under-the-stars/",
    "https://operanaples.org/staff/page/5/",
    "https://operanaples.org",
    "https://operanaples.org/join/",
    "https://operanaples.org/staff/page/2/",
    "https://operanaples.org/join-opera-naples/",
    "https://operanaples.org/staff/page/3/",
    "https://operanaples.org/home/get-involved/volunteer/",
    "https://operanaples.org/announcements/opera-naples-unveils-2025-26-season-celebrating-20-years-of-world-class-opera/",
    "https://operanaples.org/staff/yelena-kurdina/",
    "https://operanaples.org/home/get-involved/chorus/",
    "https://operanaples.org/personnel-category/academy-faculty/",
    "https://operanaples.org/home/about/gallery/",
    "https://operanaples.org/staff/lastre-broughton/",
    "https://operanaples.org/home/support/",
    "http://www.operanaples.org/home/support/",
    "https://operanaples.org/staff/board-members/",
    "https://operanaples.org/home/about/community-outreach/",
    "https://operanaples.org/home/education/opera-naples-youth-company/",
    "https://operanaples.org/name-your-seat/",
    "https://operanaples.org/personnel-category/board-members/board-of-directors/",
    "https://operanaples.org/personnel-category/board-members/",
    "https://operanaples.org/international-voice-competition-2026/",
    "https://operanaples.org/home/support/donate/",
    "https://operanaples.org/staff/colabianchi/",
    "https://operanaples.org/staff/harrington/",
    "https://operanaples.org/home/naples-premier-event-venue/",
    "https://operanaples.org/staff/bilgili/"
  ],
  "candidate_links": [
    "https://operanaples.org/home/education/resident-artists-program/",
    "https://operanaples.org/personnel-category/admin-staff/",
    "https://operanaples.org/home/about/",
    "https://operanaples.org/toast-to-opera-events-2025/",
    "https://operanaples.org/home/about/people/",
    "https://operanaples.org/personnel-category/academy-faculty/",
    "https://operanaples.org/home/support/",
    "http://www.operanaples.org/home/support/",
    "https://operanaples.org/personnel-category/board-members/board-of-directors/",
    "https://operanaples.org/personnel-category/board-members/",
    "https://www.facebook.com/OperaNaples/"
  ],
  "visited": [
    "http://www.operanaples.org/",
    "http://www.operanaples.org/about",
    "http://www.operanaples.org/contact",
    "http://www.operanaples.org/staff",
    "http://www.operanaples.org/team",
    "http://www.operanaples.org/board",
    "http://www.operanaples.org/directory",
    "http://www.operanaples.org/events",
    "http://www.operanaples.org/sitemap.xml",
    "http://www.operanaples.org/council",
    "http://www.operanaples.org/leadership",
    "http://www.operanaples.org/management",
    "http://www.operanaples.org/producers",
    "http://www.operanaples.org/support",
    "http://www.operanaples.org/crew",
    "http://www.operanaples.org/members",
    "http://www.operanaples.org/bios",
    "http://www.operanaples.org/people",
    "http://www.operanaples.org/artists",
    "http://www.operanaples.org/musicians",
    "http://www.operanaples.org/faculty",
    "http://www.operanaples.org/administration",
    "https://operanaples.org/home/education/resident-artists-program/",
    "https://operanaples.org/personnel-category/admin-staff/",
    "https://operanaples.org/home/about/",
    "https://operanaples.org/toast-to-opera-events-2025/",
    "https://operanaples.org/home/about/people/",
    "https://operanaples.org/personnel-category/academy-faculty/",
    "https://operanaples.org/home/support/",
    "http://www.operanaples.org/home/support/",
    "https://operanaples.org/personnel-category/board-members/board-of-directors/",
    "https://operanaples.org/personnel-category/board-members/",
    "https://www.facebook.com/OperaNaples/"
  ],
  "base_url": "http://www.operanaples.org/"
}