{
  "pages": [
    {
      "url": "https://www.orenaorlando.com/contact",
      "is_candidate": false,
      "has_email": false,
      "text": "Home\nAbout Us\nMenu\nContact\nContact\nGet in Touch with Orena Sports Bar - Your Ultimate Destination for Orlando Fun and Hospitality!\nFirst Name\nLast Name\nEmail Address\nSubject\nMessage\nThank you! Your submission has been received!\nOops! Something went wrong while submitting the form.\nHours\nMonday\n2\npm\n– 2\nAM\nTuesday – Sunday\n12\nPm\n– 2\nAM\n(Family-friendly until 11pm)\nContact Info\nPhone\n(407) 370-0303\nAddress\n6159 Westwood Blvd\nOrlando, FL 32821\nLocation\nConveniently located on International Drive and the BeachLine, Orena Sports Bar is a prime destination in the heart of Orlando's entertainment scene. Whether you're attending an event at the Orlando Orange County Convention Center or exploring nearby attractions like Sea World, our location offers easy access. Easily reach us by hopping off at stop #29 on the I-Ride Trolley.\nRide the Trolley to Stop #29 for Tasty Wings and Refreshing Drinks!\nTo reach Orena Sports Bar via the I-Ride Trolley in Orlando, hop on the trolley and look for stop #29. Orena Sports Bar is conveniently located on 6159 Westwood Blvd., so you'll want to board the Red Line Trolley and disembark at stop #29. Once you arrive, you'll be just steps away from enjoying the delicious wings, refreshing drinks, and lively atmosphere at Orena Sports Bar.\nView I-Ride Trolley Map",
      "emails": []
    },
    {
      "url": "https://www.orenaorlando.com/about-us",
      "is_candidate": false,
      "has_email": true,
      "text": "Home\nAbout Us\nMenu\nContact\nCheers, Flavors, and Endless Fun\nAt Orena Sports Bar, the game is always on and the welcome is always warm. Our\nfood menu\nbrings you comforting, crowd-pleasing favorites, perfectly paired with our selection of\ndrinks\n. It’s the laid-back vibe and friendly faces that turn a simple outing into a memorable one. We’re all about good times, good food, and good company. Bring your friends or make some new ones; either way, you're set for a good time.\nOrena Sports Bar Leaves Guests Raving & Craving More!\n“I travel to Orlando for work frequently and let me tell you, this place has become my go-to spot in just eight weeks. By week four, I was hooked! The positive vibes at Orena are off the charts. The staff always greet you with a smile and make you feel right at home. Trust me, they're the secret ingredient that makes this place extra special!”\n– Perlie V.\n“Orena Sports Bar is absolutely fantastic! My friends and I are regulars here, and it's become our favorite spot. Everything about this place rocks, from the delicious food to the attentive staff. They always go above and beyond to make sure we're treated like VIPs. No matter the time or day, they guarantee a mind-blowing experience.”\n– Laura D.\n“I’ve lived in Orlando for 20+ years. Orena Sports Bar is truly Orlando's hidden gem. The food is incredible, and the staff and customers are top-notch. The vibe here is simply amazing, and they welcome everyone with open arms. A huge shoutout to Orena and the amazing crew for consistently providing an exceptional experience!”\n– Brandon M.\nDiscover What We Have to Offer:\nFully stocked bar with a wide selection of drinks to satisfy all tastes\nSatisfying mix of food options that'll keep everyone happy.\nFriendly and energetic staff that ensures a fantastic time\nPlenty of TVs to ensure you get a good view of the game from any angle.\nLive music and a TouchTunes jukebox for non-stop entertainment\nPool tables and dart boards for friendly competitions and games\nOutdoor seating area to enjoy the Orlando sunshine\nCasual and welcoming atmosphere, come as you are\nConveniently located on International Drive for easy access to Orlando's attractions\nExciting weekly events and specials to keep the party going\nFamily-friendly until 11pm\nSip, Unwind, Repeat.\nEnjoy a wide selection of refreshing drinks at Orena Sports Bar to quench any thirst. From ice-cold beers to handcrafted cocktails, our friendly bartenders are here to mix and pour you the perfect drink.\nView Drink Menu\nSatisfy Your Cravings at Orena Sports Bar\nFrom appetizers to burgers, sandwiches, and wings, our menu serves up familiar, crowd-pleasing favorites. Each item is crafted to hit the spot, echoing the laid-back atmosphere of our bar.\nView Food Menu\nHours\nMonday – Sunday\n12\nPm\n– 2\nAM\n(Family-friendly until 11pm)\norenasportsbar407@gmail.com\nContact Info\nPhone\n(407) 370-0303\nAddress\n6159 Westwood Blvd Orlando, FL 32821\nLocation\nConveniently located on International Drive and the BeachLine, Orena Sports Bar is a prime destination in the heart of Orlando's entertainment scene. Whether you're attending an event at the Orlando Orange County Convention Center or exploring nearby attractions like Sea World, our location offers easy access. Easily reach us by hopping off at stop #29 on the I-Ride Trolley.",
      "emails": [
        "orenasportsbar407@gmail.com"
      ]
    }
  ],
  "all_links": [
    "https://www.orenaorlando.com/menu/food",
    "https://www.orenaorlando.com/menu/drinks",
    "https://www.orenaorlando.com/",
    "https://www.orenaorlando.com/contact",
    "https://www.orenaorlando.com/about-us"
  ],
  "candidate_links": [
    "https://www.orenaorlando.com/contact",
    "https://www.orenaorlando.com/about-us"
  ],
  "visited": [
    "https://www.orenaorlando.com/",
    "https://www.orenaorlando.com/about",
    "https://www.orenaorlando.com/contact",
    "https://www.orenaorlando.com/staff",
    "https://www.orenaorlando.com/team",
    "https://www.orenaorlando.com/board",
    "https://www.orenaorlando.com/directory",
    "https://www.orenaorlando.com/events",
    "https://www.orenaorlando.com/sitemap.xml",
    "https://www.orenaorlando.com/council",
    "https://www.orenaorlando.com/leadership",
    "https://www.orenaorlando.com/management",
    "https://www.orenaorlando.com/producers",
    "https://www.orenaorlando.com/support",
    "https://www.orenaorlando.com/crew",
    "https://www.orenaorlando.com/members",
    "https://www.orenaorlando.com/bios",
    "https://www.orenaorlando.com/people",
    "https://www.orenaorlando.com/artists",
    "https://www.orenaorlando.com/musicians",
    "https://www.orenaorlando.com/faculty",
    "https://www.orenaorlando.com/administration",
    "https://www.orenaorlando.com/contact",
    "https://www.orenaorlando.com/about-us"
  ],
  "base_url": "https://www.orenaorlando.com/"
}