{
  "pages": [
    {
      "url": "https://www.ormondchamber.com/signature-events-programs/",
      "is_candidate": false,
      "has_email": true,
      "text": "Signature Events & Programs\nSignature Events\nAnnual Installation Banquet\nThe Ormond Beach Chamber of Commerce Annual Banquet and Installation of Officers brings together business leaders and City dignitaries to recognize contributions made by Members, highlight Chambers achievements throughout the year and welcome new Board of Directors.Â  This prestigious event includes reception and dinner.\nThis event will be held in January 2026.\nPresented by:\n57th Mayor's Golf Tournament\nThis is the longest running Fundraising event of the Chamber and takes place on the last Friday in April. Did you know more business deals are closed on the golf course than anywhere else?Â Â We Just celebrated 55 years of the tournament. This event is the perfect opportunity to meet new customers and have a fun day on the golf Course at the same time.\nThis event will be held April 2026\nPresented By:Â  Â\nWomen2Women Luncheon\nThis event takes place twice a year in the Spring and Fall . The Luncheon isÂ  designed to bring professional business women together to meet and network with each other. The luncheon features an inspiring keynote speaker to learn about their success and challenges in the business world.\nWatch the calendar for open registration.Â\nSpring - March 28, 2025\nFall - November 2025\nPresented By:\nState of the City Luncheon\nThe Chamber in partnership with the City of Ormond Beach hosts it's Annual State of the City Luncheon on the 2nd Tuesday in October. The luncheon features a program presented by the City Commission on the futureÂ of Ormond Beach.\nThis event will be held October 2025\nReocurring Events\nBusiness After Hours\nHeld monthly on the second (2nd) Wednesday of each month from 4:30 to 6:30 PM. The event is hosted by a local Chamber business member with about 50-75 in attendance.\nThis social relaxed event is meant for members to mix and mingle with each other and meet new and future members over drinks and appetizers.\nBOSS Program\nOrmond Beach Chamber of Commerce BOSS Program (Business Owners Sharing Solutions)\nBOSS is an educational platform for the business community and promotes professional development. Topics will change for each event.\nEconomic Prosperity Hour\nHeld 6 times a year, every other month.Â  This event is designed as an informational meeting with Economic Prosperity updates from County and City elected officials, City staff, Ormond Mainstreet and a local residential and commercial real estate update. The event features a speaker related to Economic Development or Government Affairs. Average attendance is 50 community leaders. Members Advance online registration $10, at the door $15 and future members $25.\nMorning Member Meetup\nA dynamic networking event designed to kickstart your business day. Held from 8:00am - 9:00am, this early-morning gathering offers a unique opportunity to engage with fellow members before the workday begins.\nHosted at different member businesses quartly, this event provides a relaxed and informal setting for professionals to exchange ideas, build relationships, and explore new business opportunitiesâall while enjoying coffee, light refreshments, and a welcoming atmosphere.\nRise and shineâjoin us at the next Morning Member Meetup to make connections that matter!\nChamber.Coffee.Connect\nWe welcome new members and new representatives of chamber members to the Morning orientation as we present an overview of Chamber benefits, committees and services. The event is held quarterly in the Chamber boardroom and EXCLUSIVE to chambers members only.\nRibbon Cuttings\nRibbon cuttings are a member only benefit to qualifying businesses to celebrate the grand opening of a new location, remodel, expansion or a brand new business. Held on Thursday afternoons at 4:00 PM with the cutting at 4:30 PM.\nFor more information on Ribbon cutting criteria contact jgion@ormondchamber.com\nCommunity Programs\nOrmond Beach Chamber Rob Ridder Scholarship\nclick here forÂ GuidelinesÂ andÂ Application\nTo be eligible, each scholarship grant applicant must:\nÂ Be the child of a parent (or legal guardian) that is a member of the Ormond Beach Chamber of Commerce\nÂ in good standing;Â\nand,\nBe a senior at one of the high schools located in Volusia County and\n,\nIntend to attend any accredited university, college, community/State college, or vocational/technical institute beginning in the fall of 2024; and,\nApplications for 2025\nHERE\n.\nGuidelines\nRob Ridder Scholarship Background:\nThe Ormond Beach Chamber of Commerce Rob Ridder Scholarship was established in 2014, and is intended to recognize students of Chamber members for outstanding educational and community service achievement. The program started by giving away 2 - $1,000 Scholarships and has grown to 8 - $1,000 Scholarships in 2023. To donate contact\nDebbie Cotton\n, President & CEO.\nLeadership Ormond Beach\nDeveloping Community Leaders Since 2003\nThe Ormond Beach Leadership Program, developed by the Ormond Beach Chamber of Commerce, is designed to engage civic-minded individuals with the issues, opportunities, and challenges facing the Ormond Beach community. Since its inception in 2003, the program has provided participants with meaningful leadership development and direct access to community leaders, city officials, and dignitaries.\nThis comprehensive program consists of eight (8) half-day sessions and concludes with a graduation ceremony. Each session offers a deep dive into key areas shaping the future of Ormond Beach.\nProgram Sessions Include:\nOrientation â Day 1\nOrientation â Day 2: Leadership Session & Alumni Reception\nCity Government Session\nHealth & Wellness Session\nHistorical Tour\nEconomic Development Session\nNon-Profit Session\nOrmond Beach Youth Leadership Program\nThe Ormond Beach Chamber has developed a Youth Leadership program that we think will blend both workforce and leadership.\nParticipants in Youth Leadership Ormond Beach will gain knowledge of the community while building relationships with like-minded peers. Through interactions with local business leaders and government officials they gained valuable insights.Â  In turn, provided these students with a solid appreciation and understanding for their community.Â  The intent of the program is to help graduates build strong connections that keep the Ormond Beach community in their hearts and minds, whatever path they ultimately choose after their high school graduation.\nSessions mirror our Leadership Ormond Beach program, however, are amended to topics that will engage our youth and highlight local internships and career opportunities at each session.Â Â  Each student earns community service hours they can apply to their Bright Future Scholarships. Program takes place in the Fall on Early Release days.Â  Contact Patty Tropea,\nptropea@ormondchamber.com\nTeacher of the Quarter\nThis is one of our longest running programs in Chamber and has been part of our mission for over 20 years. This is an important part of our mission to promote community interest in local schools and develop leaders, the Chamber recognizes the teachers in the Ormond Beach area schools each quarter.",
      "emails": [
        "dcotton@ormondchamber.com",
        "info@ormondchamber.com",
        "jgion@ormondchamber.com",
        "ptropea@ormondchamber.com"
      ]
    },
    {
      "url": "https://www.ormondchamber.com/staff/",
      "is_candidate": false,
      "has_email": true,
      "text": "Staff\nDebbie Cotton\nPresident & CEO\nEmail:\ndcotton@ormondchamber.com\nOffice:\nÂ Â (386) 677-3454, Ext 305\nDirect Line:\nÂ Â (386) 256-2528\nMark Goodson\nVice President of Member Development\nEmail:\nmgoodson@ormondchamber.com\nOffice:\nÂ (386) 677-3454, Ext 308\nDirect Line:\nÂ (386) 256-2234\nJessica Gion\nEvents and Communications Director\nEmail:\njgion@ormondchamber.com\nPhone:Â\n(386) 677-3454, Ext 304\nDirect Line\n: (386) 256-2527\nCameron Lechota\nOffice Manager\nEmail:\nclechota@ormondchamber.com\nPhone:\nÂ 386-677-3454\nPatty Tropea\nProgram Manager\nEmail:\nptropea@ormondchamber.com\nPhone:\nÂ 386-677-3454",
      "emails": [
        "clechota@ormondchamber.com",
        "dcotton@ormondchamber.com",
        "info@ormondchamber.com",
        "jgion@ormondchamber.com",
        "mgoodson@ormondchamber.com",
        "ptropea@ormondchamber.com"
      ]
    },
    {
      "url": "https://business.ormondchamber.com/events/",
      "is_candidate": false,
      "has_email": true,
      "text": "Ormond Beach Chamber of Commerce,Ormond Beach,events,calendar,events calendar,upcoming events,featured events,regional events\nOrmond Beach Chamber of Commerce | Events Calendar",
      "emails": [
        "info@ormondchamber.com"
      ]
    },
    {
      "url": "https://www.ormondchamber.com/membership-benefits/",
      "is_candidate": false,
      "has_email": true,
      "text": "Membership Benefits\nWhy Join the Chamber?\nMembership Application\nOnline Benefits\nPersonal login and password allowing access to add and update your benefits from any computer that has an active connection to the internet â anytime â day or night!\nFREE Listing on the Chamberâs Online Business Directory\n200 character Business description\nHours of operation\nDriving directions\nPersonalized keywords\nMarketing Opportunities\nHot Deals â Enter ads or coupons that display prominently on the Chamberâs website\nJob Postings â Post job openings for those actively seeking employment\nEvents - Submit events for consideration on the Chamber and Community Calendar\nReal-time, Up-to-Date Access\nKeep the Chamberâs Database current\nSee the categories where your Business is listed\nKeep your list of employees current\nRSVP for Events\nWhat's in a Chamber Investment for You?\nChamber investment perks for you and your employees:\nLearning opportunities\nIncreased backing\nPowerful credibility and a sense of community\nA group with shared interests\nAffordable advertising opportunities\nClick for full article!\nAdditional Benefits\nAdvertise with the Chamber!\nMembers have the exclusive opportunity toÂ expose their business through ourÂ advertising!We offer a variety of opportunities throughout the year to gain valuable, cost-effective exposure for your business.\nLet us help you reach your target market!Â Â Call the Chamber office at (386) 677-3454 for more information!\nAdvertising Opportunities:\nDoing Business in Ormond Beach\nElectronic Newsletter\nLobby Display\nOfficial Ormond Beach City Map\nVisitors Guide & Membership Directory\nWeb Site Banner Ads\nODP Member Program\nBeing a member of the Ormond Beach Chamber of Commerce, gets you access to HUGE savings, special pricing and more with your Office Depot Store Purchasing Card.Â  No contract to sign and no minimum dollar to spend required! Log in to the Member Information Center and get your exclusive Office Depot Store Purchasing Card underÂ\nResources\n!Â  You can set up your Office Depot account by\nclicking here!\nBe a 110% Club Member\nWe invite our members to be a part of 110% Chamber Club. When members voluntarily contribute an extra 10% over their annual investment amount, your contribution helps the Chamber to continue providing relevant programs and resources to serve the needs of its members, as well as supporting the promotion of business growth.\nCertificate of Origin\nThe Ormond Beach Chamber of Commerce is authorized to certify Certificates of Origin for export.\nA Certificate of Origin (CO) is an important international trade document attesting that goods in a particular export shipment are wholly obtained, produced, manufactured or processed in a particular country.\nCOs also constitute a declaration by the exporter. Virtually every country in the world considers the origin of imported goods when determining what duty will be assessed on the goods or, in some cases, whether the goods may be legally imported at all.\nTo determine if a CO is required, contact the Trade Information Centre of the export destination.\nTo download policy, clickÂ\nDownload File\nConference Room Rental\nDid you know our Conference Room is available for rent?\nMembers â one free hour per month and $25 additional hour.\nConference Room Policies\nContact the Office Manager for more information or Email\ninfo@ormondchamber.com\n*MembershipÂ dues are non-refundable. All dues are used to support the Ormond Beach Chamber of Commerce'sÂ mission of Advocating for Businesses, Developing Leaders and Promoting Economic Prosperity.Â\nRibbon Cuttings\nA ribbon cutting is the ceremonial opening of a brand new or newly renovated/relocated business that has opened\nwithin the last six months\n. It can inaugurate a businessâs first day of business, or it can take place weeks after the businessâs soft opening. A ribbon cutting is not an automatic event to mark a new membership.\nRibbon Cuttings are held on Thursday from 4:00 PM to 5:00 PM only\nWhat is the criteria for a ribbon cutting?\nBusinesses expansion\nBrand new business/new location\nRelocation of your business\nCertificate Of Occupancy\nFor Ribbon Cutting Packet & Information - Contact Jessica Gion at JGion@OrmondChamber.com",
      "emails": [
        "info@ormondchamber.com",
        "jgion@ormondchamber.com"
      ]
    },
    {
      "url": "https://www.ormondchamber.com/about-us/",
      "is_candidate": false,
      "has_email": true,
      "text": "About Us\nWelcome to The Ormond Beach Chamber of Commerce and Visitors Center\nVisitors and residents can get information on businesses, area information, maps, Real Estate Brochures, newspapers, tourism publications, and Economic Development information.Â Â For more information contact\ninfo@ormondchamber.com\nAddress\n:Â  165 W. Granada Blvd., Ormond Beach, FL 32174\nPhone\n: 386-677-3454 / Fax: 386-677-4363\nChamber hours\n: Monday â Friday, 9:00 am to 5:00 pm (closed for Holidays and special events)\nChamber Summer hours\n: ( Starting May 26Â to September) - Monday - Thursday, 9:00 am to 5:00 pm and Friday, 9:00 am to 12:00 pm.\nMission Statement:\nÂ To serve the community by advocating for businesses, developing leaders and promoting economic growth.\nValues:\nÂ Branding, Relevance, Advocacy, Leadership and Support\n2022-2025 Strategic Plan\nRead More (PDF)\nAdvocacy\nâ The chamber created a Government Affairs committee in 2017. This committee takes a proactive approach in addressing local and state issues important to the chamberâs mission, our membership and business community. This committee works to understand issues of interest to the businesses in Ormond Beach and Volusia County area. The committee works to educate and communicate issues to the chamber members and community leaders.\nMembership Committees\nAmbassador Committee -Â\nThe Ambassador role is to connect with new Chamber members to help navigate the opportunities within the Chamber and to help advise on the best ways to get engaged and meet their goals for joining. Ambassadors are the face of the Chamber for many new members and are responsible for a large portion of the touch points between the Chamber and the member. As such, it is crucial that Ambassadors have experience navigating the Chamberâs workings and are actively engaged in their own Chamber membership. It is also important that they understand the responsibility of representing the Chamber properly, have a realistic understanding of the time needed to do so, and are recognized and rewarded for their efforts.Â Â For more information on becoming an ambassador contact:Â\ninfo@ormondchamber.com\nNetworking Groups\n- The main activity of the Networking Groups is lead generation and exchange for the purpose of generating new business to help increase customer base and sales.Â Â Each group permits only one firm per business classification to maximize the effectiveness of the lead. All information obtained from the participation in the meetings shall remain protected and confidential to that group.Â Â\nThis is a member only benefit and has a $25.00 annual fee to participate in a group.\nContact\ninfo@ormondchamber.com\nto see if there are open positions in the groups.\nFour groups meet twice a month:\nNet Group 1Â\nâ Tuesday mornings at 7:30 am, in the Chamber Board room\nNet Group 2\nâ Wednesdays at Noon, in the Chamber Board room\nNet Group 3Â â\nTuesdays at Noon\n,Â\nin the Chamber Board room\nNet Group 4\nâ Wednesday mornings at 8:30 am, in the Chamber Board room\nCommunity Program Committees\nLeadership Committee\nâ the purpose is to organize and plan the Annual Ormond Beach Leadership curriculum and coordinate all activities and volunteers for each class.Â The program accepts 25-30 business leaders each year.Â Â You must be an Ormond Beach Leadership Alumni to participate in this committee.\nYouth Leadership Committee-\nplans the curriculum for youth Leadership program for High School students in Ormond Beach. Youth Leadership takes place in the Fall.\nRob Ridder Scholarship\nâ selection committee â This committee is helpful in selecting and interview potential candidates for the Scholarship award. This task force will meet in the Spring.\nIf you are interested in joining these committees contact Patty Tropea, Program Manager, at\nptropea@ormondchamber.com\nGovernment Affairs Committee\nThe Ormond Beach Chamber of Commerce Government Affairs committee (known as GA committee) takes a proactive approach in addressing local, state and national issues important to the Chamber and its mission of our membership and business community.Â  This committee works to understand issues of interest to the businesses in the Ormond Beach and Volusia County area and to educate and communicate issues to the chamber members and community leaders. Meets every other month at the Chamber office, contact Debbie Cotton, President & CEO\ndcotton@ormondchamber.com\n.\nWorkforce Committee\nOur mission is to attract, grow and train the workforce to support Ormond Beachâs current and future business needs. Together, the committee aims to support business in attracting and retaining skilled talent while contributing to the overall economic growth and prosperity of the Ormond Beach community.Â  We are committed to fulfilling this mission through dedicated efforts and collaborative partnerships.\nEvent Committee\nGolf Committee\nâ Works with Event Manager at the chamber to organize and plan the Annual Mayorâs Golf tournament.Â Â This event is held during the month of April. The chamber has hosted a golf tournament for 50 years.\nIf you are interested in working on any of the event committees contact Jessica Gion, Events & Communications Director at\njgion@ormondchamber.com\n.",
      "emails": [
        "dcotton@ormondchamber.com",
        "info@ormondchamber.com",
        "jgion@ormondchamber.com",
        "ptropea@ormondchamber.com"
      ]
    },
    {
      "url": "https://business.ormondchamber.com/member/newmemberapp/",
      "is_candidate": false,
      "has_email": true,
      "text": "Ormond Beach Chamber of Commerce\nOrmond Beach Chamber of Commerce is the best place to find a member or business in the Ormond Beach FL area.",
      "emails": [
        "info@example.com",
        "info@ormondchamber.com"
      ]
    },
    {
      "url": "https://business.ormondchamber.com/list/",
      "is_candidate": false,
      "has_email": true,
      "text": "Ormond Beach Chamber of Commerce,Ormond Beach,directory,business search,member search\nThe easy way to find businesses and members in the Ormond Beach Chamber of Commerce",
      "emails": [
        "info@ormondchamber.com"
      ]
    },
    {
      "url": "https://business.ormondchamber.com/contact/",
      "is_candidate": false,
      "has_email": true,
      "text": "Ormond Beach Chamber of Commerce,Ormond Beach,directory,business search,member search,information request\nOrmond Beach Chamber of Commerce is the best place to find a member or business in the Ormond Beach FL area.",
      "emails": [
        "info@ormondchamber.com",
        "youremail@domain.com"
      ]
    },
    {
      "url": "https://www.ormondchamber.com/board-of-directors/",
      "is_candidate": false,
      "has_email": true,
      "text": "Board of Directors\n2025 Board of Directors\nErick Palacios, MBA, CPFA\n2025 Chairman\nPlan to Prosper Wealth Management\n386-271-2127\nerick@myplantoprosper.com\nmyplantoprosper.com\nJeff Serle\n2026 Chairman Elect\nFlush Fasteners\n386-214-5104\njserle@flushfasteners.com\nEva Connors McMullin\n2024 Past Chairwoman\nS.R. Perrott, Inc.\n(386) 672-2275\neva@srperrott.com\nwww.srperrott.com\nJames Jiloty\nTreasurer\nBrown & Brown, Inc.\n386-239-7256\njjiloty@bbins.com\nwww.bbinsurance.com\nRobert Macklin\nVice Chair,Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Membership Services\nGary Yeomans Ford Lincoln Daytona\n(386) 274-6700\nrmacklin@anewford.com\nwww.garyyeomansford.com\nVinod Sagrani\nVice Chair,Â  Â  Â  Â  Â  Â  Â  Â  Â  Â Economic Development\nSouthState Bank\n386-673-7011\nvsagrani@southstatebank.com\nwww.southstatebank.comÂ\nMichelle Tisdale\nVice Chair, Community EventsÂ  Â  Â  Â\nFoundation Risk Partners\n386-777-2835\nmcaudell@foundationrp.com\nwww.foundationrp.com\nJeff Strcula\nVice Chair,Â  Â  Â  Â  Â  Â  Â  Â Community Programs\nUpham, Inc.\n(386) 672-9515\njstrcula@uphaminc.com\nwww.uphaminc.com\nDebbie Cotton, IOM\nPresident & CEO\nOrmond Beach Chamber of Commerce\n(386) 677-3454\ndcotton@ormondchamber.com\normondchamber.com\nBoard of Directors\nLiz Berger\nBoard of Directors\nSecurity First Insurance\n(877) 333-9992\nliz.berger@securityfirstflorida.com\nwww.securityfirstflorida.com\nDennis Casey\nBoard of Director\nRaymond James, Casey Wealth Advisors\n(386) 256-4014\nDennis.casey@raymondjames.com\nwww.raymondjames.com/caseywealthadvisors\nJami Gallegos\nBoard of Directors\nLifestyle Realty Group\n(386) 951-6565\njami.gallegos@LifestyleRealty.group\nwww.lifestylerealty.group\nWalker Grindle\nBoard of Directors\nMoney Pages\n(386) 299-5643\nwalker.grindle@moneypages.com\nwww.moneypages.com\nJoni Hunt\nBoard of Directors\nAdventHealth\n(386) 231-3910\nwww.adventhealthdaytonabeach.com\nSal Passalaqua\nBoard of Directors\nVolusia Memorial Parks & Funeral Homes\n(386) 673-5373\nSalvatore.Passalaqua@dignitymemorial.com\nwww.volusiamemorialfunerals.com\nCasey Epton Roush\nBoard of Directors\nMoore Outdoor Living\n(386) 281-3441\ncasey@mooreoutdoorliving.com\nwww.mooreoutdoorliving.com\nJake Stehr\nBoard of Directors\nZev Cohen & Associates, Inc.\n(386) 677-2482\njstehr@zevcohen.com\nwww.zevcohen.com\nSherryl Weems\nBoard of Directors\nDaytona State College, Mary Karl College of workforce & Continuing Education.Â\n(386) 506-3618\nsherryl.weems@daytonastate.edu\nwww.daytonastate.edu\nAshley Wohlford\nBoard of Directors\nHalifax Health\n(386) 425-2254\nashley.wohlford@halifax.org\nwww.halifaxhealth.org\nLegal Counsel\nMichael Chiumento, III\nChiumento Law Firm\n(386) 445-8900\nMichael3@legalteamforlife.com\nwww.legalteamforlife.com\nEx-officio Board Members\nJoyce Shanahan, City Manager, City of Ormond Beach\nJason Leslie, Mayor, City of Ormond Beach\nBecky Parker, Ormond MainStreet\nBoard Member Emeritus\nEd Kelley\nHonorary Board Members\nTucker Harris, Principal Seabreeze High School",
      "emails": [
        "ashley.wohlford@halifax.org",
        "casey@mooreoutdoorliving.com",
        "dcotton@ormondchamber.com",
        "dennis.casey@raymondjames.com",
        "erick@myplantoprosper.com",
        "info@ormondchamber.com",
        "jami.gallegos@lifestylerealty.group",
        "jjiloty@bbins.com",
        "jserle@flushfasteners.com",
        "jstehr@zevcohen.com",
        "jstrcula@uphaminc.com",
        "liz.berger@securityfirstflorida.com",
        "mcaudell@foundationrp.com",
        "michael3@legalteamforlife.com",
        "rmacklin@anewford.com",
        "salvatore.passalaqua@dignitymemorial.com",
        "sherryl.weems@daytonastate.edu",
        "vsagrani@southstatebank.com",
        "walker.grindle@moneypages.com"
      ]
    },
    {
      "url": "https://www.facebook.com/ormondchamber",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    }
  ],
  "all_links": [
    "https://business.ormondchamber.com/MemberToMember/",
    "https://business.ormondchamber.com/map",
    "https://www.ormondchamber.com/signature-events-programs/",
    "https://business.ormondchamber.com/list/ql/lodging-travel-15",
    "https://business.ormondchamber.com/jobs/",
    "https://business.ormondchamber.com/list/ql/real-estate-moving-storage-20",
    "http://www.ormondchamber.com/resources/",
    "https://www.ormondchamber.com/",
    "https://business.ormondchamber.com/hotdeals/",
    "https://business.ormondchamber.com/member/NewMemberApp/",
    "https://business.ormondchamber.com/list/ql/health-care-11",
    "https://www.ormondchamber.com/staff/",
    "https://business.ormondchamber.com/marketspace/",
    "https://business.ormondchamber.com/list/ql/restaurants-food-beverages-22",
    "https://business.ormondchamber.com/events/details/networking-group-3-09-23-2025-23576",
    "https://www.ormondchamber.com/welcome-to-ormond-beach/",
    "https://business.ormondchamber.com/events/calendarcatgid/3",
    "https://business.ormondchamber.com/events/details/mastermind-roundtable-24704",
    "https://business.ormondchamber.com/events/",
    "https://business.ormondchamber.com/events/details/networking-group-4-09-24-2025-24067",
    "http://www.ormondchamber.com/membership-benefits/",
    "https://www.ormondchamber.com/membership-benefits/",
    "https://business.ormondchamber.com/events/details/networking-group-1-09-23-2025-23374",
    "https://business.ormondchamber.com/login/",
    "https://business.ormondchamber.com/events?from=9/12/2025&to=9/12/2028&o=alpha",
    "https://www.ormondchamber.com/about-us/",
    "https://business.ormondchamber.com/events?rendermode=print",
    "https://business.ormondchamber.com/events/details/mainstreet-board-meeting-24724",
    "https://www.ormondchamber.com/assets/pdf/2024+Conference+Room+Use+Request+Form",
    "https://business.ormondchamber.com/news/",
    "https://business.ormondchamber.com/events/calendarcatgid/6",
    "https://business.ormondchamber.com/events/register/24704",
    "https://business.ormondchamber.com/events/details/networking-group-2-09-24-2025-24268",
    "https://www.ormondchamber.com/resources/",
    "https://business.ormondchamber.com/events/details/the-shield-of-life-platform-and-the-gut-biome-24705",
    "https://www.ormondchamber.com/assets/pdf/2025+Youth+Leadership+Application",
    "https://www.ormondchamber.com/partners/",
    "https://business.ormondchamber.com/membertomember/",
    "https://business.ormondchamber.com/events/details/launch-credit-union-ormond-beach-financial-power-after-hours-24707",
    "https://business.ormondchamber.com/events/public-submission",
    "https://business.ormondchamber.com/list/ql/shopping-specialty-retail-23",
    "https://business.ormondchamber.com/member/newmemberapp/",
    "https://business.ormondchamber.com/events/details/youth-leadership-program-session-1-orientation-day-24668",
    "https://business.ormondchamber.com/list/",
    "https://business.ormondchamber.com/list/ql/arts-culture-entertainment-3",
    "https://business.ormondchamber.com/contact/",
    "https://www.ormondchamber.com/board-of-directors/",
    "https://business.ormondchamber.com/events/calendar/2025-09-12",
    "https://business.ormondchamber.com/info/",
    "https://www.ormondchamber.com/ambassador-committee/",
    "https://business.ormondchamber.com/events/details/board-of-directors-meeting-23998",
    "https://www.ormondchamber.com/ormond-beach-weather/"
  ],
  "candidate_links": [
    "https://www.ormondchamber.com/signature-events-programs/",
    "https://www.ormondchamber.com/staff/",
    "https://business.ormondchamber.com/events/",
    "https://www.ormondchamber.com/membership-benefits/",
    "https://www.ormondchamber.com/about-us/",
    "https://business.ormondchamber.com/member/newmemberapp/",
    "https://business.ormondchamber.com/list/",
    "https://business.ormondchamber.com/contact/",
    "https://www.ormondchamber.com/board-of-directors/",
    "https://www.facebook.com/ormondchamber"
  ],
  "visited": [
    "http://www.ormondchamber.com/",
    "http://www.ormondchamber.com/about",
    "http://www.ormondchamber.com/contact",
    "http://www.ormondchamber.com/staff",
    "http://www.ormondchamber.com/team",
    "http://www.ormondchamber.com/board",
    "http://www.ormondchamber.com/directory",
    "http://www.ormondchamber.com/events",
    "http://www.ormondchamber.com/sitemap.xml",
    "http://www.ormondchamber.com/council",
    "http://www.ormondchamber.com/leadership",
    "http://www.ormondchamber.com/management",
    "http://www.ormondchamber.com/producers",
    "http://www.ormondchamber.com/support",
    "http://www.ormondchamber.com/crew",
    "http://www.ormondchamber.com/members",
    "http://www.ormondchamber.com/bios",
    "http://www.ormondchamber.com/people",
    "http://www.ormondchamber.com/artists",
    "http://www.ormondchamber.com/musicians",
    "http://www.ormondchamber.com/faculty",
    "http://www.ormondchamber.com/administration",
    "https://www.ormondchamber.com/signature-events-programs/",
    "https://www.ormondchamber.com/staff/",
    "https://business.ormondchamber.com/events/",
    "https://www.ormondchamber.com/membership-benefits/",
    "https://www.ormondchamber.com/about-us/",
    "https://business.ormondchamber.com/member/newmemberapp/",
    "https://business.ormondchamber.com/list/",
    "https://business.ormondchamber.com/contact/",
    "https://www.ormondchamber.com/board-of-directors/",
    "https://www.facebook.com/ormondchamber"
  ],
  "base_url": "http://www.ormondchamber.com/"
}