{
  "pages": [
    {
      "url": "https://outdooradventureretreats.com/contact/",
      "is_candidate": false,
      "has_email": false,
      "text": "Skip to main content\nClose Search\nBook Now\nMenu\nRetreats\nCrescent Fish Camp\nCrescent City, FL\nWanee Lake\nAshburn, GA\nWilderness Cove\nSaluda, NC\nCotton Patch Landing\nChocowinity, NC\nAbout Us\nAbout OAR\nMedia\nCampfire Chronicles\nMy Account\nCart\nContact\nContact Us\nJob Board\nSell Your Campground\nLooking To Partner\nOAR Affiliate Program\nBook Now\nContact\nBook Now\nCall Us\nCrescent Fish Camp\n(386) 698-2444\nWanee Lake\n(229) 567-2727\nWilderness Cove\n(828) 341-2344\nCotton Patch Landing\n(252) 946-8226\nContact Us\nNotice: JavaScript is required for this content.\nFollow us!\nFacebook\nInstagram\nTikTok\nSpotify\nLinkedIn\nYoutube\nCampfire Chronicles\nSign up for our newsletter get updates, promotions, and more.\nLeave this field empty if you're human:\nOutdoor Adventure Retreats\nEscape. Explore. Experience.\nOutdoor Adventure Retreats\nCrescent Fish Camp\nCrescent City, FL\nCrescent Fish Camp\nWanee Lake\nAshburn, GA\nWanee Lake\nWilderness Cove\nSaluda, NC\nWilderness Cove\nCotton Patch Landing\nChocowinity, NC\nCotton Patch Landing\nContact\nFAQ\nJob Board\nSell Your Campground\nLooking to Partner\nPrivacy Policy\nTerms & Conditions\n© Outdoor Adventure Retreats LLC. All rights reserved.\nMade by\nKing Willy Camping\n.\nClose Menu\nRetreats\nCrescent Fish Camp\nCrescent City, FL\nWanee Lake\nAshburn, GA\nWilderness Cove\nSaluda, NC\nCotton Patch Landing\nChocowinity, NC\nAbout Us\nAbout OAR\nMedia\nCampfire Chronicles\nMy Account\nCart\nContact\nContact Us\nJob Board\nSell Your Campground\nLooking To Partner\nOAR Affiliate Program\n© Outdoor Adventure Retreats LLC. All rights reserved.",
      "emails": []
    },
    {
      "url": "https://outdooradventureretreats.com/about-outdoor-adventure-retreats/",
      "is_candidate": false,
      "has_email": false,
      "text": "Skip to main content\nClose Search\nBook Now\nMenu\nRetreats\nCrescent Fish Camp\nCrescent City, FL\nWanee Lake\nAshburn, GA\nWilderness Cove\nSaluda, NC\nCotton Patch Landing\nChocowinity, NC\nAbout Us\nAbout OAR\nMedia\nCampfire Chronicles\nMy Account\nCart\nContact\nContact Us\nJob Board\nSell Your Campground\nLooking To Partner\nOAR Affiliate Program\nBook Now\nAbout Outdoor Adventure Retreats\nAt Outdoor Adventure Retreats, we specialize in unparalleled access to the wonders of nature while providing exceptional accommodations and top-notch service. Our mission is to create unforgettable experiences that allow you to escape from daily life, explore breathtaking landscapes, and truly immerse yourself in adventure. Outdoor Adventure Retreats is Your Destination for Outdoor Recreation.\nFounders\nGeneral Managers\nOUR STORY\nOutdoor Adventure Retreats (OAR) was born from a shared passion for nature and a vision to create outdoor hospitality destinations where people can escape, explore and experience the great outdoors. Founders Andrew Garcia and Benjamin Cohen, both avid outdoor enthusiasts, recognized a need for accessible and immersive nature retreats that offer exceptional accommodations and service. In 2022, they turned this vision into reality by establishing OAR, aiming to provide unparalleled access to outdoor recreation across the Southeastern United States.\nStarting with the acquisition of four unique campgrounds — Wilderness Cove in North Carolina, Crescent Fish Camp in Florida, Wanee Lake in Georgia, and Cotton Patch Landing in North Carolina — OAR has been dedicated to preserving and enhancing these natural havens. Each location offers a distinct experience, from serene lakeside fishing and adventurous hiking trails to beautiful golf courses and peaceful kayaking creeks, catering to both thrill-seekers and those seeking tranquility.\nOur commitment extends beyond providing exceptional retreats; we believe that the best outdoor experiences are found not just in nature, but in the small towns and communities that surround them. Each OAR location offers a gateway to hidden gems, from local diners and historic main streets to fishing spots, hiking trails and golf courses. Whether you’re exploring the charming mountain towns of Western North Carolina, the rolling countryside of Georgia, or simply passing through the area, OAR is your home base for adventure.\nAs we continue to grow, our mission remains steadfast: to create unforgettable experiences that allow our guests to disconnect from the hustle of daily life and reconnect with the beauty of the natural world. We want to be Your Destination for Outdoor Recreation. We invite you to join us on this journey and discover the adventures that await at Outdoor Adventure Retreats.\nFounders\nEscape. Explore. Experience the thrill of Outdoor Adventure Retreats. Let us be your gateway to a world of natural wonders, thrilling experiences, and cherished memories. Book your adventure today and embark on a journey that will leave you refreshed, inspired, and longing for more.\nAndrew Garcia\nCo-Founder\nHailing from Atlanta, Georgia, Andrew developed a profound love for the outdoors during his childhood spent exploring the lakes and rivers in the picturesque mountains of Northwest Georgia and Western North Carolina. This formative experience ignited his lifelong passion for nature and laid the foundation for his commitment to preserving and enhancing the natural beauty of outdoor recreational properties. Andrew’s hobbies include hiking, golfing, fishing, tennis, nature photography, and landscaping, all of which allow him to immerse himself in the natural environments he works diligently to enhance at Outdoor Adventure Retreats.\nBen Cohen\nCo-Founder\nAs a Florida-native, Ben has always been an outdoor adventure enthusiast with a passion for golfing, hiking, scuba diving and finding any excuse to hang near a body of water. Growing up this enthusiasm sparked a flame in Ben to start something of his own involving the great outdoors. Ben wants to use his profound dedication to conserving and elevating recreational landscapes to pave the way for all outdoor adventure seekers. Ben is extremely passionate about this space and making sure that each of Outdoor Adventure Retreat’s parks are an exciting and welcoming place for everyone.\nGeneral Managers\nTodd Johnson\nCrescent Fish Camp\nI’m Todd, General Manager here at Crescent Fish Camp — but before I wore this hat, I was just a guest who fell in love with this little slice of heaven here on Lake Crescent. Raised on the banks of the St. Johns River, my childhood was spent fishing, hunting, and wakeboarding—sunup to sundown. Now, I’m fortunate enough to raise my three boys along these same waters, teaching them the river life I’ve always known and loved. When we aren’t on the water, you can find us out on the golf course, walking trails through the state parks, refuge areas, and springs, or out on the football/baseball fields.\nWhat started as a short RV stay with my family quickly turned into something much more. When the opportunity came to manage this waterfront resort and marina, I knew it was the perfect way to plant roots and give back to a place that already felt like home. Crescent Fish Camp isn’t just where I work—it’s where my heart is, and where I hope you’ll come make some memories of your own.\nLeigh Heard\nWanee Lake\nAs an Alabama native who spent much of my childhood on the white sandy beaches of the Florida Panhandle, my love for the outdoors runs deep. Since 2020, I’ve embraced the RV life while working at campgrounds, allowing me to explore new places and stay connected to nature. My love for people and my big heart have made these experiences even more meaningful, as I’ve built connections with fellow travelers and outdoor enthusiasts along the way. Now, in my role as General Manager at Wanee Lake, I’m diving into the world of golf, learning a great deal while still being surrounded by the natural beauty I cherish. My journey reflects a genuine passion for outdoor living and a commitment to creating meaningful experiences. I look forward to meeting you at Wanee Lake and sharing in this adventure together.\nLauren Fowler\nWilderness Cove\nHey y’all! We’re Lauren and Nate – the new GMs of Wilderness Cove. Lauren is from low country SC, and Nate comes from Maine. We moved to WNC in spring of 2024, and saw the devastation of Hurricane Helene firsthand. Though we weren’t camp hosts at our campground, we raced into action doing supply runs and organizing cookouts during the blackout after the storm. We made sure everyone had food, propane, and gas for the shared generator.\nJoining the Wilderness Cove team, we are aware of the responsibility of rebuilding this community. Hurricane Helene heavily impacted WNC, and we are grateful for the opportunity to help grow Wilderness Cove and the surrounding communities. Our vision for Wilderness Cove is to heal the land around us, and create core memories with all our guests.\nOur interests include hiking, rockhounding, kayaking, tubing, fishing, and archery. We have a border collie named Nova that is always up for adventures. Be sure to stop by and get a hug from Nova – she loves them!\nJudy Himes\nCotton Patch Landing\nHello! My name is Judy Himes. My husband Jim and I are the general managers at Cotton Patch Landing. We always have enjoyed camping and dreamed of one day working at a campground, so as soon as we had the chance, we left the family business and hit the road! Now we are thrilled to have landed at this beautiful family-oriented spot on Blounts Creek at the Inner Banks of North Carolina. Boating and fishing might be new to us, but we are excited to learn all we can. Many days are filled with the bustle of families and friends putting boats in the water at the marina or finding that favorite flavor of ice cream in the camp store, and we love greeting our guests who share a love for the outdoors. Our greatest joy is found in doing everything we can to help our newfound friends make lifelong memories. We look forward to seeing you at the creek to create fantastic memories for your family!\nFollow us!\nFacebook\nInstagram\nTikTok\nSpotify\nLinkedIn\nYoutube\nCampfire Chronicles\nSign up for our newsletter get updates, promotions, and more.\nLeave this field empty if you're human:\nOutdoor Adventure Retreats\nEscape. Explore. Experience.\nOutdoor Adventure Retreats\nCrescent Fish Camp\nCrescent City, FL\nCrescent Fish Camp\nWanee Lake\nAshburn, GA\nWanee Lake\nWilderness Cove\nSaluda, NC\nWilderness Cove\nCotton Patch Landing\nChocowinity, NC\nCotton Patch Landing\nContact\nFAQ\nJob Board\nSell Your Campground\nLooking to Partner\nPrivacy Policy\nTerms & Conditions\n© Outdoor Adventure Retreats LLC. All rights reserved.\nMade by\nKing Willy Camping\n.\nClose Menu\nRetreats\nCrescent Fish Camp\nCrescent City, FL\nWanee Lake\nAshburn, GA\nWilderness Cove\nSaluda, NC\nCotton Patch Landing\nChocowinity, NC\nAbout Us\nAbout OAR\nMedia\nCampfire Chronicles\nMy Account\nCart\nContact\nContact Us\nJob Board\nSell Your Campground\nLooking To Partner\nOAR Affiliate Program\n© Outdoor Adventure Retreats LLC. All rights reserved.",
      "emails": []
    }
  ],
  "all_links": [
    "https://outdooradventureretreats.com/wanee-lake/",
    "https://outdooradventureretreats.com/crescent-fish-camp/",
    "https://outdooradventureretreats.com/wp-content/uploads/2024/04/OARCrescentFishCampMapEditedArtboard-1.png",
    "https://outdooradventureretreats.com",
    "https://outdooradventureretreats.com/crescent-fish-camp-cottages",
    "https://book.outdooradventureretreats.com/cart",
    "https://outdooradventureretreats.com/crescent-fish-camp/info@crescentfishcamp.com",
    "https://outdooradventureretreats.com/contact/",
    "https://outdooradventureretreats.com/wp-content/uploads/2025/08/CFC-Membership-Enrollment-Form.pdf",
    "https://book.outdooradventureretreats.com/campgrounds/1881/crescent-fish-camp",
    "https://outdooradventureretreats.com/oar-affiliate-program/",
    "https://outdooradventureretreats.com/wp-content/uploads/2023/08/Crescent-Fish-Camp-Map.pdf",
    "https://outdooradventureretreats.com/about-outdoor-adventure-retreats/",
    "https://outdooradventureretreats.com/privacy-policy/",
    "https://outdooradventureretreats.com/faq/",
    "https://outdooradventureretreats.com/looking-to-partner/",
    "https://outdooradventureretreats.com/crescent-fish-camp-rv-sites",
    "https://outdooradventureretreats.com/crescent-fish-camp-vacation-homes",
    "https://outdooradventureretreats.com/wilderness-cove/",
    "https://outdooradventureretreats.com/media/",
    "https://outdooradventureretreats.com/campfire-chronicles/",
    "https://outdooradventureretreats.com/wp-content/uploads/2025/05/CFC-Membership-Enrollment-Form-1.pdf",
    "https://outdooradventureretreats.com/",
    "https://outdooradventureretreats.com/contact",
    "https://outdooradventureretreats.com/terms-and-conditions/",
    "https://book.outdooradventureretreats.com/",
    "https://book.outdooradventureretreats.com/campgrounds/1881/crescent-fish-camp?_gl=1*1pyewm2*_gcl_au*MTgyMTgzOTQ3My4xNzIxMDc3MTU3LjE3Nzg4Mzc2NjcuMTcyNjQ5OTY4My4xNzI2NDk5Njgy*_ga*MTQxMTE5NDQuMTcyMTA3NzE1OA..*_ga_6R716F39LZ*MTcyNjQ5MTk2OC4yMi4xLjE3MjY1MDE4MDAuNjAuMC4xNzQ2MTA0OTUw",
    "https://outdooradventureretreats.com/sell-your-campground/",
    "https://outdooradventureretreats.com/cotton-patch-landing/",
    "https://book.outdooradventureretreats.com/profile/account"
  ],
  "candidate_links": [
    "https://outdooradventureretreats.com/contact/",
    "https://outdooradventureretreats.com/wp-content/uploads/2025/08/CFC-Membership-Enrollment-Form.pdf",
    "https://outdooradventureretreats.com/about-outdoor-adventure-retreats/",
    "https://outdooradventureretreats.com/wp-content/uploads/2025/05/CFC-Membership-Enrollment-Form-1.pdf"
  ],
  "visited": [
    "https://outdooradventureretreats.com/crescent-fish-camp/",
    "https://outdooradventureretreats.com/about",
    "https://outdooradventureretreats.com/contact",
    "https://outdooradventureretreats.com/staff",
    "https://outdooradventureretreats.com/team",
    "https://outdooradventureretreats.com/board",
    "https://outdooradventureretreats.com/directory",
    "https://outdooradventureretreats.com/events",
    "https://outdooradventureretreats.com/sitemap.xml",
    "https://outdooradventureretreats.com/council",
    "https://outdooradventureretreats.com/leadership",
    "https://outdooradventureretreats.com/management",
    "https://outdooradventureretreats.com/producers",
    "https://outdooradventureretreats.com/support",
    "https://outdooradventureretreats.com/crew",
    "https://outdooradventureretreats.com/members",
    "https://outdooradventureretreats.com/bios",
    "https://outdooradventureretreats.com/people",
    "https://outdooradventureretreats.com/artists",
    "https://outdooradventureretreats.com/musicians",
    "https://outdooradventureretreats.com/faculty",
    "https://outdooradventureretreats.com/administration",
    "https://outdooradventureretreats.com/contact/",
    "https://outdooradventureretreats.com/wp-content/uploads/2025/08/CFC-Membership-Enrollment-Form.pdf",
    "https://outdooradventureretreats.com/about-outdoor-adventure-retreats/",
    "https://outdooradventureretreats.com/wp-content/uploads/2025/05/CFC-Membership-Enrollment-Form-1.pdf"
  ],
  "base_url": "https://outdooradventureretreats.com/crescent-fish-camp/"
}