{
  "pages": [
    {
      "url": "http://www.palmbeachzoo.org/Promotional-Events",
      "is_candidate": false,
      "has_email": false,
      "text": "Groups & Events\nEvents\nThe Holiday Event that Saves Animals in the Wild\nZoo Lights Celebrating 5\nYears of Holiday Magic\nBest Value - Day and Night Combo Tickets\npurchase member tickets\nZoo Lights General Admission Tickets\nWe’re excited to announce the return of your favorite holiday spectacular. It’s a captivating event that will illuminate the Zoo with festive cheer and enchantment. Starting November 23 and running through January 5, this magical event will transform the Zoo into a winter wonderland of twinkling lights and seasonal delights. Take photos with Santa. Decorate cookies, and roast s’mores. Enjoy hourly light shows, music and “snow” in the fountain!\nZoo Lights is presented by Florida Power & Light Company, FPL SolarNow\n®\n.\nZoo Year's Eve\nThis December 31st, celebrate Zoo Year’s Eve at Palm Beach Zoo! Enjoy hourly Christmas Tree Countdown Light Shows, a celebratory family-friendly toast and more! This celebratory toast is generously sponsored by The Palm Beach Post. Zoo Year's Eve is included in  Zoo Lights admission, no additional purchases necessary\nFlexible Plan ahead Pricing\nEvent Time 5:30 - 9:00 PM on select nights\nTicket prices vary based on Membership status and the date you attend. See below.\nThis is a rain or shine, non-refundable event.\nAdult Nights - November 15 &16, December 5 & 12\nCall up the babysitter and reserve tickets for one of our 21 and older Zoo Lights nights. Enjoy a vibrant, adults-only evening amid dazzling light displays and festive decor. Sip on craft cocktails, enjoy a festive dinner, and groove to music as you wander through the zoo's enchanting illuminated pathways. With a lively atmosphere and unique experiences around every corner, Adult Night at Zoo Lights promises a memorable night out in the jungle. Don’t miss this chance to explore the zoo in a whole new light!\nIs Zoo Lights included with regular admission?\nNo, Zoo Lights is a special event that has a unique ticket. Daytime admission is not required to attend Zoo Lights.\nWe are offering a Combo Ticket that includes a discount for daytime admission.\nZoo Members will get special discounted pricing. You must be a member to purchase a member ticket. Members will sign in to purchase their ticket(s) at the discounted rate. Your login includes your email address associated with your account. You may need to set up an account using that email address, if you have not previously registered on the ticketing system.\nDo I have to bring my printed ticket to the event?\nYou can show either a printed ticket or an electronic ticket on your smartphone.\nWhat areas of the Zoo are open during Zoo Lights?\nZoo Lights takes place throughout the majority of the park. Please reference the map before and during your visit!\nWhat animals will I see during Zoo Lights?\nMost of the Zoo’s residents are more active during the day. You may catch a glimpse of a few animals along the pathways. However, the main focuses of Zoo Lights are the more than one million LED lights, music and holiday treats.\nWill the Fountain Splash Pad be running during Zoo Lights?\nThe splash pad will be off during Zoo Lights. A DJ will be entertaining families in the Fountain Plaza, playing family-friendly hits every evening. The s’mores station and libation stations will also add to the festive atmosphere of the Plaza.\nWill the Wildlife Carousel be operating during Zoo Lights?\nYes, the carousel will be running each evening.\nAre food and beverages available at Zoo Lights?\nThere are several unique food options available during Zoo Lights. Latitude 26 Café is open serving a menu of meal options and drinks, including beer and wine. The concessions stand is also open during the event.\nThis year, you can also order online and pick up your food without waiting in line. Look for the QR codes in the Zoo or\nclick here\nto order.\nThe Fountain Plaza is North Pole Circle. It includes a s’mores station, funnel cakes, a bar, beer and wine.\nWhat is prohibited during Zoo Lights?\nNo outside food or beverages. No pets. No weapons.\nWhat is the refund policy?\nThis is a rain-or-shine event. No refunds will be given. No refunds for no-shows.\nWill Santa be available for photos?\nYes, Santa will be available for photos until December 23. After that date, he heads north to get ready for Christmas.\nParking Instructions\nThe main parking lot of the Zoo may fill up quickly. Additional parking is located just across Summit Blvd. to the south in Dreher Park South lots A, B, C and soccer field.\nRenaissance Charter School, located on the west side of the underpass, will be open for off-site parking each night.\nMolly's Trolleys will bring guests to the front gate of the Zoo for drop-off and pickup on Premium Nights (Nov. 25 – 27 & Dec. 16 – 23).\nZoo Lights Parking Map\nGeneral Zoo Lights Map\nDrop-Off\nOnce our main parking lot (on the Zoo side of Summit) is full, a drop-off lane will be available near the main gate.",
      "emails": []
    },
    {
      "url": "http://www.palmbeachzoo.org/membership-faq",
      "is_candidate": false,
      "has_email": false,
      "text": "Tickets & Information\nMembership\nMembership FAQ\nFrequently Asked Questions\nHere are the answers to some Frequently Asked Questions regarding Zoo Membership:\nWho can use my membership?\nFor any membership level (excluding individual), there is a place for 2 names on the membership card, with this, there are two options:\n-You can name one adult, and leave the second name as \"guest\". This means that the named adult needs to be at the Zoo to use the membership, but the \"guest\" can be any one person each visit.\n-You can name two adults on the membership card. This will allow the named adults to visit together, or separetely, and receive the membership benefits.\n*At least one of the members must be present in order for those covered under the membership to be admitted. Children covered under a membership will not be admitted without at least one of the named adults on the membership accompanying them.\n*Children under 3 are FREE and can come along with any Zoo Membership level!\nWhen does my membership begin?\nYour membership begins the day you sign up and will be valid for a year from that date. For example: If you purchased a membership on January 1st of 2021, it would be valid 01/01/21-12/31/2021. You can use your membership on the day your membership expires.\nWhen does my membership expire?\nYour expiration date is printed on your membership card. You can use your membership on the day it is set to expire. If you do not have that available please visit the ticket booth or email\n[email protected]\n.\nWhat do I do if I lost my membership card?\nYou can still visit the Zoo! You will just need your photo ID to gain admission, our staff will be able to look up your account at the Admissions Booth. If you need a new membership card please let the staff at the Admissions area know, or e-mail our Membership department at\n[email protected]\n.\nIN THIS SECTION\nReciprocal Zoos\nMembership FAQ\nBegin Constant Contact Inline Form Code\nEnd Constant Contact Inline Form Code",
      "emails": []
    },
    {
      "url": "http://www.palmbeachzoo.org/media-contact",
      "is_candidate": false,
      "has_email": false,
      "text": "Support The Zoo\nContact Us\nMedia Contact\nReporters, members of the press, and tourism partners should contact Amanda Joiner, Chief Marketing and Technology Officer -\n[email protected]\nOR John Towey, Public Relations Manager -\n[email protected]\nwith\nany and all\nmedia requests. This includes interview/film/photography requests, press releases, potential blog and travel writer partnerships, or to be included on our media distribution list.\nPalm Beach Zoo reserves the right to photograph, videotape, or film our visitors on Zoo grounds for promotional purposes, without further authorization or compensation.\nShare Your Photos With the Zoo\nPalm Beach Zoo appreciates the many donations of photography it has received from guests and supporters. If you have a photo you'd like to share with us, please email a high-resolution attachment to\n[email protected]\n. Please note that your photo may be used for Zoo social media, marketing, publications, public relations and on our website, so please include proper crediting information. Thank you!\nFilming & Photography Guidelines\nThe Palm Beach Zoo & Conservation Society welcomes visitors who wish to photograph on Zoo grounds. All images made for personal enjoyment (non-profit making) are allowed free of charge.\nAll photographs should be taken from designated visitor viewing areas, or within the boundaries as it relates to special programs, engagements, etc. and the Zoo has the right to withhold or withdraw consent to photograph and video or to reproduce photographs or video of the Zoo, which includes zoo exhibits, animals, and buildings or otherwise defined. For guest and animal safety, photographic equipment (lenses, tripods, selfie sticks, etc.) cannot break the plane of any public fences/barricades.\nWhile shooting, consideration must be given to other visitors, so the view of the animals and exhibits is not obstructed. Students who are using the Zoo for a school assignment will need to discuss whether staff assistance is required. These requests will be considered on a case-by-case basis, and a fee may be required depending on the level of Zoo involvement.\nThe Zoo has the right to withhold or withdraw consent to photograph and video or to reproduce photographs or video of the Zoo, which includes zoo exhibits, animals, and buildings or otherwise defined.\nAdmittance into the Palm Beach Zoo & Conservation Society grants permission to the Zoo to utilize guests’ likeness, actions or statements in any live or recorded audio, video or photographic display or other transmission, publication or reproduction at the Zoo in any medium or context for commercial or promotional purposes without further authorization or compensation. Each guest individually and on behalf of his/her minor children further waives any right to pre-approval, royalties or other compensation arising from or related to the use of imagery.\nAll trademarks, service marks, logos, images, and facilities of the Palm Beach Zoo & Conservation Society and the Zoological Society of the Palm Beaches, Inc. are the sole property of the Zoo and may not be used, reproduced, displayed or distributed without written consent from the Zoo.\nIN THIS SECTION\nDonation Request Policy\nMedia Contact\nBegin Constant Contact Inline Form Code\nEnd Constant Contact Inline Form Code",
      "emails": []
    },
    {
      "url": "https://www.palmbeachzoo.org/contact-us",
      "is_candidate": false,
      "has_email": false,
      "text": "Support The Zoo\nContact Us\nHow can we help you?\nFor Ticket Donation Request Information Click Here\nrecaptcha\nIN THIS SECTION\nDonation Request Policy\nMedia Contact\nBegin Constant Contact Inline Form Code\nEnd Constant Contact Inline Form Code",
      "emails": []
    },
    {
      "url": "http://www.palmbeachzoo.org/support-the-zoo",
      "is_candidate": false,
      "has_email": false,
      "text": "Support The Zoo\nMenu\nDonate To Your Zoo\nBig Cat Society\nHelp Fund Capital Projects\nPartners\nContact Us\nPartner Spotlight: Palm Beach Post\nAdopt an Animal\nPartnerships\nDonor Privacy Policy\nJoin The Team",
      "emails": []
    },
    {
      "url": "http://www.palmbeachzoo.org/groupsatthezoo",
      "is_candidate": false,
      "has_email": false,
      "text": "Groups & Events\nEvents Calendar\nMenu\nGroup Rates\nEvents\nParties and Gatherings\nAutism Awareness Day",
      "emails": []
    },
    {
      "url": "http://www.palmbeachzoo.org/zoo-events",
      "is_candidate": false,
      "has_email": false,
      "text": "Groups & Events\nEvents\nZoo Events Calendar",
      "emails": []
    },
    {
      "url": "http://www.palmbeachzoo.org/board-of-directors",
      "is_candidate": false,
      "has_email": false,
      "text": "About Us\nLeadership\nBoard of Directors\nBoard of Directors\nZoological Society of the Palm Beaches, Inc.\nOfficers\nMichele Kessler, Chairman\nLuis J. Fernandez, Co-Vice Chairman\nJonathan Clay, Co-Vice Chairman\nGary E. Krieger, Treasurer\nDr. Daniel J. Comerford III, Secretary\nMembers-At-Large\nMaura Ziska Christu\nJosh McGraw\nGuillermo Perez-Vargas\nMatt Valle\nDirectors\nMarilyn Beuttenmuller, Esq.\nDeborah Dauman\nCaroline Dean\nRobert B. Dunkin ll\nMei Sze Greene\nCarole Moran\nMitchell Quain\nThomas C. Quick\nBoard Member Emeritus\nAlvin Brown\nPeggy Brown\nKim Campbell\nJames Hancock\nLadona Hancock\nIN THIS SECTION\nMeet the Chiefs\nBoard of Directors\nAssociation of Zoos and Aquariums (AZA)\nBegin Constant Contact Inline Form Code\nEnd Constant Contact Inline Form Code",
      "emails": []
    },
    {
      "url": "https://www.palmbeachzoo.org/membership",
      "is_candidate": false,
      "has_email": false,
      "text": "Tickets & Information\nMembership\nMembership Information\nBecome an Annual Palm Beach Zoo Member today and enjoy our beautiful, 23-acre tropical park full of WILD things! With a Zoo Membership, you can visit as many times as you would like for an entire year* (see below for more information about Membership Benefits). In addition to great benefits and perks, members help support our mission to \"inspire people to act on behalf of wildlife and the natural world\".\nUpgrade your general admission ticket purchase to a membership by visiting the front ticket booth during the day of your visit, or by emailing your receipt to\n[email protected]\nwithin 24 hours of your visit.\nPurchase or Renew A Membership\nIN THIS SECTION\nReciprocal Zoos\nMembership FAQ\nBegin Constant Contact Inline Form Code\nEnd Constant Contact Inline Form Code\nMembership Levels\nFamily or Grandparent: $224.95\nTwo adults and all children living in the household ages 17 and under.  This membership can also be purchased for grandparents  (including all grandchildren, who need not live in the same household).\nIndividual: $74.95\nNamed card holder only per visit\nIndividual Senior: $69.95\nNamed card holder (age 60+) only per visit\nDual: $154.95\nNamed card holder and additional person (named or guest) per visit\nDual Senior: $144.95\nNamed card holder (age 60+) and additional person (named or guest) per visit\nAdditional Adult: $74.95\nIn order to add an additional named adult onto either a Family, Grandparent, Dual, or Dual Senior membership, two named adults must be selected on the original pass. If you choose to add an additional adult, the pass will reflect three named adults. You will not be able to have an optional guest on the pass.\nPurchase A Membership\nPalm Beach County Teacher Memberships\nMUST BE PURCHASED IN PERSON AT THE FRONT GATE - Discounted membership for all current Palm Beach County Public and Private School teachers (must show proof of employment, restrictions apply).\nDOWNLOAD TEACHER MEMBERSHIP FORM\nBig Cat Society: $500+\nReceive all the benefits of a Family Membership while also contributing philanthropically to YOUR Zoo. Includes Big Cat Society insider updates as well as opportunities to participate in the Zoo's invitation-only fundraising events. Step up for big cats today!\nLearn More About Big Cat Society\nYou can Purchase a Membership Two Different Ways\n1. Purchase a membership online. Scroll down for links.\n2. Visit our front ticket booth anytime between 9:00am-4:15pm daily*.\n*Only closed on Thanksgiving and Christmas day\nWant to Give Someone a Membership?\nPurchase a Gift Membership\nYou will then be e-mailed a link to the gift certificate.\nThen you have a couple of options:\nPrint the certificate\nForward the certificate link to the recipient\nShow your gift certificate to our Admissions staff on your mobile device\nIf you purchase a membership as a gift for friends or family remember, benefits do not begin until the gift membership is activated during the recipient's first visit!\nAnnual Membership Privileges\nFree or discounted admission to more than 140 zoos, aquariums & museums nationwide!\nCLICK HERE FOR RECIPROCAL ZOO LIST\nUnlimited daytime admission* to the Palm Beach Zoo & Conservation Society throughout the year for all of those who qualify under your membership.\n10% discount in the Zoo’s gift shops and concessions areas including Latitude 26 Cafe.\nInvitations to Member’s Only events and exhibit openings.\nUpdates and opportunities that highlight how you're\nsaving wildlife locally and worldwide by being a part of the Zoo family\n*Daytime admission is daily 9am-4:15pm, closed Thanksgiving and Christmas Day.",
      "emails": []
    },
    {
      "url": "http://www.palmbeachzoo.org/join-the-team",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    },
    {
      "url": "http://www.palmbeachzoo.org/about-us",
      "is_candidate": false,
      "has_email": false,
      "text": "About Us\nThe history of the Palm Beach Zoo is over 50 years of progress, from a small red barn to a major recreational attraction for the City of West Palm Beach. It is hard to believe that a few barnyard animals have evolved to hundreds of animals residing at the zoo. The zoo would not be what it is today without the help of one man. Paul Albert Dreher was born in Wurttemberg, Germany and was long interested in landscaping, which led him to obtain a degree in horticulture from the University of Hohen-Heim. After receiving his degree, Dreher moved to South Florida.\nPalm Beach Zoo is located in Dreher Park, formerly known as Bacon Park. Bacon Park was utilized as a landfill and a tent city campground, which was destroyed in the 1928 hurricane. In 1932, Dreher took a job with the Parks Department for the City of West Palm Beach. Dreher’s love for landscaping led him to reuse unwanted trees and plants from other projects around the county, giving him the nickname “The Johnny Appleseed of Palm Beach County.” The 108-acre Bacon Park was owned by the state, leading Paul Dreher to begin a campaign to purchase the land. In 1951, the city of West Palm Beach paid the state $100 for Bacon Park which would be dedicated and renamed Dreher Park in October 1957. Paul Dreher then worked to develop the land into a usable park. The landfill was removed from the park, and swampland was filled in using backfill from the Palm Beach Canal.\nDreher envisioned a zoo for the park that would be an asset for the residents of West Palm Beach. In August 1961, it was announced that a zoo would be built in Dreher Park. Soon after the announcement, the Parks Department set to work building a red barn complete with a fenced-in barnyard with ample room for animals to roam. Using his own money, Dreher purchased for the barnyard ducks, chickens, rabbits, and one goat named Pepita. The “Dreher Park Farm Zoo,” which later became known simply as the “Dreher Park Zoo,” received its first exotic inhabitant when the Pilicy family donated a rhinoceros iguana on September 5, 1963. The zoo was free for all guests until 1970.\nAs the zoo continued to grow in size, so did the animal collection. A famous resident of West Palm Beach in the 60’s was Joey, the kangaroo. An airline pilot was between flights in Australia when he found a kangaroo for sale. He purchased the animal and flew it back to Florida. Unable to keep the kangaroo long-term, he gave Joey to his friend Walter Brooks III. Joey became infamous for escaping from Walter Brook’s home several times, making him well known to South Florida residents. Joey was featured in two issues of Life Magazine in October 1961 and April 1964 and was declared an honorary member of the Boy Scouts of America. Visitors to see Joey at the home of Walter Brooks were common, with a frequent visitor being Caroline Kennedy. In December 1961, Brooks received a letter from attorney Elwyn Middleton against the possession of Joey. This led to a Palm Beach ordinance that banned all pets excluding cats, dogs, canaries, parrots, and parakeets. A petition was started to repeal the ordinance. After two years of legal battles by Joey’s owners and Palm Beach residents, Joey was not permitted to stay as a house pet. On February 29, 1964, Joey was moved to the Dreher Park Zoo, where he remained a resident.\nIn the early 1960’s “Jett’s Petting Zoo” visited South Florida, intriguing the citizens with the presence of an Asian baby elephant. Although recently acquiring a famous kangaroo, the zoo was made up of a group of miscellaneous animals and lacked a major attraction. This led the residents of South Florida to campaign for the purchase of the young elephant for the zoo. The West Palm Beach Firemen's Benevolent Association worked to buy the elephant by raising 1,000 books of Top Value Trading Stamps. Top Value Trading Stamps, whose mascot was a cartoon elephant named Toppie, made it fitting to name the newly acquired elephant “Toppie.” On April 16, 1965, the four-year-old, 2,000-pound elephant arrived at the zoo, where she would remain for nearly ten years.\nIn addition to the acquisition of an elephant, 1965 also brought the first animal birth at the zoo. Zoo officials thought the first birth was going to be a pregnant miniature goat. They were surprised on May 19, 1965, when a squirrel monkey gave birth. The surprises that day did not stop there. Remarkably, the second birth of the zoo occurred on the same day as the first. White-fronted capuchin Clarabelle gave birth later that afternoon. The birth prediction of Nanny Belle the miniature goat became a reality on June 1, 1965, making her baby the third animal born in the zoo’s history.\nIn 1969, a group of citizens in West Palm Beach showed an interest in creating a society for the advancement and support of the zoo. With the support of the city, The Zoological Society of the Palm Beaches was founded on March 27, 1969. On October 1st, the operation of the zoo was transferred over to the Zoological Society. On October 5th, a ceremony was held in which Society President Charles Camus gave Mayor Eugene Potter the zoo’s first lease agreement. From this point on, the Zoological Society operates the Zoo, while the city owns and rents the land that the zoo is on.\nUnder the management of the Zoological Society, the zoo underwent major improvements. By 1971, many of the older enclosures in the zoo had been replaced, and several pathways were paved. 1971 also marked the arrival of Freddie the Alligator. Freddie was the first to hatch out of a clutch of eggs in 1969. His hatching was featured in the documentary “Alligator” produced by the South Florida Water Management District. A cartoon version of Freddie was the mascot of the Water Management District and remains so today. Freddie was lost in 1985 and was replaced by two alligators known as Freddie II and Frieda.\nIn the 1970’s, the Dreher Park Zoo acquired many of its first big-ticket animals. In 1969, Hammer the black bear arrived at the zoo. Hammer was one of the bears used in the television show “Gentle Ben,” a program in which a game warden’s son has a pet bear. In 1973, Princess the Bengal tiger became the zoo’s first big cat, marking a long history of the zoo engaging in tiger conservation. In addition to the arrival of many large animals, the biggest animal of the zoo made her departure. On March 12, 1975, Toppie the elephant was loaded onto a truck and moved to another zoo. In 1978, the zoo received Zelda and Henrietta the pygmy hippos.\nOn October 7, 1981, the zoo received its first Goeldi’s monkeys, becoming one of the few zoos at the time to have them. The zoo built the first outdoor exhibit for this species in the United States. 1981 also marked the arrival of Spanky, the zoo’s “weather predicting sun bear.” Each groundhog’s day, an event was held in which Spanky would see if South Florida had six more weeks of winter.\nIn the 1970’s to early 1980’s, the zoo fell on heavy debt. As the Zoological Society was relatively new at this time, the debt was a major issue. It was debated if the zoo should be relocated to the newly-opened Okeeheelee Park. The zoo met with the Okeeheelee Park Task Force to consider the move but later decided against it due to the added financial costs. The closure of the zoo was considered as a possibility if the financial condition did not improve. Paul Dreher, although no longer working at the zoo, urged the city to keep the zoo open. In February 1984, Michael July was appointed as director of the zoo, taking the zoo from deficit to profit in one year.\nIn 1987, Townee the Bengal tiger arrived at the zoo. Born in January, Townee was confiscated by the Fish and Wildlife Commission (FWC) after being illegally held as a pet in Miami. Soon after the arrival of Townee, Kali the Bengal tiger arrived from another zoo. Townee was a resident of the zoo for 20 years before passing away in 2007. Townee lived to be one of the oldest tigers in the United States.\nJoining the ranks of top zoos like San Diego and the Bronx, the Dreher Park Zoo applied to become a member of the Association of Zoos and Aquariums (AZA). The AZA helps its members create higher standards for both animals and guests. Zoo director Gail Schneider led the charge to raise the zoo’s status, and the zoo was accepted and accredited in March 1989.\nIn July 1986, the zoo acquired Tayke the Florida panther, who was the only Florida panther on exhibit in South Florida. George the Texas cougar, who would one day reside at the zoo, was released into the Everglades of Florida by the FWC. George had a vasectomy before being released. The procedure failed, and George bred in the wild. George became a nuisance animal and was subsequently brought to the zoo soon after. A second vasectomy was conducted by FWC before arriving, and he then went on exhibit with Tayke. George’s second procedure was unsuccessful as well and resulted in two panther cubs being born to Tayke and George on March 17, 1995. Two weeks after their birth, Tayke accidentally killed one of the cubs. The other cub, later named Colin, was separated from Tayke and raised by hand. Although George and Tayke were later moved to another zoo, Colin remained a resident of the zoo for 17 years.\n1997 was a turning point in the Zoo’s history. In January, the Dreher Park Zoo changed its name to the Palm Beach Zoo at Dreher Park, which was later shortened to the Palm Beach Zoo. With the help of a large gift from board members George and Harriett Cornell, the zoo’s board announced a $30 million redevelopment of the park. Their contribution is among the largest gifts received by any American zoo.\nOn March 19, 2000, Tiger Falls opened to the public for Townee and Kali the Bengal tigers. Tiger Falls now houses Malayan tigers, with which the zoo has successfully had three cubs born in 2011. Tiger Falls was the zoo’s first “immersion exhibit,” taking you from South Florida to the lush jungles of Southeast Asia. In 2001, the zoo opened the Florida Pioneer Trail, a recreation of a cypress swamp habitat. Later exhibits were added to this complex, such as the black bear exhibit in 2005.\nThe redevelopment continued with the installation in 2003 of the Zoo’s Interactive Fountain and Orientation Plaza where Zoo guests can splash in a 54-foot circular fountain that included 325 water jets and more than 200 colorful lights.\nIn 2004, the Zoo opened the “George and Harriett Cornell Tropics of the Americas,” an $18 million exhibit that displays jaguars, giant anteaters, capybara, New World monkeys, and a diverse collection of tropical birds. The expansive jaguar exhibit is widely recognized as one of the best exhibits for jaguars in America. Tropics of the Americas is the largest project in the zoo’s history to date.\nThe Melvin J. and Claire Levine Animal Care Complex opened on Earth Day, April 22, 2009. The 10,000 square foot facility is a five-million-dollar animal hospital located on the grounds of the zoo. It is the nation’s first LEED-certified (Gold) zoo animal hospital. Thanks to a grant from Florida Power and Light Corporation, it is equipped with solar panels that help power some of the hospital.\nIn 2014 to emphasize its mission, the Palm Beach Zoo changed its name to the Palm Beach Zoo and Conservation Society. Today, the zoo houses over 500 animals on 23 acres and sees approximately 300,000 visitors annually.\nIN THIS SECTION\nZoo Mission\nZoo History\nZoo News\nLeadership\nDonation Request\nFinancials\nImpact Reports\nUpdates\nBegin Constant Contact Inline Form Code\nEnd Constant Contact Inline Form Code",
      "emails": []
    },
    {
      "url": "http://www.palmbeachzoo.org/membership",
      "is_candidate": false,
      "has_email": false,
      "text": "Tickets & Information\nMembership\nMembership Information\nBecome an Annual Palm Beach Zoo Member today and enjoy our beautiful, 23-acre tropical park full of WILD things! With a Zoo Membership, you can visit as many times as you would like for an entire year* (see below for more information about Membership Benefits). In addition to great benefits and perks, members help support our mission to \"inspire people to act on behalf of wildlife and the natural world\".\nUpgrade your general admission ticket purchase to a membership by visiting the front ticket booth during the day of your visit, or by emailing your receipt to\n[email protected]\nwithin 24 hours of your visit.\nPurchase or Renew A Membership\nIN THIS SECTION\nReciprocal Zoos\nMembership FAQ\nBegin Constant Contact Inline Form Code\nEnd Constant Contact Inline Form Code\nMembership Levels\nFamily or Grandparent: $224.95\nTwo adults and all children living in the household ages 17 and under.  This membership can also be purchased for grandparents  (including all grandchildren, who need not live in the same household).\nIndividual: $74.95\nNamed card holder only per visit\nIndividual Senior: $69.95\nNamed card holder (age 60+) only per visit\nDual: $154.95\nNamed card holder and additional person (named or guest) per visit\nDual Senior: $144.95\nNamed card holder (age 60+) and additional person (named or guest) per visit\nAdditional Adult: $74.95\nIn order to add an additional named adult onto either a Family, Grandparent, Dual, or Dual Senior membership, two named adults must be selected on the original pass. If you choose to add an additional adult, the pass will reflect three named adults. You will not be able to have an optional guest on the pass.\nPurchase A Membership\nPalm Beach County Teacher Memberships\nMUST BE PURCHASED IN PERSON AT THE FRONT GATE - Discounted membership for all current Palm Beach County Public and Private School teachers (must show proof of employment, restrictions apply).\nDOWNLOAD TEACHER MEMBERSHIP FORM\nBig Cat Society: $500+\nReceive all the benefits of a Family Membership while also contributing philanthropically to YOUR Zoo. Includes Big Cat Society insider updates as well as opportunities to participate in the Zoo's invitation-only fundraising events. Step up for big cats today!\nLearn More About Big Cat Society\nYou can Purchase a Membership Two Different Ways\n1. Purchase a membership online. Scroll down for links.\n2. Visit our front ticket booth anytime between 9:00am-4:15pm daily*.\n*Only closed on Thanksgiving and Christmas day\nWant to Give Someone a Membership?\nPurchase a Gift Membership\nYou will then be e-mailed a link to the gift certificate.\nThen you have a couple of options:\nPrint the certificate\nForward the certificate link to the recipient\nShow your gift certificate to our Admissions staff on your mobile device\nIf you purchase a membership as a gift for friends or family remember, benefits do not begin until the gift membership is activated during the recipient's first visit!\nAnnual Membership Privileges\nFree or discounted admission to more than 140 zoos, aquariums & museums nationwide!\nCLICK HERE FOR RECIPROCAL ZOO LIST\nUnlimited daytime admission* to the Palm Beach Zoo & Conservation Society throughout the year for all of those who qualify under your membership.\n10% discount in the Zoo’s gift shops and concessions areas including Latitude 26 Cafe.\nInvitations to Member’s Only events and exhibit openings.\nUpdates and opportunities that highlight how you're\nsaving wildlife locally and worldwide by being a part of the Zoo family\n*Daytime admission is daily 9am-4:15pm, closed Thanksgiving and Christmas Day.",
      "emails": []
    },
    {
      "url": "http://www.palmbeachzoo.org/leadership",
      "is_candidate": false,
      "has_email": false,
      "text": "About Us\nLeadership\nMenu\nMeet the Chiefs\nBoard of Directors\nAssociation of Zoos and Aquariums (AZA)\nIN THIS SECTION\nMeet the Chiefs\nBoard of Directors\nAssociation of Zoos and Aquariums (AZA)\nBegin Constant Contact Inline Form Code\nEnd Constant Contact Inline Form Code",
      "emails": []
    },
    {
      "url": "http://www.palmbeachzoo.org/contact-us",
      "is_candidate": false,
      "has_email": false,
      "text": "Support The Zoo\nContact Us\nHow can we help you?\nFor Ticket Donation Request Information Click Here\nrecaptcha\nIN THIS SECTION\nDonation Request Policy\nMedia Contact\nBegin Constant Contact Inline Form Code\nEnd Constant Contact Inline Form Code",
      "emails": []
    }
  ],
  "all_links": [
    "http://www.palmbeachzoo.org/Promotional-Events",
    "http://www.palmbeachzoo.org/zoo-map",
    "http://www.palmbeachzoo.org/gala",
    "http://www.palmbeachzoo.org/actions",
    "http://www.palmbeachzoo.org/summer-zoo-camp",
    "http://www.palmbeachzoo.org/membership-faq",
    "http://www.palmbeachzoo.org/otter-experience",
    "http://www.palmbeachzoo.org/autism-awareness-day",
    "http://www.palmbeachzoo.org/",
    "http://www.palmbeachzoo.org/donation-request-policy",
    "http://www.palmbeachzoo.org/reef",
    "http://www.palmbeachzoo.org/animal-experience-faqs",
    "http://www.palmbeachzoo.org/koala-experience",
    "http://www.palmbeachzoo.org/somali-giraffe-project",
    "http://www.palmbeachzoo.org/media-contact",
    "http://www.palmbeachzoo.org/donate-1",
    "https://www.palmbeachzoo.org/contact-us",
    "https://www.palmbeachzoo.org/general-info",
    "http://www.palmbeachzoo.org/partnerships",
    "http://www.palmbeachzoo.org/zoo-events/event/5389913",
    "http://www.palmbeachzoo.org/zoo-events/event/5389914",
    "http://www.palmbeachzoo.org/aldabra-tortoise-experience",
    "http://www.palmbeachzoo.org/impact-reports",
    "http://www.palmbeachzoo.org/home_link",
    "http://www.palmbeachzoo.org/zoo-news",
    "https://www.palmbeachzoo.org/?keyword=GeneralAdmissionDPR",
    "http://www.palmbeachzoo.org/animals",
    "http://www.palmbeachzoo.org/animalexperiences",
    "http://www.palmbeachzoo.org/support-the-zoo",
    "http://www.palmbeachzoo.org/coloring-pages",
    "http://www.palmbeachzoo.org/sloth-experience",
    "http://www.palmbeachzoo.org/sitemap",
    "http://www.palmbeachzoo.org/corridor",
    "http://www.palmbeachzoo.org/DAZ",
    "http://www.palmbeachzoo.org/zoo-amenities",
    "http://www.palmbeachzoo.org/zoo-events/event/5389915",
    "http://www.palmbeachzoo.org/groupsatthezoo",
    "http://www.palmbeachzoo.org/malaysia",
    "https://www.palmbeachzoo.org/?keyword=ZooLightsDPR",
    "http://www.palmbeachzoo.org/zoo-events",
    "http://www.palmbeachzoo.org/conservation",
    "http://www.palmbeachzoo.org/general-info",
    "http://www.palmbeachzoo.org/donor-privacy-policy",
    "http://www.palmbeachzoo.org/reciprocal-zoos",
    "http://www.palmbeachzoo.org/board-of-directors",
    "http://www.palmbeachzoo.org/palm-beach-post-spotlight",
    "http://www.palmbeachzoo.org/the-aza",
    "http://www.palmbeachzoo.org/education-and-conservation-",
    "http://www.palmbeachzoo.org/plan-your-visit",
    "https://www.palmbeachzoo.org/zoo-map",
    "http://www.palmbeachzoo.org/big-cat-society",
    "http://www.palmbeachzoo.org/birthday-parties",
    "https://www.palmbeachzoo.org/zoo-news/posts/swaptember-returns",
    "http://www.palmbeachzoo.org/partners",
    "https://www.palmbeachzoo.org/membership",
    "http://www.palmbeachzoo.org/home",
    "http://www.palmbeachzoo.org/panthercam",
    "https://www.palmbeachzoo.org/donation-request-policy",
    "http://www.palmbeachzoo.org/evergladescenter",
    "http://www.palmbeachzoo.org/palm-beach-zoo-conservation",
    "http://www.palmbeachzoo.org/bear-experience",
    "http://www.palmbeachzoo.org/financials",
    "http://www.palmbeachzoo.org/join-the-team",
    "http://www.palmbeachzoo.org/lorikeetloft",
    "http://www.palmbeachzoo.org/snail-kite-conservation",
    "http://www.palmbeachzoo.org/exclusive-animal-experiences",
    "http://www.palmbeachzoo.org/Kites",
    "http://www.palmbeachzoo.org/pantherexperience",
    "http://www.palmbeachzoo.org/wshteenvolunteers",
    "http://www.palmbeachzoo.org/updates",
    "http://www.palmbeachzoo.org/zoo-mission",
    "http://www.palmbeachzoo.org/adopt-an-animal",
    "http://www.palmbeachzoo.org/grouptickets",
    "http://www.palmbeachzoo.org/about-us",
    "http://www.palmbeachzoo.org/zoo-events/event/5165454",
    "http://www.palmbeachzoo.org/meet-the-chiefs",
    "http://www.palmbeachzoo.org/kidsfree",
    "http://www.palmbeachzoo.org/flamingos",
    "http://www.palmbeachzoo.org/military-discount",
    "http://www.palmbeachzoo.org/membership",
    "http://www.palmbeachzoo.org/zoo-events/event/5165466",
    "http://www.palmbeachzoo.org/zoo-history",
    "https://www.palmbeachzoo.org/zoo-news/posts/new-home-for-sloths-and-tamarins",
    "http://www.palmbeachzoo.org/leadership",
    "http://www.palmbeachzoo.org/terms-and-conditions",
    "http://www.palmbeachzoo.org/contact-us",
    "http://www.palmbeachzoo.org/zoo-events/event/5389912"
  ],
  "candidate_links": [
    "http://www.palmbeachzoo.org/Promotional-Events",
    "http://www.palmbeachzoo.org/membership-faq",
    "http://www.palmbeachzoo.org/media-contact",
    "https://www.palmbeachzoo.org/contact-us",
    "http://www.palmbeachzoo.org/support-the-zoo",
    "http://www.palmbeachzoo.org/groupsatthezoo",
    "http://www.palmbeachzoo.org/zoo-events",
    "http://www.palmbeachzoo.org/board-of-directors",
    "https://www.palmbeachzoo.org/membership",
    "http://www.palmbeachzoo.org/join-the-team",
    "http://www.palmbeachzoo.org/about-us",
    "http://www.palmbeachzoo.org/membership",
    "http://www.palmbeachzoo.org/leadership",
    "http://www.palmbeachzoo.org/contact-us"
  ],
  "visited": [
    "http://www.palmbeachzoo.org/",
    "http://www.palmbeachzoo.org/about",
    "http://www.palmbeachzoo.org/contact",
    "http://www.palmbeachzoo.org/staff",
    "http://www.palmbeachzoo.org/team",
    "http://www.palmbeachzoo.org/board",
    "http://www.palmbeachzoo.org/directory",
    "http://www.palmbeachzoo.org/events",
    "http://www.palmbeachzoo.org/sitemap.xml",
    "http://www.palmbeachzoo.org/council",
    "http://www.palmbeachzoo.org/leadership",
    "http://www.palmbeachzoo.org/management",
    "http://www.palmbeachzoo.org/producers",
    "http://www.palmbeachzoo.org/support",
    "http://www.palmbeachzoo.org/crew",
    "http://www.palmbeachzoo.org/members",
    "http://www.palmbeachzoo.org/bios",
    "http://www.palmbeachzoo.org/people",
    "http://www.palmbeachzoo.org/artists",
    "http://www.palmbeachzoo.org/musicians",
    "http://www.palmbeachzoo.org/faculty",
    "http://www.palmbeachzoo.org/administration",
    "http://www.palmbeachzoo.org/Promotional-Events",
    "http://www.palmbeachzoo.org/membership-faq",
    "http://www.palmbeachzoo.org/media-contact",
    "https://www.palmbeachzoo.org/contact-us",
    "http://www.palmbeachzoo.org/support-the-zoo",
    "http://www.palmbeachzoo.org/groupsatthezoo",
    "http://www.palmbeachzoo.org/zoo-events",
    "http://www.palmbeachzoo.org/board-of-directors",
    "https://www.palmbeachzoo.org/membership",
    "http://www.palmbeachzoo.org/join-the-team",
    "http://www.palmbeachzoo.org/about-us",
    "http://www.palmbeachzoo.org/membership",
    "http://www.palmbeachzoo.org/leadership",
    "http://www.palmbeachzoo.org/contact-us"
  ],
  "base_url": "http://www.palmbeachzoo.org/"
}