{
  "pages": [
    {
      "url": "https://palmterracefl.com/contact-us/",
      "is_candidate": false,
      "has_email": true,
      "text": "Google Tag Manager (noscript)\nEnd Google Tag Manager (noscript)\n941.529.7005\nEmail Us\nResident Portal\nJoin Our Newsletter\n9415297005\nAvailable Homes\nRV Stays\nLifestyle\nGallery\nLocation\nSpecials\nFAQ\nContact Us\n.menu\n.header\nContact Us\n.page-header__content\nEND .page-header\nSend us\na message\nΔ\nFirst\n*\nLast\n*\nEmail\n*\nPhone\nMessage\nText Message Consent\nYes, I would like to receive SMS updates with the latest information and offers*\n* Disclaimer: By checking this box, I consent to receive SMS messages from Palm Terrace, managed by Cobblestone Assets, regarding updates, offers, and information. Message and data rates may apply. You may opt-out at any time.\n.container\nVisit Us\n3223 N. Lockwood Ridge Rd.\nSarasota, Fl 34234\nCall Us\n941.529.7005\nEND .page-wrap\noffice hours\nMonday - Saturday\n9:00am – 4:00pm\nSales Office\nTuesday - Saturday\n9:00am – 5:00pm\nCONTACT\n941.529.7005\n3223 N. Lockwood Ridge Road\nSarasota, FL 34234\n.container\n© Palm Terrace\nAll rights reserved\nPrivacy Policy\nTerms of Use\nDo Not Sell or Share My Personal Information\n.container\nPalm Terrace Privacy Policy\nThis Privacy Policy describes how Palm Terrace collects,\nuses, and discloses your personal information.\nThis Privacy Policy should be read in conjunction with our Terms\nof Service, and any other policy, agreement, or terms which may\naffect your relationship with us.\nI. SCOPE OF THIS POLICY\nThis Privacy Policy applies to https://palmterracefl.com including\nall its sub-domains and other websites that link to this Privacy\nPolicy, when accessing and using them in the United States, as\nwell as any of our other services and tools that might be made\navailable by us from time to time, including offline tools, surveys,\napplications, services, advertisements, events, and promotions\n(collectively, “Services”).\nWe may provide links to external-party websites that are not\nowned by Palm Terrace has no control over external-party\nprivacy practices and assumes no responsibility in connection\nwith your use of external-party websites, applications, or any\nother services offered by other parties. Any external-party\nservices are governed by the privacy policies appearing on those\nsites and applications.\nBy using the Services, you signify your consent to this Privacy\nPolicy and the Terms of Service for the use of our Services. If\nyou do not agree to this Privacy Policy or Terms of Service for\nthe use of our Services, please do not use our Services.\nII. INFORMATION THAT WE COLLECT OR\nRECEIVE\nWe collect and receive information from and about you by\ndifferent means, including, without limitation: (i) information you\nsubmit or provide to us; (ii) information collected automatically\nand manually; and (iii) information provided to us by other\nsources. Some of the information we collect and receive includes\n“personal information,” which is generally information that\nidentifies, relates to, describes, is reasonably capable of being\nassociated with, or could reasonably be linked, directly or\nindirectly, with you. Personal information does not include\ninformation that is publicly available, de-identified, aggregated, or\notherwise exempted by applicable laws. The information we\nmay collect will vary and depend on the nature of your\nrelationship with us and the reason(s) for providing/collecting the\ninformation.\nA. Information You Submit or Provide to Us\nWe or our vendors collect the information that you directly\nprovide to us, such as when you enter it on a webpage, submit\nan online form, use a chat feature we may offer, or include it in\nan email that you send to us in relation to our Services. In\naddition, we may collect information through relevant business\nsupport processes, during the registration or account creation\nprocesses, and through other business functions where we ask\nyou to provide information, including:\nContact Information (e.g., name, email or mailing\naddress, or phone number);\nAccount Administration Information (e.g., username,\n1 / 5\npassword, or security questions);\nCommunications (e.g., information you submit through\nour interactive chat feature or through other\ncommunications with us, including potential customer\nservice call recordings);\nPayments and financial information (e.g., information\nnecessary to process transactions, conduct due\ndiligence, as part of an application, or for other business\nneeds);\nEmployment-related information and education\ninformation (e.g., information you may provide when\napplying for a job, or which may be included as part of\nan application);\nDemographic information (e.g., ethnicity, sex, gender,\nbirth date, age, languages spoken, disability, housing\nstatus, household size, household type, family members,\nmarital status, annual income, desired housing\ncharacteristics and desired housing location or\ncommunity);\nLocation information (e.g., geolocation inferred from your\naccess to our websites or from your device); and\nCommercial records, customer records, and preference\ninformation (e.g., your purchase history, leasing details,\nrental history, property records, tenant data, and related\ninformation).\nYour use of interactive features we may offer on our Services is\nvoluntary, and we may retain the information that you submit\nthrough these features. If you participate in interactive chat,\neither with a virtual or live agent, the contents of the chat may be\ncaptured by us or our service provider and kept as a transcript. If\nyou use these features, you understand that our vendors may\nprocess the information obtained through the feature to provide\nthe Service on our behalf.\nIf you submit personal information of other people to us, e.g.,\nwhen participating in a resident referral program we may offer,\nyou represent that you have permission and authority to provide\nus with such personal information. If you do not have\npermission, please do not provide us with their information.\nB. Types of Information Collected Automatically\nWe may automatically or manually collect information related to\nyour use of Services. For example, data collected in this\nmanner may include:\nWeb Browsing Data. When you use our Services, our servers\nmay automatically record information, including information that\nyour browser or mobile device sends when you visit or use our\nServices.\nTechnical Information. We may collect certain technical\ninformation about your computer systems or about your visits to\nour online environments when you use our Services.\nDevice Information. We may collect information about the device\nyou are using to access our Services, including what type of\ndevice it is, what operating system you are using, device\nsettings, unique device identifiers and crash data.\nCookie Data. Depending on how you are accessing our online\nenvironments, we may use “cookies” (a small text file sent by\nyour device each time you visit our websites, unique to your\nPalm Terrace account or your browser). When we use\ncookies, we may use “session” cookies (that last until you close\nyour browser) or “persistent” cookies (that last until you or your\nbrowser delete them). For example, we may use cookies to\n2 / 5\nremember your personal preferences, such as sections of our\nServices that you visit frequently, your user ID or other settings\nso you do not have to set them up every time you visit our\nServices. Some of the cookies we use may be associated with\nyour Palm Terrace account (including information about you,\nsuch as the email address you gave us), and other cookies are\nnot. In addition, we may use web beacons, pixels, or other web\nprogramming code or embedded scripts.\nAnalytics Data. We may use Google Analytics or other providers\nfor analytics services. We may also implement Google Analytics\nAdvertising Features such as remarketing with analytics and\ninterest-based ads. We may use first-party cookies or other first-\nparty identifiers as well as third-party cookies or other third-party\nidentifiers to, e.g., deliver advertisements, measure your\ninterests, and/or personalize content. For more information on\nhow Google Analytics uses data collected through our services,\nvisit http://www.google.com/policies/privacy/partners. To opt out\nof Google Analytics cookies, visit\nhttps://tools.google.com/dlpage/gaoptout or download the\nGoogle Analytics Opt-Out Browser Add-On.\nSensory Data. In order to provide you with the best possible\nsupport, prevent fraud, and improve our Services. We may also\nuse surveillance cameras on our property in order to provide\nsecurity.\nC. Information Provided to Us by Other Sources\nTo improve the quality of our Services, and to carry out research\nand analysis, we and our vendors may supplement the\ninformation we collect with information from other sources, such\nas publicly available information, commercially available sources,\nand information from our business partners or other third parties.\nIII. USE OF INFORMATION\nWe may use the information we collect through the Services or\notherwise obtain for a number of purposes including to:\n• Provide our Services;\n• Understand and improve our operations, Services, and\nperformance;\n• Assist in customer service and transactions;\n• Generate feedback regarding the Services which we offer;\n• Conduct research or for analytics purposes;\n• Develop new Services;\n• Deliver marketing communications or promotional materials\nthat may be of interest to you;\n• Improve the services we provide and the usefulness of the\nServices;\n• Customize our users’ experience when using the Services;\n• Protect ourselves and our users; and/or\n• Comply with applicable laws.\nIV. WHY WE MAY DISCLOSE INFORMATION\nWe may disclose your personal information with other parties as\nfollows:\nProvision of Services. We may disclose your personal\ninformation with our business partners, vendors, and service\nproviders in order to provide our Services, including as\nnecessary for financial transactions, to conduct due diligence, to\n3 / 5\ndetect and prevent fraud, to comply with applicable laws and/or\ncontractual obligations, to ensure quality of our Services, and as\notherwise necessary to support our Services.\nLaw Enforcement, Judicial, Administrative, or Regulatory\nDisclosures. When we believe in good faith that the law requires\ndisclosure or that disclosure is necessary to protect or enforce\nthe rights, property, safety, or security of ourselves or others.\nBusiness Transfers. In connection with sale of the applicable\nbusiness, a portion of the business, or certain stock and/or\nassets, or a corporate merger, consolidation, restructuring, or\nother corporate change including, without limitation, during the\ncourse of any due diligence process.\nMarketing and Advertisements. We may disclose your personal\ninformation to our vendors or third parties to facilitate marketing\nand provide you with advertisements which may interest you.\nSweepstakes, Contests, and Promotions. We may offer\nsweepstakes, contests, and other promotions (each, a\n“Promotion”), including Promotions jointly sponsored or offered\nby third parties which may require submitting personal\ninformation. If you voluntarily choose to enter a Promotion, your\ninformation may be disclosed to us, our co-sponsors, service\nproviders, and other third parties, including for administrative\npurposes and as required by law (e.g., on a winner’s list). By\nentering, you are agreeing to the official rules that govern that\nPromotion, which may include consent to additional or differing\ndata practices from those contained in this Privacy Policy.\nPlease review those rules carefully.\nV. CHOICES YOU HAVE ABOUT YOUR INFORMATION\nYou may always limit the amount and type of information that we\ncollect from you by choosing not to enter or provide information\nrequested from you on our Services. However, some of our\nfeatures and Services can only be provided to you if you provide\nus with requested information (including, in some instances,\npersonal information). Some of the Services offered may ask\nwhether you wish to opt out or opt into our contact lists for offers,\npromotions and additional Services that may be of interest to\nyou.\nVI. DO NOT TRACK SIGNALS\nSome web browsers may transmit “Do-Not-Track” signals to\nwebsites with which the browser communicates. As with many\nother companies, we do not currently respond to these signals.\nVII. HOW WE SECURE YOUR INFORMATION\nPalm Terrace is committed to protecting the confidentiality\nand security of your information against unauthorized access\nand disclosure. We only disclose your personal information to\nour personnel or others who need to know the information to\nservice your account or to provide our Services, and as\notherwise permitted or required by law. We maintain strict\nphysical, electronic, and procedural safeguards to protect your\ninformation.\nVIII. OUR POLICY ON THE INFORMATION OF CHILDREN\nPalm Terrace does not seek or knowingly collect personal\ninformation from children under the age of thirteen (13), and we\nrequest that children do not provide information through the\n4 / 5\nServices. If you are a parent or guardian and become aware that\nyour child has provided us with information, please contact us\nusing one of the methods specified below, and we will work with\nyou to address the issue.\nIX. INTERNATIONAL TRANSFERS\nWe are a United States company and we provide our Services\nsubject to United States law. However, we may transfer\ninformation to our affiliates, vendors, and business partners in\nother countries around the world, subject to applicable laws, and\nas a result personal information may be transferred to,\nprocessed, and stored in the other countries. As such, courts,\nlaw enforcement, and authorities in other countries may, in\ncertain circumstances, be entitled to access your personal\ninformation. By using the Services or providing us with any\ninformation through the Services, you consent to this potential\ntransfer, processing and storage of your information, and you\nacknowledge that other countries and jurisdictions may not\nprovide the same privacy protections and their privacy laws may\nnot be as comprehensive as those in the United States or in the\ncountry where you reside or are a citizen.\nX. CHANGES TO THE PRIVACY POLICY\nWe reserve the right to amend this Privacy Policy at any time to\nreflect technological advancements, legal and regulatory\nchanges and good business practices or otherwise at our\ndiscretion subject to applicable laws. If we make any changes, a\nnew Privacy Policy will reflect those changes and the effective\ndate of the revised Privacy Policy will be set forth at the top of\nthe Privacy Policy.\nYour continued use of the Services after we make changes to\nthis Privacy Policy is deemed to be acceptance of those\nchanges, so please check this Privacy Policy periodically for\nupdates.\nXI. HOW TO CONTACT US\nIf you have any questions or comments about this Privacy Policy\nor the ways in which we use information subject to this\nstatement, please do not hesitate to contact us by emailing\npmt@cobblestoneassets.com, writing to 3223 N Lockwood\nRidge Road, Sarasota, FL 34234, or calling us at 941.529.7005.\nPalm Terrace Online Terms of Use\nThese Terms of Use or “Terms” apply to your use of or access to our online interfaces and digital properties, including our websites that link to these Terms (collectively, the “Sites”). “Palm Terrace,” “we,” “us,” or “our” mean Palm Terrace and/or one of our brands, affiliates, or subsidiaries. By using or accessing the Sites, you acknowledge that you have read, understood, and agreed to be bound by these Terms and our Privacy Policy, which contains important information about how we process personal information we may obtain through the Sites and is incorporated into these Terms by reference. If you do not wish to be bound by these Terms, please discontinue using and accessing the Sites.\nPLEASE READ THESE TERMS CAREFULLY BEFORE ACCESSING OR USING THE SITES.\nTHESE TERMS INCLUDE AN ARBITRATION CLAUSE AND A WAIVER OF YOUR RIGHT TO PARTICIPATE IN A CLASS ACTION OR REPRESENTATIVE LAWSUIT. THESE TERMS TAKE EFFECT WHEN YOU ACCESS OR USE THE SITES. BY ACCESSING OR USING THE SITES, YOU ATTEST THAT YOU ARE AT LEAST THE AGE OF MAJORITY IN YOUR STATE OF RESIDENCE AND ARE LEGALLY CAPABLE OF ENTERING INTO A BINDING CONTRACT.\nWe reserve the right to change these Terms at any time, in our sole discretion and without prior notice. We will indicate changes to these Terms by updating the “Effective Date” above. Your use of the Sites following a change to these Terms signals your acceptance of the modification(s).\nSome areas or functionalities of the Sites may have additional terms and conditions that apply to your access or use of those areas or functionalities of the Sites (“Additional Terms”). If there is a conflict or inconsistency between these Terms and any Additional Terms, the Additional Terms shall govern your access and use of the respective area or functionality of the Sites.\n1. LIMITED LICENSE\nSubject to your compliance with these Terms, you are granted a limited, non-exclusive, revocable, non-sublicensable, non-transferable license to access the Sites in accordance with the requirements and restrictions set forth below. If you do not agree to these Terms, or any amended Terms, you may not access or use the Sites for any purpose and shall promptly discontinue such use of the Sites.\n2. INTELLECTUAL PROPERTY RIGHTS\nThe Sites and all of their content and information (collectively, “Content”), including all copyrights, trademarks, service marks, trade names, and all other intellectual property rights (“Intellectual Property”) are owned and controlled by us, our subsidiaries, or our licensors, and are protected by copyright or other applicable intellectual property laws. You may print one copy of the Content for your personal non-commercial use only. You may not, however, copy, use, reproduce, or distribute the Content or otherwise use our Intellectual Property in any way, absent specific, prior written permission from us.\n3. CONTENT DISCLAIMER\nThe Content was believed to be accurate at the time it was published. Although we may periodically update the Content, it is subject to change without notice, and we make no guarantee as to the timeliness or accuracy of any Content presented on this Sites at the time accessed. We are not responsible, and hereby disclaim liability, for any errors, omissions, or availability of the Content. The Sites and Content are provided on an “as is,” and “as available” basis without representation or warranty of any kind whatsoever. We reserve the right to add, remove, and change information at any time without notice in our sole discretion.\n4. USE OF THE SITES\nThe Sites are intended for personal use only. You agree not to use the Sites for any commercial purposes. You further agree that you will not:\nAccess or use the Sites (or any portion thereof) in violation of these Terms or applicable laws;\nAttempt to modify, alter, recreate, or otherwise use the Sites for any purpose other than as specifically permitted in these Terms;\nAttempt to probe, scan, or assess the vulnerability of the Sites;\nBreach any security, technological, or authentication measures on the Sites;\nUse any device, software, or routine to attempt to interfere with the Sites or otherwise disrupt the Sites or servers or networks connected to the Sites;\nUse any robot, spider, scraper, data mining tools, data gathering and extraction tools, or other automatic device or manual process to access, copy, or scrape the Sites for any purpose;\nCollect or store personal information about other users of the Sites without their consent;\nUse any part or feature of the Sites for any purpose that is unlawful, tortious, libelous, defamatory, obscene, threatening, or intrusive on another person’s privacy;\nUse the Sites to harm or harass any person or entity;\nTake any action that imposes, in the Company’s sole discretion, an unreasonable or disproportionately large load on the Company’s infrastructure; or\nUse the Sites for any reason for which the Sites are not intended.\nThe Company reserves the right, in its sole discretion and without limiting its other remedies, to restrict, suspend, or terminate your access to, or use of, the Sites at any time with or without cause, including if the Company believes that you may be in breach of these Terms or applicable laws or are misusing the Sites.\n5. REGISTRATION\nSome Sites may permit or require you to register for an online account with a user ID and/or password (“Login Credentials”). Otherwise, no account is needed to access the Sites. Your Login Credentials and any information that you provide in connection with your account must remain accurate and complete at all times. You are responsible for maintaining the confidentiality and security of your Login Credentials, and you are fully responsible for any and all access and use of your account. Please notify us immediately of any unauthorized use of your account, or any other known or suspected breach of security, including without limitation any loss, theft, or unauthorized use of your Login Credentials. If we have reasonable grounds to suspect that the security of your Login Credentials has been compromised, we may suspend or terminate your account, refuse any and all current or future use of the services, and pursue any appropriate legal remedies.\n6. LINKS TO EXTERNAL WEBSITES\nThe Sites may include links to external websites or resources, for your convenience. Such third-party websites contain information created, published, maintained, or otherwise posted by organizations and entities independent of us. We are not responsible for the content of those websites, nor do we approve, endorse, or certify information available at these websites or any linked addresses contained therein. We make no warranties and hereby disclaim all liability as to the accuracy of the content and to any representations made concerning the quality of products or services provided on those websites or pages. We are also not responsible for the privacy policies or practices of those websites or of those companies.\n7. SUBMISSIONS TO THE SITES\nBy providing information or materials to the Sites (other than personal information, which is subject to our Privacy Policy), you grant to us an unrestricted, irrevocable, worldwide, royalty-free license to use, reproduce, display, publicly perform, and transmit such information and materials for any purpose, including without limitation, disclosing any such information and materials as necessary to satisfy any law, regulation, or governmental request. You are prohibited from submitting or transmitting any material or communication through the Sites that we deem discriminatory, racist, offensive, pornographic, defamatory, harassing, threatening, inappropriate, violates any law, or infringes on any third party’s intellectual property rights. We reserve the right to take any available steps to prevent or prohibit any such transmission that violates this provision, which shall be determined at our sole discretion, and to take any appropriate legal action.\n8. CHANGES TO THE SITES; TERMINATION OF ACCESS\nWe reserve the right to, at any time, modify, suspend, discontinue, or reduce the functionality of the Sites (or any portion thereof), temporarily or permanently, with or without notice. In addition, we may suspend or terminate your access to the Sites at any time for any reason, at our sole discretion and without prior notice. To the fullest extent permitted by applicable law, you agree that we shall not be liable to you or to any third party for any modification, suspension, or discontinuance of the Sites (or any portion thereof) for any reason at any time.\n9. DISCLAIMER OF WARRANTIES AND LIABILITY\nYour use of this website and Content is at your own risk. Content may become inaccurate as a result of developments after its publication on these Sites. We assume no responsibility to keep Content current or to correct inaccuracies or errors in Content. The Content on these Sites and the operation of them are provided “as is,” and we disclaim all representations or warranties of any kind, either express or implied, including warranties of merchantability, fitness for particular purpose, title, non-infringement, accuracy, completeness, and timeliness. Certain jurisdictions may not permit certain disclaimers of warranties. In such case, we disclaim warranties to the fullest extent permitted by the applicable law.\nWE SPECIFICALLY DISCLAIM ANY LIABILITY,\nwhether based in contract, tort, negligence, strict liability, or otherwise, for damages of any kind including, but not limited to, any direct, indirect, incidental, consequential, special, punitive, and/or exemplary damages caused by, arising out of, and/or in any way connected with functionality or operation of, access to, use of, or reliance on the Sites or the Content (even if we or our representatives have been advised of the possibility of such damages) or that are caused by and/or arise in connection with mistakes or omissions in, or delays in transmission of, information to or from the Sites, interruptions in telecommunications connections to the Sites, or viruses that may infect your computer equipment or other property, whether caused in whole or in part by negligence, acts of God, telecommunications failure, theft, or destruction of, or unauthorized access to the Sites or the Content. This limitation of liability may be different in connection with specific products and services offered by us. Some states do not allow the limitation of liability, so the foregoing limitation may not apply to you.\n10. INDEMNIFICATION\nYou agree to defend and indemnify us, our affiliates, employees, and officers of each, from and against any and all third-party claims, debts, losses, liabilities, demands, obligations, actions, and causes of action, alleged claims or litigation, damages, judgments, judgments for damages, fines, penalties, expenses, and costs (including, but not limited to, reasonable attorneys’ fees) caused by, arising out of, or resulting from your use of the Sites or the Content in a manner not expressly authorized by these Terms or that violates these Terms, any law, or the rights of a third party.\n11. DISPUTE RESOLUTION: MANDATORY BINDING INDIVIDUAL ARBITRATION AND CLASS AND COLLECTIVE ACTION WAIVER\nThe exclusive means of resolving any claim related to your use of the Sites or these Terms shall be BINDING ARBITRATION. Except as provided below in the case of a Mass Filing, the arbitration will be administered by JAMS under the JAMS Streamlined Arbitration Rules & Procedures. If you are a consumer, as defined by JAMS in its Consumer Minimum Standards, you may request that the arbitration hearing be conducted in the area in which you reside. Otherwise, the hearing (if any) shall take place in Sarasota County, Florida, United States of America.\nYou agree to first give us an opportunity to resolve any claims by contacting us in writing (the “Claims Notice”). After receipt of a Claims Notice, we may request an individualized video or telephone conference which both parties will personally attend (with counsel, if represented). If we are not able to resolve your claims within sixty (60) days of receiving the Claims Notice, you may seek relief through arbitration, as set forth in this section. You agree that you will not take any legal action, including any demand for arbitration, until after the expiration of this 60-day dispute resolution period.\nEACH PARTY WAIVES ITS RIGHTS TO GO TO COURT, TO A TRIAL BY JURY, AND TO PARTICIPATE IN A CLASS ACTION, CLASS ARBITRATION, OR OTHER REPRESENTATIVE PROCEEDING WITH RESPECT TO ANY COVERED CLAIM.\nIf, at any time, twenty-five (25) or more claimants (including you) submit demands or seek to file demands for arbitration raising similar claims against us, and such circumstances meet the definition and criteria of Mass Filings (“Mass Filing”) set forth in National Arbitration & Mediation's (“NAM”) Mass Filing Supplemental Dispute Resolution Rules and Procedures (“NAM's Mass Filing Rules,” available at https://www.namadr.com/resources/rules-fees-forms/), you and we agree that JAMS shall not serve as the arbitration administrator and that instead NAM shall administer any such Mass Filing and the NAM Mass Filing Rules in effect at the time such claim is filed shall apply. You agree that throughout this process, the parties' counsel shall meet and confer to discuss modifications to these procedures, including the possibility of procedural consolidation of similar claims for arbitration, based on the particular needs of the Mass Filing. You acknowledge and agree that by electing to participate in a Mass Filing, the adjudication of your dispute might be delayed.\nYou and we agree that each party values the integrity and efficiency of arbitration and wishes to employ the process for the fair resolution of genuine and sincere disputes between the parties. You and we acknowledge and agree to act in good faith to ensure the processes set forth herein are followed.\n12. GOVERNING LAW AND JURISDICTION\nThese Terms shall be governed by, and construed in accordance with, the laws of the United States and the State of Florida, without giving effect to conflict of law principles thereof. Subject to Section 11, you hereby consent and submit to personal jurisdiction in the state and federal courts located in Sarasota County, Florida.\n13. COMPLIANCE WITH LAW\nWe provide our Sites in accordance with United States law. By using our Sites or providing us with any information through the Sites, you acknowledge that our Sites are subject to United States law and that other countries and jurisdictions may not provide the same rights or protections as those in the United States or in the country where you reside or are a citizen. Persons who access these Sites do so on their own initiative and are responsible for compliance with applicable local laws and regulations. By downloading software or other material from the Sites, you represent and warrant that you are able to do so in full compliance with the laws of the United States and your resident country, including any applicable export controls.\n14. GENERAL INFORMATION\nExcept for any Additional Terms that apply, this is the entire understanding between you and us regarding the use of the Sites and supersedes all prior and contemporaneous agreements and understandings between you and us regarding this subject matter. If any provision of these Terms is held to be invalid or unenforceable, it will not affect the validity or enforceability of any other provision hereof. The failure of the Company to exercise or enforce any right or provision of these Terms shall not constitute a waiver of such right or provision.\n15. CONTACT INFORMATION\nIf you have questions regarding these Terms of Use, you can contact us by email at\npmt@cobblestoneassets.com\n, by phone at 941.529.7005, or by postal mail at 3223 N Lockwood Rd., Sarasota, FL 34234.\n/*THESE GRAVITY FORM STYLES ARE NEEDED FOR RV STAYS FORM ONLY.\n\tALSO TURNED NO CONFLICT MODE OFF AND BG UPDATES OFF IN PLUGIN.*/\n/.main-wrap",
      "emails": [
        "pmt@cobblestoneassets.com"
      ]
    }
  ],
  "all_links": [
    "https://palmterracefl.com/home/3223-n-lockwood-ridge-rd-21/",
    "https://palmterracefl.com/location/",
    "https://palmterracefl.com/home/3223-n-lockwood-ridge-rd-8/",
    "https://palmterracefl.com/contact-us/",
    "https://palmterracefl.com/home/3223-n-lockwood-ridge-rd-66/",
    "https://palmterracefl.com",
    "https://palmterracefl.com/available-homes/",
    "https://palmterracefl.com/resident-portal/",
    "https://palmterracefl.com/faq/",
    "https://palmterracefl.com/specials/",
    "https://palmterracefl.com/gallery/",
    "https://palmterracefl.com/contact-us/?scroll=newsletter",
    "https://palmterracefl.com/lifestyle/",
    "https://palmterracefl.com/",
    "https://palmterracefl.com/rv-stays/"
  ],
  "candidate_links": [
    "https://palmterracefl.com/contact-us/"
  ],
  "visited": [
    "https://palmterracefl.com/?utm_source=GBP&utm_medium=GBP",
    "https://palmterracefl.com/about",
    "https://palmterracefl.com/contact",
    "https://palmterracefl.com/staff",
    "https://palmterracefl.com/team",
    "https://palmterracefl.com/board",
    "https://palmterracefl.com/directory",
    "https://palmterracefl.com/events",
    "https://palmterracefl.com/sitemap.xml",
    "https://palmterracefl.com/council",
    "https://palmterracefl.com/leadership",
    "https://palmterracefl.com/management",
    "https://palmterracefl.com/producers",
    "https://palmterracefl.com/support",
    "https://palmterracefl.com/crew",
    "https://palmterracefl.com/members",
    "https://palmterracefl.com/bios",
    "https://palmterracefl.com/people",
    "https://palmterracefl.com/artists",
    "https://palmterracefl.com/musicians",
    "https://palmterracefl.com/faculty",
    "https://palmterracefl.com/administration",
    "https://palmterracefl.com/contact-us/"
  ],
  "base_url": "https://palmterracefl.com/?utm_source=GBP&utm_medium=GBP"
}