{
  "pages": [
    {
      "url": "https://passionrestaurantgroup.com/about-us/",
      "is_candidate": false,
      "has_email": false,
      "text": "About\nus\nyou\nOnce Upon a Time there was a place, a Factory of Details & Experiences that decided to sell food… and so it was born.\nTHIS IS ABOUT YOU\nA place where every detail is designed to create unforgettable experiences. You won’t find pictures of our founders here, because it’s not about who had the guts to start the business, who runs the operations or who is the marketing genius. It’s not about who does the accounting or who decides what’s on the menu. It’s not about the chefs, the cooks, the waiters, the managers, the cocktail makers, the decor artist, or even the playlist guy.\nIt’s all about you.\nAt this place, passion and attention to detail are more than just words – they are a way of life. We focus on creating experiences that are special, unique and personal, because we know that you are the reason we exist. Without you, we would be just another restaurant. You are the one who inspires us to improve, who motivates us to go above and beyond, who keeps us in business.\nThat’s why this space revolves around you: the person who comes to have a drink after work, who enjoys the best brunch with friends, the one who shares business lunches, who dines with friends, who celebrates with us your babyshower, your bachelor party, your product launch, your team building and who creates unforgettable memories with everyone who accompanies you. We are waiting for you, always with open arms and a promise to do everything possible to make your experience exceptional.\nIf we ever fall short of your expectations, please give us another chance. Your feedback helps us grow and improve. We appreciate you sharing your feedback with us, and we take it very seriously.\nSo, if you’re wondering about the team behind the scenes, know that there’s a great group of dedicated professionals-founders, managers, chefs, servers and many others-who work tirelessly to ensure that every visit is memorable. But we all understand one thing: YOU ARE THE STAR OF THIS SHOW.\nYour browser does not support the video tag.\nOur clients\nreviews\nFirst time at the restaurant, and I loved the place. As soon as I arrived, I was greeted with a big smile from the server Andrés, whose treatment was special. We told him we were celebrating our anniversary, and he surprised us with champagne. The food was high quality, the service was quick, and the atmosphere was calm.\n<i class=\"fa-regular fa-sharp fa-star\"></i>\nDayana Valdés Radillo\nThe place is very cozy, both the indoor dining area and the terrace. It has a spectacular view that you can enjoy for hours. I loved the food and the service from Alejandra, who was our server. Everything she recommended was exquisite.\n<i class=\"fa-regular fa-sharp fa-star\"></i>\nYaimara Posada\nClient\nFui a celebrar mi aniversario,fue una experiencia increible.La atenciòn merece realmente 5 estrellas.La comida espectácular.Solo puedo dar gracias por la tarde tan especial que pasé en este lugar.\n<i class=\"fa-regular fa-sharp fa-star\"></i>\nLiudyanis Rodriguez Guethon\nBeautiful restaurant... lovely view of the canal, and a very warm ambiance. The menu is good, offering various types of dishes, including pasta, fish, and meat. What I had for dinner was excellent... very tasty and flavorful, though the presentation could be improved. The wine list is also good. The waiter's service was great.\n... and without a doubt, I would return and recommend it to my friends.\n<i class=\"fa-regular fa-sharp fa-star\"></i>\nMarcelo Bocetti\nI went to celebrate my anniversary with my wife. We were visiting Miami, and while searching online, we found this place, made a reservation, and it was spectacular. When we arrived, we were warmly we[...]\n<i class=\"fa-regular fa-sharp fa-star\"></i>\nYonathan Osorio\nWe tried the paella, had tostones for starters, and sampled their desserts. Everything was delicious, with international traditional dishes featuring an extra something that made it all even tastier. The place is centrally located, beautiful, and well-decorated, with a great atmosphere. It's also very close to Brickell City Center. Excellent overall. The server, Tony, was fantastic!\n<i class=\"fa-regular fa-sharp fa-star\"></i>\nAna Gabriela M\n<i class=\"fa-regular fa-sharp fa-star\"></i>\nKim Herrera\nWow, I loved this place! The service is 5 stars—our server Junior was fantastic. He recommended great drinks and dishes, and he was super friendly. The drinks are a must-try, and this place has a gr[...]\n<i class=\"fa-regular fa-sharp fa-star\"></i>\nCarelis Enriquez\nSecond time visiting, and the croquettes are incredible—the paella is great too. It's a lovely atmosphere, and you can make reservations until 11:30 pm. It's not the best place to bring kids, but it[...]\n<i class=\"fa-regular fa-sharp fa-star\"></i>\nCarlos Caruso\nA very beautiful place that's always busy. The staff is friendly and always ready to help. Here, you'll find everything you could possibly need. The food is spectacular, with great flavor, and the environment is truly well-equipped and cozy, right in the heart of the big city. Plus, they have great prices. Thanks, Gracias.\n<i class=\"fa-regular fa-sharp fa-star\"></i>\nMiguel Arbeloa\nSecure your spot for an unforgettable dining experience with PassionGroup Miami! Indulge in exquisite flavors, unparalleled ambiance, and create lasting memories.",
      "emails": []
    },
    {
      "url": "https://passionrestaurantgroup.com/contact/",
      "is_candidate": false,
      "has_email": true,
      "text": "Contact us\nWe love to hear your feedback so we can continually improve and provide you with the best experience possible. Our team will contact you personally as soon as possible.\nContact\nSend us\na message\nIf you need assistance in organizing the private event of your dreams, don’t hesitate to contact us. Give us a call at 305-8423615 or you can write to us at events@prgbrickell.com\nIf your inquiry is not related to events, we’ll be happy to assist you. Just fill out the form, and we’ll get back to you as soon as possible.\nIf you prefer writing directly, feel free to email us at: info@passionrestaurantgroup.com.\nOur Restaurants\nDolores but you can call me Lolita\n1000 South Miami Ave. Miami, FL 33130\n(305) 403 - 3103\nCrazy about you\n1155 Brickell Bay Dr. #101. Miami, Fl 33131.\n(305) 377 - 4442\nSchedule\nMon - Wed\n11:30 am - 11:00 pm\nThursday\n11:30 am - 11:30 pm\nFriday\n11:30 am - 12:00 am\nSaturday\n10:00 am - 12:00 am\nSunday\n10:00 am - 11:00 pm\nName *\nLast name *\nEmail *\nPhone *\nSelect restaurant *\nSelect restaurant\nCrazy about you\nDolores Lolita\nTell us what you need *\nI have read and accept the terms and conditions of use.",
      "emails": [
        "events@prgbrickell.com",
        "info@passionrestaurantgroup.com"
      ]
    },
    {
      "url": "https://passionrestaurantgroup.com/restaurants/crazy-about-you/",
      "is_candidate": false,
      "has_email": false,
      "text": "Your browser does not support the video tag.\nWith its truly unique lounge setting and picturesque water front dining it is one of Brickell’s most upscale preferred destinations.\nBook Now\nAt the mark on Brickell\nImagine stepping into a place…\nWhere every detail is designed to transport you to a magic World. As you enter Crazy About You, you’re greeted by a warm breeze, and it becomes clear that this isn’t just dinner—it’s a waterfront dining experience that beckons you to relax and unwind. The sky shifts from soft orange to deep purple as the sun sets, painting a breathtaking backdrop to your evening as you enjoy your meal or your Lovers Lane Lemonade.\nAs you sip, you notice the other guests around you, laughing and enjoying themselves, each one caught up in their own moment of joy.\nThe air is filled with the sound…\nOf clinking glasses and lively conversation. It’s as if you’ve entered a hidden oasis in the heart of the city. Then, there’s the food—vibrant, creative, and bursting with flavor. Each dish is an invitation to explore, to share, and to savor. You start with a selection of tapas, each one more enticing than the last, and move on to a main course that leaves you wondering how it could get any better. But it does, with a dessert that feels like a sweet dream. By the time the evening ends, you’re already planning your next visit, knowing that no two experiences here are ever the same.\nSO BOOK NOW!\nExplore our menu\nLunch\nDinner\nWeekend Brunch\nDrinks & Cocktails\nHAPPY HOUR\nCrazy Wednesday\nWINES\nNew Item\nVegetarian\nRaw\nFresh Baked Cornbread\n$8.99\nWisconsin cheddar, chives & Irish whipped butter\nAppetizers\nBurrata Caprese Toast\n$13\nSourdough, plum tomato, balsamic & EV olive oil\nChihuahua Cheese Casserole\n$10\nWith pesto and a touch of chorizo\nHuevos Estrellados\n$10\n2 Eggs over easy, potatoes, mushrooms and white truffle oil\nSmoked Mahi Mahi Dip\n$11\nWith fried plantain chips\nSerrano Ham Croquettes. Just like at \"Dolores but you can call me Lolita\"\n$12\nAsian Vegetables Spring Rolls\n$10\nWith sweet chili sauce\nHomemade Lentil Soup\n$11\nWith chorizo Cantimpalo\nCalamari al Pepperoncini Flatbread\n$10\nTuna Tatar\n$13\nAvocado, cucumber and spicy Ponzu\nDaily Lunch Specials * Monday to Friday $17.99\nChoose a free appetizer with any item from our Lunch Specials, Salads, Sandwiches, or Entrees. Choose one between:\n3 Serrano Ham Croquettes\nSide Salad\nLentil Soup (lentejas)\nChicken Parmigiana\nItalian classic, topped with mozzarella cheese, tomato sauce and served with penne pomodoro.\nShrimp Fajitas\nGuacamole, pico, sour cream and flour tortillas.\nBBQ Baby Back Ribs\n1/2 Rack of baby back ribs with french fries and a pair of gloves\nSalads with Something on Top $19.99\nChoose a free appetizer with any item from our Lunch Specials, Salads, Sandwiches, or Entrees. Choose one between:\n3 Serrano Ham Croquettes\nSide Salad\nLentil Soup\nGarden Kale Salad with Chicken\n$18,99\nChopped kale with cranberries, candied pecans, carrots & apples, topped with grilled chicken and poppy seed dressing\nGrilled Shrimps Caesar Salad\n$18,99\nGrilled gulf shrimps with chopped romaine, house-made croutons and our classic Caesar dressing\nGrilled Salmon Salad\n$18,99\nMango and strawberries tossed in a mango vinaigrette\nSandwiches: All served with French Fries\nChoose a free appetizer with any item from our Lunch Specials, Salads, Sandwiches, or Entrees. Choose one between:\n3 Serrano Ham Croquettes\nSide Salad\nLentil Soup\nChicken Avocado Club\n$18.99\nGrilled chicken breast, applewood bacon, avocado, Swiss cheese and mustard on a Zak the Baker brioche bun\nBlackened Tuna Sandwich\n$18.99\nSeared ahi tuna, avocado, fresh pico and spicy mayo on a Zak he Baker brioche bun\nSkirt Steak Fajitas\n$18.99\nGuacamole, pico, sour cream and tortillas\nMexican Ox Tail Tacos\n$17.99\n3 tacos, chipotle mayo, red onion, avocado, cilantro and mango.\n“I’m Crazy About You” Margherita Pizza\n$17.99\nFresh mozzarella cheese and cherry tomato.\n*\nGluten Free Cauliflower Crust – $2.99\nEntrees $25.99\nChoose a free appetizer with any item from our Lunch Specials, Salads, Sandwiches, or Entrees. Choose one between:\n3 Serrano Ham Croquettes\nSide Salad\nLentil Soup\nGrilled Ponzu Salmon\nSoy and brown sugar miso glazed salmon\nSlim and Fit Chicken Paillarde\nThinly pounded chicken breast served with snow peas and cauliflower\nHawaiian Tuna Poke Bowl\nRaw ahi tuna, avocado, mango, watercress, radish, Jasmine rice and spicy mayo\nI Can´t Believe its not Pasta Carbonara with Chicken\nZucchini pasta carbonara with grilled chicken\nBranzino with Cilantro Aioli\n$29.99\nRoasted branzino filet topped with cilantro aioli. Served with potatoes au-gratin.\n*Fresh Daily – Limited Availability\nPremium Wagyu Beef\nWagyu Skirt Steak Wedge Salad\n$24.99\nAmerican Wagyu skirt steak, roquefort blue cheese and applewood smoke bacon\nWagyu Double Bacon Smash Cheeseburger\n$18.99\nDouble American Wagyu beef patties, cheddar cheese, applewood bacon, bbq sauce & 1000 island dressing\nWagyu Sirloin Steak\n$34.99\n10 oz. black peppercorn sauce and fried yuca\nWagyu Skirt Steak\n$36.99\n9 oz. chimichurri & shoestring fries\nDesserts\nOh Wow! Spanish Cheesecake\n$11.99\nHecha with Love\nBest Chocolate Cake in The World\n$11.99\nThe best chocolate cake in the entire world\nFRESH BAKED CORNBREAD\n$8.99\nWisconsin cheddar, chives & Irish wipped butter\nAppetizers: Any 2 for  $24.99\nMushroom Frito Mixto\nMedley of 4 types of mushrooms. Panko breaded and served with garlic aioli.\nSpinach and Organic Quinoa Salad\nBeets, spinach, quinoa, avocado, strawberries & toasted sesame dressing.\nAdd chicken or shrimp $6\nKale Caesar Salad\nRomaine and kale mix. Shaken, not stirred‚ Caesar Cardini dressing.\nAdd chicken or shrimp $6\nSerrano Ham Croquettes\nJust like at Dolores but you can call me Lolita.\nCalamari al Pepperoncini Flatbread\nMediterranean Antipasto\nItalian mortadella, chorizo cantimpalo, Manchego cheese.\nVery Angry Potatoes\nSpicy brava sauce.\nChihuahua Cheese Casserole\nWith pesto and a touch of chorizo.\nHuevos Estrellados\n3 eggs over easy, potatoes, mushrooms and white truffle oil.\nSmoked Mahi Mahi Fish Dip\nServed with home cut plantain chips.\nTostones & Bruschetta\nRoma tomato, strawberries, basil, balsamic, parmesan and EV olive oil.\nAsian Vegetable Spring Rolls\nWith sweet chili sauce\nHomemade Lentil Soup\nWith Chorizo Cantimpalo\nSignature Apps\nTuna Tartar\n$3.99 sucharge\nAvocado, cucumber, spicy Ponzu.\nBurrata Caprese Toast with Avocado\n$3.99 sucharge\nPlum tomato, balsamic & EV olive oil.\nPremium Wagyu Beef\nINCLUDES A FREE APPETIZER OF YOUR CHOICE\nWagyu Double Bacon Smash Cheeseburger\n$30.99\nTwin Wagyu (Kobe) beef patties, cheddar cheese, applewood bacon & BBQ sauce.\nCooked to medium well. Add lettuce and tomato .99 cents\nWagyu Sirloin Steak\n$41.99\nBlack peppercorn sauce and fried yuca.\nWagyu Churrasco\n$47.99\nMelt in your mouth Wagyu (Kobe) skirt steak. Chimichurri and shoestring fries.\nEntree  $30.99\nINCLUDES A FREE APPETIZER OF YOUR CHOICE\nSkinny Lolita\nGrilled chicken paillard with sauteed vegetables.\nBlack Truffle Linguine\nHomemade linguini, cream, parmesan cheese and tartufata.\n“I’m Crazy About You” Margherita Pizza\nWith fresh mozzarella cheese and cherry tomato.\nMexican Ox Tail Tacos\n3 tacos, chipotle mayo, red onion, avocado, cilantro and mango.\nEntree $36.99\nINCLUDES A FREE APPETIZER OF YOUR CHOICE\nHawaiian Tuna Poke Bowl\nRaw ahi tuna, avocado, mango, watercress, radish, jasmine rice and sesame seeds.\nFree Range Chicken Schnitzel\nOven roasted chicken milanese, panko breaded. Arugula and cherry tomato.\n*Alla parmigiana – $1.99\n*Nightly till its gone!\nI Can’t Believe it’s not Pasta Carbonara with Chicken\nWow!!! it’s zucchini carbonara with bacon.\nKobe Beef Mini Burgers\nCaramelized onions, arugula, tomato, applewood bacon. Truffle parmesan fries.\nPorcini Mushroom Tortellini with Shrimp\nPorcini, ricotta and grana padano cheese tortellini in a cream sauce with spinach and shrimp.\nBaby Back Ribs “They Fall off the Bone”\nShoestring fries and a pair of gloves\nBranzino with Cilantro Aioli\nRoasted Branzino filet topped with cilantro aioli. Served with potatoes au-gratin.\n*Fresh Daily – Limited Availability\n* Limited Availability\nEntree $41.99\nINCLUDES A FREE APPETIZER OF YOUR CHOICE\nMiso Glazed Salmon\nSoy and brown sugar miso glazed Scottish salmon.\nSlow Braised Boneless Short Rib\nServed with smashed potatoes\n\"It Takes Two For Tango\"\nIncludes 2 Appetizers of your Choice\n$33.99 P/P\n9 0z. Argentinian churrasco and 6 garlic shrimp to share.\nDesserts\nOh Wow! Spanish Cheesecake\n$11.99\nThe Best Chocolate Cake in The World\n$11.99\nFRESH BAKED CORNBREAD\n$8.99\nWisconsin cheddar, chives & Irish whipped butter\nBeginnings Any 2 appetizers for $24.99\nMushroom Frito Mixto\nMedley of 4 types of mushrooms. Panko breaded and served with garlic aioli.\nSpinach and Organic Quinoa Salad\nBeets, spinach, quinoa, avocado, strawberries & toasted sesame dressing.\nAdd chicken or shrimp $6\nKale Caesar Salad\nRomaine and kale mix. shaken, not stirred‚ caesar cardini dressing. (add chicken or shrimp $6)\nSerrano Ham Croquettes\nJust like Dolores but you can call me Lolita\nCalamari al Pepperoncini Flatbread\nMediterranean Antipasto\nItalian mortadella, chorizo cantimpalo, manchego cheese.\nVery Angry Potatoes\nSpicy brava sauce.\nChihuahua Cheese Casserole\nWith pesto and a touch of chorizo.\nHuevos Estrellados\n3 eggs over easy, potatoes, mushrooms and white truffle oil.\nSmoked Mahi Mahi Fish Dip\nServed with home cut plantain chips.\nTostones & Bruschetta\nRoma tomato, strawberries, basil, balsamic, parmesan and ev olive oil.\nAsian Vegetable Spring Rolls.\nSweet chili sauce.\nHomemade Lentil Soup with Chorizo Cantimpalo\nSignature Apps\nTuna Tatar\n$3.99 surcharge\nAvocado, cucumber and spicy ponzu.\nBurrata Caprese Toast with Avocado\n$3.99 surcharge\nPlum tomato, balsamic & EV olive oil.\nPremium Wagyu Beef\nIncludes a free appetizer of your choice\nWagyu Double Bacon Smash Cheeseburger\n$28.99\nDouble Wagyu (Kobe) beef patties, cheddar cheese and applewood bacon & bbq sauce.\nCooked medium well. Add fried egg $2.00\nWagyu Sirloin Steak\n$41.99\nBlack peppercorn sauce and fried yuca.\nWagyu Churrasco\n$46.99\nMelt in your mouth Wagyu (Kobe) skirt steak. Chimichurri and shoestring fries.\nAdd 2 fried eggs $3.00\nEntree $28.99\nIncludes a free appetizer of your choice\nBreakfast Sandwich\n3 scrambled eggs, cheddar cheese, ham, bacon in a buttery croissant. Breakfast potatoes.\nNutella French Toast\nBrioche french toast stuffed with Nutella and topped with strawberries and cream with maple syrup.\nSunny Side Brunch Pizza\nHam, smoked applewood bacon, red onion, roasted cherry tomatoes and mozzarella cheese. Topped with 3 sunny side-up eggs.\nChicken and Waffles\nBelgian waffle topped with southern fried chicken & applewood bacon. Maple syrup.\nEggs Benedict Royale\nButtery croissant with canadian bacon, poached eggs and hollandaise sauce. Breakfast potatoes.\nCrazy Buddha Bowl\nSweet potato sauteed with kale and organic quinoa. Dos huevos fritos (2 fried eggs) & guacamole.\nToro Salmon Tacos\nFried toro salmon, sweet chili sauce, asian slaw, micro cilantro, sriracha mayo. Corn taco shells.\nTuna Poke Bowl\nRaw ahi tuna, avocado, mango, watercress, radish & jasmine rice.\nEntree $36.99\nIncludes a free appetizer of your choice\nBranzino with Cilantro Aioli\nRoasted branzino filet topped with cilantro aioli. Served with potatoes au-gratin.\n*Fresh Daily – Limited Availability\nKobe Beef Mini Burgers\nCaramelized onions, arugula, tomato, applewood bacon. With truffle parmesan fries.\nBaby Back Ribs\nSo tender they “fall off the bone” with shoestring fries and a pair of gloves.\nMiso Glazed Salmon\nSoy and brown sugar miso glazed scottich salmon.\nSPECIALTY COCKTAILS\nFirehouse 1923\n$16\nDon Julio blanco tequila, Ancho Reyes Chile Liqueur, agave nectar, lime juice & serrano pepper\nPassion Mule\n$16\nKetel one oranje, passion fruit, lime juice & gingerbeer\nLovers Lane Lemonade\n$16\nGrey Goose Le Citròn, strawberries, agave & lime juice\nLuxury Paradise Martini\n$16\nNolet`s Silver Gin, mango & lime juice\nZacapa Old Fashioned\n$16\nRon Zacapa 23, simple syrup, orange peel, bitters & filthy black cherries\nWoodinville\n$16\nWoodinville bourbon whiskey, strawberries, fresh mint and lemon juice.\nUnion Paloma Mezcal\n$16\nMezcal, lime juice, grapefruit juice, honey, soda water and sliced jalapeño pepper\nLOLITA HOUSE WINE $24,99 Bottle\nChardonay - by THe Glass\n$8,99\nMerlot - by the Glass\n$8,99\nCabernet - by the Glass\n$8,99\nOTHER WINES BY the GLASS\nBUBBLY\nCava\n, CVNE Brut, Spain $12\nChampagne\n, Moet & Chandon, France $15\nRose\n, Chandon, California $13\nProsecco\n, Acinum, Italy $12\nWHITE\nLolita house wine\n, Chardonay, Spain $8,99\nAlbarino\n, Lagar de Besada, Spain $13\nPinot Grigio\n, Ca Donini, Italy $12\nRiesling\n, Chateau Ste. Michelle, Washington $12\nRose\n, Whispering Angel, France $16\nChardonnay\n, Terrazas, Argentina $13\nSauvignon Blanc\n, Vavasour, NZ $13\nRED\nLolita House Wine\n, Cabernet, Spain $8,99\nLolita House Wine\n, Merlot, Spain $8,99\nPinot Noir\n, Elouan, Oregon $14\nMerlot\n, Vinas del Mar Reserve, Chile $13\nRioja\n, Marques de Riscal Arienzo, Spain $13\nMalbec\n, Terrazas Reserve, Argentina $14\nCabernet\n, Bonanza, Californi $14\nFROZEN SANGRIA RED OR WHITE BY GLASS $9,99\nBEER $7,99\nFire Station Nº4. Two is One, One is None\nOur craft house beer: 100th Anniversary\nAlhambra Reserva, larger, Spain\nEstrella Galicia Especial, larger, Spain\nEstrella Galicia 0,0%, N/A, Spain\nFounders All Day, IPA, USA\nMahou, Pale Larger, Spain\nCorona, Larger, Mexico\nMonday to Sunday from 4:00 to 7:00\nWe’re shaking things up with a spectacular offer: 50% off on all cocktails and beers!  Whether you’re a fan of classic cocktails or enjoy sipping on a cold, refreshing beer, Crazy Happy Hour has something to quench every thirst and delight every palate. Cheers to great deals, great company, and unforgettable moments.\nHALF OFF IN ALL COCKTAILS AND BEERS\nAnd an exiting 25% off all bar food!\nUnleash your weekday madness with our promotion! An irresistible temptation that will make your jump for joy. So gather your friends, co-workers or anyone in the mood for a good time and join us all day long to fill up on laugh, good drinks and the best ocean views in Brickell.\nPREMIUM WINES...AT CRAZY PRICES\nChardonnay, Far Niente, Napa Valley, California\n150\n75\nCabernet Sauvignon, Caymus , Napa Valley, California\n225\n99\nMoet & Chandon Imperial, France\n130\n99\nDO YOU THINK IM SEXY?\nMoet Ice Imperial, France\n140\nMoet & Chandon Imperial, France\n99\n15\nMoet & Chandon Imperial Rose, France\n140\nVeuve Clicquot Yellow Label, France\n140\nVeuve Clicquot Rose, France\n150\nProsecco, Acinum, Italy DOC\n45\n12\nCava, CVNE Brut, Spain\n45\n12\nChandon, Sparkling Rose, California\n55\n13\nDom Perignon, France\n425\nLOVE IS IN THE AIR\nPinot Grigio, Ca’Donini, Veneto, Italy\n42\n12\nPinot Grigio, Santa Margherita, Alto Adige, Italy\n80\nAlbariño, Laval, Rias Baixas, Spain\n48\nAlbariño, Lagar de Besada, Rias Baixas, Spain\n45\n13\nAlbariño, Baixa Sirena, Rias Baixas, Spain\n60\nReisling, Chateau Ste. Michelle, Columbia Valley, Washington\n42\n12\nRose, Whispering Angel, Cotes de Provance, France\n65\n16\nFEELING LIKE BON VIVANT?\nChardonnay, Terrazas Altos de Plata, Argentina\n48\n13\nChardonnay, Flowers , Sonoma, California\n74\nSancere, Le Tazonner, France\n65\nSauvignon Blanc, Vavasour, Marlborough, New Zealand\n48\n13\nSauvignon Blanc, Cloudy Bay, Marlborough, New Zealand\n79\nMoscato d’Asti, Saracco, Piedmont, Italy\n45\nLIVING LA VIDA LOCA\nPinot Noir, Elouan, Willamette Valley, Oregon\n58\n14\nPinot Noir, Benton-Lane, Willamette Valley, Oregon\n65\nPinot Noir, Belle Glos, Clark & Telephone, St. Maria Valley, California\n80\nPinot Noir, Astinegro, Spain\n45\nMerlot, Pedroncelli, Sonoma, California\n50\n13\nMerlot, Emmolo, Napa Valley California\n60\nRed Blend, Marques de Grinon Caliza, Spain\n55\nDO YOU THINK DIFFERENT?\nRioja, Con los Pies en la Tierra, Spain\n55\n14\nRioja, Marques de Riscal Reserva, Spain\n65\nRioja, Pujanza Hado, Tempranillo,Spain\n60\nRibera del Duero, 12 Linajes Roble, Tempranillo, Spain\n48\nRibera del Duero, Emilio Moro, Tempranillo, Spain\n62\nRibera del Duero, Bela, Tempranillo, Spain\n45\nToro, Numanthia Termes, Tempranillo, Spain\n85\nFEELING FEARLESS?\nMalbec, Terrazas Reserva, Mendoza, Argentina\n55\n14\nMalbec, Fin del Mundo Reserve, Mendoza, Argentina\n45\nCabernet Sauvignon, Bonanza by Chuck Wagner, California\n52\n14\nCabernet Sauvignon, The Prisoner Unshackled, Napa Valley, California\n70\nCabernet Sauvignon, Justin, Paso Robles, California\n65\nCabernet Sauvignon, Quilt, Napa Valley, California\n80\n18% GRATUITY IS INCLUDED IN GROUPS OF 6 OR MORE\nConsuming raw or under cooked food such as beef, lamb, poultry, seafood, shellfish, or eggs may increase the risk of food borne illness, especially if you have certain health conditions.\nPlan Your Event With Us!\nLooking for the perfect venue to host your next event? Look no further! Our restaurant offers the ideal setting for all your special occasions.\nWhether it’s a birthday celebration, anniversary dinner, corporate gathering, or any other event, our dedicated team is here to ensure everything runs smoothly from start to finish.\nWith our delicious menu options, impeccable service, and inviting ambiance, your guests are sure to have an unforgettable experience.\nContact us today to discuss your event needs and let us help you create memories that will last a lifetime!\nEvents\nContact\n(305) 377-4442\nContact Us\nSchedule\nMon - Wed\n11:30 am - 11:00 pm\nThursday\n11:30 am - 11:30 pm\nFriday\n11:30 am - 12:00 am\nSaturday\n10:00 am - 12:00 am\nSunday\n10:00 am - 11:00 pm\nHappy Hour\n04:00 pm - 07:00 pm (Every Day)\nWeekend Brunch\n10:30 am - 4:00 pm\nAddress\nTHE MARK ON BRICKELL. 1155 Brickell Bay Dr #101 Miami, FL 33131",
      "emails": []
    }
  ],
  "all_links": [
    "https://passionrestaurantgroup.com/privacy-policy/",
    "https://passionrestaurantgroup.com/about-us/",
    "https://passionrestaurantgroup.com/cookies-policy/",
    "https://passionrestaurantgroup.com/es/restaurantes/dolores-lolita/",
    "https://passionrestaurantgroup.com/contact/",
    "https://passionrestaurantgroup.com/",
    "https://passionrestaurantgroup.com/booking/?restaurant=dolores-lolita",
    "https://passionrestaurantgroup.com/es/sobre-nosotros/",
    "https://passionrestaurantgroup.com/events/",
    "https://passionrestaurantgroup.com/restaurants/dolores-lolita/",
    "https://passionrestaurantgroup.com/es/eventos/",
    "https://passionrestaurantgroup.com/booking",
    "https://passionrestaurantgroup.com/es/contacto/",
    "https://passionrestaurantgroup.com/restaurants/crazy-about-you/",
    "https://passionrestaurantgroup.com/restaurants/"
  ],
  "candidate_links": [
    "https://passionrestaurantgroup.com/about-us/",
    "https://passionrestaurantgroup.com/contact/",
    "https://passionrestaurantgroup.com/restaurants/crazy-about-you/"
  ],
  "visited": [
    "https://passionrestaurantgroup.com/restaurants/dolores-lolita/",
    "https://passionrestaurantgroup.com/about",
    "https://passionrestaurantgroup.com/contact",
    "https://passionrestaurantgroup.com/staff",
    "https://passionrestaurantgroup.com/team",
    "https://passionrestaurantgroup.com/board",
    "https://passionrestaurantgroup.com/directory",
    "https://passionrestaurantgroup.com/events",
    "https://passionrestaurantgroup.com/sitemap.xml",
    "https://passionrestaurantgroup.com/council",
    "https://passionrestaurantgroup.com/leadership",
    "https://passionrestaurantgroup.com/management",
    "https://passionrestaurantgroup.com/producers",
    "https://passionrestaurantgroup.com/support",
    "https://passionrestaurantgroup.com/crew",
    "https://passionrestaurantgroup.com/members",
    "https://passionrestaurantgroup.com/bios",
    "https://passionrestaurantgroup.com/people",
    "https://passionrestaurantgroup.com/artists",
    "https://passionrestaurantgroup.com/musicians",
    "https://passionrestaurantgroup.com/faculty",
    "https://passionrestaurantgroup.com/administration",
    "https://passionrestaurantgroup.com/about-us/",
    "https://passionrestaurantgroup.com/contact/",
    "https://passionrestaurantgroup.com/restaurants/crazy-about-you/"
  ],
  "base_url": "https://passionrestaurantgroup.com/restaurants/dolores-lolita/"
}