{
  "pages": [
    {
      "url": "https://peaceofwoodstock.com/?p=169#comment-1524743",
      "is_candidate": false,
      "has_email": true,
      "text": "Mobile Header and Nav Start\nLogo Area\nAdded Mobile WPML Support\n/WPML\nEnd Mobile Header and Nav\nNon-mobile Header and Nav\nNavbar\nHome\nConcert Dates\nPicture Library\nConcert Videos\nTESTIMONIALS AND COMMENTS AND CONTACTS\n1969 Tribute Show\nNavbar ends here\nBEGIN Menu Social Networks\nAdded in v5.1.2 for custom networks\nEND Menu Social Networks\nWMPL\n/WPML\nDefault Menu Style\n/Default Menu Style\nNon-mobile Header and Nav End\nKingSize Website Start\n=============  Main Content Start =============\nPage title start\nUncategorized\nEnds Page title\nBegin Breadcrumbs\nEnd Breadcrumbs\nBlog Main Start\nBegin Left Content\nBegin Post Title\ncontacts\nEnd Post Title\nBegin Post Date\nSeptember 17, 2014\nEnd Post Date\nBegin Post Thumbnail\nEnd Post thubmnail\nBegin Post Content\npeace of woodstock can also be contacted thru\nWayne Hunnicutt\nFlashback Management\nWolfman Jack Entertainment\nph.\n(813) 610-8180\nwww.FlashbackManagement.com\nwayne@wolfmanjack.com\nPeace of Woodstock is a Woodstock tribute band featuring songs and artists of Woodstock\nEnd Post Content\nBegin Next/Prev Pagination\n/End Next/Prev Pagination\nBegin Post Tags\nEnd Post Tags\nBegin Post Comments\n8 Comments on contacts\n#comment-##\n#comment-##\n#comment-##\n#comment-##\n#comment-##\n#comment-##\n#comment-##\n#comment-##\n//END blog_post comments_section\nLeave a comment box\nLeave a Reply\nCancel Reply\nYour email address will not be published. Fields marked with * are required\nSave my name, email, and website in this browser for the next time I comment.\nΔ\n#respond\nEnd Comment Form integration\nEnd Post Comments\nEND blog_post comments_section\nBegin Sidebar\nEnd Left Content\nPeace of Woodstock a Woodstock tribute band\nLog in\nEntries feed\nComments feed\nWordPress.org\nEnd Sidebar\nEND blog\nEND row\nFooter Start\nRecent Posts\n50th Anniversary\n2018\ncontacts\nHello world!\nRecent Comments\nDelaine Newberry\non\ncontacts\nMichael Kush\non\nConcert Dates\nGary Chandler Week\non\nConcert Dates\nUpcoming Festivals & events Tampa Fall & Winter 2025\non\nConcert Dates\nGary Chandler Week\non\ncontacts\nHome\nConcert Dates\nPicture Library\nConcert Videos\nTESTIMONIALS AND COMMENTS AND CONTACTS\n1969 Tribute Show\nSearch Starts\nSearch Ends\n© 2010 - 2011 King Size Theme\nSOCIAL ICONS\nAdded in v5.1.2 for custom networks\nSOCIAL ICONS\nFooter Ends\n/Nine columns ends\n/Main Content Ends\nIncluded JS Files (Compressed)\nInitialize JS Plugins\nGOOGLE ANALYTICS\nGOOGLE ANALYTICS\nPortfolio control CSS and JS\nEND Portfolio control CSS and JS",
      "emails": [
        "wayne@wolfmanjack.com"
      ]
    },
    {
      "url": "https://peaceofwoodstock.com/?page_id=542",
      "is_candidate": false,
      "has_email": true,
      "text": "Mobile Header and Nav Start\nLogo Area\nAdded Mobile WPML Support\n/WPML\nEnd Mobile Header and Nav\nNon-mobile Header and Nav\nNavbar\nHome\nConcert Dates\nPicture Library\nConcert Videos\nTESTIMONIALS AND COMMENTS AND CONTACTS\n1969 Tribute Show\nNavbar ends here\nBEGIN Menu Social Networks\nAdded in v5.1.2 for custom networks\nEND Menu Social Networks\nWMPL\n/WPML\nDefault Menu Style\n/Default Menu Style\nNon-mobile Header and Nav End\nKingSize Website Start\n=============  Main Content Start =============\nPage title start\nTESTIMONIALS AND COMMENTS AND CONTACTS\nEnds Page title\nBegin Breadcrumbs\nEnd Breadcrumbs\nSample Page Start\nContent here\nLive shot at Union County Performing Arts Center Rahway, NJ\nPeace of Woodstock\nPeace of Woodstock a Woodstock Tribute Band\n[if lt IE 9]><script>document.createElement('video');</script><![endif]\nhttps://peaceofwoodstock.com/wp-content/uploads/2022/05/ENCORE.mp4\nPeace of Woodstock as of December 31st 2023 POW has performed 300 shows!\nFor tech info contact Brad Trumbull\n813-317-4256 or keystrumbull@gmail.com\nFor bookings contact\ngerry@williamclare.com (west coast)\ncraig@williamclare.com (east coast)\nsrgvpmedia@aol.com (Georgia, North and South Carolina)\ninfo@tedfass.com (gail..Entertainment Unlimited..northeast)\nrich@maximumbands.com\nFollow us on Facebook https://www.facebook.com/search/top/?q=peace%20of%20woodstock\nPeace of Woodstock\nJennifer Torres-vocals, guitar, percussion and keys\nBrad Trumbull-vocals, keys and guitar\nCarl Peachey-vocals, guitar\nAlvaro Torres-bass and vocals\nBrent Martin-drums\n–\nHi! I work at Grateful Days in Dahlonega and I met some of you in the store that day! I went to the show at the Holly Theater and I just wanted to say that I loved your performance! It was absolutely wonderful! I brought my roommate and another friend and we were all vibing. I adored the outfits on stage and the music was just astonishing. You all did a great job and we had such a fun time! Thank you so much for inviting me!\nPeace\nGracie Ray\n“Peace of Woodstock gave our audience a night of awesome music that brought back so many memories for those in the crowd. Many came in their favorite 1960’s fashions. With the first song, the crowd was on their feet singing and dancing.”\nTami Mayhugh – General Manager – Ritz Theatre – Toccoa, GA\n–\nAuthor: Robert Ziarko\nComment:\nBand did two shows in one night to raise money for a children’s charity at the Savannah Center in the Villages Fl. They ROCKED !!  Yes it’s a 55+ community, you would not have known it that night. Absolutely FANTASTIC. Thank you! One of the BEST bands to play the Village’s. Each member is so talented and kind. Loved having them! You’ll be back!\nrom\nMary Goulston\nfrom Military Museum in Punta Gorda\nYou were fabulous tonight. We so enjoyed your performance. Thank you for a great night!\nFrom: Sharon Skeele-Hogan\nSent: Wednesday, May 06\nSubject: RE: PEACE OF WOODSTOCKThey were FANTASTIC!\nHigh Quality Musicianship\nI felt this was far more than a tribute\n… it was performed as an homage to the music of Woodstock,\ncrafted and performed with the love and joy of that era.\nOn a side note: The lead singer completely channeled Janis Joplin. guys ROCK!!!!!  Thank you so much.\nDouglas W. Anderson, CCM/CAM   General Manager/Chief Operating Officer Turtle Creek Club\nYou guys were outstanding!\nThank you for a great show! Carrollwood Cultural Center\nOh..god…it was so cool..Yes it was extremely special. Because I was there in 1969…… Kerry Mitchell\nFrom\nMitzi kann\non\ngood night\nThis band recently played at wellington Ampitheater and they were one of the best concerts we saw there!!! Love them…\nDear Brad and Band,\nThank you so much for giving us a wonderful evening to remember last night!\nIt brought back a lot of memories for most of us in the crowd (there were a few young’uns).\nI loved watching you all play your instruments so professionally (I used to play acoustic guitar and piano)\nand the vocals were great.\nThe slides and background info added to the fun, as well as your outfits and ours. We tried to be 1969\nstylish!\nIt was a pleasure working with you.\nKeep on rockin’!\nMusically yours,\nJoyce Kantrowitz\nVillaggio NCJW\nGeorge Watt\nsays:\nMay 28, 2021 at 12:00 am\nBest Woodstock tribute band I’ve ever seen and heard.Class act.\nJen also does Gracie Slick impressions that will raise goosebumps!!\nBrad, thanks so much for the shout out to my wife for our 34th anniversary last night.  It made a fun night even better!\nA post from the Tybee Post Theater on Tybee Island:  Last Friday the talented tribute band Peace of Woodstock grace the Tybee post to a sold out  performance of there 1969 show: music of Woodstock! Yet the real story unfolds 3 years back with one of our volunteers of the year, Donna Collet. When the band first visited 3 years ago bought a band shirt and wore it while she danced and sang the night away! Post show the band expressed gratitude and all signed the back of the shirt. This friday Donna wore the signed shirt to their performance, Jen noticed and invited her back stage, revealing the sad news that there long time guitarist Bill had passed away in April. Touched by the loss and seeing the band showing each other that Bill had signed it Donna presented the shirt back to the band turning sorrow into a heartfelt tribute\nGlad to see an “old rocker” still rocking!  I was especially impressed with your solo rendition of Beginnings (well, Jen sang harmony).\nAnd I didn’t think Jen could pull off Janis, but her best song of the night was Piece of my heart – she nailed it!\nthanks to you and Fred, Jen, Alvaro (the silent partner) and Brent!\nJoe Thomas\n–\nSome comments from Athens Theater in Delano Fl\n9 A very fun time. Band was great and the theater is very comfortable.\nIt was a 10. we Loved it\n10 Great fun and memories\nExcellent show!  Amazing musicians too.  Definitely a 10!!\nAmazing show\n10! Loved it! My party of 4 had a blast!\nDefinitely a 10   It was fantastic\nIt was a 10+.  Loved it!\nWe Loved it !!\n10 out of 10 on Santana and Janis Joplin. Thanks for the memories!\nDefinitely 10\nWoodstock gets a 10! Loved the entire show, especially Grace Slick, Janis Joplin, and Santana. I’d see it again!\n10 I really liked it. The woman who sang Janis Joplin was fantastic\n10 They put on a great show. Their dress coordinating with the pictures was Awesome. Lots of energy and pulling the crowd into participate.\nThe BAND.. all of you Bill, Brent, Alvaro, Jen, and You.. Superstars in my view.\nBill- MR. Guitar all the way and excellent vocals\nJen- Beautiful, Flowing, Peaceful, Calm, multi-talented musician: good to have on Center Stage..\nAlvaro- rockin with the BASS sounds\nBrent— keep the BAND on track  and with the beat..great drumming skills\nYOU- Positive influence, multi talented, fun loving, gentle…. pulls it all together\nNice touch with a CHICAGO Classic with only acoustic guitars and fine voices\nRollin STones— strutt like a Roster…. well done\nYour SHOWs are outstanding with the Musical Talent, Song Selections, and the Outfits… and fun attitudes..\nPhil\nJust wanted to thank the band for a great show despite the inclement weather…as you are well aware, even the original event had to deal with some weather issues.  I enjoyed seeing Peace of Woodstock at Skippers Smokehouse a few years back and was delighted to see a concert scheduled practically in my own backyard.  I was only 8 years old in 1969 but I did get to chat up a few concertgoers on Friday who were there in 69—not surprisingly, the music still resonates so much with us all these years later.\nThanks for a great show and hope to see you all again sometime soon.\nJeff\nHad a blast at your Rhythm on the River Show. Unlike many tribute bands that present a mediocre performance with the knowledge that people who loved a particular band will be content just to hear some facsimile of their old favorites, Peace of Woodstock does a multitude of artists VERY WELL!\nMike Veeman\nsaw these guys in Port Charlotte last night….Was a great show they all perform well…..Brought back some cool memories\nI went to your concert. I was also at the original Woodstock. Your performance brought it all back. Your efforts, commitment and your talent is so appreciated.  If you weren’t there, you are there…. every time you perform. It was what you would of imagined.\n2 sisters who were at Woodstock with original tickets\nWoodstock was so amazing all consuming and could never be duplicated.  It was such a special time in my life. I couldn’t make it backup to Bethel New York for this weekend, I’m glad and grateful that I spent a small part of it with you.\nWhen I heard you perform., you gave me so much joy and I thank you for it.\nKerry Mitchell\nWhat a success it was. The membership had a ball, thanks to the energy of your band.\nSaw them last night at Pinellas Park, Florida Performing Arts Center, great show, full house!! Jen Torres does the best Janis Joplin cover I’ve ever seen, bar none, AMAZING! Janis would love her impression!! Would have been worth twice the price just to see that!!\nFrom\nJane Morse\nHey Peace of Woodstock, We love you guys! I will see you in Jacksonville!\nWe heard such wonderful feedback. We love you guys and hope to have you here again next year!!! Kings Gate Port Charlotte\nSaw the tribute show last night and it was great! The band works so hard to re-create the crazy days and music of Woodstock. Thanks for your hard work and effort. WOW!!! Tom Marengo\nWe saw your show at Carrollwood Cultural Center Thursday. This was our second year in a row attending the CCC show and I think this year was even better than last year, and you blew out socks off last year, so that’s saying something! You are fantastic! God bless!\nA Peace of Woodstock comes to the Athens Aug. 21\nSaw you guys in Seminole City Park, you were awesome…the guitarist incredible…memories of Hendrix…such great music…keep on rockin” Leslie A Scott\nI had the opportunity to enjoy them in early 2019 in Sebring. This is a show not to miss. The consumate professionals. Brad, Bill . Jen Alvaro and my drummer pal Brent.\nRock on gang\nAll the best in Canada\nBob\nNothing Short of Fantastic\nI was fortunate to have gone to the original Woodstock concert while in my 2nd year of college. I was 1 of 2 people in the audience tonight that had gone.\nI started crying when I heard the songs being sung. I could close my eyes and imagine I was there again; after all these years!\nThe original Woodstock changed my life! Listening tonight was a special time. I definitely recommend this very talented band as they bring to life the historical one- of-a- kind event.\nMy wife and I saw your show at Reunion Resort, Kissimee,Fl. Great show. We were Not at the original Woodstock as we had a baby one month prior which made 2 kids. This show was as we had been told and what we read. Loved it. Thank You to all the band and their support members.\nThis band of professionals were spot on in both music and performance. True pros and it showed. From the first song set, to the final encore, it was true pleasure, awesome may be a better adjective. Every member not only made crucial plusses to the overall performance, but individually were top of the line musicians. Can’t wait to see them again. You can’t help but get taken in to the performance and back 50 years ago! Bob Chapman\nWe were at  your concert on Saturday at Citrus Springs.  My wife and I want you all to know how much we enjoyed it.     Bob Gonciarz\nI almost don’t like to post anything because my cell phone doesn’t begin to show the talent in this band. To call them a cover band doesn’t begin to do them justice. I kept thinking, “Who are these people and how is it that I am able to go to their concert?!” Each and every member of the group is a major talent. Thank you\nBrad Trumbull\nfor letting me know about this. You are the real deal.\n—\nBlew us away at Wynmoor ! Guitarist shredded Carlos Santana !!! Eyes closed could not tell the difference. Awesome tributes and especially love my girl Janice Joplin. GREAT Band !!!\nfrom Kathy\nhttp://www.fox13news.com/news/local-news/pasco-county-group-recreates-woodstock-experience-50-years-later\nHey, 70s songwriter here.  I went to ACP (Atlantic City Pop) just before Woodstock.  to summarize my cousin & I got tickets to Woodstock there.  We told the parents (since we were vacationing in OC New Jersey ) that we were going fishing but we’re gonna go to Woodstock.\nWell, my cousin left his ticket on a night able by his bed where my uncle found it and promptly concluded our ‘fishing trip’ was a hoax and got us both grounded  and tore his ticket up.\nWell, we never got to Woodstock but did see all the bands at ACP even more. So I felt like I saw Woodstock in a different place. The nice thing about the whole chain of events was that I never use my Woodstock ticket and I hung on to it with all my other ticket stubs from concerts back in the day. So I’ve still got my unused Woodstock ticket which I had professionally preserved and a few other tickets from great concerts back then.\nI like the 60s so much I started writing music in 1970 and actually finished the song in 71 called , “Stuck in the ’60s”.\nThe song was so well liked I decided to start writing some more songs during my high school years. I ended up writing four albums of music that never got released. If you play my link above you’ll get an idea of what it sounds like. You’ll immediately hear the influences and the music\nTo this day I still play and right and I’ve got material enough to release albums for quite some time. The only problem is recruiting new musicians to play the music since my bandmates have all passed on.\nAnyway, looking forward to seeing your show if I can make it in my 72 beetle!\nI hope you enjoyed my little trip here of a story and will love to meet you guys!\nRighteous righteous fight the good fight!\nYour fellow hippie,\nRay Ray B\n—\nGREAT SHOW!\nThis is Gary with Hidden Treasure.  I wanted to thank you guys for such a great show at our flagler beach location during bike week.  I heard nothing but great things.  I was wondering if you had April 27th, 2019 available for 6-10 show.  We would love to  book a few shows with you guys.\nFrom:\nScott <\nscottn@webs410.com\n>\nLove the band Peace of Woodstock. Seen you play at Skipper’s, etc. Appreciate the time you’ve put into putting on a show.\nPeace of Woodstock – 2 Thumbs Up!\nTalk about a time trip! Excellent show! Richard Dabinett\nThe Woodstock buzz is amazing and I’m pretty sure it will be for a time to come. On behalf of Lamplighter Village, thank you for making our event a huge success!\nSue, Great show at the Cascades in Estero, Fl! My kind of music!!!!!!!\nThis band is incredible! So much talent. Every member is fantastic. Thanks\nBrad Trumbull\n. I’m so glad we were able to see the show!\n–\nPeace Of Woodstock, even better than I expected and I expected greatness.\n—\nHorst Geyer\n— THEY GET BETTER AND BETTER DON’T THEY\n—\nWow! It’s always neat to hear folks in the audience say, “wow they are great! Well “Peace\n✌🏼\nof Woodstock you did it again! You always give 150%!\n–\nSandra Steele Kubler\n—\nOh, it was amazing. I couldn’t even sleep after that show!\n–\nDenice Cummings\n‎\nto\nPeace of Woodstock\nWOW! That’s all we can say! Thanks for rocking the house down tonight!\n—\n—\nPeace, Love, and Rock & Roll Concert\nBenefiting The Florida Holocaust Museum\nJune 29 at 7:00 p.m.\nat The Florida Holocaust Museum\nBill Graham and the Rock & Roll Revolution\nwill close on June 30th. Join us in celebrating the life of this legendary promoter and Holocaust refugee with one last special event! A live concert by Peace of Woodstock, who will perform their 90-minute Woodstock Tribute Show.\nIn August rockatnight.com did an interview with peace of woodstock before the Hard Rock Cafe gig\nBill Adam\nFebruary 9 at 12:19 pm\nYou guys were simply fantastic and I am looking forward to seeing you again soon.\nCarolyn\nFebruary 8 at 6:15 pm\nSaw your act last year at the Largo Cultural Center\nCAN’T WAIT TO SEE YOU ALL AGAIN TONIGHT ! !\nFrom the Lions Club: Peace of Woodstock performed 2 shows February 8th to nearly sold out crowds. The audience cheered and loved the songs from woodstock! Thank you guys we will want you back\nKenneth\nFebruary 11 at 11:13 pm\nI saw the Largo afternoon show. I felt like I was home……… I was very impressed and “Took that Journey” way back. You guys sounded great!!!\nPeace, Love and the Spirit of Giving\nCarrollwood Cultural Center:\nThanks You,Thank you, Peace of Woodstock performed a musical tribute to Woodstock to a full house.\nThis event was definitely special.\nSomething very beautiful about the “Woodstock Generation”!\nTHANK YOU!\nMe and my wife caught Peace of Woodstock at the Carrollwood Cultural Center.. Fantastic, the show, the costumes, Jen was great. Thanks you thank you thank you!!!!!!\nFrom Carrollwood Cultural Center\n“To our friends with Peace of Woodstock:\nThank YOU for a great show! ”\nHorst Geyer,\nWHAT A SHOW All your musician buddies were just liking their chops Brad It was so good! The lead guitar did a great Hendrix star spangled Can he go it LEFT HANDED!!! Just kidding I’m glad I experienced Peace of Woodstock!\nJulie Berry at Skipper’s Smokehouse,\nPeace of Woodstock! Awesome talent on a gorgeous night!\nKat\nSubmitted on 2016/04/15 at 3:01 am\nHey we just saw your show at Caliente tonight and it was absolutely the best I’ve experienced in a long time!. I would love to LIKE your page and get updates on your shows! We definitely want to see you again! Thank you for being so awesome!!! I wouldn’t change a single thing, it was perfect!!!\nPEACE!!!\nMichael Szklarz\nSubmitted on 05/15 at 5:50 pm\nYou folks did a phenomenal job last evening\nYou are an inspiration to the memory of Woodstock. It was a time when music was music.\nDiane O’Brien\nSubmitted on 2016/05/15 at 12:31 pm\nThank you for an outstanding performance last night. Prayers for all of you. God Bless.\nJanice\nSubmitted on 05/15 at 2:40 am\nWe were at the show tonight at top of the world.  You all were great!!!!!!!\nJoy R White\nThank you for a wonderful concert.\nSubmitted on05/16 at 5:35 pm\nSaturday night was the second time my wife and I have seen you in Ocala. You all were extremely professional  Rock On!\nGina\nWe truly enjoyed your show, thank you for a wonderful time. Nam Myoho Renge Kyo!\nDennis Hall- Very talented group of musicians ..CSN was my favorite with JJ…\nLove note for note bands.. Nailed it!\nPatsy Kennington Craven Great night!!! Fantastic musicians!!!\nDiana Snedeker soooooooooooo much fun!!!!! Great music by very talented musicians.\nFrankie Cross- An amazing night! Extremely talented people.\nRobin Rothwell- Great show!!! I was staggered!!! Great guitar playin’ Billy!!!!\nDarcy Geders\nJune 20 at 10:02am\nWe were WOWED last night at this performance and so happy we came! They got me so enthused and pumped up, I couldn’t sleep when I got home! A great group of mega talented musicians who have worked hard for this result. I loved it and can’t wait to see them again!!! Oh, and Jen absolutely nailed Janis… I about fell out.\nThe show was exceptional and everyone can not stop raving about it! Hope you and the rest enjoy the remainder of the summer!      Patrick Starega  General Manager  U.C.P.A. C.\nAaron Ellison- AMAZING\njames c\nSaw these guys & gal last night at Cypress Cove. I was having flashbacks even though I never got closer than 50 miles away from Bethel that weekend, & totally by accident.\nI saw your performance at the Palm Pavilion on Friday July 15th, along with my brother that was here from Kentucky, we absolutely loved it. I didn’t sit down one time and danced the night away. Looking forward to catching another performance.\nLynn\ncaribliku@yahoo.com\nWe saw your concert at the Port Charlotte Convention Center, all I can say is AWESOME!!!! What a great time we had listening to this group.\nHi Brad and Scott,\nHope all is well! I just wanted to reach out and tell you all once again how great you were at the Marion County Go Red For Women event on March 10. Our guests had such a great time and enjoyed every minute of it. Thank you for being so flexible with everything and putting your thought into making it a meaningful time. Scott, thank you also for taking the time to share your inspirational story. I know it touched a lot of people there and put a face to the work the American Heart Association does\nDiane (Dee) Sammarco\nLast night, Aug 18 th, eight of us went to see your show in Deland Florida. It was awesome !!! Everyone of the performers were so good, y’all had us up and dancing at our seats!!! We had a great time , thank you so much for a great night . Thanks again….Diane\nAt the Athens show in Deland, FL the venue asked to rate the show from 1-5\nThe show was wonderful! A 5 for excellence. Not a 5 a 10!!!! But a 5 if that’s your top number! it was AMAZING!!!\nHi, the vocals were just great!! When I closed my eyes I thought I was listening to the actual musicians….especially Janice Joplin. All of them harmonized so well together. And the lead guitarist….fabulous! It was a wonderful walk down memory lane!!! Thank you!!\nWe enjoyed the Peace of Woodstock show. I give it 5 High energy, fun, they did work very hard.\nA 5 all the way, a most excellent show would go again tonight if they were performing again. You know I watched there short videos online before I went and I didn’t think to much of them, man was I wrong don’t let that fool you these guys and girls rock!\nHello everyone! What a great Geckofest, in spite of the short rainout! There has been SO MUCH positive feedback about the entertainment. Everyone is saying that this was the best Geckofest ever, and that’s because of all of you.So, thank you from the bottom of my heart! I hope that we will have an opportunity to book you again along the way somewhere. It was a pleasure to work with you.\nSusan Blankenship SIK Promotions, Inc.  Custom Festival Management\nTheresa Moulder\ntmoulder58@yahoo.com\nSaw your performance at Top of The World Cultural Center on 9/16/17. We really enjoyed the show and the fantastic group of performers, as well as the fantastic show. Peace.\nWhat a great show last Friday evening at the winery in Ft Pierce! Your group is terrific!\nRegards.\nJohn Chianis\nI was at the Peace of Woodstock Show at Trilogy Orlando on March 24th, the band was unbelievable. I especially liked the acoustic portion where you sang Darling Be Home Soon by John Sebastian. Also like the Big Brother and Holding Company (with Janis Joplin) tribute. Do not see Piece of My Heart played that much but your lead singer was unbelievable. Thanks for a great show.\nDavid Shumway\nEnd content\nEND blog_post comments_section\ntwelve columns/blog\nend row\nSample Page End\nFooter Start\nRecent Posts\n50th Anniversary\n2018\ncontacts\nHello world!\nRecent Comments\nDelaine Newberry\non\ncontacts\nMichael Kush\non\nConcert Dates\nGary Chandler Week\non\nConcert Dates\nUpcoming Festivals & events Tampa Fall & Winter 2025\non\nConcert Dates\nGary Chandler Week\non\ncontacts\nHome\nConcert Dates\nPicture Library\nConcert Videos\nTESTIMONIALS AND COMMENTS AND CONTACTS\n1969 Tribute Show\nSearch Starts\nSearch Ends\n© 2010 - 2011 King Size Theme\nSOCIAL ICONS\nAdded in v5.1.2 for custom networks\nSOCIAL ICONS\nFooter Ends\n/Nine columns ends\n/Main Content Ends\nIncluded JS Files (Compressed)\nInitialize JS Plugins\nGOOGLE ANALYTICS\nGOOGLE ANALYTICS\nPortfolio control CSS and JS\nEND Portfolio control CSS and JS",
      "emails": [
        "caribliku@yahoo.com",
        "craig@williamclare.com",
        "gerry@williamclare.com",
        "info@tedfass.com",
        "keystrumbull@gmail.com",
        "rich@maximumbands.com",
        "scottn@webs410.com",
        "srgvpmedia@aol.com",
        "tmoulder58@yahoo.com"
      ]
    },
    {
      "url": "https://peaceofwoodstock.com/?p=169",
      "is_candidate": false,
      "has_email": true,
      "text": "Mobile Header and Nav Start\nLogo Area\nAdded Mobile WPML Support\n/WPML\nEnd Mobile Header and Nav\nNon-mobile Header and Nav\nNavbar\nHome\nConcert Dates\nPicture Library\nConcert Videos\nTESTIMONIALS AND COMMENTS AND CONTACTS\n1969 Tribute Show\nNavbar ends here\nBEGIN Menu Social Networks\nAdded in v5.1.2 for custom networks\nEND Menu Social Networks\nWMPL\n/WPML\nDefault Menu Style\n/Default Menu Style\nNon-mobile Header and Nav End\nKingSize Website Start\n=============  Main Content Start =============\nPage title start\nUncategorized\nEnds Page title\nBegin Breadcrumbs\nEnd Breadcrumbs\nBlog Main Start\nBegin Left Content\nBegin Post Title\ncontacts\nEnd Post Title\nBegin Post Date\nSeptember 17, 2014\nEnd Post Date\nBegin Post Thumbnail\nEnd Post thubmnail\nBegin Post Content\npeace of woodstock can also be contacted thru\nWayne Hunnicutt\nFlashback Management\nWolfman Jack Entertainment\nph.\n(813) 610-8180\nwww.FlashbackManagement.com\nwayne@wolfmanjack.com\nPeace of Woodstock is a Woodstock tribute band featuring songs and artists of Woodstock\nEnd Post Content\nBegin Next/Prev Pagination\n/End Next/Prev Pagination\nBegin Post Tags\nEnd Post Tags\nBegin Post Comments\n8 Comments on contacts\n#comment-##\n#comment-##\n#comment-##\n#comment-##\n#comment-##\n#comment-##\n#comment-##\n#comment-##\n//END blog_post comments_section\nLeave a comment box\nLeave a Reply\nCancel Reply\nYour email address will not be published. Fields marked with * are required\nSave my name, email, and website in this browser for the next time I comment.\nΔ\n#respond\nEnd Comment Form integration\nEnd Post Comments\nEND blog_post comments_section\nBegin Sidebar\nEnd Left Content\nPeace of Woodstock a Woodstock tribute band\nLog in\nEntries feed\nComments feed\nWordPress.org\nEnd Sidebar\nEND blog\nEND row\nFooter Start\nRecent Posts\n50th Anniversary\n2018\ncontacts\nHello world!\nRecent Comments\nDelaine Newberry\non\ncontacts\nMichael Kush\non\nConcert Dates\nGary Chandler Week\non\nConcert Dates\nUpcoming Festivals & events Tampa Fall & Winter 2025\non\nConcert Dates\nGary Chandler Week\non\ncontacts\nHome\nConcert Dates\nPicture Library\nConcert Videos\nTESTIMONIALS AND COMMENTS AND CONTACTS\n1969 Tribute Show\nSearch Starts\nSearch Ends\n© 2010 - 2011 King Size Theme\nSOCIAL ICONS\nAdded in v5.1.2 for custom networks\nSOCIAL ICONS\nFooter Ends\n/Nine columns ends\n/Main Content Ends\nIncluded JS Files (Compressed)\nInitialize JS Plugins\nGOOGLE ANALYTICS\nGOOGLE ANALYTICS\nPortfolio control CSS and JS\nEND Portfolio control CSS and JS",
      "emails": [
        "wayne@wolfmanjack.com"
      ]
    },
    {
      "url": "https://peaceofwoodstock.com/?p=169#comment-1475493",
      "is_candidate": false,
      "has_email": true,
      "text": "Mobile Header and Nav Start\nLogo Area\nAdded Mobile WPML Support\n/WPML\nEnd Mobile Header and Nav\nNon-mobile Header and Nav\nNavbar\nHome\nConcert Dates\nPicture Library\nConcert Videos\nTESTIMONIALS AND COMMENTS AND CONTACTS\n1969 Tribute Show\nNavbar ends here\nBEGIN Menu Social Networks\nAdded in v5.1.2 for custom networks\nEND Menu Social Networks\nWMPL\n/WPML\nDefault Menu Style\n/Default Menu Style\nNon-mobile Header and Nav End\nKingSize Website Start\n=============  Main Content Start =============\nPage title start\nUncategorized\nEnds Page title\nBegin Breadcrumbs\nEnd Breadcrumbs\nBlog Main Start\nBegin Left Content\nBegin Post Title\ncontacts\nEnd Post Title\nBegin Post Date\nSeptember 17, 2014\nEnd Post Date\nBegin Post Thumbnail\nEnd Post thubmnail\nBegin Post Content\npeace of woodstock can also be contacted thru\nWayne Hunnicutt\nFlashback Management\nWolfman Jack Entertainment\nph.\n(813) 610-8180\nwww.FlashbackManagement.com\nwayne@wolfmanjack.com\nPeace of Woodstock is a Woodstock tribute band featuring songs and artists of Woodstock\nEnd Post Content\nBegin Next/Prev Pagination\n/End Next/Prev Pagination\nBegin Post Tags\nEnd Post Tags\nBegin Post Comments\n8 Comments on contacts\n#comment-##\n#comment-##\n#comment-##\n#comment-##\n#comment-##\n#comment-##\n#comment-##\n#comment-##\n//END blog_post comments_section\nLeave a comment box\nLeave a Reply\nCancel Reply\nYour email address will not be published. Fields marked with * are required\nSave my name, email, and website in this browser for the next time I comment.\nΔ\n#respond\nEnd Comment Form integration\nEnd Post Comments\nEND blog_post comments_section\nBegin Sidebar\nEnd Left Content\nPeace of Woodstock a Woodstock tribute band\nLog in\nEntries feed\nComments feed\nWordPress.org\nEnd Sidebar\nEND blog\nEND row\nFooter Start\nRecent Posts\n50th Anniversary\n2018\ncontacts\nHello world!\nRecent Comments\nDelaine Newberry\non\ncontacts\nMichael Kush\non\nConcert Dates\nGary Chandler Week\non\nConcert Dates\nUpcoming Festivals & events Tampa Fall & Winter 2025\non\nConcert Dates\nGary Chandler Week\non\ncontacts\nHome\nConcert Dates\nPicture Library\nConcert Videos\nTESTIMONIALS AND COMMENTS AND CONTACTS\n1969 Tribute Show\nSearch Starts\nSearch Ends\n© 2010 - 2011 King Size Theme\nSOCIAL ICONS\nAdded in v5.1.2 for custom networks\nSOCIAL ICONS\nFooter Ends\n/Nine columns ends\n/Main Content Ends\nIncluded JS Files (Compressed)\nInitialize JS Plugins\nGOOGLE ANALYTICS\nGOOGLE ANALYTICS\nPortfolio control CSS and JS\nEND Portfolio control CSS and JS",
      "emails": [
        "wayne@wolfmanjack.com"
      ]
    }
  ],
  "all_links": [
    "https://peaceofwoodstock.com/?p=1452",
    "https://peaceofwoodstock.com/wp-content/uploads/2019/11/Little-Help-POW.mp4",
    "https://peaceofwoodstock.com/?attachment_id=1429",
    "http://peaceofwoodstock.com/?page_id=178#respond",
    "https://peaceofwoodstock.com/?p=169#comment-1524743",
    "https://peaceofwoodstock.com/?page_id=160#comment-1477284",
    "https://peaceofwoodstock.com/?page_id=160#comment-1520181",
    "https://peaceofwoodstock.com/?page_id=160#comment-1517785",
    "https://peaceofwoodstock.com/?page_id=344",
    "https://peaceofwoodstock.com/?p=1200",
    "https://peaceofwoodstock.com/?attachment_id=864",
    "https://peaceofwoodstock.com/?page_id=542",
    "https://peaceofwoodstock.com/?attachment_id=1430",
    "https://peaceofwoodstock.com/",
    "https://peaceofwoodstock.com/?p=169",
    "https://peaceofwoodstock.com/?attachment_id=1432",
    "https://peaceofwoodstock.com/?page_id=160",
    "https://peaceofwoodstock.com/?page_id=73",
    "https://peaceofwoodstock.com/?page_id=1884",
    "https://peaceofwoodstock.com/?attachment_id=1431",
    "https://peaceofwoodstock.com",
    "https://peaceofwoodstock.com/?p=1",
    "https://peaceofwoodstock.com/?p=169#comment-1475493"
  ],
  "candidate_links": [
    "https://peaceofwoodstock.com/?p=169#comment-1524743",
    "https://peaceofwoodstock.com/?page_id=542",
    "https://peaceofwoodstock.com/?p=169",
    "https://peaceofwoodstock.com/?p=169#comment-1475493"
  ],
  "visited": [
    "http://peaceofwoodstock.com/?page_id=178",
    "http://peaceofwoodstock.com/about",
    "http://peaceofwoodstock.com/contact",
    "http://peaceofwoodstock.com/staff",
    "http://peaceofwoodstock.com/team",
    "http://peaceofwoodstock.com/board",
    "http://peaceofwoodstock.com/directory",
    "http://peaceofwoodstock.com/events",
    "http://peaceofwoodstock.com/sitemap.xml",
    "http://peaceofwoodstock.com/council",
    "http://peaceofwoodstock.com/leadership",
    "http://peaceofwoodstock.com/management",
    "http://peaceofwoodstock.com/producers",
    "http://peaceofwoodstock.com/support",
    "http://peaceofwoodstock.com/crew",
    "http://peaceofwoodstock.com/members",
    "http://peaceofwoodstock.com/bios",
    "http://peaceofwoodstock.com/people",
    "http://peaceofwoodstock.com/artists",
    "http://peaceofwoodstock.com/musicians",
    "http://peaceofwoodstock.com/faculty",
    "http://peaceofwoodstock.com/administration",
    "https://peaceofwoodstock.com/?p=169#comment-1524743",
    "https://peaceofwoodstock.com/?page_id=542",
    "https://peaceofwoodstock.com/?p=169",
    "https://peaceofwoodstock.com/?p=169#comment-1475493"
  ],
  "base_url": "http://peaceofwoodstock.com/?page_id=178"
}