{
  "pages": [
    {
      "url": "https://www.pxg.com/pages/about-renee-parsons",
      "is_candidate": false,
      "has_email": true,
      "text": "Renee Parsons\nA business woman, philanthropist, and golf enthusiast, Renee Parsons established PXG Apparel to usher in a new era of fashion-forward, performance driven clothing. She now oversees the brand as the Chief Marketing Officer of PXG.\nAbout Renee\nRenee Parsons is a dynamic leader in business, fashion, and philanthropy. She is the Chief Marketing Officer for PXG and drives the vision for PXG Apparel. She is also the co-founder of The Bob & Renee Parsons Foundation and leads hospitality and design at Scottsdale National Golf Club.\nRenee was raised in a small Michigan town by her parents, who were entrepreneurs in the restaurant business. From an early age,\nshe learned the importance of hard work and serving others, values that continue to guide Renee today.\nAt 13, she began working at The Pixie, a restaurant her grandfather opened in 1945. From there, Parsons set out to make her mark in the hospitality industry, earning her BA in Hospitality and Business from Central Michigan University. She spent years climbing the ladder in the hotel business, first in Chicago and finally in Scottsdale, where she met her husband, Bob Parsons.\nIn 2009, Parsons combined her passion for hospitality with her desire to help others by joining the team at GoDaddy. Parsons launched GoDaddy Cares, a focused-giving program to benefit deserving organizations such as Make-A-Wish Arizona and Hope for Haiti.\nFollowing her time with GoDaddy, Parsons’ business acumen, service-oriented mindset and eye for detail have inspired her work in fashion, golf, hospitality, and philanthropy.\n“It is our priority to ensure every customer who walks through our doors or engages with us in any way enjoys a world-class experience.”\n- Renee Parsons, CMO\nPXG Chief Marketing Officer\nRenee Parsons launched PXG Apparel in December 2018 as the President and Executive Creative Director, bringing her passion for golf and fashion to the forefront of the brand. At the time, PXG was already making waves in the golf industry with its groundbreaking equipment, but its apparel division had yet to make its mark. Parsons set out to change that, developing a high-performance sport fashion brand that seamlessly blends style and functionality. Under her leadership, PXG Apparel has evolved beyond its golf roots, capturing the attention of everyday golfers and tastemakers alike. Parsons has spearheaded the development of multiple seasonal apparel and accessory collections each year, along with exclusive capsule collections.\nIn late 2024, Parsons transitioned into the role of PXG’s Chief Marketing Officer, expanding her influence to oversee the brand’s overall direction and strategy.\nMost recently, Parsons launched the\nSpring/Summer 2025 Apparel Collection\n, a modern reinterpretation of classic Americana preppy style. Drawing inspiration from the refined elegance of ‘Sloane Ranger’ fashion and its evolution into American prep culture, this collection seamlessly blends vintage style with contemporary performance wear.\nScottsdale National Golf Club\nIn 2013, Renee and Bob Parsons acquired Scottsdale National Golf Club. Like any dynamic duo, they divided and conquered. Bob set his sights on creating an unmatched golf experience while Renee reimagined its hospitality. She led the renovation, construction and design of the private club.\nToday, Scottsdale National features 45 holes of golf with no homes lining the course, 60 lavish villas, two clubhouses with stunning views, a state-of-the art fitness center, spa and meditation garden – all surrounded by 3 million acres of protected desert land. Scottsdale National caters to men and women equally and the club doesn’t enforce tee times or fussy dress codes for its 151 national members.\nThere is only one rule insisted upon by Renee and Bob Parsons, “No member shall ever impinge upon another member’s enjoyment of the club.”\nCo-Founder, The Bob & Renee Parsons Foundation\nRenee Parsons has always felt compelled to be a voice for those in need. In 2012, that passion for philanthropy took new shape and new opportunity, when The Parsons founded The Bob & Renee Parsons Foundation, TBRPF. The private foundation aims to provide hope and life-changing assistance to vulnerable, underserved and marginalized populations often overlooked by mainstream philanthropy. TBRPF’s areas of giving include military and veterans, youth, medical, education, homelessness and the American Dream. TBRPF donates an average of one million dollars every 14-days.\nWith a passion for supporting women and girls, Renee Parsons is an active supporter of the Girls Scouts-Arizona Cactus-Pine Council, Boys & Girls Clubs of Metro Phoenix and Free Arts for Abused Children of Arizona. Parsons served as a Make-A-Wish Arizona board member for six years and is a former board member of the Hualalai Ohana Foundation, helping to provide education and medical care for the families it serves on the Big Island of Hawaii.\nSince 2013, The Parsons have been signatories of The Giving Pledge, which is a public promise to give away half of their net worth. Renee Parsons is also a First Tee board member and a member of Women Moving Millions, a global philanthropic community of people committed to large-scale investment in women and girls.\nRenee's Closet\nDiscover Renee Parsons' personal PXG apparel favorites.\nShop Now\nRenee Parsons\n@reneelparsons\nRenee Parsons\nA business woman, philanthropist, and golf enthusiast, Renee Parsons established PXG Apparel to usher in a new era of fashion-forward, performance driven clothing. She now oversees the brand as the Chief Marketing Officer of PXG.\n“It is our priority to ensure every customer who walks through our doors or engages with us in any way enjoys a world-class experience.”\n- Renee Parsons, CMO\nRenee's Closet\nDiscover Renee Parsons' personal PXG apparel favorites.\nShop Now\nRenee Parsons\n@reneelparsons\nYou’ve never played like this before. Period.\nStay informed\nChoose your location\nChoose your location\nUnited States\npxg.com\nCanada (English)\nca.pxg.com\nCanada (Français)\nca.pxg.com/fr\n日本（日本語)\njp.pxg.com/ja\n한국 （한국어）\npxg.co.kr\nUnited Kingdom / Europe\nuk.pxg.com\nAustralia\npxg.com.au\nClose",
      "emails": [
        "privacy@pxg.com"
      ]
    },
    {
      "url": "https://www.pxg.com/pages/contact",
      "is_candidate": false,
      "has_email": true,
      "text": "You’ve never played like this before. Period.\nStay informed\nChoose your location\nChoose your location\nUnited States\npxg.com\nCanada (English)\nca.pxg.com\nCanada (Français)\nca.pxg.com/fr\n日本（日本語)\njp.pxg.com/ja\n한국 （한국어）\npxg.co.kr\nUnited Kingdom / Europe\nuk.pxg.com\nAustralia\npxg.com.au\nClose",
      "emails": [
        "privacy@pxg.com"
      ]
    },
    {
      "url": "https://www.pxg.com/pages/about-pxg",
      "is_candidate": false,
      "has_email": true,
      "text": "About PXG\nSimply put, PXG clubs are the duck’s nuts*\n*A colloquial but most compelling way to describe the world’s sexiest, most forgiving golf clubs that launch higher, go farther, feel softer and have a sweet spot the size of Texas.\nPXG is golf club innovation\nunboxed\nFounded by Marine, entrepreneur, and self-proclaimed golf nut Bob Parsons in 2013, PXG embodies his belief that every new product – from golf clubs to apparel – should be markedly better. Every innovation should noticeably improve your performance. And every moment of impact should elevate your enjoyment.\n“I want a golf club that looks like a blade. Plays like a cavity back. Launches higher. Goes farther. Feels amazing. Is incredibly forgiving. And is unbelievably sexy.”\nIt’s the unusual charter devised by Bob Parsons that set the wheels in motion for what is now a global phenomenon - PXG.\nBob Parsons’ passion for golf and obsession with the tools of the trade came to a head following a serendipitous nine holes when he met former PGA TOUR player and golf club designer, Mike Nicolette. The two struck up a friendship and an ongoing dialog about equipment.\nA few years later Parsons, with the support of Nicolette and golf industry veteran Brad Schweigert, established a research and development company that would eventually become PXG.\nFrom go, PXG has been a very different kind of equipment manufacturer. Fundamentally the company bears little relation to the established big beasts of the golf equipment market. It boasts a no cost constraints, no time constraints approach to product engineering, and maintains an unapologetic focus on performance. Its mission … to develop and deliver the world’s finest golf equipment, accessories, and apparel.\nToday, with nearly 900 global patents secured, PXG offers a complete lineup of clubs, from drivers to putters, engineered to be custom fit, and an expansive apparel collection for everyday play and elevated living.\nBob Parsons\nPXG Founder and CEO\nBob Parsons is best-known as the founder of GoDaddy, the world’s largest domain name registrar. He is also the CEO and founder of YAM Worldwide which is home to his entrepreneurial ventures in the fields of golf, motorcycles, real estate, marketing, innovation and philanthropy. Bob is a U.S. Marine Corps Vietnam War Veteran and a recipient of the Purple Heart Medal, Combat Action Ribbon and Vietnamese Cross of Gallantry. He is also the bestselling author of Fire in the Hole! The Untold Story of My Traumatic Life and Explosive Success.\nLearn More\nRenee Parsons\nPXG Chief Marketing Officer\nRenee Parsons is a dynamic leader in business, fashion, and philanthropy. She is the Chief Marketing Officer for PXG and drives the vision for PXG Apparel. She is also leads hospitality and design at Scottsdale National Golf Club and is the co-founder of The Bob & Renee Parsons Foundation, which provides hope and life-changing assistance to vulnerable, underserved, and marginalized communities. Renee is also a member of the First Tee Board of Directors and the global organization Women Moving Millions.\nLearn More\nAbout PXG\nSimply put, PXG clubs are the duck’s nuts*\n*A colloquial but most compelling way to describe the world’s sexiest, most forgiving golf clubs that launch higher, go farther, feel softer and have a sweet spot the size of Texas.\nBob Parsons\nPXG Founder and CEO\nBob Parsons is best-known as the founder of GoDaddy, the world’s largest domain name registrar. He is also the CEO and founder of YAM Worldwide which is home to his entrepreneurial ventures in the fields of golf, motorcycles, real estate, marketing, innovation and philanthropy. Bob is a U.S. Marine Corps Vietnam War Veteran and a recipient of the Purple Heart Medal, Combat Action Ribbon and Vietnamese Cross of Gallantry. He is also the bestselling author of Fire in the Hole! The Untold Story of My Traumatic Life and Explosive Success.\nLearn More\nRenee Parsons\nPXG Chief Marketing Officer\nRenee Parsons is a dynamic leader in business, fashion, and philanthropy. She is the Chief Marketing Officer for PXG and drives the vision for PXG Apparel. She is also leads hospitality and design at Scottsdale National Golf Club and is the co-founder of The Bob & Renee Parsons Foundation, which provides hope and life-changing assistance to vulnerable, underserved, and marginalized communities. Renee is also a member of the First Tee Board of Directors and the global organization Women Moving Millions.\nLearn More\nYou’ve never played like this before. Period.\nStay informed\nChoose your location\nChoose your location\nUnited States\npxg.com\nCanada (English)\nca.pxg.com\nCanada (Français)\nca.pxg.com/fr\n日本（日本語)\njp.pxg.com/ja\n한국 （한국어）\npxg.co.kr\nUnited Kingdom / Europe\nuk.pxg.com\nAustralia\npxg.com.au\nClose",
      "emails": [
        "privacy@pxg.com"
      ]
    },
    {
      "url": "https://www.pxg.com/pages/bob-parsons-founder",
      "is_candidate": false,
      "has_email": true,
      "text": "Bob Parsons\nA self proclaimed golf nut, Bob Parsons founded Parsons Xtreme Golf to design and develop the finest golf clubs ever played.\nAbout Bob\nBob Parsons, well-known as the founder of GoDaddy, is widely recognized for his entrepreneurial, philanthropic efforts, and New York Times bestseller Fire in the Hole!. Currently, Bob is the CEO and founder of YAM Worldwide, which is home to his ventures in the fields of golf, motorcycles, real estate, finance, marketing, innovation and philanthropy.\nHe is a U.S. Marine Corps Vietnam War veteran and a recipient of the Purple Heart Medal, Combat Action Ribbon and Vietnamese Cross of Gallantry. Bob attended college at the University of Baltimore on the G.I. Bill and graduated magna cum laude. His alma mater presented him with an honorary doctorate in 2008 and named him Distinguished Entrepreneur in 2010.\nIn 1984 Bob started his first business, Parsons Technology, in his basement after teaching himself how to write computer programs. When Parsons Technology was sold to Intuit in 1994 for $64 million, the company had nearly one thousand employees, $100 million in annual revenue and three million customers.\nThree years later, he launched Jomax Technologies which would later become GoDaddy - the world's largest domain name registrar. He sold a majority stake in 2011, in a deal that valued the company at $2.3 billion.\nIn 2012 Bob founded YAM Worldwide under which he owns and operates more than a dozen companies, including Scottsdale National Golf Club, Harley-Davison of Scottsdale, GO AZ Motorcycles, YAM Properties, and PXG - Parsons Xtreme Golf.\nA self-proclaimed golf nut, Bob founded PXG in 2013 with the sole intent to design and develop the world’s finest golf clubs. The company has become the largest of Bob’s post GoDaddy ventures, currently serving golfers in nearly 50 countries. In 2019 PXG debuted as one of the fastest growing, privately-held companies in the U.S. in Inc Magazine. This is Bob’s third business to top the list – Parsons Technology (#11, 1992), GoDaddy (#8, 2004) and PXG, (#123, 2019).\nBob, with his wife and PXG Chief Marketing Officer, Renee started The Bob & Renee Parsons Foundation in 2012 to reach marginalized populations and causes often underfunded by mainstream philanthropy. The Foundation provides transformational grants to nonprofit organizations successfully working in the areas of homelessness, medical care, LGBTQ youth, education and the needs of wounded veterans and military families.\nIn his New York Times and USA Today bestselling book, FIRE IN THE HOLE!, Bob tells the story of how he went from having absolutely nothing to making more than $3 billion dollars. FIRE IN THE HOLE! is honest, hilarious, outrageous, raw, and full of valuable business and life lessons.\n“I’m interested in one thing and that’s making the finest golf equipment money can buy. If we do that, and we never lose sight of that, we will be the most sought-after golf company in the world.”\n- Bob Parsons, PXG Founder & CEO\nFire in the hole!\nDiscover Bob's secrets for going from broke to multi-billionaire\nIn his New York Times and USA Today bestselling book, FIRE IN THE HOLE!, Bob tells the story of how he went from having absolutely nothing to making more than $3 billion dollars. FIRE IN THE HOLE! is honest, hilarious, outrageous, raw, and full of valuable business and life lessons.\nBuy Now\nFire in the Hole by Bob Parsons\nFire in the Hole by Bob Parsons\nRegular price\n$12.50\nRegular price\n$29.00\nSale price\n$12.50\nUnit price\n/\nper\nBob's Bunker\nDiscover Bob Parsons' personal PXG apparel favorites.\nShop Now\nBob Parsons\nA self proclaimed golf nut, Bob Parsons founded Parsons Xtreme Golf to design and develop the finest golf clubs ever played.\n“I’m interested in one thing and that’s making the finest golf equipment money can buy. If we do that, and we never lose sight of that, we will be the most sought-after golf company in the world.”\n- Bob Parsons, PXG Founder & CEO\nFire in the hole!\nDiscover Bob's secrets for going from broke to multi-billionaire\nIn his New York Times and USA Today bestselling book, FIRE IN THE HOLE!, Bob tells the story of how he went from having absolutely nothing to making more than $3 billion dollars. FIRE IN THE HOLE! is honest, hilarious, outrageous, raw, and full of valuable business and life lessons.\nBuy Now\nFire in the Hole by Bob Parsons\nFire in the Hole by Bob Parsons\nRegular price\n$12.50\nRegular price\n$29.00\nSale price\n$12.50\nUnit price\n/\nper\nBob's Bunker\nDiscover Bob Parsons' personal PXG apparel favorites.\nShop Now\nYou’ve never played like this before. Period.\nStay informed\nChoose your location\nChoose your location\nUnited States\npxg.com\nCanada (English)\nca.pxg.com\nCanada (Français)\nca.pxg.com/fr\n日本（日本語)\njp.pxg.com/ja\n한국 （한국어）\npxg.co.kr\nUnited Kingdom / Europe\nuk.pxg.com\nAustralia\npxg.com.au\nClose",
      "emails": [
        "privacy@pxg.com"
      ]
    }
  ],
  "all_links": [
    "https://www.pxg.com/collections/travel-bags",
    "https://www.pxg.com/products/3x-forged-wedges",
    "https://www.pxg.com/pages/gift-cards",
    "https://www.pxg.com/collections/beanies",
    "https://www.pxg.com/collections/womens-tops",
    "https://www.pxg.com/collections/all-specialty-items",
    "https://www.pxg.com/pages/golf-stores/pxg-boston",
    "https://www.pxg.com/pages/golf-hats",
    "https://www.pxg.com/pages/golf-stores/pxg-detroit",
    "https://www.pxg.com/cart",
    "https://www.pxg.com/pages/apparel-collections",
    "https://www.pxg.com/pages/golf-stores/pxg-westchester",
    "https://www.pxg.com/pages/golf-club-rental-program",
    "https://www.pxg.com/collections/pets",
    "https://www.pxg.com/products/gen6-drivers",
    "https://www.pxg.com/products/gen6-hybrids",
    "https://www.pxg.com/collections/all-womens-apparel",
    "https://www.pxg.com/pages/golf-stores/pxg-scottsdale",
    "https://www.pxg.com/blogs/the-range/tagged/news",
    "https://www.pxg.com/pages/golf-stores/pxg-orlando",
    "https://www.pxg.com/collections/golf-bags",
    "https://www.pxg.com/collections/battle-ready-ii",
    "https://www.pxg.com/collections/heroes-pricing-for-everyone",
    "https://www.pxg.com/products/tour-series-brandon-putters",
    "https://www.pxg.com/pages/giving-back",
    "https://www.pxg.com/collections/golf-fairway-woods",
    "https://www.pxg.com/pages/golf-stores/pxg-atlanta",
    "https://www.pxg.com/collections/golf-putters",
    "https://www.pxg.com/",
    "https://www.pxg.com/products/hellcat-zt-putters",
    "https://www.pxg.com/collections/womens-outerwear",
    "https://www.pxg.com/pages/golf-stores/pxg-orange-county",
    "https://www.pxg.com/collections/all-golf-clubs",
    "https://www.pxg.com/collections/mens-bottoms",
    "https://www.pxg.com/pages/do-not-share-my-personal-information",
    "https://www.pxg.com/collections/best-sellers",
    "https://www.pxg.com/pages/new-limited",
    "https://www.pxg.com/products/wildcat-drivers",
    "https://www.pxg.com/collections/den-caddy-bags",
    "https://www.pxg.com/pages/heroes-program",
    "https://www.pxg.com/collections/fall-winter-25",
    "https://www.pxg.com/pages/golf-stores/pxg-san-diego",
    "https://www.pxg.com/pages/why-pxg",
    "https://www.pxg.com/pages/about-renee-parsons",
    "https://www.pxg.com/collections/headcovers",
    "https://www.pxg.com/collections/all-final-clearance",
    "https://www.pxg.com/collections/golf-hats",
    "https://ca.pxg.com/pages/golf-deals#best-value",
    "https://track.pxg.com/",
    "https://www.pxg.com/products/wildcat-hybrids",
    "https://www.pxg.com/collections/cart-bags",
    "https://www.pxg.com/pages/apparel-bags",
    "https://www.pxg.com/products/mens-players-glove",
    "https://www.pxg.com/collections/golf-irons",
    "https://www.pxg.com/pages/golf-irons",
    "https://www.pxg.com/pages/golf-stores/pxg-cincinnati",
    "https://ca.pxg.com/fr?set-location=CA",
    "https://www.pxg.com/collections/gloves",
    "https://www.pxg.com/pages/contact",
    "https://www.pxg.com/pages/about-pxg",
    "https://www.pxg.com/products/wildcat-irons",
    "https://www.pxg.com/products/hole-in-one-trophy-black",
    "https://www.pxg.com/pages/cookie-policy",
    "https://www.pxg.com/collections/renees-closet",
    "https://www.pxg.com/pages/specialty",
    "https://www.pxg.com/collections/apparel-semi-annual-sale",
    "https://www.pxg.com/pages/golf-stores/pxg-chicago-north",
    "https://www.pxg.com/pages/golf-gear",
    "https://www.pxg.com/blogs/the-range",
    "https://www.pxg.com/collections/straw-hats",
    "https://www.pxg.com/collections/all-mens-apparel",
    "https://www.pxg.com/pages/golf-deals#best-value",
    "https://www.pxg.com/collections/essentials",
    "https://www.pxg.com/policies/refund-policy",
    "https://www.pxg.com/pages/sngc-xperience",
    "https://www.pxg.com/collections/golf-balls",
    "https://www.pxg.com/products/secret-weapon-mini-driver",
    "https://www.pxg.com/collections/ready-to-ship-clubs",
    "https://www.pxg.com/pages/golf-deals",
    "https://www.pxg.com/products/0317x-driving-iron",
    "https://ca.pxg.com?set-location=CA",
    "https://www.pxg.com/collections/travel-other-bags",
    "https://www.pxg.com/collections/mens-accessories",
    "https://www.pxg.com/collections/bundle-save",
    "https://www.pxg.com/products/black-ops-hybrids",
    "https://www.pxg.com/collections/bobs-bunker",
    "https://www.pxg.com/pages/golf-hybrids",
    "https://www.pxg.com/pages/why-get-fit-with-pxg",
    "https://www.pxg.com/pages/bob-parsons-founder",
    "https://www.pxg.com/policies/terms-of-service",
    "https://www.pxg.com/collections/womens-accessories",
    "mailto:privacy@pxg.com",
    "https://www.pxg.com/products/black-ops-fairways",
    "https://www.pxg.com/collections/golf-accessories",
    "https://www.pxg.com/pages/pxg-fitting-process",
    "https://www.pxg.com/pages/golf-stores/pxg-minneapolis",
    "https://www.pxg.com/collections/home-goods",
    "https://www.pxg.com/collections/stand-bags",
    "https://www.pxg.com/customer_authentication/redirect?locale=en&region_country=US",
    "https://jp.pxg.com/ja?set-location=JP",
    "https://www.pxg.com/collections/zero-torque",
    "https://www.pxg.com/products/pickleball-paddles",
    "https://www.pxg.com/products/gen7-irons",
    "https://www.pxg.com/collections/visors",
    "https://www.pxg.com/pages/golf-putters",
    "https://www.pxg.com/products/2022-0211-irons",
    "https://www.pxg.com/products/gen6-irons",
    "https://www.pxg.com/pages/golf-balls",
    "https://www.pxg.com/collections/new-arrivals",
    "https://www.pxg.com/pages/golf-stores/pxg-paramus",
    "https://www.pxg.com/pages/limited-warranty",
    "https://www.pxg.com/pages/golf-clubs",
    "https://www.pxg.com/collections/socks",
    "https://www.pxg.com/collections/womens-golf-dresses",
    "https://www.pxg.com/pages/golf-stores/pxg-chicago-west",
    "https://www.pxg.com/pages/counterfeit-clubs",
    "https://www.pxg.com/pages/locations",
    "https://www.pxg.com/pages/golf-stores/pxg-dallas",
    "https://www.pxg.com/pages/golf-stores/pxg-indianapolis",
    "https://www.pxg.com/collections/womens-bottoms",
    "https://www.pxg.com/products/wildcat-fairways",
    "https://www.pxg.com/pages/golf-stores/pxg-seattle",
    "https://www.pxg.com/collections/club-deals",
    "https://www.pxg.com/pages/golf-stores/pxg-fairfax",
    "https://www.pxg.com/pages/golf-stores/pxg-kansas-city",
    "https://www.pxg.com/pages/locations#locations-component",
    "https://www.pxg.com/pages/golf-stores/pxg-san-jose",
    "https://www.pxg.com/pages/custom-build-process",
    "https://www.pxg.com/pages/golf-bags",
    "https://www.pxg.com/pages/pros",
    "https://www.pxg.com/collections/ball-markers",
    "https://www.pxg.com/collections/bags",
    "https://www.pxg.com/pages/golf-stores/pxg-palm-desert",
    "https://www.pxg.com/collections/club-sets",
    "https://www.pxg.com/pages/golf-gloves",
    "https://www.pxg.com/tools/perfect-product-finder/golf-ball-selector#/",
    "https://www.pxg.com/pages/accessibility-policy",
    "https://www.pxg.com/pages/womens-golf-apparel",
    "https://www.pxg.com/collections/mens-tops",
    "https://www.pxg.com/collections/backpacks-duffels",
    "https://www.pxg.com/products/sugar-daddy-iii-wedges",
    "https://www.pxg.com/pages/locations?location=pxg-orlando-orlando-florida&startFittingFlow=true",
    "https://www.pxg.com/collections/on-course-accessories",
    "https://www.pxg.com/pages/golf-wedges",
    "https://www.pxg.com/collections/caps",
    "https://www.pxg.com/collections/golf-drivers",
    "https://www.pxg.com/pages/golf-stores/pxg-houston",
    "https://www.pxg.com/collections/golf-wedges",
    "https://www.pxg.com?set-location=US",
    "https://www.pxg.com/pages/university-program",
    "https://www.pxg.com/products/xtreme-tour-golf-ball",
    "https://www.pxg.com/products/black-ops-irons",
    "https://www.pxg.com/policies/privacy-policy",
    "https://www.pxg.com/collections/gear-deals",
    "https://www.pxg.com/pages/golf-fairway-woods",
    "https://www.pxg.com/collections/towels",
    "https://www.pxg.com/pages/intellectual-property",
    "https://www.pxg.com/pages/golf-drivers",
    "https://uk.pxg.com?set-location=GB",
    "https://www.pxg.com/policies/shipping-policy",
    "https://www.pxg.com/collections/bucket-hats",
    "https://www.pxg.com/pages/golf-club-trade-in-program",
    "https://www.pxg.com/products/womens-players-glove",
    "https://www.pxg.com/products/military-xtreme-tour-golf-ball",
    "https://www.pxg.com/collections/tour-bags",
    "https://www.pxg.com/collections/hat-deals",
    "https://www.pxg.com/products/black-ops-drivers",
    "https://www.pxg.com/products/military-xtreme-tour-x-golf-ball",
    "https://www.pxg.com/products/xtreme-tour-x-golf-ball",
    "https://www.pxg.com/pages/golf-stores/pxg-charlotte",
    "https://www.pxg.com/collections/tour-collection",
    "https://www.pxg.com/collections/fashion-bags",
    "https://www.pxg.com/collections/golf-hybrids",
    "https://www.pxg.com/products/desert-club",
    "https://www.pxg.com/collections/stars-and-stripes-25",
    "https://www.pxg.com/pages/golf-stores/pxg-westgate",
    "https://www.pxg.com/pages/mens-golf-apparel",
    "https://www.pxg.com/products/gen5-drivers",
    "https://www.pxg.com/products/battle-ready-ii-torpedo-putters",
    "https://www.pxg.com/pages/golf-club-fitting",
    "https://www.pxg.com/collections/mens-outerwear",
    "https://www.pxg.com/pages/golf-stores/pxg-east-bay",
    "https://www.pxg.com/pages/golf-stores/pxg-denver",
    "https://www.pxg.com/products/fire-in-the-hole-by-bob-parsons",
    "https://www.pxg.com/pages/golf-apparel",
    "https://www.pxg.com/pages/golf-stores/pxg-mesa",
    "https://www.pxg.com/pages/golf-stores/pxg-philadelphia",
    "https://www.pxg.com/products/0317-irons",
    "https://www.pxg.com/products/womens-wildcat-drivers"
  ],
  "candidate_links": [
    "https://www.pxg.com/pages/about-renee-parsons",
    "https://www.pxg.com/pages/contact",
    "https://www.pxg.com/pages/about-pxg",
    "https://www.pxg.com/pages/bob-parsons-founder"
  ],
  "visited": [
    "https://www.pxg.com/pages/golf-stores/pxg-orlando?utm_source=google&utm_medium=social&utm_campaign=002_OGSocRetailLocations_2025-03-25_en-us_x_soc_og_dtc_pur_pros_m_bnd-multi-x_x_x",
    "https://www.pxg.com/about",
    "https://www.pxg.com/contact",
    "https://www.pxg.com/staff",
    "https://www.pxg.com/team",
    "https://www.pxg.com/board",
    "https://www.pxg.com/directory",
    "https://www.pxg.com/events",
    "https://www.pxg.com/sitemap.xml",
    "https://www.pxg.com/council",
    "https://www.pxg.com/leadership",
    "https://www.pxg.com/management",
    "https://www.pxg.com/producers",
    "https://www.pxg.com/support",
    "https://www.pxg.com/crew",
    "https://www.pxg.com/members",
    "https://www.pxg.com/bios",
    "https://www.pxg.com/people",
    "https://www.pxg.com/artists",
    "https://www.pxg.com/musicians",
    "https://www.pxg.com/faculty",
    "https://www.pxg.com/administration",
    "https://www.pxg.com/pages/about-renee-parsons",
    "https://www.pxg.com/pages/contact",
    "https://www.pxg.com/pages/about-pxg",
    "https://www.pxg.com/pages/bob-parsons-founder"
  ],
  "base_url": "https://www.pxg.com/pages/golf-stores/pxg-orlando?utm_source=google&utm_medium=social&utm_campaign=002_OGSocRetailLocations_2025-03-25_en-us_x_soc_og_dtc_pur_pros_m_bnd-multi-x_x_x"
}