{
  "pages": [
    {
      "url": "https://quincymainstreet.org/about-2/",
      "is_candidate": false,
      "has_email": true,
      "text": "info@quincymainstreet.org\n850.662.1812\nQuincy Main Street\nMenu\nAbout\nLinks\nCalendar\nTwilight Concert – Tickets\nJoin\nJoin\nDonate\nContact\nHistoric Walking Tour\nDesign\nEconomic Vitality\nAbout\nWelcome\nOur Mission: The mission of Quincy Main Street is to bring together individuals and businesses to revitalize Quincy’s historic downtown by fostering historic preservation, promoting existing businesses, recruiting new businesses, and enriching our community with sponsored arts and cultural activities.\nOur Vision: Our vision is a revitalized and vibrant Quincy downtown district that is a destination for visitors and a source of pride for area residents.\nABOUT MAIN STREET\nWhat is the History of the Main Street Program?\nThe National Main Street Center, a private, non-profit organization, was established by the National Trust for Historic Preservation in 1980 to stimulate economic development within a context of historic preservation.\nThe Florida Main Street program was established in 1985. Administered by the Department of State, Bureau of Historic Preservation, it provides technical assistance to Florida’s 43 active Main Street communities for their traditional historic commercial corridors.\nQuincy’s first Main Street program was formed in 1987, making it one of Florida’s original Main Street communities. Today Quincy Main Street, Inc. is moving forward as a private, non-profit organization formed by interested citizens and dedicated local residents and professionals concerned about the economic viability of the downtown district and possessing a desire to see a revitalized Quincy downtown as a destination for visitors and source of community pride for area residents.\nWhy Worry About Downtown?\nMain Street U.S.A. was the birthplace of American enterprise and the center of economic and social activity for the community. After World War II a more mobile society abandoned historic downtowns for suburbs and the creation of the Interstate Highway system along with the advent of shopping malls and super-stores left many downtown communities by the wayside. But that is all changing! Throughout the United States historic downtowns are being restored and becoming destinations among themselves. Shoppers are looking for that unique and “authentic” experience and shopping malls that once spent millions to recreate the feel of the traditional Main Street are dying. No new enclosed mall has been built since 2006 and it is predicted that half of all malls will close in the next 10 years.\nThe Main Street Approach\nAcross the nation, small cities are discovering that the “Main Street” approach can bring about dramatic, positive change downtown. As a unique preservation-based economic development tool, the Main Street Four Point Approach® is the foundation for local initiatives to revitalize their districts by leveraging local assets—from cultural or architectural heritage to local enterprises and community pride. This approach advocates improvements in four areas to create a distinctive image for downtown:\nEconomic Vitality\nImproving the economic base of downtown by strengthening existing businesses, recruiting new businesses, performing market analysis and encouraging second floor commercial and/or residential use.\nDesign\nEncouraging quality building rehabilitation, signage, public improvements and façade improvements to improve the appearance of downtown.\nPromotion\nCreating and marketing a positive image of downtown through special events, retail sales, effective advertising and public relations.\nOrganization\nWorking with public and private sector community leaders to develop and coordinate resources to revitalize downtown.\nGuiding Principals\nThe National Main Street Center’s experience in helping communities bring their commercial corridors back to life has shown time and time again that the Main Street Four-Point Approach succeeds. That success is guided by following eight principles, which set the Main Street methodology apart from other redevelopment strategies. For a Main Street program to be successful, it must whole-heartedly embrace the time-tested Eight Principles.\nAs a Main Street America™ Accredited program, QUINCY MAIN STREET is a recognized leading program among the national network of more than 1,200 neighborhoods and communities who share both a commitment to creating high-quality places and to building stronger communities through preservation-based economic development. All Main Street America™ Accredited programs meet a set of National Accreditation Standards of Performance as outlined by the National Main Street Center.\nNON-DISCRIMINATION AND ACCESSIBILITY\nQMS shall be an open and inclusive organization that shall not discriminate on the basis of race, sex, ability, age, religion, color, creed, and national origin or upon any other unlawful basis.\nQuincy Main Street strives to ensure that its events are accessible to all members of the community and that events accommodate persons with physical mobility limitations.\nCopyright © 2025 · All Rights Reserved · Quincy Main Street\nQuincy Main Street ·  PO Box 728   ·  Quincy, FL 32353\nQuincy Main Street Facebook",
      "emails": [
        "info@quincymainstreet.org"
      ]
    },
    {
      "url": "https://quincymainstreet.org/contact/",
      "is_candidate": false,
      "has_email": true,
      "text": "info@quincymainstreet.org\n850.662.1812\nQuincy Main Street\nMenu\nAbout\nLinks\nCalendar\nTwilight Concert – Tickets\nJoin\nJoin\nDonate\nContact\nHistoric Walking Tour\nDesign\nEconomic Vitality\nContact\nCONTACT\ninfo@quincymainstreet.org\nBoard of Directors\nMartha Fletcher, President\nCrystle May, Vice President\nRobinette Dunning, Treasurer\nCaroline Chambliss, Secretary\nMembers\nJulie Baroody\nWalter Kelleher\nBridgette Rankin\nShameka Smith\nKatee Tully\nDaniel Woodward\nExecutive Director\nJosh Kever\ndirector@quincymainstreet.org\nGeneral Information\ninfo@quincymainstreet.org\nOffice Phone\n850.662.1812\nOffice Location\n104-A N. Adams St.\nQuincy, FL 32351\nMailing Address\nP.O. Box 728\nQuincy, FL 32353\nIn-Office Hours\n9:00 AM – 4:00 PM\nMonday, Tuesday, Thursday, and Friday\nFacebook\nhttps://www.facebook.com/QuincyMainStreet/\nCopyright © 2025 · All Rights Reserved · Quincy Main Street\nQuincy Main Street ·  PO Box 728   ·  Quincy, FL 32353\nQuincy Main Street Facebook",
      "emails": [
        "director@quincymainstreet.org",
        "info@quincymainstreet.org"
      ]
    }
  ],
  "all_links": [
    "mailto:director@quincymainstreet.org",
    "https://quincymainstreet.org/wp-content/uploads/2024/06/AllLogosApr2024.png",
    "https://quincymainstreet.org/donations/",
    "https://quincymainstreet.org/about-2/",
    "mailto:info@quincymainstreet.org",
    "https://quincymainstreet.org/contact/",
    "https://quincymainstreet.org/calendar/",
    "https://quincymainstreet.org/links/",
    "https://quincymainstreet.org/historic-quincy-walking-tour-audio-app-is-now-available/",
    "https://quincymainstreet.org/twilight-concert-tickets/",
    "https://quincymainstreet.org/economic-vitality/",
    "https://quincymainstreet.org/join/",
    "https://quincymainstreet.org/",
    "https://quincymainstreet.org/wp-content/uploads/2016/03/FLMainStreet-Logo-small.jpg",
    "https://quincymainstreet.org/projects/"
  ],
  "candidate_links": [
    "https://quincymainstreet.org/about-2/",
    "https://quincymainstreet.org/contact/"
  ],
  "visited": [
    "http://www.quincymainstreet.org/",
    "http://www.quincymainstreet.org/about",
    "http://www.quincymainstreet.org/contact",
    "http://www.quincymainstreet.org/staff",
    "http://www.quincymainstreet.org/team",
    "http://www.quincymainstreet.org/board",
    "http://www.quincymainstreet.org/directory",
    "http://www.quincymainstreet.org/events",
    "http://www.quincymainstreet.org/sitemap.xml",
    "http://www.quincymainstreet.org/council",
    "http://www.quincymainstreet.org/leadership",
    "http://www.quincymainstreet.org/management",
    "http://www.quincymainstreet.org/producers",
    "http://www.quincymainstreet.org/support",
    "http://www.quincymainstreet.org/crew",
    "http://www.quincymainstreet.org/members",
    "http://www.quincymainstreet.org/bios",
    "http://www.quincymainstreet.org/people",
    "http://www.quincymainstreet.org/artists",
    "http://www.quincymainstreet.org/musicians",
    "http://www.quincymainstreet.org/faculty",
    "http://www.quincymainstreet.org/administration",
    "https://quincymainstreet.org/about-2/",
    "https://quincymainstreet.org/contact/"
  ],
  "base_url": "http://www.quincymainstreet.org/"
}