{
  "pages": [
    {
      "url": "http://www.redbarntheatre.com/meet-the-board",
      "is_candidate": false,
      "has_email": true,
      "text": "meet the board & Staff\nThe Mission of Red Barn Theatre is to provide professional opportunities in a creative, nurturing environment for actors, directors, playwrights, designers, musicians and choreographers. RBT commits itself to producing new works, retaining a committed talent pool, and providing beginning and continuing educational opportunities for professionals and amateurs of all ages, race, nationality, and sexual orientation.\nBoard of Directors\nPresident:\nKim Works\nVice President:\nMimi McDonald\nSecretary:\nTanna Kinery\nExecutive Committee & Founding Members\nMimi McDonald\nManaging Director\nJoy Hawkins\nArtistic Director\nGary McDonald\nTechnical Director\nBoard\nMimi McDonald\nJoy Hawkins\nGary McDonald\nKim Works\nBob Bowersox\nJane Gardner\nMichelle Grahl\nTanna Kinery\nMichelle Chennault\nMichael Naughton\nStaff\nJoy Hawkins,\nArtistic Director\nMimi McDonald,\nManaging Director\nGary McDonald,\nTechnical Director\nBob Bowersox,\nPublicity Director\nJulie Jeffers,\nBox Office Manager\nChris Hamilton,\nDevelopment Director\nmeet the board & Staff\nThe Mission of Red Barn Theatre is to provide professional opportunities in a creative, nurturing environment for actors, directors, playwrights, designers, musicians and choreographers. RBT commits itself to producing new works, retaining a committed talent pool, and providing beginning and continuing educational opportunities for professionals and amateurs of all ages, race, nationality, and sexual orientation.\nBoard of Directors\nPresident:\nKim Works\nVice President:\nMimi McDonald\nSecretary:\nTanna Kinery\nExecutive Committee & Founding Members\nMimi McDonald\nManaging Director\nJoy Hawkins\nArtistic Director\nGary McDonald\nTechnical Director\nBoard\nMimi McDonald\nJoy Hawkins\nGary McDonald\nKim Works\nBob Bowersox\nJane Gardner\nMichelle Grahl\nTanna Kinery\nMichelle Chennault\nMichael Naughton\nStaff\nJoy Hawkins,\nArtistic Director\nMimi McDonald,\nManaging Director\nGary McDonald,\nTechnical Director\nBob Bowersox,\nPublicity Director\nJulie Jeffers,\nBox Office Manager\nChris Hamilton,\nDevelopment Director",
      "emails": [
        "redbarnboxoffice@gmail.com",
        "user@domain.com"
      ]
    },
    {
      "url": "http://www.redbarntheatre.com/shows-events",
      "is_candidate": false,
      "has_email": true,
      "text": "Book your tickets today for the current season of the Red Barn Theatre.",
      "emails": [
        "redbarnboxoffice@gmail.com",
        "user@domain.com"
      ]
    },
    {
      "url": "http://www.redbarntheatre.com/about",
      "is_candidate": false,
      "has_email": true,
      "text": "SHORT ATTENTION SPAN THEATRE: “ALTERNATIVE FACTS”\nApril 8 - May 3, 2025\nCollection of Short Plays\nShows: Tuesdays-Saturdays at 7:30pm\nAn evening of eclectic short plays, each a unique journey with a diverse collection of voices and stories; playwrights from all parts of the spectrum, and a wide range of styles and genres – an intriguing mix of characters who are in conflict with larger forces —from a catering job for a engagement party with a missing bride, a chance meeting on the Golden Gate bridge, two audience members that insist on World Premieres, a fiancé is put to the test when she meets her possible inlaws, two FBI agents interrogate a newscaster when a newsroom is hijacked, and one surprise ending. Always a season favorite show at the Red Barn.\nCast\n: Erin McKenna, Cassidy Timms, Nina Pilar, Mathias Maloff, Zach Franchini\nDirectors\n: Mimi McDonald, Gary McDonald, Jack McDonald, Amber McDonald Good\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nRead review\nCast of Short Attention Span Theatre: “Alternative Facts”\nRED BARN SHINES WITH “SHORT ATTENTION SPAN THEATRE”\nThere’s an old saying in theater: “When you find a gem, let it shine.”\nKey West’s Red Barn Theatre found such a gem over a decade ago, and they’ve been letting it shine in most of their seasons since. It’s called “Short Attention Span Theatre”, and it’s proven to be one of the most popular shows the theater offers each year. This season will be no different.\nIt’s a simple concept – pick a mixed slate of funny, powerful, poignant, or simply off-the-wall short plays and populate them with some of the area’s top comedic talent, then string them together for an evening of stellar fun. Each year, the Red Barn’s resident family – the McDonalds – find six or seven wonderful new plays and pull them together under a title that relates to them all. This year’s theme: “Alternative Facts”, which anyone will agree, certainly is relevant to the times.\n“One of the things I love most about Short Attention Span Theatre (SAST),” said the Red Barn’s Managing Director Mimi McDonald, “is that it gives us the opportunity to explore a number of different voices and new playwrights in one show. And it seems to many of us that the human condition is evolving right now, and these playwrights are noticing that and commenting on what’s happening in a very comedic way. And we have such great comedic actors all doing a variety of very funny characters in this one.”\nThis year’s rendition of SAST will star Erin McKenna, Mathias Maloff, Cassidy Timms, Nina Pilar, and Zach Franchini. They appear in various combinations during the evening of eclectic plays that focus on characters who are in conflict with larger forces – from a catering job for an engagement party with a missing bride; a chance meeting on the Golden Gate Bridge; two audience members who insist on world premieres; a fiancé is put to the test when she meets her possible in-laws; and two FBI agents who interrogate a newscaster when a newsroom is hijacked.\n“It’s a fast, fun evening,” said McDonald, “but there’s a message or two in there as well.”\nAs they do every year, the entire McDonald family shepherds this show to the stage, with each of them directing, building sets, handling the tech, and more. Along with Mimi are her husband Gary, and their two (now adult) children, Amber and Jack.\n“We’ve been a theater family for more than 45 years,” Mimi said. “It’s in our blood, and we have such a great time working together on this show. It’s always a big hit.” Or to put it another way – it’s a gem.\nTickets for “Short Attention Span Theatre: Alternative Facts” are available at KeysTix.com, redbarntheatre.com, or by calling the box office at 305-296-9911. Note that all curtain times are 7:30 pm.\nAuthor\nSusannah Wells\nDate\nMay 5, 2025\nBROOKLYN LAUNDRY\nMarch 4 - 29, 2025\nWritten By: John Patrick Shanley\nShows: Tuesdays-Saturdays at 7:30pm\nWritten by John  Patrick Shanley, the Pulitzer Prize- and Tony-winning author of Doubt and the Oscar®-winning writer of Moonstruck. Sometimes big things start from little things; in this case, a bag of laundry. Shanley’s latest is about three sisters, a guy who runs a laundry in Brooklyn, and the sometimes savage tricks life plays on them. Tragic and funny by turns, this story will remind you what is important in life... and the sorrow and joy of fully embracing adulthood.\nCast\n: Jessica Miano Kruel, Michael Castellano, Lauren Thompson, Donna Stabile\nDirector\n: Joy Hawkins\nMichael Castellano and Jessica Miano Kruel | Photo by Roberta DePiero\nROMANCE BLOOMS IN THE RED BARN’S CHARMING “BROOKLYN LAUNDRY” BY JOHN PATRICK SHANLEY\nIt’s been said that chance meetings are often an aphrodisiac moment out of which true love may bloom. That doesn’t guarantee it will be an easy germination, of course…just that there’s an outside chance for an acceptable blossom.\nPlaywright John Patrick Shanley endearingly lets us watch such a flowering in his latest play, “Brooklyn Laundry”, running March 4-29 at the Red Barn Theatre in Key West. Shanley, author of the romantic megahit “Moonstruck”, is a master of the charming, imperfect love story, and this play fits his model well.\n“Brooklyn Laundry” is about three sisters and a guy who runs a laundry in that New York borough. Fran is a single woman and bone-tired of being so, whose sisters each have their own crosses to bear. Trish is dealing with a threatening illness, and Susie with a dissolving marriage, and each of them is turning to Fran, who is feeling overwhelmed with it all.\nThen one day, Fran takes a bag of laundry to the cleaners in her building and runs into the owner, Owen, whose sweetly gruff adorability breaks through her protective barriers and sparks something between them. Owen, too, has had to deal with some unexpected twists in his life, but he uncharacteristically rises to and goes with the moment, asking Fran to dinner. From there on, Shanley takes us on an utterly charming and very funny ride into a story of two people trying to find balance in their lives despite the bumps that come their way.\nThe Red Barn production stars a quartet of top local actors, including Jessica Miano Kruel, Michael Castellano, Donna Stabile, and Lauren Thompson. It is directed by Joy Hawkins, the Barn’s artistic director.\n“It’s a beautiful play,” Hawkins said, “nicely written, funny, tender, and heartwarming. It does deal with some situations we sometimes have to deal with in life, and it might bring some tears here and there, but you’ll leave the theater feeling really good. It’s very life-affirming, with characters you can really root for.”\nThe New York Times called the play “Utterly charming.” The New York Theatre Guide said, “Forget the dating apps – maybe the laundromat is the place to find your next great love…”.\nTickets are available at KeysTix.com, or at redbarntheatre.com. For more information, call the box office at 305-296-9911. All shows for the March 4-29 run are at 7:30 pm. The production is sponsored in part by Florida Arts and Culture, and the Monroe County Tourist Development Council.\nAuthor\nSusannah Wells\nDate\nMarch 5, 2025\nMS HOLMES AND MS WATSON, APT 2B\nJanuary 28 - February 22, 2025\nWritten By: Kate Hamill\nShows: Tuesdays-Saturdays at 7:30pm\nAn irreverent, darkly comic, modern take on Sir Arthur Conan Doyle’s famous sleuth and sidekick, this fast-paced romp re-examines the world’s most famous detective story with a bold new feminist lens. In this highly theatrical, small-cast escapade, oddball female roommates Sherlock (yes, it’s also a girl’s name—wait, is it a girl’s name? Is it even a name?) Holmes & Joan Watson join forces to emerge from pandemic fog as a deeply codependent, quasi-dysfunctional Odd Couple adventure duo—solving mysteries and kicking butts, until they come face to face with a villain who seems to have all of the answers.\nWinner of the Off-Broadway Alliance Award\nCast\n: Susannah Wells, Mariah Woessner, Arthur Crocker, Morgan Fraga Pierson\nDirector\n: Mimi McDonald\nCostumes\nby Sushi\nMariah Woessner and Susannah Wells | Photo by Roberta DePiero\nMYSTERY ABOUNDS IN RED BARN’S “MS. HOLMES, MS. WATSON, APT.2B”\nEveryone loves a good mystery. And who better to confound us with one than Sir Arthur Conan Doyle, who then sends his most famous detective, Sherlock Holmes, to unravel even the most convoluted of mysteries for us?\nAh, but there’s a hilarious rub in all of this! In the Red Barn Theatre’s latest offering of their 45th remarkable season – “Ms. Holmes, Ms. Watson, Apt. 2B”, running January 28 through February 22 – we are presented with a tale that cheerfully desecrates the stories of Conan Doyle in a most unusual and very funny way.\nBecause in Kate Hamill’s energetic play, the world’s most famous detective is a frazzled female police consultant whose dazzling deductions astound everyone. She takes on a new roommate – a wayward American who Holmes determines is running from a past where she used to be a doctor and needs a little help and refocusing. Portrayed as a deeply co-dependent, quasi-dysfunctional Odd Couple, this duo proceeds into a fast-paced and wildly entertaining romp through multiple violent crimes that all seem to lead to notorious villains.\nThe pair solve a variety of these crimes, from the murder of a man found in a motel to the case of a right-wing politician who cheated on his wife. It’s a blend of classic theater and modern comedy that balances mystery with laugh-out-loud humor, playfully dismantling and, at the same time, celebrating the conventions of Conan Doyle’s stories.\n“We’re really having a good time,“ said director Mimi McDonald. “The intimacy of the Red Barn allows the audience to take the ride with the actors. At the heart of it is a real mystery, with twists and turns, and a few real surprises. We know the audience is going to have a ball solving the mystery right along with us.”\nSusannah Wells, one of Key West’s best comedic actresses, stars as Ms. Sherlock Holmes, and Mariah Woessner is the perfect complement as Ms./Doctor Watson. Joining them and playing a number of unexpected and mysterious/villainous characters are Arthur Crocker and Morgan Fraga Pierson, both no slouches when it comes to comedic chops.\n”One thing I’m sure everyone will love are the costumes,” said McDonald, who commissioned iconic Key West costumer Gary Marion – better known as Sushi – to create original costumes for the play. “They’re really something – a kind of apocalyptic theme and a warrior vibe, that adds another whole dimension to the story.”\nCalled “…laugh-out-loud funny, incredibly clever, inherently theatrical, and a delight from start to finish..” and “…sharp, playful, and moves at a rapid-fire pace…” by the Portland Monthly, “Ms. Holmes, Ms. Watson, Apt. 2B” is a great way to spend an evening deducting, finding clues, and solving mysteries. The game’s afoot!\nRunning January 28 through February 22. All curtains are at 7:30 pm. Tickets at keystix.com. For more information, call the Red Barn box office at 305-296-9911.\nSponsored in part by the William L. Monroe III Foundation, and the Monroe County Tourist Development Council.\nAuthor\nSusannah Wells\nDate\nFebruary 1, 2025\nGERRI LOUISE STANDUP: SENIOR MOMENTS OR WHAT THE HELL HAPPENED?\nFebruary 16 & 17, 2025\nLimited engagement — 2 nights only!\nShows at 7:30pm\nIf there’s a funnier woman living and working in Key West theatre, we’d like to meet her. Gerri Louise can make you laugh in one second, with one word. With an astute eye, an always-open ear, and a quick mind, it just comes naturally to her. She’s graced all our stages – in both straight plays and her own stand-up comedy. These two special nights of comedy feature an all-new basket of classic Gerri Louise. Of her comic perspective, Gerri says,  \"You have to make the littlest things in life funny for yourself...make them all a celebration, no matter what they are. That way every day is a good day and you go to sleep having smiled all day.”\nAuthor\nSusannah Wells\nDate\nJanuary 31, 2025\nVAIL JOHNSON IS BASSICALLY INCORRECT | ALL NEW SHOW!\nFebruary 9 & 10, 2025\nLimited engagement — 2 nights only!\nShows at 7:30pm\nBASSIST FOR THE STARS: VAIL JOHNSON TELLS ALL IN RED BARN LIMITED ENGAGEMENT\nYou might not recognize him on the street nor know his name, but you’ve probably seen him onstage and you’ve most certainly have heard him…probably many times.\nVail Johnson is his name, and he’s a bassist. Not just any bassist, mind you, but THE bassist when it comes to studio work, recordings, and live performance.  He’s been doing it for over 40 years with some of the top names in music, and he’s bringing a career-ful of behind-the-scenes stories and almost every note of the great music he’s had a hand in to the Red Barn Theatre in Key West.\nWant some names he’s put the bottom under? How about Kenny G, Whitney Houston, Herbie Hancock, Stevie Nicks, Keb’ Mo’, George Benson, Michael Bolton, James Ingram, Gil Scott Heron, Paula Abdul, MC Hammer, T. Graham Brown, David Cassidy, Steve Perry, Patti Austen, Peabo Bryson, Edgar Winter, and Christopher Cross, just to name a very few.\n“It just sort of happened,” Johnson said recently. “I was playing in a lounge band back in the late 70’s, and Kenny G’s percussionist sees me, brings Kenny to the gig, and the next thing I know, I’m playing in Kenny G’s band. We go to LA, and Stevie Nicks sees me at a gig, and asks me to do her record. It just snowballed from there.”\nIt wasn’t all luck, however. Johnson was ready when the door opened. The youngest of seven brothers (one of his older siblings is Key West’s Jeff Johnson), Vail was immersed in all kinds of music through his family – classical, choral, gospel, bluegrass, Dixieland, Top 40. He absorbed it all, mixing in whatever he came across, including jazz, hip-hop, metal rock, and pure improvisation. His virtuosity, passion, and humor were his calling card, and his ability to play virtually any style extremely well sealed the deal.\nAnd all of it is on display in his one-man show – from Kenny G’s, George Benson’s, and Herbie Hancock’s jazz to Steve Perry’s and Stevie Nicks’s rock, to Peabo Bryson’s soul and Keb’Mo’s blues.\n“I tell stories about the artists I’ve played and toured with, and then play and sing along with the tracks I’ve done with them or played on tour. I do some of my own stuff too. And what I do is not just ‘play bass’…people are surprised what I can do on a bass in terms of playing music. Look…it’s a guitar. It just happens to be a bass. I can make it sound like a Spanish guitar, or bluesy finger-picking, or monster slapping.”\nAsk Johnson who was the most fun he’s had with any artist, and the answer might surprise you. “Edgar Winter,” he said. “For me to play ‘Frankenstein’ with Edgar Winter? Man, that was freakin’ fun!”\nIt doesn’t matter what style of music or what particular artist you like personally – there’s a very good chance Vail Johnson will tell you a story about touring with them, or play something you’ve heard by them in his show. And odds are you’ll say, “Oh, yeah! I know that one! He played bass on that?”\nAuthor\nSusannah Wells\nDate\nJanuary 30, 2025\nA LITTLE BIT COUNTRY, A LITTLE BIT ROCK N ROLL\nJanuary 15 - 18, 2025\nShows at 7:30pm\nChristine Mild returns with a new knockout \u0003show featuring the women who sing Country AND Rock n Roll.\nStarring:\nChristine Mild\nJim Rice, Musical Director & Piano\nGary Rivenson, Bass Guitar\nGary McDonald, Drums\nMatt Backer, Guitar\nVOCALIST CHRISTINE MILD RETURNS TO THE RED BARN WITH A STELLAR NEW SHOW\nVocalist Christine Mild, who has wowed Red Barn audiences for the last several years with her “Always, Patsy Cline” and “Women of Country Music” shows, will be returning to the Barn January 15-18 with her brand new show, “A Little Bit Country, A Little Bit Rock ‘n’ Roll.” All show times are 7:30 pm.\nWhile Mild’s heart has always rested in country music, she says she always tries to bring “a little something new” to each of her stops in Key West, and this year will be no different.\n“I’ll never stray too far from country music, of course,” Mild said, “but with this new show, we’re going to be expanding the boundaries a little bit, which has been happening in the music business over the last couple of years, with Dolly Parton releasing a rock album, and Beyonce and Lady Gaga releasing country albums. The lines are getting blurred and an awful lot of good music is coming out.”\nMild said she’ll still be featuring country touchstones, focusing on female artists like Faith Hill, Carrie Underwood, Jody Messina, and Shania Twain, but “we’ll be adding in friends like Bonnie Raitt, Linda Ronstadt, Patty Smith, and even some Heart. It’s all great music.”\nAnd as usual, Mild will have a kickin’ band with her, featuring her regular sidemen – Jim Rice on keyboards, Gary Rivenson on bass, and Gary McDonald on drums. But she’s expanding the group for this show with some top-level name players. She’s bringing in British guitarist Matt Backer, who’s played with a number of top recording artists. And one of her best friends, Chicago vocalist Erin Parker, will be on stage to add the extra dimension of another female voice for harmonies. The sound will be bigger and richer, more a concert event than a small group.\n“I always want to bring Key West something new, and this is going to be an awesome show, given all the new pieces in the band and the music that we’ll be doing. You’re going to know a lot of this music, but we’ll surprise you with a few new things I know you’re going to like.”\nTickets are available now for the best seats at keystix.com or redbarntheatre.com. For more information, visit the website or call 305-296-9911. Remember that all shows at the Red Barn now have a curtain time of 7:30 pm. Sponsored in part by William L. and Pattye Monroe III, and the Monroe Country Tourist Development Council.\nAuthor\nSusannah Wells\nDate\nJanuary 29, 2025\nTHE FOREIGNER\nDecember 18, 2024 - January 11, 2025\nWritten By: Larry Shue\nShows at 7:30pm\nThe scene is a fishing lodge in rural Georgia often visited by “Froggy” LeSueur, a British demolition expert who occasionally runs training sessions at a nearby army base. This time “Froggy” has brought along a friend, a pathologically shy young man named Charlie who is overcome with fear at the thought of making conversation with strangers. So “Froggy,” before departing, tells all assembled that Charlie is from an exotic foreign country and speaks no English. Once alone the fun really begins, as Charlie overhears more than he should—the evil plans of a sinister, two-faced minister and his redneck associate; the fact that the minister’s pretty fiancée is pregnant; and many other damaging revelations made with the thought that Charlie doesn’t understand a word being said. That he does fuels the nonstop hilarity of the play and sets up the wildly funny climax in which things go uproariously awry for the “bad guys,” and the “good guys” emerge triumphant.\nWinner of the Outer Critics Circle Award for Outstanding Off-Broadway Play.\nCast\n: David Black, Annie Miners, Cassidy Timms, Brian Robinson, Thomas Masat, Chase Naylor, and Iain Wilcox\nDirector\n: Joe Kinosian, the lauded Chicago Theatre director\nRED BARN LANDMARK 45TH SEASON OPENS WITH THE HILARIOUS “THE FOREIGNER”\nKey West’s venerable Red Barn Theatre opens its 45th season literally with a bang and a houseful of laughs when it presents a new production of Larry Shue’s hilarious, award-winning “The Foreigner”, opening Wednesday, December 18th  and running through January 11 next year. All shows will be at the theater’s new curtain time of 7:30 pm.\nThe season also marks a milestone for the Red Barn’s Mimi and Gary McDonald and Joy Hawkins, who have guided the small but well-respected playhouse for all of its nearly half a century, an accomplishment rarely achieved in today’s theatrical landscape. Notables who have worked with them at the Barn through the years include Tennessee Williams, Shel Silverstein, Tony Roberts, Paul Cotton, Terri White, and a dozen other names that have made their larger marks in the entertainment industry.\n“We’re really excited about this upcoming forty-fifth season,” said Joy Hawkins, the Barn’s artistic director. “It’s an eclectic and surprising season -- funny and deep and particularly right for these times. “\n“The Foreigner”, winner of two Obie Awards and the Outer Critics Circle Award, uses the clever conceit of the audience knowing more than the characters on stage to create its fun, while also weaving in rich elements of suspense and a little mystery as the story plays out.\nThe scene is a fishing lodge in rural Georgia often visited by “Froggy” LeSueur, a British demolition expert who occasionally runs training sessions at a nearby army base. This time Froggy has brought along a friend, a pathologically shy man named Charlie who is overcome with fear at the thought of making conversation with strangers. So before departing, Froggy tells all assembled that Charlie is from an exotic foreign country and speaks no English. Once alone, the fun really begins, as Charlie overhears more than he should from those who feel secure he doesn’t understand a word being said. That he does fuels the nonstop hilarity of the play and sets up the wildly funny climax in which things go uproariously awry for the bad guys, and the good guys emerge triumphant.\n“The Foreigner” stars David Black, Chase Naylor, Cassidy Timms, Thomas Masat, Brian Robinson, and Iain Wilcox. It will be directed by Joe Kinosian, who Key West theater buffs will remember as the writer and star of “Murder For Two”, the outrageous and very funny two-man show that played the Red Barn in 2017. Kinosian, invited by artistic director Joy Hawkins to return and direct this opening show, is thrilled to be back in Key West.\n“It’s a hilarious and very funny play – probably one of the funniest ever written,” Kinosian said, “but it’s also one of the most moving stories I’ve seen. The audience will be surprised by how much they like the characters and are rooting for them against all odds. It’s one of a kind.”\nThe New Yorker said “The Foreigner is once comic surprise after another.” And The Village Voice said of the play, “It’s a constant invitation to laugh at the foolishness of life.”\nSubscriptions and single show tickets are now on sale for “The Foreigner” and the Red Barn’s entire season at KeysTix.com, redbarntheatre.com, or by calling the box office at 302-296-9911.\nBe aware that for this new season, the Red Barn has set curtain time at 7:30 pm for all shows\n.\nAuthor\nSusannah Wells\nDate\nAugust 5, 2024\nTHE LIFESPAN OF A FACT\nApril 9 - 27, 2024\nWritten By: Jeremy Kareken, David Murrell & Gordon Farrell\nShows: Tuesdays-Saturdays at\n7pm\nWith a deadline looming, a talented writer, a desperate magazine editor and a young aggressive fact checker go head to head in this oh-so-funny and gripping dispute over factual truth vs. the beauty of literary dishonesty.\nStarring:\nDave Bootle as John D’Agata, the writer\nRita Troxel as Emily Penrose, the magazine editor\nCody Borah as Jim Fingal, the fact checker\nRED BARN’S “LIFESPAN OF A FACT” HAS RELEVANCE FAR BEYOND A VERY FUNNY STAGE PLAY\nCast from left to right: Cody Borah, Rita Troxel, Dave Bootle\nIn a world where war, disease, famine, diversity, equality, AI, and God knows what else is piled on the plate in front of us, there may be one issue in that stew of concerns that trumps them all: Is any of what we’re being told in the media about\nanything\nentirely true?\nIn the final main stage production of their remarkable 44th season, the Red Barn Theatre in Key West takes this controversy head on with “Lifespan of a Fact”, an intriguing and humorous offering that has obvious relevance in this era of alternative facts. The play, written by Jeremy Kareken, David Murrell, and Gordon Farrell, runs April 9 – 27, and is adapted from a 2012 book by the real men portrayed in the play about a real incident in Nevada.\nThe play stars top local actors Dave Bootle, Cody Borah, and Rita Troxel. It’s directed by the Barn’s artistic director, Joy Hawkins. And be advised: All curtain times are 7 pm instead of the normal 8 pm.\n“It’s a very unique play,” said Hawkins. “I can’t compare it to anything else. It’s not a tie-it-up-in-a-bow kind of theater. You have to figure out for yourself what you think.”\nThe story starts off innocuously enough – Jim is a fresh-out-of-Harvard, eager beaver fact checker hired by Emily, a struggling magazine’s top editor, to fact-check an article submitted by the well-known and talented writer, John. The piece is centered around an indisputable incident: a 16-year-old boy is dead, having jumped from the observation deck of Las Vegas’ Stratosphere Hotel and Casino. Beyond that is where things get sticky.\nTurns out John has inserted unnecessary lies into his work under the guise of “artistic license” – for instance, was the casino deck actually 1100 feet high or far shorter, and did the boy’s death connect with other phenomena that day – like banned lap dances, the world’s oldest Tabasco bottle, or a tic-tac-toe-playing chicken named Ginger?\n“I’m not interested in accuracy,” says John. “I’m interested in truth.” And woe to anyone who calls his shattering essay an “article”. He is not cool with anyone tampering with his copy, insisting that 100 percent accuracy in names, dates, and specific incidents is less important than rhythm, music, and beauty in the language.\nBut Jim – out to prove himself – is not having any of it, and poor Emily is caught in the middle, concerned only with saving her magazine and knowing a sensational piece by the acclaimed John could prop up shrinking ad sales and disappearing subscriptions. What should she do?\nThe action is brisk, with plenty of sharp and funny repartee, sometimes unfolding like a taut thriller, but always coming back to the main question – do you undermine yourself by fiddling with the facts, or do you allow whatever is necessary to find the “higher truth” – the music of a boy’s tragic death?\nWho’s to say which one of them is speaking the kind of truth that really matters? You’ll have to decide for yourself.\nThe Washington Post called the play “buoyantly literate…briskly entertaining.”  Variety said “…terrifically funny dialogue…the debate at the heart of the play demands serious attention.”\nTickets for “Lifespan of a Fact” are available at redbarntheatre.com or by calling 305-296-9911. Remember that all curtain times are 7 pm.\nThe show is sponsored in part by Design Key West, Culture Builds Florida, and the Monroe County Tourist Development Council.\nAuthor\nSusannah Wells\nDate\nAugust 5, 2023\nTHE THANKSGIVING PLAY\nMarch 5 - March 30, 2024\nWritten By: Larissa FastHorse\nShows: Tuesdays-Saturdays at 8pm\nA group of terminally \"woke\" teaching artists scramble to create a pageant that somehow celebrates both Turkey Day and Native American Heritage Month. A hilarious, clever and delicious roasting of good intentions and absurd assumptions.\nStarring: Elena Devers, Arthur Crocker, Jeremy Zoma, & Nina Pilar\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nReview of THE THANKSGIVING PLAY\nPlaywright Larissa Fasthorse\nFrom Left to Right: Elena Devers, Arthur Crocker, Director Mimi McDonald, Jeremy Zoma, Nina Pilar\nRED BARN’S “THE THANKSGIVING PLAY” TAKES A HILARIOUS ‘WOKE’ LOOK AT OUR ICONIC HISTORY\nWe hear a lot about “wokeness” in the heady world of national politics these days. It’s usually pretty serious stuff, with each side slamming the other for either having too much of it, or not having enough. But what happens when you bring that thorny issue down to the common earth of everyday people?\nWell, we’re about to find out in a very funny way when Key West’s Red Barn Theatre stages “The Thanksgiving Play” as the third mainstage production of their remarkable 44th season. The show opens March 5 and will run Tuesdays to Saturdays through the 30th.\nThe play was written by Larissa Fasthorse, a member of the Sicangu Lakota Nation, and the first female Native American playwright to have a show on Broadway when it premiered at the Helen Hayes Theatre in New York. It won a Drama League Award in 2023.\nIt’s a simple premise: a group of white theater nerds meet in an elementary school classroom to put together a dramatic rendition of the Thanksgiving story for their young students – the one we’ve always been told about the Pilgrims and the “Indians” and the turkey and the corn. But when the supposed Indigenous professional actress they hire turns out to be anything but, everything plunges headlong into hilarious absurdity as the hopelessly woke whites try to fashion a play that ultimately has nothing to do with the actual unsavory history of that occasion, and is completely devoid of any insight into a Native American perspective on it.\n“It’s very funny,” said director Mimi McDonald. “It brings home how we really don’t know what to do with what actual history – as opposed to the glossed-up stories – tells us really happened. The takeaway is that we’re all just trying to figure things out, and it can get really funny and absurd as we do.”\nFasthorse herself has said she hopes the audience – while entertained by the laughter – will walk away with more questions than answers. But the main point she wants to cut through the laughter is this: “Doing nothing is not adequate anymore,” she says. “Stepping away because it’s too complicated can no longer be considered a part of any kind of solution.” This sentiment is brought to side-splitting life in her show’s audacious climax, which, for the sake of not spoiling the hilarity of it, will not be revealed here.\nEntertainment Weekly said the play is “…a good dark comedy that makes you laugh, makes you think, makes you mad, makes your brain explode.” The Hollywood Reporter called it “Very, very funny…”.\nTickets are available at redbarntheatre.com or by calling 305-296-9911 and are already selling quickly. Ticketholders for the March 5 Opening Night will be invited to a catered Opening Night reception with the cast and crew.\n“The Thanksgiving Play” is sponsored in part by Key West Compass Realty – Keller Williams, Culture Builds Florida, and the Monroe County Tourist Development Council.\nAuthor\nSusannah Wells\nDate\nAugust 2, 2023\nPOTUS: Or, Behind Every Great Dumbass Are Seven Women Trying To Keep Him Alive\nJanuary 30 - February 24, 2024\nWritten By: Selina Fillinger\nShows: Tuesdays-Saturdays at 8pm\nNOTICE ABOUT POTUS: This very funny play has language that is irreverent, bawdy, racy, sexual, smutty and gleefully filthy.\nOne four-letter word is about to rock the White House into a global crisis. Seven brilliant and beleaguered women risk life and sanity to keep POTUS out of trouble in this gleefully filthy and outrageously funny farce. A recent Broadway smash hit!\nStarring:\nGeorge diBraud as Harriet, his chief of staff\nLauren Thompson as Jean, his press secretary\nJessica Miano Kruel as Stephanie, his secretary\nSusannah Wells as Dusty, his dalliance\nAnnie Miners as Bernadette, his sister\nFritzie Estimond as Chris, a journalist\nLynne Casamayor as Margaret, his wife, The First Lady\nStage Manager: Rex Pierson\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nReview of POTUS\nCast of POTUS: Fritzie Estimond, George diBraud, Annie Miners, Lynne Casamayor, Jessica Miano Kruel, Lauren Thompson, & Susannah Wells\nRED BARN’S “POTUS” IS ONE VERY FUNNY FEMALE-DRIVEN TOUR-DE-FORCE\nIt would be hard to deny that politics in this day and age has pretty much distilled itself down into a daily dose of outright farce. Just turn on any TV news channel for five minutes, and it’s obvious. Things are out of control.\nSo it makes perfect sense that Selina Fillinger, one of the brilliant writers for Apple TV’s mega-hit, “The Morning Show” – a very funny and caustic skewering of cable TV news -- would turn her eye and pen to the focus of a lot of that news: the Oval Office and the creatures that inhabit it.\nThe result is the very funny “POTUS: Or Behind Every Great Dumbass Are Seven Women Trying To Keep Him Alive,” a hilarious cross between “Saturday Night Live” and “Veep”.\nFillinger’s very funny, all female-driven play will plunge the Red Barn Theatre stage into political chaos January 30 through February 24. The show will feature a Who’s Who of Key West’s top female actors, including George DiBraud, Jessica Miano Kruel, Susannah Wells, Lauren Thompson, Annie Miners, Lynne Casamayor, and Fritzie Estimond. It will be directed by the Barn’s artistic director, Joy Hawkins.\nOne of the cleverest conceits of the play is that we never see the President. We only hear about the PR nightmare he’s managed to spin into a global crisis. And it’s up to the seven brilliant and beleaguered women he relies upon most to risk their lives, their liberty, and their sanity to keep the Commander-in-Chief out of trouble.\nThere’s the super-sophisticated First Lady; the President’s sister (newly released from prison and the White House’s unofficial drug dealer); a pushy White House correspondent pursuing an interview with FLOTUS; POTUS’s meek secretary unable to cope with any of it; an outspoken, sexually-liberated young woman from a farming community who shows up and happens to have a surprising (though predictable) connection to the President; and that’s just for starters. Add in a press secretary and a Chief of Staff, and the mix gets quite volatile.\nAll these women are strong, opinionated characters, and Fillinger has them demonstrating that women in politics can be every bit as crass, brazen, bold, and – yes – deviant as the men in the halls of power. They are competent women cleaning up after incompetent men. And the result is just flat-out hilarious, filled with witty zingers and good, off-color fun – just what you’d expect from a writer of Fillinger’s abilities.\nOne important caveat: Be aware that Fillinger is not shy about using raw, crude language in her play. It’s salty, suggestive, and may be offensive to some audience members. But if you’ve already heard it all, you should be fine.\nPOTUS was written in the aftermath of the Trump years and reflects much of the chaos of that time. It was nominated in several categories in both the Drama League Awards and the Tony Awards in 2022. The Washington Post said, “The votes have been tabulated.  POTUS…is a winner!” The NY Times called it “Gleeful…a rough and tumble feminist comedy.”\nTickets for “POTUS: Or Behind Every Great Dumbass Are Seven Women Trying To Keep Him Alive” are available at redbarntheatre.com or by calling 305-296-9911. The production is sponsored in part by Sugar Loaf Lodge, Michelle Grahl of Key West Compass Realty – Keller Williams, Culture Builds Florida, and the Monroe County Tourist Development Council.\nAuthor\nSusannah Wells\nDate\nAugust 1, 2023\nTHIS ONE'S FOR THE GIRLS: THE WOMEN OF COUNTRY MUSIC\nJanuary 17 - 20, 2024\nShows at 8pm\nChristine Mild returns with a new show featuring the best of women who sing country . . . their stories and their incredible music. She sold out her Patsy Cline show last season so don't miss this one!\nStarring:\nChristine Mild\nJim Rice, Musical Director\nwith Mike Emerson on guitar, Gary Rivenson on bass, & Gary McDonald on drums\nCOUNTRY ARTIST CHRISTINE MILD RETURNS TO THE RED BARN THEATRE\nThe extraordinary songstress Christine Mild will make her long-awaited return to the Red Barn Theatre in Key West with her brand new show, “This One’s For The Girls: Women of Country Music”. The show will run for four nights only, January 17 through 20, at the Red Barn, 319 Duval Street.\nWell-known for her wildly-popular production, “Always, Patsy Cline”, Mild will be expanding her repertoire to include the top hits of close to two dozen of country music’s most fabled female artists, running from the classics of the 50’s and 60’s through to the rock-tinged hitmakers of the modern era.\n“It really grew out of the ‘Patsy’ shows,” Mild said. “I realized that all the women singers I was listening to are kind of her legacy…she was the blueprint that laid the groundwork for them to become the marquees and bring the glamour. And there’s no denying that each of the women I’m featuring in this new show has done just that.”\nMild will be offering a swath of music from some of the most successful female country artists in history, including, among many others, The Judds, Shania Twain, Tanya Tucker, Dolly Parton, Reba McEntire, Trisha Yearwood, Tammy Wynette, Taylor Swift (yes, she was originally a country artist before crossing over), Martina McBride, Little Big Town, The High Women, Casey Musgraves, and of course, the incomparable Loretta Lynn.\n“She was an inspiration,” Mild said. “She made me think about these singers and what they went through to get where they are. When you really listen to their songs, they’re filled with what those women think is important. The messages are as profound as the music.”\nMild will be weaving many of those stories into her show, an element that will make the evening much richer. “These women have always lifted each other up, and I think this show will do the same for the audience,” Mild said. “It will be toe-tapping, heartwarming, and inspiring, with songs you’ll all know.”\nMild will have a terrific band backing her up, with musical director Jim Rice on piano, Mike Emerson on guitar, Gary Rivenson on bass, and Gary McDonald on drums. “It’s a great band,” she said. “We’re going to have a blast.”\nTickets for “This One’s For The Girls: Women of Country Music” are available at redbarntheatre.com or 305-296-9911. It is highly recommended that tickets be purchased early, as Mild’s shows always sell out. Sponsored in part by Culture Builds Florida, and the Monroe County Tourist Development Council.\nAuthor\nSusannah Wells\nDate\nJuly 28, 2023\nA TUNA CHRISTMAS\nDecember 19, 2023 - January 13, 2024\nWritten By: Jaston Williams, Joe Sears & Ed Howard\nShows: Tuesdays-Saturdays at 8pm\nIn the third-smallest town in Texas, radio station OKKK news personalities report on Yuletide activities.The hilarity never lets up in this comedic romp for all seasons featuring many colorful Tuna denizens played by two very funny actors.\nStarring: Brandon Beach & David Black\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nReview of A Tuna Christmas\nAuthor\nSusannah Wells\nDate\nJuly 28, 2023\nSHORT ATTENTION SPAN THEATRE: PARALLEL UNIVERSES\nApril 7 - 29, 2023\nCollection of Short Plays\nShows: Tuesdays-Saturdays at 8pm\nOne of our always-popular favorites, “Short Attention Span Theatre, 2023” — The funny and fast-paced evening is filled with pertinent and hilarious short plays, helmed by a group of directors guiding a big handful of favorite Key West actors. You never know what you’ll see next at SAST!\nThe Red Barn Journeys to “Parallel Universes” in Short Attention Span Theatre\nThere are those who believe our universe – the one our planet and galaxy currently exist within – is but one of many such universes, involving multiple dimensions, overlapping times, and repeating histories. While that concept may be hard to wrap your head around, the Red Barn Theatre in Key West may be able to help.\nTheir perennial favorite production, “Short Attention Span Theatre”, will return to their stage April 7 – 29, with this year’s theme being “Parallel Universes”. It’s an evening of six eclectic new one-act plays, each of which will take a skewed, often hilarious, look at the world (or universes) we live – or may live -- within.\n“They’re all comedic plays, but they’re meaty,” said Mimi McDonald, who is executive producing the show. “They’ll make you laugh, but they’ll also make you think.  They’re about things that could happen, or could be, or that make you wonder about reality. The show’s colorful, lots of cool costumes, lots of good music. It’s a great evening if you’re looking for something fun and out of the ordinary.”\nMcDonald spent a lot of time finding just the right plays for this year’s show. She researched the best new short plays that have won awards from 2021 and beyond, and took advantage of her relationship with Miami’s City Theatre, which is well-known for their short play roster. Each play McDonald chose has its own world and reality, with characters and situations that not only surprise but are highly entertaining.\n“The concept of SAST is good writers, good actors, good directors,” she said. “I wanted new things by published writers. And we found them, for sure…David Ives is always good, and Laurie Allen. It’s hard to pick favorites -- they’re all terrific.”\nOnce again the entire McDonald theatrical clan – Mimi, husband Gary, daughter Amber, and son Jack – will be behind the scenes directing the various plays and creating the clever sets. They’ll be joined by Key West photographer/playwright Mike Marrero.\n“Our kids have grown up in the theater,” McDonald said, “and it’s nice to have the youthful perspective on these particular plays. And Mike’s got a real sense of humor too. The audiences are going to be laughing a lot.”\nIt’s a rich veteran cast of solid Key West favorites they’ll be directing: Susannah Wells, Erin McKenna, Arthur Crocker, Cassidy Timms, Jeremy Zoma, and Iain Wilcox. Expect them to be pushing the envelope far into the parallel universes.\nTickets for “Short Attention Span Theatre: Parallel Universes” are available at redbarntheatre.com or by calling the Red Barn box office at 305-296-9911. Ticketholders for the Opening Night performance on April 7 will be invited to join the cast and crew for a catered Opening Night Reception in the Zabar Courtyard, catered by Michelle Chennault.\nThe show is sponsored by Restorative and Aesthetic Dentistry of the Keys, Design Group Key West, and by grants from Culture Builds Florida, and the Monroe County Tourist Development Council.\nAuthor\nSusannah Wells\nDate\nAugust 5, 2022\nTHE CODE\nMarch 7 - 25, 2023\nWritten By: Michael McKeever\nShows: Tuesdays-Saturdays at 8pm\nMichael McKeever’s new play, “The Code” will grace the Red Barn stage March 7-25, as McKeever revisits one of his favorite subjects, Hollywood. It’s 1950, and Billy Haines, Henry Wilson, Tallulah Bankhead, and a beautiful young man have gathered for cocktails, caviar, and all-out war. With great humor and stinging insight, “The Code” explores the hypocrisy of what it takes to be a man in the land of make-believe. It will feature Tom Wahl, David Black, Mary Falconer, and Carlos Ortega Amorin.\nPhoto by: Roberta DePiero\nActors: (l to r) Tom Wahl, Mary Falconer, David Black, Carlos Ortega Amorin\nRED BARN BRINGS OLD HOLLYWOOD BACK WITH MICHAEL MCKEEVER’S NEWEST, “THE CODE”\nIt’s true: the more things change, the more they stay the same. Or, since we’re in today’s Florida, it might be more relevant to say that no matter the strides we’ve made over the years, there’s always someone who sees the old ways as preferable.\nWhile playwright Michael McKeever may not have set out to write a play that resonates so vibrantly with what many in our community are struggling against today, his latest play, “The Code”, running March 7-25 at Key West’s Red Barn Theatre, does just that. Written about Hollywood in the 1950’s, it is most certainly germane to the LGBTQ issues that have arisen in today’s Southernmost State.\nThe play is set in the stylish home of Billy Haines, an actual silent film megastar who left the film business for personal reasons that become apparent as the story unfolds. Haines, now a successful interior designer, has invited a few friends for cocktails before they head out to a dinner party at famed director George Cukor’s house. Those friends include the glamorous and unfiltered film star Tallulah Bankhead; the oily and unpleasant agent, Henry Willson; and Willson’s latest find (and love interest) – aspiring young actor Chad Manford.\nAs the evening unfolds, it becomes clear that the “Code” which quickly dominates the conversation refers to the surreptitious rules that Hollywood has imposed to govern the way anyone LBGTQ has to behave in order to have a career and hope to succeed in Tinseltown. It’s a 1950’s version of “Don’t Ask, Don’t Tell” seasoned with some “never admit” and a lot of “deny who you are and live a lie or go home”. To be gay in an industry policed by the Legion of Decency, the Hayes Code, and the House Un-American Activities Committee can not only get you labeled a deviant and a subversive, but it’s without doubt a death knell for a career on the silver screen.\nMcKeever’s skill with witty, very funny banter mixes perfectly with his ability to take a look at history from a different perspective. He channels Bankhead’s famous cutting wit, and nails the blackhearted Svengali a compromised agent can be. The play elicits its full share of laugh-out-loud moments in the way it looks at Old Hollywood and it’s foibles, but in the era of Florida’s “Don’t Say Gay” and overt attempts at marginalization of the LGBTQ community, it has serious moments of resonance to modern times that cannot be missed.\nThe play stars South Florida favorite Tom Wahl as Haines, Key West favorites Mary Falconer as Bankhead and David Black as Willson, and showcases newcomer Carlos Ortega Amorin as Manford. It will be directed by Christopher Renshaw, the accomplished British director who helmed the World Premiere of the play last year. Renshaw has a Tony nomination and a couple of Drama Desk Awards for his play direction, and will be directing a new play based on the life of Louis Armstrong next year on Broadway. It’s a coup to have him directing here in Key West.\nTickets for “The Code” can be purchased at redbarntheatre.com or by calling the Red Barn box office at 305-296-9911. Ticketholders for Opening Night, March 7, are invited to remain after the show for the Opening Night party, where they can mingle with the cast and crew and enjoy a light nosh.\nThe play is sponsored in part by Royal Furniture, Design Group Key West, Culture Builds Florida, and the Monroe County Tourist Development Council.\nAuthor\nSusannah Wells\nDate\nAugust 4, 2022\nFLAMING GUNS of the PURPLE SAGE\nJanuary 31 - February 25, 2023\nWritten By: Jane Martin\nShows: Tuesdays-Saturdays at 8pm\nBe ready to take a wild and crazy ride into the classic mash-up spoof of a Western-Horror “B” movie with Jane Martin’s hilarious “Flaming Guns of the Purple Sage”. Big 8, a rodeo competitor, is facing foreclosure on the Wyoming ranch where she rehabilitates injured rodeo cowboys. The arrival of a shocking woman named Shedevil and a one-eyed Ukrainian biker named Black Dog leads to violence and horror in this satire of pulp western writers like Zane Grey. It will feature George DiBraud, Susannah Wells, Cassidy Timms Iain Wilcox, Tim Dahms, and Mathias Maloff.\nView fullsize\nView fullsize\nView fullsize\n“FLAMING GUNS OF THE PURPLE SAGE” BRINGS THE OUTRAGEOUS WILD WEST TO THE RED BARN\nImagine Hopalong Cassidy trying to date Carrie, or Miss Kitty chasing Chuckie around the corral with a meat cleaver in an Addams Family version of “Gunsmoke,” and you may get close to the outrageous fun and outright craziness awaiting you in the Red Barn’s next production.\n“Flaming Guns of the Purple Sage”, written by the always-hilarious and rapier-sharp Jane Martin (“Says She”), opens January 31 and runs Tuesdays through Saturdays through February 25. It’s a preposterous mash-up of B-movie westerns and C-movie horror flicks that will literally have you laughing until you cry, even while you’re sitting in disbelief at what you’re seeing on stage.\n“I just love its audacity,” said director Joy Hawkins. “It’s unlike anything I’ve ever directed before. It’s full of macabre people you love and hate at the same time. We can’t get through a rehearsal without laughing ‘til our sides ache.”\nWithout giving away too much (because the surprises are everything in this tale), “Flaming  Guns” tells the story of Big 8, a retired rodeo star who’s trying to keep her home from being foreclosed on. Living with her is Rob Bob, a rising young rodeo star (think more Gomer Pyle than John Wayne). Into this household comes SheDevil (her choice of name) who is pregnant by Big 8’s ne’er-do-well son, Lucifer Lee. But SheDevil is being hunted down by her very angry Ukrainian biker boyfriend, Black Dog, and when he shows up, things really begin to get interesting.\n“Be aware,” Hawkins said, “that there is, indeed, a lot of violence and blood and sex all mixed in, but it’s done in a very farcical and satirical way. Be advised -- it’s definitely for adults…I wouldn’t bring the kids. But it’s a very cleverly-written send-up of those old B-movie Westerns and horror flicks. This is all fun and laughs about how crazy – in a very funny way -- human beings can be.”\nThe play stars a terrific mix of Key West’s best comedic actors, including George DiBraud, Susannah Wells, Mathias Maloff, Tim Dahms, Cassidy Timms, Iain Wilcox, and Jack McDonald. Hawkins directs and Carmen Rodriguez will be designed the western duds.\nCurtain Up called it “a crowd-pleaser that keeps the audience howling”. The Courier-Journal calls it “hilarious and rip-snortin’”, and Concord Theatricals dubs it a “shoot ‘em up, knock ‘em up, cut ‘em up comic romp.”\nRead KONK Life Review by Emily Weekley\nRead Konk Life Review by Emily Berg\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nAuthor\nSusannah Wells\nDate\nAugust 3, 2022\nBACK IN BABY'S ARMS | CHRISTINE MILD SINGS PATSY CLINE\nJanuary 18 - 21, 2023\nThis special musical event, “Back in Baby’s Arms”, features the voice and stylings of Christine Mild, who has played Patsy Cline in the popular “Always, Patsy Cline” play dozens of times, including a sold-out run at the Red Barn in 2018. Expect to hear many of Cline’s biggest hits, with the stellar accompaniment of arranger/pianist Jim Rice and trio.\nAuthor\nSusannah Wells\nDate\nAugust 2, 2022\nDear Jack, Dear Louise\nDecember 20, 2022 - January 14, 2023\nWritten By: Ken Ludwig\nShows: Tuesdays-Saturdays at 8pm\nSparks fly and love blossoms across the darkened landscape of World War II, when Jack, a U.S. Army doctor, begins a letter correspondence with Louise, an aspiring actress living a world away from his war-torn reality. The play won the Helen Hayes and Charles MacArthur award for Best New Play of 2020. It will feature Jessica Miano Kruel and Cody Borah.\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nKEN LUDWIG’S “Dear Jack, Dear Louise” OPENS THE RED BARN’S 43RD SEASON\nIn the 21st Century’s fast-paced digital culture, the personal letter, handwritten on fine stationery from one person to another, has all but disappeared -- become a lost art few seldom indulge in anymore. Emails, texts, Tweets, Instagrams, connection apps – these are the main means of communication between people in a world increasingly dominated by the code of a metaverse we no longer actually touch.\nPerhaps this was on the mind of playwright Ken Ludwig when he sat down last year to pen his Helen Hayes Award Winning play, “Dear Jack, Dear Louise.” Because the heart of the play is about just that – personal, handwritten letters that passed between a World War II Army doctor and a Broadway starlet working at the Stage Door Canteen in New York during the war. And they’re not just any letters – these were epistles that formed the joyous, heartwarming story of Ludwig’s parents’ long-distance courtship and eventual marriage.\n“Dear Jack, Dear Louise” is set to make its South Florida debut December 20th as the opening production of the Red Barn’s 43rd Season in Key West, with a run that goes through January 14th of 2023. It will star Key West favorites Jessica Miano Kruel as Louise Rabiner, an aspiring actress and dancer in New York, and Cody Borah as Captain Jack Ludwig, a military doctor then stationed in Oregon. The Barn’s Artistic Director, Joy Hawkins, will direct.\n“It’s a good, old-fashioned story,” Hawkins said. “And I think it’s special to have such an unabashed love story in these times. It takes you back. And it’s pertinent right now as we’re dealing with war in the world. It’s sweet, it’s funny, but it’s also real – these were real people, living real lives, and we’re privileged to watch how they managed to fall in love under such circumstances.”\nLudwig and Rabiner, living on opposite sides of the country in 1942, strike up a correspondence at the urging of their parents, who were old friends. They find a rapport right away – he encouraging her with auditions, she commiserating over his hardass commanding officer. It’s not all fun and games, though, as the ugly situation in the world encroaches on their connection.\nThe show isn’t schmaltzy either, in great part due to the way it’s staged, with the two characters on stage together but separately – he in his world on one side of the stage, and she in hers on the other. The beauty of the play is in the way the characters build chemistry in front of the audience’s eyes without ever looking at one another. And they’re not reading the letters – they’re living the words we understand they wrote.\n“It’s captivating to watch,” Hawkins said. “We’re not sure they’ll ever get together, but it’s a beautiful ending. I hope the audience will feel connected to their own experiences, and maybe those of their own parents.”\nThe Washington Post said the play is “…a poignant, funny tribute to the enduring power of human connection.” The Lit Arts Maven said, “One of the finest theatre experiences I have had in 25 years of reviewing.”\n“Dear Jack, Dear Louise” runs December 20 – January 14, excepting Christmas Eve and Christmas, and New Year’s Eve and New Year’s Day. Tickets are available at redbarntheatre.com/tickets or by calling 305-296-9911, 3-5 pm weekdays.\nThe Red Barn season is sponsored in part by the Monroe County Tourist Development Council, and the State of Florida Division of Cultural Affairs.\nAuthor\nSusannah Wells\nDate\nAugust 1, 2022\nHurricane Diane\nMarch 22 - April 16, 2022\nWritten By: Madeleine George\nThe hilarious HURRICANE DIANE stars Lauren Thompson, Susannah Wells, Erin McKenna, Jessica Miano Kruel, and Caroline Taylor.\nHILARIOUS “HURRICANE DIANE” BLOWING INTO THE RED BARN THEATRE\nWhat if the Greek God Dionysus, deity of wine and ecstasy, suddenly walked into your kitchen and announced that it was time mankind shaped up and started taking care of “his” planet and that you and your girlfriends were going to be the first acolytes in his quest to bring the Earth back to its natural, unsullied state? What could go wrong, right?\nThis is the reality-bending set-up for the hilarious new play, “Hurricane Diane”, set to open at the Red Barn Theatre in Key West on March 22 for a four-week run. Written by Pulitzer Prize finalist Madeleine George, the play will feature a who’s who of Key West women, including Erin McKenna, Caroline Taylor, Susannah Wells, Jessica Miano Kruel, and Lauren Thompson. It will be directed by Red Barn artistic director, Joy Hawkins.\nGeorge launches her play right from “Lights Up”. We meet Dionysus immediately, though not as we might expect. He has morphed into a rabble-rousing lesbian gardener from Vermont named Diane, and she’s chosen four suburban New Jersey housewives – think a sophisticated, socially-conscious version of a “Real Housewives” show and you won’t be far off – to join his efforts at reclaiming the natural beauty of the planet.\nThe four women all live on a cul-de-sac in flood-prone Red Bank, New Jersey in identical cookie-cutter houses. They regularly gather over wine and coffee to gossip about anything but the latest portents for the climate. There’s control freak Carol, who just wants a well-manicured lawn; and Renee, a top editor at HGTV Magazine; and Pam, an Italian dragon in animal prints; and weepy Beth, who’s just been left by her husband.\nInto this coffee klatch comes lesbian landscape gardener Diane, livid at humanity for “despoiling the green earth that gave you life.” She has great plans – not the least of which involve indulging her Dionysian proclivities – and she’s going to begin right here, right now.\nWill Diane be able to enlist them all? Will this diverse band of suburban women be inspired by the appetites of their divine visitor to unleash their wildness to help the battered planet? Maybe. Maybe not. You’ll have to see.\nTo say the play is outrageously funny is a given. But it also carries a subtextual message that has profound relevance in this day and age. Called “incisively smart and boisterously funny” by the Boston Globe, “clever and timely” by New York Theater, and “An astonishing new play” by the NY Times, “Hurricane Diane” lives up to its fantastical premise.\nTickets are available at redbarntheatre.com or by calling 305-296-9911. The play is sponsored in part by The Dogwood Foundation, Design Group Key West, and the Monroe County Tourist Development Council.\nAuthor\nSusannah Wells\nDate\nApril 16, 2022\nQuarantine For Two\nFebruary 15 - March 12, 2022\nWritten By: Hy Conrad\nA world premiere of a wickedly funny new play by Hy Conrad. Hy, the well-known Key West resident who wrote a good many of the\nMonk\nepisodes, as well as\nWhite Collar,\nand the recent hit,\nThe Good Cop,\nhas taken the trials and tribulations of our pandemic quarantine and turned them hilariously on their heads. The play mixes comedy, intrigue, (and of course) murder, and a neck-bending twist that you won't see coming.\n“QUARANTINE FOR TWO” TO PREMIERE AT RED BARN\nGod knows there hasn’t been much to laugh about the last couple of years. Pandemics tend to lean that way.\nBut thanks to Hy Conrad – the writer/producer of the very funny “Monk” series – we’ll get a chance to shake off a little of the downside of things when his new play, “Quarantine For Two”, opens a four week run on February 15th at Key West’s Red Barn Theatre. The production marks the play’s American premiere.\n“Hy and I were chatting one day,” said artistic director Joy Hawkins, “and we thought a funny play about this might be good for people, to lighten things up a bit. And who better to do that than Hy Conrad?”\nThe play centers on a typical, middle-aged, suburban couple – played by David Black and Mimi McDonald – who have been quarantining at home for more than a year. But it hasn’t gone well. In fact, they’ve driven each other crazy, to the point that each has come to the conclusion that for their own sanity, they need to kill the other. How they go about that – with the involvement of a somewhat dim and double-dealing poolboy-turned-hitman played by Rhett Kalman – leads to a very hilarious escalation of complications.\n“I tend to write toward comedy and crime,” Conrad said. “The idea of two people in lockdown who desperately want to kill each other seemed to make comic sense, if we want to make light of our fears in the moment. Balancing the truth in the Covid situation with finding the humanity in the characters and making it funny was the challenge.”\nBut Conrad makes it work exceptionally well. In a private reading of the play last summer, it was hard for the cast and crew to get through the script without breaking into laughter.\n“The last two years have been so surreal and ludicrous and crazy,” Hawkins said. “So let’s just jump in and laugh at the predicament we’ve all been in. Because somewhere in all of this, we really do need to find a laugh.”\nAnd as she said, who better than Hy Conrad to give that to us?\nTickets for “Quarantine For Two”, the second of the Red Barn’s season of “Bright and Brilliant Comedies”, are available now at redbarntheatre.com or by calling 305-296-9911.\nThe play is sponsored in part by Jane Gardner Interiors, the Florida Department of State Division of Cultural Affairs, and the Monroe County Tourist Development Council.\nAuthor\nSusannah Wells\nDate\nMarch 14, 2022\nVail Johnson \"Bassically Incorrect\"\nMarch 6 & 7, 2022\nLimited engagement — 2 nights only!\nBASSIST FOR THE STARS: VAIL JOHNSON TELLS ALL IN RED BARN LIMITED ENGAGEMENT\nYou might not recognize him on the street nor know his name, but you’ve probably seen him onstage and you’ve most certainly have heard him…probably many times.\nVail Johnson is his name, and he’s a bassist. Not just any bassist, mind you, but THE bassist when it comes to studio work, recordings, and live performance.  He’s been doing it for over 40 years with some of the top names in music, and he’s bringing a career-ful of behind-the-scenes stories and almost every note of the great music he’s had a hand in to the Red Barn Theatre in Key West.\nHis one-man show, “Bassically Incorrect: Around the World in 40 Years” will have a limited engagement at the Barn Sunday and Monday, March 6 and 7 only. Tickets are available now at redbarntheatre.com or by calling 305-296-9911.\nWant some names he’s put the bottom under? How about Kenny G, Whitney Houston, Herbie Hancock, Stevie Nicks, Keb’ Mo’, George Benson, Michael Bolton, James Ingram, Gil Scott Heron, Paula Abdul, MC Hammer, T. Graham Brown, David Cassidy, Steve Perry, Patti Austen, Peabo Bryson, Edgar Winter, and Christopher Cross, just to name a very few.\n“It just sort of happened,” Johnson said recently. “I was playing in a lounge band back in the late 70’s, and Kenny G’s percussionist sees me, brings Kenny to the gig, and the next thing I know, I’m playing in Kenny G’s band. We go to LA, and Stevie Nicks sees me at a gig, and asks me to do her record. It just snowballed from there.”\nIt wasn’t all luck, however. Johnson was ready when the door opened. The youngest of seven brothers (one of his older siblings is Key West’s Jeff Johnson), Vail was immersed in all kinds of music through his family – classical, choral, gospel, bluegrass, Dixieland, Top 40. He absorbed it all, mixing in whatever he came across, including jazz, hip-hop, metal rock, and pure improvisation. His virtuosity, passion, and humor were his calling card, and his ability to play virtually any style extremely well sealed the deal.\nAnd all of it is on display in his one-man show – from Kenny G’s, George Benson’s, and Herbie Hancock’s jazz to Steve Perry’s and Stevie Nicks’s rock, to Peabo Bryson’s soul and Keb’Mo’s blues.\n“I tell stories about the artists I’ve played and toured with, and then play and sing along with the tracks I’ve done with them or played on tour. I do some of my own stuff too. And what I do is not just ‘play bass’…people are surprised what I can do on a bass in terms of playing music. Look…it’s a guitar. It just happens to be a bass. I can make it sound like a Spanish guitar, or bluesy finger-picking, or monster slapping.”\nAsk Johnson who was the most fun he’s had with any artist, and the answer might surprise you. “Edgar Winter,” he said. “For me to play ‘Frankenstein’ with Edgar Winter? Man, that was freakin’ fun!”\nIt doesn’t matter what style of music or what particular artist you like personally – there’s a very good chance Vail Johnson will tell you a story about touring with them, or play something you’ve heard by them in his show. And odds are you’ll say, “Oh, yeah! I know that one! He played bass on that?”\nTickets for “Bassically Incorrect” are two-tiered. For the Sunday, March 6 show, all tickets are $60. For Monday night’s show, they’re $75, but that gets you an invite to the catered after-party in the Red Barn courtyard, where you can meet and talk music with Vail Johnson and enjoy some delish foods.\nYou’ll also be able to purchase some of Vail’s own CDs both evenings, the proceeds from which will be going directly to the Florida Keys SPCA.\nThis show is sponsored in part by Design Group Key West, and the Monroe County Tourist Development Council.\nAuthor\nSusannah Wells\nDate\nMarch 7, 2022\nOlder\nSHORT ATTENTION SPAN THEATRE: “ALTERNATIVE FACTS”\nApril 8 - May 3, 2025\nCollection of Short Plays\nShows: Tuesdays-Saturdays at 7:30pm\nAn evening of eclectic short plays, each a unique journey with a diverse collection of voices and stories; playwrights from all parts of the spectrum, and a wide range of styles and genres – an intriguing mix of characters who are in conflict with larger forces —from a catering job for a engagement party with a missing bride, a chance meeting on the Golden Gate bridge, two audience members that insist on World Premieres, a fiancé is put to the test when she meets her possible inlaws, two FBI agents interrogate a newscaster when a newsroom is hijacked, and one surprise ending. Always a season favorite show at the Red Barn.\nCast\n: Erin McKenna, Cassidy Timms, Nina Pilar, Mathias Maloff, Zach Franchini\nDirectors\n: Mimi McDonald, Gary McDonald, Jack McDonald, Amber McDonald Good\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nRead review\nCast of Short Attention Span Theatre: “Alternative Facts”\nRED BARN SHINES WITH “SHORT ATTENTION SPAN THEATRE”\nThere’s an old saying in theater: “When you find a gem, let it shine.”\nKey West’s Red Barn Theatre found such a gem over a decade ago, and they’ve been letting it shine in most of their seasons since. It’s called “Short Attention Span Theatre”, and it’s proven to be one of the most popular shows the theater offers each year. This season will be no different.\nIt’s a simple concept – pick a mixed slate of funny, powerful, poignant, or simply off-the-wall short plays and populate them with some of the area’s top comedic talent, then string them together for an evening of stellar fun. Each year, the Red Barn’s resident family – the McDonalds – find six or seven wonderful new plays and pull them together under a title that relates to them all. This year’s theme: “Alternative Facts”, which anyone will agree, certainly is relevant to the times.\n“One of the things I love most about Short Attention Span Theatre (SAST),” said the Red Barn’s Managing Director Mimi McDonald, “is that it gives us the opportunity to explore a number of different voices and new playwrights in one show. And it seems to many of us that the human condition is evolving right now, and these playwrights are noticing that and commenting on what’s happening in a very comedic way. And we have such great comedic actors all doing a variety of very funny characters in this one.”\nThis year’s rendition of SAST will star Erin McKenna, Mathias Maloff, Cassidy Timms, Nina Pilar, and Zach Franchini. They appear in various combinations during the evening of eclectic plays that focus on characters who are in conflict with larger forces – from a catering job for an engagement party with a missing bride; a chance meeting on the Golden Gate Bridge; two audience members who insist on world premieres; a fiancé is put to the test when she meets her possible in-laws; and two FBI agents who interrogate a newscaster when a newsroom is hijacked.\n“It’s a fast, fun evening,” said McDonald, “but there’s a message or two in there as well.”\nAs they do every year, the entire McDonald family shepherds this show to the stage, with each of them directing, building sets, handling the tech, and more. Along with Mimi are her husband Gary, and their two (now adult) children, Amber and Jack.\n“We’ve been a theater family for more than 45 years,” Mimi said. “It’s in our blood, and we have such a great time working together on this show. It’s always a big hit.” Or to put it another way – it’s a gem.\nTickets for “Short Attention Span Theatre: Alternative Facts” are available at KeysTix.com, redbarntheatre.com, or by calling the box office at 305-296-9911. Note that all curtain times are 7:30 pm.\nAuthor\nSusannah Wells\nDate\nMay 5, 2025\nBROOKLYN LAUNDRY\nMarch 4 - 29, 2025\nWritten By: John Patrick Shanley\nShows: Tuesdays-Saturdays at 7:30pm\nWritten by John  Patrick Shanley, the Pulitzer Prize- and Tony-winning author of Doubt and the Oscar®-winning writer of Moonstruck. Sometimes big things start from little things; in this case, a bag of laundry. Shanley’s latest is about three sisters, a guy who runs a laundry in Brooklyn, and the sometimes savage tricks life plays on them. Tragic and funny by turns, this story will remind you what is important in life... and the sorrow and joy of fully embracing adulthood.\nCast\n: Jessica Miano Kruel, Michael Castellano, Lauren Thompson, Donna Stabile\nDirector\n: Joy Hawkins\nMichael Castellano and Jessica Miano Kruel | Photo by Roberta DePiero\nROMANCE BLOOMS IN THE RED BARN’S CHARMING “BROOKLYN LAUNDRY” BY JOHN PATRICK SHANLEY\nIt’s been said that chance meetings are often an aphrodisiac moment out of which true love may bloom. That doesn’t guarantee it will be an easy germination, of course…just that there’s an outside chance for an acceptable blossom.\nPlaywright John Patrick Shanley endearingly lets us watch such a flowering in his latest play, “Brooklyn Laundry”, running March 4-29 at the Red Barn Theatre in Key West. Shanley, author of the romantic megahit “Moonstruck”, is a master of the charming, imperfect love story, and this play fits his model well.\n“Brooklyn Laundry” is about three sisters and a guy who runs a laundry in that New York borough. Fran is a single woman and bone-tired of being so, whose sisters each have their own crosses to bear. Trish is dealing with a threatening illness, and Susie with a dissolving marriage, and each of them is turning to Fran, who is feeling overwhelmed with it all.\nThen one day, Fran takes a bag of laundry to the cleaners in her building and runs into the owner, Owen, whose sweetly gruff adorability breaks through her protective barriers and sparks something between them. Owen, too, has had to deal with some unexpected twists in his life, but he uncharacteristically rises to and goes with the moment, asking Fran to dinner. From there on, Shanley takes us on an utterly charming and very funny ride into a story of two people trying to find balance in their lives despite the bumps that come their way.\nThe Red Barn production stars a quartet of top local actors, including Jessica Miano Kruel, Michael Castellano, Donna Stabile, and Lauren Thompson. It is directed by Joy Hawkins, the Barn’s artistic director.\n“It’s a beautiful play,” Hawkins said, “nicely written, funny, tender, and heartwarming. It does deal with some situations we sometimes have to deal with in life, and it might bring some tears here and there, but you’ll leave the theater feeling really good. It’s very life-affirming, with characters you can really root for.”\nThe New York Times called the play “Utterly charming.” The New York Theatre Guide said, “Forget the dating apps – maybe the laundromat is the place to find your next great love…”.\nTickets are available at KeysTix.com, or at redbarntheatre.com. For more information, call the box office at 305-296-9911. All shows for the March 4-29 run are at 7:30 pm. The production is sponsored in part by Florida Arts and Culture, and the Monroe County Tourist Development Council.\nAuthor\nSusannah Wells\nDate\nMarch 5, 2025\nMS HOLMES AND MS WATSON, APT 2B\nJanuary 28 - February 22, 2025\nWritten By: Kate Hamill\nShows: Tuesdays-Saturdays at 7:30pm\nAn irreverent, darkly comic, modern take on Sir Arthur Conan Doyle’s famous sleuth and sidekick, this fast-paced romp re-examines the world’s most famous detective story with a bold new feminist lens. In this highly theatrical, small-cast escapade, oddball female roommates Sherlock (yes, it’s also a girl’s name—wait, is it a girl’s name? Is it even a name?) Holmes & Joan Watson join forces to emerge from pandemic fog as a deeply codependent, quasi-dysfunctional Odd Couple adventure duo—solving mysteries and kicking butts, until they come face to face with a villain who seems to have all of the answers.\nWinner of the Off-Broadway Alliance Award\nCast\n: Susannah Wells, Mariah Woessner, Arthur Crocker, Morgan Fraga Pierson\nDirector\n: Mimi McDonald\nCostumes\nby Sushi\nMariah Woessner and Susannah Wells | Photo by Roberta DePiero\nMYSTERY ABOUNDS IN RED BARN’S “MS. HOLMES, MS. WATSON, APT.2B”\nEveryone loves a good mystery. And who better to confound us with one than Sir Arthur Conan Doyle, who then sends his most famous detective, Sherlock Holmes, to unravel even the most convoluted of mysteries for us?\nAh, but there’s a hilarious rub in all of this! In the Red Barn Theatre’s latest offering of their 45th remarkable season – “Ms. Holmes, Ms. Watson, Apt. 2B”, running January 28 through February 22 – we are presented with a tale that cheerfully desecrates the stories of Conan Doyle in a most unusual and very funny way.\nBecause in Kate Hamill’s energetic play, the world’s most famous detective is a frazzled female police consultant whose dazzling deductions astound everyone. She takes on a new roommate – a wayward American who Holmes determines is running from a past where she used to be a doctor and needs a little help and refocusing. Portrayed as a deeply co-dependent, quasi-dysfunctional Odd Couple, this duo proceeds into a fast-paced and wildly entertaining romp through multiple violent crimes that all seem to lead to notorious villains.\nThe pair solve a variety of these crimes, from the murder of a man found in a motel to the case of a right-wing politician who cheated on his wife. It’s a blend of classic theater and modern comedy that balances mystery with laugh-out-loud humor, playfully dismantling and, at the same time, celebrating the conventions of Conan Doyle’s stories.\n“We’re really having a good time,“ said director Mimi McDonald. “The intimacy of the Red Barn allows the audience to take the ride with the actors. At the heart of it is a real mystery, with twists and turns, and a few real surprises. We know the audience is going to have a ball solving the mystery right along with us.”\nSusannah Wells, one of Key West’s best comedic actresses, stars as Ms. Sherlock Holmes, and Mariah Woessner is the perfect complement as Ms./Doctor Watson. Joining them and playing a number of unexpected and mysterious/villainous characters are Arthur Crocker and Morgan Fraga Pierson, both no slouches when it comes to comedic chops.\n”One thing I’m sure everyone will love are the costumes,” said McDonald, who commissioned iconic Key West costumer Gary Marion – better known as Sushi – to create original costumes for the play. “They’re really something – a kind of apocalyptic theme and a warrior vibe, that adds another whole dimension to the story.”\nCalled “…laugh-out-loud funny, incredibly clever, inherently theatrical, and a delight from start to finish..” and “…sharp, playful, and moves at a rapid-fire pace…” by the Portland Monthly, “Ms. Holmes, Ms. Watson, Apt. 2B” is a great way to spend an evening deducting, finding clues, and solving mysteries. The game’s afoot!\nRunning January 28 through February 22. All curtains are at 7:30 pm. Tickets at keystix.com. For more information, call the Red Barn box office at 305-296-9911.\nSponsored in part by the William L. Monroe III Foundation, and the Monroe County Tourist Development Council.\nAuthor\nSusannah Wells\nDate\nFebruary 1, 2025\nGERRI LOUISE STANDUP: SENIOR MOMENTS OR WHAT THE HELL HAPPENED?\nFebruary 16 & 17, 2025\nLimited engagement — 2 nights only!\nShows at 7:30pm\nIf there’s a funnier woman living and working in Key West theatre, we’d like to meet her. Gerri Louise can make you laugh in one second, with one word. With an astute eye, an always-open ear, and a quick mind, it just comes naturally to her. She’s graced all our stages – in both straight plays and her own stand-up comedy. These two special nights of comedy feature an all-new basket of classic Gerri Louise. Of her comic perspective, Gerri says,  \"You have to make the littlest things in life funny for yourself...make them all a celebration, no matter what they are. That way every day is a good day and you go to sleep having smiled all day.”\nAuthor\nSusannah Wells\nDate\nJanuary 31, 2025\nVAIL JOHNSON IS BASSICALLY INCORRECT | ALL NEW SHOW!\nFebruary 9 & 10, 2025\nLimited engagement — 2 nights only!\nShows at 7:30pm\nBASSIST FOR THE STARS: VAIL JOHNSON TELLS ALL IN RED BARN LIMITED ENGAGEMENT\nYou might not recognize him on the street nor know his name, but you’ve probably seen him onstage and you’ve most certainly have heard him…probably many times.\nVail Johnson is his name, and he’s a bassist. Not just any bassist, mind you, but THE bassist when it comes to studio work, recordings, and live performance.  He’s been doing it for over 40 years with some of the top names in music, and he’s bringing a career-ful of behind-the-scenes stories and almost every note of the great music he’s had a hand in to the Red Barn Theatre in Key West.\nWant some names he’s put the bottom under? How about Kenny G, Whitney Houston, Herbie Hancock, Stevie Nicks, Keb’ Mo’, George Benson, Michael Bolton, James Ingram, Gil Scott Heron, Paula Abdul, MC Hammer, T. Graham Brown, David Cassidy, Steve Perry, Patti Austen, Peabo Bryson, Edgar Winter, and Christopher Cross, just to name a very few.\n“It just sort of happened,” Johnson said recently. “I was playing in a lounge band back in the late 70’s, and Kenny G’s percussionist sees me, brings Kenny to the gig, and the next thing I know, I’m playing in Kenny G’s band. We go to LA, and Stevie Nicks sees me at a gig, and asks me to do her record. It just snowballed from there.”\nIt wasn’t all luck, however. Johnson was ready when the door opened. The youngest of seven brothers (one of his older siblings is Key West’s Jeff Johnson), Vail was immersed in all kinds of music through his family – classical, choral, gospel, bluegrass, Dixieland, Top 40. He absorbed it all, mixing in whatever he came across, including jazz, hip-hop, metal rock, and pure improvisation. His virtuosity, passion, and humor were his calling card, and his ability to play virtually any style extremely well sealed the deal.\nAnd all of it is on display in his one-man show – from Kenny G’s, George Benson’s, and Herbie Hancock’s jazz to Steve Perry’s and Stevie Nicks’s rock, to Peabo Bryson’s soul and Keb’Mo’s blues.\n“I tell stories about the artists I’ve played and toured with, and then play and sing along with the tracks I’ve done with them or played on tour. I do some of my own stuff too. And what I do is not just ‘play bass’…people are surprised what I can do on a bass in terms of playing music. Look…it’s a guitar. It just happens to be a bass. I can make it sound like a Spanish guitar, or bluesy finger-picking, or monster slapping.”\nAsk Johnson who was the most fun he’s had with any artist, and the answer might surprise you. “Edgar Winter,” he said. “For me to play ‘Frankenstein’ with Edgar Winter? Man, that was freakin’ fun!”\nIt doesn’t matter what style of music or what particular artist you like personally – there’s a very good chance Vail Johnson will tell you a story about touring with them, or play something you’ve heard by them in his show. And odds are you’ll say, “Oh, yeah! I know that one! He played bass on that?”\nAuthor\nSusannah Wells\nDate\nJanuary 30, 2025\nA LITTLE BIT COUNTRY, A LITTLE BIT ROCK N ROLL\nJanuary 15 - 18, 2025\nShows at 7:30pm\nChristine Mild returns with a new knockout \u0003show featuring the women who sing Country AND Rock n Roll.\nStarring:\nChristine Mild\nJim Rice, Musical Director & Piano\nGary Rivenson, Bass Guitar\nGary McDonald, Drums\nMatt Backer, Guitar\nVOCALIST CHRISTINE MILD RETURNS TO THE RED BARN WITH A STELLAR NEW SHOW\nVocalist Christine Mild, who has wowed Red Barn audiences for the last several years with her “Always, Patsy Cline” and “Women of Country Music” shows, will be returning to the Barn January 15-18 with her brand new show, “A Little Bit Country, A Little Bit Rock ‘n’ Roll.” All show times are 7:30 pm.\nWhile Mild’s heart has always rested in country music, she says she always tries to bring “a little something new” to each of her stops in Key West, and this year will be no different.\n“I’ll never stray too far from country music, of course,” Mild said, “but with this new show, we’re going to be expanding the boundaries a little bit, which has been happening in the music business over the last couple of years, with Dolly Parton releasing a rock album, and Beyonce and Lady Gaga releasing country albums. The lines are getting blurred and an awful lot of good music is coming out.”\nMild said she’ll still be featuring country touchstones, focusing on female artists like Faith Hill, Carrie Underwood, Jody Messina, and Shania Twain, but “we’ll be adding in friends like Bonnie Raitt, Linda Ronstadt, Patty Smith, and even some Heart. It’s all great music.”\nAnd as usual, Mild will have a kickin’ band with her, featuring her regular sidemen – Jim Rice on keyboards, Gary Rivenson on bass, and Gary McDonald on drums. But she’s expanding the group for this show with some top-level name players. She’s bringing in British guitarist Matt Backer, who’s played with a number of top recording artists. And one of her best friends, Chicago vocalist Erin Parker, will be on stage to add the extra dimension of another female voice for harmonies. The sound will be bigger and richer, more a concert event than a small group.\n“I always want to bring Key West something new, and this is going to be an awesome show, given all the new pieces in the band and the music that we’ll be doing. You’re going to know a lot of this music, but we’ll surprise you with a few new things I know you’re going to like.”\nTickets are available now for the best seats at keystix.com or redbarntheatre.com. For more information, visit the website or call 305-296-9911. Remember that all shows at the Red Barn now have a curtain time of 7:30 pm. Sponsored in part by William L. and Pattye Monroe III, and the Monroe Country Tourist Development Council.\nAuthor\nSusannah Wells\nDate\nJanuary 29, 2025\nTHE FOREIGNER\nDecember 18, 2024 - January 11, 2025\nWritten By: Larry Shue\nShows at 7:30pm\nThe scene is a fishing lodge in rural Georgia often visited by “Froggy” LeSueur, a British demolition expert who occasionally runs training sessions at a nearby army base. This time “Froggy” has brought along a friend, a pathologically shy young man named Charlie who is overcome with fear at the thought of making conversation with strangers. So “Froggy,” before departing, tells all assembled that Charlie is from an exotic foreign country and speaks no English. Once alone the fun really begins, as Charlie overhears more than he should—the evil plans of a sinister, two-faced minister and his redneck associate; the fact that the minister’s pretty fiancée is pregnant; and many other damaging revelations made with the thought that Charlie doesn’t understand a word being said. That he does fuels the nonstop hilarity of the play and sets up the wildly funny climax in which things go uproariously awry for the “bad guys,” and the “good guys” emerge triumphant.\nWinner of the Outer Critics Circle Award for Outstanding Off-Broadway Play.\nCast\n: David Black, Annie Miners, Cassidy Timms, Brian Robinson, Thomas Masat, Chase Naylor, and Iain Wilcox\nDirector\n: Joe Kinosian, the lauded Chicago Theatre director\nRED BARN LANDMARK 45TH SEASON OPENS WITH THE HILARIOUS “THE FOREIGNER”\nKey West’s venerable Red Barn Theatre opens its 45th season literally with a bang and a houseful of laughs when it presents a new production of Larry Shue’s hilarious, award-winning “The Foreigner”, opening Wednesday, December 18th  and running through January 11 next year. All shows will be at the theater’s new curtain time of 7:30 pm.\nThe season also marks a milestone for the Red Barn’s Mimi and Gary McDonald and Joy Hawkins, who have guided the small but well-respected playhouse for all of its nearly half a century, an accomplishment rarely achieved in today’s theatrical landscape. Notables who have worked with them at the Barn through the years include Tennessee Williams, Shel Silverstein, Tony Roberts, Paul Cotton, Terri White, and a dozen other names that have made their larger marks in the entertainment industry.\n“We’re really excited about this upcoming forty-fifth season,” said Joy Hawkins, the Barn’s artistic director. “It’s an eclectic and surprising season -- funny and deep and particularly right for these times. “\n“The Foreigner”, winner of two Obie Awards and the Outer Critics Circle Award, uses the clever conceit of the audience knowing more than the characters on stage to create its fun, while also weaving in rich elements of suspense and a little mystery as the story plays out.\nThe scene is a fishing lodge in rural Georgia often visited by “Froggy” LeSueur, a British demolition expert who occasionally runs training sessions at a nearby army base. This time Froggy has brought along a friend, a pathologically shy man named Charlie who is overcome with fear at the thought of making conversation with strangers. So before departing, Froggy tells all assembled that Charlie is from an exotic foreign country and speaks no English. Once alone, the fun really begins, as Charlie overhears more than he should from those who feel secure he doesn’t understand a word being said. That he does fuels the nonstop hilarity of the play and sets up the wildly funny climax in which things go uproariously awry for the bad guys, and the good guys emerge triumphant.\n“The Foreigner” stars David Black, Chase Naylor, Cassidy Timms, Thomas Masat, Brian Robinson, and Iain Wilcox. It will be directed by Joe Kinosian, who Key West theater buffs will remember as the writer and star of “Murder For Two”, the outrageous and very funny two-man show that played the Red Barn in 2017. Kinosian, invited by artistic director Joy Hawkins to return and direct this opening show, is thrilled to be back in Key West.\n“It’s a hilarious and very funny play – probably one of the funniest ever written,” Kinosian said, “but it’s also one of the most moving stories I’ve seen. The audience will be surprised by how much they like the characters and are rooting for them against all odds. It’s one of a kind.”\nThe New Yorker said “The Foreigner is once comic surprise after another.” And The Village Voice said of the play, “It’s a constant invitation to laugh at the foolishness of life.”\nSubscriptions and single show tickets are now on sale for “The Foreigner” and the Red Barn’s entire season at KeysTix.com, redbarntheatre.com, or by calling the box office at 302-296-9911.\nBe aware that for this new season, the Red Barn has set curtain time at 7:30 pm for all shows\n.\nAuthor\nSusannah Wells\nDate\nAugust 5, 2024\nTHE LIFESPAN OF A FACT\nApril 9 - 27, 2024\nWritten By: Jeremy Kareken, David Murrell & Gordon Farrell\nShows: Tuesdays-Saturdays at\n7pm\nWith a deadline looming, a talented writer, a desperate magazine editor and a young aggressive fact checker go head to head in this oh-so-funny and gripping dispute over factual truth vs. the beauty of literary dishonesty.\nStarring:\nDave Bootle as John D’Agata, the writer\nRita Troxel as Emily Penrose, the magazine editor\nCody Borah as Jim Fingal, the fact checker\nRED BARN’S “LIFESPAN OF A FACT” HAS RELEVANCE FAR BEYOND A VERY FUNNY STAGE PLAY\nCast from left to right: Cody Borah, Rita Troxel, Dave Bootle\nIn a world where war, disease, famine, diversity, equality, AI, and God knows what else is piled on the plate in front of us, there may be one issue in that stew of concerns that trumps them all: Is any of what we’re being told in the media about\nanything\nentirely true?\nIn the final main stage production of their remarkable 44th season, the Red Barn Theatre in Key West takes this controversy head on with “Lifespan of a Fact”, an intriguing and humorous offering that has obvious relevance in this era of alternative facts. The play, written by Jeremy Kareken, David Murrell, and Gordon Farrell, runs April 9 – 27, and is adapted from a 2012 book by the real men portrayed in the play about a real incident in Nevada.\nThe play stars top local actors Dave Bootle, Cody Borah, and Rita Troxel. It’s directed by the Barn’s artistic director, Joy Hawkins. And be advised: All curtain times are 7 pm instead of the normal 8 pm.\n“It’s a very unique play,” said Hawkins. “I can’t compare it to anything else. It’s not a tie-it-up-in-a-bow kind of theater. You have to figure out for yourself what you think.”\nThe story starts off innocuously enough – Jim is a fresh-out-of-Harvard, eager beaver fact checker hired by Emily, a struggling magazine’s top editor, to fact-check an article submitted by the well-known and talented writer, John. The piece is centered around an indisputable incident: a 16-year-old boy is dead, having jumped from the observation deck of Las Vegas’ Stratosphere Hotel and Casino. Beyond that is where things get sticky.\nTurns out John has inserted unnecessary lies into his work under the guise of “artistic license” – for instance, was the casino deck actually 1100 feet high or far shorter, and did the boy’s death connect with other phenomena that day – like banned lap dances, the world’s oldest Tabasco bottle, or a tic-tac-toe-playing chicken named Ginger?\n“I’m not interested in accuracy,” says John. “I’m interested in truth.” And woe to anyone who calls his shattering essay an “article”. He is not cool with anyone tampering with his copy, insisting that 100 percent accuracy in names, dates, and specific incidents is less important than rhythm, music, and beauty in the language.\nBut Jim – out to prove himself – is not having any of it, and poor Emily is caught in the middle, concerned only with saving her magazine and knowing a sensational piece by the acclaimed John could prop up shrinking ad sales and disappearing subscriptions. What should she do?\nThe action is brisk, with plenty of sharp and funny repartee, sometimes unfolding like a taut thriller, but always coming back to the main question – do you undermine yourself by fiddling with the facts, or do you allow whatever is necessary to find the “higher truth” – the music of a boy’s tragic death?\nWho’s to say which one of them is speaking the kind of truth that really matters? You’ll have to decide for yourself.\nThe Washington Post called the play “buoyantly literate…briskly entertaining.”  Variety said “…terrifically funny dialogue…the debate at the heart of the play demands serious attention.”\nTickets for “Lifespan of a Fact” are available at redbarntheatre.com or by calling 305-296-9911. Remember that all curtain times are 7 pm.\nThe show is sponsored in part by Design Key West, Culture Builds Florida, and the Monroe County Tourist Development Council.\nAuthor\nSusannah Wells\nDate\nAugust 5, 2023\nTHE THANKSGIVING PLAY\nMarch 5 - March 30, 2024\nWritten By: Larissa FastHorse\nShows: Tuesdays-Saturdays at 8pm\nA group of terminally \"woke\" teaching artists scramble to create a pageant that somehow celebrates both Turkey Day and Native American Heritage Month. A hilarious, clever and delicious roasting of good intentions and absurd assumptions.\nStarring: Elena Devers, Arthur Crocker, Jeremy Zoma, & Nina Pilar\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nReview of THE THANKSGIVING PLAY\nPlaywright Larissa Fasthorse\nFrom Left to Right: Elena Devers, Arthur Crocker, Director Mimi McDonald, Jeremy Zoma, Nina Pilar\nRED BARN’S “THE THANKSGIVING PLAY” TAKES A HILARIOUS ‘WOKE’ LOOK AT OUR ICONIC HISTORY\nWe hear a lot about “wokeness” in the heady world of national politics these days. It’s usually pretty serious stuff, with each side slamming the other for either having too much of it, or not having enough. But what happens when you bring that thorny issue down to the common earth of everyday people?\nWell, we’re about to find out in a very funny way when Key West’s Red Barn Theatre stages “The Thanksgiving Play” as the third mainstage production of their remarkable 44th season. The show opens March 5 and will run Tuesdays to Saturdays through the 30th.\nThe play was written by Larissa Fasthorse, a member of the Sicangu Lakota Nation, and the first female Native American playwright to have a show on Broadway when it premiered at the Helen Hayes Theatre in New York. It won a Drama League Award in 2023.\nIt’s a simple premise: a group of white theater nerds meet in an elementary school classroom to put together a dramatic rendition of the Thanksgiving story for their young students – the one we’ve always been told about the Pilgrims and the “Indians” and the turkey and the corn. But when the supposed Indigenous professional actress they hire turns out to be anything but, everything plunges headlong into hilarious absurdity as the hopelessly woke whites try to fashion a play that ultimately has nothing to do with the actual unsavory history of that occasion, and is completely devoid of any insight into a Native American perspective on it.\n“It’s very funny,” said director Mimi McDonald. “It brings home how we really don’t know what to do with what actual history – as opposed to the glossed-up stories – tells us really happened. The takeaway is that we’re all just trying to figure things out, and it can get really funny and absurd as we do.”\nFasthorse herself has said she hopes the audience – while entertained by the laughter – will walk away with more questions than answers. But the main point she wants to cut through the laughter is this: “Doing nothing is not adequate anymore,” she says. “Stepping away because it’s too complicated can no longer be considered a part of any kind of solution.” This sentiment is brought to side-splitting life in her show’s audacious climax, which, for the sake of not spoiling the hilarity of it, will not be revealed here.\nEntertainment Weekly said the play is “…a good dark comedy that makes you laugh, makes you think, makes you mad, makes your brain explode.” The Hollywood Reporter called it “Very, very funny…”.\nTickets are available at redbarntheatre.com or by calling 305-296-9911 and are already selling quickly. Ticketholders for the March 5 Opening Night will be invited to a catered Opening Night reception with the cast and crew.\n“The Thanksgiving Play” is sponsored in part by Key West Compass Realty – Keller Williams, Culture Builds Florida, and the Monroe County Tourist Development Council.\nAuthor\nSusannah Wells\nDate\nAugust 2, 2023\nPOTUS: Or, Behind Every Great Dumbass Are Seven Women Trying To Keep Him Alive\nJanuary 30 - February 24, 2024\nWritten By: Selina Fillinger\nShows: Tuesdays-Saturdays at 8pm\nNOTICE ABOUT POTUS: This very funny play has language that is irreverent, bawdy, racy, sexual, smutty and gleefully filthy.\nOne four-letter word is about to rock the White House into a global crisis. Seven brilliant and beleaguered women risk life and sanity to keep POTUS out of trouble in this gleefully filthy and outrageously funny farce. A recent Broadway smash hit!\nStarring:\nGeorge diBraud as Harriet, his chief of staff\nLauren Thompson as Jean, his press secretary\nJessica Miano Kruel as Stephanie, his secretary\nSusannah Wells as Dusty, his dalliance\nAnnie Miners as Bernadette, his sister\nFritzie Estimond as Chris, a journalist\nLynne Casamayor as Margaret, his wife, The First Lady\nStage Manager: Rex Pierson\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nReview of POTUS\nCast of POTUS: Fritzie Estimond, George diBraud, Annie Miners, Lynne Casamayor, Jessica Miano Kruel, Lauren Thompson, & Susannah Wells\nRED BARN’S “POTUS” IS ONE VERY FUNNY FEMALE-DRIVEN TOUR-DE-FORCE\nIt would be hard to deny that politics in this day and age has pretty much distilled itself down into a daily dose of outright farce. Just turn on any TV news channel for five minutes, and it’s obvious. Things are out of control.\nSo it makes perfect sense that Selina Fillinger, one of the brilliant writers for Apple TV’s mega-hit, “The Morning Show” – a very funny and caustic skewering of cable TV news -- would turn her eye and pen to the focus of a lot of that news: the Oval Office and the creatures that inhabit it.\nThe result is the very funny “POTUS: Or Behind Every Great Dumbass Are Seven Women Trying To Keep Him Alive,” a hilarious cross between “Saturday Night Live” and “Veep”.\nFillinger’s very funny, all female-driven play will plunge the Red Barn Theatre stage into political chaos January 30 through February 24. The show will feature a Who’s Who of Key West’s top female actors, including George DiBraud, Jessica Miano Kruel, Susannah Wells, Lauren Thompson, Annie Miners, Lynne Casamayor, and Fritzie Estimond. It will be directed by the Barn’s artistic director, Joy Hawkins.\nOne of the cleverest conceits of the play is that we never see the President. We only hear about the PR nightmare he’s managed to spin into a global crisis. And it’s up to the seven brilliant and beleaguered women he relies upon most to risk their lives, their liberty, and their sanity to keep the Commander-in-Chief out of trouble.\nThere’s the super-sophisticated First Lady; the President’s sister (newly released from prison and the White House’s unofficial drug dealer); a pushy White House correspondent pursuing an interview with FLOTUS; POTUS’s meek secretary unable to cope with any of it; an outspoken, sexually-liberated young woman from a farming community who shows up and happens to have a surprising (though predictable) connection to the President; and that’s just for starters. Add in a press secretary and a Chief of Staff, and the mix gets quite volatile.\nAll these women are strong, opinionated characters, and Fillinger has them demonstrating that women in politics can be every bit as crass, brazen, bold, and – yes – deviant as the men in the halls of power. They are competent women cleaning up after incompetent men. And the result is just flat-out hilarious, filled with witty zingers and good, off-color fun – just what you’d expect from a writer of Fillinger’s abilities.\nOne important caveat: Be aware that Fillinger is not shy about using raw, crude language in her play. It’s salty, suggestive, and may be offensive to some audience members. But if you’ve already heard it all, you should be fine.\nPOTUS was written in the aftermath of the Trump years and reflects much of the chaos of that time. It was nominated in several categories in both the Drama League Awards and the Tony Awards in 2022. The Washington Post said, “The votes have been tabulated.  POTUS…is a winner!” The NY Times called it “Gleeful…a rough and tumble feminist comedy.”\nTickets for “POTUS: Or Behind Every Great Dumbass Are Seven Women Trying To Keep Him Alive” are available at redbarntheatre.com or by calling 305-296-9911. The production is sponsored in part by Sugar Loaf Lodge, Michelle Grahl of Key West Compass Realty – Keller Williams, Culture Builds Florida, and the Monroe County Tourist Development Council.\nAuthor\nSusannah Wells\nDate\nAugust 1, 2023\nTHIS ONE'S FOR THE GIRLS: THE WOMEN OF COUNTRY MUSIC\nJanuary 17 - 20, 2024\nShows at 8pm\nChristine Mild returns with a new show featuring the best of women who sing country . . . their stories and their incredible music. She sold out her Patsy Cline show last season so don't miss this one!\nStarring:\nChristine Mild\nJim Rice, Musical Director\nwith Mike Emerson on guitar, Gary Rivenson on bass, & Gary McDonald on drums\nCOUNTRY ARTIST CHRISTINE MILD RETURNS TO THE RED BARN THEATRE\nThe extraordinary songstress Christine Mild will make her long-awaited return to the Red Barn Theatre in Key West with her brand new show, “This One’s For The Girls: Women of Country Music”. The show will run for four nights only, January 17 through 20, at the Red Barn, 319 Duval Street.\nWell-known for her wildly-popular production, “Always, Patsy Cline”, Mild will be expanding her repertoire to include the top hits of close to two dozen of country music’s most fabled female artists, running from the classics of the 50’s and 60’s through to the rock-tinged hitmakers of the modern era.\n“It really grew out of the ‘Patsy’ shows,” Mild said. “I realized that all the women singers I was listening to are kind of her legacy…she was the blueprint that laid the groundwork for them to become the marquees and bring the glamour. And there’s no denying that each of the women I’m featuring in this new show has done just that.”\nMild will be offering a swath of music from some of the most successful female country artists in history, including, among many others, The Judds, Shania Twain, Tanya Tucker, Dolly Parton, Reba McEntire, Trisha Yearwood, Tammy Wynette, Taylor Swift (yes, she was originally a country artist before crossing over), Martina McBride, Little Big Town, The High Women, Casey Musgraves, and of course, the incomparable Loretta Lynn.\n“She was an inspiration,” Mild said. “She made me think about these singers and what they went through to get where they are. When you really listen to their songs, they’re filled with what those women think is important. The messages are as profound as the music.”\nMild will be weaving many of those stories into her show, an element that will make the evening much richer. “These women have always lifted each other up, and I think this show will do the same for the audience,” Mild said. “It will be toe-tapping, heartwarming, and inspiring, with songs you’ll all know.”\nMild will have a terrific band backing her up, with musical director Jim Rice on piano, Mike Emerson on guitar, Gary Rivenson on bass, and Gary McDonald on drums. “It’s a great band,” she said. “We’re going to have a blast.”\nTickets for “This One’s For The Girls: Women of Country Music” are available at redbarntheatre.com or 305-296-9911. It is highly recommended that tickets be purchased early, as Mild’s shows always sell out. Sponsored in part by Culture Builds Florida, and the Monroe County Tourist Development Council.\nAuthor\nSusannah Wells\nDate\nJuly 28, 2023\nA TUNA CHRISTMAS\nDecember 19, 2023 - January 13, 2024\nWritten By: Jaston Williams, Joe Sears & Ed Howard\nShows: Tuesdays-Saturdays at 8pm\nIn the third-smallest town in Texas, radio station OKKK news personalities report on Yuletide activities.The hilarity never lets up in this comedic romp for all seasons featuring many colorful Tuna denizens played by two very funny actors.\nStarring: Brandon Beach & David Black\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nReview of A Tuna Christmas\nAuthor\nSusannah Wells\nDate\nJuly 28, 2023\nSHORT ATTENTION SPAN THEATRE: PARALLEL UNIVERSES\nApril 7 - 29, 2023\nCollection of Short Plays\nShows: Tuesdays-Saturdays at 8pm\nOne of our always-popular favorites, “Short Attention Span Theatre, 2023” — The funny and fast-paced evening is filled with pertinent and hilarious short plays, helmed by a group of directors guiding a big handful of favorite Key West actors. You never know what you’ll see next at SAST!\nThe Red Barn Journeys to “Parallel Universes” in Short Attention Span Theatre\nThere are those who believe our universe – the one our planet and galaxy currently exist within – is but one of many such universes, involving multiple dimensions, overlapping times, and repeating histories. While that concept may be hard to wrap your head around, the Red Barn Theatre in Key West may be able to help.\nTheir perennial favorite production, “Short Attention Span Theatre”, will return to their stage April 7 – 29, with this year’s theme being “Parallel Universes”. It’s an evening of six eclectic new one-act plays, each of which will take a skewed, often hilarious, look at the world (or universes) we live – or may live -- within.\n“They’re all comedic plays, but they’re meaty,” said Mimi McDonald, who is executive producing the show. “They’ll make you laugh, but they’ll also make you think.  They’re about things that could happen, or could be, or that make you wonder about reality. The show’s colorful, lots of cool costumes, lots of good music. It’s a great evening if you’re looking for something fun and out of the ordinary.”\nMcDonald spent a lot of time finding just the right plays for this year’s show. She researched the best new short plays that have won awards from 2021 and beyond, and took advantage of her relationship with Miami’s City Theatre, which is well-known for their short play roster. Each play McDonald chose has its own world and reality, with characters and situations that not only surprise but are highly entertaining.\n“The concept of SAST is good writers, good actors, good directors,” she said. “I wanted new things by published writers. And we found them, for sure…David Ives is always good, and Laurie Allen. It’s hard to pick favorites -- they’re all terrific.”\nOnce again the entire McDonald theatrical clan – Mimi, husband Gary, daughter Amber, and son Jack – will be behind the scenes directing the various plays and creating the clever sets. They’ll be joined by Key West photographer/playwright Mike Marrero.\n“Our kids have grown up in the theater,” McDonald said, “and it’s nice to have the youthful perspective on these particular plays. And Mike’s got a real sense of humor too. The audiences are going to be laughing a lot.”\nIt’s a rich veteran cast of solid Key West favorites they’ll be directing: Susannah Wells, Erin McKenna, Arthur Crocker, Cassidy Timms, Jeremy Zoma, and Iain Wilcox. Expect them to be pushing the envelope far into the parallel universes.\nTickets for “Short Attention Span Theatre: Parallel Universes” are available at redbarntheatre.com or by calling the Red Barn box office at 305-296-9911. Ticketholders for the Opening Night performance on April 7 will be invited to join the cast and crew for a catered Opening Night Reception in the Zabar Courtyard, catered by Michelle Chennault.\nThe show is sponsored by Restorative and Aesthetic Dentistry of the Keys, Design Group Key West, and by grants from Culture Builds Florida, and the Monroe County Tourist Development Council.\nAuthor\nSusannah Wells\nDate\nAugust 5, 2022\nTHE CODE\nMarch 7 - 25, 2023\nWritten By: Michael McKeever\nShows: Tuesdays-Saturdays at 8pm\nMichael McKeever’s new play, “The Code” will grace the Red Barn stage March 7-25, as McKeever revisits one of his favorite subjects, Hollywood. It’s 1950, and Billy Haines, Henry Wilson, Tallulah Bankhead, and a beautiful young man have gathered for cocktails, caviar, and all-out war. With great humor and stinging insight, “The Code” explores the hypocrisy of what it takes to be a man in the land of make-believe. It will feature Tom Wahl, David Black, Mary Falconer, and Carlos Ortega Amorin.\nPhoto by: Roberta DePiero\nActors: (l to r) Tom Wahl, Mary Falconer, David Black, Carlos Ortega Amorin\nRED BARN BRINGS OLD HOLLYWOOD BACK WITH MICHAEL MCKEEVER’S NEWEST, “THE CODE”\nIt’s true: the more things change, the more they stay the same. Or, since we’re in today’s Florida, it might be more relevant to say that no matter the strides we’ve made over the years, there’s always someone who sees the old ways as preferable.\nWhile playwright Michael McKeever may not have set out to write a play that resonates so vibrantly with what many in our community are struggling against today, his latest play, “The Code”, running March 7-25 at Key West’s Red Barn Theatre, does just that. Written about Hollywood in the 1950’s, it is most certainly germane to the LGBTQ issues that have arisen in today’s Southernmost State.\nThe play is set in the stylish home of Billy Haines, an actual silent film megastar who left the film business for personal reasons that become apparent as the story unfolds. Haines, now a successful interior designer, has invited a few friends for cocktails before they head out to a dinner party at famed director George Cukor’s house. Those friends include the glamorous and unfiltered film star Tallulah Bankhead; the oily and unpleasant agent, Henry Willson; and Willson’s latest find (and love interest) – aspiring young actor Chad Manford.\nAs the evening unfolds, it becomes clear that the “Code” which quickly dominates the conversation refers to the surreptitious rules that Hollywood has imposed to govern the way anyone LBGTQ has to behave in order to have a career and hope to succeed in Tinseltown. It’s a 1950’s version of “Don’t Ask, Don’t Tell” seasoned with some “never admit” and a lot of “deny who you are and live a lie or go home”. To be gay in an industry policed by the Legion of Decency, the Hayes Code, and the House Un-American Activities Committee can not only get you labeled a deviant and a subversive, but it’s without doubt a death knell for a career on the silver screen.\nMcKeever’s skill with witty, very funny banter mixes perfectly with his ability to take a look at history from a different perspective. He channels Bankhead’s famous cutting wit, and nails the blackhearted Svengali a compromised agent can be. The play elicits its full share of laugh-out-loud moments in the way it looks at Old Hollywood and it’s foibles, but in the era of Florida’s “Don’t Say Gay” and overt attempts at marginalization of the LGBTQ community, it has serious moments of resonance to modern times that cannot be missed.\nThe play stars South Florida favorite Tom Wahl as Haines, Key West favorites Mary Falconer as Bankhead and David Black as Willson, and showcases newcomer Carlos Ortega Amorin as Manford. It will be directed by Christopher Renshaw, the accomplished British director who helmed the World Premiere of the play last year. Renshaw has a Tony nomination and a couple of Drama Desk Awards for his play direction, and will be directing a new play based on the life of Louis Armstrong next year on Broadway. It’s a coup to have him directing here in Key West.\nTickets for “The Code” can be purchased at redbarntheatre.com or by calling the Red Barn box office at 305-296-9911. Ticketholders for Opening Night, March 7, are invited to remain after the show for the Opening Night party, where they can mingle with the cast and crew and enjoy a light nosh.\nThe play is sponsored in part by Royal Furniture, Design Group Key West, Culture Builds Florida, and the Monroe County Tourist Development Council.\nAuthor\nSusannah Wells\nDate\nAugust 4, 2022\nFLAMING GUNS of the PURPLE SAGE\nJanuary 31 - February 25, 2023\nWritten By: Jane Martin\nShows: Tuesdays-Saturdays at 8pm\nBe ready to take a wild and crazy ride into the classic mash-up spoof of a Western-Horror “B” movie with Jane Martin’s hilarious “Flaming Guns of the Purple Sage”. Big 8, a rodeo competitor, is facing foreclosure on the Wyoming ranch where she rehabilitates injured rodeo cowboys. The arrival of a shocking woman named Shedevil and a one-eyed Ukrainian biker named Black Dog leads to violence and horror in this satire of pulp western writers like Zane Grey. It will feature George DiBraud, Susannah Wells, Cassidy Timms Iain Wilcox, Tim Dahms, and Mathias Maloff.\nView fullsize\nView fullsize\nView fullsize\n“FLAMING GUNS OF THE PURPLE SAGE” BRINGS THE OUTRAGEOUS WILD WEST TO THE RED BARN\nImagine Hopalong Cassidy trying to date Carrie, or Miss Kitty chasing Chuckie around the corral with a meat cleaver in an Addams Family version of “Gunsmoke,” and you may get close to the outrageous fun and outright craziness awaiting you in the Red Barn’s next production.\n“Flaming Guns of the Purple Sage”, written by the always-hilarious and rapier-sharp Jane Martin (“Says She”), opens January 31 and runs Tuesdays through Saturdays through February 25. It’s a preposterous mash-up of B-movie westerns and C-movie horror flicks that will literally have you laughing until you cry, even while you’re sitting in disbelief at what you’re seeing on stage.\n“I just love its audacity,” said director Joy Hawkins. “It’s unlike anything I’ve ever directed before. It’s full of macabre people you love and hate at the same time. We can’t get through a rehearsal without laughing ‘til our sides ache.”\nWithout giving away too much (because the surprises are everything in this tale), “Flaming  Guns” tells the story of Big 8, a retired rodeo star who’s trying to keep her home from being foreclosed on. Living with her is Rob Bob, a rising young rodeo star (think more Gomer Pyle than John Wayne). Into this household comes SheDevil (her choice of name) who is pregnant by Big 8’s ne’er-do-well son, Lucifer Lee. But SheDevil is being hunted down by her very angry Ukrainian biker boyfriend, Black Dog, and when he shows up, things really begin to get interesting.\n“Be aware,” Hawkins said, “that there is, indeed, a lot of violence and blood and sex all mixed in, but it’s done in a very farcical and satirical way. Be advised -- it’s definitely for adults…I wouldn’t bring the kids. But it’s a very cleverly-written send-up of those old B-movie Westerns and horror flicks. This is all fun and laughs about how crazy – in a very funny way -- human beings can be.”\nThe play stars a terrific mix of Key West’s best comedic actors, including George DiBraud, Susannah Wells, Mathias Maloff, Tim Dahms, Cassidy Timms, Iain Wilcox, and Jack McDonald. Hawkins directs and Carmen Rodriguez will be designed the western duds.\nCurtain Up called it “a crowd-pleaser that keeps the audience howling”. The Courier-Journal calls it “hilarious and rip-snortin’”, and Concord Theatricals dubs it a “shoot ‘em up, knock ‘em up, cut ‘em up comic romp.”\nRead KONK Life Review by Emily Weekley\nRead Konk Life Review by Emily Berg\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nAuthor\nSusannah Wells\nDate\nAugust 3, 2022\nBACK IN BABY'S ARMS | CHRISTINE MILD SINGS PATSY CLINE\nJanuary 18 - 21, 2023\nThis special musical event, “Back in Baby’s Arms”, features the voice and stylings of Christine Mild, who has played Patsy Cline in the popular “Always, Patsy Cline” play dozens of times, including a sold-out run at the Red Barn in 2018. Expect to hear many of Cline’s biggest hits, with the stellar accompaniment of arranger/pianist Jim Rice and trio.\nAuthor\nSusannah Wells\nDate\nAugust 2, 2022\nDear Jack, Dear Louise\nDecember 20, 2022 - January 14, 2023\nWritten By: Ken Ludwig\nShows: Tuesdays-Saturdays at 8pm\nSparks fly and love blossoms across the darkened landscape of World War II, when Jack, a U.S. Army doctor, begins a letter correspondence with Louise, an aspiring actress living a world away from his war-torn reality. The play won the Helen Hayes and Charles MacArthur award for Best New Play of 2020. It will feature Jessica Miano Kruel and Cody Borah.\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nKEN LUDWIG’S “Dear Jack, Dear Louise” OPENS THE RED BARN’S 43RD SEASON\nIn the 21st Century’s fast-paced digital culture, the personal letter, handwritten on fine stationery from one person to another, has all but disappeared -- become a lost art few seldom indulge in anymore. Emails, texts, Tweets, Instagrams, connection apps – these are the main means of communication between people in a world increasingly dominated by the code of a metaverse we no longer actually touch.\nPerhaps this was on the mind of playwright Ken Ludwig when he sat down last year to pen his Helen Hayes Award Winning play, “Dear Jack, Dear Louise.” Because the heart of the play is about just that – personal, handwritten letters that passed between a World War II Army doctor and a Broadway starlet working at the Stage Door Canteen in New York during the war. And they’re not just any letters – these were epistles that formed the joyous, heartwarming story of Ludwig’s parents’ long-distance courtship and eventual marriage.\n“Dear Jack, Dear Louise” is set to make its South Florida debut December 20th as the opening production of the Red Barn’s 43rd Season in Key West, with a run that goes through January 14th of 2023. It will star Key West favorites Jessica Miano Kruel as Louise Rabiner, an aspiring actress and dancer in New York, and Cody Borah as Captain Jack Ludwig, a military doctor then stationed in Oregon. The Barn’s Artistic Director, Joy Hawkins, will direct.\n“It’s a good, old-fashioned story,” Hawkins said. “And I think it’s special to have such an unabashed love story in these times. It takes you back. And it’s pertinent right now as we’re dealing with war in the world. It’s sweet, it’s funny, but it’s also real – these were real people, living real lives, and we’re privileged to watch how they managed to fall in love under such circumstances.”\nLudwig and Rabiner, living on opposite sides of the country in 1942, strike up a correspondence at the urging of their parents, who were old friends. They find a rapport right away – he encouraging her with auditions, she commiserating over his hardass commanding officer. It’s not all fun and games, though, as the ugly situation in the world encroaches on their connection.\nThe show isn’t schmaltzy either, in great part due to the way it’s staged, with the two characters on stage together but separately – he in his world on one side of the stage, and she in hers on the other. The beauty of the play is in the way the characters build chemistry in front of the audience’s eyes without ever looking at one another. And they’re not reading the letters – they’re living the words we understand they wrote.\n“It’s captivating to watch,” Hawkins said. “We’re not sure they’ll ever get together, but it’s a beautiful ending. I hope the audience will feel connected to their own experiences, and maybe those of their own parents.”\nThe Washington Post said the play is “…a poignant, funny tribute to the enduring power of human connection.” The Lit Arts Maven said, “One of the finest theatre experiences I have had in 25 years of reviewing.”\n“Dear Jack, Dear Louise” runs December 20 – January 14, excepting Christmas Eve and Christmas, and New Year’s Eve and New Year’s Day. Tickets are available at redbarntheatre.com/tickets or by calling 305-296-9911, 3-5 pm weekdays.\nThe Red Barn season is sponsored in part by the Monroe County Tourist Development Council, and the State of Florida Division of Cultural Affairs.\nAuthor\nSusannah Wells\nDate\nAugust 1, 2022\nHurricane Diane\nMarch 22 - April 16, 2022\nWritten By: Madeleine George\nThe hilarious HURRICANE DIANE stars Lauren Thompson, Susannah Wells, Erin McKenna, Jessica Miano Kruel, and Caroline Taylor.\nHILARIOUS “HURRICANE DIANE” BLOWING INTO THE RED BARN THEATRE\nWhat if the Greek God Dionysus, deity of wine and ecstasy, suddenly walked into your kitchen and announced that it was time mankind shaped up and started taking care of “his” planet and that you and your girlfriends were going to be the first acolytes in his quest to bring the Earth back to its natural, unsullied state? What could go wrong, right?\nThis is the reality-bending set-up for the hilarious new play, “Hurricane Diane”, set to open at the Red Barn Theatre in Key West on March 22 for a four-week run. Written by Pulitzer Prize finalist Madeleine George, the play will feature a who’s who of Key West women, including Erin McKenna, Caroline Taylor, Susannah Wells, Jessica Miano Kruel, and Lauren Thompson. It will be directed by Red Barn artistic director, Joy Hawkins.\nGeorge launches her play right from “Lights Up”. We meet Dionysus immediately, though not as we might expect. He has morphed into a rabble-rousing lesbian gardener from Vermont named Diane, and she’s chosen four suburban New Jersey housewives – think a sophisticated, socially-conscious version of a “Real Housewives” show and you won’t be far off – to join his efforts at reclaiming the natural beauty of the planet.\nThe four women all live on a cul-de-sac in flood-prone Red Bank, New Jersey in identical cookie-cutter houses. They regularly gather over wine and coffee to gossip about anything but the latest portents for the climate. There’s control freak Carol, who just wants a well-manicured lawn; and Renee, a top editor at HGTV Magazine; and Pam, an Italian dragon in animal prints; and weepy Beth, who’s just been left by her husband.\nInto this coffee klatch comes lesbian landscape gardener Diane, livid at humanity for “despoiling the green earth that gave you life.” She has great plans – not the least of which involve indulging her Dionysian proclivities – and she’s going to begin right here, right now.\nWill Diane be able to enlist them all? Will this diverse band of suburban women be inspired by the appetites of their divine visitor to unleash their wildness to help the battered planet? Maybe. Maybe not. You’ll have to see.\nTo say the play is outrageously funny is a given. But it also carries a subtextual message that has profound relevance in this day and age. Called “incisively smart and boisterously funny” by the Boston Globe, “clever and timely” by New York Theater, and “An astonishing new play” by the NY Times, “Hurricane Diane” lives up to its fantastical premise.\nTickets are available at redbarntheatre.com or by calling 305-296-9911. The play is sponsored in part by The Dogwood Foundation, Design Group Key West, and the Monroe County Tourist Development Council.\nAuthor\nSusannah Wells\nDate\nApril 16, 2022\nQuarantine For Two\nFebruary 15 - March 12, 2022\nWritten By: Hy Conrad\nA world premiere of a wickedly funny new play by Hy Conrad. Hy, the well-known Key West resident who wrote a good many of the\nMonk\nepisodes, as well as\nWhite Collar,\nand the recent hit,\nThe Good Cop,\nhas taken the trials and tribulations of our pandemic quarantine and turned them hilariously on their heads. The play mixes comedy, intrigue, (and of course) murder, and a neck-bending twist that you won't see coming.\n“QUARANTINE FOR TWO” TO PREMIERE AT RED BARN\nGod knows there hasn’t been much to laugh about the last couple of years. Pandemics tend to lean that way.\nBut thanks to Hy Conrad – the writer/producer of the very funny “Monk” series – we’ll get a chance to shake off a little of the downside of things when his new play, “Quarantine For Two”, opens a four week run on February 15th at Key West’s Red Barn Theatre. The production marks the play’s American premiere.\n“Hy and I were chatting one day,” said artistic director Joy Hawkins, “and we thought a funny play about this might be good for people, to lighten things up a bit. And who better to do that than Hy Conrad?”\nThe play centers on a typical, middle-aged, suburban couple – played by David Black and Mimi McDonald – who have been quarantining at home for more than a year. But it hasn’t gone well. In fact, they’ve driven each other crazy, to the point that each has come to the conclusion that for their own sanity, they need to kill the other. How they go about that – with the involvement of a somewhat dim and double-dealing poolboy-turned-hitman played by Rhett Kalman – leads to a very hilarious escalation of complications.\n“I tend to write toward comedy and crime,” Conrad said. “The idea of two people in lockdown who desperately want to kill each other seemed to make comic sense, if we want to make light of our fears in the moment. Balancing the truth in the Covid situation with finding the humanity in the characters and making it funny was the challenge.”\nBut Conrad makes it work exceptionally well. In a private reading of the play last summer, it was hard for the cast and crew to get through the script without breaking into laughter.\n“The last two years have been so surreal and ludicrous and crazy,” Hawkins said. “So let’s just jump in and laugh at the predicament we’ve all been in. Because somewhere in all of this, we really do need to find a laugh.”\nAnd as she said, who better than Hy Conrad to give that to us?\nTickets for “Quarantine For Two”, the second of the Red Barn’s season of “Bright and Brilliant Comedies”, are available now at redbarntheatre.com or by calling 305-296-9911.\nThe play is sponsored in part by Jane Gardner Interiors, the Florida Department of State Division of Cultural Affairs, and the Monroe County Tourist Development Council.\nAuthor\nSusannah Wells\nDate\nMarch 14, 2022\nVail Johnson \"Bassically Incorrect\"\nMarch 6 & 7, 2022\nLimited engagement — 2 nights only!\nBASSIST FOR THE STARS: VAIL JOHNSON TELLS ALL IN RED BARN LIMITED ENGAGEMENT\nYou might not recognize him on the street nor know his name, but you’ve probably seen him onstage and you’ve most certainly have heard him…probably many times.\nVail Johnson is his name, and he’s a bassist. Not just any bassist, mind you, but THE bassist when it comes to studio work, recordings, and live performance.  He’s been doing it for over 40 years with some of the top names in music, and he’s bringing a career-ful of behind-the-scenes stories and almost every note of the great music he’s had a hand in to the Red Barn Theatre in Key West.\nHis one-man show, “Bassically Incorrect: Around the World in 40 Years” will have a limited engagement at the Barn Sunday and Monday, March 6 and 7 only. Tickets are available now at redbarntheatre.com or by calling 305-296-9911.\nWant some names he’s put the bottom under? How about Kenny G, Whitney Houston, Herbie Hancock, Stevie Nicks, Keb’ Mo’, George Benson, Michael Bolton, James Ingram, Gil Scott Heron, Paula Abdul, MC Hammer, T. Graham Brown, David Cassidy, Steve Perry, Patti Austen, Peabo Bryson, Edgar Winter, and Christopher Cross, just to name a very few.\n“It just sort of happened,” Johnson said recently. “I was playing in a lounge band back in the late 70’s, and Kenny G’s percussionist sees me, brings Kenny to the gig, and the next thing I know, I’m playing in Kenny G’s band. We go to LA, and Stevie Nicks sees me at a gig, and asks me to do her record. It just snowballed from there.”\nIt wasn’t all luck, however. Johnson was ready when the door opened. The youngest of seven brothers (one of his older siblings is Key West’s Jeff Johnson), Vail was immersed in all kinds of music through his family – classical, choral, gospel, bluegrass, Dixieland, Top 40. He absorbed it all, mixing in whatever he came across, including jazz, hip-hop, metal rock, and pure improvisation. His virtuosity, passion, and humor were his calling card, and his ability to play virtually any style extremely well sealed the deal.\nAnd all of it is on display in his one-man show – from Kenny G’s, George Benson’s, and Herbie Hancock’s jazz to Steve Perry’s and Stevie Nicks’s rock, to Peabo Bryson’s soul and Keb’Mo’s blues.\n“I tell stories about the artists I’ve played and toured with, and then play and sing along with the tracks I’ve done with them or played on tour. I do some of my own stuff too. And what I do is not just ‘play bass’…people are surprised what I can do on a bass in terms of playing music. Look…it’s a guitar. It just happens to be a bass. I can make it sound like a Spanish guitar, or bluesy finger-picking, or monster slapping.”\nAsk Johnson who was the most fun he’s had with any artist, and the answer might surprise you. “Edgar Winter,” he said. “For me to play ‘Frankenstein’ with Edgar Winter? Man, that was freakin’ fun!”\nIt doesn’t matter what style of music or what particular artist you like personally – there’s a very good chance Vail Johnson will tell you a story about touring with them, or play something you’ve heard by them in his show. And odds are you’ll say, “Oh, yeah! I know that one! He played bass on that?”\nTickets for “Bassically Incorrect” are two-tiered. For the Sunday, March 6 show, all tickets are $60. For Monday night’s show, they’re $75, but that gets you an invite to the catered after-party in the Red Barn courtyard, where you can meet and talk music with Vail Johnson and enjoy some delish foods.\nYou’ll also be able to purchase some of Vail’s own CDs both evenings, the proceeds from which will be going directly to the Florida Keys SPCA.\nThis show is sponsored in part by Design Group Key West, and the Monroe County Tourist Development Council.\nAuthor\nSusannah Wells\nDate\nMarch 7, 2022\nOlder\nSHORT ATTENTION SPAN THEATRE: “ALTERNATIVE FACTS”\nApril 8 - May 3, 2025\nCollection of Short Plays\nShows: Tuesdays-Saturdays at 7:30pm\nAn evening of eclectic short plays, each a unique journey with a diverse collection of voices and stories; playwrights from all parts of the spectrum, and a wide range of styles and genres – an intriguing mix of characters who are in conflict with larger forces —from a catering job for a engagement party with a missing bride, a chance meeting on the Golden Gate bridge, two audience members that insist on World Premieres, a fiancé is put to the test when she meets her possible inlaws, two FBI agents interrogate a newscaster when a newsroom is hijacked, and one surprise ending. Always a season favorite show at the Red Barn.\nCast\n: Erin McKenna, Cassidy Timms, Nina Pilar, Mathias Maloff, Zach Franchini\nDirectors\n: Mimi McDonald, Gary McDonald, Jack McDonald, Amber McDonald Good\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nRead review\nCast of Short Attention Span Theatre: “Alternative Facts”\nRED BARN SHINES WITH “SHORT ATTENTION SPAN THEATRE”\nThere’s an old saying in theater: “When you find a gem, let it shine.”\nKey West’s Red Barn Theatre found such a gem over a decade ago, and they’ve been letting it shine in most of their seasons since. It’s called “Short Attention Span Theatre”, and it’s proven to be one of the most popular shows the theater offers each year. This season will be no different.\nIt’s a simple concept – pick a mixed slate of funny, powerful, poignant, or simply off-the-wall short plays and populate them with some of the area’s top comedic talent, then string them together for an evening of stellar fun. Each year, the Red Barn’s resident family – the McDonalds – find six or seven wonderful new plays and pull them together under a title that relates to them all. This year’s theme: “Alternative Facts”, which anyone will agree, certainly is relevant to the times.\n“One of the things I love most about Short Attention Span Theatre (SAST),” said the Red Barn’s Managing Director Mimi McDonald, “is that it gives us the opportunity to explore a number of different voices and new playwrights in one show. And it seems to many of us that the human condition is evolving right now, and these playwrights are noticing that and commenting on what’s happening in a very comedic way. And we have such great comedic actors all doing a variety of very funny characters in this one.”\nThis year’s rendition of SAST will star Erin McKenna, Mathias Maloff, Cassidy Timms, Nina Pilar, and Zach Franchini. They appear in various combinations during the evening of eclectic plays that focus on characters who are in conflict with larger forces – from a catering job for an engagement party with a missing bride; a chance meeting on the Golden Gate Bridge; two audience members who insist on world premieres; a fiancé is put to the test when she meets her possible in-laws; and two FBI agents who interrogate a newscaster when a newsroom is hijacked.\n“It’s a fast, fun evening,” said McDonald, “but there’s a message or two in there as well.”\nAs they do every year, the entire McDonald family shepherds this show to the stage, with each of them directing, building sets, handling the tech, and more. Along with Mimi are her husband Gary, and their two (now adult) children, Amber and Jack.\n“We’ve been a theater family for more than 45 years,” Mimi said. “It’s in our blood, and we have such a great time working together on this show. It’s always a big hit.” Or to put it another way – it’s a gem.\nTickets for “Short Attention Span Theatre: Alternative Facts” are available at KeysTix.com, redbarntheatre.com, or by calling the box office at 305-296-9911. Note that all curtain times are 7:30 pm.\nAuthor\nSusannah Wells\nDate\nMay 5, 2025\nBROOKLYN LAUNDRY\nMarch 4 - 29, 2025\nWritten By: John Patrick Shanley\nShows: Tuesdays-Saturdays at 7:30pm\nWritten by John  Patrick Shanley, the Pulitzer Prize- and Tony-winning author of Doubt and the Oscar®-winning writer of Moonstruck. Sometimes big things start from little things; in this case, a bag of laundry. Shanley’s latest is about three sisters, a guy who runs a laundry in Brooklyn, and the sometimes savage tricks life plays on them. Tragic and funny by turns, this story will remind you what is important in life... and the sorrow and joy of fully embracing adulthood.\nCast\n: Jessica Miano Kruel, Michael Castellano, Lauren Thompson, Donna Stabile\nDirector\n: Joy Hawkins\nMichael Castellano and Jessica Miano Kruel | Photo by Roberta DePiero\nROMANCE BLOOMS IN THE RED BARN’S CHARMING “BROOKLYN LAUNDRY” BY JOHN PATRICK SHANLEY\nIt’s been said that chance meetings are often an aphrodisiac moment out of which true love may bloom. That doesn’t guarantee it will be an easy germination, of course…just that there’s an outside chance for an acceptable blossom.\nPlaywright John Patrick Shanley endearingly lets us watch such a flowering in his latest play, “Brooklyn Laundry”, running March 4-29 at the Red Barn Theatre in Key West. Shanley, author of the romantic megahit “Moonstruck”, is a master of the charming, imperfect love story, and this play fits his model well.\n“Brooklyn Laundry” is about three sisters and a guy who runs a laundry in that New York borough. Fran is a single woman and bone-tired of being so, whose sisters each have their own crosses to bear. Trish is dealing with a threatening illness, and Susie with a dissolving marriage, and each of them is turning to Fran, who is feeling overwhelmed with it all.\nThen one day, Fran takes a bag of laundry to the cleaners in her building and runs into the owner, Owen, whose sweetly gruff adorability breaks through her protective barriers and sparks something between them. Owen, too, has had to deal with some unexpected twists in his life, but he uncharacteristically rises to and goes with the moment, asking Fran to dinner. From there on, Shanley takes us on an utterly charming and very funny ride into a story of two people trying to find balance in their lives despite the bumps that come their way.\nThe Red Barn production stars a quartet of top local actors, including Jessica Miano Kruel, Michael Castellano, Donna Stabile, and Lauren Thompson. It is directed by Joy Hawkins, the Barn’s artistic director.\n“It’s a beautiful play,” Hawkins said, “nicely written, funny, tender, and heartwarming. It does deal with some situations we sometimes have to deal with in life, and it might bring some tears here and there, but you’ll leave the theater feeling really good. It’s very life-affirming, with characters you can really root for.”\nThe New York Times called the play “Utterly charming.” The New York Theatre Guide said, “Forget the dating apps – maybe the laundromat is the place to find your next great love…”.\nTickets are available at KeysTix.com, or at redbarntheatre.com. For more information, call the box office at 305-296-9911. All shows for the March 4-29 run are at 7:30 pm. The production is sponsored in part by Florida Arts and Culture, and the Monroe County Tourist Development Council.\nAuthor\nSusannah Wells\nDate\nMarch 5, 2025\nMS HOLMES AND MS WATSON, APT 2B\nJanuary 28 - February 22, 2025\nWritten By: Kate Hamill\nShows: Tuesdays-Saturdays at 7:30pm\nAn irreverent, darkly comic, modern take on Sir Arthur Conan Doyle’s famous sleuth and sidekick, this fast-paced romp re-examines the world’s most famous detective story with a bold new feminist lens. In this highly theatrical, small-cast escapade, oddball female roommates Sherlock (yes, it’s also a girl’s name—wait, is it a girl’s name? Is it even a name?) Holmes & Joan Watson join forces to emerge from pandemic fog as a deeply codependent, quasi-dysfunctional Odd Couple adventure duo—solving mysteries and kicking butts, until they come face to face with a villain who seems to have all of the answers.\nWinner of the Off-Broadway Alliance Award\nCast\n: Susannah Wells, Mariah Woessner, Arthur Crocker, Morgan Fraga Pierson\nDirector\n: Mimi McDonald\nCostumes\nby Sushi\nMariah Woessner and Susannah Wells | Photo by Roberta DePiero\nMYSTERY ABOUNDS IN RED BARN’S “MS. HOLMES, MS. WATSON, APT.2B”\nEveryone loves a good mystery. And who better to confound us with one than Sir Arthur Conan Doyle, who then sends his most famous detective, Sherlock Holmes, to unravel even the most convoluted of mysteries for us?\nAh, but there’s a hilarious rub in all of this! In the Red Barn Theatre’s latest offering of their 45th remarkable season – “Ms. Holmes, Ms. Watson, Apt. 2B”, running January 28 through February 22 – we are presented with a tale that cheerfully desecrates the stories of Conan Doyle in a most unusual and very funny way.\nBecause in Kate Hamill’s energetic play, the world’s most famous detective is a frazzled female police consultant whose dazzling deductions astound everyone. She takes on a new roommate – a wayward American who Holmes determines is running from a past where she used to be a doctor and needs a little help and refocusing. Portrayed as a deeply co-dependent, quasi-dysfunctional Odd Couple, this duo proceeds into a fast-paced and wildly entertaining romp through multiple violent crimes that all seem to lead to notorious villains.\nThe pair solve a variety of these crimes, from the murder of a man found in a motel to the case of a right-wing politician who cheated on his wife. It’s a blend of classic theater and modern comedy that balances mystery with laugh-out-loud humor, playfully dismantling and, at the same time, celebrating the conventions of Conan Doyle’s stories.\n“We’re really having a good time,“ said director Mimi McDonald. “The intimacy of the Red Barn allows the audience to take the ride with the actors. At the heart of it is a real mystery, with twists and turns, and a few real surprises. We know the audience is going to have a ball solving the mystery right along with us.”\nSusannah Wells, one of Key West’s best comedic actresses, stars as Ms. Sherlock Holmes, and Mariah Woessner is the perfect complement as Ms./Doctor Watson. Joining them and playing a number of unexpected and mysterious/villainous characters are Arthur Crocker and Morgan Fraga Pierson, both no slouches when it comes to comedic chops.\n”One thing I’m sure everyone will love are the costumes,” said McDonald, who commissioned iconic Key West costumer Gary Marion – better known as Sushi – to create original costumes for the play. “They’re really something – a kind of apocalyptic theme and a warrior vibe, that adds another whole dimension to the story.”\nCalled “…laugh-out-loud funny, incredibly clever, inherently theatrical, and a delight from start to finish..” and “…sharp, playful, and moves at a rapid-fire pace…” by the Portland Monthly, “Ms. Holmes, Ms. Watson, Apt. 2B” is a great way to spend an evening deducting, finding clues, and solving mysteries. The game’s afoot!\nRunning January 28 through February 22. All curtains are at 7:30 pm. Tickets at keystix.com. For more information, call the Red Barn box office at 305-296-9911.\nSponsored in part by the William L. Monroe III Foundation, and the Monroe County Tourist Development Council.\nAuthor\nSusannah Wells\nDate\nFebruary 1, 2025\nGERRI LOUISE STANDUP: SENIOR MOMENTS OR WHAT THE HELL HAPPENED?\nFebruary 16 & 17, 2025\nLimited engagement — 2 nights only!\nShows at 7:30pm\nIf there’s a funnier woman living and working in Key West theatre, we’d like to meet her. Gerri Louise can make you laugh in one second, with one word. With an astute eye, an always-open ear, and a quick mind, it just comes naturally to her. She’s graced all our stages – in both straight plays and her own stand-up comedy. These two special nights of comedy feature an all-new basket of classic Gerri Louise. Of her comic perspective, Gerri says,  \"You have to make the littlest things in life funny for yourself...make them all a celebration, no matter what they are. That way every day is a good day and you go to sleep having smiled all day.”\nAuthor\nSusannah Wells\nDate\nJanuary 31, 2025\nVAIL JOHNSON IS BASSICALLY INCORRECT | ALL NEW SHOW!\nFebruary 9 & 10, 2025\nLimited engagement — 2 nights only!\nShows at 7:30pm\nBASSIST FOR THE STARS: VAIL JOHNSON TELLS ALL IN RED BARN LIMITED ENGAGEMENT\nYou might not recognize him on the street nor know his name, but you’ve probably seen him onstage and you’ve most certainly have heard him…probably many times.\nVail Johnson is his name, and he’s a bassist. Not just any bassist, mind you, but THE bassist when it comes to studio work, recordings, and live performance.  He’s been doing it for over 40 years with some of the top names in music, and he’s bringing a career-ful of behind-the-scenes stories and almost every note of the great music he’s had a hand in to the Red Barn Theatre in Key West.\nWant some names he’s put the bottom under? How about Kenny G, Whitney Houston, Herbie Hancock, Stevie Nicks, Keb’ Mo’, George Benson, Michael Bolton, James Ingram, Gil Scott Heron, Paula Abdul, MC Hammer, T. Graham Brown, David Cassidy, Steve Perry, Patti Austen, Peabo Bryson, Edgar Winter, and Christopher Cross, just to name a very few.\n“It just sort of happened,” Johnson said recently. “I was playing in a lounge band back in the late 70’s, and Kenny G’s percussionist sees me, brings Kenny to the gig, and the next thing I know, I’m playing in Kenny G’s band. We go to LA, and Stevie Nicks sees me at a gig, and asks me to do her record. It just snowballed from there.”\nIt wasn’t all luck, however. Johnson was ready when the door opened. The youngest of seven brothers (one of his older siblings is Key West’s Jeff Johnson), Vail was immersed in all kinds of music through his family – classical, choral, gospel, bluegrass, Dixieland, Top 40. He absorbed it all, mixing in whatever he came across, including jazz, hip-hop, metal rock, and pure improvisation. His virtuosity, passion, and humor were his calling card, and his ability to play virtually any style extremely well sealed the deal.\nAnd all of it is on display in his one-man show – from Kenny G’s, George Benson’s, and Herbie Hancock’s jazz to Steve Perry’s and Stevie Nicks’s rock, to Peabo Bryson’s soul and Keb’Mo’s blues.\n“I tell stories about the artists I’ve played and toured with, and then play and sing along with the tracks I’ve done with them or played on tour. I do some of my own stuff too. And what I do is not just ‘play bass’…people are surprised what I can do on a bass in terms of playing music. Look…it’s a guitar. It just happens to be a bass. I can make it sound like a Spanish guitar, or bluesy finger-picking, or monster slapping.”\nAsk Johnson who was the most fun he’s had with any artist, and the answer might surprise you. “Edgar Winter,” he said. “For me to play ‘Frankenstein’ with Edgar Winter? Man, that was freakin’ fun!”\nIt doesn’t matter what style of music or what particular artist you like personally – there’s a very good chance Vail Johnson will tell you a story about touring with them, or play something you’ve heard by them in his show. And odds are you’ll say, “Oh, yeah! I know that one! He played bass on that?”\nAuthor\nSusannah Wells\nDate\nJanuary 30, 2025\nA LITTLE BIT COUNTRY, A LITTLE BIT ROCK N ROLL\nJanuary 15 - 18, 2025\nShows at 7:30pm\nChristine Mild returns with a new knockout \u0003show featuring the women who sing Country AND Rock n Roll.\nStarring:\nChristine Mild\nJim Rice, Musical Director & Piano\nGary Rivenson, Bass Guitar\nGary McDonald, Drums\nMatt Backer, Guitar\nVOCALIST CHRISTINE MILD RETURNS TO THE RED BARN WITH A STELLAR NEW SHOW\nVocalist Christine Mild, who has wowed Red Barn audiences for the last several years with her “Always, Patsy Cline” and “Women of Country Music” shows, will be returning to the Barn January 15-18 with her brand new show, “A Little Bit Country, A Little Bit Rock ‘n’ Roll.” All show times are 7:30 pm.\nWhile Mild’s heart has always rested in country music, she says she always tries to bring “a little something new” to each of her stops in Key West, and this year will be no different.\n“I’ll never stray too far from country music, of course,” Mild said, “but with this new show, we’re going to be expanding the boundaries a little bit, which has been happening in the music business over the last couple of years, with Dolly Parton releasing a rock album, and Beyonce and Lady Gaga releasing country albums. The lines are getting blurred and an awful lot of good music is coming out.”\nMild said she’ll still be featuring country touchstones, focusing on female artists like Faith Hill, Carrie Underwood, Jody Messina, and Shania Twain, but “we’ll be adding in friends like Bonnie Raitt, Linda Ronstadt, Patty Smith, and even some Heart. It’s all great music.”\nAnd as usual, Mild will have a kickin’ band with her, featuring her regular sidemen – Jim Rice on keyboards, Gary Rivenson on bass, and Gary McDonald on drums. But she’s expanding the group for this show with some top-level name players. She’s bringing in British guitarist Matt Backer, who’s played with a number of top recording artists. And one of her best friends, Chicago vocalist Erin Parker, will be on stage to add the extra dimension of another female voice for harmonies. The sound will be bigger and richer, more a concert event than a small group.\n“I always want to bring Key West something new, and this is going to be an awesome show, given all the new pieces in the band and the music that we’ll be doing. You’re going to know a lot of this music, but we’ll surprise you with a few new things I know you’re going to like.”\nTickets are available now for the best seats at keystix.com or redbarntheatre.com. For more information, visit the website or call 305-296-9911. Remember that all shows at the Red Barn now have a curtain time of 7:30 pm. Sponsored in part by William L. and Pattye Monroe III, and the Monroe Country Tourist Development Council.\nAuthor\nSusannah Wells\nDate\nJanuary 29, 2025\nTHE FOREIGNER\nDecember 18, 2024 - January 11, 2025\nWritten By: Larry Shue\nShows at 7:30pm\nThe scene is a fishing lodge in rural Georgia often visited by “Froggy” LeSueur, a British demolition expert who occasionally runs training sessions at a nearby army base. This time “Froggy” has brought along a friend, a pathologically shy young man named Charlie who is overcome with fear at the thought of making conversation with strangers. So “Froggy,” before departing, tells all assembled that Charlie is from an exotic foreign country and speaks no English. Once alone the fun really begins, as Charlie overhears more than he should—the evil plans of a sinister, two-faced minister and his redneck associate; the fact that the minister’s pretty fiancée is pregnant; and many other damaging revelations made with the thought that Charlie doesn’t understand a word being said. That he does fuels the nonstop hilarity of the play and sets up the wildly funny climax in which things go uproariously awry for the “bad guys,” and the “good guys” emerge triumphant.\nWinner of the Outer Critics Circle Award for Outstanding Off-Broadway Play.\nCast\n: David Black, Annie Miners, Cassidy Timms, Brian Robinson, Thomas Masat, Chase Naylor, and Iain Wilcox\nDirector\n: Joe Kinosian, the lauded Chicago Theatre director\nRED BARN LANDMARK 45TH SEASON OPENS WITH THE HILARIOUS “THE FOREIGNER”\nKey West’s venerable Red Barn Theatre opens its 45th season literally with a bang and a houseful of laughs when it presents a new production of Larry Shue’s hilarious, award-winning “The Foreigner”, opening Wednesday, December 18th  and running through January 11 next year. All shows will be at the theater’s new curtain time of 7:30 pm.\nThe season also marks a milestone for the Red Barn’s Mimi and Gary McDonald and Joy Hawkins, who have guided the small but well-respected playhouse for all of its nearly half a century, an accomplishment rarely achieved in today’s theatrical landscape. Notables who have worked with them at the Barn through the years include Tennessee Williams, Shel Silverstein, Tony Roberts, Paul Cotton, Terri White, and a dozen other names that have made their larger marks in the entertainment industry.\n“We’re really excited about this upcoming forty-fifth season,” said Joy Hawkins, the Barn’s artistic director. “It’s an eclectic and surprising season -- funny and deep and particularly right for these times. “\n“The Foreigner”, winner of two Obie Awards and the Outer Critics Circle Award, uses the clever conceit of the audience knowing more than the characters on stage to create its fun, while also weaving in rich elements of suspense and a little mystery as the story plays out.\nThe scene is a fishing lodge in rural Georgia often visited by “Froggy” LeSueur, a British demolition expert who occasionally runs training sessions at a nearby army base. This time Froggy has brought along a friend, a pathologically shy man named Charlie who is overcome with fear at the thought of making conversation with strangers. So before departing, Froggy tells all assembled that Charlie is from an exotic foreign country and speaks no English. Once alone, the fun really begins, as Charlie overhears more than he should from those who feel secure he doesn’t understand a word being said. That he does fuels the nonstop hilarity of the play and sets up the wildly funny climax in which things go uproariously awry for the bad guys, and the good guys emerge triumphant.\n“The Foreigner” stars David Black, Chase Naylor, Cassidy Timms, Thomas Masat, Brian Robinson, and Iain Wilcox. It will be directed by Joe Kinosian, who Key West theater buffs will remember as the writer and star of “Murder For Two”, the outrageous and very funny two-man show that played the Red Barn in 2017. Kinosian, invited by artistic director Joy Hawkins to return and direct this opening show, is thrilled to be back in Key West.\n“It’s a hilarious and very funny play – probably one of the funniest ever written,” Kinosian said, “but it’s also one of the most moving stories I’ve seen. The audience will be surprised by how much they like the characters and are rooting for them against all odds. It’s one of a kind.”\nThe New Yorker said “The Foreigner is once comic surprise after another.” And The Village Voice said of the play, “It’s a constant invitation to laugh at the foolishness of life.”\nSubscriptions and single show tickets are now on sale for “The Foreigner” and the Red Barn’s entire season at KeysTix.com, redbarntheatre.com, or by calling the box office at 302-296-9911.\nBe aware that for this new season, the Red Barn has set curtain time at 7:30 pm for all shows\n.\nAuthor\nSusannah Wells\nDate\nAugust 5, 2024\nTHE LIFESPAN OF A FACT\nApril 9 - 27, 2024\nWritten By: Jeremy Kareken, David Murrell & Gordon Farrell\nShows: Tuesdays-Saturdays at\n7pm\nWith a deadline looming, a talented writer, a desperate magazine editor and a young aggressive fact checker go head to head in this oh-so-funny and gripping dispute over factual truth vs. the beauty of literary dishonesty.\nStarring:\nDave Bootle as John D’Agata, the writer\nRita Troxel as Emily Penrose, the magazine editor\nCody Borah as Jim Fingal, the fact checker\nRED BARN’S “LIFESPAN OF A FACT” HAS RELEVANCE FAR BEYOND A VERY FUNNY STAGE PLAY\nCast from left to right: Cody Borah, Rita Troxel, Dave Bootle\nIn a world where war, disease, famine, diversity, equality, AI, and God knows what else is piled on the plate in front of us, there may be one issue in that stew of concerns that trumps them all: Is any of what we’re being told in the media about\nanything\nentirely true?\nIn the final main stage production of their remarkable 44th season, the Red Barn Theatre in Key West takes this controversy head on with “Lifespan of a Fact”, an intriguing and humorous offering that has obvious relevance in this era of alternative facts. The play, written by Jeremy Kareken, David Murrell, and Gordon Farrell, runs April 9 – 27, and is adapted from a 2012 book by the real men portrayed in the play about a real incident in Nevada.\nThe play stars top local actors Dave Bootle, Cody Borah, and Rita Troxel. It’s directed by the Barn’s artistic director, Joy Hawkins. And be advised: All curtain times are 7 pm instead of the normal 8 pm.\n“It’s a very unique play,” said Hawkins. “I can’t compare it to anything else. It’s not a tie-it-up-in-a-bow kind of theater. You have to figure out for yourself what you think.”\nThe story starts off innocuously enough – Jim is a fresh-out-of-Harvard, eager beaver fact checker hired by Emily, a struggling magazine’s top editor, to fact-check an article submitted by the well-known and talented writer, John. The piece is centered around an indisputable incident: a 16-year-old boy is dead, having jumped from the observation deck of Las Vegas’ Stratosphere Hotel and Casino. Beyond that is where things get sticky.\nTurns out John has inserted unnecessary lies into his work under the guise of “artistic license” – for instance, was the casino deck actually 1100 feet high or far shorter, and did the boy’s death connect with other phenomena that day – like banned lap dances, the world’s oldest Tabasco bottle, or a tic-tac-toe-playing chicken named Ginger?\n“I’m not interested in accuracy,” says John. “I’m interested in truth.” And woe to anyone who calls his shattering essay an “article”. He is not cool with anyone tampering with his copy, insisting that 100 percent accuracy in names, dates, and specific incidents is less important than rhythm, music, and beauty in the language.\nBut Jim – out to prove himself – is not having any of it, and poor Emily is caught in the middle, concerned only with saving her magazine and knowing a sensational piece by the acclaimed John could prop up shrinking ad sales and disappearing subscriptions. What should she do?\nThe action is brisk, with plenty of sharp and funny repartee, sometimes unfolding like a taut thriller, but always coming back to the main question – do you undermine yourself by fiddling with the facts, or do you allow whatever is necessary to find the “higher truth” – the music of a boy’s tragic death?\nWho’s to say which one of them is speaking the kind of truth that really matters? You’ll have to decide for yourself.\nThe Washington Post called the play “buoyantly literate…briskly entertaining.”  Variety said “…terrifically funny dialogue…the debate at the heart of the play demands serious attention.”\nTickets for “Lifespan of a Fact” are available at redbarntheatre.com or by calling 305-296-9911. Remember that all curtain times are 7 pm.\nThe show is sponsored in part by Design Key West, Culture Builds Florida, and the Monroe County Tourist Development Council.\nAuthor\nSusannah Wells\nDate\nAugust 5, 2023\nTHE THANKSGIVING PLAY\nMarch 5 - March 30, 2024\nWritten By: Larissa FastHorse\nShows: Tuesdays-Saturdays at 8pm\nA group of terminally \"woke\" teaching artists scramble to create a pageant that somehow celebrates both Turkey Day and Native American Heritage Month. A hilarious, clever and delicious roasting of good intentions and absurd assumptions.\nStarring: Elena Devers, Arthur Crocker, Jeremy Zoma, & Nina Pilar\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nReview of THE THANKSGIVING PLAY\nPlaywright Larissa Fasthorse\nFrom Left to Right: Elena Devers, Arthur Crocker, Director Mimi McDonald, Jeremy Zoma, Nina Pilar\nRED BARN’S “THE THANKSGIVING PLAY” TAKES A HILARIOUS ‘WOKE’ LOOK AT OUR ICONIC HISTORY\nWe hear a lot about “wokeness” in the heady world of national politics these days. It’s usually pretty serious stuff, with each side slamming the other for either having too much of it, or not having enough. But what happens when you bring that thorny issue down to the common earth of everyday people?\nWell, we’re about to find out in a very funny way when Key West’s Red Barn Theatre stages “The Thanksgiving Play” as the third mainstage production of their remarkable 44th season. The show opens March 5 and will run Tuesdays to Saturdays through the 30th.\nThe play was written by Larissa Fasthorse, a member of the Sicangu Lakota Nation, and the first female Native American playwright to have a show on Broadway when it premiered at the Helen Hayes Theatre in New York. It won a Drama League Award in 2023.\nIt’s a simple premise: a group of white theater nerds meet in an elementary school classroom to put together a dramatic rendition of the Thanksgiving story for their young students – the one we’ve always been told about the Pilgrims and the “Indians” and the turkey and the corn. But when the supposed Indigenous professional actress they hire turns out to be anything but, everything plunges headlong into hilarious absurdity as the hopelessly woke whites try to fashion a play that ultimately has nothing to do with the actual unsavory history of that occasion, and is completely devoid of any insight into a Native American perspective on it.\n“It’s very funny,” said director Mimi McDonald. “It brings home how we really don’t know what to do with what actual history – as opposed to the glossed-up stories – tells us really happened. The takeaway is that we’re all just trying to figure things out, and it can get really funny and absurd as we do.”\nFasthorse herself has said she hopes the audience – while entertained by the laughter – will walk away with more questions than answers. But the main point she wants to cut through the laughter is this: “Doing nothing is not adequate anymore,” she says. “Stepping away because it’s too complicated can no longer be considered a part of any kind of solution.” This sentiment is brought to side-splitting life in her show’s audacious climax, which, for the sake of not spoiling the hilarity of it, will not be revealed here.\nEntertainment Weekly said the play is “…a good dark comedy that makes you laugh, makes you think, makes you mad, makes your brain explode.” The Hollywood Reporter called it “Very, very funny…”.\nTickets are available at redbarntheatre.com or by calling 305-296-9911 and are already selling quickly. Ticketholders for the March 5 Opening Night will be invited to a catered Opening Night reception with the cast and crew.\n“The Thanksgiving Play” is sponsored in part by Key West Compass Realty – Keller Williams, Culture Builds Florida, and the Monroe County Tourist Development Council.\nAuthor\nSusannah Wells\nDate\nAugust 2, 2023\nPOTUS: Or, Behind Every Great Dumbass Are Seven Women Trying To Keep Him Alive\nJanuary 30 - February 24, 2024\nWritten By: Selina Fillinger\nShows: Tuesdays-Saturdays at 8pm\nNOTICE ABOUT POTUS: This very funny play has language that is irreverent, bawdy, racy, sexual, smutty and gleefully filthy.\nOne four-letter word is about to rock the White House into a global crisis. Seven brilliant and beleaguered women risk life and sanity to keep POTUS out of trouble in this gleefully filthy and outrageously funny farce. A recent Broadway smash hit!\nStarring:\nGeorge diBraud as Harriet, his chief of staff\nLauren Thompson as Jean, his press secretary\nJessica Miano Kruel as Stephanie, his secretary\nSusannah Wells as Dusty, his dalliance\nAnnie Miners as Bernadette, his sister\nFritzie Estimond as Chris, a journalist\nLynne Casamayor as Margaret, his wife, The First Lady\nStage Manager: Rex Pierson\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nReview of POTUS\nCast of POTUS: Fritzie Estimond, George diBraud, Annie Miners, Lynne Casamayor, Jessica Miano Kruel, Lauren Thompson, & Susannah Wells\nRED BARN’S “POTUS” IS ONE VERY FUNNY FEMALE-DRIVEN TOUR-DE-FORCE\nIt would be hard to deny that politics in this day and age has pretty much distilled itself down into a daily dose of outright farce. Just turn on any TV news channel for five minutes, and it’s obvious. Things are out of control.\nSo it makes perfect sense that Selina Fillinger, one of the brilliant writers for Apple TV’s mega-hit, “The Morning Show” – a very funny and caustic skewering of cable TV news -- would turn her eye and pen to the focus of a lot of that news: the Oval Office and the creatures that inhabit it.\nThe result is the very funny “POTUS: Or Behind Every Great Dumbass Are Seven Women Trying To Keep Him Alive,” a hilarious cross between “Saturday Night Live” and “Veep”.\nFillinger’s very funny, all female-driven play will plunge the Red Barn Theatre stage into political chaos January 30 through February 24. The show will feature a Who’s Who of Key West’s top female actors, including George DiBraud, Jessica Miano Kruel, Susannah Wells, Lauren Thompson, Annie Miners, Lynne Casamayor, and Fritzie Estimond. It will be directed by the Barn’s artistic director, Joy Hawkins.\nOne of the cleverest conceits of the play is that we never see the President. We only hear about the PR nightmare he’s managed to spin into a global crisis. And it’s up to the seven brilliant and beleaguered women he relies upon most to risk their lives, their liberty, and their sanity to keep the Commander-in-Chief out of trouble.\nThere’s the super-sophisticated First Lady; the President’s sister (newly released from prison and the White House’s unofficial drug dealer); a pushy White House correspondent pursuing an interview with FLOTUS; POTUS’s meek secretary unable to cope with any of it; an outspoken, sexually-liberated young woman from a farming community who shows up and happens to have a surprising (though predictable) connection to the President; and that’s just for starters. Add in a press secretary and a Chief of Staff, and the mix gets quite volatile.\nAll these women are strong, opinionated characters, and Fillinger has them demonstrating that women in politics can be every bit as crass, brazen, bold, and – yes – deviant as the men in the halls of power. They are competent women cleaning up after incompetent men. And the result is just flat-out hilarious, filled with witty zingers and good, off-color fun – just what you’d expect from a writer of Fillinger’s abilities.\nOne important caveat: Be aware that Fillinger is not shy about using raw, crude language in her play. It’s salty, suggestive, and may be offensive to some audience members. But if you’ve already heard it all, you should be fine.\nPOTUS was written in the aftermath of the Trump years and reflects much of the chaos of that time. It was nominated in several categories in both the Drama League Awards and the Tony Awards in 2022. The Washington Post said, “The votes have been tabulated.  POTUS…is a winner!” The NY Times called it “Gleeful…a rough and tumble feminist comedy.”\nTickets for “POTUS: Or Behind Every Great Dumbass Are Seven Women Trying To Keep Him Alive” are available at redbarntheatre.com or by calling 305-296-9911. The production is sponsored in part by Sugar Loaf Lodge, Michelle Grahl of Key West Compass Realty – Keller Williams, Culture Builds Florida, and the Monroe County Tourist Development Council.\nAuthor\nSusannah Wells\nDate\nAugust 1, 2023\nTHIS ONE'S FOR THE GIRLS: THE WOMEN OF COUNTRY MUSIC\nJanuary 17 - 20, 2024\nShows at 8pm\nChristine Mild returns with a new show featuring the best of women who sing country . . . their stories and their incredible music. She sold out her Patsy Cline show last season so don't miss this one!\nStarring:\nChristine Mild\nJim Rice, Musical Director\nwith Mike Emerson on guitar, Gary Rivenson on bass, & Gary McDonald on drums\nCOUNTRY ARTIST CHRISTINE MILD RETURNS TO THE RED BARN THEATRE\nThe extraordinary songstress Christine Mild will make her long-awaited return to the Red Barn Theatre in Key West with her brand new show, “This One’s For The Girls: Women of Country Music”. The show will run for four nights only, January 17 through 20, at the Red Barn, 319 Duval Street.\nWell-known for her wildly-popular production, “Always, Patsy Cline”, Mild will be expanding her repertoire to include the top hits of close to two dozen of country music’s most fabled female artists, running from the classics of the 50’s and 60’s through to the rock-tinged hitmakers of the modern era.\n“It really grew out of the ‘Patsy’ shows,” Mild said. “I realized that all the women singers I was listening to are kind of her legacy…she was the blueprint that laid the groundwork for them to become the marquees and bring the glamour. And there’s no denying that each of the women I’m featuring in this new show has done just that.”\nMild will be offering a swath of music from some of the most successful female country artists in history, including, among many others, The Judds, Shania Twain, Tanya Tucker, Dolly Parton, Reba McEntire, Trisha Yearwood, Tammy Wynette, Taylor Swift (yes, she was originally a country artist before crossing over), Martina McBride, Little Big Town, The High Women, Casey Musgraves, and of course, the incomparable Loretta Lynn.\n“She was an inspiration,” Mild said. “She made me think about these singers and what they went through to get where they are. When you really listen to their songs, they’re filled with what those women think is important. The messages are as profound as the music.”\nMild will be weaving many of those stories into her show, an element that will make the evening much richer. “These women have always lifted each other up, and I think this show will do the same for the audience,” Mild said. “It will be toe-tapping, heartwarming, and inspiring, with songs you’ll all know.”\nMild will have a terrific band backing her up, with musical director Jim Rice on piano, Mike Emerson on guitar, Gary Rivenson on bass, and Gary McDonald on drums. “It’s a great band,” she said. “We’re going to have a blast.”\nTickets for “This One’s For The Girls: Women of Country Music” are available at redbarntheatre.com or 305-296-9911. It is highly recommended that tickets be purchased early, as Mild’s shows always sell out. Sponsored in part by Culture Builds Florida, and the Monroe County Tourist Development Council.\nAuthor\nSusannah Wells\nDate\nJuly 28, 2023\nA TUNA CHRISTMAS\nDecember 19, 2023 - January 13, 2024\nWritten By: Jaston Williams, Joe Sears & Ed Howard\nShows: Tuesdays-Saturdays at 8pm\nIn the third-smallest town in Texas, radio station OKKK news personalities report on Yuletide activities.The hilarity never lets up in this comedic romp for all seasons featuring many colorful Tuna denizens played by two very funny actors.\nStarring: Brandon Beach & David Black\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nReview of A Tuna Christmas\nAuthor\nSusannah Wells\nDate\nJuly 28, 2023\nSHORT ATTENTION SPAN THEATRE: PARALLEL UNIVERSES\nApril 7 - 29, 2023\nCollection of Short Plays\nShows: Tuesdays-Saturdays at 8pm\nOne of our always-popular favorites, “Short Attention Span Theatre, 2023” — The funny and fast-paced evening is filled with pertinent and hilarious short plays, helmed by a group of directors guiding a big handful of favorite Key West actors. You never know what you’ll see next at SAST!\nThe Red Barn Journeys to “Parallel Universes” in Short Attention Span Theatre\nThere are those who believe our universe – the one our planet and galaxy currently exist within – is but one of many such universes, involving multiple dimensions, overlapping times, and repeating histories. While that concept may be hard to wrap your head around, the Red Barn Theatre in Key West may be able to help.\nTheir perennial favorite production, “Short Attention Span Theatre”, will return to their stage April 7 – 29, with this year’s theme being “Parallel Universes”. It’s an evening of six eclectic new one-act plays, each of which will take a skewed, often hilarious, look at the world (or universes) we live – or may live -- within.\n“They’re all comedic plays, but they’re meaty,” said Mimi McDonald, who is executive producing the show. “They’ll make you laugh, but they’ll also make you think.  They’re about things that could happen, or could be, or that make you wonder about reality. The show’s colorful, lots of cool costumes, lots of good music. It’s a great evening if you’re looking for something fun and out of the ordinary.”\nMcDonald spent a lot of time finding just the right plays for this year’s show. She researched the best new short plays that have won awards from 2021 and beyond, and took advantage of her relationship with Miami’s City Theatre, which is well-known for their short play roster. Each play McDonald chose has its own world and reality, with characters and situations that not only surprise but are highly entertaining.\n“The concept of SAST is good writers, good actors, good directors,” she said. “I wanted new things by published writers. And we found them, for sure…David Ives is always good, and Laurie Allen. It’s hard to pick favorites -- they’re all terrific.”\nOnce again the entire McDonald theatrical clan – Mimi, husband Gary, daughter Amber, and son Jack – will be behind the scenes directing the various plays and creating the clever sets. They’ll be joined by Key West photographer/playwright Mike Marrero.\n“Our kids have grown up in the theater,” McDonald said, “and it’s nice to have the youthful perspective on these particular plays. And Mike’s got a real sense of humor too. The audiences are going to be laughing a lot.”\nIt’s a rich veteran cast of solid Key West favorites they’ll be directing: Susannah Wells, Erin McKenna, Arthur Crocker, Cassidy Timms, Jeremy Zoma, and Iain Wilcox. Expect them to be pushing the envelope far into the parallel universes.\nTickets for “Short Attention Span Theatre: Parallel Universes” are available at redbarntheatre.com or by calling the Red Barn box office at 305-296-9911. Ticketholders for the Opening Night performance on April 7 will be invited to join the cast and crew for a catered Opening Night Reception in the Zabar Courtyard, catered by Michelle Chennault.\nThe show is sponsored by Restorative and Aesthetic Dentistry of the Keys, Design Group Key West, and by grants from Culture Builds Florida, and the Monroe County Tourist Development Council.\nAuthor\nSusannah Wells\nDate\nAugust 5, 2022\nTHE CODE\nMarch 7 - 25, 2023\nWritten By: Michael McKeever\nShows: Tuesdays-Saturdays at 8pm\nMichael McKeever’s new play, “The Code” will grace the Red Barn stage March 7-25, as McKeever revisits one of his favorite subjects, Hollywood. It’s 1950, and Billy Haines, Henry Wilson, Tallulah Bankhead, and a beautiful young man have gathered for cocktails, caviar, and all-out war. With great humor and stinging insight, “The Code” explores the hypocrisy of what it takes to be a man in the land of make-believe. It will feature Tom Wahl, David Black, Mary Falconer, and Carlos Ortega Amorin.\nPhoto by: Roberta DePiero\nActors: (l to r) Tom Wahl, Mary Falconer, David Black, Carlos Ortega Amorin\nRED BARN BRINGS OLD HOLLYWOOD BACK WITH MICHAEL MCKEEVER’S NEWEST, “THE CODE”\nIt’s true: the more things change, the more they stay the same. Or, since we’re in today’s Florida, it might be more relevant to say that no matter the strides we’ve made over the years, there’s always someone who sees the old ways as preferable.\nWhile playwright Michael McKeever may not have set out to write a play that resonates so vibrantly with what many in our community are struggling against today, his latest play, “The Code”, running March 7-25 at Key West’s Red Barn Theatre, does just that. Written about Hollywood in the 1950’s, it is most certainly germane to the LGBTQ issues that have arisen in today’s Southernmost State.\nThe play is set in the stylish home of Billy Haines, an actual silent film megastar who left the film business for personal reasons that become apparent as the story unfolds. Haines, now a successful interior designer, has invited a few friends for cocktails before they head out to a dinner party at famed director George Cukor’s house. Those friends include the glamorous and unfiltered film star Tallulah Bankhead; the oily and unpleasant agent, Henry Willson; and Willson’s latest find (and love interest) – aspiring young actor Chad Manford.\nAs the evening unfolds, it becomes clear that the “Code” which quickly dominates the conversation refers to the surreptitious rules that Hollywood has imposed to govern the way anyone LBGTQ has to behave in order to have a career and hope to succeed in Tinseltown. It’s a 1950’s version of “Don’t Ask, Don’t Tell” seasoned with some “never admit” and a lot of “deny who you are and live a lie or go home”. To be gay in an industry policed by the Legion of Decency, the Hayes Code, and the House Un-American Activities Committee can not only get you labeled a deviant and a subversive, but it’s without doubt a death knell for a career on the silver screen.\nMcKeever’s skill with witty, very funny banter mixes perfectly with his ability to take a look at history from a different perspective. He channels Bankhead’s famous cutting wit, and nails the blackhearted Svengali a compromised agent can be. The play elicits its full share of laugh-out-loud moments in the way it looks at Old Hollywood and it’s foibles, but in the era of Florida’s “Don’t Say Gay” and overt attempts at marginalization of the LGBTQ community, it has serious moments of resonance to modern times that cannot be missed.\nThe play stars South Florida favorite Tom Wahl as Haines, Key West favorites Mary Falconer as Bankhead and David Black as Willson, and showcases newcomer Carlos Ortega Amorin as Manford. It will be directed by Christopher Renshaw, the accomplished British director who helmed the World Premiere of the play last year. Renshaw has a Tony nomination and a couple of Drama Desk Awards for his play direction, and will be directing a new play based on the life of Louis Armstrong next year on Broadway. It’s a coup to have him directing here in Key West.\nTickets for “The Code” can be purchased at redbarntheatre.com or by calling the Red Barn box office at 305-296-9911. Ticketholders for Opening Night, March 7, are invited to remain after the show for the Opening Night party, where they can mingle with the cast and crew and enjoy a light nosh.\nThe play is sponsored in part by Royal Furniture, Design Group Key West, Culture Builds Florida, and the Monroe County Tourist Development Council.\nAuthor\nSusannah Wells\nDate\nAugust 4, 2022\nFLAMING GUNS of the PURPLE SAGE\nJanuary 31 - February 25, 2023\nWritten By: Jane Martin\nShows: Tuesdays-Saturdays at 8pm\nBe ready to take a wild and crazy ride into the classic mash-up spoof of a Western-Horror “B” movie with Jane Martin’s hilarious “Flaming Guns of the Purple Sage”. Big 8, a rodeo competitor, is facing foreclosure on the Wyoming ranch where she rehabilitates injured rodeo cowboys. The arrival of a shocking woman named Shedevil and a one-eyed Ukrainian biker named Black Dog leads to violence and horror in this satire of pulp western writers like Zane Grey. It will feature George DiBraud, Susannah Wells, Cassidy Timms Iain Wilcox, Tim Dahms, and Mathias Maloff.\nView fullsize\nView fullsize\nView fullsize\n“FLAMING GUNS OF THE PURPLE SAGE” BRINGS THE OUTRAGEOUS WILD WEST TO THE RED BARN\nImagine Hopalong Cassidy trying to date Carrie, or Miss Kitty chasing Chuckie around the corral with a meat cleaver in an Addams Family version of “Gunsmoke,” and you may get close to the outrageous fun and outright craziness awaiting you in the Red Barn’s next production.\n“Flaming Guns of the Purple Sage”, written by the always-hilarious and rapier-sharp Jane Martin (“Says She”), opens January 31 and runs Tuesdays through Saturdays through February 25. It’s a preposterous mash-up of B-movie westerns and C-movie horror flicks that will literally have you laughing until you cry, even while you’re sitting in disbelief at what you’re seeing on stage.\n“I just love its audacity,” said director Joy Hawkins. “It’s unlike anything I’ve ever directed before. It’s full of macabre people you love and hate at the same time. We can’t get through a rehearsal without laughing ‘til our sides ache.”\nWithout giving away too much (because the surprises are everything in this tale), “Flaming  Guns” tells the story of Big 8, a retired rodeo star who’s trying to keep her home from being foreclosed on. Living with her is Rob Bob, a rising young rodeo star (think more Gomer Pyle than John Wayne). Into this household comes SheDevil (her choice of name) who is pregnant by Big 8’s ne’er-do-well son, Lucifer Lee. But SheDevil is being hunted down by her very angry Ukrainian biker boyfriend, Black Dog, and when he shows up, things really begin to get interesting.\n“Be aware,” Hawkins said, “that there is, indeed, a lot of violence and blood and sex all mixed in, but it’s done in a very farcical and satirical way. Be advised -- it’s definitely for adults…I wouldn’t bring the kids. But it’s a very cleverly-written send-up of those old B-movie Westerns and horror flicks. This is all fun and laughs about how crazy – in a very funny way -- human beings can be.”\nThe play stars a terrific mix of Key West’s best comedic actors, including George DiBraud, Susannah Wells, Mathias Maloff, Tim Dahms, Cassidy Timms, Iain Wilcox, and Jack McDonald. Hawkins directs and Carmen Rodriguez will be designed the western duds.\nCurtain Up called it “a crowd-pleaser that keeps the audience howling”. The Courier-Journal calls it “hilarious and rip-snortin’”, and Concord Theatricals dubs it a “shoot ‘em up, knock ‘em up, cut ‘em up comic romp.”\nRead KONK Life Review by Emily Weekley\nRead Konk Life Review by Emily Berg\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nAuthor\nSusannah Wells\nDate\nAugust 3, 2022\nBACK IN BABY'S ARMS | CHRISTINE MILD SINGS PATSY CLINE\nJanuary 18 - 21, 2023\nThis special musical event, “Back in Baby’s Arms”, features the voice and stylings of Christine Mild, who has played Patsy Cline in the popular “Always, Patsy Cline” play dozens of times, including a sold-out run at the Red Barn in 2018. Expect to hear many of Cline’s biggest hits, with the stellar accompaniment of arranger/pianist Jim Rice and trio.\nAuthor\nSusannah Wells\nDate\nAugust 2, 2022\nDear Jack, Dear Louise\nDecember 20, 2022 - January 14, 2023\nWritten By: Ken Ludwig\nShows: Tuesdays-Saturdays at 8pm\nSparks fly and love blossoms across the darkened landscape of World War II, when Jack, a U.S. Army doctor, begins a letter correspondence with Louise, an aspiring actress living a world away from his war-torn reality. The play won the Helen Hayes and Charles MacArthur award for Best New Play of 2020. It will feature Jessica Miano Kruel and Cody Borah.\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nKEN LUDWIG’S “Dear Jack, Dear Louise” OPENS THE RED BARN’S 43RD SEASON\nIn the 21st Century’s fast-paced digital culture, the personal letter, handwritten on fine stationery from one person to another, has all but disappeared -- become a lost art few seldom indulge in anymore. Emails, texts, Tweets, Instagrams, connection apps – these are the main means of communication between people in a world increasingly dominated by the code of a metaverse we no longer actually touch.\nPerhaps this was on the mind of playwright Ken Ludwig when he sat down last year to pen his Helen Hayes Award Winning play, “Dear Jack, Dear Louise.” Because the heart of the play is about just that – personal, handwritten letters that passed between a World War II Army doctor and a Broadway starlet working at the Stage Door Canteen in New York during the war. And they’re not just any letters – these were epistles that formed the joyous, heartwarming story of Ludwig’s parents’ long-distance courtship and eventual marriage.\n“Dear Jack, Dear Louise” is set to make its South Florida debut December 20th as the opening production of the Red Barn’s 43rd Season in Key West, with a run that goes through January 14th of 2023. It will star Key West favorites Jessica Miano Kruel as Louise Rabiner, an aspiring actress and dancer in New York, and Cody Borah as Captain Jack Ludwig, a military doctor then stationed in Oregon. The Barn’s Artistic Director, Joy Hawkins, will direct.\n“It’s a good, old-fashioned story,” Hawkins said. “And I think it’s special to have such an unabashed love story in these times. It takes you back. And it’s pertinent right now as we’re dealing with war in the world. It’s sweet, it’s funny, but it’s also real – these were real people, living real lives, and we’re privileged to watch how they managed to fall in love under such circumstances.”\nLudwig and Rabiner, living on opposite sides of the country in 1942, strike up a correspondence at the urging of their parents, who were old friends. They find a rapport right away – he encouraging her with auditions, she commiserating over his hardass commanding officer. It’s not all fun and games, though, as the ugly situation in the world encroaches on their connection.\nThe show isn’t schmaltzy either, in great part due to the way it’s staged, with the two characters on stage together but separately – he in his world on one side of the stage, and she in hers on the other. The beauty of the play is in the way the characters build chemistry in front of the audience’s eyes without ever looking at one another. And they’re not reading the letters – they’re living the words we understand they wrote.\n“It’s captivating to watch,” Hawkins said. “We’re not sure they’ll ever get together, but it’s a beautiful ending. I hope the audience will feel connected to their own experiences, and maybe those of their own parents.”\nThe Washington Post said the play is “…a poignant, funny tribute to the enduring power of human connection.” The Lit Arts Maven said, “One of the finest theatre experiences I have had in 25 years of reviewing.”\n“Dear Jack, Dear Louise” runs December 20 – January 14, excepting Christmas Eve and Christmas, and New Year’s Eve and New Year’s Day. Tickets are available at redbarntheatre.com/tickets or by calling 305-296-9911, 3-5 pm weekdays.\nThe Red Barn season is sponsored in part by the Monroe County Tourist Development Council, and the State of Florida Division of Cultural Affairs.\nAuthor\nSusannah Wells\nDate\nAugust 1, 2022\nHurricane Diane\nMarch 22 - April 16, 2022\nWritten By: Madeleine George\nThe hilarious HURRICANE DIANE stars Lauren Thompson, Susannah Wells, Erin McKenna, Jessica Miano Kruel, and Caroline Taylor.\nHILARIOUS “HURRICANE DIANE” BLOWING INTO THE RED BARN THEATRE\nWhat if the Greek God Dionysus, deity of wine and ecstasy, suddenly walked into your kitchen and announced that it was time mankind shaped up and started taking care of “his” planet and that you and your girlfriends were going to be the first acolytes in his quest to bring the Earth back to its natural, unsullied state? What could go wrong, right?\nThis is the reality-bending set-up for the hilarious new play, “Hurricane Diane”, set to open at the Red Barn Theatre in Key West on March 22 for a four-week run. Written by Pulitzer Prize finalist Madeleine George, the play will feature a who’s who of Key West women, including Erin McKenna, Caroline Taylor, Susannah Wells, Jessica Miano Kruel, and Lauren Thompson. It will be directed by Red Barn artistic director, Joy Hawkins.\nGeorge launches her play right from “Lights Up”. We meet Dionysus immediately, though not as we might expect. He has morphed into a rabble-rousing lesbian gardener from Vermont named Diane, and she’s chosen four suburban New Jersey housewives – think a sophisticated, socially-conscious version of a “Real Housewives” show and you won’t be far off – to join his efforts at reclaiming the natural beauty of the planet.\nThe four women all live on a cul-de-sac in flood-prone Red Bank, New Jersey in identical cookie-cutter houses. They regularly gather over wine and coffee to gossip about anything but the latest portents for the climate. There’s control freak Carol, who just wants a well-manicured lawn; and Renee, a top editor at HGTV Magazine; and Pam, an Italian dragon in animal prints; and weepy Beth, who’s just been left by her husband.\nInto this coffee klatch comes lesbian landscape gardener Diane, livid at humanity for “despoiling the green earth that gave you life.” She has great plans – not the least of which involve indulging her Dionysian proclivities – and she’s going to begin right here, right now.\nWill Diane be able to enlist them all? Will this diverse band of suburban women be inspired by the appetites of their divine visitor to unleash their wildness to help the battered planet? Maybe. Maybe not. You’ll have to see.\nTo say the play is outrageously funny is a given. But it also carries a subtextual message that has profound relevance in this day and age. Called “incisively smart and boisterously funny” by the Boston Globe, “clever and timely” by New York Theater, and “An astonishing new play” by the NY Times, “Hurricane Diane” lives up to its fantastical premise.\nTickets are available at redbarntheatre.com or by calling 305-296-9911. The play is sponsored in part by The Dogwood Foundation, Design Group Key West, and the Monroe County Tourist Development Council.\nAuthor\nSusannah Wells\nDate\nApril 16, 2022\nQuarantine For Two\nFebruary 15 - March 12, 2022\nWritten By: Hy Conrad\nA world premiere of a wickedly funny new play by Hy Conrad. Hy, the well-known Key West resident who wrote a good many of the\nMonk\nepisodes, as well as\nWhite Collar,\nand the recent hit,\nThe Good Cop,\nhas taken the trials and tribulations of our pandemic quarantine and turned them hilariously on their heads. The play mixes comedy, intrigue, (and of course) murder, and a neck-bending twist that you won't see coming.\n“QUARANTINE FOR TWO” TO PREMIERE AT RED BARN\nGod knows there hasn’t been much to laugh about the last couple of years. Pandemics tend to lean that way.\nBut thanks to Hy Conrad – the writer/producer of the very funny “Monk” series – we’ll get a chance to shake off a little of the downside of things when his new play, “Quarantine For Two”, opens a four week run on February 15th at Key West’s Red Barn Theatre. The production marks the play’s American premiere.\n“Hy and I were chatting one day,” said artistic director Joy Hawkins, “and we thought a funny play about this might be good for people, to lighten things up a bit. And who better to do that than Hy Conrad?”\nThe play centers on a typical, middle-aged, suburban couple – played by David Black and Mimi McDonald – who have been quarantining at home for more than a year. But it hasn’t gone well. In fact, they’ve driven each other crazy, to the point that each has come to the conclusion that for their own sanity, they need to kill the other. How they go about that – with the involvement of a somewhat dim and double-dealing poolboy-turned-hitman played by Rhett Kalman – leads to a very hilarious escalation of complications.\n“I tend to write toward comedy and crime,” Conrad said. “The idea of two people in lockdown who desperately want to kill each other seemed to make comic sense, if we want to make light of our fears in the moment. Balancing the truth in the Covid situation with finding the humanity in the characters and making it funny was the challenge.”\nBut Conrad makes it work exceptionally well. In a private reading of the play last summer, it was hard for the cast and crew to get through the script without breaking into laughter.\n“The last two years have been so surreal and ludicrous and crazy,” Hawkins said. “So let’s just jump in and laugh at the predicament we’ve all been in. Because somewhere in all of this, we really do need to find a laugh.”\nAnd as she said, who better than Hy Conrad to give that to us?\nTickets for “Quarantine For Two”, the second of the Red Barn’s season of “Bright and Brilliant Comedies”, are available now at redbarntheatre.com or by calling 305-296-9911.\nThe play is sponsored in part by Jane Gardner Interiors, the Florida Department of State Division of Cultural Affairs, and the Monroe County Tourist Development Council.\nAuthor\nSusannah Wells\nDate\nMarch 14, 2022\nVail Johnson \"Bassically Incorrect\"\nMarch 6 & 7, 2022\nLimited engagement — 2 nights only!\nBASSIST FOR THE STARS: VAIL JOHNSON TELLS ALL IN RED BARN LIMITED ENGAGEMENT\nYou might not recognize him on the street nor know his name, but you’ve probably seen him onstage and you’ve most certainly have heard him…probably many times.\nVail Johnson is his name, and he’s a bassist. Not just any bassist, mind you, but THE bassist when it comes to studio work, recordings, and live performance.  He’s been doing it for over 40 years with some of the top names in music, and he’s bringing a career-ful of behind-the-scenes stories and almost every note of the great music he’s had a hand in to the Red Barn Theatre in Key West.\nHis one-man show, “Bassically Incorrect: Around the World in 40 Years” will have a limited engagement at the Barn Sunday and Monday, March 6 and 7 only. Tickets are available now at redbarntheatre.com or by calling 305-296-9911.\nWant some names he’s put the bottom under? How about Kenny G, Whitney Houston, Herbie Hancock, Stevie Nicks, Keb’ Mo’, George Benson, Michael Bolton, James Ingram, Gil Scott Heron, Paula Abdul, MC Hammer, T. Graham Brown, David Cassidy, Steve Perry, Patti Austen, Peabo Bryson, Edgar Winter, and Christopher Cross, just to name a very few.\n“It just sort of happened,” Johnson said recently. “I was playing in a lounge band back in the late 70’s, and Kenny G’s percussionist sees me, brings Kenny to the gig, and the next thing I know, I’m playing in Kenny G’s band. We go to LA, and Stevie Nicks sees me at a gig, and asks me to do her record. It just snowballed from there.”\nIt wasn’t all luck, however. Johnson was ready when the door opened. The youngest of seven brothers (one of his older siblings is Key West’s Jeff Johnson), Vail was immersed in all kinds of music through his family – classical, choral, gospel, bluegrass, Dixieland, Top 40. He absorbed it all, mixing in whatever he came across, including jazz, hip-hop, metal rock, and pure improvisation. His virtuosity, passion, and humor were his calling card, and his ability to play virtually any style extremely well sealed the deal.\nAnd all of it is on display in his one-man show – from Kenny G’s, George Benson’s, and Herbie Hancock’s jazz to Steve Perry’s and Stevie Nicks’s rock, to Peabo Bryson’s soul and Keb’Mo’s blues.\n“I tell stories about the artists I’ve played and toured with, and then play and sing along with the tracks I’ve done with them or played on tour. I do some of my own stuff too. And what I do is not just ‘play bass’…people are surprised what I can do on a bass in terms of playing music. Look…it’s a guitar. It just happens to be a bass. I can make it sound like a Spanish guitar, or bluesy finger-picking, or monster slapping.”\nAsk Johnson who was the most fun he’s had with any artist, and the answer might surprise you. “Edgar Winter,” he said. “For me to play ‘Frankenstein’ with Edgar Winter? Man, that was freakin’ fun!”\nIt doesn’t matter what style of music or what particular artist you like personally – there’s a very good chance Vail Johnson will tell you a story about touring with them, or play something you’ve heard by them in his show. And odds are you’ll say, “Oh, yeah! I know that one! He played bass on that?”\nTickets for “Bassically Incorrect” are two-tiered. For the Sunday, March 6 show, all tickets are $60. For Monday night’s show, they’re $75, but that gets you an invite to the catered after-party in the Red Barn courtyard, where you can meet and talk music with Vail Johnson and enjoy some delish foods.\nYou’ll also be able to purchase some of Vail’s own CDs both evenings, the proceeds from which will be going directly to the Florida Keys SPCA.\nThis show is sponsored in part by Design Group Key West, and the Monroe County Tourist Development Council.\nAuthor\nSusannah Wells\nDate\nMarch 7, 2022\nSHORT ATTENTION SPAN THEATRE: “ALTERNATIVE FACTS”\nApril 8 - May 3, 2025\nCollection of Short Plays\nShows: Tuesdays-Saturdays at 7:30pm\nAn evening of eclectic short plays, each a unique journey with a diverse collection of voices and stories; playwrights from all parts of the spectrum, and a wide range of styles and genres – an intriguing mix of characters who are in conflict with larger forces —from a catering job for a engagement party with a missing bride, a chance meeting on the Golden Gate bridge, two audience members that insist on World Premieres, a fiancé is put to the test when she meets her possible inlaws, two FBI agents interrogate a newscaster when a newsroom is hijacked, and one surprise ending. Always a season favorite show at the Red Barn.\nCast\n: Erin McKenna, Cassidy Timms, Nina Pilar, Mathias Maloff, Zach Franchini\nDirectors\n: Mimi McDonald, Gary McDonald, Jack McDonald, Amber McDonald Good\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nRead review\nCast of Short Attention Span Theatre: “Alternative Facts”\nRED BARN SHINES WITH “SHORT ATTENTION SPAN THEATRE”\nThere’s an old saying in theater: “When you find a gem, let it shine.”\nKey West’s Red Barn Theatre found such a gem over a decade ago, and they’ve been letting it shine in most of their seasons since. It’s called “Short Attention Span Theatre”, and it’s proven to be one of the most popular shows the theater offers each year. This season will be no different.\nIt’s a simple concept – pick a mixed slate of funny, powerful, poignant, or simply off-the-wall short plays and populate them with some of the area’s top comedic talent, then string them together for an evening of stellar fun. Each year, the Red Barn’s resident family – the McDonalds – find six or seven wonderful new plays and pull them together under a title that relates to them all. This year’s theme: “Alternative Facts”, which anyone will agree, certainly is relevant to the times.\n“One of the things I love most about Short Attention Span Theatre (SAST),” said the Red Barn’s Managing Director Mimi McDonald, “is that it gives us the opportunity to explore a number of different voices and new playwrights in one show. And it seems to many of us that the human condition is evolving right now, and these playwrights are noticing that and commenting on what’s happening in a very comedic way. And we have such great comedic actors all doing a variety of very funny characters in this one.”\nThis year’s rendition of SAST will star Erin McKenna, Mathias Maloff, Cassidy Timms, Nina Pilar, and Zach Franchini. They appear in various combinations during the evening of eclectic plays that focus on characters who are in conflict with larger forces – from a catering job for an engagement party with a missing bride; a chance meeting on the Golden Gate Bridge; two audience members who insist on world premieres; a fiancé is put to the test when she meets her possible in-laws; and two FBI agents who interrogate a newscaster when a newsroom is hijacked.\n“It’s a fast, fun evening,” said McDonald, “but there’s a message or two in there as well.”\nAs they do every year, the entire McDonald family shepherds this show to the stage, with each of them directing, building sets, handling the tech, and more. Along with Mimi are her husband Gary, and their two (now adult) children, Amber and Jack.\n“We’ve been a theater family for more than 45 years,” Mimi said. “It’s in our blood, and we have such a great time working together on this show. It’s always a big hit.” Or to put it another way – it’s a gem.\nTickets for “Short Attention Span Theatre: Alternative Facts” are available at KeysTix.com, redbarntheatre.com, or by calling the box office at 305-296-9911. Note that all curtain times are 7:30 pm.\nAuthor\nSusannah Wells\nDate\nMay 5, 2025\nBROOKLYN LAUNDRY\nMarch 4 - 29, 2025\nWritten By: John Patrick Shanley\nShows: Tuesdays-Saturdays at 7:30pm\nWritten by John  Patrick Shanley, the Pulitzer Prize- and Tony-winning author of Doubt and the Oscar®-winning writer of Moonstruck. Sometimes big things start from little things; in this case, a bag of laundry. Shanley’s latest is about three sisters, a guy who runs a laundry in Brooklyn, and the sometimes savage tricks life plays on them. Tragic and funny by turns, this story will remind you what is important in life... and the sorrow and joy of fully embracing adulthood.\nCast\n: Jessica Miano Kruel, Michael Castellano, Lauren Thompson, Donna Stabile\nDirector\n: Joy Hawkins\nMichael Castellano and Jessica Miano Kruel | Photo by Roberta DePiero\nROMANCE BLOOMS IN THE RED BARN’S CHARMING “BROOKLYN LAUNDRY” BY JOHN PATRICK SHANLEY\nIt’s been said that chance meetings are often an aphrodisiac moment out of which true love may bloom. That doesn’t guarantee it will be an easy germination, of course…just that there’s an outside chance for an acceptable blossom.\nPlaywright John Patrick Shanley endearingly lets us watch such a flowering in his latest play, “Brooklyn Laundry”, running March 4-29 at the Red Barn Theatre in Key West. Shanley, author of the romantic megahit “Moonstruck”, is a master of the charming, imperfect love story, and this play fits his model well.\n“Brooklyn Laundry” is about three sisters and a guy who runs a laundry in that New York borough. Fran is a single woman and bone-tired of being so, whose sisters each have their own crosses to bear. Trish is dealing with a threatening illness, and Susie with a dissolving marriage, and each of them is turning to Fran, who is feeling overwhelmed with it all.\nThen one day, Fran takes a bag of laundry to the cleaners in her building and runs into the owner, Owen, whose sweetly gruff adorability breaks through her protective barriers and sparks something between them. Owen, too, has had to deal with some unexpected twists in his life, but he uncharacteristically rises to and goes with the moment, asking Fran to dinner. From there on, Shanley takes us on an utterly charming and very funny ride into a story of two people trying to find balance in their lives despite the bumps that come their way.\nThe Red Barn production stars a quartet of top local actors, including Jessica Miano Kruel, Michael Castellano, Donna Stabile, and Lauren Thompson. It is directed by Joy Hawkins, the Barn’s artistic director.\n“It’s a beautiful play,” Hawkins said, “nicely written, funny, tender, and heartwarming. It does deal with some situations we sometimes have to deal with in life, and it might bring some tears here and there, but you’ll leave the theater feeling really good. It’s very life-affirming, with characters you can really root for.”\nThe New York Times called the play “Utterly charming.” The New York Theatre Guide said, “Forget the dating apps – maybe the laundromat is the place to find your next great love…”.\nTickets are available at KeysTix.com, or at redbarntheatre.com. For more information, call the box office at 305-296-9911. All shows for the March 4-29 run are at 7:30 pm. The production is sponsored in part by Florida Arts and Culture, and the Monroe County Tourist Development Council.\nAuthor\nSusannah Wells\nDate\nMarch 5, 2025\nMS HOLMES AND MS WATSON, APT 2B\nJanuary 28 - February 22, 2025\nWritten By: Kate Hamill\nShows: Tuesdays-Saturdays at 7:30pm\nAn irreverent, darkly comic, modern take on Sir Arthur Conan Doyle’s famous sleuth and sidekick, this fast-paced romp re-examines the world’s most famous detective story with a bold new feminist lens. In this highly theatrical, small-cast escapade, oddball female roommates Sherlock (yes, it’s also a girl’s name—wait, is it a girl’s name? Is it even a name?) Holmes & Joan Watson join forces to emerge from pandemic fog as a deeply codependent, quasi-dysfunctional Odd Couple adventure duo—solving mysteries and kicking butts, until they come face to face with a villain who seems to have all of the answers.\nWinner of the Off-Broadway Alliance Award\nCast\n: Susannah Wells, Mariah Woessner, Arthur Crocker, Morgan Fraga Pierson\nDirector\n: Mimi McDonald\nCostumes\nby Sushi\nMariah Woessner and Susannah Wells | Photo by Roberta DePiero\nMYSTERY ABOUNDS IN RED BARN’S “MS. HOLMES, MS. WATSON, APT.2B”\nEveryone loves a good mystery. And who better to confound us with one than Sir Arthur Conan Doyle, who then sends his most famous detective, Sherlock Holmes, to unravel even the most convoluted of mysteries for us?\nAh, but there’s a hilarious rub in all of this! In the Red Barn Theatre’s latest offering of their 45th remarkable season – “Ms. Holmes, Ms. Watson, Apt. 2B”, running January 28 through February 22 – we are presented with a tale that cheerfully desecrates the stories of Conan Doyle in a most unusual and very funny way.\nBecause in Kate Hamill’s energetic play, the world’s most famous detective is a frazzled female police consultant whose dazzling deductions astound everyone. She takes on a new roommate – a wayward American who Holmes determines is running from a past where she used to be a doctor and needs a little help and refocusing. Portrayed as a deeply co-dependent, quasi-dysfunctional Odd Couple, this duo proceeds into a fast-paced and wildly entertaining romp through multiple violent crimes that all seem to lead to notorious villains.\nThe pair solve a variety of these crimes, from the murder of a man found in a motel to the case of a right-wing politician who cheated on his wife. It’s a blend of classic theater and modern comedy that balances mystery with laugh-out-loud humor, playfully dismantling and, at the same time, celebrating the conventions of Conan Doyle’s stories.\n“We’re really having a good time,“ said director Mimi McDonald. “The intimacy of the Red Barn allows the audience to take the ride with the actors. At the heart of it is a real mystery, with twists and turns, and a few real surprises. We know the audience is going to have a ball solving the mystery right along with us.”\nSusannah Wells, one of Key West’s best comedic actresses, stars as Ms. Sherlock Holmes, and Mariah Woessner is the perfect complement as Ms./Doctor Watson. Joining them and playing a number of unexpected and mysterious/villainous characters are Arthur Crocker and Morgan Fraga Pierson, both no slouches when it comes to comedic chops.\n”One thing I’m sure everyone will love are the costumes,” said McDonald, who commissioned iconic Key West costumer Gary Marion – better known as Sushi – to create original costumes for the play. “They’re really something – a kind of apocalyptic theme and a warrior vibe, that adds another whole dimension to the story.”\nCalled “…laugh-out-loud funny, incredibly clever, inherently theatrical, and a delight from start to finish..” and “…sharp, playful, and moves at a rapid-fire pace…” by the Portland Monthly, “Ms. Holmes, Ms. Watson, Apt. 2B” is a great way to spend an evening deducting, finding clues, and solving mysteries. The game’s afoot!\nRunning January 28 through February 22. All curtains are at 7:30 pm. Tickets at keystix.com. For more information, call the Red Barn box office at 305-296-9911.\nSponsored in part by the William L. Monroe III Foundation, and the Monroe County Tourist Development Council.\nAuthor\nSusannah Wells\nDate\nFebruary 1, 2025\nGERRI LOUISE STANDUP: SENIOR MOMENTS OR WHAT THE HELL HAPPENED?\nFebruary 16 & 17, 2025\nLimited engagement — 2 nights only!\nShows at 7:30pm\nIf there’s a funnier woman living and working in Key West theatre, we’d like to meet her. Gerri Louise can make you laugh in one second, with one word. With an astute eye, an always-open ear, and a quick mind, it just comes naturally to her. She’s graced all our stages – in both straight plays and her own stand-up comedy. These two special nights of comedy feature an all-new basket of classic Gerri Louise. Of her comic perspective, Gerri says,  \"You have to make the littlest things in life funny for yourself...make them all a celebration, no matter what they are. That way every day is a good day and you go to sleep having smiled all day.”\nAuthor\nSusannah Wells\nDate\nJanuary 31, 2025\nVAIL JOHNSON IS BASSICALLY INCORRECT | ALL NEW SHOW!\nFebruary 9 & 10, 2025\nLimited engagement — 2 nights only!\nShows at 7:30pm\nBASSIST FOR THE STARS: VAIL JOHNSON TELLS ALL IN RED BARN LIMITED ENGAGEMENT\nYou might not recognize him on the street nor know his name, but you’ve probably seen him onstage and you’ve most certainly have heard him…probably many times.\nVail Johnson is his name, and he’s a bassist. Not just any bassist, mind you, but THE bassist when it comes to studio work, recordings, and live performance.  He’s been doing it for over 40 years with some of the top names in music, and he’s bringing a career-ful of behind-the-scenes stories and almost every note of the great music he’s had a hand in to the Red Barn Theatre in Key West.\nWant some names he’s put the bottom under? How about Kenny G, Whitney Houston, Herbie Hancock, Stevie Nicks, Keb’ Mo’, George Benson, Michael Bolton, James Ingram, Gil Scott Heron, Paula Abdul, MC Hammer, T. Graham Brown, David Cassidy, Steve Perry, Patti Austen, Peabo Bryson, Edgar Winter, and Christopher Cross, just to name a very few.\n“It just sort of happened,” Johnson said recently. “I was playing in a lounge band back in the late 70’s, and Kenny G’s percussionist sees me, brings Kenny to the gig, and the next thing I know, I’m playing in Kenny G’s band. We go to LA, and Stevie Nicks sees me at a gig, and asks me to do her record. It just snowballed from there.”\nIt wasn’t all luck, however. Johnson was ready when the door opened. The youngest of seven brothers (one of his older siblings is Key West’s Jeff Johnson), Vail was immersed in all kinds of music through his family – classical, choral, gospel, bluegrass, Dixieland, Top 40. He absorbed it all, mixing in whatever he came across, including jazz, hip-hop, metal rock, and pure improvisation. His virtuosity, passion, and humor were his calling card, and his ability to play virtually any style extremely well sealed the deal.\nAnd all of it is on display in his one-man show – from Kenny G’s, George Benson’s, and Herbie Hancock’s jazz to Steve Perry’s and Stevie Nicks’s rock, to Peabo Bryson’s soul and Keb’Mo’s blues.\n“I tell stories about the artists I’ve played and toured with, and then play and sing along with the tracks I’ve done with them or played on tour. I do some of my own stuff too. And what I do is not just ‘play bass’…people are surprised what I can do on a bass in terms of playing music. Look…it’s a guitar. It just happens to be a bass. I can make it sound like a Spanish guitar, or bluesy finger-picking, or monster slapping.”\nAsk Johnson who was the most fun he’s had with any artist, and the answer might surprise you. “Edgar Winter,” he said. “For me to play ‘Frankenstein’ with Edgar Winter? Man, that was freakin’ fun!”\nIt doesn’t matter what style of music or what particular artist you like personally – there’s a very good chance Vail Johnson will tell you a story about touring with them, or play something you’ve heard by them in his show. And odds are you’ll say, “Oh, yeah! I know that one! He played bass on that?”\nAuthor\nSusannah Wells\nDate\nJanuary 30, 2025\nA LITTLE BIT COUNTRY, A LITTLE BIT ROCK N ROLL\nJanuary 15 - 18, 2025\nShows at 7:30pm\nChristine Mild returns with a new knockout \u0003show featuring the women who sing Country AND Rock n Roll.\nStarring:\nChristine Mild\nJim Rice, Musical Director & Piano\nGary Rivenson, Bass Guitar\nGary McDonald, Drums\nMatt Backer, Guitar\nVOCALIST CHRISTINE MILD RETURNS TO THE RED BARN WITH A STELLAR NEW SHOW\nVocalist Christine Mild, who has wowed Red Barn audiences for the last several years with her “Always, Patsy Cline” and “Women of Country Music” shows, will be returning to the Barn January 15-18 with her brand new show, “A Little Bit Country, A Little Bit Rock ‘n’ Roll.” All show times are 7:30 pm.\nWhile Mild’s heart has always rested in country music, she says she always tries to bring “a little something new” to each of her stops in Key West, and this year will be no different.\n“I’ll never stray too far from country music, of course,” Mild said, “but with this new show, we’re going to be expanding the boundaries a little bit, which has been happening in the music business over the last couple of years, with Dolly Parton releasing a rock album, and Beyonce and Lady Gaga releasing country albums. The lines are getting blurred and an awful lot of good music is coming out.”\nMild said she’ll still be featuring country touchstones, focusing on female artists like Faith Hill, Carrie Underwood, Jody Messina, and Shania Twain, but “we’ll be adding in friends like Bonnie Raitt, Linda Ronstadt, Patty Smith, and even some Heart. It’s all great music.”\nAnd as usual, Mild will have a kickin’ band with her, featuring her regular sidemen – Jim Rice on keyboards, Gary Rivenson on bass, and Gary McDonald on drums. But she’s expanding the group for this show with some top-level name players. She’s bringing in British guitarist Matt Backer, who’s played with a number of top recording artists. And one of her best friends, Chicago vocalist Erin Parker, will be on stage to add the extra dimension of another female voice for harmonies. The sound will be bigger and richer, more a concert event than a small group.\n“I always want to bring Key West something new, and this is going to be an awesome show, given all the new pieces in the band and the music that we’ll be doing. You’re going to know a lot of this music, but we’ll surprise you with a few new things I know you’re going to like.”\nTickets are available now for the best seats at keystix.com or redbarntheatre.com. For more information, visit the website or call 305-296-9911. Remember that all shows at the Red Barn now have a curtain time of 7:30 pm. Sponsored in part by William L. and Pattye Monroe III, and the Monroe Country Tourist Development Council.\nAuthor\nSusannah Wells\nDate\nJanuary 29, 2025\nTHE FOREIGNER\nDecember 18, 2024 - January 11, 2025\nWritten By: Larry Shue\nShows at 7:30pm\nThe scene is a fishing lodge in rural Georgia often visited by “Froggy” LeSueur, a British demolition expert who occasionally runs training sessions at a nearby army base. This time “Froggy” has brought along a friend, a pathologically shy young man named Charlie who is overcome with fear at the thought of making conversation with strangers. So “Froggy,” before departing, tells all assembled that Charlie is from an exotic foreign country and speaks no English. Once alone the fun really begins, as Charlie overhears more than he should—the evil plans of a sinister, two-faced minister and his redneck associate; the fact that the minister’s pretty fiancée is pregnant; and many other damaging revelations made with the thought that Charlie doesn’t understand a word being said. That he does fuels the nonstop hilarity of the play and sets up the wildly funny climax in which things go uproariously awry for the “bad guys,” and the “good guys” emerge triumphant.\nWinner of the Outer Critics Circle Award for Outstanding Off-Broadway Play.\nCast\n: David Black, Annie Miners, Cassidy Timms, Brian Robinson, Thomas Masat, Chase Naylor, and Iain Wilcox\nDirector\n: Joe Kinosian, the lauded Chicago Theatre director\nRED BARN LANDMARK 45TH SEASON OPENS WITH THE HILARIOUS “THE FOREIGNER”\nKey West’s venerable Red Barn Theatre opens its 45th season literally with a bang and a houseful of laughs when it presents a new production of Larry Shue’s hilarious, award-winning “The Foreigner”, opening Wednesday, December 18th  and running through January 11 next year. All shows will be at the theater’s new curtain time of 7:30 pm.\nThe season also marks a milestone for the Red Barn’s Mimi and Gary McDonald and Joy Hawkins, who have guided the small but well-respected playhouse for all of its nearly half a century, an accomplishment rarely achieved in today’s theatrical landscape. Notables who have worked with them at the Barn through the years include Tennessee Williams, Shel Silverstein, Tony Roberts, Paul Cotton, Terri White, and a dozen other names that have made their larger marks in the entertainment industry.\n“We’re really excited about this upcoming forty-fifth season,” said Joy Hawkins, the Barn’s artistic director. “It’s an eclectic and surprising season -- funny and deep and particularly right for these times. “\n“The Foreigner”, winner of two Obie Awards and the Outer Critics Circle Award, uses the clever conceit of the audience knowing more than the characters on stage to create its fun, while also weaving in rich elements of suspense and a little mystery as the story plays out.\nThe scene is a fishing lodge in rural Georgia often visited by “Froggy” LeSueur, a British demolition expert who occasionally runs training sessions at a nearby army base. This time Froggy has brought along a friend, a pathologically shy man named Charlie who is overcome with fear at the thought of making conversation with strangers. So before departing, Froggy tells all assembled that Charlie is from an exotic foreign country and speaks no English. Once alone, the fun really begins, as Charlie overhears more than he should from those who feel secure he doesn’t understand a word being said. That he does fuels the nonstop hilarity of the play and sets up the wildly funny climax in which things go uproariously awry for the bad guys, and the good guys emerge triumphant.\n“The Foreigner” stars David Black, Chase Naylor, Cassidy Timms, Thomas Masat, Brian Robinson, and Iain Wilcox. It will be directed by Joe Kinosian, who Key West theater buffs will remember as the writer and star of “Murder For Two”, the outrageous and very funny two-man show that played the Red Barn in 2017. Kinosian, invited by artistic director Joy Hawkins to return and direct this opening show, is thrilled to be back in Key West.\n“It’s a hilarious and very funny play – probably one of the funniest ever written,” Kinosian said, “but it’s also one of the most moving stories I’ve seen. The audience will be surprised by how much they like the characters and are rooting for them against all odds. It’s one of a kind.”\nThe New Yorker said “The Foreigner is once comic surprise after another.” And The Village Voice said of the play, “It’s a constant invitation to laugh at the foolishness of life.”\nSubscriptions and single show tickets are now on sale for “The Foreigner” and the Red Barn’s entire season at KeysTix.com, redbarntheatre.com, or by calling the box office at 302-296-9911.\nBe aware that for this new season, the Red Barn has set curtain time at 7:30 pm for all shows\n.\nAuthor\nSusannah Wells\nDate\nAugust 5, 2024\nTHE LIFESPAN OF A FACT\nApril 9 - 27, 2024\nWritten By: Jeremy Kareken, David Murrell & Gordon Farrell\nShows: Tuesdays-Saturdays at\n7pm\nWith a deadline looming, a talented writer, a desperate magazine editor and a young aggressive fact checker go head to head in this oh-so-funny and gripping dispute over factual truth vs. the beauty of literary dishonesty.\nStarring:\nDave Bootle as John D’Agata, the writer\nRita Troxel as Emily Penrose, the magazine editor\nCody Borah as Jim Fingal, the fact checker\nRED BARN’S “LIFESPAN OF A FACT” HAS RELEVANCE FAR BEYOND A VERY FUNNY STAGE PLAY\nCast from left to right: Cody Borah, Rita Troxel, Dave Bootle\nIn a world where war, disease, famine, diversity, equality, AI, and God knows what else is piled on the plate in front of us, there may be one issue in that stew of concerns that trumps them all: Is any of what we’re being told in the media about\nanything\nentirely true?\nIn the final main stage production of their remarkable 44th season, the Red Barn Theatre in Key West takes this controversy head on with “Lifespan of a Fact”, an intriguing and humorous offering that has obvious relevance in this era of alternative facts. The play, written by Jeremy Kareken, David Murrell, and Gordon Farrell, runs April 9 – 27, and is adapted from a 2012 book by the real men portrayed in the play about a real incident in Nevada.\nThe play stars top local actors Dave Bootle, Cody Borah, and Rita Troxel. It’s directed by the Barn’s artistic director, Joy Hawkins. And be advised: All curtain times are 7 pm instead of the normal 8 pm.\n“It’s a very unique play,” said Hawkins. “I can’t compare it to anything else. It’s not a tie-it-up-in-a-bow kind of theater. You have to figure out for yourself what you think.”\nThe story starts off innocuously enough – Jim is a fresh-out-of-Harvard, eager beaver fact checker hired by Emily, a struggling magazine’s top editor, to fact-check an article submitted by the well-known and talented writer, John. The piece is centered around an indisputable incident: a 16-year-old boy is dead, having jumped from the observation deck of Las Vegas’ Stratosphere Hotel and Casino. Beyond that is where things get sticky.\nTurns out John has inserted unnecessary lies into his work under the guise of “artistic license” – for instance, was the casino deck actually 1100 feet high or far shorter, and did the boy’s death connect with other phenomena that day – like banned lap dances, the world’s oldest Tabasco bottle, or a tic-tac-toe-playing chicken named Ginger?\n“I’m not interested in accuracy,” says John. “I’m interested in truth.” And woe to anyone who calls his shattering essay an “article”. He is not cool with anyone tampering with his copy, insisting that 100 percent accuracy in names, dates, and specific incidents is less important than rhythm, music, and beauty in the language.\nBut Jim – out to prove himself – is not having any of it, and poor Emily is caught in the middle, concerned only with saving her magazine and knowing a sensational piece by the acclaimed John could prop up shrinking ad sales and disappearing subscriptions. What should she do?\nThe action is brisk, with plenty of sharp and funny repartee, sometimes unfolding like a taut thriller, but always coming back to the main question – do you undermine yourself by fiddling with the facts, or do you allow whatever is necessary to find the “higher truth” – the music of a boy’s tragic death?\nWho’s to say which one of them is speaking the kind of truth that really matters? You’ll have to decide for yourself.\nThe Washington Post called the play “buoyantly literate…briskly entertaining.”  Variety said “…terrifically funny dialogue…the debate at the heart of the play demands serious attention.”\nTickets for “Lifespan of a Fact” are available at redbarntheatre.com or by calling 305-296-9911. Remember that all curtain times are 7 pm.\nThe show is sponsored in part by Design Key West, Culture Builds Florida, and the Monroe County Tourist Development Council.\nAuthor\nSusannah Wells\nDate\nAugust 5, 2023\nTHE THANKSGIVING PLAY\nMarch 5 - March 30, 2024\nWritten By: Larissa FastHorse\nShows: Tuesdays-Saturdays at 8pm\nA group of terminally \"woke\" teaching artists scramble to create a pageant that somehow celebrates both Turkey Day and Native American Heritage Month. A hilarious, clever and delicious roasting of good intentions and absurd assumptions.\nStarring: Elena Devers, Arthur Crocker, Jeremy Zoma, & Nina Pilar\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nReview of THE THANKSGIVING PLAY\nPlaywright Larissa Fasthorse\nFrom Left to Right: Elena Devers, Arthur Crocker, Director Mimi McDonald, Jeremy Zoma, Nina Pilar\nRED BARN’S “THE THANKSGIVING PLAY” TAKES A HILARIOUS ‘WOKE’ LOOK AT OUR ICONIC HISTORY\nWe hear a lot about “wokeness” in the heady world of national politics these days. It’s usually pretty serious stuff, with each side slamming the other for either having too much of it, or not having enough. But what happens when you bring that thorny issue down to the common earth of everyday people?\nWell, we’re about to find out in a very funny way when Key West’s Red Barn Theatre stages “The Thanksgiving Play” as the third mainstage production of their remarkable 44th season. The show opens March 5 and will run Tuesdays to Saturdays through the 30th.\nThe play was written by Larissa Fasthorse, a member of the Sicangu Lakota Nation, and the first female Native American playwright to have a show on Broadway when it premiered at the Helen Hayes Theatre in New York. It won a Drama League Award in 2023.\nIt’s a simple premise: a group of white theater nerds meet in an elementary school classroom to put together a dramatic rendition of the Thanksgiving story for their young students – the one we’ve always been told about the Pilgrims and the “Indians” and the turkey and the corn. But when the supposed Indigenous professional actress they hire turns out to be anything but, everything plunges headlong into hilarious absurdity as the hopelessly woke whites try to fashion a play that ultimately has nothing to do with the actual unsavory history of that occasion, and is completely devoid of any insight into a Native American perspective on it.\n“It’s very funny,” said director Mimi McDonald. “It brings home how we really don’t know what to do with what actual history – as opposed to the glossed-up stories – tells us really happened. The takeaway is that we’re all just trying to figure things out, and it can get really funny and absurd as we do.”\nFasthorse herself has said she hopes the audience – while entertained by the laughter – will walk away with more questions than answers. But the main point she wants to cut through the laughter is this: “Doing nothing is not adequate anymore,” she says. “Stepping away because it’s too complicated can no longer be considered a part of any kind of solution.” This sentiment is brought to side-splitting life in her show’s audacious climax, which, for the sake of not spoiling the hilarity of it, will not be revealed here.\nEntertainment Weekly said the play is “…a good dark comedy that makes you laugh, makes you think, makes you mad, makes your brain explode.” The Hollywood Reporter called it “Very, very funny…”.\nTickets are available at redbarntheatre.com or by calling 305-296-9911 and are already selling quickly. Ticketholders for the March 5 Opening Night will be invited to a catered Opening Night reception with the cast and crew.\n“The Thanksgiving Play” is sponsored in part by Key West Compass Realty – Keller Williams, Culture Builds Florida, and the Monroe County Tourist Development Council.\nAuthor\nSusannah Wells\nDate\nAugust 2, 2023\nPOTUS: Or, Behind Every Great Dumbass Are Seven Women Trying To Keep Him Alive\nJanuary 30 - February 24, 2024\nWritten By: Selina Fillinger\nShows: Tuesdays-Saturdays at 8pm\nNOTICE ABOUT POTUS: This very funny play has language that is irreverent, bawdy, racy, sexual, smutty and gleefully filthy.\nOne four-letter word is about to rock the White House into a global crisis. Seven brilliant and beleaguered women risk life and sanity to keep POTUS out of trouble in this gleefully filthy and outrageously funny farce. A recent Broadway smash hit!\nStarring:\nGeorge diBraud as Harriet, his chief of staff\nLauren Thompson as Jean, his press secretary\nJessica Miano Kruel as Stephanie, his secretary\nSusannah Wells as Dusty, his dalliance\nAnnie Miners as Bernadette, his sister\nFritzie Estimond as Chris, a journalist\nLynne Casamayor as Margaret, his wife, The First Lady\nStage Manager: Rex Pierson\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nReview of POTUS\nCast of POTUS: Fritzie Estimond, George diBraud, Annie Miners, Lynne Casamayor, Jessica Miano Kruel, Lauren Thompson, & Susannah Wells\nRED BARN’S “POTUS” IS ONE VERY FUNNY FEMALE-DRIVEN TOUR-DE-FORCE\nIt would be hard to deny that politics in this day and age has pretty much distilled itself down into a daily dose of outright farce. Just turn on any TV news channel for five minutes, and it’s obvious. Things are out of control.\nSo it makes perfect sense that Selina Fillinger, one of the brilliant writers for Apple TV’s mega-hit, “The Morning Show” – a very funny and caustic skewering of cable TV news -- would turn her eye and pen to the focus of a lot of that news: the Oval Office and the creatures that inhabit it.\nThe result is the very funny “POTUS: Or Behind Every Great Dumbass Are Seven Women Trying To Keep Him Alive,” a hilarious cross between “Saturday Night Live” and “Veep”.\nFillinger’s very funny, all female-driven play will plunge the Red Barn Theatre stage into political chaos January 30 through February 24. The show will feature a Who’s Who of Key West’s top female actors, including George DiBraud, Jessica Miano Kruel, Susannah Wells, Lauren Thompson, Annie Miners, Lynne Casamayor, and Fritzie Estimond. It will be directed by the Barn’s artistic director, Joy Hawkins.\nOne of the cleverest conceits of the play is that we never see the President. We only hear about the PR nightmare he’s managed to spin into a global crisis. And it’s up to the seven brilliant and beleaguered women he relies upon most to risk their lives, their liberty, and their sanity to keep the Commander-in-Chief out of trouble.\nThere’s the super-sophisticated First Lady; the President’s sister (newly released from prison and the White House’s unofficial drug dealer); a pushy White House correspondent pursuing an interview with FLOTUS; POTUS’s meek secretary unable to cope with any of it; an outspoken, sexually-liberated young woman from a farming community who shows up and happens to have a surprising (though predictable) connection to the President; and that’s just for starters. Add in a press secretary and a Chief of Staff, and the mix gets quite volatile.\nAll these women are strong, opinionated characters, and Fillinger has them demonstrating that women in politics can be every bit as crass, brazen, bold, and – yes – deviant as the men in the halls of power. They are competent women cleaning up after incompetent men. And the result is just flat-out hilarious, filled with witty zingers and good, off-color fun – just what you’d expect from a writer of Fillinger’s abilities.\nOne important caveat: Be aware that Fillinger is not shy about using raw, crude language in her play. It’s salty, suggestive, and may be offensive to some audience members. But if you’ve already heard it all, you should be fine.\nPOTUS was written in the aftermath of the Trump years and reflects much of the chaos of that time. It was nominated in several categories in both the Drama League Awards and the Tony Awards in 2022. The Washington Post said, “The votes have been tabulated.  POTUS…is a winner!” The NY Times called it “Gleeful…a rough and tumble feminist comedy.”\nTickets for “POTUS: Or Behind Every Great Dumbass Are Seven Women Trying To Keep Him Alive” are available at redbarntheatre.com or by calling 305-296-9911. The production is sponsored in part by Sugar Loaf Lodge, Michelle Grahl of Key West Compass Realty – Keller Williams, Culture Builds Florida, and the Monroe County Tourist Development Council.\nAuthor\nSusannah Wells\nDate\nAugust 1, 2023\nTHIS ONE'S FOR THE GIRLS: THE WOMEN OF COUNTRY MUSIC\nJanuary 17 - 20, 2024\nShows at 8pm\nChristine Mild returns with a new show featuring the best of women who sing country . . . their stories and their incredible music. She sold out her Patsy Cline show last season so don't miss this one!\nStarring:\nChristine Mild\nJim Rice, Musical Director\nwith Mike Emerson on guitar, Gary Rivenson on bass, & Gary McDonald on drums\nCOUNTRY ARTIST CHRISTINE MILD RETURNS TO THE RED BARN THEATRE\nThe extraordinary songstress Christine Mild will make her long-awaited return to the Red Barn Theatre in Key West with her brand new show, “This One’s For The Girls: Women of Country Music”. The show will run for four nights only, January 17 through 20, at the Red Barn, 319 Duval Street.\nWell-known for her wildly-popular production, “Always, Patsy Cline”, Mild will be expanding her repertoire to include the top hits of close to two dozen of country music’s most fabled female artists, running from the classics of the 50’s and 60’s through to the rock-tinged hitmakers of the modern era.\n“It really grew out of the ‘Patsy’ shows,” Mild said. “I realized that all the women singers I was listening to are kind of her legacy…she was the blueprint that laid the groundwork for them to become the marquees and bring the glamour. And there’s no denying that each of the women I’m featuring in this new show has done just that.”\nMild will be offering a swath of music from some of the most successful female country artists in history, including, among many others, The Judds, Shania Twain, Tanya Tucker, Dolly Parton, Reba McEntire, Trisha Yearwood, Tammy Wynette, Taylor Swift (yes, she was originally a country artist before crossing over), Martina McBride, Little Big Town, The High Women, Casey Musgraves, and of course, the incomparable Loretta Lynn.\n“She was an inspiration,” Mild said. “She made me think about these singers and what they went through to get where they are. When you really listen to their songs, they’re filled with what those women think is important. The messages are as profound as the music.”\nMild will be weaving many of those stories into her show, an element that will make the evening much richer. “These women have always lifted each other up, and I think this show will do the same for the audience,” Mild said. “It will be toe-tapping, heartwarming, and inspiring, with songs you’ll all know.”\nMild will have a terrific band backing her up, with musical director Jim Rice on piano, Mike Emerson on guitar, Gary Rivenson on bass, and Gary McDonald on drums. “It’s a great band,” she said. “We’re going to have a blast.”\nTickets for “This One’s For The Girls: Women of Country Music” are available at redbarntheatre.com or 305-296-9911. It is highly recommended that tickets be purchased early, as Mild’s shows always sell out. Sponsored in part by Culture Builds Florida, and the Monroe County Tourist Development Council.\nAuthor\nSusannah Wells\nDate\nJuly 28, 2023\nA TUNA CHRISTMAS\nDecember 19, 2023 - January 13, 2024\nWritten By: Jaston Williams, Joe Sears & Ed Howard\nShows: Tuesdays-Saturdays at 8pm\nIn the third-smallest town in Texas, radio station OKKK news personalities report on Yuletide activities.The hilarity never lets up in this comedic romp for all seasons featuring many colorful Tuna denizens played by two very funny actors.\nStarring: Brandon Beach & David Black\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nReview of A Tuna Christmas\nAuthor\nSusannah Wells\nDate\nJuly 28, 2023\nSHORT ATTENTION SPAN THEATRE: PARALLEL UNIVERSES\nApril 7 - 29, 2023\nCollection of Short Plays\nShows: Tuesdays-Saturdays at 8pm\nOne of our always-popular favorites, “Short Attention Span Theatre, 2023” — The funny and fast-paced evening is filled with pertinent and hilarious short plays, helmed by a group of directors guiding a big handful of favorite Key West actors. You never know what you’ll see next at SAST!\nThe Red Barn Journeys to “Parallel Universes” in Short Attention Span Theatre\nThere are those who believe our universe – the one our planet and galaxy currently exist within – is but one of many such universes, involving multiple dimensions, overlapping times, and repeating histories. While that concept may be hard to wrap your head around, the Red Barn Theatre in Key West may be able to help.\nTheir perennial favorite production, “Short Attention Span Theatre”, will return to their stage April 7 – 29, with this year’s theme being “Parallel Universes”. It’s an evening of six eclectic new one-act plays, each of which will take a skewed, often hilarious, look at the world (or universes) we live – or may live -- within.\n“They’re all comedic plays, but they’re meaty,” said Mimi McDonald, who is executive producing the show. “They’ll make you laugh, but they’ll also make you think.  They’re about things that could happen, or could be, or that make you wonder about reality. The show’s colorful, lots of cool costumes, lots of good music. It’s a great evening if you’re looking for something fun and out of the ordinary.”\nMcDonald spent a lot of time finding just the right plays for this year’s show. She researched the best new short plays that have won awards from 2021 and beyond, and took advantage of her relationship with Miami’s City Theatre, which is well-known for their short play roster. Each play McDonald chose has its own world and reality, with characters and situations that not only surprise but are highly entertaining.\n“The concept of SAST is good writers, good actors, good directors,” she said. “I wanted new things by published writers. And we found them, for sure…David Ives is always good, and Laurie Allen. It’s hard to pick favorites -- they’re all terrific.”\nOnce again the entire McDonald theatrical clan – Mimi, husband Gary, daughter Amber, and son Jack – will be behind the scenes directing the various plays and creating the clever sets. They’ll be joined by Key West photographer/playwright Mike Marrero.\n“Our kids have grown up in the theater,” McDonald said, “and it’s nice to have the youthful perspective on these particular plays. And Mike’s got a real sense of humor too. The audiences are going to be laughing a lot.”\nIt’s a rich veteran cast of solid Key West favorites they’ll be directing: Susannah Wells, Erin McKenna, Arthur Crocker, Cassidy Timms, Jeremy Zoma, and Iain Wilcox. Expect them to be pushing the envelope far into the parallel universes.\nTickets for “Short Attention Span Theatre: Parallel Universes” are available at redbarntheatre.com or by calling the Red Barn box office at 305-296-9911. Ticketholders for the Opening Night performance on April 7 will be invited to join the cast and crew for a catered Opening Night Reception in the Zabar Courtyard, catered by Michelle Chennault.\nThe show is sponsored by Restorative and Aesthetic Dentistry of the Keys, Design Group Key West, and by grants from Culture Builds Florida, and the Monroe County Tourist Development Council.\nAuthor\nSusannah Wells\nDate\nAugust 5, 2022\nTHE CODE\nMarch 7 - 25, 2023\nWritten By: Michael McKeever\nShows: Tuesdays-Saturdays at 8pm\nMichael McKeever’s new play, “The Code” will grace the Red Barn stage March 7-25, as McKeever revisits one of his favorite subjects, Hollywood. It’s 1950, and Billy Haines, Henry Wilson, Tallulah Bankhead, and a beautiful young man have gathered for cocktails, caviar, and all-out war. With great humor and stinging insight, “The Code” explores the hypocrisy of what it takes to be a man in the land of make-believe. It will feature Tom Wahl, David Black, Mary Falconer, and Carlos Ortega Amorin.\nPhoto by: Roberta DePiero\nActors: (l to r) Tom Wahl, Mary Falconer, David Black, Carlos Ortega Amorin\nRED BARN BRINGS OLD HOLLYWOOD BACK WITH MICHAEL MCKEEVER’S NEWEST, “THE CODE”\nIt’s true: the more things change, the more they stay the same. Or, since we’re in today’s Florida, it might be more relevant to say that no matter the strides we’ve made over the years, there’s always someone who sees the old ways as preferable.\nWhile playwright Michael McKeever may not have set out to write a play that resonates so vibrantly with what many in our community are struggling against today, his latest play, “The Code”, running March 7-25 at Key West’s Red Barn Theatre, does just that. Written about Hollywood in the 1950’s, it is most certainly germane to the LGBTQ issues that have arisen in today’s Southernmost State.\nThe play is set in the stylish home of Billy Haines, an actual silent film megastar who left the film business for personal reasons that become apparent as the story unfolds. Haines, now a successful interior designer, has invited a few friends for cocktails before they head out to a dinner party at famed director George Cukor’s house. Those friends include the glamorous and unfiltered film star Tallulah Bankhead; the oily and unpleasant agent, Henry Willson; and Willson’s latest find (and love interest) – aspiring young actor Chad Manford.\nAs the evening unfolds, it becomes clear that the “Code” which quickly dominates the conversation refers to the surreptitious rules that Hollywood has imposed to govern the way anyone LBGTQ has to behave in order to have a career and hope to succeed in Tinseltown. It’s a 1950’s version of “Don’t Ask, Don’t Tell” seasoned with some “never admit” and a lot of “deny who you are and live a lie or go home”. To be gay in an industry policed by the Legion of Decency, the Hayes Code, and the House Un-American Activities Committee can not only get you labeled a deviant and a subversive, but it’s without doubt a death knell for a career on the silver screen.\nMcKeever’s skill with witty, very funny banter mixes perfectly with his ability to take a look at history from a different perspective. He channels Bankhead’s famous cutting wit, and nails the blackhearted Svengali a compromised agent can be. The play elicits its full share of laugh-out-loud moments in the way it looks at Old Hollywood and it’s foibles, but in the era of Florida’s “Don’t Say Gay” and overt attempts at marginalization of the LGBTQ community, it has serious moments of resonance to modern times that cannot be missed.\nThe play stars South Florida favorite Tom Wahl as Haines, Key West favorites Mary Falconer as Bankhead and David Black as Willson, and showcases newcomer Carlos Ortega Amorin as Manford. It will be directed by Christopher Renshaw, the accomplished British director who helmed the World Premiere of the play last year. Renshaw has a Tony nomination and a couple of Drama Desk Awards for his play direction, and will be directing a new play based on the life of Louis Armstrong next year on Broadway. It’s a coup to have him directing here in Key West.\nTickets for “The Code” can be purchased at redbarntheatre.com or by calling the Red Barn box office at 305-296-9911. Ticketholders for Opening Night, March 7, are invited to remain after the show for the Opening Night party, where they can mingle with the cast and crew and enjoy a light nosh.\nThe play is sponsored in part by Royal Furniture, Design Group Key West, Culture Builds Florida, and the Monroe County Tourist Development Council.\nAuthor\nSusannah Wells\nDate\nAugust 4, 2022\nFLAMING GUNS of the PURPLE SAGE\nJanuary 31 - February 25, 2023\nWritten By: Jane Martin\nShows: Tuesdays-Saturdays at 8pm\nBe ready to take a wild and crazy ride into the classic mash-up spoof of a Western-Horror “B” movie with Jane Martin’s hilarious “Flaming Guns of the Purple Sage”. Big 8, a rodeo competitor, is facing foreclosure on the Wyoming ranch where she rehabilitates injured rodeo cowboys. The arrival of a shocking woman named Shedevil and a one-eyed Ukrainian biker named Black Dog leads to violence and horror in this satire of pulp western writers like Zane Grey. It will feature George DiBraud, Susannah Wells, Cassidy Timms Iain Wilcox, Tim Dahms, and Mathias Maloff.\nView fullsize\nView fullsize\nView fullsize\n“FLAMING GUNS OF THE PURPLE SAGE” BRINGS THE OUTRAGEOUS WILD WEST TO THE RED BARN\nImagine Hopalong Cassidy trying to date Carrie, or Miss Kitty chasing Chuckie around the corral with a meat cleaver in an Addams Family version of “Gunsmoke,” and you may get close to the outrageous fun and outright craziness awaiting you in the Red Barn’s next production.\n“Flaming Guns of the Purple Sage”, written by the always-hilarious and rapier-sharp Jane Martin (“Says She”), opens January 31 and runs Tuesdays through Saturdays through February 25. It’s a preposterous mash-up of B-movie westerns and C-movie horror flicks that will literally have you laughing until you cry, even while you’re sitting in disbelief at what you’re seeing on stage.\n“I just love its audacity,” said director Joy Hawkins. “It’s unlike anything I’ve ever directed before. It’s full of macabre people you love and hate at the same time. We can’t get through a rehearsal without laughing ‘til our sides ache.”\nWithout giving away too much (because the surprises are everything in this tale), “Flaming  Guns” tells the story of Big 8, a retired rodeo star who’s trying to keep her home from being foreclosed on. Living with her is Rob Bob, a rising young rodeo star (think more Gomer Pyle than John Wayne). Into this household comes SheDevil (her choice of name) who is pregnant by Big 8’s ne’er-do-well son, Lucifer Lee. But SheDevil is being hunted down by her very angry Ukrainian biker boyfriend, Black Dog, and when he shows up, things really begin to get interesting.\n“Be aware,” Hawkins said, “that there is, indeed, a lot of violence and blood and sex all mixed in, but it’s done in a very farcical and satirical way. Be advised -- it’s definitely for adults…I wouldn’t bring the kids. But it’s a very cleverly-written send-up of those old B-movie Westerns and horror flicks. This is all fun and laughs about how crazy – in a very funny way -- human beings can be.”\nThe play stars a terrific mix of Key West’s best comedic actors, including George DiBraud, Susannah Wells, Mathias Maloff, Tim Dahms, Cassidy Timms, Iain Wilcox, and Jack McDonald. Hawkins directs and Carmen Rodriguez will be designed the western duds.\nCurtain Up called it “a crowd-pleaser that keeps the audience howling”. The Courier-Journal calls it “hilarious and rip-snortin’”, and Concord Theatricals dubs it a “shoot ‘em up, knock ‘em up, cut ‘em up comic romp.”\nRead KONK Life Review by Emily Weekley\nRead Konk Life Review by Emily Berg\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nAuthor\nSusannah Wells\nDate\nAugust 3, 2022\nBACK IN BABY'S ARMS | CHRISTINE MILD SINGS PATSY CLINE\nJanuary 18 - 21, 2023\nThis special musical event, “Back in Baby’s Arms”, features the voice and stylings of Christine Mild, who has played Patsy Cline in the popular “Always, Patsy Cline” play dozens of times, including a sold-out run at the Red Barn in 2018. Expect to hear many of Cline’s biggest hits, with the stellar accompaniment of arranger/pianist Jim Rice and trio.\nAuthor\nSusannah Wells\nDate\nAugust 2, 2022\nDear Jack, Dear Louise\nDecember 20, 2022 - January 14, 2023\nWritten By: Ken Ludwig\nShows: Tuesdays-Saturdays at 8pm\nSparks fly and love blossoms across the darkened landscape of World War II, when Jack, a U.S. Army doctor, begins a letter correspondence with Louise, an aspiring actress living a world away from his war-torn reality. The play won the Helen Hayes and Charles MacArthur award for Best New Play of 2020. It will feature Jessica Miano Kruel and Cody Borah.\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nKEN LUDWIG’S “Dear Jack, Dear Louise” OPENS THE RED BARN’S 43RD SEASON\nIn the 21st Century’s fast-paced digital culture, the personal letter, handwritten on fine stationery from one person to another, has all but disappeared -- become a lost art few seldom indulge in anymore. Emails, texts, Tweets, Instagrams, connection apps – these are the main means of communication between people in a world increasingly dominated by the code of a metaverse we no longer actually touch.\nPerhaps this was on the mind of playwright Ken Ludwig when he sat down last year to pen his Helen Hayes Award Winning play, “Dear Jack, Dear Louise.” Because the heart of the play is about just that – personal, handwritten letters that passed between a World War II Army doctor and a Broadway starlet working at the Stage Door Canteen in New York during the war. And they’re not just any letters – these were epistles that formed the joyous, heartwarming story of Ludwig’s parents’ long-distance courtship and eventual marriage.\n“Dear Jack, Dear Louise” is set to make its South Florida debut December 20th as the opening production of the Red Barn’s 43rd Season in Key West, with a run that goes through January 14th of 2023. It will star Key West favorites Jessica Miano Kruel as Louise Rabiner, an aspiring actress and dancer in New York, and Cody Borah as Captain Jack Ludwig, a military doctor then stationed in Oregon. The Barn’s Artistic Director, Joy Hawkins, will direct.\n“It’s a good, old-fashioned story,” Hawkins said. “And I think it’s special to have such an unabashed love story in these times. It takes you back. And it’s pertinent right now as we’re dealing with war in the world. It’s sweet, it’s funny, but it’s also real – these were real people, living real lives, and we’re privileged to watch how they managed to fall in love under such circumstances.”\nLudwig and Rabiner, living on opposite sides of the country in 1942, strike up a correspondence at the urging of their parents, who were old friends. They find a rapport right away – he encouraging her with auditions, she commiserating over his hardass commanding officer. It’s not all fun and games, though, as the ugly situation in the world encroaches on their connection.\nThe show isn’t schmaltzy either, in great part due to the way it’s staged, with the two characters on stage together but separately – he in his world on one side of the stage, and she in hers on the other. The beauty of the play is in the way the characters build chemistry in front of the audience’s eyes without ever looking at one another. And they’re not reading the letters – they’re living the words we understand they wrote.\n“It’s captivating to watch,” Hawkins said. “We’re not sure they’ll ever get together, but it’s a beautiful ending. I hope the audience will feel connected to their own experiences, and maybe those of their own parents.”\nThe Washington Post said the play is “…a poignant, funny tribute to the enduring power of human connection.” The Lit Arts Maven said, “One of the finest theatre experiences I have had in 25 years of reviewing.”\n“Dear Jack, Dear Louise” runs December 20 – January 14, excepting Christmas Eve and Christmas, and New Year’s Eve and New Year’s Day. Tickets are available at redbarntheatre.com/tickets or by calling 305-296-9911, 3-5 pm weekdays.\nThe Red Barn season is sponsored in part by the Monroe County Tourist Development Council, and the State of Florida Division of Cultural Affairs.\nAuthor\nSusannah Wells\nDate\nAugust 1, 2022\nHurricane Diane\nMarch 22 - April 16, 2022\nWritten By: Madeleine George\nThe hilarious HURRICANE DIANE stars Lauren Thompson, Susannah Wells, Erin McKenna, Jessica Miano Kruel, and Caroline Taylor.\nHILARIOUS “HURRICANE DIANE” BLOWING INTO THE RED BARN THEATRE\nWhat if the Greek God Dionysus, deity of wine and ecstasy, suddenly walked into your kitchen and announced that it was time mankind shaped up and started taking care of “his” planet and that you and your girlfriends were going to be the first acolytes in his quest to bring the Earth back to its natural, unsullied state? What could go wrong, right?\nThis is the reality-bending set-up for the hilarious new play, “Hurricane Diane”, set to open at the Red Barn Theatre in Key West on March 22 for a four-week run. Written by Pulitzer Prize finalist Madeleine George, the play will feature a who’s who of Key West women, including Erin McKenna, Caroline Taylor, Susannah Wells, Jessica Miano Kruel, and Lauren Thompson. It will be directed by Red Barn artistic director, Joy Hawkins.\nGeorge launches her play right from “Lights Up”. We meet Dionysus immediately, though not as we might expect. He has morphed into a rabble-rousing lesbian gardener from Vermont named Diane, and she’s chosen four suburban New Jersey housewives – think a sophisticated, socially-conscious version of a “Real Housewives” show and you won’t be far off – to join his efforts at reclaiming the natural beauty of the planet.\nThe four women all live on a cul-de-sac in flood-prone Red Bank, New Jersey in identical cookie-cutter houses. They regularly gather over wine and coffee to gossip about anything but the latest portents for the climate. There’s control freak Carol, who just wants a well-manicured lawn; and Renee, a top editor at HGTV Magazine; and Pam, an Italian dragon in animal prints; and weepy Beth, who’s just been left by her husband.\nInto this coffee klatch comes lesbian landscape gardener Diane, livid at humanity for “despoiling the green earth that gave you life.” She has great plans – not the least of which involve indulging her Dionysian proclivities – and she’s going to begin right here, right now.\nWill Diane be able to enlist them all? Will this diverse band of suburban women be inspired by the appetites of their divine visitor to unleash their wildness to help the battered planet? Maybe. Maybe not. You’ll have to see.\nTo say the play is outrageously funny is a given. But it also carries a subtextual message that has profound relevance in this day and age. Called “incisively smart and boisterously funny” by the Boston Globe, “clever and timely” by New York Theater, and “An astonishing new play” by the NY Times, “Hurricane Diane” lives up to its fantastical premise.\nTickets are available at redbarntheatre.com or by calling 305-296-9911. The play is sponsored in part by The Dogwood Foundation, Design Group Key West, and the Monroe County Tourist Development Council.\nAuthor\nSusannah Wells\nDate\nApril 16, 2022\nQuarantine For Two\nFebruary 15 - March 12, 2022\nWritten By: Hy Conrad\nA world premiere of a wickedly funny new play by Hy Conrad. Hy, the well-known Key West resident who wrote a good many of the\nMonk\nepisodes, as well as\nWhite Collar,\nand the recent hit,\nThe Good Cop,\nhas taken the trials and tribulations of our pandemic quarantine and turned them hilariously on their heads. The play mixes comedy, intrigue, (and of course) murder, and a neck-bending twist that you won't see coming.\n“QUARANTINE FOR TWO” TO PREMIERE AT RED BARN\nGod knows there hasn’t been much to laugh about the last couple of years. Pandemics tend to lean that way.\nBut thanks to Hy Conrad – the writer/producer of the very funny “Monk” series – we’ll get a chance to shake off a little of the downside of things when his new play, “Quarantine For Two”, opens a four week run on February 15th at Key West’s Red Barn Theatre. The production marks the play’s American premiere.\n“Hy and I were chatting one day,” said artistic director Joy Hawkins, “and we thought a funny play about this might be good for people, to lighten things up a bit. And who better to do that than Hy Conrad?”\nThe play centers on a typical, middle-aged, suburban couple – played by David Black and Mimi McDonald – who have been quarantining at home for more than a year. But it hasn’t gone well. In fact, they’ve driven each other crazy, to the point that each has come to the conclusion that for their own sanity, they need to kill the other. How they go about that – with the involvement of a somewhat dim and double-dealing poolboy-turned-hitman played by Rhett Kalman – leads to a very hilarious escalation of complications.\n“I tend to write toward comedy and crime,” Conrad said. “The idea of two people in lockdown who desperately want to kill each other seemed to make comic sense, if we want to make light of our fears in the moment. Balancing the truth in the Covid situation with finding the humanity in the characters and making it funny was the challenge.”\nBut Conrad makes it work exceptionally well. In a private reading of the play last summer, it was hard for the cast and crew to get through the script without breaking into laughter.\n“The last two years have been so surreal and ludicrous and crazy,” Hawkins said. “So let’s just jump in and laugh at the predicament we’ve all been in. Because somewhere in all of this, we really do need to find a laugh.”\nAnd as she said, who better than Hy Conrad to give that to us?\nTickets for “Quarantine For Two”, the second of the Red Barn’s season of “Bright and Brilliant Comedies”, are available now at redbarntheatre.com or by calling 305-296-9911.\nThe play is sponsored in part by Jane Gardner Interiors, the Florida Department of State Division of Cultural Affairs, and the Monroe County Tourist Development Council.\nAuthor\nSusannah Wells\nDate\nMarch 14, 2022\nVail Johnson \"Bassically Incorrect\"\nMarch 6 & 7, 2022\nLimited engagement — 2 nights only!\nBASSIST FOR THE STARS: VAIL JOHNSON TELLS ALL IN RED BARN LIMITED ENGAGEMENT\nYou might not recognize him on the street nor know his name, but you’ve probably seen him onstage and you’ve most certainly have heard him…probably many times.\nVail Johnson is his name, and he’s a bassist. Not just any bassist, mind you, but THE bassist when it comes to studio work, recordings, and live performance.  He’s been doing it for over 40 years with some of the top names in music, and he’s bringing a career-ful of behind-the-scenes stories and almost every note of the great music he’s had a hand in to the Red Barn Theatre in Key West.\nHis one-man show, “Bassically Incorrect: Around the World in 40 Years” will have a limited engagement at the Barn Sunday and Monday, March 6 and 7 only. Tickets are available now at redbarntheatre.com or by calling 305-296-9911.\nWant some names he’s put the bottom under? How about Kenny G, Whitney Houston, Herbie Hancock, Stevie Nicks, Keb’ Mo’, George Benson, Michael Bolton, James Ingram, Gil Scott Heron, Paula Abdul, MC Hammer, T. Graham Brown, David Cassidy, Steve Perry, Patti Austen, Peabo Bryson, Edgar Winter, and Christopher Cross, just to name a very few.\n“It just sort of happened,” Johnson said recently. “I was playing in a lounge band back in the late 70’s, and Kenny G’s percussionist sees me, brings Kenny to the gig, and the next thing I know, I’m playing in Kenny G’s band. We go to LA, and Stevie Nicks sees me at a gig, and asks me to do her record. It just snowballed from there.”\nIt wasn’t all luck, however. Johnson was ready when the door opened. The youngest of seven brothers (one of his older siblings is Key West’s Jeff Johnson), Vail was immersed in all kinds of music through his family – classical, choral, gospel, bluegrass, Dixieland, Top 40. He absorbed it all, mixing in whatever he came across, including jazz, hip-hop, metal rock, and pure improvisation. His virtuosity, passion, and humor were his calling card, and his ability to play virtually any style extremely well sealed the deal.\nAnd all of it is on display in his one-man show – from Kenny G’s, George Benson’s, and Herbie Hancock’s jazz to Steve Perry’s and Stevie Nicks’s rock, to Peabo Bryson’s soul and Keb’Mo’s blues.\n“I tell stories about the artists I’ve played and toured with, and then play and sing along with the tracks I’ve done with them or played on tour. I do some of my own stuff too. And what I do is not just ‘play bass’…people are surprised what I can do on a bass in terms of playing music. Look…it’s a guitar. It just happens to be a bass. I can make it sound like a Spanish guitar, or bluesy finger-picking, or monster slapping.”\nAsk Johnson who was the most fun he’s had with any artist, and the answer might surprise you. “Edgar Winter,” he said. “For me to play ‘Frankenstein’ with Edgar Winter? Man, that was freakin’ fun!”\nIt doesn’t matter what style of music or what particular artist you like personally – there’s a very good chance Vail Johnson will tell you a story about touring with them, or play something you’ve heard by them in his show. And odds are you’ll say, “Oh, yeah! I know that one! He played bass on that?”\nTickets for “Bassically Incorrect” are two-tiered. For the Sunday, March 6 show, all tickets are $60. For Monday night’s show, they’re $75, but that gets you an invite to the catered after-party in the Red Barn courtyard, where you can meet and talk music with Vail Johnson and enjoy some delish foods.\nYou’ll also be able to purchase some of Vail’s own CDs both evenings, the proceeds from which will be going directly to the Florida Keys SPCA.\nThis show is sponsored in part by Design Group Key West, and the Monroe County Tourist Development Council.\nAuthor\nSusannah Wells\nDate\nMarch 7, 2022",
      "emails": [
        "redbarnboxoffice@gmail.com",
        "user@domain.com"
      ]
    },
    {
      "url": "https://www.facebook.com/RedBarnTheatre/",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    }
  ],
  "all_links": [
    "http://www.redbarntheatre.com/home",
    "http://www.redbarntheatre.com/past-productions/flaming-guns-of-the-purple-sage",
    "http://www.redbarntheatre.com/ambassadors-club",
    "http://www.redbarntheatre.com/past-productions/vail-johnson-bassically-incorrect",
    "http://www.redbarntheatre.com/past-productions/the-lifespan-of-a-fact",
    "https://redbarntheatre.com/shows/a-rock-sails-by",
    "http://www.redbarntheatre.com/tickets",
    "http://www.redbarntheatre.com/past-productions/ms-holmes-and-ms-watson-apt-2b",
    "https://redbarntheatre.com/latest-news/konk-life-theater-review-of-potus",
    "http://www.redbarntheatre.com/past-productions/back-in-babys-arms-christine-mild-sings-patsy-cline",
    "http://www.redbarntheatre.com/gallery",
    "http://www.redbarntheatre.com/past-productions/the-foreigner",
    "http://www.redbarntheatre.com/past-productions/the-code",
    "http://www.redbarntheatre.com/past-productions/dear-jack-dear-louise",
    "https://redbarntheatre.com/shows/scrooge-macbeth",
    "https://redbarntheatre.com/latest-news/konk-life-theater-review-the-thanksgiving-play",
    "https://redbarntheatre.com/latest-news/native-american-playwright-larissa-fasthorse",
    "http://www.redbarntheatre.com/past-productions?offset=1646676900773",
    "http://www.redbarntheatre.com/past-productions/a-little-bit-country-a-little-bit-rock-n-roll",
    "https://redbarntheatre.com/shows/and-the-world-goes-round",
    "http://www.redbarntheatre.com/meet-the-board",
    "http://www.redbarntheatre.com/past-productions/this-ones-for-the-girls-the-women-of-country-music",
    "http://www.redbarntheatre.com/in-the-community",
    "http://www.redbarntheatre.com/history",
    "http://www.redbarntheatre.com/support",
    "https://redbarntheatre.com/latest-news/konk-life-theater-review-tuna-christmas",
    "https://redbarntheatre.com/shows/at-the-wedding",
    "http://www.redbarntheatre.com/visit",
    "http://www.redbarntheatre.com/latest-news",
    "http://www.redbarntheatre.com/shows-events",
    "http://www.redbarntheatre.com/past-productions/potus-or-behind-every-great-dumbass-are-seven-women-trying-to-keep-him-alive",
    "http://www.redbarntheatre.com/past-productions/short-attention-span-theatre-2023",
    "http://www.redbarntheatre.com/auditions",
    "http://www.redbarntheatre.com/current-season",
    "http://www.redbarntheatre.com/past-productions/hurricane-diane",
    "http://www.redbarntheatre.com/accessibility",
    "http://www.redbarntheatre.com/past-productions/gerri-louise-standup-senior-moments-or-what-the-hell-happened",
    "http://www.redbarntheatre.com/about",
    "http://www.redbarntheatre.com/",
    "http://www.redbarntheatre.com/search",
    "https://redbarntheatre.com/shows/the-queens-of-country-patsy-dolly-loretta",
    "http://www.redbarntheatre.com/past-productions/the-thanksgiving-play",
    "http://www.redbarntheatre.com/past-productions/brooklyn-laundry",
    "http://www.redbarntheatre.com/past-productions/a-tuna-christmas",
    "http://www.redbarntheatre.com/past-productions",
    "http://www.redbarntheatre.com/latest-news/konk-life-theater-review-short-attention-span-theatre-alternative-facts",
    "http://www.redbarntheatre.com/past-productions/vail-johnson-is-bassically-incorrect-2025",
    "https://redbarntheatre.com/latest-news/konk-life-theater-review-flaming-guns-of-the-purple-sage-by-emily-berg",
    "http://www.redbarntheatre.com/past-productions/quarantine-for-two",
    "http://www.redbarntheatre.com/subscriptions",
    "http://www.redbarntheatre.com/past-productions?author=54f6746ee4b06512fa5d7f34",
    "http://www.redbarntheatre.com/past-productions/short-attention-span-theatre-2025-edition",
    "https://redbarntheatre.com/latest-news/konk-life-theater-review-flaming-guns-of-the-purple-sage",
    "http://www.redbarntheatre.com/media",
    "https://redbarntheatre.com/shows/youre-a-good-man-charlie-brown",
    "http://www.redbarntheatre.com/videos"
  ],
  "candidate_links": [
    "http://www.redbarntheatre.com/meet-the-board",
    "http://www.redbarntheatre.com/shows-events",
    "http://www.redbarntheatre.com/about",
    "https://www.facebook.com/RedBarnTheatre/"
  ],
  "visited": [
    "http://www.redbarntheatre.com/",
    "http://www.redbarntheatre.com/about",
    "http://www.redbarntheatre.com/contact",
    "http://www.redbarntheatre.com/staff",
    "http://www.redbarntheatre.com/team",
    "http://www.redbarntheatre.com/board",
    "http://www.redbarntheatre.com/directory",
    "http://www.redbarntheatre.com/events",
    "http://www.redbarntheatre.com/sitemap.xml",
    "http://www.redbarntheatre.com/council",
    "http://www.redbarntheatre.com/leadership",
    "http://www.redbarntheatre.com/management",
    "http://www.redbarntheatre.com/producers",
    "http://www.redbarntheatre.com/support",
    "http://www.redbarntheatre.com/crew",
    "http://www.redbarntheatre.com/members",
    "http://www.redbarntheatre.com/bios",
    "http://www.redbarntheatre.com/people",
    "http://www.redbarntheatre.com/artists",
    "http://www.redbarntheatre.com/musicians",
    "http://www.redbarntheatre.com/faculty",
    "http://www.redbarntheatre.com/administration",
    "http://www.redbarntheatre.com/meet-the-board",
    "http://www.redbarntheatre.com/shows-events",
    "http://www.redbarntheatre.com/about",
    "https://www.facebook.com/RedBarnTheatre/"
  ],
  "base_url": "http://www.redbarntheatre.com/"
}