{
  "pages": [
    {
      "url": "https://riseabovearts.com/about-us/",
      "is_candidate": false,
      "has_email": true,
      "text": "Jacob Ruscoe\nArtistic Director – Chairman of the Board\nJacob holds a Doctoral degree in Administration and Management and has personally helped aspiring actors attain their lifelong performance dreams. In addition to his work with Rise Above, he dedicates his time to help local elementary school students learn and experience the art of the theatre in ways that equip and prepare them for future success. Jacob brings a relentless dedication and virtuoso skill set to every production he produces.\nEmma Goldberg\nMusical Director\nEmma began performing in musical groups at a very young age as she grew up in Sarasota, FL. She went on to earn a Bachelor's in Vocal Music Education from Hope College in Holland, MI. She was the musical theatre and chorus teacher at Booker Middle School for the VPA program for 5 years and then switched to Gulf Gate Elementary School for 4 years. She recently has taken a step back from being in the classroom full time due to her four-year-old son, Mason, and two year old daughter, Julianna. She has years of experience both in a classroom setting as well as in private lessons for voice and piano.\nKrista Benson\nMusical Director\nKrista Benson began performing in musical theater at the age of ten. She performed in countless school and community theater productions growing up. Also an accomplished flutist, Krista chose to pursue a vocal degree with a musical theater emphasis in college. She graduated with a BA in music with a Vocal Option from SUNY Geneseo. She then went on to earn a Masters in Music in Musical Theater from The Boston Conservatory. During her time in Boston she had the honor of singing with The Boston Pops, The Thayer Symphony Orchestra and performing on The Spirit of Boston.\nMany of her favorite musical theater roles from that time include \"Once on this Island\" (Timoune) \"A Chorus Line\" (Sheila), \"Guys and Dolls\" (Sarah), \"The Apple Tree\" (Barbara), \"The Threepenny Opera\" (Polly), \"Oliver!\" (Nancy) and \"The Fairy Queen\" (Titania) as well as roles in \"Cabaret\", \"Sweet Charity\", \"Marat...Sade\", and \"Hair\".\nWhile attending The Boston Conservatory she met her future husband. After they were married they moved to NYC. After too many cold winters spent in Boston and NY they decided to move to southeast Florida. Krista had many opportunities as a professional performer at Stage Door Theater in Ft Lauderdale performing in such shows as \"My One and Only\", \"The Best Little Whorehouse in Texas\" (Angel) \"No Way To Treat a Lady\" (Sarah) and the original musical \"Are We there Yet?\" (Woman 1).\nAfter moving to upstate NY Krista then took some time away from the spotlight to stay home and raise their two daughters. Upon encouragement from a mentor, Krista began teaching vocal lessons in 2008. Krista's training in both classical vocal technique AND musical theater has made her a unique resource for her students.\nUnder her tutelage many of Krista’s students have gone on to BFA musical theater programs at highly esteemed universities such as Rider, Montclair, SUNY Fredonia, Ithaca College, Belmont and Coastal Carolina to name a few. Krista’s students have also performed with the Boston Pops, Mormon Tabernacle Choir and have won numerous vocal competitions.\nCurrently Krista is a faculty member teaching Vocal Technique, private vocal lessons and Musical Theater at Ovation School of Musical Theater in Bradenton, FL.\nHer passion for music, musical theater and working with her students is evident in her enthusiasm!!\nToni Dentico\nChoreographer\nToni Dentico is coming to us from Buffalo, NY, she is very excited to become a member of the Rise Above Family. Toni has been the Choreographer for the St. Joseph Collegiate Institute's Music Department for the last twelve years, while there she has choreographed twelve musicals and numerous musical numbers for their Swing Choir. As Co-Director, Toni ran the Artpark and Musicalfaire Summer Camps for the last eleven years. Prior to work at St. Joes Toni was the choreographer at the Academy of Theatre Arts in Williamsville, NY. She choreographed over twenty shows while with the Academy. Toni received her dance training at the David DeMarie Dance Studio where she was a student for many years. She performed with the Buffalo Philharmonic and at Artpark in Lewiston, NY. Toni was awarded the titles of Miss Junior Dance of WNY, Miss Dance of WNY and Miss Dance of America, she was crowned in Miami Florida!\nOlivia Huseonica\nChoreographer\nOlivia Huseonica is a passionate freelance choreographer with a unique blend of dance training and musical theater experience. Raised in Minneapolis, MN, Olivia began her dance journey at the Classical Ballet Academy of Minnesota and later became an apprentice with Ballet Minnesota, where she performed the role of Nikiya in La Bayadère Act 2.\nWhile dancing full-time after school, Olivia also attended St. Paul Conservatory for Performing Artists during the day, where she deepened her passion for musical theater and was a featured dancer in productions of Cabaret and On the Town. She then pursued a BFA in Ballet with a Minor in Nutrition from the University of Utah. Upon graduation, she received the Ballet Senior Award for Choreography, an honor bestowed on one student per year, for her exceptional artistry and creative promise.\nWhile Olivia’s career has been grounded in concert dance, her foundation in musical theater continues to shape her choreography. Her work throughout her college years and beyond reflect a commitment to both precision and emotional storytelling, with emphasis on heartfelt acting and universal themes.\nOlivia made her professional choreographic debut with Azara Ballet in 2024, where she created two original pieces on the company: Ms. Protagonistand Is This What Love Is?, both of which explored narrative-driven movement and character development. She looks forward to continuing her work with Rise Above Performing Arts Center, where she is excited to bring her skills in both dance technique and musical theater storytelling to new and exciting projects.\nMichelle Martin\nDirector\nMichelle Martin is the elementary theatre and summer camp director with a passion for storytelling that connects, challenges, and inspires. She began directing and choreographing 12 years ago. After a brief hiatus to get a “real job” her son found passion for theatre and it pulled her back into the world.\n6 years and many coffee-fueled tech weeks later, she’s still at it—wrangling actors, making bold choices, and hoping no one notices she’s been using the same clipboard since 2014.\nFavorite directing credits include SpongeBob the Musical, Secret Garden, Moana Jr, and Aladdin Jr. When not directing, she can be found driving her children to rehearsal, at a Sarasota theatre supporting other artists, making elaborate to-do lists, or pretending to “unplug” while still checking rehearsal notes.\nDanielle Calabrese\nChoreographer\nDanielle Calabrese is an educator, choreographer, and dance instructor. Danielle is entering her seventh year of teaching in Sarasota County. Danielle has choreographed many Ashton Elementary School musicals including The Little Mermaid Jr., Seussical Jr., and Shrek Jr. She has also choreographed for The Ashton Elementary School Show Choir. Danielle is the Coach of The Braden River Middle School Dance Team in Manatee County. She previously taught a variety of dance classes at Ovation School of Musical Theatre in Bradenton, FL. Danielle has cheered professionally for The Florida Tropics MASL as well as The Florida Sunsations. Throughout her life in Florida, Danielle has trained extensively in dance and also studied at The Rockettes Summer Intensive in NYC. She holds a Bachelor of Science degree in Elementary Education and a Master of Arts degree in Reading Education from The University of South Florida; Go Bulls! Danielle is excited to be a part of Matilda The Musical. She especially loves that Matilda showcases the positive impact that literacy and a caring teacher can have in a child’s life. Danielle thanks everyone at Rise Above for their hard work and dedication to the performing arts. She thanks her parents and her dog Teddy for all of their love and support always.\nKrista Baker\nDevelopment Director\nKrista is an educator who has helped direct numerous productions including Seussical Jr., Little Mermaid Jr.,   Beauty and the Beast Jr. and Aladdin Jr. Krista has always enjoyed the arts. In high school and college, she was   on Dance Teams and involved in Concert Bands.\nKrista has extensive experience in marketing and management. She has a unique talent for bringing stakeholders   together to support the work of Rise Above. Krista possess a passion to help individuals find and express their   gifts and talents.\nMelissa Rand\nMelissa Rand is so proud to be a part of Rise Above. She has watched this group from afar and is thrilled to work   more hands on and share her experiences with them! Melissa has been in Florida for 6 years and has appeared in   many productions at The Players Centre.\nHer favorite recent credits include Will Roger’s Follies (Betty Rogers), A Chorus Line (Diana Morales), Young   Frankenstein (Elizabeth Benning), and Cabaret (Kit Kat Girl).\nBrian Chinn\nBoard Member\nBrian’s love of Theatre began in High School becoming the technical director for the plays stretching the limited technology available at the time.  That love continues in bi-annual trips to Broadway to see the latest shows that are out as well as traveling locally to see shows.\nBrian has a long history of working with non-profit organizations.  He spent 10 years as IT Director for one non-profit followed by 8 years as Director of International Operations for another.  He serves on the board of directors of another non-profit working with teens.  Brian currently spends his time as Realtor in Texas.\n“It is an honor to serve Rise Above and the Rise Above Community and I hope we can continue to grow and allow students to have an amazing experience introducing them to theater and helping them find their hidden talents.  The staff of Rise Above is unmatched and I am excited to see what they do each and every time!”\nTyler Mount\nBoard Member\nDuring his tenure as a producer, Tyler Mount has been the recipient of three Tony Awards, a Grammy Award, an Olivier Award, two Outer Critics Circle Awards, two Drama League Awards, a Drama Desk Award, and a GLAAD Media Award. His years of experience span Broadway, off-Broadway, and regional theater. His Tony Award for Once on This Island (Best Revival of a Musical) made Tyler one of the youngest Tony Award-winning producers in history.  In October of 2020, Tyler received his third and fourth Tony Award nominations making him the youngest individual producer to be nominated for Best Play, Best Musical, Best Revival of a Play, and Best Revival of a Musical.\nAs an industry-leading digital strategy expert and owner of Tyler Mount Ventures, a digital agency specializing in social media strategy for the world’s most influential thought leaders and celebrities, Tyler has managed digital campaigns for Biden for America, NBC, Playbill, IBM, Hilton Hotels, Sofitel, T-Mobile, the Tony Awards, the Grammy Awards, the Olivier Awards, and countless others.\nTyler’s digital strategy expertise can be seen throughout the nearly two hundred videos he created for Playbill’s The Tyler Mount Vlog, a web series that has been seen by over 25 million viewers in 168 different countries. Guests included Lin Manuel-Miranda, Gloria Estefan, Billy Porter, Perez Hilton, Jerry Mitchell, and Ali Stroker. Tyler has been profiled in dozens of esteemed publications including The New York Times, Forbes Magazine, and Out Magazine.\nTyler’s Broadway/West End credits include: Hadestown, Frankie and Johnny in the Claire de Lune, The Inheritance, Once on This Island, On Your Feet! The Story of Emilio & Gloria Estefan, An American in Paris, ¡Viva Broadway! Hear Our Voices: Gloria Estefan LIVE!, and The Acting Company’s 2014 benefit concert of The Cradle Will Rock, starring Patti Lupone. He is currently producing the United Kingdom tour of Dream Girls, which is scheduled to make its triumphant return to Broadway in 2023.\nTyler earned a Bachelor of Arts in Theatre Performance and Arts Administration from St. Edward’s University, attended CAP21 in New York City, now the Molloy College/CAP21 Theatre Arts Program, and holds a postgraduate certificate from MIT in Digital Marketing and Social Media Analytics\nGregg Barker\nBusiness Adivsor – Board Member\nGregg Barker is an entrepreneur who has been an executive and founder in two successfully startup businesses,   one as CIO the other as Co-founder and CTO both of which are still operating on their own today.  After selling the company in 2016 Gregg joined Microsoft.  Gregg’s current role as a Principle Solution Architect requires him to manage relationships and negotiate at the C level with fortune 500 customers around the globe.\nDonnie Hebert\nBoard Member\nAs a business owner of a product that embraces creativity and artistry Donnie is always able to bring an interesting perspective to the table. In his first career he worked in the country of Niger on the edge of the Sahara desert with nomadic herders   helping bring education to traditionally isolated communities. He worked to make it possible that these children could access education and have options that previously were not available to them. In an environment that came with many life challenges Donnie helped them overcome challenges by teaching them to think creatively and dare to dream in a land where dreams rarely exist.\nCurrently Donnie owns a Lego business and is inspiring both children and adults all over the world by using the medium of a building brick. He teaches individuals how to use a simple platform to bring their circle of influence into the world they build and take them on an unforgettable journey by showcasing their talent and hard work.\n12/08/2025\n04/09/2025\nBlog\nSomething Rotten Cast Announcement\nRise Above is thrilled to announce the cast, crew and creative team for “Something Rotten!” We are so excited for...\n09/08/2025\n09/08/2025\nBlog\nSomething Rotten Callbacks\nSomething Rotten Callbacks A huge congratulations to those selected for a callback for Something Rotten. If your name is listed...\n01/08/2021\n02/08/2021\nBlog\nSeason 6 Lineup\nSeason 6 is jam-packed with shows you will not want to miss.\n01/08/2021\n01/08/2021\nBlog\nGodspell Cast Announcement\nThe Godspell cast and crew is announced.\n“A theatre, a literature, an artistic expression that does not speak for its own time has no relevance.”\nSimon R. Green\nTheater Сritic\n“Actors are able to play any character precisely because they themselves are completely deprived of it.”\nDenis Diderot\nReviewer\n“The audience goes to the theater to see the good performance of good plays, and not the play itself: you can read the play.”\nAlexander Ostrovsky\nPlaywright",
      "emails": [
        "info@riseabovearts.com"
      ]
    },
    {
      "url": "https://riseabovearts.com/contacts/",
      "is_candidate": false,
      "has_email": true,
      "text": "Start Page\nStart Main\nStart Header\nStart Navigation\nHome\nAbout\nAbout Rise Above\nCorporate Sponsorship\nAnnouncements\nOur Actors\nHotel Partners\nRestaurant Partners\nShows\nAuditions\nCircle Membership\nRentals\nContact Us\nBuy Tickets\nFinish Navigation\nFinish Header\nStart Middle\nContact Us\nHome\n»\nContact Us\nStart Content\nThank you so much for your interest in Rise Above Performing Arts.\nWe look forward to hearing from you and providing you with theatrical experiences you will never forget. Most information can be found on our website, but we always want to provide a personal touch to your experience so please feel free to call us or send us an email.\nIf you are interested in one of our actors for your upcoming project/production please be sure to indicate the specific qualities and skill set(s) you seek. Rise Above only recommends talent we have personally directed or trained.\nWe will respond to all inquiries in 24-48 hours.\nYour name\nYour email\nSubject\nYour message (optional).\nSubscribe me to your newsletter\nChimpmatic extension by Renzo Johnson\nContact Us\n3501 S. Tamiami Trail, Suite 1105 Sarasota, FL 34239 Right next to Cinebistro\ninfo@riseabovearts.com\n941-702-4747\nSubscribe to our newsletter to stay informed\nFinish Content\nFinish Middle\nStart Bottom\nInfo\n3501 S. Tamiami Trail Suite 1105 Sarasota, FL 34239 Right next to Cinebistro\ninfo@riseabovearts.com\nCall Us:  941-702-4747\nShows\nMusical\n16\nTuck Everlasting\nRUNS: May 7-9 & 14-17, 2026\nLearn More...\nMusical\n14\nHadestown:  Teen Edition\nRUNS: April 9-12 & 16-19, 2026\nLearn More...\nMusical\n13\nAlice By Heart\nRUNS: February 26-March 1  & March 5-8, 2026\nLearn More...\nMusical\n13\nFootloose\nRUNS: January 15-18  & 29-Feb 1, 2026\nLearn More...\nFunding for this program provided in part by the Community Foundation of Sarasota County.\nFinish Bottom\nFinish Main\nStart Footer\n© 2021 Rise Above Performing Arts\nFinish Footer\nFinish Page\ngoogleoff: all\nWe use cookies on our website to give you the most relevant experience by remembering your preferences and repeat visits. By clicking “ACCEPT ALL”, you consent to the use of ALL the cookies. However, you may visit \"Cookie Settings\" to provide a controlled consent.\nCookie Settings\nREJECT ALL\nACCEPT ALL\nManage consent\nClose\nPrivacy Overview\nThis website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience.\nNecessary\nNecessary\nAlways Enabled\nNecessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information.\nNon-necessary\nNon-necessary\nAny cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website.\nSAVE & ACCEPT\ngoogleon: all\nInstagram Feed JS",
      "emails": [
        "info@riseabovearts.com"
      ]
    },
    {
      "url": "https://riseabovearts.com/circle-membership/",
      "is_candidate": false,
      "has_email": true,
      "text": "Becoming a member of the Circle at Rise Above shows your commitment to the arts and to helping students continue to experience them FREE of charge.  We cannot do what we do without our Circle Members.  Rise Above Performing Arts is a Non-Profit and donations are Tax Deductible.  Choose your level below\nBecoming a member of the Circle at Rise Above shows your commitment to the arts and to helping students continue to experience them FREE of charge.  We cannot do what we do without our Circle Members.  Rise Above Performing Arts is a Non-Profit and donations are Tax Deductible.  Choose your level below\nBRONZE\n$100-$249\nExclusive pre-sale access for the best seats for shows before the general public.\nTax Deductible gift\nSILVER $250-$499    ($21-$41 Monthly)\nBusiness card ad in one playbill during the season.\nAll the benefits listed above.\nGOLD $500-$999    ($42-$83 Monthly)\nReceive complimentary beverage vouchers with your membership packet redeemable at Centre bars for house wine, beer, softs drinks, water or snacks.\nAll the benefits listed above.\nPLATINUM $1000-$1999     ($84-$166 Monthly)\nRecognition in all playbills.\nHalf-page ad in one playbill during the season\n10% discount on single ticket purchases\nMember discounts at concession stand\nAll the benefits listed above.\nEMERALD $2000-$3499     ($167-$291 Monthly)\nFull page ad in one playbill during the season. (instead of 1/2 page)\n2 premium tickets to the performance of your choice for each production\nAll the benefits listed above.\nRUBY $3500-$4999     ($292-$416 Monthly)\nFull page ad in every playbill during the season\nAll the benefits listed above.\nDIAMOND $5000+     ($417+ Monthly)\nInvitation for two (2) to the President’s Dinner.\n20% discount on single ticket purchases\nRecognition on website\n4 premium or premium bar tickets to the performance of your choice for each production\nAll the benefits listed above.",
      "emails": [
        "info@riseabovearts.com"
      ]
    },
    {
      "url": "https://www.facebook.com/RiseAboveArts",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    }
  ],
  "all_links": [
    "https://riseabovearts.com/pj-categs/musical/",
    "https://riseabovearts.com/?cmsmasters-6tyk37qxg7-page=2",
    "https://riseabovearts.com/profile/krista-baker/",
    "https://riseabovearts.com/profile/michelle-martin/",
    "https://riseabovearts.com/?cmsmasters-6tyk37qxg7-page=12",
    "https://riseabovearts.com/project/hadestown-teen-edition/",
    "https://riseabovearts.com/about-us/",
    "https://riseabovearts.com/restaurant-partners/",
    "https://riseabovearts.com/hotel-partners/",
    "https://riseabovearts.com/profile/melissa-rand/",
    "https://riseabovearts.com/profile/brian-chinn/",
    "https://riseabovearts.com/",
    "https://riseabovearts.com/profile/olivia-huseonica/",
    "https://riseabovearts.com/blog/",
    "https://riseabovearts.com/rentals/",
    "https://riseabovearts.com/contacts/",
    "https://riseabovearts.com/profile/danielle-calabrese/",
    "https://riseabovearts.com/2021/08/season-6-lineup/",
    "https://riseabovearts.com/project/be-more-chill/",
    "https://riseabovearts.com/profile/jacob-ruscoe/",
    "https://riseabovearts.com/project/alice-by-heart/",
    "https://riseabovearts.com//about-us/",
    "https://riseabovearts.com/musicals/",
    "https://riseabovearts.com/profile/tyler-mount/",
    "https://riseabovearts.com/our-actors/",
    "https://riseabovearts.com/project/footloose/",
    "https://riseabovearts.com/corporate-sponsorship/",
    "https://riseabovearts.com/profile/krista-benson/",
    "https://riseabovearts.com/profile/donnie-hebert/",
    "https://riseabovearts.com/2021/08/godspell-cast-announcement/",
    "https://riseabovearts.com/2025/08/something-rotten-callbacks/",
    "https://riseabovearts.com/circle-membership/",
    "https://riseabovearts.com/profile/gregg-barker/",
    "https://riseabovearts.com/auditions/",
    "https://riseabovearts.com/show-choir/",
    "https://riseabovearts.com/2025/08/something-rotten-cast-announcement/",
    "https://riseabovearts.com/profile/emma-goldberg/",
    "https://riseabovearts.com/2nd-annual-gala/",
    "https://riseabovearts.com/upcoming-shows/",
    "https://riseabovearts.com/project/tuck-everlasting/",
    "https://riseabovearts.com/2025/05/matilda-cast-announcement/",
    "https://riseabovearts.com/wp-content/uploads/2022/09/Rise-Above-Jacob-Videos.mp4",
    "https://riseabovearts.com/project/something-rotten/",
    "https://riseabovearts.com/category/blog/",
    "https://riseabovearts.com/profile/toni-dentico/",
    "https://riseabovearts.com/2025/05/matilda-callbacks/"
  ],
  "candidate_links": [
    "https://riseabovearts.com/about-us/",
    "https://riseabovearts.com/contacts/",
    "https://riseabovearts.com/circle-membership/",
    "https://www.facebook.com/RiseAboveArts"
  ],
  "visited": [
    "https://riseabovearts.com/",
    "https://riseabovearts.com/about",
    "https://riseabovearts.com/contact",
    "https://riseabovearts.com/staff",
    "https://riseabovearts.com/team",
    "https://riseabovearts.com/board",
    "https://riseabovearts.com/directory",
    "https://riseabovearts.com/events",
    "https://riseabovearts.com/sitemap.xml",
    "https://riseabovearts.com/council",
    "https://riseabovearts.com/leadership",
    "https://riseabovearts.com/management",
    "https://riseabovearts.com/producers",
    "https://riseabovearts.com/support",
    "https://riseabovearts.com/crew",
    "https://riseabovearts.com/members",
    "https://riseabovearts.com/bios",
    "https://riseabovearts.com/people",
    "https://riseabovearts.com/artists",
    "https://riseabovearts.com/musicians",
    "https://riseabovearts.com/faculty",
    "https://riseabovearts.com/administration",
    "https://riseabovearts.com/about-us/",
    "https://riseabovearts.com/contacts/",
    "https://riseabovearts.com/circle-membership/",
    "https://www.facebook.com/RiseAboveArts"
  ],
  "base_url": "https://riseabovearts.com/"
}