{
  "pages": [
    {
      "url": "https://riverlanes.com/group-events/",
      "is_candidate": false,
      "has_email": true,
      "text": "START Group Events REVOLUTION SLIDER 6.7.35\nEND REVOLUTION SLIDER\nGroup Events\nRiver Lanes Family Entertainment Center prides itself on planning many different types of events throughout the year with an unparalleled level of service. Our Events Coordinator works specifically with you to manage and execute on every detail. The Family Entertainment Center boasts 32 lanes, arcade and redemption center, billiards, private banquet room, full-service food and beverage menu and a professional staff ready to make your event a memorable one. We can handle groups from 10 to 200 – please click on the various event tabs above and know that we’re your premier destination for family entertainment, food and fun!\nIf you know what you want to book right now, call us at\n321-267-7118\n#2 or click on the EVENT REQUEST below and we will get back to you ASAP.  Please note that if you are within 48 hours of your event date, please call the bowling center directly.\nCorporate Events\nFundraisers\nHoliday Parties\nBirthday Parties\nGroup Functions\nThere are many reasons WHY River Lanes Family Entertainment Center – but if you are trying to convince your CFO…\nIt’s affordable – we have lots of party packages at reasonable rates\nIt’s a great social activity – meaning everyone can participate and you don’t have to be good to have fun!\nBowling is family friendly so it gives you the option to open up the invite to kids and spouses\nFor folks that do not want to bowl, we have other activities for them to enjoy (arcade games, billiards, sports bar and more)\nWe make planning easy – there are lots of options and we can also create a custom event\nEvent times are available day or night, rain or shine (bowling is a great back-up plan when weather does not cooperate)\nWe provide all the necessary equipment – all you have to do is show up!\nGreat opportunity to give back to the people that are committed to your organization\nIt’s amazing how a small thank-you to your employees, such as offering an interactive bowling party can improve morale, productivity and loyalty. River Lanes has a lot of experience hosting and facilitating company parties throughout the year.\nRiver Lanes can help with planning, cadence of activity, food options and desired result of the party. You have the option to rent the entire center or just what you need based on the size and desire of function. Call us now at\n321-267-7118\n#2 to book your corporate event or click on the EVENT REQUEST link below to request online and we will get back to you ASAP.\nFor years, River Lanes Family Entertainment Center has provided fundraising guidance to organizations both large and small. Our professional and experienced staff will review the variety of fundraising programs we have available and help you select the one that is right for you.\nSo if you are fundraising for schools, someone in need, sports teams, churches, charities, etc., there are all kinds of ways to bring people together to raise money. Below is our most popular fundraising event:\nBowl-A-Thon: this event is very straight forward and probably the most convenient option when it comes to raising money. Participants are charged a flat fee (determined by you and River Lanes) to attend your fundraising party and a percentage of each fee collected is donated to the fundraiser. This method is ideal for raising small amounts of money in a short period of time. In addition, the bowlers participating or the group executing the fundraiser solicit local businesses in an effort to sell advertisement banners. River Lanes determines the cost of the advertisement and receives a nominal fee for the creation and delivery of these banners which hang in the center for 30 days.\nBecause of our vast experience with Fundraisers, we encourage you to reach out to us while planning your event so we can assist you with any questions you may have and to provide you with a sample packet that will aid you in the creation of your event. In terms of maximum capacity, our Family Entertainment Center can accommodate up to 200 people – and with 32 bowling lanes, an expansive arcade, billiards, redemption center, private banquet room and the River City Bar and Grill, we are well positioned to make your fundraiser a complete success!\nCall us now at\n321-267-7118\n#2 to book your fundraiser or click on the EVENT REQUEST link below to request online and and we will get back to you ASAP.\nRiver Lanes Family Entertainment Center is in demand during the Holidays. Whether your organization is large or small, River Lanes Family Entertainment Center has the spacious venue to host a variety of Holiday parties. Because we have so many requests around the Holidays, we ask that you book as early as you can – as dates fill up quick.\nOptions to consider:\nRent the entire center (includes use of bowling, arcade games, billiards, unlimited soda, coffee and tea for the duration of the event, open bar option, etc.)\nRent a portion of the center\nValue packages that can include or break out private banquet room, bowling, arcade/redemption, billiards as well as food and drink combinations\nCall us now at\n321-267-7118\n#2 to book your fundraiser or click on the EVENT REQUEST link below to request online and we will get back to you ASAP.\nThe below Birthday Party packages are for Kids only. At River Lanes Family Entertainment Center, we understand that birthday parties are a lot of work; picking a birthday location, theme, sending out party invitations, decorations, food prep, entertainment for the party and finally the aftermath! Here’s an idea…let River Lanes Family Entertainment Center EXECUTE on all that work – you sit back and relax!\nVisit our Birthday Parties Tab for more info.\nRiver Lanes Family Entertainment Center prides itself on planning many different types of events throughout the year with an unparalleled level of service. Our Events Coordinator works specifically with you to manage and execute on every detail. The Family Entertainment Center boasts 32 lanes, arcade and redemption center, billiards, private banquet room, full-service food and beverage menu and a professional staff ready to make your event a memorable one.\nThere are many reasons WHY River Lanes Family Entertainment Center is the right venue for your next group function…\nIt’s affordable – we have lots of group packages at reasonable rates\nIt’s a great social activity and you don’t have to be good to have fun!\nOur Bowling Center is family friendly – so safe for the little ones if you need to bring them\nFor folks that do not want to bowl, we have other activities for them to enjoy (arcade games, billiards, sports bar and more)\nWe can handle groups from 10 to 200 – call us now at\n321-267-7118\n#2 to book your group function or click on the EVENT REQUEST link below and we will get back to you ASAP.\nEvent Request\nEarwax buildup can lead to discomfort, hearing loss, and even infections. While there are many over-the-counter solutions available, some prefer to seek out more natural methods. Delving into the Best Natural Remedies for Earwax Removal offers a range of gentle yet effective ways to address this common concern without resorting to harsh chemicals or invasive procedures.\nhttps://bluegrassentclinic.com/best-natural-remedies-for-earwax-removal/\nMen around the world who face the challenges of erectile dysfunction are now seeking comprehensive and effective Erectile Dysfunction Treatments, leading to a significant increase in the availability and diversity of options designed to improve sexual health and restore confidence.\nhttps://monumentmedicalclinic.com/\nThe realm of erectile dysfunction treatments offers a multitude of choices, but for those prioritizing rapid action combined with enduring efficacy, Cialis Super Active often emerges as the top recommendation. Its advanced composition ensures an optimal balance between immediate impact and sustained relief.\nend article section\nSTART Group Events REVOLUTION SLIDER 6.7.35\nEND REVOLUTION SLIDER\nGroup Events\nRiver Lanes Family Entertainment Center prides itself on planning many different types of events throughout the year with an unparalleled level of service. Our Events Coordinator works specifically with you to manage and execute on every detail. The Family Entertainment Center boasts 32 lanes, arcade and redemption center, billiards, private banquet room, full-service food and beverage menu and a professional staff ready to make your event a memorable one. We can handle groups from 10 to 200 – please click on the various event tabs above and know that we’re your premier destination for family entertainment, food and fun!\nIf you know what you want to book right now, call us at\n321-267-7118\n#2 or click on the EVENT REQUEST below and we will get back to you ASAP.  Please note that if you are within 48 hours of your event date, please call the bowling center directly.\nCorporate Events\nFundraisers\nHoliday Parties\nBirthday Parties\nGroup Functions\nThere are many reasons WHY River Lanes Family Entertainment Center – but if you are trying to convince your CFO…\nIt’s affordable – we have lots of party packages at reasonable rates\nIt’s a great social activity – meaning everyone can participate and you don’t have to be good to have fun!\nBowling is family friendly so it gives you the option to open up the invite to kids and spouses\nFor folks that do not want to bowl, we have other activities for them to enjoy (arcade games, billiards, sports bar and more)\nWe make planning easy – there are lots of options and we can also create a custom event\nEvent times are available day or night, rain or shine (bowling is a great back-up plan when weather does not cooperate)\nWe provide all the necessary equipment – all you have to do is show up!\nGreat opportunity to give back to the people that are committed to your organization\nIt’s amazing how a small thank-you to your employees, such as offering an interactive bowling party can improve morale, productivity and loyalty. River Lanes has a lot of experience hosting and facilitating company parties throughout the year.\nRiver Lanes can help with planning, cadence of activity, food options and desired result of the party. You have the option to rent the entire center or just what you need based on the size and desire of function. Call us now at\n321-267-7118\n#2 to book your corporate event or click on the EVENT REQUEST link below to request online and we will get back to you ASAP.\nFor years, River Lanes Family Entertainment Center has provided fundraising guidance to organizations both large and small. Our professional and experienced staff will review the variety of fundraising programs we have available and help you select the one that is right for you.\nSo if you are fundraising for schools, someone in need, sports teams, churches, charities, etc., there are all kinds of ways to bring people together to raise money. Below is our most popular fundraising event:\nBowl-A-Thon: this event is very straight forward and probably the most convenient option when it comes to raising money. Participants are charged a flat fee (determined by you and River Lanes) to attend your fundraising party and a percentage of each fee collected is donated to the fundraiser. This method is ideal for raising small amounts of money in a short period of time. In addition, the bowlers participating or the group executing the fundraiser solicit local businesses in an effort to sell advertisement banners. River Lanes determines the cost of the advertisement and receives a nominal fee for the creation and delivery of these banners which hang in the center for 30 days.\nBecause of our vast experience with Fundraisers, we encourage you to reach out to us while planning your event so we can assist you with any questions you may have and to provide you with a sample packet that will aid you in the creation of your event. In terms of maximum capacity, our Family Entertainment Center can accommodate up to 200 people – and with 32 bowling lanes, an expansive arcade, billiards, redemption center, private banquet room and the River City Bar and Grill, we are well positioned to make your fundraiser a complete success!\nCall us now at\n321-267-7118\n#2 to book your fundraiser or click on the EVENT REQUEST link below to request online and and we will get back to you ASAP.\nRiver Lanes Family Entertainment Center is in demand during the Holidays. Whether your organization is large or small, River Lanes Family Entertainment Center has the spacious venue to host a variety of Holiday parties. Because we have so many requests around the Holidays, we ask that you book as early as you can – as dates fill up quick.\nOptions to consider:\nRent the entire center (includes use of bowling, arcade games, billiards, unlimited soda, coffee and tea for the duration of the event, open bar option, etc.)\nRent a portion of the center\nValue packages that can include or break out private banquet room, bowling, arcade/redemption, billiards as well as food and drink combinations\nCall us now at\n321-267-7118\n#2 to book your fundraiser or click on the EVENT REQUEST link below to request online and we will get back to you ASAP.\nThe below Birthday Party packages are for Kids only. At River Lanes Family Entertainment Center, we understand that birthday parties are a lot of work; picking a birthday location, theme, sending out party invitations, decorations, food prep, entertainment for the party and finally the aftermath! Here’s an idea…let River Lanes Family Entertainment Center EXECUTE on all that work – you sit back and relax!\nVisit our Birthday Parties Tab for more info.\nRiver Lanes Family Entertainment Center prides itself on planning many different types of events throughout the year with an unparalleled level of service. Our Events Coordinator works specifically with you to manage and execute on every detail. The Family Entertainment Center boasts 32 lanes, arcade and redemption center, billiards, private banquet room, full-service food and beverage menu and a professional staff ready to make your event a memorable one.\nThere are many reasons WHY River Lanes Family Entertainment Center is the right venue for your next group function…\nIt’s affordable – we have lots of group packages at reasonable rates\nIt’s a great social activity and you don’t have to be good to have fun!\nOur Bowling Center is family friendly – so safe for the little ones if you need to bring them\nFor folks that do not want to bowl, we have other activities for them to enjoy (arcade games, billiards, sports bar and more)\nWe can handle groups from 10 to 200 – call us now at\n321-267-7118\n#2 to book your group function or click on the EVENT REQUEST link below and we will get back to you ASAP.\nEvent Request\nEarwax buildup can lead to discomfort, hearing loss, and even infections. While there are many over-the-counter solutions available, some prefer to seek out more natural methods. Delving into the Best Natural Remedies for Earwax Removal offers a range of gentle yet effective ways to address this common concern without resorting to harsh chemicals or invasive procedures.\nhttps://bluegrassentclinic.com/best-natural-remedies-for-earwax-removal/\nMen around the world who face the challenges of erectile dysfunction are now seeking comprehensive and effective Erectile Dysfunction Treatments, leading to a significant increase in the availability and diversity of options designed to improve sexual health and restore confidence.\nhttps://monumentmedicalclinic.com/\nThe realm of erectile dysfunction treatments offers a multitude of choices, but for those prioritizing rapid action combined with enduring efficacy, Cialis Super Active often emerges as the top recommendation. Its advanced composition ensures an optimal balance between immediate impact and sustained relief.",
      "emails": [
        "info@riverlanes.com"
      ]
    },
    {
      "url": "https://riverlanes.com/food-spirits/#tab-1428965768068-2",
      "is_candidate": false,
      "has_email": true,
      "text": "START Food &amp; Spirits REVOLUTION SLIDER 6.7.35\nEND REVOLUTION SLIDER\nAbout Us\nLive Entertainment\nFood Specials\nGroup Parties\nMenu\nRiver Lanes Family Entertainment Center is one of the finest Family owned bowling centers in the country. We purchased the Center in 1986 with the vision to become the number one Family Entertainment Center (FEC) destination in Brevard County. The Center is currently managed by second and third generation family members.\nOur mission is to provide an experience that exceeds your expectations every-time you walk into the Center. The Center provides state of the art equipment, quality activities and events along with exceptional service and personal attention to our Customers. One of our core mission objectives is to not treat you like a Customer, but as if you are part of the family.\nIn 2005, we made the decision to re-invest and expand the FEC in order to better accommodate our Customers. Fast forward 18 months, River Lanes Family Entertainment Center re-launched – adding over 10,000 SQ FT, 8 boutique lanes, River City Bar and Grill (a full service 110 seat restaurant), banquet room that will accommodate 65 guests comfortably and a complete overhaul on the interior and exterior of the FEC.\nAfter launching River City Bar and Grill, we have taken great pride in developing a menu that combines traditional and American food that accommodate both Families that are coming in for just a meal, or those that want to come in to bowl and eat. Our unique list of menu items includes homemade soups, the best wings and proprietary sauces in Brevard County, traditional and gourmet pizzas, fresh salads, monthly plated specials and more.\nYour bowling scores not going as planned? Take a break and take advantage of\nHappy\nHour\n, Monday through Friday 3pm to 6pm. Enjoy one of our domestic, IPA or expanding craft beer selections while watching the game in our renovated River City Sports Bar. Featuring 10 high definition flat screens, this interactive sports bar also includes the NFL and MLB ticket games, SEC Network, Big Ten Network, live entertainment and billiards. Either way, you’ll feel much better about that bowling score!\nCome on in and enjoy the FEC – we look forward to exceeding your expectations and providing an experience that keeps you coming back!\nRiver City Sports Bar is your home for the coldest drafts, tastiest wings, traditional and gourmet pizzas, homemade soups, fresh salads, and the juiciest burgers in Titusville. Featuring 10 high definition flat screen TV’s, this interactive sports bar also includes live entertainment, billiards, and games.\nHappy Hour\nHappy Hour\nevery Tuesday through Friday 3pm to 6pm\nAt River City Bar and Grill we cherish your feedback – so for all of those who let us know what they want on the menu, we provide a “Monthly Special” that includes some of your favorite dishes! Thank you to all of our Customers for dining with us. Check out our River City Bar & Grill Facebook page for our monthly specials.\nRiver Lanes Family Entertainment Center is the perfect venue for your next team building event, holiday party, corporate event or group gathering. With 32 lanes, arcade, redemption center, billiards, a full-service restaurant and bar, private party/banquet room (seats up to 65 comfortably) and an experienced staff – we can handle groups from 15 to 200 and we’re ready to make your event a memorable one!\nFill out the Event Request Form to the right or call us now at\n321-267-7118\n#2 to book your event today – you’ll find we’re your premier destination for family entertainment, food and fun!\nAppetizers\nMozzarella Sticks\nSix cheese sticks served with marinara sauce\nRiver City Wings\nCooked until they are tender & crispy then tossed in any of our famous specialty sauces. Served with crisp celery and your choice of blue cheese or ranch\nOnion Rings\nHalf pound of battered, deep fried onion rings served with choice of sauce\nEgg Roll of the Day\nAsk about today’s option\nFried Mushrooms\nBreaded whole button mushrooms served with horsey sauce\nNacho Grande\nNacho chips piled high with chili, cheese, lettuce, black olives, salsa, jalapeno peppers and sour cream\nFried Green Beans\nBattered green beans served with Wasabi ranch\nFried Pickle Spears\nSix breaded dill pickle spears served with chipotle sauce\nRiver City Tenders\nFour (4) crispy chicken tenders served with fries or homemade chips and your choice of two sauces\nBurgers and Sandwiches\nBYO Burger\nA 7oz Angus beef burger served any way you like it\nSliders\nTwo 2oz Angus burgers topped with American cheese, lettuce and tomato or two pulled pork sliders with sweet sauce\nPatty Melt\n6oz Angus burger with grilled onions and Swiss cheese on marble rye\nThe Big Dog\nA 1/4lb all beef hotdog served with your favorite toppings\nRiver City Philly\nSliced sirloin or marinated chicken breast grilled with onions, bell peppers and mushrooms then topped with melted provolone cheese\nSandwiches\nUltimate BLT\nWhite toast stacked with bacon, lettuce, tomato and mayonnaise\nFried Pork Tenderloin\nCenter cut of pork loin, lightly seasoned and served with grilled onions and your choice of sauce\nCuban Sandwich\nSliced ham and pork with Swiss cheese\nPulled Pork Sandwich\nSlow cooked pulled pork served with sweet BBQ sauce on a toasted\nCiabatta Club\nTurkey, ham, bacon, Swiss cheese with lettuce, tomato and chipotle mayo stacked high on ciabatta bread\nChicken Sandwich\n6oz grilled or fried chicken breast whichever way you like\nEgg Salad Sandwich\nRiver City’s homemade recipe on your choice of bread\nBlackened Mahi Sandwich\nBlackened Mahi served on a Kaiser bun with lettuce, tomato and tarter\nChicken Salad Sandwich\nSlow cooked all white meat chicken in this homemade recipe\nReuben\nSliced corned beef topped with Swiss cheese, sauerkraut and Thousand Island dressing served on marble rye\nWraps and More\nChicken Wrap\nGrilled or fried chicken breast served with lettuce, tomato, onion and your choice of cheese and choice of sauce\nChicken Caesar Wrap\nAll the fixings of a chicken Caesar salad wrapped in a warm flour tortilla\nFried Chicken BLT Wrap\nFried chicken and bacon served with lettuce, tomato, onion and your choice of cheese and choice of sauce\nVegetarian Wrap\nLoaded with grilled onions, mushrooms, green peppers, fresh tomatoes and lettuce then topped with melted mozzarella cheese and chipotle sauce\nQuesadillas\nMade with salsa, tomatoes, onions, and cheese, add grilled chicken or sirloin steak\nPizzas and Salads\nRiver City Meaty Pizza\nPepperoni, sausage, ham, bacon and mozzarella cheese\nRiver City House Salad\nIceberg and romaine blend, boiled egg, cheddar jack cheese, tomato, cucumbers and red onion and served with your choice of  protein and dressing\nBuffalo Chicken Pizza\nTopped with our chicken tenders dipped in our famous buffalo sauce, bleu cheese crumbles, mozzarella cheese and drizzled with ranch dressing\nWedge Salad\nQuarter head iceberg with bleu cheese crumbles, bacon, tomato and bleu cheese dressing\nSupreme Pizza\nLoaded with onion, bell peppers, mushrooms, black olives, pepperoni and sausage\nChicken Caesar Salad\nGrilled chicken on a bed of romaine tossed with our Caesar dressing and topped with parmesan cheese and seasoned croutons\nMake It Your Own Pizza\nOur fresh pressed pizza dough any way you like it. 8in, 12in, and 16in sizes available\nGreek Salad\nA mixture of iceberg and romaine loaded with cucumbers, feta, Greek olives, red onions and tomatoes tossed in an Aegean dressing\nTomato Blossom Salad\nA blooming tomato stuffed with your choice of egg, tuna or chicken salad.\nEvent Request\n*Select Occasion\nCorporate Events\nBanquet Room\nTeam Building\nFundraisers\nHoliday Parties\nGroup Functions\nΔ\nIn our fast-paced world, stress and unhealthy lifestyles contribute to the escalating rates of high blood pressure. But by employing the Best Hypertension Management Techniques, one can significantly reduce risks and lead a healthier, more balanced life.\nhttps://bestlasikphoenix.com/the-best-hypertension-management-techniques/\nMany individuals often seek quick fixes to health issues, but when it comes to high blood pressure, understanding the Best Hypertension Management Techniques can pave the way for long-term health and wellness. It’s essential to approach the condition holistically, balancing medication with lifestyle changes.\nCheap viagra\ncheap viagra tabs\nend article section\nSTART Food &amp; Spirits REVOLUTION SLIDER 6.7.35\nEND REVOLUTION SLIDER\nAbout Us\nLive Entertainment\nFood Specials\nGroup Parties\nMenu\nRiver Lanes Family Entertainment Center is one of the finest Family owned bowling centers in the country. We purchased the Center in 1986 with the vision to become the number one Family Entertainment Center (FEC) destination in Brevard County. The Center is currently managed by second and third generation family members.\nOur mission is to provide an experience that exceeds your expectations every-time you walk into the Center. The Center provides state of the art equipment, quality activities and events along with exceptional service and personal attention to our Customers. One of our core mission objectives is to not treat you like a Customer, but as if you are part of the family.\nIn 2005, we made the decision to re-invest and expand the FEC in order to better accommodate our Customers. Fast forward 18 months, River Lanes Family Entertainment Center re-launched – adding over 10,000 SQ FT, 8 boutique lanes, River City Bar and Grill (a full service 110 seat restaurant), banquet room that will accommodate 65 guests comfortably and a complete overhaul on the interior and exterior of the FEC.\nAfter launching River City Bar and Grill, we have taken great pride in developing a menu that combines traditional and American food that accommodate both Families that are coming in for just a meal, or those that want to come in to bowl and eat. Our unique list of menu items includes homemade soups, the best wings and proprietary sauces in Brevard County, traditional and gourmet pizzas, fresh salads, monthly plated specials and more.\nYour bowling scores not going as planned? Take a break and take advantage of\nHappy\nHour\n, Monday through Friday 3pm to 6pm. Enjoy one of our domestic, IPA or expanding craft beer selections while watching the game in our renovated River City Sports Bar. Featuring 10 high definition flat screens, this interactive sports bar also includes the NFL and MLB ticket games, SEC Network, Big Ten Network, live entertainment and billiards. Either way, you’ll feel much better about that bowling score!\nCome on in and enjoy the FEC – we look forward to exceeding your expectations and providing an experience that keeps you coming back!\nRiver City Sports Bar is your home for the coldest drafts, tastiest wings, traditional and gourmet pizzas, homemade soups, fresh salads, and the juiciest burgers in Titusville. Featuring 10 high definition flat screen TV’s, this interactive sports bar also includes live entertainment, billiards, and games.\nHappy Hour\nHappy Hour\nevery Tuesday through Friday 3pm to 6pm\nAt River City Bar and Grill we cherish your feedback – so for all of those who let us know what they want on the menu, we provide a “Monthly Special” that includes some of your favorite dishes! Thank you to all of our Customers for dining with us. Check out our River City Bar & Grill Facebook page for our monthly specials.\nRiver Lanes Family Entertainment Center is the perfect venue for your next team building event, holiday party, corporate event or group gathering. With 32 lanes, arcade, redemption center, billiards, a full-service restaurant and bar, private party/banquet room (seats up to 65 comfortably) and an experienced staff – we can handle groups from 15 to 200 and we’re ready to make your event a memorable one!\nFill out the Event Request Form to the right or call us now at\n321-267-7118\n#2 to book your event today – you’ll find we’re your premier destination for family entertainment, food and fun!\nAppetizers\nMozzarella Sticks\nSix cheese sticks served with marinara sauce\nRiver City Wings\nCooked until they are tender & crispy then tossed in any of our famous specialty sauces. Served with crisp celery and your choice of blue cheese or ranch\nOnion Rings\nHalf pound of battered, deep fried onion rings served with choice of sauce\nEgg Roll of the Day\nAsk about today’s option\nFried Mushrooms\nBreaded whole button mushrooms served with horsey sauce\nNacho Grande\nNacho chips piled high with chili, cheese, lettuce, black olives, salsa, jalapeno peppers and sour cream\nFried Green Beans\nBattered green beans served with Wasabi ranch\nFried Pickle Spears\nSix breaded dill pickle spears served with chipotle sauce\nRiver City Tenders\nFour (4) crispy chicken tenders served with fries or homemade chips and your choice of two sauces\nBurgers and Sandwiches\nBYO Burger\nA 7oz Angus beef burger served any way you like it\nSliders\nTwo 2oz Angus burgers topped with American cheese, lettuce and tomato or two pulled pork sliders with sweet sauce\nPatty Melt\n6oz Angus burger with grilled onions and Swiss cheese on marble rye\nThe Big Dog\nA 1/4lb all beef hotdog served with your favorite toppings\nRiver City Philly\nSliced sirloin or marinated chicken breast grilled with onions, bell peppers and mushrooms then topped with melted provolone cheese\nSandwiches\nUltimate BLT\nWhite toast stacked with bacon, lettuce, tomato and mayonnaise\nFried Pork Tenderloin\nCenter cut of pork loin, lightly seasoned and served with grilled onions and your choice of sauce\nCuban Sandwich\nSliced ham and pork with Swiss cheese\nPulled Pork Sandwich\nSlow cooked pulled pork served with sweet BBQ sauce on a toasted\nCiabatta Club\nTurkey, ham, bacon, Swiss cheese with lettuce, tomato and chipotle mayo stacked high on ciabatta bread\nChicken Sandwich\n6oz grilled or fried chicken breast whichever way you like\nEgg Salad Sandwich\nRiver City’s homemade recipe on your choice of bread\nBlackened Mahi Sandwich\nBlackened Mahi served on a Kaiser bun with lettuce, tomato and tarter\nChicken Salad Sandwich\nSlow cooked all white meat chicken in this homemade recipe\nReuben\nSliced corned beef topped with Swiss cheese, sauerkraut and Thousand Island dressing served on marble rye\nWraps and More\nChicken Wrap\nGrilled or fried chicken breast served with lettuce, tomato, onion and your choice of cheese and choice of sauce\nChicken Caesar Wrap\nAll the fixings of a chicken Caesar salad wrapped in a warm flour tortilla\nFried Chicken BLT Wrap\nFried chicken and bacon served with lettuce, tomato, onion and your choice of cheese and choice of sauce\nVegetarian Wrap\nLoaded with grilled onions, mushrooms, green peppers, fresh tomatoes and lettuce then topped with melted mozzarella cheese and chipotle sauce\nQuesadillas\nMade with salsa, tomatoes, onions, and cheese, add grilled chicken or sirloin steak\nPizzas and Salads\nRiver City Meaty Pizza\nPepperoni, sausage, ham, bacon and mozzarella cheese\nRiver City House Salad\nIceberg and romaine blend, boiled egg, cheddar jack cheese, tomato, cucumbers and red onion and served with your choice of  protein and dressing\nBuffalo Chicken Pizza\nTopped with our chicken tenders dipped in our famous buffalo sauce, bleu cheese crumbles, mozzarella cheese and drizzled with ranch dressing\nWedge Salad\nQuarter head iceberg with bleu cheese crumbles, bacon, tomato and bleu cheese dressing\nSupreme Pizza\nLoaded with onion, bell peppers, mushrooms, black olives, pepperoni and sausage\nChicken Caesar Salad\nGrilled chicken on a bed of romaine tossed with our Caesar dressing and topped with parmesan cheese and seasoned croutons\nMake It Your Own Pizza\nOur fresh pressed pizza dough any way you like it. 8in, 12in, and 16in sizes available\nGreek Salad\nA mixture of iceberg and romaine loaded with cucumbers, feta, Greek olives, red onions and tomatoes tossed in an Aegean dressing\nTomato Blossom Salad\nA blooming tomato stuffed with your choice of egg, tuna or chicken salad.\nEvent Request\n*Select Occasion\nCorporate Events\nBanquet Room\nTeam Building\nFundraisers\nHoliday Parties\nGroup Functions\nΔ\nIn our fast-paced world, stress and unhealthy lifestyles contribute to the escalating rates of high blood pressure. But by employing the Best Hypertension Management Techniques, one can significantly reduce risks and lead a healthier, more balanced life.\nhttps://bestlasikphoenix.com/the-best-hypertension-management-techniques/\nMany individuals often seek quick fixes to health issues, but when it comes to high blood pressure, understanding the Best Hypertension Management Techniques can pave the way for long-term health and wellness. It’s essential to approach the condition holistically, balancing medication with lifestyle changes.\nCheap viagra\ncheap viagra tabs",
      "emails": [
        "info@riverlanes.com"
      ]
    }
  ],
  "all_links": [
    "https://riverlanes.com/birthday-parties/",
    "http://www.riverlanes.com/contact-us/",
    "https://riverlanes.com/food-spirits/#tab-1428965902330-2-1",
    "https://riverlanes.com/food-spirits/#tab-1428965972823-4-2",
    "https://riverlanes.com/food-spirits/#tab-1428965768139-2",
    "https://riverlanes.com/leagues1/",
    "http://www.riverlanes.com/group-events/",
    "https://riverlanes.com/group-events/",
    "https://riverlanes.com/food-spirits/",
    "https://riverlanes.com/rates-times/",
    "http://www.riverlanes.com/bowling-specials/",
    "https://riverlanes.com/youth/",
    "http://www.riverlanes.com/youth/",
    "https://riverlanes.com/tournaments/",
    "http://www.riverlanes.com/leagues1/",
    "https://riverlanes.com/",
    "https://riverlanes.com/food-spirits/#tab-1428965768068-2",
    "http://www.riverlanes.com/food-spirits/",
    "https://riverlanes.com/food-spirits/#tab-1428965942613-3-6",
    "http://www.riverlanes.com/birthday-parties/",
    "mailto:info@riverlanes.com?Subject=Info Request"
  ],
  "candidate_links": [
    "https://riverlanes.com/group-events/",
    "https://riverlanes.com/food-spirits/#tab-1428965768068-2"
  ],
  "visited": [
    "http://www.riverlanes.com/",
    "http://www.riverlanes.com/about",
    "http://www.riverlanes.com/contact",
    "http://www.riverlanes.com/staff",
    "http://www.riverlanes.com/team",
    "http://www.riverlanes.com/board",
    "http://www.riverlanes.com/directory",
    "http://www.riverlanes.com/events",
    "http://www.riverlanes.com/sitemap.xml",
    "http://www.riverlanes.com/council",
    "http://www.riverlanes.com/leadership",
    "http://www.riverlanes.com/management",
    "http://www.riverlanes.com/producers",
    "http://www.riverlanes.com/support",
    "http://www.riverlanes.com/crew",
    "http://www.riverlanes.com/members",
    "http://www.riverlanes.com/bios",
    "http://www.riverlanes.com/people",
    "http://www.riverlanes.com/artists",
    "http://www.riverlanes.com/musicians",
    "http://www.riverlanes.com/faculty",
    "http://www.riverlanes.com/administration",
    "https://riverlanes.com/group-events/",
    "https://riverlanes.com/food-spirits/#tab-1428965768068-2"
  ],
  "base_url": "http://www.riverlanes.com/"
}