{
  "pages": [
    {
      "url": "https://www.rivercitygrillpg.com/about/",
      "is_candidate": false,
      "has_email": false,
      "text": "About us\n&\nPhoto Gallery\nRiver City Grill is situated in the heart of Downtown Punta Gorda, Florida.\nOur restaurant is inspired by a desire to help invigorate the renaissance movement taking place in Punta Gorda’s charming, riverfront community.\nRiver City Grill’s laid-back, eclectic atmosphere encompasses urban elegance with a neighborhood café feel, while warm hues, soft lighting, and our friendly staff create a relaxing and enjoyable atmosphere for our patrons.\nYou can expect more than just good food at River City Grill. Service is one of our highest priorities, and saying yes to our patrons’ needs is our company motto. Wine is also an elemental part of the dining experience, and we offer a wide selection of highly-rated and reasonably-priced wines from the world’s finest vineyards.\nWe at River City Grill understand the importance of sustainable agriculture, as well as the enhanced flavors that fresh, organic vegetables add to our unique recipes. Consequently, locally owned and operated Worden Farm is our supplier of choice for organic produce. Executive chef (Steve Iadevaia) visits the farm every Wednesday, during the growing season, and collects a bundle of fresh vegetables for the week’s menu.\nFor more about Worden Farm and its owners (Chris & Eva Worden), visit\nwww.WordenFarm.com\nDOUG AMARAL\nChef + Proprieter\nHOME TOWN:Horseneck Beach, Westport, MA - Still where my heart is. Wherever I live, Westport will always be considered home.\nFIRST INSPIRATIONAL FOOD MOMENT:My Grandmother (Alice Ponte Vavo) cooking cuisine from my Portuguese heritage – malasadas (fried, sugared, dough) and caldo verde (kale soup). FIRST INSPIRATIONAL RESTAURANT MOMENT:Dining at 16 years of age at La Fouquet’s of Paris with my well- traveled friend, neighbor and gourmand, Peter MacDougal. It opened my eyes to the pure pleasure of a well-executed dinner. At that very moment, I realized if I could make other people experience this feeling. I’m all in. On to Chefdom!\nSTUDIED:Culinary Institute of America, Hyde Park, N.Y.\nWORKED:White’s on the Watuppa, Westport, MA, Le Coq au Vin, Tiverton, RI, Corinthian, Boston, MA, Maitre Jaques, Boston, MA, Bay Tower Room, Boston, MA, Executive Chef at Oceancliff Resort, Newport, RI, Chef/Owner of Mangrove Cafe/Diva martini bar, Naples, FL. Chef/Owner of River City Grill and Italia@River City, Punta Gorda, FL.\nMOST EMBARRASSING MOMENT:Dripping sauce on the pant leg of Henry Kissinger during table-side service class in the Escoffier Room at CIA. He was very polite, and I didn’t want to be a waiter anyway.\nWORST KITCHEN NIGHTMARE: Preparing a prime rib wedding dinner for 125 people, and then being informed – one hour before show time - that the count had increased to 200. I only had frozen prime rib on hand!! I can’t tell you how I pulled it off.\nCELEBRITIES COOKED FOR:Henry Kissenger, Larry Bird, Senator Fred Thompson, Anthony Quinn, Tony Curtis, John McEnroe, Jimmy Connors, Rolly Fingers, Dan Dierdof, Jerry Remy, Lorna Luft, Vicki Lawrence, Joe Torre, Lou Pinella, Joe Maddon, and Don Zimmer.\nRiver City Grill\nDIANE AMARAL\nCFO & Proprietor\nDiane was a Bank of New York Officer in Long Island, NY         for 16 years before moving to Naples in 1994.\nShe is the CFO & proprietor for River City Grill, Italia and         The Mangrove Cafe in Naples\nRiver City Grill\nSTEPHEN IADEVAIA\nCorporate Executive Chef\nGrowing up in a big Italian family, food has always played a large and important role in my life.  I have seen how food can bring people together in good times and bad. It can create bonds, tell stories, and pass on traditions. The professional kitchen has become an extension of my own kitchen, and the people whom I’ve met there are an extension of my own family.  In fact, most of my friends are cooks. Both of my sisters, both my brother in laws work in restaurants, and it is where I met my wife.\nStarting in the hospitality industry at 15 years old in 1990,\nI have been fortunate to work with and learn from many amazing people - from my early days as a waiter, to traveling the country with Tommy Bahamas’s, to my eventual landing as Head Chef of The Mangrove Café in Naples, FL.  This business can teach you something everyday, as long as you are willing to learn. All of those experiences and lessons have led me to my present position of overseeing all of our company’s kitchens, and yet I can still find ways to be inspired every day.\nMy personal style has continued to grow, now focusing on my love for local, ethnic cuisines with bold flavors governed by the Italian philosophy of using pure ingredients with simple presentations while always allowing the food to speak for itself.  Our partnership with Worden Farm (USDA Certified Organic), in Punta Gorda, has allowed me a great opportunity to put part of that food philosophy into action while being connected to the process and source of our products.\nThere are many rewarding aspects of working in the restaurant business - one of the nicest being the opportunity to really reach people.  We host many celebrations, from birthdays, anniversaries, graduations, and weddings, to the everyday celebration of life.\nBy choosing River City Grill, our guests invite us chefs to be a part of their memories.  I feel fortunate to work in a field which involves pursuing my passion, and I am very proud to have been a part of the re-birth of Downtown Punta Gorda and its dining scene. Since 2003, we have been Charlotte County’s restaurant of choice, and we hope to preserve that distinction for years to come.\nRiver City Grill\nJUSTIN JEWELL\nSous Chef\nJustin, his parents Michelle and Shawn, along with his younger brother, know the area well. He is 3rd generation born and raised in Charlotte County, Florida.\nHe attended college at UCF.\nHis hard work ethic was instilled in him by his grandfather. His love for the culinary arts came from watching his mother, grandmother and great-grandmother cook with love for their large family gatherings. He began cooking 8 years ago and is classically trained\nRiver City Grill\nLatest Post\nNew Website Launched!\nFebruary 4, 2019 - 8:00 am\nWe are pleased to have launched our new website! Please check out our updated Menu, and learn more about our business and staff!\nNavigate\nMenu\nWelcome\nAbout\nFind Us\nPrivate Dining\nFollow us on Facebook\nRestaurant Hours\nTuesday to Saturday 4:30PM to Close\nSunday/Monday: Closed\nHappy Hour 4:30pm-6pm\nContact Us\n131 W. MARION AVENUE, PUNTA GORDA, FL. 33950\n(941) 639-9080",
      "emails": []
    }
  ],
  "all_links": [
    "https://www.rivercitygrillpg.com/wp-content/uploads/2018/12/DSC_0098-1-1030x685.jpg",
    "http://www.rivercitygrillpg.com/menu",
    "https://www.rivercitygrillpg.com/wp-content/uploads/2018/12/DSC_0002-1-1030x685.jpg",
    "https://www.rivercitygrillpg.com/about/",
    "https://www.rivercitygrillpg.com/wp-content/uploads/2018/12/DSC_1117-1-1030x682.jpg",
    "https://www.rivercitygrillpg.com/",
    "https://www.rivercitygrillpg.com/menu/",
    "https://www.rivercitygrillpg.com/wp-content/uploads/2018/12/DSC_0123-1-1030x685.jpg",
    "https://www.rivercitygrillpg.com/wp-content/uploads/2018/12/DSC_0092-1030x687.jpg",
    "https://www.rivercitygrillpg.com/wp-content/uploads/2018/12/DSC_1641-1-1030x682.jpg",
    "https://www.rivercitygrillpg.com/wp-content/uploads/2018/12/DSC_0080-1-1030x687.jpg",
    "https://www.rivercitygrillpg.com/private-dining/",
    "https://www.rivercitygrillpg.com/restaurant-news/new-website/",
    "https://www.rivercitygrillpg.com/wp-content/uploads/2018/12/DSC_0114-1-1030x685.jpg",
    "https://www.rivercitygrillpg.com/wp-content/uploads/2018/12/DSC_0073-1030x687.jpg",
    "https://www.rivercitygrillpg.com/find-us/"
  ],
  "candidate_links": [
    "https://www.rivercitygrillpg.com/about/"
  ],
  "visited": [
    "http://www.rivercitygrillpg.com/",
    "http://www.rivercitygrillpg.com/about",
    "http://www.rivercitygrillpg.com/contact",
    "http://www.rivercitygrillpg.com/staff",
    "http://www.rivercitygrillpg.com/team",
    "http://www.rivercitygrillpg.com/board",
    "http://www.rivercitygrillpg.com/directory",
    "http://www.rivercitygrillpg.com/events",
    "http://www.rivercitygrillpg.com/sitemap.xml",
    "http://www.rivercitygrillpg.com/council",
    "http://www.rivercitygrillpg.com/leadership",
    "http://www.rivercitygrillpg.com/management",
    "http://www.rivercitygrillpg.com/producers",
    "http://www.rivercitygrillpg.com/support",
    "http://www.rivercitygrillpg.com/crew",
    "http://www.rivercitygrillpg.com/members",
    "http://www.rivercitygrillpg.com/bios",
    "http://www.rivercitygrillpg.com/people",
    "http://www.rivercitygrillpg.com/artists",
    "http://www.rivercitygrillpg.com/musicians",
    "http://www.rivercitygrillpg.com/faculty",
    "http://www.rivercitygrillpg.com/administration",
    "https://www.rivercitygrillpg.com/about/"
  ],
  "base_url": "http://www.rivercitygrillpg.com/"
}