{
  "pages": [
    {
      "url": "https://www.riversidelodgeresort.com/contact",
      "is_candidate": false,
      "has_email": true,
      "text": "Contact Riverside Lodge Resort\n(352) 726-2002\nBetween 12:00 Pm - 6:00 Pm\nContact\nus with any questions that you have and we will get back to you as soon as possible.\nEmergency Phone Numbers Are Displayed At The Office:\nBOOK NOW\nWhere We Are In Florida\nMeet Our Team\nGetting to Riverside Lodge Resort\nClick the button below to get directions to Riverside Lodge Resort.\nGET DIRECTIONS\nContact Us\nName:\nEmail:\nPhone:\nMessage:\nThank you for contacting us.\nWe will get back to you as soon as possible.\nOops, there was an error sending your message.\nPlease try again later.\n12561 E Gulf to Lake Hwy\nInverness, Florida 34450\n352-726-2002\ncontact_us@riversidelodgeresort.com\nContact Information\n12561 E Gulf to Lake Hwy, Inverness, FL 34450\n1-352-726 2002\ncontact_us@riversidelodgeresort.com\nSocial Media\n© 2025\nAll Rights Reserved | Riverside Lodge\nWebsite Design & Reservation Software by\nResNexus\nADA\nTerms of Use\nPrivacy Policy",
      "emails": [
        "contact_us@riversidelodgeresort.com",
        "email@email.com",
        "hardy@riversidelodgeresort.com"
      ]
    },
    {
      "url": "https://www.riversidelodgeresort.com/activities7a594487#Events",
      "is_candidate": false,
      "has_email": true,
      "text": "Amenities\nRiverside Lodge Resort offers many different activities like our clubhouse with books, games, exercise equipment, ping pong table, pool table and classic video games for our guests enjoyment. Our playground is right behind the clubhouse and the laundry room where you can relax on a swing set and watch your children having fun. The BBQ area is a favorite to gather around and party with your friend and family or meet other guests, while our secluded gazebo gives you time to relax by the cypress creek, read a book or have a glass of wine. We also offer golf cart rentals at a low rate and our canoes and kayak are free of charge when you rent one of our cabins. The fishing pier is a great place to catch a fish and enjoy Florida's natural beauty.\nThe Club House\nIs\nthe place for games, parties and pot luck dinners,\nas well as playing ping-pong, pool billiard or some classic video games, Stay fit with our exercise equipment, do your laundry and have a picnic in our BBQ area with friends or other guest with music and candle light.\nOur playground is next to the clubhouse where you can watch your children as they enjoy the slide, swing sets and the playhouse. You can also rent our Clubhouse for your own events like birthday parties, anniversaries, business meeting or anything else you plan.\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nGolf Carts & Boats\nGetting Around The Riverside Way\nOn Land and Water, we provide you with free canoes and kayaks with every Florida cabin rental. You can also rent a\nJon Boat\nwith a motor to explore the river, or a golf cart to discover the rest of the Resort. Travel between discovery island, the clubhouse and the fishing pier, airboat enthusiasts, motorcycle fans, canoe and bicycle clubs, are also welcome to our pet-friendly resort in Florida!\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nThe Withlacoochee River\nWithlacoochee\nRiver originates in the Green Swamp, east of\nPolk City\n, flowing west, then north, then northwest and finally west again before emptying into the Gulf of Mexico near Yankeetown. The river is 141 miles (227 km) long\n[1]\nand along the route is the 46-mile-long (74 km)\nWithlacoochee State Trail\n, the longest paved\nrail trail\nin Florida.\nBass Fishing\nis the great attraction of this area, some of the largest bass are waiting for you, right here at the fishing pier. Or you can use one of our boats to explore the river, and have some fun out there, while you catch some fish and have a drink. The Withlacoochee River &\nHomosassa springs\nwildlife park are a attraction all by them self, it's often visited by wildlife and manatee enthusiasts from around the nation, and the world. Explore the River by Airboat and go for a ride with Wild Bill's Airboat Tours, who takes you on a unforgettable River cruise. The Historic Town of Inverness is just ten minutes away, with fine Restaurants, and unique little shops as well as most of the major stores.\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nEvents\nBesides the obvious Holiday events like New Years Parties, Forth of July BBQ, Halloween fun, Thanksgiving and Christmas potluck dinners, we had visits from many different groups who enjoyed to spend some time at our Pet-Friendly Florida cabin Rental and RV-Resort, among them are Miss America,\nMiss Florida\nand the other contestants,\nNick Cannon\nfrom America's got talent and many more. Just take a look at some of our pictures and plan your own event. You can also bring your tents and friends and family and enjoy staying in the beautiful natural environment of discovery island campground.\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nContact Information\n12561 E Gulf to Lake Hwy, Inverness, FL 34450\n1-352-726 2002\ncontact_us@riversidelodgeresort.com\nSocial Media\n© 2025\nAll Rights Reserved | Riverside Lodge\nWebsite Design & Reservation Software by\nResNexus\nADA\nTerms of Use\nPrivacy Policy",
      "emails": [
        "contact_us@riversidelodgeresort.com"
      ]
    },
    {
      "url": "https://www.riversidelodgeresort.com/rentals#TentCamping",
      "is_candidate": false,
      "has_email": true,
      "text": "Pet Friendly Florida Cabin Rentals\n2 night minimum stay is required, and 3 nights on holidays:\nThe renter must be 25 or older and have a major credit card.\nCheck-In Time Is 3:00 PM - Check Out Time Is 11:00 AM\nRV Site & Tent Site Rentals Must Arrive before 6:00 PM\nCamping Club Discounts require a 3-night minimum stay.\nMonthly Rentals Must Be Reserved By Phone:\nClick here to see our Rates.PDF\nFlorida Cabins\nAll of our Florida Cabin Rentals are Pet friendly and have a Bathroom, a fully equipped Kitchen, all the dishes and utensils, sheets, towels, cleaning products, and paper towels.\nThey are air-conditioned, which is a real must in Florida, and you're welcome to use our Free canoes & kayaks for your fishing trip. Our cabin rentals are pet friendly and have WIFI and ROCU TV, which long-term guests can use to use their own account. The\nRiverside Lodge Resort\nis a Waterfront RV Park and campground with all the RV park games, a fishing pier, and all other camping facilities. We welcome canoe, bicycle, and motorcycle clubs; airboats can be docked in front of your cabin.\nSee Our Cabins\nSlide title\nWrite your caption here\nButton\nOur Classic Cabins on Oak Lane\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nRV Sites\nAll our Waterfront RV Park Sites in the Campground provide you with a full hook-up station, which includes 30 & 50 amp electric, water/sewer, internet access, concrete slab, and a picnic table.\nThey comfortably accommodate RV's with pullouts on both sides, up to a maximum of 38' in length, plus a towing vehicle, which can be parked at the parking area for extra cars. The River Circle Lots has a fishing pier, campfire area, and gazebo with games, like ladder ball and corn hole, for entertainment. Cypress Creek Lots are away from the action, near the pavilion, the log cabins, and the charcoal grill; you are closer to the clubhouse, the BBQ Area, and the laundry. Long-term & permanent guests are welcome, and we specially designed the beautiful secluded palm court section for you, which is also priced at a long-term rate.\nSee Our RV Sites\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nTent Camping\nAll our tent camping sites are on 16' x 16' Wooden Decks close to our large shelter with a bathroom, mini kitchen, and picnic tables.\nThey are as close to nature as it gets on Discovery Island. Set up your tent under ancient Oak and Cypress trees, surrounded by birds and squirrels. Enjoy the campfire area surrounded by benches, or rent one of our canoes or kayaks for a river exploration or fishing trip, then return to camp and relax under the stars. Discovery Island is perfect for a larger group or family who likes privacy and enjoys being alone at the campfire.\nSee Our Tent Sites\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\n20% off September Bookings\nThis special offer is valid for new bookings in September. Give us a call and mention the September special to receive 20% off your booking. This offer is not valid for Holidays or with any other specials. This offer is only good for new bookings and not existing reservations. Special applies to Cabins and RV Sites.\nFree Canoe or Kayak with any Cabin Rental\nto explore our River and enjoy Florida's beautiful nature.\nSlide title\nWrite your caption here\nButton\n3rd Night Free!  = 30% OFF!\n3rd Night FREE (April to November Only)\nPay For Only 2 Nights\nbetween\nMonday to Thursday\nand Stay your\n3rd Night FREE\nof Charge in Cabins, RV Sites.\nMake a Reservation by Phone! And a\nsk us about the 3rd Night Free to\nsave 30% off Regular Rates.\nNo Other Discounts are available with this Special Offer,  Not Valid on  Holidays and Special Events. This offer is only available for a Limited Time, so you can get to know us better and stay longer.\nFree Canoe or Kayak with any Cabin Rental\nWhen you rent one of our Rental Cabins, you can use our Canoe and Kayaks free of charge to explore our River and enjoy Florida's beautiful nature.\nSlide title\nWrite your caption here\nCall Us\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nSlide title\nWrite your caption here\nButton\nResort Guidelines\nOffice Hours: 12:00 PM - 6:00 PM\nSince we are a small family business and may be busy with maintenance work or attend to other guests!\nPLEASE LEAVE A MESSAGE 352-726-2002 and we return your call between 12:00 PM to 6:00 PM:\nPayment\nPayment or the time rented is due in advance, if rental exceeds 1 month, rent and electric are due on the first of the month, after a five day grace period, a $5.00 daily late fee applies until fully paid.\nCancellation & Refund Policies\nCancellations must be made 30 days prior to the arrival date in the off season, April - December,\nand 90 Days prior to arrival during the winter season, January - April, to receive a refund minus\na $50 cancelation fee, if the deposit was made by credit card, there is an additional 3% charge.\nCancellations after the deadline result in forfeiture of the deposit, however we will honor deposits\nfor another six month, if we are still able to rent out your reserved cabin or campsite for the time\nyou reserved it, so you can reschedule, which is something that most other businesses don't do.\nWe call this our 'Rain Check', since we don't want you to lose any deposit money you have paid.\nPlease understand that we have to turn other guests down, in order to hold your cabin or RV site\nfor you and may not be able to rent your cabin or RV site to someone else on a very short notice.\nCredit Card Hold - Cabin Rental Only\nUpon check-in your issuing bank will place a $250.00 hold on your debit or credit card for possible damages or unauthorized smoking in the cabin. This hold will be released by the bank five (5) days after it was placed.\nSpecific RV - Sites or Cabin Numbers\ncan't be guaranteed, but we will try to satisfy requests, while preference is given to long term guests, who may stay longer as they planed on a certain RV site.\nThis Property is Privately Owned\nThis property is privately owned and managed, we reserve the right to refuse service to anyone, and are not responsible for accidents, or injury to guests, loss of valuables, damage to RV's or any other personal property.\nPets\nPets  are welcome! But must be kept on the leash and cleaned up after, no cats or barking dogs!\nParental Supervision Policy\nParental Supervision Policy In order to ensure the safety and comfort of all guests, we designed the following child supervision policy, which you should be aware of before you make a reservation: No one under the age of 18 is allowed to use any facilities Including but not limited to the clubhouse, golf carts, canoes,kayaks and all public areas, without strict, continuous supervision of their parents.\nParents of unsupervised children might have to leave the Riverside Lodge Resort without a refund.\nVisitors\nVisitors of Registered Guest must register at the office before entering the resort, there is a $10.00 per person charge for day-guests!  All day guests must leave the premises at 9:00 PM or would be considered overnight guest, where the regular extra person fees apply, which are due at 9:00 PM and will be charged to the registered guests account.\nSpeed Limit\nSpeed Limit is 10 MPH throughout the park. Quiet Time: is from 10:00 PM to 7:00 AM\nThe Clubhouse\nThe Clubhouse is open from 9:00 AM to 9:00 PM to all our guests, and may be used for planed activities, please inform the management, clean up after your self and turn all lights off! When you use games, or borrow books and videos, please return them and simply put them back for others.\nWashers and Dryers\nWashers and Dryers are behind the clubhouse for your convenience please use them and don't run clothes lines, we are on a septic tank system and not allowed to do laundry on any RV sites.\nThe Picnic & BBQ\nThe Picnic & BBQ area is open to all guests, please keep it clean and leave it that way, last one leaving has to make sure the grill, lights and music are turned off, we generally close it at 11 PM.\nBoat Docks, Campfire, Games and the Fishing Pier\nBoat Docks, Campfire, Games and the Fishing Pier can be used by all guests at your own risk!\nIsland explorers are welcome, please be aware that you enter uncontrolled nature at your own risk, observe all wild life with caution, and be extra careful with any fire, and burning cigarettes!\nYour RV Site\nYour RV Site should be maintained in a way that there are no unsightly items around your RV, if repairs are needed, please do them quickly, and clean up.\nRV or Car Washing\nRV or Car Washing is only allowed to long term or weekly guests and residence, hook-up your\nRV’s sewer hose with a sewer seal, don't dump anything in the grass and please report any water leaks or other problems to the management\nGarbage Dumpsters\nGarbage Dumpsters are located at the park entrance on the right, please use them only for your household trash, and leave no garbage laying around anywhere.\nAlcohol\nAlcohol should not be consumed in public or in front of children, please use discretion, and keep your parties confined to certain areas, and times of the day!\nRenting out your RV or Mobile home\nRenting out your RV or Mobile home to others is not allowed, all RV's or Mobile Homes must\nbe occupied by the owner. Buyers have to be approved by the management first in order for the Mobile Home, or RV to remain in this park. However, we are willing to assist you in your sale.\nContact Information\n12561 E Gulf to Lake Hwy, Inverness, FL 34450\n1-352-726 2002\ncontact_us@riversidelodgeresort.com\nSocial Media\n© 2025\nAll Rights Reserved | Riverside Lodge\nWebsite Design & Reservation Software by\nResNexus\nADA\nTerms of Use\nPrivacy Policy",
      "emails": [
        "contact_us@riversidelodgeresort.com"
      ]
    }
  ],
  "all_links": [
    "https://www.riversidelodgeresort.com/activities7a594487#ClubHouse",
    "https://www.riversidelodgeresort.com/attractions#OURTOWN",
    "https://www.riversidelodgeresort.com/amenities",
    "https://www.riversidelodgeresort.com/rentals#RVSites",
    "https://www.riversidelodgeresort.com/ada",
    "https://www.riversidelodgeresort.com/activities7a594487#TheRiver",
    "https://www.riversidelodgeresort.com/videos",
    "https://www.riversidelodgeresort.com/privacy-policy",
    "https://www.riversidelodgeresort.com/rentals#SPECIALOFFERS",
    "https://www.riversidelodgeresort.com/contact",
    "https://www.riversidelodgeresort.com/terms-of-use",
    "https://www.riversidelodgeresort.com/blog",
    "https://www.riversidelodgeresort.com/",
    "https://www.riversidelodgeresort.com/resort-info",
    "mailto:hardy@riversidelodgeresort.com",
    "mailto:contact_us@riversidelodgeresort.com",
    "https://www.riversidelodgeresort.com/rentals#TENTCAMPING",
    "https://www.riversidelodgeresort.com/activities7a594487#Events",
    "https://www.riversidelodgeresort.com/activities7a594487#GolfCarts",
    "https://www.riversidelodgeresort.com/rentals#Cabins",
    "https://www.riversidelodgeresort.com/attractions#FLORIDASATTRACTIONS",
    "https://www.riversidelodgeresort.com/attractions#OURNEIGHBORS",
    "https://www.riversidelodgeresort.com/attractions",
    "https://www.riversidelodgeresort.com/rentals#GUIDELINES",
    "https://www.riversidelodgeresort.com/rentals#TentCamping",
    "https://www.riversidelodgeresort.com/rentals"
  ],
  "candidate_links": [
    "https://www.riversidelodgeresort.com/contact",
    "mailto:contact_us@riversidelodgeresort.com",
    "https://www.riversidelodgeresort.com/activities7a594487#Events",
    "https://www.riversidelodgeresort.com/rentals#TentCamping"
  ],
  "visited": [
    "https://www.riversidelodgeresort.com/",
    "https://www.riversidelodgeresort.com/about",
    "https://www.riversidelodgeresort.com/contact",
    "https://www.riversidelodgeresort.com/staff",
    "https://www.riversidelodgeresort.com/team",
    "https://www.riversidelodgeresort.com/board",
    "https://www.riversidelodgeresort.com/directory",
    "https://www.riversidelodgeresort.com/events",
    "https://www.riversidelodgeresort.com/sitemap.xml",
    "https://www.riversidelodgeresort.com/council",
    "https://www.riversidelodgeresort.com/leadership",
    "https://www.riversidelodgeresort.com/management",
    "https://www.riversidelodgeresort.com/producers",
    "https://www.riversidelodgeresort.com/support",
    "https://www.riversidelodgeresort.com/crew",
    "https://www.riversidelodgeresort.com/members",
    "https://www.riversidelodgeresort.com/bios",
    "https://www.riversidelodgeresort.com/people",
    "https://www.riversidelodgeresort.com/artists",
    "https://www.riversidelodgeresort.com/musicians",
    "https://www.riversidelodgeresort.com/faculty",
    "https://www.riversidelodgeresort.com/administration",
    "https://www.riversidelodgeresort.com/contact",
    "mailto:contact_us@riversidelodgeresort.com",
    "https://www.riversidelodgeresort.com/activities7a594487#Events",
    "https://www.riversidelodgeresort.com/rentals#TentCamping"
  ],
  "base_url": "https://www.riversidelodgeresort.com/"
}