{
  "pages": [
    {
      "url": "https://rootsmg.com/meet-the-team",
      "is_candidate": false,
      "has_email": false,
      "text": "end widget-span\nend row\nend row-wrapper\nMeet the Team\nGet to know the dedicated and dynamic individuals who make our company's success a reality.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nPresident & CEO\nTom Stapley\nTom Stapley is a leader and advocate for manufactured housing. With a career spanning over 17 years in the manufactured housing industry, Tom is committed to building welcoming, safe and well-maintained communities for individuals and families to call home. Tom is an executive founder and the President of Roots Management, which emerged from the merger of Treehouse Communities and Vineyards Communities. Today, Roots is one of the premier companies in the manufactured home industry, operating over 241 communities across 24 states. Tom co-founded Treehouse Group Companies in 2006 and he has been the driving force in helping Treehouse grow and succeed to become a top manufactured housing provider. His leadership is anchored in a commitment to building teams and empowering people. He is dedicated to cultivating opportunities for individuals, families, and entire communities and to creating safe, friendly, and opportunity-rich environments. Tom also co-founded Invitation Homes in 2012, a venture that has grown into the largest single-family rental home company in the United States. With over 80,000 homes in its portfolio, Invitation Homes has reshaped the landscape of single-family rentals. As the President of Roots Management Group, Tom continues to lead with a vision to provide quality housing opportunities for individuals and families.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nCFO\nSarah McCombs Taylor\nSarah McCombs Taylor serves as the Chief Financial Officer of Accounting at Roots Management Group.\nSarah is committed to fostering high-performing teams that deliver exceptional results while building meaningful relationships.\nSarah’s expertise lies in developing practical solutions for complex financial challenges, approaching her work with an open mindset that drives continuous improvement. Before joining Roots, she led the financial reporting department at Spirit Realty Capital, Inc. (NYSE: SRC), a publicly traded Real Estate Investment Trust, where she worked for about eight years. Prior to that, she spent more than seven years at Ernst & Young (EY), a Big 4 public accounting firm, in the Wealth and Asset Management audit practice.\nSarah earned both her Master in Professional Accounting and Bachelor of Business Administration, with a minor in History, from the University of Texas at Austin, where she was part of the prestigious Business Honors Program. She is also a licensed Certified Public Accountant (CPA) in Texas.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nCOO\nCorey D. Wikstrom\nCorey D. Wikstrom is a seasoned executive with a distinguished career in the Manufactured Housing and RV industry.\nCorey’s journey in the industry is marked by his exceptional performance in various leadership roles. As former Senior Vice President of Operations at Roots Management Group, at that time the company saw significant improvements in operational efficiency.\nBefore joining Roots Management Group, Corey was the Chief Operating Officer at Three Pillar Communities. Here he drove the company’s success and was instrumental in the organization’s remarkable growth.\nCorey's educational background in Business Administration and Marketing, combined with his extensive experience, makes him an asset to Roots Management Group. His ability to build winning teams, lead operations, and drive growth and efficiency has been consistently demonstrated throughout his career.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nMeet the Team\nGet to know the dedicated and dynamic individuals who make our company's success a reality.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nCLO\nEric Blum\nWith nearly 20 years of experience as a corporate attorney with significant experience in real estate, private equity, corporate governance, capital markets and mergers & acquisitions, Eric currently serves as our Chief Legal Officer and Secretary, leading the teams responsible for all legal matters and risk management. He previously served as COO of OZ Impact Funds (the investment arm of Vineyards Management Group) from February 2019 until the merger of OZ and Vineyards into Roots in August 2021, when Eric assumed his current role. He previously worked as an associate at Greenberg Traurig in Las Vegas, Nevada, where his principal practice areas were mergers and acquisitions, securities and corporate finance and corporate governance.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nSVP, Investments\nTim Jurczak\nTim leads the team responsible for acquisitions, dispositions, and development activities in collaboration with the company’s institutional investors. He also plays a key role in cultivating relationships with new capital partners.\nBefore joining Roots Management Group in August 2021, Tim spent over a decade at Green Courte Partners,\na real estate private equity firm based in Chicago. There, he specialized in acquiring niche real estate assets, with a strong focus on manufactured housing communities nationwide. He was also instrumental in the 2014 sale of Green Courte’s portfolio of 19,000 manufactured housing sites to Sun Communities for approximately $1.3 billion.\nTim holds a degree from the University of Wisconsin-Madison.\nOutside of work, he enjoys spending time with family in Rhode Island, reconnecting with friends in Chicago, and playing golf on new courses across the country.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nSVP, Deputy General Counsel\nMaria Kenny\nMaria oversees corporate governance, regulatory compliance, dispute resolution, and enterprise-wide risk management.\nSince joining Roots in 2022, Maria has held a series of progressively senior roles within the company’s legal department. Her previous responsibilities included overseeing insurance and risk management, entity administration and compliance, and providing transactional support.\nBefore joining Roots, Maria served as in-house counsel at Elo, a global provider of touchscreen technology solutions. Earlier in her career, she was a prosecutor with the Cook County State’s Attorney’s Office in Chicago, Illinois.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nSVP, Operations\nTierria Hilton\nAs Senior Vice President of the Central Division at Roots Management Group, Tierria Hilton brings nearly 13 years of property management experience, with a strong background in affordable housing and turning distressed properties into profitable assets. Her expertise in strategic problem-solving and operational efficiency has made her a key leader in driving success across the communities she oversees.\nTierria is deeply committed to staff development, ensuring her teams are equipped with the knowledge and skills to manage multimillion-dollar assets effectively. By fostering a culture of growth and excellence, she helps strengthen both individual performance and overall community success.\nBefore joining Roots, Tierria served as Regional Manager for the Housing Authority in South Carolina, overseeing 29 communities and implementing new operational processes that enhanced efficiency across the organization.\nTierria holds a degree in Business Administration with a concentration in accounting, giving her a strong financial foundation to navigate the complexities of property management. Her passion for enhancing the affordable housing sector continues to shape her impactful leadership.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nSVP, Operations\nTishanna Newman\nTishanna Newman is a dynamic and results-driven leader with over 20 years of experience in the manufactured housing industry. As Senior Vice President for Fund I, II, and IV at Roots Management Group, she oversees community operations, budgeting, home rehabbing, delinquency reduction, and capital improvement projects across her portfolio.\nSince joining Roots Management Group four years ago, Tishanna has made a significant impact. She initially managed 18 properties as a Regional Manager before being promoted to Senior Vice President in December 2023. Under her leadership, her team has successfully rehabbed and turned over 900 homes in a year, contributing to a monthly portfolio revenue of approximately $765,000.\nWith an extensive background in homes, building codes, remodeling, and capital improvements, Tishanna is committed to enhancing community living standards and driving operational efficiency. Her expertise and strategic vision continue to propel Roots Management Group toward growth and success.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nSVP, Data Analytics & IT\nMahesh Salem\nMahesh Salem is the Senior Vice President of Data Analytics and IT at Roots Management Group, bringing over 20 years of top-tier consulting experience in Information Management, Business Intelligence, and Analytics.\nWith a deep understanding of data-driven solutions, Mahesh has successfully led transformative initiatives across a wide range of industries, including Energy & Utilities, Consumer Packaged Goods, Technology, Telecom & Media, Civil Aviation, Chemicals, and Pharmaceuticals.\nMahesh combines technical expertise with business acumen, specializing in enterprise data strategies, predictive analytics, and AI-driven insights to enhance operational efficiency and accelerate business growth.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nVP, Capital Markets and Risk\nEmilio Allen\nEmilio Allen leads the Capital Markets and Risk Management functions at Roots. He has over twenty years of mortgage finance experience including closing over $13 billion of multifamily debt transactions. Before joining Roots, Emilio held various roles at Fannie Mae, where he grew multifamily structured transactions, managed technology initiatives for single-family trading desks, and contributed to automated underwriting efforts. He has an MBA from American University with concentrations in real estate & finance and a bachelor's of science from Marquette University in information technology.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nVP, People Operations\nFabiana Larese\nFabiana Larese is a seasoned Human Resources Executive with a strategic and goal-oriented approach to fostering exceptional workplace cultures. With a career spanning diverse industries—including construction, manufacturing, real estate, insurance, and automotive—Fabiana has a proven track record in HR consulting, organizational development, and employee and labor relations.\nAs Vice President of People Operations at Roots Management Group, Fabiana plays a key role in shaping the company’s HR strategy, ensuring alignment between workforce initiatives and business objectives. She excels in developing compensation and benefits programs, driving talent acquisition and retention strategies, and enhancing company culture to create a thriving work environment.\nPassionate about people and performance, Fabiana is dedicated to building strong, engaged teams that contribute to sustainable business growth. Her expertise in HR leadership and corporate strategy makes her an invaluable asset in cultivating a positive and productive workplace at Roots Management Group.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nVP, Portfolio & Asset Management\nMax McBride\nMax McBride leads the portfolio and asset management functions at Roots Management Group, ensuring the strategic growth and financial performance of the company’s properties. Since joining Roots in 2020, Max has played a key role in analyzing and reporting asset performance across the portfolio. His responsibilities include preparing annual property budgets, assessing financial results, delivering investor reporting, and implementing portfolio strategies to optimize asset value.\nEarly in his tenure at Roots, Max was instrumental in supporting asset dispositions. Since then, he has led or assisted in the sale or recapitalization of over 6,000 manufactured home sites. His expertise in financial analysis and strategic execution has been integral to the company’s continued success.\nMax earned a Bachelor of Science in Finance from Brigham Young University’s Marriott School of Management. Prior to joining Roots, he gained experience in hedge fund administration at Northern Trust, further strengthening his financial and investment management expertise.\nend widget-span\nend row\nend row-wrapper\nVP, Dealership & Title\nMarkita Roberson\nWith over 20 years of experience in the manufactured housing industry, Markita Roberson leads the Inventory and Licensing team at Roots with a strategic and solutions-driven mindset. She played a pivotal role in implementing efficient inventory processes that support operational scalability and compliance. Known for bringing outside-the-box thinking to complex licensing challenges, Markita and her team have been instrumental in overcoming regulatory roadblocks and streamlining title management. Over the past 2.5 years, Markita’s leadership has driven a significant increase in completed titles and licensing across the Roots portfolio, aiding Roots’ mission to provide best-in-class housing options to its customers.\nend widget-span\nend row\nend row-wrapper\nVP, Sales\nDaniel Roacho\nDaniel Roacho is a seasoned sales executive with over 15 years of experience in the Manufactured Housing industry.\nAs Vice President of Sales at Roots Management Group, Daniel leads national sales strategy and oversees a high-performing management team responsible for driving occupancy and homeownership across a diverse portfolio. He led the development and launch of the Establish Your Roots (EYR) program—an impactful initiative that helps residents transition from renting to owning, supporting long-term stability and financial empowerment.\nDaniel’s career is defined by his ability to build scalable systems, lead with purpose, and deliver results through servant leadership and continuous improvement. He is proud to work alongside a resilient, innovative team that embraces challenges, adapts quickly, and consistently finds new ways to expand access to homeownership.\nThe son of a construction worker and grandson of a migrant farm laborer, Daniel’s commitment to housing access is deeply personal. He credits his parents for instilling the values of perseverance, humility, and service—principles that continue to guide his leadership. Outside of work, Daniel is a devoted family man and community leader. He is the founder of the DJR Memorial Foundation, a nonprofit dedicated to supporting underserved populations through local resources and community-driven programs. He also founded and coached the Ruachis Baseball Club, a youth baseball program focused on mentorship, discipline, and opportunity through sport.\nDaniel holds a Bachelor's degree in Finance from Regis University.\nend widget-span\nend row\nend row-wrapper\nVP, Operations Strategy\nTyler Brady\nTyler Brady serves as the Vice President of Operations Strategy at Roots Management Group, where he leads the development and execution of operational strategies that drive efficiency and performance across the organization. His department oversees key areas such as utilities management, market rent optimization, home inventory oversight, delinquency and collections, vendor services, and ancillary revenue opportunities.\nBefore joining Roots, Tyler spent five years in investment banking at Goldman Sachs, where he gained deep expertise in financial analysis, strategic planning, and operational scalability. He holds an MBA from the University of Utah and brings a data-driven, results-oriented approach to problem-solving and organizational leadership.\nAn entrepreneur at heart, Tyler is constantly looking for ways to improve existing processes and unlock new opportunities for growth. His global perspective is shaped in part by his experience living in China with his wife, where they embraced new cultures and ideas. Outside of work, Tyler is a dedicated family man who enjoys spending time outdoors and playing sports with his wife and three children.\nend widget-span\nend row\nend row-wrapper\nVP, Homes & Capital Expenditures\nDuaine Hatch\nDuaine Hatch is a seasoned project manager and estimator with over 20 years of experience across disaster restoration, utility infrastructure, and right-of-way acquisition. He has led complex residential and commercial reconstruction efforts, coordinated large-scale utility installations, and secured easements for major transmission and water projects across the U.S.\nFor the past five years, Duaine has managed capital improvement initiatives for Roots Management Group, overseeing multi-site infrastructure upgrades within mobile home communities. His work includes planning, budgeting, and executing projects that improve community standards, ensure compliance, and boost long-term asset value.\nDuaine’s background spans roles at Liberty Restoration, Electrical Consultants Inc., and Utah Disaster Kleenup, where he developed deep expertise in project scoping, cost estimating, and stakeholder coordination. With technical training in architectural, surveying, and civil engineering, along with certifications like Certified Restorer (CR), Duaine brings a hands-on, solutions-driven approach to every project he leads.\nend widget-span\nend row\nend row-wrapper\nVP, Marketing & PR\nDarrin Caldwell\nDarrin Caldwell leads the Marketing, Public Relations, and Business Development Representative (BDR) functions at Roots Management Group. With over 15 years of marketing experience and a passion for fostering progressive change, Darrin has a track record of helping individuals and organizations develop industry-leading skills, systems, and scalable programs.\nAs VP of Marketing, Darrin oversees a scrappy, high-performing team that has been instrumental in building Roots’ cutting-edge demand generation engine and driving innovation across a broad range of marketing initiatives. He also stewards the full brand experience, ensuring it aligns with Roots’ mission, values, and growth.\nOutside of work, Darrin is a devoted husband and father of three who finds inspiration and balance in the great outdoors. Whether fly fishing a quiet stream, scaling rock walls, coaching youth soccer, or backpacking through remote wilderness, he brings the same energy and curiosity to life that he brings to work.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend widget-span\nend row\nend row-wrapper\nMeet the Team\nGet to know the dedicated and dynamic individuals who make our company's success a reality.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nPresident & CEO\nTom Stapley\nTom Stapley is a leader and advocate for manufactured housing. With a career spanning over 17 years in the manufactured housing industry, Tom is committed to building welcoming, safe and well-maintained communities for individuals and families to call home. Tom is an executive founder and the President of Roots Management, which emerged from the merger of Treehouse Communities and Vineyards Communities. Today, Roots is one of the premier companies in the manufactured home industry, operating over 241 communities across 24 states. Tom co-founded Treehouse Group Companies in 2006 and he has been the driving force in helping Treehouse grow and succeed to become a top manufactured housing provider. His leadership is anchored in a commitment to building teams and empowering people. He is dedicated to cultivating opportunities for individuals, families, and entire communities and to creating safe, friendly, and opportunity-rich environments. Tom also co-founded Invitation Homes in 2012, a venture that has grown into the largest single-family rental home company in the United States. With over 80,000 homes in its portfolio, Invitation Homes has reshaped the landscape of single-family rentals. As the President of Roots Management Group, Tom continues to lead with a vision to provide quality housing opportunities for individuals and families.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nCFO\nSarah McCombs Taylor\nSarah McCombs Taylor serves as the Chief Financial Officer of Accounting at Roots Management Group.\nSarah is committed to fostering high-performing teams that deliver exceptional results while building meaningful relationships.\nSarah’s expertise lies in developing practical solutions for complex financial challenges, approaching her work with an open mindset that drives continuous improvement. Before joining Roots, she led the financial reporting department at Spirit Realty Capital, Inc. (NYSE: SRC), a publicly traded Real Estate Investment Trust, where she worked for about eight years. Prior to that, she spent more than seven years at Ernst & Young (EY), a Big 4 public accounting firm, in the Wealth and Asset Management audit practice.\nSarah earned both her Master in Professional Accounting and Bachelor of Business Administration, with a minor in History, from the University of Texas at Austin, where she was part of the prestigious Business Honors Program. She is also a licensed Certified Public Accountant (CPA) in Texas.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nCOO\nCorey D. Wikstrom\nCorey D. Wikstrom is a seasoned executive with a distinguished career in the Manufactured Housing and RV industry.\nCorey’s journey in the industry is marked by his exceptional performance in various leadership roles. As former Senior Vice President of Operations at Roots Management Group, at that time the company saw significant improvements in operational efficiency.\nBefore joining Roots Management Group, Corey was the Chief Operating Officer at Three Pillar Communities. Here he drove the company’s success and was instrumental in the organization’s remarkable growth.\nCorey's educational background in Business Administration and Marketing, combined with his extensive experience, makes him an asset to Roots Management Group. His ability to build winning teams, lead operations, and drive growth and efficiency has been consistently demonstrated throughout his career.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nMeet the Team\nGet to know the dedicated and dynamic individuals who make our company's success a reality.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nCLO\nEric Blum\nWith nearly 20 years of experience as a corporate attorney with significant experience in real estate, private equity, corporate governance, capital markets and mergers & acquisitions, Eric currently serves as our Chief Legal Officer and Secretary, leading the teams responsible for all legal matters and risk management. He previously served as COO of OZ Impact Funds (the investment arm of Vineyards Management Group) from February 2019 until the merger of OZ and Vineyards into Roots in August 2021, when Eric assumed his current role. He previously worked as an associate at Greenberg Traurig in Las Vegas, Nevada, where his principal practice areas were mergers and acquisitions, securities and corporate finance and corporate governance.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nSVP, Investments\nTim Jurczak\nTim leads the team responsible for acquisitions, dispositions, and development activities in collaboration with the company’s institutional investors. He also plays a key role in cultivating relationships with new capital partners.\nBefore joining Roots Management Group in August 2021, Tim spent over a decade at Green Courte Partners,\na real estate private equity firm based in Chicago. There, he specialized in acquiring niche real estate assets, with a strong focus on manufactured housing communities nationwide. He was also instrumental in the 2014 sale of Green Courte’s portfolio of 19,000 manufactured housing sites to Sun Communities for approximately $1.3 billion.\nTim holds a degree from the University of Wisconsin-Madison.\nOutside of work, he enjoys spending time with family in Rhode Island, reconnecting with friends in Chicago, and playing golf on new courses across the country.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nSVP, Deputy General Counsel\nMaria Kenny\nMaria oversees corporate governance, regulatory compliance, dispute resolution, and enterprise-wide risk management.\nSince joining Roots in 2022, Maria has held a series of progressively senior roles within the company’s legal department. Her previous responsibilities included overseeing insurance and risk management, entity administration and compliance, and providing transactional support.\nBefore joining Roots, Maria served as in-house counsel at Elo, a global provider of touchscreen technology solutions. Earlier in her career, she was a prosecutor with the Cook County State’s Attorney’s Office in Chicago, Illinois.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nSVP, Operations\nTierria Hilton\nAs Senior Vice President of the Central Division at Roots Management Group, Tierria Hilton brings nearly 13 years of property management experience, with a strong background in affordable housing and turning distressed properties into profitable assets. Her expertise in strategic problem-solving and operational efficiency has made her a key leader in driving success across the communities she oversees.\nTierria is deeply committed to staff development, ensuring her teams are equipped with the knowledge and skills to manage multimillion-dollar assets effectively. By fostering a culture of growth and excellence, she helps strengthen both individual performance and overall community success.\nBefore joining Roots, Tierria served as Regional Manager for the Housing Authority in South Carolina, overseeing 29 communities and implementing new operational processes that enhanced efficiency across the organization.\nTierria holds a degree in Business Administration with a concentration in accounting, giving her a strong financial foundation to navigate the complexities of property management. Her passion for enhancing the affordable housing sector continues to shape her impactful leadership.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nSVP, Operations\nTishanna Newman\nTishanna Newman is a dynamic and results-driven leader with over 20 years of experience in the manufactured housing industry. As Senior Vice President for Fund I, II, and IV at Roots Management Group, she oversees community operations, budgeting, home rehabbing, delinquency reduction, and capital improvement projects across her portfolio.\nSince joining Roots Management Group four years ago, Tishanna has made a significant impact. She initially managed 18 properties as a Regional Manager before being promoted to Senior Vice President in December 2023. Under her leadership, her team has successfully rehabbed and turned over 900 homes in a year, contributing to a monthly portfolio revenue of approximately $765,000.\nWith an extensive background in homes, building codes, remodeling, and capital improvements, Tishanna is committed to enhancing community living standards and driving operational efficiency. Her expertise and strategic vision continue to propel Roots Management Group toward growth and success.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nSVP, Data Analytics & IT\nMahesh Salem\nMahesh Salem is the Senior Vice President of Data Analytics and IT at Roots Management Group, bringing over 20 years of top-tier consulting experience in Information Management, Business Intelligence, and Analytics.\nWith a deep understanding of data-driven solutions, Mahesh has successfully led transformative initiatives across a wide range of industries, including Energy & Utilities, Consumer Packaged Goods, Technology, Telecom & Media, Civil Aviation, Chemicals, and Pharmaceuticals.\nMahesh combines technical expertise with business acumen, specializing in enterprise data strategies, predictive analytics, and AI-driven insights to enhance operational efficiency and accelerate business growth.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nVP, Capital Markets and Risk\nEmilio Allen\nEmilio Allen leads the Capital Markets and Risk Management functions at Roots. He has over twenty years of mortgage finance experience including closing over $13 billion of multifamily debt transactions. Before joining Roots, Emilio held various roles at Fannie Mae, where he grew multifamily structured transactions, managed technology initiatives for single-family trading desks, and contributed to automated underwriting efforts. He has an MBA from American University with concentrations in real estate & finance and a bachelor's of science from Marquette University in information technology.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nVP, People Operations\nFabiana Larese\nFabiana Larese is a seasoned Human Resources Executive with a strategic and goal-oriented approach to fostering exceptional workplace cultures. With a career spanning diverse industries—including construction, manufacturing, real estate, insurance, and automotive—Fabiana has a proven track record in HR consulting, organizational development, and employee and labor relations.\nAs Vice President of People Operations at Roots Management Group, Fabiana plays a key role in shaping the company’s HR strategy, ensuring alignment between workforce initiatives and business objectives. She excels in developing compensation and benefits programs, driving talent acquisition and retention strategies, and enhancing company culture to create a thriving work environment.\nPassionate about people and performance, Fabiana is dedicated to building strong, engaged teams that contribute to sustainable business growth. Her expertise in HR leadership and corporate strategy makes her an invaluable asset in cultivating a positive and productive workplace at Roots Management Group.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nVP, Portfolio & Asset Management\nMax McBride\nMax McBride leads the portfolio and asset management functions at Roots Management Group, ensuring the strategic growth and financial performance of the company’s properties. Since joining Roots in 2020, Max has played a key role in analyzing and reporting asset performance across the portfolio. His responsibilities include preparing annual property budgets, assessing financial results, delivering investor reporting, and implementing portfolio strategies to optimize asset value.\nEarly in his tenure at Roots, Max was instrumental in supporting asset dispositions. Since then, he has led or assisted in the sale or recapitalization of over 6,000 manufactured home sites. His expertise in financial analysis and strategic execution has been integral to the company’s continued success.\nMax earned a Bachelor of Science in Finance from Brigham Young University’s Marriott School of Management. Prior to joining Roots, he gained experience in hedge fund administration at Northern Trust, further strengthening his financial and investment management expertise.\nend widget-span\nend row\nend row-wrapper\nVP, Dealership & Title\nMarkita Roberson\nWith over 20 years of experience in the manufactured housing industry, Markita Roberson leads the Inventory and Licensing team at Roots with a strategic and solutions-driven mindset. She played a pivotal role in implementing efficient inventory processes that support operational scalability and compliance. Known for bringing outside-the-box thinking to complex licensing challenges, Markita and her team have been instrumental in overcoming regulatory roadblocks and streamlining title management. Over the past 2.5 years, Markita’s leadership has driven a significant increase in completed titles and licensing across the Roots portfolio, aiding Roots’ mission to provide best-in-class housing options to its customers.\nend widget-span\nend row\nend row-wrapper\nVP, Sales\nDaniel Roacho\nDaniel Roacho is a seasoned sales executive with over 15 years of experience in the Manufactured Housing industry.\nAs Vice President of Sales at Roots Management Group, Daniel leads national sales strategy and oversees a high-performing management team responsible for driving occupancy and homeownership across a diverse portfolio. He led the development and launch of the Establish Your Roots (EYR) program—an impactful initiative that helps residents transition from renting to owning, supporting long-term stability and financial empowerment.\nDaniel’s career is defined by his ability to build scalable systems, lead with purpose, and deliver results through servant leadership and continuous improvement. He is proud to work alongside a resilient, innovative team that embraces challenges, adapts quickly, and consistently finds new ways to expand access to homeownership.\nThe son of a construction worker and grandson of a migrant farm laborer, Daniel’s commitment to housing access is deeply personal. He credits his parents for instilling the values of perseverance, humility, and service—principles that continue to guide his leadership. Outside of work, Daniel is a devoted family man and community leader. He is the founder of the DJR Memorial Foundation, a nonprofit dedicated to supporting underserved populations through local resources and community-driven programs. He also founded and coached the Ruachis Baseball Club, a youth baseball program focused on mentorship, discipline, and opportunity through sport.\nDaniel holds a Bachelor's degree in Finance from Regis University.\nend widget-span\nend row\nend row-wrapper\nVP, Operations Strategy\nTyler Brady\nTyler Brady serves as the Vice President of Operations Strategy at Roots Management Group, where he leads the development and execution of operational strategies that drive efficiency and performance across the organization. His department oversees key areas such as utilities management, market rent optimization, home inventory oversight, delinquency and collections, vendor services, and ancillary revenue opportunities.\nBefore joining Roots, Tyler spent five years in investment banking at Goldman Sachs, where he gained deep expertise in financial analysis, strategic planning, and operational scalability. He holds an MBA from the University of Utah and brings a data-driven, results-oriented approach to problem-solving and organizational leadership.\nAn entrepreneur at heart, Tyler is constantly looking for ways to improve existing processes and unlock new opportunities for growth. His global perspective is shaped in part by his experience living in China with his wife, where they embraced new cultures and ideas. Outside of work, Tyler is a dedicated family man who enjoys spending time outdoors and playing sports with his wife and three children.\nend widget-span\nend row\nend row-wrapper\nVP, Homes & Capital Expenditures\nDuaine Hatch\nDuaine Hatch is a seasoned project manager and estimator with over 20 years of experience across disaster restoration, utility infrastructure, and right-of-way acquisition. He has led complex residential and commercial reconstruction efforts, coordinated large-scale utility installations, and secured easements for major transmission and water projects across the U.S.\nFor the past five years, Duaine has managed capital improvement initiatives for Roots Management Group, overseeing multi-site infrastructure upgrades within mobile home communities. His work includes planning, budgeting, and executing projects that improve community standards, ensure compliance, and boost long-term asset value.\nDuaine’s background spans roles at Liberty Restoration, Electrical Consultants Inc., and Utah Disaster Kleenup, where he developed deep expertise in project scoping, cost estimating, and stakeholder coordination. With technical training in architectural, surveying, and civil engineering, along with certifications like Certified Restorer (CR), Duaine brings a hands-on, solutions-driven approach to every project he leads.\nend widget-span\nend row\nend row-wrapper\nVP, Marketing & PR\nDarrin Caldwell\nDarrin Caldwell leads the Marketing, Public Relations, and Business Development Representative (BDR) functions at Roots Management Group. With over 15 years of marketing experience and a passion for fostering progressive change, Darrin has a track record of helping individuals and organizations develop industry-leading skills, systems, and scalable programs.\nAs VP of Marketing, Darrin oversees a scrappy, high-performing team that has been instrumental in building Roots’ cutting-edge demand generation engine and driving innovation across a broad range of marketing initiatives. He also stewards the full brand experience, ensuring it aligns with Roots’ mission, values, and growth.\nOutside of work, Darrin is a devoted husband and father of three who finds inspiration and balance in the great outdoors. Whether fly fishing a quiet stream, scaling rock walls, coaching youth soccer, or backpacking through remote wilderness, he brings the same energy and curiosity to life that he brings to work.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nend widget-span",
      "emails": []
    },
    {
      "url": "https://rootsmg.com/about-us",
      "is_candidate": false,
      "has_email": false,
      "text": "end widget-span\nend row\nend row-wrapper\nAbout Roots\nTransforming Housing, Enriching Lives\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nAbout Roots\nTransforming Manufactured Housing & Bettering Lives!\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nRooted\nin Positive Transformation\nRooted in positive transformation, Roots Management Group (Roots) is dedicated to bettering the lives of our residents, community managers, and employees, and increasing the availability of best-in-class housing options that everyday people can afford.\nRoots MG Is Leading the Industry\nToday, we have evolved into an integrated manufactured housing community (MHC) investment platform and management company, spearheading transformation in the industry. Established in 2017, with demonstrated unwavering commitment to community development, capital improvements, and meticulous management practices.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nRally Together as One\nOvercome & Deliver\nOwnership for All\nTrusted to Transform\nEmpower Growth\nDedicated to Bettering Lives\nBy focusing on these core principles, we not only enhance the quality of life for our residents but also foster thriving communities that benefit all stakeholders involved. These core values paired with our diverse expertise and strategic partnerships create a unique and powerful combination that empowers us to transform communities and lives.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nOur Capabilities: Empowering Change\nAt Roots, we possess the capabilities to consider the acquisition of any available properties, ensuring we can make a positive impact in communities nationwide.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nend widget-span\nRoots Management Group Today: Leading the Industry\nToday, we have evolved into an integrated manufactured housing community (MHC) investment platform and management company, spearheading transformation in the industry. Established in 2017, with demonstrated unwavering commitment to community development, capital improvements, and meticulous management practices.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nOur Strategies: Fostering Thriving and Inclusive Environments\nThrough our acquisition, investment, and operational strategies, we work tirelessly to transform these communities into thriving and inclusive environments.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nend widget-span\nOur Commitment: Balancing Success\nWe are proud to be part of a transformational journey that combines financial success with social responsibility. At Roots Management Group, we are dedicated to creating a future where affordable housing is accessible to all, and where communities can flourish.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nWHO WE ARE\nRoots:\nBuilding a Thriving Community, One Team Member at a Time\nRoots Management Group is a manufactured housing community (MHC) investment platform and management company.\nOur mission is to help increase the availability of best-in-class housing options people can afford. We accomplish that by acquiring, investing in, and operating manufactured housing communities. We prioritize communication, empowerment, relationships and pride ourselves for continuous growth, working hard, reaching goals, and rewarding our team members.\nAt Roots, you will be a part of an industry-leading organization where you will be challenged, inspired, rewarded, and transformed.\nAs one of the fastest-growing manufactured housing community operators in the country, we value those who take initiative, encourage teamwork, and work smart. Despite our rapid growth, we prioritize maintaining an atmosphere of service in all we do. To continually support our employees, we emphasize respect, teamwork, and sincerity in every interaction. Our focus is cultivating opportunities by understanding needs, creating connections, and empowering individuals.\nHubSpot Call-to-Action Code\n[if lte IE 8]><div id=\"hs-cta-ie-element\"></div><![endif]\nend HubSpot Call-to-Action Code\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nINTERESTED IN BECOMING A COMMUNITY MANGER?\nWe are\nRoots\n. We are Rooted in positive transformation!\nend widget-span\nend row\nend row-wrapper\nRoots Management Group is a dynamic and expanding property management company dedicated to operating exceptional manufactured housing communities across the United States. We are currently in search of a passionate and motivated full-time community manager to lead the day-to-day operations of one of our manufactured home communities.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\n/01\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nOur Commitment to Excellence\nend widget-span\nend row\nend row-wrapper\nOur primary objective is to ensure the efficient and professional management of our communities, striving to achieve excellence in customer satisfaction, occupancy rates, delinquency management, community appearance, sales, revenue generation, and cost control. By upholding these standards, we aim to create a welcoming and thriving environment for our residents.\nend widget-span\nend row\nend row-wrapper\nend widget-span\n/02\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nJoin Our Transformative Team\nend widget-span\nend row\nend row-wrapper\nJoining Roots Management Group means becoming part of an industry-leading organization that will challenge, inspire, reward, and transform you. As one of the fastest-growing operators of manufactured housing communities in the country, we value individuals who take initiative, foster teamwork, and work diligently to achieve their goals. Despite our rapid growth, we remain committed to maintaining a culture of service in everything we do.\nBrowse our open positions >>\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\n/03\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nEmpowering Our People\nend widget-span\nend row\nend row-wrapper\nAt Roots Management Group, we believe in the power of our employees and their ability to make a meaningful impact. We foster an atmosphere that emphasizes respect, collaboration, and sincerity in every interaction. We understand the importance of supporting our team members and provide ongoing training and development opportunities to enhance their skills and expertise.\nend widget-span\nend row\nend row-wrapper\nend widget-span\n/04\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nBuilding Opportunities to Succeed\nend widget-span\nend row\nend row-wrapper\nOur core focus is on creating opportunities by truly understanding the needs of our residents, forging meaningful connections, and empowering individuals to achieve their full potential. We are dedicated to recognizing and rewarding hard work and goal achievement, providing a platform for professional growth within our organization.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend widget-span\nend row\nend row-wrapper\nAbout Roots\nTransforming Housing, Enriching Lives\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nAbout Roots\nTransforming Manufactured Housing & Bettering Lives!\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nRooted\nin Positive Transformation\nRooted in positive transformation, Roots Management Group (Roots) is dedicated to bettering the lives of our residents, community managers, and employees, and increasing the availability of best-in-class housing options that everyday people can afford.\nRoots MG Is Leading the Industry\nToday, we have evolved into an integrated manufactured housing community (MHC) investment platform and management company, spearheading transformation in the industry. Established in 2017, with demonstrated unwavering commitment to community development, capital improvements, and meticulous management practices.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nRally Together as One\nOvercome & Deliver\nOwnership for All\nTrusted to Transform\nEmpower Growth\nDedicated to Bettering Lives\nBy focusing on these core principles, we not only enhance the quality of life for our residents but also foster thriving communities that benefit all stakeholders involved. These core values paired with our diverse expertise and strategic partnerships create a unique and powerful combination that empowers us to transform communities and lives.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nOur Capabilities: Empowering Change\nAt Roots, we possess the capabilities to consider the acquisition of any available properties, ensuring we can make a positive impact in communities nationwide.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nend widget-span\nRoots Management Group Today: Leading the Industry\nToday, we have evolved into an integrated manufactured housing community (MHC) investment platform and management company, spearheading transformation in the industry. Established in 2017, with demonstrated unwavering commitment to community development, capital improvements, and meticulous management practices.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nOur Strategies: Fostering Thriving and Inclusive Environments\nThrough our acquisition, investment, and operational strategies, we work tirelessly to transform these communities into thriving and inclusive environments.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nend widget-span\nOur Commitment: Balancing Success\nWe are proud to be part of a transformational journey that combines financial success with social responsibility. At Roots Management Group, we are dedicated to creating a future where affordable housing is accessible to all, and where communities can flourish.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nWHO WE ARE\nRoots:\nBuilding a Thriving Community, One Team Member at a Time\nRoots Management Group is a manufactured housing community (MHC) investment platform and management company.\nOur mission is to help increase the availability of best-in-class housing options people can afford. We accomplish that by acquiring, investing in, and operating manufactured housing communities. We prioritize communication, empowerment, relationships and pride ourselves for continuous growth, working hard, reaching goals, and rewarding our team members.\nAt Roots, you will be a part of an industry-leading organization where you will be challenged, inspired, rewarded, and transformed.\nAs one of the fastest-growing manufactured housing community operators in the country, we value those who take initiative, encourage teamwork, and work smart. Despite our rapid growth, we prioritize maintaining an atmosphere of service in all we do. To continually support our employees, we emphasize respect, teamwork, and sincerity in every interaction. Our focus is cultivating opportunities by understanding needs, creating connections, and empowering individuals.\nHubSpot Call-to-Action Code\n[if lte IE 8]><div id=\"hs-cta-ie-element\"></div><![endif]\nend HubSpot Call-to-Action Code\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nINTERESTED IN BECOMING A COMMUNITY MANGER?\nWe are\nRoots\n. We are Rooted in positive transformation!\nend widget-span\nend row\nend row-wrapper\nRoots Management Group is a dynamic and expanding property management company dedicated to operating exceptional manufactured housing communities across the United States. We are currently in search of a passionate and motivated full-time community manager to lead the day-to-day operations of one of our manufactured home communities.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\n/01\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nOur Commitment to Excellence\nend widget-span\nend row\nend row-wrapper\nOur primary objective is to ensure the efficient and professional management of our communities, striving to achieve excellence in customer satisfaction, occupancy rates, delinquency management, community appearance, sales, revenue generation, and cost control. By upholding these standards, we aim to create a welcoming and thriving environment for our residents.\nend widget-span\nend row\nend row-wrapper\nend widget-span\n/02\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nJoin Our Transformative Team\nend widget-span\nend row\nend row-wrapper\nJoining Roots Management Group means becoming part of an industry-leading organization that will challenge, inspire, reward, and transform you. As one of the fastest-growing operators of manufactured housing communities in the country, we value individuals who take initiative, foster teamwork, and work diligently to achieve their goals. Despite our rapid growth, we remain committed to maintaining a culture of service in everything we do.\nBrowse our open positions >>\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\n/03\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nEmpowering Our People\nend widget-span\nend row\nend row-wrapper\nAt Roots Management Group, we believe in the power of our employees and their ability to make a meaningful impact. We foster an atmosphere that emphasizes respect, collaboration, and sincerity in every interaction. We understand the importance of supporting our team members and provide ongoing training and development opportunities to enhance their skills and expertise.\nend widget-span\nend row\nend row-wrapper\nend widget-span\n/04\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nBuilding Opportunities to Succeed\nend widget-span\nend row\nend row-wrapper\nOur core focus is on creating opportunities by truly understanding the needs of our residents, forging meaningful connections, and empowering individuals to achieve their full potential. We are dedicated to recognizing and rewarding hard work and goal achievement, providing a platform for professional growth within our organization.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nend widget-span",
      "emails": []
    },
    {
      "url": "https://rootsmg.com/contact-us",
      "is_candidate": false,
      "has_email": true,
      "text": "end widget-span\nend row\nend row-wrapper\nContact Us\nWe are here to help.\nDrop us a message below and we'll get back to you as soon as possible.\nend widget-span\nend row\nend row-wrapper\nRoots Management Group\nCall us at: 480.339.0000\nThis help line is operated by voicemail only, so please leave a detailed message so we can best help you. Thank you!\nPlease feel free to email us at\nCustomerCare@RootsMG.com\nor fill out the form below and let us know how we can best help you out.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend widget-span\nend row\nend row-wrapper\nContact Us\nWe are here to help.\nDrop us a message below and we'll get back to you as soon as possible.\nend widget-span\nend row\nend row-wrapper\nRoots Management Group\nCall us at: 480.339.0000\nThis help line is operated by voicemail only, so please leave a detailed message so we can best help you. Thank you!\nPlease feel free to email us at\nCustomerCare@RootsMG.com\nor fill out the form below and let us know how we can best help you out.\nend widget-span\nend row\nend row-wrapper\nend widget-span",
      "emails": [
        "customercare@rootsmg.com"
      ]
    },
    {
      "url": "https://rootsmg.com/meet-the-team?hsLang=en",
      "is_candidate": false,
      "has_email": false,
      "text": "end widget-span\nend row\nend row-wrapper\nMeet the Team\nGet to know the dedicated and dynamic individuals who make our company's success a reality.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nPresident & CEO\nTom Stapley\nTom Stapley is a leader and advocate for manufactured housing. With a career spanning over 17 years in the manufactured housing industry, Tom is committed to building welcoming, safe and well-maintained communities for individuals and families to call home. Tom is an executive founder and the President of Roots Management, which emerged from the merger of Treehouse Communities and Vineyards Communities. Today, Roots is one of the premier companies in the manufactured home industry, operating over 241 communities across 24 states. Tom co-founded Treehouse Group Companies in 2006 and he has been the driving force in helping Treehouse grow and succeed to become a top manufactured housing provider. His leadership is anchored in a commitment to building teams and empowering people. He is dedicated to cultivating opportunities for individuals, families, and entire communities and to creating safe, friendly, and opportunity-rich environments. Tom also co-founded Invitation Homes in 2012, a venture that has grown into the largest single-family rental home company in the United States. With over 80,000 homes in its portfolio, Invitation Homes has reshaped the landscape of single-family rentals. As the President of Roots Management Group, Tom continues to lead with a vision to provide quality housing opportunities for individuals and families.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nCFO\nSarah McCombs Taylor\nSarah McCombs Taylor serves as the Chief Financial Officer of Accounting at Roots Management Group.\nSarah is committed to fostering high-performing teams that deliver exceptional results while building meaningful relationships.\nSarah’s expertise lies in developing practical solutions for complex financial challenges, approaching her work with an open mindset that drives continuous improvement. Before joining Roots, she led the financial reporting department at Spirit Realty Capital, Inc. (NYSE: SRC), a publicly traded Real Estate Investment Trust, where she worked for about eight years. Prior to that, she spent more than seven years at Ernst & Young (EY), a Big 4 public accounting firm, in the Wealth and Asset Management audit practice.\nSarah earned both her Master in Professional Accounting and Bachelor of Business Administration, with a minor in History, from the University of Texas at Austin, where she was part of the prestigious Business Honors Program. She is also a licensed Certified Public Accountant (CPA) in Texas.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nCOO\nCorey D. Wikstrom\nCorey D. Wikstrom is a seasoned executive with a distinguished career in the Manufactured Housing and RV industry.\nCorey’s journey in the industry is marked by his exceptional performance in various leadership roles. As former Senior Vice President of Operations at Roots Management Group, at that time the company saw significant improvements in operational efficiency.\nBefore joining Roots Management Group, Corey was the Chief Operating Officer at Three Pillar Communities. Here he drove the company’s success and was instrumental in the organization’s remarkable growth.\nCorey's educational background in Business Administration and Marketing, combined with his extensive experience, makes him an asset to Roots Management Group. His ability to build winning teams, lead operations, and drive growth and efficiency has been consistently demonstrated throughout his career.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nMeet the Team\nGet to know the dedicated and dynamic individuals who make our company's success a reality.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nCLO\nEric Blum\nWith nearly 20 years of experience as a corporate attorney with significant experience in real estate, private equity, corporate governance, capital markets and mergers & acquisitions, Eric currently serves as our Chief Legal Officer and Secretary, leading the teams responsible for all legal matters and risk management. He previously served as COO of OZ Impact Funds (the investment arm of Vineyards Management Group) from February 2019 until the merger of OZ and Vineyards into Roots in August 2021, when Eric assumed his current role. He previously worked as an associate at Greenberg Traurig in Las Vegas, Nevada, where his principal practice areas were mergers and acquisitions, securities and corporate finance and corporate governance.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nSVP, Investments\nTim Jurczak\nTim leads the team responsible for acquisitions, dispositions, and development activities in collaboration with the company’s institutional investors. He also plays a key role in cultivating relationships with new capital partners.\nBefore joining Roots Management Group in August 2021, Tim spent over a decade at Green Courte Partners,\na real estate private equity firm based in Chicago. There, he specialized in acquiring niche real estate assets, with a strong focus on manufactured housing communities nationwide. He was also instrumental in the 2014 sale of Green Courte’s portfolio of 19,000 manufactured housing sites to Sun Communities for approximately $1.3 billion.\nTim holds a degree from the University of Wisconsin-Madison.\nOutside of work, he enjoys spending time with family in Rhode Island, reconnecting with friends in Chicago, and playing golf on new courses across the country.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nSVP, Deputy General Counsel\nMaria Kenny\nMaria oversees corporate governance, regulatory compliance, dispute resolution, and enterprise-wide risk management.\nSince joining Roots in 2022, Maria has held a series of progressively senior roles within the company’s legal department. Her previous responsibilities included overseeing insurance and risk management, entity administration and compliance, and providing transactional support.\nBefore joining Roots, Maria served as in-house counsel at Elo, a global provider of touchscreen technology solutions. Earlier in her career, she was a prosecutor with the Cook County State’s Attorney’s Office in Chicago, Illinois.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nSVP, Operations\nTierria Hilton\nAs Senior Vice President of the Central Division at Roots Management Group, Tierria Hilton brings nearly 13 years of property management experience, with a strong background in affordable housing and turning distressed properties into profitable assets. Her expertise in strategic problem-solving and operational efficiency has made her a key leader in driving success across the communities she oversees.\nTierria is deeply committed to staff development, ensuring her teams are equipped with the knowledge and skills to manage multimillion-dollar assets effectively. By fostering a culture of growth and excellence, she helps strengthen both individual performance and overall community success.\nBefore joining Roots, Tierria served as Regional Manager for the Housing Authority in South Carolina, overseeing 29 communities and implementing new operational processes that enhanced efficiency across the organization.\nTierria holds a degree in Business Administration with a concentration in accounting, giving her a strong financial foundation to navigate the complexities of property management. Her passion for enhancing the affordable housing sector continues to shape her impactful leadership.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nSVP, Operations\nTishanna Newman\nTishanna Newman is a dynamic and results-driven leader with over 20 years of experience in the manufactured housing industry. As Senior Vice President for Fund I, II, and IV at Roots Management Group, she oversees community operations, budgeting, home rehabbing, delinquency reduction, and capital improvement projects across her portfolio.\nSince joining Roots Management Group four years ago, Tishanna has made a significant impact. She initially managed 18 properties as a Regional Manager before being promoted to Senior Vice President in December 2023. Under her leadership, her team has successfully rehabbed and turned over 900 homes in a year, contributing to a monthly portfolio revenue of approximately $765,000.\nWith an extensive background in homes, building codes, remodeling, and capital improvements, Tishanna is committed to enhancing community living standards and driving operational efficiency. Her expertise and strategic vision continue to propel Roots Management Group toward growth and success.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nSVP, Data Analytics & IT\nMahesh Salem\nMahesh Salem is the Senior Vice President of Data Analytics and IT at Roots Management Group, bringing over 20 years of top-tier consulting experience in Information Management, Business Intelligence, and Analytics.\nWith a deep understanding of data-driven solutions, Mahesh has successfully led transformative initiatives across a wide range of industries, including Energy & Utilities, Consumer Packaged Goods, Technology, Telecom & Media, Civil Aviation, Chemicals, and Pharmaceuticals.\nMahesh combines technical expertise with business acumen, specializing in enterprise data strategies, predictive analytics, and AI-driven insights to enhance operational efficiency and accelerate business growth.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nVP, Capital Markets and Risk\nEmilio Allen\nEmilio Allen leads the Capital Markets and Risk Management functions at Roots. He has over twenty years of mortgage finance experience including closing over $13 billion of multifamily debt transactions. Before joining Roots, Emilio held various roles at Fannie Mae, where he grew multifamily structured transactions, managed technology initiatives for single-family trading desks, and contributed to automated underwriting efforts. He has an MBA from American University with concentrations in real estate & finance and a bachelor's of science from Marquette University in information technology.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nVP, People Operations\nFabiana Larese\nFabiana Larese is a seasoned Human Resources Executive with a strategic and goal-oriented approach to fostering exceptional workplace cultures. With a career spanning diverse industries—including construction, manufacturing, real estate, insurance, and automotive—Fabiana has a proven track record in HR consulting, organizational development, and employee and labor relations.\nAs Vice President of People Operations at Roots Management Group, Fabiana plays a key role in shaping the company’s HR strategy, ensuring alignment between workforce initiatives and business objectives. She excels in developing compensation and benefits programs, driving talent acquisition and retention strategies, and enhancing company culture to create a thriving work environment.\nPassionate about people and performance, Fabiana is dedicated to building strong, engaged teams that contribute to sustainable business growth. Her expertise in HR leadership and corporate strategy makes her an invaluable asset in cultivating a positive and productive workplace at Roots Management Group.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nVP, Portfolio & Asset Management\nMax McBride\nMax McBride leads the portfolio and asset management functions at Roots Management Group, ensuring the strategic growth and financial performance of the company’s properties. Since joining Roots in 2020, Max has played a key role in analyzing and reporting asset performance across the portfolio. His responsibilities include preparing annual property budgets, assessing financial results, delivering investor reporting, and implementing portfolio strategies to optimize asset value.\nEarly in his tenure at Roots, Max was instrumental in supporting asset dispositions. Since then, he has led or assisted in the sale or recapitalization of over 6,000 manufactured home sites. His expertise in financial analysis and strategic execution has been integral to the company’s continued success.\nMax earned a Bachelor of Science in Finance from Brigham Young University’s Marriott School of Management. Prior to joining Roots, he gained experience in hedge fund administration at Northern Trust, further strengthening his financial and investment management expertise.\nend widget-span\nend row\nend row-wrapper\nVP, Dealership & Title\nMarkita Roberson\nWith over 20 years of experience in the manufactured housing industry, Markita Roberson leads the Inventory and Licensing team at Roots with a strategic and solutions-driven mindset. She played a pivotal role in implementing efficient inventory processes that support operational scalability and compliance. Known for bringing outside-the-box thinking to complex licensing challenges, Markita and her team have been instrumental in overcoming regulatory roadblocks and streamlining title management. Over the past 2.5 years, Markita’s leadership has driven a significant increase in completed titles and licensing across the Roots portfolio, aiding Roots’ mission to provide best-in-class housing options to its customers.\nend widget-span\nend row\nend row-wrapper\nVP, Sales\nDaniel Roacho\nDaniel Roacho is a seasoned sales executive with over 15 years of experience in the Manufactured Housing industry.\nAs Vice President of Sales at Roots Management Group, Daniel leads national sales strategy and oversees a high-performing management team responsible for driving occupancy and homeownership across a diverse portfolio. He led the development and launch of the Establish Your Roots (EYR) program—an impactful initiative that helps residents transition from renting to owning, supporting long-term stability and financial empowerment.\nDaniel’s career is defined by his ability to build scalable systems, lead with purpose, and deliver results through servant leadership and continuous improvement. He is proud to work alongside a resilient, innovative team that embraces challenges, adapts quickly, and consistently finds new ways to expand access to homeownership.\nThe son of a construction worker and grandson of a migrant farm laborer, Daniel’s commitment to housing access is deeply personal. He credits his parents for instilling the values of perseverance, humility, and service—principles that continue to guide his leadership. Outside of work, Daniel is a devoted family man and community leader. He is the founder of the DJR Memorial Foundation, a nonprofit dedicated to supporting underserved populations through local resources and community-driven programs. He also founded and coached the Ruachis Baseball Club, a youth baseball program focused on mentorship, discipline, and opportunity through sport.\nDaniel holds a Bachelor's degree in Finance from Regis University.\nend widget-span\nend row\nend row-wrapper\nVP, Operations Strategy\nTyler Brady\nTyler Brady serves as the Vice President of Operations Strategy at Roots Management Group, where he leads the development and execution of operational strategies that drive efficiency and performance across the organization. His department oversees key areas such as utilities management, market rent optimization, home inventory oversight, delinquency and collections, vendor services, and ancillary revenue opportunities.\nBefore joining Roots, Tyler spent five years in investment banking at Goldman Sachs, where he gained deep expertise in financial analysis, strategic planning, and operational scalability. He holds an MBA from the University of Utah and brings a data-driven, results-oriented approach to problem-solving and organizational leadership.\nAn entrepreneur at heart, Tyler is constantly looking for ways to improve existing processes and unlock new opportunities for growth. His global perspective is shaped in part by his experience living in China with his wife, where they embraced new cultures and ideas. Outside of work, Tyler is a dedicated family man who enjoys spending time outdoors and playing sports with his wife and three children.\nend widget-span\nend row\nend row-wrapper\nVP, Homes & Capital Expenditures\nDuaine Hatch\nDuaine Hatch is a seasoned project manager and estimator with over 20 years of experience across disaster restoration, utility infrastructure, and right-of-way acquisition. He has led complex residential and commercial reconstruction efforts, coordinated large-scale utility installations, and secured easements for major transmission and water projects across the U.S.\nFor the past five years, Duaine has managed capital improvement initiatives for Roots Management Group, overseeing multi-site infrastructure upgrades within mobile home communities. His work includes planning, budgeting, and executing projects that improve community standards, ensure compliance, and boost long-term asset value.\nDuaine’s background spans roles at Liberty Restoration, Electrical Consultants Inc., and Utah Disaster Kleenup, where he developed deep expertise in project scoping, cost estimating, and stakeholder coordination. With technical training in architectural, surveying, and civil engineering, along with certifications like Certified Restorer (CR), Duaine brings a hands-on, solutions-driven approach to every project he leads.\nend widget-span\nend row\nend row-wrapper\nVP, Marketing & PR\nDarrin Caldwell\nDarrin Caldwell leads the Marketing, Public Relations, and Business Development Representative (BDR) functions at Roots Management Group. With over 15 years of marketing experience and a passion for fostering progressive change, Darrin has a track record of helping individuals and organizations develop industry-leading skills, systems, and scalable programs.\nAs VP of Marketing, Darrin oversees a scrappy, high-performing team that has been instrumental in building Roots’ cutting-edge demand generation engine and driving innovation across a broad range of marketing initiatives. He also stewards the full brand experience, ensuring it aligns with Roots’ mission, values, and growth.\nOutside of work, Darrin is a devoted husband and father of three who finds inspiration and balance in the great outdoors. Whether fly fishing a quiet stream, scaling rock walls, coaching youth soccer, or backpacking through remote wilderness, he brings the same energy and curiosity to life that he brings to work.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend widget-span\nend row\nend row-wrapper\nMeet the Team\nGet to know the dedicated and dynamic individuals who make our company's success a reality.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nPresident & CEO\nTom Stapley\nTom Stapley is a leader and advocate for manufactured housing. With a career spanning over 17 years in the manufactured housing industry, Tom is committed to building welcoming, safe and well-maintained communities for individuals and families to call home. Tom is an executive founder and the President of Roots Management, which emerged from the merger of Treehouse Communities and Vineyards Communities. Today, Roots is one of the premier companies in the manufactured home industry, operating over 241 communities across 24 states. Tom co-founded Treehouse Group Companies in 2006 and he has been the driving force in helping Treehouse grow and succeed to become a top manufactured housing provider. His leadership is anchored in a commitment to building teams and empowering people. He is dedicated to cultivating opportunities for individuals, families, and entire communities and to creating safe, friendly, and opportunity-rich environments. Tom also co-founded Invitation Homes in 2012, a venture that has grown into the largest single-family rental home company in the United States. With over 80,000 homes in its portfolio, Invitation Homes has reshaped the landscape of single-family rentals. As the President of Roots Management Group, Tom continues to lead with a vision to provide quality housing opportunities for individuals and families.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nCFO\nSarah McCombs Taylor\nSarah McCombs Taylor serves as the Chief Financial Officer of Accounting at Roots Management Group.\nSarah is committed to fostering high-performing teams that deliver exceptional results while building meaningful relationships.\nSarah’s expertise lies in developing practical solutions for complex financial challenges, approaching her work with an open mindset that drives continuous improvement. Before joining Roots, she led the financial reporting department at Spirit Realty Capital, Inc. (NYSE: SRC), a publicly traded Real Estate Investment Trust, where she worked for about eight years. Prior to that, she spent more than seven years at Ernst & Young (EY), a Big 4 public accounting firm, in the Wealth and Asset Management audit practice.\nSarah earned both her Master in Professional Accounting and Bachelor of Business Administration, with a minor in History, from the University of Texas at Austin, where she was part of the prestigious Business Honors Program. She is also a licensed Certified Public Accountant (CPA) in Texas.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nCOO\nCorey D. Wikstrom\nCorey D. Wikstrom is a seasoned executive with a distinguished career in the Manufactured Housing and RV industry.\nCorey’s journey in the industry is marked by his exceptional performance in various leadership roles. As former Senior Vice President of Operations at Roots Management Group, at that time the company saw significant improvements in operational efficiency.\nBefore joining Roots Management Group, Corey was the Chief Operating Officer at Three Pillar Communities. Here he drove the company’s success and was instrumental in the organization’s remarkable growth.\nCorey's educational background in Business Administration and Marketing, combined with his extensive experience, makes him an asset to Roots Management Group. His ability to build winning teams, lead operations, and drive growth and efficiency has been consistently demonstrated throughout his career.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nMeet the Team\nGet to know the dedicated and dynamic individuals who make our company's success a reality.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nCLO\nEric Blum\nWith nearly 20 years of experience as a corporate attorney with significant experience in real estate, private equity, corporate governance, capital markets and mergers & acquisitions, Eric currently serves as our Chief Legal Officer and Secretary, leading the teams responsible for all legal matters and risk management. He previously served as COO of OZ Impact Funds (the investment arm of Vineyards Management Group) from February 2019 until the merger of OZ and Vineyards into Roots in August 2021, when Eric assumed his current role. He previously worked as an associate at Greenberg Traurig in Las Vegas, Nevada, where his principal practice areas were mergers and acquisitions, securities and corporate finance and corporate governance.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nSVP, Investments\nTim Jurczak\nTim leads the team responsible for acquisitions, dispositions, and development activities in collaboration with the company’s institutional investors. He also plays a key role in cultivating relationships with new capital partners.\nBefore joining Roots Management Group in August 2021, Tim spent over a decade at Green Courte Partners,\na real estate private equity firm based in Chicago. There, he specialized in acquiring niche real estate assets, with a strong focus on manufactured housing communities nationwide. He was also instrumental in the 2014 sale of Green Courte’s portfolio of 19,000 manufactured housing sites to Sun Communities for approximately $1.3 billion.\nTim holds a degree from the University of Wisconsin-Madison.\nOutside of work, he enjoys spending time with family in Rhode Island, reconnecting with friends in Chicago, and playing golf on new courses across the country.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nSVP, Deputy General Counsel\nMaria Kenny\nMaria oversees corporate governance, regulatory compliance, dispute resolution, and enterprise-wide risk management.\nSince joining Roots in 2022, Maria has held a series of progressively senior roles within the company’s legal department. Her previous responsibilities included overseeing insurance and risk management, entity administration and compliance, and providing transactional support.\nBefore joining Roots, Maria served as in-house counsel at Elo, a global provider of touchscreen technology solutions. Earlier in her career, she was a prosecutor with the Cook County State’s Attorney’s Office in Chicago, Illinois.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nSVP, Operations\nTierria Hilton\nAs Senior Vice President of the Central Division at Roots Management Group, Tierria Hilton brings nearly 13 years of property management experience, with a strong background in affordable housing and turning distressed properties into profitable assets. Her expertise in strategic problem-solving and operational efficiency has made her a key leader in driving success across the communities she oversees.\nTierria is deeply committed to staff development, ensuring her teams are equipped with the knowledge and skills to manage multimillion-dollar assets effectively. By fostering a culture of growth and excellence, she helps strengthen both individual performance and overall community success.\nBefore joining Roots, Tierria served as Regional Manager for the Housing Authority in South Carolina, overseeing 29 communities and implementing new operational processes that enhanced efficiency across the organization.\nTierria holds a degree in Business Administration with a concentration in accounting, giving her a strong financial foundation to navigate the complexities of property management. Her passion for enhancing the affordable housing sector continues to shape her impactful leadership.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nSVP, Operations\nTishanna Newman\nTishanna Newman is a dynamic and results-driven leader with over 20 years of experience in the manufactured housing industry. As Senior Vice President for Fund I, II, and IV at Roots Management Group, she oversees community operations, budgeting, home rehabbing, delinquency reduction, and capital improvement projects across her portfolio.\nSince joining Roots Management Group four years ago, Tishanna has made a significant impact. She initially managed 18 properties as a Regional Manager before being promoted to Senior Vice President in December 2023. Under her leadership, her team has successfully rehabbed and turned over 900 homes in a year, contributing to a monthly portfolio revenue of approximately $765,000.\nWith an extensive background in homes, building codes, remodeling, and capital improvements, Tishanna is committed to enhancing community living standards and driving operational efficiency. Her expertise and strategic vision continue to propel Roots Management Group toward growth and success.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nSVP, Data Analytics & IT\nMahesh Salem\nMahesh Salem is the Senior Vice President of Data Analytics and IT at Roots Management Group, bringing over 20 years of top-tier consulting experience in Information Management, Business Intelligence, and Analytics.\nWith a deep understanding of data-driven solutions, Mahesh has successfully led transformative initiatives across a wide range of industries, including Energy & Utilities, Consumer Packaged Goods, Technology, Telecom & Media, Civil Aviation, Chemicals, and Pharmaceuticals.\nMahesh combines technical expertise with business acumen, specializing in enterprise data strategies, predictive analytics, and AI-driven insights to enhance operational efficiency and accelerate business growth.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nVP, Capital Markets and Risk\nEmilio Allen\nEmilio Allen leads the Capital Markets and Risk Management functions at Roots. He has over twenty years of mortgage finance experience including closing over $13 billion of multifamily debt transactions. Before joining Roots, Emilio held various roles at Fannie Mae, where he grew multifamily structured transactions, managed technology initiatives for single-family trading desks, and contributed to automated underwriting efforts. He has an MBA from American University with concentrations in real estate & finance and a bachelor's of science from Marquette University in information technology.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nVP, People Operations\nFabiana Larese\nFabiana Larese is a seasoned Human Resources Executive with a strategic and goal-oriented approach to fostering exceptional workplace cultures. With a career spanning diverse industries—including construction, manufacturing, real estate, insurance, and automotive—Fabiana has a proven track record in HR consulting, organizational development, and employee and labor relations.\nAs Vice President of People Operations at Roots Management Group, Fabiana plays a key role in shaping the company’s HR strategy, ensuring alignment between workforce initiatives and business objectives. She excels in developing compensation and benefits programs, driving talent acquisition and retention strategies, and enhancing company culture to create a thriving work environment.\nPassionate about people and performance, Fabiana is dedicated to building strong, engaged teams that contribute to sustainable business growth. Her expertise in HR leadership and corporate strategy makes her an invaluable asset in cultivating a positive and productive workplace at Roots Management Group.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nVP, Portfolio & Asset Management\nMax McBride\nMax McBride leads the portfolio and asset management functions at Roots Management Group, ensuring the strategic growth and financial performance of the company’s properties. Since joining Roots in 2020, Max has played a key role in analyzing and reporting asset performance across the portfolio. His responsibilities include preparing annual property budgets, assessing financial results, delivering investor reporting, and implementing portfolio strategies to optimize asset value.\nEarly in his tenure at Roots, Max was instrumental in supporting asset dispositions. Since then, he has led or assisted in the sale or recapitalization of over 6,000 manufactured home sites. His expertise in financial analysis and strategic execution has been integral to the company’s continued success.\nMax earned a Bachelor of Science in Finance from Brigham Young University’s Marriott School of Management. Prior to joining Roots, he gained experience in hedge fund administration at Northern Trust, further strengthening his financial and investment management expertise.\nend widget-span\nend row\nend row-wrapper\nVP, Dealership & Title\nMarkita Roberson\nWith over 20 years of experience in the manufactured housing industry, Markita Roberson leads the Inventory and Licensing team at Roots with a strategic and solutions-driven mindset. She played a pivotal role in implementing efficient inventory processes that support operational scalability and compliance. Known for bringing outside-the-box thinking to complex licensing challenges, Markita and her team have been instrumental in overcoming regulatory roadblocks and streamlining title management. Over the past 2.5 years, Markita’s leadership has driven a significant increase in completed titles and licensing across the Roots portfolio, aiding Roots’ mission to provide best-in-class housing options to its customers.\nend widget-span\nend row\nend row-wrapper\nVP, Sales\nDaniel Roacho\nDaniel Roacho is a seasoned sales executive with over 15 years of experience in the Manufactured Housing industry.\nAs Vice President of Sales at Roots Management Group, Daniel leads national sales strategy and oversees a high-performing management team responsible for driving occupancy and homeownership across a diverse portfolio. He led the development and launch of the Establish Your Roots (EYR) program—an impactful initiative that helps residents transition from renting to owning, supporting long-term stability and financial empowerment.\nDaniel’s career is defined by his ability to build scalable systems, lead with purpose, and deliver results through servant leadership and continuous improvement. He is proud to work alongside a resilient, innovative team that embraces challenges, adapts quickly, and consistently finds new ways to expand access to homeownership.\nThe son of a construction worker and grandson of a migrant farm laborer, Daniel’s commitment to housing access is deeply personal. He credits his parents for instilling the values of perseverance, humility, and service—principles that continue to guide his leadership. Outside of work, Daniel is a devoted family man and community leader. He is the founder of the DJR Memorial Foundation, a nonprofit dedicated to supporting underserved populations through local resources and community-driven programs. He also founded and coached the Ruachis Baseball Club, a youth baseball program focused on mentorship, discipline, and opportunity through sport.\nDaniel holds a Bachelor's degree in Finance from Regis University.\nend widget-span\nend row\nend row-wrapper\nVP, Operations Strategy\nTyler Brady\nTyler Brady serves as the Vice President of Operations Strategy at Roots Management Group, where he leads the development and execution of operational strategies that drive efficiency and performance across the organization. His department oversees key areas such as utilities management, market rent optimization, home inventory oversight, delinquency and collections, vendor services, and ancillary revenue opportunities.\nBefore joining Roots, Tyler spent five years in investment banking at Goldman Sachs, where he gained deep expertise in financial analysis, strategic planning, and operational scalability. He holds an MBA from the University of Utah and brings a data-driven, results-oriented approach to problem-solving and organizational leadership.\nAn entrepreneur at heart, Tyler is constantly looking for ways to improve existing processes and unlock new opportunities for growth. His global perspective is shaped in part by his experience living in China with his wife, where they embraced new cultures and ideas. Outside of work, Tyler is a dedicated family man who enjoys spending time outdoors and playing sports with his wife and three children.\nend widget-span\nend row\nend row-wrapper\nVP, Homes & Capital Expenditures\nDuaine Hatch\nDuaine Hatch is a seasoned project manager and estimator with over 20 years of experience across disaster restoration, utility infrastructure, and right-of-way acquisition. He has led complex residential and commercial reconstruction efforts, coordinated large-scale utility installations, and secured easements for major transmission and water projects across the U.S.\nFor the past five years, Duaine has managed capital improvement initiatives for Roots Management Group, overseeing multi-site infrastructure upgrades within mobile home communities. His work includes planning, budgeting, and executing projects that improve community standards, ensure compliance, and boost long-term asset value.\nDuaine’s background spans roles at Liberty Restoration, Electrical Consultants Inc., and Utah Disaster Kleenup, where he developed deep expertise in project scoping, cost estimating, and stakeholder coordination. With technical training in architectural, surveying, and civil engineering, along with certifications like Certified Restorer (CR), Duaine brings a hands-on, solutions-driven approach to every project he leads.\nend widget-span\nend row\nend row-wrapper\nVP, Marketing & PR\nDarrin Caldwell\nDarrin Caldwell leads the Marketing, Public Relations, and Business Development Representative (BDR) functions at Roots Management Group. With over 15 years of marketing experience and a passion for fostering progressive change, Darrin has a track record of helping individuals and organizations develop industry-leading skills, systems, and scalable programs.\nAs VP of Marketing, Darrin oversees a scrappy, high-performing team that has been instrumental in building Roots’ cutting-edge demand generation engine and driving innovation across a broad range of marketing initiatives. He also stewards the full brand experience, ensuring it aligns with Roots’ mission, values, and growth.\nOutside of work, Darrin is a devoted husband and father of three who finds inspiration and balance in the great outdoors. Whether fly fishing a quiet stream, scaling rock walls, coaching youth soccer, or backpacking through remote wilderness, he brings the same energy and curiosity to life that he brings to work.\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nend widget-span\nend row\nend row-wrapper\nend widget-span",
      "emails": []
    },
    {
      "url": "https://www.facebook.com/RootsManagementGroup",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    },
    {
      "url": "https://www.facebook.com/RootsManagementGroup/",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    }
  ],
  "all_links": [
    "https://rootsmg.com/partnerships/covertree?hsLang=en",
    "https://rootsmg.com?hsLang=en",
    "https://rootsmg.com/communities?rv=1,2&hsLang=en",
    "https://rootsmg.com/blog",
    "https://rootsmg.com/hs/cta/wi/redirect?encryptedPayload=AVxigLKGPeFnSZYYL%2F2sM1coPoPwBz%2F480rOlOF1PClK8izKNSQ3VdoMAXj27oxHsgcrLGWH%2F2I6HFKZp7HZbeF1uj1V5f4s1pG7aBN8UK4%2Fj0clROuEaLPG740OumZ3qhrwIrLrshNaRM1sjiE3jyGTDKimWz1Ux47xfXNFFcE%3D&webInteractiveContentId=195567654309&portalId=22318900&hsLang=en",
    "https://rootsmg.com/better-future/community-development-programs?hsLang=en",
    "https://rootsmg.com/relocate-your-home",
    "https://rootsmg.com/better-future/referrals",
    "https://rootsmg.com/better-future/referrals?hsLang=en",
    "https://rootsmg.com/careers?hsLang=en",
    "https://rootsmg.com/communities?age_restricted=true",
    "https://rootsmg.com/communities?rv=1",
    "https://rootsmg.com/blog?hsLang=en",
    "https://rootsmg.com/community-case-studies",
    "https://rootsmg.com/better-future/rental-conversion?hsLang=en",
    "https://rootsmg.com/privacy-policy",
    "https://rootsmg.com/better-future/housing-crisis-solutions?hsLang=en",
    "https://rootsmg.com/partnerships/covertree",
    "https://rootsmg.com/communities?age_restricted=false&hsLang=en",
    "https://rootsmg.com/meet-the-team",
    "https://rootsmg.com/careers",
    "https://rootsmg.com/communities?age_restricted=true&hsLang=en",
    "https://rootsmg.com/better-future/community-development-programs",
    "https://rootsmg.com/about-us",
    "https://rootsmg.com/acquisitions-we-are-buying?hsLang=en",
    "https://rootsmg.com/contact-us",
    "https://rootsmg.com/community-case-studies?hsLang=en",
    "https://rootsmg.com/home",
    "https://rootsmg.com/communities",
    "https://rootsmg.com/why-partner-with-us?hsLang=en",
    "https://rootsmg.com/acquisitions-we-are-buying",
    "https://rootsmg.com/communities?age_restricted=false",
    "https://rootsmg.com/sustainability-at-roots",
    "https://rootsmg.com/sustainability-at-roots?hsLang=en",
    "https://rootsmg.com/meet-the-team?hsLang=en",
    "https://rootsmg.com/faq",
    "https://www.rootsmg.com?hsLang=en",
    "https://rootsmg.com/why-partner-with-us",
    "https://rootsmg.com/better-future/water-savings-case-study?hsLang=en",
    "https://rootsmg.com/hs/cta/wi/redirect?encryptedPayload=AVxigLJHkmqezUHbq5u22ud6BiiFoyfttpzCh3qXuArF%2Fi3jfuyE34bBZs55QYVk5sANkACnZYRXHqYfxx7fraxTLODjXZAHN7RhCobbWgLtezZ9eYPS9rtTFIxNOA%2FaNKKPdg5FPDga%2FTueca2ExKfjatCp4dK4x335%2FUYktto%3D&webInteractiveContentId=195567270933&portalId=22318900&hsLang=en",
    "https://rootsmg.com/what-makes-roots-unique?hsLang=en",
    "https://rootsmg.com/communities?hsLang=en",
    "https://rootsmg.com/rv-deals?hsLang=en",
    "https://rootsmg.com/what-makes-roots-unique",
    "https://rootsmg.com/better-future/housing-crisis-solutions",
    "https://rootsmg.com/better-future/rental-conversion"
  ],
  "candidate_links": [
    "https://rootsmg.com/meet-the-team",
    "https://rootsmg.com/about-us",
    "https://rootsmg.com/contact-us",
    "https://rootsmg.com/meet-the-team?hsLang=en",
    "https://www.facebook.com/RootsManagementGroup",
    "https://www.facebook.com/RootsManagementGroup/"
  ],
  "visited": [
    "https://rootsmg.com/communities/lakeside-village",
    "https://rootsmg.com/about",
    "https://rootsmg.com/contact",
    "https://rootsmg.com/staff",
    "https://rootsmg.com/team",
    "https://rootsmg.com/board",
    "https://rootsmg.com/directory",
    "https://rootsmg.com/events",
    "https://rootsmg.com/sitemap.xml",
    "https://rootsmg.com/council",
    "https://rootsmg.com/leadership",
    "https://rootsmg.com/management",
    "https://rootsmg.com/producers",
    "https://rootsmg.com/support",
    "https://rootsmg.com/crew",
    "https://rootsmg.com/members",
    "https://rootsmg.com/bios",
    "https://rootsmg.com/people",
    "https://rootsmg.com/artists",
    "https://rootsmg.com/musicians",
    "https://rootsmg.com/faculty",
    "https://rootsmg.com/administration",
    "https://rootsmg.com/meet-the-team",
    "https://rootsmg.com/about-us",
    "https://rootsmg.com/contact-us",
    "https://rootsmg.com/meet-the-team?hsLang=en",
    "https://www.facebook.com/RootsManagementGroup",
    "https://www.facebook.com/RootsManagementGroup/"
  ],
  "base_url": "https://rootsmg.com/communities/lakeside-village"
}