{
  "pages": [
    {
      "url": "https://www.rosevillaormondbeach.com/special-events/index",
      "is_candidate": false,
      "has_email": false,
      "text": "Plan An Event\nBook A\nPrivate Gathering\nSchedule your next corporate event or get together with friends. Whether it’s a birthday, anniversary, engagement party or any of life’s most moments, we can’t wait for you to let us help you make it memorable.\nYou can fill out the form below or call\n386-615-8793\nto plan an event.\nWe’ll do our best to accommodate seating requests! A representative will reach out to you withing the next 24 hours after form submission.\nEvent Form\nFirst Name\n(Required)\nEmail\n(Required)\nPhone\n(Required)\nComments\nSpace\n(Required)\nRomance Room (24 pers.)\nWhiskey at the Rose (10 pers.)\nRoosevelt Room (15 pers.)\nGazebo (20 pers.)\nLast Name\n(Required)\nType of Event\n(Required)\nCorporate Event\nAnniversary\nEngagement Party\nRehearsal Dinner\nWedding Reception\nBridal Lunch\nBaby Shower\nLuncheon\nCocktail Reception\nOther\nEvent Date\n(Required)\nMonth\nDay\nYear\nNumber of People\n(Required)\nUp to 15\n16-25\nArrival Time\n(Required)\nLunch\nDinner",
      "emails": []
    },
    {
      "url": "https://www.rosevillaormondbeach.com/about/index",
      "is_candidate": false,
      "has_email": false,
      "text": "About\nThe Rose Villa\nThrough The Years\nThe Rose Villa has been a staple in the Ormond Beach community since the late 1800s. For over 100 years, this building has lived many lives, witnessed a multitude of history-making events, and met a plethora of astounding people – with it all leading the Rose to the one-of-a-kind dining experience it is today.\nBed & Breakfast Beginnings\nBuilt in the late 1800’s, Rose Villa was established as a boutique hotel and bed and breakfast in 1901. A small exclusive adjunct to Henry Flagler’s Ormond Hotel, it accommodated important guests who preferred more privacy than the famous hotel afforded.\nMany noteworthy business and community leaders visited the Rose frequently. Today, you can explore the very rooms that visitors, like John D. Rockefeller, stayed in during their time in Ormond Beach.\nA Forgotten Jewel\nAfter thriving for many years, The Rose Villa slowly become a victim of neglect as the economy dictated its change to a more profitable use. Through the years, The Rose Villa has shuffled through many sets of hands.\nWith the property serving as a ticket station for the Flagler Railroad, as a few different hotels, and as a real estate office, The Rose Villa eventually began to suffer from its age.\nBrought Back To Life\nA new hope was restored for this Victorian jewel when it was purchased by Bill Jones in 2007. With an amazing vision, he transformed the original Rose Villa into the Ormond Beach treasure it is today.\nJones dedicated his efforts to resurrect the Rose Villa into an unforgettable restaurant surrounded by authentic surroundings and speckled with hidden treasures throughout this momentous building.\nThe Treasure Of Today\nToday, the Rose Villa serves as a tribute to the history of Ormond Beach and all those who have walked through its doors.\nPortraits of Ormond Beach’s most prominent history-makers are scattered throughout the rooms of the Rose in honor of all the great men whose lives and business ventures contributed to the former playground of the rich and famous, establishing our area as the place to be.\nThemed\nDining\nEvery dining area in The Rose Villa has a story to tell – a truly independent experience from the others. You haven’t experienced the full capacity of The Rose Villa until you’ve dined in every space!\nThe Roosevelt Room\nPlayfully named after one of John D. Rockefeller’s rumored enemies, the Teddy Roosevelt Room is our exceptional Media Room. Many portraits, items and themes relating to Teddy Roosevelt are displayed across the room with an esteemed attention-to-detail. When the space is not being used for presentations, private parties and gatherings, the Teddy Roosevelt Room makes for an exciting, intriguing space for your dining enjoyment.\nWhiskey at the Rose\nHave you ever wandered upstairs at the beautiful Rose Villa? That is where you’ll find Whiskey at the Rose. The Rose Villa’s Whiskey at the Rose is a quaint, warm and inviting speakeasy located upstairs offering a vast array of high-end Bourbons from certified bourbon steward, Vince, and light fares from Chef Sylvia. Whether you venture to the space after your meal in one of our dining rooms, or just stop by for a night cap, the Whiskey at the Rose is something you’ll have to experience for yourself. It’s a perfect place to slowly sip the amber liquid that is sought after by lovers of the best Bourbons. And the best is what you will find here.\nThe Front Porch\nSaturated in Southern charm, the front porch is a great place to enjoy the beauties of Ormond Beach coupled with the delights of the Rose Villa cuisine while the weather is nice. Enjoy drinks, dining and conversation al fresco during temperate months. Dogs welcome!\nThe Gazebo\nOpen for cocktails, lunch and dinner during the temperate months, the Gazebo of the Rose Villa is a beautiful outdoor dining space drenched in natural beauty from head to toe. With a relaxing fountain and abundant florals, the Gazebo and back porch seating is a great place to enjoy Rose Villa’s signature dishes. Dogs welcome!\nThe Gingerbread\nFantasy\nFrom November 2022 through January 2023, Rose Villa Southern Table and Bar will transform into Gingerbread Fantasy, a brilliant and unique light display. Visitors can stop to take a family photo or a fun selfie outside of or in this historic setting in Ormond Beach, Florida.\nAn Immersive Experience\nGingerbread Fantasy is more than just a holiday light display. The grounds and restaurant will be decorated with larger- than-life Gingerbread men, towering lollipops, unique topiary snowmen (and snowwomen), the “dogs of Rose Villa,” stain glass windows reflecting gingerbread men, gold bells, candy canes and candied fruit, and of course, hundreds of colorful lights, reaching from the ground to the top of the two and a half story rooftop. The sparkling holiday display will also feature a nod to the area’s rich racing history with a replica of Sir Malcom Campbell’s land speed record breaking Blue Bird. Today the original Blue Bird is in the Motorsports Hall of Fame at Daytona International Speedway.\nThe Lights, The Lollipops & The Like\nWhat’s a celebration without candy? A fun feature of Gingerbread Fantasy will be the towering lollipops. Each 3-dimensional lollipop will be colorful and clearly wrapped. Want to know a secret? The “lollipops” are actually colorful foam pool noodles, coiled into the fun round shape of a lollipop.\nCandied fruits will shine in artful stained-glass windows. A plethora of colored lights will stretch from the ground to the roofline. The lights will be strung along the fence line, up the stairway, along the porch railings, and will swing from every wall and the dormer style rooftop. A Gingerbread Man and Woman topiary will be front and center standing tall.\nThe Pets of Rose Villa\nRose Villa is pet friendly. So, when it came time to select the features of the holiday décor, the owners included some of the staff’s pups.\nCall to Book: (386) 615-7673\nKnow Before\nYou Visit\nAs unique as The Rose Villa is, we are committed to providing a comfortable, casual experience saturated in Southern hospitality. If you have questions, please explore our FAQs or give us a call and we will be happy to help!\nIs There A Dress Code?\nAt Rose Villa, you can come as you are! Whether you wish to wear your finest suit or your shorts and flip flops, there is no particular dress code, and our guests often wear anything from semi-formal to everyday casual. We invite all our guests to enjoy a relaxed yet exquisite dining experience, and to wear what you’re comfortable doing just that in.\nDo I Have To Make Reservations?\nWhile you do not have to make a reservation to dine with us, reservations are highly recommended. Due to the layout of our dining rooms, there is typically some strategizing needed to ensure that we are able to seat everyone in the restaurant comfortably. When you make a reservation, we are able to ensure that you are seated timely and comfortably.\nNo reservation? No problem! We would still love the opportunity to serve you.\nDo You Really Have A Speakeasy?\nRumor has it there is a secret door within the Rose Villa where guests can access our speakeasy. If legends are true, our Upstairs absinthe & dessert bar is the perfect place to enjoy evenings, late nights and after-dinner drinks, delicious desserts and light fare. Come see if the rumors are true for yourself – just ask your server!\nCan I Hold My Next Event At The Rose Villa?\nAbsolutely! We are well-versed in hosting a variety of parties, meeting and gatherings. Our variety of room options give you a unique experience to choose your adventure. Our media room – more affectionately known as the Teddy Roosevelt Room – is even equipped with large monitor for presentations, dinner meetings and private parties.\nContact us today to book your next event at one of the most signature sights in Ormond Beach.\nJust click here to plan your event with us!",
      "emails": []
    },
    {
      "url": "https://www.facebook.com/RoseVillaRestaurant/",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    }
  ],
  "all_links": [
    "https://www.rosevillaormondbeach.com/Comfy-Southern-Food--Dishes-That-Bring-Back-Memories---Warm-the-Soul-1-16189.html",
    "https://www.rosevillaormondbeach.com/contact/index",
    "https://www.rosevillaormondbeach.com/gallery/index",
    "https://www.rosevillaormondbeach.com/",
    "https://www.rosevillaormondbeach.com/menu/index",
    "https://www.rosevillaormondbeach.com/whiskey-at-the-rose",
    "https://www.rosevillaormondbeach.com/vip-club/index",
    "https://www.rosevillaormondbeach.com/about/index#people",
    "https://www.rosevillaormondbeach.com/The-Rose-Villa-s-Historic-Spirit--Preserving-Heritage-in-a-Modern-World-1-16914.html",
    "https://www.rosevillaormondbeach.com/z/user/privacy/index",
    "https://www.rosevillaormondbeach.com/News-3-3.html",
    "https://www.rosevillaormondbeach.com/reservations/index",
    "https://www.rosevillaormondbeach.com/special-events/index",
    "https://www.rosevillaormondbeach.com/about/index"
  ],
  "candidate_links": [
    "https://www.rosevillaormondbeach.com/special-events/index",
    "https://www.rosevillaormondbeach.com/about/index",
    "https://www.facebook.com/RoseVillaRestaurant/"
  ],
  "visited": [
    "https://www.rosevillaormondbeach.com/",
    "https://www.rosevillaormondbeach.com/about",
    "https://www.rosevillaormondbeach.com/contact",
    "https://www.rosevillaormondbeach.com/staff",
    "https://www.rosevillaormondbeach.com/team",
    "https://www.rosevillaormondbeach.com/board",
    "https://www.rosevillaormondbeach.com/directory",
    "https://www.rosevillaormondbeach.com/events",
    "https://www.rosevillaormondbeach.com/sitemap.xml",
    "https://www.rosevillaormondbeach.com/council",
    "https://www.rosevillaormondbeach.com/leadership",
    "https://www.rosevillaormondbeach.com/management",
    "https://www.rosevillaormondbeach.com/producers",
    "https://www.rosevillaormondbeach.com/support",
    "https://www.rosevillaormondbeach.com/crew",
    "https://www.rosevillaormondbeach.com/members",
    "https://www.rosevillaormondbeach.com/bios",
    "https://www.rosevillaormondbeach.com/people",
    "https://www.rosevillaormondbeach.com/artists",
    "https://www.rosevillaormondbeach.com/musicians",
    "https://www.rosevillaormondbeach.com/faculty",
    "https://www.rosevillaormondbeach.com/administration",
    "https://www.rosevillaormondbeach.com/special-events/index",
    "https://www.rosevillaormondbeach.com/about/index",
    "https://www.facebook.com/RoseVillaRestaurant/"
  ],
  "base_url": "https://www.rosevillaormondbeach.com/"
}