{
  "pages": [
    {
      "url": "https://www.royalamerican.com/about#our-team",
      "is_candidate": false,
      "has_email": false,
      "text": "ABOUT\nUS\nDELIVERING HIGH QUALITY SERVICE\nAbout Us\nOur Story\nOur Team\nCommunity Service\nACE\nEmployment Opportunities\nAffiliated Companies\nRoyal American Companies\nOUR STORY\nEveryone wants a place to call home. This basic need is the foundation for Royal American Companies, a vertically integrated family of real estate companies specializing in the development, construction and management of multifamily communities.\nA firm belief you “help who you can” has driven over 50 years of advocacy and innovation in building, maintaining and serving multifamily communities and the people who call them home.  With experts in every field organized to work seamlessly together, Royal American takes an innovative approach to challenges and ensures a consistent standard of excellence for the complete life-cycle of developing, building and managing multifamily communities.\nLearn More\nPromoting Teamwork & Innovation\nMEET OUR TEAM\nWith experts in every field and organized to work seamlessly together, the depth of knowledge our team members bring to the table enables Royal American to take an innovative and integrated approach to challenges and ensure a consistent standard of excellence for the complete life-cycle of developing, building and managing multifamily communities.\nKerri Toth\nPresident CPM ®\nRead Bio\nScott Clemo\nExecutive CPM ®, Corporate Broker, Vice President Commercial Division\nRead Bio\nKimberly Maggard\nExecutive Vice President\nRead Bio\nJim Boyd\nVice President of Development & General Counsel\nSteve Summerbell\nVice President of Construction, Containers &  Southern Coastal Homes\nJohn Lewis\nVice President of Development\nMissy Dugas\nSenior Vice President of Operations\nRead Bio\nJudy Williams\nSenior Vice President of Support Services\nRead Bio\nMarilyn Urroz\nRegional Vice President\nRead Bio\nJeanne Hatten\nRegional Vice President\nRead Bio\nMelissa Nichols\nRegional Vice President\nRead Bio\nMichelle Campbell\nRegional Vice President\nRead Bio\nVeronica Ramsey\nVice President of Compliance\nRead Bio\nMike Correll\nVice President of Information Technology\nRead Bio\nShannon Scribner\nController\nRead Bio\nDave Kennedy\nVice President of Maintenance\nRead Bio\nTonya Ward\nVice President of OneSite Support\nRead Bio\nJennifer Anderson\nVice President of Human Resources\nRead Bio\nSonya Knight\nDirector of Resident Services\nRead Bio\nSusan Haselden\nDirector of Contracting\nRead Bio\nLori Agudo\nDirector of Training & Talent Development\nRead Bio\nRose Clemo\nDirector of Marketing\nRead Bio\nWhitney Brock\nDirector of Risk Management\nRead Bio\nBritany Ost\nClient Relations Manager\nRead Bio\nView More\nKerri Toth\nPresident CPM ®\nSince 2008, Ms. Toth has served as president of Royal American Management (RAM). She began her journey with RAM in 1997 as a regional manager. Ms. Toth is responsible for all aspects of company operations. She also oversees IT, HR and Risk Management for all Royal American Companies. \r\n\r\nMs. Toth has been in the property management industry since 1993 and has extensive experience in marketing and management of stabilized and new construction properties as well as those in the rehab process.\r\n\r\nShe graduated Magna Cum Laude from Peirce College with a degree in Business Administration with a concentration in Real Estate Management. Ms. Toth is a Certified Property Manager (CPM) designated through the Institute of Real Estate Management (IREM) and holds an active Florida Real Estate Salesperson License. \r\n\r\nMs. Toth served as Past President and was a board member for 10+ years for IREM North Florida Chapter, and past board member of the National Housing & Rehabilitation Association (NH & RA.)\nScott Clemo\nExecutive CPM ®, Corporate Broker, Vice President Commercial Division\nAs Corporate Broker for all affiliated Royal American Companies, Mr. Clemo is the licensed individual facilitating all third-party management and brokerage activities.  \r\n\r\nAs Vice President of RAM’s Commercial Division, Mr. Clemo oversees acquisition, development, construction and management of all commercial properties.  The Commercial Division portfolio includes office, retail, condominium and hospitality properties in Northwest Florida.  He also oversees telecom revenue opportunities at market-rate multifamily properties.\r\n\r\nMr. Clemo holds the prestigious Executive CPM® designation for Royal American Management, Inc.  It is the highest designation achievable through the Institute of Real Estate Management (IREM) allowing RAM to become an Accredited Management Organization (AMO®).  He also currently maintains Real Estate Broker Licenses in 14 states throughout the Southeast and Midwest.  \r\n\r\nHe graduated from the University of Florida with a Bachelor of Science degree in Sports Management.\nKimberly Maggard\nExecutive Vice President\nAs the Executive Vice President of Royal American Management, Kimberly Maggard is entrusted with the responsibility of shaping the overarching strategy, steering operational efficiencies, and fortifying the profitability of our organization. With a tenure spanning over 34 years in property management, she brings a wealth of experience and expertise to the helm.\nMrs. Maggard’s journey in property management is underpinned by a robust foundation of professional designations, including the esteemed Certified Property Manager (CPM) accreditation conferred by the Institute of Real Estate Management (IREM). Additionally, she holds the title of Certified Apartment Portfolio Supervisor (CAPS) from the National Apartment Association (NAA), and the designation of Certified Professional of Occupancy (CPO) from the National Affordable Housing Management Association (NAHMA). Complementing these accolades, Kimberly is a licensed Real Estate Sales Associate in the state of Florida and earned a Bachelor of Science Degree in Business Administration from Florida Atlantic University.\nMrs. Maggard is privileged to serve as President for the philanthropic arm of AAGO's Foundation. She has also had the honor of serving as President for both the Apartment Association of Greater Orlando (AAGO) and the Florida Apartment Association (FAA), demonstrating her dedication to advancing the interests of our industry at both regional and state levels. Furthermore, her involvement in various committees and advisory boards within the National Apartment Association (NAA) underscores her commitment to shaping industry standards and best practices.\nDenise Ost\nExecutive Vice President\nMs. Ost is responsible for the oversight of all aspects of property management operations for the RAM Portfolio of multifamily communities located throughout the Southeastern United States, Missouri, Texas, and the US Virgin Islands as well as all of the RAM support staff; Maintenance, Contracting, Resident Accounting, and Compliance.  She is headquartered in the Panama City Corporate Office and is ultimately responsible for the supervision of all RAM operational staff to include: Support Department staff, Senior VP of operations, Regional VPs, Regional Managers, Area Managers, and all on-site staff. \r\n\r\nMs. Ost has extensive experience in all supervisory levels of multifamily property management for both luxury and affordable housing.  She began employment with RAM in 1979 and has since served in the positions of Site Manager, Regional Manager, Regional VP, Division VP, Vice President of Operations, and Senior VP of Operations.\nJim Boyd\nVice President of Development & General Counsel\nSteve Summerbell\nVice President of Construction, Containers &  Southern Coastal Homes\nJohn Lewis\nVice President of Development\nMissy Dugas\nSenior Vice President of Operations\nMissy Dugas has been a vital part of Royal American Management since 2009, currently serving as the Senior Vice President of Operations. In this role, she leads all facets of property management, overseeing more than 300 assets and 23,000 units, and serves over 50,000 residents. Her comprehensive oversight includes third-party managed and company-owned communities, encompassing conventional, affordable, senior/active adult, special needs, and permanent supportive housing.\nBased in Royal American’s Orlando Corporate Office, Missy brings nearly 30 years of extensive experience in the multi-family housing industry. Her career journey has provided her with valuable expertise in managing diverse property types, including conventional, student housing, and affordable communities, property rehabs, and new construction lease-ups.\nShe is an active member of the National Apartment Association, participates in multiple local and state affiliates, and non-profit organizations serving multiple boards and committees. Demonstrating her commitment to professional development and leadership, she is set to serve as the 2025 President for the Apartment Association of Greater Orlando.\nHer responsibilities at Royal American Management include overseeing operational performance, strategic planning for company growth, and leadership development for the operations team. She is a key member of Royal American’s Executive Committee, Safety Committee, Communications and Data Committee, and the Disaster Response Task Force.\nMissy holds several esteemed industry certifications, including Certified Apartment Manager (CAM) and Certified Apartment Property Supervisor (CAPS) through the National Apartment Association, Certified Professional of Occupancy (CPO) from the National Affordable Housing Management Association, and she is a Certified Property Manager (CPM®) Candidate with the Institute of Real Estate Management.\nJudy Williams\nSenior Vice President of Support Services\nMrs. Williams is an industry veteran with a career spanning over two decades at Royal American, a prominent player in the multi-family management sector. In her role as Senior Vice President of Support Services, she oversees a diverse portfolio of critical departments, including Maintenance, Training, Real Page Systems Support, Affordable Compliance Programs, and Marketing, along with Vendor Credentialing and Contracting.\nWith a wealth of experience and deep understanding of resident and client’s needs, her relentless pursuit of excellence has set a benchmark for service excellence within our company. She plays a pivotal role in providing unparalleled support services and nurtures strong relationships with our customers and partners.\nJudy has earned a Certified Apartment Portfolio Supervisor (CAPS) from the National Apartment Association and is a Certified Property Manager Candidate (CPM®) through the Institute of Real Estate Management. She continues to stay informed about industry advancements through ongoing professional development and participates in relevant conferences and forums.\nMarilyn Urroz\nRegional Vice President\nAs Regional VP of Operations, Ms. Urroz is responsible for overseeing all facets of property management operations for the South Florida Region of the Royal American Management Portfolio. She is based in the RAM Miami Regional Corporate Office. \r\n\r\nWith over 15 years of experience in the property management industry, Ms. Urroz has extensive knowledge of Tax Credit, Conventional, and HUD family and senior communities. She has successfully leased up new construction communities and rehab projects.\r\n\r\nMs. Urroz has worked closely with multiple nonprofit organizations to oversee and manage communities that provide quality housing for individuals taking the next step out of homelessness. \r\n\r\nShe began employment with RAM as a Community Manager in 2010 and as she continued her professional growth and increased her leadership skills, she moved up through the company ranks, and was promoted to Regional Vice President of Operations in 2019.\r\n\r\nMs. Urroz holds the following designations: Certified Apartment Property Supervisor (CAPS), and Certified Occupancy Specialist (COS). She is also fluent in English and Spanish.\nJeanne Hatten\nRegional Vice President\nMs. Hatten is responsible for overseeing all facets of property management operations for a portfolio of RAM managed properties located in Alabama, Georgia, North Carolina, South Carolina, Tennessee, Texas and Jacksonville, FL. Regional Managers under her supervision are in the Atlanta, GA and Jacksonville, FL offices. \r\n\r\nMs. Hatten has fourteen plus years' experience in the multifamily housing property management industry to include the management of Tax Credit, Conventional, HUD, Senior Living as well as New Construction lease up and rehabs. \r\n\r\nShe began her multifamily industry career in the North Georgia Mountains in 2005 as a leasing consultant, and advanced in her property management career quickly, coming to Royal American in 2016 as a Regional Manager. Ms. Hatten holds the designation of Certified Apartment Property Supervisor (CAPS.)\nMelissa Nichols\nRegional Vice President\nAs a Regional VP of Operations, Ms. Nichols is responsible for overseeing all facets of property management operations for a portfolio of RAM managed properties located in Alabama and North Florida. She is based in the RAM Panama City Corporate Office.\nMs. Nichols began her career in property management in 1999 and has over 25 years of experience in the industry. She came to Royal American in 2008 and has worked in various positions within the company over the years. She has extensive knowledge managing Conventional, Student Housing, Tax Credit, HUD, RD, senior communities, rehabs, and lease ups of new construction. Ms. Nichols holds the designation of Certified Apartment Property Supervisor (CAPS).\nMichelle Campbell\nRegional Vice President\nAs Regional Vice President, Ms. Campbell is responsible for overseeing all facets of property management operations for the US VI, Northern Florida and Central Florida Regions of the RAM Portfolio. She is based in the RAM Orlando, Florida Regional Office.\nMs. Campbell started her career in property management in 1993 and is a seasoned leader with over 31 years of experience in the Multi-Family Industry. From her early days to her current position, Michelle has held various key roles at both site and corporate VP levels, enriching her perspective and honing her leadership skills. She is well-versed in navigating the intricacies of Conventional, Tax Credit, HUD, and Senior Living properties, as well as overseeing new construction projects. Throughout her career, Michelle has demonstrated adeptness in managing assets through different market conditions, including lease-ups, re-positioning initiatives, and the management of distressed and stabilized communities. Ms. Campbell holds the designation of Certified Apartment Portfolio Supervisor (CAPS).\nVeronica Ramsey\nVice President of Compliance\nVeronica is responsible for compliance, reporting, and affordable training requirements for all properties in the RAM portfolio.\r\n\r\n She ensures all compliance requirements are met at the local, state, and federal levels for HUD, RD, and Housing Credit communities, as well as communities with layered funding. With over 20 years of experience in the real estate and multifamily industry, Ms. Ramsey brings a wealth of expertise.  She has experience in multiple leadership roles within the affordable housing industry.  \r\n\r\nShe served as a Director of Housing, overseeing construction/rehab development, operations, and compliance, oversaw the compliance department for one of the largest national affordable property management companies, as a Regional Manager for a national property management company, and as Compliance Manager with Kentucky Housing Cooperation, auditing and training for multiple funding sources including but not limited to LIHTC, HOME, Trust Fund, Section 8. Ms. Ramsey is a member of NAHMA, SAHMA, and NAHB. \r\n\r\nShe holds numerous industry certifications including Housing Credit Certified Professional (HCCP), Tax Credit Specialist (TCS), Certified Occupancy Specialist (COS), Certified Professional of Occupancy (CPO), Fair Housing Compliance (FHC), Housing Quality Standards (HQS) certifications and is a CPM Candidate.  She has also served as Kentucky’s State Meeting Coordinator for SAHMA.\nMike Correll\nVice President of Information Technology\nMr. Correll is responsible for all facets of Royal American Companies information systems. He handles everything from identifying and developing future technology needs, to recommending implementation strategies and priorities, and overseeing projects that will best achieve the organization’s strategic IT objective. His department supports everything IT related including computers, printers, servers, mobile devices, wireless and wired networking and telephony just to name a few. With policies, procedures and other guidelines in place the IT department strives to provide excellent support in a timely manner.  \r\n\r\nMr. Correll has been working in the information technology field, for over 25 years, most of which has been in a managerial role. He started working for Royal American in 2011.\r\n\r\nMike has an A.S from Gulf Coast State College and holds numerous certifications including CompTIA Cloud+ Certification, CompTIA Security+ Certification, CompTIA Network+ Certification, CompTIA A+ Certification and multiple FEMA NIMS Certificates.\nShannon Scribner\nController\nMs. Scribner joined Royal American Companies (RA) in 2022 as a Senior Accountant – Special Projects, where she began streamlining processes, boosting department morale, strategizing for future growth, and overseeing the transition of internal software. In March 2024, she assumed the role of Controller for Royal American Companies, taking charge of all aspects of the Accounting Division, including apartment and corporate accounting functions. With direct supervision of four department managers and management of a staff of 32, including accounts payable, payroll, and general ledger accounting, she ensures efficient operations.\nBefore joining Royal American, Shannon held roles as the Director of Budget Management & Administration for a local municipality and as the Chief Financial Officer for a Start-Up Company. With over 21 years of progressive experience in accounting and business management, she brings a wealth of expertise to her current position.\nShannon pursued her college education online while balancing full-time work in the business field and raising her children. Shannon holds a Master of Science in Accountancy from the University of Phoenix.\nDave Kennedy\nVice President of Maintenance\nAs Vice President of Maintenance, Mr. Kennedy is responsible for the oversight of all maintenance related items for all Royal American managed communities. He also oversees all safety and maintenance related training programs and works with the Safety Committee to prepare and oversee the company safety manual and hurricane preparation and procedures.\r\n\r\nMr. Kennedy identifies and assesses maintenance issues, coordinates and plans for their remediation with the maintenance and community staff. He is a member of the “property transition team” and evaluates/trains maintenance personnel on site and identifies any major physical needs of the property when RAM assumes management of a new community.\r\n\r\nMr. Kennedy joined the Royal American family in 2002. He has over 25 years of experience in the industry working on negotiations, capital needs assessments, implementing preventative maintenance programs and training service technicians.  \r\n\r\nHe holds a Pool & Spa Operator Certification (CPO), Environmental Protection Agency Certification (EPA) and Certificate for Apartment Maintenance Technicians (CAM-T).\nTonya Ward\nVice President of OneSite Support\nMs. Ward is responsible for the functionality, support, and procedures relating to RealPage/OneSite software at all RAM-managed properties and for the implementation of the software at all new sites entering the RAM Portfolio. She is responsible for the implementation of new OneSite software features and product upgrades and for monitoring existing procedures to ensure the maximum efficient use of all software capabilities. Tonya and her staff provide training and ongoing one-on-one support to site staff as necessary. Any issues are quickly remedied. RAM uses the following RealPage OneSite products: Leasing and Rents, Document Management, Facilities, RealPage Accounting, and all three affordable compliance products.\r\n\r\nTonya began her career with Royal American in 2000 and has 23 years of experience in multifamily housing. Previously, Tonya served as the AVP of Accounting for Royal American where she oversaw the Accounts Payable department for over 15 years.\nJennifer Anderson\nVice President of Human Resources\nMs. Anderson is responsible for the leadership and management of the Royal American Companies Human Resources department. Her Human Resource responsibilities include healthcare benefits and compliance, retirement savings plans, compensation, employee relations, employee policy and procedures, performance management, learning and development and recruitment. She holds the PHR (Professional in Human Resources) Certification. \r\n\r\nMs. Anderson joined the Royal American family in 2003 and has over 20 years of Human Resource experience. She worked in the Payroll Department for 3 years before transferring to the Human Resources department as an HR Assistant. She attended Joliet Junior College in Illinois.\nSonya Knight\nDirector of Resident Services\nSonya Knight serves as the Director of Resident Services at Royal American Management (RAM), where she has made significant contributions since joining the Resident Services Division in 1996. Sonya leads a team dedicated to assisting property owners in the development and reporting of tenant programs to ensure compliance with state housing agencies. With a Professional Service Coordinator designation, Sonya is well equipped to assist property owners with developing programming for special needs and senior communities. Sonya is also instrumental in forging partnerships with referral agencies to facilitate housing for low-income individuals with special needs and is responsible for overseeing Special Needs training for site staff.\nIn addition, Sonya leverages her DE&I certification to chair RAM’s Advancement, Culture & Engagement (ACE) Committee. Under her leadership, the ACE Committee is dedicated to fostering fairness and equal access both within RAM and within the communities it serves. ACE has been instrumental in initiating programs such as Rising Apartment Management Professionals (RAMP)--a tuition-free property management training program for residents, and a professional mentoring program to aid RAM employees' career advancement.\nSusan Haselden\nDirector of Contracting\nMs. Haselden is responsible for supervising the contract administrators in the procurement of services and repairs including writing scopes of work for all RAM-managed properties.   She also negotiates pricing for National Account Agreements and oversees the monitoring of all supplier and contractor compliance with licensing and insurance requirements while performing work on the properties.  \r\n\r\nMs. Haselden began working for RAM in 2009 as a Service Contract Administrator and has served in the positions of Contract Specialist and Contract Manager. She was promoted to RAM’s Director of Contracting after receiving her Master’s Certificate in Contract Management (CCM) from George Washington University School of Business.\nLori Agudo\nDirector of Training & Talent Development\nMs. Agudo, Director of Training & Talent Development at Royal American Management, brings over 17 years of multifamily industry experience and seven years as an industry educator. She oversees training programs for employees and serves on various industry committees, including AAGO and SCAA boards. Her contributions include roles such as Treasurer of the AAGO Foundation and Vice President of the SCAA Board of Directors. Ms. Agudo is also a delegate on the FAA Board of Directors and a member of NAA's RPM Careers Committee. She holds a CAM designation, pursues an ARM certification through IREM, and recently earned an Instructional Design Certification from the Association for Talent Development, showcasing her dedication to professional development and education within the industry.\nRose Clemo\nDirector of Marketing\nAs Director of Marketing, Ms. Clemo spearheads all aspects of marketing and branding for Royal American Companies. With a strategic vision and collaborative spirit, she leads a team of marketing professionals in developing and implementing innovative initiatives across existing and new properties within the RAM portfolio. Her other responsibilities include overseeing social media and reputation management, all marketing communications, marketing campaigns, and ongoing brand management for a portfolio of over 300 multifamily properties.\nMs. Clemo began her career with RAM in 2014 as Marketing and Graphic Developer, and soon became Creative Director before her promotion to Director of Marketing for Royal American Companies in March of 2023. With over 10 years of experience, Ms. Clemo has extensive knowledge of marketing multifamily properties.\nShe graduated from Florida State University and holds a bachelor’s degree in Marketing and Hospitality Management.\nWhitney Brock\nDirector of Risk Management\nWhitney Brock brings a wealth of experience and a strategic approach to her role as Director of Risk Management for Royal American. Since joining the team in 2010, Whitney has steadily progressed through the ranks, starting as a temporary employee, and demonstrating her dedication through promotions to Assistant, Senior Specialist, and now Director.\nIn her current role, Whitney spearheads the identification, mitigation, and management of property and casualty exposures across the entire Royal American portfolio. This includes overseeing claims coordination for general liability, property damage, employment practices, fidelity, and business auto insurance.\nWhitney's focus extends beyond insurance. She plays a vital role in ensuring fair housing compliance by reviewing and providing guidance on incident reports, reasonable accommodation requests, and everyday risk concerns. Her expertise is further leveraged when assisting with litigated claims.\r\nCommitted to professional development, Whitney holds her Fair Housing Coordinator designation and is actively pursuing her Risk Management Associates (RMA) designation.\nBritany Ost\nClient Relations Manager\nAs manager of Client Relations, Mrs. Ost oversees all new business development for RAM. Her and her team work to build, maintain and strengthen RAM relationships with their clients and potential clients. Working start to finish to onboard assets and maintain a portfolio of over 300 multifamily properties. She works with our clients to build strategies to overcome any challenges their asset may face, to better understand what goals our clients aim to accomplish and demonstrate how RAM and its products and services can help them meet these objectives that will benefit their assets. \r\n\r\n\r\nMrs. Ost began her career with RAM in 2011 as an Assistant Community Manager. Soon after she was promoted to Office Manager for the corporate headquarters and Executive Assistant to the President of RAM. Mrs. Ost held this position for 11 years, in 2023 she was promoted to Client Relations Manager.\nIsabel Kelemina-Mudd\nMelanie TEST\nJulian LeaseLabs\nGiving Back\nCOMMUNITY SERVICE\nOne of the driving principles of Royal American is the importance of community service. We advocate for important local causes in the communities we are a part of and empower employees to share their time, talent and passion with causes that improve the lives of those who live in them.\nSome of our favorite causes:\nHatching Hope\nASAP Panama City\nEXCEEDING\nEXPECTATIONS\nSETTING THE BAR HIGHER\nOur Values\nADVANCEMENT, CULTURE\n& ENGAGEMENT\nRoyal American prioritizes a thriving and supportive work environment for our team's success and happiness. We also recognize the positive influence we can have on the communities we serve. These values come to life through our Advancement, Culture & Engagement (ACE) initiative. This program, with its ACE at Work and ACE in the Community arms, fosters a culture where everyone feels valued, empowered, and connected.\nLearn More\nEmployment Opportunities\nGROW WITH US\nThe Royal American family of companies shares a culture built around collaboration and contribution to the wider community.  Our team shares a culture of passion and determination, respect and trust that fosters ingenuity and innovation, an approach we take within our companies as well as with our partners and clients.\nJoin Our Team\nJoin the Family\nAFFILIATED COMPANIES\nHOSPITALITY\nRoyal American Hospitality includes a full network of brands that deliver a seamless vacation experience to guests and profit-building opportunities to each affiliated company. From a convention space and lodging accommodations, to family entertainment, water sports, and more. Check out all we have to offer.\nroyalamericanhospitality.com\nINSURANCE\nPeoples First Insurance Services\n, headquartered in Panama City, Florida is the area’s largest independent insurance, bonding and risk management provider. With over 100 years in business, they deliver years of expertise covering a broad range of services for both commercial and personal insurance lines.\nLANDSCAPING\nSoutheastern Outdoor Management\nis a landscape and irrigation, design/build, and maintenance business that specialize in commercial and residential installation.\nRECREATION\nNature Walk Golf Club\nis a hidden gem tucked away in Lynn Haven, Florida. The 9-hole course is enjoyable for seasoned golfers and eager beginners alike. They offer a top-notch driving range, an accommodating clubhouse with café, and a pro-store on-site.\nDUMPSTER AND CONTAINER RENTALS\nRAC Disposal Services offers roll-off dumpsters & containers in various sizes and affordable prices across the Florida Panhandle.\nracdisposalservices.com\nHOME BUILDER\nBuilding high-quality, semi-custom homes in North Florida that appeal to families, empty-nesters, and seniors at an affordable price.\nSouthern Coastal Homes\nprimary focus is to enhance neighborhood values and build long-lasting value for present and future owners.\nRoyal American Companies\nOur Affiliates\nRoyal American Hospitality\nRAC Disposal Services\nPeoples First Insurance\nNature Walk Golf Course\nSoutheastern Outdoor Management Inc.\nSouthern Coastal Homes",
      "emails": []
    },
    {
      "url": "https://www.royalamerican.com/construction#construction-about-us",
      "is_candidate": false,
      "has_email": false,
      "text": "CONSTRUCTION\nSHAPING COMMUNITY\nConstruction\nAbout Us\nServices\nProjects\nRoyal American Construction\nABOUT US\nRoyal American Construction has over fifty years of experience building multifamily/mixed-use communities and commercial developments, including more than 140 multifamily communities, several large-scale developments, hotel facilities and commercial projects. With an unwavering commitment to innovation and efficiency, Royal American Construction makes sure every project adheres to the highest standards of sustainable processes and protocols and all phases of work are completed on time and within budget.\nLearn More\nWork with the Best\nOUR SERVICES\nMultifamily residential developments\nTraditional water, sewer/storm and infrastructure projects\nMaritime Construction/Pile Driving\nCommercial Developments\nMultifamily Demolition\nINNOVATION &\nINTEGRITY\nINGENUITY AT IT'S FINEST\nOur Projects\nProjects Being Bid\nProjects Completed\nProjects in Progress\nAida Palms\nLakeland, FL\n96 Units\nLIHTC Family Apartment Community\nRead More\nAida Palms\nLakeland, FL\n96 Units\nLIHTC Family Apartment Community\nBurlington Place\nSt. Petersburg, FL\n53 Units\nLIHTC Family Apartment Community\nRead More\nBurlington Place\nSt. Petersburg, FL\n53 Units\nLIHTC Family Apartment Community\nBurlington Post\nSt. Petersburg, FL\n86 Units\nLIHTC Senior Apartment Community\nRead More\nBurlington Post\nSt. Petersburg, FL\n86 Units\nLIHTC Senior Apartment Community\nClearlake Isles\nCocoa, FL\n84 Units\nLIHTC Senior Apartment Community\nRead More\nClearlake Isles\nCocoa, FL\n84 Units\nLIHTC Senior Apartment Community\nGateway of St. Joe\nPort St Joe, FL\n50 Units\nLIHTC Family Apartment Community\nRead More\nGateway of St. Joe\nPort St Joe, FL\n50 Units\nLIHTC Family Apartment Community\nPelican Pointe\nPanama City Beach, FL\n78 Units\nLIHTC Family Apartment Community\nRead More\nPelican Pointe\nPanama City Beach, FL\n78 Units\nLIHTC Family Apartment Community\nSan Juan\nKissimmee, FL\n112 Units\nLIHTC Senior Apartment Community\nRead More\nSan Juan\nKissimmee, FL\n112 Units\nLIHTC Senior Apartment Community\nTGI Fridays\nPanama City, FL\nReimage Project\nRead More\nTGI Fridays\nPanama City, FL\nReimage Project\nForest Ridge\nHernando, FL\n119 units\nLIHTC Senior Apartment \r\nCommunity\nRead More\nForest Ridge\nHernando, FL\n119 units\nLIHTC Senior Apartment \r\nCommunity\nHave a project?\nWORK WITH US\nDo you have an upcoming project? We would love to learn more. Here’s how you can reach our team.\nContact",
      "emails": []
    },
    {
      "url": "https://www.royalamerican.com/contact",
      "is_candidate": false,
      "has_email": false,
      "text": "CONTACT\nGET IN TOUCH WITH US\nCulture of Communication\nBegins Here\nFeel free to contact us by phone or send us a note using the form below. We look forward to hearing from you.\nROYAL\nAMERICAN\nMORE THAN JUST A MANAGEMENT COMPANY\nQuestions? Comments?\nGet In Touch\nJoin Our Team\nFill out my\nonline form\n.\nOffice Locations\nRoyal American\n1022 W. 23rd Street Ste. 300\nPanama City\n,\nFL\n32405\nCorporate Headquarters\n1022 W. 23rd Street, Ste. 300\nPanama City, FL 32405\n(850) 769-8981 TDD 711\n(800) 965-8981 TDD 711\nAtlanta Regional Office\n2726 South Main Street, Ste. 2000\nKennesaw, GA 30144\n(678) 398-7833\nOrlando Regional Office\n600 E. Colonial Dr. Ste. 320\nOrlando, FL 32803\n(407) 540-1477\n(407) 540-3798 FAX\nMiami Regional Office\n7871 NE 2\nnd\nAvenue\nMiami, FL, 33138\n(305) 477-9545\n(305) 477-9843 FAX",
      "emails": []
    },
    {
      "url": "https://www.royalamerican.com/properties/century-woods-century-fl/contact",
      "is_candidate": false,
      "has_email": true,
      "text": "Our\nCommunities\nCentury Woods\nGet in touch\nContact\nName\nPlease enter your name...\nEmail\nPlease enter a valid email address...\nPhone\nPlease enter a valid phone number...\nMove In Date\n2025\n2026\n2027\n2028\n2029\n2030\nJan\nFeb\nMar\nApr\nMay\nJun\nJul\nAug\nSep\nOct\nNov\nDec\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\nMessage\nCaptcha\nCentury Woods\naddress\n20 West Highway 4\nCentury,  FL 32535\nphone number\n(850) 256-5361\nhours\nMon-Fri: 8:00 AM - 5:00 PM\nemail address\ncenturywoods@royalamerican.com",
      "emails": [
        "centurywoods@royalamerican.com"
      ]
    },
    {
      "url": "https://www.royalamerican.com/development#development-about-us",
      "is_candidate": false,
      "has_email": false,
      "text": "DEVELOPMENT\nCREATING COMMUNITY\nDevelopment\nAbout Us\nServices\nProjects\nRoyal American Development\nABOUT US\nRoyal American Development offers unparalleled experience in the complex process of developing multifamily communities.  A pioneer of affordable housing, Royal American Development’s commitment to innovative strategies and solutions continues to set the standard in this highly competitive industry. A fully integrated platform provides Royal American Development with the resources and experience needed to construct the most effective team for each phase of development and ensures a comprehensive approach for the life cycle of the project.\nLearn More\nBuilding Confidence & Value\nOUR SERVICES\nMarket identification and research\nLand acquisition & permitting\nEngineering\nIdentification and execution of federal and state government assistance programs and grants\nArchitectural designs and construction\nDeveloping comprehensive feasibility studies\nBuilding partnerships to connect project to broader community systems\nUNIQUE\nEXPERIENCES\nCUTTING EDGE DEVELOPMENT\nOur Projects\nCurrent Projects\nHilltop Pointe\nLynn Haven, FL\n50 Units\nLIHTC Family Apartment Community\nRead More\nHilltop Pointe\nLynn Haven, FL\n50 Units\nLIHTC Family Apartment Community\nSuwanee Pointe\nLive Oak, FL\n36 Units\nLIHTC Family Apartment Community\nRead More\nSuwanee Pointe\nLive Oak, FL\n36 Units\nLIHTC Family Apartment Community\n900 Winston\nHouston, TX\n114 units\nLIHTC Senior Apartment Community\nRead More\n900 Winston\nHouston, TX\n114 units\nLIHTC Senior Apartment Community\nCollege Arms Phase I & II\nPalatka, FL\n108 units\nPreservation Rehab\nRead More\nCollege Arms Phase I & II\nPalatka, FL\n108 units\nPreservation Rehab\nHeritage Apartments\nDeFuniak Springs, FL\n50 units\nPreservation Rehab\nRead More\nHeritage Apartments\nDeFuniak Springs, FL\n50 units\nPreservation Rehab\nHilltop Apartments\nMadison, FL\n72 units\nRead More\nHilltop Apartments\nMadison, FL\n72 units\nMission Hills\nTallahassee, FL\n112 units\nPreservation Rehab\nRead More\nMission Hills\nTallahassee, FL\n112 units\nPreservation Rehab\nHilltop Pointe\nLynn Haven, FL\n50 units\nLIHTC Family Apartment Community\nRead More\nHilltop Pointe\nLynn Haven, FL\n50 units\nLIHTC Family Apartment Community\nColonnade Park\nInverness, FL\n106 units\nLIHTC Senior Apartment Community\nRead More\nColonnade Park\nInverness, FL\n106 units\nLIHTC Senior Apartment Community\nEnclave at Lake Pointe Village\nHarris County, TX\n140 units\nLIHTC Senior Apartment Community\nRead More\nEnclave at Lake Pointe Village\nHarris County, TX\n140 units\nLIHTC Senior Apartment Community\nHave a Project?\nWORK WITH US\nDo you have an upcoming project? We would love to learn more. Here’s how you can reach our team.\nContact",
      "emails": []
    },
    {
      "url": "https://www.royalamerican.com/management#third-party",
      "is_candidate": false,
      "has_email": true,
      "text": "MANAGEMENT\nCULTIVATING COMMUNITY\nManagement\nAbout Us\nThird Party Management\nVendor Services\nRoyal American Management\nABOUT US\nA superlative standard of excellence and unmatched experience in operating diverse property portfolios have made Royal American Management one of the most sought-after real estate management companies in the industry. A culture of integrity, compassion and commitment has inspired the trust and loyalty of residents, clients and employees and helped forge long-term relationships that enrich the lives of the people living in RAM communities.\nLearn More\nThird Party Management\nContact Information\nnewbusiness@royalamerican.com\nExceptional Performance & Professionalism\nTHIRD PARTY MANAGEMENT\nRoyal American Management (RAM) offers full-scope management services for all types of conventional and affordable multifamily and single-family housing rental communities throughout the Southeast and Colorado. Clients include housing authorities and other government entities; Non-profit groups; private developers both large and small; cooperatives; receiverships; and real estate investment companies/ syndicators. For more information, please contact\nnewbusiness@royalamerican.com\nor call 850-769-8981 or Toll-free at 1-800-965-8981.\nTRUSTED\nVENDORS\nLONG LASTING RELATIONSHIPS\nDedicated to Providing Superior Services\nVENDOR SERVICES\nRoyal American Management (RAM) values its professional relationship with its vendors. Therefore, it is important for RAM to establish and develop a pool of vendors with a high level of integrity that offer the most competitive rates. Also for the protection of the owners, employees, residents, and properties, it is critical that each vendor providing services to RAM-managed properties is thoroughly screened. To perform the services for and/ or sell products to RAM managed properties, all vendors must be properly licensed, insured, and qualified as set forth in RAM’s vendor selection criteria. To assist vendors with this qualification process, RAM has implemented a Vendor Compliance Program through Chapman Associates, an affiliated company. As vendor services are an integral part of the success of RAM operations, Chapman Associates employs full- time staff specifically dedicated to overseeing the vendor compliance program. This staff is tasked with checking vendor credentials and references and with obtaining and monitoring their current insurance certificates.\nWork with the Best\nBECOME A VENDOR\nWith over 300 properties in our portfolio, becoming an approved vendor has significant advantages. Our system makes it easy for property managers to find approved vendors, streamlining the process of securing necessary services. To ensure quality and reliability, all new vendors must be endorsed by a property, demonstrating they've been successfully hired for work at that location, and maintain their approval through an annual fee.\nAll RAM-approved vendors working on-site are required to have the following:\nA completed Vendor File Maintenance Form\nSigned and notarized Vendor Agreement\nProof of Insurance\nGeneral Liability with a minimum combined limit of $500,000\nAuto Liability with a minimum combined limit of $100,000\nWorkers’ Compensation with statutory limits as set by the state in which work is being performed or proof of exemption from Workers’ + Compensation laws\nCopy of Business License and/or specialty licenses if applicable\nAnnual Processing Fee\nTo inquire about becoming an Approved Vendor please email\ncontracting@royalamerican.com\n.  All inquiries will be directed to properties looking for services.  Inquiries do not constitute approval of Approved Vendor status.\nContact",
      "emails": [
        "contracting@royalamerican.com",
        "newbusiness@royalamerican.com"
      ]
    },
    {
      "url": "https://www.royalamerican.com/management",
      "is_candidate": false,
      "has_email": true,
      "text": "MANAGEMENT\nCULTIVATING COMMUNITY\nManagement\nAbout Us\nThird Party Management\nVendor Services\nRoyal American Management\nABOUT US\nA superlative standard of excellence and unmatched experience in operating diverse property portfolios have made Royal American Management one of the most sought-after real estate management companies in the industry. A culture of integrity, compassion and commitment has inspired the trust and loyalty of residents, clients and employees and helped forge long-term relationships that enrich the lives of the people living in RAM communities.\nLearn More\nThird Party Management\nContact Information\nnewbusiness@royalamerican.com\nExceptional Performance & Professionalism\nTHIRD PARTY MANAGEMENT\nRoyal American Management (RAM) offers full-scope management services for all types of conventional and affordable multifamily and single-family housing rental communities throughout the Southeast and Colorado. Clients include housing authorities and other government entities; Non-profit groups; private developers both large and small; cooperatives; receiverships; and real estate investment companies/ syndicators. For more information, please contact\nnewbusiness@royalamerican.com\nor call 850-769-8981 or Toll-free at 1-800-965-8981.\nTRUSTED\nVENDORS\nLONG LASTING RELATIONSHIPS\nDedicated to Providing Superior Services\nVENDOR SERVICES\nRoyal American Management (RAM) values its professional relationship with its vendors. Therefore, it is important for RAM to establish and develop a pool of vendors with a high level of integrity that offer the most competitive rates. Also for the protection of the owners, employees, residents, and properties, it is critical that each vendor providing services to RAM-managed properties is thoroughly screened. To perform the services for and/ or sell products to RAM managed properties, all vendors must be properly licensed, insured, and qualified as set forth in RAM’s vendor selection criteria. To assist vendors with this qualification process, RAM has implemented a Vendor Compliance Program through Chapman Associates, an affiliated company. As vendor services are an integral part of the success of RAM operations, Chapman Associates employs full- time staff specifically dedicated to overseeing the vendor compliance program. This staff is tasked with checking vendor credentials and references and with obtaining and monitoring their current insurance certificates.\nWork with the Best\nBECOME A VENDOR\nWith over 300 properties in our portfolio, becoming an approved vendor has significant advantages. Our system makes it easy for property managers to find approved vendors, streamlining the process of securing necessary services. To ensure quality and reliability, all new vendors must be endorsed by a property, demonstrating they've been successfully hired for work at that location, and maintain their approval through an annual fee.\nAll RAM-approved vendors working on-site are required to have the following:\nA completed Vendor File Maintenance Form\nSigned and notarized Vendor Agreement\nProof of Insurance\nGeneral Liability with a minimum combined limit of $500,000\nAuto Liability with a minimum combined limit of $100,000\nWorkers’ Compensation with statutory limits as set by the state in which work is being performed or proof of exemption from Workers’ + Compensation laws\nCopy of Business License and/or specialty licenses if applicable\nAnnual Processing Fee\nTo inquire about becoming an Approved Vendor please email\ncontracting@royalamerican.com\n.  All inquiries will be directed to properties looking for services.  Inquiries do not constitute approval of Approved Vendor status.\nContact",
      "emails": [
        "contracting@royalamerican.com",
        "newbusiness@royalamerican.com"
      ]
    },
    {
      "url": "https://www.royalamerican.com/management#management-about-us",
      "is_candidate": false,
      "has_email": true,
      "text": "MANAGEMENT\nCULTIVATING COMMUNITY\nManagement\nAbout Us\nThird Party Management\nVendor Services\nRoyal American Management\nABOUT US\nA superlative standard of excellence and unmatched experience in operating diverse property portfolios have made Royal American Management one of the most sought-after real estate management companies in the industry. A culture of integrity, compassion and commitment has inspired the trust and loyalty of residents, clients and employees and helped forge long-term relationships that enrich the lives of the people living in RAM communities.\nLearn More\nThird Party Management\nContact Information\nnewbusiness@royalamerican.com\nExceptional Performance & Professionalism\nTHIRD PARTY MANAGEMENT\nRoyal American Management (RAM) offers full-scope management services for all types of conventional and affordable multifamily and single-family housing rental communities throughout the Southeast and Colorado. Clients include housing authorities and other government entities; Non-profit groups; private developers both large and small; cooperatives; receiverships; and real estate investment companies/ syndicators. For more information, please contact\nnewbusiness@royalamerican.com\nor call 850-769-8981 or Toll-free at 1-800-965-8981.\nTRUSTED\nVENDORS\nLONG LASTING RELATIONSHIPS\nDedicated to Providing Superior Services\nVENDOR SERVICES\nRoyal American Management (RAM) values its professional relationship with its vendors. Therefore, it is important for RAM to establish and develop a pool of vendors with a high level of integrity that offer the most competitive rates. Also for the protection of the owners, employees, residents, and properties, it is critical that each vendor providing services to RAM-managed properties is thoroughly screened. To perform the services for and/ or sell products to RAM managed properties, all vendors must be properly licensed, insured, and qualified as set forth in RAM’s vendor selection criteria. To assist vendors with this qualification process, RAM has implemented a Vendor Compliance Program through Chapman Associates, an affiliated company. As vendor services are an integral part of the success of RAM operations, Chapman Associates employs full- time staff specifically dedicated to overseeing the vendor compliance program. This staff is tasked with checking vendor credentials and references and with obtaining and monitoring their current insurance certificates.\nWork with the Best\nBECOME A VENDOR\nWith over 300 properties in our portfolio, becoming an approved vendor has significant advantages. Our system makes it easy for property managers to find approved vendors, streamlining the process of securing necessary services. To ensure quality and reliability, all new vendors must be endorsed by a property, demonstrating they've been successfully hired for work at that location, and maintain their approval through an annual fee.\nAll RAM-approved vendors working on-site are required to have the following:\nA completed Vendor File Maintenance Form\nSigned and notarized Vendor Agreement\nProof of Insurance\nGeneral Liability with a minimum combined limit of $500,000\nAuto Liability with a minimum combined limit of $100,000\nWorkers’ Compensation with statutory limits as set by the state in which work is being performed or proof of exemption from Workers’ + Compensation laws\nCopy of Business License and/or specialty licenses if applicable\nAnnual Processing Fee\nTo inquire about becoming an Approved Vendor please email\ncontracting@royalamerican.com\n.  All inquiries will be directed to properties looking for services.  Inquiries do not constitute approval of Approved Vendor status.\nContact",
      "emails": [
        "contracting@royalamerican.com",
        "newbusiness@royalamerican.com"
      ]
    },
    {
      "url": "https://www.royalamerican.com/about",
      "is_candidate": false,
      "has_email": false,
      "text": "ABOUT\nUS\nDELIVERING HIGH QUALITY SERVICE\nAbout Us\nOur Story\nOur Team\nCommunity Service\nACE\nEmployment Opportunities\nAffiliated Companies\nRoyal American Companies\nOUR STORY\nEveryone wants a place to call home. This basic need is the foundation for Royal American Companies, a vertically integrated family of real estate companies specializing in the development, construction and management of multifamily communities.\nA firm belief you “help who you can” has driven over 50 years of advocacy and innovation in building, maintaining and serving multifamily communities and the people who call them home.  With experts in every field organized to work seamlessly together, Royal American takes an innovative approach to challenges and ensures a consistent standard of excellence for the complete life-cycle of developing, building and managing multifamily communities.\nLearn More\nPromoting Teamwork & Innovation\nMEET OUR TEAM\nWith experts in every field and organized to work seamlessly together, the depth of knowledge our team members bring to the table enables Royal American to take an innovative and integrated approach to challenges and ensure a consistent standard of excellence for the complete life-cycle of developing, building and managing multifamily communities.\nKerri Toth\nPresident CPM ®\nRead Bio\nScott Clemo\nExecutive CPM ®, Corporate Broker, Vice President Commercial Division\nRead Bio\nKimberly Maggard\nExecutive Vice President\nRead Bio\nJim Boyd\nVice President of Development & General Counsel\nSteve Summerbell\nVice President of Construction, Containers &  Southern Coastal Homes\nJohn Lewis\nVice President of Development\nMissy Dugas\nSenior Vice President of Operations\nRead Bio\nJudy Williams\nSenior Vice President of Support Services\nRead Bio\nMarilyn Urroz\nRegional Vice President\nRead Bio\nJeanne Hatten\nRegional Vice President\nRead Bio\nMelissa Nichols\nRegional Vice President\nRead Bio\nMichelle Campbell\nRegional Vice President\nRead Bio\nVeronica Ramsey\nVice President of Compliance\nRead Bio\nMike Correll\nVice President of Information Technology\nRead Bio\nShannon Scribner\nController\nRead Bio\nDave Kennedy\nVice President of Maintenance\nRead Bio\nTonya Ward\nVice President of OneSite Support\nRead Bio\nJennifer Anderson\nVice President of Human Resources\nRead Bio\nSonya Knight\nDirector of Resident Services\nRead Bio\nSusan Haselden\nDirector of Contracting\nRead Bio\nLori Agudo\nDirector of Training & Talent Development\nRead Bio\nRose Clemo\nDirector of Marketing\nRead Bio\nWhitney Brock\nDirector of Risk Management\nRead Bio\nBritany Ost\nClient Relations Manager\nRead Bio\nView More\nKerri Toth\nPresident CPM ®\nSince 2008, Ms. Toth has served as president of Royal American Management (RAM). She began her journey with RAM in 1997 as a regional manager. Ms. Toth is responsible for all aspects of company operations. She also oversees IT, HR and Risk Management for all Royal American Companies. \r\n\r\nMs. Toth has been in the property management industry since 1993 and has extensive experience in marketing and management of stabilized and new construction properties as well as those in the rehab process.\r\n\r\nShe graduated Magna Cum Laude from Peirce College with a degree in Business Administration with a concentration in Real Estate Management. Ms. Toth is a Certified Property Manager (CPM) designated through the Institute of Real Estate Management (IREM) and holds an active Florida Real Estate Salesperson License. \r\n\r\nMs. Toth served as Past President and was a board member for 10+ years for IREM North Florida Chapter, and past board member of the National Housing & Rehabilitation Association (NH & RA.)\nScott Clemo\nExecutive CPM ®, Corporate Broker, Vice President Commercial Division\nAs Corporate Broker for all affiliated Royal American Companies, Mr. Clemo is the licensed individual facilitating all third-party management and brokerage activities.  \r\n\r\nAs Vice President of RAM’s Commercial Division, Mr. Clemo oversees acquisition, development, construction and management of all commercial properties.  The Commercial Division portfolio includes office, retail, condominium and hospitality properties in Northwest Florida.  He also oversees telecom revenue opportunities at market-rate multifamily properties.\r\n\r\nMr. Clemo holds the prestigious Executive CPM® designation for Royal American Management, Inc.  It is the highest designation achievable through the Institute of Real Estate Management (IREM) allowing RAM to become an Accredited Management Organization (AMO®).  He also currently maintains Real Estate Broker Licenses in 14 states throughout the Southeast and Midwest.  \r\n\r\nHe graduated from the University of Florida with a Bachelor of Science degree in Sports Management.\nKimberly Maggard\nExecutive Vice President\nAs the Executive Vice President of Royal American Management, Kimberly Maggard is entrusted with the responsibility of shaping the overarching strategy, steering operational efficiencies, and fortifying the profitability of our organization. With a tenure spanning over 34 years in property management, she brings a wealth of experience and expertise to the helm.\nMrs. Maggard’s journey in property management is underpinned by a robust foundation of professional designations, including the esteemed Certified Property Manager (CPM) accreditation conferred by the Institute of Real Estate Management (IREM). Additionally, she holds the title of Certified Apartment Portfolio Supervisor (CAPS) from the National Apartment Association (NAA), and the designation of Certified Professional of Occupancy (CPO) from the National Affordable Housing Management Association (NAHMA). Complementing these accolades, Kimberly is a licensed Real Estate Sales Associate in the state of Florida and earned a Bachelor of Science Degree in Business Administration from Florida Atlantic University.\nMrs. Maggard is privileged to serve as President for the philanthropic arm of AAGO's Foundation. She has also had the honor of serving as President for both the Apartment Association of Greater Orlando (AAGO) and the Florida Apartment Association (FAA), demonstrating her dedication to advancing the interests of our industry at both regional and state levels. Furthermore, her involvement in various committees and advisory boards within the National Apartment Association (NAA) underscores her commitment to shaping industry standards and best practices.\nDenise Ost\nExecutive Vice President\nMs. Ost is responsible for the oversight of all aspects of property management operations for the RAM Portfolio of multifamily communities located throughout the Southeastern United States, Missouri, Texas, and the US Virgin Islands as well as all of the RAM support staff; Maintenance, Contracting, Resident Accounting, and Compliance.  She is headquartered in the Panama City Corporate Office and is ultimately responsible for the supervision of all RAM operational staff to include: Support Department staff, Senior VP of operations, Regional VPs, Regional Managers, Area Managers, and all on-site staff. \r\n\r\nMs. Ost has extensive experience in all supervisory levels of multifamily property management for both luxury and affordable housing.  She began employment with RAM in 1979 and has since served in the positions of Site Manager, Regional Manager, Regional VP, Division VP, Vice President of Operations, and Senior VP of Operations.\nJim Boyd\nVice President of Development & General Counsel\nSteve Summerbell\nVice President of Construction, Containers &  Southern Coastal Homes\nJohn Lewis\nVice President of Development\nMissy Dugas\nSenior Vice President of Operations\nMissy Dugas has been a vital part of Royal American Management since 2009, currently serving as the Senior Vice President of Operations. In this role, she leads all facets of property management, overseeing more than 300 assets and 23,000 units, and serves over 50,000 residents. Her comprehensive oversight includes third-party managed and company-owned communities, encompassing conventional, affordable, senior/active adult, special needs, and permanent supportive housing.\nBased in Royal American’s Orlando Corporate Office, Missy brings nearly 30 years of extensive experience in the multi-family housing industry. Her career journey has provided her with valuable expertise in managing diverse property types, including conventional, student housing, and affordable communities, property rehabs, and new construction lease-ups.\nShe is an active member of the National Apartment Association, participates in multiple local and state affiliates, and non-profit organizations serving multiple boards and committees. Demonstrating her commitment to professional development and leadership, she is set to serve as the 2025 President for the Apartment Association of Greater Orlando.\nHer responsibilities at Royal American Management include overseeing operational performance, strategic planning for company growth, and leadership development for the operations team. She is a key member of Royal American’s Executive Committee, Safety Committee, Communications and Data Committee, and the Disaster Response Task Force.\nMissy holds several esteemed industry certifications, including Certified Apartment Manager (CAM) and Certified Apartment Property Supervisor (CAPS) through the National Apartment Association, Certified Professional of Occupancy (CPO) from the National Affordable Housing Management Association, and she is a Certified Property Manager (CPM®) Candidate with the Institute of Real Estate Management.\nJudy Williams\nSenior Vice President of Support Services\nMrs. Williams is an industry veteran with a career spanning over two decades at Royal American, a prominent player in the multi-family management sector. In her role as Senior Vice President of Support Services, she oversees a diverse portfolio of critical departments, including Maintenance, Training, Real Page Systems Support, Affordable Compliance Programs, and Marketing, along with Vendor Credentialing and Contracting.\nWith a wealth of experience and deep understanding of resident and client’s needs, her relentless pursuit of excellence has set a benchmark for service excellence within our company. She plays a pivotal role in providing unparalleled support services and nurtures strong relationships with our customers and partners.\nJudy has earned a Certified Apartment Portfolio Supervisor (CAPS) from the National Apartment Association and is a Certified Property Manager Candidate (CPM®) through the Institute of Real Estate Management. She continues to stay informed about industry advancements through ongoing professional development and participates in relevant conferences and forums.\nMarilyn Urroz\nRegional Vice President\nAs Regional VP of Operations, Ms. Urroz is responsible for overseeing all facets of property management operations for the South Florida Region of the Royal American Management Portfolio. She is based in the RAM Miami Regional Corporate Office. \r\n\r\nWith over 15 years of experience in the property management industry, Ms. Urroz has extensive knowledge of Tax Credit, Conventional, and HUD family and senior communities. She has successfully leased up new construction communities and rehab projects.\r\n\r\nMs. Urroz has worked closely with multiple nonprofit organizations to oversee and manage communities that provide quality housing for individuals taking the next step out of homelessness. \r\n\r\nShe began employment with RAM as a Community Manager in 2010 and as she continued her professional growth and increased her leadership skills, she moved up through the company ranks, and was promoted to Regional Vice President of Operations in 2019.\r\n\r\nMs. Urroz holds the following designations: Certified Apartment Property Supervisor (CAPS), and Certified Occupancy Specialist (COS). She is also fluent in English and Spanish.\nJeanne Hatten\nRegional Vice President\nMs. Hatten is responsible for overseeing all facets of property management operations for a portfolio of RAM managed properties located in Alabama, Georgia, North Carolina, South Carolina, Tennessee, Texas and Jacksonville, FL. Regional Managers under her supervision are in the Atlanta, GA and Jacksonville, FL offices. \r\n\r\nMs. Hatten has fourteen plus years' experience in the multifamily housing property management industry to include the management of Tax Credit, Conventional, HUD, Senior Living as well as New Construction lease up and rehabs. \r\n\r\nShe began her multifamily industry career in the North Georgia Mountains in 2005 as a leasing consultant, and advanced in her property management career quickly, coming to Royal American in 2016 as a Regional Manager. Ms. Hatten holds the designation of Certified Apartment Property Supervisor (CAPS.)\nMelissa Nichols\nRegional Vice President\nAs a Regional VP of Operations, Ms. Nichols is responsible for overseeing all facets of property management operations for a portfolio of RAM managed properties located in Alabama and North Florida. She is based in the RAM Panama City Corporate Office.\nMs. Nichols began her career in property management in 1999 and has over 25 years of experience in the industry. She came to Royal American in 2008 and has worked in various positions within the company over the years. She has extensive knowledge managing Conventional, Student Housing, Tax Credit, HUD, RD, senior communities, rehabs, and lease ups of new construction. Ms. Nichols holds the designation of Certified Apartment Property Supervisor (CAPS).\nMichelle Campbell\nRegional Vice President\nAs Regional Vice President, Ms. Campbell is responsible for overseeing all facets of property management operations for the US VI, Northern Florida and Central Florida Regions of the RAM Portfolio. She is based in the RAM Orlando, Florida Regional Office.\nMs. Campbell started her career in property management in 1993 and is a seasoned leader with over 31 years of experience in the Multi-Family Industry. From her early days to her current position, Michelle has held various key roles at both site and corporate VP levels, enriching her perspective and honing her leadership skills. She is well-versed in navigating the intricacies of Conventional, Tax Credit, HUD, and Senior Living properties, as well as overseeing new construction projects. Throughout her career, Michelle has demonstrated adeptness in managing assets through different market conditions, including lease-ups, re-positioning initiatives, and the management of distressed and stabilized communities. Ms. Campbell holds the designation of Certified Apartment Portfolio Supervisor (CAPS).\nVeronica Ramsey\nVice President of Compliance\nVeronica is responsible for compliance, reporting, and affordable training requirements for all properties in the RAM portfolio.\r\n\r\n She ensures all compliance requirements are met at the local, state, and federal levels for HUD, RD, and Housing Credit communities, as well as communities with layered funding. With over 20 years of experience in the real estate and multifamily industry, Ms. Ramsey brings a wealth of expertise.  She has experience in multiple leadership roles within the affordable housing industry.  \r\n\r\nShe served as a Director of Housing, overseeing construction/rehab development, operations, and compliance, oversaw the compliance department for one of the largest national affordable property management companies, as a Regional Manager for a national property management company, and as Compliance Manager with Kentucky Housing Cooperation, auditing and training for multiple funding sources including but not limited to LIHTC, HOME, Trust Fund, Section 8. Ms. Ramsey is a member of NAHMA, SAHMA, and NAHB. \r\n\r\nShe holds numerous industry certifications including Housing Credit Certified Professional (HCCP), Tax Credit Specialist (TCS), Certified Occupancy Specialist (COS), Certified Professional of Occupancy (CPO), Fair Housing Compliance (FHC), Housing Quality Standards (HQS) certifications and is a CPM Candidate.  She has also served as Kentucky’s State Meeting Coordinator for SAHMA.\nMike Correll\nVice President of Information Technology\nMr. Correll is responsible for all facets of Royal American Companies information systems. He handles everything from identifying and developing future technology needs, to recommending implementation strategies and priorities, and overseeing projects that will best achieve the organization’s strategic IT objective. His department supports everything IT related including computers, printers, servers, mobile devices, wireless and wired networking and telephony just to name a few. With policies, procedures and other guidelines in place the IT department strives to provide excellent support in a timely manner.  \r\n\r\nMr. Correll has been working in the information technology field, for over 25 years, most of which has been in a managerial role. He started working for Royal American in 2011.\r\n\r\nMike has an A.S from Gulf Coast State College and holds numerous certifications including CompTIA Cloud+ Certification, CompTIA Security+ Certification, CompTIA Network+ Certification, CompTIA A+ Certification and multiple FEMA NIMS Certificates.\nShannon Scribner\nController\nMs. Scribner joined Royal American Companies (RA) in 2022 as a Senior Accountant – Special Projects, where she began streamlining processes, boosting department morale, strategizing for future growth, and overseeing the transition of internal software. In March 2024, she assumed the role of Controller for Royal American Companies, taking charge of all aspects of the Accounting Division, including apartment and corporate accounting functions. With direct supervision of four department managers and management of a staff of 32, including accounts payable, payroll, and general ledger accounting, she ensures efficient operations.\nBefore joining Royal American, Shannon held roles as the Director of Budget Management & Administration for a local municipality and as the Chief Financial Officer for a Start-Up Company. With over 21 years of progressive experience in accounting and business management, she brings a wealth of expertise to her current position.\nShannon pursued her college education online while balancing full-time work in the business field and raising her children. Shannon holds a Master of Science in Accountancy from the University of Phoenix.\nDave Kennedy\nVice President of Maintenance\nAs Vice President of Maintenance, Mr. Kennedy is responsible for the oversight of all maintenance related items for all Royal American managed communities. He also oversees all safety and maintenance related training programs and works with the Safety Committee to prepare and oversee the company safety manual and hurricane preparation and procedures.\r\n\r\nMr. Kennedy identifies and assesses maintenance issues, coordinates and plans for their remediation with the maintenance and community staff. He is a member of the “property transition team” and evaluates/trains maintenance personnel on site and identifies any major physical needs of the property when RAM assumes management of a new community.\r\n\r\nMr. Kennedy joined the Royal American family in 2002. He has over 25 years of experience in the industry working on negotiations, capital needs assessments, implementing preventative maintenance programs and training service technicians.  \r\n\r\nHe holds a Pool & Spa Operator Certification (CPO), Environmental Protection Agency Certification (EPA) and Certificate for Apartment Maintenance Technicians (CAM-T).\nTonya Ward\nVice President of OneSite Support\nMs. Ward is responsible for the functionality, support, and procedures relating to RealPage/OneSite software at all RAM-managed properties and for the implementation of the software at all new sites entering the RAM Portfolio. She is responsible for the implementation of new OneSite software features and product upgrades and for monitoring existing procedures to ensure the maximum efficient use of all software capabilities. Tonya and her staff provide training and ongoing one-on-one support to site staff as necessary. Any issues are quickly remedied. RAM uses the following RealPage OneSite products: Leasing and Rents, Document Management, Facilities, RealPage Accounting, and all three affordable compliance products.\r\n\r\nTonya began her career with Royal American in 2000 and has 23 years of experience in multifamily housing. Previously, Tonya served as the AVP of Accounting for Royal American where she oversaw the Accounts Payable department for over 15 years.\nJennifer Anderson\nVice President of Human Resources\nMs. Anderson is responsible for the leadership and management of the Royal American Companies Human Resources department. Her Human Resource responsibilities include healthcare benefits and compliance, retirement savings plans, compensation, employee relations, employee policy and procedures, performance management, learning and development and recruitment. She holds the PHR (Professional in Human Resources) Certification. \r\n\r\nMs. Anderson joined the Royal American family in 2003 and has over 20 years of Human Resource experience. She worked in the Payroll Department for 3 years before transferring to the Human Resources department as an HR Assistant. She attended Joliet Junior College in Illinois.\nSonya Knight\nDirector of Resident Services\nSonya Knight serves as the Director of Resident Services at Royal American Management (RAM), where she has made significant contributions since joining the Resident Services Division in 1996. Sonya leads a team dedicated to assisting property owners in the development and reporting of tenant programs to ensure compliance with state housing agencies. With a Professional Service Coordinator designation, Sonya is well equipped to assist property owners with developing programming for special needs and senior communities. Sonya is also instrumental in forging partnerships with referral agencies to facilitate housing for low-income individuals with special needs and is responsible for overseeing Special Needs training for site staff.\nIn addition, Sonya leverages her DE&I certification to chair RAM’s Advancement, Culture & Engagement (ACE) Committee. Under her leadership, the ACE Committee is dedicated to fostering fairness and equal access both within RAM and within the communities it serves. ACE has been instrumental in initiating programs such as Rising Apartment Management Professionals (RAMP)--a tuition-free property management training program for residents, and a professional mentoring program to aid RAM employees' career advancement.\nSusan Haselden\nDirector of Contracting\nMs. Haselden is responsible for supervising the contract administrators in the procurement of services and repairs including writing scopes of work for all RAM-managed properties.   She also negotiates pricing for National Account Agreements and oversees the monitoring of all supplier and contractor compliance with licensing and insurance requirements while performing work on the properties.  \r\n\r\nMs. Haselden began working for RAM in 2009 as a Service Contract Administrator and has served in the positions of Contract Specialist and Contract Manager. She was promoted to RAM’s Director of Contracting after receiving her Master’s Certificate in Contract Management (CCM) from George Washington University School of Business.\nLori Agudo\nDirector of Training & Talent Development\nMs. Agudo, Director of Training & Talent Development at Royal American Management, brings over 17 years of multifamily industry experience and seven years as an industry educator. She oversees training programs for employees and serves on various industry committees, including AAGO and SCAA boards. Her contributions include roles such as Treasurer of the AAGO Foundation and Vice President of the SCAA Board of Directors. Ms. Agudo is also a delegate on the FAA Board of Directors and a member of NAA's RPM Careers Committee. She holds a CAM designation, pursues an ARM certification through IREM, and recently earned an Instructional Design Certification from the Association for Talent Development, showcasing her dedication to professional development and education within the industry.\nRose Clemo\nDirector of Marketing\nAs Director of Marketing, Ms. Clemo spearheads all aspects of marketing and branding for Royal American Companies. With a strategic vision and collaborative spirit, she leads a team of marketing professionals in developing and implementing innovative initiatives across existing and new properties within the RAM portfolio. Her other responsibilities include overseeing social media and reputation management, all marketing communications, marketing campaigns, and ongoing brand management for a portfolio of over 300 multifamily properties.\nMs. Clemo began her career with RAM in 2014 as Marketing and Graphic Developer, and soon became Creative Director before her promotion to Director of Marketing for Royal American Companies in March of 2023. With over 10 years of experience, Ms. Clemo has extensive knowledge of marketing multifamily properties.\nShe graduated from Florida State University and holds a bachelor’s degree in Marketing and Hospitality Management.\nWhitney Brock\nDirector of Risk Management\nWhitney Brock brings a wealth of experience and a strategic approach to her role as Director of Risk Management for Royal American. Since joining the team in 2010, Whitney has steadily progressed through the ranks, starting as a temporary employee, and demonstrating her dedication through promotions to Assistant, Senior Specialist, and now Director.\nIn her current role, Whitney spearheads the identification, mitigation, and management of property and casualty exposures across the entire Royal American portfolio. This includes overseeing claims coordination for general liability, property damage, employment practices, fidelity, and business auto insurance.\nWhitney's focus extends beyond insurance. She plays a vital role in ensuring fair housing compliance by reviewing and providing guidance on incident reports, reasonable accommodation requests, and everyday risk concerns. Her expertise is further leveraged when assisting with litigated claims.\r\nCommitted to professional development, Whitney holds her Fair Housing Coordinator designation and is actively pursuing her Risk Management Associates (RMA) designation.\nBritany Ost\nClient Relations Manager\nAs manager of Client Relations, Mrs. Ost oversees all new business development for RAM. Her and her team work to build, maintain and strengthen RAM relationships with their clients and potential clients. Working start to finish to onboard assets and maintain a portfolio of over 300 multifamily properties. She works with our clients to build strategies to overcome any challenges their asset may face, to better understand what goals our clients aim to accomplish and demonstrate how RAM and its products and services can help them meet these objectives that will benefit their assets. \r\n\r\n\r\nMrs. Ost began her career with RAM in 2011 as an Assistant Community Manager. Soon after she was promoted to Office Manager for the corporate headquarters and Executive Assistant to the President of RAM. Mrs. Ost held this position for 11 years, in 2023 she was promoted to Client Relations Manager.\nIsabel Kelemina-Mudd\nMelanie TEST\nJulian LeaseLabs\nGiving Back\nCOMMUNITY SERVICE\nOne of the driving principles of Royal American is the importance of community service. We advocate for important local causes in the communities we are a part of and empower employees to share their time, talent and passion with causes that improve the lives of those who live in them.\nSome of our favorite causes:\nHatching Hope\nASAP Panama City\nEXCEEDING\nEXPECTATIONS\nSETTING THE BAR HIGHER\nOur Values\nADVANCEMENT, CULTURE\n& ENGAGEMENT\nRoyal American prioritizes a thriving and supportive work environment for our team's success and happiness. We also recognize the positive influence we can have on the communities we serve. These values come to life through our Advancement, Culture & Engagement (ACE) initiative. This program, with its ACE at Work and ACE in the Community arms, fosters a culture where everyone feels valued, empowered, and connected.\nLearn More\nEmployment Opportunities\nGROW WITH US\nThe Royal American family of companies shares a culture built around collaboration and contribution to the wider community.  Our team shares a culture of passion and determination, respect and trust that fosters ingenuity and innovation, an approach we take within our companies as well as with our partners and clients.\nJoin Our Team\nJoin the Family\nAFFILIATED COMPANIES\nHOSPITALITY\nRoyal American Hospitality includes a full network of brands that deliver a seamless vacation experience to guests and profit-building opportunities to each affiliated company. From a convention space and lodging accommodations, to family entertainment, water sports, and more. Check out all we have to offer.\nroyalamericanhospitality.com\nINSURANCE\nPeoples First Insurance Services\n, headquartered in Panama City, Florida is the area’s largest independent insurance, bonding and risk management provider. With over 100 years in business, they deliver years of expertise covering a broad range of services for both commercial and personal insurance lines.\nLANDSCAPING\nSoutheastern Outdoor Management\nis a landscape and irrigation, design/build, and maintenance business that specialize in commercial and residential installation.\nRECREATION\nNature Walk Golf Club\nis a hidden gem tucked away in Lynn Haven, Florida. The 9-hole course is enjoyable for seasoned golfers and eager beginners alike. They offer a top-notch driving range, an accommodating clubhouse with café, and a pro-store on-site.\nDUMPSTER AND CONTAINER RENTALS\nRAC Disposal Services offers roll-off dumpsters & containers in various sizes and affordable prices across the Florida Panhandle.\nracdisposalservices.com\nHOME BUILDER\nBuilding high-quality, semi-custom homes in North Florida that appeal to families, empty-nesters, and seniors at an affordable price.\nSouthern Coastal Homes\nprimary focus is to enhance neighborhood values and build long-lasting value for present and future owners.\nRoyal American Companies\nOur Affiliates\nRoyal American Hospitality\nRAC Disposal Services\nPeoples First Insurance\nNature Walk Golf Course\nSoutheastern Outdoor Management Inc.\nSouthern Coastal Homes",
      "emails": []
    },
    {
      "url": "https://www.facebook.com/RoyalAmericanCompanies",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    }
  ],
  "all_links": [
    "https://www.royalamerican.com/about#our-team",
    "https://www.royalamerican.com/website-governance-notice",
    "https://www.royalamerican.com/about#ace",
    "https://www.royalamerican.com/development#development-services",
    "https://www.royalamerican.com/construction",
    "https://www.royalamerican.com/construction#construction-about-us",
    "https://www.royalamerican.com/about#our-story",
    "https://www.royalamerican.com/management#vendor-services",
    "https://www.royalamerican.com/contact",
    "https://www.royalamerican.com/properties/century-woods-century-fl/floorplans",
    "https://www.royalamerican.com/properties/century-woods-century-fl/contact",
    "https://www.royalamerican.com/properties/century-woods-century-fl/residents",
    "https://www.royalamerican.com/properties/century-woods-century-fl/gallery",
    "https://www.royalamerican.com/development#development-about-us",
    "https://www.royalamerican.com/terms",
    "https://www.royalamerican.com/ace",
    "https://www.royalamerican.com/development",
    "https://www.royalamerican.com/management#third-party",
    "https://www.royalamerican.com/about#affiliates",
    "https://www.royalamerican.com/management",
    "https://www.royalamerican.com/development#development-projects",
    "https://www.royalamerican.com/management#management-about-us",
    "https://www.royalamerican.com/communities",
    "https://www.royalamerican.com/about#community-service",
    "https://www.royalamerican.com/construction#construction-services",
    "https://www.royalamerican.com/communities#search-app-anchor",
    "https://www.royalamerican.com/properties/century-woods-century-fl/amenities",
    "https://www.royalamerican.com/construction#construction-projects",
    "https://www.royalamerican.com/about",
    "https://www.royalamerican.com/properties/century-woods-century-fl/home",
    "https://www.royalamerican.com/home",
    "https://www.royalamerican.com/about#employment",
    "https://www.royalamerican.com/privacy"
  ],
  "candidate_links": [
    "https://www.royalamerican.com/about#our-team",
    "https://www.royalamerican.com/construction#construction-about-us",
    "https://www.royalamerican.com/contact",
    "https://www.royalamerican.com/properties/century-woods-century-fl/contact",
    "https://www.royalamerican.com/development#development-about-us",
    "https://www.royalamerican.com/management#third-party",
    "https://www.royalamerican.com/management",
    "https://www.royalamerican.com/management#management-about-us",
    "https://www.royalamerican.com/about",
    "https://www.facebook.com/RoyalAmericanCompanies"
  ],
  "visited": [
    "https://www.royalamerican.com/properties/century-woods-century-fl",
    "https://www.royalamerican.com/about",
    "https://www.royalamerican.com/contact",
    "https://www.royalamerican.com/staff",
    "https://www.royalamerican.com/team",
    "https://www.royalamerican.com/board",
    "https://www.royalamerican.com/directory",
    "https://www.royalamerican.com/events",
    "https://www.royalamerican.com/sitemap.xml",
    "https://www.royalamerican.com/council",
    "https://www.royalamerican.com/leadership",
    "https://www.royalamerican.com/management",
    "https://www.royalamerican.com/producers",
    "https://www.royalamerican.com/support",
    "https://www.royalamerican.com/crew",
    "https://www.royalamerican.com/members",
    "https://www.royalamerican.com/bios",
    "https://www.royalamerican.com/people",
    "https://www.royalamerican.com/artists",
    "https://www.royalamerican.com/musicians",
    "https://www.royalamerican.com/faculty",
    "https://www.royalamerican.com/administration",
    "https://www.royalamerican.com/about#our-team",
    "https://www.royalamerican.com/construction#construction-about-us",
    "https://www.royalamerican.com/contact",
    "https://www.royalamerican.com/properties/century-woods-century-fl/contact",
    "https://www.royalamerican.com/development#development-about-us",
    "https://www.royalamerican.com/management#third-party",
    "https://www.royalamerican.com/management",
    "https://www.royalamerican.com/management#management-about-us",
    "https://www.royalamerican.com/about",
    "https://www.facebook.com/RoyalAmericanCompanies"
  ],
  "base_url": "https://www.royalamerican.com/properties/century-woods-century-fl"
}