{
  "pages": [
    {
      "url": "https://www.sandbardining.com/about-us",
      "is_candidate": false,
      "has_email": true,
      "text": "About Us\nSandbar’s History\nIn July of 1979, Ed Chiles, with a group of partners, purchased ‘the Sandbar’ with the goal of honoring the history of the Sandbar while creating a destination for locals and visitors that offered a once-in-a-lifetime dining experience featuring great food, amazing service and a view that will forever be etched in a guest's memory. The Sandbar's look, landscape, and menus have changed a bit over the years, but the team has never lost focus on the overriding goal of providing our guests an amazing beachfront dining experience.\nThe tradition of entertainment and relaxation at the site dates back as far as 1911. In those days, Anna Maria was only accessible by boat but still many people came from Tampa, landing on the bay side and making the short hike to \"The Pavilion,\" a favored meeting place for locals and tourists alike, and the site on which Sandbar Seafood & Spirits now sits.\nIn the early days, a diving platform was erected on pilings, approximately 100 feet offshore and connected to the beach by a cable. The 'more adventuresome' could make use of it, minimizing the chance of falling prey to sharks that inhabited the area waters. Local fishermen still refer to the platform, no longer visible, as the \"wire.\"\nA mysterious fire engulfed \"The Pavilion\" in 1946. A 'bucket brigade' was formed to protect the surrounding buildings, but legend has it that the owners didn't waste much water on the blaze. They subsequently placed two old army barracks on the spot and the Sandbar was born.\nThe Sandbar was traded around a bit in the following years. One owner, Mrs. Bernice Enaux, added a dance floor in the late 40's which did more to enhance the Sandbar's reputation.\nThe hurricane of 1950 did extensive damage to the building and wiped out what was left of the platform. Mrs. Enaux, not to be deterred, rebuilt and strengthened the building. After being sold by Mrs. Enaux in the early 60's, it once again saw a period of ownership by many. Extensive remodeling, done in the early 70's removed the bar from the south side and added a new bar and lounge on the north side.\nIn July of 1979, the Sandbar was purchased by Ed Chiles and partners, with a commitment to embrace the future while honoring the history of this historic site and all that the Sandbar meant to the history of Anna Maria Island.\nAfter 45 years of cultivating and growing a successful restaurant business in Manatee County, Ed Chiles sold Sandbar in 2024. The new ownership is Beachside Hospitality, a restaurant group based in Pinellas County.\nlearn more",
      "emails": [
        "sandbar@chilesgroup.com",
        "user@domain.com"
      ]
    },
    {
      "url": "https://www.sandbardining.com/location-hours",
      "is_candidate": false,
      "has_email": true,
      "text": "CONTACT INFO\nPlease note that the Sandbar does not take reservations or call-ahead seating, regardless of party size. Private events can be booked through\nBeachside Hospitality Events\n.\nAddress\n100 Spring Avenue\nAnna Maria, FL 34216\nPhone\n(941) 778-0444\nHours\nMon - Thu\n: 11am - 9pm\nFri, Sat, Sun\n: 11am - 9pm\nContact Us\nName\n*\nFirst Name\nLast Name\nEmail\n*\nDropdown\n*\nWhat is your email about?\nSandbar Feedback / Review\nEvents\nWedding Proposal\nMedia\nCommunity\nOther\nMessage\n*\nThank you!",
      "emails": [
        "sandbar@chilesgroup.com",
        "user@domain.com"
      ]
    },
    {
      "url": "https://www.sandbardining.com/events",
      "is_candidate": false,
      "has_email": true,
      "text": "Events at Sandbar\nWeddings\nThis is it. Your special day is here. You make your way to the arbor on the beach where your future spouse awaits, the crowd turns and you make your way up the aisle as the cool sand covers your toes with each step.\nAs the sun sinks into the Gulf of Mexico, you exchange your first kiss of married life and your friends and family cheer. Then it's off to the pavilion where a magnificent dinner awaits followed by barefoot dancing in the sand until a beautiful moon reflects atop a smooth ocean setting.\nEvents\nWhether you're planning a corporate holiday party, a family reunion, or a networking event, the Sandbar will make it memorable. Our dedicated, on-site coordinators will help you get every detail right.\nToast to the end of another beautiful day on Anna Maria Island with a sunset champagne toast, dance the night away on our pavilion dancefloor and dine on a fantastic menu. Give your guests the most memorable party ever, while sitting back and enjoying the event yourself while we take care of all of the details.\nLEARN MORE\nSpecial Occasions\nThe beaches of Anna Maria Island were made for special memories. From family reunions and baby showers to wedding anniversaries, graduations and milestone birthdays, our venues are the perfect place to host a truly memorable event.\nOutstanding in the Field event\nJanuary 22, 2023",
      "emails": [
        "sandbar@chilesgroup.com",
        "user@domain.com"
      ]
    },
    {
      "url": "https://www.facebook.com/TheSandbarAMI/",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    }
  ],
  "all_links": [
    "https://www.sandbardining.com/our-menu",
    "https://www.sandbardining.com/privacy-policy",
    "https://www.sandbardining.com/pet-policy",
    "https://www.sandbardining.com/",
    "https://www.sandbardining.com/about-us",
    "https://www.sandbardining.com/location-hours",
    "https://www.sandbardining.com/#new-page-1-section",
    "https://www.sandbardining.com/#new-page-section",
    "https://www.sandbardining.com/events",
    "https://www.sandbardining.com/wcag-compliance"
  ],
  "candidate_links": [
    "https://www.sandbardining.com/about-us",
    "https://www.sandbardining.com/location-hours",
    "https://www.sandbardining.com/events",
    "https://www.facebook.com/TheSandbarAMI/"
  ],
  "visited": [
    "https://www.sandbardining.com/",
    "https://www.sandbardining.com/about",
    "https://www.sandbardining.com/contact",
    "https://www.sandbardining.com/staff",
    "https://www.sandbardining.com/team",
    "https://www.sandbardining.com/board",
    "https://www.sandbardining.com/directory",
    "https://www.sandbardining.com/events",
    "https://www.sandbardining.com/sitemap.xml",
    "https://www.sandbardining.com/council",
    "https://www.sandbardining.com/leadership",
    "https://www.sandbardining.com/management",
    "https://www.sandbardining.com/producers",
    "https://www.sandbardining.com/support",
    "https://www.sandbardining.com/crew",
    "https://www.sandbardining.com/members",
    "https://www.sandbardining.com/bios",
    "https://www.sandbardining.com/people",
    "https://www.sandbardining.com/artists",
    "https://www.sandbardining.com/musicians",
    "https://www.sandbardining.com/faculty",
    "https://www.sandbardining.com/administration",
    "https://www.sandbardining.com/about-us",
    "https://www.sandbardining.com/location-hours",
    "https://www.sandbardining.com/events",
    "https://www.facebook.com/TheSandbarAMI/"
  ],
  "base_url": "https://www.sandbardining.com/"
}