{
  "pages": [
    {
      "url": "https://scbwa.net/about-the-festival/staff/",
      "is_candidate": false,
      "has_email": true,
      "text": "The7 12.8.1\nSkip to content\ndirector@scbwa.net\nJanuary 21-25, 2026\nRadisson Resort at the Port Cape Canaveral, Florida\nFacebook page opens in new window\nInstagram page opens in new window\nX page opens in new window\nSpace Coast Birding and Wildlife Festival\nJanuary 24th – 28th, 2024\nHome\nAbout\nStaff\nSponsors and Exhibitors\nBecome A Sponsor/Exhibitor\nSponsors\nExhibitors\nExhibitor Map\nSpeakers\nKeynotes\nPresentations\nField Trips\nPhotography\nID Workshop\nRegistration\nFAQ’s\nGeneral Info\n2020 EIR Report\n2020 Summary & Stats\nAnti-Discrimination Policy\nBird Checklist\nCertification of Solicitation\nContact\nHome\nAbout\nStaff\nSponsors and Exhibitors\nBecome A Sponsor/Exhibitor\nSponsors\nExhibitors\nExhibitor Map\nSpeakers\nKeynotes\nPresentations\nField Trips\nPhotography\nID Workshop\nRegistration\nFAQ’s\nGeneral Info\n2020 EIR Report\n2020 Summary & Stats\nAnti-Discrimination Policy\nBird Checklist\nCertification of Solicitation\nContact\nOUR STAFF\nBrittany Jones, Executive Director\nBrittany Jones brings nearly 20 years of experience in event planning and entrepreneurship to her new role as Festival Director of the Space Coast Birding and Wildlife Festival. A seasoned planner of everything from dream weddings to nonprofit galas and major festivals, Brittany has built a career around crafting memorable, mission-driven events that engage and inspire.\nBirding and wildlife communities may recognize her as the longtime planner of Florida’s Birding & Photo Fest—a role she has proudly held for over 12 years. Through that work, she has helped celebrate the beauty of wildlife and photography while fostering a vibrant community of nature lovers and creatives.\nNow, Brittany is thrilled to bring her passion, expertise, and a fresh perspective to one of the nation’s premier birding festivals. She looks forward to collaborating with partners, participants, field trip leaders, and attendees to continue the festival’s legacy of excellence—while embracing new opportunities to connect, grow, and celebrate the incredible natural world that unites us all.\nContact Brittany at\ndirector@scbwa.net\n.\nDavid Simpson, Field Trip Coordinator\nWith over 30 years of birding experience in Florida, David Simpson is one of the most respected bird guides in the state. A Florida native and lifelong naturalist, David has an unmatched knowledge of the region’s birdlife, habitats, and seasonal patterns. He has worked as a biologist for the Florida Fish and Wildlife Conservation Commission and spent years conducting bird surveys, leading field trips, and helping others deepen their connection to nature.\nDavid leads birding tours across Florida, from coastal hotspots and inland marshes to rare dry scrub habitats, and has an exceptional ear for bird calls. Whether you’re chasing a life bird or just starting out, David brings patience, enthusiasm, and sharp-eyed expertise to every outing.\nHe and his wife Dee are passionate ambassadors for birding and conservation, and they’ve introduced countless visitors and locals alike to the joys of Florida’s wild spaces.\n. Contact David at\nfieldtrips@scbwa.net\n.\nBoard of Directors\nPresident:\nLinda McMahan\nVice President:\nRochelle Hood\nTreasurer\n: Philip Lintereur\nSecretary\n: Catherine Jantzer\nMember at Large:\nDee Fairbanks Simpson\nSocial Media Coordinator\nTo be updated soon\nMARK YOUR CALENDARS!\n2026 Space Coast Birding & Wildlife Festival January 21-25, 2026\nFestival planning is in the preliminary stages and this site will be continually updated as speakers, field trips, photographers, sponsors, and exhibitors are finalized.\nPlease be sure to enter your email address so you are kept informed as planning progresses.\nEmail\ndirector@scbwa.net\nto be added to the mailing list.\nCONTACT US!\nIf you have any questions regarding the festival, sponsorship, or exhibiting, please give us a shout.\ndirector@scbwa.net\nheader\naio-icon-box\naio-icon-component\nSpace Coast Birding and Wildlife Association\nheader\naio-icon-box\naio-icon-component\nP.O. Box 74, Mims, Florida 32754\nheader\naio-icon-box\naio-icon-component\nJanuary 21st -25th, 2026\nheader\naio-icon-box\naio-icon-component\nName\nEmail Address\nSubject\nYour Message\nΔ\nRow Backgrounds\n#content\n.wf-container\n.wf-wrap\n#main\n!Footer\n2023 Space Coast Birding and Wildlife Festival | Websites by\nMelbourne Website Designer\nSCBWA is a 501 (c) (3) non-profit organization\n.wf-container-bottom\n.wf-wrap\n#footer\nGo to Top\n#page",
      "emails": [
        "%20director@scbwa.net",
        "director@scbwa.net",
        "fieldtrips@scbwa.net"
      ]
    },
    {
      "url": "https://scbwa.net/contact-us/",
      "is_candidate": false,
      "has_email": true,
      "text": "The7 12.8.1\nSkip to content\ndirector@scbwa.net\nJanuary 21-25, 2026\nRadisson Resort at the Port Cape Canaveral, Florida\nFacebook page opens in new window\nInstagram page opens in new window\nX page opens in new window\nSpace Coast Birding and Wildlife Festival\nJanuary 24th – 28th, 2024\nHome\nAbout\nStaff\nSponsors and Exhibitors\nBecome A Sponsor/Exhibitor\nSponsors\nExhibitors\nExhibitor Map\nSpeakers\nKeynotes\nPresentations\nField Trips\nPhotography\nID Workshop\nRegistration\nFAQ’s\nGeneral Info\n2020 EIR Report\n2020 Summary & Stats\nAnti-Discrimination Policy\nBird Checklist\nCertification of Solicitation\nContact\nHome\nAbout\nStaff\nSponsors and Exhibitors\nBecome A Sponsor/Exhibitor\nSponsors\nExhibitors\nExhibitor Map\nSpeakers\nKeynotes\nPresentations\nField Trips\nPhotography\nID Workshop\nRegistration\nFAQ’s\nGeneral Info\n2020 EIR Report\n2020 Summary & Stats\nAnti-Discrimination Policy\nBird Checklist\nCertification of Solicitation\nContact\nCONTACT US!\nIf you have any questions regarding the festival, sponsorship, or exhibiting, please give us a shout.\ndirector@scbwa.net\nheader\naio-icon-box\naio-icon-component\nSpace Coast Birding and Wildlife Association\nheader\naio-icon-box\naio-icon-component\nP.O. Box 74, Mims, Florida 32754\nheader\naio-icon-box\naio-icon-component\nJanuary 21st -25th, 2026\nheader\naio-icon-box\naio-icon-component\nName\nEmail Address\nSubject\nYour Message\nΔ\nRow Backgrounds\nMARK YOUR CALENDARS!\n2026 Space Coast Birding & Wildlife Festival\nWelcome or welcome back to the Space Coast Birding and Wildlife Festival\nIf you are new to Florida and curious for a way to safely learn about the natural side of the state, Space Coast offers the ways to see different Florida environs. And you’ll have the fun of meeting other birders and naturalists from across the state!\nThis year’s official festival bird is the American Flamingo. Following Hurricane Idalia in late August 2023, flamingos were flung throughout the east. If we are lucky, the ones that feed near Haulover Canal within the Merritt Island National Wildlife Refuge can be seen on kayak trips. We cannot be sure they will stay for the festival, but we are hoping.\nCome join us!\n#content\n.wf-container\n.wf-wrap\n#main\n!Footer\n2023 Space Coast Birding and Wildlife Festival | Websites by\nMelbourne Website Designer\nSCBWA is a 501 (c) (3) non-profit organization\n.wf-container-bottom\n.wf-wrap\n#footer\nGo to Top\n#page",
      "emails": [
        "%20director@scbwa.net",
        "director@scbwa.net"
      ]
    },
    {
      "url": "https://scbwa.net/field-trips#youngbirderevent",
      "is_candidate": false,
      "has_email": true,
      "text": "The7 12.8.1\nSkip to content\ndirector@scbwa.net\nJanuary 21-25, 2026\nRadisson Resort at the Port Cape Canaveral, Florida\nFacebook page opens in new window\nInstagram page opens in new window\nX page opens in new window\nSpace Coast Birding and Wildlife Festival\nJanuary 24th – 28th, 2024\nHome\nAbout\nStaff\nSponsors and Exhibitors\nBecome A Sponsor/Exhibitor\nSponsors\nExhibitors\nExhibitor Map\nSpeakers\nKeynotes\nPresentations\nField Trips\nPhotography\nID Workshop\nRegistration\nFAQ’s\nGeneral Info\n2020 EIR Report\n2020 Summary & Stats\nAnti-Discrimination Policy\nBird Checklist\nCertification of Solicitation\nContact\nHome\nAbout\nStaff\nSponsors and Exhibitors\nBecome A Sponsor/Exhibitor\nSponsors\nExhibitors\nExhibitor Map\nSpeakers\nKeynotes\nPresentations\nField Trips\nPhotography\nID Workshop\nRegistration\nFAQ’s\nGeneral Info\n2020 EIR Report\n2020 Summary & Stats\nAnti-Discrimination Policy\nBird Checklist\nCertification of Solicitation\nContact\nField Trips\nWednesday\nThursday\nFriday\nSaturday\nSunday\nWednesday, January 22\nSt. Sebastian River Preserve SP and Fellsmere Grade\nOffshore Birding and Wildlife Pelagic Adventure\nBeginning Birding Field Trip at MINW\nLearn Wildlife Photography at Orlando Wetlands Park\nMullet Head Island Kayak Trip at MINWR Wednesday Trip 1\nTour of Veteran’s Memorial Park “Smart” Rain Garden – Wednesday\nFlora & Fauna of Merritt Island NWR\nAirboat birding along the St. Johns Wednesday Trip 1\nMullet Head Island Kayak Trip at MINWR Wednesday Trip 2\nAirboat Birding Along the St. Johns Wednesday Trip 2\nAirboat Birding Along the St. Johns Wednesday Trip 3\nBlue Dolphin Ultimate Boat Birding\nMullet Head Island Kayak Trip at MINWR Wednesday Trip 3\nMarsh Birding at the St. Johns NWR\nRed-cockaded Woodpecker at SSRPSP\nSt. Sebastian River Preserve SP and Fellsmere Grade\nSOLD OUT\nThis trip features some of the best birding sites in southern Brevard and Indian River Counties. With an early start at St. Sebastian River Preserve State Park we’ll see Red-cockaded Woodpeckers emerge from their roost cavities, see Brown-headed Nuthatches, hopefully see and hear Bachman’s Sparrows singing. Learn about RCWO and BHNU relocation efforts and other management projects while seeing these very special birds. After we get our fill of pinewoods inhabitants, we will cross over to the Fellsmere Grade Recreation Area to see the nesting Roseate Spoonbills and other possible species.\nPrice:\n$95 includes a box lunch & snack.\nDate:\nWednesday, Jan 22\nTime:\n5:00 – 11:00 a.m.\nType:\nBus.\nDeparture Details:\nMeet at 4:45 a.m. in front of the Radisson hotel lobby to board the bus.\nLeader:\nDavid Simpson\nParticipant Limit:\n11\nAccessibility:\nModerate walking required. Clean, accessible bathrooms available at the Preserve.\nAdditional Site Information\n:\nhttps://www.floridastateparks.org/St-Sebastian\nhttps://www.sjrwmd.com/lands/recreation/fellsmere\nBrown Booby\nOffshore Birding and Wildlife Pelagic Adventure\nSponsored by the American Bird Conservancy\nThe Canaveral Princess is an 85-foot, single-hull boat with excellent observation areas on the upper deck, bow and stern. We will first visit working shrimp boats for the birds that follow them. Our chumming behind the boat will result in a crowd of gulls, terns, pelicans and gannets to watch from amazingly close quarters. Once we’ve collected some birds to follow our boat, if the weather permits, we’ll set out for the Gulf Stream. Our destination will be an undersea formation known as “The Steeples,” a productive setting of cliffs and seamounts that create upwellings and current edges along the western edge of the Gulf Stream. Birds likely to be seen include Northern Gannet; Pomarine and Parasitic Jaeger and several species of gulls and terns. Birds we hope to see include Audubon’s, Cory’s, Great and Manx Shearwater; Band-rumped Storm Petrel; Bridled and Sooty Tern; Brown Booby; Red Phalarope; Black-legged Kittiwake and Sabine’s Gull.\nPrice:\n$195 includes a box lunch & snack.\nDate:\nWednesday, Jan 22\nTime:\n7:30 a.m. – 5:00 p.m.\nType:\nMeet on site.\nArrival Details:\nMeet at the Canaveral Princess, 670 Glen Cheek Drive, Port Canaveral, FL by 7:00 a.m. The Canaveral Princess docks between Rusty’s and Gator’s DocksideRestaurants in Port Canaveral. Estimated 4 minutes from the Radisson at the Port.\nLeaders:\nBert Alm, Sergio Arias, Christian Newton, Mitchell Harris, Greg Miller\nParticipant Limit:\n64\nAccessibility:\nWear waterproof shoes and bring rain gear, sunscreen and sea-sickness treatment if needed.Rest rooms on board.\nAdditional Site Information\n:\nhttps://orlandoprincess.com/the-boats/\nDisclaimer:\nIf the trip does not go as scheduled on Wednesday, January 22nd you will automatically be rescheduled for Monday, January 27th.  If the trip is cancelled on both dates due to inclement weather as determined by the boat’s captain, only then will you receive a full refund.  Please do not book this trip if you are not prepared to stay through Monday should the need arise due to schedule change. If the trip does not go as scheduled on Jan. 22nd and DOES go on Jan. 27th, there will be NO refunds for anyone who cannot be on board on Jan. 27th.\nGreat Egret\nBeginning Birding Field Trip at MINWR\nSOLD OUT\nJoin Kim for an intimate morning of instruction and observation along the highly acclaimed Black Point Wildlife Drive where there will be birds galore. She will provide helpful hints for beginners such as where to find birds, interesting behaviors, and identification tricks of the birding trade. We will see how the reddish egret dances for its food while the Little Blue Heron simply stalks its food. The large flocks of white birds will become familiar to you as Great Egrets, Snowy Egrets, White Ibis, Woodstorks and White Pelicans. Shallow impoundments filled with wading birds will offer opportunities to differentiate between egrets and herons. Birding is far more than a hobby. It is an open door to the world of nature, a touch point that connects people to the outdoors.\nPrice:\n$35\nDate:\nWednesday, Jan 22\nTime:\n8:00 a.m. – 11:30 a.m.\nType:\nMeet on site.\nArrival Details:\nMeet at the Parrish Park boat ramp parking (under the Max Brewer Bridge) to board a small bus at 7:45. Estimated 35 minutes from the Radisson at the Port.\nLeader:\nKimberly King-Wrenn\nParticipant Limit:\n12\nAccessibility:\nMust be able to get on and off of bus. Some walking on flat packed roads. Restrooms available midway through the Black Point Wildlife Drive.\nAdditional Site Information\n:\nhttps://www.fws.gov/refuge/merritt-island\nRed-shouldered Hawk\nLearn Wildlife Photography at Orlando Wetlands Park\nOrlando Wetlands Park: Orlando Wetlands Park is an ideal spot for bird photography, boasting a wide variety of bird species such as herons, egrets, and ibises. Our main Focus in this class will be how configure your camera to the right setting for stunning photographs.\nNote:\nTo ensure that you get the most from this trip, the field trip leader will contact you at the email address that you used to register for the festival to discuss what type of camera you will be bringing and your current level of photography experience.\nPrice:\n$65\nDate:\nWednesday, Jan 22\nTime:\n8:00 a.m. – 11:30 a.m.\nType:\nMeet on site\nArrival Details:\nMeet at 7:45 at the Orlando Wetlands Park, 25155 Wheeler Road, Christmas.Estimated 39 minutes from the Radisson at the Port.\nLeaders:\nJason Giraulo and Phil Lintereur\nParticipant\nLimit:  15\nAccessibility:\nAccessible restrooms are available parking lot, but not on the dikes and trails. Some walking on unpaved trails.\nAdditional Site Information:\nhttps://www.orlando.gov/Parks-the-Environment/Directory/Wetlands-Park\nSalt Marsh Skipper\nFlora & Fauna of Merritt Island NWR\nSOLD OUT\nOn this trip we will start with a hardwood hammock trail seeing oaks, maples, elms, palms, sub-tropical shrubs and the expected native species of woodland birds. Years ago a Townsends warbler spent the entire winter basically in a single large live oak. Then we will drive a short distance to a scrub/pine flatwoods habitat that borders a large marsh. There will be scrub oaks, lyonias and various scrub species. Florida Scrub-Jays are probable and Roseate Spoonbills, egrets, shorebirds and eagles are possible.\nPrice:\n$30\nDate:\nWednesday, Jan 22\nTime:\n9:00 a.m. – 12:00 p.m.\nType:\nMeet on site.\nArrival Details:\nMeet at 8:45 at the Oak Hammock Trail parking lot on SR 406, approx. 1/2 mile east of the MINWR Visitor Center. Estimated 41 minutes from the Radisson at the Port.\nTip:\nSR 406 is also Beach Road/A.Max Brewer Memorial Parkway.\nLeaders:\nJim and Kay Stahl\nParticipant Limit:\n12\nAccessibility:\nEasy walking on a boardwalk and flat, dry trails required. Bathrooms available 1/2 mile away at the MINWR Visitor Center.\nAdditional Site Information\n:\nhttps://www.fws.gov/refuge/merritt-island\nMangrove Tree Crab\nMullet Head Island Kayak Trip at MINWR – Wed Trip 1\nJoin Rebecca Chapman from Springs to Sea Old Florida Eco Tours for a 2 hour kayak trip to the protected rookery known as Mullet Head Island (also known as “Bird Island”.) Paddle to an uninhabited island or through a maze of twisted mangrove forests in the Coastal Wildlife Kayak Tour. As you glide through the shallow lagoon of a wildlife refuge, keep your eyes peeled for playful dolphins, gentle manatees, colorful flamingos, and a whole cast of slippery stingrays and wading birds. This is your chance to get up close and personal with the wildest coastal critters! Our stops along this tour may include Bird Island (wind-dependent), a mangrove forest, known manatee observation areas, or shallow flats teeming with rays, hermit crabs, and mullet!\nNote:\nNo children under 4 years old are allowed on this trip.\nPrice:\n$ 60.00\nDate:\nWednesday, Jan 22\nTime:\n9:00 a.m. – 11:00 a.m.\nType:\nMeet on site\nArrival Details:\nMeet at 8:45 at the NW Haulover Canal Kayak Launch in the Merritt Island National Wildlife Refuge.\nLeaders:\nRebecca Chapman, Jesse Huth\nParticipant Limit:\n8\nAccessibility:\nThis activity may not be suitable for guests with certain back and shoulder conditions. There is a weight limit of 250 lbs per guest.\nAdditional Site Information:\nhttps://springstosea.com/\nTour of Veterans Memorial Park “Smart” Rain Garden – Wednesday\nDiscover the newly enhanced Veterans Memorial Park, a cherished community space that harmoniously blends natural beauty with innovative technology improving resilience for the City of Cape Canaveral. The park recently underwent a transformative upgrade made possible by a $1 million National Science Foundation CIVIC Challenge grant.\nThe focus of this tour will be the new “Smart” Rain Garden, a sophisticated bioswale system monitored by a network of remote sensors and capable of holding 150,000 gallons of stormwater filtered by nearly 1,000 Florida-friendly and native plants which create a thriving habitat for local pollinators.\nJoin us under majestic oak trees, including one unique specimen over 250 years old, to observe butterflies and bees while learning more about this example of green stormwater infrastructure. Veterans Memorial Park provides a model for how urban spaces can mitigate flood risks and protect water quality, while also providing vital natural areas for community members – wildlife and humans alike.\nPrice:\n$ 10.00\nDate:\nWednesday, Jan 22\nTime:\n10:00 a.m. – 11:00 a.m.\nType:\nMeet on site\nArrival Details:\nMeet at 9:45 at the Cape Canaveral Library, 201 Polk Ave, Cape Canaveral, FL.\nLeaders:\nAmy Reaume, John Stiner\nParticipant Limit:\n20\nAccessibility:\nRestrooms and water are available at the neighboring Cape Canaveral library. The rain garden can be viewed from surrounding sidewalks. Visitors who would like to go down into the rain garden which has uneven terrain (a slope and rocks) should wear closed toed shoes.\nAdditional Site Information:\nhttps://blogs.ifas.ufl.edu/brevardco/2024/10/30/smart-rain-garden-series-veterans-memorial-park-location/\nSnail Kite\nAirboat birding along the St. Johns – Wed Trip\n1 SOLD OUT\nYou will enjoy the exclusive combination of Captain Mike, a fifth generation Floridian who grew up here on the river, and a professional birding tour guide and other birders on this exclusive small personal tour. You will glide along marshes and into a secluded cypress swamp to view an abundance of wading birds, waterfowl and raptors on this special adventure. This is optimal habitat for Snail Kites, Crested Caracaras, and Bald Eagles. In fact, 25 Bald Eagles were observed on just one trip in 2020. The St Johns River floodplain is only accessible by airboat due to the shallow depth. Your guides will point out the habitats and ongoing activity of the many species that are found here. Other wildlife, including alligators, may be encountered. This is a great opportunity for birders who prefer to avoid strenuous walking or hiking. Airboat Tours are hosted by A St. Johns River Airboat Tours LLC in Titusville, FL\nPrice:\n$90\nDate:\nWednesday, Jan 22\nTime:\n10:00 a.m. – 11:30 a.m.\nType:\nMeet on site.\nArrival Details:\nArrive by 9:45 a.m. at the Highway 50 Boat Ramp, 28500 East Colonial Drive, Christmas. Estimated 29 minutes from the Radisson at the Port.\nLeader:\nBetty Salter\nParticipant Limit:\n5\nAccessibility:\nYou must be able to get up into high seats on the airboat. No restroom facility on site.\nAdditional Site Information\n:\nhttps://stjohnsairboatour.com/\nAmerican White Pelican\nMullet Head Island Kayak Trip at MINWR – Wed Trip\n2\nJoin Rebecca Chapman from Springs to Sea Old Florida Eco Tours for a 2 hour kayak trip to the protected rookery known as Mullet Head Island (also known as “Bird Island”.) Paddle to an uninhabited island or through a maze of twisted mangrove forests in the Coastal Wildlife Kayak Tour. As you glide through the shallow lagoon of a wildlife refuge, keep your eyes peeled for playful dolphins, gentle manatees, colorful flamingos, and a whole cast of slippery stingrays and wading birds. This is your chance to get up close and personal with the wildest coastal critters! Our stops along this tour may include Bird Island (wind-dependent), a mangrove forest, known manatee observation areas, or shallow flats teeming with rays, hermit crabs, and mullet!\nNote:\nNo children under 4 years old are allowed on this trip.\nPrice:\n$60.00\nDate:\nWednesday, Jan 22\nTime:\n12:00 p.m. – 2:00 p.m.\nType:\nMeet on site\nArrival Details:\nMeet at 11:45 at the NW Haulover Canal Kayak Launch in the Merritt Island National Wildlife Refuge.\nLeaders:\nRebecca Chapman\nParticipant Limit:\n8\nAccessibility:\nThis activity may not be suitable for guests with certain back and shoulder conditions. There is a weight limit of 250 lbs per guest.\nAdditional Site Information:\nhttps://springstosea.com/\nCrested Caracara\nAirboat birding along the St. Johns – Wed Trip\n2 SOLD OUT\nYou will enjoy the exclusive combination of Captain Mike, a fifth generation Floridian who grew up here on the river, and a professional birding tour guide and other birders on this exclusive small personal tour. You will glide along marshes and into a secluded cypress swamp to view an abundance of wading birds, waterfowl and raptors on this special adventure. This is optimal habitat for Snail Kites, Crested Caracaras, and Bald Eagles. In fact, 25 Bald Eagles were observed on just one trip in 2020. The St Johns River floodplain is only accessible by airboat due to the shallow depth. Your guides will point out the habitats and ongoing activity of the many species that are found here. Other wildlife, including alligators, may be encountered. This is a great opportunity for birders who prefer to avoid strenuous walking or hiking. Airboat Tours are hosted by A St. Johns River Airboat Tours LLC in Titusville, FL\nPrice:\n$90\nDate:\nWednesday, Jan 22\nTime:\n12:00 p.m. – 1:30 p.m.\nType:\nMeet on site.\nArrival Details:\nArrive by 9:45 a.m. at the Highway 50 Boat Ramp, 28500 East Colonial Drive, Christmas. Estimated 29 minutes from the Radisson at the Port.\nLeader:\nKelly Smith\nParticipant Limit:\n5\nAccessibility:\nYou must be able to get up into high seats on the airboat. No restroom facility on site.\nAdditional Site Information\n:\nhttps://stjohnsairboatour.com/\nImmature Bald Eagle\nAirboat Birding Along the St. Johns – Wed Trip 3\nSOLD OUT\nYou will enjoy the exclusive combination of Captain Mike, a fifth generation Floridian who grew up here on the river, and a professional birding tour guide and other birders on this exclusive small personal tour. You will glide along marshes and into a secluded cypress swamp to view an abundance of wading birds, waterfowl and raptors on this special adventure. This is optimal habitat for Snail Kites, Crested Caracaras, and Bald Eagles. In fact, 25 Bald Eagles were observed on just one trip in 2020. The St Johns River floodplain is only accessible by airboat due to the shallow depth. Your guides will point out the habitats and ongoing activity of the many species that are found here. Other wildlife, including alligators, may be encountered. This is a great opportunity for birders who prefer to avoid strenuous walking or hiking. Airboat Tours are hosted by A St. Johns River Airboat Tours LLC in Titusville, FL\nPrice:\n$90\nDate:\nWednesday, Jan 22\nTime:\n2:00 p.m. – 3:30 p.m.\nType:\nMeet on site.\nArrival Details:\nArrive by 1:45 p.m. at the Highway 50 Boat Ramp, 28500 East Colonial Drive, Christmas. Estimated 29 minutes from the Radisson at the Port.\nLeader:\nKelly Smith\nParticipant Limit:\n5\nAccessibility:\nYou must be able to get up into high seats on the airboat. No restroom facility on site.\nAdditional Site Information\n:\nhttps://stjohnsairboatour.com/\nOsprey with Redear Sunfish\nBlue Dolphin Ultimate Boat Birding\nThe Blue Dolphin is a 49-passenger Coast Guard approved pontoon boat operated by Mark and Michele Anderson. This four-hour adventure will start at Kelly Park East, which is just 6 minutes from the Radisson Resort. We will cross the Banana River, pass through the Canaveral Locks and into Port Canaveral where you may see the Space X fleet of rocket recovery ships and plenty of birds! In addition, you are likely to see dolphins. A flock of American White Pelicans is normally seen at the entrance to the locks and during the cruise you will see Ospreys and other raptors, Wood Storks, Northern Gannets, pelicans, cormorants, gulls, terns and lots of egrets and herons. Past trips have produced such uncommon visitors as Common Eider, Magnificent Frigatebird Sabine’s Gull and Common Loon. We are looking forward to seeing you aboard the Blue Dolphin.\nPrice:\n$100 includes snack, water, and boxed lunch.\nDate:\nWednesday, Jan 22\nTime:\n1:00 p.m. – 5:00 p.m.\nType:\nMeet on site\nArrival Details:\nArrive at 12:45 p.m. at Kelly Park East, 2550 N. Banana River Drive, Merritt Island. Estimated 7 minutes from the Radisson at the Port.\nLeaders:\nWesley Homoya,Christian Newton\nParticipant Limit:\n46\nAccessibility:\nHandicapped Accessible. Rest room on boat. Sunscreen is recommended.\nAdditional Site Information\n:\nhttps://www.spacecoastrivertours.com/index.html\nAmerican Flamingo\nMullet Head Island Kayak Trip at MINWR – Wed Trip 3\nJoin Rebecca Chapman from Springs to Sea Old Florida Eco Tours for a 2 hour kayak trip to the protected rookery known as Mullet Head Island (also known as “Bird Island”.) Paddle to an uninhabited island or through a maze of twisted mangrove forests in the Coastal Wildlife Kayak Tour. As you glide through the shallow lagoon of a wildlife refuge, keep your eyes peeled for playful dolphins, gentle manatees, colorful flamingos, and a whole cast of slippery stingrays and wading birds. This is your chance to get up close and personal with the wildest coastal critters! Our stops along this tour may include Bird Island (wind-dependent), a mangrove forest, known manatee observation areas, or shallow flats teeming with rays, hermit crabs, and mullet!\nNote: No children under 4 years old are allowed on this trip.\nPrice:\n$60.00\nDate:\nWednesday, Jan 22\nTime:\n3:00 p.m. – 5:00 p.m.\nType:\nMeet on site\nArrival Details:\nMeet at 2:45 at the NW Haulover Canal Kayak Launch in the Merritt Island National Wildlife Refuge.\nLeaders:\nRebecca Chapman\nParticipant Limit:\n8\nAccessibility:\nThis activity may not be suitable for guests with certain back and shoulder conditions. There is a weight limit of 250 lbs per guest.\nAdditional Site Information:\nhttps://springstosea.com/\nSora\nMarsh Birding at the St. Johns NWR\n– Wed SOLD OUT\nA caravan of USFWS trucks will carry attendees into the St. Johns National Wildlife Refuge which is a restricted access property. This preserve was the last home of the now-extinct Dusky Seaside Sparrow. These marshes west of Titusville are unique because saline water seeps to the surface from a layer of salty water that lies above the Floridan Aquifer, creating marine-type habitats in the middle of a huge freshwater floodplain – perfect for secretive marsh birds. The Black Rail is one of the most elusive wetland birds and is on the state and federal endangered and threatened species lists. King Rails and Virginia Rails are also possible. As the sun sets on the marsh horizon and wading birds flock to their roosts, we will make stops and listen for elusive rail calls.\nPrice:\n$65 Includes a snack.\nDate:\nWednesday, Jan 22\nTime:\n4:15 p.m. – 7:15 p.m.\nType:\nMeet on site.\nArrival Details:\nArrive at  4:15 at Cracker Barrel Restaurant, 4745 Helen Hauser Blvd, Titusville in the south parking area. Estimated 25 minutes from the Radisson at the Port.\nLeaders:\nDavid Simpson, Kim King-Wrenn\nParticipant Limit:\n14\nAccessibility:\nThere are no restrooms on site. You may be walking through water, mud, and grass. Old shoes, or knee boots are advised.\nAdditional Site Information\n:\nhttps://www.fws.gov/refuge/st-johns\nThursday, January 23\nLake Apopka North Shore\nShiloh’s Sharptails, Marshbirds and More\nSalt Lake Wildlife Management Area Trailer Tour\nBirding Rotary Park\nLearn Wildlife Photography at Black Point Wildlife Drive\nFlorida Scrub Jay Hike at Cruickshank Sanctuary\nChain of Lakes Park\nAirboat Birding Along the St. Johns – Thursday Early\nEasy Bird & Wildlife Photography with Sony Mirrorless Cameras at Orlando Wetlands – Thursday\nTour of Hubbs-SeaWorld Research Institute’s Coconut Point Lab – Trip 1\nMullet Head Island Kayak Trip at MINWR – Thursday Trip 1\nBarrier Island Center and Pelican Island Cruise\nAirboat birding along the St. Johns – Thursday – Trip 1\nTour of Hubbs-SeaWorld Research Institute’s Coconut Point Lab – Trip 2\nAirboat Birding Along the St. Johns – Thursday – Trip 2\nMullet Head Island Kayak Trip at MINWR – Thursday Trip 2\nAirboat Birding Along the St. Johns – Thursday – Trip 3\nBlue Dolphin Ultimate Boat Birding and Wildlife Journey – Thursday\nMullet Head Island Kayak Trip at MINWR – Thursday Trip 3\nMarsh Birding at the St. Johns NWR – Thursday\nBarred Owl, Lake Apopka\nLake Apopka North Shore\nSOLD OUT\nThis property is one of the premier locations in the southeastern United States to observe birds. The list of birds found here continues to grow, with over 370 species having been recorded. During the winter months, more than 150 species regularly use the property, from showy herons and egrets to ducks and shorebirds and numerous tiny warblers and flycatchers. Other wildlife found here includes alligators, turtles, bobcats, otters, raccoons, snakes and coyotes. Former farmlands make up the Lake Apopka North Shore restoration area. The St. Johns River Water Management District’s major activities include marsh and floodplain restoration and the creation of a marsh flow-way. Circulating lake water through restored wetlands filters Lake Apopka’s waters. If the weather allows, attendees will tour in the District’s bench trailer, starting with the dawn chorus at the most optimum spot and continuing on the wildlife drive, which will be closed to the public.\nPrice:\n$135 Includes lunch and snacks.\nDate:\nThursday, Jan 23\nTime:\n5:00 a.m. – 4:00 p.m.\nType:\nBus\nDeparture Details:\nMeet at 4:45 in front of the Radisson hotel lobby to board the bus.\nLeaders:\nChris Newton, Brady Bailo, Greg Miller\nParticipant Limit:\n22\nAccessibility:\nSome walking required. Porta-potties are available throughout the restoration area.\nAdditional Site Information\n:\nhttps://www.sjrwmd.com/lands/recreation/lake-apopka/\nClapper Rail\nShiloh’s Sharptails, Marshbirds and More\nSOLD OUT\nThis trip begins in the marshes where Turnbull Creek drains into the northern end of the Indian River Lagoon. There we will look for both Nelson’s and Saltmarsh Sparrows, Sedge Wrens and Clapper Rails. Short-eared Owls are seen here occasionally as well. After ample time in the marsh we’ll walk east along the dike system that skirts the edge of Shiloh’s extensive marshes and impoundments looking for ducks, shorebirds and waders. This is an area of rich estuaries and ponds that teem with wildlife.\nPrice:\n$65\nDate:\nThursday, Jan 23\nTime:\n6:15 a.m. 11:00 a.m.\nType:\nMeet on site\nArrival Details:\nMeet 6:15 a.m. at the Circle K located at 6004 US-1, Mims, FL 32754. It is on the corner of US 1 and Magoon Ave. Estimated 38 minutes from the Radisson at the Port.\nLeaders:\nMitchell Harris, Gabriel Lugo\nParticipant Limit:\n15\nAccessibility:\nNo rest rooms on site. Bring Muck Boots or shoes that you don’t mind getting wet for the sparrow search. Walk will be 3-4 four miles long on unpaved trails.\nAdditional Site Information\n:\nhttps://www.fws.gov/refuge/merritt-island\nBachman’s Sparrow\nSalt Lake Wildlife Management Area Trailer Tour\nSalt Lake WMA’s 8,000 acres border three large lakes and the St. Johns River in northern Brevard County. Don’t miss this chance to explore it in a bench seat trailer. Home to a spectacular range of natural communities, this beautiful property includes pine flatwoods, hardwood hammocks and oak scrub on higher ground. Oak and cabbage palm hammocks, swamps, freshwater marshes, wet prairies, and salt flats occupy the wetter locales. Numerous wading birds, shorebirds, waterfowl, and raptors can be found on the lakes and marshes and the river. Bald Eagles and Wild Turkeys are commonly seen. The flatwoods provide good habitat for woodpeckers and songbirds, such as the Eastern Bluebird and Bachman’s Sparrow. Gopher tortoises, deer, feral hogs, river otters, alligators and turtles may also be seen. This extraordinary opportunity to be able to ride through the management area rather than walk it, as well as the reasonable cost, is a benefit of the Watchable Wildlife Public Access Program of the Florida Fish and Wildlife Conservation Commission.\nPrice:\n$30\nDate:\nThursday, Jan 23\nTime:\n6:45 a.m. -11:30 a.m.\nType:\nMeet on site\nArrival Details:\nMeet at Salt Lake WMA, 1590 Arch Rd., Mims. Park at the main public parking area for Salt Lake WMA. Estimated 36 minutes from the Radisson at the Port.\nLeaders:\nTom Ledford, Jeremiah Oden\nParticipant Limit:\n26\nAccessibility:\nThere is a porta potty located at the Salt Lake WMA main entrance. No restroom facilities are available during the trip.\nAdditional Site Information\n:\nhttps://myfwc.com/recreation/lead/salt-lake/\nMilkweed butterfly chrysalis at Rotary Park\nBirding Rotary Park\nExplore this beautiful park with naturalist, educator, and birder Kate Wells. Our bird walk will begin on the front porch of Rotary Park Nature Center, which is located in the center of the park, directly across from the large pavilion. There are binoculars and bird books available to borrow upon request.\nWe will be looking and listening for winter songbirds such as warblers, sparrows, and buntings, as well as year-round birds such as woodpeckers, gnatcatchers, cardinals, and jays. Red-shouldered Hawks and Osprey will almost certainly be in attendance; with some luck, we may even encounter Sandhill Cranes. As the park is surrounded by the Indian River Lagoon, frequent flyovers include pelicans, herons, egrets, cormorants, and anhinga.\nPrice:\n$20\nDate:\nThursday, Jan 23\nTime:\n7:15 a.m. – 9:30 a.m.\nType:\nMeet on site\nArrival Details:\nMeet at Rotary Park, 1899 South Courtenay Parkway, Merritt Island, FL 32952 Note that there a few parks in Brevard County named Rotary Park, make sure you enter this address into your GPS. Approximately 12. 4 miles  (20 minutes) from the Radisson Resort at the Port.\nLeader:\nKate Wells, PhD, Rotary Park Environmental Program Supervisor, Carlos Bethancourt\nParticipant Limit:\n20\nAccessibility:\nThere are accessible restrooms and trails throughout the park. Highly recommended: Water-resistant shoes, sun protection, insect bite prevention, and drinking water. The park does not have food sales or vending machines.\nAdditional Site Information:\nhttps://www.brevardfl.gov/ParksAndRecreation/ParksByCity/ParksInMerrittIsland/Rotary\nNorthern Shovelers at Black Point Wildlife Drive\nLearn Wildlife Photography at Black Point Wildlife Drive\nSituated within the Merritt Island National Wildlife Refuge, Black Point Wildlife Drive is a 7-mile scenic route that offers exceptional bird photography opportunities. This drive features a variety of habitats, including salt marshes and mudflats, attracting numerous bird species such as roseate spoonbills, egrets, and herons. This class will focus on the use of blinds, selecting of lenses, protecting your gear in salt air conditions, and having the birds come to you.\nNote:\nTo ensure that you get the most from this trip, the field trip leader will contact you at the email address that you used to register for the festival to discuss what type of camera you will be bringing and your current level of photography experience.\nPrice:\n$65\nDate:\nThursday, Jan 23\nTime:\n8:00 – 11:30 a.m.\nType:\nMeet on site\nArrival Details:\nMeet at 7:45 a.m at the Parrish Park Boat Ramp Parking Lot, Max Brewer Memorial Pkwy, Titusville. Estimated 33 minutes from the Radisson at the Port.\nLeaders:\nJason Giraulo and Phil Lintereur\nParticipant Limit:\n15\nAccessibility:\nRestroom facilities are available midway through drive.\nAdditional Site Information:\nhttps://www.fws.gov/refuge/merritt-island\nFlorida Scrub Jay at Cruickshank Sanctuary\nFlorida Scrub Jay Hike at Cruickshank Sanctuary\nSOLD OUT\nThe Helen and Alan Cruickshank Sanctuary in Rockledge is considered to be one of the best EEL Sanctuary properties to observe Florida Scrub-Jays, a threatened species that is Florida’s only endemic bird. When the environment meets their needs, Florida Scrub-Jays will spend their entire lives on the same lands. The Cruickshank Sanctuary is located on the Atlantic Coastal Ridge, a sandy relic maritime dune line that extends along the Florida East Coast from Jacksonville down to Miami. Patches of oak, sand pine scrub, and freshwater depression marshes add to the Sanctuary’s diversity. Since the EEL Program began land management at the 168-acre Sanctuary, the Florida Scrub-Jay population has increased from a few visiting birds to over 50 birds in 8 separate family territories. Gopher Tortoises, Red-bellied Woodpeckers, and other species requiring scrub habitat are often observed in the Sanctuary.\nPrice:\n$30\nDate:\nThursday, Jan 23\nTime:\n8:30 a.m. – 10:30 a.m.\nType:\nMeet on site\nArrival Details:\nMeet at the Helen & Alan Cruickshank Sanctuary, 360 Barnes Blvd, Rockledge, FL. Estimated 25 minutes from the Radisson at the Port. Carpooling is highly recommended as spaces are limited. Try using the official Festival app if you want to find others looking to car pool.\nLeaders:\nBert and Val Alm, Chip Clouse\nParticipant Limit:\n12\nAccessibility:\nNo rest rooms on site. Walking on unpaved trails required.\nAdditional Site Information\n:\nhttps://www.brevardfl.gov/EELProgram/Sanctuaries/HelenAndAllanCruickshankSanctuary\nRed-shouldered Hawk at Chain of Lakes Park\nChain of Lakes Park SOLD OUT\nThis recreation complex includes many habitats such as artificial lakes and wetlands (salt marsh and mangroves), hardwood and sabal palm hammocks. Species seen here include Eagles, Hawks, Wood Storks, Glossy Ibis, Cattle Egrets, Roseate Spoonbills, Mottled Ducks, gulls and terns. And, if you walk through the hammock, you might even catch get a look at Painted Buntings! There is also a 5-story observation deck.\nPrice:\n$25\nDate:\nThursday, Jan 23\nTime:\n8:30 a.m. – 11:00 a.m.\nArrival Details:\nMeet at 2300 Truman Scarborough Way, Titusville at 8:15 a.m.  From Truman Scarborough Way, turn right onto Snowy Egret Way. Park in the lot at the end of Snowy Egret Way, by the Home of the Titans sign.\nType:\nMeet on site.\nAccessibility:\nRestrooms available on the corner of Chain of Lakes Drive and Snowy Egret Way. Walking on a combination of paved and unpaved trails and some boardwalk.\nLeaders:\nDavid Simpson\nParticipant Limit:\n20\nAdditional Site Information:\nhttps://www.brevardfl.gov/ParksAndRecreation/ParksByCity/ParksInTitusville/ChainOfLakes\nImmature American Bald Eagle\nAirboat Birding Along the St. Johns – Thursday Early Trip\nYou will enjoy the exclusive combination of Captain Mike, a fifth generation Floridian who grew up here on the river, and a professional birding tour guide and other birders on this exclusive small personal tour. You will glide along marshes and into a secluded cypress swamp to view an abundance of wading birds, waterfowl and raptors on this special adventure. This is optimal habitat for Snail Kites, Crested Caracaras, and Bald Eagles. In fact, 25 Bald Eagles were observed on just one trip in 2020. The St Johns River floodplain is only accessible by airboat due to the shallow depth. Your guides will point out the habitats and ongoing activity of the many species that are found here. Other wildlife, including alligators, may be encountered. This is a great opportunity for birders who prefer to avoid strenuous walking or hiking. Airboat Tours are hosted by A St. Johns River Airboat Tours LLC in Titusville, FL\nPrice:\n$90\nDate:\nThursday, Jan 23\nTime:\n8:30 a.m. – 10:00 a.m.\nType:\nMeet on site.\nArrival Details:\nArrive by 8:15 a.m. at the Highway 50 Boat Ramp, 28500 East Colonial Drive, Christmas. Estimated 29 minutes from the Radisson at the Port.\nLeader:\nKelly Smith\nParticipant Limit:\n5\nAccessibility:\nYou must be able to get up into high seats on the airboat. No restroom facility on site.\nAdditional Site Information\n:\nhttps://stjohnsairboatour.com/\nMale Blue-ringed Dancer at Orlando Wetlands\nEasy Bird & Wildlife Photography with Sony Mirrorless Cameras at Orlando Wetlands – Thursday\nBird and wildlife photography will never be easy but we don’t have to make it any harder than it is.There is no need to shoot in manual and RAW. If you learn how your camera works and trust it for focus and exposure, it will leave you free to find and frame the birds and wildlife you want to photograph. Using the newer Sony mirrorless cameras  as an example, I will show you how to bring back consistently satisfying images of birds and wildlife.\nPrice:\n$65\nDate:\nThursday, Jan 23\nTime:\n8:30 a.m. – 11:30 a.m.\nType:\nMeet on site\nArrival Details:\nMeet in the parking area for the Orlando Wetlands Park.\nLeaders:\nStephen Ingraham (Point and Shoot Nature Photographer)\nParticipant Limit:\n10\nAccessibility:\nWalking on possibly uneven/unpaved trails. Restrooms available at visitors center, but not on trails.\nAdditional Site Information\n:\nhttps://www.orlando.gov/Our-Government/Departments-Offices/Public-Works/Water-Reclamation-Division/Orlando-Wetlands\nTour of Hubbs-SeaWorld Research Institute’s Coconut Point Lab – Trip 1\nJoin us for a limited-access tour of the Hubbs-SeaWorld Research Institute’s (HSWRI) Coconut Point Lab in Melbourne Beach, where our team leads Florida’s busiest marine mammal stranding program. The tour will provide a behind the scenes look at our marine mammal and habitat conservation efforts, including an introduction to Indian River Lagoon dolphin population ecology, ongoing research, and our marine mammal stranding response program.\nThe tour includes a walkthrough of our small research facility, featuring a research lab, marine mammal tissue bank, and necropsy lab. Guests will also have a chance to view Brevard Zoo’s on-site seagrass nursery, which, when fully operational, will play a critical role in IRL habitat restoration efforts.\nWith a legacy dating back to 1963, HSWRI is committed to the conservation of marine life and the health of the world’s oceans. The institute’s work in the Indian River Lagoon (IRL) exemplifies its mission to apply scientific solutions to the many challenges facing marine ecosystems. Through research, education, and outreach, HSWRI has made significant contributions to marine conservation, including efforts to protect IRL dolphins and other vulnerable species​​​​.\nPrice:\n$30.00\nDate:\nThursday, Jan 23\nTime:\n9:00 a.m. – 10:30 a.m.\nType:\nMeet on site\nArrival Details:\nHubbs-SeaWorld Research Institute’s Coconut Point Lab, 4020 S. Hwy A1A, Melbourne Beach, FL. Due to limited parking, car pooling is highly encouraged.\nLeaders:\nDr. Jeff Eblem, TBD\nParticipant Limit:\n12\nAccessibility:\nOur facility is handicap accessible, and children aged 12 or older are welcome to join.\nAdditional Site Information:\nhttps://hswri.org/\nMullet Head Island Kayak Trip at MINWR – Thursday Trip 1\nSOLD OUT\nJoin Rebecca Chapman from Springs to Sea Old Florida Eco Tours for a 2 hour kayak trip to the protected rookery known as Mullet Head Island (also known as “Bird Island”.) Paddle to an uninhabited island or through a maze of twisted mangrove forests in the Coastal Wildlife Kayak Tour. As you glide through the shallow lagoon of a wildlife refuge, keep your eyes peeled for playful dolphins, gentle manatees, colorful flamingos, and a whole cast of slippery stingrays and wading birds. This is your chance to get up close and personal with the wildest coastal critters! Our stops along this tour may include Bird Island (wind-dependent), a mangrove forest, known manatee observation areas, or shallow flats teeming with rays, hermit crabs, and mullet!\nNote: No children under 4 years old are allowed on this trip.\nPrice:\n$60.00\nDate:\nThursday, Jan 23\nTime:\n9:00 a.m. – 11:00 a.m.\nType:\nMeet on site\nArrival Details:\nMeet at 8:45 at the NW Haulover Canal Kayak Launch in the Merritt Island National Wildlife Refuge.\nLeaders:\nRebecca Chapman, Jesse Huth\nParticipant Limit:\n8\nAccessibility:\nThis activity may not be suitable for guests with certain back and shoulder conditions. There is a weight limit of 250 lbs per guest.\nAdditional Site Information:\nhttps://springstosea.com/\nLesser and Greater Yellowlegs at Pelican Island NWR\nBarrier Island Center and Pelican Island Cruise\nSOLD OUT\nThis trip begins with a personal tour of the Barrier Island Education Center (BIEC) and a video followed by scoping for shorebirds and sea birds at the boardwalk along the Atlantic Ocean. The BIEC is located inside the Archie Carr National Wildlife Refuge (ACNWR) on South Melbourne Beach. Continuing the bus ride to Sebastian, you will arrive at Capt. Hiram’s Resort for a late lunch and a boat tour to Pelican Island (our first National Wildlife Refuge) on the River King, a 45-foot USCG approved pontoon boat. 16 species nest on the 4.2-acre Pelican Island, including Brown Pelican, Wood Stork, Anhinga, American Oystercatcher, and many herons and egrets. On the water look for American White Pelican, Lesser Scaup, Mottled Duck, Common Loon, Horned Grebe, Pied-billed Grebe, Red-breasted Merganser and many gulls and terns. Bottle-nosed dolphins are probable and sea turtles are possible.\nPrice:\n$135. Includes snacks. In addition, you should bring money for a 2:00 p.m. lunch at Blackfin’s Riverfront Grill at Capt. Hiram’s Resort.\nDate:\nThursday, Jan 23\nTime:\n9:30 a.m. – 7:30 p.m.\nType:\nBus\nDeparture Details:\nMeet at 9:15 a.m. in front of the Radisson hotel lobby to board the bus.\nLeaders:\nWesley Homoya, Ray Mojica, Charlie Venuto\nParticipant Limit:\n12\nAccessibility:\nRest rooms available at stops. Some walking on paved and unpaved trails.\nAdditional Site Information\n:\nhttps://www.brevardfl.gov/EELProgram/Sanctuaries/BarrierIslandSanctuary\nhttps://hirams.com/things-to-do/riverking/\nDisclaimer:\nIn the event of inclement weather as determined by the captain, participants on the trip will view Pelican Island and the birds coming in to roost for the evening from the Refuge’s land-based location on the barrier island.\nSnail Kite\nAirboat birding along the St. Johns – Thursday – Trip 1\n– SOLD OUT\nYou will enjoy the exclusive combination of Captain Mike, a fifth generation Floridian who grew up here on the river, and a professional birding tour guide and other birders on this exclusive small personal tour. You will glide along marshes and into a secluded cypress swamp to view an abundance of wading birds, waterfowl and raptors on this special adventure. This is optimal habitat for Snail Kites, Crested Caracaras, and Bald Eagles. In fact, 25 Bald Eagles were observed on just one trip in 2020. The St Johns River floodplain is only accessible by airboat due to the shallow depth. Your guides will point out the habitats and ongoing activity of the many species that are found here. Other wildlife, including alligators, may be encountered. This is a great opportunity for birders who prefer to avoid strenuous walking or hiking. Airboat Tours are hosted by A St. Johns River Airboat Tours LLC in Titusville, FL\nPrice:\n$90\nDate:\nThursday, Jan 23\nTime:\n10:00 a.m. – 11:30 a.m.\nType:\nMeet on site.\nArrival Details:\nArrive by 9:45 a.m. at the Highway 50 Boat Ramp, 28500 East Colonial Drive, Christmas. Estimated 29 minutes from the Radisson at the Port.\nLeader:\nJoão Jara\nParticipant Limit:\n5\nAccessibility:\nYou must be able to get up into high seats on the airboat. No restroom facility on site.\nAdditional Site Information\n:\nhttps://stjohnsairboatour.com/\nTour of Hubbs-SeaWorld Research Institute’s Coconut Point Lab – Trip 2\nJoin us for a limited-access tour of the Hubbs-SeaWorld Research Institute’s (HSWRI) Coconut Point Lab in Melbourne Beach, where our team leads Florida’s busiest marine mammal stranding program. The tour will provide a behind the scenes look at our marine mammal and habitat conservation efforts, including an introduction to Indian River Lagoon dolphin population ecology, ongoing research, and our marine mammal stranding response program.\nThe tour includes a walkthrough of our small research facility, featuring a research lab, marine mammal tissue bank, and necropsy lab. Guests will also have a chance to view Brevard Zoo’s on-site seagrass nursery, which, when fully operational, will play a critical role in IRL habitat restoration efforts.\nWith a legacy dating back to 1963, HSWRI is committed to the conservation of marine life and the health of the world’s oceans. The institute’s work in the Indian River Lagoon (IRL) exemplifies its mission to apply scientific solutions to the many challenges facing marine ecosystems. Through research, education, and outreach, HSWRI has made significant contributions to marine conservation, including efforts to protect IRL dolphins and other vulnerable species​​​​.\nPrice:\n$30.00\nDate:\nThursday, Jan 23\nTime:\n11:00 a.m. – 12:30 p.m.\nType:\nMeet on site\nArrival Details:\nHubbs-SeaWorld Research Institute’s Coconut Point Lab, 4020 S. Hwy A1A, Melbourne Beach, FL. Due to limited parking, car pooling is highly encouraged.\nLeaders:\nDr. Jeff Eblem, TBD\nParticipant Limit:\n12\nAccessibility:\nOur facility is handicap accessible, and children aged 12 or older are welcome to join.\nAdditional Site Information:\nhttps://hswri.org/\nCrested Caracara\nAirboat Birding Along the St. Johns – Thursday – Trip 2\nSOLD OUT\nYou will enjoy the exclusive combination of Captain Mike, a fifth generation Floridian who grew up here on the river, and a professional birding tour guide and other birders on this exclusive small personal tour. You will glide along marshes and into a secluded cypress swamp to view an abundance of wading birds, waterfowl and raptors on this special adventure. This is optimal habitat for Snail Kites, Crested Caracaras, and Bald Eagles. In fact, 25 Bald Eagles were observed on just one trip in 2020. The St Johns River floodplain is only accessible by airboat due to the shallow depth. Your guides will point out the habitats and ongoing activity of the many species that are found here. Other wildlife, including alligators, may be encountered. This is a great opportunity for birders who prefer to avoid strenuous walking or hiking. Airboat Tours are hosted by A St. Johns River Airboat Tours LLC in Titusville, FL\nPrice:\n$90\nDate:\nThursday, Jan 23\nTime:\n12:00 p.m. – 1:30 p.m.\nType:\nMeet on site.\nArrival Details:\nArrive by 11:45 a.m. at the Highway 50 Boat Ramp, 28500 East Colonial Drive, Christmas. Estimated 29 minutes from the Radisson at the Port.\nLeader:\nKelly Smith\nParticipant Limit:\n5\nAccessibility:\nYou must be able to get up into high seats on the airboat. No restroom facility on site.\nAdditional Site Information\n:\nhttps://stjohnsairboatour.com/\nAmerican White Pelican\nMullet Head Island Kayak Trip at MINWR – Thursday Trip 2\nJoin Rebecca Chapman from Springs to Sea Old Florida Eco Tours for a 2 hour kayak trip to the protected rookery known as Mullet Head Island (also known as “Bird Island”.) Paddle to an uninhabited island or through a maze of twisted mangrove forests in the Coastal Wildlife Kayak Tour. As you glide through the shallow lagoon of a wildlife refuge, keep your eyes peeled for playful dolphins, gentle manatees, colorful flamingos, and a whole cast of slippery stingrays and wading birds. This is your chance to get up close and personal with the wildest coastal critters! Our stops along this tour may include Bird Island (wind-dependent), a mangrove forest, known manatee observation areas, or shallow flats teeming with rays, hermit crabs, and mullet!\nNote: No children under 4 years old are allowed on this trip.\nPrice:\n$60.00\nDate:\nThursday, Jan 23\nTime:\n12:00 p.m. – 2:00 p.m.\nType:\nMeet on site\nArrival Details:\nMeet at 11:45 at the NW Haulover Canal Kayak Launch in the Merritt Island National Wildlife Refuge.\nLeaders:\nRebecca Chapman,\nSpecial Guest: Dr. Jerry Lorenz\nParticipant Limit:\n8\nAccessibility:\nThis activity may not be suitable for guests with certain back and shoulder conditions. There is a weight limit of 250 lbs per guest.\nAdditional Site Information:\nhttps://springstosea.com/\nCaspian Tern\nBlue Dolphin Ultimate Boat Birding and Wildlife Journey – Thursday\nThe Blue Dolphin is a 49-passenger Coast Guard approved pontoon boat operated by Mark and Michele Anderson. This four-hour adventure will start at Kelly Park East, which is just 6 minutes from the Radisson Resort. We will cross the Banana River, pass through the Canaveral Locks and into Port Canaveral where you may see the Space X fleet of rocket recovery ships and plenty of birds! In addition, you are likely to see dolphins. A flock of American White Pelicans is normally seen at the entrance to the locks and during the cruise you will see Ospreys and other raptors, Wood Storks, Northern Gannets, pelicans, cormorants, gulls, terns and lots of egrets and herons. Past trips have produced such uncommon visitors as Common Eider, Magnificent Frigatebird Sabine’s Gull and Common Loon. We are looking forward to seeing you aboard the Blue Dolphin.\nPrice:\n$100 includes snack & light lunch from Fishlips Waterfront Bar and Grill.\nDate:\nThursday, Jan 23\nTime:\n1:00 p.m. – 5:00 p.m.\nType:\nMeet on site\nArrival Details:\nArrive at 12:45 p.m. at Kelly Park East, 2550 N. Banana River Drive, Merritt Island. Estimated 7 minutes from the Radisson at the Port.\nLeaders:\nDave Hartgrove,Dave Grant\nParticipant Limit:\n46\nAccessibility:\nHandicapped Accessible. Rest room on boat. Sunscreen is recommended.\nAdditional Site Information\n:\nhttps://www.spacecoastrivertours.com/index.html\nAmerican Flamingo\nMullet Head Island Kayak Trip at MINWR – Thursday Trip 3\nJoin Rebecca Chapman from Springs to Sea Old Florida Eco Tours for a 2 hour kayak trip to the protected rookery known as Mullet Head Island (also known as “Bird Island”.) Paddle to an uninhabited island or through a maze of twisted mangrove forests in the Coastal Wildlife Kayak Tour. As you glide through the shallow lagoon of a wildlife refuge, keep your eyes peeled for playful dolphins, gentle manatees, colorful flamingos, and a whole cast of slippery stingrays and wading birds. This is your chance to get up close and personal with the wildest coastal critters! Our stops along this tour may include Bird Island (wind-dependent), a mangrove forest, known manatee observation areas, or shallow flats teeming with rays, hermit crabs, and mullet!\nNote: No children under 4 years old are allowed on this trip.\nPrice:\n$60.00\nDate:\nThursday, Jan 23\nTime:\n3:00 p.m. – 5:00 p.m.\nType:\nMeet on site\nArrival Details:\nMeet at 2:45 at the NW Haulover Canal Kayak Launch in the Merritt Island National Wildlife Refuge.\nLeaders:\nRebecca Chapman\nParticipant Limit:\n8\nAccessibility:\nThis activity may not be suitable for guests with certain back and shoulder conditions. There is a weight limit of 250 lbs per guest.\nAdditional Site Information:\nhttps://springstosea.com/\nSora\nMarsh Birding at the St. Johns NWR – Thursday\nSOLD OUT\nA caravan of USFWS trucks will carry attendees into the St. Johns National Wildlife Refuge which is a restricted access property. This preserve was the last home of the now-extinct Dusky Seaside Sparrow. These marshes west of Titusville are unique because saline water seeps to the surface from a layer of salty water that lies above the Floridan Aquifer, creating marine-type habitats in the middle of a huge freshwater floodplain – perfect for secretive marsh birds. The Black Rail is one of the most elusive wetland birds and is on the state and federal endangered and threatened species lists. King Rails and Virginia Rails are also possible. As the sun sets on the marsh horizon and wading birds flock to their roosts, we will make stops and listen for elusive rail calls.\nPrice:\n$65 Includes a snack.\nDate:\nThursday, Jan 23\nTime:\n4:15 p.m. – 7:15 p.m.\nType:\nMeet on site.\nArrival Details:\nArrive at  4:15 at Cracker Barrel Restaurant, 4745 Helen Hauser Blvd, Titusville in the south parking area. Estimated 25 minutes from the Radisson at the Port.\nLeaders:\nKim King-Wrenn, David Simpson\nParticipant Limit:\n14\nAccessibility:\nThere are no restrooms on site. You may be walking through water, mud, and grass. Old shoes, or knee boots are advised.\nAdditional Site Information\n:\nhttps://www.fws.gov/refuge/st-johns\nFriday, January 24\nSt. Sebastian River Preserve SP and Fellsmere Grade\nTosohatchee Wildlife Management Area\nManatees of Blue Spring and St. Johns River Cruise\nOrlando Wetlands Park Trailer Tour – Friday\nLearn Wildlife Photography at Gleason Park\nGulls and other Waterbirds at Jetty Park\nFlorida Wildlife Hospital Photo Shoot\nWinter Waders, Warblers & Waterfowl at Sams House\nTurkey Creek Sanctuary\nMullet Head Island Kayak Trip at MINWR – Friday Trip 1\nFlorida Wildlife Hospital Tour\nAirboat birding along the St. Johns – Friday Trip 1\nTour of Veterans Memorial Park “Smart” Rain Garden – Friday\nMullet Head Island Kayak Trip at MINWR – Friday Trip 2\nAirboat Birding Along the St. Johns – Friday Trip 2\nBlue Dolphin Ultimate Boat Birding and Wildlife Journey – Friday\nAirboat Birding Along the St. Johns – Friday Trip 3\nMullet Head Island Kayak Trip at MINWR – Friday Trip 3\nOwls and Rails of MINWR\nBrown-headed Nuthatch, SSRPSP\nSt. Sebastian River Preserve SP and Fellsmere Grade\nThis trip features some of the best birding sites in southern Brevard and Indian River Counties. With an early start at St. Sebastian River Preserve State Park we’ll see Red-cockaded Woodpeckers emerge from their roost cavities, see Brown-headed Nuthatches, hopefully see and hear Bachman’s Sparrows singing. Learn about RCWO and BHNU relocation efforts and other management projects while seeing these very special birds. After we get our fill of pinewoods inhabitants, we will cross over to the Fellsmere Grade Recreation Area to see the nesting Roseate Spoonbills and other possible species.\nPrice:\n$95 includes a snack.\nDate:\nFriday, Jan 24\nTime:\n5:00 – 11:00 a.m.\nType:\nBus.\nDeparture Details:\nMeet at 4:45 a.m. in front of the Radisson hotel lobby to board the bus.\nLeaders:\nDavid Simpson\nParticipant Limit:\n11\nAccessibility:\nModerate walking required. Clean, accessible bathrooms available at the Preserve.\nAdditional Site Information\n: https://www.floridastateparks.org/St-Sebastian\nhttps://www.sjrwmd.com/lands/recreation/fellsmere\nEastern Bluebird\nTosohatchee Wildlife Management Area\nSOLD OUT\nThe Tosohatchee marshes are feeding areas for wading birds and, during winter months, host large numbers of migrating waterfowl. Forested uplands support deer, bobcats, gray foxes, wild turkeys, woodpeckers, hawks, owls, and songbirds. Some of the threatened and endangered species found at the reserve include Bald Eagle, Wood Stork, Eastern Indigo Snake, and Gopher Tortoise. Birds of interest include Bachman’s Sparrow, Brown-headed Nuthatch, Eastern Bluebird, Red-headed Woodpecker, and Florida Sandhill Crane. Shaped by alternating cycles of fire and flood, Tosohatchee WMA is a mosaic of marshes, swamps, pine flatwoods and oak hammocks that borders 19 miles of the St Johns River. Deep inside the reserve, Jim Creek flows through some of the last remaining virgin cypress swamps in Florida.\nPrice:\n$65 includes a snack sack. In addition, there is a $3 Entrance fee per car that you must pay on entering the park.\nDate:\nFriday, Jan 24\nTime:\n6:15 a.m. – 11:30 a.m.\nType:\nMeet on site\nArrival Details:\nMeet Up at Tosohatchee WMA 3365 Taylor Creek Road, Christmas FL 32709. Once through the entrance gate, proceed 0.1 miles to Parking Area #1. This parking area is directly across from the hunting check station. We will leave from this location. Estimated 28 minutes from the Radisson at the Port.\nNote:\nOnce parked, participants will need to carpool with someone that has an appropriate vehicle that will not get stuck in the mud or receive water damage while on our roads. Vehicles such as a 4-wheel drive or all-wheel drive.\nLeaders:\nBert and Val Alm (Space Coast Audubon) , Gina and Adam Kent\nParticipant Limit:\n18\nAccessibility:\nThis is a self-driving tour with stops along the way for short walks. There are composting toilets at the entrance but not out on the roads and trails. Be sure the you dress in warm clothing and be prepared for wet conditions, even if it is not raining.\nAdditional Site Information\n:\nhttps://myfwc.com/recreation/lead/tosohatchee/things-to-do/\nPurple Gallinule\nManatees of Blue Spring and St. Johns River Cruise\nSOLD OUT\nThis special trip consists of a visit to Blue Spring State Park (BSSP). The morning will start with a walk along the shore of Blue Spring Run to observe Florida’s most charismatic megafauna, the West Indian Manatee, and bird the woodlands surrounding the spring run. What makes BSSP so unique and special is that during colder months its crystal-clear waters are one of Florida’s best places to watch the manatees. A box lunch will be provided on a river cruise onboard a U.S. Coast Guard approved pontoon boat that was specially designed to ply the shallow backwaters of this unique section of the historic St. Johns River. The captain is a licensed Coast Guard captain who knows the history of the area and the wildlife that abounds. It leaves from BSSP, passes through a historic cypress logging canal and into the Hontoon Dead River, where you will experience the wild and pristine Florida swamp as it has been over the centuries. Highlights from the trip in 2020 included more than a dozen Purple Gallinules, over two dozen Limpkins, more than three dozen Anhingas, both night herons and 5 species of woodpeckers.\nPrice:\n$120 includes a box lunch and snack.\nDate:\nFriday, January 24\nTime:\n6:30 a.m. – 2:45 p.m.\nType:\nBus\nDeparture Details:\nMeet at 6: 15 in front of the Radisson hotel lobby to board the bus.\nLeaders:\nLaurilee Thompson, Serge Arias, Chris Newton\nParticipant Limit:\n22\nAccessibility:\nMarine head on the boat. Handicapped Accessible.\nAdditional Site Information\n:\nhttps://www.floridastateparks.org/parks-and-trails/blue-spring-state-park\nWoodstork and Spoonbill at Orlando Wetlands Park\nOrlando Wetlands Park Trailer Tour – Friday\nSOLD OUT\nThis regional water treatment area, owned by the City of Orlando, began receiving reclaimed water in 1987, submerging the 1700-acre Sun Charm Ranch beneath millions of gallons of treated sewage. For 30 years the City closed the park during winter months so that the former owners could hunt waterfowl, until 2016 when it bought the hunting rights. Join us as we take a trip into the park where more than 220 bird species have been identified including Wood Storks, Bald Eagles, Crested Caracaras, Limpkins, Purple Gallinules, rails and spoonbills. Painted Buntings lurk in some of the dense vegetation bordering the 20 miles of roads and woodland trails leading through marshes, hardwood hammocks and along scenic lakes. Large numbers of waterfowl and wading birds are expected. Other wildlife found here includes alligators, turtles, deer, hogs, bobcats, otters, raccoons, opossums, snakes and coyotes. There will be multiple stops with walking to spy the best birds.\nPrice:\n$90\nDate:\nFriday, Jan 24\nTime:\n7:30 a.m. – 11:00 a.m.\nType:\nMeet on site.\nArrival Details:\nMeet at the Orlando Wetlands Park, 25155 Wheeler Road, Christmas.Estimated 39 minutes from the Radisson at the Port.\nLeaders:\nJoão Jara,Wayne Klockner\nParticipant Limit:\n20\nAccessibility:\nAccessible restrooms are available parking lot, but not on the dikes and trails. Some walking on unpaved trails.\nAdditional Site Information\n:\nhttps://www.orlando.gov/Parks-the-Environment/Directory/Wetlands-Park\nSoftshell Turtle at Gleason Park\nLearn Wildlife Photography at Gleason Park\nThis is a fantastic park located in Indian Harbor beach with a series of diverse environments which include Upland, ponds and a short walk to the Indian River which is key for Warblers (ie Redstarts, Thrushes, Merlins and Cooper’s Hawk, this is a perfect area to learn how to let birds come to you, how to optimize point and shoots, getting the right exposures and the use of tri and mono pods.\nNote:\nTo ensure that you get the most from this trip, the field trip leader will contact you at the email address that you used to register for the festival to discuss what type of camera you will be bringing and your current level of photography experience.\nPrice:\n$65\nDate:\nFriday, Jan 24\nTime:\n8:00 – 11:30 a.m.\nType:\nMeet on site\nArrival Details:\nMeet at 7:45 at Gleason Park, 1233 Yacht Club Blvd, Indian Harbour Beach, FL 32937\nLeaders:\nJason Giraulo and Phil Lintereur\nParticipant Limit:\n15\nAccessibility:\nAccessible rest rooms at park. Walking required over sand, unpaved trails, and board walk.\nAdditional Site Information:\nhttps://www.indianharbourbeach.org/Facilities/Facility/Details/Gleason-Park-5\nSnowy Plover at Jetty Park\nGulls and Other Waterbirds at Jetty Park\nSOLD OUT\nDon’t miss out on this fun opportunity to spend time in the field with gull expert Amar Ayyash. Lush vegetated dunes give way to a wide shoreline where all types of beach birds gather. Several species of gulls and terns, shorebirds and even wading birds feed in the surf. This natural habitat provides a pleasant backdrop to compare plumages and age classes of several gull species. We’ll look for gannets, loons and other occasional visitors such as a jaegers, especially if shrimp boats are out.\nPrice:\n$60\nDate:\nFriday, Jan 24\nTime:\n8:00 a.m. – 12:00 p.m.\nType:\nMeet your guides at 7:45 at the Radisson in front of the Expo Hall for car pooling and to receive your Jetty Park passes.\nArrival Details:\nCarpool to Jetty Park: 400 Jetty Park Drive, Cape Canaveral, FL 32920. Follow Jetty Park Rd to the first paved parking lot. Meet in front of the changing rooms. Estimated 6 minutes from the Radisson at the Port.\nLeaders:\nAmar Ayyash, Sierra Mayer\nParticipant Limit:\n20\nAccessibility:\nWalking required on trails and in sand. Restrooms available\nAdditional Site Information\n:\nhttps://www.portcanaveral.com/Recreation/Jetty-Park-Beach-Pier\nReddish Egret on Black Point Wildlife Drive\nBeginning Birding Field Trip at MINWR –\nFriday SOLD OUT\nJoin Kim for an intimate morning of instruction and observation along the highly acclaimed Black Point Wildlife Drive where there will be birds galore. She will provide helpful hints for beginners such as where to find birds, interesting behaviors, and identification tricks of the birding trade. We will see how the reddish egret dances for its food while the Little Blue Heron simply stalks its food. The large flocks of white birds will become familiar to you as Great Egrets, Snowy Egrets, White Ibis, Woodstorks and White Pelicans. Shallow impoundments filled with wading birds will offer opportunities to differentiate between egrets and herons. Birding is far more than a hobby. It is an open door to the world of nature, a touch point that connects people to the outdoors.\nPrice:\n$35\nDate:\nFriday, January 26\nTime:\n8:00 a.m. – 11:30 a.m.\nType:\nMeet on site.\nArrival Details:\nMeet at the Parrish Park boat ramp parking (under the Max Brewer Bridge) to board a small bus at 7:45. Estimated 35 minutes from the Radisson at the Port.\nLeader:\nKimberly King-Wrenn\nParticipant Limit:\n12\nAccessibility:\nMust be able to get on and off of bus. Some walking on flat packed roads. Restrooms available at the Visitor Center and midway through the Black Point Wildlife Drive.\nAdditional Site Information\n:\nhttps://www.fws.gov/refuge/merritt-island\nFlorida Wildlife Hospital Photo Shoot\nThis trip provides a great opportunity for photographers who want to work on their wildlife photography skills. Florida Wildlife Hospital has a spot on property where they can have their animal ambassadors perch and climb while participants take photos of the animals. You will be able to play with focal lengths, apertures, etc. with a bird that isn’t going to fly off or animal that won’t disappear into the brush.\nThis trip is not not suitable for young children as it is mostly staying in one spot while participants play with camera settings and take photos. Florida Wildlife Hospital will try to bring 4 animals out and give participant about 15 minutes with each animal.\nNote that you will NOT be posing or coming into contact in any way with the animals. This is strictly a opportunity to practice your wildlife photography in a controlled environment.\nPrice:\n$ 25.00, a portion of which is donated back to the hospital.\nDate:\nFriday, January 24\nTime:\n8:00 – 9:30 a.m.\nType:\nMeet on site\nArrival Details:\nArrive at 7:45 at Florida Wildlife Hospital, 4560 N. U.S. Highway 1, Palm Shores, FL 32935. Please park in the church parking lot just to the North of the hospital (look for the big red cross).\nLeaders:\nSteve Ingraham\nParticipant Limit:\n10\nAccessibility:\nThe photography spot is on the back of the property and requires walking on uneven surfaces.\nAdditional Site Information:\nhttps://floridawildlifehospital.org/\nPrairie Warbler at Turkey Creek Sanctuary\nTurkey Creek Sanctuary SOLD OUT\nJoin us for a walk through this 130 acre park. Over 30 species of warblers have been seen here, and there is also the opportunity to see manatees, alligators, Florida cooters as well as fish, otters, and other birds including ospreys, owls and hawks.\nPrice:\n$25\nDate:\nFriday, Jan 24\nTime:\n8:30 a.m. – 11:00 a.m.\nType:\nMeet on site.\nArrival Details:\nMeet at 1518 Port Malabar Blvd NE, Palm Bay at 8:15.\nLeaders:\nCharlie Venuto, David Trently\nParticipant Limit:\n20\nAccessibility:\nRestrooms on site. Walking on combination of trails and board walk.\nAdditional Site Information:\nhttps://www.palmbayflorida.org/Home/Components/FacilityDirectory/FacilityDirectory/86/1647\nBlack and White Warbler at Sams House\nWinter Waders, Warblers & Waterfowl at Sams House\nSOLD OUT\nMerritt Island is the wintering destination for numerous species of birds. From waders to warblers, the Sams House property offers birders a wide variety of habitats and bird species to be found. We will take a leisurely stroll around the property looking, and listening, for wintering songbirds like Warblers, Hermit Thrush, Ruby-crowned Kinglets, and Yellow-bellied Sapsucker, then take a brief hike to the mangroves and Indian River Lagoon looking for gulls, terns, pelicans, and waterfowl. Join us as we experience the birding, the beauty, and the biodiversity of the Sams House property. Following our morning birding adventure please enjoy a brief personal tour of the 1875 cabin and 1888 house.\nPrice:\n$25\nDate:\nFriday, Jan 24\nTime:\n8:30 a.m. – 11:00 a.m.\nType:\nMeet on site\nArrival Details:\nMeet at Sams House at Pine Island Conservation Area, 6195 N. Tropical Trail, Merritt Island, FL. Estimated 33 minutes from the Radisson at the Port.\nLeaders:\nChip Clouse, Mariah Hryniewich\nParticipant Limit:\n20\nAccessibility:\nRestrooms available. Walking required on unpaved trails. Closed toe shoes, sunscreen, and mosquito repellant are advised.\nAdditional Site Information\n:\nhttps://www.brevardfl.gov/EELProgram/Sanctuaries/SamsHouse\nMangrove Tree Crab\nMullet Head Island Kayak Trip at MINWR – Friday Trip 1\nSOLD OUT\nJoin Rebecca Chapman from Springs to Sea Old Florida Eco Tours for a 2 hour kayak trip to the protected rookery known as Mullet Head Island (also known as “Bird Island”.) Paddle to an uninhabited island or through a maze of twisted mangrove forests in the Coastal Wildlife Kayak Tour. As you glide through the shallow lagoon of a wildlife refuge, keep your eyes peeled for playful dolphins, gentle manatees, colorful flamingos, and a whole cast of slippery stingrays and wading birds. This is your chance to get up close and personal with the wildest coastal critters! Our stops along this tour may include Bird Island (wind-dependent), a mangrove forest, known manatee observation areas, or shallow flats teeming with rays, hermit crabs, and mullet!\nNote: No children under 4 years old are allowed on this trip.\nPrice:\n$60.00\nDate:\nFriday, Jan 24\nTime:\n9:00 a.m. – 11:00 a.m.\nType:\nMeet on site\nArrival Details:\nMeet at 8:45 at the NW Haulover Canal Kayak Launch in the Merritt Island National Wildlife Refuge.\nLeaders:\nRebecca Chapman\nParticipant Limit:\n8\nAccessibility:\nThis activity may not be suitable for guests with certain back and shoulder conditions. There is a weight limit of 250 lbs per guest.\nAdditional Site Information:\nhttps://springstosea.com/\nFlorida Wildlife Hospital Tour\nFor this tour, Florida Wildlife Hospital staff will walk you through the building and tell you about the history of the hospital and how our hospital is setup. You will walk past the outdoor pre-release enclosures so you can see more of the 5-acre property. Please note that you will NOT see wildlife on this tour – it is illegal for the hospital to exhibit the wildlife that is being rehabilitated. But you will get to see some behind the scenes and how the property is laid out and hear about how the wildlife hospital helps wildlife.\nThis tour is not appropriate for children.\nPrice:\n$ 25.00, a portion of which is donated back to the hospital.\nDate:\nFriday, January 24\nTime:\n10:00 – 11:30 a.m.\nType:\nMeet on site\nArrival Details:\nArrive at 9:45 at Florida Wildlife Hospital, 4560 N. U.S. Highway 1, Palm Shores, FL 32935. Please park in the church parking lot just to the North of the hospital (look for the big red cross).\nLeaders:\nSteve Ingraham\nParticipant Limit:\n10\nAccessibility:\nThe photography spot is on the back of the property and requires walking on uneven surfaces.\nAdditional Site Information:\nhttps://floridawildlifehospital.org/\nSnail Kite\nAirboat birding along the St. Johns – Friday Trip 1\nSOLD OUT\nYou will enjoy the exclusive combination of Captain Mike, a fifth generation Floridian who grew up here on the river, and a professional birding tour guide and other birders on this exclusive small personal tour. You will glide along marshes and into a secluded cypress swamp to view an abundance of wading birds, waterfowl and raptors on this special adventure. This is optimal habitat for Snail Kites, Crested Caracaras, and Bald Eagles. In fact, 25 Bald Eagles were observed on just one trip in 2020. The St Johns River floodplain is only accessible by airboat due to the shallow depth. Your guides will point out the habitats and ongoing activity of the many species that are found here. Other wildlife, including alligators, may be encountered. This is a great opportunity for birders who prefer to avoid strenuous walking or hiking. Airboat Tours are hosted by A St. Johns River Airboat Tours LLC in Titusville, FL\nPrice:\n$90\nDate:\nFriday, Jan 24\nTime:\n10:00 a.m. – 11:30 a.m.\nType:\nMeet on site.\nArrival Details:\nArrive by 9:45 a.m. at the Highway 50 Boat Ramp, 28500 East Colonial Drive, Christmas. Estimated 29 minutes from the Radisson at the Port.\nLeader:\nKelly Smith\nParticipant Limit:\n5\nAccessibility:\nYou must be able to get up into high seats on the airboat. No restroom facility on site.\nAdditional Site Information\n:\nhttps://stjohnsairboatour.com/\nTour of Veterans Memorial Park “Smart” Rain Garden – Friday\nDiscover the newly enhanced Veterans Memorial Park, a cherished community space that harmoniously blends natural beauty with innovative technology improving resilience for the City of Cape Canaveral. The park recently underwent a transformative upgrade made possible by a $1 million National Science Foundation CIVIC Challenge grant.\nThe focus of this tour will be the new “Smart” Rain Garden, a sophisticated bioswale system monitored by a network of remote sensors and capable of holding 150,000 gallons of stormwater filtered by nearly 1,000 Florida-friendly and native plants which create a thriving habitat for local pollinators.\nJoin us under majestic oak trees, including one unique specimen over 250 years old, to observe butterflies and bees while learning more about this example of green stormwater infrastructure. Veterans Memorial Park provides a model for how urban spaces can mitigate flood risks and protect water quality, while also providing vital natural areas for community members – wildlife and humans alike.\nPrice:\n$ 10.00\nDate:\nWednesday, Jan 22\nTime:\n10:00 a.m. – 11:00 a.m.\nType:\nMeet on site\nArrival Details:\nMeet at 9:45 at the Cape Canaveral Library, 201 Polk Ave, Cape Canaveral, FL.\nLeaders:\nAmy Reaume, TBD\nParticipant Limit:\n20\nAccessibility:\nRestrooms and water are available at the neighboring Cape Canaveral library. The rain garden can be viewed from surrounding sidewalks. Visitors who would like to go down into the rain garden which has uneven terrain (a slope and rocks) should wear closed toed shoes.\nAdditional Site Information:\nhttps://blogs.ifas.ufl.edu/brevardco/2024/10/30/smart-rain-garden-series-veterans-memorial-park-location/\nCrested Caracara\nAirboat Birding Along the St. Johns – Friday Trip 2\nSOLD OUT\nYou will enjoy the exclusive combination of Captain Mike, a fifth generation Floridian who grew up here on the river, and a professional birding tour guide and other birders on this exclusive small personal tour. You will glide along marshes and into a secluded cypress swamp to view an abundance of wading birds, waterfowl and raptors on this special adventure. This is optimal habitat for Snail Kites, Crested Caracaras, and Bald Eagles. In fact, 25 Bald Eagles were observed on just one trip in 2020. The St Johns River floodplain is only accessible by airboat due to the shallow depth. Your guides will point out the habitats and ongoing activity of the many species that are found here. Other wildlife, including alligators, may be encountered. This is a great opportunity for birders who prefer to avoid strenuous walking or hiking. Airboat Tours are hosted by A St. Johns River Airboat Tours LLC in Titusville, FL\nPrice:\n$90\nDate:\nFriday, Jan 24\nTime:\n12:00 p.m. – 1:30 p.m.\nType:\nMeet on site.\nArrival Details:\nArrive by 11:45 a.m. at the Highway 50 Boat Ramp, 28500 East Colonial Drive, Christmas. Estimated 29 minutes from the Radisson at the Port.\nLeader:\nJulia Wiggins\nParticipant Limit:\n5\nAccessibility:\nYou must be able to get up into high seats on the airboat. No restroom facility on site.\nAdditional Site Information\n:\nhttps://stjohnsairboatour.com/\nAmerican White Pelican\nMullet Head Island Kayak Trip at MINWR – Friday Trip 2\nJoin Rebecca Chapman from Springs to Sea Old Florida Eco Tours for a 2 hour kayak trip to the protected rookery known as Mullet Head Island (also known as “Bird Island”.) Paddle to an uninhabited island or through a maze of twisted mangrove forests in the Coastal Wildlife Kayak Tour. As you glide through the shallow lagoon of a wildlife refuge, keep your eyes peeled for playful dolphins, gentle manatees, colorful flamingos, and a whole cast of slippery stingrays and wading birds. This is your chance to get up close and personal with the wildest coastal critters! Our stops along this tour may include Bird Island (wind-dependent), a mangrove forest, known manatee observation areas, or shallow flats teeming with rays, hermit crabs, and mullet!\nNote: No children under 4 years old are allowed on this trip.\nPrice:\n$60.00\nDate:\nFriday, Jan 24\nTime:\n12:00 p.m. – 2:00 p.m.\nType:\nMeet on site\nArrival Details:\nMeet at the NW Haulover Canal Kayak Launch in the Merritt Island National Wildlife Refuge.\nLeaders:\nRebecca Chapman\nParticipant Limit:\n8\nAccessibility:\nThis activity may not be suitable for guests with certain back and shoulder conditions. There is a weight limit of 250 lbs per guest.\nAdditional Site Information:\nhttps://springstosea.com/\nDouble-crested Cormorant\nBlue Dolphin Ultimate Boat Birding and Wildlife Journey – Friday\nThe Blue Dolphin is a 49-passenger Coast Guard approved pontoon boat operated by Mark and Michele Anderson. This four-hour adventure will start at Kelly Park East, which is just 6 minutes from the Radisson Resort. We will cross the Banana River, pass through the Canaveral Locks and into Port Canaveral where you may see the Space X fleet of rocket recovery ships and plenty of birds! In addition, you are likely to see dolphins. A flock of American White Pelicans is normally seen at the entrance to the locks and during the cruise you will see Ospreys and other raptors, Wood Storks, Northern Gannets, pelicans, cormorants, gulls, terns and lots of egrets and herons. Past trips have produced such uncommon visitors as Common Eider, Magnificent Frigatebird Sabine’s Gull and Common Loon. We are looking forward to seeing you aboard the Blue Dolphin.\nPrice:\n$100 includes snack, water and boxed lunch.\nDate:\nFriday, Jan 24\nTime:\n1:00 p.m. – 5:00 p.m.\nType:\nMeet on site\nArrival Details:\nArrive at 12:45 p.m. at Kelly Park East, 2550 N. Banana River Drive, Merritt Island. Estimated 7 minutes from the Radisson at the Port.\nLeaders:\nGina Kent, Greg Miller\nParticipant Limit:\n46\nAccessibility:\nHandicapped Accessible. Rest room on boat. Sunscreen is recommended.\nAdditional Site Information\n:\nhttps://www.spacecoastrivertours.com/index.html\nImmature Bald Eagle\nAirboat Birding Along the St. Johns – Friday Trip 3\nSOLD OUT\nYou will enjoy the exclusive combination of Captain Mike, a fifth generation Floridian who grew up here on the river, and a professional birding tour guide and other birders on this exclusive small personal tour. You will glide along marshes and into a secluded cypress swamp to view an abundance of wading birds, waterfowl and raptors on this special adventure. This is optimal habitat for Snail Kites, Crested Caracaras, and Bald Eagles. In fact, 25 Bald Eagles were observed on just one trip in 2020. The St Johns River floodplain is only accessible by airboat due to the shallow depth. Your guides will point out the habitats and ongoing activity of the many species that are found here. Other wildlife, including alligators, may be encountered. This is a great opportunity for birders who prefer to avoid strenuous walking or hiking. Airboat Tours are hosted by A St. Johns River Airboat Tours LLC in Titusville, FL\nPrice:\n$90\nDate:\nFriday, Jan 24\nTime:\n2:00 p.m. – 3:30 p.m.\nType:\nMeet on site.\nParticipant Limit:\n5\nArrival Details:\nArrive by 1:45 p.m. at the Highway 50 Boat Ramp, 28500 East Colonial Drive, Christmas. Estimated 29 minutes from the Radisson at the Port.\nLeader:\nJulia Wiggins\nParticipant Limit:\n5\nAccessibility:\nYou must be able to get up into high seats on the airboat. No restroom facility on site.\nAdditional Site Information\n:\nhttps://stjohnsairboatour.com/\nAmerican Flamingo\nMullet Head Island Kayak Trip at MINWR – Friday Trip 3\nJoin Rebecca Chapman from Springs to Sea Old Florida Eco Tours for a 2 hour kayak trip to the protected rookery known as Mullet Head Island (also known as “Bird Island”.) Paddle to an uninhabited island or through a maze of twisted mangrove forests in the Coastal Wildlife Kayak Tour. As you glide through the shallow lagoon of a wildlife refuge, keep your eyes peeled for playful dolphins, gentle manatees, colorful flamingos, and a whole cast of slippery stingrays and wading birds. This is your chance to get up close and personal with the wildest coastal critters! Our stops along this tour may include Bird Island (wind-dependent), a mangrove forest, known manatee observation areas, or shallow flats teeming with rays, hermit crabs, and mullet!\nNote: No children under 4 years old are allowed on this trip.\nPrice:\n$60.00\nDate:\nFriday, Jan 24\nTime:\n3:00 p.m. – 5:00 p.m.\nType:\nMeet on site\nArrival Details:\nMeet at 2:45 at the NW Haulover Canal Kayak Launch in the Merritt Island National Wildlife Refuge.\nLeaders:\nRebecca Chapman\nParticipant Limit:\n8\nAccessibility:\nThis activity may not be suitable for guests with certain back and shoulder conditions. There is a weight limit of 250 lbs per guest.\nAdditional Site Information:\nhttps://springstosea.com/\nGreat Horned Owl\nOwls and Rails of MINWR\nSOLD OUT\nJoin Mitchell, Tom and Renee for an evening out in search of the denizens of the dark at Merritt Island National Wildlife Refuge. We’ll search the marshes and hammocks for Great Horned, Screech, Barred and possibly Short-eared Owl. Before we begin our search for owls, we will spend some time along the marshes of Peacock’s Pocket a small bay-like feature of the Indian River Lagoon near where it joins with Banana Creek listening for rails. In the past we’ve had good luck with King, Clapper, Virginia and Black Rail in these marshes. So, if you are interested in nocturnal birds, just bring your sense of curiosity and a flashlight or two.\nPrice:\n$65\nDate:\nFriday, Jan 24\nTime:\n4:00 p.m. – 8:30 p.m.\nType:\nMeet on site\nArrival Details:\nMeet Up at the Parrish Park Boat Ramp Parking Lot — 1 A. Max Brewer Causeway, Titusville on the north side of the parking lot by the picnic pavilions. Estimated 33 minutes from the Radisson at the Port.\nLeaders:\nMitchel Harris, Tom Ledford\nParticipant Limit:\n10\nAccessibility:\nThere are restrooms nearby at the east end of Parrish Park. There are no restrooms available out on the refuge dikes or trails. Walking on unpaved trails required.\nAdditional Site Information\n:\nhttps://www.fws.gov/refuge/merritt-island\nSaturday, January 25\nCentral Florida Specialties\nLearn Wildlife Photography at Helen and Allan Cruickshank Sanctuary\nHistory of Canaveral National Seashore Tour\nAirboat Birding Along the St. Johns – Saturday Early\nMalabar Scrub Sanctuary\nGulling Adventure for Landlubbers\nEnchanted Forest Sanctuary Day Hike – Saturday\nEasy Bird & Wildlife Photography with Sony Mirrorless Cameras at Orlando Wetlands\nSmyrna Dunes Park\nMullet Head Island Kayak Trip at MINWR – Saturday Trip 1\nPlein Air Nature Drawing at Maritime Hammock Preserve\nHorseshoe Crabs Titusville Causeway-More than Just Shorebirds\nYoung Birders Event\nGull Fly-In at Daytona Beach Shores\nAirboat birding along the St. Johns – Saturday Trip 1\nTour of Veterans Memorial Park “Smart” Rain Garden – Saturday\nAirboat Birding Along the St. Johns – Saturday Trip 2\nMullet Head Island Kayak Trip at MINWR – Saturday Trip 2\nBeach Birds Boat Trip on the Halifax River\nAirboat Birding Along the St. Johns – Saturday Trip 3\nMullet Head Island Kayak Trip at MINWR – Saturday Trip 3\nNocturnal Nature Hike at Enchanted Forest Sanctuary\nAmerican Kestrel\nCentral Florida Specialties\nSOLD OUT\nA pre-dawn start at Three Lakes WMA will target Red-cockaded Woodpeckers, Bachman’s Sparrows, Brown-headed Nuthatches, Pine Warblers and Eastern Bluebirds. Next stop is Lake Marian Marina to look for Osprey, Bald Eagle, Spoonbill, Limpkin, possible Dowitchers, Yellowlegs, Pelicans, Snail kite, and other lake species. Next destination is Joe Overstreet Road to search for Red-headed Woodpeckers. Along the road we will look for Eastern Meadowlarks, Savannah Sparrows, Caracara, and possibly even a Scissor-tailed Flycatcher. Our last destination is Brownie Wise Park where we till look for Painted bunting, Snail kite, warblers, Limpkin, nesting Bald Eagles, Vermilion Flycatcher, and the Grove-billed Ani if it is still in the area.\nPrice:\n$145 includes a snack sack and box lunch.\nDate:\nSaturday, Jan 25\nTime:\n5:00 a.m. – 4:00 p.m.\nType:\nBus\nDeparture Details:\nMeet at 4:45 in front of the Radisson hotel lobby to board the bus.\nLeaders:\nBrady Bailo, Tom Ledford, Chris Newton, Gallus Quigley\nParticipant Limit:\n32\nAccessibility:\nRestroom stops will be made en route. Some walking required on paved and unpaved trails.\nAdditional Site Information\n:\nhttps://myfwc.com/recreation/lead/three-lake\ns/\nhttps://lakemarianresort.com/facilities/\nhttps://www.osceola.org/Community/Parks-and-Public-Lands/Find-a-Park-Facility-or-Conservation-Area/Tupperware-Island-Conservation-Area-Brownie-Wise-Park\nCedar Waxwings, Cruickshank Sanctuary\nLearn Wildlife Photography at Helen and Allan Cruickshank Sanctuary\nLocated in Rockledge, the Helen and Allan Cruickshank Sanctuary is a 140-acre preserve known for its excellent birdwatching and photography opportunities. The sanctuary’s diverse habitats, including scrub, flatwoods, and wetlands, attract a variety of bird species such as Florida scrub-jays, red-shouldered hawks, and woodpeckers This environment is perfect for learning how to control exposure with confidence and to optimize your camera setting for stunning photos\nNote:\nTo ensure that you get the most from this trip, the field trip leader will contact you at the email address that you used to register for the festival to discuss what type of camera you will be bringing and your current level of photography experience.\nPrice:\n$65\nDate:\nSaturday, Jan 25\nTime:\n8:00 – 11:30 a.m.\nType:\nMeet on site\nArrival Details:\nMeet at 7:20 at the Helen & Alan Cruickshank Sanctuary, 360 Barnes Blvd, Rockledge, FL. Estimated 25 minutes from the Radisson at the Port.\nLeaders:\nJason Giraulo and Phil Lintereur\nParticipant Limit:\n10\nAccessibility:\nNo rest rooms on site. Walking on unpaved trails required.\nBlack Skimmer\nSmyrna Dunes Park\nSOLD OUT\nThis spectacular beachside park at Ponce Inlet offers panoramic views of the ocean, inlet and estuary as well as the opportunity to get close looks at gulls, terns and shorebirds. Take a leisurely two-mile walk via boardwalk over pristine coastal dune habitat (watch for Gopher Tortoises) and along the shoreline. Brown and American White Pelicans, Black Skimmers, Common Loons, cormorants and numerous species of gulls and terns are found here and there is always a chance to discover a rare gull. Up to twenty species of shorebirds are possible, including American Oystercatchers, Piping and Wilson’s Plovers, Purple Sandpipers and Red Knots. Bait fish activity at the inlet’s mouth attracts sea birds, especially Northern Gannets. Passerines are possible in the hammocks.\nPrice:\n$35 plus $10.00 entrance fee that must be paid going into park.\nDate:\nSaturday, Jan 25\nTime:\n8:00 a..m. – 11:30 a.m.\nType:\nMeet on site\nArrival Details:\nMeet Up at Smyrna Dunes Park,2995 N. Peninsula Ave., New Smyrna Beach. Estimated 68 minutes from the Radisson at the Port.\nLeaders:\nEd Carlson, John Kendall\nParticipant Limit:\n20\nAccessibility:\nRestrooms at the trailhead. Two-mile walk on boardwalk.\nAdditional Site Information\n:\nhttps://www.volusia.org/services/public-works/coastal-division/coastal-parks/smyrna-dunes-park.stml\nHistory of Canaveral National Seashore Tour\nCanaveral National Seashore isn’t just for the birds! Come join this tour to learn about the history of the first natives Floridians, the pioneers that came later, and the growing space industry. Stops on this tour include the historic Seminole Rest site, the Eldora Community, and the Canaveral National Seashore Apollo Beach Visitor Center.\nPrice:\n$ 90.00\nDate:\nSaturday, Jan 25\nTime:\n8:00 a.m. – 12:00 p.m.\nType:\nBus\nDeparture Details:\nMeet at 7: 45 a.m. in front of the Radisson hotel lobby to board the bus.\nLeaders:\nJabez Coggan, Ashley Lord, Wesley Homoya, Laura Henning, John Stiner\nParticipant Limit:\n21\nAccessibility:\nRestrooms available at all stops.\nAdditional Site Information\n:\nhttps://www.nps.gov/cana/learn/historyculture/seminole.htm\nhttps://www.nps.gov/cana/learn/historyculture/eldora.htm\nhttps://www.nps.gov/cana/planyourvisit/visitorcenters.htm\nYoung or Female Blue-ringed Dancer at Orlando Wetlands\nEasy Bird & Wildlife Photography with Sony Mirrorless Cameras at Orlando Wetlands\nBird and wildlife photography will never be easy but we don’t have to make it any harder than it is.There is no need to shoot in manual and RAW. If you learn how your camera works and trust it for focus and exposure, it will leave you free to find and frame the birds and wildlife you want to photograph. Using the newer Sony mirrorless cameras  as an example, I will show you how to bring back consistently satisfying images of birds and wildlife.\nPrice:\n$65\nDate:\nSaturday, Jan 24\nTime:\n8:30 a.m. – 11:30 a.m.\nType:\nMeet on site\nArrival Details:\nMeet in the parking area for the Orlando Wetlands Park.\nLeader:\nStephen Ingraham\nParticipant Limit:\n10\nAccessibility:\nWalking on possibly uneven/unpaved trails. Restrooms available at visitors center, but not on trails.\nAdditional Site Information\n:\nhttps://www.orlando.gov/Our-Government/Departments-Offices/Public-Works/Water-Reclamation-Division/Orlando-Wetlands\nImmature American Bald Eagle\nAirboat Birding Along the St. Johns – Saturday Early Trip\nSOLD OUT\nYou will enjoy the exclusive combination of Captain Mike, a fifth generation Floridian who grew up here on the river, and a professional birding tour guide and other birders on this exclusive small personal tour. You will glide along marshes and into a secluded cypress swamp to view an abundance of wading birds, waterfowl and raptors on this special adventure. This is optimal habitat for Snail Kites, Crested Caracaras, and Bald Eagles. In fact, 25 Bald Eagles were observed on just one trip in 2020. The St Johns River floodplain is only accessible by airboat due to the shallow depth. Your guides will point out the habitats and ongoing activity of the many species that are found here. Other wildlife, including alligators, may be encountered. This is a great opportunity for birders who prefer to avoid strenuous walking or hiking. Airboat Tours are hosted by A St. Johns River Airboat Tours LLC in Titusville, FL\nPrice:\n$90\nDate:\nSaturday, Jan 25\nTime:\n8:30 a.m. – 10:00 a.m.\nType:\nMeet on site.\nArrival Details:\nArrive by 8:15 a.m. at the Highway 50 Boat Ramp, 28500 East Colonial Drive, Christmas. Estimated 29 minutes from the Radisson at the Port.\nLeader:\nKelly Smith\nParticipant Limit:\n5\nAccessibility:\nYou must be able to get up into high seats on the airboat. No restroom facility on site.\nAdditional Site Information\n:\nhttps://stjohnsairboatour.com/\nGopher Tortoise at Enchanted Forest\nEnchanted Forest Sanctuary Day Hike – Saturday\nSOLD OUT\nJoin the staff at the Enchanted Forest Sanctuary, where the Environmentally Endangered Lands (EELs) program all started, to enjoy a guided hike through multiple habitats on and off the marked trails. Staff will be in front of the nature center for an introduction to the Enchanted Forest before the hike. There will be possible opportunities to see and/or hear different species of birds from Pileated Woodpeckers, warblers, flyover ducks and wading birds (Roseate Spoonbills, Black-bellied Whistling-Ducks, herons, egrets and more.), Red-shouldered Hawks, owls and more. You never know what you may see in the Enchanted Forest.\nPrice:\n$25\nDate:\nSaturday, Jan 25\nTime:\n8:30 a.m. – 10:45 a.m.\nType:\nMeet on site\nArrival Details:\nMeet at the Enchanted Forest Sanctuary, 444 Columbia Blvd., Titusville. Estimated 25 minutes from the Radisson at the Port.\nLeaders:\nSerge Arais, TBD\nParticipant Limit:\n20\nAccessibility:\nRestrooms are available in the nature center. The nature center and the immediate area are handicapped accessible the trails are not.\nAdditional Site Information\n:\nhttps://www.brevardfl.gov/EELProgram/Sanctuaries/EnchantedFores\ntSanctuary\nLaughing and Ring-billed Gulls at the Cocoa Landfill\nGulling Adventure for Landlubber\ns SOLD OUT\nWe will visit Brevard County’s Central Disposal Facility aka Cocoa Landfill where experts will help you learn to separate different species and age classes among the 20,000+ gulls that gather here.  Hundreds of Herring and Lesser Black-backed Gulls join the thousands of Laughing and Ring-billed Gulls.  Among them we may find rarities such as Iceland, Glaucous, maybe California or others.  In addition to the gulls we will see dozens of Wood Storks, hundreds of vultures, White Ibis, grackles, cowbirds, and blackbirds.  Bald Eagles come in to feed on the various birds, offering excellent photo ops.  We will continue to Port Canaveral to lunch at Fishlips Waterfront Bar and Grill where we can observe gulls, terns, pelicans, and more while dining on the waterfront.  Jetty Park is our last destination where we will see what gulls have stayed on the coast and maybe also see Gannets, loons, an eider or Purple Sandpiper.\nPrice:\n$125, incudes snack. In addition, you should bring money for lunch at Fishlips Waterfront Bar and Grill.\nDate:\nSaturday, Jan 25\nTime:\n8:30 a.m. – 3:00 p.m.\nType:\nBus\nDeparture Details:\nMeet at 8:15 a.m. in front of the Radisson hotel lobby to board the bus.\nLeaders:\nBert Alm, David Simpson, Amar Ayyash\nParticipant Limit:\n22\nAccessibility:\nRestrooms available at all stops. Walking on trails and sand required.\nAdditional Site Informatio\nn:\nhttps://www.brevardfl.gov/SolidWaste/Facilities/CentralDisposalFacility\nhttps://www.portcanaveral.com/Recreation/Jetty-Park-Beach-Pier\nhttps://www.fishlipswaterfront.com\nGopher Tortoise at Malabar Scrub Sanctuary\nMalabar Scrub Sanctuary\nJoin us in this EEL (Environmentally Endangered Land) property where you might see Florida scrub-jays, gopher tortoises, and other wildlife. There are many different protected habitats in this park including scrub, xeric hammock, flatwoods, hardwood swamp, ponds and depression marshes.\nPrice:\n$25\nDate:\nSaturday, Jan 25\nTime:\n8:30 a.m. – 11:00 a.m.\nType:\nMeet on site.\nArrival Details:\nMeet at 1501 Malabar Woods Blvd., Malabar at 8:15. Approximately 48 min (30.4 miles) from the Radisson at the Port.\nLeaders:\nWill Johnson\nParticipant Limit:\n20\nAccessibility:\nRestrooms on site. A wide, paved path bisects the park, making it accessible to all.\nAdditional Site Information:\nhttps://www.brevardfl.gov/EELProgram/Sanctuaries/MalabarScrubSanctuary\nMangrove Tree Crab\nMullet Head Island Kayak Trip at MINWR – Saturday Trip 1\nJoin Rebecca Chapman from Springs to Sea Old Florida Eco Tours for a 2 hour kayak trip to the protected rookery known as Mullet Head Island (also known as “Bird Island”.) Paddle to an uninhabited island or through a maze of twisted mangrove forests in the Coastal Wildlife Kayak Tour. As you glide through the shallow lagoon of a wildlife refuge, keep your eyes peeled for playful dolphins, gentle manatees, colorful flamingos, and a whole cast of slippery stingrays and wading birds. This is your chance to get up close and personal with the wildest coastal critters! Our stops along this tour may include Bird Island (wind-dependent), a mangrove forest, known manatee observation areas, or shallow flats teeming with rays, hermit crabs, and mullet!\nNote: No children under 4 years old are allowed on this trip.\nPrice:\n$60.00\nDate:\nSaturday, Jan 25\nTime:\n9:00 a.m. – 11:00 a.m.\nType:\nMeet on site\nArrival Details:\nMeet at 8:45 at the NW Haulover Canal Kayak Launch in the Merritt Island National Wildlife Refuge.\nLeaders:\nRebecca Chapman\nParticipant Limit:\n8\nAccessibility:\nThis activity may not be suitable for guests with certain back and shoulder conditions. There is a weight limit of 250 lbs per guest.\nAdditional Site Information:\nhttps://springstosea.com/\nWhite-eyed Vireo, Maritime Hammock Preserve\nPlein Air Nature Drawing at Maritime Hammock Preserve SOLD OUT\nOn this field trip you will learn the basics of drawing live in nature with artist and art teacher Jessica Sodano. You will receive supplies including a sketch pad and pencils that you get to take home to continue practicing. At Maritime Hammock you will see birds, flowers and many other interesting subjects to draw.\nPrice:\n$25\nDate:\nSaturday, Jan 25\nTime:\n9:00-11:00 a.m.\nType:\nMeet on Site\nArrival Details:\nMeet at Maritime Hammock Preserve (1235 N Atlantic Ave, Cocoa Beach, FL 32931) at 9:00 a.m.  There is parking in the Denny’s lot.\nIMPORTANT:\nThere is a similarly named Maritime Hammock Sanctuary, but that is miles away and NOT the correct park. Make sure you enter the correct address into your GPS.\nLeader:\nJessica Sodano\nParticipant Limit:\n12\nAccessibility:\nWalking on clearly marked but unpaved trails. There are no rest rooms on the preserve, but there is a nearby Denny’s.\nAdditional Site Information:\nhttps://www.cityofcocoabeach.com/Facilities/Facility/Details/Maritime-Hammock-Preserve-27\nHorseshoe Crab, Titusville\nHorseshoe Crabs Titusville Causeway-More than Just Shorebirds\nSOLD OUT\nThe Horseshoe Crab (Limulus polyphemus) is arguably the most interesting invertebrate on our coast. Horseshoe Crabs were first reported by Spanish explorers here in Florida. Now, development around the Indian River Lagoon watershed is severely impacting this keystone species.  We will visit Florida’s most productive Horseshoe Crab nesting area – the Titusville Causeway and Gator Creek Dike on the Merritt Island National Wildlife Refuge. We will talk about its lifestyle in our estuaries, threats and citizen science to protect it. We’ll review monitoring and restoration proposals for this critical habitat and discuss activities stakeholders have in horseshoe crab habitat protection, including NASA, who is trying to preserve beaches where Horseshoe Crabs nest at the Space Center. The unique conditions that occur in this part of the Indian River Lagoon may reward us with a spawning event. Even if horseshoe crabs are not actively nesting, there’s plenty to see at this very special place.\nPrice:\n$25\nDate:\nSaturday, Jan 25\nTime:\n9:00 a.m. – 11:30 a.m.\nType:\nMeet on site\nArrival Details:\nMeet at the paved parking lot at the entrance to Merritt Island NWR, on the right 0.4 miles east of the A. Max Brewer Causeway bridge. (This is the paved parking on W. Gator Creek Rd where the kiosk is and before the MINWR signs.)  Estimated 34 minutes from the Radisson at the Port.\nLeaders:\nDave Grant, Laurilee Thompson\nParticipant Limit:\n16\nAccessibility:\nRestrooms are available at Parrish Park Boat ramp. Walking on uneven surfaces and sand required.\nAdditional Site Information\n:\nhttps://myfwc.com/research/saltwater/crustaceans/horseshoe-crabs/citizen-watch/\nBird box being used by an Eastern Screech Owl\nYoung Birders Event\nForty lucky Young Birders with their guardians will be treated to a taste of the Space Coast Birding and Wildlife Festival and some birding and fun activities at Jetty Park, Cape Canaveral, thanks to a sponsorship by the Canaveral Port Authority. In this free program, participants and their guardians will break into two groups to do either owl pellet dissection or bird box making, alternating with birding along the jetty and beach. Picnic lunch at the pavilion is included. Afterwards, as an option, visit the Expo Hall at the festival venue, Radisson Resort at the Port, Cape Canaveral, 6 minutes away. At the Expo hall, the Silent Auction features 9 excellent  kids-size binoculars donated by KOWA, retail $118, buy now price $75, in case you want to visit the Expo Hall earlier in the festival.\nPrice:\nFree, but you must\nregister here\nDate:\nSaturday, Jan 25\nTime:\n10:00 a.m. – 2:00 p.m.\nType:\nMeet on site\nArrival Details:\nMeet Up at Jetty Park: 400 Jetty Park Drive, Cape Canaveral, FL 32920. Meet at the Pavilion on your left as you enter, part of the RV Campground.\nLeaders:\nEthan and Brennan Landreville, Melissa Steinberg, Julia Wiggins\nParticipant Limit:\n40\nAccessibility:\nSome walking on trails and in sand. Restrooms available\nAdditional Site Information:\nhttps://www.portcanaveral.com/Recreation/Jetty-Park-Beach-Pier\nQuestions:\nEmail director@scbwa.net\nBonaparte’s Gull\nGull Fly-In at Daytona Beach Shores\nTour the Marine Science Center. Enjoy a picnic lunch at Ponce Inlet Lighthouse Park and walk out to the jetty for shorebirds & gulls. Then board the bus to Frank Rendon Park which is known for the largest congregation of gulls on any beach in the US. This incredible dense array of gulls allows close approach to observe and photograph minute details on each species. Seen consistently here are species that are rare in Florida, including the only record of Vega Gull. Laughing, Franklin, Ring-billed, Herring, Bonaparte’s, Lesser Black-backed, Great Black-backed, Glaucous, Iceland, Thayer’s and California Gulls have all been recorded here. Possible European Herring Gull, Yellow-legged Gull and a Slaty-backed Gull have appeared. This beach is also the best location in Florida to regularly see jaegers from shore. Each evening the gulls leave the beach and settle on the ocean just beyond the breakers. Pomarine and Parasitic Jaegers regularly patrol these huge groups, harassing the gulls.\nPrice:\n$150 includes box lunch and snack.\nDate:\nSaturday, Jan 25\nTime:\n10:00 a.m. – 6:00 p.m.\nType:\nBus\nDeparture Details:\nMeet at 9:45 in front of the Radisson hotel lobby to board the bus.\nLeaders:\nKenn Kaufman, Mitchell Harris, Sharon Stiteler\nParticipant Limit:\n22\nAccessibility:\nRest rooms available at Science Center parks. Walking on unpaved trails and sand. Due to damages sustained from the 2022 Hurricanes, ADA access onto the beach is not currently available.\nAdditional Site Information\n:\nhttps://www.volusia.org/services/public-works/coastal-division/coastal-parks/lighthouse-point-park.stml\nhttps://www.volusia.org/services/public-works/coastal-division/coastal-parks/frank-rendon-park.stml\nSnail Kite\nAirboat birding along the St. Johns – Saturday Trip 1\nSOLD OUT\nYou will enjoy the exclusive combination of Captain Mike, a fifth generation Floridian who grew up here on the river, and a professional birding tour guide and other birders on this exclusive small personal tour. You will glide along marshes and into a secluded cypress swamp to view an abundance of wading birds, waterfowl and raptors on this special adventure. This is optimal habitat for Snail Kites, Crested Caracaras, and Bald Eagles. In fact, 25 Bald Eagles were observed on just one trip in 2020. The St Johns River floodplain is only accessible by airboat due to the shallow depth. Your guides will point out the habitats and ongoing activity of the many species that are found here. Other wildlife, including alligators, may be encountered. This is a great opportunity for birders who prefer to avoid strenuous walking or hiking. Airboat Tours are hosted by A St. Johns River Airboat Tours LLC in Titusville, FL\nPrice:\n$90\nDate:\nSaturday, Jan 25\nTime:\n10:00 a.m. – 11:30 a.m.\nType:\nMeet on site.\nArrival Details:\nArrive by 9:45 a.m. at the Highway 50 Boat Ramp, 28500 East Colonial Drive, Christmas. Estimated 29 minutes from the Radisson at the Port.\nLeader:\nKelly Smith\nParticipant Limit:\n5\nAccessibility:\nYou must be able to get up into high seats on the airboat. No restroom facility on site.\nAdditional Site Information\n:\nhttps://stjohnsairboatour.com/\nTour of Veterans Memorial Park “Smart” Rain Garden – Saturday\nDiscover the newly enhanced Veterans Memorial Park, a cherished community space that harmoniously blends natural beauty with innovative technology improving resilience for the City of Cape Canaveral. The park recently underwent a transformative upgrade made possible by a $1 million National Science Foundation CIVIC Challenge grant.\nThe focus of this tour will be the new “Smart” Rain Garden, a sophisticated bioswale system monitored by a network of remote sensors and capable of holding 150,000 gallons of stormwater filtered by nearly 1,000 Florida-friendly and native plants which create a thriving habitat for local pollinators.\nJoin us under majestic oak trees, including one unique specimen over 250 years old, to observe butterflies and bees while learning more about this example of green stormwater infrastructure. Veterans Memorial Park provides a model for how urban spaces can mitigate flood risks and protect water quality, while also providing vital natural areas for community members – wildlife and humans alike.\nPrice:\n$ 10.00\nDate:\nSaturday, Jan 25\nTime:\n10:00 a.m. – 11:00 a.m.\nType:\nMeet on site\nArrival Details:\nMeet at 9:45 at the Cape Canaveral Library, 201 Polk Ave, Cape Canaveral, FL.\nLeaders:\nAmy Reaume, TBD\nParticipant Limit:\n20\nAccessibility:\nRestrooms and water are available at the neighboring Cape Canaveral library. The rain garden can be viewed from surrounding sidewalks. Visitors who would like to go down into the rain garden which has uneven terrain (a slope and rocks) should wear closed toed shoes.\nAdditional Site Information:\nhttps://blogs.ifas.ufl.edu/brevardco/2024/10/30/smart-rain-garden-series-veterans-memorial-park-location/\nCrested Caracara\nAirboat Birding Along the St. Johns – Saturday Trip 2\nSOLD OUT\nYou will enjoy the exclusive combination of Captain Mike, a fifth generation Floridian who grew up here on the river, and a professional birding tour guide and other birders on this exclusive small personal tour. You will glide along marshes and into a secluded cypress swamp to view an abundance of wading birds, waterfowl and raptors on this special adventure. This is optimal habitat for Snail Kites, Crested Caracaras, and Bald Eagles. In fact, 25 Bald Eagles were observed on just one trip in 2020. The St Johns River floodplain is only accessible by airboat due to the shallow depth. Your guides will point out the habitats and ongoing activity of the many species that are found here. Other wildlife, including alligators, may be encountered. This is a great opportunity for birders who prefer to avoid strenuous walking or hiking. Airboat Tours are hosted by A St. Johns River Airboat Tours LLC in Titusville, FL\nPrice:\n$90\nDate:\nSaturday, Jan 25\nTime:\n12:00 p.m. – 1:30 p.m.\nType:\nMeet on site.\nArrival Details:\nArrive by 11:45 a.m. at the Highway 50 Boat Ramp, 28500 East Colonial Drive, Christmas. Estimated 29 minutes from the Radisson at the Port.\nLeader:\nKelly Smith\nParticipant Limit:\n5\nAccessibility:\nYou must be able to get up into high seats on the airboat. No restroom facility on site.\nAdditional Site Information\n:\nhttps://stjohnsairboatour.com/\nAmerican White Pelican\nMullet Head Island Kayak Trip at MINWR – Saturday Trip 2\nJoin Rebecca Chapman from Springs to Sea Old Florida Eco Tours for a 2 hour kayak trip to the protected rookery known as Mullet Head Island (also known as “Bird Island”.) Paddle to an uninhabited island or through a maze of twisted mangrove forests in the Coastal Wildlife Kayak Tour. As you glide through the shallow lagoon of a wildlife refuge, keep your eyes peeled for playful dolphins, gentle manatees, colorful flamingos, and a whole cast of slippery stingrays and wading birds. This is your chance to get up close and personal with the wildest coastal critters! Our stops along this tour may include Bird Island (wind-dependent), a mangrove forest, known manatee observation areas, or shallow flats teeming with rays, hermit crabs, and mullet!\nNote: No children under 4 years old are allowed on this trip.\nPrice:\n$60.00\nDate:\nSaturday, Jan 25\nTime:\n12:00 p.m. – 2:00 p.m.\nType:\nMeet on site\nArrival Details:\nMeet at 11:45 at the NW Haulover Canal Kayak Launch in the Merritt Island National Wildlife Refuge.\nLeaders:\nRebecca Chapman\nParticipant Limit:\n8\nAccessibility:\nThis activity may not be suitable for guests with certain back and shoulder conditions. There is a weight limit of 250 lbs per guest.\nAdditional Site Information:\nhttps://springstosea.com/\nPiping Plover\nBeach Birds Boat Trip on the Halifax River\nSOLD OUT\nA 4-hour boat trip on the Coast Guard certified 40-passenger pontoon boat, Discovery, will target Disappearing Island on a falling tide, when large concentrations of gulls, terns and shorebirds will be congregating to feed on the exposed sandbar. Disappearing Island is located near the entrance to Ponce Inlet. Other exposed sand bars near the inlet and in the Halifax River will also be visited, if possible. Twenty species of shorebirds are possible here, including American Oystercatchers, Piping and Wilson’s Plovers, Purple Sandpipers and Red Knots. There is always a possibility of finding rarities such as a Glaucous or Iceland Gull among the many gulls that will be seen. Participants on this trip in 2020 saw 14 shorebird species, 5 gull species, 4 tern species, both night-herons and lots of bottlenose dolphins. The Saturday afternoon Beach Birds class will be a great introduction for this trip.\nPrice:\n$85\nDate:\nSaturday, Jan 25\nTime:\n12:00 p.m. – 4:00 p.m.\nType:\nMeet on site\nArrival Details:\nMeet at 11:45 at 116 North Causeway (FL Highway 44), New Smyrna Beach, FL. Park in the grassy field on the right directly across from the Volusia Medical Center.\nImportant:\nDue to an art festival in town that coincides with this trip,  people coming from I95 should take State Route 44 East and bear left at the Canal Street/Business 44 fork.  Take Canal street/Bus 44 to US1 and make a left turn onto US1, a few blocks down make a right at the light on Washington Avenue, this turns into the North Causeway and our boat is located at 116 North Causeway in NSB.  There are signs for MDC boat tour parking.\nOnce you are at the light at Canal Street and US 1 you will see all the excitement of our annual Images Art Festival and the streets will be closed down.  I’d suggest you leave a little extra time for any congestion in the area.\nThose coming from North or South Via US 1 should head EAST on Washington Avenue and follow that to 116 North Causeway.\nLeaders:\nAdam Kent, Gina Kent\nParticipant Limit:\n36\nAccessibility:\nBoat is handicapped accessible. Marine head on board. Bring water, snacks and sunscreen.\nAdditional Site Information\n: https://marinediscoverycenter.org/\nhttps://marinediscoverycenter.org/boat-tours/\nImmature American Bald Eagle\nAirboat Birding Along the St. Johns – Saturday Trip 3\nSOLD OUT\nYou will enjoy the exclusive combination of Captain Mike, a fifth generation Floridian who grew up here on the river, and a professional birding tour guide and other birders on this exclusive small personal tour. You will glide along marshes and into a secluded cypress swamp to view an abundance of wading birds, waterfowl and raptors on this special adventure. This is optimal habitat for Snail Kites, Crested Caracaras, and Bald Eagles. In fact, 25 Bald Eagles were observed on just one trip in 2020. The St Johns River floodplain is only accessible by airboat due to the shallow depth. Your guides will point out the habitats and ongoing activity of the many species that are found here. Other wildlife, including alligators, may be encountered. This is a great opportunity for birders who prefer to avoid strenuous walking or hiking. Airboat Tours are hosted by A St. Johns River Airboat Tours LLC in Titusville, FL\nPrice:\n$90\nDate:\nSaturday, Jan 25\nTime:\n2:00 p.m. – 3:30 p.m.\nType:\nMeet on site.\nArrival Details:\nArrive by 1:45 p.m. at the Highway 50 Boat Ramp, 28500 East Colonial Drive, Christmas. Estimated 29 minutes from the Radisson at the Port.\nLeader:\nJessica Sodano\nParticipant Limit:\n5\nAccessibility:\nYou must be able to get up into high seats on the airboat. No restroom facility on site.\nAdditional Site Information\n:\nhttps://stjohnsairboatour.com/\nAmerican Flamingo\nMullet Head Island Kayak Trip at MINWR – Saturday Trip 3\nJoin Rebecca Chapman from Springs to Sea Old Florida Eco Tours for a 2 hour kayak trip to the protected rookery known as Mullet Head Island (also known as “Bird Island”.) Paddle to an uninhabited island or through a maze of twisted mangrove forests in the Coastal Wildlife Kayak Tour. As you glide through the shallow lagoon of a wildlife refuge, keep your eyes peeled for playful dolphins, gentle manatees, colorful flamingos, and a whole cast of slippery stingrays and wading birds. This is your chance to get up close and personal with the wildest coastal critters! Our stops along this tour may include Bird Island (wind-dependent), a mangrove forest, known manatee observation areas, or shallow flats teeming with rays, hermit crabs, and mullet!\nNote: No children under 4 years old are allowed on this trip.\nPrice:\n$60.00\nDate:\nSaturday, Jan 25\nTime:\n3:00 p.m. – 5:00 p.m.\nType:\nMeet on site\nArrival Details:\nMeet at 2:45 at the NW Haulover Canal Kayak Launch in the Merritt Island National Wildlife Refuge.\nLeaders:\nRebecca Chapman, Will Johnson\nParticipant Limit:\n8\nAccessibility:\nThis activity may not be suitable for guests with certain back and shoulder conditions. There is a weight limit of 250 lbs per guest.\nAdditional Site Information:\nhttps://springstosea.com/\nScreech Owl at the Enchanted Forest\nNocturnal Nature Hike at Enchanted Forest\nSOLD OUT\nWhhoooo… is ready for a nocturnal adventure at the Enchanted Forest Sanctuary? Join Naturalists on a night of discovery and exploration on the trails!  Keep an eye and ear out for owls, bats, flying squirrels, and fireflies.\nPrice:\n$25\nDate:\nSaturday, Jan 25\nTime:\n6:30 p.m. – 8:30 p.m.\nType:\nMeet on site\nArrival Details:\nMeet at 6:15 at the Enchanted Forest Sanctuary, 444 Columbia Blvd., Titusville, FL. Estimated 25 minutes from the Radisson at the Port.\nLeaders:\nJoannie Faulls, TBD\nParticipant Limit:\n20\nAccessibility:\nRestrooms will only be available in the nature center\nprior\nto the hike. The nature center and the immediate area are handicapped accessible; the trail is not. Please wear closed-toe shoes and bring water, bug spray and a flashlight or headlamp, red light strongly preferred.\nAdditional Site Information\n:\nhttps://www.brevardfl.gov/EELProgram/Sanctuaries/EnchantedForestSanctuary\nSunday, January 26\nRecording Bird Calls\nOrlando Wetlands Park Trailer Tour – Sunday\nShorebird Identification Talk and Field Trip\nBeginning Birding Field Trip at MINWR – Sunday\nLearn Wildlife Photography at Jetty Park\nEnchanted Forest Sanctuary Day Hike – Sunday\nBlack Point Wildlife Drive & Cruickshank Trail\nMullet Head Island Kayak Trip at MINWR – Sunday Trip 1\nBetty Salter Trail at The Great Outdoors\nDiceranda Scrub Preserve\nAirboat birding along the St. Johns – Sunday Trip 1\nAirboat Birding Along the St. Johns – Sunday Trip 2\nMullet Head Island Kayak Trip at MINWR – Sunday Trip 2\nAirboat Birding Along the St. Johns – Sunday Trip 3\nMullet Head Island Kayak Trip at MINWR – Sunday Trip 3\nWho is hiding in the bushes? Record it’s voice and find out!\nRecording Bird Calls\nHave you ever heard a bird call and wanted to include it on your eBird list? Join Brady Bailo for this informative trip to Maritime Hammock where you will learn how to record bird calls using your cell phone. To get the most out of this trip, please download and install the free Merlin App to your phone.\nPrice:\n$20\nDate:\nSunday, January 26\nTime:\n7:30-9:30 a.m.\nType:\nMeet on Site\nArrival Details:\nMeet at 7:15 at Maritime Hammock Preserve (1235 N Atlantic Ave, Cocoa Beach, FL 32931)\nIMPORTANT:\nThere is a similarly named Maritime Hammock Sanctuary, but that is miles away and NOT the correct park. Make sure you enter the correct address into your GPS.\nLeader:\nBrady Bailo\nParticipant Limit:\n15\nAccessibility:\nWalking on clearly marked but unpaved trails. There are no restrooms on the preserve, but there is a nearby Denny’s.\nAdditional Site Information:\nhttps://www.cityofcocoabeach.com/Facilities/Facility/Details/Maritime-Hammock-Preserve-27\nSpur-throated Grasshopper at Orlando Wetlands Park\nOrlando Wetlands Park Trailer Tour – Sunday\nSOLD OUT\nThis regional water treatment area, owned by the City of Orlando, began receiving reclaimed water in 1987, submerging the 1700-acre Sun Charm Ranch beneath millions of gallons of treated sewage. For 30 years the City closed the park during winter months so that the former owners could hunt waterfowl, until 2016 when it bought the hunting rights. Join us as we take a trip into the park where more than 220 bird species have been identified including Wood Storks, Bald Eagles, Crested Caracaras, Limpkins, Purple Gallinules, rails and spoonbills. Painted Buntings lurk in some of the dense vegetation bordering the 20 miles of roads and woodland trails leading through marshes, hardwood hammocks and along scenic lakes. Large numbers of waterfowl and wading birds are expected. Other wildlife found here includes alligators, turtles, deer, hogs, bobcats, otters, raccoons, opossums, snakes and coyotes. There will be multiple stops with walking to spy the best birds.\nPrice:\n$90\nDate:\nSunday, January 26\nTime:\n7:30 a.m. – 12:00 p.m.\nType:\nMeet on site.\nArrival Details:\nMeet at the Orlando Wetlands Park, 25155 Wheeler Road, Christmas.Estimated 39 minutes from the Radisson at the Port.\nLeaders:\nChristian Newton, TBD\nParticipant Limit:\n20\nAccessibility:\nAccessible restrooms are available parking lot, but not on the dikes an trails. Some walking on unpaved trails.\nAdditional Site Information\n:\nhttps://www.orlando.gov/Our-Government/Departments-Offices/Public-Works/Water-Reclamation-Division/Orlando-Wetlands\nLaughing Gulls\nShorebird Identification Talk and Field Trip\nSOLD OUT\nJoin David, Dee and Jessica to learn tips and tricks of basic shorebird identification.  After an indoor presentation, we will go afield to test your skills.\nPrice:\n$60\nDate:\nSunday, January 26\nTime:\n7:30 a.m. – 11:00 a.m.\nType:\nMeet on site.\nArrival Details:\nMeet at 7:15 a.m. at Dixie Crossroads, 1475 Garden St, Titusville, FL 32796 for presentation. After, we will carpool to another location to test your new shorebird ID skills.\nLeader:\nDavid Simpson, DeeFairbanks Simpson, Jessica Sodano\nParticipant Limit:\n15\nAccessibility:\nSome walking on possible mud and/or uneven surfaces.\nAdditional Site Information\n:\nhttps://www.fws.gov/refuge/merritt-island\nSnowy Plover, Jetty Park\nLearn Wildlife Photography at Jetty Park\nJoin us for a hands-on bird photography workshop at the picturesque Jetty Point Park in Port Canaveral. This park offers a perfect backdrop to capture stunning shots of Florida’s diverse bird species, from wading herons and pelicans to majestic ospreys in flight. In this class we’ll explore how to get the perfect portrait and how to optimize your settings for outstanding photography.\nNote:\nTo ensure that you get the most from this trip, the field trip leader will contact you at the email address that you used to register for the festival to discuss what type of camera you will be bringing and your current level of photography experience.\nDate:\nSunday, Jan 26\nTime:\n8:00 – 11:30 a.m.\nType:\nMeet your guides at 7:45 at the Radisson in front of the Expo Hall for car pooling and to receive your Jetty Park passes.\nArrival Details:\nCarpool to Jetty Park: 400 Jetty Park Drive, Cape Canaveral, FL 32920. Follow Jetty Park Rd to the first paved parking lot. Meet in front of the changing rooms. Estimated 6 minutes from the Radisson at the Port.\nLeaders:\nJason Giraulo and Phil Lintereur\nParticipant Limit:\n15\nAccessibility:\nWalking required on trails and in sand. Restrooms available\nAdditional Site Information:\nhttps://www.portcanaveral.com/Recreation/Jetty-Park-Beach-Pier\nMale Black Swallowtail at Enchanted Forest\nEnchanted Forest Sanctuary Day Hike – Sunday\nJoin the staff at the Enchanted Forest Sanctuary, where the Environmentally Endangered Lands (EELs) program all started, to enjoy a guided hike through multiple habitats on and off the marked trails. Staff will be in front of the nature center for an introduction to the Enchanted Forest before the hike. There will be possible opportunities to see and/or hear different species of birds from Pileated Woodpeckers, warblers, flyover ducks and wading birds (Roseate Spoonbills, Black-bellied Whistling-Ducks, herons, egrets and more.), Red-shouldered Hawks, owls and more. You never know what you may see in the Enchanted Forest.\nPrice:\n$25\nDate:\nSunday, January 26\nTime:\n8:30 a.m. – 10:45 a.m.\nType:\nMeet on site\nArrival Details:\nMeet at the Enchanted Forest Sanctuary, 444 Columbia Blvd., Titusville. Estimated 25 minutes from the Radisson at the Port.\nLeaders:\nAdam Kent,Sergio Arias,Gina Kent,Teressa Nick\nParticipant Limit:\n20\nAccessibility:\nRestrooms are available in the nature center. The nature center and the immediate area are handicapped accessible the trails are not.\nAdditional Site Information\n:\nhttps://www.brevardfl.gov/EELProgram/Sanctuaries/EnchantedForestSanctuary\nRoseates and Ibises on Black Point Wildlife Drive\nBlack Point Wildlife Drive & Cruickshank Trail\nThis is a self-driving tour of the Black Point Wildlife Drive and a walking tour on part of the Cruickshank Trail. Through Allan Cruickshank’s vision, enthusiasm, determination and influence, NASA and the US Fish and Wildlife Service reached an agreement in 1963 which created the Merritt Island National Wildlife Refuge. To pay tribute to this man’s unique contribution to the National Wildlife Refuge System, a five-mile trail was dedicated to his memory. This easy 5-mile walk around the Cruickshank Trail takes participants through marshlands with the likelihood of observing wading birds, shore birds, wintering warblers and birds of prey. Charlie will entertain you with stories of Allan and Helen Cruickshank’s influence on the environmental movement while walking along parts of the Cruickshank Trail as time permits. While driving to the trailhead, stops will be made along the Black Point Wildlife Drive to look at concentrations of birds. Examples of the birds you may see include Great Blue Heron, Tri-color Heron, Osprey, Pied Billed Grebes, Reddish Egret, Little Blue Heron, Gray Catbird, Red-bellied Woodpecker, Mottled Duck, Blue-wing Teal, Anhinga, and Double-crested Cormorant.\nPrice:\n$35\nDate:\nSunday, January 26\nTime:\n8:30 a.m. – 12:30 p.m.\nType:\nMeet on site.\nArrival Details:\nMeet at 8:15 a.m at the Parrish Park Boat Ramp Parking Lot 1 A. Max Brewer Memorial Pkwy, Titusville at. Estimated 33 minutes from the Radisson at the Port.\nLeaders:\nBert Alm (Space Coast Audubon), Gallus Quigley, Charlie Venuto\nParticipant Limit:\n20\nAccessibility:\nRestroom facilities are available at the trailhead. Must be able to walk 5 miles on unpaved trail.\nAdditional Site Information\n:\nhttps://www.fws.gov/refuge/merritt-island\nMangrove Tree Crab\nMullet Head Island Kayak Trip at MINWR – Sunday Trip 1\nJoin Rebecca Chapman from Springs to Sea Old Florida Eco Tours for a 2 hour kayak trip to the protected rookery known as Mullet Head Island (also known as “Bird Island”.) Paddle to an uninhabited island or through a maze of twisted mangrove forests in the Coastal Wildlife Kayak Tour. As you glide through the shallow lagoon of a wildlife refuge, keep your eyes peeled for playful dolphins, gentle manatees, colorful flamingos, and a whole cast of slippery stingrays and wading birds. This is your chance to get up close and personal with the wildest coastal critters! Our stops along this tour may include Bird Island (wind-dependent), a mangrove forest, known manatee observation areas, or shallow flats teeming with rays, hermit crabs, and mullet!\nNote: No children under 4 years old are allowed on this trip.\nPrice:\n$60.00\nDate:\nSunday, January 26\nTime:\n9:00 a.m. – 11:00 a.m.\nType:\nMeet on site\nArrival Details:\nMeet at 8:45 at the NW Haulover Canal Kayak Launch in the Merritt Island National Wildlife Refuge.\nLeaders:\nRebecca Chapman\nParticipant Limit:\n8\nAccessibility:\nThis activity may not be suitable for guests with certain back and shoulder conditions. There is a weight limit of 250 lbs per guest.\nAdditional Site Information:\nhttps://springstosea.com/\nAmerican Alligator\nBetty Salter Trail at The Great Outdoors\n– SOLD OUT\nOn our way to the trailhead, we will be looking for our resident Sandhill Cranes, Great Horned Owls, Osprey and Red-Shouldered Hawks. As we enter the trail, there is a wet meadow on the right which in spring is covered in wildflowers. The first half of the trail has little shade as it passes between wetlands, ponds, and the Canaveral Marshes tract of St. Johns River Water Management District. Midway through the trail we will cross a 30-foot-long twelve-inch-wide concrete weir with a coated wire cable handrail. To the left is a borrow pond and to the right a stream bed connected to the St. Johns River. The second half of the trail is shaded by pines, palms, cedars and oak trees. Egrets, herons, ducks and shorebirds as well as bobcats, deer and alligators have been seen on this trail. After the tour, consider having lunch at the Blue Heron Restaurant in TGO.\nPrice:\n$25.00. If desired, bring money for lunch at Blue Heron Restaurant in the Great Outdoors.\nDate:\nSunday, January 26\nTime:\n9:00 a.m. – 12:00 p.m.\nType:\nMeet on site\nArrival Details:\nMeet Up at Golf Carts Unlimited, 880 Hospitality Way, Titusville, FL 32780. The Great Outdoors (TGO) is a gated community so the driver should be prepared to show the gatekeeper your ID and explain that you are there for a tour with Betty Salter. Estimated 30 minutes from the Radisson at the Port.\nLeaders:\nBetty Salter, Robin Francis\nParticipant Limit:\n12\nAccessibility:\nNo restrooms available. Must be able to walk about 1 mile on unpaved trails. Good hiking shoes & walking stick are recommended.\nAdditional Site Information\n:\nhttps://naturecenterattgo.org/\nhttps://www.blueheronrestaurant.org/\nFragrant Waterlily\nDiceranda Scrub Preserve\nSee a delicate, fragrant mint, the Titusville Balm, found nowhere else in the world except in the Titusville area. In January it will be in fruit. Several species of pines, lyonias and other flatwood species will be seen – a few could be in bloom. The mile long trail passes by a large marsh, filled with water lilies, where wood ducks nest. Ferns are abundant. Florida Scrub-Jays, Eastern Towhees, woodpeckers and raptors might be seen. This is a very nice natural area surrounded by urban homes.\nPrice:\n$25\nDate:\nSunday, January 26\nTime:\n9:00 a.m. – 1:00 p.m.\nType:\nMeet on site\nArrival Details:\nMeet at 8:45 at the Diceranda Scrub Preserve 4900 Melissa Drive, south of Route 50, in Titusville. Estimated 28 minutes from the Radisson at the Port.\nLeaders:\nJim and Kay Stahl\nParticipant Limit:\n12\nAccessibility:\nNo restrooms available on site.\nAdditional Site Information\n:\nhttps://www.brevardfl.gov/EELProgram/Sanctuaries/DicerandraScrubSanctuary\nSnail Kite\nAirboat birding along the St. Johns – Sunday Trip 1\nSOLD OUT\nYou will enjoy the exclusive combination of Captain Mike, a fifth generation Floridian who grew up here on the river, and a professional birding tour guide and other birders on this exclusive small personal tour. You will glide along marshes and into a secluded cypress swamp to view an abundance of wading birds, waterfowl and raptors on this special adventure. This is optimal habitat for Snail Kites, Crested Caracaras, and Bald Eagles. In fact, 25 Bald Eagles were observed on just one trip in 2020. The St Johns River floodplain is only accessible by airboat due to the shallow depth. Your guides will point out the habitats and ongoing activity of the many species that are found here. Other wildlife, including alligators, may be encountered. This is a great opportunity for birders who prefer to avoid strenuous walking or hiking. Airboat Tours are hosted by A St. Johns River Airboat Tours LLC in Titusville, FL\nPrice:\n$90\nDate:\nSunday, January 26\nTime:\n10:00 a.m. – 11:30 a.m.\nType:\nMeet on site.\nArrival Details:\nArrive by 9:45 a.m. at the Highway 50 Boat Ramp, 28500 East Colonial Drive, Christmas. Estimated 29 minutes from the Radisson at the Port.\nLeader:\nKelly Smith\nParticipant Limit:\n5\nAccessibility:\nYou must be able to get up into high seats on the airboat. No restroom facility on site.\nAdditional Site Information\n:\nhttps://stjohnsairboatour.com/\nCrested Caracara\nAirboat Birding Along the St. Johns – Sunday Trip 2\nSOLD OUT\nYou will enjoy the exclusive combination of Captain Mike, a fifth generation Floridian who grew up here on the river, and a professional birding tour guide and other birders on this exclusive small personal tour. You will glide along marshes and into a secluded cypress swamp to view an abundance of wading birds, waterfowl and raptors on this special adventure. This is optimal habitat for Snail Kites, Crested Caracaras, and Bald Eagles. In fact, 25 Bald Eagles were observed on just one trip in 2020. The St Johns River floodplain is only accessible by airboat due to the shallow depth. Your guides will point out the habitats and ongoing activity of the many species that are found here. Other wildlife, including alligators, may be encountered. This is a great opportunity for birders who prefer to avoid strenuous walking or hiking. Airboat Tours are hosted by A St. Johns River Airboat Tours LLC in Titusville, FL\nPrice:\n$90\nDate:\nSunday, January 26\nTime:\n12:00 p.m. – 1:30 p.m.\nType:\nMeet on site.\nArrival Details:\nArrive by 11:45 a.m. at the Highway 50 Boat Ramp, 28500 East Colonial Drive, Christmas. Estimated 29 minutes from the Radisson at the Port.\nLeader:\nKelly Smith\nParticipant Limit:\n5\nAccessibility:\nYou must be able to get up into high seats on the airboat. No restroom facility on site.\nAdditional Site Information\n:\nhttps://stjohnsairboatour.com/\nAmerican White Pelican\nMullet Head Island Kayak Trip at MINWR – Sunday Trip 2\nJoin Rebecca Chapman from Springs to Sea Old Florida Eco Tours for a 2 hour kayak trip to the protected rookery known as Mullet Head Island (also known as “Bird Island”.) Paddle to an uninhabited island or through a maze of twisted mangrove forests in the Coastal Wildlife Kayak Tour. As you glide through the shallow lagoon of a wildlife refuge, keep your eyes peeled for playful dolphins, gentle manatees, colorful flamingos, and a whole cast of slippery stingrays and wading birds. This is your chance to get up close and personal with the wildest coastal critters! Our stops along this tour may include Bird Island (wind-dependent), a mangrove forest, known manatee observation areas, or shallow flats teeming with rays, hermit crabs, and mullet!\nNote: No children under 4 years old are allowed on this trip.\nPrice:\n$60.00\nDate:\nSunday, January 26\nTime:\n12:00 p.m. – 2:00 p.m.\nType:\nMeet on site\nArrival Details:\nMeet at 11:45 at the NW Haulover Canal Kayak Launch in the Merritt Island National Wildlife Refuge.\nLeaders:\nRebecca Chapman\nParticipant Limit:\n8\nAccessibility:\nThis activity may not be suitable for guests with certain back and shoulder conditions. There is a weight limit of 250 lbs per guest.\nAdditional Site Information:\nhttps://springstosea.com/\nImmature Bald Eagle\nAirboat Birding Along the St. Johns – Sunday Trip 3\nSOLD OUT\nYou will enjoy the exclusive combination of Captain Mike, a fifth generation Floridian who grew up here on the river, and a professional birding tour guide and other birders on this exclusive small personal tour. You will glide along marshes and into a secluded cypress swamp to view an abundance of wading birds, waterfowl and raptors on this special adventure. This is optimal habitat for Snail Kites, Crested Caracaras, and Bald Eagles. In fact, 25 Bald Eagles were observed on just one trip in 2020. The St Johns River floodplain is only accessible by airboat due to the shallow depth. Your guides will point out the habitats and ongoing activity of the many species that are found here. Other wildlife, including alligators, may be encountered. This is a great opportunity for birders who prefer to avoid strenuous walking or hiking. Airboat Tours are hosted by A St. Johns River Airboat Tours LLC in Titusville, FL\nPrice:\n$90\nDate:\nSunday, January 26\nTime:\n2:00 p.m. – 3:30 p.m.\nType:\nMeet on site.\nArrival Details:\nArrive by 1:45 p.m. at the Highway 50 Boat Ramp, 28500 East Colonial Drive, Christmas. Estimated 29 minutes from the Radisson at the Port.\nLeader:\nDave Grant\nParticipant Limit:\n5\nAccessibility:\nYou must be able to get up into high seats on the airboat. No restroom facility on site.\nAdditional Site Information\n:\nhttps://stjohnsairboatour.com/\nAmerican Flamingo\nMullet Head Island Kayak Trip at MINWR – Sunday Trip 3\nJoin Rebecca Chapman from Springs to Sea Old Florida Eco Tours for a 2 hour kayak trip to the protected rookery known as Mullet Head Island (also known as “Bird Island”.) Paddle to an uninhabited island or through a maze of twisted mangrove forests in the Coastal Wildlife Kayak Tour. As you glide through the shallow lagoon of a wildlife refuge, keep your eyes peeled for playful dolphins, gentle manatees, colorful flamingos, and a whole cast of slippery stingrays and wading birds. This is your chance to get up close and personal with the wildest coastal critters! Our stops along this tour may include Bird Island (wind-dependent), a mangrove forest, known manatee observation areas, or shallow flats teeming with rays, hermit crabs, and mullet!\nNote: No children under 4 years old are allowed on this trip.\nPrice:\n$60.00\nDate:\nSunday, January 26\nTime:\n3:00 p.m. – 5:00 p.m.\nType:\nMeet on site\nArrival Details:\nMeet at 11:45 at the NW Haulover Canal Kayak Launch in the Merritt Island National Wildlife Refuge.\nLeaders:\nRebecca Chapman\nParticipant Limit:\n8\nAccessibility:\nThis activity may not be suitable for guests with certain back and shoulder conditions. There is a weight limit of 250 lbs per guest.\nAdditional Site Information:\nhttps://springstosea.com/\n#content\n.wf-container\n.wf-wrap\n#main\n!Footer\n2023 Space Coast Birding and Wildlife Festival | Websites by\nMelbourne Website Designer\nSCBWA is a 501 (c) (3) non-profit organization\n.wf-container-bottom\n.wf-wrap\n#footer\nGo to Top\n#page",
      "emails": [
        "director@scbwa.net"
      ]
    },
    {
      "url": "https://scbwa.net/about-the-festival/",
      "is_candidate": false,
      "has_email": true,
      "text": "The7 12.8.1\nSkip to content\ndirector@scbwa.net\nJanuary 21-25, 2026\nRadisson Resort at the Port Cape Canaveral, Florida\nFacebook page opens in new window\nInstagram page opens in new window\nX page opens in new window\nSpace Coast Birding and Wildlife Festival\nJanuary 24th – 28th, 2024\nHome\nAbout\nStaff\nSponsors and Exhibitors\nBecome A Sponsor/Exhibitor\nSponsors\nExhibitors\nExhibitor Map\nSpeakers\nKeynotes\nPresentations\nField Trips\nPhotography\nID Workshop\nRegistration\nFAQ’s\nGeneral Info\n2020 EIR Report\n2020 Summary & Stats\nAnti-Discrimination Policy\nBird Checklist\nCertification of Solicitation\nContact\nHome\nAbout\nStaff\nSponsors and Exhibitors\nBecome A Sponsor/Exhibitor\nSponsors\nExhibitors\nExhibitor Map\nSpeakers\nKeynotes\nPresentations\nField Trips\nPhotography\nID Workshop\nRegistration\nFAQ’s\nGeneral Info\n2020 EIR Report\n2020 Summary & Stats\nAnti-Discrimination Policy\nBird Checklist\nCertification of Solicitation\nContact\nA flamboyance of flamingos and a party of scrub jays!\n2026 Space Coast Birding & Wildlife Festival\nClick here\nto be added to the email list for any updates and\nLIKE our Facebook page\n.\nBirding, photography, and wildlife enthusiasts — all will enjoy the 27th Space Coast Birding & Wildlife Festival. Five days of fun and camaraderie in the Florida sunshine with your flock!\nAdventure with expert guides who help you see and do more on land and water.\nExperience remarkable stories, photographs, and topical information shared by world-class birders.\nExamine high-quality equipment and local treasures in a large indoor Expo Center.\nBring your kids to our exciting\nYoung Birder Event\n.\nCheck back as speakers, field trips, photographers, sponsors, and exhibitors are added.\nClick here\nto be added to the email list for any updates and\nLIKE our Facebook page\n. Come join us in January 2026!\nCONTACT US!\nIf you have any questions regarding the festival, sponsorship, or exhibiting, please give us a shout.\ndirector@scbwa.net\nheader\naio-icon-box\naio-icon-component\nSpace Coast Birding and Wildlife Association\nheader\naio-icon-box\naio-icon-component\nP.O. Box 74, Mims, Florida 32754\nheader\naio-icon-box\naio-icon-component\nJanuary 21st -25th, 2026\nheader\naio-icon-box\naio-icon-component\nName\nEmail Address\nSubject\nYour Message\nΔ\nRow Backgrounds\nREAD ABOUT THE FESTIVAL ORGANIZERS\nhttps://scbwa.net/about-the-festival/staff/\n#content\n.wf-container\n.wf-wrap\n#main\n!Footer\n2023 Space Coast Birding and Wildlife Festival | Websites by\nMelbourne Website Designer\nSCBWA is a 501 (c) (3) non-profit organization\n.wf-container-bottom\n.wf-wrap\n#footer\nGo to Top\n#page",
      "emails": [
        "%20director@scbwa.net",
        "director@scbwa.net"
      ]
    },
    {
      "url": "https://www.facebook.com/deeat8am/",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    },
    {
      "url": "https://www.facebook.com/profile.php?id=61556539719585",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    }
  ],
  "all_links": [
    "https://scbwa.net/about-the-festival/staff/",
    "https://scbwa.net/sponsors-and-exhibitors/",
    "https://scbwa.net/keynotes/",
    "https://scbwa.net/about-the-space-coast/anti-discrimination-policy/",
    "https://scbwa.net/third-party-website-disclaimer/",
    "https://scbwa.net/field-trips/",
    "https://scbwa.net/new-workshops/",
    "https://scbwa.net/registration/",
    "https://scbwa.net/about-the-space-coast/",
    "https://scbwa.net/wp-content/uploads/2023/12/Total-Species-SCBWF-2020.pdf",
    "https://scbwa.net/sponsors-and-exhibitors/exhibitors/",
    "https://scbwa.net/contact-us/",
    "https://scbwa.net/field-trips#youngbirderevent",
    "https://scbwa.net/sponsors-and-exhibitors/sponsors/",
    "https://scbwa.net/sponsors-and-exhibitors/become-a-sponsor/",
    "https://scbwa.net/wp-content/uploads/2025/01/Young-Birders-at-Jetty-Park--scaled.jpeg",
    "https://scbwa.net/sponsors/",
    "https://scbwa.net/wp-content/uploads/2023/10/2020-EIR-report-updated-final2.pdf",
    "https://scbwa.net/about-the-festival/",
    "https://scbwa.net/certification-of-solicitation/",
    "https://scbwa.net/sponsors-and-exhibitors/exhibitor-map/",
    "https://scbwa.net/exhibitors/",
    "https://scbwa.net/wp-content/uploads/2023/07/SCBWF-2020-Summary-and-Statistical-Infomation-updated-final-2.pdf",
    "https://scbwa.net/presentations/",
    "https://scbwa.net/field-trips-2/",
    "https://scbwa.net/wp-content/uploads/2023/10/Bird-festival-trip-list.pdf",
    "https://scbwa.net/become-a-sponsor/",
    "https://scbwa.net/faqs/",
    "https://scbwa.net/",
    "https://scbwa.net/photography/"
  ],
  "candidate_links": [
    "https://scbwa.net/about-the-festival/staff/",
    "https://scbwa.net/contact-us/",
    "https://scbwa.net/field-trips#youngbirderevent",
    "https://scbwa.net/about-the-festival/",
    "https://www.facebook.com/deeat8am/",
    "https://www.facebook.com/profile.php?id=61556539719585"
  ],
  "visited": [
    "https://scbwa.net/",
    "https://scbwa.net/about",
    "https://scbwa.net/contact",
    "https://scbwa.net/staff",
    "https://scbwa.net/team",
    "https://scbwa.net/board",
    "https://scbwa.net/directory",
    "https://scbwa.net/events",
    "https://scbwa.net/sitemap.xml",
    "https://scbwa.net/council",
    "https://scbwa.net/leadership",
    "https://scbwa.net/management",
    "https://scbwa.net/producers",
    "https://scbwa.net/support",
    "https://scbwa.net/crew",
    "https://scbwa.net/members",
    "https://scbwa.net/bios",
    "https://scbwa.net/people",
    "https://scbwa.net/artists",
    "https://scbwa.net/musicians",
    "https://scbwa.net/faculty",
    "https://scbwa.net/administration",
    "https://scbwa.net/about-the-festival/staff/",
    "https://scbwa.net/contact-us/",
    "https://scbwa.net/field-trips#youngbirderevent",
    "https://scbwa.net/about-the-festival/",
    "https://www.facebook.com/deeat8am/",
    "https://www.facebook.com/profile.php?id=61556539719585"
  ],
  "base_url": "https://scbwa.net/"
}