{
  "pages": [
    {
      "url": "https://www.sgi-usa.org/about-buddhist-humanism/",
      "is_candidate": false,
      "has_email": false,
      "text": "About Buddhist Humanism\nFaith in the inherent dignity of human beings.\nBuddhism teaches that all people are inherently Buddhas. I believe that this Buddhist view of humanity embodies a key and fundamental principle for world peace.\n[1]\n—Daisaku Ikeda\nThe phrase that\nDaisaku Ikeda often uses to characterize his philosophical stance is “Buddhist humanism.” It is a philosophical perspective that reflects the core spirit of the Lotus Sutra, one founded on faith in the inherent dignity of human beings and profound confidence in people’s capacity for positive transformation.\nFrom the perspective of Buddhist humanism, it is human beings themselves, rather than a higher power, who possess the ultimate wisdom about their condition. This view regards the individual as the pivotal force of change within the interdependent network of phenomena that comprises life. A fundamental change in the life of an individual, in other words, will affect the entire web of life.\nOne of the distinguishing features of Buddhist humanism is this consciousness of and respect for the interdependence and interrelatedness of all life. While Buddhist humanism focuses on the human being, it does not polarize human beings and the environment or other forms of life. Rather it seeks to create human happiness through a harmonization of these interdependent relationships. “The essence of Buddhist humanism,” says Ikeda, “is mutual respect.”\n[2]\nBuddhism is grounded in a fundamental belief in the inherent dignity of all life.\nPhoto by Nicole Walter.\nA Life-Sized Paradigm\nIkeda’s concept of\na “life-sized paradigm” helps shed light on another aspect of his Buddhist humanism. One consequence of the process of globalization has been that, while we are now more conscious of ourselves as part of a broader world-community, we find ourselves in a vast world of competing global forces over which we, apparently, have no control. The result is one of disempowerment—a sense of our inability to have any meaningful impact on the world, a feeling that our individual lives matter little in the face of larger realities.\nThe effects of this are a social tendency toward dehumanization. In response, Ikeda proposes the need for people to develop a “life-sized paradigm by which to understand our world and where we stand in it.” He explains this as “a way of thinking that never deviates from the human scale. It is simultaneously a humane sensitivity to life as a whole and also to the details of everyday human existence.”\n[3]\nThis requires that all choices and decisions–from those of daily life to those that shape global policies–must first be evaluated in terms of their impact on the real lives of people. Seen in this light, we gain a renewed appreciation for the very real value of our own local, everyday actions and interactions, and of our ultimate ability to impact upon history on a global scale.\n(Source:\nwww.daisakuikeda.org\n)\nBuddhism for Daily Life\n—About Our Community\n—Basics of Our Practice\n—Life Stories\nBuddhism for Human Dignity\n—About Buddhist Humanism\n—The Humanism of the Lotus Sutra\n—Applying the Philosophy\nBuddhism for Global Citizenship\n—About Global Citizenship\n—Engaged Buddhism\n—Global Efforts for Peace\n—Peace Proposals\nFind/Contact Us\nMember Resources\nSGI-USA Bookstore\nSGI-USA Charter\nCorporate Governance",
      "emails": []
    },
    {
      "url": "https://www.sgi-usa.org/about-our-community/",
      "is_candidate": false,
      "has_email": false,
      "text": "About Our Community\nThe most diverse Buddhist community in the United States.\nWho We Are\nWe are the most\ndiverse Buddhist community in the United States.\nThe Soka Gakkai International-USA (SGI-USA) is part of a global community-based network of more than 11 million people in 192 countries and territories that practice the humanistic philosophy of Nichiren Buddhism centered on respect for the dignity of life.\nAs members of the SGI, we are committed to dialogue and nonviolence based on the conviction that individual happiness and the realization of peace are inextricably linked.\nSGI youth chanting Nam-myoho-renge-kyo together. Photo by Yvonne Ng.\nOur Daily Practice\nOur basic daily\nBuddhist practice, carried out in our own homes, is chanting the phrase “Nam-myoho-renge-kyo” and reciting portions of the Lotus Sutra as a means to embrace and bring forth our Buddha nature, our limitless reserves of wisdom, courage and compassion and apply them to our daily lives. We also share the teachings of Buddhism with others in order to help them become happy.\nA neighborhood discussion meeting, Edison, New Jersey. Photo by Dave Goodman.\nHow We Gather\nIn the U.S.,\nwe represent the most diverse Buddhist community with more than 2,500 monthly neighborhood discussion meetings and some 90 Buddhist centers throughout the country.\nWe gather monthly for small-scale neighborhood discussion meetings where we study Buddhist principles and share our experiences of applying Buddhism to the challenges of life. As religion journalist Clark Strand notes: “At an SGI-USA discussion meeting, every voice is heard. Such meetings are egalitarian in spirit, democratic in practice and decidedly life-affirming in their vision of how Buddhist practice might contribute to the happiness of the individual and, in so doing, provide the foundation for a happy society.”\nBased on core Buddhist principles such as respect for the dignity of human life and the interconnectedness of self and the environment, the SGI engages in various peace activities, including human rights education, the movement to abolish nuclear weapons and efforts to promote sustainable development.\nThe three presidents of the Soka Gakkai: (l-r) first president, Tsunesaburo Makiguchi, third president, Daisaku Ikeda, and second president, Josei Toda. Photos by Seikyo Press.\nOur Lineage\nWe uphold the\nBuddhist tradition that originated with Shakyamuni based on the Mahayana scriptures and the Lotus Sutra in particular. The Soka Gakkai is engaged in faith practices and activities in society that correspond with the compassionate spirit of the Lotus Sutra in the contemporary world.\nThe Soka Gakkai (literally, “Society for the Creation of Value”) was founded in 1930 by reformist, educator and author Tsunesaburo Makiguchi, initially as a study group for educators. However, due to Makiguchi’s faith in Nichiren Buddhism, this group quickly developed into a broader-based movement focused on the ideals and practice of Buddhism.\nFacing oppression from Japan’s militarist government, Makiguchi and his closest disciple, Josei Toda, were arrested and imprisoned in 1943 as “thought criminals.” Makiguchi died in prison in 1944.\nAfter his release, Toda continued to promote an active, socially engaged Buddhism as a means of self-empowerment—a way to overcome obstacles in life and tap inner hope, confidence, courage and wisdom. He used the term “human revolution” to express the central idea of Nichiren Buddhism—that all people are capable of attaining enlightenment in this lifetime. With Toda as president, the Soka Gakkai began to flourish in Japan.\nToda, who passed away in April 1958, was succeeded as president in 1960 by Daisaku Ikeda, who further developed the movement in Japan as well as on a global scale. Soka Gakkai International (SGI) was founded on January 26, 1975, as a worldwide network of socially engaged Buddhists dedicated to a common vision of a better world through the empowerment of the individual and the promotion of peace, culture and education.\nUnder Ikeda’s leadership, the SGI has developed into one of the most significant engaged Buddhist movements in the world, fostering and promoting grassroots activities in such areas as nuclear abolition, human rights and education for sustainable living.\nBuddhism for Daily Life\n—About Our Community\n—Basics of Our Practice\n—Life Stories\nBuddhism for Human Dignity\n—About Buddhist Humanism\n—The Humanism of the Lotus Sutra\n—Applying the Philosophy\nBuddhism for Global Citizenship\n—About Global Citizenship\n—Engaged Buddhism\n—Global Efforts for Peace\n—Peace Proposals\nFind/Contact Us\nMember Resources\nSGI-USA Bookstore\nSGI-USA Charter\nCorporate Governance",
      "emails": []
    },
    {
      "url": "https://www.sgi-usa.org/about-global-citizenship/",
      "is_candidate": false,
      "has_email": false,
      "text": "About Global Citizenship\nEmbodying wisdom, compassion and courage.\nWhat It Truly Means to Be a Global Citizen\n“All human beings are born free and equal in dignity and rights. They are endowed with reason and conscience and should act toward one another in a spirit of brotherhood.”\n—The Universal Declaration of Human Rights\nOn June 13, 1996,\nDaisaku Ikeda spoke at Columbia University’s Teachers College in New York on the ideal of global citizenship.\nHis views on global citizenship were shaped by the cosmopolitan ethos of the first two founding Soka Gakkai presidents, Tsunesaburo Makiguchi and Josei Toda, and by his sustained efforts at dialogue with the world’s leading thinkers. They weren’t defined by how many countries a person traveled to or how many languages he or she spoke. Rather, he saw this ideal expressed in ordinary people who, regardless of whether they journeyed beyond their nation’s borders, were genuinely concerned for the peace and prosperity of the world.\nIn his Columbia University speech, Ikeda outlined three qualities of global citizenship, offering a universal lens from which people could both perceive a harmonious world and act to achieve it. They are:\nthe wisdom to perceive the interconnectedness of all life;\nthe courage not to fear or deny difference, but to respect and understand people of different cultures and grow from encounters with them; and\nthe compassion to maintain an imaginative empathy that reaches beyond one’s immediate surroundings and extends to those suffering in distant places.\n[1]\nJason Goulah, the director of the Institute for Daisaku Ikeda Studies in Education and associate professor of bilingual-bicultural education at DePaul University, emphasized that these three characteristics are also the fundamental attributes of a bodhisattva and the Buddha. “Moreover, according to Ikeda, these qualities already exist within all of us and can be endlessly developed through persistent inner transformation born from dialogue with others, dialogue with difference,” he says. “Such a perspective of global citizenship not only transcends popular notions of this cosmopolitan ethic and identity, but it also suggests that global citizenship, like Buddhahood itself, is the fullest expression of our own humanity, in this life, as we are.”\nThe Interdependence of All Phenomena\nIkeda in his\naddress spoke of “Indra’s net,” providing from the Buddhist canon a beautiful visual metaphor of the concept of the interdependence and interpenetration of all phenomena: Surrounding the palace of the Indian deity Indra, a magnificent net expands limitlessly outward. At each knot in the net hangs a beautiful mirrorlike jewel reflecting on its surface all the other jewels. No jewel is at the center of the infinite net, yet each jewel is at the center. If one pulls at one jeweled knot, all the other jewels around it move and shimmer. Ikeda elaborates: “When we learn to recognize what Henry David Thoreau refers to as ‘the infinite extent of our relations,’\n[2]\nwe can trace the strands of mutually supportive life and discover there the glittering jewels of our global neighbors. Buddhism seeks to cultivate wisdom grounded in this kind of empathetic resonance with all forms of life.”\n[3]\nSoka (Value-Creating\n)\nEducation\nThe ideal of\nglobal citizenship is present in all of the educational institutions that Ikeda has founded, but it is perhaps most clearly expressed in the establishment of Soka University of America, with its emphasis on: the global makeup of its student body, its compulsory second language and study abroad programs, and its core curriculum.\n“The human being is the point to which we must return and from which we must depart anew. What is required is a human transformation—a human revolution.”\nTo be sure, Ikeda said in his address that the Soka, or value-creating, education system was founded out of a desire that future generations should have the opportunity to experience the same kind of humanistic education he did under the tutelage of his mentor, second Soka Gakkai President Josei Toda. Ikeda writes: “It is my greatest hope that the graduates of the Soka schools will become global citizens who can author a new history for humankind.”\n[4]\nLawrence E. Carter Sr., dean of the Martin Luther King Jr. International Chapel at Morehouse College, writes of this ideal: “Democracy flourishes only when the populace is enlightened, can dialogue and cooperate in spite of its difference, and builds a society of hope pointing toward the ultimate goal of peaceful coexistence. Ikeda’s philosophy of education can be an indispensable tool for educators on all levels to begin molding our spirits and public policies to fit into that crown.”\n[5]\nLearn more about Soka University of America here.\nA Shared Responsibility for the World\nThe global citizenship\nideal appears to be taking root around the world. Starting from 2005, the World Values Survey, a global research project that explores people’s values and beliefs, and how they change over time, began including the statement: “I see myself as a world citizen.”\nIn “Wave 6” of the survey, conducted from 2010–14 and administered across nearly 100 countries, 29.5% say they “strongly agree” and 41% “agree” with the statement. In the U.S., 46.8% selected “agree” and 20.6% “strongly agree.”\nIkeda in his speech acknowledged that global society today faces myriad interlocking crises, which include war, environmental degradation and conflicts among people based on differences of ethnicity, religion or language.\n“The list is long and familiar, and the road to solutions may seem all too distant and daunting,” he says. “It is my view, however, that the root of all these problems is our collective failure to make the human being—human happiness—the consistent focus and goal in all fields of endeavor. The human being is the point to which we must return and from which we must depart anew. What is required is a human transformation—a human revolution.”\n[6]\nThe work of fostering conscientious citizens of the world concerns all of us, he says. “It is a vital project in which we all are participants and for which we all share responsibility.”\n[7]\nRead more below.\nThoughts on Education for Global Citizenship\nDaisaku Ikeda’s lecture on global citizenship at Teachers College, Columbia University on June 13, 1996.\nBecoming a Global Citizen\nSGI-USA members on how they are embodying the practice of global citizenship to transform the world around them.\nThoughts on Education for Global Citizenship\nDaisaku Ikeda’s lecture on global citizenship at Teachers College, Columbia University on June 13, 1996.\nBecoming a Global Citizen\nSGI-USA members on how they are embodying the practice of global citizenship to transform the world around them.\nThoughts on Education for Global Citizenship\nDaisaku Ikeda’s lecture on global citizenship at Teachers College, Columbia University on June 13, 1996.\nBecoming a Global Citizen\nSGI-USA members on how they are embodying the practice of global citizenship to transform the world around them.\nBuddhism for Daily Life\n—About Our Community\n—Basics of Our Practice\n—Life Stories\nBuddhism for Human Dignity\n—About Buddhist Humanism\n—The Humanism of the Lotus Sutra\n—Applying the Philosophy\nBuddhism for Global Citizenship\n—About Global Citizenship\n—Engaged Buddhism\n—Global Efforts for Peace\n—Peace Proposals\nFind/Contact Us\nMember Resources\nSGI-USA Bookstore\nSGI-USA Charter\nCorporate Governance",
      "emails": []
    },
    {
      "url": "https://www.sgi-usa.org/find-a-local-center/",
      "is_candidate": false,
      "has_email": true,
      "text": "Find a Buddhist Community Near You\nSearches are within a 10 mile radius.\nAddress\nSearch\nMore Options\n[Central Territory Office] Chicago Buddhist Center\n1455 South Wabash Ave, Chicago, IL 60605\n312.913.1211\ncentralterritory@sgi-usa.org\n[East Territory Office] New York Culture Center\n7 East 15th Street, New York, NY, 10003\n212.727.7715\neastterritory@sgi-usa.org\n[SoCal-Pacific Territory Office] Los Angeles Friendship Center\n5899 Venice Blvd., Los Angeles, CA, 90019\n323.965.0025\nsocalpacificterritory@sgi-usa.org\n[West Territory Office] SGI-USA Denver Activity Center\n2020 Wadsworth Blvd., Suite C & 5, Lakewood, CO 80214\n303-893-0430\nwestterritory@sgi-usa.org\nContact Us\nI am looking for the SGI-USA near me\nHOW CAN WE HELP NARROW YOUR SEARCH?\nI am a member looking for meetings near me\nI am interested in connecting to Buddhists in my area\nName\n*\nEmail\n*\nPhone Number\nState\n*\nSelect a State\nAlabama\nAlaska\nArizona\nArkansas\nCalifornia\nColorado\nConnecticut\nDelaware\nDistrict of Columbia\nFlorida\nGeorgia\nHawaii\nIdaho\nIllinois\nIndiana\nIowa\nKansas\nKentucky\nLouisiana\nMaine\nMaryland\nMassachusetts\nMichigan\nMinnesota\nMississippi\nMissouri\nMontana\nNebraska\nNevada\nNew Hampshire\nNew Jersey\nNew Mexico\nNew York\nNorth Carolina\nNorth Dakota\nOhio\nOklahoma\nOregon\nPennsylvania\nRhode Island\nSouth Carolina\nSouth Dakota\nTennessee\nTexas\nUtah\nVermont\nVirginia\nWashington\nWest Virginia\nWisconsin\nWyoming\nGuam\nPuerto Rico\nAntigua and Barbuda\nAruba\nBahamas\nBarbados\nBelize\nBermuda\nCayman Islands\nCuracao\nDominica\nEmerald Isles\nGrenada\nGuyana\nJamaica\nMicronesia\nMontserrat\nSaint Lucia\nSaint Vincent and the Grenadines\nSint Maarten (Dutch)\nSuriname\nTrinidad and Tobago\nUnited States Minor Outlying Islands\nAdditional Comments\nCAPTCHA\nIf you would like to visit the SGI Plaza (SGI-USA Headquarters) located in Santa Monica, CA, please schedule an appointment with the Visitor Center by emailing\nvisithq@sgi-usa.org\n, or call 310-260-8978.\nThe Visitor Center is open from 10am to 4pm Pacific, and tours are at set times throughout the day.\nBuddhism for Daily Life\n—About Our Community\n—Basics of Our Practice\n—Life Stories\nBuddhism for Human Dignity\n—About Buddhist Humanism\n—The Humanism of the Lotus Sutra\n—Applying the Philosophy\nBuddhism for Global Citizenship\n—About Global Citizenship\n—Engaged Buddhism\n—Global Efforts for Peace\n—Peace Proposals\nFind/Contact Us\nMember Resources\nSGI-USA Bookstore\nSGI-USA Charter\nCorporate Governance",
      "emails": [
        "centralterritory@sgi-usa.org",
        "eastterritory@sgi-usa.org",
        "socalpacificterritory@sgi-usa.org",
        "visithq@sgi-usa.org",
        "westterritory@sgi-usa.org"
      ]
    },
    {
      "url": "https://www.facebook.com/sgiusa.info",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    }
  ],
  "all_links": [
    "https://bookstore.sgi-usa.org/",
    "https://www.sgi-usa.org/sgi-usa-corporate-governance-and-board/",
    "https://www.sgi-usa.org/about-buddhist-humanism/",
    "https://www.sgi-usa.org/about-our-community/",
    "https://www.sgi-usa.org/life-stories/",
    "https://www.sgi-usa.org/2025/03/21/the-power-of-friendship/",
    "https://www.sgi-usa.org/buddhism-for-human-dignity/",
    "https://www.sgi-usa.org/2025/03/21/too-focused-for-fear/",
    "https://www.sgi-usa.org/applying-the-philosophy/",
    "https://www.sgi-usa.org/buddhism-for-global-citizenship/",
    "https://www.sgi-usa.org/about-global-citizenship/",
    "https://www.sgi-usa.org/basics-of-our-practice/",
    "https://www.sgi-usa.org/sgi-usa-charter/",
    "https://www.sgi-usa.org/2025/03/21/the-national-cherry-blossom-festival/",
    "https://www.sgi-usa.org/engaged-buddhism/",
    "https://www.sgi-usa.org/find-a-local-center/",
    "https://www.sgi-usa.org/peace-proposal/",
    "https://www.sgi-usa.org/buddhism-for-daily-life/",
    "http://www.sgi-usa.org/",
    "https://www.sgi-usa.org/global-efforts-for-peace/",
    "https://www.sgi-usa.org/the-humanism-of-the-lotus-sutra/",
    "https://www.sgi-usa.org/2025/03/21/the-way-to-win/",
    "https://portal.sgi-usa.org/portal"
  ],
  "candidate_links": [
    "https://www.sgi-usa.org/about-buddhist-humanism/",
    "https://www.sgi-usa.org/about-our-community/",
    "https://www.sgi-usa.org/about-global-citizenship/",
    "https://www.sgi-usa.org/find-a-local-center/",
    "https://www.facebook.com/sgiusa.info"
  ],
  "visited": [
    "http://www.sgi-usa.org/",
    "http://www.sgi-usa.org/about",
    "http://www.sgi-usa.org/contact",
    "http://www.sgi-usa.org/staff",
    "http://www.sgi-usa.org/team",
    "http://www.sgi-usa.org/board",
    "http://www.sgi-usa.org/directory",
    "http://www.sgi-usa.org/events",
    "http://www.sgi-usa.org/sitemap.xml",
    "http://www.sgi-usa.org/council",
    "http://www.sgi-usa.org/leadership",
    "http://www.sgi-usa.org/management",
    "http://www.sgi-usa.org/producers",
    "http://www.sgi-usa.org/support",
    "http://www.sgi-usa.org/crew",
    "http://www.sgi-usa.org/members",
    "http://www.sgi-usa.org/bios",
    "http://www.sgi-usa.org/people",
    "http://www.sgi-usa.org/artists",
    "http://www.sgi-usa.org/musicians",
    "http://www.sgi-usa.org/faculty",
    "http://www.sgi-usa.org/administration",
    "https://www.sgi-usa.org/about-buddhist-humanism/",
    "https://www.sgi-usa.org/about-our-community/",
    "https://www.sgi-usa.org/about-global-citizenship/",
    "https://www.sgi-usa.org/find-a-local-center/",
    "https://www.facebook.com/sgiusa.info"
  ],
  "base_url": "http://www.sgi-usa.org/"
}