{
  "pages": [
    {
      "url": "https://www.shoestringtheatre.net/special-events",
      "is_candidate": false,
      "has_email": true,
      "text": "$\n$\n$\n/$\n$\nSPECIAL EVENTS\n/$\n$\n/$\n/$\n$\n$\n$\nPAST EVENTS\n/$\n/$\n$\n/$\n$\n/$\n$\n/$\n/$\n/$\n$\n/$\n$\nSPECIAL EVENTS\n/$\n$\n/$\n$\n$\nPAST EVENTS\n/$\n/$\n$\n/$\n$\n/$\n$\n/$",
      "emails": [
        "2062d0a4929b45348643784b5cb39c36@sentry.wixpress.com",
        "605a7baede844d278b89dc95ae0a9123@sentry-next.wixpress.com",
        "88170cb0c9d64f94b5821ca7fd2d55a4@sentry-next.wixpress.com",
        "8eb368c655b84e029ed79ad7a5c1718e@sentry.wixpress.com",
        "info@shoestringtheatre.net"
      ]
    },
    {
      "url": "https://www.shoestringtheatre.net/about",
      "is_candidate": false,
      "has_email": true,
      "text": "$\n$\n$\n$\n/$\n$\n$\nABOUT US\n/$\n/$\n$\nOur History\nA Community That Loves To Create\n/$\n$\nOn A SHOESTRING\nA More Complete History by Dave Miller\nTrue And Very Humorous\n​\nThe last years of the 1940's and the 1950's were years of new beginnings for many Americans. World War II was over. We were finishing up educations, getting married and starting families. Deland was slow and sleepy. Many stores and offices still closed on Wednesday afternoons. Despite the existence of the three theaters, the Athens, the Dreka and the drive-in, plus some great comedy shows on the radio, much of our entertainment was home grown. Television was still something we had read about and computers were punch card machines as big as a piano.\n​\nIt was into that picture that a local group envisioned an amateur theater. Alice and Martin Weisner floated the idea. Lillian Lyster whipped up the publicity and got a story in the Sun-News promoting a meeting at the old Chamber of Commerce on West New York Avenue, but it was Ella DeBerard who took the reins and for many years was the driving force. Ella wrote 6 plays that were produced at Shoestring, had two books published, along with many magazine articles. At Shoestring, Ella was President, directed many shows, acted, built sets and did the janitor work. She got her husband, Phil, into an early play, but he said, \"Never again!\"\n​\nThose first 20 or so people who met at the Chamber of Commerce were a diverse group but with a unifying interest in literature and Theater. Since I did not become an active member until 1955, I cannot accurately name the original organizers. Among the very early members were Bob Powe, Emma Ford, Joseph Crawley, George Stratler, Mrs. Floyd Pflough and a Mr. Liberman. In Deland, even Doctors had time for Theater, and Dr. Hutchinson and wife Peg, Dr. Ted Hahn, Dr. Frison and Dr. Roy DeShaw were active early.\n​\nThe first necessity for the group was to obtain a Theater. The Navy had just left the Airbase, and we soon found that the old mess hall was available. A busy group of volunteers started the remodeling job. While the remodeling was going on, the Players worked up a show, and in April of 1950, we presented \"The Saturday Evening Ghost\" at the old Deland High School auditorium. Our tickets were priced at $1.00.\n​\nThe Navy mess hall was a large frame structure with a flat concrete floor and about a 12-ft ceiling. The budding thespians turned out a crowd of volunteers, and built a stage, assembled folding chairs for seats and constructed two dressing rooms the size of Superman's phone booth. The \"green room\" was the former dish washing room and contained a dishwasher the size and construction of a steam locomotive. We tried for Years to get rid of it, but neither the Navy nor the City would claim parenthood, so it finally disappeared. (About like making the Statue of Liberty vanish) There was no water, so someone ran a temporary hose over to a neighbor's property and hooked it into an outside spigot on both properties, feeding the water backward into our system. Like temporary taxes, it was still there 40 years later, so any of you wondered why the water at the Airport tasted like it came from a hose, it did. There was no air conditioning, and the heat came from two radiant gas heaters. It was like heating Madison Square Garden with a candle! There was one toilet backstage, and the flush was so noisy we could only flush at intermission.\n​\nThe audience took it in good-natured stride. On cold nights, they brought blankets and a thermos of hot coffee, or something stronger. Since there was no heat at all on stage, when the curtain opened, it was like opening the refrigerator. You could hear people in the first two rows gasp. On hot nights, we debated whether to leave everything open for cool air and mosquitoes or tough it out.\n​\nMy first show, REBECCA, with Don Ammon, was in the winter of 1955. The cast wore heavy underwear and sweaters under their Tuxes and other costumes. We made fast costume changes! We drank lots of hot coffee too. Unfortunately, some also brought something stronger, so we adopted a very strict \"no alcohol\" policy, which we enforce today.\n​\nOne of the famous theater sayings is \"Never perform with kids or animals.\" In truth, performing with kids is often fun, except that the drive you crazy by having all of their lines (and half of yours) while you are still struggling with Act I.\n​\nOn the animal front a good example is the dog named \"Horrid\" in Camelot. We went to the humane society and picked out the sorriest dog we could find, a scrawny Russian wolfhound. He came on stage with King Pellmore, played by Chuck Nelson. Just about the time Chuck would deliver one of his best lines, \"Horrid\" would look soulfully at the audience, and slowly scratch his ear with his hind foot. The audience never heard Chuck's line. By the time the show was over, \"Horrid\" had filled out to a pretty good-looking dog, and someone in the audience adopted him. Another dog actor was \"Luke\", a dog from Lake Helen, who played \"Sandy\" in \"Annie\" and also appeared in \"On Borrowed Time\". Luke was a gentleman, and a pleasure to work with.\n​\nOur \"volunteer\" animals were another story. There was a food processing plant next door at the airport (from whence we got the water for 40 years) that always had a dumpster with food waste and invariably, rats. The rats were pretty well fed and happy, but wanted to get ahead in the Arts, so they visited us often. Don Ammon tells of a scene he was in and the audience started to laugh. After checking to be sure his fly was zipped, he took a sneak peek around the stage, and found a rat strolling around. During another show, one climbed the back of the main curtain, and crawled completely across stage on the curtain hanging behind the proscenium. There were several women on stage and they never missed a line.\n​\nWhen the Dreka closed, we upgraded our seats to real (albeit unpadded) theater seats, already broken in with chewing gum. Later, we acquired the seats from a remodeling job at Daytona Playhouse, which we used even in Lake Helen until we bought our present seats. Our legal name was \"DeLand Players\" but we soon adopted the operating name \"Shoestring Theatre\" for good reason. We have always concentrated on volunteers, believing that the spirit and object of Community Theater was to involve the people in the community. We have never asked for Taxpayer support, although that has put us on thin ice at times. For many years it was not uncommon for the show director and cast members to have to contribute cash to pay the costs of the opening show, not always getting it back if the show played to a small audience. We also often called on season ticket buyers to buy early so we could use this cash to pay off last year's debts and open the coming season. (We presently hold season ticket money in the bank and draw only as it is earned).\n​\nA sad trend today is in the lack of volunteers. Like most social and civic organizations, we find that getting volunteers is increasingly difficult. Too many people would rather sit in a chair and be entertained by TV than to participate. Fortunately, we still have a number of really hard working, talented people at Shoestring who put in many hours, but we find we have to pay for many things that used to be done by volunteers. Despite our problems in these early years, we turned out a lot volunteers for work projects. One summer we reroofed the airport building with all volunteers, and that is like asking someone to work on Devil's Island. We had a regular Saturday construction crew nearly all around 80 years old. This group, led for years by Charlie Staines, built a lot of sets, made repairs to the building, etc. George Napoli was one of the younger members (meaning not quite 80) but he had bad knees, so he build a rolling platform to work from, known as the \"Napoli Mobile\". The group would bring a sandwich and work nearly every Saturday on set construction and Theater repairs.\n​\nIt is hard to list the names of our outstanding members, because someone will surely be left out, and too long a list puts the reader to sleep. Even so, the Theater history would be deficient without an attempt to recognize a few of the people who kept us running for over 50 years to date. Some of the early members are recognized elsewhere. Others not so mentioned are: Katie Ammon, Paunny Brandt, Ethel Capehart, Him and Ruthe Cochran, Becky Collison, Betty Day, Martha Desmond, Chuck Easley, Ned and Florence Grimes, Kay Hicks, June and Jack Liberman, Fred Messersmith, Anne Miller, Becky Nolan, Flo Perro, Leo and Leona Snedeker, George Statler, Florence and Pau Thuot, Clarence and Frances Woodard, and Eleanore Woodruff. This list follows the tradition of the Hall of Fame and lists only retired members. Our current group of hard working people will have to wait.\n​\nBy the mid 1980's things at our airport building were greatly improved. We had air conditioning and heat, improved the stage, the seating and every aspect of the Theater. We were able to put on musicals and other large productions. It was then that disaster struck. The City of DeLand wanted to upgrade the airport buildings and demolish Shoestring. After getting the building free for nearly 40 years, we could hardly complain, but we had to find another place. Unfortunately, this lead to a split in the Theater. We divided almost evenly, with half wanting to go into a large facility which would be shared by other groups and would not be entirely under Shoestring control, and half wanting to continue in a building of our own with a small, more intimate theater. A bare majority of our members felt that a large community run group would not understand the needs of a theater with amateur players, while the reminder felt that the larger facility could better serve a wider range of interests. This split caused problems for some time, but was a blessing in disguise for the community.\n​\nOne group, guided by Rene and Larry Sands, two good Shoestring people, became Sands Theater at Deland's Cultural Arts Center, which is able to present a wide range of productions including an outstanding Children's program. The remaining half, with the name \"Shoestring Theatre, Inc.\" remained closer to the old Little Theater concept with a more intimate atmosphere and small town approach. Both groups had to find a new home, and Shoestring was fortunate to find our present building.\n​\nThis building had been a well-regarded Black school in the days of school segregation, and after standing empty for several years, had been auctioned off by the School Board. Two Army Chaplains, John Smart and Lewis Long of Lake Helen were high bidders and bought the building with the intention of using it for a religious retreat for service men. It was to be like the summer camps of our youth, with cook outs, games and religious discussions. It proved unsuccessful, and they offered it to Shoestring at a very reasonable rent.\n​\nIn many ways, the building resembled our old home at the airport. It was a large frame building with a 12-ft ceiling. However, there were internal walls some of which had to be removed. Again, we did an amazing amount of work with volunteers. We used licensed workers for the electrical and plumbing, and a contractor for the heavy work. We called on hundreds of people for cash contribution, but raised only a bit over $30,000.00 in weeks of calling, so when that was gone, it was up to volunteers. In addition to theater members, several of the people in Lake Helen, and West Volusia including John and Bob Smart, Ron and Pat Sheedy and many with no connection to Shoestring put in days of work. We not only build the stage, seat ramp, light booth, restrooms, etc., but we went to the airport building and salvaged the material including all of the seats. Many theater people spent every day for nearly two months at one location or the other. We started tearing out the stage, seats, and everything movable from the airport the day after the last show closed and hauled them to Lake Helen where others were waiting to install them. We patched together old 2×4's, plywood, curtains, lighting equipment and anything movable before we would buy anything new. We even had several of the ladies pulling and straightening nails, removing screws, hinges, etc. and sorting them into jars. Some of the ladies were mighty handy with the hammers and saws too!\n​\nWe closed at the Airport with HARVEY in November and opened in February at Lake Helen with musical CAMELOT. The cast would come in one night and rehearse in the space where the seats should be. The next night there would be seats there so they would rehearse between piles of lumber where the stage would be, etc. Four days before opening, there were no restrooms for the audience. We cried on the plumber's shoulder, and he worked overtime to get them in. Volunteers built the restroom walls around him. In addition to contributed labor, we received an amazing amount of contributed material. Two air conditioning companies donated large used air conditioners, and installed one of them free. People donated plants, building material, new doors with damaged areas, etc…\n​\nWe almost lost the whole thing just before the contractor finished. There was a large brick column that appeared to be a chimney for the space heater that provided the only heat in the building prior to Shoestring. Alas, it was also the main support column for the roof and ceiling over the seats. Since it was in the middle of the stage, it had to go. Thinking that it was not essential, the contractor removed it , whereupon the roof and ceiling started to drop. The contractor put in a emergency support in the middle of the auditorium that we had to put up with through t he balance of the first season. During the summer, an engineer donated his services to design a truss in the attic that should hold a ten-ton truck. We laid out the pieces on stage, and carried them into the attic for assembly, one at a time. Since this was summer, the attic must have been 110 degrees! Unfortunately, although strong, there seemed to be enough \"play\" in this beam to let the ceiling sag several inchers, so we later added the big laminated beam now visible above the seats to correct the sag.\n​\nDespite the comfortable old building that Shoestring has become, it has always been our dream to be able to build a new modern theater in a more accessible location. Several years ago John and Ann Marshall contributed a valuable piece of property for that purpose. When it became apparent that such a project was far in the future, the Marshall's gave us permission to sell the land. We were able to purchase our present building mortgage free, and make several improvements because of their generosity. The balance of their contribution, together with other contributions, is held in our building fund for that dreamed of day when we can build an all new facility.\n​\nA person looking for a way to leave a lasting memorial to a loved one or to himself could do no better than to build such a building. It would be a living memorial, used by the community while the person's name would be kept alive.\n​\nShoestring is classed by the Internal Revenue Service as an educational and community group so that contributions are tax deductible. We believe that we earn that classification in addition to providing entertainment and fun. We do one show each summer aimed at children and young people, and use in all our shows as many young people and true amateur actors as possible. It is amazing to see how many children and adults gain confidence in appearing before groups and learning to take responsibility through participating in theater. We start with someone who says, \"I could never get up in front of people like that.\" Much of the fear of speaking to people is the thought that you do not have anything to say that people want to hear. In a show, you are speaking someone else's words so you aren't afraid to say them. After a couple shows, you can speak your own words just as easily as the playwright's words.\n​\nOver the years, we have fulfilled Ella DeBerard's idea of a place for local writers to try out their writings. We did several of Ell's shows, including \"The Sexagenarians\", first presented in 1972 with Chuck Easley and Eleanore Woodruff in the cast, which we repeated at Lake Helen as a special tribute to Ella, then living at John Knox . We produced a play, \"Just the Two of Us\" and \"The Reluctant Rebel\", a musical with both words and music by Gerald Critoph, a play by Charles Nelson, and several other locally written plays. Unfortunately, the uncertainty of the success of untried shows and a question of whether these shows should be included in our regular season has kept us from presenting more original productions.\nSands Theater continues these same objectives from our shared founders, and present a number of Children's programs and original works.\nYou may hear someone say that they don't know how to meet new people. Try Shoestring!! We have had many friendships formed at the theater, some with a romantic conclusion. Chris Fennell met Georgia at the old airport theater and when they decided to marry, the wedding was performed on stage with Don Ammon, a notary public officiating. Don has performed on stage as a minister or priest a number of times, but that time was for real! More recently, Anne Miller and Bob Sollien met in \"My Fair Lady\" continued in \"The Sound of Music\", and married. Maureen Harland met Warren Whitehead in \"South Pacific\" and later in \"Man of La Mancha\" and is now happily wed. Mia Waddoups and Marshall Lee met at Shoestring and married. Their first born, Mara, appeared on stage at less than a year old. And most recent of the Shoestring newlyweds are Cliff Weikal and Sally Daykin! We don't guarantee results, but give us a try!\n​\nTheater is a good family entertainment, even for established families. Many shows have several members of one family on stage, or in tech working together. When Jennifer Weeks came into Shoestring she was the fourth generation in Little Theater work, three generations at Shoestring- (David Miller, our treasurer and 50 year handy man, Anne, Miller and Jennifer) When Bob Sollien and Anne married, all four were in shows together.\nCome out to an audition, as listed on the schedule card and volunteer. Remember that it is not all acting. There is set construction, painting in the artistic sense, painting sets, lights and sound, props, ushering, and many other things. It is a real thrill to see the finished product and know you had a hand in it. Five-year old Emily Cara in \"The Sound of Music\" looked up after her first curtain call and said, \"They Clapped! I didn't know they were going to clap. I liked that!\"\n​\nGive it a try! Whether your contribution was as an actor, set builder or painter, stage manager,, lights, sound, box office or any of the other many jobs that go into a successful production, when you hear that applause, I think you will also say, \"They clapped! I liked that!\n/$\n/$\n$\n/$\n/$\n/$\n$\n$\n/$\n$\n$\nABOUT US\n/$\n/$\n$\nOur History\nA Community That Loves To Create\n/$\n$\nOn A SHOESTRING\nA More Complete History by Dave Miller\nTrue And Very Humorous\n​\nThe last years of the 1940's and the 1950's were years of new beginnings for many Americans. World War II was over. We were finishing up educations, getting married and starting families. Deland was slow and sleepy. Many stores and offices still closed on Wednesday afternoons. Despite the existence of the three theaters, the Athens, the Dreka and the drive-in, plus some great comedy shows on the radio, much of our entertainment was home grown. Television was still something we had read about and computers were punch card machines as big as a piano.\n​\nIt was into that picture that a local group envisioned an amateur theater. Alice and Martin Weisner floated the idea. Lillian Lyster whipped up the publicity and got a story in the Sun-News promoting a meeting at the old Chamber of Commerce on West New York Avenue, but it was Ella DeBerard who took the reins and for many years was the driving force. Ella wrote 6 plays that were produced at Shoestring, had two books published, along with many magazine articles. At Shoestring, Ella was President, directed many shows, acted, built sets and did the janitor work. She got her husband, Phil, into an early play, but he said, \"Never again!\"\n​\nThose first 20 or so people who met at the Chamber of Commerce were a diverse group but with a unifying interest in literature and Theater. Since I did not become an active member until 1955, I cannot accurately name the original organizers. Among the very early members were Bob Powe, Emma Ford, Joseph Crawley, George Stratler, Mrs. Floyd Pflough and a Mr. Liberman. In Deland, even Doctors had time for Theater, and Dr. Hutchinson and wife Peg, Dr. Ted Hahn, Dr. Frison and Dr. Roy DeShaw were active early.\n​\nThe first necessity for the group was to obtain a Theater. The Navy had just left the Airbase, and we soon found that the old mess hall was available. A busy group of volunteers started the remodeling job. While the remodeling was going on, the Players worked up a show, and in April of 1950, we presented \"The Saturday Evening Ghost\" at the old Deland High School auditorium. Our tickets were priced at $1.00.\n​\nThe Navy mess hall was a large frame structure with a flat concrete floor and about a 12-ft ceiling. The budding thespians turned out a crowd of volunteers, and built a stage, assembled folding chairs for seats and constructed two dressing rooms the size of Superman's phone booth. The \"green room\" was the former dish washing room and contained a dishwasher the size and construction of a steam locomotive. We tried for Years to get rid of it, but neither the Navy nor the City would claim parenthood, so it finally disappeared. (About like making the Statue of Liberty vanish) There was no water, so someone ran a temporary hose over to a neighbor's property and hooked it into an outside spigot on both properties, feeding the water backward into our system. Like temporary taxes, it was still there 40 years later, so any of you wondered why the water at the Airport tasted like it came from a hose, it did. There was no air conditioning, and the heat came from two radiant gas heaters. It was like heating Madison Square Garden with a candle! There was one toilet backstage, and the flush was so noisy we could only flush at intermission.\n​\nThe audience took it in good-natured stride. On cold nights, they brought blankets and a thermos of hot coffee, or something stronger. Since there was no heat at all on stage, when the curtain opened, it was like opening the refrigerator. You could hear people in the first two rows gasp. On hot nights, we debated whether to leave everything open for cool air and mosquitoes or tough it out.\n​\nMy first show, REBECCA, with Don Ammon, was in the winter of 1955. The cast wore heavy underwear and sweaters under their Tuxes and other costumes. We made fast costume changes! We drank lots of hot coffee too. Unfortunately, some also brought something stronger, so we adopted a very strict \"no alcohol\" policy, which we enforce today.\n​\nOne of the famous theater sayings is \"Never perform with kids or animals.\" In truth, performing with kids is often fun, except that the drive you crazy by having all of their lines (and half of yours) while you are still struggling with Act I.\n​\nOn the animal front a good example is the dog named \"Horrid\" in Camelot. We went to the humane society and picked out the sorriest dog we could find, a scrawny Russian wolfhound. He came on stage with King Pellmore, played by Chuck Nelson. Just about the time Chuck would deliver one of his best lines, \"Horrid\" would look soulfully at the audience, and slowly scratch his ear with his hind foot. The audience never heard Chuck's line. By the time the show was over, \"Horrid\" had filled out to a pretty good-looking dog, and someone in the audience adopted him. Another dog actor was \"Luke\", a dog from Lake Helen, who played \"Sandy\" in \"Annie\" and also appeared in \"On Borrowed Time\". Luke was a gentleman, and a pleasure to work with.\n​\nOur \"volunteer\" animals were another story. There was a food processing plant next door at the airport (from whence we got the water for 40 years) that always had a dumpster with food waste and invariably, rats. The rats were pretty well fed and happy, but wanted to get ahead in the Arts, so they visited us often. Don Ammon tells of a scene he was in and the audience started to laugh. After checking to be sure his fly was zipped, he took a sneak peek around the stage, and found a rat strolling around. During another show, one climbed the back of the main curtain, and crawled completely across stage on the curtain hanging behind the proscenium. There were several women on stage and they never missed a line.\n​\nWhen the Dreka closed, we upgraded our seats to real (albeit unpadded) theater seats, already broken in with chewing gum. Later, we acquired the seats from a remodeling job at Daytona Playhouse, which we used even in Lake Helen until we bought our present seats. Our legal name was \"DeLand Players\" but we soon adopted the operating name \"Shoestring Theatre\" for good reason. We have always concentrated on volunteers, believing that the spirit and object of Community Theater was to involve the people in the community. We have never asked for Taxpayer support, although that has put us on thin ice at times. For many years it was not uncommon for the show director and cast members to have to contribute cash to pay the costs of the opening show, not always getting it back if the show played to a small audience. We also often called on season ticket buyers to buy early so we could use this cash to pay off last year's debts and open the coming season. (We presently hold season ticket money in the bank and draw only as it is earned).\n​\nA sad trend today is in the lack of volunteers. Like most social and civic organizations, we find that getting volunteers is increasingly difficult. Too many people would rather sit in a chair and be entertained by TV than to participate. Fortunately, we still have a number of really hard working, talented people at Shoestring who put in many hours, but we find we have to pay for many things that used to be done by volunteers. Despite our problems in these early years, we turned out a lot volunteers for work projects. One summer we reroofed the airport building with all volunteers, and that is like asking someone to work on Devil's Island. We had a regular Saturday construction crew nearly all around 80 years old. This group, led for years by Charlie Staines, built a lot of sets, made repairs to the building, etc. George Napoli was one of the younger members (meaning not quite 80) but he had bad knees, so he build a rolling platform to work from, known as the \"Napoli Mobile\". The group would bring a sandwich and work nearly every Saturday on set construction and Theater repairs.\n​\nIt is hard to list the names of our outstanding members, because someone will surely be left out, and too long a list puts the reader to sleep. Even so, the Theater history would be deficient without an attempt to recognize a few of the people who kept us running for over 50 years to date. Some of the early members are recognized elsewhere. Others not so mentioned are: Katie Ammon, Paunny Brandt, Ethel Capehart, Him and Ruthe Cochran, Becky Collison, Betty Day, Martha Desmond, Chuck Easley, Ned and Florence Grimes, Kay Hicks, June and Jack Liberman, Fred Messersmith, Anne Miller, Becky Nolan, Flo Perro, Leo and Leona Snedeker, George Statler, Florence and Pau Thuot, Clarence and Frances Woodard, and Eleanore Woodruff. This list follows the tradition of the Hall of Fame and lists only retired members. Our current group of hard working people will have to wait.\n​\nBy the mid 1980's things at our airport building were greatly improved. We had air conditioning and heat, improved the stage, the seating and every aspect of the Theater. We were able to put on musicals and other large productions. It was then that disaster struck. The City of DeLand wanted to upgrade the airport buildings and demolish Shoestring. After getting the building free for nearly 40 years, we could hardly complain, but we had to find another place. Unfortunately, this lead to a split in the Theater. We divided almost evenly, with half wanting to go into a large facility which would be shared by other groups and would not be entirely under Shoestring control, and half wanting to continue in a building of our own with a small, more intimate theater. A bare majority of our members felt that a large community run group would not understand the needs of a theater with amateur players, while the reminder felt that the larger facility could better serve a wider range of interests. This split caused problems for some time, but was a blessing in disguise for the community.\n​\nOne group, guided by Rene and Larry Sands, two good Shoestring people, became Sands Theater at Deland's Cultural Arts Center, which is able to present a wide range of productions including an outstanding Children's program. The remaining half, with the name \"Shoestring Theatre, Inc.\" remained closer to the old Little Theater concept with a more intimate atmosphere and small town approach. Both groups had to find a new home, and Shoestring was fortunate to find our present building.\n​\nThis building had been a well-regarded Black school in the days of school segregation, and after standing empty for several years, had been auctioned off by the School Board. Two Army Chaplains, John Smart and Lewis Long of Lake Helen were high bidders and bought the building with the intention of using it for a religious retreat for service men. It was to be like the summer camps of our youth, with cook outs, games and religious discussions. It proved unsuccessful, and they offered it to Shoestring at a very reasonable rent.\n​\nIn many ways, the building resembled our old home at the airport. It was a large frame building with a 12-ft ceiling. However, there were internal walls some of which had to be removed. Again, we did an amazing amount of work with volunteers. We used licensed workers for the electrical and plumbing, and a contractor for the heavy work. We called on hundreds of people for cash contribution, but raised only a bit over $30,000.00 in weeks of calling, so when that was gone, it was up to volunteers. In addition to theater members, several of the people in Lake Helen, and West Volusia including John and Bob Smart, Ron and Pat Sheedy and many with no connection to Shoestring put in days of work. We not only build the stage, seat ramp, light booth, restrooms, etc., but we went to the airport building and salvaged the material including all of the seats. Many theater people spent every day for nearly two months at one location or the other. We started tearing out the stage, seats, and everything movable from the airport the day after the last show closed and hauled them to Lake Helen where others were waiting to install them. We patched together old 2×4's, plywood, curtains, lighting equipment and anything movable before we would buy anything new. We even had several of the ladies pulling and straightening nails, removing screws, hinges, etc. and sorting them into jars. Some of the ladies were mighty handy with the hammers and saws too!\n​\nWe closed at the Airport with HARVEY in November and opened in February at Lake Helen with musical CAMELOT. The cast would come in one night and rehearse in the space where the seats should be. The next night there would be seats there so they would rehearse between piles of lumber where the stage would be, etc. Four days before opening, there were no restrooms for the audience. We cried on the plumber's shoulder, and he worked overtime to get them in. Volunteers built the restroom walls around him. In addition to contributed labor, we received an amazing amount of contributed material. Two air conditioning companies donated large used air conditioners, and installed one of them free. People donated plants, building material, new doors with damaged areas, etc…\n​\nWe almost lost the whole thing just before the contractor finished. There was a large brick column that appeared to be a chimney for the space heater that provided the only heat in the building prior to Shoestring. Alas, it was also the main support column for the roof and ceiling over the seats. Since it was in the middle of the stage, it had to go. Thinking that it was not essential, the contractor removed it , whereupon the roof and ceiling started to drop. The contractor put in a emergency support in the middle of the auditorium that we had to put up with through t he balance of the first season. During the summer, an engineer donated his services to design a truss in the attic that should hold a ten-ton truck. We laid out the pieces on stage, and carried them into the attic for assembly, one at a time. Since this was summer, the attic must have been 110 degrees! Unfortunately, although strong, there seemed to be enough \"play\" in this beam to let the ceiling sag several inchers, so we later added the big laminated beam now visible above the seats to correct the sag.\n​\nDespite the comfortable old building that Shoestring has become, it has always been our dream to be able to build a new modern theater in a more accessible location. Several years ago John and Ann Marshall contributed a valuable piece of property for that purpose. When it became apparent that such a project was far in the future, the Marshall's gave us permission to sell the land. We were able to purchase our present building mortgage free, and make several improvements because of their generosity. The balance of their contribution, together with other contributions, is held in our building fund for that dreamed of day when we can build an all new facility.\n​\nA person looking for a way to leave a lasting memorial to a loved one or to himself could do no better than to build such a building. It would be a living memorial, used by the community while the person's name would be kept alive.\n​\nShoestring is classed by the Internal Revenue Service as an educational and community group so that contributions are tax deductible. We believe that we earn that classification in addition to providing entertainment and fun. We do one show each summer aimed at children and young people, and use in all our shows as many young people and true amateur actors as possible. It is amazing to see how many children and adults gain confidence in appearing before groups and learning to take responsibility through participating in theater. We start with someone who says, \"I could never get up in front of people like that.\" Much of the fear of speaking to people is the thought that you do not have anything to say that people want to hear. In a show, you are speaking someone else's words so you aren't afraid to say them. After a couple shows, you can speak your own words just as easily as the playwright's words.\n​\nOver the years, we have fulfilled Ella DeBerard's idea of a place for local writers to try out their writings. We did several of Ell's shows, including \"The Sexagenarians\", first presented in 1972 with Chuck Easley and Eleanore Woodruff in the cast, which we repeated at Lake Helen as a special tribute to Ella, then living at John Knox . We produced a play, \"Just the Two of Us\" and \"The Reluctant Rebel\", a musical with both words and music by Gerald Critoph, a play by Charles Nelson, and several other locally written plays. Unfortunately, the uncertainty of the success of untried shows and a question of whether these shows should be included in our regular season has kept us from presenting more original productions.\nSands Theater continues these same objectives from our shared founders, and present a number of Children's programs and original works.\nYou may hear someone say that they don't know how to meet new people. Try Shoestring!! We have had many friendships formed at the theater, some with a romantic conclusion. Chris Fennell met Georgia at the old airport theater and when they decided to marry, the wedding was performed on stage with Don Ammon, a notary public officiating. Don has performed on stage as a minister or priest a number of times, but that time was for real! More recently, Anne Miller and Bob Sollien met in \"My Fair Lady\" continued in \"The Sound of Music\", and married. Maureen Harland met Warren Whitehead in \"South Pacific\" and later in \"Man of La Mancha\" and is now happily wed. Mia Waddoups and Marshall Lee met at Shoestring and married. Their first born, Mara, appeared on stage at less than a year old. And most recent of the Shoestring newlyweds are Cliff Weikal and Sally Daykin! We don't guarantee results, but give us a try!\n​\nTheater is a good family entertainment, even for established families. Many shows have several members of one family on stage, or in tech working together. When Jennifer Weeks came into Shoestring she was the fourth generation in Little Theater work, three generations at Shoestring- (David Miller, our treasurer and 50 year handy man, Anne, Miller and Jennifer) When Bob Sollien and Anne married, all four were in shows together.\nCome out to an audition, as listed on the schedule card and volunteer. Remember that it is not all acting. There is set construction, painting in the artistic sense, painting sets, lights and sound, props, ushering, and many other things. It is a real thrill to see the finished product and know you had a hand in it. Five-year old Emily Cara in \"The Sound of Music\" looked up after her first curtain call and said, \"They Clapped! I didn't know they were going to clap. I liked that!\"\n​\nGive it a try! Whether your contribution was as an actor, set builder or painter, stage manager,, lights, sound, box office or any of the other many jobs that go into a successful production, when you hear that applause, I think you will also say, \"They clapped! I liked that!\n/$\n/$\n$\n/$",
      "emails": [
        "2062d0a4929b45348643784b5cb39c36@sentry.wixpress.com",
        "605a7baede844d278b89dc95ae0a9123@sentry-next.wixpress.com",
        "88170cb0c9d64f94b5821ca7fd2d55a4@sentry-next.wixpress.com",
        "8eb368c655b84e029ed79ad7a5c1718e@sentry.wixpress.com",
        "info@shoestringtheatre.net"
      ]
    },
    {
      "url": "https://www.shoestringtheatre.net/contact",
      "is_candidate": false,
      "has_email": true,
      "text": "$\n$\n$\n/$\n$\nCONTACT US\n/$\n$\nContact Theatre Box Office\n/$\n$\nContact the Theatre Box Office for the latest information and to purchase ticket by phone. We will respond to your request as quickly as possible but please note our current office hours. Signing up for our email is the best way to get the latest news, use the link below. We can also be found on Facebook and Twitter. Have you been to any of our shows and want to leave a review? Go to our TripAdvisor listing and post a review. We want to hear from you.\n/$\n$\n/$\n$\nShoestring Theatre\n380 S. Goodwin Street,\nLake Helen, Florida 32744\n(386) 228-3777\nInfo@ShoestringTheatre.net\nOffice Hours:\nMonday - Friday 10 a.m. - 2 p.m.\n/$\n$\n$\n$\nJoin our mailing list\n/$\n$\n/$\n$\nJoin\n/$\n$\nThanks for submitting!\n/$\n/$\n/$\n$\n/$\n$\n/$\n/$\n/$\n$\n/$\n$\nCONTACT US\n/$\n$\nContact Theatre Box Office\n/$\n$\nContact the Theatre Box Office for the latest information and to purchase ticket by phone. We will respond to your request as quickly as possible but please note our current office hours. Signing up for our email is the best way to get the latest news, use the link below. We can also be found on Facebook and Twitter. Have you been to any of our shows and want to leave a review? Go to our TripAdvisor listing and post a review. We want to hear from you.\n/$\n$\n/$\n$\nShoestring Theatre\n380 S. Goodwin Street,\nLake Helen, Florida 32744\n(386) 228-3777\nInfo@ShoestringTheatre.net\nOffice Hours:\nMonday - Friday 10 a.m. - 2 p.m.\n/$\n$\n$\n$\nJoin our mailing list\n/$\n$\n/$\n$\nJoin\n/$\n$\nThanks for submitting!\n/$\n/$\n/$\n$\n/$\n$\n/$",
      "emails": [
        "2062d0a4929b45348643784b5cb39c36@sentry.wixpress.com",
        "605a7baede844d278b89dc95ae0a9123@sentry-next.wixpress.com",
        "88170cb0c9d64f94b5821ca7fd2d55a4@sentry-next.wixpress.com",
        "8eb368c655b84e029ed79ad7a5c1718e@sentry.wixpress.com",
        "info@shoestringtheatre.net"
      ]
    },
    {
      "url": "https://www.facebook.com/ShoestringTheatre",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    },
    {
      "url": "http://www.facebook.com/wix",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    }
  ],
  "all_links": [
    "https://www.shoestringtheatre.net/on-stage",
    "https://www.shoestringtheatre.net/copy-of-sponsor",
    "https://www.shoestringtheatre.net/services-3",
    "http://shoestringtheatre.net/contact-us/",
    "https://www.shoestringtheatre.net/copy-of-get-involved",
    "https://www.shoestringtheatre.net/special-events",
    "https://www.shoestringtheatre.net/about",
    "https://www.shoestringtheatre.net/contact",
    "https://www.shoestringtheatre.net/auditions",
    "https://www.shoestringtheatre.net/get-involved",
    "https://www.shoestringtheatre.net",
    "https://www.shoestringtheatre.net/2025-2026-season",
    "https://www.shoestringtheatre.net/copy-of-donate",
    "https://www.shoestringtheatre.net/copy-of-specialty-shows",
    "https://www.shoestringtheatre.net/tickets",
    "https://www.shoestringtheatre.net/copy-of-about"
  ],
  "candidate_links": [
    "http://shoestringtheatre.net/contact-us/",
    "https://www.shoestringtheatre.net/special-events",
    "https://www.shoestringtheatre.net/about",
    "https://www.shoestringtheatre.net/contact",
    "https://www.facebook.com/ShoestringTheatre",
    "http://www.facebook.com/wix"
  ],
  "visited": [
    "https://www.shoestringtheatre.net/",
    "https://www.shoestringtheatre.net/about",
    "https://www.shoestringtheatre.net/contact",
    "https://www.shoestringtheatre.net/staff",
    "https://www.shoestringtheatre.net/team",
    "https://www.shoestringtheatre.net/board",
    "https://www.shoestringtheatre.net/directory",
    "https://www.shoestringtheatre.net/events",
    "https://www.shoestringtheatre.net/sitemap.xml",
    "https://www.shoestringtheatre.net/council",
    "https://www.shoestringtheatre.net/leadership",
    "https://www.shoestringtheatre.net/management",
    "https://www.shoestringtheatre.net/producers",
    "https://www.shoestringtheatre.net/support",
    "https://www.shoestringtheatre.net/crew",
    "https://www.shoestringtheatre.net/members",
    "https://www.shoestringtheatre.net/bios",
    "https://www.shoestringtheatre.net/people",
    "https://www.shoestringtheatre.net/artists",
    "https://www.shoestringtheatre.net/musicians",
    "https://www.shoestringtheatre.net/faculty",
    "https://www.shoestringtheatre.net/administration",
    "http://shoestringtheatre.net/contact-us/",
    "https://www.shoestringtheatre.net/special-events",
    "https://www.shoestringtheatre.net/about",
    "https://www.shoestringtheatre.net/contact",
    "https://www.facebook.com/ShoestringTheatre",
    "http://www.facebook.com/wix"
  ],
  "base_url": "https://www.shoestringtheatre.net/"
}