{
  "pages": [
    {
      "url": "https://sjcpls.org/about/support/",
      "is_candidate": false,
      "has_email": true,
      "text": "Support SJCPLS\nFriends of the Library\nFriends of the Anastasia Island Branch Library\nPresident: Diane Grundy\nEmail:\nanastasiaislandfaibl@gmail.com\nFriends of the Anastasia Island Branch Library Application\nFriends of the Bartram Trail Library\nPresident: Mary Rice\nEmail:\ninfo@bartramtrailfol.org\nBT FOL Application Form\nWatch our BT FOL video\nFriends of the Hastings Branch Library\nPresident: Linda Freeman\nEmail:\nhastingsflfol@gmail.com\nHastings Friends of the Library Application\nWatch our Hastings FOL video\nFriends of the Main Library St. Augustine\nPresident: David Ross\nEmail:\nfolmainlibrary@gmail.com\nFriends of the Main Library St. Augustine Application\nWatch our Main FOL video\nFriends of the Ponte Vedra Beach Branch Library\nPresident: Leslie Kleiman\nFriends of the Ponte Vedra Beach Branch Library Website\nWatch our PVB FOL video\nFriends of the Southeast Branch\nPresident: Risa Walls\nEmail:\nfolseduck@gmail.com\nSoutheast Friends Application\nWatch our SE FOL video\nFriends of the Bookmobile\nfriendsofthebookmobile.sjcpls@gmail.com\nFriends of the Bookmobile Application\nVolunteer\nWe are always looking for good volunteers! Their service is absolutely vital to the Library’s day-to-day operations. Volunteers help with shelving, children’s programming, book processing, special events, and many other projects within the library.\nVolunteering is a good way to meet new people and gain valuable experience that can be useful in future endeavors.\nIf you are interested in signing up as a volunteer, please contact the appropriate branch listed below.\nDownload Volunteer Application Form\nEdit\nBranch Information\neMail\nMain Library: Carrie\ncmorgan@sjcfl.us\nPonte Vedra Library: Teri\ntvandewater@sjcfl.us\nBartram Trail Library: Nicholas S.\nnskunda@sjcfl.us\nSoutheast Library: Kris\nkmangus@sjcfl.us\nHastings Library: Rita\nmfoust@sjcfl.us\nAnastasia Island Library: Debbie\ndbraden@sjcfl.us\nSupport Services: Jae\njbass@sjcfl.us\nBuy Books in one of our bookstores\nSupport your local branch by purchasing used books from either the FOL Booksales, or through these FOL Bookstores.\nSeymour’s Bookstore in the Ponte Vedra Beach Branch Library\n. Open\nMonday through Friday, 10 a.m. to 6 p.m., and Saturday, 10 a.m. to 4 p.m., closed on Sunday.\nSoutheast Branch Library Bookstore.\nOpen Monday – Saturday, hours vary. Check the bookstore door or call 827-6900 for weekly hours.\nMain Branch Library Bookstore.\nOpen\nMonday through Saturday, 10:00 a.m. to 4:00 p.m.\nDonate\nWe are always grateful for\nmonetary donations\nor donations of gently used library materials such as books, DVDs, CDs, and Audiobooks. Your donations may be added to the library’s collection or sold at one of our Friends of the Library Booksales or bookstores. Either way benefits the library!\nAdvocate\nBe a library cheerleader. Help us spread the word about about the value of the library! Share your stories with others and tell them about your favorite library services and programs. Come to the county’s budget hearings and support funding to libraries. Contact your representatives in support of your library system. Learn about the Library Advisory Board and come to a meeting.\nJoin us on Facebook and invite everyone you know to do the same!",
      "emails": [
        "anastasiaislandfaibl@gmail.com",
        "cmorgan@sjcfl.us",
        "dbraden@sjcfl.us",
        "folmainlibrary@gmail.com",
        "folseduck@gmail.com",
        "friendsofthebookmobile.sjcpls@gmail.com",
        "hastingsflfol@gmail.com",
        "info@bartramtrailfol.org",
        "jbass@sjcfl.us",
        "kmangus@sjcfl.us",
        "libraryada@sjcfl.us",
        "mfoust@sjcfl.us",
        "nskunda@sjcfl.us",
        "tvandewater@sjcfl.us"
      ]
    },
    {
      "url": "https://sjcpls.org/about/",
      "is_candidate": false,
      "has_email": true,
      "text": "About Us\nBranch Information\nAnastasia Island Branch\n124 Seagrove Main St.\nSt. Augustine Beach, FL 32080\nPhone:\n(904) 209-3730\nEmail:\nlibai@sjcfl.us\nBartram Trail Branch\n60 Davis Pond Blvd.\nFruit Cove, FL 32259\nPhone:\n(904) 827-6960\nEmail:\nlibbt@sjcfl.us\nHastings Branch\nMailing Address:\nP.O. Box 367\nHastings, FL 32145\nLocation Address:\nW.E. Harris Community Center, Rooms 402 & 403\n400 E. Harris St.\nHastings, FL 32145\nPhone:\n(904) 827-6970\nEmail:\nlibh@sjcfl.us\nMain Branch\n1960 N. Ponce De Leon Blvd.\nSt. Augustine, FL 32084\nPhone:\n(904) 827-6940\nEmail:\nlibm@sjcfl.us\nPonte Vedra Beach Branch\n101 Library Blvd.\nPonte Vedra Beach, FL 32082\nPhone:\n(904) 827-6950\nEmail:\nlibpv@sjcfl.us\nSoutheast Branch\n6670 US 1 South\nSt. Augustine, FL 32086\nPhone:\n(904) 827-6900\nEmail:\nlibse@sjcfl.us\nBookmobile\nPhone:\n(904) 827-6944\nEmail:\nlibbe@sjcfl.us\nAbout SJCPLS\nIn 1874, St. Augustine opened the oldest library in Florida as a “subscription library.” The library was called the St. Augustine Free Public Library. Patrons gave money to help buy books for the library, and there was no charge to check out items.\nBy the 1970s there were three independent libraries in St. Augustine, Hastings and Mill Creek serving the residents of St. Johns County. Through the hard work and dedication of many supporters, especially the members of the Association of American University Women, a Library System was born.\nOn September 27, 1977, the St. Johns County Board of County Commissioners voted to establish a Library System for the County, along with a Library Advisory Board. Within 10 years a new 15,000 square foot Main Library would be opened, followed in coming years by the construction of five more branch libraries and the addition of two bookmobiles. The growth of St. Johns County has been mirrored by the growth of its Library System!\nA timeline of our growth:\nThe Main Library\nThe Northeast Corner of Florida was dubbed “The First Coast” in the 1980s to pay tribute to the place where Europeans first set foot on U.S. soil in St. Augustine (the new name was also a marketing ploy to attract more tourists). However, new name aside, St. Augustine continued its tradition of being a leader by opening a subscription library in 1874 – the first library in Florida – thanks to the efforts of Francis L. Wilson, who negotiated with the U.S. Government to operate the library in two rooms of the U.S. Customs house (now Government House). In 1895 the Wilson family purchased a home on Aviles Street, which was the birthplace of Confederate General Edmund Kirby-Smith, and relocated the library to this location. The house served as the public library until the construction of the current library in 1987.  The library struggled for several decades as the country faced war and poverty, but thanks to the efforts of its patrons, including author Marjorie Kinnan Rawlings, who served as president of the library association from 1942 through 1943, it continued to serve the community. The later efforts of the American Association of University Women and the Junior Service League led to the establishment of a county library system. Today the Main Library continues to serve the community at its present location on Ponce de Leon Boulevard next to the Davenport Park.\nHastings Branch Library\nThe Town of Hastings’ first free-lending library was started in 1906 by the St. Johns Methodist Episcopal Church until the building was torn down in 1930. Fortunately, a group of 17 women, known as the Hastings Home Demonstration and Women’s Club, created a new library in June 1928. The club insisted that the library collection include books which would appeal to children – a progressive attitude, as at the time, many libraries did not serve children whom they believed to be a distraction for adult readers. Continuing the tradition of encouraging young children to read, Branch Librarian Margaret Stevens began offering programming for all children in the community in 1969 regardless of race, ensuring the library’s role as a community center for all. The library continued to operate under the club’s direction until it was incorporated into the St. Johns County Public Library System in 1997 and it is located in the former Hastings High School, which is part of the National Registry for Historic Buildings.\nBooks by Mail\nIn 1980, the Hastings Branch Library started a Books by Mail program as part of the Library Service Construction Act by the United States Congress. It operated in Hastings until 2010, when it relocated to the Southeast Branch. In the early years of the program, a circular was mailed out to those areas of St. Johns County not supported by a branch library. Patrons used the form in the circular to check off items they wanted and then sent in their requests by a special mail bag that guaranteed free postage to and from the library. The Books by Mail program evolved to serve patrons all over the State of Florida and items are now sent as far south as Vero Beach. The program still free for patrons who are not able to come into the library for medical reasons.\nPonte Vedra Beach Branch Library\nIn answer to the demand for increased library services across Saint Johns County, the Ponte Vedra Beach Branch Library opened in 1985 as a volunteer library in the County Annex Building. Thanks to the Friends of the Library and an exchange of donated property to the present site, the building on Library Boulevard was dedicated in May 1993. An addition to the structure opened in 2002, once again due to the efforts of the Friends. In addition to the attraction of the Friends of the Library bookstore, Seymour’s Books, and large number of program offerings available to patrons, Bird Island Park is a beautiful destination right outside the back door of the library. It offers library visitors a chance to observe migrating bird species as well as the local flora and fauna.\nBartram Trail Branch Library\nThe other library branch opened by the county in 1985 was the Bartram Trail Branch Library, which at that time was called the Northwest Library, and was located across from Wesley Manor, now Westminster Woods. The Bartram Branch was able to open thanks to a large number of donated books (many of which came from the Main Library in St. Augustine).  The County paid the rent, electricity and the salary of one branch manager, Nancy Tanzler and was only open about 20 hours a week.  As the library’s collection grew, so did its need for space and it re-located to the Food Lion Shopping Center. At that time, the County was able to pay two full time employees (Nancy Tanzler who continued to serve as branch manager and Betsy Gill as her assistant). In 1997, the branch moved from the shopping center to its present location, and in 2006, the library was expanded to the present configuration.\nBookmobile and Extension Services\nThe St. Johns County Public Library System established a bookmobile outreach program in 2000, with the support of a Library Services and Technology Act (LSTA) Grant. The service initially sought to assist the elderly, and was officially titled Library Elderly Outreach (LEO). Over time, the department and the services have grown. In 2008, a second bookmobile was added to expand outreach services to young people and the general public. The department has grown from two to five staff members and its focus has expanded to include youth services programs, as well as providing library service to a large portion of northern St. Johns County that is without a free standing branch library. The Bookmobiles also make appearances at many community events throughout the year and eventually the LEO acronym changed to reflect its dedication to the community at large by calling itself the Library Express Outreach. Bookmobile and Extension Services continue to grow, adding public stops in Nocatee and northwest St. Johns County.\nSoutheast Branch Library\nThe Southeast Branch opened its doors to the public on October 1, 2003, in response to a growing need for library services in the southern part of St. Johns County. Administrative Headquarters and Support Services, which were critically overcrowded at the Main Branch, relocated to the Southeast Branch at that time, followed by the Library Extension Services (Bookmobile) several years later. In addition to a welcoming staff, patrons are greeted by two decorative items that enhance the interior of the Southeast library – a giant quilt designed and graciously donated by the St. Augustine Piecemakers, which hangs directly above the entrance to the library, and a group of six historical St. Augustine photographs, given to the library by local photographer Betsy Lee.\nAnastasia Island Branch Library\nThe Anastasia Island Branch is the newest of the St. Johns County Libraries, celebrating ten years of operation on August 11, 2017! Since its opening, the Library has experienced growth far beyond the original expectations for this small Library. At only 8,000 square feet, the Anastasia Island Branch Library consistently leads the Library System in community programming and attendance. This is due to its proximity to the beach, which attracts a large number of long term visitors from other states and countries. As a result, the Anastasia Island Branch Library has a uniquely diverse clientele not seen at other branch locations. Located in a business center, the library has also become the local St. Augustine Beach Community Center. This was especially evident after Hurricane Matthew, as many came to the Library for emotional support, a free meeting place, and for recovery information.",
      "emails": [
        "libai@sjcfl.us",
        "libbe@sjcfl.us",
        "libbt@sjcfl.us",
        "libh@sjcfl.us",
        "libm@sjcfl.us",
        "libpv@sjcfl.us",
        "libraryada@sjcfl.us",
        "libse@sjcfl.us"
      ]
    },
    {
      "url": "https://sjcpls.org/about/advisory-board/",
      "is_candidate": false,
      "has_email": true,
      "text": "Advisory Board\nThe mission of the St. Johns County Library Advisory Board is to advise the Board of County Commissioners in the establishment, operation, and maintenance of a free public library system, which will provide organized access to meet educational, informational, recreational, and cultural needs of the general public.\nNotice of Meeting of the\nSt. Johns County Library Advisory Board\nNotice is hereby given\nthat the St. Johns County Library Advisory Board will hold monthly meetings at 9 a.m. on the second Wednesday of every month at various branch locations as noted below:\nAugust 13, 2025: The Waterworks at the\nMain Library\n(184 San Marco Ave., St. Augustine, FL)\nSeptember 10, 2025:\nPonte Vedra Beach Branch\nOctober 8, 2025:\nAnastasia Island Branch\nNovember 12, 2025:\nBartram Trail Branch\nDecember 10, 2025:\nSoutheast Branch\nThe purpose of the meeting is to discuss library issues and any other business of the advisory board. Agendas for the monthly meetings are located at\nwww.sjcpls.org/about/advisory-board/\n. Should the monthly meeting date or time need to be changed, a separate notice will be posted on the St. Johns County calendar located at\nwww.sjcfl.us/Calendars+/Index.aspx\ncontaining the updated information.\nIf a person decides to appeal any decision made with respect to any matter considered at the meeting he/she will need a record of the proceedings, and for such purpose he/she may need to ensure that a verbatim record of the proceedings is made, which record includes the testimony and evidence upon which the appeal is to be based.\nNotice to persons needing special accommodations and to all hearing impaired persons\n: In accordance with the Americans with Disabilities Act, persons needing a special accommodation to participate in the proceedings should contact ADA Coordinator, at (904) 209-0650 at the St. Johns County Administration Building, 500 San Sebastian View, St. Augustine, FL 32084. For hearing impaired individuals: Florida Relay Service: 1-800-955-8770, no later than 5 days prior to the date of the meeting.\n2025 Meeting Packets\nSeptember:\nPacket\nAugust:\nPacket\nJuly:\nPacket\nJune:\nPacket\nMay:\nPacket\nApril:\nPacket\nMarch:\nPacket\nFebruary:\nPacket\nJanuary:\nPacket\nPlease contact Library Administration at\n(904) 827-6925\nfor older archived LAB packets.\nView the\nLAB Bylaws\n.\nBoard and Committee Application\nLibrary Advisory Board Members:\nImage\nMember\nTerm\nMichael Macnamara\nDistrict#: 2\nAppt date: 2/20/18\nExp. date:  9/30/25\nMelvin Longo\nDistrict #: 5\nAppt date: 6/21/16\nExp. date: 10/18/26\nJohn Cellucci\nDistrict#: 4\nAppt date: 11/03/20\nExp. date: 10/15/28\nHeather Shaw-Stillman\nDistrict#: 3\nAppt date: 10/15/24\nExp. date: 10/15/28\nJessica Hayes\nDistrict#: At Large\nAppt date: 4/20/21\nExp date: 9/30/25\nNicholas Andrews\nDistrict #: 1\nAppt date: 10/18/22\nExp. date: 10/18/26\nEric Sarrett\nDistrict #: At Large\nAppt date: 5/16/23\nExp. date: 9/30/25\n#tablepress-3 from cache\nIn memory of Dr. Patricia “Pat” Laurencelle, Library Advisory Board Emeritus member and SJCPLS advocate.\nDr. Pat Laurencelle was a long-standing member of the Library Advisory Board, including holding the Chair position and working closely with the St. Johns County Board of County Commissioners during the LAB’s re-organization in the 1980s. Dr. Laurencelle was appointed an Emeritus member of the LAB in 2012 by the BCC in recognition of her contributions, advocacy, and dedication to our libraries. In 2015, she received the Northeast Florida Library Information Network’s Library Champion Award for her steadfast support of SJCPLS.\nThose who knew Dr. Laurencelle often referred to her as the “historian” for SJCPLS. She would attend every LAB meeting even when she was no longer on the board. She was known for her frank demeanor and sharp wit and was never shy about voicing her opinions. Her institutional knowledge, years of experience, enthusiasm for new service methods and technologies, wisdom, and passionate spirit will truly be missed.",
      "emails": [
        "libraryada@sjcfl.us"
      ]
    },
    {
      "url": "https://sjcpls.org/about/library-administration/",
      "is_candidate": false,
      "has_email": true,
      "text": "Library Administration\nLibrary Administrative\nHeadquarters\n6670 US 1 South\nSt. Augustine, FL 32086\nPhone: (904) 827-6925\nDebra Rhodes Gibson\nLibrary System Director\ndgibson@sjcfl.us\nJae Bass\nLibrary System Assistant Director\njbass@sjcfl.us\nHeather Sostrom\nManager of Public Services\nhsostrom@sjcfl.us\nMary Ann Yaw Sosa\nBusiness Manager\nmsosa@sjcfl.us\nLibrary Administration",
      "emails": [
        "dgibson@sjcfl.us",
        "hsostrom@sjcfl.us",
        "jbass@sjcfl.us",
        "libraryada@sjcfl.us",
        "msosa@sjcfl.us"
      ]
    },
    {
      "url": "https://www.facebook.com/profile.php?id=61559725775942",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    },
    {
      "url": "https://www.facebook.com/people/Friends-of-the-Library-Ponte-Vedra-Beach/61577695168397/",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    },
    {
      "url": "https://www.facebook.com/friendsofthesoutheastlibrary",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    },
    {
      "url": "https://www.facebook.com/profile.php?id=100094131074902",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    },
    {
      "url": "https://www.facebook.com/profile.php?id=100092401310104",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    },
    {
      "url": "https://www.facebook.com/sjcpls",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    },
    {
      "url": "https://www.facebook.com/profile.php?id=100064828659047",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    },
    {
      "url": "https://www.facebook.com/profile.php?id=100064759564510",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    }
  ],
  "all_links": [
    "https://sjcpls.org/tell-us-your-library-story/",
    "https://sjcpls.org/library-of-things/",
    "https://sjcpls.org/about/support/",
    "http://sjcpls.org/bookmobile/",
    "https://sjcpls.org/wp-content/uploads/2025/06/FOB-Membership-Form-Interim.pdf",
    "https://sjcpls.org/about/policiesplans/",
    "https://sjcpls.org/branches/",
    "https://sjcpls.org/sjcpls-celebrates-building-stronger-communities-for-lcsum/",
    "http://sjcpls.org/branches/main-branch/",
    "https://sjcpls.org/books-by-mail/",
    "https://sjcpls.org/wp-content/uploads/2019/07/VolunteerApplication.pdf",
    "http://sjcpls.org/wp-content/uploads/2019/11/SE-New-Membership-Form-2020.pdf",
    "https://sjcpls.org/wp-content/uploads/2025/04/Anastasia-Island-FOL-Brochure-2025.pdf",
    "https://sjcpls.org/library-card-sign-up-month/",
    "https://sjcpls.org/econtent/",
    "https://sjcpls.org/new-construction-updates/",
    "https://sjcpls.org/",
    "https://sjcpls.org/writers-resources/",
    "https://sjcpls.org/about/friends-of-the-library/",
    "https://sjcpls.org/help/",
    "http://sjcpls.org/branches/bartram-trail-branch/",
    "https://sjcpls.org/teens/",
    "https://sjcpls.org/wp-content/uploads/2024/03/Main-FOL-online-form.pdf",
    "https://sjcpls.org/explore/enewsletter-signup/",
    "https://sjcpls.org/?blackhole=c2dcbd5bd7",
    "http://sjcpls.org/wp-content/uploads/2019/07/Friends-of-the-library-Brochure-Hastings-2018.pdf",
    "https://sjcpls.org/wp-content/uploads/2023/10/Bartram-Trail-Membership-Form-2024.pdf",
    "https://sjcpls.org/wp-admin/admin.php?page=tablepress&action=edit&table_id=2",
    "https://sjcpls.org/branches/southeast-branch/",
    "https://sjcpls.org/library-news/",
    "https://sjcpls.org/branches/hastings-branch/",
    "https://sjcpls.org/catalog-app/",
    "http://sjcpls.org/branches/southeast-branch/",
    "https://sjcpls.org/about/",
    "https://sjcpls.org/digital-newspapers/",
    "https://sjcpls.org/mobile-printing/",
    "https://sjcpls.org/help/#Loan_Periods",
    "http://sjcpls.org/branches/ponte-vedra-beach-branch/",
    "https://sjcpls.org/branches/anastasia-island-branch/",
    "https://sjcpls.org/wp-content/uploads/2025/03/2025-FOL-Brochure-Accessible.pdf",
    "https://sjcpls.org/about/advisory-board/",
    "https://sjcpls.org/explore/ill/",
    "https://sjcpls.org/wp-content/uploads/2021/10/Membership-Flyer.rev_.6.12.21.pdf",
    "https://sjcpls.org/branch-hours/",
    "https://sjcpls.org/branches/ponte-vedra-beach-branch/",
    "https://sjcpls.org/about/library-administration/",
    "http://sjcpls.org/branches/hastings-branch/",
    "https://sjcpls.org/branches/bookmobile/",
    "https://sjcpls.org/branches/main-branch/",
    "https://sjcpls.org/econtent/ebooks/",
    "https://sjcpls.org/donate/",
    "http://sjcpls.org/branches/anastasia-island-branch/",
    "https://sjcpls.org/econtent/small-business-resources/",
    "https://sjcpls.org/branches/bartram-trail-branch/",
    "https://sjcpls.org/kids/",
    "https://sjcpls.org/anastasia-island-branch-library-closed-for-renovations/",
    "https://sjcpls.org/about/policiesplans/#Finesandfees",
    "https://sjcpls.org/get-a-library-card-page/"
  ],
  "candidate_links": [
    "https://sjcpls.org/about/support/",
    "https://sjcpls.org/about/",
    "https://sjcpls.org/about/advisory-board/",
    "https://sjcpls.org/about/library-administration/",
    "https://www.facebook.com/profile.php?id=61559725775942",
    "https://www.facebook.com/people/Friends-of-the-Library-Ponte-Vedra-Beach/61577695168397/",
    "https://www.facebook.com/friendsofthesoutheastlibrary",
    "https://www.facebook.com/profile.php?id=100094131074902",
    "https://www.facebook.com/profile.php?id=100092401310104",
    "https://www.facebook.com/sjcpls",
    "https://www.facebook.com/profile.php?id=100064828659047",
    "https://www.facebook.com/profile.php?id=100064759564510"
  ],
  "visited": [
    "http://www.sjcpls.org/",
    "http://www.sjcpls.org/about",
    "http://www.sjcpls.org/contact",
    "http://www.sjcpls.org/staff",
    "http://www.sjcpls.org/team",
    "http://www.sjcpls.org/board",
    "http://www.sjcpls.org/directory",
    "http://www.sjcpls.org/events",
    "http://www.sjcpls.org/sitemap.xml",
    "http://www.sjcpls.org/council",
    "http://www.sjcpls.org/leadership",
    "http://www.sjcpls.org/management",
    "http://www.sjcpls.org/producers",
    "http://www.sjcpls.org/support",
    "http://www.sjcpls.org/crew",
    "http://www.sjcpls.org/members",
    "http://www.sjcpls.org/bios",
    "http://www.sjcpls.org/people",
    "http://www.sjcpls.org/artists",
    "http://www.sjcpls.org/musicians",
    "http://www.sjcpls.org/faculty",
    "http://www.sjcpls.org/administration",
    "https://sjcpls.org/about/support/",
    "https://sjcpls.org/about/",
    "https://sjcpls.org/about/advisory-board/",
    "https://sjcpls.org/about/library-administration/",
    "https://www.facebook.com/profile.php?id=61559725775942",
    "https://www.facebook.com/people/Friends-of-the-Library-Ponte-Vedra-Beach/61577695168397/",
    "https://www.facebook.com/friendsofthesoutheastlibrary",
    "https://www.facebook.com/profile.php?id=100094131074902",
    "https://www.facebook.com/profile.php?id=100092401310104",
    "https://www.facebook.com/sjcpls",
    "https://www.facebook.com/profile.php?id=100064828659047",
    "https://www.facebook.com/profile.php?id=100064759564510"
  ],
  "base_url": "http://www.sjcpls.org/"
}