{
  "pages": [
    {
      "url": "https://www.slowburntheatre.org/contact-us",
      "is_candidate": false,
      "has_email": true,
      "text": "$\n$\n$\nContact Us\n/$\n$\n/$\n$\n** Special note for all ticketing requests**\n​\nThe Box Office and any ticket requests are handled by the Broward Center.\nSlow Burn Theatre has no access to any box office functions.\nPlease use the numbers below for requests over the phone:\n​\nFor Individual ticket requests, call the Broward Center Box Office\n954.462.0222, press 1 - Monday–Friday, 9:00 AM–5:00 PM\n​\nSlow Burn Subscription Customer Service - 954.468.3280\nMonday – Friday, 10:00 AM – 2:00 PM\nMessages will be returned within 2 business days\n​\nOutside of those hours and to receive the quickest response,\nplease follow the link to the Broward Center\nonline contact us form\n/$\n/$\n$\n$\n$\n$\nStill Need Help? Contact Us Here.\n/$\n$\n/$\n$\n/$\n$\n/$\n$\nHow can we help?\n/$\n$\n/$\n$\nSubmit\n/$\n$\nThanks for your message! For immediate ticketing help, please call 954-462-0222.\n/$\n/$\n/$\n/$\n$\n$\nThe Slow Burn Theatre at the\nBroward Center for the Performing Arts\n201 SW Fifth Avenue\nFort Lauderdale, FL 33312\n​\n/$\n$\nBroward Center’s AutoNation Box Office\nSingle Tickets: 954-462-0222, Option 1\nSeason Tickets:\n954-468-3280\nFax (954) 468-2555\nboxoffice@browardcenter.org\n​\n/$\n$\n/$\n/$\n/$\n$\nContact Us\n/$\n$\n/$\n$\n** Special note for all ticketing requests**\n​\nThe Box Office and any ticket requests are handled by the Broward Center.\nSlow Burn Theatre has no access to any box office functions.\nPlease use the numbers below for requests over the phone:\n​\nFor Individual ticket requests, call the Broward Center Box Office\n954.462.0222, press 1 - Monday–Friday, 9:00 AM–5:00 PM\n​\nSlow Burn Subscription Customer Service - 954.468.3280\nMonday – Friday, 10:00 AM – 2:00 PM\nMessages will be returned within 2 business days\n​\nOutside of those hours and to receive the quickest response,\nplease follow the link to the Broward Center\nonline contact us form\n/$\n$\n$\n$\nStill Need Help? Contact Us Here.\n/$\n$\n/$\n$\n/$\n$\n/$\n$\nHow can we help?\n/$\n$\n/$\n$\nSubmit\n/$\n$\nThanks for your message! For immediate ticketing help, please call 954-462-0222.\n/$\n/$\n/$\n$\nThe Slow Burn Theatre at the\nBroward Center for the Performing Arts\n201 SW Fifth Avenue\nFort Lauderdale, FL 33312\n​\n/$\n$\nBroward Center’s AutoNation Box Office\nSingle Tickets: 954-462-0222, Option 1\nSeason Tickets:\n954-468-3280\nFax (954) 468-2555\nboxoffice@browardcenter.org\n​\n/$\n$\n/$",
      "emails": [
        "605a7baede844d278b89dc95ae0a9123@sentry-next.wixpress.com",
        "88170cb0c9d64f94b5821ca7fd2d55a4@sentry-next.wixpress.com",
        "8eb368c655b84e029ed79ad7a5c1718e@sentry.wixpress.com",
        "boxoffice@browardcenter.org",
        "info@slowburntheatre.org"
      ]
    },
    {
      "url": "https://www.slowburntheatre.org/team",
      "is_candidate": false,
      "has_email": true,
      "text": "$\n$\n$\n$\n$\nSlow Burn Theatre Board and Officers\n/$\n$\n/$\n/$\n/$\n/$\n$\n$\n$\n$\n$\n$\n/$\n$\nBoard President\n/$\n$\nRyan Poliakoff\n/$\n$\nRyan Poliakoff, J.D., B.C.S. (Director, President) is a Board-Certified attorney specializing in Condominium and Planned Development Law. Mr. Poliakoff serves as general corporate counsel to condominium associations, homeowner’s associations, cooperatives and country clubs.  He has extensive experience preparing corporate documents and covenants, drafting and negotiating contracts and running board and shareholder meetings and elections. He is a certified Circuit Civil Court mediator and a Florida Supreme Court qualified arbitrator.\nIn addition to practicing law, Mr. Poliakoff writes a weekly article on condominium and planned development law for the Palm Beach Post and Florida Today, and his articles and editorials have appeared in newspapers and magazines nationwide.  He is the co-author of New Neighborhoods: A Consumer’s Guide to Condo, Co-Op and HOA Living—a nationally-published reference on shared ownership for board members, owners and volunteers.\nIn addition to law, Mr. Poliakoff has worked in marketing and public relations, representing large national corporations including Hasbro, Armor Hot Dogs and Revlon.  He has also served as a freelance copywriter.  Mr. Poliakoff has done substantial volunteer work in arts education, particularly with respect to development and marketing.\n/$\n/$\n$\n$\n/$\n$\nSecretary\n/$\n$\nMichael Mehmet\n/$\n$\nMichael’s passion and life’s work has centered upon both education and theatre arts.\nHe began his career in education as a New York City high school teacher in 1984. He advanced rapidly becoming Coordinator of Student Activities and moving into the administrative positions of Assistant Principal and, ultimately, becoming Principal of Repertory High School for the Performing Arts in Manhattan’s famed Theatre District. Michael initiated a partnership with Roundabout Theatre Company and, through his leadership Repertory High School became an A-Rated choice for students within the five boroughs desiring to study theatre arts. Due to his success at Repertory High School, Michael was tapped to serve as mentor and trainer to member principals within his network.\nMichael’s passion for live theatre brought him to the CM Performing Arts Center on Long Island’s south shore where he designed and built sets and directed main stage shows which ultimately lead to him being hired as Executive Director upon his retirement from the NYC Department of Education.\nAs Executive Director Michael was responsible for establishing budgets and monitoring finances, marketing, fundraising activities and staffing. He hired and managed an Artistic Director, Box Office Director and Financial Manager to assist with theatre operations. Some of Michael’s notable accomplishments at CM included managing the master schedule of shows and performances, establishing relationships with production companies and businesses within the theatre’s target market and establishing a procedure for measuring customer satisfaction and client feedback.\nUpon relocating to Fort Lauderdale in 2017, Michael immediately began volunteering at the food bank at Sunshine Cathedral, Art Serve and The Broward Center for the Performing Arts. He is now honored to have accepted a position on the Board of Directors of the Slow Burn Theatre Company where he hopes to continue to serve and fulfill his dream of supporting live theatre here in Broward County.\n/$\n/$\n$\n$\n/$\n$\nManaging Director\n/$\n$\nJulie Valent\n/$\n$\nJulie is a dedicated advocate for the transformative power of theatre and the arts. She is committed to elevating communities and fostering creativity. With a wealth of experience in South Florida's non-profit sector, Julie has played pivotal roles in fundraising and organizational leadership, shaping the region's cultural landscape.\nAs the Managing Director of Slow Burn Theatre Company, Julie continues her mission of enriching lives through the arts. Slow Burn Theatre is a non-profit professional regional theatre company based in Broward County. It collaborates with the Broward Center for the Performing Arts to deliver five main-stage productions annually. Julie's multifaceted role encompasses administrative oversight, strategic fundraising initiatives, and fostering relationships with donors and board members.\nPreviously, for nearly two decades, Julie served as the Executive Director/Producer of Story Theatre Productions, Inc., headquartered at the esteemed Parker Playhouse in Fort Lauderdale, Florida. Under her guidance, Story Theatre emerged as the premier presenter of educational live theatrical performances for young and family audiences in North America. Her vision and determination enabled Story Theatre to reach over 85,000 school children annually across professional venues in Tallahassee, Tampa, Orlando, Palm Beach, Fort Lauderdale, and Miami. This program was a model for current educational field trip programs at several performing arts centers throughout Florida.\nBeyond her theatrical endeavors, Julie is deeply engaged in community service and philanthropy. She serves as a board member of the Florida Theatrical Association, leveraging her expertise to advance the performing arts statewide. Additionally, Julie's involvement with organizations like the Holy Cross Hospital Auxiliary in Fort Lauderdale and her role as Founding President of Avant Garde Academy, Inc., underscore her commitment to education and community well-being.\nJulie's philanthropic efforts extend to co-chairing prominent galas in Broward County, such as the Holy Cross Hospital Gala and the American Cancer Society Gala, which further the missions of these vital organizations. Her leadership and strategic guidance have benefitted numerous initiatives, including the Avant Garde Academy Foundation, Inc., the YMCA of South Florida, the Miami-Dade County Fair, and the WannaGive Foundation.\nWith a proven track record of excellence in non-profit management, fundraising prowess, and a passion for community enrichment, Julie Valent continues to leave an indelible mark on South Florida's cultural landscape.\n/$\n/$\n$\n$\n/$\n$\nBoard Member\n/$\n$\nFrank Bolaños\n/$\n$\nFrank is an entrepreneur and leader in education reform and innovation. He is the Co-Founder and Chief Visionary Officer of the Avant Garde Academy schools and pre-schools. The AGA schools are based on successful STEAM and leadership programs with an international focus.\nAn avid supporter of the arts, he is the President of the Florida Theatrical Association, the presenter of Broadway Across America, based in Orlando, Florida and is on the Board of Directors of Slow Burn Theatre. He also is President of the Education Commission of the US Latin Chambers of Commerce (CAMACOL). Mr. Bolaños was recently elected to the Board of Directors of the International Schools Association headquartered in Geneva, Switzerland.\nMr. Bolaños served as Chairman of the Miami Dade County School Board, the third largest in the country with over 400 schools and 380,000 students. He is recognized as having led significant reforms and parental choice educational initiatives as the elected head of the school system.\nFrank is well versed not only in education, but also in business and finance, having been a senior executive with AT&T. He has served on the board of directors of several universities, chambers of commerce and other important public and private institutions.\nBolaños has extensive expertise in Education, Governmental affairs, non-profits, financing, start-ups, marketing, communications and the public sector. He has established successful public-private partnerships. He has obtained and overseen over $100 million (US) in grants and financing for preschools, private schools and public charter schools.\n/$\n/$\n$\n$\n/$\n$\nBoard Member\n/$\n$\nMarivi Bryant\n/$\n$\nMarivi serves as Vice President of Client Leadership at Isovera. In this role, Bryant leads the company's client growth and project management teams as well as business development efforts.\nShe is a Marketing Executive with over 20 years of corporate and agency experience. Bryant has worked in-house with the Phoenix Suns, State Farm and Blue Cross Blue Shield focusing on multicultural and sports marketing and consequently leading the Marketing and Programs team for The NASCAR Foundation.\nBryant transitioned from the corporate side when she joined the agency field, overseeing Client Relations and Operations at AC&M Cultural Agency in Charlotte North Carolina, RP3 Agency in Washington DC, and Zimmerman Agency in Fort Lauderdale, managing comprehensive strategic marketing campaigns for brands, including Family Dollar, Bojangles, New Balance, JetBlue Vacations, Girl Scouts of USA and Giant Foods to name a few.\nBryant is a former division I collegiate tennis player originally from Venezuela. She is an avid supporter of the arts and has served in various nonprofit boards including The Blumenthal Center for Performing Arts, Levine Museum and Arena Stage in Washington DC, currently a board member of Slow Burn Theater Company. She is a resident of Fort Lauderdale living with her husband Mathew and her two children, Logan and Lyla.\n/$\n/$\n$\n$\n/$\n$\nBoard Member\n/$\n$\nTonya Seavers Evans\n/$\n$\nTonya Seavers Evans has worked in public relations and marketing for over 20 years, and most recently joined UKG as a public relations strategist in May of 2022. Prior to this role, Tonya worked as marketing director at the Greater Fort Lauderdale Chamber of Commerce and held management roles in marketing and communications at North Broward Preparatory School, Johnson & Wales University, and the Greater Washington Boys & Girls Clubs. She began her career working in public relations firms and has also overseen internal communications at Fortune 500 companies such as Tyco ADT and Spherion.\nTonya received her bachelor’s degree from Florida International University in public relations and still loves the ever-changing landscape of the marketing, public relations and media industries. She credits her success to being curious, building great relationships, and understanding that her success is not a linear path but a personal journey.\nA committed community leader, Tonya is an active member of her sorority, Alpha Kappa Alpha, Inc.  and also supports organizations such as Broward County’s Emerging Cultural Leaders, SOS Village and Mentoring Tomorrow’s Leaders. In her spare time, she enjoys traveling, fiction writing, spending time with her family and friends and being a football and volleyball mom.\n/$\n/$\n$\n$\n/$\n$\nBoard Member\n/$\n$\nLorin Rodman\n/$\n$\nLorin was born and raised in South Florida. She attended the University of Florida where she obtained her Bachelor of Science degree in Telecommunication. While at the University of Florida she served as both the Panhellenic delegate and President of her sorority. After college, Lorin spent time in the financial sales world using her relationship building skills to manage territories along the entire east coast. Lorin also spent time as a High School teacher using her Telecom degree to teach TV production.  She served as the director of a large day camp and then stayed home for a few years to raise her three small children at the time.\nCurrently, Lorin works in the high school office at North Broward Preparatory school as the administrative assistant. Lorin is a self-described multi-tasker and thrives off of chaos. She has been married to her high school sweetheart, Todd, for 17 years, they share three active kids together and spend every second they are not working on the field attending youth sports games or in the theatre watching their children and friends perform. Lorin also has a passion for writing and storytelling, she has a small community blog where she shares funny lifestyle stories and fashion inspiration.\n/$\n/$\n$\n$\n/$\n$\nBoard Member\n/$\n$\nTodd Rodman\n/$\n$\nTodd Rodman was born in New York City and moved to South Florida at the age of eight. He attended Tallahassee Community College where he studied Sociology and played baseball. Following TCC, he attended Florida A&M University where he continued to play baseball at the D1 Level. He obtained his degree in Sociology and decided to pursue a career as a Sports Medicine Chiropractor. He attended Palmer Chiropractic College in Port Orange, FL.  After graduation Todd moved back down to his childhood home of Coral Springs. Todd started a successful Chiropractic practice in Boca Raton, FL. on the campus of West Boca Medical Center. It is his greatest joy to get people out of pain and doing what they love (especially when that means getting them back on stage!).  Just recently, Todd decided to expand his practice and went to school to be a Registered Nurse, he decided to take it a little farther and is now getting his degree as a Family Medicine Nurse Practitioner. Since 2010 Todd has also served as one of the official Chiropractors for FAU Athletics.\nIn 2017, Todd created his own Philanthropy called Wiffleblast. Todd had the pleasure of teaming up with the Jason Taylor Foundation to create a tournament that brought the community together while also raising a lot of money for pediatric emergencies and kids in the hospital battling cancer. This accolade is one of Todd's proudest accomplishments, giving back and getting to witness the love and care people have for one another is a priceless experience. Todd is a beloved coach on mostly all of the team's his kids play on and he has been known to grace the stage with his children at their children's theatre, Broadway Bound . Some of his most notable roles are Coach Bolton in HS Musical, Harold Ickes in Annie and Carlos in legally blonde.\nTodd is married to his wife, Lorin and they have three children. Todd is thrilled to be part of the Slow Burn board and is honored to be involved with such a prestigious, talented and incredible group of people.\n/$\n/$\n$\n$\n/$\n$\nBoard Member\n/$\n$\nMark Strauss\n/$\n$\nMark is excited to share his passion for theater and his background in education and leadership as a member of the SlowBurn board.  Mark served as both a teacher and an administrator in Broward Schools for 33 years where he was recognized as both Assistant Principal and Principal of the Year. He retired from education in December 2021 and now working as an independent travel advisor.  Mark also currently serves as Vice-President of his HOA board.  Previously, Mark has served as Chair of the Florida Education Practices Commission, as a board member of PDK International Education Association, and as Chair of the Wilton Manors Community Affairs Advisory Board.\n/$\n/$\n/$\n$\n/$\n$\nBoard Member\n/$\n$\nJoe Balchunas\n/$\n$\nJoseph Balchunas, a native New Yorker and a resident of Oakland Park, FL, is very proud to serve as a Board Member for Slow Burn Theater Company. Prior to his role on the board, Joe enjoyed serving as a loyal volunteer for Slow Burn Theater Company for four seasons.\nJoe has been employed by Broward County Public Schools for the last 30 years. As a teacher, he was honored with the prestigious, State of Florida and Broward County Teacher of the Year award. He is also a recipient of the Walt Disney Dreamers and Doers Award. As a school-based administrator for 18 years, Joseph was nominated for Principal of the Year for Broward County Schools. Currently, he is serving as a Director of Teaching and Learning for Broward Schools and is a Ph. D. Candidate at Florida Atlantic University.\nIn addition to his volunteer work with Slow Burn, Joe volunteers for the South Florida Tennis Club and works with local organizations that provide support and outreach to families and students in distress. In his spare time, Joe enjoys a round of tennis, theater, concerts, and enjoys cooking and baking.\nJoe believes that theater is an experience that everyone should be able to enjoy. In his words. “Every show produced is pure magic, and Slow Burn is the epitome of excellence in transforming musical theater one show at a time.”\n/$\n$\n/$\n$\nBoard Member\n/$\n$\nDavid Diaz\n/$\n$\nHaving found my perfect home in South Florida after leaving New York thirty years ago, I have never once looked back. Engaging in the world of real estate since 2005, I bring a unique perspective to the industry thanks to my background in international marketing management and my years of experience with a major insurance company. Standing out from the crowd, my unwavering dedication to customer service, innovation, and problem-solving has set me apart.\nDriven by a calling to assist others with compassion and concern, I wholeheartedly embraced the opportunity to be involved in various nonprofits and charitable organizations. Although making choices was not easy, I selected the ones that meant the most to me. Through a dear friend, I came across Slow Burn Theater, and it has become a significant part of my life as a current board member. With an enduring love for theater, I count myself fortunate to have witnessed and cherished every minute of their captivating shows. Slow Burn Theater takes great pride in showcasing the finest contemporary musical theater to the South Florida community.\nMy heart truly lies within the realm of artistic expression, and my mission is to inspire both adults and children to actively participate in the arts. I firmly believe that art should be accessible to all, and that nurturing creativity from a young age is of utmost importance.\nIn my capacity as a board member at Slow Burn Theatre, I eagerly anticipate our future achievements on stage. I am excited to welcome new audiences and subscribers, as together, we pave the way for a world where the transformative power of the arts knows no bounds.\n/$\n/$\n/$\n/$\n/$\n$\n$\n$\nSlow Burn Theatre Board and Officers\n/$\n$\n/$\n/$\n/$\n$\n$\nSlow Burn Theatre Board and Officers\n/$\n$\n/$\n/$\n$\n$\n$\n$\n$\n/$\n$\nBoard President\n/$\n$\nRyan Poliakoff\n/$\n$\nRyan Poliakoff, J.D., B.C.S. (Director, President) is a Board-Certified attorney specializing in Condominium and Planned Development Law. Mr. Poliakoff serves as general corporate counsel to condominium associations, homeowner’s associations, cooperatives and country clubs.  He has extensive experience preparing corporate documents and covenants, drafting and negotiating contracts and running board and shareholder meetings and elections. He is a certified Circuit Civil Court mediator and a Florida Supreme Court qualified arbitrator.\nIn addition to practicing law, Mr. Poliakoff writes a weekly article on condominium and planned development law for the Palm Beach Post and Florida Today, and his articles and editorials have appeared in newspapers and magazines nationwide.  He is the co-author of New Neighborhoods: A Consumer’s Guide to Condo, Co-Op and HOA Living—a nationally-published reference on shared ownership for board members, owners and volunteers.\nIn addition to law, Mr. Poliakoff has worked in marketing and public relations, representing large national corporations including Hasbro, Armor Hot Dogs and Revlon.  He has also served as a freelance copywriter.  Mr. Poliakoff has done substantial volunteer work in arts education, particularly with respect to development and marketing.\n/$\n/$\n$\n$\n/$\n$\nSecretary\n/$\n$\nMichael Mehmet\n/$\n$\nMichael’s passion and life’s work has centered upon both education and theatre arts.\nHe began his career in education as a New York City high school teacher in 1984. He advanced rapidly becoming Coordinator of Student Activities and moving into the administrative positions of Assistant Principal and, ultimately, becoming Principal of Repertory High School for the Performing Arts in Manhattan’s famed Theatre District. Michael initiated a partnership with Roundabout Theatre Company and, through his leadership Repertory High School became an A-Rated choice for students within the five boroughs desiring to study theatre arts. Due to his success at Repertory High School, Michael was tapped to serve as mentor and trainer to member principals within his network.\nMichael’s passion for live theatre brought him to the CM Performing Arts Center on Long Island’s south shore where he designed and built sets and directed main stage shows which ultimately lead to him being hired as Executive Director upon his retirement from the NYC Department of Education.\nAs Executive Director Michael was responsible for establishing budgets and monitoring finances, marketing, fundraising activities and staffing. He hired and managed an Artistic Director, Box Office Director and Financial Manager to assist with theatre operations. Some of Michael’s notable accomplishments at CM included managing the master schedule of shows and performances, establishing relationships with production companies and businesses within the theatre’s target market and establishing a procedure for measuring customer satisfaction and client feedback.\nUpon relocating to Fort Lauderdale in 2017, Michael immediately began volunteering at the food bank at Sunshine Cathedral, Art Serve and The Broward Center for the Performing Arts. He is now honored to have accepted a position on the Board of Directors of the Slow Burn Theatre Company where he hopes to continue to serve and fulfill his dream of supporting live theatre here in Broward County.\n/$\n/$\n$\n$\n/$\n$\nManaging Director\n/$\n$\nJulie Valent\n/$\n$\nJulie is a dedicated advocate for the transformative power of theatre and the arts. She is committed to elevating communities and fostering creativity. With a wealth of experience in South Florida's non-profit sector, Julie has played pivotal roles in fundraising and organizational leadership, shaping the region's cultural landscape.\nAs the Managing Director of Slow Burn Theatre Company, Julie continues her mission of enriching lives through the arts. Slow Burn Theatre is a non-profit professional regional theatre company based in Broward County. It collaborates with the Broward Center for the Performing Arts to deliver five main-stage productions annually. Julie's multifaceted role encompasses administrative oversight, strategic fundraising initiatives, and fostering relationships with donors and board members.\nPreviously, for nearly two decades, Julie served as the Executive Director/Producer of Story Theatre Productions, Inc., headquartered at the esteemed Parker Playhouse in Fort Lauderdale, Florida. Under her guidance, Story Theatre emerged as the premier presenter of educational live theatrical performances for young and family audiences in North America. Her vision and determination enabled Story Theatre to reach over 85,000 school children annually across professional venues in Tallahassee, Tampa, Orlando, Palm Beach, Fort Lauderdale, and Miami. This program was a model for current educational field trip programs at several performing arts centers throughout Florida.\nBeyond her theatrical endeavors, Julie is deeply engaged in community service and philanthropy. She serves as a board member of the Florida Theatrical Association, leveraging her expertise to advance the performing arts statewide. Additionally, Julie's involvement with organizations like the Holy Cross Hospital Auxiliary in Fort Lauderdale and her role as Founding President of Avant Garde Academy, Inc., underscore her commitment to education and community well-being.\nJulie's philanthropic efforts extend to co-chairing prominent galas in Broward County, such as the Holy Cross Hospital Gala and the American Cancer Society Gala, which further the missions of these vital organizations. Her leadership and strategic guidance have benefitted numerous initiatives, including the Avant Garde Academy Foundation, Inc., the YMCA of South Florida, the Miami-Dade County Fair, and the WannaGive Foundation.\nWith a proven track record of excellence in non-profit management, fundraising prowess, and a passion for community enrichment, Julie Valent continues to leave an indelible mark on South Florida's cultural landscape.\n/$\n/$\n$\n$\n/$\n$\nBoard Member\n/$\n$\nFrank Bolaños\n/$\n$\nFrank is an entrepreneur and leader in education reform and innovation. He is the Co-Founder and Chief Visionary Officer of the Avant Garde Academy schools and pre-schools. The AGA schools are based on successful STEAM and leadership programs with an international focus.\nAn avid supporter of the arts, he is the President of the Florida Theatrical Association, the presenter of Broadway Across America, based in Orlando, Florida and is on the Board of Directors of Slow Burn Theatre. He also is President of the Education Commission of the US Latin Chambers of Commerce (CAMACOL). Mr. Bolaños was recently elected to the Board of Directors of the International Schools Association headquartered in Geneva, Switzerland.\nMr. Bolaños served as Chairman of the Miami Dade County School Board, the third largest in the country with over 400 schools and 380,000 students. He is recognized as having led significant reforms and parental choice educational initiatives as the elected head of the school system.\nFrank is well versed not only in education, but also in business and finance, having been a senior executive with AT&T. He has served on the board of directors of several universities, chambers of commerce and other important public and private institutions.\nBolaños has extensive expertise in Education, Governmental affairs, non-profits, financing, start-ups, marketing, communications and the public sector. He has established successful public-private partnerships. He has obtained and overseen over $100 million (US) in grants and financing for preschools, private schools and public charter schools.\n/$\n/$\n$\n$\n/$\n$\nBoard Member\n/$\n$\nMarivi Bryant\n/$\n$\nMarivi serves as Vice President of Client Leadership at Isovera. In this role, Bryant leads the company's client growth and project management teams as well as business development efforts.\nShe is a Marketing Executive with over 20 years of corporate and agency experience. Bryant has worked in-house with the Phoenix Suns, State Farm and Blue Cross Blue Shield focusing on multicultural and sports marketing and consequently leading the Marketing and Programs team for The NASCAR Foundation.\nBryant transitioned from the corporate side when she joined the agency field, overseeing Client Relations and Operations at AC&M Cultural Agency in Charlotte North Carolina, RP3 Agency in Washington DC, and Zimmerman Agency in Fort Lauderdale, managing comprehensive strategic marketing campaigns for brands, including Family Dollar, Bojangles, New Balance, JetBlue Vacations, Girl Scouts of USA and Giant Foods to name a few.\nBryant is a former division I collegiate tennis player originally from Venezuela. She is an avid supporter of the arts and has served in various nonprofit boards including The Blumenthal Center for Performing Arts, Levine Museum and Arena Stage in Washington DC, currently a board member of Slow Burn Theater Company. She is a resident of Fort Lauderdale living with her husband Mathew and her two children, Logan and Lyla.\n/$\n/$\n$\n$\n/$\n$\nBoard Member\n/$\n$\nTonya Seavers Evans\n/$\n$\nTonya Seavers Evans has worked in public relations and marketing for over 20 years, and most recently joined UKG as a public relations strategist in May of 2022. Prior to this role, Tonya worked as marketing director at the Greater Fort Lauderdale Chamber of Commerce and held management roles in marketing and communications at North Broward Preparatory School, Johnson & Wales University, and the Greater Washington Boys & Girls Clubs. She began her career working in public relations firms and has also overseen internal communications at Fortune 500 companies such as Tyco ADT and Spherion.\nTonya received her bachelor’s degree from Florida International University in public relations and still loves the ever-changing landscape of the marketing, public relations and media industries. She credits her success to being curious, building great relationships, and understanding that her success is not a linear path but a personal journey.\nA committed community leader, Tonya is an active member of her sorority, Alpha Kappa Alpha, Inc.  and also supports organizations such as Broward County’s Emerging Cultural Leaders, SOS Village and Mentoring Tomorrow’s Leaders. In her spare time, she enjoys traveling, fiction writing, spending time with her family and friends and being a football and volleyball mom.\n/$\n/$\n$\n$\n/$\n$\nBoard Member\n/$\n$\nLorin Rodman\n/$\n$\nLorin was born and raised in South Florida. She attended the University of Florida where she obtained her Bachelor of Science degree in Telecommunication. While at the University of Florida she served as both the Panhellenic delegate and President of her sorority. After college, Lorin spent time in the financial sales world using her relationship building skills to manage territories along the entire east coast. Lorin also spent time as a High School teacher using her Telecom degree to teach TV production.  She served as the director of a large day camp and then stayed home for a few years to raise her three small children at the time.\nCurrently, Lorin works in the high school office at North Broward Preparatory school as the administrative assistant. Lorin is a self-described multi-tasker and thrives off of chaos. She has been married to her high school sweetheart, Todd, for 17 years, they share three active kids together and spend every second they are not working on the field attending youth sports games or in the theatre watching their children and friends perform. Lorin also has a passion for writing and storytelling, she has a small community blog where she shares funny lifestyle stories and fashion inspiration.\n/$\n/$\n$\n$\n/$\n$\nBoard Member\n/$\n$\nTodd Rodman\n/$\n$\nTodd Rodman was born in New York City and moved to South Florida at the age of eight. He attended Tallahassee Community College where he studied Sociology and played baseball. Following TCC, he attended Florida A&M University where he continued to play baseball at the D1 Level. He obtained his degree in Sociology and decided to pursue a career as a Sports Medicine Chiropractor. He attended Palmer Chiropractic College in Port Orange, FL.  After graduation Todd moved back down to his childhood home of Coral Springs. Todd started a successful Chiropractic practice in Boca Raton, FL. on the campus of West Boca Medical Center. It is his greatest joy to get people out of pain and doing what they love (especially when that means getting them back on stage!).  Just recently, Todd decided to expand his practice and went to school to be a Registered Nurse, he decided to take it a little farther and is now getting his degree as a Family Medicine Nurse Practitioner. Since 2010 Todd has also served as one of the official Chiropractors for FAU Athletics.\nIn 2017, Todd created his own Philanthropy called Wiffleblast. Todd had the pleasure of teaming up with the Jason Taylor Foundation to create a tournament that brought the community together while also raising a lot of money for pediatric emergencies and kids in the hospital battling cancer. This accolade is one of Todd's proudest accomplishments, giving back and getting to witness the love and care people have for one another is a priceless experience. Todd is a beloved coach on mostly all of the team's his kids play on and he has been known to grace the stage with his children at their children's theatre, Broadway Bound . Some of his most notable roles are Coach Bolton in HS Musical, Harold Ickes in Annie and Carlos in legally blonde.\nTodd is married to his wife, Lorin and they have three children. Todd is thrilled to be part of the Slow Burn board and is honored to be involved with such a prestigious, talented and incredible group of people.\n/$\n/$\n$\n$\n/$\n$\nBoard Member\n/$\n$\nMark Strauss\n/$\n$\nMark is excited to share his passion for theater and his background in education and leadership as a member of the SlowBurn board.  Mark served as both a teacher and an administrator in Broward Schools for 33 years where he was recognized as both Assistant Principal and Principal of the Year. He retired from education in December 2021 and now working as an independent travel advisor.  Mark also currently serves as Vice-President of his HOA board.  Previously, Mark has served as Chair of the Florida Education Practices Commission, as a board member of PDK International Education Association, and as Chair of the Wilton Manors Community Affairs Advisory Board.\n/$\n/$\n/$\n$\n/$\n$\nBoard Member\n/$\n$\nJoe Balchunas\n/$\n$\nJoseph Balchunas, a native New Yorker and a resident of Oakland Park, FL, is very proud to serve as a Board Member for Slow Burn Theater Company. Prior to his role on the board, Joe enjoyed serving as a loyal volunteer for Slow Burn Theater Company for four seasons.\nJoe has been employed by Broward County Public Schools for the last 30 years. As a teacher, he was honored with the prestigious, State of Florida and Broward County Teacher of the Year award. He is also a recipient of the Walt Disney Dreamers and Doers Award. As a school-based administrator for 18 years, Joseph was nominated for Principal of the Year for Broward County Schools. Currently, he is serving as a Director of Teaching and Learning for Broward Schools and is a Ph. D. Candidate at Florida Atlantic University.\nIn addition to his volunteer work with Slow Burn, Joe volunteers for the South Florida Tennis Club and works with local organizations that provide support and outreach to families and students in distress. In his spare time, Joe enjoys a round of tennis, theater, concerts, and enjoys cooking and baking.\nJoe believes that theater is an experience that everyone should be able to enjoy. In his words. “Every show produced is pure magic, and Slow Burn is the epitome of excellence in transforming musical theater one show at a time.”\n/$\n$\n/$\n$\nBoard Member\n/$\n$\nDavid Diaz\n/$\n$\nHaving found my perfect home in South Florida after leaving New York thirty years ago, I have never once looked back. Engaging in the world of real estate since 2005, I bring a unique perspective to the industry thanks to my background in international marketing management and my years of experience with a major insurance company. Standing out from the crowd, my unwavering dedication to customer service, innovation, and problem-solving has set me apart.\nDriven by a calling to assist others with compassion and concern, I wholeheartedly embraced the opportunity to be involved in various nonprofits and charitable organizations. Although making choices was not easy, I selected the ones that meant the most to me. Through a dear friend, I came across Slow Burn Theater, and it has become a significant part of my life as a current board member. With an enduring love for theater, I count myself fortunate to have witnessed and cherished every minute of their captivating shows. Slow Burn Theater takes great pride in showcasing the finest contemporary musical theater to the South Florida community.\nMy heart truly lies within the realm of artistic expression, and my mission is to inspire both adults and children to actively participate in the arts. I firmly believe that art should be accessible to all, and that nurturing creativity from a young age is of utmost importance.\nIn my capacity as a board member at Slow Burn Theatre, I eagerly anticipate our future achievements on stage. I am excited to welcome new audiences and subscribers, as together, we pave the way for a world where the transformative power of the arts knows no bounds.\n/$\n/$\n/$\n$\n$\n$\n$\n/$\n$\nBoard President\n/$\n$\nRyan Poliakoff\n/$\n$\nRyan Poliakoff, J.D., B.C.S. (Director, President) is a Board-Certified attorney specializing in Condominium and Planned Development Law. Mr. Poliakoff serves as general corporate counsel to condominium associations, homeowner’s associations, cooperatives and country clubs.  He has extensive experience preparing corporate documents and covenants, drafting and negotiating contracts and running board and shareholder meetings and elections. He is a certified Circuit Civil Court mediator and a Florida Supreme Court qualified arbitrator.\nIn addition to practicing law, Mr. Poliakoff writes a weekly article on condominium and planned development law for the Palm Beach Post and Florida Today, and his articles and editorials have appeared in newspapers and magazines nationwide.  He is the co-author of New Neighborhoods: A Consumer’s Guide to Condo, Co-Op and HOA Living—a nationally-published reference on shared ownership for board members, owners and volunteers.\nIn addition to law, Mr. Poliakoff has worked in marketing and public relations, representing large national corporations including Hasbro, Armor Hot Dogs and Revlon.  He has also served as a freelance copywriter.  Mr. Poliakoff has done substantial volunteer work in arts education, particularly with respect to development and marketing.\n/$\n/$\n$\n$\n/$\n$\nSecretary\n/$\n$\nMichael Mehmet\n/$\n$\nMichael’s passion and life’s work has centered upon both education and theatre arts.\nHe began his career in education as a New York City high school teacher in 1984. He advanced rapidly becoming Coordinator of Student Activities and moving into the administrative positions of Assistant Principal and, ultimately, becoming Principal of Repertory High School for the Performing Arts in Manhattan’s famed Theatre District. Michael initiated a partnership with Roundabout Theatre Company and, through his leadership Repertory High School became an A-Rated choice for students within the five boroughs desiring to study theatre arts. Due to his success at Repertory High School, Michael was tapped to serve as mentor and trainer to member principals within his network.\nMichael’s passion for live theatre brought him to the CM Performing Arts Center on Long Island’s south shore where he designed and built sets and directed main stage shows which ultimately lead to him being hired as Executive Director upon his retirement from the NYC Department of Education.\nAs Executive Director Michael was responsible for establishing budgets and monitoring finances, marketing, fundraising activities and staffing. He hired and managed an Artistic Director, Box Office Director and Financial Manager to assist with theatre operations. Some of Michael’s notable accomplishments at CM included managing the master schedule of shows and performances, establishing relationships with production companies and businesses within the theatre’s target market and establishing a procedure for measuring customer satisfaction and client feedback.\nUpon relocating to Fort Lauderdale in 2017, Michael immediately began volunteering at the food bank at Sunshine Cathedral, Art Serve and The Broward Center for the Performing Arts. He is now honored to have accepted a position on the Board of Directors of the Slow Burn Theatre Company where he hopes to continue to serve and fulfill his dream of supporting live theatre here in Broward County.\n/$\n/$\n$\n$\n/$\n$\nManaging Director\n/$\n$\nJulie Valent\n/$\n$\nJulie is a dedicated advocate for the transformative power of theatre and the arts. She is committed to elevating communities and fostering creativity. With a wealth of experience in South Florida's non-profit sector, Julie has played pivotal roles in fundraising and organizational leadership, shaping the region's cultural landscape.\nAs the Managing Director of Slow Burn Theatre Company, Julie continues her mission of enriching lives through the arts. Slow Burn Theatre is a non-profit professional regional theatre company based in Broward County. It collaborates with the Broward Center for the Performing Arts to deliver five main-stage productions annually. Julie's multifaceted role encompasses administrative oversight, strategic fundraising initiatives, and fostering relationships with donors and board members.\nPreviously, for nearly two decades, Julie served as the Executive Director/Producer of Story Theatre Productions, Inc., headquartered at the esteemed Parker Playhouse in Fort Lauderdale, Florida. Under her guidance, Story Theatre emerged as the premier presenter of educational live theatrical performances for young and family audiences in North America. Her vision and determination enabled Story Theatre to reach over 85,000 school children annually across professional venues in Tallahassee, Tampa, Orlando, Palm Beach, Fort Lauderdale, and Miami. This program was a model for current educational field trip programs at several performing arts centers throughout Florida.\nBeyond her theatrical endeavors, Julie is deeply engaged in community service and philanthropy. She serves as a board member of the Florida Theatrical Association, leveraging her expertise to advance the performing arts statewide. Additionally, Julie's involvement with organizations like the Holy Cross Hospital Auxiliary in Fort Lauderdale and her role as Founding President of Avant Garde Academy, Inc., underscore her commitment to education and community well-being.\nJulie's philanthropic efforts extend to co-chairing prominent galas in Broward County, such as the Holy Cross Hospital Gala and the American Cancer Society Gala, which further the missions of these vital organizations. Her leadership and strategic guidance have benefitted numerous initiatives, including the Avant Garde Academy Foundation, Inc., the YMCA of South Florida, the Miami-Dade County Fair, and the WannaGive Foundation.\nWith a proven track record of excellence in non-profit management, fundraising prowess, and a passion for community enrichment, Julie Valent continues to leave an indelible mark on South Florida's cultural landscape.\n/$\n/$\n$\n$\n/$\n$\nBoard Member\n/$\n$\nFrank Bolaños\n/$\n$\nFrank is an entrepreneur and leader in education reform and innovation. He is the Co-Founder and Chief Visionary Officer of the Avant Garde Academy schools and pre-schools. The AGA schools are based on successful STEAM and leadership programs with an international focus.\nAn avid supporter of the arts, he is the President of the Florida Theatrical Association, the presenter of Broadway Across America, based in Orlando, Florida and is on the Board of Directors of Slow Burn Theatre. He also is President of the Education Commission of the US Latin Chambers of Commerce (CAMACOL). Mr. Bolaños was recently elected to the Board of Directors of the International Schools Association headquartered in Geneva, Switzerland.\nMr. Bolaños served as Chairman of the Miami Dade County School Board, the third largest in the country with over 400 schools and 380,000 students. He is recognized as having led significant reforms and parental choice educational initiatives as the elected head of the school system.\nFrank is well versed not only in education, but also in business and finance, having been a senior executive with AT&T. He has served on the board of directors of several universities, chambers of commerce and other important public and private institutions.\nBolaños has extensive expertise in Education, Governmental affairs, non-profits, financing, start-ups, marketing, communications and the public sector. He has established successful public-private partnerships. He has obtained and overseen over $100 million (US) in grants and financing for preschools, private schools and public charter schools.\n/$\n/$\n$\n$\n/$\n$\nBoard Member\n/$\n$\nMarivi Bryant\n/$\n$\nMarivi serves as Vice President of Client Leadership at Isovera. In this role, Bryant leads the company's client growth and project management teams as well as business development efforts.\nShe is a Marketing Executive with over 20 years of corporate and agency experience. Bryant has worked in-house with the Phoenix Suns, State Farm and Blue Cross Blue Shield focusing on multicultural and sports marketing and consequently leading the Marketing and Programs team for The NASCAR Foundation.\nBryant transitioned from the corporate side when she joined the agency field, overseeing Client Relations and Operations at AC&M Cultural Agency in Charlotte North Carolina, RP3 Agency in Washington DC, and Zimmerman Agency in Fort Lauderdale, managing comprehensive strategic marketing campaigns for brands, including Family Dollar, Bojangles, New Balance, JetBlue Vacations, Girl Scouts of USA and Giant Foods to name a few.\nBryant is a former division I collegiate tennis player originally from Venezuela. She is an avid supporter of the arts and has served in various nonprofit boards including The Blumenthal Center for Performing Arts, Levine Museum and Arena Stage in Washington DC, currently a board member of Slow Burn Theater Company. She is a resident of Fort Lauderdale living with her husband Mathew and her two children, Logan and Lyla.\n/$\n/$\n$\n$\n/$\n$\nBoard Member\n/$\n$\nTonya Seavers Evans\n/$\n$\nTonya Seavers Evans has worked in public relations and marketing for over 20 years, and most recently joined UKG as a public relations strategist in May of 2022. Prior to this role, Tonya worked as marketing director at the Greater Fort Lauderdale Chamber of Commerce and held management roles in marketing and communications at North Broward Preparatory School, Johnson & Wales University, and the Greater Washington Boys & Girls Clubs. She began her career working in public relations firms and has also overseen internal communications at Fortune 500 companies such as Tyco ADT and Spherion.\nTonya received her bachelor’s degree from Florida International University in public relations and still loves the ever-changing landscape of the marketing, public relations and media industries. She credits her success to being curious, building great relationships, and understanding that her success is not a linear path but a personal journey.\nA committed community leader, Tonya is an active member of her sorority, Alpha Kappa Alpha, Inc.  and also supports organizations such as Broward County’s Emerging Cultural Leaders, SOS Village and Mentoring Tomorrow’s Leaders. In her spare time, she enjoys traveling, fiction writing, spending time with her family and friends and being a football and volleyball mom.\n/$\n/$\n$\n$\n/$\n$\nBoard Member\n/$\n$\nLorin Rodman\n/$\n$\nLorin was born and raised in South Florida. She attended the University of Florida where she obtained her Bachelor of Science degree in Telecommunication. While at the University of Florida she served as both the Panhellenic delegate and President of her sorority. After college, Lorin spent time in the financial sales world using her relationship building skills to manage territories along the entire east coast. Lorin also spent time as a High School teacher using her Telecom degree to teach TV production.  She served as the director of a large day camp and then stayed home for a few years to raise her three small children at the time.\nCurrently, Lorin works in the high school office at North Broward Preparatory school as the administrative assistant. Lorin is a self-described multi-tasker and thrives off of chaos. She has been married to her high school sweetheart, Todd, for 17 years, they share three active kids together and spend every second they are not working on the field attending youth sports games or in the theatre watching their children and friends perform. Lorin also has a passion for writing and storytelling, she has a small community blog where she shares funny lifestyle stories and fashion inspiration.\n/$\n/$\n$\n$\n/$\n$\nBoard Member\n/$\n$\nTodd Rodman\n/$\n$\nTodd Rodman was born in New York City and moved to South Florida at the age of eight. He attended Tallahassee Community College where he studied Sociology and played baseball. Following TCC, he attended Florida A&M University where he continued to play baseball at the D1 Level. He obtained his degree in Sociology and decided to pursue a career as a Sports Medicine Chiropractor. He attended Palmer Chiropractic College in Port Orange, FL.  After graduation Todd moved back down to his childhood home of Coral Springs. Todd started a successful Chiropractic practice in Boca Raton, FL. on the campus of West Boca Medical Center. It is his greatest joy to get people out of pain and doing what they love (especially when that means getting them back on stage!).  Just recently, Todd decided to expand his practice and went to school to be a Registered Nurse, he decided to take it a little farther and is now getting his degree as a Family Medicine Nurse Practitioner. Since 2010 Todd has also served as one of the official Chiropractors for FAU Athletics.\nIn 2017, Todd created his own Philanthropy called Wiffleblast. Todd had the pleasure of teaming up with the Jason Taylor Foundation to create a tournament that brought the community together while also raising a lot of money for pediatric emergencies and kids in the hospital battling cancer. This accolade is one of Todd's proudest accomplishments, giving back and getting to witness the love and care people have for one another is a priceless experience. Todd is a beloved coach on mostly all of the team's his kids play on and he has been known to grace the stage with his children at their children's theatre, Broadway Bound . Some of his most notable roles are Coach Bolton in HS Musical, Harold Ickes in Annie and Carlos in legally blonde.\nTodd is married to his wife, Lorin and they have three children. Todd is thrilled to be part of the Slow Burn board and is honored to be involved with such a prestigious, talented and incredible group of people.\n/$\n/$\n$\n$\n/$\n$\nBoard Member\n/$\n$\nMark Strauss\n/$\n$\nMark is excited to share his passion for theater and his background in education and leadership as a member of the SlowBurn board.  Mark served as both a teacher and an administrator in Broward Schools for 33 years where he was recognized as both Assistant Principal and Principal of the Year. He retired from education in December 2021 and now working as an independent travel advisor.  Mark also currently serves as Vice-President of his HOA board.  Previously, Mark has served as Chair of the Florida Education Practices Commission, as a board member of PDK International Education Association, and as Chair of the Wilton Manors Community Affairs Advisory Board.\n/$\n/$\n/$\n$\n/$\n$\nBoard Member\n/$\n$\nJoe Balchunas\n/$\n$\nJoseph Balchunas, a native New Yorker and a resident of Oakland Park, FL, is very proud to serve as a Board Member for Slow Burn Theater Company. Prior to his role on the board, Joe enjoyed serving as a loyal volunteer for Slow Burn Theater Company for four seasons.\nJoe has been employed by Broward County Public Schools for the last 30 years. As a teacher, he was honored with the prestigious, State of Florida and Broward County Teacher of the Year award. He is also a recipient of the Walt Disney Dreamers and Doers Award. As a school-based administrator for 18 years, Joseph was nominated for Principal of the Year for Broward County Schools. Currently, he is serving as a Director of Teaching and Learning for Broward Schools and is a Ph. D. Candidate at Florida Atlantic University.\nIn addition to his volunteer work with Slow Burn, Joe volunteers for the South Florida Tennis Club and works with local organizations that provide support and outreach to families and students in distress. In his spare time, Joe enjoys a round of tennis, theater, concerts, and enjoys cooking and baking.\nJoe believes that theater is an experience that everyone should be able to enjoy. In his words. “Every show produced is pure magic, and Slow Burn is the epitome of excellence in transforming musical theater one show at a time.”\n/$\n$\n/$\n$\nBoard Member\n/$\n$\nDavid Diaz\n/$\n$\nHaving found my perfect home in South Florida after leaving New York thirty years ago, I have never once looked back. Engaging in the world of real estate since 2005, I bring a unique perspective to the industry thanks to my background in international marketing management and my years of experience with a major insurance company. Standing out from the crowd, my unwavering dedication to customer service, innovation, and problem-solving has set me apart.\nDriven by a calling to assist others with compassion and concern, I wholeheartedly embraced the opportunity to be involved in various nonprofits and charitable organizations. Although making choices was not easy, I selected the ones that meant the most to me. Through a dear friend, I came across Slow Burn Theater, and it has become a significant part of my life as a current board member. With an enduring love for theater, I count myself fortunate to have witnessed and cherished every minute of their captivating shows. Slow Burn Theater takes great pride in showcasing the finest contemporary musical theater to the South Florida community.\nMy heart truly lies within the realm of artistic expression, and my mission is to inspire both adults and children to actively participate in the arts. I firmly believe that art should be accessible to all, and that nurturing creativity from a young age is of utmost importance.\nIn my capacity as a board member at Slow Burn Theatre, I eagerly anticipate our future achievements on stage. I am excited to welcome new audiences and subscribers, as together, we pave the way for a world where the transformative power of the arts knows no bounds.\n/$\n/$",
      "emails": [
        "605a7baede844d278b89dc95ae0a9123@sentry-next.wixpress.com",
        "88170cb0c9d64f94b5821ca7fd2d55a4@sentry-next.wixpress.com",
        "8eb368c655b84e029ed79ad7a5c1718e@sentry.wixpress.com",
        "info@slowburntheatre.org"
      ]
    },
    {
      "url": "https://www.slowburntheatre.org/about-1",
      "is_candidate": false,
      "has_email": true,
      "text": "$\n$\n$\nThis is Slow Burn\n/$\n$\n/$\n/$\n$\n$\nLearn More\n/$\n$\nUpcoming shows\n/$\n$\nPast Productions\n/$\n$\nElder Arts\n/$\n$\nOur History\n/$\n/$\n/$\n$\nThis is Slow Burn\n/$\n$\n/$\n$\nLearn More\n/$\n$\nUpcoming shows\n/$\n$\nPast Productions\n/$\n$\nElder Arts\n/$\n$\nOur History\n/$",
      "emails": [
        "605a7baede844d278b89dc95ae0a9123@sentry-next.wixpress.com",
        "88170cb0c9d64f94b5821ca7fd2d55a4@sentry-next.wixpress.com",
        "8eb368c655b84e029ed79ad7a5c1718e@sentry.wixpress.com",
        "info@slowburntheatre.org"
      ]
    },
    {
      "url": "https://www.facebook.com/Slowburntheatre/",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    }
  ],
  "all_links": [
    "https://www.slowburntheatre.org/tickets-shows",
    "https://www.slowburntheatre.org/our-mission",
    "https://www.slowburntheatre.org/auditions-employment",
    "https://www.slowburntheatre.org/elderarts",
    "https://www.slowburntheatre.org/contact-us",
    "https://www.slowburntheatre.org/photos",
    "https://www.slowburntheatre.org/team",
    "https://www.slowburntheatre.org",
    "https://www.slowburntheatre.org/our-founders",
    "https://www.slowburntheatre.org/plan-your-visit",
    "https://www.slowburntheatre.org/sponsors-donors",
    "https://www.slowburntheatre.org/firestarter-society",
    "https://www.slowburntheatre.org/about-1",
    "https://www.slowburntheatre.org/our-history"
  ],
  "candidate_links": [
    "https://www.slowburntheatre.org/contact-us",
    "https://www.slowburntheatre.org/team",
    "https://www.slowburntheatre.org/about-1",
    "https://www.facebook.com/Slowburntheatre/"
  ],
  "visited": [
    "https://www.slowburntheatre.org/",
    "https://www.slowburntheatre.org/about",
    "https://www.slowburntheatre.org/contact",
    "https://www.slowburntheatre.org/staff",
    "https://www.slowburntheatre.org/team",
    "https://www.slowburntheatre.org/board",
    "https://www.slowburntheatre.org/directory",
    "https://www.slowburntheatre.org/events",
    "https://www.slowburntheatre.org/sitemap.xml",
    "https://www.slowburntheatre.org/council",
    "https://www.slowburntheatre.org/leadership",
    "https://www.slowburntheatre.org/management",
    "https://www.slowburntheatre.org/producers",
    "https://www.slowburntheatre.org/support",
    "https://www.slowburntheatre.org/crew",
    "https://www.slowburntheatre.org/members",
    "https://www.slowburntheatre.org/bios",
    "https://www.slowburntheatre.org/people",
    "https://www.slowburntheatre.org/artists",
    "https://www.slowburntheatre.org/musicians",
    "https://www.slowburntheatre.org/faculty",
    "https://www.slowburntheatre.org/administration",
    "https://www.slowburntheatre.org/contact-us",
    "https://www.slowburntheatre.org/team",
    "https://www.slowburntheatre.org/about-1",
    "https://www.facebook.com/Slowburntheatre/"
  ],
  "base_url": "https://www.slowburntheatre.org/"
}