{
  "pages": [
    {
      "url": "https://snorkelwithmanatees.com/contact-us/",
      "is_candidate": false,
      "has_email": true,
      "text": "Contact Us\nSwim With Manatees\nPhone\n3522578687\nEnvelope\nmanateesnorkel@gmail.com\nMap Marker\n308 SE US Hwy 19, Crystal River, FL 34429, United States\nFacebook\nTripAdvisor\nContact Us\nWe look forward to hearing from you.\nName\n(Required)\nFirst\nLast\nEmail\n(Required)\nPhone\nSubject\nMessage\n(Required)\nEmail\nThis field is for validation purposes and should be left unchanged.\nΔ\nChevron down\nReservation & Cancellation Policy\nBy completing your booking, you acknowledge and agree to the following terms:\nAll deposits are non-refundable.\nHowever, they remain valid with no expiration and may be applied to a future reservation.\nCancellations made\nmore than 72 hours prior to your scheduled departure\nmay be eligible for a\n70% refund of the total amount paid.\nThe remaining 30% will be held as a credit toward a future booking with no expiration.\nCancellations made within\n72 hours of the scheduled departure time\nare not\neligible for a refund\n. A voucher will be issued,\nvalid for 1 year\n, and a\n$100 rebooking fee\nwill apply when rescheduling.\nIf we must cancel your charter due to\nweather, mechanical issues, safety concerns, or government mandates,\nyour full payment or deposit will remain valid with\nno expiration\n. A voucher will be issued, or a\n70% refund\nmay be available depending on your payment status.\nThe balance of your booking is due at the originally scheduled boarding time.\nBy placing a deposit, you reserve the ability to pay the remaining balance at check-in using alternate payment methods, such as travel rewards or point systems.\nBy checking the box, you confirm you understand and accept these terms.\nIn order to receive any assistance with a cancellation, an email will need to be sent to\n[email protected]\nand the Master Captains will reply\nSincerely, Swim With Manatees Crew!\nNo Shows will not receive a voucher\n.\nChevron down\nPeace Of Mind\nAs we all know, coronavirus information and updates are changing rapidly. Especially with large crowds. We are small groups, and a LOW-RISK environment not like theme parks or major sporting event. We have always specialised in groups of 6 or less.  As always we have cleaned and disinfected our equipment before each use. This is an industry standard and will always be enforced by our staff.  Please know that we are monitoring the situation and will follow the lead of the Centers for Disease Control (CDC) and local authorities as far as limiting the spread of the virus. All tours are running on time and we our receiving more bookings because of our small group settings.\n“We are encouraging you and our guides to stay home if sick and to practice good respiratory etiquette and hand washing”.\nSmall businesses, particularly those in tourism and hospitality,  cannot thank you enough for your continued business. Each Snorkeling with Manatee Tours ticket you purchase ensures multiple payments to each of our 8 Captains and Crew and supports the small but mighty team here at Snorkeling with Manatee tours. We are proud to be a part of the vibrant Citrus County Florida community we all love.\n-Captain Parker\nContact Us\nSwim With Manatees\nPhone\n3522578687\nEnvelope\nmanateesnorkel@gmail.com\nMap Marker\n308 SE US Hwy 19, Crystal River, FL 34429, United States\nFacebook\nTripAdvisor\nContact Us\nWe look forward to hearing from you.\nName\n(Required)\nFirst\nLast\nEmail\n(Required)\nPhone\nSubject\nMessage\n(Required)\nEmail\nThis field is for validation purposes and should be left unchanged.\nΔ\nChevron down\nReservation & Cancellation Policy\nBy completing your booking, you acknowledge and agree to the following terms:\nAll deposits are non-refundable.\nHowever, they remain valid with no expiration and may be applied to a future reservation.\nCancellations made\nmore than 72 hours prior to your scheduled departure\nmay be eligible for a\n70% refund of the total amount paid.\nThe remaining 30% will be held as a credit toward a future booking with no expiration.\nCancellations made within\n72 hours of the scheduled departure time\nare not\neligible for a refund\n. A voucher will be issued,\nvalid for 1 year\n, and a\n$100 rebooking fee\nwill apply when rescheduling.\nIf we must cancel your charter due to\nweather, mechanical issues, safety concerns, or government mandates,\nyour full payment or deposit will remain valid with\nno expiration\n. A voucher will be issued, or a\n70% refund\nmay be available depending on your payment status.\nThe balance of your booking is due at the originally scheduled boarding time.\nBy placing a deposit, you reserve the ability to pay the remaining balance at check-in using alternate payment methods, such as travel rewards or point systems.\nBy checking the box, you confirm you understand and accept these terms.\nIn order to receive any assistance with a cancellation, an email will need to be sent to\n[email protected]\nand the Master Captains will reply\nSincerely, Swim With Manatees Crew!\nNo Shows will not receive a voucher\n.\nChevron down\nPeace Of Mind\nAs we all know, coronavirus information and updates are changing rapidly. Especially with large crowds. We are small groups, and a LOW-RISK environment not like theme parks or major sporting event. We have always specialised in groups of 6 or less.  As always we have cleaned and disinfected our equipment before each use. This is an industry standard and will always be enforced by our staff.  Please know that we are monitoring the situation and will follow the lead of the Centers for Disease Control (CDC) and local authorities as far as limiting the spread of the virus. All tours are running on time and we our receiving more bookings because of our small group settings.\n“We are encouraging you and our guides to stay home if sick and to practice good respiratory etiquette and hand washing”.\nSmall businesses, particularly those in tourism and hospitality,  cannot thank you enough for your continued business. Each Snorkeling with Manatee Tours ticket you purchase ensures multiple payments to each of our 8 Captains and Crew and supports the small but mighty team here at Snorkeling with Manatee tours. We are proud to be a part of the vibrant Citrus County Florida community we all love.\n-Captain Parker\nGift\nBUY GIFT CARD\nSwim With Manatees\nPhone\n3522578687\nEnvelope\nmanateesnorkel@gmail.com\nMap Marker\n308 SE US Hwy 19, Crystal River, FL 34429, United States\nFacebook\nTripAdvisor\nQuick Details\nHome\nSee All tours\nLodging & Food\nFAQ\nAbout Us\nManatee Sightings\nSoft Encounters\nGood Neighbors Policy",
      "emails": [
        "manateesnorkel@gmail.com",
        "manateesnorkelingtours@gmail.com"
      ]
    },
    {
      "url": "https://snorkelwithmanatees.com/about-us/",
      "is_candidate": false,
      "has_email": true,
      "text": "About Us\nMANATEES & US\nOPERATIONS\nEXPECTATIONS\nTOURS\nSNORKELING\nCONDITIONS\nPRICES\nBRING & MEET\nPOLICY\nTOUR TIME\nAbout Swim With Manatees\nABOUT US AND MANATEES\nSwim With Manatees has been providing quality manatee tours and snorkeling tours for over 22 years every day. Not just in the migratory months (winter, when the seasonal tour guides show up) but every day, rain, sleet or snow. Ok, you know we don’t have snow — right? Ok, just checking…  Well now that I have your attention, please read on and enjoy.\nWe always welcome you to call and get the latest in conditions so you can make an educated decision. Here at Swim with Manatees and Sea Daddys Dive Team our motto is that ‘Honesty is the best Policy’. There is always an element of surprise, chance and conditions are variable from HOUR TO HOUR, but we will do our best to be understanding when it comes to what you can expect at any given time when scouting and searching for manatees.\nWe can never guarantee a manatee encounter. Rarely do we not find any animals, but it does happen occasionally. Do not expect a clear water experience, regardless of season. They are wild animals and move around freely. We can never predict how close you will get or how many you will see. this is not a theme park adventure or attraction.\n– Captain Parker\nWhen starting this business, 24 years ago, it was from the love of water and interacting with wildlife. We love to introduce Mother Nature to families from around the world to our local residents (manatees and dolphins), which support our conduct.    This business is designed to educate the public about the wildlife and its habitat in Citrus County.\nAs with some tour operators that cater to mass quantities of people all at once, we choose to cater to the mass quantities of people a little at a time. However, our prices might be a little more (2 to 3 bucks) than other tour guides. The reason is, we cater to small groups as with other operators that charge less, might have you on a boat with up to 18 or more passengers.\nBOAT OPERATIONS\nBy keeping our boat capacities small ( private 6 passengers only on a 10 – 15 passenger boat) it allows the customer to have the entire boat instead of a little spot to sit. This also allows us to keep our cost of operation consistent to pass it along to you. This also keeps so many people from congregating around manatees ( See Good Neighbors Policy) and allows for a better personal encounter and less impact on the manatees’ habitat. However, we can not control what other tour guides may do.\nBut since we are with a small group we can relocate to another area to get away from so many people if need be. You do not need 6 passengers to book a tour. If you have more than 6 passengers, we can arrange 2 boats to accommodate. Boats will travel separate but be together for the swimming portion of your tour.\nThe captains and crews that are contracted by our business always ensure the safety for our passengers and the habitat, to allow our future generations to be able to enjoy in the future. We would like to thank you in advance for your support and encouragement of this wonderful opportunity to explore this wildlife soft manatee encounter.\nREALISTIC EXPECTATIONS FOR MANATEES\nThe transitional seasons can be hard to predict and we are really in the hands of God and Mother Nature. Conditions are variable and tomorrow almost certainly WILL NOT be like yesterday! Please be understanding and patient, have realistic expectations and we will have a great time! The Official “Great Manatee Migratory Season” begins middle of October and runs through the end of April, but keep in mind that these are wild animals that do not have a calendar or smart phone to remind them when the time is coming! We DO have resident manatees that live here all year, but it is funny to see the resident manatee prepare for their migratory friends, come September.\nHaving our “Resident Manatee” (all year) combined with our “Migratory Manatees” is what really sets off the Magic of “Citrus County Florida” and its Manatees apart from other Manatee destinations. A combination of mothers with calves (they often times do no teach migratory patterns the first year of life), rehabilitated animals that enjoy the protection of the Bay Water in Citrus County, a few social, wacky manatee that never leave and orphaned animals denied the lesson of migration means, that we can consistently find at least a few manatee even on the warmest days all year. “The Magic of Manatees”.\nWhen visiting be fully informed and DO NOT expect to find the animals near the clear water of the springs. In warm weather, there is no reason for them to be near the springs and they tend to be on the move munching away where water is not always so clear.\nManatees require 10% OF THEIR BODY WEIGHT in food to survive everyday. That is a ton of greens. Health Statistics have always said “Eat Greens and Supersize Exercise to lose weight” have YOU SEEN a Manatee? They are huge, and all they do is eat greens and swim all day, I do not see much weight lose here. Local guide humor.\nWE understand that ON that rare occasion that we may not see a manatee, your going to feel frustrated. We do not plan for this because, it rarely happens. In such case of this rarity, we DO NOT offer any monetary compensations. BUT we maybe able to get you on another tour on a different day based on availability.\n-Parker\nSEMI-PRIVATE TOURS\nDon’t be confused with other operators (Tour Guide Companies) that offer a Semi-Private tour. This just means you will be sharing the boats with a small group. It is not a “PRIVATE” Tour. Funny, that if you google the term or phrase “Semi-Private” it refers to hospital beds…. Hmmm not sure about this one.\nWe offer shared boats, (what others called a “Semi-Private”) with never no more than six passengers per boat. If you would like a Private Tour, we also offer “\nHalf Day Private\n” and\n“\nFull Day Private\n”\nincluding lunch with only your passengers you bring with you.\nSNORKELING\nThis boat tour is recommended for all ages, however we recommend ages from two years old and up. You can choose to swim/snorkel or just ride on the boat. This manatee encounter is one of many Bucket List items and people travel from all over the world to interact with these majestic giants. This is not like snorkeling on a pretty reef in the Keys or the Bahamas where you have to hold your breath to go underwater. You just float using a mask ( if you choose) and snorkel (No Fins) to view these wonderful animals…\nExperience Snorkeling With The Manatees, for an experience of a lifetime, the way nature intended.    Below is what you can expect when you visit us for your Manatee swim experience.\nUpon arrival, and after signing the necessary paperwork, each guest will change into the rental wetsuits, or their own wetsuits.  After ensuring all the wet suits fit properly, we will play a short DVD, (filmed in cooperation with the United States Fish & Wildlife Service) which demonstrates how you must behave on a\nyour tour\nwhile interacting with manatees in their natural habitat in the water.\nNext, all guests and their US Coast Guard Certified Captain/Tour Guide will proceed to the “Landing” area and board our boats to embark on your manatee tour.\nWhile touring the bays and rivers in search of manatees, your Captain/Instructor/guide will teach you about manatees and their habitat, and answer any questions you may have. You may also expect to see: Monkeys, Bald Eagles, dolphins, otters, wild pigs, raccoons and a large array of local snowbirds.\nOnce the captain has found some friendly manatees, the anchor will be dropped and everyone will quietly enter the water to interact properly with the manatees. You may be allowed to take pictures, swim/snorkel with the manatees, and even, if the manatees allow, touching these amazing creatures, that is like winning the LOTTO.\nShare your memories and thoughts of your Manatee encounter on your way back to the “Landing”.\nMANATEES AND WATER CONDITIONS\nThe spring waters are always 72 degrees f (21 Celsius) all year.  This makes our waters feel very warm through the Citrus County winter months. The cooler months October thru April is when the migratory manatees stay and visit us in the clear spring waters to maintain their body warmth. These months give us the best viewing of manatees in the spring waters. During the summer months, the manatees can tolerate the bay waters which are 80 degrees plus. The bay waters may not be the clearest during the summer months but offer the manatees, food and warmth which is much needed for the manatee to survive.\nThis encounter is done in the inland waters of the Old Homosassa River and Crystal River Refuge – year round. If the Homosassa River is not producing manatee sightings during the summer months, we have the option to take you to the Crystal River Refuge. This allows us to choose the best water time for seeing manatees. This option is only carried out during the non migratory season (June – October) if needed. We are the only manatee tour guide service that has this option.\nThunderstorms typically do not affect our manatee tours for we are inland and not out in the gulf waters which are connected to the spring waters by river and canals. If the weather channel calls for a 60% chance of rain! It typically means a 60% chance of rain for 5 minutes. So thunder storms usually don’t affect our tours.\nMost common Tour Times 6:00 AM, 8:00 AM , 10:00 AM, 12:00 PM and 2:00 PM DAILY\n(tour start times do not reflect on length of tours)\nAll tour times are equal for manatee encounters. Let me explain! The manatees’ behavior all depends on what they do the night before, such as staying out late finding food or traveling to seek warmth. The old myth about getting out early (6 AM) was started between two tour operators years ago. One operator (tour guide) was just trying to beat the other tour operator out to the springs, so this became an industry standard comment.\nWhat is really funny is that these same operators claim that the “Early Morning ” is the best time while also saying the “The Sunset Manatee Adventure is the best” well that is a little misleading… We can tell you that no 2 tours are the same, that is why we only allow 6 passengers on our tour boats at one time. Since we have 7 boats in our fleet, this allows each boat to have its on personal tour (most days) unless the manatees are only in one area for that moment.\nThis is the Magic of Manatees, they are kind of like the hippies or gypsies of the river. They come and go as they want.\n– Parker\nAlso some tour operators will charge you more for an afternoon tour, just because they can. It is silly to say that the manatees are more active the first thing in the morning. They are wild animals and have no set pattern.\nFYI, if the majority of the tour operators say that you need to start early ( 6 am ish ) in the morning, wouldn’t you think that everyone will be starting at the crack of dawn… Just sayin!\nOur tour times are set for our guest, not the manatees.\nPRICES OF TOURS\nOur tour prices are set for your wallet. When researching other tour guides and services, look at what you get. When you compare apples to apples, we offer so much more. We include so much more for the money. Why? Because you are coming to us for a fun filled day and that’s how we would want to be treated. You, might see a lower price but you will get what you pay for. If you do the math and the break down, you will not be disappointed.\nThis is not a sales pitch, but the truth.\nSo what we have done is to minimize the impact on the manatees, is to only allow 6 people at a time on each boat with our selected tour times. So, no matter what the time of morning it is, the manatees are not affected by the huge crowds by only taking 6 passengers per boat. We suggest you start your tour the first part of the day from sunup to around 3 ish.\nThe reason we offer 3 tour times is that some of our guests have other obligations for the day, you know, Disney, Sea World, flights to catch or just hanging out with the grandparents. So, the 8 AM tour works for passengers that have afternoon plans. If you have any questions or doubts feel free to call or email.\nThe manatees are a lifestyle to us, not just a tourist attraction.\n– Captain Parker\nWHAT TO BRING AND WHERE TO MEET\nGetting ready for your manatee tour is very simple. Have your bathing suit on before leaving your Motel/Hotel, bring towels and a sweet shirt or hoodie. After your travel to our check in location, you will finish your check in. Then after a short briefing you will follow the captains to the boats. This travel time is about 6 – 12 minutes. Leave all of your bulky items( extra clothes, bags and towels) in your vehicles at check in location, ( Check in locations can very based on sightings, if different location is required, we will notify you upon booking) Since your driving you car to the boats, you will not need to unload all of your gear at the check in location.\nAfter reaching the boats, (Landings 1 or Landings 2) then you can bring all of your equipment and personals to board the boats. We ask that you be on time or just a few minutes early for your tour. This allows you and us to prepare for your manatee adventure, potty breaks, change into bathing suits with doning of wet suits and a short class room intro of manatee awareness.\nWe look forward to meeting you and your families very soon.\nCANCELLATION AND BOOKING POLICIES\nSnorkeling with Manatees and Sea Daddys have a very strict booking and cancellation program. This is to assure those that have bookings will have the crew and boats assigned to them for their day of fun. If we did not have policies it would be a mess for everyone. We might be a Mom and Pop operation but we cater to 100″s of Manatee Lovers, more than most tour guides in our area because we are not a chain or a corporate advent.\nTOUR TIMES AS FOLLOWS(3 hour charter) :\n6:00 AM\n8:00 AM\n10:00\nAM\n12:00 PM\n2:00 PM  for our 3 hour charter/cruise (tour start times do not reflect on length of tours)\nOur business was founded in 2000 when we decided to “go public” with some long-held family fun times. Response was immediately overwhelming. Starting from our own little docks and two employees, we now have five captains and continue to grow.\nAbout Us\nAbout Swim With Manatees\nABOUT US AND MANATEES\nSwim With Manatees has been providing quality manatee tours and snorkeling tours for over 22 years every day. Not just in the migratory months (winter, when the seasonal tour guides show up) but every day, rain, sleet or snow. Ok, you know we don’t have snow — right? Ok, just checking…  Well now that I have your attention, please read on and enjoy.\nWe always welcome you to call and get the latest in conditions so you can make an educated decision. Here at Swim with Manatees and Sea Daddys Dive Team our motto is that ‘Honesty is the best Policy’. There is always an element of surprise, chance and conditions are variable from HOUR TO HOUR, but we will do our best to be understanding when it comes to what you can expect at any given time when scouting and searching for manatees.\nWe can never guarantee a manatee encounter. Rarely do we not find any animals, but it does happen occasionally. Do not expect a clear water experience, regardless of season. They are wild animals and move around freely. We can never predict how close you will get or how many you will see. this is not a theme park adventure or attraction.\n– Captain Parker\nWhen starting this business, 24 years ago, it was from the love of water and interacting with wildlife. We love to introduce Mother Nature to families from around the world to our local residents (manatees and dolphins), which support our conduct.    This business is designed to educate the public about the wildlife and its habitat in Citrus County.\nAs with some tour operators that cater to mass quantities of people all at once, we choose to cater to the mass quantities of people a little at a time. However, our prices might be a little more (2 to 3 bucks) than other tour guides. The reason is, we cater to small groups as with other operators that charge less, might have you on a boat with up to 18 or more passengers.\nBOAT OPERATIONS\nBy keeping our boat capacities small ( private 6 passengers only on a 10 – 15 passenger boat) it allows the customer to have the entire boat instead of a little spot to sit. This also allows us to keep our cost of operation consistent to pass it along to you. This also keeps so many people from congregating around manatees ( See Good Neighbors Policy) and allows for a better personal encounter and less impact on the manatees’ habitat. However, we can not control what other tour guides may do.\nBut since we are with a small group we can relocate to another area to get away from so many people if need be. You do not need 6 passengers to book a tour. If you have more than 6 passengers, we can arrange 2 boats to accommodate. Boats will travel separate but be together for the swimming portion of your tour.\nThe captains and crews that are contracted by our business always ensure the safety for our passengers and the habitat, to allow our future generations to be able to enjoy in the future. We would like to thank you in advance for your support and encouragement of this wonderful opportunity to explore this wildlife soft manatee encounter.\nREALISTIC EXPECTATIONS FOR MANATEES\nThe transitional seasons can be hard to predict and we are really in the hands of God and Mother Nature. Conditions are variable and tomorrow almost certainly WILL NOT be like yesterday! Please be understanding and patient, have realistic expectations and we will have a great time! The Official “Great Manatee Migratory Season” begins middle of October and runs through the end of April, but keep in mind that these are wild animals that do not have a calendar or smart phone to remind them when the time is coming! We DO have resident manatees that live here all year, but it is funny to see the resident manatee prepare for their migratory friends, come September.\nHaving our “Resident Manatee” (all year) combined with our “Migratory Manatees” is what really sets off the Magic of “Citrus County Florida” and its Manatees apart from other Manatee destinations. A combination of mothers with calves (they often times do no teach migratory patterns the first year of life), rehabilitated animals that enjoy the protection of the Bay Water in Citrus County, a few social, wacky manatee that never leave and orphaned animals denied the lesson of migration means, that we can consistently find at least a few manatee even on the warmest days all year. “The Magic of Manatees”.\nWhen visiting be fully informed and DO NOT expect to find the animals near the clear water of the springs. In warm weather, there is no reason for them to be near the springs and they tend to be on the move munching away where water is not always so clear.\nManatees require 10% OF THEIR BODY WEIGHT in food to survive everyday. That is a ton of greens. Health Statistics have always said “Eat Greens and Supersize Exercise to lose weight” have YOU SEEN a Manatee? They are huge, and all they do is eat greens and swim all day, I do not see much weight lose here. Local guide humor.\nWE understand that ON that rare occasion that we may not see a manatee, your going to feel frustrated. We do not plan for this because, it rarely happens. In such case of this rarity, we DO NOT offer any monetary compensations. BUT we maybe able to get you on another tour on a different day based on availability.\n-Parker\nSEMI-PRIVATE TOURS\nDon’t be confused with other operators (Tour Guide Companies) that offer a Semi-Private tour. This just means you will be sharing the boats with a small group. It is not a “PRIVATE” Tour. Funny, that if you google the term or phrase “Semi-Private” it refers to hospital beds…. Hmmm not sure about this one.\nWe offer shared boats, (what others called a “Semi-Private”) with never no more than six passengers per boat. If you would like a Private Tour, we also offer “\nHalf Day Private\n” and\n“\nFull Day Private\n”\nincluding lunch with only your passengers you bring with you.\nSNORKELING\nThis boat tour is recommended for all ages, however we recommend ages from two years old and up. You can choose to swim/snorkel or just ride on the boat. This manatee encounter is one of many Bucket List items and people travel from all over the world to interact with these majestic giants. This is not like snorkeling on a pretty reef in the Keys or the Bahamas where you have to hold your breath to go underwater. You just float using a mask ( if you choose) and snorkel (No Fins) to view these wonderful animals…\nExperience Snorkeling With The Manatees, for an experience of a lifetime, the way nature intended.    Below is what you can expect when you visit us for your Manatee swim experience.\nUpon arrival, and after signing the necessary paperwork, each guest will change into the rental wetsuits, or their own wetsuits.  After ensuring all the wet suits fit properly, we will play a short DVD, (filmed in cooperation with the United States Fish & Wildlife Service) which demonstrates how you must behave on a\nyour tour\nwhile interacting with manatees in their natural habitat in the water.\nNext, all guests and their US Coast Guard Certified Captain/Tour Guide will proceed to the “Landing” area and board our boats to embark on your manatee tour.\nWhile touring the bays and rivers in search of manatees, your Captain/Instructor/guide will teach you about manatees and their habitat, and answer any questions you may have. You may also expect to see: Monkeys, Bald Eagles, dolphins, otters, wild pigs, raccoons and a large array of local snowbirds.\nOnce the captain has found some friendly manatees, the anchor will be dropped and everyone will quietly enter the water to interact properly with the manatees. You may be allowed to take pictures, swim/snorkel with the manatees, and even, if the manatees allow, touching these amazing creatures, that is like winning the LOTTO.\nShare your memories and thoughts of your Manatee encounter on your way back to the “Landing”.\nMANATEES AND WATER CONDITIONS\nThe spring waters are always 72 degrees f (21 Celsius) all year.  This makes our waters feel very warm through the Citrus County winter months. The cooler months October thru April is when the migratory manatees stay and visit us in the clear spring waters to maintain their body warmth. These months give us the best viewing of manatees in the spring waters. During the summer months, the manatees can tolerate the bay waters which are 80 degrees plus. The bay waters may not be the clearest during the summer months but offer the manatees, food and warmth which is much needed for the manatee to survive.\nThis encounter is done in the inland waters of the Old Homosassa River and Crystal River Refuge – year round. If the Homosassa River is not producing manatee sightings during the summer months, we have the option to take you to the Crystal River Refuge. This allows us to choose the best water time for seeing manatees. This option is only carried out during the non migratory season (June – October) if needed. We are the only manatee tour guide service that has this option.\nThunderstorms typically do not affect our manatee tours for we are inland and not out in the gulf waters which are connected to the spring waters by river and canals. If the weather channel calls for a 60% chance of rain! It typically means a 60% chance of rain for 5 minutes. So thunder storms usually don’t affect our tours.\nMost common Tour Times 6:00 AM, 8:00 AM , 10:00 AM, 12:00 PM and 2:00 PM DAILY\n(tour start times do not reflect on length of tours)\nAll tour times are equal for manatee encounters. Let me explain! The manatees’ behavior all depends on what they do the night before, such as staying out late finding food or traveling to seek warmth. The old myth about getting out early (6 AM) was started between two tour operators years ago. One operator (tour guide) was just trying to beat the other tour operator out to the springs, so this became an industry standard comment.\nWhat is really funny is that these same operators claim that the “Early Morning ” is the best time while also saying the “The Sunset Manatee Adventure is the best” well that is a little misleading… We can tell you that no 2 tours are the same, that is why we only allow 6 passengers on our tour boats at one time. Since we have 7 boats in our fleet, this allows each boat to have its on personal tour (most days) unless the manatees are only in one area for that moment.\nThis is the Magic of Manatees, they are kind of like the hippies or gypsies of the river. They come and go as they want.\n– Parker\nAlso some tour operators will charge you more for an afternoon tour, just because they can. It is silly to say that the manatees are more active the first thing in the morning. They are wild animals and have no set pattern.\nFYI, if the majority of the tour operators say that you need to start early ( 6 am ish ) in the morning, wouldn’t you think that everyone will be starting at the crack of dawn… Just sayin!\nOur tour times are set for our guest, not the manatees.\nPRICES OF TOURS\nOur tour prices are set for your wallet. When researching other tour guides and services, look at what you get. When you compare apples to apples, we offer so much more. We include so much more for the money. Why? Because you are coming to us for a fun filled day and that’s how we would want to be treated. You, might see a lower price but you will get what you pay for. If you do the math and the break down, you will not be disappointed.\nThis is not a sales pitch, but the truth.\nSo what we have done is to minimize the impact on the manatees, is to only allow 6 people at a time on each boat with our selected tour times. So, no matter what the time of morning it is, the manatees are not affected by the huge crowds by only taking 6 passengers per boat. We suggest you start your tour the first part of the day from sunup to around 3 ish.\nThe reason we offer 3 tour times is that some of our guests have other obligations for the day, you know, Disney, Sea World, flights to catch or just hanging out with the grandparents. So, the 8 AM tour works for passengers that have afternoon plans. If you have any questions or doubts feel free to call or email.\nThe manatees are a lifestyle to us, not just a tourist attraction.\n– Captain Parker\nWHAT TO BRING AND WHERE TO MEET\nGetting ready for your manatee tour is very simple. Have your bathing suit on before leaving your Motel/Hotel, bring towels and a sweet shirt or hoodie. After your travel to our check in location, you will finish your check in. Then after a short briefing you will follow the captains to the boats. This travel time is about 6 – 12 minutes. Leave all of your bulky items( extra clothes, bags and towels) in your vehicles at check in location, ( Check in locations can very based on sightings, if different location is required, we will notify you upon booking) Since your driving you car to the boats, you will not need to unload all of your gear at the check in location.\nAfter reaching the boats, (Landings 1 or Landings 2) then you can bring all of your equipment and personals to board the boats. We ask that you be on time or just a few minutes early for your tour. This allows you and us to prepare for your manatee adventure, potty breaks, change into bathing suits with doning of wet suits and a short class room intro of manatee awareness.\nWe look forward to meeting you and your families very soon.\nCANCELLATION AND BOOKING POLICIES\nSnorkeling with Manatees and Sea Daddys have a very strict booking and cancellation program. This is to assure those that have bookings will have the crew and boats assigned to them for their day of fun. If we did not have policies it would be a mess for everyone. We might be a Mom and Pop operation but we cater to 100″s of Manatee Lovers, more than most tour guides in our area because we are not a chain or a corporate advent.\nGift\nBUY GIFT CARD\nSwim With Manatees\nPhone\n3522578687\nEnvelope\nmanateesnorkel@gmail.com\nMap Marker\n308 SE US Hwy 19, Crystal River, FL 34429, United States\nFacebook\nTripAdvisor\nQuick Details\nHome\nSee All tours\nLodging & Food\nFAQ\nAbout Us\nManatee Sightings\nSoft Encounters\nGood Neighbors Policy",
      "emails": [
        "manateesnorkel@gmail.com"
      ]
    }
  ],
  "all_links": [
    "https://snorkelwithmanatees.com/crystal-river/",
    "https://snorkelwithmanatees.com/crystal-river/private-manatee-mania-extravaganza-tour/",
    "https://snorkelwithmanatees.com/manatee-tours/",
    "http://www.snorkelwithmanatees.com/crystal-river/shared-marvelous-manatee-tour/",
    "https://snorkelwithmanatees.com/three-sisters-springs/",
    "https://snorkelwithmanatees.com/homosassa/springs-manatee-overload/",
    "https://snorkelwithmanatees.com/homosassa/springs-private-manatee-tour/",
    "https://snorkelwithmanatees.com/homosassa/river-dolphin-tours/",
    "https://snorkelwithmanatees.com/homosassa/springs-splash-n-dash/",
    "https://snorkelwithmanatees.com/soft-encounters/",
    "https://snorkelwithmanatees.com/gallery/",
    "https://snorkelwithmanatees.com/homosassa/springs-shared-manatee-galore-tour/",
    "https://snorkelwithmanatees.com/manatee-facts/",
    "https://snorkelwithmanatees.com/homosassa/springs-eco-river-cruises/",
    "https://snorkelwithmanatees.com/contact-us/",
    "https://snorkelwithmanatees.com/homosassa/",
    "https://snorkelwithmanatees.com/crystal-river/shared-marvelous-manatee-tour/",
    "https://snorkelwithmanatees.com/manatee-sightings/",
    "https://snorkelwithmanatees.com/",
    "https://snorkelwithmanatees.com/homosassa/springs-private-manatee-extreme-tour/",
    "https://snorkelwithmanatees.com/good-neighbors-policy/",
    "https://snorkelwithmanatees.com/directions/",
    "https://snorkelwithmanatees.com/crystal-river/private-magnificent-manatee-tour/",
    "https://snorkelwithmanatees.com/private-charters/",
    "https://snorkelwithmanatees.com/crystal-river/private-manatee-madness-tour/",
    "https://snorkelwithmanatees.com/air-boat-tours/",
    "http://www.snorkelwithmanatees.com/",
    "http://www.snorkelwithmanatees.com/privacy-policy/",
    "https://snorkelwithmanatees.com/faq/",
    "https://snorkelwithmanatees.com/lodging-food/",
    "http://www.snorkelwithmanatees.com/cdn-cgi/l/email-protection#486e6b797871736e6b717f73266e6b717f733c2d6e6b797879733b26276e6b79797c73236e6b797879736e6b797870736e6b7e7c736e6b79787b736e6b79787173296e6b79787d736e6b797870736e6b7c7e732b6e6b7979797325",
    "https://snorkelwithmanatees.com/about-us/"
  ],
  "candidate_links": [
    "https://snorkelwithmanatees.com/contact-us/",
    "https://snorkelwithmanatees.com/about-us/"
  ],
  "visited": [
    "http://www.snorkelwithmanatees.com/",
    "http://www.snorkelwithmanatees.com/about",
    "http://www.snorkelwithmanatees.com/contact",
    "http://www.snorkelwithmanatees.com/staff",
    "http://www.snorkelwithmanatees.com/team",
    "http://www.snorkelwithmanatees.com/board",
    "http://www.snorkelwithmanatees.com/directory",
    "http://www.snorkelwithmanatees.com/events",
    "http://www.snorkelwithmanatees.com/sitemap.xml",
    "http://www.snorkelwithmanatees.com/council",
    "http://www.snorkelwithmanatees.com/leadership",
    "http://www.snorkelwithmanatees.com/management",
    "http://www.snorkelwithmanatees.com/producers",
    "http://www.snorkelwithmanatees.com/support",
    "http://www.snorkelwithmanatees.com/crew",
    "http://www.snorkelwithmanatees.com/members",
    "http://www.snorkelwithmanatees.com/bios",
    "http://www.snorkelwithmanatees.com/people",
    "http://www.snorkelwithmanatees.com/artists",
    "http://www.snorkelwithmanatees.com/musicians",
    "http://www.snorkelwithmanatees.com/faculty",
    "http://www.snorkelwithmanatees.com/administration",
    "https://snorkelwithmanatees.com/contact-us/",
    "https://snorkelwithmanatees.com/about-us/"
  ],
  "base_url": "http://www.snorkelwithmanatees.com/"
}