{
  "pages": [
    {
      "url": "https://sobeseafoodfest.com/events/",
      "is_candidate": false,
      "has_email": false,
      "text": "South Beach Seafood Festival\n|\nOctober 22-25,2025\n|\nMiami Beach, Florida\nEvents\nWed 10/22: An Evening in Miami Beach\nThurs 10/23: An Evening in Miami Beach\nFri 10/24: VIP Chef Showdown\nSat 10/25: Seafood Slam\nAbout\nSponsors\nRestaurants\nEntertainment\nAccommodations\nFAQ\nTickets\n<div class='nav-cta-headline'></div>\nGet Tickets\n<div class='nav-cta-sub'></div>\nToggle Menu\nEvents\nAbout\nSponsors\nRestaurants\nEntertainment\nAccommodations\nBlog\nFAQ\nGet Your Tickets\nSouth Beach Seafood Week 2025\nAn Evening in Miami Beach – Wednesday\nWednesday, October 22, 2025\n<div class='e-'>A one of a kind sit down dinner featuring wine and spirits pairings</div>\nAn Evening by Carbone\n404 Washington Ave., Miami Beach, FL 33139\nAn Evening in Miami Beach – Thursday\nThursday, October 23, 2025\n<div class='e-'>A one of a kind sit down dinner featuring wine and spirits pairings</div>\nRestaurant Lineup Includes Pubbelly Sushi, Catch Miami Beach & Rao's Miami Beach\nMultiple Locations\nVIP Chef Showdown\nFriday, October 24, 2025\n<div class='e-'>22 Chefs. 11 Battles. 1 Championship Night.</div>\nLummus Park\n1130 Ocean Dr, Miami Beach, FL 33139\nSeafood Slam\nSaturday, October 25, 2025\n<div class='e-'>13th Annual South Beach Seafood Festival - SEAFOOD SLAM</div>\nLummus Park\n1130 Ocean Dr, Miami Beach, FL 33139\nStay Connected\nSign Up To Receive The Latest.\nSuccess!\nEmail\nSubscribe\na\n#SOBESEAFOODFEST\nHome\nAbout\nSponsors\nRestaurants\nBlog\nFAQ\nAccommodations\nBuy Your Tickets\n\nCONTACT US\nName\nEmail Address\nMessage\nSend Message\nw\nCONNECT WITH US\nFacebook\nInstagram\nEventBrite\nBUY TICKETS\n©\n2022\n- South Beach Seafood Festival\nGoogle Tag Manager (noscript)\nEnd Google Tag Manager (noscript)\nFacebookPixelCode\nEndFacebookPixelCode\nTwitter universal website tag code\nEnd Twitter universal website tag code",
      "emails": []
    },
    {
      "url": "https://sobeseafoodfest.com/about-south-beach-seafood-festival/",
      "is_candidate": false,
      "has_email": false,
      "text": "South Beach Seafood Festival\n|\nOctober 22-25,2025\n|\nMiami Beach, Florida\nEvents\nWed 10/22: An Evening in Miami Beach\nThurs 10/23: An Evening in Miami Beach\nFri 10/24: VIP Chef Showdown\nSat 10/25: Seafood Slam\nAbout\nSponsors\nRestaurants\nEntertainment\nAccommodations\nFAQ\nTickets\n<div class='nav-cta-headline'></div>\nGet Tickets\n<div class='nav-cta-sub'></div>\nToggle Menu\nEvents\nAbout\nSponsors\nRestaurants\nEntertainment\nAccommodations\nBlog\nFAQ\nGet Your Tickets\nAbout The 2025 South Beach Seafood Festival\nThe iconic South Beach Seafood Festival, brought to you by\nBreakthru Beverage Florida\nand partners, along with the team from\nCI Management\n, kicks off Miami’s globally-recognized stone crab season every October in the best way that South Beach knows how!\nThis is not your typical seafood festival in Miami, but a high-end experience that showcases the talents of South Florida’s leading chefs and culinary masterminds via a diverse group of events. What’s more, the seafood festival benefits a great cause with CI Foundation’s\nEAT SMART program\n, a program that provides healthy meals and nutritional guidance to Florida’s youth.\nEnjoy an incredible week of fun that includes pop-up cafes, fresh seafood, open bars, live music, culinary demonstrations, and more.\nSouth Beach Seafood Festival – Main Event\nSaturday’s beachfront festival, brought to you by Tequila Herradura and presented by GOYA, spans four blocks and welcomes over 15,000 seafoodies each year. It’s a day of fun in the sun the Sobe Chic way.\nThe one-of-a-kind South Beach Seafood Festival is open to the public and welcomes individuals of all ages. Bring your friends, family, kids, and neighbors to one of the top Florida seafood events around. Travel from out of town to experience the best seafood festival in the country with our convenient ticket and hotel package options.\nThe Seafood\nThe South Beach Seafood Festival is all about mouthwatering seafood from local restaurants and participants. In fact, we bring together the top South Florida seafood chefs to create handcrafted gourmet seafood dishes that you won’t find anywhere else.\nYou’ll be able to enjoy seafood specialties such as:\nSeasonal stone crabs\nShrimp cocktail\nFish tacos\nFresh oysters\nLobster waffle cones\nSeafood ceviche\nAnd so much more!\nCome prepared to indulge at pop-up cafes from leading Miami restaurants with the freshest seafood items to choose from. Where else can you enjoy dishes from award-winning Chefs in one day? The South Beach Seafood Festival brings fine dining to the sand with stone crabs, shrimp diavola, fresh oysters, sushi from leading restaurants, lobster rolls, famous shrimp tacos, and so much more. This isn’t a tasting festival; this is an eating festival! Enjoy large portions at festival-friendly pricing.\nThe Drinks\nAlongside our many seafood offerings, you’ll also find complimentary all-day open bars for 21 and over. Pair your choice of eats with delicious cocktails from Jack Daniel’s, Finlandia, and Tequila Herradura to name a few. In the mood for wine or ice cold beer with your seafood? Our selection of top-shelf refreshments is 100% included in your ticket so you can party the day away. We urge you to drink responsibly!\nYou’ll even find decadent sweet cocktails to end your meal (that’s right, make room for dessert here too!).\nThe Experience\nOf course, no South Florida festivals are complete without\nlive music entertainment\n! Head to our Main Stage to enjoy live bands and other performers throughout the festival. Sit back, relax and let the entertainment enhance your culinary experience. We’ll be featuring some of the region’s top musical talents from a range of genres across three stages so there’s always something for everyone!.\nAt South Beach Seafood Festival You’ll also discover:\nYour favorite DJs and musicians in the\nJack Daniel’s Beach Club\nBeach games like life-size Jenga and Connect Four to name a few\nCulinary demos at the\nMilam’s Market Culinary Showcase\nVIP Experiences in the Hospitality Village & Goya Culinary Pavilion\n…and so much more.\nThere’s no limit to what you can experience at the South Beach Seafood Festival. We’re all about creating a signature experience for everyone to enjoy. And, it’s all happening right on the sand—the way it was meant to be! Eat, drink, and treat yourself to the best food the country has to offer.\nImagine hanging with thousands of enthusiastic seafood lovers on glorious South Beach. The venue is beautiful, the food is like nothing you can get anywhere else, and the entertainment is second to none. Plus, nobody knows how to party like Miami!\nCheck out our event in Travel Mag for more details on what the South Beach Seafood Festival is all about!\nhttps://www.travelmag.com/articles/festivals-miami/\nThe Production Team\nThe\nSouth Beach Seafood Festival Week\nis owned and produced by\nCI Management\n. CI Management has been producing events for over 20 years in South Florida, most notably the\nJimmy Johnson National Billfish Tournament\n,\nExperience SOFI\n, and the\nLas Olas Wine & Food Festival\n, among others.\nThey are a leader in FUN-raising and bring to you an experience you don’t want to miss. Make sure you check out all of their Florida seafood events and more by visiting their website at\nci-mgt.com\n.\nEvent Beneficiary\nCommunity Initiatives Foundation (CIF), is a 501c3 nonprofit organization that enables corporations and individuals to work together on projects that impact their local community. CIF is responsible for developing community outreach programs, educational initiatives, youth empowerment and mentoring programs, as well as the flagship Initiative “EAT SMART”, which targets significant deficiencies in youth health and nutrition.\nA portion of proceeds from the South Beach Seafood Festival benefits the South Beach Seafood Festival’s EAT SMART. South Beach Seafood Festival is a 501c3 non profit and the benefiting program, EAT SMART, fulfills the perfect balance between youth nutrition and childhood development by providing healthy weekend meals and nutritional guidance to Miami Beach youth by creating programs in various schools to ensure growth, inspiration, and all around fulfillment of happiness in order to ensure success in their futures.\nEAT SMART focuses on the battle against childhood hunger, childhood obesity and finding the perfect balance through nutritional awareness and individual development. EAT SMART powered by the South Beach Challenge, adopts 6-8th grade students on the Statewide Free or Reduced meal plan and tracks their development throughout the school year, with an ince tive based program encouraging and awarding students for their progress with exercise and nutrition challenges to create consistent healthy lifestyle choices. Partnering sponsors, restaurants and chefs of the South Beach Seafood Festival have committed to hosting in-school cooking demonstrations & field trips highlighting healthy habits and eating on a budget. The program culminates each summer with the graduates participating with other children in their community in Youth Fitness Clinics, where they engage in fun activities and the benefits of exercising.\nTicketing Note\nBy completing the transaction and purchasing a ticket at any price level to any or all of the South Beach Seafood Week event, including Evening at Joe’s, Crabs, Slabs, & Cabs, Chef Showdown and South Beach Seafood Festival, you agree and accept the following Waiver and Release.\nCOVID\nWAIVER AND RELEASE:\nBy registering for or attending this event, I certify that I will not attend the event if I have (i) temperature of 100.4 or higher, (ii) any symptoms of\nCOVID\n-19, or (iii) been exposed to anyone diagnosed with\nCOVID\n-19 within 14 days prior to the event. I further hereby acknowledge and agree that I understand and will follow all guidelines applicable to this event. I understand that\nCOVID\n-19 has been declared a pandemic and that a communicable infectious disease such as\nCOVID\n-19 is highly contagious. I also understand that my attending an event by the South Beach Seafood Festival, or similar group, will result in my interacting with other people attending the event. For this reason, there is no way to guarantee, despite the best efforts of the individuals holding the event, that the other people attending the event do not have, or have not been exposed to,\nCOVID\n-19. As such, I, for myself, my next of kin, family members, heirs, representatives, agents, successors and assigns, hereby release the South Beach Seafood Festival, its chapters, regions, units, related entities and affiliates and their officers, directors, employees, volunteers, representatives, agents, successors and assigns and anyone claiming through them, in their individual and/or organizational capacities from any and all claims, damages, losses, liabilities, obligations, and causes of action of any nature and kind (including reasonable attorneys’ fees), known or unknown, which I have, ever had or may in the future have against the South Beach Seafood Festival, arising out of or relating to any exposure to or illness resulting from\nCOVID\n-19. This Waiver/Release shall be governed by and enforceable in accordance with and shall be subject to the laws of the State of Florida without regard to its conflict or choice of law provisions. I hereby consent to the exclusive personal jurisdiction and venue of any state or federal court located within the City of Miami Beach and waive any objection to jurisdiction and venue of any action instituted hereunder and agree not to assert any defense based on lack of jurisdiction or venue.\nSouth Beach Seafood Week 2025\nAn Evening in Miami Beach – Wednesday\nWednesday, October 22, 2025\n<div class='e-'>A one of a kind sit down dinner featuring wine and spirits pairings</div>\nAn Evening by Carbone\n404 Washington Ave., Miami Beach, FL 33139\nAn Evening in Miami Beach – Thursday\nThursday, October 23, 2025\n<div class='e-'>A one of a kind sit down dinner featuring wine and spirits pairings</div>\nRestaurant Lineup Includes Pubbelly Sushi, Catch Miami Beach & Rao's Miami Beach\nMultiple Locations\nVIP Chef Showdown\nFriday, October 24, 2025\n<div class='e-'>22 Chefs. 11 Battles. 1 Championship Night.</div>\nLummus Park\n1130 Ocean Dr, Miami Beach, FL 33139\nSeafood Slam\nSaturday, October 25, 2025\n<div class='e-'>13th Annual South Beach Seafood Festival - SEAFOOD SLAM</div>\nLummus Park\n1130 Ocean Dr, Miami Beach, FL 33139\nStay Connected\nSign Up To Receive The Latest.\nSuccess!\nEmail\nSubscribe\na\n#SOBESEAFOODFEST\nHome\nAbout\nSponsors\nRestaurants\nBlog\nFAQ\nAccommodations\nBuy Your Tickets\n\nCONTACT US\nName\nEmail Address\nMessage\nSend Message\nw\nCONNECT WITH US\nFacebook\nInstagram\nEventBrite\nBUY TICKETS\n©\n2022\n- South Beach Seafood Festival\nGoogle Tag Manager (noscript)\nEnd Google Tag Manager (noscript)\nFacebookPixelCode\nEndFacebookPixelCode\nTwitter universal website tag code\nEnd Twitter universal website tag code",
      "emails": []
    },
    {
      "url": "https://www.facebook.com/SOBESeafoodFest/",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    }
  ],
  "all_links": [
    "https://sobeseafoodfest.com/events/eveninginmiamibeachthursday/",
    "http://www.sobeseafoodfest.com/",
    "https://sobeseafoodfest.com/blog/",
    "https://sobeseafoodfest.com/events/",
    "https://sobeseafoodfest.com/seafood-festival-sponsors/",
    "https://sobeseafoodfest.com/about-south-beach-seafood-festival/",
    "https://sobeseafoodfest.com/entertainment/",
    "https://sobeseafoodfest.com/south-beach-seafood-festival-hotels/",
    "https://sobeseafoodfest.com/liveinconcert/",
    "https://sobeseafoodfest.com/events/chef-showdown-south-beach-seafood-festival/",
    "https://sobeseafoodfest.com/events/eveninginmiamibeachwednesday/",
    "https://sobeseafoodfest.com/south-beach-seafood-festival-restaurants/",
    "https://sobeseafoodfest.com/culinary-showcase-kitchen/",
    "https://sobeseafoodfest.com/",
    "https://sobeseafoodfest.com/faq-seafood-festival-info/",
    "https://sobeseafoodfest.com/events/south-beach-seafood-event/",
    "https://sobeseafoodfest.com/events/chef-showdown/"
  ],
  "candidate_links": [
    "https://sobeseafoodfest.com/events/",
    "https://sobeseafoodfest.com/about-south-beach-seafood-festival/",
    "https://www.facebook.com/SOBESeafoodFest/"
  ],
  "visited": [
    "http://www.sobeseafoodfest.com/",
    "http://www.sobeseafoodfest.com/about",
    "http://www.sobeseafoodfest.com/contact",
    "http://www.sobeseafoodfest.com/staff",
    "http://www.sobeseafoodfest.com/team",
    "http://www.sobeseafoodfest.com/board",
    "http://www.sobeseafoodfest.com/directory",
    "http://www.sobeseafoodfest.com/events",
    "http://www.sobeseafoodfest.com/sitemap.xml",
    "http://www.sobeseafoodfest.com/council",
    "http://www.sobeseafoodfest.com/leadership",
    "http://www.sobeseafoodfest.com/management",
    "http://www.sobeseafoodfest.com/producers",
    "http://www.sobeseafoodfest.com/support",
    "http://www.sobeseafoodfest.com/crew",
    "http://www.sobeseafoodfest.com/members",
    "http://www.sobeseafoodfest.com/bios",
    "http://www.sobeseafoodfest.com/people",
    "http://www.sobeseafoodfest.com/artists",
    "http://www.sobeseafoodfest.com/musicians",
    "http://www.sobeseafoodfest.com/faculty",
    "http://www.sobeseafoodfest.com/administration",
    "https://sobeseafoodfest.com/events/",
    "https://sobeseafoodfest.com/about-south-beach-seafood-festival/",
    "https://www.facebook.com/SOBESeafoodFest/"
  ],
  "base_url": "http://www.sobeseafoodfest.com/"
}