{
  "pages": [
    {
      "url": "http://www.spcitytheatre.org/about-us",
      "is_candidate": false,
      "has_email": true,
      "text": "Home\nBox Office\nABOUT US\nAbout us\nHistory\nBoard of Directors\nIn the News\nWatch At Home\nHomepage Artwork\nJOIN US\nAuditions\nBecome a Member\nLittle Theatre\nMainstage Season\nVolunteer\nLEARN WITH US\nCamps & Youth Workshop\nTeen Program\nApprentice Program\nMore\nHome\nBox Office\nABOUT US\nAbout us\nHistory\nBoard of Directors\nIn the News\nWatch At Home\nHomepage Artwork\nJOIN US\nAuditions\nBecome a Member\nLittle Theatre\nMainstage Season\nVolunteer\nLEARN WITH US\nCamps & Youth Workshop\nTeen Program\nApprentice Program\nHome\nBox Office\nABOUT US\nAbout us\nHistory\nBoard of Directors\nIn the News\nWatch At Home\nHomepage Artwork\nJOIN US\nAuditions\nBecome a Member\nLittle Theatre\nMainstage Season\nVolunteer\nLEARN WITH US\nCamps & Youth Workshop\nTeen Program\nApprentice Program\n\"We believe that The Theatre is a definite part of the civic and social life of our community.  Its chief purpose is to afford every individual who really desires it, the opportunity for self-expression in the Arts of the Theatre.\"\nPublished 1938\nAbout St. Petersburg City Theatre\nOur History\nOur Leadership\nOur Leadership\nLearn about the St. Petersburg City Theatre's rich history and how it has become a staple of the local theater scene.\nRead More\nOur Leadership\nOur Leadership\nOur Leadership\nMeet the diverse individuals who help to make St. Petersburg City Theatre possible.\nMeet the Team\nIn the News\nOur Leadership\nIn the News\nCheck out some recent news-worthy activities.\nREAD MORE\nVolunteer\nCamps & Workshops\nIn the News\nLearn more about the many various ways you can get involved. No experience required!\nLEARN MORE\nMainstage Season\nCamps & Workshops\nCamps & Workshops\nLearn more about the shows in our current season.\nLearn more\nCamps & Workshops\nCamps & Workshops\nCamps & Workshops\nLearn more about the many youth-focused learning opportunities available year-round.\nLearn more\nABOUT Us\nSt. Petersburg City Theatre\n4025 31st Street South, St. Petersburg, Florida 33712, United States\n727-866-1973\noffice@spcitytheatre.org\nStay in Touch\nSubscribe to our free E-Newsletter\nSign Me Up\nOur Partners\nCopyright © 2024 St. Petersburg City Theatre - All Rights Reserved.\n4025 31st Street South, St. Petersburg, FL 33712\nPowered by Volunteers keeping drama on the stage!\nBox Office\nAbout us\nTerms Conditions Privacy\nContact Us",
      "emails": [
        "impallari@gmail.com",
        "office@spcitytheatre.org"
      ]
    },
    {
      "url": "http://www.spcitytheatre.org/contact-us",
      "is_candidate": false,
      "has_email": true,
      "text": "Home\nBox Office\nABOUT US\nAbout us\nHistory\nBoard of Directors\nIn the News\nWatch At Home\nHomepage Artwork\nJOIN US\nAuditions\nBecome a Member\nLittle Theatre\nMainstage Season\nVolunteer\nLEARN WITH US\nCamps & Youth Workshop\nTeen Program\nApprentice Program\nMore\nHome\nBox Office\nABOUT US\nAbout us\nHistory\nBoard of Directors\nIn the News\nWatch At Home\nHomepage Artwork\nJOIN US\nAuditions\nBecome a Member\nLittle Theatre\nMainstage Season\nVolunteer\nLEARN WITH US\nCamps & Youth Workshop\nTeen Program\nApprentice Program\nHome\nBox Office\nABOUT US\nAbout us\nHistory\nBoard of Directors\nIn the News\nWatch At Home\nHomepage Artwork\nJOIN US\nAuditions\nBecome a Member\nLittle Theatre\nMainstage Season\nVolunteer\nLEARN WITH US\nCamps & Youth Workshop\nTeen Program\nApprentice Program\nContact Us\nSend Message\nName\nEmail*\nSend\nThis site is protected by reCAPTCHA and the Google\nPrivacy Policy\nand\nTerms of Service\napply.\nEmail:\nOffice@spcitytheatre.org\n727-866-1973\nSt Petersburg City Theatre\n4025 31st Street South, St. Petersburg, Florida 33712, United States\nFollow Us\nCopyright © 2024 St. Petersburg City Theatre - All Rights Reserved.\n4025 31st Street South, St. Petersburg, FL 33712\nPowered by Volunteers keeping drama on the stage!\nBox Office\nAbout us\nTerms Conditions Privacy\nContact Us",
      "emails": [
        "impallari@gmail.com",
        "office@spcitytheatre.org"
      ]
    },
    {
      "url": "http://www.spcitytheatre.org/board-of-directors",
      "is_candidate": false,
      "has_email": true,
      "text": "Home\nBox Office\nABOUT US\nAbout us\nHistory\nBoard of Directors\nIn the News\nWatch At Home\nHomepage Artwork\nJOIN US\nAuditions\nBecome a Member\nLittle Theatre\nMainstage Season\nVolunteer\nLEARN WITH US\nCamps & Youth Workshop\nTeen Program\nApprentice Program\nMore\nHome\nBox Office\nABOUT US\nAbout us\nHistory\nBoard of Directors\nIn the News\nWatch At Home\nHomepage Artwork\nJOIN US\nAuditions\nBecome a Member\nLittle Theatre\nMainstage Season\nVolunteer\nLEARN WITH US\nCamps & Youth Workshop\nTeen Program\nApprentice Program\nHome\nBox Office\nABOUT US\nAbout us\nHistory\nBoard of Directors\nIn the News\nWatch At Home\nHomepage Artwork\nJOIN US\nAuditions\nBecome a Member\nLittle Theatre\nMainstage Season\nVolunteer\nLEARN WITH US\nCamps & Youth Workshop\nTeen Program\nApprentice Program\nLeadership at St. Petersburg City Theatre\nStefanie Lehmann President\nKari Kennedy                       VP Back of House\nNathaniel Beaver               VP Front of House\nStefanie grew up at City Theatre where she first joined as a chorus member of The Music Man in 2004. Her day job is with Lincoln Center as their Associate General Manager but when off the clock she can be found back or front of house helping to keep this beloved company thriving.\nNathaniel Beaver               VP Front of House\nKari Kennedy                       VP Back of House\nNathaniel Beaver               VP Front of House\nComing soon\nKari Kennedy                       VP Back of House\nKari Kennedy                       VP Back of House\nKari Kennedy                       VP Back of House\nKari is the kind of person every theatre dreams of having on their team...a true spark of joy who is always ready to pitch in. After moving to St. Pete in 2020, she quickly found her creative family at SPCT and has been an integral part of the theatre ever since. By day, Kari keeps things structured and organized as a Program Manager, but\nShow More\nKari is the kind of person every theatre dreams of having on their team...a true spark of joy who is always ready to pitch in. After moving to St. Pete in 2020, she quickly found her creative family at SPCT and has been an integral part of the theatre ever since. By day, Kari keeps things structured and organized as a Program Manager, but by night she dives into the magic of theatre, building imaginative sets, “MacGyver-ing” props from the most unexpected materials, and rallying volunteers to help the cast shine. Her energy, creativity, and can-do spirit help transform every production into an experience that dazzles our audiences and strengthens our community.\nShow Less\nStacie Lehmann Secretary\nLisa Marone          Treasurer\nKari Kennedy                       VP Back of House\nStacie is a retired preschool/ elementary teacher and former employee of Pinellas County and the City of St  Petersburg. Since encouraging her daughter to audition for her first show, she has volunteered for over 20 years and done a little bit of everything: production coordinator, props,  painting, set dressing, sound & light ops, and, most often, as a Mainstage costume designer.\nLisa Marone          Treasurer\nLisa Marone          Treasurer\nLisa Marone          Treasurer\nLisa is a networking queen who has spent over 15 years volunteering, event planning, promoting and  friend/fundraising for her favorite non-profits in St Petersburg and St  Pete Beach. Her PR and communications organization PEACE In The Burg connects local businesses with nonprofits for collaborative cause related marketing.\nChristine White\nLisa Marone          Treasurer\nLisa Marone          Treasurer\nChristine is a hair stylist and a proud SPCT Lifetime Member, first joining in 1982. She has done over 54 shows in various positions over those years, most recently as a director for some of SPCT's favorite Mainstage musicals.\nRei Capote\nVaughn Wassmer\nVaughn Wassmer\nRei is a Miami born and raised actor who has been in the theatre business since they were a teen. They have taken acting courses at UM, Cambridge University UK, and got their degree in Theatre at FIU. They have worked as a professional actor in TV shows and short films as well as many small professional theatre's around Florida. Rei has a\nShow More\nRei is a Miami born and raised actor who has been in the theatre business since they were a teen. They have taken acting courses at UM, Cambridge University UK, and got their degree in Theatre at FIU. They have worked as a professional actor in TV shows and short films as well as many small professional theatre's around Florida. Rei has always had a passion for teaching and acting; they are fortunate to utilize both at SPCT as a part of the youth program. Away from the theatre they enjoy spending time with their cats at home, going to theme parks, drinking fancy coffee at coffee shops, reading, and, since becoming a new parent, hanging out with their infant.\nShow Less\nVaughn Wassmer\nVaughn Wassmer\nVaughn Wassmer\nComing soon\nRichard Isaacs\nVaughn Wassmer\nKevin Crowell   Administrator\nComing soon\nKevin Crowell   Administrator\nMardi Bessolo               Past President\nKevin Crowell   Administrator\nKevin is the heartbeat of our theatre. He wears many hats...overseeing building maintenance, designing and constructing sets, and making sure the space shines before every performance. As administrator of our thriving youth program, he guides the next generation of performers with care and enthusiasm. He’s also the central hub of communic\nShow More\nKevin is the heartbeat of our theatre. He wears many hats...overseeing building maintenance, designing and constructing sets, and making sure the space shines before every performance. As administrator of our thriving youth program, he guides the next generation of performers with care and enthusiasm. He’s also the central hub of communication, keeping everything running smoothly behind the scenes. His dedication ensures that our theatre not only thrives but continues to feel like a second home for our community.\nShow Less\nMardi Bessolo               Past President\nMardi Bessolo               Past President\nMardi Bessolo               Past President\nMardi is a CFO and business owner with a background in accounting and computers. When her shy daughter was 6, she got her involved with the theater to help develop her confidence. Mardi helped lead the efforts of an amazing group of people who saved the theater from closing in 2017 and previously served as Board President.\nJamie Bierchen             Past President\nMardi Bessolo               Past President\nMardi Bessolo               Past President\nJamie is an international consultant who has traveled to over 70 countries. He has directed, choreographed, and acted in shows at SPCT and around the TB Area and previously served as SPCT's President.\nThe Board of Directors meets every other month. Meetings are open to all Active Members. If you are a Member who would like to listen in or are a Member who would like to formally request time on the agenda to discuss something with the Board, please contact office@spcitytheatre.org\nAttend A Meeting\nCopyright © 2024 St. Petersburg City Theatre - All Rights Reserved.\n4025 31st Street South, St. Petersburg, FL 33712\nPowered by Volunteers keeping drama on the stage!\nBox Office\nAbout us\nTerms Conditions Privacy\nContact Us",
      "emails": [
        "impallari@gmail.com",
        "office@spcitytheatre.org"
      ]
    },
    {
      "url": "http://www.spcitytheatre.org/in-the-news",
      "is_candidate": false,
      "has_email": true,
      "text": "Home\nBox Office\nABOUT US\nAbout us\nHistory\nBoard of Directors\nIn the News\nWatch At Home\nHomepage Artwork\nJOIN US\nAuditions\nBecome a Member\nLittle Theatre\nMainstage Season\nVolunteer\nLEARN WITH US\nCamps & Youth Workshop\nTeen Program\nApprentice Program\nMore\nHome\nBox Office\nABOUT US\nAbout us\nHistory\nBoard of Directors\nIn the News\nWatch At Home\nHomepage Artwork\nJOIN US\nAuditions\nBecome a Member\nLittle Theatre\nMainstage Season\nVolunteer\nLEARN WITH US\nCamps & Youth Workshop\nTeen Program\nApprentice Program\nHome\nBox Office\nABOUT US\nAbout us\nHistory\nBoard of Directors\nIn the News\nWatch At Home\nHomepage Artwork\nJOIN US\nAuditions\nBecome a Member\nLittle Theatre\nMainstage Season\nVolunteer\nLEARN WITH US\nCamps & Youth Workshop\nTeen Program\nApprentice Program\nHurrican Milton Destruction at St. Petersburg City Theatre Theatre\nLike so many in our Tampa Bay community, this hurricane season has not left us unscathed. As we were counting down the final months until 2025 and our 100th anniversary, Hurricane Milton blew in and blew the roof right off our beloved community theater. But this one-hundred-year storm is no match for our one-hundred-year organization. You will see from the video\nhere\nthat our building was deeply affected and critical repairs are rapidly needed; a large portion of our roof was peeled off, allowing significant water into the venue. Even so, St. Petersburg City Theatre has long stood as a sanctuary to all members of our community, and we have absolute faith that our incredible volunteers will help us recover and restore the magic of live theater.\nWe are making every effort to ensure the brave girls, lost boys, and pirates of our Fall Youth Camp production of Peter Pan Jr. can continue as scheduled, as well as our December Mainstage Musical, Irving Berlin’s White Christmas. We believe now, more than ever, we need a place to come together and forget our troubles. As the White Christmas song goes, “Skies were gray but they're not gray anymore…Blue days, all of them gone. Nothing but blue skies from now on.”\nWAYS YOU CAN HELP:\n*Volunteer with Us: We're seeking individuals to assist with immediate clean-up and minor repairs on Saturday, October 19th from 9:00am-3:00pm. Details are in the Facebook event post\nhere\n. Whether you can lend a hand for a couple hours or help organize efforts, every bit counts! If you would like to volunteer your time in other ways, please reach out by commenting below.\nDonate Today: Your contributions will directly fund our recovery efforts. No amount is too small, and every single dollar will help us. We unfortunately do not have hurricane coverage in our insurance policy so will be paying for all repairs and replacements from donations. All donations over $100 are recognized in every show program. Please CONSIDER DONATING TODAY at:\nhttps://stpetersburgcitytheatre.givingfuel.com/annual-donations\nYou can also click on the donate header our website\nwww.spcitytheatre.org\nto learn about other ways to give, including the centennial brick and seat plate fundraisers, legacy gifts, and in-kind donations.\nOffer Consultation or Referrals: If you have a specific skill, trade, or piece of equipment that may help with our current challenges, please reach out. In the **immediate**  term, we need to get a temporary tarp/cover on the roof to prevent further leaks and a large capacity roll-off dumpster to collect debris and damaged items for disposal. We would welcome referrals or recommendations of trusted vendors that could assist ASAP, especially any that may offer discounts to a local nonprofit. We will happily post and share about any companies who come to our aid. After we ensure we’ll be dry, we will need to repair/refinish the stage surface, clean the auditorium carpets and stage curtains, test our theatrical systems to ensure everything is safe and functional, and much more. Please don’t hesitate to contact us if you have any abilities or information that might be of assistance in the difficult time.\nThank you for your support. For our numerous members, volunteers, students, and audience members who are facing their own losses from Hurricanes Helene and Milton, our hearts are with you and we are so sorry that you are going through this.\nFor many this theater is a home, and its members are family. We refuse to close our doors when there are so many people in need of a place to find joy in gathering, growing, uniting, and inspiring each other. We will rebuild and continue to serve our Tampa Bay Area, an example to the power of a diverse and passionate community connected through the arts!\nIN THE NEWS\nSt. Petersburg City Theatre celebrates 100 years\nChristmas Carol Change in Gear Review from the Gabber\nSt. Petersburg City Theatre celebrates 100 years\nPhilip Morgan at 83 Degrees shines a light on St. Petersburg City Theatre’s Centennial Season.\nRead Here\nMary Poppins Review from The Gabber\nChristmas Carol Change in Gear Review from the Gabber\nSt. Petersburg City Theatre celebrates 100 years\n\"To call St. Pete City Theatre’s\nMary Poppins\n“practically perfect” may seem too on-the-nose, but if the shoe fits…\"\nRead Here\nChristmas Carol Change in Gear Review from the Gabber\nChristmas Carol Change in Gear Review from the Gabber\nChristmas Carol Change in Gear Review from the Gabber\n\"The spirits in this show are like nothing you’ve ever seen...St. Petersburg City Theatre created a fitting and festive alternate universe for Dickens’ timeless story.\"\nRead Here\nAll Shook Up on Fox 13 News\nChristmas Carol Change in Gear Review from the Gabber\nOur friends at Fox 13 stopped by the theater where actress Katie Voorhees gave them a sample of the 2023 production of All Shook Up!\nWatch Here\nBehind the Scenes of The Addams Family with the Tampa Bay Times\nTampa Bay Times peeks backstage at ‘The Addams Family’ in St. Petersburg.\nRead Here\nABC Action News\nAngela Bassett was born in New York City, but at four years old, she moved to St. Petersburg. As a teen, she performed at the St. Petersburg Little Theater, which is now known as the St. Pete City Theater.\nTeens The Servant of Two Masters Review from the Gabber\nTeens The Servant of Two Masters Review from the Gabber\nTeens The Servant of Two Masters Review from the Gabber\n\"\nSt. Petersburg City Theatre\nis doing its part to make sure the future of live performance is in good hands.\"\nView Openings\nCopyright © 2024 St. Petersburg City Theatre - All Rights Reserved.\n4025 31st Street South, St. Petersburg, FL 33712\nPowered by Volunteers keeping drama on the stage!\nBox Office\nAbout us\nTerms Conditions Privacy\nContact Us",
      "emails": [
        "impallari@gmail.com"
      ]
    },
    {
      "url": "https://www.facebook.com/spcitytheatre",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    }
  ],
  "all_links": [
    "http://www.spcitytheatre.org/",
    "http://www.spcitytheatre.org/homepage-artwork",
    "http://www.spcitytheatre.org/teen-program",
    "http://www.spcitytheatre.org/about-us",
    "http://www.spcitytheatre.org/little-theatre",
    "http://www.spcitytheatre.org/become-a-member",
    "http://www.spcitytheatre.org/mainstage-season",
    "http://www.spcitytheatre.org/contact-us",
    "http://www.spcitytheatre.org/box-office",
    "http://www.spcitytheatre.org/watch-at-home",
    "http://www.spcitytheatre.org/volunteer",
    "http://www.spcitytheatre.org/board-of-directors",
    "http://www.spcitytheatre.org/camps-%26-youth-workshop",
    "http://www.spcitytheatre.org/terms-conditions-privacy",
    "http://www.spcitytheatre.org/auditions",
    "http://www.spcitytheatre.org/apprentice-program",
    "http://www.spcitytheatre.org/history",
    "http://www.spcitytheatre.org/in-the-news"
  ],
  "candidate_links": [
    "http://www.spcitytheatre.org/about-us",
    "http://www.spcitytheatre.org/contact-us",
    "http://www.spcitytheatre.org/board-of-directors",
    "http://www.spcitytheatre.org/in-the-news",
    "https://www.facebook.com/spcitytheatre"
  ],
  "visited": [
    "http://www.spcitytheatre.org/",
    "http://www.spcitytheatre.org/about",
    "http://www.spcitytheatre.org/contact",
    "http://www.spcitytheatre.org/staff",
    "http://www.spcitytheatre.org/team",
    "http://www.spcitytheatre.org/board",
    "http://www.spcitytheatre.org/directory",
    "http://www.spcitytheatre.org/events",
    "http://www.spcitytheatre.org/sitemap.xml",
    "http://www.spcitytheatre.org/council",
    "http://www.spcitytheatre.org/leadership",
    "http://www.spcitytheatre.org/management",
    "http://www.spcitytheatre.org/producers",
    "http://www.spcitytheatre.org/support",
    "http://www.spcitytheatre.org/crew",
    "http://www.spcitytheatre.org/members",
    "http://www.spcitytheatre.org/bios",
    "http://www.spcitytheatre.org/people",
    "http://www.spcitytheatre.org/artists",
    "http://www.spcitytheatre.org/musicians",
    "http://www.spcitytheatre.org/faculty",
    "http://www.spcitytheatre.org/administration",
    "http://www.spcitytheatre.org/about-us",
    "http://www.spcitytheatre.org/contact-us",
    "http://www.spcitytheatre.org/board-of-directors",
    "http://www.spcitytheatre.org/in-the-news",
    "https://www.facebook.com/spcitytheatre"
  ],
  "base_url": "http://www.spcitytheatre.org/"
}