{
  "pages": [
    {
      "url": "https://speakeasyinn.com/about/",
      "is_candidate": false,
      "has_email": true,
      "text": "About Us\n.entry-header\nGuesthouse on Upper Duval Street's Gallery District\nThe Speakeasy Inn is a quaint guesthouse located in an historic Key West conch style house. It is situated on upper Duval Street in Key West. This neighborhood is famous for the proliferation of art galleries, restaurants, quiet bars and laid back atmosphere. It is also very close to many Key West attractions including South Beach, The Butterfly Conservatory, the Southernmost Point, the Hemingway House Museum. Just down the street is the raucous party atmosphere of Lower Duval Street, the Key West Seaport, and of course Mallory Square and the world famous Sunset Celebration.o.\nThe Rum Bar\nOn the first floor of the Speakeasy Inn is the Rum Bar, which boasts a vast selection of delicious tasting rums from all over the world. Experience our rum tasting for a first hand taste test of vintage and popular rums.\nThe Secret Cellar\nThe Speakeasy Inn is one of only three houses in Key West that have a basement. During Prohibition times the cellar was used to hide smuggled rum. View the video below of the Speakeasy haunted cellar.\nHistory\nThe Speakeasy Inn has a colorful history. Illicit importation of liquor was an important factor in the economy of Monroe County during the Prohibition Era. and the law-breakers were called Rum-runners, boot-leggers, moonshiners and racketeers. However, there were persons whose conduct during the 13 years from January, 1920, through February, 1933, while frankly illegal, nevertheless were gay and adventuresome and tinged with chivalry and derring-do. They were guarded and protected from the enforcement officers in many instances by otherwise law-abiding citizens. An outstanding figure of this period was Raul Vasquez, born in Tampa on August 21, 1890, and died in Key West December 10, 1957. Raul left an enduring symbol of his occupation on his residence at 1117 Duval Street (now the Speakeasy Inn) and one of the “sights” of Key West today are the railings on the upper porch depicting bottles and the spades, hearts, diamonds and clubs of the Spanish playing card deck. (The “club” designation looks like a three-lobed spot familiar to most American card-players.)\nAfter he had established his “import” business on a reasonably sound footing, Raul felt that he should\nadvertise. He could not do this legally by putting notices in the newspaper, or on billboards, or by distributing hand-bills. Most operators of bars in Key West attracted the retail trade – both for liquor and gambling – by posting a notice reading “Club in Rear.” Raul had an idea that was not in violation of the law and that also had decorative value. He reasoned that the gingerbread in the shape of bottles would tell passers-by that here was a convivial establishment, and that in addition to available liquor, the shapes of hearts, spades, diamonds and clubs would suggest that card-playing also was enjoyed in this domicile. Just why Raul brought the symbolic “balusters” from Cuba, instead of getting them made in Key West, his daughter doesn’t know. It was suggested that perhaps he wanted to show some of his Cuban friends that he was interested in other things than alcoholic liquors. Additional support of this view may lie in the fact that Raul was active in the “underground” movement in Cuba which was opposed to the government of the dictator Gerardo Machado. He was a friend of, and a supporter of Fulgencio Batista, who lead the revolution which deposed Machado’s successor, Carlos Manuel de Cespedes in 1933.\nAnother relic of Raul’s prosperous days is a bracelet made of golden Cuban coins, which he gave to his daughter. On his buying trips he always carried gold, because, he said, if the Coast Guard got after him and he had to jump overboard and swim it wouldn’t matter if the coins got wet, whereas paper bills might be ruined. The coins on the bracelet are of two-peso and four-peso denominations and probably are worth today a good deal more than their weight of gold.\nThe “Florence Club” which Raul’s new building replaced was organized soon after national prohibition went into effect. Its name came from the fact that a number of his especially steady customers had wives named Florence. I had the\nprivilege of learning this, directly, from Raul several years before he died. It was not a large place. It had a counter, a shelf behind containing bottled goods, eight chairs and one bench. (The bench had been located on Duval Street for the convenience of people waiting for the electric street cars which operated in those days, until appropriated for the uses of the Florence Club.) The club also had a white marble slab, 14 by 18 inches. If Raul wasn’t present to serve his customers – as he often wasn’t – the customers would help themselves and make notes on the slab of what they had consumed. At convenient intervals the scores were settled up, the notes wiped off the slab, and the process started over. “No one ever stole a single bottle,” Raul told me.His absences from behind the bar were usually on business. He was often away for quite a few days, going across to Cuba to get loads of supplies, or supervising activities of his colleagues who were bringing in “the stuff”.\nThere are innumerable stories told by Conchs who remember those days about how bottles were concealed here and there around Key West – and of course about Raul’s skirmishes with the prohibition agents. Most of those tales have a comic tinge. Even his arrests, and the terms he spent in the county jail, were jolly, rather than sad or solemn occasions, and for the most part the love and sympathy of the community were on Raul’s side. There were numerous other rum-runners, and altogether they bought into Monroe County large amounts of liquor. The only reliable statistics on such “imports” are those taken from the reports of seizures by the U.S. customs officers and Prohibition enforcement agents, which, of course, fall far short of reality. Before Prohibition cigar manufacturing had been Key West’s major industry. In 1900 about 40 percent of the employed persons in the city gave cigar-making as their occupation.\nIn 1910 Key West reached its peak of population – 19,945. (In 1910, the figure for Miami was 5,471.) Labor troubles and other considerations – particularly the improvement of cigar-making machinery – caused Key West to lose many of its\nlargest factories. By 1920, the population had dropped to 19,350. During the Prohibition decade Key West continued to lose population – especially after the closing down of the U.S. Naval Station during the International “Naval Holiday.” The overseas extension of the Florida East Coast railroad was operating, however, and the Florida real estate “boom” was on. The demand for liquor was high, and Raul and his fellow rum-runners brought in thousands of cases. Plentiful supplies also brought in tourists during the winter months. As the late Elmer Davis put it, “People had discovered that you didn’t have to go to Havana to get a drink; you didn’t even have to leave home. “And what did all that do to Key West? Why, it only made it about the pleasantest place in the world. Nobody was in a hurry because nobody was going anywhere; nobody was breaking his neck to get rich, even in the Coolidge-Hoover boom … A few citizens were doing nicely as they always did and the rest seemed to make an adequate living selling rum to one another, with an occasional yachting party, or a still rarer tourist by land, to provide just the margin of profit, even with a gallon not costing not much more than a fifth costs now.” What would have happened if there had not been national prohibition is anybody’s guess. It seems likely that the rum-runners, in small boats, daring the rough seas and the not much gentler law enforcement agents, would not have prospered. The large ships – the ferries connecting Cuba with the rail-head in Key West – would have handled all the business.\nRaul’s account of his first trip to Cuba – a story he liked to tell in his later days – gives an idea of some of the hazards. He had never been to Cuba, but he knew that it was 90 miles south of Key West. He knew that there was rough water, but he had been out in the Gulf Stream many times and wasn’t afraid. He had a small but sturdy boat with a pretty good engine that he figured would average about five miles an hour, so that he ought to be able to make the journey to Cuba in a day and a night.\nNavigation had never been a matter of special interest to him, as he went from Island to Island and had never got lost. But since Cuba was away over the horizon Raul felt that he should have some means of knowing exactly in what direction he was going. He bought a small compass and discussed its use with some of his fishermen friends. He also needed some assistance – some one to load and unload the cases of liquor he expected to acquire, and so he got a waterfront character who had been out with him before. Then, with some water jugs and plenty of gasoline, they headed out to sea, generally following the path taken by steamers. Inasmuch as the one-man crew did not know their destination, he didn’t show alarm until the boat was well out of sight of land. As this occurred when night was coming on, Raul suddenly had a mutiny on his hands and was obliged to use his pistol to keep the “crew” subdued. Also, Raul noticed that his compass acted peculiarly when he moved one way or another around the engine, and that the needle seemed to point at the engine rather than “due north.” This presented a problem, but Raul had heard that a boatman could steer by the stars, and so he tried to keep going in a direction consistent with a star that he chose. He got to Cuba, not on the schedule he had set for himself and not anywhere near, Havana.It took him 5 days, in fact, to get to the capital and pick up his load of liquor. The mutineer accepted the situation and helped load the boat. The dealer who was supplying the bottled goods thought that Raul’s boat was merely a dinghy and that he was going to transfer his cargo to a larger boat outside the harbor.\nRaul got some more information about navigating before setting out on the return journey, because Key West, he could readily see, was not going to be very easy to find. He had engine trouble, and the heavily overloaded boat floated helplessly and perilously in some very rough seas for many hours. They came close to running out of fresh water, and Raul was a very tired and bewildered and worried man, but he refused to lighten the boat. He was somewhere in the vicinity of Big Pine Key when he finally sighted land. He made for shore and encountered another boatman from whom he tried to buy water, gasoline and food. The man, however, suspected that Raul had liquor aboard and he demanded some of it. Raul had to give in, surrendered just one bottle. He boasted that that one was the only bottle lost out of the entire cargo.\nSome of the older residents recall that there was eager demand for his merchandise among the “binder boys” engaged in the real estate boom in South Florida. It permitted them to conduct their negotiations in a more convivial manner. And there were some big deals. Once there was a Shriners’ convention in Key West, and Raul supplied some 150 suitcases of imported goods. But he had 60 cases left over and some enthusiastic delegates suggested that they be sent to Miami. This was done. Raul got a gross return of about $3,500 on the transaction.\nBy the time the “bust” of the Florida real estate boom came around Raul had accumulated a considerable amount of property and money in the\nbank. As more piratical and reckless characters became engaged in rum-running and began to give him stiff and some unpleasant competition, he retired to more tranquil pursuits, such as shell-collecting and training fish. (He operated “Raul’s Club” where the Seven Seas Restaurant on East Roosevelt Boulevard, stands, and he delighted visitors by putting parrotfish, young sharks, groupers and other specimens through their paces in the pool behind the club building. Indeed, he became nationally famous and was written up by such magazine writers as Quentin Reynolds, Henry McLemore, Joe Williams, John Cowles and others.)\nRauls’ rum-running activities were interrupted, often, by the law. He was caught, tried and sentenced to jail. But his many friends (and customers) did all they could to make incarceration as pleasant and unconfining as possible. As has been pointed, Raul’s acquaintances trusted him just as he trusted nearly everyone. At the jail he was a sort of “super-trusty” and was permitted to carry on some of his business operations outside. He was supposed to be honorable about coming back at night, after being let out in the morning. He was faithful about it. Sometimes, if he was delayed by some pressing affair of commerce (perhaps supervising the unloading of a new cargo of liquor just in from Cuba), he’d have to wake up the jailer by pounding on the door and demanding admittance. The jailer, who didn’t like to have his slumbers thus disturbed, had a duplicate key made and gave it to Raul so that he could come and go as he pleased.\nAs Elmer Davis has pointed out, there were many bars on Duval Street and elsewhere about Key West. At times retail liquor business was carried on almost as if there was nothing illicit about it. There is little question that it helped to attract the winter visitors who came by sea as well as by railroad. The wholesale business carried on by Raul and others was more hazardous, because the Prohibition agents were more interested in large loads and the bigger and bolder violators of the law. The collapse of the real estate boom, which came at the end of the 1920s, and the subsequent depression caused a major crisis in Key West and the loss of well over a third of its population. The tourist business also dwindled. Key West was a “poor man’s town” until the completion of the Overseas Highway and the resumption of activity at the U.S. Naval Station. It might have been an even poorer city, however, if rum-running and the retail sale of liquor had not been continued to provide a considerable number of people with a means of livelihood.\nAdd Your Heading Text Here\n.entry-content\n.inside-article\n#post-##\nAbout Us\n.entry-header\nGuesthouse on Upper Duval Street's Gallery District\nThe Speakeasy Inn is a quaint guesthouse located in an historic Key West conch style house. It is situated on upper Duval Street in Key West. This neighborhood is famous for the proliferation of art galleries, restaurants, quiet bars and laid back atmosphere. It is also very close to many Key West attractions including South Beach, The Butterfly Conservatory, the Southernmost Point, the Hemingway House Museum. Just down the street is the raucous party atmosphere of Lower Duval Street, the Key West Seaport, and of course Mallory Square and the world famous Sunset Celebration.o.\nThe Rum Bar\nOn the first floor of the Speakeasy Inn is the Rum Bar, which boasts a vast selection of delicious tasting rums from all over the world. Experience our rum tasting for a first hand taste test of vintage and popular rums.\nThe Secret Cellar\nThe Speakeasy Inn is one of only three houses in Key West that have a basement. During Prohibition times the cellar was used to hide smuggled rum. View the video below of the Speakeasy haunted cellar.\nHistory\nThe Speakeasy Inn has a colorful history. Illicit importation of liquor was an important factor in the economy of Monroe County during the Prohibition Era. and the law-breakers were called Rum-runners, boot-leggers, moonshiners and racketeers. However, there were persons whose conduct during the 13 years from January, 1920, through February, 1933, while frankly illegal, nevertheless were gay and adventuresome and tinged with chivalry and derring-do. They were guarded and protected from the enforcement officers in many instances by otherwise law-abiding citizens. An outstanding figure of this period was Raul Vasquez, born in Tampa on August 21, 1890, and died in Key West December 10, 1957. Raul left an enduring symbol of his occupation on his residence at 1117 Duval Street (now the Speakeasy Inn) and one of the “sights” of Key West today are the railings on the upper porch depicting bottles and the spades, hearts, diamonds and clubs of the Spanish playing card deck. (The “club” designation looks like a three-lobed spot familiar to most American card-players.)\nAfter he had established his “import” business on a reasonably sound footing, Raul felt that he should\nadvertise. He could not do this legally by putting notices in the newspaper, or on billboards, or by distributing hand-bills. Most operators of bars in Key West attracted the retail trade – both for liquor and gambling – by posting a notice reading “Club in Rear.” Raul had an idea that was not in violation of the law and that also had decorative value. He reasoned that the gingerbread in the shape of bottles would tell passers-by that here was a convivial establishment, and that in addition to available liquor, the shapes of hearts, spades, diamonds and clubs would suggest that card-playing also was enjoyed in this domicile. Just why Raul brought the symbolic “balusters” from Cuba, instead of getting them made in Key West, his daughter doesn’t know. It was suggested that perhaps he wanted to show some of his Cuban friends that he was interested in other things than alcoholic liquors. Additional support of this view may lie in the fact that Raul was active in the “underground” movement in Cuba which was opposed to the government of the dictator Gerardo Machado. He was a friend of, and a supporter of Fulgencio Batista, who lead the revolution which deposed Machado’s successor, Carlos Manuel de Cespedes in 1933.\nAnother relic of Raul’s prosperous days is a bracelet made of golden Cuban coins, which he gave to his daughter. On his buying trips he always carried gold, because, he said, if the Coast Guard got after him and he had to jump overboard and swim it wouldn’t matter if the coins got wet, whereas paper bills might be ruined. The coins on the bracelet are of two-peso and four-peso denominations and probably are worth today a good deal more than their weight of gold.\nThe “Florence Club” which Raul’s new building replaced was organized soon after national prohibition went into effect. Its name came from the fact that a number of his especially steady customers had wives named Florence. I had the\nprivilege of learning this, directly, from Raul several years before he died. It was not a large place. It had a counter, a shelf behind containing bottled goods, eight chairs and one bench. (The bench had been located on Duval Street for the convenience of people waiting for the electric street cars which operated in those days, until appropriated for the uses of the Florence Club.) The club also had a white marble slab, 14 by 18 inches. If Raul wasn’t present to serve his customers – as he often wasn’t – the customers would help themselves and make notes on the slab of what they had consumed. At convenient intervals the scores were settled up, the notes wiped off the slab, and the process started over. “No one ever stole a single bottle,” Raul told me.His absences from behind the bar were usually on business. He was often away for quite a few days, going across to Cuba to get loads of supplies, or supervising activities of his colleagues who were bringing in “the stuff”.\nThere are innumerable stories told by Conchs who remember those days about how bottles were concealed here and there around Key West – and of course about Raul’s skirmishes with the prohibition agents. Most of those tales have a comic tinge. Even his arrests, and the terms he spent in the county jail, were jolly, rather than sad or solemn occasions, and for the most part the love and sympathy of the community were on Raul’s side. There were numerous other rum-runners, and altogether they bought into Monroe County large amounts of liquor. The only reliable statistics on such “imports” are those taken from the reports of seizures by the U.S. customs officers and Prohibition enforcement agents, which, of course, fall far short of reality. Before Prohibition cigar manufacturing had been Key West’s major industry. In 1900 about 40 percent of the employed persons in the city gave cigar-making as their occupation.\nIn 1910 Key West reached its peak of population – 19,945. (In 1910, the figure for Miami was 5,471.) Labor troubles and other considerations – particularly the improvement of cigar-making machinery – caused Key West to lose many of its\nlargest factories. By 1920, the population had dropped to 19,350. During the Prohibition decade Key West continued to lose population – especially after the closing down of the U.S. Naval Station during the International “Naval Holiday.” The overseas extension of the Florida East Coast railroad was operating, however, and the Florida real estate “boom” was on. The demand for liquor was high, and Raul and his fellow rum-runners brought in thousands of cases. Plentiful supplies also brought in tourists during the winter months. As the late Elmer Davis put it, “People had discovered that you didn’t have to go to Havana to get a drink; you didn’t even have to leave home. “And what did all that do to Key West? Why, it only made it about the pleasantest place in the world. Nobody was in a hurry because nobody was going anywhere; nobody was breaking his neck to get rich, even in the Coolidge-Hoover boom … A few citizens were doing nicely as they always did and the rest seemed to make an adequate living selling rum to one another, with an occasional yachting party, or a still rarer tourist by land, to provide just the margin of profit, even with a gallon not costing not much more than a fifth costs now.” What would have happened if there had not been national prohibition is anybody’s guess. It seems likely that the rum-runners, in small boats, daring the rough seas and the not much gentler law enforcement agents, would not have prospered. The large ships – the ferries connecting Cuba with the rail-head in Key West – would have handled all the business.\nRaul’s account of his first trip to Cuba – a story he liked to tell in his later days – gives an idea of some of the hazards. He had never been to Cuba, but he knew that it was 90 miles south of Key West. He knew that there was rough water, but he had been out in the Gulf Stream many times and wasn’t afraid. He had a small but sturdy boat with a pretty good engine that he figured would average about five miles an hour, so that he ought to be able to make the journey to Cuba in a day and a night.\nNavigation had never been a matter of special interest to him, as he went from Island to Island and had never got lost. But since Cuba was away over the horizon Raul felt that he should have some means of knowing exactly in what direction he was going. He bought a small compass and discussed its use with some of his fishermen friends. He also needed some assistance – some one to load and unload the cases of liquor he expected to acquire, and so he got a waterfront character who had been out with him before. Then, with some water jugs and plenty of gasoline, they headed out to sea, generally following the path taken by steamers. Inasmuch as the one-man crew did not know their destination, he didn’t show alarm until the boat was well out of sight of land. As this occurred when night was coming on, Raul suddenly had a mutiny on his hands and was obliged to use his pistol to keep the “crew” subdued. Also, Raul noticed that his compass acted peculiarly when he moved one way or another around the engine, and that the needle seemed to point at the engine rather than “due north.” This presented a problem, but Raul had heard that a boatman could steer by the stars, and so he tried to keep going in a direction consistent with a star that he chose. He got to Cuba, not on the schedule he had set for himself and not anywhere near, Havana.It took him 5 days, in fact, to get to the capital and pick up his load of liquor. The mutineer accepted the situation and helped load the boat. The dealer who was supplying the bottled goods thought that Raul’s boat was merely a dinghy and that he was going to transfer his cargo to a larger boat outside the harbor.\nRaul got some more information about navigating before setting out on the return journey, because Key West, he could readily see, was not going to be very easy to find. He had engine trouble, and the heavily overloaded boat floated helplessly and perilously in some very rough seas for many hours. They came close to running out of fresh water, and Raul was a very tired and bewildered and worried man, but he refused to lighten the boat. He was somewhere in the vicinity of Big Pine Key when he finally sighted land. He made for shore and encountered another boatman from whom he tried to buy water, gasoline and food. The man, however, suspected that Raul had liquor aboard and he demanded some of it. Raul had to give in, surrendered just one bottle. He boasted that that one was the only bottle lost out of the entire cargo.\nSome of the older residents recall that there was eager demand for his merchandise among the “binder boys” engaged in the real estate boom in South Florida. It permitted them to conduct their negotiations in a more convivial manner. And there were some big deals. Once there was a Shriners’ convention in Key West, and Raul supplied some 150 suitcases of imported goods. But he had 60 cases left over and some enthusiastic delegates suggested that they be sent to Miami. This was done. Raul got a gross return of about $3,500 on the transaction.\nBy the time the “bust” of the Florida real estate boom came around Raul had accumulated a considerable amount of property and money in the\nbank. As more piratical and reckless characters became engaged in rum-running and began to give him stiff and some unpleasant competition, he retired to more tranquil pursuits, such as shell-collecting and training fish. (He operated “Raul’s Club” where the Seven Seas Restaurant on East Roosevelt Boulevard, stands, and he delighted visitors by putting parrotfish, young sharks, groupers and other specimens through their paces in the pool behind the club building. Indeed, he became nationally famous and was written up by such magazine writers as Quentin Reynolds, Henry McLemore, Joe Williams, John Cowles and others.)\nRauls’ rum-running activities were interrupted, often, by the law. He was caught, tried and sentenced to jail. But his many friends (and customers) did all they could to make incarceration as pleasant and unconfining as possible. As has been pointed, Raul’s acquaintances trusted him just as he trusted nearly everyone. At the jail he was a sort of “super-trusty” and was permitted to carry on some of his business operations outside. He was supposed to be honorable about coming back at night, after being let out in the morning. He was faithful about it. Sometimes, if he was delayed by some pressing affair of commerce (perhaps supervising the unloading of a new cargo of liquor just in from Cuba), he’d have to wake up the jailer by pounding on the door and demanding admittance. The jailer, who didn’t like to have his slumbers thus disturbed, had a duplicate key made and gave it to Raul so that he could come and go as he pleased.\nAs Elmer Davis has pointed out, there were many bars on Duval Street and elsewhere about Key West. At times retail liquor business was carried on almost as if there was nothing illicit about it. There is little question that it helped to attract the winter visitors who came by sea as well as by railroad. The wholesale business carried on by Raul and others was more hazardous, because the Prohibition agents were more interested in large loads and the bigger and bolder violators of the law. The collapse of the real estate boom, which came at the end of the 1920s, and the subsequent depression caused a major crisis in Key West and the loss of well over a third of its population. The tourist business also dwindled. Key West was a “poor man’s town” until the completion of the Overseas Highway and the resumption of activity at the U.S. Naval Station. It might have been an even poorer city, however, if rum-running and the retail sale of liquor had not been continued to provide a considerable number of people with a means of livelihood.\nAdd Your Heading Text Here\n.entry-content\n.inside-article\nGuesthouse on Upper Duval Street's Gallery District\nThe Speakeasy Inn is a quaint guesthouse located in an historic Key West conch style house. It is situated on upper Duval Street in Key West. This neighborhood is famous for the proliferation of art galleries, restaurants, quiet bars and laid back atmosphere. It is also very close to many Key West attractions including South Beach, The Butterfly Conservatory, the Southernmost Point, the Hemingway House Museum. Just down the street is the raucous party atmosphere of Lower Duval Street, the Key West Seaport, and of course Mallory Square and the world famous Sunset Celebration.o.\nThe Rum Bar\nOn the first floor of the Speakeasy Inn is the Rum Bar, which boasts a vast selection of delicious tasting rums from all over the world. Experience our rum tasting for a first hand taste test of vintage and popular rums.\nThe Secret Cellar\nThe Speakeasy Inn is one of only three houses in Key West that have a basement. During Prohibition times the cellar was used to hide smuggled rum. View the video below of the Speakeasy haunted cellar.\nHistory\nThe Speakeasy Inn has a colorful history. Illicit importation of liquor was an important factor in the economy of Monroe County during the Prohibition Era. and the law-breakers were called Rum-runners, boot-leggers, moonshiners and racketeers. However, there were persons whose conduct during the 13 years from January, 1920, through February, 1933, while frankly illegal, nevertheless were gay and adventuresome and tinged with chivalry and derring-do. They were guarded and protected from the enforcement officers in many instances by otherwise law-abiding citizens. An outstanding figure of this period was Raul Vasquez, born in Tampa on August 21, 1890, and died in Key West December 10, 1957. Raul left an enduring symbol of his occupation on his residence at 1117 Duval Street (now the Speakeasy Inn) and one of the “sights” of Key West today are the railings on the upper porch depicting bottles and the spades, hearts, diamonds and clubs of the Spanish playing card deck. (The “club” designation looks like a three-lobed spot familiar to most American card-players.)\nAfter he had established his “import” business on a reasonably sound footing, Raul felt that he should\nadvertise. He could not do this legally by putting notices in the newspaper, or on billboards, or by distributing hand-bills. Most operators of bars in Key West attracted the retail trade – both for liquor and gambling – by posting a notice reading “Club in Rear.” Raul had an idea that was not in violation of the law and that also had decorative value. He reasoned that the gingerbread in the shape of bottles would tell passers-by that here was a convivial establishment, and that in addition to available liquor, the shapes of hearts, spades, diamonds and clubs would suggest that card-playing also was enjoyed in this domicile. Just why Raul brought the symbolic “balusters” from Cuba, instead of getting them made in Key West, his daughter doesn’t know. It was suggested that perhaps he wanted to show some of his Cuban friends that he was interested in other things than alcoholic liquors. Additional support of this view may lie in the fact that Raul was active in the “underground” movement in Cuba which was opposed to the government of the dictator Gerardo Machado. He was a friend of, and a supporter of Fulgencio Batista, who lead the revolution which deposed Machado’s successor, Carlos Manuel de Cespedes in 1933.\nAnother relic of Raul’s prosperous days is a bracelet made of golden Cuban coins, which he gave to his daughter. On his buying trips he always carried gold, because, he said, if the Coast Guard got after him and he had to jump overboard and swim it wouldn’t matter if the coins got wet, whereas paper bills might be ruined. The coins on the bracelet are of two-peso and four-peso denominations and probably are worth today a good deal more than their weight of gold.\nThe “Florence Club” which Raul’s new building replaced was organized soon after national prohibition went into effect. Its name came from the fact that a number of his especially steady customers had wives named Florence. I had the\nprivilege of learning this, directly, from Raul several years before he died. It was not a large place. It had a counter, a shelf behind containing bottled goods, eight chairs and one bench. (The bench had been located on Duval Street for the convenience of people waiting for the electric street cars which operated in those days, until appropriated for the uses of the Florence Club.) The club also had a white marble slab, 14 by 18 inches. If Raul wasn’t present to serve his customers – as he often wasn’t – the customers would help themselves and make notes on the slab of what they had consumed. At convenient intervals the scores were settled up, the notes wiped off the slab, and the process started over. “No one ever stole a single bottle,” Raul told me.His absences from behind the bar were usually on business. He was often away for quite a few days, going across to Cuba to get loads of supplies, or supervising activities of his colleagues who were bringing in “the stuff”.\nThere are innumerable stories told by Conchs who remember those days about how bottles were concealed here and there around Key West – and of course about Raul’s skirmishes with the prohibition agents. Most of those tales have a comic tinge. Even his arrests, and the terms he spent in the county jail, were jolly, rather than sad or solemn occasions, and for the most part the love and sympathy of the community were on Raul’s side. There were numerous other rum-runners, and altogether they bought into Monroe County large amounts of liquor. The only reliable statistics on such “imports” are those taken from the reports of seizures by the U.S. customs officers and Prohibition enforcement agents, which, of course, fall far short of reality. Before Prohibition cigar manufacturing had been Key West’s major industry. In 1900 about 40 percent of the employed persons in the city gave cigar-making as their occupation.\nIn 1910 Key West reached its peak of population – 19,945. (In 1910, the figure for Miami was 5,471.) Labor troubles and other considerations – particularly the improvement of cigar-making machinery – caused Key West to lose many of its\nlargest factories. By 1920, the population had dropped to 19,350. During the Prohibition decade Key West continued to lose population – especially after the closing down of the U.S. Naval Station during the International “Naval Holiday.” The overseas extension of the Florida East Coast railroad was operating, however, and the Florida real estate “boom” was on. The demand for liquor was high, and Raul and his fellow rum-runners brought in thousands of cases. Plentiful supplies also brought in tourists during the winter months. As the late Elmer Davis put it, “People had discovered that you didn’t have to go to Havana to get a drink; you didn’t even have to leave home. “And what did all that do to Key West? Why, it only made it about the pleasantest place in the world. Nobody was in a hurry because nobody was going anywhere; nobody was breaking his neck to get rich, even in the Coolidge-Hoover boom … A few citizens were doing nicely as they always did and the rest seemed to make an adequate living selling rum to one another, with an occasional yachting party, or a still rarer tourist by land, to provide just the margin of profit, even with a gallon not costing not much more than a fifth costs now.” What would have happened if there had not been national prohibition is anybody’s guess. It seems likely that the rum-runners, in small boats, daring the rough seas and the not much gentler law enforcement agents, would not have prospered. The large ships – the ferries connecting Cuba with the rail-head in Key West – would have handled all the business.\nRaul’s account of his first trip to Cuba – a story he liked to tell in his later days – gives an idea of some of the hazards. He had never been to Cuba, but he knew that it was 90 miles south of Key West. He knew that there was rough water, but he had been out in the Gulf Stream many times and wasn’t afraid. He had a small but sturdy boat with a pretty good engine that he figured would average about five miles an hour, so that he ought to be able to make the journey to Cuba in a day and a night.\nNavigation had never been a matter of special interest to him, as he went from Island to Island and had never got lost. But since Cuba was away over the horizon Raul felt that he should have some means of knowing exactly in what direction he was going. He bought a small compass and discussed its use with some of his fishermen friends. He also needed some assistance – some one to load and unload the cases of liquor he expected to acquire, and so he got a waterfront character who had been out with him before. Then, with some water jugs and plenty of gasoline, they headed out to sea, generally following the path taken by steamers. Inasmuch as the one-man crew did not know their destination, he didn’t show alarm until the boat was well out of sight of land. As this occurred when night was coming on, Raul suddenly had a mutiny on his hands and was obliged to use his pistol to keep the “crew” subdued. Also, Raul noticed that his compass acted peculiarly when he moved one way or another around the engine, and that the needle seemed to point at the engine rather than “due north.” This presented a problem, but Raul had heard that a boatman could steer by the stars, and so he tried to keep going in a direction consistent with a star that he chose. He got to Cuba, not on the schedule he had set for himself and not anywhere near, Havana.It took him 5 days, in fact, to get to the capital and pick up his load of liquor. The mutineer accepted the situation and helped load the boat. The dealer who was supplying the bottled goods thought that Raul’s boat was merely a dinghy and that he was going to transfer his cargo to a larger boat outside the harbor.\nRaul got some more information about navigating before setting out on the return journey, because Key West, he could readily see, was not going to be very easy to find. He had engine trouble, and the heavily overloaded boat floated helplessly and perilously in some very rough seas for many hours. They came close to running out of fresh water, and Raul was a very tired and bewildered and worried man, but he refused to lighten the boat. He was somewhere in the vicinity of Big Pine Key when he finally sighted land. He made for shore and encountered another boatman from whom he tried to buy water, gasoline and food. The man, however, suspected that Raul had liquor aboard and he demanded some of it. Raul had to give in, surrendered just one bottle. He boasted that that one was the only bottle lost out of the entire cargo.\nSome of the older residents recall that there was eager demand for his merchandise among the “binder boys” engaged in the real estate boom in South Florida. It permitted them to conduct their negotiations in a more convivial manner. And there were some big deals. Once there was a Shriners’ convention in Key West, and Raul supplied some 150 suitcases of imported goods. But he had 60 cases left over and some enthusiastic delegates suggested that they be sent to Miami. This was done. Raul got a gross return of about $3,500 on the transaction.\nBy the time the “bust” of the Florida real estate boom came around Raul had accumulated a considerable amount of property and money in the\nbank. As more piratical and reckless characters became engaged in rum-running and began to give him stiff and some unpleasant competition, he retired to more tranquil pursuits, such as shell-collecting and training fish. (He operated “Raul’s Club” where the Seven Seas Restaurant on East Roosevelt Boulevard, stands, and he delighted visitors by putting parrotfish, young sharks, groupers and other specimens through their paces in the pool behind the club building. Indeed, he became nationally famous and was written up by such magazine writers as Quentin Reynolds, Henry McLemore, Joe Williams, John Cowles and others.)\nRauls’ rum-running activities were interrupted, often, by the law. He was caught, tried and sentenced to jail. But his many friends (and customers) did all they could to make incarceration as pleasant and unconfining as possible. As has been pointed, Raul’s acquaintances trusted him just as he trusted nearly everyone. At the jail he was a sort of “super-trusty” and was permitted to carry on some of his business operations outside. He was supposed to be honorable about coming back at night, after being let out in the morning. He was faithful about it. Sometimes, if he was delayed by some pressing affair of commerce (perhaps supervising the unloading of a new cargo of liquor just in from Cuba), he’d have to wake up the jailer by pounding on the door and demanding admittance. The jailer, who didn’t like to have his slumbers thus disturbed, had a duplicate key made and gave it to Raul so that he could come and go as he pleased.\nAs Elmer Davis has pointed out, there were many bars on Duval Street and elsewhere about Key West. At times retail liquor business was carried on almost as if there was nothing illicit about it. There is little question that it helped to attract the winter visitors who came by sea as well as by railroad. The wholesale business carried on by Raul and others was more hazardous, because the Prohibition agents were more interested in large loads and the bigger and bolder violators of the law. The collapse of the real estate boom, which came at the end of the 1920s, and the subsequent depression caused a major crisis in Key West and the loss of well over a third of its population. The tourist business also dwindled. Key West was a “poor man’s town” until the completion of the Overseas Highway and the resumption of activity at the U.S. Naval Station. It might have been an even poorer city, however, if rum-running and the retail sale of liquor had not been continued to provide a considerable number of people with a means of livelihood.\nAdd Your Heading Text Here",
      "emails": [
        "info@speakeasyinn.com"
      ]
    },
    {
      "url": "https://speakeasyinn.com/contact-us/",
      "is_candidate": false,
      "has_email": true,
      "text": "Contact Us\n.entry-header\nHelp Us Plan Your Key West Visit\nSpeakeasy Inn\n1117 Duval St.\nKey West, Florida 33707\nPhone 305-296-2860\nFax  305-296-2608\nEmail\nInfo@SpeakeasyInn.com\n.entry-content\n.inside-article\n#post-##\nContact Us\n.entry-header\nHelp Us Plan Your Key West Visit\nSpeakeasy Inn\n1117 Duval St.\nKey West, Florida 33707\nPhone 305-296-2860\nFax  305-296-2608\nEmail\nInfo@SpeakeasyInn.com\n.entry-content\n.inside-article\nHelp Us Plan Your Key West Visit\nSpeakeasy Inn\n1117 Duval St.\nKey West, Florida 33707\nPhone 305-296-2860\nFax  305-296-2608\nEmail\nInfo@SpeakeasyInn.com",
      "emails": [
        "info@speakeasyinn.com"
      ]
    }
  ],
  "all_links": [
    "https://speakeasyinn.com/room-photos/",
    "https://speakeasyinn.com/about/",
    "https://speakeasyinn.com/rum-bar/",
    "https://speakeasyinn.com/room-pics/",
    "https://speakeasyinn.com/attractions/",
    "https://speakeasyinn.com/",
    "https://speakeasyinn.com/contact-us/"
  ],
  "candidate_links": [
    "https://speakeasyinn.com/about/",
    "https://speakeasyinn.com/contact-us/"
  ],
  "visited": [
    "http://www.speakeasyinn.com/",
    "http://www.speakeasyinn.com/about",
    "http://www.speakeasyinn.com/contact",
    "http://www.speakeasyinn.com/staff",
    "http://www.speakeasyinn.com/team",
    "http://www.speakeasyinn.com/board",
    "http://www.speakeasyinn.com/directory",
    "http://www.speakeasyinn.com/events",
    "http://www.speakeasyinn.com/sitemap.xml",
    "http://www.speakeasyinn.com/council",
    "http://www.speakeasyinn.com/leadership",
    "http://www.speakeasyinn.com/management",
    "http://www.speakeasyinn.com/producers",
    "http://www.speakeasyinn.com/support",
    "http://www.speakeasyinn.com/crew",
    "http://www.speakeasyinn.com/members",
    "http://www.speakeasyinn.com/bios",
    "http://www.speakeasyinn.com/people",
    "http://www.speakeasyinn.com/artists",
    "http://www.speakeasyinn.com/musicians",
    "http://www.speakeasyinn.com/faculty",
    "http://www.speakeasyinn.com/administration",
    "https://speakeasyinn.com/about/",
    "https://speakeasyinn.com/contact-us/"
  ],
  "base_url": "http://www.speakeasyinn.com/"
}