{
  "pages": [
    {
      "url": "https://sunkengardens.org/events/",
      "is_candidate": false,
      "has_email": false,
      "text": "Events\nSeptember 5 @ 12:00 pm\n-\n1:00 pm\nIntroduction to Propagation Talk\nSunken Gardens\n1825 4th St N, St. Petersburg, FL, United States\nCalling all gardeners! Want to create more of your own plants but have no clue where to start? Join Tom Heitzman, experienced horticulturalist and owner of Sweet Bay Nursery, as he discusses propagation methods. Tom will share beginner tips to help you successfully generate cuttings and seedlings to multiply your plant collection. For 30 years, […]\nSeptember 27 @ 11:00 am\n-\n12:30 pm\nFall Vegetable Garden Planning - Talk & Sale\nSunken Gardens\n1825 4th St N, St. Petersburg, FL, United States\nFall is one of Florida's primary growing seasons. Take advantage of it by planning ahead! Developing a plan for your vegetable garden is essential for cultivating a bountiful harvest. Join Elise Pickett, owner of The Urban Harvest LLC, to discover proven strategies and techniques to help you maximize yields with heirloom varieties proven to thrive […]\nFeatured\nFeatured\nDecember 7 @ 12:00 pm\n-\n4:30 pm\nFlamingo Festival\nSunken Gardens\n1825 4th St N, St. Petersburg, FL, United States\nSAVE THE DATE | Flamingo Festival will be on Sunday, December 7 from 12 pm to 4:30 pm (Last admission at 4 pm). Join us at Sunken Gardens as we celebrate our flamingos with a day of fabulous festivities and holiday fun. Wear pink for $1 off admission! ~Stay tuned for more details about this […]\nFeatured\nFeatured\nJanuary 25, 2026 @ 12:00 pm\n-\n4:00 pm\n4th Annual Plantapolooza\nSunken Gardens\n1825 4th St N, St. Petersburg, FL, United States\nSAVE THE DATE | Plantapolooza will be on Sunday, January 25 from 12 pm to 4 pm. Sunken Gardens is proud to host the fourth annual Plantapolooza, a local botanical event dedicated exclusively to Florida native plants. Originated by The Community Wildlife Corridor, this event seeks to connect the wildlife populations in our largest parks […]\n1825 4th St. N.\nSt. Petersburg, FL 33704\n727-551-3102\nVisit our Facebook\nVisit our Instagram\nPhoto Credit: City of St. Petersburg & Julia Calvert\nPhotography & Filming Policy",
      "emails": []
    },
    {
      "url": "https://sunkengardens.org/weddings/",
      "is_candidate": false,
      "has_email": false,
      "text": "Weddings & Events\nCelebrate Your Special Day in Our Tropical Paradise\nIn contrast to the rapid pace of the city outside its vine-covered walls, Sunken Gardens offers a tranquil garden atmosphere that creates space for connection, reflection, and community. Sunken Gardens offers a prime location for weddings, private parties, seminars, luncheons, retreats, and receptions hosted by corporations, organizations, or individuals. Events held at the Gardens offer guests a unique experience in a venue that’s conveniently located near hotels, shopping, museums, dining, and entertainment.\nSince 1935, Sunken Gardens has been a sought-after setting for exchanging vows. Hundreds of flowering plants, lush tropical displays, and serene waterfalls create a beautiful and tranquil atmosphere in which to say, “I do.”\nGarden wedding ceremonies are offered on the historic\nWedding Lawn\n,\nNorth Lawn\n, or under a canopy of shade trees in the\nOak Pavilion\n; celebrations can be hosted in the Garden Room—part of the historic main building.\nVisit the\nSunken Gardens Weddings Facebook\nto get ideas for your big day.\nDaytime Ceremony\nSunday only\n10 a.m. - 1 p.m.\nCeremony start time: 11 a.m.\nPackage Details:\nRehearsal\nChairs\nOne dressing room\nCost: $2,500\nEvening Wedding Packages\nFriday, Saturday, Sunday\n4:30 - 11:30 p.m.\nGardens & Garden Room Package\nCeremony on North Lawn\nCocktail hour in Oak Pavilion\nReception in Garden Room\nCapacity up to 176 Guests\nCost: $7,500\nOak Pavilion Package\nCeremony on North Lawn\nCocktail hour in Palm Plaza\nReception in Oak Pavilion\nCapacity up to 72 Guests\nCost: $8,000\nGarden Room Reception Package\nAccess to Oak Pavilion for Cocktail Hour\nReception in Garden Room\nCost: $5,500\nEvening Tent Wedding Packages\nFriday, Saturday, Sunday\n4:30 - 11:30 p.m.\nGardenia Package\nWedding Lawn with 40’x80’ white tent\nWhite chairs, round tables, banquet tables\nHouse lights, dance floor, stage, generator for bands\nCapacity up to 200 guests\nCost: $17,500\nRoyal Palm Package\nWedding Lawn with 40’x80’ white or clear tent\nPole draping options, chair options, round tables, banquet tables\nLights, dance floor, stage, generator for bands\nCapacity for up to 200 guests\nCost: $27,500\nContract & Payment\nThe signed contract, half the rental fee (non-refundable) plus a $250 refundable damage deposit are required to reserve a date. The balance is due 30 days prior to the event. 3% sales tax is applicable on rental. Prices are subject to change. No prices are guaranteed until contract is signed. Holiday rates will apply.\nThe damage deposit will be retained for any clean-up or damage to the property.\nAll rental time frames include set-up, the event and clean-up.\nWedding rehearsals are included in the contract and are one hour maximum. Date and time of rehearsal will be arranged in advance by the venue.\nCatering & Bar Services\nYou are required to select from the Sunken Gardens’ approved catering list. Caterers and rental companies must set up and break down within the contracted time. Caterers are required to pay a 15% service charge to Sunken Gardens. The fee is calculated by, and payable to the caterer by the client. No food other than the wedding cake is allowed unless provided by an approved caterer.\nAlcoholic beverages must be purchased through Sunken Gardens. Contact 727-892-5715.\nSmoking Policy\nSmoking is not allowed anywhere in the Gardens, except in designated areas. Smoking is only permitted outside the Garden entry gate.\nParking\nSelf parking is complimentary in Sunken Gardens parking lot. Valet fees may apply.\nFrequently Asked Questions\nWhat is included in the rental?\nSpace, chairs, and/or tables, parking, dressing room, rehearsal, two day of venue coordinators and one maintenance staff. Linens are not included.\nWhat if I need to cancel or change the date?\nOnly the damage deposit is refundable.\nWhat is the back up policy for rain?\nIf you have rented the Garden Room, you may hold the ceremony within the reception set-up.\nAre receptions allowed in the Gardens?\nYes, evening outdoor receptions with a tent on the Wedding Lawn are allowed. Weddings with a maximum guest count of 72 guests are allowed in the Oak Pavilion.\nAre candles allowed?\nUnity candles only are allowed in the Gardens, and candles in glass votives are allowed in the Garden Room. Battery operated candles allowed outdoors.\nWhen may I decorate?\nWithin the contracted rental time, unless otherwise noted.\nAre there any restrictions for decorating?\nThe following items will not be permitted when decorating the walls, floor, ceiling or stages: bolts, screws, nails, staples, scotch tape, electric tape, duct tape and glue. Crepe paper is not allowed. Glitter is not permitted on tables or floors. Sunken Gardens will not furnish ladders or linens for decorating.\nIn an effort to preserve the beauty and history of Sunken Gardens, the following items are prohibited at Sunken Gardens:\nBird seed, confetti, fireworks, glitter, rice, sparklers, torches, or any open flames. Any item not listed must be pre-approved by management if being considered.\nWhen can I arrive the day of?\nFor evening packages arrival can be at 3 p.m. Earlier arrival times must be arranged with Sunken Gardens in advance. Additional fees will apply.\nBook Your Wedding OR EVENT\nCall 727-551-3106 to book Sunken Gardens for a daytime or evening wedding or event.\n1825 4th St. N.\nSt. Petersburg, FL 33704\n727-551-3102\nVisit our Facebook\nVisit our Instagram\nPhoto Credit: City of St. Petersburg & Julia Calvert\nPhotography & Filming Policy",
      "emails": []
    },
    {
      "url": "https://sunkengardens.org/events/list/?eventDisplay=past",
      "is_candidate": false,
      "has_email": false,
      "text": "Events\nApril 19 @ 10:00 am\n-\n4:30 pm\nEarth Day Scavenger Hunt\nSunken Gardens\n1825 4th St N, St. Petersburg, FL, United States\nWhy do leafcutter bees cut leaves? What power can our Growing Stone give you? Find out by exploring Sunken Gardens’ winding paths, turtles, butterflies, and flowers on a self-guided scavenger hunt at your leisure. You may just win some Florida wildflower seeds and other prizes to celebrate Earth Day all year long! Available all day […]\nApril 22 @ 10:00 am\n-\n4:30 pm\nEarth Day Scavenger Hunt\nSunken Gardens\n1825 4th St N, St. Petersburg, FL, United States\nWhy do leafcutter bees cut leaves? What power can our Growing Stone give you? Find out by exploring Sunken Gardens’ winding paths, turtles, butterflies, and flowers on a self-guided scavenger hunt at your leisure. You may just win some Florida wildflower seeds and other prizes to celebrate Earth Day all year long! Available all day […]\nApril 24 @ 5:30 pm\n-\n7:30 pm\nSecret Garden: Collage & Journaling Workshop\nSunken Gardens\n1825 4th St N, St. Petersburg, FL, United States\nCultivate a secret garden through journaling and collaging at this Sunken Gardens workshop. After enjoying a meditative walk through the gardens, Jaye Ann Terry will engage you in a journaling exercise that will tap into your inner garden. Then Margo Hammond will share with you the history of collage and invite you to create your […]\nMay 27 @ 11:00 am\n-\n12:00 pm\nRainwater Harvesting Talk\nSunken Gardens\n1825 4th St N, St. Petersburg, FL, United States\nDid you ever consider making use of rainwater? Join Melissa West of UF/IFAS Pinellas County Extension to learn how to setup your own rain barrel, collect rainwater and use it in the landscape. We will explore practical, low-cost approaches to harness our most precious resource, rainwater and at the same time reduce stormwater runoff and […]\nJune 9 @ 10:30 am\n-\n11:30 am\nStory Time at Sunken Gardens\nMonday, June 9,Two Sessions: 10:30 am & 11 amStory Time at Sunken Gardens Local author, Kristen Hogan, leads this fun story time by reading her engaging book, Creepy Crawlies Aren’t Creepy at All, in which a little girl attending a party thrown by her parents brings a creepy crawlie with her. This playful, rhyming imaginative […]\nJune 28 @ 10:15 am\n-\n11:00 am\nPollinator Walk\nSunken Gardens\n1825 4th St N, St. Petersburg, FL, United States\nJune is Pollinator Month! Learn how easy Florida wildflowers are to grow and about the important pollinators they support on this guided exploration of our Pollinator Garden and other select areas of Sunken Gardens. Our Education Director and Florida Wildflower Foundation contractor, Jennifer Tyson, will point out blooming native plants while explaining the essential role […]\nJuly 12 @ 10:00 am\n-\n12:00 pm\nPOSTPONED Petals & Pulp - Botanical Papermaking Pop-Up\nSunken Gardens\n1825 4th St N, St. Petersburg, FL, United States\n*PROGRAM POSTPONED* Due to unforeseen circumstances, we must postpone this papermaking pop-up. Stay tuned for a future date to participate! --- Get creative with this walk-up papermaking experience in the Gardens! Join local artist Payton Hurley as she leads guests through the ancient art of papermaking using the traditional western approach. Embellish your handmade paper […]\nJuly 17 @ 6:43 am\n-\n9:00 am\n52nd Annual Sunrise Sale\nRise & shine, St. Pete! Sunken Gardens is excited to take part in the 52nd annual Sunrise Sale on Thursday, July 17. Starting at 6:43 am, our store will be open for a unique early morning shopping experience. Wear your favorite pajamas for a special surprise. Enjoy a complimentary “flamosa” until 9 am. Please note: […]\nJuly 26 @ 11:00 am\n-\n12:00 pm\nAn Introduction to Bonsai: The Art & Craft of Creating Miniature Trees\nSunken Gardens\n1825 4th St N, St. Petersburg, FL, United States\nJoin us at the Gardens as we learn about the wonderful world of bonsai with speaker Shaji Mathews of the Hukyu Bonsai Society of Tampa. During this talk, Shaji will discuss what bonsai is and highlight the different styles of this art form. He will also explain how to get started creating bonsai yourself, offering […]\nAugust 23 @ 11:00 am\n-\n12:30 pm\nHeirloom Vegetables for Florida - Talk + Sale\nSunken Gardens\n1825 4th St N, St. Petersburg, FL, United States\nLate summer is seed-starting time for Florida vegetable gardens! But finding the right heirloom varieties of veggies can make a big difference in the harvests you reap. We will dive into some fantastic choices that thrive in our unique growing conditions during this talk led by Elise Pickett, owner of The Urban Harvest LLC. Based […]\n1825 4th St. N.\nSt. Petersburg, FL 33704\n727-551-3102\nVisit our Facebook\nVisit our Instagram\nPhoto Credit: City of St. Petersburg & Julia Calvert\nPhotography & Filming Policy",
      "emails": []
    },
    {
      "url": "https://sunkengardens.org/about-us/",
      "is_candidate": false,
      "has_email": false,
      "text": "About Us\nAbout Sunken Gardens\nNestled in the heart of St. Pete, Sunken Gardens is a lush, tropical oasis home to more than 50,000 exotic tropical plants and birds from around the world, including its iconic flamingo flock.\nAt more than 100 years old, Sunken Gardens is St. Pete’s oldest living museum.\nLearn about Sunken Gardens’ rich history here\n.\nSunken Gardens is owned and operated by the\nCity of St. Peterburg\n. The City purchased Sunken Gardens in 1999 with funds from a voter-approved tax. With the original vision in mind, the City works to preserve this historic botanical garden and use it to provide cultural and educational opportunities to the community.\nGet in Touch\n727-551-3102\n1825 4th St. N.\nSt. Petersburg, FL\n33704\nVisit our Facebook\nVisit our Instagram\nJoin Our Flock\nWant to work at Sunken Gardens? Find open positions at\nstpete.org/jobs\n.\nShow your support for Sunken Gardens by volunteering.\nMore information\nhere\n.\n1825 4th St. N.\nSt. Petersburg, FL 33704\n727-551-3102\nVisit our Facebook\nVisit our Instagram\nPhoto Credit: City of St. Petersburg & Julia Calvert\nPhotography & Filming Policy",
      "emails": []
    },
    {
      "url": "https://sunkengardens.org/membership/",
      "is_candidate": false,
      "has_email": false,
      "text": "Membership\nNOTICE\n: Due to the overwhelming support from our members and volume of attendance at special events, new memberships may not be processed or redeemed on special event days.\nSupport the Gardens\nResidents can deepen their roots with Sunken Gardens by becoming a member. Sunken Gardens members receive unlimited annual admission to Sunken Gardens, giving them year-round access to this unique tropical garden experience.\nMember Benefits\nMembers of Sunken Gardens enjoy valuable \"members only\" benefits and help support new educational opportunities, children's programs, special events, and plant collections.\nUnlimited free admission for one year during regular hours\n10% discount in the gift shop (on regular-priced items)\nFree admission and shop discounts at over 200 reciprocal gardens, arboreta, and conservatories across the United States, Caribbean, and Canada. For a complete list of reciprocal gardens, visit\nahsgardening.org.rap\n.\nDiscounts and priority registration for specified workshops\nAccess to horticultural resources\nDiscounts at local attractions\nCurrent Local Reciprocal OFferings\nSunken Gardens members may enjoy reciprocal admission to the following venues during the dates listed below.  It is advised to call ahead to confirm reciprocal benefits are available the day you plan to attend.\nFall 2025:\nOctober - Glazer Children's Museum: Free admission\nOctober - Great Explorations Children's Museum: Free admission (*Note: Great Explorations will be closed every Tuesday during this time).\nOctober - Museum of Science and Industry: Free admission\nNovember - Florida Holocaust Museum: Free admission & 10% off Gift Shop items\nNovember - Imagine Museum: Free admission\nNovember - James Museum: Free admission\nWinter 2025:\nDecember - Florida Holocaust Museum: Free admission & 10% off Gift Shop items\nALL YEAR:\nClearwater Marine Aquarium and the Florida Aquarium: Half off for all of 2025\nTampa Bay Watch (Discovery Center at the St. Pete Pier): Free admission for all of 2025\nNaples Botanical Garden: 50% off general admission\nMembership Rates\nIndividual Membership: $50\nFamily Membership: $100 (Includes 2 household family member cardholders with valid ID and children aged 17 and younger. Family Membership holders receive all \"members only\" benefits listed above.)\nBecome a Member\nPurchase a Sunken Gardens membership by visiting the admissions desk in our lobby. The process takes approximately 15 minutes and will require your photo to be taken by a Sunken Gardens staff member.\nBecome a Business Partner\nIn collaboration with the Sunken Gardens Forever Foundation, Sunken Gardens is proud to partner with local businesses who contribute to the preservation and enhancement of the garden experience.\nTo learn more about Business Partnership Program benefits, tiers, and more, please visit the\nSunken Gardens Forever Foundation website\n.\nJoin our business partners\nBOUGAINVILLEA LEVEL\nFlagship Bank\nAZALEA LEVEL\nThe Growth Coach St. Pete\nLandmark Payroll\n1825 4th St. N.\nSt. Petersburg, FL 33704\n727-551-3102\nVisit our Facebook\nVisit our Instagram\nPhoto Credit: City of St. Petersburg & Julia Calvert\nPhotography & Filming Policy",
      "emails": []
    }
  ],
  "all_links": [
    "https://sunkengardens.org/plants/",
    "https://sunkengardens.org/event/fall-vegetable-garden-planning-talk-sale/",
    "webcal://sunkengardens.org/?post_type=tribe_events&ical=1&eventDisplay=list",
    "https://sunkengardens.org/",
    "https://sunkengardens.org/events/list/?outlook-ical=1",
    "https://sunkengardens.org/volunteer/",
    "https://sunkengardens.org/events/list/",
    "https://sunkengardens.org/events/today/",
    "https://sunkengardens.org/events/",
    "https://sunkengardens.org/weddings/",
    "https://sunkengardens.org/events/month/",
    "https://sunkengardens.org/tours-group-events/",
    "https://sunkengardens.org/photography-policy/",
    "https://sunkengardens.org/events/list/?eventDisplay=past",
    "https://sunkengardens.org/plan-your-visit/",
    "https://sunkengardens.org/about-us/",
    "https://sunkengardens.org/events/list/?ical=1",
    "https://sunkengardens.org/membership/",
    "https://sunkengardens.org/event/introduction-to-propagation-talk/",
    "https://sunkengardens.org/history/",
    "https://sunkengardens.org/event/flamingo-festival-2/",
    "https://sunkengardens.org/event/4th-annual-plantapolooza/",
    "https://sunkengardens.org/donate/",
    "https://sunkengardens.org/animals/"
  ],
  "candidate_links": [
    "https://sunkengardens.org/events/",
    "https://sunkengardens.org/weddings/",
    "https://sunkengardens.org/events/list/?eventDisplay=past",
    "https://sunkengardens.org/about-us/",
    "https://sunkengardens.org/membership/"
  ],
  "visited": [
    "https://sunkengardens.org/",
    "https://sunkengardens.org/about",
    "https://sunkengardens.org/contact",
    "https://sunkengardens.org/staff",
    "https://sunkengardens.org/team",
    "https://sunkengardens.org/board",
    "https://sunkengardens.org/directory",
    "https://sunkengardens.org/events",
    "https://sunkengardens.org/sitemap.xml",
    "https://sunkengardens.org/council",
    "https://sunkengardens.org/leadership",
    "https://sunkengardens.org/management",
    "https://sunkengardens.org/producers",
    "https://sunkengardens.org/support",
    "https://sunkengardens.org/crew",
    "https://sunkengardens.org/members",
    "https://sunkengardens.org/bios",
    "https://sunkengardens.org/people",
    "https://sunkengardens.org/artists",
    "https://sunkengardens.org/musicians",
    "https://sunkengardens.org/faculty",
    "https://sunkengardens.org/administration",
    "https://sunkengardens.org/events/",
    "https://sunkengardens.org/weddings/",
    "https://sunkengardens.org/events/list/?eventDisplay=past",
    "https://sunkengardens.org/about-us/",
    "https://sunkengardens.org/membership/"
  ],
  "base_url": "https://sunkengardens.org/"
}