{
  "pages": [
    {
      "url": "http://www.thetabledeland.com/private-dining-event-rooms",
      "is_candidate": false,
      "has_email": true,
      "text": "Private Events\nPrivate Dining & Event Rooms\nWeddings\nAbout The Different Dining Spaces\nWe offer a variety of versatile spaces designed to suit any event or gathering, whether you're planning a corporate meeting, a social gathering, or a family celebration. Our venue is equipped to handle both large and small groups, with flexible options to match the size and style of your event. From intimate gatherings to more formal occasions, we have spaces that can be tailored to meet your specific needs, ensuring that your event is both memorable and seamlessly executed.\nMore information\nMENU:\nWe will create a custom menu of the items off our current menus. You can pick up to 5 items (This does not include any kid items or a vegetarian / vegan item) Once your deposit is paid and we have confirmed your event we will reach out and start working on your menu.\n**This only applies for seated dinner**\nIf doing appetizers & cocktails we will discuss more in detail the options for that after you have confirmed the minimum and paid the deposit.\nDEPOSIT:\nA $100 deposit required for this booking. It is non-refundable if you cancel. This deposit can be applied to your final bill. Your reservation is not confirmed until the deposit is paid.\nDECORATIONS:\nYou are more than welcome to bring decorations we ask no\n(confetti, glitter or feathers)\n.\nWe only provide linens for the below deck\n.\nYou can also bring your own cake or dessert but no outside food unless approved. You can bring your own bottles of wine / champagne but there is a $20 corking fee per bottle. Absolutely no alcohol can be brought in.\nOTHER FEES:\nPlanning fee |\n$50 this fee is non-refundable and won't be applied to your bill.\nGratuity |\n20%\nFood & Beverage Minimums |\nBelow is a breakdown of the available spaces and their corresponding food and beverage minimums. Please note that these minimums are calculated before taxes and gratuity. The total food and beverage minimum applies to all bills within the reserved space, regardless of whether the payments are split across multiple checks—it encompasses the entire group, not just the person who made the reservation. If the minimum is not met, the remaining balance will be charged as a room fee.\nADD-ONS:\n50-Inch Smart TV | $100 - Entire Reservation\nMake your special moments shine with our 50-Inch Smart TV—perfect for rehearsal dinners, baby showers, and intimate gatherings. Use it to display slideshows, photo albums, or videos that celebrate your journey and memories. The TV is available for your entire reservation and comes with an HDMI cable, making it easy to connect your laptop and start sharing instantly. Create a warm, personal atmosphere your guests will love!\nKaraoke Setup | $25 - Entire Reservation\nBring the fun and laughter to your event with our Karaoke Setup! Perfect for baby showers, rehearsal dinners, or casual get-togethers, this add-on includes\n2 microphones\nand an\niPad preloaded with a karaoke-based platform\n—no complicated setup required. Just pick your favorite songs, grab a mic, and let the good times roll. Whether it’s a heartfelt duet or a hilarious group performance, karaoke is a guaranteed crowd-pleaser!\nIf you’re interested in adding any of these add-ons to your event, please mention them in your initial email request so we can ensure availability and have everything set up for you in advance.\nDining Spaces available\nBelow Deck\n35 Seated | 45 Standing\nFor those seeking complete privacy, our 'Below Deck' downstairs space is the ideal retreat—quiet, intimate, and perfect for private gatherings or unwinding. Need to present? Ask about our TV setup rental.\nPerfect for seminars completely private.\nDecorations to include black linens, gold chargers, tea lights & flower garland in the middle.\nFood & Beverage Minimums\nMon – Sun: 11AM – 3PM | $450\nMon – Sat: 4PM – Close | $850\nWindow Side\n25 - 45 Seated\nThis space is perfect for seated dinners. It is very elegant and the vibes are immaculate with the lights above you and being right on the street.\nThis is not a private space but you are secluded to your own side. $200 set up fee for parties 26 - 45 Seats. (Anything above 25 requires us to rearrange the dining room)\n25 and under -\nNO\n$200 set up fee or linens but there will be chargers and basic decorations.\n26 and above - $200 fee but will include linens, chargers and decorations.\nSee Picture\nFood & Beverage Minimums\nMon – Sun: 11AM – 3PM | $500\nMon – Thur: 4PM – Close | $900\nFri – Sat: 4PM – Close | $1,000\nThe Stairs\n20 Seated\nThis space is perfect for seated dinners. It is two split 10 tops with enough space to mingle in the middle.\nThis is not a private space but you are secluded you your own side.\nThis can fit 20 seated 25 standing.\nWe do not provide linens however we do provide minimal decorations and placemats. (See picture)\nFood & Beverage Minimums\nMon – Sun: 11AM – 3PM | $450\nMon – Thur: 4PM – Close | $550\nFri – Sat: 4PM – Close | $650\nHigh tops\n28 seated | 35 Standing\nPerfect for birthday parties or bachelorette parties. You will get VIP treatment being right next to the bar. We will block off the space from other guests so you can mingle in peace. There is 28 seats in this space but can accommodate up to 35 standing.\nFood & Beverage Minimum (Brunch & Lunch $600 | Dinner $700)\nThis is not a private space but you get the entire section in front of the bar.\nWill not provide linen.\nThis space is good for cocktails & appetizers not fully plated dinners.\nFood & Beverage Minimums\nMon – Sun: 11AM – 3PM | $750\nMon – Thur: 4PM – Close | $850\nFri – Sat: 4PM – Close | $950\nEntire Lounge\n90 Seated | 120 Standing\nWhether you're hosting a corporate mixer, milestone celebration, or a holiday extravaganza, The Above Deck provides the perfect canvas for your event.\nYou can bring in your entertainment for this space.\nPerfect for appetizers & cocktail or self serve style dinner options.\nFood & Beverage Minimums\nAnytime | $3,500\nEntire Downstairs\n50 Seated | 150 Standing\nThis is only for inside if needed the patio included please include that in your form.\nThis is perfect for larger parties that are too big for any of the other options available. There is it's own bar downstairs and there is a possiblity to also have the patio as well included with a higher food & beverage minimum. There is a $200 set-up fee if wanting different tables brought in with linens if wanting to just use the tables as-is there is not set up fee. Perfect for conferences & larger family gatherings where you want a seated dinner. If wanting this for a wedding, please refer to our\nwedding tab\nbecause that will reflect the food and beverage minimum to include the patio.\nAdditional Information About This Space:\nSeating for 42 guests\nis available at three large tables at no additional cost.\nSeating for up to 80 guests\ncan be arranged using our existing booth and table layout, also with no additional fee.\nIf you prefer a\nmore formal setup\nwith all guests seated at large banquet-style tables, a\n$200 setup fee\napplies. This covers the removal of existing furniture and the setup of custom tables.\nThere is the bar available downstairs as well.\nREMINDER THIS IS FOR INSIDE ONLY. IF NEEDING PATIO PLEASE PUT THAT IN YOUR FORM.\nFood & Beverage Minimums\nMon – Sun: 11AM – 3PM | $1,000\nMon – Thur: 4PM – Close | $1,500\nFri – Sat: 4PM – Close | $2,000\nBook Your Next Event With us\nMORE INFORMATION\nWe will contact you through email so make sure to put an accurate email address in the form below.\nWe will contact within 72 hours through email. Please make sure you're checking your email if you're waiting for a response.",
      "emails": [
        "info@thetabledeland.com",
        "privatedining@thetabledeland.com",
        "user@domain.com"
      ]
    }
  ],
  "all_links": [
    "http://www.thetabledeland.com/bottomless-brunch",
    "http://www.thetabledeland.com/reservations",
    "http://www.thetabledeland.com/private-dining-event-rooms",
    "http://www.thetabledeland.com/kids-menu",
    "http://www.thetabledeland.com/thetablecatering",
    "http://www.thetabledeland.com/weekendmenu",
    "http://www.thetabledeland.com/murder-mystery-ticket",
    "http://www.thetabledeland.com/current-job-openings",
    "http://www.thetabledeland.com/restaurant",
    "http://www.thetabledeland.com/",
    "http://www.thetabledeland.com/overstock-wine-beer-list",
    "http://www.thetabledeland.com/lunch-menu",
    "http://www.thetabledeland.com/drink-menu",
    "http://www.thetabledeland.com/dinner-menu",
    "http://www.thetabledeland.com/hours",
    "http://www.thetabledeland.com/weddings"
  ],
  "candidate_links": [
    "http://www.thetabledeland.com/private-dining-event-rooms"
  ],
  "visited": [
    "http://www.thetabledeland.com/",
    "http://www.thetabledeland.com/about",
    "http://www.thetabledeland.com/contact",
    "http://www.thetabledeland.com/staff",
    "http://www.thetabledeland.com/team",
    "http://www.thetabledeland.com/board",
    "http://www.thetabledeland.com/directory",
    "http://www.thetabledeland.com/events",
    "http://www.thetabledeland.com/sitemap.xml",
    "http://www.thetabledeland.com/council",
    "http://www.thetabledeland.com/leadership",
    "http://www.thetabledeland.com/management",
    "http://www.thetabledeland.com/producers",
    "http://www.thetabledeland.com/support",
    "http://www.thetabledeland.com/crew",
    "http://www.thetabledeland.com/members",
    "http://www.thetabledeland.com/bios",
    "http://www.thetabledeland.com/people",
    "http://www.thetabledeland.com/artists",
    "http://www.thetabledeland.com/musicians",
    "http://www.thetabledeland.com/faculty",
    "http://www.thetabledeland.com/administration",
    "http://www.thetabledeland.com/private-dining-event-rooms"
  ],
  "base_url": "http://www.thetabledeland.com/"
}