{
  "pages": [
    {
      "url": "http://www.treasurecoastpiratefest.com/contact-us.html",
      "is_candidate": false,
      "has_email": false,
      "text": "Treasure Coast Pirate Fest\nHome Port\nEntertainment\nSponsors\nVendor Info\nContact Us\nDirections\nLiving History Pirate Encampment\nTreasure Hunters Artists and Authors\nWhere to Stay\nVolunteer\nContact Us\nA portion of the proceeds of the 16th Annual Fort Pierce Seafood Festival will benefit\nthe Treasure Coast Food Bank\na recognized 501(c)3 organization that distributes food and needed products to over 200+ Partner Agencies along the Treasure Coast.\n​\nNon-perishable food donations and\nCanned Goods will be collected at the gates.\nPirates Take Notice:\nWeapons Policy\nNotice: Entertainment lineup, special guests, attractions,\nschedule times, days\nand activities may be subject to change without notice.\n***Unauthorized Distribution of Promotional Materials at this Event is Strictly Prohibited***\nFort Pierce Seafood Festival and Treasure Coast Pirate Fest © Copyright 2009-2024 Pirates of the Treasure Coast - POTTC Events All Rights Reserved",
      "emails": []
    },
    {
      "url": "http://www.treasurecoastpiratefest.com/treasure-hunters-artists-and-authors.html",
      "is_candidate": false,
      "has_email": false,
      "text": "Treasure Coast Pirate Fest\nHome Port\nEntertainment\nSponsors\nVendor Info\nContact Us\nDirections\nLiving History Pirate Encampment\nTreasure Hunters Artists and Authors\nWhere to Stay\nVolunteer\n​\nDon Maitz will be exhibiting his pirate art collection as well as signing items that are available for purchase inside the Riverwalk Center.\nDon Maitz - Creator of the Captain Morgan Spiced Rum Character\n​Don Maitz is an American artist whose amazing work covers the spectrum of Science Fiction, Horror and Fantasy Art including a very extensive collection of Pirate Art.\nHe has twice won the Hugo Award for Best Professional Artist, science fiction's highest honor for an artist and honored ten times with a Chesley Award for outstanding achievement in the Association of Science Fiction and Fantasy Artists, still he is probably best known for his creation of the iconic Captain Morgan spiced rum character.\nHis art has appeared on the covers of books by famed authors and writers such as Stephen King, Isaac Asimov, Ray Bradbury, C. J. Cherryh, Gene Wolfe, Michael Moorcock, and Raymond E. Feist.\nHis works have been showcased in public exhibitions and museums across the nation.  Major works have been privately purchased and or commissioned by numerous celebrity collectors.\nDon Maitz has been recognized by a certificate of merit from New York City's Society of Illustrators Annual Exhibition committee for his painting \"Forty Thieves\".\nWatercolor paintings by Maitz have been a yearly installment in Gallery One Masterworks in Miniature exhibitions, and his art has also been juried into the International Marine Art Exhibition at the Maritime Gallery at Mystic Seaport in Mystic, CT, where his oil painting, \"A Sheet to the Wind\", received an Award of Excellence.\nImaginative paintings by Don Maitz have been displayed in group shows at the New Britain Museum of American Art, CT; the Delaware Art Museum,DE; and the Canton Art Museum, Canton, OH.\nEach of these exhibits drew record attendance.\nTreasure Hunters, Artists and Authors\n​\n​\nRobert Jacob\nAuthor - Historian\nWith a lifelong passion for history, Robert Jacob has been heavily involved in living history interpretation and reenacting for over 40 years. He has participated in activities covering a wide range of time periods including numerous French and Indian War and Revolutionary War reenactment groups, Western Gun Fighter groups, regularly attending Mountain Man Rendezvous and Renaissance Fairs.  During the past 12 years he has focused on the golden age of piracy with a concentration on Blackbeard.\nOriginally from Pittsburgh, PA, Robert graduated from Duquesne University with a Bachelor’s Degree in education in 1978.  He taught in the West Point public school district, West Point, VA for five years while completing his Master’s Degree from Virginia Commonwealth University in 1983.\nIn 1982, Robert entered the United States Marine Corps reserve and augmented to active duty in 1983.  During his service, he became a military occupational specialty instructor and earned the designation of Master Training Specialist.  Later in his career, he became the Commanding Officer of the Marine Detachment at the same school where he had earlier instructed.  He achieved the rank of Chief Warrant Officer 5 and retired after 31 years of service in 2013.\nWhile researching information on the golden age of piracy, Robert realized that most of the publications on the subject were contradictory and even incorrect.  This motivated him to write his current publication, “A Pirate’s Life in the Golden Age of Piracy.”\n​\nThink you know everything about Pirates?\nFascination with Pirates has for centuries driven stories of heroic proportions—true, exaggerated, and imaginary.  Legends of their high seas debauchery continue to inspire modern day books, movies, and groups, dedicated to acting out their past. Pirates are heroes to some and the lowest of crooks to others, but do we really know the truth?\nThe facts are that the historical record on pirates is vague, contradictory, and rarely accurate. Digging deep into the true history of Piracy and those who lived this life, Robert Jacob has unearthed a treasure of information that allows you to see, feel, and experience the true life and motivation of pirates in their Golden Age.\nCome aboard and see what pirates actually wore, the type of ships they used, and how they planned and executed some of the most cunningly successful heists ever known.\nA Pirates Life in the Golden Age of Piracy\nwill fascinate and transport you back in time with rich stories and visual accuracy. If you thought you knew all about pirates you’re in for some surprising revelations that will leaving you even more intrigued!\n​\nCarl Fismer -\n​World Famous Treasure Hunter\nCaptain Carl Fismer is one of the most respected and\nknowledgeable treasure diving professionals in the world.\nHis area of expertise is shipwrecks, especially Spanish\nshipwrecks and has recovered millions of dollars in gold, silver, jewels and other artifacts.\nHe has worked over 300 shipwrecks including\nthe\nTaj Mahal Treasure and the famed galleon Concepcion.\nThe Concepcion; not to be confused with a ship baring the same name, Nuestra Senora de la Concepcion which sank in 1638 near the southernmost point of Saipan, the second Concepcion sank in 1641, 70 miles off the northern coast of the Dominican Republic upon the coral reefs known as the Silver Bank.\n\"Fizz” as he is known to friends, directed part of the salvage diving of the Santa Margarita, sister ship to the Nuestra Senora de Atocha, which was discovered by Mel Fisher.\nIn 1992, he traveled to Sri Lanka and dived with Sir Arthur C. Clarke of 2001: A Space Odyssey fame, in association with the Great Basses Reef Treasures.\nIn May, 2010, Captain Fismer was awarded the Mel Fisher Lifetime Achievement Award.\n​\nPatrick S. Mesmer - Author\nGHOSTS OF THE TREASURE COAST\nThe Treasure Coast is such a popular destination that some choose to never leave. From the spirits of ancient Indians who once inhabited the beaches to the pirates who spied for passing victims from the safety of the inlets and coves, the region is infused with eerie, tragic history. A phantom widow keeps watch from the Boston House window for men long ago lost at sea. Spirits of the victims of a murderous cop linger at the Devil’s Tree, where their bodies were found. The dreaded pirate Black Caesar still steers his ghost ship toward Dead Man’s Point in the St. Lucie Inlet. Authors Patrick and Patricia Mesmer navigate through spooky tales of vanished sailors, wandering phantoms and lost treasure scattered across the ocean floor.\nJoin Patrick and Patricia Mesmer as they explore the fascinating history of Florida's Treasure Coast with a paranormal twist!\nThey say that all legends have a grain of truth at their core. The Hungry Land slough in Southeast Florida has its own chilling, ancient secret. Could a vengeful demon from the past be lurking in the darkest reaches of the swamp, hungrily awaiting its next unsuspecting victim? If so, could this seemingly unstoppable terror ever be defeated?\nJoin an unlikely team of young heroes as they encounter an evil more terrifying than anything in their darkest nightmares. Who will be next?\nThis tale spans hundreds of years of Florida history. Come join us for a riveting and terrifying adventure in paradise.\nA portion of the proceeds of the 16th Annual Fort Pierce Seafood Festival will benefit\nthe Treasure Coast Food Bank\na recognized 501(c)3 organization that distributes food and needed products to over 200+ Partner Agencies along the Treasure Coast.\n​\nNon-perishable food donations and\nCanned Goods will be collected at the gates.\nPirates Take Notice:\nWeapons Policy\nNotice: Entertainment lineup, special guests, attractions,\nschedule times, days\nand activities may be subject to change without notice.\n***Unauthorized Distribution of Promotional Materials at this Event is Strictly Prohibited***\nFort Pierce Seafood Festival and Treasure Coast Pirate Fest © Copyright 2009-2024 Pirates of the Treasure Coast - POTTC Events All Rights Reserved",
      "emails": []
    }
  ],
  "all_links": [
    "http://www.treasurecoastpiratefest.com/",
    "http://www.treasurecoastpiratefest.com/where-to-stay.html",
    "http://www.treasurecoastpiratefest.com/contact-us.html",
    "http://www.treasurecoastpiratefest.com/directions.html",
    "http://www.treasurecoastpiratefest.com/volunteer.html",
    "http://www.treasurecoastpiratefest.com/weapons-policy.html",
    "http://www.treasurecoastpiratefest.com/entertainment.html",
    "http://www.treasurecoastpiratefest.com/living-history-pirate-encampment.html",
    "http://www.treasurecoastpiratefest.com/sponsors.html",
    "http://www.treasurecoastpiratefest.com/treasure-hunters-artists-and-authors.html",
    "http://www.treasurecoastpiratefest.com/vendor-info.html"
  ],
  "candidate_links": [
    "http://www.treasurecoastpiratefest.com/contact-us.html",
    "http://www.treasurecoastpiratefest.com/treasure-hunters-artists-and-authors.html"
  ],
  "visited": [
    "http://www.treasurecoastpiratefest.com/contact-us.html",
    "http://www.treasurecoastpiratefest.com/about",
    "http://www.treasurecoastpiratefest.com/contact",
    "http://www.treasurecoastpiratefest.com/staff",
    "http://www.treasurecoastpiratefest.com/team",
    "http://www.treasurecoastpiratefest.com/board",
    "http://www.treasurecoastpiratefest.com/directory",
    "http://www.treasurecoastpiratefest.com/events",
    "http://www.treasurecoastpiratefest.com/sitemap.xml",
    "http://www.treasurecoastpiratefest.com/council",
    "http://www.treasurecoastpiratefest.com/leadership",
    "http://www.treasurecoastpiratefest.com/management",
    "http://www.treasurecoastpiratefest.com/producers",
    "http://www.treasurecoastpiratefest.com/support",
    "http://www.treasurecoastpiratefest.com/crew",
    "http://www.treasurecoastpiratefest.com/members",
    "http://www.treasurecoastpiratefest.com/bios",
    "http://www.treasurecoastpiratefest.com/people",
    "http://www.treasurecoastpiratefest.com/artists",
    "http://www.treasurecoastpiratefest.com/musicians",
    "http://www.treasurecoastpiratefest.com/faculty",
    "http://www.treasurecoastpiratefest.com/administration",
    "http://www.treasurecoastpiratefest.com/contact-us.html",
    "http://www.treasurecoastpiratefest.com/treasure-hunters-artists-and-authors.html"
  ],
  "base_url": "http://www.treasurecoastpiratefest.com/contact-us.html"
}