{
  "pages": [
    {
      "url": "https://tropicsentertainment.com/our-team/",
      "is_candidate": false,
      "has_email": true,
      "text": "OUR TEAM\nThe Team Behind Tropics Entertainment\nMeet our passionate pros! Our team is dedicated to outstanding service with keen attention to detail. We love using our creativity, experience, and resources in helping you to create the perfect event.\nSTEVE MITTENTHAL\nBooking – Private Events\nBrooklyn-born, Sales Guru\nFounded Tropics Entertainment in the early 90’s\nDAN MORRIS\nBooking & Event Production\nMusic Maestro and Band Mechanic\nKeeps the trains running on time\nERIC MITTENTHAL\nBooking – Public Venues\nSuperintendent of Good Times\nFootball junkie and creative writer\nBAMBI THOMAS\nEvent Coordinator\nDirector of First Impressions\nKind and patient Zen master\nPerfect For\nWeddings\nBirthdays\nSocial Gatherings\nCorporate Events\nMitzvahs\nBook Now\nContact Us\nPlease enable JavaScript in your browser to complete this form.\nFirst Name\n*\nLast Name\nEmail\n*\nPhone\n*\nExt.\nBand(s) Interested In\nEvent Type\nEvent Venue\nEvent Date\nNumber of Guests\nWhere did you hear about us?\nMessage\n*\nThis site is protected by reCAPTCHA and the Google\nPrivacy Policy\nand\nTerms of Service\napply.\n.wpforms-field-container\nEmail\nSubmit\n.wpforms-container\nTROPICS ENTERTAINMENT\n\nAddress\n13186 NW 19th Street | Pembroke Pines, FL 33028\n​\n\nPhone\nP:\n305-531-3468\n\nEmail\nSteve Mittenthal or Dan Morris\ninfo@tropicsentertainment.com",
      "emails": [
        "info@tropicsentertainment.com"
      ]
    },
    {
      "url": "https://tropicsentertainment.com/contact/",
      "is_candidate": false,
      "has_email": true,
      "text": "CONTACT US\nContact Us\nPlease enable JavaScript in your browser to complete this form.\nFirst Name\n*\nLast Name\nEmail\n*\nPhone\n*\nExt.\nBand(s) Interested In\nEvent Type\nEvent Venue\nEvent Date\nNumber of Guests\nWhere did you hear about us?\nMessage\n*\nThis site is protected by reCAPTCHA and the Google\nPrivacy Policy\nand\nTerms of Service\napply.\n.wpforms-field-container\nEmail\nSubmit\n.wpforms-container\nThe Clique performed at our wedding and they were sensational. Everybody was dancing the entire night, the energy was fabulous and Tropics couldn't have been nicer to work with. Our wedding guests raved about the band. We highly recommend them!\nDavid A\nLibido is absolutely the best. They listened when we discussed our preferences. Song selection, performance, and musicianship are tops - no question. Every guest at the wedding commented on how good they were. The dance floor was packed from start to finish. Thank you so much.\nRon S\nWe had Entourage at our wedding and they beyond exceeded our expectations! A month later and people are still talking to us about how incredible the band was - it felt like we were at a concert! Their voices, energy and personalities are incredible and kept our party going all night! Everyone at Tropics was extremely easy to work with and I wish I could give more than 5 stars!\nJillian K\nWe just had our wedding at The Biltmore on February 17th and had the most amazing band, Remix, from Tropics Entertainment. Everyone is going out of their way to tell us how awesome and talented the band was! The band is our guests favorite part of our wedding. Their talents blew us all away and kept everyone dancing all night long! Thank you Remix!!!\nJenn & Danny D\nEntourage knocked it out of the park at our wedding Saturday night. They crushed it!! I never thought I would have so much fun at my own wedding, but I did. They were absolutely amazing! They kept the party going all night long; the dance floor was packed from start to finish. I'd highly recommend them to anyone and everyone looking for a kickass wedding band!\nDana Weinbaum\nContact Us\nPlease enable JavaScript in your browser to complete this form.\nFirst Name\n*\nLast Name\nEmail\n*\nPhone\n*\nExt.\nBand(s) Interested In\nEvent Type\nEvent Venue\nEvent Date\nNumber of Guests\nWhere did you hear about us?\nMessage\n*\nThis site is protected by reCAPTCHA and the Google\nPrivacy Policy\nand\nTerms of Service\napply.\n.wpforms-field-container\nWebsite\nSubmit\n.wpforms-container\nTROPICS ENTERTAINMENT\n\nAddress\n13186 NW 19th Street | Pembroke Pines, FL 33028\n​\n\nPhone\nP:\n305-531-3468\n\nEmail\nSteve Mittenthal or Dan Morris\ninfo@tropicsentertainment.com",
      "emails": [
        "info@tropicsentertainment.com"
      ]
    },
    {
      "url": "https://tropicsentertainment.com/join-our-team/",
      "is_candidate": false,
      "has_email": true,
      "text": "JOIN OUR TEAM\nOn Stage\nWe are always looking for the best of the best! Tropics Entertainment is home to some of the most talented performers in the U.S.. Do you have what it takes to be a part of the Tropics family?\nWe regularly audition singers, dancers, musicians, DJs, Emcees, and hosts. Click on the link below to get the process started!\nMUSICIANS & PERFORMERS\nClick To Audition\nBehind the Scenes\nWe have an amazing team at Tropics Entertainment who work behind the scenes to make each event spectacular. We are a highly motivated group of event coordinators, stage managers, equipment experts, and support staff. We love doing special events! We hire interns and professionals with a passion for music and entertainment. Fill out the form below to be considered for a position on our team.\nEVENT STAFF\nCLICK HERE TO INQUIRE ABOUT A POSITION\nContact Us\nPlease enable JavaScript in your browser to complete this form.\nFirst Name\n*\nLast Name\nEmail\n*\nPhone\n*\nExt.\nBand(s) Interested In\nEvent Type\nEvent Venue\nEvent Date\nNumber of Guests\nWhere did you hear about us?\nMessage\n*\nThis site is protected by reCAPTCHA and the Google\nPrivacy Policy\nand\nTerms of Service\napply.\n.wpforms-field-container\nMessage\nSubmit\n.wpforms-container\nTROPICS ENTERTAINMENT\n\nAddress\n13186 NW 19th Street | Pembroke Pines, FL 33028\n​\n\nPhone\nP:\n305-531-3468\n\nEmail\nSteve Mittenthal or Dan Morris\ninfo@tropicsentertainment.com",
      "emails": [
        "info@tropicsentertainment.com"
      ]
    },
    {
      "url": "https://tropicsentertainment.com/event/",
      "is_candidate": false,
      "has_email": true,
      "text": "Featured Events\nAdd Excitement With a Live Party Band\nBring Tropics Entertainment to your city and enjoy top-notch performances by some of the industry’s best\nWeddings\nLooking for something to make your wedding better than you ever imagined it to be? A wedding is a celebration of love and partnership, as well as a partnership between you and your vendors. At Tropics Entertainment, we offer you the ability to choose a live party band that will turn your event into an unforgettable experience. Delivering top-notch talent with attention to detail, we create elite wedding bands comprised of world-class musicians with years of experience. Our musicians and performers know how to deliver memorable moments each time they take the stage.\nOur exceptionally talented wedding bands come in a variety of ranges. We offer everything from intimate soloists and lush string quartets to 16-piece dance bands. We provide many different combinations of musicians for your wedding ceremony, wedding reception, and even the afterparty. These bands are young, edgy, and stylish.\n“I love to dance, even though I am terrible at it. The best thing to do at a wedding reception is to dance, even if it is terrible. Hearing the music blast through the speakers and the people around you most likely dancing terribly, make it so much fun. Even the commonly played songs make the dancing that much more fun.” – Marisa Combs\nLearn More\nCorporate\nAre you planning on hosting an event for your company? Do you want to ensure that your event will be one to remember? Here at Tropics Entertainment, we specialize in providing live entertainment that will captivate your guests and amp-up the party.\nWe create inspiring and engaging musical experiences from registration through departure. Throwing a rehearsal dinner or coordinating a gala, or were you put in charge of your company’s holiday party? We can help to make it easy.\nWe specialize in coordinating all aspects of entertainment for corporate events. We help you to design unique musical experiences and engaging entertainment that your colleagues and guests will long remember. Whether you plan events for a living or are organizing your holiday party from the side of your desk, we are a reliable partner in helping you achieve your vision.\nLearn More\nMitzvahs\nBar and Bat Mitzvahs are a coming-of-age and an opportunity to celebrate commitment, dedication, hard work and tradition. We also know these celebrations bring all the generations together under one roof. The ability to engage a young crowd while entertaining the adults is a skill reserved only for those at the top of their game.\nTropics Entertainment specializes in making the perfect soundtrack to your Bar Mitzvah or Bat Mitzvah. We have charismatic DJ’s and MC’s that rock the house along with musicians and performers that always take it to the next level. Most of our DJ’s, Emcees, Musicians, and Dancers have been on tour with “A-List” artists such as Usher, Shakira, Rihanna, Marc Anthony, Chris Brown, Pitbull, Flo-rida,  and Enrique Iglesias.\nMusic connects people in the moment, while creating a unique space to celebrate the milestones of our lives. Music makes memories. Tropics Entertainment in partnership with Star Mitzvahs is proud to offer our exclusive “Studio Experience”. Be a superstar on your big day! Premiere your own professionally recorded song and Hollywood-level music video at your party, then drop it on social media like a celeb!\nLearn More\nBirthdays\nWhether it’s a 21st, 40th, or 70th birthday party, a live party band can add excitement and give your celebration a special feel. From solo musicians and solo singers, up to 16pc dance bands, Tropics Entertainment has the right combination of talent, energy, and experience to make your party one for the books.\nCelebrating with friends and family is one of life’s greatest joys. Make your party unforgettable with live music and entertainment. Whether you’re celebrating a birthday or another milestone, our entertainers will take your party to another level. We treat each event differently, working with our clients to find the perfect blend of energy, style, and audience participation that will make your guests feel inspired.\nOur DJs and performers know how to get everyone dancing, without putting pressure on those who might prefer take in the party at a distance. Furthermore, our entertainers love collaborating. Let us know if any of your guests would like to participate and we’ll work with them to create an extra special evening.\nLearn More\nPerfect For\nWeddings\nBirthdays\nSocial Gatherings\nCorporate Events\nGalas\nBook Now\nContact Us\nPlease enable JavaScript in your browser to complete this form.\nFirst Name\n*\nLast Name\nEmail\n*\nPhone\n*\nExt.\nBand(s) Interested In\nEvent Type\nEvent Venue\nEvent Date\nNumber of Guests\nWhere did you hear about us?\nMessage\n*\nThis site is protected by reCAPTCHA and the Google\nPrivacy Policy\nand\nTerms of Service\napply.\n.wpforms-field-container\nPhone\nSubmit\n.wpforms-container\nTROPICS ENTERTAINMENT\n\nAddress\n13186 NW 19th Street | Pembroke Pines, FL 33028\n​\n\nPhone\nP:\n305-531-3468\n\nEmail\nSteve Mittenthal or Dan Morris\ninfo@tropicsentertainment.com",
      "emails": [
        "info@tropicsentertainment.com"
      ]
    },
    {
      "url": "https://tropicsentertainment.com/event/corporate-events/",
      "is_candidate": false,
      "has_email": true,
      "text": "Corporate Events\nAre you planning on hosting an event for your company? Do you want to ensure that your event will be one to remember? Here at Tropics Entertainment, we specialize in providing live entertainment that will captivate your guests and amp-up the party.\nWe create inspiring and engaging musical experiences from registration through departure. Throwing a rehearsal dinner or coordinating a gala, or were you put in charge of your company’s holiday party? We can help to make it easy.\nWe specialize in coordinating all aspects of entertainment for corporate events. We help you to design unique musical experiences and engaging entertainment that your colleagues and guests will long remember. Whether you plan events for a living or are organizing your holiday party from the side of your desk, we are a reliable partner in helping you achieve your vision.\nContact Us\nPlease enable JavaScript in your browser to complete this form.\nFirst Name\n*\nLast Name\nEmail\n*\nPhone\n*\nExt.\nBand(s) Interested In\nEvent Type\nEvent Venue\nEvent Date\nNumber of Guests\nWhere did you hear about us?\nMessage\n*\nThis site is protected by reCAPTCHA and the Google\nPrivacy Policy\nand\nTerms of Service\napply.\n.wpforms-field-container\nMessage\nSubmit\n.wpforms-container\nTROPICS ENTERTAINMENT\n\nAddress\n13186 NW 19th Street | Pembroke Pines, FL 33028\n​\n\nPhone\nP:\n305-531-3468\n\nEmail\nSteve Mittenthal or Dan Morris\ninfo@tropicsentertainment.com",
      "emails": [
        "info@tropicsentertainment.com"
      ]
    },
    {
      "url": "https://tropicsentertainment.com/about-us/",
      "is_candidate": false,
      "has_email": true,
      "text": "ABOUT US\nAt Tropics Entertainment we provide world-class entertainment for\nluxury events\n. We help our clients create the most memorable event of their lives by producing top-notch entertainment with attention to every detail.\nFounded in 1997, Tropics Entertainment is an entertainment production company specializing in live music for private events.  Although we book around 250 events per year, we are not a traditional booking agency.  We carefully select each musician and performer. Our bands are created from scratch with a specific focus on high-end weddings, corporate events, and social gatherings.\nA crucial difference in our bands is that in addition to playing special events, they perform in nightclubs from Miami to Palm Beach.  This makes our groups a bit more “edgy” – nightclub guests want to hear all the new hit songs.  All professional bands know the oldies, but these bands are required to stay very current.  With flawless transitions between songs, our bands think like a DJ and sound like the artist in concert!\nWhen it comes to designing your event, each of our bands have a coordinator who works in our office.  Our coordinator will guide you through the process of customizing the event: selecting music, submitting special requests, and planning the timeline.  One of our band coordinators will also be at the event to manage the musicians and assist with the timeline and formalities.\nOur winning formula of stellar service and seamless production has placed Tropics at the forefront of elite entertainment providers nationwide.  We take pride in providing the highest level of service while bringing non-stop energy to every party.\nPerfect For\nWeddings\nBirthdays\nSocial Gatherings\nCorporate Events\nGalas\nBook Now\nContact Us\nPlease enable JavaScript in your browser to complete this form.\nFirst Name\n*\nLast Name\nEmail\n*\nPhone\n*\nExt.\nBand(s) Interested In\nEvent Type\nEvent Venue\nEvent Date\nNumber of Guests\nWhere did you hear about us?\nMessage\n*\nThis site is protected by reCAPTCHA and the Google\nPrivacy Policy\nand\nTerms of Service\napply.\n.wpforms-field-container\nEmail\nSubmit\n.wpforms-container\nTROPICS ENTERTAINMENT\n\nAddress\n13186 NW 19th Street | Pembroke Pines, FL 33028\n​\n\nPhone\nP:\n305-531-3468\n\nEmail\nSteve Mittenthal or Dan Morris\ninfo@tropicsentertainment.com",
      "emails": [
        "info@tropicsentertainment.com"
      ]
    },
    {
      "url": "https://tropicsentertainment.com/booking-agents-for-bands-in-new-york/",
      "is_candidate": false,
      "has_email": false,
      "text": "Meet Our Amazing Team At Tropics Entertainment\nby\ntropicsentertainment\n|\nJul 20, 2020\n|\nbands for hire near me\nOriginally founded more than two decades ago in 1997, Tropics Entertainment is an entertainment production company specializing in live music for private events. Even though we book around 250 events every single year, we are not just a traditional booking agency- we carefully select each musician and performer, and our bands are formed from scratch with a specific focus on high-end weddings, corporate events, and social gatherings. Our bands are based in Florida but travel all around the world from New York to Colombia for performances. When you work with Tropics Entertainment, you know you’re only getting the best of the best in wedding and event entertainment, from the top-tier live talent to the seamless event production. What makes our work possible is the amazing team behind our firm, who consults with clients, coordinates every detail of the entertainment, and manages the bands. There’s no need to individually deal with booking agents for bands, try and find MCs, and figure out equipment yourself- just call\nTropics Entertainment\nand have your event entertainment set up today!\nLooking For Booking Agents For Bands? Meet Our Team\nEach of our bands have a coordinator who works in our office who will design your event. Our coordinators will guide you through the process of customizing the event to your specific needs- selecting music, submitting special requests, and planning the timeline. One of our band coordinators will also be at the event in order to manage the musicians and help with establishing the timeline and other formalities. Our patient and talented event coordinators include:\nNicole Velez- the organizer of Festivities and a “witty, aspiring world traveler”\nKelly-Christina Santi- supervisor of client happiness and self-proclaimed “Family-oriented dreamer and keychain collector”\nBambi Thomas- “kind and patient zen master”\nThe top-tier quality of our bands is all thanks to our booking agents, who are experienced event producers who have had many years of managing talent and putting on awesome live entertainment for events. Our experienced and fun booking agents include:\nFounder Steve Mittenthal- A Brooklyn-born sales guru who largely handles private events\nDan Morris- Event production expert, “music maestro and band mechanic, keeps the trains running on time”\nEric Mittenthal- Focuses mostly on public venues, “Superintendent of good times, Football junkie and creative writer.”\nOf course, nothing would get done without our accountant and scheduler Beverly Baumer, “number cruncher and scheduling wizard”!\nWe Combine Top Talent With Smooth Coordination\nThe winning formula of stellar service and seamless production is what has put Tropics Entertainment at the very forefront of elite entertainment providers all across the nation. Our dedicated and experienced team is proud to provide the highest level of service while bringing non-stop energy to every party that we’re a part of! From the best event bands to the best coordinators, you can expect nothing less than amazing from our talented team.\nContact Us Today\nOur fantastic team here at Tropics Entertainment is the core of what we are about- seamless production combined with fabulous talent. Based in Florida, our bands perform all over the world from New York to Puerto Rico. If you’re looking for booking agents for bands,\ncall\nTropics Entertainment\ntoday!",
      "emails": []
    }
  ],
  "all_links": [
    "https://tropicsentertainment.com/our-team/",
    "https://tropicsentertainment.com/live-bands/the-clique/",
    "https://tropicsentertainment.com/contact/",
    "https://tropicsentertainment.com/wedding-entertainment-in-new-york/",
    "https://tropicsentertainment.com/page/30/?et_blog",
    "https://tropicsentertainment.com/dj-hybrid/",
    "https://tropicsentertainment.com/ceremony-and-cocktails/",
    "https://tropicsentertainment.com/join-our-team/",
    "https://tropicsentertainment.com/page/3/?et_blog",
    "https://tropicsentertainment.com/wp-content/uploads/2019/08/03-Things-To-Keep-In-Mind-for-Wedding-Entertainment.jpg",
    "https://tropicsentertainment.com/page/2/?et_blog",
    "https://tropicsentertainment.com/live-bands/extasy/",
    "https://tropicsentertainment.com/dj-hybrid/euphoria/",
    "https://tropicsentertainment.com/djs/dj-devine/",
    "https://tropicsentertainment.com/djs/dj-kc/",
    "https://tropicsentertainment.com/author/tropicsentertainment/",
    "https://tropicsentertainment.com/djs/",
    "mailto:info@tropicsentertainment.com",
    "https://tropicsentertainment.com/event/",
    "https://tropicsentertainment.com/event/corporate-events/",
    "https://tropicsentertainment.com/live-bands/remix/",
    "https://tropicsentertainment.com/page/20/?et_blog",
    "https://tropicsentertainment.com/dj-hybrid/flavor-ft-dj-boss/",
    "https://tropicsentertainment.com/page/4/?et_blog",
    "https://tropicsentertainment.com/",
    "https://tropicsentertainment.com/live-bands/entourage/",
    "https://tropicsentertainment.com/djs/dj-jay-sample/",
    "https://tropicsentertainment.com/about-us/",
    "https://tropicsentertainment.com/event/social-gatherings/",
    "https://tropicsentertainment.com/dj-hybrid/euphoria-ft-dj-flex/",
    "https://tropicsentertainment.com/live-bands/higher-ground/",
    "https://tropicsentertainment.com/live-bands/cameo/",
    "https://tropicsentertainment.com/live-bands/vinyl/",
    "https://tropicsentertainment.com/page/10/?et_blog",
    "https://tropicsentertainment.com/page/31/?et_blog",
    "https://tropicsentertainment.com/what-is-wedding-insurance-in-florida/",
    "https://tropicsentertainment.com/reviews/",
    "https://tropicsentertainment.com/event/weddings/",
    "https://tropicsentertainment.com/blog/",
    "https://tropicsentertainment.com/djs/dj-flex/",
    "https://tropicsentertainment.com/live-bands/libido/",
    "https://tropicsentertainment.com/dj-hybrid/lovechild-ft-dj-sample/",
    "https://tropicsentertainment.com/faqs/",
    "https://tropicsentertainment.com/booking-agents-for-bands-in-new-york/",
    "https://tropicsentertainment.com/djs/dj-teddy-luv/",
    "https://tropicsentertainment.com/live-bands/",
    "https://tropicsentertainment.com/wp-content/uploads/2019/07/02_let_s_get_down_to_nvkR7.jpg",
    "https://tropicsentertainment.com/page/5/?et_blog"
  ],
  "candidate_links": [
    "https://tropicsentertainment.com/our-team/",
    "https://tropicsentertainment.com/contact/",
    "https://tropicsentertainment.com/join-our-team/",
    "https://tropicsentertainment.com/event/",
    "https://tropicsentertainment.com/event/corporate-events/",
    "https://tropicsentertainment.com/about-us/",
    "https://tropicsentertainment.com/booking-agents-for-bands-in-new-york/"
  ],
  "visited": [
    "http://www.tropicsentertainment.com/",
    "http://www.tropicsentertainment.com/about",
    "http://www.tropicsentertainment.com/contact",
    "http://www.tropicsentertainment.com/staff",
    "http://www.tropicsentertainment.com/team",
    "http://www.tropicsentertainment.com/board",
    "http://www.tropicsentertainment.com/directory",
    "http://www.tropicsentertainment.com/events",
    "http://www.tropicsentertainment.com/sitemap.xml",
    "https://tropicsentertainment.com/our-team/",
    "https://tropicsentertainment.com/contact/",
    "https://tropicsentertainment.com/join-our-team/",
    "https://tropicsentertainment.com/event/",
    "https://tropicsentertainment.com/event/corporate-events/",
    "https://tropicsentertainment.com/about-us/",
    "https://tropicsentertainment.com/booking-agents-for-bands-in-new-york/"
  ],
  "base_url": "http://www.tropicsentertainment.com/"
}