{
  "pages": [
    {
      "url": "https://tropicalbreezefunpark.com/contact-us/",
      "is_candidate": false,
      "has_email": true,
      "text": "Get in Touch with Tropical Breeze Fun Park\nWe’re here to make your visit unforgettable!\nContact Tropical Breeze Fun Park for Mini-Golf, GellyBall, and More in Cape Coral\nHave a question, need assistance, or want to plan your next adventure at Tropical Breeze Fun Park? We’re just a call, email, or visit away! Use the contact details below or fill out the form to reach us.\n\nPhone\n239-574-3939\n\nEmail\ninfo@tropicalbreezefunpark.com\n\nAddress\n234 Santa Barbara Blvd,\nCape Coral, FL 33991\n}\nHours\nMini-Golf:\nSunday – Saturday:  10 AM – 10PM\nGellyBall:\nFriday- Sunday :  4 PM – 10PM (Open Play)\n*For other time slots, please call to make a reservation.\nHave a question or need more information?\nFill out the form below, and we’ll get back to you as soon as possible!\nFill out my\nonline form\n.\nFill out my Wufoo form!\nWe’re Excited to Hear from You!\nHave questions about mini-golf, GellyBall, or planning your next big event? Reach out today to plan your visit or ask us anything! Whether it’s a group outing, a birthday celebration, or just a fun-filled day, our team is here to help you create unforgettable memories.\nLooking for quick answers? Visit our\nFAQs page\nto find details about our activities, policies, and more!",
      "emails": [
        "%20info@tropicalbreezefunpark.com",
        "info@tropicalbreezefunpark.com"
      ]
    },
    {
      "url": "https://tropicalbreezefunpark.com/join-our-team/",
      "is_candidate": false,
      "has_email": true,
      "text": "Join the Tropical Breeze Fun Park Team!\nBe part of a fun and fast-growing company!\nAre You Ready to Work in a Dynamic, Exciting Environment?\nTropical Breeze Fun Park is looking for enthusiastic and dedicated individuals to join our team. Whether you’re helping guests on the mini-golf course, assisting with GellyBall adventures, or providing top-notch customer service, you’ll be part of a team that’s all about creating unforgettable experiences for our visitors.\nQualifications:\nMust be\n18 years or older\n(we sell beer and wine).\nAvailability to work\n9:30 AM – 4:00 PM\nand/or\n4:00 PM – 10:00 PM\nshifts.\nFlexible schedule with some weekends off.\nComplete our employment application to be considered for one of our facility positions.\nIf you meet the qualifications, we’ll reach out to you!\nFill out my\nonline form\n.\nFill out my Wufoo form!",
      "emails": [
        "%20info@tropicalbreezefunpark.com",
        "info@tropicalbreezefunpark.com"
      ]
    },
    {
      "url": "https://tropicalbreezefunpark.com/group-events/",
      "is_candidate": false,
      "has_email": true,
      "text": "The Best Group Event Venue in Cape Coral\nHost unforgettable events with activities that inspire fun, teamwork, and celebration.\nWhy Choose Tropical Breeze for Your Group Event?\nAt Tropical Breeze Fun Park, we specialize in creating unforgettable group events tailored to your needs. From corporate team-building to family reunions, we provide the perfect setting for fun, bonding, and lasting memories.\nHere’s Why Groups Love Us:\nCustomizable Packages:\nDesigned to fit your group’s size, budget, and goals.\nExciting Activities:\nMini-golf and GellyBall foster teamwork and friendly competition.\nBeautiful Setting:\nA tropical-themed venue in the heart of Cape Coral.\nHassle-Free Planning:\nOur team takes care of the details so you can enjoy the day.\nZ\nCorporate Team-Building Events\nElevate Your Team with Fun and Friendly Competition\nLooking to boost morale and teamwork? Our corporate event options are designed to build stronger connections within your team. Perfect for management retreats, employee recognition days, and team-building activities.\nGellyBall Missions:\nCompete on our field with custom missions to see which team comes out on top.\nMini-Golf:\nEncourage collaboration and bonding with our tropical-themed course.\nZ\nCelebrations for Every Occasion\nWhether you’re celebrating milestones or simply looking for a great day out, we’re here to make your event special.\nWe’re Perfect For:\nFamily reunions\nSports team banquets\nBar/Bat Mitzvahs\nGraduation parties\nAfter-prom celebrations\nTeacher appreciation events\nNo matter the occasion, our event experts will customize a package to meet your needs.\nZ\nSchool Outings and Fundraising\nReward, Educate, and Raise Funds—all in One Place!\nBring the classroom to life with entertaining and educational activities at Tropical Breeze.\nSchool Field Trips:\nCombine fun and learning with engaging activities that explore Newton’s Laws of Motion and teamwork.\nTeacher Appreciation:\nCelebrate your school’s educators with a day of relaxation and fun.\nFundraising Events:\nPartner with us to create exciting fundraising opportunities for your school or non-profit organization.\nDOWNLOAD DONATION REQUEST FORM\nWe review donation requests monthly, so submit yours in advance to secure support for your event.\nZ\nSummer Camp and Seasonal Events\nCalling All Campers and Counselors!\nFrom shooting range challenges to conquering the world’s longest mini-golf hole, we provide the perfect backdrop for summer camp fun.\nTailored Camp Packages:\nCreate lasting memories with activities designed for campers of all ages.\nSafe and Fun After-Prom Parties:\nCelebrate in a secure environment with exciting activities.\nGraduation Lock-Ins:\nKeep the whole class entertained all night long.\nZ\nFilm Location Rentals\nWhether you’re filming a commercial, creating content for social media, or shooting a feature film, our park’s unique features will elevate your production and make it truly memorable.\nEye-catching tropical scenery perfect for a variety of genres.\nDistinct attractions like the world’s longest mini-golf hole and GellyBall fields.\nFlexible scheduling to accommodate your project needs.\nContact Tropical Breeze:\ninfo@tropicalbreezefunpark.com\n239-574-3939\nImportant Event Information\nNon-Refundable Deposit:\nA $75.00 deposit is required for all events.\nRain Policy:\nIn case of threatening rain, Tropical Breeze may cancel the event in consultation with the event coordinator. Deposits can be refunded or applied to a new date.\nCancellation Policy:\nDeposits can be applied to a new date if cancellations are made at least 7 days in advance.\nCONTACT US TO BOOK TODAY\nBook Your Group Event at Cape Coral’s Favorite Fun Park!\nLooking for the ultimate venue for your next group event? Whether it’s a corporate retreat, family reunion, school outing, or celebration with friends, Tropical Breeze Fun Park offers customized packages, exciting activities like mini-golf and GellyBall, and a stress-free planning experience.\nContact Us Today to Make Your Event Unforgettable:\nLearn more about our flexible packages tailored to your needs.\nCheck availability for your preferred date.\nGet expert help planning every detail of your event.\nCONTACT US",
      "emails": [
        "%20info@tropicalbreezefunpark.com",
        "info@tropicalbreezefunpark.com"
      ]
    },
    {
      "url": "https://tropicalbreezefunpark.com/about-us/",
      "is_candidate": false,
      "has_email": true,
      "text": "About Tropical Breeze Fun Park: Where Fun Meets Adventure in Cape Coral\nCreating unforgettable experiences for families, friends, and groups.\nCreating Memories That Last a Lifetime in Cape Coral\nAt\nTropical Breeze Fun Park\n, we’re dedicated to bringing people together for unforgettable adventures. Located in beautiful Cape Coral, our park offers something for everyone—whether you’re looking for thrilling activities, a place to celebrate, or a relaxing day of fun.\nWe believe in creating memories that last a lifetime.\nHere’s why Tropical Breeze Fun Park is Cape Coral’s favorite destination:\nZ\nMini-Golf Like No Other\nEnjoy 18 challenging holes on our tropical-themed course, featuring cascading waterfalls and the world’s longest mini-golf hole.\nZ\nAdrenaline-Pumping GellyBall\nDive into action-packed GellyBall battles. Perfect for all ages!\nZ\nPerfect for Events\nFrom birthdays to corporate gatherings, we make planning easy with customizable packages and dedicated party hosts.\nZ\nConvenient Location\nJust minutes from Fort Myers, with free parking and a safe, family-friendly atmosphere.\nCHECK OUR PRICES\nWhat Our Guests Have To Say\nJennifer Rodin\nDesignation\nBest mini golf ever! The water features and the little signs and of course the drinks, the other customers, and the workers were just amazing! The music was really great too. We had so much fun. We'll definitely be back again!\nColeen Wybranski\nDesignation\nWe chose this as an alternative to Topgolf, and are so glad that we did — it was a miles better alternative for our young family. The staff was super sweet and attentive, and nowhere else will you find such a prompt on-course delivery service! The next time we’re in Florida we’re definitely going to make this a destination.\nTiffany Rollman\nDesignation\nThis was hands down the best maintained course my kids and I have ever been on. The kids loved the different challenges on each hole and the electronic score card was an awesome addition. It is clear that the staff care about the upkeep, because the course is in pristine condition and they do a stunning job with the landscaping. We definitely plan to come back when we travel here again next year!\nMike Humphreys\nDesignation\nHad a lot of fun, very nice place with fun Putt-Putt holes. Prices weren't too bad and they also serve alcohol (wine slushies/beer) It's a very well maintained park with some challenging holes, including the \"world's longest putt-putt hole\" which is the 18th hole. We had a nice time, the employees were very nice and we all just had a fun time. I would definitely recommend to anyone that hasn't been here yet, it's a good time!\n4\n5\nMake Every Visit More Rewarding!\nTurn your fun into rewards with the Tropical Breeze Loyalty Program! It’s free to join and packed with perks designed to make your visits even more exciting. From earning points on every purchase to receiving special birthday bonuses, this is the ultimate way to get more out of your time at the park.\nDon’t miss out on:\nExclusive rewards and cash back on purchases.\nSpecial offers just for members.\nFun bonuses throughout the year!\nJOIN OUR LOYALTY PROGRAM\nPlan Your Visit Today!\nWhether you’re stopping by for mini-golf, GellyBall, or a special event, Tropical Breeze Fun Park is ready to make your day extraordinary.\nQuestions? Contact Us",
      "emails": [
        "%20info@tropicalbreezefunpark.com",
        "info@tropicalbreezefunpark.com"
      ]
    }
  ],
  "all_links": [
    "https://tropicalbreezefunpark.com/contact-us/",
    "https://tropicalbreezefunpark.com/join-our-team/",
    "https://tropicalbreezefunpark.com/food-drinks/",
    "https://tropicalbreezefunpark.com/birthday-parties/",
    "mailto:%20info@tropicalbreezefunpark.com",
    "https://tropicalbreezefunpark.com/wp-content/uploads/2024/12/gelly-2.jpg",
    "https://tropicalbreezefunpark.com/faqs/",
    "https://tropicalbreezefunpark.com/free-loyalty-program/",
    "https://tropicalbreezefunpark.com/gellyball/",
    "https://tropicalbreezefunpark.com/member-login/",
    "https://tropicalbreezefunpark.com/photo-gallery/",
    "https://tropicalbreezefunpark.com/",
    "mailto:info@tropicalbreezefunpark.com",
    "https://tropicalbreezefunpark.com/pricing/",
    "https://tropicalbreezefunpark.com/rewards-signup/",
    "https://tropicalbreezefunpark.com/group-events/",
    "https://tropicalbreezefunpark.com/wp-content/uploads/2025/04/Donation-Request-Form-Tropical-Breeze-04-29-25.pdf",
    "https://tropicalbreezefunpark.com/mini-golf/",
    "https://tropicalbreezefunpark.com/about-us/",
    "https://tropicalbreezefunpark.com/wp-content/uploads/2024/12/485_TropicalBreezeFunParki_1200x1800.jpg"
  ],
  "candidate_links": [
    "https://tropicalbreezefunpark.com/contact-us/",
    "https://tropicalbreezefunpark.com/join-our-team/",
    "https://tropicalbreezefunpark.com/group-events/",
    "https://tropicalbreezefunpark.com/about-us/"
  ],
  "visited": [
    "http://www.tropicalbreezefunpark.com/",
    "http://www.tropicalbreezefunpark.com/about",
    "http://www.tropicalbreezefunpark.com/contact",
    "http://www.tropicalbreezefunpark.com/staff",
    "http://www.tropicalbreezefunpark.com/team",
    "http://www.tropicalbreezefunpark.com/board",
    "http://www.tropicalbreezefunpark.com/directory",
    "http://www.tropicalbreezefunpark.com/events",
    "http://www.tropicalbreezefunpark.com/sitemap.xml",
    "http://www.tropicalbreezefunpark.com/council",
    "http://www.tropicalbreezefunpark.com/leadership",
    "http://www.tropicalbreezefunpark.com/management",
    "http://www.tropicalbreezefunpark.com/producers",
    "http://www.tropicalbreezefunpark.com/support",
    "http://www.tropicalbreezefunpark.com/crew",
    "http://www.tropicalbreezefunpark.com/members",
    "http://www.tropicalbreezefunpark.com/bios",
    "http://www.tropicalbreezefunpark.com/people",
    "http://www.tropicalbreezefunpark.com/artists",
    "http://www.tropicalbreezefunpark.com/musicians",
    "http://www.tropicalbreezefunpark.com/faculty",
    "http://www.tropicalbreezefunpark.com/administration",
    "https://tropicalbreezefunpark.com/contact-us/",
    "https://tropicalbreezefunpark.com/join-our-team/",
    "https://tropicalbreezefunpark.com/group-events/",
    "https://tropicalbreezefunpark.com/about-us/"
  ],
  "base_url": "http://www.tropicalbreezefunpark.com/"
}