{
  "pages": [
    {
      "url": "http://tskw.org/staff-and-board/",
      "is_candidate": false,
      "has_email": true,
      "text": "The Studios brings world-class artists to Key West and promotes local artists. Offering art classes, concerts, theater, sunset happy hours, and galleries.",
      "emails": [
        "disrudjoris5@gmail.com",
        "hobbsart@bellsouth.net",
        "info@coccoandsalem.com",
        "info@tskw.org",
        "mpuppich@yahoo.com",
        "scottyking@sbcglobal.net",
        "wlancetaylor@gmail.com",
        "woodshop@tskw.org"
      ]
    },
    {
      "url": "https://tskw.org/book-a-private-event/",
      "is_candidate": false,
      "has_email": true,
      "text": "The Studios brings world-class artists to Key West and promotes local artists. Offering art classes, concerts, theater, sunset happy hours, and galleries.",
      "emails": [
        "disrudjoris5@gmail.com",
        "hobbsart@bellsouth.net",
        "info@coccoandsalem.com",
        "info@tskw.org",
        "mpuppich@yahoo.com",
        "scottyking@sbcglobal.net",
        "wlancetaylor@gmail.com",
        "woodshop@tskw.org"
      ]
    },
    {
      "url": "http://tskw.org/?page_id=26267",
      "is_candidate": false,
      "has_email": true,
      "text": "The Studios brings world class artists to Key West and promotes local artists. Offering art classes, concerts, theater, sunset happy hours, and galleries.",
      "emails": [
        "disrudjoris5@gmail.com",
        "hobbsart@bellsouth.net",
        "info@coccoandsalem.com",
        "info@tskw.org",
        "mpuppich@yahoo.com",
        "scottyking@sbcglobal.net",
        "wlancetaylor@gmail.com",
        "woodshop@tskw.org"
      ]
    },
    {
      "url": "https://tskw.org/current-studio-artists/",
      "is_candidate": false,
      "has_email": true,
      "text": "Our Studio Artists have created a community that extends over the island. With painters, writers, musicians, sculptors and photographers crossing paths on a daily basis, strong connections are constantly being made and reinforced. The artists benefit from a continual exchange of creative energy, while the public benefits from the opportunity to visit 7 artists at our venue alone.",
      "emails": [
        "disrudjoris5@gmail.com",
        "hobbsart@bellsouth.net",
        "info@coccoandsalem.com",
        "info@tskw.org",
        "mpuppich@yahoo.com",
        "scottyking@sbcglobal.net",
        "wlancetaylor@gmail.com",
        "woodshop@tskw.org"
      ]
    },
    {
      "url": "https://tskw.org/events/",
      "is_candidate": false,
      "has_email": true,
      "text": "News\nCalendar\nLogin\nUberMenu [Configuration:main] [Theme Loc:primary-menu] [Integration:auto]\nVisit\nHours, Admission and Location\nDirections, Transportation & Parking\nOur Campus\nCurrent Studio Artists\nBook a Private Event\nclose menu\nBooks & Books\nExhibitions\nEvents\nClasses\nArtist Residencies\nSupport\nBecome a Member, Donor or Patron\nOur Business Sponsors\nOur Patrons\nVolunteer\nclose menu\nCalendar\nNews\nEnd UberMenu\nVISIT\nEXHIBITIONS\nEVENTS\nHOURS, ADMISSION AND LOCATION\nMuseum & Box Office Hours\nTuesday-Sunday, 10am-4pm (Dec-May)\nTuesday-Saturday, 10am-4pm (Jun-Nov)\nVisitors can find us, tour our galleries and studios, and visit the rooftop at 533 Eaton Street.\nAdmission\nAdmission to our galleries and campus is always free of charge.\nAs a non-profit, community organization, we offer discounted fees for classes, performances and events to members of The Studios. If you are interested in the benefits of membership\nlearn more here\n!\nPRIVATE RENTAL INQUIRIES\nFrom rooftop parties to business gatherings, The Studios offers a host of unique spaces to make your event one for the ages!\nLearn more here.\nEvents\nAll\nConcerts\nExhibitions\nScreenings\nSpecial Events\nAll\nConcerts\nExhibitions\nScreenings\nSpecial Events\nTUESDAYS, 6-8PM\n2025 | HAPPY HOUR\nGlow Hours on Hugh’s View\nOur Hugh’s View roof terrace offers the best views in town, and an ideal spot to catch the sunset and a drink with friends. The bar is open, admission is free, and everyone looks great in the golden twilight.\nSTOP IN THRU SEP 20\n2025 | SUMMER IN THE SANGER\nSummer in the Sanger: Samuel Alvarez\nThis summer, the Sanger Gallery transforms into a working studio and showcase for local painter Samuel Alvarez. Explore more than 40 of his vibrant works—from expressive portraits to luminous Florida Keys landscapes—and, if you’re lucky, catch him painting right in the gallery.\nTHU OCT 2, 6-8PM\n2025 | OPENING\nOctober First Thursday\nJoin us for First Thursday Open House: art, wine on the rooftop, new exhibits, and open studios. Connect, explore, and celebrate creativity with friends old and new!\nTUE OCT 21, 5-7PM\n2025 | EVENT\nTutu Tuesday Glow Hours\nBefore you head off to the 15th Annual Tutu Tuesday Party, stop at The Studios to toast the sunset. Come up as your favorite bedtime story or magical monster…in a TUTU of course!\nTHU NOV 6, 6-8PM\n2025 | OPENING\nNovember First Thursday\nJoin us for First Thursday Open House: art, wine on the rooftop, new exhibits, and open studios. Connect, explore, and celebrate creativity with friends old and new!\nSUN NOV 9, 5PM\n2025 | EVENT\nSouthernmost Youth Orchestra\nFrom classical favorites to contemporary selections, this concert showcases the young rising stars of our southernmost community.\nMON-FRI NOV 10-14\n2025 | TRIP\nHavana Art Tour\nFor over a decade, The Studios has led pioneering cultural exchanges with Cuba, building friendships with many of its most significant artists and cultural figures. Reap the benefits of those relationships with a whirlwind tour of Havana’s arts scene.\nSUN NOV 16, 7PM\n2025 | EVENT\nThe Life & Art of Eric Anfinson\nSee a work-in-progress preview screening of “The Life & Art of Eric Anfinson,” a moving portrait of the artist, plus a special performance by Kyla Piscopink, filmmaker Q&A, and closing reception on Hugh’s View of the 2025 Key West Film Festival.\nSAT NOV 29, 10AM-2PM\n2025 | EVENT\nHoliday Makers Market\nSupport your local arts community on Small Business Saturday by starting your holiday shopping in a fun and festive indoor market. With a full building of artists and artisans showcasing their work, there will be something for every person on your list.\nFRI DEC 12, 5:30PM\n2025 | EVENT\nDecember Duo Holiday Concert\nIrie Monte will be joined by Crispin Campbell on cello for an evening of beautiful string music on the rooftop. Let the music get you into the holiday spirit!\nVIEW PAST EVENTS\nGet to know The Studios of Key West\nOur mission is to support artists, inspire creativity and build community.\nA deeper look:\nAbout\nStaff & Board\nAwards for Excellence in the Arts\nGet a visual:\nOur Photos\nOur Video Story\nFollow us on:\nFacebook\nInstagram\nTikTok\nYouTube\nVimeo\nMuseum Store Instagram\nFine print:\nPolicies/FAQs\nPrivacy Policy and Terms\nOverview\nOur Campus\nHours and Location\nContact\n2025 Catalog\nResources\nMember Portal Login\nSubmit a Proposal\nJob Opportunities\nPrograms for Kids and Teens\nVisit\n533 Eaton Street\nKey West, FL 33040\ninfo@tskw.org\n305-296-0458\nFree and open to the public.\nOpen Wed-Sat, 10am-4pm\nNewsletter\nJoin Our Newsletter\nSIGN UP\nIf you are human, leave this field blank.\nGet to know The Studios of Key West\nOur mission is to support artists, inspire creativity and build community.\nA deeper look:\nAbout\nStaff & Board\nAwards for Excellence in the Arts\nFollow us on:\nFacebook\nInstagram\nTikTok\nYouTube\nVimeo\nMuseum Store Instagram\nFine print:\nPolicies/FAQs\nPrivacy Policy and Terms\nOverview\nOur Campus\nHours and Location\nContact\nResources\nMember Portal Login\nSubmit a Proposal\nJob Opportunities\nPrograms for Kids and Teens\n2025 Catalog\nVisit\n533 Eaton Street, Key West, FL 33040\ninfo@tskw.org  |  305-296-0458\nFree and open to the public.\nOpen Wednesday-Saturday, 10am-4pm\nKey West Web Design\nScott King\nScott King is a Golden Globe and Writers Guild Award nominated writer, producer, and director with a long-running career in television. He currently serves as the showrunner for\nOvercompensating\n, an original series on Prime Video. His writing and producing credits span comedy and satire, including standout work on\nMad TV\n,\nHarlem\n, and\nDifficult People\n.\nNow splitting his time between the screen and the island, Scott brings his creative energy to The Studios of Key West, where he’s developing new work and reconnecting with storytelling in all its forms. Whether writing for television, film, essays or live performance, Scott’s work blends humor with human insight—always with a touch of the unexpected.\nGet in touch\n→\nX\nLance Taylor\nLance Taylor is a Key West-based singer-songwriter, performer, and audio engineer whose music blends folk, Americana, and country blues with a gritty, heartfelt edge. Since arriving in Key West in 2001, he’s gone from street performances to stages across the island, including long-standing gigs at Blue Heaven, The Green Parrot, Celtic Conch, and Dive Bar T-Shirt Club. From 2004 to 2010, Lance fronted his own band, performing original songs and building a devoted local following. By 2012, he had become a full-time musician, splitting his time between performing and producing for fellow artists.\nLance records and produces music out of his studio at The Studios of Key West, where he crafts original material and collaborates with a wide circle of musicians. His 2017 album\nGhost on the Highway\nwas born out of a cross-country road trip, and more recent singles—like “My Oh My” and “Man on Wire”—highlight his skills as a producer and multi-instrumentalist. Whether on stage or in the studio, Lance brings a raw, road-worn spirit to everything he creates.\nGet in touch →\nX\nJim Salem\nJim Salem is an internationally recognized painter whose luminous landscapes reflect a lifelong connection to the natural world. Splitting his time between his native Pennsylvania and the Florida Keys—where he has lived since 1993—Jim draws inspiration from coastal light, lush vegetation, and the quiet beauty of wild spaces. He studied painting at Pennsylvania State University and the Slade School of Fine Art in London, and his work continues to evolve with a deep reverence for place and atmosphere.\nOver the course of his career, Jim has been featured in more than 35 solo exhibitions and dozens of juried and invitational shows. His paintings are held in private and corporate collections around the world, including Disney, Hilton Hotels, and PPG, and he is represented by galleries across Florida, Indiana, Alabama, and Pennsylvania. In addition to his studio practice, Jim is a longtime supporter of the arts in Key West, having served on the boards of both the Key West Museum of Art & History and the Anne McKee Artists Fund.\nGet in touch\n→\nX\nMatthew Puppich\nMatthew Puppich is a painter whose abstract work explores the vibrant rhythms of island life—often featuring expressive interpretations of chickens, roosters, and the everyday sights that make Key West unique. With a bold use of color and playful composition, his paintings offer a whimsical yet thoughtful lens on the world around him. His debut solo exhibition,\nLife in Key West: An Abstract Perspective\n, was presented at Truman Art Space in 2021.\nA graduate of the 39th class of the Key West Ambassadors Academy, Matthew is deeply connected to the local community and creative scene. He continues to grow his practice as a resident artist at The Studios of Key West, where he draws inspiration from the tropical landscape, the island’s character, and the spontaneous spirit of its people.\nGet in touch\n→\nX\nLucy Paige\nLucy Paige is a Key West-based abstract painter whose playful, layered compositions are inspired by the island’s colors, textures, and rhythms. Using acrylic, oil stick, patterned collage, and pen, she captures the feeling of a day at the beach in blocks of color, patches of light, and meandering lines. Her distinctive mixed-media works celebrate the looseness and joy of island life, transforming everyday scenes into vibrant visual poems.\nA resident studio artist at The Studios of Key West since 2017, Lucy has exhibited widely in solo and group shows throughout the island. Her work is also represented in public collections, including commissions for Bernstein Park and Seven Fish Restaurant. She is a two-time recipient of the Anne McKee Artist Grant and has participated in numerous workshops and residencies to further her exploration of abstraction. Lucy’s studio practice is deeply rooted in the local arts community, where she continues to create, exhibit, and mentor emerging artists.\nGet in touch\n→\nX\nMichael Marrero\nMichael Marrero is a Cuban-American artist, playwright, and filmmaker whose work blends visual storytelling, theatrical invention, and cultural commentary. His award-winning short films\nBuzzcut\nand\nRiley Was Here\nhave screened at over 100 festivals worldwide, and his original plays—including\nLocura\n,\nAlligator Alley\n, and\nRepair\n—have been staged in Havana, New York, and Key West. In 2020, he received a Knight Foundation grant for\nOrisha: The Lost Saints\n, a photography project exploring Afro-Caribbean spirituality, later exhibited at the Havana Biennial. Whether behind the camera or on stage, Michael’s work is rooted in myth, memory, and the spirit of the subtropics.\nIn addition to film and theater, Michael’s photography has appeared in solo exhibitions and campaigns for clients ranging from Reuters and the Smithsonian to the Florida Keys Tourism Council. His recent projects include the play\nKing Tide\n, the short film\nParty Time\n, and an ongoing exploration of tradition and identity through visual media. A longtime Key West resident, Michael maintains a studio at The Studios of Key West, where he continues to develop new work and collaborate across disciplines.\nGet in touch\n→\nX\nTom Joris\nTom Joris is a sculptor, painter, and longtime fixture in Key West’s creative community. A former professor at the Art Institute of Chicago, Tom has led lectures and sculpture demonstrations across the Chicago metropolitan area, with his teaching even featured on NBC. His work spans fine art and functional design, and his thoughtful approach to materials and form reflects decades of hands-on experience and a deep belief in the power of the handmade.\nIn 1992, Tom and his wife, painter Carrie Disrud, co-founded\nKalypso Gallery\n—an energetic art space showcasing their own work alongside pieces by family members and artists from across North America. Now working alongside their son, Rennie, they continue their collaborative art practice both locally and online. Tom’s studio is nestled inside The Studios of Key West, where he continues to create and inspire in a space that, like him, balances tradition with creative freedom.\nGet in touch\n→\nX\nPam Hobbs\nPam Hobbs\nis a painter known for her vibrant color palette and joyful depictions of island life. Originally from New Jersey, she earned her B.F.A. from the Kansas City Art Institute, where she studied fiber arts and surface design. After a vacation to Key West more than 40 years ago, Pam never looked back. Inspired by the island’s lush tropical beauty—its vivid flowers, sweeping skies, and crystalline water—she shifted from fiber to painting and began developing her bold, expressive style.\nPam’s work can be found in galleries across Florida, including Art on Duval (Key West), Art on Fifth Avenue (Naples), and Art on St. Armand’s Circle (Sarasota). She maintains a working studio on the third floor of The Studios of Key West at 533 Eaton Street, where she welcomes visitors by appointment. Pam’s goal is simple: to create work that reflects the freedom, boldness, and happiness of island living.\nGet in touch\n→\nX\nmark hedden\nMark Hedden\nis a writer, photographer, and longtime Key West local whose career has spanned everything from eco-tourism and comedy to newspaper columns and birdwatching. A resident artist at The Studios of Key West since its founding in 2007, Mark originally joined as a writer but found himself drawn into the visual arts through the influence of the creative community around him. His photographic work has been widely exhibited, with major solo shows including\nVelo City\n, exploring Key West’s bike culture;\nNocturnal\n, a series of nightscapes capturing the island’s vernacular architecture; and\nOn the Hook\n, a portrait series of Key West’s liveaboard boaters. His projects have received support from the Knight Foundation, the Anne McKee Foundation, the South Florida Cultural Consortium, and the Florida Keys Council of the Arts.\nMark’s images and writing have appeared in\nThe New York Times\n,\nThe Guardian\n, CNN,\nPeople\n,\nRoads & Kingdoms\n, and many local outlets. He is a regular contributor to the\nKey West Weekly\n, where his “Wild Things” column chronicles the islands’ birds and wildlife. His most recent work,\nSouth of Southernmost\n, captures the remote and storied Ballast Key, while an ongoing project,\nFlorida P&L Statement\n, documents Florida’s abandoned roadside businesses. Mark has also taught photography and writing at The Studios of Key West and the NSU Art Museum, and he was recently featured in a joint exhibition at JAG Gallery with photographer Lynn Bentley Kemp. (And yes, he was once mysteriously described as a bullfighter on a podcast.)\nGet in touch\n→\nX\nSandra is an interdisciplinary artist who works across a broad range of practices, including cut paper, painting, murals, community art, and social practice. Her work has been exhibited at SOFA New York, Ann Nathan Gallery in Chicago, the Museum of Contemporary Art in St. Louis, Missouri, The Studios of Key West in Key West, Florida, and National Amazon University in Puerto Maldonado, Peru. Her work is included in the Howard Tullman Collection, The Museum of Contemporary Craft in Portland, Oregon, Seattle Tacoma International Airport, and several private collections. She was awarded artist residencies at The Studios of Key West, Florida; Rogers Art Loft in Las Vegas, Nevada; Arquetopia, Puebla, Mexico; the Contemporary Crafts Museum in Portland, Oregon; and with the Amazon Conservation Association in Madre de Dios, Peru. Recognition for her work includes a Mayor’s Art Award, thirteen Parents Association Awards for Contributions to Students, a Hixson Lied Award for Senior Faculty Achievement in Research and Creative Activity, a Hixson-Lied Curriculum Development Award, and two Hixson-Lied Awards for Outreach, Engagement, and Service. She is a CoPI on the transdisciplinary Grand Challenge grant RISE With Insects. Sandra is the Visual Arts Chair for the Southwest Popular/American Culture Association.\nHer most recent work contains variations on the theme of ecotone, the area where two communities meet and integrate. Traditionally, the term refers to ecological communities, such as the zone where the plains and desert meet the rainforest and the biodiversity that occurs there. Yet it can also refer to the zone where “nature” and “culture” intersect—where the city meets the preexisting natural environment and the tension resulting from this intersection. It may also refer to a metaphorical overlapping of narrative and place.\nAdditional work includes social practice projects emphasizing creative facilitation, community needs, and restorative justice.\nX\nSara Fruner is a bilingual poet and novelist born in Riva del Garda, Trentino, North-Eastern Italy. She graduated in English literature and language from Ca’ Foscari University in Venice and earned two MPhils in literary translation. Her translations include works by Dionne Brand, Monique Truong, Sello Duiker, Raj Rao, Don McKay, and others. She has worked as a translator in the publishing industry and served at the Italian Cultural Institute of Los Angeles in 2007. Sara later worked as a Senior Publication Coordinator in Trento and taught English as a foreign language at Istituto Accademico Interpreti e Traduttori di Trento and the University of Trento.\nIn 2016, she moved to New York City, where she currently teaches Italian at New York University and the Fashion Institute of Technology. She contributes to bilingual newsmagazine\nLa Voce di New York\nand collaborates with the Center for Italian Modern Art and Magazzino Italian Art. Her poetry has appeared in journals like\nGraphie\nand\nItalian Poetry\n, and her books include\nBitter Bites from Sugar Hills\n(2018),\nLucciole in palmo alla notte\n(2019), and\nLa rossa goletta\n(2024). Sara’s debut novel\nL’istante largo\n(2020) was shortlisted for the Severino Cesari National Award for Debut Novel, and she released\nLa notte del bene\nin 2022. Her upcoming novel will be released in May 2025. Sara has participated in numerous residency programs worldwide, including The Studios of Key West and The Bogliasco Foundation.\nX\nTipper Newton is an actor, filmmaker, and musician living in Los Angeles. Her recent short film,\nWild Card\n, played festivals worldwide and received a Special Jury Award for Best Midnight Short at Palm Springs ShortFest. Her short film\nThe Dangerous Type\ntook home the 2021 “Best Shorts With Legs” prize at Fantastic Fest and premiered online as a Vimeo staff pick. As an actor, Tipper has had recurring roles on\nThe Mindy Project\nand\nThe Guest Book\n. When she’s not busy working in film and television you can find her being the frontwoman for her powerpop band Color TV.\nhttps://vimeo.com/tippernewton\nX\nRick Worth is a force of nature—talented, generous, and endlessly inventive. Since arriving in Key West in 1986 with just $18 in his pocket, he’s transformed the island into his canvas. From painting clunkers into joyful “moving murals” to leading community art projects, Rick brings creativity and color to everything he touches.\nHe’s exhibited at Lucky Street, JAG, and Harrison Gallery, and even opened his own space, Three-Legged Dog Gallery, named for his spirited pup, Kiddo. Beyond the canvas, Rick has supported countless local initiatives, from teaching with MARC House to leading community murals with over 100 kids. Whether he’s leading painting bootcamp, building floats, or belting karaoke at Bobby’s, Rick infuses Key West with joy. His work reminds us that art isn’t just something to admire—it’s something to live, share, and celebrate. Rick has painted more than walls; he’s helped color the spirit of this island.\n(photo by Johnny White)\nWatch a video about Rick here.\nX\nDr. MaryLouise Patterson is a retired general pediatrician living in NYC. She is also a mother of 3 and a grandmother of 4.\nHer parents, Louise and William Patterson, were Leftist civil rights activists their entire lives. They represented the best in the Black Radical tradition. They instilled in her a profound love and pride of Black people and to the need to uphold their culture, history and noble struggle for freedom and unbridled inclusion.\nShe received her medical degree from Patrice Lumumba Friendship University in Moscow, USSR and a Masters, Public Health at the University of California, Berkeley.\nShe is the co-author of “\nLetters from Langston: From the Red Scare to the Harlem Renaissance and Beyond\n”. UC Press 2016.\nShe loves jazz, plays, art exhibits, dancing – despite not getting enough of it anymore, socializing and cooking for friends and family, discussing politics, reading, traveling plus just living.\nShe is committed to and active in the push for universal health care-Medicare for All, to ending institutionalized racism in medicine, to increasing the number of Black, Latinx, Native American Indian and women health providers and to Peace with Justice everywhere.\nX\nDr. Royel M. Johnson is one of the nation’s leading voices on diversity, equity, and inclusion in higher education. A tenured professor in the Rossier School of Education at the University of Southern California, Johnson also serves as chair of the school’s PhD program. He is the Director of the National Assessment of Collegiate Campus Climates in the USC Race and Equity Center, which is the nation’s leading tool for assessing campus racial climate. Johnson is the author and editor of five books and over 60 academic papers and chapters. His recent books include\nThe Big Lie About Race in America’s Schools\n(Harvard Education Press) and\nFrom Foster Care to College: Navigating Educational Challenges and Creating Possibilities\n(Teachers College Press). Additionally, Johnson serves as Co-Editor of\nEducational Researcher\n, the flagship journal for the field of education. The\nLos Angeles Times\nrecently named Dr. Johnson a DEIA Visionary, recognizing his efforts to propel positive change across the country.\nX\nDr. Sonia Mae Brown is currently an Associate Professor of Language and Letters and the Chair of the Division of Arts and Humanities at Philander Smith University. Dr. Brown received her doctoral degree in English from Howard University and she also possesses a Masters in English with a focus in Creative and Professional Writing from Long Island University. Her areas of research are gender and sexuality, black female sexuality, and sex as a discursive act or practice.\nAs a self-proclaimed “Eroticist” or “Literary Sexual Anthropologist, Dr. Brown is dedicated to enriching the current scholarship on The Erotic and exploring the potential for eroticism to be seen as a critical lens of textual inquiry. According to Dr. Brown, “reading is an erotic pursuit, and those who engage in the process of reading are engaging in an intimate activity.” Dr. Brown is passionate about bringing discussions of the erotic into the academy and into the classroom. She is currently working on a monograph about sadomasochism in James Baldwin’s literature.\nX\nChristine Fifer’s boundless energy and optimism mobilized a core group of volunteers to clear homes and properties in the Lower Keys of debris from Hurricane Irma. Working through grueling heat and dangerous conditions, they brought hope to many and directed their energies particularly to getting fellow artists back on their feet. Christine is a painter, costume artist, and former Studio Artist at The Studios of Key West. She has most recently exhibited in the Sanger Gallery in January 2021.\nX\nGary Teplitsky and Olga Manosalvas are the owners of Baby’s Coffee on Big Pine Key. Despite significant damage to their own business, they opened their doors shortly after Hurricane Irma and made their entire inventory free to all. Baby’s quickly became a lifeline and a rallying point for residents – a vital distribution point for supplies, hot meals and other services donated from all over the Keys and beyond. Olga is an accomplished painter and sculptor who has exhibited at The Studios of Key West.\nX\nAlong with her colleague Layla Barr, Margit Bisztray spearheaded a group of volunteers cooking and delivering hundreds upon hundreds of fresh, healthy meals to residents of the Lower Keys who were faced with rebuilding their homes and businesses due to Hurricane Irma. An entirely grass roots effort, Nourishing the Lower Keys quickly attracted a dedicated corps of volunteers and over $28,000 of contributions through a GoFundme campaign to continue buying groceries. Margit is a writer, chef and journalist.\nX\nEmma J Starr is one of the island’s most beloved artists. Over the spring and summer she had the inspiration to mobilize a group of artists to create new works on roofing tiles that she’d collected, and sell them through a pair of auctions called “Under One Roof.” The work was prominently displayed in a Duval Street storefront window thanks to landlord Ken Silverman, and the auctions were a rousing success, with virtually every piece sold, with 100% of the proceeds going back into the community. All told, Under One Roof raised $10,000 for the participating artists, and roughly $8,500 each to the Sister Season Fund and the Florida Keys Council of the Arts’ Audubon House Artists’ Fund, resulting in 17 grants to Monroe County artists who were financially impacted by the pandemic.\nX\nGary Marion is better known as Sushi, the world-famous drag queen who lights up the stage at 801 Bourbon, and is dropped from a shoe every New Year’s on Duval Street. As a performer, Gary immediately realized the pandemic posed an existential threat to Key West’s vibrant drag community, and took action. With formidable sewing skills honed in backstage dressing rooms and costume studios, he rallied a team of “his girls” to begin sewing and selling face masks to help make ends meet. Some 10,000 masks later, and after appearances on NBC, CNN and other national media, Gary has become not just a symbol of the importance of masks to keeping us all healthy, and of the singular plight of working performers, but of Key West’s resilience and ingenuity.\nX\nBrad Lutz is a commercial lender for First State Bank of the Florida Keys, so perhaps not the first person you might think would receive an award from an arts organization. But Brad was also the bank’s point person for the federal Paycheck Protection Program, and as such found himself a calming presence at the center of a storm of anxiety and uncertainty in the pandemic’s early days. A lending and grant program for small businesses and independent contractors, the PPP had limited funds, and was first come first serve, so from the outset there was a clear sense of urgency. Brad understood that the economic survival of the roughly 1,000 businesses he was helping, including dozens of the island’s arts nonprofits and artist-entrepreneurs, depended on him.\nX\nFrom 2007 until her recent retirement in 2022, Lauren McAloon served as the gallery and facilities manager of The Studios of Key West. The title is deceptively simple, as any title would be, for all the passion, joy, and commitment she brought to the position.\nLauren brings patience, selflessness, and a keen attention to detail to everything she does. But most of all, she helps us understand we all have an artist inside us and that\nThe Studios is a place that everyone can call home. She is extraordinary service personified. And for that reason The Studios of Key West is so pleased to present Lauren McAloon with The 2023 Studios Hero Award.\nWatch a video about Lauren here.\nX\nStanley and Judith Zabar are native New Yorkers who now snowbird and spend their winters on Sugarloaf Key. Both are artists and art-lovers and are involved in numerous charitable organizations in Key West and New York. Stanley is Vice-President and house counsel for Zabar’s & Co. Inc located at the upper west-side of Manhattan.\nimage\ncredit: Johnny White\nX\nBill and Ann Lorraine have been a part of the creative fabric of Key West since 1975. Ann Lorraine’s paintings and drawings have been exhibited in all over the world. Her first Key West one-woman show was at East Martello Museum in 1975, and her show “Window Wonderlands & Fantasy Floats – 23 years of legendary floats, windows and exotic creations.” was a hit of The Studios of Key West’s exhibition season in 2012. She is well-known in Key West for her award-winning Fantasy Fest costumes and giant animated floats and for her work as window designer for Fast Buck Freddie’s department store on Duval Street.\nBill Lorraine arrived in Key West has been involved in the Key West arts community as a musician and composer, writer and sculptor. His music compositions have been performed by the Key West Symphony Orchestra, the Old Havana Symphony Orchestra and the Keys Chorale. Bill was editor and publisher of a quarterly art magazine, “The Key West Arts Review” in the 1980s. He was assistant managing editor for the Key West Citizen newspaper for 2 years. He worked as a freelance writer for many Keys newspapers and magazines. As a stone sculptor, Bill uses the old cornerstones from the Victorian-style houses in Key West. The stone is called Miami Oolite, an indigenous stone from south Florida. Bill’s sculptures can be seen at the sculpture garden at the East Martello Museum, at the West Martello Fort, home of the Key West Garden Club, and in his studio on Catherine Street.\nimage\ncredit: Johnny White\nX\nAnne McKee has been a leader in charitable activities benefiting the local arts for over forty years. She states that her main concern is the individual artist. In the mid-1990s, with this target in mind, Anne founded the Anne McKee Artists Fund. Anne and the Fund are still going strong, having raised over a quarter million dollars to give in grants to support local artists.\nThe Studios of Key West is proud to host the annual Anne McKee auction, where aficionados bid on contemporary and classic works to raise proceeds which help fund the vital grant program for Keys artists.\nimage\ncredit: Anne McKee Artists Fund\nX\nA leader and force for social consciousness in this community, and a founding board member of the Anne McKee Artists Fund as well as The Studios of Key West, John Martini moved to Key West nearly forty years ago. As one of the original artists who had studio space in Truman Annex, Martini was a pioneer of the early art scene on the island. He opened Lucky Street Gallery at its original location on Margaret Street in the early 80s, and began representing local artists, curating work from around the country, and introducing “outsider art” to Key West. Eventually, he purchased and refurbished the iconic movie theater on Emma Street where he still works today.\nimage\ncredit: Johnny White\nX\nJudy Blume is one of America’s most beloved authors and one of its most vigilant and committed anti-censorship activists. She has been a funny and knowing voice for children and adolescents for nearly five decades. Blume’s books have sold more than 85 million copies in 32 languages. She works with National Coalition Against Censorship to support teachers and librarians committed to keeping all books accessible.\nCooper, a Magna Cum Laude graduate of Harvard Law School and member of the Law Review, was a professor of Taxation and Civil Rights Law at Columbia University for 20 years. Active in civil rights policy and litigation in the 1960s and 1970s, and editor of textbooks on Equal Employment and Poverty Law, he spent 1979 in South Africa where he helped establish the Legal Resources Centre, an anti-apartheid legal aid program. Also a successful writer, Cooper focused on historic true crime.\nCloser to home, Blume and Cooper are at the center of philanthropic life in Key West. Cooper, an independent film enthusiast, was the driving force behind the development of the nonprofit Tropic Cinema which Florida Monthly has named “Best Florida Cinema.”\nBlume’s passion for books led her to become a board member of Key West Literary Seminar, a nonprofit organization that supports young writers, librarians and teachers. In 2016, she and Cooper opened Books & Books @ The Studios, a full service, nonprofit bookstore in an Old Town arts complex. Enhancing Key West’s rich literary heritage, Books & Books hosts readings, promotes local authors and encourages children to love reading. Blume and Cooper can be found most days working at the bustling bookstore.\nimage\ncredit: Rob O’Neal\nX\nThough Christopher Peterson is perhaps best known for his live show “Eyecons” which he’s performed at La-Te-Da since 2001, he is also a passionate advocate for community causes. His charitable efforts as a comedian, impersonator and master of ceremonies have benefitted many organizations over the past two decades including AIDS Help, Equality Florida, Special Olympics, Key West Business Guild, The Studios of Key West, Queen Mother Pageant, Royal Coronation and many others. He is tireless in his devotion to Key West and its motto of “One Human Family.” Peterson’s Key West roots run deep. He arrived in Key West in 1998 with his husband of 37 years, the late James Mill. His extraordinary talents were recognized immediately, and he has become a local legend as one of the foremost female impersonators who sing “live.” He’s known for his masterful characterizations of Marilyn Monroe, Madonna, Joan Rivers, Reba McEntire, Bette Midler, Tina Turner, Julie Andrews, Barbra Streisand, Liza Minnelli, Judy Garland, Cher, Bette Davis, Lucille Ball, Lady GaGa and others. In addition, his skills as a costume designer and fabricator are unparalleled, manifesting in both his stage performances and charitable work. He is featured in the award-winning documentary “We’re Funny That Way,” which detailed the first gay and lesbian comedy festival in Canada and was later released on Showtime, Cinemax and HBO.\nimage\ncredit: Johnny White\nX\nLynn Kaufelt, a third generation Japanese American, was born and raised in Los Angeles, CA. After marrying novelist David A. Kaufelt and giving birth to their son, Jackson, the family divided their time between Manhattan, Sag Harbor, Long Island, and Key West. Her love for the Keys is unmistakable from her tireless work and support for Monroe County arts and service organizations.\nWatch her acceptance speech here.\nX\nBen and Helen Harrison have served as advocates and mentors to countless artists, writers, and musicians. In fact, over the past 35 years, Harrison Gallery has represented 172 artists and is widely recognized for the eclectic contemporary works exhibited inside its walls.\nThe Studios of Key West is grateful to Helen and Ben for all they’ve contributed to our community, helping to grow and preserve Key West’s reputation as an island of the arts.\nWatch a video about the Harrisons here.\nX\nWe couldn’t be happier to announce Rosi Ware as the recipient of the 2024 Golden Mango Award! We can’t think of anyone who has been as active in the community as Rosi Ware has. She was Chair or President of the Key West Garden Club for over 20 years, worked tirelessly with the MARC House, an organization for physically and mentally challenged adults, and she was the first President of The Studios of Key West, overseeing the exponential growth those early years from small island art center to the thriving hub we are today. And to add even more, she has been a board member on the Community Foundation of the Florida Keys, an active advisor for Arts in Public Places, and a member of the personal advisory team to Mayor Teri Johnston. No wonder she was honored with “Humanitarian of the Year” in 2013 by the Red Cross.\n(photo by Mark Hedden)\nWatch a video about Rosi here.\nX\nFor all the big wonderful ways that Tony Falcone has contributed to the community (Fast Buck Freddie’s, Fantasy Fest, saving the Strand sign, preserving the historic Key West Bight), he’s helped in a thousand quiet ways too. From supporting and encouraging artists to promoting a seemingly endless spirit of fun, from dedicating his time to community groups to working for a brighter future for the island while sustaining the things that count, Tony has been a fierce advocate for Key West. Passionate. Generous. Creative. And a whole lot of fun. There couldn’t be a person more deserving of the 2023 Golden Mango Award than Tony Falcone.\nWatch a video about Tony here.\nX\nMonica Lopez De Victoria (b. 1980, Gainesville, FL, USA) is a multi-disciplinary artist and performer in Artistic Synchronized Swimming. For the past 20 years Monica has woven these two art forms together. Her colorful geometric aquatic videos, performances, and textiles investigate emotional volume in space and movement in the 4 dimensions.\nMonica’s art work has been featured in international exhibitions such as “Uncertain States of America: American Art in the 3rd Millennium” curated by Hans Ulrich Obrist, Daniel Birnbaum, and Gunnar B. Kvaran, the Moscow Biennale of Contemporary Art, and PERFORMA in NYC by Roselee Goldberg. Her work has been seen and written about in L’Officiel magazine, The Guardian, STEP Inside Design, the New York Times, the Wall Street Journal, Vogue Italia, and on the cover of ARTnews magazine.\nMonica’s artwork also is a part of permanent collections of the Van Abbe Museum in the Netherlands and the Perez Art Museum Miami as well as other public and private collections. Monica has participated in residencies in Canada, New Zealand, Mexico, and the USA and has recently been supported by the Bauhaus Foundation for residency projects in Germany and South Korea.\nartist photo by Thomas Meyer\nX\nWilliam Kwamena-Poh is a native of Ghana, West Africa. He came to the United States in the early 1980’s and has resided in Alabama, Washington DC, Chicago, IL and has called Savannah, GA home since 1995. William is a self taught artist who paints with gouache, also known as opaque watercolor; the same medium used by the late, great African American artist, Jacob Lawrence and also experimented with by Dali, Picasso, and Klimt. According to Ralph Mayer’s Artist Handbook, “gouache paints are opaque and have (or should have) a total hiding power, and because they do not become progressively transparent with age as oil have a tendency to do…gouache has a brilliant light-reflecting quality of a different and distinct nature; it lies in the paint surface itself; its whiteness or brightness comes from the use of white pigments.”\nThis density and opacity of gouache allows William to capture and give the viewer a small window into his beautiful and wonder-filled homeland. “The sun’s strength is ever present, providing a colorful environment which is strongly reflected in Ghana culture and clothing,” says William. On his visits home he takes lots of photographs of places he grew up in and then sketches them freehand onto tracing paper so that he can best portray the natural and original feel of the scenes. He then transfers the sketched and corrected images onto heavier watercolor paper which permits him to implement numerous lifts and scrubbing to achieve the desired textures and emotional qualities of the scene.\nWilliam is internationally known for his series images of Women, Fisherman, Children and Market Scenes. His work is collected by private and well-known public figures throughout the United States and abroad (i.e., Academy Award winning Actor and Director, Forrest Whitaker; Actress, Angela Bassett; NBA Star, Tim Hardaway, just to name a few). Corporate collections include: Prudential, DuSable Museum, Disney Corp., Amoco Corp., Ford Motors, BET and Luster Products. Donated works include an original exclusively created and donated for auction to the Health and Educational Relief Organization (H.E.R.O.) for their 2014 annual fundraising gala in NY.\nWilliam’s father was a notable history professor who spent most of his teaching career at the University of Science and Technology in Kumasi, Ghana. He came to the U.S. in the early 1980’s as a Fulbright Scholar and taught African history at Talladega College. He brought young William with him, where he received his B.A. in Sociology. His father was aware of William’s budding artistic gift which was an inheritance from William’s grandfather, who was an art teacher. However, his father hoped William would follow in his footsteps sharing the history of his people…a wish William vehemently protested initially. But divine intervention saw his father’s wish, William’s protest and inherited gift through a slightly different lens. William walks in the footsteps of his ancestors and passionately shares the history of his people and homeland with his paint brush. This past February, during the week of William’s birthday he returned home for the ceremonial celebration of his father’s life and burial. While he was/is saddened by his father’s earthly departure, he found this trip home spiritually uplifting. He basked in the reminiscing of his father with family, friends, colleagues and town folk who paid such moving tributes that are forever etched in his heart. But also on this trip home, William celebrated his birthday and the life of his father, the man who had the great foresight to bring him to the U.S. for the opportunity to embrace, cultivate and share his gift of art with the masses.\nX\nKat Ryals (b. 1988 in Jonesboro, AR) is an artist, entrepreneur, curator and photographer based in Brooklyn, NY. Her mixed media artworks blend photography, craft & sculpture processes, textile materials, and found object assemblage. Ryals received a BFA in Photography from Savannah College of Art and Design and an MFA in Visual Art & an Adv. Certiﬁcate in Museum Education from Brooklyn College. She has shown her work nationally, including recent two person shows at Elijah Wheat Showroom and Ortega Y Gasset Projects, in group exhibitions with NADA, The Every Woman Biennial, ChaShaMa, Ortega Y Gasset Projects, and The Wassaic Project, and in solo booths at SPRING/BREAK Art Show. Her first solo exhibition will take place at 550 Gallery in 2025. Ryals was a 2024 artist-in-residence at the Museum of Arts & Design in NYC and has also attended residencies and fellowships at The Wassaic Project, ChaNorth, The Peter Bullough Foundation, and the Vermont Studio Center. She is a 2022 Joseph Robert Foundation grant recipient, and has been featured in\nThe New York Times\n,\nWhite Hot Magazine\n,\nartnet\n,\nForbes\n, and\nHyperallergic\n.\nartist photo by Tiffany Smith\nX\nAndrew Russell is a writer and director who often creates new work for theatre often inspired by real-life events, including\nStu for Silverton\n(Intiman Theatre);\nJohn Baxter is a Switch Hitter\n(Intiman Theatre);\nFull Gallop\n(The Old Globe); and Sara Porkalob’s\nThe Dragon Cycle\n, featuring\nDragon Lady\n(Intiman Theatre, American Repertory Theatre, Marin Theatre Company, Pittsburgh Public Theatre, The Geffen Playhouse),\nDragon Mama\n(American Repertory Theatre, Diversionary Theatre, Williamstown Theatre Festival), and\nDragon Baby\n. As Producing Artistic Director of the Tony Award–winning Intiman Theatre in Seattle from 2011-2017, Andrew played a critical role in reorganizing and reopening the theater after its closure in 2011. He is a graduate of Carnegie Mellon School of Drama. @heyheyandyk &\nwww.andrew-russell.com\nartist photo by JJ Geiger\nX\nRehman’s first novel,\nCorona\n, was chosen by the NY Public Library as one of its favorite books about NYC. She’s co-editor of\nColonize This! Young Women of Color on Today’s Feminism\nand author of the collection poetry\nMarianna’s Beauty Salon\n. Her new novel,\nRoses, in the Mouth of a Lion\n, is a modern classic about what it means to be Muslim and queer from a Pakistani-American community in Queens.\nRoses\nwas noted as a Best Book and Editor’s Choice by\nThe New Yorker\n,\nThe Washington Post\n,\nLos Angeles Times\n,\nPeople Magazine, Good Morning America, Ms. Magazine\nand more.\nartist photo by Andrea Dobrich\nX\nNancy Andrews makes films, drawings, music, books and objects. Andrews is a John Simon Guggenheim Foundation Fellow in filmmaking. The Museum of Modern Art has collected six of her films, and her work is in the collections of the Art Institute of Chicago, and Franklin Furnace Archives. Her first feature film,\nThe Strange Eyes of Dr. Myes\n, premiered at International Film Festival Rotterdam in 2015. This project was then developed as a web series when it was one of ten projects chosen to participate in Independent Film Project’s (IFP) Screen Forward Labs and subsequently,\nThe Strange Eyes of Dr. Myes\nweb series (YouTube) won the 2017 Gotham Award for Breakout Series (short).\nThe Museum of Modern Art, Pacific Film Archive, Anthology Film Archives, Flaherty Seminars, Ann Arbor Film Festival, Film on the Rocks- Thailand, and others have presented her work. Her work was featured in the 2013 deCordova Biennial and Portland Museum of Art Biennial and a solo show at Maine’s Center for Contemporary Art (2023).\nShe is a participant in Artists in Context’s “Artists’ Prospectus for the Nation” in the category of health, where she and other artists are bringing their aesthetic modes of inquiry to real-world situations. Andrews is on faculty at College of the Atlantic.\nartist photo by Corrine de Korver\nX\nVern Thiessen is one of Canada’s most produced playwrights. His plays have been seen across Canada, the UK, United States, Europe, Australia, New Zealand, and Asia and been translated in five languages.  His works include The Divners, Of Human Bondage, Vimy, Einstein’s Gift (GG winner), Lenin’s Embalmers (GG finalist), Apple, and Shakespeare’s Will. He has been produced off-Broadway five times. Vern is the recipient of numerous awards, including the Dora and Sterling awards for Outstanding New Play, The Carol Bolt Award, the Gwen Pharis Ringwood Award, the City of Edmonton Arts Achievement Award, the University of Alberta Alumni Award of Excellence, The Canadian Jewish Playwriting Competition, and the Governor General’s Literary Award for Drama, Canada’s highest honour for a playwright. He was also a finalist for the Siminovich Prize in Playwriting. Vern received his B.A. from the University of Winnipeg and an M.F.A. from the University of Alberta. He has srvedas president of both the Playwrights Guild of Canada and the Writers Guild of Alberta. For six years he served as Artistic Director of Workshop West Playwrights Theatre, one of Canada’s leading new play companies. He is married to acclaimed screenwriter and novelist Susie Moloney.\nwww.vernthiessen.com\nX\nSandra Jackson-Opoku is the author of the award-winning novel,\nThe River Where Blood is Born\nand\nHot Johnny and the Women Who Loved Him,\nan\nEssence Magazine\nBestseller in Hardcover Fiction. Her fiction, nonfiction, poetry, and dramatic works are widely published and produced, appearing in\nMidnight & Indigo, Aunt Chloe, Another Chicago Magazine, New Daughters of Africa, Adi Magazine, Africa Risen: A New Era of Speculative Fiction, Adi Magazine\n,\nAbout Place Journal,\nthe Chicago Humanities Festival, Lifeline Theatre, and others. She also coedited the anthology,\nRevise the Psalm: Work Celebrating the Writing of Gwendolyn Brooks\n.\nProfessional recognition includes a National Endowment for the Arts Fellowship, the American Library Association Black Caucus Award, the Chicago Esteemed Artist Award, a Lifeline Theatre BIPOC Adaptation Showcase, the Globe Soup Story Award, the Plentitudes Journal Prize, a Circle of Confusion Writers Discovery Fellowship, the Iceland Writers Retreat Alumni Award, a Pushcart Prize nomination, and the Casa África Purorrelato Prize. She placed as a quarterfinalist in the Stage 32 Springboard Diversity Screenwriting Competition and Roadmap Writers Short Story Competition.\nSandra Jackson-Opoku taught literature and writing at the University of Miami, Columbia College Chicago, and Chicago State University. She presents workshops, readings, and literary events worldwide.\nX\nRachel de Cuba is an interdisciplinary artist raised in Sebastian, FL. She received her BFA in Studio Art from Flagler College in 2013 and her MFA in Digital Art from Indiana University in 2019. She received recognition for her thesis work with Grant awards from Indiana University. In 2019 she was invited to create new media artworks for the New Orleans Film Festival with support from the Andy Warhol Foundation. Her mixed media work has been exhibited nationally and internationally, as well as selected for publication in New American Paintings Southern 2022 Edition. Her work has been selected for\nSkyway 2024: A Contemporary Collaboration\nwith an invitation to exhibit at The John and Mable Ringling Museum of Art in Sarasota, Florida. Rachel de Cuba is currently an Assistant Professor of Visual Arts at Eckerd College in St. Petersburg, Florida.\nX\nGlenn Weiss is a public art critic, producer and artist currently studying the impact of architects, designers and digital fabricators on the world of public art.  He has managed public art programs in Times Square, Seattle and Florida including Broward County and Jacksonville and wrote several public art master plans including Miami Beach.  He served as an architecture critic for Seattle Magazine, Seattle Post-Intelligencer and ARCADE and blogged on public art for ArtsJournal.com. Special projects include the Delray Beach Cultural Loop with Rick Lowe, the Boynton Beach Kinetic Biennial, the Sealevel Rise Rauschenberg Residency, the Times Square Valentine Heart, Competition Diomede with Union of Soviet Architects, Adam’s House in Paradise and Homeless at Home. He professionally began in NYC as the co-director/curator for the Storefront for Art and Architecture and the curator for architecture at PS1 (now PS1/MoMA) after securing a Master of Architecture at Columbia University. He lives with his wife Maria Foladori Weiss in Delray Beach, Florida and teaches architecture theory at Florida Atlantic University.   More details available at\nwww.glennweiss.com\nand photography on instagram at @glennweiss\nX\nMirena Suarez is a Cuban-born multimedia artist. She received her Bachelor in Arts degree with a minor in Printmaking from the Higher Institute of Arts in Havana. She moved to the United States and furthered her studies at Florida International University and NOVA Southeastern University. Her work reflects on the atemporal universal issues of identity, connection, and change. Through a variety of media that includes mainly tile mosaic, printmaking, drawing and photography, the artist explores philosophical questions associated with the concepts of loss, memory, conception, survival, fragility, perception of time, social relationships and dynamics, and emotional communication as originators of a visual dialogue that expresses the thoughts, worries, perceptions, and the constant internal fights that she experiences. This standpoint goes beyond being auto-referential and becomes a personal expression of the universal query that rules the dynamics inherent to modern life. Mirena has extensively exhibited her work around the world, and has been awarded numerous prizes and recognitions for her artwork. She currently works as a Visual Arts teacher for Miami-Dade County Public Schools. She lives and works in Miami, FL.\nX\nKarin Lin-Greenberg’s first story collection,\nFaulty Predictions\n, won the Flannery O’Connor Award for Short Fiction, and her second story collection,\nVanished\n, won the Prairie Schooner Raz-Shumaker Book Prize. Her novel\nYou Are Here\nwas published by Counterpoint Press in 2023 and was an Indie Next pick from the American Booksellers Association. She’s received a Pushcart Prize and her stories have appeared in\nThe Chicago Tribune\n,\nNew England Review\n,\nThe Southern Review\n,\nStory\n,\nVirginia Quarterly Review\n, and elsewhere. She teaches creative writing at Siena College in upstate New York and also teaches fiction in Carlow University’s low-residency MFA program.\nX\nRuth Jeyaveeran uses textiles to examine a shared history of alienation and dissociation. In her soft sculptures and fiber-based installations, the boundaries between human, animal, and flora dissolve to tell a story of isolation, migration, and evolution.\nJeyaveeran’s first solo show,\nSoft Remains\n, was exhibited at Field Projects in 2023. Other notable exhibitions include\nFelt Experience\nat the Brattleboro Museum and\nCommunion\n, a solo installation at Main Window Dumbo. Her work has been featured at Smack Mellon, ABC No Rio, Westbeth Gallery, The Yard, Ely Center of Contemporary Art, The Border Project, and Bronx Art Space, among others.\nJeyaveeran has been awarded residencies from the Lower Manhattan Cultural Council, Residency Unlimited, Lighthouse Works, Marble House Project, Jentel Foundation, Willapa Bay, Virginia Center for the Creative Arts, La Napoule Art Foundation, and PADA Studios. She is an Associate Professor of Textile Design at the Fashion Institute of Technology.\nX\nNya Patrinos centers her art on giving voice to the voiceless, telling the stories of people and places that have been forgotten or left unexplored, and reinterpreting religious texts, myths, and folktales through a modern lens. As an artist and surface designer, Nya explores the realms of spirituality and identity, as well as cultural intersections. History, memory, light, wind, climate, temperature, the moon, and stars all form the tapestry of her artistry, weaving together to chronicle a cohesive story.  Nya received an Emmy nomination in Art Direction/Set Decoration for the TV series\nTransparent\n.  W\nebsite:\nwww.nyapatrinos.com\nX\nMorgan Hill is a sculptor and jewelry designer whose work draws on a wide range of aesthetic and conceptual influences from 90’s pop culture, campy cinema, and costume design to her Southern, Christian upbringing and experiences as the only female child in an extended family of farmers in Arkansas. Her longing to break the silence surrounding culturally censured topics drives her to create work on themes of illness, abuse, depression, and suicide, as well as their counterparts of rebirth, healing, and empowerment. On the lighter side, her jewelry brand\nBad Habits by Morgan Hill\ncelebrates the pleasure of excess and indulged desires.\nMorgan’s formal art education began at the Memphis College of Art where she focused on drawing. She also studied interior design and ultimately earned a BFA in Woodworking and Furniture Design from the University of Arkansas Little Rock. She was a Core Fellow at the Penland School of Craft from 2015-2017 where she worked with renowned artists and designers and studied techniques ranging from chainsaw carving to metalwork to neon tube bending. In 2018, she was an ITE Windgate Fellow at the Center for Art in Wood, and in 2022, she was awarded the Chrysalis Award by the James Renwick Alliance. Her work is carried in galleries across the US and internationally. She creates her work at Treats Studios in Spruce Pine, NC, a studio cooperative she co-founded.\nX\nJoy Castro is the award-winning author of the 2023 historical novel\nOne Brilliant Flame\n, set amidst the nineteenth-century anticolonial Cuban insurgent community in Key West;\nFlight Risk\n, a finalist for a 2022 International Thriller Award; the post-Katrina New Orleans literary thrillers\nHell or High Water\n, which received the Nebraska Book Award, and\nNearer Home\n, which have both been published in France by Gallimard’s historic\nSérie Noire\n; the story collection\nHow Winter Began\n; the memoir\nThe Truth Book\n; and the essay collection\nIsland of Bones\n, which received the International Latino Book Award. She is also the editor of the craft anthology\nFamily Trouble: Memoirists on the Hazards and Rewards of Revealing Family\nand the founding series editor of Machete, a series in innovative literary nonfiction at The Ohio State University Press. Her work has appeared in venues including\nPloughshares\n,\nThe Brooklyn Rail\n,\nSenses of Cinema\n,\nSalon\n,\nGulf Coast\n,\nBrevity\n,\nAfro-Hispanic Review\n,\nLos Angeles Review of Books\n, and\nThe New York Times Magazine\n. A former Writer-in-Residence at Vanderbilt University, she is currently the Willa Cather Professor of English and Ethnic Studies (Latinx Studies) at the University of Nebraska-Lincoln, where she directs the Institute for Ethnic Studies. With translator and co-editor Rhi Johnson, she edited the bilingual edition of the 1918 poetry collection\nLágrimas y flores\nby Feliciano Castro, forthcoming in October, 2024 from the University Press of Florida.\nX\nBarbara Boissevain is a California based contemporary visual artist and photographer whose work focuses on the impact of human activity on the environment. Nature’s ability to regenerate and reclaim human altered landscapes is a central theme in her work.\nBoissevain was born in Cleveland, Ohio and raised in Silicon Valley. She studied painting at Parsons School of Design in New York before immersing herself in photography, earning a BFA from the San Francisco Art Institute and an MFA from San Jose State University.\nHer work has been exhibited in solo and group exhibitions throughout the United States and Europe, including Mémoire De L’Avenir, Paris; the Institute of Contemporary Art, San Jose, CA; Galerie Numero Cinq, Arles, France; and the Academy of Fine Arts in Krakow, Poland. From 2014 to 2021, she was an artist in residence with the City of Palo Alto’s Cubberley Artist Studio Program. In 2018 she was an artist in residence at Galerie Huit in Arles, France. She was invited to Atelier 11 for a solo residency through L’AiR Arts international residency program in Paris in July 2022. In the Summer of 2023 she was honored to participate in the Cycladic Arts Residency in Paros Greece.\nIn 2009 Boissevain published her first book, titled Children of the Rainbow, which documented the humanitarian challenges facing Quechua communities in Peru due to climate change. In 2021 her work was featured on NPR’s “The Picture Show” in conjunction with the UN Climate Change Summit in Glasgow, Scotland. She was also featured on the PBS News show Something Beautiful in 2022.\nHer book “Salt of the Earth” was published by Kehrer Verlag in the Fall of 2023, and was chosen as one of Wired Magazine’s best photo books of 2023.\nBoissevain’s photographs are in numerous public and private collections, including the Smithsonian National Air and Space Museum, Washington D.C.; the Google Corporate Art Collection, Sunnyvale, CA; and the De Pietri Artphilein Foundation, Lugano, Switzerland\nX\nR. Eric Thomas (he/him) is a national bestselling author, playwright, and screenwriter. His books include,\nHere for It, or How to Save Your Soul in America,\nwhich was featured as a Read with Jenna pick on NBC’s\nToday,\nthe YA novel\nKings of B’more\n, a 2023 American Library Association Stonewall Honor book\n,\nand\nCongratulations, the Best Is Over!\n, an instant USA Today Bestseller. He also writes the daily, nationally syndicated advice column “Asking Eric.” For his playwriting, Eric has won the Barrymore Award for Best New Play, the Dramatist Guild Lanford Wilson Award, the Lambda Literary Award, and was a finalist for the O’Neill Conference and the Steinberg/ATCA New Play Award. On screen, he wrote for the Peabody Award-winning series\nDickinson\non AppleTV+ and\nBetter Things\non FX and is currently developing multiple film and television projects, including a half hour comedy based on his memoir. Off the page, Eric is also the long-running host of The Moth StorySlams in Philadelphia, and has been heard multiple times on The Moth Radio Hour. Website:\nrericthomas.com\nX\nLisa Morehouse is an award-winning public radio reporter and editor. Her series\nCalifornia Foodways\nis a county-by-county exploration of stories at the intersection of food, culture, history, economics, labor and the environment. The stories air on KQED’s\nThe California Report Magazine\n, national shows, and on the California Foodways\npodcast\n. The series received a national Edward R. Murrow Award and four James Beard nominations, and Morehouse was named a fellow for the UC Berkeley-11th Hour Food and Farming Journalism Fellowship, and Les Dames d’Escoffier San Francisco Karola Saekel Craib Excellence In Food Journalism Fellowship.\nMorehouse is the Senior Editor for KALW Public Radio’s news magazine, Crosscurrents, where she helps train new audio journalists. Her first career was in public education, teaching middle school in rural Georgia, building an educational non-profit in Arizona, and spending a decade teaching high school in San Francisco.\nX\nLee Jensen is a Danish textile artist. Lee grew up in Copenhagen, Denmark, and now lives and works in Queens, New York. She holds a BFA degree from the School of Visual Arts in New York. Lee Jensen creates contemporary abstract quilts and hand-sewn stretched textile pieces. Her work is influenced by her urban environment and by a life-long connection to sewing and textiles.\nJensen is the recipient of the New York Foundation for the Arts (NYFA)/Queens Art Fund 2024 New Work Grant. In 2023-24 she was awarded participation in NYFA’s Immigrant Artist Mentoring Program. Her work has been featured in\nHyperallergic\nand\nQueens Chronicle.\nX\nChristopher Castellani has published five books, most of which center on the Italian, Italian-American, and/or queer experience. His most recent novel is\nLeading Men\n, for which he received Fellowships from the Guggenheim Foundation, MacDowell, and the Massachusetts Cultural Council.\nLeading Men\nwas published in February 2019 by Viking Penguin, and is currently being adapted for film by Peter Spears (Oscar-winning producer of\nNomadland\n) and acclaimed Italian director Luca Guadagnino (\nCall Me By Your Name\n).\nThe Art of Perspective: Who Tells the Story\n, a collection of essays on point of view in fiction, was published in 2016 by Graywolf Press, and is taught in many creative writing workshops.\nHis first novel,\nA Kiss from Maddalena\n(Algonquin, 2003) won the Massachusetts Book Award in 2004; its follow-up,\nThe Saint of Lost Things\n(Algonquin, 2005), was a BookSense (IndieBound) Notable Book; the final novel in the trilogy,\nAll This Talk of Love\n(Algonquin, 2013), was a\nNew York Times\nEditors’ Choice and a finalist for the Ferro-Grumley Literary Award.\nChristopher is currently on the faculty and academic board of the Warren Wilson MFA program and the Bread Loaf Writers Conference. Since 2019, he has chaired the Writing Panel at YoungArts, aka the National Foundation for Advancement in the Arts. For nearly twenty years, Christopher was in executive leadership at GrubStreet, where he founded the Muse and the Marketplace national literary conference and led the development of numerous artistic programs for adults, teens, and seniors.\nThe son of Italian immigrants and a native of Wilmington, DE, Christopher was educated at Swarthmore College, received his Masters in English Literature from Tufts University, and a Master of Fine Arts in Creative Writing from Boston University. He lives in Boston and Provincetown, MA, where he is completing his fifth novel with the support of a Literature Fellowship from the National Endowment for the Arts.\nX\nAndrew Shaffer is the\nNew York Times\nbestselling author of\nHope Never Dies: An Obama Biden Mystery\n, the children’s picture book\nMothman’s Merry Cryptid Christmas\n(which he also illustrated), and over two dozen other books in multiple genres, including mystery, horror, and humor. He is a five-time Goodreads Choice Award nominee and a two-time finalist in the Humor category. His most recent book is the fully illustrated\nLiterary Cats Coloring Book,\nfeaturing feline versions of famous authors from “Jane Pawsten” to “Furnest Hemingway.” An Iowa native and frequent visitor to the Keys, Shaffer lives in Louisville, Kentucky, with his wife, novelist Meg Shaffer.\nX\nDylan Mabika is a 23 year old passionate hyperrealism artist on a journey of self-discovery and expression. Despite having no academic background in art, he has dedicated himself to creating art that resonates with the heart and speaks to the soul. For Dylan, art provides peace to his soul and mind unlike anything else, and it has become his passion.\nBorn and raised in Zimbabwe, Dylan has always been drawn to art, evident from his early days in primary school where he started and loved drawing. At the age of 16, he decided to take his art seriously after being inspired by an older student who refused to share his skills and knowledge. This sparked Dylan’s determination to teach himself to draw, marking the beginning of his artistic journey.\nIn 2017, Dylan created his first drawing of a human face, and in 2018, he passed his O’ level with 7 subjects. Due to financial constraints, he couldn’t attend an art school or a high school with art as a subject, so he refined his drawing skills on his own. In 2019, Dylan entered his first art competition and won a gold medal for coming first place in his age group in a national competition, also being announced as the best overall in the art category.\nSince then, Dylan has experimented with various mediums like charcoal pencils, watercolor pencils, colour pencils and pastel color pencils and he is eager to learn more. He dropped out of school in 2019 to focus on art and support his family financially. Dylan’s life experiences and his aspirations inspire him to create art that provides a space for reflection and imagination, where each viewer can find a piece of themselves reflected back.\nDylan hopes to own a gallery with a spacious studio equipped with art materials and a positive atmosphere, where he can work as an artist and photographer. He also aims to give back to the less privileged artists in schools like his, providing them with art materials and knowledge. Dylan believes that art has the power to heal, inspire, and transform, offering solace and hope in times of uncertainty and despair.\nX\nDeborah Zlotsky received a 2019 Guggenheim Fellowship and NYFA Artist Fellowships in Painting in 2012 and 2018. Her work is in a variety of public, private and corporate collections in the US and abroad and she has been awarded recent residencies at MacDowell, Yaddo, the Bogliasco Foundation, Two Coats of Paint, and the Bemis Center. Zlotsky is represented by Markel Fine Arts and McKenzie Fine Art, both  in New York, Robischon Gallery in Denver, and Sandler Hudson Gallery in Atlanta.  She has a BA in art history from Yale University and an MFA in painting and drawing from the University of Connecticut. She teaches at the Rhode Island School of Design and lives in the Hudson Valley.\nX\nAllyson Morgan is an award-winning writer, producer, and performer. Allyson’s first short film\nNeed For Speed (Dating)\npremiered at the Tribeca Film Festival, while her next short,\nSitting\n, won “Outstanding Narrative Short” at Tallgrass Film Festival.\nFirst Date\n, her short film produced by 20th Digital Studio, is currently airing on Hulu in their “Bite Size Halloween” series. Allyson adapted\nFirst Date\ninto a feature film for Hulu, titled\nJagged Mind\n, which the LA Times called “edgy” and “powerful.” Her newest short,\nThe Ghost\n, which also serves as her directorial debut, made its world premiere at the RiverRun International Film Festival in 2024. She has also been selected for the New York Stage and Film Filmmakers’ Workshop, been awarded “Best Teleplay” at Omaha Film Festival, twice been a top ten Finalist for Cinequest, a Finalist at Stowe Story Labs, and a Semi-Finalist at Austin Film Festival. Additionally, she has been awarded an Ensemble Studio Theatre/Alfred P. Sloan Foundation Commission, a Djerassi Artist Residency (California), an NG Art Creative Residency (France), a Monson Arts Residency (Maine), a Vashon Artist Residency (Washington), a Wassaic Project “Haunted Mill” residency (NY),  and multiple Juno Leadership Residencies through the Omega Institute (NY). Allyson has two novels,\nDon’t Want To Remember You\nand\nThe Perfect Place\n, currently available through Tapas Media. She is represented for literary by Heroes and Villains Entertainment. More:\nallysonm.com\nX\nBrittany Reeber is a writer and director living in NYC whose work spans narrative, music video, documentary and commercial mediums.\nOriginally from the Sunshine State, she has inherited an affection for oddball characters and humid climates. Her work reflects the humor, tenderness, and spirit found in the lesser known corners of America — sometimes, there’s a choreographed dance sequence.\nShe has received grants and residencies from American Documentary, Kodak, The Austin Film Society, Caldera Arts, Cucalorus, The Bend Film Festival, The Studios of Key West, among others. Her most recent film,\nSTUCK\n, an existential stoner comedy, just finished a successful run on the film festival circuit after premiering at the Mammoth Lakes Film Festival in 2023, and her feature script,\nSALT SPRINGS\n, a Florida climate dramedy, is currently in development.\nHer music videos have appeared in\nPitchfork, Rolling Stone Magazine, NPR\nand\nBillboard Magazine\n. In 2023, she directed NYC comedian Fareeha Khan’s solo show\nI ACTUALLY DON’T FEEL THAT GOOD\nto sold out audiences.\nWhile at The Studios of Key West, she’ll continue to explore the ways in which the Florida landscape, culture and environmental conflicts, play a vital role in her work.\nX\nJohn Graham’s\never-diversifying visual art practice includes printmaking, artist’s books, painting, drawing, installations, and digital imaging. This artwork has been widely exhibited in North America, Europe and Asia. John is also the writer, producer, director and editor of 10 short films that have been screened at over 220 venues in over 40 countries. Many of these arthouse films have won awards or received nominations for awards. STILL HERE / IMMERDAR (2024) is his 10th short film that poetically explores the theme of dying beautifully.\nX\nAndrée B. Carter was born and raised in New Orleans. She also lived in Seattle and Los Angeles, but now resides full-time in Palm Desert. Andrée received an MFA from The University of New Orleans and a BS from Loyola University in New Orleans (Cum Laude). She also studied art history in Florence, Italy through a Tulane University summer program.\nIn addition to numerous solo and group exhibitions, Andrée has been honored with painting fellowships from the Bau Institute held in Otranto, Italy; the Virginia Center for Creative Art, Amherst, VA; and the Ucross Foundation in Clearmont, WY. She is also a Kipaipai Fellow, a special program focusing on participants to build their professional network. Andrée’s latest residency was in November 2023 at the Cycladic Arts Residency on the Greek island of Paros.\nFurthermore, Andrée has received several accolades, including the Artistic Selection Award from the Korean Cultural Center, Los Angeles, CA and the Museum of Art and History, Lancaster, CA. In 2022, she received a Jurors award from the Artist Council Exhibition in Palm Desert. Andrée was also honored to be one of 30 artists chosen for the Rancho Mirage Festival of the Arts, in November 2022.\nAndrée’s was recently in an exhibition in Los Angeles at Gallery 825 called “Soul of a City.” This group exhibition of Swiss and American artists was also recently shown in Neuchatel, Switzerland. Andrée’s work is included in numerous private and public collections, most notably in the Ogden Museum of Southern Art, New Orleans, LA; Swedish Hospital, Seattle, WA; and the Iberia Bank, New Orleans and Shreveport, LA.\nX\nFaith Adiele\nis the author of four experimental chapbooks about her Nigerian-Nordic-American heritage and\nMeeting Faith\n, an award-winning account of becoming Thailand’s first Black Buddhist Nun that is widely taught in American universities. Her media credits include\nMy Journey Home\n, a PBS documentary about finding her family, HBO-Max’s\nA World of Calm\n, and\nSleep Stories\nfor the Calm meditation app. Her essays appear in\nO: The Oprah Magazine\n,\nEssence\n,\nOkayAfrica\n,\nSmithsonian Folklife\n, and numerous anthologies. She founded the nation’s first writing workshop for travelers of color and African Book Club at San Francisco’s Museum of the African Diaspora. Named one of\nMarie Claire\nmagazine’s “Five Women to Learn From,” Adiele chairs the Writing & Literature Program at California College of the Arts and speaks and teaches around the world.\nX\nFranck Hodelin is an artist and interior designer from New York City . Straddling the boundary of realism and abstraction, his figurative oil paintings feature profoundly intimate portraits of men in an array of settings. In 2023, Hodelin was a recipient of the Warner Bros. Discovery 150 Grant. He also received grants from the New York City Artists Corps and a Queens Council on the Arts “New Works Grant” in 2020 to create a series of work that was featured in a solo show at Local Projects Gallery in Long Island City, NY.\nRecent exhibitions include a 2-person show at the Chashama Gallery in New York City; the Long Island City Artists “Heritage” group show at Queens College; Greene County Council on the Arts “New Perspective: Selected Works of Artists From the African Diaspora.” Franck received a BFA from Pratt Institute in Brooklyn, New York. He currently lives and works in Sunnyside, NY.\nimage: “Sit and Reflect” (oil paint on wood panel, 40 x 60″)\nX\nA multi-faceted force, Sarah Dahnke is a choreographer, director and arts educator deeply committed to encouraging communities to use performance to reclaim narratives stripped away by colonialism. As a practitioner, Sarah specializes in devised performance for stage and screen.\nSarah has also been a MAP Fund awardee, an NEA Our Town-funded resident artist, and an awardee of fellowships from Gibney’s Moving Toward Justice, Colt Coeur, Target Margin Institute, New Victory LabWorks, and Culture Push. She has received commissions from Little Island, PEN America and A Studio in the Woods and has been in residence at Abrons Arts Center and Brooklyn Studios for Dance. She was recently the Associate Director for the Off-Broadway play\nSTILL.\nShe was the 2022-23 Opera Columbus Directing Fellow and has gone on to direct opera productions of\nCarmen\nand\nHydrogen Jukebox.\nHer dance film work has been screened through the Dance Films Association, Tiny Dance Film Festival, DanceBarn Collective, BRIC, and Movies By Movers.\nShe is a graduate of ITP|NYU, where she specialized in studying the intersection of performance and technology.\nSarah is also the artistic director of Dances for Solidarity, a project that co-creates choreography with people affected by the criminal legal system and performs for public audiences as advocacy toward prison abolition. Learn more at\nsarahdahnke.com\nand\ndancesforsolidarity.com\n.\nX\nKota Bowen is an interdisciplinary artist based in Milwaukee, Wi specializing in ceramic sculpture. With a printmaking degree from University of Wisconsin- Milwaukee they have a rich background in drawing, and other narrative forms. They have ten years experience working professionally in clay and freelancing as an illustrator. Much of their work is inspired by mythology and classical paintings with a contemporary graphic twist.\nX\nJosh Aronson (b. 1994, Toronto, Canada) is a photographer based in Miami. He received his B.A. in Philosophy from Northwestern University. His work reclaims and redefines Southern manliness, presenting tender portrayals of young men against the backdrop of Florida’s landscapes. His photography emphasizes vulnerability, introspection, and emotional complexity, challenging dominant narratives of masculinity. Aronson’s visual storytelling is rooted in his own experiences growing up in Florida, where the natural environment and cultural history serve as constant inspirations.\nX\nJ Wortham (they/them) is a sound healer, reiki practitioner, herbalist, and community care worker oriented towards healing justice and liberation. They are also a staff writer for The New York Times Magazine, and co-host of the podcast ‘Still Processing,’ With Kimberly Drew, they co-edited Black Futures, a visual anthology and compendium of radical, imaginative, and provocative art by contemporary Black creators. J is also currently working on a book about the body and dissociation for Penguin Press. J mostly lives and works on stolen Munsee Lenape land, now known as Brooklyn, New York, and is committed to decolonization as a way of life.\nX\nEric Pankey, who received his MFA from the Iowa Writers Workshop in 1983, is the author of seventeen collections of poems:\nFor the New Year\n(Atheneum 1984), which was selected as the winner of the Walt Whitman Award by Mark Strand,\nHeartwood\n(Atheneum 1988), which was reissued by Orchises Press in 1998,\nApocrypha\n(Alfred A. Knopf 1991),\nThe Late Romances\n(Alfred A. Knopf 1997),\nCenotaph\n(Alfred A. Knopf 2000),\nOracle Figures\n(Ausable Press 2003),\nReliquaries\n(Ausable Press 2005),\nThe Pear as One Example: New and Selected Poems\n(Ausable Press 2008),\nTrace\n(Milkweed Editions 2013),\nDismantling the Angel\n(Free Verse Editions 2013), which won the New Measures Prize,\nCrow-Work\n(Milkweed Editions 2015),\nAugury\n(Milkweed Editions 2017),\nOwl of Minerva\n(Milkweed Editions 2019),\nAlias: Prose Poems\n(Free Verse Editions 2020),\nNot Yet Transfigured\n(Orison Books 2021),\nThe History of the Siege\n(Codhill Press 2024).  A collection of essays,\nVestiges: Notes, Responses, & Essays 1988-2018\nappeared from Parlor Press in 2019.\nHis poetry, essays, and reviews have appeared widely in such journals as\nThe Iowa Review, The Harvard Review, The Kenyon Review, The New Yorker, The New Republic, The New Yorker,\nand\nThe Yale Review.\nHis work has been supported by fellowships from John Simon Guggenheim Foundation, The National Endowment for the Arts, the Ingram Merrill Foundation, and the Brown Foundation.\nX\nErnest Gold is a successful writer and director, who has worked in the United States and Austrian film industries for over 15 years, specializing in creating outstanding genre movies and tv shows. His work includes character driven dramas, heartfelt comedies, as well as stunt and effect heavy action films. Ernest is the co-creator and writer of the first ever Austrian AMAZON PRIME VIDEO series\n“Beasts Like Us”\n, released in 2024. He’s the recipient of a Fulbright Scholarship, and alum of the prestigious NYU Tisch – School of the Arts and Filmacademy Vienna.\nX\nWhat’s Provided\nThrough generous sponsors we are able to provide the following extras to use during your residency:\nBEST OF KEY WEST RENTALS.\nGenerously provided your linens, bedding and towels.\nFORT ZACHARY TAYLOR STATE PARK.\nWe want you to visit the state park and beach as much as you’d like! Our pass unfortunately needs to be tied to a staff member, so you can coordinate a day to go together, or we’ve got a gift card you can use to visit on your own time. The card is in the PEAR House, be sure to bring it so you don’t have to pay the entry fee.\nKEY WEST YOGA SANCTUARY.\nFree yoga classes all month! Register for your first class online with code ‘PEAR’ then connect with staff to get set up with a full month at your first visit.\nYOGA ON THE BEACH.\nMeet at Ft. Zach Beach by 8:15am to flow with Nancy and Don. PEARs get your first class free!\nKEY WEST PUBLIC LIBRARY.\nWe’ve partnered with the library to offer you a library card to use during your stay. Key West Library has an extensive catalog of books and other media, plus e-books and audiobooks available for download and even some special events! Their calendar has more about what’s going on.\nLAZY DOG ADVENTURES.\nLazy Dog does it all – kayak and paddle board tours, rentals, lessons and classes, paddle yoga and fun boat adventures! They’ve offered a paddle pass for PEARs – simply inquire with staff about an available day and they’ll hook you up with a free rental.\nWE*CYCLE.\nThe fun way to get around town! Public transportation with 2 wheels. They provided your conch cruiser or tricycle.\nX\nApplication and Selection Process\nThe Studios accepts applications on a rolling basis from January-May of each year for the following residency season. The season runs from October-August. There is a $45 application fee to apply which supports the program.\nApplications are evaluated by selection committees comprised of working artists and professionals in the applicants’ respective fields of discipline under the five categories:\nVisual Arts, Literary Arts, Media Arts, and Musical Arts and Performing Arts.\nAcceptance to The Studios’ PEAR Program is based on the merit of past work and the potential for creative, intellectual and personal growth through the time and space to imagine new artistic work, engage in valuable dialogue and explore island connections.\nKey West’s official motto, “One Human Family” reflects our commitment to living together as caring, sharing neighbors dedicated to making our home as close to paradise as we can. To that end, we encourage artists of all races, nationalities, gender identities, sexual orientations, and abilities to apply.\nX\nAbout The Studios of Key West\nThe Studios of Key West’s mission is to support artists, inspire creativity and build community.\nThe Studios was founded with the vision of bringing world class artists to the island, connecting them with local audiences and artists, and offering space for both to explore their creativity. We’ve hosted Pulitzer prize winners, world renowned artists and musicians, and introduced thousands of students to different ways of seeing and working. Our Helmerich Theater stage bristles with talent, music from our rooftop concerts flood into the neighborhood, and every month hundreds of people visit The Studios to take in new experiences and catch up with old friends.\nRead more about who we are here.\nX\nExpectations\nYou’ll find that the Key West community is very welcoming to new people (especially creative ones!) – and there is never a shortage of things to do. Your time is yours to do with as you choose, of course, and we respect that you’ll need plenty of time to dream, reflect and create. We do ask that you join us at two events during your residency:\n“IN THE COURTYARD” RESIDENCY POTLUCK THIRD WEDNESDAYS, 6-8PM\nDepending on the time of year, a group of about 20-40 friends and community members gather together for an informal potluck and a chance to meet our residency artists. Guests bring a dish to share (bring whatever you’d like – from chips and salsa to your favorite recipe). About halfway through the night, each of the residency artists takes few minutes to introduce themselves and talk about their work or what they’re working on in Key West (remember, it’s very casual, so no PowerPoint presentations necessary!). Writers often like to read a very short bit of their work and artists often like to open their studios to show what they are working on – but neither is necessary, whatever you feel comfortable with.\nOPEN HOUSE EVENT FIRST THURSDAYS, 6-8PM\nFriends new and old are invited to join us for each month’s First Thursday Open House event, when we keep our lights on late and throw our doors open to celebrate the newest work in our galleries. Stop in to say hello, relax with a glass of wine on the rooftop terrace, tour the third floor artist studios and see the just-installed exhibitions in the Sanger, XOJ, Zabar Project and Zabar Lobby Galleries.\nX\nAbout Key West\nKey West is an island community, two miles by four miles wide, at the very end of the road. Most people get around on bicycle or foot, and the neighborhoods are compact and filled with lush gardens and tropical plant life. There are Cuban groceries and café con leche on every other corner, and a mix of Latin and Caribbean influences everywhere. Known for blue skies, open water and mangrove islands, and 80 degree days in winter, Key West is removed from the American mainland by 120 miles of bridges and small islands.\nLong a home to artists and creative people, the ghosts of Hemingway, Robert Frost, Elizabeth Bishop, Mario Sanchez, and Shel Silverstein still haunt our Old Town neighborhood. Flowers bloom year-round, and fruit trees proliferate. And on any given day, it’s not unusual to run into modern-day creative people, such as Judy Blume, Billy Collins, Jimmy Buffett, Meg Cabot, Terrence McNally, John Martini, Seward Johnson, or Annie Dillard.\nFor a small community, Key West is rich in cultural events, creative projects, and celebrations of every kind. The population is diverse and compassionate, and takes to heart the island’s famous motto: One Human Family, which reflects The Studios’ commitment to living together as caring, sharing neighbors dedicated to making our home as close to paradise as we can. Our creative community is proud of this special sense of place. We embrace an independence from the mainland, celebrate our tropical and Caribbean influences, and seek out artists and cultural leaders wanting to do the same—and gain the benefit of exile in the Conch Republic.\nX\nSPECIALTY HARDWOODS FOR SALE\nA limited selection of short length (4′ or less) specialty hardwoods (mostly Cuban Mahogany) can be purchased from the Woodshop. Email\nwoodshop@tskw.org\nfor inquiries.\nFor a wider variety in wood types and length, we recommend our friend on Big Coppitt, Mike. He has a great selection and is nearby. His phone number is (305) 797-5747.\n×\nWOODSHOP RULES\nNo jerks allowed.\nThe Woodshop is a shared space. Be mindful, respectful and patient with the people around you. Keep your space tidy and leave time to clean up before you’re done. The Woodshop Monitor is in charge, but is a human being too, so be nice.\nNo drinking or drugs\n. Consumption of alcohol or any substances which may impair judgment or coordination, including medications, are strictly forbidden while any tools are in use, including by others. Similarly, no one under the influence of substances consumed elsewhere is allowed in the Woodshop while tools are in use, including by others.\nKeep food outside\n. You can eat at the tables outside, but keep food and drink (except water) outside of the Woodshop.\nSupervision Required\n. The Woodshop may only be used in the presence of a Monitor who has been designated by The Studios.\nAuthorization Required\n. You may only use equipment and tools for which you’ve been authorized by a Woodshop Monitor.\nDress appropriately\n. Shoes with closed toes required while using tools. No dangling jewelry or clothing, and long hair should be pulled back. Eye covering is required while using power tools.\nKnow your materials.\nKnow whether any materials you use are toxic, corrosive or flammable. No pressure treated wood. Store and dispose of them properly. Not sure? Read the label or ask the Monitor.\nKnow where the First Aid Kid is\n. And report any injuries to the Monitor.\n×\nWOODSHOP TOOLS\nWhat We Have…\n36” Band saw (Northfield)\nDrill press (Delta)\n8” Joiner (Powermatic)\nPlaner (Newman)\nRadial arm saw (Dewalt)\nShaper-large (Powermatic)\nShaper-smaller (Grizzly)\n10” Table Saw (Powermatic)\nLathe\nTabletop sander\nPortable chop saw\nBlades – various kinds\nClamps – various kinds\nFasteners – various kinds\nHandheld drills\nHandheld jigsaws\nWork tables\n… And What You’ll Need\nSandpaper (can be purchased at the Woodshop)\nBlades and bits beyond ordinary use\nFasteners (eg. nails and screws) beyond ordinary use\n×\nHOW TO GET HERE\nAddress: 6810 Front Street, Key West, FL 33040\nWe’re located in Safe Harbor Marina on Stock Island, just down the docks from Hogfish Bar & Grill.\n×\nShop Time Rates\n$30/half day (up to 4 hours)\n$50/full day (up to 8 hours)\n$180/week (up to 5 days)\n$550/month\nPayments\nPay for your Shop Time\nonline using the link you receive, or by phone at 305-296-0458 during The Studios regular Box Office Hours (Tue-Sat, 10am-4pm). Bookings must be confirmed by payment\nat least 24 hours in advance\n.\nCancellations\nIf you need to cancel or change your time, email\nwoodshop@tskw.org\nright away.\nBookings may be cancelled and refunded up to 7 days prior to the booking.\nBookings may be changed to a later date at no additional cost, if notification is received at least 24 hours prior to the original booking.\nNo refunds will be issued if cancellation is not received at least 24 hours in advance.\n×\nHugh's View Rooftop\nWith one of the tallest buildings – and most spectacular views – in town, the\nHugh’s View rooftop terrace\nserves as The Studios’ creative space in the sky. The terrace sits four stories above street level and offers panoramic views of the island. The Kitwald Stage glows in the golden twilight of our sunset performances.\nHugh’s View offers:\n—Smaller audience sizes\n—Outdoor environment\n—Intimate experiences\n—A rooftop bar that opens one hour prior to show time\nX\nHelmerich Theater\nWith original seating from its days as a Masonic temple, the\nHelmerich Theater\nhas been updated to also include floor seating. As a black box theater, the set up is intimate but professional, and sets the stage for concerts and performances that leave guests feeling like they really got to know the performer.\nHelmerich Theater offers:\n—More space and comfortable chairs\n—Indoor comforts\n—Intimate experiences\n—A walk-up counter bar that opens one hour prior to show time\nX\nResidency Interest\nThe period for applying to 2021/22 residencies is now closed. We will begin accepting residencies for the 2022/23 season, which runs from September 2022-August 2023, in January 2022. If you would like to be notified by email when the application period opens again,\nplease fill out this form.\nX\ntest\nX\nMailchimp for WordPress v4.10.7 - https://wordpress.org/plugins/mailchimp-for-wp/\nLeave this field empty if you're human:\n/ Mailchimp for WordPress Plugin\nX\nShiftNav #shiftnav-main\nThe Studios of Key West\nLogin Here\nMuseum Hours and Admission\nExhibitions\nEvents\nClasses\nStudios/Residencies\nSupport\nBecome a Member, Donor or Patron\nOur Business Sponsors\nOur Patrons\nVolunteer\nBack\nBook a Private Event\n× Close Panel\n/.shiftnav-inner\n/.shiftnav #shiftnav-main",
      "emails": [
        "disrudjoris5@gmail.com",
        "hobbsart@bellsouth.net",
        "info@coccoandsalem.com",
        "info@tskw.org",
        "mpuppich@yahoo.com",
        "scottyking@sbcglobal.net",
        "wlancetaylor@gmail.com",
        "woodshop@tskw.org"
      ]
    },
    {
      "url": "http://tskw.org/events",
      "is_candidate": false,
      "has_email": true,
      "text": "News\nCalendar\nLogin\nUberMenu [Configuration:main] [Theme Loc:primary-menu] [Integration:auto]\nVisit\nHours, Admission and Location\nDirections, Transportation & Parking\nOur Campus\nCurrent Studio Artists\nBook a Private Event\nclose menu\nBooks & Books\nExhibitions\nEvents\nClasses\nArtist Residencies\nSupport\nBecome a Member, Donor or Patron\nOur Business Sponsors\nOur Patrons\nVolunteer\nclose menu\nCalendar\nNews\nEnd UberMenu\nVISIT\nEXHIBITIONS\nEVENTS\nHOURS, ADMISSION AND LOCATION\nMuseum & Box Office Hours\nTuesday-Sunday, 10am-4pm (Dec-May)\nTuesday-Saturday, 10am-4pm (Jun-Nov)\nVisitors can find us, tour our galleries and studios, and visit the rooftop at 533 Eaton Street.\nAdmission\nAdmission to our galleries and campus is always free of charge.\nAs a non-profit, community organization, we offer discounted fees for classes, performances and events to members of The Studios. If you are interested in the benefits of membership\nlearn more here\n!\nPRIVATE RENTAL INQUIRIES\nFrom rooftop parties to business gatherings, The Studios offers a host of unique spaces to make your event one for the ages!\nLearn more here.\nEvents\nAll\nConcerts\nExhibitions\nScreenings\nSpecial Events\nAll\nConcerts\nExhibitions\nScreenings\nSpecial Events\nTUESDAYS, 6-8PM\n2025 | HAPPY HOUR\nGlow Hours on Hugh’s View\nOur Hugh’s View roof terrace offers the best views in town, and an ideal spot to catch the sunset and a drink with friends. The bar is open, admission is free, and everyone looks great in the golden twilight.\nSTOP IN THRU SEP 20\n2025 | SUMMER IN THE SANGER\nSummer in the Sanger: Samuel Alvarez\nThis summer, the Sanger Gallery transforms into a working studio and showcase for local painter Samuel Alvarez. Explore more than 40 of his vibrant works—from expressive portraits to luminous Florida Keys landscapes—and, if you’re lucky, catch him painting right in the gallery.\nTHU OCT 2, 6-8PM\n2025 | OPENING\nOctober First Thursday\nJoin us for First Thursday Open House: art, wine on the rooftop, new exhibits, and open studios. Connect, explore, and celebrate creativity with friends old and new!\nTUE OCT 21, 5-7PM\n2025 | EVENT\nTutu Tuesday Glow Hours\nBefore you head off to the 15th Annual Tutu Tuesday Party, stop at The Studios to toast the sunset. Come up as your favorite bedtime story or magical monster…in a TUTU of course!\nTHU NOV 6, 6-8PM\n2025 | OPENING\nNovember First Thursday\nJoin us for First Thursday Open House: art, wine on the rooftop, new exhibits, and open studios. Connect, explore, and celebrate creativity with friends old and new!\nSUN NOV 9, 5PM\n2025 | EVENT\nSouthernmost Youth Orchestra\nFrom classical favorites to contemporary selections, this concert showcases the young rising stars of our southernmost community.\nMON-FRI NOV 10-14\n2025 | TRIP\nHavana Art Tour\nFor over a decade, The Studios has led pioneering cultural exchanges with Cuba, building friendships with many of its most significant artists and cultural figures. Reap the benefits of those relationships with a whirlwind tour of Havana’s arts scene.\nSUN NOV 16, 7PM\n2025 | EVENT\nThe Life & Art of Eric Anfinson\nSee a work-in-progress preview screening of “The Life & Art of Eric Anfinson,” a moving portrait of the artist, plus a special performance by Kyla Piscopink, filmmaker Q&A, and closing reception on Hugh’s View of the 2025 Key West Film Festival.\nSAT NOV 29, 10AM-2PM\n2025 | EVENT\nHoliday Makers Market\nSupport your local arts community on Small Business Saturday by starting your holiday shopping in a fun and festive indoor market. With a full building of artists and artisans showcasing their work, there will be something for every person on your list.\nFRI DEC 12, 5:30PM\n2025 | EVENT\nDecember Duo Holiday Concert\nIrie Monte will be joined by Crispin Campbell on cello for an evening of beautiful string music on the rooftop. Let the music get you into the holiday spirit!\nVIEW PAST EVENTS\nGet to know The Studios of Key West\nOur mission is to support artists, inspire creativity and build community.\nA deeper look:\nAbout\nStaff & Board\nAwards for Excellence in the Arts\nGet a visual:\nOur Photos\nOur Video Story\nFollow us on:\nFacebook\nInstagram\nTikTok\nYouTube\nVimeo\nMuseum Store Instagram\nFine print:\nPolicies/FAQs\nPrivacy Policy and Terms\nOverview\nOur Campus\nHours and Location\nContact\n2025 Catalog\nResources\nMember Portal Login\nSubmit a Proposal\nJob Opportunities\nPrograms for Kids and Teens\nVisit\n533 Eaton Street\nKey West, FL 33040\ninfo@tskw.org\n305-296-0458\nFree and open to the public.\nOpen Wed-Sat, 10am-4pm\nNewsletter\nJoin Our Newsletter\nSIGN UP\nIf you are human, leave this field blank.\nGet to know The Studios of Key West\nOur mission is to support artists, inspire creativity and build community.\nA deeper look:\nAbout\nStaff & Board\nAwards for Excellence in the Arts\nFollow us on:\nFacebook\nInstagram\nTikTok\nYouTube\nVimeo\nMuseum Store Instagram\nFine print:\nPolicies/FAQs\nPrivacy Policy and Terms\nOverview\nOur Campus\nHours and Location\nContact\nResources\nMember Portal Login\nSubmit a Proposal\nJob Opportunities\nPrograms for Kids and Teens\n2025 Catalog\nVisit\n533 Eaton Street, Key West, FL 33040\ninfo@tskw.org  |  305-296-0458\nFree and open to the public.\nOpen Wednesday-Saturday, 10am-4pm\nKey West Web Design\nScott King\nScott King is a Golden Globe and Writers Guild Award nominated writer, producer, and director with a long-running career in television. He currently serves as the showrunner for\nOvercompensating\n, an original series on Prime Video. His writing and producing credits span comedy and satire, including standout work on\nMad TV\n,\nHarlem\n, and\nDifficult People\n.\nNow splitting his time between the screen and the island, Scott brings his creative energy to The Studios of Key West, where he’s developing new work and reconnecting with storytelling in all its forms. Whether writing for television, film, essays or live performance, Scott’s work blends humor with human insight—always with a touch of the unexpected.\nGet in touch\n→\nX\nLance Taylor\nLance Taylor is a Key West-based singer-songwriter, performer, and audio engineer whose music blends folk, Americana, and country blues with a gritty, heartfelt edge. Since arriving in Key West in 2001, he’s gone from street performances to stages across the island, including long-standing gigs at Blue Heaven, The Green Parrot, Celtic Conch, and Dive Bar T-Shirt Club. From 2004 to 2010, Lance fronted his own band, performing original songs and building a devoted local following. By 2012, he had become a full-time musician, splitting his time between performing and producing for fellow artists.\nLance records and produces music out of his studio at The Studios of Key West, where he crafts original material and collaborates with a wide circle of musicians. His 2017 album\nGhost on the Highway\nwas born out of a cross-country road trip, and more recent singles—like “My Oh My” and “Man on Wire”—highlight his skills as a producer and multi-instrumentalist. Whether on stage or in the studio, Lance brings a raw, road-worn spirit to everything he creates.\nGet in touch →\nX\nJim Salem\nJim Salem is an internationally recognized painter whose luminous landscapes reflect a lifelong connection to the natural world. Splitting his time between his native Pennsylvania and the Florida Keys—where he has lived since 1993—Jim draws inspiration from coastal light, lush vegetation, and the quiet beauty of wild spaces. He studied painting at Pennsylvania State University and the Slade School of Fine Art in London, and his work continues to evolve with a deep reverence for place and atmosphere.\nOver the course of his career, Jim has been featured in more than 35 solo exhibitions and dozens of juried and invitational shows. His paintings are held in private and corporate collections around the world, including Disney, Hilton Hotels, and PPG, and he is represented by galleries across Florida, Indiana, Alabama, and Pennsylvania. In addition to his studio practice, Jim is a longtime supporter of the arts in Key West, having served on the boards of both the Key West Museum of Art & History and the Anne McKee Artists Fund.\nGet in touch\n→\nX\nMatthew Puppich\nMatthew Puppich is a painter whose abstract work explores the vibrant rhythms of island life—often featuring expressive interpretations of chickens, roosters, and the everyday sights that make Key West unique. With a bold use of color and playful composition, his paintings offer a whimsical yet thoughtful lens on the world around him. His debut solo exhibition,\nLife in Key West: An Abstract Perspective\n, was presented at Truman Art Space in 2021.\nA graduate of the 39th class of the Key West Ambassadors Academy, Matthew is deeply connected to the local community and creative scene. He continues to grow his practice as a resident artist at The Studios of Key West, where he draws inspiration from the tropical landscape, the island’s character, and the spontaneous spirit of its people.\nGet in touch\n→\nX\nLucy Paige\nLucy Paige is a Key West-based abstract painter whose playful, layered compositions are inspired by the island’s colors, textures, and rhythms. Using acrylic, oil stick, patterned collage, and pen, she captures the feeling of a day at the beach in blocks of color, patches of light, and meandering lines. Her distinctive mixed-media works celebrate the looseness and joy of island life, transforming everyday scenes into vibrant visual poems.\nA resident studio artist at The Studios of Key West since 2017, Lucy has exhibited widely in solo and group shows throughout the island. Her work is also represented in public collections, including commissions for Bernstein Park and Seven Fish Restaurant. She is a two-time recipient of the Anne McKee Artist Grant and has participated in numerous workshops and residencies to further her exploration of abstraction. Lucy’s studio practice is deeply rooted in the local arts community, where she continues to create, exhibit, and mentor emerging artists.\nGet in touch\n→\nX\nMichael Marrero\nMichael Marrero is a Cuban-American artist, playwright, and filmmaker whose work blends visual storytelling, theatrical invention, and cultural commentary. His award-winning short films\nBuzzcut\nand\nRiley Was Here\nhave screened at over 100 festivals worldwide, and his original plays—including\nLocura\n,\nAlligator Alley\n, and\nRepair\n—have been staged in Havana, New York, and Key West. In 2020, he received a Knight Foundation grant for\nOrisha: The Lost Saints\n, a photography project exploring Afro-Caribbean spirituality, later exhibited at the Havana Biennial. Whether behind the camera or on stage, Michael’s work is rooted in myth, memory, and the spirit of the subtropics.\nIn addition to film and theater, Michael’s photography has appeared in solo exhibitions and campaigns for clients ranging from Reuters and the Smithsonian to the Florida Keys Tourism Council. His recent projects include the play\nKing Tide\n, the short film\nParty Time\n, and an ongoing exploration of tradition and identity through visual media. A longtime Key West resident, Michael maintains a studio at The Studios of Key West, where he continues to develop new work and collaborate across disciplines.\nGet in touch\n→\nX\nTom Joris\nTom Joris is a sculptor, painter, and longtime fixture in Key West’s creative community. A former professor at the Art Institute of Chicago, Tom has led lectures and sculpture demonstrations across the Chicago metropolitan area, with his teaching even featured on NBC. His work spans fine art and functional design, and his thoughtful approach to materials and form reflects decades of hands-on experience and a deep belief in the power of the handmade.\nIn 1992, Tom and his wife, painter Carrie Disrud, co-founded\nKalypso Gallery\n—an energetic art space showcasing their own work alongside pieces by family members and artists from across North America. Now working alongside their son, Rennie, they continue their collaborative art practice both locally and online. Tom’s studio is nestled inside The Studios of Key West, where he continues to create and inspire in a space that, like him, balances tradition with creative freedom.\nGet in touch\n→\nX\nPam Hobbs\nPam Hobbs\nis a painter known for her vibrant color palette and joyful depictions of island life. Originally from New Jersey, she earned her B.F.A. from the Kansas City Art Institute, where she studied fiber arts and surface design. After a vacation to Key West more than 40 years ago, Pam never looked back. Inspired by the island’s lush tropical beauty—its vivid flowers, sweeping skies, and crystalline water—she shifted from fiber to painting and began developing her bold, expressive style.\nPam’s work can be found in galleries across Florida, including Art on Duval (Key West), Art on Fifth Avenue (Naples), and Art on St. Armand’s Circle (Sarasota). She maintains a working studio on the third floor of The Studios of Key West at 533 Eaton Street, where she welcomes visitors by appointment. Pam’s goal is simple: to create work that reflects the freedom, boldness, and happiness of island living.\nGet in touch\n→\nX\nmark hedden\nMark Hedden\nis a writer, photographer, and longtime Key West local whose career has spanned everything from eco-tourism and comedy to newspaper columns and birdwatching. A resident artist at The Studios of Key West since its founding in 2007, Mark originally joined as a writer but found himself drawn into the visual arts through the influence of the creative community around him. His photographic work has been widely exhibited, with major solo shows including\nVelo City\n, exploring Key West’s bike culture;\nNocturnal\n, a series of nightscapes capturing the island’s vernacular architecture; and\nOn the Hook\n, a portrait series of Key West’s liveaboard boaters. His projects have received support from the Knight Foundation, the Anne McKee Foundation, the South Florida Cultural Consortium, and the Florida Keys Council of the Arts.\nMark’s images and writing have appeared in\nThe New York Times\n,\nThe Guardian\n, CNN,\nPeople\n,\nRoads & Kingdoms\n, and many local outlets. He is a regular contributor to the\nKey West Weekly\n, where his “Wild Things” column chronicles the islands’ birds and wildlife. His most recent work,\nSouth of Southernmost\n, captures the remote and storied Ballast Key, while an ongoing project,\nFlorida P&L Statement\n, documents Florida’s abandoned roadside businesses. Mark has also taught photography and writing at The Studios of Key West and the NSU Art Museum, and he was recently featured in a joint exhibition at JAG Gallery with photographer Lynn Bentley Kemp. (And yes, he was once mysteriously described as a bullfighter on a podcast.)\nGet in touch\n→\nX\nSandra is an interdisciplinary artist who works across a broad range of practices, including cut paper, painting, murals, community art, and social practice. Her work has been exhibited at SOFA New York, Ann Nathan Gallery in Chicago, the Museum of Contemporary Art in St. Louis, Missouri, The Studios of Key West in Key West, Florida, and National Amazon University in Puerto Maldonado, Peru. Her work is included in the Howard Tullman Collection, The Museum of Contemporary Craft in Portland, Oregon, Seattle Tacoma International Airport, and several private collections. She was awarded artist residencies at The Studios of Key West, Florida; Rogers Art Loft in Las Vegas, Nevada; Arquetopia, Puebla, Mexico; the Contemporary Crafts Museum in Portland, Oregon; and with the Amazon Conservation Association in Madre de Dios, Peru. Recognition for her work includes a Mayor’s Art Award, thirteen Parents Association Awards for Contributions to Students, a Hixson Lied Award for Senior Faculty Achievement in Research and Creative Activity, a Hixson-Lied Curriculum Development Award, and two Hixson-Lied Awards for Outreach, Engagement, and Service. She is a CoPI on the transdisciplinary Grand Challenge grant RISE With Insects. Sandra is the Visual Arts Chair for the Southwest Popular/American Culture Association.\nHer most recent work contains variations on the theme of ecotone, the area where two communities meet and integrate. Traditionally, the term refers to ecological communities, such as the zone where the plains and desert meet the rainforest and the biodiversity that occurs there. Yet it can also refer to the zone where “nature” and “culture” intersect—where the city meets the preexisting natural environment and the tension resulting from this intersection. It may also refer to a metaphorical overlapping of narrative and place.\nAdditional work includes social practice projects emphasizing creative facilitation, community needs, and restorative justice.\nX\nSara Fruner is a bilingual poet and novelist born in Riva del Garda, Trentino, North-Eastern Italy. She graduated in English literature and language from Ca’ Foscari University in Venice and earned two MPhils in literary translation. Her translations include works by Dionne Brand, Monique Truong, Sello Duiker, Raj Rao, Don McKay, and others. She has worked as a translator in the publishing industry and served at the Italian Cultural Institute of Los Angeles in 2007. Sara later worked as a Senior Publication Coordinator in Trento and taught English as a foreign language at Istituto Accademico Interpreti e Traduttori di Trento and the University of Trento.\nIn 2016, she moved to New York City, where she currently teaches Italian at New York University and the Fashion Institute of Technology. She contributes to bilingual newsmagazine\nLa Voce di New York\nand collaborates with the Center for Italian Modern Art and Magazzino Italian Art. Her poetry has appeared in journals like\nGraphie\nand\nItalian Poetry\n, and her books include\nBitter Bites from Sugar Hills\n(2018),\nLucciole in palmo alla notte\n(2019), and\nLa rossa goletta\n(2024). Sara’s debut novel\nL’istante largo\n(2020) was shortlisted for the Severino Cesari National Award for Debut Novel, and she released\nLa notte del bene\nin 2022. Her upcoming novel will be released in May 2025. Sara has participated in numerous residency programs worldwide, including The Studios of Key West and The Bogliasco Foundation.\nX\nTipper Newton is an actor, filmmaker, and musician living in Los Angeles. Her recent short film,\nWild Card\n, played festivals worldwide and received a Special Jury Award for Best Midnight Short at Palm Springs ShortFest. Her short film\nThe Dangerous Type\ntook home the 2021 “Best Shorts With Legs” prize at Fantastic Fest and premiered online as a Vimeo staff pick. As an actor, Tipper has had recurring roles on\nThe Mindy Project\nand\nThe Guest Book\n. When she’s not busy working in film and television you can find her being the frontwoman for her powerpop band Color TV.\nhttps://vimeo.com/tippernewton\nX\nRick Worth is a force of nature—talented, generous, and endlessly inventive. Since arriving in Key West in 1986 with just $18 in his pocket, he’s transformed the island into his canvas. From painting clunkers into joyful “moving murals” to leading community art projects, Rick brings creativity and color to everything he touches.\nHe’s exhibited at Lucky Street, JAG, and Harrison Gallery, and even opened his own space, Three-Legged Dog Gallery, named for his spirited pup, Kiddo. Beyond the canvas, Rick has supported countless local initiatives, from teaching with MARC House to leading community murals with over 100 kids. Whether he’s leading painting bootcamp, building floats, or belting karaoke at Bobby’s, Rick infuses Key West with joy. His work reminds us that art isn’t just something to admire—it’s something to live, share, and celebrate. Rick has painted more than walls; he’s helped color the spirit of this island.\n(photo by Johnny White)\nWatch a video about Rick here.\nX\nDr. MaryLouise Patterson is a retired general pediatrician living in NYC. She is also a mother of 3 and a grandmother of 4.\nHer parents, Louise and William Patterson, were Leftist civil rights activists their entire lives. They represented the best in the Black Radical tradition. They instilled in her a profound love and pride of Black people and to the need to uphold their culture, history and noble struggle for freedom and unbridled inclusion.\nShe received her medical degree from Patrice Lumumba Friendship University in Moscow, USSR and a Masters, Public Health at the University of California, Berkeley.\nShe is the co-author of “\nLetters from Langston: From the Red Scare to the Harlem Renaissance and Beyond\n”. UC Press 2016.\nShe loves jazz, plays, art exhibits, dancing – despite not getting enough of it anymore, socializing and cooking for friends and family, discussing politics, reading, traveling plus just living.\nShe is committed to and active in the push for universal health care-Medicare for All, to ending institutionalized racism in medicine, to increasing the number of Black, Latinx, Native American Indian and women health providers and to Peace with Justice everywhere.\nX\nDr. Royel M. Johnson is one of the nation’s leading voices on diversity, equity, and inclusion in higher education. A tenured professor in the Rossier School of Education at the University of Southern California, Johnson also serves as chair of the school’s PhD program. He is the Director of the National Assessment of Collegiate Campus Climates in the USC Race and Equity Center, which is the nation’s leading tool for assessing campus racial climate. Johnson is the author and editor of five books and over 60 academic papers and chapters. His recent books include\nThe Big Lie About Race in America’s Schools\n(Harvard Education Press) and\nFrom Foster Care to College: Navigating Educational Challenges and Creating Possibilities\n(Teachers College Press). Additionally, Johnson serves as Co-Editor of\nEducational Researcher\n, the flagship journal for the field of education. The\nLos Angeles Times\nrecently named Dr. Johnson a DEIA Visionary, recognizing his efforts to propel positive change across the country.\nX\nDr. Sonia Mae Brown is currently an Associate Professor of Language and Letters and the Chair of the Division of Arts and Humanities at Philander Smith University. Dr. Brown received her doctoral degree in English from Howard University and she also possesses a Masters in English with a focus in Creative and Professional Writing from Long Island University. Her areas of research are gender and sexuality, black female sexuality, and sex as a discursive act or practice.\nAs a self-proclaimed “Eroticist” or “Literary Sexual Anthropologist, Dr. Brown is dedicated to enriching the current scholarship on The Erotic and exploring the potential for eroticism to be seen as a critical lens of textual inquiry. According to Dr. Brown, “reading is an erotic pursuit, and those who engage in the process of reading are engaging in an intimate activity.” Dr. Brown is passionate about bringing discussions of the erotic into the academy and into the classroom. She is currently working on a monograph about sadomasochism in James Baldwin’s literature.\nX\nChristine Fifer’s boundless energy and optimism mobilized a core group of volunteers to clear homes and properties in the Lower Keys of debris from Hurricane Irma. Working through grueling heat and dangerous conditions, they brought hope to many and directed their energies particularly to getting fellow artists back on their feet. Christine is a painter, costume artist, and former Studio Artist at The Studios of Key West. She has most recently exhibited in the Sanger Gallery in January 2021.\nX\nGary Teplitsky and Olga Manosalvas are the owners of Baby’s Coffee on Big Pine Key. Despite significant damage to their own business, they opened their doors shortly after Hurricane Irma and made their entire inventory free to all. Baby’s quickly became a lifeline and a rallying point for residents – a vital distribution point for supplies, hot meals and other services donated from all over the Keys and beyond. Olga is an accomplished painter and sculptor who has exhibited at The Studios of Key West.\nX\nAlong with her colleague Layla Barr, Margit Bisztray spearheaded a group of volunteers cooking and delivering hundreds upon hundreds of fresh, healthy meals to residents of the Lower Keys who were faced with rebuilding their homes and businesses due to Hurricane Irma. An entirely grass roots effort, Nourishing the Lower Keys quickly attracted a dedicated corps of volunteers and over $28,000 of contributions through a GoFundme campaign to continue buying groceries. Margit is a writer, chef and journalist.\nX\nEmma J Starr is one of the island’s most beloved artists. Over the spring and summer she had the inspiration to mobilize a group of artists to create new works on roofing tiles that she’d collected, and sell them through a pair of auctions called “Under One Roof.” The work was prominently displayed in a Duval Street storefront window thanks to landlord Ken Silverman, and the auctions were a rousing success, with virtually every piece sold, with 100% of the proceeds going back into the community. All told, Under One Roof raised $10,000 for the participating artists, and roughly $8,500 each to the Sister Season Fund and the Florida Keys Council of the Arts’ Audubon House Artists’ Fund, resulting in 17 grants to Monroe County artists who were financially impacted by the pandemic.\nX\nGary Marion is better known as Sushi, the world-famous drag queen who lights up the stage at 801 Bourbon, and is dropped from a shoe every New Year’s on Duval Street. As a performer, Gary immediately realized the pandemic posed an existential threat to Key West’s vibrant drag community, and took action. With formidable sewing skills honed in backstage dressing rooms and costume studios, he rallied a team of “his girls” to begin sewing and selling face masks to help make ends meet. Some 10,000 masks later, and after appearances on NBC, CNN and other national media, Gary has become not just a symbol of the importance of masks to keeping us all healthy, and of the singular plight of working performers, but of Key West’s resilience and ingenuity.\nX\nBrad Lutz is a commercial lender for First State Bank of the Florida Keys, so perhaps not the first person you might think would receive an award from an arts organization. But Brad was also the bank’s point person for the federal Paycheck Protection Program, and as such found himself a calming presence at the center of a storm of anxiety and uncertainty in the pandemic’s early days. A lending and grant program for small businesses and independent contractors, the PPP had limited funds, and was first come first serve, so from the outset there was a clear sense of urgency. Brad understood that the economic survival of the roughly 1,000 businesses he was helping, including dozens of the island’s arts nonprofits and artist-entrepreneurs, depended on him.\nX\nFrom 2007 until her recent retirement in 2022, Lauren McAloon served as the gallery and facilities manager of The Studios of Key West. The title is deceptively simple, as any title would be, for all the passion, joy, and commitment she brought to the position.\nLauren brings patience, selflessness, and a keen attention to detail to everything she does. But most of all, she helps us understand we all have an artist inside us and that\nThe Studios is a place that everyone can call home. She is extraordinary service personified. And for that reason The Studios of Key West is so pleased to present Lauren McAloon with The 2023 Studios Hero Award.\nWatch a video about Lauren here.\nX\nStanley and Judith Zabar are native New Yorkers who now snowbird and spend their winters on Sugarloaf Key. Both are artists and art-lovers and are involved in numerous charitable organizations in Key West and New York. Stanley is Vice-President and house counsel for Zabar’s & Co. Inc located at the upper west-side of Manhattan.\nimage\ncredit: Johnny White\nX\nBill and Ann Lorraine have been a part of the creative fabric of Key West since 1975. Ann Lorraine’s paintings and drawings have been exhibited in all over the world. Her first Key West one-woman show was at East Martello Museum in 1975, and her show “Window Wonderlands & Fantasy Floats – 23 years of legendary floats, windows and exotic creations.” was a hit of The Studios of Key West’s exhibition season in 2012. She is well-known in Key West for her award-winning Fantasy Fest costumes and giant animated floats and for her work as window designer for Fast Buck Freddie’s department store on Duval Street.\nBill Lorraine arrived in Key West has been involved in the Key West arts community as a musician and composer, writer and sculptor. His music compositions have been performed by the Key West Symphony Orchestra, the Old Havana Symphony Orchestra and the Keys Chorale. Bill was editor and publisher of a quarterly art magazine, “The Key West Arts Review” in the 1980s. He was assistant managing editor for the Key West Citizen newspaper for 2 years. He worked as a freelance writer for many Keys newspapers and magazines. As a stone sculptor, Bill uses the old cornerstones from the Victorian-style houses in Key West. The stone is called Miami Oolite, an indigenous stone from south Florida. Bill’s sculptures can be seen at the sculpture garden at the East Martello Museum, at the West Martello Fort, home of the Key West Garden Club, and in his studio on Catherine Street.\nimage\ncredit: Johnny White\nX\nAnne McKee has been a leader in charitable activities benefiting the local arts for over forty years. She states that her main concern is the individual artist. In the mid-1990s, with this target in mind, Anne founded the Anne McKee Artists Fund. Anne and the Fund are still going strong, having raised over a quarter million dollars to give in grants to support local artists.\nThe Studios of Key West is proud to host the annual Anne McKee auction, where aficionados bid on contemporary and classic works to raise proceeds which help fund the vital grant program for Keys artists.\nimage\ncredit: Anne McKee Artists Fund\nX\nA leader and force for social consciousness in this community, and a founding board member of the Anne McKee Artists Fund as well as The Studios of Key West, John Martini moved to Key West nearly forty years ago. As one of the original artists who had studio space in Truman Annex, Martini was a pioneer of the early art scene on the island. He opened Lucky Street Gallery at its original location on Margaret Street in the early 80s, and began representing local artists, curating work from around the country, and introducing “outsider art” to Key West. Eventually, he purchased and refurbished the iconic movie theater on Emma Street where he still works today.\nimage\ncredit: Johnny White\nX\nJudy Blume is one of America’s most beloved authors and one of its most vigilant and committed anti-censorship activists. She has been a funny and knowing voice for children and adolescents for nearly five decades. Blume’s books have sold more than 85 million copies in 32 languages. She works with National Coalition Against Censorship to support teachers and librarians committed to keeping all books accessible.\nCooper, a Magna Cum Laude graduate of Harvard Law School and member of the Law Review, was a professor of Taxation and Civil Rights Law at Columbia University for 20 years. Active in civil rights policy and litigation in the 1960s and 1970s, and editor of textbooks on Equal Employment and Poverty Law, he spent 1979 in South Africa where he helped establish the Legal Resources Centre, an anti-apartheid legal aid program. Also a successful writer, Cooper focused on historic true crime.\nCloser to home, Blume and Cooper are at the center of philanthropic life in Key West. Cooper, an independent film enthusiast, was the driving force behind the development of the nonprofit Tropic Cinema which Florida Monthly has named “Best Florida Cinema.”\nBlume’s passion for books led her to become a board member of Key West Literary Seminar, a nonprofit organization that supports young writers, librarians and teachers. In 2016, she and Cooper opened Books & Books @ The Studios, a full service, nonprofit bookstore in an Old Town arts complex. Enhancing Key West’s rich literary heritage, Books & Books hosts readings, promotes local authors and encourages children to love reading. Blume and Cooper can be found most days working at the bustling bookstore.\nimage\ncredit: Rob O’Neal\nX\nThough Christopher Peterson is perhaps best known for his live show “Eyecons” which he’s performed at La-Te-Da since 2001, he is also a passionate advocate for community causes. His charitable efforts as a comedian, impersonator and master of ceremonies have benefitted many organizations over the past two decades including AIDS Help, Equality Florida, Special Olympics, Key West Business Guild, The Studios of Key West, Queen Mother Pageant, Royal Coronation and many others. He is tireless in his devotion to Key West and its motto of “One Human Family.” Peterson’s Key West roots run deep. He arrived in Key West in 1998 with his husband of 37 years, the late James Mill. His extraordinary talents were recognized immediately, and he has become a local legend as one of the foremost female impersonators who sing “live.” He’s known for his masterful characterizations of Marilyn Monroe, Madonna, Joan Rivers, Reba McEntire, Bette Midler, Tina Turner, Julie Andrews, Barbra Streisand, Liza Minnelli, Judy Garland, Cher, Bette Davis, Lucille Ball, Lady GaGa and others. In addition, his skills as a costume designer and fabricator are unparalleled, manifesting in both his stage performances and charitable work. He is featured in the award-winning documentary “We’re Funny That Way,” which detailed the first gay and lesbian comedy festival in Canada and was later released on Showtime, Cinemax and HBO.\nimage\ncredit: Johnny White\nX\nLynn Kaufelt, a third generation Japanese American, was born and raised in Los Angeles, CA. After marrying novelist David A. Kaufelt and giving birth to their son, Jackson, the family divided their time between Manhattan, Sag Harbor, Long Island, and Key West. Her love for the Keys is unmistakable from her tireless work and support for Monroe County arts and service organizations.\nWatch her acceptance speech here.\nX\nBen and Helen Harrison have served as advocates and mentors to countless artists, writers, and musicians. In fact, over the past 35 years, Harrison Gallery has represented 172 artists and is widely recognized for the eclectic contemporary works exhibited inside its walls.\nThe Studios of Key West is grateful to Helen and Ben for all they’ve contributed to our community, helping to grow and preserve Key West’s reputation as an island of the arts.\nWatch a video about the Harrisons here.\nX\nWe couldn’t be happier to announce Rosi Ware as the recipient of the 2024 Golden Mango Award! We can’t think of anyone who has been as active in the community as Rosi Ware has. She was Chair or President of the Key West Garden Club for over 20 years, worked tirelessly with the MARC House, an organization for physically and mentally challenged adults, and she was the first President of The Studios of Key West, overseeing the exponential growth those early years from small island art center to the thriving hub we are today. And to add even more, she has been a board member on the Community Foundation of the Florida Keys, an active advisor for Arts in Public Places, and a member of the personal advisory team to Mayor Teri Johnston. No wonder she was honored with “Humanitarian of the Year” in 2013 by the Red Cross.\n(photo by Mark Hedden)\nWatch a video about Rosi here.\nX\nFor all the big wonderful ways that Tony Falcone has contributed to the community (Fast Buck Freddie’s, Fantasy Fest, saving the Strand sign, preserving the historic Key West Bight), he’s helped in a thousand quiet ways too. From supporting and encouraging artists to promoting a seemingly endless spirit of fun, from dedicating his time to community groups to working for a brighter future for the island while sustaining the things that count, Tony has been a fierce advocate for Key West. Passionate. Generous. Creative. And a whole lot of fun. There couldn’t be a person more deserving of the 2023 Golden Mango Award than Tony Falcone.\nWatch a video about Tony here.\nX\nMonica Lopez De Victoria (b. 1980, Gainesville, FL, USA) is a multi-disciplinary artist and performer in Artistic Synchronized Swimming. For the past 20 years Monica has woven these two art forms together. Her colorful geometric aquatic videos, performances, and textiles investigate emotional volume in space and movement in the 4 dimensions.\nMonica’s art work has been featured in international exhibitions such as “Uncertain States of America: American Art in the 3rd Millennium” curated by Hans Ulrich Obrist, Daniel Birnbaum, and Gunnar B. Kvaran, the Moscow Biennale of Contemporary Art, and PERFORMA in NYC by Roselee Goldberg. Her work has been seen and written about in L’Officiel magazine, The Guardian, STEP Inside Design, the New York Times, the Wall Street Journal, Vogue Italia, and on the cover of ARTnews magazine.\nMonica’s artwork also is a part of permanent collections of the Van Abbe Museum in the Netherlands and the Perez Art Museum Miami as well as other public and private collections. Monica has participated in residencies in Canada, New Zealand, Mexico, and the USA and has recently been supported by the Bauhaus Foundation for residency projects in Germany and South Korea.\nartist photo by Thomas Meyer\nX\nWilliam Kwamena-Poh is a native of Ghana, West Africa. He came to the United States in the early 1980’s and has resided in Alabama, Washington DC, Chicago, IL and has called Savannah, GA home since 1995. William is a self taught artist who paints with gouache, also known as opaque watercolor; the same medium used by the late, great African American artist, Jacob Lawrence and also experimented with by Dali, Picasso, and Klimt. According to Ralph Mayer’s Artist Handbook, “gouache paints are opaque and have (or should have) a total hiding power, and because they do not become progressively transparent with age as oil have a tendency to do…gouache has a brilliant light-reflecting quality of a different and distinct nature; it lies in the paint surface itself; its whiteness or brightness comes from the use of white pigments.”\nThis density and opacity of gouache allows William to capture and give the viewer a small window into his beautiful and wonder-filled homeland. “The sun’s strength is ever present, providing a colorful environment which is strongly reflected in Ghana culture and clothing,” says William. On his visits home he takes lots of photographs of places he grew up in and then sketches them freehand onto tracing paper so that he can best portray the natural and original feel of the scenes. He then transfers the sketched and corrected images onto heavier watercolor paper which permits him to implement numerous lifts and scrubbing to achieve the desired textures and emotional qualities of the scene.\nWilliam is internationally known for his series images of Women, Fisherman, Children and Market Scenes. His work is collected by private and well-known public figures throughout the United States and abroad (i.e., Academy Award winning Actor and Director, Forrest Whitaker; Actress, Angela Bassett; NBA Star, Tim Hardaway, just to name a few). Corporate collections include: Prudential, DuSable Museum, Disney Corp., Amoco Corp., Ford Motors, BET and Luster Products. Donated works include an original exclusively created and donated for auction to the Health and Educational Relief Organization (H.E.R.O.) for their 2014 annual fundraising gala in NY.\nWilliam’s father was a notable history professor who spent most of his teaching career at the University of Science and Technology in Kumasi, Ghana. He came to the U.S. in the early 1980’s as a Fulbright Scholar and taught African history at Talladega College. He brought young William with him, where he received his B.A. in Sociology. His father was aware of William’s budding artistic gift which was an inheritance from William’s grandfather, who was an art teacher. However, his father hoped William would follow in his footsteps sharing the history of his people…a wish William vehemently protested initially. But divine intervention saw his father’s wish, William’s protest and inherited gift through a slightly different lens. William walks in the footsteps of his ancestors and passionately shares the history of his people and homeland with his paint brush. This past February, during the week of William’s birthday he returned home for the ceremonial celebration of his father’s life and burial. While he was/is saddened by his father’s earthly departure, he found this trip home spiritually uplifting. He basked in the reminiscing of his father with family, friends, colleagues and town folk who paid such moving tributes that are forever etched in his heart. But also on this trip home, William celebrated his birthday and the life of his father, the man who had the great foresight to bring him to the U.S. for the opportunity to embrace, cultivate and share his gift of art with the masses.\nX\nKat Ryals (b. 1988 in Jonesboro, AR) is an artist, entrepreneur, curator and photographer based in Brooklyn, NY. Her mixed media artworks blend photography, craft & sculpture processes, textile materials, and found object assemblage. Ryals received a BFA in Photography from Savannah College of Art and Design and an MFA in Visual Art & an Adv. Certiﬁcate in Museum Education from Brooklyn College. She has shown her work nationally, including recent two person shows at Elijah Wheat Showroom and Ortega Y Gasset Projects, in group exhibitions with NADA, The Every Woman Biennial, ChaShaMa, Ortega Y Gasset Projects, and The Wassaic Project, and in solo booths at SPRING/BREAK Art Show. Her first solo exhibition will take place at 550 Gallery in 2025. Ryals was a 2024 artist-in-residence at the Museum of Arts & Design in NYC and has also attended residencies and fellowships at The Wassaic Project, ChaNorth, The Peter Bullough Foundation, and the Vermont Studio Center. She is a 2022 Joseph Robert Foundation grant recipient, and has been featured in\nThe New York Times\n,\nWhite Hot Magazine\n,\nartnet\n,\nForbes\n, and\nHyperallergic\n.\nartist photo by Tiffany Smith\nX\nAndrew Russell is a writer and director who often creates new work for theatre often inspired by real-life events, including\nStu for Silverton\n(Intiman Theatre);\nJohn Baxter is a Switch Hitter\n(Intiman Theatre);\nFull Gallop\n(The Old Globe); and Sara Porkalob’s\nThe Dragon Cycle\n, featuring\nDragon Lady\n(Intiman Theatre, American Repertory Theatre, Marin Theatre Company, Pittsburgh Public Theatre, The Geffen Playhouse),\nDragon Mama\n(American Repertory Theatre, Diversionary Theatre, Williamstown Theatre Festival), and\nDragon Baby\n. As Producing Artistic Director of the Tony Award–winning Intiman Theatre in Seattle from 2011-2017, Andrew played a critical role in reorganizing and reopening the theater after its closure in 2011. He is a graduate of Carnegie Mellon School of Drama. @heyheyandyk &\nwww.andrew-russell.com\nartist photo by JJ Geiger\nX\nRehman’s first novel,\nCorona\n, was chosen by the NY Public Library as one of its favorite books about NYC. She’s co-editor of\nColonize This! Young Women of Color on Today’s Feminism\nand author of the collection poetry\nMarianna’s Beauty Salon\n. Her new novel,\nRoses, in the Mouth of a Lion\n, is a modern classic about what it means to be Muslim and queer from a Pakistani-American community in Queens.\nRoses\nwas noted as a Best Book and Editor’s Choice by\nThe New Yorker\n,\nThe Washington Post\n,\nLos Angeles Times\n,\nPeople Magazine, Good Morning America, Ms. Magazine\nand more.\nartist photo by Andrea Dobrich\nX\nNancy Andrews makes films, drawings, music, books and objects. Andrews is a John Simon Guggenheim Foundation Fellow in filmmaking. The Museum of Modern Art has collected six of her films, and her work is in the collections of the Art Institute of Chicago, and Franklin Furnace Archives. Her first feature film,\nThe Strange Eyes of Dr. Myes\n, premiered at International Film Festival Rotterdam in 2015. This project was then developed as a web series when it was one of ten projects chosen to participate in Independent Film Project’s (IFP) Screen Forward Labs and subsequently,\nThe Strange Eyes of Dr. Myes\nweb series (YouTube) won the 2017 Gotham Award for Breakout Series (short).\nThe Museum of Modern Art, Pacific Film Archive, Anthology Film Archives, Flaherty Seminars, Ann Arbor Film Festival, Film on the Rocks- Thailand, and others have presented her work. Her work was featured in the 2013 deCordova Biennial and Portland Museum of Art Biennial and a solo show at Maine’s Center for Contemporary Art (2023).\nShe is a participant in Artists in Context’s “Artists’ Prospectus for the Nation” in the category of health, where she and other artists are bringing their aesthetic modes of inquiry to real-world situations. Andrews is on faculty at College of the Atlantic.\nartist photo by Corrine de Korver\nX\nVern Thiessen is one of Canada’s most produced playwrights. His plays have been seen across Canada, the UK, United States, Europe, Australia, New Zealand, and Asia and been translated in five languages.  His works include The Divners, Of Human Bondage, Vimy, Einstein’s Gift (GG winner), Lenin’s Embalmers (GG finalist), Apple, and Shakespeare’s Will. He has been produced off-Broadway five times. Vern is the recipient of numerous awards, including the Dora and Sterling awards for Outstanding New Play, The Carol Bolt Award, the Gwen Pharis Ringwood Award, the City of Edmonton Arts Achievement Award, the University of Alberta Alumni Award of Excellence, The Canadian Jewish Playwriting Competition, and the Governor General’s Literary Award for Drama, Canada’s highest honour for a playwright. He was also a finalist for the Siminovich Prize in Playwriting. Vern received his B.A. from the University of Winnipeg and an M.F.A. from the University of Alberta. He has srvedas president of both the Playwrights Guild of Canada and the Writers Guild of Alberta. For six years he served as Artistic Director of Workshop West Playwrights Theatre, one of Canada’s leading new play companies. He is married to acclaimed screenwriter and novelist Susie Moloney.\nwww.vernthiessen.com\nX\nSandra Jackson-Opoku is the author of the award-winning novel,\nThe River Where Blood is Born\nand\nHot Johnny and the Women Who Loved Him,\nan\nEssence Magazine\nBestseller in Hardcover Fiction. Her fiction, nonfiction, poetry, and dramatic works are widely published and produced, appearing in\nMidnight & Indigo, Aunt Chloe, Another Chicago Magazine, New Daughters of Africa, Adi Magazine, Africa Risen: A New Era of Speculative Fiction, Adi Magazine\n,\nAbout Place Journal,\nthe Chicago Humanities Festival, Lifeline Theatre, and others. She also coedited the anthology,\nRevise the Psalm: Work Celebrating the Writing of Gwendolyn Brooks\n.\nProfessional recognition includes a National Endowment for the Arts Fellowship, the American Library Association Black Caucus Award, the Chicago Esteemed Artist Award, a Lifeline Theatre BIPOC Adaptation Showcase, the Globe Soup Story Award, the Plentitudes Journal Prize, a Circle of Confusion Writers Discovery Fellowship, the Iceland Writers Retreat Alumni Award, a Pushcart Prize nomination, and the Casa África Purorrelato Prize. She placed as a quarterfinalist in the Stage 32 Springboard Diversity Screenwriting Competition and Roadmap Writers Short Story Competition.\nSandra Jackson-Opoku taught literature and writing at the University of Miami, Columbia College Chicago, and Chicago State University. She presents workshops, readings, and literary events worldwide.\nX\nRachel de Cuba is an interdisciplinary artist raised in Sebastian, FL. She received her BFA in Studio Art from Flagler College in 2013 and her MFA in Digital Art from Indiana University in 2019. She received recognition for her thesis work with Grant awards from Indiana University. In 2019 she was invited to create new media artworks for the New Orleans Film Festival with support from the Andy Warhol Foundation. Her mixed media work has been exhibited nationally and internationally, as well as selected for publication in New American Paintings Southern 2022 Edition. Her work has been selected for\nSkyway 2024: A Contemporary Collaboration\nwith an invitation to exhibit at The John and Mable Ringling Museum of Art in Sarasota, Florida. Rachel de Cuba is currently an Assistant Professor of Visual Arts at Eckerd College in St. Petersburg, Florida.\nX\nGlenn Weiss is a public art critic, producer and artist currently studying the impact of architects, designers and digital fabricators on the world of public art.  He has managed public art programs in Times Square, Seattle and Florida including Broward County and Jacksonville and wrote several public art master plans including Miami Beach.  He served as an architecture critic for Seattle Magazine, Seattle Post-Intelligencer and ARCADE and blogged on public art for ArtsJournal.com. Special projects include the Delray Beach Cultural Loop with Rick Lowe, the Boynton Beach Kinetic Biennial, the Sealevel Rise Rauschenberg Residency, the Times Square Valentine Heart, Competition Diomede with Union of Soviet Architects, Adam’s House in Paradise and Homeless at Home. He professionally began in NYC as the co-director/curator for the Storefront for Art and Architecture and the curator for architecture at PS1 (now PS1/MoMA) after securing a Master of Architecture at Columbia University. He lives with his wife Maria Foladori Weiss in Delray Beach, Florida and teaches architecture theory at Florida Atlantic University.   More details available at\nwww.glennweiss.com\nand photography on instagram at @glennweiss\nX\nMirena Suarez is a Cuban-born multimedia artist. She received her Bachelor in Arts degree with a minor in Printmaking from the Higher Institute of Arts in Havana. She moved to the United States and furthered her studies at Florida International University and NOVA Southeastern University. Her work reflects on the atemporal universal issues of identity, connection, and change. Through a variety of media that includes mainly tile mosaic, printmaking, drawing and photography, the artist explores philosophical questions associated with the concepts of loss, memory, conception, survival, fragility, perception of time, social relationships and dynamics, and emotional communication as originators of a visual dialogue that expresses the thoughts, worries, perceptions, and the constant internal fights that she experiences. This standpoint goes beyond being auto-referential and becomes a personal expression of the universal query that rules the dynamics inherent to modern life. Mirena has extensively exhibited her work around the world, and has been awarded numerous prizes and recognitions for her artwork. She currently works as a Visual Arts teacher for Miami-Dade County Public Schools. She lives and works in Miami, FL.\nX\nKarin Lin-Greenberg’s first story collection,\nFaulty Predictions\n, won the Flannery O’Connor Award for Short Fiction, and her second story collection,\nVanished\n, won the Prairie Schooner Raz-Shumaker Book Prize. Her novel\nYou Are Here\nwas published by Counterpoint Press in 2023 and was an Indie Next pick from the American Booksellers Association. She’s received a Pushcart Prize and her stories have appeared in\nThe Chicago Tribune\n,\nNew England Review\n,\nThe Southern Review\n,\nStory\n,\nVirginia Quarterly Review\n, and elsewhere. She teaches creative writing at Siena College in upstate New York and also teaches fiction in Carlow University’s low-residency MFA program.\nX\nRuth Jeyaveeran uses textiles to examine a shared history of alienation and dissociation. In her soft sculptures and fiber-based installations, the boundaries between human, animal, and flora dissolve to tell a story of isolation, migration, and evolution.\nJeyaveeran’s first solo show,\nSoft Remains\n, was exhibited at Field Projects in 2023. Other notable exhibitions include\nFelt Experience\nat the Brattleboro Museum and\nCommunion\n, a solo installation at Main Window Dumbo. Her work has been featured at Smack Mellon, ABC No Rio, Westbeth Gallery, The Yard, Ely Center of Contemporary Art, The Border Project, and Bronx Art Space, among others.\nJeyaveeran has been awarded residencies from the Lower Manhattan Cultural Council, Residency Unlimited, Lighthouse Works, Marble House Project, Jentel Foundation, Willapa Bay, Virginia Center for the Creative Arts, La Napoule Art Foundation, and PADA Studios. She is an Associate Professor of Textile Design at the Fashion Institute of Technology.\nX\nNya Patrinos centers her art on giving voice to the voiceless, telling the stories of people and places that have been forgotten or left unexplored, and reinterpreting religious texts, myths, and folktales through a modern lens. As an artist and surface designer, Nya explores the realms of spirituality and identity, as well as cultural intersections. History, memory, light, wind, climate, temperature, the moon, and stars all form the tapestry of her artistry, weaving together to chronicle a cohesive story.  Nya received an Emmy nomination in Art Direction/Set Decoration for the TV series\nTransparent\n.  W\nebsite:\nwww.nyapatrinos.com\nX\nMorgan Hill is a sculptor and jewelry designer whose work draws on a wide range of aesthetic and conceptual influences from 90’s pop culture, campy cinema, and costume design to her Southern, Christian upbringing and experiences as the only female child in an extended family of farmers in Arkansas. Her longing to break the silence surrounding culturally censured topics drives her to create work on themes of illness, abuse, depression, and suicide, as well as their counterparts of rebirth, healing, and empowerment. On the lighter side, her jewelry brand\nBad Habits by Morgan Hill\ncelebrates the pleasure of excess and indulged desires.\nMorgan’s formal art education began at the Memphis College of Art where she focused on drawing. She also studied interior design and ultimately earned a BFA in Woodworking and Furniture Design from the University of Arkansas Little Rock. She was a Core Fellow at the Penland School of Craft from 2015-2017 where she worked with renowned artists and designers and studied techniques ranging from chainsaw carving to metalwork to neon tube bending. In 2018, she was an ITE Windgate Fellow at the Center for Art in Wood, and in 2022, she was awarded the Chrysalis Award by the James Renwick Alliance. Her work is carried in galleries across the US and internationally. She creates her work at Treats Studios in Spruce Pine, NC, a studio cooperative she co-founded.\nX\nJoy Castro is the award-winning author of the 2023 historical novel\nOne Brilliant Flame\n, set amidst the nineteenth-century anticolonial Cuban insurgent community in Key West;\nFlight Risk\n, a finalist for a 2022 International Thriller Award; the post-Katrina New Orleans literary thrillers\nHell or High Water\n, which received the Nebraska Book Award, and\nNearer Home\n, which have both been published in France by Gallimard’s historic\nSérie Noire\n; the story collection\nHow Winter Began\n; the memoir\nThe Truth Book\n; and the essay collection\nIsland of Bones\n, which received the International Latino Book Award. She is also the editor of the craft anthology\nFamily Trouble: Memoirists on the Hazards and Rewards of Revealing Family\nand the founding series editor of Machete, a series in innovative literary nonfiction at The Ohio State University Press. Her work has appeared in venues including\nPloughshares\n,\nThe Brooklyn Rail\n,\nSenses of Cinema\n,\nSalon\n,\nGulf Coast\n,\nBrevity\n,\nAfro-Hispanic Review\n,\nLos Angeles Review of Books\n, and\nThe New York Times Magazine\n. A former Writer-in-Residence at Vanderbilt University, she is currently the Willa Cather Professor of English and Ethnic Studies (Latinx Studies) at the University of Nebraska-Lincoln, where she directs the Institute for Ethnic Studies. With translator and co-editor Rhi Johnson, she edited the bilingual edition of the 1918 poetry collection\nLágrimas y flores\nby Feliciano Castro, forthcoming in October, 2024 from the University Press of Florida.\nX\nBarbara Boissevain is a California based contemporary visual artist and photographer whose work focuses on the impact of human activity on the environment. Nature’s ability to regenerate and reclaim human altered landscapes is a central theme in her work.\nBoissevain was born in Cleveland, Ohio and raised in Silicon Valley. She studied painting at Parsons School of Design in New York before immersing herself in photography, earning a BFA from the San Francisco Art Institute and an MFA from San Jose State University.\nHer work has been exhibited in solo and group exhibitions throughout the United States and Europe, including Mémoire De L’Avenir, Paris; the Institute of Contemporary Art, San Jose, CA; Galerie Numero Cinq, Arles, France; and the Academy of Fine Arts in Krakow, Poland. From 2014 to 2021, she was an artist in residence with the City of Palo Alto’s Cubberley Artist Studio Program. In 2018 she was an artist in residence at Galerie Huit in Arles, France. She was invited to Atelier 11 for a solo residency through L’AiR Arts international residency program in Paris in July 2022. In the Summer of 2023 she was honored to participate in the Cycladic Arts Residency in Paros Greece.\nIn 2009 Boissevain published her first book, titled Children of the Rainbow, which documented the humanitarian challenges facing Quechua communities in Peru due to climate change. In 2021 her work was featured on NPR’s “The Picture Show” in conjunction with the UN Climate Change Summit in Glasgow, Scotland. She was also featured on the PBS News show Something Beautiful in 2022.\nHer book “Salt of the Earth” was published by Kehrer Verlag in the Fall of 2023, and was chosen as one of Wired Magazine’s best photo books of 2023.\nBoissevain’s photographs are in numerous public and private collections, including the Smithsonian National Air and Space Museum, Washington D.C.; the Google Corporate Art Collection, Sunnyvale, CA; and the De Pietri Artphilein Foundation, Lugano, Switzerland\nX\nR. Eric Thomas (he/him) is a national bestselling author, playwright, and screenwriter. His books include,\nHere for It, or How to Save Your Soul in America,\nwhich was featured as a Read with Jenna pick on NBC’s\nToday,\nthe YA novel\nKings of B’more\n, a 2023 American Library Association Stonewall Honor book\n,\nand\nCongratulations, the Best Is Over!\n, an instant USA Today Bestseller. He also writes the daily, nationally syndicated advice column “Asking Eric.” For his playwriting, Eric has won the Barrymore Award for Best New Play, the Dramatist Guild Lanford Wilson Award, the Lambda Literary Award, and was a finalist for the O’Neill Conference and the Steinberg/ATCA New Play Award. On screen, he wrote for the Peabody Award-winning series\nDickinson\non AppleTV+ and\nBetter Things\non FX and is currently developing multiple film and television projects, including a half hour comedy based on his memoir. Off the page, Eric is also the long-running host of The Moth StorySlams in Philadelphia, and has been heard multiple times on The Moth Radio Hour. Website:\nrericthomas.com\nX\nLisa Morehouse is an award-winning public radio reporter and editor. Her series\nCalifornia Foodways\nis a county-by-county exploration of stories at the intersection of food, culture, history, economics, labor and the environment. The stories air on KQED’s\nThe California Report Magazine\n, national shows, and on the California Foodways\npodcast\n. The series received a national Edward R. Murrow Award and four James Beard nominations, and Morehouse was named a fellow for the UC Berkeley-11th Hour Food and Farming Journalism Fellowship, and Les Dames d’Escoffier San Francisco Karola Saekel Craib Excellence In Food Journalism Fellowship.\nMorehouse is the Senior Editor for KALW Public Radio’s news magazine, Crosscurrents, where she helps train new audio journalists. Her first career was in public education, teaching middle school in rural Georgia, building an educational non-profit in Arizona, and spending a decade teaching high school in San Francisco.\nX\nLee Jensen is a Danish textile artist. Lee grew up in Copenhagen, Denmark, and now lives and works in Queens, New York. She holds a BFA degree from the School of Visual Arts in New York. Lee Jensen creates contemporary abstract quilts and hand-sewn stretched textile pieces. Her work is influenced by her urban environment and by a life-long connection to sewing and textiles.\nJensen is the recipient of the New York Foundation for the Arts (NYFA)/Queens Art Fund 2024 New Work Grant. In 2023-24 she was awarded participation in NYFA’s Immigrant Artist Mentoring Program. Her work has been featured in\nHyperallergic\nand\nQueens Chronicle.\nX\nChristopher Castellani has published five books, most of which center on the Italian, Italian-American, and/or queer experience. His most recent novel is\nLeading Men\n, for which he received Fellowships from the Guggenheim Foundation, MacDowell, and the Massachusetts Cultural Council.\nLeading Men\nwas published in February 2019 by Viking Penguin, and is currently being adapted for film by Peter Spears (Oscar-winning producer of\nNomadland\n) and acclaimed Italian director Luca Guadagnino (\nCall Me By Your Name\n).\nThe Art of Perspective: Who Tells the Story\n, a collection of essays on point of view in fiction, was published in 2016 by Graywolf Press, and is taught in many creative writing workshops.\nHis first novel,\nA Kiss from Maddalena\n(Algonquin, 2003) won the Massachusetts Book Award in 2004; its follow-up,\nThe Saint of Lost Things\n(Algonquin, 2005), was a BookSense (IndieBound) Notable Book; the final novel in the trilogy,\nAll This Talk of Love\n(Algonquin, 2013), was a\nNew York Times\nEditors’ Choice and a finalist for the Ferro-Grumley Literary Award.\nChristopher is currently on the faculty and academic board of the Warren Wilson MFA program and the Bread Loaf Writers Conference. Since 2019, he has chaired the Writing Panel at YoungArts, aka the National Foundation for Advancement in the Arts. For nearly twenty years, Christopher was in executive leadership at GrubStreet, where he founded the Muse and the Marketplace national literary conference and led the development of numerous artistic programs for adults, teens, and seniors.\nThe son of Italian immigrants and a native of Wilmington, DE, Christopher was educated at Swarthmore College, received his Masters in English Literature from Tufts University, and a Master of Fine Arts in Creative Writing from Boston University. He lives in Boston and Provincetown, MA, where he is completing his fifth novel with the support of a Literature Fellowship from the National Endowment for the Arts.\nX\nAndrew Shaffer is the\nNew York Times\nbestselling author of\nHope Never Dies: An Obama Biden Mystery\n, the children’s picture book\nMothman’s Merry Cryptid Christmas\n(which he also illustrated), and over two dozen other books in multiple genres, including mystery, horror, and humor. He is a five-time Goodreads Choice Award nominee and a two-time finalist in the Humor category. His most recent book is the fully illustrated\nLiterary Cats Coloring Book,\nfeaturing feline versions of famous authors from “Jane Pawsten” to “Furnest Hemingway.” An Iowa native and frequent visitor to the Keys, Shaffer lives in Louisville, Kentucky, with his wife, novelist Meg Shaffer.\nX\nDylan Mabika is a 23 year old passionate hyperrealism artist on a journey of self-discovery and expression. Despite having no academic background in art, he has dedicated himself to creating art that resonates with the heart and speaks to the soul. For Dylan, art provides peace to his soul and mind unlike anything else, and it has become his passion.\nBorn and raised in Zimbabwe, Dylan has always been drawn to art, evident from his early days in primary school where he started and loved drawing. At the age of 16, he decided to take his art seriously after being inspired by an older student who refused to share his skills and knowledge. This sparked Dylan’s determination to teach himself to draw, marking the beginning of his artistic journey.\nIn 2017, Dylan created his first drawing of a human face, and in 2018, he passed his O’ level with 7 subjects. Due to financial constraints, he couldn’t attend an art school or a high school with art as a subject, so he refined his drawing skills on his own. In 2019, Dylan entered his first art competition and won a gold medal for coming first place in his age group in a national competition, also being announced as the best overall in the art category.\nSince then, Dylan has experimented with various mediums like charcoal pencils, watercolor pencils, colour pencils and pastel color pencils and he is eager to learn more. He dropped out of school in 2019 to focus on art and support his family financially. Dylan’s life experiences and his aspirations inspire him to create art that provides a space for reflection and imagination, where each viewer can find a piece of themselves reflected back.\nDylan hopes to own a gallery with a spacious studio equipped with art materials and a positive atmosphere, where he can work as an artist and photographer. He also aims to give back to the less privileged artists in schools like his, providing them with art materials and knowledge. Dylan believes that art has the power to heal, inspire, and transform, offering solace and hope in times of uncertainty and despair.\nX\nDeborah Zlotsky received a 2019 Guggenheim Fellowship and NYFA Artist Fellowships in Painting in 2012 and 2018. Her work is in a variety of public, private and corporate collections in the US and abroad and she has been awarded recent residencies at MacDowell, Yaddo, the Bogliasco Foundation, Two Coats of Paint, and the Bemis Center. Zlotsky is represented by Markel Fine Arts and McKenzie Fine Art, both  in New York, Robischon Gallery in Denver, and Sandler Hudson Gallery in Atlanta.  She has a BA in art history from Yale University and an MFA in painting and drawing from the University of Connecticut. She teaches at the Rhode Island School of Design and lives in the Hudson Valley.\nX\nAllyson Morgan is an award-winning writer, producer, and performer. Allyson’s first short film\nNeed For Speed (Dating)\npremiered at the Tribeca Film Festival, while her next short,\nSitting\n, won “Outstanding Narrative Short” at Tallgrass Film Festival.\nFirst Date\n, her short film produced by 20th Digital Studio, is currently airing on Hulu in their “Bite Size Halloween” series. Allyson adapted\nFirst Date\ninto a feature film for Hulu, titled\nJagged Mind\n, which the LA Times called “edgy” and “powerful.” Her newest short,\nThe Ghost\n, which also serves as her directorial debut, made its world premiere at the RiverRun International Film Festival in 2024. She has also been selected for the New York Stage and Film Filmmakers’ Workshop, been awarded “Best Teleplay” at Omaha Film Festival, twice been a top ten Finalist for Cinequest, a Finalist at Stowe Story Labs, and a Semi-Finalist at Austin Film Festival. Additionally, she has been awarded an Ensemble Studio Theatre/Alfred P. Sloan Foundation Commission, a Djerassi Artist Residency (California), an NG Art Creative Residency (France), a Monson Arts Residency (Maine), a Vashon Artist Residency (Washington), a Wassaic Project “Haunted Mill” residency (NY),  and multiple Juno Leadership Residencies through the Omega Institute (NY). Allyson has two novels,\nDon’t Want To Remember You\nand\nThe Perfect Place\n, currently available through Tapas Media. She is represented for literary by Heroes and Villains Entertainment. More:\nallysonm.com\nX\nBrittany Reeber is a writer and director living in NYC whose work spans narrative, music video, documentary and commercial mediums.\nOriginally from the Sunshine State, she has inherited an affection for oddball characters and humid climates. Her work reflects the humor, tenderness, and spirit found in the lesser known corners of America — sometimes, there’s a choreographed dance sequence.\nShe has received grants and residencies from American Documentary, Kodak, The Austin Film Society, Caldera Arts, Cucalorus, The Bend Film Festival, The Studios of Key West, among others. Her most recent film,\nSTUCK\n, an existential stoner comedy, just finished a successful run on the film festival circuit after premiering at the Mammoth Lakes Film Festival in 2023, and her feature script,\nSALT SPRINGS\n, a Florida climate dramedy, is currently in development.\nHer music videos have appeared in\nPitchfork, Rolling Stone Magazine, NPR\nand\nBillboard Magazine\n. In 2023, she directed NYC comedian Fareeha Khan’s solo show\nI ACTUALLY DON’T FEEL THAT GOOD\nto sold out audiences.\nWhile at The Studios of Key West, she’ll continue to explore the ways in which the Florida landscape, culture and environmental conflicts, play a vital role in her work.\nX\nJohn Graham’s\never-diversifying visual art practice includes printmaking, artist’s books, painting, drawing, installations, and digital imaging. This artwork has been widely exhibited in North America, Europe and Asia. John is also the writer, producer, director and editor of 10 short films that have been screened at over 220 venues in over 40 countries. Many of these arthouse films have won awards or received nominations for awards. STILL HERE / IMMERDAR (2024) is his 10th short film that poetically explores the theme of dying beautifully.\nX\nAndrée B. Carter was born and raised in New Orleans. She also lived in Seattle and Los Angeles, but now resides full-time in Palm Desert. Andrée received an MFA from The University of New Orleans and a BS from Loyola University in New Orleans (Cum Laude). She also studied art history in Florence, Italy through a Tulane University summer program.\nIn addition to numerous solo and group exhibitions, Andrée has been honored with painting fellowships from the Bau Institute held in Otranto, Italy; the Virginia Center for Creative Art, Amherst, VA; and the Ucross Foundation in Clearmont, WY. She is also a Kipaipai Fellow, a special program focusing on participants to build their professional network. Andrée’s latest residency was in November 2023 at the Cycladic Arts Residency on the Greek island of Paros.\nFurthermore, Andrée has received several accolades, including the Artistic Selection Award from the Korean Cultural Center, Los Angeles, CA and the Museum of Art and History, Lancaster, CA. In 2022, she received a Jurors award from the Artist Council Exhibition in Palm Desert. Andrée was also honored to be one of 30 artists chosen for the Rancho Mirage Festival of the Arts, in November 2022.\nAndrée’s was recently in an exhibition in Los Angeles at Gallery 825 called “Soul of a City.” This group exhibition of Swiss and American artists was also recently shown in Neuchatel, Switzerland. Andrée’s work is included in numerous private and public collections, most notably in the Ogden Museum of Southern Art, New Orleans, LA; Swedish Hospital, Seattle, WA; and the Iberia Bank, New Orleans and Shreveport, LA.\nX\nFaith Adiele\nis the author of four experimental chapbooks about her Nigerian-Nordic-American heritage and\nMeeting Faith\n, an award-winning account of becoming Thailand’s first Black Buddhist Nun that is widely taught in American universities. Her media credits include\nMy Journey Home\n, a PBS documentary about finding her family, HBO-Max’s\nA World of Calm\n, and\nSleep Stories\nfor the Calm meditation app. Her essays appear in\nO: The Oprah Magazine\n,\nEssence\n,\nOkayAfrica\n,\nSmithsonian Folklife\n, and numerous anthologies. She founded the nation’s first writing workshop for travelers of color and African Book Club at San Francisco’s Museum of the African Diaspora. Named one of\nMarie Claire\nmagazine’s “Five Women to Learn From,” Adiele chairs the Writing & Literature Program at California College of the Arts and speaks and teaches around the world.\nX\nFranck Hodelin is an artist and interior designer from New York City . Straddling the boundary of realism and abstraction, his figurative oil paintings feature profoundly intimate portraits of men in an array of settings. In 2023, Hodelin was a recipient of the Warner Bros. Discovery 150 Grant. He also received grants from the New York City Artists Corps and a Queens Council on the Arts “New Works Grant” in 2020 to create a series of work that was featured in a solo show at Local Projects Gallery in Long Island City, NY.\nRecent exhibitions include a 2-person show at the Chashama Gallery in New York City; the Long Island City Artists “Heritage” group show at Queens College; Greene County Council on the Arts “New Perspective: Selected Works of Artists From the African Diaspora.” Franck received a BFA from Pratt Institute in Brooklyn, New York. He currently lives and works in Sunnyside, NY.\nimage: “Sit and Reflect” (oil paint on wood panel, 40 x 60″)\nX\nA multi-faceted force, Sarah Dahnke is a choreographer, director and arts educator deeply committed to encouraging communities to use performance to reclaim narratives stripped away by colonialism. As a practitioner, Sarah specializes in devised performance for stage and screen.\nSarah has also been a MAP Fund awardee, an NEA Our Town-funded resident artist, and an awardee of fellowships from Gibney’s Moving Toward Justice, Colt Coeur, Target Margin Institute, New Victory LabWorks, and Culture Push. She has received commissions from Little Island, PEN America and A Studio in the Woods and has been in residence at Abrons Arts Center and Brooklyn Studios for Dance. She was recently the Associate Director for the Off-Broadway play\nSTILL.\nShe was the 2022-23 Opera Columbus Directing Fellow and has gone on to direct opera productions of\nCarmen\nand\nHydrogen Jukebox.\nHer dance film work has been screened through the Dance Films Association, Tiny Dance Film Festival, DanceBarn Collective, BRIC, and Movies By Movers.\nShe is a graduate of ITP|NYU, where she specialized in studying the intersection of performance and technology.\nSarah is also the artistic director of Dances for Solidarity, a project that co-creates choreography with people affected by the criminal legal system and performs for public audiences as advocacy toward prison abolition. Learn more at\nsarahdahnke.com\nand\ndancesforsolidarity.com\n.\nX\nKota Bowen is an interdisciplinary artist based in Milwaukee, Wi specializing in ceramic sculpture. With a printmaking degree from University of Wisconsin- Milwaukee they have a rich background in drawing, and other narrative forms. They have ten years experience working professionally in clay and freelancing as an illustrator. Much of their work is inspired by mythology and classical paintings with a contemporary graphic twist.\nX\nJosh Aronson (b. 1994, Toronto, Canada) is a photographer based in Miami. He received his B.A. in Philosophy from Northwestern University. His work reclaims and redefines Southern manliness, presenting tender portrayals of young men against the backdrop of Florida’s landscapes. His photography emphasizes vulnerability, introspection, and emotional complexity, challenging dominant narratives of masculinity. Aronson’s visual storytelling is rooted in his own experiences growing up in Florida, where the natural environment and cultural history serve as constant inspirations.\nX\nJ Wortham (they/them) is a sound healer, reiki practitioner, herbalist, and community care worker oriented towards healing justice and liberation. They are also a staff writer for The New York Times Magazine, and co-host of the podcast ‘Still Processing,’ With Kimberly Drew, they co-edited Black Futures, a visual anthology and compendium of radical, imaginative, and provocative art by contemporary Black creators. J is also currently working on a book about the body and dissociation for Penguin Press. J mostly lives and works on stolen Munsee Lenape land, now known as Brooklyn, New York, and is committed to decolonization as a way of life.\nX\nEric Pankey, who received his MFA from the Iowa Writers Workshop in 1983, is the author of seventeen collections of poems:\nFor the New Year\n(Atheneum 1984), which was selected as the winner of the Walt Whitman Award by Mark Strand,\nHeartwood\n(Atheneum 1988), which was reissued by Orchises Press in 1998,\nApocrypha\n(Alfred A. Knopf 1991),\nThe Late Romances\n(Alfred A. Knopf 1997),\nCenotaph\n(Alfred A. Knopf 2000),\nOracle Figures\n(Ausable Press 2003),\nReliquaries\n(Ausable Press 2005),\nThe Pear as One Example: New and Selected Poems\n(Ausable Press 2008),\nTrace\n(Milkweed Editions 2013),\nDismantling the Angel\n(Free Verse Editions 2013), which won the New Measures Prize,\nCrow-Work\n(Milkweed Editions 2015),\nAugury\n(Milkweed Editions 2017),\nOwl of Minerva\n(Milkweed Editions 2019),\nAlias: Prose Poems\n(Free Verse Editions 2020),\nNot Yet Transfigured\n(Orison Books 2021),\nThe History of the Siege\n(Codhill Press 2024).  A collection of essays,\nVestiges: Notes, Responses, & Essays 1988-2018\nappeared from Parlor Press in 2019.\nHis poetry, essays, and reviews have appeared widely in such journals as\nThe Iowa Review, The Harvard Review, The Kenyon Review, The New Yorker, The New Republic, The New Yorker,\nand\nThe Yale Review.\nHis work has been supported by fellowships from John Simon Guggenheim Foundation, The National Endowment for the Arts, the Ingram Merrill Foundation, and the Brown Foundation.\nX\nErnest Gold is a successful writer and director, who has worked in the United States and Austrian film industries for over 15 years, specializing in creating outstanding genre movies and tv shows. His work includes character driven dramas, heartfelt comedies, as well as stunt and effect heavy action films. Ernest is the co-creator and writer of the first ever Austrian AMAZON PRIME VIDEO series\n“Beasts Like Us”\n, released in 2024. He’s the recipient of a Fulbright Scholarship, and alum of the prestigious NYU Tisch – School of the Arts and Filmacademy Vienna.\nX\nWhat’s Provided\nThrough generous sponsors we are able to provide the following extras to use during your residency:\nBEST OF KEY WEST RENTALS.\nGenerously provided your linens, bedding and towels.\nFORT ZACHARY TAYLOR STATE PARK.\nWe want you to visit the state park and beach as much as you’d like! Our pass unfortunately needs to be tied to a staff member, so you can coordinate a day to go together, or we’ve got a gift card you can use to visit on your own time. The card is in the PEAR House, be sure to bring it so you don’t have to pay the entry fee.\nKEY WEST YOGA SANCTUARY.\nFree yoga classes all month! Register for your first class online with code ‘PEAR’ then connect with staff to get set up with a full month at your first visit.\nYOGA ON THE BEACH.\nMeet at Ft. Zach Beach by 8:15am to flow with Nancy and Don. PEARs get your first class free!\nKEY WEST PUBLIC LIBRARY.\nWe’ve partnered with the library to offer you a library card to use during your stay. Key West Library has an extensive catalog of books and other media, plus e-books and audiobooks available for download and even some special events! Their calendar has more about what’s going on.\nLAZY DOG ADVENTURES.\nLazy Dog does it all – kayak and paddle board tours, rentals, lessons and classes, paddle yoga and fun boat adventures! They’ve offered a paddle pass for PEARs – simply inquire with staff about an available day and they’ll hook you up with a free rental.\nWE*CYCLE.\nThe fun way to get around town! Public transportation with 2 wheels. They provided your conch cruiser or tricycle.\nX\nApplication and Selection Process\nThe Studios accepts applications on a rolling basis from January-May of each year for the following residency season. The season runs from October-August. There is a $45 application fee to apply which supports the program.\nApplications are evaluated by selection committees comprised of working artists and professionals in the applicants’ respective fields of discipline under the five categories:\nVisual Arts, Literary Arts, Media Arts, and Musical Arts and Performing Arts.\nAcceptance to The Studios’ PEAR Program is based on the merit of past work and the potential for creative, intellectual and personal growth through the time and space to imagine new artistic work, engage in valuable dialogue and explore island connections.\nKey West’s official motto, “One Human Family” reflects our commitment to living together as caring, sharing neighbors dedicated to making our home as close to paradise as we can. To that end, we encourage artists of all races, nationalities, gender identities, sexual orientations, and abilities to apply.\nX\nAbout The Studios of Key West\nThe Studios of Key West’s mission is to support artists, inspire creativity and build community.\nThe Studios was founded with the vision of bringing world class artists to the island, connecting them with local audiences and artists, and offering space for both to explore their creativity. We’ve hosted Pulitzer prize winners, world renowned artists and musicians, and introduced thousands of students to different ways of seeing and working. Our Helmerich Theater stage bristles with talent, music from our rooftop concerts flood into the neighborhood, and every month hundreds of people visit The Studios to take in new experiences and catch up with old friends.\nRead more about who we are here.\nX\nExpectations\nYou’ll find that the Key West community is very welcoming to new people (especially creative ones!) – and there is never a shortage of things to do. Your time is yours to do with as you choose, of course, and we respect that you’ll need plenty of time to dream, reflect and create. We do ask that you join us at two events during your residency:\n“IN THE COURTYARD” RESIDENCY POTLUCK THIRD WEDNESDAYS, 6-8PM\nDepending on the time of year, a group of about 20-40 friends and community members gather together for an informal potluck and a chance to meet our residency artists. Guests bring a dish to share (bring whatever you’d like – from chips and salsa to your favorite recipe). About halfway through the night, each of the residency artists takes few minutes to introduce themselves and talk about their work or what they’re working on in Key West (remember, it’s very casual, so no PowerPoint presentations necessary!). Writers often like to read a very short bit of their work and artists often like to open their studios to show what they are working on – but neither is necessary, whatever you feel comfortable with.\nOPEN HOUSE EVENT FIRST THURSDAYS, 6-8PM\nFriends new and old are invited to join us for each month’s First Thursday Open House event, when we keep our lights on late and throw our doors open to celebrate the newest work in our galleries. Stop in to say hello, relax with a glass of wine on the rooftop terrace, tour the third floor artist studios and see the just-installed exhibitions in the Sanger, XOJ, Zabar Project and Zabar Lobby Galleries.\nX\nAbout Key West\nKey West is an island community, two miles by four miles wide, at the very end of the road. Most people get around on bicycle or foot, and the neighborhoods are compact and filled with lush gardens and tropical plant life. There are Cuban groceries and café con leche on every other corner, and a mix of Latin and Caribbean influences everywhere. Known for blue skies, open water and mangrove islands, and 80 degree days in winter, Key West is removed from the American mainland by 120 miles of bridges and small islands.\nLong a home to artists and creative people, the ghosts of Hemingway, Robert Frost, Elizabeth Bishop, Mario Sanchez, and Shel Silverstein still haunt our Old Town neighborhood. Flowers bloom year-round, and fruit trees proliferate. And on any given day, it’s not unusual to run into modern-day creative people, such as Judy Blume, Billy Collins, Jimmy Buffett, Meg Cabot, Terrence McNally, John Martini, Seward Johnson, or Annie Dillard.\nFor a small community, Key West is rich in cultural events, creative projects, and celebrations of every kind. The population is diverse and compassionate, and takes to heart the island’s famous motto: One Human Family, which reflects The Studios’ commitment to living together as caring, sharing neighbors dedicated to making our home as close to paradise as we can. Our creative community is proud of this special sense of place. We embrace an independence from the mainland, celebrate our tropical and Caribbean influences, and seek out artists and cultural leaders wanting to do the same—and gain the benefit of exile in the Conch Republic.\nX\nSPECIALTY HARDWOODS FOR SALE\nA limited selection of short length (4′ or less) specialty hardwoods (mostly Cuban Mahogany) can be purchased from the Woodshop. Email\nwoodshop@tskw.org\nfor inquiries.\nFor a wider variety in wood types and length, we recommend our friend on Big Coppitt, Mike. He has a great selection and is nearby. His phone number is (305) 797-5747.\n×\nWOODSHOP RULES\nNo jerks allowed.\nThe Woodshop is a shared space. Be mindful, respectful and patient with the people around you. Keep your space tidy and leave time to clean up before you’re done. The Woodshop Monitor is in charge, but is a human being too, so be nice.\nNo drinking or drugs\n. Consumption of alcohol or any substances which may impair judgment or coordination, including medications, are strictly forbidden while any tools are in use, including by others. Similarly, no one under the influence of substances consumed elsewhere is allowed in the Woodshop while tools are in use, including by others.\nKeep food outside\n. You can eat at the tables outside, but keep food and drink (except water) outside of the Woodshop.\nSupervision Required\n. The Woodshop may only be used in the presence of a Monitor who has been designated by The Studios.\nAuthorization Required\n. You may only use equipment and tools for which you’ve been authorized by a Woodshop Monitor.\nDress appropriately\n. Shoes with closed toes required while using tools. No dangling jewelry or clothing, and long hair should be pulled back. Eye covering is required while using power tools.\nKnow your materials.\nKnow whether any materials you use are toxic, corrosive or flammable. No pressure treated wood. Store and dispose of them properly. Not sure? Read the label or ask the Monitor.\nKnow where the First Aid Kid is\n. And report any injuries to the Monitor.\n×\nWOODSHOP TOOLS\nWhat We Have…\n36” Band saw (Northfield)\nDrill press (Delta)\n8” Joiner (Powermatic)\nPlaner (Newman)\nRadial arm saw (Dewalt)\nShaper-large (Powermatic)\nShaper-smaller (Grizzly)\n10” Table Saw (Powermatic)\nLathe\nTabletop sander\nPortable chop saw\nBlades – various kinds\nClamps – various kinds\nFasteners – various kinds\nHandheld drills\nHandheld jigsaws\nWork tables\n… And What You’ll Need\nSandpaper (can be purchased at the Woodshop)\nBlades and bits beyond ordinary use\nFasteners (eg. nails and screws) beyond ordinary use\n×\nHOW TO GET HERE\nAddress: 6810 Front Street, Key West, FL 33040\nWe’re located in Safe Harbor Marina on Stock Island, just down the docks from Hogfish Bar & Grill.\n×\nShop Time Rates\n$30/half day (up to 4 hours)\n$50/full day (up to 8 hours)\n$180/week (up to 5 days)\n$550/month\nPayments\nPay for your Shop Time\nonline using the link you receive, or by phone at 305-296-0458 during The Studios regular Box Office Hours (Tue-Sat, 10am-4pm). Bookings must be confirmed by payment\nat least 24 hours in advance\n.\nCancellations\nIf you need to cancel or change your time, email\nwoodshop@tskw.org\nright away.\nBookings may be cancelled and refunded up to 7 days prior to the booking.\nBookings may be changed to a later date at no additional cost, if notification is received at least 24 hours prior to the original booking.\nNo refunds will be issued if cancellation is not received at least 24 hours in advance.\n×\nHugh's View Rooftop\nWith one of the tallest buildings – and most spectacular views – in town, the\nHugh’s View rooftop terrace\nserves as The Studios’ creative space in the sky. The terrace sits four stories above street level and offers panoramic views of the island. The Kitwald Stage glows in the golden twilight of our sunset performances.\nHugh’s View offers:\n—Smaller audience sizes\n—Outdoor environment\n—Intimate experiences\n—A rooftop bar that opens one hour prior to show time\nX\nHelmerich Theater\nWith original seating from its days as a Masonic temple, the\nHelmerich Theater\nhas been updated to also include floor seating. As a black box theater, the set up is intimate but professional, and sets the stage for concerts and performances that leave guests feeling like they really got to know the performer.\nHelmerich Theater offers:\n—More space and comfortable chairs\n—Indoor comforts\n—Intimate experiences\n—A walk-up counter bar that opens one hour prior to show time\nX\nResidency Interest\nThe period for applying to 2021/22 residencies is now closed. We will begin accepting residencies for the 2022/23 season, which runs from September 2022-August 2023, in January 2022. If you would like to be notified by email when the application period opens again,\nplease fill out this form.\nX\ntest\nX\nMailchimp for WordPress v4.10.7 - https://wordpress.org/plugins/mailchimp-for-wp/\nLeave this field empty if you're human:\n/ Mailchimp for WordPress Plugin\nX\nShiftNav #shiftnav-main\nThe Studios of Key West\nLogin Here\nMuseum Hours and Admission\nExhibitions\nEvents\nClasses\nStudios/Residencies\nSupport\nBecome a Member, Donor or Patron\nOur Business Sponsors\nOur Patrons\nVolunteer\nBack\nBook a Private Event\n× Close Panel\n/.shiftnav-inner\n/.shiftnav #shiftnav-main",
      "emails": [
        "disrudjoris5@gmail.com",
        "hobbsart@bellsouth.net",
        "info@coccoandsalem.com",
        "info@tskw.org",
        "mpuppich@yahoo.com",
        "scottyking@sbcglobal.net",
        "wlancetaylor@gmail.com",
        "woodshop@tskw.org"
      ]
    },
    {
      "url": "http://tskw.org/who-we-are/",
      "is_candidate": false,
      "has_email": true,
      "text": "The Studios brings world class artists to Key West and promotes local artists. Offering art classes, concerts, theater, sunset happy hours, and galleries.",
      "emails": [
        "disrudjoris5@gmail.com",
        "hobbsart@bellsouth.net",
        "info@coccoandsalem.com",
        "info@tskw.org",
        "mpuppich@yahoo.com",
        "scottyking@sbcglobal.net",
        "wlancetaylor@gmail.com",
        "woodshop@tskw.org"
      ]
    },
    {
      "url": "http://tskw.org/events/past-events/",
      "is_candidate": false,
      "has_email": true,
      "text": "The Studios was founded with the vision of bringing world class artists to the island and promoting Key West artists. Our landmark Art Deco building is located just steps off Duval Street, and is the Key West attraction you don’t want to miss if you’re looking to connect with the creative spirit of the island.",
      "emails": [
        "disrudjoris5@gmail.com",
        "hobbsart@bellsouth.net",
        "info@coccoandsalem.com",
        "info@tskw.org",
        "mpuppich@yahoo.com",
        "scottyking@sbcglobal.net",
        "wlancetaylor@gmail.com",
        "woodshop@tskw.org"
      ]
    },
    {
      "url": "http://tskw.org/current-studio-artists/",
      "is_candidate": false,
      "has_email": true,
      "text": "Our Studio Artists have created a community that extends over the island. With painters, writers, musicians, sculptors and photographers crossing paths on a daily basis, strong connections are constantly being made and reinforced. The artists benefit from a continual exchange of creative energy, while the public benefits from the opportunity to visit 7 artists at our venue alone.",
      "emails": [
        "disrudjoris5@gmail.com",
        "hobbsart@bellsouth.net",
        "info@coccoandsalem.com",
        "info@tskw.org",
        "mpuppich@yahoo.com",
        "scottyking@sbcglobal.net",
        "wlancetaylor@gmail.com",
        "woodshop@tskw.org"
      ]
    },
    {
      "url": "https://www.facebook.com/studiosofkeywest",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    }
  ],
  "all_links": [
    "http://tskw.org/jobs/",
    "http://tskw.org/calendar/",
    "http://tskw.org/book-a-private-event/",
    "http://tskw.org/staff-and-board/",
    "https://tskw.org/book-a-private-event/",
    "http://tskw.org/events/",
    "http://tskw.org/policies-faqs/",
    "https://tskw.org/hours-and-admission/",
    "https://tskw.org/pear-program-2/",
    "https://tskw.org/glow-hours-on-hughs-view/",
    "https://tskw.org/?page_id=36",
    "https://tskw.org/november-2025-first-thursday/",
    "http://tskw.org/photos/",
    "https://tskw.org/patrons/",
    "http://tskw.org/?page_id=26267",
    "https://tskw.org/join/",
    "https://tskw.org/southernmost-youth-orchestra/",
    "https://tskw.org/the-life-and-art-of-eric-anfinson/",
    "https://tskw.org/holiday-makers-market/",
    "https://tskw.org/all-classes-and-workshops/",
    "https://tskw.org/",
    "https://tskw.org/facilities/",
    "http://tskw.org/all-exhibitions/",
    "http://tskw.org/thanks-for-joining-us/",
    "http://tskw.org/videos/",
    "https://tskw.org/havana-art-tour-2/",
    "http://tskw.org/submit-a-proposal/",
    "https://tskw.org/current-studio-artists/",
    "https://tskw.org/news/",
    "http://tskw.org/classes/all-classes-and-workshops/",
    "https://tskw.org/all-exhibitions/",
    "https://tskw.org/events/",
    "http://tskw.org/events",
    "http://tskw.org/programs-for-kids-teens/",
    "https://tskw.org",
    "http://tskw.org/awards/",
    "http://tskw.org/visit/hours-and-admission/",
    "http://tskw.org/who-we-are/",
    "https://tskw.org/volunteer/",
    "https://tskw.org/tutu-tuesday-glow-hours/",
    "https://tskw.org/studios/",
    "http://tskw.org/events/past-events/",
    "https://tskw.org/news-2/",
    "https://tskw.org/calendar/",
    "http://tskw.org/accessibility/",
    "http://tskw.org/join/",
    "https://tskw.org/october-2025-first-thursday/",
    "http://tskw.org/glow-hours-on-hughs-view/",
    "https://tskw.org/where-to-eat-shop-etc/",
    "http://tskw.org/pear-program-2/",
    "https://tskw.org/summer-in-the-sanger-samuel-alvarez/",
    "https://tskw.org/december-duo-holiday-concert/",
    "https://tskw.org/directions-and-parking/",
    "http://tskw.org/facilities/",
    "http://tskw.org/current-studio-artists/"
  ],
  "candidate_links": [
    "http://tskw.org/staff-and-board/",
    "https://tskw.org/book-a-private-event/",
    "http://tskw.org/?page_id=26267",
    "https://tskw.org/current-studio-artists/",
    "https://tskw.org/events/",
    "http://tskw.org/events",
    "http://tskw.org/who-we-are/",
    "http://tskw.org/events/past-events/",
    "http://tskw.org/current-studio-artists/",
    "https://www.facebook.com/studiosofkeywest"
  ],
  "visited": [
    "https://tskw.org/?utm_source=google&utm_medium=organic&utm_campaign=gbp",
    "https://tskw.org/about",
    "https://tskw.org/contact",
    "https://tskw.org/staff",
    "https://tskw.org/team",
    "https://tskw.org/board",
    "https://tskw.org/directory",
    "https://tskw.org/events",
    "https://tskw.org/sitemap.xml",
    "https://tskw.org/council",
    "https://tskw.org/leadership",
    "https://tskw.org/management",
    "https://tskw.org/producers",
    "https://tskw.org/support",
    "https://tskw.org/crew",
    "https://tskw.org/members",
    "https://tskw.org/bios",
    "https://tskw.org/people",
    "https://tskw.org/artists",
    "https://tskw.org/musicians",
    "https://tskw.org/faculty",
    "https://tskw.org/administration",
    "http://tskw.org/staff-and-board/",
    "https://tskw.org/book-a-private-event/",
    "http://tskw.org/?page_id=26267",
    "https://tskw.org/current-studio-artists/",
    "https://tskw.org/events/",
    "http://tskw.org/events",
    "http://tskw.org/who-we-are/",
    "http://tskw.org/events/past-events/",
    "http://tskw.org/current-studio-artists/",
    "https://www.facebook.com/studiosofkeywest"
  ],
  "base_url": "https://tskw.org/?utm_source=google&utm_medium=organic&utm_campaign=gbp"
}