{
  "pages": [
    {
      "url": "https://wanderbardeland.com/about/",
      "is_candidate": false,
      "has_email": false,
      "text": "ABOUT\nAvada Support\n2023-11-22T09:57:45-05:00\nabout wander bar\nwhy choose us?\nThere is so much more to bartending than mixing and pouring. For us, it’s a skill and an art finding the right mix of personality, skill and efficiency. Our bartenders are trained on more than just liquor count or serving strategy. We go the extra mile to entertain your guests as well! Our bartenders have been hand selected based on their unique individualities and interest in making any event memorable and fun! In booking Wander Bar, you are booking a guaranteed experience.\nWhile most guests will have little interaction with any event planners, production team or caterers, they will ABSOLUTELY have an interaction with the bartenders! The quality of that interaction will set the tone for the event experience to come. The best event planners know the value of an elevated bar service with knowledgeable and memorable staff. Wander Bar only employs bartenders who are obsessed with crafting a consistent and creative bar experience. Wander Bar staff exude all the charm, wit, attention to detail and proficiency that we believe is an absolute necessity to make any event a success!\nlet us wander to you!\nWe currently have 2 options for a “main” mobile bar (the bar we serve from) to setup at your event location. Back bar table with linen and additional space for each option is included in every package. We also offer a variety of additional structures and setups for more creative entertaining and we would be more than happy to assist you in your decision and tailor the choices to the look and feel you are aiming for! It would truly be our pleasure to entertain and (mildly) intoxicate you and your guests!\nMeet the Owner\nMy name is Amber Modesto, and I am the proud owner of Wander Bar. With over 15 years of bar and event experience, I’ve seen it all! There is no situation I can’t finesse and no event I can’t impress! I have a natural wandering spirit and after working in stationary bars for so much of my career I needed to be free to move around, see new things, meet new people, and share in my joy which is craft cocktail making and entertaining! Looking for the best mobile bar service possible? Let me wander to you!\nCheers,\nAmber and the Wander Bar team\n“Knowing how to read people and suit their exact needs is a skill we require in all of our bartenders. No more boring bars!”\nRequest a Quote\n×\nContact Wander Bar\nYour name\nYour email\nSubject\nYour message (optional)\n×\nClose\n×\nRequest a Quote\nUse the handy form below to request a quote, or feel free togive us a call at\n(386) 717-6918\nContact Info\nYour name\nPhone Number\nEmail\nEvent Info\nEvent Date(s)\nEvent Location\nExpected Number of Guests (estimate)\nEvent Details\n×\nClose\nfusion-row\nABOUT\nAvada Support\n2023-11-22T09:57:45-05:00\nabout wander bar\nwhy choose us?\nThere is so much more to bartending than mixing and pouring. For us, it’s a skill and an art finding the right mix of personality, skill and efficiency. Our bartenders are trained on more than just liquor count or serving strategy. We go the extra mile to entertain your guests as well! Our bartenders have been hand selected based on their unique individualities and interest in making any event memorable and fun! In booking Wander Bar, you are booking a guaranteed experience.\nWhile most guests will have little interaction with any event planners, production team or caterers, they will ABSOLUTELY have an interaction with the bartenders! The quality of that interaction will set the tone for the event experience to come. The best event planners know the value of an elevated bar service with knowledgeable and memorable staff. Wander Bar only employs bartenders who are obsessed with crafting a consistent and creative bar experience. Wander Bar staff exude all the charm, wit, attention to detail and proficiency that we believe is an absolute necessity to make any event a success!\nlet us wander to you!\nWe currently have 2 options for a “main” mobile bar (the bar we serve from) to setup at your event location. Back bar table with linen and additional space for each option is included in every package. We also offer a variety of additional structures and setups for more creative entertaining and we would be more than happy to assist you in your decision and tailor the choices to the look and feel you are aiming for! It would truly be our pleasure to entertain and (mildly) intoxicate you and your guests!\nMeet the Owner\nMy name is Amber Modesto, and I am the proud owner of Wander Bar. With over 15 years of bar and event experience, I’ve seen it all! There is no situation I can’t finesse and no event I can’t impress! I have a natural wandering spirit and after working in stationary bars for so much of my career I needed to be free to move around, see new things, meet new people, and share in my joy which is craft cocktail making and entertaining! Looking for the best mobile bar service possible? Let me wander to you!\nCheers,\nAmber and the Wander Bar team\n“Knowing how to read people and suit their exact needs is a skill we require in all of our bartenders. No more boring bars!”\nRequest a Quote\n×\nContact Wander Bar\nYour name\nYour email\nSubject\nYour message (optional)\n×\nClose\n×\nRequest a Quote\nUse the handy form below to request a quote, or feel free togive us a call at\n(386) 717-6918\nContact Info\nYour name\nPhone Number\nEmail\nEvent Info\nEvent Date(s)\nEvent Location\nExpected Number of Guests (estimate)\nEvent Details\n×\nClose\nShipping Policy\nRefund and Returns Policy\nPrivacy Policy\n0\nGo to Top",
      "emails": []
    },
    {
      "url": "https://wanderbardeland.com/author/avadasupport/",
      "is_candidate": false,
      "has_email": false,
      "text": "HOME\nsunrisedigital\n2022-11-18T13:44:52-05:00\nCraft. Cocktails. Anywhere.\nrequest a quote\nCraft. Cocktails. Anywhere.\ncall now\nrequest a quote\nabout wander bar\nThe concept of Wander Bar is simple. We are a mobile bartending service based out of DeLand, FL that provides entertaining bartenders and expert service to any event! We specialize in custom craft cocktail creations and superior customer service. Our mission is to help make your event unforgettable!\nRead More\nservices\nOur packages and services are based uniquely around each client we engage. No two venues or events are the same and we like to individualize our approach to each. We service an endless amount of celebrations from corporate parties, showers, weddings, boutique shop-and-drink, real estate open houses, happy hour mixers, the options are limitless! It would be our pleasure to wander to you and help you make your best “pour” decision.\nCheck out the links below to learn more.\nFull-Service Bar Packages\nclasses and other services\nHappy Clients\nDominique\nWe hired Wander Bar for our wedding, and they absolutely nailed it! From the very beginning, Amber (the owner) made the planning process easy, stress-free, and actually fun. She helped us craft signature bride and groom cocktails that were not only creative but seriously delicious — our guests couldn’t stop talking about them!The bartenders on the day were everything we could have hoped for: professional, friendly, and full of good energy. They kept the drinks flowing and the vibes high all night long.We’re so grateful to the whole Wander Bar team for helping make our big day even more special. 10/10 recommend them for any event where you want amazing service and great drinks!\n- 5/12/2025\nShannon\nI had wander bar, bartend at our wedding and I would give them 100 more stars if I could! Such a fun, friendly, attentive team with cocktail making skills of absolute pros. All of my guests raved about them all night! They added the most personal touches, including bringing us our signature cocktails before the ceremony. Amber, the owner, made the entire wedding planning process easy for me the whole time. Highly recommend!!! Thank you Wander Bar. You guys were a huge part of the day of my dreams!\n- 5/11/2025\nTaylor\nLet’s talk about the MVPs of the party - Amber and the amazing crew at Wander Bar!From our very first conversation, Amber was all in, helping us craft a customized drink menu that felt so us, from signature cocktails to fun twists that our guests couldn’t stop raving about. She brought creativity, professionalism, and such a good vibe to the whole process.But it wasn’t just about the drinks (though they were incredible), it was the energy her team brought to the wedding. They were fun, fast, friendly, and genuinely seemed to love being part of the celebration. Everyone left the bar with a drink in hand and a smile on their face, and that’s 100% thanks to them.Amber and her team didn’t just keep the drinks flowing, they kept the fun flowing! They helped make our wedding feel like a true celebration, and we’re so grateful they were part of it.If you want bartenders who go above and beyond to make your day unforgettable, Wander Bar is the one. Cheers to the best bar team ever! 🍹🎉— Mr. and Mrs. Jones\n- 4/20/2025\nMelanie\nAmber was an absolute joy to work with throughout our wedding planning process! From the very beginning, she was incredibly responsive and attentive to our needs. She helped us create the perfect signature drinks, offering thoughtful suggestions for the types of alcohol we should purchase and ensuring everything was just right for our big day. On the day of the wedding, Amber went above and beyond by personally being there to serve the drinks. She and her team made the most delicious cocktails, and all our guests couldn’t stop talking about how tasty they were! Everyone had such a great time, and we couldn't have been more pleased with the service Amber (and her team) provided. She’s not just a fantastic bartender—she’s a wonderful person to work with, and we would absolutely recommend her!\n- 4/15/2025\nBobby\nGreat place to unwind and have a good time. Great bartenders and always live music!\n- 4/14/2025\nLindsay\nBEST OF THE BEST!Amber and her team are TOP of the line! I have had the honor / privilege of working with them for multiple weddings! Not only are the drinks amazing- BUT from a wedding planners stand point, Amber and her team are professional- trustworthy and always giving excellent service! 100% recommend having Wander Bar at YOUR wedding/event!!!!!\n- 4/14/2025\nJordan\nAmber and her team helped make our wedding day amazing! They were on top of everything and made our day so much less stressful! Can’t thank them enough, the drinks were great and would recommend them to anyone!\n- 4/13/2025\nTera\nWe love Wander Bar! Amber and her team are easy to work with and very professional! As a venue owner, we want our guests to have an enjoyable, but safe experience.Wonder Bar delivers that service! We highly recommend Wander Bar for any event!\n- 4/13/2025\nSean\nFavorite part of our day was at this bar. I’ve never been to Deland before and this was the first stop. Beautiful bar with a large selection of spirits. Shelby was incredible. She explained the drinks perfectly and every single cocktail was a masterpiece. We had a total of 5. Will 100% be returning here on our next visit here.\n- 4/04/2025\nMarie\nWow! Had walked by this place numerous times and finally decided to try it out and soooo happy we did! The staff was amazing so nice and the drinks were wonderful! Will be returning!\n- 3/27/2025\nfrequently asked questions\nAre you licensed and insured?\nYes! We\ncarry general and liquor liability insurance as well as a license to do business in the state of FL. If you have any questions on your venue’s restrictions, I would love to reach out to them. We are a Limited Liability Company, and our staff carries Food and Alcohol Certification, SERV Safe Management and/or TIPS certification.\nDo we purchase the alcohol or do you?\nEither way works for us! No matter how you decide to get the alcohol to your event, we will help you every step of the way from:\nDeciding on which wines/liquors/beers to serve\nOrdering the correct amounts of each based on your guest count and\nmy experience\n(If you choose) picking up and delivering the alcohol to your event and setting it all up for you.\nWe want this to feel as seamless as possible!\nCan I taste signature cocktails before my event?\nAbsolutely, I encourage it! I want to make sure you are completely satisfied with my creations and would love to make any adjustments or changes to ensure your satisfaction! To do so, I will schedule a cocktail tasting with you at\nWander Bar Cocktail Lounge\nprior to event day and you will sample and go through each signature cocktail pre-destined for your event! I find it good to bring a close friend or member of your group along with you to this tasting. Someone to enjoy the process with you and reinforce our choices!\nWander Bar Cocktail\nLounge 208 N. Woodland blvd. Deland FL 32724\nDo you personally meet with every client?\n100% of the time. I am a small business owner, and this is my labor of love. I meet with every potential client to work through their event needs and I bartend every event! I have a wonderful crew of bartenders that work for me and enhance my personality and charm! You will always get me though. I will run lead on your event just as I have so many others. I am selling much more than a service here. I want you to meet me, trust me and book me. I will be there for you every step of the way!\nCan I book you if I already have a bar and supplies but just need a bartender?\nOf course! We have a “bartender only” option as well as a multitude of others. I do not set prices or packages in advance of meeting a client for this reason. Every client and event are different. If you just need me to show up with my bar tools and jump on a pre-set bar than that is just what I will do!\nHow does the process work when booking?\nI have compiled a start to finish list as far as booking is concerned:\nContact me (particularly important key first-step)\nFill out an inquiry form about your event to see if your event date is available\nSchedule a consultation\nConsultation (meet and greet and set expectations)\nSign the event agreement and pay deposit\nFill out the event alcohol worksheet and decide on alcohol list\nSchedule a cocktail tasting and post booking consultation to finalize guest count and products needed\nWeek before the event: touch base with changes and receive breakdown of services/timing day of event email\nYOUR EVENT!\nWe will work through what your needs and expectations are, and I will do my best to accommodate those!\nWhat type of events does Wander Bar serve?\nI cannot even think of an event or party I would turn down! I love events and gatherings! Here are a few examples:\nWedding\nBridal Shower\nBirthday\nLaunch Party\nGrand Opening\nCorporate Event\nRehearsal Dinner\nHoliday Party\nShowers\nBackyard BBQ\nEngagement\nCharity\nBlock Party\nReunions\nI will wander to you and get the party started no matter the occasion!\nHow far in advance should we book?\nAs soon as possible. The availability of venues and vendors is always better with more lead time. The sooner you book for your event, the better!\nAny advice you would give to a person beginning their search for vendors and putting together an event?\nYou can do this! The event and party planning business are incredibly detailed and I know this can seem daunting. Remember what you are doing and why you are doing it! Events are fun and exciting and (the good ones) memorable. Find a good venue and a few personable vendors and the rest will work itself out! Those of us who work in this industry are loaded with useful tips of the trade and contact info for other local vendors to help with things such as flower, photos, and cakes etc. All you have to do is ask!\nCan we run a cash bar?\nAbsolutely! We can run a cash bar for any event that will be serving food in the state of Florida. If you\nfeel like alcohol may not fit into your overall budget, this may be the perfect option for you!\nCraft. Cocktails. Anywhere.\nCall Now\nRequest a Quote\n×\nRequest a Quote\nUse the handy form below to request a quote, or feel free togive us a call at\n(386) 717-6918\nContact Info\nYour name\nPhone Number\nEmail\nEvent Info\nEvent Date(s)\nEvent Location\nExpected Number of Guests (estimate)\nEvent Details\n×\nClose\nfusion-row\nHOME\nsunrisedigital\n2022-11-18T13:44:52-05:00\nCraft. Cocktails. Anywhere.\nrequest a quote\nCraft. Cocktails. Anywhere.\ncall now\nrequest a quote\nabout wander bar\nThe concept of Wander Bar is simple. We are a mobile bartending service based out of DeLand, FL that provides entertaining bartenders and expert service to any event! We specialize in custom craft cocktail creations and superior customer service. Our mission is to help make your event unforgettable!\nRead More\nservices\nOur packages and services are based uniquely around each client we engage. No two venues or events are the same and we like to individualize our approach to each. We service an endless amount of celebrations from corporate parties, showers, weddings, boutique shop-and-drink, real estate open houses, happy hour mixers, the options are limitless! It would be our pleasure to wander to you and help you make your best “pour” decision.\nCheck out the links below to learn more.\nFull-Service Bar Packages\nclasses and other services\nHappy Clients\nDominique\nWe hired Wander Bar for our wedding, and they absolutely nailed it! From the very beginning, Amber (the owner) made the planning process easy, stress-free, and actually fun. She helped us craft signature bride and groom cocktails that were not only creative but seriously delicious — our guests couldn’t stop talking about them!The bartenders on the day were everything we could have hoped for: professional, friendly, and full of good energy. They kept the drinks flowing and the vibes high all night long.We’re so grateful to the whole Wander Bar team for helping make our big day even more special. 10/10 recommend them for any event where you want amazing service and great drinks!\n- 5/12/2025\nShannon\nI had wander bar, bartend at our wedding and I would give them 100 more stars if I could! Such a fun, friendly, attentive team with cocktail making skills of absolute pros. All of my guests raved about them all night! They added the most personal touches, including bringing us our signature cocktails before the ceremony. Amber, the owner, made the entire wedding planning process easy for me the whole time. Highly recommend!!! Thank you Wander Bar. You guys were a huge part of the day of my dreams!\n- 5/11/2025\nTaylor\nLet’s talk about the MVPs of the party - Amber and the amazing crew at Wander Bar!From our very first conversation, Amber was all in, helping us craft a customized drink menu that felt so us, from signature cocktails to fun twists that our guests couldn’t stop raving about. She brought creativity, professionalism, and such a good vibe to the whole process.But it wasn’t just about the drinks (though they were incredible), it was the energy her team brought to the wedding. They were fun, fast, friendly, and genuinely seemed to love being part of the celebration. Everyone left the bar with a drink in hand and a smile on their face, and that’s 100% thanks to them.Amber and her team didn’t just keep the drinks flowing, they kept the fun flowing! They helped make our wedding feel like a true celebration, and we’re so grateful they were part of it.If you want bartenders who go above and beyond to make your day unforgettable, Wander Bar is the one. Cheers to the best bar team ever! 🍹🎉— Mr. and Mrs. Jones\n- 4/20/2025\nMelanie\nAmber was an absolute joy to work with throughout our wedding planning process! From the very beginning, she was incredibly responsive and attentive to our needs. She helped us create the perfect signature drinks, offering thoughtful suggestions for the types of alcohol we should purchase and ensuring everything was just right for our big day. On the day of the wedding, Amber went above and beyond by personally being there to serve the drinks. She and her team made the most delicious cocktails, and all our guests couldn’t stop talking about how tasty they were! Everyone had such a great time, and we couldn't have been more pleased with the service Amber (and her team) provided. She’s not just a fantastic bartender—she’s a wonderful person to work with, and we would absolutely recommend her!\n- 4/15/2025\nBobby\nGreat place to unwind and have a good time. Great bartenders and always live music!\n- 4/14/2025\nLindsay\nBEST OF THE BEST!Amber and her team are TOP of the line! I have had the honor / privilege of working with them for multiple weddings! Not only are the drinks amazing- BUT from a wedding planners stand point, Amber and her team are professional- trustworthy and always giving excellent service! 100% recommend having Wander Bar at YOUR wedding/event!!!!!\n- 4/14/2025\nJordan\nAmber and her team helped make our wedding day amazing! They were on top of everything and made our day so much less stressful! Can’t thank them enough, the drinks were great and would recommend them to anyone!\n- 4/13/2025\nTera\nWe love Wander Bar! Amber and her team are easy to work with and very professional! As a venue owner, we want our guests to have an enjoyable, but safe experience.Wonder Bar delivers that service! We highly recommend Wander Bar for any event!\n- 4/13/2025\nSean\nFavorite part of our day was at this bar. I’ve never been to Deland before and this was the first stop. Beautiful bar with a large selection of spirits. Shelby was incredible. She explained the drinks perfectly and every single cocktail was a masterpiece. We had a total of 5. Will 100% be returning here on our next visit here.\n- 4/04/2025\nMarie\nWow! Had walked by this place numerous times and finally decided to try it out and soooo happy we did! The staff was amazing so nice and the drinks were wonderful! Will be returning!\n- 3/27/2025\nfrequently asked questions\nAre you licensed and insured?\nYes! We\ncarry general and liquor liability insurance as well as a license to do business in the state of FL. If you have any questions on your venue’s restrictions, I would love to reach out to them. We are a Limited Liability Company, and our staff carries Food and Alcohol Certification, SERV Safe Management and/or TIPS certification.\nDo we purchase the alcohol or do you?\nEither way works for us! No matter how you decide to get the alcohol to your event, we will help you every step of the way from:\nDeciding on which wines/liquors/beers to serve\nOrdering the correct amounts of each based on your guest count and\nmy experience\n(If you choose) picking up and delivering the alcohol to your event and setting it all up for you.\nWe want this to feel as seamless as possible!\nCan I taste signature cocktails before my event?\nAbsolutely, I encourage it! I want to make sure you are completely satisfied with my creations and would love to make any adjustments or changes to ensure your satisfaction! To do so, I will schedule a cocktail tasting with you at\nWander Bar Cocktail Lounge\nprior to event day and you will sample and go through each signature cocktail pre-destined for your event! I find it good to bring a close friend or member of your group along with you to this tasting. Someone to enjoy the process with you and reinforce our choices!\nWander Bar Cocktail\nLounge 208 N. Woodland blvd. Deland FL 32724\nDo you personally meet with every client?\n100% of the time. I am a small business owner, and this is my labor of love. I meet with every potential client to work through their event needs and I bartend every event! I have a wonderful crew of bartenders that work for me and enhance my personality and charm! You will always get me though. I will run lead on your event just as I have so many others. I am selling much more than a service here. I want you to meet me, trust me and book me. I will be there for you every step of the way!\nCan I book you if I already have a bar and supplies but just need a bartender?\nOf course! We have a “bartender only” option as well as a multitude of others. I do not set prices or packages in advance of meeting a client for this reason. Every client and event are different. If you just need me to show up with my bar tools and jump on a pre-set bar than that is just what I will do!\nHow does the process work when booking?\nI have compiled a start to finish list as far as booking is concerned:\nContact me (particularly important key first-step)\nFill out an inquiry form about your event to see if your event date is available\nSchedule a consultation\nConsultation (meet and greet and set expectations)\nSign the event agreement and pay deposit\nFill out the event alcohol worksheet and decide on alcohol list\nSchedule a cocktail tasting and post booking consultation to finalize guest count and products needed\nWeek before the event: touch base with changes and receive breakdown of services/timing day of event email\nYOUR EVENT!\nWe will work through what your needs and expectations are, and I will do my best to accommodate those!\nWhat type of events does Wander Bar serve?\nI cannot even think of an event or party I would turn down! I love events and gatherings! Here are a few examples:\nWedding\nBridal Shower\nBirthday\nLaunch Party\nGrand Opening\nCorporate Event\nRehearsal Dinner\nHoliday Party\nShowers\nBackyard BBQ\nEngagement\nCharity\nBlock Party\nReunions\nI will wander to you and get the party started no matter the occasion!\nHow far in advance should we book?\nAs soon as possible. The availability of venues and vendors is always better with more lead time. The sooner you book for your event, the better!\nAny advice you would give to a person beginning their search for vendors and putting together an event?\nYou can do this! The event and party planning business are incredibly detailed and I know this can seem daunting. Remember what you are doing and why you are doing it! Events are fun and exciting and (the good ones) memorable. Find a good venue and a few personable vendors and the rest will work itself out! Those of us who work in this industry are loaded with useful tips of the trade and contact info for other local vendors to help with things such as flower, photos, and cakes etc. All you have to do is ask!\nCan we run a cash bar?\nAbsolutely! We can run a cash bar for any event that will be serving food in the state of Florida. If you\nfeel like alcohol may not fit into your overall budget, this may be the perfect option for you!\nCraft. Cocktails. Anywhere.\nCall Now\nRequest a Quote\n×\nRequest a Quote\nUse the handy form below to request a quote, or feel free togive us a call at\n(386) 717-6918\nContact Info\nYour name\nPhone Number\nEmail\nEvent Info\nEvent Date(s)\nEvent Location\nExpected Number of Guests (estimate)\nEvent Details\n×\nClose\nShipping Policy\nRefund and Returns Policy\nPrivacy Policy\n0\nGo to Top",
      "emails": []
    }
  ],
  "all_links": [
    "https://wanderbardeland.com/shop/",
    "https://wanderbardeland.com/services/",
    "https://wanderbardeland.com/author/sunrisedigital/",
    "https://wanderbardeland.com/privacy-policy/",
    "https://wanderbardeland.com/#faq",
    "https://wanderbardeland.com/",
    "https://wanderbardeland.com/cocktail-lounge-deland/",
    "https://wanderbardeland.com/cart/",
    "http://wanderbardeland.com/cocktail-lounge",
    "https://wanderbardeland.com/shipping-policy/",
    "https://wanderbardeland.com/refund_returns/",
    "https://wanderbardeland.com/about/",
    "https://wanderbardeland.com/author/avadasupport/",
    "https://wanderbardeland.com/packages/"
  ],
  "candidate_links": [
    "https://wanderbardeland.com/about/",
    "https://wanderbardeland.com/author/avadasupport/"
  ],
  "visited": [
    "http://wanderbardeland.com/",
    "http://wanderbardeland.com/about",
    "http://wanderbardeland.com/contact",
    "http://wanderbardeland.com/staff",
    "http://wanderbardeland.com/team",
    "http://wanderbardeland.com/board",
    "http://wanderbardeland.com/directory",
    "http://wanderbardeland.com/events",
    "http://wanderbardeland.com/sitemap.xml",
    "http://wanderbardeland.com/council",
    "http://wanderbardeland.com/leadership",
    "http://wanderbardeland.com/management",
    "http://wanderbardeland.com/producers",
    "http://wanderbardeland.com/support",
    "http://wanderbardeland.com/crew",
    "http://wanderbardeland.com/members",
    "http://wanderbardeland.com/bios",
    "http://wanderbardeland.com/people",
    "http://wanderbardeland.com/artists",
    "http://wanderbardeland.com/musicians",
    "http://wanderbardeland.com/faculty",
    "http://wanderbardeland.com/administration",
    "https://wanderbardeland.com/about/",
    "https://wanderbardeland.com/author/avadasupport/"
  ],
  "base_url": "http://wanderbardeland.com/"
}