{
  "pages": [
    {
      "url": "https://www.watsonwater.com/contact/",
      "is_candidate": false,
      "has_email": true,
      "text": "Contact\n.entry-header\nWatson Company, Inc.\n9133 Twelve Corners Road\nLascassas, TN 37085\nLoyd Watson, M.G.W.C.\nMurfreesboro 615-893-1132\nNashville 615-242-3756\nLascassas 615-273-2849\nFax 615-273-2856\nQuestions or Comments\nWatsonwelldrilling@gmail.com\n.entry-content",
      "emails": [
        "watsonwelldrilling@gmail.com"
      ]
    },
    {
      "url": "https://www.watsonwater.com/about-us/",
      "is_candidate": false,
      "has_email": false,
      "text": "About Us\n.entry-header\nWater Well Services\nLoyd and JoLinda Watson founded Watson Company, Inc. in 1975.  The company specializes in water well services - water well drilling, pump sales, installation and repair service, water filtration systems, geothermal drilling and loop installation.\nLoyd is a second-generation well driller who's father, Fred Watson, was in the business for 48 years. He began working with his father and other contractors when he was in high school and continued until he formed his own company. Loyd has also gained valuable experience from working with oil and gas drilling, hydrfracturing wells for increased production, down hole camera, geophysical logging of wells, pressure grouting, well development, environmental drilling, and commercial well installations.\nFrom the beginning, Loyd knew that in order to gain an edge over the competition he had to keep abreast of new technologies through education. Also, of utmost importance is the presentation of a good professional image through our people both in the field and office.\nLoyd has held numerous offices in the organizations with which he is affiliated.\nAs a member of the Tennessee Water Well Association, Loyd has served in the capacity of president for eight years.\nIn 1996 the TWWA appointed Loyd to the Board of Directors of the South Atlantic Jubilee Well Drillers Organization. This organization consists of contractors, manufacturers and suppliers from Florida, Georgia, North and South Carolina, Tennessee, Virginia, West Virginia, Maryland and Kentucky. He served as President in 2002 and 2003.\nHe is a member of the National Ground Water Association, an organization of 16,500 ground water professionals. He was elected to the Board of Directors in 2000. He served in the capacity of Treasurer in 2005.  He was president in 2007.\nIn 1998 Tennessee Governor Don Sundquist appointed Loyd to the Board of Ground Water Management for the State of Tennessee.\nHe is a member of the International Ground Source Heat Pump Association and is a certified Geothermal Installer.\nLoyd is a Master Ground Water Contractor\n. With this distinction comes accreditation by the National Ground Water Association, as a contractor which has successfully passed testing on each level of expertise that is acknowledged by the Association.\nWhen people need  , they can be certain of the quality of work and professionalism that the Watson Company will put forth. They can be assured that they will get a company that is at the cutting edge of this industry. Our company has the most modern well kept clean equipment in the industry. When our equipment arrives on the job, it is capable of completing the job. We currently operate two new modern air rotaries, two pump hoist trucks, trenchers, backhoe and dump truck, grouters, and modern well kept service trucks. We keep in inventory an extensive line of pumps, tanks, pipe and filtration equipment and supplies in our warehouse, to enable better service to you our customers.\nWatson Company is fully insured with liability and workman’s compensation insurance to protect your interest while working on your property. We are licensed by the State of Tennessee; our employees are well trained, courteous and very mindful of the importance of the needs of the customers. Our company was built on quality workmanship, knowledge and a splendid reputation. When the citizens of Tennessee need our services, they can depend on the Watson Company to deliver.\n.entry-content",
      "emails": []
    }
  ],
  "all_links": [
    "https://www.watsonwater.com/geothermal/",
    "https://www.watsonwater.com/",
    "https://www.watsonwater.com/irrigation/",
    "https://www.watsonwater.com/links/",
    "https://www.watsonwater.com/contact/",
    "https://www.watsonwater.com/water-well-pumps/",
    "https://www.watsonwater.com/water-treatment/",
    "https://www.watsonwater.com/about-us/",
    "https://www.watsonwater.com/questions/",
    "https://www.watsonwater.com/well-drilling/"
  ],
  "candidate_links": [
    "https://www.watsonwater.com/contact/",
    "https://www.watsonwater.com/about-us/"
  ],
  "visited": [
    "http://www.watsonwater.com/",
    "http://www.watsonwater.com/about",
    "http://www.watsonwater.com/contact",
    "http://www.watsonwater.com/staff",
    "http://www.watsonwater.com/team",
    "http://www.watsonwater.com/board",
    "http://www.watsonwater.com/directory",
    "http://www.watsonwater.com/events",
    "http://www.watsonwater.com/sitemap.xml",
    "http://www.watsonwater.com/council",
    "http://www.watsonwater.com/leadership",
    "http://www.watsonwater.com/management",
    "http://www.watsonwater.com/producers",
    "http://www.watsonwater.com/support",
    "http://www.watsonwater.com/crew",
    "http://www.watsonwater.com/members",
    "http://www.watsonwater.com/bios",
    "http://www.watsonwater.com/people",
    "http://www.watsonwater.com/artists",
    "http://www.watsonwater.com/musicians",
    "http://www.watsonwater.com/faculty",
    "http://www.watsonwater.com/administration",
    "https://www.watsonwater.com/contact/",
    "https://www.watsonwater.com/about-us/"
  ],
  "base_url": "http://www.watsonwater.com/"
}