{
  "pages": [
    {
      "url": "https://www.wharf850.com/about-us",
      "is_candidate": false,
      "has_email": true,
      "text": "Home\nOur Menus\nAbout us\nContact Us\nGift Card\nMore\nHome\nOur Menus\nAbout us\nContact Us\nGift Card\nHome\nOur Menus\nAbout us\nContact Us\nGift Card\nAbout Us\nBOAT UP - DINE IN\nEVENTS IS WHAT WE DO\nEVENTS IS WHAT WE DO\nYacht, center console, sailboat, or dinghy can float in and dine.Idle into one of our spots under the main deck to dock and dine, or call ahead and do a  pick-up order, or stay a while. Any day on the water is a good day, and lunch or dinner at the Wharf 850 makes it that much better. It’ll be a smooth ride from your dock to our deck.\nEVENTS IS WHAT WE DO\nEVENTS IS WHAT WE DO\nEVENTS IS WHAT WE DO\nNiceville is a nice place to live, work,\nand play. We love being a growing part of this community and always welcome meetings or special group events for both Military Organizations and the Area Community Businesses Luncheons, Family Reunions, Wedding Events, School Functions and Local Club Meetings.\nMeet The OwNERS\nCasey and Jami Jones have an incredible restaurant resume. Being Foodies to the core, with a passion for hospitality, they turned their love of entertaining and cooking for family and friends, into an every growing enterprise... . from the birth of the Big Red Truck and its on location catering success, followed by The Big Red Grill, The Wharf 850, and most recently adding The Big Red Cafe in Destin.\nCasey, raised in Destin, became a professional fisherman at an early age. He then made a transition to the business of restaurants, operating and owning the original Fat Daddy’s Pizza in Okaloosa and Walton Counties. Having created success in the pizza industry, Casey again picked up the Rod & Reel and returned to his fishing roots. His Professional Sports Fishing Team and Charter Boat traveled extensively to compete in fishing tournaments, while he continued to hone his culinary skills with his abundant supply of fresh seafood and a growing crowd of friends, fisherman and clients to feed.\nJami was raised in Kansas City, Missouri and arrived in Destin in 2001. She to created an impressive array of talents in the areas of restaurant management, event planning, catering, and even decorating skills in the floral business. Here in the Panhandle, she operated a charter fishing service on the Destin Harbor and even opened multiple locations. Two weeks after arriving in Destin, Jami met Casey on the Destin Harbor and soon started the relationship that would reshape both of their futures.\nEven while Casey fished and Jami booked Charters, both continued to grow their love to cook and entertain, which led to the investment in the Big Red Truck. Known for fresh locally sourced seafood and awesome tacos, hand-cut French fries, homemade sauces, grilled salads, Philly cheesesteaks, and more their reputation grew. The Jones Duo, and their growing talented staff, became know for making catered and party event  success of any size,  and this led to the opportunity to create BIG Red Grill on the Destin Harbor.\nIn 2019 Jami and Casey took over this beautiful Boggy Bayou location, named it The Wharf 850, and have worked hard the last 4 years to continue to grow their reputation for Delicious Food and Great Service. Being trusted friends and neighbors in the Niceville and Valparaiso Community is something The Wharf 850 strives to be every day the doors are opened.\nLast year Jami and Casey added the Big Red Cafe, located in the Heart of Destin, to their diverse and growing restaurant portfolio.They continue to be thankful for the blessing they have been given, and contribute their success to hard work and simply following God’s Plan for their lives.\nOur Family of Food Services\nCopyright © 2025 Wharf 850 - All Rights Reserved.\nPowered by\nOur Menus\nAbout us\nContact Us\nDinner Menu\nLunch Menu\nDrink Menu\nSunday Brunch\nSeafood Boil Menu\nMeet The Owners\nGift Card\nGive Us A Review\nLocal Friends",
      "emails": [
        "wweeiihhuuaanngg@gmail.com"
      ]
    },
    {
      "url": "https://www.wharf850.com/contact-us",
      "is_candidate": false,
      "has_email": true,
      "text": "Home\nOur Menus\nAbout us\nContact Us\nGift Card\nMore\nHome\nOur Menus\nAbout us\nContact Us\nGift Card\nHome\nOur Menus\nAbout us\nContact Us\nGift Card\nCONTACT US!\nWe Welcome Suggestions, Comments and Praise... Send Us an Email!\nName\nEmail*\nAttach Files\nAttachments (0)\nSign up for our email list for updates, promotions, and more.\nSend\nThis site is protected by reCAPTCHA and the Google\nPrivacy Policy\nand\nTerms of Service\napply.\nBetter yet, see us in person!\nLooking for Hours and Directions? Here they are...\nThe Wharf 850\n821 Bayshore Drive, Niceville, Florida 32578, United States\n(850) 500-1234\nHours\nMon\nClosed\nTue\n11:00 am – 08:00 pm\nWed\n11:00 am – 08:00 pm\nThu\n11:00 am – 08:00 pm\nFri\n11:00 am – 08:00 pm\nSat\n11:00 am – 08:00 pm\nSun\n10:00 am – 08:00 pm\nCopyright © 2025 Wharf 850 - All Rights Reserved.\nPowered by\nOur Menus\nAbout us\nContact Us\nDinner Menu\nLunch Menu\nDrink Menu\nSunday Brunch\nSeafood Boil Menu\nMeet The Owners\nGift Card\nGive Us A Review\nLocal Friends",
      "emails": [
        "wweeiihhuuaanngg@gmail.com"
      ]
    }
  ],
  "all_links": [
    "https://www.wharf850.com/drink-menu",
    "https://www.wharf850.com/meet-the-owners",
    "https://www.wharf850.com/sunday-brunch",
    "https://www.wharf850.com/seafood-boil-menu",
    "https://www.wharf850.com/dinner-menu",
    "https://www.wharf850.com/give-us-a-review",
    "https://www.wharf850.com/",
    "https://www.wharf850.com/about-us",
    "https://www.wharf850.com/our-menus",
    "https://www.wharf850.com/our-menus#65b41818-930c-4c88-9a4b-7128681c3d45",
    "https://www.wharf850.com/local-friends",
    "https://www.wharf850.com/contact-us",
    "https://www.wharf850.com/gift-card",
    "https://www.wharf850.com/lunch-menu"
  ],
  "candidate_links": [
    "https://www.wharf850.com/about-us",
    "https://www.wharf850.com/contact-us"
  ],
  "visited": [
    "https://www.wharf850.com/",
    "https://www.wharf850.com/about",
    "https://www.wharf850.com/contact",
    "https://www.wharf850.com/staff",
    "https://www.wharf850.com/team",
    "https://www.wharf850.com/board",
    "https://www.wharf850.com/directory",
    "https://www.wharf850.com/events",
    "https://www.wharf850.com/sitemap.xml",
    "https://www.wharf850.com/council",
    "https://www.wharf850.com/leadership",
    "https://www.wharf850.com/management",
    "https://www.wharf850.com/producers",
    "https://www.wharf850.com/support",
    "https://www.wharf850.com/crew",
    "https://www.wharf850.com/members",
    "https://www.wharf850.com/bios",
    "https://www.wharf850.com/people",
    "https://www.wharf850.com/artists",
    "https://www.wharf850.com/musicians",
    "https://www.wharf850.com/faculty",
    "https://www.wharf850.com/administration",
    "https://www.wharf850.com/about-us",
    "https://www.wharf850.com/contact-us"
  ],
  "base_url": "https://www.wharf850.com/"
}