{
  "pages": [
    {
      "url": "http://www.wileyhouseconcerts.org/go/help",
      "is_candidate": false,
      "has_email": false,
      "text": "Wiley House Concerts - Contact\nName\nEmail\nMessage",
      "emails": []
    },
    {
      "url": "http://www.wileyhouseconcerts.org/contact",
      "is_candidate": false,
      "has_email": true,
      "text": "WHC Text Announcements\nSign up now to receive announcements of upcoming shows, ticket sales, and more!\nPhone Number*\nYes! I want to receive text messages\nSign Up\nThank you for subscribing to WHC text announcements.\nMessage and data rates may apply.\nRecurring messages subscription.\nClick to view Terms & Privacy.\nAvailable in USA and Canada.\nPowered by\nEZ Texting\nJoin our mailing list for the latest news!\nSign up\nWe welcome the opportunity to serve children's performing arts organizations of all kinds.  If you are in need of a venue for your program's final recital, virtual classroom, etc - please contact us to learn more about how Wiley House Concerts can benefit your program.\nName\nEmail\nInquiry Type\nFan\nArtist\nMember\nVenue rental\nMessage\nWILEY HOUSE CONCERTS\nMUSIC4LIFE Living Arts Center\n1204 Rogers Street\nClearwater, FL 33756\n727-216-3599\ntammy@wileyhouseconcerts.org / thaddeus@wileyhouseconcerts.org\nWiley House Concerts, Inc is a nonprofit 501(c)(3) charitable organization.",
      "emails": [
        "tammy@wileyhouseconcerts.org",
        "thaddeus@wileyhouseconcerts.org"
      ]
    },
    {
      "url": "http://www.wileyhouseconcerts.org/membership-support",
      "is_candidate": false,
      "has_email": true,
      "text": "Join Today\nThis code is required to support all browsers\nView\nMembership Website\npowered by\nMembership Software by Join It\nMore Ways to Support\nAll donation only contributions are 100% tax deductible.\nChoose a monthly donation of $5 or more through paypal to offer your support from afar\nTalk to your employer about choosing your charity donation and potential match.  WHC is a 501(c)(3) and many employers offer this benefit!\nCan't make a show?  Make a donation for your ticket price to support the missed performance.\nWould you like to donate your time or host a fundraiser? Send an email to\ntammy@wileyhouseconcerts.org\nand let us know how you can help.\nWHC also accepts in kind donations of snack kitchen goodies, water, paper products, cleaning products and more!\nWiley House Concerts, Inc is a nonprofit 501(c)(3) charitable organization.",
      "emails": [
        "tammy@wileyhouseconcerts.org"
      ]
    },
    {
      "url": "http://www.wileyhouseconcerts.org/book-your-event",
      "is_candidate": false,
      "has_email": true,
      "text": "MUSIC4LIFE Living Arts Center\nThe MUSIC4LIFE Living Arts Center is a private performance venue in Clearwater, FL.  Independently owned and operated, the center provides a unique space for all types of performing arts and activities.  Wiley House Concerts has permanent residence here and hosts most of their concerts and events in the Listening Room.\nCheck the\nWHC calendar\nfor a list of hosted events scheduled at the MUSIC4LIFE Living Arts Center.\nArtists looking to perform for WHC should submit their details, requirements, and EPK via email to\nthaddeus@wileyhouseconcerts.org\n.\nIf you are looking to rent the space for your own event, please contact\nthaddeus@wileyhouseconcerts.org\nwith details and questions.\nStandard Rental Pricing is as follows:\nWeekdays: $100 per hour/3 hours minimum\nWeekends:  $150 per hour/4 hour minimum\nMUSIC4LIFE Living Arts Center\n1204 Rogers Street\nClearwater, FL 33756\nthaddeus@wileyhouseconcerts.org\nThe Vibe\nWiley House Concerts, Inc is a nonprofit 501(c)(3) charitable organization.",
      "emails": [
        "thaddeus@wilethouseconcerts.org",
        "thaddeus@wileyhouseconcerts.org"
      ]
    },
    {
      "url": "http://www.wileyhouseconcerts.org/about-us",
      "is_candidate": false,
      "has_email": false,
      "text": "Wiley House Concerts, Inc. is a non-profit organization formed to offer a venue, forum, or event where emerging and established artists can perform for the community and the community can support the arts through attendance or donations to the events.\nABOUT WILEY HOUSE CONCERTS\nWiley House Concerts was founded by Tammy & Thaddeus Wiley in an effort to bring live original music to their local community. The concept began simply by hosting backyard house concerts for friends and family at their private residence, but quickly grew into something so much more. Interest peaked to offer support in both hosting the events as well as contributing to the artists working to showcase their talent for the right audience.\nThe Wileys formed WHC and branched into a 501(c)(3) public charity to offer more sustainable support to the performing arts, music education and individual artists of many different talents. After independently purchasing, renovating, and establishing what is now the MUSIC4LIFE Living Arts Center in Clearwater, the Wileys opened their doors as a permanent home base to the Wiley House Concerts organization bringing national, independent and upcoming artists to the listening room stage.\nIn the community, the WHC family takes special pride in participating in volunteer programs on behalf of the organization. From instrument drives for underprivileged music students, to offering school based volunteer hours, or even the entire venue itself to local nonprofit performing arts organizations, WHC is working diligently to brighten the community in a very unique way.\nFunds received into the organization go to independent artist fees, sustainability of the venue, and sponsorships to other organizations and events which share in our mission.\nWe hope to create a special home in the Clearwater, Florida community for patrons and artists for many years to come.\nTammy Wiley\nExecutive Director/Co-Founder\nTammy's drive for supporting the arts comes from deep within and with over 25 years of professional administrative and event experience, she knew she could bring WILEY HOUSE CONCERTS to life, opening doors within the community and across the nation.  Tammy grew up surrounded by music within her own family, so it is no surprise she married into a family full of that same musical talent and appreciation.  Tammy brings a soulful dedication to professionalism and is a rock to the organization.\nThaddeus Wiley\nArtistic Director/Co-Founder\nThaddeus is the heartbeat of WILEY HOUSE CONCERTS.  A lifetime musician himself, he is passionate about the creation and talent behind all genres of music and artistic performers. Thaddeus lends his talent, expertise, and our entire organization as a platform for independent artists and performers to showcase their personal talents.  With a professional background in property management and specialized construction, Thaddeus has poured an abundance of sweat equity into the MUSIC4LIFE building itself, creating an unmatched atmosphere.  Keep your eyes open as you never know where you will find him...in the sound booth, behind the drumkit, in the spotlight himself, or hiding in the back watching a soulful experience form a new friend on stage.\nKayla Kaser\nDirector, Secretary, Social Media\nKayla is our WHC secretary and one of our rockin' board members. Kayla has grown up with music her entire life and was an active member of several choirs throughout grade school. She participated in choirs at the county and state level and performed at a variety of places ranging from school auditoriums to Disney Parks. Kayla enjoys most genres of music and loves Taylor Swift. When she is not listening to music at home with her husband and pets, you can find her managing a local vet clinic while helping all kinds of furry, feathered, and scaley animals!\nJoy Davis\nDirector, Photographer\nHi my name is Joy Davis, I'm originally from NY but have been a Florida resident for over 30 years.  My husband Doug and I have been married for 15 years and have been blessed with 4 awesome children.  We have been a big supporter of Wiley House Concerts from the beginning and while I'm not musically inclined, I have a deep passion for the arts.  I opened Joy Davis Photography in 2017 so you will usually find me with a camera in hand.  I always say my superpower is to freeze time, capturing moments that would otherwise be forgotten.  The dedication, the passion and the out pour of love that The Wiley House Concerts puts back in to the community is why I have decided to become a board member.  Looking forward to creating epic memories that will last a life time. (I'll have the photos to prove it!)\nWiley House Concerts, Inc is a nonprofit 501(c)(3) charitable organization.",
      "emails": []
    },
    {
      "url": "http://www.wileyhouseconcerts.org/artists",
      "is_candidate": false,
      "has_email": true,
      "text": "Artists looking to be considered for Wiley House Concerts events OR looking to host their own privately ticketed event at the MUSIC4LIFE Living Arts Center in Clearwater please send your details and requirements via email to\nthaddeus@wileyhouseconcerts.org.\nWiley House Concerts, Inc is a nonprofit 501(c)(3) charitable organization.",
      "emails": [
        "thaddeus@wileyhouseconcerts.org"
      ]
    },
    {
      "url": "https://www.facebook.com/WileyHouseConcerts/",
      "is_candidate": false,
      "has_email": false,
      "text": "",
      "emails": []
    }
  ],
  "all_links": [
    "http://www.wileyhouseconcerts.org/go/help",
    "http://www.wileyhouseconcerts.org/user_sessions/new",
    "http://www.wileyhouseconcerts.org/user_sessions/logout",
    "http://www.wileyhouseconcerts.org/contact",
    "http://www.wileyhouseconcerts.org/membership-support",
    "http://www.wileyhouseconcerts.org/gift-certificates",
    "http://www.wileyhouseconcerts.org/photos",
    "http://www.wileyhouseconcerts.org/calendar",
    "http://www.wileyhouseconcerts.org/go/member/edit",
    "http://www.wileyhouseconcerts.org/book-your-event",
    "http://www.wileyhouseconcerts.org/about-us",
    "http://www.wileyhouseconcerts.org/home",
    "http://www.wileyhouseconcerts.org/artists"
  ],
  "candidate_links": [
    "http://www.wileyhouseconcerts.org/go/help",
    "http://www.wileyhouseconcerts.org/contact",
    "http://www.wileyhouseconcerts.org/membership-support",
    "http://www.wileyhouseconcerts.org/book-your-event",
    "http://www.wileyhouseconcerts.org/about-us",
    "http://www.wileyhouseconcerts.org/artists",
    "https://www.facebook.com/WileyHouseConcerts/"
  ],
  "visited": [
    "http://www.wileyhouseconcerts.org/",
    "http://www.wileyhouseconcerts.org/about",
    "http://www.wileyhouseconcerts.org/contact",
    "http://www.wileyhouseconcerts.org/staff",
    "http://www.wileyhouseconcerts.org/team",
    "http://www.wileyhouseconcerts.org/board",
    "http://www.wileyhouseconcerts.org/directory",
    "http://www.wileyhouseconcerts.org/events",
    "http://www.wileyhouseconcerts.org/sitemap.xml",
    "http://www.wileyhouseconcerts.org/council",
    "http://www.wileyhouseconcerts.org/leadership",
    "http://www.wileyhouseconcerts.org/management",
    "http://www.wileyhouseconcerts.org/producers",
    "http://www.wileyhouseconcerts.org/support",
    "http://www.wileyhouseconcerts.org/crew",
    "http://www.wileyhouseconcerts.org/members",
    "http://www.wileyhouseconcerts.org/bios",
    "http://www.wileyhouseconcerts.org/people",
    "http://www.wileyhouseconcerts.org/artists",
    "http://www.wileyhouseconcerts.org/musicians",
    "http://www.wileyhouseconcerts.org/faculty",
    "http://www.wileyhouseconcerts.org/administration",
    "http://www.wileyhouseconcerts.org/go/help",
    "http://www.wileyhouseconcerts.org/contact",
    "http://www.wileyhouseconcerts.org/membership-support",
    "http://www.wileyhouseconcerts.org/book-your-event",
    "http://www.wileyhouseconcerts.org/about-us",
    "http://www.wileyhouseconcerts.org/artists",
    "https://www.facebook.com/WileyHouseConcerts/"
  ],
  "base_url": "http://www.wileyhouseconcerts.org/"
}