{
  "pages": [
    {
      "url": "https://www.worldfamouscigarbar.com/contact/",
      "is_candidate": false,
      "has_email": false,
      "text": "Get In Touch\nWe can take your questions & event planning inquiries via the contact form.\nFirst Name\n*\nEmail Address\n*\nPhone Number\nMessage\n0 / 180\nSend Message\nCall:  (239) 337-4662\nCall:  (239) 267-6020\nCall:  (239) 471-0294\nCall:  (239) 689-5146",
      "emails": []
    },
    {
      "url": "https://www.worldfamouscigarbar.com/about-the-world-famous-cigar-bar/",
      "is_candidate": false,
      "has_email": false,
      "text": "About\nAbout The “World Famous” Cigar Bar\nThere’s plenty to look at inside, too, with a great array of taxidermy and the right blend of textures, including leopard skins and antique martini shakers. It’s comfortable from all angles, with high ceilings and ample smoke filtration, and the room is comprised of groupings of winged high-backed chairs with a couple of leather couches. Of course, there are plasma TVs, so you can catch your favorite sports and stay current on world events, with the perfect blend of killer tunes and a solid staff of friendly professionals.\nBut this isn’t just a smoke-friendly bar room, it’s way more than that and can best be called a downtown neighborhood bar and the quintessential place for those ever-present,\n“Good Times and Great Cigars.”\nThey said it would be near impossible, but in 2007, Castiano knew it was time to grow, and ‘The World-Famous Cigar Bar’, was successfully recreated in the\nGulf Coast Town Center\n, Southwest Florida’s largest shopping mall.\nRich Castiano has earned a reputation and made the kind of friendships that run deep in the cigar industry, and his ‘World Famous Cigar Bar’ concept is just that…known and respected around the globe.\nOne of those mutual respect friendships that he developed over the years with Rocky Patel led to his role in developing a different concept from his more traditional “cigar bar.”\nIn 2010 Rich became a partner, found the location, and was instrumental in the opening of ‘Burn by Rocky Patel’ a new evolution of the luxury cigar lounge and nightclub in Naples, Florida.\nHe started from the bottom up and since has opened three locations, consulted others, shared his experiences, and partnered with one of the biggest names in the industry. But he’s most proud of the relationships he has developed with the many legendary and iconic cigar families. Rich Castiano knows cigars from ‘seed to stick’ and has made many trips to Honduras, and Nicaragua and has planted, harvested, and selected the leaf for his signature cigar series. He has taken staff and clients with him and has shared the enchantment of the growing and manufacturing process with dozens of veteran and new cigar aficionados.\nIn Fort Myers, visitors and regulars know where to find the most educated staff of professionals that, year after year, provide the perfect guest experience, and it’s that consistency that is the cornerstone of the Castiano family.\n“I always wanted to create a staff of friends that became part of a bigger family, and through the years, we have accomplished that. Everything we do, we do as a family, and our guests become our friends so providing hospitality, service, and education about cigars, spirits, and wine is not only our focus, but also becomes our pleasure.”\nThe World-Famous Cigar Bar is just that kind of place. You’ll never see a day when a member of the Castiano Family isn’t there, and since it first opened in 1996, you can count on seeing a familiar face, every day.\nThe Castiano family moved away from New York first, and Rich joined them in Florida in 1982, following his years at Cortland State College. Many long-time residents of the area remember Rich from that long ago, when he worked at TGI Fridays, when the Bell Tower was new, and “way down south on 41”. In those days, TGI Fridays was the busiest restaurant bar in all of Southwest Florida, and the bar staff was the area’s best. Rich worked there for many years and was a friendly bartender who was also certified as one of Friday’s Corporate Bar Trainers.\nIn fact, he was still working shifts at TGI Fridays when he opened his first Downtown Cigar Shoppe, a place that was about as big as his current humidor.\n“So you know I like great cigars and fine spirits and wine, and we got the chance to do them both together, just about the time they both were finding a new popularity. I’ll never forget those first days, my father and I on our hands and knees pulling nails out of the floor, all of us working through the hurdles together to get the place opened.\nRich’s mom, Arlene (“Mrs. C”), opened the Downtown location almost every morning and is someone who would help pick out just the right bundle or box of cigars for a delightful smoke or the perfect gift.\nArlene passed in 2016, and she is sorely missed by many, customers will still sit in the downtown location and talk about what a wonderful woman she was. Rich’s sister Sally manages the books from top to bottom. Sure, Sal Castiano makes regular stops at all 3 locations to watch sports and enjoy a premium cigar.\n“It hasn’t been easy, but it has been rewarding, when we started, there weren’t any places like us. We are different; we encouraged smoking premium cigars and wanted customers to have a fantastic selection of spirits in a setting like no other. From Louis XIII to ice-cold Jagermeister, I wanted to have it all available, for all kinds of customers, everybody is always welcome.”\nRich Castiano has created one of the all-time great places to unwind and both locations are the fiber of the community surrounding them. The World-Famous Cigar Bar’ is ‘home base’ where you’ll always see a familiar face, and it’s that way at the landmark Downtown location, and it’s that way for the community that encompasses Gulf Coast Town Center.\nFor Rich Castiano it all goes back to the first time he saw his father and relatives light those sticks, and the special times and occasions that he is connected and committed to.\n“I really like the room the best when I see people celebrating with friends, having birthday parties, anniversaries, and buying cigars to celebrate births and special occasions. You know, there’s nothing wrong with paying tribute to the good times.”",
      "emails": []
    },
    {
      "url": "https://www.worldfamouscigarbar.com/events/",
      "is_candidate": false,
      "has_email": false,
      "text": "The \"World Famous\" Cigar Bar\n3 Locations in SWFL\n[tribe_events]\n[tribe_events]",
      "emails": []
    },
    {
      "url": "http://www.worldfamouscigarbar.com/events",
      "is_candidate": false,
      "has_email": false,
      "text": "The \"World Famous\" Cigar Bar\n3 Locations in SWFL\n[tribe_events]\n[tribe_events]",
      "emails": []
    }
  ],
  "all_links": [
    "https://www.worldfamouscigarbar.com/cigar-rolling-events-2/",
    "https://www.worldfamouscigarbar.com/about/",
    "https://www.worldfamouscigarbar.com/event/whiskey-tasting/",
    "https://www.worldfamouscigarbar.com/live-music/",
    "https://www.worldfamouscigarbar.com/contact/",
    "https://www.worldfamouscigarbar.com/the-humidor/",
    "https://www.worldfamouscigarbar.com/about-the-world-famous-cigar-bar/",
    "http://www.worldfamouscigarbar.com/privacy-policy",
    "https://www.worldfamouscigarbar.com/locations/",
    "https://www.worldfamouscigarbar.com/",
    "https://www.worldfamouscigarbar.com/events/",
    "http://www.worldfamouscigarbar.com/events",
    "https://www.worldfamouscigarbar.com/the-bar/"
  ],
  "candidate_links": [
    "https://www.worldfamouscigarbar.com/contact/",
    "https://www.worldfamouscigarbar.com/about-the-world-famous-cigar-bar/",
    "https://www.worldfamouscigarbar.com/events/",
    "http://www.worldfamouscigarbar.com/events"
  ],
  "visited": [
    "http://www.worldfamouscigarbar.com/live/",
    "http://www.worldfamouscigarbar.com/about",
    "http://www.worldfamouscigarbar.com/contact",
    "http://www.worldfamouscigarbar.com/staff",
    "http://www.worldfamouscigarbar.com/team",
    "http://www.worldfamouscigarbar.com/board",
    "http://www.worldfamouscigarbar.com/directory",
    "http://www.worldfamouscigarbar.com/events",
    "http://www.worldfamouscigarbar.com/sitemap.xml",
    "http://www.worldfamouscigarbar.com/council",
    "http://www.worldfamouscigarbar.com/leadership",
    "http://www.worldfamouscigarbar.com/management",
    "http://www.worldfamouscigarbar.com/producers",
    "http://www.worldfamouscigarbar.com/support",
    "http://www.worldfamouscigarbar.com/crew",
    "http://www.worldfamouscigarbar.com/members",
    "http://www.worldfamouscigarbar.com/bios",
    "http://www.worldfamouscigarbar.com/people",
    "http://www.worldfamouscigarbar.com/artists",
    "http://www.worldfamouscigarbar.com/musicians",
    "http://www.worldfamouscigarbar.com/faculty",
    "http://www.worldfamouscigarbar.com/administration",
    "https://www.worldfamouscigarbar.com/contact/",
    "https://www.worldfamouscigarbar.com/about-the-world-famous-cigar-bar/",
    "https://www.worldfamouscigarbar.com/events/",
    "http://www.worldfamouscigarbar.com/events"
  ],
  "base_url": "http://www.worldfamouscigarbar.com/live/"
}