{
  "fuentes": [
    {
      "url": "https://clubbookers.com/miami/clubs/e11even-miami/",
      "email": "concierge@clubbookers.com"
    },
    {
      "url": "https://tracxn.com/d/companies/e11even-miami/__zWK8au48vkGbfYVgabUKNu6SIRW5jckviz2mnBpiJLw/founders-and-board-of-directors",
      "email": "hi@tracxn.com"
    },
    {
      "url": "http://11miami.com.urstaging.com/contact/join-the-cast/",
      "email": "tables@11miami.com"
    },
    {
      "url": "https://clubbookers.com/e11even-miami-drinks-menu-prices/",
      "email": "concierge@clubbookers.com"
    },
    {
      "url": "https://e11evenlife.com/pages/customer-support",
      "email": "e11evenlife_blk_ffdcd5e1-e185-4a10-a859-4f7b428a3468_200x@2x.png"
    },
    {
      "url": "https://e11evenlife.com/pages/customer-support",
      "email": "e11evenlife_blk_ffdcd5e1-e185-4a10-a859-4f7b428a3468_80x@2x.png"
    },
    {
      "url": "https://e11evenlife.com/pages/customer-support",
      "email": "e11evenlife_wht_4f628856-047a-4709-840a-82b78993c5b3_200x@2x.png"
    },
    {
      "url": "https://e11evenlife.com/pages/customer-support",
      "email": "e11evenlife_wht_4f628856-047a-4709-840a-82b78993c5b3_80x@2x.png"
    },
    {
      "url": "https://www.11miami.com/",
      "email": "tables@11miami.com"
    },
    {
      "url": "https://www.11miami.com/live-from-11-terms-conditions",
      "email": "11marketing@11miami.com"
    },
    {
      "url": "https://www.11miami.com/accessibility",
      "email": "ada-accommodations@11miami.com"
    },
    {
      "url": "https://www.11miami.com/accessibility",
      "email": "tables@11miami.com"
    },
    {
      "url": "https://www.11miami.com/attentive-terms-conditions",
      "email": "11marketing@11miami.com"
    },
    {
      "url": "https://www.11miami.com/attentive-terms-conditions",
      "email": "info@11miami.com"
    },
    {
      "url": "https://www.rollingstone.com/product-recommendations/lifestyle/e11even-miami-tenth-anniversary-owners-interview-1234976130/",
      "email": "tchan@rollingstone.com"
    },
    {
      "url": "https://www.11miami.com/giselle",
      "email": "host@gisellemiami.com"
    },
    {
      "url": "https://www.11miami.com/privacy-policy",
      "email": "info@11miami.com"
    },
    {
      "url": "http://11miami.com.urstaging.com/about-us/24hour-menu/",
      "email": "tables@11miami.com"
    },
    {
      "url": "http://11miami.com.urstaging.com/contact/",
      "email": "tables@11miami.com"
    }
  ],
  "mails": [
    "11marketing@11miami.com",
    "ada-accommodations@11miami.com",
    "concierge@clubbookers.com",
    "e11evenlife_blk_ffdcd5e1-e185-4a10-a859-4f7b428a3468_200x@2x.png",
    "e11evenlife_blk_ffdcd5e1-e185-4a10-a859-4f7b428a3468_80x@2x.png",
    "e11evenlife_wht_4f628856-047a-4709-840a-82b78993c5b3_200x@2x.png",
    "e11evenlife_wht_4f628856-047a-4709-840a-82b78993c5b3_80x@2x.png",
    "hi@tracxn.com",
    "host@gisellemiami.com",
    "info@11miami.com",
    "tables@11miami.com",
    "tchan@rollingstone.com"
  ],
  "nombre_sitio": "11miami.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://clubbookers.com/miami/clubs/e11even-miami/",
      "text": "E11EVEN Miami - Bottle Service and VIP Table Booking Skip to content Global Concierge for VIP Night Outs, Restaurants and Party Planning More info 24/7 Nightlife Concierge Night Clubs, Restaurants, Party Planner. Chat Now Call Now Choose City: Miami Australia Sydney Canada Toronto Denmark Copenhagen France Cannes Paris Saint Tropez Greece Mykonos Hongkong Hong Kong Indonesia Bali Italy Milan Rome Japan Tokyo Mexico Tulum Monaco Monaco Portugal Lisbon Russia Moscow Singapore Singapore Spain Barcelona Ibiza Madrid Marbella Sweden Stockholm Switzerland Zürich UAE Dubai UK London Manchester Newcastle USA Atlanta Boston Chicago Dallas Las Vegas Los Angeles Miami New York Philadelphia San Francisco Scottsdale Washington DC Atlanta Bali Barcelona Boston Cannes Chicago Copenhagen Dallas Dubai Hong Kong Ibiza Las Vegas Lisbon London Los Angeles Madrid Manchester Marbella Miami Milan Monaco Moscow Mykonos New York Newcastle Paris Philadelphia Rome Saint Tropez San Francisco Scottsdale Singapore Stockholm Sydney Tokyo Toronto Tulum Washington DC Zürich All Miami Clubs NYE 2022 VIP Concierge Services Nightlife Blog Contact Music DJ, Hip-Hop Dresscode Dress to Impresss Capacity 650 Work hours 8:00 PM - 8:00 AM BOOK NOW Club Bookers > Miami > All Clubs > E11EVEN 4.8 E11EVEN 29 NE 11th St, Miami, FL 33132, USA Show map Bottle Service Drinks Menu Table Prices E11EVEN Miami Bottle Service and VIP Table Booking E11EVEN Miami takes the extreme South Florida nightlife scene to another level as it is one-of-a-kind nightclub offering impeccable guest services & an unforgettable clubbing experience. At E11EVEN, you can expect state-of-the-art five-star hospitality inside the sprawling 20,000 square feet, $40 million nightclub area. Being located in the heart of the downtown Miami, the E11EVEN nightclub is just a few blocks away from the mainland Brickell & American Airlines arena. To top it all, the club is just some minutes walk from the South Beach in Miami. Operating as a full-range 24/7 nightclub in the city, the E11EVEN nightclub is known for its after-hours intense experiences to the guests. The E11EVEN nightclub features stunning theatrical performances & live events set up in a highly alluring environment with a high level of sophistication. Exotic acts, elaborate custom costumes, and E11EVEN-style theatrics consume the overall aura of the clubbing space every weekend. So, if you are looking for some dazzling circus-like theatrics & cabaret dancers on your way to the club, the E11EVEN is a perfect clubbing destination for you! E11EVEN Club Miami Information What is the address for E11EVEN? The E11EVEN nightclub in Miami is located on the 11 street between Miami Ave & the 1st Ave. What is the entry fee for E11EVEN? The E11EVEN nightclub usually charges around $20 for entry 24/7 into the club. How can I get on the guestlist of E11EVEN? If you wish to experience the intense, high feel of the nightlife clubbing experience when in Miami, make sure that you are a part of the elite guestlist at the E11EVEN nightclub. For doing this, you can reach out to us on WhatsApp or through our call services. We are also known for offering high-end 24/7 concierge services for your ease of clubbing! How to book a VIP table at E11EVEN Miami? Do not miss out the immense fun & exhilaration when in Miami! Make it a point to go for pre-table bookings at the E11EVEN nightclub in Miami with our help. We offer VIP table booking services for the E11EVEN nightclub in Maim. Send us your query right now on WhatsApp or give us a call! What is the dress code for E11EVEN? Be dressed in your upscale club attire when headed to the lavish E11EVEN nightclub. Avoid wearing casual wear or sportswear to one of the best night clubs in Miami . Gallery See all 12 photos Opening Times Thursday 8:00 pm To 10:00 am Friday 8:00 pm To 10:00 am Saturday 8:00 pm To 10:00 am Friday 8:00 pm To 10:00 am Upcoming Events THURSDAY'S E11EVEN Thursday, 11 September DJ, Hip-Hop Book Table FRIDAY'S E11EVEN Friday, 12 September DJ, Hip-Hop Book Table SATURDAY'S E11EVEN Saturday, 13 September DJ, Hip-Hop Book Table FRIDAY'S E11EVEN Friday, 12 September DJ, Hip-Hop Book Table Video Location Reviews Leave a review Submit Your Review Your review Your overall rating Select a Rating 5 Stars 4 Stars 3 Stars 2 Stars 1 Star Your name Your email Your review Submit Review No Title February 17, 2023 Came here for the first time in March. The club is very nice and taken care of. Get there between 9-10 if you want to guarantee your entry if you don’t have online prepaid tickets. Drinks were usually 20-28 for mixed, seltzers for 8-12, and beer from 9-16. Don’t come here if you don’t want to spend money. I don’t mind spending money here because it’s a blast. The more you are willing to spend the more fun you’ll have. We went 2 nights in a row because of how much fun we had. Performers we watched were great as well. Daranger Cunningham No Title March 13, 2022 You’ll see plenty of dancers here. The entertainment and performances were very good. Kylie No Title March 13, 2022 We had the best time ever at this club! Thank you all for making our VIP visit the highlight of our vacation in Miami! Jorge No Title March 13, 2022 Despite the fact that strip club was amazing and professional, I found the drinks to be overpriced and didn’t appeal to my taste buds. Elsa No Title March 13, 2022 We found this to be the best spot in Miami. The drinks were excellent and the prices were better than any other venues we have visited. Berta WHATSAPP US For Bookings, Prices and more Infos MESSAGE NOW Or call us +1 347 759-6146 Book Your VIP Table Contact your 24/7 Global Nightlife Concierge for last minute booking and further questions. WhatsApp us on +1 347 759-6146 Date of birth Date of Booking Special Request Δ Contact Us For more information please contact us directly WHATSAPP 13477596146 PHONE +1 347 759-6146 EMAIL concierge@clubbookers.com Other Clubs You May Like Best party hotspots in miami Gala 4.6 Location Miami Music House, DJ Dress Dress to Impress Busy Nights Bottled Blonde 5 Location Miami Music Hip Hop, Top 40 Music Dress Smart Casual Busy Nights Gold Rush Cabaret 4.5 Location Miami Music Commercial & Club Hits Dress Strictly fabulous & Chic Busy Nights Sat Booby Trap 5 Location Miami Music Rock, House & more Dress Smart / Casual Busy Nights Sun, Sat DAER Nightclub 4.4 Location Miami Music Hip Hop, EDM Dress Upscale fashionable Busy Nights Sat Centro Wynwood 4.2 Location Miami Music EDM, Hip Hop Dress Casuals Busy Nights Sun, Sat See All Clubs Birthday or Special Event coming up? Get in touch with your VIP Nightlife Concierge and plan your party now! More Info WE ARRANGE YOUR FULL LUXURY EXPERIENCE FOR ALL Get in touch with our VIP Concierge now Contact Concierge More Info Book Your VIP Table Contact your 24/7 Global Nightlife Concierge for last minute booking and further questions. WhatsApp us on +1 347 759-6146 Date of birth Date of Booking Special Request Δ Contact Concierge Book Now Book Your VIP Table Contact your 24/7 Global Nightlife Concierge for last minute booking and further questions. WhatsApp us on +1 347 759-6146 Date of birth Date of Booking Special Request Δ What our Clients Say View All Reviews Contact Our VIP Concierge Whatsapp iMessage SMS Call Now Email Contact our 24/7 VIP Nightlife & Lifestyle Concierge. We got you covered. Thank you for your booking request! Our concierge team will contact you shortly. To speed up the process please contact us directly on: +1 347 759-6146 Chat Now Call Now Email Now We will provide further details about minimum spend per table, dress code and arrival time. Also make sure to follow us on social media: GET A QUOTE NOW Contact us now and get an exact quote for your experience. Fill out the form below or contact us directly. Chat Now Call Now [dynamichidden referencenumber \"acf field='free_services_info'\"] [dynamichidden chapter \"CF7_get_post_var key='title'\"] Send Request Δ Miami Night Clubs Gala Bottled Blonde Gold Rush Cabaret Booby Trap DAER Nightclub Centro Wynwood Strawberry Moon Racket Exchange El Santo Bar Bevy (swan upstairs) Heart Nightclub E11EVEN Komodo Miami Mokai Mr. Jones Nikki Beach Studio 23 Doheny Room Cameo Wall Lounge Story Vendome LIV Hyde South Beach Byblos Basement Pearl Lounge Ora Nautilus Cabana Mynt Lounge Club Space Clevelander Site Map Home Vip Concierge Services Nightlife Blog Contact Us Contacts Chat Now Call Now WhatsApp 13477596146 Telephone +1 347 759-6146 E-mail concierge@clubbookers.com Atlanta Bali Barcelona Boston Cannes Chicago Copenhagen Dallas Dubai Hong Kong Ibiza Las Vegas Lisbon London Los Angeles Madrid Manchester Marbella Miami Milan Monaco Moscow Mykonos New York Newcastle Paris Philadelphia Rome Saint Tropez San Francisco Scottsdale Singapore Stockholm Sydney Tokyo Toronto Tulum Washington DC Zürich Privacy Policy | Terms & Conditions Copyright@2025 | Club Bookers"
    },
    {
      "url": "https://tracxn.com/d/companies/e11even-miami/__zWK8au48vkGbfYVgabUKNu6SIRW5jckviz2mnBpiJLw/founders-and-board-of-directors",
      "text": "E11EVEN Miami - 2025 Company Profile, Team & Competitors - Tracxn JavaScript is disabled in your browser. enable it to enjoy the full features of Tracxn. Your browser was unable to load all of Tracxn resources. They may have been blocked by your firewall, proxy or browser configuration. Press Ctrl+F5 or Ctrl+Shift+R to have your browser try again and if that doesn't work, click here to retry or mail us at hi@tracxn.com Internal Server Error Toggle navigation Customers Investment Industry Venture Capital Funds Private Equity Funds Accelerators & Incubators Investment Banks Corporates and Startups Corp Dev and M&A Teams Corporate Innovation Startup Founders Sales Team Ecosystem Journalists and Publications Universities View All Customers Contact Us Offerings Rich Data Sets Companies Investors Funding Acquisitions Financials Cap Tables Employee Count Deep Dives Company deep-dive Investor deep-dive Activity by Corporates Sector Coverage Workflow Solutions Sourcing new deals Tracking Market Updates Portfolio Management Deal Flow CRM LiveDeals And Much More... Data Solutions Reports by Tracxn Enterprise Grade Support Sector Coverage Apps & Extensions View All Offerings Contact Us Try our premium features for FREE - no threads attached! Learn More Get Started. Itâs FREE Company About us Our Investors Media & Newsroom Careers Contact Us Pricing Login Get Started. It's FREE! Discover > Companies > E11EVEN Miami Navigate to Overview About the company Funding and Investors Founders and Board of Directors Competitors and Alternates Investments and Acquisitions Reports News Competitors Landscape Comparables Who's likely to Invest? All Related Reports E11EVEN Miami - Company Profile Last updated: June 16, 2025 Claim Profile Suggest Edits Linkedin Twitter Facebook Email Copy Url Request page removal E11EVEN Miami - About the company E11EVEN Miami is an unfunded company based in Miami (United States), founded in 2013 by Dennis DeGori . It operates as an Online event ticketing marketplace provider for nightclubs . E11EVEN Miami has not raised any funding yet . The company has 30 active competitors, including 6 funded and 2 that have exited . Its top competitor s include companies like Discotech , Bevvy and Galavantier . Company Details Online event ticketing marketplace provider for nightclubs. The company caters to private events and bachelorette parties. Features include going on the guest lists, table reservations management, and etc. Website www.11miami.com/ Social Email ID *****@11miami.com Phone Number +1 ********** Key Metrics Founded Year 2013 Location Miami, United States Stage Unfunded Ranked 8 th among 30 active competitors Similar Companies DesignMyNight London & 187 more E11EVEN Miami's funding and investors E11EVEN Miami has not raised any funding rounds yet. E11EVEN Miami's founders and board of directors Founder? Claim Profile The founders of E11EVEN Miami is Dennis DeGori . Here are the details of E11EVEN Miami's key team members: Dennis DeGori : Founder & CEO of E11EVEN Miami . View details of E11EVEN Miami 's Founder profiles and Board Members Access Tracxn on any website Our Google Chrome extension lets you view company details while browsing their websites Install Tracxn Extension E11EVEN Miami's Competitors and alternates Top competitor s of E11EVEN Miami include Discotech , Bevvy and Galavantier . Here is the list of Top 10 competitors of E11EVEN Miami , ranked by Tracxn score: Overall Rank Company Details Short Description Total Funding Investors Tracxn Score 1st Discotech 2013 , Los Angeles ( United States ) , Funding Raised Nightlife discovery platform - Wavemaker Partners , Seraph Group Â &Â 5 Â others 49/100 2nd Bevvy 2010 , Los Angeles ( United States ) , Seed Ticket booking platform for nightlife events $2.9M - 48/100 3rd Galavantier 2008 , Las Vegas ( United States ) , Series A Online marketplace for nightlife events $3.29M - 27/100 4th Flite 2022 , New York City ( United States ) , Seed Ticket booking platform for nightlife events $125K LAUNCH Accelerator , BullMont Capital Â &Â 1 Â others 24/100 5th Up All Night 2015 , San Francisco ( United States ) , Seed Subscription-based nightlife event discovery platform $500K 500 Global 22/100 6th Pure Nightclub 2017 , Miami ( United States ) , Unfunded Platform that offers night life events including live DJ performances and events - - 21/100 7th CLUB SPACE 2000 , Miami ( United States ) , Acquired Platform offering Nightlife event tickets - - 21/100 8th E11EVEN Miami 2013 , Miami ( United States ) , Unfunded Online event ticketing marketplace provider for nightclubs - - 20/100 9th BottlesWaiting 2014 , Las Vegas ( United States ) , Unfunded Mobile app-based nightlife discovery platform - - 18/100 10th Crave Tickets 2005 , New York City ( United States ) , Unfunded Online ticketing marketplace for nightlife events - - 18/100 Get insights and benchmarks for competitors of 2M+ companies! Sign up today! Looking for more details on E11EVEN Miami 's competitors? Click here to see the top ones E11EVEN Miami's Investments and acquisitions E11EVEN Miami has made no investments or acquisitions yet. Reports related to E11EVEN Miami Here is the latest report on E11EVEN Miami's sector: Free Online Event Ticketing - Sector Report Edition: March, 2025 (71 Pages) View all reports related to E11EVEN Miami News related to E11EVEN Miami â¢ Madison Realty Capital Provides $262M Construction Loan for Miami Luxury Tower Commercial Observer â¢ Jun 01, 2023 â¢ Madison Realty Capital , Propertymg , E11EVEN  Residences , E11EVEN Miami â¢ Miamiâs E11EVEN Condo Nabs $149M Construction Loan From Starwood Commercial Observer â¢ Feb 04, 2022 â¢ E11EVEN Miami , Propertymg â¢ E11EVEN MIAMI Becomes The First Major Nightlife Venue In The United States To Accept Bitcoin PR Newswire â¢ Apr 13, 2021 â¢ E11EVEN Miami Get curated news about company updates, funding rounds, M&A deals and others. Sign up today! View complete company profile of E11EVEN Miami Are you a Founder ? Claim your Profile Claim and keep your data updated to ensure investors can find you easily. Looking to raise funds? Showcase fundraising requirement to VCs, PEs, Angels & IBs. Find Investors for your Next Round Discover potential investors for your next round of investment. FAQs about E11EVEN Miami When was E11EVEN Miami founded? E11EVEN Miami was founded in 2013. Where is E11EVEN Miami located? E11EVEN Miami is located in Miami, United States . Who are the top competitors of E11EVEN Miami? E11EVEN Miami's top competitor s are Discotech , Bevvy and Galavantier . What does E11EVEN Miami do? Online event ticketing marketplace provider for nightclubs. The company caters to private events and bachelorette parties. Features include going on the guest lists, table reservations management, and etc. Where does E11EVEN Miami rank among its competitors? E11EVEN Miami ranks 8 amongst 30 active competitors. Explore our recently published companies Axial Adventure - Mission Viejo based, 2022 founded, Unfunded company Market Minds Asdvisory - London based, 2012 founded, Unfunded company Ark.today - 2015 founded, Unfunded company GlobalAssist - Dubai based, 2024 founded, Unfunded company Khajuraho Dairy Products - India based, Unfunded company Verbeeminstallaties.nl - Netherlands based, Unfunded company Get full company profile in your inbox Get Company Profile Unlock full data with our Lite plan! Sign Up and Get Free Access Tracxn powers 1,000+ customers across 30+ countries Company About us Our Investors News and Press Resources Investor Relations ODR Portal Terms of Use Privacy Policy GDPR FAQs Careers Customers Venture Capital Funds Private Equity Funds Accelerators and Incubators Investment Banks Corporate Innovation CorpDev and M&A Teams Startup Founders Journalists and Publications Customer Testimonials Explore Tracxn Discover interesting lists Sector Research Offerings Search for Indian Legal Entity Quick Links Schedule Demo Get in touch See Pricing Plans Â© 2025 Tracxn Technologies Limited. All rights reserved. Registered Office: L-248, 2nd Floor, 17th Cross, Sector 6, HSR Layout, Bengaluru, Karnataka 560102. CIN: L72200KA2012PLC065294. Investor Grievances & Compliance: Megha Tibrewal, Company Secretary & Compliance Officer | Email: | Phone: ."
    },
    {
      "url": "http://11miami.com.urstaging.com/contact/join-the-cast/",
      "text": "Apply to E11EVEN Miami | We Are Hiring Club Dancers & Staff MIAMI SPICE Contact Press 11USA GROUP ROOFTOP/RESTAURANT Home Events News Explore Reservations NIGHTCLUB ROOFTOP RESTAURANT Menu Media Photos Videos Book Table Inquiry Tickets Guest List Bachelorette Private Parties Home Events News Explore Reservations NIGHTCLUB ROOFTOP RESTAURANT Menu Media Photos Videos Book Table Inquiry Tickets Guest List Bachelorette Private Parties contact Press ROOFTOP/RESTAURANT © Copyright 2015 E11EVEN MIAMI. All Rights Reserved. Privacy Policy Employment Join Newsletter | 29 NE 11TH ST , MIAMI , FL 33132 (305)829-2911"
    },
    {
      "url": "https://clubbookers.com/e11even-miami-drinks-menu-prices/",
      "text": "E11EVEN Miami drinks menu - Club Bookers Skip to content Global Concierge for VIP Night Outs, Restaurants and Party Planning More info 24/7 Nightlife Concierge Night Clubs, Restaurants, Party Planner. Chat Now Call Now Choose City: Miami Australia Sydney Canada Toronto Denmark Copenhagen France Cannes Paris Saint Tropez Greece Mykonos Hongkong Hong Kong Indonesia Bali Italy Milan Rome Japan Tokyo Mexico Tulum Monaco Monaco Portugal Lisbon Russia Moscow Singapore Singapore Spain Barcelona Ibiza Madrid Marbella Sweden Stockholm Switzerland Zürich UAE Dubai UK London Manchester Newcastle USA Atlanta Boston Chicago Dallas Las Vegas Los Angeles Miami New York Philadelphia San Francisco Scottsdale Washington DC Atlanta Bali Barcelona Boston Cannes Chicago Copenhagen Dallas Dubai Hong Kong Ibiza Las Vegas Lisbon London Los Angeles Madrid Manchester Marbella Miami Milan Monaco Moscow Mykonos New York Newcastle Paris Philadelphia Rome Saint Tropez San Francisco Scottsdale Singapore Stockholm Sydney Tokyo Toronto Tulum Washington DC Zürich All Miami Clubs NYE 2022 VIP Concierge Services Nightlife Blog Contact Music DJ, Hip-Hop Dresscode Dress to Impresss Capacity 650 Work hours 8:00 PM - 8:00 AM BOOK NOW Club Bookers > Miami > All Clubs > E11EVEN Miami Drinks Menu Prices E11EVEN Miami Drinks Menu Prices The E11EVEN nightclub in Miami is known for recreating the nightlife scene in South Florida. The club is spread across the sprawling 20,000 square feet area and is known for its impeccable guest experiences. The E11EVEN nightclub in Miami is one such venue that is known for combining state-of-the-art lighting & sound system. The $40-million entertainment clubbing venue is located in Downtown Miami –just a few minutes from the South Beach. The club is known to operate as the 24-hour day club and nightclub venue and features stunning clubbing décor. The E11EVEN nightclub in Miami comprises of multiple stages and dance floors along with interactive audio-visuals, aerial performances, and theatrical characters. Make the most of your clubbing experience at the high-end E11EVEN nightclub in Miami. How much is the drink services minimum spends at E11EVEN, Miami? When you wish to make the most of clubbing experience at the lavish E11EVEN Miami nightclub, you can consider making use of its exclusive bottle services. The minimum spends for the drink prices at the E11EVEN nightclub in Miami tend to be around $500 on an average. The drink prices, however, might change at times owing to the total number of guests, availability, the particular night or event in the club, talent spinning, and so more. How much is the drink price at E11EVEN, Miami? The drinks at E11EVEN Miami nightclub are priced moderately. You can consider spending around $500 to $700 for the average alcohol bottles. Vodka here starts at around $700 and champagne can cost you around $1100 for the bottles. You might experience some changes in the overall drink prices on some occasions. How Can I book bottle services at E11EVEN, Miami? You can make the most of the bottle services offered at E11EVEN nightclub in Miami by filling out the online booking form or contacting us right away. Drinks Menu CONTACT CONCIERGE Book Now Contact Us For more information please contact us directly WHATSAPP 13477596146 PHONE +1 347 759-6146 EMAIL concierge@clubbookers.com Other Clubs You May Like Best party hotspots in miami Gala 4.6 Location Miami Music House, DJ Dress Dress to Impress Busy Nights Bottled Blonde 5 Location Miami Music Hip Hop, Top 40 Music Dress Smart Casual Busy Nights Gold Rush Cabaret 4.5 Location Miami Music Commercial & Club Hits Dress Strictly fabulous & Chic Busy Nights Sat Booby Trap 5 Location Miami Music Rock, House & more Dress Smart / Casual Busy Nights Sun, Sat DAER Nightclub 4.4 Location Miami Music Hip Hop, EDM Dress Upscale fashionable Busy Nights Sat Centro Wynwood 4.2 Location Miami Music EDM, Hip Hop Dress Casuals Busy Nights Sun, Sat See All Clubs Book Your VIP Table Contact your 24/7 Global Nightlife Concierge for last minute booking and further questions. WhatsApp us on +1 347 759-6146 Date of birth Date of Booking Special Request Δ Contact Our VIP Concierge Whatsapp iMessage SMS Call Now Email Contact our 24/7 VIP Nightlife & Lifestyle Concierge. We got you covered. Thank you for your booking request! Our concierge team will contact you shortly. To speed up the process please contact us directly on: +1 347 759-6146 Chat Now Call Now Email Now We will provide further details about minimum spend per table, dress code and arrival time. Also make sure to follow us on social media: GET A QUOTE NOW Contact us now and get an exact quote for your experience. Fill out the form below or contact us directly. Chat Now Call Now [dynamichidden referencenumber \"acf field='free_services_info'\"] [dynamichidden chapter \"CF7_get_post_var key='title'\"] Send Request Δ Chat Now Call Now Site Map Home Vip Concierge Services Nightlife Blog Contact Us Contacts WhatsApp 13477596146 Telephone +1 347 759-6146 E-mail concierge@clubbookers.com Atlanta Bali Barcelona Boston Cannes Chicago Copenhagen Dallas Dubai Hong Kong Ibiza Las Vegas Lisbon London Los Angeles Madrid Manchester Marbella Miami Milan Monaco Moscow Mykonos New York Newcastle Paris Philadelphia Rome Saint Tropez San Francisco Scottsdale Singapore Stockholm Sydney Tokyo Toronto Tulum Washington DC Zürich Privacy Policy | Terms & Conditions Copyright@2025 | Club Bookers"
    },
    {
      "url": "https://e11evenlife.com/pages/customer-support",
      "text": "Customer Support\n– E11EVEN LIFE Loading Skip to content Home Shop Expand submenu Collapse submenu Shop HATS MEN WOMEN SHOES ACCESSORIES Gallery News Nightlife 11captainsclub.io Home Shop HATS MEN WOMEN SHOES ACCESSORIES Gallery News Nightlife 11captainsclub.io Menu Cart 0 Menu Cart 0 Contact us Name Email Message Send This site is protected by hCaptcha and the hCaptcha Privacy Policy and Terms of Service apply. Join the club Enter your email Instagram Facebook Twitter Search Support Return Policy Shipping Policy Privacy Policy Terms of Service Refund policy Powered by Shopify Close (esc) Loading x"
    },
    {
      "url": "https://www.11miami.com/",
      "text": "E11EVEN Miami Nightclub ï about events Gallery Photos videos Private Events Press store Brands Giselle 11Vodka 11Crypto 11CLUB Hotel 11Sound 11Life 11Music 11Scent ï ï­ ï§ ï î» about events Gallery Photos videos Private Events Golf Classic Press store Restaurant Brands Giselle 11Vodka 11Crypto 11CLUB Hotel 11Sound 11Life 11Music 11Scent Reserve Table Buy tickets ï ï Mutual Respect; 11 Years of E11EVEN In celebration of E11EVEN Years. A love affair with the city of Miami, and you, the people... More Videos Ape Learn More 11MIAMI Book Now Miami New Times Best of Voting Vote Now! GISELLE Book Now 11RESIDENCES Learn More 11VODKA Shop Now 11SOUND Learn More 11APE Learn More 50 CENT September 19, 2025 buy tickets Reserve Table CEDRIC GERVAIS September 26, 2025 buy tickets Reserve Table QUAVO September 27, 2025 buy tickets Reserve Table TYGA LIVE October 3, 2025 buy tickets Reserve Table NELLY LIVE October 4, 2025 buy tickets Reserve Table 50 CENT September 19, 2025 buy tickets Reserve Table CEDRIC GERVAIS September 26, 2025 buy tickets Reserve Table QUAVO September 27, 2025 buy tickets Reserve Table TYGA LIVE October 3, 2025 buy tickets Reserve Table NELLY LIVE October 4, 2025 buy tickets Reserve Table buy tickets Reserve Table IRON LYON September 10, 2025 buy tickets Reserve Table KONFLIKT September 11, 2025 buy tickets Reserve Table POV THURSDAYS @ GISELLE September 11, 2025 buy tickets Reserve Table K.GIANNI FRIDAY NIGHT September 12, 2025 buy tickets Reserve Table SHIFT SATURDAY NIGHT September 13, 2025 buy tickets Reserve Table FIVE VENOMS September 14, 2025 buy tickets Reserve Table SUNDAYS @ GISELLE September 14, 2025 buy tickets Reserve Table CX September 17, 2025 buy tickets Reserve Table CRESPO September 18, 2025 buy tickets Reserve Table POV THURSDAYS @ GISELLE September 18, 2025 buy tickets Reserve Table 50 CENT September 19, 2025 buy tickets Reserve Table MAKJ SATURDAY NIGHT September 20, 2025 buy tickets Reserve Table AFFECT September 21, 2025 buy tickets Reserve Table SUNDAYS @ GISELLE September 21, 2025 buy tickets Reserve Table MISTER GRAY September 24, 2025 buy tickets Reserve Table GIANNI BLU September 25, 2025 buy tickets Reserve Table POV THURSDAYS @ GISELLE: September 25, 2025 buy tickets Reserve Table CEDRIC GERVAIS September 26, 2025 buy tickets Reserve Table QUAVO September 27, 2025 buy tickets Reserve Table KIRA September 28, 2025 buy tickets Reserve Table SUNDAYS @ GISELLE September 28, 2025 buy tickets Reserve Table DALTON October 1, 2025 buy tickets Reserve Table SOURMILK October 2, 2025 buy tickets Reserve Table POV THURSDAYS @ GISELLE October 2, 2025 buy tickets Reserve Table TYGA LIVE October 3, 2025 buy tickets Reserve Table GISELLE: SOUNDS BY PIETRO October 3, 2025 buy tickets Reserve Table NELLY LIVE October 4, 2025 buy tickets Reserve Table EMKAY October 5, 2025 buy tickets Reserve Table SUNDAYS @ GISELLE October 5, 2025 buy tickets Reserve Table IRON LYON October 8, 2025 buy tickets Reserve Table E11EVEN MIAMI THURSDAY October 9, 2025 buy tickets Reserve Table POV THURSDAYS @ GISELLE October 9, 2025 buy tickets Reserve Table VICE FRIDAY NIGHT October 10, 2025 buy tickets Reserve Table OFFSET LIVE October 11, 2025 buy tickets Reserve Table DAMAGED GOODS October 12, 2025 buy tickets Reserve Table SUNDAYS @ GISELLE October 12, 2025 buy tickets Reserve Table ZEUS October 15, 2025 buy tickets Reserve Table DMITRI October 16, 2025 buy tickets Reserve Table POV THURSDAYS @ GISELLE October 16, 2025 buy tickets Reserve Table E11EVEN MIAMI FRIDAY October 17, 2025 buy tickets Reserve Table E11EVEN MIAMI SATURDAY October 18, 2025 buy tickets Reserve Table CRESPO October 19, 2025 buy tickets Reserve Table SUNDAYS @ GISELLE October 19, 2025 buy tickets Reserve Table CHIZZLE October 22, 2025 buy tickets Reserve Table DYNAMIQO & FRIENDS October 23, 2025 buy tickets Reserve Table POV THURSDAYS @ GISELLE October 23, 2025 buy tickets Reserve Table RICK ROSS October 24, 2025 buy tickets Reserve Table E11EVEN MIAMI SATURDAY October 25, 2025 buy tickets Reserve Table DJ OBSCENE October 26, 2025 buy tickets Reserve Table SUNDAYS @ GISELLE October 26, 2025 buy tickets Reserve Table FIVE VENOMS October 29, 2025 buy tickets Reserve Table E11EVEN MIAMI THURSDAY October 30, 2025 buy tickets Reserve Table POV THURSDAYS @ GISELLE October 30, 2025 buy tickets Reserve Table E11EVEN MIAMI HALLOWEEN October 31, 2025 buy tickets Reserve Table ALL HALLOWS' EVE October 31, 2025 buy tickets Reserve Table FRESKO November 2, 2025 buy tickets Reserve Table EMKAY November 5, 2025 buy tickets Reserve Table A-TRAIN November 9, 2025 buy tickets Reserve Table CX November 12, 2025 buy tickets Reserve Table DAMAGED GOODS November 16, 2025 buy tickets Reserve Table 11 GOLF CLASSIC December 4, 2025 View all shows Video Gallery LATEST MIAMI MUSIC WEEK HALLOWEEN See All Videos Photo Gallery LATEST MIAMI MUSIC WEEK HALLOWEEN LDW FT QUAVO August 30, 2025 LDW FT DJ DIESEL AKA SHAQ August 29, 2025 SAM BLACKY September 5, 2025 MMW: GORDO + MÃSTIZA March 27, 2025 MMW: DIM MAK MIAMI March 30, 2025 MMW: MARSHMELLO March 28, 2025 HALLOWEEN WEEKEND FT QUAVO October 25, 2024 HALLOWEEN FT SEXYY RED October 31, 2024 HALLOWEEN WEEKEND FT OFFSET October 26, 2024 See All Photos In The News October 25, 2023 Dennis DeGori Creator & Founder E11EVEN MIAMI: The Most Important People in Hospitality Learn more August 12, 2024 Rolling Stone: How the Most Popular Club in America Mined a Decade of Moments in the Magic City Learn more May 4, 2025 Kylie Jenner and TimothÃ©e Chalamet Were Seen Showing âNonstop Energy and PDAâ at a Miami Club Learn more April 7, 2025 Eric Adams wants to bring Miamiâs 24-hour mega-club E11even to NYC Learn more Why Be A 10 When You Can Be An E11EVEN? Learn More POV Thursdays TABLES TRUCKER HATS SHOP NOW read All Press A Downtown Miami Nightclub Open 24/7 Luxurious, extravagant and entirely unforgettable, E11EVEN MIAMI is an entertainment venue like no other. Located in the heart of downtown Miami, this 24-hour ultraclub has it all: a vibrant nightclub scene with a cast of top performers and DJs, outstanding food and drinks, private VIP rooms and five-star service staff. E11EVENâs award-winning experience makes it among the best clubs in Miami â and the nation. There truly is nothing else like it! The high-energy backdrop is not all that makes E11EVEN a premiere venue. From the valet service and VIP entrance to the food service and private dining rooms, all guests get the highest hospitality from the service staff, whether youâre hitting the nightclub or checking in to a public or private event. Get your drink on at the four full-service bars or enjoy a meal from our kitchen at Rooftop, our restaurant â this includes customized catering for events! Giselle Giselle, Miami's new hotspot restaurant situated on the rooftop of E11EVEN, an elevated dining experience in a dazzling, panoramic setting in the heart of downtown Miami. She is sophisticated yet eclectic, seductively captivating, edgy, and extravagant. Blending Asian, Mediterranean & French-inspired cuisine, elevated cocktail programming, and exquisite design. Meet Her Giselle Giselle, Miami's new hotspot restaurant situated on the rooftop of E11EVEN, an elevated dining experience in a dazzling, panoramic setting in the heart of downtown Miami. She is sophisticated yet eclectic, seductively captivating, edgy, and extravagant. Blending Asian, Mediterranean & French-inspired cuisine, elevated cocktail programming, and exquisite design. Meet Her 11Music E11EVEN Music, the record label and artist/producer management division of famed Ultraclub E111EVEN MIAMI, releases new music by DJ/Producer 11APE under a new distribution deal with The Orchard, a division of Sony Music Entertainment.Â The new single, âLet it Go,â features vocals from Grammy-nominated songwriter/producer Jeremy Elliot. It will surely be a dance floor banger with Jeremyâs growling rock vocals and big pop hooks mixed with 11APEâs energized club beats. Hear it 11Music E11EVEN Music, the record label and artist/producer management division of famed Ultraclub E111EVEN MIAMI, releases new music by DJ/Producer 11APE under a new distribution deal with The Orchard, a division of Sony Music Entertainment.Â The new single, âLet it Go,â features vocals from Grammy-nominated songwriter/producer Jeremy Elliot. It will surely be a dance floor banger with Jeremyâs growling rock vocals and big pop hooks mixed with 11APEâs energized club beats. Hear it E11EVEN LIFE From 1 to 10, Be An E11EVEN!\nGet the latest gear inspired by the Worldâs Only Ultraclub! Check our latest drops, collabs, and more! Shop Now E11EVEN LIFE From 1 to 10, Be An E11EVEN!\nGet the latest gear inspired by the Worldâs Only Ultraclub! Check our latest drops, collabs, and more! Shop Now 11 Vodka On a scale from One to Ten, be an E11EVEN, be your best self, get the most out of life, and ignore the naysayers. Itâs all about Crushing The Day, Owning The Night â then going back for more. E11EVEN Vodka was born to be the life of the party. Shop Now 11 Vodka On a scale from One to Ten, be an E11EVEN, be your best self, get the most out of life, and ignore the naysayers. Itâs all about Crushing The Day, Owning The Night â then going back for more. E11EVEN Vodka was born to be the life of the party. Shop Now Worldâs Best Sounding Club System Incredible live performances are the harmony between talented artists and the right tools to take their art to the next level. E11EVEN SOUND is the second part of the equation, designed byÂ John Fiorito, E11EVENâs exclusive audio technician who is tasked to maintain the system 24/7. Learn More Worldâs Best Sounding Club System Incredible live performances are the harmony between talented artists and the right tools to take their art to the next level. E11EVEN SOUND is the second part of the equation, designed byÂ John Fiorito, E11EVENâs exclusive audio technician who is tasked to maintain the system 24/7. Learn More E11EVEN Club Residences Inspired by the human condition in its many forms, E11EVENÂ® Club Hotel and Residences was created to promote an exclusive, personal, and self-curated way of being Learn More E11EVEN Club Residences Inspired by the human condition in its many forms, E11EVENÂ® Club Hotel and Residences was created to promote an exclusive, personal, and self-curated way of being Learn More FAQ Filming and Photography? Video & Photography may occur while on E11EVEN MIAMI premises. Your attendance constitutes your consent to b photographed, filed, and/or otherwise recorded and gives E11EVEN all usage rights at their discretion. Whatâs a Rich Text element? The rich text element allows you to create and format headings, paragraphs, blockquotes, images, and video all in one place instead of having to add and format them individually. Just double-click and easily create conten t. Static and dynamic content editing A rich text element can be used with static or dynamic content. For static content, just drop it into any page and begin editing. For dynamic content, add a rich text field to any collection and then connect a rich text element to that field in the settings panel. Voila! How to customize formatting for each rich text Headings, paragraphs, blockquotes, figures, images, and figure captions can all be styled after a class is added to the rich text element using the \"When inside of\" nested selector system. sdfsdfsdfsdfsdf sdfsdf What is the dress code at E11EVEN Miami? Upscale and stylish nightlife fashion wear. No oversized clothing, including but not limited to t-shirts and pants. We do not allow any of the following: Beachwear Tank tops Shorts Baseball caps Flip-flops Sports jerseys Whatâs a Rich Text element? The rich text element allows you to create and format headings, paragraphs, blockquotes, images, and video all in one place instead of having to add and format them individually. Just double-click and easily create conten t. Static and dynamic content editing A rich text element can be used with static or dynamic content. For static content, just drop it into any page and begin editing. For dynamic content, add a rich text field to any collection and then connect a rich text element to that field in the settings panel. Voila! How to customize formatting for each rich text Headings, paragraphs, blockquotes, figures, images, and figure captions can all be styled after a class is added to the rich text element using the \"When inside of\" nested selector system. sdfsdfsdfsdfsdf sdfsdf Where is E11EVEN Miami Located? E11EVEN MIAMI is conveniently located in Downtown Miami, a few blocks away from the Kaseya Center. There is valet and street parking available around the venue. Whatâs a Rich Text element? The rich text element allows you to create and format headings, paragraphs, blockquotes, images, and video all in one place instead of having to add and format them individually. Just double-click and easily create conten t. Static and dynamic content editing A rich text element can be used with static or dynamic content. For static content, just drop it into any page and begin editing. For dynamic content, add a rich text field to any collection and then connect a rich text element to that field in the settings panel. Voila! How to customize formatting for each rich text Headings, paragraphs, blockquotes, figures, images, and figure captions can all be styled after a class is added to the rich text element using the \"When inside of\" nested selector system. sdfsdfsdfsdfsdf sdfsdf Is E11EVEN Miami 21 and over? Yes, E11EVEN MIAMI is a 21+ venue. Whatâs a Rich Text element? The rich text element allows you to create and format headings, paragraphs, blockquotes, images, and video all in one place instead of having to add and format them individually. Just double-click and easily create conten t. Static and dynamic content editing A rich text element can be used with static or dynamic content. For static content, just drop it into any page and begin editing. For dynamic content, add a rich text field to any collection and then connect a rich text element to that field in the settings panel. Voila! How to customize formatting for each rich text Headings, paragraphs, blockquotes, figures, images, and figure captions can all be styled after a class is added to the rich text element using the \"When inside of\" nested selector system. sdfsdfsdfsdfsdf sdfsdf How much is a table at E11EVEN Miami? VIP table service cost varies depending on the event, performers and other factors. Please contact tables@11miami.com Whatâs a Rich Text element? The rich text element allows you to create and format headings, paragraphs, blockquotes, images, and video all in one place instead of having to add and format them individually. Just double-click and easily create conten t. Static and dynamic content editing A rich text element can be used with static or dynamic content. For static content, just drop it into any page and begin editing. For dynamic content, add a rich text field to any collection and then connect a rich text element to that field in the settings panel. Voila! How to customize formatting for each rich text Headings, paragraphs, blockquotes, figures, images, and figure captions can all be styled after a class is added to the rich text element using the \"When inside of\" nested selector system. sdfsdfsdfsdfsdf sdfsdf How to get into E11EVEN Miami? Guests can attend E11EVEN MIAMI by purchasing pre-sale tickets, booking VIP table service or by paying a general admission cover fee at the door. We recommend guests wanting to gain general admission to purchase presale tickets to take advantage of the dedicated entry line. Whatâs a Rich Text element? The rich text element allows you to create and format headings, paragraphs, blockquotes, images, and video all in one place instead of having to add and format them individually. Just double-click and easily create conten t. Static and dynamic content editing A rich text element can be used with static or dynamic content. For static content, just drop it into any page and begin editing. For dynamic content, add a rich text field to any collection and then connect a rich text element to that field in the settings panel. Voila! How to customize formatting for each rich text Headings, paragraphs, blockquotes, figures, images, and figure captions can all be styled after a class is added to the rich text element using the \"When inside of\" nested selector system. sdfsdfsdfsdfsdf sdfsdf Get Social With Us ï ï­ ï ï§ î» ï ï ï­ ï ï§ î» ï ï ï­ ï ï§ î» ï ï ï­ ï ï§ î» ï ï ï­ ï ï§ î» ï ï ï­ ï ï§ î» ï ï ï­ ï ï§ î» ï ï ï­ ï ï§ î» ï ï 29 NE 11th Street, Miami, FL 33132 ï (305) 829-2911 ï ï­ ï§ î» stay Connected. Get all the latest content delivered right to your inbox Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. E11EVEN Club Hotel Shop Sound Vodka Crypto Music SITE Nav About Events Private Events Store Employment Artist Bookings ï ï­ ï§ ï î» Â© E11EVEN Miami 2025. All Rights Reserved | Privacy Policy | ADA Accessibility |Â Sitemap |Â Website Terms of Use We use cookies to collect and analyze information on site performance and usage, to provide social media features and to enhance and customize content and advertisements.. Learn more . Preferences Reject Accept Manage Consent Preferences by Category Essentials Always active Necessary for the site to function. Always On. Marketing Marketing Used for targeted advertising. Personalization Personalization Remembers your preferences and provides enhanced features. Analytics Analytics Measures usage and improves your experience. Reject All Accept All Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. Preferences"
    },
    {
      "url": "https://www.11miami.com/live-from-11-terms-conditions",
      "text": "Live from 11 Terms Conditions ï about events Gallery Photos videos Private Events Press store Brands Giselle 11Vodka 11Crypto 11CLUB Hotel 11Sound 11Life 11Music 11Scent ï ï­ ï§ ï î» about events Gallery Photos videos Private Events Golf Classic Press store Restaurant Brands Giselle 11Vodka 11Crypto 11CLUB Hotel 11Sound 11Life 11Music 11Scent Reserve Table Buy tickets ï E11EVEN MIAMI BREAKAWAY FESTIVAL 2024 | Sweepstakes Terms & Conditions E11EVEN MIAMI BREAKAWAY FESTIVAL 2024 OFFICIAL RULES. NO PURCHASE NECESSARY â For GR Opco, LLC d/b/a E11EVEN MIAMI, 29 NE 11th St, Miami, FL 33132 our phone number is 305-429-2911. Â  No Purchase Required. 1. How To Enter: Beginning on Tuesday, March 12, 2024 follow E11EVEN MIAMI Breakaway Festival 2024 Sweepstakes (the âSweepstakesâ) entry directions. Each entry must contain all information requested in order to qualify for the drawing. All entries must be received no later than 12:00 P.M (ET) on Frisday, April 12, 2024. Only one Internet entry per person and per e-mail address/phone number will be accepted. Subsequent attempts made by the same individual to submit multiple internet entries using multiple e-mail addresses or otherwise will be disqualified. In the event of a dispute over the identity of an online entrant, entry will be deemed submitted by the authorized account holder of the e-mail address associated with the entry. Authorized account holder is defined as the person assigned to an e-mail address by an Internet access provider & on-line service provider or other organization responsible for assigning e-mail addresses & phone number provided by a national carrier. All materials submitted become the property of E11EVEN (\"collectively the Sponsor\") and will not be returned. 2. Winner Selection / Random Drawing: One (1) Winner will be selected in a random drawing to be held on Friday, April 12, 2024 among all eligible entries that are complete and contain all information requested. The random drawing will be conducted by representatives from Sponsor whose decisions are final and binding in all respects relating to this Sweepstakes. Odds of winning a Prize depend upon the total number of eligible entries received. 3. Prizes: Approximate Retail Value (\"ARV\") of the Grand Prize is $350 (Sponsor reserves the right to substitute the prize of greater or equal value). One (1) Grand Prize winner will receive Â a Pair of Tickets to Breakaway Festival in Tampa, FL Friday, April 26 - Saturday, April 27 featuring Illenium, Kaskade, Sofi Tukker and many more.. 4. Sweepstakes is open only to legal residents of the fifty (50) United States and the District of Columbia, 21 years or older. Employees of Sponsor, its affiliates, subsidiaries, advertising or promotion agencies, and their immediate family members and/or those living in the same household of each are not eligible. Void in Puerto Rico, Canada, and where prohibited or restricted by law. No substitution or transfer of Prize(s) is permitted. All federal, state and local taxes and any expenses relating to the acceptance and use of a Prize are the sole responsibility of each Winner. All federal, state and local laws apply. 5. Potential Winners must submit an Affidavit of Eligibility / Release of Liability / Prize Acceptance Form within one (1) business days of attempted notification. If any Prize or affidavit or release is returned to Sponsor as undeliverable or if Sponsor does not receive a response from any potential Winner within one (1) business days of attempted notification, such Winner may be disqualified, and such Prize will be awarded to an alternate Winner. Non-compliance shall result in disqualification and award of Prize to an alternate Winner. By accepting Prize, Winners consent that Sponsor may use the Winners' names, photographs, or other likenesses, the Winners' hometown and biographical information, statements concerning the contest entry, or Sponsors' products without compensation for purposes of advertising, promotion, and merchandising, and grant all rights to edit or modify and to publish and copyright it. Winners must also make themselves available to travel at Sponsor's expense for promotional purposes. By accepting Prize, Winners agree to hold Sponsor, its respective directors, officers, employees, and assigns, harmless against any and all claims and liability arising out of Prize. Winners assume all liability for any injury or damage caused, or claimed to be caused, by participating in this Sweepstakes. By participating in this Sweepstakes, entrants agree to abide by and be bound by these Official Rules, and understand that the Sweepstakes results are final in all respects. By participating in this Sweepstakes, entrants agree to hold Sponsor, its respective directors, officers, employees, and assigns, harmless against any and all claims and liability arising out of Prize. Entrant is responsible for all online charges incurred by any Internet Service Provider. 6. Neither Sponsor, any telephone network, nor service providers are responsible for incorrect or inaccurate transcription of entry information, or for any human error, technical malfunctions, lost/delayed data transmission, omission, interruption, deletion, defect, line failures or any telephone network, computer equipment, software, inability to access any Web site or on-line service, or any other error or malfunction, or late, lost, illegible, incomplete damaged, or misdirected entries or entries not properly forwarded to Sponsor. Entry materials that have been tampered with or altered are void. If the judges determine, in their sole discretion, that there is any suspected or actual electronic tampering with the Sweepstakes or if technical difficulties compromise the integrity of the Sweepstakes, the judges reserve the right to void the entries at issue and conduct a random drawing to award the Prize using all eligible entries received as of the termination date. If the Sweepstakes is terminated due to tampering or technical difficulties prior to its expiration date, notice will be posted at www.11miami.com. Any attempt to deliberately damage the content or operation of this Sweepstakes is unlawful and subject to legal action. NOTE: Email entry must be made by the entrant at the email address: 11marketing@11miami.com. Entries made by any other individual or entity and/or originating at any other Internet website or e-mail address, including but not limited to commercial contest subscription notification and/or entering service sites, will be declared invalid and as such ruled ineligible for this contest. 7. OPT-IN: Any information entrants provide to the Sponsor will be used to communicate with entrant in relation to these Sweepstakes. Sponsor may also share this information with third parties who are participating in this program. Sponsor may contact entrants at a future date about services or products the Sponsor believes entrants will find of interest. Entrants may remove their information from Sponsorâs marketing lists by e-mailing a request to 11marketing@11miami.com, or mailing a request to E11EVEN MIAMI, 29 NE 11th St, Miami, FL 33132. 8. For the names of the Winners, mail a self-addressed, stamped envelope to: E11EVEN Sweepstakes, 29 NE 11th St, Miami, FL 33132. Requests for the names of Winners must be received by Friday, April 12, 2024. By entering into this sweepstakes, you consent to receive event invites and exclusive offers by email and/or text message from E11EVEN MIAMI. 9. Â  You can contact us at GR Opco, LLC (d/b/a E11EVEN Miami), 29 NE 11th St, Miami, FL 33132. Or call us at 305-429-2911. â ï 29 NE 11th Street, Miami, FL 33132 ï (305) 829-2911 ï ï­ ï§ î» stay Connected. Get all the latest content delivered right to your inbox Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. E11EVEN Club Hotel Shop Sound Vodka Crypto Music SITE Nav About Events Private Events Store Employment Artist Bookings ï ï­ ï§ ï î» Â© E11EVEN Miami 2025. All Rights Reserved | Privacy Policy | ADA Accessibility |Â Sitemap |Â Website Terms of Use"
    },
    {
      "url": "https://www.11miami.com/accessibility",
      "text": "Accessibility ï about events Gallery Photos videos Private Events Press store Brands Giselle 11Vodka 11Crypto 11CLUB Hotel 11Sound 11Life 11Music 11Scent ï ï­ ï§ ï î» about events Gallery Photos videos Private Events Golf Classic Press store Restaurant Brands Giselle 11Vodka 11Crypto 11CLUB Hotel 11Sound 11Life 11Music 11Scent Reserve Table Buy tickets ï All E11EVEN Miami facilities, programs, and services will be accessible to individuals with disabilities in accordance with ADA standards. E11EVEN MIAMI will provide reasonable accommodations to individuals with disabilities unless doing so would cause undue hardship to E11EVEN MIAMI or cause a direct threat to the health and workplace safety of E11EVEN Miami employees or the customer. Individuals may request reasonable accommodations by contacting ADA-Accommodations@11miami.com Home Page A Downtown Miami Nightclub Open 24/7 Luxurious, extravagant and entirely unforgettable, E11EVEN MIAMI is an entertainment venue like no other. Located in the heart of downtown Miami, this 24-hour ultraclub has it all: a vibrant nightclub scene with a cast of top performers and DJs, outstanding food and drinks, private VIP rooms and five-star service staff. E11EVENâs award-winning experience makes it among the best clubs in Miami â and the nation. There truly is nothing else like it! The high-energy backdrop is not all that makes E11EVEN a premiere venue. From the valet service and VIP entrance to the food service and private dining rooms, all guests get the highest hospitality from the service staff, whether youâre hitting the nightclub or checking in to a public or private event. Get your drink on at the four full-service bars or enjoy a meal from our kitchen at Rooftop, our restaurant â this includes customized catering for events! Giselle Giselle, Miami's new hotspot restaurant situated on the rooftop of E11EVEN, an elevated dining experience in a dazzling, panoramic setting in the heart of downtown Miami. She is sophisticated yet eclectic, seductively captivating, edgy, and extravagant. Blending Asian, Mediterranean & French-inspired cuisine, elevated cocktail programming, and exquisite design. 11Music E11EVEN Music, the record label and artist/producer management division of famed Ultraclub E111EVEN MIAMI, releases new music by DJ/Producer 11APE under a new distribution deal with The Orchard, a division of Sony Music Entertainment. The new single, âLet it Go,â features vocals from Grammy-nominated songwriter/producer Jeremy Elliot. It will surely be a dance floor banger with Jeremyâs growling rock vocals and big pop hooks mixed with 11APEâs energized club beats. E11EVEN Life From 1 to 10, Be An E11EVEN! Get the latest gear inspired by the Worldâs Only Ultraclub! Check our latest drops, collabs, and more! 11 Vodka On a scale from One to Ten, be an E11EVEN, be your best self, get the most out of life, and ignore the naysayers. Itâs all about Crushing The Day, Owning The Night â then going back for more. E11EVEN Vodka was born to be the life of the party. Worldâs Best Sounding Club System E11EVEN Miami has partnered with DAS AUDIO, the leading sound manufacturer based in Spain to launch a new sound system under the moniker E11EVEN SOUND by DAS Audio. Hotel & Residences Inspired by the human condition in its many forms, E11EVENÂ® Hotel and Residences was created to promote an exclusive, personal, and self-curated way of being. FAQ Q: What Is The Dress Code At E11EVEN Miami? A: Upscale and stylish nightlife fashion wear. No oversized clothing, including but not limited to t-shirts and pants. We do not allow any of the following: Beachwear Tank tops Shorts Baseball caps Flip-flops Sports jerseys Q: Where Is E11EVEN Miami Located? A: E11EVEN MIAMI is conveniently located in Downtown Miami, a few blocks away from the FTX arena. There is valet and street parking available around the venue. Q: Is E11EVEN Miami 21 And Over? A: Yes, E11EVEN MIAMI is a 21+ venue. Q: How Much Is A Table At E11EVEN Miami? A: VIP table service cost varies depending on the event, performers and other factors. Please contact tables@11miami.com Q: How To Get Into E11EVEN Miami? A: Guests can attend E11EVEN MIAMI by purchasing pre-sale tickets, booking VIP table service or by paying a general admission cover fee at the door. We recommend guests wanting to gain general admission to purchase presale tickets to take advantage of the dedicated entry line. â About An immersive adventure encompassing the luxury and sophistication of a one-of-kind experience, the worldâs only 24/5 Ultraclub, E11EVEN MIAMI is entertainment reimagined. Winner of the prestigious âBest New Conceptâ award, as well as landing on the âTop-10 Nightclubs in Americaâ awarded by Nightclub & Bar, plus the âTop-50 Clubs in the worldâ listed by DJ Magazine and ranked #6 in the âWorldâs Top-10 New Yearâs Eve Celebrationsâ by Yahoo Travel, stabilizing its presence as one of the most sought-after venue for both public and private events alike. This high energy social playground known for live performances by some of the biggest stars such as Usher, Drake, Nicki Minaj, Big Sean, Vin Diesel, and Nicky Jam to name a few, also draws in chart-topping DJs such as The Chainsmokers, DIPLO, Steve Aoki, Skrillex, and Zedd among others who have performed their DJ sets in the state-of-the-art DJ booth. The most modern accoutrements blend with premium bottle service, a delectable food menu, and five-star hospitality all offered in an alluring environment that is as sexy as it is sophisticated. E11EVEN MIAMI is strictly a 21 years of age and over nightclub and must have a valid ID to enter, no exceptions. Open 24-Hours Wednesday Through Monday. Ranked #6 in the Worldâs Top 10 New Yearâs Eve Celebration by Yahoo Travel Signature Theatrics A series of the most spectacular shows ever performed inside a nightclub. World-class aerialists, acrobats, contortionists, and dancers bring the highest level of circus and performance art, choreographed to original music against the backdrop of state-of-the-art lighting technology. Where is E11EVEN Miami Located? E11EVEN MIAMI is centrally located in the heart of downtown, just blocks from Wynwood, the American Airlines Arena, Brickell, and minutes from South Beach. This $40 million award-winning landmark destination seamlessly operates as a nightclub and after-hours experience. The 20,000-SF space is perfectly designed to entertain and entice. Available Amenities Full-Service Bars Full-Service Kitchen Menu Fully-Equipped DJ Booth, â 10 guests 32 VIP Conversation Rooms 7 Private VIP Rooms for up to 20 guests 30FT LED Screen for Visual Effects and Sporting Events The E11EVEN Dress Code Upscale and stylish nightlife fashion. No oversized clothing, including but not limited to t-shirts and pants. We do not allow beachwear, tank tops, shorts, baseball caps, flip-flops, or sports jerseys. If you ever need some hints on what to wear, then just browse through our gallery. We have plenty of photos so you can see exactly what is accepted. Contact us at any time if you have any further questions. Worldâs Best Sounding Club System E11EVEN Miamiâs state the art sound system was specifically designed by leading audio manufacturer DAS Audio. â Table Reservations Reserve Your VIP Table Experience by contacting us via email at tables@11miami.com or call us at 305-829-2911 E11EVEN VIP Services is ready to create a unique nightlife experience for your party. Please complete the following form to submit your request and a VIP Services Host will contact you. This request form is not a table reservation confirmation and does not guarantee entry. Feel like a True VIP If youâre looking for the hottest spot to party in Miami, look no further than E11EVEN. Not only are we the premier destination in a city filled with exclusive dance clubs, but we are also ranked in the top 10 of the best 100 clubs worldwide by the International Nightlife Association. Upgrade your night out with our VIP bottle service to feel like one of the many A-listers who drop by E11EVEN whenever theyâre in town. Enjoy High-End Amenities With more than 13,500 square feet of party space, E11EVEN truly earns its designation as an ultraclub. Youâll be captivated by the state-of-the-art lighting and sound system including massive LED video screens that highlight our nightly entertainers. E11EVEN boasts gourmet dining from a full-service kitchen, five-star hospitality, a private VIP entrance, valet service, private dining for parties of up to 20 and four full-service bars throughout the sprawling interior. Take advantage of exclusive bottle service for a chance to skip the line and enjoy a private table for your party with VIP service and mixers of your choice. For those of you looking to up your VIP status game, we also offer elaborate bottle presentations to celebrate you and your crewâs big night out. Sit back and relax or party like a rock star while our staff presents your table with a bottle presentation that will definitely ensure that all eyes are on you. Need more? Elevate your night out and make memories that will last a lifetime by displaying special messages and pictures on our 30ft LED screen, talk about making an impression. Contact us with special requests and weâll be happy to accommodate. Party With the Hottest Celebs World-renowned DJs, rappers and Hollywood actors frequently make E11EVEN their choice Miami party spot. Rub elbows with regulars like Bad Bunny, Flo-rida, Skrillex, Jamie Foxx, Nicki Minaj, Cardi B, Floyd Mayweather and many more. Catch a DJ set by some of the industryâs biggest names like Diplo, Zedd, Markus Schulz, Marshmello and live performances by Drake, Usher, Migos, future and trendy newcomers who are blazing up the charts. Enjoy first class entertainment like trapeze dancers, Cirque -style performances and choreograph entertainers set the stage for a night youâll never forget. Youâll immediately see why top-tier celebrities with access to the best international clubs are attracted to the luxury, glamour, and sophistication of E11EVEN. Weâve even had the pleasure of hosting Benicio Del Toro, Jeremy Piven, Derek Jeter, Miley Cyrus, Mindy Kaling, Kevin Hart, and Leonardo DiCaprio. Contact E11EVEN to learn more about our VIP bottle service and plan a private party for your group or reserve your private table. Whether youâre celebrating a birthday or simply want to live life to the fullest, our staff can deliver the utmost hospitality and the finest indulgences. If youâve always wanted to party like a rock star, nowâs your chance. Upcoming Events E11EVEN MIAMI, the worldâs only 24/7 Ultraclub is entertainment reimagined. an immersive adventure, encompassing the luxury and sophistication of a one-of-kind experience. Visit https://www.tixr.com/groups/11miami for Upcoming Events information and tickets. Private & Corporate Events Corporate events donât have to be boring. Impress your clients and engage your partners with an unforgettable party hosted by E11EVEN Corporate Events. Whether youâre looking for an intimate cocktail soiree for 50 of your most important supporters or a celebratory bash for hundreds, we have the space and accommodations for an event that will put your business name on the map. Inquire venue availability by contacting us via email at tables@11miami.com or call us at 305-829-2911 Impress Your Guests From The Start E11EVEN Miami is designed to both dazzle our guests and make them feel like royalty. With a state-of-the-art sound system and lighting, two giant LED video walls, interactive performances from dancers, acrobats and aerialists will set the stage for revelry. Catch every second of the action when you grab a spot near the hydraulic rotating stage. E11EVEN Miami is also known for incredible live performances by A-list stars like Drake, Nicki Minaj, Usher, Halsey, Daddy Yankee, Ozuna among many others, youâll know youâre in the cityâs hottest nightclubâand so will your attendees. Itâs no wonder weâve attracted guests from Leonardo DiCaprio to Dennis Rodman and Kylie Jenner and many more. E11EVEN Highlights 13,500-SF, design and concept by Dennis DeGori, in association with Tom Telesco AIA Main floor and mezzanine accommodate up to 725 guests comfortably State-of-the-art sound ft. E11EVEN Sound by DAS Audio, worldâs best sounding club system. State-of-the-art lighting by iDesign featuring the ceilingâs circular-centerpiece âThe Haloâ which boasts over 380 LED strips. 30-ft LED video wall in the main room, 16-ft LED video wall in the second room, and intelligent lighting throughout, including 58 moving head lights in the party pit Fully equipped DJ booth, accommodates up to 10 guests with a stage on each side Theatrical hydraulic elevating stage Equipped with kryogenifex and confetti cannons Private VIP entrance Private rooms available for up to 20 guests Four full service bars Full service kitchen till 8am. Valet parking service Unmatched Amenities When you want to entertain your most important clients, you can reserve the clubâs private VIP entrance for your event. We also offer valet service, four full-service bars with espresso station and an extensive gourmet menu featuring full meals and premium hors dâoeuvres alike. Our private dining rooms accommodate up to 20 guests for more exclusive engagements. Whatever the vision for your corporate event, weâre ready to help you make it a reality. Get started today by submitting an online event request. Weâre conveniently located in the heart of the cityâs Downtown Arts and Entertainment District. Join Our Team If youâve been asking yourself, âWhat are the hottest, most luxurious night clubs hiring near me?â look no further than E11EVEN Miami. We are looking to add reliable, talented, and energetic team members to our crew who are ready to keep Miamiâs biggest party going. Our cast includes people with a wide variety of skills and expertise. If you are prepared to become a cast member at the most unforgettable party spot in Miami, fill out our Opportunity Form to get in touch with us today. Interested in performing? Apply at https://www.11miami.com/perform Â or contact us via email at tables@11miami.com or call us at 305-829-2911 Perform at E11EVEN Thank you for your interest in performing at E11EVEN MIAMI as a musician or DJ. Please provide all of the information requested below for our review. Interested in joining our team? Apply at https://www.11miami.com/join â ï 29 NE 11th Street, Miami, FL 33132 ï (305) 829-2911 ï ï­ ï§ î» stay Connected. Get all the latest content delivered right to your inbox Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. E11EVEN Club Hotel Shop Sound Vodka Crypto Music SITE Nav About Events Private Events Store Employment Artist Bookings ï ï­ ï§ ï î» Â© E11EVEN Miami 2025. All Rights Reserved | Privacy Policy | ADA Accessibility |Â Sitemap |Â Website Terms of Use"
    },
    {
      "url": "https://www.11miami.com/attentive-terms-conditions",
      "text": "Attentive Terms Conditions ï about events Gallery Photos videos Private Events Press store Brands Giselle 11Vodka 11Crypto 11CLUB Hotel 11Sound 11Life 11Music 11Scent ï ï­ ï§ ï î» about events Gallery Photos videos Private Events Golf Classic Press store Restaurant Brands Giselle 11Vodka 11Crypto 11CLUB Hotel 11Sound 11Life 11Music 11Scent Reserve Table Buy tickets ï **Â Important Disclosures &Â Consents** 1. Agreement to Arbitrate and Class waiver â By entering into this contest or by providing my information I acknowledge as part of the valuable consideration for the entry is my agreement to arbitrate all claims through New Era ADR (www.neweraadr.com) if the forum is no longer available all claims will be arbitrated in an agreeable arbitration forum . Â I further agree not seek any relief as a member of a class and irrevocably agree to opt out of any class action litigation. Â I acknowledge that by doing so I am waiving my right to have this matter heard by a jury or a judge. Â In the event I seek to file any claim in court and the Sponsor or any of their affiliates are required to compel arbitration or seek to dismiss the class claims I acknowledge that the prevailing party in such litigation may be entitled to their reasonable attorney fees and costs. 2. By accepting these Terms and Conditions you agree to receive text messages and calls as follows: Â By providing my Telephone Number and Electronic Signature as part of my entry into the Sweepstakes, I agree to these Terms and Conditions and I authorize GR OPCO, LLC d/b/a E11EVEN MIAMI and its affiliates, agents, and service providers (the âCompanyâ) to: (1) make, deliver, or cause to be delivered or allow the placement of telephonic sales and telemarketing calls by telephone call, text message or voicemail transmission, (2) using an automatic telephone dialing system, an artificial or prerecorded voice, an automated system for the selection or dialing of telephone numbers, the playing of a recorded message when a connection is completed to a number called, and/or the transmission of a prerecorded voicemail, or the receipt of text messages (3) including: advertisements, telemarketing messages, promotions, event alerts, important information about purchases, tickets, reservations or other transactions with the Company. I understand that: (1) I am not required to (directly or indirectly) sign or enter into this agreement or provide this consent to call as a condition of signing up for the Sweepstakes, or purchasing or using any property, goods, or services, and I may instead refuse to consent to receiving telemarketing communications from the Company; (2) I may opt out of text messages at any time in the future by texting âSTOPâ in response to Company texts; and (3) message and data rates may apply. I also agree, as part of my Sweepstakes entry and text/call authorization: (1) to the use and validity of an electronic signature, and (2) that information relating to this consent can be provided to me through an electronic record. 3. Â By signing up via text, you agree to receive recurring automated promotional and personalized marketing and sales text messages (e.g. cart reminders or upcoming events) from E11EVEN MIAMI at the cell number used when signing up: Click here to View complete Consent, Disclosure, Terms, Privacy & Giveaway Terms. Consent is not a condition of any purchase. Reply HELP for help and STOP to cancel. Msg frequency varies. Msg and data rates may apply. 4. Â  Â  Â Electronic Signatures in Global and National Commerce Act (\"E-SIGN\") Disclosures : GR OPCO, LLC d/b/a E11EVEN MIAMI (the âCompanyâ) offers you the ability to provide electronic consents and signatures, execute electronic agreements, and receive electronic communications with respect to the services Company provides (the âServicesâ). You agree and consent to receive, and to allow us to deliver, all communications electronically, including promotions, event notices, ticket sales, mandatory and regulatory disclosures (even if required by law to be delivered in writing), account statements and notices, transaction information, receipts, confirmations, agreements and authorizations, and any and all other account and Services-related communications, documentation, or information. 5. Â You agree that Company may send you communications using any of the following methods: (1) E-mail at any e-mail address you provided or you subsequently provide, (2) Text Messages at any phone number you provided or subsequently provide, and (3) any other medium or electronic means to which you agree and confirm access. You agree that communications sent in this manner will have the same legal effect as if they were provided in paper form and satisfy any legal requirement that they be provided âin writing.â You agree that any electronic consent and/or signature you provide to Company has the same legal effect as a physical signature and/or consent. You have the right to request a paper copy of any communication at no charge and can do so by calling us at 305-829-2911. We will mail you a paper copy, provided that such request is made within a reasonable time after we first provided the electronic communication to you. To use Companyâs Services and to access and receive electronic communications, you must provide Company with an active and valid e-mail address or phone number and make available, at your own expense, the following equipment, hardware, and/or software: Â· Â  Â  Â  Â A current version of an Internet browser we support, Â· Â  Â  Â  Â An internet connection, Â· Â  Â  Â  Â A computer, mobile phone, or other device that is capable of connecting to and accessing the Internet and/or cellular service, an application or program that can access your text messages and/or e-mails, and supports all of the above. Â Â· Â  Â  Â  Â A current version of a program that accurately read and displays PDF files (such as Adobe Acrobat Reader) and/or electronic images; and Â· Â  Â  Â  Â A printer with ink and paper if you wish to print Communications and/or retain a paper copy, or electronic storage capacity and capability if you wish to retain records in electronic form. It is your responsibility to provide Company with true, accurate, and complete contact and other information related to this E-SIGN Disclosure and Consent and to maintain and update us promptly with any changes. To update your information, call us at 305-829-2911. You may withdraw your E-Sign Consent to receive communications and Services electronically at any time by calling 305-829-2911. Please allow 5-7 business days for us to process your revocation of E-Sign Consent. You also may opt out of e-mails to a particular e-mail address or text messages to a particular phone number by following the unsubscribe or opt-out instructions located within any message you receive from Company. The Company has a written Policy for maintaining do-not-call numbers. which is available on demand. Â You can obtain a copy of the Company Policy relating to it telemarketing programs by email to 11marketing@11miami.com, or mailing a request to E11EVEN MIAMI, 29 NE 11th St, Miami, FL 33132. Â All do-not-call requests will be honored within a reasonable time. The Company name is GR Opco, LLC d/b/a E11EVEN MIAMI, 29 NE 11th St, Miami, FL 33132 our phone number is 305-829-2911. Protecting your private information is our priority. This Statement of Privacy applies to https://wordpress-265756-2184125.cloudwaysapps.com/, and GR OPCO, LLC and governs data collection and usage. For the purposes of this Privacy Policy, unless otherwise noted, all references to GR OPCO, LLC include https://wordpress-265756-2184125.cloudwaysapps.com/, 11USA Group, E11EVEN LIFE, https://e11evenlife.com/ and https://e11evenlife.com/. The 11USA Group website is a ecommerce site. By using the 11USA Group website, you consent to the data practices described in this statement. 1. Collection of your Personal Information In order to better provide you with products and services offered, 11USA Group may collect personally identifiable information, such as your: First and Last Name Mailing Address E-mail Address Phone Number If you purchase 11USA Groupâs products and services, we collect billing and credit card information. This information is used to complete the purchase transaction. 11USA Group may also collect anonymous demographic information, which is not unique to you, such as your: Age Gender We do not collect any personal information about you unless you voluntarily provide it to us. However, you may be required to provide certain personal information to us when you elect to use certain products or services. These may include: (a) registering for an account; (b) entering a sweepstakes or contest sponsored by us or one of our partners; (c) signing up for special offers from selected third parties; (d) sending us an email message; (e) submitting your credit card or other payment information when ordering and purchasing products and services. To wit, we will use your information for, but not limited to, communicating with you in relation to services and/or products you have requested from us. We also may gather additional personal or non-personal information in the future. 2. Use of your Personal Information 11USA Group collects and uses your personal information to operate and deliver the services you have requested. 11USA Group may also use your personally identifiable information to inform you of other products or services available from 11USA Group and its affiliates. 3. Sharing Information with Third Parties 11USA Group does not sell, rent or lease its customer lists to third parties. 11USA Group may share data with trusted partners to help perform statistical analysis, send you email or postal mail, provide customer support, or arrange for deliveries. All such third parties are prohibited from using your personal information except to provide these services to 11USA Group, and they are required to maintain the confidentiality of your information. 11USA Group may disclose your personal information, without notice, if required to do so by law or in the good faith belief that such action is necessary to: (a) conform to the edicts of the law or comply with legal process served on 11USA Group or the site; (b) protect and defend the rights or property of 11USA Group; and/or (c) act under exigent circumstances to protect the personal safety of users of 11USA Group, or the public. 4. Tracking User Behavior 11USA Group may keep track of the websites and pages our users visit within 11USA Group, in order to determine what 11USA Group services are the most popular. This data is used to deliver customized content and advertising within 11USA Group to customers whose behavior indicates that they are interested in a particular subject area. 5. Automatically Collected Information Information about your computer hardware and software may be automatically collected by 11USA Group. This information can include: your IP address, browser type, domain names, access times and referring website addresses. This information is used for the operation of the service, to maintain quality of the service, and to provide general statistics regarding use of the 11USA Group website. 6. Use of Cookies The 11USA Group website may use âcookiesâ to help you personalize your online experience. A cookie is a text file that is placed on your hard disk by a web page server. Cookies cannot be used to run programs or deliver viruses to your computer. Cookies are uniquely assigned to you, and can only be read by a web server in the domain that issued the cookie to you. One of the primary purposes of cookies is to provide a convenience feature to save you time. The purpose of a cookie is to tell the Web server that you have returned to a specific page. For example, if you personalize 11USA Group pages, or register with 11USA Group site or services, a cookie helps 11USA Group to recall your specific information on subsequent visits. This simplifies the process of recording your personal information, such as billing addresses, shipping addresses, and so on. When you return to the same 11USA Group website, the information you previously provided can be retrieved, so you can easily use the 11USA Group features that you customized. You have the ability to accept or decline cookies. Most Web browsers automatically accept cookies, but you can usually modify your browser setting to decline cookies if you prefer. If you choose to decline cookies, you may not be able to fully experience the interactive features of the 11USA Group services or websites you visit. 7. Links This website contains links to other sites. Please be aware that we are not responsible for the content or privacy practices of such other sites. We encourage our users to be aware when they leave our site and to read the privacy statements of any other site that collects personally identifiable information. 8. Security of your Personal Information 11USA Group secures your personal information from unauthorized access, use, or disclosure. 11USA Group uses the following methods for this purpose: SSL Protocol When personal information (such as a credit card number) is transmitted to other websites, it is protected through the use of encryption, such as the Secure Sockets Layer (SSL) protocol. We strive to take appropriate security measures to protect against unauthorized access to or alteration of your personal information. Unfortunately, no data transmission over the Internet or any wireless network can be guaranteed to be 100% secure. As a result, while we strive to protect your personal information, you acknowledge that: (a) there are security and privacy limitations inherent to the Internet which are beyond our control; and (b) security, integrity, and privacy of any and all information and data exchanged between you and us through this Site cannot be guaranteed. 9. Right to Deletion Subject to certain exceptions set out below, on receipt of a verifiable request from you, we will: Delete your personal information from our records; and Direct any service providers to delete your personal information from their records. Please note that we may not be able to comply with requests to delete your personal information if it is necessary to: Complete the transaction for which the personal information was collected, fulfill the terms of a written warranty or product recall conducted in accordance with federal law, provide a good or service requested by you, or reasonably anticipated within the context of our ongoing business relationship with you, or otherwise perform a contract between you and us; Detect security incidents, protect against malicious, deceptive, fraudulent, or illegal activity; or prosecute those responsible for that activity; Debug to identify and repair errors that impair existing intended functionality; Exercise free speech, ensure the right of another consumer to exercise his or her right of free speech, or exercise another right provided for by law; Comply with the California Electronic Communications Privacy Act; Engage in public or peer-reviewed scientific, historical, or statistical research in the public interest that adheres to all other applicable ethics and privacy laws, when our deletion of the information is likely to render impossible or seriously impair the achievement of such research, provided we have obtained your informed consent; Enable solely internal uses that are reasonably aligned with your expectations based on your relationship with us; Comply with an existing legal obligation; or Otherwise use your personal information, internally, in a lawful manner that is compatible with the context in which you provided the information. 10. Children Under Thirteen 11USA Group does not knowingly collect personally identifiable information from children under the age of thirteen. If you are under the age of thirteen, you must ask your parent or guardian for permission to use this website. 11. Disconnecting your 11USA Group Account from Third Party Websites You will be able to connect your 11USA Group account to third party accounts. BY CONNECTING YOUR 11USA GROUP ACCOUNT TO YOUR THIRD PARTY ACCOUNT, YOU ACKNOWLEDGE AND AGREE THAT YOU ARE CONSENTING TO THE CONTINUOUS RELEASE OF INFORMATION ABOUT YOU TO OTHERS (IN ACCORDANCE WITH YOUR PRIVACY SETTINGS ON THOSE THIRD PARTY SITES). IF YOU DO NOT WANT INFORMATION ABOUT YOU, INCLUDING PERSONALLY IDENTIFYING INFORMATION, TO BE SHARED IN THIS MANNER, DO NOT USE THIS FEATURE. You may disconnect your account from a third party account at any time. Users may learn how to disconnect their accounts from third-party websites by visiting their âMy Accountâ page. Users may also contact us via email or telephone. 12. E-mail Communications From time to time, 11USA Group may contact you via email for the purpose of providing announcements, promotional offers, alerts, confirmations, surveys, and/or other general communication. In order to improve our Services, we may receive a notification when you open an email from 11USA Group or click on a link therein. If you would like to stop receiving marketing or promotional communications via email from 11USA Group, you may opt out of such communications by clicking on the UNSUBSCRIBE button. 13. External Data Storage Sites We may store your data on servers provided by third party hosting vendors with whom we have contracted. 14. Changes to this Statement 11USA Group reserves the right to change this Privacy Policy from time to time. We will notify you about significant changes in the way we treat personal information by sending a notice to the primary email address specified in your account, by placing a prominent notice on our website, and/or by updating any privacy information. Your continued use of the website and/or Services available after such modifications will constitute your: (a) acknowledgment of the modified Privacy Policy; and (b) agreement to abide and be bound by that Policy. 15. Contact Information 11USA Group welcomes your questions or comments regarding this Statement of Privacy. If you believe that 11USA Group has not adhered to this Statement, please contact 11USA Group at: GR OPCO, LLC 1112 N Miami Ave Miami, Florida 33136 Email Address: info@11miami.com Telephone number: (305) 829 â 2911 ï 29 NE 11th Street, Miami, FL 33132 ï (305) 829-2911 ï ï­ ï§ î» stay Connected. Get all the latest content delivered right to your inbox Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. E11EVEN Club Hotel Shop Sound Vodka Crypto Music SITE Nav About Events Private Events Store Employment Artist Bookings ï ï­ ï§ ï î» Â© E11EVEN Miami 2025. All Rights Reserved | Privacy Policy | ADA Accessibility |Â Sitemap |Â Website Terms of Use"
    },
    {
      "url": "https://www.rollingstone.com/product-recommendations/lifestyle/e11even-miami-tenth-anniversary-owners-interview-1234976130/",
      "text": "E11EVEN Miami 10th Anniversary Interview With Owners, Founders × Skip to main content Rollingstone Logo Click to expand the Mega Menu Click to Expand Search Input Music Politics TV & Movies Culture RS Recommends Got A Tip? Account Welcome Manage Account Manage Print Account Sign Out Log In Click to expand the Mega Menu Click to Expand Search Input Rollingstone Logo RS Recommends Clock Strikes E11EVEN: How the Most Popular Club in America Mined a Decade of Moments in the Magic City Facebook X email Got A Tip? Account Welcome Manage Account Manage Print Account Sign Out Log In WELCOME HOME Clock Strikes E11EVEN: How the Most Popular Club in America Mined a Decade of Moments in the Magic City Rolling Stone meets the founders of E11EVEN, to talk about the tenth anniversary of the Miami ultraclub and where the now globally-recognized brand is heading next By Tim Chan Tim Chan Contact Tim Chan on X Contact Tim Chan by Email Alcaraz vs. Sinner U.S. Open Livestream: How to Watch the Men’s Tennis Final Online Free A GoPro Costs Hundreds of Dollars, But This Action Camera on Amazon Is Just $56 Is the Cracker Barrel Dad Hat the Must-Have Merch Piece for Summer? View all posts by Tim Chan Getty Images for E11EVEN Miami August 12, 2024 M onths before Shaboozey had a number one song on the charts, he was having the time of his life at E11EVEN. On a recent June evening — nay, early morning — the rapper and singer made his way into the famed Miami hotspot to celebrate his breakout single, and the popular “ultraclub’s” milestone tenth anniversary. As the DJ played “A Bar Song (Tipsy)” over the club’s speakers, the rapper was living it up at his private booth, showering neighboring tables and partygoers with wads of cash, while taking shots of Jack Daniel’s with the crowd (to make sure both Shaboozey and E11EVEN have a history with the whiskey brand). He eventually took the mic to perform a remix of the song, pulling fans onto the stage to sing along with him. The clock was about to strike 4 a.m., but for the hundreds of guests who packed E11EVEN that night, the party was just beginning. Ten years into their storied run, E11EVEN continues to be one of the biggest clubs in the world, drawing the likes of everyone from Leonardo DiCaprio and Kendall Jenner, to UFC stars and the hometown Florida Panthers, who celebrated their recent Stanley Cup win at the venue. To hear the owners tell it though, the story of how E11EVEN came to be, begins with a whimper, and not a bang. On an un-extraordinary February in 2014, a couple hundred guests from Miami’s social scene filed into a newly-constructed club that sat on the site of what was once a seedy dive bar and gentleman’s club called Gold Rush. The building had been vacant since 2012 and like so many abandoned properties in the city’s downtown westside, people in Magic City were skeptical that there was any magic left to mine from the space. But still, curiosity got the best of them. And so, on opening night of E11EVEN, a crowd of local press, socialites and entertainers filed into the previously undesirable space to see what all the buzz ws about. “We had everyone from VIPs to everyday club goers to locals,” operating partner Gino LoPinto tells Rolling Stone . “But it wasn’t that aha moment that you would think of at a grand opening, with a line around the building and some big performer. Everyone was skeptical of the space,” he says. “Still, we could feel that something special was going to happen here.” E11EVEN It’s been ten years since E11EVEN opened in Miami, heralding not only a new venue for the city, but a new era of nightlife for locals and visitors alike, offering an unrivaled mix of music, dance and visual performances. A self-described “ultraclub,” a typical night at E11EVEN now features everything from live DJs and musicians, to aerialists, acrobats, contortionists, light shows and yes, exotic dancers too. Sister restaurant, Giselle, opened on the rooftop in 2023, offering guests a one-stop-shop for dining and entertainment. E11EVEN reflects the diversity of Miami too, having booked Latin and reggaeton artists like Dandy Yankee, Nicky Jam and Ozuna long before they were on the mainstream radar, while giving local DJs a literal platform on the club’s massive stage. Even their merchandise is clicking, with E11EVEN logo baseball caps bringing in a reported seven figures a year, per the venue. E11EVEN vodka , meantime, is the fastest-growing vodka in Florida, available at everywhere from restaurants to fine hotels. They’ve even partnered with home accessories brand Hotel Collection for a line of candles and room sprays (and yes, they’re selling out too). And they’ve sold out twin 65-story high-rise towers downtown dubbed the “E11EVEN Residences.” For founder Dennis DeGori, who made his name as a Las Vegas club owner in the Nineties and early aughts, the concept for E11EVEN was simple: “I thought, this would be a fun place if you could incorporate theater and cabaret into the nightclub experience,” he says, “because nobody was really doing that. Luckily,” he adds, “my co-founders and co-owners Michael Simkins and Marc Roberts agreed.” And then there was the other inspiration for E11EVEN: “I built it with the vision of Yankee Stadium,” DeGori says, smiling, “because I went there as a very young man, and coming out of the corridor and seeing the field open up, is one of my favorite memories.” Today, the entrance to E11EVEN is reminiscent of walking out from the locker room and into the iconic ballpark, with bright lights illuminating a circular stage rather than a baseball diamond, and a stadium-worthy jumbotron flickering high above the frenzied crowd. It may be in Miami rather than the Bronx, but there’s a championship atmosphere every night. As DeGori puts it: “It’s probably the best vision I have ever had in my life.” Rolling Stone caught up with LoPinto, DeGori and operating partner Daniel Solomon to talk about the early days of E11EVEN, how the ultraclub has evolved, and what’s next for the now globally-recognized brand. I want to start from the very beginning. South Beach has always been a popular nightlife destination, but downtown Miami wasn’t always the most desirable location right? DeGori: Downtown Miami was un-gentrified to say the least. And this original building was an old, decrepit, and horribly cold space. Solomon: It was a three-walled venue with a little bit of random clutter and debris in the middle of it and on a street full of hundreds of homeless people in a very rundown neighborhood with graffiti and trash all over the place. And I was like, “There’s just no way we’re going to have a successful venue; I just don’t see it.” But Gino and Dennis called me and they kind of gave me an ultimatum: this is your chance to join us and you’ll regret it if you don’t do it. And? Solomon: I have no regrets. Adinayev E11EVEN is known as an “ultraclub” rather than a nightclub. Explain the concept for me. DeGori: I think nightclubs were getting a little bit tired. I think cabarets were getting tired. I think theater is always spectacular. So just in my mind, I wanted to create something different, and something which incorporated all the different concepts, and put it all together. Solomon: You know, we’re not just a cabaret, we’re not just a nightclub, we’re not just an after hours, we’re not just a show club, and we’re not just a party restaurant; we’re a true hybrid of all those categories. And really creating this hybrid concept is where we coined the phrase “Ultraclub,” for really creating an amazing gel of what entertainment can be on a different level. We have so many friends and guests and clients that come into the club and they’ve also used the phrase, “adult Disneyland.” It’s amazing to hear that. What was the draw for you Gino, to move to Miami after having established yourself as a nightlife mogul in Las Vegas? LoPinto: I went through a lot of turmoil with the financial distraught of ’09, 2010 — I lost a lot. So I was in kind of like the perfect time in life to where I was really starting over, but still wanting to be in nightlife and the hospitality industry. But I had nothing major going on at the time in Vegas. I mean, I always landed on my feet there, so I was director of operations with Larry Flynt’s Hustler Club. And Dennis was coming in a lot. I told my wife, “I think Dennis is going to offer me something.” I thought he was buying a club across town. But he said, “Take a trip to Miami with me.” He showed me the plot of land, showed me the blueprints, the concept and said, “I’m offering you a partnership with me on this. And we’re going to do major things. And this is going to lead to other things. Let’s create something special together.” Daniel, you were also a Vegas transplant. Yeah, I came from Vegas, where I was operating Tao Group properties for almost 10 years. And Dennis approached me around May of 2013. He was like, “I want to create the kitchen sink concept of nightlife where it’s everything thrown against the wall, and whatever sticks, sticks.” And I was like, “I will never go to Miami. I’ll never live in Miami. I’ve never even been to Miami.” At the time, I was the general manager of the number one club in the world. So I’m like, “Why would I leave to go to work at this 20,000-square-foot venue in Miami that you’re telling me is not in a great area?” But like with Gino, Dennis was very persistent and helped me to see the vision. Which takes me back to opening night… What was the vibe like with the crowd that evening? LoPinto: We had this black box invite party, and those people that showed up got an E11EVEN black card that was titanium, just like an American Express black card, and it was loaded with $11,000 in credit on it.  And then we opened at midnight to the public with the 24/7 moniker right off the bat that everyone thought was crazy (the club does not close). No, we did not have that line around the building, but oh my god , the feel of the place. Everybody was smiling, high-fiving, and very receptive. Solomon: As Gino said, there was definitely the “who’s who” that we wanted in the building, but it wasn’t like the critical mass. And, you know, for that first weekend, it was slow. But as guests continued to come into the venue, things evolved. And it continued to evolve for months and months, years and years, to where it’s become the product that we see today. Most people would open a club or venue with a big-name DJ or performer, but you didn’t have a splashy entertainer on opening night. Why? LoPinto: Coming from Vegas, you know, these DJs at the time were getting a quarter million dollars. And there wasn’t really a table or bottle sale club that was not based around talent. And I think that still rings true today. You don’t get big table sales unless you have big talent. And part of Dennis’ vision was, “You know, can we create that without relying on talent?” We did not really book our huge initial talent until our first New Year’s party, when we had Usher. That was 11 months after opening. What is something else you tried to do differently that maybe didn’t work as well? LoPinto: When we opened, we thought for sure that we would turn this space into a monster dance floor, and it sucked the energy out of the room. Literally, as that stage went down, it looked like a bunch of ants crawling to the wall. DeGori: We were like, “Okay, put the stage down at 12 o’clock or one o’clock or two o’clock and let’s make this a party and get people to dance.” That’s the one thing we did try. We put it back up in 15 minutes. We knew that was a mistake. That’s interesting because I noticed there really isn’t much of an official “stage” in the club. DeGori: That’s intentional. Gino loves to tell this story. LoPinto: Our second year in business, we had Drake [performing] and his management asked for a soundcheck that day. I was really nervous and getting the tech guys together and it’s like a little bit of a frenzy in there. Drake arrives and he’s like, “Where do people perform here?” I said, “Well, they often perform there,” and I point to the gogo [dancers] box. I said “We’ve had a few performers up in the DJ booth too.” And Drake points to the center stage and says, “Who performs there?” I said, “Actually, we just do our theatrics and extravagant entertainment there,” and he says, “I’m performing there.” E11EVEN So Drake kind of created that center stage for a musical performance, which we actually tripped out on. We were there that night and the 360 [stage] was something we had never really experienced. You know, there is no backstage — the crowd is the backstage, everybody’s backstage, it’s intimate. You’re right there and he’s high-fiving everyone in the front. And Drake went on to perform eight more times after that over the years. And I think maybe the last time he performed, he bragged about it. He pointed over to our table and said, “I created the center stage. I was the first one to perform here. I broke those boundaries.” Everyone from Drake to Travis Scott to Cardi B have since graced the E11EVEN stage. What are some of your most memorable celebrity moments? LoPinto: Leo DiCaprio just walking through and dropping his baseball hat down low. He doesn’t really roll with bodyguards, and he had like one guy. And he had his hat way down like this (* pulls hand over face ). He’s sitting there and some people are doing a double take, but not really understanding that Leo DiCaprio is right in front of them. Solomon: Mine would be Doja Cat, who had just dropped this new album and we kind of discussed the idea of doing a show with her. Traditionally for us, we do a 20-minute minimum and she had maybe two or three radio hits back then, but she literally plays the entire album from start to finish. She did this amazing, hour-long performance and sang every one of her songs. She was big in the social world but it was really the first time I would say that a lot of people were introduced to Doja Cat on a big level. LoPinto: Post Malone was also one of my favorite nights. We said, “We can’t do a regular presentation with Post.” So Danny put together like, I think it was 11 cases of Bud Light, cut the top off, and put sparklers in it. And we brought a parade of Bud Light out with him. Post ended up ordering $50,000 in singles and had the time of his life. Who is someone that has yet to come by that you would really like to bring by? DeGori: That’s easy, Eminem. Solomon: And I think really the next big category that we will probably go after is trying for Morgan Wallen or Chris Stapleton, doing sort of the country thing. E11EVEN You now have E11EVEN Vodka and E11EVEN Hotel and Residences and even E11EVEN Crypto. Where do you see the brand going next? DeGori: The brand’s really translating and resonating with different markets. I think because the club isn’t locked down in one vertical, we have the potential to do festivals; I think we have the potential to do beach clubs around the world; and I definitely think we have the potential to get into casino gaming. So the sky’s the limit of what we can do next. LoPinto: You know, I wake up and still pinch myself every day and just appreciate the grind that we’ve done. And it never is lost on me that I appreciate the journey even more than the success. The times we’ve had together at the Starbucks on Lincoln Road till five in the morning, talking about the 14-hour day we just had on the construction site — those things are never lost on me. In fact, I’d say that the grind and the hustle is sometimes what I enjoy the most. It never stops. In this article: Miami, nightlife, noads, RS Recommends RS Recommends Lifestyle Shaboozey is seen at E11EVEN Miami on June 22, 2024 in Miami, Florida. Rolling Stone Music Politics TV & Movies Culture Staff Contact Advertise Legal Privacy Policy Terms of Use AdChoices PMC Entertainment California Privacy Rights Your Privacy Choices EU Privacy Preferences Accessibility Policy on Anonymous Sources Follow Us Facebook Instagram TikTok X YouTube Newsletter Signup Enter Your Email Subscribe Got a Hot News Tip? We want to hear it. Send us a tip using our anonymous form. Send Us a Tip By providing your information, you agree to our Terms of Use and our Privacy Policy .\n\t\t\t\tWe use vendors that may also process your information to help provide our services. Rolling Stone is a part of Penske Media Corporation. © 2025 Rolling Stone, LLC. All rights reserved. Powered by WordPress.com VIP Our Sites Art in America Artforum ARTnews Billboard BlogHer Deadline Flow Space Gold Derby IndieWire Robb Report Rolling Stone SheKnows Soaps Sourcing Journal Sportico StyleCaster The Hollywood Reporter TVLine Variety Vibe WWD Log In Welcome Manage Account Manage Print Account Sign Out Music News Features Lists Album Reviews Live Reviews Artists You Need To Know Songs You Need To Know RS Country RS Latin Politics News Features Lists TV & Movies News Features Lists Recaps Reviews Video & Photos Photos Videos The Cover Musicians on Musicians RS LIVE Culture News Features Lists Creators RS Gaming RS Films RS Recommends Reviews RS Essentials RS Audio Awards Gift Guides Culture Council Subscription Icon Follow Us Facebook Instagram TikTok X YouTube Alerts & Newsletters Email Address By providing your information, you agree to our Terms of Use and our Privacy Policy .\n\t\t\t\tWe use vendors that may also process your information to help provide our services. ad"
    },
    {
      "url": "https://www.11miami.com/giselle",
      "text": "Miami Club Restaurant | Giselle ï about events Gallery Photos videos Private Events Press store Brands Giselle 11Vodka 11Crypto 11CLUB Hotel 11Sound 11Life 11Music 11Scent ï ï­ ï§ ï î» about events Gallery Photos videos Private Events Golf Classic Press store Restaurant Brands Giselle 11Vodka 11Crypto 11CLUB Hotel 11Sound 11Life 11Music 11Scent Reserve Table Buy tickets ï Hardly Seen, But Always Noticed Giselle serves up a journey to remember. Upon arrival, guests are transported in a private elevator up to the main entrance of the indoor-outdoor restaurant featuring a fully retractable roof, where they are invited to step into the sultry fantasy world of Giselle. Meet her before midnight... Blending Asian, Mediterranean & French-inspired cuisine, elevated cocktail programming, and exquisite design, Giselle serves up a journey to remember. Dinner Reservations Reservations can only be held for 15 minutes. For parties of 9 to 30 people, please contact the host desk by phone at Â 305-358-9848 Â or email host@gisellemiami.com.Â â The host desk is available: Monday & Tuesday, 12pm to 5pm | Wednesday through Sunday 12pm to 2am. ï 29 NE 11th Street, Miami, FL 33132 ï (305) 829-2911 ï ï­ ï§ î» stay Connected. Get all the latest content delivered right to your inbox Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. E11EVEN Club Hotel Shop Sound Vodka Crypto Music SITE Nav About Events Private Events Store Employment Artist Bookings ï ï­ ï§ ï î» Â© E11EVEN Miami 2025. All Rights Reserved | Privacy Policy | ADA Accessibility |Â Sitemap |Â Website Terms of Use"
    },
    {
      "url": "https://www.11miami.com/privacy-policy",
      "text": "Privacy Policy | E11EVEN Miami ï about events Gallery Photos videos Private Events Press store Brands Giselle 11Vodka 11Crypto 11CLUB Hotel 11Sound 11Life 11Music 11Scent ï ï­ ï§ ï î» about events Gallery Photos videos Private Events Golf Classic Press store Restaurant Brands Giselle 11Vodka 11Crypto 11CLUB Hotel 11Sound 11Life 11Music 11Scent Reserve Table Buy tickets ï Privacy Policy Effective date: July 15, 2025 Protecting your private information is our priority. This Statement of Privacy (this âPrivacy Policyâ) applies to https://11miami.com/, 11USA Group, and GR OPCO, LLC and governs data collection and usage. For the purposes of this Privacy Policy, unless otherwise noted, all references to 11USA Group include GR OPCO, LLC and https://11miami.com. The 11USA Group website is an ecommerce site. By using the 11USA Group website, you consent to the data practices described in this statement. 1. Collection of your Personal Information In order to better provide you with products and services offered, 11USA Group may collect personally identifiable information, such as your: Â· Â  Â  Â First and Last Name Â· Â  Â  Â Mailing Address Â· Â  Â  Â E-mail Address Â· Â  Â  Â Phone Number Â· Â  Â  Â Internet activity (e.g., IP address, browser type, pages visited) Â· Â  Â  Â Biometric data (as set forth under Section 15) If you purchase 11USA Groupâs products and services, we collect billing and credit card information. This information is used to complete the purchase transaction. 11USA Group may also collect anonymous demographic information, which is not unique to you, such as your: Â· Â  Â  Â Age Â· Â  Â  Â Gender We do not collect any personal information about you unless you voluntarily provide it to us. However, you may be required to provide certain personal information to us when you elect to use certain products or services. These may include: (a) registering for an account; (b) entering a sweepstakes or contest sponsored by us or one of our partners; (c) signing up for special offers from selected third parties; (d) sending us an email message; (e) submitting your credit card or other payment information when ordering and purchasing products and services. To wit, we will use your information for, but not limited to, communicating with you in relation to services and/or products you have requested from us. We also may gather additional personal or non-personal information in the future. If you choose not to provide information, we may not be able to provide you with requested products, services or information. 2. Use of your Personal Information 11USA Group collects and uses your personal information to: Â· Â  Â  Â Operate and deliver the services you have requested Â· Â  Â  Â Inform you of other products or services available from 11USA Group and its affiliates Â· Â  Â  Â Process payments and fulfill transactions Â· Â  Â  Â Conduct reporting and analytics to improve and personalize 11USA Groupâs services Â· Â  Â  Â Comply with legal obligations 11USA Group retains your personal information for as long as reasonably necessary to fulfill the purposes described in this Privacy Policy or for the period legally permitted or required. 11 USA Groupâs retention criteria take into consideration legal obligations, business needs, potential risks of harm, and information type. At the end of the retention period, personal information will be deleted, destroyed, or deidentified. 3. Sharing Information with Third Parties 11USA Group does not sell, rent or lease its customer lists to third parties. 11USA Group may share data with trusted partners to help fulfil its services, perform statistical analysis, send you email or postal mail, provide customer support, or arrange for deliveries. All such third parties are prohibited from using your personal information except to provide these services to 11USA Group, and they are required to maintain the confidentiality of your information. 11USA Group may disclose your personal information, without notice, if required to do so by law or in the good faith belief that such action is necessary to: (a) conform to the edicts of the law or comply with legal process served on 11USA Group or the site; (b) protect and defend the rights or property of 11USA Group; and/or (c) act under exigent circumstances to protect the personal safety of users of 11USA Group, or the public. 4. Tracking User Behavior 11USA Group may keep track of the websites and pages our users visit within 11USA Group, in order to determine what 11USA Group services are the most popular. This data is used to deliver customized content and advertising within 11USA Group to customers whose behavior indicates that they are interested in a particular subject area. 5. Automatically Collected Information Information about your computer hardware and software may be automatically collected by 11USA Group. This information can include: your IP address, browser type, domain names, access times and referring website addresses. This information is used for the operation of the service, to maintain quality of the service, and to provide general statistics regarding use of the 11USA Group website. 6. Use of Cookies The 11USA Group website may use âcookiesâ to help you personalize your online experience. A cookie is a text file that is placed on your hard disk by a web page server. Cookies cannot be used to run programs or deliver viruses to your computer. Cookies are uniquely assigned to you, and can only be read by a web server in the domain that issued the cookie to you. One of the primary purposes of cookies is to provide a convenience feature to save you time. The purpose of a cookie is to tell the Web server that you have returned to a specific page. For example, if you personalize 11USA Group pages, or register with 11USA Group site or services, a cookie helps 11USA Group to recall your specific information on subsequent visits. This simplifies the process of recording your personal information, such as billing addresses, shipping addresses, and so on. When you return to the same 11USA Group website, the information you previously provided can be retrieved, so you can easily use the 11USA Group features that you customized. You have the ability to accept or decline cookies. Most Web browsers automatically accept cookies, but you can usually modify your browser setting to decline cookies if you prefer. If you choose to decline cookies, you may not be able to fully experience the interactive features of the 11USA Group services or websites you visit. 7. Links This website contains links to other sites. Please be aware that we are not responsible for the content or privacy practices of such other sites. We encourage our users to be aware when they leave our site and to read the privacy statements of any other site that collects personally identifiable information. 8. Security of your Personal Information 11USA Group secures your personal information from unauthorized access, use, or disclosure. 11USA Group uses the following methods for this purpose: SSL Protocol When personal information (such as a credit card number) is transmitted to other websites, it is protected through the use of encryption, such as the Secure Sockets Layer (SSL) protocol. We reserve the right to modify our security protocols as new systems and methods become available, We strive to take appropriate security measures to protect against unauthorized access to or alteration of your personal information. Unfortunately, no data transmission over the Internet or any wireless network can be guaranteed to be 100% secure. As a result, while we strive to protect your personal information, you acknowledge that: (a) there are security and privacy limitations inherent to the Internet which are beyond our control; and (b) security, integrity, and privacy of any and all information and data exchanged between you and us through this Site cannot be guaranteed. 9. Right to Deletion Subject to certain exceptions set out below, on receipt of a verifiable request from you, we will: Â· Â  Â  Â Delete your personal information from our records; and Â· Â  Â  Â Direct any service providers to delete your personal information from their records. Please note that we may not be able to comply with requests to delete your personal information if it is necessary to: Â· Â  Â  Â Complete the transaction for which the personal information was collected, fulfill the terms of a written warranty or product recall conducted in accordance with federal law, provide a good or service requested by you, or reasonably anticipated within the context of our ongoing business relationship with you, or otherwise perform a contract between you and us; Â· Â  Â  Â Detect security incidents, protect against malicious, deceptive, fraudulent, or illegal activity; or prosecute those responsible for that activity; Â· Â  Â  Â Debug to identify and repair errors that impair existing intended functionality; Â· Â  Â  Â Exercise free speech, ensure the right of another consumer to exercise his or her right of free speech, or exercise another right provided for by law; Â· Â  Â  Â Comply with the California Electronic Communications Privacy Act; Â· Â  Â  Â Engage in public or peer-reviewed scientific, historical, or statistical research in the public interest that adheres to all other applicable ethics and privacy laws, when our deletion of the information is likely to render impossible or seriously impair the achievement of such research, provided we have obtained your informed consent; Â· Â  Â  Â Enable solely internal uses that are reasonably aligned with your expectations based on your relationship with us; Â· Â  Â  Â Comply with an existing legal obligation; or Â· Â  Â  Â Otherwise use your personal information, internally, in a lawful manner that is compatible with the context in which you provided the information. 10. Children Under Thirteen 11USA Group does not knowingly collect personally identifiable information from children under the age of thirteen. If you are under the age of thirteen, you must ask your parent or guardian for permission to use this website. If you are the parent or a guardian of a child under thirteen who you believe has accessed this site in a way that would lead to the collection of their personally identifiable information, please contact us so that we can delete your childâs information. If you are in a state where the content of our website may be deemed prohibited, you are not authorized to remain on the site. Â 11. Disconnecting your 11USA Group Account from Third-Party Websites You will be able to connect your 11USA Group account to third-party accounts. BY CONNECTING YOUR 11USA GROUP ACCOUNT TO YOUR THIRD-PARTY ACCOUNT, YOU ACKNOWLEDGE AND AGREE THAT YOU ARE CONSENTING TO THE CONTINUOUS RELEASE OF INFORMATION ABOUT YOU TO OTHERS (IN ACCORDANCE WITH YOUR PRIVACY SETTINGS ON THOSE THIRD-PARTY SITES). IF YOU DO NOT WANT INFORMATION ABOUT YOU, INCLUDING PERSONALLY IDENTIFYING INFORMATION, TO BE SHARED IN THIS MANNER, DO NOT USE THIS FEATURE. You may disconnect your account from a third-party account at any time. Users may learn how to disconnect their accounts from third-party websites by visiting their âMy Accountâ page. Users may also contact us via email or telephone. 12. E-mail Communications From time to time, 11USA Group may contact you via email for the purpose of providing announcements, promotional offers, alerts, confirmations, surveys, and/or other general communication. In order to improve our Services, we may receive a notification when you open an email from 11USA Group or click on a link therein. If you would like to stop receiving marketing or promotional communications via email from 11USA Group, you may opt out of such communications by clicking on the UNSUBSCRIBE button. 13. Text Communications In the event that you provide us with your telephone number, 11USA may send you text messages for the purpose of providing announcements, promotional offers, alerts, confirmations, surveys, and/or other general communication. You agree to hold 11USA harmless for any fees that are incurred via your telephone provider. By providing 11USA Group with your telephone number, you agree that you have consented to such contact for the purposes of the Telephone Consumer Protection Act (47 U.S.C. Â§ 227) and similar or equivalent state and foreign laws. If you would like to stop receiving text messages from 11USA Group, you may opt out of such communications by replying âSTOPâ or emailing us with the phone number you would like to have removed from our records. 14. External Data Storage Sites We may store your data on servers provided by third-party hosting vendors with whom we have contracted. 15. Biometric Collection By uploading or providing links to photographs of your face, or any other material that may be deemed biometric data, to this website or our affiliated social media pages, you acknowledge that 11USA Group may intentionally collect or inadvertently find itself in possession of your biometric information. Additionally, by visiting any 11USA Group property, you acknowledge that you may be asked to provide a driverâs license, passport, or other form of ID which may contain biometric information such as a facial scan. You also acknowledge that facial recognition data may also be collected by certain security systems on the property, and that you may also be asked to provide a fingerprint for certain transactions. Biometric data including facial data and fingerprints will be stored on servers provided by third-party hosting vendors with whom we have contracted, but will not be sold to those vendors or other third parties. We will not disclose, re-disclose or otherwise disseminate your fingerprint or biometric data to anyone other than its authorized vendors unless: a. Â  Â  Â  Â  Â  Â  you or your legally authorized representative consents to such; b. Â  Â  Â  Â  Â  Â  the disclosure or dissemination is required by state or federal law or municipal ordinance; or c. Â  Â  Â  Â  Â  Â  Â the disclosure is required pursuant to a valid warrant or subpoena issued by a court of competent jurisdiction. Neither the Company nor its vendors will sell, lease, trade, or otherwise profit from your biometric data. 11USA Group and its vendors will use reasonable security methods to store, transmit, and protect your biometric data from disclosure for the term of up to two (2) years. Individual fingerprints will be deleted within one hundred and twenty (120) days of the expiration of that two (2) year period. Such storage, transmission, and protection from disclosure shall be performed in a manner that is the same as or more protective than the manner in which 11USA Group stores, transmits, and protects from disclosure other confidential and sensitive information, including personal information that can be used to uniquely identify an individual or an individualâs account or property, such as account numbers, PINs, driverâs license numbers and social security numbers. 16. Agreement to Arbitrate and Class Waiver By accessing this website or by providing my information, you acknowledge that part of the valuable consideration for the entry is your agreement to arbitrate all claims through New Era ADR (www.neweraadr.com). If New Era ADR is no longer available, all claims will be arbitrated in another agreeable arbitration forum. In the event that you assert a combination of claims, including some classified as non-arbitrable under a relevant state or federal law, you agree that the non-arbitrable claims may be brought as a separate action in the appropriate state or federal court. Â You also agree that all remaining arbitrable claims, including but not limited to those relating to employment applications, data privacy, and/or use of image, shall be severed and subject to arbitration. These arbitration provisions shall be read broadly and interpreted under the Federal Arbitration Act (9 U.S.C. Â§1, et. seq.) or any other version of the Act that may come into existence. If there is a dispute regarding the applicability of the Arbitration provisions of this Agreement, that issue will be submitted for arbitration to New Era ADR or, if they are unavailable, an arbitrator agreed upon or appointed by the court. You further agree not to seek any relief as a member of a class and irrevocably agree to opt out of any class action litigation. You acknowledge that by doing so you are waiving your right to have this matter heard by a jury or a judge. In the event that you seek to file any claim in court and 11USA Group, GR OPCO LLC, or any of its affiliates are required to compel arbitration or seek to dismiss the class claims, you acknowledge that the prevailing party in such litigation may be entitled to reasonable attorney fees and costs. 17. Changes to this Statement 11USA Group reserves the right to change this Privacy Policy from time to time. We will notify you about significant changes in the way we treat personal information by sending a notice to the primary email address specified in your account, by placing a prominent notice on our website, and/or by updating any privacy information. Your continued use of the website and/or Services available after such modifications will constitute your: (a) acknowledgment of the modified Privacy Policy; and (b) agreement to abide and be bound by that Policy. 18. Contact Information 11USA Group welcomes your questions or comments regarding this Privacy Policy. If you believe that 11USA Group has not adhered to this Statement, please contact 11USA Group at: GR OPCO, LLC 1112 N Miami Ave Miami, Florida 33136 Email Address: info@11miami.com Telephone number: (305) 829-2911 â ï 29 NE 11th Street, Miami, FL 33132 ï (305) 829-2911 ï ï­ ï§ î» stay Connected. Get all the latest content delivered right to your inbox Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. E11EVEN Club Hotel Shop Sound Vodka Crypto Music SITE Nav About Events Private Events Store Employment Artist Bookings ï ï­ ï§ ï î» Â© E11EVEN Miami 2025. All Rights Reserved | Privacy Policy | ADA Accessibility |Â Sitemap |Â Website Terms of Use"
    },
    {
      "url": "http://11miami.com.urstaging.com/about-us/24hour-menu/",
      "text": "Food Menu | E11EVEN Miami MIAMI SPICE Contact Press 11USA GROUP ROOFTOP/RESTAURANT Home Events News Explore Reservations NIGHTCLUB ROOFTOP RESTAURANT Menu Media Photos Videos Book Table Inquiry Tickets Guest List Bachelorette Private Parties Home Events News Explore Reservations NIGHTCLUB ROOFTOP RESTAURANT Menu Media Photos Videos Book Table Inquiry Tickets Guest List Bachelorette Private Parties contact Press ROOFTOP/RESTAURANT About Us 11 Menu $39 MIAMI SPICE MENU 11 Menu © Copyright 2015 E11EVEN MIAMI. All Rights Reserved. Privacy Policy Employment Join Newsletter | 29 NE 11TH ST , MIAMI , FL 33132 (305)829-2911"
    },
    {
      "url": "http://11miami.com.urstaging.com/contact/",
      "text": "Contact E11EVEN | Miami Night Club & Restaurant MIAMI SPICE Contact Press 11USA GROUP ROOFTOP/RESTAURANT Home Events News Explore Reservations NIGHTCLUB ROOFTOP RESTAURANT Menu Media Photos Videos Book Table Inquiry Tickets Guest List Bachelorette Private Parties Home Events News Explore Reservations NIGHTCLUB ROOFTOP RESTAURANT Menu Media Photos Videos Book Table Inquiry Tickets Guest List Bachelorette Private Parties contact Press ROOFTOP/RESTAURANT CONTACT US Contact VIEW ON GOOGLE MAPS E-MAIL SIGN-UP TABLE REQUEST Press Inquiries Submit Subject is required Sending... Your information has been submitted successfully. © Copyright 2015 E11EVEN MIAMI. All Rights Reserved. Privacy Policy Employment Join Newsletter | 29 NE 11TH ST , MIAMI , FL 33132 (305)829-2911"
    }
  ]
}