{
  "query": "31supperclub.com email",
  "fuentes": [
    {
      "url": "https://www.supperclubbtr.com/faqs",
      "email": "info@supperclubbtr.com"
    },
    {
      "url": "https://thesupperclubinc.com",
      "email": "supperclub8nov2024@motherwolf089.jpg"
    },
    {
      "url": "https://supperclubcompany.com/pages/contact-us",
      "email": "info@supperclubcompany.com"
    }
  ],
  "mails": [
    "info@supperclubbtr.com",
    "info@supperclubcompany.com",
    "supperclub8nov2024@motherwolf089.jpg"
  ],
  "nombre_sitio": "31supperclub.com",
  "origen_extraccion": "Busqueda externa paso: email",
  "textos_fuente": [
    {
      "url": "https://www.supperclubbtr.com/faqs",
      "text": "FAQs | Supperclub Home About Menu Private Party Gift CArd FAQs Reservations Contact Location 10480 Perkins Rd, Baton Rouge, LA 70810 Contact 225-341-1000 Â | info@supperclubbtr.com hours Tue - Thu: 5:00PM - 9:15PM Fri - Sat: 5:00PM â 10:00PM extra links Careers Â | Website by: Katalyst Studios FAQs FAQs What are your hours of operation? Tuesday - Thursday 5:00 PM - 9:15 PM Friday - Saturday 5:00 PM - 10:00 PM We are closed on Sunday and Monday, unless a private party is booked. Do you accomodate large parties? The largest party size we accommodate in the main dining area is 8 patrons. However, if you have a party larger than 8, please contact us at info@supperclubbtr.com to book the Rumor Room, a private event, or a larger table (upon availability). We ask that the entire party be present in order to be seated. Do you have a private dining room available for meetings or events? We offer one private dining room, The Rumor Room. The sleek space accommodates 8-12 guests and allows you the option to order from the menu, or let Chef take you on a culinary journey with his selections and customizable options. â We also allow restaurant buyouts, please visit the âPrivate Partiesâ tab for more information. Do I need a reservation? Reservations are required to enjoy our restaurant dining experience, or cozy-up to our bar and lounge and dine on a first-come basis without a reservation. If youâre interested in a party larger than 8 or would like the whole restaurant to yourself, please contact info@supperclubbtr.com . What is the cancellation policy? We ask that any cancellation to your reservation be made no less than 48 hours prior. We require a credit card held at the time of booking your reservation. No shows or late cancellations will be subject to a $25 fee per person that will be charged to the credit card on file. Reservations will be held for no more than 15 minutes after your reservation time. What is the dress code? ELEGANT CASUAL For men: A collared shirt or jacket is required. Please wear slacks or dark wash jeans without holes or frays. Men should not wear sandals, sunglasses, hats, shorts, or athletic wear. Dress shoes or dressy sneakers are acceptable. For women: Dresses, pant suits, skirts worn with a blouse, or shorts worn with a blazer are all acceptable. Please do not wear blue jean shorts, daytime shorts, sunglasses, hats, or sheer or see-through pants/skirts. The dress code policy is at the discretion of management and is strictly enforced to enhance the experience of our guests. Are children allowed at Supper Club? Children are welcome. We do not have high chairs or booster seats. Although there is not a childrenâs menu available, we love seeing your childâs reaction to experiencing fine dining. Do you have a corkage fee? We have a $40 corkage fee per bottle for any bottle of wine brought by a patron, with a 2-bottle per table limit. What is your celebration policy? We welcome you to celebrate any special occasion with us. In order to ensure all guests enjoy their dining experience, we request that no balloons or decorations be brought into the restaurant unless approved in writing by management prior. All decor is at the discretion of management. We allow guests to bring in their own cake; however, there will be a cake-cutting fee of $25 per cake. Is gratuity included? In support of our service staff, a 20% service charge is added to all checks. How do I provide feedback? Our standard of excellence is based on continuous improvement. We would love to hear your thoughts. Email: info@supperclubbtr.com 10480 Perkins Rd, Baton Rouge, LA 70810 Contact: 225-341-1000 Â | info@supperclubbtr.com Hours: Tue - Thu: 5:00PM - 9:15PM Â | Fri - Sat: 5:00PM - 10:00PM Careers Â | FAQs Â | Website by: Katalyst Studios gift card book now"
    },
    {
      "url": "https://thesupperclubinc.com",
      "text": "The Supper Club"
    },
    {
      "url": "https://supperclubcompany.com/pages/contact-us",
      "text": "Contact Us about our Frozen Delivered Meals | Supper Club Skip to content Free Delivery on orders over £30! 0 Shop All Suppers Collections Award-winning Meat Suppers Fish Suppers Vegetable Suppers British Suppers Italian Suppers Asian Suppers Puddings About Supper Club Our Story Our Foodie Family Why frozen? Delivery Information Contact Get in touch Become a stockist Gift cards Search 0 Shop Previous panel Shop All Suppers Collections Award-winning Meat Suppers Fish Suppers Vegetable Suppers British Suppers Italian Suppers Asian Suppers Puddings View Shop About Supper Club Previous panel About Supper Club Our Story Our Foodie Family Why frozen? Delivery Information View About Supper Club Contact Previous panel Contact Get in touch Become a stockist View Contact Gift cards Search 01524 544 594 info@supperclubcompany.com Facebook Instagram Log in Get in touch We’d love to hear from you so send us an email or enter your details below and we will get back to you. If you would like a copy of our product brochure then fill in the form below with your name and address and we will post one out to you! Contact info@supperclubcompany.com 01524 544 594 Phone orders taken Monday - Friday 0900 - 1700 ADDRESS Supperclub, Althams Fine Foods LTD Northgate, White Lund Industrial Estate Morecambe, LA3 3AZ Opening Hours Monday - Friday 0900 - 1700 Name Email Message Join Supper Club Join the Supper Club guestlist to receive 10% off your first order, exclusive discounts and more Email Subscribe Customer service Contact FAQs Become a Stockist Stockists Blog Legal & Information Delivery Information Terms of Service Privacy Policy Cookies Social Facebook Instagram Contact info@supperclubcompany.com 01524 544 594 Northgate, White Lund Industrial Estate Morecambe\n                    England LA3 3AZ\n                    United Kingdom Powered by Shopify © 2025, Supper Club Recent searches Main menu Shop About Supper Club Contact Gift cards Search"
    }
  ]
}