{
  "fuentes": [
    {
      "url": "https://www.farinasupperclub.com/about",
      "email": "info@farinasupperclub.com"
    },
    {
      "url": "https://www.farinasupperclub.com/about",
      "email": "info@farinasupperclub.com"
    },
    {
      "url": "https://www.clubspot.app/contact-support",
      "email": "info@clubspot.app"
    },
    {
      "url": "https://supperclubcompany.com/pages/contact-us",
      "email": "info@supperclubcompany.com"
    },
    {
      "url": "https://ormondbeachmainstreet.com/item/31-supper-club/",
      "email": "jj@31supperclub.com"
    },
    {
      "url": "https://www.daytonabeach.com/listings/31-supper-club/3662/",
      "email": "marketing@31supperclub.com"
    }
  ],
  "mails": [
    "info@clubspot.app",
    "info@farinasupperclub.com",
    "info@supperclubcompany.com",
    "jj@31supperclub.com",
    "marketing@31supperclub.com"
  ],
  "nombre_sitio": "31supperclub.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.farinasupperclub.com/about",
      "text": "Our Story | Farina's Supper Club top of page Home About Catering & Events Gift Cards Menus RESERVATIONS CARRY OUT Our Story Chef  Joe Farina Farina's Supper Club is the latest venture of renowned Chef Joseph Farina, who has made a name for himself by serving up delicious Italian American classics in Chicago's neighborhood restaurants. With a focus on using only the finest imported and local ingredients, Chef Joe brings his passion, family's traditions and recipes to MIchigan City. Farina has mastered his craft at some of Chicago’s most iconic restaurants and he can be found at the most prestigious “foodie” events, including Chicago Gourmet, Taste of Travel and The Grand Chef’s Experience. He is also a favorite culinary personality on Chicago’s television and radio networks, sharing his love of Italian cuisine with the Chicagoland area. Chef Farina delights his followers with classics and new innovations like his People’s Choice, Golden Rasher Award “Best Bacon Dish” pasta winner at Chicago’s iconic Bacon fest. In 2016, he and his partners founded the Victory Restaurant Group where diners can enjoy his Chicago Italian creations at Victory Tap – South Loop, Victory Italian – River North, Victory Meat and Seafood – Elmhurst, Victory Italian – Oak Park, (opening late fall 2020),Victory in a Minute - part of the new Hayden Hall dining experience in the South Loop, and now featuring Farina's Supper Club in Michigan City located at the famous Duneland Beach Inn. Founder Yvonne Farina and Co-Founder/Culinary Director Joseph Farina look forward to sharing their passion for food, wine and entertaining in their new hometown of Michigan City. Yvonne Farina Inspired by a dinner party, Yvonne Farina blended her passion for food, wine and entertaining and pursued her hospitality career as an ambitious young woman, earning her position in a traditionally male dominated industry. Over the years, she navigated her way through numerous roles gaining a wealth of priceless experience. Prior to joining Victory Italian, Yvonne worked with the most renowned names in the Chicago's restaurant industry and was the forefront of operations at many iconic and prestigious restaurants. Yvonne discovered her passion for wine during her trips to Italy and visits to stunning wineries across the country. Her experiences motivated her to become a certified sommelier to share her knowledge for exquisite wines from around the world. ​ Yvonne’s love for the hospitality industry inspired her and her husband Chef Joseph Farina to bring their passion to their new hometown, Michigan City and look forward to sharing their enthusiasm with the Michiana community and can’t wait to meet their new neighbors. OPENING SOON Hours of Operation: Monday, Wednesday & Thursday 4 pm - 9 pm Friday & Saturday 3pm - 10pm Sunday 3pm - 9 pm Tuesday - Closed Dress Code: Casual / Casual Elegant 3311 Pottawattamie Trail Michigan City, IN  46360 219.874.7729 Info@FarinaSupperClub.com Let's Get Social Menu Reservations Catering & Events ​Order Online Gift Cards Employment Contact​ ​ Join the Club Newsletter Submit Thanks for submitting! © 2024 Grace Web Designs bottom of page"
    },
    {
      "url": "https://www.clubspot.app/contact-support",
      "text": "ClubSpot Club Management - Contact Us top of page Home Solutions Custom Club App Membership Management Online Club Lotto Data Security Club Communications Group Messaging Club Events Ticketing Customer Stories Contact Contact - Support Contact - Sales Blog Pricing Meet The Team How To Setup Guide Admin Tutorials User Tutorials More... Use tab to navigate through the menu items. Get a Demo Login Need support? Get in touch! For the quickest response time for general customer support or ticketing queries, contact us via our  live chat button at the bottom right of the screen. You can also reach us using the support email and contact number below where a member of our team will get in touch with you as soon as possible. Live Chat via orange button in right corner below Quickest Response ​ ​ Email: support@clubspo t.app Mob: 087 032 2866 ​ CAVAN DIGITAL HUB, KILMORE BUSINESS PARK, DUBLIN RD. CAVAN Enjoying your experience with ClubSpot? We'd love to hear from you! Click here to leave us a review! Company Home About Us Contact Us Careers FAQs Privacy Policy GDPR Club Referrals Terms of Service Contact Email: info@clubspot.app Mob: 087 032 2866 Stradone, Cavan, H12 Y066 © ClubSpot 2022 All Rights Reserved bottom of page"
    },
    {
      "url": "https://supperclubcompany.com/pages/contact-us",
      "text": "Contact Us about our Frozen Delivered Meals | Supper Club Skip to content Free Delivery on orders over £30! 0 Shop All Suppers Collections Award-winning Meat Suppers Fish Suppers Vegetable Suppers British Suppers Italian Suppers Asian Suppers Puddings About Supper Club Our Story Our Foodie Family Why frozen? Delivery Information Contact Get in touch Become a stockist Gift cards Search 0 Shop Previous panel Shop All Suppers Collections Award-winning Meat Suppers Fish Suppers Vegetable Suppers British Suppers Italian Suppers Asian Suppers Puddings View Shop About Supper Club Previous panel About Supper Club Our Story Our Foodie Family Why frozen? Delivery Information View About Supper Club Contact Previous panel Contact Get in touch Become a stockist View Contact Gift cards Search 01524 544 594 info@supperclubcompany.com Facebook Instagram Log in Get in touch We’d love to hear from you so send us an email or enter your details below and we will get back to you. If you would like a copy of our product brochure then fill in the form below with your name and address and we will post one out to you! Contact info@supperclubcompany.com 01524 544 594 Phone orders taken Monday - Friday 0900 - 1700 ADDRESS Supperclub, Althams Fine Foods LTD Northgate, White Lund Industrial Estate Morecambe, LA3 3AZ Opening Hours Monday - Friday 0900 - 1700 Name Email Message Join Supper Club Join the Supper Club guestlist to receive 10% off your first order, exclusive discounts and more Email Subscribe Customer service Contact FAQs Become a Stockist Stockists Blog Legal & Information Delivery Information Terms of Service Privacy Policy Cookies Social Facebook Instagram Contact info@supperclubcompany.com 01524 544 594 Northgate, White Lund Industrial Estate Morecambe\n                    England LA3 3AZ\n                    United Kingdom Powered by Shopify © 2025, Supper Club Recent searches Main menu Shop About Supper Club Contact Gift cards Search"
    },
    {
      "url": "https://ormondbeachmainstreet.com/item/31-supper-club/",
      "text": "31 Supper Club - Ormond Beach Mainstreet Making Ormond Beach Better Facebook Twitter Menu Calendar OMS Events Granada Grand Festival of the Arts 2025 Taste of Ormond 2025 Ormond Beach Celtic Festival 2025 Christmas in July 2025 Riverfest Seafood Festival 2025 Small Business Saturday 2025 Contact Us About Grants & Properties Directory All How Can I Claim My Business? Our Sponsors Farmers Market Get Involved Volunteer With Us! Downtown Dollars Survey Join Us Store Login Username or Email Address Password Lost Password? Toggle Search Art Businesses Art Clothing and Accessories Consignment Shops Florists General Retail Hotel/Resorts Kitchen and Home Other Outdoors Personal Indulgence Real Estate Services Food Health Spas and Salons Vehicle Service Non Members Public Buildings Restaurants Full Service Restaurants Healthy Eating Lighter Fare Shoes Small Business Arts & Culture Food & Drink OTHER Retail Services The Members Beachside Downtown Other Riverside Radius: Off Radius: mi Set radius for geolocation Search keyword Search Loading… 31 Supper Club 31 was conceived as a tribute to Ormond Beach featuring some of the remaining artwork of Frederick Dana Marsh, owner, and builder of the Battleship House. Several of Marsh’s Bas-Reliefs from the interior of the house can be seen adorning the walls. The Amazon, Timicuan Princess, and Timicuan Chief are formidable works of art that were fortunately saved from extinction. Our main bar and one of our proudest features were salvaged from a long forgotten speakeasy in Cicero Chicago, a suburb brutally controlled by Al Capone in the 1920’s. It was often said, “If you smell Gunpowder, then you’re in Cicero.” “ A wonderful place! Truly a step back in time to the Art Deco era. A lot of fun on weekends with dancing and live music and entertainment. Incredible food! Craft cocktails galore keeping in the spirit with the 1920s & 30s. A place not to be missed if you are in the Ormond Beach area. ” Opening Hours Monday 12 PM - 10 PM Tuesday 12 PM - 10 PM Wednesday 12 PM - 10 PM Thursday 12 PM - 10 PM Friday 12 PM - 12 PM Saturday 12 PM - 12 PM Sunday Closed Address & Contact Our Address 31 W Granada Blvd Telephone (386) 275-1625 Email JJ@31supperclub.com Web 31 Supper Club Calendar of Events Facebook Twitter Farmers Market Granada Grand Festival of the Arts Ormond Beach Celtic Festival 2022 Taste of Ormond © 2018 Copyright Ormond Beach Mainstreet . All rights reserved. 123"
    },
    {
      "url": "https://www.daytonabeach.com/listings/31-supper-club/3662/",
      "text": "31 Supper Club | Ormond Beach, FL 32174 Virtual Tour Meetings Travel Trade Request FIT Rates Meet the Team Itineraries Districts & Neighborhoods Getting Here Media Gallery Virtual Brochures Sports Submit RFP Meet the Team Convention Center Sports Facilities Specialized Services Getting Here Event Funding Virtual Brochure Media Releases Gallery Media Visits Media Coverage Speakers Bureau Blog Virtual Tour Meetings Travel Trade Request FIT Rates Meet the Team Itineraries Districts & Neighborhoods Getting Here Media Gallery Virtual Brochures Sports Submit RFP Meet the Team Convention Center Sports Facilities Specialized Services Getting Here Event Funding Virtual Brochure Media Releases Gallery Media Visits Media Coverage Speakers Bureau Blog Events All Events Featured Events Arts & Culture Racing Motorcycle Rallies Festivals & Music Sports Events Submit An Event Places to Stay Hotels Hotel Deals Vacation Rentals Condo Rentals Campgrounds & RV Parks Motels Bed & Breakfasts Pet-Friendly All Properties Things To Do Top 10 Reasons to Visit Attractions Racing Trails With Kids Outdoors Golf Beaches Water Activities Fishing Arts & Culture Shopping Free Things to See and Do Food + Drink Waterfront Dining Outdoor Dining Seafood Fine Dining Ale Trail Nightlife Plan About the Area Web Cam Weather Accessibility Travel Resources Blog Deals and Giveaways Social Gatherings Sustainable Travel Contact Us Events All Events Featured Events Arts & Culture Racing Motorcycle Rallies Festivals & Music Sports Events Submit An Event Places to Stay Hotels Hotel Deals Vacation Rentals Condo Rentals Campgrounds & RV Parks Motels Bed & Breakfasts Pet-Friendly All Properties Things To Do Top 10 Reasons to Visit Attractions Racing Trails With Kids Outdoors Golf Beaches Water Activities Fishing Arts & Culture Shopping Free Things to See and Do Food + Drink Waterfront Dining Outdoor Dining Seafood Fine Dining Ale Trail Nightlife Plan About the Area Web Cam Weather Accessibility Travel Resources Blog Deals and Giveaways Social Gatherings Sustainable Travel Contact Us SEARCH SEARCH About Our Organization Halifax Area Advertising Authority Committees Market and Investor Research Newsletters Tourism Partner Resources Tourism Events Funding Filming in Daytona Beach Contact Sitemap Privacy Policy Accessibility Things to Do Beach Accessibility Dining Entertainment Venues Transportation Services Statement of Accessibility ADA Accessibility Feedback Form Partner Gateway Partner Resources Back View More 1 / 3 View More 2 / 3 View More 3 / 3 Share 31 Supper Club Address: 31 West Granada Boulevard, Ormond Beach, FL 32174 Phone: (386) 275-1625 Visit Website Email Share About Mural Map Amenities Overview Dining & Entertainment Hours Monday: Noon to 10:00pm Tuesday: Noon to 10:00pm Wednesday: Noon to 10:00pm Thursday: Noon to 10:00pm Friday: Noon - Midnight Saturday: Noon - Midnight Dining Lunch: Dinner: Live Music: View Our Destination Guide SIGN UP FOR OUR eNewsletter About Our Organization Halifax Area Advertising Authority Committees Market and Investor Research Newsletters Tourism Partner Resources Tourism Events Funding Filming in Daytona Beach Contact Sitemap Privacy Policy Accessibility Things to Do Beach Accessibility Dining Entertainment Venues Transportation Services Statement of Accessibility ADA Accessibility Feedback Form Partner Gateway Partner Resources © 2025 Daytona Beach Area CVB © 2025 Daytona Beach Area CVB"
    }
  ]
}