{
  "fuentes": [
    {
      "url": "https://www.linkedin.com/company/more-bananas",
      "email": "praca@morebananas.pl"
    },
    {
      "url": "https://3bananas.com/category/uncategorized/",
      "email": "admin@3bananas.com"
    },
    {
      "url": "https://www.dole.com/press/2025/heads-up-corporate-brand-mascots:-doles-bobby-banana-is-now-on-linkedin",
      "email": "bob@sophiaschoice.com"
    },
    {
      "url": "https://www.dole.com/press/2025/heads-up-corporate-brand-mascots:-doles-bobby-banana-is-now-on-linkedin",
      "email": "logo@2x.webp"
    },
    {
      "url": "https://www.dole.com/press/2025/heads-up-corporate-brand-mascots:-doles-bobby-banana-is-now-on-linkedin",
      "email": "logo@4x.webp"
    },
    {
      "url": "https://3bananas.com/contact/",
      "email": "admin@3bananas.com"
    },
    {
      "url": "https://zakenblad.nl/2019/06/28/online-succes-begint-bij-social-banana/",
      "email": "redactie@artismediagroep.nl"
    },
    {
      "url": "https://zakenblad.nl/2019/06/28/online-succes-begint-bij-social-banana/",
      "email": "zakenblad-logo@2.png"
    },
    {
      "url": "https://onebananas.com/contact-us/",
      "email": "tips-facts-icon@2x.png"
    },
    {
      "url": "https://www.elliott.org/company-contacts/banana-republic-customer-service-contacts/",
      "email": "close@2x.png"
    },
    {
      "url": "https://www.elliott.org/company-contacts/banana-republic-customer-service-contacts/",
      "email": "damon_berger@gap.com"
    },
    {
      "url": "https://www.elliott.org/company-contacts/banana-republic-customer-service-contacts/",
      "email": "katrina_oconnell@gap.com"
    },
    {
      "url": "https://www.elliott.org/company-contacts/banana-republic-customer-service-contacts/",
      "email": "richard_dickson@gap.com"
    },
    {
      "url": "https://3bananas.com/",
      "email": "admin@3bananas.com"
    },
    {
      "url": "https://blog.hootsuite.com/social-media-image-sizes-guide/",
      "email": "g2-reviews-2025@2x.png"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "email": "info@scibpaints.com"
    },
    {
      "url": "https://www.bananas.com/pages/contact-us",
      "email": "info@bananas.com"
    },
    {
      "url": "https://3bananas.com/menu/",
      "email": "admin@3bananas.com"
    },
    {
      "url": "https://www.bananaproducts.com/contact-us",
      "email": "banana@bananaproducts.com"
    },
    {
      "url": "https://www.bananaproducts.com/contact-us",
      "email": "info@bananaproducts.com"
    },
    {
      "url": "https://www.bananaproducts.com/contact-us",
      "email": "info@banaproducts.com"
    },
    {
      "url": "https://wentbananas.com/contact/",
      "email": "contact@wentbananas.com"
    },
    {
      "url": "https://wentbananas.com/contact/",
      "email": "jobs@wentbananas.com"
    },
    {
      "url": "https://wentbananas.com/contact/",
      "email": "media@wentbananas.com"
    },
    {
      "url": "https://3bananas.com/author/bananasadmin/",
      "email": "admin@3bananas.com"
    }
  ],
  "mails": [
    "admin@3bananas.com",
    "banana@bananaproducts.com",
    "bob@sophiaschoice.com",
    "close@2x.png",
    "contact@wentbananas.com",
    "damon_berger@gap.com",
    "g2-reviews-2025@2x.png",
    "info@bananaproducts.com",
    "info@bananas.com",
    "info@banaproducts.com",
    "info@scibpaints.com",
    "jobs@wentbananas.com",
    "katrina_oconnell@gap.com",
    "logo@2x.webp",
    "logo@4x.webp",
    "media@wentbananas.com",
    "praca@morebananas.pl",
    "redactie@artismediagroep.nl",
    "richard_dickson@gap.com",
    "tips-facts-icon@2x.png",
    "zakenblad-logo@2.png"
  ],
  "nombre_sitio": "3bananas.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.linkedin.com/company/more-bananas",
      "text": "More Bananas | LinkedIn Skip to main content LinkedIn Top Content People Learning Jobs Games Sign in Join now More Bananas Advertising Services Kraków, Woj. Małopolskie 9,775 followers Creative Agency Follow View all 23 employees Report this company About us More Bananas is a team of experienced internet marketing specialists. Website https://morebananas.pl/?utm_source=linkedin&utm_medium=bio&utm_campaign=ongoing External link for More Bananas Industry Advertising Services Company size 11-50 employees Headquarters Kraków, Woj. Małopolskie Type Partnership Founded 2016 Specialties Social Media, Copywriting, Content Marketing, Marketing, Strategia marketingowe, TikTok, Twitter, LinkedIn, Instagram, and Szkolenia Locations Primary ulica Zloty Rog 27 Kraków, Woj. Małopolskie 30-095, PL Get directions Employees at More Bananas Anna Ledwoń-Blacha Strategia marketingowa & personal branding & social media ⚫ AI w marketingu🤖 Autorka książek o SM i Brand Purpose 🍌Szkolę, konsultuję, występuję 📣… Mariusz Świątkowski CVO and Business Analyst at More Bananas. Organiser of CRASH Mondays. Digital Marketing || Strategy || Social Media || Consulting. Joanna Bitowt Head of Marketing w More Bananas 🍌 Jacek Szczepan Marketing Strategist at More Bananas / Head Of Marketing at Art-Synergy / CEO at Soulstone Gathering See all employees Updates More Bananas 9,775 followers 4d Report this post Dziś zamykamy pewien rozdział. More Bananas kończy swoją działalność.\nTo była podróż pełna projektów, kampanii, szkoleń i bananowych historii.\nDziękujemy wszystkim:  klientom, partnerom, współpracownikom i całej naszej społeczności.\nBez Was to by się nie wydarzyło.\nTo koniec More Bananas, ale nie koniec naszych ludzi i ich pomysłów. 🍌💛 133 13 Comments Like Comment Share More Bananas 9,775 followers 6d Report this post 12 Zasad Animacji - jak tworzyć treści, które zatrzymują uwagę? Odpowiedź znajdziecie w artykule Piotr Kruczek 💛 [link w komentarzu] 7 1 Comment Like Comment Share More Bananas 9,775 followers 1w Report this post Minął już jakiś czas od szkolenia z Cukiernia Sowa w zakresie influencer marketingu, ale właśnie do nas wpadły referencje! Coś czujemy, a nawet wiemy - było dobrze. 💛 6 1 Comment Like Comment Share More Bananas 9,775 followers 1w Report this post Konkursy w social mediach? 🎉 To nie tylko regulaminy, ale też czysta radość!\n\nPrzy konkursie #LetnieSmakiIntersnack pakowaliśmy nagrody 🎁 i już nie możemy się doczekać uśmiechów zwycięzców 🌞\n\nUwielbiamy takie momenty, kiedy internetowe akcje wychodzą poza ekran i stają się realnymi emocjami 💛 …more 8 Like Comment Share More Bananas 9,775 followers 1w Report this post Za kulisami zawsze coś się dzieje. Raz nagrywamy podcast w Krakowie, raz plan zdjęciowy w Warszawie, a innym razem potrzebujemy kogoś, kto ogarnie światła w Gdańsku. 🎙️🎥 Dlatego...\n\nTworzymy bazę osób do współpracy przy podcastach i nagrywkach ❗ Obecnie wszystkie tematy mamy zaopiekowane, ale zbieramy kontakty na przyszłe potrzeby (szybsze bądź późniejsze).\n\nJeśli chcesz do niej trafić:\n👉 napisz na praca@morebananas.pl 📩\n👉 w tytule maila wpisz: „Nagrywki – [miasto/województwo/Polska]”,\n👉 a w treści dorzuć info, czy ogarniasz podcasty, wideo, czy jedno i drugie.\n\nKto wie, może następne nagrywki zrobimy właśnie z Tobą? 😎 #MoreBananas #Współpraca #Nagrania #Podcasty #Wideo 4 1 Comment Like Comment Share More Bananas 9,775 followers 1w Report this post Webinar Anna Ledwoń-Blacha o najczęstszych błędach popełnianych w marketingu już za nami. 🎥 Nie zdążył_ś na live? Nic straconego! 👇\n\nObejrzyj nagranie, z którego dowiesz się m.in .:\n🍌 jakie wpadki najczęściej popełniają marki – od jednoosobowych biznesów po wielkie korpo,\n🍌 dlaczego procesy i organizacja działań to nie nuda, tylko klucz do skutecznego marketingu,\n🍌 jak unikać błędów, które kosztują czas, pieniądze i reputację.\n\nJeśli tworzysz kampanie, publikujesz w socialach, planujesz działania albo prowadzisz agencję – nie możesz tego przegapić! Link znajdziesz w komentarzu. 👇 #MoreBananas #Webinar #Marketing #AI #KarmimyEmocjami #KarmimyWiedzą 14 2 Comments Like Comment Share More Bananas 9,775 followers 1w Edited Report this post Ty też nie możesz się powstrzymać przed wbiciem kolejnego poziomu? Nie możesz oderwać się od gierki na telefonie? Właśnie tak miało być! 👀\nWięcej na naszym blogu [link w komentarzu], a w roli głównej nasz praktykant Mateusz Iniewicz ze swoim pierwszym artykułem! 💛 Gratulujemy debiutu, bo jest na wysokim poziomie 💪 9 2 Comments Like Comment Share More Bananas 9,775 followers 2w Report this post A jak tam Twój pieseł? Znaczy marketing? \nWymiziajcie swoje czworonożne z okazji światowego dnia piesełka! 🐶💛 144 25 Comments Like Comment Share More Bananas 9,775 followers 2w Report this post 🏅 XV edycja Konkursu Małopolski Lider Ekonomii Społecznej 2025 wystartowała, a my jesteśmy w niej nie tylko kibicami, ale także partnerem i fundatorem nagród!\n\nRok temu sami odebraliśmy tytuł \"Biznes przyjazny ekonomii społecznej 2024\" - doceniono nasze wsparcie i mentoring dla Bistro Tymiankowo, prowadzonego przez Spółdzielnię Socjalną „Kobierzyn”. To wyróżnienie było dla nas ogromnym wzruszeniem i potwierdzeniem, że warto inwestować czas, serce i kompetencje w budowanie dobra.\n\nDlatego tym bardziej cieszymy się, że w tym roku możemy stanąć po drugiej stronie,  wspierając i nagradzając kolejne organizacje, które realnie zmieniają świat wokół nas.\n\n💛 Róbmy dobro. Bo ono naprawdę wraca.\n\n👉 Szczegóły konkursu [link w komentarzu] 1 Comment Like Comment Share More Bananas 9,775 followers 2w Report this post Opisy stanowisk w marketingu są jak zagadki: im dłużej je czytasz, tym mniej wiesz. A potem jeszcze musisz to wytłumaczyć babci… 🙃 9 1 Comment Like Comment Share Join now to see what you are missing Find people you know at More Bananas Browse recommended jobs for you View all updates, news, and articles Join now Similar pages Tigers Advertising Services Green Parrot Advertising Services Warszawa, Mazowieckie Dziadek do orzechów Advertising Services Kraków, Lesser Poland Voivodeship digitalk Advertising Services Bydgoszcz, kujawsko-pomorskie Agencja Ancymony Advertising Services Kraków, małopolskie Sprawny Marketing Advertising Services Stary Grunwald, Wielkopolskie Przestrzeń Advertising Services Warsaw, Mazowieckie Agencja Nie Do Ogarnięcia Advertising Services Kraków, Woj. Małopolskie Feeders Agency Advertising Services Warsaw, Mazowieckie Beeffective - Digital Marketing Agency Advertising Services Gdynia, pomorskie Show more similar pages Show fewer similar pages Browse jobs Manager jobs 1,880,925 open jobs Administrator jobs 469,404 open jobs Executive jobs 690,514 open jobs Business Analyst jobs 95,218 open jobs Analyst jobs 694,057 open jobs Social Media Manager jobs 27,779 open jobs Specialist jobs 768,666 open jobs Content Coordinator jobs 13,417 open jobs Editor jobs 19,020 open jobs Marketing Director jobs 53,789 open jobs Marketing Manager jobs 106,879 open jobs Director jobs 1,220,357 open jobs Curator jobs 1,797 open jobs Recruiter jobs 243,016 open jobs Content Specialist jobs 23,864 open jobs Project Lead jobs 222,538 open jobs Data Analyst jobs 329,009 open jobs Sales Director jobs 83,949 open jobs Assistant jobs 711,811 open jobs Coordinator jobs 545,033 open jobs Show more jobs like this Show fewer jobs like this More searches More searches Manufacturer jobs Creative Director jobs Stylist jobs Brand Manager jobs Journalist jobs Curator jobs Account Manager jobs Social Media Manager jobs Specialist jobs Video Editor jobs Analyst jobs Recruiter jobs Front Desk Supervisor jobs Front Office Supervisor jobs Front Office Manager jobs Export Sales Manager jobs Junior Mechanical Engineer jobs Business Development Intern jobs Social Media Marketing Intern jobs Support Specialist jobs Office Manager jobs Assistant jobs Project Manager jobs Storyboard Artist jobs Concept Artist jobs Illustrator jobs Content Specialist jobs Solutions Architect jobs Account Executive jobs Representative jobs Manager jobs Lead Designer jobs User Interface Specialist jobs Designer jobs Bar Manager jobs Sports Specialist jobs In-House Counsel jobs Lawyer jobs Aircraft Mechanic jobs LinkedIn © 2025 About Accessibility User Agreement Privacy Policy Cookie Policy Copyright Policy Brand Policy Guest Controls Community Guidelines العربية (Arabic) বাংলা (Bangla) Čeština (Czech) Dansk (Danish) Deutsch (German) Ελληνικά (Greek) English (English) Español (Spanish) فارسی (Persian) Suomi (Finnish) Français (French) हिंदी (Hindi) Magyar (Hungarian) Bahasa Indonesia (Indonesian) Italiano (Italian) עברית (Hebrew) 日本語 (Japanese) 한국어 (Korean) मराठी (Marathi) Bahasa Malaysia (Malay) Nederlands (Dutch) Norsk (Norwegian) ਪੰਜਾਬੀ (Punjabi) Polski (Polish) Português (Portuguese) Română (Romanian) Русский (Russian) Svenska (Swedish) తెలుగు (Telugu) ภาษาไทย (Thai) Tagalog (Tagalog) Türkçe (Turkish) Українська (Ukrainian) Tiếng Việt (Vietnamese) 简体中文 (Chinese (Simplified)) 正體中文 (Chinese (Traditional)) Language Agree & Join LinkedIn By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to see who you already know at More Bananas Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy ."
    },
    {
      "url": "https://3bananas.com/category/uncategorized/",
      "text": "Uncategorized Archives - 3 Bananas 386-698-2861 admin@3bananas.com Facebook Instagram Facebook Instagram Home Contact Menu Select Page Hello world! by bananasadmin | May 26, 2020 | Uncategorized Welcome to WordPress. This is your first post. Edit or delete it, then start writing! Home Contact Menu Facebook Instagram Copyright 2025~3 Bananas All Rights Reserved"
    },
    {
      "url": "https://www.dole.com/press/2025/heads-up-corporate-brand-mascots:-doles-bobby-banana-is-now-on-linkedin",
      "text": "Bobby Banana Joins LinkedIn: A Fruity Connection! | Dole Skip to main content Open menu Close menu Produce Discover Our Commitment Sustainability Framework Governance, Values and Human Rights Partnerships For Nature’s Health For an Equitable Future For a Healthier World Company About Dole Our Farms Virtual Farm Tours Open menu Close menu Enter your keywords Apply US US Choose a different Language Close English (United States) Deutsch (Deutschland) English (Canada) English (United Kingdom) Italiano (Italia) Nederlands (Nederland) Greek (Greece) English (United States) Deutsch (Deutschland) English (Canada) English (United Kingdom) Italiano (Italia) Nederlands (Nederland) Greek (Greece) Continue reading Back Heads Up, Corporate Brand Mascots: Dole’s Bobby Banana is Now on LinkedIn! CHARLOTTE, N.C. (April 16, 2025) FOR IMMEDIATE RELEASE Share this post on facebook twitter pinterest email print Dole Food Company mascot selects today’s National Banana Day to join the world’s largest career-development social media site But instead of looking for another job, the famous Cavendish banana will use the site to forge digital connection with banana lovers worldwide Most people use LinkedIn to network, build their professional brand and position themselves for their next job by showcasing their skills, experience and education to a wide audience. But as the official healthy-eating mascot of Dole Food Company, Bobby Banana already has the best job: tell the world about the wonders of a diet rich in bananas and other fresh fruits and vegetables. After all, despite being born in the 1990s, the 7-foot Cavendish banana remains farm-fresh, nutrient-dense, exuberant and full of natural energy. He never over ripens and seems completely unconcerned that he is incapable of frowning or touching the top of his partially peeled head. As far as brand mascots go, he has the perfect life in the sun. Social media habits evolve, however, even among produce ambassadors. Said William Goldfield, Dole Food Company’s director of communications: “After years of meeting banana lovers in-person at supermarkets, festivals, fairs and special events, Bobby wants to expand connection with his millions of fans. He’s heard about the networking benefits of LinkedIn so decided to join the cyber-community to share company news and rally even more kids and their parents to adopt a heathier diet and lifestyle. And what better time to launch his new page than today’s National Banana Day?” Bobby will use his new LinkedIn page to share updates on Dole fruit business, discuss sustainability initiatives, promote banana usage and suggest produce-rich recipes, serving suggestions and entertaining ideas. He will educate followers about Dole’s campaigns, farming operations and hunger-relief efforts and program events. Bobby’s LinkedIn followers will be the first to hear about his public appearances, meet-and-greets and banana meet-ups across the country. Introduced to the world by Dole in early 1990s to put a bright, optimistic face on healthy living, Bobby Banana spends most of his time promoting smarter eating habits and active lifestyles at schools, supermarkets and special events throughout the country. He took center stage in 2024 as the host of Dole’s “125 th Banana-Versary, a year-long celebration of the produce leader’s quasquicentennial year in the banana business. As part of the festivities, Bobby was inducted into the Dole Banana Hall of Fame and honored with his own display at the National Mascot Hall of Fame. To see Bobby Banana’s LinkedIn profile and follow him, go to https://www.linkedin.com/in/bobby-banana-003636360/ . Bobby’s new LinkedIn presence expands a large Dole social media universe that includes Dole Food Company pages on Facebook, Instagram, Pinterest, TikTok and LinkedIn totaling close to 2 million followers. About Dole plc Dole plc, is one of the world’s largest producers and marketers of high-quality fresh fruit and fresh vegetables. Operating in more than 70 countries, Dole is an industry leader in many of the products it sells, as well as in nutrition education. For more information, please visit www.dole.com . In the U.S., Dole was ranked as the most-trusted brand in Fresh Fruit and Salad Kits in the 2025 BrandSpark Most-Trusted Brand Awards Presented by Newsweek as determined by more than 29,000 American shoppers who shared their insights on which brands they trust most and why. ### Share this post on facebook twitter pinterest email print Media Contact Bob Ochsner bob@sophiaschoice.com (949) 233-0984 Company Careers Press Releases Code of Conduct Transparency in Coverage Dole Family Dole Fruit Hawaii Dole Packaged Foods Ocean Cargo Dole Pineapple Farm Tour Business Partner DBCP Facts Memorandum of Insurance Transparency in Supply Chain Management Truckers & Customers Information Portal Investors Dole plc Follow us Facebook Instagram Pinterest X US US Choose a different Language Close English (United States) Deutsch (Deutschland) English (Canada) English (United Kingdom) Italiano (Italia) Nederlands (Nederland) Greek (Greece) English (United States) Deutsch (Deutschland) English (Canada) English (United Kingdom) Italiano (Italia) Nederlands (Nederland) Greek (Greece) Continue reading Back to the top © 2025 All rights reserved. Contact Privacy Policy Terms of Use"
    },
    {
      "url": "https://3bananas.com/contact/",
      "text": "Contact - 3 Bananas 386-698-2861 admin@3bananas.com Facebook Instagram Facebook Instagram Home Contact Menu Select Page Contact Send Us A Message Have a question, a suggestion, or just need more information. Let us know! Call Us (386) 698-2861 Email Us admin@3bananas.com Name Email Address Message Submit Order To Go Call us to have your freshly made order, hot and ready to go when you arrive. (386) 689-2861 Gift Cards Everyone loves a 3 Bananas gift card for their birthday, anniversary, or other occasion. Buy Now Careers Want to work with the best team in town. Come on in and apply, or click below. Apply Online Parties Private Events Contact us to plan your event, birthday or anniversary party, or wedding reception on the lake. We can help you plan the perfect party from start to finish. Browse Menu 3 Bananas We Can’t Wait to See You! Our Menu  Call Us (386) 698-2861  Visit Us 11 South Lake Street, Crescent City, FL  Email Us admin@3bananas.com Home Contact Menu Facebook Instagram Copyright 2025~3 Bananas All Rights Reserved"
    },
    {
      "url": "https://zakenblad.nl/2019/06/28/online-succes-begint-bij-social-banana/",
      "text": "Online succes begint bij Social Banana Home Rubrieken Restaurant special Autotest Charity Column Euregio Familiebedrijf Gesprek aan tafel Jonge ondernemers Konnekt’os Overname Persoonlijk Rechtspraak Starter Zakenvrouw Economie Agro en voeding Arbeidsmarktoptimalisatie Bouw en vastgoed Creatieve economie Energie en milieu Financiën Horeca HR Innovatie ICT en technologie Industrie Logistiek Media & communicatie Mobiliteit en transport Ondernemerschap Onderwijs Retail Zorg en biotechnologie Cultuur Boeken Exposities Film Kunst Muziek Theater Lifestyle ICT Charity Dieren Eten & Drinken Evenement Gezondheid Kermis Mode Natuur Recreatie Reizen Religie Tech Tuinen Uitgaan Vastelaovendj Wonen Zakenblad Nummer 2 – 2025 Nummer 1 – 2025 Nummer 3 – 2024 Nummer 2 – 2024 Nummer 1 – 2024 Nummer 3 – 2023 Nummer 2 – 2023 Nummer 1 – 2023 Nummer 4 – 2022 Nummer 3 – 2022 Nummer 2 – 2022 Nummer 1 – 2022 Nummer 4 – 2021 Nummer 3 – 2021 Nummer 2 – 2021 Nummer 1 – 2021 Nummer 4 – 2020 Nummer 3 – 2020 Nummer 2 – 2020 Nummer 1 – 2020 Nummer 4 – 2019 Nummer 3 – 2019 Nummer 2 – 2019 Nummer 1 – 2019 Nummer 4 – 2018 Nummer 3 – 2018 Nummer 2 – 2018 Nummer 1 – 2018 Nummer 4 – 2017 Nummer 3 – 2017 Nummer 2 – 2017 Nummer 1 – 2017 Nummer 4 – 2016 Nummer 3 – 2016 Nummer 2 – 2016 Nummer 1 – 2016 Nummer 4 – 2015 Nummer 3 – 2015 Nummer 2 – 2015 Nummer 1 – 2015 O.Venlo Nummer 2 – 2025 Nummer 1 – 2025 Nummer 4 – 2024 Nummer 3 – 2024 Nummer 2 – 2024 Nummer 1 – 2024 Nummer 4 – 2023 Nummer 3 – 2023 Nummer 2 – 2023 Nummer 1 – 2023 Nummer 4 – 2022 Nummer 3 – 2022 Nummer 2 – 2022 Nummer 1 – 2022 Nummer 3 – 2021 Nummer 2 – 2021 Nummer 1 – 2021 Nummer 4 – 2020 Nummer 3 – 2020 Nummer 2 – 2020 Nummer 1 – 2020 Nummer 3 – 2019 Nummer 2 – 2019 Nummer 1 – 2019 Video’s Contact Adverteren Abonneren Bericht inzenden Zoek 28.6 C Weert, NL woensdag, augustus 13, 2025 Klik hier voor Nieuws uit Venlo Bericht inzenden Abonneren Adverteren Zakenblad Home Rubrieken Alle Restaurant special Autotest Charity Column Euregio Familiebedrijf Gesprek aan tafel Jonge ondernemers Konnekt’os Overname Persoonlijk Rechtspraak Starter Zakenvrouw Zakenblad Druk is een gevoel Zakenblad Ondernemen is vooruitzien Zakenblad Stof neergedwarreld; aan de slag! Zakenblad In Weert is het goed werken en ondernemen Economie Alle Agro en voeding Arbeidsmarktoptimalisatie Bouw en vastgoed Creatieve economie Energie en milieu Financiën Horeca HR Innovatie ICT en technologie Industrie Logistiek Media & communicatie Mobiliteit en transport Ondernemerschap Onderwijs Retail Zorg en biotechnologie Logistiek Fulfillment als fundament voor succesvolle e-commerce Financiën Waarom elke jurist basiskennis van het verzekeringsrecht nodig heeft Energie en milieu Tijdelijke stroomopslag nodig? Kies voor het huren van een batterij Industrie Overheid, onderwijs en ondernemers slaan handen ineen voor Techniek Campus Weerterland Cultuur Alle Boeken Exposities Film Kunst Muziek Theater Cultuur Kunstenaar Job Smeets ontwerpt NEG-jaarorde voor Weert als Närrische Kulturstadt van… Boeken Uniek boek: Weert in glas Cultuur Lennart Willems nieuwe conservator Museum W Creatieve economie Gulden Humor voor Lex Uiting Lifestyle Alle ICT Charity Dieren Eten & Drinken Evenement Gezondheid Kermis Mode Natuur Recreatie Reizen Religie Tech Tuinen Uitgaan Vastelaovendj Wonen Cultuur Kunstenaar Job Smeets ontwerpt NEG-jaarorde voor Weert als Närrische Kulturstadt van… Charity Samen aan tafel voor verbinding Mode Hoe zorg je ervoor dat je er zakelijk uitziet op kantoor? Eten & Drinken De lekkerste koffie voor jouw bedrijf! Zakenblad Alle Nummer 2 – 2025 Nummer 1 – 2025 Nummer 3 – 2024 Nummer 2 – 2024 Nummer 1 – 2024 Nummer 3 – 2023 Nummer 2 – 2023 Nummer 1 – 2023 Nummer 4 – 2022 Nummer 3 – 2022 Nummer 2 – 2022 Nummer 1 – 2022 Nummer 4 – 2021 Nummer 3 – 2021 Nummer 2 – 2021 Nummer 1 – 2021 Nummer 4 – 2020 Nummer 3 – 2020 Nummer 2 – 2020 Nummer 1 – 2020 Nummer 4 – 2019 Nummer 3 – 2019 Nummer 2 – 2019 Nummer 1 – 2019 Nummer 4 – 2018 Nummer 3 – 2018 Nummer 2 – 2018 Nummer 1 – 2018 Nummer 4 – 2017 Nummer 3 – 2017 Nummer 2 – 2017 Nummer 1 – 2017 Nummer 4 – 2016 Nummer 3 – 2016 Nummer 2 – 2016 Nummer 1 – 2016 Nummer 4 – 2015 Nummer 3 – 2015 Nummer 2 – 2015 Nummer 1 – 2015 Nummer 2 – 2025 Weert en Brainport: durf te kiezen voor vooruitgang! Nummer 2 – 2025 Weert als Poort naar Brainport: Samenwerking met Eindhoven Intensiveert Nummer 2 – 2025 Bouwbedrijf Jos. DeMonte & Zn. Nummer 2 – 2025 Tweede woning in Nederland of in het buitenland? O.Venlo Alle Nummer 2 – 2025 Nummer 1 – 2025 Nummer 4 – 2024 Nummer 3 – 2024 Nummer 2 – 2024 Nummer 1 – 2024 Nummer 4 – 2023 Nummer 3 – 2023 Nummer 2 – 2023 Nummer 1 – 2023 Nummer 4 – 2022 Nummer 3 – 2022 Nummer 2 – 2022 Nummer 1 – 2022 Nummer 3 – 2021 Nummer 2 – 2021 Nummer 1 – 2021 Nummer 4 – 2020 Nummer 3 – 2020 Nummer 2 – 2020 Nummer 1 – 2020 Nummer 3 – 2019 Nummer 2 – 2019 Nummer 1 – 2019 Nummer 2 – 2025 Joris Broekmans: van student Elektrotechniek naar banketbakker Nummer 2 – 2025 Talent boeien en binden aan de regio Nummer 2 – 2025 Kokkerelli: de essentiële rol van gezonde voeding in onderwijs en bedrijfsleven Nummer 2 – 2025 New kid on the block: Vinc, MVO-platform voor Noord-Limburg Video’s Contact Adverteren Abonneren Bericht inzenden Home Zakenblad Magazine Online succes begint bij Social Banana Zakenblad Magazine Actualiteit Economie Locatie Media & communicatie Venlo Nummer 2 - 2019 Online succes begint bij Social Banana 28 juni 2019 Niek Bastiaens, Sjoerd Lormans en Jules Jongerius.\nFotografie: Jeroen Kuit Facebook, Instagram en LinkedIn. Steeds meer ondernemers gaan enthousiast aan de slag met social media. Dat gebeurt vaak zonder een duidelijk plan en daardoor weinig succesvol. Social Banana ontzorgt ondernemers op het gebied van social media, van strategie tot uitvoering. Het succes is direct terug te zien in de statistieken. Door Wesley Hegge De knalgele bananen toveren meteen een lach op je gezicht. Maar het vrolijke beeldmerk zegt ook iets belangrijks over de werkwijze van de start-up. “Wij creëren online content vanuit doelstellingen en strategische keuzes en gaan vanuit dit uitgangspunt operationeel aan de slag. Wij maken de banaan open vanuit de achterzijde en niet vanuit de steel”, legt Sjoerd Lormans uit. “Dat maakt het online verschil.” Strategie vertalen naar content Samen met Niek Bastiaens en Jules Jongerius geeft hij leiding aan Social Banana. De twintigers hebben de ontwikkeling van Hyves tot Instagram van dichtbij meegemaakt. Social media kent voor hen geen geheimen. Ze merkten dat veel ondernemers daarentegen niet goed weten hoe ze social media in kunnen zetten. Daarom zijn ze een half jaar geleden een bedrijf begonnen. “We nemen het uit handen”, zegt Niek. “Zodat ondernemers zich kunnen focussen op hun core business. Onze klanten variëren van zzp’ers tot kleine en middelgrote bedrijven die zich bevinden in de driehoek Maastricht-Eindhoven-Nijmegen.” Social Banana onderscheidt zich door niet alleen de strategie in kaart te brengen, maar ook de uitvoering op zich te nemen. Een team vertaalt de online strategie naar tekstuele en visuele content. Jules: “Dat team bestaat uit een fotograaf, webdesigner, twee grafisch ontwerpers en vier social media marketeers. Wij maken de content gereed en passend voor ieder kanaal. Content voor Facebook is anders dan voor Instagram.” Het is voor elke ondernemer interessant om online gezien te worden. Daarom kan elke ondernemer zijn voordeel doen met het laten plaatsen van online content. Sjoerd: “Sommige ondernemers denken in omzet, maar het doel kan ook op een ander niveau liggen. Bijvoorbeeld om je te profileren richting klanten. Online succes begint voor ons bij naamsbekendheid, bereik en een juiste positionering. De ondernemer ontvangt statistieken zodat de groei kan worden bijgehouden. De rest doen wij.” Transparantie Dat begint al bij het kennismakingsgesprek. Jules: “We bespreken de mogelijkheden en nemen onze abonnementen door. Daarin staat precies wat de ondernemer krijgt. Het aantal posts per maand, statistieken en evaluatie. De abonnementen zijn gevarieerd, waardoor we zowel kleine als grote mkb’ers kunnen bedienen. We kunnen zelfs een website, logo en huisstijl maken.” Tussendoor laat Social Banana de ondernemers zien hoe de statistieken bewegen. “We houden zelf voortdurend de statistieken in de gaten”, zegt Niek. “Zo zien we of we op de goede weg zijn of misschien moeten bijsturen. Dat laten we de ondernemer ook zien, zodat hij of zij ziet wat er gebeurt. Daarbij evalueren we samen met de ondernemer de resultaten.” Wil je weten wat Social Banana voor jou als ondernemer kan betekenen? Kijk dan op onze website en doe de gratis Facebook-check! TAGS Banana Social media Social Banana DELEN Facebook Twitter tweet Vorig artikel Nieuwe parkmanager Sylvia Rutten: ‘We gaan een volgende fase in’ Volgend artikel Keyport: landelijk probleem dat vraagt om een regionale aanpak GERELATEERDE ARTIKELEN MEER VAN DEZE AUTEUR Logistiek Fulfillment als fundament voor succesvolle e-commerce Financiën Waarom elke jurist basiskennis van het verzekeringsrecht nodig heeft Energie en milieu Tijdelijke stroomopslag nodig? Kies voor het huren van een batterij Zelf nieuws insturen? Klik hier om in te zenden Tips voor ons magazine? redactie@artismediagroep.nl Adverteren in ons magazine of op onze website? Bekijk hier de mogelijkheden Abonneren op ons magazine? Vraag hier uw abonnement aan Meest recente berichten Fulfillment als fundament voor succesvolle e-commerce Waarom elke jurist basiskennis van het verzekeringsrecht nodig heeft Tijdelijke stroomopslag nodig? Kies voor het huren van een batterij Overheid, onderwijs en ondernemers slaan handen ineen voor Techniek Campus Weerterland Herinrichting haven La Bonne Aventure vormt startschot gebiedsontwikkeling Roerdelta Zakenblad Weerterland & Cranendonck + Keyport2020 wordt verspreid onder ondernemers in het MKB, inkopers en directies van grote industrieën, handelsondernemingen en dienstverlenende bedrijven. Het magazine voorziet in de informatiebehoefte van vele ondernemers en managers die geïnteresseerd zijn in zakelijke informatie over hun stad en streek. Naast economisch achtergrondnieuws en opvallende gebeurtenissen worden onderwerpen op juridisch, fiscaal en managementgebied door deskundige schrijvers belicht. Uiteraard komen ook nieuwe en reeds gevestigde ondernemers aan het woord. De praktische tips en adviezen maken het magazine tenslotte compleet. - Meld u aan voor onze nieuwsbrief Artismediagroep.nl ontwikkelt waardevolle en relevante lifestyle, zakelijke, journalistieke content en heeft daarvoor een aantal krachtige websites, social mediakanalen en gedrukte media ter beschikking. MLA stories: - likes Weert is Veranderd: - likes Met ons. In Weert.: - likes Land van Weert: - likes Zakenblad: - likes MLA Business POPULAIRE BERICHTEN Array\n(\n[custom_title] => POPULAIRE BERICHTEN\n[limit] => 3\n[sort] => popular\n) Grensovergang Kinrooi – Weert dicht Weert 19 maart 2020 Bakkerij Korsten uit Weert na 87 jaar failliet Weert 2 juli 2019 Henkelman in problemen door bankroet Belgische modereus FNG Retail 20 augustus 2020 POPULAIRE CATEGORIE Zuid-Willemsvaart 0 Wilhelminastraat 0 Wilhelminasingel 0 Nummer 1 - 2015 28 Van Berlostraat 0 Nummer 2 - 2015 27 Stationsstraat 1 Nummer 3 - 2015 29 Stationsplein 0 1,880 Fans Like 146 Volgers Volg 382 Volgers Volg Privacy- en cookiestatement Cookies Contact © Zakenblad.nl onderdeel van Art-is mediagroep."
    },
    {
      "url": "https://onebananas.com/contact-us/",
      "text": "Contact Us Newsletter Sign-Up One Bananas One Difference Our Company Premium Bananas Media Recipes Tips & Facts FAQ Contact Us Ingredients One Bananas One Difference Our Company Premium Banana Media Recipes Tips & Facts FAQs Contact Us Ingredients Contact Us Please enable JavaScript in your browser to complete this form. Name * First Last Email * Comment or Message Send We would love to hear from you! Please contact us for more information or if you have any questions about our company and our bananas and ingredients. You can find answers to our most popular questions on our FAQ page. If you did not find the answers on our FAQ page, you can email us Thanks! North America ONE BANANA NORTH AMERICA CORP. 1607 Ponce de Leon Blvd. Suite 202 Coral Gables, Florida 33134 United States EMEA ONE Banana Europe BV Gilze-Rijenstraat 3 3045 PJ  Rotterdam The Netherlands Central and South America ONE BANANA CO. 2a Calle 20-02, Colonia Vista Hermosa II, Blvd. Vista Hermosa Zona 15, Ciudad de Guatemala 01015 Guatemala Ethics Hotline If you’re worried, we are concerned as well! At One Banana we demand integrity and the fulfillment of our company’s values, including all laws, our internal policies and the company’s code of ethics. If you notice any unethical behavior, we invite you to report it through our ETHICS HOTLINE. One Banana has partnered with an external company – Etictel – to offer a secure and confidential portal, so that you can ask questions or submit complaints, over the phone or through its website. Users of this Ethics Reporting Line are protected by the Ethics and Non-Retaliation Policy, which prohibits retaliation of any kind for filing bona fide complaints. We take your concerns seriously. You can report anonymously through our contact channels: Guatemala: 502-23780188 Perú: 511-6429682 Ecuador: 1800000749 Online Reporting System [email protected] One Bananas One Difference Our Company Banana Ingredients Media Recipes Tips & Facts FAQ Contact Us Privacy Policy Website Access and Usage Terms and Conditions Site Map Contact Us © 2014 Agroamerica Fruit Company"
    },
    {
      "url": "https://www.elliott.org/company-contacts/banana-republic-customer-service-contacts/",
      "text": "Banana Republic Customer Service Contact Support Via Phone Email Exec Contacts - Elliott Report Skip to content Elliott Report Menu Menu Home Features Advocacy Destinations Problem Solved On Travel Safe Travels The Travel Troubleshooter Red List/Green List Ultimate Consumer Guides Company Contacts Sites Elliott Advocacy Christopher Elliott’s books Elliott Confidential EA Facebook Group Newsletters Elliott Advocacy Today (Daily) Elliott Confidential (Premium) Elliott’s E-Mail (Weekly) Media Leads (Weekly) Advocacy About Contact Us Get Help Elliott Report Menu Home Features Advocacy Destinations Problem Solved On Travel Safe Travels The Travel Troubleshooter Red List/Green List Ultimate Consumer Guides Company Contacts Sites Elliott Advocacy Christopher Elliott’s books Elliott Confidential EA Facebook Group Newsletters Elliott Advocacy Today (Daily) Elliott Confidential (Premium) Elliott’s E-Mail (Weekly) Media Leads (Weekly) Advocacy About Contact Us Banana Republic Customer Service Contacts Banana Republic is a clothing retailer that sells casual and business attire. How to reach a person at Banana Republic Main: (888) 277-8953 privacyemail@gap.com bananarepublic.gap.com Banana Republic Responsiveness rating 3/5 The Elliott Responsiveness Rating scores companies based on how responsive they are to customers. Here's more information about our ratings. Want to know which companies have the best -- and worst -- customer service? Check out our Red List and Green List. What you need to know about Banana Republic The company responds to most customer complaints in a satisfactory manner. How to resolve a problem with Banana Republic This guide on how to solve a customer service problem will help you resolve most problems with the company. You can also refer to the executive contacts below or contact our advocacy team directly . Note: If you’re having customer service trouble, please use our proven methods for fixing any consumer problem before contacting a manager. We care about accuracy. If any of the following email addresses bounce back or the phone numbers are incorrect, please report it to us immediately through this form. Banana Republic mailing address 500 Howard Street San Francisco., CA  94105 Banana Republic social media channels Facebook X LinkedIn Please check out our expert strategies for resolving a customer complaint before reaching out to an executive at Banana Republic. Banana Republic executive customer service contacts Primary Contact Damon Berger Head of Consumer Digital Engagement 500 Howard Street San Francisco, CA 94105, damon_berger@gap.com LinkedIn Secondary Contact Katrina O’Connell Executive Vice President 500 Howard Street San Francisco, CA 94105, katrina_oconnell@gap.com LinkedIn Chief Executive Richard Dickson 500 Howard Street San Francisco, CA 94105, richard_dickson@gap.com LinkedIn Frequently asked questions about Banana Republic What is the relationship between Banana Republic and Gap Inc.? Gap Inc. owns Banana Republic, Gap, Old Navy and Athleta. How can I contact Banana Republic customer service? To contact Banana Republic call (888) 277-8953 or email privacyemail@gap.com . Does Banana Republic have an online chat service? Yes, Banana Republic can be contacted via an online chat service . How to get professional help with your Banana Republic problem If you need help with Banana Republic, you can contact our advocacy team or just click the \"Get Help\" button. For immediate assistance, you can also send us a message on our Facebook group . Note : We do not charge for our advocacy. Get Help DISCLAIMER: The names, numbers and email addresses on this page are provided for informational purposes and are believed to be reliable. However, they should in no way be construed as a guarantee of their accuracy by Elliott.org. Company executives change their email addresses and phone numbers frequently to avoid contact with customers. If an email address bounces or a phone number is wrong, please report it to us immediately through this form. 135628 This contact was published on December 2, 2024 and updated on August 5, 2025. What's Your Problem? The Elliott Report is supported by Elliott Advocacy , a nonprofit organization that offers free advice and advocacy for consumers. If you need help with any problem, please contact us through this form . We’re always here to help. Get Help Company Contacts We publish the names and emails of customer service managers. Check out our directory. Uber Lyft Paypal Amazon Airbnb See all contacts Subscribe to our free newsletter Check out Elliott Advocacy Today , our free, daily newsletter with links to your favorite commentary, tips and news about consumer advocacy. You’ll also connect with other readers who want to make the world a better place. Name (Required) Email (Required) CAPTCHA Δ Most Popular Downgraded on my flight from Sydney to Tokyo. Why won’t Booking.com refund my money? This is the most dangerous room in a hotel Help! Someone stole 200,000 Chase points, and I can’t get them back Passengers are missing their summer flights. Here’s how to avoid being left behind Ultimate Guides The ultimate guide to finding your lost luggage Here’s your insider guide to spring break travel in 2025 Here’s your ultimate guide to holiday travel Eat this! The ultimate guide to travel food Advocacy They found toxic mold in their Vrbo rental — can they get $19,500 back? I paid for unlimited airport parking. Then the company changed its rules. StubHub charged me $747 in fees after Adele postponed her concert. But it promised not to! Tricked into a Palladium membership: My honeymoon nightmare More from Elliott Confidential CONSUMER ALERT: U.S. drops proposed airline compensation rule September 8, 2025 by Christopher Elliott The government would have required airlines to compensate you for flight delays. Here's what it means for your next trip. Are you becoming the passenger everyone hates? September 7, 2025 by Christopher Elliott By removing seatback screens, airlines unleashed a cacophony of leaky headphones and bright laptops. Here's how not to be part of the problem. Loire Valley Confidential: Our visit to a French Château September 6, 2025 by Christopher Elliott In this podcast: Our adventures at Château de Candes, a private chef experience in Paris, and yes, we've turned into a food podcast (recorded 9/5/25 in Paris) Airlines want to end consumer protections. Do they have a point? September 5, 2025 by Christopher Elliott U.S. carriers are trying to roll back decades of regulations that cover everything from refunds to fare transparency. Should the government allow it? AI Anxiety: Is the algorithm out to get you? August 31, 2025 by Christopher Elliott How travel companies use AI as a digital pickpocket — and how you can fight back What’s Your Problem? If you have a consumer problem, please contact our team at Elliott Advocacy through this form . We’re always here to help. Our help is free. Get Help Our Newsletter Check out Elliott Advocacy Today , our free, daily newsletter with links to your favorite commentary, tips and news about consumer advocacy. Did we mention it's free? Sign Up What's This Site? The Elliott Report is a consumer news site supported by Elliott Advocacy , a nonprofit organization that offers free advice and advocacy for consumers. Join Us Follow Us © 2025 Elliott Report | Privacy Policy Home Features Advocacy Problem Solved On Travel The Travel Troubleshooter Ultimate Consumer Guides Company Contacts Sites Elliott Advocacy Elliott Confidential EA Facebook Group Newsletters Elliott Advocacy Today (Daily) Elliott Confidential (Premium) Elliott’s E-Mail (Weekly) Media Leads (Weekly) Advocacy About Contact Us Get Help Close Search for: Don't Miss a Story! Our award-winning daily newsletters keep you posted on our random acts of consumer advocacy. Plus, we have insightful letters, insider tips, and more. Invalid email address Thanks for subscribing!"
    },
    {
      "url": "https://3bananas.com/",
      "text": "Home - 3 Bananas 386-698-2861 admin@3bananas.com Facebook Instagram Facebook Instagram Home Contact Menu Select Page 11 S. Lake Street Crescent City, FL 32112 Open: Monday-11 am-5 pm Tuesday-11 am-5 pm Wednesday-11 am-8 pm Thursday-11 am-5 pm Friday-11 am-8 pm Saturday-11 am-8 pm Sunday-11 am-5 pm Located On Beautiful Crescent Lake Saturday Prime Rib Special 4 PM Saturday Trivia Night Wednesday 6 pm Happy Hour Mon-Thu 3 pm-5 pm $3.50 Domestic Drafts $3.50 Wine $3.50 Well Drinks Since 2001 About 3 Bananas Located on beautiful Crescent Lake, travel to 3 Bananas by car, motorcycle, or boat. Crescent Lake is your gateway to the St. John’s River. Join us for drinks on the deck, a burger, wings, or a freshly made salad. Our extensive menu has something for everyone. Browse Menu 3 Bananas is a very historic and beautiful part of Florida. For hundreds of years, this area was a place where Timucua Indians hunted and fished. In our backyard, we are privileged to have the oldest remaining White Cypress tree remaining in Florida. It is estimated to be 613-645 years old. In good weather, a white cypress grows about 1  1/4 inches every 20 years. This beautiful tree is in the process of being placed in the national registry to be protected forever. Favorites What We’re Known For Prime Rib Join us each Saturday night for Roasted Prime Rib. Served with Salad & Potato. Order To Go Fried Banana Have you ever tried a fried banana? Order To Go Fresh Fish Try our fresh fish dinner, sandwich, or have it on a salad. Blackened, fried or grilled. Order To Go Browse Full Menu Follow Us Social Media Follow Follow 3 Bananas We Can’t Wait to See You! Our Menu  Call Us (386) 698-2861  Visit Us 11 South Lake Street, Crescent City, FL  Email Us admin@3bananas.com Home Contact Menu Facebook Instagram Copyright 2025~3 Bananas All Rights Reserved"
    },
    {
      "url": "https://blog.hootsuite.com/social-media-image-sizes-guide/",
      "text": "Social media image sizes for all networks [September 2025] Skip to content Search Free Trial Log In Start your free trial Blog Open main navigation menu Topics Analytics Video Engagement Experiments Listening Influencer marketing Scheduling Advertising Benchmarks Employee advocacy Content creation Explore all Networks Instagram Facebook TikTok LinkedIn X/Twitter YouTube Explore all Resources Free Tools Glossary Templates Webinars Hootsuite Labs Hootsuite Academy Industries Government Healthcare Education Financial services Nonprofit Real estate Legal Explore all About Hootsuite Pricing Why Hootsuite What’s new Explore all English Español Deutsch Français Strategy Social media image sizes for all networks [September 2025] The most recent image sizes for different social media networks, including Instagram, X, Facebook, LinkedIn, TikTok, Bluesky, and more. Christina Newberry September 4, 2025 10 min read Also available in Español Deutsch Français Table of Contents Quick social media image sizes Instagram image sizes X (f.k.a. Twitter) image sizes Facebook image sizes LinkedIn image sizes Pinterest image sizes Snapchat image sizes YouTube image sizes TikTok image sizes Bluesky image sizes Threads image sizes Social media image sizes seem to change … a lot. Never mind the confusion of new social platforms emerging, with their own content specs and aspect ratios. It doesn’t help that information about official dimensions and image sizes is surprisingly scarce. So what’s the big secret? The lack of official image guidelines is likely directly tied to the frequency of image guideline changes. The platforms don’t want to invest the time and energy to constantly update their image guidelines for end users. Fortunately, dear reader, we have invested that time and energy for you to create this comprehensive (and up-to-date) cheat sheet listing social media image sizes on all important social media platforms! Below are the most recent social media image dimensions, as of September 2025. Quick social media image sizes We go into more detail for every single network below, but this image includes the social media image sizes you probably look up most often. Basic Instagram image sizes Profile photo: 320 x 320 px Landscape: 1080 x 566 px Vertical: 1080 x 1350 px Square: 1080 x 1080 Stories and Reels: 1080 x 1920 Basic Facebook image sizes Profile photo: 196 x 196 px Landscape: 1080 x 566 px Vertical: 1080 x 1359 px Square: 1080 x 1080 px Stories and Reels: 1080 x 1920 px Cover photo: 851 x 315 px Basic X (formerly Twitter) image sizes Profile photo: 400 x 400 px Landscape: 1280 x 720 px Vertical: 720 x 1280 px Square: 720 x 720 px Cover photo: 1500 x 500 px Basic LinkedIn image sizes Profile photo: 400 x 400 px Landscape: 1200 x 627 px Vertical: 720 x 900 px Square: 1200 x 1200 px Cover photo: 1128 x 191 px Basic TikTok image sizes Profile photo: 20 x 20 px Landscape (ad): 1920 x 1080 px Vertical: 1080 x 1920 px Square (ad): 640 x 640 px Stories: 1080 x 1920 px Instagram image sizes Instagram supports horizontally and vertically oriented images well as square images. Well, sort of. You can still use all of these photo orientations in your posts, and that’s how they’ll appear in the Instagram feed. But they will all be displayed with a vertical crop on your Instagram grid. This makes image dimensions a little tricky to get right, especially if you want to control the look of your grid as a cohesive whole. Follow these guidelines to make sure your images end up looking their best. Instagram profile picture size: 320 x 320 pixels Instagram profile photos are displayed at 110 x 100 pixels, but the image files are stored at 320 x 320 pixels, so make sure to upload an image that’s least that big. Even though the dimensions are in a square format, Instagram profile photos are displayed as a circle. Make sure any elements you want to focus on in the photo are centered so they don’t get cropped out. Instagram post sizes: Landscape image: 1080 x 566 pixels (feed) / 1012 x 1350 (grid) Vertical image: 1080 x 1350 pixels (feed) / 1012 x 1350 (grid) Square image: 1080 x 1080 pixels (feed) / 1012 x 1350 (grid) Carousel images: 1080 x 1350 pixels (feed) / 1012 x 1350 (grid) Supported aspect ratios: Anywhere between 1.91:1 and 4:5 (feed) / 3:4 (grid) Recommended image size: Width of 1080 pixels, height between 566 and 1350 pixels Tips: If you want your images to look their best on Instagram, aim to upload an image that is 1080 pixels wide. When you share an Instagram image that’s sized over 1080 pixels, Instagram will size it down to 1080 pixels. If you share a photo that has a resolution lower than 320 pixels, Instagram will size it up to 320 pixels. If your image is between 320 and 1080 pixels wide, Instagram will keep that photo at its original resolution, “ as long as the photo’s aspect ratio is between 1.91:1 and 4:5 (a height between 566 and 1350 pixels with a width of 1080 pixels).” If you upload an image using a different ratio, the platform will automatically crop your photo to fit a supported ratio. Remember that all photos appear in vertical format on your grid. Resource: Learn how to edit Instagram photos like a pro . Instagram Stories image size: 1080 x 1920 pixels This is an aspect ratio of 9:16. The “safe area” is 1080 x 1610 pixels. Make sure to keep important content within that area of the frame. Resource: Take your Instagram Stories to the next level with these free templates . Instagram Reels sizes: 1080 x 1920 pixels (feed) / 1080 x 1440 pixels (grid) The feed aspect ratio is 9:16, while the grid view is 3:4. Instagram ads image sizes: Landscape: 1080 x 566 pixels Vertical: 1080 x 1350 pixels Square: 1440 x 1440 pixels Minimum width: 500 pixels Minimum height: 400 pixels Supported aspect ratios: Anywhere between 1.91:1 and 4:5 Image size for Instagram Stories ads: 1440 x 2560 pixels This is a 9:16 ratio. Instagram recommends leaving roughly “14% (250 pixels) of the top and 20% (340 pixels) of the bottom of the image free from text, logos, or other key creative elements” to prevent them from being covered. Instagram Reels ads size: 1440 x 2560 pixels This is a 9:16 ratio. Instagram recommends leaving roughly “14% of the top, 35% of the bottom, and 6% on each side … free from text, logos, or other key creative elements” to prevent them from being cropped or covered. X (f.k.a. Twitter) image sizes With its new video tab, X is clearly embracing a multimedia experience on the platform. Adding images to your X posts can help you stand out from the crowd. Pssst: This isn’t a video size post, but we will tell you that the recommended aspect ratio for the new X video tab is 9:16 with a minimum resolution of 720 x 1280. X (Twitter) image sizes for profile photos: 400 x 400 (recommended) Maximum file size: 2 MB. X header photo size: 1500 x 500 pixels (recommended) The way header images display changes depending on the monitor and browser being used. Even with the recommended dimensions, 60 pixels can be cropped from the top and bottom. X images sizes for in-stream photos: Landscape image: 1280 x 720 pixels Vertical image: 720 x 1280 pixels Square image: 720 x 720 pixels GIF: 1280 x 1080 pixels Tips Recommended aspect ratio: 16:9 or 1:1 Supported formats: GIF, JPG and PNG Maximum file size: Up to 5MB for photos and GIFs on mobile. Up to 15MB on the web. X image sizes for ads: Image ad with app buttons, website buttons, or polls: 800 x 418 pixels (1.91:1) or 800 x 800 (1:1) pixels. Square images in ads with polls will crop to 1.91:1 in mobile timeline. Image ad with conversation buttons: 800 x 418 pixels (1.91:1). Standalone image ads: 1200 x 1200 pixels (1:1) or 1200 x 628 pixels (1.91:1). Carousel image ads: 800 x 418 pixels (1.91:1) or 800 x 800 (1:1) pixels. All images in the carousel must use the same aspect ratio. Collection ads: 800 x 800 pixels (1:1), max 3 MB. Resource: Find more information here on how to advertise on X (Twitter) . Facebook image sizes Facebook is a tricky platform, because image sizes differ from desktop to mobile, and Facebook users are inclined to use both. (Facebook.com is the world’s third-most popular website .) We’ve got you covered on both fronts here. Facebook profile picture size: 196 x 196 pixels (recommended) Display size desktop: 176 x 176 pixels. Display size smartphone: 196 x 196 pixels. I mage sizes for Facebook cover photo: 851 x 315 pixels (recommended) Display size desktop: 820 x 312 pixels Display size smartphone: 640 x 360 pixels Minimum size: 400 x 150 pixels Ideal file size: Less than 100KB Tips To avoid any compression or distortion, upload a JPG or PNG file. Use the recommended pixel sizes for the fastest load times. Profile pictures and cover photos with logos or text work best when uploaded as a PNG file. Don’t drag to reposition once you’ve uploaded your cover photo. Resource: Get more tips on creating a great Facebook Page . Facebook timeline photo and post sizes: Landscape image: 1080 x 566 pixels (1.91:1) Vertical image: 1080 x 1359 pixels (4:5) Square image: 1080 x 1080 pixels (1:1) Facebook image sizes for Facebook Stories: 1080 x 1920 pixels (recommended ) Facebook Stories take up the full screen of a phone. That’s an aspect ratio of 9:16. Max file size is 30 MB. I mage sizes for Facebook ads: Facebook Feed ad: 1440 x 1440 pixels (1:1) or 1440 x 1800 pixels (4:5). Minimum size 600 x 600 pixels. Maximum file size of 30 MB. Facebook Search: At least 1080 x 1080 pixels. Ratio 1.91:1 to 1:1. Maximum file size of 30 MB. Facebook Marketplace image ads: Minimum 1080 x 1080 pixels (1:1). Maximum file size of 30 MB. Sizes for Facebook Right Column ads (desktop only): At least 1080 x 1080 pixels. Ratio 1:1. Image size for Facebook Stories ads: 1440 x 2560 pixels This is a 9:16 ratio. Maximum file size 30 MB. Facebook recommends leaving roughly “14% (250 pixels) of the top and 20% (340 pixels) of the bottom of the image free from text, logos, or other creative elements” to prevent them from being covered. Facebook Reels ads size: 1440 x 2560 pixels This is a 9:16 ratio. Facebook recommends leaving roughly “14% of the top, 35% of the bottom, and 6% on each side … free from text, logos, or other key creative elements” to prevent them from being cropped or covered. Resource: Here’s more info on how to advertise on Facebook . LinkedIn image sizes Just to keep things spicy, LinkedIn switches some image sizes up between personal profiles and company pages. You’ll find them all here. LinkedIn image sizes for personal p rofiles : Linkedin profile photo: 400 x 400 pixels or larger (recommended). Maximum 7680 x 4320 pixels or 8MB. Cover photo: 1584 x 396 pixels (recommended). Aspect ratio: 4:1. Maximum 8 MB. Tips Cover photos are cropped differently on mobile and desktop. Make sure to view your profile on both kinds of display before finalizing. LinkedIn image sizes for C ompany P ages: Company logo size: 400 x 400 pixels Page cover image size: 1128 x 191 pixels Life tab main image size: 1128 x 376 pixels Life tab custom modules image size: 502 x 282 pixels Life tab company photos image sizes: 900 x 600 pixels Image size for LinkedIn post with URL: 1200 x 627 pixels (recommended) Minimum width: 200 pixels LinkedIn image sizes for ads: Landscape (desktop and mobile): 1200 x 628 pixels (recommended). Minimum 640 x 360 pixels. Maximum 7680 x 4320 pixels. Max file size 5 MB. Square (desktop and mobile): 1200 x 1200 pixels (recommended). Minimum 360 x 360 pixels. Maximum 1200 x 1200 pixels. Max file size 5 MB. Vertical (mobile only): 720 x 900 pixels (recommended). Minimum 360 x 640 pixels. Maximum 2430 x 4320 pixels. Max file size 5 MB. Carousel: 1080 x 1080 pixels. 2 to 10 images. Max file size 10 MB. Pinterest image sizes Pinterest profile image size: 280 x 280 pixels (recommended) Remember that your profile photo will be displayed as a circle. Pinterest image size for profile cover photo: 800 x 450 pixels ( minimum) This is a 16:9 aspect ratio. Pinterest image sizes for Pins: Recommended size: 1000 x 1500 pixels. Recommended aspect ratio: 2:3. Other available ratios are 9:16, 3:4, 4:5, and 1:1. Max file size: 20 MB for web, 1 GB recommended for app. Tips Stay within the safe zone to make sure your content is fully visible on any device: top 270 px, left 65 px, right 195 px, bottom 790 px. Pinterest image sizes for collections Pins: Aspect ratio: 1:1 (recommended) or 2:3 Recommended size: 1000 x 1000 pixels or 1000 x 1500 pixels Max file size: 10MB Tips This format appears as one main image, above 3 to 24 smaller images. The main image’s ratio can differ from the smaller images, but all the smaller images must have the same aspect ratio. Collections appear in feeds on mobile devices. 1:1 format is recommended. If you choose a different aspect ratio, know that these Pins are cropped from the middle. Collections can also be an ad format on Pinterest. Pinterest image sizes for ads: Image and Shopping ads: 1000 x 1500 pixels (recommended). Aspect ratio 2:3 (recommended). Max file size 20 MB. Carousel ads: 1000 x 1500 pixels (2:3) or 1000 x 1000 pixels (1:1) recommended. Up to 5 images. Resource: Get some advice on how to use Pinterest for business . Snapchat image sizes Snapchat profile picture size: 320 x 320 pixels (minimum) Maximum file size is 2 MB. Snapchat banner image size: 375 x 278 pixels (recommended) You can upload an image up to 375 x 569 pixels, but it will crop to 375 x 278 Maximum file size: 2 MB Snapchat ads image size: 1080 x 1920 pixels (at minimum) Aspect ratio: 9:16 File type: JPEG or PNG Maximum file size: 5 MB Tips Don’t put any important content in the top 150 px or bottom 330 px, to make sure it won’t be covered. Resource: Learn how to use Snapchat for business . YouTube image sizes YouTube profile photo size: 800 x 800 pixels (recommended) Tips Make sure the focus of your photo is centered for best results. Maximum file size is 15 MB. Photos will render at 98 x 98 pixels. YouTube banner image size: 2 560 x 1 440 pixels ( recommended ) Aspect ratio: 16:9 Minimum dimensions 2048 x 1152 At the minimum dimensions, the safe area for text and logos to avoid being cut off is 1235 x 338 pixels Maximum file size: 6 MB YouTube video thumbnail size: 1280 x 720 pixels (recommended) Minimum width is 640 pixels Max file size if 2 MB Use a 16:9 aspect ratio YouTube podcast playlist thumbnail size: 1280 x 1280 pixels (recommended) Use a 1:1 aspect ratio Maximum file size: 10 MB Tips You can’t upload a custom thumbnail for Shorts, but you can select which frame from the video to use as the thumbnail. Resource: How to create a YouTube channel . TikTok image sizes TikTok profile photo size: 20 x 20 pixels (minimum size to upload) We recommend uploading a higher quality photo for future-proofing. TikTok video size: 1080 x 1920 ( recommended ) The ideal aspect ratio for vertical TikTok videos is 9:16. You can post videos with other dimensions, but the platform will add black bars to the top and bottom of the videos so they are full-screen. TikTok ads image sizes: Vertical (recommended): 540 x 960 pixels minimum (9:16) Landscape: 960 x 540 pixels minimum (16:9) Square: 640 x 640 pixels minimum (1:1) Carousel: 1200 x 628 pixels or 640 x 640 pixels or 720 x 1280 pixels. 2 to 35 images. Recommended max file size 100 KB. Profile photo for ads: 98 x 98 pixels (1:1). Max file size 50 KB. Resource: How to get more views on TikTok Bluesky image sizes Bluesky profile picture size: 1000 x 1000 pixels Upload a 1:1 profile photo with the most important part of the image in the center. It crops to a circle. Bluesky banner image size: 3000 x 1000 pixels Bluesky renders the banner image differently on desktop and mobile, so it’s a good idea to check different formats to make sure it looks right on each one. Keep the important information in the center. Bluesky image post size: 1000 pixels (height or width) There is no set image size for Bluesky, but the platform stores image files with the longest side at 1000 pixels. Stick with standard image sizes like 1:1, 9:16, 3:4, or 4:5 for best results. Tips Each post can have up to four images. Each image is limited to 1 MB. Resource: How to use Bluesky for business . Threads image sizes Threads profile image size: 640 x 640 pixels Like most other social platforms, the profile image is cropped to a circle. Threads post image size: 1440 x 1920 (recommended) Minimum width: 320 pixels Maximum width: 1440 pixels Acceptable aspect ratio: 0.01:1 to 10:1. Native aspect ratio is 3:4 Maximum file size: 8 MB Tips Carousel posts can include up to 20 images. Resource: How to use Threads effectively in 2025 Why is it important to get social media image sizes right? Social media marketers need to get many things right when creating visual content for social media. You’ve got to make sure the images you use comply with copyright laws . If you don’t have original imagery, you’ve got to find high-quality stock photos . And you’ve got to figure out how to create images that connect with your audience and inspire them to take action. On top of that, you’ve got to get your social media image sizes right. That’s really important because: It avoids pixelation and awkward image stretching to keep your images looking professional. Photos optimized for each social channel’s feed can help increase engagement. Incorrect sizing could cut off some of your brand’s messaging. It can future-proof your content. Using the right social media image sizes now could mean less work for your brand in the future, when networks change up how images display yet again. When building posts in Hootsuite, you never have to worry about getting the image size wrong. You can upload and refine your images using Canva’s editing tools right inside the Hootsuite dashboard. The very first step of the process is selecting a network-optimized size for your image from a drop-down menu. Here’s how it works: Log in to your Hootsuite account and head to Composer . Click on the purple Canva icon in the bottom right corner of the content editor. Select the type of visual you want to create. You can pick a network-optimized size from the drop-down list or start a new custom design. When you make your selection, a login pop-up window will open. Sign in using your Canva credentials or follow the prompts to start a new Canva account. (In case you were wondering — yes, this feature does work with free Canva accounts!) Design your image in the Canva editor. When you’re done editing, click Add to post in the top right corner. The image will automatically be uploaded to the social post you’re building in Composer. Don’t feel like memorizing all this info? Easily resize your social media images for publication through Hootsuite Composer, which includes up-to-date image dimensions for every social media network. Get started Do it better with Hootsuite , the all-in-one social media tool. Stay on top of things, grow, and beat the competition. Free 30-Day Trial Content creation Guide If you're not reading The Perch ... are you even keeping up? Email Address Subscribe By Christina Newberry Christina Newberry has been writing about digital marketing since the prehistoric days of 2002, when email opt-ins were every marketer's biggest goal. With a deep understanding of how to connect to online audiences, she shifted her focus to social media and has been contributing to the Hootsuite blog since 2016. Read more by  Christina Newberry Related Articles Employee advocacy What is employee advocacy? A guide for marketers in 2025 Content creation Social media strategy B2B social media marketing: 14 strategies for leads and reach Content creation Social media strategy Instagram Stories in 2025: Your guide to boosting engagement Social media strategy Social media tools How to manage multiple Instagram accounts (without losing your mind) The #1 social media tool Create. Schedule. Publish. Engage. Measure. Win. Try free 30-day trial 3,000+ 5-star reviews ★ ★ ★ ★ ★ About Why Hootsuite About us Careers Leadership Customers Newsroom Social impact and DEI Product features Publish Engage Monitor Advertise Analyze Pricing Standard Advanced Enterprise Guides Social Media Marketing Strategy Social Media Analytics Social Listening Best Times to Post Social Media Calendar Social Media Engagement Employee Advocacy Social Media Monitoring Social Media Advertising Resources Academy Resource Library Case studies Webinars App directory Help center Product updates Integrations Partners English English Español Deutsch Français © 2025 Hootsuite Inc. All Rights Reserved. Legal Center Trust Center Privacy Cookie Preferences Accessibility Search Thank You"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "text": "Contact Us: Get In Touch With Asian Paints for your Painting Needs Contact Us: We’d Love To Hear From You 16815 Popular searches Interior Paints Exterior Paints Shade cards SEARCH RESULTS {{searchItem.map.shadeCode}} {{searchItem.map.shadeFamilyName}}: {{searchItem.map.shadeName}} {{searchItem.map.title}} RELATED SEARCH NO MATCHES FOUND! Did you mean? {{spellCheck}} Log-In Hello! Hello! Signout en ar {{minicart.cartcount > 0 ? minicart.cartcount : 0}} ↻ Processing... You have {{minicart.cartcount}} items {{item[\"product\"][\"name\"]}} - + ₹ {{item[\"totalPrice\"][\"value\"]}} Total ₹ {{minicart.totalprice}} Checkout ↻ Menu PAINTS & COLOUR PAINTS & COLOUR Services Services WATERPROOFING WATERPROOFING INSPIRATION INSPIRATION Login/Register PAINTS & COLOUR All PAINTS & COLOUR EXPLORE COLOURS Colour Catalogue Home Colour Guide PAINT PRODUCTS Interior Paints Exterior Paints Waterproofing Wood Paints Metal Paints Undercoats RESOURCES Paint Budget Calculator Ideas Gallery Colour visualizer SERVICES Paint Store Near Me Book Painting Services Services All Services Beautiful Homes Painting Service Scib Stars WATERPROOFING All WATERPROOFING Bathrooms Terrace and Tanks Roof & Basement Interiors Tiling All Products INSPIRATION All INSPIRATION Get Inspired Paint calculator Gallery Colour Next Guides DecorPro Resources Colour Visualizer Ideas Gallery Please enter your mobile number To receive the dealer details on SMS Mobile * SUBMIT Get in Touch We’d love to hear from you Head Office Scib Chemical S.A.E 6th of October Cirt, 4th Industrial (1/3/B)B Tel:            (+202)38281090-99 Fax: (+202)38331271 Scib Paints Helpline* For enquiries, feedback and complaints please call on 16815 or write to us at info@scibpaints.com Mobile number +91 00:59 ↻ ↻ Need help with your painting needs? Fill the form below to book a free site evaluation by a Scib Paints Beautiful Homes Painting Service expert. Name Mobile Number +20 Governorate * Email By proceeding, you are authorizing Scib Paints and its suggested contractors to get in touch with you through calls, sms, or e-mail. Book an appointment ↻ Thank you! We value your interest in Scib Paints Beautiful Homes Service. We will get in touch with you shortly to schedule a visit by an expert. Try again! Oops! Something went wrong. We couldn't process your request. Please try again? Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Our Divisions More about Asian Paints Congratulations You have subscribed. Contact Us 16815 EMAIL ABOUT Research & Technology Careers Contact Us Certificates RESOURCES FAQs POLICIES Quality Policy Customer Policy Cookie Policy Environment Policy EHS Policy TOOLS Colour Catalogue Color with AP APP/Website​ COUNTRY EGYPT Country EGYPT India GLOBAL BANGLADESH MIDDLE EAST FIJI NEPAL SRI LANKA ETHIOPIA CONNECT DOWNLOAD OUR PAINTING APP CONNECT WITH US ©Scib Paints - All rights reserved Congratulations You have subscribed. Welcome User Login OR Continue as guest You have been successfully logged out Login An OTP has been sent to your registered mobile number and email id. 00:00 Resend By clicking submit, I agree to terms and conditions SUBMIT Register Please enter the 5 digit OTP sent via SMS to verify your mobile number! 00:00 Resend I agree to terms and conditions SUBMIT Please enter your mobile number To receive the dealer details on SMS SUBMIT Provide a delivary address Fullname* Email* Mobile* +91 Flat/House No/Floor* Colony/Street/Locality* Landmark City* Pincode* SUBMIT User already exist redirecting you for the login page Paint Budget Calculator Get instant estimates Calculate now Waterproofing Calculator Get an instant estimate Calculate now"
    },
    {
      "url": "https://www.bananas.com/pages/contact-us",
      "text": "Contact Us | Bananas.com\n– Bananas At Large Inc.® Musical Instruments & Pro Audio add wishlist add wishlist show wishlist add compare add compare show compare preloader x Sale! Find great deals on New and Pre-Owned Gear. Shop Now Sale Brands All Brands Fender Roland Taylor Martin Ibanez BOSS Yamaha Marshall On-Stage Squier Guitar Pre-Owned Guitar Electric Guitars Back All Electric Guitars Solidbody Electric Guitars Hollowbody Guitars Semi-Hollowbody Guitars Acoustic Guitars Back All Acoustic Guitars Steel String Acoustic Guitars Classical/Nylon String Guitars Guitar Amps Back All Guitar Amps & Accessories Guitar Combo Amps Guitar Amp Heads Guitar Amp Cabinets Acoustic Guitar Amps Guitar Amp Accessories Guitar Pedals & Effects Back Pedalboards & Power Supplies Tuners, Volume & Expression Multi-FX, Modeling, Switchers Distortion, Drive, Boost, Fuzz Reverb, Delay, and Loopers Wahs & Filters Compressor, EQ, Buffer, Preamp Chorus, Phaser, Flanger, Trem Harmony Processors & Octave Pre-Owned Pedals & Effects Shop All Pedals & Effects Guitar Picks Guitar Strings Guitar Straps Guitar Stands More Guitar Accessories Back All Guitar Accessories Tuners & Metronomes Guitar Cables Guitar Cases & Bags Guitar Slides Shop All Guitar Bass Pre-Owned Bass Electric Bass Guitars Acoustic Bass Guitars Bass Amps Back All Bass Amps Bass Combo Amps Bass Amp Heads Bass Amp Cabinets Bass Pedals & Effects Bass Strings Bass Cases & Bags Bass Straps Bass Cables More Bass Accessories Back Bass Stands Guitar Tuners & Metronomes All Bass Accessories Shop All Bass Folk Instruments Pre-Owned Folk Ukuleles Mandolins Banjos Harmonicas Resonators Lap Steels Kazoos, Jaw Harps, and Slide Whistles Folk Instrument Accessories Shop All Folk Instruments Drums & Percussion Pre-Owned Drums Drum Hardware Drum Thrones Electronic Drums Percussion Cymbals Acoustic Drums Sticks, Rods, Mallets, Brushes Drum Heads All Drum Accessories Shop All Drums Keyboard & Synth Pre-Owned Keyboard Digital Pianos Synthesizers Arrangers & Workstations MIDI Controllers Keyboard Amps Keyboard Stands and Benches Keyboard Cases & Bags Music Stands & Lighting Keyboard Accessories Shop All Keyboard Pro-Audio Pre-Owned Pro-Audio Microphones & Wireless Systems PA Systems, Loudspeakers, Mixers Headphones & In-Ear Monitors Studio Monitors Midi & Audio Interfaces DJ & Lighting Back DJ Controllers Groove Production Drum Machines & Sequencers DJ Software Turntables Headphones Stage Lighting Fog & Bubble Machines Pre-Owned DJ & Lighting Shop All DJ & Lighting Recorders & Signal Processors Software & Downloads Pro-Audio Accessories Back Cables & Adapters Mic Stands & Accessories Amp & Speaker Stands Music Stands & Lighting Cases, Racks & Bags Shop All Pro-Audio Accessories Shop All Pro-Audio Accessories Music Stands & Lighting Cables & Adapters Back Instrument Cables Microphone & XLR Cables Speaker Cables Interconnect & Breakout Cables MIDI & Data Cables Power Cables Adapters Shop All Cables & Adapters Guitar Accessories Back Guitar Strings Guitar Cables Guitar Stands Guitar Straps Guitar Picks Guitar Slides Guitar Cases & Bags Pedalboards & Power Supplies Guitar Tuners & Metronomes Shop All Guitar Accessories Bass Accessories Back Bass Strings Guitar Cables Guitar Straps Bass Cases & Bags Guitar Tuners & Metronomes Guitar Stands Shop All Bass Accessories Folk Instrument Accessories Drum Accessories Back Drum Hardware Drum Sticks Drum Heads Drum Thrones Drum Microphones Shop All Drum Accessories Keyboard Accessories Back Keyboard Stands & Benches Keyboard Cases & Bags Keyboard Pedals Shop All Keyboard Accessories Pro Audio Accessories Back All Pro Audio Accessories Cables & Adapters Mic Stands & Accessories Amp & Speaker Stands Task Lighting Cases, Racks & Bags Stands & Mounting Back Microphone Stands Guitar & Bass Stands Guitar & Bass Hangers Keyboard Stands Amp Stands Studio Monitor Stands PA Speaker Stands Shop All Stands & Mounting Merch & Apparel Shop All Accessories Services Local Delivery Lessons Band & Orchestra Back Band & Orchestra Rentals Band Books & Accessories Repairs Sell Your Gear Installations Equipment Rentals Protection Plans Financing Contact Us call us (888) 900-1959 email us info@bananas.com contact us / store locations Contact us / Store locations register / sign in Register or Sign in electro-cart-icon 0 electro-search-icon electro-cart-icon 0 Shop by category Sale Brands All Brands Fender Roland Taylor Martin Ibanez BOSS Yamaha Marshall On-Stage Squier Guitar Pre-Owned Guitar Electric Guitars Back All Electric Guitars Solidbody Electric Guitars Hollowbody Guitars Semi-Hollowbody Guitars Acoustic Guitars Back All Acoustic Guitars Steel String Acoustic Guitars Classical/Nylon String Guitars Guitar Amps Back All Guitar Amps & Accessories Guitar Combo Amps Guitar Amp Heads Guitar Amp Cabinets Acoustic Guitar Amps Guitar Amp Accessories Guitar Pedals & Effects Back Pedalboards & Power Supplies Tuners, Volume & Expression Multi-FX, Modeling, Switchers Distortion, Drive, Boost, Fuzz Reverb, Delay, and Loopers Wahs & Filters Compressor, EQ, Buffer, Preamp Chorus, Phaser, Flanger, Trem Harmony Processors & Octave Pre-Owned Pedals & Effects Shop All Pedals & Effects Guitar Picks Guitar Strings Guitar Straps Guitar Stands More Guitar Accessories Back All Guitar Accessories Tuners & Metronomes Guitar Cables Guitar Cases & Bags Guitar Slides Shop All Guitar Bass Pre-Owned Bass Electric Bass Guitars Acoustic Bass Guitars Bass Amps Back All Bass Amps Bass Combo Amps Bass Amp Heads Bass Amp Cabinets Bass Pedals & Effects Bass Strings Bass Cases & Bags Bass Straps Bass Cables More Bass Accessories Back Bass Stands Guitar Tuners & Metronomes All Bass Accessories Shop All Bass Folk Instruments Pre-Owned Folk Ukuleles Mandolins Banjos Harmonicas Resonators Lap Steels Kazoos, Jaw Harps, and Slide Whistles Folk Instrument Accessories Shop All Folk Instruments Drums & Percussion Pre-Owned Drums Drum Hardware Drum Thrones Electronic Drums Percussion Cymbals Acoustic Drums Sticks, Rods, Mallets, Brushes Drum Heads All Drum Accessories Shop All Drums Keyboard & Synth Pre-Owned Keyboard Digital Pianos Synthesizers Arrangers & Workstations MIDI Controllers Keyboard Amps Keyboard Stands and Benches Keyboard Cases & Bags Music Stands & Lighting Keyboard Accessories Shop All Keyboard Pro-Audio Pre-Owned Pro-Audio Microphones & Wireless Systems PA Systems, Loudspeakers, Mixers Headphones & In-Ear Monitors Studio Monitors Midi & Audio Interfaces DJ & Lighting Back DJ Controllers Groove Production Drum Machines & Sequencers DJ Software Turntables Headphones Stage Lighting Fog & Bubble Machines Pre-Owned DJ & Lighting Shop All DJ & Lighting Recorders & Signal Processors Software & Downloads Pro-Audio Accessories Back Cables & Adapters Mic Stands & Accessories Amp & Speaker Stands Music Stands & Lighting Cases, Racks & Bags Shop All Pro-Audio Accessories Shop All Pro-Audio Accessories Music Stands & Lighting Cables & Adapters Back Instrument Cables Microphone & XLR Cables Speaker Cables Interconnect & Breakout Cables MIDI & Data Cables Power Cables Adapters Shop All Cables & Adapters Guitar Accessories Back Guitar Strings Guitar Cables Guitar Stands Guitar Straps Guitar Picks Guitar Slides Guitar Cases & Bags Pedalboards & Power Supplies Guitar Tuners & Metronomes Shop All Guitar Accessories Bass Accessories Back Bass Strings Guitar Cables Guitar Straps Bass Cases & Bags Guitar Tuners & Metronomes Guitar Stands Shop All Bass Accessories Folk Instrument Accessories Drum Accessories Back Drum Hardware Drum Sticks Drum Heads Drum Thrones Drum Microphones Shop All Drum Accessories Keyboard Accessories Back Keyboard Stands & Benches Keyboard Cases & Bags Keyboard Pedals Shop All Keyboard Accessories Pro Audio Accessories Back All Pro Audio Accessories Cables & Adapters Mic Stands & Accessories Amp & Speaker Stands Task Lighting Cases, Racks & Bags Stands & Mounting Back Microphone Stands Guitar & Bass Stands Guitar & Bass Hangers Keyboard Stands Amp Stands Studio Monitor Stands PA Speaker Stands Shop All Stands & Mounting Merch & Apparel Shop All Accessories Services Local Delivery Lessons Band & Orchestra Back Band & Orchestra Rentals Band Books & Accessories Repairs Sell Your Gear Installations Equipment Rentals Protection Plans Financing Contact Us register / sign in Sale Brands Back All Brands Fender Roland Taylor Martin Ibanez BOSS Yamaha Marshall On-Stage Squier Guitar Back Pre-Owned Guitar Electric Guitars Back All Electric Guitars Solidbody Electric Guitars Hollowbody Guitars Semi-Hollowbody Guitars Acoustic Guitars Back All Acoustic Guitars Steel String Acoustic Guitars Classical/Nylon String Guitars Guitar Amps Back All Guitar Amps & Accessories Guitar Combo Amps Guitar Amp Heads Guitar Amp Cabinets Acoustic Guitar Amps Guitar Amp Accessories Guitar Pedals & Effects Back Pedalboards & Power Supplies Tuners, Volume & Expression Multi-FX, Modeling, Switchers Distortion, Drive, Boost, Fuzz Reverb, Delay, and Loopers Wahs & Filters Compressor, EQ, Buffer, Preamp Chorus, Phaser, Flanger, Trem Harmony Processors & Octave Pre-Owned Pedals & Effects Shop All Pedals & Effects Guitar Picks Guitar Strings Guitar Straps Guitar Stands More Guitar Accessories Back All Guitar Accessories Tuners & Metronomes Guitar Cables Guitar Cases & Bags Guitar Slides Shop All Guitar Bass Back Pre-Owned Bass Electric Bass Guitars Acoustic Bass Guitars Bass Amps Back All Bass Amps Bass Combo Amps Bass Amp Heads Bass Amp Cabinets Bass Pedals & Effects Bass Strings Bass Cases & Bags Bass Straps Bass Cables More Bass Accessories Back Bass Stands Guitar Tuners & Metronomes All Bass Accessories Shop All Bass Folk Instruments Back Pre-Owned Folk Ukuleles Mandolins Banjos Harmonicas Resonators Lap Steels Kazoos, Jaw Harps, and Slide Whistles Folk Instrument Accessories Shop All Folk Instruments Drums & Percussion Back Pre-Owned Drums Drum Hardware Drum Thrones Electronic Drums Percussion Cymbals Acoustic Drums Sticks, Rods, Mallets, Brushes Drum Heads All Drum Accessories Shop All Drums Keyboard & Synth Back Pre-Owned Keyboard Digital Pianos Synthesizers Arrangers & Workstations MIDI Controllers Keyboard Amps Keyboard Stands and Benches Keyboard Cases & Bags Music Stands & Lighting Keyboard Accessories Shop All Keyboard Pro-Audio Back Pre-Owned Pro-Audio Microphones & Wireless Systems PA Systems, Loudspeakers, Mixers Headphones & In-Ear Monitors Studio Monitors Midi & Audio Interfaces DJ & Lighting Back DJ Controllers Groove Production Drum Machines & Sequencers DJ Software Turntables Headphones Stage Lighting Fog & Bubble Machines Pre-Owned DJ & Lighting Shop All DJ & Lighting Recorders & Signal Processors Software & Downloads Pro-Audio Accessories Back Cables & Adapters Mic Stands & Accessories Amp & Speaker Stands Music Stands & Lighting Cases, Racks & Bags Shop All Pro-Audio Accessories Shop All Pro-Audio Accessories Back Music Stands & Lighting Cables & Adapters Back Instrument Cables Microphone & XLR Cables Speaker Cables Interconnect & Breakout Cables MIDI & Data Cables Power Cables Adapters Shop All Cables & Adapters Guitar Accessories Back Guitar Strings Guitar Cables Guitar Stands Guitar Straps Guitar Picks Guitar Slides Guitar Cases & Bags Pedalboards & Power Supplies Guitar Tuners & Metronomes Shop All Guitar Accessories Bass Accessories Back Bass Strings Guitar Cables Guitar Straps Bass Cases & Bags Guitar Tuners & Metronomes Guitar Stands Shop All Bass Accessories Folk Instrument Accessories Drum Accessories Back Drum Hardware Drum Sticks Drum Heads Drum Thrones Drum Microphones Shop All Drum Accessories Keyboard Accessories Back Keyboard Stands & Benches Keyboard Cases & Bags Keyboard Pedals Shop All Keyboard Accessories Pro Audio Accessories Back All Pro Audio Accessories Cables & Adapters Mic Stands & Accessories Amp & Speaker Stands Task Lighting Cases, Racks & Bags Stands & Mounting Back Microphone Stands Guitar & Bass Stands Guitar & Bass Hangers Keyboard Stands Amp Stands Studio Monitor Stands PA Speaker Stands Shop All Stands & Mounting Merch & Apparel Shop All Accessories Services Back Local Delivery Lessons Band & Orchestra Back Band & Orchestra Rentals Band Books & Accessories Repairs Sell Your Gear Installations Equipment Rentals Protection Plans Financing Contact Us electro-search-icon Sale New Pre-Owned Rewards Payment Plans In-Store Pickup & Local Delivery Lessons Instrument Repair Band & Orchestra Rentals Equipment Rentals Bananas At Large Inc.® Musical Instruments & Pro Audio Home Contact Us | Bananas.com Contact Us Store locations and hours San Rafael Hours Mon: 11:00 AM - 6:00 PM Tue: 11:00 AM - 6:00 PM Wed: 11:00 AM - 6:00 PM Thu: 11:00 AM - 6:00 PM Fri: 11:00 AM - 6:00 PM Sat: 11:00 AM - 6:00 PM Sun: 11:00 AM - 3:00 PM Visit our San Rafael store 1654 2nd Street, San Rafael, CA 94901 Call or Text: (415) 457-7600 Santa Rosa Hours Mon: 11:00 AM - 6:00 PM Tue: 11:00 AM - 6:00 PM Wed: 11:00 AM - 6:00 PM Thu: 11:00 AM - 6:00 PM Fri: 11:00 AM - 6:00 PM Sat: 11:00 AM - 6:00 PM Sun: 11:00 AM - 3 :00 PM Visit our Santa Rosa store 531 College Ave, Santa Rosa, CA 95404 Call: (707) 542-5588 Give us a ring! Call us at 1 (888) 900-1959 San Rafael location - call or text (415) 457-7600 Santa Rosa location - call (707) 542-5588 Are you following us? You can also message or follow us on Facebook to find out about upcoming events, special sales, new gear announcements and more! You can also find us on Twitter , Pinterest , YouTube and Instagram . Question about an online order? If you're trying to reach Bananas regarding an order, or if you have a question, you may reach us by calling 1 (888) 900-1959 and press \"2\" to reach on-line sales or send us an email . We check for new mail continuously during our working hours and will endeavor to respond in a timely way. If you are having a problem or need information, please include enough detail on the form so we can take action. Make reference to your order number if possible, since this will speed our response. Purchase orders If you want to send a purchase order, please send us an email with the items you'd like to order. Purchase orders require credit account setup before products will ship. Free freight and other promotions may not apply if terms are required. Question about music lessons? Fill our lessons contact form. Click here Read our FAQ page We might have the answer on our site! Visit our Frequently Asked Questions page. Store Policies and Customer Support Terms and Conditions Returns and Refunds Shipping, Delivery & In Store Pick Up Privacy Policy Frequently Asked Questions Have a question? We're here to help Call us (888) 900-1959 Text us (415) 457-7600 Loading… Join our mailing list ...for exclusive offers, new arrivals, sales and events! Subscribe Need help? Call or Text! (415) 457-7600 Visit our San Rafael store 1654 2nd Street San Rafael, CA 94901 Call or Text: (415) 457-7600 Visit our Santa Rosa store 531 College Avenue Santa Rosa, CA 95404 Call: (707) 542-5588 facebook twitter instagram pinterest youtube More Info About Us Contact Us Store Hours Return Policy Shipping Pick Up In Store Local Delivery Terms and Conditions Privacy Policy Sitemap FAQ Services Music Lessons Band & Orchestra Rentals Equipment Rentals A/V Installations Instrument Repair Financing Layaway Protect Your Gear Protect Your Package Quick Links Rewards Program Gift Cards Blog Events Bananas Logo Gear Sell Your Used Gear © 2025 Bananas At Large Inc.® Musical Instruments & Pro Audio . All Rights Reserved cc-visa cc-paypal cc-discover cc-amex Product successfully added to your Shopping Cart Continue Shopping Checkout"
    },
    {
      "url": "https://3bananas.com/menu/",
      "text": "Menu - 3 Bananas 386-698-2861 admin@3bananas.com Facebook Instagram Facebook Instagram Home Contact Menu Select Page Menu Home Contact Menu Facebook Instagram Copyright 2025~3 Bananas All Rights Reserved"
    },
    {
      "url": "https://www.bananaproducts.com/contact-us",
      "text": "Banana Safety Cones and Wholesale PPE Skip to Content Open Menu Close Menu BANANA PRODUCTS, LLC Factory Order HOME ABOUT US BANANA CONE® PRODUCTS CONTACT US DISTRIBUTORS 0 0 BANANA PRODUCTS, LLC Factory Order HOME ABOUT US BANANA CONE® PRODUCTS CONTACT US DISTRIBUTORS 0 0 Open Menu Close Menu Factory Order HOME ABOUT US BANANA CONE® PRODUCTS CONTACT US DISTRIBUTORS GET IN TOUCH WITH US Contact Us Send Us Message. Ready to embark on a journey of excellence with Banacone? Contact us today for innovative solutions, exceptional quality, and a commitment to positive impact. Your safety starts here Call: +1 (512) 430-1851 Email: info@bananaproducts.com Name * First Name Last Name Email * Message * Thank you! Banana Products is a family-owned and operated business with a warehouse in California and factory in China. We are dedicated to promoting health, safety, and humor in the workplace. QUICKLINKS Home About Us Products Contact Us QUICK CONTACT Call: +1 (512) 430-1851 Email: info@banaproducts.com Chat with us , powered by LiveChat"
    },
    {
      "url": "https://wentbananas.com/contact/",
      "text": "Contact Skip to content Banana Facts Benefits Recipes Search for: Search Search Main Menu About Went Bananas Amazon Affiliate Disclaimer Contact Disclaimer Privacy Policy Resources Sitemap Terms and Conditions Home Contact Contact Welcome to the Went Bananas contact page! We’re glad you’re here and ready to go bananas with us. If you have any questions, comments, or concerns about our website or bananas in general, please don’t hesitate to reach out to us. We promise to respond faster than a monkey can peel a banana ! If you’re feeling a-peeling and want to get in touch, you can reach us by carrier pigeon, smoke signals, or good old-fashioned email. Just don’t try to send us a banana by mail, we’ve already got plenty! And if you’re really in a bunch, feel free to give us a call. We may just answer with a banana pun, but that’s just how we roll. Thanks for going bananas with us! We always welcome comments or questions related to Went Bananas . We’d love to hear from you. Feel free to email us and we’ll be in touch as soon as possible! Want to Collaborate in Some Way? If you or your company have a product, service, or business that you’d like us to potentially write a review for, or include in an article that we already have, let us know. We’d be happy to check it out. contact@wentbananas.com media@wentbananas.com jobs@wentbananas.com EMAIL US NOW >> Thanks, Avonna WentBananas.com Home About Contact Sitemap Resources Copyright © 2025 Went Bananas Banana Facts Benefits Recipes Privacy Policy Terms and Conditions Disclaimer Amazon Affiliate Disclaimer"
    },
    {
      "url": "https://3bananas.com/author/bananasadmin/",
      "text": "bananasadmin, Author at 3 Bananas 386-698-2861 admin@3bananas.com Facebook Instagram Facebook Instagram Home Contact Menu Select Page Hello world! by bananasadmin | May 26, 2020 | Uncategorized Welcome to WordPress. This is your first post. Edit or delete it, then start writing! Home Contact Menu Facebook Instagram Copyright 2025~3 Bananas All Rights Reserved"
    }
  ]
}