{
  "query": "3dbrewing.com email",
  "fuentes": [
    {
      "url": "https://3dbrewing.com/",
      "email": "jessica@3dbrewing.com"
    },
    {
      "url": "https://leadiq.com/c/3-daughters-brewing/5a1d9dd723000053008dbe68",
      "email": "john@3dbrewing.com"
    },
    {
      "url": "https://leadiq.com/c/3-daughters-brewing/5a1d9dd723000053008dbe68",
      "email": "johnd@3dbrewing.com"
    },
    {
      "url": "https://leadiq.com/c/3-daughters-brewing/5a1d9dd723000053008dbe68",
      "email": "name@company.com"
    },
    {
      "url": "https://leadiq.com/c/3-daughters-brewing/5a1d9dd723000053008dbe68",
      "email": "sales@leadiq.com"
    }
  ],
  "mails": [
    "name@company.com",
    "jessica@3dbrewing.com",
    "sales@leadiq.com",
    "johnd@3dbrewing.com",
    "john@3dbrewing.com"
  ],
  "nombre_sitio": "3dbrewing.com",
  "origen_extraccion": "Busqueda externa paso: email",
  "textos_fuente": [
    {
      "url": "https://3dbrewing.com/",
      "text": "Home - 3 Daughters Brewing | 3 Daughters Brewing About Team Winter Wonderland News Brewing Arts Jobs For Good For Ty Giving Back Craft Beverages Beverage Finder Draft Cans Kegs RetroChill Our Beer History Store Merchandise Gift Cards RetroChill Whiskey Music & Events St. Pete Clearwater Food St. Pete Clearwater Tasting Room St. Pete (Original) Clearwater Beach Rental Space Contact Home Our beers. Our passion. Our story. How many beers does it take to put three daughters through college? In the beginning, it all started with two questions for Leigh and Mike Harting. 1)Does craft beer really make a better beer-battered fish? 2)How are we going to put our 3 Daughters to college?  \r\n\r\nWhile operating a successful restaurant in St. Petersburg, FL, Mike and his head chief Ty Weaver, were working on a recipe for a craft beer battered fish and decided to make it with their own hand-crafted brews. To them, it was a lot like cooking - you follow a recipe, adjust to taste, and then hope everyone likes the final product. Mike, Leigh, and Ty decided it was pretty good, so they put some on tap. To their surprise, it wasn't just pretty good. It outsold every other beer they had. As they started brewing more and as the popularity of the beers grew, they decided to try to find a small but more advanced brewing system that would fit in the restaurant. Instead, they came upon an industrial-sized, 30-barrel brewhouse that took up more space than the entire dining room itself. Exasperated, Leigh looked at him and asked the all-important question: \"How many beers do we have to sell to put to our three daughters through college?\"\r\n\r\nAnd so, 3 Daughters Brewing was born, officially opening its doors in St. Petersburg in December of 2013 in a small 1600 square-foot tasting room.  Mike worked hard on operations and funding, Ty used his unique experience to make amazing craft brews and Leigh jumped in the car and started selling 3 Daughters beer across the state of Florida. Fast forward to today and 3 Daughters Brewing has grown into one of the largest independent breweries in Florida. Our tasting room in St. Petersburg is one of (if not) the busiest tasting rooms in the state, often serving over 250,000 annually in our large warehouse that has turned into a major live entertainment venue.   In March of 2022, we opened our second tasting room in Clearwater Beach with its own brewing system and amazing views of Clearwater Beach. In May of 2022, we also opened our first airport location inside of St.Pete-Clearwater International Airport serving over 2.4 million passengers annually.\r\n\r\nThanks to Ty’s innovation and Mike’s drive we now also brew award-winning Beers, Ciders, Seltzers, Vodka+Soda Canned Cocktails, Energy Drinks, and Non-Alcoholic beverages (we also make our own honey).  \r\n\r\nWith Leigh always out selling our brands we are now found in every part of Florida from Key West to the Panhandle and from Jacksonville to Naples. You can also find 3 Daughters Brewing in every major retailer, amusement park, liquor store and most major restaurants throughout Florida. 3D GEAR NEWSLETTER Craft Beverages VIEW ALL Live MUSIC & EVENTS VIEW ALL 3DB Spotlight Food Truck Festival! Sunday, September 14th, 12pm-6pm We're eatin' good in this neighborhood!\r\nSt. Pete and Tampa Bay's best food trucks are taking over 3 Daughters Brewing for an afternoon full of great food, cold beer and live music.\r\nAdmission is free and open to all ages. Live music from 2-6 pm.\r\nParticipating trucks include:\r\n~Kielbasa Bus\r\n~Quiero Mas Tacos\r\n~Main Street Boys Empanadas\r\n~Thai Gourmet Market\r\n~The Rolling Rainbow Mobile Bar 3D BITES VIEW MENU TONIGHT!! In Clearwater Beach, we are throwing a m It's almost National Chicken Wing Day, so you know How to beat the summer heat in Florida, a guide: Join us tonight for our annual French Fry Festival GUESS THAT BEER 🍺⭐️ We have a thing for tal BATTLE OF THE BOY BANDS, but make it silent disco Summer is just heating up in St. Pete 🔥 Whether 🎤 Big laughs. Cold beers. Total chaos.🎤\nThe Beach Blonde Block Party & Night Market ft. @NoFil 🍺Celebrate Dad with us this Sunday!🍺\n\nWe’v 📣New Brewer’s Batch Crowler drop!\n\n🔥 Pit M 🌴🎉 Summer’s almost here and we’re going 🔥 Who’s got the best BBQ in St. Pete? We’re 🔥 June is packed with epic events! 🔥 From a 👨‍👧‍👦 Bags and Brews is back! 🍻 Jo Today we reserve a place and raise a toast for tho 🧡 🇺🇸Long weekend vibes call for an ice co 🎉 It’s our BIGGEST Food Truck Festival ever! Load More... Follow on Instagram Check out each locations Home page for hours of operation. 3 Daughters Brewing's great tasting craft beers are available around the state of Florida. 3 Daughters Brewing. 222 22nd St S, St Petersburg, FL 33712 © 2020 3 Daughters Brewing . All Right Reserved. About ▼ Team Winter Wonderland News Brewing Arts Jobs For Good ▼ For Ty Giving Back Craft Beverages ▼ Beverage Finder Draft Cans Kegs RetroChill Our Beer History Store ▼ Merchandise Gift Cards RetroChill Whiskey Music & Events ▼ St. Pete Clearwater Food ▼ St. Pete Clearwater Tasting Room ▼ St. Pete (Original) Clearwater Beach Rental Space Contact [ Placeholder content for popup link ] WordPress Download Manager - Best Download Management Plugin Close ×"
    },
    {
      "url": "https://leadiq.com/c/3-daughters-brewing/5a1d9dd723000053008dbe68",
      "text": "3 Daughters Brewing Company Overview, Contact Details & Competitors | LeadIQ Learn more at LeadIQ.com Start free Insights Similar companies Tech Stack Media & News Email Format FAQ Insights Gathering insights about 3 Daughters Brewing â¦ Similar companies to 3 Daughters Brewing Tampa Bay Brewing Company $100M $1B Big Storm Brewing Co. $10M Motorworks Brewing $100M $1B Cigar City Brewing $10M $50M Explore similar companies 3 Daughters Brewing Tech Stack 3 Daughters Brewing uses 8 technology products and services including jsDelivr, RSS, MySQL, and more. Explore 3 Daughters Brewing 's tech stack below. jsDelivr Content Delivery Network RSS Content Management System MySQL Database Font Awesome Font Scripts Floating UI Javascript Libraries Modernizr Javascript Libraries UPS Logistics Priority Hints Performance Media & News 3 Daughters Brewing Company receives award Best of the Bay. Thank you to everyone who voted for 3 Daughters Brewing Company in the Best of the Bay awards! Sep 27, 2024 | 3dbrewing.com 3 Daughters Brewing Company launched Daddy-Daughter Inshore Fishing Tournament on Mar 16th '24. March 16, 2024 - The owners of 3 Daughters Brewing are launching a Daddy-Daughter Inshore Fishing Tournament to bolster familial relationships and encourage women and girls to participate in an often male-dominated activity. Mar 16, 2024 | stpetecatalyst.com Jenkinslawpl partners with 3 Daughters Brewing Company. Jenkinslawpl is teaming up with 3 Daughters Brewing to host an unforgettable event for the whole family. Jan 19, 2023 | www.jenkinslawpl.com 3 Daughters Brewing Company is developing magnetic round IUD. 3 Daughters â a spinout from U Mass- Amherst â is developing a magnetic round IUD that is more comfortable to insert and remove. Oct 10, 2022 | www.wellmadehealth.com 3 Daughters Brewing Company launched Oktoberfest beer on Aug 10th '21. 3 Daughters... As the fest season approaches, 3 Daughters Brewing in St. Petersburg announced the release of its Oktoberfest beer this week, a festbier brewed in honor of the Bavarian celebration of beer. Aug 10, 2021 | 3dbrewing.com 3 Daughters Brewing Company partners with St. Petersburg Distillery Company, Inc.. 3 Daughters Brewing announced a collaboration brew with St. Petersburg Distillery, Total Wine and More. Nov 18, 2020 | tampachamber.wordpress.com 3 Daughters Brewing Company recognized as Official Hard Seltzer. 3 Daughters Brewing, one of the fastest growing regional breweries in Florida, has been announced as the Official Hard Seltzer for the 2nd annual Skyway 10K and corresponding events. Jan 29, 2019 | www.prnewswire.com 3 Daughters Brewing 's Email Address Formats 3 Daughters Brewing uses at least 1 format(s): 3 Daughters Brewing Email Formats Example Percentage First@3dbrewing.com John@3dbrewing.com 46% Last@3dbrewing.com Doe@3dbrewing.com 7% FirstL@3dbrewing.com JohnD@3dbrewing.com 1% First@3dbrewing.com John@3dbrewing.com 46% See more formats Frequently Asked Questions Where is 3 Daughters Brewing 's headquarters located? 3 Daughters Brewing 's main headquarters is located at 222 22nd Street South, St Petersburg, FL 33712, US . The company has employees across 2 continents, including North America South America . What is 3 Daughters Brewing 's phone number? You can contact 3 Daughters Brewing 's main corporate office by phone at +1-727-495-**** . For more prospecting data, LeadIQ has access to up-to-date and accurate contact information within our platform. Find, capture, and sync contact data to your CRM and sales tools in one click. What is 3 Daughters Brewing 's official website and social media links? 3 Daughters Brewing 's official website is 3dbrewing.com and has social profiles on LinkedIn . How much revenue does 3 Daughters Brewing generate? As of August 2025 , 3 Daughters Brewing 's annual revenue reached $15M . What is 3 Daughters Brewing 's SIC code NAICS code ? 3 Daughters Brewing 's SIC code is 5813 - Drinking Places (alcoholic Beverages) NAICS code is 722 - Food Services and Drinking Places . How many employees does 3 Daughters Brewing have currently? As of August 2025 , 3 Daughters Brewing has approximately 51 employees across 2 continents, including North America South America . Key team members include Founder & Ceo: M. H. Coo: B. H. Director Of Marketing: N. R. . Explore 3 Daughters Brewing 's employee directory with LeadIQ. What industry does 3 Daughters Brewing belong to? 3 Daughters Brewing operates in the Food and Beverage Services industry. What technology does 3 Daughters Brewing use? 3 Daughters Brewing 's tech stack includes jsDelivr RSS MySQL Font Awesome Floating UI Modernizr UPS Priority Hints . What is 3 Daughters Brewing 's email format? 3 Daughters Brewing 's email format typically follows the pattern of . Find more 3 Daughters Brewing email formats with LeadIQ. When was 3 Daughters Brewing founded? 3 Daughters Brewing was founded in 2013 . 3 Daughters Brewing Food and Beverage Services United States 51-200 Employees 3 Daughters Brewing originated in the warehouse district of St Pete, FL and now has a second location on Clearwater Beach!\n\nWith our 30 bbl brewhouse, we have the capacity to serve the state of Florida with amazing craft beers! From our flagship, Beach Blonde Ale to our best selling IPA, Florida Orange, and all the fun small batch brews we create in between! \r\n\nWith 18+ tap handles of beer, cider and hard cocktails, we are more than just craft brews on tap- itâs our family & our community who make us who we are!\n\nCome with your friends, family, children & pets! But just know, we only have one TV for the âmust watchâ Florida games. Otherwise, put your phones down and play corn hole, oversized Jenga, life-sized Connect 4, foosball, darts and all your favorite board games with the people who matter most to you.\n\nBut thatâs not all! We also have live music every weekend at both locations and monthly markets, yoga classes, food truck rallyâs, DIY workshop classes and so much more!! For more info, check out our website at www.3dbrewing.com! \n\n\r\nHours of operation:\r\nMon - Thurs: 11:30-10\r\nFriday: 11:30-12\r\nSaturday: 11:30-12\r\nSunday: 11:30-8 Sign up for free to view info Email Format Employee directory Company Overview Headquarters 222 22nd Street South, St Petersburg, FL 33712, US Phone number +1-727-495-**** Website 3dbrewing.com SIC Code 5813 - Drinking Places (alcoholic Beverages) NAICS Code 722 - Food Services and Drinking Places Founded 2013 Employees 51-200 Media & News 3 Daughters Brewing Company receives award Best of the Bay. Sep 27, 2024 | 3dbrewing.com 3 Daughters Brewing Company launched Daddy-Daughter Inshore Fishing Tournament on Mar 16th '24. Mar 16, 2024 | stpetecatalyst.com Jenkinslawpl partners with 3 Daughters Brewing Company. Jan 19, 2023 | www.jenkinslawpl.com Read more news Funding & Financials $10M $50M 3 Daughters Brewing 's revenue is in the range of $10M $50M Funding & Financials $10M $50M 3 Daughters Brewing 's revenue is in the range of $10M $50M Company Leadership M. H. Founder & Ceo Mobile Phone Email B. H. Coo Mobile Phone Email N. R. Director Of Marketing Mobile Phone Email T. W. Sales Director Mobile Phone Email D. C. Director Of Quality Mobile Phone Email Employee Directory L. M. Retail Account Manager Mobile Phone Email B. B. Area Manager Mobile Phone Email G. C. Sales Insights Manager Mobile Phone Email B. R. Logistics Manager Mobile Phone Email D. U. Regional Sales Manager Mobile Phone Email Go to Employee Directory Ready to create more pipeline? Get a demo and discover why thousands of SDR and Sales teams trust LeadIQ to help them build pipeline confidently. Sign me up Ready to create more pipeline? Get a demo and discover why thousands of SDR and Sales teams trust LeadIQ to help them build pipeline confidently. Book a demo Platform Identify prospect data Track sales triggers Compose personalized messages Enrich Salesforce data Success Stories Resources Pricing Blog Company Search Support Careers Data Community Our Data Privacy Center Legal Privacy Policy Cookie Policy Terms of Service Do Not Sell or Share My Personal Information Compare LeadIQ vs. Zoominfo LeadIQ vs. Apollo LeadIQ vs. Lusha LeadIQ vs. Cognism LeadIQ vs. Seamless.ai LeadIQ vs. Usergems LeadIQ vs. Champify Contact 1-888-653-2347 support@leadiq.com sales@leadiq.com Â© LeadIQ, Inc. All rights reserved."
    }
  ]
}