{
  "query": "3rdplanetbrewing.com email",
  "fuentes": [
    {
      "url": "https://www.3rdplanetbrewing.com/private-events/",
      "email": "events@3rdplanetbrewing.com"
    },
    {
      "url": "https://craftbeerspots.com/3rd-planet-brewing/",
      "email": "rwk3@craftbeerspots.com"
    },
    {
      "url": "https://www.lostplanetbrewing.com/",
      "email": "info@lostplanetbrewing.com"
    }
  ],
  "mails": [
    "info@lostplanetbrewing.com",
    "events@3rdplanetbrewing.com",
    "rwk3@craftbeerspots.com"
  ],
  "nombre_sitio": "3rdplanetbrewing.com",
  "origen_extraccion": "Busqueda externa paso: email",
  "textos_fuente": [
    {
      "url": "https://www.3rdplanetbrewing.com/private-events/",
      "text": "Private Events | 3rd Planet Brewing in Niceville, FL Skip to main content 1400 E John Sims Parkway, Niceville, FL 32578 (850) 424-4257 Hours & Location sub-menu Hours & Location The Mothership Our Beers About Food Truck Private Events Events Merchandise Store 1400 E John Sims Parkway, Niceville, FL 32578 (850) 424-4257 Toggle Navigation Hours & Location sub-menu Hours & Location The Mothership Our Beers About Food Truck Private Events Events Merchandise Store Gift Cards Calendar Jobs Press Contact Email Signup Facebook Instagram Foursquare Yelp TripAdvisor 1400 E John Sims Parkway, Niceville, FL 32578 (850) 424-4257 powered by BentoBox Main content starts here, tab to start navigating Private Events Pricing for 3rd Planet Brewing Inquire Now 3rd Planet Event Room Rental (prices subject to change) The Launchpad Room $325 Room rental AVAILABILITY Monday & Wednesday 3pm to 8pm Thursday & Friday 12pm to 5pm $325 Rental fee consists of $75 rental fee required at time of reservation $250 minimum bar tab one one credit card day of event Automatic 20% gratuity added 30 minute set up (additional time for set up available at $50/hour) 2 hours for event (one additional hour available at $50/hour) 30 minute teardown (additional time for teardown available at $50/hr) Maximum party size 20-25 Observation Deck Room - $700 (screened in patio) Room rental AVAILABILITY Monday & Wednesday 3pm to 8pm Thursday & Friday 12pm to 5pm $700 rental fee consists of $200 rental fee required at time of reservation $500 minimum bar tab one one credit card day of event Automatic 20% gratuity added 30 minute set up (additional time for set up available at $50/hour) 3 hours for event (one additional hour available at $50/hour) 30 minute teardown (additional time for teardown available $50/hr) Maximum party size 80-100 For additional inquiries and information please contact events@3rdplanetbrewing.com Inquire Now Call (850) 424-4257 Facebook Instagram Foursquare Yelp TripAdvisor Gift Cards Calendar Jobs Press Contact Email Signup powered by BentoBox leave this field blank Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. leave this field blank Contact Us About Your Private Event Please, enter a valid email Email - Required Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid phone number Phone Number - Required Please, enter a valid company Company - Required Event Date - Required Please, enter a valid start time Start Time - Required Start Time 11:30 PM 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM 6:30 AM 6:00 AM 5:30 AM 5:00 AM 4:30 AM 4:00 AM 3:30 AM 3:00 AM 2:30 AM 2:00 AM 1:30 AM 1:00 AM 12:30 AM 12:00 AM Please, enter a valid end time End Time - Required End Time 11:30 PM 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM 6:30 AM 6:00 AM 5:30 AM 5:00 AM 4:30 AM 4:00 AM 3:30 AM 3:00 AM 2:30 AM 2:00 AM 1:30 AM 1:00 AM 12:30 AM 12:00 AM Please, enter a valid type of event Type of Event - Required Type of Event Alumni Bachelor / Bachelorette Birthday Cocktail Reception Corporate Lunch Engagement Fundraiser Graduation Holiday Meeting / Presentation Photo / Film Shoot Private Dinner Rehearsal Dinner Shower Sporting Event Wedding Other Please, enter a valid number of people Number of People - Required Additional Information - Optional Submit Please check errors in the form above Thank you for your inquiry. We’ll be in touch shortly. Close This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."
    },
    {
      "url": "https://craftbeerspots.com/3rd-planet-brewing/",
      "text": "3rd Planet Brewing Skip to content Search for: Search Close a search form Close Breweries Charlotte, NC Breweries Other Breweries Bottle Shops Charlotte, NC Shops Other Shops Online Shops Bars Charlotte, NC Bars Other Bars Store Trading Cards Logo Merch Craft Beer Artwork NFT Collectables More Cards NFTs Map Reviews On Deck Closed Contact About Menu 0 Open a search form in a modal window 3rd Planet Brewing Written by Bob Posted on April 3, 2023 February 4, 2023 Leave a comment This is their “Mothership” location is quite large, featuring 26 taps inside and 4 more outside including several guest taps. 1400 E John Sims Pkwy, Niceville, FL 32578 3rdPlanetBrewing.com Dozens of outdoor picnic tables hosting events like live music and a family play area. Corn hole. Pet friendly. Substantial parking. Food trucks. Reportedly they do offer flights on quiet days but there’s frequently some kind of event taking place where it is suspended. Recent Untappd Check-ins Share this: Click to share on X (Opens in new window) X Click to share on Facebook (Opens in new window) Facebook Click to share on Reddit (Opens in new window) Reddit Click to share on Pinterest (Opens in new window) Pinterest Click to email a link to a friend (Opens in new window) Email Posted in Breweries of Florida Tagged Dog Friendly , Food: Food Trucks , For Sale: Cans , For Sale: Clothing , For Sale: Glasses , Outdoor Seating Post navigation Previous Entry Guinness Open Gate Next Entry Wicked Weed (CLT Airport) Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Notify me of follow-up comments by email. Notify me of new posts by email. Δ Search for: Search Button Browse Spots Browse Spots Select Category Articles  (16) Bars  (227) Bars of Alabama  (5) Bars of Arizona  (3) Bars of Asheville  (10) Bars of California  (4) Bars of Canada  (1) Bars of Charlotte  (85) Bars of Europe  (46) Bars of Florida  (8) Bars of Georgia  (2) Bars of Illinois  (10) Bars of India  (2) Bars of Louisiana  (1) Bars of Michigan  (3) Bars of Minneapolis  (1) Bars of New Hampshire  (2) Bars of New York  (3) Bars of North Carolina  (36) Bars of Ohio  (1) Bars of Raleigh  (1) Bars of South Carolina  (8) Bars of Virginia  (9) Bottle Shops  (131) Bottle Shops of Alabama  (1) Bottle Shops of Arizona  (1) Bottle Shops of Asheville  (8) Bottle Shops of California  (2) Bottle Shops of Charlotte  (55) Bottle Shops of Europe  (17) Bottle Shops of Florida  (3) Bottle Shops of Georgia  (2) Bottle Shops of Illinois  (5) Bottle Shops of Massachusetts  (1) Bottle Shops of North Carolina  (31) Bottle Shops of Raleigh  (2) Bottle Shops of South Carolina  (4) Bottle Shops of Virginia  (2) Online  (8) Breweries  (274) Breweries of Alabama  (2) Breweries of Arizona  (5) Breweries of Asheville  (18) Breweries of California  (14) Breweries of Charlotte  (109) Breweries of Colorado  (1) Breweries of Europe  (19) Breweries of Florida  (8) Breweries of Georgia  (2) Breweries of Illinois  (5) Breweries of India  (5) Breweries of Louisiana  (1) Breweries of Michigan  (2) Breweries of Minnesota  (5) Breweries of Missouri  (1) Breweries of New Hampshire  (2) Breweries of New York  (1) Breweries of North Carolina  (72) Breweries of South Carolina  (9) Breweries of Tennessee  (2) Breweries of Texas  (1) Breweries of Virginia  (19) Where to get Craft Beer in Charlotte, and Beyond With so many craft breweries, bottle shops and bars today, it would be easy to miss a great spot. We are prouldly support craft beer providers by helping ensure you don’t miss out! (C) 2017-2024 RWK Systems 2025 RWK Systems Twitter Facebook Instagram Untappd Discord"
    },
    {
      "url": "https://www.lostplanetbrewing.com/",
      "text": "Lost Planet Brewing Company 0 Skip to Content Lost Planet Brewing Company Events Order On-Line Rewards Gift Cards Home Open Menu Close Menu Lost Planet Brewing Company Events Order On-Line Rewards Gift Cards Home Open Menu Close Menu Events Order On-Line Rewards Gift Cards Home Welcome To Lost Planet Brewing Company Contact Us Now LPB Contact Form Name * First Name Last Name Email * Subject * Message * Thank you, for your message! About Us. Located in the historic Humane Steam Fire Engine Co. building in Royersford, PA, Lost Planet offers guests an exceptional experience providing a unique location to enjoy craft beer and an excellent gastropub fare in a community environment. We will be offering a private event space in the beautifully restored second floor which has charms to suit every taste and activity. We serve a wide selections of beers to suit any discerning palette in a turn of the century firehouse which pays tribute to those who build the fire house, worked there and served the community then and now. Connect with us Visit Us 301 Walnut Street Royersford, PA 19468 Hours MONDAY                                    CLOSED TUESDAY-THURSDAY              3PM - 10PM FRIDAY-SATURDAY                  11:30AM - 11PM SUNDAY                                    11:30AM - 8PM Phone 610-854-8351 Take Out Our Take our menu will be coming shortly!"
    }
  ]
}