{
  "fuentes": [
    {
      "url": "https://mothership.cc/contact-us",
      "email": "hk@mothership.cc"
    },
    {
      "url": "https://mothership.cc/contact-us",
      "email": "ny@mothership.cc"
    },
    {
      "url": "https://mothership.cc/contact-us",
      "email": "sf@mothership.cc"
    },
    {
      "url": "https://mothership.cc/contact-us",
      "email": "syd@mothership.cc"
    },
    {
      "url": "https://www.weareplanet.com/contact",
      "email": "media@weareplanet.com"
    },
    {
      "url": "https://www.yushengteo.com/coding/ms-branding/about.html",
      "email": "info@mothership.sg"
    },
    {
      "url": "https://www.yushengteo.com/coding/ms-branding/about.html",
      "email": "sales@mothership.sg"
    },
    {
      "url": "https://emeraldcoastbeerfest.com/r/brewery/315/niceville-fl/3rd-planet-brewing",
      "email": "info@emeraldcoastbeerfestival.com"
    },
    {
      "url": "https://www.3rdplanetlife.com/contact",
      "email": "info@aduco.com"
    },
    {
      "url": "https://escambiabayhomebrewers.org/brewery/niceville-fl/3rd-planet-brewing-the-mothership/20",
      "email": "info@ebhb.org"
    }
  ],
  "mails": [
    "hk@mothership.cc",
    "info@aduco.com",
    "info@ebhb.org",
    "info@emeraldcoastbeerfestival.com",
    "info@mothership.sg",
    "media@weareplanet.com",
    "ny@mothership.cc",
    "sales@mothership.sg",
    "sf@mothership.cc",
    "syd@mothership.cc"
  ],
  "nombre_sitio": "3rdplanetbrewing.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://mothership.cc/contact-us",
      "text": "Mothership - Contact Us Get in touch Home Contact Us Contact us Get in touch via the form below or live chat . Alternatively, reach out directly to a location near you. We're growing! Keen to join the team? Follow us on LinkedIn , where we post job openings. Tell us about yourself. How can we help? Sydney Suite 14, 50 Reservoir St , Surry Hills , NSW 2010 Icon meaning Phone Number +61 2 9011 1019 Icon meaning Email Address syd@mothership.cc San Francisco 548 Market St , San Francisco , CA 94104 Icon meaning Phone Number +1 415-212-9599 Icon meaning Email Address sf@mothership.cc New York 228 Park Ave S , New York , NY 10003 Icon meaning Phone Number +1 646-906-9061 Icon meaning Email Address ny@mothership.cc Hong Kong Rm 22B, 22 / F, Kiu Yin Bldg , 361 - 363 Lockhart Rd, Wanchai Icon meaning Phone Number +852 5803 3750 Icon meaning Email Address hk@mothership.cc Footer Growth, through empowered communities. Linkedin Twitter Facebook Platforms Collabur Prsm Newsworthy Spacekit TalentHunt Prospr.io Boomi Capabilities Branding Growth Advisory Design & Innovation Onboarding & Learning Ventures About us Our Team Careers News Press Partners Resources Contact Us Featured Insights Whitepapers Frameworks Legal Privacy Policy Terms of Use Cookie Settings © 2018 - 2023 Mothership Ventures Pty Ltd. Trademarks and brands are the property of their respective owners."
    },
    {
      "url": "https://www.weareplanet.com/contact",
      "text": "Get in Touch | Planet Skip to main content Products Solutions Resources Company Protel login Contact us Back Accept payments Online Accept payments on your website, mobile app or via a secure link In-person Take in-person payments inside, outside or on-the-go Accept payments One partner to accept payments anywhere, anytime Software for hospitality Property Management System Manage your day-to-day hotel operations easily and securely Hospitality network Enterprise Wi-Fi, in-room entertainment, and fully managed hotel infrastructure Software for retail Order Management Software Fulfil online orders from your store efficiently Serve any customer Dynamic Currency Conversion Localise the checkout experience for international customers Multi Currency Pricing Localise the browsing experience for international customers. Payment methods Explore payment options for your checkout. Tax Free for merchants Issuing Issue Tax Free forms – at scale Shopper journey Track VAT refunds near real-time. Tax Free for Shoppers Track my refund Retail Bring your payments, Tax Free, and OMS together with Planet Hospitality Payments and Software for hotels, bars, restaurants and quick service outlets Travel Create smoother payments journeys Blogs Read about the latest insights, trends and topics from Planet Customer stories Discover why businesses around the world choose Planet Customer resources Committed to exceptional support and resources for a seamless experience Partners Meet the partners we work with to bring more to the end customer Guides & reports Discover valuable industry insights in our latest guides and e-books Planet ecampus Browse our wide range of courses designed to enhance your knowledge of Planet’s products Featured customer stories How Planet powers fast, flexible payments with Oracle Simphony at Coventry Building Society Arena How Planet and Flowbird transformed Newcastle City Council’s parking operations Hôtel Paris Bastille enhanced guest service with Protel PMS and integrated payments How Mersey Tunnels keeps Liverpool on the move with Planet About us Find out more about Planet, our integrated solutions, and who we serve Newsroom Find resources and Planet contact details for press and media Planet events Join us at global industry events and discover how Planet is shaping the future of payments and software Support Get in touch with us today for local support in your country Products Solutions Resources Company Protel login Contact us Accept payments Online Accept payments on your website, mobile app or via a secure link In-person Take in-person payments inside, outside or on-the-go Accept payments One partner to accept payments anywhere, anytime Software for Hospitality Property Management System Manage your day-to-day hotel operations easily and securely Hospitality network Enterprise Wi-Fi, in-room entertainment, and fully managed hotel infrastructure Software for Retail Order Management Software Fulfil online orders from your store efficiently Serve any customer Dynamic Currency Conversion Localise the checkout experience for international customers Multi Currency Pricing Localise the browsing experience for international customers. Payment methods Explore payment options for your checkout. Tax Free for Merchants Issuing Issue Tax Free forms – at scale Shopper journey Track VAT refunds near real-time. Tax Free for Shoppers Track my refund Retail Bring your payments, Tax Free, and OMS together with Planet Hospitality Payments and Software for hotels, bars, restaurants and quick service outlets Travel Create smoother payments journeys Blogs Read about the latest insights, trends and topics from Planet Customer stories Discover why businesses around the world choose Planet Customer resources Committed to exceptional support and resources for a seamless experience Partners Meet the partners we work with to bring more to the end customer Guides & reports Discover valuable industry insights in our latest guides and e-books Planet ecampus Browse our wide range of courses designed to enhance your knowledge of Planet’s products Featured customer stories How Planet powers fast, flexible payments with Oracle Simphony at Coventry Building Society Arena How Planet and Flowbird transformed Newcastle City Council’s parking operations Hôtel Paris Bastille enhanced guest service with Protel PMS and integrated payments How Mersey Tunnels keeps Liverpool on the move with Planet About us Find out more about Planet, our integrated solutions, and who we serve Newsroom Find resources and Planet contact details for press and media Planet events Join us at global industry events and discover how Planet is shaping the future of payments and software Support Get in touch with us today for local support in your country How can we help you today? New to planet Sales & Product enquires Get help from one of our local consultants Get in touch Support If you have a technical issue or need support troubleshooting, please check the relevant portal for assistance Check out our phone and email options below Contact support Track a Tax Free refund? If you are looking to track your Tax Free refund, click on the button below. See \"Track my refund\" on the menu bar. Track my refund For media enquiries Please click on the button below if you'd like to contact our Press Office and we'll then get back to you as soon as possible. Contact Press Office Find our locations Office locations Office locations Select region: Africa Americas Asia Europe Middle East Austria Belgium Brazil China Columbia Cyprus Czech Rep Denmark Finland France Germany Greece Hong Kong Iceland Ireland Italy Luxembourg Malta Mexico Norway Peru Portugal Singapore South Africa Spain Sweden Switzerland Turkey UAE UK US South Africa - Capetown Address Unit 108 The Gatehouse 1 Century City 7441 - Capetown Brazil - Sao Paulo Address Alameda Rio Negro, 1477 Barueri 06454-040 - Sao Paulo Columbia - Bogota Address Carreira 9 123 - 86 oficina 604 11011 - Bogota Mexico - Mexico City Address Paseo de la Reforma, 296 6500 - Mexico City Peru - Lima Address Angamos Oeste 651 oficina 804 Miraflores 15074 - Lima US - Atlanta Address 100 Colony Square 1175 Peachtree St. NE GA 30361 - Atlanta US - New York Address 600 Old Country Road Suite 425 Garden City NY 11530 - New York US - Delaware Address 100 West Commons Blvd Suite # 200 & 104 New Castle DE 19720 - Delaware US - Atlanta Address 4625 Alexander Drive Alpharetta GA 30022 - Atlanta China - Shanghai Address 1000 Lujiazui Ring Road Pudong New Area 200120 - Shanghai Hong Kong - Hong Kong Address North Tower World Finance Centre Harbour City Kowloon 200 - Hong Kong Singapore - Singapore Address 176 Orchard Road Singapore The Centrepoint 238843 - Singapore Austria - Vienna Address Millennium Tower Top 393 Handelskai 94-96 1200 - Vienna Belgium - Brussels Address Avenue Louise 523 1050 - Brussels Cyprus - Larnaca Address 44 United Nations Street Orthodox Tower 6042 - Larnaca Czech Rep - Prague Address Pa?sk 127/20 110 00 - Prague Denmark - Copenhagen Address Østergade 26, KLD. (K025) 1100 - Copenhagen Denmark - Copenhagen Address Østergade 24A, 2. sal 1100 - Copenhagen Finland - Lappeenranta Address Harapaisentie 55 53501 - Lappeenranta Finland - Lappeenranta Address IsoKristiinan kauppakeskus Kaivokatu 5 53100 - Lappeenranta Finland - Helsinki Address Mannerheiminaukio 1A 100 - Helsinki Finland - Turku Address Fiskarsinkatu 7d 20750 - Turku France - Strasbourg Address 3 Quai Klber 67000 - Strasbourg France - Paris Address Tour Initiale 1 Terrasse Bellini La Défense 92800 - Paris France - Paris Address 10 Rue du Mont Thabor 75001 - Paris France - Marseille Address 20 Traverse de la Montre 13011 - Marseille France - Pau Address 48 Avenue de l'Yser Bizanos 64320 - Pau Germany - Munich Address Sapporobogen 6-8 D-80637 - Munich Germany - Dortmund Address Europaplatz 8/9 44269 - Dortmund Germany - Cologne Address Max-Planck-Str. 42 50858 - Cologne Greece - Athens Address 246 Mesogeion Holargos 155 61 - Athens Iceland - Reykjavik Address Psthsstrti 3 101 - Reykjavik Ireland - Kilkenny Address Unit 5, IDA Business Park Purcellsinch R95 WKK6 - Kilkenny Ireland - Galway Address Martin House DA Business Park Dangan H91 AO6C - Galway Italy - Rome Address Via Gregoriana n. 59 187 - Rome Italy - Milan Address Via Manzoni 23 20121 - Milan Luxembourg - Luxembourg Address 5-7 Rue Léon Laval Leudelange L-3372 - Luxembourg Malta - Valletta Address 293 Republic St VLT 1110 - Valletta Norway - Oslo Address Fredrik Selmers vei 2 663 - Oslo Norway - Kleppesto Address Storebotn Naeringspark 57A 5309 - Kleppesto Portugal - Lisbon Address Praa de Alvalade N 6, 4 Frente Alvalade 1700-036 - Lisbon Portugal - Lisbon Address Rua Duque de Palmela, n 2 - 4 E No. 2, 4th Floor Left Santo Antnio 1250-098 - Lisbon Spain - Madrid Address Don Ramon de la Cruz 84 28006 - Madrid Spain - Barcelona Address Paseo de Gracia, 74, 3 2 A 8008 - Barcelona Switzerland - Zurich Address Kreuzbhlstrasse 26 8008 - Zurich Switzerland - Zurich Address Mhlebachstrassse 19 8008 - Zurich Switzerland - Vernier Address Chemin Grenet 21 1214 - Vernier Turkey - Istanbul Address Harman Sokak Harmanci Giz Plaza No: 5 Levent 34394 - Istanbul UK - Edinburgh Address Commercial Quay 84 Commercial St EH6 6LX - Edinburgh UK - London Address Ilona Rose House Manette Street W1D 4AL - London UAE - Dubai Address Emaar Square Building 5 49311 - Dubai Sweden - Stockholm Address Röntgenvägen 3D Solna 171 54 - Stockholm Looking for a new role or opportunity? We have a number of open positions, visit our careers section now. Careers English English Español Français Italiano Deutsch Payments Online In-person Token Vault Dynamic Currency Conversion Software Property Management System Booking Engine Order Management System Solutions Retail Hospitality Travel Tax Free Issuing Track my refund Resources Blogs Customer stories Customer resources Partners Reports & guides Company About Newsroom Careers Support Contact us Disclosure program Legal | Choose your preferred language! We have detected your location, and we would like to enhance your browsing experience. Select your preferred language. Cambiar a Español Passer en Français Passa all'italiano Auf Deutsch wechseln Stay in English"
    },
    {
      "url": "https://www.yushengteo.com/coding/ms-branding/about.html",
      "text": "About Mothership News Videos Offbeat Perspectives Lifestyle International + More About Search Search ← Back Perspectives Lifestyle International Community History (1819) Almost Famous / Six Minutes MPs in the House Can or Not Polls About News Videos Offbeat Perspectives Lifestyle International + More About Search ← Back Community History (1819) Almost Famous / Six Minutes MPs in the House Can or Not Polls Go About Mothership Mothership is a Singaporean community content aggregator for the digital age. We connect with our audiences by creating high quality multimedia stories and entertainment content that encourages social sharing. Mothership helps brands and businesses speak with digital audiences through our content marketing, community marketing and social advertising services. Mothership is the fastest growing digital platform in Singapore in 2015. It currently attracts a viewership of 3,800,000 each month. Advertise with us Thanks for visiting Mothership! If youâve a project or an advertising campaign and want to reach out to Singaporean readers, weâd love to explore ways in which we can help you. Advertorial article we did for a client Video content we did for a client Here are just some of the ways weâve helped businesses reach our fast-growing audience: Advertorial articles (like this one , this one , and this one ) Sponsored video content (such as this video and also this video ) Pinned advertorial content on our Facebook page Pinned advertorial content on our Home page Pinned advertorial contnet on our various category pages (such as our News page and Offbeat page ) And many more (secret) creative solutions Drop us a line at sales@mothership.sg and letâs talk! Contact us Have something youâll like to tell us? You can reach us at info@mothership.sg . Want to stalk us instead? You can follow us on Facebook and Twitter . Join us To join us as a freelance writer and photographer, please send us your resume at info@mothership.sg . If you are keen to contribute articles to Mothership.sg, you can also contact us at the same email (info@mothership.sg). Contributors â Team Mothership Martino Tan Managing editor Martinoâs parents named him after an Italian priest, Vaticanâs 1st ambassador to Sâpore. Heâs inspired by the lives of Robert Kennedy & D. Bonhoeffer, the words of G.Orwell & T.Sorensen, & the music of the Beatles. Chan Cheow Pong Managing editor It took Cheow Pong two decades to recover from the trauma of memorising General Paper essays before he was ready to be an English writer. In between affliction and recovery, he thoroughly enjoyed his time writing in Chinese and doing Chinese translations. He is a recovering mobile phone addict. Lien We King Towkay We Kingâs dream job is to be a supermarket assistant at the frozen food section. He also wishes to be an animal keeper in the elephantâs enclosure at any wildlife reserve that would hire him. He aspires to travel to the Galapagos Islands before he grows old. Belmont Lay Editor Belmont wrote about friskiness in his Yahoo! News column, mishandles the 3rd most overrated website in Singapore and can pronounce âtchotchkeâ. Donât follow him. Heâs not Jesus. Jonathan Lim Editor Jon is usually at home watching random videos YouTube recommends him. He hopes to strike Toto so he can live off rental income and watch more YouTube videos. Tan Xing Qi Writer In between episodes of Breaking Bad and The Sopranos, Xing Qi deals T-Shirts to unsuspecting Singaporeans through a roadside stall, which, ironically, is not a physical stall. Daniel Ho Writer Daniel Ho is in the business of bringing people together to pursue the unimaginable. He dreams of one day living on a farm, surrounded only by limitless plains and free-roaming livestock. For now, he can only wonder what freak of nature caused him to land up here at the Mothership. He Ruiming Writer Ruiming is a freelance writer that has lived in Singapore, Melbourne and Hongkong. When heâs not being snarky on Mothership or waddling waist-deep in deadlines, he finds time for lifeâs simple pleasures: Teh-O Peng, Lao Gan Ma chilli oil and HBOâs award-winning TV series Game Of Thrones. Henedick Chng Writer Henedick loves food. He is always hungry. In between his eating binges, he cooks and is just another food blogger who anyhow shares his recipes and dining adventures with the world. Gerald Chan Writer Caught between the love of LEGO, video and board games, Gerald plots to make every video viral daily but to no avail. Jeanette Tan Writer Apart from being a professional busybody, Jeanette takes pride in her ability to sing the complete lyrics to Hakuna Matata and a host of other Disney songs. She still holds out hope to someday be talent-spotted to do voice-overs for documentaries, lifts and automated telephone answering systems. Martino Tan Managing editor Martinoâs parents named him after an Italian priest, Vaticanâs 1st ambassador to Sâpore. Heâs inspired by the lives of Robert Kennedy & D. Bonhoeffer, the words of G.Orwell & T.Sorensen, & the music of the Beatles. Chan Cheow Pong Managing editor It took Cheow Pong two decades to recover from the trauma of memorising General Paper essays before he was ready to be an English writer. In between affliction and recovery, he thoroughly enjoyed his time writing in Chinese and doing Chinese translations. He is a recovering mobile phone addict. Lien We King Towkay We Kingâs dream job is to be a supermarket assistant at the frozen food section. He also wishes to be an animal keeper in the elephantâs enclosure at any wildlife reserve that would hire him. He aspires to travel to the Galapagos Islands before he grows old. Belmont Lay Editor Belmont wrote about friskiness in his Yahoo! News column, mishandles the 3rd most overrated website in Singapore and can pronounce âtchotchkeâ. Donât follow him. Heâs not Jesus. Jonathan Lim Editor Jon is usually at home watching random videos YouTube recommends him. He hopes to strike Toto so he can live off rental income and watch more YouTube videos. Tan Xing Qi Writer In between episodes of Breaking Bad and The Sopranos, Xing Qi deals T-Shirts to unsuspecting Singaporeans through a roadside stall, which, ironically, is not a physical stall. Daniel Ho Writer Daniel Ho is in the business of bringing people together to pursue the unimaginable. He dreams of one day living on a farm, surrounded only by limitless plains and free-roaming livestock. For now, he can only wonder what freak of nature caused him to land up here at the Mothership. He Ruiming Writer Ruiming is a freelance writer that has lived in Singapore, Melbourne and Hongkong. When heâs not being snarky on Mothership or waddling waist-deep in deadlines, he finds time for lifeâs simple pleasures: Teh-O Peng, Lao Gan Ma chilli oil and HBOâs award-winning TV series Game Of Thrones. Henedick Chng Writer Henedick loves food. He is always hungry. In between his eating binges, he cooks and is just another food blogger who anyhow shares his recipes and dining adventures with the world. Gerald Chan Writer Caught between the love of LEGO, video and board games, Gerald plots to make every video viral daily but to no avail. Jeanette Tan Writer Apart from being a professional busybody, Jeanette takes pride in her ability to sing the complete lyrics to Hakuna Matata and a host of other Disney songs. She still holds out hope to someday be talent-spotted to do voice-overs for documentaries, lifts and automated telephone answering systems. Advertise with us | Contact us | Privacy policy Copyright Â© 2016 Mothership. All rights reserved. Web design by Yu Sheng and Yu Siang ."
    },
    {
      "url": "https://emeraldcoastbeerfest.com/r/brewery/315/niceville-fl/3rd-planet-brewing",
      "text": "3rd Planet Brewing Registered for the 2024 Emerald Coast Beer Festival Online Tickets are Now Available. Buy Now! Sept. 5th, 2025 Pensacola, FL Buy Tickets Sept. 5th, 2025 Pensacola, FL Sept. 5th, 2025 Pensacola, FL Tickets Confirmed Brewers At The Festival Beer Tasting Beer List Beer Pairing Dinner Live Music Food Vendors Fest App & Program Vendors Fest Info FAQ Contact Organizers About The Venue Fest History Facebook Event Brewers Only Buy Tickets Fest App Brewery Registration Info Home At The Fest Confirmed Brewers Brewer Registration 2024 Emerald Coast Beer Fest Registration 3rd Planet Brewing Brewery                        in Niceville, FL Website, Social Links, and Location Brewery Address 1400 E John Sims Pkwy Niceville, FL 32578 Beers Registered (3) Mullet Lite American Light Lager Standard American Beer Package Highly carbonated, very light-bodied, nearly flavorless lager designed to be consumed very cold. Very refreshing and thirst quenching. ABV:  2.8% to 4.2% IBU:  8 to 12 Dank Side of the Moon Hazy IPA American IPA IPA Package A decidedly hoppy and bitter, moderately strong American pale ale, showcasing modern American or New World hop varieties. The balance is hop-forward, with a clean fermentation profile, dryish finish, and clean, supporting malt allowing a creative range of hop character to shine through. ABV:  5.5% to 7.5% IBU:  40 to 70 Drunkin' Pumpkin Fruit and Spice Beer Fruit Beer Package A harmonious marriage of fruit, spice, and beer, but still recognizable as a beer. The fruit and spice character should each be evident but in balance with the beer, not so forward as to suggest an artificial product. Back to Confirmed Brewers Be Social Please Take a Moment and SHARE this Event with Family and Friends Follow us on Facebook to receive the most current information about the festival! Join Our Facebook Facebook Event Organized by Join Our Club Portion of the Proceeds Benefit #ECBeerFest Event hosted at Seville Quarter Seville Quarter 130 E Government St Pensacola, FL 32502 info@emeraldcoastbeerfestival.com Tickets: (850) 384-6415 © 2025 Emerald Coast Beer Festival | Privacy Policy"
    },
    {
      "url": "https://www.3rdplanetlife.com/contact",
      "text": "Contact — 3rd Planet Store Skip to Content Open Menu Close Menu Shop About Learn Contact Login Account 0 0 Sign up Shop About Learn Contact Login Account 0 0 Sign up Open Menu Close Menu Shop About Learn Contact Login Account Sign up Get in touch. Our customer service team is available via email from 9am-3pm PST M-F. Have a question, feedback, or just want to say hello? We'd love to hear from you. Please fill out the form below or email us at hello@3rdplanetlife.com Address: Walnut Creek, CA Toll Free Phone: (800) 662-9134 Name * First Name Last Name Email * Subject * Message * Thank you! Sign up to receive news and updates. Email Address Sign Up Thank you! Sign up & be the first to know about exclusive deals, product launches, wellness content, and more. Email Address Sign Up Thank you! *These statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure, or prevent any disease. Quick Links Shop Learn About Help Contact FAQ Rewards"
    },
    {
      "url": "https://escambiabayhomebrewers.org/brewery/niceville-fl/3rd-planet-brewing-the-mothership/20",
      "text": "3rd Planet Brewing - The Mothership - Niceville FL Brewery Brew it, Drink it! Join EBHB Menu Calendar Event Calendar Style of the Month Past Events Board Meeting Minutes Info Event Signup FAQ Pensacola Breweries Pensacola Craft Beers News Newsletters About Our Mission Photo Gallery Winos Emerald Coast Beerfest Club Officers Bylaws Brewing Resources Brewer Marketplace Homebrew Supply Shops Beer Style Guidelines Resourceful Links Home > Breweries > Micro Brewery in Niceville, FL 3rd Planet Brewing - The Mothership Rating - 4.8 out of 5 stars Review Count from Google Places: 222 Micro Brewery 1400 E John Sims Pkwy, Niceville, FL 32578, USA http://3rdplanetbrewing.com/ (850) 424-4257 Beer List List is sorted by most popular at location. First beers are most likely their regular beers while the end of \n\t\t\t\t\t\tthe list are most likely their sesonal beers. Beers updated every month. Dank Side of the Moon IPA - New England / Hazy 7.5% ABV ▪ N/A IBU Straw colored slightly cloudy IPA with great taste smoothness without over hopped bitterness. Bluewater Hefeweizen Wheat Beer - Hefeweizen 5.7% ABV ▪ N/A IBU Brewed with local honey Boggy Bayou Stout Stout - Milk / Sweet 5.5% ABV ▪ N/A IBU Luminous Cloud Pale Ale - New England / Hazy 5.2% ABV ▪ 30 IBU Hazy Pale Ale with 20% oats in the grain bill and dry-hopped with Centennial, Comet, and Amarillo. Bear Creek Bramber Brown Ale - American 5.7% ABV ▪ N/A IBU Amber beer brewed in the English brown style. West Coast Hipster IPA - American 7.3% ABV ▪ N/A IBU West Coast IPA heavily dry-hopped with Simcoe, Centennial, and Columbus hops. Drunkin’ Pumpkin Pumpkin / Yam Beer 5.5% ABV ▪ 17 IBU Over 10 pounds of pumpkin used per barrel give this beer a rich color and mouthfeel. Combined w/ the perfect amount of spice, this ale has a clean finish that isn't too sweet. Panhandle Pale Ale Pale Ale - American 5.9% ABV ▪ N/A IBU Pale Beach Bohemian Pilsner - Czech / Bohemian 5.2% ABV ▪ 34 IBU Post'l Point Porter Porter - English 8.1% ABV ▪ N/A IBU Cosmic Origins Stout - Imperial / Double 11% ABV ▪ 50 IBU Barrel-Aged Imperial Stout with Cinnamon & Madagascar Vanilla. Crow Cream Ale Cream Ale 5.6% ABV ▪ N/A IBU Emulator Bock - Doppelbock 8.6% ABV ▪ N/A IBU Doppelbock style beer Choctaw-hoppee IPA IPA - American 7.1% ABV ▪ N/A IBU Rising Sands Lager - Japanese Rice 4.3% ABV ▪ 20 IBU International Pale Lager with 70% Barke Pilsner Malt and 30% Brown Rice Flakes. A large whirlpool addition of Saaz hops provides subtle floral, grass, and spice notes. Paddy’s Pint Stout - Irish Dry 5.3% ABV ▪ 24 IBU Classic Dry Irish Stout with Fawcett Pearl Malt, Flaked and Roasted Barley. Hopped with East Kent Goldings and Fuggles. Mullet Lite Lager - American Light 4.6% ABV ▪ N/A IBU Bear Creek Brown Brown Ale - Other 5.7% ABV ▪ N/A IBU Red Eye Gravy Brown Ale - American 5.8% ABV ▪ N/A IBU Smooth brown ale mixed with cold brew coffee. Hazy and delicious! Mother of Hubble Lager - IPL (India Pale Lager) 7.4% ABV ▪ 50 IBU Brewed in celebration of International Women’s Day 2020, the women of Odd Colony and Idyll Hounds joined our ladies to brew this IPL hopped exclusively with YCH’s 2019 Pink Boots Blend. Wave of Lupulation IPA - American 6.7% ABV ▪ N/A IBU A double dry hopped American IPA with fresh local peaches added. The peach, citrus, and tropical notes of the fruit and hops are rounded out by copious amounts of lactose and vanilla. Citra Blonde Ale Blonde / Golden Ale - Other N/A ABV ▪ N/A IBU Turkey Creek Trippel Belgian Tripel N/A ABV ▪ N/A IBU Prostbräu Märzen 6% ABV ▪ 30 IBU Fruit Sequence: Tiki Party Sour - Fruited 5.1% ABV ▪ 15 IBU Painkiller Tiki Cocktail-inspired golden sour with Pineapple, Coconut, Orange, Vanilla, Dark Brown Sugar, and Nutmeg. 3rd Planet Brewing is Niceville, FL’s first craft brewery that created a vibrant atmosphere in the community.  3rd Planet Brewing opened the “Launchpad” in April 2016 brewing 8 quality in-house taproom craft beers on a 2-barrel Ruby Street system.  The goal was to serve great tasting craft beer in a cool taproom that the community supported.  3rd Planet Brewing focused on in-house sales, quality beer in a comfortable environment, and exceptional customer service. The two original owners and founders Tim McCool and Jason Doster are military veterans and engineers.  They decided that producing a quality product in a cool environment would result in natural growth leading to distribution.  Another key decision was to utilize food trucks and create a “food-friendly” environment allowing the customers to bring in food too.  At the time Niceville did not have an ordinance allowing food trucks, so the owners worked hand-in-hand with the city to establish a food truck ordinance prior to opening their 2nd location. Show Map Amenities Food Available Show Reviews (5) Reviews Reviews are from the Google's Places community and NOT from EBHB club members. Claire Smith I feel like this is Niceville's Proof equivalent. That being said, it's a very cool space but very crowded. Beer in our flights were good; the milk stout especially tasty. Didn't get a lot of normal pics because they were doing a charity beard contest that my husband got reeled into, even though he just shaved! That event made our visit a little chaotic. Would like to go back during the week when we can enjoy the general atmosphere a bit more. Rated 4 out of 5 Benjamin LaFrancois The absolute best brewery in Florida. These guys know what they are doing when it comes to beer. My favorite beer is the Dank Side of the Moon. Choose your favorite, but whatever you choose, you can't go wrong. Not only is the beer good but the atmosphere is great! When it's not raining (like it does every day in FL) the outdoor set up is an outstanding setup for your kids, or cornhole. Music bingo on Thursday, and live bands almost every Friday and Saturday. Make yourself a regular at this brewery and you won't regret it. Rated 5 out of 5 D Gresham Enjoyed the food truck and really enjoyed the beer. Great selection, which changes infrequently, and the staff is always friendly. The music was great; although, a bit loud to hold a conversation with friends. I'll definitely be going back again and again. Rated 5 out of 5 Mandy McCollough Such a fun place and very family friendly! I enjoyed the beers I tried and love that they bring different food trucks in to choose from. We went while there was live music too, which was awesome! They have a big open area outside for kids to run around which made going out with a toddler much more enjoyable. We will definitely be going back! Rated 5 out of 5 Danielle Alexander Great space! Lots of three season outdoor seating with heaters, lawn games and more. Family and dog friendly for an afternoon of relaxing with a cold beer and bite to eat. Rated 5 out of 5 Photos View Photos Share this Page Hours Monday: 3:00 – 9:00 PM Tuesday: 3:00 – 9:00 PM Wednesday: 3:00 – 9:00 PM Thursday: 12:00 – 10:00 PM Friday: 12:00 – 10:00 PM Saturday: 11:00 AM – 10:00 PM Sunday: 12:00 – 6:00 PM Emerald Coast Beer Festival is the longest running beer festival in Pensacola, FL! \n\t\t\tWe have over 50 brewers and over 200 beers to sample. See Our Fest Back to Breweries Close Interested in joining the club? Learn to Homebrew. It's Legal! Join EBHB Check our Facebook Page Subscribe and network with other members! Join Facebook Love Craft Beer? Sign up with your email and name to receive news, upcoming events, and updates. Sign Up Quick Links Join Club Our Mission Calendar FAQ Club Photos Brewer Marketplace Winos Club Pensacola Breweries Home Brew Supply Shops Emerald Coast Beer Fest Email us at info@ebhb.org Membership Information: +1-850-384-6415 Brew it, Drink it! By using our website, you agree to our Privacy Policy and our cookies usage. ©2025 Copyright:\n\t\t\tEscambia Bay Homebrewers"
    }
  ]
}