{
  "fuentes": [
    {
      "url": "https://guidetoflorida.com/bradenton/food-drink/88-live-piano-bar-and-more",
      "email": "directory@guidetoflorida.com"
    },
    {
      "url": "https://guidetoflorida.com/bradenton/food-drink/88-live-piano-bar-and-more",
      "email": "name@yoursite.com"
    },
    {
      "url": "https://www.88club.boston/contact",
      "email": "info@88club.boston"
    },
    {
      "url": "https://burtonandwilsonpiano.com/contact-us/",
      "email": "burtonandwilson@icloud.com"
    },
    {
      "url": "https://www.suncoastpost.com/srq-scoop/88-live-piano-bar-in-bradenton-is-celebrating-their-one-year-anniversary/",
      "email": "info@suncoastpost.com"
    },
    {
      "url": "https://www.suncoastpost.com/srq-scoop/the-suncoast-post-interview-with-sherry-elliott-owner-of-88-live-piano-bar-in-bradenton-florida/",
      "email": "info@suncoastpost.com"
    }
  ],
  "mails": [
    "burtonandwilson@icloud.com",
    "directory@guidetoflorida.com",
    "info@88club.boston",
    "info@suncoastpost.com",
    "name@yoursite.com"
  ],
  "nombre_sitio": "88livebradenton.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://guidetoflorida.com/bradenton/food-drink/88-live-piano-bar-and-more",
      "text": "88 Live Piano Bar and more! - Guide to Florida www.guidetoflorida.com - Guide to Florida Search Home Best of Florida Best of Florida Results 2025 Best of Florida Results 2024 Best of Florida Results 2023 Best of Florida Results Best of Florida Print Annual 2024 Best of Florida Print Annual 2023 Best of Florida Print Annual Nominate a Business Vote for Your Faves How It Works Campaign Kit Stories Directory Browse Categories Browse Regions Big Bend Coastal Region Bradenton & Sarasota Region Central Panhandle Region Destin & Fort Walton Beach Region Florida Keys Region Greater Fort Lauderdale Region Greater Gainesville Region Greater Miami & Miami Beach Region Greater Orlando Region Heartland Region Jacksonville Metro & Beaches Region Lakeland & Polk County Region Nature Coast Region North Central Countryside Region Ocala, Lake & Sumter Region Palm Beach County Region Panama City & Panama City Beach Region Pensacola & Western Panhandle Region Port St. Lucie & Treasure Coast Region Southwest Florida Coast Region Space Coast Region St. Augustine Historic Coast Region St. Petersburg & Clearwater Peninsula Region Suwannee River Region Tallahassee Region List Your Business About Us Advertise Contact Us Member Login Menu Home Best of Florida Best of Florida Results 2025 Best of Florida Results 2024 Best of Florida Results 2023 Best of Florida Results Best of Florida Print Annual 2024 Best of Florida Print Annual 2023 Best of Florida Print Annual Nominate a Business Vote for Your Faves How It Works Campaign Kit Stories Directory Browse Categories Browse Regions Big Bend Coastal Region Bradenton & Sarasota Region Central Panhandle Region Destin & Fort Walton Beach Region Florida Keys Region Greater Fort Lauderdale Region Greater Gainesville Region Greater Miami & Miami Beach Region Greater Orlando Region Heartland Region Jacksonville Metro & Beaches Region Lakeland & Polk County Region Nature Coast Region North Central Countryside Region Ocala, Lake & Sumter Region Palm Beach County Region Panama City & Panama City Beach Region Pensacola & Western Panhandle Region Port St. Lucie & Treasure Coast Region Southwest Florida Coast Region Space Coast Region St. Augustine Historic Coast Region St. Petersburg & Clearwater Peninsula Region Suwannee River Region Tallahassee Region List Your Business About Us Advertise Contact Us Member Login Home United States Bradenton Food & Drink 88 Live Piano Bar and more! 88 Live Piano Bar and more! Share Italian Restaurants 6640 Cortez Rd W Suite A, Bradenton, Florida, 34210 Send Message 941-900-1133 Vote for Us! | Italian Restaurants Best of Florida Vote Confirmation × Don't show this confirmation for the next 24 hours First Name Last Name Email Address Save my information and enable one-click voting for future votes on this device. I want to receive the Guide to Florida newsletter. Please complete the reCAPTCHA challenge below. Cancel Submit Your Vote! You are voting with the email Click here to switch users. Close Overview Get Directions View On Larger Map Company Name 88 Live Piano Bar and more! Visit Website https://www.88livebradenton.com Online Social Profiles Phone Number 941-900-1133 Location 6640 Cortez Rd W Suite A Bradenton , Florida , 34210 United States About 88 Live Piano Bar and more! We are a family owned live music venue that serves delicious baked only food.  We have the big city vibe with the small hometown love. No party is too big for us.  It’s the place to be to make lasting memories! × Map View Get Directions Cancel FEATURED LISTINGS! Coconut Jack's Waterfront Grille Bonita Springs, FL 34134 Website 2396767777 Tarrazu Coffee Co. Coconut Creek,  33063 Website 954-890-0610 FINS Seafood & Dive Bar Cape Coral,  33904 Website 239-984-5449 READ AND REAP! Restoring Homes, Rebuilding Trust Your Mess Doesn’t Stand a Chance! Therapy That Feels Human, Not Scripted MORE TO EXPLORE! Best of Florida Voting Best Italian Restaurants in Florida Guide to Alabama Georgia Business Journal Guide to Florida Get the Newsletter! Click to Subscribe Guide to Florida Subscribe Submit Story Idea Contact Us 904-515-5640 Directory List Your Company Advertise Your Company Member Login Browse Categories Best of Florida Vote For Your Favorites Download Campaign Kit Nominate a Business How it Works × Member Login * Email Address * Password Need to retrieve your password? Click Here × Get the Newsletter! The security check was not completed successfully."
    },
    {
      "url": "https://www.88club.boston/contact",
      "text": "Contact | The 88 Club top of page Home Menu Book a Party Contact More Use tab to navigate through the menu items. Reservations Let's Chat Live Music every Thursday - Sunday! Reservations accepted but not required! Private Parties and Group Events available upon request. Follow the sounds underground, and look for the blue neon lights to find nostalgic cocktails, crafted bites, and rowdy nights. Located below Kings Back Bay Enter on Dalton St. or through Kings on Scotia St.​ The 88 Club is 21+. First name * Last name * Email * Phone How can we help? * Submit Home Menu Contact Hours Thrs, Fri & Sat: 7pm-1am Sunday: 6pm - 11pm 50 Dalton St | Boston MA 02210 Enter on Dalton St. or through Kings on Scotia St. Contact Stay Connected info@88club.boston 617.545.9727 The 88 Club is 21+. © 2025 The 88 Club/Kings Dining & Entertainment bottom of page"
    },
    {
      "url": "https://burtonandwilsonpiano.com/contact-us/",
      "text": "Contact Burton & Wilson - The Piano Craftsmen | Get in Touch Today Servicing the Greater San Francisco & Monterey Bay Areas since 1951 Home Our Services Piano Moving Piano Restoration Piano Storage Piano Tuning Contact Us Home Our Services Piano Moving Piano Restoration Piano Storage Piano Tuning Contact Us Contact Us CONTACT TO CONNECT WITH US burtonandwilson@icloud.com 831.227.1099 Please Fill Out the Form Name Email Phone Number Message Send Our Services Piano Moving Piano Restoration Piano Storage Piano Tuning Blog Contact Us 831.227.1099 burtonandwilson@icloud.com © 2025 Burton & Wilson | All Rights Reserved Powered by Byte-io"
    },
    {
      "url": "https://www.suncoastpost.com/srq-scoop/88-live-piano-bar-in-bradenton-is-celebrating-their-one-year-anniversary/",
      "text": "88 Live Piano Bar in Bradenton is Celebrating Their One-Year Anniversary - The Suncoast Post Skip to main content Blog Events Art Dining Business Charities Music SRQ Scoop Great Reading What's On? Op-Ed Home Staff Advertise Advertisers Contact Blog Events Art Dining Business Charities Music SRQ Scoop Great Reading What's On? Op-Ed You are viewing: The Suncoast Post > SRQ Scoop > 88 Live Piano Bar in Bradenton is Celebrating Their One-Year Anniversary Search 88 Live Piano Bar in Bradenton is Celebrating Their One-Year Anniversary May 12, 2022 | Vicky Sullivan | SRQ Scoop 88 Live is celebrating its one-year anniversary this week! Rising out of a shaky beginning at the start of the pandemic, they have become a popular music venue.  I talked to partners Sherry Elliott and Matt Coates about their year and what’s coming up in the near future for 88 Live. SP: Matt, when did you first open 88 Live? Matt: We opened six weeks before Covid hit, and then we opened and closed twice, and then last year the lovely Sherry came in and helped a lot. SP: Was it the idea to be a piano bar from the beginning? Matt: More of the dueling pianos, but we also had mostly piano players when I was able to open and when Sherry came in, we kind of went a little more progressive and had bands during the week and dueling pianos on the weekend. SP: Tell me about the piano players. Where did you find them? Are they local, or what’s that story? Matt: Two years ago, 2 1/2 years ago, when I first started, I made phone calls. I’ve been down here for 15 years, and I knew a lot of players. I’m a piano player myself, and I knew a lot of the really good players in our area.  I started off with them, through the channels of other piano players, some dueling pianos, and that’s how I met our chief player, his name is Gavin. Gavin and Emily. And they’re called The Unnessentials. I booked them early in the COVID years, and they did great. And then, you know, just through my years of being down here and knowing a lot of the players, I kind of contacted them, and that started it off. SP: Do you have other piano players that come in also? Matt: Yeah, but The Unnessential’s are our main dueling pianos, and after that, it’s miscellaneous musicians and dueling piano players from, I’d say, Tampa, Orlando, just too kind of name a few of the cities. SP: I take it you have a kitchen because I saw that you have a food menu. Matt: Yeah, sure. Sherry can tell you more about the kitchen. We love our kitchen. Sherry: OK, everything we have is baked because we have a pizza oven, so we do everything in the oven. Sandwiches, Wings, Chicken. People like the square thin crust pizza. And everybody raves about our wings. We have all kinds of stuff on our menu. We have funny things like the Dueling Meatball Nest and the Sinatra Italian Sub. You know everything is set for pianos and stuff. SP: How is the business grown over the past year? Sherry: We started with 500 likes on our Facebook page, and now we’re over 5000.  Yeah, it’s grown with the locals. I do advertising & marketing, and it’s just we do everything local through the Islander and on Facebook, Instagram, and word of mouth. It’s just grown, right, Matt. Matt: Yes, yes, yes, I say because of you. And I’m gonna tell you that again! SP: So now you have this big celebration on Sunday, May 15th, for the one-year anniversary. What time is that starting? What do you have going on? Sherry: It starts at 2:00 o’clock. I have our house band Tropix that will lead it off, and then we have Billy Rice coming in. 301 Travelers, and then we end it with N22.  Everybody is playing for an hour, and then 22N takes it for the last three hours. It runs from 2 to 8.  It’s all bands for this, no pianos. SP: What are your regular hours? Sherry: We are closed on Mondays and open Tuesday through Sunday. We’re open from noon until 10:00 o’clock at night. Friday and Saturday – Noon till midnight. Sunday 12 to 10. SP: You’re open for lunch! What time does music generally start? Sherry: Yes, we are open for lunch. During the week they start at 7, and the dueling pianos start at 8 on the weekends and then on Sunday music starts at 5. SP: I see you have events like the Kentucky Derby! Sherry: Oh yes, that was a huge hit.  We have the guys come over from Tampa and do a male revue show on some Sundays.  We also have Drag Queen Bingo. It’s on a Sunday. We do it at 2 o’clock in the afternoon. It lasts about maybe two hours. And then actually, on June 12th, right after that, we have the male revue show at 5:00 o’clock, so we have a doubleheader that day, June 12 th ! SP: Where are you at this point? You’re celebrating a year, and do you have plans to do other things in the near future? Matt: Well, I think it isn’t broke right now.  I don’t think it needs a whole lot of fixing. I think that we maybe will experiment with different types of music. Actually, right now, we have a pretty good lineup. Sherry: We are booked out all the way till September. People come when they hear about it when they come to town. It’s just one of those places that people just like to come and celebrate. We have two VIP sections, and they rent them out for parties. Different things, birthdays, and anywhere from 21 years to 91 years. It’s like you stepped into an old club back in the day in New York, Boston, and Chicago. You know, a different vibe. We love the vibe. The vibe at 88 Live. SP: Thanks so much for your time.  Congratulations on your success! Sherry & Matt: Thank you so much! 88 Live Bradenton 6640 Cortez Road West Bradenton, FL 34210 941 900-1133 WEBSITE Photos from 88Live Website Previous Next Florida's Gulf Coast source for local area business news, restaurant highlights and events. Email Subscribe Contact Us 941-347-4500 info@suncoastpost.com Recent Stories Swamp Soul in Sarasota: Colleen Orender Brings Blues & Jazz Vibes to Fogartyville on Sept. 12 A Visit to the 9/11 Memorial: What It Meant to Us Celebrate “Halfway to St. Paddy’s Day” at Clancy’s Irish Sports Pub in Bradenton Top Florida Flight Deals from Atlantic City + Why AC Is Your Next East Coast Getaway” © 2025 Suncoast Post | Web Design by Sande Caplin & Associates | Sitemap | Privacy Policy | Accessibility Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset"
    },
    {
      "url": "https://www.suncoastpost.com/srq-scoop/the-suncoast-post-interview-with-sherry-elliott-owner-of-88-live-piano-bar-in-bradenton-florida/",
      "text": "The Suncoast Post Interview with Sherry Elliott, Owner of 88 Live Piano Bar in Bradenton, Florida - The Suncoast Post Skip to main content Blog Events Art Dining Business Charities Music SRQ Scoop Great Reading What's On? Op-Ed Home Staff Advertise Advertisers Contact Blog Events Art Dining Business Charities Music SRQ Scoop Great Reading What's On? Op-Ed You are viewing: The Suncoast Post > SRQ Scoop > The Suncoast Post Interview with Sherry Elliott, Owner of 88 Live Piano Bar in Bradenton, Florida Search The Suncoast Post Interview with Sherry Elliott, Owner of 88 Live Piano Bar in Bradenton, Florida August 10, 2023 | Sande Caplin | SRQ Scoop Recently, I had the opportunity to sit down with Sherry Elliott, who is the owner of 88 Live Piano Bar in Bradenton, Florida.  She is like the “Energizer Bunny!”  She just keeps going and going and going.  I hope you enjoy this interview. Before purchasing 88 Live Piano Bar, what was your professional background or career? For many years I worked in the marketing department in casinos.  Atlantic City, Gulfport, MS and Tunica, MS.  After I left the marketing career I moved on to restaurants. I started from the ground up and ended up being an assistant to the General Manager . Could you tell us about your journey that led you to become the owner of 88 Live Piano Bar? My good friend Roger Bluhm was working at 88 Live and introduced me to the previous owner, Matt Coates.  The rest is history. What attracted you to the music and entertainment industry, specifically the piano bar concept? This has been a dream of mine since before I can remember.  The piano is an amazing instrument, it brings people together.  I thought it would be a great asset to Bradenton. How has your previous experience influenced your approach to running 88 Live Piano Bar? Being from a marketing background and restaurant business, it has helped tremendously. I feel like my past careers have definitely made a huge difference and also the team we have.  I Literally couldn’t do it without them. Could you share a bit about your family and how they have supported you in your entrepreneurial ventures? Besides the fact that they all work here haha, they have always been super supportive. I have to thank them for putting up with me not being home much in the beginning, me on my phone a lot, messy home, and I’m sure they have a list as well.  They are amazing.  Couldn’t do this without them. Winning the “Best Music Venue” award in 2022 is a significant accomplishment. What do you believe contributed to this recognition? Our award goes to not only the venue but most importantly our entertainment, who are the best in town, our staff, who love their jobs and are extremely loyal and our customers, who we love and appreciate immensely. What sets 88 Live Piano Bar apart from other music venues in the Bradenton area? What sets us apart from any other music venue is our staff, our décor, and our attention to detail.  Our venue is inside so the heat and rain doesn’t deter anyone and of course our amazing entertainers.  People come to 88 Live to listen to good music, have good food and make memories. Can you describe the process of booking entertainment for 88 Live Piano Bar? How do you select performers We do our due diligence on each band as to what our customer base may prefer, what revenue stream that they may bring, and we travel to see bands and see how they interact with the crowd. Most of the bands that we hire are partners with us, not just hired to play. In addition to music, what food offerings do you provide at 88 Live Piano Bar? Any specialties or unique menu items? Our menu has something for everyone.  We have appetizers, pizzas, sandwiches, meals for two and constantly run specials.  We are known for baking everything, nothing is fried. We also cater to our vegetarians and gluten-free customers. Are there any unique or signature cocktails or liquor offerings that patrons can enjoy at 88 Live Piano Bar? We have the best bourbon and tequila selection around.  We have specialty drinks that are unique to our venue.  We have a frozen daiquiri machine for those hot summer days.  Our selection of liquor, beer and wine is extensive.  We take pride in great tasting drinks. What are your future plans for 88 Live Piano Bar? Do you have any expansions or new offerings in mind? Our future plans are to keep amazing music here in our beautiful venue as long as we can. We have considered expanding and are still entertaining the idea. How do you engage with the local community and support local musicians or artists? We have fundraisers on occasion, we love to give back to our community as much as we can. We help local bands book at other venues and private events. Have you faced any significant challenges while running 88 Live Piano Bar, and how did you overcome them? Knock on wood, no MAJOR challenges. Let’s pray none come our way. What role does customer feedback play in shaping the experience at 88 Live Piano Bar? How do you incorporate customer suggestions or ideas? Our customers play a huge role in shaping 88 Live.  A lot of our entertainment ideas have come from them.  We listen to everything they say/suggest and take that into consideration.  I believe that is how you grow as an establishment. Are there any particular genres of music or types of performers that you prioritize when booking for 88 Live Piano Bar? We try to choose bands that meet our customer criteria.  We have a huge demographic of people here at 88 Live, and there might be a 21st birthday or an 81st birthday.  The weekends tend to be a younger crowd. How do you create a welcoming and enjoyable atmosphere for your patrons at 88 Live Piano Bar? Besides the red carpet we roll out, literally, have you met JOHN SMITH?? HE is AMAZING with our customers. We make everyone feel special and welcome.  We have people that come every day, once a week or for the first time and they always have a great time. Can you share any memorable or unique events that have taken place at 88 Live Piano Bar? We have had fashion shows for a purpose (fundraiser for mental health) we have had many bingo events and family feud events.  We just had a special writers circle event. We are having another fashion show event for our local animal rescue shelters on August 27th.  We have lots of events for local people that want Christmas parties, bachelor parties, bachelorette parties etc.  No party is too big or small.  We love helping people and we love it when people make memories here. Are there any special promotions or themed nights that you regularly offer at 88 Live Piano Bar? $ 5 Build your own Bloody Mary bar that is out of this world. Wine Wednesday $12 bottle of wine, ladies night, $5 margaritas / cosmos, happy hour 3-6pm. Dueling pianos every Friday and Saturday. We also have two VIP areas that people enjoy that seats 9-12 people each.  They can also open up to one large one.  Every night is special. You will definitely go home and remember the fun you had at 88 Live. What advice would you give to aspiring entrepreneurs looking to enter the music and entertainment industry? I would tell them to have patience, don’t give up, be present, get to know your entertainers, customers, and staff, listen to your customers, and always keep an open mind. Is there anything else you would like to share about 88 Live Piano Bar or your experience as the owner? I share this role with my husband, Scott Elliott, our daughters and my work husband, John Smith.  This is not a job that makes you rich with money, but it does make you rich with the amount of love from the customers and the staff.  It makes me so happy to see everyone enjoy our establishment. That is something money can never buy. Sande Caplin – Sherry, thank you so much for doing this interview.  You are truly a blessing to our community. Full Disclosure- Our team at Sande Caplin & Associates developed what we feel is one of our best websites for Sherry, Scott, John and the team at 88 Live Piano bar. Check it out! 88 Live Piano Bar 6640 Cortez Road West, Suite A Bradenton, Florida 34210 941 900-1133 Photos from Sande Caplin & Associates & The Suncoast Post Previous Next Florida's Gulf Coast source for local area business news, restaurant highlights and events. Email Subscribe Contact Us 941-347-4500 info@suncoastpost.com Recent Stories Swamp Soul in Sarasota: Colleen Orender Brings Blues & Jazz Vibes to Fogartyville on Sept. 12 A Visit to the 9/11 Memorial: What It Meant to Us Celebrate “Halfway to St. Paddy’s Day” at Clancy’s Irish Sports Pub in Bradenton Top Florida Flight Deals from Atlantic City + Why AC Is Your Next East Coast Getaway” © 2025 Suncoast Post | Web Design by Sande Caplin & Associates | Sitemap | Privacy Policy | Accessibility Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset"
    }
  ]
}