{
  "fuentes": [
    {
      "url": "https://8streetbrickell.com/private-events/",
      "email": "social@8streetbrickell.com"
    },
    {
      "url": "https://www.miamicondoinvestments.com/brickell-city-centre-reach-condos",
      "email": "info@miamicondoinvestments.com"
    },
    {
      "url": "https://www.brickellbuickgmc.com/contact.htm",
      "email": "brickellbuickgmc@eleadtrack.net"
    },
    {
      "url": "https://8streetbrickell.com/reservations/",
      "email": "social@8streetbrickell.com"
    },
    {
      "url": "https://www.fast-and-wide.com/faw-news/fast-news/16222-8street-brickell-takes-miami-back-to-the-speakeasy",
      "email": "timgoodyer@fast-and-wide.com"
    },
    {
      "url": "https://brickellpsychology.com/contact/",
      "email": "info@brickellpsychology.comcontact"
    },
    {
      "url": "https://www.brickellsicecream.co.uk/pages/about-us",
      "email": "brickell_s_logoplay_v4_ol-01_225x@2x.png"
    }
  ],
  "mails": [
    "brickell_s_logoplay_v4_ol-01_225x@2x.png",
    "brickellbuickgmc@eleadtrack.net",
    "info@brickellpsychology.comcontact",
    "info@miamicondoinvestments.com",
    "social@8streetbrickell.com",
    "timgoodyer@fast-and-wide.com"
  ],
  "nombre_sitio": "8streetbrickell.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://8streetbrickell.com/private-events/",
      "text": "Private Events - 8Street Brickell | 8Street Brickell Skip Nav Home Menu Reservations DJ Schedule Private Events Media And Awards About Us Contact Contact Us 8Street Brickell Thank you for your interest in our company. Complete the form below to send us an email, or simply give us a call. We're looking forward to working with you. Miami, FL 33130 786-207-9401 Please leave this field empty. OK! Thank You! Your message has been sent. Oops, message not sent. Please make sure fields are complete. Private Events We offer a variety of event packages including full and partial venue rental, as well as fully customizable packages. Contact our 8Street Events team directly for additional details and pricing: social@8streetbrickell.com 6ED1BD0F-29A0-41ED-A219-B236124EEA13 Classic Elegance Reimagined 8Street Brickell is an upscale Miami cocktail bar and lounge designed from the ground up with luxe couches, colorful lighting, and a floor-to-ceiling main bar. As a modern speakeasy with food and live DJs, we’ve reimagined the classic elegance of the 1920s by making it more chic. Join Us Today! 8Street Brickell | Cocktail Bar In Miami 8Street Brickell is an Upscale Lounge Bar Located in the Heart of Brickell, Featuring Classic Cocktails, DJ's and Good Vibes. Join Us Today! Contact Information 88 SW 8 Street Miami, FL 33130 Today's Hours: Monday: 6:00pm - 2:00am Tuesday: 6:00pm - 2:00am Wednesday: 6:00pm - 3:00am Thursday: 6:00pm - 3:00am Friday: 6:00pm - 3:00am Saturday: 6:00pm - 3:00am Sunday: 6:00pm - 1:00am Subscribe to Our Newsletter Enter your email below to sign up for our email list for updates, promotions, and more. Please leave this field empty. Get In Touch Please use the following form to send us a message. We can also be reached by phone at 786-207-9401 . We look forward to hearing from you. DRESS CODE AFTER 9PM: NO shorts, flip flops, sports attire, or beach attire. 88 SW 8 Street Miami, FL 33130 786-207-9401 Make A Reservation Please leave this field empty. OK! © 2025 8Street Brickell Website Design by Big Tuna Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset"
    },
    {
      "url": "https://www.miamicondoinvestments.com/brickell-city-centre-reach-condos",
      "text": "Reach Brickell City Centre Condos |  68 SE 6 St Miami FL 33131 hidden Condos For Sale Condos For rent Global Settings hidden LOG IN/Register LOG IN Register Contact Us condos for sale condos for rent neighborhoods luxury condos luxury homes condo market stats preconstruction condos miami condos blog property search condo rankings virtual reality lounge condo associations featured listings about About Us Meet The Team hidden LOG IN Register Global Settings Contact Us Contact Us Call Us At: 305-428-3860 Hablamos Español TEXT US From Android From iPhone MESSAGE US Whatsapp messenger OR EMAIL US \" * \" indicates required fields Choose * BUYING SELLING RENTING Name * Email * Phone * Comments * NEWSLETTER SUBSCRIBE TO NEWSLETTER Name This field is for validation purposes and should be left unchanged. Global Settings language currency Currency Converter Afghan Afghani Albanian Lek Algerian Dinar Angolan Kwanza Argentine Peso Armenian Dram Aruban or Dutch Guilder Australian Dollar Azerbaijan Manat Bahamian Dollar Bahraini Dinar Bangladeshi Taka Barbadian or Bajan Dollar Basotho Loti Belarusian Ruble Belizean Dollar Bermudian Dollar Bhutanese Ngultrum Bitcoin Bolivian Bolíviano Bosnian Convertible Mark Botswana Pula Brazilian Real British Pound Bruneian Dollar Bulgarian Lev Burmese Kyat Burundian Franc CFA Franc CFP Franc Cambodian Riel Canadian Dollar Cape Verdean Escudo Caymanian Dollar Central African CFA Franc BEAC Chilean Peso Chilean Unidad de Fomento Chinese Yuan Renminbi Chinese Yuan Renminbi Offshore Colombian Peso Comorian Franc Congolese Franc Costa Rican Colon Cuban Convertible Peso Cuban Peso Czech Koruna Danish Krone Djiboutian Franc Dominican Peso Dutch Guilder East Caribbean Dollar Egyptian Pound Emirati Dirham Eritrean Nakfa Ethiopian Birr Euro Falkland Island Pound Fijian Dollar Gambian Dalasi Georgian Lari Ghanaian Cedi Gibraltar Pound Gold Ounce Guatemalan Quetzal Guernsey Pound Guinean Franc Guyanese Dollar Haitian Gourde Honduran Lempira Hong Kong Dollar Hungarian Forint IMF Special Drawing Rights Icelandic Krona Indian Rupee Indonesian Rupiah Iranian Rial Iraqi Dinar Isle of Man Pound Israeli Shekel Jamaican Dollar Japanese Yen Jersey Pound Jordanian Dinar Kazakhstani Tenge Kenyan Shilling Kuwaiti Dinar Kyrgyzstani Som Lao Kip Lebanese Pound Liberian Dollar Libyan Dinar Macau Pataca Macedonian Denar Malagasy Ariary Malawian Kwacha Malaysian Ringgit Maldivian Rufiyaa Mauritanian Ouguiya Mauritian Rupee Mexican Peso Moldovan Leu Mongolian Tughrik Moroccan Dirham Mozambican Metical Namibian Dollar Nepalese Rupee New Zealand Dollar Ni-Vanuatu Vatu Nicaraguan Cordoba Nigerian Naira North Korean Won Norwegian Krone Omani Rial Pakistani Rupee Palladium Ounce Panamanian Balboa Papua New Guinean Kina Paraguayan Guarani Peruvian Sol Philippine Peso Platinum Ounce Polish Zloty Qatari Riyal Romanian Leu Russian Ruble Rwandan Franc Saint Helenian Pound Salvadoran Colon Samoan Tala Sao Tomean Dobra Saudi Arabian Riyal Seborgan Luigino Serbian Dinar Seychellois Rupee Sierra Leonean Leone Sierra Leonean Leone Silver Ounce Singapore Dollar Solomon Islander Dollar Somali Shilling South African Rand South Korean Won Sri Lankan Rupee Sudanese Pound Surinamese Dollar Swazi Lilangeni Swedish Krona Swiss Franc Syrian Pound Taiwan New Dollar Tajikistani Somoni Tanzanian Shilling Thai Baht Tongan Pa'anga Trinidadian Dollar Tunisian Dinar Turkish Lira Turkmenistani Manat Tuvaluan Dollar US Dollar Ugandan Shilling Ukrainian Hryvnia Unidad de inversión Uruguayan Peso Uzbekistani Som Venezuelan Bolívar Venezuelan Bolívar Venezuelan Bolívar Vietnamese Dong Yemeni Rial Zambian Kwacha Zimbabwe Gold Dollar Zimbabwean Dollar Zimbabwean Dollar units of measurement SQUARE FEET SQUARE METERS DEFAULT PROPERTY VIEW thumbs List View Reach Brickell City Centre Profile Available Pending Closed Floor Plans Media Stats Reviews Walk Score® Reach Brickell City Centre 68 SE 6 St Miami FL 33131 7.29 MCI RANK Reach Brickell City Centre is a 43-story, luxury condominium building located in the heart of Brickell. Completed in 2016, Reach Brickell City Centre was developed by Swire Properties and designed by Arquitectonica with Richardson Sadeki, a renowned design firm, designed the lobby and other common area spaces. Reach Brickell City Centre is a LEED-certified building with 390 condo residences comprised of one-, two-, three-, and four-bedroom floor plans (see Reach Brickell City Centre floor plans ). The apartments at Reach Brickell City Centre offer sweeping views of the city from spacious terraces or floor-to-ceiling glass windows. The residences were delivered fully finished and furniture-ready with a choice of two interior finish packages. The kitchens at Reach Brickell City Centre include cabinets by Italkraft and a premium appliance package by Bosch. Reach Brickell City Centre has a half-acre amenity deck including tropical gardens, barbecue grills, outdoor fitness areas, a children’s play area, heated lap and social pools, hot tubs, a state-of-the-art fitness center, a library, a business center, and a full-service spa with a hammam featuring dipping pools, showers, and steam. Additionally, Reach Brickell City Centre has Wi-Fi throughout its lobbies and common areas. See our Reach Brickell City Centre review and photo tour . Reach Brickell City Centre is located in Brickell at 68 SE 6th Street, Miami, Florida. It is just an elevator away from the various shopping, dining, and entertainment options that can be found at Brickell City Centre. Additionally, residents of Brickell City Centre Reach are just a few blocks away from the restaurants, bars, and cafes that can be found at Mary Brickell Village. By car, Reach Brickell City Centre is 6 minutes from the American Airlines Arena, 10 minutes from Wynwood Miami, 14 minutes from South Beach, and 14 minutes from the Miami International Airport. See also Rise Brickell City Centre Bedrooms Price Range SQFT Range Avg $/SqFt Total Units Total Floors Year Built 1-4 685.0K to\n                            3.1M 810 to\n                            2526 $899 390 43 2016 Amenities State-of-the-art fitness center with individual fitness studios and machine room Heated lap and social pools with two heated spas Hammam spa featuring dipping pools, showers and steam rooms Hair salon on premises for extra pampering, including blowouts and mani/pedi services Poolside beverage and cafe service 24-hour Security On-site Concierge available to residents 7 days a week Porte Cochere with 24 hour valet parking services Spacious library with comfortable reading nooks Common entertainment areas including full kitchen, living and dining areas High-speed Elevators Wi-Fi Internet in Lobby and Amenity Deck Read more Features Kitchens and Bathrooms feature Italkraft cabinetry and stone counter tops Premium Bosch appliance package Floor-to-ceiling Sliding Glass Doors Master bedrooms with private en-suite bathrooms Bathrooms feature soaking tubs, frameless glass-enclosed showers and LED mirrors City-view terraces accessible from living areas and most bedrooms Open concept layouts with island or peninsula kitchen Ceiling heights from 9'4\" to 11'4\" in non-penthouse residences and 12'4\" in its seven penthouse residences Biometric technology elevator access Bosch appliances Read more FAQ Which utilities are included in the Reach Brickell City Centre condominium association dues? Basic cable, Internet, water, sewer, trash removal and pest control are included in the condominium association dues. What is the pet policy for owners and renters at Brickell City Centre Reach? Brickell City Centre Reach allows pets for owners only.  Tenants are not allowed to have pets.  The pet policy permits owners to have no more than two (2) pets.  There are no weight restrictions.  Prior to move-in, owners who have a pet must pay a $100 non-refundable fee to the condo association. What are the rental restrictions for Brickell City Centre Reach? Owners may rent their units a maximum of two (2) times per year. No lease can be less than six (6) months. Read more Phone Directory Reach Brickell City Centre Front Desk/Concierge: 305-363-2708 Read more Subscribe to Our Monthly Newsletter Name E-mail * Email This field is for validation purposes and should be left unchanged. Phone: +1-305-428-3860 e-mail: [email protected] about contact sitemap terms privacy cookie policy © 2007-2025 Miami Condo Investments CREDITS LOG IN Username or Email Address Password Remember Me Lost your password? Registration Form Create an account to receive pricing and status change alerts for favorite property listings as well as save condo developments as a shortcut for quick reference Username * First Name * Last Name * Email * Comments This field is for validation purposes and should be left unchanged. Already have an account? Sign in x Share this with your friends PROPERTY We would love to hear from you! Please fill out this form and we will get in touch with you shortly. Your name * Your Email * Friend's Name Friend's Email: * Comment * Phone This field is for validation purposes and should be left unchanged. X Download PDF X X [idx_modalalert] X"
    },
    {
      "url": "https://www.brickellbuickgmc.com/contact.htm",
      "text": "Contact Us | Auto Dealership and Maintenance Center in Miami Skip to main content 665 SW 8TH ST Directions Miami , FL 33130 Contact : (877) 844-1641 Service : (786) 245-4932 Parts : (855) 662-8985 Home New Inventory Shop New Inventory Shop New Inventory New Vehicle Specials HUMMER EV vs Cybertruck Auto Loan Savings Program Sierra EV vs Cybertruck Value Your Trade Shop By Make New Buick New GMC Shop Popular Models Sierra EV Sierra 1500 Enclave Encore GX Pre-Owned Inventory All Pre-Owned Models Shop Pre-Owned Buick Shop Pre-Owned GMC Shopping Tools Finance and Trade Apply For Financing Value Your Trade Get An Offer On Your Car Specials & Incentives New Vehicle Specials Manufacturer Offers Service & Parts Specials Pre-Owned Specials Trade/Sell Service Service Schedule Service Service Specials Service Hours Parts Parts Order Parts Online GM Accessories Tire Finder Parts Warranty Information New Tires Parts Hours About Us Our Dealership Hours & Directions Meet Our Staff Careers Why Buy With Brickell GMC Contact Us Showroom Hours The Price You See Is the Price You Pay For Pre-Owned Inventory — No Hidden Fees. Period | Shop Now Contact Us Get in Touch with Brickell Buick & GMC in MIAMI Get in touch with Brickell Buick & GMC. Use this form to inquire about a test drive, or ask any questions about our inventory. If you are curious about a specific model or trim style, you can use this form to find out if we have it, or if we can order it to be brought to the store for your convenience. We are available to answer your questions about financing, leasing and specials options here. Just shoot us a quick note and we will get back to you as soon as we can. We are also reachable at (786) 245-4889 during our regular business hours. We are also open to your feedback! You can use this form to reach us about the content on our site or your experience in the store. We look forward to serving you. * Indicates a required field First Name * Last Name * Contact Me by * Email Phone Email Phone Comments Submit By submitting your information, you consent to share your details with our dealership and receive emails from our team and representatives. You agree to receive calls and texts (including automated messages) if you provide your phone number. You may opt-out at any time. Consent is not a condition of purchase, and message/data rates may apply. You also agree to our Terms and Privacy Policy outlining how your data is used. Related Links About Directions Contact Contact 665 SW 8TH ST Directions Miami , FL 33130 Contact : (877) 844-1641 Hours Monday 9:00 am - 9:00 pm Tuesday 9:00 am - 9:00 pm Wednesday 9:00 am - 9:00 pm Thursday 9:00 am - 9:00 pm Friday 9:00 am - 8:00 pm Saturday 9:00 am - 8:00 pm Sunday 11:00 am - 7:00 pm Share Facebook Twitter Website by Dealer.com Contact About Privacy Sitemap Accessibility ;\n;"
    },
    {
      "url": "https://8streetbrickell.com/reservations/",
      "text": "Reservations | Book A Table | 8Street Brickell | 8Street Brickell Skip Nav Home Menu Reservations DJ Schedule Private Events Media And Awards About Us Contact Contact Us 8Street Brickell Thank you for your interest in our company. Complete the form below to send us an email, or simply give us a call. We're looking forward to working with you. Miami, FL 33130 786-207-9401 Please leave this field empty. OK! Thank You! Your message has been sent. Oops, message not sent. Please make sure fields are complete. Reservations Book a Private Table Today Make a Reservation Please make a reservation below. For large party reservations, please send us an email at social@8streetbrickell.com . Classic Elegance Reimagined 8Street Brickell is an upscale Miami cocktail bar and lounge designed from the ground up with luxe couches, colorful lighting, and a floor-to-ceiling main bar. As a modern speakeasy with food and live DJs, we’ve reimagined the classic elegance of the 1920s by making it more chic. 8Street Brickell | Cocktail Bar In Miami 8Street Brickell is an Upscale Lounge Bar Located in the Heart of Brickell, Featuring Classic Cocktails, DJ's and Good Vibes. Join Us Today! Contact Information 88 SW 8 Street Miami, FL 33130 Today's Hours: Monday: 6:00pm - 2:00am Tuesday: 6:00pm - 2:00am Wednesday: 6:00pm - 3:00am Thursday: 6:00pm - 3:00am Friday: 6:00pm - 3:00am Saturday: 6:00pm - 3:00am Sunday: 6:00pm - 1:00am Subscribe to Our Newsletter Enter your email below to sign up for our email list for updates, promotions, and more. Please leave this field empty. Get In Touch Please use the following form to send us a message. We can also be reached by phone at 786-207-9401 . We look forward to hearing from you. DRESS CODE AFTER 9PM: NO shorts, flip flops, sports attire, or beach attire. 88 SW 8 Street Miami, FL 33130 786-207-9401 Make A Reservation Please leave this field empty. OK! © 2025 8Street Brickell Website Design by Big Tuna Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset"
    },
    {
      "url": "https://www.fast-and-wide.com/faw-news/fast-news/16222-8street-brickell-takes-miami-back-to-the-speakeasy",
      "text": "8Street Brickell takes Miami back to the speakeasy Home Blog News Wide News Fast News Fast Moves Gear Recording-Mixing Microphones & Mic Preamps Outboard & Plug-ins Processing & Control Loudspeakers: Reinforcement Loudspeakers: Studio Loudspeakers: Install Loudspeakers: Drivers Stage/Broadcast/IEM Wireless Systems Location & Remote Broadcast Headphones & Headsets DJ/Music Audiovisual Mobile Apps Intercoms & Conferencing Amplification Interfaces & Interconnects Acoustic Panels/Control Metering/Test & Measurement Rigging, Racking & Stands Faster-and-Wider Wideangle – Features Fast Talk – Interviews Behind Fast-and-Wide Pro Audio Timeline White Papers Show Dates Find 8Street Brickell takes Miami back to the speakeasy Alongside its place as the financial district of Miami, the South Beach neighbourhood of Brickell is rapidly becoming a desirable residential area – with a corresponding demand for bars and restaurants emerging equally quickly. Among them, 8Street Brickell is a boutique bar owned and operated by Mark Meram with a capacity to host exclusive VIP parties and DJ sets while also providing a hangout for locals and visitors to the city. Meram’s aim was to lend a sophisticated modern twist to the classic speakeasy, with its interior echoing 1920s style including wood and button tuft upholstery and a soaring and undulating ceiling enhanced with LED lighting. The venue was designed by Callin Fortis and his team at Bigtime Design Studios as part of a new condo complex. ‘From the offset, we knew this venue was going to be something special,’ Callin explains. ‘It was going to demand a high-level audio installation that would complement, not detract, from the overall look and feel of the bar. Because of the complex LED-mapped ceiling grid we were designing as a focal point of the bar’s architecture, it was a natural fit to work with high-end integrator Paul Van Puffelen and his team at Southern Technical Support Inc in order to help us realise Mark’s vision of a modern-day speakeasy.’ Meram was clear in what he wanted of the audio: ‘We were looking for a versatile system that would be well received by guest DJs for special events, but would also provide reliable perimeter and distributed audio coverage for our daytime service, as well as our lounge night concept. We wanted loudspeakers that would accentuate the space and act as part of the design – basically to become a piece of art themselves. To be honest, we had Void Acoustics in mind long before we appointed our consultants.’ System design integrator Paul Van Puffelen, from Southern Technical Support Inc, worked in with audio partner Mike Harris of Harris Audio Systems to specify the installation. Together, they answered the design brief for the high-spec, sleek looking audio system. This included the installation and programming of a full Void system, with Void Acoustics signature Air Motion speakers accompanied by Air 8 and Airten V2 fixtures; the IP-55 rated Cyclone 55 for the outside patio; completed by Stasys 218 subs with Bias Q2 and Bias V9 amplifiers. All products were finished with custom pantone matte black to reflect the project look – provided by the Void production team. ‘The main challenge was specifying and installing a high-end audio installation into a brand-new venue during a pandemic,’ Van Puffelen reflects. ‘There were numerous delays during 2020 which, in the end, served us well as they allowed the individual trades to come in and perfect each aspect of the installation without any real time pressure. In addition – and in many ways most importantly – this allowed us time to implement a strategic acoustical treatment. We ended up with as much time as we needed to tune the room and ensure there was no negative impact to the quality of the sound system resulting from any mechanical noises, air conditioning or other structural elements.’ While the Brickell neighbourhood has a wealth of bars and restaurants leaving visitors spoilt for choice, there is nothing comparable to 8Street Brickell in the vicinity. ‘My wish was to create an approachable, but entirely unique and memorable experience for anyone stepping inside 8Street Brickell. In fact, offering our customers a chance to step back in time and celebrate that moment in history where the speakeasy was the place to secretly meet, enjoy good humour and the eccentricities of the day. All that with a feel of the 2020s, not the 1920s. ‘The sound system was one of the most important aspects of the space. A futuristic and quality Void Acoustics sound system helped create this intrigue and our guests’ first reaction when they walk in is instantly one of awe and curiosity in the sound system.’ Meram credits the expertise and work of Southern Technical Support Inc as central to achieving his vision. ‘We couldn’t be happier with the look and sound of the Void Acoustics sound system. I have always been an avid fan of Void Acoustics and knew that they were the only speakers on the planet that would give us the sound quality and look we so desperately desired for the venue.’ More: www.voidacoustics.com Fast Moves Han Luis Cera: Wharfedale Pro Wharfedale Pro has recruited Han Luis Cera to its International Application and Solutions team. Carlos Chu, Peter Crithary: The HELM Sydney-based cinematic broadcast solutions specialist for live production The HELM has announced the appointments of Carlos Chu as Vice President of Business Development - APAC, and Peter Crithary as Business Development Manager - Americas. Both bring decades of international expertise in live production, reinforcing The HELM’s expansion strategy and global reach. Anne Berggrein: Wisycom Wisycom has appointed Anne Berggrein as its new Chief Marketing Officer (CMO) to lead global marketing strategies, focusing on strengthening brand recognition through communications, product launches, enhanced channel support and forward-thinking initiatives with key partners. TJ Adams: Audinate Group Audinate Group has appointed TJ Adams to the newly-created position of Chief Platform Officer, operating from the United States and reporting to Chief Strategy Officer Nick Peace. Mark Skipper: SSL Solid State Logic has named Mark Skipper as National Sales Manager, Eastern US, responsible for SSL Broadcast and Live solutions and reporting to Rick Naqvi, Senior VP of USA Sales. In his new role, Skipper joins US distributor Group One Ltd in expanding SSL’s business development and customer relationships. Renkus-Heinz Engineering Department Renkus-Heinz has recruited three new team members to its engineering department. Hai Le joins the team as Embedded Software Engineer, Robert Newman takes on the role of Loudspeaker Engineering Technician and Peng Yin joins as Senior Software Engineer. David Hunter: Keenfinity Group David Hunter is stepping into the post of Business Unit Communications Systems lead with the Keenfinity Group (formerly Bosch Building Technologies), which includes the Bosch, Electro-Voice, Dynacord, RTS and Telex brands. Vicente Rios Silvestre: HK Audio Vicente Rios Silvestre is the latest addition to HK Audio’s support team, brought onboard as the go-to contact for the manufacturer’s Spanish-speaking customers. Audiologic Technical Team UK audio technology distributor Audiologic has announced the internal appointment of Matt Nettlefold to take over from Ben Spurgeon as Head of Technical, as well as the addition of former Biamp and B&W audio engineer, Berk Yucemoz. VDC Trading sales team UK supplier of analogue and digital audio, video and fibre cables, VDC Trading, has expanded its sales team, a move driven by continuing growth and the desire to better serve its broad customer base. Wisycom management RF solutions specialist Wisycom has announced ‘a transition in corporate management’, appointing Davide Morsiani as CEO and Gerrit Buhe as CTO, while Andrea Bulfon continues as COO and Marika Stangherlin is promoted to Chief Sales Officer. You are here: F&W Home News Fast News 8Street Brickell takes Miami back to the speakeasy Copyright © 2010 Fast-and-wide.com. All Rights Reserved. Contact Fast-and-Wide Joomla! Templates by RSJoomla!"
    },
    {
      "url": "https://brickellpsychology.com/contact/",
      "text": "Contact - Brickell Psychology Skip to content Skip to footer 2730 SW 3rd Ave. Suite 305, Miami, FL 33129 [email protected] +1 786.475.8151 Make an Appointment Home About Dr. Samantha M. Behbahani Dr. Gustavo A. Benejam Dr. Kristin Borracci-Pastiu Dr. Jacqueline Pablos Dr. Rachel Keitelman Services Depression Anxiety Burnout Phobias Trauma Couples Therapy Family Therapy Grief & Loss Psychological Testing Resources Blog FAQ Our Offices Contact Contact Close Home About Dr. Samantha M. Behbahani Dr. Gustavo A. Benejam Dr. Kristin Borracci-Pastiu Dr. Jacqueline Pablos Dr. Rachel Keitelman Services Depression Anxiety Burnout Phobias Trauma Couples Therapy Family Therapy Grief & Loss Psychological Testing Resources Blog FAQ Our Offices Contact Address 2730 SW 3rd Ave. Suite 305 Miami, FL 33129 Get Directions Get in Touch Telephone: (786) 475-8151 Email: [email protected] Contact Form Open Hours Mon-Fri: 9 AM – 6 PM Saturday: 9 AM – 4 PM Sunday: Closed Address 2730 SW 3rd Ave. Suite 202 Miami, FL 33129 Get Directions Get in Touch Telephone: (786) 475-8151 Email: [email protected] Contact Form Have Questions? Get in Touch! Make a booking with our online form 2730 SW 3rd Ave. Suite 305 , Miami , FL 33129 Phone: 1.786.475.8151 Email: [email protected] Brickell Psychology © 2024. All Rights Reserved. | Web Design by Accodelades. Brickell Psychology © 2024. All Rights Reserved. Web Design by Accodelades. Brickell Psychology © 2024. All Rights Reserved. | Web Design by Accodelades. Privacy Policy | Terms of Service Brickell Psychology © 2024. All Rights Reserved. Privacy Policy | Terms of Service Web Design by Accodelades. Our site uses cookies. Learn more about our use of cookies: cookie policy Accept"
    },
    {
      "url": "https://www.brickellsicecream.co.uk/pages/about-us",
      "text": "About US\n– Brickell's Ice Cream Skip to content Just added to your cart Qty: View cart ( ) Continue shopping Submit Close search Free Delivery on 6 Tubs or More. Dispatch Days Monday - Thursday, Delivering Tuesday - Friday. Order before 8am for Next Day Delivery. Home Order Online Kids T's Trade About Brickell's About Us Contact Us Follow Us Search Log in Cart 0 items Home Order Online Kids T's Trade About Brickell's About Brickell's Menu About Brickell's About Us Contact Us Follow Us About Us From our inception in 2018, our ambition was to create a traditional French custard-style ice cream that was free from stabilisers, emulsifiers, artificial flavorings, and preservatives. To this day we still hold these same values, which go into everything we do. This means that rather than buying in flavours and pastes from flavour houses, each one of our flavours is formulated by us, to work with the raw ingredients which we process ourselves in our kitchen. What This Looks Like Our base consists of 4 simple ingredients; Milk from our family dairy farm Westcombe Dairy , fresh double cream from Gloustershire, Free Range egg yolk from Clarence Court, and British beet sugar. No ultra processed gums used to thicken the ice cream or artificial emulsifiers with names you can barely pronounce. Sourcing Our Ingredients We look to work with the best producers and suppliers we can find, who share the same values as us. All our chocolate comes from Pump Street, based in Suffolk who source directly from cocoa farmers, ensuring prices far greater than fair trade. They also follow our ethos of simple natural ingredients, with their chocolate consisting of just Cocoa beans, cane sugar, and cocoa butter! The Ricotta for our Ricotta Stracciatella comes from the family farm, from the same milk used in our ice cream, and is produced next door! We only use whole Vanilla pods, no extract, which are organically grown and sustainably sourced from Madagascar. Kitchen Garden Next to our production site, in the village of Westcombe, Somerset, we have a 1-acre Georgian Kitchen Garden brought by our grandfather, after the house it belonged to was demolished after the war. We have been slowly restoring this to its former glory, and have this year (2023) put down 50 mint plants for a new seasonal flavour to be run in summer 2024. This is the first of many seasonal flavours where we are going to be growing the main ingredient ourselves, controlling the inputs, and reducing our food miles. Sustainable Packaging From day one we have used a fully recyclable brown kraft tub to house ice cream. This year we finally found a supplier that could offer us the same packaging for our single portion 120ml tubs to join the family. These come complete with a wooden spoon in the lid, so are entirely plastic-free. Family Run Business We are a family team here at Brickell’s – husband and wife. Rob started the business after having a passion for Ice Cream and wanting to diversify the milk on his family farm. Rob went off to Penn State University for a short course in Ice Cream Science and on his return founded Brickell’s. Iona joined in 2023 to support the sales and the growth of the company and her role very much focuses on helping to drive Brickell’s to the next level. Newsletter Subscribe Quick links Search Contact Us Refund Policy Terms of Service Stockist Payment methods American Express Apple Pay Diners Club Discover Google Pay Maestro Mastercard PayPal Shop Pay Union Pay Visa Facebook Instagram Payment methods American Express Apple Pay Diners Club Discover Google Pay Maestro Mastercard PayPal Shop Pay Union Pay Visa © 2025, Brickell's Ice Cream Powered by Shopify Use left/right arrows to navigate the slideshow or swipe left/right if using a mobile device Choosing a selection results in a full page refresh. Press the space key then arrow keys to make a selection."
    }
  ]
}