{
  "fuentes": [
    {
      "url": "https://99bottlesofwine.com/",
      "email": "info@cfnapa.com"
    },
    {
      "url": "https://99bottlesofwine.com/",
      "email": "info@cfnapa.com"
    },
    {
      "url": "https://www.99bottles.net/bar-tab-99-bottles-brings-enjoyable-craft-beer-wine-spot-to-downtown-sarasota/",
      "email": "jimmy.geurts@heraldtribune.com"
    },
    {
      "url": "https://drinkwithyoureyes.com/book/",
      "email": "info@cfnapa.com"
    },
    {
      "url": "https://www.heraldtribune.com/story/entertainment/dining/2019/04/19/craft-beer-and-wine-bar-99-bottles-opens-in-downtown-sarasota/5391821007/",
      "email": "jimmy.geurts@heraldtribune.com"
    }
  ],
  "mails": [
    "info@cfnapa.com",
    "jimmy.geurts@heraldtribune.com"
  ],
  "nombre_sitio": "99bottles.net",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://99bottlesofwine.com/",
      "text": "99 Bottles by CF Napa Brand Design - Strategic Solutions for the Wine, Spirits and Beer Industries. For more than thirty-five years CF Napa Brand Design has led the wine industry in innovation and originality. CF Napa’s philosophy is based on one simple belief: Differentiated strategic positioning \u0003 and evocative design combined with compelling storytelling are essential for establishing an emotional and cognitive connection between consumer and brand. The result has been brands with more successful positioning and more powerful aesthetics that consistently connect with consumers to increase market share, creating some of the most successful wine brands in the world. In the last fifty years, the wine industry has undergone a radical change. What was once regarded as an industry specific to Europe—especially France, Italy, Germany, and Spain—wine has since become a worldwide endeavor, with North and South America, New \n          Zealand, and Australia all becoming revered wine producers in their own right. Now more than ever the quality of wine is not only what matters. In today’s marketplace, a brand’s packaging is essential to its success. 99 Bottles of Wine: The Making of the Contemporary Wine Label \u0003 is a celebration of this unique and evolving art form. David \u0003Schuemann, Owner and Creative Director of CF Napa Brand Design, reveals the inspiration and strategic thinking behind ninety-nine of the most successful packaging designs from the company’s portfolio—from solutions for boutique producers to some of the largest wine companies worldwide. Vivid photographs of the resulting solutions accompany each of Schuemann’s narratives and the book’s dust jacket unfolds to become a stunning poster showcasing all of the wine bottles featured in the book. Along with a Foreword by Agustin Huneeus Sr., the renowned creator of Quintessa wine, 99 Bottles offers wine lovers, serious collectors, and design aficionados a rare, behind-the-scenes look at how contemporary packaging and innovative design are driving the success of today’s leading wine brands. Order your signed copy of 99 Bottles of Wine now for immediate shipping. Price includes free US Postal Service shipping to United States addresses. Additional books can be added in the shopping cart. $35.40 ea. For international order inquiries, \n            please \nemail 99bottles@cfnapa.com . © 2024 CF NAPA BRAND DESIGN  |  CF NAPA  |  99 BOTTLES OF WINE 2787 NAPA VALLEY CORPORATE DR., NAPA, CALIFORNIA 94558 T: 707.265.1891  SKYPE: CFNAPA1 FACEBOOK INFO@CFNAPA.COM PUBLISHED BY: VAL DE GRACE BOOKS, NAPA, CALIFORNIA T: 707.259.5350 WWW.VALDEGRACEBOOKS.COM"
    },
    {
      "url": "https://www.99bottles.net/bar-tab-99-bottles-brings-enjoyable-craft-beer-wine-spot-to-downtown-sarasota/",
      "text": "Bar Tab: 99 Bottles brings enjoyable craft beer, wine spot to downtown Sarasota - 99 Bottles Taproom & Bottle Shop Skip to content Home About Us The Space The Drinks Home About Us The Space The Drinks Brunch Events News Shop Contact Brunch Events News Shop Contact Home About Us The Space The Drinks Brunch Events News Shop Contact X Home About Us The Space The Drinks Brunch Events News Shop Contact X Bar Tab: 99 Bottles brings enjoyable craft beer, wine spot to downtown Sarasota October 27, 2021 99 Bottles News When craft beer and wine bar 99 Bottles opened in downtown Sarasota this April, it caused a lot of excitement in the community for a number of reasons. Part of the anticipation was due to its owner Mark Tuchman, who formerly owned popular Sarasota craft beer bar Mr. Beery’s in Gulf Gate. There’s also its location, on the ground level of luxury apartment building The DeSota, where Tableseide Restaurant Group’s new bar Circo: A Taco and Bourbon Joint also plans to open. I was personally most interested in the wide array of craft brews available not only on tap, but also to take home via a shelf of packaged beer, wine and other products. I briefly visited 99 Bottles while reporting its opening, but didn’t have much of a chance to take in the bar or its lengthy tap list. So I figured it was time for another visit, particularly after I learned the beer list switches up and new weekly events have been added. The atmosphere I stop in around 5 p.m. on a Friday. While the small, about 10-seat bar is already nearly full, it’s quiet and laid-back, with a crowd ranging from friends kicking off the weekend to a guy quietly working on his laptop. The design is sleek and spare, with a white marble tabletop, slim overhanging lights and wooden beer taps sans their colorful handles. One eye-catching detail is a black-and-white mural by Sarasota artist Will Ralston of a smiling bearded man, looming above on a wall by the end of the bar. Two flatscreen televisions hang above the bar along with a screen projection of the on-tap offerings. (That might seem like a small thing, but after recently visiting a bar where the draft beer list was only available via a small television that slowly rotated through multiple sections, it’s appreciated.) There’s additional seating in lounge sofa sections at each corner by the entrance, and stools underneath the retail shelf. The wall features an extensive variety of six and four-packs, wine bottles, growlers and crowlers (which can be filled at the bar), glasses and apparel. Many sport 99 Bottles’ nifty logo, which is also printed on the bar’s glasses and painted on its doors. The drinks 99 Bottles features about 30 beers on tap, which change often. Recent offerings included local choices in Motorworks’ Cruiser Kolsch and Darwin Llama Mama Milk Stout on nitro, both from Bradenton, along with other American craft and a variety of German brews. It also offers $4 local canned beers, $5 hard ciders and uses a specialized tapping system to offer small pours from a rotating slate of rare bottled brews (prices vary). It makes two wine-based cocktails, takes on an Aperol spritz and sangria. I go with “The Gria” ($8.50), made with red wine, orange juice and peach nectar, poured a thick purple into a slim glass. There are also 28 red, white, sparkling and rose wines available. And if you don’t drink alcohol, cold brew and coffee tonic from Sarasota’s O & A Coffee & Supply is on tap, as is a CBD-infused kombucha from California. Its happy hour runs until 7 p.m. daily and features a selection of $3-$4 beer cans, $5 draft and $5-$12 wines by the glass. I go with the Kapuziner Weisse on draft, a tasty German Hefeweizen with notes of banana and spices. The food Food is served starting at 4 p.m. Monday-Friday and 8 a.m. Saturday-Sunday, with happy hour also including a few deals on bar bites such as a “lil’” cheese plate ($5) and popcorn ($3). I order a pretzel ($4), which pairs nicely with my German beer, with a side of genuinely spicy mustard a bonus. Other snacks on its regular menu include artichoke dip with bagel chips and crostini with prosciutto, parmesan and basil. There’s also a full-size cheese and charcuterie board and mezze plate, and desserts including whoopie pies. They’ve recently added a “Fernprost” German night starting at 4 p.m. Thursdays including liter steins of select beers as well as bauernwurst and Bavarian pretzels. And on Saturdays and Sundays from 8 a.m. to 2 p.m., they offer a New York bagel brunch. Fun weekly events like this and a rotating beer menu encourage repeat visits, but it’s 99 Bottles’ solid foundation that’s likely to keep customers coming back. 99 Bottles: 1445 Second St., Sarasota; 941-487-7874; facebook.com/99bottlessarasota Original Post by Jimmy Geurts | Herald Tribune Entertainment reporter Posted Jun 5, 2019 at 11:33 AM Updated Jun 5, 2019 at 11:33 AM Next Share the Post: Related Posts Run club at local craft beer bar grows to hundreds in size When Mark Tuchman, owner of 99 Bottles Taproom & Bottle Shop, started a weekly run club three and a half Read More 10 Stellar Wine Shops & Wine Bars in Sarasota Sarasota’s wine culture lures both seasoned oenophiles and casual revelers—and everyone in between.  Whether you’re seeking a bottle for a Read More Join Our Newsletter Full Name Email Submit (941) 487-7874 info@99bottles.net 1445 2nd St, Sarasota, FL 34236 Google Facebook Instagram Untappd Copyright © 2025 | 99 Bottles Taproom & Bottle Shop"
    },
    {
      "url": "https://drinkwithyoureyes.com/book/",
      "text": "99 Bottles of Wine | Drink With Your Eyes® Drink With Your Eyes® Increasing sales through strategic branding for the alcohol beverage category. Blog About 99 Bottles of Wine Speaking Engagements & Events Pick My Brain Contact CFNAPA.COM 99 Bottles of Wine The Making of the Contemporary Wine Label In the last fifty years, the wine industry has undergone a radical change. What was once regarded as an industry specific to Europe—especially France, Italy, Germany, and Spain—wine has since become a worldwide endeavor, with North and South America, New Zealand, and Australia all becoming revered wine producers in their own right. Now more than ever the quality of wine is not only what matters. In today’s marketplace, a brand’s packaging is essential to its success. 99 Bottles of Wine: The Making of the Contemporary Wine Label is a celebration of this unique and evolving art form. David\u0003Schuemann, Owner and Creative Director of CF Napa Brand Design, reveals the inspiration and strategic thinking behind ninety-nine of the most successful packaging designs from the company’s portfolio—from solutions for boutique producers to some of the largest wine companies worldwide. Vivid photographs of the resulting solutions accompany each of Schuemann’s narratives and the book’s dust jacket unfolds to become a stunning poster showcasing all of the wine bottles featured in the book. Along with a Foreword by Agustin Huneeus Sr., the renowned creator of Quintessa wine, 99 Bottles offers wine lovers, serious collectors, and design aficionados a rare, behind-the-scenes look at how contemporary packaging and innovative design are driving the success of today’s leading wine brands. A Look Inside: BUY NOW David Schuemann David Schuemann is the Owner & Creative Director of CF Napa Brand Design™ | Author: 99 Bottles of Wine | Speaker | Brand Strategist and Consultant for Wine, Spirits, and Beer. Drink With Your Eyes provides tips and insights into brand strategy and design for the alcohol beverage category. Since 2002, David Schuemann has been the Owner & Creative Director of CF Napa Brand Design, a creative agency specializing in wine, spirits, and beer. Connect Subscribe to Blog via Email Enter your email address to subscribe to this blog and receive notifications of new posts by email. Email Address Subscribe Categories Categories Select Category Agency Selection Brand Positioning Branding Color Distribution Green Packaging Label Design Legal Marketing Millennials Naming Packaging Printing Production Redesign Research Sales Story Development Tiering Website Design Top Posts & Pages Speaking Engagements & Events Alcohol Beverage Branding: What's in a Name? Why Color Matters for Alcohol Beverage Branding Back in Black: Alcohol Beverage Branding Goes to the Dark Side ABOUT ME David Schuemann is the Owner & Creative Director of CF Napa Brand Design™ | Author: 99 Bottles of Wine | Speaker | Brand Strategist and Consultant for Wine, Beer, and Spirits. CONTACT ME 2787 Napa Valley Corporate Drive Napa, CA 94558 Email: info@cfnapa.com Phone: 707.265.1891 Web: www.cfnapa.com Copyright © 2025 · Minimum Pro Theme on Genesis Framework · WordPress · Log in"
    },
    {
      "url": "https://www.heraldtribune.com/story/entertainment/dining/2019/04/19/craft-beer-and-wine-bar-99-bottles-opens-in-downtown-sarasota/5391821007/",
      "text": "Craft beer and wine bar 99 Bottles opens in downtown Sarasota News Sports Ticket Lifestyle Opinion Advertise Obituaries eNewspaper Legals DINING Craft beer and wine bar 99 Bottles opens in downtown Sarasota Jimmy Geurts jimmy.geurts@heraldtribune.com Craft brew maven Mark Tuchman has opened his highly anticipated beer and wine bar in downtown Sarasota. 99 Bottles is at 1445 Second St., on the ground level of luxury apartment complex The DeSota and in walking distance of Whole Foods. As previously reported , it’s owned by Tuchman, who formerly owned popular Gulf Gate craft beer bar Mr. Beery’s. “The idea is a culmination of all my experiences in food and beverage, craft beer more specifically, over the course of 15 years in business,” Tuchman said. The bar features 30 craft beers on tap, ranging from local brews to national and international offerings, and 28 wines by the glass. Packaged beer and wine is also available for sale along with other merchandise, including growlers and crowlers that can be filled on-site. Current food options include sandwiches, a cheese and charcuterie board and desserts like whoopie pies and key lime poundcake. It also has a 4-7 p.m. happy hour with $3-$8 canned and draft beers or wine glasses, as well as $3-$5 snacks like a pretzel with spicy mustard and popcorn. Looking for a free mini puzzle? Play the USA TODAY Quick Cross now. 99 Bottles is open noon-11 p.m. daily, and can be reached at 941-487-7874 or facebook.com/99bottlessarasota . Careers Staff Directory Accessibility Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Business Advertise Your Business Promote your Event Licensing & Reprints Public Notices Help Center Subscriber Guide Manage Account Give Feedback Submit Community News Subscribe Today Newsletters Facebook X Instagram eNewspaper Archives Jobs Real Estate Classifieds Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.heraldtribune.com. All rights reserved."
    }
  ]
}