{
  "fuentes": [
    {
      "url": "https://finewineliquors.com/contact-us/",
      "email": "sales@finewineliquors.com"
    },
    {
      "url": "https://inzmo.com/deu/en/contact",
      "email": "info@inzmo.com"
    },
    {
      "url": "https://www.ninefeettall.com/about-us/",
      "email": "info@ninefeettall.com"
    },
    {
      "url": "https://www.wrestling-online.com/wwe/takers-six-feet-under-podcast-relaunches-with-new-co-host-under-wwe-banner/",
      "email": "advertising@wrestling-online.com"
    },
    {
      "url": "https://www.wrestling-online.com/wwe/takers-six-feet-under-podcast-relaunches-with-new-co-host-under-wwe-banner/",
      "email": "editor@wrestling-online.com"
    },
    {
      "url": "https://sixfeetup.com/contact-us",
      "email": "info@sixfeetup.com"
    },
    {
      "url": "https://blog.hootsuite.com/social-media-image-sizes-guide/",
      "email": "g2-reviews-2025@2x.png"
    }
  ],
  "mails": [
    "advertising@wrestling-online.com",
    "editor@wrestling-online.com",
    "g2-reviews-2025@2x.png",
    "info@inzmo.com",
    "info@ninefeettall.com",
    "info@sixfeetup.com",
    "sales@finewineliquors.com"
  ],
  "nombre_sitio": "9ftundr.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://finewineliquors.com/contact-us/",
      "text": "Contact us Fine Wine Liquors Shop By Department Wine Red wine Menu Shiraz Cabernet Sauvignon Pinot Noir Red Blends Other Red Varietals Rosé Cabernet Merlot Shiraz Cabernet Merlot Grenache Tempranillo Sangiovese Nebbiolo Bordeaux Barossa Valley white Wine Menu Chardonnay Riesling Sauvignon blanc Pinot gris grigio Other white varietals White blends Dessert white Popular Regions Menu Bordeaux Barossa Valley Mclaren Vale Coonawarra Margaret River Burgundy Clare Valley Fortified Wine Menu Port Tawny Sherry Apera Vermouth Muscat Mead Tokay Topaque Popular Brands Menu Penfolds Under Wraps Wynns Wendouree Wolf Blass Tyrrell’s Top Selling Macallan 15 Year Old Double Cask $ 165.00 Availability: In Stock Glenfiddich Project XX $ 61.00 Availability: In Stock Glendronach 15 Year Old Revival $ 86.25 Availability: In Stock Beer Discover Beer Menu Craft Beer International Beer Australian Beer Mid Strength Light Beer Low Carb Beer Alcoholic Ginger Beer Home Brew Stout Pilsner Wheat Beer Dark Beer Golden Ale Porter Categories Menu Kegs Cider Craft Beer Domestic Beer Hard Seltzers Import Beer Non-Alcoholic Beer Popular Brands Menu 4 Pines Balter Coopers Little Creatures Stone & Wood Zytho New & Trending Menu New Arrivals Top Rated Craft Beer Light Low Pool Packs Cool Off Craft Beer The Lemonade Stand Country Menu Australia Sweden New Zealand France Spain From to Ready to Drink Organic Wine $69.99 Whiskey Discover whiskey Menu Scotch Whisky American Whiskey Japanese Whisky Australian Whisky Irish Whiskey Canadian Whisky Indian Whisky Discover Vodka Menu Absolut Smirnoff Hunter Distillery Stolichnaya Royal Dragon Crystal Head Poliakov Popular Brands Menu Johnnie Walker Jack Daniel’s Glenfiddich Highland Park Glen Moray Stone & Wood Fortified Wine Menu Whiskey Of The Month Flavored Whiskey Blended Scotch Rye Whiskey Single Malt Scotch Small Batch Bourbon Hot deals of summer Fresh Beer Save up $49.99 Jameson Whiskey Father’s Day Sale 40% off Sitewide! Cogac Cocktail Tequila What’s New New Gift & Accessories Best Sellers Sales & Offers -20% Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Menu Sign In or Register 0 0 $ 0.00 Contact us Home Page Contact us Don’t  hesitate to contact us \nif you need help. Whether you have a question about your order, need assistance with a product, or just want to reach out, you’re in the right place. Feel free to contact us using the details below, and we’ll get back to you as quickly as possible! Address 8560 S Cottage Grove Ave, Chicago, IL 60619, United States Call Us (630) 354-9222 Openning Monday – Friday: 8am – 10pm Saturday – Sunday: 9am – 5pm Contact sales@finewineliquors.com finewineliquorsinfo@gmail.com Got Any Questions? Use the form below to get in touch with the sales team Message Send your message Δ Search Account Cart Same-day local delivery Ground shipping directly to you Free in-store pickup 24/7 customer support Customer Service Menu Help Center My account Track my order Return policy About Us Menu Company info Press Releases Careers Reviews Investor relations Quick Links Menu Search Become a reseller Contact us Terms of service Categories Menu Brandy White Wine Champagne Vodka Tequila Get exclusive offers & rewards Sign up for our members portal to receive some exclusive offer & rewards. It’s easy and free! sign up Leave this field empty if you're human: stay connect Facebook-f Twitter Instagram Pinterest we accept Careers About Us Affiliates Privacy Settings Help Site map Copyright ©  2022 Liquory . All rights reserved. Sign in Create an Account Username or email * Password * Login Lost your password? Main menu Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Home About Us Account Blog Careers Cart Checkout Contact us Legal Notice My account Order Tracking Privacy Policy Refund and Returns Policy Reviews Sample Page Shipping Shop Terms & Conditions Track Wishlist Search for: Search All category All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell’s Black Lebel Blanton’s Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester’s Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell's Black Lebel Blanton's Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester's Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine Hide similarities Highlight differences Select the fields to be shown. Others will be hidden. Drag and drop to rearrange the order. Image SKU Rating Price Stock Availability Add to cart Description Content Weight Dimensions Additional information Click outside to hide the comparison bar Compare Top Shopping cart close ×"
    },
    {
      "url": "https://inzmo.com/deu/en/contact",
      "text": "Contact INZMO: Get in Touch with Us Today! | INZMO English Products Products Hello and welcome! You've just entered a world where insurance isn't just a necessity; it's a path to financial freedom. We're INZMO, and we're more than just insurance. Mobile Phone Insurance From 1.99€ / month Rental Deposit Warranty From 3.25€ / month Bicycle insurance From 4.99€ / month Laptop/Tablet Insurance From 2.99€ / month E-scooter Insurance From 4.17€ / month About us For Partners Submit a claim Submit a claim Submit a claim We're here to help! Whether it's phone, email or chat, let us know what we can help you with today! We're here to help! Whether it's phone, email or chat, let us know what we can help you with today! Contact us As an INZMO customer, there are several easy ways to get in touch with us. We're here to help with any questions you might have! Email us: info@inzmo.com Give us a call: +49 30 31193091 (available 9-17 CET, Monday-Friday; except national holidays) Chat: use our chat option down in the corner of the page to find an answer even faster. Looking to partner with INZMO? Learn about easily offering embedded insurance to your customers. Connect with one of our experts today and get started! Talk with an expert Unleash the revolution - choose the wise alternative Get covered Your e-mail address Submit Subscribe for updates See what's new Get the app Inzmo About us Imprint Products Rental Deposit Warranty Mobile Phone Insurance Laptop/Tablet Insurance Bicycle Insurance E-scooter Insurance Get in touch Contact us Partner with us Careers Legal Terms of Use Privacy Policy Cookie Notice & Policy"
    },
    {
      "url": "https://www.ninefeettall.com/about-us/",
      "text": "About Us - Nine Feet Tall Cookie Settings About Us What We Do Sectors Insights Case Studies Careers Contact Us About Us Our People Talan Data & AI Digital Transformation Transformation Strategy Technology Roadmap Technology Selection Solution Implementation Digital Adoption ERP Implementation ERP Planning ERP Systems Selection ERP Programme Health ERP Transformation ERP Adoption Programme Management Portfolio Design Project & Programme Management Programme Health & Recovery PMO Programme Assurance Managing Change Change Management Cultural Change Organisational Design Business Readiness Change Leadership Business Optimisation Target Operating Model Process Optimisation Business Analysis Benefits Realisation Continuous Improvement Sectors Retail Consumer Goods Housing Construction Legal Insurance Financial Third Sector Careers 9Start Development Programme Insights Thoughts Tools & Resources Home About Us About Nine Feet Tall Our People Talan Data & AI What We Do Transformation Strategy Technology Roadmap Technology Selection Solution Implementation Digital Adoption ERP Planning ERP Systems Selection ERP Programme Health ERP Transformation ERP Adoption Portfolio Design Project & Programme Management Programme Health & Recovery PMO Programme Assurance Change Management Cultural Change Organisational Design Business Readiness Change Leadership Target Operating Model Process Optimisation Business Analysis Benefits Realisation Continuous Improvement Sectors Construction Project Consulting Consumer Goods Financial Housing Insurance Legal Retail Third Sector Insights Consultancy Insights Tools & Resources Thoughts Case Studies Careers Contact Home / About Us About Us On this page: Our vision Methodology Our values Our promise Get in touch Contact Us We are passionate about delivering our clients’ vision Nine Feet Tall specialises in delivering complex change combining the power of technology and people.​ We design solutions with implementation in mind so change can be delivered successfully. Our focus is on achieving real results for our clients making them more profitable, agile and competitive. ​ ​We take away the pain and anxiety of change and instead we make this a positive journey with minimal disruption, building capability and delivering lasting change. From design, implementation and optimisation our proven methodology underpins all stages of the change life cycle. We strike the right balance of ‘just enough governance’ ensuring the right level of control and transparency without unnecessary bureaucracy sacrificing speed of delivery. Our methodology is tried and tested and fully customisable to your project. Our people are our most valued asset. They are what set us apart and makes us inspiring to work with. Our talented team bring a balance of technical project expertise combined with an understanding of how to take your people on the journey with effective communication and engagement techniques. We deliver significant return on investment for leading brands such as Danone, John Lewis, Barclays and DAC Beachcroft. Recent McKinsey studies show that 85% of organisations can no longer win through strategy alone – success is all about effective execution. This is where Nine Feet Tall comes in – we enable our clients to go from strategy, to design and execution on time and on budget. Who we are Our Vision: A world where change is embraced and people maximise their talents to make a difference. Our Mission: To remove uncertainty, fear and anxiety from change and create an environment where people can flourish. What we do: We deliver complex change. Methodology We have developed a tried and tested project management methodology that we use on all our engagements. That is why we deliver change that sticks. Our methodology is a living, breathing, continually evolving framework, underpinned by a set of tools and templates which you can use and adapt for each stage of the project. Originally centred in Prince2, but taking a light and ‘Just Enough’ governance approach, it also integrates with the latest thinking on Agile to accelerate the delivery of benefits. The key success of our approach is that the people element of change is at the heart of the methodology. A History of Nine Feet Tall Our Values We are united by our values. They guide how we work with our clients and each other. Excellence We exceed expectations and deliver results People Focus We embrace the power and potential of people Integrity We do the right thing and are accountable for our actions Passion We believe in what we do Our Promise We believe everyone should be given the opportunity to feel Nine Feet Tall. Our mission is to create a world where change is embraced, and there’s no change which matters more than the creation of a fairer and more equal society. As a values-led organisation, we have always strived to create a culture which celebrates equality and diversity, but we recognise that we need to do more. With this in mind, we have designed a strategy which will take us towards a more equal, diverse, and inclusive future. Our Vision For Equality, Inclusivity and Diversity At Nine Feet Tall our mission is to create an environment where people can flourish. To achieve this, we put people at the heart. We strive to have an inclusive environment where people feel able to truly be who they are and can maximise their talents. We expect people to treat each other equally, honestly and with respect. We want to nurture a culture where diverse perspectives are embraced and help us be more creative, innovative and achieve excellence in all we do for our team, clients and partners. What does this mean? Intentions are all well and good, but it is the deliverables which count. We have committed to: Partnering with specific schemes and events which support diversity and equality. Providing diversity and inclusion training to all employees. Reviewing and analysing our current workforce demographics and creating an approach to address areas of underrepresentation through our future recruitment. Educating our team through an inclusivity calendar which celebrates events from different communities and faiths. Showing transparency of our progress through periodic articles. Volunteering at community initiatives throughout the year to learn from them and share our skills. Each team member has two days to invest their time in local social or environmental projects. Sharing our thinking and approach to equality, diversity and inclusivity with our clients and partners. Awards & Accreditations We are Nine Feet Tall and help our clients reach new heights. We can drive the change you need to stay ahead of the curve – ask us how. Contact Us Submit About Us Our People Talan Data & AI Services Digital Transformation ERP Implementation Programme Management Managing Change Business Optimisation Sectors Retail Consumer Goods Housing Construction Legal Insurance Financial Third Sector Contact Us info@ninefeettall.com 020 3126 4412 © 2025 Nine Feet Tall Cookies Policy Privacy Policy Terms of Business"
    },
    {
      "url": "https://www.wrestling-online.com/wwe/takers-six-feet-under-podcast-relaunches-with-new-co-host-under-wwe-banner/",
      "text": "Taker's Six Feet Under podcast relaunches with new co-host under WWE banner Facebook Instagram RSS TikTok Twitter WhatsApp Youtube NEWS WWE AEW TNA General TV Reports Website Opinion Articles Press Releases NEWS ALERT MOBILE APPS iOS Android TV RATINGS ADVERTISING Search NEWS WWE AEW TNA General TV Reports Website Opinion Articles Press Releases NEWS ALERT MOBILE APPS iOS Android TV RATINGS ADVERTISING type here... Search Facebook Instagram Mail RSS TikTok Twitter WhatsApp Youtube NEWS WWE AEW TNA General TV Reports Website Opinion Articles Press Releases NEWS ALERT MOBILE APPS iOS Android TV RATINGS ADVERTISING type here... Search Facebook Instagram Mail RSS Twitter Youtube - 0 Taker’s Six Feet Under podcast relaunches with new co-host under WWE banner Share Facebook Twitter Pinterest WhatsApp Linkedin ReddIt Email Print Telegram LINE By Colin Vassallo 06/13/2025 The Undertaker’s podcast Six Feet Under has been relaunched under the WWE/Fanatics brand with one big change: a new co-host. Undertaker’s previous co-host was Matthew Lyda from the Nine Line Apparel company, but this time around, he will have an even more familiar face…his wife and fellow WWE Hall of Famer Michelle McCool. Taker’s podcast now joins Stephanie McMahon’s, Cody Rhodes’, and the Raw Recap under the new partnership between WWE and Fanatics. The first episode – which the husband and wife team talk about The Deadman’s in-laws, McCool’s in-ring career, how they met, Undertaker’s WrestleMania health scare and more – is available now. Discover more from Wrestling-Online.com Subscribe to get the latest posts sent to your email. Type your email… Subscribe Tags Michelle McCool The Undertaker WWE podcast Share Facebook Twitter Pinterest WhatsApp Linkedin ReddIt Email Print Telegram LINE Previous article July 22 episode of NXT to take place from Houston, Texas Next article Summer Blockbuster rating for 06/11/2025 Colin Vassallo https://www.wrestling-online.com Colin Vassallo has been editor of Wrestling-Online since 1996. He is born and raised in Malta, follows professional wrestling and MMA, loves to travel, and is a big Apple fan! Stories you might also like RELATED Recommended to you The Undertaker actively helping backstage at AAA shows The Undertaker takes out Trick Williams on NXT The Undertaker to appear on NXT tonight The Undertaker to appear on NXT next week live from Houston LATEST NEWS WWE 09/06/2025 Wade Barrett says he’s taking some pre-booked time off and will return to commentary After a report came out that Wade Barrett has been removed from the WWE main roster commentary teams, Barrett... AEW 09/06/2025 Bryan Danielson joins the AEW Dynamite commentary team Bryan Danielson has joined the AEW Dynamite commentary team on a full-time basis and will start his new role... WWE 09/06/2025 AJ Lee merchandise available on WWE Shop As you can probably guess, it did not take long for WWE Shop to start selling AJ Lee merchandise!\r\n\r\nRight... © Copyright - 1998-2024 WRESTLING-ONLINE.COM / COLIN VASSALLO CONTACT: editor@wrestling-online.com ADVERTISING: advertising@wrestling-online.com Discover more from Wrestling-Online.com Subscribe now to keep reading and get access to the full archive. Type your email… Subscribe Continue reading Go to mobile version"
    },
    {
      "url": "https://sixfeetup.com/contact-us",
      "text": "Contact Us â Six Feet Up Contact Us â 24/7 â Search Advisory App Dev AI/ML Big Data Cloud Projects Blog CategorY AI/ML AWS Best Practices Other pages Big Data Cloud Django utility Open Source Plone Python Ready to discuss a Project? Let's Talk Company CategorY Who We Are Our IMPACTFUL Mission Technologies We Love Our Flex6â¢ Process Other pages Careers News Events 25th Anniversary utility BESTâ¢ Scafâ¢ TechX Contact Us Premium Ready to discuss a Project? Let's Talk CONTACT US Looking to gain a competitive advantage through technology? Need support on an existing project? Our expert developers would love to help! How can we assist you? I am a... (please select) I am an existing client I am a new client Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. Name Email Address Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. Tell us about yourself. Is this an emergency? Yes No What is your message? I consent to having this website store my submitted information so Six Feet Up can respond to my inquiry. Do not check if you are human A member of our team will contact you to schedule a Project 5â¢ meeting. A Project 5â¢ meeting is a 30-minute Zoom conversation where we determine how we can best assist you. Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. How can we assist you in reaching your objectives? My objective is to... Tell us about your idea/project. I want to... What expertise is needed for the project? When would you like to start this project? Within 30 days Within 60 days In 60+ days How much have you budgeted for this project? Less than $100k $100k - $300k $300k - $1m $1m+ Iâm looking to start with a Game Plan phase to determine the necessary budget Tell us about yourself. How did you hear about Six Feet Up? I consent to having this website store my submitted information so Six Feet Up can respond to my inquiry. Do not check if you are human A member of our team will contact you to schedule a Project 5â¢ meeting. A Project 5â¢ meeting is a 30-minute Zoom conversation where we determine how we can best assist you. Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. HEADQUARTERS Six Feet Up, Inc. 11208 Windermere Blvd. Fishers, IN 46037 - USA PHONE Toll-free: +1 866-SIX FEET (749.3338) or +1 317.861.5948 Contact Us Six Feet Up, Inc. 11208 Windermere Blvd. Fishers, IN 46037 - USA Phone: +1 (317) 861-5948 Email: Â info@sixfeetup.com HEAR FROM US No spam, ever. Your information will only ever be used for Six Feet Up news. Success! Oops! Something went wrong. Try again! ADVISORY | APP DEV | AI/ML | BIG DATA | CLOUD | PROJECTS | BLOG | COMPANY Â© 2025 Six Feet Up, Inc. All rights reserved. PRIVACY POLICY This website places cookies on your device to give you the best user experience. By using our website, you agree to the placement of these cookies. To learn more, read our Privacy Policy. Accept and Close"
    },
    {
      "url": "https://blog.hootsuite.com/social-media-image-sizes-guide/",
      "text": "Social media image sizes for all networks [September 2025] Skip to content Search Free Trial Log In Start your free trial Blog Open main navigation menu Topics Analytics Video Engagement Experiments Listening Influencer marketing Scheduling Advertising Benchmarks Employee advocacy Content creation Explore all Networks Instagram Facebook TikTok LinkedIn X/Twitter YouTube Explore all Resources Free Tools Glossary Templates Webinars Hootsuite Labs Hootsuite Academy Industries Government Healthcare Education Financial services Nonprofit Real estate Legal Explore all About Hootsuite Pricing Why Hootsuite What’s new Explore all English Español Deutsch Français Strategy Social media image sizes for all networks [September 2025] The most recent image sizes for different social media networks, including Instagram, X, Facebook, LinkedIn, TikTok, Bluesky, and more. Christina Newberry September 4, 2025 10 min read Also available in Español Deutsch Français Table of Contents Quick social media image sizes Instagram image sizes X (f.k.a. Twitter) image sizes Facebook image sizes LinkedIn image sizes Pinterest image sizes Snapchat image sizes YouTube image sizes TikTok image sizes Bluesky image sizes Threads image sizes Social media image sizes seem to change … a lot. Never mind the confusion of new social platforms emerging, with their own content specs and aspect ratios. It doesn’t help that information about official dimensions and image sizes is surprisingly scarce. So what’s the big secret? The lack of official image guidelines is likely directly tied to the frequency of image guideline changes. The platforms don’t want to invest the time and energy to constantly update their image guidelines for end users. Fortunately, dear reader, we have invested that time and energy for you to create this comprehensive (and up-to-date) cheat sheet listing social media image sizes on all important social media platforms! Below are the most recent social media image dimensions, as of September 2025. Quick social media image sizes We go into more detail for every single network below, but this image includes the social media image sizes you probably look up most often. Basic Instagram image sizes Profile photo: 320 x 320 px Landscape: 1080 x 566 px Vertical: 1080 x 1350 px Square: 1080 x 1080 Stories and Reels: 1080 x 1920 Basic Facebook image sizes Profile photo: 196 x 196 px Landscape: 1080 x 566 px Vertical: 1080 x 1359 px Square: 1080 x 1080 px Stories and Reels: 1080 x 1920 px Cover photo: 851 x 315 px Basic X (formerly Twitter) image sizes Profile photo: 400 x 400 px Landscape: 1280 x 720 px Vertical: 720 x 1280 px Square: 720 x 720 px Cover photo: 1500 x 500 px Basic LinkedIn image sizes Profile photo: 400 x 400 px Landscape: 1200 x 627 px Vertical: 720 x 900 px Square: 1200 x 1200 px Cover photo: 1128 x 191 px Basic TikTok image sizes Profile photo: 20 x 20 px Landscape (ad): 1920 x 1080 px Vertical: 1080 x 1920 px Square (ad): 640 x 640 px Stories: 1080 x 1920 px Instagram image sizes Instagram supports horizontally and vertically oriented images well as square images. Well, sort of. You can still use all of these photo orientations in your posts, and that’s how they’ll appear in the Instagram feed. But they will all be displayed with a vertical crop on your Instagram grid. This makes image dimensions a little tricky to get right, especially if you want to control the look of your grid as a cohesive whole. Follow these guidelines to make sure your images end up looking their best. Instagram profile picture size: 320 x 320 pixels Instagram profile photos are displayed at 110 x 100 pixels, but the image files are stored at 320 x 320 pixels, so make sure to upload an image that’s least that big. Even though the dimensions are in a square format, Instagram profile photos are displayed as a circle. Make sure any elements you want to focus on in the photo are centered so they don’t get cropped out. Instagram post sizes: Landscape image: 1080 x 566 pixels (feed) / 1012 x 1350 (grid) Vertical image: 1080 x 1350 pixels (feed) / 1012 x 1350 (grid) Square image: 1080 x 1080 pixels (feed) / 1012 x 1350 (grid) Carousel images: 1080 x 1350 pixels (feed) / 1012 x 1350 (grid) Supported aspect ratios: Anywhere between 1.91:1 and 4:5 (feed) / 3:4 (grid) Recommended image size: Width of 1080 pixels, height between 566 and 1350 pixels Tips: If you want your images to look their best on Instagram, aim to upload an image that is 1080 pixels wide. When you share an Instagram image that’s sized over 1080 pixels, Instagram will size it down to 1080 pixels. If you share a photo that has a resolution lower than 320 pixels, Instagram will size it up to 320 pixels. If your image is between 320 and 1080 pixels wide, Instagram will keep that photo at its original resolution, “ as long as the photo’s aspect ratio is between 1.91:1 and 4:5 (a height between 566 and 1350 pixels with a width of 1080 pixels).” If you upload an image using a different ratio, the platform will automatically crop your photo to fit a supported ratio. Remember that all photos appear in vertical format on your grid. Resource: Learn how to edit Instagram photos like a pro . Instagram Stories image size: 1080 x 1920 pixels This is an aspect ratio of 9:16. The “safe area” is 1080 x 1610 pixels. Make sure to keep important content within that area of the frame. Resource: Take your Instagram Stories to the next level with these free templates . Instagram Reels sizes: 1080 x 1920 pixels (feed) / 1080 x 1440 pixels (grid) The feed aspect ratio is 9:16, while the grid view is 3:4. Instagram ads image sizes: Landscape: 1080 x 566 pixels Vertical: 1080 x 1350 pixels Square: 1440 x 1440 pixels Minimum width: 500 pixels Minimum height: 400 pixels Supported aspect ratios: Anywhere between 1.91:1 and 4:5 Image size for Instagram Stories ads: 1440 x 2560 pixels This is a 9:16 ratio. Instagram recommends leaving roughly “14% (250 pixels) of the top and 20% (340 pixels) of the bottom of the image free from text, logos, or other key creative elements” to prevent them from being covered. Instagram Reels ads size: 1440 x 2560 pixels This is a 9:16 ratio. Instagram recommends leaving roughly “14% of the top, 35% of the bottom, and 6% on each side … free from text, logos, or other key creative elements” to prevent them from being cropped or covered. X (f.k.a. Twitter) image sizes With its new video tab, X is clearly embracing a multimedia experience on the platform. Adding images to your X posts can help you stand out from the crowd. Pssst: This isn’t a video size post, but we will tell you that the recommended aspect ratio for the new X video tab is 9:16 with a minimum resolution of 720 x 1280. X (Twitter) image sizes for profile photos: 400 x 400 (recommended) Maximum file size: 2 MB. X header photo size: 1500 x 500 pixels (recommended) The way header images display changes depending on the monitor and browser being used. Even with the recommended dimensions, 60 pixels can be cropped from the top and bottom. X images sizes for in-stream photos: Landscape image: 1280 x 720 pixels Vertical image: 720 x 1280 pixels Square image: 720 x 720 pixels GIF: 1280 x 1080 pixels Tips Recommended aspect ratio: 16:9 or 1:1 Supported formats: GIF, JPG and PNG Maximum file size: Up to 5MB for photos and GIFs on mobile. Up to 15MB on the web. X image sizes for ads: Image ad with app buttons, website buttons, or polls: 800 x 418 pixels (1.91:1) or 800 x 800 (1:1) pixels. Square images in ads with polls will crop to 1.91:1 in mobile timeline. Image ad with conversation buttons: 800 x 418 pixels (1.91:1). Standalone image ads: 1200 x 1200 pixels (1:1) or 1200 x 628 pixels (1.91:1). Carousel image ads: 800 x 418 pixels (1.91:1) or 800 x 800 (1:1) pixels. All images in the carousel must use the same aspect ratio. Collection ads: 800 x 800 pixels (1:1), max 3 MB. Resource: Find more information here on how to advertise on X (Twitter) . Facebook image sizes Facebook is a tricky platform, because image sizes differ from desktop to mobile, and Facebook users are inclined to use both. (Facebook.com is the world’s third-most popular website .) We’ve got you covered on both fronts here. Facebook profile picture size: 196 x 196 pixels (recommended) Display size desktop: 176 x 176 pixels. Display size smartphone: 196 x 196 pixels. I mage sizes for Facebook cover photo: 851 x 315 pixels (recommended) Display size desktop: 820 x 312 pixels Display size smartphone: 640 x 360 pixels Minimum size: 400 x 150 pixels Ideal file size: Less than 100KB Tips To avoid any compression or distortion, upload a JPG or PNG file. Use the recommended pixel sizes for the fastest load times. Profile pictures and cover photos with logos or text work best when uploaded as a PNG file. Don’t drag to reposition once you’ve uploaded your cover photo. Resource: Get more tips on creating a great Facebook Page . Facebook timeline photo and post sizes: Landscape image: 1080 x 566 pixels (1.91:1) Vertical image: 1080 x 1359 pixels (4:5) Square image: 1080 x 1080 pixels (1:1) Facebook image sizes for Facebook Stories: 1080 x 1920 pixels (recommended ) Facebook Stories take up the full screen of a phone. That’s an aspect ratio of 9:16. Max file size is 30 MB. I mage sizes for Facebook ads: Facebook Feed ad: 1440 x 1440 pixels (1:1) or 1440 x 1800 pixels (4:5). Minimum size 600 x 600 pixels. Maximum file size of 30 MB. Facebook Search: At least 1080 x 1080 pixels. Ratio 1.91:1 to 1:1. Maximum file size of 30 MB. Facebook Marketplace image ads: Minimum 1080 x 1080 pixels (1:1). Maximum file size of 30 MB. Sizes for Facebook Right Column ads (desktop only): At least 1080 x 1080 pixels. Ratio 1:1. Image size for Facebook Stories ads: 1440 x 2560 pixels This is a 9:16 ratio. Maximum file size 30 MB. Facebook recommends leaving roughly “14% (250 pixels) of the top and 20% (340 pixels) of the bottom of the image free from text, logos, or other creative elements” to prevent them from being covered. Facebook Reels ads size: 1440 x 2560 pixels This is a 9:16 ratio. Facebook recommends leaving roughly “14% of the top, 35% of the bottom, and 6% on each side … free from text, logos, or other key creative elements” to prevent them from being cropped or covered. Resource: Here’s more info on how to advertise on Facebook . LinkedIn image sizes Just to keep things spicy, LinkedIn switches some image sizes up between personal profiles and company pages. You’ll find them all here. LinkedIn image sizes for personal p rofiles : Linkedin profile photo: 400 x 400 pixels or larger (recommended). Maximum 7680 x 4320 pixels or 8MB. Cover photo: 1584 x 396 pixels (recommended). Aspect ratio: 4:1. Maximum 8 MB. Tips Cover photos are cropped differently on mobile and desktop. Make sure to view your profile on both kinds of display before finalizing. LinkedIn image sizes for C ompany P ages: Company logo size: 400 x 400 pixels Page cover image size: 1128 x 191 pixels Life tab main image size: 1128 x 376 pixels Life tab custom modules image size: 502 x 282 pixels Life tab company photos image sizes: 900 x 600 pixels Image size for LinkedIn post with URL: 1200 x 627 pixels (recommended) Minimum width: 200 pixels LinkedIn image sizes for ads: Landscape (desktop and mobile): 1200 x 628 pixels (recommended). Minimum 640 x 360 pixels. Maximum 7680 x 4320 pixels. Max file size 5 MB. Square (desktop and mobile): 1200 x 1200 pixels (recommended). Minimum 360 x 360 pixels. Maximum 1200 x 1200 pixels. Max file size 5 MB. Vertical (mobile only): 720 x 900 pixels (recommended). Minimum 360 x 640 pixels. Maximum 2430 x 4320 pixels. Max file size 5 MB. Carousel: 1080 x 1080 pixels. 2 to 10 images. Max file size 10 MB. Pinterest image sizes Pinterest profile image size: 280 x 280 pixels (recommended) Remember that your profile photo will be displayed as a circle. Pinterest image size for profile cover photo: 800 x 450 pixels ( minimum) This is a 16:9 aspect ratio. Pinterest image sizes for Pins: Recommended size: 1000 x 1500 pixels. Recommended aspect ratio: 2:3. Other available ratios are 9:16, 3:4, 4:5, and 1:1. Max file size: 20 MB for web, 1 GB recommended for app. Tips Stay within the safe zone to make sure your content is fully visible on any device: top 270 px, left 65 px, right 195 px, bottom 790 px. Pinterest image sizes for collections Pins: Aspect ratio: 1:1 (recommended) or 2:3 Recommended size: 1000 x 1000 pixels or 1000 x 1500 pixels Max file size: 10MB Tips This format appears as one main image, above 3 to 24 smaller images. The main image’s ratio can differ from the smaller images, but all the smaller images must have the same aspect ratio. Collections appear in feeds on mobile devices. 1:1 format is recommended. If you choose a different aspect ratio, know that these Pins are cropped from the middle. Collections can also be an ad format on Pinterest. Pinterest image sizes for ads: Image and Shopping ads: 1000 x 1500 pixels (recommended). Aspect ratio 2:3 (recommended). Max file size 20 MB. Carousel ads: 1000 x 1500 pixels (2:3) or 1000 x 1000 pixels (1:1) recommended. Up to 5 images. Resource: Get some advice on how to use Pinterest for business . Snapchat image sizes Snapchat profile picture size: 320 x 320 pixels (minimum) Maximum file size is 2 MB. Snapchat banner image size: 375 x 278 pixels (recommended) You can upload an image up to 375 x 569 pixels, but it will crop to 375 x 278 Maximum file size: 2 MB Snapchat ads image size: 1080 x 1920 pixels (at minimum) Aspect ratio: 9:16 File type: JPEG or PNG Maximum file size: 5 MB Tips Don’t put any important content in the top 150 px or bottom 330 px, to make sure it won’t be covered. Resource: Learn how to use Snapchat for business . YouTube image sizes YouTube profile photo size: 800 x 800 pixels (recommended) Tips Make sure the focus of your photo is centered for best results. Maximum file size is 15 MB. Photos will render at 98 x 98 pixels. YouTube banner image size: 2 560 x 1 440 pixels ( recommended ) Aspect ratio: 16:9 Minimum dimensions 2048 x 1152 At the minimum dimensions, the safe area for text and logos to avoid being cut off is 1235 x 338 pixels Maximum file size: 6 MB YouTube video thumbnail size: 1280 x 720 pixels (recommended) Minimum width is 640 pixels Max file size if 2 MB Use a 16:9 aspect ratio YouTube podcast playlist thumbnail size: 1280 x 1280 pixels (recommended) Use a 1:1 aspect ratio Maximum file size: 10 MB Tips You can’t upload a custom thumbnail for Shorts, but you can select which frame from the video to use as the thumbnail. Resource: How to create a YouTube channel . TikTok image sizes TikTok profile photo size: 20 x 20 pixels (minimum size to upload) We recommend uploading a higher quality photo for future-proofing. TikTok video size: 1080 x 1920 ( recommended ) The ideal aspect ratio for vertical TikTok videos is 9:16. You can post videos with other dimensions, but the platform will add black bars to the top and bottom of the videos so they are full-screen. TikTok ads image sizes: Vertical (recommended): 540 x 960 pixels minimum (9:16) Landscape: 960 x 540 pixels minimum (16:9) Square: 640 x 640 pixels minimum (1:1) Carousel: 1200 x 628 pixels or 640 x 640 pixels or 720 x 1280 pixels. 2 to 35 images. Recommended max file size 100 KB. Profile photo for ads: 98 x 98 pixels (1:1). Max file size 50 KB. Resource: How to get more views on TikTok Bluesky image sizes Bluesky profile picture size: 1000 x 1000 pixels Upload a 1:1 profile photo with the most important part of the image in the center. It crops to a circle. Bluesky banner image size: 3000 x 1000 pixels Bluesky renders the banner image differently on desktop and mobile, so it’s a good idea to check different formats to make sure it looks right on each one. Keep the important information in the center. Bluesky image post size: 1000 pixels (height or width) There is no set image size for Bluesky, but the platform stores image files with the longest side at 1000 pixels. Stick with standard image sizes like 1:1, 9:16, 3:4, or 4:5 for best results. Tips Each post can have up to four images. Each image is limited to 1 MB. Resource: How to use Bluesky for business . Threads image sizes Threads profile image size: 640 x 640 pixels Like most other social platforms, the profile image is cropped to a circle. Threads post image size: 1440 x 1920 (recommended) Minimum width: 320 pixels Maximum width: 1440 pixels Acceptable aspect ratio: 0.01:1 to 10:1. Native aspect ratio is 3:4 Maximum file size: 8 MB Tips Carousel posts can include up to 20 images. Resource: How to use Threads effectively in 2025 Why is it important to get social media image sizes right? Social media marketers need to get many things right when creating visual content for social media. You’ve got to make sure the images you use comply with copyright laws . If you don’t have original imagery, you’ve got to find high-quality stock photos . And you’ve got to figure out how to create images that connect with your audience and inspire them to take action. On top of that, you’ve got to get your social media image sizes right. That’s really important because: It avoids pixelation and awkward image stretching to keep your images looking professional. Photos optimized for each social channel’s feed can help increase engagement. Incorrect sizing could cut off some of your brand’s messaging. It can future-proof your content. Using the right social media image sizes now could mean less work for your brand in the future, when networks change up how images display yet again. When building posts in Hootsuite, you never have to worry about getting the image size wrong. You can upload and refine your images using Canva’s editing tools right inside the Hootsuite dashboard. The very first step of the process is selecting a network-optimized size for your image from a drop-down menu. Here’s how it works: Log in to your Hootsuite account and head to Composer . Click on the purple Canva icon in the bottom right corner of the content editor. Select the type of visual you want to create. You can pick a network-optimized size from the drop-down list or start a new custom design. When you make your selection, a login pop-up window will open. Sign in using your Canva credentials or follow the prompts to start a new Canva account. (In case you were wondering — yes, this feature does work with free Canva accounts!) Design your image in the Canva editor. When you’re done editing, click Add to post in the top right corner. The image will automatically be uploaded to the social post you’re building in Composer. Don’t feel like memorizing all this info? Easily resize your social media images for publication through Hootsuite Composer, which includes up-to-date image dimensions for every social media network. Get started Do it better with Hootsuite , the all-in-one social media tool. Stay on top of things, grow, and beat the competition. Free 30-Day Trial Content creation Guide If you're not reading The Perch ... are you even keeping up? Email Address Subscribe By Christina Newberry Christina Newberry has been writing about digital marketing since the prehistoric days of 2002, when email opt-ins were every marketer's biggest goal. With a deep understanding of how to connect to online audiences, she shifted her focus to social media and has been contributing to the Hootsuite blog since 2016. Read more by  Christina Newberry Related Articles Employee advocacy What is employee advocacy? A guide for marketers in 2025 Content creation Social media strategy B2B social media marketing: 14 strategies for leads and reach Content creation Social media strategy Instagram Stories in 2025: Your guide to boosting engagement Social media strategy Social media tools How to manage multiple Instagram accounts (without losing your mind) The #1 social media tool Create. Schedule. Publish. Engage. Measure. Win. Try free 30-day trial 3,000+ 5-star reviews ★ ★ ★ ★ ★ About Why Hootsuite About us Careers Leadership Customers Newsroom Social impact and DEI Product features Publish Engage Monitor Advertise Analyze Pricing Standard Advanced Enterprise Guides Social Media Marketing Strategy Social Media Analytics Social Listening Best Times to Post Social Media Calendar Social Media Engagement Employee Advocacy Social Media Monitoring Social Media Advertising Resources Academy Resource Library Case studies Webinars App directory Help center Product updates Integrations Partners English English Español Deutsch Français © 2025 Hootsuite Inc. All Rights Reserved. Legal Center Trust Center Privacy Cookie Preferences Accessibility Search Thank You"
    }
  ]
}