{
  "fuentes": [
    {
      "url": "https://admiralgroup.com/",
      "email": "andac@admiralgroup.com"
    },
    {
      "url": "https://admiralgroup.com/",
      "email": "vanessaz@admiralgroup.com"
    },
    {
      "url": "https://admiralgroup.com/",
      "email": "vanessaz@admiralgroup.com"
    },
    {
      "url": "https://admiralgroup.com/",
      "email": "alexandrac@admiralgroup.com"
    },
    {
      "url": "https://admiralgroup.com/",
      "email": "enquiries@admiralgroup.com"
    },
    {
      "url": "https://www.st-group.com/press-media/news-stories/press-releases/new-president-for-general-cigar-and-evp-for-handmade-cigars-globally/",
      "email": "victoria.mckee@st-group.com"
    },
    {
      "url": "https://www.st-group.com/press-media/news-stories/press-releases/new-president-for-general-cigar-and-evp-for-handmade-cigars-globally/",
      "email": "info@st-group.com"
    },
    {
      "url": "https://www.st-group.com/press-media/news-stories/press-releases/new-president-for-general-cigar-and-evp-for-handmade-cigars-globally/",
      "email": "kaspar.bach@st-group.com"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "email": "info@scibpaints.com"
    },
    {
      "url": "https://creeksidecigarco.com/pages/contact-us",
      "email": "info@creeksidecigarco.com"
    },
    {
      "url": "https://store.cigarfederation.com/pages/about-us",
      "email": "service@cigarfederation.com"
    },
    {
      "url": "https://www.admiralcigar.com",
      "email": "karina@admiralcigar.com"
    },
    {
      "url": "https://cigarrights.org/officers-and-directors/",
      "email": "info@cigarrights.org"
    },
    {
      "url": "https://cigarinc.com/pages/about-us",
      "email": "info@cigarinc.com"
    },
    {
      "url": "https://atlanticcigar.com/about-atlantic-cigar/",
      "email": "admin@atlanticcigar.com"
    },
    {
      "url": "https://admiral-sports.com/shop/usa_en/contactus",
      "email": "canadasales@admiral-sports.com"
    },
    {
      "url": "https://admiral-sports.com/shop/usa_en/contactus",
      "email": "sales@admiral-sports.com"
    },
    {
      "url": "https://admirals-club.pissedconsumer.com/customer-service.html",
      "email": "admirals.club@aa.com"
    },
    {
      "url": "https://www.admiralcigar.com/menus",
      "email": "karina@admiralcigar.com"
    }
  ],
  "mails": [
    "admin@atlanticcigar.com",
    "admirals.club@aa.com",
    "alexandrac@admiralgroup.com",
    "andac@admiralgroup.com",
    "canadasales@admiral-sports.com",
    "enquiries@admiralgroup.com",
    "info@cigarinc.com",
    "info@cigarrights.org",
    "info@creeksidecigarco.com",
    "info@scibpaints.com",
    "info@st-group.com",
    "karina@admiralcigar.com",
    "kaspar.bach@st-group.com",
    "sales@admiral-sports.com",
    "service@cigarfederation.com",
    "vanessaz@admiralgroup.com",
    "victoria.mckee@st-group.com"
  ],
  "nombre_sitio": "admiralcigar.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://admiralgroup.com/",
      "text": "Home - Admiral enquiries@admiralgroup.com 020 7877 8500 ✕ Home Job Search Candidate Hub Employer Hub Sectors BEAUTY & FITNESS BUSINESS SERVICES FINANCE & ACCOUNTING HOSPITALITY HR, LEARNING & DEVELOPMENT RESTAURANTS, BARS & PUBS SALES & MARKETING SECURITY SENIOR / EXECUTIVE About OUR TEAM TESTIMONIALS WORK FOR US NEWS REGISTER WITH US REGISTER WITH US RECRUITMENT IS OUR PASSION We are a market leader with over 25 years of experience in permanent and temporary recruitment across the retail, facilities management, security and hospitality sectors, with roles ranging from management to craft-level positions. We are recruiting. Check our vacancy list using the search below. Search for Jobs Recruitment is personal and is often about winning hearts as well as minds. Confidentiality, honesty and relationship-building are the foundations of every client assignment we undertake. We pride ourselves on being long-standing recruitment experts in retail, commercial and hospitality recruitment markets, specialising in permanent, interim and temporary personnel recruitment at all levels. We are a family business, founded by husband and wife team Nick Dixon and Paula Rogers 25 years ago. Read more about our story here: About Admiral What makes us different? Since 1995, we have placed over 138,000 candidates into jobs at successful companies. Our founding values of integrity, agility and compassion have never been more important than they are today. We take the time to get to know clients and candidates. Managing a workplace? Get in touch to find out how we can help Employer Hub How we're supporting our Clients! \"At Mediabrands we love working with Admiral. You are always very helpful and professional. Every time when we need help, even 'immediately', you are doing everything to make it happen which make us extremely grateful. I would especially like to thank Priyanka for her patience, kind words and helpfulness for all this time. You are an absolute star! Thanks to you once again, our work becomes much more pleasant because of Admiral\" Kamila Jaskiewicz, Hospitality Manager - BaxterStorey Mediabrands Get in touch today! “Admiral is certainly an agency like no other! They don’t always get it right but they certainly do try their hardest to do so. It’s my favourite agency to work with, not just because they provide great staff for my business but also because they sort out any issues as soon as they appear. Marieta who looks after our account is certainly a breath of fresh air and a joy to work with”. Flavio, GM - CH&CO Get in touch today \"Rebecca and Olivia have been pivotal in the success of our recruitment program. In an era where recruitment in hospitality is difficult, Admiral Recruitment have assisted us in filling a number of positions in different levels across departments. Instead of being blindly sent CVs, they seek and screen candidates aligned with our values and are fit for the role. This, coupled with their engagement, results in roles being filled in a timely manner with quality staff, minimising disruption to the business and setting us up for success.\" - Daniel Ball, Phyllis Court Members Club Get in touch today Latest News Comments Box SVG icons Used for the like, share, comment, and reaction icons Admiral  Recruitment 1 years ago We are hiring a talented and experienced Beauty Therapist for a luxury beauty and wellness Client, in London If this role sounds perfect for you, please send your CV to: alexandrac@admiralgroup.com or call: 07946111146 ... See More See Less View on Facebook · Share Share on Facebook Share on Twitter Share on Linked In Share by Email View Comments likes 1 Shares: 1 Comments: 0 0 Comments Comment on Facebook Admiral  Recruitment 1 years ago We are recruiting for a high-end Luxury clinic in central London! If this sounds like your level of talent please send your CV to: alexandrac@admiralgroup.com ... See More See Less View on Facebook · Share Share on Facebook Share on Twitter Share on Linked In Share by Email View Comments likes 0 Shares: 0 Comments: 0 0 Comments Comment on Facebook Admiral  Recruitment 1 years ago We are currently recruiting for experienced Chefs for our Busy Season. We have two main Corporate clients looking for superstars to join them Monday to Friday on a 40 hours per week assignment. Canary Wharf and Blackfriars locations. Bookings start on August 27th 2024. Mainly day time shifts, with extra hours available if busy. £18 per hour pay. Email your cv to Andac@admiralgroup.com ... See More See Less View on Facebook · Share Share on Facebook Share on Twitter Share on Linked In Share by Email View Comments likes 1 Shares: 0 Comments: 0 0 Comments Comment on Facebook Admiral  Recruitment 1 years ago 💼Role: Hospitality Supervisor 📍Location: Central London 💰Salary: £35,000 Per annum ⏰Schedule: Full time, Monday - Friday If this sounds like the role for you, Please email your CV to VanessaZ@admiralgroup.com ... See More See Less View on Facebook · Share Share on Facebook Share on Twitter Share on Linked In Share by Email View Comments likes 1 Shares: 0 Comments: 0 0 Comments Comment on Facebook Admiral  Recruitment 1 years ago 💼Role: Waiting Staff 📍Location: 💰Salary: £30,000 per annum ⏰Schedule: Full time If this sounds like the perfect opportunity for you, Please send your cv to Vanessaz@admiralgroup.com ... See More See Less View on Facebook · Share Share on Facebook Share on Twitter Share on Linked In Share by Email View Comments likes 1 Shares: 0 Comments: 0 0 Comments Comment on Facebook Load more Keep Up to Date Subscribe here for our latest news, tips and industry insight Notice: JavaScript is required for this content. Sign up for job alerts Notice: JavaScript is required for this content. Privacy Policy | Modern Day Slavery Statement Copyright The Admiral Group 2020 Privacy Policy | Modern Day Slavery Statement Created by"
    },
    {
      "url": "https://www.st-group.com/press-media/news-stories/press-releases/new-president-for-general-cigar-and-evp-for-handmade-cigars-globally/",
      "text": "NEW PRESIDENT FOR GENERAL CIGAR AND EVP FOR HANDMADE CIGARS GLOBALLY - Scandinavian Tobacco Group Go to content Cookies About us Facts and figures Sustainability Vision and strategy Reports and Documents Management Executive Board Board of Directors Our Brands Governance Our Tobacco Making of Tobacco History of Tobacco Investor Investor Portal News Shareholder information Outlook Financial calendar Annual General Meeting Debt Information Financial Reports Presentations Capital Markets Day 2023 Careers Contact Delivery Instructions Back NEW PRESIDENT FOR GENERAL CIGAR AND EVP FOR HANDMADE CIGARS GLOBALLY Share LinkedIn Facebook Twitter Email Scandinavian Tobacco Group sets new management for its handmade cigar business. Regis Broersma becomes new President of General Cigar Company which is a leader in the US market for handmade and premium cigars. He succeeds Dan Carr who has stepped down and leaves the Group. Regis Broersma (38) is Dutch born and has a comprehensive, international background in sales, marketing and general management. Regis Broersma has worked in the Netherlands, the Czech Republic, Denmark, the UK and the US. Currently, he is Managing Director of STG Germany. Regis Broersma has worked in the cigar industry since 2002 and has a great passion for cigars. In addition, Scandinavian Tobacco Group assigns the responsibility of its entire global handmade cigar businesses to an Executive Vice President. Craig Reynolds assumes this responsibility which includes General Cigar, its international business and Cigars International which is a leading online retailer in the US. Craig Reynolds continues as President for Cigars International. Niels Frederiksen, CEO of Scandinavian Tobacco Group, says: “I am happy to announce Regis Broersma as new President of General Cigar. Regis has the experience and the innovative approach needed to continue the impressive development of General Cigar together with its management team. Our handmade cigar business accounts for 25% of our net sales and is a growth engine of our business. We want to reinforce this development by adding executive management capacity for the entire handmade business globally.” General Cigar holds a leading market position in the US market for handmade cigars. Cigars International has built a leading position in online and catalogue retail sales of handmade cigars in the United States. General Cigar and Cigars International continue to be run as two separate, stand-alone businesses. For further information please contact Director of Group Communications Kaspar Bach Habersaat, kaspar.bach@st-group.com or phone +45 7220 7152. U.S. Media Contact: Victoria McKee/General Cigar Company, Victoria.mckee@st-group.com or phone: +1 732 721 0317 ABOUT GENERAL CIGAR COMPANY General Cigar Co. is a leading manufacturer and marketer of handcrafted cigars for the premium market in the US. The company is owned by Scandinavian Tobacco Group. Committed to delivering cigars of the finest quality, General Cigar’s skilled artisans produce Macanudo®, Cohiba®, La Gloria Cubana®, Partagas®, CAO®, Punch®, Hoyo de Monterrey®, Excalibur® and several other leading premium brands in the company’s Dominican, Honduran and Nicaraguan factories. In addition, the company cultivates proprietary tobacco which is used exclusively in its blends and has a dedicated R&D practice that develops new varieties of tobacco and revitalizes vintage seeds. Based in Richmond, VA, General Cigar sells through wholesalers and retailers in the US. General Cigar also operates Club Macanudo®, a cigar bar in New York City. Read more: www.cigarworld.com . ABOUT SCANDINAVIAN TOBACCO GROUP - a world leading manufacturer of cigars and traditional pipe tobacco - approx. 8,200 employees in the Dominican Republic, Honduras, Nicaragua, Indonesia, Europe, New Zealand, Australia, Canada and the US The Group’s brand portfolio contains more than 200 international, regional and local tobacco brands, including the cigar brands Café Crème, La Paz, Henri Wintermans, Macanudo, CAO, Partagas (US) and Cohiba (US). Pipe tobacco brands include Captain Black, Erinmore, Borkum Riff and W.Ø. Larsen, while leading fine-cut tobacco brands include Bugler, Break, Escort, Bali Shag and Tiedemanns. The Group is ultimately owned by two Danish foundations (51%) – the Augustinus Foundation and Det Obelske Familiefond – and by Swedish Match (49%). Both Danish foundations have been active in the tobacco industry for more than 250 years. Swedish Match is a publicly owned company listed on the Stockholm Stock Exchange. Read more: www.st-group.com . Scandinavian Tobacco Group A/S Sydmarken 42 DK-2860 Søborg Denmark CVR 31 08 01 85 Explore our must-win battles stories FROM ROUGH DIAMOND TO BUSINESS LEADER Read More A DISCIPLINED AND FOCUSED APPROACH TO M&A Read More SEEKING THE SINGLE TRUTH Read More INCREASING EFFICIENCY, TOGETHER Read More Company News Keep up with news and press releases from Scandinavian Tobacco Group by subscribing to our company announcements. Check out our latest news here SUBSCRIBE Quick Links Vision and strategy Governance STG Annual Report 2024 Get In Touch info@st-group.com Contact us © 2019 Scandinavian Tobacco Group A/S Privacy policy Confirm your age To view this website you must be at least 18 years old. I confirm that I am 18 years or older Proceed to website"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "text": "Contact Us: Get In Touch With Asian Paints for your Painting Needs Contact Us: We’d Love To Hear From You 16815 Popular searches Interior Paints Exterior Paints Shade cards SEARCH RESULTS {{searchItem.map.shadeCode}} {{searchItem.map.shadeFamilyName}}: {{searchItem.map.shadeName}} {{searchItem.map.title}} RELATED SEARCH NO MATCHES FOUND! Did you mean? {{spellCheck}} Log-In Hello! Hello! Signout en ar {{minicart.cartcount > 0 ? minicart.cartcount : 0}} ↻ Processing... You have {{minicart.cartcount}} items {{item[\"product\"][\"name\"]}} - + ₹ {{item[\"totalPrice\"][\"value\"]}} Total ₹ {{minicart.totalprice}} Checkout ↻ Menu PAINTS & COLOUR PAINTS & COLOUR Services Services WATERPROOFING WATERPROOFING INSPIRATION INSPIRATION Login/Register PAINTS & COLOUR All PAINTS & COLOUR EXPLORE COLOURS Colour Catalogue Home Colour Guide PAINT PRODUCTS Interior Paints Exterior Paints Waterproofing Wood Paints Metal Paints Undercoats RESOURCES Paint Budget Calculator Ideas Gallery Colour visualizer SERVICES Paint Store Near Me Book Painting Services Services All Services Beautiful Homes Painting Service Scib Stars WATERPROOFING All WATERPROOFING Bathrooms Terrace and Tanks Roof & Basement Interiors Tiling All Products INSPIRATION All INSPIRATION Get Inspired Paint calculator Gallery Colour Next Guides DecorPro Resources Colour Visualizer Ideas Gallery Please enter your mobile number To receive the dealer details on SMS Mobile * SUBMIT Get in Touch We’d love to hear from you Head Office Scib Chemical S.A.E 6th of October Cirt, 4th Industrial (1/3/B)B Tel:            (+202)38281090-99 Fax: (+202)38331271 Scib Paints Helpline* For enquiries, feedback and complaints please call on 16815 or write to us at info@scibpaints.com Mobile number +91 00:59 ↻ ↻ Need help with your painting needs? Fill the form below to book a free site evaluation by a Scib Paints Beautiful Homes Painting Service expert. Name Mobile Number +20 Governorate * Email By proceeding, you are authorizing Scib Paints and its suggested contractors to get in touch with you through calls, sms, or e-mail. Book an appointment ↻ Thank you! We value your interest in Scib Paints Beautiful Homes Service. We will get in touch with you shortly to schedule a visit by an expert. Try again! Oops! Something went wrong. We couldn't process your request. Please try again? Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Our Divisions More about Asian Paints Congratulations You have subscribed. Contact Us 16815 EMAIL ABOUT Research & Technology Careers Contact Us Certificates RESOURCES FAQs POLICIES Quality Policy Customer Policy Cookie Policy Environment Policy EHS Policy TOOLS Colour Catalogue Color with AP APP/Website​ COUNTRY EGYPT Country EGYPT India GLOBAL BANGLADESH MIDDLE EAST FIJI NEPAL SRI LANKA ETHIOPIA CONNECT DOWNLOAD OUR PAINTING APP CONNECT WITH US ©Scib Paints - All rights reserved Congratulations You have subscribed. Welcome User Login OR Continue as guest You have been successfully logged out Login An OTP has been sent to your registered mobile number and email id. 00:00 Resend By clicking submit, I agree to terms and conditions SUBMIT Register Please enter the 5 digit OTP sent via SMS to verify your mobile number! 00:00 Resend I agree to terms and conditions SUBMIT Please enter your mobile number To receive the dealer details on SMS SUBMIT Provide a delivary address Fullname* Email* Mobile* +91 Flat/House No/Floor* Colony/Street/Locality* Landmark City* Pincode* SUBMIT User already exist redirecting you for the login page Waterproofing Calculator Get an instant estimate Calculate now"
    },
    {
      "url": "https://creeksidecigarco.com/pages/contact-us",
      "text": "Get in Touch With Us – Creekside Cigar Co Skip to content Pause slideshow Play slideshow Voted PCA Best of the Leaf 2025 – Cigar Lounge of the Year Voted PCA Best of the Leaf 2025 – Cigar Lounge of the Year . . . Site navigation Search Search Close Creekside Cigar Co Search Account 0 Cart . . . Site navigation Close Search Search Close Cigars New Arrivals Las Calaveras Sampler Foundation Wise Man Lancero Sampler Aganorsa Brand Sampler OZ Family Karatoba Warped Corto Maduro Rojas Blue Bonnet Samplers Crowned Heads Premium Sampler Connecticut Sampler Habano Sampler Maduro Sampler Espresso Pairing Sampler Shop All Samplers Boxes Las Calaveras 2025 Robusto Jeremy Jack El Chapo Warped La Colmena Rodriguez Reserva Privada Avowed 'The Vow' Creekside Customs Latest Release: Frontier Limited Edition HVC Edicion Especiales LE Merch Hats Accessories Watch Our Content Visit the Lounge Hours & Location Membership FAQ Join the Club Search Search Close Goes great with Quick shop Add to cart Crowned Heads Premium Sampler $55 00 $55.00 Quick shop Add to cart Foundation Wise Man Lancero Sampler $60 00 $60.00 Quick shop Sold Out Espresso Pairing Sampler from $65 00 from $65.00 Quick shop Sold Out Best with Bourbon Sampler $70 00 $70.00 Add order note Close Subtotal $0.00 Check out Shipping, taxes, and discount codes calculated at checkout. Your cart is currently empty. Cigars Expand submenu Cigars New Arrivals Expand submenu New Arrivals Las Calaveras Sampler Foundation Wise Man Lancero Sampler Aganorsa Brand Sampler OZ Family Karatoba Warped Corto Maduro Rojas Blue Bonnet Samplers Expand submenu Samplers View all Crowned Heads Premium Sampler Connecticut Sampler Habano Sampler Maduro Sampler Espresso Pairing Sampler Shop All Samplers Boxes Expand submenu Boxes Las Calaveras 2025 Robusto Jeremy Jack El Chapo Warped La Colmena Rodriguez Reserva Privada Avowed 'The Vow' Creekside Customs Expand submenu Creekside Customs Latest Release: Frontier Limited Edition Expand submenu Limited Edition HVC Edicion Especiales LE Merch Expand submenu Merch View all Hats Accessories Watch Our Content Visit the Lounge Expand submenu Visit the Lounge Hours & Location Membership FAQ Join the Club Confirm your age Are you 21 years old or older? No Yes Come back when you're older Sorry, the content of this store can't be seen by a younger audience. Come back when you're older. Oops, I entered incorrectly Hours Sunday: 12pm-9pm Monday: 11am-9pm Tuesday: 11am-9pm Wednesday: 11am-9pm Thursday: 11am-11pm Friday: 11am-11pm Saturday: 11am-11pm Contact 513-630-1044 1381 US-22 Maineville, OH 45039 info@creeksidecigarco.com Lounge Address 1381 US-22 Maineville, OH 45039 Creekside Cigar Co. Privacy Policy Creekside Cigar Co respects your privacy. If you sign up for any of our engagement and outreach programs, including those that use SMS text messaging, we ONLY use information you provide to transmit your mobile messages and, upon request, respond to you directly. This includes sharing information with our program partners, message content providers, phone companies, and vendors who assist us in the delivery of mobile messages. EXCEPT AS SET FORTH IN THIS SECTION, WE DO NOT SELL, RENT, LOAN, TRADE, LEASE OR OTHERWISE TRANSFER FOR PROFIT ANY PHONE NUMBERS OR CUSTOMER INFORMATION COLLECTED THROUGH PROGRAMS TO ANY THIRD PARTY. We do reserve the right at all times to disclose any information as necessary to satisfy any law, regulation or governmental request, to avoid liability, or to protect our rights or property. When you complete forms online or otherwise provide us information at point of sale, you agree to provide accurate, complete, and true information. Subscribe today to hear first about our sales Enter your email Subscribe Subscribe Shop Cigars Merch Visit the Lounge Watch our Content Join the Club Customer Care Manage Subscriptions Contact Us FAQ Return Policy Shipping Policy My account About About Us Visit the Lounge Get in touch Email us Follow us Facebook Instagram TikTok YouTube We accept American Express Apple Pay Diners Club Discover JCB Mastercard Visa © 2025\n              Creekside Cigar Co\nNamed Lounge of the Year by PCA Best of the Leaf Awards 2025, located in Cincinnati, Ohio Privacy Policy Terms of Service Get in Touch With Us"
    },
    {
      "url": "https://store.cigarfederation.com/pages/about-us",
      "text": "About Us – Cigar Federation 🔥NEW! CIGAR OF THE MONTH UNDER $6 SAMPLERS FACTORY DIRECT BOUTIQUES CigFed TOBACOS Log in Search Contact service@cigarfederation.com Facebook Twitter Instagram 🇺🇸 JOIN THE #1 CIGAR OF THE MONTH CLUB IN THE USA! 🇺🇸 Menu Search Cart 🔥NEW! CIGAR OF THE MONTH UNDER $6 SAMPLERS FACTORY DIRECT BOUTIQUES CigFed TOBACOS Log in Cart ( 0 ) Search About Us We carry the finest selection of boutique, rare, and hard to find cigars on the market. Through our partnership with Delaware Cigars we have access to the most sought after cigars in the world. We really have two goals. First, is to make sure you have the absolute best experience if you choose to purchase anything from us. Second, is to carry the cigars you have heard about, but can't get at your local cigar shop. We add new cigars weekly, so check back often. If there are cigars you would like to see us carry, please use the “Contact Us” widget on the right side of the page. Also, you can email us directly at service@cigarfederation.com CIGAR FEDERATION E-MAIL BLASTS! Get all the latest on SALES, SPECIALS, and NEW RELEASES! Email Subscribe Quick Links REVIEWS FAQ's Privacy Policy Sitemap Community Track My Order Terms of Service Contact Us You can contact us by emailing our service team at service@cigarfederation.com. We work Monday-Friday 9AM to 4PM Central Time. Emails are answered ASAP! Never miss a new release. Text CigFed to 817-391-9272 Get CONNECTED Facebook Twitter Instagram American Express Diners Club Discover JCB Mastercard PayPal Venmo Visa POS and Ecommerce by Shopify © 2025, Cigar Federation Close (esc) 🚨HEY, YOU WANT A $100 GIFT CARD?🚨 SIGN UP AND GET THE LASTEST ON SALES, SPECIALS, and NEW CIGAR RELEASES! (PLUS A CHANCE TO WIN $100!) Subscribe Age verification By clicking enter you are verifying that you are old enough to consume alcohol. Enter Search Search Main Menu 🔥NEW! CIGAR OF THE MONTH UNDER $6 SAMPLERS FACTORY DIRECT BOUTIQUES CigFed TOBACOS Shopping Cart Your cart is currently empty. Shop now"
    },
    {
      "url": "https://www.admiralcigar.com",
      "text": "Admiral Cigar Club top of page HOME ABOUT MENU EVENTS MAILING LIST CONTACT More... Use tab to navigate through the menu items. One of the City's Most Attractive Cigar Bars Admiral Cigar Club is designed to offer you an inviting and familiar place to unwind and connect with others who share your tastes and level of sophistication. As our guest, we are here to help you carefully select a cigar that’s right for you. Our resident tobacconist has extensive knowledge about the many offerings available and is ready to assist in making the right choice for you or as gifts for the cigar smokers in your life. We invite you to come by and stay awhile as you unwind and enjoy an original experience that only Admiral Cigar Club can offer. - LOCATION - 4940 New Broad Street Orlando, FL 32814 (407) 637 - 5236 - HOURS - Monday: 4 pm - 12 am Tuesday: 4 pm - 12 am Wednesday: 4 pm - 12 am Thursday: 4 pm - 12 am Friday: 4 pm - 1 am Saturday:  1 pm - 1 am Sunday : 1 pm - 11 pm - RESERVATIONS - To rent our space for a party please email us at: karina@admiralcigar.com ABOUT Our Cigars MENU Our Liquor, Craft Beers & Wines MENU Ladies Night EVERY WEDNESDAY NIGHT Ladies night out every Wednesday night! 50% off beer and wine starting at 7pm ​ Join the club & GET UPDATES ON SPECIAL EVENTS OR INQUIRE ABOUT BECOMING A MEMBER Subscribe Now NEWS JOIN US CONTACT ADMIRAL CIGAR CLUB LOCATION & HOURS 4940 New Broad Street Orlando, FL 32814 (407) 637 - 5236 ​ Monday: 4 pm - 12 am Tuesday: 4 pm - 12 am Wednesday: 4 pm - 12 am Thursday: 4 pm - 12 am Friday: 4 pm - 1 am Saturday:  1 pm - 1 am Sunday : 1 pm - 11 pm RESERVATIONS To rent our space for a party please email us at: karina@admiralcigar.com JOBS ©2016, Proudly created with Concept Management Group Should you wish to join our team contact us at: karina@admiralcigar.com ​ ​ bottom of page"
    },
    {
      "url": "https://cigarrights.org/officers-and-directors/",
      "text": "Board Members - Cigar Rights Skip to content Home About Us Officers & Directors Sponsors Executive Team Ambassadors Cigar News Cigar News Legislative News Regulatory News Legal News General Interest International News Judge Mehta’s Decision H.R. 2111 Resources Cigar Events Find Great American Cigar Shops Premium Cigar Retailer Resources Join CRA Become an Individual Member Join as a Great American Cigar Shop Join as a Cigar Manufacturer Take Action Actions FAQs Find Legislator Sign Up Voting Tools Donate to CRA Individual Donations Manufacturers Contact Us CRA Officers and Directors Board members support CRA members and all facets of the cigar industry Click Here to Donate to CRA Today! Officers and Directors The Cigar Rights of America (CRA) Board of Directors consists of some of the most respected figures in the premium cigar industry. Serving in a volunteer capacity, these leaders bring an unparalleled dedication and commitment to their roles. Their devotion to the craft, coupled with their extensive expertise, shapes CRA's mission to protect the rights of cigar enthusiasts. Their leadership, guidance, and steadfast financial support are crucial in ensuring the continued growth and vitality of the industry, embodying a true passion for preserving the rich tradition of premium cigars. Robert Levin Chairman Emeritus Owner, Ashton Distributors Robert Levin, the President of Holt’s Cigar Holdings, has a 50-year career in the cigar industry, spanning both retail and wholesale. His journey began by sweeping the floors of his father’s landmark cigar store in Philadelphia, Holts. In the 1970s, Robert took over the family business and led a significant transformation in the 1980s by introducing the iconic Ashton brand. Founded in 1985, Ashton Distributors, Inc., a family-owned company headquartered in Philadelphia, embodies the tradition of the premium cigar industry with a commitment to quality and customer satisfaction. Cory Bappert Vice President CEO, Oliva Cigar Company With over 16 years in the cigar industry, Cory Bappert is the CEO of Oliva Cigars, a leading global premium and cigar manufacturer. Cory joined Oliva Cigars in 2006 as Vice President of Sales and has driven the company's growth, expanding its market presence and reputation for quality. Drew Newman Secretary Owner, J.C. Newman Cigar Company Drew Newman continues the tradition started by his great-grandfather in 1895 as a fourth-generation leader of J.C. Newman Cigar Company, America’s oldest family-owned premium cigar manufacturer. Before fully joining the family business, Drew worked as Chief of Staff for a national nonprofit and as Legislative Director at the Council of the District of Columbia. He holds a Bachelor of Arts from Williams College and a Master of Public Policy from Princeton University, positioning him well to lead J.C. Newman Cigar Company into the future. Gary Pesh President & Treasurer Owner, Old Virginia Tobacco Company Gary Pesh has over 40 years in the tobacco business, starting in 1980 at the family business, Tobacco Barns. He expanded the business from three stores to seven and rebranded it as Old Virginia Tobacco Co., where he now serves as president. A former city councilman in Roundhill, VA, Gary has served on multiple boards, including IPCPR (now the Premium Cigar Association) , where he became president. Since 2009, Gary has been an active member of the Cigar Rights of America board, advocating for the rights of cigar enthusiasts and the industry. Throughout his career, Gary has exemplified dedication, leadership, and a passion for the cigar industry. His contributions have not only strengthened his own business but have also had a lasting impact on the broader cigar community. Carlito Fuente Owner, A. Fuente Cigars Carlos \"Carlito\" P. Fuente, Jr. is a third-generation cigar artisan and the Chairman of A. Fuente & Company. The company, founded in 1912 by his grandfather, started with cigars crafted in the family's home. Today, A. Fuente & Company produces and distributes millions of cigars annually. Carlito, along with his father, transformed A. Fuente & Company from its beginnings in Ybor City, Florida, into a globally recognized manufacturer of premium hand-rolled cigars. Carlito co-founded, along with Newman family, the Cigar Family Charitable Foundation, recognized by the United Nations for its community impact in the Dominican Republic, which includes a K-12 school, community kitchen, medical and dental clinics, sports facilities, an organic farm, and infrastructure enhancements. Pete Johnson Owner, Tatuaje Cigars Inc | Havana Cellars Pete Johnson entered the tobacco industry in 1993, starting in retail in Los Angeles, California. In 1997, he became the Director of Retail for Grand Havana Enterprises. Pete's passion for cigars led him to start his own line, Tatuaje, in 2003, collaborating with Jose \"Pepin\" Garcia of My Father Cigars. Tatuaje quickly gained popularity, establishing Pete and his brand as significant players for the next generation of cigar industry leaders. Jorge Padrón Owner, Padrón Cigar Company Jorge Padrón is a key figure in the premium cigar world, representing Padron Cigars. Raised in a family dedicated to tobacco cultivation and cigar craftsmanship, Jorge learned the intricacies of cigar production from his father, Jose Orlando Padron. Under his leadership, Padron Cigars expanded globally, maintaining a commitment to quality and authenticity. Jorge's work has earned Padron Cigars numerous accolades and a devoted following. His dedication ensures the Padron name remains synonymous with high-quality cigars. Sathya Levin CEO, ASHTON Distributors Sathya Levin is the second generation leader of Ashton Cigars with his father, Robert Levin. Ashton Cigars, founded in 1985, is known for producing premium cigars of high quality. Throughout his career, Sathya has been instrumental in driving the growth and success of Ashton Cigars. His leadership has ensured that the company remains at the forefront of the industry, known for its innovation, quality, and integrity. Sathya's deep knowledge of the cigar business, combined with his strategic vision, has helped Ashton Cigars maintain its position as a leader in the market. Rocky Patel Owner, Rocky Patel Cigars Rocky Patel is a prominent figure in the cigar industry, known for his dedication to perfection. Introduced to cigars in the early 1990s while practicing law in Los Angeles, Rocky developed a deep interest in cigars. He ventured into cigar manufacturing during the boom, finding success with Indian Tabac cigars rolled in Honduras. In 2003, he rebranded his company to Rocky Patel Premium Cigars. Known for his hard work, Rocky's mission is to share his passion for exceptional cigars with enthusiasts worldwide. Tony Gomez La Flor Dominicana Tony Gomez is the newest addition to CRA's board and we are proud to have La Flor Dominicana represented on our board once again. Tony brings a literal lifetime of experience with him, having watched his father Litto, and his business partner and spouse Inez, grow La Flor Dominicana from the ground up during Tony's childhood. We value the enthusiasm, experience, and intellect that Tony brings to the CRA board. Directors Emeriti Carlos Fuente, Sr. (1935-2016) President (Former) of Arturo Fuente Cigars and Founding Manufacturer Member of CRA From a humble beginning in Ybor City, Florida, making cigars from his parents' home, Fuente Sr. built Fuente into an international powerhouse, with its cigars known and revered the world over. His company today makes more than 30 million cigars a year in Santiago, Dominican Republic, all of them by hand. Carlos was in the cigar business his entire life. Together with his son, Carlito, he managed all aspects of the worldwide Fuente cigar manufacturing businesses. Jeff Borysiewicz President and Founder, Corona Cigar Co. & Florida Sungrown, LLC and Founding Retailer Member of CRA Jeff Borysiewicz is the founder and CEO of Corona Cigar Company and Florida Sungrown, LLC. In 2008, following a hard-fought legislative battle, Jeff, along with Keith Park, founder & CEO of Prometheus International, realized that the premium cigar industry lacked a true advocate in Washington, DC. This led to the creation of Cigar Rights of America (CRA). From 2008 to 2014, Jeff served as chairman of CRA. During his leadership, CRA grew from a small operation to an industry leader in tobacco policy. Today, CRA is the most prominent voice for premium cigar advocacy in Washington, DC. Keith Park Founder and CEO of Prometheus International and God of Fire Cigars and Founding Manufacturer Member of CRA Keith Park started out working in his family's lighter importation business in California in the 1980's. In 1992, Keith launched the now-famous luxury lighter brand Prometheus. After the success of the Prometheus brand's expansion into collectible humidors, Keith found himself in discussions with Carlito Fuente in 2002, which lead to the creation of the God of Fire line of cigars. In 2008, Keith worked tirelessly to ward of a new round of tax legislation with Jeff Borysiewicz and other manufacturers, when they both realized the need for an advocacy group dedicated to premium cigars, and they helped found CRA. The Protect Cigar Freedom Plan JOIN CIGAR RIGHTS OF AMERICA PROTECT YOUR RIGHT TO ENJOY PREMIUM CIGARS CONTINUE TO ENJOY YOUR FREEDOM IN PEACE TODAY AND INTO THE FUTURE JOIN CRA Contact The CRA (800) 460-0729 210 King Street Alexandria, VA 22314 info@cigarrights.org Additional Resources Home About Us Team Cigar Events Cigar News Take Action Donate Contact Us Join CRA About Us Cigar Rights of America (CRA) is the first and only grassroots, consumer-based public advocacy group fighting to protect the individual’s right to enjoy premium cigars. As the anti-tobacco movement’s reach has broadened over the past 20 years, CRA has continued to advocate for all facets of the premium cigar community. Membership is open to everyone, including cigar enthusiasts, retailers, and manufacturers across the country. CRA was founded to ensure that everyone has the right to enjoy premium cigars and freely participate in a relaxing social activity. Secure Online Payments Accepted © 2024 Cigar Rights of America. All Rights Reserved."
    },
    {
      "url": "https://cigarinc.com/pages/about-us",
      "text": "About Cigar Inc. | Your Source for Premium Cigars & Luxury Accessories Skip to content Enjoy Free Shipping on Orders of Cigars Over $75.   Questions? Call us at 818-719-9885 icon-X Close menu Cigars All Cigars Best Selling Cigars Cigar Inc. New Arrival Top 25 Cigars by Cigar Aficionado Cigar Companies Cigar Finder Cigar Accessories All Cigar Accessories Humidors All Humidors Electronic Humidors Desktop Humidors Travel Cases & Tubes Humidor Accessories Shop by Brand Raching Humidors Afidano Humidors El-Septimo Humidors Lighters Cutters Travel Cases & Tubes Punches Ashtrays Sets Lifestyle Shop by Brand Maccarrone Brizard and Co. El-Septimo Special Deals Blog Cigar Inc. Podcast Who We Are About Us Contact Log in instagram Instagram Facebook YouTube X Cart icon-X Close cart Subtotal $0.00 Shipping, taxes, and discount codes calculated at checkout. Check out Your cart is currently empty. Cigars All Cigars Best Selling Cigars Cigar Inc. New Arrival Top 25 Cigars by Cigar Aficionado Cigar Companies Cigar Finder Cigar Accessories All Cigar Accessories Humidors All Humidors Electronic Humidors Desktop Humidors Travel Cases & Tubes Humidor Accessories Shop by Brand Raching Humidors Afidano Humidors El-Septimo Humidors Lighters Cutters Travel Cases & Tubes Punches Ashtrays Sets Lifestyle Shop by Brand Maccarrone Brizard and Co. El-Septimo Special Deals Blog Cigar Inc. Podcast Who We Are About Us Contact account Log in icon-search Search icon-hamburger Site navigation icon-bag-minimal Cart Search Search Cigar Inc. Premium Cigars and Luxury Accessories Watch About Us Welcome to Cigar Inc. — Where Luxury Meets Legacy At Cigar Inc., we are proud to be a premier distributor of premium cigars and high-end cigar accessories , serving discerning enthusiasts across the globe. Headquartered in Los Angeles, we offer both a luxurious retail experience and a seamless online store tailored to the needs of aficionados who demand the best. We curate only the finest cigars from prestigious brands, featuring rare blends, limited editions, and collector-grade releases. Our exclusive accessories include handcrafted humidors , precision cutters, and luxury lighters—each designed to elevate your smoking experience. Cigar Inc. is also a U.S. distributor of select collections in collaboration with iconic names like El Septimo, Brizard & Co., and Lucky Cigar . With deep industry relationships and trusted partnerships, we bring exceptional craftsmanship and exclusivity directly to your humidor. Whether you're purchasing for your private collection, preparing for a special event, or gifting a true connoisseur, Cigar Inc. delivers a standard of quality worthy of the moment. Visit our Los Angeles showroom or shop online at www.cigarinc.com . Experience the world of premium cigars—crafted for those who expect nothing less than luxury. Contact Us Mon-Fri, 9:30 am. - 5:30 pm: 📞 Tel: 1 818-719-9885 📠 Fax: 1 818-719-9886 📧 Email: Info@Cigarinc.com Contact Us Contact Us Mon-Fri, 9:30 am. - 5:30 pm: 📞 Tel: 1 818-719-9885 📠 Fax: 1 818-719-9886 📧 Email: Info@Cigarinc.com Footer Footer Search Refund Policy & Privacy Policy Terms of Service Sign up and save Sign up and save Subscribe to get special offers, free giveaways, and once-in-a-lifetime deals. Enter your email Subscribe icon-email Subscribe instagram Instagram Facebook YouTube X icon-X \"Close (esc)\" icon-chevron-left icon-X icon-chevron icon-X About Cigar Inc. | Your Source for Premium Cigars & Luxury Accessories"
    },
    {
      "url": "https://atlanticcigar.com/about-atlantic-cigar/",
      "text": "About Us menu search cart cart-close wishlist arrow-down star star-empty chevron-right chevron-left arrow-right arrow-left close close-small remove radio-unchecked radio-checked checkbox-unchecked checkbox-checked facebook flickr google-plus instagram kickstarter linkedin mail pinterest print reddit rss spotify stumbleupon tumblr twitter vimeo vine youtube alert-info alert-fail alert-success Open Arrow hamburger grid icon-visa icon-mastercard icon-american-express icon-discover icon-paypal lock plus FREE SHIPPING $99 UP SEE DETAILS Atlantic Cigar Co GIFT CARDS VIP Account WISH LIST Cart 0 Your Cart Your cart is empty Brand List Cigars Search By Brand All Cigars What's New Atlantic Cigar Exclusives Limited Edition Cigars Bundle Cigars Flavored & Infused Cigars Top Rated Cigars of 2024 Top Rated Cigars of 2023 Small Cigars Samplers Samplers Assorted Samplers Brand Samplers Face Off Samplers Build Your Own Sampler Accessories Accessories Humidors Ashtrays Butane Fuel Cigar Cases Cigar Cutters Coffee - Espresso Collectibles Gadgets Humidification Hygrometers Lighters Specials Specials Last Chance Box Sale VIP Members Club Gift Cards 10 Pack Steals Limited Time Specials GIFT CARDS VIP Account WISH LIST About Atlantic Cigar Company About Us AtlanticCigar.com (Atlantic Cigar Company LLC) has been a family operated retail tobacco business for over 20 years now. In the late 90's Atlantic cigar expanded their expertise and services around the world, by launching the virtual cigar store www.AtlanticCigar.com. This was one of the first online shops available to order premium, handmade cigars, and cigar accessories. With a simple layout and an easy to use website, combined with our employee's knowledge of cigars, and our industry leading prices, Atlantic had developed a blueprint for growth that has worked for over 20 years! And in late 2017 we launched our new, cutting edge website! Atlantic Cigar Company of PA was named \"Best online mail order retailer in the U.S. (2005), by Cigar Cyclopedia. We also operate two sister retail stores under the name The Cigar Republic in New York and Connecticut. Thank you for choosing AtlanticCigar.com for your products, we pride ourselves in providing all customers, with the best product available, at the best prices, while still providing exceptional customer service. As we have proven, it can be done in today's internet world. If you would like additional information on a certain box of cigars, humidors or any other product offered feel free to Email customer service anytime, one of our tobacconists will be able to help you. Please take the time and register, this will expedite the ordering process on future orders. Our Family name is on every package, we guarantee everything we sell or we will replace it! Enjoy your cigars and good smoking, Paul J. Scipioni, President, Atlantic Cigar Co, LLC Our History - Then and Now. 2017 marks another chapter in Atlantic's growth, with a new, state of the art web site. Making a quantum leap from our original site, we've incorporated all the latest technology offered for online shoppers, as well as some custom features that only Atlantic Cigar can offer its customers. It's been a long and tough road made up of a lot of long hours and blood, sweat, (no tears, come on we're all manly men here!). But we would not have gotten this far without you, our loyal customers. For all the members of our NY & CT stores, our loyal internet and mail order customers, we want to thank you for 20 years of growth, and helping us get this far. We want you to know that once you buy from us, you become part of our family, and above all we look out for and take care of our family. Our Guarantee We sell all our products for deep discounts, we have the lowest prices across the board on all of our items, bottom-line AtlanticCigar.com has the best prices, selection & service on the NET! It's the reason family owned AtlanticCigar.com has become one of the fast growing cigar stores in the nation. - Our cigars are shipped directly from our state-of-the art humidor, we guarantee freshness! - We are a member of the IPCPR & CRA (Cigar Rights of America). - Our staff knows what they are selling, and can provide you service every step of the ordering process! - Best designed web site in the industry, making ordering simple and ease. - The first members buying club, allowing you huge savings and special deals. - We only sell Premium Cigars, NO SECONDS!! Unless labeled as such! Our prices maybe the lowest around but our quality and customer service is second to none. - We support our Armed Forces, and will ship to APO's / FPO's Worldwide. We only charge actual shipping charges. - We Do Not sell or rent our customer information to any third parties. All customer information is used for internal purposes only! Sign Up For Daily Deals! Email Shop Brand List Cigars Samplers Humidors Accessories Specials Gift Cards Our Company About Store Locations & Events Testimonials Privacy Policy Terms & Conditions Age Verification Customer Service Reset Password Order Status Real Time Inventory Shipping & Returns International Ordering Website Feedback Need More Help? Contact Us Blog Info 601 General Washington Avenue Norristown, PA 19403 800-887-7877 admin@atlanticcigar.com Monday - Friday: 10am - 6pm Weekends: Closed © Atlantic Cigars. All Rights Reserved. Atlantic Cigar Company is a secure retailer of premium cigars at discount prices. Please note that Atlantic Cigar Company does not sell tobacco products to anyone under the age of 21. Atlantic Cigar Company does not sell cigarettes, e-cigs, or vape of any kind. All items sold are for personal use and not for resale. It is unlawful to even attempt to purchase cigars below the minimum age. If you are not of legal age, please do not enter our site. {\"customer_id\": \"\", \"items\":[  ], \"quantity\": \"0\", \"show_primary_checkout_button\": \"0\", \"show_multiple_address_shipping\": \"\", \"discount\": {\"value\":\"\", \"formatted\": \"\"}, \"sub_total\": {\"value\":\"0\", \"formatted\": \"$0.00\"}, \"grand_total\": {\"value\":\"0\", \"formatted\": \"$0.00\"}, \"coupons\": [  ], \"taxes\":[  ], \"shipping_handling\": { \"handling_cost\": {\"value\":\"\", \"formatted\": \"\"}, \"show_estimator\": \"true\", \"selected_state\": \"\", \"selected_zip\": \"\", \"selected_city\": \"\", \"shipping_cost\": {\"value\":\"\", \"formatted\": \"\"}, \"provider\": \"\", \"show_estimator\": \"true\", \"countries\": [  ], \"states\": [  ] }, \"gift_certificates\":[  ]}"
    },
    {
      "url": "https://admiral-sports.com/shop/usa_en/contactus",
      "text": "Contact Us | Admiral Sports Customer Support | Admiral Sports Save Money on Teamwear for your Club! Complete our lead form to get more information. Global Sizing Guide Virtual Fitting Room Check Order Status Account Men Ready to Go Teamwear Jerseys Shorts Socks Goalkeeper Coach / Sideline Referee Compression / Base Layer Jackets / Pullovers Pants Custom Teamwear Women Ready to Go Teamwear Training Shorts Compression / Base Layer Goalkeeper Custom Teamwear Lifestyle Accessories Bags Balls Caps Field General Goals Nets Referee Training Custom Outlet Accessories Coaches Compression / Base Layer Goalkeeper Jackets / Pullovers Jerseys Pants Referee Shorts Socks Training Journal empty Contact Us | Admiral Sports Customer Support JavaScript seem to be disabled in your browser. You must have JavaScript enabled in your browser to utilize the functionality of this website. Contact Us Admiral Sports The Axis Sports Group Inc. United States 2628 NE 2nd Avenue Miami, Florida 33137, USA Canada Blue Mountain Sports 1074 Magnolia Way Anmore, BC V3H 5M6 Customer Service Questions? Please review our frequent questions section using the following link. Frequent Questions Customer Service Toll Free (1) 888.646.6822 Fax (1) 800.823.1633 To streamline support requests and better serve you, we utilize support ticket system . You can use it to track the progress and responses online. Open a Support Ticket Locate and open the your order with issues. Then open a support ticket. New Sales (USA) Save Money on Teamwear for your Club! complete our lead form to get more information. Toll Free (1) 866.380.0208 eMail sales@admiral-sports.com Lead Form Ambassador Program New Sales (Canada) eMail canadasales@admiral-sports.com Company About Us History Customer Reviews Shop Sizing Guide Virtual Fitting Room Fabric Specs/Options Logos Specs/Options Check Order Status Contact Contact Us Save Big: Buy Factory Direct Ambassador Program Admiral ID About Admiral ID Admiral ID Intro Video Admiral ID Tutorials How your kit is made © 2012-2024 Admiral Sports All Rights Reserved. Follow us Customer Service Toll free: 888.646.6822 Frequent Questions Terms Privacy Policy Terms & Conditions Accesibility Statement Downloadable Forms Account Application (Dealer) Account Application (Clubs) Credit Card authorization form Artwork General Info Artwork Requirements Admiral Colors Catalogs Lookbooks The Concept Club Jesters Admiral Spring 2025 Lookbook Sitemap ... Close"
    },
    {
      "url": "https://admirals-club.pissedconsumer.com/customer-service.html",
      "text": "Admirals Club Customer Service Phone Number (800) 237-7971, Email, Help Center Skip to content PissedConsumer Reviews Categories All Categories Media Auctions and Marketplaces E-commerce Food Delivery Footwear and Clothing Gambling and Lotto Transportation and Logistics Companies All Companies Amazon Meesho Temu Google YouTube TV KukuFM Blinkit Write review For Business Login Airlines and Air Transport Admirals Club 18 Customer Service Updated on 01/10/2025 Contact Admirals Club Customer Service Reviews 0 Contacts Community Advertisements Admirals Club Phone Numbers and Emails Toll-Free Number: (800) 237-7971 Call customer service Customer Service: (817) 963-6100 Admirals Club Email: Customer Service Send Message Is this your business? Advertisements Admirals Club Customer Service Overview The aggregated data is based on calls made from PissedConsumer.com website and questionnaires provided by PissedConsumer.com users. More commonly used way of contact is by phone . Source Distribution 70% phone 30% email The best phone number to call Admirals Club is 8002377971 . 77% of consumers used this number to address their issues and concerns. The average hold time is up to 3 minutes . The longest wait times are on Tuesday , while the shortest are on Saturday . The average call time is 17 minutes . Be prepared for the call as Admirals Club may ask you for the following information to identify you as a customer: first and last name, customer id or account no or email . View full overview › Admirals Club Overview The aggregated data is based on calls made from PissedConsumer.com website and questionnaires provided by PissedConsumer.com users. More commonly used way of contact is by phone . Source Distribution 70% phone 30% email The best phone number to call Admirals Club is 8002377971 . 77% of consumers used this number to address their issues and concerns. The average hold time is up to 3 minutes . The longest wait times are on Tuesday , while the shortest are on Saturday . The average call time is 17 minutes . Be prepared for the call as Admirals Club may ask you for the following information to identify you as a customer: first and last name, customer id or account no or email . People call Admirals Club mainly because of request for information, account and product/ service . 8% of the consumers who called the company’s customer support stated that their issues were resolved. Most customers feel very satisfied after talking to customer service representatives. The best email to contact Admirals Club is admirals.club@aa.com . Customers evaluated the effort they needed to make to contact customer service as easy . Close How to Contact Admirals Club Customer Service? Most Popular Number: (800) 237-7971 Total calls: 44 Issues resolved: 2 Last call: Jun 18, 2025 Winnie Murugi PissedConsumer Reporter What Is The Admirals Club Customer Service Phone Number? Admirals Club phone number for contacting the customer support department is 800-237-7971. If you need to cancel your membership, to get more information about your existing membership or address any other questions, call this line between 8 am – 10 pm ET on any day of the week. The line is available for callers within the United States, Canada and Puerto Rico. The professional Admirals Club customer care team is ready to assist you with any issue. What Is The Admirals Club Email Address? If your request is not tie-critical and doesn’t require urgent resolution, consider contacting the company via email. Admirals Club email for general customer care inquiries, issues and requests is admirals.club@aa.com. Alternatively, you can submit a request via the Admirals Club website. Once you submit your message, it will be forwarded directly to the Admirals Club customer support team. Along with reaching out to the company via email, you can send a message via social media platforms such as Twitter, YouTube, and LinkedIn. What Is The Admirals Club Headquarters Address? The company is headquartered in Florida. The head office address is 2615 Lake Dr, Riviera Beach, Florida 33404, United States. Admirals Club address for mailing is PO Box 619616, MD 8A508, DFW Airport, TX 75261-9616. Please use this address to contact the company via regular mail and send documents, requests, and other correspondence. What Are The Admirals Club Hours Of Operation? Depending on a location, Admirals Club lounges operation hours vary. For example, the lounge in Hartsfield-Jackson Atlanta International Airport operates daily from 5 am to 8.15 pm while Admirals Club lounge in Austin Bergstrom International is open from 4.45 am to 9.15 pm Monday through Sunday. You can find the full list of all lounges and their operation hours on the Admirals Club website. Speaking about customer support services, they are available daily from 8 am to 10 pm ET. Contact Information Admirals Club Website: www.aa.com Admirals Club Help Center: Visit contact page Corporate Office Address: Admirals Club PO Box 619616 MD 8A508 Dfw Airport, Texas 75261-9616 United States Help in Social Networks: Twitter Linkedin Youtube Other Info (opening hours): Hours: Monday - Sunday: 8:00am - 10:00pm More contact details Admirals Club Rating Based on 7 Reviews Rating details 1.5 more details Product or Service Quality Customer service Value for money Website Rating Details Product or Service Quality Customer service Value for money Website Price Affordability Level of Comfort Exchange, Refund and Cancellation Policy Additional Fees Billing Practices Discounts and Special Offers Number of Destinations Quality of Food Close All 18 Admirals Club reviews Rating stats Rating trend How Good is Admirals Club's Customer Service? Natlie Mto Natlie Mto Feels Satisfied | Apr 30, 2024 great ability to resolve concern Read full quote Jedidiah Wsx Jedidiah Wsx Feels Satisfied | Sep 27, 2023 Great Read full quote Heyden Zco Heyden Zco Feels Disappointed | Jul 25, 2023 I can't found my loss item yet, I need to see video recording July, 13th in Miami Airport terminal D Read full quote Heyden Zco Heyden Zco Feels Satisfied | Jul 15, 2023 That was really good Read full quote Summary of Admirals Club Customer Service Calls 57 TOTAL CALLS 17:09 AVG CALL DURATION 8% ISSUES RESOLVED Top Reasons of Customers Calls Consumers Call the Most From Why Do People Call Admirals Club? Request for Information Question: 1Y ago “JFK Admiral club question” 1Y ago “Check on membership status” 2Y ago “I need to know how is the status for my claim” Account Question: 1Y ago “Membership” 1Y ago “Problem with subscription” Product/ Service Question: 3Y ago “Access” 3Y ago “Wife Access” 4Y ago “Wifi access quiesrions” Staff Question: 1Y ago “Denied my daughter at DFW AA club, treated rudely to the point she called me crying. I am beyond upser” 3Y ago “Customer service” Return/ Replace Question: 1Y ago “To replace my card” Shipping and Delivery Question: 2Y ago “Missing item” Cards Question: 8M ago “Misplaced my card need a duplicate sent” Refund Question: 2Y ago “Refund” Other Question: 9M ago “Escorting a guess” 11M ago “Lost ear bufsy” 1Y ago “Denied Entry” About Related Companies American Airlines , Us Airways , American Airlines Vacations , American Airlines Cargo , AmericanAirlines Arena Summary The Admirals Club is a large chain of lounges taken on lease by American Airlines. The first Club began operating in 1939 at the premises of LaGuardia Airport. Initially, membership in the Admirals Club was by the airlines’ invitation only. Today all people may join the club. There are 4 ways: apply online, call Member services, stop by any Admirals Club location, or apply for the City Executive World Elite MasterCard. Available membership plans are individual annual membership, spousal annual membership, 30-day membership, and one-day passes. All members can enjoy such amenities as conference rooms, cyber cafes, work areas, personal travel assistance, children’s play areas, and many more. There are over 50 Admirals Clubs worldwide. Admirals Club is ranked 216 out of 953 in Airlines and Air Transport category Compare Admirals Club Customer Service To Companies are selected automatically by the algorithm. A company's rating is calculated using a mathematical algorithm that evaluates the information in your profile. The algorithm parameters are: user's rating, number of resolved issues, number of company's responses etc. The algorithm is subject to change in future. United Airlines Customer Service 1.5 out of 5 Cheapflights Customer Service 1.5 out of 5 Southwest Airlines Customer Service 2.1 out of 5 Write a review Do you have something to say about Admirals Club? What happened? What can we help you with? Submit review Don't show this popup Call Company Send Message Admirals Club Reviews Contacts Community Write a review About About PissedConsumer Press Page Blog FAQ for Consumers FAQ for Companies Careers Contact PissedConsumer Browse Companies Reviews Categories State Attorneys General Contacts Services Business Solutions List your Business Tips For Consumers Tips For Companies PissedConsumer Club Advertise with us Legal Privacy Policy Terms Of Use Legal Information Dispute Resolution (LVP Program) facebook youtube linkedin twitter tiktok PissedConsumer            © 2025 All\n            Rights Reserved Are you sure you want to leave Admirals Club contact page? Contact Admirals Club Contact PissedConsumer Terms of Service I agree to TOS Cancel"
    },
    {
      "url": "https://www.admiralcigar.com/menus",
      "text": "Admiral Cigar Club | Menu top of page HOME ABOUT MENU EVENTS MAILING LIST CONTACT More... Use tab to navigate through the menu items. Cigars Liquors, Brews and Spirit Wines Chow Menu Cigars Arturo Fuente 8-5-8 8-5-8 Claro Double Chateau Don Carlos Robusto Short Story Ashton Aged Maduro - No. 10 Aged Maduro - No. 40 Ashton Cab #6 Ashton Cab # 7 Ashton Cab #8 Ashton Classic: Churchill Ashton Classic: Corona Ashton Cab Pyramid Ashton Double Magnum Ashton Magnum Ashton Symmertry Ashton Virgin - Robusto Ashton Virgin - Sorcerer Ashton Virgin - Torpedo La Aroma - El Jefe La Aroma - Immensa La Aroma - Monarch La Aroma - Robusto Mi Amor - Belicoso Mi Amor - Magnifico Mi Amor - Valentino San Cristobal - Clasico San Cristobal - Coloso San Cristobal - Papagayo San Crsitobal - Legend San Cristobal - Leviathan San Cristobal - Prophet CAO 660 Cohiba Dominican Toro Tube Camacho Barrel Aged Triple Maduro Diamond Crown Julius Caesar Robusto Julius Caesar Maximus Robusto No. 4 Robusto No. 5 Drew Estate Acid - Blondie Acid - Blondie Maduro Acid - Blondie Belicoso Acid - C-Note Acid - Kuba-Kuba Acid - Kuba Maduro CT Shade - Corona Doble CT Shade - Gran Toro CT Shade - Robusto Dirt Herrera Esteli - Lonsdale Deluxe Herrera Esteli - Robusto Extra Herrera Esteli - Toro Especial JdN Antano - Dark Corojo Poderoso JdN Antano - 1970 Churchill JdH Antano - 1970 Robusto Grande Joya Red - Toro Joya Red - Robusto KFC - Fire Cured Molly KFC - Just A Friend Nica Rustica - El Brujito Nica Rustica - Belly Nica Rustica - Short Robusto Norteno - Robusto Grande Norteno - Lonsdale Norteno - Toro Especial Tabak - Robusto Dulce Tabak - Toro Negra Tabak - Robusta Negra Undercrown - Corona Doble Tabak - Toro Dulce Undercrown - Gran Toro Gurkha Solara Double Robusto La Gloria Cubana Serie R No. 5 Montecristo Number #2 AJ Fernandez Estoque Espada Rothschild Tube Toro My Fathers Le Bijou Nat Sherman Castro Hamilton Hampton Hobart Hobart Maduro Hyde Joel Sherman 75th Cel Nat Sherman 85th Cel Schrader Sterling - Churchill Sterling - Short Robusto Sterling - Robusto Sterling - Super Lancero Timeless Collection - 452 Timeless Collection - 546 Timeless Collection - 556 Timeless Collection - 660 Timeless Collection - 652T Timeless Collection - 660 Timeless Collection - 749 Timeless Collection - No. 2 Timeless Collection - Churchill Timeless Collection - Divinos Timeless Collection - Hermoso Macundo Hampton Court Oliva Liga Especial Double Toro Melanio Figurado Nub Padron 1926 80th Anniversary 1926 No. 2 1926 No. 35 1926 Family Reserve No. 45 1964 Torpedo Maduro 1964 Torpedo Natural 1964 Principe Maduro 1964 Principe Natural 1964 Pyramide Maduro 1964 Pyramide Natural 1964 Exclusivo Maduro 1964 Exclusive Natural 3000 6000 7000 Partagas No. 10 Magnifico Romeo Y Julieta Bully Reserva Real Toro Romeo Rocky Patel 1990 Torpedo Edge Toro ADMIRAL CIGAR CLUB LOCATION & HOURS 4940 New Broad Street Orlando, FL 32814 (407) 637 - 5236 ​ Monday: 4 pm - 12 am Tuesday: 4 pm - 12 am Wednesday: 4 pm - 12 am Thursday: 4 pm - 12 am Friday: 4 pm - 1 am Saturday:  1 pm - 1 am Sunday : 1 pm - 11 pm RESERVATIONS To rent our space for a party please email us at: karina@admiralcigar.com JOBS ©2016, Proudly created with Concept Management Group Should you wish to join our team contact us at: karina@admiralcigar.com ​ ​ bottom of page"
    }
  ]
}