{
  "fuentes": [
    {
      "url": "https://www.adventureunlimited.org/get-involved/join-the-team/",
      "email": "audbcommunity@adventureunlimited.org"
    },
    {
      "url": "https://www.adventureunlimited.org/get-involved/join-the-team/",
      "email": "auinfo@adventureunlimited.org"
    },
    {
      "url": "https://thedyrt.com/camping/florida/adventures-unlimited-outdoor-center",
      "email": "fordovallogo@2x.png"
    },
    {
      "url": "https://thedyrt.com/camping/florida/adventures-unlimited-outdoor-center",
      "email": "fordovallogo@3x.png"
    },
    {
      "url": "https://www.outdooradventuresinc.com/reservationresources/",
      "email": "wecare@outdooradventuresinc.com"
    },
    {
      "url": "https://outdooradventureclub.com/staff/",
      "email": "info@outdooradventureclub.com"
    },
    {
      "url": "https://www.outdooradventuresinc.com/contact-us-2/",
      "email": "wecare@outdooradventuresinc.com"
    },
    {
      "url": "https://www.adventureunlimited.org/about-us/contact-us/",
      "email": "achitwood@adventureunlimited.org"
    },
    {
      "url": "https://www.adventureunlimited.org/about-us/contact-us/",
      "email": "jsherwood@adventureunlimited.org"
    },
    {
      "url": "https://www.adventureunlimited.org/about-us/contact-us/",
      "email": "mcrandell@adventureunlimited.org"
    },
    {
      "url": "https://www.adventureunlimited.org/about-us/contact-us/",
      "email": "audbcommunity@adventureunlimited.org"
    },
    {
      "url": "https://www.adventureunlimited.org/about-us/contact-us/",
      "email": "auinfo@adventureunlimited.org"
    },
    {
      "url": "https://www.adventureunlimited.org/about-us/contact-us/",
      "email": "chris@adventureunlimited.org"
    },
    {
      "url": "https://www.adventureunlimited.org/about-us/contact-us/",
      "email": "dbinfo@discoverybound.org"
    },
    {
      "url": "https://www.adventureunlimited.org/about-us/contact-us/",
      "email": "dgibbs@adventureunlimited.org"
    },
    {
      "url": "https://www.adventureunlimited.org/about-us/contact-us/",
      "email": "hkaufmann@adventureunlimited.org"
    },
    {
      "url": "https://www.adventureunlimited.org/about-us/contact-us/",
      "email": "jsprague@adventureunlimited.org"
    },
    {
      "url": "https://www.adventureunlimited.org/about-us/contact-us/",
      "email": "llochen@adventureunlimited.org"
    },
    {
      "url": "https://www.adventureunlimited.org/about-us/contact-us/",
      "email": "marnold@adventureunlimited.org"
    },
    {
      "url": "https://www.adventureunlimited.org/about-us/contact-us/",
      "email": "mbrown@adventureunlimited.org"
    },
    {
      "url": "https://www.adventureunlimited.org/about-us/contact-us/",
      "email": "mmorin@adventureunlimited.org"
    },
    {
      "url": "https://www.adventureunlimited.org/about-us/contact-us/",
      "email": "sjohnson@adventureunlimited.org"
    },
    {
      "url": "https://www.adventureunlimited.org/about-us/contact-us/",
      "email": "tjohnson@adventureunlimited.org"
    },
    {
      "url": "https://www.adventureunlimited.org/about-us/",
      "email": "audbcommunity@adventureunlimited.org"
    },
    {
      "url": "https://www.adventureunlimited.org/about-us/",
      "email": "auinfo@adventureunlimited.org"
    },
    {
      "url": "https://www.reachunlimited.org/contact/",
      "email": "lblack@reachunlimited.org"
    },
    {
      "url": "https://www.reachunlimited.org/contact/",
      "email": "jclopton@www.reachunlimited.org"
    },
    {
      "url": "https://www.outdooradventuresinc.com/outdoor-adventures-adds-to-its-executive-leadership-team/",
      "email": "wecare@outdooradventuresinc.com"
    },
    {
      "url": "https://www.adventureunlimited.org/an-update-from-the-executive-director/",
      "email": "audbcommunity@adventureunlimited.org"
    },
    {
      "url": "https://www.adventureunlimited.org/an-update-from-the-executive-director/",
      "email": "auinfo@adventureunlimited.org"
    },
    {
      "url": "https://www.outdooradventuresinc.com/",
      "email": "wecare@outdooradventuresinc.com"
    },
    {
      "url": "https://adventures.is/about-us/contact-us/",
      "email": "pickup@adventures.is"
    }
  ],
  "mails": [
    "achitwood@adventureunlimited.org",
    "audbcommunity@adventureunlimited.org",
    "auinfo@adventureunlimited.org",
    "chris@adventureunlimited.org",
    "dbinfo@discoverybound.org",
    "dgibbs@adventureunlimited.org",
    "fordovallogo@2x.png",
    "fordovallogo@3x.png",
    "hkaufmann@adventureunlimited.org",
    "info@outdooradventureclub.com",
    "jclopton@www.reachunlimited.org",
    "jsherwood@adventureunlimited.org",
    "jsprague@adventureunlimited.org",
    "lblack@reachunlimited.org",
    "llochen@adventureunlimited.org",
    "marnold@adventureunlimited.org",
    "mbrown@adventureunlimited.org",
    "mcrandell@adventureunlimited.org",
    "mmorin@adventureunlimited.org",
    "pickup@adventures.is",
    "sjohnson@adventureunlimited.org",
    "tjohnson@adventureunlimited.org",
    "wecare@outdooradventuresinc.com"
  ],
  "nombre_sitio": "adventuresunlimited.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.adventureunlimited.org/get-involved/join-the-team/",
      "text": "Join The Team | Adventure Unlimited Skip to content Search Search A/U Ranches DiscoveryBound 100 Elk About Us History Vision & Mission Team Trustees Alumni Board FAQs Publications Contact Us Our Experiences A/U Ranches DiscoveryBound Youth Programs Adult Programs All Ages Programs Your Stories Photos & Videos Get Involved Event Calendar Alumni Volunteer Partner with Us Join the Team Support Ways to Give Donate Recurring Gifts 2024 Donors About Us History Vision & Mission Team Trustees Alumni Board FAQs Publications Contact Us Our Experiences A/U Ranches DiscoveryBound Youth Programs Adult Programs All Ages Programs Your Stories Photos & Videos Get Involved Event Calendar Alumni Volunteer Partner with Us Join the Team Support Ways to Give Donate Recurring Gifts 2024 Donors Search Search Contact Us Donate Join the Team Adventure Unlimited is a multi-faceted organization and includes the A/U Ranches, DiscoveryBound, and the 100 Elk Outdoor Center. We employ seasonal, part-time, and full-time staff in several locations. If you are interested in or qualified for one of our positions, we want to hear from you! All applicants must live a demonstrated commitment to Christian Science and the mission of Adventure Unlimited. Reflections of Healing and Growth \" God just told me, the healing’s already done. You don’t have to worry about it. It was such a message of care and provision. \" Erin Demaree Current Openings DiscoveryBound DiscoveryBound Outreach Event Manager Location: Remote or Greenwood Village, CO Office | Full-Time The DiscoveryBound (DB) Outreach Event Manager plans and executes events for all ages, overseeing logistics, content, communication, promotion, registration, and budgeting. Reporting to the DB Outreach & Compass Director, the role involves collaboration with internal teams and external partners, including local Chapters, churches and Christian Science organizations. The Event Manager also leads marketing efforts to boost visibility and participation, engages community members, and ensures successful event outcomes. Additionally, provides staff support and collaboration on other events and initiatives within DiscoveryBound and Adventure Unlimited as needed. This is a full-time position, preferably based at Adventure Unlimited’s Greenwood Village, CO office, with benefits and a three-month probationary period. Full Job Description Apply Now A/U Ranches Facilities Technician Location: Buena Vista, CO | Full-Time The Facilities Technician position supports the maintenance department at the A/U Ranches in all venues including grounds and building maintenance and other tasks as assigned by the Facility Director or Ranch Foreman. Tasks are diverse and require strong problem-solving skills and the ability to work alone and with a team. Full Job Description Apply Now A/U Ranches Jobs Discoverybound Jobs Adventure Unlimited Headquarters 5201 S Quebec Street | Greenwood Village, CO 80111 Phone: 888.416.7348 Email A/U Ranches P.O. Box 2036 | 18325 County Road #366 | Buena Vista, CO 81211 Phone: 888.543.4849 Email Sign up for our Newsletters Please enter your name. Please enter a valid email address. Subscribe Something went wrong. Please check your entries and try again. A/U Ranches   |   DiscoveryBound A/U Ranches Facebook A/U Ranches Instagram DiscoveryBound Facebook https://www.instagram.com/discoverybound/ Contact Us Privacy Policy © 2025 Adventure Unlimited. All Rights Reserved."
    },
    {
      "url": "https://thedyrt.com/camping/florida/adventures-unlimited-outdoor-center",
      "text": "Adventures Unlimited Camping | Milton, Florida Find Camping Create a Dyrt Alert Unlock PRO Benefits List Your Property More Join Sign In Find Camping More Review a Campground Add a Location Gift Cards Contests Magazine Advertise About Us Press Careers Support Near Me Open in App Find Camping Create a Dyrt Alert Unlock PRO Benefits List Your Property Camping Florida Milton, FL Adventures Unlimited $30 - $40 / night Contact Campground Photos About Location Site Types Features Reviews Contact $30 - $40 / night Get the App View Photos Signs & Maps Unlock Planning Tools in App Save Add Review Share Location Established Camping Adventures Unlimited 2 Reviews Do you own or manage this property? Claim Your Listing CAMPER SUMMARY PRESENTED BY Adventures Unlimited is located near Milton, Florida, featuring flat terrain with dense forest surroundings. The area experiences temperatures ranging from the 40s in winter to the 90s in summer. Nearby attractions include Blackwater River State Park and the Blackwater Heritage State Trail, offering opportunities for hiking and exploring nature. Description Adventures Unlimited Outdoor Center (AUOC) began with two canoes on top of a 1972 Oldsmobile Cutlass, then expanded to 30 canoes and a 1972 GMC three-quarter ton pickup (affectionately referred to as “Old Blue”). The Blackwater River State Park was the main point of debarkation and phones were answered from the Sanborn family residence in Bagdad, Florida. In 1978, the original Tomahawk Landing was purchased on the Santa Rosa County courthouse steps. It started out as one building and over the years developed into a complete lodging and water recreation resort. By 1982, Adventures Unlimited began adding lodging to further expand its services. Currently there are three rustic camping cabins, the School House Inn (with 8 separate rooms), 18 furnished cottages/cabins (which includes our unique tree house, the Lorax Loft, added in 2013 and Katie’s Kaboose, added in 2016). Two rustic camping cabins and six cottages are designated as “pet friendly.” In the summer of 1994, the Adventures Unlimited Low and High Challenge Courses were completed. Since then, Adventures Unlimited has been the site for retreats of all kinds – schools, military, churches, non-profits, sports teams, corporations, scouts and many others – utilizing the challenges presented by these courses, lead AUOC to become one of the premiere courses in the Southeastern United States. In 2010, we proudly unveiled the Zip Adventures Canopy Tour, where adventure seekers can soar through the glorious tree tops of Northwest Florida and over Coldwater Creek on nearly a mile of zip lines, some as high as 65′ in the air. These programs and activities complement our fleet of 250 canoes, 100 kayaks, 500 tubes and 10 stand-up paddle boards for aquatic enjoyment. Adventures Unlimited also has nearly 100 acres on its Wilderness Resort location campgrounds for groups and individuals, a catering facility, group retreat cabins (which holds up to 70 people), private cabins, a playground, a nature trail, sports fields and a volleyball court. Adventures Unlimited continues to expand to meet the needs of all of our guests – families, honeymooners, friends and many more! If there is anything Adventures Unlimited can do to meet your specific requests, please let us know! Your input is essential to the growth and development of Adventures Unlimited Outdoor Center, and has helped to make our resort what it is today. Read More Suggest an Edit Location Adventures Unlimited is located in Florida Directions From jct Hwy 90 & Hwy 87: Go 12 mi N on Hwy 87, then 1/2 mi E on Neal Kennington Rd, then 1/10 mi S on Lewis Rd, then 3 mi E on Springhill Rd. Copy Directions Address 8974 Tomahawk Landing Rd Milton , FL 32570 Copy Address Coordinates 30.76281126 N 86.99498155 W Copy Coordinates Open in Google Maps The Dyrt Alerts Get reservations at sold-out campgrounds. Learn More Presented by Detours Nearby LOCAL FAVORITES PRESENTED BY Hurricane Lake South Campground 27 min away Bluff Springs Campground 38 min away Drive Time Presented by 32 min from Crestview 42 min from Pensacola 1 hr 15 min from Daphne 1 hr 27 min from Mobile Try Drive Time in App Access Drive-In Park next to your site Walk-In Park in a lot, walk to your site. Hike-In Backcountry sites. Boat-In Sites accessible by watercraft. Connectivity Presented by T-Mobile is introducing T-Satellite to extend coverage in the outdoors Learn More T-Mobile No Coverage Verizon No Coverage AT&T No Coverage Site Types Tent Sites RV Sites Standard (Tent/RV) Group Cabins Tent Cabin Yurts Features For Campers Market ADA Access Trash Picnic Table Firewood Available Phone Service Reservable Showers Drinking Water Electric Hookups Toilets Alcohol Pets Fires For Vehicles Sanitary Dump Water Hookups Pull-Through Sites Big Rig Friendly Contact General Info +18506236197 Visit Website auocsuzanne@gmail.com 2025 Detourist Giveaway Presented by Review Campgrounds. Win Prizes. Enter to Win Enter to Win Reviews Add Review 5 Stars 4 Stars 3 Stars 2 Stars 1 Star 50% 50% 0% 0% 0% 4.5 out of 5 2 Reviews L Lance B. Guide Reviewed Aug. 3, 2023 Fun Family Trip I have been going here since I was a little boy and was finally able to take my wife to camp here. I love this place. The road to the damp grounds are very sandy and iffy when it rains. The camp site itself is nice and private. The bath house needs cleaning from the roaches and spiders. It also has a small playground. The canoe trip is a must!! Site 10 Month of Visit July Share Report totorunner Scout Reviewed Feb. 20, 2021 Plenty of fun things to do! This camp ground is a must consider for those seeking adventure...as the name implies! Share Report Showing results 1- 2 of 2 reviews $30 - $40 / night For information regarding reservations, contact this campground directly. The Dyrt Alerts Get reservations at sold-out campgrounds. Learn More Presented by Contact General Info +18506236197 Visit Website auocsuzanne@gmail.com Detours Nearby LOCAL FAVORITES PRESENTED BY Hurricane Lake South Campground 27 min away Bluff Springs Campground 38 min away Drive Time Presented by 32 min from Crestview 42 min from Pensacola 1 hr 15 min from Daphne 1 hr 27 min from Mobile Try Drive Time in App Find popular camping nearby Lake Kristina Campground Milton , Florida 4 Reviews 2 Photos Coldwater Equestrian Campground — Blackwater River State Forest Jay , Florida 3 Reviews 6 Photos Request to Book Pine Breeze Acres Milton , Florida 1 Review 5 Photos Blackwater River State Park Campground Holt , Florida 31 Reviews 116 Photos Blackwater River Boat Ramp Camp Holt , Florida 1 Review 3 Photos Black Water River State Forest Primitive Camping Holt , Florida 5 Reviews 13 Photos Milton-Gulf Pines KOA Milton , Florida 16 Reviews 18 Photos Splash RV Resort & Waterpark Milton , Florida 7 Reviews 74 Photos Krul Lake Baker , Florida 5 Reviews 22 Photos Krul Campground — Blackwater River State Forest Baker , Florida 3 Reviews 13 Photos Frequently Asked Questions How much does it cost to camp at Adventures Unlimited? Camping at Adventures Unlimited can cost between $30.00 and $40.00 depending on the site. Does Adventures Unlimited have RV hookups? According to TheDyrt.com, Adventures Unlimited has water hookups. What is the elevation of Adventures Unlimited? Adventures Unlimited is located at 32 feet. Are fires allowed at Adventures Unlimited? Yes, according to campers on TheDyrt.com, fires are allowed at Adventures Unlimited, although make sure to check current fire restrictions in the area. Does Adventures Unlimited have wifi? No, according to campers on TheDyrt.com, Adventures Unlimited does not have wifi. Is there cell phone reception at Adventures Unlimited? According to campers on TheDyrt.com, there is no coverage for AT&T, no coverage for T-Mobile, and no coverage for Verizon. Keep Exploring Popular camping destinations near Milton, FL Destin, FL (39 miles) Fort Walton Beach, FL (28 miles) Pensacola Beach, FL (21 miles) Crestview, FL (29 miles) Pensacola, FL (16 miles) Atmore, AL (41 miles) Orange Beach, AL (39 miles) Eglin Air Force Base, FL (32 miles) Got the top ranked camping app? Download The Dyrt app now 4.8 129k ratings Explore Review a Campground Add a Location Gift Cards Contests Magazine Meet The Dyrt List Your Property Advertise About Us Press Careers Support The Dyrt is the only camping app that has it all: State and National Park campgrounds, RV parks, glamping, and free campsites. © 2025 The Dyrt, Inc | All rights reserved Contest Rules Privacy Policy Terms of Use"
    },
    {
      "url": "https://www.outdooradventuresinc.com/reservationresources/",
      "text": "Reservation Resources - Outdoor Adventures Resorts (989) 671-1125 wecare@outdooradventuresinc.com Outdoor Adventures Resorts Home Free RV Camping Getaway About Who We Are History We Care Legacy of Improvements News Careers Resorts Niagara’s Lazy Lakes Lake Shore Saginaw Bay Mt. Pleasant Kalamazoo Affiliate Resorts Guest Guide Activities Members Contact Us Home Reservation Resources Pick your Resort and Reserve Outdoor Adventures members can easily make an online reservation using our platform, CampLife! You can select your rental or campsite at any of our 7 Michigan locations, or affiliate locations in Ohio. Below you’ll also find great resources including how to create an account and login to CampLife, and lots of frequently asked questions. Lake Shore 4392 N. Irish Rd. Davison, MI 48423 Make a Reservation Saginaw Bay 4738 Foco Road Standish, MI 48658 Make a Reservation Kalamazoo 8368 W. C -Ave. Kalamazoo, MI 49009 Make a Reservation Niagara’s Lazy Lakes 4312 Church Rd, Lockport, NY 14094 Make a Reservation Mount Pleasant 340 N. Loomis Road Mt. Pleasant, MI 48858 Make a Reservation Lake of the North 3070 Elm Drive West Branch, MI 48661 Make a Reservation How to Login to CampLife If you have made a reservation with Outdoor Adventures before, but this is your first time using CampLife.com, you will need to click the Login button at the top right of the screen and enter your email. Then click the link to reset your password. Retrieve the email and once reset, you’ll be able to login and book with Outdoor Adventures on CampLife.com. Additional How To Resources How to Setup Your CampLife Login How to Cancel a Reservation in CampLife CampLife Frequently Asked Questions Can I call to make a reservation? Yes, you can call 989-671-1125, option 1 to make a reservation. When booking online or via phone, all sites are first come, first served when selecting and the site will go to the first person who selects a site based on what’s available at the time of reservation. What is the cancellation policy? CAMPSITES Change or cancel 3 or more days prior to arrival date: No fee Change or cancel 1-2 days prior to arrival date: $25 fee Change or cancel the day of arrival, no-show, or falls on a holiday weekend:  $50 fee RENTAL UNITS Change or cancel 3 or more days prior to arrival date: No fee Change or cancel 1-2 days prior to arrival date: Fee of 1-night rental rate Change or cancel day of arrival, no-show, or falls on a holiday weekend:  Fee of 2-night rental rate If a complimentary reservation is canceled 1 or 2 days prior to arrival or day of arrival, a certificate will be considered used and no cancellation fee will be incurred. Other discounted stays will be charged cancellation fees based on the full rental rates. Reservation fees are nonrefundable. Refunds and cancellations will be processed 7-10 business days after cancellation. If a cancellation fee is owed, it will be deducted from the refund balance. Any cancellation balance owed must be paid prior to the next reservation. Any questions should be directed to wecare@outdooradventuresinc.com . To cancel a reservation online, go to your Profile on CampLife and select the reservation you would like to cancel. The calendar icon on the right corner of the reservation will allow you to cancel the reservation. How do payments work for the CampLife system? All payments and fees are made at the time of reservation within the CampLife system. Please note the following: You still have to check-in at the Store upon your arrival. Any outstanding reservation invoices may also be paid on the CampLife system by researching the specific reservation where the fees occurred. If a reservation has an outstanding balance on it, it can be found under the profile on CampLife in the reservations section. By selecting the reservation that was cancelled, you can see the balance associated and pay for it right there. Can a nonmember make a reservation? Nonmembers will not be able to login to CampLife to make a reservation. If you are not a member and you’re interested in becoming a member, please call us at 888-871-9953 to schedule a tour and learn more about our memberships. How can a guest or Adult Family Member (AFM) make a reservation? Adult Family Members (AFMs) must register an account with our Member Services team by calling (989) 671-1125, option 2 or email wecare@outdooradventuresinc.com with your name, email address and member number. Once a CampLife profile is set up by Member Services, you can log into CampLife and make reservations. Guest reservations must be made over the phone with our reservations team by Members or AFMs on their behalf. Can I change my site after I’ve already made my reservation? Yes, you are able to change the site you chose after your reservation has already been made, but you will have to call Member Services to do so at 989-671-1125, option 1. There is no fee to change your site. How do I notify staff that I need my trailer pulled from storage when I make a reservation online? Within the CampLife system there is an option to select to have your camper moved to and from storage. The move to site and move to storage options appear after you close out your disclosures. Will a split reservation affect my ability to book additional reservations in the future? No, split reservations are considered one (1) reservation. Occasionally, split reservations can temporarily interrupt a member’s ability to book further reservations online. If unable to book additional reservations because of a split reservation, please contact Member Services at (989) 671-1125, option 1 to book your future stay with us. When is check-out and check-in at resorts? Check-in for campsites and rental units is at 3 pm EST. Check-out for campsites is at 12 pm noon EST and for rental units is 11 am EST. How do I know if my reservation was accepted? An email will be sent to the email address used to login into CampLife. Please review this email to make sure the correct days were selected. If you need to make any modifications after you received the email, please call Member Services at (989) 671-1125, option 2. All past and future reservations made within CampLife can be viewed under your profile on CampLife under the reservations section. Here you can also cancel your reservation or pay for any outstanding reservation invoices. Who do I contact if I run into any issues? You can reach us at ​ wecare@outdooradventuresinc.com ​ or by phone at (989) 671-1125, option 2. We’re here to help you navigate CampLife! What are considered holiday dates? At Outdoor Adventures, our company-recognized holidays include the weekends of Memorial Day, Independence Day, Labor Day, and special Halloween weekends. Annual dates will be published through CampLife, email, and on social media so please be sure you look for those every year. When booking a reservation, is it for a specific campsite or rental unit? Yes, all reservations whether made over the phone or on CampLife are for a specific campsite or rental unit. When you log in to CampLife and select your dates, you will see each available site or rental unit. The one you select is the specific location where you will be staying. What is cancellation protection? Cancellation Protection waives all cancellation costs* that may occur within two (2) days of a reservation due to unforeseen circumstances. Documentation or reason for canceling will not be required to waive cancellation costs for those who purchase protection. This includes any prepaid fixed lodging costs paid at the time of reservation*. Members can purchase this protection for an additional $15 per reservation for campsites and $30 per reservation for fixed lodging. *Reservation fees are nonrefundable. Our Resorts Quick Links Main Office 800 Washington Ave #200 Bay City, Michigan 48708 Telephone: 989-671-1125 Billing: (989) 671-1191 wecare@outdooradventuresinc.com Lake Shore Resort Address: 4392 N. Irish Rd. Davison, MI 48423 Saginaw Bay Resort Address: 4738 Foco Road Standish, MI 48658 Niagara's Lazy Lakes Resort Address: 4312 Church Road Lockport, NY 14094 Mount Pleasant Address: 340 N. Loomis Road Mt. Pleasant, MI 48858 Kalamazoo Address: 8368 W. C -Ave. Kalamazoo, MI 49009 Affiliate Resorts Ohio, Illinois Copyright © 2016-2020 Outdoor Adventures, Bay City, MI : All Rights Reserved PRIVACY POLICY • CONTEST RULES • POLICIES Designed & Maintained by: Cadmium Design Studios Menu Home Free RV Camping Getaway About Who We Are History We Care Legacy of Improvements News Careers Resorts Niagara’s Lazy Lakes Lake Shore Saginaw Bay Mt. Pleasant Kalamazoo Affiliate Resorts Guest Guide Activities Members Contact Us Reservation Resources - Outdoor Adventures Resorts Need Help? Hello! How can we help you today? For all reservations, call (989) 671-1125. Name * Member # Email * I need info about: * My Membership New Membership Billing RV Storage Resort Amenities Other Message * Email This field is for validation purposes and should be left unchanged. Δ"
    },
    {
      "url": "https://outdooradventureclub.com/staff/",
      "text": "Outdoor Adventure Club - Meet the Guides of Outdoor Adventure Club Toggle Navigation Adventure Calendar Full Adventure Calendar Events By Activity Backpacking Hiking Rock Climbing Hiking & Camping Snowshoeing AIARE Avalanche Backcountry Ski & Snowboard Become a Member Membership Options Member Log-In About Us About the OAC Meet Our Staff FAQs Jobs Openings Contact Us Search for: Meet Our Staff Meet Our Guides A big part of the value of going on an Outdoor Adventure Club trip is having a professional guide lead you. We’ve assembled a top-notch crew of guides who dedicate themselves to being professionals. All guides for the Outdoor Adventure Club are Wilderness First Responders (an advanced first aid certification) and receive nationally recognized training in their guiding discipline. All OAC guides also attend seasonal staff training sessions in the field. In addition to being well trained, all OAC guides have great personalities and are a lot of fun to be with in the outdoors. They are patient instructors and will make you feel comfortable as you reach for your outdoor goals. Join us on a trip and you’ll see the difference our training and experience makes! Richard Bothwell, Owner and CFO (Chief Fun Officer) Since 1996, Richard has been the OAC's  backwoods expert, climbing guide, splitboard guide, and a pretty good backcountry cook, too. Richard has climbed, skied, snowboarded and guided OAC trips all over the world including 4 of the \"7 Summits\" (Kilimanjaro, Aconcagua, Denali, and Elbrus). He's climbed extensively in the Cordillera Blanca of Peru, including summtiing Alpamayo, Artesonraju, and Tocllaraju. He's also snowboarded down 7500 meter/24,000' peaks in China. He's surfed (poorly) on four continents as well. Richard served at the Executive Director of AIARE (American Institute of Avalanche Research and Education) from 2016-2018. In 2023, Richard authored Light Tours of Tahoe , a backcountry ski guide focusing on mellow tours that avoid avalanche terrain. Certifications and trainings that Richard holds or has held:\nAMGA Single Pitch Instructor and Top Rope Site Manager,  AMGA Apprentice Backcountry Ski Guide, AIARE Level 3 avalanche training, AIARE Avalanche Course Leader, Wilderness First Responder, PSIA 1 Ski Instructor, and ACA Sea kayak instructor. Richard is passionate about avalanche education and backcountry snowboarding. In addition to his work with the OAC, he teaches avalanche classes for The Nickolay Dodov Foundation, Feather River College and Lake Tahoe Community College. Most of all, Richard loves connecting with people and sharing his knowledge with others. Join him on an upcoming trip or class! Richard can be reached at richard@OutdoorAdventureClub.com. Mandy Benbow, Trail Operations Manager and Guide Mandy is originally from Florida, where she spent the first half of her life kayaking, stand up paddle boarding, and competing in all distances of running from 5ks to Ultramarathons. After a 15-year career as a personal trainer & massage therapist for endurance athletes, she decided to test out the trails and mountains out west and hasn't looked back. In 2017 Mandy began her journey working as an adventure tour guide, leading cross country hiking tours throughout Utah, Arizona, Montana, Wyoming, and California. She now calls the North Bay area home and has become an avid California naturalist, and a backpacking & sea kayak guide.  When not guiding you can find her roasting coffee, gardening or seeking international travel adventures from the Scottish Highlands to the mountains of Japan. Mandy has a passion for empowering others to feel confident in outdoor spaces while sharing the ways we all can be less impactful. Sean Delacour, Guide Sean was raised in Tahoe and grew up backpacking throughout the Sierra Mountains. He has been skiing since he learned to walk, eventually racing, ski patrolling, and coaching youth ski teams. He has a bachelors degree in Recreation Administration from California University Chico, and holds AIARE, Swiftwater Rescue, Rescue Diver and Technical Rope Rescue certificates. He is also a Cal Fire EMT. Pretty bad ass!  When not guiding or working, you can find him hanging out at home or traveling to share his great appreciation for the backcountry with his wife and two kids. Logan Falley, Guide Logan has been bringing his enthusiasm and curiosity into the backcountry for many years and in many different places. His journeys have taken him from scuba diving in the Atlantic, to countless explorations of the Andes, to dusty desert climbing. Since moving to California in 2017, the Sierra has been his playground and he's enjoyed taking others along for the ride. Logan has dedicated himself as an outdoor educator and adventure guide, encouraging connection with self and others in beautiful places. When he's not guiding adventure oriented experiences, you can find Logan holding space in ecotherapy settings. He also loves ceramics and making pottery for his friends and family. Mike Boyd, Guide Mike was born and raised in Orange County, California, where he grew up exploring the outdoors hiking, mountain biking, rock climbing, skate boarding and surfing. He has worked as a wilderness guide for a variety of outdoor companies in Oregon, Utah and California leading backpacking trips and a variety of wilderness activities. Next to backpacking, Mike’s 2nd favorite outdoor activity is surfing and has surfed up and down the California coast and down into Baja.  Mike holds a AAS degree in Wilderness Leadership and Experiential Education and a BS in Recreation Administration with a focus in Parks and Natural Resources Management. He is certified as a Wilderness First Responder/CPR and certified sea kayak instructor through the American Canoe Association. When not backpacking or surfing, you’ll likely find Mike spending time with his wife, son, and his favorite adventure buddy, his Boykin Spaniel, Coda. Emily Croharé, Guide Emily is most passionate about splitboarding, climbing, and surfing and has chased this stoke across Chile, Argentina, Colombia and Costa Rica. In the US, she spent most of her time in Colorado, Utah, Washington, Oregon, and California seeking out awe-inspiring moments that are usually found in the snow or hanging off a rock face. For the last 5 years Emily has been traveling around in her hand-built micro tiny house, and is currently based out of Tahoe. She loves sharing experiences in the outdoors with others, and is especially passionate about empowering women to claim their space in outdoor sports. Emily has a Master's in Exercise Physiology, is a Registered Prana Vinyasa Yoga Teacher, an AASI Certified Snowboard Instructor, and an AMGA Rock Climbing Instructor. Trask Baughman, Guide Trask has been a guide and educator for the National Outdoor Leadership School (NOLS) since 2010. He grew up exploring western Montana, where he learned to rock climb at a young age. In 2012, he completed an Alpine rock course from the American Rock Guide Association. Trask has served as the lead instructor and educational coordinator for the West Central Montana Avalanche Center for the last five years. He currently lives in the Bay Area, and is the lead climbing guide and instructor for the OAC. When not climbing or sharing his passion for the sport, Trask enjoys surfing, climbing, and sampling all the excellent local food. Sam Eller, Guide Sam is born and raised in Oklahoma where he grew up hiking and bird watching with his family. He quickly felt the urge to move to the west coast and explore bigger landscapes. During his time in college he began backpacking and climbing and shortly thereafter leading peers on trips. Since that time, Sam has continued to develop his mountain craft, expanding into the world of the backcountry on a splitboard. Sam loves to share the magic of the outdoors and passionately believes that the right access wild spaces is for everyone. He holds a WFR, an AIARE Pro 1 Certificate, and is an AMGA Rock Climbing Instructor. Jennifer Couch, Office Manager Jennifer works in the office for the OAC. She handles almost anything that has to do with reservations, guest communications, accounts receivable, payroll, website, social media and marketing.  Jennifer went on our Patagonia Rafting trip in 1998 as a guest, and has been involved with the OAC ever since. She loved it so much she even married the owner! Outside of the office, Jennifer enjoys snowboarding, rock climbing, swimming, and teaching ballet, and can be found on the occasional OAC rafting trip.  You can reach Jennifer at jennifer@OutdoorAdventureClub.com. Cecily Scherschligt, Guide Nicolas Smith, Guide Jade Ferragut, Guide Check out our full adventure calendar Find Your Adventure outdoor_adventure_club Load More... Mail Facebook Instagram Twitter Yelp YouTube Get Our Weekly Newsletter Member Login Email Password Forgot password? - Adventure Calendar Memberships Gift Certificates FAQs Trip Cancellation Policy Weather Links Custom/Corporate Events Rental Gear Jobs with the OAC Privacy Policy Contact Us © Outdoor Adventure Club LLC, San Francisco, CA"
    },
    {
      "url": "https://www.outdooradventuresinc.com/contact-us-2/",
      "text": "Contact Us : Outdoor Adventures Resorts (989) 671-1125 wecare@outdooradventuresinc.com Outdoor Adventures Resorts Home Free RV Camping Getaway About Who We Are History We Care Legacy of Improvements News Careers Resorts Niagara’s Lazy Lakes Lake Shore Saginaw Bay Mt. Pleasant Kalamazoo Affiliate Resorts Guest Guide Activities Members Contact Us Home Contact Us Want to get in touch? We'd love to hear from you. Our top priority across the company is to provide unparalleled customer service. You, your friends, and family are our primary focus. Your customer feedback is important to us to build a lifelong relationship with you. We hope that you’ll get in touch with us to submit requests, suggestions and feedback. If you should ever have a complaint, we take all customer feedback seriously and will respond quickly to any needs that you should have. It’s our sincere desire that you will have a great time while camping with us in one of our RV resorts and campgrounds. Home Office 800 Washington Ave #200 Bay City, Michigan 48708 General: (989) 671-1125 or toll-free (888) 249-1995 Member Services: (989) 671-1125, option 2 Billing: (989) 671-1191 Pay Membership Account By Phone: (800) 447-1760 Fax: (989) 671-1192 wecare@outdooradventuresinc.com Current Hours: Member Services & Reservations: Mon-Fri, 8 am – 5 pm, Sat-Sun: Closed Billing: Mon-Fri, 8 am – 7 pm, Sat 9 am – 5 pm, Sun Closed Other Administrative Offices: Mon-Fri, 8 am – 5 pm, Sat-Sun: Closed Name * Member # Email * I need info about: * My Membership New Membership Billing RV Storage Resort Amenities Other Message * Phone This field is for validation purposes and should be left unchanged. Δ Contact any of our Resorts Lake Shore 4392 N. Irish Rd. Davison, MI 48423 Security: (810) 658-3388 ext. 2 Store: (810) 658-3388 ext. 4 Saginaw Bay 4738 Foco Road Standish, MI 48658 Security: (989) 846-1357 Store: (989) 846-0128 Mt. Pleasant 340 N. Loomis Road Mt. Pleasant, MI 48858 Security: (989) 772-5953 Store: (989) 772-5961 Rifle River 334 Melita Road Sterling, MI 48659 Security: (989) 654-3315 Store: (989) 654-3195 Wilderness 1050 Husak Road Omer, MI 48749 Security: (989) 653-2091 Store: (989) 653-2224 Kalamazoo 8368 W. C -Ave. Kalamazoo, MI 49009 Security: (269) 888-2579 Store: (269) 337-0959 Niagara’s Lazy Lakes 4312 Church Road, Lockport, NY 14094 Store: 1-800-874-2957 Our Resorts Quick Links Main Office 800 Washington Ave #200 Bay City, Michigan 48708 Telephone: 989-671-1125 Billing: (989) 671-1191 wecare@outdooradventuresinc.com Lake Shore Resort Address: 4392 N. Irish Rd. Davison, MI 48423 Saginaw Bay Resort Address: 4738 Foco Road Standish, MI 48658 Niagara's Lazy Lakes Resort Address: 4312 Church Road Lockport, NY 14094 Mount Pleasant Address: 340 N. Loomis Road Mt. Pleasant, MI 48858 Kalamazoo Address: 8368 W. C -Ave. Kalamazoo, MI 49009 Affiliate Resorts Ohio, Illinois Copyright © 2016-2020 Outdoor Adventures, Bay City, MI : All Rights Reserved PRIVACY POLICY • CONTEST RULES • POLICIES Designed & Maintained by: Cadmium Design Studios Menu Home Free RV Camping Getaway About Who We Are History We Care Legacy of Improvements News Careers Resorts Niagara’s Lazy Lakes Lake Shore Saginaw Bay Mt. Pleasant Kalamazoo Affiliate Resorts Guest Guide Activities Members Contact Us Contact Us : Outdoor Adventures Resorts Need Help? Hello! How can we help you today? For all reservations, call (989) 671-1125. Name * Member # Email * I need info about: * My Membership New Membership Billing RV Storage Resort Amenities Other Message * Email This field is for validation purposes and should be left unchanged. Δ"
    },
    {
      "url": "https://www.adventureunlimited.org/about-us/contact-us/",
      "text": "Contact Us | Adventure Unlimited Skip to content Search Search A/U Ranches DiscoveryBound 100 Elk About Us History Vision & Mission Team Trustees Alumni Board FAQs Publications Contact Us Our Experiences A/U Ranches DiscoveryBound Youth Programs Adult Programs All Ages Programs Your Stories Photos & Videos Get Involved Event Calendar Alumni Volunteer Partner with Us Join the Team Support Ways to Give Donate Recurring Gifts 2024 Donors About Us History Vision & Mission Team Trustees Alumni Board FAQs Publications Contact Us Our Experiences A/U Ranches DiscoveryBound Youth Programs Adult Programs All Ages Programs Your Stories Photos & Videos Get Involved Event Calendar Alumni Volunteer Partner with Us Join the Team Support Ways to Give Donate Recurring Gifts 2024 Donors Search Search Contact Us Donate contact Us Headquarters 5201 South Quebec Street Greenwood Village, CO 80111 Call: 888.416.7348 A/U Ranches P.O. Box 2036 18325 County Road #366 Buena Vista, CO 81211-2036 Call: 888.543.4849 Email auranches.org DiscoveryBound 5201 South Quebec Street Greenwood Village, CO 80111 Call: 888.416.7348 Email discoverybound.org Please send us a message and we will get back to you. Thank you! Contact \" * \" indicates required fields Name * First Last Email * Website - share which of our websites you were visiting Subject * Message * CAPTCHA Facebook This field is for validation purposes and should be left unchanged. Team Administration Michael Brown President 888.416.7348 101 Email Finance & HR Jon Sherwood Director of Finance and Operations 888.416.7348 109 Email Doug Gibbs Special Projects Manager 888.416.7348 131 Email Chris Hammond Accounts Manager 888.416.7348 114 Email Tommi Johnson Human Resources Manager 720.741.8034 Email Development & Data Joshua Sprague Director of Development & Donor Engagement 888.416.7348 110 Email Laura Lochen Assistant Director – Development Operations 888.416.7348 107 Email Merrily Arnold Data Manager 720.599.7318 Email Harve Kaufmann Development Officer 888.416.7348 121 Email Marketing Amie Chitwood Marketing & Communications Director 888.416.7348 108 Email Melanie Crandell Graphic Designer / Social Media Manager 888.416.7348 144 Email Stephanie Johnson Graphic Designer / Web Manager 888.416.7348 146 Email Marissa Morin Marketing  & Communications Manager 888.416.7348 104 Email Contact Us contact Us Headquarters 5201 South Quebec Street Greenwood Village, CO 80111 Call: 888.416.7348 A/U Ranches P.O. Box 2036 18325 County Road #366 Buena Vista, CO 81211-2036 Call: 888.543.4849 Email auranches.org DiscoveryBound 5201 South Quebec Street Greenwood Village, CO 80111 Call: 888.416.7348 Email discoverybound.org Please send us a message and we will get back to you. Thank you! Contact \"*\" indicates required fields Name* First Last Email* Website – share which of our websites you were visiting Subject* Message* CAPTCHA X/Twitter This field is for validation purposes and should be left unchanged. Team Administration Finance & HR Development & Data Marketing Modal Box modal- Click here to edit the “modal-box” settings. This text is only for editing and will not appear after you publish the changes.\t\n\t\t\t\t\t\tPreview\n\t\t\tmodal- Contact Us Adventure Unlimited Headquarters 5201 S Quebec Street | Greenwood Village, CO 80111 Phone: 888.416.7348 Email A/U Ranches P.O. Box 2036 | 18325 County Road #366 | Buena Vista, CO 81211 Phone: 888.543.4849 Email Sign up for our Newsletters Please enter your name. Please enter a valid email address. Subscribe Something went wrong. Please check your entries and try again. A/U Ranches   |   DiscoveryBound A/U Ranches Facebook A/U Ranches Instagram DiscoveryBound Facebook https://www.instagram.com/discoverybound/ Contact Us Privacy Policy © 2025 Adventure Unlimited. All Rights Reserved."
    },
    {
      "url": "https://www.adventureunlimited.org/about-us/",
      "text": "About Us | Adventure Unlimited Skip to content Search Search A/U Ranches DiscoveryBound 100 Elk About Us History Vision & Mission Team Trustees Alumni Board FAQs Publications Contact Us Our Experiences A/U Ranches DiscoveryBound Youth Programs Adult Programs All Ages Programs Your Stories Photos & Videos Get Involved Event Calendar Alumni Volunteer Partner with Us Join the Team Support Ways to Give Donate Recurring Gifts 2024 Donors About Us History Vision & Mission Team Trustees Alumni Board FAQs Publications Contact Us Our Experiences A/U Ranches DiscoveryBound Youth Programs Adult Programs All Ages Programs Your Stories Photos & Videos Get Involved Event Calendar Alumni Volunteer Partner with Us Join the Team Support Ways to Give Donate Recurring Gifts 2024 Donors Search Search Contact Us Donate About Us Adventure Unlimited offers a variety of engaging, spiritually based activities for Christian Scientists of all ages and their communities. Through programs in our two distinct divisions – the A/U Ranches and DiscoveryBound – Adventure Unlimited nurtures healing and cultivates community in an atmosphere conducive to the practice of Christian Science. LIFE-CHANGING EXPERIENCES Adventure Unlimited has been \"Opening Windows to God\" through life-changing experiences since 1955. Opportunities to live Christian Science are vital to keeping young people and adults engaged in their spiritual practice. A/U Ranches and DiscoveryBound programs bring those opportunities to life. A/U Ranches At the A/U Ranches, adults and youth enjoy mountain biking, rock climbing, whitewater rafting, horseback riding, hiking, and so much more year-round. The loving, inspiring atmosphere helps cultivate confidence and develop moral courage in all our participants. We welcome followers of all faiths to join A/U Ranches activities through our programs, special events, and the 100 Elk Outdoor Center. Go to the A/U Ranches DiscoveryBound DiscoveryBound (DB) programs support an inspired environment where everyone can connect through the shared values of Christian Science. DB Outreach brings events for youth, their families, and friends to your community. The DB National Leadership Council (NLC) offers teens leadership training rooted in a Biblical model of service to God and mankind. DB Compass offers 10th- to 12th-graders yearlong spiritual exploration through monthly video web chats, two retreats, and lifelong friendships. Go to DiscoveryBound Our Strategic Plan Every five years, we embark on a strategic plan to ensure the longevity and sustainability of the organization, along with the goal of inspiring a love for God and a willingness to turn to Him in prayer. We’ve developed a comprehensive plan that will take Adventure Unlimited to the next level through 2030. Read Our Strategic Plan Support that Changes Lives Every gift helps fulfill our work of “Opening Windows to God” for Christian Scientists of all ages, as well as their families and friends. Donate Now Recurring Gift Plan Your Gift More Gift Options Adventure Unlimited Headquarters 5201 S Quebec Street | Greenwood Village, CO 80111 Phone: 888.416.7348 Email A/U Ranches P.O. Box 2036 | 18325 County Road #366 | Buena Vista, CO 81211 Phone: 888.543.4849 Email Sign up for our Newsletters Please enter your name. Please enter a valid email address. Subscribe Something went wrong. Please check your entries and try again. A/U Ranches   |   DiscoveryBound A/U Ranches Facebook A/U Ranches Instagram DiscoveryBound Facebook https://www.instagram.com/discoverybound/ Contact Us Privacy Policy © 2025 Adventure Unlimited. All Rights Reserved."
    },
    {
      "url": "https://www.reachunlimited.org/contact/",
      "text": "Contact - Reach Unlimited Skip to content Special Opportunity Donate Now Volunteer Tours Menu Donate Become a Friend of Reach Corporate Supporters Legacy Giving & Bequests Other Ways to Donate Volunteer Individual Volunteer Group Volunteer Becoming an Ambassador Tours Jobs Donate Now Menu Menu Home About Our Programs Leadership Annual Reports Getting Started Navigating Services for Intellectual Development Disabilities (IDD) Vocational Services Learning Activity Center (LAC) Home and Community-based Services (HCS) ICF / IDD Group Homes What are Intellectual and Developmental Disabilities? Admissions Information FAQs Other Resources Events Golf SpringFest Reach for the Stars Sporting Clay Shoot Our Shops Glass Studio & Gift Shop Greenhouse Microgreens Donate Now Menu Home About Our Programs Leadership Annual Reports Getting Started Navigating Services for Intellectual Development Disabilities (IDD) Vocational Services Learning Activity Center (LAC) Home and Community-based Services (HCS) ICF / IDD Group Homes What are Intellectual and Developmental Disabilities? Admissions Information FAQs Other Resources Events Golf SpringFest Reach for the Stars Sporting Clay Shoot Our Shops Glass Studio & Gift Shop Greenhouse Microgreens Donate Now Contact Home Contact Contact Us Name * First Last Email * Message * Instagram This field is for validation purposes and should be left unchanged. Get in touch Please fill out the form below to get in touch, or use our directory to reach someone to answer your questions. The Administrative Offices and the Learning Activity Center are open weekdays with the exception of the following holidays. New Years Day Martin Luther King Day Good Friday Memorial Day Independence Day Labor Day Thanksgiving Christmas Residential Programs operate year round with the exception of shutting down (facility) based on all the residents away on vacation. Navigate About Getting Started Events Our Shops Contact Board Member Login Administrative Offices Lauren Black, EdD, Executive Director 11832 Mueller Cemetery Road, Suite 200 Cypress, TX 77429 Phone: 281-213-2582 Fax: 281-213-4545 Hours of Operation: Monday through Thursday 8am – 4:30pm Friday 7:30am – 3.30pm The Blair Inez Scianna Learning Activity Center Juan Clopton, MS LAC Director 11832 Mueller Cemetery Road, Suite 100 Cypress, TX 77429 Phone: 281-213-8132 Fax: 281-213-3295 Hours of Operation: Monday through Friday 7am – 6pm 2025 Reach Unlimited Close Home About Our Programs Leadership Annual Reports Getting Started Navigating Services for Intellectual Development Disabilities (IDD) Vocational Services Learning Activity Center (LAC) Home and Community-based Services (HCS) ICF / IDD Group Homes What are Intellectual and Developmental Disabilities? Admissions Information FAQs Other Resources Events Golf SpringFest Reach for the Stars Sporting Clay Shoot Our Shops Glass Studio & Gift Shop Greenhouse Microgreens Donate Now"
    },
    {
      "url": "https://www.outdooradventuresinc.com/outdoor-adventures-adds-to-its-executive-leadership-team/",
      "text": "Outdoor Adventures Adds to its Executive Leadership Team - Outdoor Adventures Resorts (989) 671-1125 wecare@outdooradventuresinc.com Outdoor Adventures Resorts Home Free RV Camping Getaway About Who We Are History We Care Legacy of Improvements News Careers Resorts Niagara’s Lazy Lakes Lake Shore Saginaw Bay Mt. Pleasant Kalamazoo Affiliate Resorts Guest Guide Activities Members Contact Us Home / Blog Outdoor Adventures Adds to its Executive Leadership Team Blog Outdoor Adventures Adds to its Executive Leadership Team 28 Oct / by Kristen Squires / in Blog / Leave a comment Outdoor Adventures Adds to its Executive Leadership Team Announces the Promotion of Alex Webber to the position of Chief Experience Officer Outdoor Adventures, Inc. announces the promotion of Alex Webber to the position of Chief Experience Officer. Alex has been with the company for almost five years and brings deep experience with his background in Human Resources, Accounting, Finance, Risk Management and Operations. This appointment demonstrates a continued commitment and an increased focus on both the employee and membership experience. In his tenure, Alex has overhauled employee benefit offerings, streamlined hiring practices, and built a new employee infrastructure. After being promoted to HR Director in 2018, Alex started to focus on opportunities within Member Services, implementing the company’s first online reservation request system. His efforts will be focused on added resources for the Member Services team, reservation system development, new member onboarding initiatives, and process improvement. “Alex has seen our company grow exponentially, but also sees the opportunity for us to continue to grow,” Jason King, CEO of Outdoor Adventures, said. “As we shift from a capital-intensive mindset in our business to focusing on top-of-the-line customer service and exceptional experiences, I am confident Alex’s relationships and breadth of experience makes him the right person for this role.” Alex is a 2015 graduate of Michigan State University. He holds a Bachelor’s degree in Human Resource Management. He’s currently enrolled at the University of Michigan, pursuing his Master of Business Administration. Related post We Camp with Care: Meet Special Days Camps We Camp With Care 2025 Meet Luke, Outdoor Adventures’ Dog of the Year! 0 Comment Leave a Comment Cancel reply Your email address will not be published. Comment: Name: Email: Website: Save my name, email, and website in this browser for the next time I comment. Δ Recent Posts We Camp with Care: Meet Special Days Camps We Camp With Care 2025 Meet Luke, Outdoor Adventures’ Dog of the Year! Our Newest Outdoor Adventures’ Location: Niagara’s Lazy Lakes The Expansion of Our Kalamazoo Resort is Complete! Recent Comments Lynne Barkley on A Guide to OAI Halloween Weeks! Lynne Barkley on A Guide to OAI Halloween Weeks! Lynne Barkley on A Guide to OAI Halloween Weeks! Anthony on TIPS & TRICKS FOR WINTER CAMPING Sam Andrews on FIVE PIECES OF ADVICE FOR FIRST-TIME RV OWNERS! Our Resorts Quick Links Main Office 800 Washington Ave #200 Bay City, Michigan 48708 Telephone: 989-671-1125 Billing: (989) 671-1191 wecare@outdooradventuresinc.com Lake Shore Resort Address: 4392 N. Irish Rd. Davison, MI 48423 Saginaw Bay Resort Address: 4738 Foco Road Standish, MI 48658 Niagara's Lazy Lakes Resort Address: 4312 Church Road Lockport, NY 14094 Mount Pleasant Address: 340 N. Loomis Road Mt. Pleasant, MI 48858 Kalamazoo Address: 8368 W. C -Ave. Kalamazoo, MI 49009 Affiliate Resorts Ohio, Illinois Copyright © 2016-2020 Outdoor Adventures, Bay City, MI : All Rights Reserved PRIVACY POLICY • CONTEST RULES • POLICIES Designed & Maintained by: Cadmium Design Studios Menu Home Free RV Camping Getaway About Who We Are History We Care Legacy of Improvements News Careers Resorts Niagara’s Lazy Lakes Lake Shore Saginaw Bay Mt. Pleasant Kalamazoo Affiliate Resorts Guest Guide Activities Members Contact Us Outdoor Adventures Adds to its Executive Leadership Team - Outdoor Adventures Resorts Need Help? Hello! How can we help you today? For all reservations, call (989) 671-1125. Name * Member # Email * I need info about: * My Membership New Membership Billing RV Storage Resort Amenities Other Message * Comments This field is for validation purposes and should be left unchanged. Δ"
    },
    {
      "url": "https://www.adventureunlimited.org/an-update-from-the-executive-director/",
      "text": "An Update from the Executive Director | Adventure Unlimited Skip to content Search Search A/U Ranches DiscoveryBound 100 Elk About Us History Vision & Mission Team Trustees Alumni Board FAQs Publications Contact Us Our Experiences A/U Ranches DiscoveryBound Youth Programs Adult Programs All Ages Programs Your Stories Photos & Videos Get Involved Event Calendar Alumni Volunteer Partner with Us Join the Team Support Ways to Give Donate Recurring Gifts 2024 Donors About Us History Vision & Mission Team Trustees Alumni Board FAQs Publications Contact Us Our Experiences A/U Ranches DiscoveryBound Youth Programs Adult Programs All Ages Programs Your Stories Photos & Videos Get Involved Event Calendar Alumni Volunteer Partner with Us Join the Team Support Ways to Give Donate Recurring Gifts 2024 Donors Search Search Contact Us Donate April 30, 2020 An Update from the Executive Director By Gina Lindquist-Bailey In the last few months, our world has changed substantially. The Adventure Unlimited staff, like so many of you, has been working remotely, finding new ways to execute our mission of Opening Windows to God . We’ve also been making decisions on a daily basis about the future of Adventure Unlimited programs in the coming months. Of course, we’re grateful to be able to turn to God for every decision – and we’re thankful for the prayer of our supportive alumni family, too. This metaphysical work remains our primary focus. We’re staying connected by holding our weekly staff meetings via Zoom (about two-thirds of the staff is shown) What we’re doing We’ve been checking in with families and individuals to see how you’re doing. What we’re hearing is that you’re looking forward to our programs this summer! We’re as excited as you are and are doing everything we can to say “yes!” to Youth Camp at the A/U Ranches and DiscoveryBound (DB) programs, including the National Leadership Council (NLC), this summer. The guidelines we developed in conjunction with the Board of Trustees’ executive committee prioritize 1) the safety and well-being of our participants, 2) the safety and well-being of our staff, and 3) operating in compliance with regulation. We’ll follow guidance, once it’s available, from the American Camping Association (ACA) and our governing body, Colorado Childcare, for direction on our summer programming. We’ve taken steps at the A/U Ranches to ensure a high level of safety and cleanliness, including the addition of several handwashing stations at the lodges and at the corrals. The number of times disinfecting is performed over the course of the summer will be increased as well. Meanwhile, construction of the Hub at the A/U Ranches continues through its qualification as an essential service. Check out the progress here. What we’re adjusting Spring Service Weekend at the A/U Ranches and the DB Compass retreat in Boston, both over Memorial Day weekend, have been cancelled, along with the 100 Elk spring season. Much of DB Outreach’s spring programming is postponed to the fall or spring 2021. DB NLC international service trips are being delayed a year. The students impacted will work on other projects this summer, such as Congressional Awards, local service, internships and capstones; we hope a check-in trip is possible at the end of the summer. NLC adventure trips have been moved to less populated locations. On May 4, we’ll determine the timing for staff training at the A/U Ranches. On May 18, we’ll decide whether we can run first session Youth Camp, June Family Camp, and DB NLC adventure trips and orientation summer. Each subsequent week, decisions will be made about programming in the month ahead. Find current information here: A/U Ranches Program Status DiscoveryBound Program Status Working together We’re collaborating through shared resources and best practices with the other five Christian Science camps. Additionally, the Christian Science Nursing division of The Mother Church is helping us consider necessary practical steps. We’re grateful to our institutional funders and Andrews Society donors, who have indicated their ongoing support. In addition, Adventure Unlimited applied for and was approved for a loan from the Small Business Administration under the Payment Protection Program. Financial forecasting of four scenarios in a staggered 2020 schedule for resuming more traditional programming, combined with reduced expenses and the continued support of our donors, has allowed us to feel confident our needs will be met. We’re grateful to report we’ve been able to retain all year-round and winter seasonal staff. Bringing the A/U Ranches and DB to you So how can we execute our mission of Opening Windows to God in this environment? We’re bringing camp and DB to you! You may have already participated in some of our online activities, from morning inspirational discussions and Bible Lesson study on Zoom to Facebook live events, classes and game nights. These are a few of the ways we’re bringing the A/U Ranches and DiscoveryBound to you: “ Whither” sung by Lily and Dwight Oyer Reading and Illustrations of the 91st Psalm with Sten Palmer Camp Song Sing Along with Deb Eastwood Life as an A/U Ranches Seasonal Staffer with Jenna Read and Andrew Lambert-Cole Valerie Lodge kitchen update with Matthew Leon and Mike Kilborn Mystic Aquarium tour with Holly Harz Valentine Virtual Eco Hike with Timon Keller There’s more here: Camp2U DB2You While many factors impacting the path ahead are not within the control of Adventure Unlimited, rest assured, we’ll find ways to continue Opening Windows to God that bless our community. We invite you all to join us in continuing to prayerfully support the organization; this is where we’ll see blessing for our Adventure Unlimited family – and for the world. Share: Share on Facebook 𝕏 Share on X Share on Linkedin Share on Email Categories: Updates Back to Zipline Related Articles Apr 4, 2025 Sep 11 @ 1:18 am 70 Years (Plus a Peek at the 75th!) By Michael Brown, President This year marks our 70th anniversary. It’s always fun to look back at the wonderful traditions, incredible people, and exceptional experiences that have played an important… more Sep 19, 2024 Sep 11 @ 1:18 am Organizational Update: You Belong Have you ever experienced the power of a personal connection when considering whether to try something new? How about the joy of being invited into a community and then welcomed more Jul 8, 2024 Sep 11 @ 1:18 am Boyman Center Dedicated With deep gratitude for Summit Society members Heidy and John Boyman, an enthusiastic group consisting of family members, Adventure Unlimited staff and Service Weekend participants celebrated the dedication of the more Adventure Unlimited Headquarters 5201 S Quebec Street | Greenwood Village, CO 80111 Phone: 888.416.7348 Email A/U Ranches P.O. Box 2036 | 18325 County Road #366 | Buena Vista, CO 81211 Phone: 888.543.4849 Email Sign up for our Newsletters Please enter your name. Please enter a valid email address. Subscribe Something went wrong. Please check your entries and try again. A/U Ranches   |   DiscoveryBound A/U Ranches Facebook A/U Ranches Instagram DiscoveryBound Facebook https://www.instagram.com/discoverybound/ Contact Us Privacy Policy © 2025 Adventure Unlimited. All Rights Reserved."
    },
    {
      "url": "https://www.outdooradventuresinc.com/",
      "text": "Outdoor Adventures In Michigan : Outdoor Adventures, Inc. (989) 671-1125 wecare@outdooradventuresinc.com Outdoor Adventures Resorts Home Free RV Camping Getaway About Who We Are History We Care Legacy of Improvements News Careers Resorts Niagara’s Lazy Lakes Lake Shore Saginaw Bay Mt. Pleasant Kalamazoo Affiliate Resorts Guest Guide Activities Members Contact Us Your Next Memory Awaits! Schedule a tour and free 7-night stay. Camp Free Introducing Niagara's Lazy Lakes Resort! Check out our newest location in Lockport, NY. Read more! Why you need an Outdoor Adventures Membership! Read our 10 reasons why an Outdoor Adventures Membership is the right choice for you. Learn More Outdoor Adventures Our Mission To provide fun and unique outdoor experiences for families to create memories that will last a lifetime! Latest Deals & Specials We give you a chance to visit any of our resort locations in Michigan. Sign up below for one of our specials, we look forward to seeing you! Latest News Keep current with the latest news provided by our staff. Don't forget to check out each resort location for activities. Read Our Blog Amenities Whether you are looking to work or play while you stay with us we have everything for your family needs to enjoy Outdoor Adventures. See what we have to offer Our History We are dedicated to serving our members by providing some of the finest camping resorts where families can enjoy quality time together. How it all started Outdoor Adventures' Giveaways and Winners Enter one of our current giveaways and check out some of our lucky winners from previous ones! Check out the Winners our services We Provide the Best Family Time locations For Everyone Saginaw Bay Saginaw Bay Resort offers shaded campsites and is close to some of the best fishing in Michigan. Explore up north Michigan at this resort where it all started! Read more about Saginaw Bay Kalamazoo We are close to miles of hiking trails. Local wineries offer tastings, and local festivals that celebrate music, food, and culture. Read more about Kalamazoo Lake Shore Our biggest resort jam-packed with fun, including a lazy river, multiple indoor and outdoor pools and hot tubs, beach, putt putt and more! Read more about grand haven Mt. Pleasant Our Mt. Pleasant resort offers you a fun filled stay with CMU, Soaring Eagle Casino, specialty shops, and golf courses nearby for you to enjoy. Read more about Mt. Pleasant Affiliate Resorts Vacation at one of our affiliate resorts, located in the states of Michigan, Ohio and New York each resort strives to bring you the best vacation experience possible. Learn More Legacy of Improvement Our goal is to help you make memories to last a lifetime. Check out how we’ve reinvested back into the resorts to continue to improve your experience! Read more 2208 Hayrides each summer 50095 lost mini-golf balls 1200000 PIECES OF CANDY GIVE OUT EACH HALLOWEEN 3907 ICE CREAM CONES SERVED EACH YEAR latest news From Our Blog We Camp with Care: Meet Special Days Camps 05 Jun / in Blog This June, we’re proud to spotlight Special Days Camps as part of our We Camp with Care campaign. For over 50 years, Special Days Camps has been creating safe, medically supervised camping experiences for children who have faced cancer and their families. We Camp With Care 2025 30 May / in Blog June is here, and with it comes National Camping Month—a wonderful time to celebrate the joy of camping while giving back to our communities. Meet Luke, Outdoor Adventures’ Dog of the Year! 17 Sep / in Blog We’re excited to introduce Luke, a 3-year-old Bernese Mountain Dog from Davison, Michigan, who has been voted our Outdoor Adventures’ 2024 Dog of the Year! This special honor is given in celebration of our member’s beloved furry campering partners. As Dog of the Year, Luke will be featured in our 2025 annual newsletter, highlighted on … Continue reading Meet Luke, Outdoor Adventures’ Dog of the Year! → Preferred Businesses Consider these businesses when you are in the area! Our Resorts Quick Links Main Office 800 Washington Ave #200 Bay City, Michigan 48708 Telephone: 989-671-1125 Billing: (989) 671-1191 wecare@outdooradventuresinc.com Lake Shore Resort Address: 4392 N. Irish Rd. Davison, MI 48423 Saginaw Bay Resort Address: 4738 Foco Road Standish, MI 48658 Niagara's Lazy Lakes Resort Address: 4312 Church Road Lockport, NY 14094 Mount Pleasant Address: 340 N. Loomis Road Mt. Pleasant, MI 48858 Kalamazoo Address: 8368 W. C -Ave. Kalamazoo, MI 49009 Affiliate Resorts Ohio, Illinois Copyright © 2016-2020 Outdoor Adventures, Bay City, MI : All Rights Reserved PRIVACY POLICY • CONTEST RULES • POLICIES Designed & Maintained by: Cadmium Design Studios Menu Home Free RV Camping Getaway About Who We Are History We Care Legacy of Improvements News Careers Resorts Niagara’s Lazy Lakes Lake Shore Saginaw Bay Mt. Pleasant Kalamazoo Affiliate Resorts Guest Guide Activities Members Contact Us Outdoor Adventures In Michigan : Outdoor Adventures, Inc. Need Help? Hello! How can we help you today? For all reservations, call (989) 671-1125. Name * Member # Email * I need info about: * My Membership New Membership Billing RV Storage Resort Amenities Other Message * Name This field is for validation purposes and should be left unchanged. Δ"
    },
    {
      "url": "https://adventures.is/about-us/contact-us/",
      "text": "Contact Us: Bookings & Queries | Arctic Adventures Every night could be the night for the aurora Book Your Spot My Adventures Language/Currency EN Language EN English DE German CN Chinese $ USD ISK ISK $ USD € EUR CA$ CAD £ GBP Tours Tours Day Tours Multi-Day Tours Self Drive Tours Private Tours New Tours See All Tours Activities Activities Ice Cave Tours Glacier Tours Snorkeling Tours Golden Circle Tours Hiking and Trekking Tours Sightseeing Tours Snowmobiling Tours Whale Watching Tours Snaefellsnes Tours Puffin Tours Northern Lights Tours Solar Eclipse Tours South Coast Tours Lava Caving Tours Volcano Tours Ring Road Tours Jokulsarlon Glacier Lagoon Boat Tours Kayaking Tours Jet Ski Tours See All Activities Attractions Attractions Golden Circle Reykjavik Silfra Fissure South Coast Jökulsárlón Glacier Lagoon Ice Caves Glaciers Ring Road Snaefellsnes Peninsula Landmannalaugar Laugavegur Trail Reynisfjara Black Sand Beach Highlands Kerlingarfjoll Kirkjufell Mountain Silver Circle Vik Kerid Crater Wilderness Centre Gullfoss Waterfall Thingvellir National Park Studlagil Canyon Geysir Hot Springs Akureyri See All Attractions Hotels Transfers About Us About Us Contact Us FAQs Information About Us Reviews Blog Deals Luxury Journeys My Adventures EN Language Back EN English DE German CN Chinese $ USD Back ISK ISK $ USD € EUR CA$ CAD £ GBP Contact Us Home About Us Contact Us Contact Arctic Adventures Please check out our Frequently Asked Questions , we may already have a quick answer to your question! You can also chat with our virtual assistant - he is answering questions 24/7! Press the icon on the bottom right to start up the conversation. Check My Bookings . Business Hours Our service desk is open every day from 7 :00 am – 10:30 pm GMT (Monday - Sunday). You are always welcome to send us an e-mail using our contact form. Our friendly customer service will assist you every day during business hours. Talk to our experts: +354 562 7000 For Private & Custom experiences contact our specialists during office hours from 8:00 am - 4:30 pm GMT (Monday - Friday). Get in touch with our private/custom sales department: +354 588 1307 Name * Email * Confirm email * Type of request * Choose... Not booked Already booked Not booked * Interested in booking Questions about tours/s Availability Other The availability for each tour can be found in the booking calendar on a right hand side Types of tour * Choose... Day Tours Multi-Day Tours Self Drive Private tour / Custom Tour Estimated departure date Number of travelers Already booked * Change/Amend an order Add rental gear and/or extras Pick up inquiry Refund request Share feedback Canceling an order Question about tour Urgent request regarding a tour departing tomorrow The easiest way to cancel your booking is through my.adventures.is Manage your booking Please note that all cancellation requests must be sent from the lead traveler of each reservation and delivered to Arctic Adventures in writing through the following contract form in order to be valid. Please confirm that you have read our cancellation policy thoroughly and know the cancellation fees that may apply. Our full cancellation policy can be found on our website, enclosed to this email and/or by clicking the following link: Terms and Conditions It is important that you fill out the following fields and inform us if you wish to cancel your order partly or in full. Once the cancellation request has been processed, you will receive a confirmation email from our Customer Support Team. We hope that you had a great time and enjoyed your adventures with us. Customer satisfaction is something we take very seriously so any feedback you can provide us with is highly appreciated. Please remember to include the name of the tour(s). We hope that you had a great time and enjoyed your adventures with us. Customer satisfaction is something we take very seriously so any feedback you can provide us with is highly appreciated. Please remember to include the name of the tour(s). Tour Name or URL For most of our tours, we rent out hiking shoes and waterproof clothing. These items are among the items that we highly recommend bringing with you for our tours as the weather here in Iceland can be quite unpredictable. For our multi-day tours, we then have an even greater list of extras that can be added. Among those items are luggage storage, sleeping bag, single supplement, special food request and hiking poles. You can add rental gear to your reservation the latest the day before your tour departure. If you have already booked your tour and would like to add any of these items to your reservation then please do it by logging into our customer portal - My Adventures . Please make sure to fill in your size information so that your guide will know which sizes to bring along for the tour. If you run into any problems using the customer portal then please do let our customer support team know. We would be more than happy to help you out. If you have to report any last minute changes to your reservation or have an urgent request regarding a tour departing tomorrow we recommend reaching out to us via Facebook Messenger. Chat with us on Facebook Messenger It's easy to update your order details such as your pick up location by logging into My Adventures, our customer portal. My Adventures Here you  can reschedule, update pickup / dropoff location, get your voucher and see if the tour is on schedule or delayed. You can press the login button in your confirmation email for an easy login to the customer portal. Arctic Adventures offers pick up service from selected Reykjavík pick up points. Read all about our pickup process here: https://adventures.is/information/pick-up/ Note that you can always update your pick-up / drop-off location through My Adventures: https://my.adventures.is/login You can press the login button in your confirmation email for an easy login to the customer portal. If you experience an error with logging into My Adventures or can't find your booking, please contact us on Facebook Messenger , or send us an email to: pickup@adventures.is . Booking number * See booking confirmation ID from your voucher or confirmation email - Ex. ADV-0000000 Tour departure date Message * DO NOT REMOVE. This is the address to send the form to internally. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Language/Currency en English en English de German cn Chinese $ US Dollars ISK Icelandic Krona $ US Dollars € Euro CA$ Canadian Dollar £ British pound sterling Follow us Arctic Adventures About Us Information Reviews Certifications & Awards Sustainability Terms & Conditions Cancellation Policy Privacy Policy Best Price Guarantee Media FAQs Sitemap For Travelers My Bookings Tour Pick-up Hotels Northern Lights Forecast Flybus Airport Transfer Blue Lagoon Transfer Attractions Locations Blog Our Tours Iceland Tours Special Offers Day Tours Multi-Day Tours Private Tours Self-Drive Tours New Tours in 2025 Summer Tours Winter Tours Vacation Packages Winter holiday tours Get in Touch Contact Us Work With Us Travel Agents Customer Care: Mon-Sun 7:00 am - 10:30 pm GMT Private Travel Desk: Mon-Fri 8:00 am - 4:30 pm GMT Considering buying a tour? Talk to our experts: +354 562 7000 Contact us for private/custom tours: +354 588 1307 © Copyright 2025. Arctic Adventures All rights reserved."
    }
  ]
}