{
  "fuentes": [
    {
      "url": "https://www.adventhealth.com/foundation/adventhealth-foundation-central-florida/meet-our-team",
      "email": "foundationinfo@adventhealth.com"
    },
    {
      "url": "https://leadiq.com/c/adventhealth/5a1d95dc23000059008482d3/employee-directory",
      "email": "name@company.com"
    },
    {
      "url": "https://leadiq.com/c/adventhealth/5a1d95dc23000059008482d3/employee-directory",
      "email": "sales@leadiq.com"
    }
  ],
  "mails": [
    "foundationinfo@adventhealth.com",
    "name@company.com",
    "sales@leadiq.com"
  ],
  "nombre_sitio": "adventhealth.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.adventhealth.com/foundation/adventhealth-foundation-central-florida/meet-our-team",
      "text": "Meet Our Team | AdventHealth Foundation Central Florida | Formerly Florida Hospital Foundation Skip to main content Search Search Donate Menu Close AdventHealth Foundation Search Search Donate Areas to Support Areas to Support Areas to Support Ways to Give Ways to Give Make a Donation Monthly Giving Pledge Payment Legacy Giving Employee Giving Attend an Event Start a Fundraiser Honor Your Caregiver Get Involved Get Involved Get Involved Employee Giving Honor Your Caregiver Planned Giving Fundraise for a Cause Ways to Give Join The Well - Monthly Giving Your Impact Your Impact Your Impact Cancer Care Children’s Care Diabetes Care Heart, Lung, and Vascular Care Hospice Care Sharing Smiles Events Events Events Calendar of Events Create Your Own Event Signature Events About Us About Us About Us Contact Us Meet Our Team Subscribe to Our Newsletter Our Blog Our News About Us Areas to Support AdventHealth Home Areas to Support Areas to Support Ways to Give Make a Donation Monthly Giving Pledge Payment Legacy Giving Employee Giving Attend an Event Start a Fundraiser Honor Your Caregiver Get Involved Get Involved Employee Giving Honor Your Caregiver Planned Giving Fundraise for a Cause Ways to Give Join The Well - Monthly Giving Your Impact Your Impact Cancer Care Children’s Care Diabetes Care Heart, Lung, and Vascular Care Hospice Care Sharing Smiles Events Events Calendar of Events Create Your Own Event Signature Events About Us About Us Contact Us Meet Our Team Subscribe to Our Newsletter Our Blog Our News About Us Areas to Support AdventHealth Home About Us Supporting Patients and Families in Central Florida and Beyond The foundation directly supports programs and services at AdventHealth through a multitude of gifts from local, passionate community members invested in creating a whole-person health care experience that includes treating the body, mind and spirit. Foundation Overview View the areas to support Meet Our Team 7 items. To interact with these items, press Control-Option-Shift-Right Arrow Expand All Collapse All Betsy Chapin Taylor, Foundation President and CEO Betsy Chapin Taylor, FAHP, is an award-winning author, speaker, and consultant with 30 years of experience in health care philanthropy, including 17 years as chief philanthropy officer and foundation president in various hospitals. She specializes in leadership engagement and philanthropy strategy. Betsy is the CEO of Accordant, a health care consulting firm focused on advancing philanthropy, board governance, leadership, communications, and health equity. Her personal experiences as a breast cancer survivor fuel her passion for elevating health and well-being for all. Betsy is a prolific author and editor, contributing to numerous publications on health care philanthropy. She has been featured in trade publications such as Healthcare Executive, Modern Healthcare, and Forbes. Betsy also holds faculty appointments with the American College of Healthcare Executives and The Governance Institute, and is a member of several professional organizations, including the Forbes Nonprofit Council and the Association for Healthcare Philanthropy. Recognized as one of the Top 50 Women in Healthcare by Women We Admire, Betsy has received the Si Seymour award, the highest professional honor from the Association for Healthcare Philanthropy. She holds a Master's in Journalism from Columbia University and an MBA from the University of Georgia, along with the highest level of certification as a Fellow of the Association for Healthcare Philanthropy (FAHP). Jennifer McGreevy, Vice President Jennifer McGreevy serves as a Vice President within the AdventHealth Foundation Central Florida and manages philanthropy efforts within the Children’s Hospital and the Heart, Lung and Vascular Institute.  An accomplished fundraising leader with over 25 year of experience she spent the last decade leading Cleveland Clinic Florida’s advancement programs, greatly expanding philanthropic support for their tertiary and quaternary care, research and education.   Prior to that she worked in education philanthropy as the Director of Annual Giving at Mount Saint Mary’s University and she successfully led capital campaigns at two different private secondary schools in Maryland.  Jennifer also served as Director of Donor Relations and Special Events at Suburban Hospital, a Johns Hopkins and NIH affiliate located just outside of Washington DC. Jennifer has an undergraduate degree from Hood College in Frederick, MD and a master’s in business administration from Mount Saint Mary’s University.  She is passionate about healthcare philanthropy and the meaningful impact grateful individual have on the future of medicine and the lives of patient.  Jennifer and her husband have two daughters, one attending university in New York and one in California. Ayslinn Husebo, Director of Stewardship and Donor Communications Ayslinn Husebo joined AdventHealth in 2005 as a Marketing Manager for the Winter Park campus. Throughout her eight years in marketing, she managed comprehensive system and service line campaigns, multi-channel media buys and developed the Healthy 100 loyalty program through email, web, social, events, corporate relations and employee wellness initiatives. Ayslinn is currently the Director of Communications and Annual Giving. She was brought on to the Foundation team in 2013 to produce the largest fundraising event in Central Florida, Golden Gala. She and her team managed over 50 annual core and endorsed events along with a 60+ group of community champions that focus on Golden Gala Auction. Most recently, Ayslinn leads external and internal communications, digital and online platforms, annual giving campaigns for over 10 beneficiaries and oversees marketing and branding for AdventHealth Foundation Central Florida. A Florida native, Ayslinn graduated with a Bachelor of Arts in Music and a minor in Business from Palm Beach Atlantic University and moved to Central Florida shortly after getting married. Ayslinn, her husband and two kids enjoy the beach and college football. She loves her career and the people she works with and considers AdventHealth her second family. Marnie LeGros, Director of Accounting Marnie LeGros has spent more than 28 years in hospital accounting. She began her career in higher education at the University of South Alabama. In 1999, Marnie moved from Alabama to central Florida and worked for Orlando Health for the next 19 years. In 2018, she joined AdventHealth Foundation Central Florida to lead the accounting changes within the Foundation. After 2 years, life changes brought her to AdventHealth Hendersonville to manage the accounting for AdventHealth Medical Group. Marnie rejoined AdventHealth Foundation Central Florida in 2023 where her passion for philanthropy and accounting knowledge can help lead AdventHealth Foundation Central Florida into the future. Marnie has an undergraduate degree in accounting from the University of South Alabama, and a master's in health care administration from the University of St. Francis. Marnie is a 10-year breast cancer survivor that understands the importance of healthcare and support beyond medicine. Whole person care during healthcare challenges is what drew her to AdventHealth's mission to extend the healing ministry of Christ. She has a passion for healthcare and through philanthropy, those that are in need can be cared for beyond medicine through the generosity of others. Marnie has two children, one an ICU transplant nurse at the University of Florida Shands, and the other a graduate of criminal law pursuing service as a law enforcement officer. Patricia Bornstein, Director of Development Patricia Bornstein is a Director of Development for AdventHealth Foundation Central Florida and has served on the Foundation team for more than 13 years.  She oversees three areas for the hospital’s philanthropic mission: the Heart, Lung and Vascular Institute, Transplant Institute and Winter Park Hospital. Patricia has over 25 years of experience in non-profit fundraising, ranging from major gifts to planned giving, corporate sponsorships to capital campaigns, and annual campaigns and special events.  Previous positions include Campaign Director for the Jewish Federation of Greater Orlando and Vice President of Development for the Coalition for the Homeless of Central Florida. She also served as Director of Community Relations for a U.S. Congressman and Campaign Director for several local political campaigns. Patricia has a Master’s Degree in Public Administration (MPA) from the University of Central Florida and a Bachelor’s Degree in Labor Relations from the University of Michigan. Patricia has lived in Orlando since 1985. Her current community volunteerism includes serving on the Executive Board and chairing the Diversity Equity and Inclusion Committee of Florida Executive Women (FEW). In previous years, Patricia was active in the Jewish community and helped spearhead her synagogue’s capital campaign and was chair of the Women’s Division Campaign for the Jewish Federation of Greater Orlando.  Patricia and her husband live in Winter Park and have three adult children, two who live in Austin and one in Boston. Courtney Staup, Director of Development Courtney Staup has dedicated her professional career to advancing community health and wellness through philanthropy. With over 20 years of nonprofit fundraising experience, she has led annual campaigns and fundraising boards, organized strategic fundraising events, and participated in successful capital campaigns helping donors advance transformational projects for our community. Courtney joined AdventHealth Foundation in 2007, and supported AdventHealth’s Healthy 100 Campaign, raising over $150,000,000 for vital health and wellness priorities AdventHealth. She has supported affordable housing at Habitat for Humanity Greater Orlando, successfully completing Central Florida’s first Habitat for Humanity multi-family housing development – Staghorn Villas. Courtney oversees two Foundation Boards: AdventHealth Cancer Institute Foundation Board and AdventHealth Neuroscience Institute Foundation Board. She also leads major gift fundraising efforts to advance AdventHealth Research Institute and AdventHealth Diabetes Institute. Courtney enjoys supporting the dedicated clinical and research teams at AdventHealth and helping to connect the community in meaningful ways through philanthropy. “Donors have a unique opportunity to change the trajectory of the health and wellness for this and future generations through gifts aimed at advancing clinical care and outcomes.” Her favorite part of this work is seeing the impact of donor support through innovative projects and programs and the legacy of generosity that’s created through philanthropic gifts. Courtney graduated from Flagler College in St. Augustine, FL with a Bachelor of Arts and is married with two children. Executive Board Brea A. Weiss Executive Board Chair Board Chair, AdventHealth for Children Bill Boyles Treasurer David Daniels Member at Large Felicia DeHaney Member at Large Dr. Christopher E. Dobson, II Board Member Board Chair, Sharing Smiles Ericka Dunlap Board Member Dr. Josef Ghosn Board Member President, AdventHealth University Dena Jalbert Board Member Margaret Kohn Board Member Board Chair, Neuroscience Institute Derek Lewis Member at Large Marc McMurrin Member at Large Anthony Nicholson Honorary Board Member Sonja Nicholson Honorary Board Member Kenneth Robinson Member at Large Betsy Chapin Taylor Board Member Foundation Interim President Thomas Yochum Member at Large Expand All Collapse All Philanthropy at AdventHealth AdventHealth is one of the largest faith-based health care systems in the United States. With a focus on whole-person care, we are so much more than a hospital. We are a network of people committed to promoting wellness through the delivery of compassionate care for every stage of life. Founded in 1908 in Orlando, AdventHealth has grown into a national health care system with more than 80,000 team members working at 50 hospitals and hundreds of care sites in almost a dozen states. AdventHealth’s Central Florida Division encompasses more than 20 hospitals and ERs, and more than 500 outpatient sites in the six counties in and around metro Orlando. The world-class hospitals, combined with a comprehensive outpatient care network, see more than three million patients annually. Established by pioneering members of the Seventh-day Adventist Church, AdventHealth’s long-standing mission is one of providing whole-person care – treating not just the body, but the mind and spirit too. Generosity Heals Generosity has been an important part of our legacy that currently impacts 3.4 million patient visits per year, 37,000+ employees, 3,500+ Physicians and 176 Medical Specialties. Every year, thousands of individuals, families, and organizations make donations and share the healing power of generosity. This support strengthens programs and services, catapults innovative research projects and ensures that we can provide the best patient care possible. Today, we are expanding into genomics, a personalized approach to health care, ground-breaking research, and increasing specialized health services. These advancements are only possible because of the generous people in our community – people like you. A Community Impacting Patient Care AdventHealth Foundation Central Florida is a 501©(3) non-for-profit foundation that directly supports AdventHealth care facilities, programs, and services across three counties throughout Central Florida. We are committed to providing hope and healing in Central Florida and beyond to patients, families, and even our own team members in need. Inside and outside of our walls, we also serve on a global level to extend the healing ministry of Christ. Philanthropic support of our mission provides a margin of excellence that allows AdventHealth to launch innovative programs more quickly than it could through normal operations and allows us to achieve goals that would not otherwise have been possible. Today’s investments can lead to tomorrow’s medical breakthroughs. Generosity provides capital, research, and programmatic initiatives to advance patient care in our community. In addition: Engaging the community through our boards and volunteer opportunities helps us stay close to people to make sure we are providing the services and care they desire. Our goal is to provide you and your family with the best care available right here in Central Florida so you don’t have to travel far to treatment. Donating allows you to make a true impact and be an integral part of the care team, just as important as our physicians and nurses. Areas supported by Philanthropy -    AdventHealth Hospital Campuses: Altamonte Springs Apopka Celebration East Orlando Kissimmee Orlando Winter Garden Winter Park -    AdventHealth Cancer Institute -    AdventHealth Diabetes Institute -    AdventHealth for Children -    AdventHealth for Women -    AdventHealth Heart Lung Vascular Institute -    AdventHealth Hospice Care -    AdventHealth Neuroscience Institute -    AdventHealth Orthopedic Institute -    AdventHealth Research Institute -    AdventHealth Transplant Institute -    AdventHealth University -    Global Missions -    Sharing Smiles AdventHealth Foundation, Inc. does business as AdventHealth Foundation Central Floridaunder tax ID 59-2219301. A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES BY CALLING TOLL-FREE WITHIN THE STATE 1-800-HELPFLA, OR VIA THE INTERNET AT https://www.fdacs.gov/Consumer-Resources REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL, OR RECOMMENDATION BY THE STATE. Contact Us Our mission to extend the healing ministry of Christ is woven throughout our work to connect with people who give in different ways. Your generous support allows us to continue on our journey to excellence and makes a meaningful difference in the countless lives we touch each day. Connect with us today to get move involved. AdventHealth Foundation Central Florida 800 North Magnolia Ave. Sixth Floor Orlando, FL 32803 Call 407-303-2784 | email AdventHealth Foundation Central Florida is deeply grateful for the support of our friends in the community. If you would prefer not to receive mail from us, please email us telling us so, and we will remove your name from our list. Contact Us Form Subscribe to Our Newsletter AdventHealth Foundation Explore: Our Events About Us Your Impact Newsletter Information For: Support Get Involved Fundraising Pledge Payment AdventHealth Global Homepage View All Our Doctors View All Our Locations Mission and History Community Benefit Our Partnerships News and Stories Blogs CREATION Life Employees Legal Privacy Policy Patient Privacy - HIPAA Patient Rights and Responsibilities Financial Assistance Patient Nondiscrimination Social 4 items. To interact with these items, press Control-Option-Shift-Right Arrow Facebook Instagram Twitter YouTube Our website uses cookies. Please review our privacy policy to find out more about the cookies we use. Browsing our website means you accept these terms. Accept"
    },
    {
      "url": "https://leadiq.com/c/adventhealth/5a1d95dc23000059008482d3/employee-directory",
      "text": "AdventHealth Employee Directory, Headcount & Staff | LeadIQ Learn more at LeadIQ.com Start free AdventHealth Employee Directory Hospitals and Health Care Florida, United States 10001+ Employees AdventHealth is a connected network of care that helps people feel whole â body, mind and spirit. More than 100,000 team members across a national footprint provide whole-person care to nearly nine million people annually through more than 2,000 care sites that include hospitals, physician practices, ambulatory surgery centers, outpatient clinics, home health agencies, hospice centers, the AdventHealth app and more. Our wholistic approach to improving the health and prosperity of our communities is inspired by our mission to extend the healing ministry of Christ. â Sign up for free to view info Company overview Email format Find AdventHealth employees' phone numbers or email addresses Find Employee AdventHealth Global Highlights Location Employees North America 28K United States Of America 28K Canada 6 Jamaica 2 Antigua And Barbuda 1 Haiti 1 Mexico 1 Asia 38 Philippines 12 Pakistan 7 India 7 United Arab Emirates 2 Israel 2 Singapore 2 Nepal 2 Kuwait 1 Indonesia 1 Lebanon 1 Malaysia 1 Europe 18 United Kingdom Of Great Britain And Northern Ireland 9 Italy 4 Germany 1 Republic Of North Macedonia 1 Azerbaijan 1 Ireland 1 France 1 Africa 6 Sierra Leone 1 Gabon 1 Ghana 1 Rwanda 1 Egypt 1 Tanzania 1 South America 4 Brazil 3 Chile 1 Oceania 3 Australia 2 New Zealand 1 AdventHealth 's Leadership B. D. Chief Executive Officer, Primary Health Division Mobile Phone Email T. C. Chief Nurse Executive, Svp Associate Chief Clinical Officer Adventhealth Mobile Phone Email R. P. Chief Ai Officer Mobile Phone Email R. R. Chief Investment Officer Mobile Phone Email A. O. Chief People Officer, Southwest Region Mobile Phone Email O. A. Chief Culture & Transformation Officer Mobile Phone Email V. H. Chief Clinical Officer And Senior Vice President, Adventhealth Central Florida Division Mobile Phone Email J. K. Chief Quality & Safety Officer Mobile Phone Email AdventHealth Employee Metrics 100% 50% 0% 2025 2024 Healthcare Services Analytics Information Technology Pharmaceuticals Operations Other Program & Project Management Contact profiles from AdventHealth Name Title Contact Info Location Last Update J. K. D. Vice President, Chief Nursing Officer Mobile Phone Email United States Florida Apr 29, 2025 R. P. Chief Ai Officer Mobile Phone Email United States Florida Aug 13, 2025 R. R. Chief Investment Officer Mobile Phone Email United States Florida Jul 07, 2025 A. O. Chief People Officer, Southwest Region Mobile Phone Email Aug 08, 2025 O. A. Chief Culture & Transformation Officer Mobile Phone Email United States Florida Aug 18, 2025 V. H. Chief Clinical Officer And Senior Vice President, Adventhealth Central Florida Division Mobile Phone Email United States Florida Aug 07, 2025 P. F. Employee Relations Partner Mobile Phone Email United States Maryland Aug 08, 2025 J. R. Rocky Mountain Region Cio Mobile Phone Email United States Colorado Aug 19, 2025 M. F. Svp And Chief Supply Chain Officer Mobile Phone Email United States Aug 05, 2025 T. C. Chief Nurse Executive, Svp Associate Chief Clinical Officer Adventhealth Mobile Phone Email United States Florida Jul 30, 2025 1 2 3 â¦ Next > Frequently Asked Questions What is AdventHealth known for? AdventHealth was founded in 1973 operates in the Hospitals and Health Care industry . The company's main headquarters is located in 900 Hope Way Altamonte Springs, FL 32714 US . Explore AdventHealth 's company overview page for more information. What is AdventHealth 's most common email format? AdventHealth employees' email format typically follows the pattern of . Trying to find reliable and up-to-date employee contact data? Find more AdventHealth email formats with LeadIQ. How many employees does AdventHealth have currently? AdventHealth has approximately 37K employees as of August 2025 . These team members are located across 6 continents, including North America Asia Europe . Who are AdventHealth 's key employees and leadership? As of August 2025 , AdventHealth 's key employees include: Chief Executive Officer, Primary Health Division: B. D. Chief Nurse Executive, Svp Associate Chief Clinical Officer Adventhealth: T. C. Chief Ai Officer: R. P. Chief Investment Officer: R. R. Chief People Officer, Southwest Region: A. O. Looking for contact data? Unlock accurate emails and phone numbers for your ideal prospects with LeadIQ. Everything for prospecting, in one platform. What you can expect from LeadIQ: B2B data verified in real-time Sync data to your CRM, & add it to an outreach sequence in one click Integrations with your tech stack for optimal efficiency A patented AI cold email generator Account & contact-level job change tracking Ready to create more pipeline? Get a demo and discover why thousands of SDR and Sales teams trust LeadIQ to help them build pipeline confidently. Book a demo Platform Identify prospect data Track sales triggers Compose personalized messages Enrich Salesforce data Success Stories Resources Pricing Blog Company Search Support Careers Data Community Our Data Privacy Center Legal Privacy Policy Cookie Policy Terms of Service Do Not Sell or Share My Personal Information Compare LeadIQ vs. Zoominfo LeadIQ vs. Apollo LeadIQ vs. Lusha LeadIQ vs. Cognism LeadIQ vs. Seamless.ai LeadIQ vs. Usergems LeadIQ vs. Champify Contact 1-888-653-2347 support@leadiq.com sales@leadiq.com Â© LeadIQ, Inc. All rights reserved."
    }
  ]
}