{
  "fuentes": [
    {
      "url": "https://www.islandchamber.com/2024/10/01/amelia-island-chamber-music-festival-selects-robyn-lamp-as-its-new-executive-director/",
      "email": "alex@nassaucountyflchamber.com"
    },
    {
      "url": "https://www.islandchamber.com/2024/10/01/amelia-island-chamber-music-festival-selects-robyn-lamp-as-its-new-executive-director/",
      "email": "info@nassaucountyflchamber.com"
    },
    {
      "url": "https://www.islandchamber.com/2024/10/01/amelia-island-chamber-music-festival-selects-robyn-lamp-as-its-new-executive-director/",
      "email": "info@nassaucountyflchamber.com"
    },
    {
      "url": "https://ameliaislandjazzfestival.com/contact/",
      "email": "info@ameliaislandjazzfestival.com"
    },
    {
      "url": "https://bgcnassau.org/2018/04/20/aicmf-scores-a-hit-at-boys-girls-clubs/",
      "email": "info@bgcnassau.org"
    },
    {
      "url": "https://www.arielquartet.com/schedule2/2024/5/27/amelia-island-chamber-music-festival",
      "email": "music@melkap.com"
    }
  ],
  "mails": [
    "alex@nassaucountyflchamber.com",
    "info@ameliaislandjazzfestival.com",
    "info@bgcnassau.org",
    "info@nassaucountyflchamber.com",
    "music@melkap.com"
  ],
  "nombre_sitio": "aicmf.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.islandchamber.com/2024/10/01/amelia-island-chamber-music-festival-selects-robyn-lamp-as-its-new-executive-director/",
      "text": "Amelia Island Chamber Music Festival Selects Robyn Lamp as its New Executive Director Skip to content Join Today Facebook Icon Twitter Icon YouTube Icon LinkedIn Icon Menu About Us Our Story Chamber FAQ Chamber Staff Board of Directors Chamber Ambassadors Leadership Nassau Signature Events 2024 Annual Report Privacy Policy Contact Us Members Member Login/Info Hub Chamber Events Calendar Membership Benefits Chamber Champions Marketing/Advertising Opportunities Discover Nassau Life & Leisure Guide Discovery Map of Amelia Island Discovery Map of West Nassau County Business Resource Innovation Center (BRIC) Member Application Business Directory Member to Member Discounts Events & News Chamber Events Calendar Community Events Calendar Chamber Blog Newsletter Sign-Up Business Directories Business Directory Geographical Directories Amelia Island/Fernandina Beach Business Directory Yulee Business Directory Callahan Business Directory Hilliard Business Directory Bryceville Business Directory Visitor/Tourism Directory Restaurants/Food/Beverages Directory Building/Contractor/Real Estate Directory Healthcare Business Directory Chamber Champions Special Services Directories Resources Business Resources Employment Resource Hub Economic Profile Business Development Assistance Start Up Directory: Nassau County Start Up Directory: City of Fernandina Beach Home Based Business/Remote Worker Resources Nassau County Sales Tax Community Resources Discover Nassau Life & Leisure Guide Interactive Resident/Visitor Map Communities Amelia Island Fernandina Beach Yulee Callahan, Hilliard & Bryceville Resident/New Mover Resources Nassau County Relocation Packet Licenses & Permits SizeUpNassau SizeUpNassau FAQ Member Login/Info Hub Job Opportunities in Nassau County Employment Resource Hub Hurricane and Disaster Preparedness Advocacy & Strategic Initiatives SizeUpNassau SizeUpNassau FAQ Advocacy in Action Government Officials Six Pillars Framework Nassau County Economic Indicators Amelia Island Chamber Music Festival Selects Robyn Lamp as its New Executive Director Robyn Lamp, New Executive Director for Amelia Island Chamber Music Festival AMELIA ISLAND, Fla. – Oct. 1, 2024 – Amelia Island Chamber Music Festival ’s Board of Directors named Robyn Lamp the festival’s new executive director. The festival is one of the nation's most prestigious chamber music series, known for its first-class performances and music education programs. “After an extensive search, we are most pleased to welcome Robyn Lamp as our executive director,” Board President Emma Mills Bledsoe said. “Her knowledge, experience and pursuit of excellence in bringing music to our community, and now to our organization, will ensure that we continue to be an integral part of the cultural fabric of the Southeast.” Board members said Lamp’s experience as an arts administrator and classical musician, combined with her passion for promoting classical music in her community, will help advance the festival's mission. Lamp will begin her new position in time to oversee the 24th season, including performances by Mark and Maggie O’Connor, pianist Jeremy Denk, the Takács Quartet, classical guitarist Sharon Isbin, and others. “We are thrilled that Robyn is joining our team to present the best musicians in the world on Amelia Island at the festival,” Artistic Director William Ransom said. “With her extensive and administrative background, we are poised for a great future ahead.” Lamp is currently IlluminArts’ company manager in Miami. In 2021, she co-founded Amelia Island Opera and serves as secretary of its Board of Directors. When Lamp assumes her new role on Oct. 21, she will manage day-to-day operations and work alongside the Board to lead fundraising, marketing and community engagement efforts. “Before I made Amelia Island my home in 2020, I would attend Amelia Island Chamber Music Festival concerts as a visitor,” Lamp said. “I was always excited and impressed by the high-quality programming presented by Amelia Island Chamber Music Festival. I am truly humbled to have been entrusted with the responsibility of advancing the mission of this great organization.” Lamp is a classically trained opera singer with a master’s degree in music from Louisiana State University. Highlights of her freelance opera and choral career include singing as the soprano soloist in Verdi’s Requiem at Carnegie Hall and Mechanics Hall, an ensemble member of Grammy Award-nominated Seraphic Fire, the title role in Puccini’s Tosca with the Naples Philharmonic and Adele in Bellini’s rarely heard Il Pirata with the Orchestra of St. Luke's at Caramoor Summer Music Festival. The Amelia Island Chamber Music Festival was founded in 2001 by Christopher Rex, a vacationer on Amelia Island and principal cellist of the Atlanta Symphony Orchestra. Now entering its 24th season, the festival has developed into one of the nation's most prestigious events of its kind. Grants from the Florida Division of Cultural Affairs, Community Foundation for Northeast Florida and National Endowment for the Arts help support the festival, along with generous contributions from sponsors, donors and dedicated volunteers. Music education for concert audiences, students and aspiring young musicians has been a core mission of the festival since its founding. In addition to the Beth Newdome Fellowship and master classes, the organization launched two new education programs in 2019: the Christopher Rex Spring Institute and the String Education Program. The array of internationally acclaimed artists who have headlined the festival includes Yo-Yo Ma, Itzhak Perlman, Hilary Hahn, Pinchas Zukerman, Joshua Bell, Chick Corea, Béla Fleck, Chris Thile, Emanuel Ax, Valentina Lisitsa and Wynton Marsalis. Previous star-studded headliners also include Grammy Award-winning violinist Anne-Sophie Mutter, bluegrass singer Ricky Skaggs, and soprano Renée Fleming. The acclaimed Dover Quartet was named the organization’s first quartet-in-residence. The festival has enjoyed a glorious past, and its future is even more exciting. © 2025 Nassau County Chamber of Commerce | Site by GrowthZone location 961687 Gateway Blvd., Suite 101-G Fernandina Beach, FL 32034 phone (904) 261-3248 email info@NassauCountyFLChamber.com facebook twitter youtube LinkedIn #WeAreTheChamber Interested in Membership? Apply online and let us help you grow your business! Apply Today © 2025 Nassau County Chamber of Commerce. All Rights Reserved | Site by GrowthZone Scroll To Top"
    },
    {
      "url": "https://ameliaislandjazzfestival.com/contact/",
      "text": "Contact the Amelia Island Jazz Festival Tickets 2025 Festival Tickets 2025 VIP Jazz Pass 2025 Season 2025 Concert Lineup 2025 Headliners 2025 AIJF Musicians About The Amelia Island Jazz Festival About The Festival AIJF Official Poster Collection Endorsements Friends of the Festival 2025 AIJF Sponsors Questions? Contact the Amelia Island Jazz Festival Programs Jazz Education Scholarship Winners Get Involved Sponsorships Advertise Volunteer Media Videos News Archive 2024 Festival Program 2024 Festival Brochure 2023 Festival Program 2023 Festival Brochure 2022 Festival Program 2022 Festival Brochure DONATE Tickets 2025 Festival Tickets 2025 VIP Jazz Pass 2025 Season 2025 Concert Lineup 2025 Headliners 2025 AIJF Musicians About The Amelia Island Jazz Festival About The Festival AIJF Official Poster Collection Endorsements Friends of the Festival 2025 AIJF Sponsors Questions? Contact the Amelia Island Jazz Festival Programs Jazz Education Scholarship Winners Get Involved Sponsorships Advertise Volunteer Media Videos News Archive 2024 Festival Program 2024 Festival Brochure 2023 Festival Program 2023 Festival Brochure 2022 Festival Program 2022 Festival Brochure DONATE Contact Us The Amelia Island Jazz Festival For more information about us, fill in the following email request or you can leave a message at the Jazz Hotline: (904) 504-4772 Mailing Address Amelia Island Jazz Festival, Inc. P.O. Box 16684 Fernandina Beach, FL 32035 Email: info@ameliaislandjazzfestival.com Phone: (904) 504-4772 The Amelia Island Jazz Festival is a 501(c)3 not-for-profit organization. (EIN 59-3841587) Your name (required) Your email (required) Phone Number (required) Your message (required) Submit Δ Instagram @ ameliaislandjazzfestival 🎹✨ SATURDAY NIGHT HEADLINER!\n\nThe 22nd Annual 🎷✨ 8 DAYS. WORLD-CLASS JAZZ. ONE INCREDIBLE F 🎷 Get Your Business in Front of Thousands — O 🎶 Jazz with a Purpose! 🎓✨\n\nThe Big Band Ba ⏳ Only 9 days left! 🎷✨\n\nJoin us on February 🎷✨ Experience the magic of The Big Band Bash Follow AIJF on Instagram Copyright  ©2025 Amelia Island Jazz Festival, Inc. – All Rights Reserved Webmaster: CB Advertising Services, Inc. Privacy Policy The Amelia Island Jazz Festival is a 501(c)3 not-for-profit organization.  (EIN 59-3841587) Back to top Stay up to date with social media. Facebook Feed 3,128 Amelia Island Jazz Festival A not for profit 501c3 corporation, the Les DeMerle Amelia Island Jazz Festival distributes proceeds Amelia Island Jazz Festival updated their status. 3 days ago This content isn't available right now When this happens, it's usually because the owner only shared it with a small group of people, changed who can see it or it's been deleted. View on Facebook · Share Share on Facebook Share on Twitter Share on Linked In Share by Email Amelia Island Jazz Festival 4 days ago The 22nd Annual Amelia Island Jazz Festival is almost here! Get ready for an unforgettable week of world-class jazz Sept. 28 – Oct. 5. 🎟️ Tickets are going fast — don’t miss out! ... See More See Less 🎶 The Jazz Event of the Year is Almost Here! Get Your Tickets Now 🎶 icont.ac Get ready for an extraordinary week of music, rhythm, and unforgettable performances. This year’s festival will feature the Grammy-nominated vocalist Jane Monheit, whose soulful interpretations and ... View on Facebook · Share Share on Facebook Share on Twitter Share on Linked In Share by Email Amelia Island Jazz Festival 1 week ago 🎹✨ Get ready for another unforgettable night at the 22nd Annual Amelia Island Jazz Festival! On Saturday, October 4th, we are honored to present the world-renowned pianist Monty Alexander — one of the most dynamic and beloved figures in jazz today. His music blends swing, bebop, and Caribbean rhythms into a performance that will leave you breathless. And that’s not all… sharing the stage will be the powerhouse Les DeMerle Jazz Quintet. With this much talent in one evening, you know it’s going to be extraordinary. 🔥 Tickets are already selling quickly — don’t miss your chance to experience this world-class concert. 🎟️ Secure your seats now 👉 ameliaislandjazzfestival.com #AmeliaIslandJazzFestival #MontyAlexander #LiveJazz #22ndAnnual #buyticketsnow ... See More See Less Video View on Facebook · Share Share on Facebook Share on Twitter Share on Linked In Share by Email Amelia Island Jazz Festival 3 weeks ago 🎶✨ The countdown is on! The 22nd Annual Amelia Island Jazz Festival is bringing 8 unforgettable days of world-class jazz to our beautiful island — and we are thrilled to announce one of the festival’s most exciting performances. 🌟 Internationally acclaimed jazz vocalist Jane Monheit will light up the stage on Friday, October 3rd, joined by the always-amazing Les DeMerle Jazz Quartet. This is your chance to experience one of today’s premier jazz voices right here at home! From swing to Latin, big band to intimate vocals, the Amelia Island Jazz Festival has something for every music lover — and Jane Monheit’s concert is sure to be a highlight of the week. 🔥 Tickets are selling quickly, so don’t miss your chance to be part of this spectacular night. 🎟️ Secure your seats now at 👉 ameliaislandjazzfestival.com #AmeliaIslandJazzFestival #JaneMonheit #LiveJazz #22ndAnnual #DontMissIt #ameliaisland #buytickets ... See More See Less Video View on Facebook · Share Share on Facebook Share on Twitter Share on Linked In Share by Email Amelia Island Jazz Festival updated their status. 1 month ago This content isn't available right now When this happens, it's usually because the owner only shared it with a small group of people, changed who can see it or it's been deleted. View on Facebook · Share Share on Facebook Share on Twitter Share on Linked In Share by Email Instagram 🎹✨ SATURDAY NIGHT HEADLINER!\n\nThe 22nd Annual 🎷✨ 8 DAYS. WORLD-CLASS JAZZ. ONE INCREDIBLE F 🎷 Get Your Business in Front of Thousands — O 🎶 Jazz with a Purpose! 🎓✨\n\nThe Big Band Ba ⏳ Only 9 days left! 🎷✨\n\nJoin us on February 🎷✨ Experience the magic of The Big Band Bash Follow AIJF on Instagram Follow us"
    },
    {
      "url": "https://bgcnassau.org/2018/04/20/aicmf-scores-a-hit-at-boys-girls-clubs/",
      "text": "AICMF Scores a Hit at Boys & Girls Clubs – Boys & Girls Clubs of Nassau County About Us BGCN Foundation Our Leadership Team Our Programs 2024-2025 After School Program News & Events BGCNCF News 19th Annual Gala Our Clubs Miller Freedom Center Roberts Learning & Achievement Center Get Involved Become a Guardian Leave a Legacy Ways to Give Contact Us Donate Now About Us BGCN Foundation Our Leadership Team Our Programs 2024-2025 After School Program News & Events BGCNCF News 19th Annual Gala Our Clubs Miller Freedom Center Roberts Learning & Achievement Center Get Involved Become a Guardian Leave a Legacy Ways to Give Contact Us Donate Now 2018 Amelia Island Chamber Music Festival AICMF Scores a Hit at Boys & Girls Clubs Press Release Submitted by Alan Donaldson When Ms. Emma Bledsoe of the Amelia Island Music Festival called to suggest a concert for the youngsters at Boys & Girls Clubs of Nassau County, the Clubs staff knew something special was on the way! So, on April 16 over 100 lucky members of the Boys and Girls Clubs were delighted when they gathered for the concert at the Roberts Learning and Achievement Center in Fernandina Beach. The concert highlighted The Grascals, a cutting-edge, modern bluegrass band, known for presenting a unique sound. They have appeared on national media, such as The Tonight Show with Jay Leno and CBS The Talk, and the band has performed over 150 times at the Grand Ole Opry. “The members absolutely loved it,” said David Bryan, Unit Director of the Roberts Center. “We try to introduce the members to as many educational and cultural experiences as possible, so we were thrilled when The Chamber Music Festival reached out to us to offer this concert.” The youngsters didn’t just listen to the band but also participated in an interactive musical experience. “Everybody had a chance to play one of the instruments,” said Danielle Albert, a Club member “And the band played each instrument separately, so we could hear what each one sounded like. It was a lot of fun; I feel like I learned a lot!” The Roberts Center is looking forward to inviting and providing similar experiences and performances this summer during Boys and Girls Clubs Summer Academy from Monday, June 4 to Monday, August 6. Call Sherryl Smith at (904) 261-1075 to join the Miller Freedom Center on Old Nassauville Road. To enroll at Roberts Learning and Achievement Center on Lime Street in Fernandina Beach, call David Bryan at (904) 491-9102. (Photo Caption: Daylee Abilar, a member of the Roberts Center, steps up to learn how to play the violin from one of The Grascals.) Share: Boys & Girls Clubs Nassau County Previous post \"Oh What a Night\" at the 11th Annual Benefit Gala April 20, 2018 Next post Summer is Fun-Tastic August 12, 2018 You may also like BGC Nassau Foundation Announces New President & Executive Board Elections 12 July, 2021 Congratulations to our June Youths of the Month! 9 July, 2021 Local Club Member Wins National Design Contest 4 June, 2021 Search Search for: FOLLOW US BGCNCF is Awesome Our after-school and summer programs benefit the community's youth and provide them with a safe place to improve their academics, be engaged with positive role models, and develop into confident leaders. P.O. Box 16003 | Fernandina Beach, FL 32035 904-261-8666 info@bgcnassau.org For the 8th year in a row, Charity Navigator has recognized the Boys & Girls Clubs of Nassau County Foundation with its Four-Star Award - the highest award given. About Us Contact Us Foundation Become a Guardian Back to Homepage Important Ways to Donate Privacy Policy Follow Us Facebook Instagram Youtube Make a Difference With your assistance, we can help numerous young people in Nassau County reach their full potential. © 2025  - Boys & Girls Clubs of Nassau County Foundation - All Rights Reserved Website: CB Advertising Privacy & Cookies: This site uses cookies. By continuing to use this website, you agree to their use. To find out more, including how to control cookies, see here: Cookie Policy"
    },
    {
      "url": "https://www.arielquartet.com/schedule2/2024/5/27/amelia-island-chamber-music-festival",
      "text": "Amelia Island Chamber Music Festival, Christopher Rex String Seminar — Ariel Quartet About News Schedule The Cycle Press Media Contact Back The Quartet The Musicians Timeline Back Video Photo About The Quartet The Musicians Timeline News Schedule The Cycle Press Media Video Photo Contact Back to All Events Amelia Island Chamber Music Festival, Christopher Rex String Seminar Monday, May 27, 2024 6:00 PM 18:00 Sunday, June 2, 2024 7:00 PM 19:00 Amelia Island Chamber Music Festival Fernandina Beach florida usa (map) Google Calendar ICS MORE INFO AND TICKETS Earlier Event: May 9 The Hub, Miami FL Later Event: May 29 Amelia Island Chamber Music Festival Melvin Kaplan, Inc. 115 College Street, Burlington VT 05401 (802) 658-2592 music@melkap.com Schedule Newsletter Booking & Contact © Ariel Quartet Site by Made for Masses"
    }
  ]
}