{
  "fuentes": [
    {
      "url": "https://www.news-journalonline.com/story/business/2018/10/02/daytona-beach-shores-aku-tiki-inn-sells-for-116-million/9727603007/",
      "email": "clayton.park@news-jrnl.com"
    },
    {
      "url": "https://www.arrivalguides.com/en/Travelguide/Oslo/barsandnightlife/aku-aku-15626",
      "email": "post@akuaku.no"
    },
    {
      "url": "https://www.arrivalguides.com/en/Travelguide/Oslo/barsandnightlife/aku-aku-15626",
      "email": "priceguarantee@viator.com"
    },
    {
      "url": "https://mytiki.life/tiki-bars/aku-aku-tiki-bar",
      "email": "header-tiki-tile@2x-ddwpfegc.webp"
    },
    {
      "url": "https://theorlandolife.com/event-venue/aku-aku-tiki-bar/",
      "email": "news@theorlandolife.com"
    },
    {
      "url": "https://hospitals.aku.edu/pakistan/ContactUs/Pages/default.aspx",
      "email": "20client.relations@aku.edu"
    },
    {
      "url": "https://hospitals.aku.edu/pakistan/ContactUs/Pages/default.aspx",
      "email": "client.relations@aku.edu"
    },
    {
      "url": "https://hospitals.aku.edu/pakistan/ContactUs/Pages/default.aspx",
      "email": "contact-us@aku.edu"
    },
    {
      "url": "https://hospitals.aku.edu/pakistan/ContactUs/Pages/default.aspx",
      "email": "marketing@aku.edu"
    },
    {
      "url": "https://hospitals.aku.edu/pakistan/ContactUs/Pages/default.aspx",
      "email": "patient.referral@aku.edu"
    }
  ],
  "mails": [
    "20client.relations@aku.edu",
    "clayton.park@news-jrnl.com",
    "client.relations@aku.edu",
    "contact-us@aku.edu",
    "header-tiki-tile@2x-ddwpfegc.webp",
    "marketing@aku.edu",
    "news@theorlandolife.com",
    "patient.referral@aku.edu",
    "post@akuaku.no",
    "priceguarantee@viator.com"
  ],
  "nombre_sitio": "akuakutiki.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.news-journalonline.com/story/business/2018/10/02/daytona-beach-shores-aku-tiki-inn-sells-for-116-million/9727603007/",
      "text": "Daytona Beach Shores Aku Tiki Inn sells for $11.6 million News Sports Entertainment Opinion Advertise Obituaries eNewspaper Legals BUSINESS Daytona Beach Shores Aku Tiki Inn sells for $11.6 million Lakeland investor buys Polynesian-themed Best Western hotel, an oceanfront landmark since the '60s Clayton Park clayton.park@news-jrnl.com DAYTONA BEACH SHORES — The Best Western Aku Tiki Inn, a beachside landmark since it opened in 1967, is under new ownership for the first time in its history. A local partnership that included the family of the late Tom Staed, a pioneering Daytona Beach hotelier who helped found Visit Florida, sold the oceanfront hotel at 2225 S. Atlantic Ave. in Daytona Beach Shores for $11.6 million, according to Volusia County property records. Local investor George Anderson was a minority stakeholder in the partnership that sold the 132-room hotel, which was built by Staed's father-in-law, the late Monroe Dodd. The sale closed in late August. The new owners are Lakeland physician Dr. Japinder Singh and his family. Singh bought the hotel via his newly incorporated Daytona Shores Hotels and Resorts LLC, also doing business as Aku Tiki Ltd., according to property records. Looking for a free mini puzzle? Play the USA TODAY Quick Cross now. The sale leaves the Staed family with just one hotel: the Bahama House at 2001 S. Atlantic Ave. in Daytona Beach Shores, which continues to be run by Blaine Lansberry, a daughter of the late Staed, and her husband Brian. During the early 1970s, when Staed was widely considered the Daytona Beach area's most prominent hotelier, he oversaw 11 hotels. \"The sale was a repositioning of our assets,\" said Lansberry. \"My husband Brian and I are keeping the Bahama House and plan to be active members of the hotel industry for many more years.\" Lansberry serves as vice chair of the Halifax Area Advertising Authority board, which oversees the Daytona Beach Area Convention & Visitors Bureau. The Best Western Aku Tiki Inn has been a local landmark in part because of its iconic Tiki God statue head at the entrance, which resembles the giant statue heads on Easter Island. Lansberry, whose parents bought the hotel in 2004 after the death of her grandparents, said, \"I think the theme and name were inspired by the (1958) book \"Aku Aku (The Secret of Easter Island)\" by Thor Heyerdahl and the fact that a name starting with 'A' came first in the phone book.\" Former Daytona Beach Mayor Glenn Ritchey Sr. is a former musician whose band, The Mustangs, performed regularly at the Best Western Aku Tiki Inn in the late 1960s. \"It was a wonderful place to go,\" recalled Ritchey, the CEO of Jon Hall Chevrolet. He added that his band was hired by Dodd. Ritchey said his band performed in the hotel's Trader's Lounge bar. \"It was packed every night,\" he recalled. The Best Western Aku Tiki Inn has retained its staff with the exception of a change in general manager. The new GM is Jeff Van Diver, who previously worked in South Florida. He succeeds Steve Farley who recently left to become GM of the El Caribe hotel. The new owners also filled the director of sales and marketing position that had been vacant by hiring Tara Hart-Patterson. Hart-Patterson is no stranger to the area, having previously worked for the old Ocean Waters Management company that owned several oceanfront hotels in the Daytona Beach area. Staed, who died in 2013 at age 81, is the namesake of the new Tom Staed Veterans Memorial Bridge currently being built to replace the old Orange Avenue/Silver Beach drawbridge connecting Daytona Beach's City Island to the beachside. Local real estate observer Tim Davis of SVN Alliance Commercial Real Estate Advisors in Ormond Beach said the new owner likely will need to renovate the Best Western Aku Tiki Inn. \"Oceanfront properties require so much maintainence because of the salt air,\" said Davis, who counts George Anderson as one of his clients. Davis said his understanding is that Singh is \"very capable and knowledgeable about the hotel industry\" and that he doesn't expect the new owner to change the Polynesian theme of the hotel. \"it's neat and it's got a novel look.\" Davis said. Careers Staff Directory Accessibility Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Business Advertise Your Business Buy and Sell Help Center Subscriber Guide Manage Account Give Feedback Licensing & Reprints Subscribe Today Newsletters Facebook X Instagram eNewspaper Archives Jobs Real Estate Classifieds Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.news-journalonline.com. All rights reserved."
    },
    {
      "url": "https://www.arrivalguides.com/en/Travelguide/Oslo/barsandnightlife/aku-aku-15626",
      "text": "Aku-Aku - Oslo - Arrivalguides.com CONTENT FOR BUSINESS Arrival TV support@arrivalguides.com Africa Africa Algeria Algeria Algiers Cape Verde Cape Verde Cape Verde Egypt Egypt Cairo Hurghada, Luxor & Marsa Alam Sharm el-Sheikh Ethiopia Ethiopia Addis Ababa Gambia Gambia Banjul Kenya Kenya Nairobi Mauritius Mauritius Mauritius Morocco Morocco Agadir Casablanca Fes Marrakesh Rabat Namibia Namibia Windhoek All countries Asia Asia Bahrain Bahrain Bahrain Bangladesh Bangladesh Dhaka Bhutan Bhutan Bhutan Cambodia Cambodia Phnom Penh Siem Reap China China Beijing Chengdu Chongqing Guangzhou Guilin Hangzhou Kunming Nanjing Ningbo All cities Georgia Georgia Tbilisi Hong Kong Hong Kong Hong Kong India India Ahmedabad Bangalore Chennai Cochin Hyderabad Mumbai New Delhi Trivandrum Indonesia Indonesia Bali Jakarta Surabaya All countries Caribbean Caribbean Antigua and Barbuda Antigua and Barbuda St John's Aruba Aruba Aruba Bahamas Bahamas Nassau Barbados Barbados Bridgetown British Virgin Islands British Virgin Islands Road Town Caribbean Netherlands Caribbean Netherlands Bonaire Saba Cayman Islands Cayman Islands George Town Cuba Cuba Cayo Coco Havana Santa Clara Varadero Curaçao Curaçao Willemstad All countries Central America Central America Belize Belize Belize City Costa Rica Costa Rica Liberia, Costa Rica Quepos San José Honduras Honduras Roatán Nicaragua Nicaragua Corinto Panama Panama Chiriquí Exotic Islands of Panama, Central America Panama City, Central America Europe Europe Albania Albania Tirana Austria Austria Graz Innsbruck Lech Zürs Linz Salzburg St Anton Vienna Zell am See - Kaprun Belarus Belarus Minsk Belgium Belgium Antwerp Bruges Brussels Ghent Leuven Mechelen Bosnia and Herzegovina Bosnia and Herzegovina Sarajevo Bulgaria Bulgaria Burgas Plovdiv Sofia Varna Croatia Croatia Dubrovnik Krapina-Zagorje Opatija Pula Rijeka Split Vodice Zadar Zagreb All cities Cyprus Cyprus Agia Napa – Protaras Cyprus Pafos Czech Republic Czech Republic Brno Pilsen Prague All countries North America North America Canada Canada Calgary Montreal Niagara Falls, Ontario Quebec City Saint-Hippolyte Toronto Vancouver Whistler Guadeloupe Guadeloupe Pointe-à-Pitre Mexico Mexico Cancún Costa Maya Cozumel Los Cabos Mexico City Puerto Vallarta Riviera Maya Zihuatanejo Saint Barthélemy Saint Barthélemy Saint Barthélemy United States United States Anchorage Arnold, California Atlanta, Georgia Atlantic Beach, North Carolina Avila Beach, California Baltimore, Maryland Banner Elk, North Carolina Bentonville, Arkansas Big Island, Hawaii All cities Oceania Oceania Australia Australia Adelaide Alice Springs Ballina Byron Blue Mountains Brisbane Broome Byron Bay Cairns Canberra All cities Cook Islands Cook Islands Cook Islands Fiji Fiji Fiji New Zealand New Zealand Auckland Christchurch Dunedin Queenstown Wellington Samoa Samoa Samoa Tonga Tonga Tonga U.S. Minor Outlying Islands U.S. Minor Outlying Islands Testing Vanuatu Vanuatu Vanuatu South America South America Argentina Argentina Buenos Aires Brazil Brazil Rio de Janeiro São Paulo Chile Chile Santiago Colombia Colombia Bogotá Cartagena Ecuador Ecuador Galapagos Islands Peru Peru Lima All Travel Guides Dansk Deutsch English Español Français Italiano Magyar Nederlands Norsk Polski Português Svenska Ελληνικά русский عربى 한국어 中文 日本語 Provided by: Shyripa Alexandr/Shutterstock.com Our travel guides are free to read and explore online. If you want to get your own copy, the full travel guide for this destination is available to you offline* to bring along anywhere or print for your trip.​ *this will be downloaded as a PDF. Price €4,95 Purchase Europe Norway Oslo Bars & Nightlife Aku-Aku Overview Sections The City Do & See Restaurants Cafés Bars & Nightlife Shopping Hotels Tourist Information Aku-Aku The guide was updated: 2024-02-12 Aku-Aku is a popular Tiki Bar which transports its guests to a Polynesian oasis with its colourful decorations and atmosphere. Known for boasting Norway's largest rum selection, it offers an impressive array of cocktails that cater to every taste. Additionally, Aku-Aku also serves its own tap beer, and while the drinks may be a little pricey, they remain within the average price range for Oslo. Useful Information Address: Thorvald Meyers Gate 32, Oslo Website: www.akuaku.no Email: post@akuaku.no Digital Travel Guide Download Our travel guides are free to read and explore online. If you want to get your own copy, the full travel guide for this destination is available to you offline* to bring along anywhere or print for your trip.​ *this will be downloaded as a PDF. Price €4,95 Purchase Torggata Botaniske A lush cocktail bar with climbing plants covering the ceiling and its own greenhouse. The interiors are simple and classy while the superb cocktails are made with high-quality spirits and fresh ingredients grown in their greenhouse. The cocktail list changes according to the season. Read more Territoriet Territoriet is a wine bar with an intimate atmosphere offering almost 400 different wines, most of which are available by the glass. They have wines for every taste and price range that can be enjoyed with some cheese and finger food. All the music at Territoriet is played on vinyl and can be also chosen by customers. Read more Blå Blå is an alternative live music venue hosting numerous concerts that vary from indie to rock to jazz bands. They have both Norwegian and international artists performing early in the evenings and then, as time progresses, Blå turns into a vibrant nightclub with DJ sets. They also have a great outdoor terrace on the banks of the Akerselva River. Read more Aku-Aku Aku-Aku is a popular Tiki Bar which transports its guests to a Polynesian oasis with its colourful decorations and atmosphere. Known for boasting Norway's largest rum selection, it offers an impressive array of cocktails that cater to every taste. Additionally, Aku-Aku also serves its own tap beer, and while the drinks may be a little pricey, they remain within the average price range for Oslo. Read more Bar Boca The smallest bar in Oslo, Bar Boca is a cosy venue with 1950s decor serving some of the best cocktails in town. The selection is huge and the bartenders are always ready to make off-the-list cocktails on the spot. They also serve craft beer and wine. Read more The Villa The Villa is an underground club where live DJs spin electronic music on two different dance floors. Read more Dattera til Hagen Dattera Til Hagen is a colourful bar and café on two floors with a popular backyard beer garden. The café serves tapas, salads, burgers, and pasta. They also host regular events like concerts, improv theatre, and stand-ups. On the weekends, there are DJs on both floors. Read more The Dubliner Folk Pub The Dubliner Folk Pub brings the lively spirit of Ireland to the heart of Oslo with its large selection of beers and delicious pub fare, along with weekly live folk music and big-screen sports. Read more T.G.I. Fridays A well-established chain restaurant serving American food, beer, and cocktails in a festive and casual environment. Read more Next Section You can select up to 9 travelers in total. Adult (12-99) Minimum: 1, Maximum: 9 2 Child (3-11) Minimum: 0, Maximum: 9 0 Infant (0-2) Minimum: 0, Maximum: 9 0 Apply Cancellation Policy Free cancellation September 1 100% refund September 2 No refund You can cancel up to 24 hours in advance of the experience for a full refund. For a full refund, you must cancel at least 24 hours before the experience’s start time. If you cancel less than 24 hours before the experience’s start time, the amount you paid will not be refunded. Any changes made less than 24 hours before the experience’s start time will not be accepted. Cut-off times are based on the experience’s local time. This experience requires good weather. If it’s canceled due to poor weather, you’ll be offered a different date or a full refund. Learn more about cancellations Lowest Price Guarantee We guarantee the lowest price on all 200,000+ experiences we sell. If you find the same product cheaper within three days of booking or while you're in your destination, we'll refund the difference. It's Easy To Do Gather your information Assemble your Viator Booking Number or Itinerary Reference Number and the proof of the lower price you found. Send it to us Email priceguarantee@viator.com with the documents, your name, and your home address. We'll review We'll examine your materials and get in touch as soon as we can. Receive your refund If everything checks out, we'll refund you the difference between the two prices. Refund Terms & Conditions All Travel Guides TOP COUNTRIES Turkey France Belgium Germany Spain Sweden Greece United States Canada Portugal United Kingdom TOP CITIES Paris Lisbon London Athens Rome Alicante Orlando, Florida Toronto Mexico City Stockholm Bruges THEMES TO EXPLORE With your kids Lazy beach days Shopper's Paradise I Love Culture Historical destinations Be Active Wallet Friendly Vibrant Cities Hidden gems ArrivalGuides' Favourites Sustainable cities Stay Connected More About Contact Clients Become Destination Partner Buy Destination Content Buy Destination Video Privacy Policy © 2005-2025 ArrivalGuides, A Lion Ventures company. All rights reserved."
    },
    {
      "url": "https://mytiki.life/tiki-bars/aku-aku-tiki-bar",
      "text": "Tiki Bar: Aku Aku Tiki Bar - Oslo | mytiki.life Welcome to the mytiki.life v2 beta. This is a work in progress and there may be some bugs. If you find any issues or have feedback send me an email: [email protected] . mytiki.life Home Tiki Mugs Swizzle Sticks Other Collectibles Collectors Creators Tiki Bars Home Tiki Bars Contact Request an update Sign in Create an account Search Quick Search Sign in Home Commercial Tiki Bars Aku Aku Tiki Bar - Oslo Grünerløkka, Oslo, Norway Add Visit Close Aku Aku Tiki Bar opened in May 2007, in the Grnerlkka neighborhood of Oslo. Some of the decor was on loan from the Kon-Tiki Museum, including a large canoe hanging from the ceiling. The walls were lined with straw matting. Classic tiki drinks were served in tiki mugs, and the music was a mix of Hawaiian and Exotica tunes. Closed April 6th, 2024. Details Type Bar Address Grünerløkka, Oslo, Norway Closed? Yes (Permanently) Links akuaku.no instagram.com facebook.com Gallery 3\n                            Tiki Mugs Tiki Farm Hawaiian Lono - Purple - for the Aku Aku Tiki Bar in Oslo Tangata Tiki Mug - Green - with Aku Aku Tiki Bar Fire Decal Tiki Farm Yellow Moai with Aku Aku Tiki Bar Fire Decal 4\n                            Visits TikiTropic – 18 Aug 2022 I had a amazing evenig there (two) just 4 days after 15th anniversary. The stuff was so friendly and the cocktails were fantastic. I also purchased one of the last Aku Aku mugs form to opening in 2007 witch they found in the cellar some days before. The interior is just exciting. Especially to see and to touch the original outrigger from Thor Heyerdals Kon Tiki is great. Tikihellcat – Date: Unknown Ken Odegard – Date: Unknown DrThundr – Date: Unknown Entry Meta Date Created 23 Apr 2020, 3:59:19 pm Date Updated 12 Apr 2024, 8:48:54 pm Author mytikilife Edit entry ⭐ Support mytiki.life with a supporter subscription! ⭐"
    },
    {
      "url": "https://theorlandolife.com/event-venue/aku-aku-tiki-bar/",
      "text": "Aku Aku Tiki Bar - The Orlando Life Home Spotlight Arts & Entertainment Food & Drink Lifestyle Gallery Health & Wellness Outdoors Sports & Rec Style & Fashion Business Aerospace & Defense Entrepreneurship & Startups Goods & Services Healthcare & Life Sciences Hospitality & Tourism Professional Networking & Growth Real Estate & Development Tech & Simulation Events ✕ No results See all results Aku Aku Tiki Bar Not Another Film Lab May 29, 2025 CityArts June 3, 2025 Published by Dave Vanz on June 3, 2025 Categories Tags Aku Aku Tiki Bar 431 East Central Blvd. Orlando, Fl 32801 Aku Aku is a tribute to one of the greatest eras in Tiki, the 1960’s . The Stardust Casino in glitzy Las Vegas opened its doors in 1958, soon after, it opened Aku Aku restaurant. With its beautiful tropical decor and its two Monolith Moais out front, it was the place to be, and the place to be seen. Here in Orlando, we have a perfect tribute in the Stardust Lounge with its wonderful Retro vibe and classic drink menu, and the Aku Aku tiki bar. Aku will transport you to a tropical paradise of bamboo and thatch and its meticulously made tropical libations. One of the most important ingredients to true tropical escapism is a good drink and a good setting. Here at Aku a great pride is taken in delivering you a proper cocktail. So after you choose your drink of desire, sit back, put down that phone and spark up a conversation with a stranger or take in all the glorious decor and items on the shelves. Who knows you may even see some things you never noticed before. Adventure Awaits! Website Share 0 Dave Vanz Proponent of strong, active and engaged communities.  I believe everything we create is an expression of who we are, and it's that belief that drives my curiosity to uncover the story's behind those shaping Orlando's Culture. I approach life with a drive for innovation and love connecting with like-minded, kind and ambitious people. Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Type in the text displayed above Δ Menu Home Community People About Careers Terms of Services Privacy Policy Contact Us Contact info news@theorlandolife.com © 2025 Soweo, Inc | All Rights Reserved No results See all results"
    },
    {
      "url": "https://hospitals.aku.edu/pakistan/ContactUs/Pages/default.aspx",
      "text": "Contact Us You may be trying to access this site from a secured browser on the server. Please enable scripts and reload this page. Turn on more accessible mode Turn off more accessible mode Skip Ribbon Commands Skip to main content Turn off Animations Turn on Animations SharePoint Sign In Follow × Numbers Location Phone Number Main Hospital Contact Center (8 am – 12 midnight) +92 21 111 911 911 Main Hospital - Clinic and Radiology Appointments (8 am – 12 midnight) ​+92 21 111 911 911​ ​Main Campus 24/7 Emergency, Stadium Road ​+92 21 3486 1090​ ​Clifton Medical Services: Consulting Clinics and 24/7 Urgent Care +92 21 111 911 911 Main Hospital Clinical Laboratory +92 21 111 911 911​ ​Main Hospital Blood Bank +92 21 3486 1558​​​​​ ​Main Hospital Drug and Poison Information +92 21 3486 1504​​\n+92 21 3486 1506​ Main Hospital Vaccination Services +92 21 3486 1573 \n+92 21 3486 1495 ​Patient Welfare Department +92 21 3486 9583\n+92 21 3486 9584\n+92 21 3486 9585 The Aga K​​han Maternal and Child Care Centre (AKMCCC), Hyderabad ​+92 22 430 0777 - 8301 Aga Khan Hospital for Women Garden ​+92 21 3616 7400 - 7500 The Aga Khan Hospital for Women Karimabad +92 21 3616 7600 ​The Aga Khan Hospital for Women and Children, Kharadar +92 21 3616 7800 Main Hospital ​New Private Wing Main Reception ​+92 21 3486 8040 \n+92 21 3486 8041 Main Hospital New Private Wing Patient Admission and Billing Office ​+92 21 3486 8026\n+92 21 3486 8027 ​Main Hospital New Private Wing Concierge Services ​+92 21 3486 8025​ Patient Referral Services (9 am to 11 pm) +92 21 3486 3100 It looks like your browser does not have JavaScript enabled. Please turn on JavaScript and try again. The Aga Khan University Hospital, Pakistan Currently selected About Us About AKUH Welcome by CEO, AKUH, Pakistan Vision, Mission and Values Accreditations Hospitals Aga Khan University Hospital, Karachi, Main Campus Hospital Private Wing - Princess Zahra Pavilion Hospital Facilities Hospital Guide Hospital Admissions (Inpatient Services) Clinics Specialized Clinics (Outpatients) Aga Khan Hospital for Women, Garden Aga Khan Hospital for Women, Karimabad Hospital Facilities Hospital Guide Hospital Admissions Clinics Clinic Schedule Aga Khan Hospital for Women and Children, Kharadar Hospital Facilities Hospital Guide Diagnostic and Laboratory Services Hospital Admissions Clinics Clinic Schedule Aga Khan Maternal and Child Care Centre, Hyderabad Hospital Facilities Hospital Guide Obstetrics and Gynecology Services Hospital Admissions Clinics Clinic Schedule Medical Centres and Clinical Laboratories Clinical Laboratories Clinical Laboratories Packages Lab Sample Collection Request Find Your Nearest Laboratory ​ Our Laboratory Tests COVID-19 Testing sites Medical C​entres Clifton Medical Services​​ Pharmacies Health Solutions Clinics Health Packages Treatments and Services Home Health Services Second Opinion Services Medical Tourism Solutions Patient Services Find a Doctor Prepare for Your Visit Payment Options Concierge Services Referral Services Patient Welfare Welfare Support Zakat Support How to Apply Donate and Support Aga Khan University Aga Khan University Hospitals Aga Khan University Aga Khan University Hospitals Numbers Locations Find Doctors Appointments Feedback The Aga Khan University Hospital, Pakistan Currently selected About Us About AKUH Welcome by CEO, AKUH, Pakistan Vision, Mission and Values Accreditations Hospitals Aga Khan University Hospital, Karachi, Main Campus Hospital Private Wing - Princess Zahra Pavilion Hospital Facilities Hospital Guide Hospital Admissions (Inpatient Services) Clinics Specialized Clinics (Outpatients) Aga Khan Hospital for Women, Garden Aga Khan Hospital for Women, Karimabad Hospital Facilities Hospital Guide Hospital Admissions Clinics Clinic Schedule Aga Khan Hospital for Women and Children, Kharadar Hospital Facilities Hospital Guide Diagnostic and Laboratory Services Hospital Admissions Clinics Clinic Schedule Aga Khan Maternal and Child Care Centre, Hyderabad Hospital Facilities Hospital Guide Obstetrics and Gynecology Services Hospital Admissions Clinics Clinic Schedule Medical Centres and Clinical Laboratories Clinical Laboratories Clinical Laboratories Packages Lab Sample Collection Request Find Your Nearest Laboratory ​ Our Laboratory Tests COVID-19 Testing sites Medical C​entres Clifton Medical Services​​ Pharmacies Health Solutions Clinics Health Packages Treatments and Services Home Health Services Second Opinion Services Medical Tourism Solutions Patient Services Find a Doctor Prepare for Your Visit Payment Options Concierge Services Referral Services Patient Welfare Welfare Support Zakat Support How to Apply Donate and Support It looks like your browser does not have JavaScript enabled. Please turn on JavaScript and try again. The Aga Khan University Hospital, Pakistan > Contact Us Dear Client, Thank you for choosing Aga Khan University Hospital as your preferred healthcare provider. We are committed to providing you with world class health care from our dedicated staff and y our feedback is valuable to us. Feedback / Enquiry Form Your name Your email address Subject Message ​​​​ Contact Us​ Accident & Emergency Adult Casualty Phone: +254 (0) 20366 2025 Paediatric (Child) Casualty Phone: +254 (0) 20366 2031 Client Relations and Customer feedback Phone: +254 (0) 20366 2804/ 2018 Email: client.relations@aku.edu General Information Location: 3rd Parklands Avenue, Limuru Road,Nairobi, Kenya Phone: +254 (0) 20366 2000, 20374 0000 Email: contact-us@aku.edu​ Patient Referral Office Phone: +254 (0) 20366 2888/2889 Mobile: +254 (0) 786255942, (0) 733889933 ​ Email: patient.referral@aku.edu​ ​ Resources and Information Health Records Request Laboratory Reports Diseases Encyclopedia Patient Education Material Patient Rights and Responsibilities Quality and Patient Safety Patient Support Groups Quick Links Aga Khan University Careers at AKU OneAKU Webmail Sign in Website Policies Copyright Privacy Policy Terms of Use © The Aga Khan University Hospital, Pakistan"
    }
  ]
}