{
  "fuentes": [
    {
      "url": "https://svsef.org/about-svsef/coaching-staff-board/",
      "email": "agilbert@svsef.org"
    },
    {
      "url": "https://svsef.org/about-svsef/coaching-staff-board/",
      "email": "asavaria@svsef.org"
    },
    {
      "url": "https://svsef.org/about-svsef/coaching-staff-board/",
      "email": "bcaulkins@svsef.org"
    },
    {
      "url": "https://svsef.org/about-svsef/coaching-staff-board/",
      "email": "bflynn@svsef.org"
    },
    {
      "url": "https://svsef.org/about-svsef/coaching-staff-board/",
      "email": "bschumacher@svsef.org"
    },
    {
      "url": "https://svsef.org/about-svsef/coaching-staff-board/",
      "email": "cgourlay@svsef.org"
    },
    {
      "url": "https://svsef.org/about-svsef/coaching-staff-board/",
      "email": "charris@svsef.org"
    },
    {
      "url": "https://svsef.org/about-svsef/coaching-staff-board/",
      "email": "cmallory@svsef.org"
    },
    {
      "url": "https://svsef.org/about-svsef/coaching-staff-board/",
      "email": "cstern@svsef.org"
    },
    {
      "url": "https://svsef.org/about-svsef/coaching-staff-board/",
      "email": "dangerdave@svsef.org"
    },
    {
      "url": "https://svsef.org/about-svsef/coaching-staff-board/",
      "email": "gladys@svsef.org"
    },
    {
      "url": "https://svsef.org/about-svsef/coaching-staff-board/",
      "email": "heather@svsef.org"
    },
    {
      "url": "https://svsef.org/about-svsef/coaching-staff-board/",
      "email": "jgrigsby@svsef.org"
    },
    {
      "url": "https://svsef.org/about-svsef/coaching-staff-board/",
      "email": "kelley@svsef.org"
    },
    {
      "url": "https://svsef.org/about-svsef/coaching-staff-board/",
      "email": "lexie@svsef.org"
    },
    {
      "url": "https://svsef.org/about-svsef/coaching-staff-board/",
      "email": "maddy@svsef.org"
    },
    {
      "url": "https://svsef.org/about-svsef/coaching-staff-board/",
      "email": "matthew@svmcgraw.com"
    },
    {
      "url": "https://svsef.org/about-svsef/coaching-staff-board/",
      "email": "mimi@svsef.org"
    },
    {
      "url": "https://svsef.org/about-svsef/coaching-staff-board/",
      "email": "mpendl@svsef.org"
    },
    {
      "url": "https://svsef.org/about-svsef/coaching-staff-board/",
      "email": "mpolito@svsef.org"
    },
    {
      "url": "https://svsef.org/about-svsef/coaching-staff-board/",
      "email": "nate@svsef.org"
    },
    {
      "url": "https://svsef.org/about-svsef/coaching-staff-board/",
      "email": "pholmes@svsef.org"
    },
    {
      "url": "https://svsef.org/about-svsef/coaching-staff-board/",
      "email": "rick@svsef.org"
    },
    {
      "url": "https://svsef.org/about-svsef/coaching-staff-board/",
      "email": "scott@svsef.org"
    },
    {
      "url": "https://svsef.org/about-svsef/coaching-staff-board/",
      "email": "sverst@svsef.org"
    },
    {
      "url": "https://svsef.org/about-svsef/coaching-staff-board/",
      "email": "tconway@svsef.org"
    },
    {
      "url": "https://svsef.org/about-svsef/coaching-staff-board/",
      "email": "wbrandenburg@svsef.org"
    },
    {
      "url": "https://risingsunopp.org/about/people/",
      "email": "ayyagari@risingsunopp.org"
    },
    {
      "url": "https://risingsunopp.org/about/people/",
      "email": "burns@risingsunopp.org"
    },
    {
      "url": "https://risingsunopp.org/about/people/",
      "email": "canelatorres@risingsunopp.org"
    },
    {
      "url": "https://risingsunopp.org/about/people/",
      "email": "caras@risingsunopp.org"
    },
    {
      "url": "https://risingsunopp.org/about/people/",
      "email": "clark@risingsunopp.org"
    },
    {
      "url": "https://risingsunopp.org/about/people/",
      "email": "cong@risingsunopp.org"
    },
    {
      "url": "https://risingsunopp.org/about/people/",
      "email": "croxdale@risingsunopp.org"
    },
    {
      "url": "https://risingsunopp.org/about/people/",
      "email": "cummins@risingsunopp.org"
    },
    {
      "url": "https://risingsunopp.org/about/people/",
      "email": "diez@risingsunopp.org"
    },
    {
      "url": "https://risingsunopp.org/about/people/",
      "email": "domingo@risingsunopp.org"
    },
    {
      "url": "https://risingsunopp.org/about/people/",
      "email": "garcia@risingsunopp.org"
    },
    {
      "url": "https://risingsunopp.org/about/people/",
      "email": "gessese@risingsunopp.org"
    },
    {
      "url": "https://risingsunopp.org/about/people/",
      "email": "hart@risingsunopp.org"
    },
    {
      "url": "https://risingsunopp.org/about/people/",
      "email": "hatton@risingsunopp.org"
    },
    {
      "url": "https://risingsunopp.org/about/people/",
      "email": "huerta@risingsunopp.org"
    },
    {
      "url": "https://risingsunopp.org/about/people/",
      "email": "info@risingsunopp.org"
    },
    {
      "url": "https://risingsunopp.org/about/people/",
      "email": "janikian@risingsunopp.org"
    },
    {
      "url": "https://risingsunopp.org/about/people/",
      "email": "jeffreys@risingsunopp.org"
    },
    {
      "url": "https://risingsunopp.org/about/people/",
      "email": "katzbalmes@risingsunopp.org"
    },
    {
      "url": "https://risingsunopp.org/about/people/",
      "email": "kumar@risingsunopp.org"
    },
    {
      "url": "https://risingsunopp.org/about/people/",
      "email": "laettner@risingsunopp.org"
    },
    {
      "url": "https://risingsunopp.org/about/people/",
      "email": "li@risingsunopp.org"
    },
    {
      "url": "https://risingsunopp.org/about/people/",
      "email": "liddle@risingsunopp.org"
    },
    {
      "url": "https://risingsunopp.org/about/people/",
      "email": "nichols@risingsunopp.org"
    },
    {
      "url": "https://risingsunopp.org/about/people/",
      "email": "oakley@risingsunopp.org"
    },
    {
      "url": "https://risingsunopp.org/about/people/",
      "email": "petrone@risingsunopp.org"
    },
    {
      "url": "https://risingsunopp.org/about/people/",
      "email": "piconescastro@risingsunopp.org"
    },
    {
      "url": "https://risingsunopp.org/about/people/",
      "email": "pintocabrera@risingsunopp.org"
    },
    {
      "url": "https://risingsunopp.org/about/people/",
      "email": "ramirez@risingsunopp.org"
    },
    {
      "url": "https://risingsunopp.org/about/people/",
      "email": "salamanca@risingsunopp.org"
    },
    {
      "url": "https://risingsunopp.org/about/people/",
      "email": "sin@risingsunopp.org"
    },
    {
      "url": "https://risingsunopp.org/about/people/",
      "email": "sisk@risingsunopp.org"
    },
    {
      "url": "https://risingsunopp.org/about/people/",
      "email": "tiner@risingsunopp.org"
    },
    {
      "url": "https://risingsunopp.org/about/people/",
      "email": "vargas@risingsunopp.org"
    },
    {
      "url": "https://risingsunopp.org/about/people/",
      "email": "wesley@risingsunopp.org"
    },
    {
      "url": "https://www.thestitchsaloon.com/pages/contact-us",
      "email": "thestitchsaloon@outlook.com"
    },
    {
      "url": "https://www.midwayusafoundation.org/contactus/",
      "email": "info@midwayusafoundation.org"
    },
    {
      "url": "https://www.midwayusafoundation.org/contactus/",
      "email": "info@midwayusafoundation.org"
    }
  ],
  "mails": [
    "agilbert@svsef.org",
    "asavaria@svsef.org",
    "ayyagari@risingsunopp.org",
    "bcaulkins@svsef.org",
    "bflynn@svsef.org",
    "bschumacher@svsef.org",
    "burns@risingsunopp.org",
    "canelatorres@risingsunopp.org",
    "caras@risingsunopp.org",
    "cgourlay@svsef.org",
    "charris@svsef.org",
    "clark@risingsunopp.org",
    "cmallory@svsef.org",
    "cong@risingsunopp.org",
    "croxdale@risingsunopp.org",
    "cstern@svsef.org",
    "cummins@risingsunopp.org",
    "dangerdave@svsef.org",
    "diez@risingsunopp.org",
    "domingo@risingsunopp.org",
    "garcia@risingsunopp.org",
    "gessese@risingsunopp.org",
    "gladys@svsef.org",
    "hart@risingsunopp.org",
    "hatton@risingsunopp.org",
    "heather@svsef.org",
    "huerta@risingsunopp.org",
    "info@midwayusafoundation.org",
    "info@risingsunopp.org",
    "janikian@risingsunopp.org",
    "jeffreys@risingsunopp.org",
    "jgrigsby@svsef.org",
    "katzbalmes@risingsunopp.org",
    "kelley@svsef.org",
    "kumar@risingsunopp.org",
    "laettner@risingsunopp.org",
    "lexie@svsef.org",
    "li@risingsunopp.org",
    "liddle@risingsunopp.org",
    "maddy@svsef.org",
    "matthew@svmcgraw.com",
    "mimi@svsef.org",
    "mpendl@svsef.org",
    "mpolito@svsef.org",
    "nate@svsef.org",
    "nichols@risingsunopp.org",
    "oakley@risingsunopp.org",
    "petrone@risingsunopp.org",
    "pholmes@svsef.org",
    "piconescastro@risingsunopp.org",
    "pintocabrera@risingsunopp.org",
    "ramirez@risingsunopp.org",
    "rick@svsef.org",
    "salamanca@risingsunopp.org",
    "scott@svsef.org",
    "sin@risingsunopp.org",
    "sisk@risingsunopp.org",
    "sverst@svsef.org",
    "tconway@svsef.org",
    "thestitchsaloon@outlook.com",
    "tiner@risingsunopp.org",
    "vargas@risingsunopp.org",
    "wbrandenburg@svsef.org",
    "wesley@risingsunopp.org"
  ],
  "nombre_sitio": "allaboutthesunshinestate.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://svsef.org/about-svsef/coaching-staff-board/",
      "text": "Coaching, Staff, & Board » Sun Valley Ski Education Foundation SVSEF Store Mountain Report Avalanche Report About Academics Alumni Annual Reports and Financials Coaching, Staff, & Board Facilities History Parent Resources Perpetual Awards Registration & Financial Aid Who We Are Programs Alpine Big Mountain Cross Country Gold Team Entry Level Programs Freeski (Park & Pipe) Freestyle (Moguls) Mini X Snowboard South Valley Programs SVSEF Summer Programs Blue Bus Schedule News/Events All News All Events Baldy Hill Climb Gary Black, Jr. Memorial Race Laura Flood Memorial Race Monroe Cup Rotarun Arkoosh Cup XC IMD Sun Valley JNQ XC Town Series Get Involved Auction Donations Contact Us Cooper-Taché Fund Donate Grass Roots to Grand Stage Diversity Project More Ways To Give Sponsorships SVSEF Athlete Endowment SVSEF Store Volunteer 2025/26 SPORTSENGINE SIGN-UPS Donate Search About SVSEF Coaching, Staff, & Board Meet the people that make the Sun Valley Ski Education Foundation glide down the mountain. Staff Directory All Alpine Coaches XC Coaches Entry Level Program Coaches Ski & Ride Coaches Admin/Operations Staff Executive Director Scott McGrew Mini X Program Director Ben Schumacher Alpine Junior Program Director & Alpine LASAR Head Coach Chuck Harris Cross Country Program Director Becky Flynn Snowboard Program Director Danger Dave Boldwin Freestyle Program Director John Grigsby Cross Country Assistant Program Director & Prep Team Head Coach Kelley Yeates Big Mountain Program Director Sarah Verst Freeski Program Director & Air Barn Manager Tyler Conway Alpine Program Director Will Brandenburg Alpine U12 North Series Team Coach, Alpine Volunteer Coord, Alpine Program Asst Adele Savaria Snowboard Program Consultant Andy Gilbert Baldy Devo/LASAR Program Mentor Brian Caulkins Snowboard Mini Shred Head Coach C Gordon Knight FIS Team Assistant Coach & Assistant Alpine Director Charlotte Gourlay Cross Country Comp Team Head Coach Chris Mallory Alpine U12 North Series Head Coach Claudia Stern Alpine U10 Mini World Cup Head Coach Daniela Anguita Snowboard Futures Team Head Coach Edward Sawicz Alpine U16 Assistant Coach & Assistant Alpine Director Gladys Weidt Director of Strategic Communications & Development Heather Foster Snowboard Devo Head Coach JaNessa Gilbert Cross Country Devo South Head Coach Lexie Praggastis Business Manager & Client Relations Madeline Uhrig Cross Country Devo North Head Coach Martha Pendl Freestyle (Moguls) 3-Day Progression Head Coach Matthew McGraw XC Post Grad Head Coach Max Polito Director of Finance & Admin Mimi Crocker Alpine U16 Team Head Coach Nate Schwing Cross Country Gold Team and Summer Training Group Head Coach Peter Holmes SVSEF Director of Sport Development Rick Kapala Alpine Baldy Devo Head Coach Sarah Schwing Alpine X Head Coach Steve Thompson Alpine FIS Head Coach Will Courtney Communications and Development Coordinator Will Falltrick Executive Director Scott McGrew Born in the original Sun Valley hospital and raised on the slopes of Rotarun and Baldy, Scott McGrew’s connection to the Wood River Valley runs deep. A former SVSEF athlete himself, Scott has spent more than two decades serving the organization in nearly every role—from coach and program director to bus driver and, today, executive director. Scott is also a Level 3 Alpine Coach, Level 4 Chief of Race, Wilderness EMT, black belt in Taekwondo, and a once-fluent (now admittedly rusty) Spanish speaker. Scott’s education spans biochemistry at the University of Washington, dual degrees in Biology and Cultural Anthropology from the University of New Mexico, and an MBA from Boise State. A year studying at the University of Guadalajara and travels throughout Latin America shaped his lifelong curiosity for cultures, systems, and people. That perspective continues to influence how he leads—with humility, purpose, and a deep respect for the real and sometimes messy human experience. In addition to leading SVSEF, Scott oversees operations at Rotarun Ski Area, expanding access to snow sports for local families and first-generation skiers. He and his wife are raising three kids who share their love of wild places and off-the-map adventures. For Scott, leadership is about more than direction—it’s about reimagining how we show up for each other, build trust, and grow together. Email: scott@svsef.org Mini X Program Director Ben Schumacher NICKNAME : Shoo HOMETOWN / WHERE I GREW UP : Chattaroy, Washington EDUCATION : Seattle University, Bachelor’s in Chemistry AWARDS / ACCOLADES : Certified P edorthist WHAT YEAR DID YOU START COACHING AT SVSEF? 2014 WHY DO YOU COACH? I coach because it’s the next step in my progression, by passing on the love for skiing and the mountains to stoked little humans . COACHING CERTIFICATIONS: Alpine Level 1 SKIING BACKGROUND : Moved here in 2001 have had a season’s pass ever since WHEN I WAS 5 YEARS OLD, I WAS PRETTY SURE I’D BE AN ADULT WHEN I GREW UP. THE MOST IMPORTANT THING I LEARNED BEFORE HIGH SCHOOL WAS love. IF I COULD INVENT A HOLIDAY, IT WOULD DEFINITELY INVOLVE live music. HOBBIES AND OTHER INTERESTS THAT FUEL MY SOUL: Garden building Research Reading Family Home Bicycles Fishing Hunting Email: bschumacher@svsef.org Phone: 208.720.1799 Alpine Junior Program Director & Alpine LASAR Head Coach Chuck Harris HOMETOWN / WHERE I GREW UP : Sandy, Oregon EDUCATION : B.S. History AWARDS / ACCOLADES : Started the “Chuck Cup” at Burke Mountain Academy. It’s a 3-on-3 soccer tournament that has been around for more than 25 years. WHAT YEAR DID YOU START COACHING AT SVSEF? 2016-2020, back for more in 2022! WHY DO YOU COACH? I enjoy being outside and in the mountains, and I enjoy convincing kids they can do more than they think they can. COACHING CERTIFICATIONS: USSS Level 400 SKIING BACKGROUND : Grew up skiing at Mt. Hood. Skied for EOU (USCSA) THE MOST IMPORTANT THING I LEARNED BEFORE HIGH SCHOOL WAS to wake up early… they day is longer and you have more time to have more fun. IF I COULD INVENT A HOLIDAY, IT WOULD DEFINITELY INVOLVE opening day of the NFL season. HOBBIES AND OTHER INTERESTS THAT FUEL MY SOUL: Watching the Dallas Cowboys and the Oregon Ducks Playing golf Doing anything that my son has interest in Cruising around the backcountry in my RZR Hiking my dog for endless miles WHAT’S YOUR ARCHETYPE ? 42% Creative 33% Visionary 25% Rebel Email: charris@svsef.org Phone: 208.360.3699 Cross Country Program Director Becky Flynn HOMETOWN / WHERE I GREW UP : Auburn, Maine EDUCATION : Bates College/BA/Psychology Lasell University/MS (ongoing) / Athletic Administration WHAT YEAR DID YOU START COACHING AT SVSEF? 2022 WHY DO YOU COACH? I am passionate about helping people achieve their goals. THE MOST IMPORTANT THING I LEARNED BEFORE HIGH SCHOOL WAS to be kind. IF I COULD INVENT A HOLIDAY, IT WOULD DEFINITELY INVOLVE m y family and friends enjoying a great adventure . HOBBIES AND OTHER INTERESTS THAT FUEL MY SOUL: Being outdoors doing just about anything. Email: bflynn@svsef.org Phone: 207-577-9442 Snowboard Program Director Danger Dave Boldwin HOMETOWN / WHERE I GREW UP : Essex Jct, Vermont EDUCATION : Rice Memorial High School class of 1999 AWARDS/ACCOLADES: I have all the cards and thank you notes I’ve ever received from riders I’ve worked with. Every one of those is an award I’ll cherish long after my snowboard coaching days are over. WHAT YEAR DID YOU START COACHING AT SVSEF? 2018 WHY DO YOU COACH? I started coaching in 2003 so I could get a free season pass and lengthen the time I wouldn’t have to be an electrician (currently it’s been 22 years). Now I coach because snowboarding changed the entire direction of my life and I want to provide that opportunity to as many people as possible. I never grew up thinking I could be anything other than an electrician. I want to pass on what I’ve learned over the last 22 years. If you work hard, are dedicated and passionate, you can live your dream. COACHING CERTIFICATIONS: Level 300 USSA/USASA with continuing education credits SKIING/RIDING BACKGROUND: Began snowboarding in 1995, it’s been all downhill since. WHEN I WAS 5 YEARS OLD, I WAS PRETTY SURE I’D BE A 6 YEAR OLD WHEN I GREW UP. THE MOST IMPORTANT THING I LEARNED BEFORE HIGH SCHOOL WAS that snowboarding existed! IF I COULD INVENT A HOLIDAY, IT WOULD DEFINITELY INVOLVE skateboarding and snowboarding in the same day. Maybe cake. HOBBIES AND OTHER INTERESTS THAT FUEL MY SOUL: Skateboarding Splitboarding Summer snowboard trips to Mt. Hood Peak bagging (I’m new to this) Backpacking Winter hut trips Being in the elements Finding quiet places in nature with my dog Reading (mostly non fiction) Gardening Email: dangerdave@svsef.org Freestyle Program Director John Grigsby I hail from in Portland, Maine where I started my coaching career at the age of 17 for the Freestyle Development program at Gould Academy/Sunday River. During college, I continued coaching weekends at CVA/Sugarloaf, where I later coached full-time for Carabassett Valley Academy. For 6 years prior to joining SVSEF, I was the Director of Freestyle Development at Ski & Snowboard Club Vail, where I helped grow and develop one of the top freestyle programs in the country. Hobbies/other interests: Fly fishing, bow hunting Email: jgrigsby@svsef.org Phone: 207-233-8501 Certifications: Level 3 USSA Freestyle Years at SVSEF: 4 Hometown: Portland, ME College: Maine College of Art (MECA) Cross Country Assistant Program Director & Prep Team Head Coach Kelley Yeates NICKNAME : Coach Awesome HOMETOWN / WHERE I GREW UP : Ketchum, Idaho EDUCATION : Wood River High School Bates College, Bachelor of Arts WHAT YEAR DID YOU START COACHING AT SVSEF? 2005 WHY DO YOU COACH? Because I love the people that this program creates, and I have experienced in my own life what an amazing role the SVSEF can have on a young person’s life. COACHING CERTIFICATIONS: XCC USSA L100 SKIING BACKGROUND : SVSEF XC team 1 st -12 th grade Bates College Ski Team 2001-2002 SVSEF Alpine D team SVSEF Snowboard D team WHEN I WAS 5 YEARS OLD, I WAS PRETTY SURE I’D BE A DOCTOR WHEN I GREW UP. THE MOST IMPORTANT THING I LEARNED BEFORE HIGH SCHOOL WAS how to knit in a ski van. IF I COULD INVENT A HOLIDAY, IT WOULD DEFINITELY INVOLVE trolls—actually I already invented this it falls on the 1 st Wednesday of March and it is awesome. HOBBIES AND OTHER INTERESTS THAT FUEL MY SOUL: Ice Hockey Sitting by alpine lakes Fantasy football Mail: kelley@svsef.org Big Mountain Program Director Sarah Verst NICKNAME : “sunshine” but only my mom can call me that HOMETOWN / WHERE I GREW UP : Hailey, Idaho EDUCATION : Boise State University: B.A. Interdisciplinary Professional Studies, Public Health & Leadership focus Boise State University: Certificate in Foundations of Public Health AWARDS/ACCOLADES: Dean’s List, Boise State University WHAT YEAR DID YOU START COACHING AT SVSEF? 2019 ( Mini X Coach, Assistant Coach, Big Mountain/Freeride Program) WHY DO YOU COACH? I coach to help young athletes grow both on and off the mountain—building confidence, resilience, and a lifelong love for skiing and community. SKIING BACKGROUND : SVSEF Alum—grew up on the Cross Country team before transitioning to freeride skiing 6+ years coaching freeride athletes with SVSEF WHEN I WAS 5 YEARS OLD, I WAS PRETTY SURE I’D BE A LAWN MOWER WHEN I GREW UP. THE MOST IMPORTANT THING I LEARNED BEFORE HIGH SCHOOL WAS that if I ignore my brothers they bother me less. IF I COULD INVENT A HOLIDAY, IT WOULD DEFINITELY INVOLVE costumes, outdoor games, and lots of laughter. HOBBIES AND OTHER INTERESTS THAT FUEL MY SOUL: Trail running and mountain adventures Playing music (piano and guitar) Community mental health advocacy Creative arts: design, painting, and writing Traveling and exploring new cultures Email: sverst@svsef.org Phone: 208.721.0754 Freeski Program Director & Air Barn Manager Tyler Conway NICKNAME : T HOMETOWN / WHERE I GREW UP : Johnsonburg, New York EDUCATION : SUNY Morrisville (left to ski) WHAT YEAR DID YOU START COACHING AT SVSEF? 2016 WHY DO YOU COACH? To keep the stoke alive. COACHING CERTIFICATIONS: US Ski and Snowboard Freeski level 300 USASA Freeski 100, 200 First Aid + CPR SKIING BACKGROUND : 2009-2016 Head coach and assistant program manager for Team Breckenridge Sports Club 2009-2016 Coach at Woodward at Copper 2008-2009 Head coach Tahoe Freeride 2005-2006 Coach as Terrain Park Specialist, Stratton, Vermont 2002-2005 Coach as Terrain Park Specialist, Mount Snow, Vermont 1998-2001 Freeski influencer WHEN I WAS 5 YEARS OLD, I WAS PRETTY SURE I’D BE A FARMER WHEN I GREW UP. THE MOST IMPORTANT THING I LEARNED BEFORE HIGH SCHOOL WAS how to drive, milk cows, and make maple syrup. HOBBIES AND OTHER INTERESTS THAT FUEL MY SOUL: Life WHAT’S YOUR ARCHETYPE ? Creative Visionary Rebel Email: tconway@svsef.org Phone: 970-409-9617 Alpine Program Director Will Brandenburg NICKNAME: Willy B, Wilbur HOMETOWN / WHERE I GREW UP : Born in Walla Walla, Washington. Learned to ski at Ski Bluewood, moved to Spokane, Washington in 4th grade. EDUCATION : Mead High School graduate AWARDS / ACCOLADES : 2007 Ski Racing Junior of the Year Award WHAT YEAR DID YOU START COACHING AT SVSEF? 2015 WHY DO YOU COACH? To share my passion for the sport that has given me so much personal growth, with the next generation. COACHING CERTIFICATIONS: PSIA Level 3 instructor Level 3 Chef of race Level 3 Chef of Course Level 3 Referee SKIING BACKGROUND : U.S. Ski Team member from 2007-2015. Competed for Team USA in the 2010 Winter Olympics (finished 10 th in the Alpine Combined). Competed for the USA in the 2011 (Garmisch, Germany) 2013 (Schladming, Austria) and 2015 (Vail/Beaver Creek) Alpine World Championships. Top World Cup result: 6 th place in Slalom, Kranjska Gora, Slovenia. Made the National Team competing for Schweitzer Alpine Racing School. Learned to ski and race at Ski Bluewood outside of Dayton, Washington. WHEN I WAS 5 YEARS OLD, I WAS PRETTY SURE I’D BE A PROFESSIONAL JET SKI DRIVER WHEN I GREW UP. Not a joke. I really thought that was my calling. THE MOST IMPORTANT THING I LEARNED BEFORE HIGH SCHOOL WAS, if you show effort or passion there is almost always someone who wants to help you. IF I COULD INVENT A HOLIDAY, IT WOULD DEFINITELY INVOLVE chili-stuffed baked potatoes. HOBBIES AND OTHER INTERESTS THAT FUEL MY SOUL: Reading Writing Boating Waterskiing Music- Red Dirt Country/Americana/Folk Playing Basketball, Volleyball and Curling Gonzaga Basketball Seahawks Football Mariners Baseball NBA Basketball Sharing or following all passions with my family WHAT’S YOUR ARCHETYPE ? 40% Caregiver 40% Visionary 20% Intellectual Phone Number: 208-481-7269 Email: wbrandenburg@svsef.org Alpine U12 North Series Team Coach, Alpine Volunteer Coord, Alpine Program Asst Adele Savaria Ski background: -1983-89 – US Ski Team -1986 – Vail World Cup DH – 6th -1987 – Crans Montana, Switzerland World Championship Team -1988 – Aspen World Cup DH – 11th -1989 – NorAm DH Overall Champion -1990 – NCSA Slalom, GS and Overall National Champion for the College of Idaho -2003 – Inducted into the College of Idaho Athletic Hall of Fame for Skiing and Tennis (went to NAIA Nationals for tennis 1991-1993) -2003-2010 – Founded Rotarun LASAR program with Pat I coach to connect with these kids in all aspects and I really enjoy seeing a kid smile when they finally understand what you are trying to teach them. In addition to skiing, I love tennis, hiking, hunting, golfing, mountain biking, gardening and baking Email: asavaria@svsef.org Phone: 208-720-3455 Certifications: Level 200 USSA Coach Years at SVSEF: 1981-1983 (racing), 1993-present (coaching) College: College of Idaho – BA – Accounting and Business Administration 1993 Hometown: Fresno, CA Snowboard Program Consultant Andy Gilbert NICKNAME : DEEZ! HOMETOWN / WHERE I GREW UP : Born in Sun Valley, Idaho. Raised in Portland, Oregon. (North Portland to be specific) EDUCATION : Jefferson High School Portland, Oregon Pacific Northwest College of Art (2 years) 30+ years screen printing experience AWARDS / ACCOLADES: 4-time US Snowboarding Project Gold Coach 3-time FIS Snowboard Junior World US Coach U.S. Snowboard Team Rookie Halfpipe Team Head Coach 2017-18 2-time USSA Domestic Snowboard Coach of the year Nominee 2005? “You Make A Difference” Award as voted on by staff and students of Wood River High School WHAT YEAR DID YOU START COACHING AT SVSEF? 1993/94 season as a Devo coach WHY DO YOU COACH? To pass on my love snowboarding, the people, places and experiences that come with its unique and transformative culture! COACHING CERTIFICATIONS: Level 300 USSA/USASA SKIING/RIDING BACKGROUND : The Gilbert family has over 100 years of skiing/riding history. Great Grandfather was a Ski Jumper at Mt. Hood in the 1920’s. Competitive ski racer 1979-1984 Began snowboarding in 1985 Sponsored rider (Joyride/Allian Snowboards) 1990-1998 Still ride as many days as I can when not coaching, it’s still the greatest thing ever! WHEN I WAS 5 YEARS OLD, I WAS PRETTY SURE I’D BE A DINOSAUR (it seems to be happening) WHEN I GREW UP. THE MOST IMPORTANT THING I LEARNED BEFORE HIGH SCHOOL WAS friendships really matter. IF I COULD INVENT A HOLIDAY, IT WOULD DEFINITELY INVOLVE having to walk in someone else’s shoes! HOBBIES AND OTHER INTERESTS THAT FUEL MY SOUL: Art, screen printing, collage making anything that is bold graphically. Golf, really the opposite of action sports, good for my focus and brain. Music, love learning about, collecting and sometimes pretending I can play a little. Email: agilbert@svsef.org Phone: 208.720.5005 Baldy Devo/LASAR Program Mentor Brian Caulkins Phone: 208-720-0128 Email: bcaulkins@svsef.org Certifications: USSA Coaching Level 200, CPR and First Aid Certified, Concussion Cert and Experienced in Concussions Hometown: Medford, Oregon Ski background: In high school I was reintroduced to skiing and it changed where I am today; I moved to Ketchum in 1982. Hobbies/other interests: Surfing, cycling Snowboard Mini Shred Head Coach C Gordon Knight FIS Team Assistant Coach & Assistant Alpine Director Charlotte Gourlay NICKNAME : Char, Latte HOMETOWN / WHERE I GREW UP : Ketchum, Idaho EDUCATION : Whitman College ’08—B.A. Psychology Wood River High School ’04 AWARDS / ACCOLADES : 2022 Janss Pro-Am Classic Winner 2023 Intermountain Division Coach of the Year WHAT YEAR DID YOU START COACHING AT SVSEF? 2011 WHY DO YOU COACH? To pass on my love of the sport and help support athletes in chasing the lifelong lessons alpine skiing has taught me. COACHING CERTIFICATIONS: USSS Level 300 OEC Technician—National Ski Patrol AAIRE Level 2 SKIING BACKGROUND : SVSEF from Devo through FIS Whitman College NCAA Division I Ski Team Sun Valley Town Series WHEN I WAS 5 YEARS OLD, I WAS PRETTY SURE I’D BE A THE KETCHUM COWGIRL WHEN I GREW UP. THE MOST IMPORTANT THING I LEARNED BEFORE HIGH SCHOOL WAS commitment. IF I COULD INVENT A HOLIDAY, IT WOULD DEFINITELY INVOLVE game shows. HOBBIES AND OTHER INTERESTS THAT FUEL MY SOUL: Hiking Gardening Yoga Tennis Paddle Boarding Cooking Traveling WHAT’S YOUR ARCHETYPE ? 47% Intellectual 37% Athlete 16% Visionary Email: cgourlay@svsef.org Phone: 208.720.3435 Cross Country Comp Team Head Coach Chris Mallory HOMETOWN / WHERE I GREW UP : Colchester, Vermont EDUCATION : University of New Hampshire—B.A. Recreation Management and Policy AWARDS / ACCOLADES : Coach and Service Tech for four World Junior/U23 World Championships and 2022 Beijing Paralympic Games WHAT YEAR DID YOU START COACHING AT SVSEF? 2006 WHY DO YOU COACH? I coach for the lasting relationships you have with kids coming through the program, and to foster a love for the sport of cross-country skiing. COACHING CERTIFICATIONS: USSS Level 2 Certification SKIING BACKGROUND : Grew up skiing and racing in Vermont Spent a PG year in Mora, Sweden Competed at the University of New Hampshire Coached 3 seasons at University of Vermont THE MOST IMPORTANT THING I LEARNED BEFORE HIGH SCHOOL WAS how to play outdoors. HOBBIES AND OTHER INTERESTS THAT FUEL MY SOUL: Riding bikes Ski touring Camping with the family Email: cmallory@svsef.org Phone: 603-498-1398 Alpine U12 North Series Head Coach Claudia Stern HOMETOWN / WHERE I GREW UP : I grew up between New York (city) and France EDUCATION : High School: Lycee Francais de NY / Stratton Mtn School College: Middlebury College / Computer Science WHAT YEAR DID YOU START COACHING AT SVSEF? Fall of 2015 WHY DO YOU COACH? Coaching is the logical outcome for having been involved in so many aspects of the ski industry. You take for so many years, then you give back. I get so much pleasure out of helping someone (in this case our U12s) accomplish what they are trying to do on their skis. The more I coach, the more I learn, the more I can help. COACHING CERTIFICATIONS: USSS Level 100 USSS Level 200 SKIING/RIDING BACKGROUND : I grew up racing on the east coast—first New York state, then Stratton Mountain School Raced for Middlebury college, All-American, podium NCAA champs (didn’t win…) Competed in the World University Games Raced on the U.S. Pro Ski Tour 6 years in R&D (product development) and 4 years in Marketing (mostly developing women’s programs) for Rossignol at their headquarters in France WHEN I WAS 5 YEARS OLD, I lived in the moment! THE MOST IMPORTANT THING I LEARNED BEFORE HIGH SCHOOL WAS I loved skiing more than anything else. IF I COULD INVENT A HOLIDAY, IT WOULD DEFINITELY INVOLVE eating! HOBBIES AND OTHER INTERESTS THAT FUEL MY SOUL: My happy place is anything involving wind sport: Windsurfing , Kitesurfing, Wing Foiling Cooking and eating Email: cstern@svsef.org Phone: 208-309-3403 Alpine U10 Mini World Cup Head Coach Daniela Anguita NICKNAME: Dani HOMETOWN / WHERE I GREW UP : La Parva, Chile EDUCATION : MEd Bilingual Education — Boise State University BS Geological Science — University of Utah WHAT YEAR DID YOU START COACHING AT SVSEF? 2021 WHY DO YOU COACH? Because it’s fun! And to share my knowledge and experience with younger generations and pass on the love of the sport of skiing. COACHING CERTIFICATIONS: Coaching Level 100 SKIING BACKGROUND : 8 years on the Chilean National Team Competed in the 2006 Torino Olympics Raced for the University of Alaska Anchorage Competed on the Freeskiing World Tour Alta-Snowbird Big Mountain Coach 2008-2012 WHEN I WAS 5 YEARS OLD, I WAS PRETTY SURE I’D BE AN ADULT (still working on it) WHEN I GREW UP. THE MOST IMPORTANT THING I LEARNED BEFORE HIGH SCHOOL WAS, the feeling of freedom when skiing. IF I COULD INVENT A HOLIDAY, IT WOULD DEFINITELY INVOLVE geology and the environment. HOBBIES AND OTHER INTERESTS THAT FUEL MY SOUL: Making jewelry and art Learning new things Running and hiking Yoga, mindfulness, and meditation WHAT’S YOUR ARCHETYPE ? 40% Caregiver 30% Intellectual 30% Creative Snowboard Futures Team Head Coach Edward Sawicz Alpine U16 Assistant Coach & Assistant Alpine Director Gladys Weidt HOMETOWN / WHERE I GREW UP : Duluth, Minnesota EDUCATION : Duluth East High School University of New Mexico, B.S. Kinesiology, Exercise Science AWARDS / ACCOLADES : UNM NCAA Champion UNM All-Academic Team UNM All-American Team MN State High School Alpine Champion WHAT YEAR DID YOU START COACHING AT SVSEF? 2020 WHY DO YOU COACH? I love skiing, and coaching helps me stay connected to the sport along with surrounding myself with others who share my passion. I think it is an honor to be a part of an athlete’s journey and help provide a positive experience in developing their capacity to think outside of the box and discover new experiences that give them the opportunity to achieve their full potential and use skiing as a holistic means of individual development. COACHING CERTIFICATIONS: Alpine Coach Level 300 SKIING BACKGROUND : Team Duluth (until middle school) Steamboat Springs Winter Sports Club (high school + PG year) University of New Mexico Ski Team WHEN I WAS 5 YEARS OLD, I WAS PRETTY SURE I’D BE A SHERPA WHEN I GREW UP. THE MOST IMPORTANT THING I LEARNED BEFORE HIGH SCHOOL WAS work smarter, not harder. IF I COULD INVENT A HOLIDAY, IT WOULD DEFINITELY INVOLVE multiple days. HOBBIES AND OTHER INTERESTS THAT FUEL MY SOUL: Tennis The ocean NHL Playoffs A great bagel I would like to be an expert fly fisherman and bow hunter Email: gladys@svsef.org Phone: 530.414.6654 Director of Strategic Communications & Development Heather Foster NICKNAME : H, Double H, H2 (my maiden name is Hill) HOMETOWN / WHERE I GREW UP : Denver, Colorado EDUCATION : University of Colorado, Boulder—B.S. Journalism and Mass Communication: Advertising and Psychology AWARDS / ACCOLADES : Idaho Business Review Women of the Year (2014, 2018) Women’s & Children’s Alliance TWIN Recipient (Tribute to Women in Industry) (2015) Leadership Boise (2017-2019) WHAT YEAR DID YOU START WORKING AT SVSEF? 2021 WHAT INSPIRES YOU MOST ABOUT WORKING WITH SVSEF? While I never ski raced as a kid, I loved spending time around the races and this led to my first internship at Vail where I had the opportunity to work on the World Cup and other championship events. I moved to Boise, Idaho in 2008 to help lead the 2009 Special Olympics World Winter Games, and ultimately found my way to the Wood River Valley when I met my husband. Jesse and I were married at the base of Rotarun in December 2019, and I am honored to work with one of the most treasured non-profits in the valley. I love bringing my passion for storytelling to the organization and the community, and being part of a team driven by working hard, playing hard, and doing good for others. BEFORE I CAME TO SVSEF , I worked at Sun Valley Community School in Development for two years. Prior to that I was the Communications Officer for the J.A. and Kathryn Albertson Family Foundation and the Executive Director of St. Luke’s FitOne in Boise. I’ve enjoyed just about every minute of my 30-ish years working with with start-ups, Fortune 500 companies, non-profits, and world-class sporting events across the realms of advertising, communications, public relations, sports marketing, strategic partnerships, and large-scale sports event production. WHEN I WAS 5 YEARS OLD, I WAS PRETTY SURE I’D BE SHAMU’S TRAINER AT SEA WORLD WHEN I GREW UP. THE MOST IMPORTANT THING I LEARNED BEFORE HIGH SCHOOL WAS to be respectful and always leave things better than you found them. IF I COULD INVENT A HOLIDAY, IT WOULD DEFINITELY INVOLVE riding epic gravel roads and enjoying farm-to-table food with good friends along the way. HOBBIES AND OTHER INTERESTS THAT FUEL MY SOUL: Cycling of the gravel and road varieties Skiing (alpine and backcountry)—new to Masters Alpine racing Cooking and baking Photography Writing Seeking out the best local coffee shops when traveling or on road trips WHAT’S YOUR ARCHETYPE ? 46% Athlete 45% Creative 9% Visionary Email: heather@svsef.org Phone: 208-726-4129 Snowboard Devo Head Coach JaNessa Gilbert HOMETOWN / WHERE I GREW UP : Born in Seattle. Raised in Ketchum. Idaho. EDUCATION : Wood River High School Graduate University of Oregon 1991-1993 AWARDS / ACCOLADES: 3-time Baldy Banked Slalom Winner Won the Kinder Cup! WHAT YEAR DID YOU START COACHING AT SVSEF? 2010 WHY DO YOU COACH? I want to give back my love of Bald Mountain, the sport, and lifestyle, I got to grow up with and it keeps me young!  For the kid jokes! COACHING CERTIFICATIONS: Level 100 USSA/USASA SKIING/RIDING BACKGROUND : SVSEF Alum 1983-1989 Ski Raced for 6 years Snowboarding for 30 years WHEN I WAS 5 YEARS OLD, I WAS PRETTY SURE I’D BE A BALLERINA WHEN I GREW UP. THE MOST IMPORTANT THING I LEARNED BEFORE HIGH SCHOOL WAS to be the first person to say hi! IF I COULD INVENT A HOLIDAY, IT WOULD DEFINITELY INVOLVE dressing up in a costume. HOBBIES AND OTHER INTERESTS THAT FUEL MY SOUL: Gardening Hiking with my dogs Painting Dinner with friends and family Hawaii Design Email: janessagilbertsv@gmail.com Phone: 208.720.5312 Cross Country Devo South Head Coach Lexie Praggastis NICKNAME : We don’t know each other well enough yet… HOMETOWN / WHERE I GREW UP : Sun Valley, Idaho EDUCATION : Colby College, BA in Biochemistry University of Maryland, Masters in Chemistry and Life Sciences Pinchot University, Masters of Business Administration WHAT YEAR DID YOU START COACHING AT SVSEF? On and off since 2011 WHY DO YOU COACH? For the money and the glory. SKIING BACKGROUND : SVSEF XC Team: (a small hiatus to play middle school basketball where we once scored 4 points in an entire game 🙂 Colby College Ski Team WHEN I WAS 5 YEARS OLD, I WAS PRETTY SURE I HAD NO IDEA WHAT I WOULD DO WHEN I GREW UP (still don’t). THE MOST IMPORTANT THING I LEARNED BEFORE HIGH SCHOOL WAS how to cook and bake. IF I COULD INVENT A HOLIDAY, IT WOULD DEFINITELY INVOLVE amazing food and a sleepover. HOBBIES AND OTHER INTERESTS THAT FUEL MY SOUL: Mountain Biking Playing Soccer with my kids Drawing and Watercolor Baking Spreadsheets Gardening Email: lexie@svsef.org Business Manager & Client Relations Madeline Uhrig NICKNAME : Maddy HOMETOWN / WHERE I GREW UP : Born and raised in Hailey, Idaho (5th generation) EDUCATION : University of Idaho – B.S. in Sociology with a Criminology Emphasis & Minor in Psycholog AWARDS / ACCOLADES : #1 Benchwarmer (and proud of it!) “Most Coachable” two-time Award winner Multiple Participation Awards – too many to count WHAT YEAR DID YOU START WORKING AT SVSEF? 2023 WHAT INSPIRES YOU MOST ABOUT WORKING WITH SVSEF? Working with/for an amazing organization and group of individuals, whose sole purpose is to see these athletes succeed. Whether it’s helping them grow into strong, respectable adults, or guiding them to achieve their athletic dreams.  It’s not all about winning, it’s about bettering yourself on and off the mountain. BEFORE I CAME TO SVSEF, I worked as the Accounts Receivable Specialist at DECKED LLC WHEN I WAS 5 YEARS OLD, I WAS PRETTY SURE I’D BE FAMOUS WHEN I GREW UP. (I still have time 😉) THE MOST IMPORTANT THING I LEARNED BEFORE HIGH SCHOOL WAS ALWAYS say please and thank you – manners matter! IF I COULD INVENT A HOLIDAY, IT WOULD DEFINITELY INVOLVE… Espresso martinis and True Crime. HOBBIES AND OTHER INTERESTS THAT FUEL MY SOUL: Anything involving family & friends. I can’t carry a tune, but I love to try. I LIKE camping but LOVE glamping. Sunny days – especially on the lake. Traveling – taking in the views and experiencing different cultures. WHAT’S YOUR ARCHETYPE ? 30% Hard worker – Personally and professionally. 30% Kindhearted – I don’t see the point in being mean. 30% Sarcasm – It just happens naturally. 10% Caffeine – A daily necessity. Email: maddy@svsef.org Phone: 208-726-4129 Cross Country Devo North Head Coach Martha Pendl HOMETOWN / WHERE I GREW UP : Ketchum, Idaho EDUCATION : Middlebury College / College of Idaho WHAT YEAR DID YOU START COACHING AT SVSEF? 2018 WHY DO YOU COACH? It’s just pure JOY! SKIING BACKGROUND : SVSEF Middlebury College The College of Idaho WHEN I WAS 5 YEARS OLD, I WAS PRETTY SURE I’D BE PRESIDENT WHEN I GREW UP. THE MOST IMPORTANT THING I LEARNED BEFORE HIGH SCHOOL WAS how to bake pastries. IF I COULD INVENT A HOLIDAY, IT WOULD DEFINITELY INVOLVE apple strudel, bonfires, and dancing. HOBBIES AND OTHER INTERESTS THAT FUEL MY SOUL: All things outside! Email: mpendl@svsef.org Freestyle (Moguls) 3-Day Progression Head Coach Matthew McGraw NICKNAME: Quickdraw HOMETOWN / WHERE I GREW UP : Wood River Valley EDUCATION : Pitzer College ’19-B.A. Economics & Political Studies Wood River High School ’15 WHAT YEAR DID YOU START COACHING AT SVSEF? 2021 WHY DO YOU COACH? I coach because I want to help create a passion for the sport in the next generation. Coaching athletes through milestone achievements is among the most rewarding work I have done. SKIING BACKGROUND : SVSEF Athlete Sun Valley Town Series WHEN I WAS 5 YEARS OLD, I WAS PRETTY SURE I’D BE A ARCHITECT WHEN I GREW UP. THE MOST IMPORTANT THING I LEARNED BEFORE HIGH SCHOOL WAS, you don’t know until you go. IF I COULD INVENT A HOLIDAY, IT WOULD DEFINITELY INVOLVE wildlife and nature. HOBBIES AND OTHER INTERESTS THAT FUEL MY SOUL: Dirt bike trail riding Travel Cooking/Grilling Hiking Live Music Email: matthew@svmcgraw.com XC Post Grad Head Coach Max Polito Email: mpolito@svsef.org Director of Finance & Admin Mimi Crocker NICKNAME : MC Rocker HOMETOWN / WHERE I GREW UP : Greenwich, Connecticut EDUCATION : University of Washington, BA Sociology & Business Boise State University AWARDS / ACCOLADES : Way too many to list, seriously. 🙂 WHAT YEAR DID YOU START WORKING AT SVSEF? 2013 WHAT INSPIRES YOU MOST ABOUT WORKING WITH SVSEF? The impact that SVSEF programs have on the kids in our community. This is a great place to work, and I am fortunate to be part of such an amazing group of visionaries and coaches. Winning is cool, but it’s the subtle, yet life changing, impact that we have on our youth that gets me fired up. BEFORE I CAME TO SVSEF, I spent 25 years working in the music industry and as Director of Sales for Disc Makers, Inc. WHEN I WAS 5 YEARS OLD, I WAS PRETTY SURE I’D BE AN OLYMPIC EQUESTRIAN JUMPER OR A VETERINARIAN WHEN I GREW UP. THE MOST IMPORTANT THING I LEARNED BEFORE HIGH SCHOOL WAS the magic of music. IF I COULD INVENT A HOLIDAY, IT WOULD DEFINITELY INVOLVE… Flag Day is my favorite holiday; I don’t need any more. HOBBIES AND OTHER INTERESTS THAT FUEL MY SOUL: Riding and training horses, teaching kids about horses, and being with horses. Playing guitar, live music, and being in a recording studio. Skiing, Moto riding, sailing, gardening, and adventures of all kinds. WHAT’S YOUR ARCHETYPE ? 40% Rebel – Comfortable bucking the system. 33% Caregiver – Sincere and compassionate, finds reward in helping others. 27% Spiritual – Seeks a deeper meaning and has a strong sense of moral obligation. Email: mimi@svsef.org Phone: 208-726-4129 Alpine U16 Team Head Coach Nate Schwing HOMETOWN / WHERE I GREW UP : East Aurora, New York EDUCATION : Lees-McRae Collage—Bachelor Degree in International Studies AWARDS / ACCOLADES : 2017 Intermountain Coach of the Year WHAT YEAR DID YOU START COACHING AT SVSEF? 2007 WHY DO YOU COACH? I coach ski racing because I have always had a passion for ski racing, and I enjoy passing the knowledge and experiences gained along to the next generation of skiers. It is a rewarding experience being a part of these athletes lives and witnessing them mature both physically and mentally through the avenue of ski racing. COACHING CERTIFICATIONS: USSS Level 300 First Aid SKIING BACKGROUND : Grew up ski racing through high school at Kissing Bridge in western New York. Skied USCSA and played Division 2 soccer in college at Lees-McRae College in North Carolina. Moved to Park City post college where I trained with the Park City Masters and Park City Ski Team competing in the Western FIS circuit, NorAm circuit, and competed at 3 U.S. Nationals. Moved to Sun Valley for the 2005-06 ski season where I spent two years coaching for the Hailey Ski Team. I was hired to be the SVSEF Head FIS Coach for the 2007-08 season and I have been coaching at SVSEF ever since! WHEN I WAS 5 YEARS OLD, I WAS PRETTY SURE I’D BE A RUNNING BACK FOR THE BUFFALO BILLS WHEN I GREW UP. THE MOST IMPORTANT THING I LEARNED BEFORE HIGH SCHOOL WAS how to rollerblade. IF I COULD INVENT A HOLIDAY, IT WOULD DEFINITELY INVOLVE something that replaces Columbus Day. HOBBIES AND OTHER INTERESTS THAT FUEL MY SOUL: Golfing Mountain Biking Camping The Buffalo Bills Email: nate@svsef.org Phone: 435-640-1049 Cross Country Gold Team and Summer Training Group Head Coach Peter Holmes HOMETOWN / WHERE I GREW UP : Tahoe City, California EDUCATION : University of New Hampshire, B.S. Sport Studies WHAT YEAR DID YOU START COACHING AT SVSEF? 2021 COACHING CERTIFICATIONS: USSS Cross Country Level 100 SKIING BACKGROUND : University of New Hampshire Ski Team 2014-2018 SVSEF XC Gold Team 2018-2022 WHEN I WAS 5 YEARS OLD, I WAS PRETTY SURE I’D BE A CONSTRUCTION WORKER WHEN I GREW UP. THE MOST IMPORTANT THING I LEARNED BEFORE HIGH SCHOOL WAS that life is not fair. HOBBIES AND OTHER INTERESTS THAT FUEL MY SOUL: Mountain biking Sunset walks on the beach Email: pholmes@svsef.org Phone: 530.721.0684 SVSEF Director of Sport Development Rick Kapala HOMETOWN / WHERE I GREW UP : Sterling Heights, MI EDUCATION : Michigan Technological University, B.S. in Biology AWARDS / ACCOLADES : 3-time USSA Cross Country Coach of the Year USSA Al Merrill Award USSA Russel Wilder Award WHAT YEAR DID YOU START WORKING AT SVSEF? 1987 WHY DO YOU COACH? I really like blending the craft of coaching with the science of human performance and feeling like every day we can help a kid grow.  When I was a kid, I had a coach who made me feel welcome and an important part of the team regardless of my ability and that informs how I coach. COACHING CERTIFICATIONS: USSS Level 300 Cross Country Coach SKIING / RIDING BACKGROUND Michigan Technological University NCAA Varsity Ski Team WHEN I WAS 5 YEARS OLD, I had no idea what I was thinking… but at 12 I was pretty locked in on being a mountain man. THE MOST IMPORTANT THING I LEARNED BEFORE HIGH SCHOOL WAS believe in myself. IF I COULD INVENT A HOLIDAY, IT WOULD DEFINITELY INVOLVE fly-fishing. HOBBIES AND OTHER INTERESTS THAT FUEL MY SOUL: Fly-fishing Wandering around off trail in the mountains WHAT’S YOUR ARCHETYPE ? 39% Creative 33% Intellectual 28% Visionary Phone: 208-720-7981 Email: rick@svsef.org Alpine Baldy Devo Head Coach Sarah Schwing NICKNAME : Sarah Bear; Sar Bear HOMETOWN / WHERE I GREW UP : Ketchum, Idaho EDUCATION : Wood River High School Graduate – Class of 2000 University of Nevada-Reno; BA Anthropology, Minor Spanish St. Catherine University; Associates Degree in Applied Science – Occupational Therapy Assistant AWARDS / ACCOLADES : IMD Champion – 1995 Monroe Cup Overall Winner (with Carl Rixon!) – 1998 WHAT YEAR DID YOU START COACHING AT SVSEF? Started in the winter of 2006 – 2016 with the U16s, transitioned to Mini World Cup for 2016 – 2017 season, took a break to raise some kiddos, and then started back up last season with U10 Home Team. WHY DO YOU COACH? I’m passionate about helping kids learn and g"
    },
    {
      "url": "https://risingsunopp.org/about/people/",
      "text": "Staff, Board, and Council - Rising Sun Center for Opportunity dots plyr-airplay plyr-captions-off plyr-captions-on plyr-download plyr-enter-fullscreen plyr-exit-fullscreen plyr-fast-forward plyr-logo-vimeo plyr-logo-youtube plyr-muted plyr-pause plyr-pip plyr-play plyr-restart plyr-rewind plyr-settings plyr-volume Skip to Content Expand Main Menu Collapse Main Menu Programs Expand Programs Submenu Collapse Programs Submenu Climate Careers ® Green House Calls ® Appliance Upgrades Opportunity Build Policy and Advocacy Our Impact Expand Our Impact Submenu Collapse Our Impact Submenu Stories 2024 Impact Report 30th Anniversary Report 2025-27 Strategic Plan News Expand News Submenu Collapse News Submenu Recent Press 2025 Annual Celebration About Us Expand About Us Submenu Collapse About Us Submenu Who We Are Our People Our Supporters Contact Jobs at Rising Sun Donate Donate Staff, Board, and Council Staff Sneha Ayyagari Director of Policy Sneha Ayyagari Director of Policy 510-665-1501 ext. 317 ayyagari@risingsunopp.org What is it about Rising Sun’s mission and vision that resonates with you? I’m passionate about contributing to policies and programs that advance climate equity and economic justice. I appreciate how Rising Sun creates opportunities in collaboration with youth, women, and individuals in re-entry in my community while also working at the systemic level to create high quality careers that advance climate resilience. What do you love about working at Rising Sun? I appreciate the kindness, expertise, and curiosity of the Rising Sun team, and I look forward to learning and growing alongside my caring colleagues! What expertise, skills, and experience do you bring to the organization? Over the past several years, I’ve worked at many policy organizations including the Greenlining Institute, BEI, NRDC, and RMI where I helped advance housing, racial equity, workforce, and energy equity policies. I earned a MS and BS in Civil and Environmental Engineering from Stanford University, and I am a board member at Green Empowerment. I also bring my own lived experiences and stories and perspectives from the various communities that I’ve had the privilege to live and/or work with to my approach to advocacy. When you’re not at Rising Sun, what can we find you doing? I enjoy spending time with my friends and family of all species, volunteering at local gardens and animal shelters, exploring the Bay Area, and reading. I also love listening to and making music. If you could grant the world a wish, what would it be? I wish that every being felt genuinely connected to themselves and their communities and had all of their basic needs met. What is a quote or an idea that inspires you? “Paying attention is a form of reciprocity with the living world, receiving the gifts with open eyes and open heart.” – Robin Wall Kimmerer Rachel Burns Associate Director of HR and Admin Rachel Burns Associate Director of HR and Admin 510-665-1501 ext. 312 burns@risingsunopp.org What is it about Rising Sun’s mission and vision that resonates with you? I am proud that Rising Sun connects the relationship of environmental and economic challenges to create solutions otherwise not identified as interrelated. What do you love about working at Rising Sun? I love the fact that working at Rising Sun enables me to be an environmentalist full time without compromising my beliefs, and to be proud of the work I am helping accomplish. I also love that I am part of an evolving organization focused on helping our planet, our community, and our futures. What expertise, skills, and experience do you bring to the organization? I started with Rising Sun’s youth program, CYES, for two summers in high school which enables me to understand the importance and positive effects Rising Sun has on its participants. From there, I earned my Environmental Studies degree from San Francisco State University, which provides me with the foundation and drive to combat climate change – something Rising Sun works towards every day. My willingness to adapt, learn, and lead adds an element of flexibility, crucial to reaching organizational goals. When you’re not at Rising Sun, what can we find you doing? While not at Rising Sun, you can find me watching my siblings play baseball and softball, camping and hiking with friends, and cooking and gardening with my boyfriend. If you could grant the world a wish, what would it be? If I could grant the world a wish, I would wish that everyone has easy access to affordable, fresh, and healthy food options and that everyone can learn and understand where their food comes from. What is a quote or an idea that inspires you? I am inspired and grateful for the idea that taking time to better yourself is not selfish, it is a way for you to more selfless towards those that need your support. Sofia Canela Torres Senior Program Manager, Climate Careers Central Valley Sofia Canela Torres Senior Program Manager, Climate Careers Central Valley 510-665-1501 ext. 314 canelatorres@risingsunopp.org What is it about Rising Sun’s mission and vision that resonates with you? I love that Rising Sun provides high-paying job opportunities and professional development for youth to conduct water and energy efficiency services in their own communities. Our youth today are the future leaders of tomorrow and this organization allows them to make a significant impact in their communities and the environment. I look forward to spreading awareness of these services and job opportunities to the Latinx and African-American communities. What do you love about working at Rising Sun? Climate change and environmental issues affect Communities of Color and low-income communities the most. I love that Rising Sun dedicates to provide equitable access to high efficient energy and water measures and youth development opportunities for those disinvested communities. I love to be part of a team that loves what they do and works hard to make an impact in people’s lives and the environment. What expertise, skills, and experience do you bring to the organization? Becoming the first in my family to go to college and being the only Latina in my graduating class to major in Chemistry at Mills College, I bring resilience and passion to motivate and support Stockton youth in building career pathways. During my college years, I was a student advisor for TRIO Talent Search program where we advocated for college access for first-generation and low-income Oakland youth. In summer 2019, I fell in love with Rising Sun’s mission while working as a Summer Program Manager for the Tracy/Manteca site. Since 2019, I gained experience working in job placement, community outreach, professional development and program management. I am so excited to be back! When you’re not at Rising Sun, what can we find you doing? When I am not at Rising Sun, I can be found managing the sale and preparation of delicious beef birria and other mexican recipes with my partner and family. If you could grant the world a wish, what would it be? Dismantle the mass incarceration of Black and Brown bodies AND provide the economical reparations to all Black Americans that they have yet to receive for the immeasurable state-sanctioned racial discrimination they have faced. What is a quote or an idea that inspires you? “Every moment is an organizing opportunity, every person a potential activist, every minute a chance to change the world.” –Dolores Huerta Justina Caras-Hoang Senior Community Engagement Manager, Climate Careers Central Valley Justina Caras-Hoang Senior Community Engagement Manager, Climate Careers Central Valley 510-665-1501 ext. 324 caras@risingsunopp.org What is it about Rising Sun’s mission and vision that resonates with you? I appreciate that Rising Sun’s work is equitable, impacting different age groups and people of backgrounds. Our organization has a model that can be recognized in disadvantaged communities to give meaningful jobs, allowing members of the communities to be economically sustainable and gain useful knowledge. What do you love about working at Rising Sun? I deeply appreciate the sense of community amongst all staff. Here we are a family of diverse backgrounds, working together to positively impact our communities. What expertise, skills, and experience do you bring to the organization? My experience here is a great model of how Rising Sun provides a chance for employees to grow within the organization. I started off as an outreach intern, became a Summer Outreach Manager and now I’m the Outreach Lead for San Joaquin County. Also, I am a Stockton native, and since we have a satellite office in Stockton, I’m able to come up with creative ways to outreach to the community I’m from and in which I live. When you’re not at Rising Sun, what can we find you doing? When I’m not at Rising Sun, I’m being a complete “foodie”. I love cooking, baking, binge watching cooking shows, and eating!!!! If you could grant the world a wish, what would it be? Accessible education to all. What is a quote or an idea that inspires you? “We rise by lifting others.” Ashley Clark Senior Career Services Manager Ashley Clark Senior Career Services Manager 510-665-1501 ext. 343 clark@risingsunopp.org What is it about Rising Sun’s mission and vision that resonates with you? The part about Rising Sun’s vision and mission statement that resonates with me the most is the company’s mission to serve disadvantaged and reentry populations and women. I love how this program promotes career opportunities that lead to self sufficiency for lower-income persons. This program provides hope to the hopeless. What do you love about working at Rising Sun? I love the opportunity to learn new resources and utilize these resources in a way that will remove barriers for our students and help them obtain their goals. In other words, I like being able to help people every day within my own community. What expertise, skills, and experience do you bring to the organization? I have a strong background in barrier removal and career and employment development. I specialize in career services and have a vast knowledge of resources in multiple counties. When you’re not at Rising Sun, what can we find you doing? When I am not at Rising Sun, you can find me at home spending time with my family. If you could grant the world a wish, what would it be? I would wish that everyone gets to experience genuine, unconditional, non-contingent love. What is a quote or an idea that inspires you? Darwinian adaptation theory, also known as survival theory or survival of the fittest: those who can adapt will survive. Steven Cong Senior Program Manager, Climate Careers Bay Area Steven Cong Senior Program Manager, Climate Careers Bay Area 209-890-4341 ext. 311 cong@risingsunopp.org What is it about Rising Sun’s mission and vision that resonates with you? Rising Sun aims to build career pathways for economic equity and climate resilience through providing job opportunities for underserved communities, including low-income youths. As someone who has spent the majority of their professional career in youth development and workforce development, this resonates on many levels. I value providing underserved young people the professional experiences and training that they face barriers to accessing because access is a key part of equity. As a social enterprise that focuses on climate resilience, Rising Sun is also a privilege to work at because of its social justice driven enterprise. What do you love about working at Rising Sun? The people and the culture! I love how collaborative all of the meetings I have been in are. Everyone is very comfortable working from the same databases and platforms. Everyone is very communicative with one another about projects and expectations, and there are multiple touch points for checking in on one another’s progress and needs. I love how much enthusiasm and support there is when someone joins or is promoted, and I feel like Rising Sun represents a very healthy work environment. What expertise, skills, and experience do you bring to the organization? I have experience in coaching, management, and facilitation that can be helpful for my role. I have been trained through best practices from the International Coaching Federation and have attended trainings on appreciative inquiry, which can support me in building relationships and trust with my staff and team. I have experience managing folks directly and being a dotted line manager for team members in the past, and can navigate being both a source of support and accountability for my reports. I am a Senior Certified Trainer with the California School-Age Consortium and have often led meetings for our national program team at my last agency, and am very comfortable with facilitating trainings and meetings. When you’re not at Rising Sun, what can we find you doing? When I’m not at Rising Sun, you can find me up well before the crack of dawn for sunrise photography at Battery Spencer, driving 30 minutes to a trendy new boba cafe, or constantly refreshing my tennisrecord.com profile to see if my dynamic rating as a tennis player went up. What all of that means is I love doing photography, drinking boba, and playing tennis outside of work! If you could grant the world a wish, what would it be? I’m very tempted to say I’d wish for three more wishes, but that’s a tired cop-out. If I had to choose one, it would be to give everyone the ability to see possible futures. I think inaction often comes from not understanding the consequences of slow burn disasters like climate change. Being able to see both what the world would look like down the road if we did nothing and if we did what was necessary might inspire greater urgency. What is a quote or an idea that inspires you? This was my quote in high school, and it hasn’t changed. “Yesterday’s history, tomorrow’s a mystery, but today is a gift. That’s why it’s called the present.” –Kung Fu Panda Mackenzie Croxdale Communications and Events Coordinator Mackenzie Croxdale Communications and Events Coordinator 510-665-1501 ext. 316 croxdale@risingsunopp.org What is it about Rising Sun’s mission and vision that resonates with you? I’m drawn to how Rising Sun can initiate positive change with individuals, the environment, and broader society. I feel fulfilled knowing that our programs and staff play a role in helping people improve their livelihoods while also advocating for green and accessible job opportunities. What do you love about working at Rising Sun? Everyone at Rising Sun has a strong passion for the mission and a sincere interest in participants’ success. It’s palpable, even when I’m in a random, 30-minute meeting, and incredibly energizing. I’m proud to be a part of the Rising Sun community. What expertise, skills, and experience do you bring to the organization? My background is in design, multimedia production, qualitative research, and app/website development for health and education resources. I’m also currently on the Advisory Council for the Lawrence Hall of Science. I’m driven to contribute to projects that can empower people and their stories, and that will improve the accessibility of education, mentorship, and career opportunities. When you’re not at Rising Sun, what can we find you doing? I love to take film photos, make art, visit museums, go running, play volleyball, try new restaurants, and participate in silly, themed gatherings with my loved ones. If you could grant the world a wish, what would it be? For all humans, animals, plants, and other natural beings to live healthily, happily, and in harmony with one another. What is a quote or an idea that inspires you? “ Look at any work of nature: a canyon, a bird. A mountain or a forest trail. Where does the perfection begin and imperfection end? It’s the combination that makes the perfect scene. So it is with you. ” I found this quote in a book years ago and, regretfully, didn’t note the author nor the book. It’s stuck with me since, and I love how it reminds me to reassess my supposed imperfections or weaknesses, treat myself with kindness, and to admire the intricate details and systems in nature. Samara Cummins Director of Institutional Giving Samara Cummins Director of Institutional Giving 510-665-1501 ext. 307 cummins@risingsunopp.org What is it about Rising Sun’s mission and vision that resonates with you? I love that we work at the intersection of social justice and the environment. I think these are the two most pressing issues of our time, and our programs address them in tandem. What do you love about working at Rising Sun? Working with a supportive, collaborative and highly capable team of people who are all personally committed to our mission. What expertise, skills, and experience do you bring to the organization? With 20 years of experience working in nonprofits, I’ve done a bit of everything, but my specialties include writing and communications, strategy, program development, program evaluation, and partnership development, with a side of policy, facilitation, and event planning, Prior to working here I spent 12 years working in the world of food systems for the Center for Urban Education about Sustainable Agriculture, where I developed programs to support local farmers, teach young people to grow their own food, empower the next generation of healthy eaters, and deepen people’s understanding of how food relates to equity, environment, and the economy, I also did a lot of grant writing, which brought me to this work at Rising Sun. When you’re not at Rising Sun, what can we find you doing? Gardening, cooking, hiking, biking, dancing, creating mosaics with stained glass, practicing Spanish as a volunteer with La Colectiva, and honing my newfound skills as a community mediator. If you could grant the world a wish, what would it be? That everyone’s basic needs be met. This is a prerequisite for tackling our next challenges as a civilization — learning to respect one another, to create laws that truly serve the people, and to be good stewards of our planet. What is a quote or an idea that inspires you? “Work is love made visible.” –Kahlil Gibran Kristine Diez Administrative Coordinator Kristine Diez Administrative Coordinator 510-665-1501 ext. 319 diez@risingsunopp.org What is it about Rising Sun’s mission and vision that resonates with you? Rising Sun’s mission to address inequities and to take action to help people and all communities is what resonates with me. Being a program alum, I’ve seen firsthand how impactful our work truly is. What do you love about working at Rising Sun? I love the work culture at Rising Sun. We all come from different backgrounds yet we are able to work collaboratively towards the same goal, and empower each other along the way. What expertise, skills, and experience do you bring to the organization? I have been in and out of the Climate Careers program since 2017. I was an Outreach Associate, Site Program Manager and now sit on the Admin/Ops team. Through my various roles, I’ve learned many valuable skills that can be applied as I work with cross functional teams and departments. When you’re not at Rising Sun, what can we find you doing? I am probably at home binge watching shows/movies! If you could grant the world a wish, what would it be? Equality and world peace. What is a quote or an idea that inspires you? Say yes, then figure it out later. Glendie Domingo Director of Climate Careers Bay Area Glendie Domingo Director of Climate Careers Bay Area 510-665-1501 ext. 309 domingo@risingsunopp.org What is it about Rising Sun’s mission and vision that resonates with you? Rising Sun’s commitment to equity and climate resilience for all communities in the Bay Area and San Joaquin County is what resonates with me. I am committed to working alongside all of our staff to be part of the programs and initiatives that link back to the broader mission and vision of the organization. What do you love about working at Rising Sun? I love the people and staff and how welcoming and gracious they are. I love how we all come from different backgrounds and experiences and we draw from that to make a dynamic team. I believe it only enhances our organization and strengthens it. What expertise, skills, and experience do you bring to the organization? I have previously worked at a college access nonprofit, working with youth gain information and build their pathway to higher education. For the past five years, I have worked at SF State University where I connected youth to community opportunities and civic engagement initiatives. I love connecting all stakeholders to resources and talk about how each can benefit from each other. When you’re not at Rising Sun, what can we find you doing? I am outdoors! I love hiking, picnics, exploring new food. When we are able to again, I would love to travel and see the world. I love getting to know new cultures and meeting new people. If you could grant the world a wish, what would it be? I wish collective healing in the various trauma and/or challenges we’re going through. What is a quote or an idea that inspires you? “Use the power of your word in the direction of truth and love.” –Don Miguel Ruiz (author of book “The Four Agreements”) Gustavo Garcia Workforce Initiatives Manager, Climate Careers Central Valley Gustavo Garcia Workforce Initiatives Manager, Climate Careers Central Valley (510) 665-1501 ext. 347 garcia@risingsunopp.org What is it about Rising Sun’s mission and vision that resonates with you? I admire the way that Rising Sun approaches climate justice and workforce development. Rising Sun’s approach to this is multimodal as it integrates well-paying jobs for youth, professional development opportunities, and a social enterprise model that aims to address barriers across the communities we serve. What do you love about working at Rising Sun? I love the people! From my first day here I was met with a team that is dedicated to serving others, empowering youth, and ensuring a just transition towards the clean economy. What expertise, skills, and experience do you bring to the organization? My work spans a wide range of experiences and skill sets. I have worked in outdoor education and youth leadership as a backpacking instructor for underserved youth teaching English, poetry, and outdoor skills; workforce development across the Greater Sacramento region’s major industry clusters; and did work on regional economic development strategies under the California Jobs First program (formerly CERF). I have a background in research (both qualitative and quantitative), policy, and regional strategy development. When you’re not at Rising Sun, what can we find you doing? When I am not at Rising Sun, you can catch me powerlifting at my local gym, backpacking through the Sierra Nevadas, or touring the best local restaurants around me. If you could grant the world a wish, what would it be? I would wish for there to be no more greed. Unfettered greed and our society’s history of rewarding it has exacerbated many of the problems we face today. If we could all come together under a collective understanding of how we can help each other out as a community, we could tackle many of the issues that we face with much more ease. What is a quote or an idea that inspires you? “We must dare to invent the future.” –Thomas Sankara Sam Gessese Contract Manager Sam Gessese Contract Manager 510-665-1501 ext. 318 gessese@risingsunopp.org What is it about Rising Sun’s mission and vision that resonates with you? The dedication to equity and economic advancement for people who experience barriers to access is super important to me and a major reason why I decided to join the Rising Sun team. What do you love about working at Rising Sun? I love that everyone I work with is committed to the Rising Sun mission and that we are a very diverse group of people with different backgrounds and experiences. What expertise, skills, and experience do you bring to the organization? I think my skills in contracts will help alleviate some of the administrative burden on those working directly with participants so that they can focus their energy on providing the best direct service programs. When you’re not at Rising Sun, what can we find you doing? Traveling the world, listening to some live music, enjoying the great outdoors. If you could grant the world a wish, what would it be? I’d grant the wish for world peace. What is a quote or an idea that inspires you? “I am the master of my fate; I am the captain of my soul.” Shay Hart Workforce Initiatives Manager, Climate Careers Bay Area Shay Hart Workforce Initiatives Manager, Climate Careers Bay Area 510-665-1501 ext. 338 hart@risingsunopp.org What is it about Rising Sun’s mission and vision that resonates with you? What resonates with me most is Rising Sun’s dedication to achieving equity and climate resilience for the communities in the Bay Area and San Joaquin County. I am inspired by my fellow co-workers and am committed to working and learning alongside them to achieve these goals. What do you love about working at Rising Sun? I love how the culture here is truly one that prioritizes a supportive and collaborative working environment. Everyone is so passionate about their work and the mission of the organization which makes every day, even the hard ones, fulfilling. What expertise, skills, and experience do you bring to the organization? For the past five years, I have worked as an experienced Program Manager for environmentally-centered nonprofit organizations whose missions were focused on providing equal access to no-cost, high-quality, and engaging programs for youth. I began my career as an educator and whole-heartledly believe that access to information and resources should always be non-negotiable. I am excited to bring my passions for youth development and using education as a means to fight climate change to Rising Sun! When you’re not at Rising Sun, what can we find you doing? When I am not at Rising Sun you can find me spending time with my partner and pup Franklin, trying new restaurants, bird watching, or catching up on all my favorite shows. If you could grant the world a wish, what would it be? My wish for the world would be to rectify the wrongs that have been done to the environment, indigenous communities, communities of color, and to achieve a genuine level of love, peace, and happiness for all. What is a quote or an idea that inspires you? “When we love, we always strive to become better than we are. When we strive to become better than we are, everything around us becomes better too.” –The Alchemist by Paulo Coehlo Julia Hatton President and Chief Executive Officer Julia Hatton President and Chief Executive Officer 510-665-1501 ext. 305 hatton@risingsunopp.org What is it about Rising Sun’s mission and vision that resonates with you? When I tell people about the work that Rising Sun does – how we provide job training for individuals with barriers to employment; about our mission at the intersection of economic equity and climate resilience; how we specialize in serving women, youth, and individuals in reentry – the response is almost always, “Oh, so you’re doing EXACTLY the work that needs to be done right now.” And I have to agree with them. The most pressing issue of our time, in my opinion, is climate change – but that conversation is meaningless unless your solutions start with climate justice. At Rising Sun, we start with workforce development because we need accessible, high-road, equitable career pathways in an economy that will be dominated by our changed climate, and because workers can help drive a just transition to a clean economy. What do you love about working at Rising Sun? It’s a privilege to come here each day and do something that I love and care about, and to contribute to work that matters. For me personally, it’s crucial that I do something in my professional life to help mitigate the effects of climate change, and I’m equally concerned with economic, gender, and racial equity – and our work focuses on that, as well. There’s also a lot of intentionality built into the work we do and how we do it – that really resonates with me. And it’s FUN to work here! Rising Sun gives me a chance to learn and grow every day, and working here has changed what I pay attention to and what I see in the world. What expertise, skills, and experience do you bring to the organization? Over the past fifteen years, I’ve worked across the public, private, and nonprofit sectors, focusing on workforce and economic development, energy, and environmental justice. Through the Coro Fellows Program in Public Affairs program, I worked in a union, in state electoral politics, at a green home developer, and in county government. I’ve held positions in healthcare IT consulting and project management, regional economic development, and at a gas and electric utility. Right before Rising Sun, I developed the nation’s first utility-funded healthy homes and weatherization program for low-income families in Connecticut. I love strategy, new program development and improvement, policy, development, and cross-sector collaboration. When you’re not at Rising Sun, what can we find you doing? When I’m not at Rising Sun, I’m playing with my family – my husband, my daughter, and our pug. I love cooking and eating, reading, watching good TV, being outside, and traveling. If you could grant the world a wish, what would it be? I’d wish for everyone to have the opportunity to be the best version of themselves. What is a quote or an idea that inspires you? “My authenticity is my rebellion.” –Viola Davis Maria Huerta Senior Community Engagement Manager, Climate Careers Bay Area Maria Huerta Senior Community Engagement Manager, Climate Careers Bay Area (510) 665-1501 ext. 332 huerta@risingsunopp.org What is it about Rising Sun’s mission and vision that resonates with you? Rising Sun’s mission and vision resonate deeply with me because they integrate climate action with a commitment to equity and opportunity. I also admire how the organization has continuously evolved, innovating to meet the shifting needs of our participants and communities. What do you love about working at Rising Sun? What I love about working at Rising Sun is being able to center equity in our outreach, reaching residents and communities who are too often left out of mainstream energy efficiency programs. I’m passionate about making sure that underserved households and hard to reach communities have access to the resources. Through this work, I help communities save water and energy, which not only protects the environment, but also helps reduce utility costs and improve quality of life. What expertise, skills, and experience do you bring to the organization? I’ve spent 15+ years working in the nonprofit sector, focusing on food access, workforce development, and community outreach. I’m passionate about building bridges between programs and the people they serve and I’m looking forward to bringing that same energy and heart to this organization. When you’re not at Rising Sun, what can we find you doing? When I’m not at Rising Sun, you can find me hiking, although I’ll probably be complaining most of the way! I prefer trails that offer a beautiful view, like the beach or a waterfall at the end. I also love baking and decorating intricate sugar cookies, tending to my veggie garden, and cooking up family Mexican recipes. If you could grant the world a wish, what would it be? If I could grant the world a wish, it would be for everyone to have access to basic human rights, including clean air, water, housing, healthcare, education, and opportunity. I believe that when everyone’s fundamental needs are met, we can truly build a more just and equitable world. What is a quote or an idea that inspires you? “Feet, what do I need you for when I have wings to fly?” –Frida Kahlo Cindy Ibarra Morales Outreach Manager, Climate Careers Bay Area Cindy Ibarra Morales Outreach Manager, Climate Careers Bay Area 510-665-1501 ext. 310 ibarramorales@risingsunopp.org What is it about Rising Sun’s mission and vision that resonates with you? Rising Sun’s mission and vision of bringing climate resilience and economic equity to communities most impacted by climate change and systematic oppression resonates with my values and vision for Oakland and the entire Bay Area. What do you love about working at Rising Sun? I love working at Rising Sun because I love working with people who are passionate and extremely supportive. It is enriching to work alongside people who share the same visions for our communities and are constantly working towards a more equitable and climate-resilient Bay Area. What expertise, skills, and experience do you bring to the organization? I have many years of experience doing outreach in hard-to-reach communities in Alameda County. Having a presence in the community allows me to share the knowledge I acquired from my climate change and sustainability degree with community members who haven’t been included in those conversations before. In addition, as a bilingual person, I am proud to be a resource for both English and Spanish speakers. When you’re not at Rising Sun, what can we find you doing? When I’m not at work, I enjoy hiking the beautiful trails in the Bay Area, eating amazing local food,  exploring new hobbies, and spending time with my family. If you could grant the world a wish, what would it be? If I could grant the world a wish, I would make borders disappear so everyone can travel freely. What is a quote or an idea that inspires you? “We must use our lives to make the world a better place to live, not just to acquire things. That is what we are put on the earth for.” –Dolores Huerta Nick Janikian Data and Operations Associate, Climate Careers Bay Area Nick Janikian Data and Operations Associate, Climate Careers Bay Area 510-665-1501 ext. 313 janikian@risingsunopp.org What is it about Rising Sun’s mission and vision that resonates with you? I am a big believer in the idea that great jobs with strong pay and pathways to career growth make for a better quality of life, and that these types of jobs should be available to everyone. Rising Sun’s focus on workforce development in the green economy is so important and gives folks opportunities to address the pressing issues of climate change that impact all of us. What do you love about working at Rising Sun? Rising Sun’s staff make it an amazing place to work. My colleagues are fiercely dedicated to their work, compassionate, funny, and inspiring! It’s a true environment of growth and support, and is reflected so well in experiences of our Climate Careers and Opportunity Build participants. What expertise, skills, and experience do you bring to the organization? I previously worked for many years as a program manager at a Bay Area art college, collaborating closely with educators, students, administrators, and artists, on all kinds of creative programs and projects. I’ve also worked in production, sales, and retail in the natural wine industry, doing everything from leading wine tastings to sorting grapes by hand before pressing them into oak barrels. I enjoy both the customer service facing and administrative systems aspects of my work, especially when those two halves meet and I can best support successful program operations. When you’re not at Rising Sun, what can we find you doing? You can probably find me hiking on trails in the Bay Area or in the Sierra, cooking with friends and family, or taking a beach walk with my dog. I also love a good game of Yahtzee! If you could grant the world a wish, what would it be? I would wish to live in a world where everyone has access to good paying jobs that they like (or love), and still have free time to spend with family and friends or explore other passions and interests outside of work. What is a quote or an idea that inspires you? “Anyone fighting for freedom does not want to totally lose their freedom.” –Ai Weiwei Marlin Jeffreys Director of Opportunity Build Marlin Jeffreys Director of Opportunity Build 510-665-1501 ext. 342 jeffreys@risingsunopp.org What is it about Rising Sun’s mission and vision that resonates with you? I like the idea of our work being a vehicle that empowers others to achieve stability for themselves and their community. What do you love about working at Rising Sun? The work I do at Rising Sun allows me to effect change and be an activist. What expertise, skills, and experience do you bring to the organization? I believe that my understanding of those we serve is valuable, as well as my ability to communicate our mission and vision in the community. When you’re not at Rising Sun, what can we find you doing? I’m into healthy living so I’m usually lifting weights or outside working in my garden. If you could grant the world a wish, what would it be? End racism, classism, and all of the negative attitudes that some people display towards those that are different. What is a quote or an idea that inspires you? Never give up and stay strong! Max Katz-Balmes Senior Data and Operations Manager Max Katz-Balmes Senior Data and Operations Manager 510-665-1501 ext. 321 katzbalmes@risingsunopp.org What is it about Rising Sun’s mission and vision that resonates with you? My education and passion center around environmental justice, so I value Rising Sun’s focus on workforce development, first, and on climate change, second. I love that we create climate resilience by preparing young people and people with barriers to employment to be successful in both the economy of the present and the clean economy of the future. What do you love about working at Rising Sun? I love that my first job out of college is with an organization working on the most pressing and important issues of our time (and doing so with such an intentional and value-oriented approach). I also appreciate how welcoming, smart, passionate, and caring all of my coworkers are. What expertise, skills, and experience do you bring to the organization? Before Rising Sun, I worked for a solar co-op in North Philadelphia similarly focused on promoting a just transition and workforce development in the clean economy. I have also led a large project to transform my college’s town center into a more environmentally-friendly and economically-viable space. Beyond my environmental expertise, I bring plenty of customer service, outreach, and education experience as a former summer camp director. When you’re not at Rising Sun, what can we find you doing? Outside of work, you can find me playing basketball and golf, hiking, cooking, or cuddling with my dog. I also love trivia and board games! If you could grant the world a wish, what would it be? I would love to see a world with the political will to inspire meaningful and just climate action in the next 10 years. What is a quote or an idea that inspires you? In high school, I joined JYCA, a youth group with a philosophy centered around the Hebrew principle of “tikkun olam” or repairing the world. My experience with JYCA and tikkun olam inspired me to pursue a career at the intersections of environmental work and social justice, and I even have the phrase tattooed on my left arm. Abigail Kubota Policy Associate Abigail Kubota Policy Associate (510) 665-1501 ext. 337 kubota@risingsunopp.org What is it about Rising Sun’s mission and vision that resonates with you? I love how Rising Sun’s mission is directly addressing the intersectionality of climate, equity, and workforce through building green, equitable career pathways for underserved communities. Low-income and underrepresented communities often bear the brunt of climate change, and supporting them in this time of uncertainty will not only propel us to meet climate goals, but change their lives for the better as well. We need a just transition to a climate resilient future—and Rising Sun is providing an avenue for that. What do you love about working at Rising Sun? I appreciate the willingness and eagerness of my coworkers to champion the mission of Rising Sun. Seeing all of these passionate and knowledgeable change agents who I get to work with daily is inspiring. I am grateful I get to come to work every day excited to work and knowing I am helping make a difference—I feel very fortunate to be here! What expertise, skills, and experience do you bring to the organization? I have a strong educational background in social sustainability; urban and environmental policy and planning; and community development with my 5+ years of higher education. I possess skills in project management, stakeholder engagement, qualitative and quantitative data analysis, professional report writing, and technological tools like ArcGIS and Stata. I bring my curiosity, drive, and passion for social sustainability work to Rising Sun, and I hope my experience can make a difference for the people and communities in the Bay Area! When you’re not at Rising Sun, what can we find you doing? Anything food related or outdoors! I love to cook, peruse farmers markets, find new restaurants and bars, hike, sightsee—you name it! I also love to garden with my father back in Concord. He has about 10 fruit trees plus four raised garden beds, so I always get the freshest produce. If you could grant the world a wish, what would it be? This can be a very philosophical question but I want to have fun with it! If I could grant the world a wish I would want everyone to be able to take their dream vacation for however long they want, and completely free of charge! What is a quote or an idea that inspires you? “It seems that the more places I see and experience, the bigger I realize the world to be. The more I become aware of, the more I realize how relatively little I know of it, how many places I have still to go, how much more there is to learn.” –Anthony Bourdain It reminds me to keep asking questions, be curious, and be open to learning new things from new people! We can learn so much from each other, and we’ve only scratched the surface. Darren Kumar Director of Climate Careers Central Valley Darren Kumar Director of Climate Careers Central Valley 510-665-1501 ext. 323 kumar@risingsunopp.org What is it about Rising Sun’s mission and vision that resonates with you? I value that Rising Sun helps build opportunities for people living in challenging communities. I also admire how actively Rising Sun works to adhere to its mission and vision. What do you love about working at Rising Sun? I can truly say coming to work feels like I’m working with my family. The culture of a safe space and friendly people makes my work very exciting every day. What expertise, skills, and experience do you bring to the organization? I have a Bachelor’s Degree in Criminal Justice Administration and am currently continuing my education to obtain a Master’s Degree in Public Administration at California State University Stanislaus. I came to Rising Sun with over 10 years of experience working in the non-profit sector, catered to youth intervention programs. When you’re not at Rising Sun, what can we find you doing? I enjoy spending my free time traveling, with family, and cheering on my favorite sports teams. Go Chargers and Warriors! If you could grant the world a wish, what would it be? I wish the world could provide endless employment opportunities to everyone and anyone that wants to work! What is a quote or an idea that inspires you? When you think positive good things happen. Ian Laettner Chief Financial and Operating Officer Ian Laettner Chief Financial and Operating Officer 510-665-1501 ext. 315 laettner@risingsunopp.org What is it about Rising Sun’s mission and vision that resonates with you? I love that we do direct services work that benefits our communities in both socioeconomic and environmental ways. One of the best things about our work is seeing the success stories of the people who work so hard and use Rising Sun’s support to push them over the top. What do you love about working at Rising Sun? Everyone is treated with equal respect in our organization because everyone knows that the mission cannot be accomplished without each person’s piece of the puzzle. It feels so good to hear how Rising Sun’s work has changed a participant’s life and that I had a part in that. What expertise, skills, and experience do you bring to the organization? I bring several years of experience working with our program operations as well as our organization-wide operations including our finances, HR, building management, and administration. I carry the Financial Success for Nonprofits certificate from Cornell University, the SHRM-CP certificate for HR professionals, and completed a Masters Degree in International Relations in 2015. When you’re not at Rising Sun, what can we find you doing? Playing with my son and dog! If you could grant the world a wish, what would it be? I wish humans did not see “the other” and treated all others with respect and dignity. What is a quote or an idea that inspires you? Anything is possible! Michelle Li HR and Operations Associate Michelle Li HR and Operations Associate 510-665-1501 ex 308 li@risingsunopp.org What is it about Rising Sun’s mission and vision that resonates with you? I love how Rising Sun offers opportunities in residential sustainability and career advancement for individuals from low income and/or disadvantaged communities to spread awareness of climate resilience in the greater Bay Area. What do you love about working at Rising Sun? I appreciate how all staff truly care for one another in working together to accomplish the same goal for our community and planet. Everyone is super friendly, self-driven, and I love having my colleagues’ fur babies around the office. What expertise, skills, and experience do you bring to the organization? I began working for my university’s not-for-profit organization to provide opportunities in strengthening students’ interpersonal relationships. I obtained my degree in Business Marketing and shortly started as a Program Assistant for our Climate Careers program. Therefore, I was able to contribute my knowledge in broadcasting Rising Sun’s brand awareness to the Asian American community. When you’re not at Rising Sun, what can we find you doing? You can find me at a boba shop, eating with my friends/family, cooking and baking new recipes, and attending concerts. If you could grant the world a wish, what would it be? To find a cure for cancer. What is a quote or an idea that inspires you? “The flower that blooms in adversity is the most rare and beautiful of all.” –Mulan Gerald Liddle Regional Manager, Climate Careers Bay Area Gerald Liddle Regional Manager, Climate Careers Bay Area 510-665-1501 ext. 325 liddle@risingsunopp.org What is it about Rising Sun’s mission and vision that resonates with you? Rising Sun’s mission for economic equity resonates with me the most as a reminder that most of us are in the fight to not only help ourselves during the climate crisis, but also look out for one another. What do you love about working at Rising Sun? I love working with Rising Sun because of the variety of different faces that come with their own stories to tell and different life experiences. At the same time, Rising Sun helped cultivate my personal and professional skills. What expertise, skills, and experience do you bring to the organization? Coming from a military charter school out of Oakland inspired many of my career experiences in leadership, management, and mentorship. After the pandemic, I became a PE coach for grades 1-8. I believe this is one experience that showed me how to become a role model and mentor for youth. At the same time, joining Climate Careers (then CYES) taught me how to articulate for myself, my peers, and community when faced with universal challenges. When you’re not at Rising Sun, what can we find you doing? When I’m not a Rising Sun, you can find me spending time with my family, riding motorcycles, and drinking good coffee. I also aspire to travel the world! If you could grant the world a wish, what would it be? My one wish for the world would be financial freedom for everyone. What is a quote or an idea that inspires you? I never live day to day on singular quote, but two these two always get me out of bed every morning “A day without laughter is a day wasted.” –Charlie Chaplin “The only thing necessary for evil to triumph in the world is that good men do nothing.” –Edmund Burke Elinor Nichols Development and Communications Associate Elinor Nichols Development and Communications Associate 510-665-1501 nichols@risingsunopp.org What is it about Rising Sun’s mission and vision that resonates with you? I’ve always found the possibility of linking climate solutions with equity impacts to be one of the most hopeful and inspiring parts of the green transition that needs to happen over the next decade. Rising Sun’s work at the intersection of economic justice and sustainability gives me the chance to be a part of that work and see firsthand how to excel at on-the-ground implementation of climate-oriented workforce development. What do you love about working at Rising Sun? The truly genuine, supportive, and passionate work environment! Everyone on staff is so kind and so driven. It’s great to be working with people who care so much and it really reflects in the programs Rising Sun offers and the deep, life-changing experiences participants share. What expertise, skills, and experience do you bring to the organization? Having worked a variety of jobs before joining Rising Sun, I feel I offer a great balance of marketing and communications expertise with deep sustainability knowledge. As a Climate Corps Fellow working on zero-waste programs at the City of San Rafael, I learned a lot about the opportunities and challenges facing Bay Area jurisdictions in their steps towards a green economic transition. Working with the development and communications team, I hope to use that knowledge coupled with experience gained from previous design, marketing, and community engagement jobs to help Rising Sun get the attention and funding it needs to become a prominent resource and force in California’s development of equity-centered climate justice work. When you’re not at Rising Sun, what can we find you doing? Outside of work, you can find me at kickboxing training, visiting an art museum, grabbing boba and ice cream on Clement Street, or curled up on my couch with a book. I also love talking to people about films and sustainable urban design while taking a stroll through the park! If you could grant the world a wish, what would it be? That climate justice be centered in all sustainable initiatives being launched over the next decade! And that we can actually keep warming below 1.5°C. What is a quote or an idea that inspires you? Reading Pope Francis’s encyclical Laudato Si: On the Care of Our Common Home while at university had a huge impact on me, especially given what for me at the time was the eye-opening way he wrote about the fundamental shift that needs to happen in how we value people and the planet on an economic and systematic level. Our governing structures centering dignity, love, and the flourishing of human beings within a healthy natural environment is what I want to dedicate my life to working towards. Jenn Oakley Lead Case Manager, Opportunity Build Jenn Oakley Lead Case Manager, Opportunity Build 510-665-1501 ext.339 oakley@risingsunopp.org Kelsey Petrone Chief Development and Communications Officer Kelsey Petrone Chief Development and Communications Officer 510-665-1501 ext. 303 petrone@risingsunopp.org What is it about Rising Sun’s mission and vision that resonates with you? We all have a duty to help each other. Some people need support in finding an equitable job and everyone needs a safe and sustainable place to live. It is wonderful to be a part of an organization that works to support both. What do you love about working at Rising Sun? It was abundantly clear from the first day that everyone cares. They care about the mission, about the organization, about the participants, about each other. What expertise, skills, and experience do you bring to the organization? I am grateful to have spent nearly a decade in New York City working in Development at a large homeless services organization, specifically I focused on securing private and public funding for their workforce development department. I’ve been able to spend time with program participants to understand their needs and the impact that others’ support can have on their lives. When you’re not at Rising Sun, what can we find you doing? Dragging friends on unexpected excursions! I love exploring places and having new experiences, whether that be trying a restaurant in my neighborhood, taking a weekend trip to go camping, or immersing myself in a totally different culture across the globe. If you could grant the world a wish, what would it be? For everyone to feel that they bring value to the world. What is a quote or an idea that inspires you? “Changing the big picture takes time…and the best things to do is focus on the things that we can make in our lives if we’re doing all that. That becomes the collage of real change.” –Michelle Obama Andrea Picones Castro Grants Manager Andrea Picones Castro Grants Manager 510-665-1501 ext. 348 piconescastro@risingsunopp.org What is it about Rising Sun’s mission and vision that resonates with you? I appreciate Rising Sun’s commitment to its work at the intersection of multiple landscapes: workforce development, environmental justice, and equity. Rising Sun truly finds the nuance in these intersections and works toward creating positive change within it. What do you love about working at Rising Sun? I love the sense of community, the transparency, and the commitment to the mission. What expertise, skills, and experience do you bring to the organization? I bring a decade of experience in the nonprofit space. The bulk of my experience is in nonprofit development (including grant management, program development, and strategy) and the environmental justice movement (with a particular emphasis in policy advocacy and research). I have also combined my background in social work and public health to better understand the structural and systemic dynamics that impact communities of color. I am so excited to have found Rising Sun, a place where I can fully integrate my nonprofit development skills with my passion for environmental justice. When you’re not at Rising Sun, what can we find you doing? I love spending my spare time outdoors with my kids, partner, and chocolate lab. We love exploring all that the Bay has to offer. Whenever I get the chance, you can also find me off on a run or curled up with a good book and getting in some solo time. If you could grant the world a wish, what would it be? The capacity for more empathy. What is a quote or an idea that inspires you? Dale tiempo al tiempo. Cynthia Pinto Cabrera Regional Manager, Climate Careers Central Valley Cynthia Pinto Cabrera Regional Manager, Climate Careers Central Valley (510) 665-1501 ext. 328 pintocabrera@risingsunopp.org What is it about Rising Sun’s mission and vision that resonates with you? Being an asthmatic and first generation college student I have firsthand experience with inequalities and struggles of social, economic, and environmental injustices. Rising Sun seeks to eliminate those barriers and provide opportunities for everyone to have access to good jobs while also caring for our environment and future and that is something that I personally resonate with and love that I get to be a part of. What do you love about working at Rising Sun? The staff! The collaborative atmosphere and culture of uplifting each other’s strengths to make the organization even stronger as well as the encouragement to be innovative. What expertise, skills, and experience do you bring to the organization? With a background in Environmental Policy and advocacy I want to bring these perspectives into Rising Sun and find innovative ways to encourage youth in the Central Valley to invest in our communities and create a better future for themselves and future generations. When you’re not at Rising Sun, what can we find you doing? At a pool! I spend a lot of my time teaching kids how to swim, how to be safe around water, and supporting equitable access to swim lesions and competitive opportunities. If you could grant the world a wish, what would it be? Ending hunger! What is a quote or an idea that inspires you? “Be the change we want to see.” Diana Ramirez Regional Manager, Climate Careers Bay Area Diana Ramirez Regional Manager, Climate Careers Bay Area 510-665-1501 ext. 329 ramirez@risingsunopp.org What is it about Rising Sun’s mission and vision that resonates with you? Rising Sun’s commitment to serving underrepresented communities really resonates with me. Coming from a minority background myself, I know first hand how organizations like Rising Sun can make a world of difference in a person’s life. What do you love about working at Rising Sun? What I love about working at Rising Sun is the support and resources that they provide for staff and participants that make it incredibly easy to keep learning and developing not only as individuals, but also as a community. What expertise, skills, and experience do you bring to the organization? I have been involved in nonprofit work since 2015, when I worked with the RYSE Youth Center to secure funding for preventative services for youth in Richmond. This work was able to continue through my participation in the Climate Careers program at Rising Sun where I had the chance to work my way up from an Energy Specialist Driver to Regional Manager. Before that, I was doing case management to help families receive subsidized child care to improve their quality of life. All this work has been informed by my lived experiences as a first generation immigrant and my degree in political science and minor in Chicano Studies. When you’re not at Rising Sun, what can we find you doing? In my free time I enjoy trying new things. This can be anything from traveling to a new country to trying new food or getting a new hobby. I like going on adventures no matter what shape they take! If you could grant the world a wish, what would it be? My wish for the world would be for everyone to have all their basic needs met and get the resources they need to thrive in life. What is a quote or an idea that inspires you? “You should enjoy the little detours to the fullest. Because that’s where you’ll find the things more important than what you want.” –Ging Freecss Valeria Salamanca Outreach Manager, Climate Careers Central Valley Valeria Salamanca Outreach Manager, Climate Careers Central Valley 510-665-1501 ext. 327 salamanca@risingsunopp.org What is it about Rising Sun’s mission and vision that resonates with you? I was originally drawn to the sustainability and climate resilience aspect of Rising Sun. After learning how deeply social justice is integrated into environmental issues, I am proud that the work I do addresses both. What do you love about working at Rising Sun? I love the environment (work and planet)! I appreciate that I get to collaborate on several projects, but that I am also given autonomy to approach my work in my own way. Everyone is really genuine and striving to grow individually and as a team. What expertise, skills, and experience do you bring to the organization? My background is in marketing and community outreach with a bit of sales. I enjoy identifying new opportunities to join forces with folks striving for similar goals and brainstorming solutions together. I’ve always been attracted to “boots on the ground” work that allow me to collaborate directly with the community. As a daughter of immigrants, one of my areas of expertise is breaking the language/cultural barrier with Spanish-speaking communities by offering translation and building relationships. When you’re not at Rising Sun, what can we find you doing? In my free time, I like to dance—whether in a class, in my kitchen, or out doing my grocery shopping. You can also find me hanging out with my senior kitty, Nova, searching online for plant-based baking recipes, or perusing the aisles at Target (I have a problem). If you could grant the world a wish, what would it be? My wish for the world would be to allow us to see the core similarities with each other and with our home, Earth. What is a quote or an idea that inspires you? I like to think of my life as a story I will tell someone in 50+ years. This allows me to reflect on what would bring me the most joy or what impact I will be proud to share. It guides me to be the best version of me. Omara Sin Communication and Outreach Associate, Opportunity Build Omara Sin Communication and Outreach Associate, Opportunity Build 510-665-1501 ext. 340 sin@risingsunopp.org What is it about Rising Sun’s mission and vision that resonates with you? What is exciting is that I am part of an organization that continues to make our community a priority in helping to build resilience through workforce education and training to propel individuals’ more sustainable career paths. What do you love about working at Rising Sun? Working with like-minded colleagues who are all kind, driven, and passionate about bridging economic equity and climate resilience through our work. What expertise, skills, and experience do you bring to the organization? I’ve promoted services through education for community awareness and can apply my abilities in organizing, advocating, and research as a detailed-oriented person. When you’re not at Rising Sun, what can we find you doing? You can find me dedicating my time with friends, family, and dog. I enjoy the outdoors in all its forms or participating in more leisure activities like thrifting or playing board games. If you could grant the world a wish, what would it be? For people to allow more patience, kindness, and understanding into their world and themselves. What is a quote or an idea that inspires you? “Do the best you can until you know better. Then when you know better, do better.” –Maya Angelou Alex Sisk Senior Communications Manager Alex Sisk Senior Communications Manager 510-665-1501 ext. 322 sisk@risingsunopp.org What is it about Rising Sun’s mission and vision that resonates with you? I appreciate the cross-sector nature of our work, that we connect leaders from varying backgrounds and organizations to confront the Gordian knot of issues encountered in pursuit of environmental and economic justice. What do you love about working at Rising Sun? I love that Rising Sun is never stagnant. So often, I feel that we are hovering on the cusp of something momentous and wonderful—the feeling of genuine opportunity. What expertise, skills, and experience do you bring to the organization? I grew up in the Bay Area and began volunteering with environmental stewardship organizations at a young age. During college, I worked with peers to consult for early-stage green start-ups in Boston. Later I joined the federal government in San Francisco, facilitating a fellowship program and assisting environmental sustainability projects. Having previously contributed to Rising Sun as a Summer Program Manager, I was ecstatic to join the team full time in 2019. When you’re not at Rising Sun, what can we find you doing? Outside Rising Sun, I can generally be found hiking, baking, reading, running, or visiting art museums. If you could grant the world a wish, what would it be? The capability and willingness to truly consider other perspectives, however far removed from our own. What is a quote or an idea that inspires you? “Drawing on my fine command of the English language, I said nothing.” –Robert Benchley Sean Tiner Regional Manager, Climate Careers Central Valley Sean Tiner Regional Manager, Climate Careers Central Valley 510-665-1501 ext. 330 tiner@risingsunopp.org What is it about Rising Sun’s mission and vision that resonates with you? What resonates with me most about Rising Sun’s mission and vision is its commitment to empowering youth and creating pathways for a sustainable future. As someone who is passionate about the outdoors and dedicated to mentoring young people, I deeply connect with the idea of helping youth grow through hands-on work that also contributes to environmental change. What do you love about working at Rising Sun? What I love about working at Rising Sun is being part of a mission-driven team that’s genuinely focused on making a difference. I get to work alongside passionate people while helping youth grow, gain confidence, and build real world skills. What expertise, skills, and experience do you bring to the organization? I bring a diverse background with seven years of farming experience, strong sales skills, and leadership from coaching wrestling. My degree in Outdoor Leadership helps me guide, manage, and adapt in outdoor settings, allowing me to contribute effectively to the organization. With a blend of practical knowledge and leadership abilities, I’m confident in my capacity to solve problems creatively, collaborate with diverse teams, and drive positive outcomes. When you’re not at Rising Sun, what can we find you doing? When I’m not at Rising Sun, you can usually find me outside—whether I’m fishing, rock climbing, or just exploring nature. I also train in jiu jitsu, which helps me stay active and push myself physically. I really enjoy spending time in the outdoors and living an active lifestyle If you could grant the world a wish, what would it be? If I could grant the world one wish, it would be for everyone to experience God’s presence through His creation. I believe that spending time in nature is one of the easiest ways to feel His peace and power. If more people could see the beauty of the world through His eyes, I think we’d take better care of the Earth and treat each other with more love and respect. What is a quote or an idea that inspires you? Proverbs 3:5–6 (NIV) “Trust in the Lord with all your heart and lean not on your own understanding; in all your ways submit to him, and he will make your paths straight.” Diana Vargas Data and Operations Associate, Climate Careers Central Valley Diana Vargas Data and Operations Associate, Climate Careers Central Valley (510) 665-1501 ext. 331 vargas@risingsunopp.org What is it about Rising Sun’s mission and vision that resonates with you? Rising Sun’s mission and vision of advancing climate resilience and economic equity deeply resonate with me. I grew up in a community of color and saw firsthand the inequitable access to employment and higher education opportunities. Rising Sun addresses these disparities by providing paid, hands-on employment opportunities for youth and creating career pathways for people of color—all while maintaining a commitment to a just and sustainable future for everyone. What do you love about working at Rising Sun? I love working at Rising Sun because of the mission we are working towards. I am passionate about empowering communities of color and helping to create equitable access to economic opportunities. The work Rising Sun is doing in our communities is both inspiring and impactful, centered on workforce development, equity, and climate justice. Rising Sun is diverse and the team truly cares about the work we are doing and the people we serve. What expertise, skills, and experience do you bring to the organization? My passion for working with mission-driven organizations began with my first experience at a nonprofit focused on educational equity. Since then, I’ve continued to build my skills in data and operations within the nonprofit sector. My academic background in Ethnic Studies and Business Administration, with a concentration in Information Systems, has equipped me with both the technical and cultural competencies to support communities of color. When you’re not at Rising Sun, what can we find you doing? When I’m not at Rising Sun, you can usually find me at my local library enjoying a boba or coffee. On sunny days, I love going on short hikes to recharge or visiting museums. If you could grant the world a wish, what would it be? If I could grant the world a wish, I would grant universal healthcare and access to basic necessities like food and clean water for all. No one should have to go hungry or worry about how they’ll afford the care they need to live a healthy life. What is a quote or an idea that inspires you? I’m inspired by the idea of enjoying todo lo bonito que nos da la vida—all the beautiful things life gives us. Gregory Wesley Construction Instructor, Opportunity Build Gregory Wesley Construction Instructor, Opportunity Build wesley@risingsunopp.org What is it about Rising Sun’s mission and vision that resonates with you? Seeing that we are one people on our only begotten planet we must continue to find ways to allow it to continue to sustain us as we sustain each other. Having strong economic pathways that lead to attainable and sustainable life-stabilizing incomes will surely lead to more of us feeling free enough to care about the sustainability of the planet. What do you love about working at Rising Sun? It’s all about the people both staff and students and I love it when a team becomes family and we are quickly becoming just that. What expertise, skills, and experience do you bring to the organization? Over 4.5 decades of carpentry, woodworking, drafting, and design skills plus being a pretty good person in possession of a quick wit. When you’re not at Rising Sun, what can we find you doing? That depends on when and where you find me, if I am at home I might be engaged in my ethnographic studies or at my electronic drawing board working out some construction details or learning more about the built environment. On three weekends a month, I’m either with my grandkids, friends, or family in that order but that 4th or 5th weekend… If you could grant the world a wish, what would it be? To experience its highest and best wishes here now always. What is a quote or an idea that inspires you? Good design doesn’t cost, it pays. Building pathways Rising Sun is committed to developing and maintaining internal advancement opportunities. Ten (and counting!) staff members are program alumni. Two Board members are program alumni—and one is former staff. Rising Sun is committed to developing and maintaining internal advancement opportunities. Ten (and counting!) staff members are program alumni. Two Board members are program alumni—and one is former staff. Board Jenny Berg (Retired) Director, Energy Programs Jenny Berg (Retired) Director, Energy Programs Jenny Berg graduated with honors from the University of California, Santa Barbara. She received her JD from the Catholic University in Washington, DC. and an Executive MBA Certificate in Sustainable Management from Presidio Graduate School. After a successful legal career focusing on toxic tort litigation, she followed her passion and concern for the environment. Jenny retired from the Association of Bay Area Governments/Metropolitan Transportation Commission, where she was the Energy Section Director. She worked to ensure that energy efficiency and electrification are part of the regional affordable housing and planning activities. Jenny strongly believes that regional strategy and implementation is key to addressing critical issues such as climate change, transportation, and air quality. Jenny was the Program Administrator of the San Francisco Bay Area Regional Energy Network (BayREN) since its inception in January 2013, and was instrumental in obtaining both permanent Program Administrator status, and increasing the budget to over $177 million. Jenny is often sought out to help jurisdictions interested in forming a REN as well as to help mentor newer RENs. Jenny is past Co-Chair of the California Energy Efficiency Coordinating Committee (CAEECC) and the past Chair of the Local Government Sustainability Commission. Second only to her adult children, Jenny’s greatest source of pride is the success of the BayREN programs and the great group of local government BayREN members she had the pleasure to work with. Since retirement, Jenny has focused on numerous efforts involving voter protection and voter access. Paul Carp Strategic Account Executive, Schneider Electric Paul Carp Strategic Account Executive, Schneider Electric Paul is a Strategic Account Executive at Schneider Electric working with utilities in California on deploying energy and smart grid technologies. Previously, he led a Business Development team focused on fleets at EVgo, the nation’s fast charging EV infrastructure company, and Business Development for Trellis Group (formerly GreenBiz), an Oakland-based media company focused on sustainability and climate change initiatives. Paul’s career has focused on deploying energy efficiency, renewable energy and smart grid technologies working for Pacific Gas & Electric, U.S. Department of Energy, Honeywell International and FirstFuel Software. Prior to that, Paul served in the Peace Corps in West Africa and worked as a staff member for House Leader Nancy Pelosi. Paul has a BA from the University of Michigan, an MBA from the Presidio Graduate School and lives in Oakland with his wife and two kids. EJ Cire Political and Public Relations Representative, Sheet Metal Workers’ Local 104 EJ Cire Political and Public Relations Representative, Sheet Metal Workers’ Local 104 EJ Cire is a proud member of Sheet Metal Workers’ Local 104, where he has spent almost six years. His current role is the Political and Public Relations Representative, which essentially means that he focuses on policies for working families and building political relationships in areas from local school boards up to County Boards of Supervisors. He covers the coastal counties from the Oregon border down to Ventura County. EJ has really found a passion on the political side because he sees the relevance and impact of politics and policies on his union membership as well as on local residents. Jane Fischberg Consultant; Board Secretary Jane Fischberg Consultant; Board Secretary Jane is a longtime social sector leader with a deep commitment to dismantling systems perpetuating poverty. From 2009-2020 she served as the President and CEO of Rubicon Programs .  Under her leadership, Rubicon evolved into a high performing organization well regarded for its whole-person approach, recognized for its establishment of an unequivocal antiracism stance, and having a strong financial position. Jane led the organization through several major changes including development of its first theory of change, sharpening its focus on ending poverty, and undertaking the work to dismantle the characteristics of white supremacy. Since 2021, she has been doing equity focused leadership coaching, especially with white-identifying CEOs who are striving to create an environment and practices to advance BIPOC leadership in their organizations and are eager to delve into how their own leadership can best advance these efforts. Jane received a BA from Williams College and an MPA from San Francisco State University, with additional training at Stanford Business School and at Harvard Business School’s Strategic Perspectives in Nonprofit Leadership. Jane enjoys exploring the East Bay’s hiking paths and staircases, practicing yoga, cooking and eating good vegetarian food and spending time with beloved friends and family.  She lives in the East Bay, is kept in line by her two high maintenance cats, and is proud of her adult son who never fails to make her laugh. Zach Goldman Political and Legislative Director, SEIU Local 1021 Zach Goldman Political and Legislative Director, SEIU Local 1021 Zach Goldman is a policy advocate and labor organizer with two decades of experience working for unions and local government. He is currently the Political & Legislative Director of SEIU Local 1021, a union of 60,000 public sector and non-profit workers. Prior to SEIU, Zach served as Chief of Policy & Legislative Affairs for the City of Oakland, where he led major budget and policy initiatives, securing investments in affordable housing and public safety. Previously, Zach was the Political Director for IFPTE Local 21, where he managed political and legislative programs across the Bay Area and advocated for pro-worker policies at various levels of government. He has served on the Executive Board of the Alameda Labor Council and worked for organizations like the California Nurses Association, the Change to Win Labor Federation, and SEIU Local 790. Zach holds a B.A. with Highest Honors in Sociology from UC San Diego, with a focus on U.S. economic history and social movements. He is a longtime Oakland resident where he lives with his wife and daughter Phel Meyer Director, Partner Alliances, Salesforce; Board Treasurer Phel Meyer Director, Partner Alliances, Salesforce; Board Treasurer Phel is a Director in the Alliances and Channels team at Salesforce. In this role, he manages Salesforce’s sustainability partnership with Accenture, bringing the best of Salesforce’s sustainability technologies and Accenture’s sustainability solutions jointly to market. Previously, Phel spent 10 years at Accenture, most recently as a Senior Manager in Accenture’s Talent & Organization practice leading change enablement and adoption efforts for High Tech clients throughout the Bay Area. Phel led the Accenture/Rising Sun non-profit partnership from 2017-2021, coordinating a team of Accenture consultants who provided support to Rising Sun as volunteers on a wide range of activities from strategy projects to staffing fundraising events. He has enjoyed every minute of his experiences working with Rising Sun, and considers himself fortunate to be part of such an impactful comunity of leaders and changemakers. Phel previously worked in the waste industry and once launched a waste-focused startup. He lives in Oakland with his wife and two baby girls, and spends his free time outdoors enjoying nature or indoors baking chocolate desserts. Phil Miller Chief Operating Officer, California Water Environment Association; Board Chair Phil Miller Chief Operating Officer, California Water Environment Association; Board Chair Phil Miller is the Chief Operating Officer with the California Water Environment Association. Recently, he was Chief Operating Officer and Chief Financial Officer with Camp Tawonga, where he led the organization’s operating and capital budgets, investments, endowment portfolio, and financial systems and initiatives. He was also responsible for Tawonga’s human resources and administrative systems. Phil sat on Tawonga’s Senior Management Team and was the staff lead of the Finance, Audit, and Financial Aid Committees. Phil is also a Rising Sun staff alum! He worked at Rising Sun from 2015-2019, serving as the Director of Operations and Interim Co-Executive. He has over 15 years of experience in the non-profit and public education sectors. Phil holds a bachelor’s degree from UC San Diego, a master’s degree in education from UC Berkeley, and an MBA from Saint Mary’s College of California. Phil is excited to rejoin Rising Sun and support the organization’s outstanding mission. Outside of work, Phil enjoys spending time with his wife, Sonya, daughters Nayezca, Adayah, and Yaelah, and their dog Reggie. Phil lives in Berkeley, enjoys playing sports, loves the Oakland A’s, hates kale, and is in dogged pursuit of the perfect burrito. Janaya L. Nichols Senior Program Officer, Pacific Foundation Services Janaya L. Nichols Senior Program Officer, Pacific Foundation Services Janaya is a Senior Program Officer at Pacific Foundation Services (PFS), a philanthropic management and advising firm. She is passionate about enhancing the capacity of the nonprofit sector and helping foundations to create strong partnerships and unlock more resources for social impact. Prior to her work at PFS, Janaya has spent her career in the nonprofit and philanthropic sectors working on systems change efforts in areas such as health equity, housing and homelessness, policy and community advocacy. Previously, she was the Director of Programs and Partnerships at Well Being Trust, leading the foundation’s mental and community health portfolio in California. She has also worked for organizations like First 5 LA, Dignity Health, and The Greenlining Institute. In the field, Janaya has served on the Advisory Council and Finance Committee at Rising Sun, and volunteers with various organizations supporting youth development, women, and girls. Janaya holds a Master of Science in Sociology from the London School of Economics and Political Science and a BA in Sociology from UC Berkeley. Janaya enjoys planning her next international adventure, and growing her skills as a textile artist, painter, and photographer. Mel Parker, MD TPMG Medical Director of Risk and Patient Safety, Kaiser Permanente; Board Vice Chair Mel Parker, MD TPMG Medical Director of Risk and Patient Safety, Kaiser Permanente; Board Vice Chair Melanie Parker, MD grew up in Newark, New Jersey and attended the Massachusetts Institute of Technology, graduating with a degree in biomechanical engineering. She received her medical degree from the Medical College of Georgia and completed her Urology residency at Albert Einstein/Montefiore Medical Center in the Bronx, NY. Upon completion of residency in 1993, she moved to Stockton, CA to work for The Permanente Medical Group. As a Kaiser Permanente physician, she has served as the Central Valley Chief of the Department of Urology, Assistant Physician in Chief for Risk, and since 2016 has served as the TPMG Regional Medical Director for Risk and Patient Safety, developing strategy for the Risk and Patient Safety Program. This has allowed her to enjoy the excitement of spending time in the city of Oakland, while continuing to practice Urology part-time in the Central Valley. Mel has a passion for community service, and is a member of The Stockton Chapter of The Links, Inc., and the Progressive Community Church in Stockton, where she serves on the Children’s Church Ministry. In her spare time, she enjoys running, travel (when not sheltering in place), and spending time with her husband and two adult children. Fahim Reese CEO, Motivated 2 Help Others; Co-leader, 1Hundred Years Enterprise Fahim Reese CEO, Motivated 2 Help Others; Co-leader, 1Hundred Years Enterprise Fahim is the CEO of Motivated 2 Help Others, a nonprofit that he created in 2019, born out of an idea he had when he was incarcerated. Fahim also co-leads 1Hundred Years Enterprise, which works to reduce recidivism among youth and vulnerable individuals and help steer them away from early death decisions through 1-on-1 mentorship with youth, family and community support groups, workshops, partnerships, storytelling (including a podcast), and more. Fahim graduated from Opportunity Build in 2018, joined the Laborers union, and now contracts to Rising Sun as an Assistant Construction Instructor and Physical Fitness Instructor for Opportunity Build. Tommy Sandoval Business Representative, District Council 16 Tommy Sandoval Business Representative, District Council 16 Tommy has been a member of the International Union of Painters and Allied Trades for 22 years. As a Drywall Finisher by trade, he spent over 20 years in the field before becoming a Business Representative for the Union. Through the years he not only learned how to be a skilled tradesman, he learned how to problem solve, be a team player, work ethic, and become a leader. As a Union Representative, Tommy assists members with issues, works with signatory contractors, and is currently learning how to navigate the world of politics. One of the most rewarding aspects of being a Business Representative is being in a position to connect underrepresented people to the construction industry. Tommy believes this is why he feels such a connection to the Rising Sun program. Outside of work, Tommy enjoys spending time with his family and two Persian cats, Katniss and Mochi. He loves to travel. So far, Tommy has been to all but one of the Hawaiian Islands and last year he took his first trip to the French Polynesian Islands. David Siddiqui Chief Operating Officer, Power TakeOff David Siddiqui Chief Operating Officer, Power TakeOff David Siddiqui has been working since 2000 on sustainability issues including climate, energy, waste, water, and transportation. His international experience includes executive leadership, business development, and operations for sustainable companies, consulting for utilities and government agencies, program design and management, policy, and workforce development. David founded the sustainability consulting business Green Evolution in 2008 and currently serves as Chief Operating Officer for Power TakeOff, using data analytics, software, and personalized support to help businesses save energy and money. David has held a variety of green building certifications and is an energy efficiency expert with deep experience using both building science and behavioral science to motivate actions with environmental, social, and financial benefits. He serves on advisory groups related to resource conservation initiatives and has appeared in dozens of speaking, writing, and media engagements. Sharla Sullivan Outreach and Partnerships Manager, Webcor Sharla Sullivan Outreach and Partnerships Manager, Webcor Sharla is the Outreach and Partnerships Manager at Webcor and a California Bay Area native. Sharla is a mom of three who is passionate about workforce development and supplier diversity. In her current role with Webcor, Sharla works to increase small and diverse business participation, local hiring, and community engagement on private and public works to further Webcor’s mission to build solutions and better lives. Webcor is a general contractor building structures all over California that bring exceptional value to public and private clients while operating in a safe, quality-driven environment. Before Webcor, Sharla was the Community Affairs Representative for EBMUD (and Cheryl’s co-worker!). She also worked on various communications projects for BART capital projects. Sharla holds a Bachelors in Sociology from Tufts University and has spent the last 15+ years of her career building mutually beneficial relationships throughout the construction industry. She’s worked in multiple regions of California and enjoys connecting new diverse suppliers to contracting opportunities and championing their growth and success through mentorship. Sharla truly believes that small and diverse business creation and growth start with our local workforce. She aims to strengthen relationships through strategic planning designed to foster this growth wherever possible. Peter Wasserman Senior Director of Innovation and Partnerships, Aledade Peter Wasserman Senior Director of Innovation and Partnerships, Aledade Peter Wasserman lives in Oakland, CA, with his wife, toddler, and fierce Chihuahua, and is currently the Senior Director of Innovation and Partnerships at healthcare technology company Aledade. Peter first became involved in Rising Sun as an Accenture strategy consultant working with its leadership team to develop its strategic plan in 2020 and to develop its alumni engagement strategy in 2021. Since then, Peter has remained engaged with Rising Sun as a member of its Advisory Board on its Policy and Communications committee. Peter is excited to deepen his engagement with Rising Sun because of its commitment to expanding high-road career opportunities while improving the climate resilience of local communities in California. Peter believes this multi-faceted approach uniquely positions Rising Sun to improve the health and lives of underserved individuals and communities in the face of climate change. Peter believes that his background as a strategy consultant and innovation professional working across functions and organizations to define and scale impactful programs will enable him to add value to Rising Sun as it scales its offerings. Delrisha White Founder and Principal Consultant, Equity Erudition: Anti-Racism Education Delrisha White Founder and Principal Consultant, Equity Erudition: Anti-Racism Education Delrisha White is a dynamic social impact leader who confronts educational inequity, racial, and socioeconomic injustice through education and storytelling. She is the Founder and Principal Consultant at Equity Erudition, an online anti-racism education firm focused on designing racial-equity learning experiences for organizations and families. She’s also a proud alum of Rising Sun’s California Youth Energy Services (now the Climate Careers program), which she first participated in when she was 14 years old. Her life’s work is a culmination of her experience growing up in a family impacted by poverty, as well as the criminal justice and child welfare systems. Leveraging her multimedia platforms, Delrisha uses storytelling to facilitate critical conversations that promote healing, as well as personal and community growth. Delrisha has consulted and worked with a range of national and local organizations. She leads keynotes and workshops for diverse audiences in higher education and the private sector including HBCUs, Ivy League institutions, and large public research universities. Her work is published domestically and internationally and can be found in publications at Harvard University, New York University, The Huffington Post, and Bennett College’s award-winning Belle Magazine. Her work has been featured on local and national media including UNCF, Black BET, CSPAN, and NBC. Delrisha holds a bachelor’s degree in Journalism & Media Studies with a minor in Global Studies from Bennett College in Greensboro, NC. In 2019, she earned her master’s in Education Policy & Management at the Harvard Graduate School of Education and was awarded the Intellectual Contribution award. She sits on the board of Pact Adoption Alliance, where she supports transracial-blended families experiencing the foster-adoption system(s). Advisory Council Eddie Alvarez Business Representative, Alameda County Building and Construction Trades Council Eddie Alvarez Business Representative, Alameda County Building and Construction Trades Council Eddie Alvarez is the Business Representative for the Alameda County Building and Construction Trades Council. He has worked labor politics for many years. Most recently, he was the Iowa State Director for Eric Swalwell’s Presidential campaign, where he was the first Mexican State Director in caucus history. He comes from a strong union household where his father is a 50-year member of the Elevator Constructors, Local #18, and the grandson of proud union members. He has worked in education in a variety of roles, as a baseball coach, and is a proud protector of our right to collective bargaining and open and free public lands. Stephanie Chen Senior Policy Counsel, MCE Stephanie Chen Senior Policy Counsel, MCE Stephanie Chen serves as Senior Policy Counsel for MCE, a local government agency formed to address climate change through renewable energy, energy efficiency, and local job creation in Contra Costa, Marin, Napa, and Solano Counties. Prior to joining MCE, Stephanie led the Energy Equity team at The Greenlining Institute, a racial justice advocacy organization dedicated to building economic opportunity in California’s communities of color. Stephanie’s work has driven investments in solar, energy efficiency, and other clean technologies into environmental justice communities, and promoted meaningful employment and entrepreneurial opportunities for people of color in California’s clean energy economy. Stephanie is a member of California’s Disadvantaged Communities Advisory Group, which advises the California Public Utilities Commission and the California Energy Commission to ensure that clean energy policies benefit environmental and social justice communities. Additionally, Stephanie serves on the board of directors for Vote Solar, the Asian Pacific Environmental Network (APEN), and the Clean Energy Group. Stephanie holds a B.A. in Government from Dartmouth College and a J.D. from the University of San Francisco School of Law. Elizabeth Geller Director, Energy and Climate Practice, 3Degrees Group, Inc. Elizabeth Geller Director, Energy and Climate Practice, 3Degrees Group, Inc. Elizabeth Geller is a consulting professional, engineer, and project manager with over six years of experience in the corporate sustainability and environmental compliance fields. Elizabeth has supported clients in a wide variety of industries including technology, consumer products, power generation, natural gas transmission, manufacturing, mining and more. Her experience includes corporate climate goal setting and renewable energy strategy, emission quantification, air quality regulation, and corporate environmental management. Elizabeth holds a B.S. in Chemical Engineering from Purdue University and currently serves as a Director on the Energy and Climate Practice consulting team at 3Degrees. Sekita Grant Vice President, Programs, The Solutions Project Sekita Grant Vice President, Programs, The Solutions Project Sekita Grant is the Vice President of Programs with The Solutions Project, overseeing their grantmaking, policy research, and impact strategy support for more than 100 frontline leaders innovating in models for a regenerative economy. Sekita worked as the Policy and Impact Strategy manager for the Emerson Collective, a philanthropy and investment collaborative. Sekita also worked at The Greenlining Institute as Legal Counsel for their Environmental Equity team after working as a policy advisor at the California Energy Commission in Sacramento. Melissa Koenigsberg Community Leader, Social Justice and Community Change Melissa Koenigsberg Community Leader, Social Justice and Community Change Melissa joins the Advisory Council of Rising Sun Center for Opportunity after serving as a member of the board from 2014-2020. She is a community leader who cares deeply about social justice and focuses her time volunteering with non-profits that serve individuals experiencing homelessness in San Francisco. She chaired Congregation Emanu-El’s Tzedek Council for the past four years, engaging congregants in social justice work through partnering with Hamilton Families, Larkin Street Youth Services and the Homeless Prenatal Program. Tyi Johnson Chair Emeritus Tyi Johnson Chair Emeritus Tyi joins the Advisory Council of Rising Sun Center for Opportunity after serving as a member of the board from 2015-2021. She graduated from the second Berkeley cohort of the Green Energy Training Services (GETS) program (which is now Opportunity Build), and is the first program alumnus to serve on the Board. She has served as Board Secretary, Vice Chair, and now as Chair. She also previously served as a crew member and office assistant for Rising Sun Energy Services, the organization’s social enterprise. Erin Lewellen CEO, Tilting Futures Erin Lewellen CEO, Tilting Futures As Chief Operating Officer, Erin was responsible for executing the vision and strategy of Global Citizen Year in partnership with the Senior Leadership Team and the Board of Directors. Prior to joining Global Citizen Year, Erin served as VP of School Partnerships for Revolution Foods where she led the expansion of Revolution Foods from five schools to over 1,200 nationwide. Prior to Revolution Foods, she served as the Bay Area Director for Playworks. Erin was instrumental in expanding this small, Bay Area organization into one that now partners with over 350 public schools nationwide. For the past 17 years, she has served as the Head Varsity Coach of the girls’ basketball team at Emery High School and for nine years, Board Chair for Oakland Leaf, a non-profit dedicated to empowering Oakland youth in their search for social justice. Previously, Erin worked for NICRO Women’s Support Centre in South Africa developing and implementing policy that worked to prevent gender-based violence in major school districts. Erin holds a B.A. from the Robert D. Clark Honors College at the University of Oregon. Jennifer Martinez Partner, Hanson Bridgett Jennifer Martinez Partner, Hanson Bridgett Jennifer represents private and public employers in federal and state court litigation and before administrative agencies regarding discrimination, harassment, retaliation, breach of contract, wrongful termination, and numerous other types of employment law matters. Jennifer also handles complex wage and hour class action litigation in both federal and state courts, as well as other representative and collective actions under the California Private Attorneys General Act and the federal Fair Labor Standards Act. Willie Joe Marquez Digital Marketer, Astro Optimized Willie Joe Marquez Digital Marketer, Astro Optimized Willie Joe Marquez is passionate about creating innovative, comprehensive and sustainable solutions that uplift communities and are founded on data, practicality, and equity. Born and raised in South Stockton to Filipino immigrants, Willie has experienced how under-resourced communities and communities of color have been marginalized and restricted in socioeconomic mobility. As a Digital Marketer for his consulting agency, Astro Optimized, and with more than 10 years of experience executing global and cross-functional projects in ecommerce, Willie brings his expertise in data-based decision making and track record of community advocacy to Rising Sun’s Advisory Council. Willie’s goal is to advance economic and environmental equity in Stockton and the Central Valley through his commitment to Rising Run. Alana Mathews Director of Membership and Training, Prosecutors Alliance of California; Adjunct Professor, University of the Pacific McGeorge School of Law Alana Mathews Director of Membership and Training, Prosecutors Alliance of California; Adjunct Professor, University of the Pacific McGeorge School of Law Alana Mathews is an impact attorney, experienced litigator, public policy expert and equity champion who has a demonstrated record of leadership in public service. She began her legal career as a prosecutor in the Sacramento County District Attorney’s Office where she tried over 50 jury and court trials to verdict. In 2012, she was recruited to start the enforcement unit of the California Energy Commission and the following year appointed Public Adviser of the agency by Governor Jerry Brown. In this role, she led organizational change through the development of the agency’s Equity Initiative. This effort included implementing legislative mandated programs, coordinating a multi-agency Disadvantaged Community Advisory Group, leading all public outreach and engagement strategies, and creating the Summer Institute in Energy Law and Policy, a two week program that exposed ethnically diverse and economically disadvantaged high school students to key energy issues and career paths. In 2019, Ms. Mathews was appointed Chief Consultant to the Joint Legislative Committee on climate Change Policies where her equity work was expanded to include reviewing all climate change legislation and coordinating oversight hearings for the state’s climate policies, programs, and investments. Most recently, she wrote a joint resolution introduced by California lawmakers urging specific action for the Biden Administration to address the global plastic waste crisis by ratifying the Basel Convention Amendments. Today, Ms. Mathews is an adjunct Professor at McGeorge School of Law where she teaches Implicit Bias and the Law and is the founder of the Racial Justice and Equity Fellowship Practicum. She is also a director with the Prosecutors Alliance of California, an organization that supports prosecutors committed to criminal justice reform. Ms. Mathews is also a leader on a number of regional and statewide boards and commissions including current Chair of the Heart of Central California Girl Scout Council, Vice Chair for the Commission on Judicial Nominees Evaluation of the State Bar of California and Chair of the Florin High School Law Academy Advisory Committee, Co-Chair of the Sacramento County Bar Association Summer Diversity Fellowship program and the founder of the Community Justice Collaborate, a grassroots organization which provides free community legal clinics in response to the protests against systemic racism in the summer of 2020. Carmelita Miller Director of Energy Equity Strategies, Rocky Mountain Institute Carmelita Miller Director of Energy Equity Strategies, Rocky Mountain Institute Carmelita Miller was born in the Philippines and grew up in South San Francisco, California. She graduated from Sacramento State University, where she became a Ronald E. McNair Scholar and earned a B.A. in History with a minor in Greek studies. After a graduating from UC Hastings College of the Law, she became a Greenlining Legal Fellow in 2013-14, focusing on telecommunications policy. While at UC Hastings, she served as the President of the Pilipino American Law Society and Co-Editor-in-Chief of the Hastings Race and Poverty Law Journal. Inspired by her personal experiences living in low-income, immigrant, and working-class communities, she dedicated her free time in law school to providing legal assistance to the low-income population by interning and volunteering at various pro bono organizations such as Legal Aid Society of San Mateo County, UC Hastings Civil Justice Clinic, Legal Aid of San Francisco’s Workers Rights Clinic, the Veterans Equity Center, and the Filipino Community Center. When she is not studying or fighting for justice, Carmelita enjoys lounging, hiking, and playing with her two black Labrador retrievers named Maximus and Athena. Devin T. Murphy Mayor, City of Pinole; CEO and President, DTM Strategies Devin T. Murphy Mayor, City of Pinole; CEO and President, DTM Strategies Devin T. Murphy is a seasoned government affairs professional, strategic communications consultant, and the Mayor of the City of Pinole, California. A collaborative leader and social entrepreneur, he is focused on building a regenerative economy that engenders increasing prosperity while maintaining the natural systems that sustain us. Devin served as a planning commissioner before being elected to the Pinole City Council in 2020. He is a champion for democracy reform, co-governance, participatory budgeting, economic development, climate mitigation and adaptation, financial planning, and disaster planning. Devin currently serves on numerous boards and committees, including the City of Pinole Finance Subcommittee, Technology and Communications Committee, and Committee on Memorials. Devin also serves on the Board of Directors for MCE Clean Energy, a clean electricity provider to more than 540,000 customers in Marin, Napa, Solano and Contra Costa counties and California’s first community choice aggregator, where he sits on both the Executive and Technical Committees respectively. Additionally, he represents Pinole on the Association of Bay Area Governments (ABAG), WestCAT Transit Authority, West Contra Costa Transportation Advisory Committee, and the West Contra Costa Integrated Waste Management Authority (RecycleMore). As the founding CEO and President of DTM Strategies, Devin has over a decade of business development and marketing experience delivering strategic communications, public affairs, paid advertising, and digital communications consulting services to numerous companies, foundations, and civic advocacy organizations. In 2018, Devin was appointed as a Technology and Democracy Fellow by the Harvard Kennedy School of Government. He is a member of the Environmental Sustainability Rotary Action Group, 350 Contra Costa, and Friends of the Pinole Library. In his free time, he likes reading, long distance walking, and spending time with his nieces and nephews and his dog, Miles. Devin is a graduate of the University of California, Los Angeles (UCLA) and holds a Certificate in Public Leadership from the University of San Francisco. Padmini Parthasarathy Principal and Founder, Sāmya Strategies Padmini Parthasarathy Principal and Founder, Sāmya Strategies Padmini Parthasarathy is a social sector leader with a proven record of success in philanthropy, nonprofits, and local government, and expertise in economic, racial, and gender justice, and public health. Her strengths and passions include creating and launching innovative strategies and initiatives, learning continually and applying insights gained, gathering and utilizing data and research to change policies and systems, building and sustaining meaningful relationships, and collaborating across sectors to advance social justice. Padmini is the Principal & Founder of Sāmya Strategies, an independent consulting firm serving the philanthropic and nonprofit sector. The firm helps social justice organizations and leaders to help them achieve their missions through strategic planning, research, coalition development, and other capacity building services. Prior to launching her consulting practice, Padmini served for eight years in various roles in philanthropy, including as strategist for justice, equity, and learning and senior program officer for economic security at the Walter & Elise Haas Fund; and program director at The California Wellness Foundation overseeing statewide grantmaking to advance the Affordable Care Act and health care reform, and promote employment and asset-building opportunities. Before that, Padmini was a program manager for Kaiser Permanente, where she managed its nationwide Community Health Needs Assessment, and she worked for Contra Costa Health Services’ Family, Maternal and Child Health Programs, leading an initiative to incorporate asset building and social determinants of health approaches into maternal and child health programs. Padmini’s leadership and volunteer experience includes currently serving on the board of directors of Cardea Service and having served on the boards of Asset Funders Network, American Foundation of Suicide Prevention, and March of Dimes. She was 2020-21 Council on Foundations Career Pathways fellow, a fellow in Grantmakers in Health’s Terrance Keenan Institute for Emerging Leaders in Health Philanthropy, and an inaugural member of the Justice Funders’ Harmony Initiative leadership program. Padmini earned her master’s degree in public health from UC Berkeley and a bachelor’s degree in psychology and social behavior, with a minor in sociology, from UC Irvine. Jodi Pincus Principal and Founder, nomada coaching & consulting; Former Executive Director, Rising Sun Jodi Pincus Principal and Founder, nomada coaching & consulting; Former Executive Director, Rising Sun For over 20 years, Jodi Pincus has worked in non-profit management, workforce development, social justice, and sustainability, specifically working at the intersection between climate, equity and jobs. She served as the Executive Director of Rising Sun Center For Opportunity for 12 years and is currently working as a consultant, specializing in green workforce development, strategic planning and leadership coaching. Jodi holds a Green MBA from the Presidio Graduate School, a BA in Peace and Conflicts studies from UC Berkeley, and is trained in the resiliency framework that has inspired her work. She has a commitment to social, racial, and environmental justice that is informed by being born in Apartheid South Africa. Her connection to the environment and understanding that our survival is dependent on how we walk on the earth is steeped in her early years living on a Native American Reservation and spending summers at a Jewish camp in Yosemite. She recently moved to San Miguel De Allende, Mexico, with her husband, two boys, and dog, so that her children could become bilingual and learn about their Mexican heritage. In San Miguel, she serves on the Board of Ojala Ninos, a non-profit, focused on providing education to children in rural Mexico so that they can reach their full potential. Michelle Vigen Ralston Principal and Founder, Common Spark Consulting Michelle Vigen Ralston Principal and Founder, Common Spark Consulting Michelle is the Principal and Founder of Common Spark Consulting, working to advance boldly inclusive policymaking processes as the foundation for a clean energy future for all. She facilitates public and stakeholder engagement, and provides research and strategic advocacy on behalf of her clients. Common Spark Consulting also supports organizational development and strategic planning efforts for not-for-profit organizations. Maria Stamas Climate Strategy and Policy Director, Ubuntu Climate Initiative Maria Stamas Climate Strategy and Policy Director, Ubuntu Climate Initiative With over a decade of experience in energy law and policy, Maria’s work is dedicated to personal and systemic transformation in service of just, regenerative economies. Maria is currently a Program Director with the Initiative for Energy Justice. Prior to that role, Maria served as Climate Equity Director for the Natural Resources Defense Council, where she fostered strategic partnerships to support the integration of racial and social equity into local government climate work as well as developed equitable building decarbonization frameworks. Maria has co-led coalition-based advocacy campaigns before the California Public Utilities Commission, the California Energy Commission, and the California State Legislature, which collectively resulted in $200 million invested in affordable housing upgrade programs. Maria holds a B.A. from Oberlin College and received her J.D. and M.A. in Energy & Resources from the University of California, Berkeley School of Law & the College of Natural Resources. Maria currently serves as vice-chair of the California Utility Low-Income Oversight Board. Walker Wright VP of Public Policy, Sunrun Walker Wright VP of Public Policy, Sunrun Walker Wright is the VP of Public Policy for Sunrun, the leading distributed solar, energy storage, and energy services company in the US. Over the years, Walker has held numerous leadership positions within industry trade associations and coalitions in the clean energy and energy storage space, including SEIA, The California Solar & Storage Association (CalSSA), California Energy Storage Alliance (CESA), and The Alliance for Solar Choice (TASC). From 2016 to September 2020, Walker was VP of Policy for ENGIE Storage (formerly Green Charge Networks), one of the nation’s top energy storage software and development companies, which was acquired by ENGIE (the world’s largest independent power producer). At ENGIE, Walker also provided policy and market strategy advice to various ENGIE investment arms and subsidiaries, including ENGIE Services US, the leading public sector and school solar and energy efficiency contractor in California. ENGIE Services is also a major energy services provider to universities across the US. From 2011 to 2016, Walker was a Sunrun policy team leader focusing on helping Western state markets attain long-term rooftop solar growth. Prior to joining the renewable energy space in California, Walker focused on policy and business development for Petra Systems, the New Jersey-based utility and smart grid solutions provider which in 2009 signed the largest distributed energy contract in the world. He holds a BA from Princeton University and an MSc from The London School of Economics and Political Sciences. He resides in Oakland, California. Join Our Newsletter Learn about upcoming community events and announcements. Email (Required) Facebook This field is for validation purposes and should be left unchanged. Programs Climate Careers Green House Calls Appliance Upgrades Opportunity Build Policy and Advocacy Our Impact Success Stories 2024 Impact Report Anniversary Report Strategic Plan News Recent Press About Us Who We Are Our People Our Supporters Contact Jobs at Rising Sun (510) 665-1501 info@risingsunopp.org Donate Privacy Policy Terms and Conditions Copyright © 2025 Rising Sun Center for Opportunity"
    },
    {
      "url": "https://www.thestitchsaloon.com/pages/contact-us",
      "text": "Contact Us\n – The Stitch Saloon Skip to content US Shipping is currently suspended. We hope to have shipping back up and running as soon as possible. Thank you for your ongoing patience and support of our little shop! US Shipping is currently suspended. We hope to have shipping back up and running as soon as possible. Thank you for your ongoing patience and support of our little shop! 567 Magill Road, Magill SA 5072     - Wed, Fri & Sat 10-3 Free domestic shipping on orders over $150 AUD Shop Shop Fabric Fabric Fabric from the Bolt Fabric Bundles Patchwork Quilt Kits Wholecloth Quilt Kits Precuts Small Sewing Projects Solid Fabrics Haberdashery Haberdashery Batting Bias & Quilt Binding Clips Cute Things Cutting Tools & Scissors English Paper Piecing (EPP) Essentials Needles Pins Pressing Tools Quilting Tools Rulers Sewing Labels Tailor's Clappers Thread - Embroidery Thread - Hand Quilting Thread - Machine Shop All Patterns Patterns Quilt Patterns Small Sewing Patterns Embroidery Patterns Embroidery Embroidery Stitchery Kits Stitchery Patterns Embroidery Tools & Hoops Embroidery Threads Stick & Stitch Heirloom Items Heirloom Items Quilts Christmas Stockings Sale & Last Chance Sale & Last Chance Remnants Clearance Fabrics One Bolt Wonders Gift Cards Gift Cards Gift Cards Gift Shop Gift Shop Shop by Budget Shop by Budget Gifts under $25 Gifts under $50 Gifts under $100 Gifts over $100 Shop by Technique Shop by Technique Gifts for All Quilters Gifts for Machine Sewers Gifts for Hand Piecers Gifts for Non-Quilters Gifts for Embroiderers Gifts for Young Sewers Gifts for Stash Busting Shop by Kit Shop by Kit Quilt Kits Sewing Kits Embroidery Kits Gift Cards Quilting Services Quilting Services Quilting Services Binding Services Workshops Community Community Blog & Tutorials Information Information Our Story Shipping & Returns FAQs Visit Us Pattern Corrections Contact Us Log in Facebook Pinterest Instagram Search our site Clear Shop Fabric Fabric from the Bolt Fabric Bundles Patchwork Quilt Kits Wholecloth Quilt Kits Precuts Small Sewing Projects Solid Fabrics Haberdashery Batting Bias & Quilt Binding Clips Cute Things Cutting Tools & Scissors English Paper Piecing (EPP) Essentials Needles Pins Pressing Tools Quilting Tools Rulers Sewing Labels Tailor's Clappers Thread - Embroidery Thread - Hand Quilting Thread - Machine Shop All Patterns Quilt Patterns Small Sewing Patterns Embroidery Patterns Embroidery Stitchery Kits Stitchery Patterns Embroidery Tools & Hoops Embroidery Threads Stick & Stitch Heirloom Items Quilts Christmas Stockings Sale & Last Chance Remnants Clearance Fabrics One Bolt Wonders Gift Cards Gift Cards Gift Shop Shop by Budget Gifts under $25 Gifts under $50 Gifts under $100 Gifts over $100 Shop by Technique Gifts for All Quilters Gifts for Machine Sewers Gifts for Hand Piecers Gifts for Non-Quilters Gifts for Embroiderers Gifts for Young Sewers Gifts for Stash Busting Shop by Kit Quilt Kits Sewing Kits Embroidery Kits Gift Cards Quilting Services Quilting Services Binding Services Workshops Community Blog & Tutorials Information Our Story Shipping & Returns FAQs Visit Us Pattern Corrections Contact Us Search our site Clear Log in Cart Cart Contact Us If you are looking for a custom fabric bundle, a custom quilt or anything else, I would love to hear from you! Please get in touch using the form below and I'll get back to you for a chat! Alternatively, we are available via email or social media. Email: thestitchsaloon@outlook.com IG: @thestitchsaloon We'd love to help you! Name Email * Phone number Comment Send message This site is protected by hCaptcha and the hCaptcha Privacy Policy and Terms of Service apply. Email thestitchsaloon@outlook.com Business Hours Wed, Fri and Sat 10-3 Phone 0431 183 473 (we are generally only able to answer during our shop hours - please email us otherwise!) Follow us Facebook Pinterest Instagram Shop Home Maker Shop Home Shop Custom Quilts About Us Shipping FAQs Contact Us Policies Pattern Corrections Shipping & Return Policy Privacy Policy Terms of Service GPSR & Safety Regulations Acknowledgement of Country We acknowledge and pay our respects to the Kaurna people, the traditional custodians whose ancestral lands we live and work on. Join our mailing list Enter email here Pop your email above to sign up to our newsletter where we keep you updated every so often on new products, promotions and helpful tips and tricks. Facebook Pinterest Instagram Follow us on social media! © 2025, The Stitch Saloon . All rights reserved. Powered by Shopify Country/region AFN ؋ EUR € ALL L DZD د.ج EUR € AUD $ XCD $ XCD $ AUD $ AMD դր. AWG ƒ SHP £ AUD $ EUR € AZN ₼ BSD $ AUD $ BDT ৳ BBD $ AUD $ EUR € BZD $ XOF Fr USD $ AUD $ BOB Bs. BAM КМ BWP P AUD $ USD $ USD $ BND $ BGN лв. XOF Fr BIF Fr KHR ៛ XAF CFA CAD $ CVE $ USD $ KYD $ XAF CFA XAF CFA AUD $ CNY ¥ AUD $ AUD $ AUD $ KMF Fr XAF CFA CDF Fr NZD $ CRC ₡ XOF Fr EUR € ANG ƒ EUR € CZK Kč DKK kr. DJF Fdj XCD $ DOP $ USD $ EGP ج.م USD $ XAF CFA AUD $ EUR € AUD $ ETB Br FKP £ DKK kr. FJD $ EUR € EUR € EUR € XPF Fr EUR € XOF Fr GMD D AUD $ EUR € AUD $ GBP £ EUR € DKK kr. XCD $ EUR € GTQ Q GBP £ GNF Fr XOF Fr GYD $ AUD $ HNL L HKD $ HUF Ft ISK kr INR ₹ IDR Rp AUD $ EUR € GBP £ ILS ₪ EUR € JMD $ JPY ¥ AUD $ AUD $ KZT ₸ KES KSh AUD $ EUR € AUD $ KGS som LAK ₭ EUR € LBP ل.ل AUD $ AUD $ AUD $ CHF CHF EUR € EUR € MOP P AUD $ MWK MK MYR RM MVR MVR XOF Fr EUR € EUR € AUD $ MUR ₨ EUR € AUD $ MDL L EUR € MNT ₮ EUR € XCD $ MAD د.م. AUD $ MMK K AUD $ AUD $ NPR Rs. EUR € XPF Fr NZD $ NIO C$ XOF Fr NGN ₦ NZD $ AUD $ MKD ден AUD $ AUD $ PKR ₨ ILS ₪ USD $ PGK K PYG ₲ PEN S/ PHP ₱ NZD $ PLN zł EUR € QAR ر.ق EUR € RON Lei AUD $ RWF FRw WST T EUR € STD Db SAR ر.س XOF Fr RSD РСД AUD $ SLL Le SGD $ ANG ƒ EUR € EUR € SBD $ AUD $ AUD $ GBP £ KRW ₩ AUD $ EUR € LKR ₨ EUR € SHP £ XCD $ XCD $ EUR € EUR € XCD $ AUD $ AUD $ AUD $ SEK kr CHF CHF TWD $ TJS ЅМ TZS Sh THB ฿ USD $ XOF Fr NZD $ TOP T$ TTD $ GBP £ AUD $ AUD $ AUD $ USD $ AUD $ USD $ UGX USh UAH ₴ AED د.إ GBP £ USD $ UYU $U UZS so'm VUV Vt EUR € USD $ VND ₫ XPF Fr MAD د.م. YER ﷼ AUD $ USD $ Update country/region Country/region Australia (AUD $) Australia (AUD $) Afghanistan (AFN ؋) Åland Islands (EUR €) Albania (ALL L) Algeria (DZD د.ج) Andorra (EUR €) Angola (AUD $) Anguilla (XCD $) Antigua & Barbuda (XCD $) Argentina (AUD $) Armenia (AMD դր.) Aruba (AWG ƒ) Ascension Island (SHP £) Austria (EUR €) Azerbaijan (AZN ₼) Bahamas (BSD $) Bahrain (AUD $) Bangladesh (BDT ৳) Barbados (BBD $) Belarus (AUD $) Belgium (EUR €) Belize (BZD $) Benin (XOF Fr) Bermuda (USD $) Bhutan (AUD $) Bolivia (BOB Bs.) Bosnia & Herzegovina (BAM КМ) Botswana (BWP P) Brazil (AUD $) British Indian Ocean Territory (USD $) British Virgin Islands (USD $) Brunei (BND $) Bulgaria (BGN лв.) Burkina Faso (XOF Fr) Burundi (BIF Fr) Cambodia (KHR ៛) Cameroon (XAF CFA) Canada (CAD $) Cape Verde (CVE $) Caribbean Netherlands (USD $) Cayman Islands (KYD $) Central African Republic (XAF CFA) Chad (XAF CFA) Chile (AUD $) China (CNY ¥) Christmas Island (AUD $) Cocos (Keeling) Islands (AUD $) Colombia (AUD $) Comoros (KMF Fr) Congo - Brazzaville (XAF CFA) Congo - Kinshasa (CDF Fr) Cook Islands (NZD $) Costa Rica (CRC ₡) Côte d’Ivoire (XOF Fr) Croatia (EUR €) Curaçao (ANG ƒ) Cyprus (EUR €) Czechia (CZK Kč) Denmark (DKK kr.) Djibouti (DJF Fdj) Dominica (XCD $) Dominican Republic (DOP $) Ecuador (USD $) Egypt (EGP ج.م) El Salvador (USD $) Equatorial Guinea (XAF CFA) Eritrea (AUD $) Estonia (EUR €) Eswatini (AUD $) Ethiopia (ETB Br) Falkland Islands (FKP £) Faroe Islands (DKK kr.) Fiji (FJD $) Finland (EUR €) France (EUR €) French Guiana (EUR €) French Polynesia (XPF Fr) French Southern Territories (EUR €) Gabon (XOF Fr) Gambia (GMD D) Georgia (AUD $) Germany (EUR €) Ghana (AUD $) Gibraltar (GBP £) Greece (EUR €) Greenland (DKK kr.) Grenada (XCD $) Guadeloupe (EUR €) Guatemala (GTQ Q) Guernsey (GBP £) Guinea (GNF Fr) Guinea-Bissau (XOF Fr) Guyana (GYD $) Haiti (AUD $) Honduras (HNL L) Hong Kong SAR (HKD $) Hungary (HUF Ft) Iceland (ISK kr) India (INR ₹) Indonesia (IDR Rp) Iraq (AUD $) Ireland (EUR €) Isle of Man (GBP £) Israel (ILS ₪) Italy (EUR €) Jamaica (JMD $) Japan (JPY ¥) Jersey (AUD $) Jordan (AUD $) Kazakhstan (KZT ₸) Kenya (KES KSh) Kiribati (AUD $) Kosovo (EUR €) Kuwait (AUD $) Kyrgyzstan (KGS som) Laos (LAK ₭) Latvia (EUR €) Lebanon (LBP ل.ل) Lesotho (AUD $) Liberia (AUD $) Libya (AUD $) Liechtenstein (CHF CHF) Lithuania (EUR €) Luxembourg (EUR €) Macao SAR (MOP P) Madagascar (AUD $) Malawi (MWK MK) Malaysia (MYR RM) Maldives (MVR MVR) Mali (XOF Fr) Malta (EUR €) Martinique (EUR €) Mauritania (AUD $) Mauritius (MUR ₨) Mayotte (EUR €) Mexico (AUD $) Moldova (MDL L) Monaco (EUR €) Mongolia (MNT ₮) Montenegro (EUR €) Montserrat (XCD $) Morocco (MAD د.م.) Mozambique (AUD $) Myanmar (Burma) (MMK K) Namibia (AUD $) Nauru (AUD $) Nepal (NPR Rs.) Netherlands (EUR €) New Caledonia (XPF Fr) New Zealand (NZD $) Nicaragua (NIO C$) Niger (XOF Fr) Nigeria (NGN ₦) Niue (NZD $) Norfolk Island (AUD $) North Macedonia (MKD ден) Norway (AUD $) Oman (AUD $) Pakistan (PKR ₨) Palestinian Territories (ILS ₪) Panama (USD $) Papua New Guinea (PGK K) Paraguay (PYG ₲) Peru (PEN S/) Philippines (PHP ₱) Pitcairn Islands (NZD $) Poland (PLN zł) Portugal (EUR €) Qatar (QAR ر.ق) Réunion (EUR €) Romania (RON Lei) Russia (AUD $) Rwanda (RWF FRw) Samoa (WST T) San Marino (EUR €) São Tomé & Príncipe (STD Db) Saudi Arabia (SAR ر.س) Senegal (XOF Fr) Serbia (RSD РСД) Seychelles (AUD $) Sierra Leone (SLL Le) Singapore (SGD $) Sint Maarten (ANG ƒ) Slovakia (EUR €) Slovenia (EUR €) Solomon Islands (SBD $) Somalia (AUD $) South Africa (AUD $) South Georgia & South Sandwich Islands (GBP £) South Korea (KRW ₩) South Sudan (AUD $) Spain (EUR €) Sri Lanka (LKR ₨) St. Barthélemy (EUR €) St. Helena (SHP £) St. Kitts & Nevis (XCD $) St. Lucia (XCD $) St. Martin (EUR €) St. Pierre & Miquelon (EUR €) St. Vincent & Grenadines (XCD $) Sudan (AUD $) Suriname (AUD $) Svalbard & Jan Mayen (AUD $) Sweden (SEK kr) Switzerland (CHF CHF) Taiwan (TWD $) Tajikistan (TJS ЅМ) Tanzania (TZS Sh) Thailand (THB ฿) Timor-Leste (USD $) Togo (XOF Fr) Tokelau (NZD $) Tonga (TOP T$) Trinidad & Tobago (TTD $) Tristan da Cunha (GBP £) Tunisia (AUD $) Türkiye (AUD $) Turkmenistan (AUD $) Turks & Caicos Islands (USD $) Tuvalu (AUD $) U.S. Outlying Islands (USD $) Uganda (UGX USh) Ukraine (UAH ₴) United Arab Emirates (AED د.إ) United Kingdom (GBP £) United States (USD $) Uruguay (UYU $U) Uzbekistan (UZS so'm) Vanuatu (VUV Vt) Vatican City (EUR €) Venezuela (USD $) Vietnam (VND ₫) Wallis & Futuna (XPF Fr) Western Sahara (MAD د.م.) Yemen (YER ﷼) Zambia (AUD $) Zimbabwe (USD $) Payment methods American Express Apple Pay Bancontact Google Pay iDEAL Mastercard PayPal Shop Pay Union Pay Visa Home Menu Search Shop Cart Account Choosing a selection results in a full page refresh."
    },
    {
      "url": "https://www.midwayusafoundation.org/contactus/",
      "text": "Contact Us - MidwayUSA Foundation MENU Donate Fundraise Latest News Latest News Blog News Features and Podcasts Press Releases Subscribe Team Endowments Find a Team Start a Team Endowment Forms Fundraising Team Incentives Matching Program Fundraising Products Past Fundraising Products Fundraising FAQs Special Events Blaser Experience | April 12-14, 2024 Past Special Events Day of Clays – Nebraska | June 10, 2023 Day of Clays South Carolina | May 20, 2023 Day of Clays – Minnesota | May 6, 2023 Downton Day | April 2023 SHOT Show Reception | Jan. 24, 2024 National Youth Shooting Sports Conference 2023 NYSSC Presentations Air Gun Training Camp With Olympians | Sept. 17, 2022 MidwayUSA Foundation Donor Reception | Sept. 17, 2022 Downton Day Day of Clays Nebraska | 2022 Pheasant Bonanza Hunt Day of Clays Talladega Team Gear Online Auctions Additional Endowments Organizational Endowments Agency Endowment Program Donor-Designated Endowment Program Agency and Donor-Designated FAQs Donor-Advised Funds Special Purpose Programs Coach Training Endowment Range Development Endowment Foundation Forever Endowment Special Purpose Endowment FAQs Forms Grants Team Grants FAQs Agency Endowment Grants Donor Designated Grants Coach Training Grants Range Development Grants Giving Opportunities Give Now Planned Giving and Estate Planning Gifts Having Immediate Impact Gifts of Cash Stocks & Bonds IRA Rollover Donor Advised Funds Gifts Taking Effect After Death Wills and Bequests Retirement Assets Life Insurance Donor Advised Funds Sponsorships Other Ways To Give Employer Matching Resources Team Resources Fundraising Ideas Range Games Supporting Sponsor Programs Shooting Resources Our Partner Community National Shooting Sports Foundation Scholastic Shooting Sports Foundation Youth Shooting Sports Alliance FAQs About Us History Transparency Policies Fundraising Event Guidelines Incentive Winners Our Team Contact Us Contact Us Home Contact Us Share our site CONTACT US 6001 West Van Horn Tavern Rd Suite C Columbia, MO 65203-9258 Phone: 1-877-375-4570 info@midwayusafoundation.org Name * First Last Email * Team ID *This will help us handle your request quicker. Reason for contact General Information Fundraising Grants Request an Account Statement Message * CAPTCHA Comments This field is for validation purposes and should be left unchanged. Set up a time to talk to your team’s program manager below! Yim Szeto – South Central Jay McClatchey – Northeast Jeff McClure – Southeast David Grell – North Central Dan Darragh – West Donate Fundraise MidwayUSA Foundation 6001 West Van Horn Tavern Rd Suite C Columbia, MO 65203-9258 Phone: (877) 375-4570 Info@MidwayUSAFoundation.org MidwayUSA Foundation is a 501(c)(3) public charity. © 2025 MidwayUSA Foundation, Inc. All Rights Reserved. Privacy Policy Donor Policy"
    }
  ]
}