{
  "fuentes": [
    {
      "url": "https://www.alzamoragroup.com/en/team/",
      "email": "alpack@alzamoragroup.com"
    },
    {
      "url": "https://www.alzamoragroup.com/en/team/",
      "email": "info@alzamoragroup.com"
    },
    {
      "url": "https://flhospitalitybuyersguide.com/contactus.php",
      "email": "frla-advertise@svmmedia.com"
    },
    {
      "url": "https://eatalmanola.com/our-team",
      "email": "araujo@eatalmanola.com"
    },
    {
      "url": "https://www.marker99restaurant.com/contact-us/",
      "email": "flags@2x.png"
    },
    {
      "url": "https://www.marker99restaurant.com/contact-us/",
      "email": "marketing@southeastpetro.com"
    },
    {
      "url": "https://jdsrestaurant.com/contact-us/",
      "email": "info@jdsrestaurant.com"
    }
  ],
  "mails": [
    "alpack@alzamoragroup.com",
    "araujo@eatalmanola.com",
    "flags@2x.png",
    "frla-advertise@svmmedia.com",
    "info@alzamoragroup.com",
    "info@jdsrestaurant.com",
    "marketing@southeastpetro.com"
  ],
  "nombre_sitio": "almarosagroup.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.alzamoragroup.com/en/team/",
      "text": "Meet our team | Alzamora Group Español Português English Français Home About us Group History Team Awards News Solutions How we work Case studies A. System Carton Box Alzamora Lab Commitment Sustainability Certifications Continuous improvement Social responsibility Blog Jobs Contact us! Home About us Group History Team Awards News Solutions How we work Case studies A. System Carton Box Alzamora Lab Commitment Sustainability Certifications Continuous improvement Social responsibility Blog Jobs Home About us Group History Team Awards News Solutions How we work Case studies A. System Carton Box Alzamora Lab Commitment Sustainability Certifications Continuous improvement Social responsibility Blog Jobs Contact us Español Português English Français Español Português English Français Welcome to the Alzamora family Welcome to the Alzamora family Talent, commitment and innovation are part of our DNA At the Alzamora Group we understand that teamwork and harmony in the workplace are the pillars of our activity. We are a company which takes care of our staff, supporting their internal and professional development, since their growth is also ours. TEAM BUILDING We carry out activities aimed at strengthening relationships among the whole team. COMMITMENT The key to our success lies in our responsibility towards our employees and customers. CREATIVITY AND INNOVATION We are continuously innovating in the packaging sector, stimulating our creativity. TALENT DEVELOPMENT We make the most of our staff’s abilities and skills by providing specific training on packaging, innovation and team management. SOLIDARITY ACTIVITIES We encourage the spirit of solidarity by participating in various causes. SOCIAL BENEFITS We have a wide range of benefits which we offer our team. Talent, commitment and innovation are part of our DNA At the Alzamora Group we understand that teamwork and harmony in the workplace are the pillars of our activity. We are a company which takes care of our staff, supporting their internal and professional development, since their growth is also ours. Team building We carry out activities aimed at strengthening relationships among the whole team. Creativity and Innovation We are continuously innovating in the packaging sector, stimulating our creativity. Solidarity Activities We encourage the spirit of solidarity by participating in various causes. Commitment The key to our success lies in our responsibility towards our employees and customers. Talent development We make the most of our staff’s abilities and skills by providing specific training on packaging, innovation and team management. Social Benefits We have a wide range of benefits which we offer our team. Our invincible team! We are proud of the great team we are! In 2020 we composed our own song with the slogan “¡Somos Invencibles!” (We’re Invincible!). Teamwork, which reinforces our unity and pride in belonging to the team, highlighting our core values: commitment, involvement, innovation and creativity. Our invincible team! We are proud of the great team we are! «The key to our success is the large group of professionals that form part of our team, a highly qualified and professional workforce that has led the Alzamora Group to its position as a leader in the packaging sector.» If you are interested in one of our positions, register for the offer and fill in the form. Register for the offer If you don’t find your offer, submit your CV for future job opportunities. Send my CV Join our team! Do you love packaging and are you innovative, committed, eager to grow and looking for new challenges? If so, you have Alzamora’s DNA! At the Alzamora Group we are growing internationally, so we are always publishing new job offers, in our locations based in London (UK), Olot (Spain) and Lisbon (Portugal). If you think you might be a good fit for a position in our available jobs, we would love to meet you! If you are interested in one of our positions, register for the offer and fill in the form. Register for the offer If you don’t find your offer, submit your CV for future job opportunities. Send my CV OFFSET PRINT & PACKAGING (KENT, LONDON) Estimating and Procurement Manager Working days: Monday – Friday. Some flexibility regarding start/finish time Incorporation: Immediate Contract: Full Time Permanent Contract What will be your tasks? Prepare details, accurate job estimates for printed packaging products based on customer specifications, materials, machine capabilities, and labour requirements. Ensure estimates are accurate and aligned with company strategy and market benchmarks. Liaise with sales, customer service and production teams to support client quote requests. Develop and maintain pricing models, factoring in production time, materials, machine usage, waste, and other variable costs. Oversee all purchasing activities for raw materials, outsourced services, production supplies Negotiate with suppliers to ensure best value in terms of cost, quality, and service levels. Monitor supplier performance, pricing trends, and material availability across the UK and European network. Develop and implement procurement strategies that align with company goals. Set development objectives for colleagues within your team and monitor performance Identify any individual training requirements within the Technical team and advise the Operations Director accordingly Produce weekly/monthly reports on production costs, estimate accuracy, material consumption, and production & procurement KPIs. Present cost performance data and strategic purchasing insights to senior management Work closely with production and technical teams to ensure feasibility and efficiency of proposed specifications Keep up to date of emerging materials, sustainable packaging options, and industry Comply with all certification requirements What are we looking for? Previous supervisory experience essential Previous experience of working within a commercial field, ideally purchasing and estimating Experience working within packaging sector desirable Commercial Acumen: Able to balance customer needs with margin and cost considerations. Excellent interpersonal, leadership and organisational skills Confident and enthusiastic, with a desire to continuously learn and develop yourself and others through mentoring and training Willingness and ability to communicate company directives to the team in positive, concise and effective manner IT literate and fully conversant with Microsoft Office suite Experience of supplier negotiation, or a willingness to learn appropriate techniques and practices for day-to-day supplier interaction Proactive character of high integrity, accountability and flexibility What do we offer? Competitive Salary DOE 25 days holiday entitlement + 8 Statutory Bank Holiday allowance Company Workplace Pension up to 3% Long Service Award, additional annual leave starting from 5 years’ service Death in Service Salary Benefits Program including : Car Salary Sacrifice/ Cycle to Work/ Employee Discounts Recruitment Referral Program Annual Company Social Events : Summer & Christmas Gluing Minder Working day: 6am -2pm , 2pm-10pm, 10pm-6am Incorporation: Immediate Contract: Permanent / Full Time What will be your tasks? Make Ready and Run work as efficiently as possible whilst meeting safety, quality and productivity targets Complete all necessary administration including data entry onto the business IM systems Identify any maintenance issue and resolve where possible, or communicate with appropriate personnel in line with departmental procedures Ensure quality checks are carried out as per company guidelines Responsible for ensuring the machines, tooling, auxiliary equipment and working area are kept clean, safe and organised General machine maintenance Advise Supervisor of any consumable stock requirements Utilization of the appropriate equipment to assist with material preparation Responsible for assisting Department with Training needs for Gluing Apprentices and Assistants Any other duties as instructed by a member of the management team To comply with all business management system requirements To comply with all certification requirements What are we looking for? Being able to work well within a team and as an individual Experience of running Gluing Machines including but not limited to Diana, Starfold, Omega Ability to prioritise multiple tasks and work under strict timescales Ability to remain calm under pressure Confident and enthusiastic with a desire to learn and develop through continuous training Good communication skills Strong interpersonal and organisational skills Experience working within packaging sector would be desirable Organised, methodical and logical approach to work What do we offer? Competitive Salary DOE 25 days holiday entitlement + 8 Statutory Bank Holiday allowance 20% Shift Premium Payable when on the night shift 15% Shift Premium Payable between 6pm-10pm Overtime available, paid at x1.5 standard hourly rate Company Workplace Pension Onsite Parking Long Service Award Death in Service Salary Benefits Program including :- Car Salary Sacrifice/ Cycle to Work/ Employee Discounts Recruitment Referral Program Annual Health Assessments Alzamora Packaging (Olot) Business Developer (food and beverage sector) Working day: Full time, with a split timetable from Monday to Friday. Incorporation: Immediate Contract: Indefinite What will be your tasks? Market research, identifying business opportunities and key trends. Customer acquisition and loyalty by presenting solutions and providing appropriate technical advice. Identification of business opportunities based on an analysis of the market and the needs detected in clients. Negotiating commercial proposals. Managing and strengthening customer relationships and exploring additional growth opportunities. Preparation of reports (evolution, forecasts and results obtained). What are we looking for? University degree in Commercial Management and/or complementary training in negotiation and sales techniques. Demonstrable experience of 5 years in international sales and in the management of commercial relations with clients. Knowledge in technical and sales advice and sales of products in the Packaging sector, food and, in particular, the beverage industry. Customer orientation and ability to establish solid relationships. Ability to work autonomously and as part of a team. Level of English C1 or higher. Willingness to travel. What do we offer? Fixed monthly salary + variable. Availability for immediate incorporation. Stable job in a company in constant growth. A young team with an excellent working environment. Continuous training and opportunity for professional development. Commercial technician (Barcelona) Working day: Full time with split timetable Incorporation: Immediate Contract: Indefinite What will be your tasks? Implement the company’s commercial strategies to increase sales. Attract new clients and grow the client portfolio. Advise customers, identifying their needs and offering appropriate solutions. Keeping up to date with new trends and market developments. Track orders to ensure correct and on-time delivery. Participate in trade fairs and industry events to keep abreast of new developments. What are we looking for? Training in Sales Management or Sales. At least 3 years experience in a similar position, preferably in Packaging. Intermediate English (written and spoken). Commercial skills, negotiation skills and customer orientation. What do we offer? Stable full-time contract. Fixed monthly salary + variable depending on results. Continuous training and professional development. A young team with a great working environment. Commercial technician (North zone - Basque Country, Cantabria and Castilla y León) Working day: Full time with split timetable Incorporation: Immediate Contract: Indefinite What will be your tasks? Develop and implement the commercial strategies defined by the Commercial Management. Identify new business opportunities through active prospecting. To expand and build customer loyalty, offering solutions tailored to their needs. Collect technical information for the quotation department, including documentation and samples. Accompany the order process from confirmation to final delivery. To carry out the complete follow-up of quotations until their validation. Analyse market trends and sector evolution to anticipate customer needs. Meet established sales targets. What are we looking for? Training in Commerce, Marketing or similar. Minimum of 3 years’ experience in sales, preferably in the industrial packaging sector. Residence in the northern area (preferably Basque Country, Cantabria or north of Castilla y León). Profile with strong results orientation and excellent communication and negotiation skills. What do we offer? Stable full-time contract. Fixed monthly salary + variable depending on results. Continuous training and professional development. A young team with a great working environment Die pre-arrangement operator Working day: Full time with an intensive morning and afternoon schedule (weekly rotation). Incorporation: Immediate Contract: Indefinite What will be your tasks? Supervise the machines and materials necessary for the start of work. Prepare dies and other materials required for production. Carry out repairs, adjustments and changes to dies when necessary. Manage the stock of material related to the dies and place orders when material is in short supply. Collaborate with the production team, keeping the work area tidy and clean. Follow the instructions of the machinists and section managers on the work to be carried out, offering support when required. Provide support to other sections according to the needs of the team. What are we looking for? School graduate, with additional training in the packaging industry an advantage. Minimum 2 years experience in a production and manufacturing environment, preferably in machine maintenance or die preparation. Ability to follow procedures. Organised profile, with communication skills and motivation for continuous learning. What do we offer? Stable job in a company in constant growth. A young team with an excellent working environment. Continuous training through the company. Machinery operator assistant / Production Working day: Full time with intensive morning, afternoon and evening hours (weekly rotation). Incorporation: Immediate Contract: Indefinite What will be your tasks? Follow and comply with the procedures and work instructions of the section. Consult, check and prepare the necessary material to start a new job. Follow the instructions of the machinist and foreman regarding the work to be carried out. Adding, when necessary, raw materials, components and consumables. Verify possible modifications in the production order and the computer system on the productions. Keep the machinery and tools involved in the production process clean, as well as the section. What are we looking for? Previous experience in an industrial environment, preferably in the graphic arts sector. Computer skills at user level. Ability to learn and motivation to acquire new skills. What do we offer? Stable job in a company in constant growth. A young team with an excellent working environment. Learning plan and continuous training. Maintenance technician Working day: Full time with an intensive morning and afternoon schedule (weekly rotation). Incorporation: Immediate Contract: Indefinite What will be your tasks? Perform preventive and corrective maintenance of the machines. Optimise the performance of the equipment. Manage the necessary materials and spare parts. Comply with the technical documentation. What are we looking for? Intermediate, Advanced or equivalent in electrical and industrial maintenance. Minimum 2 years’ experience in industrial maintenance or similar. Organised and methodical person, with good communication skills and ability to respond quickly and efficiently. What do we offer? Stable job in a company in constant growth. A young team with an excellent working environment. Continuous training through the company. Night shift manager Working schedule: Full time, Monday to Friday, from 22h to 6h. Incorporation: Immediate Contract: Permanent , Full Time What will your responsibilities be? Ensure compliance with procedures and work instructions at the plant. Coordinate and lead the production team during the night shift, fostering a collaborative and efficient work environment. Manage quality incidents, ensuring compliance with safety standards and operational excellence. Motivate and promote teamwork, identifying training needs and managing evaluations, breaks, leave, and vacation time for the personnel under your supervision. Propose and participate in continuous improvement initiatives and transformation projects to enhance the plant’s competitiveness. What are we looking for? Minimum education: High School diploma or Technical Training in Graphic Arts or a related field. Minimum of 3 years’ experience in an industrial environment, preferably in the packaging or manufacturing sector. Knowledge of quality management system standards. Analytical thinking and problem-solving and decision-making skills. Leadership and communication skills for team management. What do we offer? Professional development with ongoing training. Night shift work with fixed salary plus bonuses. Innovative and sustainable environment, committed to quality and continuous improvement. Specialist - Official die-cutting machine Working day: Full time with intensive morning, afternoon and evening hours (weekly rotation). Incorporation: Immediate Contract: Indefinite What will be your tasks? Prepare and adjust the dies for different jobs and formats. Performing the die-cutting process (making the necessary changes in the die-cutter, registering and centring the sheet, validating the sample and proceeding with the print run, etc.). Manage and attend to possible modifications to the production order. Control the quality of finished products, ensuring compliance with established standards. Solving technical problems that may arise during the die-cutting process. Collaborate with other departments to ensure the technical feasibility of die-cutting and optimise the process. What are we looking for? Minimum secondary education qualification, with additional training in the packaging industry an advantage. Experience in the operation of automatic machines (BOBST Expercut, Novacut). Knowledge of 5S methodology is an advantage. What do we offer? Stable job in a company in constant growth. A young team with an excellent working environment. Continuous training through the company. Specialist – Skilled folding machine operator Working day: Full time with intensive morning, afternoon and evening hours (weekly rotation). Incorporation: Immediate Contract: Indefinite What will be your tasks? Prepare and adjust the folding machine: configuration of guides, wheels, belts and mechanical elements of the folding machine according to the type of case and material (linear cases, automatic, semi-automatic bottom, etc.). Execute the folding process, guaranteeing the production rate and the correct handling of the cardboard. Verifying the quality of the folding: checking creasing lines, shape and tolerances according to samples or technical data sheets. Resolving technical incidents during the process (feeding problems, folding deviations, jams, etc.). Apply quality and safety standards: comply with established quality, traceability and industrial safety procedures. What are we looking for? Completed secondary education (specific training in the packaging industry is an advantage). Previous experience in carton folding processes for Packaging (food, pharmaceutical, cosmetics, etc.). Knowledge of the different types of cartons and their technical requirements. Operation of BOBST machinery: Alpina, Masterfold, Visionfold, Mistral. Basic knowledge of regulations such as ISO 9001, BRC Packaging, FSC or other industry certifications. What do we offer? Stable job in a company in constant growth. A young team with an excellent working environment. Continuous training through the company. Systems Technician Working day: Full time with intensive morning and afternoon schedule (weekly rotation). Incorporation: Immediate Contract: Indefinite What will be your tasks? Administration and maintenance of systems and servers. Management of networks, devices and communications (LAN, VPN, firewalls, etc.). Second level technical support to internal users, incident resolution and follow-up. Installation, configuration and updating of equipment, software and hardware. Monitoring of system status and application of IT security policies. Collaboration in improvement projects and implementation of new technological solutions. Technical documentation of procedures and configurations. What are we looking for? Training in Network Administration, Intermediate or Higher Level Training Cycle. Minimum experience of 2 years in similar functions. Knowledge of cybersecurity, databases and industrial environments will be an advantage. Resolute person, with analytical skills, user orientation and willingness to continuous learning. What do we offer? Stable full-time contract. Continuous training and professional development A young team with a great working environment. Warehouse operator Working day: Full time with intensive morning, afternoon and evening hours (weekly rotation). Incorporation: Immediate Contract: Indefinite What will be your tasks? Receive and prepare raw materials, semi-finished products and materials, and distribute them to the corresponding production section. Checking the correct identification and condition of the materials. Prepare the different orders according to customer specifications. Loading and unloading the transport vehicle with the goods to be delivered from the customer and supplier. What are we looking for? Minimum 1 year experience, preferably in the logistics sector. To have a forklift or fork-lift truck licence. Knowledge of Excel and SAP is an advantage. Organisational skills and initiative. What do we offer? Stable job in a company in constant growth. A young team with an excellent working environment. Learning plan and continuous training. Novotipo Packaging (Lisbon) Continuous Improvement Technician Workday: 40 hours per week Incorporation: Immediate Contract: Indefinite What will be your tasks? Identifying, recording, and analysing Non-Conformities. Coordinating corrective and preventive action plans (PDCA) with multidisciplinary teams. Monitoring and communicating performance indicators (KPIs). Providing technical support for product control, particularly in job approvals. Supporting, supervising, and making decisions regarding non-conforming product selection and final inspections. Participating in internal and external audits. Preparing technical documentation for clients and internal departments. Promoting awareness and delivering internal training (Good Practices, Quality, Environment, and Food Safety). Supervising waste segregation and collection. What are we looking for? Higher education (preferred). Minimum 1 year of experience in a similar role. Experience in the cardboard packaging sector will be valued. Solid knowledge of standards such as ISO 9001, BRC Packaging, FSC, and PEFC (preferred). Trainer Qualification Certificate (CAP) (preferred). Proficiency in Microsoft Office tools (Excel, Word, PowerPoint, Outlook). Intermediate level of English and Spanish (spoken and written) (preferred). Strong sense of responsibility, organisation, and planning. Proactive profile with a customer-oriented approach (internal and external). Excellent communication skills and a team player mindset. What do we offer? Stable employment in a constantly growing company. A young, dynamic team with an excellent working environment. Continuous training and development opportunities. Factory Manager Workday: 40 hours per week Incorporation: Immediate Contract: Indefinite What will be your tasks? Define and implement the Annual Action Plan for the factory. Lead teams and align production objectives. Control costs, KPIs, inventory, and quality. Reduce losses and address issues related to non-quality. Coordinate Human Resources in the Production department. Collaborate with the Technical Management on strategic projects. What are we looking for? Degree in Industrial Engineering, Production Management, or equivalent. Solid experience (at least 5 years) as a factory manager or director in the printing or packaging sector. Expertise in continuous improvement methodologies, cost control, and performance indicators. Leadership, strategic vision, and excellent communication skills. What do we offer? Integration into a group with an industrial DNA and focus on innovation. Autonomy, growth, and a real impact on the company’s performance. MEET OUR TEAM Discover the opinions that some members of our team have written about Alzamora Group Jordi Ana Sofía Isaac Maria José Sandro Vince “Since my beginnings at Alzamora Group, I have gone through different positions and I have never stopped growing as a person and as a professional, thanks to the continuous challenges that have been proposed to me. I am proud to belong to this company and I am passionate about my work within this great team. A phrase with which I am identical is: ‘draw your future and fight to make it come true’. “ Jordi | Director of Operations | Alzamora Packaging “It is a privilege to be part of the Novotipo team. A coordinated and goal-focused professional team. All team members contributed to facilitate my integration process with the company. I am grateful to all of you! Alzamora Group shows enormous attention and concern for the adaptation and integration of employees, not only in the organization but also in the real world where we operate ”. Ana Sofia | Administrative Assistant | Novotipo Packaging “I joined the Alzamora Group just after finishing my studies and from that moment I knew that it would be the company where I would build my professional career. I really love my job and the people I surround myself with. They are talented, collaborative, and we always support each other to achieve our goals. Alzamora grows very quickly, it continually bets to keep us updated, which is good to motivate us and to evolve together. “ Isaac | R&D Technician | Alzamora Packaging “Working at Alzamora means being part of a committed team that faces daily challenges, believing that nothing is impossible. Learning is constant and accompanies the diversity of tasks and responsibilities assigned to us. In my opinion, perseverance and Professional competence of colleagues are motivators and are also the reason for the continued success of the company. “ Maria José | Quality Manager | Novotipo Packaging “I began my career at Novotipo in 2001 as a printing assistant, responsible for preparing inks. I soon moved on to the production of vinyl stickers, expanding my technical knowledge. With a background in graphic arts, I moved into pre-press and packaging design. I also worked in quality control and CTP (plate recording), which strengthened my understanding of the entire graphic process. I am currently a packaging designer and creative, a role I perform with a comprehensive vision, critical thinking and passion, thanks to my experience in different key areas of the company.” Sandro | Packaging Designer and R&D | Novotipo Packaging “I have spent my entire career in the packaging industry, learning the trade from the inside. I worked in different departments, gained experience in printing, pre-press and quality control, and was fortunate enough to train alongside great professionals. This journey gave me a complete overview of the production process and a deep understanding of the business. Today, as Managing Director Operations, I apply all that knowledge with a practical perspective, working closely with the team and always focused on continuous improvement.” Vince | Managing Director Operations | Offset Print & Packaging About us Group History Team Awards Solutions How we work? Products Alzamora Lab Commitment Sustainability Safety and quality Continuous improvement Social Contact Work with us Blog News Contact us Copyright © Alzamora Group 2025. Legal | Privacy policy | Cookies policy We are using cookies to give you the best experience on our website. You can find out more about which cookies we are using or switch them off in settings . Close GDPR Cookie Banner Accept Reject Settings Close GDPR Cookie Banner Change cookie settings Close GDPR Cookie Settings Privacy Overview Strictly Necessary Cookies Analytics Powered by GDPR Cookie Compliance Privacy Overview This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping our team to understand which sections of the website you find most interesting and useful. Strictly Necessary Cookies Strictly Necessary Cookie should be enabled at all times so that we can save your preferences for cookie settings. Enable or Disable Cookies Enabled Disabled Analytics This website uses Google Analytics to collect anonymous information such as the number of visitors to the site, and the most popular pages. Keeping this cookie enabled helps us to improve our website. Enable or Disable Cookies Enabled Disabled Enable All Reject All Save Settings"
    },
    {
      "url": "https://flhospitalitybuyersguide.com/contactus.php",
      "text": "Florida Restaurant & Lodging Association Buyers Guide :: Contactus Florida Restaurant & Lodging Association Buyers Guide Home Explore Featured Companies Spotlight Listings Show All Listings Contact Media Kit Advertise With Us Contact Us Contact Us 8700 Indian Creek Parkway Suite 300 Overland Park, KS 66210 1563 913-214-5200 frla-advertise@svmmedia.com www.svmmedia.com Home Show Listings Advertise With Us Contact Us All Rights Reserved | Copyright © 2025, Strategic Value Media. To Top × 20 Continue to site →"
    },
    {
      "url": "https://eatalmanola.com/our-team",
      "text": "Our Team — Alma 0 Skip to Content Welcome About Our Team Menu Menu Our Locations Bywater Location Catering Blog Press Calendar Open Menu Close Menu Welcome About Our Team Menu Menu Our Locations Bywater Location Catering Blog Press Calendar Open Menu Close Menu Welcome Folder: About Back Our Team Folder: Menu Back Menu Our Locations Bywater Location Catering Blog Press Calendar Our Team Melissa Araujo Executive Chef & Owner Melissa Araujo was born in La Ceiba, Atlantida, Honduras. La Ceiba is a small beach town on the Atlantic Coast of Honduras. Araujo spent summers in Honduras. In the fall, she returned to Providence, Rhode Island, where life was different but exciting. Life and family inspired Melissa to enter the culinary industry.  After working in local restaurants right out of high school, she focused all her time on becoming a chef. From 1999 to 2005, Melissa worked in Milan, Italy. In 2011, Melissa worked at Mondo’s Restaurant for Chef Susan Spicer (James Beard Award winner for Best Chef in the South ). In 2012, she joined the team for R'evolution Restaurant for John Folse & Rick Tramonto. In 2013, She was Sous Chef Doris Metropolitan. In 2015, she joined the culinary team with Chef Alon Shaya at Dominica Restaurant & Shaya Restaurant. (2015 James Beard Award winner, Best Chef in the South ) . 2013 Melissa Brought to Life Saveur Catering LLC  and 2015  Melissa Brought to Life Alma restaurant focus on Honduran Cuisine. When Melissa has free time, you can find her traveling or at the beach with her dogs, Charlotte, Hela & Oden Hortencia VAZQUEZ Sous Chef Bywater a passionate chef originally from La Ceiba, Honduras, brings over a decade of rich culinary experience to her kitchen. After immigrating to the United States four years ago, she has continued to delight diners with her mastery of traditional Honduran cuisine blended with international flavors. Hornecia’s culinary journey started 10 years ago in her hometown, where she cultivated a deep connection with the vibrant flavors and fresh ingredients of Central American cuisine. Her dishes reflect her roots, infused with the spirit and warmth of La Ceiba. Since arriving in the USA, she has honed her skills, embracing new techniques and ingredients, all while staying true to her heritage. Her cooking showcases her commitment to preserving the authenticity of Honduran food, with a focus on bringing out bold, natural flavors. Whether it’s preparing classic dishes like baleadas or introducing a creative twist to her plates, Hornecia continues to make her mark in the culinary world with her dedication and passion for cooking. Jarret O'pry General Manager MID-CITY As a New Orleans native with family roots from Evangeline Parish, my journey has taken me through various roles in the service industry. After leaving the US Army Signal Corps and Military Intelligence, I delved into building computer networks and networking before starting off as a server at Roadhouse Grill. In just six months, I advanced to become a bar manager and eventually a kitchen manager. I then transitioned to Boomtown Casino as a sous chef, overseeing the 24-hour deli. Over 2 1/2 years, I progressed to become the food and beverage manager under the food and beverage director. Following that, I joined Lonestar Steakhouse as the general manager of a location before and after Hurricane Katrina. After the closure of the location post-Katrina, I found a new opportunity at Piccadilly as an assistant general manager, emergency response team member, and MIT trainer for 5 to 6 years. With the downsizing economy, I moved on to work at Deuce McAllister's Old Saint on Royal St. in New Orleans. Eventually, I made the decision to leave the service industry for five years until Chef Melissa reached out and asked me to join her team. In my 16 plus years in the service industry I accomplished certifications for food safety, culinary, food allergens, and instructor for national restaurant association. Maya Assistant General Manager (AGM) MID-CITY Julian Landa GENERAL MANAGER BYWATER brings more than 15 years of dynamic, hands-on experience in the restaurant industry to his role as General Manager at Alma. A Colorado native with deep-rooted ties to Louisiana, Julian has long moved between both states and officially made New Orleans his home in 2021. He began his journey in hospitality at the age of 15, working his way through every facet of the industry—from back of house to front of house—before rising into leadership positions. His previous roles include managing The Slotted Spoon and overseeing food and beverage operations at The Carillon, a premier retirement community in Denver. In 2021, Julian relocated to New Orleans to pursue a career in education, but his passion for hospitality never waned. He continued working part-time in the service industry and joined Alma in 2022. Since then, he has become an integral part of the team, collaborating closely with owner and Chef Melissa Araujo both in-house and at high-profile catering events, weddings, and private functions. Julian’s management philosophy centers on thoughtful service and exceptional guest experiences. With a personal appreciation for everything from local diners to Michelin-starred destinations, he believes great hospitality should always feel genuine, warm, and unforgettable. His mission is simple: to ensure every guest leaves Alma feeling welcomed, cared for, and eager to return. Beyond the restaurant, Julian is an avid traveler and a devoted basketball fan and player. He also enjoys chess, pickleball, and continuing to discover the unique spirit and culture of New Orleans—a city he’s proud to call home. Facebook | Instagram | © 2024. ALL RIGHTS RESERVED. PRIVACY   Made by Gray Whale Private Dining Bar Services Order Online"
    },
    {
      "url": "https://www.marker99restaurant.com/contact-us/",
      "text": "Contact | Marker 99, Restaurant & Lounge Skip to content Marker 99, Restaurant & Lounge Marker 99 Restaurant & Lounge Menu HOME RESERVATIONS EVENTS CONTACT MARKER 99 Get in touch Get a Quote First Name * Email Address * Phone Number Message 0 / 180 Send Message Contact Details 1234-5678-901 [email protected] 4263 US-1, Melbourne, FL 32935. connect on social Facebook Twitter Google-plus Pinterest Instagram Neve | Powered by WordPress"
    },
    {
      "url": "https://jdsrestaurant.com/contact-us/",
      "text": "Contact JD's Restaurant & Lounge | Get in Touch Skip to content (727)-595-1320 Family Owned – Family owned, friendly service and great food! Home Menu Drinks Specials Catering About Us Events Order Pick-Up Uber Eats Jobs Rewards Contact Us Menu Home Menu Drinks Specials Catering About Us Events Order Pick-Up Uber Eats Jobs Rewards Contact Us Gift Cards Gift Cards Contact Us Click Here Contact Info Phone : (727)-595-1320 Address : 125 GULF BLVD RESTAURANT, LLC., DBA JD's Restaurant & Lounge Email: info@JDsrestaurant.com Location Hours : Thur, Fri, Sat 8:00 am - 11:30 pm Sun, Mon, Tue, Wed 8:00 am - 10:30 pm Social Media Contact Us Now Or Stop By Today For guest comments or suggestions please feel free to send us an inquiry or tell us how to how to contact you by completing the form below. Name * Email * Phone Number Message Submit Order Specials Reservations Parties Catering [contact-form-7 id=\"a4c05c2\" title=\"Contact form 1\"] The team that has contributed to over 3 decades of JD’s operations, as well as the numerous guests over the years is a testament to the success of their hard work and spirit. Hours Thur, Fri, Sat 8:00 am - 11:30 pm Sun, Mon, Tue, Wed 8:00 am - 10:30 pm Quick Links Menu Drinks Specials Events About us Rewards Gift Cards Catering Jobs Menu Menu Drinks Specials Events About us Rewards Gift Cards Catering Jobs Contact Us (727)-595-1320 125 Gulf Boulevard Indian Rocks Beach, FL 33785 info@JDsrestaurant.com Facebook-f Instagram Yelp Tripadvisor NEWSLETTER Sign Up With over 40 years of experience in the restaurant industry, the Loder family brings their passion for food and hospitality to The Crabby Bill’s Family Brands. We invite you to enjoy our 10 different dining experiences located along the Gulf of Mexico in the always sunny Florida state! © JDs Restaurant and Lounge | All rights reserved."
    }
  ]
}