{
  "fuentes": [
    {
      "url": "http://hockey.ballparks.com/NHL/TampaBayLightning/index.htm",
      "email": "cory@ballparks.com"
    },
    {
      "url": "http://hockey.ballparks.com/NHL/TampaBayLightning/index.htm",
      "email": "paul@ballparks.com"
    },
    {
      "url": "https://www.tampabay.com/features/humaninterest/how-do-you-pronounce-amalie-arena-hint-youre-doing-it-wrong/2327750/",
      "email": "cspata@tampabay.com"
    },
    {
      "url": "https://www.tampabay.com/features/humaninterest/how-do-you-pronounce-amalie-arena-hint-youre-doing-it-wrong/2327750/",
      "email": "licensing@zumapress.com"
    },
    {
      "url": "https://www.amaliearena.com/premium-experiences/club-seats",
      "email": "membershipservices@viniksportsgroup.com"
    },
    {
      "url": "https://www.excellentice-kirkland.com/en/contact-us/",
      "email": "info@excellentice-kirkland.com"
    },
    {
      "url": "https://www.excellentice-kirkland.com/en/contact-us/",
      "email": "info@excellentice-kirkland.com"
    },
    {
      "url": "https://www.tampabay.com/news/business/tampa-bay-lightning-plans-major-announcement-this-afternoon/2195910/",
      "email": "jharrington@tampabay.com"
    },
    {
      "url": "https://www.ticketmaster.com/amalie-arena-tickets-tampa/venue/106710",
      "email": "claimsinquiry@allianzassistance.com"
    },
    {
      "url": "https://am.ticketmaster.com/bolts/ContactUs",
      "email": "boxoffice@viniksportsgroup.com"
    },
    {
      "url": "https://am.ticketmaster.com/bolts/ContactUs",
      "email": "groupsales@viniksportsgroup.com"
    },
    {
      "url": "https://am.ticketmaster.com/bolts/ContactUs",
      "email": "priorityaccess@viniksportsgroup.com"
    },
    {
      "url": "https://www.amaliearena.com/terms-conditions",
      "email": "copyrightagent@viniksportsgroup.com"
    },
    {
      "url": "https://www.amaliearena.com/terms-conditions",
      "email": "adminassist@viniksportsgroup.com"
    },
    {
      "url": "https://www.amaliearena.com/arena-info/a-z-faq",
      "email": "lostandfound@viniksportsgroup.com"
    },
    {
      "url": "https://arenagroup.com/usa/contact/",
      "email": "info@arenaamericas.com"
    },
    {
      "url": "https://www.nhl.com/lightning/team/front-office",
      "email": "adminassist@amaliearena.com"
    },
    {
      "url": "https://www.nhl.com/lightning/team/front-office",
      "email": "adminassist@amaliearena.com"
    },
    {
      "url": "https://www.nhl.com/lightning/team/front-office",
      "email": "adminassist@viniksportsgroup.com"
    },
    {
      "url": "https://www.amaliearena.com/arena-info/accessibility",
      "email": "accessibility@amaliearena.com"
    },
    {
      "url": "https://www.amaliearena.com/arena-info/accessibility",
      "email": "accessibility@viniksportsgroup.com"
    },
    {
      "url": "https://www.amaliearena.com/arena-info/accessibility",
      "email": "boxoffice@viniksportsgroup.com"
    },
    {
      "url": "https://www.amaliearena.com/arena-info/accessibility",
      "email": "guestexperience@viniksportsgroup.com"
    }
  ],
  "mails": [
    "accessibility@amaliearena.com",
    "accessibility@viniksportsgroup.com",
    "adminassist@amaliearena.com",
    "adminassist@viniksportsgroup.com",
    "boxoffice@viniksportsgroup.com",
    "claimsinquiry@allianzassistance.com",
    "copyrightagent@viniksportsgroup.com",
    "cory@ballparks.com",
    "cspata@tampabay.com",
    "groupsales@viniksportsgroup.com",
    "guestexperience@viniksportsgroup.com",
    "info@arenaamericas.com",
    "info@excellentice-kirkland.com",
    "jharrington@tampabay.com",
    "licensing@zumapress.com",
    "lostandfound@viniksportsgroup.com",
    "membershipservices@viniksportsgroup.com",
    "paul@ballparks.com",
    "priorityaccess@viniksportsgroup.com"
  ],
  "nombre_sitio": "amaliearena.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "http://hockey.ballparks.com/NHL/TampaBayLightning/index.htm",
      "text": "Amalie Arena Arenas by Munsey & Suppes Baseball Basketball Football Hockey Olympics Race Tracks Soccer BALLPARKS.com © 1996-2017 by Paul Munsey & Cory Suppes About BALLPARKS.com Advertising Awards & Publicity Disclaimer CFL Past , Present & Future Stadiums MLB Past, Present & Future Ballparks NBA Past , Present & Future Arenas NCAA Past , Present & Future Stadiums NFL Past , Present & Future Stadiums NHL Past , Present & Future Arenas Air Canada Centre Amalie Arena American Airlines Center Barclays Center BB&T Center Bell MTS Centre Bridgestone Arena Canadian Tire Centre Gila River Arena Honda Center KeyBank Center Le Centre Bell Little Caesars Arena Madison Square Garden Nationwide Arena NHL Annual Awards Pepsi Center PNC Arena PPG Paints Arena Prudential Center Rogers Arena Rogers Place SAP Center at San Jose Scotiabank Saddledome Scottrade Center Staples Center T-Mobile Arena TD Garden United Center Verizon Center Wells Fargo Center Xcel Energy Center Olympic Past & Future Stadiums Need Tickets ? Search By Artist or Event Name Our Suggestions Amalie Arena Copyright by Aerials Only Venue Particulars Address 401 Channelside Drive Tampa, FL  33602 Phone (813) 301-6500 Official Website Seating Weather Newspaper Video Satellite View Lightning Gear Venue Resources Hotels, Dining & Deals in Tampa The Facility Opened October 20, 1996 Ownership (Management) Palace Sports and Entertainment (Palace Sports and Entertainment) Cost of Construction $139 million Arena Financing $124 from State sales tax bonds; county tourist tax bonds; city parking bonds; county ticket surcharge; city ticket surcharge; private revenue bonds. Naming Rights St. Petersburg Times paid $33 million for 12-year naming rights in 2002. Former Names Ice Palace (1996-2002) St. Pete Times Forum (2002-2012) Tampa Bay Times Forum (2012-2014) Amalie Arena (2014-Present) Arena Architects Ellerbe Becket General Contractors / Construction Managers Huber, Hunt & Nichols Other Facts Tenants Tampa Bay Lightning (NHL) (1996-Present) Tampa Bay Storm (AFL) (1997-Present) Population Base 2,200,000 On Site Parking 1,500 Nearest Airport Tampa International Airport (TPA) Retired Numbers #4 Vincent Lecavalier #99 Wayne Gretzky Championships 1st 2004 Seating Capacity 19,500 Average Ticket $44.27 (2006-2007) $42.41 (2008-2009) Fan Cost Index (FCI) $265.09 (2006-2007) $250.64 (2008-2009) The Team Marketing Report FCI includes: four average-price tickets; four small soft drinks; two small beers; four hot dogs; two game programs; parking; and two adult-size caps. Luxury Suites 72 Suites Club Seats 3,300 Basketball 20,500 Concerts 21,500 Attendance History Season Total Capacity Change 1992-93 410,560 95% NA 1993-94 805,901 76% 96.3% 1994-95 478,419 77% -40.6% 1995-96 774,391 97% 61.9% 1996-97 713,891 89% -7.8% 1997-98 568,579 98% -20.4% 1998-99 471,948 92% -17.0% 1999-00 557,618 70% 18.2% 2000-01 611,173 75.4% 9.6% 2001-02 2002-03 2003-04 2004-05 644,610 678,354 730,634 None 2005-06 2006-07 2007-08 2008-09 840,887 814,944 766,412 676,409 2009-10 2010-11 2011-12 2012-13 635,388 676,610 757,192 457,337 2013-14 2014-15 2015-16 2016-17 763,096 771,761 782,772 782,772 1992-1993 - Attendance for Expo Hall, Tampa, Fl. 1993-1995 - Attendance for the Thunderdome, St. Petersburgh, Fl. 1994-1995 - Attendance for 24 games due to NHL lockout. 2004-2005 - NHL lockout 2012-2013 - Attendance for 24 games due to NHL lockout. Sources: Mediaventures Located in downtown Tampa, the 19,764 seat Amalie Arena (formerly the Ice Palace, St. Pete Times Forum and Tampa Bay Times Forum) became the home of the Tampa Bay Lightning in October, 1996.  Situated  on the Garrison Channel between the Florida Aquarium and the Tampa Convention Center, the 600,000 square foot arena is designed for hockey but will house over 150 events annually with seating capacity expanded to 20,500 for basketball and up to 21,500 for center-staged events. The Amalie Arena features 28 luxury suites just 20 rows from the playing surface and another tier of 43 on a higher level.  Each suite includes 12 cushion theater-style seats in front of a sliding glass wall which may be opened or closed to the remainder of the suite which will have catered dining, private bar and restaurant service, private restrooms and personal furnishing features.  In addition, suiteholders have access to a suite-holders only parking lot with a private enterance to the Amalie Arena, and first choice at other headlining events in the area. Additionally, the Amalie Arena features an exclusive 3,000 seat Palace Club that combines first-class service and amenities with season tickets to Lightning games.  A most unique aspect of the arena, the Palace Club provides members with their own private club level to enjoy the action, the best seats in the house, membership to the private restaurant/club, in-seat wait service, concierge service, business facilities, reserved parking in the arena garage and much more. Images Courtesy Paul Munsey The Amalie Arena was financed by a unique public/private partnership, including the City of Tampa, Hillsborough County, the state of Florida, and Lightning Partners, Ltd.  Total cost of the project was estimated at $160 million.  Ellerbe Becket designed the facility and Huber, Hunt, and Nichols was the construction contractor. October 21, 1996 AP - On a night that they opened their $160 million St. Pete Times Forum, the Tampa Bay Lightning gave their fans something to remember.  The New York Rangers probably won't forget it, either. Dino Ciccarelli and Alex Selivanov scored 32 seconds apart early in the second period as the Lightning beat the Rangers 5-2 last night in the inaugural game at the new arena. A crowd of 20,543 in the 19,764 seat building saw Ciccarelli break a 1-1 tie 23 seconds into the period.  The Lightning right wing converted the rebound of a shot from Rudy Poeschek for his fourth goal. The 1999 NHL All-Star game was played at the St. Pete Times Forum. Amalie Arena history * First regular-season game: October 20, 1996 win over the New York Rangers 5-2 * First goal: October 20, 1996 by Bradley at 11:46 of the first period TAMPA BAY LIGHTNING USING SPONSORSHIP DEAL TO FUND ICE PALACE IMPROVEMENTS September 30, 1999 Copyright 1999 MediaVentures A five-year agreement with local Chrysler and Plymouth dealers will provide funding for the Tampa Bay Lightning to renovate the Ice Palace's club and suite levels. Terms of the deal were not announced, but they are estimated at $10 million and include naming rights for the arena's club and suite levels, restaurant and VIP entrances. Signage is included along with space inside the arena to display automobiles. The renovation work will cost up to $5 million. The team and the venue were recently purchased by Palace Sports and Entertainment. The company is also investigating sale of naming rights to the arena. THE ULTIMATE SPORTS ROAD TRIP By: Andrew Kulyk & Peter Farrell St. Pete Times Forum Ranking by USRT Architecture 6.5 Concessions 7 Scoreboard 4 Ushers 7 Fan Support 5 Location 7.5 Banners/History 4 Entertainment 3 Concourses/Fan Comfort 4.5 Bonus: USRT Assist 4 Bonus: Outdoor Entry Plaza 2 Total Score 53.5 January 19, 1999 January 24-25, 1999 January 18, 2002 March 19-21, 2008 - The Ice Palace - believe it or not this is the THIRD home for the Lightning in their short history, as they began play their first season at Expo Hall northeast of Tampa before moving to the Thunderdome (now Tropicana Field) prior to coming here to their permanent home. The Arena Football League Tampa Bay Storm also make the Ice Palace their home. Getting to the Venue This arena is located in downtown Tampa right near Hillsborough Bay, and is adjacent to the Tampa Convention Center and the Florida Aquarium. Since opening in 1996, a number of pubs and restaurants, most with outdoor patios, have sprung up in the neighborhood, lending a festive outdoor atmosphere before and after the games. A new hotel recently opened just behind the arena, and the finishing touches are being applied to a beautiful new park along the channel right next to the venue. If you are looking for things to do before or after the game, then the warm night air of Tampa awaits. THE hopping area is just a short drive away in Ybor City, where restaurants and nightlife are abundant. Opening soon will be a light rail tram to take you there from the Ice Palace neighborhood. In fact the tracks have already been laid. Parking is abundant, with ramps and surface lots all nearby and free spots on the street, if you arrive early enough. Outside the Venue A large public plaza is located between the arena ramp and the main entrance, making for a pleasant meeting ground - games of skill for the youngsters, a live band performing, and vendors selling their wares. Radio and TV outlets have their booths set up, not to mention the music blaring from the bars just across the street. A pretty cool atmosphere. Adjacent to the main entrance is a ground level sports bar, recently renovated and featuring plenty of cool hockey memorabilia. There is even a cordoned off outside patio area to sit and sip a couple tall ones. This venue lacks a grand entry pavilion. You walk up the stairs, walk in the doors, and you are in the concourse. That's it. Once inside, you can see how similar this building is to the layout of our own HSBC Arena, with a lower and upper level, a club level and two levels of suites circling the arena bowl. The Bowl Four levels of seating here, including a lower, club, suite and upper level. All seats are colored blue, save for the XO seats which are black leather. The Lightning scrapped the old Thunderdome scoreboard in favor of Sony Jumbotrons (very good) and added digital LED boards along the club level balconies in each end zone. They have been augmented  with synchronized ad panels which run along the sidelines. Scrolling out of town scoreboards were also added. All very very good! Club Seating The club section has undergone a huge renovation, and the result is one of the most unique configurations that we have seen in any of the major arenas. As is the case elsewhere, the club concourse is at the 200 level of the building. Private entrance is off  the main plaza outside, and a nicely appointed, carpeted concourse awaits you. Two upscale restaurants are located adjacent to the club concourse. Named Medallions and Icons , they overlook the outside plaza. One offers casual dining and the other a bountiful buffet. Both restaurants offer a spectacular view of the Tampa skyline and the plaza below. The XO Club - At one end zone of the 200 level and suite level is the XO Club, and this takes the club seat experience to a whole new thing. We are talking about leather- back chairs, a concourse with hardwood floors, beautifully decorated bar areas, complete with mood lighting and back lit aquariums, lacquered table tops, plasma monitors, internet work stations, and best of all, bars and food buffets everywhere. Your XO Club ticket comes with unlimited beverages, including beer and wine, and all the food you can handle, from salad bars to buffet to a carvery to a brick pizza oven to light snacks. The entire club is akin to a country club experience. Concessions Ya gotta try the cuban sandwiches, definitely a Tampa thing! Outback Steakhouse also has a specialty food stand here. The main team store is located on the plaza side of the main concourse. On the club level is another merchandise stand offering unique \"club level\" souvenirs, polo shirts and the like. Let us warn you that they also charge club level prices! Banners/Retired Numbers This franchise has a short and sorry history, so the two banners they hang trumpet their attendance records set at the Thunderdome. And the new addition... a banner proclaiming Lightning Fans as being \"#1\". Hat Tricks, Assists, Penalties... Hat Trick - to the new XO Club, really something everybody ought to try at least once. Tickets here don't come cheap, however, and there is no public sale, so you've got to look elsewhere if you want to get in. Penalty - To the Lightning management for hanging that lame and idiotic \"Lightning Fans #1\" banner right between their other two dumb banners. Hey guys, how about actually winning something meaningful ON the ice? Did you folks actually have a \"banner raising ceremony\" for the #1 banner? Did you play dramatic fanfare music and get all misty eyed??? Puh-leeze! Hat Trick - to the same Lightning management for otherwise doing a fine job of finishing off what was a shabby and gloomy building with major capital improvements, and doing it the right way. The results really show! But work remains to be done, and if you want OUR laundry list of advice then please call. Assist - Thanks to Sean Henry, Senior VP of Administration for the Tampa Bay Lightning, for taking the time to give us a tour of the building and an interview. Assist - This franchise is Sabres South - Rick Dudley GM, John Tortorella (former Muckler shoe shine boy) is head coach, Craig Ramsay Asst Coach, players Holzinger, Sarich, Andreychuk, wasn't Bam-Bam Barnaby just here with that killer smile? Just like being home. All you guys need is a Hasek and the Cup is yours! Disclosure time here - Andrew owns a condo on Treasure Island, so Tampa Bay is home away from home and we visit here often. We cheer for the Tampa teams, and would really like to see the Lightning have better success down the road. Summary We were really left cold on our initial visit to what we saw to be a dank and gloomy building with many unfinished public areas, a dark seating bowl, a team with marginal fan support, and a losing tradition. We were pleasantly surprised to see that much has happened since new ownership took over in mid 1999, and optimism for the future abounds along with a venue which has really taken shape with more to come. New arenas in other cities still top this one, but visiting Tampa, sampling the energy of this city and cheering on the Lightning is a cool thing to do. And from what we experienced, we are CHANGING our rating for the first time on the Ultimate Sports Road Trip. NAMING RIGHTS BEING SHOPPED IN TAMPA December 4, 2008 Copyright 2008 MediaVentures Tampa, Fla. - For now, Tampa's downtown arena is officially called the St. Pete Times Forum. \nBut at least one big Florida advertiser thinks he could change that, and he's settled on a dollar \nfigure to put his name on the building instead of the Times'. It's a name that's quite familiar to people in Florida. John Morgan of the high-profile law firm Morgan & Morgan said he was approached recently \nby an advertising executive in Tampa about a potential deal to buy the naming rights on the arena. Forum officials, including the owner of the Tampa Bay Lightning, vigorously deny they're \nshopping around for a new naming rights partner. By no means is any deal in progress, Morgan said, but he said \"I was asked if I have an interest \nin buying the name of the stadium, and I do ... Putting 'Morgan & Morgan Forum' on that building - that appeals to me.\" Morgan said he was offered a price of $1.7 million per year, almost a million dollars less than \nthe St. Petersburg Times now pays for those same rights. That puts the purchase within his reach.\nMorgan & Morgan is one of the nation's largest plaintiff's law firms, known for its \nForThePeople.com Web site. The Orlando-based firm normally spends about $20 million in Florida \neach year on advertising and marketing, so $1.7 million would represent a significant part of its \nannual budget. \"I'd have to take a long, hard swallow, but it's doable,\" Morgan said. Morgan's contact in Tampa is not directly working for the Forum, or the Tampa Bay Lightning \nowners who manage the building. Instead, it's John McKay of McKay Advertising, an independent \nadvertising firm in Tampa. Although McKay says he wasn't authorized to go looking for new \nadvertisers, he has other connections to the team. Any shift in naming rights would fit with marketing changes already under way around the \nbuilding. Forum officials recently extended a deal that lets the cell phone company MetroPCS put \nits name on a large banner above the neon St. Petersburg Times logo that faces the Selmon \nCrosstown Expressway. Tampa city officials also disclosed plans to rename the road in front of the Forum, now called \n\"St. Pete Times Forum Drive\" to its original name, \"Old Water Street,\" as part of construction of \nthe new Tampa Bay History Center. Originally, the Times paid to have its name on that street as \npart of its naming rights deal, but officials with the Times agreed to the street name change. \nA number of loose ends remain for any potential deal for the arena name. Whether McKay's and \nMorgan's hopes ever go beyond wishful thinking remain to be seen. The St. Petersburg Times is halfway through a 12-year contract signed in 2002 for the official \nnaming rights, paying $2.1 million the first year, with payments rising 3 percent annually to $2.9 million in the 12th year of the deal. If a new deal were to be struck, it would come in a dramatically different economic atmosphere \nthan when the current deal originated in 2002. Since then, both the advertising and newspaper \nmarkets nationally have declined. Like virtually every newspaper in the nation, the St. Petersburg Times has reduced staff and consolidated its offerings to cope with a slower economy. \nForum officials rejected the possibility of a new deal. Oren Koules said Morgan was never offered a deal, and McKay doesn't have the authority to do \nso. He said McKay told him that Morgan made the suggestion and named the price. \n\"There's absolutely no way in a million years we would do $1.7 million,\" said Koules, the \nproducer of the \"Saw\" series of horror films. If the Forum were shopping the naming rights, he said he would give the job to a national \nsearch firm and be asking $4 million or $5 million a year. (Tampa Tribune) $40 MILLION IN RENOVATIONS PROPOSED FOR TAMPA ARENA January 27, 2011 Copyright 2011 MediaVentures Tampa, Fla. - The Tampa Bay Lightning plans to announce roughly $40 million in renovations\nto the St. Pete Times Forum that the team hopes will significantly improve the hockey game and concert-going experience, the St. Petersburg Times reported. Documents obtained by the Times from Hillsborough County indicate that the team's new owners want to get reimbursed for much of the work with tourist taxes. Among the changes being discussed: new seating, an overhauled ventilation system, a new interior color scheme and an upper-level concession area. The newspaper said the plan is expected to underscore a renewed commitment to the area since a new ownership group led by hedge fund manager Jeff Vinik took over early last year. Three top county officials who have been briefed by TBSE confirmed to the Times some of the broad ideas of what they have been told is in store. The three, Administrator Mike Merrill, Commissioner Ken Hagan and Tim Simon, director of finance for the clerk's office, have been talking with Lightning officials since late last year. Their shared account of the renovations planned for this summer include: * Replacing all of the seats within the arena with new blue ones to match the team's new colors. The Times Forum's faulty heating and ventilation system allows moisture to build up, which has caused the seats' metal supports to rust. * Replacing some or all of the existing heating, air conditioning and ventilation system to address those moisture issues. * Repainting the walls, resurfacing concourse floors and adding an old-fashioned pipe organ. * Adding a central food and beverage, party-deck-type area on the upper level in an area that is largely unused. The party area would provide new vending options in the upper, or terrace, level. Team officials hope that will ease congestion on lower concourses that they have long said are too narrow. Simon told the Times that during a tour of the arena late last year to highlight proposed modifications, he put the team's renovation cost at about $35 million. Team officials told him the figure would probably be slightly higher, he said. The county-owned Times Forum was built in 1996 for the Lightning. The St. Petersburg Times bought the naming rights in 2002. In 2006, the county pledged $35 million in tourist-tax money for renovations to the Times Forum. The team has used only about one-quarter of that. That deal called for the team to pay for renovations and then seek reimbursement. It was eligible for $7 million in repayment the first year, and $2 million annually through 2021 after that. Under the tentative scenario discussed by the team and the county, the deal could be extended through 2027, with annual repayments increasing to $2.5 million in 2015. That could increase the 2006 pledge of $35 million from the county to up to $48.5 million. November 3, 2011 Copyright 2011 MediaVentures Still another name change will happen in Tampa after the St. Petersburg Times announced it would change its name to the Tampa Bay Times on Jan. 1. Times Publishing in 2002 got naming rights to the forum. That contract has now been extended through August 2018, the two companies also announced. The arena will host the Republican National Convention in August 2012. The sponsorship was extended on terms consistent with the current contract, the newspaper said. LIGHTNING OWNER MAY DEVELOP LAND NEAR ARENA April 12, 2012 Copyright 2012 MediaVentures Tampa, Fla. - Tampa Bay Lightning owner Jeff Vinik is part of a group that submitted an offer\nto purchase the financially troubled Channelside Bay Plaza, the entertainment complex that sits adjacent to the Lightning's home, the Tampa Bay Times Forum. The Tampa Tribune said rumors of Vinik's interest have circulated since late last year, given his wealth and the possibilities that would be available to someone who controlled both the Times Forum and the Channelside retail complex. Vinik has garnered a reputation for strong civic involvement since buying the Lightning in 2010. He bankrolled about $40 million in recent renovations at the Times Forum and has been a major donor to area charities. He also owns property next to the Times Forum. \"It is exciting,\" said Tampa Mayor Bob Buckhorn. \"There's a lot of synergy there. It could only be looked upon as an advantage. It would be nice to have someone who has skin in the game.\" Vinik's partners are Andrew Wright, chief executive officer and founder of Franklin Street, one of the fastest-growing commercial real estate firms in Florida; and Anthony Everett, founder and president of Everett Realty Services. He is the son of Tampa real estate icon Toni Everett. Lightning spokesman Bill Wickett confirmed that Vinik is part of the group. He declined to comment further. Wright said, \"We're excited about the opportunity,\" but he declined to say anything more. The amount of the Vinik group's bid was not revealed. Developers designed Channelside as an upscale specialty retail center with restaurants and entertainment when it opened beside the Florida Aquarium in early 2001. The 234,520-square-foot center struggled to boost occupancy during the recession. When listed for sale in April 2011, it was 78 percent occupied, according to real estate data. It's not clear whether anyone else submitted a bid, the newspaper said. The Tampa Port Authority owns the land under the center and has to approve any offer. Charles Klug, counsel for the port, said bank officials will meet to discuss the bids before offers are sent to the port. Before picking a buyer, officials will examine the financial, marketing and business plans of all bidders. Klug said the port prefers a local buyer and it will take about a month to make a selection. If the Tampa Bay Rays leave St. Petersburg, the Channel District has been rumored as a possible location for a new ballpark. Buckhorn agreed. The center is anchored by a 10-screen cinema. But the biggest crowds show up for special events tied to holidays and sports events at the nearby Times Forum, the newspaper said. Many street-side properties are vacant. But the center rallies around businesses such as Splitsville, Stumps Supper Club and Hooters. Passengers from the adjacent cruise ship terminal also spend money at Channelside. Tampa Bay Lightning Expo Hall 1992-1993 Thunderdome 1993-1996 Amalie Arena 1996-Present BALLPARKS.com © 1996-2017 by Munsey & Suppes ."
    },
    {
      "url": "https://www.tampabay.com/features/humaninterest/how-do-you-pronounce-amalie-arena-hint-youre-doing-it-wrong/2327750/",
      "text": "How do you pronounce Amalie Arena? Hint: you’re doing it wrong Search Subscribe Manage profile Donate Log in Log out Menu Close Journalism you trust. Your News. Your Way. Subscribe Support Local Journalism Donate Home Home Log in Log in Log out Log out Search Search Newsletters Newsletters Help chat Help Chat Go to the e-Newspaper Navigation caret Go to the e-Newspaper Subscribers only Featured The Marked Man Buying up the Bay Elections The Housing Experiment Latest News Navigation caret Regions Pinellas Hillsborough Pasco Hernando St. Petersburg Tampa Clearwater Topics Education Business Real Estate Politics Crime Obituaries Navigation caret Weather Navigation caret Sports Navigation caret Bucs Rays Lightning High Schools Bulls Gators Seminoles Viewpoints Navigation caret Life & Culture Navigation caret Things To Do Calendar Food Navigation caret Videos Navigation caret Photos Navigation caret Investigations Navigation caret Connect with us Navigation caret Games & Puzzles Navigation caret Shop Navigation caret Tampa Bay Times Logo The words \"Tampa Bay Times\" written in a Gothic font Hurricane News Sports Viewpoints Life & Culture Food Obituaries Classifieds Today's Paper Newsletters e-Newspaper e-Newspaper Subscribers only Subscribe Advertisement Life & Culture How do you pronounce Amalie Arena? Hint: you’re doing it wrong &#65279;Amalie Arena officials noticed varying pronunciations of the venue and have sent a news release with the correct one. By Christopher Spata Times staff Published | Updated Christopher Spata Enterprise Reporter/Culture MORE FOR YOU Florida Holocaust Museum reopens with giant rescue boat, Elie Wiesel artifacts • History British pub The Moon Under Water finally has a new home • Food Advertisement Lawn tyranny in Tampa Bay’s rainy season | Column • Viewpoints New Italian restaurant coming to Carrollwood, from Cooper’s Hawk group • Food We saw the documentary Hulk Hogan’s son sued Bubba the Love Sponge over • Movies Clearwater Beach icon Pier 60 partially reopens to public • Photos Top events in Tampa Bay for the week of Sept. 8 • Entertainment Doechii, Tampa’s Swamp Princess, announces a hometown concert • Life & Culture Hungry Harry’s celebrates 40 years of Land O’ Lakes barbecue • Food Royal Caribbean plans for new class of ships and private destinations • Florida Advertisement Advertisement Advertisement Tampa Bay Times Logo The words \"Tampa Bay Times\" written in a Gothic font Instagram Facebook Twitter/X Youtube LinkedIn Contact Help Chat Customer Service Submit a News Tip Contact Account Digital access Home delivery Newsletters Manage my account Donate Subscriber FAQ e-Newspaper FAQ e-Newspaper App FAQ About Times Publishing Company About us Connect with us Careers Advertise Times Total Media Media Kit Place an ad Public Notices Classifieds Best of the Best Shop Champa Bay Shop Bucs Hardcover Book Lightning Hardcover Book Photo Reprints Article Reprints Article Licensing Historic Front Pages Meeting Backgrounds More Spotlight News in Education Expos Homes Sponsored Content Special Sections Apps Podcasts Archives © 2025 All Rights Reserved Times Publishing Company Privacy Policy ONLY AVAILABLE FOR SUBSCRIBERS The Tampa Bay Times e-Newspaper is a digital replica of the printed paper seven days a week that is available to read on desktop, mobile, and our app for subscribers only. To enjoy the e-Newspaper every day, please subscribe. Subscribe Log in"
    },
    {
      "url": "https://www.amaliearena.com/premium-experiences/club-seats",
      "text": "Club Seats | Benchmark International Arena Skip to content Accessibility Buy Tickets Search Proud Partner of Newsletter Buy Tickets Menu Events & Tickets Events Calendar Ticket Information Seating Charts Tampa Bay Lightning Terms and Conditions Plan Your Visit Directions & Transportation Parking Arena Dining Hotels Know Before You Go Premium Experiences Hospitality & Suites Club Seats The Concert Club Arena Info About Arena Guide / FAQ Arena Policies ADA/Accessibility Tampa Bay Sports Store News Connect Contact Us Careers Booking Newsletter Signup Media Requests Business Opportunities Lost and Found Search Search Events and Keywords Search Club Seats Get your group so close to the action they are almost a part of it! These ultra-luxurious experiences give your friends, family, and clients VIP access similar to the athletes and entertainers you came to see. Note: Seats on the Benchmark International Club Level do not include all-inclusive food and beverage or VIP parking unless it is specifically The Mark ticket or an Ashley VIP Lounge ticket. Ashley VIP Lounge Ashley VIP Lounge ticket holders are welcomed with a private entrance near the Ashley VIP Lounge and experience world-class game-night amenities with complimentary food and beverages, including cocktails. Ashley VIP Lounge Includes Unlimited upscale dining and beverage options All-inclusive beer, wine, mixed drinks, and soda Concierges to assist you with your game night entertainment needs The Mark access during all Lightning home games Platinum valet service included for Ashley VIP Lounge Bolts For Life Members with four or more Ashley VIP Lounge seats on their account Early entry into every home game, 90 minutes before puck drop For more information about the Ashley VIP Lounge, please call 813.301.6600. The Mark Enjoy all-inclusive food, mixed drinks, beer, wine, and soda, plus VIP parking*. Conduct business, entertain clients, and reward employees. Your clients will enjoy the elegant environment, superior value, and a fun night out. Help drive your business in the most exclusive sports and entertainment arena in all of Florida. *All-inclusive amenities are available only for Lightning home games. No concerts or events. To request an appointment to view premium club options, please email membershipservices@viniksportsgroup.com or call 813.301.6800. The Mark Includes Upscale all-inclusive buffet menu including mixed drinks, beer, wine, and soda throughout the game One VIP parking pass included for every four full-season seats on account Premium club entrance located directly off the west plaza Private Benchmark International Club Level access Early entry into every home game, 90 minutes before puck drop Private, upscale restrooms Concierges to assist you with your game night entertainment needs Diamond Crown Cigar Lounge Suite Ordering Service Place your food and beverage order, prior to the event, for your executive suite in advance to the event with our guest reserve online ordering system. Order Now Events & Tickets Events Calendar Ticket Information Seating Charts Tampa Bay Lightning Terms and Conditions Plan Your Visit Directions & Transportation Parking Arena Dining Hotels Know Before You Go Premium Experiences Hospitality & Suites Club Seats The Concert Club Arena Info About Arena Guide / FAQ Arena Policies ADA/Accessibility Tampa Bay Sports Store News Connect Contact Us Careers Booking Newsletter Signup Media Requests Business Opportunities Lost and Found Benchmark International Arena 401 Channelside Drive Tampa, Florida 33602 813.301.6500 Box Office 813.301.2500 Social © 2025\t\t\t\tTampa Bay Arena, LLC. A Division of Vinik Sports Group. ALL RIGHTS RESERVED. Site Map | Accessibility | Copyright Policy | Privacy Policy | Website Terms | Do Not Sell My Personal Information a carbon house experience"
    },
    {
      "url": "https://www.excellentice-kirkland.com/en/contact-us/",
      "text": "Contact Us | How to reach the team at Excellent Ice Kirkland - Excellent Ice Kirkland | Montreal-Area Arena Skip to content Excellent Ice Kirkland | Montreal-Area Arena GIVE YOURSELF THE EDGE | hockey | skating | rentals | more Login / Register online! Home Info and Rates Expand Facility Information and Rental Rates Our Team Contact Us Refund Policy Privacy Policy Surrey (B.C.) Rink Lark Group (Head Office) Preseason Clinics | Sept 2025 Fall Program 2025 Expand Youth Learn to Skate Programs Youth Hockey Programs with Sean Tilley Perfect Skating™: Dynamic Skating and Skills Adult Hockey Instructionals Leagues Expand Adult PHL Fall/Winter League 2025/26 Stats and Schedules FR Excellent Ice Kirkland | Montreal-Area Arena GIVE YOURSELF THE EDGE | hockey | skating | rentals | more Toggle Menu Login / Register Online Contact Us We are happy to help! Email Contact Us Please enable JavaScript in your browser to submit the form Get in Touch With us We are happy to answer your questions! If you have any questions about our facility or programs, please use the contact form and we will get back to you as soon as you can! You can also email us at info@excellentice-kirkland.com or call us at 514-695-4368 . Administrative Hours Monday – Friday 8:00AM – 4:00PM Located in Kirkland, QC Want to know more? How to reach us By phone Front desk: Phone: 514-695-4368 Fax: 514-426-4539 On the map 2950 rue Edmond Kirkland, QC H9H 5J5 Send a message General inquiries: Info@excellentice-kirkland.com Facebook X Instagram Home About Contact Us Privacy Policy Refund Policy How to reach us 2950 Edmond Kirkland, QC. H9H 5J5 514-695-4368 info@excellentice-kirkland.com © 2025 Excellent Ice Kirkland | Montreal-Area Arena Scroll to top Scroll to top Preseason Clinics | Sept 2025 Fall Program 2025 Toggle child menu Expand Youth Learn to Skate Programs Youth Hockey Programs with Sean Tilley Perfect Skating™: Dynamic Skating and Skills Adult Hockey Instructionals Leagues Toggle child menu Expand Adult PHL Fall/Winter League 2025/26 Stats and Schedules FR"
    },
    {
      "url": "https://www.tampabay.com/news/business/tampa-bay-lightning-plans-major-announcement-this-afternoon/2195910/",
      "text": "Tampa Bay Times Forum has a new name: Amalie Arena Search Subscribe Manage profile Donate Log in Log out Menu Close Journalism you trust. Your News. Your Way. Subscribe Support Local Journalism Donate Home Home Log in Log in Log out Log out Search Search Newsletters Newsletters Help chat Help Chat Go to the e-Newspaper Navigation caret Go to the e-Newspaper Subscribers only Featured The Marked Man Buying up the Bay Elections The Housing Experiment Latest News Navigation caret Regions Pinellas Hillsborough Pasco Hernando St. Petersburg Tampa Clearwater Topics Education Business Real Estate Politics Crime Obituaries Navigation caret Weather Navigation caret Sports Navigation caret Bucs Rays Lightning High Schools Bulls Gators Seminoles Viewpoints Navigation caret Life & Culture Navigation caret Things To Do Calendar Food Navigation caret Videos Navigation caret Photos Navigation caret Investigations Navigation caret Connect with us Navigation caret Games & Puzzles Navigation caret Shop Navigation caret Tampa Bay Times Logo The words \"Tampa Bay Times\" written in a Gothic font Hurricane News Sports Viewpoints Life & Culture Food Obituaries Classifieds Today's Paper Newsletters e-Newspaper e-Newspaper Subscribers only Subscribe Advertisement Business Tampa Bay Times Forum has a new name: Amalie Arena In this file photo, Tampa Bay Lightning owner Jeff Vinik, left, welcomes National Hockey League legend Phil Esposito to say a few words as he's honored with an unveiling of statue as a co-founder of the Tampa Bay Lightning. [OCTAVIO JONES   |   Times (2011)] By Jeff Harrington Former Times Staffer Times Staff Writer Published Jeff Harrington Former Times Staffer Times Staff Writer MORE FOR YOU British pub The Moon Under Water finally has a new home • Food Chassahowitzka River campground will likely stay in public hands • Environment Advertisement Dick’s Sporting Goods completes multibillion-dollar deal to acquire Foot Locker • Business Florida is threatening local transportation like never before, leaders say • Business Former Water Street CEO will now head up Tampa’s Gasworx • Real Estate Florida launches its tax break on guns and ammo Monday • The Buzz on Florida Politics Should more Florida businesses have at-work daycare and other parent perks? • Florida Property insurance companies are thriving now. Are Floridians owed a refund? • Florida A Tampa Brightline could make me a Disney adult | Column • Viewpoints Lucky Tigre has moved to a new restaurant space in Old West Tampa • Food Advertisement Advertisement Advertisement Tampa Bay Times Logo The words \"Tampa Bay Times\" written in a Gothic font Instagram Facebook Twitter/X Youtube LinkedIn Contact Help Chat Customer Service Submit a News Tip Contact Account Digital access Home delivery Newsletters Manage my account Donate Subscriber FAQ e-Newspaper FAQ e-Newspaper App FAQ About Times Publishing Company About us Connect with us Careers Advertise Times Total Media Media Kit Place an ad Public Notices Classifieds Best of the Best Shop Champa Bay Shop Bucs Hardcover Book Lightning Hardcover Book Photo Reprints Article Reprints Article Licensing Historic Front Pages Meeting Backgrounds More Spotlight News in Education Expos Homes Sponsored Content Special Sections Apps Podcasts Archives © 2025 All Rights Reserved Times Publishing Company Privacy Policy ONLY AVAILABLE FOR SUBSCRIBERS The Tampa Bay Times e-Newspaper is a digital replica of the printed paper seven days a week that is available to read on desktop, mobile, and our app for subscribers only. To enjoy the e-Newspaper every day, please subscribe. Subscribe Log in"
    },
    {
      "url": "https://www.ticketmaster.com/amalie-arena-tickets-tampa/venue/106710",
      "text": "Benchmark International Arena - Tampa, FL | Tickets, 2025-2026 Event Schedule, Seating Chart Your browser is not supported. For the best experience, use any of these supported browsers: Chrome , Firefox , Safari , Edge . Skip to main content US United States selected, change country Hotels Sell Gift Cards Help VIP Ticketmaster Home page Concerts Sports Arts, Theater & Comedy Family Cities More Toggle search bar Search Search Sign In/Register Home Tampa, FL Benchmark International Arena Tickets Benchmark International Arena Tickets 401 Channelside Dr, Tampa, FL 33602, US Get Directions (Opens in new tab) Events & Add-Ons Venue Details Seating Chart Discover More All Events and Add-Ons 74 Results All Events and Add-Ons 74 Results Tickets VIP Filter by category All Categories Sports Music Arts & Theatre Miscellaneous Dates All Dates Dates. Change date range: All Dates September 13, 2025 Sep 13 Saturday 08:00 PM Sat 8:00 PM Open additional information for Benson Boone: American Heart World Tour 9/13/25, 8:00 PM Benson Boone: American Heart World Tour Find Tickets Benson Boone: American Heart World Tour 9/13/25, 8:00 PM Lineup Benson Boone Elliot James Reay September 21, 2025 Sep 21 Sunday 08:00 PM Sun 8:00 PM Open additional information for Real Hasta La Muerte 2 Tour 9/21/25, 8:00 PM Real Hasta La Muerte 2 Tour Find Tickets Real Hasta La Muerte 2 Tour 9/21/25, 8:00 PM Add-Ons VIP Backstage Upgrade (No Ticket Included) Real Hasta La Muerte Merchandise Upgrade (No Ticket Included) Real Hasta La Muerte Lounge Upgrade (No Ticket Included) Lineup Anuel AA September 26, 2025 Sep 26 Friday 07:00 PM Fri 7:00 PM Open additional information for Preseason - Tampa Bay Lightning v Carolina Hurricanes 9/26/25, 7:00 PM Preseason - Tampa Bay Lightning v Carolina Hurricanes Find Tickets Preseason - Tampa Bay Lightning v Carolina Hurricanes 9/26/25, 7:00 PM Lineup Tampa Bay Lightning Carolina Hurricanes September 27, 2025 Sep 27 Saturday 07:00 PM Sat 7:00 PM Open additional information for Preseason - Tampa Bay Lightning v Nashville Predators 9/27/25, 7:00 PM Preseason - Tampa Bay Lightning v Nashville Predators Find Tickets Preseason - Tampa Bay Lightning v Nashville Predators 9/27/25, 7:00 PM Lineup Tampa Bay Lightning Nashville Predators October 2, 2025 Oct 02 Thursday 07:00 PM Thu 7:00 PM Open additional information for Preseason - Tampa Bay Lightning v Florida Panthers 10/2/25, 7:00 PM Preseason - Tampa Bay Lightning v Florida Panthers Find Tickets Preseason - Tampa Bay Lightning v Florida Panthers 10/2/25, 7:00 PM Lineup Tampa Bay Lightning Florida Panthers October 4, 2025 Oct 04 Saturday 08:00 PM Sat 8:00 PM Open additional information for Marco Antonio Solís - MAS CERCA DE TI WORLD TOUR 10/4/25, 8:00 PM Marco Antonio Solís - MAS CERCA DE TI WORLD TOUR Find Tickets Marco Antonio Solís - MAS CERCA DE TI WORLD TOUR 10/4/25, 8:00 PM Lineup Marco Antonio Solis October 8, 2025 Oct 08 Wednesday 07:30 PM Wed 7:30 PM Open additional information for The Lumineers: The Automatic World Tour 10/8/25, 7:30 PM The Lumineers: The Automatic World Tour Find Tickets The Lumineers: The Automatic World Tour 10/8/25, 7:30 PM Lineup The Lumineers Chance Peña October 9, 2025 Oct 09 Thursday 07:00 PM Thu 7:00 PM Open additional information for Tampa Bay Lightning vs. Ottawa Senators 10/9/25, 7:00 PM Tampa Bay Lightning vs. Ottawa Senators Find Tickets Tampa Bay Lightning vs. Ottawa Senators 10/9/25, 7:00 PM Lineup Tampa Bay Lightning Ottawa Senators October 11, 2025 Oct 11 Saturday 07:00 PM Sat 7:00 PM Open additional information for Tampa Bay Lightning vs. New Jersey Devils 10/11/25, 7:00 PM Tampa Bay Lightning vs. New Jersey Devils Find Tickets Tampa Bay Lightning vs. New Jersey Devils 10/11/25, 7:00 PM Lineup Tampa Bay Lightning New Jersey Devils October 12, 2025 Oct 12 Sunday 08:00 PM Sun 8:00 PM Open additional information for Ice Cube: Truth to Power - Four Decades of Attitude 10/12/25, 8:00 PM Ice Cube: Truth to Power - Four Decades of Attitude Find Tickets Ice Cube: Truth to Power - Four Decades of Attitude 10/12/25, 8:00 PM Lineup Ice Cube October 22, 2025 Oct 22 Wednesday 07:30 PM Wed 7:30 PM Open additional information for Jonas Brothers: JONAS20 Greetings From Your Hometown 10/22/25, 7:30 PM Jonas Brothers: JONAS20 Greetings From Your Hometown Find Tickets Jonas Brothers: JONAS20 Greetings From Your Hometown 10/22/25, 7:30 PM Lineup Jonas Brothers The All-American Rejects October 23, 2025 Oct 23 Thursday 06:45 PM Thu 6:45 PM Open additional information for Tampa Bay Lightning vs. Chicago Blackhawks 10/23/25, 6:45 PM Tampa Bay Lightning vs. Chicago Blackhawks Find Tickets Tampa Bay Lightning vs. Chicago Blackhawks 10/23/25, 6:45 PM Lineup Tampa Bay Lightning Chicago Blackhawks October 25, 2025 Oct 25 Saturday 05:00 PM Sat 5:00 PM Open additional information for Tampa Bay Lightning vs. Anaheim Ducks 10/25/25, 5:00 PM Tampa Bay Lightning vs. Anaheim Ducks Find Tickets Tampa Bay Lightning vs. Anaheim Ducks 10/25/25, 5:00 PM Lineup Tampa Bay Lightning Anaheim Ducks October 26, 2025 Oct 26 Sunday 05:00 PM Sun 5:00 PM Open additional information for Tampa Bay Lightning vs. Vegas Golden Knights 10/26/25, 5:00 PM Tampa Bay Lightning vs. Vegas Golden Knights Find Tickets Tampa Bay Lightning vs. Vegas Golden Knights 10/26/25, 5:00 PM Lineup Tampa Bay Lightning Vegas Golden Knights October 28, 2025 Oct 28 Tuesday 07:00 PM Tue 7:00 PM Open additional information for Elevation Worship & Steven Furtick - Fall Tour 2025 10/28/25, 7:00 PM Elevation Worship & Steven Furtick - Fall Tour 2025 Find Tickets Elevation Worship & Steven Furtick - Fall Tour 2025 10/28/25, 7:00 PM Lineup Elevation Worship Pastor Steven Furtick October 30, 2025 Oct 30 Thursday 07:00 PM Thu 7:00 PM Open additional information for Tampa Bay Lightning vs. Dallas Stars 10/30/25, 7:00 PM Tampa Bay Lightning vs. Dallas Stars Find Tickets Tampa Bay Lightning vs. Dallas Stars 10/30/25, 7:00 PM Lineup Tampa Bay Lightning Dallas Stars November 7, 2025 Nov 07 Friday 07:00 PM Fri 7:00 PM Open additional information for Lainey Wilson: Whirlwind World Tour 11/7/25, 7:00 PM Lainey Wilson: Whirlwind World Tour Find Tickets Lainey Wilson: Whirlwind World Tour 11/7/25, 7:00 PM Lineup Lainey Wilson ERNEST Drake Milligan November 8, 2025 Nov 08 Saturday 07:00 PM Sat 7:00 PM Open additional information for Tampa Bay Lightning vs. Washington Capitals 11/8/25, 7:00 PM Tampa Bay Lightning vs. Washington Capitals Find Tickets Tampa Bay Lightning vs. Washington Capitals 11/8/25, 7:00 PM Lineup Tampa Bay Lightning Washington Capitals November 10, 2025 Nov 10 Monday 07:30 PM Mon 7:30 PM Open additional information for Bryan Adams: Roll with the Punches w/ guest Pat Benatar & Neil Giraldo 11/10/25, 7:30 PM Bryan Adams: Roll with the Punches w/ guest Pat Benatar & Neil Giraldo Find Tickets Bryan Adams: Roll with the Punches w/ guest Pat Benatar & Neil Giraldo 11/10/25, 7:30 PM Lineup Bryan Adams Pat Benatar & Neil Giraldo November 12, 2025 Nov 12 Wednesday 07:00 PM Wed 7:00 PM Open additional information for Tampa Bay Lightning vs. New York Rangers 11/12/25, 7:00 PM Tampa Bay Lightning vs. New York Rangers Find Tickets Tampa Bay Lightning vs. New York Rangers 11/12/25, 7:00 PM Lineup Tampa Bay Lightning New York Rangers Page 1 of 4 Next page 2 Last page 4 Advertisement Venue Details Benchmark International Arena , 401 Channelside Dr, Tampa, FL 33602, US Get Directions (Opens in new tab) What are the box office phone numbers? (813) 301-2500 Amalie Arena Ticket Office (813) 301-6700 Accessible Seating Line When is the box office open? Day of Event: 3 hours prior to the ticketed time. Hours may vary based on event. Please call (813) 301-2500 for specifics.. What payment types are accepted? Visa, MasterCard, American Express, Discover What are the parking options at Benchmark International Arena? Parking prices vary per event. Visit www.amaliearena.com/parking for more information. Is there accessible seating? This is an accessible venue. For additional information, please visit www.amaliearena.com/arena-info/accessibility. What are the general rules of Benchmark International Arena? For additional information, please visit https://www.amaliearena.com/arena-info/policies or www.amaliearena.com/arena-info/a-z-faq. Are children allowed? For most events, including hockey: Kids 0 to 23 months are free unless otherwise noted. If child has reached their 2nd birthday, they must have a ticket to enter. Childrens policy may vary on some shows, like Disney on Ice. Contact the ticket office for more information. Seating chart Select the event to see the seating chart. Check availability above or on the event page. Benchmark International Arena Tampa Bay Lightning Nine Inch Nails Benson Boone Anuel AA Marco Antonio Solis The Lumineers Ice Cube Jonas Brothers Elevation Worship Lainey Wilson Bryan Adams Nate Bargatze KAYTRANADA Florida State Mens Basketball Christian Nodal Playboi Carti Stevie Nicks Brandy Trans-Siberian Orchestra Ringling Bros. and Barnum & Bailey presents The Greatest Show On Earth PBR: Unleash the Beast Rascal Flatts Fantasia Los Tigres del Norte Tampa Bay Lightning This map doesn't reflect availability Discover More in Tampa Concerts Theater Sports Family Comedy Rock Pop Hip-Hop/Rap Country R&B Latin Baseball Ticketmaster Logo Let's connect (Opens in new tab) (Opens in new tab) (Opens in new tab) (Opens in new tab) (Opens in new tab) Download Our Apps (Opens in new tab) (Opens in new tab) By continuing past this page, you agree to our terms of use Helpful Links Help/FAQ Sell My Account Contact Us Gift Cards Do Not Sell or Share My Personal Information Get Started on Ticketmaster Our Network Live Nation House of Blues Front Gate Tickets TicketWeb universe NFL NBA NHL About Us Ticketmaster Blog Ticketing Truths Ad Choices Careers Ticket Your Event Innovation Friends & Partners PayPal Allianz AWS Our Policies Privacy Policy Cookie Policy Manage my cookies and ad choices © 1999-2025 Ticketmaster. All rights reserved."
    },
    {
      "url": "https://am.ticketmaster.com/bolts/ContactUs",
      "text": "Contact Us | BOLTS Nation Skip to main content Toggle navigation menu close My Events Contact Us My Events Contact Us Ticketmaster Privacy Policy Terms of Use Cookie Policy © 1999-2025 Ticketmaster. All rights reserved. Contact Us ​ Ticket Information: Existing Bolt For Life Season Ticket Member and need help? Please visit th e Membership Services resources page to contact your representative. To learn more about our Bolt For Life Season Ticket Membership and joining the Lightning Priority Access Club , please contact priorityaccess@viniksportsgroup.com . To purchase group tickets of 10 or more, please contact groupsales@viniksportsgroup.com . For general questions about events at Benchmark International Arena, please contact boxoffice@viniksportsgroup.com or visit https://www.benchmarkintlarena.com/events . Ticket Office Hours of Operation: Open 3 hours prior to ticketed event time *Currently open on event days only. Ticket office hours may vary on holidays and during certain events. Hours are subject to change. For more information on: FAQ - https://www.benchmarkintlarena.com/arena-info/a-z-faq Parking - https://www.benchmarkintlarena.com/plan-your-visit/parking Ticket Terms and Conditions - https://www.nhl.com/lightning/arena/terms-and-conditions Type something Ticketmaster Privacy Policy // // Terms of Use // Cookie Policy © 1999-2025 Ticketmaster. All rights reserved."
    },
    {
      "url": "https://www.amaliearena.com/terms-conditions",
      "text": "Copyright Policy | Benchmark International Arena Skip to content Accessibility Buy Tickets Search Proud Partner of Newsletter Buy Tickets Menu Events & Tickets Events Calendar Ticket Information Seating Charts Tampa Bay Lightning Terms and Conditions Plan Your Visit Directions & Transportation Parking Arena Dining Hotels Know Before You Go Premium Experiences Hospitality & Suites Club Seats The Concert Club Arena Info About Arena Guide / FAQ Arena Policies ADA/Accessibility Tampa Bay Sports Store News Connect Contact Us Careers Booking Newsletter Signup Media Requests Business Opportunities Lost and Found Search Search Events and Keywords Search Digital Millennium Copyright Act Notice The websites operated by Tampa Bay Arena, LLC d/b/a Benchmark International Arena (“ TBA ”), including https://www.amaliearena.com/ (together, the “ Websites ”) may permit you and/or other users to submit or post user materials, including written materials, video clips, audio files and/or other audio/visual materials (collectively, “ Submissions ”). You agree to be solely responsible for your Submissions and for any consequences associated with posting or publishing them. In addition, you expressly affirm, represent, and/or warrant that you own or have the necessary licenses, rights, consents, and permissions to use, and authorize TBA to use, such Submissions as contemplated by TBA and the Terms of Use for the Websites. TBA does not tolerate copyright infringing activities on the Websites. However, TBA does not monitor Submissions for copyright infringement. TBA abides by the federal Digital Millennium Copyright Act (“ DMCA ”) by responding to notices of alleged infringement that comply with the DMCA and other applicable laws. As part of our response, we will remove any Submissions if properly notified that such Submissions infringe on another’s intellectual property rights (see below for notice requirements). In addition, TBA reserves the right to remove Submissions without prior notice. TBA will also terminate a user’s access to the Websites if he or she is determined to be a repeat infringer. A repeat infringer is a user who has been notified of infringing activity more than twice and/or has had Submissions removed from the Websites more than twice. Takedown Notice . If you are a copyright owner or an agent thereof and believe that any Submissions or other content infringe upon your copyrights, you may submit a notification pursuant to the DMCA by providing our Copyright Agent with the following information in writing (see 17 U.S.C. 512(c)(3) for further detail): A physical or electronic signature of a person authorized to act on behalf of the owner of an exclusive right that is allegedly infringed; Identification of the copyrighted work claimed to have been infringed, or, if multiple copyrighted works at a single online site are covered by a single notification, a representative list of such works at that site; Identification of the material that is claimed to be infringing or to be the subject of infringing activity and that is to be removed or access to which is to be disabled and information reasonably sufficient to permit the service provider to locate the material; Information reasonably sufficient to permit the service provider to contact you, such as an address, telephone number, and, if available, an electronic mail; A statement that you have a good faith belief that use of the material in the manner complained of is not authorized by the copyright owner, its agent, or the law; and A statement that the information in the notification is accurate, and under penalty of perjury, that you are authorized to act on behalf of the owner of an exclusive right that is allegedly infringed. TBA's designated Copyright Agent to receive notifications of claimed infringement is: Copyright Agent, 401 Channelside Drive, Tampa, FL 33602, e-mail: Copyrightagent@viniksportsgroup.com . For clarity, only DMCA notices (Takedown and Counter Takedown) should go to the Copyright Agent; any other feedback, comments, requests for technical support, and other communications should be directed to TBA's customer service at adminassist@viniksportsgroup.com . You acknowledge that if you fail to comply with all the requirements of this section, your DMCA notice may not be valid. Counter Takedown Notice . If you believe that your Submissions that were removed (or to which access was disabled) are not infringing, or that you have the authorization from the copyright owner, the copyright owner's agent, or pursuant to the law, to post and use the material in your Submissions, you may send a counter takedown notice containing the following information to the Copyright Agent: Your physical or electronic signature; Identification of the Submissions that have been removed or to which access has been disabled and the location at which the Submissions appeared before they were removed or disabled; A statement that you have a good faith belief that the Submissions were removed or disabled as a result of mistake or misidentification of the Submissions; and Your name, address, telephone number, and e-mail address, a statement that you consent to the jurisdiction of the United States District Court for the district in which your address is located, or, if you live outside the United States, for the Middle District of Florida, where TBA is located, and a statement that you will accept service of process from the person who provided notification of the alleged infringement. If a counter takedown notice is received by the Copyright Agent, TBA may send a copy of the counter takedown notice to the original complaining party informing that person that it may replace the removed Submissions or cease disabling them in 10 business days. Unless the copyright owner files an action seeking a court order against the Submissions provider, member or user, the removed Submissions may be replaced, or access to it restored, in 10 to 14 business days or more after receipt of the counter takedown notice, at TBA's sole discretion. facebook Follow instagram Follow twitter Follow Events & Tickets Events Calendar Ticket Information Seating Charts Tampa Bay Lightning Terms and Conditions Plan Your Visit Directions & Transportation Parking Arena Dining Hotels Know Before You Go Premium Experiences Hospitality & Suites Club Seats The Concert Club Arena Info About Arena Guide / FAQ Arena Policies ADA/Accessibility Tampa Bay Sports Store News Connect Contact Us Careers Booking Newsletter Signup Media Requests Business Opportunities Lost and Found Benchmark International Arena 401 Channelside Drive Tampa, Florida 33602 813.301.6500 Box Office 813.301.2500 Social © 2025\t\t\t\tTampa Bay Arena, LLC. A Division of Vinik Sports Group. ALL RIGHTS RESERVED. Site Map | Accessibility | Copyright Policy | Privacy Policy | Website Terms | Do Not Sell My Personal Information a carbon house experience"
    },
    {
      "url": "https://www.amaliearena.com/arena-info/a-z-faq",
      "text": "Arena Guide / FAQ | Benchmark International Arena Skip to content Accessibility Buy Tickets Search Proud Partner of Newsletter Buy Tickets Menu Events & Tickets Events Calendar Ticket Information Seating Charts Tampa Bay Lightning Terms and Conditions Plan Your Visit Directions & Transportation Parking Arena Dining Hotels Know Before You Go Premium Experiences Hospitality & Suites Club Seats The Concert Club Arena Info About Arena Guide / FAQ Arena Policies ADA/Accessibility Tampa Bay Sports Store News Connect Contact Us Careers Booking Newsletter Signup Media Requests Business Opportunities Lost and Found Search Search Events and Keywords Search Arena Guide ADA and Accessibility Information ADA / Accessibility Info Advertising Opportunities More Info on Advertising Opportunities Bars There are bars located at sections: Tito’s Bar (101) New Amsterdam Bar (110) Jai Alai Bar (116) Truly Bar (122) Corona Cove (124) Proper No. Twelve Bar (130) Belle Glos Wine Bar (206) Cigar City Bar (211) Casamigos Bar (216) Cutwater Bar (307) Milagro Bar (321) Coors Between the Pipes (325) Budweiser Biergarten (304/328) There are also portable beer vendors located all around the concourses. Baby-Changing Stations There are Baby Changing Stations in all restrooms on the Promenade, Club, and Terrace levels. Additionally, there are baby changing stations on the IOA Suite level in the restrooms across from Suites 31 and 64. There is also a Nursing Mothers Room between section 129 and 130. Bag Policy Arena Policies Bag Searches For special events and concerts, bags that are permitted inside the venue will be subject to a search by staff. Guests with prohibited items will be asked to return them to their vehicle prior to entering the venue. Banners and Signs Regular poster size signs or smaller are permitted in Benchmark International Arena. Large banners, signs on poles or sticks of any kind or signs with inappropriate language will not be permitted. Signs may not be hung or posted anywhere inside the venue. Please be aware of your surroundings and do not block the view of any guests. This policy may vary for all events. Behind-The-Scenes GameDay Tours Bicycle Valet and Parking There is no available bicycle parking on Benchmark International Arena property, however, we offer a complimentary bike valet service at all ticketed events. You can valet your bike with our plaza team on Ford Thunder Alley.  Bike Valet is located behind Corona Bolts Bay during Lightning games and in front of the Pam Iorio Parking Garage, adjacent to Cigar City Tap Room for events. Valeted bikes must be picked up no later than 30 minutes after the completion of the event. Bikes that are not picked up in this time frame will be relocated to Security. Bottles and Containers Patrons are permitted to bring an empty water bottle to be filled at one of our water drinking stations. Patrons are not permitted to bring any other type of bottles or containers into Benchmark International Arena, at any time. Policy is subject to change per each tour's request. Box Office Ticket Information Camera Policy Arena Policies Child’s Ticket Policy Arena Policies Code of Conduct Benchmark International Arena FAN CODE OF CONDUCT Last Updated and Effective Date – December 11, 2020 Vinik Sports Group (VSG) is committed to providing a safe, comfortable, and enjoyable experience for our fans and guests at Benchmark International Arena, and VSG is committed to providing courteous and professional service. Everyone is welcome in our Arena and should expect and help to promote an environment where people are treated in a courteous, professional, considerate, and respectful manner by all fans, arena staff, team and event personnel, performers, players, and other guests. Accordingly, VSG has a zero-tolerance policy towards acts of racism of any kind and will not tolerate unsafe, abusive, unlawful, or offensive conduct in the Arena. This conduct includes, without limitation: Smoking (including e-cigarettes or vaporizers); Violence, fighting, threatening, taunting, physical or verbal harassment; Making abusive, sexist, racist, offensive or obscene remarks or gestures; Disruptive, harmful or disorderly behavior; Sitting in a location other than the seat identified on the guest’s ticket; Any disruption of the game or event by a guest’s actions; Throwing objects of any kind or entering the playing surface or performance area; Intoxication or any signs of impairment related to alcohol or drug consumption; Possession of alcohol by a minor or providing alcohol to a minor; Possession of alcohol not purchased inside the Arena or on Arena grounds (e.g., plazas, outside bars); Engaging in any commercial activity not authorized by VSG; Failure to comply with requests from staff, including those related to Arena policies, operations, or emergency response procedures; or Any act which, in the opinion of Arena officials, presents a risk to the safety of fans or staff. Failure to abide by this Fan Code of Conduct is subject to sanctions at the discretion of VSG, which may include, without limitation, ejection without refund, suspension of entry privileges, arrest, and banishment from any or all VSG facilities. Season ticket members and suite holders are reminded that they are responsible for the behavior of anyone using their tickets and that failure to abide by this Fan Code of Conduct by suite holders, Tampa Bay Lightning season ticket members, or by anyone using their tickets, may result in loss of season ticket member or suite holder privileges. All guests are reminded that bottles, coolers, and containers of any kind are not allowed into Arena and may be confiscated; provided, however, that fans will be allowed to bring an empty plastic bottle to fill with water at the Arena’s touchless water bottle filler. VSG reserves the right to limit the size of bags, purses or backpacks permitted within the Arena. Guests are advised to consult the Arena websites for specific policies with respect to bags. VSG reserves the right to prohibit the entry of items which may, in VSG’s sole opinion, interfere with the ability of other guests to enjoy the game or event. Arena staff have been trained to intervene when necessary to help ensure a safe and comfortable environment. Guests are encouraged to report any violations of this Fan Code of Conduct or any inappropriate behavior to the nearest usher, security guard or fan services staff member. VSG thanks you for adhering to this Fan Code of Conduct and for making each event special and memorable to you and your fellow guests. Concessions and Arena Dining Concessions Info Door Opening Times Door opening times may vary depending on the type of event, typically 60-90 minutes before show time. Normally doors will open for a Tampa Bay Lightning game 60 minutes prior to puck drop. Doors for the Benchmark International Club Level, Ashley VIP Lounge and Executive Suite guests will open 90 minutes prior to the start of the game. All other events are subject to releasing a door time. All scheduled times are subject to change without notice. Elevators Accessibility Info Emergency Information In the event of an emergency, Benchmark International Arena staff will provide instructions and direct guests to the closest emergency exit. Please follow the instructions of the staff and proceed in a calm and safe manner. Guests should use the stairwells as a means of evacuation. Elevators and escalators may not be working at the time of an evacuation. The best way to be contacted during an event at Benchmark International Arena is to set your cell phone to vibrate. We do not page guests during an event. Our Security Office can be contacted at 813.301.6770 . Your section, row and seat number will be needed to contact you in the case of an emergency. Family Restrooms For your convenience, Benchmark International Arena has two family restroom facilities; located behind sections 208 and 326. The family restrooms are equipped with all your standard toiletries and include a baby-changing table. First Aid In the case of an emergency, we have two First Aid rooms located at Benchmark International Arena; one across from section 112 and one across from section 312. Medical services are provided by the Tampa Fire Department. If you are unable to reach one of these areas please notify the nearest Benchmark International Arena employee for assistance. Food and Beverages Brought to Benchmark International Arena Guests may not bring food and/or beverages into Benchmark International Arena, at any time except for medical purposes. Guests must dispose of the unauthorized items prior to entrance into Benchmark International Arena. Guests with specific/special dietary needs due to medical conditions or religious requirements should contact Benchmark International Arena at 813.301.6545 . Guest Services Guest Services is located on the main concourse across from section 101. Guest Services Representatives are available to assist you with any needs on game and event nights. Please stop by at any time for information regarding Benchmark International Arena events, directions, or assistance involving the programs listed below. There are also Guest Services Representatives located throughout the arena. Medical Assistance (located at 112 & 312 provided by Tampa Fire Rescue) Wheelchair Escorts Family Restrooms (located at 208 & 326) Disabled Drop-Off Item Check-In Area Assisted Listening Devices Sensory Bags presented by Johns Hopkins All Children's Hospital Lost and Found If you lose an item during an event at Benchmark International Arena,  please visit Guest Services located across from Section 101. After an event, contact Lost and Found during business hours at 813.301.6502 or email lostandfound@viniksportsgroup.com with a description of the item and the date the item was lost. If an item is turned in that matches your description, you will be contacted to verify details of the item. Driver's licenses, credit and debit cards will be held for 48 hours and then destroyed. All other unclaimed items will be held for 14 days and then discarded or donated. Benchmark International Arena management assumes no responsibility for items lost at events. Media Access For concerts and events, please use the media credential request form . Media requesting accreditation for specific sporting events should contact the respective teams directly. Please note that each team has separate credentialing criteria. Medical Emergencies In the case of an emergency, we have two First Aid rooms located at Benchmark International Arena; one across from section 112 and one across from section 312. Medical services are provided by the Tampa Fire Department. If you are unable to reach one of these areas please notify the nearest Benchmark International Arena employee for assistance. Nursing Mothers Room There is a Nursing Mothers Room between sections 129 and 130. Parking & Transportation Parking Downtown Developments + Transportation Prohibited Items Arena Policies Questions, Comments and Complaints If you have any questions, please submit them through the online \"Contact Us\" page . During games and events, you can go to Guest Services located across from section 101 or any Concierge desk. Re-entry Policy Arena Policies Refunds or Exchanges Ticket Information Restrooms Men’s and Women’s Restrooms are located at the following locations: Promenade Level 103 Men’s 106 Men’s and Women’s 110 Men’s and Women’s 114 Women’s 118 Men’s 122 Men’s and Women’s 126 Men’s and Women’s 129 Women’s Club Level 203 Men’s and Women’s 208 Family Restroom 212 Men’s and Women’s Terrace Level 303 Men’s and Women’s 306 Women’s 311 Men’s 314 Men’s and Women’s 318 Men’s and Women’s 321 Women’s 326 Men’s 328 Family Restroom 329 Men’s and Women’s Security Benchmark International Arena is committed to providing a safe and enjoyable experience for all of our guests. If you need assistance, please contact one of our Guest Service team members or you can visit Guest Services across from section 101. Service Animals All service animals are permitted in Benchmark International Arena. Smoking Policy Arena Policies Strollers Strollers are permitted in Benchmark International Arena. If you have a collapsible stroller you may fold it up and place it under your seat. If not, you can check in your stroller at Guest Services across from section 101. Weapons Arena Policies Official Commercial Cleaning Sponsor More Info Events & Tickets Events Calendar Ticket Information Seating Charts Tampa Bay Lightning Terms and Conditions Plan Your Visit Directions & Transportation Parking Arena Dining Hotels Know Before You Go Premium Experiences Hospitality & Suites Club Seats The Concert Club Arena Info About Arena Guide / FAQ Arena Policies ADA/Accessibility Tampa Bay Sports Store News Connect Contact Us Careers Booking Newsletter Signup Media Requests Business Opportunities Lost and Found Benchmark International Arena 401 Channelside Drive Tampa, Florida 33602 813.301.6500 Box Office 813.301.2500 Social © 2025\t\t\t\tTampa Bay Arena, LLC. A Division of Vinik Sports Group. ALL RIGHTS RESERVED. Site Map | Accessibility | Copyright Policy | Privacy Policy | Website Terms | Do Not Sell My Personal Information a carbon house experience"
    },
    {
      "url": "https://arenagroup.com/usa/contact/",
      "text": "Contact Arena Group USA | Get in Touch with Our Team Contact | Arena Americas Contact MENU Products & Services Tent Structures Custom Structures Flooring & Seating Solutions Graphic Printing Design / Manufacturing Well Dressed Tables Event Types & Applications Sporting Live Event Temporary Facility Solutions Solutions & Innovations About Us Team News & Insights Contact CALL: (800) 383-6332 Arena Group Arena UK & Europe Arena Middle East Arena Asia Let's get started It’s time to bring your space to life. Let us know how we can help! Contact us today for a quick response. CALL: (800) 383-6332 EMAIL: Send a message First Name * Last Name * Email * Phone City State AK AZ AR CA CO CT DE FL GA HI ID IL IN IA KS KY LA ME MD MA MI MN MS MO MT NE NV NH NJ NM NY NC ND OH OK OR PA RI SC SD TN TX UT VT VA WA WV WI WY What can we help you with? Get a quote Career opportunities Planning and event Other Message Preferred Method of Contact: Email Phone Subscribe for epic event advice and insights. SUBMIT Please do not fill in this field. 1 2 3 4 5 6 To extend our reach throughout the United States, Arena Americas maintains branch locations in addition to our corporate headquarters. 1 Corporate 10861 S. Howell Ave. Oak Creek, WI 53154 (414) 831-7000 (800) 383-6332 2 Design & Manufacturing 10861 S. Howell Ave. Oak Creek, WI 53154 (414) 831-7000 (800) 383-6332 3 New York/New Jersey 71 Central Ave. Kearny, NJ 07032 (800) 383-6332 4 Ft. Irwin 48245 Ft. Irwin Rd. Barstow, CA 92311 (800) 383-6332 5 Shaffer Sports & Events 10901 Tanner Rd. Houston, TX 77041 View Website 6 Florida / Southeast 8500 Parkline Blvd. Ste. 110 Orlando, FL 32809 (407) 297-1165 (800) 383-6332 Global OVER 250 YEARS OF EXPERIENCE AND ICONIC EVENTS AROUND THE GLOBE With over 250 years of experience, Arena is a leading innovator in the design and build of temporary architecture and integrated event solutions. Globally. Arena Group is headquartered in the UAE with offices in the USA, UK, Dubai, Abu Dhabi, Saudi Arabia, Malaysia, and Korea. GLOBAL HEADQUARTERS Arena Group 1802 Arenco Tower, Dubai, UAE PO Box 114384 +971 (4) 252 9656 Explore Our Family Of Companies About Us Contact Arena Group © 2023 Arena Americas. All rights reserved. Privacy Policy Code of Conduct General Web Site Terms and Conditions of Use We use cookies to ensure that we give you the best experience on our website. If you continue to use this site we will assume that you are happy with it. Accept"
    },
    {
      "url": "https://www.nhl.com/lightning/team/front-office",
      "text": "Official Tampa Bay Lightning Website | Tampa Bay Lightning Skip to Main Content Tickets News Photos Podcasts Video Navigation Menu Schedule Community Team Team Roster Third Jersey Ownership, Front Office Hockey Ops and Coaching Staff Lightning Affiliates Transactions Stats Standings Fans Benchmark International Arena Shop Youth Hockey NHL.com Ownership, Front Office Ownership, Front Office 2024-25 Media Guide Hockey Ops and Coaching Staff Lightning Affiliates Transactions Jeff Vinik: Chairman and Governor Jeff Vinik purchased the Tampa Bay Lightning on March 3, 2010, promising a comprehensive transformation of the franchise while pledging to make a significant positive impact in the Tampa Bay community, and he has delivered. remove add Read More Upon acquiring the Lightning, Vinik vowed to make the organization âworld-class,â creating an unrivaled fan experience while putting together a team of which Tampa Bay sports fans would be proud, on and off the ice. Vinik and his franchise became Stanley Cup Champions on September 28, 2020 when the Lightning defeated the Dallas Stars in six games after spending 65 days in the pandemic-induced NHL âBubble.â The Lightning repeated the feat becoming only the second team since the turn of the century to go back-toback after downing the Montreal Canadiens in five games to capture a second-consecutive Stanley Cup on July 7, 2021. The Lightning returned to the Stanley Cup Final for the third season in a row in June of 2022 where they fell to the Colorado Avalanche in six games. As Vinik enters his 14th year of ownership, the Lightning are recognized nationally as one of the top organizations in North American sports, having appeared in the National Hockey Leagueâs Eastern Conference Final/Stanley Cup Semifinal seven times (2011, 2015, 2016, 2018, 2020, 2021 & 2022), advancing to the Stanley Cup Final four times (2015, 2020, 2021 & 2022), and winning hockeyâs ultimate prize in 2020 and 2021. Off the ice, the Lightning brand has been completely revitalized and transformed, having been lauded by both ESPN as the No. 1 team in professional sports in the media giantâs Ultimate Standings (also ranking in the Top 10 in six of seven years), as well as by the Sports Business Journal as one of five finalists for Team of the Year in 2016, 2020, and 2022, earning that title in 2022. Benchmark International Arena has sold out 373 consecutive games (includes playoffs) entering the 2024-25 season, the NHLâs longest active sellout streak which began on 3/26/15 (2020-21 season excluded due to social distancing protocols). Vinik now sits as a member of the Executive Committee of the National Hockey Leagueâs Board of Governors. In executing his plan to bring a world class franchise to life in Tampa Bay, Vinik has invested more than $100 million in private funding into the publicly owned Benchmark International Arena to create a guest-first facility recognized as one of the finest in the NHL. Additionally, under the umbrellas of the Vinik Family Foundation and the Lightning Foundation, Jeff and his family have invested nearly $40 million in Tampa Bay area charities through a variety of programs and donations, the most notable being the Lightning Community Heroes program, in which $50,000 is donated to worthy individuals and their non-profits of choice at each Bolts home game. Through the 2023-24 season, more than $30 million has been donated through the Community Heroes program to more than 750 local non-profits. The Lightningâs success under Vinik has coincided with the emergence of a development company, Strategic Property Partners (SPP), LLC and its plan to develop approximately 60 acres in downtown Tampaâs south core into a new district entitled Water Street Tampa. SPP, a partnership between Vinik and Cascade Investment, LLC of Kirkland, Washington, is developing a $3 billion investment to bring Water Street Tampa to life and reinvent the blocks surrounding Benchmark International Arena into a walkable, 24-7 live-work-play wellness district. With construction of Phase 1 complete and Phase 2 on the immediate horizon, the district includes a School of Medicine for the University of South Florida, corporate office buildings, three Marriott hotel properties, residences, retail, restaurants, entertainment, and improved infrastructure. Vinik remains an advisor on the project as they continue to plan for future phases. Vinik is also the impetus behind Embarc Collective, an innovation hub which opened in downtown Tampa in 2019. Embarc formally brings together startup companies, venture capitalists, academic resources, and startup-focused partners in a central physical hub to help open opportunities, inspire iteration, push progress, and put Tampa Bay on the map as a prime destination for diverse startup talent to make an impact. The Vinik family has directly contributed to several local non-profits, including the Florida Aquarium, Tampa Museum of Art, the United Way of Suncoast, Feeding Tampa Bay, Metropolitan Ministries and Tampa Preparatory School and Jeff served as the Chairman of the American Heart Associationâs 2018 Tampa Bay Heart Walk. In August of 2018, the Viniks helped cut the ribbon on the $2.5 million Jeff and Penny Vinik Family Winston Park Boys and Girls Club in east Tampa. The Viniks donated $1 million to relief efforts after Hurricane Harvey struck the state of Texas and another $4 million (through the Lightning Foundation) after Hurricanes Irma, Helene and Milton devastated much of the state of Florida. In September 2017, the University of South Floridaâs Muma College of Business renamed its dual degree sport-focused graduate program the Vinik Sport and Entertainment Program, a result of Vinikâs support of the University and this field of study. In 2018, through the Vinik Family Foundation and partnership with the University of Floridaâs Lastinger Center, the Viniks dontated $6 million to launch the Hillsborough Early Learning Network (HELN). Through the development of this workforce and training program for early learning educators, nearly 1,500 teachers and over 400 directors in Hillsborough County have been empowered through tailored professional learning, strengthening the early childhood workforce during a pivotal time and benefiting more than 16,000 children. Through strategic collaboration, HELN has leveraged more than $94 million in private and public funds to expand HELNâs reach throughout the state of Florida. After growing up in New Jersey and attending high school at Riverdale Country School in New York City, Vinik graduated from Duke University (1981) with a Bachelor of Science degree in Engineering and Economics. He went on to earn his Master of Business Administration degree from the Harvard Business School, graduating in 1985. Vinik was awarded Duke Universityâs Distinguished Young Alumni Award in 1994, and he later served on the Duke University Board of Trustees. In May 2012, the family made a $10-million donation to Duke to establish a faculty challenge fund that is being used to hire and retain professors who focus on complex societal challenges such as engineering and related areas in energy, global health, brain sciences, and the environment. In addition to his primary business interests in Tampa Bay, Vinik maintains interests in several other entities, including aXiomatic, a Los Angeles-based esports and gaming company of which he is co-executive chairman. Founded in September of 2016, aXiomatic is the majority owner of the Team Liquid franchise, a stalwart esports franchise, which won DOTA2âs The International 2017 and secured back-toback North American championships in 2018 for League of Legendsâ North American League Championship Series. Jeff resides in South Tampa and has four children: Danny, Jared, Kyra, and Joshua. Doug Ostrover: Owner Doug Ostrover is Co-Chief Executive Officer of Blue Owl Capital Inc. and the chairman of the firmâs Board of Directors. Doug is actively involved in a variety of non-profit organizations including serving on the boards of directors of the Michael J. Fox Foundation and the Mt. Sinai Health System. He also serves on the investment committee of the Brunswick School. Doug received an MBA from New York University Stern School of Business and a BA in Economics from the University of Pennsylvania. Marc Lipschultz: Owner Marc Lipschultz  is Co-Chief Executive Officer of Blue Owl Capital Inc. and a member of the firmâs Board of Directors. Marc is actively involved in a variety of non-profit organizations, serving as a board member of the American Enterprise Institute for Public Policy Research, Michael J. Fox Foundation, Mount Sinai Health System, Riverdale Country School, Stanford University Board of Trustees, and the 92nd Street Y. Marc received an MBA from Harvard Business School and an AB from Stanford University. Steve Griggs: Chief Executive Officer/Vice Chairman Steve Griggs assumed the role of Chief Executive Officer of Vinik Sports Group on July 24, 2015. His role was elevated to the position of Vice Chairman in 2024. remove add Read More Steve Griggs assumed the role of Chief Executive Officer of Vinik Sports Group on July 24, 2015. His role was elevated to the position of Vice Chairman in 2024. Griggs oversees all of Vinik Sports Groupâs divisions, inclusive of VSG Live, VSG Commercial Sales, and VSG Facilities, leading all business operations for several influential brands, comprising of the Tampa Bay Lightning, Benchmark International Arena, USF Athletics, Yuengling Center, Tampa Bay Sports retail and more. Under his leadership, the Lightning have achieved unprecedented success, including winning back-to-back Stanley Cups in 2020 and 2021 and being named the 2022 Sports Business Journal Team of the Year. Griggs is also known for his work in the community, including spearheading the Community Hero program and the Vinik Sports Groupâs CHARGE volunteer program and for his efforts to grow the game of hockey and teach life skills to youth in the Tampa Bay community. A veteran of the sports and entertainment industry, Griggs has also worked for Maple Leaf Sports and Entertainment, the Minnesota Wild, and the Orlando Magic playing an instrumental role in opening new venues in all three locations. Senior Management Chairman and Governor Jeff Vinik Chief Executive Officer/Vice Chairman Steve Griggs Chief Financial Officer Casey Rodgers Chief Venue Officer Kevin Preast Chief Commercial Officer Chris Overholt Executive Vice President, Corporate & Community Development Derrick Brooks Executive Vice President of Community Development and Social Impact Elizabeth Frazier Senior Vice President of Ticket Sales and Service Travis Pelleymounter Senior Vice President of Legal and Business Affairs Jay Feaster Senior Vice President of People Operations Nicole Parente Vice President of Corporate and Community Affairs Dave Andreychuk Vice President of Corporate Relations Phil Esposito Senior Vice President of Game Presentation John Franzone Vice President of Premium Seating and Group Sales Matt Hill Vice President of Facility Operations/Assistant General Manager Benchmark International Arena Rhett Blewett Vice President of Partnership Development and Activation Sheri Anderson Vice President of Communications & Content Brian Breseman Vice President of Event Management Kelli Yeloushan Vice President of Marketing Andrea Murphy Vice President of Venue & Capital Projects Joseph Jackson Vice President of Technology & Innovation Mark Bunn Senior Manager of Business Operations Chris Norman Executive Assistant Charlene Beverly Executive Assistant Stephanie LaRussa Arena Management Senior Director of Facility Services, Assistant General Manager Yuengling Center Jason Gibson Director of Security & Transportation Services Tripp Turbiville Director of Facilities Steve Butler Senior Manager of Engineering Tom Dacey Assistant Manager of Engineering Frank Welland Executive Producer/USF Digital Network Darek Sharp Sr. Manager, Facility Services Brandon Miller Facility Services Shift Manager Tina Such Facility Services Shift Manager Jay Lynch Facility Services Shift Manager Marco Bernardo Facility Services Shift Manager, Yuengling Center Jesse Heilman Facility Services Shift Supervisor Mathew Bromley Facility Services Shift Supervisor Anthony Flores Facility Services Shift Supervisor Jamaal Black Facility Services Shift Supervisor Logan Cohen Facility Services Shift Supervisor Kevin Losier Facility Services Shift Supervisor Robin Moye Facilities Services Shift Supervisor Vinny Maguire Supervisor of Facility Services, Yuengling Center Gabriel Hance Manager, Ice Operations Patrick Jesso Assistant Manager, Ice Operations Alison Murdock Manager of Security & Transportation Services Kelvin Alexander Manager of Security & Transportation Services Kevin Eshleman Manager of Security & Transportation Services Sean Allaster Safety & Security Supervisor Lincoln Parker Overnight Safety & Security Supervisor Anthony Caruana Overnight Safety & Security Supervisor Dustin Hancock Shipping Coordinator Angelina Evans General Facilities Mantenance Technician Elvis Delfi Crew Lead Bernice Robinson Crew Lead Sherrisse McCray Engineer Jesse Alvarez Engineer James Carpenter Building Engineer, Yuengling Center Wayne Letson Electrician Austin White Electrician John Schuiteboer Electrician William Jamrozik Carpenter Benjamin Von Kaenel Carpenter Billy Dowling HVAC Technician Justin Phillips HVAC Technician Marcus Vaughn HVAC Technician Timothy Jurinski HVAC Technician Tyree Boone Painter Gregg Finelli Painter Gary Merentie Plumber Daniel Lynn Plumber Dale Reneau Events Director of Event Marketing Angela Lanza Director of Event Services Kerry Allen Senior Manager of Booking and Venue Scheduling Samantha Diaz Manager, Event Marketing Kelsey Coary Manager, Booking Joe Maury Manager, Event Services Kevin Eastman Manager, Event Services Robert Peavy Event Coordinator Ka mryn Canova Event Coordinator Derek Righetti Event Marketing Coordinator Madison Burgner Lightning Vision Director of Game Presentation Stephen Frey Director of Video and Media Production Gabriel Marte Sr. Manager, Production Operations Felicia Sablan Sr. Motion Graphics Designer Matthew Zipper Senior Video Coordinator Tyler Flood Senior Video Coordinator Michael O'Halloran Video Coordinator Anthony Carusone Video Coordinator Isaiah Breeding Video Coordinator Jon Hayes Motion Graphics Coordinator Adriana Dothe Motion Graphics Coordinator Mitchell Funk Display Systems Coordinator Dorian Bural Broadcast TV Analyst Dave Randorf TV Analyst Brian Engblom TV Analyst Bobby Taylor Radio Play-by-Play Announcer Dave Mishkin Radio Color Commentator Phil Esposito Sr. Manager, Broadcast Steve Versnick Broadcast Assistant Jared Johnston Technology & Innovation Director of Technology Services Jay Young Director, DevOps & Data Engineering Rick Gepilano Technical Production Manager Hunter Perkins Sr. Software Engineer Evan Lutins Audio Engineer Kian Boyd Audio Engineer Madison Keefer Audio Engineer Dave Dluger Audio Engineer Kyle Davis Production Systems Engineer Pete Marinake Data Engineer Eric DiGioacchino Software Developer Elisabeth Slota Systems Administrator Jim Gray Service Desk Analyst Jared Shollenberger IT Network Administrator Brennan Bialt IT Network Technician Adam Jordan Lightning Foundation and Community Relations Director, Lightning Foundation & Community Events Sarah Costello Sr. Coordinator, Foundation, Community Relations & Social Impact Samantha Bell Sr. Coordinator, Community Relations & Social Impact Caitlin O'Halloran Coordinator, Community Relations & Social Impact Kathleen McMahon Lightning Foundation Coordinator Tim Sullivan Community Relations Representative Brian Bradley Hockey Development Alumni Jassen Cullimore Director, Community Hockey Josh Dreith Hockey Development Alumni Mathieu Garon Manager, Community & Hockey Development Aaron Humphrey Manager, Community & Hockey Development Jordan McKenzie Community & Hockey Development Coordinator Alec Zec Community & Hockey Development Coordinator Charles Jensen Community & Hockey Development Coordinator Gloria Smith Community & Hockey Development Coordinator Jamie Tremblay Hockey Development Coach Kelley Steadman Partnership Development and Activation Director, VSG Properties and Engagement Shannon Savoie Director, Partnership Marketing and Activation Trent Patterson Director, Partnership Development Tom Severino Director, Partnership Strategy & Insights Michael Braunfeld Sr. Manager, Partnership Development Chris Walker Sr. Manager, Partnership Development Joe Rizzo Sr. Account Manager, Partnerships Will Kent Account Manager, Partnerships Carmela Wassmer Account Manager, Partnerships Kimberly Pettit Account Manager, Partnerships Peyton Finley Account Executive, Partnerships Kevin Alwell Account Manager, Partnerships Mary Beth Briers Sr. Account Coordinator, Partnerships Jenna Kidd Account Coordinator, Partnerships Nathan Zucker Analyst, Partnership Strategy & Insights Maggie DePhillips Executive Suite Sales Director of Business Development Adam Laws Director, Suite & Loge Services Toni Connor Director, Corporate Hospitality Erin Wilson Manager, Loge Services Genie Santarpio Manager, Suite Services Wesley Kozil Finance Sr. Director, Corporate Finance Molly Duffey Director, Accounting Chris Ryba Manager of Corporate Finance Ohmar Wynn Manager of Accounting Brian Bartell Accounts Payable Manager Rhonda Carswell Manager, Hockey & Event Finance CJ Tyler Sr. Staff Accountant R.J. Campbell Sr. Staff Accountant Tori Stanek Sr. Tax Accountant Regan Dabbs Staff Accountant Rebecca McMorrow Financial Analyst Riley Lamon People Operations Director of Training & Experience Susan Danielik Director, People Operations Miriam King Sr. Manager, Payroll & Benefits Ana Gomez Talent Acquisition Manager - Arena Operations Erica Gonzalez People Operations Coordinator Allyson Durham Recruiter Olivia Millstone Front Desk Administrator Dave Daley Marketing Director of Digital Marketing Cheyne Delaney Director, Marketing & Fan Engagement Marc Chodosh Sr. Manager, Graphic Design Melissa Gebhardt Sr. Manager, Digital Marketing Jacob Lynn Social Media Manager Sarah Quarticelli Manager, Marketing Katie Rowley Marketing Manager, Operations and Strategy Kristen Carney Social Video Producer Cassy Opela Sr. Digital Marketing & Brand Editor Thompson Brandes Sr. Social Media Coordinator Rachel Wallbrown Sr. Digital Marketing Coordinator Giana Baez Sr. Coordinator, Fan Engagement Chase Thomas Sr. Graphic Designer Keely McKenzie Digital Media Coordinator Natalie Conroy Mascot Coordinator Nick Farmer Social Media Coordinator Sami Reilly Graphic Designer Maguire Hautala Graphic Designer Perry Spitzer Public Relations Director of Corporate Communications Marissa Moschel Manager, Communications Chris Krenn Media Relations Manager/Beat Writer Benjamin Pierce Hockey Reporter Gabby Shirley Communications Coordinator Stephen Buck Membership Sales and Service Sr. Director, Membership Events & Engagement Lakisha Sharpe Sr. Manager, Membership Sales & Service Caitlyn Patterson Manager, Membership Sales & Service Jackie Morrisette Sr. Retention Specialist Danny Rowan Account Executive, Membership Sales & Service Alex Rosenbaum Account Executive, Membership Sales & Service Ben Mroczka Account Executive, Membership Sales & Service Emma Architetto Account Executive, Membership Sales & Service Gerardo Scheufler Account Executive, Membership Ssales & Service Hannah Smallwood Account Executive, Membership Sales & Service Julia Cook Account Executive, Membership Sales & Service Kate Henley Account Executive, Membership Sales & Service Kendall Blackman Account Executive, Membership Sales & Service Lauren Sladoje Account Executive, Membership Sales & Service Sarah Coco Account Executive, Membership Sales & Service Zack Lecorchick VSG Academy Manager, VSG Academy Daniel Prada Business Development Representative Brandon Bairan Business Development Representative Kristen Monper Business Strategy and Analytics Director of Strategy and Analytics Josh Meek Sr. Manager, Market Intelligence Allie MacLeod Sr. Manager, Business Intelligence Laura Guevarez Sr. Digital and Consumer Strategist Tyler DeLucca Sr. Business Intelligence Analyst Lane Fahey Sales Operations Analyst Sydney McDonald Consumer Intelligence Analyst Kaylee Nallan Ticket Office Director of Ticket Operations Tim Burke Sr. Manager, Strategic Ticketing Krisjan Mackus Sr. Manager of Lightning Ticketing Jonathan Valdez Sr. Manager, Event Ticketing Helen Junker Event Ticketing Manager Cooper Fazio Sr. Lightning Ticket Coordinator Sally Yan Rochefort Lightning Ticket Coordinator Dilyn Hill Event Ticket Coordinator Marissa DePremio Event Ticket Coordinator Justin Panner Group Sales Director, Group Sales Ben Salo Premium & Group Event Executive Haley Cameron Premium & Group Event Executive Matt Thompson Premium & Group Event Executive Crystal Ortiz Group Sales Representative Cecilia Walker Group Sales Representative Connor Pelesh Ticket Sales Coordinator Rachel Rodrigues De Oliveira Retail Sr. Director of Retail Matthew Zalkowitz Sr. Manager of Retail Andrea Reilly Sr. Purchasing Manager Danielle Marone Retail Operations Manager Scott Williams Assistant Operations Manager Allyson Kuhnhausen Manager, E-Commerce Kyle Crays Retail Warehouse Manager Darnell Pitts Retail Events Coordinator Jessie Soto Guest Services Director of Premium and Guest Services Justin Bechtold Manager, Premium Service Keisha Ussery Manager, Guest Experience Christen Robinson Guest Experience Coordinator Megan Bell Legal Sr. Counsel Patrick Murphy Corporate Counsel Adam Kleinfeld Login to My Bolts Nation Chat with ThunderBot Season Ticket Interest #GoBolts Follow on X Like on Facebook Follow on Instagram Subscribe on YouTube Follow on TikTok Download Now Shop Now Championship Partners X Facebook Instagram Youtube TikTok Lightning Privacy Policy Web Accessibility Do Not Sell My Info Terms and Conditions Contact Us Employment Opportunities Website Terms Privacy Policy Terms of Use tampabaylightning.com is the official Web site of the Tampa Bay Lightning. Tampa Bay Lightning and tampabaylightning.com are trademarks of Lightning Hockey L.P. NHL, the NHL Shield, the word mark and image of the Stanley Cup and NHL Conference logos are registered trademarks of the National Hockey League. All NHL logos and marks and NHL team logos and marks as well as all other proprietary materials depicted herein are the property of the NHL and the respective NHL teams and may not be reproduced without the prior written consent of NHL Enterprises, L.P. Copyright © 1999-2025 Lightning Hockey, L.P. and the National Hockey League. Lightning Hockey, L.P. is a division of Vinik Sports Group. All Rights Reserved. NHL.com Terms of Service NHL.com Privacy Policy Cookie Policy Cookie Settings Copyright Policy Employment Close"
    },
    {
      "url": "https://www.amaliearena.com/arena-info/accessibility",
      "text": "ADA/Accessibility | Benchmark International Arena Skip to content Accessibility Buy Tickets Search Proud Partner of Newsletter Buy Tickets Menu Events & Tickets Events Calendar Ticket Information Seating Charts Tampa Bay Lightning Terms and Conditions Plan Your Visit Directions & Transportation Parking Arena Dining Hotels Know Before You Go Premium Experiences Hospitality & Suites Club Seats The Concert Club Arena Info About Arena Guide / FAQ Arena Policies ADA/Accessibility Tampa Bay Sports Store News Connect Contact Us Careers Booking Newsletter Signup Media Requests Business Opportunities Lost and Found Search Search Events and Keywords Search ADA / Accessibility Accessible Parking Benchmark International Arena does not control any parking in the downtown area, however, there are several convenient parking locations nearby. All of the surrounding garages and lots have disabled parking. There is an accessible drop off area located off Channelside Drive in the drop-off circle and is adjacent to the Accessible Entrance. In the event that you choose to be dropped off and need assistance entering the building, we have free wheelchair service manned by our staff. Just ask anyone with an Benchmark International Arena name tag or any Tampa Police Officer to request the wheelchair for you. It will be brought to you and you will be escorted to your seats at no charge. Accessible Seating Accessible tickets for all events located at Benchmark International Arena can be purchased online at Ticketmaster.com based on availability. Accessible tickets may be purchased online directly from the seat map and rows are designated as WC. Simply select “Filters” at the top of the page and then select the Accessible icon.  See below for a diagram. Please note: The number of accessible tickets vary by event. For accessible seating questions or concerns, please email boxoffice@viniksportsgroup.com or call 813.301.6700. If you have arrived at Benchmark International Arena with a valid ticket, but you do not have accessible seating and have the need for it, please see a representative at Guest Services Desk located behind Section 101 on the Promenade Level. Please keep in mind that an accessible seating relocation is not guaranteed and is subject to availability. Seating locations and facilities are provided. Benchmark International Arena offers a barrier-free entrance with a dedicated accessible elevator. Benchmark International Arena Accessible Seating Locations Promenade Level: 104, 106, 109, 110, 112, 120, 122, 123, 124, 126, 128 Suite Level: 207, 210, 218 (nonhockey events only), 228 Club Level : CLUB3 and CLUB6 Terrace Level : 303, 304, 306, 308, 310, 311, 313, 314, 319, 321, 325, 326, 328, 329 Accessible seating is available in a designated row (WC) in the seating locations below.  Accessible tickets can be purchased in advance online at Ticketmaster.com and can accommodate anyone with limited mobility. American Sign Language Interpreter We are happy to provide you with an ASL Interpreter for any concert or event with two weeks’ notice. Please email guestexperience@viniksportsgroup.com to request an interpreter. We will work with the show for the proper placement of the interpreter taking into account your seat location. Building Access Points The following areas of Benchmark International Arena present access: Ashley VIP Lounge: VIP Lounge Concert and The Mark members only The Mark: VIP Lounge and The Mark members only Budweiser Biergarten: All ticket members (space and event permitting) IOA Suite Level: Suite Ticket members only Benchmark International Club Level: Club Level ticket members, The Mark members, Ashley VIP Lounge members, Suite Level ticket members Market On Four: All ticket members Closed Captioning Closed Captioning is available at all hockey games for full in-game production. Using your smartphone you would go to the Tampa Bay Lightning app and scroll down to the section “Coming to Benchmark International Arena”. Under that heading, you will see a tab for “Closed Captioning”. Open the tab and you will receive closed captioning of all in-house announcements. Elevators Benchmark International Arena has six guest elevators for use during an event. There is an ADA elevator on the north west corner of the building which has access to all public areas. There are two elevators on the west side of the building that access the Promenade Level (Level 3), Club Level (Level 4) and Executive Suite Level (Level 5). There is the Small Freight Elevator on the south west corner of the building that has access to all public areas. There are two Executive Suite Holder Elevators on the north east side of the building that access the Promenade Level (Level 3), Club Level (Level 4) and Executive Suite Level (Level 5). Hearing Impaired For our guests that need audio assistance, simply stop by the Guest Services Desk across from section 101 and we will distribute an assistive listening device in exchange for a form of picture I.D. Website Benchmark International Arena is committed to facilitating the accessibility and usability of its Web site, benchmarkintlarena.com Over time, Benchmark International Arena will be implementing the relevant portions of the World Wide Web Consortium's Web Content Accessibility Guidelines 2.0 Level AA (WCAG 2.0 AA) as its web accessibility standard. We are always working to improve and provide a great experience to all of our guests. If, at any time, you have specific questions or concerns about the accessibility of any particular web page on benchmarkintlarena.com please contact us at accessibility@viniksportsgroup.com or 813.301.6500. If you do encounter an accessibility issue, please be sure to specify the web page in your email or on your call with us. Wheelchair Escort There is an accessible drop off area located off Channelside Drive in the drop-off circle and is adjacent to the Accessible Entrance. In the event that you choose to be dropped off and need assistance entering the building, we have free wheelchair service manned by our staff. Just ask anyone with an Benchmark International Arena name tag or any Tampa Police Officer to request the wheelchair for you. It will be brought to you and you will be escorted to your seats at no charge. ProWire Real-Time Audio Streaming The Tampa Bay Lightning have installed ProWire's real-time audio streaming technology at Benchmark International Arena. Lightning fans will be able to access in-game commentary, live rink mics and exclusive team content in real-time through their mobile device. Download the NHL App Sensory Bags Everyone experiences sensory input differently, and it is important to us that all of our fans are able to enjoy the excitement of today’s event. Sensory bags Presented by Johns Hopkins All Children’s Hospital are available for anyone interested while supplies last at guest services, Section 101. Sensory Room The Tampa Bay Lightning Sensory Room at Benchmark International Arena was constructed in consultation with CARD (University of South Florida – Center for Autism & Related Disabilities) with the intent to provide a safe space for those with sensory processing needs. Located in the Suites entrance lobby, the Sensory Room is available to any guests who may need to step away from the action. The room features a number of sensory-specific items to stimulate or calm specific senses. Family/ADA Restrooms Sections 208 and 328 have been designated as family restrooms, specifically tailored to accommodate individuals requiring ADA-compliant restroom facilities. Events & Tickets Events Calendar Ticket Information Seating Charts Tampa Bay Lightning Terms and Conditions Plan Your Visit Directions & Transportation Parking Arena Dining Hotels Know Before You Go Premium Experiences Hospitality & Suites Club Seats The Concert Club Arena Info About Arena Guide / FAQ Arena Policies ADA/Accessibility Tampa Bay Sports Store News Connect Contact Us Careers Booking Newsletter Signup Media Requests Business Opportunities Lost and Found Benchmark International Arena 401 Channelside Drive Tampa, Florida 33602 813.301.6500 Box Office 813.301.2500 Social © 2025\t\t\t\tTampa Bay Arena, LLC. A Division of Vinik Sports Group. ALL RIGHTS RESERVED. Site Map | Accessibility | Copyright Policy | Privacy Policy | Website Terms | Do Not Sell My Personal Information a carbon house experience"
    }
  ]
}