{
  "fuentes": [
    {
      "url": "https://mdauk.org/contact-us/",
      "email": "info@mdauk.org"
    },
    {
      "url": "https://www.dash-hospitality.com/",
      "email": "eric@dash-hospitality.com"
    },
    {
      "url": "https://www.dash-hospitality.com/",
      "email": "david@dash-hospitality.com"
    },
    {
      "url": "https://www.dash-hospitality.com/",
      "email": "eric@dash-hospitality.com"
    },
    {
      "url": "https://www.dash-hospitality.com/",
      "email": "jeff@dash-hospitality.com"
    },
    {
      "url": "https://www.dash-hospitality.com/",
      "email": "mitchell@dash-hospitality.com"
    },
    {
      "url": "https://www.dash-hospitality.com/",
      "email": "phil@dash-hospitality.com"
    },
    {
      "url": "https://jdsrestaurant.com/contact-us/",
      "email": "info@jdsrestaurant.com"
    },
    {
      "url": "https://business.islandchamber.com/communityeventscalendar/details/menu-tasting-experience-at-david-s-restaurant-lounge-1125019",
      "email": "info@nassaucountyflchamber.com"
    },
    {
      "url": "https://business.islandchamber.com/communityeventscalendar/details/menu-tasting-experience-at-david-s-restaurant-lounge-1125019",
      "email": "info@nassaucountyflchamber.com"
    },
    {
      "url": "https://www.davidsrestaurant.com/contact-davids/",
      "email": "events@davidsrestaurant.com"
    }
  ],
  "mails": [
    "david@dash-hospitality.com",
    "eric@dash-hospitality.com",
    "events@davidsrestaurant.com",
    "info@jdsrestaurant.com",
    "info@mdauk.org",
    "info@nassaucountyflchamber.com",
    "jeff@dash-hospitality.com",
    "mitchell@dash-hospitality.com",
    "phil@dash-hospitality.com"
  ],
  "nombre_sitio": "ameliaislanddavids.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://mdauk.org/contact-us/",
      "text": "Contact Us - Magen David Adom UK Skip to content Contact 020 8201 5900 Search for: Donate About Us CFMDA UK MDA UK Vacancies Our Work Blood Ambulance Emergency Humanitarian Get Involved Events Trips – Treks & Missions Challenge Yourself Give Blood in Israel Your Bar/Batmizvah e-Cards News Gallery Images Videos Contact Us Contact Us Get in touch Want to get in touch? We’d love to hear from you. Here’s how you can reach us… Ask a question Your Name (required) Your Email (required) Subject Your Message Company Details Address Magen David Adom UK Winston House, 2 Dollis Park, Finchley, London N3 1HF Tel – 0208 201 5900 Registered Charity Number – 1113409 Terms and Conditions Your Privacy CHARITY DETAILS Magen David Adom UK, a company limited by guarantee (company number 5718138). Winston House, 2 Dollis Park, London, N3 1HF. Tel: 020 8201 5900 Registered Charity Number: 1113409 Navigation About Us Our work Events News Gallery Vacancies Contact Us Useful Links First Aid Tips Testimonials FAQs Gift Aid Write Your Free Will Copyright 2025 © Magen David Adom UK About Us CFMDA UK MDA UK Vacancies Our Work Blood Ambulance Emergency Humanitarian Get Involved Events Trips – Treks & Missions Challenge Yourself Give Blood in Israel Your Bar/Batmizvah e-Cards News Gallery Images Videos Contact Us Donate Search for: Manage Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behaviour or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent"
    },
    {
      "url": "https://www.dash-hospitality.com/",
      "text": "DASH | A Passion for Helping Your RestaurantÂ Succeed Skip to Content Enter Skip to Menu Enter Skip to Footer Enter The Team Our Concepts Our Clients Services Contact A Passion For Helping the Hospitality Industry Succeed. We are a management & consulting company for start up & existing restaurants, hotels, and other food and beverage services. GETÂ INÂ TOUCH HAPPENINGÂ NOW Dash Hospitality Partners with MLevel Renew, Refresh, Refocus, Re-Open! DASHÂ Hospitality has collaborated with MLevel to develop a self-service platform that allows small businesses in the Hospitality sector to educate and train their employees on re-entry into the workforce. FOR FREE. FOR 10 WEEKS. LEARNÂ MORE The Team DAVIDÂ ABES david@dash-hospitality.com David has lived in Atlanta since he was 5 years old. After attending Arizona State University, he moved back to Atlanta in 1991. Â Starting his restaurant career at the age of 16, he went on to work for Morrisonâs Corporation in their casual dining division with L & N Seafood & Silver Spoon. Â David was the General Manager of the Atlanta Fish Market during the Olympics. Â David moved on to become the Director of Operations for Here To Serve Restaurants for 14 years, growing the company from 3 to 14 restaurants. Following Here To Serve, David became the Regional Director of Operations for LDV Hospitality. Â Before starting DASH Hospitality Group, David held the role of COO for the Buckhead Life Restaurant Group overseeing 9 restaurants in Georgia and 4 in South Florida for three years. In his free time, David plays basketball and golf. David is on the board for the Atlanta Community Food Bank and JDRF. Â David's son Mitchell works as the Brand Manager for DASH Hospitality Group. David's daughter Amanda works at Emory St. Joseph's hospital with her Doctorate in Occupational Therapy Phil Handley VP of Culinary and Beverage phil@dash-hospitality.com As a hospitality professional with over 37 years of experience, there isnât much Phil hasnât done in restaurants. He started in hospitality working for a caterer at age 13 in Jacksonville, FL. His first job was at a Naval Air Station for a Change of Command. Phil graduated from New England Culinary Institute. In addition to being a certified sommelier, Philâs career has progressed in to becoming a beverage, bar, and operations expert throughout Greater Atlanta. Phil has successfully opened restaurants ranging from neighborhood taquerias and luxurious FrenchBrasseries to scratch cooking concession stands in major Athletic stadiums. Phil maintains his passion for the industry by mentoring and coaching all levels of hospitality employee. His infectious love of food and beverage comes through as soon as he speaks to employee or guest alike. Â  For fun, Phil likes to host guerilla wine dinners, play poker, enjoy live music, garden and hike. Phil volunteers with TrulyLiving Well Center for Natural Urban Agriculture. MITCHELLÂ ABES BRANDÂ MANAGER mitchell@dash-hospitality.com Mitchell was born & raised in the Atlanta suburbs. Being the son of David Abes, Mitchell spent many childhood days following his father around in kitchens and experiencing the multifaceted hospitality industry. At 16, he got his first job at the former Daviniciâs Donuts location in Dunwoody Village. Following graduation from North Springs Charter High School in 2018, he attended the University of Maryland, College Park, studying strategic marketing and Public Relations. In his time in college, he worked remotely with Via Failla Marketing, helping support and manage Chattahoochee Food Works Food Hallâs social media. Additionally, he interned with United Distributors in 2021 and returned to Atlanta to work with Eagle Rock Distributing. As of Summer 2024, Mitchell represents DASH Hospitality Group and their main venture at the Village Dunwoody as their Brand Manager. He is all about growing the brand's marketing, social media and sales output. As a Type One Diabetic diagnosed at the age of two, Mitchell and the Abes family are committed to finding a cure and supporting Breakthrough Type One (formally JDRF). In Mitchellâs free time, he enjoys making Spotify playlists, going on walks through Atlantaâs Beltline and playing Pickleball. JEFFÂ GOLDT PROJECTÂ MANAGEr jeff@dash-hospitality.com Jeff was born in Indianapolis, Indiana, and moved to Atlanta during his high school years. By 16 years old, he was working at a local steak house and the neighborhood hot dog stand. He took time off from the restaurant industry to head off to Tuscaloosa where he earned a B.A. in Political Science Government from the University of Alabama. â After graduation, at just 22 years old, he signed a franchise agreement with The Krystal Company. Over the next 30 years he became a multi-unit owner operator. As a Krystal franchisee, he won several awards, including franchisee of the year. He also served many years on the Franchise Advisory Council. Over the years, he added Carvel and Mama Fuâs Asian House to his portfolio. â Jeff lives in Atlanta with his wife, Andrea, and three children. He enjoys his time playing Golf, Tennis, Traveling and watching Alabama football and basketball. He also can be found spending quality time volunteering with Creating Connecting Communities, Jump Spark and Swim Across America. Eric Alsandor PROJECTÂ MANAGEr eric@dash-hospitality.com A 23-year industry professional, Eric has worked in every area of the hospitality field from nightclubs, venues, brew pubs, fine dining to neighborhood bars and eateries. 13 of those years were spent in overarching executive management roles. Hailing from New Orleans, Eric specializes in high-volume, high-pressure restaurants and sophisticated urban environments. He has worked as a food and beverage director for such places as the Fabulous Fox Theatre and the Atlanta Botanical Gardens. In addition to his culinary background Eric, also has a degree in Graphic Design & Information Design from Ringling School of Art and Design and often lends those talents to the hospitality field as it pertains to menu design, marketing and internal visual presentation. In tandem with a career in hospitality, Eric commands a rich and diverse background in private security consulting. DEBBIEÂ &Â STEVEÂ HORN GOFIGURE, INC From Atlanta by way of Austin, Texas and back to Atlanta, Debbie and Steve Horn started GoFigure, Inc over 30 years ago. Debbie and Steve are a âTEAMâ. They specialize in the needs for hospitality and other businesses with regards to all financial systems including bookkeeping, accounting, and back office systems. While working with many major restaurant groups, they have established themselves as gurus when it comes to making sure all the financial systems are set up properly, they communicate constantly to the team about wins and what red flags there are from the top to bottom of the P & L. Our Concepts Our Clients We are proud to work with restaurants and organizations in the Atlanta area and beyond! DASH Hospitality was the best aspect of opening Putt Nation. Â Our ownership group has a ton of experience with entertainment facilities. Â Putt Nation is our first eatertainment facility featuring full food and beverage service. Our concept is unique and technology forward. Â DASH was seamless in their approach to food and beverage development and worked with us to use the most up to date technology available. Â Steve Daswani - PUTTÂ NATION DASH rescued us when we were struggling as a new business facing the challenges of how to increase revenue and save costs during a pandemic. David and Phil did a deep dive into our P&Ls, spending, menus, choice of vendors, labor costs, service model, event planning, and came up with a plan that helped us increase our sales by 30%. SARAHÂ DAVIESÂ - BIGGERSTAFFÂ BREWINGÂ COMPANY David & Team Dash began leading operations for us a year ago and the results have been tremendous. They bring focus, attention to detail, culture and professionalism to a new level. With such vast experience in the best of class Atlanta restaurant industry they possess relationships with vendors, guests, and most importantly, talent that nobody else can. My only regret is not partnering with Dash sooner. DAVIDÂ CLAPP - DANTANNA'S David is the go-to guy for improving your processes, finding the right vendors and keeping everyone on point! Creative, experienced and has a vast network of resources. Â He has helped us grow as a business and is always an absolute pleasure to work with. LEIGNÂ ANNÂ LIVADITIS - ZESTO The professionalism your team displayed definitely made us look like we knew what we were doing. We just wanted to let you guys know how much we really appreciate the job and effort the Dash Hospitality Team brought to the event! Â We definitely look forward to a long lasting relationship! BRIANÂ &Â AMYÂ DIXON - INSIGHT VIRTUALÂ BALLISTICS Services BUSINESSÂ Success Take the first step towards starting a new business, Â invigorating your existing concept, or franchising with feasibility studies, design, and operational plans. Permits &Â Licensing We take one of the most time consuming & frustrating tasks off your plate by providing you with a permitting specialist to assist you from the application process to inspection. Menu Development Our team will curate food & beverages specific to your location & facility using the current labor skill set & profit margins as guidance to execute replicable recipes, line checks, & order guides. MARKETINGÂ / PR Combining the talents of our in-house specialists & industry leaders, we can assist you with conceptualizing your product, branding, logo, PR, and print marketing. SYSTEMS Using our knowledge of industry-specific technology, we help you choose the right fit to create effective, streamlined systems for your website &Â integrations, POS, ordering, inventory, productivity, as well as training your team for optimum performance. REALÂ ESTATE Location, location, location! Â From site visits to lease negotiations, we utilize research & analysis to approach one of the most important aspects of your success. Get in Touch Today! Name Email Address Phone Number Message Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. It's how you live your DASH! The Team Our Clients Services Contact Copyright 2025, DASH Hospitality Group. All rights reserved."
    },
    {
      "url": "https://jdsrestaurant.com/contact-us/",
      "text": "Contact JD's Restaurant & Lounge | Get in Touch Skip to content (727)-595-1320 Family Owned – Family owned, friendly service and great food! Home Menu Drinks Specials Catering About Us Events Order Pick-Up Uber Eats Jobs Rewards Contact Us Menu Home Menu Drinks Specials Catering About Us Events Order Pick-Up Uber Eats Jobs Rewards Contact Us Gift Cards Gift Cards Contact Us Click Here Contact Info Phone : (727)-595-1320 Address : 125 GULF BLVD RESTAURANT, LLC., DBA JD's Restaurant & Lounge Email: info@JDsrestaurant.com Location Hours : Thur, Fri, Sat 8:00 am - 11:30 pm Sun, Mon, Tue, Wed 8:00 am - 10:30 pm Social Media Contact Us Now Or Stop By Today For guest comments or suggestions please feel free to send us an inquiry or tell us how to how to contact you by completing the form below. Name * Email * Phone Number Message Submit Order Specials Reservations Parties Catering [contact-form-7 id=\"a4c05c2\" title=\"Contact form 1\"] The team that has contributed to over 3 decades of JD’s operations, as well as the numerous guests over the years is a testament to the success of their hard work and spirit. Hours Thur, Fri, Sat 8:00 am - 11:30 pm Sun, Mon, Tue, Wed 8:00 am - 10:30 pm Quick Links Menu Drinks Specials Events About us Rewards Gift Cards Catering Jobs Menu Menu Drinks Specials Events About us Rewards Gift Cards Catering Jobs Contact Us (727)-595-1320 125 Gulf Boulevard Indian Rocks Beach, FL 33785 info@JDsrestaurant.com Facebook-f Instagram Yelp Tripadvisor NEWSLETTER Sign Up With over 40 years of experience in the restaurant industry, the Loder family brings their passion for food and hospitality to The Crabby Bill’s Family Brands. We invite you to enjoy our 10 different dining experiences located along the Gulf of Mexico in the always sunny Florida state! © JDs Restaurant and Lounge | All rights reserved."
    },
    {
      "url": "https://business.islandchamber.com/communityeventscalendar/details/menu-tasting-experience-at-david-s-restaurant-lounge-1125019",
      "text": "Menu-Tasting Experience at David's Restaurant & Lounge  - Nassau County Chamber of Commerce Skip to content Join Today Facebook Icon Twitter Icon YouTube Icon LinkedIn Icon Menu About Us Our Story Chamber FAQ Chamber Staff Board of Directors Chamber Ambassadors Leadership Nassau Signature Events 2024 Annual Report Privacy Policy Contact Us Members Member Login/Info Hub Chamber Events Calendar Membership Benefits Chamber Champions Marketing/Advertising Opportunities Discover Nassau Life & Leisure Guide Discovery Map of Amelia Island Discovery Map of West Nassau County Business Resource Innovation Center (BRIC) Member Application Business Directory Member to Member Discounts Events & News Chamber Events Calendar Community Events Calendar Chamber Blog Newsletter Sign-Up Business Directories Business Directory Geographical Directories Amelia Island/Fernandina Beach Business Directory Yulee Business Directory Callahan Business Directory Hilliard Business Directory Bryceville Business Directory Visitor/Tourism Directory Restaurants/Food/Beverages Directory Building/Contractor/Real Estate Directory Healthcare Business Directory Chamber Champions Special Services Directories Resources Business Resources Employment Resource Hub Economic Profile Business Development Assistance Start Up Directory: Nassau County Start Up Directory: City of Fernandina Beach Home Based Business/Remote Worker Resources Nassau County Sales Tax Community Resources Discover Nassau Life & Leisure Guide Interactive Resident/Visitor Map Communities Amelia Island Fernandina Beach Yulee Callahan, Hilliard & Bryceville Resident/New Mover Resources Nassau County Relocation Packet Licenses & Permits SizeUpNassau SizeUpNassau FAQ Member Login/Info Hub Job Opportunities in Nassau County Employment Resource Hub Hurricane and Disaster Preparedness Advocacy & Strategic Initiatives SizeUpNassau SizeUpNassau FAQ Advocacy in Action Government Officials Six Pillars Framework Nassau County Economic Indicators Back to Search Menu-Tasting Experience at David's Restaurant & Lounge Wednesday, October 30, 2024 (6:00 PM - 8:00 PM)\r\n                        ( EDT ) Description Step inside The Wine Room, North Florida's most unique menu-tasting experience. The intimate wine room offers seating for up to 12 guests and emulates Chef David's culinary journey, 6 courses rotating monthly. During the tasting, you'll savor select pours carefully hand-picked by the Wine Director Mr. Glenn Curls. Call (904) 310-6049 to book now! Additional Info × David's Restaurant & Lounge 802 Ash Street Fernandina Beach , FL 32034 United States Wednesday, October 30, 2024 (6:00 PM - 8:00 PM)\r\n                                ( EDT ) Registered Guests × Close Share × Print Email Add to Calendar Facebook LinkedIn X Pinterest Close Powered By GrowthZone © 2025 Nassau County Chamber of Commerce | Site by GrowthZone location 961687 Gateway Blvd., Suite 101-G Fernandina Beach, FL 32034 phone (904) 261-3248 email info@NassauCountyFLChamber.com facebook twitter youtube LinkedIn #WeAreTheChamber Interested in Membership? Apply online and let us help you grow your business! Apply Today © 2025 Nassau County Chamber of Commerce. All Rights Reserved | Site by GrowthZone Scroll To Top"
    },
    {
      "url": "https://www.davidsrestaurant.com/contact-davids/",
      "text": "Contact — David's Restaurant 0 Skip to Content About Chef David Restaurants Private Events Recipes Watch Shop Open Menu Close Menu About Chef David Restaurants Private Events Recipes Watch Shop Open Menu Close Menu About Chef David Restaurants Private Events Recipes Watch Shop Contact For general inquiries, please fill out this form. For event inquiries, please email us at: events@davidsrestaurant.com Name * First Name Last Name Email Address * Subject * Message * Thank you! David's David's Opus Ten David's 388 CHEF DAVID TURIN Contact Press Press Kit Careers JOIN OUR EMAIL LIST Get notified with event announcements, special dinners, original recipes, and where you can watch Chef David in action. Email Address Join Thank you!"
    }
  ]
}