{
  "fuentes": [
    {
      "url": "https://www.tcpalm.com/story/entertainment/dining/2017/08/30/american-icon-brewery-vero-beach-hiring-preparing-its-first-event/618793001/",
      "email": "info@americaniconbrewery.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "anirudh.shetye@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "beatrice.malle@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "info.nairobi@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "jane@skanem.ke"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "njogu@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "olive.kunihira@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "sachen.gudka@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "sameer.gaikwad@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "shamila.mirza@skanem.com"
    },
    {
      "url": "https://business.indianriverchamber.com/list/member/american-icon-brewery-4933",
      "email": "chamber@indianriverchamber.com"
    },
    {
      "url": "https://www.americaniconbrewery.com/connect/contact/",
      "email": "info@americaniconbrewery.com"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "email": "info@scibpaints.com"
    },
    {
      "url": "https://www.americaniconbrewery.com/about-us/giving-back/",
      "email": "info@americaniconbrewery.com"
    },
    {
      "url": "https://inzmo.com/deu/en/contact",
      "email": "info@inzmo.com"
    },
    {
      "url": "https://www.americaniconbrewery.com/privacy-policy/",
      "email": "info@americaniconbrewery.com"
    },
    {
      "url": "https://treasurecoastfoodie.com/american-icon-brewery-review/",
      "email": "thomas@savourus.com"
    },
    {
      "url": "https://shop.americaniconbrewery.com/",
      "email": "headerstarlogo_450x@2x.png"
    },
    {
      "url": "https://shop.americaniconbrewery.com/pages/email",
      "email": "headerstarlogo_450x@2x.png"
    },
    {
      "url": "https://shop.americaniconbrewery.com/pages/email",
      "email": "returns@americaniconbrewery.com"
    },
    {
      "url": "https://shop.americaniconbrewery.com/pages/email",
      "email": "store@americaniconbrewery.com"
    }
  ],
  "mails": [
    "anirudh.shetye@skanem.com",
    "beatrice.malle@skanem.com",
    "chamber@indianriverchamber.com",
    "headerstarlogo_450x@2x.png",
    "info.nairobi@skanem.com",
    "info@americaniconbrewery.com",
    "info@inzmo.com",
    "info@scibpaints.com",
    "jane@skanem.ke",
    "njogu@skanem.com",
    "olive.kunihira@skanem.com",
    "returns@americaniconbrewery.com",
    "sachen.gudka@skanem.com",
    "sameer.gaikwad@skanem.com",
    "shamila.mirza@skanem.com",
    "store@americaniconbrewery.com",
    "thomas@savourus.com"
  ],
  "nombre_sitio": "americaniconbrewery.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.tcpalm.com/story/entertainment/dining/2017/08/30/american-icon-brewery-vero-beach-hiring-preparing-its-first-event/618793001/",
      "text": "American Icon Brewery in Vero Beach hiring, preparing for first event News Indian River Martin St. Lucie Sports Advertise Obits eNewspaper Legals DINING American Icon Brewery in Vero Beach hiring, preparing for its first event Janet Begley Special to TCPalm VERO BEACH — With the grand opening for the American Icon Brewery already set for Oct. 17, developer Michael Rechter is in a hiring frenzy. Rechter, who needs to fill 80 positions for the new brewery and restaurant in Vero Beach’s historic old diesel plant, is looking first for kitchen staff to implement the eatery’s newly developed gastropub. The first hiring event is set for Thursday at the American Icon Brew Lab, 911 14th Lane, in the Majestic Plaza in Vero Beach. On Sept. 7, the focus switches to servers, bartenders and front of the house personnel, Rechter said. Managers and supervisors for the brewery and restaurant are also needed. Appointments are required for the interviews. Resumes should be emailed to info@americaniconbrewery.com . “We want all types of people to join our team as we build one of America’s great microbreweries/brew pubs,” Rechter said. First big event Hiring has become such an important focus for Rechter since the brewery will have its first big fundraising event, Read, Write and Brew, to benefit the Education Foundation of Indian River County from 6 to 9 p.m. Oct. 26. Looking for a free mini puzzle? Play the USA TODAY Quick Cross now. Executive Director Cynthia Falardeau said the event is a perfect way for people to enjoy the new facility and support local students and teachers at the same time. “The Board was trying to create an event that would have wide appeal,” Falardeau said. “We wanted it to be affordable for our parents and teachers to enjoy. The idea of a Read, Write and Brew party is something that supports our mission of promoting education.” There are two ways to enjoy Read, Write and Brew. One is an all-access pass for $125 to the mezzanine level that includes an open beer and wine bar, signature appetizers and prizes. Rechter will share his personal story with guests about the history of the building and the development of the American Icon brewery. The other has a more casual flair, guests can join the Great Lawn Party on the north side of the brewery where they'll be entertained with music from Minglewood. Tickets are $30 and include two drinks, hot pretzels, beer cheese, lawn games and a raffle. Rechter said he is excited that his plans for the brewery are coming closer to fruition. “We’re going to have ‘the’ place in town,” he said. “When you walk into the building, you’ll feel the energy. People will be eating and drinking, and you’ll be able to watch the brewery in action. It will be amazing.” Tickets for Read, Write and Brew To purchase tickets, go to the Education Foundation of Indian River County at www.edfoundationirc.org . Staff Directory Corrections Careers Accessibility Support Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Businesses Promote your Event Buy and Sell Licensing & Reprints Help Center Subscriber Guide Manage Account Advertise Your Business Give Feedback Subscribe Today Newsletters Mobile Apps Facebook X eNewspaper Archives Jobs Real Estate Classifieds Education Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.tcpalm.com. All rights reserved."
    },
    {
      "url": "https://skanemafrica.com/contact",
      "text": "Contact Skanem | Reach Out to Our Labelling Experts Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message We proudly present Skanem Nairobi Skanem Nairobi Sachen Gudka Managing Director +254 733 410 309 Send email Skanem Nairobi Sachen Gudka Managing Director +254 733 410 309 Send email Skanem Nairobi Anirudh Shetye Head of Sales & Marketing +254 735 052 700 Send email Skanem Nairobi Anirudh Shetye Head of Sales & Marketing +254 735 052 700 Send email Skanem Nairobi Joyce Njogu Key Account Manager +254 722 804 269 Send email Skanem Nairobi Joyce Njogu Key Account Manager +254 722 804 269 Send email We proudly present Skanem Uganda Skanem Uganda Olive Kunihira Head of Sales +256 759 589 711 Send email Skanem Uganda Olive Kunihira Head of Sales +256 759 589 711 Send email We proudly present Skanem Tanzania Skanem Tanzania Sameer Gaikwad Site Manager +255 757 803 737 Send email Skanem Tanzania Sameer Gaikwad Site Manager +255 757 803 737 Send email Skanem Tanzania Beatrice Malle Key Account Manager +255 712 110 922 Send email Skanem Tanzania Beatrice Malle Key Account Manager +255 712 110 922 Send email Skanem Tanzania Shamila Mirza Key Account Manager +255 717 477 047 Send email Skanem Tanzania Shamila Mirza Key Account Manager +255 717 477 047 Send email Locations Locations Locations How to reach us How to reach us How to reach us How to reach us Skanem Interlabels Nairobi Limited East Africa Headquarters East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa +254 202 471001 info.nairobi@skanem.com Skanem Interlabels Uganda Limited Namanve Industrial Park Mukono Uganda Africa +256 759 589711 olive.kunihira@skanem.com Skanem Tanzania Limited Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa +255 757 803737 sameer.gaikwad@skanem.com Contact us Send us a message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Products Sustainability menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy Products menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy"
    },
    {
      "url": "https://business.indianriverchamber.com/list/member/american-icon-brewery-4933",
      "text": "American Icon Brewery | Brewery | Restaurants Skip to content Visit Indian River | Economic Development Join Today Member Login Contact Us Facebook Instagram LinkedIn Menu Our Community Community Calendar Chamber Talk with Bob Soos 105.7FM Community Links Meeting Space – Conference Room Rental In the News/Press Releases Job Postings Restaurant Guide Member Directory About the Chamber About Us Business Directory and Community Guide Magazine Strategic Plan 2023-2025 2025 Legislative Priorities Ambassadors Board of Directors Join Us Contact Us Our Staff Alma Lee Loy 2025 New Chamber Members Events & Programs Signature Events 5K on the Runway Chamber Golf Classic State of the County Luncheon 2025 Legislative Luncheon Tourism Luncheon Industry Appreciation Awards Breakfast Annual Awards Meeting Tree Lighting Festival YPN Young Professionals Network Leadership Education Leadership Indian River Member Center Member Login IRC Chamber App Member Calendar Ribbon Cuttings Member Deals American Icon Brewery Categories Brewery Restaurants 1133 19th Pl. Vero Beach FL 32962-2668 (772) 934-4266 Send Email Visit Website Hours: Sunday-Thursday 12:00pm-9:00pm Friday-Saturday 12:00pm-10:00pm About Us American Icon Brewery is a favorite spot for families and friends to gather in the Vero Beach area. The flagship of Arts Village, our mission is to create balanced, approachable, and interesting hand-crafted beers. Our restaurant and ale house share the same commitment to quality that is evident in the food and service provided. MEET THE CO-OWNER Carl Berry describes himself as a “guy from a small town who was hungry as hell!”. Berry was born in Belle Glade and raised in Indiantown - both small rural towns in South Florida. At the age of 14, he started mopping floors in an Italian restaurant in his hometown and has held just about every job in the hospitality industry since, including chef and general manager. He was also in charge of training and opening new stores for Duffy’s Sports Grill. In 2019, Berry joined forces with his Duffy’s colleagues to create Paradigm Hospitality Group, which bought American Icon Brewery. As the co-owner of the brewery, he runs the day-to-day operations and has expanded beer distribution to all parts of South Florida and the Treasure Coast. He says his formula for operating a major craft beer brand and restaurant is simple, “Enjoy people. Put out good food. Have fun.” Video Media Highlights Menus Beers Shop in our Store Our News Contact and Careers Images Gallery Image American%20Ico%20Pic%20number%201.JPG × Gallery Image American%20Ico%20Pic%20number%202.JPG × Gallery Image American%20Ico%20Pic%20number%203.JPG × Gallery Image American%20Ico%20Pic%20number%204.JPG × Gallery Image American%20Ico%20Pic%20number%205.JPG × Gallery Image 4Amer%20Icon%20pic%206.JPG × Gallery Image 4Amer%20Icon%20pic%205.JPG × Gallery Image Amer%20Icon%20pic%203.JPG × Rep/Contact Info Carl Berry × Close Carl Berry Vice President Phone: (772) 934-4266 Send an Email 1133 19th Pl. Vero Beach FL 32962-2668 Ariel Klein × Close Ariel Klein General Manager Phone: (772) 934-4266 Send an Email 1133 19th Pl. Vero Beach FL 32962-2668 Robert  Morgantini × Close Robert  Morgantini General Manager Phone: (772) 934-4266 Send an Email 1133 19th Pl. Vero Beach FL 32962-2668 Share × Print Email Facebook Twitter LinkedIn Pinterest Close Tell a Friend × Send Request Cancel © 2025 Indian River County Chamber of Commerce | Site by GrowthZone Building Business. Building Community. Indian River County Chamber of Commerce 1216 21st Street Vero Beach, FL 32960 (772) 567-3491 chamber@indianriverchamber.com Hours Monday: 9:00 AM - 4:00 PM Tuesday: 9:00 AM - 4:00 PM Wednesday: 9:00 AM - 4:00 PM Thursday: 9:00 AM - 4:00 PM Friday: 10:00 AM - 3:00 PM"
    },
    {
      "url": "https://www.americaniconbrewery.com/connect/contact/",
      "text": "Contact 772-934-4266 Order Online HOME ABOUT US ABOUT US OUR CRAFT PRESERVING HISTORY PHOTO GALLERY GIVING BACK BEERS OUR BEERS 1926 Hef AmerIcon Blonde The Factory Pilsner Icon IPA Power Plant Amber Lager Freedom Torch Milk Stout Icon Haze ON TAP GET AIB BEER American Hero DISTRIBUTION WHERE WE DISTRIBUTE SELL SHEETS BEER TRAINING MARKETING MATERIAL 1926 Hef Marketing Material MENUS LUNCH & DINNER MENU TAKEOUT/DELIVERY DAILY SPECIALS EVENTS & TOURS PRIVATE EVENTS & CATERING PUBLIC BREWERY TOURS WHAT'S GOING ON STORE GIFT CARDS REWARDS CONNECT CONTACT CAREERS Menu American Icon Brewery 1133 19th Pl Vero Beach, FL 32960 772-934-4266 HOURS Sunday-Thursday 11:30am-9:00pm Friday-Saturday 11:30am-10:00pm American Icon Brewery Social Links For all inquiries: info@americaniconbrewery.com 1133 19th Pl. Vero Beach, FL 32960 Sunday-Thursday 11:30am-9:00pm Friday-Saturday 11:30am-10:00pm Brought to you by Paradigm Hospitality Group © 2025  American Icon Brewery All Rights Reserved Please Drink Responsibly Terms and Conditions Privacy Policy Email Address FL Search Close"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "text": "Contact Us: Get In Touch With Asian Paints for your Painting Needs Contact Us: We’d Love To Hear From You 16815 Popular searches Interior Paints Exterior Paints Shade cards SEARCH RESULTS {{searchItem.map.shadeCode}} {{searchItem.map.shadeFamilyName}}: {{searchItem.map.shadeName}} {{searchItem.map.title}} RELATED SEARCH NO MATCHES FOUND! Did you mean? {{spellCheck}} Log-In Hello! Hello! Signout en ar {{minicart.cartcount > 0 ? minicart.cartcount : 0}} ↻ Processing... You have {{minicart.cartcount}} items {{item[\"product\"][\"name\"]}} - + ₹ {{item[\"totalPrice\"][\"value\"]}} Total ₹ {{minicart.totalprice}} Checkout ↻ Menu PAINTS & COLOUR PAINTS & COLOUR Services Services WATERPROOFING WATERPROOFING INSPIRATION INSPIRATION Login/Register PAINTS & COLOUR All PAINTS & COLOUR EXPLORE COLOURS Colour Catalogue Home Colour Guide PAINT PRODUCTS Interior Paints Exterior Paints Waterproofing Wood Paints Metal Paints Undercoats RESOURCES Paint Budget Calculator Ideas Gallery Colour visualizer SERVICES Paint Store Near Me Book Painting Services Services All Services Beautiful Homes Painting Service Scib Stars WATERPROOFING All WATERPROOFING Bathrooms Terrace and Tanks Roof & Basement Interiors Tiling All Products INSPIRATION All INSPIRATION Get Inspired Paint calculator Gallery Colour Next Guides DecorPro Resources Colour Visualizer Ideas Gallery Please enter your mobile number To receive the dealer details on SMS Mobile * SUBMIT Get in Touch We’d love to hear from you Head Office Scib Chemical S.A.E 6th of October Cirt, 4th Industrial (1/3/B)B Tel:            (+202)38281090-99 Fax: (+202)38331271 Scib Paints Helpline* For enquiries, feedback and complaints please call on 16815 or write to us at info@scibpaints.com Mobile number +91 00:59 ↻ ↻ Need help with your painting needs? Fill the form below to book a free site evaluation by a Scib Paints Beautiful Homes Painting Service expert. Name Mobile Number +20 Governorate * Email By proceeding, you are authorizing Scib Paints and its suggested contractors to get in touch with you through calls, sms, or e-mail. Book an appointment ↻ Thank you! We value your interest in Scib Paints Beautiful Homes Service. We will get in touch with you shortly to schedule a visit by an expert. Try again! Oops! Something went wrong. We couldn't process your request. Please try again? Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Our Divisions More about Asian Paints Congratulations You have subscribed. Contact Us 16815 EMAIL ABOUT Research & Technology Careers Contact Us Certificates RESOURCES FAQs POLICIES Quality Policy Customer Policy Cookie Policy Environment Policy EHS Policy TOOLS Colour Catalogue Color with AP APP/Website​ COUNTRY EGYPT Country EGYPT India GLOBAL BANGLADESH MIDDLE EAST FIJI NEPAL SRI LANKA ETHIOPIA CONNECT DOWNLOAD OUR PAINTING APP CONNECT WITH US ©Scib Paints - All rights reserved Congratulations You have subscribed. Welcome User Login OR Continue as guest You have been successfully logged out Login An OTP has been sent to your registered mobile number and email id. 00:00 Resend By clicking submit, I agree to terms and conditions SUBMIT Register Please enter the 5 digit OTP sent via SMS to verify your mobile number! 00:00 Resend I agree to terms and conditions SUBMIT Please enter your mobile number To receive the dealer details on SMS SUBMIT Provide a delivary address Fullname* Email* Mobile* +91 Flat/House No/Floor* Colony/Street/Locality* Landmark City* Pincode* SUBMIT User already exist redirecting you for the login page Paint Budget Calculator Get instant estimates Calculate now Waterproofing Calculator Get an instant estimate Calculate now"
    },
    {
      "url": "https://www.americaniconbrewery.com/about-us/giving-back/",
      "text": "GIVING BACK - American Icon Brewery - Vero Beach Florida. Our mission is to create balanced, approachable and interesting hand-crafted beers, along with delicious food, served up in Vero Beach’s historic diesel plant. 772-934-4266 Order Online HOME ABOUT US ABOUT US OUR CRAFT PRESERVING HISTORY PHOTO GALLERY GIVING BACK BEERS OUR BEERS 1926 Hef AmerIcon Blonde The Factory Pilsner Icon IPA Power Plant Amber Lager Freedom Torch Milk Stout Icon Haze ON TAP GET AIB BEER American Hero DISTRIBUTION WHERE WE DISTRIBUTE SELL SHEETS BEER TRAINING MARKETING MATERIAL 1926 Hef Marketing Material MENUS LUNCH & DINNER MENU TAKEOUT/DELIVERY DAILY SPECIALS EVENTS & TOURS PRIVATE EVENTS & CATERING PUBLIC BREWERY TOURS WHAT'S GOING ON STORE GIFT CARDS REWARDS CONNECT CONTACT CAREERS Menu GIVING BACK American Icon Brewery believes that we have a responsibility to support our local community. Thanks to the support of the local community, our success has given us the opportunity to “Give Back”. Our involvement with worthy organizations and finding ways to “Give Back” is a focal point of our company’s culture and is part of our commitment to social responsibility and making a positive difference. Together we can create change! Thank you for being a part of our incredible journey where every day is a good day to give! If you are interested in having American Icon Brewery help support your cause, please email our Marketing Department info@americaniconbrewery.com Thank you again for all the support! “Only a life lived for others is a life worthwhile.” ~ Albert Einstein American Icon Brewery has proudly supported: Hibiscus Children’s Center Children Home Society of Florida Humane Society of Vero Beach and Indian River County Youth Sailing Foundation of IRC Kiwanis Club of Vero Treasure Coast Election Worker Appreciation Indian River County Sheriff's Office Pelican Island Preservation Society Vero Sports Club Kickball League Voices for Children Okeechobee & Treasure Coast Quail Valley Charities, Vero Beach, Fl Garden Club of Indian River County Gardenfest Farming Around 4-H Club IRC Dancing with Vero Stars Relay For Life American Red Cross The Mardy Fish Children Foundation Little Birthday Angels Org Children at Riverside Theatre Feed the Lambs Enrichment Program of Indian River County VB Community Health Coalition New Horizons Mental Health, Primary Care and Substance Abuse Indian River County Council PTA Discount Card Program CASTLE Teaching Safe Parenting Vietnam Veterans of Indian River County Awesome Greyhound Adoptions VNA Association Women's Care Center Rally for Rabies LifeBuilders of the Treasure Coast United Way of IRC Vero Beach High School Cheerleaders NFT Florida Transplant Fund Vero Beach High School Band 1133 19th Pl. Vero Beach, FL 32960 Sunday-Thursday 11:30am-9:00pm Friday-Saturday 11:30am-10:00pm Brought to you by Paradigm Hospitality Group © 2025  American Icon Brewery All Rights Reserved Please Drink Responsibly Terms and Conditions Privacy Policy Email Address FL Search Close"
    },
    {
      "url": "https://inzmo.com/deu/en/contact",
      "text": "Contact INZMO: Get in Touch with Us Today! | INZMO English Products Products Hello and welcome! You've just entered a world where insurance isn't just a necessity; it's a path to financial freedom. We're INZMO, and we're more than just insurance. Mobile Phone Insurance From 1.99€ / month Rental Deposit Warranty From 3.25€ / month Bicycle insurance From 4.99€ / month Laptop/Tablet Insurance From 2.99€ / month E-scooter Insurance From 4.17€ / month About us For Partners Submit a claim Submit a claim Submit a claim We're here to help! Whether it's phone, email or chat, let us know what we can help you with today! We're here to help! Whether it's phone, email or chat, let us know what we can help you with today! Contact us As an INZMO customer, there are several easy ways to get in touch with us. We're here to help with any questions you might have! Email us: info@inzmo.com Give us a call: +49 30 31193091 (available 9-17 CET, Monday-Friday; except national holidays) Chat: use our chat option down in the corner of the page to find an answer even faster. Looking to partner with INZMO? Learn about easily offering embedded insurance to your customers. Connect with one of our experts today and get started! Talk with an expert Unleash the revolution - choose the wise alternative Get covered Your e-mail address Submit Subscribe for updates See what's new Get the app Inzmo About us Imprint Products Rental Deposit Warranty Mobile Phone Insurance Laptop/Tablet Insurance Bicycle Insurance E-scooter Insurance Get in touch Contact us Partner with us Careers Legal Terms of Use Privacy Policy Cookie Notice & Policy"
    },
    {
      "url": "https://www.americaniconbrewery.com/privacy-policy/",
      "text": "Privacy Policy - American Icon Brewery - Vero Beach Florida. Our mission is to create balanced, approachable and interesting hand-crafted beers, along with delicious food, served up in Vero Beach’s historic diesel plant. 772-934-4266 Order Online HOME ABOUT US ABOUT US OUR CRAFT PRESERVING HISTORY PHOTO GALLERY GIVING BACK BEERS OUR BEERS 1926 Hef AmerIcon Blonde The Factory Pilsner Icon IPA Power Plant Amber Lager Freedom Torch Milk Stout Icon Haze ON TAP GET AIB BEER American Hero DISTRIBUTION WHERE WE DISTRIBUTE SELL SHEETS BEER TRAINING MARKETING MATERIAL 1926 Hef Marketing Material MENUS LUNCH & DINNER MENU TAKEOUT/DELIVERY DAILY SPECIALS EVENTS & TOURS PRIVATE EVENTS & CATERING PUBLIC BREWERY TOURS WHAT'S GOING ON STORE GIFT CARDS REWARDS CONNECT CONTACT CAREERS Menu Privacy Policy Effective October 17, 2017 American Icon Brewery respects the privacy of every individual who visits our website. We do not sell or rent your personal information to third parties for marketing purposes. Please read this Privacy Policy carefully to learn more about the ways in which we use and protect your personal information. By visiting our website, you are accepting the practices described in this Privacy Policy. If you visit our website: In general, you can visit our website without telling us who you are or revealing any personally identifiable information about yourself. Our web servers collect the domain names, not the e-mail addresses, of visitors. In some cases, we may collect information about you that is not personally identifiable. This information is collected using a “cookie” that enables us to learn which advertisements bring users to our website. Cookies are small files placed on your hard drive that allow us to collect that information. Effective October 17, 2017. American Icon Brewery also utilizes a third party to track and analyze usage and volume statistical information from our website customers in order to constantly improve the quality of our website. No data collected by a third party on behalf of American Icon Brewery may be owned or used by such third party. American Icon Brewery reserves the right to publish nonpersonally identifiable, summary information regarding its website customers for promotional purposes and as a representative audience for advertisers. If you choose to identify yourself: If you voluntarily provide us with personally identifying information, such as your name, street address, email address, phone number, and birth date, we will collect that information along with any other information you voluntarily provide. It is our policy not to distribute, sell, rent or in any way make available, your name, e-mail address or any other personally identifiable information to any third party. When you participate in site features such as newsletters, etc., we may use the personally identifiable information you provide through those features in the following ways, unless stated otherwise: we may store and process that information to better understand your needs and how we can improve our products and services, and we may communicate with you via e-mail or postal mail. Children’s Online Privacy Protection Act American Icon Brewery has no intention of collecting any personally identifiable information (name, address, telephone number, birth date, or e-mail address) from individuals under 13 years of age. If a child has provided us with personally identifiable information, a parent or guardian of that child should contact us at the e-mail address or phone number listed at the bottom of this Statement if they would like this information deleted from our records. We will use reasonable efforts to delete the child’s information from our existing files. Policy Changes American Icon Brewery may, at any time, amend the provisions in this Privacy Policy. Changes to this policy will be reflected by the “Effective Date” as displayed in the upper left hand corner of this policy. How to Contact Us If you have questions or concerns regarding our Privacy Policy or use of your information, please contact us by clicking here. info@americaniconbrewery.com 1133 19th Pl. Vero Beach, FL 32960 Sunday-Thursday 11:30am-9:00pm Friday-Saturday 11:30am-10:00pm Brought to you by Paradigm Hospitality Group © 2025  American Icon Brewery All Rights Reserved Please Drink Responsibly Terms and Conditions Privacy Policy Email Address FL Search Close"
    },
    {
      "url": "https://treasurecoastfoodie.com/american-icon-brewery-review/",
      "text": "American Icon Brewery Review - Treasure Coast Foodie Menu Search for Log In View your shopping cart Your cart is currently empty. Go to the shop Home Blog Posts Melbourne & Palm Bay Sebastian | Vero | Fort Pierce PSL | Jensen Beach | Stuart Hobe Sound | Jupiter | Palm Beach Videos Holy Grail Eats YouTube Videos Savor Club How it Works Frequently Asked Questions Restaurant Discounts Member Dashboard Change Password Events & Tours Event Tickets Foodie Meetups The Golden Fork Awards The Treasure Coast MASTERCHEF Competition Food Tours Shop All Gift Cards Digital e-Gift Cards e-Gift Card Balance Affiliate Links Cart My Account Contact Us About Us Subscribe Mobile App Password Reset Follow Facebook X Pinterest YouTube Instagram TikTok Login View your shopping cart Your cart is currently empty. Go to the shop Switch skin Search for Home / Restaurant Review / American Icon Brewery Review Restaurant Review Brewery Review American Icon Brewery Review Thomas Miller Send an email 2,576 3 minutes read Facebook X LinkedIn Pinterest Reddit Messenger Messenger WhatsApp Share via Email Print Located in the heart of downtown Vero Beach, American Icon Brewery is a truly unique place that has been in operation for almost five years. Co-Owners, Carl Berry and Jason Emmett have been in the hospitality industry for most of their lives and are passionate about making great beer and delicious food! Michael Rechter, the founder of American Icon, is a real estate developer, investor, and entrepreneur from South Florida who invested 6.5 million dollars into renovating the building. The result is a brewery with an expansive industrial design, including an old 750-kilowatt diesel engine generator that has been transformed into the location for the beer taps. In addition to its impressive atmosphere, American Icon Brewery also offers an elevated gastropub-style menu. Whether you’re a fan of craft beer or just looking for a new place to grab a bite and relax, American Icon Brewery is definitely worth checking out. American Icon Brewery is located in Vero Beach’s oldest municipal building, which was formerly a diesel power plant constructed in the late 1920s. The interior of the brewery has an open, industrial design, with a large bar surrounding the old diesel engine and a variety of booths and tables on the first floor. For a different perspective on the brewery, visitors can head upstairs to the loft, which offers tables with a view of the brew room below and a private room that can be rented for events or meetings. The brewery also has an outdoor patio for those who prefer to sit outside. A new menu was recently released, and visitors can try a variety of beers and dishes from the menu during their visit. @thetreasurecoastfoodie Check out my latest review of @americaniconbrewery LIVE on our website now! Linktree in bio! #americanicon #craftbeer #microbrewery #gastropub #verobeach #indianrivercounty #foryourpage #fyp ♬ Paradise – Bazzi Now let’s dive right in and see what this place has to offer and what I had to eat and drink! (Left to Right) – Icon IPA (ABV 6.5% | IBU 65), 1926 HEF (ABV 5.2% | IBU 16), American Hero (4.8% ABV | 25 IBU) Icon IPA (ABV 6.5% | IBU 65) Tasting Notes: This medium-bodied IPA is light in color and features a subtle piney character with bright citrusy notes evocative of popular West Coast styles. 1926 HEF (ABV 5.2% | IBU 16) Tasting Notes: This full-flavored hefeweizen is brewed in the traditional German style, and offers an effervescent feel complemented by yeasty notes of banana and clove. American Hero (4.8% ABV | 25 IBU) Tasting Notes: Brewed with locally sourced hops grown by Veterans, this unique beer is very special. Loaded with bright, citrusy aromas and juicy hop flavor; balanced by a lighter body and smooth finish. HAWAIIAN POKE BOWL – Ahi tuna, orzo, edamame, avocado, mango, seaweed salad, pineapple, English cucumber, poke sauce, taro chips, and spicy mayo. The combination of flavors and textures in this dish was what really made it stand out to me. Each bite was a symphony of flavors, with a little sweetness, a hint of spiciness, and a touch of tanginess all rolled into one. It was truly a unique and enjoyable dish. STEAK RICE BOWL – Marinated tenderloin steak, cilantro rice, shredded lettuce, roasted tomatoes, roasted corn, pickled red onion, and cheddar jack cheese with a drizzle of avocado crema. The meat in the dish was extremely tender and perfectly seasoned, and the vegetables were all incredibly fresh. The avocado crema added a fresh, light, and flavorful touch to the dish. This meal is a great choice for someone who has a big appetite and enjoys bold flavors. HALF RACK OF BABY BACK RIBS – Slow-roasted pork ribs served with a side of fries and coleslaw. The ribs are cooked in the oven and then coated in a tangy BBQ sauce before being grilled to perfection just before serving. The result is tender ribs that easily pull apart and has a sweet and smoky flavor from the BBQ sauce. LAMB BURGER – Hand-pattied Australian Lamb, feta cheese, arugula, pickled red onion, roasted garlic & tomato hummus served on an English muffin. The first bite of the burger was surprising and full of bold flavors. Many people tend to avoid lamb because of its strong flavor, but this burger had none of the gaminess that is often associated with lamb. The English muffin served as an excellent choice for a bun, and the feta cheese and pickled onions added a tangy twist to the burger. American Icon Brewery Address : 1133 19th Pl, Vero Beach, FL 32960 Phone : (772) 934-4266 https://www.americaniconbrewery.com/ American Icon is one of our Savor Club partner restaurants and they are offering an incredible deal off their beers for our members! Click Here to learn more about the discount they offer! This article is a paid advertisement for the restaurant featured in this blog post. All opinions expressed in this post are based on our own personal experience with the business and its products. brewery tours near me, best brewery near me with food, breweries open near me, beer store near me, craft beer breweries, beer garden near me, tap rooms near me, brewery near me, brewery near me with food, brewery near here, brewery nearby, brewery vero beach, brewery vero beach florida, microbrewery vero beach Thomas Miller Send an email 2,576 3 minutes read Facebook X LinkedIn Pinterest Reddit Messenger Messenger WhatsApp Share via Email Print Share Facebook X LinkedIn Pinterest Reddit WhatsApp Share via Email Print Thomas Miller Thomas Miller, known as “The Treasure Coast Foodie” and “The Foodie Guy,” is a celebrated food blogger, owner, and Editor in Chief of The Treasure Coast Foodie Blog, as well as the host and producer of Holy Grail Eats, where he spotlights one-of-a-kind restaurants and exceptional “Holy Grail” dishes. With ten years of experience, he has reviewed over 300 local restaurants, and his food photography captures the appetites of tens of thousands of followers each month. As the Official Foodie Insider for Visit Indian River County, Thomas champions local dining culture, sharing his insights with a loyal following of over 125,000. His expertise has also been featured in the luxe publication Coastal Drive Magazine. A Google Maps Level 8 Local Guide, Thomas has shared more than 4,000 photos, viewed over 100 million times, and his Foodie dining events rank among the Treasure Coast’s top culinary experiences. Chefs of Indian River County - Maison Martinique Chefs of Indian River County - Maison Martinique Station 49 Pizza: A Tasty and Authentic Italian Experience in Vero Beach, Florida Station 49 Pizza: A Tasty and Authentic Italian Experience in Vero Beach, Florida Related Articles Surf Subs Vero Beach: Italian Sandwiches | Restaurant Review 11 hours ago Morel’s Bar & Grill Palm Bay, FL | Restaurant Review 1 week ago Colab Kitchen – Stuart, FL – Farm-to-Table Restaurant Review 3 weeks ago Big Boyz Jamaican Restaurant Review – Melbourne, FL 4 weeks ago Follow Us on Social Media Facebook X Pinterest YouTube Instagram TikTok YOUR #1 Source for what and where people are dining out on the Treasure Coast! © Copyright 2025 All Rights Reserved Savourus LLC, dba The Treasure Coast Foodie Home Blog Posts Videos Savor Club Events Food Tours Shop Holy Grail Eats Advertising & Services Careers Terms of Use Privacy Policy About Us Contact Us Facebook X Pinterest YouTube Instagram TikTok Facebook X Pinterest Messenger Messenger WhatsApp Back to top button Close Search for: Facebook X Pinterest YouTube Instagram TikTok Close Search for Close Log In Forget? Remember me Log In"
    },
    {
      "url": "https://shop.americaniconbrewery.com/",
      "text": "American Icon Brewery Skip to content Search Home Beers About Us Menus Events & Tours Gift Cards Rewards Connect Account Site navigation Search Search Cart Menu Site navigation Home Beers About Us Menus Events & Tours Gift Cards Rewards Connect Account Item added to cart. View cart and check out . Close Close FREE SHIPPING AVAILABLE! Close Pause slideshow Play slideshow MEN'S AIB WEAR View all MEN'S AIB WEAR View all WOMEN'S AIB WEAR View all WOMEN'S AIB WEAR View all COOL AIB STUFF View all COOL AIB STUFF View all HATS View all HATS View all ACCESSORIES View all ACCESSORIES View all AIB GLASSWARE View all AIB GLASSWARE View all GIFT CARDS View all GIFT CARDS View all WALL DECOR View all WALL DECOR View all DOG LINE View all DOG LINE View all Our store 1133 19TH PLACE VERO BEACH FLORIDA 32960 (772) 934-4266 Directions SUPPORT Shipping Policy Returns & Exchanges Privacy Policy Terms & Conditions Contact Follow us Facebook Twitter Pinterest Instagram YouTube KEEP IT UP WITH AIB Promotions, new products and sales, directly to your inbox. Subscribe © 2025, American Icon Brewery . Payment methods American Express Apple Pay Diners Club Discover Google Pay Mastercard PayPal Shop Pay Visa"
    },
    {
      "url": "https://shop.americaniconbrewery.com/pages/email",
      "text": "CONTACT – American Icon Brewery Skip to content Search Home Beers About Us Menus Events & Tours Gift Cards Rewards Connect Account Site navigation Search Search Cart Menu Site navigation Home Beers About Us Menus Events & Tours Gift Cards Rewards Connect Account Item added to cart. View cart and check out . Close Close FREE SHIPPING AVAILABLE! Close CONTACT Customer Service/General: Email us at store@americaniconbrewery.com Returns/Exchanges: Email us at returns@americaniconbrewery.com SUPPORT Shipping Policy Returns & Exchanges Privacy Policy Terms & Conditions Contact Follow us Facebook Twitter Pinterest Instagram YouTube KEEP IT UP WITH AIB Promotions, new products and sales, directly to your inbox. Subscribe © 2025, American Icon Brewery . Payment methods American Express Apple Pay Diners Club Discover Google Pay Mastercard PayPal Shop Pay Visa"
    }
  ]
}