{
  "fuentes": [
    {
      "url": "https://legion1976.com/about-us-1",
      "email": "micah@micahrich.com"
    },
    {
      "url": "https://www.americanlegion57.org/",
      "email": "americanlegion57@comcast.net"
    },
    {
      "url": "https://centennial.legion.org/new-york/post57",
      "email": "hoist40@me.com"
    },
    {
      "url": "https://www.americanlegion57.org/index.php?id=93",
      "email": "bobtarlton@comcast.net"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "gabe@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "info@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "leadershipboard@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "olivia@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "oliviac@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "scott@journeysherwood.org"
    },
    {
      "url": "https://alelginpost57.com/contact",
      "email": "alelginpost57@yahoo.com"
    },
    {
      "url": "https://americanlegion149.com/about-us",
      "email": "sebastian@aldusleaf.org"
    },
    {
      "url": "https://americanlegion149.com/about-us",
      "email": "team@latofonts.com"
    },
    {
      "url": "https://www.alpost1151.org/",
      "email": "newsletter@alpost1151.org"
    },
    {
      "url": "https://americanlegion57.org/index.php?id=114",
      "email": "niki781@msn.com"
    },
    {
      "url": "https://www.legion.org/membership/contactus",
      "email": "esmith@legion.org"
    },
    {
      "url": "https://www.legion.org/membership/contactus",
      "email": "msteinmetz@legion.org"
    },
    {
      "url": "https://www.legion.org/membership/contactus",
      "email": "mwalker@legion.org"
    },
    {
      "url": "https://www.legion.org/membership/contactus",
      "email": "mwoodsmall@legion.org"
    },
    {
      "url": "https://www.legion.org/membership/contactus",
      "email": "narnett@legion.org"
    },
    {
      "url": "https://web.lakecitychamber.com/member-directory/Details/american-legion-post-57-2730619",
      "email": "info@lakecitychamber.com"
    },
    {
      "url": "https://americanlegion57.org/index.php?id=15",
      "email": "americanlegion57@comcast.net"
    }
  ],
  "mails": [
    "alelginpost57@yahoo.com",
    "americanlegion57@comcast.net",
    "bobtarlton@comcast.net",
    "esmith@legion.org",
    "gabe@journeysherwood.org",
    "hoist40@me.com",
    "info@journeysherwood.org",
    "info@lakecitychamber.com",
    "leadershipboard@journeysherwood.org",
    "micah@micahrich.com",
    "msteinmetz@legion.org",
    "mwalker@legion.org",
    "mwoodsmall@legion.org",
    "narnett@legion.org",
    "newsletter@alpost1151.org",
    "niki781@msn.com",
    "olivia@journeysherwood.org",
    "oliviac@journeysherwood.org",
    "scott@journeysherwood.org",
    "sebastian@aldusleaf.org",
    "team@latofonts.com"
  ],
  "nombre_sitio": "americanlegion57.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://legion1976.com/about-us-1",
      "text": "About Us Home About About Us Post Officers Preamble Constitution and By-Laws Monthly Letter All Veterans Honor Guard Honor Bell Foundation Gallery Events Membership Sign Up Renew Membership Resources Auxiliary District 6 Colorado Veteran Affairs Upload Documents Contact Home About About Us Post Officers Preamble Constitution and By-Laws Monthly Letter All Veterans Honor Guard Honor Bell Foundation Gallery Events Membership Sign Up Renew Membership Resources Auxiliary District 6 Colorado Veteran Affairs Upload Documents Contact More Home About About Us Post Officers Preamble Constitution and By-Laws Monthly Letter All Veterans Honor Guard Honor Bell Foundation Gallery Events Membership Sign Up Renew Membership Resources Auxiliary District 6 Colorado Veteran Affairs Upload Documents Contact Home About About Us Post Officers Preamble Constitution and By-Laws Monthly Letter All Veterans Honor Guard Honor Bell Foundation Gallery Events Membership Sign Up Renew Membership Resources Auxiliary District 6 Colorado Veteran Affairs Upload Documents Contact About Us American Legion Post 1976 American Legion Centennial Post 1976 is a dedicated community organization based in Aurora, Colorado. Our mission is to improve the quality of life for America’s veterans, their families, active military, and our local community through a commitment to mutual helpfulness. We are passionate about supporting our veterans by offering resources, assistance, and a welcoming space for them to connect and gather. In addition, we actively engage with the Aurora community through various events and initiatives, helping to strengthen the bonds between veterans and their neighbors. We invite you to explore more about our post and our unwavering dedication to those who have served our country. Connect With Us The Four Pillars In 1919, The American Legion was founded on four pillars: Veterans Affairs & Rehabilitation, National Security, Americanism, and Children & Youth, Each of these pillars encompasses a variety of programs that benefit our nation’s veterans, its service members, their families, the youth of America and ordinary citizens. These programs make a difference in hundreds of thousands of lives each year. It’s who we are and what we do. Our Programs and Services At American Legion Post 1976, we offer a wide range of programs and services to support our veterans and their families, as well as our local community. VA Benefits Counseling: Our service officers provide free advice and assistance to any veteran, regardless of whether they are a member of our Post. We can help with VA benefits counseling, employment referrals, and more. Have a question? Get in touch Honor Bell Foundation Gallery American Legion Centennial Post 1976 15821 East Centretech Circle, Aurora, Colorado 80011, United States (720) 369-7844 Copyright © 2024 American Legion Centennial Post 1976 - All Rights Reserved. Managed by Hole Digital This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://www.americanlegion57.org/",
      "text": "American Legion Post 57 American Legion Post 57 HOME 105TH BIRTHDAY BASH NEWSLETTER VIEW NEWSLETTER SUBSCRIBE WHY JOIN POST OFFICERS POST HISTORY POST LOCATION VETERAN SERVICE OFFICERS POST VETERAN SERVICE OFFICER COUNTY VETERAN SERVICE OFFICERS MEMBERSHIP MEMBERSHIP INFO ONLINE RENEWAL APPLICATION CONTACT US BINGO KITCHEN MENU EVENTS CALENDAR BOYS STATE BENEFITS LEGION RIDERS SONS OF LEGION AUXILIARY UNIT 57 AUXILIARY ALA JUNIOR ACTIVITIES PROGRAM HONOR GUARD LIBERTY DIVISION SEA CADETS SEA CADETS HOME OFFICERS (SEA CADETS) ENROLLMENT & FEES PORTAL PRIVACY POLICY VETERAN OWNED BUSINESSES SCHOLARSHIPS RENTAL INFO VETERAN SOLUTIONS VETERAN SOLUTIONS VETERAN SOLUTIONS P2 TAPS TEXAS HOLD'EM GOVT WEB SITES FLAG ETIQUETTE NATL. HDQTRS. HOUSE RULES CONSTITUTION AND BYLAWS PURPLE HEART RESOLUTION American Legion Post 57 The American Legion myLegion Upcoming Events Patriot Day (9/11) 09/11/25 Bingo Day Session 09/11/25, 3:00PM Patriot Day Remembrance Ceremony 09/11/25, 6:00PM Bingo Night Session 09/11/25, 6:45PM Red Shirt Friday 09/12/25 See Full Calendar Download Welcome AMERICAN LEGION POST 57 LAKE CITY, FLORIDA Since our charter in (1920), our American Legion Post has been welcoming VETERANS from all branches of our Armed Forces. Today, we continue to welcome all military personnel serving our country. Joining our Post enables you to continue serving your God, Country and Community. Our mission is to implement the goals, aspirations, dreams, peace and blessings for our country, friends and families embodied in our preamble below. Post 57 Contact Information Office Phone: (386) 752-7776 Post Hours: Mon-Sun 11:00am to 10:00pm Email: americanlegion57@comcast.net Post Location 2602 SW Main Blvd Lake City FL 32025 Kitchen Phone: (386) 752-7260 Kitchen Hours: Lunch Monday - Friday 11:00am to 1:00pm Dinner Saturday - Thursday 4:00pm to 8:00pm Family Dinner Fridays Friday 5:30pm to 7:30pm © 2025 American Legion Post 57, 2602 SW Main Blvd, Lake City, Florida 32025, (386) 752-7776 Home Admin Sign In Password Reset Powered by Legionsites.com ✕ User Login Email: Password: Submit ✕ User Password Reset Please provide your user email: Submit"
    },
    {
      "url": "https://centennial.legion.org/new-york/post57",
      "text": "Post 57 Cobleskill ,Schoharie County, New York | The American Legion Centennial Celebration Join Renew Donate Sign In Vision Tools Post Tools Post Index News Videos Photos Post 57 Cobleskill ,Schoharie County, New York Home Post 57 Cobleskill ,Schoharie County, New York Post 57 Cobleskill ,Schoharie County, New York About This Post Post Namesake Ceremony to Commemorate the 100-Year Anniversary of the Funeral and Interment of Sergeant Fred L Stilson - American Legion Post 57 Namesake October 16, 2018 Interment October 16, 1918, at Cobleskill Rural Cemetery Cobleskill, New York Today we ... READ MORE What Makes this Post Unique Our Post 57 namesake Fred L Stilson has his name engraved on two WW l monuments in upstate NY. He enlisted in Schoharie County and had residency in Otsego County. Schoharie County monument located at Old Stone Fort, Schoharie NY READ MORE Share: Photos Wreaths Across America Placing of  Wreath by Post 57  First Vice Commander Wreaths Across America 2019 Cobleskill Veterans Day American Flags for Radez students Lt George W Snyder Decoration Day Ceremony Al Post 57 Honor Guard On My Honor Wreaths Across America....... Stilson Grave Site Decorated Saratoga National Cemetery Fred L Stilson honored All Photos HISTORY Jump to Decade 1910 1920 1940 1950 1960 2010 ​ 1910 Sgt. Fred L Stilson gravesite Nov 10, 1918 American Legion Post 57 namesake. Born 1896 Died 1918   Fort Ontario,Oswego N.Y. Located in the Cobleskill Rural Cemetery,old section G Full Story Charter for Fred L Stilson Post 57        June 13,1919 Jun 13, 1919 Original Charter for the Fred L Stilson Post 57  Cobleskill NY Dated  June 13 1919 I will be adding more close-ups of specific areas of the Charter. Or you can zoom in to read details. Full Story Post 57  June 13,1919 Charter Members ......  15 in all Jun 13, 1919 First Post Commander   Maynard K Van Deusen Full Story Formation of Post 57     Signers Section Jun 13, 1919 Dated June 13,1919 Full Story 1920 WWI Memorial at Cooperstown NY Jul 4, 1920 This WWI Memorial is located in Cooperstown NY. Decated long before the establishment of the Baseball Hall of Fame. It is located across the street from the Otesaga Hotel. Many hall of fame inducties have visited this site. Post 57 namesake Fred L Stilson is honored on the monument Full Story 1940 Thru War Bonds.... Fighter Plane Purchased Jun 6, 1944 Post 57 purchases War Bonds to help support War efforts. Note Post name painted on fuselage. Full Story Commander Joe Buckley..Plane Purchase Acknowledgement Jun 7, 1944 Letter from the War Finance Committee. Dated June 1944 Full Story Post 57.....American Legion Baseball Aug 1, 1948 This photo was taken in the late 1940s. Post 57 Commander Edward Lingenfelter is the team manager/coach. You can zoom out to read many of the names of the players. Full Story 1950 Dedication of Post 57 home on Legion Drive May 27, 1950 The new American Legion Post 57 home on Legion Drive in Cobleskill NY. As part of this event I will post articles and photos. Full Story Dedication Program Dias  Stilson Home May 27, 1951 The new Post 57 home was built on Legion Drive,Cobleskill NY. It is a very large brick structure. The main meeting room is located upstairs and the bar located downstairs. Unfortunately due to declining membership and increasing expenses the legion home had to be sold. The post was relocated to a much smaller building on MacArthur Ave in 1969. Today the former post building is the home of the Cobleskill Elks Lodge 2040. Post 57.. Full Story Memorial Day  Parade  1952 or 1953 May 30, 1952 This photo (1952 or 1953)captured the Cobleskill HS band marching from Center Park in Cobleskill NY to the Cobleskill Rural Cemetery. A Memorial Day service was held in the park and a service was also held at the cemetery. The march was about one mile long, all uphill. The Quarry St. bridge can be seen in background. Full Story 1960 The White House            Washington DC     August 1968 Aug 11, 1968 Post Commander Edward Lingenfelter recieved this correspondence from President Lyndon Johnson. Mr Whitney Shoemaker served as Public Affairs Director for the President. Full Story Honorary Life Members of Post 57 Jun 25, 1969 Pictured are the 1969  honorary life members of Post 57. Paid Up For Life did not exist at this time. Pictured are:  Frances Pratt   Lee Mackle   Henery Mattey   Ham Acheson   Charles Reghi William Bolcott   Fenton Mereness   Ed Lingenfelter   Maynard VanDuesen Full Story Post  57       50 Year Celebration Jun 30, 1969 Photo of news article about the Fred L Stilson Post 57 50th anniversary. Full Story Post  57       50 Year Celebration Jun 30, 1969 Photo of news article about the Fred L Stilson Post 57 50th anniversary. Full Story New Post 57 home on MacArthur Ave. Jun 30, 1969 This artical is part 2 of the move to our new Post 57 home on MacArthur Ave ,Cobleskill New York. Full Story Post 57    Home on MacArthur Ave. Jun 30, 1969 Our Post 57 home is still alive and running. We are the only Legion Post in Schoharie County with our own building. We are finally replacing the furnace installed in 1967. Full Story 2010 Fred L Stilson graveside ceremony Oct 16, 2018 This ceremony was held one hundred years to the exact date of Sergent Fred L Stilsons burial in Cobleskill Rural Cemetery. B-October 3,1896 / D-November 12,1918 Fort Ontario   Oswego,New York Fred L Stilson gave his last full measure of devotion at age 22 years. Full Story Fred L Stilson  headstone restoration May 26, 2019 The before and after photos show the results of the cleaning Stilsons headstone. We used a product called D2 . This is one way of honoring veteran buried in local cemeteries. Full Story Home Vision Tools News Videos Photos Calendar Copyright © 2025 - The American Legion"
    },
    {
      "url": "https://www.americanlegion57.org/index.php?id=93",
      "text": "TEXAS HOLD'EM American Legion Post 57 HOME 105TH BIRTHDAY BASH NEWSLETTER VIEW NEWSLETTER SUBSCRIBE WHY JOIN POST OFFICERS POST HISTORY POST LOCATION VETERAN SERVICE OFFICERS POST VETERAN SERVICE OFFICER COUNTY VETERAN SERVICE OFFICERS MEMBERSHIP MEMBERSHIP INFO ONLINE RENEWAL APPLICATION CONTACT US BINGO KITCHEN MENU EVENTS CALENDAR BOYS STATE BENEFITS LEGION RIDERS SONS OF LEGION AUXILIARY UNIT 57 AUXILIARY ALA JUNIOR ACTIVITIES PROGRAM HONOR GUARD LIBERTY DIVISION SEA CADETS SEA CADETS HOME OFFICERS (SEA CADETS) ENROLLMENT & FEES PORTAL PRIVACY POLICY VETERAN OWNED BUSINESSES SCHOLARSHIPS RENTAL INFO VETERAN SOLUTIONS VETERAN SOLUTIONS VETERAN SOLUTIONS P2 TAPS TEXAS HOLD'EM GOVT WEB SITES FLAG ETIQUETTE NATL. HDQTRS. HOUSE RULES CONSTITUTION AND BYLAWS PURPLE HEART RESOLUTION American Legion Post 57 The American Legion myLegion Upcoming Events Patriot Day (9/11) 09/11/25 Bingo Day Session 09/11/25, 3:00PM Patriot Day Remembrance Ceremony 09/11/25, 6:00PM Bingo Night Session 09/11/25, 6:45PM Red Shirt Friday 09/12/25 See Full Calendar Download TEXAS HOLD'EM Monday and Friday Starts at 7:00 PM OPEN TO MEMBERS AND GUESTS Sign up by 7:00 PM to receive early bird bonus of $2,000 chips Buy-in is $20 for $15,000 IN CHIPS Re-buys and add on $20 for 15,000 chips until the Blinds end at 2,000/4,000 An optional high hand pot is offered for $5 To win this pot you must have two (2) of the cards in your hand & win the hand (YOU DO NOT HAVE TO BE CALLED) You will receive $1,000 chips for every $5 in food purchased and $100 chips for each $1 spend on beverages or candy until the first break on Friday you will receive 5,000 in chips for dinner A ROYAL FLUSH Pot is offered and $10 will be added to it every Night we play To win this pot you must have two (2) of the cards in your hand (YOU DO NOT HAVE TO BE CALLED) If you have 2 ACE's in your hand and get beat the dealer will award you $5,000 in chips or the BIG Blind if it is larger If you have a full house or larger and get beat the dealer will award you $5,000 in chips or the BIG Blind if it is larger If you get a straight flush you will receive A BONUS OF  $10,000 in chips or the BIG Blind if it is larger ********************** On the 2nd & 3rd Fridays of each month a Texas Hold'em fundraiser is held in the main hall starting at 7:00 PM You will receive $5,000 in bonus chips to pre-register and another $5,000 in chips if you played in either fundraiser in the last 2 months You will also receive $5,000 in chips if you buy a dinner on Friday night (one per player) this game is open to public ********************** For more information on any of the above or to pre-register text Bob at (386) 344-1848 or send Email to bobtarlton@comcast.net © 2025 American Legion Post 57, 2602 SW Main Blvd, Lake City, Florida 32025, (386) 752-7776 Home Admin Sign In Password Reset Powered by Legionsites.com ✕ User Login Email: Password: Submit ✕ User Password Reset Please provide your user email: Submit"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "text": "Leadership Team — Journey Church New Here? Find Us Plan a Visit Leadership Team About Us Who We Are What We Believe Journey Kids Journey Youth Journey Women Journey Men Partners Next Steps Discipleship Bands Connection Card Serve Need Prayer? Journey Groups Be Baptized Membership at Journey Need Help? Summer at Journey Messages Give LiveStream New Here? Find Us Plan a Visit Leadership Team About Us Who We Are What We Believe Journey Kids Journey Youth Journey Women Journey Men Partners Next Steps Discipleship Bands Connection Card Serve Need Prayer? Journey Groups Be Baptized Membership at Journey Need Help? Summer at Journey Messages Give LiveStream Leadership Team New Here Find Us Plan a Visit Leadership Team Journey Church Staff Team Scott Edinger Lead Pastor scott@journeysherwood.org Olivia Pothoff Pastor of Worship & Care olivia@journeysherwood.org Gabe Nielsen Director of Journey Youth gabe@journeysherwood.org Olivia Cuddeford Director of Journey Kids oliviac@journeysherwood.org Journey Church Leadership Board The Leadership Board at Journey Church is made up of six members of the Journey Church family and the Lead Pastor. They are assigned to help guide, equip, and empower the pastors and staff at Journey Church to fulfill the mission and vision that God has uniquely given us. Our current Leadership Board members: Megan O’Connell, Jon Burgi, Lacey McNay, Ed Hatch, Amy Schlapper, Josh Thoreson. If you have any questions for the Leadership Board please email: leadershipboard@journeysherwood.org Back to Top Events Messages FOLLOWING JESUS TOGETHER Phone 503.610.0759 Email info@journeysherwood.org Gather 22689 SW Pine Street, Sherwood, OR Mail PO Box 322, Sherwood, OR 97140 Subscribe To Our Weekly Update Sign up with your email address to receive our weekly email updates. First Name Last Name Email Address Sign Up We respect your privacy. Thank you for signing up for our Weekly Update!"
    },
    {
      "url": "https://alelginpost57.com/contact",
      "text": "American Legion Elgin Post 57   - Contact Post 57 Home Legion Auxiliary Sons of the Legion Legion Riders Canteen Hall Rental Assistance Contact Archives Post 57 Home Legion Auxiliary Sons of the Legion Legion Riders Canteen Hall Rental Assistance Contact Archives Contact Us Name Email Message American Legion Post 57 820 N. Liberty Street Elgin, IL 60120 Canteen Manager 847-741-1669 Canteen Phone 847-741-1684 Kitchen Phone 847-741-8143 Adjutant's Office 847-741-2358 Office Fax: 847-741-5273 Email: alelginpost57@yahoo.com Post Hours: 10 am - 9 pm     Monday - Thursday 10 am - 10 pm   Friday - Saturday 10 am - 7 pm     Sunday Copyright 2018 American Legion Post 57 Some images © Log out Powered by Bandzoogle"
    },
    {
      "url": "https://americanlegion149.com/about-us",
      "text": "About Us | American Legion Post 149 Next Meeting 13 September 25 Home About Us Veteran Assistance Post 149 Events Community Engagement Store & Donations Contact Us Affiliates Member Service Gallery Vets Hall Schedule More Home About Us Veteran Assistance Post 149 Events Community Engagement Store & Donations Contact Us Affiliates Member Service Gallery Vets Hall Schedule Home About Us Veteran Assistance Post 149 Events Community Engagement Store & Donations Contact Us Affiliates Member Service Gallery Vets Hall Schedule Pickens Post 149 Q2'2025 Newsletter Download PDF Pickens Post 149 Q1'2025 Newsletter Download PDF Pickens Post 149 Q4'24 Newsletter Download PDF Pickens Post 149 Q3'24 newsletter Download PDF We are Making a Difference Serving our Country is a lifelong commitment and there is no better way to serve than to preserve the memories of those who served, perpetuate Americanism and help others. Click below to see upcoming meetings/events.  Join Us! Find out more Austin von Letkemann on the American legion Why You Should Belong Download PDF THE AMERICAN LEGION PREAMBLE \"For God and Country, we associate ourselves together for the following purposes: To uphold and defend the Constitution of the United States of America; to maintain law and order; to foster and perpetuate a 100-percent Americanism; to preserve the memories and incidents of our associations in all wars; to inculcate a sense of individual obligation to the community, state and nation; to combat the autocracy of both the classes and the masses; to make right the master of might; to promote peace and good will on earth; to safeguard and transmit to posterity the principles of justice, freedom and democracy; to consecrate and sanctify our comradeship by our devotion to mutual helpfulness.\" Find out more Copyright © 2025 American Legion Post 149 - All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.alpost1151.org/",
      "text": "American Legion Post 1151 – The American Legion: Veterans Strengthening America Link to Facebook Officer Login (585) 334-8228 Home Our Post American Legion Post 1151 Our Story Our Mission Our Leadership Memorial Walkway Oratorical Our By-Laws Current By-Laws Proposed By-Laws Our Legion Family Sons of the American Legion American Legion Auxiliary Veterans of Foreign Wars Membership Newsletters 2025 Newsletters 2024 Newsletters Archived 2023 Newsletters 2022 Newsletters 2021 Newsletters 2020 Newsletters 2019 Newsletters 2018 Newsletters 2017 Newsletters 2016 Newsletters 2015 Newsletters Calender Resources Hall Rentals Contact Click to open the search input field Click to open the search input field Search Menu Menu Veterans. Defense. Youth. Americanism. Communities. America’s largest veterans service organization works every day to uphold time-honored values. Join Today Devils Bar Hours Wednesday              5 pm – 9  pm Thursday                  5 pm – 9 pm Friday                        5 pm – 9 pm Saturday                   5 pm – 9  pm Devil’s Bar News News From The Cooks The fish fry will continue to be “drive through” and Tuesday dinners will be dine-in or take-out. The Sunday all you can eat breakfast buffet will be dine-in only. We are always looking for volunteers and there is a sign-up sheet in the kitchen. Or If you’re interested, ask someone in the kitchen! Kitchen News Disabled American Veterans We have a local DAV Office here at our post The hours are below or click on the Get in Touch button to contact the local DAV representative. Get in Touch Together, we make a difference Be a part of something bigger. With nearly 2 million members and 12,875 posts across the country, veterans find camaraderie and a home at The American Legion, where everyone is family. Join us as we continue to serve our communities and country. Join Now Renew Dues Contact Us Next Upcoming Dinner/Breakfast Sep 19 Friday Fish Fry 260 Middle Rd, Henrietta, NY, United States, New York 14467 Next Events » All Upcoming Events SAL Meeting September 10 @ 6:00 PM - 6:30 PM Legion Executive Meeting September 10 @ 6:30 PM - 7:00 PM Ely Fagan Stevens Connor American Legion Post 1151 Legion General Meeting September 10 @ 7:00 PM - 8:00 PM Ely Fagan Stevens Connor American Legion Post 1151 Celebration Of Life Tim Tysall September 14 @ 12:00 PM - 4:00 PM Latest Newsletter August 2025 Newsletter 2025 Newsletters Read more August 4, 2025 https://www.alpost1151.org/wp-content/uploads/2023/01/newsletter-250x250-1.jpg 250 250 admin https://www.alpost1151.org/wp-content/uploads/2023/01/LOGO-1-1030x409-1-300x119.png admin 2025-08-04 13:15:06 2025-08-04 13:15:06 August 2025 Newsletter Special Thanks To Some Of Our Sponsors Confused about Medicare? Need help reviewing your health care insurance plan? Be sure NOT to miss out on ALL the BENEFITS you may be eligible for in 2022! Let our member and friend, Ellen Ortega, a NYS Licensed Medicare Broker assist you at NO COST to you! Contact: Ellen Ortega, Licensed NYS Medicare Agent (518) 956-0722 – Cell (585) 563-7979 – Office 1225 Jefferson Rd, Suite A01 Rochester, NY 14623 Total Variety, for true music lovers only! A mix of everything! AC, New Age, Oldies, Rock, Pop, Country, Top of the Hour News, special programming including Sunday morning service, a little something for everyone!You must like all genres to listen continuously. Are you up to the challenge? Listen Live SIGN UP FOR OUR NEWSLETTER Email Address * For All Newsletter Input or Questions Please Email newsletter@alpost1151.org Department Links LEADERSHIP ORGANIZATION AMERICAN LEGION COLLEGE BOYS STATE CHILDREN & YOUTH DEPT. PHOTOGRAPHER’S PHOTO GALLERY DEPT. CONVENTION DEPT DIRECTORY (CONTACT PAGE) DEPT DIRECTORY (PDF) DEPT BOWLING TOURNAMENT DEPT GOLF TOURNAMENT MAP OF DISTRICTS LEGIONNAIRE OF YEAR PROGRAM LEGION NEW YORK MAGAZINE NY LEGION BASEBALL AM LEGION RIDERS NY AMERICAN LEGION NEWS NY AMERICAN LEGION HISTORIANS ORATORICAL FORMS (CHAIRS/JUDGES) RESOLUTIONS PROGRAMS & SERVICES FOUR PILLARS + 1 VETERANS SERVICES YOUTH CHILDREN AND FAMILIES SUPPORT TROOPS COMMUNITY SERVICE LEGISLATIVE ACTION NEWS & EVENTS LATEST NEWS CALENDAR OF EVENTS MIDWINTER CONFERENCE DEPT CONVENTION NATIONAL CONVENTION Members JOIN THE AMERICAN LEGION RENEW MEMBERSHIP PAID UP FOR LIFE MEMBER DISCOUNTS MYLEGION.ORG © Copyright - American Legion Post 1151 Link to Facebook SAL Auxiliary VFW Resources Privacy Policy Scroll to top Scroll to top Scroll to top"
    },
    {
      "url": "https://americanlegion57.org/index.php?id=114",
      "text": "ENROLLMENT & FEES PORTAL American Legion Post 57 HOME 105TH BIRTHDAY BASH NEWSLETTER VIEW NEWSLETTER SUBSCRIBE WHY JOIN POST OFFICERS POST HISTORY POST LOCATION VETERAN SERVICE OFFICERS POST VETERAN SERVICE OFFICER COUNTY VETERAN SERVICE OFFICERS MEMBERSHIP MEMBERSHIP INFO ONLINE RENEWAL APPLICATION CONTACT US BINGO KITCHEN MENU EVENTS CALENDAR BOYS STATE BENEFITS LEGION RIDERS SONS OF LEGION AUXILIARY UNIT 57 AUXILIARY ALA JUNIOR ACTIVITIES PROGRAM HONOR GUARD LIBERTY DIVISION SEA CADETS SEA CADETS HOME OFFICERS (SEA CADETS) ENROLLMENT & FEES PORTAL PRIVACY POLICY VETERAN OWNED BUSINESSES SCHOLARSHIPS RENTAL INFO VETERAN SOLUTIONS VETERAN SOLUTIONS VETERAN SOLUTIONS P2 TAPS TEXAS HOLD'EM GOVT WEB SITES FLAG ETIQUETTE NATL. HDQTRS. HOUSE RULES CONSTITUTION AND BYLAWS PURPLE HEART RESOLUTION American Legion Post 57 The American Legion myLegion Upcoming Events Patriot Day (9/11) 09/11/25 Bingo Day Session 09/11/25, 3:00PM Patriot Day Remembrance Ceremony 09/11/25, 6:00PM Bingo Night Session 09/11/25, 6:45PM Red Shirt Friday 09/12/25 See Full Calendar Download Enrollment & Special Fees Portal This page is for all your enrollment Information. You are welcome to alternatively send or bring in a check in the appropriate amount, made payable to Liberty Sea Cadets. Enrollment & Annual Re-enrollment Fees: One Time Enrollment Fee $180 First time enrollment fee can be paid here. This fee is payable upon first applying to Sea Cadets and covers your initial membership fees to USNSCC as well as your unit fees and uniform deposit. For more information, contact the recruiting officer niki781@msn.com . © 2025 American Legion Post 57, 2602 SW Main Blvd, Lake City, Florida 32025, (386) 752-7776 Home Admin Sign In Password Reset Powered by Legionsites.com ✕ User Login Email: Password: Submit ✕ User Password Reset Please provide your user email: Submit"
    },
    {
      "url": "https://www.legion.org/membership/contactus",
      "text": "Regional Contacts | The American Legion ad space Skip to Main Content Shop Online Find a Post Find a Service Officer MyLegion.org Join Renew Donate Toggle menu About Organization Leadership Reports Media Toolkit American Legion Family All About Advocacy Be The One Grassroots Action Center Legislative National Affairs Youth Support Advocacy Center Membership & Services Join The American Legion Renew Membership Member Discounts Resources Veterans Services All Membership & Services Get Involved Youth Programs Community Programs Meetings Scholarships All Programs Information Center In the Media Calendar Training Library & Museum Honor & Remembrance All Information Center Find a Post Find a Service Officer MyLegion.org Shop Online Join Renew Donate Toggle search Search site Search Join Renew Donate Home Contact Us Contact Internal Affairs Regional Contacts Regional Contacts The American Legion is broken down into regions based on the five elected national vice commanders. A regional liaison from the Internal Affairs & Membership Division is assigned to each region to assist people with their questions. These questions can be regarding procedures, processes and programs within The American Legion, how to start a new post or revitalize an existing one or general inquiries. Central Region Liaison: IL, IN, KY, MI, OH, WI, WV Eric D. Smith (IN) 317-630-1328 esmith@legion.org Midwest Region Liaison: IA, KS, MN, MO, ND, NE, OK, SD Nick Arnett (MO) 317-630-1326 narnett@legion.org Northeast Region Liaison: CT, DC, DE, FR, MA, ME, MD, NH, NJ, NY, PA, RI, VT Mark A. Woodsmall (IN) 317-630-1265 mwoodsmall@legion.org Southeast Region Liaison: AL, AR, FL, GA, LA, MS, NC, PR, SC, TN, TX, VA Michael Walker (IN) 317-630-1372 mwalker@legion.org Western Region Liaison: AK, AZ, CA, CO, HI, ID, LT, MT, NM, NV, OR, PH, UT, WA, WY Michele Steinmetz (CA) 317-630-1379 msteinmetz@legion.org Veterans Defense Youth Americanism Communities About Advocacy Membership & Services Get Involved Information Center FAQ Advertise With Us Contact Us American Legion Careers Find a Post Find a Service Officer Planned Giving Contact Us The American Legion National Headquarters: 700 N. Pennsylvania St., P.O Box 1055, Indianapolis, IN 46206 Customer Service 800.433.3318 Contact Us E-Newsletters Subscribe to The American Legion's e-newsletters to receive important updates, resources, and special offers tailored for veterans and their families. Subscribe © Copyright 2025 The American Legion. Terms & Conditions Privacy Policy ADA Compliance Sitemap Follow Us: Facebook X (former Twitter) Instagram YouTube LinkedIn"
    },
    {
      "url": "https://web.lakecitychamber.com/member-directory/Details/american-legion-post-57-2730619",
      "text": "American Legion Post 57 Directory with Sidebar Ads - Lake City-Columbia County Chamber of Commerce Skip to content Login Email (386) 752-3690 Facebook Twitter Instagram LinkedIn Menu About Us Who We Are Our Team Board of Directors Success Stories Contact Membership Why Join FAQ & Resources Member News Join the Chamber Job Postings Member Login Get Involved Calendar of Events Signature Events Programs Committees Job Board Join Today! American Legion Post 57 Back to Search American Legion Post 57 Categories Nonprofit Community Organizations 2602 SW Main Blvd , Lake City , FL , 32025 (386) 752-7776 Send Email Website About Since its charter in 1920, the American Legion Post has been welcoming veterans from all branches of the U.S. Armed Forces. Today, it continues to welcome all military personnel currently serving our country. Joining the Post enables individuals to continue serving God, Country, and Community. The American Legion is the largest U.S. veterans organization, with more than 1.6 million members who strengthen the nation through programs, services, and advocacy for those who have served in the U.S. Armed Forces, as well as for youth and communities. Contacts Primary Bill   Huggins Commander Share × Print Email Facebook LinkedIn X Pinterest Close Powered By GrowthZone © 2025 Lake City-Columbia County Chamber of Commerce | Site by GrowthZone Resources Facebook Twitter Instagram LinkedIn Business card icon Member Directory Lock icon Member Login Get in touch Lake City Columbia County Chamber of Commerce Address & Map 875 SW SR 47 | Lake City, FL 32025 Phone icon (386) 752-3690 Envelope icon info@lakecitychamber.com © 2025 Lake City-Columbia County Chamber of Commerce. All Rights Reserved. Site by GrowthZone"
    },
    {
      "url": "https://americanlegion57.org/index.php?id=15",
      "text": "CONTACT US American Legion Post 57 HOME 105TH BIRTHDAY BASH NEWSLETTER VIEW NEWSLETTER SUBSCRIBE WHY JOIN POST OFFICERS POST HISTORY POST LOCATION VETERAN SERVICE OFFICERS POST VETERAN SERVICE OFFICER COUNTY VETERAN SERVICE OFFICERS MEMBERSHIP MEMBERSHIP INFO ONLINE RENEWAL APPLICATION CONTACT US BINGO KITCHEN MENU EVENTS CALENDAR BOYS STATE BENEFITS LEGION RIDERS SONS OF LEGION AUXILIARY UNIT 57 AUXILIARY ALA JUNIOR ACTIVITIES PROGRAM HONOR GUARD LIBERTY DIVISION SEA CADETS SEA CADETS HOME OFFICERS (SEA CADETS) ENROLLMENT & FEES PORTAL PRIVACY POLICY VETERAN OWNED BUSINESSES SCHOLARSHIPS RENTAL INFO VETERAN SOLUTIONS VETERAN SOLUTIONS VETERAN SOLUTIONS P2 TAPS TEXAS HOLD'EM GOVT WEB SITES FLAG ETIQUETTE NATL. HDQTRS. HOUSE RULES CONSTITUTION AND BYLAWS PURPLE HEART RESOLUTION American Legion Post 57 The American Legion myLegion Upcoming Events Patriot Day (9/11) 09/11/25 Bingo Day Session 09/11/25, 3:00PM Patriot Day Remembrance Ceremony 09/11/25, 6:00PM Bingo Night Session 09/11/25, 6:45PM Red Shirt Friday 09/12/25 See Full Calendar Download Contact Us 2602 SW MAIN Boulevard Lake City Fl 32025 Want information about our Post? Mail your questions to the above address. We will make every effort to respond to you as soon as possible. E- mail us   ( americanlegion57@comcast.net ) T elephone Us with your inquiries. Our Telephone Number is : ( 386-752-7776 ) Our Post Web Site is: ( www.americanlegion57.0rg ) Our Post welcomes your input. Forward your comments, opinions, ideas on how to improve our website. Send us your photos, notices of special events, your fundraisers and other items of interest that enhance the quality of life for the citizens of our community. Our Post, at it's sole discretion, will publish your contributions we feel are merited. Express yourself.   Become an active member of our community. © 2025 American Legion Post 57, 2602 SW Main Blvd, Lake City, Florida 32025, (386) 752-7776 Home Admin Sign In Password Reset Powered by Legionsites.com ✕ User Login Email: Password: Submit ✕ User Password Reset Please provide your user email: Submit"
    }
  ]
}