{
  "fuentes": [
    {
      "url": "https://ashp.cuny.edu/",
      "email": "cml@gc.cuny.edu"
    },
    {
      "url": "https://sproutsocial.com/insights/facebook-stats-for-marketers/",
      "email": "elizabeth.bahm@sproutsocial.com"
    },
    {
      "url": "https://www.linkedin.com/in/adam-perhosky-34843856/",
      "email": "paul@phospitality.com"
    },
    {
      "url": "https://americansocialbar.com/accessibility/",
      "email": "info@american.social"
    },
    {
      "url": "https://bocaratonobserver.com/profiles/american-social/",
      "email": "info@bocaratonobserver.com"
    }
  ],
  "mails": [
    "cml@gc.cuny.edu",
    "elizabeth.bahm@sproutsocial.com",
    "info@american.social",
    "info@bocaratonobserver.com",
    "paul@phospitality.com"
  ],
  "nombre_sitio": "americansocialbar.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://ashp.cuny.edu/",
      "text": "- American Social History Project / Center for Media and Learning News Events LGBTQ+ Histories of the United States: Summer Institute for Teachers The Visual Culture of the American Civil War and Its Aftermath Public Seminars Projects Who Built America? Open Educational Resource Resources to Historicize Recent Events Social History For Every Classroom LGBTQ+ Histories of the United States Bridging Historias CUNY Digital History Archive Mission US New Media Lab Visual Culture of the American Civil War Lost Museum Documentaries Podcast About Who We Are About ASHP Contact Us Internships Select Awards Partner with Us Challenging the ways people learn about the past ASHP/CML is a research center at the Graduate Center of the City Universtiy of New York. ASHP/CML conducts historical research, creates teaching resources, produces public media, and leads professional development seminars that explore the diverse social and cultural histories of the nation and expand how people learn about the past. Learn More Latest News Teaching with Who Built America? OER: Fall 2025 CUNY Workshops Read More ⮕ Programs and Events From summer institutes on Civil War visual culture and LGBTQ+ histories in the classroom to teacher professional development workshops and public seminars, we coordinate opportunities for teaching and learning about historical scholarship, pedagogy, and public history. Teacher Resources We have been at the forefront of technological innovation and historical research for over three decades. We began with slide decks and projectors, and now we build complex websites like our open educational resources Who Built America? and Social History for Every Classroom . Public Media We present our projects in creative ways to ensure comprehension and engagement with complex historical concepts. Our podcast library contains almost one hundred episodes on a wide range of topics; our documentaries help bring the past to life; and our consultant work on the Mission U.S. introduces “serious games” to students. Select Awards & Recognition Featured Project LGBTQ+ Histories of the United States Since 2020, the ASHP has undertaken several initiatives to support and promote the efforts of educators and public historians focused on LGBTQ+ history. View Project ⮕ New Media Lab ASHP/CML directs NML, an interdiscplinary space for Graduate Center students to explore how digital technologies can assist in their dissertation research, scholarly dissemination of their work, and teaching. NML students create multimedia projects based on their own research and integrate digital technologies into traditional academic practice, asking fresh questions in their fields and utilizing new digital tools to reach targeted audiences. The Lab contains state-of-the-art hardware and software and is committed to a vision of new technology based on open access to ideas, tools, and resources. Visit Website ⮕ Join our email list Submit ⮕ © 2024 American Social History Productions Inc."
    },
    {
      "url": "https://sproutsocial.com/insights/facebook-stats-for-marketers/",
      "text": "31 Facebook Statistics Marketers Should Know in 2025 | Sprout Social Skip to main content Toggle mobile menu Platform Core features Engagement Streamline and scale your customer care and community management Publishing Effortlessly plan, create, manage and deliver social content and campaigns Analytics Drive strategic decision making across your entire business Premium solutions Premium Analytics Prove your social media ROI with customized data and reports Listening Uncover trends and actionable insights from social conversations Employee Advocacy Amplify your social reach by empowering employees to become brand advocates Platform AI and automation Integrations Data and security Salesforce + Sprout Gain a full 360-degree customer view with this global partnership. Learn more Solutions By use case Manage social media Bolster your marketing efforts with intuitive, assistive tools Drive more sales Sell more efficiently with product and customer information in one place Gather intelligence Distill large-scale data into actionable insights to inform your social strategy Amplify brand awareness Maximize the impact and reach of your social efforts to drive better results Personalize customer care Create positive brand experiences with quick, tailored responses By service Enterprise Professional services Agencies Good connection: How Boingo Wireless seamlessly switched to Sprout Social Read the case study Pricing Resources Learn Blog Explore social media tips, best practices and strategic guidance Certification program Become an expert in the Sprout platform with specialized courses Case studies Discover the tangible results customers received by partnering with Sprout Connect Community Connect and grow with other professionals in The Arboretum, Sprout’s online forum Webinars Learn how to improve your social media efforts on demand Events Meet Sprout in person at meetups, conferences and events around the world Product resources Product updates Keep up to date with new feature releases and improvements across the platform Learning portal Explore on-demand courses to help you get the most from Sprout Help center Get step-by-step product walkthroughs and feature breakdowns 1-866-878-3231 Send us an email Log in Sprout Social Employee Advocacy Schedule a demo Try for free Close menu Sprout Blog / Social Media Marketing 31 Facebook statistics marketers should know in 2025 Brent Barnhart Written by by Brent Barnhart Published on February 20, 2025 • Reading time 11 minutes Share this article Table of Contents Share X Facebook LinkedIn Email Copy Link Share Resource Should your brand be putting Facebook first? Are your content and ads targeting the right audience? Well, staying up-to-date on the latest social media statistics for Facebook can clue you in! While other apps are in the spotlight, Facebook is still the most popular social media platform. The size and scope of its users in 2025 may surprise you, especially versus its competitors. This post breaks down key Facebook marketing statistics including new data on demographics, usage, marketing and more. Top 3 Facebook stats every marketer should know Facebook is the third most-visited website behind Google and YouTube as of 2025. This puts Meta’s mainstay network ahead of other leading platforms like TikTok and Instagram. The platform boasts 3.06 billion active users every month. This makes Facebook the most used social media platform worldwide. In 2024, Facebook’s total ad revenue amounted to $164.5 billion, up from $134 billion the previous year. Facebook usage statistics Facebook is synonymous with social media itself. It continues to be the biggest social media platform and remains widely popular on a global scale for consumers and marketers alike. Let’s kick things off with key Facebook usage statistics to understand its popularity and inform your own Facebook marketing strategy : 1. Facebook hit 3.065 billion monthly active users in 2024 By Q2 2024, monthly active users on the platform had grown to 3.065 billion after reaching the 3 billion user milestone a year prior. Although adoption has slowed down, monthly and daily usage is still seeing an upward trend. If your marketing efforts are also feeling stagnant, download our Facebook marketing template to reinvigorate your strategy. 2. Americans spend approximately 30.8 minutes on the platform daily On average, American users spend about 30.8 minutes on Facebook daily. This puts it below other platforms including TikTok, Instagram and even X. These numbers suggest that the platform is still seeing a high level of usage but less daily engagement compared to other networks. Facebook user statistics Facebook may have billions of users, but how are people actually using the platform? These Facebook user statistics can help us to find out: 3. 3.35 billion users are active daily on the Facebook family of apps According to Meta, 3.35 billion people spend at least some amount of time daily on its suite of apps including Facebook, Instagram and Messenger. Believe it or not, there are billions of people your brand could potentially reach every single day via Facebook. The key is to get ahead of the Facebook algorithm so you can boost your organic visibility. 4. 90% of social media consumers have a Facebook profile. While social platforms come and go, Facebook is still a staple of the average consumer. According to the most recent Sprout Social Index , Facebook is the most popular social media network among all consumers surveyed. Respondents said if could only use one social media network, they said they would choose Facebook. 5. Facebook is the most popular site for people to get their news The rise of social media as an information source isn’t breaking news by itself. However, the fact that Facebook is the top social media platform for people to get their news might be a surprise. From local headlines and politics to pop culture and beyond, nearly two-thirds of users (63%) rely on the platform for news updates. 6. Facebook is the second most popular platform for product discovery Recent Facebook statistics highlight how Meta has a strong hold on social commerce. Facebook (60%) comes in second only by one percentage point to Instagram (61%) as the most popular platform for product discovery according to our data . Given the boom of ads across Meta’s suite of apps, this makes perfect sense. Fun fact: Sprout Social also found that nearly 40% of Gen X consumers use the platform to make purchases. There’s no denying that Facebook remains a go-to platform for social product discovery. 7. 44% of Facebook users interact with brand content on the network at least once a day Social media is commonly used for customer support and customer care requests. Even though Facebook is a social network, it can still be a great outlet for providing customer support and improving experiences with your brand. Our data shows that 76% of consumers notice and appreciate when companies prioritize customer support, regardless of network. 8. Facebook is projected to convert 38.5% of US users to buyers this year According to eMarketer , US adults were more likely to purchase directly on Facebook in 2025. However, this puts them behind TikTok (45.5%) and just slightly ahead of Instagram (37.3%). Given the rise of TikTok Shop, this stat might not be too shocking. That said, Facebook still has its own social commerce powerhouse in the form of Facebook Marketplace. 9. 40% of Facebook’s user base actively shop on Facebook marketplace Data from Capital One highlights the boom of Facebook Marketplace and its millions of shoppers (and billions of transactions). The report also notes that approximately 16% of active Facebook users exclusively have a presence on the platform to use its Marketplace features. Facebook audience and demographics statistics Wondering if you’re reaching the right audience on Facebook ? What if your target demographic isn’t even on the platform? Here are a few Facebook stats breaking down the platform’s core audience and demographics: 11. Gen X represents Facebook’s largest audience Remember when we said that 90% of consumers have a Facebook profile? Facebook is used most by Gen X , followed by Baby Boomers and Millennials . This varies for Gen Z, who is most likely to have Instagram (89%), YouTube (84%) and TikTok (82%) profiles instead. 12. Facebook is the most popular channel for customer care among millennials, Gen X and Baby Boomers Facebook gives users a direct line to businesses via Messenger, Groups, Events and more. That’s why it’s the most popular channel for customer care across millennials, Gen X and Baby Boomers. Having a presence on the platform is pretty much non-negotiable no matter who your target audience is. Given that 73% of consumers claim they’ll bounce to a competitor if they don’t receive timely customer care, brands can’t afford to ignore Facebook as a service channel. 13. Mothers in the US spend 2.3x the time on Facebook than they do on TikTok According to recent Comscore data via eMarketer , moms across demographics are glued to Facebook and Facebook Messenger. Facebook groups for mothers dominate the platform, which may come as a surprise given the popularity of #MomTok and other niche communities on other platforms. 14. Facebook has more male-identifying users than female Facebook currently limits its reporting to male and female. And based on the data, the platform has a higher percentage of male users (56.8%) than female users (43.2%). 15. India has the largest Facebook audience size While Facebook sees significant usage across various countries, India has the greatest number of users. Latest reports show that there are 378.05 million Facebook users in India. The United States comes next, with 193.8 million users. Facebook advertising and marketing statistics Is Facebook marketing still worth it? And are you getting the most out of your Facebook advertising strategy ? Check out these Facebook ads statistics to understand advertising impact on the platform. 16. Facebook ads see an average click-through rate (CTR) of 2.53% According to a WordStream study , Facebook ads get an average CTR of 2.53% across all industries for lead-gen ads. That said, click-throughs vary for industries, with arts & entertainment and real estate among the highest. Facebook traffic ads and campaigns see a lower CTR, with the average rate being 1.57% across all industries. Arts & entertainment, real estate, restaurants & food and travel all see a CTR above 2%. 17. Advertising for traffic campaigns on Facebook costs $0.77 per click The same study found that the average cost per click (CPC) is $0.77 across all industries for traffic ads which is down from the previous year. The average cost per click is $1.88 for lead gen ads, also down slightly from $1.92 last year. However, you can expect to pay much more in certain industries or campaign ads. For example, lead gen ads have a CPC of $8+ for attorneys and $4+ for dentists and physicians. 18. The average conversion rate on Facebook is 8.78% across industries Facebook sees a fairly high conversion rate for ads on the platform. On average, you can expect a conversion rate of about 8.78% for your Facebook ad. The specifics vary depending on your industry, though. Dental services, industrial & commercial and real estate sectors see higher conversion rates. 19. Facebook is among the top three ROI drivers for marketers With such high conversion rates and low CPC, marketing on Facebook yields high returns. In fact, 40% of marketers cite Facebook as one of their top three drivers of ROI when it comes to social media platforms. Facebook engagement statistics With organic visibility on Facebook on the decline, it’s only natural to see a drop in engagement levels as well. But does this put Facebook at a disadvantage over other social media platforms? Here’s a quick look at some vital stats to understand where Facebook engagement currently stands: 20. The average engagement rate on Facebook is 0.063% According to a SocialInsider study , brands see a median Facebook engagement rate of 0.015% across all industries. This puts Facebook as one of the less engaging social media platforms, neck-in-neck with X. 21. Albums and photo posts have the highest engagement The power of visuals is still evident on Facebook, with album posts getting just below 0.15% engagement . Video posts come next with an average engagement rate of 0.12%. Status posts perform fairly well with an average engagement rate of 0.11%. Link posts, on the other hand, are the worst for driving engagement. They see an average engagement rate of only 0.04%. 22. Frequent posting doesn’t result in higher engagement Contrary to popular belief, posting frequently doesn’t necessarily result in higher engagement. As a RivalIQ study points out, influencers and the higher education industry see the greatest engagement compared to their posting frequency. For example, influencer pages publish just ~4 posts per week but earn some of the highest engagement on the platform. Meanwhile, higher education companies companies publish 6+ posts a week and see similar numbers. The takeaway? It’s about your audience and industry, not hitting an arbitrary post count. Rather than post frequency, post publishing should be a factor in your strategy. Know the best time to post on Facebook so you stand a better chance of driving engagement. Facebook video statistics As video marketing continues to gain popularity, it’s important to be aware of how video performs on Facebook. Here are some key Facebook video statistics to inform your strategy: 23. 40% of the time users spend on Facebook and Instagram is watching videos Even with the boom of short-form video platforms like TikTok, approximately 40% of time spent on Facebook (and Instagram) is watching video content. This means your audience likely watches video content on the app, and creating Reels can help you reach more people. We’ve created a quick guide on creating a successful s ocial media video strategy , if you need a refresher. 24. Vertical video with audio sees 12% higher conversions Facebook Reels have been popular on the app since they were created and integrated into the app from Instagram. Facebook discovered that vertical videos (Reels) with audio see a 12% higher conversion rate than other types of video content on the platform. Facebook feature stats (Reels, Stories, Messenger) So, what sort of content should you post? What features are growing and what are stagnant? Let’s review some Facebook stats that break down some of the platform’s key features, like Facebook Stories , Reels and Messenger: 25. More than 500 million people still use Stories every day According to internal Facebook data , half a billion people use Facebook Stories each day and more than 1 billion Stories are shared every day across the Meta apps. Meanwhile, the feature attracts 4+ million advertisers every month. This speaks to the popularity of the platform’s feature, making it a useful tool for brands to engage their audience. 26. Facebook Messenger has 194 million users in the US On its own, Facebook Messenger boasts 194 million users in the US as of January 2025. That’s almost 200 million people you could potentially reach through ads on Messenger. 27. Users reshare 3.5 billion Reels daily across Facebook and Instagram The popularity of Reels isn’t dying out anytime soon. Last year, we learned that Reels see about 200 billion views daily across the Facebook family of apps. Fast-forward to 2025 and 3.5 billion Reels are shared daily across Meta. With algorithms further pushing this format, Reels could help you gain visibility and engagement. Brands can’t afford to put this short-form video format on the back burner. Facebook influencer statistics Facebook remains a key platform for influencer marketing, but how does it truly perform? While the platform boasts massive reach, engagement rates tend to be lower than on video-centric platforms like TikTok and Instagram. We’ve broken down the most critical insights from Sprout Social Influencer Marketing data on engagement, cost per post and audience interactions. 28. Facebook influencer engagement rates are relatively low compared to other networks Engagement rate is one of the most telling metrics for influencer marketing success, as it reflects how audiences interact with content. According to our Sprout Social Influencer Marketing data, the average engagement rate per post from a Facebook influencer in 2024 was 0.11% . Engagement rates vary by post type: Reels outperformed all other post types , with an average engagement rate of 0.23%. Videos had a 0.17% engagement rate. Photo posts lagged at 0.08%. Text posts had the lowest engagement, averaging 0.07%. This shows the growing dominance of short-form video content (Reels) for Facebook influencer marketing. As part of your influencer marketing strategy on this network, prioritize more dynamic and engaging video collaborations for maximum engagement. This, along with making sure your content is relevant to your target audience, can boost the engagement of your influencer marketing campaigns on Facebook. 29. Facebook nano- and micro-influencers provide substantial ROI Understanding pricing expectations is crucial for budgeting influencer marketing campaigns. Here’s a breakdown of the average cost per post based on Facebook influencer tier from 2024: Nano-influencers (1K–10K followers): $137.50 Micro-influencers (10K–50K followers): $750 Mid-tier influencers (50K–500K followers): $6,875 Macro-influencers (500K–1M followers): $18,750 Mega-influencers (1M+ followers): $137,500 Celebrities : $275,000 When compared with platforms like TikTok and Instagram, top-tier influencers on Facebook come with a higher price tag. But if you’re looking to maximize your budget, nano- and micro-influencers on Facebook can be a cost-effective entry point for influencer campaigns on this social network. Nano- and micro-influencers not only come at a lower cost per post but also have highly engaged, niche audiences and more genuine connections than creators with larger followings. 30. Facebook influencer content generated $63.1 billion in Earned Media Value in 2024 In 2024, the total Earned Media Value (EMV) of all Facebook influencer posts was valued at $63.1 billion, according to Sprout Influencer Marketing data. With $63.1 billion in EMV on Facebook in 2024, you’ll see that influencer content is still a powerhouse for brand exposure. Even though engagement rates on the platform are relatively low, the impact is undeniable. 31. The U.S., India and Latin America show the highest levels of Facebook influencer engagement Global reach is a major advantage of Facebook, but engagement levels vary by region. Our Sprout Influencer Marketing data shows the top five countries with the highest engagement from Facebook influencer content in 2024: United States : 4.84 billion engagements India : 1.43 billion engagements Mexico : 1.41 billion engagements Brazil : 1.1 billion engagements Italy : 1.05 billion engagements The U.S. leads by a significant margin, but specifically Mexico and Brazil also show strong engagement levels. Facebook users in these regions are highly engaged with influencer content. This means localized partnerships for these target countries can drive stronger brand affinity and higher conversion rates. How do these Facebook stats inform your social media strategy? These Facebook statistics show that the platform is thriving for marketers and consumers alike. We hope you have a better idea of what types of content, ads and messaging make the most sense for your brand and its specific audience. If you want to take your strategy to the next level when it comes to engagement and efficiency, check out these Facebook marketing tools that can help! Facebook statistics FAQs What are statistics for Facebook Reels? Reels on Meta (including Facebook and Instagram) account for 40.8% of social users’ video consumption. Across Facebook and Instagram, Reels earn about 200 billion daily views . Is Facebook still growing? Usage across Meta’s family of apps (including Facebook) has grown quarter-over-quarter to 3.35 billion daily users as of Q4 2024. Facebook adoption slowed down last year, although the platform still hit 3 billion monthly active users by the end of Q4 2023. US Facebook users are still spending around 31 minutes per day on the platform. What are the demographics of Facebook? As of January 2024, Facebook has a higher percentage of male users (56.8%) than female users (43.2%). The largest age demographic of Facebook users in the United States is between the ages of 25 and 34. Categories Facebook Social Media Marketing Social Media Trends Brent Barnhart Brent Barnhart is a professional writer and content critic. When he's not battling the latest buzzwords, you can often find him strumming the nearest guitar. Feel free to bug him on Twitter or check out his website ( brentwrites.com ) Read all articles by Brent Barnhart Try Sprout Social free with a 30-day trial Utilize Sprout’s Instagram integration to create, schedule, publish and engage with posts. Try Sprout for free * No Credit Card Required Recommended for you View all Recommended for you Recommended for you Categories Social Media Analytics Social Media Marketing Social media is the new search engine. Are you ready? Published on September 9, 2025 • Reading time 11 minutes Categories Social Media Advertising Social Media Marketing TikTok Promotion: Boost your visibility in 2025 Published on September 8, 2025 • Reading time 7 minutes Categories Social Media Marketing Social Media Search TikTok SEO: The essential guide for brands in 2025 Published on September 5, 2025 • Reading time 18 minutes Categories Instagram Social Media Marketing Instagram SEO strategies for in-app and search engine discoverability Published on September 5, 2025 • Reading time 15 minutes Build and grow stronger relationships on social Sprout Social helps you understand and reach your audience, engage your community and measure performance with the only all-in-one social media management platform built for connection. Try Sprout for free"
    },
    {
      "url": "https://www.linkedin.com/in/adam-perhosky-34843856/",
      "text": "Adam Perhosky - American Social Bar and Kitchen | LinkedIn Skip to main content LinkedIn Top Content People Learning Jobs Games Sign in Join now Adam Perhosky Sign in to view Adam’s full profile Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New York City Metropolitan Area Contact Info Sign in to view Adam’s full profile Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . 2K followers 500+ connections See your mutual connections View mutual connections with Adam Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Join to view profile Message Sign in to view Adam’s full profile Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . American Social Bar and Kitchen Florida State University Report this profile Activity Follow Sign in to view Adam’s full profile Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . I had a great time checking out what Lesly Lima & her Fogo de Chão team have to offer with my good friends Kishan Ramsammy and Evantz Saint-Gerard… I had a great time checking out what Lesly Lima & her Fogo de Chão team have to offer with my good friends Kishan Ramsammy and Evantz Saint-Gerard… Liked by Adam Perhosky Tampa mayor Jane Castor stopped by campus last week to visit with the leaders of Jesuit High School, including new school president Fr. Vincent… Tampa mayor Jane Castor stopped by campus last week to visit with the leaders of Jesuit High School, including new school president Fr. Vincent… Liked by Adam Perhosky It’s great to see industry leaders come together to learn, share and grow. It’s great to see industry leaders come together to learn, share and grow. Liked by Adam Perhosky Join now to see all activity Experience & Education American Social Bar and Kitchen ******** ** ***** & ****** ****-**** ******** ***** *********** *** ******** ***** ******** ** ******** *********** ******* ***** ********** ********'* ****** *********** **************/********** 2008 - 2012 View Adam’s full experience See their title, tenure and more. Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . More activity by Adam You can't fully understand a project without visiting the site and kicking the tires. We do that for every EB-5 project we work on, especially for… You can't fully understand a project without visiting the site and kicking the tires. We do that for every EB-5 project we work on, especially for… Liked by Adam Perhosky After an incredible 6.5-year journey, I've just closed my chapter at DoorDash to prioritize my health. Please check out my latest Medium article… After an incredible 6.5-year journey, I've just closed my chapter at DoorDash to prioritize my health. Please check out my latest Medium article… Liked by Adam Perhosky We’re proud to announce the opening of our newest distribution center in Miami, Florida, a key milestone in our continued growth across the… We’re proud to announce the opening of our newest distribution center in Miami, Florida, a key milestone in our continued growth across the… Liked by Adam Perhosky Exciting news! Please join me in welcoming Patrick Younger to GuidePoint Security’s Southeast Team as our new Florida Director of Sales, based in… Exciting news! Please join me in welcoming Patrick Younger to GuidePoint Security’s Southeast Team as our new Florida Director of Sales, based in… Liked by Adam Perhosky Funds for these visits and college applications are provided by Cristo Rey! Funds for these visits and college applications are provided by Cristo Rey! Liked by Adam Perhosky Please follow Will Hagen and I as we embark on this brotherhood and nonprofit journey founded in memory and to continue the legacy of our dear… Please follow Will Hagen and I as we embark on this brotherhood and nonprofit journey founded in memory and to continue the legacy of our dear… Shared by Adam Perhosky Dear Olivia Bar & Kitchen is looking for an experienced restaurant manager. Please send resumes to Paul@Phospitality.com \n\nThank you! Dear Olivia Bar & Kitchen is looking for an experienced restaurant manager. Please send resumes to Paul@Phospitality.com \n\nThank you! Liked by Adam Perhosky 🌟 Bay Personnel – Recruiting Done Right Across Three Critical Industries 🌟\nAt Bay Personnel, we’ve built our reputation by delivering exceptional… 🌟 Bay Personnel – Recruiting Done Right Across Three Critical Industries 🌟\nAt Bay Personnel, we’ve built our reputation by delivering exceptional… Liked by Adam Perhosky FREE Entry for all interested investors in South Florida! Just reach out to me to get on the list.\n\nExcited to be speaking tomorrow at the EB5… FREE Entry for all interested investors in South Florida! Just reach out to me to get on the list.\n\nExcited to be speaking tomorrow at the EB5… Liked by Adam Perhosky After the “Gold Card” comment in February, the EB-5 market shifted overnight.\n\nFor two weeks, investors paused. But once the dust settled, it was all… After the “Gold Card” comment in February, the EB-5 market shifted overnight.\n\nFor two weeks, investors paused. But once the dust settled, it was all… Liked by Adam Perhosky Liked by Adam Perhosky Liked by Adam Perhosky Fresh off \"half time\" to reset and recharge, I couldn’t imagine a better way to dive right in than stepping on stage at EventCamp with over 400 of… Fresh off \"half time\" to reset and recharge, I couldn’t imagine a better way to dive right in than stepping on stage at EventCamp with over 400 of… Liked by Adam Perhosky Wow -- that’s a wrap on EventCamp 2025! A huge thank you to our incredible attendees, speakers, partners, employees, and the Encore Boston Harbor… Wow -- that’s a wrap on EventCamp 2025! A huge thank you to our incredible attendees, speakers, partners, employees, and the Encore Boston Harbor… Liked by Adam Perhosky The summer before my senior year at Jesuit High School of Tampa, FL, I walked into the office of then-President Fr. Joseph F. Doyle, S.J., to tell… The summer before my senior year at Jesuit High School of Tampa, FL, I walked into the office of then-President Fr. Joseph F. Doyle, S.J., to tell… Liked by Adam Perhosky View Adam’s full profile See who you know in common Get introduced Contact Adam directly Join to view full profile Other similar profiles Michelle Zara Small Business Fleet Account Manager / Customer Service Maniac at Take 5 Oil Change Greater New Orleans Region Connect Rachael Rose Catering & Event Sales Director Charleston County, SC Connect Kenneth Ritter General Manager at Rancho Viejo Resort & Country Club. Brownsville Metropolitan Area Connect Rosemary Renteria-Vera Owner, Create Four Group || Hospitality Consultant\nOwner, Opulent-Travels || Travel Adviser Anaheim, CA Connect Anna Vagner Director of Events New York, NY Connect David Strader San Francisco Bay Area Connect Suzanne Blezard Hospitality Leader, Culture Champion, Sustainability Advocate New York City Metropolitan Area Connect Kate Conaway Director of Sales and Event Planning at Jamie Hollander Catering & Events New Hope, PA Connect Katrina Michael Chicago, IL Connect Explore top content on LinkedIn Find curated posts and insights for relevant topics all in one place. View top content Add new skills with these courses 1h 17m Logo Development: Identity Delivery 1h 31m Leveraging AI for Small and Medium Business Growth 40m Creating a Design Enterprise See all courses LinkedIn © 2025 About Accessibility User Agreement Privacy Policy Cookie Policy Copyright Policy Brand Policy Guest Controls Community Guidelines العربية (Arabic) বাংলা (Bangla) Čeština (Czech) Dansk (Danish) Deutsch (German) Ελληνικά (Greek) English (English) Español (Spanish) فارسی (Persian) Suomi (Finnish) Français (French) हिंदी (Hindi) Magyar (Hungarian) Bahasa Indonesia (Indonesian) Italiano (Italian) עברית (Hebrew) 日本語 (Japanese) 한국어 (Korean) मराठी (Marathi) Bahasa Malaysia (Malay) Nederlands (Dutch) Norsk (Norwegian) ਪੰਜਾਬੀ (Punjabi) Polski (Polish) Português (Portuguese) Română (Romanian) Русский (Russian) Svenska (Swedish) తెలుగు (Telugu) ภาษาไทย (Thai) Tagalog (Tagalog) Türkçe (Turkish) Українська (Ukrainian) Tiếng Việt (Vietnamese) 简体中文 (Chinese (Simplified)) 正體中文 (Chinese (Traditional)) Language Agree & Join LinkedIn By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . View Adam’s full profile Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy ."
    },
    {
      "url": "https://americansocialbar.com/accessibility/",
      "text": "Accessibility | Restaurant and Bar | American Social Skip to main content Order Online Our Menus Our Locations Private Events Gift Cards Boca Fort Lauderdale Miami Orlando Tampa Reservations What’s On About Us Catering Careers Contact Accessibility Our Menus Our Locations Private Events What’s On About Us Order Online Careers Contact Accessibility AMSO Accessibility American Social’s Commitment to Accessibility At American Social everyone is welcome and we want to ensure that all guests have full access to all of the products, services, and information offered at our restaurants – including our website. To that end, we have taken steps to maximize the accessibility of our website to work with industry-standard screen reading software. We have also upgraded the site to include contrast and font adjustments to make each page more easily navigable for our visually impaired guests. We completely understand that not everyone is similarly suited; there is no one-size-fits-all solution that will guarantee a flawless user experience for everyone or the computer hardware/software used to access this website. American Social, therefore, believes that communication with its guests is of paramount importance to enable us to appropriately respond to each guest’s unique circumstances. While we have made every effort to anticipate the needs of all of our guests, the only way we can know if a guest has encountered a barrier to accessing our website is if we are notified of the issue. Please rest assured that American Social is ready, willing, and able to offer auxiliary aids and services to all of our guests for the purpose of allowing them full and equal access to our website. For example, upon request we will have any portion of our website read aloud to our guests by a qualified reader to the extent such guests are otherwise unable to access the website. Our staff is also happy to assist guests with making reservations to the extent such guests encounter difficulty in scheduling a reservation through our website. Please use the “CONTACT” link at the top of this page to advise American Social of any accessibility barriers encountered by our guests. Alternatively, please feel free to email us at info@american.social or call us at the following numbers: (954) 764-7005 (Ft. Lauderdale); (305) 223-7004 (Miami); (813) 605-3333 (Tampa); (407) 454-9992 (Orlando), or (561) 486-5434 (Boca). Newsletter Sign Up Ft. Lauderdale Miami Tampa Orlando Boca Raton Email Address By signing up, you agree to e-mail marketing. You can opt-out at any time. Sign Up Quick Links Our Locations About Us What’s On Private Events Our Menus Contact Careers Accessibility Follow Us Instagram Facebook © American Social 2025 Privacy Policy Website by Ignite Follow Us © American Social 2025 Privacy Policy Website by Ignite Manage Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent Thank you for signing up"
    },
    {
      "url": "https://bocaratonobserver.com/profiles/american-social/",
      "text": "American Social - bocaratonobserver.com Skip to main content Search Subscribe facebook instagram RSS Culture Buzz Destinations Features Style Wellness Food & Drink Bites Cheers Chef Profile Readers’ Choice Restaurant Guide Restaurant News Review Community Around Town Community News Flash Giving Back La Vida Boca Happenings Calendar Editor's Corner Out 'N' About Guides Charity Country Clubs Education Top Docs Top Lawyers Visitors Profiles Country Club Collection Cuisine Scene Health Care Heroes Inspired Home Men On The Move Power Players Professional Edge Top Docs Top Lawyers Wonder Women Fresh Picks Country Club Collection Cuisine Scene Health Care Heroes Inspired Home Men On The Move Power Players Professional Edge Top Docs Top Lawyers Wonder Women Home Profiles American Social American Social Restaurateur November 24, 2023 7:35 AM RSS Print × Expand Rick Mijares Restaurateur American Social, affectionately known as AmSo, transcends the boundaries of a typical restaurant — it stands as a dynamic venue where positive vibes and unforgettable moments come to life. Established in Fort Lauderdale in June 2012 by co-owner Rick Mijares, AmSo is on the brink of unveiling its sixth location in beautiful Delray Beach. Mijares, an ardent advocate of hospitality, seamlessly intertwines his passion for networking, crafting memorable experiences and a deep love for food to define the essence of AmSo. His journey embarked in 2010 with a meticulously crafted business plan, endorsed by his parents, Tony and Laurie Mijares, who became co-founders and managing partners. Despite initial challenges and a trial-by-fire experience, AmSo has thrived. Mijares’ unwavering dedication has yielded success, resulting in five flourishing locations in Fort Lauderdale, Miami, Tampa, Orlando and Boca Raton. Expand AmSo’s triumph goes beyond its expanding customer base, evident in a noteworthy collection of accolades. Over the last five years, the establishment has earned numerous awards, including recognition as the “Best Late Night Waterfront Spot for Cocktails” by Tampa Bay Metro and the esteemed “Very Best Burger Award” at the South Beach Wine & Food Festival. Culinary excellence takes center stage with innovative dishes like the award-winning salmon creation by Executive Chef Ryan Leonard. This commitment to quality has not only garnered awards but also resonated with the community, securing AmSo the 2023 Readers’ Choice award for “Best New Restaurant.” With a dedicated staff of over 600, Mijares remains hands-on, personally visiting the restaurants, connecting with his team and ensuring that AmSo remains more than just a business — it’s a family, lovingly referred to as their “FAMSO.” The familial atmosphere is a testament to AmSo’s commitment to fostering meaningful connections within its ranks and the broader community. American Social, 351 W. Plaza Real, Boca Raton, 561-710-7272, americansocialbar.com Power Players Special Advertising Section Back to Search Results Tags Power Players Profile November 24, 2023 7:35 AM 7700 Congress Ave., Suite 3115 Boca Raton, FL 33487 561-982-8960 info@bocaratonobserver.com About Team Advertise Sponsorships Awards Issue Archive Subscribe Careers Contact Privacy Policy Terms © 2024 A&A Publishing Corp Built with Metro Publisher™"
    }
  ]
}