{
  "fuentes": [
    {
      "url": "https://thefeastrestaurantami.com/contact-us/",
      "email": "accessibility@example.org"
    },
    {
      "url": "https://thefeastrestaurantami.com/contact-us/",
      "email": "info@thefeastrestaurantami.com"
    },
    {
      "url": "https://www.mikenormanrealty.com/island-info/restaurants-dining/anna-maria-island-beach-cafe/",
      "email": "info@mikenormanrealty.com"
    },
    {
      "url": "https://amirentals.com/guide-to-eating-out-on-anna-maria-island/",
      "email": "info@amirentals.com"
    },
    {
      "url": "https://www.islander.org/2022/02/bistro-magic-changes-hands/",
      "email": "info@islander.org"
    },
    {
      "url": "https://www.islander.org/2022/02/bistro-magic-changes-hands/",
      "email": "news@islander.org"
    },
    {
      "url": "https://www.islander.org/2022/02/bistro-magic-changes-hands/",
      "email": "sales@islander.org"
    },
    {
      "url": "https://www.annamarialifevacationrentals.com/blog/ami-beach-cafe/",
      "email": "lindsey@annamarialifevacationrentals.com"
    },
    {
      "url": "https://www.annamarialifevacationrentals.com/restaurants/holmes-beach-restaurants/",
      "email": "lindsey@annamarialifevacationrentals.com"
    },
    {
      "url": "https://annamariaislandchamber.org/board-of-directors/",
      "email": "info@annamariaislandchamber.org"
    }
  ],
  "mails": [
    "accessibility@example.org",
    "info@amirentals.com",
    "info@annamariaislandchamber.org",
    "info@islander.org",
    "info@mikenormanrealty.com",
    "info@thefeastrestaurantami.com",
    "lindsey@annamarialifevacationrentals.com",
    "news@islander.org",
    "sales@islander.org"
  ],
  "nombre_sitio": "amibeachcafe.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://thefeastrestaurantami.com/contact-us/",
      "text": "Contact Us - Holmes Beach Restaurant - The Feast Restaurant on Anna Maria Island Skip to main content Skip to footer (941)778-5092 5406 Marina Drive Holmes Beach, FL 34217 Menus Dinner Menu Craft Cocktails Wine Menu Beer Menu Specials Menu Spirits and Liquors Menu About us What’s New Local Links Privacy Policy Disclaimer Photo Gallery Order Online Contact Us Menus Dinner Menu Craft Cocktails Wine Menu Beer Menu Specials Menu Spirits and Liquors Menu About us What’s New Local Links Privacy Policy Disclaimer Photo Gallery Order Online Contact Us Menus Dinner Menu Craft Cocktails Wine Menu Beer Menu Specials Menu Spirits and Liquors Menu About us What’s New Local Links Privacy Policy Disclaimer Photo Gallery Order Online Contact Us 5406 Marina Drive Holmes Beach, FL 34217 (941)778-5092 Menus Dinner Menu Craft Cocktails Wine Menu Beer Menu Specials Menu Spirits and Liquors Menu About us What’s New Local Links Privacy Policy Disclaimer Photo Gallery Order Online Contact Us Menus Dinner Menu Craft Cocktails Wine Menu Beer Menu Specials Menu Spirits and Liquors Menu About us What’s New Local Links Privacy Policy Disclaimer Photo Gallery Order Online Contact Us Contact us Contact us Our Location The Feast Restaurant 5406 Marina Drive Holmes Beach, FL 34217 Contact Us (941) 778-5092 The Restaurant phone number is (941) 778-5092. This number may be used for reservations, catering, or to speak to an employee or manager if you have any questions. We answer calls from 3:30 a.m. until 9:00 p.m. 7 days a week. If you cannot reach us during this time we are on the other line or busy helping another customer and will be available momentarily so please call back. Please do not leave food orders or messages on this line as it is not regularly checked. DIRECTIONS From Anna Maria City We are located in Holmes Beach in the Island Shopping Center. If you are traveling from Anna Maria city you can proceed south on Gulf Drive or Marina Drive until you reach the intersection of Gulf and Marina. The plaza is on the left hand side as you approach the light and either enterence will take you in front of the restaurant. Parking is free and available anywhere in the lot. DIRECTIONS From State Rd. 64 (Manatee Avenue) Proceed west on Sr 64 until you reach the stop light at the intersection of Gulf Dr. and Sr 64. Veer right at the light and you will follow Gulf Drive until you reach the intersection of Gulf and Marina (approx. 1/2 mile). At the light if you look ahead to your right you will see the Island Shopping Center, and our sign. Parking is free and available anywhere in the lot. DIRECTIONS From Longboat Key Proceed north on Gulf Dr. until you reach the intersection at Gulf and East Bay Drive. You may take either of these roads as they both eventually rejoin in the same place. Continue north until you reach the intersection of Gulf Dr. and Marina. At the light if you look ahead to your right you will see the Island Shopping Center, and our sign. Parking is free and available anywhere in the lot. Lets Order The Best Food Now Order online Address 5406 Marina Drive Holmes Beach, FL 34217 Phone (941) 778-5092 Quick Links Home About Us Dinner Menu Order Online What’s New Contact Us Local Links The Anna Maria Islands Sun The Islander ConsideritDoneAMI.com Anna Maria Island Chamber of Commerce Legal Disclaimer Privacy Policy Copyrights@2023. Feast Restaurant. All Rights Reserved ACCESSIBILITY STATEMENT FOR FEAST RESTAURANT This is an accessibility statement from Feast Restaurant URL: https://thefeastrestaurantami.com/ Feast Restaurant is committed to ensuring digital accessibility for people with disabilities. We are continually improving the user experience for everyone, and applying the relevant accessibility standards. Efforts to support accessibility Hurricane Liquors takes the following measures to ensure accessibility: Accessibility is part of our mission statement. Accessibility is part of our internal policies. Clear accessibility targets and responsibilities exist within the organization. Formal accessibility quality assurance methods exist within the organization Conformance status Current accessibility standard of the site: WCAG 2.1 level AA Current content conformance status: Fully conformant: the content fully conforms to the accessibility standard without any exceptions. Compatibility with browsers and assistive technology This site is designed to be compatible with the following browsers: chrome internet explorer firefox Technologies Accessibility of this site relies on the following technologies to work: HTML WAI-ARIA CSS JAVASCRIPT SMIL Assessment methods Feast Restaurant assessed the accessibility of this site using the following method(s): Self-evaluation: the site was evaluated internally by the company or organization. Feedback process We welcome your feedback on the accessibility of this site. Please contact us via one of the following methods: Phone: +12 34 56 89 E-mail: accessibility@example.org Postal Address: 1 Example Street, Suburb, Country, Postcode We aim to respond to feedback within 7 business days. PRIVACY POLICY FOR FEAST RESTAURANT This Privacy Policy explains how FEAST RESTAURANT (“we”, “us”, or “our”) collects, uses, and discloses your personal information when you use our website, hurricanehanks.com (“Site”), and when you interact with us as a customer of our restaurant. We are committed to protecting the privacy of our customers and ensuring the security of their personal information. By using our Site or our restaurant, you agree to the terms of this Privacy Policy. Information We Collect We collect information that you provide to us, such as your name, email address, telephone number, and credit card information when you make a reservation or place an order through our Site or in-person. We may also collect information from you through our loyalty program, social media pages, and surveys. We may also collect information about your device and your usage of our Site, such as your IP address, browser type, and pages visited. Use of Information We use the information we collect to: Fulfill your reservations and orders and provide customer support Improve our products and services Communicate with you about promotions and updates Personalize your experience with our restaurant and Site Comply with legal obligations We may use third-party service providers to assist us in these activities, such as payment processors, email service providers, and website analytics providers. Disclosure of Information We may disclose your personal information to: Service providers who assist us in providing our products and services Law enforcement or other government officials as required by law Other third parties with your consent We do not sell or rent your personal information to third parties for their marketing purposes. Data Security We take reasonable measures to protect the security of your personal information, including using encryption technology to transmit sensitive data. Children’s Privacy Our Site and restaurant are not intended for children under the age of 13. We do not knowingly collect personal information from children under the age of 13 without parental consent. Changes to this Privacy Policy We may update this Privacy Policy from time to time. We will post any changes on this page and, if the changes are significant, we will provide a more prominent notice. You should check this page periodically to review any changes. Contact Us If you have any questions about this Privacy Policy or our privacy practices, you may contact us at info@thefeastrestaurantami.com DISCLAIMER RESTAURANT Last updated February 06, 2023 Website Disclaimer The information provided on our menu, website [ https://thefeastrestaurantami.com/], or any other promotional material is for general informational purposes only. We make every effort to ensure the accuracy of the information, however, we cannot guarantee that all information is up to date and free from errors. Prices and availability of menu items may be subject to change without notice. In addition, we cannot guarantee that our menu items are free from allergens or cross-contamination. Please inform your server of any food allergies or dietary restrictions prior to ordering. Thank you for dining with us. Testimonials Disclaimer The Site may contain testimonials by users of our products and/or services. These testimonials reflect the real-life experiences and opinions of such users. However, the experiences are personal to those particular users, and may not necessarily be representative of all users of our products and/or services. We do not claim, and you should not assume, that all users will have the same experiences. YOUR INDIVIDUAL RESULTS MAY VARY. The Site may contain testimonials by users of our products and/or services. These testimonials reflect the real-life experiences and opinions of such users. However, the experiences are personal to those particular users, and may not necessarily be representative of all users of our products and/or services. We do not claim, and you should not assume, that all users will have the same experiences. YOUR INDIVIDUAL RESULTS MAY VARY. Testimonials on our website or social media pages are provided by our customers voluntarily and are their personal opinions. We do not claim or guarantee that these testimonials are representative of everyone’s experience with our restaurant. Results may vary based on individual preferences and experiences. We appreciate all feedback and strive to provide excellent service to all of our customers."
    },
    {
      "url": "https://www.mikenormanrealty.com/island-info/restaurants-dining/anna-maria-island-beach-cafe/",
      "text": "Anna Maria Island Beach Cafe | Mike Norman Realty Skip to main content 800-367-1617 My Rentals Recently Viewed (0) Rentals Browse by Type Pet-Friendly Rentals with a Pool Waterfront Group Rentals Beachfront Rentals Browse by City Anna Maria Island Bradenton Beach City of Anna Maria Cortez Holmes Beach Longboat Key Browse By Bedrooms 1 Bedroom 2 Bedrooms 3 Bedrooms 4 Bedrooms 5 Bedrooms 6 Bedrooms Featured Rentals Rentals List Rentals Map All Rentals Sales Our Listings Search All Sales Meet Our Team Island Info About Meet Our Team Property Management FAQ Terms & Conditions Contact Anna Maria Island Beach Cafe Anna Maria Island Beach Cafe offers casual gulf front patio and indoor dining on Anna Maria Island’s beautiful Holmes Beach. We have an abundant menu selection that will please everyone! We are famous for our Pancakes & Sausage. We also have fresh omelettes, 1/2 pound cheese burgers, fish platters, colossal salads and kids meals. Every Friday we have an ALL-U-Can-Eat Fish Fry. At Anna Maria Island Beach Cafe’s Bamboo Beach Bar you can play in the sand and see a stunning sunset while listening to our nightly live entertainment and sipping one of our “Island Size” drinks. AMENITIES Outdoor showering facilities Bathrooms and changing areas Volleyball Children’s Playground Tiki Bar Live Music Nightly Cold Beer Indoor Dining Outdoor Gulf Front Dining Open 7 am daily, serving breakfast, lunch, and dinner Plan Your Visit What do you need more than some seafood while at the beach? An Anna Maria Island vacation rental to spend the night in! Contact us today. View All Rentals Anna Maria Island Beach Cafe is located at the end of State Road 64 (Manatee Avenue) and Gulf Drive in Holmes Beach on Anna Maria Island. 4000 Gulf Drive Holmes Beach, FL 34217 Phone: (941) 778-0784 Online: www.amibeachcafe.com Anna Maria Island Beach Cafe Plan Your Anna Maria Island Vacation! View All Rentals Anna Maria Island Rentals See All Holmes Beach Rentals See All Bradenton Beach Vacation Rentals See All Waterfront Rentals See All Recent Posts A Nature Lover’s Retreat: 7 Nature Preserves Near Anna Maria Island Meet The Islanders For Clean Water Connect With Nature On An Eco Tour During Your AMI Vacation A Foodie’s Guide To Our Favorite Bradenton Beach Restaurants 4 Amazing Breakfast Restaurants In Bradenton Beach Categories Activities & Things To Do Area Attractions Beaches & Parks Events Restaurants & Dining Shopping & Rentals Mike Norman Realty, Inc. 3101 Gulf Drive Holmes Beach, Florida 34217 800-367-1617 941-778-6696 Owner Login Rentals Waterfront Rentals Pet-Friendly Rentals Rentals with a Pool Island Rentals Rentals A-Z Quick Search Properties For Sale About Us Island Info Rentals Map Newsletter Email * Name This field is for validation purposes and should be left unchanged. Δ © Copyright 2025  Mike Norman Realty Powered by Yapstone Inc. For disclosures and information about consumer complaints regarding your payments, please see: https://www.yapstone.com/legal/licenses Website Accessibility | Privacy Policy Website managed by RealTech Webmasters This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. ← Close Menu Rentals Browse by Type Pet-Friendly Rentals with a Pool Waterfront Group Rentals Beachfront Rentals Browse by City Anna Maria Island Bradenton Beach City of Anna Maria Cortez Holmes Beach Longboat Key Browse By Bedrooms 1 Bedroom 2 Bedrooms 3 Bedrooms 4 Bedrooms 5 Bedrooms 6 Bedrooms Featured Rentals Rentals List Rentals Map All Rentals Sales Our Listings Search All Sales Meet Our Team Island Info About Meet Our Team Property Management FAQ Terms & Conditions Contact"
    },
    {
      "url": "https://amirentals.com/guide-to-eating-out-on-anna-maria-island/",
      "text": "Guide To Eating Out On Anna Maria Island - AMI Rentals Favorites Skip to content About Us FAQ’s Golf Cart Deliveries Contact Us Golf Cart Rental Additional Services and Experiences Blog About Us FAQ’s Golf Cart Deliveries Contact Us Golf Cart Rental Additional Services and Experiences Blog Golf Cart Rent Now Guide to eating out on Anna Maria Island This post may contain affiliate links. That means if you click and buy, we may make a commission at no cost to you. Please see my full disclosure policy for more details. A Guide  To Our Favorite Eats and Treats on AMI Restaurant recommendations, insider tips and tricks, where to eat with your toes in the sand and much more... Since we arrived on Anna Maria Island in April 2020 we have explored almost every restaurant, shop, beach, ice cream shop, bar, and tourist trap on the island. We arrived as tourists escaping COVID lock downs and fell in love with the island and its charm. In January 2021 we moved full time to the area and started our business AMI Rentals . Since our move near the beach we have had friends and family visit us often. Each time I found myself giving them a list of all our favorite places and what to get at each.  Now I’m sharing my AMI favorites with you! Restaurant recommendations Morning fares to get your day started right ... Are you an early riser or prefer to start your day with something more like brunch? We have recommendations for all of the mentioned. Please remember to check in with each restaraunt as closures and hours of operation change often. Don’t forget you are on island time and things can take longer, waits can be longer than most would like, but I promise you everything here is worth being patient for. I will try to give you a tip of insider trick to make each mention below more enjoyable and help you navigate the options more smoothly. One of our all time favorites is Minnie’s Beach Cafe . Minnie’s serves southern style breakfast foods to start your day off right. They are a small family owned and operated restaurant in the heart of Holmes. Beach. Minnie’s is cash only so make sure you hit the ATM before you dine. If you forget there is a ATM in the gym next door that will solve your dilemma for a service charge. If they are on a wait simply write your name on the clip board and they will call for you when they have a spot to accomodate your group size. La Creperie is a new additon to Holmes Beach, I love this place! They have amazing sweet and savory crepes, homemade quiche, omlettes, delicious salads, amazing coffee and a beautiful location. Fresh, new, and clean you will want to come back for more. The staff is so kind and attentive to your needs.  I’m a bit of a chicken salad lover so I always have to try it when it’s on the menu, I love their chicken salad it comes served on fresh salad with cherry tomatoes, cucumber and amazing balsalmic dressing. Their Concarnoise savor crepe is delicious! And of course a Paris sweet crepe is a perfect sweet treat! La Creperie is a great stop for breakfast or lunch! Who knows maybe I’ll see you there! Ginny and Jane E’s Cafe and Gift Store is located at the northern end of the island in Anna Maria right on Gulf Dr. Ginny and Jane E’s has the biggest cinnamon rolls your eyes have ever seen! You can also get bacon, eggs and toast. Lovely seating area inside as well as small tables out front. As you enter and make your way to the ordering area in the back of the store you will pass through the gift shop that is full of local artistry and gifts to take home to remind you of your trip to AMI. Looking for a great spot to take the kids and fill them up with pancakes? Look no further AMI Beach Cafe is located at the Manatee Public Beach serving all you can eat pancakes! A beach front cafe with toes in the sand dining is sure to start your day off right. Stay all day, enjoy ice cream, drinks, lunch, and dinner. AMI Beach Cafe has alittle bit of everything to make the whole family happy. Fancy donuts are all the rage, The Donut Experiment is sure to delight everyone in the family. Lines can be long so ordering online would be my suggestion. You can check out the menu and complete your order online, be sure to choose Anna Maria Island – Pine Ave. They will have you in and out in a breeze! Everyone you pass will be jealous as you walk right in and back out.  Located directly on Pine Ave in Anna Maria. If you opt for the in person full experience there are tables out front for you and your family to enjoy your donuts before you take off to explore more of the island. North Shore Cafe is greast spot located on Pine Ave in Anna Maria. Cute outdoor seating with delicious avocado toast, acai bowls, teas, and coffees. My favorite is the Avocado Toast with Chili Lime Flakes. My daughter loves their Dragon Fruit Bowl. We both love their Chai Latte. This is a great spot of relax and enjoy a healthy breakfast before you start your day at the beach. They too can have a bit of a line, but worth the wait. Mademoiselle Paris French Restaurant and Bakery is newer to Anna Maria Island. Located in Anna Maria on Gulf Drive. They offer indoor and outdoor seating. Delicious crepes my girls loved with strawberries and nutella. I always have to go with eggs benedict with ham when available – their hollandaise was delicious. Josh went for the American Breakfast. We aslo enjoyed their Plateau Delicieux to share as an appetizer. Located inside the Waterline Resort and Villas on the first floor is Chateau Anna Maria . Chateau serves breakfast on most days, brunch on the weekends, lunch, and one of our favorite spots for dinner. Reservations can be made on Opentable. Breakfast and brunch are awesome with mimosas and a full bar to make your favorite beverage to start your vacation morning off right. Paired with one of my favorites:  a delicous omlette, french toast, or benedict. For those who need dozens and dozens of donuts to spoil the family one of the only chain restaraunts on the island is Dunkin Donuts in Holmes Beach.  During busy season the line can be long. I highly recommend downloading the app and ordering in advance. You can cruise right in and pick up your order. I’ve waited for 45 minutes before to get a few dozen donuts to feed the hungry crew when we had visitors in town. Lesson learned the app is safely stored in my phone for future needs. Morning eats and treats website links, addresses, and phone numbers: Minnie’s Beach Cafe – 5360 Gulf Dr, Holmes Beach, FL 34217 – 941-778-4140 La Creperie – 3216 East Bay Drive, Holmes Beach, FL 34217 – 941-251-7007 Ginny & Jane E’s Cafe and Gift Store – 9807 Gulf Dr, Anna Maria, FL 34216 – 941-300-7126 AMI Beach Cafe – 4000 Gulf Dr, Holmes Beach, FL 34217 – 941-202-0673 The Donut Experiment – 210c Pine Ave, Anna Maria, FL 34216 – 941-896-3172 North Shore cafe – 304 Pine Ave, Anna Maria, FL 34216 – 941-900-2671 Mademoiselle Paris French Restaurant and Bakery – 9906 Gulf Dr, Anna Maria, FL 34216 – 941-226-0708 Chateau Anna Maria – 5325 Marina Dr, Holmes Beach, FL 34217 – 941-238-6264 Dunkin Donuts – 3302 E Bay Dr, Holmes Beach, FL 34217 – 941-242-0260 Lunch bites to keep you fueled and having fun.. What is your favorite kind of lunch spot? Do you enjoy eating a the beach? Eating with a view? Sitting at a table with your toes in the sand? Anna Maria Island has so many lunch options to keep you fueled for the day.  You can be fancy or you can sit in your chair on the beach and have a sandwhich delivered right to you. You get to pick what kind of day you want to have while you relax and enjoy AMI. Many of the mentioned lunch spots are also great dinner options – call or check online for hours of operation as they change often. Graze Street AMI is a welcomed fresh addition to Anna Maria Island. Located in Holmes Beach they have the best sandwhiches, dips, charcuterie boxes, cookies (don’t skip on the cookies), and so much more! They can keep you satisified all day. Grab a quick bite with one of their prepared boxes my favorite of course is the chicken salad, crackers and cheese. See if you have been reading along you will notice a chicken salad theme! Delicious dips for a poolside snack. Charcuterie boxes for a beach, boat, or before dinner snack! I brought one of these on a boat day and it was all gone in no time. They serously have amazing food that you won’t want to miss while you are on Anna Maria Island. Jason and Heather a husband and wife team have brought a beautiful culinary experience to AMI. Go check out their beautiful location and don’t leave without a few cookies! Hands down a family favorite of ours, Duffy’s Tavern . Cash only, not to worry they have an ATM onsite. No french fries here – only chips and cold sides.  So here are our favorites: Navy Bean soup (don’t forget to add the special hot sauce), Mushroom Swiss Burger, and  of course the Brie and Carmelized Onion Burger.  Duffy’s is a popular spot on St. Patty’s Day so don’t miss out on the fun if you happen to be here in March. Skinny’s Place is an island favorite. Outdoor and non-air conditioned seating only. Grab your friends and family and head on over. Grab a picnic table and send someone to the bar to order. I think they recently made changes that allow you to pay with plastic. They will bring your order out to you, just listen for your name to be called.  Hamburgers, French Fries, and Onion Rings = yummy! But my favorite is their Buffalo Chicken Bites. Skinny’s is great for lunch or dinner. Directly across the street from the beach.  It is one of our favorite places to grab a quick dinner and then walk over to watch the sunset! Scott’s Deli makes the best sandwhiches and tacos. One of my most favorite parts is they will deliver right to you on the beach. Just call them and let them know what street beach access you are at and if you have some kind of identifying marker, such as a umbrella or beach tent. They do all the hard work and bring it right to you while you sit back relax and enjoy the sunshine. Look for the orange colorful shirt with Scott’s logo. We love the AMI Philly, Southwest Salad, Braised Beef Tacos, and Cuban Sandwhich. I also love a small tub of their chicken salad to eat with a fork! Scott’s also offers catering which can be a great option for larger parties and gatherings.  They can even pack you a lunch if you are headed out on a local fishing charter for a day full of fishing. Just let them know the charter you are booked with and when. Jessie’s Island Store otherwise know as the Shell gas station is one of the few convenience stores on the island. They stock all the items you would expect from a convenience store: milk, juices, beer, sodas, ice, chips, and candy.  One of our favorite secrets is their pre-made sandwhiches that we can grab before we hop on the boat or on our way to the beach. Chicken Salad, Ham and Cheese, Turkey and Cheese, and a lovely Cuban Sandwhich (make sure you ask them to press it). The General Store saved us a few times we were staying on the north end of the island. They have alittle bit of everything to save the day (or night). My absolute favorite is their Chicken Salad. I frequently have my son bring some home for me, since he works next door! They have a deli where you can order quick bites to fuel you while you explore Pine Avenue. Don’t forget to grab a delicious ice cream treat at Dips. Fifty Three Fifty – The Pour House is one of the islands newer establishments. A lovely coffee shop, meets wine bar,  meets beer lovers paradise. This quite small bite chic restaurant will keep you coming back for more delicious treats. Stop in for a quick coffee, latte, or my favorite a chai latte. They have a tasty menu of small bites think breakfast wraps, hummus, and flatbreads! Our favorite is the Fungi Flatbread. Blueberries Cafe and Wine is tucked away near the Freckled Fin on Gulf Dr. My daughter and I love their Farm Wrap. They have arguably one of the best Acai Bowls in the area and definently on the island. I love this place because it is always quick and easy for me to grab a healthy lunch and run along to finish my day on the island. They have delicious juices, smoothies, and protein shakes. A husband and wife team, they are always welcoming and kind, it is always clean and quiet. Los Chiludos , what can I say I’m a Texan living in Florida. FINALLY a delicious taco shop on the island (in the area). This is authentic mexican food with amazing flavors! Housemade fresh tortilla chips with fresh made guacamole, I’m in heaven! After we moved here we got homesick for Mexican food. We searched and searched for tacos – we found some, but they were far. We can now skip right over to Holmes Beach and eat some of the best around, La Creperie is a new additon to Holmes Beach, I love this place! They have amazing sweet and savory crepes, homemade quiche, omlettes, delicious salads, amazing coffee and a beautiful location. Fresh, new, and clean you will want to come back for more. The staff is so kind and attentive to your needs.  I’m a bit of a chicken salad lover so I always have to try it when it’s on the menu, I love their chicken salad it comes served on fresh salad with cherry tomatoes, cucumber and amazing balsalmic dressing. Their Concarnoise savor crepe is delicious! And of course a Paris sweet crepe is a perfect sweet treat! La Creperie is a great stop for breakfast or lunch! Who knows maybe I’ll see you there! Fresh made bake goods from local ingredients is what makes Cheesecake Cutie a wonderful addition to Anna Maria Island. Start your day with a coffee and breakfast, or  grab a delicious sandwhich and salad for a quick healthy lunch. Last but not least don’t miss out on a cheese cake cutie for dessert. Make life alittle sweeter and take home a cheesecake to share after dinner! Docksides dining in Bradenton Beach, whether you are spending the day on the water and looking for a delicous lunch or dinner spot or you are cruising the island looking for a restaurant with a water view you are sure to enjoy Bridge Tender Inn & Dockside Bar . Live music on most days or nights. Nachos, are my go to favorite. Mostly outdoor seating, but they also have a few tables indoors if you need to escape the heat or rain. Who doesn’t love fish and chips? Kiwi Style Fish and Chips is new to AMI, located in Holmes Beach the owners are lovely. They continue to operate locations in Hawaii and Australia. We recently had a delicous lunch of Crumbled Fish and Chips for Josh, a Country Burger with Sweet Potatoe fries for me. You have options on breading for your fish battered, crumbled, or grilled. Everything was fresh and perfectly prepared. We sat at the bar since it was just the two of us.  They have done a wonderful job with the space – fresh, clean, and island relaxing. The Australian Hawaiian vibe is a beautiful addition to the island. Lunch bites - website links,  addresses, and phone numbers: Graze Street AMI – 3218 East Bay Drive, Holmes Beach, FL 34217 – 941-896-6320 Duffy’s  Tavern – 5808 Gulf Dr, Holmes Beach, FL 34217 – 941-778-2501 Skinny’s Place – 3901 Gulf Dr, Holmes Beach, FL 34271 – 941-778-7769 Scott’s Deli – 6000 Marina Dr, Holmes Beach, FL 34217 – 941-778-3000 Jessie’s Island Store (The Shell Station)- 5424 Marina Dr, Holmes Beach, FL 34217 – 941-778-6903 The General Store – 503 Pine Ave, Anna Maria, FL 34216 – 941-779-9200 Fifty Three Fifty, The Pour House – 5350 Gulf Dr, Holmes Beach, FL 34217 – 941-251-3681 Blueberries Cafe and Wine – 5337 Gulf Dr, Holmes Beach, FL 34217 – 786-296-9612 Los Chiludos – 3232 East Bay Dr, Holmes Beach, FL 34217 – 941-345-4102 La Creperie – 3216 East Bay Drive, Holmes Beach, FL 34217 – 941-251-7007 The Cheesecake Cutie & Cafe – 3324 East Bay Dr, Holmes Beach, FL 34217 – 941-779-2253 The Bridge Tender Inn & Dockside Bar – 135 Bridge Street, Bradenton Beach, FL 34217 – 941-778-4849 Kiwi Sytle Fish and Chips – 3608 East Bay Dr, Holmes Beach, FL 34217 – 941-704-5040 Dinners and Date Nights... I love a good date night, but dinner with friends and family are what vacations are all about. Dining out can be a challenge in large groups on Anna Maria Island. Most of the restaurants are not built to accomodate big groups, but there are a few tips and tricks that can make your dinner dining more enjoyable. What can I say Waterfront is a must for us when we have guests in town, and one of our go to date night favorites! Insider tip – send a member of your party over after you leave the beach or around 5pm to put your name on the list while everyone else showers and gets ready for dinner. They will collect a name and phone number and text you when your table is ready. Prepare yourself for a long wait, especially if you ave a larger group. It’s worth the wait and really something you should squeeze in. You can’t go wrong with anything on the menu, but here are a few of our favorite items. Their Kung Pao Calamari, it is the best I’ve ever had – I love the sweet and spicy paired with banana peppers and feta cheese –  perfectly fried and delicious! Lobster Bisque shockingly is our youngest favorite (she calls it tomato soup though). Tuna Sashimi, the best and freshest you will get on AMI.  Wasabi Crusted Tuna is a must, my daughter and I split the tuna and are more than satisfied.  Their jalapeno margarita is our favorite adult beverage. Arguably the finest dining on the island can be found at Beach Bistro . A quiet atmosphere to enjoy the most romantic of dinners. Don’t shy away from the tasting menu, there is something in each of the “acts” for everyone. You will be full and satisfied. A few of our favorites are The Pink Drink, Cesar Salad, Lobstercargot, Beef Tenderloin, and Chocolate Truffle. Great for smaller groups, but able to accomodate arger groups with advanced notice. The bar is a great option for a less formal dining experience, with all the same quality and service. They have tables on the beach for those that want the ultimate beach dining experience. One of the most magnificent locations to enjoy a beautiful sunset with your toes in the sand and craft cocktail in your hand. A change in ownership has ended the vaccination requirement so that rumor can be put to bed. Call for reservations – ask for a blanket if you are cold – go experience this amazing food heaven. Blue Marlin Seafood Restaurant in Bradenton Beach is another favorite. Situated in a cute blue cottage on historic Bridge Street the atomosphere is quiet and coastal.  They serve fresh fish caught by the Cortez fishing fleet, as well as perfectly prepared steaks, chicken, and other features. I highly recommend making a reservation in advance since it is a rather small restaurant. Indoor and outdoor seating available. Check out my blog post with a few of our favorite menu items. The Feast is located in the heart of Holmes Beach our go-to for the best pizza (in our opinion) on the island. Our favorite pizzas – The Works, Mighty Meat, and White Pizza. I also love their Greek Salad with Chicken. Perfectly located in the center of the island in Holmes Beach. We also love to get a pizza or two to-go and head to the beach with a blanket/towels for a sunset dinner on the beach. Ahhhh what can I say Texan’s in Florida we love our Tex-Mex and Wicked Cantina does a great job of delivering consistently good Tex-Mex. Their Mango Margaritas are our favorite adult beverages, paired with their Wicked Queso, chips and salsa to get the meal started. Our favorite menu items are their Fajita and Greens with Chicken, the TexMex Bowl, Wicked Tacos, and  #1 The Favorite.  Our bellies are always happy and full after a meal at Wicked Cantina in Bradenton Beach.  Inside or outside dining with live music outside most afternoon and evenings. Swordfish Grill and Tiki Bar in Cortez boasts waterfront dockside dining you can choose inside or outside dining. Situated right in the heart of Cortez fishing village this restaurant brings the feels and views that truly are the life and backbone of the area. Swordfish is one of the few options that is great for larger groups. At this time you are able to make reservations online. We love to spend the day on the water and stop in for a delicous dinner by boat. Our favorite menu items are Firecracker Shrimp, Coconut Shrimp, Shrimp and Grits, and the Seafood Platter. Don’t skip out on the most delicious Potato Salad – sweet and savory!   Live music outside at the Tiki Bar makes for a lovely evening under the lights! TIde Tables in Cortez is a local favorite! Located right off the Cortez Bridge at marker 48 on the ICW. Here is our list of favorites:  Grouper Bites, Gumbo, Fried Mushrooms, Grouper Taco’s, Combo Basket (upgrade to Grouper), and Mojo Chicken.  Safe to say if you are given the option to upsell or have Grouper take it! The seafood at Tide Tables is locally caught and could not be more fresh! You are going to love the relaxed old Florida vibe. Mostly outdoor seating at picnic tables with unbrellas – they do have a few tables and a bar inside.  You can roll in here in your finest or you can come in your swimsuit cover up off the boat. We have also ordered to-go and headed to the Long Boat Key pass for a sunset dinner on the boat! Do you think you  can predict the exact minute the sun will set on the horizon? The Sandbar is waiting for you! A beautiful place for lunch or dinner with your toes in the sand. Great spot for larger groups, waits can be long depending on time of day and season. Send someone to put your name on the list early, or anticipate the wait and use the time to check out some of the area shops on Pine Ave. Their Brussell Sprouts are my favorite! Duffy’s Tavern , I can’t tell you how much this place is one of our favorites for lunch or dinner. Seat yourself and order from the bar, this low key local favorite is sure to satisfy everyone in your group. There is indoor seating and outdoor in the back. Great for families and groups. Cash only, but they have a ATM on site. Burgers, cold sides, hot dogs, and the best navy bean soup! Dinner and Date Night recommendations website links, addresses, and phone numbers: Waterfront – 311 S Bay Blvd, Anna Maria, FL 34216 – 941-778-1515 Beach Bistro – 6600 Gulf Dr, Holmes Beach, FL 34217 – 941-778-6444 The Porch – 9707 Gulf Dr, Anna Maria, FL 34216 – 941-782-8683 Blue Marlin Seafood Restaraunt – 121 Bridge St, Bradenton Beach, FL 34217 – 941-896-9737 The Feast – 5406 Marina Dr, Holmes Beach, FL 34217 – 941-778-5092 Wicked Cantina – 107 7th Street N, Bradenton Beach, FL 34217 – 941-281-2990 Swordfish Grill & Tiki Bar – 4628 119th St W, Cortez, FL 34215 – 941-798-2035 Tide Tables Restaurant & Marina – 12507 Cortez Rd W, Cortez, FL 34210 – 941-567-6206 Sandbar Seafood and Spirits –  100 Spring Ave, Anna Maria, FL 34216 – 941-778-0444 Duffy’s Tavern – 5808 Gulf Dr, Holmes Beach, FL 34217 – 941-778-2501 The Chateau Anna Maria – 5325 Marina Dr, Holmes Beach, FL 34217 – 941-238-6264 The Bridge Tender Inn & Dockside Bar – 135 Bridge Street, Bradenton Beach, FL 34217 – 941-778-4849 Desserts and Treats Now for the sweet treats! Anna Maria Island has several Ice Cream shops along the island from Anna Maria to Bradenton Beach don’t miss out on a delicious scoop of ice cream or a tasty brownie from one of these local favorites. Two Scoops is one of our family favorites – ice cream, sundae’s, milk shakes, and floats and so much more. I’m a sucker for a coke float, and their is delicious. Their cones are yummy and the ice cream that tops it comes in almost any flavor you could want. Eat your ice cream goodies quick if you go outside because that Florida heat has it melting pretty quick. You can enjoy your tasty treat inside or outside at one of the tables. Our favorite is when we get our ice cold deliciousness we walk across the street to The City Pier for a quick walk. The City Pier is a great spot to catch a glimps of a manatee or maybe a fever of sting rays! Dips is another favorite and attached to The General Store. They have a great deck you can enjoy your ice cream with you family or large group. They have specialty flavors that change during the different seasons so make sure you check out their special board. Small Town Creamery is located in Holmes Beach next to The Feast. They have ice cream, shakes, baked treats, candy, and fudge. The Red Velvet flavor is a favorite in our bunch, but you really can’t go wrong with anything here. Grab a ice cream after dinner at The Feast. Plenty to entertain you in this shopping plaza. Two Scoops – 101 N Bay Blvd, Anna Maria, FL 34216 – 941-779-2422 Dips Ice Cream – 503 Pine Ave, Anna Maria, FL 34216 – 941-778-1706 Small Town Creamery – 5404 Marina Dr, Holmes Beach, FL 34217 – 941-213-9107 AMI Rentals Locally owned and operated cart rentals on Anna Maria Island, Florida. Meet Me on AMI's ultimate guide to eating out on Anna Maria Island. Insider tips and tricks where to eat breakfast, lunch, dinner, and don't forget the sweet treats! October 4, 2022 No Comments Share: Prev Previous Cortez Commercial Fishing Festival Next Nightlife on Anna Maria Island Next Related Posts AMI Rentals Summer 2025 Newsletter: Your Ultimate Guide to Fun on Anna Maria Island! Welcome to the AMI Rentals Summer 2025 Newsletter! We’re thrilled to help you plan your dream vacation on Anna Maria Island! Read More » June 4, 2025 Anna Maria Island Is Back and Better Than Ever: Welcome to Spring Break! This post may contain affiliate links. That means if you click and buy, we may make a commission at no cost to you. Please see Read More » March 25, 2025 October News on Anna Maria Island 2024 October is here, bringing cooler temperatures, festive activities, and plenty of reasons to visit Anna Maria Island. Whether you’re planning a fall getaway or are a local looking for the latest events, AMI Rentals has you covered. Read More » October 17, 2024 Recovery Efforts on Anna Maria Island Post-Hurricanes Helene and Milton: Your Support Matters AMI Rentals is committed to being part of the recovery process and stands ready to welcome vacationers back as soon as it is safe to do so. We need your support now more than ever, not just for us, but for the small businesses that make this island a paradise. Read More » October 17, 2024 Weather Impacts and Storm Preparedness on Anna Maria Island Storm Preparedness and Weather Impacts on Anna Maria Island. Anna Maria Island is a beloved destination, but like all coastal areas, it is vulnerable to storms and flooding, even with minimal rainfall. As storm season approaches, there are important considerations to keep in mind for your safety and the well-being of the island’s community. Read More » September 25, 2024 September 2024 News on Anna Maria Island As we transition into fall, we’ve got the latest updates on everything happening around Anna Maria Island!  From restaurant closures to special offers and upcoming events, AMI Rentals September blog post has it all. Read More » September 4, 2024 About Us Locally owned and operated golf cart rentals on Anna Maria Island, Florida. Member of Anna Maria Island Chamber of Commerce since 2022. Quick Links About Us Rentals & Pricing Contact Us Deliveries Useful Links FAQ's Blog - Meet Me on AMI Sunset Cruises Dolphin Tours Boat Rentals Fishing Charters Parasailing Baby Equipment Rentals Legal Stuff Terms & Conditions Privacy Policy Disclosure Policy Disclaimer Policy © 2025  AMI Rentals | All rights reserved | Site by JMAN designs Facebook Instagram Tiktok Youtube Yelp Twitter Tiktok Pinterest Tripadvisor Envelope"
    },
    {
      "url": "https://www.islander.org/2022/02/bistro-magic-changes-hands/",
      "text": "Bistro ‘magic’ changes hands - The Anna Maria Islander 33 Body of missing Bean Point swimmer recovered Holmes Beach, county officials discuss paid beach parking Bradenton Beach moves to adopt $5M budget Cortez Marina neighbors push back on public boat ramp plan Toggle navigation E Edition News Latest News Streetlife Real Estate Obituaries Sports Sports Fishing Classifieds This weeks ads Place an AD Contact Us islander Store Submit Subscribe Today! Island news brings us together Subscribe for unlimited digital access to the news that matters to your community. #AMITOGETHER Bistro ‘magic’ changes hands by Kane Kaiman on February 1, 2022 | one comment Facebook Twitter Subscribe The Beach Bistro surfside dining, 6600 Gulf Drive, Holmes Beach. The Sean Murphy bistro icon may now shuffle to the Doctor’s Office with him, where he will likely be found clinking his glass and telling Irish tales — and wearing a protective mask. Murphy Timmins Kaleta Najmy It’s all over but for dessert and a clink of the glass. After operating the Beach Bistro for more than 36 years, husband-and-wife founders Sean Murphy and Susan Timmins have sold the renowned surfside eatery at 6600 Gulf Drive, Holmes Beach, to developer Shawn Kaleta and attorney Louis Najmy for an undisclosed sum. The deal was inked Jan. 25, Murphy said, after a yearslong courtship that included a few other suitors. “It was a combination of age — it’s time for Susan and I to lighten up a little bit. The second part was probably the continuing COVID environment, which was creating extra stress,” Murphy told The Islander Jan. 28. In July 2021, Murphy and Timmins implemented vaccine requirements for Beach Bistro customers, who could not secure a reservation unless they told staff they had received a shot. They also required staff to wear masks and be vaccinated. “It worked and it worked very well. For the last two years, we had virtually no COVID contacts that originated in the restaurant and we’re very proud of that,” Murphy said. Parting ways with the bistro’s staff was as tough as relinquishing control of the restaurant, he said. “It was difficult for us to let go because we’re very attached to the staff. I don’t think people realize how much the team matters to making a great restaurant,” he said. Murphy-Timmins will focus on their other establishments, the Doctor’s Office cocktail bar, 5312 Holmes Blvd. #B, Holmes Beach, and the adjacent Doctor’s Garden event venue. “I think it’s easily the best craft cocktail bar in the two-county area south of Tampa Bay. It will be our objective to make it better and more desirable,” Murphy said of the Doctor’s Office. Improvements will include a refined reservation system and the addition of upscale dining options on the menu. Murphy, 70, also said with a laugh that he was looking forward to a hockey career. Neither Kaleta nor Najmy responded to Jan. 29 phone calls and text message inquiries about the purchase. A Jan. 29 phone call to the restaurant was answered by a reservationist who said a trio of employees manages the bistro. Joe Egan remains the head chef, she added. Murphy and Timmins said they were fortunate to spend years shaping and growing the bistro, a toes-in-the-sand fine-dining establishment that has received praise in national publications, including The New York Times, Los Angeles Times, USA Today and Zagat. Add to that many accolades from Wine Spectator and Florida Trend as well as a James Beard Award semifinalist. “For Susan and I, it was our life’s work. We thought about it every day and it got our first attention every day, after our children. We raised our family there. It was a rich and happy experience,” Murphy said. “Our staff was like family. Customers became like family, it was a big family. So we will miss a lot of people,” Timmins said. “We just have a lot of gratitude that we had such a great run. We had phenomenal staff, we had phenomenal guests. It was a magical little place,” she said. For more on the bistro, visit beachbistro.com or call 941-778-6444. More from The Islander May 13, 2025 Nesting notes: Already adding up April 8, 2025 Cheers! The Drift is back March 18, 2025 Moon over AMI March 4, 2025 $570K approved for ferry expansion, AM pier proposal detailed Facebook Twitter Subscribe One thought on “ Bistro ‘magic’ changes hands ” UKtraveller February 4, 2022 at 9:41 pm More bad news here. As more of Anna Maria gets gobbled up by Kaleta I wonder what will become of its uniqueness….Beach Bistro was a great place…I wonder now. Hopefully Sean hangs onto the excellent Doctor’s Office at least. Comments are closed. To advertise here, please visit our rates page or contact us at: sales@islander.org Phone: (941) 778-7978 Fax: (941) 778-9392 The Islander Poll: Do you swim at Bean Point? Yes. I used to. Never did. Where’s that? View Results Loading ... 3-Day Weather Forecast Newsletter signup Sign up to receive FREE email alerts when we update our site with news and classfieds. Email Please wait... Subscribe Thank you for sign up! Popular News Islander E-Edition For $36 a year , you can view all the news, photos, opinions, columns and community announcements To access this content, you must Subscribe here , or log in if you are a member. View our e-Edition Members On your mobile On your tablet Get news alerts Contact us Contact Us The Anna Maria Islander 10303 Spoonbill Road W., Bradenton FL 34209 Phone: (941) 778-7978 Fax: (941) 778-9392 For general information: info@islander.org Site design & maintained by Wayne Ansell Islander News Headlines E Edition Classifieds Place a Classified Ad Fishing Obituaries Real Estate Sports Streetlife Other Links About Us Legislative Contacts Privacy Copyright Archives Island Links Islander Store Web Services Subscribe Newsletter signup Sign up to receive FREE email alerts when we update our site with news and classfieds. Email Please wait... Subscribe Thank you for sign up! Social Media We use cookies to ensure that we give you the best experience on our website. If you continue to use this site we will assume that you are happy with it. Ok"
    },
    {
      "url": "https://www.annamarialifevacationrentals.com/blog/ami-beach-cafe/",
      "text": "AMI Beach Cafe Homes For Sale Owner Login Blog Home Vacation Rentals All Rentals Newest Properties Anna Maria Vacation Homes Bradenton Beach Vacation Homes Holmes Beach Vacation Homes Search by Amenity Beachfront Rentals Last-Minute Rentals Pet Friendly Rentals Search by View Search by Bedroom View All Availability About Us About The Team FAQ’s Join Our E-Mail List Terms and Conditions Privacy Policy Area Guide Attractions Journeys Beaches Restaurants About The Area Blog Explore Here Getting Here Island History Local Services Supply Rentals Weddings Property Management Property Management Contact 941-567-6253 Properties 5 O'Clock Somewhere - 216 Chilson AMI Boathouse - 520 Loquat AMI Dreaming - 4200 Gulf 105 AMI Lucky - 524 South Dr AMI Retreat - 746 Jacaranda AMI Sand Dollar - 6403 B Holmes AMI Starfish - 6403 A Holmes AMI Swedish Beach House - 306 S. Bay Blvd. A Reel Beauty - 4803 2nd Ave Above It All - 111 81st St Absolute Paradise - 2114 Avenue A Aloha Fern - 702 Fern Anna Banana - 501 N Shore Dr Anna Cabana A - 770 Jacaranda Anna Cabana B - 301 Poinsettia Anna Maria Beach Condo at Bradenton Beach Club - 1706 Gulf Dr. N Anna Maria Grand Beach House- 1604 Gulf Dr. N Arts and Vines - 6836 Pine St. (LBK) BON AMI - 804 N Bay Back To Blue - 850 N Shore Dr Banyan Beach - 104 Beach Ave Barefoot Bungalow - 213 70th St Barefoot Dreams - 201 76th E Bay 2 Bay - 803 South Bay Blvd Bay to Beach - 1407 Gulf 101 Beach Bound - 205 69th St Beach Breezes - 401 80th St. Beach Potato - 3404 Gulf Dr. #5 Beach Walk - 6250 Holmes #31 Beach n It - 410 Bay Palms Beachology - 749 Jacaranda Rd Bean Point Bliss - 820 North Shore Dr Beauty And The Beach - 205 73rd St Bermuda Bay - 213 Magnolia Ave. Bikini's & Martini's Beachfront - 2802 Ave. E Bikini's & Martini's Waterfront Canal - 215 Chilson Ave. Bikini Bottom - 302 Spring Ave Bimini Bay - 312 Hardin Ave. Bimini Sunrise - 515 Loquat Dr. Blissful Bay - 1801 Gulf Dr N #188 Blue Bayou - 201 76th W Blue Egret - 306 61st St, Unit A (East) Blue Osprey - 111 Los Cedros Dr. Blue Palm Paradise - 205 65th Blue Pelican - 306 61st St, Unit B (West) Bradenton Beach Club 301 - 301 17th St. N Buena Vista #2  - 101 67th Street #2 Cabin 1 Spinnakers Cottages - 204 56th 1 Cabin 2 Spinnakers Cottages - 204 56th 2 Canal Place - 238 Chilson Ave Canal Walk - 223 Oak Ave. Captain's Quarters Spinnakers - 202 56th 1 Chiki Tiki West - 303 64th Street Unit A Coco's Island Retreat - 308 2nd 102 Coconut Cottage - 207 67th Street Coconut Hut - 213 Coconut Ave. Coral Reef - 118 Mangrove Ave. Cottage by the Sea - 102 34th St. Crooked Coconut - 12204 45th Avenue Dr W Crows Nest Spinnakers Cottages - 202 56th 2 Da Beach House - 304 66th St Day Dream - 207 77th St. Deja Blu - 208 Palm Ave Dilly Dally By The Sea - 7005 Gulf Dr. Dock Holiday - 235 Chilson Dolce Vita - 848 N Shore Dr. Dolphin Tales - 836 S Bay Dragonfly Harbour - 511 Loquat Dr Dreamscape - 773 Jacaranda Drop Inn - 305 Pine Ave Endless Summer - 210 56th St Endless Summer AMIC 23 - 2600 Gulf 23 Fancy Flamingo - 319 Hardin Ave. Fancy That - 209 77th St. Fins to the Left - 2812 Ave. E, Unit A Fins to the Right - 2812 Ave. E, Unit B Fish Stix - 110 72nd St Glory Days - 206 Archer Way Happy Place - 210 55th St. Hart Of The Gulf - 305 67th St Hav'Anna Daydreamin' - 204 Archer Way Hav'Anna Hideaway - 202 Archer Way Hav'Anna Holiday - 211 Periwinkle Plaza Hawaiian Punch - 125 Crescent Dr Island Breeze - 119 Beach Ave Island Delight - 424 62nd St. Island Getaway - 205 56th Island Hideaway East - 308B 67th St. Island Pineapple - 404 80th St Island Serenity - 6250 Holmes #54 Island Therapy - 103 Gull Island Time - 426 Spring Island Time on Cedar - 110 Cedar Ave. La Coconut - 3610 Gulf Dr La Hacienda - 103 Los Cedros La Ola Verde - 503 71st St LaPlage #1 - 6430 Gulf Dr Lazy Daze - 105 75th St Lazy Lagoon - 220 Chilson Lazy Loggerhead - 3306 4th Ave. Liddie's Place - Sun Plaza West 209 - 5608 Gulf Dr. Unit 209 Mahi Mahi - 213 Elm Ave Manatee Bay - 402 S Bay Blvd. Manatee Lookout - 214 Oak Ave McBean Point - 795 Jacaranda Rd. - Unit A Meant To Be - 804 Jacaranda Rd Mon AMI Beach House - 311 Pine Ave My Grand Floridian - 207 North Harbor Dr. Nautical Tides - 303 Church Ave. Nirvana - 235 Oak Ave No R-Egrets - 127 50th Street Oceanside Oasis - 102 43rd St. Octopus Cottage - 209 69th St. On Point - 811 Jacaranda Rd Once Upon a Tiki - 211 Chilson Ave One Day More - 403 72nd Park n Chill - 117 Park Ave Peace of Paradise - 604 N Bay Blvd. Periwinkle Getaway - 207 Periwinkle Pineapple Cay - 305 74th St Playing Hooky - 513 Loquat Precious Memories - 753 Jacaranda Rd Rainbow Fish - 210 Archer Way Rainbow Reef - 720 Holly Rd. Reel Deal - 505 S Bay Rose Quartz - 308 Magnolia Ave. Royal Palm - 5701 Holmes Blvd Unit A Salt Dreams - 836 North Shore Dr. Sand Dollar - 6604 Holmes Blvd Sapphire Gulf - 117 Peppertree Ln. Sea Creatures Cottage - 112 Mangrove Ave Sea La Vie - 205 55th Seabatical - 209 76th St. Sea for Two - 101 73rd Street Unit #4 - Seashell Oasis - 2313 Avenue B Sentimental Sunset - 755 Jacaranda Serenity Cove - 606 N Shore Dr Unit #5 Ship Watch - 895 North Shore Snail's Pace - 606 N Shore Dr Unit #4 Snook Lookout - 211 Oak Ave Soulshine - 322 Tarpon St Starfish Cottage - 202 64th St Stay Salty - 6906 Holmes Blvd Stuck on 'Cation - 1810 80th St. NW Summer Breeze - 606 N Shore Dr Unit #0 Sunsational - 215 83rd St. Sunset Beach 102 - 2716 Gulf Surf's Up - 214 75th St The Blue Heron - 309 A 63rd St. The Laguna Beach - 212 Willow Ave. The Sweet Spot - 7402 Marina Dr. The Willow Inn - 201 Willow Ave Thrill of the Chase - 325 Hardin Ave Tiki Cottage - 303 64th Street Unit B Tipsy Turtle - 104 43rd St. Toes in the Water - 110 Palm Ave Turtle Cove - 112 72nd St Turtle Tyme - 4601 Gulf Drive Turtle Tyme 2 - 203 73rd St Villa Maria - 307 Spring Ave Villa Marianne - 111 Maple Wade 'N Sea - 104 Gull Dr. Water's Edge - 221 Oak Ave Willow Walk - 110 Willow Ave Yellowbird - 705 N Shore x × Name * First Email * Phone * Message * Company This field is for validation purposes and should be left unchanged. AMI Beach Cafe The Anna Maria Island Beach Cafe is located in Holmes Beach where Manatee Avenue meets the Gulf and offers casual gulf-front patio and indoor dining. Formerly known as Cafe on the Beach, AMI Beach Cafe is open for breakfast, lunch and dinner the cafe on the beach has an abundant menu selection that will please everyone! Famous for its All-U-Can-Eat Pancakes & Sausage, they also serve fresh omelettes, 1/2 pound cheese burgers, fish platters, colossal salads and kids meals. Featured every Friday is an All-U-Can-Eat Fish Fry. Let the kids play in the sand, while you watch a stunning sunset and listen to the nightly live entertainment. All while sipping one of the cafe’s “Island Size” drinks at the cafe’s Bamboo Beach Bar. Meals Served: Breakfast, Lunch, Dinner Live Entertainment: Yes Delivery: No Visit: 4000 Gulf Drive, Holmes Beach, FL 34217 Contact: 941-778-0784 Connect: Website | Facebook Popular Posts Trolley Stop Locations Bradenton Beach Regulations Bean Point Start Your Vacation Now Browse Rentals Browse Categories About the Island Activities Anna Maria Anna Maria Aquariums, Museums & Zoos Around the Island Arts, Culture & Theatre Audiologists Beaches Boat Rentals | Charters Bradenton Beach Bradenton Beach Chiropractors Day Trips Dental & Medical Dentists Eco-Tours | Tours Equipment Rental Events Fishing & Dolphin Watching Fitness Grooming & Pet Sitting Holidays Holmes Beach Holmes Beach Hospitals Island History Jet Skiing Kayaking Kid Friendly Libraries Local Links Local Services Nature & Wildlife Off-Island Off-Island Optometrists Organizations Paddleboarding Parasailing Pediatricians Pet Friendly Pharmacies Photographers Physicians Podiatrists Property Walkthrough Rainy Day Rental Management Restaurants Rules & Regulations Salons & Spas Shopping Snorkeling Sports & Recreation Spring Vacation Summer Theme Parks Things to Do Transportation Uncategorized Vacation Rentals Veterinarians Water Sports Winter Worship contact us find your rental Our Address Anna Maria Life Vacation Rentals 9908 Gulf Drive Suite A Anna Maria, FL 34216 Our Mailing Address P.O. Box 1178 Anna Maria, FL 34216 Give Us A Call 941-567-6253 Subscribe To Our Mailing List Email * First Name Last Name Quick Links Anna Maria Island Private Pool Homes AMI Pet Friendly Rentals Anna Maria Island Condos AMI 1 Bedroom Rentals AMI 2 Bedroom Rentals AMI 3 Bedroom Rentals AMI 4+ Bedroom Rentals AMI Last Minute Rentals AMI Staycation Rentals Anna Maria Island Weekly Rentals AMI Short Term Rentals AMI Seasonal Rentals AMI Rentals for the Holidays Alphabetical Property List About Us FAQs © 2025 Anna Maria Life Vacation Rentals | Terms & Conditions | Privacy Policy"
    },
    {
      "url": "https://www.annamarialifevacationrentals.com/restaurants/holmes-beach-restaurants/",
      "text": "Holmes Beach Restaurants on Anna Maria Island | Anna Maria Island Homes For Sale Owner Login Blog Home Vacation Rentals All Rentals Newest Properties Anna Maria Vacation Homes Bradenton Beach Vacation Homes Holmes Beach Vacation Homes Search by Amenity Beachfront Rentals Last-Minute Rentals Pet Friendly Rentals Search by View Search by Bedroom View All Availability About Us About The Team FAQ’s Join Our E-Mail List Terms and Conditions Privacy Policy Area Guide Attractions Journeys Beaches Restaurants About The Area Blog Explore Here Getting Here Island History Local Services Supply Rentals Weddings Property Management Property Management Contact 941-567-6253 Properties 5 O'Clock Somewhere - 216 Chilson AMI Boathouse - 520 Loquat AMI Dreaming - 4200 Gulf 105 AMI Lucky - 524 South Dr AMI Retreat - 746 Jacaranda AMI Sand Dollar - 6403 B Holmes AMI Starfish - 6403 A Holmes AMI Swedish Beach House - 306 S. Bay Blvd. A Reel Beauty - 4803 2nd Ave Above It All - 111 81st St Absolute Paradise - 2114 Avenue A Aloha Fern - 702 Fern Anna Banana - 501 N Shore Dr Anna Cabana A - 770 Jacaranda Anna Cabana B - 301 Poinsettia Anna Maria Beach Condo at Bradenton Beach Club - 1706 Gulf Dr. N Anna Maria Grand Beach House- 1604 Gulf Dr. N Arts and Vines - 6836 Pine St. (LBK) BON AMI - 804 N Bay Back To Blue - 850 N Shore Dr Banyan Beach - 104 Beach Ave Barefoot Bungalow - 213 70th St Barefoot Dreams - 201 76th E Bay 2 Bay - 803 South Bay Blvd Bay to Beach - 1407 Gulf 101 Beach Bound - 205 69th St Beach Breezes - 401 80th St. Beach Potato - 3404 Gulf Dr. #5 Beach Walk - 6250 Holmes #31 Beach n It - 410 Bay Palms Beachology - 749 Jacaranda Rd Bean Point Bliss - 820 North Shore Dr Beauty And The Beach - 205 73rd St Bermuda Bay - 213 Magnolia Ave. Bikini's & Martini's Beachfront - 2802 Ave. E Bikini's & Martini's Waterfront Canal - 215 Chilson Ave. Bikini Bottom - 302 Spring Ave Bimini Bay - 312 Hardin Ave. Bimini Sunrise - 515 Loquat Dr. Blissful Bay - 1801 Gulf Dr N #188 Blue Bayou - 201 76th W Blue Egret - 306 61st St, Unit A (East) Blue Osprey - 111 Los Cedros Dr. Blue Palm Paradise - 205 65th Blue Pelican - 306 61st St, Unit B (West) Bradenton Beach Club 301 - 301 17th St. N Buena Vista #2  - 101 67th Street #2 Cabin 1 Spinnakers Cottages - 204 56th 1 Cabin 2 Spinnakers Cottages - 204 56th 2 Canal Place - 238 Chilson Ave Canal Walk - 223 Oak Ave. Captain's Quarters Spinnakers - 202 56th 1 Chiki Tiki West - 303 64th Street Unit A Coco's Island Retreat - 308 2nd 102 Coconut Cottage - 207 67th Street Coconut Hut - 213 Coconut Ave. Coral Reef - 118 Mangrove Ave. Cottage by the Sea - 102 34th St. Crooked Coconut - 12204 45th Avenue Dr W Crows Nest Spinnakers Cottages - 202 56th 2 Da Beach House - 304 66th St Day Dream - 207 77th St. Deja Blu - 208 Palm Ave Dilly Dally By The Sea - 7005 Gulf Dr. Dock Holiday - 235 Chilson Dolce Vita - 848 N Shore Dr. Dolphin Tales - 836 S Bay Dragonfly Harbour - 511 Loquat Dr Dreamscape - 773 Jacaranda Drop Inn - 305 Pine Ave Endless Summer - 210 56th St Endless Summer AMIC 23 - 2600 Gulf 23 Fancy Flamingo - 319 Hardin Ave. Fancy That - 209 77th St. Fins to the Left - 2812 Ave. E, Unit A Fins to the Right - 2812 Ave. E, Unit B Fish Stix - 110 72nd St Glory Days - 206 Archer Way Happy Place - 210 55th St. Hart Of The Gulf - 305 67th St Hav'Anna Daydreamin' - 204 Archer Way Hav'Anna Hideaway - 202 Archer Way Hav'Anna Holiday - 211 Periwinkle Plaza Hawaiian Punch - 125 Crescent Dr Island Breeze - 119 Beach Ave Island Delight - 424 62nd St. Island Getaway - 205 56th Island Hideaway East - 308B 67th St. Island Pineapple - 404 80th St Island Serenity - 6250 Holmes #54 Island Therapy - 103 Gull Island Time - 426 Spring Island Time on Cedar - 110 Cedar Ave. La Coconut - 3610 Gulf Dr La Hacienda - 103 Los Cedros La Ola Verde - 503 71st St LaPlage #1 - 6430 Gulf Dr Lazy Daze - 105 75th St Lazy Lagoon - 220 Chilson Lazy Loggerhead - 3306 4th Ave. Liddie's Place - Sun Plaza West 209 - 5608 Gulf Dr. Unit 209 Mahi Mahi - 213 Elm Ave Manatee Bay - 402 S Bay Blvd. Manatee Lookout - 214 Oak Ave McBean Point - 795 Jacaranda Rd. - Unit A Meant To Be - 804 Jacaranda Rd Mon AMI Beach House - 311 Pine Ave My Grand Floridian - 207 North Harbor Dr. Nautical Tides - 303 Church Ave. Nirvana - 235 Oak Ave No R-Egrets - 127 50th Street Oceanside Oasis - 102 43rd St. Octopus Cottage - 209 69th St. On Point - 811 Jacaranda Rd Once Upon a Tiki - 211 Chilson Ave One Day More - 403 72nd Park n Chill - 117 Park Ave Peace of Paradise - 604 N Bay Blvd. Periwinkle Getaway - 207 Periwinkle Pineapple Cay - 305 74th St Playing Hooky - 513 Loquat Precious Memories - 753 Jacaranda Rd Rainbow Fish - 210 Archer Way Rainbow Reef - 720 Holly Rd. Reel Deal - 505 S Bay Rose Quartz - 308 Magnolia Ave. Royal Palm - 5701 Holmes Blvd Unit A Salt Dreams - 836 North Shore Dr. Sand Dollar - 6604 Holmes Blvd Sapphire Gulf - 117 Peppertree Ln. Sea Creatures Cottage - 112 Mangrove Ave Sea La Vie - 205 55th Seabatical - 209 76th St. Sea for Two - 101 73rd Street Unit #4 - Seashell Oasis - 2313 Avenue B Sentimental Sunset - 755 Jacaranda Serenity Cove - 606 N Shore Dr Unit #5 Ship Watch - 895 North Shore Snail's Pace - 606 N Shore Dr Unit #4 Snook Lookout - 211 Oak Ave Soulshine - 322 Tarpon St Starfish Cottage - 202 64th St Stay Salty - 6906 Holmes Blvd Stuck on 'Cation - 1810 80th St. NW Summer Breeze - 606 N Shore Dr Unit #0 Sunsational - 215 83rd St. Sunset Beach 102 - 2716 Gulf Surf's Up - 214 75th St The Blue Heron - 309 A 63rd St. The Laguna Beach - 212 Willow Ave. The Sweet Spot - 7402 Marina Dr. The Willow Inn - 201 Willow Ave Thrill of the Chase - 325 Hardin Ave Tiki Cottage - 303 64th Street Unit B Tipsy Turtle - 104 43rd St. Toes in the Water - 110 Palm Ave Turtle Cove - 112 72nd St Turtle Tyme - 4601 Gulf Drive Turtle Tyme 2 - 203 73rd St Villa Maria - 307 Spring Ave Villa Marianne - 111 Maple Wade 'N Sea - 104 Gull Dr. Water's Edge - 221 Oak Ave Willow Walk - 110 Willow Ave Yellowbird - 705 N Shore x × Name * First Email * Phone * Message * Facebook This field is for validation purposes and should be left unchanged. Holmes Beach Restaurants Home Restaurants Holmes Beach Restaurants Dcoy Ducks According to some folks, Dcoy Ducks is Anna Maria Island’s favorite hangout! Open daily from 10:30 a.m. to 2:30 a.m., this local bar View More Details China 1 If you need your fix of Kung Pao Chicken or Szechuan Pork while on your Anna Maria Island vacation be sure to stop by China 1! Located in View More Details AMI Beach Cafe The Anna Maria Island Beach Cafe is located in Holmes Beach where Manatee Avenue meets the Gulf and offers casual gulf-front patio View More Details Stir It Up Stir It Up provides a fresh, delicious frozen yogurt experience! Stir It Up exclusively serves Honey Hill Farms frozen yogurt, which is all-natural.. View More Details Domino’s Pizza One of the only franchise restaurants on Anna Maria Island, Domino’s Pizza offers delivery and carry-out only — a quick and View More Details Old Hamburg Schnitzelhaus This family-owned German restaurant  serves traditional German entrees with fresh ingredients. Everything is View More Details Skinny’s Place Located directly across from the Manatee County Public Beach, this is a great place to go to catch a bite to eat after a long day at the View More Details Beach Bistro The award-winning Beach Bistro is considered by many as Anna Maria Island’s most romantic fine dining restaurant for more than 25 years. View More Details Eat Here From the owner of the award-winning Beach Bistro, Eat Here is the less expensive sidekick to the Bistro. It has been selected multiple View More Details Island Fresh Market Island Fresh Market specializes in local seafood, locally grown seasonal vegetables, spices and condiments. The seafood selection View More Details Tortilla Bay Southwest Grille Tortilla Bay serves Tex-Mex food made fresh every day. A casual dining place that serves great food fast and efficiently. Some of the View More Details Holy Cow Ice Cream Holy Cow Ice Cream & Other Cool Stuff is a family-owned ice cream parlor. We offer old fashioned, homemade taste in 20 varieties View More Details Island Gourmet Grill Island Gourmet Grill offers a combination of Italian and American dishes. Clean Florida atmosphere that has a slight View More Details Hurricane Hanks Pub & Grub Hurricane Hanks Pub & Grub is open seven days a week and offers liquor and dining services.  Enjoy the island atmosphere in a View More Details Paradise Bagels Cafe & Catering Chef and owner, Jackie Estes makes everything from scratch with only the freshest available produce, meats, fish and cheeses. View More Details The Feast The Feast is a casual fine dining restaurant specializing in fresh seafood, steaks, salads, innovative pastas, hand tossed gourmet pizza View More Details Island Coffee Haus Located  in the center of Anna Maria Island, Island Coffee Haus offers Fair Trade roasted coffee blending Mexican, Costa Rican and View More Details Lobstahs Located in the heart of Holmes Beach, Florida, in the AMI Plaza, Lobstahs provides the freshest seafood, served New England Style. View More Details Duffy’s Tavern Locals and visitors alike flock to Duffy’s Tavern for their “world famous burger and coldest beer in town.” Family-owned and operated View More Details Mr. Bones BBQ Mr. Bones is a funky little family-owned restaurant on Anna Maria Island, Florida, where you’ll find some of the most famous, View More Details Start Your Vacation Now Browse Rentals Contact Us Name * First Phone Number* * Email * Subject* * Message CAPTCHA Name This field is for validation purposes and should be left unchanged. Our Address Anna Maria Life Vacation Rentals 9908 Gulf Drive Suite A Anna Maria, FL 34216 Our Mailing Address P.O. Box 1178 Anna Maria, FL 34216 Give Us A Call 941-567-6253 Subscribe To Our Mailing List Email * First Name Last Name Quick Links Anna Maria Island Private Pool Homes AMI Pet Friendly Rentals Anna Maria Island Condos AMI 1 Bedroom Rentals AMI 2 Bedroom Rentals AMI 3 Bedroom Rentals AMI 4+ Bedroom Rentals AMI Last Minute Rentals AMI Staycation Rentals Anna Maria Island Weekly Rentals AMI Short Term Rentals AMI Seasonal Rentals AMI Rentals for the Holidays Alphabetical Property List About Us FAQs © 2025 Anna Maria Life Vacation Rentals | Terms & Conditions | Privacy Policy contact us find your rental"
    },
    {
      "url": "https://annamariaislandchamber.org/board-of-directors/",
      "text": "Board of Directors - Anna Maria Island Chamber of Commerce Call us Anna Maria Island Chamber of Commerce Call today 941-778-1541 Facebook Twitter Instagram Youtube Pinterest LinkedIn Jobs Request Info Join Now MENU MENU Directory Where to Stay Where to Eat Where to Shop Fun & Leisure Weddings Special Events Home Services Professional Services Relocation Resources Community Resources View All Categories Events About our Island Events Community Events Chamber Events Submit Your Event Event & Scholarship Forms About Demographics, Climate, Wildlife Anna Maria Island History Volunteer Opportunities Job Listings Subscribe to Our Newsletter Community Coupons Island Trolley About the Trolley Track the Trolley Advertise on the Trolley Trolley Giving Back Program Membership Membership Account Become a Member Learn How We Can Help You Staff Ambassadors Board of Directors Contact Board of Directors Bev Kilpatrick Bev Kilpatrick has been a resident of this island since September of 2012. She came to the island from Tampa, FL where she worked for the Embassy Suites in Downtown Tampa since 2007. She fell in love with the coffee shop business and opened a coffee shop with her then mother-in-law, MJ, when she was married to MJ’s stepson who was in the Air Force. Bev has always enjoyed helping others. While being a military dependent she volunteered for the Officer’s Wives Club and did many things for the military community and the families of these communities. She served on the Board in various positions and enjoyed her time helping others. When MJ asked if she would like to open a coffee shop on Anna Maria Island back in 2010, she worked diligently through 2011 until she found the perfect spot for their coffee shop. She immediately went to the Chamber of Commerce to join because she felt that would help her become a part of the community. She and MJ started volunteering by helping the Chamber with Bayfest, prior to their opening Island Coffee Haus in Nov, 2012. She continues to volunteer for the festivals as she enjoys the interaction with the members of the Chamber and the communities on the island. After becoming a resident of the island in 2012, Bev continues to enjoy all the permanent and transient residents on the island. Her coffee shop has become a meeting place for people to come and enjoy. She has found her paradise. Wayne Gunter Treasurer When a mortgage discussion arises, many people in Manatee and Sarasota County can say that they had an extraordinary home financing experience with a true Mortgage Banking professional. This professional that many speak of is Wayne Gunter, Mortgage Loan Officer/Banking Officer for BB&T Home Mortgage in Bradenton, FL. Wayne’s commitment to superior client service along with his attention to detail has helped position him as a “Top Performer” within BB&T. Wayne graduated from the College of Business at the University of Florida in 1995 and has been originating mortgage loans over the past sixteen years. His high level of expertise, strong commitment to his community and dedication to his field are just a few things that set Wayne apart as a true professional as well as a highly sought after expert in his field. Over the past 10 years, Wayne has focused his mortgage expertise on Anna Maria Island, where he has become well known in the real estate industry as the island’s local mortgage expert. A native of Manatee County, Wayne and his wife Jenny are raising their two sons; Brycen and Brennen in the same neighborhood he grew up in. Susanne Arbanas Secretary Susanne Arbanas has a background of many successful years in international guest relations, services and management in both the aviation and hospitality industry. Upon returning from Australia to Anna Maria Island in 2008, She founded Anna Maria Island Concierge Services where she worked diligently with local business owners and visitors to enhance their “Island Experience”. Susanne continues to be a key motivator in bringing new and innovative ideas to our community through volunteering and working with our local businesses and organizations. She is our island “Director of Contagious Enthusiasm”! Dan Alderson Dan and wife Sandy became residents of Cortez in 1998, moving from Minnesota. In 2008 their son, Rob, and his wife Laura, purchased Tyler’s Ice Cream, a 24 year old business needing TLC. Since, they changed operations and recipes back to founders Larry and Gerri Tyler’s vision, ice cream made and served with love. All of Tyler’s ice cream is made on site. Tyler’s was honored with the AMI Chamber Small Business of the year for 2013. Dan enjoys small business and continues to help with the growth of Tyler’s in Cortez, Bradenton and Longboat Key David Berube David is the owner of CG&B Publishing, LLC of Bradenton. David moved to Bradenton with his wife, Cindy & son, Matthew in 1990 from Westbrook, Maine, where he worked in the printing, paper and publishing industries. In Florida, he continued in the printing industry, in sales, for Coastal Printing of Sarasota. He also owned his own company, Book Binders of Florida, Inc., a hardcover book binding firm. In 1996, he opened Book Binders Printing & Publishing, Inc. and in 2008 he opened CG&B Publishing, LLC of Bradenton. CG&P is the official Publisher of the Visitor’s Guidebook for the Anna Maria Island Chamber of Commerce, the 2011 Bayfest Booklet and the Manatee County Chamber’s monthly “Current” Magazine. David is very active in AMI Chamber events and volunteers at the AMI Chamber office. Eric Cairns Eric came to Anna Maria from Ohio where he was a general contractor for 25 years and successfully operated his own business. He has been an Anna Maria Island businessman and manager of Cedar Cove Resort since 1999. Years ago, Cedar Cove Resort became one of the original founders of the Anna Maria Island Chamber of Commerce. Eric continued this tradition when he became a Founders Club Member. Eric has been an active member of the AMI Chamber of Commerce and presently serves on several of the Chamber’s committees. Special Interests: Cedar Cove Resort donates regularly to the MS Foundation and Breast Cancer Foundation. Eric is an army veteran and a helicopter pilot. Cedar Cove Resort has been voted the “Best Beach Resort and Hotel” on the Island for the last several years. John Campora John Campora has over 16 years in investing and banking experience. He works at Edward Jones in Bradenton. He has lived and worked in Manatee County for 40 years. John enjoys helping people reach their financial goals. Having been adopted and raised by a single mother, John understands the challenges of one-income families and the value saving can have on a person’s future. John enjoys spending time with his wife and young son. Katy Demick Chairman of the Board Originally from England, Katy moved to Anna Maria in 2000, planning to stay and work here for a year. After that first year, she decided this was where she wanted to live. Eighteen years later and counting, she is still here. Katy is married to David, has two dogs, and lives in Bradenton. Katy has worked for Anna Maria Island Resorts (Tortuga Inn; Tradewinds; Seaside Inn and Tropic Isle Inn) since its inception in 2009 but has worked for David Teitelbaum since 2003. She is now Assistant General Manager and attributes her knowledge of business to the very supportive mentoring from David and the general manager, Barbara Baker. Katy has been a committee member with Symphony on the Sand since 2013 and also enjoys volunteering with Manatee County Animal Services. Erin Leathem Erin Joy Leathem has a background in international marketing and a degree from Wake Forest University in Communications and Spanish. Before moving to Florida she lived all over the country. Her experience includes work at an international chamber of commerce in Washington, DC, helping Fortune 500 companies collaborate with international partners. As an Anna Maria Island resident, she loves life on the island and is thrilled to be able to work and play every day in paradise! With 26 years of marketing experience and nearly ten years on the island, she brings a breadth of knowledge to her work at Island Real Estate. After years of leading the Real Estate Marketing and Sales Team Administration, she transitioned to become a full-time Real Estate agent. With her technical and marketing background, and her involvement at the Anna Maria Island Community Center, and the Anna Maria Elementary School, she enjoys developing her personal and professional passion for the community. Karen LaPensee Karen LaPensee graduated from State College of Florida with a nursing degree. She spent 14 years working in emergency care, intensive care, surgery and as an Air Force Reserve Flight Nurse prior to starting LaPensee Plumbing with her husband Michael LaPensee in 1985. Karen became the President of LaPensee Plumbing • Pools • Air after Michael’s retirement in 2009. Karen has been a long-time active member of the Chamber of Commerce, serving as Treasurer, Secretary, and Chairman of the Board. With the help of a very capable staff LaPensee Plumbing • Pools • Air has been honored to receive the 2011 Manatee Chamber Small Business of the Year Award, the 2016 Anna Maria Island Chamber Small Business of the Year Award and the 2017 Longboat Key Chamber Small Business Person of the Year Award. Janet Mixon Janet Mixon and her husband, Dean Mixon are owners of Mixon Fruit Farms, an over 78 year old family owned business. Mixon’s is one of the top gift fruit shippers in Florida. Mixon’s also squeeze and bottle their juice for the community. Janet and Dean have diversified the business and Mixon’s has become one of the top Gulf Coast Destinations according to the Travel Channel. The Mixon Groveside Market is a wonderful experience. They have also added a tram tour through the grove where their customers learn about the history of citrus and the Mixon family and enjoy a visit to the wildlife rescue with crocodiles, alligators, raccoon, hawks, owls and much more. Injured animals that can’t be released into the wild that would normally be euthanized are provided sanctuary by the Mixon’s. During the year the Mixon’s host many non-profit organizations for fundraisers, sponsor a cooking competition for the local high school culinary arts programs, and also sponsor art events with students and local artists. Diane Phinney Diane Phinney moved here in 2010 from Massachusetts after renting for two seasons and agreeing with her husband that the people living on AMI were the friendliest people out of all the 19 states in which they had previously lived. A graduate with a BS from The State University of NY at Potsdam and a MA from Michigan State, Diane worked primarily in Social Work, Education and Non-Profit Administration. Her desire to help others was fulfilled with work in adoption, foster care, community education, battered women and troubled and at-risk youth. Community volunteerism has always been a passion. On AMI she has served as President of the Key Royale Homeowner’s Association, Secretary of Cultural Connections and PR Chair of Island Players. In addition, she has provided leadership to committees at The Center, The Tour of Homes, artsHOP and Food & Wine on Pine. Working and playing in the out-of-doors is one of Diane’s loves. With a friend, she started a kayaking group soon after moving here. In season, you might see a group of 15-20 people kayaking in Bimini Bay or paddling around Key Royale…. these would be the “Yakkers”. They understand, as Diane does, how the feeling of paddling these waters and observing nature all around them can be transforming. She encourages others to come experience all the island offers and to make Anna Maria their home. Mike Southwick Mike attended AMI Elementary, played football at the youth center, recalls the private airstrip where Holmes Beach City Hall resides and the lack of paved roads. Mike moved to Tallahassee as a child, but was drawn back to the island in 1996 due in part to a strong family presence (Mary Norman, co-owner of the Sterling Anvil, and Mike Norman Realty). Mike is currently co-owner of AAA Payroll Service, which was honored to be awarded the AMI Small Business of the Year Award for 2017. His professional background includes 10 years in the real estate industry followed by 20 years in the PEO industry. Mike supports local charities such as Wildlife, Inc., Manatee Children’s Services and the Navy Seal Foundation. Mike’s support of our military is due in part to his father, Captain C.E. Southwick who was a highly decorated Naval Aviator and former POW during the Vietnam War. Mike resides in Bradenton Beach with his wife Sheryl. They love boating, cooking, gardening, local and Alaska fishing trips. Wende Webb Wende Webb is the owner of a small business, Gulf Coast Property Watch. Her company proactively inspects properties for absentee owners and addresses any issues before they become major problems. Previously, Wende served as the Marketing Manager for SERVPRO (a Disaster Restoration company) for over 10 years. She has worked and lived all over the world and landed in Florida via a sailboat she lived and sailed on for 2 years. Her eclectic background includes studying ballet in Russia; being the first female surveyor in Denver, Colo.; and working for the U.S. government performing water and asbestos analysis. She became a certified diver while working as the Contract Administrator for an international marine construction company. She designed and marketed the 1st ‘egg-crate’ foam mattress pad to the commercial market through Cannon Mills. After a long absence, she went back to school at UF, received a degree in Nutrition and was published in 2010 in Nutrition Concepts & Controversies, a college level text book. She has served on a number of committees for the chamber, including the 60th anniversary chamber luau and annual fashion show. She loves working with the chamber, promoting the island and telling everyone ‘annamariaisland.calm’ is the perfect destination for you! Anna Maria Island 5313 Gulf Drive, Holmes Beach, FL 34217 941-778-1541 info@annamariaislandchamber.org Facebook Twitter Instagram Youtube Pinterest LinkedIn © Anna Maria Island Chamber of Commerce . All rights reserved. Digital marketing by Two Oceans Digital . Site Map | ADA Website Compliance | Privacy Policy Please ensure Javascript is enabled for purposes of website accessibility"
    }
  ]
}