{
  "query": "annomalleys.com email",
  "fuentes": [
    {
      "url": "http://annomalleys.com/about/",
      "email": "info@annomalleys.com"
    },
    {
      "url": "https://addy.io/",
      "email": "alias+2.3.4@user.anonaddy.com"
    },
    {
      "url": "https://addy.io/",
      "email": "anyalias@johnsmith.anonaddy.com"
    },
    {
      "url": "https://addy.io/",
      "email": "circus.waltz449@anonaddy.me"
    },
    {
      "url": "https://addy.io/",
      "email": "x481n904@anonaddy.me"
    }
  ],
  "mails": [
    "info@annomalleys.com",
    "anyalias@johnsmith.anonaddy.com",
    "circus.waltz449@anonaddy.me",
    "x481n904@anonaddy.me",
    "alias+2.3.4@user.anonaddy.com"
  ],
  "nombre_sitio": "annomalleys.com",
  "origen_extraccion": "Busqueda externa paso: email",
  "textos_fuente": [
    {
      "url": "http://annomalleys.com/about/",
      "text": "About | Ann O'Malley's Irish Pub & Deli Home Calendar About Menu Gallery Select Page St. Augustine’s Oldest Irish Pub About Us The main goal that Kelli has for Ann O’Malley’s is to keep this a fun place for locals and visitors to enjoy some time in our city. Meet Kelli Proprietor: Kelli Meacham Kelli is a lifelong resident of St. Augustine. After 16 years of service as a St. Johns County Deputy, Kelli started her own business and is now the proud owner of Ann O’Malley’s Pub. Kelli’s loves are animals, the beach, and this city. Her favorite place on the planet is the St. Augustine bayfront. Kelli is also a huge Gators Fan, so on any given Saturday in the fall you can be assured that the Gator game will be on the “Big” TV! Good Music, great food, and cold beer are always here at O’Malley’s.  Come on out and hang with Kelli and the gang on the porch. To Kelli, this is not a business, it’s her family. Come on in and let us be your home away from home! Our Story Over the Years ^ 1878 Built as a family home Home to A.B. Colee . His family started the St. Augustine Transfer Company. Then a way to get to St. Augustine from Picolata. Today a horse carriage company. ^ 1992 Opened as Ann O’Malley’s Pub Named after the original owners step mother-in-law, Ann O’Malley’s soon became the favorite of the locals in St. Augustine. ^ 2017 Kelli Took Over Ownership After changing hands a number of times, Kelli took over ownership of the pub and made it into what it is today. Ann O’Malley’s was voted Best Pub in St. Augustine by Folio Weekly in 2019. ^ 2021 We made it through the Pandemic! When other pubs and restaurants were forced to close permanently, Ann O’Malley’s stood strong and is back better than ever! Come and see for yourself. Gallery Become Part of Our story Call Us (904) 825-4040 Saint Augustine 23 Orange Street St. Augustine, FL 32084 Email Us info@AnnOMalleys.com You can’t Drink all Day if you don’t start early! Sports On Everyday NFL TICKET MLB EXTRA INNINGS NHL CENTER ICE SOCCER PACKAGE live music Wed, Fri, Sat, Sun Check out our MUSIC & EVENTS CALENDAR to find out what’s going on each week. Special Events happen from time to time and all on our Calendar . Something for everyone SPORTS TRIVIA NAUGHTY BINGO LIVE MUSIC Social Follow Follow Follow Home Calendar About Menu Gallery Facebook X Instagram RSS © Ann O'Malley's Deli & Pub | All Rights Reserved | Website designed by International Web Design"
    },
    {
      "url": "https://addy.io/",
      "text": "Free, Open-source Anonymous Email Forwarding - addy.io addy.io Help FAQ Blog Pricing Log in Sign up Open main menu addy.io Sign up Close menu Help FAQ Blog Pricing Log in Say Hello to the New Official Mobile Apps! → Anonymous Email Forwarding Protect your real email address using email\n                            aliases Get\n                                Started Now Open-source How Does It Work? 1. Register Your Username Let's say your username is johndoe . You can now use\n                        *@johndoe.anonaddy.com (or .me) as your email. Where * denotes any valid local part for an email\n                        address. If you would like to remain anonymous choose a username that is not\n                        linked to your real name or identity and that you haven't used anywhere else. You can also create aliases at shared domains if you are concerned\n                        about others linking alias ownership to you. 2. Create Aliases Either on the fly or generated beforehand. Next time\n                            you are signing up to a website or newsletter, simply make up a new alias and enter that\n                            instead of your real email address. For example, if you are on vuejs.org and you want to sign up to\n                            their newsletter you could simply enter vuejs@johndoe.anonaddy.com (or .me). We'll automatically create the alias in your dashboard as soon as\n                            it receives its first email. You can reply to emails and send from aliases anonymously too! 3. Manage Aliases Let's say a spammer gets hold of one of your aliases and starts\n                        sending unsolicited email to it. You can simply toggle a switch in your dashboard and deactivate\n                        that alias. Our system will then silently discard any further emails and\n                        you won't be forwarded anything else for that alias. You can also delete the alias. Then our system will reject any\n                        emails and respond with an error. Features You'll Love Mobile Apps Beautiful native mobile apps with a buttery smooth user experience to manage your account on the go. Completely free to use whether you are using addy.io or your own self-hosted instance. The mobile apps are availalbe on iOS and Android and are both open-source ! Browser Extension Generate new aliases in a couple of clicks straight from your\n                            browser using the open-source browser extension. The extension is available for download on Firefox , Chrome , Edge and Safari ! Also available on other chromium based browsers such as Brave and\n                            Vivaldi. GPG/OpenPGP Encryption Bring your own GPG/OpenPGP public keys and add them per recipient. You can then easily toggle encryption on and off. With encryption on, all\n                        forwarded messages will be encrypted with your public key. Only you will be able to decrypt them\n                        with the corresponding private key. You can even hide and encrypt the email subject! This is great if you are using Gmail or Outlook and wish to prevent any\n                        inbox snooping. Custom Domains If you have your own domain you can add it and use it exactly\n                            like your username subdomain aliases e.g. alias@example.com . You can also enable or disable the catch-all functionality\n                            for each of your domains. Don't want to enable catch-all? You can still create aliases on-the-fly by matching a regular expression ! You can then manage your aliases and deactivate/delete any that\n                            start receiving spam! Blend Into The Crowd If you don't like the fact that all your aliases contain your\n                        username then you can generate random unique aliases from your dashboard. The generated aliases will look something like this x481n904@anonaddy.me or circus.waltz449@anonaddy.me This prevents anyone linking ownership of the alias to you. Reply To And Send From Aliases Reply anonymously to forwarded emails, the sender will\n                            receive the email as if it has come from the alias. You can even initiate an email conversation by sending an email\n                            from one of your aliases. Your real email address is not revealed when replying or\n                            sending from an alias. Add Additional Usernames You can add additional usernames to your account and use them exactly\n                        like the one you signed up with. So if you signed up as johndoe you can add johnsmith as an additional\n                        username and then use anyalias@johnsmith.anonaddy.com too. This can be used to compartmentalise your aliases. You could have a\n                        username for work emails a different one for personal emails etc. Multiple Recipients Per Alias If you'd like an alias to go to more than one recipient you can\n                            easily add multiple recipients from your dashboard. You can even add recipients to an alias as it is created by doing alias+2.3.4@user.anonaddy.com Where 2,3 and 4 are the keys for existing recipients in your\n                            account. API Access Manage your aliases, recipients, domains and additional usernames\n                            using the addy.io API. In order to use the API you first need to generate an API Key in your account settings. View API documentation Don't just take our word for it! Join thousands of happy users “I've been using Addy.io for a few years now and it's been absolutely brilliant. Well worth the small amount of money for additional premium features which it seems are being increased and improved on a regular basis. This extension just makes the service even better. Great work!” Grant Marshall “Great service. Efficient, customer services fast and easy to use. Kudos.” Lorenzo “Great for protecting your real email address. Browser extension works perfectly.” Kieran Colfer “This is a must have tool for all privacy conscious people on the web.” Jürgen V. “Smooth and easy in use. No missing emails. I became a happy paying customer.” Dan “Powerful, and has a gorgeous GUI.” Roke Beedell “I love this service. Solved my whole spam problem. The developer seems dedicated and passionate about security and privacy.” Richard Pricing Simple plans. Simple prices. Free $ 0 /month Sign\n                    Up Unlimited Standard Aliases 10 Active Shared Domain Aliases 1 Recipient (real email address) 2 Available Alias Domains 10MB Monthly Bandwidth Limit Lite $ 1 /month Sign\n                    Up Unlimited Standard Aliases 50 Active Shared Domain Aliases 5 Recipients (real email addresses) 6 Available Alias Domains 1 Custom Domain 5 Additional Usernames 5 Rules 50 Anonymous Replies / Sends Per Day Access Paid Plan Settings Priority Email Queue View / Download Failed Deliveries Option to Disable Catch-All 100MB Monthly Bandwidth Limit Priority Support Pro $ 3 /month Billed Yearly, $ 4\n                    Billed Monthly Sign\n                    Up Unlimited Standard Aliases Unlimited Active Shared Domain Aliases 30 Recipient (real email addresses) 7 Available Alias Domains 20 Custom Domains 20 Additional Usernames 20 Rules 200 Anonymous Replies / Sends Per Day Access Paid Plan Settings Priority Email Queue View / Download Failed Deliveries Option to Disable Catch-All Unlimited Monthly Bandwidth Priority Support Pricing plan comparison Free Lite Pro Price $ 0 /month Sign\n                                    Up $ 1 /month Sign\n                                    Up $ 3 /month Sign\n                                    Up Features Billed Yearly, $ 4 Billed Monthly Unlimited Standard Aliases Included in Free Included in Lite Included in Pro Active Shared Domain Aliases 10 50 Unlimited Recipients (real email addresses) 1 5 30 Available Alias Domains 2 6 7 Custom Domains Not included in Free 1 20 Additional Usernames Not included in Free 5 20 Rules Not included in Free 5 20 Usage Anonymous Reply + Send From Daily Limit Not included in Free 50 200 Access Paid Plan Settings Not included in Free Included in Lite Included in Pro Priority Email Queue Not included in Free Included in Lite Included in Pro View / Download Failed Deliveries Not included in Free Included in Lite Included in Pro Option to Disable Catch-All Not included in Free Included in Lite Included in Pro Alias Auto Creation with Regex Not included in Free Included in Lite Included in Pro Monthly Bandwidth Limit 10MB 100MB Unlimited Support Priority Support Not included in Free Included in Lite Included in Pro Protect Your Privacy. Eliminate\n                Spam. Join thousands of others who are already\n                protecting their privacy online and keeping their inboxes tidy. Secure\n                    Your Inbox Today Get\n                    Product News & Updates Sign up for our\n                    newsletter. Email address HP GDPR Notify\n                        me Company Privacy Terms Brand Roadmap Status Development Security API Self-hosting Donate Support FAQ Help Centre Contact"
    }
  ]
}