{
  "fuentes": [
    {
      "url": "https://www.aphf.org/programstemp",
      "email": "policeinfo@aphf.org"
    },
    {
      "url": "https://www.hoophall.com/about/get-touch/contact-us/",
      "email": "btassy@hoophall.com"
    },
    {
      "url": "https://baseballhall.org/aboutus/board-of-directors",
      "email": "info@baseballhall.org"
    },
    {
      "url": "https://aphf.org/faq/",
      "email": "policeinfo@aphf.org"
    },
    {
      "url": "https://www.aphf.org/about",
      "email": "policeinfo@aphf.org"
    },
    {
      "url": "https://aphf.org/visit-us/",
      "email": "policeinfo@aphf.org"
    },
    {
      "url": "https://nbbd.com/aphf/index.html",
      "email": "policeinfo@aphf.org"
    },
    {
      "url": "https://nbbd.com/aphf/index.html",
      "email": "aphf@nbbd.com"
    },
    {
      "url": "https://nbbd.com/aphf/index.html",
      "email": "policeinfo@aphf.org"
    },
    {
      "url": "https://nbbd.com/aphf/index.html",
      "email": "proshop@shooting-center.org"
    },
    {
      "url": "https://aphf.org/",
      "email": "policeinfo@aphf.org"
    },
    {
      "url": "https://aphf.org/contact-us/",
      "email": "policeinfo@aphf.org"
    },
    {
      "url": "http://aphfmuseum.org/",
      "email": "policeinfo@aphf.org"
    },
    {
      "url": "https://www.uswalkofheroes.org/about-us",
      "email": "policeinfo@aphf.org"
    },
    {
      "url": "https://www.uswalkofheroes.org/about-us",
      "email": "tarae@aphf.org"
    },
    {
      "url": "https://aphf.org/about-us/",
      "email": "policeinfo@aphf.org"
    },
    {
      "url": "https://www.aphfsd.org/graduate-volunteer-program",
      "email": "info@aphfsd.org"
    },
    {
      "url": "https://www.aphfsd.org/leadership",
      "email": "info@aphfsd.org"
    },
    {
      "url": "https://www.aphfsd.org/leadership",
      "email": "volunteer@aphfsd.org"
    },
    {
      "url": "http://aphfmuseum.org/aphfhome.html",
      "email": "policeinfo@aphf.org"
    },
    {
      "url": "https://www.nbbd.com/aphf/",
      "email": "policeinfo@aphf.org"
    },
    {
      "url": "https://www.nbbd.com/aphf/",
      "email": "aphf@nbbd.com"
    },
    {
      "url": "https://www.nbbd.com/aphf/",
      "email": "policeinfo@aphf.org"
    },
    {
      "url": "https://www.nbbd.com/aphf/",
      "email": "proshop@shooting-center.org"
    },
    {
      "url": "https://aphf.org/memorial/",
      "email": "policeinfo@aphf.org"
    },
    {
      "url": "https://aphf.org/memorial/",
      "email": "policeinfo@aphf.org"
    },
    {
      "url": "https://www.aphf.org/privacy",
      "email": "policeinfo@aphf.org"
    },
    {
      "url": "https://www.aphf.org/privacy",
      "email": "policeinfo@aphf.org"
    },
    {
      "url": "https://uslef.org/about/",
      "email": "about-uslef-logo@750x166.webp"
    },
    {
      "url": "https://uslef.org/about/",
      "email": "cropped-uslef_minimal_logomark_light@4x-150x150.png"
    },
    {
      "url": "https://uslef.org/about/",
      "email": "cropped-uslef_minimal_logomark_light@4x-300x300.png"
    },
    {
      "url": "https://uslef.org/about/",
      "email": "uslef_logomark_light@400x400.webp"
    },
    {
      "url": "https://www.visitspacecoast.com/profile/titusville/arts-culture/american-police-hall-of-fame/",
      "email": "chosen-sprite@2x.png"
    },
    {
      "url": "https://store.aphf.org",
      "email": "janetc@aphf.org"
    }
  ],
  "mails": [
    "about-uslef-logo@750x166.webp",
    "aphf@nbbd.com",
    "btassy@hoophall.com",
    "chosen-sprite@2x.png",
    "cropped-uslef_minimal_logomark_light@4x-150x150.png",
    "cropped-uslef_minimal_logomark_light@4x-300x300.png",
    "info@aphfsd.org",
    "info@baseballhall.org",
    "janetc@aphf.org",
    "policeinfo@aphf.org",
    "proshop@shooting-center.org",
    "tarae@aphf.org",
    "uslef_logomark_light@400x400.webp",
    "volunteer@aphfsd.org"
  ],
  "nombre_sitio": "aphf.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.aphf.org/programstemp",
      "text": "American Police Hall of Fame Home About Us Memorial News & Events Shop Visit Us Award Program Donate Buy Ticket Discover the Thrill of Law Enforcement Get ready for a day packed with excitement, adventures, and fascinating stories about the world of law enforcement. Buy Tickets Discover the Excitement of Law Enforcement Get ready for a day packed with thrills, adventures, and fascinating stories about the world of law enforcement. Buy Tickets About the Museum Plan Your Visit Explore the Campus Discover the Museum Discover Uncover the fascinating history and tools of law enforcement, including the Irish Connection digital exhibit, historic artifacts, vehicles and firearms. Experience Step into the action with interactive activities for all ages. Explore forensics, gadgets, crime-solving challenges, and exciting hands-on exhibits! Learn Explore inspiring stories of bravery from the men, women, and dogs that have shaped the law enforcement profession throughout history. Honor Celebrate the dedication and legacy of those who protect and serve every day, honoring their sacrifices at the largest indoor memorial to fallen officers. About the Museum The American Police Hall of Fame Museum offers an exciting, immersive journey into the world of law enforcement on the edge of Florida’s Space Coast. Here, you will discover a wealth of exhibits showcasing the tools, techniques, and brave individuals who have shaped policing throughout history. From interactive displays and hands-on activities to real-life police vehicles and iconic gear, the museum brings the thrilling and vital work of law enforcement to life. Whether you’re exploring crime-solving innovations, honoring the fallen, or learning about the heroes who serve, there's something for everyone to discover and enjoy. Read More Must See Attractions The Irish Connection Explore the profound influence of Irish Americans in policing with our Irish Connection digital exhibit. Celebrate their traditions, bravery, and lasting impact on law enforcement across the United States through captivating stories and a powerful documentary.... Read More The Memorial The Memorial Rotunda serves as a space for reflection and remembrance for all who visit, honoring 11,500 fallen officers, with each name etched on its walls.... Read More Big Adventures for Little Heroes Ignite your child’s imagination with hands-on law enforcement fun! From climbing into police vehicles to exploring forensic investigations and prison cells, our interactive exhibits inspire curiosity and creativity, making every visit an unforgettable adventure.... Read More See All Attractions Explore the Campus Learn and Explore the American Police Hall Of Fame with our exhibits, vintage items, and fun activities. Reset Map Click on the icon to locate the venue Free Parking Museum Entrance Restrooms Memorial Rotunda AR Infinity Flame Simulator Conference Center Shooting Center The Irish Connection K9 Memorial See Full Map Our Reviews Keith February 29, 2024 The museum is excellent. There are literally hundreds of displays. There are also several interactive exhibits and a corner dedicated to children. The focus though,is the memorial wall which contains the names of officers who have passed away in the... Anonymous March 20, 2023 To honor our fallen policemen, this museum is wonderful. Very helpful staff and an awesome tribute to our under-appreciated men and women (and K-9’s) of law enforcement. We thoroughly enjoyed our visit.... Robert May 20, 2022 A modern museum with many interesting displays surrounding the very moving memorial to the over 11,000 officers that have lost their lives in service. The very friendly & professional staff are very helpful, including offering to take pictures of visitors... Tracy October 3, 2017 Brilliant memorial for all fallen law enforcement whether they are human or K9. Brings a tear to your eye. My brother-in-law is a state trooper and this brought home how everyday he puts his life on the line for his... Read all reviews Get Ready for a Day of Adventure! Grab your tickets today and dive into the action at the American Police Hall of Fame Museum. Discounts are available for veterans, officers, families and groups . Group or Organization Booking Looking for a educational and fun field trip or small space hire for and organisation event/function? Get In Touch Take the Fun Home From toy police cars to cool gear and souvenirs, our gift shop has something for everyone. View Now Stay in Touch Stay Connected : Want to be the first to know about special events, new exhibits, and exclusive offers? Sign up for our emails and stay connected! Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Submit EIN number of 85-1403697. 501(c)(3) Organisation Our connections The APHF is home to the United States Law Enforcement Foundation (USLEF), the American Federation of Police & Concerned Citizens (AFP&CC), and USLEF's National Association of Chiefs of Police (NACOP) program. Supporting programs for law enforcement officers and their families since 1960. Tel: 321.264.0911 Email: policeinfo@APHF.org Add: 6350 Horizon Dr. Titusville, FL 32780 Pages About Us Memorial News & Events Shop Visit Us Contact Us Facilities Shooting Center Legal Volunteer FAQ Privacy Policy Terms of Use Buy Ticket Subscribe to our newsletter The latest news, articles, and resources, sent to your inbox weekly. Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Submit © 2025 United States Law Enforcement Foundation. All rights reserved."
    },
    {
      "url": "https://www.hoophall.com/about/get-touch/contact-us/",
      "text": "The Naismith Memorial Basketball Hall of Fame :: Contact Us Skip to main content Search this website OPEN DAILY 10AM - 4PM 1-877-4-HOOPLA Donate Enshrinement News Store Support The Hall Buy Museum Tickets Plan Your Visit Admission Hours & Ticket Information Early Closings Group Sales Travel Lodging & Dining Hall of Fame Map Special Events Summer 2025 Book the Hall Birthdays Book the Hall Learn More Hall Of Famers Events Enshrinement Enshrinement Enshrinement Calendar Enshrinement Tickets Golf Events Jerry Colangelo BHOF Golf Classic College Events Hall of Fame Series Hall of Fame Tip-Off Hall of Fame Showcase Hall of Fame Women's Showcase Chris Paul HBCU Classic Hall of Fame Classic High School Events Hoophall Regional Events Western Massachusetts Senior All-Star Game Youth Events The Elks Hoop Shoot Youth Tournaments Hooplandia Information and Requests Event Sponsorship Information Media Information Enshrinement 2025 See More Awards Basketball Hall of Fame Naismith Starting 5 The Morgan Wootten Lifetime Achievement Award The Curt Gowdy Media Award(s) The John W. Bunn Lifetime Achievement Award The Mannie Jackson - Basketball Human Spirit Award(s) Ice Cube Impact Award About About the Hall History Our Mission Election Process Officers Board of Governors/Trustees Media Information Contact Us Our Sponsors Hoophall Assists Liberty, Justice and Ball Podcast Hardwood History Glenn Roberts and The Genesis of The Jump Shot Book the Hall 1-877-4-HOOPLA Plan Your Visit Admission Hours & Ticket Information Early Closings Travel Lodging & Dining Special Events Book the Hall 2025 Summer Programming Book The Hall Entire Museum Center Court Theater Boardroom Hall of Honor Concourse Request a Proposal Birthdays Group Visit Group Inquiries Hall of Fame Map The Vault 3x3 Basketball Hall Of Famers Carl Braun Tony Parker Pau Gasol Gregg Popovich Jim Valvano Albert Pullins Gene Keady Gene Bess Gary Blair Dirk Nowitzki Bill Fitch David Hixon Becky Hammon 1976 US Women's Olympic Team Vlade Divac Charles \"Chuck\" Cooper Teresa Weatherspoon Paul Westphal Al Attles Tennessee A&I Teams of 1957-1959 Bobby Jones Sidney Moncrief Jack Sikma Wayland Baptist Flying Queens of 1948-1982 Chauncey Billups Vince Carter Michael Cooper Bo Ryan Walter Davis Charles Smith Seimone Augustus Dick Barnett Harley Redin Michele Timms Doug Collins Herb Simon Jerry West Micky Arison Sue Bird Danny Crawford Billy Donovan Sylvia Fowles Dwight Howard Maya Moore 2008 USA Basketball Men's National Team Events Enshrinement Calendar Tickets The Class & Awards Basketball Hall of Fame Classic Tickets About Media MassMutual Center Event Calendar/Sponsorship Information The Elks Hoop Shoot Jerry Colangelo BHOF Golf Classic Awards The Morgan Wootten Lifetime Achievement Award Previous Winners About the Award About About the Hall History Our Mission Election Process Officers Board Governors & Life Trustees Get in Touch Media Information Contact Us Hoophall Assists Accessibility Statement Equality Statement Our Sponsors News Schedule and Match-Ups Announced for Boca Raton Beach Classic 2016 Karl Malone Award Watch List Narrowed to Ten Finalists Naismith Memorial Basketball Hall of Fame Names Steiner Sports as Licensing Agent BASKETBALL HALL OF FAME ENSHRINEMENT GAME ADDED TO ENSHRINEMENT WEEKEND Support the Hall Giving Opportunities Naismith Coaches Circle Players Locker Room License Plates Form 990 Independent Auditors Report Privacy Policy Hardwood History Glenn Roberts and The Genesis of The Jump Shot Book the Hall Home About Get in Touch Contact Us Contact Us MUSEUM OPERATIONS Steve Delnickas Director of Museum Operations GROUP SALES & FACILITY RENTALS Chelsea Johnson Internal Events & Group Sales CORPORATE AND MARKETING PARTNERSHIPS Paul Dionne VP, Marketing & Partnerships Jeremy Therrien Events & Sponsorships DEVELOPMENT Scott Zuffelato Vice President, Philanthropy Robin Vidito Development & Board Communications HALL OF FAME NOMINATION PROCESS AND MUSEUM ARCHIVES Matt Zeysing Historian and Curator Alex Pedro Archive Services HALL OF FAMER LIAISON Jennifer McManus Professional Relations EVENTS AND PARTNERSHIPS Greg Procino Vice President, External Events & Partnerships Brendan Tassy Manager of Events & Basketball Operations Aymen Tayoubi-Idrissi Coordinator of Events and Partnerships Chelsea Johnson Internal Events & Group Sales EVENT RELATED MEDIA INQUIRIES Nicole Schuermann Position Sports [email protected] MUSEUM RELATED MEDIA INQUIRIES Brendan Tassy Basketball Hall of Fame [email protected] DONATIONS AND REQUESTS The Naismith Basketball Hall of Fame is pleased to support local charities, nonprofits, and other organizations. We receive a very high volume of donation requests, and we try to accommodate as many as possible through a donation of two general admission passes. Please fill out the form below and it will be shared with the appropriate Staff Member.  Please allow up to 5 business days for our team to reply before you inquire on the status of your request. * indicates a s required field. Please select the topic you are contacting us in regards to * ---- Group Sales Venue Rentals Birthday Party Program Video/Photos Requests Historical Questions Employment Opportunities Donate an item Other First name * Last name * Your email address * Comments * I would like to receive updates and promotional material from the Basketball Hall of Fame Yes No Please type the letters and numbers shown in the image. About The Hall Located in Springfield, Massachusetts, the Naismith Basketball Hall of Fame is an independent non-profit 501(c)(3) organization dedicated to promoting, preserving and celebrating the game of basketball at every level. The Hall of Fame has more than 475 inductees and 40,000 sq. ft. of basketball history. Nearly 200,000 people visit the Hall of Fame Museum each year to learn about the game, experience the interactive exhibits and test their skills on the Jerry Colangelo \"Court of Dreams.\" Best known for its annual marquee Enshrinement Ceremony honoring the game’s elite, the Hall of Fame also operates over 150 high school and collegiate competitions annually throughout the country and abroad. Naismith Basketball Hall of Fame 1000 Hall of Fame Avenue Springfield, Massachusetts 01105 1-877-4HOOPLA The Basketball Hall of Fame makes no representation concerning, and is not responsible for the quality, content, accessibility, nature or reliability of any hyperlinked site.   While all attempts are made to ensure the correctness and suitability of information under our control and to correct any errors brought to our attention, no representation or guarantee can be made as to the accessibility, correctness or suitability of information provided by any hyperlinked site or any other linked information accessed through the Basketball Hall of Fame website but not under its control. Copyright Notice and Use Agreement Site strategy and design by GO Plan Your Experience Admission Travel Special Events Special Exhibits Education Programs Hall of Famers Events Events Calendar & Sponsorship Info Enshrinement Weekend BHOF Shootout Hoophall Classic Hoophall West Hall of Fame Tip Off Woman's Challenge Jerry Colangelo Classic BHOF Invitational Golf Events Enshrinement VIP Packages Awards Mannie Jackson John W. Bunn Curt Gowdy Morgan Wootten Naismith Starting Five - Men's Naismith Starting Five - Women's About About The Hall Get in Touch Accessibility Statement Stay In Touch"
    },
    {
      "url": "https://baseballhall.org/aboutus/board-of-directors",
      "text": "Board of Directors | Baseball Hall of Fame Skip to main content Today's Hours: 9 A.M. - 5 P.M. Purchase Tickets Upcoming Events Today's Hours: 9 A.M. - 5 P.M. Purchase Tickets Upcoming Events Hours Today's Hours: 9 A.M. - 5 P.M. Utility Menu About Us Donate Become a Member Search Search Visit Plan your visit Reserve your tickets, book a special experience, map your route, and work out all the details for your trip to Cooperstown. Off Special Experiences Events Calendar Hall of Fame Weekend Group Visits & Private Events The Museum The Museum Discover one-of-a-kind artifacts and get lost in sweeping exhibitions that explore pivotal moments in the game and its impact far beyond the field. Off Education Collections Library & Research Center The Black Baseball Initiative YAKYU | BASEBALL - NOW OPEN STEELE INTERNSHIP PROGRAM Hall of Fame Hall of Famers Learn more about the legends who are honored in the Hall of Fame Plaque Gallery. Off Hall of Fame Explorer Future Eligibles Election Rules AWARDS Our Stories Discover History Stories from baseball's rich history are constantly being added to keep you connected to the game you love. Our stories explore the game on the field, its legendary contributors and baseball's impact on American culture. Off News Card Corner THE ROAD TO COOPERSTOWN PODCAST Hall of Fame Magazine SIGN UP FOR OUR EMAIL NEWSLETTER Join & Preserve Ways to Give Show your love of the game and be part of preserving baseball history. Off Become a Member Corporate Support DONATE NOW Shop Tickets Menu BOARD OF DIRECTORS Home ABOUT US Board of Directors JANE FORBES CLARK, CHAIRMAN Jane Forbes Clark is Chairman of the Board of Directors of The National Baseball Hall of Fame and Museum. A member of the Board since 1992 and Chairman since 2000, she provides substantial museum expertise, philanthropic insight and management skill in this leadership position. Clark is currently Chairman of Bassett Medical Center and a Director of the Bassett Healthcare Network. She also serves as President of Fenimore Farm & Country Village, The Clark Foundation, The Scriven Foundation and The Clara Welch Thanksgiving Home, as well as a Trustee of the Fenimore Art Museum. She was a Trustee, Past President and CEO of the United States Equestrian Federation. Her previous roles have also included Vice Chairman of The Jackie Robinson Empire State Freedom Medal Commission, Trustee of The Little League Foundation, and past Vice Chairman and Trustee of The United States Equestrian Team and past Director of The United States Olympic Committee. She also served eight years as an Executive Board Member of the Fédération Equestre Internationale and Chairman of its Group IV. A recipient of many awards and honors, Jane has been recognized by the Preservation League of New York State with its Pillar of New York award; The Garden Club of America with the Zone Historic Preservation Award; the Fire Department of the City of New York with their Humanitarian of the Year award; Harlem R.B.I.; the Baseball Assistance Team; and is a member of the Boys’ Club of New York All Sports Hall of Fame. The Clark family has been a devoted steward of the Baseball Hall of Fame since Stephen C. Clark founded the Museum in 1936. JOE TORRE, VICE-CHAIRMAN Joe Torre is the Vice-Chairman of the National Baseball Hall of Fame and Museum's Board of Directors. Appointed to the Board in 2023 and elected as Vice-Chairman in 2024, Torre followed his 18-year MLB playing career – where he was named to nine All-Star Games and won the 1971 National League Most Valuable Player Award – with a 30-year managerial career that saw him lead his teams to 13 first-place finishes, six pennants and four World Series titles. After retiring as a manager, Torre joined MLB’s front office, where he served in several roles as one of baseball’s most trusted voices. He was elected to the Hall of Fame in 2014. KEVIN MOORE, TREASURER Elected director and treasurer in 1992, Kevin S. Moore is president of The Clark Estates, Inc., a financial and business management company. Prior to joining The Clark Estates, he was president, chief executive officer and director of Jet Capital Corporation. Moore serves as a director on the governing boards of several business organizations and many charitable organizations. Moore is chairman of the Board's Finance and Pension committees, and is a member of the Executive Committee. PAUL BEESTON Elected to the Board in 1998 and a member of its Executive Committee, Paul Beeston served as president and chief operating officer of Major League Baseball from July 1997 to March 2002. He reported directly to the commissioner and was responsible for all phases of Baseball's central offices. An accomplished Toronto Blue Jays executive, he has served in many capacities, most notably as president and chief executive officer for nine years. CRAIG BIGGIO Elected to the Board of Directors in 2021, Craig Biggio was inducted into the Hall of Fame in 2015 following a 20-year career with the Houston Astros as a catcher, second baseman and center fielder. A seven-time All-Star and member of the 3,000-hit club, Biggio earned four Gold Glove Awards and five Silver Slugger Awards. Now a Special Assistant to the General Manager with the Astros, Biggio was named Major League Baseball’s Roberto Clemente Award winner in 2007 for his efforts in the community. BILL DEWITT A director since 1998, William O. DeWitt Jr is chairman of the board and general partner of the St. Louis Cardinals. He is also president of RD Investment Group, a Cincinnati-based investment firm. DeWitt, whose father was a career baseball executive and club owner with the St. Louis Browns, New York Yankees, Detroit Tigers, Cincinnati Reds and Chicago White Sox, has also been a minority owner of the Texas Rangers, Baltimore Orioles and the Reds. He serves on the boards of a number of privately held companies and has worked in a number of civic and charitable organizations. DeWitt is a member of the board's Nominating and Development committees. TOM GLAVINE Tom Glavine, elected to the Board of Directors in 2021, won 305 games with the Braves and Mets over a 22-year big league career that earned him Hall of Fame induction in 2014. Glavine won the National League Cy Young Award in both 1991 and 1998 and was named the 1995 World Series Most Valuable Player for leading the Braves to their first World Series title in Atlanta. A 10-time All-Star, Glavine served as a respected voice during Collective Bargaining Agreement negotiations as a player representative throughout his career. KEN GRIFFEY JR. Ken Griffey Jr. was named to the Board of Directors in 2021, five years after he was elected to the Hall of Fame with what was then the highest percentage ever recorded in the Baseball Writers’ Association of America election. During 22 season with the Mariners, Reds and White Sox, Griffey Jr. hit 630 home runs, was a 10-time Gold Glove Award winner in center field, earned 13 All-Star Games selections and won the 1997 American League Most Valuable Player Award. As a Senior Adviser to MLB Commissioner Rob Manfred, Griffey’s work focuses on youth development and improving diversity at the game’s amateur levels. KEN KENDRICK Appointed to the Board of Directors in 2020, Ken Kendrick has served as the Diamondbacks’ Managing General Partner since 2004. In that time, Kendrick has led the Diamondbacks’ efforts in hosting the All-Star Game at Chase Field in 2011, opening a state-of-the-art Spring Training facility in Salt River Fields at Talking Stick and becoming one of the largest philanthropic entities in the Phoenix area with charitable contributions topping $70 million since the organization’s inception. ROB MANFRED Robert D. Manfred Jr. was named to the Board of Directors in 2015. Manfred served as the Chief Operating Officer of Major League baseball from Sept. 30, 2013 until he took over as the Major League Baseball’s 10th Commissioner on Jan. 25, 2015. Manfred served as MLB’s Vice President for Labor Relations and Human Resources from 1998-2012, helping negotiate successful extensions of the Basic Agreement that have maintained labor peace in the game for more than two decades. ARTE MORENO Elected as a director in 2018, Arte Moreno has guided the Los Angeles Angels as team owner since 2003. Along with his wife, Carole, Moreno’s work through the Angels Baseball Foundation supports investments in education, health care, arts and sciences, and community-related youth programs throughout Southern California. Through the Moreno Family Foundation, Arte and Carole support nonprofits focusing on youth and education. Kim Ng Elected to the Board of Directors in 2024, Ng currently serves as Commissioner of the Athletes Unlimited Softball League. She grew up playing softball and went on to play for the University of Chicago. After earning her degree, Ng joined the White Sox as an intern in 1990, working her way up through the team’s baseball operations department. In 1998, Ng was named the assistant general manager of the Yankees, helping the team continue its late-1990s dynasty. In 2002, Ng joined the Dodgers, where she spent nine years as vice president and assistant general manager. She then joined the MLB front office for a nine-year stint before she was hired as the Marlins general manager on Nov. 13, 2020. JERRY REINSDORF Elected to the Board of Directors in 2008, Jerry Reinsdorf is chairman of the Board of Directors of the Chicago White Sox. Since heading the limited partnership that purchased the White Sox in January 1981, Reinsdorf has been involved in Major League Baseball initiatives at an industry-wide level, as a member of the Executive Council, a past chairman of baseball's Ownership Committee and as a former member of the Player Relations Committee. Reinsdorf also serves as chairman of the Chicago Bulls. CAL RIPKEN JR. Cal Ripken Jr., elected as a director in 2019, was inducted into the Hall of Fame in 2007 following a distinguished 21-year career with the Baltimore Orioles. In 1995, Ripken broke Lou Gehrig’s Major League record for consecutive games played (2,130), and then went another three seasons before voluntarily ending the streak after playing his 2,632nd consecutive game on Sept. 20 1998. In his post-playing career, Ripken is using the platform that baseball has provided him to help grow the game he loves at the grassroots level. He owns Ripken Baseball and, along with his family, founded the Cal Ripken, Sr. Foundation. Ripken Baseball currently operates youth baseball complexes, while the foundation operates nationally and serves over one million youth each year through programs and the construction of multi-purpose youth fields that provide kids with safe places to play. Ripken is also a Sports Diplomacy Envoy for the U.S. State Department. HARVEY SCHILLER Elected a director in 2009, Dr. Harvey W. Schiller is Chairman and Chief Executive Officer of the GlobalOptions Group, Inc. Previously, he served as President of the International Baseball Federation, the global governing body for the sport of baseball; Chairman and C.E.O. of Yankees/Nets; President of Turner Sports, Inc.; Executive Director and Secretary General of the United States Olympic Committee and Commissioner of the Southeastern Conference. OZZIE SMITH Ozzie Smith, elected to the board in 2016, was inducted into the National Hall of Fame in 2002. Since being inducted, he has served the as Museum’s first Education Ambassador, lending annual support to the Hall of Fame Classic as well as a fundraising event in his name. In a class by himself when it came to fielding at shortstop, Smith earning a record 13 Gold Glove Awards at the position, all in consecutive seasons (1980-1992). In addition to setting major league records for assists, double plays and total chances by a shortstop, Smith proved to be a valuable offensive weapon, amassing 2,460 hits and 580 stolen bases in his 19-year career, which included 15 All-Star selections. He was a key contributor to the St. Louis Cardinals World Series championship team in 1982. THOMAS TULL Elected to the Board in 2013, Thomas Tull is the founder, Chairman, and CEO of Tulco. Tull previously served as founder, Chairman, and CEO of Legendary Entertainment, a leading media company with film, television, and digital and publishing divisions. In January 2016, the company was acquired by the Dalian Wanda Group, Ltd. Tull also chairs Tull Investment Group which provides capital for early to mid-stage companies. During his career, Tull has produced and executive produced more than 40 films that together have realized grosses of more than $13 billion at the worldwide box office. Tull executive produced Straight Outta Compton and the world record-breaking Jurassic World. Other past credits include Godzilla, Pacific Rim , the critically acclaimed Jackie Robinson biopic 42 , the Dark Knight trilogy, 300 and 300: Rise of an Empire , The Town , Inception , Clash of the Titans , the Hangover franchise and Kong: Skull Island . Tull is part of the National Football League’s Pittsburgh Steelers ownership group, where he also holds a board seat. MORE INFORMATION PRESIDENT AND LEADERSHIP TEAM Josh Rawitch assumed duties as Hall of Fame President on Sept. 9, 2021. LEARN MORE CONTACT INFORMATION Contact listing by department. LEARN MORE HISTORY OF THE MUSEUM Cooperstown has become a synonym for “baseball” – thanks to a story about a Civil War general and the country’s love for a timeless game. READ MORE Off ® I LOVE NEW YORK is a registered trademark and service mark of the New York State Department of Economic Development; used with permission. Support provided by Market New York through I LOVE NY/ New York State’s Division of Tourism as a part of the Regional Economic Development Council awards. Address 25 Main St Cooperstown, NY 13326 Phone Numbers 1-888-425-5633 607-547-7200 Email Address info@baseballhall.org Footer Menu Ways To Support Shop Careers Media Info Privacy Policy Terms mailto:info@baseballhall.org https://www.x.com/baseballhall https://www.facebook.com/baseballhall/ https://www.instagram.com/baseballhall https://www.youtube.com/baseballhall https://www.tiktok.com/@baseballhall?lang=en Sign up for our newsletter"
    },
    {
      "url": "https://aphf.org/faq/",
      "text": "FAQ | American Police Hall of Fame Home About Us Memorial News & Events Shop Visit Us Award Program Donate Buy Ticket FAQ Got questions? We've got answers! Here you'll find all the information you need to make the most of your experience. If you don't find what you're looking for, feel free to contact us at policeinfo@APHF.org . Q: Where is the American Police Hall of Fame? A: We’re located at 6350 Horizon Drive, Titusville, Florida, just minutes from Kennedy Space Center and convenient to Orlando’s other attractions. Q: What are the museum’s opening hours? The museum is open Tuesday through Saturday from 10:00 AM to 4:00 PM. Q: Is parking available? Yes, we offer free parking for all visitors. Along with disabled parking spots and space for buses. Q: Can I buy tickets at the door? We recommend buying your tickets online in advance to avoid disappointment, however if you are in the area visiting other attractions, you can purchase tickets on the door. Q: Are there discounts available? Yes! We offer discounted rates for veterans and active law enforcement officers. Q: Where does the money from ticket purchases go? The United States Law Enforcement Foundation is a nonprofit organization actively supporting law enforcement officers, their families and the wider community. The cost of tickets goes towards upkeep of the museum and memorial as well put into programs such as The Hope Initiative to fund scholarships, grants and anniversary gifts to families of fallen officers and those disabled in the line of duty. For the full list of programs visit uslef.org Q: Is the museum accessible for visitors with disabilities? Yes, the museum is fully wheelchair accessible, with designated parking and ramps for ease of access. Q: Are group tours available? Yes! We offer special rates and guided tours for school groups and other organizations. Q: How long should I plan for my visit? You can walk around the exhibits at your own pace. Most visitors spend about 2-3 hours exploring the exhibits and activities, but feel free to stay longer and enjoy everything we have to offer! Q: What is/isn’t included in admission? Your ticket gives you full access to the American Police Hall of Fame and Museum. For admission into the Shooting Range, you will need to book separately. Q: Are weapons permitted inside the museum? No weapons of any kind are permitted inside the American Police Hall of Fame and Museum including those belonging to off-duty law enforcement. Please leave items secured within your vehicle. Didn't answer your question? Try Contact Us EIN number of 85-1403697. 501(c)(3) Organisation Our connections The APHF is home to the United States Law Enforcement Foundation (USLEF), the American Federation of Police & Concerned Citizens (AFP&CC), and USLEF's National Association of Chiefs of Police (NACOP) program. Supporting programs for law enforcement officers and their families since 1960. Tel: 321.264.0911 Email: policeinfo@APHF.org Add: 6350 Horizon Dr. Titusville, FL 32780 Pages About Us Memorial News & Events Shop Visit Us Contact Us Facilities Shooting Center Legal Volunteer FAQ Privacy Policy Terms of Use Buy Ticket Subscribe to our newsletter The latest news, articles, and resources, sent to your inbox weekly. Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Submit © 2025 United States Law Enforcement Foundation. All rights reserved."
    },
    {
      "url": "https://www.aphf.org/about",
      "text": "About Us | American Police Hall of Fame Home About Us Memorial News & Events Shop Visit Us Award Program Donate Buy Ticket Discover America's First Law Enforcement Museum Buy Ticket Our Story A Legacy Begins Founded by retired Police Chief Gerald Arenberg, the American Police Hall of Fame becomes the nation's first law enforcement museum. Reaching the Community A foundation is established to support law enforcement and the community. Expanding Support Two programs are founded to aid families of fallen officers and provide assistance to those injured in the line of duty. Moving Forward The museum relocates to Miami, Florida, continuing its mission to educate and honor law enforcement professionals. A Permanent Home The museum finds its forever home in Titusville, Florida, welcoming visitors to explore its exhibits and learn its stories. Supporting Families USLEF leads in providing vital resources, financial aid, and emotional support to the families of fallen officers and those disabled in the line of duty. Shaping the Future With innovative training and education programs, USLEF prepares future officers and citizens to uphold safety and justice. 1960 1967 1989 1990 2003 Today Tomorrow Inside the Museum The American Police Hall of Fame Museum is a place to learn, explore and celebrate law enforcement for all the family! Through exciting exhibits, historic artifacts and fun, interactive activities, you will gain a unique insight into the challenges and triumphs of those who serve our communities. Buy Ticket Our Vision Educating the Public The museum aims to foster understanding and appreciation of law enforcement through engaging educational experiences like the Irish Connection digital exhibit. Inspiring Generations We hope to inspire the next generation of officers, leaders and citizens by showcasing the dedication, innovation and bravery of law enforcement professionals. Building Connections Our vision is to create a space where the public and law enforcement can connect; building mutual respect and understanding for a safer and stronger community. Who Are the United States Law Enforcement Foundation? The United States Law Enforcement Foundation (USLEF) is dedicated to supporting law enforcement officers, their families and the wider community. In addition to overseeing the American Police Hall of Fame and Museum, USLEF offers multiple programs such as The Hope Initiative to support officers’ children, provide emotional and financial support for families of fallen officers or those disabled in the line of duty. The USLEF wider programs promote public safety, and inspire the next generation of law enforcement. Together, we’re building a brighter future for the men and women who serve and protect our country. To learn more about the impact USLEF are having go to uslef.org. To learn more about the Police Family Survivors Fund go to afp-cc.org . Donate Friends of Law Enforcement Museum activities are sponsored, in part, by the Brevard County Board of County Commissioners, the Florida’s Space Coast Office of Tourism and The Brevard. Stay in Touch Stay Connected : Want to be the first to know about special events, new exhibits, and exclusive offers? Sign up for our emails and stay connected! Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Submit EIN number of 85-1403697. 501(c)(3) Organisation Our connections The APHF is home to the United States Law Enforcement Foundation (USLEF), the American Federation of Police & Concerned Citizens (AFP&CC), and USLEF's National Association of Chiefs of Police (NACOP) program. Supporting programs for law enforcement officers and their families since 1960. Tel: 321.264.0911 Email: policeinfo@APHF.org Add: 6350 Horizon Dr. Titusville, FL 32780 Pages About Us Memorial News & Events Shop Visit Us Contact Us Facilities Shooting Center Legal Volunteer FAQ Privacy Policy Terms of Use Buy Ticket Subscribe to our newsletter The latest news, articles, and resources, sent to your inbox weekly. Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Submit © 2025 United States Law Enforcement Foundation. All rights reserved."
    },
    {
      "url": "https://aphf.org/visit-us/",
      "text": "Visit Us | American Police Hall of Fame Home About Us Memorial News & Events Shop Visit Us Award Program Donate Buy Ticket Plan Your Visit Located in Florida just off the NASA Causeway only minutes from the Kennedy Space Center and only 65 miles from Walt Disney World, enhance your vacation by visiting us. Opening Hours From 10 am to 4 pm, the last entry is at 3 pm. Open Tuesday through Saturday all year round except 24th to 26th December. Admission Adults: $15.00 Children Under 4 - FREE Children (Ages 4 - 12): $10.00 Military, AAA & Senior Citizens: $12.00 Law Enforcement Officers: $5.00 Family Survivors: $2.00 Click to enlarge How to find us Address: 6350 Horizon Drive, Titusville, FL 32780 Google Maps Waze In The Area Local Food Recommendation The Space Bar : 6245 Riverfront Ctr Blvd, Titusville, FL 32780, United States Beef ‘O’ Brady’s : 3745 Curtis Blvd, Port St John, FL 32927, United States Local Hotels Marriott Courtyard Titusville : 6245 Riverfront Ctr Blvd, Titusville, FL 32780, United States Hyatt Place Titusville : 6299 Riverfront Ctr Blvd, Titusville, FL 32780, United States Other Attractions Situated on Florida's Space Coast, we are just minutes away from Kennedy Space Center . We're so close that you may get to see a launch from our car park! Why not combine your trip with a visit to Disney World, Orlando only 65 miles away? Get Your Tickets Don’t miss your chance to explore the exciting history, innovation, and heroism of law enforcement. Secure your tickets today and get ready for a memorable experience! School/Group Pricing Bring your class for an educational and interactive field trip! We offer special pricing for school groups, making it easier for students to learn about the history and impacts of all aspects of law enforcement. Contact us for more information. Get In Touch Meeting and Event Space Have your next event in our spacious, multi-use room ideal for meetings, workshops, classes, private & community events, training sessions, celebrations, and more! Get In Touch FAQ Got questions? We've got answers! Here you'll find all the information you need to make the most of your experience. If you don't find what you're looking for, feel free to contact us at policeinfo@APHF.org . Q: Where is the American Police Hall of Fame? A: We’re located at 6350 Horizon Drive, Titusville, Florida, just minutes from Kennedy Space Center and convenient Orlando’s attractions. Q: What are the museum’s opening hours? The museum is open Tuesday through Saturday from 10:00 AM to 4:00 PM. Q: Is parking available? Yes, we offer free parking for all visitors. Along with disabled parking spots and space for buses. Q: Can I buy tickets at the door? We recommend buying your tickets online in advance to avoid disappointment, however if you are in the area visiting other attractions, you can purchase tickets on the door. Q: Are there discounts available? Yes! We offer discounted rates for veterans and active law enforcement officers. Q: Where does the money from ticket purchases go? The United States Law Enforcement Foundation is a nonprofit organization actively supporting law enforcement officers, their families and the wider community. The cost of tickets goes towards upkeep of the museum and memorial as well put into programs such as The Hope Initiative to fund scholarships, grants and anniversary gifts to families of fallen officers and those disabled in the line of duty. For the full list of programs visit uslef.org Q: Is the museum accessible for visitors with disabilities? Yes, the museum is fully wheelchair accessible, with designated parking and ramps for ease of access. Q: Are group tours available? Yes! We offer special rates and guided tours for school groups and other organizations. Q: How long should I plan for my visit? You can walk around the exhibits at your own pace. Most visitors spend about 2-3 hours exploring the exhibits and activities, but feel free to stay longer and enjoy everything we have to offer! Q: What is/isn’t included in admission? Your ticket gives you full access to the American Police Hall of Fame and Museum. For admission into the Shooting Center, you will need to book a separate ticket. Q: Are weapons permitted inside the museum? No weapons of any kind are permitted inside the American Police Hall of Fame and Museum including those belonging to off-duty law enforcement. Please leave items secured within your vehicle. Didn't answer your question? Try Contact Us EIN number of 85-1403697. 501(c)(3) Organisation Our connections The APHF is home to the United States Law Enforcement Foundation (USLEF), the American Federation of Police & Concerned Citizens (AFP&CC), and USLEF's National Association of Chiefs of Police (NACOP) program. Supporting programs for law enforcement officers and their families since 1960. Tel: 321.264.0911 Email: policeinfo@APHF.org Add: 6350 Horizon Dr. Titusville, FL 32780 Pages About Us Memorial News & Events Shop Visit Us Contact Us Facilities Shooting Center Legal Volunteer FAQ Privacy Policy Terms of Use Buy Ticket Subscribe to our newsletter The latest news, articles, and resources, sent to your inbox weekly. Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Submit © 2025 United States Law Enforcement Foundation. All rights reserved. We Can't Do This Without Your Support Your gift equips the American Police Hall of Fame with the resources - including personnel, materials, supporting services, and equipment - to fulfill our mission to support and promote law enforcement families, agencies, and officers. Donate Close the Content Dock"
    },
    {
      "url": "https://nbbd.com/aphf/index.html",
      "text": "American Police Hall of Fame & Museum - Titusville Florida CONNECT CONTACT NBBD Home Page Go & Do Sports Cultural History & Museums Space Nature & Outdoors Non-Profits Houses of Worship Government Education Interactive Site Map Disabilities Services CONTACT BUSINESSES Businesses Directory Restaurants Real Estate EVENTS LISTING Festivals Facebook Downtown Titusville Parks & Recreation Parks Activities Community Center Calendars Wildlife Refuge National Seashore Enchanted Forest Sams House PRESS RELEASES Brevard County City of Titusville Downtown Titusville NASA NASA PR SpaceX PR ULA PR Blue Origin PR Launch Viewing Parrish Medical OUTDOORS National Wildlife Refuge National Seashore Refuge/Seashore MAP Sanctuaries Enchanted Forest Sams House Sanctuaries MAP Ecotourism Photography Space Coast Outdoors Birding Paddling Hiking Biking PARKS Calendars North Area Parks Scottsmoor & Mims Titusville Area Port St. John & Canaveral Groves Disabilities LIBRARIES Mims / Scottsmoor Titusville Port St. John Brevard County Genealogy SOFT ADVENTURES Playgrounds Downtown Titusville Museums & History Refuge & Seashore South Titusville Fishing & more POPULAR North Brevard History Windover Bog People Gopher tortoise Warbird Airshow Edible Plants Black Point Drive Fort Christmas Manatee Hammock Campground Wildlife Festivals Wildlife Rehabilitators St. Johns River Fishing Pier Parrish Medical Sea Turtle Festival N.B. Heritage Foundation ????? Menu with CSS3 Css3Menu.com AMERICAN POLICE Hall of Fame & Museum The Nation's First Museum, Attraction and Memorial Honoring All Police In Federal, State, County and Local Departments 6350 Horizon Dr. Titusville, FL 32780 321-264-0911 policeinfo@aphf.org Latitude: 28.526228 Longitude: -80.783247 • Remembering Those We Love • Serving Those in Need • Educating Those Who Need To Know • The American Police Hall of Fame and Museum was founded in 1960. It is the nation's first national police museum and memorial dedicated to law enforcement officers killed in the line of duty. MUSEUM The Museum at The American Police Hall of Fame hosts nearly 11,000 exhibits and artifacts relating to law enforcement. Many of these exhibits are interactive and include a large collection of antique law enforcement vehicles, decommissioned fire arms and tools used by law enforcement officers. Stop by our kids corner where kids can dress the part of their favorite law enforcement officer, practice their detective skills in an interactive lab and make their own badge to take home. To find out more about the museum or the facility's compassionate services for law enforcement families, please call 321-264-0911 or email policeinfo@aphf.org . Admission: Adults: $13.00 Children Under 4 - FREE Children (Ages 4 - 12): $8.00 Military & Senior Citizens: $10.00 Law Enforcement Officers: $5.00 Family Survivors: $2.00 Group Rates (12 or more people) Adults: $6.50 Children (Ages 4-12): $4.00 Museum Hours: Tuesday - Saturday: 10:00AM - 4:00PM Shooting Center Range Combo Admission: $40.00 Get the full experience with museum admission, 50 rounds of 9mm ammo with free firearm rental and instruction! Shooting Center Hours: Tuesday - Friday: Noon - 8:00PM Saturday - Sunday: Noon - 6:00PM Social distancing and limited occupancy to be observed. The United States Law Enforcement Eternal Flame October 20, 2020 Ground Broken for Eternal Flame, Walk of Heroes TITUSVILLE – On the heels of financial commitments from the Brevard County Commissioners and two national law enforcement organizations, as well as support from numerous businesses, individuals and television's John Walsh, the American Police Hall of Fame put shovels to dirt Oct. 16 in preparation for \"phase one.\" \"We began developing plans for this monument five years ago,\" Executive Director Barry Shepherd told the assembled celebrants. \"And we are so proud and thrilled to finally be breaking ground on it. It's even more significant that we are doing so the day after celebrating our 60th anniversary. We are starting the next 60 years with great momentum and purpose.\" The Flame will pay tribute to law enforcement officers lost in the line of duty as well as to those who patrol the streets of America daily. The Walk of Heroes offers an opportunity for individuals, clubs, businesses etc. to purchase either a 4x8 or an 8x8 brick. \"There is still time to purchase a brick for the first installation. This can be done on a secure site that you can access by going to www.USWalkofHeroes.org or you can download a form and mail in your order,\" explained Tara Dixon Engel, President of the Hall of Fame. \"We have already begun clearing ground and, with the groundbreaking finished, we will be grading the land and prepping for paver installation. It is an exciting time around here. After the craziness and delays of 2020, we are ready to hit the ground running in 2021.\" During the Friday ceremony, letters of support for the project were read from \"America's Most Wanted\" star John Walsh, Senator Rick Scott (who prepared a video presentation), Governor Ron DeSantis, Congressman Bill Posey (who attended and read his letter), the NRA, the Police Benevolent Association, the NYPD's 10-13 Club, the 9463 Foundation and others. Visitors were treated to a replica of the planned Flame, complete with hundreds of twinkling lights on the stem of the structure, just below the flame itself. Guests of honor also included Commissioner Rita Pritchett, former Commissioner Robin Fisher, officials from Rush construction, board members and staff from The American Police Hall of Fame & Museum, and many others. \"In response to the phone calls we are getting, yes, there is still opportunity for sponsorships or donations, both financial and in-kind, for the project,\" Shepherd noted. \"The pinnacle donor spot is still available and we have a short list of companies in mind for that leadership gift, but we will meet with others who express interest in that level of visibility and involvement. Those seeking additional donor opportunities can contact Tara Dixon Engel at the Hall of Fame, while sponsorships are being handled by our Director of Sales, Events & Protocol, Janey Hicks.\" Project details, deadlines and related information will be available at www.LEFlame.org for the Flame and www.USWalkofHeroes.org for the paver path. To find out more, call 321-264-0911. Pictured, from left are: Brian Blanchard of the Tourism Development Council, Brian Donnelly of the 9463 Foundation, Chief John Lau of Titusville Police Department, Al Boettjer of the Police Benevolent Association, Sheriff Wayne Ivey of the Brevard County Sheriff's Office, Congressman Bill Posey, Barry Shepherd of American Police Hall of Fame, Brevard County Commissioner Rita Pritchett, William Chivers of Rush Construction, and Titusville Mayor Walt Johnson. Congressman Bill Posey expresses his support for the project. Titusville Mayor Walt Johnson presents Executive Director Barry Shepherd with a commemorative plaque. CLICK FOR MORE INFORMATION American Police Hall of Fame & Museum Policy Statement We stand with law-abiding citizens, with responsible, well-trained law enforcement, with those who understand the foundations of liberty and the Constitution. We support the rule of law and we believe whole-heartedly in a nation where you are judged by your behavior not your skin-color or ethnicity. We encourage you to work for PEACE in your streets, DIALOG in your communities, and UNDERSTANDING of the challenges faced by our first responders, even as we expect them to understand their citizenry. Dissent and discussion are American principles. Destruction is not. Law Enforcement Eternal Flame Project Unveiled For Space Coast Of Florida Click for more information. The United States Law Enforcement Eternal Flame, which will stand 10 stories tall, will be built in Titusville FL. The exact site is located on a 5 acre parcel adjacent to the Police Hall of Fame. The monument will be built by Rush Construction on behalf of the Police Hall of Fame. Ground breaking took place on Friday October 16, 2020 at 2:00pm. For more info please go to Leflame.org/ or to Aphf.org .\nIndividual donations are greatly appreciated and sponsorships are available. Show your support for law enforcement and purchase a brick on the Walk of Heroes walkway leading from the Hall of Fame to the Eternal Flame. & Pro Shop OPEN DAILY 10:00am to 6:00pm Admission Adults: $13 Kids 4-12: $8 Senior Citizens & Military: $10 Law Enforcement Officers: $2 Family Survivors: Free* Members: Free* * Guests - Half Price American Police Hall of Fame View Larger Map Exhibits, Memorabilia & Collectibles An Electric Chair & Gas Chamber, Law Enforcement Equipment and Firearms: Antique to High Tech! Vehicles On Display: Police Units, Motorcycles & More! Including the actual Police Unit from the motion picture \"Blade Runner\" Simulators & Interactive Displays American Police Hall of Fame & Museum Test your detective skills at the Crime Scene Learn about criminology and forensic science Bring your children to the “Kids Discovery” station Have your photo taken in a real jail cell Click to enlarge & print. Use of Force Training Lab Simulation Package donated by TI  Training LE American Police Hall of Fame received a $42,000 law enforcement simulator for training and to help civilians understand the split-second decision making that happens in law enforcement. APHF Shooting Center Click on a picture to see an enlargement. Use the BACK button of your Browser to return. Don't forget a gift card from the Shooting Center when shopping for that sportsman or woman in your life. Also don't forget to check out the Pro Shop for great buys on guns, ammo, apparel and odds n' ends. One of the nation's top indoor gun ranges is located in Titusville at 6350 Horizon Drive inside the American Police Hall of Fame & Museum which is a quarter of a mile east of US1 on SR405. This is a premier range that features 2 bays with 12 lanes in each. The range uses a combination of electronics and computerization, and it is fully air conditioned and it has HEPA air filtration. All firearms using pistol caliber ammunition are welcome, and modern sporting rifles using frangible ammunition may also be shot here. We have an extensive array of firearms available for rent, and we sell ammunition and targets. You may bring your own ammo and targets. We also have eye and ear protection available for rent. The range is open to the public, and the hours of operation are Noon to 8:00 PM Tuesday thru Friday, and Noon to 6:00PM Saturday and Sunday. Personal assistance is available at no cost. We have handgun leagues for adults in bullseye and tactical/practical disciplines and for kids (ages 8-17) using 22 rifles. Unless shooting in the kid's league or by special arrangement with scout troops, the minimum age for young people to shoot at the range is 13, and they must be accompanied by a parent. Call 321-264-0911 for more details. APHF Shooting Center Pro Shop This is the clean, well organized and brightly lit Pro Shop that sells handguns, long guns, ammunition, personal defense items, high end tactical flashlights and numerous types of accessories. Local famous firearms expert and columnist Dan Sabath runs the shop and he has an encyclopedic knowledge of firearms. The Pro Shop offers a wide variety of firearms from all of the top manufacturers. We are delighted to show you what we have, and what we may not have in stock we will gladly take special orders for and we will quickly fill them. We are constantly adding to our inventory so that we can be the prime source for all of your shooting sports and personal defense needs. Our Pro Shop offers a variety of products for firearms enthusiasts. We feature new firearms \nby such makers as Smith & Wesson, Glock, Springfield, Hechler & Koch, Beretta, Kahr Arms, Ruger, Taurus, and Sig Sauer, just to name a few. We handle long guns as well. Special orders are gladly taken and quickly filled. The Pro Shop is not limited to firearms as we have a good selection of personal defense ammunition and products, eye and ear protection, Shooting Center logo clothing and merchandise, and the made in America Woolrich line of pants and vests. We also have a wide variety of optical accessories as we stock lasers (red and green), light/laser combinations and scopes. We carry range bags, leather and polymer holsters, magazine pouches and an assortment of gun care products. The Pro Shop is open from Noon to 7:00 PM Tuesday through Friday and from Noon to 6:00 PM on Saturday. proshop@shooting-center.org National Association of Chiefs of Police NACOP – Founded in 1967 is a not for profit organization with programs to support officers who have been paralyzed or disabled in the line of duty, and their families; they also support police departments and training. These programs consist of Medical Reimbursements, Educational Scholarships & K-9 Assistance to name a few. For more info please go to nacoponline.org American Federation of Police & Concerned Citizens AFP&CC – Founded 1978 is a not for profit organization with programs of compassion supporting the families of officers killed in the line of duty nationwide. These critical programs include Emergency Financial Assistance, Grief Counseling, Educational Scholarships, Gift Program, Flowers of Remembrance and many more. For more info please go to afp-cc.org You can also hear a word from America's Most Wanted 's John Walsh. CLICK HERE to visit the main website of the AMERICAN POLICE Hall of Fame & Museum Annual Flag Display Honors Law Enforcement Families Hall of Fame Continues Flag Tradition Despite 2020 Ceremony Cancellation TITUSVILLE, FL – In honor of the May 15 Peace Officer Memorial Day, The American Police Hall of Fame & Museum once again has its flag display along 405, just south of Titusville. The flags represent fallen officer family members who are served by the compassionate programs headquartered at the Hall of Fame facility. Each year, the flags, which typically number around 13,000, are placed on the grounds of the Hall of Fame in cooperation with the Brevard County Sheriff's Department via inmates from the Brevard County jail. Although COVID-19 threw a monkey wrench into plans for this year's memorial observance, this is nonetheless a time of reflection and tribute at the Hall of Fame. \"Although we are not holding our formal memorial service this year, we WILL have a special video tribute playing all day inside the museum's large training room,\" said CEO Barry Shepherd. \"We want to make sure that local law enforcement and those civilians who support law enforcement have a place to come where they can reflect on the meaning of the day. The public is invited to visit the museum to watch the tribute anytime between 10 a.m. and 6 p.m. It will be looping continuously. Admission to the museum is free all day. We encourage folks to come out and pay tribute to our men and women of the thin blue line and to those who gave all...in 2019 and in years past.\" For those who cannot make it to the facility, a link to the video tribute will be posted on the Hall of Fame website at www.APHF.org. Additionally, the facility is offering a virtual \"Walk of Heroes\" on its Facebook page, allowing the general public to pay tribute to law enforcement in general, current sworn officers, fallen or disabled officers or the families who support them. You can find the virtual tribute at https://www.facebook.com/APHF911/ For more information about the facility, go to www.APHF.org or email Policeinfo@aphf.org . Originated - 6/4/03"
    },
    {
      "url": "https://aphf.org/",
      "text": "American Police Hall of Fame Home About Us Memorial News & Events Shop Visit Us Award Program Donate Buy Ticket Discover the Thrill of Law Enforcement Get ready for a day packed with excitement, adventures, and fascinating stories about the world of law enforcement. Buy Tickets Discover the Excitement of Law Enforcement Get ready for a day packed with thrills, adventures, and fascinating stories about the world of law enforcement. Buy Tickets About the Museum Plan Your Visit Explore the Campus Discover the Museum Discover Uncover the fascinating history and tools of law enforcement, including the Irish Connection digital exhibit, historic artifacts, vehicles and firearms. Experience Step into the action with interactive activities for all ages. Explore forensics, gadgets, crime-solving challenges, and exciting hands-on exhibits! Learn Explore inspiring stories of bravery from the men, women, and dogs that have shaped the law enforcement profession throughout history. Honor Celebrate the dedication and legacy of those who protect and serve every day, honoring their sacrifices at the largest indoor memorial to fallen officers. About the Museum The American Police Hall of Fame Museum offers an exciting, immersive journey into the world of law enforcement on the edge of Florida’s Space Coast. Here, you will discover a wealth of exhibits showcasing the tools, techniques, and brave individuals who have shaped policing throughout history. From interactive displays and hands-on activities to real-life police vehicles and iconic gear, the museum brings the thrilling and vital work of law enforcement to life. Whether you’re exploring crime-solving innovations, honoring the fallen, or learning about the heroes who serve, there's something for everyone to discover and enjoy. Read More Must See Attractions The Irish Connection Explore the profound influence of Irish Americans in policing with our Irish Connection digital exhibit. Celebrate their traditions, bravery, and lasting impact on law enforcement across the United States through captivating stories and a powerful documentary.... Read More The Memorial The Memorial Rotunda serves as a space for reflection and remembrance for all who visit, honoring 11,500 fallen officers, with each name etched on its walls.... Read More Big Adventures for Little Heroes Ignite your child’s imagination with hands-on law enforcement fun! From climbing into police vehicles to exploring forensic investigations and prison cells, our interactive exhibits inspire curiosity and creativity, making every visit an unforgettable adventure.... Read More See All Attractions Explore the Campus Learn and Explore the American Police Hall Of Fame with our exhibits, vintage items, and fun activities. Reset Map Click on the icon to locate the venue Free Parking Museum Entrance Restrooms Memorial Rotunda AR Infinity Flame Simulator Conference Center Shooting Center The Irish Connection K9 Memorial See Full Map Our Reviews Keith February 29, 2024 The museum is excellent. There are literally hundreds of displays. There are also several interactive exhibits and a corner dedicated to children. The focus though,is the memorial wall which contains the names of officers who have passed away in the... Anonymous March 20, 2023 To honor our fallen policemen, this museum is wonderful. Very helpful staff and an awesome tribute to our under-appreciated men and women (and K-9’s) of law enforcement. We thoroughly enjoyed our visit.... Robert May 20, 2022 A modern museum with many interesting displays surrounding the very moving memorial to the over 11,000 officers that have lost their lives in service. The very friendly & professional staff are very helpful, including offering to take pictures of visitors... Tracy October 3, 2017 Brilliant memorial for all fallen law enforcement whether they are human or K9. Brings a tear to your eye. My brother-in-law is a state trooper and this brought home how everyday he puts his life on the line for his... Read all reviews Get Ready for a Day of Adventure! Grab your tickets today and dive into the action at the American Police Hall of Fame Museum. Discounts are available for veterans, officers, families and groups . Group or Organization Booking Looking for a educational and fun field trip or small space hire for and organisation event/function? Get In Touch Take the Fun Home From toy police cars to cool gear and souvenirs, our gift shop has something for everyone. View Now Stay in Touch Stay Connected : Want to be the first to know about special events, new exhibits, and exclusive offers? Sign up for our emails and stay connected! Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Submit EIN number of 85-1403697. 501(c)(3) Organisation Our connections The APHF is home to the United States Law Enforcement Foundation (USLEF), the American Federation of Police & Concerned Citizens (AFP&CC), and USLEF's National Association of Chiefs of Police (NACOP) program. Supporting programs for law enforcement officers and their families since 1960. Tel: 321.264.0911 Email: policeinfo@APHF.org Add: 6350 Horizon Dr. Titusville, FL 32780 Pages About Us Memorial News & Events Shop Visit Us Contact Us Facilities Shooting Center Legal Volunteer FAQ Privacy Policy Terms of Use Buy Ticket Subscribe to our newsletter The latest news, articles, and resources, sent to your inbox weekly. Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Submit © 2025 United States Law Enforcement Foundation. All rights reserved."
    },
    {
      "url": "https://aphf.org/contact-us/",
      "text": "Contact Us | American Police Hall of Fame Home About Us Memorial News & Events Shop Visit Us Award Program Donate Buy Ticket Contact Us Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone Number Facility Please select a facility Museum Shooting Center Educational Programs Memorial Add for Phone Reason for Message Please select a reason from the list below Group Bookings School Visit Events Add a message By ticking this box, you agree to be contacted by a member of our staff Submit Other Contact Methods Our Address 6350 Horizon Dr. Titusville, FL 32780 Phone Number +1 321 264 0911 Email Address policeinfo@APHF.org Our Opening hours are 10 am to 4 pm, and the last entry is 3 pm. Open every Tuesday to Saturday except 24 to 26 December. EIN number of 85-1403697. 501(c)(3) Organisation Our connections The APHF is home to the United States Law Enforcement Foundation (USLEF), the American Federation of Police & Concerned Citizens (AFP&CC), and USLEF's National Association of Chiefs of Police (NACOP) program. Supporting programs for law enforcement officers and their families since 1960. Tel: 321.264.0911 Email: policeinfo@APHF.org Add: 6350 Horizon Dr. Titusville, FL 32780 Pages About Us Memorial News & Events Shop Visit Us Contact Us Facilities Shooting Center Legal Volunteer FAQ Privacy Policy Terms of Use Buy Ticket Subscribe to our newsletter The latest news, articles, and resources, sent to your inbox weekly. Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Submit © 2025 United States Law Enforcement Foundation. All rights reserved."
    },
    {
      "url": "http://aphfmuseum.org/",
      "text": "APHF Museum Home Memorial Donate Museum Shooting Center Gift Shop Awards Program Contact Us Programs Family Survivor Disabled Officers Home Donate Planned Giving Contact Us Privacy Policy American Police Hall of Fame & Museum • 6350 Horizon Dr. • Titusville, FL 32780 • (321) 264-0911 • policeinfo@aphf.org"
    },
    {
      "url": "https://www.uswalkofheroes.org/about-us",
      "text": "About Us | Walk of Heroes top of page Home Who Can Buy Bricks? What Should My Brick Say? Supporters/Donors About Us More... Use tab to navigate through the menu items. Welcome to The American Police Hall of Fame The American Police Hall of Fame & Museum is the moving force behind The United States Law Enforcement Eternal Flame and The Walk of Heroes . The Museum is located in Titusville Florida (just down the street from Kennedy Space Center), where our 50,000 sq ft facility has stood since 2003.  The Hall of Fame was founded in 1960 in Northport, Florida. Our facility offers compelling exhibits and interactives, STEM lessons for grades K-12, personal defense training for citizens, defensive tactics and related training for Law Enforcement Officers, as well as compassionate programming in support of the families of fallen officers and the families of disabled officers. Find out more about the facility at www.APHF.org or about the Eternal Flame at www.LEFlame.org . ​ We are at: 6350 Horizon Drive, Titusville, FL 32780 -- 321-264-0911 -- email Policeinfo@aphf.org or Tarae@aphf.org with questions. DONATE bottom of page"
    },
    {
      "url": "https://aphf.org/about-us/",
      "text": "About Us | American Police Hall of Fame Home About Us Memorial News & Events Shop Visit Us Award Program Donate Buy Ticket Discover America's First Law Enforcement Museum Buy Ticket Our Story A Legacy Begins Founded by retired Police Chief Gerald Arenberg, the American Police Hall of Fame becomes the nation's first law enforcement museum. Reaching the Community A foundation is established to support law enforcement and the community. Expanding Support Two programs are founded to aid families of fallen officers and provide assistance to those injured in the line of duty. Moving Forward The museum relocates to Miami, Florida, continuing its mission to educate and honor law enforcement professionals. A Permanent Home The museum finds its forever home in Titusville, Florida, welcoming visitors to explore its exhibits and learn its stories. Supporting Families USLEF leads in providing vital resources, financial aid, and emotional support to the families of fallen officers and those disabled in the line of duty. Shaping the Future With innovative training and education programs, USLEF prepares future officers and citizens to uphold safety and justice. 1960 1967 1989 1990 2003 Today Tomorrow Inside the Museum The American Police Hall of Fame Museum is a place to learn, explore and celebrate law enforcement for all the family! Through exciting exhibits, historic artifacts and fun, interactive activities, you will gain a unique insight into the challenges and triumphs of those who serve our communities. Buy Ticket Our Vision Educating the Public The museum aims to foster understanding and appreciation of law enforcement through engaging educational experiences like the Irish Connection digital exhibit. Inspiring Generations We hope to inspire the next generation of officers, leaders and citizens by showcasing the dedication, innovation and bravery of law enforcement professionals. Building Connections Our vision is to create a space where the public and law enforcement can connect; building mutual respect and understanding for a safer and stronger community. Who Are the United States Law Enforcement Foundation? The United States Law Enforcement Foundation (USLEF) is dedicated to supporting law enforcement officers, their families and the wider community. In addition to overseeing the American Police Hall of Fame and Museum, USLEF offers multiple programs such as The Hope Initiative to support officers’ children, provide emotional and financial support for families of fallen officers or those disabled in the line of duty. The USLEF wider programs promote public safety, and inspire the next generation of law enforcement. Together, we’re building a brighter future for the men and women who serve and protect our country. To learn more about the impact USLEF are having go to uslef.org. To learn more about the Police Family Survivors Fund go to afp-cc.org . Donate Friends of Law Enforcement Museum activities are sponsored, in part, by the Brevard County Board of County Commissioners, the Florida’s Space Coast Office of Tourism and The Brevard. Stay in Touch Stay Connected : Want to be the first to know about special events, new exhibits, and exclusive offers? Sign up for our emails and stay connected! Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Submit EIN number of 85-1403697. 501(c)(3) Organisation Our connections The APHF is home to the United States Law Enforcement Foundation (USLEF), the American Federation of Police & Concerned Citizens (AFP&CC), and USLEF's National Association of Chiefs of Police (NACOP) program. Supporting programs for law enforcement officers and their families since 1960. Tel: 321.264.0911 Email: policeinfo@APHF.org Add: 6350 Horizon Dr. Titusville, FL 32780 Pages About Us Memorial News & Events Shop Visit Us Contact Us Facilities Shooting Center Legal Volunteer FAQ Privacy Policy Terms of Use Buy Ticket Subscribe to our newsletter The latest news, articles, and resources, sent to your inbox weekly. Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Submit © 2025 United States Law Enforcement Foundation. All rights reserved."
    },
    {
      "url": "https://www.aphfsd.org/graduate-volunteer-program",
      "text": "Graduate Volunteer Program | aphfsd top of page Home About APHF History Organization Grants, Awards & Research Community Events FAQs Volunteering Core Volunteer Program Graduate Volunteer Program Leadership Opportunities Sponsors/Donors Partners & Sponsorships Donations Resources TB Initiative Blog Shop More Use tab to navigate through the menu items. DONATE HERE! Log In Log In GRADUATE VOLUNTEER PROGRAM This program is open to individuals enrolled in graduate-level health professional and/or public health degree programs. ​ ​ During each volunteer cycle, APHF receives a number of exceptional applicants. The volunteer cohort for American Pacific Health Foundation has become increasingly diverse while maintaining the professionalism, integrity, and scale required to personally serve our local community. Becoming a Volunteer Thank you for your interest in joining our APHF team! When serving as a graduate volunteer with American Pacific Health Foundation, you will have the opportunity to interpret test results, perform data analysis, and provide education and health consultations to outreach participants under the supervision of an APHF preceptor. In addition, you will participate in APHF's linkage-to-care committee, in which you will be thoroughly trained to follow-up with patients who received positive hepatitis test results or fulfill criteria for metabolic syndrome and guide patients through health systems to establish more longterm care for routine checkups and treatment. Furthermore, graduate volunteers can assist in the development of research projects and fundraising initiatives for APHF community health screenings . Program Expectations & Events APHF Expectations Volunteer Expectations Types of Outreaches Opportunity to serve minorities and at risk populations through educational and clinical outreaches within the community in San Diego County Development of patient care, leadership, communication, and project management skills Mentorship and a network of healthcare professionals Thorough training on APHF's mission, venue setup, data collection and processing, healthcare equipment operation, and direct patient care recommendations Transportation assistance to educational and clinical outreaches Experiential learning in community health settings. UCSD pharmacy students can earn IPPE service-learning credits at APHF outreaches. Professional conduct during outreaches and respectful engagement with community members, volunteer staff, and volunteer health professionals Completion of Volunteer Onboarding, which includes both virtual and in-person training components, and payment of annual $25 membership fee Proof of completion of COVID-19 vaccination series with recommended boosters Fulfillment of a 1-year member term and participation in at least 3 APHF events. If you have been approved to serve as a Graduate Volunteer once, you will not need to reapply unless you are determined inactive by the Executive Board. Business casual attire, white coat, name badge, and closed-toe shoes​ ​​ On average, there are 1-2 in-person events per month that volunteers may register for: Clinical Outreaches : APHF either hosts clinical outreaches or collaborates with other community health organizations to provide free health screenings, medical education, and consultations to community members Educational Outreaches : APHF staff members and volunteers enter community settings to provide free medical education on medical conditions and/or diseases such as Tuberculosis and Hepatitis B to community members; no health screenings or consultations are performed at educational outreaches Become a Graduate Volunteer! ​ If you are interested in becoming a graduate volunteer, please email info@aphfsd.org to notify volunteer staff PRIOR to the submission of the application below. ​ Apply to Graduate Volunteer Program! 2025-2026 APPLICATION CYCLE IMPORTANT DATES (Last Updated 08/08/2025) 01 Submit Graduate Program Application 02 Await Staff Deliberation 03 Attend & Complete Training Sessions American Pacific Health Foundation info@aphfsd.org (619) 736-9348 9 500 Gilman Drive, Unit 0657 , La Jolla, CA 92093 ©2025 American Pacific Health Foundation - All Rights Reserved Powered by InterServer.net InterServer Provides FREE Web Hosting to Non-Profit Organizations ​ bottom of page"
    },
    {
      "url": "https://www.aphfsd.org/leadership",
      "text": "Leadership Opportunities | aphfsd top of page Home About APHF History Organization Grants, Awards & Research Community Events FAQs Volunteering Core Volunteer Program Graduate Volunteer Program Leadership Opportunities Sponsors/Donors Partners & Sponsorships Donations Resources TB Initiative Blog Shop More Use tab to navigate through the menu items. DONATE HERE! Log In Log In LEADERSHIP OPPORTUNITIES Aiming for a career in the health professions or in public health? Becoming a staff member with APHF allows volunteers to get even more involved in community service, event coordination, project planning, and clinical education. Check out the list of various health professional programs where our APHF volunteer staff have matriculated:​ ​ Boston University, Chobanian & Avedisian School of Physician Assistant Program California University of Science and Medicine Kansas City University, College of Osteopathic Medicine Oakland University William Beaumont School of Medicine Ohio State University, College of Medicine UC San Diego School of Medicine Skaggs School of Pharmacy and Pharmaceutical Sciences UC San Francisco School of Medicine School of Pharmacy UC Riverside, School of Medicine University of Southern California, School of Pharmacy Western University of Health Sciences College of Osteopathic Medicine of the Pacific College of Pharmacy​ NOTE: These leadership roles are open to undergraduate students and postgraduate (alumni) only. Our team is looking to expand our leadership team and clinical volunteer base. Team members at all levels of leadership within APHF can pursue or join projects (e.g. improving outreach logistics, creating educational content, starting research projects) that benefit APHF and the services we bring to the greater community. This will be a minimum 1+ year volunteer commitment until May 31st, 2026 . Use the table to learn about APHF's volunteer staff positions! ​ ​ ​ ​ ​ ​ Program Intern Program Coordinator Program Manager Program Manager (PM) Open to APHF volunteers who have served as a Program Intern or Program Coordinator for at least 1 term. Responsible for coordinating all APHF volunteers, establishing partnerships with community organizations, and overseeing all outreach operations. Connect APHF Leadership to volunteers and community stakeholders. Promotion to Program Manager is internal. Email volunteer@aphfsd.org for more information about becoming a Program Manager. Program Intern (PI) Open to passionate, community-focused individuals from the San Diego County community as well as current APHF Core Volunteers. Support and learn from other staff members, in addition to managing the Medical Interpreter Program. Develop core leadership and project management skills that are applicable to many other roles across healthcare. ​ Click HERE for the PI Job Description Program Coordinator (PC) Open to passionate, community-focused individuals from the San Diego County community as well as current APHF Core Volunteers. Past experience with community outreach and/or leadership roles is recommended. Organize and lead events such as screening and education outreaches. Primarily responsible for aspects related to the Core Volunteer Program, including volunteer recruitment, training, event attendance, etc. • Click HERE for the PC Job Description ​​​Apply below to join APHF's volunteer staff team! The Program Intern and Program Coordinator roles have a joint application. Submitting the following application can put you into consideration for both positions. Our team will extend offers to the position that best suits an applicant’s skills, experience, and interests. If you prefer one position over the other, please indicate your preference in your written response!​ Applications are due on May 2nd, 2025 at 11:55pm PT. All accepted applicants must be able to attend an interview between May 10-11, 2025 . The exact time will be scheduled after applications close. Please reach out to us at volunteer@aphfsd.org if you have any questions or concerns! APPLY American Pacific Health Foundation info@aphfsd.org (619) 736-9348 9 500 Gilman Drive, Unit 0657 , La Jolla, CA 92093 ©2025 American Pacific Health Foundation - All Rights Reserved Powered by InterServer.net InterServer Provides FREE Web Hosting to Non-Profit Organizations ​ bottom of page"
    },
    {
      "url": "http://aphfmuseum.org/aphfhome.html",
      "text": "American Police Hall of Fame &\tMuseum Home Exhibits Memorial Donate Gift Shop Contact Us Visit the Museum Become a Volunteer Become a Member Make a Donation Map & Directions Visiting Hours Open 7 days a week 10 a.m. - 6 p.m. Contact Us Our 2nd annual Hall of Fame Cup golf tournament was a huge success. The Hall of Fame staff and 77 tournament players all braved the slightly overcast windy conditions and 72 degree November weather to raise $30,000 for disabled officers in Hall of Fame programs of compassion. We are very thankful for all those sponsors and players that helped to make this tournament a great one! Next yearâs goal is to raise $50,000 and have 100 players. Please call (321) 264-0911 to find out about next yearâs tournament. The American Police Hall of Fame & Museum, founded in 1960, is the nation's first \n\t\t\t   national police museum and memorial dedicated to American law enforcement officers \n\t\t\t   killed in the line of duty. The Museum, through interactive displays, simulators and nearly 11,000 artifacts, educates the public about the history and current trends of American law enforcement. Featured at the Museum is a state-of-the-art 24 lane indoor gun range and is open to the public six days a week. The Memorial lists over 9,000 officers who were killed in the line of duty. Their names are permanently etched on the Memorial's marble walls, which are added to once a year for Police Memorial Day. On Police Memorial Day (May 15th) the Memorial hosts thousands of police officers, family survivors and dignitaries. The event is a somber reminder that every 57 hours, a police officer is killed in the line of duty somewhere in America. Home Donate Planned Giving Contact Us Privacy Policy American Police Hall of Fame & Museum • 6350 Horizon Dr. • Titusville, FL 32780 • (321) 264-0911 • policeinfo@aphf.org"
    },
    {
      "url": "https://www.nbbd.com/aphf/",
      "text": "American Police Hall of Fame & Museum - Titusville Florida CONNECT CONTACT NBBD Home Page Go & Do Sports Cultural History & Museums Space Nature & Outdoors Non-Profits Houses of Worship Government Education Interactive Site Map Disabilities Services CONTACT BUSINESSES Businesses Directory Restaurants Real Estate EVENTS LISTING Festivals Facebook Downtown Titusville Parks & Recreation Parks Activities Community Center Calendars Wildlife Refuge National Seashore Enchanted Forest Sams House PRESS RELEASES Brevard County City of Titusville Downtown Titusville NASA NASA PR SpaceX PR ULA PR Blue Origin PR Launch Viewing Parrish Medical OUTDOORS National Wildlife Refuge National Seashore Refuge/Seashore MAP Sanctuaries Enchanted Forest Sams House Sanctuaries MAP Ecotourism Photography Space Coast Outdoors Birding Paddling Hiking Biking PARKS Calendars North Area Parks Scottsmoor & Mims Titusville Area Port St. John & Canaveral Groves Disabilities LIBRARIES Mims / Scottsmoor Titusville Port St. John Brevard County Genealogy SOFT ADVENTURES Playgrounds Downtown Titusville Museums & History Refuge & Seashore South Titusville Fishing & more POPULAR North Brevard History Windover Bog People Gopher tortoise Warbird Airshow Edible Plants Black Point Drive Fort Christmas Manatee Hammock Campground Wildlife Festivals Wildlife Rehabilitators St. Johns River Fishing Pier Parrish Medical Sea Turtle Festival N.B. Heritage Foundation ????? Menu with CSS3 Css3Menu.com AMERICAN POLICE Hall of Fame & Museum The Nation's First Museum, Attraction and Memorial Honoring All Police In Federal, State, County and Local Departments 6350 Horizon Dr. Titusville, FL 32780 321-264-0911 policeinfo@aphf.org Latitude: 28.526228 Longitude: -80.783247 • Remembering Those We Love • Serving Those in Need • Educating Those Who Need To Know • The American Police Hall of Fame and Museum was founded in 1960. It is the nation's first national police museum and memorial dedicated to law enforcement officers killed in the line of duty. MUSEUM The Museum at The American Police Hall of Fame hosts nearly 11,000 exhibits and artifacts relating to law enforcement. Many of these exhibits are interactive and include a large collection of antique law enforcement vehicles, decommissioned fire arms and tools used by law enforcement officers. Stop by our kids corner where kids can dress the part of their favorite law enforcement officer, practice their detective skills in an interactive lab and make their own badge to take home. To find out more about the museum or the facility's compassionate services for law enforcement families, please call 321-264-0911 or email policeinfo@aphf.org . Admission: Adults: $13.00 Children Under 4 - FREE Children (Ages 4 - 12): $8.00 Military & Senior Citizens: $10.00 Law Enforcement Officers: $5.00 Family Survivors: $2.00 Group Rates (12 or more people) Adults: $6.50 Children (Ages 4-12): $4.00 Museum Hours: Tuesday - Saturday: 10:00AM - 4:00PM Shooting Center Range Combo Admission: $40.00 Get the full experience with museum admission, 50 rounds of 9mm ammo with free firearm rental and instruction! Shooting Center Hours: Tuesday - Friday: Noon - 8:00PM Saturday - Sunday: Noon - 6:00PM Social distancing and limited occupancy to be observed. The United States Law Enforcement Eternal Flame October 20, 2020 Ground Broken for Eternal Flame, Walk of Heroes TITUSVILLE – On the heels of financial commitments from the Brevard County Commissioners and two national law enforcement organizations, as well as support from numerous businesses, individuals and television's John Walsh, the American Police Hall of Fame put shovels to dirt Oct. 16 in preparation for \"phase one.\" \"We began developing plans for this monument five years ago,\" Executive Director Barry Shepherd told the assembled celebrants. \"And we are so proud and thrilled to finally be breaking ground on it. It's even more significant that we are doing so the day after celebrating our 60th anniversary. We are starting the next 60 years with great momentum and purpose.\" The Flame will pay tribute to law enforcement officers lost in the line of duty as well as to those who patrol the streets of America daily. The Walk of Heroes offers an opportunity for individuals, clubs, businesses etc. to purchase either a 4x8 or an 8x8 brick. \"There is still time to purchase a brick for the first installation. This can be done on a secure site that you can access by going to www.USWalkofHeroes.org or you can download a form and mail in your order,\" explained Tara Dixon Engel, President of the Hall of Fame. \"We have already begun clearing ground and, with the groundbreaking finished, we will be grading the land and prepping for paver installation. It is an exciting time around here. After the craziness and delays of 2020, we are ready to hit the ground running in 2021.\" During the Friday ceremony, letters of support for the project were read from \"America's Most Wanted\" star John Walsh, Senator Rick Scott (who prepared a video presentation), Governor Ron DeSantis, Congressman Bill Posey (who attended and read his letter), the NRA, the Police Benevolent Association, the NYPD's 10-13 Club, the 9463 Foundation and others. Visitors were treated to a replica of the planned Flame, complete with hundreds of twinkling lights on the stem of the structure, just below the flame itself. Guests of honor also included Commissioner Rita Pritchett, former Commissioner Robin Fisher, officials from Rush construction, board members and staff from The American Police Hall of Fame & Museum, and many others. \"In response to the phone calls we are getting, yes, there is still opportunity for sponsorships or donations, both financial and in-kind, for the project,\" Shepherd noted. \"The pinnacle donor spot is still available and we have a short list of companies in mind for that leadership gift, but we will meet with others who express interest in that level of visibility and involvement. Those seeking additional donor opportunities can contact Tara Dixon Engel at the Hall of Fame, while sponsorships are being handled by our Director of Sales, Events & Protocol, Janey Hicks.\" Project details, deadlines and related information will be available at www.LEFlame.org for the Flame and www.USWalkofHeroes.org for the paver path. To find out more, call 321-264-0911. Pictured, from left are: Brian Blanchard of the Tourism Development Council, Brian Donnelly of the 9463 Foundation, Chief John Lau of Titusville Police Department, Al Boettjer of the Police Benevolent Association, Sheriff Wayne Ivey of the Brevard County Sheriff's Office, Congressman Bill Posey, Barry Shepherd of American Police Hall of Fame, Brevard County Commissioner Rita Pritchett, William Chivers of Rush Construction, and Titusville Mayor Walt Johnson. Congressman Bill Posey expresses his support for the project. Titusville Mayor Walt Johnson presents Executive Director Barry Shepherd with a commemorative plaque. CLICK FOR MORE INFORMATION American Police Hall of Fame & Museum Policy Statement We stand with law-abiding citizens, with responsible, well-trained law enforcement, with those who understand the foundations of liberty and the Constitution. We support the rule of law and we believe whole-heartedly in a nation where you are judged by your behavior not your skin-color or ethnicity. We encourage you to work for PEACE in your streets, DIALOG in your communities, and UNDERSTANDING of the challenges faced by our first responders, even as we expect them to understand their citizenry. Dissent and discussion are American principles. Destruction is not. Law Enforcement Eternal Flame Project Unveiled For Space Coast Of Florida Click for more information. The United States Law Enforcement Eternal Flame, which will stand 10 stories tall, will be built in Titusville FL. The exact site is located on a 5 acre parcel adjacent to the Police Hall of Fame. The monument will be built by Rush Construction on behalf of the Police Hall of Fame. Ground breaking took place on Friday October 16, 2020 at 2:00pm. For more info please go to Leflame.org/ or to Aphf.org .\nIndividual donations are greatly appreciated and sponsorships are available. Show your support for law enforcement and purchase a brick on the Walk of Heroes walkway leading from the Hall of Fame to the Eternal Flame. & Pro Shop OPEN DAILY 10:00am to 6:00pm Admission Adults: $13 Kids 4-12: $8 Senior Citizens & Military: $10 Law Enforcement Officers: $2 Family Survivors: Free* Members: Free* * Guests - Half Price American Police Hall of Fame View Larger Map Exhibits, Memorabilia & Collectibles An Electric Chair & Gas Chamber, Law Enforcement Equipment and Firearms: Antique to High Tech! Vehicles On Display: Police Units, Motorcycles & More! Including the actual Police Unit from the motion picture \"Blade Runner\" Simulators & Interactive Displays American Police Hall of Fame & Museum Test your detective skills at the Crime Scene Learn about criminology and forensic science Bring your children to the “Kids Discovery” station Have your photo taken in a real jail cell Click to enlarge & print. Use of Force Training Lab Simulation Package donated by TI  Training LE American Police Hall of Fame received a $42,000 law enforcement simulator for training and to help civilians understand the split-second decision making that happens in law enforcement. APHF Shooting Center Click on a picture to see an enlargement. Use the BACK button of your Browser to return. Don't forget a gift card from the Shooting Center when shopping for that sportsman or woman in your life. Also don't forget to check out the Pro Shop for great buys on guns, ammo, apparel and odds n' ends. One of the nation's top indoor gun ranges is located in Titusville at 6350 Horizon Drive inside the American Police Hall of Fame & Museum which is a quarter of a mile east of US1 on SR405. This is a premier range that features 2 bays with 12 lanes in each. The range uses a combination of electronics and computerization, and it is fully air conditioned and it has HEPA air filtration. All firearms using pistol caliber ammunition are welcome, and modern sporting rifles using frangible ammunition may also be shot here. We have an extensive array of firearms available for rent, and we sell ammunition and targets. You may bring your own ammo and targets. We also have eye and ear protection available for rent. The range is open to the public, and the hours of operation are Noon to 8:00 PM Tuesday thru Friday, and Noon to 6:00PM Saturday and Sunday. Personal assistance is available at no cost. We have handgun leagues for adults in bullseye and tactical/practical disciplines and for kids (ages 8-17) using 22 rifles. Unless shooting in the kid's league or by special arrangement with scout troops, the minimum age for young people to shoot at the range is 13, and they must be accompanied by a parent. Call 321-264-0911 for more details. APHF Shooting Center Pro Shop This is the clean, well organized and brightly lit Pro Shop that sells handguns, long guns, ammunition, personal defense items, high end tactical flashlights and numerous types of accessories. Local famous firearms expert and columnist Dan Sabath runs the shop and he has an encyclopedic knowledge of firearms. The Pro Shop offers a wide variety of firearms from all of the top manufacturers. We are delighted to show you what we have, and what we may not have in stock we will gladly take special orders for and we will quickly fill them. We are constantly adding to our inventory so that we can be the prime source for all of your shooting sports and personal defense needs. Our Pro Shop offers a variety of products for firearms enthusiasts. We feature new firearms \nby such makers as Smith & Wesson, Glock, Springfield, Hechler & Koch, Beretta, Kahr Arms, Ruger, Taurus, and Sig Sauer, just to name a few. We handle long guns as well. Special orders are gladly taken and quickly filled. The Pro Shop is not limited to firearms as we have a good selection of personal defense ammunition and products, eye and ear protection, Shooting Center logo clothing and merchandise, and the made in America Woolrich line of pants and vests. We also have a wide variety of optical accessories as we stock lasers (red and green), light/laser combinations and scopes. We carry range bags, leather and polymer holsters, magazine pouches and an assortment of gun care products. The Pro Shop is open from Noon to 7:00 PM Tuesday through Friday and from Noon to 6:00 PM on Saturday. proshop@shooting-center.org National Association of Chiefs of Police NACOP – Founded in 1967 is a not for profit organization with programs to support officers who have been paralyzed or disabled in the line of duty, and their families; they also support police departments and training. These programs consist of Medical Reimbursements, Educational Scholarships & K-9 Assistance to name a few. For more info please go to nacoponline.org American Federation of Police & Concerned Citizens AFP&CC – Founded 1978 is a not for profit organization with programs of compassion supporting the families of officers killed in the line of duty nationwide. These critical programs include Emergency Financial Assistance, Grief Counseling, Educational Scholarships, Gift Program, Flowers of Remembrance and many more. For more info please go to afp-cc.org You can also hear a word from America's Most Wanted 's John Walsh. CLICK HERE to visit the main website of the AMERICAN POLICE Hall of Fame & Museum Annual Flag Display Honors Law Enforcement Families Hall of Fame Continues Flag Tradition Despite 2020 Ceremony Cancellation TITUSVILLE, FL – In honor of the May 15 Peace Officer Memorial Day, The American Police Hall of Fame & Museum once again has its flag display along 405, just south of Titusville. The flags represent fallen officer family members who are served by the compassionate programs headquartered at the Hall of Fame facility. Each year, the flags, which typically number around 13,000, are placed on the grounds of the Hall of Fame in cooperation with the Brevard County Sheriff's Department via inmates from the Brevard County jail. Although COVID-19 threw a monkey wrench into plans for this year's memorial observance, this is nonetheless a time of reflection and tribute at the Hall of Fame. \"Although we are not holding our formal memorial service this year, we WILL have a special video tribute playing all day inside the museum's large training room,\" said CEO Barry Shepherd. \"We want to make sure that local law enforcement and those civilians who support law enforcement have a place to come where they can reflect on the meaning of the day. The public is invited to visit the museum to watch the tribute anytime between 10 a.m. and 6 p.m. It will be looping continuously. Admission to the museum is free all day. We encourage folks to come out and pay tribute to our men and women of the thin blue line and to those who gave all...in 2019 and in years past.\" For those who cannot make it to the facility, a link to the video tribute will be posted on the Hall of Fame website at www.APHF.org. Additionally, the facility is offering a virtual \"Walk of Heroes\" on its Facebook page, allowing the general public to pay tribute to law enforcement in general, current sworn officers, fallen or disabled officers or the families who support them. You can find the virtual tribute at https://www.facebook.com/APHF911/ For more information about the facility, go to www.APHF.org or email Policeinfo@aphf.org . Originated - 6/4/03"
    },
    {
      "url": "https://aphf.org/memorial/",
      "text": "Memorial | American Police Hall of Fame Home About Us Memorial News & Events Shop Visit Us Award Program Donate Buy Ticket Preserving the Legacy of Our Fallen Officers Buy Ticket About the Memorial Founded in 1960, the American Police Hall of Fame Memorial is a lasting tribute to officers who have made the ultimate sacrifice in the line of duty. The Memorial honors the lives of those who served from 1960 onward, with over 11,500 names etched into its walls. Each name tells a story of courage, dedication, and selflessness, ensuring that these heroes are never forgotten. We are also proud to announce an exciting digital project that will honor all American officers killed in the line of duty, including those who served before 1960. This groundbreaking initiative will preserve their legacies for future generations. Sign up below to learn more about this project and help us continue to remember our nation’s fallen heroes. Read Our Guidelines Buy Ticket Search for a Fallen Officer Use our search tool to find officers who made the ultimate sacrifice. If you have trouble finding a name, try using just one search filter like first name. If you know of an officer killed in the line of duty after 1960 that is not in our database, get in touch below to submit the officer’s information. K-9 Memorial A Tribute to our Four-Legged Officers Pay a special tribute to the dedication of law enforcement’s canine partners at our K-9 memorial. Learn more about how these faithful companions have helped keep our country safe. Buy Ticket Law Enforcement Memorial Service 2025 Our annual memorial service serves as a poignant reminder of the dedication and courage of law enforcement. Together with thousands of officers, family members, survivors and dignitaries, we stand in remembrance and gratitude for their service. The yearly memorial service is an invitation-only event. If you would like to be considered, get in touch with us below. Request Invitation The United States Law Enforcement Foundation (USLEF) welcomes all Family survivors, co-workers, and friends to join us as we honor the law enforcement officers who have died in the line of duty. Read about the event and view pictures Donate From Training to Tribute How We're Making an Impact The Hope Initiative Offering emotional and financial support to families of fallen officers. Providing gifts on days that weigh the most, offering scholarships to further education, and financial grants to ensure they can rebuild their lives after loss. Find Out More Officers Awards Honoring the bravery of law enforcement officers across the nation, search for or nominate an officer for an award today. Read More Memorial Day Our annual memorial service serves as a poignant reminder of the dedication and courage of law enforcement, recognizing that every 57 hours, a police officer loses their life in the line of duty. Read More Memorial Rotunda Visit the largest indoor memorial to fallen officers in the United States, where every officer fallen in the line of duty since 1960 is etched on the walls as a solemn reminder of their bravery. Give a Memorial Rose Your gift of a Memorial Rose will be lovingly placed in the Memorial at the American Police Hall of Fame, near the name of your fallen officer, as a tribute to their bravery, sacrifice, and service. The rose serves as a lasting symbol of remembrance, honoring the life and dedication of your loved one. To participate, please provide the name of your fallen officer along with a personal message below. Each rose costs $20, and all proceeds will support the continued preservation and enhancement of the Memorial. Donate A Memorial Rose Stay in Touch Stay Connected : Want to be the first to know about special events, new exhibits, and exclusive offers? Sign up for our emails and stay connected! Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Submit EIN number of 85-1403697. 501(c)(3) Organisation Our connections The APHF is home to the United States Law Enforcement Foundation (USLEF), the American Federation of Police & Concerned Citizens (AFP&CC), and USLEF's National Association of Chiefs of Police (NACOP) program. Supporting programs for law enforcement officers and their families since 1960. Tel: 321.264.0911 Email: policeinfo@APHF.org Add: 6350 Horizon Dr. Titusville, FL 32780 Pages About Us Memorial News & Events Shop Visit Us Contact Us Facilities Shooting Center Legal Volunteer FAQ Privacy Policy Terms of Use Buy Ticket Subscribe to our newsletter The latest news, articles, and resources, sent to your inbox weekly. Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Submit © 2025 United States Law Enforcement Foundation. All rights reserved."
    },
    {
      "url": "https://www.aphf.org/privacy",
      "text": "Privacy Policy | American Police Hall of Fame Home About Us Memorial News & Events Shop Visit Us Award Program Donate Buy Ticket Privacy Policy This Website is owned and operated by the United States Law Enforcement Foundation. We understand that visitors to our site may be concerned about the information they provide to us, and what we do with that information. This Privacy Policy addresses those concerns. This policy may be updated from time to time. If you have any questions or comments about our Privacy Policy, you can contact us at: United States Law Enforcement Foundation 6350 Horizon Dr. Titusville, Florida 32780 Telephone: (321) 264-0911 Fax: (321) 264-0033 e-mail: policeinfo@aphf.org USLEF Policy USLEF uses its best efforts to respect the privacy of its online visitors. At our site, we do not collect personally identifiable information from individuals unless they provide it to us voluntarily and knowingly. This means we do not require you to register or provide information to us in order to view our site. USLEF respects the privacy of its members, visitors and donors, both digital and “real world.” We do not collect personally identifiable information from individuals unless they provide it to us voluntarily and knowingly. This means we do not require you to register or provide information to us in order to view our website. USLEF only gathers personally identifiable data, such as names, addresses, zip/postal codes, e-mail addresses, etc., when voluntarily submitted by a visitor. For example, personally identifiable information may be collected in order to respond to a stated desire to volunteer time to USLEF or to make a donation online. This information is used by our organization(s) for internal purposes. With your knowledge and permission, these names are occasionally shared with other organizations that share our goals. This process is carefully controlled and we do so with the belief that you will find that these groups compatible with your values and interests. We follow this policy in all interactions, both on- and off-line. And, in the event that you do not want your information shared with other entities, we offer an “opt out” box in each area of the site where you provide personal information. If you are not on-line and still wish to opt out, you may call us at 321-264-0911 or email us at policeinfo@aphf.org and we will see to it that your name is removed from our list sharing activities. As a consumer-friendly organization, USLEF will continue to work to maintain the privacy of its members, donors and visitors. Credit Card Security Issues We care about the safety and security of your transaction. We use high-grade encryption and the https security protocol to communicate with your browser software. This method is the industry standard security protocol, which makes it extremely difficult for anyone else to intercept the credit card information you send to us. Contributions to the organization may also be made by calling 1-321-264-0911 or by writing us directly. EIN number of 85-1403697. 501(c)(3) Organisation Our connections The APHF is home to the United States Law Enforcement Foundation (USLEF), the American Federation of Police & Concerned Citizens (AFP&CC), and USLEF's National Association of Chiefs of Police (NACOP) program. Supporting programs for law enforcement officers and their families since 1960. Tel: 321.264.0911 Email: policeinfo@APHF.org Add: 6350 Horizon Dr. Titusville, FL 32780 Pages About Us Memorial News & Events Shop Visit Us Contact Us Facilities Shooting Center Legal Volunteer FAQ Privacy Policy Terms of Use Buy Ticket Subscribe to our newsletter The latest news, articles, and resources, sent to your inbox weekly. Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Submit © 2025 United States Law Enforcement Foundation. All rights reserved."
    },
    {
      "url": "https://uslef.org/about/",
      "text": "About Us | United States Law Enforcement Foundation DONATE Home About Us Programs The Hope Initiative The Irish Connection The Force Defenders Guardian Academy The Hero Collection Beyond the Badge Officer Education Visit Us Memorial Ways to Give Donate DONATE Our Vision & Mission The United States Law Enforcement Foundation (USLEF) stands at the forefront of innovation and progress in the law enforcement community. For more than five decades, we have served as unwavering advocates and supporters of law enforcement professionals, leveraging cutting-edge technology, including artificial intelligence (AI), to revolutionize how we serve, inspire, and educate those in the field. About Us Watch our story unfold—learn about our impact, the people we serve, and our commitment to law enforcement through the video below Meet our leadership team Our Legacy Since 1960 the profession of Law Enforcement has been supported through three related organizations: American Police Hall of Fame and Museum (APHF) The American Police Hall of Fame & Museum is a tribute to those who lost their lives in the line of duty and a celebration of U.S. law enforcement history. Founded in 1960 by former officer Gerald Arenberg after he was injured by a drunk driver. Learn More About the APHF National Association of Chiefs of Police (NACOP) The National Association of Chiefs of Police (NACOP) advocates for law enforcement and security personnel at all levels, promoting their interests and building public trust. Guided by an advisory board and annual member surveys. Learn More About the NACOP American Federation of Police and Concerned Citizens (AFPCC) Founded in 1978, the American Federation of Police and Concerned Citizens (AFPCC) supports officers and their families through a range of services. AFPCC provides survivor programs for families of officers killed in the line of duty. Learn More About the AFPCC Be a Part of Our Mission Join us in supporting law enforcement officers and their families. Your contribution helps us provide education, emotional wellness resources, and financial literacy programs. Support USLEF Financial Disclosures In October 2023, AFPCC merged with the National Association of Chiefs of Police (NACOP) to become the United States Law Enforcement Foundation (USLEF). Year 2023 USLEF 2022-23 Impact Report USLEF 2023 Financials USLEF 2023 Form 990 AFP-CC 2023 Financials AFP-CC 2023 Form 990 Year 2022 AFP-CC 2022 Financials AFP-CC 2022 IRS Form 990 NACOP 2022 Financials NACOP 2022 IRS Form 990 Year 2021 NACOP 2021 IRS Form 990 Year 2020 AFP-CC 2020 IRS Form 990 USLEF is a 501(c)3 tax-exempt organization. National Headquarters 6350 Horizon Drive, Titusville, FL 32780 | Tel: +1 321 - 264 0911 Home About Us Programs Visit Us Memorial Ways to Give American Police Hall of Fame and Museum National Association of Chiefs of Police American Federation of Police and Concerned Citizens Privacy Policy Terms of Use Contact Us Financial Disclosure Donate Buy Tickets © 2025 United States Law Enforcement Foundation. All rights reserved. Search Submit Clear Search Submit Clear"
    },
    {
      "url": "https://www.visitspacecoast.com/profile/titusville/arts-culture/american-police-hall-of-fame/",
      "text": "American Police Hall of Fame - Visit Space Coast Skip to main content Item Added to Itinerary My Planner Share My Itinerary Added to Wishlist Copied to Clipbord Surf Cams Map Local Weather Explore Fall is for Foodies Kennedy Space Center Visitor Complex Port Canaveral Wildlife Viewing Cocoa Beach Brevard Zoo Things To Do Sea Turtle Season Attractions Beaches Communities Restaurants Tours Museums Stay Bed and Breakfast Campgrounds Hotels Vacation Rentals Events Blogs Launches My Itinerary Visitor Information Vacation Planner Accessibility on the Space Coast Beach Safety Transportation and Map Search for: Search Follow Us on Social Media facebook-f instagram youtube pinterest-p Search for: Search Home Arts & Culture American Police Hall of Fame Add to Wishlist American Police Hall of Fame The American Police Hall of Fame and Museum is the nation’s first law enforcement museum. Inside you will find interactive displays, simulators and nearly 11,000 artifacts about American law enforcement. Kids will love the kid center that includes a dress up area, puppet theater and fingerprinting area. The memorial lists over 9,000 officers who were killed in the line of duty, and every year during Police Week, they host police officers, family survivors and dignitaries. The museum also features a 24-lane indoor gun range that is open to the public six days a week. The range has different hours than the museum; find out more at www.shootingcenter.org. Add to Trip Visit Website Direction 6350 Horizon Dr, Titusville, FL 32780 Contact 321-264-0911 Discover More nearTitusville All Hotels Restaurants Events Add to Wishlist Vine & Olive Titusville Celebrate the season with our Fall is for Foodies prix fixe menu. Begin with shareables like house meatballs, crispy mozzarella, or a fig out flatbread. Choose fresh salads, then savor Italian entrées from chicken parmesan with creamy rigatoni to mushroom bucatini, spicy rigatoni, or rich short rib bolognese. End with… Add to Trip Add to Wishlist Third Culture Kitchen Titusville Share a delicious 3-course meal for two! Start with a Mezze or Small Plate like veggie spring rolls, fried cheese, chips & queso, or a fresh ginger salad. Choose two entrées — burritos, hibachi bowls, Latin bowls, or street tacos — with your favorite proteins and sides. End on a… Add to Trip Add to Wishlist Bravo Taco Titusville Enjoy the ultimate taco trio: one Soft Taco (chicken or beef), one Hard Taco, and the star — a cheesy Bravo Taco, with two crispy shells wrapped in a warm flour tortilla with queso, loaded with your choice of protein and all the fresh toppings. Served with chips & salsa… Add to Trip Add to Wishlist Zero Gravity Wine Bar Titusville More than just a wine bar, Zero Gravity Wine Bar offers a tasting experience for everyone, whether you’re just getting started or already love wine. You don’t need to be an expert here. Our founders are passionate wine lovers who believe tasting should be fun, relaxed, and open to all…. Add to Trip Add to Wishlist Humpavelli’s Pizza Titusville Family-owned since 2013 to serve you the best food with the always freshest ingredients. We pride ourselves on having the friendliest customer service around as we make your food to order in an open kitchen to show you what we’re all about. We make everything in-house every morning to continuously… Add to Trip Add to Wishlist Past and Presence, Titusville’s Historic Ghost Tour Titusville Step into the mysterious and haunting history of Titusville, Florida, with our immersive ghost tours. Our guided tours offer a unique blend of history, folklore, and spine-chilling tales that will leave you captivated and intrigued. Whether you’re a skeptic or a believer, our tours provide an unforgettable experience that will… Add to Trip Add to Wishlist In the Dog House Art Studio Titusville In the Dog House Art Studio and Tiny House Art Village is a vision made reality by artist Maxine Trainer. Located on 4 acres on Florida’s Space Coast, the studio and art village comprise a venue for art classes and special events; a gallery feature work by Maxine and other… Add to Trip Add to Wishlist Comfort Suites Titusville Near Kennedy Space Center Titusville Exciting news! We’ve just launched the brand new Comfort Suites Titusville near Kennedy Space Center, offering the perfect blend of comfort, convenience, and value for your next business trip to the heart of Florida’s Space Coast. Stay in Style, Work with Ease: Spacious guest rooms featuring plush bedding, flat-screen TVs… Add to Trip Add to Wishlist Vine & Olive Titusville Vine & Olive is inspired by local fresh ingredients to make elevated dishes served in an inviting casual setting. You will see dishes on our menu that have Italian and Mediterranean influences served with a modern twist. We also have a large selection of Gluten free and vegan options. We… Add to Trip Add to Wishlist Chain of Lakes Park – Sports Venue Titusville Chain of Lakes Park is located just north of downtown Titusville and hosts playgrounds, trails, relaxing waterfront seating and: Two (2) lighted 200’ softball fields Five (5) lighted 300’ softball fields Eight (8) soccer fields ﻿ ﻿﻿ Add to Trip Add to Wishlist Space Coast Ceramics Titusville A walk in paint your own pottery studio, fun for the whole family, couples, and large groups! Come by any time to paint your own pottery in a relaxed, fun environment suitable for all ages. Groups of 6+, reservations recommended. Give us a call, we would love to tell you… Add to Trip Add to Wishlist Black Cat Coffee Titusville Black Cat Coffee is a small batch coffee roaster and coffee shop. We specialize in single origin coffee. Add to Trip Add to Wishlist The Café Paradiso Bistro and Social Club Titusville Café Paradiso Bistro and Social Club is where the vibrant flavors of the Caribbean, the soulful essence of Cajun and Creole, and the rich tastes of Cuban cuisine come together in perfect harmony. We are proud to offer you an authentic New Orleans dining experience that you will fall in… Add to Trip Add to Wishlist Springs to Sea Old Florida Eco Tours Titusville Want to get lost in the moment without getting lost in the crowd? Springs to Sea Old Florida Eco Tours provides kayak tours, paddle board tours, guided hikes, and outdoor fitness to visitors and locals! Springs to Sea Old Florida Eco Tours is permitted with USFWS to operate commercial tours… Add to Trip Add to Wishlist Blue Heron Restaurant Titusville Open to the public in The Great Outdoors. Beautiful views, delicious food and comfortable atmosphere. Add to Trip Add to Wishlist Home2 Suites by Hilton Melbourne Viera A relaxing stay near Avenue Viera shopping. We’re off I-95, five minutes from The Avenue Viera mall for shopping, dining, and entertainment. The USSA Space Coast Stadium and Duran Golf Club are within two miles. Cocoa Village is a 20-minute drive, home to boutique shopping and weekend markets. Enjoy your... Add to Trip Add to Wishlist Hilton Garden Inn Cape Canaveral near Cocoa Beach Experience the perfect blend of comfort, convenience, and coastal charm at the Hilton Garden Inn Cape Canaveral. Our brand-new hotel features 156 spacious, modern guest rooms and welcomes all travelers. Planning an event? Our 775-square-foot meeting room is ideal for gatherings, and our professional culinary team is ready to make... Add to Trip Add to Wishlist Homewood Suites by Hilton Viera Melbourne Brand‑new, 4‑story, all-suite hotel with 131 spacious suites providing separate living and sleeping areas—ideal for families, business travelers, and extended stays. Nestled off Interstate 95 in the vibrant Viera/Borrows West district, it offers convenient access to the USSSA Space Coast Sports Complex, Brevard Zoo, The Avenue Viera shopping & dining, and... Add to Trip Add to Wishlist Springhill Suites by Marriott West Melbourne Palm Bay Kick back and feel your worries melt away as you settle in for a rewarding stay at SpringHill Suites West Melbourne. Our spacious hotel suites and vibrant spaces are perfect for working, playing or relaxing. Take the stress out of travel with perks like free WiFi, outdoor pool and a... Add to Trip Add to Wishlist Fairfield Inn & Suites Melbourne West/Palm Bay Get comfortable at Fairfield Inn and Suites Melbourne West Palm Bay. Our Melbourne Florida hotel has everything you need to recharge on the road. Refresh in our suites with signature plush Marriott bedding, ergonomic workspaces, and free WiFi. Start your morning with selections from our complimentary breakfast served daily. Maintain... Add to Trip Add to Wishlist Hyatt Place Cape Canaveral Explore the Space Coast from our modern rooms at Hyatt Place Cape Canaveral, from rooftop views of live rocket launches from Kennedy Space Center and the Cape Canaveral Space Force Station. Relax at our outdoor pool, enjoy a meal at The Placery or grab to-go snacks at The Market after... Add to Trip Add to Wishlist Comfort Suites Titusville Near Kennedy Space Center Exciting news! We’ve just launched the brand new Comfort Suites Titusville near Kennedy Space Center, offering the perfect blend of comfort, convenience, and value for your next business trip to the heart of Florida’s Space Coast. Stay in Style, Work with Ease: Spacious guest rooms featuring plush bedding, flat-screen TVs... Add to Trip Add to Wishlist Hotel Melby Hotel Melby celebrates the raw and the refined, where artistry dances with science and the process of discovery itself is on display. From evocative artworks and cultural diversity to alluring explorations of space and time – Hotel Melby stands as a doorway to the vibrant and distinctive essence of Melbourne.... Add to Trip Add to Wishlist Element Melbourne Oceanfront Inspired by Westin Hotels & Resorts, the Element Melbourne Oceanfront believes in providing travelers, whether on the road for work or leisure, not just a great place to stay, but a place to stay connected, feel alive, balanced and maintain their rituals and lifestyles. With stunning views of the Atlantic... Add to Trip Add to Wishlist Comfort Inn & Suites Melbourne-Viera We are family owned/operated hotel since 2007 . We treat our guests like family and offer both King and Double Room types. We offer free amenities such a fully hot breakfast, swimming pool and laundry facilities. We love to host families, sports teams, business travels and leisure guest. Add to Trip Add to Wishlist Holiday Inn Express Cape Canaveral Holiday Inn Express Cape Canaveral is ideally located next to Terminal 3 at Port Canaveral and the Jetty Park Beach & Pier. We are just minutes from a variety of restaurants, shopping destinations, and popular attractions like the Kennedy Space Center Visitor Complex. As the first choice for the increasing... Add to Trip Add to Wishlist Seascape Motels Modern amenities meet Old Florida style in this hidden oceanfront treasure — with southern charm and hospitality! Quaint and affordable, the Sea Scape has character. We take pride in our cleanliness, service and repeat business. Every day is perfect at the Sea Scape Motel & Apartments. You’ll awake to magnificent... Add to Trip Add to Wishlist Americas Best Value Inn Satellite Beach Melbourne Come and enjoy an out-of-this-world atmosphere at the America’s Best Value Inn Satellite Beach. A short walk from the beach, this pet friendly hotel is conveniently located less than 15 minutes from the Melbourne Orlando International Airport and less than 16 miles from Port Canaveral. America’s Best Value Inn Satellite Beach invites you... Add to Trip Add to Wishlist TownePlace Suites by Marriott – Cape Canaveral / Cocoa Beach Designed for longer stays, our property features fully equipped kitchens, lobby bar, poolside beverage service with covered seating. Hydro-stations throughout the hotel. 24-hr fitness and business center. Meeting space to accommodate groups up to 30. Balconies in select suites offering fantastic views of port, rocket launches and the Banana River. Add to Trip Add to Wishlist The Pineapple Estate EGAD A Beautiful Private Estate Vacation home nestled in the wonderful Eau Gallie Arts District. The Estate Sleeps 22, has direct river access, minutes to the Atlantic Ocean and boasts the best distant, unobstructed views of the Florida Sunrises, Sunsets and Rocket Launches. Walking distance to Restaurants, shopping, night life venues... Add to Trip Add to Wishlist Hola! Cuban Kitchen Experience the vibrant flavors of Cuba at Hola! Cuban Kitchen, a casual fine dining destination where authenticity meets elegance. Savor traditional Cuban favorites like ropa vieja, picadillo, and palomilla steak, as well as house specialties like our signature Paella—all crafted with our unique Cuban flair. Enjoy hand-crafted cocktails including refreshing... Add to Trip Add to Wishlist Cuba Bistro At Cuba Bistro, we bring the heart of Cuba to every cup of coffee, plate of food and freshly baked pastelito. Family-owned and proudly rooted in tradition, we serve up flavors that feel like home. Stop by for a Cafecito and stay for the love. Add to Trip Add to Wishlist Pacha Kava Lounge Pacha Kava Lounge in Rockledge, FL, is a unique, family-friendly kava bar and social hub known for its enchanting, whimsical decor, diverse menu of house-made kava and herbal teas, and commitment to community with regular events like Bingo and open mic nights. Patrons praise the welcoming atmosphere, knowledgeable and friendly... Add to Trip Add to Wishlist Zero Gravity Wine Bar More than just a wine bar, Zero Gravity Wine Bar offers a tasting experience for everyone, whether you’re just getting started or already love wine. You don’t need to be an expert here. Our founders are passionate wine lovers who believe tasting should be fun, relaxed, and open to all.... Add to Trip Add to Wishlist Forgotten Block Butcher and Market Nestled in the heart of Historic Cocoa Village, Forgotten Block is the Space Coast’s neighborhood butcher and market with a passion for sustainability, quality, and community. We specialize in locally sourced meats, house-made charcuterie, artisanal deli offerings, and provisions. From dry-aged beef, charcuterie, and handcrafted sausages to our tallow-based soaps... Add to Trip Add to Wishlist J. Bird’s Island Eatery Nestled just steps from Port Canaveral and the Kennedy Space Center, J. Bird’s Island Eatery serves up good vibes from sunrise to tiki time. Whether you’re fueling up before a cruise, taking a midday poolside break, or winding down after a space center visit, J. Bird’s is your tropical nest.... Add to Trip Add to Wishlist Aves’ Place Located in the heart of Brevard County, Aves’ Place is a destination for families across the Space Coast, offering a variety of freshly made lunch options, hand-scooped ice cream, treats and fresh bakery items and is home to Treasures Boutique, an upscale resale boutique featuring clothing, furniture and more. A... Add to Trip Add to Wishlist Ice Cream Hut Cocoa Beach North Best Ice Cream Around! Delicious Soft Serve and Over 40 Flavors Of Creamy Hard Dipped Ice Cream, Along With Dairy Free and Sugar Free Options. Home of The Xtreme Milkshake! Add to Trip Add to Wishlist Ice Cream Hut Cocoa Beach South Best Ice Cream Around! Delicious Soft Serve and Over 40 Flavors Of Creamy Hard Dipped Ice Cream, Along With Dairy Free and Sugar Free Options. Home of The Xtreme Milkshake! Add to Trip Add to Wishlist Toasty Coconut Toasty Coconut is Merritt Island’s Newest stop for quick, Savory Bites, Boba, Coffee, and BLUE BELL ICE CREAM! Add to Trip Add to Wishlist Ice Cream Hut Merritt Island Located just minutes from the beach, The Ice Cream Hut of Merritt Island is your go-to destination for handcrafted ice cream, nostalgic treats, and unforgettable family fun. We offer an exciting variety of premium flavors, dairy-free options, and signature items like cookie sandwiches, waffle tacos, and banana split boats—all made... Add to Trip Add to Wishlist Evo Catering, LLC “EVO”lving with the way you eat with our dine in or take out restaurant, custom off-site catering and our meal prep service that allows you to have a taste of home or to try something exotic without needing a kitchen or sink. The restaurant has daily specials with great food... Add to Trip Add to Wishlist Kabob-a-licious Escape to Kabob-a-licious, your delicious getaway just steps from Cocoa Beach! Savor the taste of homemade Mediterranean and Latin cuisine with vibrant flavors that will transport you. Indulge in mouthwatering kabobs, savory empanadas, flavorful shawarma, authentic Cuban sandwiches, and refreshing shave ice. Every dish is crafted from scratch, offering a... Add to Trip Add to Wishlist 2 georges oceanside bar & grill 2georges oceanside bar & grill (formerly Sage Bistro) was purchased by Jeff and Jeannine George in August 2023. The married couple have an extensive background in the Food and Beverage Industry along with Hospitality, Marketing and Social Media. 2georges oceanside bar & grill was part of the rebranding which reflects... Add to Trip Add to Wishlist Humpavelli’s Pizza Family-owned since 2013 to serve you the best food with the always freshest ingredients. We pride ourselves on having the friendliest customer service around as we make your food to order in an open kitchen to show you what we’re all about. We make everything in-house every morning to continuously... Add to Trip Add to Wishlist Southern Kingfish Nationals The Southern Kingfish Association (SKA) will be hosting its SKA Nationals Kingfish Championships November 19 – 22, 2025 in Port Canaveral, Florida. The SKA Nationals will feature elite teams from across the Southeast and Gulf competing for the coveted SKA Nationals Championship. The event is free and open to the... Add to Trip Add to Wishlist Rock & Roll Revue: Autumn Boogie It’s Autumn? Maybe somewhere else but it’s late summer here. We have a fab lineup of the dance music that you love – from the fabulous 12-piece Rock & Roll Revue. $15.00 Add to Trip Add to Wishlist Autumn Market Join us for the Nancy Higgs Community Center’s Autumn Market! This event will take place on two separate days, so if you miss the first one, don’t be discouraged! When: October 7 and November 4 Come enjoy food trucks, fresh baked goods, local produce, and crafts made by local artisans.... Add to Trip Add to Wishlist Creatures Fest Join us at the Barrier Island Center for a free, fun, family event to celebrate animal diversity, ecology and conservation with a Halloween theme. Enjoy critteriffic games, touch tank, live animal encounters, conservation booths, scavenger hunt, eco-arts and crafts, black light not-so-scary experience, food truck, and more! Costumes encouraged and... Add to Trip Add to Wishlist St. Vincent de Paul Friends of the Poor 5K Run Walk Cocoa Beach 2nd Annual Friends of the Poor 5K Run Walk – fun for all ages. To raise awareness of the needs of our local neighbors who are working poor, homeless, disabled and veterans in the Cocoa Beach – Cape Canaveral Community. Race starts at 8:00 am. Same day registration starting at... Add to Trip Add to Wishlist Harvest Festival Harvest Fest at The Enchanted Forest is BACK! Dress up in costume or your favorite fall clothes and enjoy a day full of family fun! Dive into exciting games, hands-on crafts, and delicious bites from local food trucks. Get creative with pumpkin painting and scarecrow making. Explore the creepy-crawly building... Add to Trip Add to Wishlist 11th Annual Kidtoberfest Brevard County Parks and Recreation is proud to present Tim Burton’s The Nightmare Before Christmas at the FREE Cars Under the Stars Movie in the Park happening in Wickham Park! Audio will be available through car stereo and external speakers . The movie will begin once the sun goes down.... Add to Trip Add to Wishlist 4th Friday Starry Nights Join Brevard parks and Recreation Department and the Max K. Rodes Community Center for an artisan market under the stars! Meet talented local artisans and find one-of-a-kind gifts. Enjoy live D.J. music and peruse food from a variety of local onsite food trucks. Add to Trip Add to Wishlist 14th Annual North Brevard Fall festival and Trunk-or-Treat Join Brevard Parks and Recreation for the 14th Annual North Brevard Fall Festival and Trunk-or-Treat! This exciting three-hour event is the ultimate way to celebrate the season! Come dressed in your best costume and connect with local groups and organizations while diving into all our thrilling activities. Don’t miss out... Add to Trip Add to Wishlist Haunted Trail at Rotary Park October 17 & 18, 24 & 25 (Fridays and Saturdays) Cost: $5 for ages 12 & under | $10 for ages 13 & up Get ready for a frightful night filled with thrills and chills! Explore multiple scare zones packed with eerie creatures, jump scares, and bone-chilling surprises around every... Add to Trip Add to Wishlist Free Concert Featuring The Bella Donna Project Join the Brevard Parks and Recreation Department and experience the greatest hits of Stevie Nicks with a live music performance by the Bella Donna Project! Feel free to bring lawn chairs or peruse a variety of local on site food trucks during the show. Add to Trip Add to Wishlist Cocoa Village Sidewalk Sale “Leave it to Bargains” at the Cocoa Village Sidewalk Sale! Cocoa Village boutiques, art galleries, jewelry stores, and consignment shops are bringing their sale racks to the sidewalks at this yard-sale-style shopping event! Pick up a map at one of 3 starting locations: Bobbi’s at Parkside, Lucia Jewelry, or Village... Add to Trip Add to Wishlist North Brevard Art League Holiday Artisan Market The North Brevard Art League will hold a Holiday Artisan Market on Saturday and Sunday, November 1st and 2nd, 2025 from 10 am – 3 pm. The Market will be held in the NBAL Studio located at 1421 Draa Rd., Titusville, FL. Admission and parking are free. The show will... Add to Trip Add to Wishlist Sensory Boo at the Zoo Families of children with exceptionalities are invited to enjoy a magical evening of trick-or-treating, games, sensory exploration and more as you stroll through the Brevard Zoo’s Paws On area. As a come and go event, timed entry tickets are available. Costumes Encouraged! Members: $2 Non-members: $6 Add to Trip Add to Wishlist Cocoa Village Haunted History Tour Join us for the Opening Night of the Cocoa Village Haunted History Tour on September 20th at 8:00 PM—an adults-only experience that dares you to step into the shadows of one of Florida’s most historic towns. Led by our expert guide Zach, a seasoned performer with decades of acting and... Add to Trip Things to Do The Space Coast Bucket List Experience the thrill of a rocket launch, catch a wave and much more, discover the top things you NEED to do when you visit the Space Coast. View Article Stay Connected Don’t miss out on our monthly newsletter for exciting updates on attractions, local events, and personalized itineraries. Name (Required) First Last Zipcode (Required) ZIP / Postal Code Email (Required) Comments This field is for validation purposes and should be left unchanged. Subscribe Vacation Planner Dive into the Space Coast Vacation Planner then launch into an unforgettable getaway. View Digital Planner About Contact Us Visitor Center Press Room Travel Professionals Sports Commission Film Commission Submit Your Business Submit an Event Events Calendar Follow Us on Social Media facebook-f instagram youtube pinterest-p Vacation Planner Privacy Policy © 2025 Copyright Florida’s Space Coast Office of Tourism All Rights Reserved"
    },
    {
      "url": "https://store.aphf.org",
      "text": ""
    }
  ]
}