{
  "fuentes": [
    {
      "url": "https://theapopkavoice.com/stories/spring-summer-are-about-to-get-super-cool-apopkas-splash-pad-reopens-saturday-spots-for-summer,2417",
      "email": "cray@apopka.net"
    },
    {
      "url": "https://theapopkavoice.com/stories/spring-summer-are-about-to-get-super-cool-apopkas-splash-pad-reopens-saturday-spots-for-summer,2417",
      "email": "editor@theapopkavoice.com"
    },
    {
      "url": "https://theapopkavoice.com/stories/spring-summer-are-about-to-get-super-cool-apopkas-splash-pad-reopens-saturday-spots-for-summer,2417",
      "email": "info@theapopkavoice.com"
    },
    {
      "url": "https://theapopkavoice.com/about-us/index.html",
      "email": "denise@theapopkavoice.com"
    },
    {
      "url": "https://theapopkavoice.com/about-us/index.html",
      "email": "editor@theapopkavoice.com"
    },
    {
      "url": "https://theapopkavoice.com/about-us/index.html",
      "email": "info@theapopkavoice.com"
    },
    {
      "url": "https://theapopkavoice.com/about-us/index.html",
      "email": "reggieconnell@theapopkavoice.com"
    },
    {
      "url": "https://www.apopka.gov/facilities/facility/details/Northwest-Recreation-Complex-1",
      "email": "athletics@apopka.net"
    },
    {
      "url": "https://www.splashtop.com/about/leadership",
      "email": "flags@2x-140042eba8c90ae1cede87fe8fcb27f0.png"
    },
    {
      "url": "https://www.accessories4less.com/make-a-store/static/contactus/1.html",
      "email": "sales@accessories4less.com"
    },
    {
      "url": "https://www.apopka.gov/165/Youth",
      "email": "events@apopka.net"
    }
  ],
  "mails": [
    "athletics@apopka.net",
    "cray@apopka.net",
    "denise@theapopkavoice.com",
    "editor@theapopkavoice.com",
    "events@apopka.net",
    "flags@2x-140042eba8c90ae1cede87fe8fcb27f0.png",
    "info@theapopkavoice.com",
    "reggieconnell@theapopkavoice.com",
    "sales@accessories4less.com"
  ],
  "nombre_sitio": "apopka.gov",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://theapopkavoice.com/stories/spring-summer-are-about-to-get-super-cool-apopkas-splash-pad-reopens-saturday-spots-for-summer,2417",
      "text": "Spring & Summer are about to get super cool: Apopka's Splash Pad reopens Saturday; spots for Summer Camp still available - The Apopka Voice Thu., Sep. 11, 2025 | Clear, 77° F | About us | Advertise with us X Bluesky Log in Subscribe to our newsletter Honoring Courage and Sacrifice: Apopka’s 9/11 Memorial Ceremony Toggle navigation Main menu News Business Food Real Estate Food Real Estate Health COVID-19 Fitness COVID-19 Fitness Government Apopka County Sheriff Fire (AFD) Florida Orange County Police (APD) Apopka County Sheriff Fire (AFD) Florida Orange County Police (APD) Education Apopka High School Wekiva High School Other school news Apopka High School Wekiva High School Other school news Opinion Politics Inspiration Apopka Shares Submit News Apopka Shares Submit News Calendar Extras Entertainment Environment Weather forecast Weather news History Home & Family Parenting Sports Technology Entertainment Environment Weather forecast Weather news History Home & Family Parenting Sports Technology Classifieds Bonus Content Agriculture Automotive Books Business Education & Careers Entertainment Food Gardening Green Living Health Home Improvement Kids & Family Lifestyle Money Matters Outdoors Pets Real Estate Seniors Spanish Technology Travel Trivia & Games Log in Spring & Summer are about to get super cool: Apopka's Splash Pad reopens Saturday; spots for Summer Camp still available Apopka's Splash Pad - PT/Seasonal opening for Splash Pad Attendant Posted Thursday, April 8, 2021 11:01 pm From the City of Apopka Things are looking up for kids and families in Apopka, with the popular City Splash Pad at Kit Land Nelson Park reopening Saturday, and small group Summer Camp options still available for June and July. The City Splash Pad at Kit Land Nelson Park With the heat already sizzling, the Splash Pad's reopening comes just in time. Filled with an array of super fun super soakers, sprayers and spouts, kids big and small will not want to leave. The Splash Pad will be available on weekends only from April 10 until May 23, 2021, with hours from 9:30am to 5pm. Then the summer fun kicks in! Summer hours begin May 26 and run through August 8, with hours Tuesdays through Sundays from 9:30am to 5pm. Once school is about to begin, the hours return to weekends only , with August 14 through September 26 being the last hurrah of the Splash Pad season, with hours from 9:30am to 5pm. The Splash Pad will be closed on Mondays for maintenance/private rentals. Here's a little peek at what awaits you: Mega Soaker: Large bucket that drops 40 gallons of water at a time. Sneaky Soaker: Small splash buckets mounted on tall poles with a water shower head. Splash Blasters: Small Water Cannons Fun-Guy: Mushroom-shaped sprayer for toddlers Fun-Brella: Creates a curtain of water Spray Tunnel: Sprays water from a series of ground spouts The Splash Pad is also available for private rentals from 5 PM to 7 PM (after public hours), or through the summer on Monday's during the day. Rental rates are as follows: Residents: $150 plus tax Non-Residents: $200 plus tax Non-Profit: $140 (No tax with tax exempt certificate) The maximum capacity for the Splash Pad is 40 persons. Contact the City of Apopka at 407-703-1742 for more information or to make private rental reservations. City of Apopka Summer Camps The City of Apopka is keeping their online registration open until all the spots are filled for their Summer Camps. This year they have plans for kids to enjoy a wet and wonderful Florida Summer! Whether cooking, playing a game of kickball, or creating a beautiful craft your child is sure to have fun! While they do spend time inside each day, this is an active outdoor-based camp. Personal electronics (including cell phones) are discouraged. Camp at the Fran Carlton Center Monday through Friday June 1 through July 30, 2021 7:30 AM to 5:30 PM at the Fran Carlton Center (11 N. Forest Avenue, Apopka, FL) There will be no camp on July 5, 2021 in observance of Independence Day. For questions please contact Carolyn Ray at CRay@apopka.net . Camp Ages Camp is for children currently in 1st - 5th grade (must have completed Kindergarten and entering First grade through Fifth grade in the Fall). Camp Fee Residents: $80 per week ($64 on Week 1 and 6) Non-Residents: $100 ($80 on Week 1 and 6) No field trips will take place during Summer Camp 2021 Registration Online ONLY. Registration will begin on April 5, 2021 at 8 AM and will continue until all spots are filled. Online registration ONLY . Camp at the Billie Dean Community Center at Alonzo Williams Park Monday through Friday June 1 to July 30, 2021 7:30 AM to 5:30 PM Cost: $25 at the Billie Dean Community Center at Alonzo Williams Park (225 M A Board Street, Apopka, FL) There will be no camp on July 5, 2021 in observance of Independence Day. Minimum of 5 participants and Maximum of 20 participants. For questions please contact Carolyn Ray at CRay@apopka.net . Online Registration Instructions Please visit the City’s Recreation website to register for camps under the Youth Activities tab. Online registration ONLY . Login in to your account, new families must create a NEW family profile in CivicRec . Returning families, please use your same family profile from last year & the same account login. After you have logged in or created your family profile, enroll for all the weeks that you need. Payment is required for the first week. Registration Assistance For assistance with the online registration process, please call (407) 703-1642 Health and Safety Information To ensure a safe environment for campers and staff, the City of Apopka will continue to follow Centers for Disease Control and Florida Department of Children and Families recommendations and regulations, which includes limiting the capacity of our summer camps. To accommodate social distancing requirements children will be in groups of no more than 10 assigned to a camp counselor. Total camp enrollment will not exceed 60 campers each week. Camp groups will remain separate throughout the day. Face masks required daily. Staff and campers will be screened with a contact less thermometer before they enter the facility each day. Staff will disinfect common areas and frequently touched surfaces throughout the day.  At the end of each day, staff will deep clean all areas in preparation for the following day. Additional Information Lunch will be provided each day by the Orange County lunch program. You may also pack a lunch from home or snack if you choose to. Kona Ice will visit the camp on Mondays, additional fee applies, please send you child with $3-$5 for Kona Ice. For additional information please call 407-703-1642. Keywords Activities, City of Apopka, entertainment, Family, kids, Kit Land Nelson Park, Outdoors, Private Party, Registration, Rentals, Splash Pad, Summer Camp Comments No  comments on this item Please log in to comment by clicking here Other items that may interest you Arts Investment and Community Impact: Orange  … Orange County seeks artists for project at  … Calling all artists for the 2025 Hispanic Heritage  … Experience culture like never before with Open Scene,  … Matthew's Hope Ministries Facebook Page Facebook Read more Thank you for Signing Up Join Our FREE Newsletter Please complete this form to create an account, receive email updates and much more. Contact Email * First Name Last Name *Required Fields Note: It is our responsibility to protect your privacy and we guarantee that your data will be completely confidential. Calendar of events Thu 11 9-11 Memorial Ceremony The Apopka Fire Department and Apopka Police  … Sat 13 Cookies and Milk with a Cop Storytime with Apopka  … Storytime, arts and crafts, and cookies with a  … Mon 15 CANCELLED: Clear Lake Estates Workshop at 6 PM This meeting has been CANCELLED. Wed 17 2025/2026 Final Budget Hearing The City of Apopka's 2025/2026 Final Budget  … Wed 17 Apopka City Council Meeting - September 17 The Apopka City Council Meeting is scheduled for  … Sat 20 4th Annual Hispanic Heritage Celebration in  … The City of Apopka invites you to celebrate  … Thu 11 Fri 12 Sat 13 Sun 14 Mon 15 Browse full calendar Post an event Sections News Business Health Government Education Opinion Politics Inspiration Calendar Extras Classifieds Services About us Advertise Newsletter signup Connect with us 407-415-6218 info@theapopkavoice.com X Bluesky © Copyright 2025 The Apopka Voice | Terms of Use Powered by Creative Circle Media Solutions"
    },
    {
      "url": "https://theapopkavoice.com/about-us/index.html",
      "text": "About Us - The Apopka Voice Thu., Sep. 11, 2025 | Clear, 77° F | About us | Advertise with us X Bluesky Log in Subscribe to our newsletter Honoring Courage and Sacrifice: Apopka’s 9/11 Memorial Ceremony Toggle navigation Main menu News Business Food Real Estate Food Real Estate Health COVID-19 Fitness COVID-19 Fitness Government Apopka County Sheriff Fire (AFD) Florida Orange County Police (APD) Apopka County Sheriff Fire (AFD) Florida Orange County Police (APD) Education Apopka High School Wekiva High School Other school news Apopka High School Wekiva High School Other school news Opinion Politics Inspiration Apopka Shares Submit News Apopka Shares Submit News Calendar Extras Entertainment Environment Weather forecast Weather news History Home & Family Parenting Sports Technology Entertainment Environment Weather forecast Weather news History Home & Family Parenting Sports Technology Classifieds Bonus Content Agriculture Automotive Books Business Education & Careers Entertainment Food Gardening Green Living Health Home Improvement Kids & Family Lifestyle Money Matters Outdoors Pets Real Estate Seniors Spanish Technology Travel Trivia & Games Log in MISSION & VALUES The mission of The Apopka Voice is to engage with relevancy, inform with integrity, and inspire greater good at all levels of the community. We uphold the key values of honesty and transparency, seeking to shine a compassionate light on social justice issues, sharing opportunities for residents to connect and make a difference, and opening avenues for deeper dialogue, solution-finding and action-taking. We see our site and mission as a “work in progress”, pursuing improvement and growth through learning, risk-taking, listening and engaging, with the hope to become more effective and expand our reach and positive impact in the world. While publishing articles largely focused on local news, we also cover a wide range of topics including business, education, real estate, environment and more. In addition, we also cover relevant county and statewide news that impacts Apopka residents, keeping the community informed on topics not always covered by other news outlets. Click here for our full Content and Advertising Policy and Practice , or scroll to bottom of page for details. TEAM Denise Connell, Publisher & Owner, holds a BA in Interpersonal Communication from the University of Central Florida and an MA in Religious Studies from La Sierra University in California, and has served the Central Florida community since 1992 through organizational leadership, teaching, writing, motivational speaking and coaching. She has led businesses and non-profits, and guided teams and individuals in finding vision and direction that brings more joy, meaning and purpose for their organization, them personally, and for those they serve. Inspiring change and action for difference-making kind of living is her focus and what she hopes to bring through The Apopka Voice. Whether through the issues explored, content published, or through the mentoring of  journalism/communications students, she is committed to furthering a more informed and engaged community that will grow stronger and better with each passing year. You can reach Denise at denise@theapopkavoice.com , or (407) 415-6218. Reggie Connell, Managing Editor & Owner, started his journalism career in 1981 with the St. Pete Times 'working the desk' as well as writing for the sports department. He attended the University of Florida and served as a journalist on two of the student newspapers, The Independent Florida Alligator and The Student Leader . Having won awards for his writing and editing, and with additional business-focused years in insurance and mortgage sales, Reggie soon bought and ran City Magazine in Altamonte Springs, serving as publisher and managing editor there, while also writing and publishing his first book in 2014, Falconland , an historical novel on the life of the 13th century King Frederick. While working on the sequel to Falconland , Reggie took on the managing editor role for The Apopka Voice in 2015, and just two years later became its owner. Serving as the managing editor through to today, Reggie's love for contributing to Apopka's growth via  honest, ethical and quality journalism, as well as mentoring of journalism students, continues strong. You can reach Reggie at reggieconnell@theapopkavoice.com, or (407) 437-5654. Ashley Connell, Marketing & Sales, was born and raised in Central Florida before attending Bennington College in Vermont. She has worked in a variety of industries, from theatre and non-profit development to commercial real estate, tech, and employee engagement. She believes that dedicated local journalism is the best path to stronger communities and civic engagement and she is excited to bring her experience in B2B sales to help the businesses of Apopka connect with their community. You can reach Ashley to explore advertising options or request a media kit by contacting her at info@theapopkavoice.com, or on her cell: (386) 314-4963. Interning Correspondents : We partner with local college and university internship programs to provide students with real-world experience, mentoring, and opportunities for publishing and building their portfolios. Typically our interns are studying journalism, communications, digital media, and / or business, and are either enrolled in studies or recently graduated. We have had the joy of working with interns from Full Sail University, Seminole Community College, University of Central Florida, and Valencia Community College. Occasionally we also take on high school interns who are especially recommended and qualified. Please welcome our 2025 interns : Maia Feasel - Rollins College - Public Relations & Marketing Roger Jimenez - University of Central Florida - English, Journalism focus Isabel LeCompte - University of Central Florida - Photography Emma Longwell - University of Central Florida - Journalism Lee Marshall - University of Central Florida - Computer Science, SEO / Domain Authority focus Esteban Suarez -  University of Central Florida - Political Science, History focus Katherine Whalen - Florida Southern College - Public Relations & Marketing Previous Interns Keily Alfonzo - University of Central Florida - Journalism Jake Bell - University of Central Florida - Journalism Rob Clark - Rollins College, Masters Program - Strategic Communications Katelyn Colley - University of Central Florida - Journalism Mickenzie Hannon - Valencia & University of Florida - Journalism Matthew Hughes - University of Central Florida - Journalism Crystal Jacome - Full Sail University - Broadcasting & Videography Macy Garcia - University of Central Florida - Communications & Media Studies/PR Alisha Garner - University of Central Florida - Research & Writing Kayley Hayden - Graduate of University of Central Florida - Photography Estefania Lazaro - Full Sail University - Marketing Nathaniel Marrero - Valencia Community College & UCF - Journalism Adeen  McKenzie Kennedy - University of Central Florida - Creative Writing Ava Niemeyer - Forest Lake Academy - Journalism Allison Petro-Williams - University of Central Florida - Journalism Tristan Robinson - University of Central Florida - Creative Writing & Journalism Yasmene Warren - University of Central Florida - Journalism Kiara Velez - University of Central Florida - Journalism HISTORY Originally The Apopka Voice launched in December 2015 by local resident and business leader Dale Fenwick, who had the vision for building a local, independent, online news site dedicated to telling the story of life in Apopka, Florida. In May 2017, Fenwick sold The Apopka Voice to then managing editor, Reggie Connell, who continued with the vision, while adding Orange County and relevant statewide news that impacts Apopka residents. In February 2020, Denise (Badger) Connell joined the team officially as publisher, and in April that same year The Apopka Voice became a dba under Connell Publishing, LLC , continuing the vision not only for Apopka, but also with plans to expand to other cities who are missing out on having their story told through hyper-local, quality journalism. INVITATION Delivering worthwhile local news and accurate reporting is truly a community-wide effort. It takes a dedicated staff and a loyal readership working together to make it happen. We hope you will give The Apopka Voice a good look, and then join us as a partner in transforming the way news is delivered and acted upon. Your engagement and participation with us says you believe that supporting trustworthy, independent, and difference-making local news means a better community for all. We invite you to share your thoughts and concerns, ideas and celebrations, questions and solutions with us through your comments, advertising, community participation, and support. We, in turn, hope to make you proud to have us as a main source for keeping you informed, engaged and inspired, connecting you more with the community we all love. QUESTIONS & SUGGESTIONS Questions about our news site or advertising? Suggestions or ideas? Feel free to email or call us. We’d love to connect: info@theapopkavoice.com . The Apopka Voice is a dba of Connell Publishing, LLC. CONTENT and ADVERTISING POLICY and PRACTICE Content and Advertising Policy and Practice for Connell Publishing, LLC, and for all websites associated with us. We are committed to providing accurate, balanced, and thoughtful coverage of news and events. Our goal is to engage, inform, educate, and inspire our audience with trustworthy content. This content policy outlines the standards and principles that guide our editorial decisions and ensure our commitment to fairness, non-partisan politics, and content that maintains respect and tastefulness. Commitment to Fairness We strive to present news and information in an unbiased and objective manner. Our editorial team works to ensure all sides of an issue are represented fairly, providing context and insight into different perspectives. We do not favor any political party, ideology, or special interest group, and we make a concerted effort to avoid promoting any agenda. Our reporting includes both sides of an issue whenever possible, allowing our readers to make informed decisions. Non-Partisan Politics We do not align with any political party or movement. Our goal is to inform our audience with facts, not to push a political agenda. Our news stories, commentary, and opinion pieces are designed to offer diverse viewpoints and perspectives. We maintain strict boundaries between our reporting and editorial content, ensuring that our news coverage remains free of partisan influence. Eliminating Bias We work to eliminate any potential biases from our news coverage by adhering to journalistic standards and practices. We remain vigilant against subtle forms of bias, such as selective omission, sensationalism, or the framing of issues to manipulate public opinion. We encourage a culture of transparency and correction, and any mistakes in our reporting will be openly acknowledged and corrected. Content in Good Taste We are committed to ensuring that all content published on our site adheres to a high standard of professionalism and respect. We do not publish content that includes hate speech, personal attacks, obscene, coarse or inflammatory language. All commentary and opinions should be expressed respectfully, even when engaging in passionate discourse. We respect the diversity of our audience and believe that differing opinions can be expressed in a manner that contributes to thoughtful discussion rather than division. Sensitivity to Diverse Audiences Our content is created with awareness of the diversity of our readers. We strive to avoid content that is discriminatory or harmful to any group based on race, gender, sexual orientation, religion, national origin, or any other characteristic. We are committed to fostering a respectful space where all readers feel welcomed and valued. Transparency and Accountability We are transparent about our sources, methods, and decision-making processes. If an article is based on opinion, analysis, or commentary, we will clearly label it as such. Our editorial team remains accountable to the public, and we welcome feedback or concerns about our coverage. Any conflicts of interest or affiliations are disclosed in an open and honest manner. Avoiding Conflicts of Interest: No Gifts or Event Sponsorships To maintain the integrity and independence of our reporting, we prohibit editorial staff, reporters, and contributors from accepting gifts, compensation, or favors from individuals or organizations that may have a vested interest in the stories we cover. This includes, but is not limited to, accepting invitations to paid events, meals, or entertainment as part of a news coverage or industry gathering, as well as event sponsorships. Our commitment to journalistic objectivity requires that our coverage be free from external influence, and we take necessary steps to ensure that no personal gain or undue advantage compromises our ability to report honestly. Invitations to events, such as press conferences, interviews, or product launches, will be considered only on their journalistic merit, and no individual within our organization will accept complimentary perks unless they are directly related to the work being done. Additionally, if any potential conflicts of interest arise from relationships, financial dealings, or affiliations that could influence coverage, we will disclose them clearly to maintain transparency with our audience. By adhering to this policy, we safeguard our editorial independence and prioritize delivering news that is unbiased, accurate, and in the best interest of our readers. Accuracy and Timeliness Our editorial team strives to provide timely and accurate reporting, ensuring that all information shared is current, reliable, and verified. We take the time to check our facts and sources carefully before publication, understanding that errors can undermine trust. If new information comes to light or a correction is necessary, we will promptly update or revise the content to reflect the most accurate version available. Respectful Discourse in Comments and Engagement We encourage respectful engagement in our comment sections and on social media platforms. While we support open discussion and debate, we prohibit the use of abusive language, trolling, personal attacks, and other forms of disruptive behavior. We strive to maintain an environment where healthy conversations can take place without fear of harassment or disrespect. Content Moderation and Removal We reserve the right to moderate or remove any content that violates this policy. Content that is deemed to promote violence, misinformation, defamation, or discrimination will be removed. We also reserve the right to suspend or block users who engage in harmful or abusive behavior on our site or associated platforms. Advertising, Sponsored Posts, and Links We are committed to maintaining a clear distinction between editorial content and advertising or sponsored materials. While we rely on advertising to support our operations, we uphold strict standards to ensure that advertising, sponsored posts, and links do not influence or compromise our editorial integrity. Advertising (banner ads, sponsored posts and links) No matter the format in which an advertisement appears on our site, we do not allow advertisers to dictate, alter, or influence the editorial direction of our coverage, and our editorial team will remain independent from commercial interests. All advertisements accepted on our site must adhere to the same content standards outlined in this policy. Sponsored Posts & Links We accept guest posts (including paid sponsored posts), as well as guest opinion pieces on a wide range of topics, including politics and religion, as well as product- and/or general-issue based content and links. The opinions expressed in sponsored and guest content are not to be necessarily understood as shared by our team, nor products and services endorsed by us simply because we have published / run it. We believe in providing a variety of viewpoints and opportunities, as well as encouraging the exploration and dialog that this content and the advertisements hopefully create for our readers. While we do accept guest and sponsored posts and sponsored links, we maintain editorial control over what is published and ensure that the content aligns with our values of fairness, respect, and accuracy. To the best of our ability, sponsored content will be relevant to our audience and will never be used to promote misleading or deceptive information. Sponsored Links We may occasionally include sponsored links within our content or on our site. Sponsored links will be used sparingly and only when they are deemed to be relevant and valuable to our audience, without compromising the journalistic integrity of the content. To the best of our ability, we will not accept sponsored links that lead to deceptive, misleading, or harmful sites. No Editorial Influence Our advertising and sponsored content/links policies are designed to ensure that there is no influence on our editorial decisions. All advertising and sponsored content/links are managed by separate teams from our editorial staff to preserve the independence and objectivity of our news coverage. Any content that is editorial in nature will be based solely on facts, research, and journalistic integrity, free from commercial pressure. By clearly distinguishing between advertising, sponsored posts/links, and editorial content, we aim to maintain transparency with our readers and uphold the trust that is essential to our work. We are committed to ensuring that advertising does not compromise the quality, impartiality, or reliability of our news coverage. 12. Editorial Independence Our editorial independence is central to our mission. We are not influenced by advertisers, sponsors, or any external interests when making editorial decisions. We are committed to maintaining a clear distinction between our news coverage and any commercial or promotional content. 13. AI-Use A. Transparency & Labeling Whenever AI tools are used to generate, draft, or assist with content—such as headlines, summaries, translations, or image generation—we will clearly disclose this in a brief note (e.g., “Partially drafted with AI assistance”). AI-generated content will never be published without editorial review and attribution when relevant. B. Fact-Checking & Editorial Oversight All AI-assisted text or imagery will be reviewed and edited by human editors before publication. We remain responsible for accuracy, context, and tone. Corrections will be issued promptly if errors occur. C. Avoidance of Misinformation & Fairness AI will not be used for investigative reporting or sensitive stories requiring human judgment. AI tools may assist research but never replace fact verification from trusted sources. D. Ethics & Privacy We will not use AI to create misleading images, voices, or deepfakes. We will not use AI to intentionally violate privacy laws or misappropriate likenesses of real people. E. Sponsored AI-Generated Content We request transparency and disclosure of any AI use in any sponsored content articles or advertorials. Sponsors must adhere to our editorial standards, even when using AI for drafting content. We will not allow AI-generated sponsored content to include deceptive claims or impersonate individuals. F. SEO & Automation AI tools may assist with search engine optimization (SEO) tasks, such as keyword suggestions, meta descriptions, and headline variations. SEO automation will never override editorial integrity —content will remain written for readers, not algorithms. We do not publish fully automated stories. Every piece of content will have a human editor’s review before going live. G. Internal Guidelines & Training Our staff will be trained on ethical AI use and its limitations. This policy will be reviewed regularly as technology and standards evolve. By adhering to these principles, Connell Publishing, LLC, and all websites under its umbrella, aims to foster a responsible, fair, and thoughtful news environment where our readers can engage with content that is informative, accurate, and reflective of diverse perspectives. We welcome your feedback and remain committed to evolving and improving the quality of our reporting in service of the public good. Matthew's Hope Ministries Facebook Page Facebook Read more Thank you for Signing Up Join Our FREE Newsletter Please complete this form to create an account, receive email updates and much more. Contact Email * First Name Last Name *Required Fields Note: It is our responsibility to protect your privacy and we guarantee that your data will be completely confidential. Calendar of events Thu 11 9-11 Memorial Ceremony The Apopka Fire Department and Apopka Police  … Sat 13 Cookies and Milk with a Cop Storytime with Apopka  … Storytime, arts and crafts, and cookies with a  … Mon 15 CANCELLED: Clear Lake Estates Workshop at 6 PM This meeting has been CANCELLED. Wed 17 2025/2026 Final Budget Hearing The City of Apopka's 2025/2026 Final Budget  … Wed 17 Apopka City Council Meeting - September 17 The Apopka City Council Meeting is scheduled for  … Sat 20 4th Annual Hispanic Heritage Celebration in  … The City of Apopka invites you to celebrate  … Thu 11 Fri 12 Sat 13 Sun 14 Mon 15 Browse full calendar Post an event Sections News Business Health Government Education Opinion Politics Inspiration Calendar Extras Classifieds Services About us Advertise Newsletter signup Connect with us 407-415-6218 info@theapopkavoice.com X Bluesky © Copyright 2025 The Apopka Voice | Terms of Use Powered by Creative Circle Media Solutions"
    },
    {
      "url": "https://www.apopka.gov/facilities/facility/details/Northwest-Recreation-Complex-1",
      "text": "Facilities • Northwest Recreation Complex Skip to Main Content Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In Search About Us Parks & Facilities Athletics Programs Events Home Facilities Get Directions Google Bing Northwest Recreation Complex 3710 Jason Dwelley Parkway Apopka, FL 32712 Contact 407-703-1784 Hours M - F 7:00 AM — 9:00 PM Sat 7:00 AM — 8:00 PM Sun 7:00 AM — 8:00 PM Other Holiday Hours: 8 AM to 6 PM Facilities Feature Overview View all facilities Northwest Recreation Complex Features Amphitheater Baseball / Softball Diamonds (12) Concession Stands Football Stadium Hard Tennis Courts (4) Multi-Purpose Fields (14) Outdoor Basketball Courts (3) Outdoor Gym sponsored by AdventHealth Pavilion Pavilions (4) Playgrounds (2) Sand Volleyball Courts (4) Walking Trail (.9 Miles) The Northwest Recreation Complex has over 180 acres of land including: The Apopka Amphitheater , Toddler and Youth Playgrounds, .9 Mile Walking Trail,  3 Basketball Courts, 14 Multi-Purpose Fields, 4 Pavilions, 4 Sand Volleyball Courts, 4 Tennis Courts, 12 Baseball / Softball Fields, and an Outdoor Gym sponsored by AdventHealth. Youth and Adult Programs The facility is home to the Apopka Pop Warner and Apopka Little League programs along with City run programs such as youth soccer and flag football, adult softball and adult kickball. The complex is used as the home for several organized teams and leagues for practices and games along with fields available for pick-up games to the general public. Amphitheater The complex is also home to the Apopka Amphitheater . The amphitheater has a seating capacity of 1,500 and lawn seating for as many as 5,000. Visit our events page to learn more. Amenities for Rent Various park amenities can be rented for private use. For more information on private rentals please contact the Parks and Recreation Department at 407-703-1784 or by emailing Athletics@apopka.net . Lightning Prediction System Please visit Lightning Tracker for Northwest Recreation Complex for active alerts. Subfacilities ► ▼ Apopka Amphitheater View Subfacility ▲ Back to top ATHLETICS Learn how to participate in a sport today CITY EVENTS Explore our lineup of Parks & Rec events CONTACT US Learn how to contact our staff PROGRAMS Learn about Adult, Senior, and Youth programming ONLINE REGISTRATION Register for our programs VISIT A PARK Learn about our parks and facilities. Contact Us 3710 Jason Dwelley Parkway Administration Office Apopka, FL 32712 Phone: 407-703-1784 Connect With Us Facebook X (Twitter) YouTube Instagram NextDoor LinkedIn /QuickLinks.aspx Site Links Home Site Map Contact Us Accessibility Privacy Policy /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.splashtop.com/about/leadership",
      "text": "Leadership Team & Board of Directors | Splashtop Inc. Skip to main content Products Solutions Pricing Resources Company Support Downloads Log in Language Back Free Trial +1.408.886.7177 Products Remote Access For individuals and small teams to access their work computers from any device, anywhere. Remote Support For IT pros to remotely support any device. Real-time patch management available as an add-on. On-Prem option available. Enterprise For enterprise-grade remote access and remote support with SSO and advanced manageability. On-Prem option available. Other Security Products Autonomous Endpoint Management Antivirus Endpoint Detection and Response Foxpass Wi-Fi Access & Control Zero Trust Secure Workspace All Products Solutions By Role Remote Work IT Support and Helpdesk Endpoint Management and Security MSPs OEM By Need Remote Desktop Vulnerability and Patch Management RDP/VPN Alternative VDI/DaaS Alternative On-Premises Deployment Remote Support for IoT Field Support Remote Access via RDP/SSH/VNC Remote Work with Wacom Remote Lab Access Endpoint Security Explore All Needs By Industry Education Media & Entertainment Healthcare Retail Government & Public Sector Architecture & Design Finance & Accounting Explore All Industries Pricing Resources Resources Blog Case Studies Competitor Comparison See All Resources Credentials Security Press Awards Company Company About Careers Events Contact Affiliates Partners Customers Support Support Technical Support System Status Downloads Downloads Current Customer Trial User New User SOS Assistance App Streamer Other Downloads Free Trial English Language English Deutsch Español Français Italiano Nederlands Português 简体中文 繁體中文 日本語 한국어 ภาษาไทย Bahasa Log in Free Trial +1.408.886.7177 Free Trial Leadership Executive Team Mark Lee Co-Founder and CEO As co-founder and CEO, Mark leads Splashtop’s efforts to delight customers with... Robert Ha Co-Founder and COO Robert serves as co-founder and COO of Splashtop, where he has helped build... Thomas Deng Co-Founder and EVP of Product Management Another co-founder of Splashtop, Thomas spearheads the company’s product... Philip Sheu Co-Founder and CTO Phil, as co-founder and CTO of Splashtop, drives the product and technology... Alexander Draaijer General Manager & Vice President Sales, Americas & EMEA Alex–the GM of Splashtop for Europe, the Middle East, and Africa (EMEA)–is in charge... Leonard Wong General Manager & Vice President Sales, Asia Pacific Leonard manages the strategic direction and execution of Splashtop’s indirect... Yoshiaki Mizuno General Manager & President Sales, Japan Yoshi started Splashtop Japan in 2011 and serves as its GM and Representative... Board Members Ryan Floyd Ryan is a founding Managing Director of Storm Ventures. He focuses on early stage... Jai Das Jai is a partner, president and co-founder at Sapphire Ventures. He invests in... Yael Zheng Yael Zheng joined the Splashtop board in 2021. She brings more than 20 years... Liat Ben-Zur Liat Ben-Zur joined the Splashtop board in 2024. She brings more than 27 years of experience... About About Leadership Events Careers Resources Contact Glossary Products Splashtop Remote Access Splashtop Remote Support Splashtop Enterprise Explore All Products Support Technical Support System Status Vulnerability Disclosure Get Streamer Contact Get Started Free Trial Downloads Pricing Get the latest Splashtop news Compliance Privacy Policy Terms of Use Copyright © 2025 Splashtop Inc. All rights reserved. All $ prices shown in USD."
    },
    {
      "url": "https://www.accessories4less.com/make-a-store/static/contactus/1.html",
      "text": "Contact Us | Accessories4less Skip to navigation Skip to the main content Skip to footer Checkout 0 items Search SPECIALS Welcome New User!  | Register | Sign In Back to top Skip to the main content Skip to footer Search form Search button Home Audio Receivers & AMP Home Theater Receivers 2 Channel Stereo Receivers Integrated Amps Preamps & Power Amps Packaged Systems Desktop Systems Audio Components CD & SACD Players Turntables Multi Zone Audio Remote Controls TV Mounts Power Protection Digital Audio Digital Audio Converters Network Players Headphones Over Ear Headphones Earbuds Headphone Amplifiers Extended Warranties Items Under $100 Items $100-$249 Items $250-$499 Items $500-$999 Items $1000-$1499 Items $1500-$1999 Items $2000-$2499 Items $2500-$3999 Items $4000-$4999 Multi Room Audio Bluetooth/Wireless Speakers Denon Heos Yamaha MusicCast Speakers Atmos Speakers Bluetooth/Wireless Speakers Bookshelf Speakers Car Audio Speakers Center Channel Speakers Floor-Standing Speakers In-Ceiling Speakers In-Wall Speakers On-Wall Speakers Outdoor Speakers Powered Stereo Speakers Speaker Packages Speaker Stands / Brackets Speaker Wire SoundBar Speakers Subwoofers Surround (rear) Speakers HDMI HDMI Cables HDMI to DVI Cables HDMI Extenders & Amps HDMI Splitters Cables Audio Cables Digital Optical Cables Digital Coaxial Cables Subwoofer Cables AC Power Cables Balanced Audio Cables Bulk Coaxial Bulk Speaker Wire Specials Package Deals Bargain Basement E-Gift Cards Specials Brands e-gift card E-Gift Cards Home › Contact Us Back to top Back to navigation Skip to footer Contact us Need assistance? Customer Care is ready to help. You may contact us by phone or online using the form below. Contact Information Accessories4less Main Office 2590 Clark Street Suite 3 Apopka FL 32703 800-657-0195 Returns*/Deliveries 2590 Clark St Suite 1 Apopka FL 32703 *Do not return items without first contacting customer support at: [email protected] Phone Support Our Customer Care representatives are available by phone: Monday - Friday 8:00 AM to 4:00 PM EST Closed Saturday & Sunday Our phone support number: 800-657-0195 Please complete the fields below. More specific information from you helps to ensure the fastest and most accurate response possible. Please do not include any sensitive information such as credit card numbers in the form below. Topic* Select a topic Account & Password Assistance Orders Delivery Returns/Exchanges Item Assistance Repairs & Parts General Questions First name* Last name* Email* Phone* Order number (if applicable) Questions or Comments* Submit Back to top Back to navigation Back to the main content Like us on Facebook Browse Categories Home Audio Home Video Speakers HDMI Cables Outlet Customer Service Register My Account My Wishlist Track my Order Return an Item Return Policy Company Contact Us About Us Privacy Policy Terms & Conditions Shop with Confidence Quick Contacts Sales Questions [email protected] Product Support [email protected] Call toll free (Mon-Fri 9am-5pm EST) 800-657-0195 Copyright © 2025 Accessories4less"
    },
    {
      "url": "https://www.apopka.gov/165/Youth",
      "text": "Youth | Apopka, FL Skip to Main Content Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In Search About Us Parks & Facilities Athletics Programs Events Youth Basketball League Youth Flag Football Youth Soccer Home Departments Parks & Recreation Athletics Youth Youth Youth and Teen Program Registration Registration is required for all youth and teen programs. Birth certificates may be required for new players. For current season registration dates and prices, please visit our Recreation Registration page or by contacting Athletics at 407-703-1784. 9 1 2 1 Youth Basketball League Apopka Recreation is proud to offer a co-ed youth basketball league. Link to page Youth Flag Football Flag football is offered to boys and girls ages 5 to 14. Link to page Youth Soccer This program is available in the fall and spring. Link to page Contact Us Parks & Recreation Department Email Events Physical Address View Map 3710 Jason Dwelley Parkway Administration Office Apopka , FL 32712 3710 Jason Dwelley Parkway Administration Office Apopka FL 32712 Directions Phone: 407-703-1784 Hours Monday through Friday 8 AM to 5 PM. Directory ATHLETICS Learn how to participate in a sport today CITY EVENTS Explore our lineup of Parks & Rec events CONTACT US Learn how to contact our staff PROGRAMS Learn about Adult, Senior, and Youth programming ONLINE REGISTRATION Register for our programs VISIT A PARK Learn about our parks and facilities. Contact Us 3710 Jason Dwelley Parkway Administration Office Apopka, FL 32712 Phone: 407-703-1784 Connect With Us Facebook X (Twitter) YouTube Instagram NextDoor LinkedIn /QuickLinks.aspx Site Links Home Site Map Contact Us Accessibility Privacy Policy /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    }
  ]
}