{
  "fuentes": [
    {
      "url": "https://www.wcax.com/about-us/meet-the-team/",
      "email": "cameron.smith@wcax.com"
    },
    {
      "url": "https://www.wcax.com/about-us/meet-the-team/",
      "email": "caresse.jackman@investigatetv.com"
    },
    {
      "url": "https://www.wcax.com/about-us/meet-the-team/",
      "email": "chris.nakamoto@investigatetv.com"
    },
    {
      "url": "https://www.wcax.com/about-us/meet-the-team/",
      "email": "claire.jones@wcax.com"
    },
    {
      "url": "https://www.wcax.com/about-us/meet-the-team/",
      "email": "heather.graf@gray.tv"
    },
    {
      "url": "https://www.wcax.com/about-us/meet-the-team/",
      "email": "jriepenhoff@raycommedia.com"
    },
    {
      "url": "https://www.wcax.com/about-us/meet-the-team/",
      "email": "laura.ullman@wcax.com"
    },
    {
      "url": "https://www.wcax.com/about-us/meet-the-team/",
      "email": "lucy.caile@wcax.com"
    },
    {
      "url": "https://www.wcax.com/about-us/meet-the-team/",
      "email": "peter.kvietkauskas@wcax.com"
    },
    {
      "url": "https://www.wcax.com/about-us/meet-the-team/",
      "email": "adam.sullivan@wcax.com"
    },
    {
      "url": "https://www.wcax.com/about-us/meet-the-team/",
      "email": "alek.lashomb@wcax.com"
    },
    {
      "url": "https://www.wcax.com/about-us/meet-the-team/",
      "email": "allison.black@wcax.com"
    },
    {
      "url": "https://www.wcax.com/about-us/meet-the-team/",
      "email": "amato@wcax.com"
    },
    {
      "url": "https://www.wcax.com/about-us/meet-the-team/",
      "email": "andy.pierrotti@gray.tv"
    },
    {
      "url": "https://www.wcax.com/about-us/meet-the-team/",
      "email": "anna.werner@investigatetv.com"
    },
    {
      "url": "https://www.wcax.com/about-us/meet-the-team/",
      "email": "brandon.wissbaum@graymedia.com"
    },
    {
      "url": "https://www.wcax.com/about-us/meet-the-team/",
      "email": "brendan.keefe@wanf.com"
    },
    {
      "url": "https://www.wcax.com/about-us/meet-the-team/",
      "email": "calvin.cutler@wcax.com"
    },
    {
      "url": "https://www.wcax.com/about-us/meet-the-team/",
      "email": "connor.ullathorne@wcax.com"
    },
    {
      "url": "https://www.wcax.com/about-us/meet-the-team/",
      "email": "daniela.molina@gray.tv"
    },
    {
      "url": "https://www.wcax.com/about-us/meet-the-team/",
      "email": "elissa.borden@wcax.com"
    },
    {
      "url": "https://www.wcax.com/about-us/meet-the-team/",
      "email": "emily.featherston@investigatetv.com"
    },
    {
      "url": "https://www.wcax.com/about-us/meet-the-team/",
      "email": "garrity@wcax.com"
    },
    {
      "url": "https://www.wcax.com/about-us/meet-the-team/",
      "email": "greg.phillips@investigatetv.com"
    },
    {
      "url": "https://www.wcax.com/about-us/meet-the-team/",
      "email": "gunnar.consol@wcax.com"
    },
    {
      "url": "https://www.wcax.com/about-us/meet-the-team/",
      "email": "isaac.bendavid@gray.tv"
    },
    {
      "url": "https://www.wcax.com/about-us/meet-the-team/",
      "email": "jack.fitzsimmons@wcax.com"
    },
    {
      "url": "https://www.wcax.com/about-us/meet-the-team/",
      "email": "jgrey@investigatetv.com"
    },
    {
      "url": "https://www.wcax.com/about-us/meet-the-team/",
      "email": "joce.sterman@investigatetv.com"
    },
    {
      "url": "https://www.wcax.com/about-us/meet-the-team/",
      "email": "john.mcmahon@gray.tv"
    },
    {
      "url": "https://www.wcax.com/about-us/meet-the-team/",
      "email": "kendall.claar@wcax.com"
    },
    {
      "url": "https://www.wcax.com/about-us/meet-the-team/",
      "email": "kiana.burks@wcax.com"
    },
    {
      "url": "https://www.wcax.com/about-us/meet-the-team/",
      "email": "kristin.crowley@investigatetv.com"
    },
    {
      "url": "https://www.wcax.com/about-us/meet-the-team/",
      "email": "langlois@wcax.com"
    },
    {
      "url": "https://www.wcax.com/about-us/meet-the-team/",
      "email": "laura.ullman@wcax.com"
    },
    {
      "url": "https://www.wcax.com/about-us/meet-the-team/",
      "email": "meyer@wcax.com"
    },
    {
      "url": "https://www.wcax.com/about-us/meet-the-team/",
      "email": "michael.dugan@wcax.com"
    },
    {
      "url": "https://www.wcax.com/about-us/meet-the-team/",
      "email": "perron@wcax.com"
    },
    {
      "url": "https://www.wcax.com/about-us/meet-the-team/",
      "email": "publicfile@wcax.com"
    },
    {
      "url": "https://www.wcax.com/about-us/meet-the-team/",
      "email": "rdepompa@investigatetv.com"
    },
    {
      "url": "https://www.wcax.com/about-us/meet-the-team/",
      "email": "sophia.thomas@wcax.com"
    },
    {
      "url": "https://www.wcax.com/about-us/meet-the-team/",
      "email": "tisha.powell@graymedia.com"
    },
    {
      "url": "https://www.wcax.com/about-us/meet-the-team/",
      "email": "viglienzoni@wcax.com"
    },
    {
      "url": "https://www.wcax.com/about-us/meet-the-team/",
      "email": "wade.smith@gray.tv"
    }
  ],
  "mails": [
    "adam.sullivan@wcax.com",
    "alek.lashomb@wcax.com",
    "allison.black@wcax.com",
    "amato@wcax.com",
    "andy.pierrotti@gray.tv",
    "anna.werner@investigatetv.com",
    "brandon.wissbaum@graymedia.com",
    "brendan.keefe@wanf.com",
    "calvin.cutler@wcax.com",
    "cameron.smith@wcax.com",
    "caresse.jackman@investigatetv.com",
    "chris.nakamoto@investigatetv.com",
    "claire.jones@wcax.com",
    "connor.ullathorne@wcax.com",
    "daniela.molina@gray.tv",
    "elissa.borden@wcax.com",
    "emily.featherston@investigatetv.com",
    "garrity@wcax.com",
    "greg.phillips@investigatetv.com",
    "gunnar.consol@wcax.com",
    "heather.graf@gray.tv",
    "isaac.bendavid@gray.tv",
    "jack.fitzsimmons@wcax.com",
    "jgrey@investigatetv.com",
    "joce.sterman@investigatetv.com",
    "john.mcmahon@gray.tv",
    "jriepenhoff@raycommedia.com",
    "kendall.claar@wcax.com",
    "kiana.burks@wcax.com",
    "kristin.crowley@investigatetv.com",
    "langlois@wcax.com",
    "laura.ullman@wcax.com",
    "lucy.caile@wcax.com",
    "meyer@wcax.com",
    "michael.dugan@wcax.com",
    "perron@wcax.com",
    "peter.kvietkauskas@wcax.com",
    "publicfile@wcax.com",
    "rdepompa@investigatetv.com",
    "sophia.thomas@wcax.com",
    "tisha.powell@graymedia.com",
    "viglienzoni@wcax.com",
    "wade.smith@gray.tv"
  ],
  "nombre_sitio": "aquakeywest.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.wcax.com/about-us/meet-the-team/",
      "text": "Meet the Team Skip to content Memorials Advertise With Us Build Your Future Vermont's Own Getting Answers We The People Local News Only Livestream Weather Sports 802 News Podcast How to Help Contact Us WYCI Home News Special Reports Local National Getting Answers In the Garden Investigate TV Made In Vermont Super Seniors Vermont's Own We The People Wildlife Watch You Can Quote Me 802 News Podcast Latest Newscasts Got a Story Idea? Submit Photos and Videos Newsletter WCAXtra Livestream Latest Newscasts How to Watch WCAX & WYCI TV Listings Weather Closings Radar Weather Cams Active Alerts WCAX Weather App About First Alert Weather Fall Foliage Astronomy In the Garden Sports Catamount Corner Lake Monsters on WYCI Vermont Green FC on WYCI MLB on WYCI Contact Us Meet the Team Submit Story Ideas Submit Photos and Video Sign Up for Our Newsletter Order Channel 3 News Stories Community Partners Advertise With Us Memorials Work for WCAX Paid Internships Community Ask Your Kinney Pharmacist How to Help Community Calendar Hike of the Week Marketplace Vermont's Own Great Vermont Coat Drive NextGen TV Zeam - News Streams How to Watch WCAX & WYCI WYCI Across the Fence Circle Country PowerNation Watching Your Wallet Local Business Spotlight Digital Marketing Meet The Team News Team Dom Amato Assistant News Director Dom Amato is the Assistant News Director at WCAX. Ike  Bendavid Reporter Ike Bendavid is an award-winning reporter at WCAX. Elissa Borden Anchor, Channel 3 This Morning Elissa is a morning news anchor on Channel 3 This Morning. Kiana Burks Multimedia Journalist Kiana Burks is a multimedia journalist for WCAX. Lucy Caile Multimedia Journalist Lucy Caile is a multimedia journalist for WCAX. Kendall Claar Multimedia Journalist Kendall Claar is a multimedia journalist and producer for WCAX. Calvin Cutler Political Reporter Calvin covers politics and state government at WCAX's Montpelier Bureau Roger Garrity News Director Roger Garrity is the News Director for Channel 3's award-winning team of journalists. Claire Jones Multimedia Journalist and Anchor Claire Jones is a multimedia journalist and weekend morning anchor at WCAX News. Alek LaShomb Multimedia Journalist Alek LaShomb is the Plattsburgh Bureau Chief. John McMahon Anchor, Channel 3 This Morning John McMahon is a morning news anchor for Channel 3 This Morning. Darren Perron Anchor and Reporter Darren Perron is an Anchor, Award-Winning Reporter and Executive Producer at WCAX-Channel 3 News. Cam Smith Multimedia Journalist Cam Smith is a Multimedia Journalist/Weekend Morning Anchor for WCAX-TV. Adam Sullivan Reporter Veteran journalist for WCAX covering the Upper Valley and beyond. Sophia Thomas Multimedia Journalist Sophia Thomas is a multimedia journalist for WCAX. Connor Ullathorne Multimedia Journalist/Sports Reporter Connor Ullathorne is a multimedia journalist and sports reporter for WCAX. Laura Ullman Multimedia Journalist Laura Ullman is a multimedia journalist and producer for WCAX. Cat Viglienzoni Anchor and Reporter Cat Viglienzoni is an afternoon/evening news anchor and reporter for WCAX-TV. Weather Team Jess Langlois Chief Meteorologist Jess Langlois is the Chief Meteorologist of the WCAX First Alert Weather Team. Allison Black Meteorologist Allison Black is a weekday morning meteorologist at WCAX. Dave Busch Meteorologist Dave Busch is the weekend Meteorologist on WCAX-TV. Gunnar Consol Meteorologist Gunnar Consol is a weekday evening meteorologist at WCAX. Peter Kvietkauskas Meteorologist Peter Kvietkauskas is the weekday morning and noon meteorologist at WCAX. Sharon Meyer Contributor, Weather Director Emeritus Sharon Meyer is the former weather director at WCAX-TV. She's \"retired\" but she still contributes feature stories to our shows. Sports Team Jack Fitzsimmons Sports Director Michael Dugan Sports Reporter/Weekend Sports Anchor Originally from Chicago, Michael Dugan is a graduate of Indiana University. Investigate TV Lee Zurik Anchor/Gray Media SVP Lee leads Gray Television’s National Investigative Team. He also is a Senior Vice President within Gray and is an anchor on both InvestigateTV+ and InvestigateTV+ Weekend. Jamie Grey Director of Investigations Jamie is InvestigateTV's Director of Investigations. She coordinates content and produces stories with a particular passion for digging into government programs and waste, health care policy and education. Greg Phillips Managing Editor of InvestigateTV+ Greg is the Managing Editor for InvestigateTV+. Before joining InvestigateTV, he was News Director at WMC, Gray Television’s NBC affiliate in Memphis, TN. Tisha Powell Anchor Tisha Powell is an anchor for InvestigateTV+ and WAFB 9News in Baton Rouge. Joce Sterman Senior Investigative Reporter Joce is a national senior investigative reporter focused on accountability reporting on the\nfailures of government agencies, product flaws and other transparency issues. Anna Werner Senior Investigative Reporter Anna is an award-winning Senior Investigative Reporter with Gray's National Investigative Team, InvestigateTV. A Chicago-area native, she was formerly the Senior Consumer Investigative Correspondent for CBS News. Rachel DePompa Consumer Investigative Reporter Rachel is an investigative journalist with more than 20 years’ experience. Caresse Jackman Consumer Investigative Reporter Caresse Jackman is a national consumer investigative reporter with a focus on exposing scams and digging into consumer concerns. Chris Nakamoto Investigative Reporter Chris is an award-winning investigative reporter with nearly two decades' experience in South Louisiana. Kristin Crowley InvestigateTV+ Reporter Kristin Crowley is an award-winning investigative report for InvestigateTV+. Heather Graf InvestigateTV+ Reporter Heather Graf is an award-winning journalist for InvestigateTV+, working as a national reporter based in Washington, D.C. Brendan Keefe Investigative Reporter Brendan Keefe is a Peabody, duPont, National Murrow & National Emmy winning national investigative reporter and the Chief Investigator of Atlanta News First Investigates. Brandon Wissbaum Executive Producer of Investigations Brandon specializes in crime, consumer and data-driven investigations. Before joining InvestigateTV, he was assistant news director at WECT, Gray Television’s NBC affiliate in Wilmington, NC. Wade Smith Executive Producer of Digital Content Wade heads up digital content creation and strategy development for Gray’s National Investigative Team. He started his digital career in Atlanta, GA in 2009 after graduating from the University of Alabama. Andy Pierrotti Investigative Reporter Andy is an award-winning investigative reporter with a background in reporting on the criminal justice system. Jill Riepenhoff Senior Investigative Producer Jill is a senior investigative producer with decades of experience reporting on health, safety and corruption. Emily Featherston Investigative Producer Emily is an investigative journalist with a background in several forms of media and an MBA in business management. Daniela Molina Investigative Producer Daniela is a bilingual investigative producer for InvestigateTV. News Weather Sports Community Calendar Contact Us Politics RSS Feed Eat Local COVID-19 Map WCAX 30 Joy Drive South Burlington, VT 05403 (802) 652-6300 Public Inspection File publicfile@wcax.com - (802) 652-6324 Terms of Service Privacy Policy EEO Statement FCC Applications Advertising Digital Marketing Closed Captioning/Audio Description Cookie Settings Click here to learn more about our approach to artificial intelligence. A Gray Local Media Station © 2002-2025"
    }
  ]
}