{
  "fuentes": [
    {
      "url": "https://www.art-spotlight.com/",
      "email": "info@art-spotlight.com"
    },
    {
      "url": "https://spotlightbranding.com/our-team/",
      "email": "solutions@spotlightbranding.com"
    },
    {
      "url": "https://spotlightbranding.com/our-team/",
      "email": "solutions@spotlightbranding.com"
    },
    {
      "url": "https://www.art-spotlight.com/join-us",
      "email": "info@art-spotlight.com"
    },
    {
      "url": "https://www.art-spotlight.com/events",
      "email": "info@art-spotlight.com"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "email": "info@scibpaints.com"
    },
    {
      "url": "https://www.smccombturbitt.com/contact",
      "email": "sarah@smccombturbitt.com"
    },
    {
      "url": "https://blog.hootsuite.com/social-media-image-sizes-guide/",
      "email": "g2-reviews-2025@2x.png"
    },
    {
      "url": "https://www.art-spotlight.com/contact-us",
      "email": "info@art-spotlight.com"
    },
    {
      "url": "https://www.art-spotlight.com/contact-us",
      "email": "jon@art-spotlight.com"
    },
    {
      "url": "https://www.art-spotlight.com/contact-us",
      "email": "teri@art-spotlight.com"
    },
    {
      "url": "https://www.art-spotlight.com/contact-us",
      "email": "thays@art-spotlight.com"
    },
    {
      "url": "https://www.art-spotlight.com/contact-us",
      "email": "info@art-spotlight.com"
    },
    {
      "url": "https://www.spotlight.com/about-us/",
      "email": "questions@spotlight.com"
    },
    {
      "url": "https://renee-phillips.com/how-to-write-the-artists-biography/",
      "email": "renee@manhattanarts.com"
    },
    {
      "url": "https://www.art-spotlight.com/our-artists",
      "email": "info@art-spotlight.com"
    }
  ],
  "mails": [
    "g2-reviews-2025@2x.png",
    "info@art-spotlight.com",
    "info@scibpaints.com",
    "jon@art-spotlight.com",
    "questions@spotlight.com",
    "renee@manhattanarts.com",
    "sarah@smccombturbitt.com",
    "solutions@spotlightbranding.com",
    "teri@art-spotlight.com",
    "thays@art-spotlight.com"
  ],
  "nombre_sitio": "art-spotlight.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.art-spotlight.com/",
      "text": "Art Spotlight Skip to Content Open Menu Close Menu Home Artists Our Artists Join Us Events Our Events Private Events Services Services Venue Rentals Our Story Press Contact Sponsorship 0 0 Open Menu Close Menu Home Artists Our Artists Join Us Events Our Events Private Events Services Services Venue Rentals Our Story Press Contact Sponsorship 0 0 Home Folder: Artists Back Our Artists Join Us Folder: Events Back Our Events Private Events Folder: Services Back Services Venue Rentals Our Story Press Contact Sponsorship CREATE COLLABORATE ELEVATE August Show Weddings and Rentals Sept Fundraiser Show Artist in the Spotlight Don't miss a thing! Sign up to receive news and updates. Email Address Sign Up We won’t sell your email or flood your inbox, we promise! Thank you! Give the Gift of ART Purchase a Gift Card 67 W Granada Blvd Ormond Beach, FL 32174 Teri (386)316-3162 Thays (386)871-4991 Home Artists Events Services Our Story Press Shop - Coming soon Contact Us Member Artists Only Sponsorship Opportunities Copyright 2025 Art Spotlight. All rights reserved. Wed - Sat 11am - 5 pm Sun - Tue by Appointment"
    },
    {
      "url": "https://spotlightbranding.com/our-team/",
      "text": "Our Team - Spotlight Branding Header Logo Spotlight Branding Home RESOURCES Free Downloads Blog Video FAQ Law Firm Marketing Minute Center Stage Newsletters Webinars & Workshops Spotlight Academy ABOUT US Our Story Our Team SERVICES Website Design Lead Generation Social Media SEO GEO Video FAQs Brandfilm E-Newsletter Blog Writing Podcast Production RESULTS Let’s Talk Header Social Media (800) 406-7229 Insider Menu Blog – Marketing – Tech – Strategy & Process – Personal Development – Money & Metrics Books – The Ultimate Solo Lawyer’s Guide – The Ultimate Content Marketing Playbook Video Podcasts – Law Firm Marketing Minute – Center Stage – Podcast Guest Application Spotlight Academy Join Main Menu Home RESOURCES – Free Downloads – Blog – Video FAQ – Law Firm Marketing Minute – Center Stage – Newsletters – Webinars & Workshops – Spotlight Academy ABOUT US – Our Story – Our Team SERVICES – Website Design – Lead Generation – Social Media – SEO – GEO – Video FAQs – Brandfilm – E-Newsletter – Blog Writing – Podcast Production RESULTS Let’s Talk Free Resource, Newsletter Sign Up Never Miss An Opportunity for Growth Get free marketing tips delivered to your inbox every week! Subscribe and Grow Your Law Firm Stay ahead with marketing tips, strategies, and the latest trends. Email * LinkedIn This field is for validation purposes and should be left unchanged. Services Section WEBSITE DESIGN Lead Gen Ads SOCIAL MEDIA SEO GEO (Get Clients From ChatGPT!) Video FAQs Brandfilm Email Marketing BLOG WRITING Our Team Meet Your Marketing Team We’re committed to putting your firm in the Spotlight. In order to make you unforgettable and stand out from your competitors, we pride ourselves on responsive, proactive client service. Meet our rockstar team below, and click here to learn more about our story ! Schedule a Consultation Marc Cerniglia Partner/Cofounder Marc is a founding partner at Spotlight Branding. He is passionate about helping professionals understand the truths and myths about internet marketing, and educating them on how to get the most out of their marketing efforts. He is a proud graduate of UCF and earned his Master’s Degree in Business & Marketing. More Danny Decker Partner/Cofounder Danny Decker is Partner & Cofounder of Spotlight Marketing & Branding. In addition to building his team, he frequently speaks at events and workshops and hosts multiple podcasts on the subject of business and marketing. His books, The Automatic Marketing Machine and Marketing Simplified are available on Amazon. Danny lives in Huntersville, North Carolina, with his wife & their two kids. More Megan Beaver Vice President Megan leads our entire team. Her responsibility is to ensure clients receive outstanding services and content from the Operations team, creating an ongoing relationship and success for clients. A North Carolina local and a graduate of the University of North Carolina at Charlotte, Megan resides in Belmont with her husband and two daughters. In her free time, she enjoys running, tackling home projects, and reading the newest title on her book bucket list. More Jana Eatman Overcash Sales Director Jana is one of the first people you’ll talk to if you’re interested in working with Spotlight Branding. She guides business owners through what we do and how we do it to determine if our services are a good fit for their firm. She graduated from UNC Charlotte, where she pole vaulted and threw javelin for the Charlotte Track and Field team. When she’s not at work, she coaches a local club volleyball team and plays in occasional tournaments herself. Jana also enjoys mountain biking, visiting local breweries, and cooking up a mean steak (medium rare, of course). More Dylan Stebbins Operations Director Dylan is a creative writer who leads with the reader in mind. He's been writing professionally since he was 16; fine-tuning a voice that connects with readers and clients through facts and consideration. When Dylan is not writing he's often reading, hiking, or watching and playing sports. As a graduate of St. Bonaventure University and Western New York native, conversations with him often end with \"Go Bills!\" More John Hinson Senior Copywriter John is Senior Content Writer where he creates blogs, social media posts, and ad copy for our clients. A graduate of East Carolina University, John spends his free time writing (he’s published 30 books!), playing drums, and hiking to waterfalls. More Stephanie Centeno Copywriter Steph is a passionate storyteller and visual artist. She has been world-building and writing as a form of self-expression since her youth. A voracious reader and keen adventurer, Steph easily settled into a B.A. in History from UNC at Charlotte with an emphasis on ethics, human rights, and film. When she’s not developing compelling copy for clients, you might find her enjoying the outdoors, creating art, and spending time with her husband, two children, and many pets. More Guillermo Rodriguez Lead Ads Coordinator Guillermo Rodriguez serves as a Project Management Assistant, assisting in developing, implementing, and tracking engaging content for campaigns across all digital channels to ensure optimal results for our clients. He lives in Bogotá, Colombia. More Alan Tellez Ads Coordinator Alan Tellez is a Paid Ads Coordinator, specializing in the development, implementation, and optimization of digital advertising campaigns. He works with various platforms and strategies to drive engagement and maximize results. Outside of work, he has a deep appreciation for storytelling through comics, movies, and shows, and enjoys collecting action figures and collectibles. More Mike Pelletier Media Manager Mike has a passion for social media and everything it has to offer. Growing up, he was always interested in creating and showcasing his work. It started with a curiosity in photography, which enabled him to take photos for sporting events, engagement events, and model portfolios. All of these skills came together when he discovered his passion for social media, which led him to work on different social media projects including branding, content creation, and organic growth. When he is not working, he loves spending time with his family and raising his twins to be Rams, Canes, and Yankees fans. More Eddie Dzialo Senior Marketing Strategist After graduating from the University of New Hampshire in 2006, he joined the United States Marine Corps. For the next four years, Eddie served as an infantry officer in the 2nd Light Armored Reconnaissance Battalion and completed tours in Iraq and Afghanistan. Upon leaving, Eddie earned a Master of Fine Arts in writing and published his first short story. When he’s not writing, he sits on Lake Norman while sipping espresso and listening to Dave Matthews. More Nicole Breña Paid Ads Coordinator Nicole, our Paid Marketing Coordinator, manages and optimizes online ad campaigns, combining technical and creative skills. She is a marketing enthusiast who loves romantic comedies on the bookshelf or the big screen. Nicole speaks Spanish, English, and French. She's also a passionate traveler and a lover of alternative, rock, and pop music More Matthew Delaney Account Strategist Matt strategizes ad campaigns that truly connect with audiences. He combines data-driven strategies with creative storytelling to deliver impactful results. A North Carolina native living in Raleigh with his wife, two daughters, two cats, and a dog, Matt spends his free time knitting, gaming, and getting lost in a good fantasy novel. More Fernanda Aguilar Account Strategist Fer was born in Mexico City and has been living in Cancun for many years. She has a degree in International Tourism where she learned her passion for diversity and making people feel special and smile. She is passionate about kindness, learning, curiosity, empathy, traveling, and art. She enjoys music, books, movies, cooking, and training. More Daniela Lemus Account Strategist Daniela is an extrovert communicator based in Puebla, Mexico, with a bachelor’s degree in Communication and 5 years of experience in digital marketing. Throughout her career, she's managed campaigns across different industries, working closely with clients in the US and Europe in roles such as Project Manager, Account Manager, and CSO. She believes empathy is her greatest strength—it allows her to truly connect with people and build long-lasting relationships. Outside of work, you’ll usually find her exercising, binge-watching TV shows, reading, or spending quality time with her pets, family, and friends. To her, time is the most precious thing we have, so she tries to make the most of every moment. More Alejandra Travieso Account Strategist Alejandra is a passionate communicator with a love for designing effective communication strategies and crafting impactful key messages. Hailing from Venezuela, she is a seasoned journalist with a Master's degree in Corporate and Political Communications. Over the past decade, she has dedicated herself to the dynamic world of communications, working with a diverse range of organizations, from NGOs to major corporations. She thrives on the power of words and the art of storytelling to connect, inspire, and make a positive impact in the world. More Andrea Valencia Lead Content Coordinator Andrea is passionate about learning new things and collecting random facts about the world. She’s moved around a lot since she was little so she’s always ready for a challenge and embraces change. Outside of work, her hobbies include all crafty things, trying out new recipes, going to workout classes, and reading. She currently lives in Queretaro with her husband and their two dogs. More Jhoan Rodriguez Content Coordinator Jhoan hails from Veracruz and is an avid sports enthusiast who enjoys both watching and playing a wide variety of sports. On weekends, you can often find him at the baseball stadium, enjoying the game alongside his girlfriend, family, and his dog Sanzón. He graduated from Universidad Cristóbal Colón with a degree in International Business and Markets and has a deep passion for creation and marketing, always striving to see beyond the surface to uncover deeper insights and innovative strategies. More Ishua Nieto Content Coordinator Isu has a bachelor's degree in marketing from Universidad La Salle. She lives in Pachuca, Mexico, but her dream is to be a digital nomad and travel around the world. She loves music, plays the guitar and ukulele, and likes singing. She also enjoys going out with friends, getting to know new places, and living new experiences. More Claudia Castillo Content Coordinator Claudia has a bachelor's degree in Marketing and is currently studying for a master's degree in Digital Marketing. She considers herself a creative person who enjoys exploring new ways to express herself, whether through painting techniques, crochet, or learning a new language. Claudia loves spending quality time with her family and friends, discovering new places, and meeting new people. For her, every new experience is an opportunity to grow, both personally and professionally. More Natalia Canto Content Coordinator Natalia is a creative person with a passion for makeup and a love for trying new things. She graduated from the Colegio de Imagen Pública with a degree in Public Image and specialized in Digital Marketing, combining her strategic knowledge with her flair for creativity. She consistently strives to execute projects innovatively and efficiently, finding original approaches to stand out and make a lasting impact. More Sofia Prestia Administrative Assistant (Office Queen) Originally from New York City, Sofia graduated from Baruch College with a Bachelor's degree in Corporate Communication and Psychology. She is passionate about traveling, positivity, and learning new languages! She speaks English, Spanish, Italian, and is learning French, Japanese, and Portuguese. She also runs the positivi-texts Instagram page as a way to spread sparkle and encourage others. More Free Resource Free Resource Enter your email address below for instant access! Name First Last Email * Facebook This field is for validation purposes and should be left unchanged. Contact Us Sidebar Form Contact Us Today If you would like to speak with us, please fill out the form below. First Name * Last Name * Mobile Phone * Email * Company This field is for validation purposes and should be left unchanged. Spotlight Insider Become an Insider Join today Join our growing community to get news, resources, and practical marketing and branding tips delivered straight to your inbox! Email * Comments This field is for validation purposes and should be left unchanged. Footer Logo Left Footer Menu Our Story Our Team Results Contact Privacy Policy Anti-Spam Policy News Careers Right Footer Menu Website Design Lead Generation Social Media Blog Writing E-Newsletter Video FAQs Podcast Production Sitemap Schedule a Consultation Button SCHEDULE A CONSULTATION Footer Contact (800) 406-7229 Solutions@SpotlightBranding.com Spotlight Branding 2030 South Tryon Street #3C Charlotte, NC 28203 Social Media Icons Footer Copyright © 2025 Spotlight Branding"
    },
    {
      "url": "https://www.art-spotlight.com/join-us",
      "text": "General 1 — Art Spotlight Skip to Content Open Menu Close Menu Home Artists Our Artists Join Us Events Our Events Private Events Services Services Venue Rentals Our Story Press Contact Sponsorship 0 0 Open Menu Close Menu Home Artists Our Artists Join Us Events Our Events Private Events Services Services Venue Rentals Our Story Press Contact Sponsorship 0 0 Home Folder: Artists Back Our Artists Join Us Folder: Events Back Our Events Private Events Folder: Services Back Services Venue Rentals Our Story Press Contact Sponsorship Can you see yourself at the Spotlight? Call For Art Call For Art Call For Art “Elegance Unleashed” ~ is a celebration of paws and personality. We’re rolling out the red carpet for pets with panache! Art Spotlight along with the Halifax Humane Society invites you to submit artwork for “Elegance Unleashed,” a juried art show and fundraiser that honors the charisma, style, and soul of our beloved animal companions while raising money to help rescue, shelter and rehome animals in need. A portion of all proceeds is dedicated to this important cause! Learn more A Service for Artists to Shine Art Spotlight is a unique gallery designed to give creatives a space to display their work and grow their artistic presence. Our mission is to preserve, expand, and showcase the vibrant art culture of downtown Ormond Beach by elevating art and fostering collaboration among artists and the community. If you're seeking a platform to expand your artistic horizons and connect with a supportive, dynamic community, Art Spotlight may be the perfect venue for your journey. We provide an exclusive opportunity for artists to showcase their talent, network with other creatives, and contribute to a thriving art scene. We are currently accepting applications from artists who are ready to take the next step in their career. Our selection process is highly curated to ensure a cohesive and diverse group of artists—from emerging creators to established professionals, who are excited to participate in their own success and support the growth of others. Art Spotlight proudly features 2-D and 3-D art, jewelry, and books from local authors. We are always open to unique and innovative ideas, so if you feel your work would enhance our gallery, don’t hesitate to reach out. Applications are juried, and while not all applicants are accepted immediately, every submission is considered for up to one year and opportunities to work together in other ways are available. Our gallery is open Wednesday through Saturday, 11 AM to 5 PM, with private viewings available Sunday through Tuesday by appointment. Are you ready to showcase your talent and join us in taking Ormond Beach’s art scene to the next level? Let’s make it happen! Service Agreement Application Private Art Shows The Art Spotlight front gallery is available for rent for solo and private group shows. Open reception is held in conjunction with the Ormond Art Walk every first Saturday of each month. Rental Info Don't miss a thing Sign up to receive news and updates Email Address Sign Up We won’t sell your email or flood your inbox, we promise! Thank you! 67 W Granada Blvd Ormond Beach, FL 32174 Teri (386)316-3162 Thays (386)871-4991 Home Artists Events Services Our Story Press Shop - Coming soon Contact Us Member Artists Only Sponsorship Opportunities Copyright 2025 Art Spotlight. All rights reserved. Wed - Sat 11am - 5 pm Sun - Tue by Appointment"
    },
    {
      "url": "https://www.art-spotlight.com/events",
      "text": "Art Spotlight Events — Art Spotlight Skip to Content Open Menu Close Menu Home Artists Our Artists Join Us Events Our Events Private Events Services Services Venue Rentals Our Story Press Contact Sponsorship 0 0 Open Menu Close Menu Home Artists Our Artists Join Us Events Our Events Private Events Services Services Venue Rentals Our Story Press Contact Sponsorship 0 0 Home Folder: Artists Back Our Artists Join Us Folder: Events Back Our Events Private Events Folder: Services Back Services Venue Rentals Our Story Press Contact Sponsorship Upcoming Events Sep 4 to Sep 27 Elegance Unleashed Thu, Sep 4, 2025 11:00 AM Sat, Sep 27, 2025 5:00 PM Art Spotlight (map) Google Calendar ICS Opening Reception: Saturday, September 6, 3 pm to 7 pm This is a special call for art! We are fundraising for our furry friends. Please read the prospectus carefully as this show is a little different. A portion of all sales will benefit Halifax Humane Society. Announcing our \"Call to Art\" for our September 2025, Ormond Art Walk exhibition at Art Spotlight. Artists working in all mediums can submit up to 2 original artworks for consideration in “Elegance Unleashed” which will be on display at Art Spotlight from September 4 through September 27.  We encourage and welcome submissions from all artists. \"Elegance Unleashed\" is a celebration of paws and personality. This is a juried show and a fundraiser for the Halifax Humane Society. View Event → Jul 30 to Aug 30 Black and White Photography Wed, Jul 30, 2025 11:00 AM Sat, Aug 30, 2025 5:00 PM Art Spotlight (map) Google Calendar ICS Opening Reception: August 2, 2025, 3 pm to 7 pm Art Spotlight invites photographers to submit work for “Black and White,” a juried exhibition exploring the emotional depth and visual power of monochrome photography. The show will run from August 1–30, 2025, as part of the Ormond Art Walk Theme: “Black and White” celebrates the essence of photography truth revealed through contrast, texture, and light. When color is removed, what remains can be more honest, more powerful, and more profound. We welcome works that embrace this perspective across all photographic styles and subjects. Submission Details: Open to all artists working in photography, up to 2 original black and white artworks may be submitted, work must be suitable for public display and ready to hang, if accepted. All submissions will be juried for quality, originality, and alignment with the theme. View Event → Jun 4 to Jun 28 \"Love Out Loud\" Wed, Jun 4, 2025 11:00 AM Sat, Jun 28, 2025 5:00 PM Art Spotlight (map) Google Calendar ICS Step into a vibrant celebration of identity, courage, and love, an art exhibit honoring Pride Month. This powerful collection expresses what it means to live authentically and love unapologetically. Through bold color, raw emotion, and diverse mediums, each piece invites you to witness stories of resilience, joy, protest, and pride.\nJoin us for the opening reception for\n“LOVE OUT LOUD”\nSaturday, JUNE 7th, from 3pm to 7pm\nOur opening receptions are free and open to the public. Join us to celebrate Ormond Beach arts and the community. Enjoy the live music by Rebecca Zuhoski aka Rebski, wines provided by RoseVilla Restaurant and lite bites while meeting local artist and browsing the incredible talents that grace our community!\n***Limited parking behind the gallery. The medical building lot next door will tow, but there is ample free parking across the street at the elementary school. View Event → May 1 to May 31 \"The Edge of the Day\" Thu, May 1, 2025 11:00 AM Sat, May 31, 2025 5:00 PM Art Spotlight (map) Google Calendar ICS View Event → Apr 2 to Apr 26 Art in Full Bloom Wed, Apr 2, 2025 11:00 AM Sat, Apr 26, 2025 5:00 PM Art Spotlight (map) Google Calendar ICS Art in Full Bloom Spring has sprung and the flowers are in full bloom. Take the time to be present and smell the flowers and enjoy the moment! View Event → Mar 29 Reflections - Barbara Perkins Saturday, March 29, 2025 12:30 PM 1:30 PM Art Spotlight (map) Google Calendar ICS Opening Reception: March 1 from 3 to 7 p.m. Barbara's art was more than paint on canvas; it was a window into her soul, her reflections of the world, and her boundless curiosity and love for life. She would want the show to go on and in her honor, it will be presented in grand fashion, as only Barbara would have it. \"Reflections\" is about celebrating her legacy and sharing her light with all who knew and loved her -- and with those who will come to know her through her art. View Event → Feb 1 to Feb 22 Florida Women's Art Association - A Bold Palette Sat, Feb 1, 2025 3:00 PM Sat, Feb 22, 2025 5:00 PM Art Spotlight (map) Google Calendar ICS A BOLD PALETTE - With bold hues and daring compositions let's celebrate the power and expressiveness of color. Reception: Saturday February 1, 2025\nTime: 3-7 PM View Event → Jan 4 to Jan 25 Calliope Sat, Jan 4, 2025 12:30 PM Sat, Jan 25, 2025 1:30 PM Art Spotlight (map) Google Calendar ICS Start your year off with art! January is a solo show with William Perretti. Reception is January 4, 3:00 to 7:00 p.m. in conjunction with the Ormond Beach Art Walk. View Event → Dec 7 to Dec 28 Be There or Be Square Sat, Dec 7, 2024 12:30 PM Sat, Dec 28, 2024 1:30 PM Art Spotlight (map) Google Calendar ICS Come in and see our December show with 30+ artists. Art makes a perfect gift! View Event → Oct 30 to Nov 30 Split Personalities Wed, Oct 30, 2024 2:00 PM Sat, Nov 30, 2024 3:00 PM Art Spotlight (map) Google Calendar ICS We are thrilled to annouce an art exhibition featuring the work of the Art Spotlight's own artists, each offering a distinct perspective and artistic style. Join us for the opening reception as these diverse personalities collide in a unique art show, Saturday, November 2, from 3 - 7 p.m. View Event → Oct 5 to Oct 26 Beaux Arts - Inspired Sat, Oct 5, 2024 3:00 PM Sat, Oct 26, 2024 5:00 PM Art Spotlight (map) Google Calendar ICS What ignites your creativity? Beaux Arts of Central Florida engages in unique abstract/non-objective art making of exceptional distinction. Creating Evocative or Provocative art, our artists are influenced by nature, music, spirituality, social issues or personal experiences. The viewer is left to interrupt the image based on one’s emotions or visual clues inherent in the individual piece. Compelling art is united by a shared vision that runs like a golden thread throughout the assembled works of art -- uplifting, thought provoking, and inspiring.\nOpening reception Saturday, October 5 from 3 to 7 p.m. in conjunction with the Ormond Art Walk. View Event → Sep 7 to Sep 28 The Art of Literature Sat, Sep 7, 2024 3:00 PM Sat, Sep 28, 2024 5:00 PM Art Spotlight (map) Google Calendar ICS You are invited to the opening reception to this fun art & book show.\nSaturday, Sep 7th, 3-7pm in conjunction with the Ormond Art Walk. In honor of Banned Book Month, we have partnered with Fern & Fable Books. Local artists, inspired by their favorite books have created amazing art. We invite you to enjoy the creative visual representations of 40+ different books, by 30 artists from 13 surrounding cities in 11 different mediums. View Event → Aug 1 to Aug 31 Mark Anthony Hill Thu, Aug 1, 2024 11:00 AM Sat, Aug 31, 2024 5:00 PM Art Spotlight (map) Google Calendar ICS Reception: Saturday, August 3, from 3 to 7 p.m. Come join us and meet the artist Mark Anthony Hill and our member artists. We will have live music, wine, and small bites. View Event → Jul 6 Abstract Expressions Saturday, July 6, 2024 3:00 PM 7:00 PM Art Spotlight (map) Google Calendar ICS View Event → Jun 1 to Jun 29 \"Pride\" Sat, Jun 1, 2024 3:00 PM Sat, Jun 29, 2024 7:00 PM Art Spotlight (map) Google Calendar ICS View Event → May 4 to May 25 \"Blooming\" Sat, May 4, 2024 3:00 PM Sat, May 25, 2024 5:00 PM Art Spotlight (map) Google Calendar ICS View Event → Apr 12 Acrylics Workshop Friday, April 12, 2024 9:00 AM 1:00 PM Art Spotlight (map) Google Calendar ICS Workshop by Scott Hiestand this Friday 9am-1pm.\nUnleash your creativity and immerse yourself in the world of acrylics. This workshop offers the perfect opportunity to learn, create, and elevate your artistic talent. Learn more View Event → Apr 6 to Apr 7 Common Thread Sat, Apr 6, 2024 3:00 PM Sun, Apr 7, 2024 7:00 PM Art Spotlight (map) Google Calendar ICS View Event → Mar 2 to Mar 30 Bears, Backyards & Beyond Sat, Mar 2, 2024 3:00 PM Sat, Mar 30, 2024 4:00 PM Art Spotlight (map) Google Calendar ICS Reception on Saturday, March 2, 2024; 3 p.m. - 7 p.m. View Event → Feb 3 P.S. I Love You Saturday, February 3, 2024 3:00 PM 7:00 PM Art Spotlight (map) Google Calendar ICS View Event → Jan 6 to Jan 27 Through the Lens of John Bria Sat, Jan 6, 2024 3:00 PM Sat, Jan 27, 2024 7:00 PM Art Spotlight (map) Google Calendar ICS John Joseph Bria of Palm Coast, Florida, has spent years honing his photography skills. His early fascination with fashion, modeling, and glamour photography has led to his work gracing the covers of numerous magazines, such as “Teen Model, USA” and “Malvie.” View Event → Dec 2 to Dec 30 \"The Gift of Art\" Sat, Dec 2, 2023 11:00 AM Sat, Dec 30, 2023 5:00 PM Art Spotlight (map) Google Calendar ICS A show by the Florida Women's Arts Association at the Art Spotlight Gallery. The Gift of Art comes from the heart. Our multi talented ladies are bringing out their heartfelt works. They are Sharing their passions with the world in a compact masterpiece that will be treasured for years to come. View Event → Nov 25 Shop Small Business Saturday Saturday, November 25, 2023 10:00 AM 5:00 PM Art Spotlight (map) Google Calendar ICS We are hosting 27 local vendors for the annual outdoor Shop Small Business Saturday market in our parking lot. It’s the perfect day to support local artists, local small businesses and walk off your pumpkin pie. View Event → Nov 4 to Nov 25 \"Shop Small, Give Big\" Sat, Nov 4, 2023 11:00 AM Sat, Nov 25, 2023 5:00 PM Art Spotlight (map) Google Calendar ICS Kick off the holiday season with this months show, “Shop Small, Give Big”. All art in this show is priced with gift giving in mind! View Event → Oct 7 to Oct 28 \"This is Not Art\" Sat, Oct 7, 2023 3:00 PM Sat, Oct 28, 2023 5:00 PM Art Spotlight (map) Google Calendar ICS Mark your calendars, art enthusiasts! Local Daytona Beach artist Andrew Balint is set to unveil his captivating collection, \"This is Not Art,\" at the Art Spotlight Gallery in Ormond Beach on Saturday, October 7th, 2023, from 3 to 7 pm. The grand opening ceremony will coincide with the Ormond Beach First Saturday Art Walk, making it a must-attend event for art lovers of all kinds. About Andrew Balint: Andrew Balint, an accomplished artist hailing from Daytona Beach, has a unique perspective on the world of art. His work is a fusion of influences, from street art to abstract expressionism, resulting in a style that defies conventional definitions. Balint's art has garnered recognition for its ability to challenge preconceived notions and stimulate thought. Driven by his passion for creating thought-provoking and visually striking pieces, Andrew Balint has carved a niche for himself in the art world. His works can be described as a blend of bold, vibrant colors and abstract forms that beckon viewers to explore their own interpretations. Each canvas tells a story, often inviting the audience to question their perceptions of reality and art. \"This is Not Art\" Show Details: Date: Saturday, October 7th, 2023\nTime: 3:00 pm to 7:00 pm\nLocation: Art Spotlight Gallery, 67 W. Granada Blvd, Ormond Beach, FL The opening reception ceremony for \"This is Not Art\" is free to attend, welcoming art enthusiasts, collectors, and the curious public alike. Guests will have the opportunity to meet the artist, Andrew Balint, and engage in conversations about his creative process and inspirations. Balint's work resonates with those who appreciate art that challenges conventions and pushes boundaries. \"This is Not Art\" promises to be an unforgettable experience, offering a fresh perspective on the ever-evolving world of contemporary art. Join us on October 7th, 2023, at the Art Spotlight Gallery for an evening of creativity, inspiration, and artistic exploration. Be prepared to have your perceptions challenged, your imagination ignited, and your love for art deepened. For more information about Andrew Balint and his art, please visit his website at artbybalint.com. View Event → Sep 17 Succulent Art workshop Sunday, September 17, 2023 2:00 PM 4:00 PM Art Spotlight (map) Google Calendar ICS Art Spotlight and Lanipots got together and we'll have a super fun class here at the gallery. This will be a fun Sunday afternoon making succulent art and enjoying refreshments with friends, come with your tribe or come alone and make new friends here. \nSeats are limited, must register online prior to event. \nWhat to expect: We will provide all the materials and the plants for you to make your own plate/vase décor. As well as refreshments and a great artistic atmosphere to ignite your creativity. This class is great for you to enjoy with friends and family members all projects will look totally different in the end. Keep it for yourself or give it as a gift to someone special. View Event → Sep 2 to Sep 30 \"Picture This\" Sat, Sep 2, 2023 3:00 PM Sat, Sep 30, 2023 5:00 PM Art Spotlight (map) Google Calendar ICS Opening Reception Saturday Sept. 2nd from 3 to 7 pm.\nYou are invited! This is a free event in conjunction with the Ormond Art Walk. \nCome meet and greet all our artists and photographers. At the Art Spotlight we will have live music, food and drinks provited to all visitors. Stunning photos depicting a variety of subjects and locations.\nThere will be something for everyone! They say a picture is worth a thousand words, and this show speaks volumes. View Event → Aug 5 to Aug 26 \"Meet the Masters\" Sat, Aug 5, 2023 3:00 PM Sat, Aug 26, 2023 5:00 PM Art Spotlight (map) Google Calendar ICS We all admire masters of great art, both old world and contemporary. In this show, we got creative to honor those who have paved the way and inspired us all. This show is open to the public, free admissions, rain or shine. August 5th 3-7pm in conjunction with the Ormond Art Walk, we’ll have light snacks, wine, live music, as well as live painting by Elaine D’Amore Tillard View Event → Jul 1 to Jul 29 “Birds of a Feather” Sat, Jul 1, 2023 3:00 PM Sat, Jul 29, 2023 6:00 PM Art Spotlight (map) Google Calendar ICS 'Birds of a Feather\" show has 50 pieces of art work, 35 artists collaborated to make this show happen. It will be on displayJuly 1st-29th. View Event → Jun 3 to Jun 24 \"4 Artists 4 Visions\" Sat, Jun 3, 2023 3:00 PM Sat, Jun 24, 2023 6:00 PM Art Spotlight (map) Google Calendar ICS Come meet the artists and celebrate Florida and their artistic visions with us. Saturday, June 3, 3-7 pm in conjunction with Ormond Art Walk; we will have all four of the artists here for you to meet and greet. As well as live music by Jonathan Galbraith, hors d'oeuvres and drinks. \nGroup show by artists:\nPatricia Dougherty,\nSuzanne Marie Allen, \nPatricia Domanski Art, and\nRobert Shannon Turley View Event → May 6 to May 27 \"For the Love of Ormond\" Sat, May 6, 2023 3:00 PM Sat, May 27, 2023 6:00 PM Art Spotlight (map) Google Calendar ICS You are invited! \"For the Love of Ormond\" in celebration of our 143 years. Come see this unique and special art exhibit at the Art Spotlight. Just like our city this show is full of charm and history in conjunction with the Ormond Art Walk our artist reception will be this Saturday May 6th 3-7pm. We will have food from the Sweet & Savory Junction, drinks, and live music by Dan Walters. View Event → Events Calendar Follow our journey. 67 W Granada Blvd Ormond Beach, FL 32174 Teri (386)316-3162 Thays (386)871-4991 Home Artists Events Services Our Story Press Shop - Coming soon Contact Us Member Artists Only Sponsorship Opportunities Copyright 2025 Art Spotlight. All rights reserved. Wed - Sat 11am - 5 pm Sun - Tue by Appointment"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "text": "Contact Us: Get In Touch With Asian Paints for your Painting Needs Contact Us: We’d Love To Hear From You 16815 Popular searches Interior Paints Exterior Paints Shade cards SEARCH RESULTS {{searchItem.map.shadeCode}} {{searchItem.map.shadeFamilyName}}: {{searchItem.map.shadeName}} {{searchItem.map.title}} RELATED SEARCH NO MATCHES FOUND! Did you mean? {{spellCheck}} Log-In Hello! Hello! Signout en ar {{minicart.cartcount > 0 ? minicart.cartcount : 0}} ↻ Processing... You have {{minicart.cartcount}} items {{item[\"product\"][\"name\"]}} - + ₹ {{item[\"totalPrice\"][\"value\"]}} Total ₹ {{minicart.totalprice}} Checkout ↻ Menu PAINTS & COLOUR PAINTS & COLOUR Services Services WATERPROOFING WATERPROOFING INSPIRATION INSPIRATION Login/Register PAINTS & COLOUR All PAINTS & COLOUR EXPLORE COLOURS Colour Catalogue Home Colour Guide PAINT PRODUCTS Interior Paints Exterior Paints Waterproofing Wood Paints Metal Paints Undercoats RESOURCES Paint Budget Calculator Ideas Gallery Colour visualizer SERVICES Paint Store Near Me Book Painting Services Services All Services Beautiful Homes Painting Service Scib Stars WATERPROOFING All WATERPROOFING Bathrooms Terrace and Tanks Roof & Basement Interiors Tiling All Products INSPIRATION All INSPIRATION Get Inspired Paint calculator Gallery Colour Next Guides DecorPro Resources Colour Visualizer Ideas Gallery Please enter your mobile number To receive the dealer details on SMS Mobile * SUBMIT Get in Touch We’d love to hear from you Head Office Scib Chemical S.A.E 6th of October Cirt, 4th Industrial (1/3/B)B Tel:            (+202)38281090-99 Fax: (+202)38331271 Scib Paints Helpline* For enquiries, feedback and complaints please call on 16815 or write to us at info@scibpaints.com Mobile number +91 00:59 ↻ ↻ Need help with your painting needs? Fill the form below to book a free site evaluation by a Scib Paints Beautiful Homes Painting Service expert. Name Mobile Number +20 Governorate * Email By proceeding, you are authorizing Scib Paints and its suggested contractors to get in touch with you through calls, sms, or e-mail. Book an appointment ↻ Thank you! We value your interest in Scib Paints Beautiful Homes Service. We will get in touch with you shortly to schedule a visit by an expert. Try again! Oops! Something went wrong. We couldn't process your request. Please try again? Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Our Divisions More about Asian Paints Congratulations You have subscribed. Contact Us 16815 EMAIL ABOUT Research & Technology Careers Contact Us Certificates RESOURCES FAQs POLICIES Quality Policy Customer Policy Cookie Policy Environment Policy EHS Policy TOOLS Colour Catalogue Color with AP APP/Website​ COUNTRY EGYPT Country EGYPT India GLOBAL BANGLADESH MIDDLE EAST FIJI NEPAL SRI LANKA ETHIOPIA CONNECT DOWNLOAD OUR PAINTING APP CONNECT WITH US ©Scib Paints - All rights reserved Congratulations You have subscribed. Welcome User Login OR Continue as guest You have been successfully logged out Login An OTP has been sent to your registered mobile number and email id. 00:00 Resend By clicking submit, I agree to terms and conditions SUBMIT Register Please enter the 5 digit OTP sent via SMS to verify your mobile number! 00:00 Resend I agree to terms and conditions SUBMIT Please enter your mobile number To receive the dealer details on SMS SUBMIT Provide a delivary address Fullname* Email* Mobile* +91 Flat/House No/Floor* Colony/Street/Locality* Landmark City* Pincode* SUBMIT User already exist redirecting you for the login page Waterproofing Calculator Get an instant estimate Calculate now"
    },
    {
      "url": "https://www.smccombturbitt.com/contact",
      "text": "Contact | Get in Touch Today — Fine Art by Sarah McComb-Turbitt Skip to Content Open Menu Close Menu Home Original Paintings Limited Edition Prints Courses About Contact Login Account 0 0 Home Original Paintings Limited Edition Prints Courses About Contact Login Account 0 0 Open Menu Close Menu Home Original Paintings Limited Edition Prints Courses About Contact Login Account Get in touch! sarah@smccombturbitt.com (902) 809-5890 Name * First Name Last Name Email * Phone Country (###) ### #### Message * Budget Send me a description of the project and include your budget here. $ Thank you for your inquiry, I will be in touch soon! “ In the end, we will conserve only what we love; we will love only what we understand; and we will understand only what we are taught ” — Baba Dioum Sarah McComb-Turbitt Owen Sound, ON, Canada sarah@smccombturbitt.com (902)-809-5890 The Collector's List Be the first to know about new artwork, limited-edition releases, and special events before social media channels First Name Last Name Email Address I'M IN! YAY!! I couldn’t be happier to have you join me and follow the 2021 launch of this exciting career pivot. Thank you for the support & your enthusiasm for my work! ♡Sarah For thousands of years, First Nations people have walked on this land. Their relationship with the land is at the centre of their lives.  Wherever you are, please take a moment to reflect on the traditional caretakers of the lands you call home.  Here in Bruce County, Ontario, I want to acknowledge the traditional Territory of the Anishinabek Nation: The People of the Three Fires known as Ojibway, Odawa, and Pottawatomie Nations. And further give thanks to the Chippewas of Saugeen, and the Chippewas of Nawash, now known as the Saugeen Ojibway Nation, as the traditional keepers of this land. I want to acknowledge further the more recent history and ongoing connections the Saugeen Metis have to this place. May we all, as Treaty People, live with respect on this land and live in peace and friendship with all its diverse peoples. Copyright © 2024 Sarah McComb-Turbitt. All rights reserved."
    },
    {
      "url": "https://blog.hootsuite.com/social-media-image-sizes-guide/",
      "text": "Social media image sizes for all networks [September 2025] Skip to content Search Free Trial Log In Start your free trial Blog Open main navigation menu Topics Analytics Video Engagement Experiments Listening Influencer marketing Scheduling Advertising Benchmarks Employee advocacy Content creation Explore all Networks Instagram Facebook TikTok LinkedIn X/Twitter YouTube Explore all Resources Free Tools Glossary Templates Webinars Hootsuite Labs Hootsuite Academy Industries Government Healthcare Education Financial services Nonprofit Real estate Legal Explore all About Hootsuite Pricing Why Hootsuite What’s new Explore all English Español Deutsch Français Strategy Social media image sizes for all networks [September 2025] The most recent image sizes for different social media networks, including Instagram, X, Facebook, LinkedIn, TikTok, Bluesky, and more. Christina Newberry September 4, 2025 10 min read Also available in Español Deutsch Français Table of Contents Quick social media image sizes Instagram image sizes X (f.k.a. Twitter) image sizes Facebook image sizes LinkedIn image sizes Pinterest image sizes Snapchat image sizes YouTube image sizes TikTok image sizes Bluesky image sizes Threads image sizes Social media image sizes seem to change … a lot. Never mind the confusion of new social platforms emerging, with their own content specs and aspect ratios. It doesn’t help that information about official dimensions and image sizes is surprisingly scarce. So what’s the big secret? The lack of official image guidelines is likely directly tied to the frequency of image guideline changes. The platforms don’t want to invest the time and energy to constantly update their image guidelines for end users. Fortunately, dear reader, we have invested that time and energy for you to create this comprehensive (and up-to-date) cheat sheet listing social media image sizes on all important social media platforms! Below are the most recent social media image dimensions, as of September 2025. Quick social media image sizes We go into more detail for every single network below, but this image includes the social media image sizes you probably look up most often. Basic Instagram image sizes Profile photo: 320 x 320 px Landscape: 1080 x 566 px Vertical: 1080 x 1350 px Square: 1080 x 1080 Stories and Reels: 1080 x 1920 Basic Facebook image sizes Profile photo: 196 x 196 px Landscape: 1080 x 566 px Vertical: 1080 x 1359 px Square: 1080 x 1080 px Stories and Reels: 1080 x 1920 px Cover photo: 851 x 315 px Basic X (formerly Twitter) image sizes Profile photo: 400 x 400 px Landscape: 1280 x 720 px Vertical: 720 x 1280 px Square: 720 x 720 px Cover photo: 1500 x 500 px Basic LinkedIn image sizes Profile photo: 400 x 400 px Landscape: 1200 x 627 px Vertical: 720 x 900 px Square: 1200 x 1200 px Cover photo: 1128 x 191 px Basic TikTok image sizes Profile photo: 20 x 20 px Landscape (ad): 1920 x 1080 px Vertical: 1080 x 1920 px Square (ad): 640 x 640 px Stories: 1080 x 1920 px Instagram image sizes Instagram supports horizontally and vertically oriented images well as square images. Well, sort of. You can still use all of these photo orientations in your posts, and that’s how they’ll appear in the Instagram feed. But they will all be displayed with a vertical crop on your Instagram grid. This makes image dimensions a little tricky to get right, especially if you want to control the look of your grid as a cohesive whole. Follow these guidelines to make sure your images end up looking their best. Instagram profile picture size: 320 x 320 pixels Instagram profile photos are displayed at 110 x 100 pixels, but the image files are stored at 320 x 320 pixels, so make sure to upload an image that’s least that big. Even though the dimensions are in a square format, Instagram profile photos are displayed as a circle. Make sure any elements you want to focus on in the photo are centered so they don’t get cropped out. Instagram post sizes: Landscape image: 1080 x 566 pixels (feed) / 1012 x 1350 (grid) Vertical image: 1080 x 1350 pixels (feed) / 1012 x 1350 (grid) Square image: 1080 x 1080 pixels (feed) / 1012 x 1350 (grid) Carousel images: 1080 x 1350 pixels (feed) / 1012 x 1350 (grid) Supported aspect ratios: Anywhere between 1.91:1 and 4:5 (feed) / 3:4 (grid) Recommended image size: Width of 1080 pixels, height between 566 and 1350 pixels Tips: If you want your images to look their best on Instagram, aim to upload an image that is 1080 pixels wide. When you share an Instagram image that’s sized over 1080 pixels, Instagram will size it down to 1080 pixels. If you share a photo that has a resolution lower than 320 pixels, Instagram will size it up to 320 pixels. If your image is between 320 and 1080 pixels wide, Instagram will keep that photo at its original resolution, “ as long as the photo’s aspect ratio is between 1.91:1 and 4:5 (a height between 566 and 1350 pixels with a width of 1080 pixels).” If you upload an image using a different ratio, the platform will automatically crop your photo to fit a supported ratio. Remember that all photos appear in vertical format on your grid. Resource: Learn how to edit Instagram photos like a pro . Instagram Stories image size: 1080 x 1920 pixels This is an aspect ratio of 9:16. The “safe area” is 1080 x 1610 pixels. Make sure to keep important content within that area of the frame. Resource: Take your Instagram Stories to the next level with these free templates . Instagram Reels sizes: 1080 x 1920 pixels (feed) / 1080 x 1440 pixels (grid) The feed aspect ratio is 9:16, while the grid view is 3:4. Instagram ads image sizes: Landscape: 1080 x 566 pixels Vertical: 1080 x 1350 pixels Square: 1440 x 1440 pixels Minimum width: 500 pixels Minimum height: 400 pixels Supported aspect ratios: Anywhere between 1.91:1 and 4:5 Image size for Instagram Stories ads: 1440 x 2560 pixels This is a 9:16 ratio. Instagram recommends leaving roughly “14% (250 pixels) of the top and 20% (340 pixels) of the bottom of the image free from text, logos, or other key creative elements” to prevent them from being covered. Instagram Reels ads size: 1440 x 2560 pixels This is a 9:16 ratio. Instagram recommends leaving roughly “14% of the top, 35% of the bottom, and 6% on each side … free from text, logos, or other key creative elements” to prevent them from being cropped or covered. X (f.k.a. Twitter) image sizes With its new video tab, X is clearly embracing a multimedia experience on the platform. Adding images to your X posts can help you stand out from the crowd. Pssst: This isn’t a video size post, but we will tell you that the recommended aspect ratio for the new X video tab is 9:16 with a minimum resolution of 720 x 1280. X (Twitter) image sizes for profile photos: 400 x 400 (recommended) Maximum file size: 2 MB. X header photo size: 1500 x 500 pixels (recommended) The way header images display changes depending on the monitor and browser being used. Even with the recommended dimensions, 60 pixels can be cropped from the top and bottom. X images sizes for in-stream photos: Landscape image: 1280 x 720 pixels Vertical image: 720 x 1280 pixels Square image: 720 x 720 pixels GIF: 1280 x 1080 pixels Tips Recommended aspect ratio: 16:9 or 1:1 Supported formats: GIF, JPG and PNG Maximum file size: Up to 5MB for photos and GIFs on mobile. Up to 15MB on the web. X image sizes for ads: Image ad with app buttons, website buttons, or polls: 800 x 418 pixels (1.91:1) or 800 x 800 (1:1) pixels. Square images in ads with polls will crop to 1.91:1 in mobile timeline. Image ad with conversation buttons: 800 x 418 pixels (1.91:1). Standalone image ads: 1200 x 1200 pixels (1:1) or 1200 x 628 pixels (1.91:1). Carousel image ads: 800 x 418 pixels (1.91:1) or 800 x 800 (1:1) pixels. All images in the carousel must use the same aspect ratio. Collection ads: 800 x 800 pixels (1:1), max 3 MB. Resource: Find more information here on how to advertise on X (Twitter) . Facebook image sizes Facebook is a tricky platform, because image sizes differ from desktop to mobile, and Facebook users are inclined to use both. (Facebook.com is the world’s third-most popular website .) We’ve got you covered on both fronts here. Facebook profile picture size: 196 x 196 pixels (recommended) Display size desktop: 176 x 176 pixels. Display size smartphone: 196 x 196 pixels. I mage sizes for Facebook cover photo: 851 x 315 pixels (recommended) Display size desktop: 820 x 312 pixels Display size smartphone: 640 x 360 pixels Minimum size: 400 x 150 pixels Ideal file size: Less than 100KB Tips To avoid any compression or distortion, upload a JPG or PNG file. Use the recommended pixel sizes for the fastest load times. Profile pictures and cover photos with logos or text work best when uploaded as a PNG file. Don’t drag to reposition once you’ve uploaded your cover photo. Resource: Get more tips on creating a great Facebook Page . Facebook timeline photo and post sizes: Landscape image: 1080 x 566 pixels (1.91:1) Vertical image: 1080 x 1359 pixels (4:5) Square image: 1080 x 1080 pixels (1:1) Facebook image sizes for Facebook Stories: 1080 x 1920 pixels (recommended ) Facebook Stories take up the full screen of a phone. That’s an aspect ratio of 9:16. Max file size is 30 MB. I mage sizes for Facebook ads: Facebook Feed ad: 1440 x 1440 pixels (1:1) or 1440 x 1800 pixels (4:5). Minimum size 600 x 600 pixels. Maximum file size of 30 MB. Facebook Search: At least 1080 x 1080 pixels. Ratio 1.91:1 to 1:1. Maximum file size of 30 MB. Facebook Marketplace image ads: Minimum 1080 x 1080 pixels (1:1). Maximum file size of 30 MB. Sizes for Facebook Right Column ads (desktop only): At least 1080 x 1080 pixels. Ratio 1:1. Image size for Facebook Stories ads: 1440 x 2560 pixels This is a 9:16 ratio. Maximum file size 30 MB. Facebook recommends leaving roughly “14% (250 pixels) of the top and 20% (340 pixels) of the bottom of the image free from text, logos, or other creative elements” to prevent them from being covered. Facebook Reels ads size: 1440 x 2560 pixels This is a 9:16 ratio. Facebook recommends leaving roughly “14% of the top, 35% of the bottom, and 6% on each side … free from text, logos, or other key creative elements” to prevent them from being cropped or covered. Resource: Here’s more info on how to advertise on Facebook . LinkedIn image sizes Just to keep things spicy, LinkedIn switches some image sizes up between personal profiles and company pages. You’ll find them all here. LinkedIn image sizes for personal p rofiles : Linkedin profile photo: 400 x 400 pixels or larger (recommended). Maximum 7680 x 4320 pixels or 8MB. Cover photo: 1584 x 396 pixels (recommended). Aspect ratio: 4:1. Maximum 8 MB. Tips Cover photos are cropped differently on mobile and desktop. Make sure to view your profile on both kinds of display before finalizing. LinkedIn image sizes for C ompany P ages: Company logo size: 400 x 400 pixels Page cover image size: 1128 x 191 pixels Life tab main image size: 1128 x 376 pixels Life tab custom modules image size: 502 x 282 pixels Life tab company photos image sizes: 900 x 600 pixels Image size for LinkedIn post with URL: 1200 x 627 pixels (recommended) Minimum width: 200 pixels LinkedIn image sizes for ads: Landscape (desktop and mobile): 1200 x 628 pixels (recommended). Minimum 640 x 360 pixels. Maximum 7680 x 4320 pixels. Max file size 5 MB. Square (desktop and mobile): 1200 x 1200 pixels (recommended). Minimum 360 x 360 pixels. Maximum 1200 x 1200 pixels. Max file size 5 MB. Vertical (mobile only): 720 x 900 pixels (recommended). Minimum 360 x 640 pixels. Maximum 2430 x 4320 pixels. Max file size 5 MB. Carousel: 1080 x 1080 pixels. 2 to 10 images. Max file size 10 MB. Pinterest image sizes Pinterest profile image size: 280 x 280 pixels (recommended) Remember that your profile photo will be displayed as a circle. Pinterest image size for profile cover photo: 800 x 450 pixels ( minimum) This is a 16:9 aspect ratio. Pinterest image sizes for Pins: Recommended size: 1000 x 1500 pixels. Recommended aspect ratio: 2:3. Other available ratios are 9:16, 3:4, 4:5, and 1:1. Max file size: 20 MB for web, 1 GB recommended for app. Tips Stay within the safe zone to make sure your content is fully visible on any device: top 270 px, left 65 px, right 195 px, bottom 790 px. Pinterest image sizes for collections Pins: Aspect ratio: 1:1 (recommended) or 2:3 Recommended size: 1000 x 1000 pixels or 1000 x 1500 pixels Max file size: 10MB Tips This format appears as one main image, above 3 to 24 smaller images. The main image’s ratio can differ from the smaller images, but all the smaller images must have the same aspect ratio. Collections appear in feeds on mobile devices. 1:1 format is recommended. If you choose a different aspect ratio, know that these Pins are cropped from the middle. Collections can also be an ad format on Pinterest. Pinterest image sizes for ads: Image and Shopping ads: 1000 x 1500 pixels (recommended). Aspect ratio 2:3 (recommended). Max file size 20 MB. Carousel ads: 1000 x 1500 pixels (2:3) or 1000 x 1000 pixels (1:1) recommended. Up to 5 images. Resource: Get some advice on how to use Pinterest for business . Snapchat image sizes Snapchat profile picture size: 320 x 320 pixels (minimum) Maximum file size is 2 MB. Snapchat banner image size: 375 x 278 pixels (recommended) You can upload an image up to 375 x 569 pixels, but it will crop to 375 x 278 Maximum file size: 2 MB Snapchat ads image size: 1080 x 1920 pixels (at minimum) Aspect ratio: 9:16 File type: JPEG or PNG Maximum file size: 5 MB Tips Don’t put any important content in the top 150 px or bottom 330 px, to make sure it won’t be covered. Resource: Learn how to use Snapchat for business . YouTube image sizes YouTube profile photo size: 800 x 800 pixels (recommended) Tips Make sure the focus of your photo is centered for best results. Maximum file size is 15 MB. Photos will render at 98 x 98 pixels. YouTube banner image size: 2 560 x 1 440 pixels ( recommended ) Aspect ratio: 16:9 Minimum dimensions 2048 x 1152 At the minimum dimensions, the safe area for text and logos to avoid being cut off is 1235 x 338 pixels Maximum file size: 6 MB YouTube video thumbnail size: 1280 x 720 pixels (recommended) Minimum width is 640 pixels Max file size if 2 MB Use a 16:9 aspect ratio YouTube podcast playlist thumbnail size: 1280 x 1280 pixels (recommended) Use a 1:1 aspect ratio Maximum file size: 10 MB Tips You can’t upload a custom thumbnail for Shorts, but you can select which frame from the video to use as the thumbnail. Resource: How to create a YouTube channel . TikTok image sizes TikTok profile photo size: 20 x 20 pixels (minimum size to upload) We recommend uploading a higher quality photo for future-proofing. TikTok video size: 1080 x 1920 ( recommended ) The ideal aspect ratio for vertical TikTok videos is 9:16. You can post videos with other dimensions, but the platform will add black bars to the top and bottom of the videos so they are full-screen. TikTok ads image sizes: Vertical (recommended): 540 x 960 pixels minimum (9:16) Landscape: 960 x 540 pixels minimum (16:9) Square: 640 x 640 pixels minimum (1:1) Carousel: 1200 x 628 pixels or 640 x 640 pixels or 720 x 1280 pixels. 2 to 35 images. Recommended max file size 100 KB. Profile photo for ads: 98 x 98 pixels (1:1). Max file size 50 KB. Resource: How to get more views on TikTok Bluesky image sizes Bluesky profile picture size: 1000 x 1000 pixels Upload a 1:1 profile photo with the most important part of the image in the center. It crops to a circle. Bluesky banner image size: 3000 x 1000 pixels Bluesky renders the banner image differently on desktop and mobile, so it’s a good idea to check different formats to make sure it looks right on each one. Keep the important information in the center. Bluesky image post size: 1000 pixels (height or width) There is no set image size for Bluesky, but the platform stores image files with the longest side at 1000 pixels. Stick with standard image sizes like 1:1, 9:16, 3:4, or 4:5 for best results. Tips Each post can have up to four images. Each image is limited to 1 MB. Resource: How to use Bluesky for business . Threads image sizes Threads profile image size: 640 x 640 pixels Like most other social platforms, the profile image is cropped to a circle. Threads post image size: 1440 x 1920 (recommended) Minimum width: 320 pixels Maximum width: 1440 pixels Acceptable aspect ratio: 0.01:1 to 10:1. Native aspect ratio is 3:4 Maximum file size: 8 MB Tips Carousel posts can include up to 20 images. Resource: How to use Threads effectively in 2025 Why is it important to get social media image sizes right? Social media marketers need to get many things right when creating visual content for social media. You’ve got to make sure the images you use comply with copyright laws . If you don’t have original imagery, you’ve got to find high-quality stock photos . And you’ve got to figure out how to create images that connect with your audience and inspire them to take action. On top of that, you’ve got to get your social media image sizes right. That’s really important because: It avoids pixelation and awkward image stretching to keep your images looking professional. Photos optimized for each social channel’s feed can help increase engagement. Incorrect sizing could cut off some of your brand’s messaging. It can future-proof your content. Using the right social media image sizes now could mean less work for your brand in the future, when networks change up how images display yet again. When building posts in Hootsuite, you never have to worry about getting the image size wrong. You can upload and refine your images using Canva’s editing tools right inside the Hootsuite dashboard. The very first step of the process is selecting a network-optimized size for your image from a drop-down menu. Here’s how it works: Log in to your Hootsuite account and head to Composer . Click on the purple Canva icon in the bottom right corner of the content editor. Select the type of visual you want to create. You can pick a network-optimized size from the drop-down list or start a new custom design. When you make your selection, a login pop-up window will open. Sign in using your Canva credentials or follow the prompts to start a new Canva account. (In case you were wondering — yes, this feature does work with free Canva accounts!) Design your image in the Canva editor. When you’re done editing, click Add to post in the top right corner. The image will automatically be uploaded to the social post you’re building in Composer. Don’t feel like memorizing all this info? Easily resize your social media images for publication through Hootsuite Composer, which includes up-to-date image dimensions for every social media network. Get started Do it better with Hootsuite , the all-in-one social media tool. Stay on top of things, grow, and beat the competition. Free 30-Day Trial Content creation Guide If you're not reading The Perch ... are you even keeping up? Email Address Subscribe By Christina Newberry Christina Newberry has been writing about digital marketing since the prehistoric days of 2002, when email opt-ins were every marketer's biggest goal. With a deep understanding of how to connect to online audiences, she shifted her focus to social media and has been contributing to the Hootsuite blog since 2016. Read more by  Christina Newberry Related Articles Employee advocacy What is employee advocacy? A guide for marketers in 2025 Content creation Social media strategy B2B social media marketing: 14 strategies for leads and reach Content creation Social media strategy Instagram Stories in 2025: Your guide to boosting engagement Social media strategy Social media tools How to manage multiple Instagram accounts (without losing your mind) The #1 social media tool Create. Schedule. Publish. Engage. Measure. Win. Try free 30-day trial 3,000+ 5-star reviews ★ ★ ★ ★ ★ About Why Hootsuite About us Careers Leadership Customers Newsroom Social impact and DEI Product features Publish Engage Monitor Advertise Analyze Pricing Standard Advanced Enterprise Guides Social Media Marketing Strategy Social Media Analytics Social Listening Best Times to Post Social Media Calendar Social Media Engagement Employee Advocacy Social Media Monitoring Social Media Advertising Resources Academy Resource Library Case studies Webinars App directory Help center Product updates Integrations Partners English English Español Deutsch Français © 2025 Hootsuite Inc. All Rights Reserved. Legal Center Trust Center Privacy Cookie Preferences Accessibility Search Thank You"
    },
    {
      "url": "https://www.art-spotlight.com/contact-us",
      "text": "Contact Us — Art Spotlight Skip to Content Open Menu Close Menu Home Artists Our Artists Join Us Events Our Events Private Events Services Services Venue Rentals Our Story Press Contact Sponsorship 0 0 Open Menu Close Menu Home Artists Our Artists Join Us Events Our Events Private Events Services Services Venue Rentals Our Story Press Contact Sponsorship 0 0 Home Folder: Artists Back Our Artists Join Us Folder: Events Back Our Events Private Events Folder: Services Back Services Venue Rentals Our Story Press Contact Sponsorship Contact Us Info@art-spotlight.com Teri (386)316-3162 Thays (386)871-4991 67 W Granada Blvd, Ormond Beach, FL 32174 HOURS: Wednesday - Saturday  11 am - 5 pm Sunday - Tuesday by chance or by appointment. Name * First Name Last Name Email * Message * Thank you! Thays França Co-Founder/Artist Thays@art-spotlight.com Mobile (386)871-4991 Barbette Jensen Art Director/Artist Barbette@art-spotlight.com Jon Benjamin Art Director/Artist Jon@art-spotlight.com Teri Althouse Co-founder/Artist Teri@art-spotlight.com Mobile (386)316-3162 Visit us 67 W Granada Blvd Ormond Beach, FL 32174 Hours Wednesday–Saturday 11am–5pm Sunday-Tuesday by chance or by appointment Phone Teri (386) 316-3162 Thays (386)871-4991 67 W Granada Blvd Ormond Beach, FL 32174 Teri (386)316-3162 Thays (386)871-4991 Home Artists Events Services Our Story Press Shop - Coming soon Contact Us Member Artists Only Sponsorship Opportunities Copyright 2025 Art Spotlight. All rights reserved. Wed - Sat 11am - 5 pm Sun - Tue by Appointment"
    },
    {
      "url": "https://www.spotlight.com/about-us/",
      "text": "About Us | Spotlight Skip to content Memberships Performers Young Performers Graduates Casting Professionals Agents Studios Studios Voiceover Booth Contacts Listings News & Advice About Us About Us Our Partners Press Centre The Spotlight Prize Support Help Centre Industry Resources The Casting Director Index Join Now Sign In What type of membership would you like to apply for? Close Performer Young Performer Graduate Casting Professional Agent Account access problem Close You do not have permission to access this page with your current\n                        sign in details. If you require any further help, please get in\n                        touch at questions@spotlight.com . Ok About Us It’s our role to keep stages and screens filled with talented performers, so we can continue to watch our favourite characters come to life. Rooted in the tradition of serving the performing arts industry, Spotlight has been at the forefront of connecting performers with the world’s most successful casting professionals across film, television, and theatre since 1927. Today, our cutting-edge SaaS solution empowers performers to showcase their talents by creating dynamic profiles, making them accessible to a vast network of casting directors and independent project creators. It is our mission to facilitate the discovery of new talent and ensure the continued vibrancy of stages and screens worldwide. With our studios in the heart of London’s West End and a global presence through Talent Systems , Spotlight is firmly placed as a cornerstone of the casting industry and the ultimate resource for both performers and casting professionals. The origins of Spotlight In 1927, stage manager Keith Moss conceived the Spotlight Directory to seamlessly connect theatre directors and casting directors with actors. His pioneering publication featured 236 performers, including two exceptional dogs. Rodney Millington, joining as Managing Director, steered Spotlight to become a casting staple by World War II, securing an exemption from paper rationing due to its significance in bolstering morale. After the war, the Seale family took the helm, advancing Spotlight over three generations. They set up central London casting studios and moved the directory online in 1997. The final print edition appeared in 2017, marking a full digital transition. Spotlight today Spotlight’s evolution continued in 2021 by joining the Talent Systems group, alongside Casting Networks , Cast It , Tagmin , Cast It Reach and Staff Me Up , becoming the heart of a global network for talent discovery. Today, Spotlight is proud to be the premier casting home, celebrating the diversity of talent and empowering performers’ careers with our trusted, accessible, and passionate service. Who are Spotlight’s partners? We are honoured to work alongside some fantastic organisations that are making a real difference in the performing arts around the world. Read more about our partners. Our greatest role is helping you find yours Follow Us Our greatest role is helping you find yours About Get In Touch About Us Contacts Listings Our Partners Spotlight Tools Student Performance Calendar Get Listed on Contacts Website Status Page What's New on Spotlight Promoting Inclusivity in Our Industry Terms & Conditions Privacy Policy Cookie Settings Help & FAQs Safeguarding Policy Security & Trust 16 Garrick Street, London WC2E 9BA © Talent Systems Europe Ltd 2025"
    },
    {
      "url": "https://renee-phillips.com/how-to-write-the-artists-biography/",
      "text": "How to Write Your Artist’s Biography Home About Renee Writing Services for Artists Articles Interviews Resources for Artists RENEE PHILLIPS - MENTOR FOR ARTISTS Helping Artists Achieve Their Fullest Potential You are here: Home / Articles / How to Write Your Artist’s Biography: The Important Basics How to Write Your Artist’s Biography: The Important Basics By Renee Phillips 14 Comments In “How to Write Your Artist’s Biography” I explain what it is, why you need it, suggestions on what to include in it. A compelling and memorable Artist’s Biography reaches out and connects with your reader. It inspires them to bring your art into their lives. Your Artist’s Biography is essential for viewers of your art who want to know more about you. It helps them to understand what makes you unique and tells them about the journey you took to get to where you are now as an artist. On the practical side, your Artist’s Biography provides prospective buyers, gallery owners, curators, grant givers and writers knowledge about you. They want to know about your career accomplishments before they decide to invest in your art and promote you. What Is The Artist’s Biography? The Artist’s Biography is text, written in the third person (she, he) . It serves to provide the reader with a story about you as an artist and learn about your career credentials. It contains much of the same information as a résumé, however, a résumé or CV is written in a listing format and a biography is written in an editorial style. Your Artist’s Biography may contain a brief description of your art work however it is also not the same as an Artist’s Statement , which your write entirely to express creative inspiration, materials, style and artistic vision. On your website limit your Artist’s Biography to approximately 200-250 words. Create different versions of your Artist’s Biography to use for different purposes. Why You Need to write Your Artist’s Biography Photo by DESIGNECOLOGIST on Unsplash You need a well-written artist’s biography to… Promote your art on your website and blog on the “About the Artist” page. Create your profile on your social media platforms. Provide material in your cover letter to a gallery or other art official. Give to a publicity outlet — art editor, feature story editor or radio or TV host. Add to your exhibition press release. Serve as an integral part of a brochure or catalogue. Add to your proposal for a grant, lecture, workshop or panel discussion. Some Ideas ~ What To Include in Your Biography What are the unique attributes of your art? Where have you previously lived and where do you currently live? When, where, and/or why did you begin to take interest in art? Did you study art in school, or were you self-taught? Did you go to college or art school? Where? What did you study? Did you receive any press coverage? What is the title of the magazine/newspaper or blog and the writer’s name? Have you been interviewed on TV or radio? What is the title of the show and person who interviewed you? What exhibitions did you participate in? What is the name of the exhibition location and title of exhibition? Was it a juried or invitational exhibition? What is the name of the juror? Is your art in any important public collections? Which ones? What awards and honors have you earned? Have you served in other art art related capacities,  such as: Serving on the Board of Directors or committee of an arts organization? Avoid These Mistakes I’ve Seen on Artists’ Websites Avoid writing about intimate, personal experiences that are not related to your career or artistic vision. Avoid the use of jargon, colloquialism, and esoteric language that will alienate most potential buyers. Avoid writing long biographies about your trials and tribulations beginning with childhood, grade school art work… Avoid grandiose over-inflated jargon about yourself. Avoid writing excessive quotes and references to famous artists. Remember, if someone is interested in buying your art or showing your art in their gallery they are more interested in your current career credentials, not what you did as a child. Would You Like Me to Write Your Artist’s Biography? Visit This Page to Learn About This Writing Service Filed Under: Articles , Featured Articles Tagged With: art promotion , artist writing materials , artist's biography Find out about Renee’s Writing Services for Artists About Renee Phillips Renée Phillips is a mentor and advocate for artists helping them achieve their fullest potential. She provides career advice, writing services, and promotion for artists from beginners to advanced. She organizes online exhibitions as Director/Curator of Manhattan Arts International www.ManhattanArts.com and Founder of The Healing Power of ART & ARTISTS www.healing-power-of-art.org. As an arts' advocate she has served on the advisory boards of several non-profit arts organizations. She lives in New York, NY. Comments Bill Holland says 12/23 at 11:09 am Hi Renee, Thank you for sharing your invaluable insight into writing biographies etc. I am in the process of entering a competition in the UK and I will certainly use your advice to help create my biography. Accuracy of written content is clearly important to us both and I thought I would like to mention a typo you have made in your ‘Why do you need to write Your Artist’s Biography?’ section, where you have stated, ‘Add to your your exhibition press release.’ (the word ‘your’ repeated ). I hope you won’t find offence in bringing this to your attention but obviously you want to keep an accurate page without errors. Kind regards. Bill Reply Renee Phillips says 12/24 at 11:42 am Thank you Bill for reading my article and calling my attention to the typo in it. I have fired my assistant editor/proofreader for failing to catch it. Only joking. I greatly appreciate it. 🙂 Reply Heather Johnson says 11/03 at 11:18 am Thank you so much for your most informative article full of guidance. I am currently assisting a homeless  Indigenous artist to get off the streets and launch his art career. Reply Shirley Ann Smith Konnateh says 12/24 at 12:14 am I am a Volunteer with 30 Students approximately 25 active art students. Thay range in age from 4 to 75 with a love for art. I need help with helping them .write  their  bio and artist statements..Need direction on how to help and how to get help to support my group..I find it hard to get people to share information that will help you grow and thrive in thie art world. I have learned that I have a lot to learn a long road ahead I’m a 62 year old retired .,.nurse.I’ve been an artist for 12 years . Reply Renee Phillips says 12/24 at 9:34 am Dear Shirley, Thank you for the work you do helping art students. It must be also very gratifying for you. I love offering advice to artists. Please share this article with your group and suggest that they subscribe to my blog email newsletter to see new articles when they are published. I also suggest you read and share How to Write Your Artist’s Statement. Don’t get discouraged. It can be overwhelming to navigate the business of being an artist. Here’s a good article to read: Take Small Steps to Achieve Large Art Career Goals.t a time . As far as funding for your group, I don’t know where you live, but there are nonprofit organizations that serve as an “umbrella” for groups like yours. Keep going and best wishes to you and your students! Reply Patrick Nizeyimana says 11/13 at 9:35 am This site is so super amazing and super helpful! I was so happy to have my artist statement! Best Regards, Patrick ! Reply Sumera Reshi says 03/20 at 1:13 am Hello, This article was helpful for me but I want to know how I can write organizational biography? Do you have any idea about that, if you have, please share it with me? Regards, Sumera Reply Renee Phillips says 03/20 at 9:13 am Hi Sumera, I’m glad you found the article helpful to you. What do you mean by an “organizational biography”? My guess is you may be referring to a biography of an organization, which would include such information as its mission statement and objectives, often with such categories as “Who We Are”, “What We Do”, “Benefits to Sponsors”, “Benefits to Members”, etc. If so, there are articles about art organizations on The Artrepreneur Coach website. Use this link to find examples of art organizations with good examples of their missions and objectives on their websites https://renee-phillips.com/?s=art+organizations I hope this information helps you. Reply Anita Adams says 05/21 at 6:33 pm Thank you for the guideline. I found this very helpful and concise. Reply Phill Jombs says 05/16 at 5:31 am Hello Renee Thanks for this information. It is helpful to me and many more who need such insights. Reply Stephanie Harvey says 07/09 at 5:45 pm HI Renee! I have an artist who I think would really connect with you and benefit from your services.  How do I get him connected? Best Stephanie Reply Renee Phillips says 07/10 at 6:56 pm Hi Stephanie, Thank you for your interest in my services. Please direct the artist you know to this page: https://renee-phillips.com/career-coaching-for-artists/ . Information about my consulting and writing services, fees, testimonials and how to contact are all there or a click away. All the best, Renee Reply Tim Terry says 09/05 at 6:28 am Thank you very much for this service , I am having my first show of my life , and am grateful that this help and the awesome advice , i feel blessed to share my work in some capacity to the rest of the World , Aloha Reply Edwena Boardman says 09/03 at 3:29 pm I did not realize how important a good biography of myself needs to be. I thank you for your helpful tips. Can hardly wait for a more profitable future. Reply Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Δ This site uses Akismet to reduce spam. Learn how your comment data is processed. Welcome! My purpose is to help artists achieve their fullest potential. On this website I share decades of knowledge and experience as an art writer and artist career coach. I am also the Director of Manhattan Arts International and The Healing Power of ART & ARTISTS where I maintain online galleries and curate exhibitions. You'll find those links below. MANHATTAN ARTS INTERNATIONAL As the Founder, Director and Curator of Manhattan Arts International I maintain online galleries and curate exhibitions. Healing Power of ART & ARTISTS Gallery I am the Founder, Director and Curator of The Healing Power of ART & ARTISTS. The website features an online gallery, exhibitions, and hundreds of articles and art reviews. The mission is based on the belief that artists have the power to bring positive change to individuals, society and the environment. Follow Me on Social Media Facebook Instagram LinkedIn YouTube Ask Me to Write an Art Review Find out about how to apply to have me write an Art Statement or an Art Review for you that you can use for your promotion and marketing purposes. Simply tap or click on the photo above to learn all about these options. More Suggested Reading Scams Aimed at Artists Artists Beware of Scammers on The Rise!\r\nIf you are promoting yourself as an artist, have an email address … [Read More...] Beware of Vanity Galleries It is A Pay to Play Game In Which Artists Have Much to Lose\r\nThis article offers advice that is useful when … [Read More...] The Truth About Fine Art Agents Let's Dispel Some Myths and Make Way for New Options\r\n\r\n\r\nEvery week at least one artist will ask me how and … [Read More...] Are Your Art Materials Making You Sick? As an artist it's wonderful to imagine the treasure trove of art materials to choose from to create your … [Read More...] Where to Find Art Buyers and Meet Collectors Where and how to find art buyers requires a combination of knowledge, strategy and persistence. However, there … [Read More...] A Positive Future for Maturing Artists Steps to Take to Restore Optimism and Bring Peace of Mind\r\nThe artists I have coached over the years come from … [Read More...] How to Avoid Getting Rejected in Art Competitions & Mistakes Artists Make Has your art ever been rejected in a juried art competition? Were you confused because after seeing the … [Read More...] What Really Is Self-Taught Art and What Does It Mean to Be A Self-Taught Artist? Definitions, Historical Facts and Artists in This Genre\r\nAs I'm sure you know by now I write a lot of art … [Read More...] 22 Questions for Artists to Ask Galleries How to Prepare and Protect Yourself\r\n\r\n\r\nExhibiting in a gallery requires an investment of your time and … [Read More...] Do You Think Titles of Art Matter? This Question Has Attracted Many Different Replies\r\nShakespeare quipped \"A rose by any other name would smell … [Read More...] Organizations That Advance The Status of Women Artists Organizations that serve and advance the status of women artists are essential and cherished resources. They … [Read More...] How to Approach New York Art Galleries and Any Desired Gallery Most artists from around the world want to be exhibited in New York Art Galleries. However, many of you are … [Read More...] Sell Your Art To Interior Designers and Corporate Art Consultants Professional Organizations and More Resources with Thousands of Leads\r\nYou can expand your art sales by … [Read More...] 10 Best Selling Tips For Artists If you visit the hundreds of articles I've written for you on this website you'll probably find thousands of … [Read More...] Art and Artist’s Statements – Quotes by Famous Artists If you're like most artists I know, the task of writing your Artist's Statement feels like torture. You may … [Read More...] The Basics of Public Relations For Artists An artist recently asked me \"Why is it that some artists' careers rise to stardom while other artists, who are … [Read More...] What to Do When You Receive Publicity As An Artist – 15 Steps to Take 15 Important Steps to Take Immediately After Learning You Are in an Article, Received an Award, Were Selected … [Read More...] Selling Your Art to Corporations Imagine your art on permanent display in a lobby or conference room of a corporation. Getting your art into … [Read More...] Topic Ideas For Your Art Blog Posts Whenever an artist client asks me how they can drive more traffic to their website (after they have created a … [Read More...] My Love-Hate Relationship As A Juror / Curator This is a true confession to you about my love-hate relationship as a juror / curator. During my art career I … [Read More...] Our Privacy Policy Click here to read our Privacy Policy. Writing Services for Artists My specialty is writing \"Praise Quotes\" -- Art Statements for artists to use for promotion and longer Art Reviews which I publish and provide promotional services. My writing for artists has led to increasing their art sales, attracting publicity, gaining representation, and building confidence. Artists use my writing on their websites, social … More... Copyright © 2014 -2025 Renee Phillips Manhattan Arts International 200 East 72 Street, New York, NY 10021 renee@manhattanarts.com Copyright © 2025 · Magazine Pro Theme On Genesis Framework · WordPress · Log in"
    },
    {
      "url": "https://www.art-spotlight.com/our-artists",
      "text": "Our Artists — Art Spotlight Skip to Content Open Menu Close Menu Home Artists Our Artists Join Us Events Our Events Private Events Services Services Venue Rentals Our Story Press Contact Sponsorship 0 0 Open Menu Close Menu Home Artists Our Artists Join Us Events Our Events Private Events Services Services Venue Rentals Our Story Press Contact Sponsorship 0 0 Home Folder: Artists Back Our Artists Join Us Folder: Events Back Our Events Private Events Folder: Services Back Services Venue Rentals Our Story Press Contact Sponsorship Teri Althouse Thays França Jon Benjamin Barbette Jensen Lisa Driscoll Tana Burd Nancy Newlove McElroy Glenda Greenberg Peggy Epton Michelle Ann Delisle Kelley Batson-Howard Tracy Lupanow Andrina Carey Scott Hiestand Alessandra Givens Amber Lyn Leslie Gibbs Mary Unson Julie Latayan Karen Ann Patton Wally Osteen Brandon Fumich Carol Baker Alex Vontevenar Bernard Lee 67 W Granada Blvd Ormond Beach, FL 32174 Teri (386)316-3162 Thays (386)871-4991 Home Artists Events Services Our Story Press Shop - Coming soon Contact Us Member Artists Only Sponsorship Opportunities Copyright 2025 Art Spotlight. All rights reserved. Wed - Sat 11am - 5 pm Sun - Tue by Appointment"
    }
  ]
}