{
  "fuentes": [
    {
      "url": "https://dashhernandez.com/port-saint-lucie/port-saint-lucie-gated-communities/astor-creek-golf-country-club-kolter-homes/",
      "email": "dhernandez@khov.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/the-woodlands-country-club/our-story/our-team",
      "email": "andrea.schaefer@invitedclubs.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/the-woodlands-country-club/our-story/our-team",
      "email": "brooke.tyler@invitedclubs.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/the-woodlands-country-club/our-story/our-team",
      "email": "david.sizelove@invitedclubs.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/the-woodlands-country-club/our-story/our-team",
      "email": "jason.lippy@invitedclubs.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/the-woodlands-country-club/our-story/our-team",
      "email": "jesse.regalado@invitedclubs.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/the-woodlands-country-club/our-story/our-team",
      "email": "menno.ozinga@invitedclubs.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/the-woodlands-country-club/our-story/our-team",
      "email": "mitchell.putnam@clubcorp.commitchell"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/the-woodlands-country-club/our-story/our-team",
      "email": "mitchell.putnam@invitedclubs.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/the-woodlands-country-club/our-story/our-team",
      "email": "robin.kremen@invitedclubs.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/the-woodlands-country-club/our-story/our-team",
      "email": "annemarie.mckay@invitedclubs.com"
    },
    {
      "url": "https://www.thehubergroup.com/port-saint-lucie/port-st-lucie-gated-communities/astor-creek-golf-country-club-taylor-morrison/",
      "email": "rebecca@livinginstylehomes.com"
    },
    {
      "url": "https://www.thehubergroup.com/port-saint-lucie/port-st-lucie-gated-communities/astor-creek-golf-country-club-taylor-morrison/",
      "email": "stephanie@thehubergroup.com"
    },
    {
      "url": "https://www.thehubergroup.com/port-saint-lucie/port-st-lucie-gated-communities/astor-creek-golf-country-club-kolter-homes/",
      "email": "rebecca@livinginstylehomes.com"
    },
    {
      "url": "https://www.thehubergroup.com/port-saint-lucie/port-st-lucie-gated-communities/astor-creek-golf-country-club-kolter-homes/",
      "email": "stephanie@thehubergroup.com"
    },
    {
      "url": "https://www.kolterhomes.com/new-homes/port-st-lucie-florida-golf-astor-creek-country-club/lifestyle/membership/",
      "email": "verano_pool_global_header_new@1.5x.jpg"
    },
    {
      "url": "https://www.kolterhomes.com/new-homes/port-st-lucie-florida-golf-astor-creek-country-club/lifestyle/membership/",
      "email": "information@kolter.com"
    }
  ],
  "mails": [
    "andrea.schaefer@invitedclubs.com",
    "annemarie.mckay@invitedclubs.com",
    "brooke.tyler@invitedclubs.com",
    "david.sizelove@invitedclubs.com",
    "dhernandez@khov.com",
    "information@kolter.com",
    "jason.lippy@invitedclubs.com",
    "jesse.regalado@invitedclubs.com",
    "menno.ozinga@invitedclubs.com",
    "mitchell.putnam@clubcorp.commitchell",
    "mitchell.putnam@invitedclubs.com",
    "rebecca@livinginstylehomes.com",
    "robin.kremen@invitedclubs.com",
    "stephanie@thehubergroup.com",
    "verano_pool_global_header_new@1.5x.jpg"
  ],
  "nombre_sitio": "astorcreekclub.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://dashhernandez.com/port-saint-lucie/port-saint-lucie-gated-communities/astor-creek-golf-country-club-kolter-homes/",
      "text": "Astor Creek Golf & Country Club | Golf community Port St Lucie Florida Kolter Skip to content Four Seasons at Wylder Floor Plans Spring Lake IV by K. Hovnanian Bell by K. Hovnanian Taylor by K. Hovnanian Kelly by K. Hovnanian Franklin by K. Hovnanian Morse by K. Hovnanian Astaire by K. Hovnanian Stanwyck by K. Hovnanian Bogart by K. Hovnanian Carver by K. Hovnanian Why Wylder Amenities & Lifestyle Gallery FAQ HOA fees Blog Video Tour Schedule a Tour Realtors Floorplans Four Seasons at Wylder Floor Plans Spring Lake IV by K. Hovnanian Bell by K. Hovnanian Taylor by K. Hovnanian Kelly by K. Hovnanian Franklin by K. Hovnanian Morse by K. Hovnanian Astaire by K. Hovnanian Stanwyck by K. Hovnanian Bogart by K. Hovnanian Carver by K. Hovnanian Why Wylder Amenities & Lifestyle Gallery FAQ HOA fees Blog Video Tour Schedule a Tour Realtors Floorplans 305-3427413 ASTOR CREEK GOLF & COUNTRY CLUB Astor Creek Golf & Country Club: Premier Living in Port St. Lucie Astor Creek Golf & Country Club is an exclusive, gated community located in the heart of Port St. Lucie, Florida. This premier golf course community is designed for those who seek a modern, luxurious country club lifestyle with world-class amenities and beautiful surroundings. Community Overview Astor Creek is renowned for its picturesque landscapes and a challenging 18-hole championship golf course designed by Christopher Wilczynski. The community features approximately 900 homes, all crafted with contemporary designs and high-end finishes, providing residents with both comfort and elegance. Amenities Residents of Astor Creek Golf & Country Club enjoy an array of top-tier amenities, including: Clubhouse : The 1566 Club, which includes dining rooms, a bar, a golf shop, men’s and women’s locker rooms, and a state-of-the-art fitness center. Outdoor Pool : A stunning resort-style pool with cabanas for ultimate relaxation. Sports Courts : Tennis, pickleball, bocce, and basketball courts are available for all sports enthusiasts. Golf Course : A signature 18-hole golf course featuring forgiving fairways and a playable landscape, perfect for golfers of all skill levels. Practice Facilities : A 15-acre grass driving range, a 3-acre short game complex, and a 15,000 sq. ft. practice putting green Lifestyle and Activities Astor Creek fosters a vibrant community atmosphere with numerous activities and social events throughout the year. Whether you enjoy golfing, swimming, fitness classes, or social gatherings, there’s always something to do. The community also hosts tournaments and outings, making it a perfect place for both relaxation and active living. Location and Accessibility Located conveniently near I-95 and Florida’s Turnpike, Astor Creek provides easy access to the Treasure Coast’s best shopping, dining, and recreational options. The community is just 25 minutes from the beach and 40 minutes north of the Palm Beaches, offering residents both tranquility and convenience. Homes and Real Estate Astor Creek features a variety of luxurious homes with options for 2 to 6 bedrooms. The homes are designed with open floor plans, spacious family kitchens, and large windows that bring in plenty of natural light. Many models include flex rooms, ideal for home offices or playrooms, and second-floor bonus rooms that can be customized as home gyms, extra bedrooms, or in-law suites. Here are some of the popular models: Jordan : 2,732 Total Sq. Ft., 2 Bedroom (up to 4 Bedroom), Flex Room, 2 Bath, Great Room, 2-Car Garage. Starting Price $506,990. Katherine : 2,753 Total Sq. Ft., 3 Bedroom (up to 4 Bedroom), Flex Room, 2 Full and 1 Half Bath, Great Room, 2-Car Garage. Starting Price $513,990. Leslie : 2,871 Total Sq. Ft., 3 Bedroom (up to 5 Bedroom), Flex Room, 3 Bath, Great Room, 2-Car Garage. Starting Price $539,990. Madeline : 3,023 Total Sq. Ft., 3 Bedroom (up to 4 Bedroom), Flex Room, 3 Bath, Great Room, 2-Car Garage. Starting Price $544,990. Natalie : 3,044 Total Sq. Ft., 3 Bedroom (up to 5 Bedroom), Flex Room, 3 Bath, Great Room, 2-Car Garage. Starting Price $590,990. Priscilla : 3,511 Total Sq. Ft., 3 Bedroom (up to 5 Bedroom), Flex Room, 3 Bath, Great Room, 3-Car Garage. Starting Price $621,990. Rebecca : 3,405 Total Sq. Ft., 3 Bedroom (up to 5 Bedroom), Flex Room, 3 Bath, Great Room, 2-Car Garage. Starting Price $639,990. Sophia : 3,932 Total Sq. Ft., 3 Bedroom (up to 6 Bedroom), 3 Full and 1 Half Bath, Great Room, Club Room, 3-Car Garage. Starting Price $966,990. Tori : 3,974 Total Sq. Ft., 3 Bedroom (up to 5 Bedroom), Flex Room, 3 Full and 1 Half Bath, Great Room, 3-Car Garage. Starting Price $812,990. Victoria : 4,698 Total Sq. Ft., 3 Bedroom (up to 4 Bedroom), Flex Room, 3 Full and 1 Half Bath, Great Room, 2-Car and 1-Car Split Garage. Starting Price $861,990. Waverly : 4,540 Total Sq. Ft., 3 Bedroom (up to 4 Bedroom), Flex Room, 3 Full and 1 Half Bath, Great Room, 3-Car Garage. Starting Price $869,990. Wynona : 5,401 Total Sq. Ft., 3 Bedroom (up to 6 Bedroom), 3 Full and 1 Half Bath, Great Room, Club Room, 3-Car Garage. Starting Price $966,990. Xena : 5,526 Total Sq. Ft., 4 Bedroom (up to 6 Bedroom), 4 Full and 1 Half Bath, Great Room, Club Room, 3-Car and 1-Car Split Garage. Starting Price $987,990. Zara : 5,814 Total Sq. Ft., 4 Bedroom (up to 6 Bedroom), 4 Full and 1 Half Bath, Great Room, Club Room, 4-Car Split Garage. Starting Price $1,030,990 ( Kolter Homes ) ( New Home Source ) ( PrivateCommunities ) . Plan a Visit to Astor Creek Step into the luxurious lifestyle of Astor Creek Golf & Country Club by planning a visit. Explore the beautifully designed homes and world-class amenities that make this community truly exceptional. To schedule your tour or to explore similar new construction communities, contact us at 305-342-7413 or email [email protected] . HOA Fees As of April 2024, the HOA fees in Astor Creek range from $260 to $280 per month. These fees cover a variety of services and amenities that help maintain the community’s high standards. For specific information on the current HOA fees, please get in touch with our team. ASTOR CREEK GOLF & COUNTRY CLUB Astor Creek Models Zara Model at Astor Creek Golf & Country Club Rebecca Model at Astor Creek Golf & Country Club EXPLORE PORT ST LUCIE GATED COMMUNITIES VIEW HOMES FOR SALE IN PGA VERANO EXPLORE ALL HOMES WITH POOL [showcaseidx_hotsheet name=\"HEATHERWOOD\"] Discover the Rebecca Model at Astor Creek Golf & Country Club. Nearby amenities include: Local Neighborhoods: Tradition Closest Beach: Jensen Beach Closest Hospital: Cleveland Clinic Tradition Hospital Four Seasons at Wylder Model Homes Four Seasons at Wylder Model Homes Taylor Kelly Franklin Morse Astaire Stanwyck Bogart Carver Bell New Construction Port St Lucie New Construction in Port St Lucie Four Seasons at Wylder Port St Lucie Guide Port St Lucie Guide Port St. Lucie Florida Map Hospitals in Port St. Lucie Things to Do in Port St. Lucie Port St. Lucie Neighborhood Map Restaurants in Port St. Lucie Port St. Lucie Weather Beaches Near Port St. Lucie Mortgage Calculator Schedule a Consultation or Property Tour Sign Up Free Home Valuation Mortgage Calculator Schedule a Consultation or Property Tour Sign Up Free Home Valuation DASHIL \"DASH\" HERNANDEZ License #: SL3605300 Dash Hernandez Privacy Terms of Use ✕ FREE DIGITAL GUIDE Discover Four Seasons at Wylder The most comprehensive 55+ community guide for Port St. Lucie. Floorplans, amenities, exclusive tips & more—yours instantly. I consent to be contacted for this request. ⬇️ Get My Free Guide 🎉 Thank you! Your guide is on its way. Four Seasons at Wylder Floor Plans Spring Lake IV by K. Hovnanian Bell by K. Hovnanian Taylor by K. Hovnanian Kelly by K. Hovnanian Franklin by K. Hovnanian Morse by K. Hovnanian Astaire by K. Hovnanian Stanwyck by K. Hovnanian Bogart by K. Hovnanian Carver by K. Hovnanian Why Wylder Amenities & Lifestyle Gallery FAQ HOA fees Blog Video Tour Schedule a Tour Realtors Floorplans Four Seasons at Wylder Floor Plans Spring Lake IV by K. Hovnanian Bell by K. Hovnanian Taylor by K. Hovnanian Kelly by K. Hovnanian Franklin by K. Hovnanian Morse by K. Hovnanian Astaire by K. Hovnanian Stanwyck by K. Hovnanian Bogart by K. Hovnanian Carver by K. Hovnanian Why Wylder Amenities & Lifestyle Gallery FAQ HOA fees Blog Video Tour Schedule a Tour Realtors Floorplans"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/the-woodlands-country-club/our-story/our-team",
      "text": "Meet Our Dedicated Team | The Woodlands Country Club, TX × Thank you for visiting our site. Please review our Privacy Policy . We use cookies on our site and collect other information pursuant to our Privacy Policy. By continuing to use our site, you consent to our Privacy Policy and data collection practices. OK Skip to Content Calendar Opens in new tab Member Login Find A Club Opens in new tab Careers The Woodlands Country Club Main Site Navigation Our Story Golf Amenities Membership Host An Event Join Now Host Event Contact Us Contact Us Login - Opens in new tab Menu Our Story Our Team Calendar Directions & Hours Golf The Refinery Insperity Invitational Lessons & Programs Tournament Course Player Course North Course West Course Palmer Course King General Deacon Amenities Racquet Sports Dining Blu Pool Fitness Membership Host An Event Tournaments & Outings Weddings Events Meetings & Corporate Event Rooms Contact Us Calendar Opens in new tab Member Login Find A Club Opens in new tab Careers Login - Opens in new tab Home Our Story Our Team Our Story Calendar Directions & Hours Meet Our Amazing Team David Sizelove Regional Manager Contact Me David.Sizelove Contact Me + Close David Sizelove information modal David Sizelove Regional Manager Serving since 2023 David.Sizelove David.Sizelove Contact Me Contact Me Menno Ozinga General Manager | Palmer Contact Me Menno.Ozinga Contact Me + Close Menno Ozinga information modal Menno Ozinga General Manager | Palmer Serving since 2023 Menno.Ozinga Menno.Ozinga Contact Me Contact Me Robin Kremen General Manager | The Trails Contact Me Robin.Kremen Contact Me About Robin + Close Robin Kremen information modal Robin Kremen General Manager | The Trails Serving since 2015 Robin.Kremen Robin.Kremen Contact Me About Robin Born in New Jersey. Moved to Houston in October 80Graduated Culinary Institute of America. Worked at Cellar in Sky World Trade Center, Sheraton Corporation, Junior League of Houston, Bon Appetite, Lakeside Country Club and Bay Oaks Country Club.Over Thirty years in Food Service13years as a Invited Employee.Team member Texas Chefs Association George W Bush Presidential inauguration reception, Economic Summit Rice University.Culinary Institute of America – Culinary Team Member25 years as a member Houston Livestock Show & Rodeo, Chairman 2 timeWife Tracy, son Gregory, Daughter ElizabethStarted at the Woodlands CC in February Contact Me Jesse Regalado Club Manager | Tournament Contact Me Jesse.Regalado Contact Me + Close Jesse Regalado information modal Jesse Regalado Club Manager | Tournament Serving since 2022 Jesse.Regalado Jesse.Regalado Contact Me Contact Me Amber Sickafoose Membership Director Contact Me 281-845-4886 Amber.Sickafoose Contact Me About Amber + Close Amber Sickafoose information modal Amber Sickafoose Membership Director Serving since 2010 281-845-4886 Amber.Sickafoose 281-845-4886 Amber.Sickafoose Contact Me About Amber Amber holds a BS degree in Marketing from Bellevue University. She started her career as a Director of Marketing for a financial company but quickly decided that sales was her real passion. Her golf career began in 2009 for The Woodlands Country Club as a membership director for both The Oaks and Panther Trail courses as well as The Woodlands Country Club courses. She is a very active member in the community and a graduate of Leadership Montgomery County class of 2013. Contact Me Jason Lippy Membership Director Contact Me 832-810-5876 Jason.Lippy Contact Me About Jason + Close Jason Lippy information modal Jason Lippy Membership Director Serving since 2015 832-810-5876 Jason.Lippy 832-810-5876 Jason.Lippy Contact Me About Jason Jason comes to Indian Wells Country Club by way of Desert Falls Country Club in Palm Desert, where he spent the four years as General Manager / Membership Director. Before moving to California in 2015, Jason spent the previous 12 years working as General Manager / Membership Director for Glen Oaks Country Club, a Invited Affiliate Club in Louisville, Kentucky. \n\nJason has worked in the golf business his entire career, starting in the Golf Shop at The Polo Fields Country Club when he was only 16.  He then moved to Glenmary Country Club to join the Membership Sales Department. Eventually becoming Club Manager at Glenmary Country Club.  Jason is a graduate of Western Kentucky University’s Broadcasting Department and has also worked covering college basketball and football for ESPN.  Jason’s interests include playing golf, spending time with his wife and eight year old daughter exploring the Coachella Valley. Contact Me Mitchell Putnam Membership Director Contact Me 832-810-5872 Mitchell.Putnam Contact Me About Mitchell + Close Mitchell Putnam information modal Mitchell Putnam Membership Director Serving since 2014 832-810-5872 Mitchell.Putnam 832-810-5872 Mitchell.Putnam Contact Me About Mitchell Email:  Mitchell.Putnam@clubcorp.comMitchell holds a BS degree in Criminal Justice from Sam Houston State University. He was born and raised in Houston Texas. He joined the Invited family as Service Captain at Willow Creek Golf Club in 2014, eventually becoming the Membership Director in 2017. He joined The Golf Trails of The Woodlands team in 2018 as the Membership Director. He enjoys playing golf, fishing, and watching Houston sports teams play. Contact Me Annemarie McKay Event Sales Director Contact Me 281-801-4103 Annemarie.Mckay Contact Me About Annemarie + Close Annemarie McKay information modal Annemarie McKay Event Sales Director Serving since 2015 281-801-4103 Annemarie.McKay 281-801-4103 Annemarie.McKay Contact Me About Annemarie Annemarie is originally from Allen, Tx. She holds a Bachelor’s degree in Hospitality Administration from Stephen F. Austin State University, located in the small town of Nacogdoches, Texas. Annemarie started her career with Invited as a college intern at Stonebriar Country Club in Frisco, Tx. After she graduated, she was hired on fulltime as their Private Event Coordinator assisting with corporate and social events. Annemarie then moved forward in here career and stepped into the role of Private Event Manager at the Las Colinas Country Club in Irving, Tx. There she continued to build her range of events and added Golf Tournaments to her portfolio. She had the privilege of working on events such as George W. Bush Presidential Center’s Warrior Open and the 2015 Volunteers of America North Texas LPGA Shootout. Annemarie recently moved to Houston to further pursue her passion for private events and is proud to call the Woodlands Country Club home, as their Private Event Director. Contact Me Brooke Tyler Event Sales Director Contact Me 281-339-8085 Brooke.Tyler Contact Me About Brooke + Close Brooke Tyler information modal Brooke Tyler Event Sales Director Serving since 2009 281-339-8085 Brooke.Tyler 281-339-8085 Brooke.Tyler Contact Me About Brooke Brooke Tyler is a graduate of The University of Texas at Arlington with a degree in Public Relations. She moved to the Houston Area in 2004 where she started her career in the hospitality industry. She worked for Marriott International for five years as an Event Manager planning various events ranging from corporate, social, to weddings. She began her career at The Woodlands Country Club in 2009 as an Event Manager where she planned Member Events, Member Association Events and Golf Tournaments. In 2012, she took over the Private Event Manager role where she focused on selling and executing all private events for The Woodlands Country Club. She has had the pleasure of working with many members, clients and brides to successfully implement their event. Some of her most favorite memories have been made at The Country Club. She has made some of her closest friendships while working here, as well as meeting her husband, Wes. Contact Me Andrea Schaefer Event Sales Coordinator Contact Me Andrea.Schaefer Contact Me + Close Andrea Schaefer information modal Andrea Schaefer Event Sales Coordinator Serving since 2024 Andrea.Schaefer Andrea.Schaefer Contact Me Contact Me Close Contact form for technical problems modal Contact form for technical problems. Report A Technical Problem Page URL Technical Problem* Submit Our Story Golf Amenities Membership Host An Event Contact Us THE WOODLANDS COUNTRY CLUB Opens in new window 100 Grand Fairway The Woodlands, TX \r\n                                77381 1 281-863-1400 ClubCorp on facebook ClubCorp on instagram Privacy Policy Terms of Use Invited Clubs ClubLine Investors Technical Problems? © 2025 Invited (ClubCorp) All Rights Reserved."
    },
    {
      "url": "https://www.thehubergroup.com/port-saint-lucie/port-st-lucie-gated-communities/astor-creek-golf-country-club-taylor-morrison/",
      "text": "Astor Creek Golf & Country Cub | New Homes Port St Lucie, FL | Taylor Morrison Home Port St. Lucie Selling Buying Featured Listings What's My Home Worth? Meet the Team Reviews Blog Contact Us 772-301-8524 Login (772) 301-8524 Sign in to your account Email Phone Number Need to reset your phone number? Log In Your browser does not support iframes. Don't have an account with us? Click here to sign up. Astor Creek Golf & Country Club City All Atlantis Boca Raton Boynton Beach Coconut Creek Cooper City Coral Gables Coral Springs Dania Beach Davie Deerfield Beach Doral Fort Lauderdale Fort Pierce Greenacres Hialeah Hobe Sound Hollywood Homestead Hutchinson Island Jensen Beach Jupiter Jupiter Inlet Colony Key Largo Key West Lake Worth Lauderdale Lakes Lighthouse Point Loxahatchee Margate Melbourne Miami Miami Beach Miami Gardens Miami Lakes Miramar North Miami North Palm Beach Okeechobee Palm Bay Palm Beach Palm Beach Gardens Palm City Palm Springs Parkland Pembroke Pines Plantation Pompano Beach Port St. Lucie Riviera Beach Royal Palm Beach Saint Lucie West Sebastian Sewalls Point Southwest Ranches Stuart Sunrise Tamarac Vero Beach Wellington West Palm Beach Weston Development Name All Aero Acres Aspire At Hawks Ridg Aspire At Port St. L Astor Creek Ballantrae Golf And Bayshore Heights Becker Ridge Bedford Park Bedford Park At Trad Bedford Park In Trad Belmont Belterra Brystol At Wydler Brystol At Wylder Building Factor Llc Cadence Camelot Gardens Canal Pointe Cascades Cascades At Slw Cascades At St Lucie Cascades At St. Luci Castle Pines Castle Pines Condomi Central Park Clubside Clubside At Pga Vill Copper Creek Country Club  Estate Country Club Estates County Club Estates Cresswind At Pga Ver Cresswind/Pga Verano Crosstown Commons Del Webb Del Webb At Traditio Del Webb At Traditti Divosta At Tradition East Lake Village Emery Emery At Tradition Esplanade At Tradit Esplanade At Traditi Fairway Isles/Countr Fieldstone Floresta Gardens Four Seasons At Wyld Gatlin Gatlin/Savona Area Glynlea Country Club Golf Village Golf Villas Ii Hammock Cove Hammock Park Heatherwood Aka St L Heritage Oaks Heritage Oaks At Tra Heron Preserve Heron Preserve At Tr Hidden Oaks Holiday Builder Island Of Ravello Islands Of Ravello Isle Of Madeira Isle Of Madeira In T K. Hovnanian's Four Kings Isle Kings Isle - Isle Of Kings Isle, Isle Of Kings Isle/Isle Of C Kings Isle/Isle Of T La Buona Vita Lake Charles Lake Charles Phase 3 Lake Forest Lake Forest At St. L Lake Forest In St. L Lake Lucie Estates Lake Park Lake Park At Traditi Lakeforest Pointe Lakepark Lakepark At Townpark Lakepark At Traditio Lakes At Tradition Lakeside At The Lake Las Palmas Looks Like New!!! Lyngate Magnolia Lakes Manderlie Manderlie At Traditi Marrita Reserve Marsh Landing Midport Place Midport Place 1 Midport Place I Midport Place Ii Mosaic Motor Coach Resort Motor Coach Resorts Motorcoach Resort St Muirfield N N/A Newport Isles Newport Village Oak Hammock On The C-24 Canal Outdoor Resort Outdoor Resorts At S Palm Trails Parks Edge Parks Edge Poa Pga Pga Perfect Drive Go Pga The Reserve: Kin Pga Verano Pga Village Pga Village (Kingsmi Pga Village Verano Pga Village, Pinehur Pga Village/Cypress Pga Village/Spyglass Pine Trace Port Saint Lucie Port St Lucie Port St Lucie - Sect Port St Lucie Sec-41 Port St Lucie Sectio Port St. Lucie Port St. Lucie Secti Promenade Psl Psl Sec 13 Psl Sec 27 Psl Sec 48 Rainier Lakes Rivella River Park River Place River Place On The S River Vista Rivergreen Villas Riverland Riverland Valencia C Riverland Valencia G Riverland Valencia W Rosser Reserve Saint Lucie West Sanctuary At Sawgras Sandpiper Sandpiper Bay Savanna Club Savanna Club 55+ Sawgrass Lakes South Port St Lucie Southbend Southbend Lakes Spanish Lake Golf Vi Spanish Lake River F Spanish Lakes Spanish Lakes 1 Spanish Lakes Commun Spanish Lakes Golf Spanish Lakes Golf V Spanish Lakes Leaseh Spanish Lakes One Spanish Lakes One  5 Spanish Lakes One Le Spanish Lakes River Spanish Lakes Riverf St Andrews Townhomes St James Golf Club St Lucie Gardens Stockton Sun Terrace Telaro Telaro At Southern G Tesoro Tesoro Club Tesoro Preserve The Anchorage The Belmont The Belmont At St Lu The Club At St Lucie The Esplanade At Tra The Estates The Estates At Tradi The Estates At Windy The Estates Of Windy The Fountains The Lakes The Lakes At St Luci The Lakes At St. Luc The Lakes At Traditi The Preserve At St A The Preserve At St. The Preserve At The The Preserves At Tra The Vineyards The Vinyards Torino Town Park Town Park At Traditi Town Park, Stockton Townpark Townpark At Traditio Townpark Tradition Tradition Tradition Bedford Pa Tropical East Valencia Cay Valencia Cay At Rive Valencia Cay/Riverla Valencia Grove Valencia Grove At Ri Valencia Grove/River Valencia Parc At Riv Valencia Walk @ Rive Valencia Walk At Riv Veranao Veranda Gardens Veranda Landing Veranda Landings Veranda Oaks Veranda Preserve Verano Verano (Pga Village) Verano Pga Verano South Victoria Parc Victoria Parc At Tra Victoria Parc Manors Vikings Landing Villas Of Sandpiper Vineyards Vineyards Of St Luci Viscaya Falls Visconti Vista St Lucie Vista St Lucie Condo Vista St. Lucie Vitalia Vitalia At Tradition Vitalia Community Vizcaya Falls Vizcaya Falls Plat 3 Winterlakes Woodland Trails Wylder Wynne Bldg Price No Limit $50,000 $100,000 $150,000 $200,000 $250,000 $300,000 $350,000 $400,000 $450,000 $500,000 $550,000 $600,000 $650,000 $700,000 $750,000 $800,000 $850,000 $900,000 $950,000 $1 Million $1.5 Million $2 Million $2.5 Million $3 Million $3.5 Million $4 Million $4.5 Million $5 Million $6 Million $7 Million TO Max List Price No Limit $50,000 $100,000 $150,000 $200,000 $250,000 $300,000 $350,000 $400,000 $450,000 $500,000 $550,000 $600,000 $650,000 $700,000 $750,000 $800,000 $850,000 $900,000 $950,000 $1 Million $1.5 Million $2 Million $2.5 Million $3 Million $3.5 Million $4 Million $4.5 Million $5 Million $6 Million $7 Million Beds Any 1+ 2+ 3+ 4+ 5+ 6+ Baths Any 1+ 2+ 3+ 4+ 5+ 6+ Property Type Home Condo Townhouse Advanced Search Address Search Astor Creek Golf & Country Club - Taylor Morrison Coming soon to Astor Creek Golf & Country Club in Port St. Lucie, Florida, are new homes by Taylor Morrison. Located west of I-95, north of Tradition, this luxurious gated community features an 18-hole golf course designed by Chris Wylczynski, as well as a premier clubhouse with a restaurant and bar. Additionally, amenities will include a state of the art fitness center, powered by E-Gym, pickleball, tennis, resort-style pool and more. Astor Creek is planned to have about 900 homesites with single family homes located on more private landscape views, water and golf course views. In addition to Kolter Homes offering personalized floor plans with over 40 structural options, Taylor Morrison will bring single-story floor plans with 150 homesites, also offering unique designs and selections to add to this luxurious golf course community. Taylor Morrison is a national home builder and more locally known for its Esplanade brand in the 55+ community Esplanade at Tradition . The 18-hole hole championship golf course is currently open offering annual memberships to non-residents and included memberships to Astor Creek residents with full family golf privileges. Members also have access to to the golf shop, 15-acre grass driving range, 3-acre short game complex, and a 15,000 sq. ft. practice putting green. Homes prices to be determined. View models available at Astor Creek by Taylor Morrison Join the Interest List! If you are interested in similar communities or new construction communities starting now, contact us at 772-301-8524. Explore Port St Lucie Gated Communities Learn about Glynlea Golf & Country Club View Homes For Sale in PGA Verano Move-In Ready Homes Available For Sale at Astor Creek Golf & Country Club, but are not listed below on the MLS. Contact us at 772-301-8524 for a list of inventory and current incentives! Astor Creek Golf & Country Club Homes For Sale 9155 SW Shinnecock Drive, Port St. Lucie — Astor Creek $979,990 ▼ **NEW CONSTRUCTION **This home offers golf course views and has 3 Bedroom, a Study, 3 full and 1 half Bath, and a 3-car Garage. The gourmet Island kitchen features genero... 3 Beds 4 Baths R11111955 MLS Astor Creek Bldg. 9187 SW Shinnecock Drive, Port St. Lucie — Astor Creek $1,549,990 ▼ **New Construction** Introducing The Zara move-in ready home in the exclusive Astor Creek Golf and Country Club, offering the ultimate in upscale living and serene golf c... 4 Beds 5 Baths R11102829 MLS Astor Creek Bldg. 13129 SW Shinnecock Drive, Port St. Lucie — Astor Creek $689,900 Welcome to 13129 SW Shinnecock Drive, a stunning 2024-built extended ''Jordan'' model by Kolter Homes, nestled in the highly sought-after Astor Creek Golf & Country Club.... 2 Beds 2 Baths R11099795 MLS Astor Creek Bldg. 13352 SW Shinnecock Drive, Port St. Lucie — Astor Creek $985,990 NEW CONSTRUCTION''*MOVE IN READY-Astor Creek Golf and Country Club* This Victoria home is situated on an oversized homesite with over 70' of backyard space, giving plenty... 3 Beds 4 Baths R11077121 MLS Astor Creek Bldg. 13264 SW Shinnecock Drive, Port St. Lucie — Astor Creek $634,315 ***MOVE IN READY ***This 3-Bedroom layout is designed for maximum livability with a variety of personalization options. For those who love to host, the island Kitchen-fro... 3 Beds 3 Baths R11064792 MLS Astor Creek Bldg. 13144 SW Shinnecock Drive, Port St. Lucie — Astor Creek $655,460 The Madeline is a beautifully designed single-story, 3-bedroom home. The island kitchen is centrally located connecting the great room, dining area, and flex space, makin... 3 Beds 3 Baths R11057884 MLS Astor Creek Bldg. 9312 SW Bethpage Way, Port St. Lucie — Astor Creek Golf & C $1,003,200 Entered for statistical purposes 3 Beds 5 Baths R11004794 MLS Astor Creek Golf & C Bldg. 9163 SW Shinnecock Drive, Port St. Lucie — Astor Creek $800,000 *MOVE IN READY** GOLF COURSE COMMUNITY. This 3 Bedroom home boasts stunning golf course views and features a Study, 3 Bath, and a 3-car Garage. The centrally located Isla... 3 Beds 3 Baths R11001266 MLS Astor Creek Bldg. 13288 SW Shinnecock Drive, Port St. Lucie — Astor Creek $636,280 **New Construction. Move-in Ready** This stone-front home features 3 Bedroom, a Study, 3 Bath, and a 2-car side-load Garage. The Island Kitchen offers lots of space for f... 3 Beds 3 Baths R11001180 MLS Astor Creek Bldg. 13137 SW Shinnecock Drive, Port St. Lucie — Astor Creek $715,000 *MOVE IN READY** GOLF COURSE COMMUNITY. This single-story 3 Bedroom, 3 Bath Leslie floor plan with chef centrally located Kitchen, an island overlooking the Great Room an... 3 Beds 3 Baths R11000028 MLS Astor Creek Bldg. 9217 SW Bethpage Way, Port St. Lucie — Astor Creek $838,135 Entertainers love the Riley for its spacious open layout that accommodates gatherings of any size. The home welcomes in the natural light through its many large windows o... 4 Beds 4 Baths R10938893 MLS Astor Creek Bldg. 9240 SW Bethpage Way, Port St. Lucie — Astor Creek $1,263,795 Style and grandeur await in this 3 bedroom, 3 Full Bath and Half Bath home. Upon entry, the foyer welcomes you into the Dining and Great Room, a vestibule leads to the gu... 3 Beds 4 Baths R10935664 MLS Astor Creek Bldg. 9233 SW Bethpage Way, Port St. Lucie — Astor Creek $1,087,840 Style and grandeur await in this Whitney, 3 Bedroom, 3 Full and 1 Half Bath Home. Upon entry into the home, the Foyer welcomes guest into the Dining and Great Room. Just ... 3 Beds 4 Baths R10938895 MLS Astor Creek Bldg. 9216 SW Bethpage Way, Port St. Lucie — Astor Creek $950,000 * MOVE IN READY-GATED GOLF COURSE COMMUNITY* This welcoming courtyard home is thoughtfully designed with the Great Room as the center of the home. The western exposure go... 3 Beds 4 Baths R10938993 MLS Astor Creek Bldg. 13129 SW Shinnecock Drive, Port St. Lucie — Astor Creek $665,000 Model photos used for reference. Live the Country Club Lifestyle in Astor Creek Golf & Country Club. This double lake golf view western exposure Jordan features 2 Bedroom... 2 Beds 2 Baths R10985284 MLS Astor Creek Bldg. 9209 SW Bethpage Way, Port St. Lucie — Astor Creek $930,000 *Move in Ready* Live the Country Club Lifestyle at Astor Creek Golf and Country Club. This corner homesite with an east-facing garden view complete with 3 Bedroom, a Fitn... 3 Beds 4 Baths R10985198 MLS Astor Creek Bldg. 13296 SW Shinnecock Drive, Port St. Lucie — Astor Creek $669,010 Model photos used for reference. Live the country club lifestyle in Astor Creek Golf & Country Club. This home features 3 Bedrooms, 3 Full Bath, Study and a 2-car Garage.... 3 Beds 3 Baths R10985229 MLS Astor Creek Bldg. 9225 SW Bethpage Way, Port St. Lucie — Astor Creek $790,000 **MOVE IN READY**  The Kitchen is beautifully designed with 42'' upgraded white shaker cabinets with crown moulding, dark navy tile backsplash, quartz countertops with da... 3 Beds 4 Baths R10930238 MLS Astor Creek Bldg. 9232 SW Bethpage Way, Port St. Lucie — Astor Creek $868,490 **MOVE IN READY** GOLF COURSE COMMUNITY. This Priscilla floor plan is situated on an oversized homesite on the 9th fairway with beautiful golf course views. Home features... 3 Beds 3 Baths R10930235 MLS Astor Creek Bldg. 9208 SW Bethpage Way, Port St. Lucie — Astor Creek $899,000 *Move in Ready* Gated Community in Astor Creek Golf and Country Club, Kolter Homes newest community on the Treasure Coast. This home is situated on a corner homesite with... 3 Beds 4 Baths R10938916 MLS Astor Creek Bldg. Like or Share Loading likes... Share on Facebook Share on X (Twitter) Share on LinkedIn Address Search Treasure Coast Real Estate Port Saint Lucie Jensen Beach Palm City Stuart Hutchinson Island Vero Beach 55+ Communities in Port St. Lucie ALL 55+ Communities Valencia Parc Valencia Walk Catalina Palms at Sundance Riverland Telaro at Tradition Esplanade at Tradition Del Webb Four Seasons at Wylder Valencia Cay LakePark Vitalia Kings Isle Cascades Cresswind at PGA Verano Veranda Preserve Port Saint Lucie Homes By Community Seville at Tradition Tradition New Mattamy Homes Astor Creek Golf & Country Club Central Park PGA Verano Belterra Kenley at Tradition Cadence at Tradition Glynlea Golf & Country Glub PGA Village Sundance Azalea Wylder Veranda Oaks Mosaic Newfield Palm City Avila Willow Lakes Veranda Gardens Tradition Port St Lucie Manderlie by Mattamy Emery Crosstown Commons Copper Creek Lake Charles Lake Forest Heatherwood The Vineyards Magnolia Lakes Heritage Oaks Tradition Bedford Park Heron Preserve TownPark Victoria Parc Estates at Tradition Preserves at Tradition The Lakes at Tradition St. James Golf Club Country Club Estates St Andrews Preserve Rivella Ballantrae Sawgrass Lakes Windy Pines Tesoro Club Rosette Park - Newfield Port St. Lucie New Construction Homes New Construction Homes New Construction Communities New Construction Golf Communities New Construction 55+ Communities New Construction Homes NO HOA Golf Communities Port St Lucie Port St. Lucie Pool Homes Port St. Lucie Homes with NO HOA Mortgage Calculator Amount of Loan Annual Interest Rate % Term of Loan Years Calculate Does not include any taxes or fees. Please consult a financial professional. Popular Market Reports Jensen Beach Palm City Port Saint Lucie Hutchinson Island Recent Real Estate Tips Posts What is a home appraisal? Real Estate Tips Homes For Sale by Zip Code Port St Lucie Homes For Sale in 34953 Homes For Sale in 34987 Homes For Sale in 34952 Homes For Sale in 34983 Homes For Sale in 34984 Homes For Sale in 34986 Additional Navigation Home Advanced Search Selling Buying Meet the Team Blog Featured Properties Contact Us 772-800-6621 Huber Real Estate Group of Florida Office: 772-800-6621 Mobile: 772-301-8524 Email: stephanie@thehubergroup.com © All Rights Reserved | Privacy Policy Jensen Beach Palm City Stuart Port Saint Lucie Vero Beach IDX Real Estate Websites by • Accessibility • Terms • Privacy"
    },
    {
      "url": "https://www.thehubergroup.com/port-saint-lucie/port-st-lucie-gated-communities/astor-creek-golf-country-club-kolter-homes/",
      "text": "Astor Creek Golf & Country CLub | Port St Lucie Homes For Sale | Kolter Homes Home Port St. Lucie Selling Buying Featured Listings What's My Home Worth? Meet the Team Reviews Blog Contact Us 772-301-8524 Login (772) 301-8524 Sign in to your account Email Phone Number Need to reset your phone number? Log In Your browser does not support iframes. Don't have an account with us? Click here to sign up. Astor Creek Port St Lucie Home Search City All Atlantis Boca Raton Boynton Beach Coconut Creek Cooper City Coral Gables Coral Springs Dania Beach Davie Deerfield Beach Doral Fort Lauderdale Fort Pierce Greenacres Hialeah Hobe Sound Hollywood Homestead Hutchinson Island Jensen Beach Jupiter Jupiter Inlet Colony Key Largo Key West Lake Worth Lauderdale Lakes Lighthouse Point Loxahatchee Margate Melbourne Miami Miami Beach Miami Gardens Miami Lakes Miramar North Miami North Palm Beach Okeechobee Palm Bay Palm Beach Palm Beach Gardens Palm City Palm Springs Parkland Pembroke Pines Plantation Pompano Beach Port St. Lucie Riviera Beach Royal Palm Beach Saint Lucie West Sebastian Sewalls Point Southwest Ranches Stuart Sunrise Tamarac Vero Beach Wellington West Palm Beach Weston Development Name All Aero Acres Aspire At Hawks Ridg Aspire At Port St. L Astor Creek Ballantrae Golf And Bayshore Heights Becker Ridge Bedford Park Bedford Park At Trad Bedford Park In Trad Belmont Belterra Brystol At Wydler Brystol At Wylder Building Factor Llc Cadence Camelot Gardens Canal Pointe Cascades Cascades At Slw Cascades At St Lucie Cascades At St. Luci Castle Pines Castle Pines Condomi Central Park Clubside Clubside At Pga Vill Copper Creek Country Club  Estate Country Club Estates County Club Estates Cresswind At Pga Ver Cresswind/Pga Verano Crosstown Commons Del Webb Del Webb At Traditio Del Webb At Traditti Divosta At Tradition East Lake Village Emery Emery At Tradition Esplanade At Tradit Esplanade At Traditi Fairway Isles/Countr Fieldstone Floresta Gardens Four Seasons At Wyld Gatlin Gatlin/Savona Area Glynlea Country Club Golf Village Golf Villas Ii Hammock Cove Hammock Park Heatherwood Aka St L Heritage Oaks Heritage Oaks At Tra Heron Preserve Heron Preserve At Tr Hidden Oaks Holiday Builder Island Of Ravello Islands Of Ravello Isle Of Madeira Isle Of Madeira In T K. Hovnanian's Four Kings Isle Kings Isle - Isle Of Kings Isle, Isle Of Kings Isle/Isle Of C Kings Isle/Isle Of T La Buona Vita Lake Charles Lake Charles Phase 3 Lake Forest Lake Forest At St. L Lake Forest In St. L Lake Lucie Estates Lake Park Lake Park At Traditi Lakeforest Pointe Lakepark Lakepark At Townpark Lakepark At Traditio Lakes At Tradition Lakeside At The Lake Las Palmas Looks Like New!!! Lyngate Magnolia Lakes Manderlie Manderlie At Traditi Marrita Reserve Marsh Landing Midport Place Midport Place 1 Midport Place I Midport Place Ii Mosaic Motor Coach Resort Motor Coach Resorts Motorcoach Resort St Muirfield N N/A Newport Isles Newport Village Oak Hammock On The C-24 Canal Outdoor Resort Outdoor Resorts At S Palm Trails Parks Edge Parks Edge Poa Pga Pga Perfect Drive Go Pga The Reserve: Kin Pga Verano Pga Village Pga Village (Kingsmi Pga Village Verano Pga Village, Pinehur Pga Village/Cypress Pga Village/Spyglass Pine Trace Port Saint Lucie Port St Lucie Port St Lucie - Sect Port St Lucie Sec-41 Port St Lucie Sectio Port St. Lucie Port St. Lucie Secti Promenade Psl Psl Sec 13 Psl Sec 27 Psl Sec 48 Rainier Lakes Rivella River Park River Place River Place On The S River Vista Rivergreen Villas Riverland Riverland Valencia C Riverland Valencia G Riverland Valencia W Rosser Reserve Saint Lucie West Sanctuary At Sawgras Sandpiper Sandpiper Bay Savanna Club Savanna Club 55+ Sawgrass Lakes South Port St Lucie Southbend Southbend Lakes Spanish Lake Golf Vi Spanish Lake River F Spanish Lakes Spanish Lakes 1 Spanish Lakes Commun Spanish Lakes Golf Spanish Lakes Golf V Spanish Lakes Leaseh Spanish Lakes One Spanish Lakes One  5 Spanish Lakes One Le Spanish Lakes River Spanish Lakes Riverf St Andrews Townhomes St James Golf Club St Lucie Gardens Stockton Sun Terrace Telaro Telaro At Southern G Tesoro Tesoro Club Tesoro Preserve The Anchorage The Belmont The Belmont At St Lu The Club At St Lucie The Esplanade At Tra The Estates The Estates At Tradi The Estates At Windy The Estates Of Windy The Fountains The Lakes The Lakes At St Luci The Lakes At St. Luc The Lakes At Traditi The Preserve At St A The Preserve At St. The Preserve At The The Preserves At Tra The Vineyards The Vinyards Torino Town Park Town Park At Traditi Town Park, Stockton Townpark Townpark At Traditio Townpark Tradition Tradition Tradition Bedford Pa Tropical East Valencia Cay Valencia Cay At Rive Valencia Cay/Riverla Valencia Grove Valencia Grove At Ri Valencia Grove/River Valencia Parc At Riv Valencia Walk @ Rive Valencia Walk At Riv Veranao Veranda Gardens Veranda Landing Veranda Landings Veranda Oaks Veranda Preserve Verano Verano (Pga Village) Verano Pga Verano South Victoria Parc Victoria Parc At Tra Victoria Parc Manors Vikings Landing Villas Of Sandpiper Vineyards Vineyards Of St Luci Viscaya Falls Visconti Vista St Lucie Vista St Lucie Condo Vista St. Lucie Vitalia Vitalia At Tradition Vitalia Community Vizcaya Falls Vizcaya Falls Plat 3 Winterlakes Woodland Trails Wylder Wynne Bldg Price No Limit $50,000 $100,000 $150,000 $200,000 $250,000 $300,000 $350,000 $400,000 $450,000 $500,000 $550,000 $600,000 $650,000 $700,000 $750,000 $800,000 $850,000 $900,000 $950,000 $1 Million $1.5 Million $2 Million $2.5 Million $3 Million $3.5 Million $4 Million $4.5 Million $5 Million $6 Million $7 Million TO Max List Price No Limit $50,000 $100,000 $150,000 $200,000 $250,000 $300,000 $350,000 $400,000 $450,000 $500,000 $550,000 $600,000 $650,000 $700,000 $750,000 $800,000 $850,000 $900,000 $950,000 $1 Million $1.5 Million $2 Million $2.5 Million $3 Million $3.5 Million $4 Million $4.5 Million $5 Million $6 Million $7 Million Beds Any 1+ 2+ 3+ 4+ 5+ 6+ Baths Any 1+ 2+ 3+ 4+ 5+ 6+ Property Type Home Condo Townhouse Advanced Search Address Search Astor Creek Golf & Country Club Astor Creek Golf & Country Club is an all new premier gated, golf course community located in Port St. Lucie, Florida located just west of PGA Verano, also a product of Kolter Homes. Astor Creek Port St Lucie Homes For Sale include new construction single family homes that are all one-story floor plans, with an optional second floor bonus room, situated on beautifully landscaped golf course and water views. Kolter focuses on personalization where there are over 40 structural options you can customize to fit you and your family's needs.In addition to Kolter Homes, new homes are coming soon to Astor Creek Golf & Country Club by Taylor Morrison . Currently, there is a $0 initiation fee when purchasing a home in Astor Creek with full access to the golf course, clubhouse with resort style amenities including a restaurant and bar. A lifestyle director is on site to coordinate social events along with a sports director with tennis and pickleball. The new 18-hole golf course is the first golf course community to be developed from the ground up by Kolter and designed by architect Chris Wilczynski. Residents have full family golf privileges to the golf shop, 15-acre grass driving range, 3-acre short game complex, and a 15,000 sq. ft. practice putting green. Memberships are available for non-residents. With a total of 682 acres, there will be roughly 900 new homes planned inside this exclusive community ranging from 2 to 6 bedrooms and 1,968 to 5,000+ living square feet. Astor Creek's clubhouse, The 1566 Club, will feature a full bar and restaurant, fitness center powered by EGYM, resort style pool, tennis, pickleball and more. Home prices start from $506,900 not including the homesite or design upgrades. Call 772-301-8524 to learn about $0 lot premiums and incentives towards upgrade options. Full Model Home Video Tours at Astor Creek If you are interested in similar communities or new construction communities starting now, contact us at 772-301-8524. Explore Port St Lucie Gated Communities Explore All Homes in Port St Lucie View Homes For Sale in PGA Verano Port St Lucie Golf Communities Move-In Ready Homes Available For Sale at Astor Creek Golf & Country Club, but are not listed below on the MLS. Contact us at 772-301-8524 for a list of inventory and current incentives! Astor Creek Golf & Country Club 9155 SW Shinnecock Drive, Port St. Lucie — Astor Creek $979,990 ▼ **NEW CONSTRUCTION **This home offers golf course views and has 3 Bedroom, a Study, 3 full and 1 half Bath, and a 3-car Garage. The gourmet Island kitchen features genero... 3 Beds 4 Baths R11111955 MLS Astor Creek Bldg. 9187 SW Shinnecock Drive, Port St. Lucie — Astor Creek $1,549,990 ▼ **New Construction** Introducing The Zara move-in ready home in the exclusive Astor Creek Golf and Country Club, offering the ultimate in upscale living and serene golf c... 4 Beds 5 Baths R11102829 MLS Astor Creek Bldg. 13129 SW Shinnecock Drive, Port St. Lucie — Astor Creek $689,900 Welcome to 13129 SW Shinnecock Drive, a stunning 2024-built extended ''Jordan'' model by Kolter Homes, nestled in the highly sought-after Astor Creek Golf & Country Club.... 2 Beds 2 Baths R11099795 MLS Astor Creek Bldg. 13352 SW Shinnecock Drive, Port St. Lucie — Astor Creek $985,990 NEW CONSTRUCTION''*MOVE IN READY-Astor Creek Golf and Country Club* This Victoria home is situated on an oversized homesite with over 70' of backyard space, giving plenty... 3 Beds 4 Baths R11077121 MLS Astor Creek Bldg. 13264 SW Shinnecock Drive, Port St. Lucie — Astor Creek $634,315 ***MOVE IN READY ***This 3-Bedroom layout is designed for maximum livability with a variety of personalization options. For those who love to host, the island Kitchen-fro... 3 Beds 3 Baths R11064792 MLS Astor Creek Bldg. 13144 SW Shinnecock Drive, Port St. Lucie — Astor Creek $655,460 The Madeline is a beautifully designed single-story, 3-bedroom home. The island kitchen is centrally located connecting the great room, dining area, and flex space, makin... 3 Beds 3 Baths R11057884 MLS Astor Creek Bldg. 9312 SW Bethpage Way, Port St. Lucie — Astor Creek Golf & C $1,003,200 Entered for statistical purposes 3 Beds 5 Baths R11004794 MLS Astor Creek Golf & C Bldg. 9163 SW Shinnecock Drive, Port St. Lucie — Astor Creek $800,000 *MOVE IN READY** GOLF COURSE COMMUNITY. This 3 Bedroom home boasts stunning golf course views and features a Study, 3 Bath, and a 3-car Garage. The centrally located Isla... 3 Beds 3 Baths R11001266 MLS Astor Creek Bldg. 13288 SW Shinnecock Drive, Port St. Lucie — Astor Creek $636,280 **New Construction. Move-in Ready** This stone-front home features 3 Bedroom, a Study, 3 Bath, and a 2-car side-load Garage. The Island Kitchen offers lots of space for f... 3 Beds 3 Baths R11001180 MLS Astor Creek Bldg. 13137 SW Shinnecock Drive, Port St. Lucie — Astor Creek $715,000 *MOVE IN READY** GOLF COURSE COMMUNITY. This single-story 3 Bedroom, 3 Bath Leslie floor plan with chef centrally located Kitchen, an island overlooking the Great Room an... 3 Beds 3 Baths R11000028 MLS Astor Creek Bldg. 9217 SW Bethpage Way, Port St. Lucie — Astor Creek $838,135 Entertainers love the Riley for its spacious open layout that accommodates gatherings of any size. The home welcomes in the natural light through its many large windows o... 4 Beds 4 Baths R10938893 MLS Astor Creek Bldg. 9240 SW Bethpage Way, Port St. Lucie — Astor Creek $1,263,795 Style and grandeur await in this 3 bedroom, 3 Full Bath and Half Bath home. Upon entry, the foyer welcomes you into the Dining and Great Room, a vestibule leads to the gu... 3 Beds 4 Baths R10935664 MLS Astor Creek Bldg. 9233 SW Bethpage Way, Port St. Lucie — Astor Creek $1,087,840 Style and grandeur await in this Whitney, 3 Bedroom, 3 Full and 1 Half Bath Home. Upon entry into the home, the Foyer welcomes guest into the Dining and Great Room. Just ... 3 Beds 4 Baths R10938895 MLS Astor Creek Bldg. 9216 SW Bethpage Way, Port St. Lucie — Astor Creek $950,000 * MOVE IN READY-GATED GOLF COURSE COMMUNITY* This welcoming courtyard home is thoughtfully designed with the Great Room as the center of the home. The western exposure go... 3 Beds 4 Baths R10938993 MLS Astor Creek Bldg. 13129 SW Shinnecock Drive, Port St. Lucie — Astor Creek $665,000 Model photos used for reference. Live the Country Club Lifestyle in Astor Creek Golf & Country Club. This double lake golf view western exposure Jordan features 2 Bedroom... 2 Beds 2 Baths R10985284 MLS Astor Creek Bldg. 9209 SW Bethpage Way, Port St. Lucie — Astor Creek $930,000 *Move in Ready* Live the Country Club Lifestyle at Astor Creek Golf and Country Club. This corner homesite with an east-facing garden view complete with 3 Bedroom, a Fitn... 3 Beds 4 Baths R10985198 MLS Astor Creek Bldg. 13296 SW Shinnecock Drive, Port St. Lucie — Astor Creek $669,010 Model photos used for reference. Live the country club lifestyle in Astor Creek Golf & Country Club. This home features 3 Bedrooms, 3 Full Bath, Study and a 2-car Garage.... 3 Beds 3 Baths R10985229 MLS Astor Creek Bldg. 9225 SW Bethpage Way, Port St. Lucie — Astor Creek $790,000 **MOVE IN READY**  The Kitchen is beautifully designed with 42'' upgraded white shaker cabinets with crown moulding, dark navy tile backsplash, quartz countertops with da... 3 Beds 4 Baths R10930238 MLS Astor Creek Bldg. 9232 SW Bethpage Way, Port St. Lucie — Astor Creek $868,490 **MOVE IN READY** GOLF COURSE COMMUNITY. This Priscilla floor plan is situated on an oversized homesite on the 9th fairway with beautiful golf course views. Home features... 3 Beds 3 Baths R10930235 MLS Astor Creek Bldg. 9208 SW Bethpage Way, Port St. Lucie — Astor Creek $899,000 *Move in Ready* Gated Community in Astor Creek Golf and Country Club, Kolter Homes newest community on the Treasure Coast. This home is situated on a corner homesite with... 3 Beds 4 Baths R10938916 MLS Astor Creek Bldg. Like or Share Loading likes... Share on Facebook Share on X (Twitter) Share on LinkedIn Address Search Astor Creek Golf & Country Club Astor Creek Homes For Sale Astor Creek Kolter Homes Astor Creek Taylor Morrison Astor Creek Kolter Model Home Tours Astor Creek Taylor Morrison Model Homes Astor Creek Home Prices & Floor Plans Astor Creek Jordan Model Astor Creek Leslie Model Astor Creek Madeline Model Astor Creek Priscilla Model Astor Creek Rebecca Model Astor Creek Sophia Model Astor Creek Tori Model Astor Creek Victoria Model Astor Creek Waverly Model Astor Creek Xena Model Astor Creek Zara Model Additional Navigation Home Advanced Search Selling Buying Meet the Team Blog Featured Properties Contact Us 772-800-6621 Huber Real Estate Group of Florida Office: 772-800-6621 Mobile: 772-301-8524 Email: stephanie@thehubergroup.com © All Rights Reserved | Privacy Policy Jensen Beach Palm City Stuart Port Saint Lucie Vero Beach IDX Real Estate Websites by • Accessibility • Terms • Privacy"
    },
    {
      "url": "https://www.kolterhomes.com/new-homes/port-st-lucie-florida-golf-astor-creek-country-club/lifestyle/membership/",
      "text": "Astor Creek Golf & Country Club Membership Astor Creek Golf & Country Club Clubhouse & Lifestyle Astor Creek Clubhouse 18-Hole Championship Course Astor Creek Membership EGYM Circuit Training Site Plan & Location Site Plan Area Video & Information Area Points of Interest Homes Jordan 2 Bedroom (up to 4 Bedroom), Flex Room, 2 Bath, Great Room, 2-Car Garage 1,968 Living Area Sq. Ft. Katherine 3 Bedroom (up to 4 Bedroom), Flex Room, 2 Full and 1 Half Bath, Great Room, 2-Car Garage 1,983 Living Area Sq. Ft. Leslie 3 Bedroom (up to 5 Bedroom), Flex Room, 3 Bath, Great Room, 2-Car Garage 2,129 Living Area Sq. Ft. Madeline 3 Bedroom (up to 4 Bedroom), Flex Room, 3 Bath, Great Room, 2-Car Garage 2,289 Living Area Sq. Ft. Natalie 3 Bedroom (up to 5 Bedroom), Flex Room, 3 Bath, Great Room, 2-Car Garage 2,323 Living Area Sq. Ft. Priscilla 3 Bedroom (up to 5 Bedroom), Flex Room, 3 Bath, Great Room, 3-Car Garage 2,490 Living Area Sq. Ft. Rebecca 3 Bedroom (up to 5 Bedroom), Flex Room, 3 Full and 1 Half Bath, Great Room, 2-Car Garage 2,586 Living Area Sq. Ft. Sophia 3 Bedroom (up to 5 Bedroom), Flex Room, 3 Full and 1 Half Bath, Great Room, 2-Car and 1-Car Split Garage 2,776 Living Area Sq. Ft. Tori 3 Bedroom (up to 5 Bedroom), Flex Room, 3 Full and 1 Half Bath, Great Room, 3-Car Garage 2,876 Living Area Sq. Ft. Victoria 3 Bedroom (up to 5 Bedroom), Flex Room, 3 Full and 1 Half Bath, Great Room, 2-Car and 1-Car Split Garage 3,224 Living Area Sq. Ft. Waverly 3 Bedroom (up to 4 Bedroom), Flex Room, 3 Full and 1 Half Bath, Great Room, 3-Car Garage 3,265 Living Area Sq. Ft. Wynona 3 Bedroom (up to 6 Bedroom) 3 Full and 1 Half Bath, Great Room, Club Room and 3-Car Garage 3,874 Living Area Sq. Ft. Xena 4 Bedroom (up to 6 Bedroom) 4 Full and 1 Half Bath, Great Room, Club Room, 3-Car and 1-Car Split Garage 3,932 Living Area Sq. Ft. Zara 4 Bedroom (up to 6 Bedroom), 4 Full and 1 Half Bath, Great Room, Club Room and 4-Car Split Garage 4,222 Living Area Sq. Ft. Photos Schedule Your Tour Membership Return to Clubhouse & Lifestyle We understand a great golf experience is as much about the people as it is the course design and conditioning. Whether a Resident or Invitational member, the Astor Creek golf membership experience is grounded in hospitality with a goal to create camaraderie. Beyond great play, a full-time Lifestyle Coordinator is focused on planning and executing social events, activities and programs that create connection between members and fun for all. For Astor Creek new home buyers, club membership is included. Resident Membership • Unlimited Family Golf Privileges as outlined in Rules & Regulations • Unlimited Driving Range, Short Game Complex and Practice Green access • 14-day Advanced Tee Time Booking • Unlimited access to all Clubhouse amenities including Fitness Center, Pool, Dining, Pickleball, Tennis and Sports Courts • Membership INCLUDED with the Purchase of a New Home Invitational Membership • Unlimited Family Golf Privileges as outlined in Rules & Regulations • Unlimited Driving Range, Short Game Complex and Practice Green access • 10-day Advanced Tee Time Booking • Clubhouse Dining • Membership requires an initial Club Contribution and Annual Dues - click here to contact the Astor Creek Director of Golf for details Schedule Your Tour Homeowner Portal Favorites Account All Communities All Move-In Ready Homes About Us The Kolter Group Trade Partners Kolter Contacts Page Mortgage Title proudly presented by: Kolter Homes All floorplans, elevations, specifications, square foot calculations, prices, amenities and product offering are subject to change without notice, errors and/or omissions. Renderings are artist's concept for illustrative purposes only and should not be relied upon when making decisions to the purchase of property. CRC057817/CGC1514916 © 2025 Kolter Homes LLC Equal Housing Opportunity facebook instagram youtube Realtor Portal Realtor Policy Kolter News Careers Kolter Hospitality Kolter Urban Privacy Policy Terms of Use Accessibility Site Map Community Home Page Clubhouse & Lifestyle Site Plan & Location Homes Photos kolterhomes.com NC - Charlotte Area Cresswind Charlotte Cresswind Wesley Chapel Handsmill on Lake Wylie Cresswind at Rocky River - OPEN 2026 SC - Charleston Area Cresswind Charleston The Ponds GA - Atlanta Area Cresswind at Spring Haven Cresswind Georgia at Twin Lakes Oak Hill Reserve AL - Gulf Coast Cresswind at Sandy Creek - OPEN 2026 FL - Panhandle NatureWalk at Watersound Origins Salt Grass at Ward Creek FL - Greater Orlando Area Cresswind at Hammock Oaks Cresswind at Lake Harris Cresswind DeLand The Reserve at Victoria FL - South Florida Artistry Palm Beach Cove at Park Trace - COMING SOON Cove Royale Cresswind Palm Beach at Westlake L'Ambiance at Avenir Esprit at Avenir - FALL 2025 FL - Port St Lucie Mosaic PGA Village Verano Rivella FL - Sarasota/Bradenton Artistry Sarasota Cresswind Lakewood Ranch Woodland Preserve Save your favorite communities, homes and home plans. Your easy, home-shopping organizer. Full Name Email Password Confirm Password Processing ... Create Already have a Favorites file? Login CALL HOMES DIRECTIONS Hi, Would you like a personalized brochure of Astor Creek Golf & Country Club ? Yes, please! No, thank you Closing this window will not prevent you from receiving a personalized brochure in the future. When you're ready, look for the \"Get your personalized brochure\" button and click it to request one. Get Your Personalized Brochure! Thank you for your interest in Astor Creek Golf & Country Club! To help us provide the most useful information possible for your new home search, please take a moment to answer a few questions. Based on your answers, a personalized PDF brochure will be built for you and a link to download it delivered to your email. Let's get started! Already have a favorites account? Great! You can log in to expedite the process and save your personalized brochure to your favorites collection. Creating an account is optional but offers the convenience of saving your personalized brochure for easy access in the future. Creating an account is not required to receive your personalized brochure. Email Password (forgot password) Login Cancel First Name Last Name E-mail Phone Preferred method of contact Choose a preferred method of contact Email Phone Call Text Message How many bedrooms are you interested in? Check all that apply 2 3 4 5 6 What is the minimum square footage you are looking for? ANY SQ. FT. 1000 sq. ft. + 1500 sq. ft. + 2000 sq. ft. + 2500 sq. ft. + 3000 sq. ft. + 3500 sq. ft. + 4000 sq. ft. + What structural and home options interest you? Check all that apply 3+ Car Garage Den/Study Great Room Island Kitchen Lanai/Outdoor Living Pool Single-story Bonus Room Move-In Ready Homes What amenities and lifestyle programs are important to you? Check all that apply Community Events Clubhouse Fitness Community Pool Golf Area - Retail | Dining | Entertainment Tennis Pickleball Pet Friendly Area - Medical Care Lifestyle Director Area – Travel | Commuting What additional resources would you like information about? Check all that apply New Home Features CTC Flyer Fly and Buy Program New vs Used Comparison Design Studio Experience Create a favorites account to save your personalized brochure for easy access and management in the future. Leave this field empty Processing ... Submit Please ensure Javascript is enabled for purposes of website accessibility"
    }
  ]
}