{
  "fuentes": [
    {
      "url": "https://www.atlantisfl.gov/facilities/facility/details/Kintz-Park-1",
      "email": "kpuhalainen@atlantisfl.gov"
    },
    {
      "url": "https://www.atlantisfl.gov/165/Police",
      "email": "mlegall@atlantisfl.gov"
    },
    {
      "url": "https://splash.org/about-us",
      "email": "bellen@splash.org"
    },
    {
      "url": "https://splash.org/about-us",
      "email": "israel@splash.org"
    },
    {
      "url": "https://splash.org/about-us",
      "email": "addisu@splash.org"
    },
    {
      "url": "https://splash.org/about-us",
      "email": "emily@splash.org"
    },
    {
      "url": "https://splash.org/about-us",
      "email": "eric@splash.org"
    },
    {
      "url": "https://splash.org/about-us",
      "email": "fiker@splash.org"
    },
    {
      "url": "https://splash.org/about-us",
      "email": "geta@splash.org"
    },
    {
      "url": "https://splash.org/about-us",
      "email": "gezahegn@splash.org"
    },
    {
      "url": "https://splash.org/about-us",
      "email": "henok@splash.org"
    },
    {
      "url": "https://splash.org/about-us",
      "email": "kaitlynn@splash.org"
    },
    {
      "url": "https://splash.org/about-us",
      "email": "megan@splash.org"
    },
    {
      "url": "https://splash.org/about-us",
      "email": "nardos@splash.org"
    },
    {
      "url": "https://www.joonsquareusa.com/water-park/kintz-park-and-splash-pad-palm-beach-fl",
      "email": "info@kintzpark.com"
    },
    {
      "url": "https://atlantisfl.gov/Facilities/Facility/Details/Kintz-Park-1",
      "email": "kpuhalainen@atlantisfl.gov"
    },
    {
      "url": "https://www.launchpadtrampolinepark.com/contactus",
      "email": "info@launchpadwv.com"
    }
  ],
  "mails": [
    "addisu@splash.org",
    "bellen@splash.org",
    "emily@splash.org",
    "eric@splash.org",
    "fiker@splash.org",
    "geta@splash.org",
    "gezahegn@splash.org",
    "henok@splash.org",
    "info@kintzpark.com",
    "info@launchpadwv.com",
    "israel@splash.org",
    "kaitlynn@splash.org",
    "kpuhalainen@atlantisfl.gov",
    "megan@splash.org",
    "mlegall@atlantisfl.gov",
    "nardos@splash.org"
  ],
  "nombre_sitio": "atlantisfl.gov",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.atlantisfl.gov/facilities/facility/details/Kintz-Park-1",
      "text": "Facilities • Kintz Park Skip to Main Content Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In Council Community Departments Boards How Do I... facebook Instagram Search Home Facilities Get Directions Google Bing Kintz Park 301 Glenbrook Drive Atlantis, FL 33462 Contact Kristen Puhalainen 561-965-1744  Ext. 0115 Hours Sunrise to sunset Rating This facility has not yet been rated. Facilities Feature Overview View all facilities Kintz Park Features ADA Accessible Meeting Rooms Parking Pavilion Picnic Tables Playground Restrooms Tennis Water Splash Pad The splash pad is operational. Monday - Thursday: 10 a.m. to 6 p.m. Friday - Sunday: 10 a.m. to 8 p.m. Courts The tennis and pickleball courts are available on a first-come basis; there is no reservation process and courts cannot be 'held.' All participants are expected to follow the posted rules. Rentals The pavilion and recreation building at Kintz Park are available to rent for your special event of eight or more people, for up to six hours. Your reservation secures only the pavilion OR building (not both); the park remains open to the public. There is only one rental event permitted per day. Fee for Atlantis residents: $100 + $100 cleaning deposit, paid separately Fee for non-residents: $500 + $100 cleaning deposit, paid separately Check date availability on the calendar on our home page. For application contact City Hall at 561-965-1744 x115 or kpuhalainen@atlantisfl.gov , The 2nd and 4th Sundays are not available for rental events. Amenities The building has a full kitchen, folding banquet tables, and chairs. The capacity of the building is 49 people with no tables and chairs set up, 37 with tables and chairs. Park Rules & Regulations Kintz Park is open dawn to dusk. Tennis/pickleball courts are open until 9 p.m . The park is open to the public. While you may receive exclusive use of either the community center building or the pavilion, we regret that we cannot grant exclusive use to all facilities. Your park reservation is for a maximum six hour period. This includes set-up and clean-up. Groups of eight or more using the park and/or anyone who wishes to use the building must make a reservation and pay the fee. The fee for residents for Friday, Saturday, and Sunday reservations is $100. The non-resident fee of $500 is valid every day. The fee is based on where the event host lives. The resident fee is available only to party host for immediate family members, child, or grandchild. All others must pay the non-resident fee. The use fee and cleaning deposit of $100 is due and payable to the City upon application. Alcoholic beverages are prohibited. Grills are not permitted. The air conditioner is set at 75 degrees Fahrenheit. It may not be changed under any circumstances. Planned activities for the event must be disclosed. Any rides or amusements brought into the park must be registered and show proper insurance with the City of Atlantis as an additional insured. No animals are allowed in the park. Failure to provide insurance certificate will result in the prohibition of the use of such facilities the day of the event. Vehicles are not permitted in the park for safety reasons. You may have your vehicle in the park for loading and unloading, but it must be legally parked outside the park for the duration of the event. Guest vehicles must be legally park for the duration of the event. Refrain from parking on lawns or in driveways of the neighboring residences. Do not block the roadway or the driveways. Clean-up is the sole responsibility of the permitted user: Any trash that does not fit into the receptacles must be removed by the renter. The City does not supply trash bags; the renter must bring their own. No tape, nails, staples, or balloon strings may be left on the pavilion, fence, or surrounding area. No confetti in the park No tape, nails, staples, or fasteners of any kind are permitted to be used on the walls and ceilings inside the building. Wipe down all tables and chairs after use and return them to the stacks. Do not leave anything in the building. Items left behind will be disposed of. It is the sole responsibility of the renter to ensure that guests to not damage the facilities. The renter shall return the park facilities to their pre-use condition. Contact the Police Department at 561-965-1700 at the end of your event to arrange a post-use inspection. The cleaning deposit will be automatically forfeited should it be necessary for City employees to clean up the Park after completion of your event, or repair any damage to the property. Should it be necessary for the City to use the deposit for clean-up or repair, subsequent use of the park by the same applicant will require a security deposit double the amount previously paid. The cleaning deposit will not be returned without a signed inspection report. The City has sole discretion to determine the usability of the Kintz Park facilities. The City has the right to cancel an activity in an emergency or in the event of the park being deemed dangerous to any event, weather or vandal related. No refunds will be issued. Adult supervision of children is required at all times. Private parties are prohibited on all major holidays. ▲ Back to top City Documents Utility Payments Permits & Licenses Public Safety Code of Ordinances Report a Trash Issue Contact Us City of Atlantis 260 Orange Tree Drive Atlantis FL, 33462 Phone: 561-965-1744 Quick Links Flood Hazard Preparation Public Records Resident Vehicle Decals Water Quality Reports /QuickLinks.aspx Site Links Home Site Map Contact Us Accessibility Copyright Notices Privacy Policy /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.atlantisfl.gov/165/Police",
      "text": "Police | Atlantis, FL Skip to Main Content Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In Council Community Departments Boards How Do I... facebook Instagram Search Home Departments Police Police Mission Statement To affirmatively promote, preserve and deliver a feeling of security, safety and quality services to members of our community. Chief of Police Robert G. Mangold Staff The City of Atlantis Police Department was formed in 1959, with a full time Chief of Police and two part time police officers. Police department staffing consists of: 15 full time Sworn Police Officers 4 full time Communications Dispatchers 2 part-time Communications Dispatchers Support Services Manager-Crime Analyst- Records Custodian Fleet Manager Minimum staffing requires that two officers be on duty at all times, with additional personnel available as needs and scheduling dictate. Rank Structure The current rank structure of the department consists of a Police Chief, Sergeants, and Police Officers. The department is operational 24 hours a day, seven days a week. Communication The Police Department has always embraced the philosophy of community oriented policing, long before this concept became a “buzz word” in law enforcement. Technological advances, such as enhanced E-911 dispatching, Blackboard Connect emergency automated community notification, and gatehouses equipped with security cameras and license plate recognition software help to insure a high level of security for the residents of Atlantis and assist the department in the accomplishment of its mission. Duties Patrol Officers patrol in sport utility vehicles and marked and unmarked sedans. All marked vehicles are equipped with mobile in-car video equipment, laptops with mobile crime data capabilities, radar or laser traffic equipment, a crime scene kit, and photography equipment. Emergency Medical Technicians As all officers are required to be Emergency Medical Technicians, each vehicle is also equipped with emergency medical supplies such as a first aid kit, oxygen, semi-automatic defibrillator, and other equipment to enable officers to respond to a wide variety of medical emergencies. Firefighting A number of officers are also certified fire fighters and these officers carry their fire gear and are ready at a moment’s notice to switch from law enforcement to fire rescue duties. Other Roles Officers are proficient in a number of police specialties; they may be assigned as: Crime Scene Technicians and/or Photographers Criminal Investigators DUI /Traffic Enforcement Officers Evidence Storage Technicians Certification Members of the department have also attained certification as police trainers in a number of disciplines, including: Defensive Tactics Ethics Peacekeeper Baton Firearms Human Diversity Pepper Spray Taser Department trainers instruct outside the agency as well as in, providing training to basic recruits at the police academy, and officers at other police agencies. Services The Police Department provides many services to residents and visitors of the City. These services include: Bicycle and stranger/danger programs for children Crime prevention security surveys for homes and businesses Security and police expertise for special city events Security checks of closed homes and businesses Involvements While the Atlantis Police Department is a relatively small agency, the department is actively involved with other local police agencies in countywide enforcement initiatives such as: Multi-Agency Auto Theft Task Force Multi-Agency Robbery Task Force Palm Beach County Multi-Agency Gang Task Force Palm Beach County’s Child Protection Team Violent Crimes Task Force Contact Us Police Department Email the Police Department Physical Address View Map 260 Orange Tree Drive Atlantis , FL 33462 260 Orange Tree Drive  Atlantis FL 33462 Directions Phone: 561-965-1700 Fax: 561-968-9443 Emergency Phone: 911 Police Department is open 24/7 Administrative Hours Monday to Friday 8:30 am to 4:30 pm Directory Social Media Facebook Page View All /QuickLinks.aspx FAQs The officers I dealt with really went \"above and beyond.\" How do I thank them? I have a problem regarding the police department, and I would like to complain. How do I go about this? What should I do if I have knowledge about domestic abuse, abuse of the elderly, or child abuse? View All /FAQ.aspx Crime Prevention Tips General Tips Cyber Crime Tips for Your Children Employment Opportunities Online Resources Resident Vehicle Decals Services Traffic FAQs When to Call 911 Dark House Request Form Directory Update/ Emergency Contact Form City Documents Utility Payments Permits & Licenses Public Safety Code of Ordinances Report a Trash Issue Contact Us City of Atlantis 260 Orange Tree Drive Atlantis FL, 33462 Phone: 561-965-1744 Quick Links Flood Hazard Preparation Public Records Resident Vehicle Decals Water Quality Reports /QuickLinks.aspx Site Links Home Site Map Contact Us Accessibility Copyright Notices Privacy Policy /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://splash.org/about-us",
      "text": "Splash | About Us Blog Contact Newsletter Signup f t Our Work Why Project WISE Water Sanitation Hygiene Menstrual Health Partners About Us Core Values Meet the Team Meet the Board Financials 501c3 Letter Careers Social Enterprises Where Nepal China India Ethiopia Cambodia Bangladesh Thailand Vietnam Impact Stories Our Impact Donate Donate Give Monthly: The Tap Give Annually: The Fountain Other Ways to Give Get Involved Blog Contact Newsletter Signup We clean water for kids. Splash is a social justice organization committed to the poor, an international development agency disciplined around urban economies, a social enterprise dedicated to putting ourselves out of business, and a safe water company focused on children. Put this odd combination together and exciting things are happening. Core Values We shift, we grow, we stumble, we pivot and we continually refine our work and scope—yet amidst the ever-moving landscape of international development, there are core values that act as constants for Splash. People People first. People second. People third. Quality Beautiful products that function and last. Honesty No drama, no surprises, no BS. Joy Kids at heart, seeing potential everywhere. Mistakes Make them, don’t repeat them. Meet the Team The Splash Team is international. We hire fun folks who continually impress us with their smarts, ingenuity and tenacity. We're collegial. We're rigorous. We work hard, play hard, and dream big. Really, really big. Addisu ShewaMoltot WASH Promotion & Partnership Manager Addis Ababa, Ethiopia Anna Lin Mitchell Chief Finance and Administration Officer Manchester-by-the-Sea, MA Bellen Moges Menstrual Health Program Manager Addis Ababa, Ethiopia Cameron Schupp Director, Development Operations & Donor Relations Washington, D.C. Carole Wanjau Executive Director - Africa Johnannesburg, South Africa Chris Nicoletti Chief Impact Officer Fort Collins, CO Christine Nyagode Regional Director, Finance & Operations Nairobi, Kenya Cudjoe Bennett Chief Program Officer Washington, D.C. Deepanita Biswas Consultant: Country Representative Kolkata, India Elias Alemu Sr. Officer, Finance & Operations Addis Ababa, Ethiopia Emily Cruz Director of Behavior Change Seattle, WA Enqubahrish Yibeltal Officer, Finance & Operations Addis Ababa, Ethiopia Eric Stowe Founder & Chief Executive Officer Seattle, WA Fiker Abebe Regional Director, Impact & MLE Addis Ababa, Ethiopia Gebeyehu Abebe Eshetie Programs Director Addis Ababa, Ethiopia Geta Tade Sr. Lead Driver & General Service Assistant Addis Ababa, Ethiopia Gezahegn Shibiru Senior O&M Officer Addis Ababa, Ethiopia Ginette Mballa Sr. Director, Finance & Operations Potomac, MD Henok Wolday Design & QA Manager Addis Ababa, Ethiopia Israel Yednekachew Regional Manager, Data Quality, Insights, & Reporting Addis Ababa, Ethiopia Kaitlynn Lagman Program Officer Seattle, WA Katrina Straker Chief Development Officer Baltimore, MD Kebebush Mekuria Cleaner Addis Ababa, Ethiopia Lauren Rymer Director, Philanthropy - US Atlanta, GA Martin Carter Consultant, Infrastructure and Operations Castle Cary, UK Megan Williams Senior Director of Programs Seattle, WA Mekonnen Addisu Regional Director Amhara, Ethiopia Nardos Nigusse Construction Supervision Officer Addis Ababa, Ethiopia Sandra Sottomano Global People & Culture Manager Bay Area, CA Tigist Bekele Senior People and Culture Manager Addis Ababa, Ethiopia Tigist Tesfaye Worota Sr. Manager, Finance & Operations Addis Ababa, Ethiopia Vika Dudaney Sr. Manager, Global FP&A Cambridge, MA Come work at Splash! Current Openings Meet the Board The Splash Board of Directors holds Splash accountable, verifies progress, collaborates on strategy, maintains standards, ensures quality, and works tirelessly on behalf of clean water for kids. Skye Yoden Board Chair Seattle, WA Eric Angula Board Secretary Nairobi, Kenya Sharon Cheramboss Board Member Nairobi, Kenya Paris Jones Board Member Khunapong Khunaraksa Board Member Sydney, Australia Chemu Lang'at Board Member Texas, USA Craig Sarsony Board Member Eric Stowe Founder & Chief Executive Officer Seattle, WA Financials 2022 2022 Audited Financial Statements 2022 990 2023 2023 Audited Financial Statements 2023 990 2024 2024 Audited Financial Statements 2024 990 Annual Report 501c3 Letter Splash International is a registered non-profit organization in the United States. Our tax ID/EIN is 56-2600599. All donations are tax-deductible where applicable. For information on our registration status in other countries, please contact us. 501c3 Letter (PDF) Want to get involved? Do More Do you want to make a difference? You can! Give kids access to clean safe drinking water. Donate Privacy | Cookies Privacy Policy Contact Facebook Twitter Instagram YouTube © 2025 SPLASH. ALL RIGHTS RESERVED."
    },
    {
      "url": "https://www.joonsquareusa.com/water-park/kintz-park-and-splash-pad-palm-beach-fl",
      "text": "Kintz Park and Splash Pad in Lake Worth Beach, Palm Beach -  Water Park | Joonsquare USA List Your Business Login Register Visit Explore Palm Beach FL Supermarket Zoo and Wildlife Sanctuary Amusement Park Park Store Other Museums Water Park Hypermarket Login Register Explore Palm Beach FL Supermarket Zoo and Wildlife Sanctuary Amusement Park Park Store More Museums Water Park Hypermarket List Your Business Social Links 0 0 Go Back Florida Palm Beach Water Park Kintz Park and Splash Pad Kintz Park and Splash Pad Lake Worth Beach, Palm Beach Share × Kintz Park and Splash Pad Share This Business Click Below to Share this Business with your Friends, Clients and other Contacts. Save × Please login to Save this business. Login Close × Please login to report this business. Login Close 12:00 AM - 12:00 PM Wednesday Send Enquiry Call Map Location Review 3+ 3+ Like 457 Views You can search for other Businesses Near  Lake Worth Beach Water Park Amusement Park Zoo and Wildlife Sanctuary Hypermarket Reviews about the Kintz Park and Splash Pad. Click To Review Upload Image Kintz Park and Splash Pad Contact Details: Address : 301 Glenbrook Dr, Lake Worth Beach, Palm Beach, Florida, USA, 33462 Phone No. : 5619651744 Email : info@kintzpark.com Official website : https://www.atlantisfl.gov/ Share this Business with others: Send Your Enquiry Get response from other Businesses Also. Feedback Send Enquiry Location Click Here to Search for more Water Park Near Lake Worth Beach × Working Hours Monday 12:00 AM - 12:00 PM Open Tuesday 12:00 AM - 12:00 PM Open Wednesday 12:00 AM - 12:00 PM Open Thursday 12:00 AM - 12:00 PM Open Friday 12:00 AM - 12:00 PM Open Saturday 12:00 AM - 12:00 PM Open Sunday 12:00 AM - 12:00 PM Open Water Park Near Lake Worth Beach Fun Depot Amusement Park 0 545 × Kintz Park and Splash Pad Response Within 24 Hours. Get response from other Businesses Also × Kintz Park and Splash Pad Book Appointment Online in Advance. Select Appointment Date Choose Time Slot Choose Time Morning Slot 10:15 AM 10:30 AM 10:45 AM 11:00 AM 11:15 AM 11:30 AM 11:45 AM Afternoon Slot 12:00 PM 12:15 PM 12:30 PM 12:45 PM 01:00 PM 01:15 PM 02:00 PM 02:15 PM 02:30 PM 02:45 PM 03:00 PM 03:15 PM 03:30 PM 03:45 PM Evening Slot 04:15 PM 04:30 PM 04:45 PM 05:00 PM 05:15 PM 05:30 PM 05:45 PM Get Confirmation from Business on Mobile No. × Kintz Park and Splash Pad . Please Give Feedback. × Kintz Park and Splash Pad . Response In Only 30 minutes. --Select --- Voilence Harassment Spam Copyrighted browse by state Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware District of Columbia Florida Georgia Hawaii Idaho Illinois Indiana Iowa kansas Kentucky Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Louisiana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington West Virginia Wisconsin Wyoming Company About Joonsquare Jobs Blogs Press Promote Business Online Publish a Business Terms & Conditions Reviews Content Guidelines Advertise with Joonsquare More Customer Support Privacy Policy Terms of Services FAQ Follow Us Facebook Twitter Youtube Copyright 2024 © All rights reserved by Joonsquare USA"
    },
    {
      "url": "https://atlantisfl.gov/Facilities/Facility/Details/Kintz-Park-1",
      "text": "Facilities • Kintz Park Skip to Main Content Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In Council Community Departments Boards How Do I... facebook Instagram Search Home Facilities Get Directions Google Bing Kintz Park 301 Glenbrook Drive Atlantis, FL 33462 Contact Kristen Puhalainen 561-965-1744  Ext. 0115 Hours Sunrise to sunset Rating This facility has not yet been rated. Facilities Feature Overview View all facilities Kintz Park Features ADA Accessible Meeting Rooms Parking Pavilion Picnic Tables Playground Restrooms Tennis Water Splash Pad The splash pad is operational. Monday - Thursday: 10 a.m. to 6 p.m. Friday - Sunday: 10 a.m. to 8 p.m. Courts The tennis and pickleball courts are available on a first-come basis; there is no reservation process and courts cannot be 'held.' All participants are expected to follow the posted rules. Rentals The pavilion and recreation building at Kintz Park are available to rent for your special event of eight or more people, for up to six hours. Your reservation secures only the pavilion OR building (not both); the park remains open to the public. There is only one rental event permitted per day. Fee for Atlantis residents: $100 + $100 cleaning deposit, paid separately Fee for non-residents: $500 + $100 cleaning deposit, paid separately Check date availability on the calendar on our home page. For application contact City Hall at 561-965-1744 x115 or kpuhalainen@atlantisfl.gov , The 2nd and 4th Sundays are not available for rental events. Amenities The building has a full kitchen, folding banquet tables, and chairs. The capacity of the building is 49 people with no tables and chairs set up, 37 with tables and chairs. Park Rules & Regulations Kintz Park is open dawn to dusk. Tennis/pickleball courts are open until 9 p.m . The park is open to the public. While you may receive exclusive use of either the community center building or the pavilion, we regret that we cannot grant exclusive use to all facilities. Your park reservation is for a maximum six hour period. This includes set-up and clean-up. Groups of eight or more using the park and/or anyone who wishes to use the building must make a reservation and pay the fee. The fee for residents for Friday, Saturday, and Sunday reservations is $100. The non-resident fee of $500 is valid every day. The fee is based on where the event host lives. The resident fee is available only to party host for immediate family members, child, or grandchild. All others must pay the non-resident fee. The use fee and cleaning deposit of $100 is due and payable to the City upon application. Alcoholic beverages are prohibited. Grills are not permitted. The air conditioner is set at 75 degrees Fahrenheit. It may not be changed under any circumstances. Planned activities for the event must be disclosed. Any rides or amusements brought into the park must be registered and show proper insurance with the City of Atlantis as an additional insured. No animals are allowed in the park. Failure to provide insurance certificate will result in the prohibition of the use of such facilities the day of the event. Vehicles are not permitted in the park for safety reasons. You may have your vehicle in the park for loading and unloading, but it must be legally parked outside the park for the duration of the event. Guest vehicles must be legally park for the duration of the event. Refrain from parking on lawns or in driveways of the neighboring residences. Do not block the roadway or the driveways. Clean-up is the sole responsibility of the permitted user: Any trash that does not fit into the receptacles must be removed by the renter. The City does not supply trash bags; the renter must bring their own. No tape, nails, staples, or balloon strings may be left on the pavilion, fence, or surrounding area. No confetti in the park No tape, nails, staples, or fasteners of any kind are permitted to be used on the walls and ceilings inside the building. Wipe down all tables and chairs after use and return them to the stacks. Do not leave anything in the building. Items left behind will be disposed of. It is the sole responsibility of the renter to ensure that guests to not damage the facilities. The renter shall return the park facilities to their pre-use condition. Contact the Police Department at 561-965-1700 at the end of your event to arrange a post-use inspection. The cleaning deposit will be automatically forfeited should it be necessary for City employees to clean up the Park after completion of your event, or repair any damage to the property. Should it be necessary for the City to use the deposit for clean-up or repair, subsequent use of the park by the same applicant will require a security deposit double the amount previously paid. The cleaning deposit will not be returned without a signed inspection report. The City has sole discretion to determine the usability of the Kintz Park facilities. The City has the right to cancel an activity in an emergency or in the event of the park being deemed dangerous to any event, weather or vandal related. No refunds will be issued. Adult supervision of children is required at all times. Private parties are prohibited on all major holidays. ▲ Back to top City Documents Utility Payments Permits & Licenses Public Safety Code of Ordinances Report a Trash Issue Contact Us City of Atlantis 260 Orange Tree Drive Atlantis FL, 33462 Phone: 561-965-1744 Quick Links Flood Hazard Preparation Public Records Resident Vehicle Decals Water Quality Reports /QuickLinks.aspx Site Links Home Site Map Contact Us Accessibility Copyright Notices Privacy Policy /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.launchpadtrampolinepark.com/contactus",
      "text": "Contact | Launch Pad top of page Tickets Deals Parties & Groups Parties Toddler Parties Group Events Download App Attractions Gift Cards Waivers More Programs Memberships Fundraising Student Programs Park Details More Use tab to navigate through the menu items. LOGIN Contact Launch Pad We’re always working to make your experience better. Please use the below form to contact us with any suggestions, concerns, or questions. CONTACT US 22 Rousch Dr, Westover WV 26501 Phone 304-322-2959 Email info@launchpadwv.com First Name Last Name Email Phone Message Send Thanks for submitting! We will be in contact with you as soon as possible! Copyright 2025 by Launch Pad Trampoline Park | 304-322-2959 | info@launchpadwv.com |   22 Rousch Drive Westover, WV 26501 Hours & Pricing Job Opportunities Franchise Contact Us FAQ's bottom of page"
    }
  ]
}