{
  "fuentes": [
    {
      "url": "https://nationalgolf.ro/en/contact-us/",
      "email": "contact@nationalgolf.ro"
    },
    {
      "url": "https://nationalgolf.ro/en/contact-us/",
      "email": "ozkan.baykal@nationalgolf.ro"
    },
    {
      "url": "https://nationalgolf.ro/en/contact-us/",
      "email": "sales@nationalgolf.ro"
    },
    {
      "url": "https://nationalgolf.ro/en/contact-us/",
      "email": "thegreen@nationalgolf.ro"
    },
    {
      "url": "https://www.marylandnational.com/contact/staff/",
      "email": "alyssae@marylandnational.com"
    },
    {
      "url": "https://www.marylandnational.com/contact/staff/",
      "email": "info@marylandnational.com"
    },
    {
      "url": "https://www.angelesnational.com/contactus/",
      "email": "confirmation@angelesnational.com"
    },
    {
      "url": "https://www.angelesnational.com/contactus/",
      "email": "events@angelesnational.com"
    },
    {
      "url": "https://www.angelesnational.com/contactus/",
      "email": "mcnallydave@me.com"
    },
    {
      "url": "https://www.mscorecard.com/mscorecard/showcourse.php?cid=1415206965514127",
      "email": "tom@floridaclubgolf.com"
    },
    {
      "url": "https://accountryclub.com/atlantic-city-country-club-contact/",
      "email": "acccevents@accountryclub.com"
    },
    {
      "url": "https://accountryclub.com/atlantic-city-country-club-contact/",
      "email": "azbikowski@accountryclub.com"
    },
    {
      "url": "https://accountryclub.com/atlantic-city-country-club-contact/",
      "email": "beaumont@accountryclub.com"
    },
    {
      "url": "https://accountryclub.com/atlantic-city-country-club-contact/",
      "email": "borro@ottingergolf.com"
    },
    {
      "url": "https://accountryclub.com/atlantic-city-country-club-contact/",
      "email": "burke@ottingergolf.com"
    },
    {
      "url": "https://accountryclub.com/atlantic-city-country-club-contact/",
      "email": "colon@accountryclub.com"
    },
    {
      "url": "https://accountryclub.com/atlantic-city-country-club-contact/",
      "email": "dharman@accountryclub.com"
    },
    {
      "url": "https://accountryclub.com/atlantic-city-country-club-contact/",
      "email": "dicecco@ottingergolf.com"
    },
    {
      "url": "https://accountryclub.com/atlantic-city-country-club-contact/",
      "email": "events@accountryclub.com"
    },
    {
      "url": "https://accountryclub.com/atlantic-city-country-club-contact/",
      "email": "graefe@accountryclub.com"
    },
    {
      "url": "https://accountryclub.com/atlantic-city-country-club-contact/",
      "email": "kelly@ottingergolf.com"
    },
    {
      "url": "https://accountryclub.com/atlantic-city-country-club-contact/",
      "email": "lefevre@ottingergolf.com"
    },
    {
      "url": "https://accountryclub.com/atlantic-city-country-club-contact/",
      "email": "membership@ottingergolf.com"
    },
    {
      "url": "https://accountryclub.com/atlantic-city-country-club-contact/",
      "email": "munro@accountryclub.com"
    },
    {
      "url": "https://accountryclub.com/atlantic-city-country-club-contact/",
      "email": "shewalter@accountryclub.com"
    }
  ],
  "mails": [
    "acccevents@accountryclub.com",
    "alyssae@marylandnational.com",
    "azbikowski@accountryclub.com",
    "beaumont@accountryclub.com",
    "borro@ottingergolf.com",
    "burke@ottingergolf.com",
    "colon@accountryclub.com",
    "confirmation@angelesnational.com",
    "contact@nationalgolf.ro",
    "dharman@accountryclub.com",
    "dicecco@ottingergolf.com",
    "events@accountryclub.com",
    "events@angelesnational.com",
    "graefe@accountryclub.com",
    "info@marylandnational.com",
    "kelly@ottingergolf.com",
    "lefevre@ottingergolf.com",
    "mcnallydave@me.com",
    "membership@ottingergolf.com",
    "munro@accountryclub.com",
    "ozkan.baykal@nationalgolf.ro",
    "sales@nationalgolf.ro",
    "shewalter@accountryclub.com",
    "thegreen@nationalgolf.ro",
    "tom@floridaclubgolf.com"
  ],
  "nombre_sitio": "atlanticnationalgolfclub.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://nationalgolf.ro/en/contact-us/",
      "text": "Contact - National Golf & Country Club | North Bucharest | Niculesti X GOLF COURSE UPDATE: Golf Course Open - Contact us for Buggy status. Skip to content Country Club Golf Expand The Course Membership Performance Center Fees and Services Tournaments Real Estate Expand Luxury Villas Met Apartments The Green Meetings & Events Accommodation News Contact Facebook Instagram Member Login Toggle Menu Contact Us Golf Reception – Golf Shop +40 783 003 712 contact@nationalgolf.ro Address DC 159, Niculești Commune, Dambovita County, 137330, România The Green by LOFT +40 783 003 704 thegreen@nationalgolf.ro Golf Reception – Golf Shop +40 783 003 712 contact@nationalgolf.ro Address DC 159, Niculești Commune, Dambovita County, 137330, România The Green by LOFT +40 783 003 704 thegreen@nationalgolf.ro Residential Sales +4 0730 793 107 sales@nationalgolf.ro Residential Sales +4 0730 793 107 sales@nationalgolf.ro Golf & Country Club General Manager +4 0730 046 566 contact@nationalgolf.ro Sponsorship & Events General Manager +4 0730 046 566 ozkan.baykal@nationalgolf.ro Golf & Country Club General Manager +4 0730 046 566 contact@nationalgolf.ro Sponsorship & Events General Manager +4 0730 046 566 contact@nationalgolf.ro Fill out the form below and we will get in touch Name Surname Email Phone Number Your message (optional) Club Regulations View our Club Regulations Here Regulamentul Clubului Vezi aici Regulamentul Clubului Terms and Conditions View our Terms and Conditions here. Termeni si Condiții Vezi aici Termeni si Condiții. Privacy Policy View our Privacy Policy here . Politica de Confidențialitate Vezi aici Politica de Confidențialitate. About National Golf & Country Club Located less than 37 km North of Bucharest, National Golf & Country Club is an inclusive golf community, developed within the most beautiful resort that has ever been built in the vicinity of Bucharest. Our Partners: Select Language: Members: Log in here Contact: E-mail: contact@nationalgolf.ro Address: Niculesti Commune, Dambovita County Social Media: Facebook | Instagram Policies : Club Regulations RO | EN Terms and Conditions RO | EN Privacy Policy RO | EN Terms and Conditions & Policies Accommodation National Golf & Country Club 9:34 pm, Sep 10, 2025 25 °C moderate rain 36 % 1018 mb 12 mph Wind Gust: 0 mph Clouds: 0% Visibility: 10 km Sunrise: 6:49 am Sunset: 7:37 pm Weather from OpenWeatherMap © 2025 National Golf & Country Club Website created by Vere Design. EN RO EN Scroll to top Scroll to top Country Club Golf Toggle child menu Expand The Course Membership Performance Center Fees and Services Tournaments Real Estate Toggle child menu Expand Luxury Villas MET Apartments The Green Meetings and Events Accommodation News Contact Member Login RO EN"
    },
    {
      "url": "https://www.marylandnational.com/contact/staff/",
      "text": "Staff - Maryland National Golf Club Skip to primary navigation Skip to main content Skip to primary sidebar Skip to footer info@marylandnational.com 301.371.0000 Book A Tee Time Maryland National Golf Club Est. 2002 Maryland National Golf Club Home Tee Times Course Rates Scorecard Hole by Hole Handicap Service Architect Practice Facility Instruction Lessons Indoor Simulator Clubhouse Clubhouse Info Golf Shop Schroyer’s Tavern South Mountain Room Board Room Overlook Room Eagle’s Nest Events Calendar Golf Outings Banquets Weddings Corporate Meetings Information Request Gallery Membership Full Membership Associate Membership Corporate Membership Out of Town Membership Information Contact Directions Dress Code Staff News Employment Staff Ethan Lester Managing Partner / Director of Golf Course Maintenance Ethan has overseen Maryland National Golf Club’s maintenance program since 2002. During the 2005 golf season his knowledge and skills were utilized across the entire facility, and he was promoted to General Manager. Ethan came to Maryland National with ten years of experience in golf course maintenance at several different semi-private and public courses on the East coast all with diverse turf, chemical, fertilizer, and irrigation needs. In his most recent position prior to Maryland National, Ethan was a Senior Superintendent overseeing the maintenance operations for several courses in North Carolina. Ethan has been a member of the GCSAA since 1996 and holds a degree in Turfgrass Management and Applied Science in Ornamental and Landscape Design from North Carolina State. Alyssa Eshleman General Manager / Director of Sales & Marketing Alyssa has been employed at Maryland National Golf Club since the spring of 2011. In her time with us, she has learned the ins and outs of our operation, beginning with food and beverage and continuing to expand her knowledge of sales, membership, and golf operations. In her current position as General Manager, she assists with clubhouse operations and helps our amazing staff in providing a positive and memorable experience for each guest. Furthermore, as Director of Sales & Marketing, Alyssa works personally with guests to plan and execute memorable events, grow community relations, and expand our ever-growing membership base. Alyssa continues to grow her career in management with the recent completion of her M.B.A. program at Hood College (May 2017). Robin Semler Clubhouse Manager Since her hire date in July of 2009, Robin has been an integral part of our operation. Beginning as a bartender and making her way through a number of roles to her current position as the Clubhouse Manager, Robin has gained a thorough understanding of every aspect of our business, making her the go-to individual for our team. Robin’s job responsibilities cover a wide range of social, financial, and managerial tasks vital to our day-to-day operations. Outside of Maryland National, Robin loves spending time at the beach with her son, Tommy, and her dogs, Clyde and Chloe. Nick Schwab Golf Course Superintendent Since August of 2002, Nick has devoted his time day in and day out to keep Maryland National in top notch condition. As a direct result of his skill and knowledge in the field, Maryland National Golf Club is now one of Maryland’s Premier Golf Courses. A graduate of Cincinnati State, Nick continues his education with certifications in fertilizer and chemical application and in his membership with the Golf Course Superintendents Association of America. Dirk Schultz Director of Golf Dirk has been a professional since 1991, and a member of the PGA since 1998. His successes on the course, with multiple local course records and a slew of PGA tournaments under his belt, combined with his extensive work experience including, most recently, Beaver Creek Country Club in Hagerstown, Maryland, make him a fantastic addition to the MNGC family. We look forward to welcoming Dirk to the Middletown Valley, and incorporating his knowledge, experience, and following in the community to our golf operation. Will Horn Lead Golf Professional Will is from Elizabethtown, PA and has been playing golf for more than 10 years. He graduated from York College of Pennsylvania with a Bachelor’s degree in Sports Management and a Minor in HR. While in college he was able to serve as a P.J. Boatwright intern at Maryland State Golf Association traveling throughout the state assisting in running tournaments. Following his love for the game, Will is enrolled into the PGA Program, working his way toward his Class A. Matt Strawsburg Executive Chef Matt is a vital piece to our food and beverage operation, working to provide each of our guests with an extraordinary dining experience through a wide array of exceptional menu options and top-notch service.  Matt received his culinary certificate in 2004, followed by degrees in economics and business administration from McDaniel College in 2007. In his time at Shab Row Bistro, Matt was able to make a name for himself as an incredible executive chef, and we are happy to have him now in the Middletown Valley. His strong cooking background in combination with his fresh business ideas serve as a strong foundation for his role as Executive Chef. Reghan Lennox Events Coordinator Since her hire in 2020, Reghan has been a valuable member of our team, and has grown into a phenomenal restaurant manager. Her experience and knowledge of the outing and banquet world, combined with her ever-expanding business knowledge through her college studies, have made her a vital piece of our blossoming sales department. Starting in 2023, Reghan has become the primary point of contact for many of our outings, showers, birthdays, retirements, rehearsal dinners, and more. Primary Sidebar Course News Stay up-to-date on what's happening at Maryland National with our monthly newsletters, which can be found on Facebook early each month! Membership at Maryland National Golf Club is CAPPED. Please contact Alyssa Eshleman at 301-371-0000 x102 or by email at AlyssaE@marylandnational.com with interest in being placed on our membership wait list. Upcoming Events Month January February March April May June July August September October November December Year 2024 2025 2026 2027 2028 2029 Calendar No Calendars M T W T F S S 1 2 3 4 5 6 7 8 • • 9 10 • • 11 12 • • 13 14 15 16 17 18 19 • • 20 21 22 • 23 24 • • 25 26 • • 27 28 29 • • 30 Weather Sorry - your browser does not support iframes. meteoblue Footer Follow Us Visit Us 8836 Hollow Road Middletown, MD 21769 Contact Us Phone: 301.371.0000 Fax: 301.371.0020 info@marylandnational.com Copyright © 2025 Maryland National Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.angelesnational.com/contactus/",
      "text": "Contact Us - Angeles National Golf Club Skip to primary navigation Skip to main content Skip to footer Angeles National Golf Club Welcome to Angeles National Golf Club! Home Tee Times Gift Cards Golf Golf Book Tee Times Rates Instruction Course Photos Flyover Scorecard Golf Shop Practice Facility Tournaments Memberships Dining ANGC Cafe Menus ANGC Cafe Hours Event Calendar Weddings & Banquets Contact Contact Us Join our E-Club Employment Directions FAQs Contact Us Angeles National Golf Club 9401 Foothill Blvd. Sunland, CA 91040 (818) 951-8771 (main line) (818) 951-8791 (fax) Main Gate Open: Monday – Thursday 5:50 am Friday – Sunday 5:50 am Gate opens between 5:50 am and 6:20 am (subject to change and based on the first tee time on the day) Golf Shop For reservation inquiry, p l ea se email to: confirmation@angelesnational.com 48-hour cancellation policy T (818) 951-8771 Dave McNally, Golf Instructor mcnallydave@me.com T (352) 219-8350 Banquet & Tournament Event Inquiry events@angelesnational.com Footer Contact Us Angeles National Golf Club 9401 Foothill Blvd. Sunland, CA 91040 1 (818) 951-8771 Quick Links Book Tee Times Contact Us Join our E-Club Upcoming Events Follow Us Facebook twitter Instagram Angeles National Golf Club | 9401 Foothill Blvd. Sunland, CA 91040 | 818.951.8771 Copyright © 2025 Angeles National Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.mscorecard.com/mscorecard/showcourse.php?cid=1415206965514127",
      "text": "Atlantic National Golf Club | mScorecard Login Sign Up home Home flag Courses contact_support Contact menu Courses Contact Login Sign Up Login Sign Up Home Courses Show Course Atlantic National Golf Club 6400 Grand Lacuna Blvd 33467 Lake Worth, FL USA phone (561) 433-3006 email tom@floridaclubgolf.com desktop_windows http://www.atlanticnationalgolfclub.com/ Course: 18-hole course course type Golf measurement Yards Please login to view full course information Login Sign Up for Free Men Tees Ladies Hole Par SI Blue White Red White/Green Green Forward Tee 2 Forward Tee 1 Par SI 1 4 -- 417 394 310 394 319 255 169 -- -- 2 4 -- 365 349 264 349 334 170 129 -- -- 3 4 -- 322 305 271 305 288 175 165 -- -- 4 3 -- 147 123 103 123 107 105 105 -- -- 5 5 -- 513 494 391 444 444 345 263 -- -- 6 4 -- 356 319 252 319 294 228 180 -- -- 7 5 -- 521 492 419 432 432 305 275 -- -- 8 3 -- 183 173 143 173 163 135 80 -- -- 9 4 -- 404 385 311 365 365 239 198 -- -- Out 36 3228 3034 2464 2904 2746 1957 1564 36 10 4 -- 353 327 275 327 284 248 189 -- -- 11 3 -- 192 167 98 125 125 105 105 -- -- 12 4 -- 364 352 317 352 335 232 169 -- -- 13 4 -- 348 331 294 331 298 240 200 -- -- 14 5 -- 562 539 465 474 474 343 275 -- -- 15 3 -- 180 159 109 159 130 125 110 -- -- 16 4 -- 390 368 290 368 307 219 182 -- -- 17 3 -- 168 144 85 144 123 115 90 -- -- 18 5 -- 522 503 413 478 478 350 283 -- -- In 35 3079 2890 2346 2758 2554 1977 1603 35 Total 71 6307 5924 4810 5662 5300 3934 3167 71 Men CR/Slope front 9 back 9 --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- Women CR/Slope front 9 back 9 --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- Coordinates 90 points stored on 18 holes Your Stats Rounds Played: 0 Average Score: - Best Score: - Worst Score: - First Round: - Last Round: - This page shows golf course information for Atlantic National Golf Club in Lake Worth, USA. The golf course has 18 holes and its total par is 71 If the information is incorrect, please let us know using the contact form . © 2025 Velocor Ltd | Terms & Privacy Policy"
    },
    {
      "url": "https://accountryclub.com/atlantic-city-country-club-contact/",
      "text": "Contact - Atlantic City Country Club Golf Membership Golf Outings History Course Flyovers Gallery Taproom Bar & Grille Event Calendar Weddings Private Parties Park Place Gift Cards Contact Employment Opportunities Golf Membership Golf Outings History Course Flyovers Gallery Taproom Bar & Grille Event Calendar Weddings Private Parties Park Place Gift Cards Contact Employment Opportunities Golf Member Login Contact The staff at Atlantic City Country Club is committed to you, our valued guest. Therefore, feel free to contact us so we may make your visit more enjoyable. Please call us directly or forward your questions to the following addresses. Contact Our Extraordinary Staff Nick Borro, PGA, CMAA | General Manager borro@ottingergolf.com Michael Burke | Director of Golf burke@ ottingergolf .com Barbara DiCecco | Director of Membership dicecco@ottingergolf.com Barry Shewalter, PGA | Head Golf Professional shewalter@accountryclub.com Mark Beaumont, GCSAA | Golf Course Superintendent beaumont@accountryclub.com For membership or golf outing inquiries: membership@ottingergolf.com Anthony LeFevre | Controller lefevre@ottingergolf.com Cathy Kelly | Director of Human Resources kelly@ottingergolf.com Employment: ottingergolf.com/employment Angela Zbikowski | Director of Events azbikowski@accountryclub.com Caroline Graefe | Event Coordinator c graefe@accountryclub.com Melanie Scarella | Event Coordinator scarella @accountryclub.com For banquet and wedding inquiries: events@accountryclub.com Adam Colon | Director of Food & Beverage colon@accountryclub.com Dan Harman | Executive Chef dharman@accountryclub.com Give Us a Call Phone: 609-236-4400 | Fax: 609-415-2838 Come Visit Us One Leo Fraser Dr., Northfield, NJ 08225 Have a Question? \" * \" indicates required fields Name * First Last Email * Phone * Subject * Message * Δ Atlantic City Country Club One Leo Fraser Drive Northfield, NJ 08225 Phone: 609-236-4400 © 2023 Ottinger Golf Group | Privacy Policy Ottinger Golf Group Scotland Run Golf Club Ballamor Golf Club Follow Us Atlantic City Country Club One Leo Fraser Drive, Northfield, NJ 08225\nPhone: 609-236-4400\n© 2023 Ottinger Golf Group | Privacy Policy Follow Us"
    }
  ]
}