{
  "fuentes": [
    {
      "url": "https://business.winterpark.org/list/member/ava-mediterraegean-5102949",
      "email": "wpcc@winterpark.org"
    },
    {
      "url": "https://www.orlandoweekly.com/food-drink/ava-mediterraegean-owners-already-thinking-about-more-restaurants-in-orlando-30991189",
      "email": "tips@orlandoweekly.com"
    },
    {
      "url": "https://www.avamediterraegean.com/contact",
      "email": "rdg@bacchus.agency"
    },
    {
      "url": "https://www.avamediterraegean.com/contact",
      "email": "reservations@avamediterraegean.com"
    },
    {
      "url": "https://www.avamediterraegean.com/press",
      "email": "rivieradininggroup@purplepr.com"
    },
    {
      "url": "https://thevendry.com/venue/165082/ava-mediterraegean-winter-park-fl",
      "email": "events@avamediterraegean.com"
    },
    {
      "url": "https://www.avasoft.com/contact-us/",
      "email": "career@avasoft.com"
    },
    {
      "url": "https://www.avasoft.com/contact-us/",
      "email": "sales@avasoft.com"
    },
    {
      "url": "https://www.orlandoweekly.com/food-drink/ava-mediterraegean-promises-notable-chefs-and-a-multisensory-experience-30292934",
      "email": "tips@orlandoweekly.com"
    },
    {
      "url": "https://the32789.com/2021/11/15/ava-mediterraegean-announces-culinary-team-2022-opening/",
      "email": "news@the32789.com"
    },
    {
      "url": "https://avaprotocol.org/contact-us",
      "email": "contact@avaprotocol.org"
    }
  ],
  "mails": [
    "career@avasoft.com",
    "contact@avaprotocol.org",
    "events@avamediterraegean.com",
    "news@the32789.com",
    "rdg@bacchus.agency",
    "reservations@avamediterraegean.com",
    "rivieradininggroup@purplepr.com",
    "sales@avasoft.com",
    "tips@orlandoweekly.com",
    "wpcc@winterpark.org"
  ],
  "nombre_sitio": "avamediterraegean.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://business.winterpark.org/list/member/ava-mediterraegean-5102949",
      "text": "AVA MediterrAegean | Restaurants Skip to content Join Now Member Login Upcoming Events Facebook Instagram LinkedIn YouTube About Us About Us Board of Directors Staff Trustees Blog Membership Join Now Member Directory Membership Benefits Member Onboarding Marketing Opportunities Events & Programs Signature Events Signature Series Leadership Winter Park Relaunch Youth Leaders Resources Winter Park  Prosperity Scorecard Meeting Room Rentals Job Board Member Discounts Leadership Development Visit Welcome Center Park Avenue Member Directory Relocation Guide Interactive Map AVA MediterrAegean Categories Restaurants 290 South Park Avenue Winter Park FL 32789 (407) 794-9896 Send Email Visit Website Hours: https://www.avamediterraegean.com/contact About Us Mediterranean restaurant focusing on the Aegean region and membership lounge. Images Gallery Image Athenian_Whole_Lobster_Pasta_2.jpg × Gallery Image Tomato_and_Peach_Carpaccio_1.jpg × Gallery Image Sea_Bream_Ceviche_6.jpg × Gallery Image Potato_Millefeuille_2.jpg × Gallery Image Cocktail_Assortment_1.jpg × Gallery Image Garden_of_Gaia_3.jpg × Gallery Image Caliopes_Dream_2.jpg × Gallery Image Temptation_of_Orpheus_2.jpg × Gallery Image Chocolat_Fondant_2.jpg × Gallery Image AVA-APRIL-3937-112.jpg × Gallery Image Baklava.jpg × Gallery Image AVA-APRIL-9528-132.jpg × Gallery Image 400s.jpg × Gallery Image 400's.jpg × Gallery Image 500's.jpg × Gallery Image Lounge_1.png × Gallery Image Lounge_2.jpg × Gallery Image Lounge_3.png × Gallery Image MM_1.jpg × Gallery Image MM_2.jpg × Gallery Image MM3.jpg × Gallery Image PDR_2.jpg × Gallery Image PDR.jpg × Gallery Image Terrace.jpg × Rep/Contact Info Vanessa Carrillo × Close Vanessa Carrillo General Manager Send an Email Ms. Abby Fechter × Close Ms. Abby Fechter Director of Banquet Sales Send an Email Ms. Jennifer Montalvo × Close Ms. Jennifer Montalvo Accounting & HR Manager Phone: (786) 706-0744 ext. 111 Send an Email Kristian Pineiro × Close Kristian Pineiro Event Sales Manager Phone: (407) 794-9896 Send an Email Ms. Melek Simsek × Close Ms. Melek Simsek Marketing Project Manager Phone: (305) 989-4215 Send an Email Share × Print Email Facebook Twitter LinkedIn Pinterest Close Tell a Friend × Send Request Cancel © 2025 Winter Park Chamber of Commerce | Site by GrowthZone Membership Resources Member Member Login Member Member Benefits Member Onboarding Member Onboarding Member Card Member Directory Get in Touch Address & Map 151 W. Lyman Ave., Winter Park, FL 32789 Phone icon 407.644.8281 Envelope icon wpcc@winterpark.org Facebook Instagram LinkedIn YouTube © 2025 Winter Park Chamber of Commerce. All Rights Reserved. Site by GrowthZone"
    },
    {
      "url": "https://www.orlandoweekly.com/food-drink/ava-mediterraegean-owners-already-thinking-about-more-restaurants-in-orlando-30991189",
      "text": "Ava MediterrAegean owners already thinking about more restaurants in Orlando Close Search for: Search News Open dropdown menu Abortion Rights Orlando Area News Florida News LGBTQ+ Pulse Views + Opinions Orlando Guides Digital Issue News Photos Arts + Culture Open dropdown menu Arts Stories + Interviews Things to Do Orlando Theme Parks Arts + Culture Photos Food + Drink Open dropdown menu Food News Drinking + Bars Restaurant Reviews Find a Restaurant Food + Drink Photos Music Open dropdown menu Music Stories + Interviews Orlando Music News Live Music Picks + Previews Find a Concert Music Photos Movies Open dropdown menu Movie Reviews Streaming Find a Theater Movie Times Cannabis Open dropdown menu Cannabis News Legislative Updates Dispensary Directory Calendar Open dropdown menu Today’s Events This Weekend Free Events Submit an Event Best Of Orlando® Open dropdown menu 2025 Voting Arts + Entertainment Attractions + Recreation City Life Drinking + Nightlife Food + Dining Health, Beauty + Wellness Local Music Local Notables Services Shopping + Retail Shop Best of Awards Orlando Photos Support Open dropdown menu Support Subscribe Advertise Instagram Twitter Facebook Facebook Bluesky TikTok Instagram Apple News Google News Close Skip to content EARLY BIRD SALE TICKETS TO ORLANDO BEER FEST NOW AVAILABLE. BUY YOURS NOW! Facebook Bluesky TikTok Instagram Apple News Google News Orlando Weekly Open Search Search for: Search Support Us Menu News Open dropdown menu Abortion Rights Orlando Area News Florida News LGBTQ+ Pulse Views + Opinions Orlando Guides Digital Issue News Photos Arts + Culture Open dropdown menu Arts Stories + Interviews Things to Do Orlando Theme Parks Arts + Culture Photos Food + Drink Open dropdown menu Food News Drinking + Bars Restaurant Reviews Find a Restaurant Food + Drink Photos Music Open dropdown menu Music Stories + Interviews Orlando Music News Live Music Picks + Previews Find a Concert Music Photos Movies Open dropdown menu Movie Reviews Streaming Find a Theater Movie Times Cannabis Open dropdown menu Cannabis News Legislative Updates Dispensary Directory Calendar Open dropdown menu Today’s Events This Weekend Free Events Submit an Event Best Of Orlando® Open dropdown menu 2025 Voting Arts + Entertainment Attractions + Recreation City Life Drinking + Nightlife Food + Dining Health, Beauty + Wellness Local Music Local Notables Services Shopping + Retail Shop Best of Awards Orlando Photos Support Open dropdown menu Support Subscribe Advertise Instagram Twitter Facebook Posted in Food + Drink Ava MediterrAegean owners already thinking about more restaurants in Orlando by Alex Galbraith February 10, 2022 July 22, 2025 Share this: Click to email a link to a friend (Opens in new window) Email Click to share on Reddit (Opens in new window) Reddit Click to share on Facebook (Opens in new window) Facebook Click to share on X (Opens in new window) X Click to share on Nextdoor (Opens in new window) Nextdoor Click to share on Bluesky (Opens in new window) Bluesky Ava MediterrAegean Credit: MILA Group The ownership group behind the just-opened Ava MediterrAegean restaurant in Winter Park are keen to expand. In an interview with Orlando Business Journal , co-owners Gregory and Marine Galy said they are in talks to open another restaurant in the area. The news comes less than a week after Ava opened in the longtime home of Winter Park fine-dining institution Luma on Park. “We already are looking at opportunities,” Marine Galy said. “We really love this market and we love the people out there.” Related Top Chef winner Hung Huynh won’t be in the kitchen when Ava MediterrAegean opens in Winter Park Ava was a long time coming, emerging in the midst of a messy fallout between the space’s former tenants and its owners. The Galys say they spent around $2.5 million renovating the space and dropped close to $5 million overall to get the restaurant open. “When you go after Luma, you have to do something great,” Marine Galy said of the space. The couple signed a 10-year lease on the building, clearly eyeing the sort of permanence Luma once had. With that eye toward the future, it makes sense that the Galys would be looking to expand their footprint in the Orlando area. – Stay on top of Central Florida news and views with our weekly newsletters , and consider supporting this free publication . Our small but mighty team is working tirelessly to bring you Central Florida news, and every little bit helps. Related Stories Ava MediterrAegean sets opening date in February Top Chef winner Hung Huynh won’t be in the kitchen when Ava MediterrAegean opens in Winter Park Ava MediterrAegean promises notable chefs and a ‘multisensory’ experience Ava MediterrAegean will bring an ‘underground mixology bar’ to Winter Park Ava MediterrAegean, a high-end Mediterranean restaurant, will open in the old Luma on Park space in Winter Park Former Winter Park restaurant Luma on Park, landlords settle dueling lawsuits Luma on Park files lawsuit against former landlord seeking return to restaurant space, potentially millions in damages Upscale sports bar Parlay Orlando to take over old Finnhenry’s space downtown Vegan restaurant Plantees will take over former laundry space next to Will’s Pub in Mills 50 Bao’s Castle opens new ‘ghost kitchen’ outpost at Collab Kitchens on Curry Ford This article appears in Feb 9-15, 2022 . WE LOVE OUR READERS! Since 1990, Orlando Weekly has served as the free, independent voice of Orlando, and we want to keep it that way. Becoming an Orlando Weekly Supporter for as little as $5 a month allows us to continue offering readers access to our coverage of local news, food, nightlife, events, and culture with no paywalls. Join today because you love us, too. Tagged: Ava Mediterraegean , Luma on Park , Orlando , restaurants , Winter Park SEND A NEWS TIP Trending Florida’s first H Mart finally opens in Orlando this month September 4, 2025 Here are the 20 most miserable places in Orlando July 25, 2024 All the Guy Fieri ‘Diners, Drive-Ins and Dives’ restaurants within driving distance of Orlando August 29, 2025 Orlando restaurants open for 25 years or more that every local should know April 10, 2025 Newsletters Join Orlando Weekly Newsletters Subscribe now to get the latest news delivered right to your inbox. SIGN UP NOW Food + Drink Photos 25 new Orlando restaurants opened this summer that aren’t big chains All the Guy Fieri ‘Diners, Drive-Ins and Dives’ restaurants within driving distance of Orlando 30 iconic Orlando restaurants that no longer exist All the smiling faces inside the Firefly photo booth at Tacos and Tequila 2025 More » News News Abortion Rights Orlando Area News Florida News LGBTQ+ Pulse Informed Dissent Views + Opinions Orlando Sports Savage Love Reader Reactions Comics Digital Issue News Photos Movies Movies Movie Reviews Streaming Find a Theater Movie Times Arts + Culture Arts + Culture Arts Stories + Interviews Live Active Cultures Things to Do Orlando Theme Parks Astrology Performing Arts Visual Arts Arts + Culture Photos Calendar Calendar Orlando Weekly Events Today’s Events This Weekend Free Events Submit an Event Social Media Facebook Instagram Bluesky TikTok Food + Drink Food + Drink Food News Drinking + Bars Restaurant Reviews Find a Restaurant Food + Drink Photos Best Of Orlando® Best Of Orlando® 2025 Voting Arts + Entertainment Attractions + Recreation City Life Drinking + Nightlife Food + Dining Health, Beauty + Wellness Local Music Local Notables Services Shopping + Retail Shop Best of Awards 🥇 Sponsored Links Apartments Near UCF Apartments Near Full Sail Orlando Apartments Music Music Music Stories + Interviews Orlando Music News Live Music Picks + Previews This Little Underground Find a Concert Music Photos Cannabis Cannabis Cannabis News Legislative Updates Dispensary Directory Orlando Guides Orlando Guides City Guide Bite Fall Guide Holiday Guide Newcomers Guide Summer Guide Legal Advertising Sponsored Orlando Weekly Events Bite30 Orlando Beer Festival Whiskey Business Tacos & Tequila Brunch in the Park Beer ‘Merica Orlando Taco Week About Contact Us Work for Us Staff Directory Where to find us FAQs Policies Support Subscribe Advertise Chava Communications Read our sister publications SUPPORT US Orlando Weekly PO Box 953127. Lake Mary, FL 32795 © 2025 Orlando Weekly Powered by Newspack Facebook Bluesky TikTok Instagram Apple News Google News Loading Comments... Write a Comment... Email (Required) Name (Required) Website"
    },
    {
      "url": "https://www.avamediterraegean.com/contact",
      "text": "Book Your Event or Table in Winter Park | AVA MediterrAegean HOME ABOUT MENUS EXPERIENCES Locations MEMBERSHIP PRIVATE EVENTS RESERVE HOME ABOUT MENUS EXPERIENCES Locations MEMBERSHIP PRIVATE EVENTS RESERVE AVA MediterrAegean 290 S Park Ave, Winter Park, FL 32789, United States for reservations Online: Book Here Phone: 407-794-9896 Email: reservations@avamediterraegean.com for media inquiries Email: rdg@bacchus.agency follow us View hours DINNER hours MONDAY, TUESDAY, WEDNESDAY 5:00 PM - 11:00 PM THURSDAY, FRIDAY & SATURDAY 5:00 PM - 12:30 AM SUNDAY 5:00 PM - 11:00 PM BRUNCH hours SATURDAY AND SUNDAY 11:30 AM - 2:30 PM Brunch information GOLDEN HOUR SUNDAY TO THURSDAY 5:00 PM - 7:00 PM Exclusively at the Bar. No Reservations Required. More Information AVA MediterrAegean WINTER PARK 290 S Park Ave, Winter Park, FL 32789, United States ——————————————— AVA MediterrAegean COCONUT GROVE 2889 McFarlane Rd, Miami, FL 33133, United States follow us AVA MediterrAegean 290 S Park Ave, Winter Park, FL 32789 view hours | sitemap HOME | PRESS | JOIN THE TEAM | GIFT CARD | FOLLOW US Sign up to receive AVA Magazine, gathering our latest news, upcoming events and special invitations! Email Address Sign Up We respect your privacy. Thank you!"
    },
    {
      "url": "https://www.avamediterraegean.com/press",
      "text": "Press HOME ABOUT MENUS EXPERIENCES Locations MEMBERSHIP PRIVATE EVENTS RESERVE HOME ABOUT MENUS EXPERIENCES Locations MEMBERSHIP PRIVATE EVENTS RESERVE AVA IN THE NEWS Featured ORLANDO MAGAZINE Enjoy a Midday Indulgence at AVA MediterrAegean SOUTHERN LIVING 10 Best Things To Do In Winter Park, Florida ORLANDO BUSINESS JOURNAL AVA MediterrAegean serves up new prix-fixe lunch menu ORLANDO MAGAZINE Beautiful Restaurants of Orlando SOUTHERN LIVING 21 Best Restaurants in Orlando For any press inquiry, please contact rivieradininggroup@purplepr.com AVA MediterrAegean WINTER PARK 290 S Park Ave, Winter Park, FL 32789, United States ——————————————— AVA MediterrAegean COCONUT GROVE 2889 McFarlane Rd, Miami, FL 33133, United States follow us AVA MediterrAegean 290 S Park Ave, Winter Park, FL 32789 view hours | sitemap HOME | PRESS | JOIN THE TEAM | GIFT CARD | FOLLOW US Sign up to receive AVA Magazine, gathering our latest news, upcoming events and special invitations! Email Address Sign Up We respect your privacy. Thank you!"
    },
    {
      "url": "https://thevendry.com/venue/165082/ava-mediterraegean-winter-park-fl",
      "text": "AVA Mediterraegean - Mediterranean Restaurant in Winter Park, FL | The Vendry by by Search Inspiration Circles Log In Sign Up by The community and marketplace for event pros. Join Us List My Business The Vendry Organizations The Memo About the Vendry Contact Us Groupize Keep me posted with industry news, cool case studies, and events. Your email address Subscribe © 2025 THE VENDRY LLC. Privacy Terms & Conditions Terms of Use Overview Spaces Press Nearby Hotels AVA Mediterraegean Restaurant 290 S Park Ave, Winter Park, FL 32789, USA AVA Mediterraegean 290 S Park Ave, Winter Park, FL 32789, USA Request Pricing Cuisine Type Mediterranean # of Spaces 8 Capacity Max Seated: 62 The multi-sensory venue features the true essence of Mediterranean and Aegean cultures, design, and cuisines combined to offer the most elevated dining experience in a meticulously curated and spirited atmosphere. The unique space pays homage to the simple spirit of Cycladic design. Embracing the effortless beauty of the ﬁve elements, AVA MediterrAegean offers a unique experience that immerses all the senses through refined taste, bespoke mixology, transporting ethnic sounds, and an unparalleled ambiance. Show more Show more Request Pricing 290 South Park Avenue, Winter Park, FL Show on the map Spaces Main Dining Room Max Seated: 62 Raw Bar Max Seated: 10 Private Dining Room Max Seated: 12 Terrace Max Seated: 26 Lounge 1 Max Seated: 10 Lounge 2 Max Seated: 40 Main Dining Room Max Seated: 62 Raw Bar Max Seated: 10 Private Dining Room Max Seated: 12 Terrace Max Seated: 26 Lounge 1 Max Seated: 10 Lounge 2 Max Seated: 40 Bar Max Seated: 20 MM Club Max Seated: 60 Show more Press Time Out The 27 best restaurants in Orlando May 31, 2023 The Infatuation The 21 Best Restaurants In Orlando 2023 - Orlando Nov 23, 2022 Time Out The 27 best restaurants in Orlando May 31, 2023 The Infatuation The 21 Best Restaurants In Orlando 2023 - Orlando Nov 23, 2022 Do you work for AVA Mediterraegean ? Contact us to learn more about who's managing this profile or gain access. Other Venues in Winter Park for Your Event Winter Park Convention Centers Winter Park Restaurants Winter Park Event Spaces Winter Park Aquariums / Zoos Winter Park Vineyards Winter Park Hotels Winter Park Breweries / Distilleries Winter Park Bars / Clubs Winter Park Performance Spaces Winter Park Golf Courses Winter Park Museums / Galleries Winter Park Public Spaces Winter Park Stadiums Winter Park Private Group Activites Winter Park Private Clubs Winter Park Convention Centers Winter Park Restaurants Winter Park Event Spaces Winter Park Aquariums / Zoos Winter Park Vineyards Winter Park Hotels Winter Park Breweries / Distilleries Winter Park Bars / Clubs Winter Park Performance Spaces Winter Park Golf Courses Winter Park Museums / Galleries Winter Park Public Spaces Winter Park Stadiums Winter Park Private Group Activites Winter Park Private Clubs"
    },
    {
      "url": "https://www.avasoft.com/contact-us/",
      "text": "Get in touch - Reach out to AVASOFT Skip to content Solutions Modern Work Microsoft Copilot Teams Apps and Solutions Intranet and Extranet Portals Power Platform Solutions ServiceNow Salesforce Data and AI AI Azure Migrate and Modernize Data Warehousing Solutions Azure’s advanced analytics Infrastructure Assess Customer Success Azure Migrate Azure Modernize Azure Managed Services Security Ransomware Protection Identity and Access Security Endpoint Management & Protection Governance & Compliance Cloud Security Managed Security Services Digital and App Innovation Build and Modernize AI Apps Migrate Enterprise Apps Accelerate Developer Productivity Mobile App Development Mixed Reality Apps Modern Work Microsoft Copilot Teams Apps and Solutions Intranet and Extranet Portals Power Platform Solutions ServiceNow Salesforce Data and AI AI Azure Migrate and Modernize Data Warehousing Solutions Azure’s advanced analytics Infrastructure Assess Customer Success Azure Migrate Azure Modernize Azure Managed Services Security Ransomware Protection Identity and Access Security Endpoint Management & Protection Governance & Compliance Cloud Security Managed Security Services Digital and App Innovation Build and Modernize AI Apps Migrate Enterprise Apps Accelerate Developer Productivity Mobile App Development Mixed Reality Apps Platforms Microsoft Platforms Microsoft Copilot Teams Power Apps Power BI Microsoft Fabric Synapse Azure SQL Azure CosmosDB Microsoft Copilot Teams Power Apps Power BI Microsoft Fabric Synapse Azure SQL Azure CosmosDB Microsoft Entra Microsoft Intune Microsoft Defender Microsoft Sentinel Microsoft Purview Microsoft Priva Dynamics 365 CRM Microsoft Entra Microsoft Intune Microsoft Defender Microsoft Sentinel Microsoft Purview Microsoft Priva Dynamics 365 CRM Others Databricks Salesforce ServiceNow Databricks Salesforce ServiceNow Products AVAMIGRATRON Slack to Teams Migration Google Workspace to Microsoft 365 Migration Microsoft 365 Tenant to Tenant Migration IBM Connections to Microsoft 365 Migration Slack to Teams Migration Google Workspace to Microsoft 365 Migration Microsoft 365 Tenant to Tenant Migration IBM Connections to Microsoft 365 Migration AVAMIGRATRON Estimator Others Tivasta Tivasta Partnership About Partner Program Microsoft Funded Program Cloud Solution Provider(CSP) Azure Expert MSP ECIF & Other Funding Programs Unified Support About Partner Program Microsoft Funded Program Cloud Solution Provider(CSP) Azure Expert MSP ECIF & Other Funding Programs Unified Support Insights Blogs Case Studies Webinars Blogs Case Studies Webinars Let’s Talk Let’s Talk Menu Solutions Modern Work Microsoft Copilot Teams Apps and Solutions Intranet and Extranet Portals Power Platform Solutions ServiceNow Salesforce Data and AI AI Azure Migrate and Modernize Data Warehousing Solutions Azure Advanced Analytics Infrastructure Assess Customer Success Azure Migrate Azure Modernize Azure Managed Services Security Ransomware Protection Identity and Access Security Endpoint Management & Protection Governance & Compliance Cloud Security Managed Security Services Digital and App Innovation Build and Modernize AI Apps Migrate Enterprise Apps Accelerate Developer Productivity Mobile App Development Mixed Reality Apps Platforms Microsoft Platforms Copilot Teams Power Apps Power BI Microsoft Fabric Microsoft Synapse Azure SQL Azure CosmosDB Microsoft Entra Microsoft Intune Microsoft Defender Microsoft Sentinel Microsoft Purview Microsoft Priva Dynamics 365 Others Databricks Salesforce ServiceNow Products AVAMIGRATRON Slack to Teams Migration Google Workspace to Microsoft 365 Migration Microsoft 365 Tenant to Tenant Migration IBM Connections to Microsoft 365 Migration AVAMIGRATRON Estimator Others Tivasta Partnership About Partner Program Microsoft Funded Program Cloud Solution Provider(CSP) Azure Expert MSP ECIF & Other Funding Programs Unified Support Insights Blogs Case Studies Webinars Let's connect for cutting-edge solutions Share your challenge or requirement with us, and we’ll ensure you’re connected with the ideal AVASOFT expert to assist you. Reach Us Looking for an engaging technology partner? Drop your contact details, Our \r\n                team will reach you! Full name* Email* Phone number Who do you want to contact* Sales Career How can we help?* Start your career with AI Powered digital transformation company JOIN US Our Locations For sales enquiries +1 732 737 9188 sales@avasoft.com For career enquiries +91 950 007 8300 career@avasoft.com United States 630 Skippack Pike, Blue Bell, PA 19422, USA. Canada 2595 Skymark Avenue, Suite #209, Mississauga, ON L4W 4L5 India Alpha City (SSPDL), 3rd Floor, Beta Block, Navalur, Chennai 600130. Contact us to build your Al-Powered digital transformation strategy with Microsoft Get in touch Let’s Get Started – Connect with Our Experts Today! Get in touch Linkedin X-twitter Youtube About Us Contact Us Career Clients and Partners Press & Media About Us Contact Us Career Clients and Partners Press & Media About Us Contact Us Career Clients and Partners Press & Media About Us Contact Us Career Clients and Partners Press & Media About Us Contact Us Career Clients and Partners Press & Media About Us Contact Us Career Clients and Partners Press & Media © 2025 AVASOFT. All Rights Reserved."
    },
    {
      "url": "https://www.orlandoweekly.com/food-drink/ava-mediterraegean-promises-notable-chefs-and-a-multisensory-experience-30292934",
      "text": "Ava MediterrAegean promises notable chefs and a 'multisensory' experience Close Search for: Search News Open dropdown menu Abortion Rights Orlando Area News Florida News LGBTQ+ Pulse Views + Opinions Orlando Guides Digital Issue News Photos Arts + Culture Open dropdown menu Arts Stories + Interviews Things to Do Orlando Theme Parks Arts + Culture Photos Food + Drink Open dropdown menu Food News Drinking + Bars Restaurant Reviews Find a Restaurant Food + Drink Photos Music Open dropdown menu Music Stories + Interviews Orlando Music News Live Music Picks + Previews Find a Concert Music Photos Movies Open dropdown menu Movie Reviews Streaming Find a Theater Movie Times Cannabis Open dropdown menu Cannabis News Legislative Updates Dispensary Directory Calendar Open dropdown menu Today’s Events This Weekend Free Events Submit an Event Best Of Orlando® Open dropdown menu 2025 Voting Arts + Entertainment Attractions + Recreation City Life Drinking + Nightlife Food + Dining Health, Beauty + Wellness Local Music Local Notables Services Shopping + Retail Shop Best of Awards Orlando Photos Support Open dropdown menu Support Subscribe Advertise Instagram Twitter Facebook Facebook Bluesky TikTok Instagram Apple News Google News Close Skip to content EARLY BIRD SALE TICKETS TO ORLANDO BEER FEST NOW AVAILABLE. BUY YOURS NOW! Facebook Bluesky TikTok Instagram Apple News Google News Orlando Weekly Open Search Search for: Search Support Us Menu News Open dropdown menu Abortion Rights Orlando Area News Florida News LGBTQ+ Pulse Views + Opinions Orlando Guides Digital Issue News Photos Arts + Culture Open dropdown menu Arts Stories + Interviews Things to Do Orlando Theme Parks Arts + Culture Photos Food + Drink Open dropdown menu Food News Drinking + Bars Restaurant Reviews Find a Restaurant Food + Drink Photos Music Open dropdown menu Music Stories + Interviews Orlando Music News Live Music Picks + Previews Find a Concert Music Photos Movies Open dropdown menu Movie Reviews Streaming Find a Theater Movie Times Cannabis Open dropdown menu Cannabis News Legislative Updates Dispensary Directory Calendar Open dropdown menu Today’s Events This Weekend Free Events Submit an Event Best Of Orlando® Open dropdown menu 2025 Voting Arts + Entertainment Attractions + Recreation City Life Drinking + Nightlife Food + Dining Health, Beauty + Wellness Local Music Local Notables Services Shopping + Retail Shop Best of Awards Orlando Photos Support Open dropdown menu Support Subscribe Advertise Instagram Twitter Facebook Posted in Food + Drink Ava MediterrAegean promises notable chefs and a ‘multisensory’ experience by Faiyaz Kara November 14, 2021 June 18, 2025 Share this: Click to email a link to a friend (Opens in new window) Email Click to share on Reddit (Opens in new window) Reddit Click to share on Facebook (Opens in new window) Facebook Click to share on X (Opens in new window) X Click to share on Nextdoor (Opens in new window) Nextdoor Click to share on Bluesky (Opens in new window) Bluesky Ava MediterrAegean Credit: MILA Group If you’re the kind of person who enjoys the scents wafting inside posh hotel lobbies, then you’ll love what Ava MediterrAegean ( Website | Instagram ) has in store when it opens in the old Luma space on Park Avenue early next year. A “multisensory experience” is what’s being promised — everything from special ingredients, to Olya Volkova’s lush design (take a look at the slick renderings on this page), to, yes, signature scents that’ll dazzle the olfactories. Members-only cocktail bar Credit: MILA Group Ava MediterrAegean’s secluded underground bar, called “The Lounge,” will be situated in Luma’s old cellar/private dining space , and have its own unique aroma, moody atmo (yes, there will be a DJ), cocktail program (with bottle service, of course) and private dining areas. It’ll be accessible through a secret entrance, though details on the members-only bar are still being hammered out. But taste will undoubtedly be Ava’s primary sensorial draw with Top Chef Season 3 winner Hung Huynh taking charge of the kitchen as executive chef. After snagging the TV title back in 2007, the talented, Vietnamese-born alum of Per Se and Guy Savoy spent four years with the EMM Restaurant Group before a well-publicized split . Hung bounced around after that and even did a stint at Morimoto Asia as chef de cuisine. In 2019, he opened Asian-fusion restaurant Warrior in L.A. but Huynh confirmed he is no longer associated with the West Hollywood hotspot. Ava MediterrAegean Credit: MILA Group When asked what makes his involvement with the MILA Group (the folks behind Ava and Mila MediterrAsian in Miami) different, Hung is quick to respond. “They’re dynamic and they’re young and I love that,” he says. “They’re willing to push the envelope, and not just from the culinary side.” “We are taking a holistically creative approach,” says Marine Galy, MILA Group’s co-founder. “Our focus on the details, be it from the culinary side, the restaurant’s design, or the transportive mood we’re trying to instill has been very carefully curated. It will differentiate Ava from other restaurants in its class and we want to be the best in class.” Ava MediterrAegean Credit: MILA Group MILA Group’s culinary team includes corporate chef Daniel Garner (former executive chef at Nobu Beijing and Zuma New York/Miami) and R&D corporate chef Erick Melendez (former head chef at Zuma Las Vegas). Along with Hung, the chefs want to place the focus on quality ingredients. In fact, it took the trio a month to find the right tomato, but in addition to acquiring the finest local produce, the trio have forged relationships with local farms to supply poultry, lamb and seafood. They’ll also procure specialty citrus from family-run outfit Bhumi Growers in New Jersey (yes, New Jersey). They’ve supplied high-end restaurants in New York City including Michelin-starred Masa and Gabriel Kreuther . Executive chef Hung Huynh When the Michelin Guide and its foray into Florida enters the conversation, Hung remains pragmatic. “Of course, recognition from Michelin or the James Beard Foundation would be nice, but our focus in the kitchen is going to be on creativity and providing our customers with a superior experience.” So how does a chef known for his innovative pan-Asian fare shift focus to develop a menu of pan-Med cuisine ? “Cooking is just like music,” Hung says. “The tunes may be different, but the notes are the same.” – Stay on top of Central Florida news and views with our weekly newsletters , and consider supporting this free publication . Our small but mighty team is working tirelessly to bring you Central Florida news, and every little bit helps. Related Stories Much-anticipated Ivanhoe Village food hall The Hall on the Yard opens Thursday, Nov. 18 Ava MediterrAegean sets opening date in February Ava MediterrAegean owners already thinking about more restaurants in Orlando This article appears in Nov 10-16, 2021 . WE LOVE OUR READERS! Since 1990, Orlando Weekly has served as the free, independent voice of Orlando, and we want to keep it that way. Becoming an Orlando Weekly Supporter for as little as $5 a month allows us to continue offering readers access to our coverage of local news, food, nightlife, events, and culture with no paywalls. Join today because you love us, too. Tagged: Home Feature Faiyaz Kara Orlando restaurant critic. Orlando Weekly restaurant critic since 2006. More by Faiyaz Kara SEND A NEWS TIP Trending Florida’s first H Mart finally opens in Orlando this month September 4, 2025 Here are the 20 most miserable places in Orlando July 25, 2024 All the Guy Fieri ‘Diners, Drive-Ins and Dives’ restaurants within driving distance of Orlando August 29, 2025 Orlando restaurants open for 25 years or more that every local should know April 10, 2025 Newsletters Join Orlando Weekly Newsletters Subscribe now to get the latest news delivered right to your inbox. SIGN UP NOW Food + Drink Photos 25 new Orlando restaurants opened this summer that aren’t big chains All the Guy Fieri ‘Diners, Drive-Ins and Dives’ restaurants within driving distance of Orlando 30 iconic Orlando restaurants that no longer exist All the smiling faces inside the Firefly photo booth at Tacos and Tequila 2025 More » News News Abortion Rights Orlando Area News Florida News LGBTQ+ Pulse Informed Dissent Views + Opinions Orlando Sports Savage Love Reader Reactions Comics Digital Issue News Photos Movies Movies Movie Reviews Streaming Find a Theater Movie Times Arts + Culture Arts + Culture Arts Stories + Interviews Live Active Cultures Things to Do Orlando Theme Parks Astrology Performing Arts Visual Arts Arts + Culture Photos Calendar Calendar Orlando Weekly Events Today’s Events This Weekend Free Events Submit an Event Social Media Facebook Instagram Bluesky TikTok Food + Drink Food + Drink Food News Drinking + Bars Restaurant Reviews Find a Restaurant Food + Drink Photos Best Of Orlando® Best Of Orlando® 2025 Voting Arts + Entertainment Attractions + Recreation City Life Drinking + Nightlife Food + Dining Health, Beauty + Wellness Local Music Local Notables Services Shopping + Retail Shop Best of Awards 🥇 Sponsored Links Apartments Near UCF Apartments Near Full Sail Orlando Apartments Music Music Music Stories + Interviews Orlando Music News Live Music Picks + Previews This Little Underground Find a Concert Music Photos Cannabis Cannabis Cannabis News Legislative Updates Dispensary Directory Orlando Guides Orlando Guides City Guide Bite Fall Guide Holiday Guide Newcomers Guide Summer Guide Legal Advertising Sponsored Orlando Weekly Events Bite30 Orlando Beer Festival Whiskey Business Tacos & Tequila Brunch in the Park Beer ‘Merica Orlando Taco Week About Contact Us Work for Us Staff Directory Where to find us FAQs Policies Support Subscribe Advertise Chava Communications Read our sister publications SUPPORT US Orlando Weekly PO Box 953127. Lake Mary, FL 32795 © 2025 Orlando Weekly Powered by Newspack Facebook Bluesky TikTok Instagram Apple News Google News Loading Comments... Write a Comment... Email (Required) Name (Required) Website"
    },
    {
      "url": "https://the32789.com/2021/11/15/ava-mediterraegean-announces-culinary-team-2022-opening/",
      "text": "AVA MediterrAegean Announces Culinary Team, 2022 Opening · the32789 September 11, 2025 Search the32789 News Business Food & Drink Community Arts Homes Health & Wellness Follow Us Winter Park, FL News Business Food & Drink Community Arts Homes Health & Wellness Search the32789 Earlier this week, AVA MediterrAegean announced plans to open its new restaurant concept at 290 South Park Ave. in early 2022 under various acclaimed chefs. Images Courtesy of: AVA MediterrAegean AVA MediterrAegean Announces Culinary Team, 2022 Opening By Abbie DeLozier | November 15, 2021 Earlier this week, AVA MediterrAegean announced plans to open its new restaurant concept at 290 South Park Ave. in early 2022 under various acclaimed chefs. Images Courtesy of: AVA MediterrAegean Share This: Coming soon to Winter Park, AVA MediterrAegean announced plans this week to open its new restaurant concept at 290 South Park Ave. in early 2022. The new restaurant will serve upscale Mediterranean cuisine and craft cocktails under the culinary leadership of Executive Chef Hung Huynh and acclaimed chefs Daniel Garner and Erick Melendez . In April, AVA MediterrAegean confirmed plans to move into the 11,000-square-foot Park Avenue corner space. Owned and operated by MILA Restaurant Group , the managing entity of Miami-based MediterrAsian restaurant MILA, AVA MediterrAegean will be the first to acquire the space formerly occupied by Luma on Park since its closing in September 2020. Chef Hung Huynh, also known as the “Top Chef,” was the season three winner of Bravo TV’s Emmy-winning cooking competition show and previously served as executive chef at CATCH NYC . According to Greg Galy, founder of the MILA Group, Chef Hung will lead the “powerhouse culinary team.” “As executive chef at AVA MediterrAegean, Chef Hung’s international palate and background will allow him to create an innovative menu while staying true to the Cycladic traditions,” Galy said. “He has traveled the world, cultivating his knowledge of different types of cuisine and will apply his innovative techniques and own signature twist at AVA MediterrAegean.” Renderings show a mix of contemporary and traditional design in AVA MediterrAegean, which MILA Restaurant Group aims to open in early 2022. Nobu Malibu Senior Sous Chef Daniel Garner, formerly served as head chef at Zuma , a restaurant known for its twist on the traditional Japanese Izakaya-style of informal eating and drinking, in New York and Miami. According to AVA, Garner will serve as MILA Restaurant Group’s corporate head chef, overseeing the executive culinary team at each restaurant to ensure consistency. “Our idea behind AVA MediterrAegean was to create a unique destination in Winter Park, offering a multi-sensory dining experience, where culinary excellence merges with an unparalleled transporting ambiance,” Galy said. “Bringing an acclaimed team of chefs was non-negotiable to create this elevated journey and tap into a new culinary horizon for this market.” Chef Erick Melendez also comes from Zuma, and has worked in Zuma’s Miami, New York, London, and Rome locations. According to the MILA Restaurant Group, Chef Melendez will work as research & development corporate chef to introduce guests to “unique flavor combinations” and “modern techniques.” According to MILA Restaurant Group Co-Founder Marine Galy, AVA MediterrAegean is designed to provide a “home away from home” for guests. Olya Volkova, founder and creative director at OV & Co., is the interior designer behind the new Park Avenue corner restaurant. According to MILA Restaurant Group Co-Founder Marine Galy, Volkova also designed AVA’s sister concept, MILA, a project that shortlisted her for a 2021 Restaurant & Design Award. The members-only Lounge is a secluded venue accessible through a secret entrance and will feature a DJ, custom VIP service, a mixology bar, premium bottle service, and two private dining rooms. For more information, visit AVA MediterrAegean on Instagram . Share This: Have a story idea?  Send us a note at news@the32789.com .  Follow our stories on Instagram , Twitter , and Facebook . Warning :  Undefined variable $avatar_img in /srv/users/the32789-th32-prod/apps/the32789-th32-prod/public/wp-content/mu-plugins/th32-functions/inc/users.php on line 17 Warning :  Trying to access array offset on value of type null in /srv/users/the32789-th32-prod/apps/the32789-th32-prod/public/wp-content/mu-plugins/th32-functions/inc/users.php on line 17 Warning :  Trying to access array offset on value of type null in /srv/users/the32789-th32-prod/apps/the32789-th32-prod/public/wp-content/mu-plugins/th32-functions/inc/users.php on line 17 Warning :  Undefined variable $avatar_img in /srv/users/the32789-th32-prod/apps/the32789-th32-prod/public/wp-content/mu-plugins/th32-functions/inc/users.php on line 17 Warning :  Trying to access array offset on value of type null in /srv/users/the32789-th32-prod/apps/the32789-th32-prod/public/wp-content/mu-plugins/th32-functions/inc/users.php on line 17 Warning :  Trying to access array offset on value of type null in /srv/users/the32789-th32-prod/apps/the32789-th32-prod/public/wp-content/mu-plugins/th32-functions/inc/users.php on line 17 About the Author This story was written by Abbie DeLozier, one of our collection of writers covering news in Winter Park, Florida. Our staff writers can be reached at news@the32789.com. Related Stories Inside The Imperial’s New Park Ave. Address The partners behind The Imperial on Park are overseeing the finishing touches to their long-awaited… Read More By Jim Carchidi | 7 months ago Park Avenue Tavern Leaves Winter Park Less than two years after opening, Park Avenue Tavern has vacated its New England Avenue… Read More By Jim Carchidi | 7 months ago Oak & Stone to Occupy Former 310 Park South Address Artistry Restaurants will add another eatery to its Park Avenue portfolio while taking over a… Read More By Jim Carchidi | 8 months ago Our Sponsors News News News Food & Drink Food & Drink Food & Drink Community Community Community Business Business Business Arts Homes Health & Wellness ABOUT US PUBLISHER’S LETTER FAQ ABOUT US PUBLISHER’S LETTER FAQ ©2025 Findsome & Winmore, Inc. All Rights Reserved. | Privacy Policy | Terms & Conditions | Disclosure Statement Follow Us"
    },
    {
      "url": "https://avaprotocol.org/contact-us",
      "text": "Get in Touch - Contact Our Team | Ava Protocol Home Solutions Use Cases Community Developers Contact Us Enter Studio open navigation menu Contact Us General Development Grant Request Marketing Partnership Others First Name Last Name Email Company Comments Sign up for our email newsletter Submit Supercharge your blockchain with private, autonomous super-transactions for Ethereum and beyond Verifiable Agentic Workflows Ava Protocol supports AI-native automation with cryptographic guarantees, enabling agents to interact with onchain environments securely and transparently. Enhanced Privacy Trusted Execution Environments (TEEs) safeguard sensitive data, protecting workflows and transaction details from exposure. No-Code Composability Combine smart contract calls and build multi-step workflows without writing a single line of code. Cost Efficiency Optimize gas costs and transaction execution by up to 90%, making blockchain interactions more scalable and accessible. Connect the tools you already use View All Oracle Subgraph Messaging AI TEE Home Team Blog Docs Jobs Media Kit Telegram Twitter Discord YouTube LinkedIn Github Email RSS English © 2025 Ava Protocol . All rights reserved."
    }
  ]
}