{
  "fuentes": [
    {
      "url": "https://www.avonparkcamp.com/pages/dormitories",
      "email": "office@avonparkcamp.com"
    },
    {
      "url": "http://www.orangeblossompark.com/",
      "email": "info@orangetblossompark.com"
    },
    {
      "url": "http://www.orangeblossompark.com/",
      "email": "obfc@orangeblossompark.com"
    },
    {
      "url": "https://www.cccuhq.org/wcd-coming-events/131-general/223-cccu-day-at-avon-park-camp",
      "email": "info@cccuhq.org"
    },
    {
      "url": "https://www.avonparkcamp.com/about/our-team",
      "email": "office@avonparkcamp.com"
    },
    {
      "url": "https://www.avonparkcamp.com/events/calendar",
      "email": "office@avonparkcamp.com"
    },
    {
      "url": "https://www.campwingmann.org/contact-us",
      "email": "admin@campwingmann.org"
    },
    {
      "url": "https://www.campwingmann.org/contact-us",
      "email": "admin@campwingmann.org"
    },
    {
      "url": "https://www.avonparkcamp.com/pages/rv-park",
      "email": "office@avonparkcamp.com"
    },
    {
      "url": "https://www.believeworldwide.net/united-states/avon-park/services-co%E2%80%99s-or-churches/avon-park-holiness-camp/connect",
      "email": "name@yoursite.com"
    },
    {
      "url": "https://www.midfloridanewspapers.com/highlands_news-sun/faith_family/church-news/article_8fdf552a-8d48-11ee-a372-f7e5d51e4e84.html",
      "email": "info@fbcap.net"
    },
    {
      "url": "https://www.midfloridanewspapers.com/highlands_news-sun/faith_family/church-news/article_8fdf552a-8d48-11ee-a372-f7e5d51e4e84.html",
      "email": "office@avonparkcamp.com"
    },
    {
      "url": "https://www.midfloridanewspapers.com/highlands_news-sun/faith_family/church-news/article_8fdf552a-8d48-11ee-a372-f7e5d51e4e84.html",
      "email": "webcomments@highlandsnewssun.com"
    },
    {
      "url": "https://www.campwingmann.org/",
      "email": "admin@campwingmann.org"
    },
    {
      "url": "https://www.campwingmann.org/",
      "email": "admin@campwingmann.org"
    },
    {
      "url": "https://www.avonparkcamp.com/contact",
      "email": "office@avonparkcamp.com"
    },
    {
      "url": "https://www.witherslackgroup.co.uk/our-locations/our-schools/avon-park-school/contact-us/",
      "email": "avon-park@witherslackgroup.co.uk"
    },
    {
      "url": "https://www.witherslackgroup.co.uk/our-locations/our-schools/avon-park-school/contact-us/",
      "email": "witherslack@greenbrookadvisory.com"
    },
    {
      "url": "https://bb-360.org/contact-us/",
      "email": "info@bbcamp.org"
    },
    {
      "url": "https://www.avonparkcamp.com/",
      "email": "office@avonparkcamp.com"
    },
    {
      "url": "https://www.avonparkcamp.com/events",
      "email": "office@avonparkcamp.com"
    },
    {
      "url": "https://www.campwingmann.org/our-history",
      "email": "admin@campwingmann.org"
    },
    {
      "url": "https://www.campwingmann.org/our-history",
      "email": "admin@campwingmann.org"
    }
  ],
  "mails": [
    "admin@campwingmann.org",
    "avon-park@witherslackgroup.co.uk",
    "info@bbcamp.org",
    "info@cccuhq.org",
    "info@fbcap.net",
    "info@orangetblossompark.com",
    "name@yoursite.com",
    "obfc@orangeblossompark.com",
    "office@avonparkcamp.com",
    "webcomments@highlandsnewssun.com",
    "witherslack@greenbrookadvisory.com"
  ],
  "nombre_sitio": "avonparkcamp.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.avonparkcamp.com/pages/dormitories",
      "text": "Dormitories | Avon Park Camp Association, Inc. Toggle navigation Menu Home About Events News Live Stream Archives Bible Studies Concerts Encampments Friday Evening Services Special Events Contact Watch Live Stream Properties for Sale Homes Park Models Accommodations Apartments Dormitories Duplex RV Park Retreat Facilities for Rent Directory Give Dormitories Rollings Dormitory Rollings Dormitory features a large front porch and chairs, and you walk in to a large communal living area with Basic Cable TV, comfortable seating, and a piano. WiFi available for a fee.  Linens provided. Rooms are approximately 180 sq. ft. and some of the 25 rooms have a tub and shower, while others have a shower only. Dormitory rental rates listed below are effective September 1, 2025. All Rooms with a Full Bath $55 Daily     $235 Weekly     $770 Monthly ------------------ All Rooms with a Half Bath $50 Daily     $190 Weekly     $655 Monthly Reservations are guaranteed with a $50 deposit. Schoenhals Dormitory Schoenhals Dormitory features a newly-renovated communal living area with Basic Cable TV in Living Room and Kitchen, comfortable seating and a full kitchenette. WiFi available for a fee.  Linens provided. The dormitory has 25 rooms that have either a full or half bath. Rooms are approximately 160 sq. ft. Dormitory rental rates listed below are effective September 1, 2025. All Rooms with a Full Bath $55 Daily     $235 Weekly     $770 Monthly ------------------ All Rooms with a Half Bath $50 Daily     $190 Weekly     $655 Monthly Reservations are guaranteed with a $50 deposit. Watts-Hughes Dormitory Watts-Hughes Dormitory features newly painted rooms, a new kitchenette, and a large front porch and chairs. You walk in to a large communal living area with Basic Cable TV, comfortable seating, and a piano. WiFi available for a fee.  Linens provided. Rooms are approximately 162 sq. ft. Dormitory rental rates listed below are effective September 1, 2025. All Rooms with a Full Bath $55 Daily     $235 Weekly     $770 Monthly ------------------ All Rooms with a Half Bath $50 Daily     $190 Weekly     $655 Monthly Reservations are guaranteed with a $50 deposit. Location 1001 West Lake Isis Avenue\n              \n              Avon Park, Florida\n              \n              33825 View on Google Maps Facebook Icon Home About Events News Live Stream Archives Bible Studies Concerts Encampments Friday Evening Services Special Events Contact Watch Live Stream Properties for Sale Homes Park Models Accommodations Apartments Dormitories Duplex RV Park Retreat Facilities for Rent Directory Give About About Us Our Team Our Beliefs Contact Phone: 1-863-453-6831 Email : office@avonparkcamp.com Office Hours Monday to Friday 8am - 12pm Camp 2/6-2/13; Mon-Sat, 1-4pm June-August, Mon-Firi; 8-10am © 2025 Avon Park Camp Association, Inc.. All Rights Reserved.\n| Login powered by Website Developed by Tithely TGpWcXRWME5EalBlbHNaRm1zaFhJeHExNiswR2VoL1IrQ2dXSUp1enBYZk5WTWZSeGIrb0dCR2VIOHBhSXQ5U1dWZ09FZ2lpbzJNc0RrUys3ZUJ2SEVFa0VWNk5QMS8vcStEWktyMDVzc215eW1PUzIzd1N6UWNhN2ZoNTFZb3RvZXBvQW1QbVNsdm5YbmRQL1JWUE1keEUydFJGaFBLVHd5dnA3K1BKaFo4PS0tUVN2YkRoUWU2bXBHU2lWYTVXZ0VhUT09--d02005c077d5f6725ce06c333e1eacf1f6bac06e"
    },
    {
      "url": "http://www.orangeblossompark.com/",
      "text": "Orange Blossom Fellowship Community Home About Spiritual Life Statement of Faith Mission and Purpose Statement Homes for Sale Introduction Current Listings RV Lots Available Online Application Links Events Contact Open Menu Home About Spiritual Life Statement of Faith Mission and Purpose Statement Homes for Sale Introduction Current Listings RV Lots Available Online Application Links Events Contact Upcoming Events Check back for updates. See More Events > Welcome to Orange Blossom Fellowship Community Welcome! Orange Blossom Park, Inc., a not for profit organization, doing business as Orange Blossom Fellowship Community invites you to enjoy our Florida paradise, especially during the winter months. You might even decide to move here year-round! We are a Christian manufactured home community located in Avon Park, Florida, and welcome individuals who are interested in relocating here. Many of our residents are retired ministers, missionaries and Christian workers. While OBFC does not own the individual homes, the village often has homes for sale by the owners. There are also RV lots available to rent as well. We are a ministry that is owned and operated by the Churches of Christ in Christian Union headquartered in Circleville, Ohio. We are situated close to the Avon Park Holiness Camp where church services and special events go on during the year. We are also close to Warner University where special religious concerts, etc., take place. In the community itself you can enjoy the lovely clubhouse where all types of activities, such as Bible studies, fellowship get togethers, game nights, and more, take place. You will have use of a big screen TV, a library, and exercise room. We also have a shuffleboard court, horseshoes, walking and bicycling as well as a stocked lake for fishing. We are conveniently located in the middle of the Florida peninsula, about 90 miles from each coast, an hour from Orlando, and within driving distance for spending a day at one of Florida's many tourist sites: Disney World, Universal Studio, Sea World, Busch Gardens, LegoLand, Bok Tower, and more. After looking at the website, if you have any questions, please feel free to contact us. Check out our links page for some helpful information about Avon Park. Learn More About Us Email Us: obfc@orangeblossompark.com | Phone: 863-452-0870 Community Administrator: Jack Cox Office Manager: Carolyn Gray Grounds Supervisor: Dave Skelton Office Hours: Monday through Thursday 9:00-12:00 Address: 1400 County Road 17A North, Lot 1 Avon Park FL 33825 © 2020 - 2025 Orange Blossom Fellowship Community - All Rights Reserved. Church Websites | Ministry Websites by NetMinistry ."
    },
    {
      "url": "https://www.cccuhq.org/wcd-coming-events/131-general/223-cccu-day-at-avon-park-camp",
      "text": "CCCU Day at Avon Park Camp - Churches of Christ in Christian Union Home Explore Welcome to The CCCU Our Mission and Purpose Meet Our General Superintendent What We Teach Our Leadership Team GMC Staff Profiles Global Ministry Center Location Ministries Christian Education Church Extension About Church Extension New CCCU Churches Special Offerings Church Extension Partners Contact Us Communications Evangelical Christian Ladies Evangelical Christian Youth Evangelism Missions Mount of Praise Camp Meeting Ohio Christian University Stewardship General Treasurer Missions Welcome to CCCU Missions About CCCU Missions Meet Our Missionaries Missionary Evangelist The Advent Offering for Missions Mission Minded Men Get Involved Make a Donation TiPS for Missions Missionary Directory Contact the Missionary Department News Latest CCCU News Editorials by Rev. Mike Holbrook Upcoming CCCU Events Prayer Requests TIPS for Missions Churches & Districts Find a CCCU Church Northeast District South Central District West Central District West Indies District Resources Ministers & Church Reports Purchase Books Subscribe to the Evangelical Advocate CCCU School of Ministry Ministerial Continuing Ed Ministerial Benevolence Fund Sunday School Literature Forms Library E-Books Evangelists, Musicians, Pulpit Supply Slates Phone: 740-474-8856    E:Mail: info@cccuhq.org Give Now Events Churches Search Home Explore Welcome to The CCCU Our Mission and Purpose Meet Our General Superintendent What We Teach Our Leadership Team GMC Staff Profiles Global Ministry Center Location Ministries Christian Education Church Extension About Church Extension New CCCU Churches Special Offerings Church Extension Partners Contact Us Communications Evangelical Christian Ladies Evangelical Christian Youth Evangelism Missions Mount of Praise Camp Meeting Ohio Christian University Stewardship General Treasurer Missions Welcome to CCCU Missions About CCCU Missions Meet Our Missionaries Missionary Evangelist The Advent Offering for Missions Mission Minded Men Get Involved Make a Donation TiPS for Missions Missionary Directory Contact the Missionary Department News Latest CCCU News Editorials by Rev. Mike Holbrook Upcoming CCCU Events Prayer Requests TIPS for Missions Churches & Districts Find a CCCU Church Northeast District South Central District West Central District West Indies District Resources Ministers & Church Reports Purchase Books Subscribe to the Evangelical Advocate CCCU School of Ministry Ministerial Continuing Ed Ministerial Benevolence Fund Sunday School Literature Forms Library E-Books Evangelists, Musicians, Pulpit Supply Slates Facebook CCCU Day at Avon Park Camp Date: Sat, Feb 10, 2024 Venue: Avon Park Holiness Camp Address: 1001 W Lake Isis Ave, Avon Park, FL 33825, USA Contact person: Rev. Gary Heimbach, This email address is being protected from spambots. You need JavaScript enabled to view it. Telephone: 740-474-8856 Powered by SimpleCalendar 3.2.1 Recent Editorials Let Us… His Name Shall Be Called The Hour Has Come The Rest of the Story Now What Are We To Do? No One Like Him What Will 2024 Bring? The Hope and Peace of Christmas Now Is the Time My God and My Country For Church Leaders E-Books Church Report Forms Evangelists, Musicians, Pulpit Supply Slates Missionary Directory Latest News 2025 District Council Update: West Central District General Missionary Departments Announces Growing Team World Gospel Mission Announces Presidential Search New Book Chronicles Life of CCCU’s First International Missionary Church Extension Annual Offering Most Popular Pages Home Page Placeholder Contact Us About the Missionary Department Welcome to the Missionary Department Minister and Church Reports © 2021 THE CHURCHES OF CHRIST IN CHRISTIAN UNION 1553 LANCASTER PIKE | CIRCLEVILLE | OHIO | 43113 | 740-474-8856 | FAX: 740-477-7766 Home Site Map Search Site Comments Contact Us Staff Login Smart Search"
    },
    {
      "url": "https://www.avonparkcamp.com/about/our-team",
      "text": "Our Team | About | Avon Park Camp Association, Inc. Toggle navigation Menu Home About Events News Live Stream Archives Bible Studies Concerts Encampments Friday Evening Services Special Events Contact Watch Live Stream Properties for Sale Homes Park Models Accommodations Apartments Dormitories Duplex RV Park Retreat Facilities for Rent Directory Give Our Team About Us Our Team Our Beliefs Avon Park Leadership Team Camp Officers and Board of Trustees From Left to Right Back Row Ray Fisher, Hardy Patton, Blake Neff, Gary Smith, Jerry Ausbrook, Janet Good From Left to Right Front Row Tim Hawk, Barry Long, Tom Zile, Beverly Cowles, Dale Dorothy, Jay Six Avon Park Camp Officers Executive Team Rev. Tom Zile, President Rev. Dale Dorothy, Vice President Beverly Cowles, Secretary Rev. Jay Six, Treasurer Rev. Tim Hawk, Member-at-Large Camp Board of Trustees 2024-2025 Rev. Jerry Ausbrook Ray Fisher Janet Good Rev. Barry Long Dr. Blake Neff Hardy Patton Rev. Gary Smith Meet Our Web Team Gary Good Web Master Rev. Wilma Ausbrook Web Content Manager Location 1001 West Lake Isis Avenue\n              \n              Avon Park, Florida\n              \n              33825 View on Google Maps Facebook Icon Home About Events News Live Stream Archives Bible Studies Concerts Encampments Friday Evening Services Special Events Contact Watch Live Stream Properties for Sale Homes Park Models Accommodations Apartments Dormitories Duplex RV Park Retreat Facilities for Rent Directory Give About About Us Our Team Our Beliefs Contact Phone: 1-863-453-6831 Email : office@avonparkcamp.com Office Hours Monday to Friday 8am - 12pm Camp 2/6-2/13; Mon-Sat, 1-4pm June-August, Mon-Firi; 8-10am © 2025 Avon Park Camp Association, Inc.. All Rights Reserved.\n| Login powered by Website Developed by Tithely bUJNYjZ0VCtuOWp0SmxmcCtxaWM3WWFqK0ZvaUc0c08reWQzRXhVNWZiOVgwY3BjNFlycjFxY2ZFWTEvK0FuRmk1ZlhlU21wTUovTDltRnJEOGNSaDFsVExvaVAyQUhwQUoxVHFXUWRDbWwzRmVuRUFuS1pRTUprdkt5Vmlkb3NMdTM0T1VURTdDcTZvTGpPYmpObitnPT0tLVNMM0hBQkRMV2dnU1R5T2pFcC9Ddnc9PQ==--2498e07334880db20ac735501be66c128295010a"
    },
    {
      "url": "https://www.avonparkcamp.com/events/calendar",
      "text": "Events | Avon Park Camp Association, Inc. Toggle navigation Menu Home About Events News Live Stream Archives Bible Studies Concerts Encampments Friday Evening Services Special Events Contact Watch Live Stream Properties for Sale Homes Park Models Accommodations Apartments Dormitories Duplex RV Park Retreat Facilities for Rent Directory Give Events List Calendar Subscribe to Calendar Filter All Events Loading... Location 1001 West Lake Isis Avenue\n              \n              Avon Park, Florida\n              \n              33825 View on Google Maps Facebook Icon Home About Events News Live Stream Archives Bible Studies Concerts Encampments Friday Evening Services Special Events Contact Watch Live Stream Properties for Sale Homes Park Models Accommodations Apartments Dormitories Duplex RV Park Retreat Facilities for Rent Directory Give About About Us Our Team Our Beliefs Contact Phone: 1-863-453-6831 Email : office@avonparkcamp.com Office Hours Monday to Friday 8am - 12pm Camp 2/6-2/13; Mon-Sat, 1-4pm June-August, Mon-Firi; 8-10am © 2025 Avon Park Camp Association, Inc.. All Rights Reserved.\n| Login powered by Website Developed by Tithely dldDeHVSUHRIUzRCM3p3TEdPWUVyYUszVXFYMVNsY3BQV1ZGZmVxYXJ4MDVJUWNKdVVIblBEU1Fnb3ZzdVpYQkw4Z0lHek9zSEpLYzFpZUIwcXRzTTM1OWFxNEtFVjlLRlcxeGZhNkpLWS9MQXVQdTVUbWI1bTJUUmlGTEo0TXEtLVdCUVNYNWVXN3ozZkxLQTlPa0FYSUE9PQ==--c490c47680eb652f788a5fdfea3fab656403aa2e"
    },
    {
      "url": "https://www.campwingmann.org/contact-us",
      "text": "Summer Camp Avon Park - Get In Touch With Us Today | Camp Wingmann top of page REGISTER Summer  2025 REGISTER Winter Camp Date & Rates Contact Us ABOUT WINGMANN About Our History Meet Our Leadership Team Blog SUMMER CAMP Summer Camp Programs & Activities Dates & Rates Cabin Life Health & Safety Meals & Nutrition Refer a Friend FAQs SUMMER PACKING LIST Schedule A Tour WINTER CAMP Winter Camp Winter Programs & Activities Winter Dates & Rates Winter FAQs Volunteer RETREATS & RENTALS Retreats Corporate Rentals Schedule A Tour WORK@CAMP Join Our Team Available Positions Staff Training Volunteer!!! EVENTS Upcoming Events DONATE Support Camp Amazon Wishlist Get Your BRICK! Donate! More Use tab to navigate through the menu items. Map CONTACT US Ask us anything! We're here to answer your questions. 3404 Wingmann Rd, Avon Park, FL 33825 Need to speak with someone ASAP? call us at 863-453-4800 office hours monday - thursday 8am - 1pm Directions ADMIN@CAMPWINGMANN.ORG 863-453-4800 CONTACT US © Copyright 2022 Camp Wingmann, Inc. All Rights Reserved. Privacy Policy | Non-Discrimination Clause bottom of page"
    },
    {
      "url": "https://www.avonparkcamp.com/pages/rv-park",
      "text": "RV Park | Avon Park Camp Association, Inc. Toggle navigation Menu Home About Events News Live Stream Archives Bible Studies Concerts Encampments Friday Evening Services Special Events Contact Watch Live Stream Properties for Sale Homes Park Models Accommodations Apartments Dormitories Duplex RV Park Retreat Facilities for Rent Directory Give RV Park RV Pull-in Rental Sites Pull-in Sites include mowing, water and sewage. You are responsible for the electricity. The Office Manager will have the meters read when you arrive and leave, or by the end of each month. You will be billed monthly for your electricty. If you stay one week or less, electricity is included in the price. Shared laundry facilities are available for a small fee. WiFi is available in most locations for a fee. RV pull-in rental rates listed below are effective September 1, 2025. Regular Rates plus Electricity $45 Daily     $120 Weekly     $435 Monthly Pull-in reservations require a one-week rate of $85 as a non-refundable deposit. Mailboxes are behind Building #25. You must first go to the post office to change your address to get your mail delivered to you. RV Park Model Sites Park Models that stay on the grounds year-round have an increase to the required annual fee. Beginning in January 2026, the annual fee will be $2245 or a monthly contracted rate of $205. A storage lot is available for $50 a month. Location 1001 West Lake Isis Avenue\n              \n              Avon Park, Florida\n              \n              33825 View on Google Maps Facebook Icon Home About Events News Live Stream Archives Bible Studies Concerts Encampments Friday Evening Services Special Events Contact Watch Live Stream Properties for Sale Homes Park Models Accommodations Apartments Dormitories Duplex RV Park Retreat Facilities for Rent Directory Give About About Us Our Team Our Beliefs Contact Phone: 1-863-453-6831 Email : office@avonparkcamp.com Office Hours Monday to Friday 8am - 12pm Camp 2/6-2/13; Mon-Sat, 1-4pm June-August, Mon-Firi; 8-10am © 2025 Avon Park Camp Association, Inc.. All Rights Reserved.\n| Login powered by Website Developed by Tithely aU55dXIvTUR3T3dHckF4VWR1Qmx1OWtnOXpoTWo5RE5wYmVKdWFEK0I5ZzBWUW9mcFRsd3ppUzFUYlpJWTdnZUE1Z01oSDRTekVWMmhYTUJ4dUJKMHVZSk96cGRvNWlwNVFwRExIQTlDY0IrdVVtYWthbzd1U2dvQjdTcE5OOWtKdU5zTDBsUndidTRNYURYeFprOFB3PT0tLWFyTm56ZDN3TWZZTVRnY2pBL3BIbnc9PQ==--b2fcc5624bb3329b8caa2506cc89008f6f3b1379"
    },
    {
      "url": "https://www.believeworldwide.net/united-states/avon-park/services-co%E2%80%99s-or-churches/avon-park-holiness-camp/connect",
      "text": "Contact Avon Park Holiness Camp, Local Businesses in Avon Park, Florida Loading BelieveWorldWide The #1 Christian Resource Directory 1-844-21-WORLD (844) 219.6753 Contact Us Member Login Home About Us List Free Here Join Home Services List My Business List My Church/Ministry Search My Needs Here Home Services Local Businesses Churches/Ministries Affiliate Profit Share Super Affiliates Affiliates Profit Share FAQ's Christian Business Insights Integrity Clause FAQ Login Home About Us List Free Here Join Home Services List My Business List My Church/Ministry Search My Needs Here Home Services Local Businesses Churches/Ministries Affiliate Profit Share Super Affiliates Affiliates Profit Share FAQ's Christian Business Insights Integrity Clause FAQ Login Home Florida Avon Park Local Businesses Avon Park Holiness Camp Send a Message Contact Avon Park Holiness Camp Name * Email Phone Number Preferred Reply Time Preferred Reply Time As soon as possible 12:00 am 1:00 am 2:00 am 3:00 am 4:00 am 5:00 am 6:00 am 7:00 am 8:00 am 9:00 am 10:00 am 11:00 am 12:00 pm 1:00 pm 2:00 pm 3:00  pm 4:00 pm 5:00 pm 6:00 pm 7:00 pm 8:00 pm 9:00 pm 10:00 pm 11:00 pm Location * Select Top Category Select an Option Local Businesses Message Get Replies from more members Yes No * I understand that information I enter will be stored and shared with relevant members of the site and that I may be contacted by these members and/or the admin of the website. The security check was not completed successfully. Back to Listing About Finding Christian Businesses/Churches is easy. Search our trusted network of top-rated Christian Businesses/Churches. Website How It Works Integrity Clause List Service/Church/Restaurant/Company Search Browse Categories Browse Locations Support Member Login Contact Us Christian Businesses/Churches - List Today © 2025 BelieveWorldWide All Rights Reserved Terms of Use Privacy Policy × Member Login * Email Address * Password Forgot Password? Click to Reset Password Not a Registered User? Create Free User Account Are You a Local Business? List Your Company Now"
    },
    {
      "url": "https://www.midfloridanewspapers.com/highlands_news-sun/faith_family/church-news/article_8fdf552a-8d48-11ee-a372-f7e5d51e4e84.html",
      "text": "Church news | Faith Family | midfloridanewspapers.com Skip to main content You have permission to edit this article. Edit Close Sign Up Log In Dashboard Logout My Account Dashboard Profile Saved items Logout Login I want to Read local news Find old stories Submit a News tip Write a letter to the editor Subscribe Start/Stop my paper Cancel Services Report that I didn't get my paper Download mobile app Place a classified ad Find a job Find something to do in the area Find staff numbers Buy a photo Learn about the Sun newspaper's history Publications Highlands News-Sun Highlands Sun Lakeland_sun Winter Haven Sun Clermont News Leader Triangle News Leader Four Corners Sun Sumter Sun Times News Business News Archives Classifieds Employment Real Estate Vehicles Place An Ad Obituaries Sports Local National Events Featured Sections Around Town Faith & Family Highlands Health Highlands_homes Well Being In The Heartland Marketing Ideas for Small Business Viewpoint Columns Editorials Letters to the editor Submit a letter Announcements Anniversaries Births Engagements Weddings Subscribe Start subscription Manage my subscription Carrier application E-Paper E-Paper Public Notices HNS Public Notices Florida Public Notices Contact Us Purchase Photos Submit a letter to the editor Submit a news tip Site search Search 77° Venice, FL (34285) Today Mixed clouds and sun this morning. Scattered thunderstorms developing this afternoon. High 87F. Winds NNE at 10 to 15 mph. Chance of rain 40%.. Tonight Scattered thunderstorms early, then cloudy skies after midnight. Low 74F. Winds NE at 5 to 10 mph. Chance of rain 60%. Updated: September 11, 2025 @ 3:13 am Full Forecast 863-385-6155 Facebook Menu Site search Search Sign Up Log In Dashboard Logout My Account Dashboard Profile Saved items Logout How to Set Up Your Account Home E-Paper Featured Sections Around Town Faith & Family Highlands Health Highlands Homes Well Being In The Heartland Welcome Home Marketing Ideas for Small Business Special Sections Obituaries Public Notices HNS Public Notices Florida Public Notices Subscribe Events AP News Business Entertainment International Lifestyles National Sports State Travel Washington Weather Share This Facebook Twitter WhatsApp SMS Email Church news Nov 29, 2023 Nov 29, 2023 Updated Jan 2, 2025 Facebook Twitter WhatsApp SMS Email Facebook Twitter WhatsApp SMS Email Print Copy article link Save Facebook Twitter WhatsApp SMS Email Print Copy article link Save Avon Park Holiness Camp Avon Park Holiness Camp at 1001 W. Lake Isis Ave. (across from Walmart and U.S. 27) will have a worship service at 7 p.m. Friday in the Tabernacle featuring speaker Gary Good, tech director and part-time camp resident. All are welcome. Call 863-453-6831 or email office@avonparkcamp.com . Watch via livestream at avonparkcamp.com . Tuesday at 10 a.m. Dr. Shawn Craigmiles will continue a Bible study in the Luce Lounge on “The Life and Ministry of Jesus” from the book of Mark. Church of Buttonwood Bay Pastor Cecil Hess will speak on “What Shall We Name the Baby?” at the morning worship service in the recreation hall on Sunday. Scripture is from Isaiah 9. Special music and hymn singing are part of this non-denominational service, which is open to all, residents and non-residents alike. The church is on U.S. 27, four miles south of HCA Florida Highlands Hospital. For information call 863-446-3695. Emmanuel United Church of Christ Rev. George Miller will be speaking on Jeremiah 33:14-18 at the Sunday worship service Dec. 3. The church is at 3115 Hope St., Sebring (off Hammock Road). For more information, call the church at 863-471-1999. First Baptist Church of Avon Park Rev. Chris Snider, senior pastor, and Rev. Brett Morey, associate pastor, will lead the Sunday worship service. The sermon will be from Luke 24:36-53 and is titled “The Commission of the Disciples.” Nursery is available for the morning service. The church is at 100 N. Lake Ave., Avon Park. For more information, call 863-453-6681 or email info@fbcap.net . First Baptist Church of Lake Josephine Pastor Stephen Ahrens will bring the message “Christmas at the Movies 2: The Polar Express” from Luke 1:30-35, 38 and Acts 4:7-22 at the both Sunday morning services. The evening Bible study is “Love Your Neighbor, Share Christ 5: 1 Hour Witnessing Workshop!” The church is at 111 Lake Josephine Drive, Sebring. For more information, visit the website www.fbclakejosephine.org , follow on Facebook or call 863-655-1524. First Presbyterian Church of Avon Park Pastor Bob Johnson’s sermon is titled “Full of Grace” based on Luke 1:26-38 at the Sunday morning service. Special music will be provided by the Music Team singing “Carol for Advent.” Sunday and on Sunday, Dec. 10, members are asked to bring new toys and new clothes for the Church Service Center and donations for Samaritan’s Touch Care Center. The church is at 206 E. LaGrande St., Avon Park. This is the back side of the church where there are two easily accessible entrances and ample parking. Church phone is 863-453-3242. Maranatha Baptist Church One of the highlights of Maranatha Baptist Church, at 35 Maranatha Blvd. in Sebring, is the annual production of the Christmas program. “When Angels Speak” will be presented by the choir and drama team at 7 p.m. Friday, Dec. 8, and at 6 p.m. Sunday, Dec. 10. For more information, call 863-382-4301. Sebring Church of the Brethren The church is holding membership classes at 2:30 p.m. Thursdays at the church. Food pantry is Fridays from 2-4 p.m. If you would like to make a donation of dried or canned goods please drop it off at the church. Wednesday night meals are in the community room Blough Hall. All are welcome to participate in the meal and the fellowship. The church is at 700 S. Pine St., Sebring. Phone 863-385-1597. Community Bible Church The church is hosting a Singles Group for single people of all ages on Mondays at 7 p.m. for Bible study and fellowship at the church fellowship hall. The church is at 1400 CR 17 A North, Avon Park (truck route). Pastor is Dr. Dave Lawson. For further information, call 863-452-5643. Call the church office to confirm the day and time. Facebook Twitter WhatsApp SMS Email Print Copy article link Save Recommended for you width=\"300\" height=\"270\" scrolling=\"no\" style=\"border:0;overflow:hidden\"> Latest News CRA focuses on beautifying Avon Park with art American Legion Post 69 raising money for wreaths Sports Briefs: Former Rays star Franco enters mental health clinic McCarthy rallies Vikings over Bears Florida teams off to a good start Latest e-Edition Highlands News-Sun To view our latest e-Edition click the image on the left. Associated Press News AP-Scorecard QUECTEL-WIRELESS Quectel Introduces Four New GNSS Antennas, Backed With Advanced GNSS Modules and Worldwide RTK Support, to Maximize Developer Choice TINECO IFA 2025: Tineco Honored for Innovation and Visionary Design Highlands Special Sections Special Sections South Florida State College Aug 30, 2025 Special Sections Fall High School Sports 2025 Aug 23, 2025 Special Sections Highlands Special Sections Aug 5, 2025 Obituaries Vilma Edith Ameglio Lopez Washburn James Bennett +2 Donald F. Rowe +2 Lyle T. Storlie John H. Yoder Sections Home News Opinions Entertainment Sports e-Edition Online Features Terms of Use Services Subscription_services Submission Forms Classifieds Place An Ad Search Weather midfloridanewspapers.com 321 N Ridgewood Dr Sebring, FL 33870 Phone: 863-385-6155 Email: webcomments@highlandsnewssun.com Facebook Unless otherwise stated, DR Media and Investments and/or licensor own the\n      intellectual property rights for all material on DR Media and Investments.\n      All intellectual property rights are reserved. You may view and/or print\n      pages from http://www.d-rmedia.com/ and its affiliate sites for your own personal use subject to restrictions\n      set in these terms and conditions. The reuse or sharing of any story on DR Media and Investments and its affiliate sites can not be done without written consent. © Copyright 2025 Mid Florida Newspapers 300 South Tamiami Trail, Venice, FL 34285, Venice, FL | Terms of Use | Privacy Policy Powered by BLOX Content Management System from BLOX Digital . × Browser Compatibility Your browser is out of date and potentially vulnerable to security risks. We recommend switching to one of the following browsers: Microsoft Edge Google Chrome Firefox"
    },
    {
      "url": "https://www.campwingmann.org/",
      "text": "Camp Wingmann - Check Out Our Christian-Based Summer Camp In Avon Park top of page REGISTER Summer  2025 REGISTER Winter Camp Date & Rates Contact Us ABOUT WINGMANN About Our History Meet Our Leadership Team Blog SUMMER CAMP Summer Camp Programs & Activities Dates & Rates Cabin Life Health & Safety Meals & Nutrition Refer a Friend FAQs SUMMER PACKING LIST Schedule A Tour WINTER CAMP Winter Camp Winter Programs & Activities Winter Dates & Rates Winter FAQs Volunteer RETREATS & RENTALS Retreats Corporate Rentals Schedule A Tour WORK@CAMP Join Our Team Available Positions Staff Training Volunteer!!! EVENTS Upcoming Events DONATE Support Camp Amazon Wishlist Get Your BRICK! Donate! More Use tab to navigate through the menu items. 1/4 welcome to wingmann! WATCH OUR VIDEO Camp Wingmann is a beautiful and holy place set aside for children, youth, and adults in the hope that they will meet Jesus and grow in their faith. Whether you are a member of a church or looking to explore your faith, Wingmann offers something for everyone. Not only does Camp Wingmann have summer and winter youth camps, but our location is the ideal setting for events and retreats. Located in Central Florida, we are easily accessible, offer a variety activities and modern facilities. CHURCH incentives FLEXIBLE REGISTRATION f activities WATERFRONT TO WORSHIP Dates & Rates WINTER & SUMMER 2024 REGISTER NOW FOR 2024 NEVER BEEN TO CAMP? Coming to camp for the first time can be scary for both kids and parents.  We know you are trusting us to keep campers engaged, happy, and most importantly safe!  And we take that job very seriously!  Because this is a big decision, we encourage you to speak with our leadership team.  We will answer all your questions to put your mind at ease. Schedule A Call Button \"It's a wonderful atmosphere for youth. Learning about Jesus and making friends with like interests and values.\" - Cindy, parent ADMIN@CAMPWINGMANN.ORG 863-453-4800 CONTACT US © Copyright 2022 Camp Wingmann, Inc. All Rights Reserved. Privacy Policy | Non-Discrimination Clause bottom of page"
    },
    {
      "url": "https://www.avonparkcamp.com/contact",
      "text": "Avon Park Camp Association, Inc. Toggle navigation Menu Home About Events News Live Stream Archives Bible Studies Concerts Encampments Friday Evening Services Special Events Contact Watch Live Stream Properties for Sale Homes Park Models Accommodations Apartments Dormitories Duplex RV Park Retreat Facilities for Rent Directory Give Contact Contact Phone: 1-863-453-6831 Email : office@avonparkcamp.com Office Hours Monday to Friday 8am - 12pm Camp 2/6-2/13; Mon-Sat, 1-4pm June-August, Mon-Firi; 8-10am Brenda Bartolomeo Office Manager Location 1001 West Lake Isis Avenue Avon Park, Florida 33825 USA Get in Touch! Name Email Message This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Location 1001 West Lake Isis Avenue\n              \n              Avon Park, Florida\n              \n              33825 View on Google Maps Facebook Icon Home About Events News Live Stream Archives Bible Studies Concerts Encampments Friday Evening Services Special Events Contact Watch Live Stream Properties for Sale Homes Park Models Accommodations Apartments Dormitories Duplex RV Park Retreat Facilities for Rent Directory Give About About Us Our Team Our Beliefs Contact Phone: 1-863-453-6831 Email : office@avonparkcamp.com Office Hours Monday to Friday 8am - 12pm Camp 2/6-2/13; Mon-Sat, 1-4pm June-August, Mon-Firi; 8-10am © 2025 Avon Park Camp Association, Inc.. All Rights Reserved.\n| Login powered by Website Developed by Tithely Kzh4bUVCK2ttbkxjd05pZXlGNG4wei8xVk9yajdNQTRZbU5BcExucGVubWRJSjRzUlFCZTM3NTljQXZFRS83L3pTUy9vSklBaGQvaUVHREloemI0RU5keGQwUVhGWlZva0xUYW1iK016SWpuSEdjaml4Q1R6aElWRHZ0WkVBTUdLdGFMd3N4V090Vm8wV2lTYko3MjBBPT0tLXRoQlZmbk1FYVROUlFHK0JQeHZqVVE9PQ==--33f52151c963debc35a1f6c8969b960ccac943d8"
    },
    {
      "url": "https://www.witherslackgroup.co.uk/our-locations/our-schools/avon-park-school/contact-us/",
      "text": "Contact Avon Park School Skip to main content Home 24 hour Referral Line: 0800 304 7244 Who We Are Main menu Our Offer Education Therapy Futures Our Approach ITAC The Wave Model Positive Behaviour Support Our Impact Case Studies Our Partners ESG News Parents Main menu Our Schools Our Pupils Advice and Support Admissions Professionals Main menu Our Locations Advice and Support Referrals Our Locations Advice and Support Main menu Events Resources Podcasts ADHD Autism EHCP Mental Health Speech, Language & Communication Sign Up Careers Main menu Job Search We are WG Huge Small Victories Benefits Talent Community Life at WG Career Development Inclusion and Belonging How We Hire Our Teams and Roles Care and Children's Homes Clinical Services Education and Teaching Head Office and Support Futures Apprenticeships WG Experience Blog Contact Us Contact Us Home 24 hour Referral Line: 0800 304 7244 Search our site / Our Locations / Our Schools / Avon Park School / Contact us Contact Us Avon Park School Our Offer Ofsted Policies Term Dates News Contact Us Get in touch Please get in touch with us if there's anything you'd like to ask. Send us your opinions, suggestions, questions, or just say hello. We'll get back to you as soon as possible! Address Avon Park School, St.John's Avenue, Rugby, CV22 5HR Telephone Tel: 01788 524 448 Out of term: 0800 304 7244 Email avon-park@witherslackgroup.co.uk Head Teacher Ms Kerri Louca-Weston Board Chair Ms Mary Aurens Privacy Notices Modern Slavery Statement Gender Pay Gap Cookies Policy Photography Young Person Privacy Notice Accessibility Statement Annual Report Advice and Support Sign up to receive our latest advice and support. Sign up here © © 2025 Witherslack Group Ltd Registered in England : 035​79​104. Registered Office: Lupton Tower, Lupton, Cumbria, LA6 2PR For press and media enquiries please contact Greenbrook on 0207 952 2000 or email witherslack@greenbrookadvisory.com"
    },
    {
      "url": "https://bb-360.org/contact-us/",
      "text": "Contact Us  - BB360 I am here to... Register for camp Work for Camp Rent Camp Donate Camps BB CAMP About BB Camp Dates & Rates Camp Activities Location Grants & Financial Aid New Camper Guide Parent Manual BB DAY CAMPS About BB Day Camp Dates & Rates Grants & Financial Aid BB Day Camp Parent Manuals Family Camps ADULT CAMPS Divorce and Discovery Last day of Camp Men’s Camp ReJewvenation Work for Camp Programs Youth Programs BB B’nai Mitzvah PJ Library School Break Camps Teen Programs BBYO BB B’nai Mitzvah Staff In Training Summer Leadership Programs Service Programs Lincoln County Food Program Events About Us BB360 About BB360 Staff & Board of Directors Impact Report Our History Men’s Camp The History of BB Camp Rent Camp Careers Work for BB360 Work for BB Camp Shop Our Swag Shop Contact Us Ways to give Giving Make a donation Buy a Paver Etz Chaim Legacy Society Second Century Fund Drive Volunteer Search BB360 Office Hours and Contact Info Office Address 6443 SW Beaverton-Hillsdale Hwy, Suite 234, Portland, OR 97221 Phone and Fax Phone: 503-496-7444 Fax: 503-452-0750 Email info@bbcamp.org BB Camp Phone 503-452-3443 (during the year only) BB Day Camp Phone 503-496-7447 Click here for a full staff list and phone numbers BB Camp Office Hours and Contact Info Hours (During Summer Season) Monday-Friday: 8:30 AM to 6:00 PM Saturday: Closed for Shabbat Sunday: 8:30 AM to 6:00 PM Phone 541-994-2218 Fax 503-452-0750 We check phone messages frequently when the office is closed, including evenings and throughout Shabbat. Have Questions? Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone Number Comment or Message Send Camp Mailing Address For the safety of our Campers, we do not share our location. Please address mail as follows: Campers Name and Grade in Fall BB Camp P.O. Box 110 Neotsu, OR 97364 contact us if you’re interested in visiting camp SIGN UP FOR CAMP BB Overnight Camp BB Day Camp Family Camps Leadership Programs WORK WITH US Work for Camp Work for BB360 DISCOVER MORE Make a Donation Events Rent Camp Volunteer Contact Us Privacy Policy Tax ID#: 91-1842787 Supported By The B’nai Brith Mens Camp Association, a 501(c)(3) Oregon non-profit, supports BB360. Register for Camp Returning Campers New Campers I have a question about Overnight Camp Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone Number Comment or Message Send Day Camps Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone Number Comment or Message Send BBYO/Teen programming Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone Number Comment or Message Send Year-round Youth & Family Events Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone Number Comment or Message Send Donations Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone Number Comment or Message Send Adult Events Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone Number Comment or Message Send Other Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone Number Comment or Message Send Copyright © 2025 BB360 - All rights reserved"
    },
    {
      "url": "https://www.avonparkcamp.com/",
      "text": "Avon Park Camp Association, Inc. Toggle navigation Menu Home About Events News Live Stream Archives Bible Studies Concerts Encampments Friday Evening Services Special Events Contact Watch Live Stream Properties for Sale Homes Park Models Accommodations Apartments Dormitories Duplex RV Park Retreat Facilities for Rent Directory Give Avon Park Camp Christ-Centered Christian Community Watch Live Stream Give On-Line Latest News Recent updates to help keep you in the loop. View All On-Line Giving Class Posted Feb  8, 2022 Improved Communications Posted Jun 22, 2021 On-Line Giving Posted May  2, 2021 Location 1001 West Lake Isis Avenue\n              \n              Avon Park, Florida\n              \n              33825 View on Google Maps Facebook Icon Home About Events News Live Stream Archives Bible Studies Concerts Encampments Friday Evening Services Special Events Contact Watch Live Stream Properties for Sale Homes Park Models Accommodations Apartments Dormitories Duplex RV Park Retreat Facilities for Rent Directory Give About About Us Our Team Our Beliefs Contact Phone: 1-863-453-6831 Email : office@avonparkcamp.com Office Hours Monday to Friday 8am - 12pm Camp 2/6-2/13; Mon-Sat, 1-4pm June-August, Mon-Firi; 8-10am © 2025 Avon Park Camp Association, Inc.. All Rights Reserved.\n| Login powered by Website Developed by Tithely MDB6enV3MnVSMjBLa2VZTEJDSEJrRkhxMkxiQnBVZnR6OTNDeEZLNHI5cmVIdVRGTEs1UHVXcDBhVVloVFdiMit4c1hSNG92bXFUYm5wc2lhZVFhaXFYeXFNWExGTGxVUXdpSUk1YmhZeGx5WE95VFF6UVRkMUlmTU9ORHRubnotLWlhZDhzY3cvLzVOT1RvcEdUNTNOQ1E9PQ==--326c4f71ecec949d57384c5f34e9c77ed179c929"
    },
    {
      "url": "https://www.avonparkcamp.com/events",
      "text": "Events | Avon Park Camp Association, Inc. Toggle navigation Menu Home About Events News Live Stream Archives Bible Studies Concerts Encampments Friday Evening Services Special Events Contact Watch Live Stream Properties for Sale Homes Park Models Accommodations Apartments Dormitories Duplex RV Park Retreat Facilities for Rent Directory Give Events Jonathan White Benefit Concert January 30, 2026 We welcome Jonathan back again! Jonathan White will share his love for Christ with his gift of music at a fundraising event for the Avon Park Camp Special Projects Fund. Join us on Friday night, January 30, 2026, at the 7 pm service in the Avon Park Tabernacle. Jonathan has been a great friend to the camp over the past years and has now scheduled this seventh benefit concert for us. Women's Events for 2025-2026 Ladies, Please Join in the Fun The Avon Park Auxiliary rejoices that $6000 was donated to the camp in 2025 for projects to improve our facilities, including the Rollings Dormitory kitchen and the tabernacle bathrooms. The auxiliary invites all women to participate in this season's upcoming events to provide volunteer support to make the activities successful. Bring your smile to greet our president's wife Debbie Zile, who will speak at our retreat. Check out upcoming events we have lined up as of now. November 20   Fall Prayer and Praise December 4-5   Auxiliary Garage Sale with Community-wide Sale January 30   Retreat - morning session followed with lunch February 1-8   Camp Meeting February 19   Men's Appreciation Breakfast March 5   Strawberry Shortcake Festival March 19   Ladies' Chat TBA   Spring Prayer and Praise Avon Park 87th Encampment Coming February 1-8, 2026 Call the office to make your reservations Daily Preaching Services, Bible Study, Missionary Moment and Music Ministry. Evangelists: Dr. James Diehl and Rev. David Gallimore ; Bible Teacher: Dr. John Oswalt Song Evangelist: Rev. Mark Murphy OMS Missionaries: Dr. Paul and Michelle Schuster who have served in Asia for over 26 years. WGM Missionaries : Louis Artoni and Nathan Waggoner serving in Albania. Avon Park Camp 87th Annual Encampment Schedule of Events February 1-8, 2026 Brochures are available in the Avon Park Office. Our Missionaires Will Speak M-F at 6 pm Monday February 2 is Missionary Day We welcome missionaries from One Mission Society serving in Asia, Dr. Paul and Michelle Schuster, and World Gospel Missions serving in Albania, Louis Artoni and Nathan Waggoner . In addition to the morning and evening services on Monday, the missionaries will speak Monday through Friday evenings at 6 pm. OMS missionaries Dr. Paul and his wife Michelle have served in Asia for 25 years. Paul and Michelle used their professions as he a veterinarian and she a nurse, to serve the Lord in East Asia. They currently live in Korea where they serve as the Regional Directors for the Asia/Pacific Region for OMS. They have four grown children, all of whom are married. WGM missionaries Luis and his wife Laura found that sports are an effective tool that can open doors and hearts to share the message of salvation. They both serve children and families in the disability community. Nathan and his wife Cydil felt called to missions from childhood. In September 2013, they landed in Albania. The Dining Hall Will Be Open for Camp Meeting Plan to dine in the morning and at at noon in the camp dining hall 7:30 to 8:15 am       Continental Breakfast 12 Noon to 12:45 pm       Dinner An evening meal will not be served, but hot dogs, chips, drinks, ice cream and desserts are available for a fee in the dining hall after the evening service. List Calendar Subscribe to Calendar Filter All Events Location 1001 West Lake Isis Avenue\n              \n              Avon Park, Florida\n              \n              33825 View on Google Maps Facebook Icon Home About Events News Live Stream Archives Bible Studies Concerts Encampments Friday Evening Services Special Events Contact Watch Live Stream Properties for Sale Homes Park Models Accommodations Apartments Dormitories Duplex RV Park Retreat Facilities for Rent Directory Give About About Us Our Team Our Beliefs Contact Phone: 1-863-453-6831 Email : office@avonparkcamp.com Office Hours Monday to Friday 8am - 12pm Camp 2/6-2/13; Mon-Sat, 1-4pm June-August, Mon-Firi; 8-10am © 2025 Avon Park Camp Association, Inc.. All Rights Reserved.\n| Login powered by Website Developed by Tithely b1pCUlpPRXY1SVE5N0RuaXFEdThwazFOSTBkK0hkdWE0VHlvUGhJV1YzdHF4ZEJjK1IzVjYxcFdWb2ozeDNaL2UrY01xRXBHaFpya3NqWDFkdGlYRDFLZHV3a0dQdGw1Y1gwM0hYQlBQZkk1emxiYzZhVEEvamQyemJocHN6RW8tLWtSU0NaWmg0cDZNQUJuTW5OZUd5YkE9PQ==--170527f7805b24bebb59b154ab7f1b3283d6f737"
    },
    {
      "url": "https://www.campwingmann.org/our-history",
      "text": "Christian Summer Camps Avon Park - Read Our History | Camp Wingmann top of page REGISTER Summer  2025 REGISTER Winter Camp Date & Rates Contact Us ABOUT WINGMANN About Our History Meet Our Leadership Team Blog SUMMER CAMP Summer Camp Programs & Activities Dates & Rates Cabin Life Health & Safety Meals & Nutrition Refer a Friend FAQs SUMMER PACKING LIST Schedule A Tour WINTER CAMP Winter Camp Winter Programs & Activities Winter Dates & Rates Winter FAQs Volunteer RETREATS & RENTALS Retreats Corporate Rentals Schedule A Tour WORK@CAMP Join Our Team Available Positions Staff Training Volunteer!!! EVENTS Upcoming Events DONATE Support Camp Amazon Wishlist Get Your BRICK! Donate! More Use tab to navigate through the menu items. our HISTORY The first Camp Wingmann was a week-long retreat for high school age Episcopalians held in 1928 at Moccasin Island, a few miles west of Davie, Florida in the Everglades. The place was primitive with little shade. There was a pool filled with black water and lots of mosquitoes. There was singing and chapel time, Christian Education, and lots of fun and games and in spite of the primitive setting, bugs and heat, everyone had a great time! The camp was named after two bishops of the Episcopal Diocese of South Florida: Cameron Mann, who was bishop from 1914 to 1932 and John Wing, who was assistant bishop (coadjutor) from 1925 to 1932, and then became diocesan bishop in 1932 until 1950. The next two or three years, Camp Wingmann was held at Crystal River on the Gulf Coast. Enthusiasm was high among the young people who attended, and more came each summer. In 1932, the camp was held at a hotel in Avon Park, and then for the next four summers, they rented Lake Byrd Lodge on the outskirts of Avon Park. The lodge was a rustic, three-story log structure reminiscent of the Old Faithful Inn in Yellowstone National Park. During the years the camp was at Lake Byrd Lodge, two other sessions were added: Camp Perry for young boys and Camp St. Mary for young girls. The high school camp continued to be called Camp Wingmann. In 1937, Lake Byrd Lodge was not available for the Christian summer camp, so it was moved to the Florida Military Institute in Haines City for one year. In  the  meantime, The  Diocese  of  South Florida at the request of Bishop Wing, was looking for a permanent location. The search was fulfilled when John Sears Francis, senior warden of the Church of the Redeemer in Avon Park, and his wife gave the diocese some property outside the little town on Trout Lake. Now the diocese began a fundraising campaign to provide money for building a permanent facility. However, times were hard. Florida was still in the grips of the Depression and giving was slow. Lacking a suitable location, there was no summer camp in 1938.  Finally, by the spring of 1939, the large sum of $16,000 had been raised. Construction  commenced, and soon, rustic buildings with yellow pine framework and cypress board and batten exteriors were erected. The new camp now had a mess hall with kitchen, five cabins, a caretaker cottage and a pump house. With great joy youngsters flooded to the camp that summer, which was now called Camp Wingmann. In 1939, the camp settled into its permanent new home. As the population of Florida grew in the coming years, so did the attendance at Camp Wingmann and the number of camp sessions. By 1960, there were seven sessions, each named after a saint: Camp St. Mark was for 11th and 12th graders, Camp St. Barnabas was for students entering 9th and  10th  grades, Camp  St. Ann  for  7th  and  8th  grade   girls, Camp St. Paul had 7th and 8th grade boys, Camp St. Mary campers were 4th through 6th grade girls, and Camp. St. Andrew had 4th through 6th grade boys as campers. There were also boys and girls who were not Episcopalians. It was called St. Francis and every young person who came was scholoarshipped by a local Episcopal Church. Camps at that time ran either 8 to 12 days in length and cost $26 and $39, respectively. During the 1950s, a chapel called All Angels' Chapel was built as a memorial to the service men and women from South Florida who had given their lives in World War II and Korea, and a house for the director was constructed. After another fundraising drive, four new buildings were added in 1960. A gym called the \"Rec Hall,\" another cabin, and a new house for the camp director (since the previous director's house was now a small monastery for Franciscan Friars) were all built. In addition, a large conference center with a small kitchen, chapel, and rooms for 60 adults was built. The conference center has unique architecture and was designed by a student of Frank Lloyd Wright. It was named for the bishop of the diocese at that time, Henry Louttit. In September that year, Hurricane Donna ripped through Florida, passing right over the camp. The old buildings weathered the storm, but the new ones were not so lucky. The new director's house lost half its roof and the side walls and windows of the rec hall were blown out. Luckily, the steel frame and roof remained intact and the damaged buildings were quickly repaired. In spite of the hurricane, the decade of the '60s was probably the heyday of Camp Wingmann. All sessions were at capacity and many kids had lots of fun and learned to love the Lord Jesus! ​ However, as time moved along, attendance began to shrink. In the 1970s, church camps were not as popular. By the late '70s, Camp Wingmann and the Louttit Conference Center were losing money. The old Episcopal Diocese of South Florida had split into three dioceses and now Camp Wingmann was located on the south end of the new Diocese of Central Florida. 1978 was a particularly bad year financially and the diocese had to pay the large deficit. A diocesan convention in the spring of 1979 decided to sell the property and use the proceeds to build a new conference center and youth camp near the center of the diocese (Orlando). So the old property was sold to the Missionary Alliance Church denomination. After a few years, it was sold to David Wilkerson's organization called Teen Challenge and then was again quickly sold to Tri County Rehabilitation Services who used the old camp as a drug rehab facility serving teens and adults. They called the place Trout Lake Camp. After a decade as a rehab center, the camp was once again put on the market. In the meantime, the Diocese of Central Florida had built a beautiful conference center on the east side of Orlando, near the small town of Oviedo, called Canterbury Retreat and Conference Center. It  was  a  fine  setting  for  adult  groups  having  motel type rooms and conference facilities, but it was not designed for kids. The diocese had virtually no summer camp program for twenty years. In 1998, Camp Wingmann was repurchased under the leadership of three alumni from the '60s who had a God-given vision to return the camp to what it was originally — a place for kids and Christ to come together. ​ It is now a year-round youth retreat center, the hub of youth activities for the Episcopal Diocese of Central Florida and a first-rate Christian summer camp. Enjoy these Historic PHOTOS! ADMIN@CAMPWINGMANN.ORG 863-453-4800 CONTACT US © Copyright 2022 Camp Wingmann, Inc. All Rights Reserved. Privacy Policy | Non-Discrimination Clause bottom of page"
    }
  ]
}