{
  "query": "axeholenpr.com email",
  "fuentes": [
    {
      "url": "https://axeholenpr.com/",
      "email": "chris@axeholenpr.com"
    },
    {
      "url": "https://www.trustindex.io/reviews/axeholenpr.com",
      "email": "info@trustindex.io"
    }
  ],
  "mails": [
    "info@axeholenpr.com",
    "chris@axeholenpr.com",
    "info@trustindex.io"
  ],
  "nombre_sitio": "axeholenpr.com",
  "origen_extraccion": "Busqueda externa paso: email",
  "textos_fuente": [
    {
      "url": "https://axeholenpr.com/",
      "text": "Home - Axe Hole NPR Skip to content 5761 Nebraska Ave, New Port Richey, FL 34652 (727) 271-2863 Home Axe Throwing 101 Safety Sign Waiver FAQs Pricing Events Host an Event Axe Throwing League Info Axe Hole To-Go Gift Cards Contact Us Book Now Home Contact Us Book Now Menu Home Axe Throwing 101 Safety Sign Waiver FAQs Pricing Events Host an Event Axe Throwing League Info Axe Hole To-Go Gift Cards Contact Us Book Now HISTORIC NEW PORT RICHEY'S DESTINATION FOR AN AXE-CITING GOOD TIME! BOOK NOW Let us axe you a question... Are you looking for the most satisfying and thrilling day or night out you’ll ever have? Axe Hole is the first of its kind in New Port Richey – a place where you can have an axe-slinging and bullseye-hitting good time! First-time thrower or not quite lumberjack status? Check out our Axe Throwing 101 to learn more about how it’s done.* Axe Throwing 101 Axe Hole, NPR Axe Hole, NPR * SCRUFFY beards and plaid shirts not required THE FULL AXE-PERIENCE Closed toed shoes required! No flip flops, sandals or high heels. PRICE $28 Per Hour Per Person PARTY Birthday? Bach? Grad? Other badassery?? Host an Event PLAY Ready to get started? Let’s get this thing booked! Book Now Sign the release ahead of time: Sign Waiver Invite Axe Hole to your party! Axe Hole To-Go CONTACT INFO, HOURS & LOCATION CONTACT INFO, HOURS & LOCATION OFFICIAL VENUE OF WATL & WKTL! Address 5761 Nebraska Ave New Port Richey, FL 34652 Phone (727) 271-2863 Hours Public Throwing Friday 5p-12a Saturday 12p-12a Sunday 1pm-7pm League Tuesday 6:30p Thursday 6:30p Get Directions BOOK NOW JOIN IN ON THE AXE-CITEMENT! axeholenpr Axe throwing venue in Downtown New Port Richey    🪓🪓🪓🪓 It's Friday! Ready to let loose? Grab an axe and g On Patriot Day, we stand united in remembrance, pa 🚧 CONSTRUCTION SPECIAL! 🚧\n\nYes, we're still The moment you grip that axe, it’s all business. Upcoming Events Get off your axe and come visit us! View More Events Get Social Keep up with Axe Hole news and promotions! Give them the axe In the nicest way possible, of course! Buy Gift Cards Site Map Home Axe Throwing 101 Safety Sign Waiver FAQs Pricing Events Host an Event Axe Throwing League Info Axe Hole To-Go Gift Cards Contact Us Book Now Contact Us 5761 Nebraska Ave, New Port Richey, FL 34652 (727) 271-2863 OFFICIAL VENUE OF WATL AND WKTL Insurance coverage provided by axethrowinginsurance.com . Copyright © 2025 Axe Hole NPR LLC. All rights reserved. Website Design by A Bit of Brit"
    },
    {
      "url": "https://www.trustindex.io/reviews/axeholenpr.com",
      "text": "Axe Hole NPR Reviews 2025 | Trustindex.io - Trustindex.io Categories For Businesses For Businesses Categories Restaurants & Bars Sports Bar Axe Hole NPR Axe Hole NPR Reviews Excellent rating 5.0 | 358 reviews Verified Company axeholenpr.com Visit this website Write a review Reviews 5.0 | 358 total 5 stars 352 pcs 4 stars 4 pcs 3 stars 1 pc 2 stars 1 pc 1 star 0 pc Source filter 358 pcs Verified Kim Lowe 2025.09.04 Such a great atmosphere, friendly and welcoming. Useful Report Reply from Axe Hole NPR 2023.04.01 Thank you!! Hope to see you in soon! Karen Schepers 2025.09.01 We had a great time! Made sure we knew what to do before we started, and offered guidance when needed. Useful Report Reply from Axe Hole NPR 2025.09.02 Thank you, Karen for taking the time to leave us a review! We hope to see you back again soon! Tyree McDowell 2025.09.01 We had such a blast learning to throw and our Coach was awesome!! So much fun and so engaged with us through the process.  We will definitely be back!! Useful Report Reply from Axe Hole NPR 2025.09.02 Thank you for leaving us a review! We hope to see you back again soon! Shelby Ambrowsky 2025.08.31 This was an amazing experience! It's perfect for date nights, birthdays, and more! Useful Report Reply from Axe Hole NPR 2025.09.02 Thank you, Shelby for leaving a review! We hope to see you back again soon! Emily Shillinglaw 2025.08.25 Useful Report Reply from Axe Hole NPR 2025.08.25 Thank you for your 5 star review, Emily! Sam Calloway 2025.08.24 Staff always so friendly and helpful. Useful Report Reply from Axe Hole NPR 2025.08.29 Thank you for your 5 star review, Sam! Lynn Wilson 2025.08.18 did not eat here - first time there and I had a great time, I will be back! Useful Report Reply from Axe Hole NPR 2025.08.29 Thank you for leaving us a kind review, Lynn. We hope to see you back again soon. Michael Benson 2025.08.11 We had an awesome time here. This was our first time axe throwing and the owner was great at giving us tips on hand placement and posture to get the best results. He also chatted with us about topics we all enjoyed. Will definitely be back and recommend to anyone! Useful Report Reply from Axe Hole NPR 2025.08.12 Thank you so much for your review, Michael and we hope to see you back again soon! Cheryl Hollingsworth 2025.08.05 I had the best birthday at Axe Hole. Chris was the best host and made sure we had a blast. The entire family enjoyed the activity. Great place to get together for fun and excitement.\nThanks Chris. We'll be back!\nCheryl H Useful Report Reply from Axe Hole NPR 2025.08.06 Thank you for taking the time to leave us a review and we hope to see you back again soon! Jules Dykstra 2025.08.03 Great experience! Useful Report Reply from Axe Hole NPR 2025.08.04 Thank you for your 5 star review! mariep101 Pichette 2025.07.27 Useful Report Reply from Axe Hole NPR 2025.07.28 Thank you for your review! Joy Elliott 2025.07.26 Had a blast! We walked in with a group of 5 with no reservation and were able to play right away. The coaches are awesome. Hats off to Chris and Cam for making the experience fun and funny! Useful Report Reply from Axe Hole NPR 2025.07.28 Thank you for leaving us such a kind review and we hope to see you back again soon! James Alex Thomasson 2025.07.25 Great folks and venue for a private event.\nEveryone had a blast. Useful Report Reply from Axe Hole NPR 2025.07.25 Thank you and we hope to see you again soon! Gabriella Hunsaker 2025.07.25 Useful Report Reply from Axe Hole NPR 2025.07.25 Thank you! Timberly Canfield 2025.07.24 Scheduled a team meeting. Second time here. Soooo much fun. Great instructors. Recommend this place for any group event. Useful Report Reply from Axe Hole NPR 2025.07.25 We're so glad to hear you had a great time! We hope to see you again soon! Stephen Skipper 2025.07.17 We recently hosted a group event at Axe Hole and had an absolutely fantastic time! The staff was incredibly informative, patient, and made sure everyone—from beginners to experienced throwers—felt comfortable and confident. The atmosphere was fun, energetic, and perfect for a larger group. Everyone had a great time, and we’ll definitely be back. Highly recommend for your next outing or team event! Useful Report Reply from Axe Hole NPR 2025.07.17 Thank you for leaving a thoughtful review and we hope to see you back again soon! Lisa Marie 2025.07.13 This was a great place for our family to hang out! The coaches were really awesome and our younger family members got to play with the arcade games which kept them busy so we could hang out as adults. I highly recommend it! My husband is even considering the league because it was so much fun. Useful Report Reply from Axe Hole NPR 2025.07.14 Thank you, Lisa for leaving us such a thoughtful review! We look forward to seeing you guys again soon and hope your husband joins our league!! FastPatch Drywall Florida 2025.06.28 Chris was awesome- We will definitely be back. Had a blast Useful Report Reply from Axe Hole NPR 2025.07.01 Thank you for taking the time to leave us a review! We hope to see you again soon! Jamie J 2025.06.28 Chris was an awesome instructor. We had a blast went for my husband's birthday. Didn't know I would enjoy throwing an axe as much as I did. Thank you we will be back Useful Report Reply from Axe Hole NPR 2025.07.01 We're so happy to hear that your husbands birthday was a success! We hope to see you again soon! karnage chaos 2025.06.28 Chris is very good at what he does. Went in for my birthday and had a blast. Can't wait to go again. Keep up the great job guys Useful Report Reply from Axe Hole NPR 2025.07.01 We're so happy you had a great time and hope to see you again soon! Happy Birthday!! More Company activity Claimed Profile Displaying Reviews Replies To Reviews In 1 Day Replied to 100% of reviews Top Rated Certificate About Axe Hole NPR Axe Hole NPR is trusted by over 342 happy customers, earning a 5-star rating! Explore real reviews and share your own experience. Contact axeholenpr.com +1 727-271-2863 Location HQ Address 5761 Nebraska Ave, New Port Richey 34652, United States Trustindex for Business 600.000+ businesses use Trustindex to collect and display Google reviews easily. Create a Free account TOP 5 Trustindex Features 100+ Review Platforms 40 Breathtaking review widgets Easy review collection Review image generator Review e-mail signatures Create a Free account Welcome My reviews Log out Login for Reviewers To write a review, you can log in here. Login Skyrocket Your Sales with Customer Reviews. No coding required. Create a Free Account Email support@trustindex.io Free Workshop Book an appointment now About Us Trustindex Ltd. Cheapest Review Management Software 1095 Budapest, Hungary\n                                Lechner Ödön fasor 3. support@trustindex.io Trustindex Community Copyright © 2025 All Rights Reserved www.trustindex.io | info@trustindex.io Trustindex Prices About Us Resources Contact Affiliate Program For Businesses Login Sign Up Terms of Use Privacy Policy Review Guidelines Google Seller Rating FAQ For Reviewers Login Review Guidelines Categories Trustindex"
    }
  ]
}