{
  "fuentes": [
    {
      "url": "https://axissecurityinc.com/",
      "email": "admin@axissecurityinc.com"
    },
    {
      "url": "https://www.axisproevents.com/corporate-events",
      "email": "rick@axisproevents.com"
    },
    {
      "url": "http://www.axis.productions/contact-1",
      "email": "arthur@axis.productions"
    },
    {
      "url": "https://www.linkedin.com/company/axis-productions-&-events",
      "email": "sperry@axisproevents.com"
    },
    {
      "url": "https://acehotel.com/contact/",
      "email": "accounting.ath@acehotel.com"
    },
    {
      "url": "https://acehotel.com/contact/",
      "email": "development@acehotel.com"
    },
    {
      "url": "https://acehotel.com/contact/",
      "email": "frontdesk.agents@acehotelnyc.com"
    },
    {
      "url": "https://acehotel.com/contact/",
      "email": "frontdesk@acehotelpsp.com"
    },
    {
      "url": "https://acehotel.com/contact/",
      "email": "reservations.ath@acehotel.com"
    },
    {
      "url": "https://acehotel.com/contact/",
      "email": "reservations.psp@acehotelpsp.com"
    },
    {
      "url": "https://acehotel.com/contact/",
      "email": "reservations@acehotelnyc.com"
    },
    {
      "url": "https://acehotel.com/contact/",
      "email": "s@acehotelnyc.com"
    },
    {
      "url": "https://acehotel.com/contact/",
      "email": "sales@acehotelnyc.com"
    },
    {
      "url": "https://acehotel.com/contact/",
      "email": "sales@acehotelpsp.com"
    },
    {
      "url": "https://www.axisproevents.com/lighting",
      "email": "rick@axisproevents.com"
    },
    {
      "url": "https://www.axisproevents.com/corporate-event",
      "email": "rick@axisproevents.com"
    },
    {
      "url": "https://www.axisproevents.com/audio",
      "email": "rick@axisproevents.com"
    },
    {
      "url": "https://axiseurope.com/about-us/",
      "email": "info@axiseurope.com"
    },
    {
      "url": "https://axisproevents.com/rosen-shingle-creek/",
      "email": "rick@axisproevents.com"
    },
    {
      "url": "https://axisproevents.com/",
      "email": "rick@axisproevents.com"
    },
    {
      "url": "https://www.axisbank.com/media-centre/senior-management/amitabh-chaudhry",
      "email": "pno@axisbank.com"
    },
    {
      "url": "https://www.axisbank.com/media-centre/senior-management/amitabh-chaudhry",
      "email": "corporate.communication@axisbank.com"
    },
    {
      "url": "https://www.jkvstudio.com/contact",
      "email": "info@jkvstudio.com"
    }
  ],
  "mails": [
    "accounting.ath@acehotel.com",
    "admin@axissecurityinc.com",
    "arthur@axis.productions",
    "corporate.communication@axisbank.com",
    "development@acehotel.com",
    "frontdesk.agents@acehotelnyc.com",
    "frontdesk@acehotelpsp.com",
    "info@axiseurope.com",
    "info@jkvstudio.com",
    "pno@axisbank.com",
    "reservations.ath@acehotel.com",
    "reservations.psp@acehotelpsp.com",
    "reservations@acehotelnyc.com",
    "rick@axisproevents.com",
    "s@acehotelnyc.com",
    "sales@acehotelnyc.com",
    "sales@acehotelpsp.com",
    "sperry@axisproevents.com"
  ],
  "nombre_sitio": "axisproevents.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://axissecurityinc.com/",
      "text": "Axis Security and Event Staffing Services Venues Sign In Home Services Venues Sign In Simple, Full-Service Security and Event Staffing Since 2006, Axis, Inc. has become one of the premier security and event staffing companies on the East Coast. Our company has gained distinction from our annual work at The Bonnaroo Music & Arts Festival, Hangout Festival, Electric Forest Festival, and Forecastle Festival, among many others. We provide services for both indoor and outdoor events throughout the southeast including, but not limited to, Bristol Motor Speedway, The University of Tennessee, East Tennessee State University, Freedom Hall Civic Center, The Historic Tennessee Theatre, The U.S. Cellular Center Asheville, Ascend Amphitheater, Western Carolina University, and The Tivoli Theatre. Axis, Inc. is licensed and insured, and is equipped to handle all aspects of concert, festival, and sporting event staffing. This includes security, crowd management, ticket-taking, ushering, parking services, guest services, and consulting. Railroad Earth at Bijou Theatre Steve Miller Band at Tennessee Theatre Bonnaroo Music & Arts Festival Manchester, TN Electric Forest Festival Rothbury, Michigan WE'RE READY TO STAFF YOUR EVENT If you would like to learn more about Axis and our services, we would love to hear from you. For general inquiries, or if you would like more information about scheduling an event please email us or give us a call. admin@axissecurityinc.com 423-929-2947 JOIN OUR TEAM At Axis, we're committed to creating a positive, challenging environment in which our team can thrive. If you would like to learn more about working with our team, please click the button below to submit an application. Apply Now Since 2006, Axis, Inc. has become one of the premier security and event staffing companies on the East Coast. Our company has gained distinction from our annual work at The Bonnaroo Music & Arts Festival, Hangout Festival, Electric Forest Festival, and Forecastle Festival, among many others. We provide services for both indoor and outdoor events throughout the southeast including, but not limited to, Bristol Motor Speedway, The University of Tennessee, East Tennessee State University, Freedom Hall Civic Center, The Historic Tennessee Theatre, The U.S. Cellular Center Asheville, Ascend Amphitheater, Western Carolina University, and The Tivoli Theatre. Axis, Inc. is licensed and insured, and is equipped to handle all aspects of concert, festival, and sporting event staffing. This includes security, crowd management, ticket-taking, ushering, parking services, guest services, and consulting. Johnson City Office Phone: 423.929.2947 Fax: 423.929.1117 © Copyright 2025 Axis Security, Inc. All rights reserved.\n            Photos by E.L. Smith Graphix Photos by E.L. Smith Graphix"
    },
    {
      "url": "https://www.axisproevents.com/corporate-events",
      "text": "Corporate Events - aXis Productions & Events Skip to content Home Corporate Event Production Corporate Event Management Stage Rental Audio / Video Home Corporate Event Production Corporate Event Management Stage Rental Audio / Video Corporate Events Corporate Galas & Benefits From the promenade at Rosen Shingle Creek to the ballroom at JW Marriott, the aXis Pro Corporate Events team will create an atmosphere and aesthetic that maximizes your client and guest experience. Contact Us Corporate Meetings & Livestreams Corporate Meeting, Presentation or Pitch, or a livestream to your client base internationally , aXis Pro Events will provide a first class experience and atmosphere for your special event. Contact Us Corporate Groundbreakings Introduce your clientele to your new home with a first class experience, including stage, audio and hospitality reflecting your brand. Contact Us Mobile Stage Rentals, Corporate Events, Meetings, Galas, Audio, Lighting and More in Orlando, Central Florida, International Drive. Get in Touch 4609 Parkbreeze Ct. Orlando, Fl 32808 407.230.1365 Rick@aXisProEvents.com Book a Consultation Facebook Instagram Linkedin © 2025 aXisPro Events, Inc. Fill out the form below and we'll get back to you! First Name Last Name Email Phone Number Message Send Fill out the form below and we'll get back to you! First Name Last Name Email Phone Number Message Send Fill out the form below and we'll get back to you! First Name Last Name Email Phone Number Message Send Fill out the form below and we'll get back to you! First Name Last Name Email Phone Number Message Send"
    },
    {
      "url": "http://www.axis.productions/contact-1",
      "text": "Contact — Axis Main 1000 Faces WIP Contact Menu Main 1000 Faces WIP Contact Axis Productions We are self-represented photographers, stylists, cinematographers, and artists. Contact us for availability on any of your film and photography production needs Open Form Client Inquiries Name * First Name Last Name Email Address * Message * Thank you!"
    },
    {
      "url": "https://www.linkedin.com/company/axis-productions-&-events",
      "text": "aXis Productions & Events | LinkedIn Skip to main content LinkedIn Top Content People Learning Jobs Games Join now Sign in aXis Productions & Events Events Services Orlando, Florida 409 followers Central Florida's preferred Corporate, Concert & Festival Stage, Audio, Lighting & Event company. Follow Discover all 10 employees Report this company About us aXis Productions & Events is a turnkey Event Coordination & Production company offering stage, sound, lighting for Corporate Events, Concerts & Festivals for over 20 years in the Central Florida area. Please email Sperry@aXisproevents.com for any information on your corporate function, concert, event or outdoor mobile stage and production needs. Website http://www.aXisproevents.com External link for aXis Productions & Events Industry Events Services Company size 2-10 employees Headquarters Orlando, Florida Type Privately Held Founded 2004 Specialties Stage, Audio, Lighting, Event Coordination, Corporate Events, Corporate Event Production, Corporate Galas, Corporate Meetings, Conferences, and Festivals Locations Primary 4451 Parkbreeze Ct Orlando, Florida 32808, US Get directions Orlando, US Get directions Employees at aXis Productions & Events Hector Navas Freelance Audio Engineer Aubrey Hunter Entertainment Management Major & Marketing Minor at the University of Central Florida | Aspiring Music Industry Professional Andrew Parra Audio Engineer | Live Event Technician | Student at Valencia College See all employees Updates aXis Productions & Events 409 followers 2w Report this post aXis Productions & Events had the privilege of assisting our friends at The Sharing Center with their annual 'Share The Light Gala' for a 5th year, another inspiring evening raising funds for the vital Seminole County social services hub, with this year's celebration at the DoubleTree by Hilton at the Entrance to Universal Orlando ... 6 Like Comment Share aXis Productions & Events 409 followers 1mo Edited Report this post aXis Productions & Events would like to congratulate ICON Park , Lorena Duarte , Jayleen Rivera and the entire marketing & events team on a first class welcome to Build-A-Bear Workshop with the Groundbreaking for their new multi-level flagship store on International Drive Orlando, making it the largest Build-A-Bear in the country... 11 Like Comment Share aXis Productions & Events 409 followers 2mo Report this post Happy 249th Birthday to the good ole USofA and a huge congrats to all our Parks & Recreation families in the Central Florida region for overcoming the challenges of a tropical system on the biggest event day of the festival calendar at Lake Nona , City of Mount Dora , Kissimmee Parks & Recreation , City of St. Cloud, FL , City of DeBary , City of Winter Springs , Celebration Town Hall ... +2 10 Like Comment Share aXis Productions & Events 409 followers 2mo Edited Report this post aXis Productions & Events had the privilege of assisting UCF College of Sciences with the official unveiling of UCF RESTORES groundbreaking Resiliency Command Center this past month at the University of Central Florida 's Memory Mall on the Main Campus... 5 Like Comment Share aXis Productions & Events 409 followers 3mo Report this post aXis Productions & Events enjoyed assisting the Dr. Phillips Charities team in transforming The Great Southern Box into the 1st Annual 'Dock & Dine' supporting the 4Roots Farm, featuring a Celebrity Chef presentation w/ Chef Akhtar Nawab and Chef Kevin Fonzo, followed by Yachty by Nature on the Mainstage... 4 Like Comment Share aXis Productions & Events 409 followers 3mo Report this post aXis Productions & Events was proud to sponsor the 37th Annual Lake Mary Heathrow Festival of the Arts, supporting Seminole County Public Schools awarding scholarships to a graduating Senior at all nine County High School programs... the Mainstage featured K-12 performers from local schools and regional Dance Groups, along with the Juried Artist Awards… 9 Like Comment Share aXis Productions & Events 409 followers 4mo Edited Report this post The aXis Productions & Events team would like to thank our new friends at the Hank Agency Group Inc for requesting our Audio & Lighting support for their post meeting mixers on the lawn at Four Seasons Hotels and Resorts Orlando  w/ the always electric Robyn Adele on the mainstage… 7 Like Comment Share aXis Productions & Events 409 followers 4mo Report this post The aXis Productions & Events team had a blast rocking ICON Park in the I-Drive District for Docebo 's post meeting afterparty, featuring the always dynamic Sugar Vibe  on the Deloitte Mainstage… 21 1 Comment Like Comment Share aXis Productions & Events 409 followers 4mo Edited Report this post aXis Productions & Events has the privilege as an Advisory Board Member to sponsor the annual University of Central Florida College of Sciences AlumKnights Awards, featuring the Nicholson School of Communication and Media Hall of Fame Recipient Heather Fagan , Chief of Staff for Orlando Mayor Buddy Dyer , as well as a special acknowledgement for the program's namesake, celebrating Tony Nicholson and Sonja Nicholson , at the picturesque The Celeste Hotel, Orlando, a Tribute Portfolio Hotel ... A big thank you to our supporting sponsors, AdventHealth , Cox Communications , Michele Plant Communications Michele Plant Kroupa , MckinnonStrong and Net Conversion ... 7 Like Comment Share aXis Productions & Events 409 followers 5mo Report this post aXis Productions & Events was honored to assist our friends and Winter Park Library family celebrating the 4th Annual \"Love Your Library\" Gala and Fundraiser again this year... it was smooth sailing with the always amazing Bash Orlando transforming the Winter Park Events Center, Library and Amphitheatre spaces into a Yacht Rock party featuring Entertainment Central Productions Summer Breeze onstage… 7 1 Comment Like Comment Share Join now to see what you are missing Find people you know at aXis Productions & Events Browse recommended jobs for you View all updates, news, and articles Join now Similar pages The Recording Academy Musicians Santa Monica, California Ever 7 Management Entertainment Providers Orlando, Florida Live Nation Entertainment Entertainment Providers Beverly Hills, California Bonnaroo Music and Arts Festival Entertainment Providers Nashville, TN Degy Entertainment Musicians Delray Beach, Florida On Location Entertainment Providers 152 Productions Entertainment Providers Orlando, Florida The Glass Knife Winter Park, Florida All Fired Up Winter Park Winter Park, Florida Colonel C Productions Events Services Orlando, Florida Show more similar pages Show fewer similar pages Browse jobs Pilot jobs 40,018 open jobs User Experience Designer jobs 13,659 open jobs Marketing Intern jobs 22,262 open jobs Lighting Technician jobs 3,176 open jobs Telecommunications Specialist jobs 11,982 open jobs Design Engineer jobs 129,783 open jobs More searches More searches Pilot jobs Market Research Associate jobs Director of Communications jobs Information Technology Recruiter jobs Market Research Analyst jobs Project Management Specialist jobs Research Analyst jobs Marketing Specialist jobs Stage Manager jobs Executive jobs Production Accountant jobs Host jobs Merchandiser jobs Assistant jobs LinkedIn © 2025 About Accessibility User Agreement Privacy Policy Cookie Policy Copyright Policy Brand Policy Guest Controls Community Guidelines العربية (Arabic) বাংলা (Bangla) Čeština (Czech) Dansk (Danish) Deutsch (German) Ελληνικά (Greek) English (English) Español (Spanish) فارسی (Persian) Suomi (Finnish) Français (French) हिंदी (Hindi) Magyar (Hungarian) Bahasa Indonesia (Indonesian) Italiano (Italian) עברית (Hebrew) 日本語 (Japanese) 한국어 (Korean) मराठी (Marathi) Bahasa Malaysia (Malay) Nederlands (Dutch) Norsk (Norwegian) ਪੰਜਾਬੀ (Punjabi) Polski (Polish) Português (Portuguese) Română (Romanian) Русский (Russian) Svenska (Swedish) తెలుగు (Telugu) ภาษาไทย (Thai) Tagalog (Tagalog) Türkçe (Turkish) Українська (Ukrainian) Tiếng Việt (Vietnamese) 简体中文 (Chinese (Simplified)) 正體中文 (Chinese (Traditional)) Language Agree & Join LinkedIn By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to see who you already know at aXis Productions & Events Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy ."
    },
    {
      "url": "https://acehotel.com/contact/",
      "text": "Contact Us | Ace Hotel calendar-icon Skip to content Go Back To Corporate Homepage Locations Select a language: EN EL JP KO CN hotel Location Choose Location -- required Choose Location * Athens Brooklyn Kyoto New York Palm Springs Seattle Sydney Toronto Check In Check In: Press enter to focus on the date grid and use the arrow keys to navigate between dates. Press the tab key to cycle between the date grid and the month selectors. Press escape to exit the date picker. Check Out Check Out: Press enter to focus on the date grid and use the arrow keys to navigate between dates. Press the tab key to cycle between the date grid and the month selectors. Press escape to exit the date picker. Guests Guest Selector -- Press this button to enter a dialog and select the number of adults and children -- Current selection: 1 Adult, 0 Children Adults - + Children - + code-type Have a code? Have a code? Select code type Select Code Type Group Promo Coupon Corporate Enter Code: Reset field Book Now Book Now Book Now - This opens the booking form overlay. Offers Shop - Link opens in new tab Goings On Goings On Artist In Residence A-List Ace Reader Planet Earth Weddings Eat + Drink Athens Sebastian - Link opens in new tab Brooklyn Lele's Roman - Link opens in new tab Kyoto Kōsa - Link opens in new tab PIOPIKO - Link opens in new tab Mr. Maurice's - Link opens in new tab New York Koloman - Link opens in new tab Libera - Link opens in new tab Palm Springs King's Highway - Link opens in new tab Sydney LOAM - Link opens in new tab Kiln - Link opens in new tab Toronto Alder - Link opens in new tab Evangeline - Link opens in new tab Athens Brooklyn Kyoto New York Palm Springs Seattle Sydney Toronto Fukuoka coming soon Offers Shop - Link opens in new tab Goings On Open Goings On Sub Navigation Goings On Artist In Residence A-List Ace Reader Planet Earth Weddings Eat + Drink Open Eat + Drink Sub Navigation Athens Open Athens Sub Navigation Sebastian - Link opens in new tab Brooklyn Open Brooklyn Sub Navigation Lele's Roman - Link opens in new tab Kyoto Open Kyoto Sub Navigation Kōsa - Link opens in new tab PIOPIKO - Link opens in new tab Mr. Maurice's - Link opens in new tab New York Open New York Sub Navigation Koloman - Link opens in new tab Libera - Link opens in new tab Palm Springs Open Palm Springs Sub Navigation King's Highway - Link opens in new tab Sydney Open Sydney Sub Navigation LOAM - Link opens in new tab Kiln - Link opens in new tab Toronto Open Toronto Sub Navigation Alder - Link opens in new tab Evangeline - Link opens in new tab Select a language: EN EL JP KO CN Accessibility Privacy Policy Press Inquiries Contact FAQs A-List Careers Manage Reservations Hotel Development Pet Friendly Hotels – Link opens in a new window – Link opens in a new window – Link opens in a new window Book Now Location Choose an Ace Hotel Location * Athens Brooklyn Kyoto New York Palm Springs Seattle Sydney Toronto Check In Check In: Press enter to focus on the date grid and use the arrow keys to navigate between dates. Press the tab key to cycle between the date grid and the month selectors. Press escape to exit the date picker. Check Out Check Out: Press enter to focus on the date grid and use the arrow keys to navigate between dates. Press the tab key to cycle between the date grid and the month selectors. Press escape to exit the date picker. Adults - Decrease number of adults + Increase number of adults Children - Decrease number of children + Increase number of children Have a promotional code? Select a code type Code Type Promo Corporate Group Coupon Enter code here Check Availability Manage Reservations Close the booking form Contact Us Get in touch with us by filling out the contact form, and we’ll get back to you as soon as possible. Fill out theContact Ace Hotelform below Contact Ace Hotel Name (Required) First Last Email (Required) Phone Who do you wish to contact? Select an option Ace Hotel New York Ace Hotel Kyoto Ace Hotel & Swim Club Palm Springs Ace Hotel Brooklyn Ace Hotel Seattle Ace Hotel Sydney Ace Hotel Toronto Ace Hotel & Swim Club Athens Shop Press Social Media What can we help you with? (Required) Choose an option Hotel Reservations Meetings, Private Events Group Sales Eat & Drink Jobs Press Folio / Receipt General What can we help you with? (Required) Choose an option Hotel Reservations Meetings, Private Events Group Sales Eat & Drink Jobs Press Folio / Receipt General What can we help you with? (Required) Choose an option Hotel Reservations Meetings, Private Events Group Sales Eat & Drink Jobs Press Folio / Receipt General What can we help you with? (Required) Choose an option Hotel Reservations Meetings, Private Events Group Sales Eat & Drink at Ace Hotel Kyoto Jobs Press Folio / Receipt Assistance during your stay General What can we help you with? (Required) Choose an option Hotel Reservations Meetings, Private Events Group Sales Eat & Drink Jobs Press Folio / Receipt General What can we help you with? (Required) Choose an option Hotel Reservations Meetings, Private Events Group Sales Eat & Drink Jobs Press Folio / Receipt General What can we help you with? (Required) Choose an option Hotel Reservations Meetings, Private Events Group Sales Eat & Drink Jobs Press Folio / Receipt General What can we help you with? (Required) Choose an option Hotel Reservations Meetings, Private Events Group Sales What can we help you with? (Required) Choose an option Hotel Reservations Meetings, Private Events Group Sales What can we help you with? (Required) Choose an option General Meetings, Private Events, Group Sales Press Message This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Δ Ace Hotel Directory Shop: shop@acehotel .spambreak .com Social Media: socialmedia@acehotel .spambreak .com Hotel Development Enquiries: development@acehotel .spambreak .com Press: press@acehotel .spambreak .com Looking for someone in particular? Get in touch directly with a specific hotel regarding reservations, front desk, sales and events, accounting or general info. The contact you’re looking for is listed by property below. Ace Hotel & Swim Club Athens Artemisiou 1 Glyfada 166 75, Greece Telephone: +30 21 0022 0188 General: frontdesk.ath@acehotel .spambreak .com Sales & Events: sales.ath@acehotel .spambreak .com Reservations: reservations.ath@acehotel.com Accounts: accounting.ath@acehotel.com Ace Hotel Brooklyn 252 Schermerhorn St Brooklyn, NY 11217 Tel: 718-313-3636 Reservations: 844-534-5792 Reservations: reservations.bk@acehotel .spambreak .com Events: events.bk@acehotel .spambreak .com Sales: sales.bk@acehotel .spambreak .com Folio/Billing: frontdesk.bk@acehotel .spambreak .com Ace Hotel Kyoto 245-2 Kurumayacho, Nakagyo Ward, Kyoto, 604-8185, Japan Tel: +81-75-229-9000 Reservations: +81-75-229-9001 Reservations: reservations.kyo@acehotel .spambreak .com Group Sales and Events: sales.kyo@acehotel .spambreak .com or +81-75-229-9002 Ace Hotel New York 20 W 29th Street New York, NY 10001 Tel: 212-679-2222 Reservations: 844-781-1157 Fax: 212-679-1947 Reservations: reservations@acehotelnyc.com Sales & Events: sale s@acehotelnyc.com Folio/Billing: frontdesk.agents@acehotelnyc.com Ace Hotel & Swim Club Palm Springs 701 East Palm Canyon Drive Palm Springs, CA 92264 Tel: 760-325-9900 Fax: 760-325-7878 Reservations: reservations.psp@acehotelpsp.com Sales: sales@acehotelpsp.com Events: sales@acehotelpsp.com Folio/Billing: frontdesk@acehotelpsp.com Ace Hotel Seattle 2423 First Avenue Seattle, WA 98121 Tel: 206-448-4721 Fax: 206-374-0745 General Information / Reservations: enquire.sea@acehotel .spambreak .com Sales: sales.sea@acehotel .spambreak .com Events: events.sea@acehotel .spambreak .com Ace Hotel Sydney 47-53 Wentworth Ave, Sydney NSW 2000, Australia Tel: +61 2 8099 8799 Reservations: reservations.syd@acehotel .spambreak .com Sales: sales.syd@acehotel .spambreak .com Events: events.syd@acehotel .spambreak .com Front Desk: frontdesk.syd@acehotel .spambreak .com Ace Hotel Toronto 51 Camden St, Toronto, ON M5V 1V2,  Canada. Phone: 416.637.1200 Reservations: reservations.tor@acehotel .spambreak .com Group Sales and Events: sales.tor@acehotel .spambreak .com Front Desk: frontdesk.tor@acehotel .spambreak .com Alder: inquire@aldertoronto .spambreak .com Atelier Ace New York Headquarters 276 5th Avenue, Suite 704 New York, NY 10001 Business: business@acehotel .spambreak .com Ace Hotel Instagram - this link opens in a new window Ace Hotel Facebook - this link opens in a new window Ace Hotel Twitter - this link opens in a new window Ace Hotel -\n            Go Back to Corporate Homepage Accessibility Privacy Policy Press Inquiries Contact FAQs A-List Careers Manage Reservations Hotel Development Pet Friendly Hotels Go to Ace Hotel's instagram page. Go to Ace Hotel's facebook page. Go to Ace Hotel's twitter page. – Link opens in a new window © Ace Hotel 2025"
    },
    {
      "url": "https://www.axisproevents.com/lighting",
      "text": "Lighting - aXis Productions & Events Skip to content Home Corporate Event Production Corporate Event Management Stage Rental Audio / Video Home Corporate Event Production Corporate Event Management Stage Rental Audio / Video Lighting Solutions Festival Lighting: Illuminating Your Experience From the Eye360 to the College Park Jazzfest, the aXis Pro Lighting team know how to create an atmosphere that caters to your crowd feeding their eyes and ears equally! Get a Quote LED: Illuminating Video Displays Intense DJ set? Intense Ballgame Viewing party? Or just an intense concert waiting to happen… our LED Displays are efficient and inexpensive for your special event. Get a Quote Thematic Accents: Interior/Exterior From a Radio Disney holiday to your 4th of July fireworks, aXis Pro Events will offer special attention to the colorful details that make your event light up the community. Get a Quote Mobile Stage Rentals, Corporate Events, Meetings, Galas, Audio, Lighting and More in Orlando, Central Florida, International Drive. Get in Touch 4609 Parkbreeze Ct. Orlando, Fl 32808 407.230.1365 Rick@aXisProEvents.com Book a Consultation Facebook Instagram Linkedin © 2025 aXisPro Events, Inc. Fill out the form below and we'll get back to you! First Name Last Name Email Phone Number Message Send Fill out the form below and we'll get back to you! First Name Last Name Email Phone Number Message Send Fill out the form below and we'll get back to you! First Name Last Name Email Phone Number Message Send Fill out the form below and we'll get back to you! First Name Last Name Email Phone Number Message Send"
    },
    {
      "url": "https://www.axisproevents.com/corporate-event",
      "text": "Corporate Event - aXis Productions & Events Skip to content Home Corporate Event Production Corporate Event Management Stage Rental Audio / Video Home Corporate Event Production Corporate Event Management Stage Rental Audio / Video Corporate Event Management Corporate Networking Events & Mixers With three decades in the Central Florida market our relationships are pivotal in helping you find and host the ultimate post conference networking event, concert or mixer. Contact Us Corporate Talent Booking & Acquisition With over 30 years of experience in booking everyone from Taylor Swift and DJ Shaq Diesel to the top regional Corporate Party Bands, our team will provide creative ideas for your Mainstage entertainment. Contact Us Corporate Activation & Branding From the lobby to the Mainstage, we will ensure your Brand is omnipresent for your guests and patrons, leaving a lasting impression (not to mention lots of social feed mentions)! Contact Us Mobile Stage Rentals, Corporate Events, Meetings, Galas, Audio, Lighting and More in Orlando, Central Florida, International Drive. Get in Touch 4609 Parkbreeze Ct. Orlando, Fl 32808 407.230.1365 Rick@aXisProEvents.com Book a Consultation Facebook Instagram Linkedin © 2025 aXisPro Events, Inc. Fill out the form below and we'll get back to you! First Name Last Name Email Phone Number Message Send Fill out the form below and we'll get back to you! First Name Last Name Email Phone Number Message Send Fill out the form below and we'll get back to you! First Name Last Name Email Phone Number Message Send Fill out the form below and we'll get back to you! First Name Last Name Email Phone Number Message Send"
    },
    {
      "url": "https://www.axisproevents.com/audio",
      "text": "Audio - aXis Productions & Events Skip to content Home Corporate Event Production Corporate Event Management Stage Rental Audio / Video Home Corporate Event Production Corporate Event Management Stage Rental Audio / Video Audio / Video Solutions Maximum Amplification: Signature Events Your community is your priority, and our Audio Techs understand the goals in creating an unforgettable atmosphere for you and your audience.  With an 18 year experience of producing the Florida Music Festival, our team is catering to you as the promoter and artist from the first phone call to the last note. Get a Quote Exterior Audio: Block Parties & Community Concerts From the annual College Park Jazzfest to UCF’s National Championship rally at Church Street Station, we’ve helped rock just about every block and field in the Central Florida area. Get a Quote Interior Audio: Corporate Galas & Conferences The aXis Pro audio consultants have provided sound installations from cafes to clubs to conference centers, so we’re confident we’ll make your room ring with clarity. Get a Quote Mobile Stage Rentals, Corporate Events, Meetings, Galas, Audio, Lighting and More in Orlando, Central Florida, International Drive. Get in Touch 4609 Parkbreeze Ct. Orlando, Fl 32808 407.230.1365 Rick@aXisProEvents.com Book a Consultation Facebook Instagram Linkedin © 2025 aXisPro Events, Inc. Fill out the form below and we'll get back to you! First Name Last Name Email Phone Number Message Send Fill out the form below and we'll get back to you! First Name Last Name Email Phone Number Message Send Fill out the form below and we'll get back to you! First Name Last Name Email Phone Number Message Send Fill out the form below and we'll get back to you! First Name Last Name Email Phone Number Message Send"
    },
    {
      "url": "https://axiseurope.com/about-us/",
      "text": "About Us - Axis Europe Skip to content Search for: Sectors Commercial Heritage Public Sector Social Housing Services Cladding Services Commercial Fit Out Services EV Charge Point Installation Fire Stopping Services Mechanical & Electrical Painting and Decorating Planned Maintenance Responsive Repairs Retrofitting Services Roofing Services Projects Project Videos Frameworks Careers Apprenticeships Jobs Subcontractors Responsible Business Community People Sustainability Women In Construction Responsible Business Report The Axis Foundation About Locations News Contact Us Search for: Sectors Commercial Heritage Public Sector Social Housing Services Cladding Services Commercial Fit Out Services EV Charge Point Installation Fire Stopping Services Mechanical & Electrical Painting and Decorating Planned Maintenance Responsive Repairs Retrofitting Services Roofing Services Projects Project Videos Frameworks Careers Apprenticeships Jobs Subcontractors Responsible Business Community People Sustainability Women In Construction Responsible Business Report The Axis Foundation About Locations News Contact Us Sectors Commercial Heritage Public Sector Social Housing Services Cladding Services Commercial Fit Out Services EV Charge Point Installation Fire Stopping Services Mechanical & Electrical Painting and Decorating Planned Maintenance Responsive Repairs Retrofitting Services Roofing Services Projects Project Videos Frameworks Careers Apprenticeships Jobs Subcontractors Responsible Business Community People Sustainability Women In Construction Responsible Business Report The Axis Foundation About Locations News Contact Us Search for: About Paul Smart 2025-04-03T16:19:46+01:00 About Us We are striving to be the UK’s best property service partner. Find out about our story, values, people & responsibilities. Axis History Vision Future Axis About us Axis is a dependable property services partner with a reputation for delivering exceptional services. We work with some of the UK’s largest building owners, landlords and facilities managers to provide strategic building repairs, planned maintenance and improvement across all property sectors. History Our story Axis was established in 1986 by brothers who still run the business today. We’re a family company which is why our deep-rooted values have shaped the way we work – whether that’s with our clients, people or communities. With honesty, cooperation and respect, we are dedicated to building strong partnerships to deliver the results that they need. Because we are committed to not just doing a job, but to doing a job well, Axis has established and maintains a strong reputation nationally for providing exceptional service. Vision An exceptional service Although Axis has experienced continual growth since its establishment in 1986, we’re not aiming to be the biggest service provider – we do, however, intend to be the best. We are committed to working closely with our clients to deliver a high standard of service,  whilst investing in communities and working responsibly to minimise our impact on the environment. That’s our vision. Future Here today, here tomorrow Guided by our values, we will continue to grow, invest in the development of our people and communities whilst focusing on our sustainable practices to ensure a prosperous future for people and the environment. With a strong credit rating of 5A1 and a turnover of £230m, we have the financial stability and are deemed a safe pair of hands whom the industry, our people, partners and wider communities can depend on. Axis Europe A Values Led Business Our work is tailored to the requirements of each sector but our values remain the same. We are a values-led company with eight founding principles. Honesty Integrity, honesty and commitment breeds integrity, honesty and commitment Respect Everybody deserves respect People Train and develop people – their growth becomes our growth Diversity Embracing diversity will broaden our horizons Cooperation Harmony, cooperation, and openness helps build strong relationships Community A community we contribute to will welcome and value us Environment Protect our environment – protect our future Safety Commitment to health and safety benefits everyone A Values Led Business Our disciplines are tailored to the requirements of each sector but our values remain the same. We are a values-led company with eight founding principles. Anyone who comes into contact with us, at any level, will be treated according to these values. Our aim is for these values to be synonymous with Axis, and vice versa. Honesty Integrity, honesty and commitment breeds integrity, honesty and commitment Respect Everybody deserves respect People Train and develop people – their growth becomes our growth Diversity Embracing diversity will broaden our horizons Cooperation Harmony, cooperation, and openness helps build strong relationships Community A community we contribute to will welcome and value us Environment Protect our environment – protect our future Safety Commitment to health and safety benefits everyone A Responsible Business Taking action to address our wider economic, social and environmental impacts, we ensure a responsible approach to all areas of our business. An Equal Opportunities Employer We celebrate diversity and are dedicated to providing equal opportunities for all prospective employees and Axis people. Our Registered Charity Each year, we donate over £100,000 to our registered charity, The Axis Foundation, to support small, local and impactful causes and charities. A Sustainable Approach Protect our environment, protect our future. We are committed to the continual improvement of sustainability within the construction industry. Want to find out more about Axis? Get in contact with a member of the Axis team, who will be happy to assist you with your enquiry. Contact Us Leadership Team Our talented and experienced team of directors lead by example. They play a fundamental role in steering our development and growth, whilst guiding Axis people to be the best that they can be. John Hayes Founder and Non-executive Director Having founded the business in 1986, John is an active member of the Board of Directors, developing and implementing strategy. Richard Morris Group Director and Chief Executive Officer Richard is the new Chief Executive of Axis Europe, joining in 2024, and CLC Group and has a wealth of exceptional leadership experience. Tim Hayes Managing Director of Maintenance Leading our housing repairs and maintenance division, Tim oversees the delivery of 300,000 repairs annually. He joined the Axis in 1986. Joe Ibrahim Managing Director of Projects Steering our Projects and Painting division, Joe leads on operational, commercial, safety, and supply chain matters. He joined Axis in 1989. Maria Northwood Director of Business Support Maria leads on all HR functions at Axis including recruiting, development, and performance management. She joined Axis in 2004. Paul Smart Director of Marketing & Communications Paul has grown and implemented our marketing and communication strategy since 2007. He also sits on the Executive Team and Business Continuity Committee. Rickardo Santana Chief Finance Officer & Company Secretary Rick has responsibility for the finances at Axis and also acts as the Company Secretary working with the Board of Directors. He has been at the company since 2017. Neil Betton Chief Information Officer (IT & Digital) Heading up Axis’ IT & Digital teams, Neil is responsible for our digital strategy and has led the company’s digital transformation since 2012 when he joined Axis. Download our reports To find out more about Axis, download our most recent reports and statements. Brexit Statement Gender Pay Gap Modern Slavery Act Equality & Diversity Quality Policy Disability Confident Anti-Bribery Policy Building Skills For the Future AXIS EUROPE Axis Europe specialise in the improvement and maintenance of Housing, Heritage, Education, Public and Commercial properties. We are based in London, with six regional offices around the United Kingdom. REGISTRATIONS Reg. No: 1991637 ENGLAND & WALES Reg. Office: Tramway House 3 Tramway Avenue Stratford E15 4PN COMPANY Toggle Navigation About Axis Foundation Responsible Business Jobs Locations News CAREERS Toggle Navigation Apprenticeships Jobs Subcontractors Work at Axis SECTORS Toggle Navigation Commercial Heritage Public Sector Social Housing Copyright 2020 Axis Europe | Sitemap | Terms & Conditions | Privacy Policy | Accessibility | Cookies | Slavery Act | LinkedIn AXIS EUROPE Axis Europe specialise in the improvement and maintenance of Housing, Heritage, Education, Public and Commercial properties. We are based in London, with six regional offices around the United Kingdom. REGISTRATIONS Reg. No: 1991637 ENGLAND & WALES VAT Reg. No: 435 0798 40 Reg. Office: 3 Tramway House Tramway Avenue Stratford E15 4PN 020 7564 2100 info@axiseurope.com Copyright 2020 Axis Europe | Sitemap | Terms & Conditions | Privacy Policy | Accessibility | Cookies | Slavery Act | LinkedIn AXIS EUROPE Axis Europe specialise in the improvement and maintenance of Housing, Heritage, Education, Public and Commercial properties. We are based in London, with six regional offices around the United Kingdom. REGISTRATIONS Reg. No: 1991637 ENGLAND & WALES VAT Reg. No: 435 0798 40 Reg. Office: 3 Tramway House Tramway Avenue Stratford E15 4PN 020 7564 2100 info@axiseurope.com Copyright 2020 Axis Europe Sitemap | Terms & Conditions | Privacy Policy | Accessibility | Cookies | Slavery Act | LinkedIn Page load link"
    },
    {
      "url": "https://axisproevents.com/rosen-shingle-creek/",
      "text": "Rosen Shingle Creek - aXis Productions & Events Skip to content Home Corporate Event Production Corporate Event Management Stage Rental Audio / Video Home Corporate Event Production Corporate Event Management Stage Rental Audio / Video Rosen Shingle Creek Corporate Meetings & Luncheons Being locally owned and operated, our team caters to your vision, and understands that your meeting or luncheon is designed to impress and engage your clients and audience while staying on budget. Get a Consultation Sean and his team support Harbor House of Central Florida’s largest fundraising event every year. T hey are always a true pleasure to work with. They work hard to get us the best quote, and are professional, friendly and do an excellent job. We cannot recommend them highly enough. Rebecca Ruggles Harbor House (Gatlin Terrace / Gatlin Ballroom) Fundraisers & Galas We understand that just because you’re at one of the top Meeting & Vacation Resorts in the country, you are still in the business of fundraising or meeting a specific budget. We’ll cater to your vision, while finding efficiencies and opportunites to meet your budget, all while producing a stunning and memorable event. Get a Consultation They worked tirelessly to make every single component of our event work and work well. I can’t recommend aXis enough, particularly Sean and Rick who were the backbone of our event! Christine O’Connor Homes.com (featuring John Mellancamp) Corporate\nNetworking Events & Mixers With three decades in the Central Florida market our relationships are pivotal in helping you find and host the ultimate post conference networking event, concert or mixer. Whether The Black Crowes on Gatlin Terrace or a local party band in the Sandlake Ballroom, we’ve got you covered! Get a Consultation From our introductory call to the final moment of the event, Rick took great care of me. Even though we were a smaller project than what they usually handle, he seemed to really care about the success of our event. They are now my go-to production team in Florida! Christy Burch Webinar Convention Mobile Stage Rentals, Corporate Events, Meetings, Galas, Audio, Lighting and More in Orlando, Central Florida, International Drive. Get in Touch 4609 Parkbreeze Ct. Orlando, Fl 32808 407.230.1365 Rick@aXisProEvents.com Book a Consultation Facebook Instagram Linkedin © 2025 aXisPro Events, Inc. Fill out the form below and we'll get back to you! First Name Last Name Email Phone Number Message Send Fill out the form below and we'll get back to you! First Name Last Name Email Phone Number Message Send Fill out the form below and we'll get back to you! First Name Last Name Email Phone Number Message Send Fill out the form below and we'll get back to you! First Name Last Name Email Phone Number Message Send"
    },
    {
      "url": "https://axisproevents.com/",
      "text": "Home - aXis Productions & Events Skip to content Home Corporate Event Production Corporate Event Management Stage Rental Audio / Video Home Corporate Event Production Corporate Event Management Stage Rental Audio / Video Central Florida's Preferred Event Production Resource Corporate Events From the General Session to the After Party, your Corporate Event Solution Learn More aXis Pro Events went above and beyond to make our event at ICON Park unforgettable. This unique venue posed some challenges for our type of event, but aXis worked tirelessly to make every single component of our event work and work well. Christine Rice CoStar Group We utilized aXis Pro for a private corporate event in Orlando. With our many changes up until the day of, they were incredibly flexible, knowledgable, and were a major player in pulling off such a successful event. Nicolette Keohane Live Nation Events They managed all of our audio, staging, and lighting for an event of 2,500 guests. It is always stressful to work with new vendors in a new city, and from day one they put our minds at ease Morgan Fernandez Revel Events Mobile Staging Mobile Staging Solutions for turnkey Outdoor installations. Learn More The Orlando Magic have been working with aXis Production and Events for the last two seasons and we couldn't be happier! We will use aXis for any production and event needs that we have in the future. Norman Shea Orlando Magic Professional and patient! They run a first class production company and have never let me down! I have worked with them many times and they make my job easier and are wonderful communicators! I would highly recommend them. Eva McMullin Vice President • S.R. Perrott aXis Production and Events is the best partner you can ask for. They are professional, transparent, extremely easy to work with and are very responsive. Thank-you for a seamless event in Orlando. April Bingham Impact XM Audio/Video Quality, Clarity & Confidence in the ultimate live experience. Learn More Event Partners Include Mobile Stage Rentals, Corporate Events, Meetings, Galas, Audio, Lighting and More in Orlando, Central Florida, International Drive. Get in Touch 4609 Parkbreeze Ct. Orlando, Fl 32808 407.230.1365 Rick@aXisProEvents.com Book a Consultation Facebook Instagram Linkedin © 2025 aXisPro Events, Inc. Fill out the form below and we'll get back to you! First Name Last Name Email Phone Number Message Send"
    },
    {
      "url": "https://www.axisbank.com/media-centre/senior-management/amitabh-chaudhry",
      "text": "Amitabh Chaudhry - Managing Director and Chief Executive Officer  - Axis Bank Personal Login Business Login Skip to Main Content We use cookies to improve your journey and to personalize your web experience. By continuing to use this site, you are accepting the bank’s cookie policy. I Accept close Fixed Deposits Domestic Fixed Deposits Domestic General (1 year to 1 year 10 days) 6.25 % Less than 3Cr 6.30 % 3Cr to less than 5Cr Domestic General (18 Months < 2 Years) 6.60 % Less than 3Cr 6.60 % 3Cr to less than 5Cr Domestic Sr. Citizen (1 year to 1 year 10 days) 6.75 % Less than 3Cr 6.80 % 3Cr to less than 5Cr Domestic Sr. Citizen (18 Months < 2 Years) 7.10 % Less than 3Cr 7.10 % 3Cr to less than 5Cr NRE (1 year to 1 year 10 days) 6.25 % Less than 3Cr 6.30 % 3Cr to less than 5Cr NRE (18 Months < 2 Years) 6.60 % Less than 3Cr 6.60 % 3Cr to less than 5Cr Know More Loans Home(Floating) 8.75% to 9.75% Know More Loan Against Property (Floating) Upto 9.30%*\r\n                                    p.a Know More Personal 9.99% to 22% Know More New Car Starting at 9.45% to 14.05% Know\r\n                                    More MCLR Tenor MCLR % Overnight 8.55% One\r\n                                                month 8.55% Three month 8.65% Six\r\n                                                month 8.70 % One\r\n                                                year 8.75% Two\r\n                                                year 8.85% Three year 8.90% Know\r\n                                        More Savings Account Starting from 2.50% Know More Foreign Currency Exchange Rate Buy |   Sell close check rates Start typing, then use\r\n                        the up and down\r\n                        arrows to select\r\n                        an option from the list Search by\r\n                            voice Search search close Banking is now at your fingertips with Axis Mobile! Give a missed call to 8422992272 to receive the\r\n                        download link for Axis Mobile via\r\n                        SMS close Personal Business SME Corporate Priority Burgundy NRI About Us Support Lodge a Complaint English English हिंदी Explore 250+ banking services on Axis Mobile App open. Scan to Download Explore offers, invest, download statement on Axis Bank\r\n                                            Mobile App open. Click to Download 24*7 Fund Transfer, Bill Pay, & UPI on Axis Bank Mobile\r\n                                            App open. Know\r\n                                        More! Register for\r\n                                WhatsApp Banking Locate Us Check rates for\r\n                                Fixed deposit,\r\n                                savings account, Forex and more 3 Notification Zero Down payment and 100% on road funding for 7 years with Axis Bank Car Loans. Apply Now Avail your dream Home with Axis Bank Home Loan and get 12 EMIs* waived off. *T&C apply Apply Now Get quick & easy Personal Loans with interest rates starting at 9.99% p.a. *T&C Apply Apply Now Click to open menu Explore\r\n                                    Products Retail Agri\r\n                                                        and\r\n                                                        Rural Accounts Deposits Cards Loans Forex Insurance Investments Government\r\n                                                            Product FASTag Digital\r\n                                                            Rupee Silver Linings Program Doctors\r\n                                                            Banking Program New Digital\r\n                                                            Savings Account New Digital\r\n                                                            Current Account New Digital\r\n                                                            Salary Account New Savings\r\n                                                            Account Current\r\n                                                            Account Salary\r\n                                                            Account Trust/ NGO\r\n                                                            Savings Account Public\r\n                                                            Provident Fund (PPF) National\r\n                                                            Pension System (NPS) AxisDirect Invest Account Safe\r\n                                                            Deposit Locker Safe Custody Pension\r\n                                                            Disbursement Account PMJDY Digital\r\n                                                            Fixed Deposit New Fixed\r\n                                                            Deposits Recurring\r\n                                                            Deposits Tax Saver\r\n                                                            Fixed Deposit Fixed\r\n                                                            Deposit Plus Auto Fixed\r\n                                                            Deposit Credit\r\n                                                            Card against FD Credit\r\n                                                            Cards Debit Cards Active Watch New Pre-paid Cards Credit\r\n                                                            Card against Fixed Deposit Transit\r\n                                                            Cards Commercial\r\n                                                            Credit Cards Commercial\r\n                                                            Debit Cards Digital\r\n                                                            Payments MyDesign -\r\n                                                            Customise your card Credit\r\n                                                            Card Control Center Debit Card\r\n                                                            Total Control Fair\r\n                                                            Practice Code - Credit Card Recurring\r\n                                                            Payments Business Loan New 24x7\r\n                                                            FlexiCredit New 24x7\r\n                                                            Loans Home\r\n                                                            Loan Personal Loan New Loan\r\n                                                            Against Securities Digital Lending Products Car Loan Education Loan Two\r\n                                                            Wheeler Loans Instant Loan on Credit Card Loan\r\n                                                            Against Property Gold\r\n                                                            Loan Loan\r\n                                                            Against Fixed Deposit Commercial\r\n                                                            Vehicle & Construction Equipment Loan Axis Bank Horizon - Overseas\r\n                                                            Education Forex\r\n                                                            Card International Fund Transfer Online\r\n                                                            Fund Transfer Foreign\r\n                                                            Currency Cash Foreign\r\n                                                            Currency Demand Drafts Axis Bank Horizon - Overseas\r\n                                                            Education RI Pro\r\n                                                            Deposit Inward Remittance Foreign Exchange Rates Mutual\r\n                                                            Funds Digital\r\n                                                            Gold Axis\r\n                                                            Direct Trading & Demat Account IPOSmart Sovereign Gold Bond Alternate Investment Products National\r\n                                                            Pension System (NPS) RBI\r\n                                                            Floating Rate Savings Bonds Start a SIP My Money Life\r\n                                                            Insurance General\r\n                                                            Insurance Health\r\n                                                            Insurance Pradhan\r\n                                                            Mantri Suraksha Bima Yojana Pradhan\r\n                                                            Mantri Jeevan Jyoti Bima Yojana About Our\r\n                                                            Insurance Partnerships Govt Small Savings\r\n                                                                Schemes Public\r\n                                                            Provident Fund Sukanya\r\n                                                            Samriddhi Yojana Kisan Vikas Patra Govt Pension\r\n                                                                Schemes Atal\r\n                                                            Pension Yojana Direct Benefit Transfer (DBT) Bharat Aadhaar Seeding Enabler Loans Accounts Rural Banking Financial Inclusion Farmer\r\n                                                            Funding Loans for\r\n                                                            Agri Traders & Processors Warehouse\r\n                                                            Receipt Loans MSME\r\n                                                            Samriddhi Loans Tractor\r\n                                                            Loans Gold\r\n                                                            Loan Microfinance Kisan\r\n                                                            Credit Card Loans for\r\n                                                            Horticulture Projects Micro\r\n                                                            Loans Krishi\r\n                                                            Current Account Krishi\r\n                                                            Savings Account Initiatives Branches Other\r\n                                                            services Business\r\n                                                            Correspondents Grab Deals Shop Now Earn\r\n                                                Cashback Ajio Amazon Flipkart Instant Vouchers Myntra Samsung View All Offers Banking\r\n                                                        Channel Credit\r\n                                                            Card Offers New Savings\r\n                                                            Account Offers New Debit\r\n                                                            Card Internet\r\n                                                            Banking UPI Transit-Card Prepaid-Card Categories Cashback\r\n                                                            Offers Mobile and\r\n                                                            Electronics Lifestyle Gifting Travel EMI Visa Limited Period\r\n                                            Offers Dil Se Open Celebrations Wednesday Delights Extraordinary Weekends Dining\r\n                                                    Delights EDGE REWARDS Rewards Store How Can I\r\n                                                    Earn Redeem Now Make Payments Pay Locker Rent Credit Card eNach Registration Investments Systematic Investment Plan (SIP) Insurance Premium National Pension\r\n                                                    System (NPS) Fixed\r\n                                                    Deposits Pay Taxes Direct and\r\n                                                    Indirect Taxes Tax Assist Overdue Payments Credit Card Bill\r\n                                                    Payment Pay My Dues Bank\r\n                                    Smart Online Banking Internet Banking E-statements Safe Banking Mobile Banking open by Axis Bank Axis Go New BHIM Axis Pay UPI\r\n                                                    App UPI Autopay SMS Banking Biometric Net\r\n                                                    Banking Payments One-View on Axis Mobile New My Money New Branch Banking ATM Banking Branch Banking Cash Deposit\r\n                                                    Machine Remote Banking Axis Remote Banking NextGen Banking Axis AHA! WhatsApp Banking Phone Banking Missed Call Service Phone Banking Doorstep\r\n                                                    Banking Unlearn Knowledge Centre Savings Investments Cards Credit\r\n                                                            Score & Behaviour Loans Payments Protection Macroeconomics Expert's Corner NRI Banking Safe Banking Digital Banking Taxation Business Open Digital A/c Login Internet Banking Personal Login Login Register neo for\r\n                                                    corporates New Login neo for business Login Login Register For Sole Props and Individuals with CA New IBU GIFT city\r\n                                                retail New Login IBU GIFT city corporate New Login Mobile Banking New Explore 250+ banking services on Axis Mobile App open. Scan to Download Click to download Axis Mobile App open Click to explore Axis Mobile App open CMS and Payment Solution Paypro Cards Multi-Currency Forex Card Credit Card\r\n                                                Login Prepaid Cards Transit Cards Power Access Power Access Remit Money Remit Money Register EDGE REWARDS EDGE REWARDS FASTag Retail Corporate English English हिंदी Explore 250+ banking services on Axis Mobile App open. Scan to Download Explore offers, invest, download statement on Axis\r\n                                                    Bank Mobile App open. Click to Download 24*7 Fund Transfer, Bill Pay, & UPI on Axis Bank\r\n                                                    Mobile App open. Know More! Register for WhatsApp Banking 3 notification Zero Down payment and 100% on road funding for 8 years with Axis Bank Car Loans. Apply Now Avail your dream Home with Axis Bank Home Loan and get 12 EMIs* waived off. *T&C apply Apply Now Get quick & easy Personal Loans with interest rates starting at 9.99% p.a. *T&C apply Apply Now login Home Media Centre Senior Management Amitabh Chaudhry Senior Management Amitabh Chaudhry Managing Director and Chief Executive Officer In a long and distinguished career, Amitabh has been unafraid to take risks, challenge norms and push the boundaries of conventional thinking across industries. Amitabh runs Axis Bank, a financial conglomerate, together with a world class leadership\r\n            team and a clearly defined vision of being a bank that fulfils the aspirations of a new, resurgent India through smart banking solutions. Over the past five years, Axis Bank has turned in industry leading performance on growth, profitability,\r\n            and sustainability through a mix of deep investments in digital, focus on customer experience, making a strategic bet on Bharat and being prudent on risk. The Bank also acquired the consumer business of Citibank India recently to strengthen\r\n            its wealth and credit card portfolio. These efforts under his leadership are clearly visible in the upward trajectory of Axis Bank’s performance. Before joining Axis Bank, Amitabh had a long stint as the CEO of HDFC Life, when he built one of the most valued life insurance franchises in the country. He built a culture of product innovation and a digital-first approach, shaping the industry’s\r\n            thought process and future aspirations. Amitabh started his career with Bank of America where he donned diverse roles like head of technology investment banking for Asia, regional finance head for wholesale bank and CFO (India). After 16 years\r\n            of banking, he switched careers and became part of the founding leadership team at Infosys BPM in 2003. He built a successful process outsourcing business in his 8 years stint, that set a benchmark on the nature of work that could transition\r\n            to India along with profitability. He also handled the Validation Services portfolio at Infosys. Amitabh is the Chairperson of the FICCI National Committee on Banking, since 2019. He has also served as Director on the board of several reputed organizations and has received numerous awards and recognitions. He is a director on the Boards of Axis Capital Limited, Axis Finance Limited and Axis Asset Management Company Limited. Amitabh is an Engineer from Birla Institute of Technology and Science, Pilani, and holds a postgraduate degree in Business Management from IIM, Ahmedabad. CONTACT\r\n US SMS Banking\r\n                                                                                        (Anytime,\r\n                                                                                        Anywhere) - Account Balance - Last 3 entries - New cheque book - Update email Missed Call\r\n                                                                                        Service\r\n                                                                                        (Toll Free) - Account balance - Mini Statement - Mobile re-charge WhatsApp\r\n Banking (Whatsapp ‘Hi’ to 7036165000) - Account balance - Mini Statement - New cheque book - Create & Renew FD - Credit Card details - Manage debit card limits - Set pins / Block card To get an account balance\r\n                                                                                instantly : SMS BAL to 56161600 / +91 9951 860 002 from your registered mobile To get a mini statement\r\n                                                                                instantly : SMS MINI to 56161600 / +91 9951 860 002 from your registered mobile Axis Bank Customer Care 1800 209 5577 / 1800 103\r\n                                                                                5577 (Toll free) 1860 419 5555 / 1860 500 5555 (Charges applicable as per the service provider) For NRI Phone Banking Numbers Click Here Axis Bank Branch\r\n                                                                                Locator Complaints and Grievance\r\n                                                                                Redressal RBI -\r\n                                                                                Integrated\r\n                                                                                Ombudsman Scheme,\r\n                                                                                2021 Comprehensive Notice\r\n                                                                                Board Aadhaar\r\n Enrolment Centres Services for Customers\r\n                                                                                with Disabilities CDSL/NSDL Investor\r\n                                                                                Grievance Escalation Matrix Details of Depository\r\n                                                                                Services Offered FAQs on Beneficial\r\n                                                                                Ownership SHAREHOLDERS' CORNER Stock Information Regulatory\r\n Disclosures Section Shareholder's\r\n Information Financial Results\r\n                                                                                &\r\n                                                                                other information Corporate\r\n Governance Compliance\r\n Calendar Investor FAQs Investor\r\n Contacts MEDIA\r\n CENTER Corporate\r\n Profile Vision and\r\n                                                                                Values Awards\r\n &\r\n                                                                                Recognition Press\r\n Releases Gallery Dil se open OTHER\r\n LINKS Digital Lending Products Extract\r\n of Board\r\n                                                                                Approved policy on Co-Lending Model Board\r\n Note & Guidelines - Resolution\r\n                                                                                Framework 2.0 Secured Assets\r\n                                                                                possessed under the SARFAESI Act,\r\n                                                                                2002 DigiSaathi\r\n Helpline Sparsh Board Careers Sustainability &\r\n                                                                                CSR Our ESG\r\n                                                                                Profile Download\r\n Forms Download-Product\r\n Guide Download-E\r\n Brochures Fees\r\n and Charges Forex\r\n Card Rate Premise\r\n for Branch Do Not Call\r\n                                                                                Registry Offers\r\n T&C Auction\r\n Notices IBC\r\n Disclosure Investment Knowledge\r\n                                                                                Bank Whistleblower Policy Positive\r\n Pay System RBI Kehta\r\n                                                                                Hai RBI\r\n Sachet\r\n                                                                                Portal RBI\r\n Udgam PAN\r\n AADHAAR Linking Bank\r\n Terminated Vendors Sanction Policy\r\n                                                                                Statement Customer Education\r\n                                                                                Literature on NPA and SMA\r\n                                                                                classification FAQs regarding\r\n                                                                                cancellation of Add-on Credit Cards Account\r\n Aggregator Credit Card T&C Business Correspondents -\r\n                                                                                Credit Cards Sitemap Forward Together :\r\n                                                                                IFSC Divestment of land\r\n                                                                                parcels along Yamunna\r\n                                                                                Expressway, Noida Regulatory\r\n Disclosures Fraud Awareness PNO / NODAL\r\n                                                                        DESK Level 1 –\r\n                                                                                Queries, Request or Complaint\r\n                                                                                Redressal Level 2 –\r\n                                                                                Write to Nodal Officer Level 3 –\r\n                                                                                Write to Principal Nodal\r\n                                                                                Officer (PNO@axisbank.com) LEA/ Other statutory authority contact\r\n                                                                                info Report\r\n a Fraud Axis Bank is registered with DICGC DICGC QR code Download open by Axis Bank Central KYC Registry Our\r\n Offerings Digital\r\n FD , Personal\r\n Loan , Car\r\n Loan , Home\r\n Loan , Savings\r\n Account , Zero\r\n Balance Savings Account , 24x7\r\n Loans , Credit\r\n Card , FD , FD\r\n Interest Rates , Education\r\n Loan , Current\r\n Account , Fastag , Trade\r\n & Forex , CMS , Digital\r\n Current Account , TATA AIG General\r\n                                                                                Insurance , ICICI Lombard General\r\n                                                                                Insurance , Axis\r\n Pay , open\r\n by Axis Bank , Internet\r\n Banking , PPF\r\n Account , Loan\r\n Against Securities , Mutual\r\n Fund Management , Digital\r\n Gold , Axis\r\n Family Book of Records , National\r\n Pension\r\n                                                                                System , Recurring\r\n Deposits , Lifetime\r\n Free Credit\r\n                                                                                Card , Airport\r\n Lounge Access Credit\r\n                                                                                Card Calculators Personal\r\n Loan EMI Calculator , Car\r\n Loan EMI Calculator , Home\r\n Loan EMI Calculator , FD\r\n Calculator , RD\r\n Calculator , Education\r\n Loan EMI Calculator , Life\r\n Insurance Calculator , SIP\r\n Calculator , EMI\r\n Calculator , Personal\r\n Loan Eligibility Calculator , Credit\r\n Card EMI Calculator , Annual\r\n Percentage Rate Calculator , PPF\r\n Calculator , Two\r\n Wheeler EMI Calculator Axis\r\n Group Axis Bank\r\n                                                                                Foundation , Axis Mutual Fund , Axis\r\n Securities Limited , Axis\r\n Finance , Axis\r\n Pension Fund , Axis Trustee , Axis Capital , A.TREDS Ltd. , Freecharge NRI NRI\r\n Banking , NRI Accounts , NRO\r\n Savings Account , NRI Deposit , NRI Fixed\r\n                                                                                Deposit , NRI Home Loan , NRI Insurance , NRI Investments , 4 in 1 NRI Investment Account NRI Mutual Funds Connect With Us On facebook linkedin Twitter youtube instagram Report\r\n a Fraud Axis Bank is registered with DICGC DICGC QR code Download open by Axis Bank Central KYC Registry Site best viewed in Google Chrome v79+, Microsoft Edge v80+, Mozilla Firefox v85+, Apple Safari v12.1+ at 1024 X 768 pixels resolution Please do not believe any entity using Axis Bank logos & branding to request the public for money in exchange for opening a Customer Service Point. Always use the customer care numbers displayed on Bank’s official website. Do not access unknown website links. RBI: Beware of\r\n                                                                Fictitious Offers/Lottery\r\n                                                                Winnings/Cheap Fund Offers. Copyright © Axis Bank Disclaimer Privacy Policy Code\r\n of Commitment Responsible\r\n Disclosure Policy × × Disclaimer Cancel Accept At your request, you are being redirected to a third party site. Please read and agree with the disclaimer before proceeding further. This is to inform you that by clicking on the \"Accept\" button, you will be accessing a website operated by a third party namely . Such links are provided only for the convenience of the client and Axis Bank does not control or endorse such websites, and is not responsible for their contents. The use of such websites would be subject to the terms and conditions of usage as stipulated in such websites and would take precedence over the terms and conditions of usage of www.axisbank.com in case of conflict between them. Any actions taken or obligations created voluntarily by the person(s) accessing such web sites shall be directly between such person and the owner of such websites and Axis Bank shall not be responsible directly or indirectly for such action so taken. Thank you for visiting www.axisbank.com × Disclaimer Cancel Accept At your request, you are being redirected to a third party site. Please read and agree with the disclaimer before proceeding further. This is to inform you that by clicking on the hyper-link/ok, you will be accessing a website operated by a third party namely Such links are provided only for the convenience of the Client and Axis Bank does not control or endorse such websites, and is not responsible for their contents. The use of such websites would be subject to the terms and conditions of usage as stipulated in such websites and would take precedence over the terms and conditions of usage of  www.axisbank.com in case of conflict between them. Any actions taken or obligations created voluntarily by the person(s) accessing such web sites shall be directly between such person and the owner of such websites and Axis Bank shall not be responsible directly or indirectly for such action so taken. Thank you for visiting www.axisbank.com Cover arranged by Axis Bank for its customers under Digit Illness Group Insurance Policy (UIN GODHLGP20142V011920). Participation to group insurance is voluntary. × Please select one of the below options to proceed Retail Internet Banking Corporate Internet Banking Redirection link x"
    },
    {
      "url": "https://www.jkvstudio.com/contact",
      "text": "Contact | Get In Touch Now — jkv studio 0 Skip to Content SOCIAL MEDIA CONTENT PRODUCTION Contact Open Menu Close Menu Contact SOCIAL MEDIA CONTENT PRODUCTION Open Menu Close Menu SOCIAL MEDIA CONTENT PRODUCTION Contact Let’s work together Name * First Name Last Name Email * Phone * (###) ### #### What services are you interested in? * Full-Service Social Media Management Content Production Graphic Design/ Web-Design A Blend of Things What is your budget? How did you hear about us? Network (a friend told me about you) Linkedin Social Media Message * Thank you! Contact Phone +41 76 544 68 99 E-Mail info@jkvstudio.com a swiss-based creative studio Work With Us Contact Us Internships Our Expertise Social Media Content About Us The Agency The Team info@jkvstudio.com +41 76 544 68 99 All rights reserved 2025 © JKV Studio GmbH"
    }
  ]
}