{
  "fuentes": [
    {
      "url": "https://www.70mai.com/us/contactus/",
      "email": "globalmarketing@70mai.com"
    },
    {
      "url": "https://www.70mai.com/us/contactus/",
      "email": "globalsales@70mai.com"
    },
    {
      "url": "https://www.70mai.com/us/contactus/",
      "email": "icon_1@2x.b00a9b5.png"
    },
    {
      "url": "https://www.70mai.com/us/contactus/",
      "email": "icon_1_h5@2x.abad2e4.png"
    },
    {
      "url": "https://www.70mai.com/us/contactus/",
      "email": "icon_2@2x.c9b1585.png"
    },
    {
      "url": "https://www.70mai.com/us/contactus/",
      "email": "icon_2_h5@2x.77e287f.png"
    },
    {
      "url": "https://www.70mai.com/us/contactus/",
      "email": "icon_3@2x.e0104bf.png"
    },
    {
      "url": "https://www.70mai.com/us/contactus/",
      "email": "icon_3_h5@2x.c56ccee.png"
    },
    {
      "url": "https://www.70mai.com/us/contactus/",
      "email": "icon_laguage@2x.531ec65.png"
    },
    {
      "url": "https://www.70mai.com/us/contactus/",
      "email": "icon_laguage_h5@2x.3b7a6d8.png"
    },
    {
      "url": "https://www.70mai.com/us/contactus/",
      "email": "img_banner@2x-27e7b81757072686570.webp"
    },
    {
      "url": "https://www.70mai.com/us/contactus/",
      "email": "img_banner@2x-3fb50b1757072686570.webp"
    },
    {
      "url": "https://www.70mai.com/us/contactus/",
      "email": "img_banner@2x-634bf81757072686570.webp"
    },
    {
      "url": "https://www.70mai.com/us/contactus/",
      "email": "img_banner@2x.884b87f.png"
    },
    {
      "url": "https://www.70mai.com/us/contactus/",
      "email": "img_banner_h5@2x-ad62cb1757072686570.webp"
    },
    {
      "url": "https://www.70mai.com/us/contactus/",
      "email": "img_banner_h5@2x.33d5294.png"
    },
    {
      "url": "https://www.70mai.com/us/contactus/",
      "email": "logo@2x.48ac6ea.png"
    },
    {
      "url": "https://www.70mai.com/us/contactus/",
      "email": "logo@2x.f8d22f5.png"
    },
    {
      "url": "https://www.70mai.com/us/contactus/",
      "email": "logo_h5@2x.af931b8.png"
    },
    {
      "url": "https://www.70mai.com/us/contactus/",
      "email": "logo_h5@2x.f8d22f5.png"
    },
    {
      "url": "https://backyard-expressions.com/pages/contact",
      "email": "customerservice@ddicorp.com"
    },
    {
      "url": "https://backyard-expressions.com/pages/contact",
      "email": "ddiparts@ddicorp.com"
    },
    {
      "url": "https://www.nps.gov/aboutus/contactus.htm?StartRow=51&pk=&sn=fe",
      "email": "app-promo-phones@2x.png"
    },
    {
      "url": "https://www.calpool.com/backyard-biography-here-comes-the-bride/",
      "email": "info@calpool.com"
    },
    {
      "url": "https://backyardftl.com/backyard/beyond-brunch-tickets/",
      "email": "info@backyardftl.com"
    },
    {
      "url": "https://backyardhouse.com/contact-us/",
      "email": "info@backyardhouse.com"
    },
    {
      "url": "https://backyardftl.com/private-events/",
      "email": "info@backyardftl.com"
    },
    {
      "url": "https://backyardftl.com/private-events/",
      "email": "sales@damngoodhospitality.com"
    },
    {
      "url": "https://backyardftl.com/private-events/",
      "email": "shanel@damngoodhospitality.com"
    },
    {
      "url": "https://backyardftl.com/contact/",
      "email": "info@backyardftl.com"
    },
    {
      "url": "https://backyardftl.com/contact/",
      "email": "info@backyardftl.com"
    },
    {
      "url": "https://backyardftl.com/contact/",
      "email": "info@stacheftl.com"
    },
    {
      "url": "https://backyardftl.com/party-packages/",
      "email": "info@backyardftl.com"
    },
    {
      "url": "https://backyardftl.com/party-packages/",
      "email": "shanel@damngoodhospitality.com"
    },
    {
      "url": "https://backyardftl.com/",
      "email": "info@backyardftl.com"
    },
    {
      "url": "https://backyardftl.com/",
      "email": "shanel@damngoodhospitality.com"
    },
    {
      "url": "https://backyardftl.com/terms-conditions/",
      "email": "contact@blnkcnvs.com"
    },
    {
      "url": "https://backyardftl.com/terms-conditions/",
      "email": "info@backyardftl.com"
    },
    {
      "url": "https://backyardftl.com/terms-conditions/",
      "email": "info@damngoodhospitality.com"
    }
  ],
  "mails": [
    "app-promo-phones@2x.png",
    "contact@blnkcnvs.com",
    "customerservice@ddicorp.com",
    "ddiparts@ddicorp.com",
    "globalmarketing@70mai.com",
    "globalsales@70mai.com",
    "icon_1@2x.b00a9b5.png",
    "icon_1_h5@2x.abad2e4.png",
    "icon_2@2x.c9b1585.png",
    "icon_2_h5@2x.77e287f.png",
    "icon_3@2x.e0104bf.png",
    "icon_3_h5@2x.c56ccee.png",
    "icon_laguage@2x.531ec65.png",
    "icon_laguage_h5@2x.3b7a6d8.png",
    "img_banner@2x-27e7b81757072686570.webp",
    "img_banner@2x-3fb50b1757072686570.webp",
    "img_banner@2x-634bf81757072686570.webp",
    "img_banner@2x.884b87f.png",
    "img_banner_h5@2x-ad62cb1757072686570.webp",
    "img_banner_h5@2x.33d5294.png",
    "info@backyardftl.com",
    "info@backyardhouse.com",
    "info@calpool.com",
    "info@damngoodhospitality.com",
    "info@stacheftl.com",
    "logo@2x.48ac6ea.png",
    "logo@2x.f8d22f5.png",
    "logo_h5@2x.af931b8.png",
    "logo_h5@2x.f8d22f5.png",
    "sales@damngoodhospitality.com",
    "shanel@damngoodhospitality.com"
  ],
  "nombre_sitio": "backyardftl.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.70mai.com/us/contactus/",
      "text": "Contact Us éæ©å¦ä¸ä¸ªå½å®¶æå°åºï¼ä»¥è·å¾éç¨äºä½ æå¨ä½ç½®çåå®¹åå¨çº¿è´­ç©éé¡¹ã ä¸­å½å¤§é No data ç»§ç»­ Dash Cams Accessories Support Where to Buy About 70mai Share Your Footage Why Dashcam Store For Business Cooperation globalsales@70mai.com For Media Inquiries globalmarketing@70mai.com For Product Support please visit our Customer Care Center Products + Dash Cams Accessories Support + Customer Support App Download About 70mai + About Us Press and Media Contact Us Stay in the know Sign up to receive newsletters and promotional offers from 70mai. By signing up, you agree to 70mai's Privacy Policy . Sign up Subscribe to our newsletter: Sign up Please enter a valid email address. By signing up, you agree to 70mai's Privacy Policy . Copyright 2025 70mai.com. All Rights Reserved. United States / English Select Your Country/Region è¯·åè¿è¡éªè¯ 70mai uses strictly necessary cookies and related technologies to enable the website to function. By clicking on accept,\n            you agree to the use of this technology across the web. For more information on cookie practices, please refer to our Cookie Policy . Manage Cookies Accept"
    },
    {
      "url": "https://backyard-expressions.com/pages/contact",
      "text": "Contact\n\t\t\n\t\t\n\t\t – Backyard Expressions Skip to content Home Products Outdoor Furniture Patio Furniture Hammocks and Hammock Chairs Campfire Furniture & Accessories Yard & Garden Decor Patio Coolers Garden Decor, Fountains and Statuary Lighting and Lanterns Gazebos, Canopies, and Shade Gazebos & Pergolas Umbrellas Umbrella Bases Sun Sails Garden Utilities Raised Beds & Planters Hose Reels, Garden Carts, & Other Gardening Greenhouses Birding Bird Baths Bird Feeders Bird Houses Pets Dog Crates Pet Beds Dog Bowls Equestrian Live Animal Traps Replacement Parts Gift Cards Contact Us About Us Facebook Instagram Update country/region English Update country/region Canada (CAD $) Czechia (CZK Kč) United States (USD $) Update country/region Login Home Products Outdoor Furniture Patio Furniture Hammocks and Hammock Chairs Campfire Furniture & Accessories Yard & Garden Decor Patio Coolers Garden Decor, Fountains and Statuary Lighting and Lanterns Gazebos, Canopies, and Shade Gazebos & Pergolas Umbrellas Umbrella Bases Sun Sails Garden Utilities Raised Beds & Planters Hose Reels, Garden Carts, & Other Gardening Greenhouses Birding Bird Baths Bird Feeders Bird Houses Pets Dog Crates Pet Beds Dog Bowls Equestrian Live Animal Traps Replacement Parts Gift Cards Contact Us About Us 0 Stay up to Date on Parts Coming Back in Stock Join our mailing list to receive updates when popular parts are back in stock Email Backyard Expressions Contact Us For any inquiries or assistance, please don't hesitate to reach out to us. We pride ourselves on quick and  effective customer service. All inquiries should be addressed by someone on our team within 1-2 business days. If you have not received a response after this time please feel free to reach out again. For general help, you can contact our customer service team at customerservice@ddicorp.com . If you need information on parts, please direct your queries to ddiparts@ddicorp.com . Additionally, you can reach us by phone at 1-612-888-7550. Feel free to text or call this line; though automated, rest assured we'll promptly address your concerns. Alternatively, you can engage with our chatbot on the website for immediate assistance with simple issues. If nobody is online we will reach out in a prompt manner. For the swiftest assistance, we recommend contacting us via email. We're here to help! MENU Home Products Outdoor Furniture Patio Furniture Hammocks and Hammock Chairs Campfire Furniture & Accessories Yard & Garden Decor Patio Coolers Garden Decor, Fountains and Statuary Lighting and Lanterns Gazebos, Canopies, and Shade Gazebos & Pergolas Umbrellas Umbrella Bases Sun Sails Garden Utilities Raised Beds & Planters Hose Reels, Garden Carts, & Other Gardening Greenhouses Birding Bird Baths Bird Feeders Bird Houses Pets Dog Crates Pet Beds Dog Bowls Equestrian Live Animal Traps Replacement Parts Gift Cards Contact Us About Us Contact Us About Us Search Return Policy Terms of Service Social Links Follow and Like us on Facebook for Exclusive Offers and Updates Facebook JOIN OUR MAILING LIST Sign up to get updates on when parts are back in stock and on limited time sales Email © 2025 Backyard Expressions, All rights reserved. Powered by Shopify Update country/region English Update country/region Canada (CAD $) Czechia (CZK Kč) United States (USD $) Update country/region Amazon American Express Apple Pay Diners Club Discover Google Pay Mastercard Shop Pay Visa Cart Close Your cart is currently empty. Start Shopping Select options Close"
    },
    {
      "url": "https://www.nps.gov/aboutus/contactus.htm?StartRow=51&pk=&sn=fe",
      "text": "Contact Us (U.S. National Park Service) An official website of the United States government Here's how you know Here's how you know Official websites use .gov A .gov website belongs to an official government\norganization in the United States. Secure .gov websites use HTTPS A lock ( Lock Locked padlock icon ) or https:// means you've safely connected to\nthe .gov website. Share sensitive information only on official,\nsecure websites. Skip to global NPS navigation Skip to the main content Skip to the footer section National Park Service Search Search This Site All NPS Open Menu Close Menu Explore This Park Explore the National Park Service Exiting nps.gov Cancel About Us Contact Us Contact Us Important Links Frequently Asked Questions Entrance Passes Jobs Pets Help us help you by directing your question to the right people! Before you send an email, check out frequently asked questions , which includes information about the National Park Service, visiting parks (including entrance passes ), and other topics. Parks For information about a specific park (or to report an error on a park webpage), type the park's name into the search box below to get the park's contact information. If you have a park-specific question, it's best to communicate directly with that park. Park names Select a park Abraham Lincoln Birthplace National Historical Park Acadia National Park Adams National Historical Park African American Civil War Memorial African Burial Ground National Monument Agate Fossil Beds National Monument Ala Kahakai National Historic Trail Alagnak Wild River Alaska Public Lands Alcatraz Island Aleutian Islands World War II National Historic Area Alibates Flint Quarries National Monument Allegheny Portage Railroad National Historic Site Amache National Historic Site American Memorial Park Amistad National Recreation Area Anacostia Park Andersonville National Historic Site Andrew Johnson National Historic Site Aniakchak National Monument & Preserve Antietam National Battlefield Apostle Islands National Lakeshore Appalachian National Scenic Trail Appomattox Court House National Historical Park Arches National Park Arkansas Post National Memorial Arlington House, The Robert  E. Lee Memorial Assateague Island National Seashore Aztec Ruins National Monument Badlands National Park Baltimore-Washington Parkway Bandelier National Monument Belmont-Paul Women's Equality National Monument Bent's Old Fort National Historic Site Bering Land Bridge National Preserve Big Bend National Park Big Cypress National Preserve Big Hole National Battlefield Big South Fork National River & Recreation Area Big Thicket National Preserve Bighorn Canyon National Recreation Area Birmingham Civil Rights National Monument Biscayne National Park Black Canyon Of The Gunnison National Park Blackstone River Valley National Historical Park Blackwell School National Historic Site Blue Ridge Parkway Bluestone National Scenic River Booker T Washington National Monument Boston African American National Historic Site Boston Harbor Islands National Recreation Area Boston National Historical Park Brices Cross Roads National Battlefield Site Brown v. Board of Education National Historical Park Bryce Canyon National Park Buck Island Reef National Monument Buffalo National River Butterfield Overland National Historic Trail Cabrillo National Monument California National Historic Trail Camp Nelson National Monument Canaveral National Seashore Cane River Creole National Historical Park Canyon de Chelly National Monument Canyonlands National Park Cape Cod National Seashore Cape Hatteras National Seashore Cape Henry Memorial Part of Colonial National Historical Park Cape Krusenstern National Monument Cape Lookout National Seashore Capitol Hill Parks Capitol Reef National Park Captain John Smith Chesapeake National Historic Trail Capulin Volcano National Monument Carl Sandburg Home National Historic Site Carlisle Federal Indian Boarding School National Monument Carlsbad Caverns National Park Carter G. Woodson Home National Historic Site Casa Grande Ruins National Monument Castillo de San Marcos National Monument Castle Clinton National Monument Castle Mountains National Monument Catoctin Mountain Park Cedar Breaks National Monument Cedar Creek & Belle Grove National Historical Park Chaco Culture National Historical Park Chamizal National Memorial Channel Islands National Park Charles Pinckney National Historic Site Charles Young Buffalo Soldiers National Monument Chattahoochee River National Recreation Area Chesapeake & Ohio Canal National Historical Park Chesapeake Bay Chickamauga & Chattanooga National Military Park Chickasaw National Recreation Area Chiricahua National Monument Christiansted National Historic Site City Of Rocks National Reserve Civil War Defenses of Washington Clara Barton National Historic Site Colonial National Historical Park Colorado National Monument Coltsville National Historical Park Congaree National Park Constitution Gardens Coronado National Memorial Cowpens National Battlefield Crater Lake National Park Craters Of The Moon National Monument & Preserve Cumberland Gap National Historical Park Cumberland Island National Seashore Curecanti National Recreation Area Cuyahoga Valley National Park César E. Chávez National Monument Dayton Aviation Heritage National Historical Park De Soto National Memorial Death Valley National Park Delaware Water Gap National Recreation Area Denali National Park & Preserve Devils Postpile National Monument Devils Tower National Monument Dinosaur National Monument Dry Tortugas National Park Dwight D. Eisenhower Memorial Ebey's Landing National Historical Reserve Edgar Allan Poe National Historic Site Effigy Mounds National Monument Eisenhower National Historic Site El Camino Real de los Tejas National Historic Trail El Camino Real de Tierra Adentro National Historic Trail El Malpais National Monument El Morro National Monument Eleanor Roosevelt National Historic Site Ellis Island Part of Statue of Liberty National Monument Emmett Till and Mamie Till-Mobley National Monument Eugene O'Neill National Historic Site Everglades National Park Federal Hall National Memorial Fire Island National Seashore First Ladies National Historic Site First State National Historical Park Flight 93 National Memorial Florissant Fossil Beds National Monument Ford's Theatre National Historic Site Fort Bowie National Historic Site Fort Caroline National Memorial Fort Davis National Historic Site Fort Donelson National Battlefield Fort Dupont Park Fort Foote Park Fort Frederica National Monument Fort Laramie National Historic Site Fort Larned National Historic Site Fort Matanzas National Monument Fort McHenry National Monument and Historic Shrine Fort Monroe National Monument Fort Necessity National Battlefield Fort Point National Historic Site Fort Pulaski National Monument Fort Raleigh National Historic Site Fort Scott National Historic Site Fort Smith National Historic Site Fort Stanwix National Monument Fort Sumter and Fort Moultrie National Historical Park Fort Union National Monument Fort Union Trading Post National Historic Site Fort Vancouver National Historic Site Fort Washington Park Fossil Butte National Monument Frances Perkins National Monument Franklin Delano Roosevelt Memorial Frederick Douglass National Historic Site Frederick Law Olmsted National Historic Site Fredericksburg & Spotsylvania National Military Park Freedom Riders National Monument Friendship Hill National Historic Site Gates Of The Arctic National Park & Preserve Gateway Arch National Park Gateway National Recreation Area Gauley River National Recreation Area General Grant National Memorial George Rogers Clark National Historical Park George Washington Birthplace National Monument George Washington Carver National Monument George Washington Memorial Parkway Gettysburg National Military Park Gila Cliff Dwellings National Monument Glacier Bay National Park & Preserve Glacier National Park Glen Canyon National Recreation Area Glen Echo Park Gloria Dei Church National Historic Site Golden Gate National Recreation Area Golden Spike National Historical Park Governors Island National Monument Grand Canyon National Park Grand Canyon-Parashant National Monument Grand Portage National Monument Grand Teton National Park Grant-Kohrs Ranch National Historic Site Great Basin National Park Great Egg Harbor River Great Falls Park Great Sand Dunes National Park & Preserve Great Smoky Mountains National Park Green Springs Greenbelt Park Guadalupe Mountains National Park Guilford Courthouse National Military Park Gulf Islands National Seashore Hagerman Fossil Beds National Monument Haleakalā National Park Hamilton Grange National Memorial Hampton National Historic Site Harmony Hall Harpers Ferry National Historical Park Harriet Tubman National Historical Park Harriet Tubman Underground Railroad National Historical Park Harry S Truman National Historic Site Hawaiʻi Volcanoes National Park Herbert Hoover National Historic Site Historic Jamestowne Part of Colonial National Historical Park Home Of Franklin D Roosevelt National Historic Site Homestead National Historical Park Honouliuli National Historic Site Hopewell Culture National Historical Park Hopewell Furnace National Historic Site Horseshoe Bend National Military Park Hot Springs National Park Hovenweep National Monument Hubbell Trading Post National Historic Site Ice Age Floods National Geologic Trail Ice Age National Scenic Trail Independence National Historical Park Indiana Dunes National Park Isle Royale National Park Iñupiat Heritage Center James A Garfield National Historic Site Jean Lafitte National Historical Park and Preserve Jewel Cave National Monument Jimmy Carter National Historical Park John Day Fossil Beds National Monument John Fitzgerald Kennedy National Historic Site John Muir National Historic Site Johnstown Flood National Memorial Joshua Tree National Park Juan Bautista de Anza National Historic Trail Kalaupapa National Historical Park Kaloko-Honokōhau National Historical Park Katahdin Woods and Waters National Monument Katmai National Park & Preserve Kenai Fjords National Park Kenilworth Park & Aquatic Gardens Kennesaw Mountain National Battlefield Park Keweenaw National Historical Park Kings Mountain National Military Park Klondike Gold Rush - Seattle Unit National Historical Park Klondike Gold Rush National Historical Park Knife River Indian Villages National Historic Site Kobuk Valley National Park Korean War Veterans Memorial Lake Clark National Park & Preserve Lake Mead National Recreation Area Lake Meredith National Recreation Area Lake Roosevelt National Recreation Area Lassen Volcanic National Park Lava Beds National Monument LBJ Memorial Grove on the Potomac Lewis & Clark National Historic Trail Lewis and Clark National Historical Park Lincoln Boyhood National Memorial Lincoln Home National Historic Site Lincoln Memorial Little Bighorn Battlefield National Monument Little River Canyon National Preserve Little Rock Central High School National Historic Site Longfellow House Washington's Headquarters National Historic Site Lowell National Historical Park Lower Delaware National Wild and Scenic River Lower East Side Tenement Museum National Historic Site Lyndon B Johnson National Historical Park Maggie L Walker National Historic Site Maine Acadian Culture Mammoth Cave National Park Manassas National Battlefield Park Manhattan Project National Historical Park Manzanar National Historic Site Marsh - Billings - Rockefeller National Historical Park Martin Luther King, Jr. Memorial Martin Luther King, Jr. National Historical Park Martin Van Buren National Historic Site Mary McLeod Bethune Council House National Historic Site Medgar and Myrlie Evers Home National Monument Mesa Verde National Park Mill Springs Battlefield National Monument Minidoka National Historic Site Minute Man National Historical Park Minuteman Missile National Historic Site Mississippi National River & Recreation Area Missouri National Recreational River Mojave National Preserve Monocacy National Battlefield Montezuma Castle National Monument Moores Creek National Battlefield Mormon Pioneer National Historic Trail Morristown National Historical Park Mount Rainier National Park Mount Rushmore National Memorial Muir Woods National Monument Natchez National Historical Park Natchez Trace National Scenic Trail Natchez Trace Parkway National Capital Parks-East National Mall and Memorial Parks National Park of American Samoa National Parks of New York Harbor Natural Bridges National Monument Navajo National Monument New Bedford Whaling National Historical Park New England National Scenic Trail New Jersey Pinelands National Reserve New Orleans Jazz National Historical Park New Philadelphia National Historic Site New River Gorge National Park & Preserve Nez Perce National Historical Park Nicodemus National Historic Site Ninety Six National Historic Site Niobrara National Scenic River Noatak National Preserve North Cascades National Park North Country National Scenic Trail Obed Wild & Scenic River Ocmulgee Mounds National Historical Park Oklahoma City National Memorial Old Spanish National Historic Trail Olympic National Park Oregon Caves National Monument & Preserve Oregon National Historic Trail Organ Pipe Cactus National Monument Overmountain Victory National Historic Trail Oxon Cove  Park & Oxon Hill Farm Ozark National Scenic Riverways Padre Island National Seashore Palo Alto Battlefield National Historical Park Paterson Great Falls National Historical Park Pea Ridge National Military Park Pearl Harbor National Memorial Pecos National Historical Park Pennsylvania Avenue Perry's Victory & International Peace Memorial Petersburg National Battlefield Petrified Forest National Park Petroglyph National Monument Pictured Rocks National Lakeshore Pinnacles National Park Pipe Spring National Monument Pipestone National Monument Piscataway Park Point Reyes National Seashore Pony Express National Historic Trail Port Chicago Naval Magazine National Memorial Potomac Heritage National Scenic Trail Poverty Point National Monument President William Jefferson Clinton Birthplace Home National Historic Site Presidio of San Francisco Prince William Forest Park Pullman National Historical Park Puʻuhonua o Hōnaunau National Historical Park Puʻukoholā Heiau National Historic Site Rainbow Bridge National Monument Reconstruction Era National Historical Park Redwood National and State Parks Richmond National Battlefield Park Rio Grande Wild & Scenic River River Raisin National Battlefield Park Rock Creek Park Rocky Mountain National Park Roger Williams National Memorial Roosevelt Campobello International Park Rosie the Riveter WWII Home Front National Historical Park Russell Cave National Monument Sagamore Hill National Historic Site Saguaro National Park Saint Croix Island International Historic Site Saint Croix National Scenic Riverway Saint Paul's Church National Historic Site Saint-Gaudens National Historical Park Salem Maritime National Historical Park Salinas Pueblo Missions National Monument Salt River Bay National Historical Park and Ecological Preserve San Antonio Missions National Historical Park San Francisco Maritime National Historical Park San Juan Island National Historical Park San Juan National Historic Site Sand Creek Massacre National Historic Site Santa Fe National Historic Trail Santa Monica Mountains National Recreation Area Saratoga National Historical Park Saugus Iron Works National Historic Site Scotts Bluff National Monument Selma To Montgomery National Historic Trail Sequoia & Kings Canyon National Parks Shenandoah National Park Shiloh National Military Park Sitka National Historical Park Sleeping Bear Dunes National Lakeshore Springfield 1908 Race Riot National Monument Springfield Armory National Historic Site Star-Spangled Banner National Historic Trail Statue Of Liberty National Monument Ste. Geneviève National Historical Park Steamtown National Historic Site Stones River National Battlefield Stonewall National Monument Sunset Crater Volcano National Monument Tallgrass Prairie National Preserve Thaddeus Kosciuszko National Memorial The White House and President's Park Theodore Roosevelt Birthplace National Historic Site Theodore Roosevelt Inaugural National Historic Site Theodore Roosevelt Island Theodore Roosevelt National Park Thomas Cole National Historic Site Thomas Edison National Historical Park Thomas Jefferson Memorial Thomas Stone National Historic Site Timpanogos Cave National Monument Timucuan Ecological & Historic Preserve Tonto National Monument Touro Synagogue National Historic Site Trail Of Tears National Historic Trail Tule Lake National Monument Tule Springs Fossil Beds National Monument Tumacácori National Historical Park Tupelo National Battlefield Tuskegee Airmen National Historic Site Tuskegee Institute National Historic Site Tuzigoot National Monument Ulysses S Grant National Historic Site Upper Delaware Scenic & Recreational River Valles Caldera National Preserve Valley Forge National Historical Park Vanderbilt Mansion National Historic Site Vicksburg National Military Park Vietnam Veterans Memorial Virgin Islands Coral Reef National Monument Virgin Islands National Park Voyageurs National Park Waco Mammoth National Monument Walnut Canyon National Monument War In The Pacific National Historical Park Washington Monument Washington-Rochambeau Revolutionary Route National Historic Trail Washita Battlefield National Historic Site Weir Farm National Historical Park Whiskeytown National Recreation Area White Sands National Park Whitman Mission National Historic Site William Howard Taft National Historic Site Wilson's Creek National Battlefield Wind Cave National Park Wing Luke Museum Affiliated Area Wolf Trap National Park for the Performing Arts Women's Rights National Historical Park World War I Memorial World War II Memorial Wrangell - St Elias National Park & Preserve Wright Brothers National Memorial Wupatki National Monument Yellowstone National Park Yorktown Battlefield Part of Colonial National Historical Park Yosemite National Park Yucca House National Monument Yukon - Charley Rivers National Preserve Zion National Park National Park Service Submit a media inquiry (for members of the media) Ask questions about our agency Report errors or technical difficulties Addresses and phone numbers for national and regional offices Freedom of Information Act Customer service standards Additional Links Entrance passes Recreation.gov for many park reservations such as camping Authorized concessioners (see park websites for information about specific services) This Site All NPS Experience Your America. Download the NPS app to navigate the parks on the go. National Park Service U.S. Department of the Interior Accessibility Privacy Policy FOIA Notices Contact The National Park Service NPS FAQ No Fear Act Disclaimer Vulnerability Disclosure Policy USA.gov"
    },
    {
      "url": "https://www.calpool.com/backyard-biography-here-comes-the-bride/",
      "text": "Backyard Design Spotlight: The Bride's Tale - A Wedding Biography 480-712-8800 Request an Estimate Meet a Designer Get Financed 480-712-8800 Ultimate Backyard Swimming Pools Ultimate Backyard New Pool Pool Remodel Spas Perimeter Overflow Elevated Standalone Level Inground Acrylic Sit & Spin Pool Sizes Cocktail Spools Play Diving Lap Large Pool Shapes Geometric Freeform Grecian Water Features Infinity & Zero Edge Baja Shelf Swim Up Bars & In-Pool Tables Pool Waterfalls & Grottos Fire Features Fire Pits Outdoor Fireplaces Pool Interior Sea Glass Pebble Pool Tile Pool Decking Travertine Deck Porcelain Pavers Concrete Pavers Cool Deck Concrete Decks Backyard Structures BBQ Islands Outdoor Kitchens Shade Structures Pool Features Technology Covers Fences Products Equipment Water Quality CPL Project Estimator Buyer’s Prep Guide Working With Us Our Process Dreambook App Warranty & Service New Pools Swimming Pools New Pool Pool Decking Travertine Deck Porcelain Pavers Concrete Pavers Cool Deck Concrete Decks Pool Interior Sea Glass Pebble Pool Tile Pool Sizes Cocktail Spools Play Diving Lap Large Pool Shapes Geometric Freeform Grecian Water Features Infinity & Zero Edge Baja Shelf Swim Up Bars & In-Pool Tables Pool Waterfalls & Grottos Fire Features Fire Pits Outdoor Fireplaces Pool Features Technology Covers Fences Products Equipment Water Quality CPL Project Estimator Buyer’s Prep Guide Working With Us Our Process Dreambook App Warranty & Service Remodels Swimming Pools Pool Remodel Spas Perimeter Overflow Elevated Standalone Level Inground Acrylic Sit & Spin Pool Sizes Cocktail Spools Play Diving Lap Large Pool Shapes Geometric Freeform Grecian Water Features Infinity & Zero Edge Baja Shelf Swim Up Bars & In-Pool Tables Pool Waterfalls & Grottos Fire Features Fire Pits Outdoor Fireplaces Pool Decking Travertine Deck Porcelain Pavers Concrete Pavers Cool Deck Concrete Decks Pool Interior Sea Glass Pebble Pool Tile Pool Features Technology Covers Fences Products Equipment Water Quality CPL Project Estimator Buyer’s Prep Guide Working With Us Our Process Dreambook App Warranty & Service Spas Spas Perimeter Overflow Elevated Standalone Level Inground Acrylic Sit & Spin Spa Shapes Geometric Freeform Grecian Fire Features Fire Pits Outdoor Fireplaces Spa Decking Travertine Deck Porcelain Pavers Concrete Pavers Cool Deck Concrete Decks Water Features Infinity & Zero Edge Spa Features Technology Covers Fences Products Equipment Water Quality Spa Interior Sea Glass Pebble Pool Tile CPL Project Estimator Buyer’s Prep Guide Working With Us Our Process Dreambook App Warranty & Service Commercial Swimming Pools Commercial Commercial Remodel Rooftop Community Wading Pools & Splash Pads Spas Perimeter Overflow Elevated Standalone Level Inground Acrylic Sit & Spin Pool Sizes Cocktail Spools Play Diving Lap Large Pool Shapes Geometric Freeform Grecian Water Features Infinity & Zero Edge Baja Shelf Swim Up Bars & In-Pool Tables Pool Waterfalls & Grottos Fire Features Fire Pits Outdoor Fireplaces Pool Interior Sea Glass Pebble Pool Tile Pool Decking Travertine Deck Porcelain Pavers Concrete Pavers Cool Deck Concrete Decks Backyard Structures BBQ Islands Outdoor Kitchens Shade Structures Pool Features Technology Covers Fences Products Equipment Water Quality CPL Project Estimator Buyer’s Prep Guide Working With Us Our Process Dreambook App Warranty & Service Landscape Gallery Learning Center Design California Pools & Landscape Honored with 7 of PebbleTec’s 2024 World’s Greatest Pools California Pools & Landscape Wins Nine 2024 PHTA Awards Arizona Backyard Design Ideas: Covered Outdoor Kitchen Design, A Chef’s Dream Best New Swimming Pool Products of 2023 Pricing Phoenix Pool Contractor Project Cost What Are Typical Monthly Payments for Pool Financing in Arizona? The 3 Best Ways to Finance Your Inground Pool in Arizona Cost of Inground Pool Installation for a Pool & Spa Projects Pool Remodel Ideas – Adding a Slide Arizona Country Club Pool & Recreational Area Remodel Luxury Pool Point of View – The Carefree Outlook Scottsdale Secret Garden: Pool Backyard Oasis Construction How Long Does It Take To Build A Pool In 2023? An Arizona Case Study. Storm Damage Restoration Needed? CPL Has You Covered Building a Pool: Speed vs. Quality Is the Wait Worth It? Backyard Biography – Swimming Pool Remodel For The Multops Videos Arizona Backyard Design Ideas: Covered Outdoor Kitchen Design, A Chef’s Dream Unique Cocktail Pool Ideas Pool Design Ideas: Small Backyard, Big Baja Cody Pools Named The #1 Pool Builder in the Nation for the 10th Year in a Row Experience California Pools & Landscape Honored with 17 of PebbleTec’s 2025 World’s Greatest Pools Best Travertine Paver Decks in Arizona Cody Pools Named The #1 Pool Builder in the Nation for the 12th Year in a Row The Top Pool Builders in Arizona for 2025: Ratings & Reviews Connect Backyard Design Spotlight: The Bride’s Tale – A Wedding Biography At California Pools & Landscape, we know that every backyard design has a story, and this one centers on the Dardens from Goodyear, AZ. The couple moved to the valley from Las Vegas and built a home in the Estrella Mountain area from the ground up. They designed the home around their love of entertaining and wanted to enjoy Arizona outdoor living, with a new personal paradise in their backyard. The couple also planned to get married in their new backyard oasis, with a small gathering of family and close friends in early March of the following year. “I planned my wedding the year before, and so I couldn’t imagine not only building a pool but also getting married where your pool is and how stressful that was,” said Sara Dougan, Scheduling Manager at California Pools & Landscape. “When they told me they had a hard date of March 10th for the wedding they were going to have in the backyard, my initial response was, well, let’s not do this,” said Designer Ryan Delfino, while laughing. “Let’s see what we can do to get this thing done!” The couple started their search to transform their backyard from a dirt lot to a dream oasis by meeting with two other pool companies before turning to California Pools & Landscape. The customer service and backyard design from Delfino proved to be the deciding factors for the project, which featured a seamless outdoor living environment that was custom created for the Dardens. “When we went to California Pools & Landscape, Ryan & I really sat down and really talked about the design,” said Gary Darden. “We took the other two designs and combined them while adding a couple of other tweaks and liked that.” “We entertain a lot; we built the house from the floor up for a space to entertain with the pool being a focal point,” said Shelley Darden. “Making sure we had a space to entertain was a big reason we picked California Pools & Landscape.” Building A Inground Swimming Pool During A Pandemic Construction on the backyard project started in August 2021, following some record-setting monsoon rainfall in the Valley. During this timeframe, the construction field and much of the world were still working through labor shortages, supply chain challenges, and service delays. For the Darden’s backyard and timeline, setbacks first arose following the initial excavation. The elevation of the yard required some changes to the design. “One of the issues with doing a plot plan design is that you don’t see the grade change,” said Ryan Delfino. “Their property, in particular, had quite a big swell going up to the back wall that was unplanned for.” “Ryan was on the phone that day doing a video chat with us and designed everything right there,” said Gary Darden. The new design featured a retaining wall behind the pool that helped tie the pool, spa, and fire pit together with stacked stone and three scupper water features. The fire pit was also elevated up a foot, creating a raised seating area. “It actually served the purpose of dealing with the yard elevation but also gave us some interest, movement, and flow to the design that I think worked out way better than the original one just having those elevation changes,” said Delfino. Additional delays arose during the plumbing phase of the project with material shortages, followed by labor delays in the steel phase. As the ebb and flow of the project carried on, the couple adjusted their plans accordingly. “We had planned on hopefully having it done by Christmas, having family down here, and that came and went,” said Gary Darden. “Then we wanted to have it up and running for my 60th birthday because we were going to have a big party, which we did anyway without the pool.” The Dardens in particular, knew that the delays in the job’s progress were due to the circumstances of building a pool during a global pandemic. “Honestly, at first, I was like they really don’t care,” said Gary Darden. “They’re missing this, and they’re missing that. But it was covid. There were reasons they were missing it. You couldn’t get any help; you couldn’t get people to come out to work; you couldn’t get any products.” With their wedding day in sight, the couple reiterated their need to have the backyard ready for the big day. “We said we’re getting married March 10th; that’s the day,” said Gary Darden. “We’re getting married by the pool, in front of the fire pit. You guys have got to get it done.” “Invites were out,” said Shelley Darden. Scheduling Manager Sara Dougan handled the coordination of crews on site once the shotcrete had been completed. With just over a month until the wedding, she accepted the challenge head-on. “I told her, in the beginning, it’s going to be tight,” said Dougan. “It’s going to have to be one after the other. Just being able to look at the plan, understand the crews, who needs to go out there in what order, and whether they can work around each other or not.” Superintendent Dustin Looker handled the construction aspects of the project, ensuring that all of the work being completed was according to plan and up to the CPL standard. With numerous subcontractors and in-house contractors due to be onsite in such a tight time window, it required a lot of communication. “I talked to Shelley every day; you know this is the gameplan; this is what crew is going to be out there,” said Dougan. “Communication has been key, and I think that was the only way it was going to get done in time,” said Shelley Darden. “Sometimes the magic aligns, and it’s easier to meet those drop-dead dates,” said Sara Dougan. “Sometimes you see a date, and you’re like, how am I going to make this work? What am I going to do?” Countdown To Wedding Day With two weeks to go before the big day, the Dardens got a call that changed the look of their project and threatened their looming deadline. “Two weeks before they called us and told us they’d run out of the travertine, our travertine was not in stock,” said Gary Darden. “If we wanted to get it done by the deadline, we had to come to pick out new travertine.” “Your heart sinks when you get that tidbit of information because you have it all lined up right,” said Sara Dougan. “Then you get a curveball, an unknown of, hey, I went to get that material, and they actually are out. It’s definitely a sinking feeling because we were already in crunch time.” “It was when we were starting to hit the ground running, and then it was like, whoa, wait a second, pull it back,” said Ryan Delfino. Thankfully the Dardens were able to find a travertine that was in stock that fit the aesthetic they were going for in the backyard. The new travertine also meant they needed to reselect a new waterline tile and stacked stone, adding to the stress of the time crunch. “Luckily, they came to pick out a new selection, and then it was just telling our crew to stand by,” said Sara Dougan. “We have to pick it out, get it delivered, and I’ll get you that square footage by the end of the day.” Given the delays that had occurred on the project and with the wedding date fast approaching, the couple was suddenly wondering if they needed to consider an alternate plan for their upcoming ceremony. “I think Ryan was the one who said, Shelley, get a plan B,” said Shelley Darden. “I kept asking do I need a B and C or just a B? Sara kept responding no, no, no.” “For me, there was no plan B,” said Sara Dougan. “We are going to get this done for you, and we’re going to make it happen.” With the help of more than a dozen crews, strategic scheduling, and daily visits from Superintendent Dustin Looker, the project was on schedule to be completed leading up to deadline day. The completion seemed like a reality, as dedicated craftsmen stayed late to ensure the backyard was ready. “You were out here putting this grass in the night before at 5 o’clock,” said Gary Darden. “The guys were out here with scissors clipping it to make it even.” “The turf guys stayed late to make it happen; they knew she was getting married the next day,” said Sara Dougan. “I was nervous the whole time; that was a relief to come in and just a gratitude of seeing how hard they worked to make her wedding happen.” With the turf completed, there was one final element to complete, which took some extra coordination on the morning of the wedding. “We coordinated for her to be home the morning of her wedding because you have to be home to turn on that gas,” said Sara Dougan. “They turned on the gas, and we were talking her whole wedding morning. When she said the gas was turned on, I was like ok, we’re good; go get married!” “It’s a special case, not every day that you have a wedding in your backyard,” said Ryan Delfino. Here at California Pools & Landscape, that’s our culture. We want to help and do everything we can.” “Their level of care about getting it completed was astonishing. They really wanted to get it done for us,” said Gary Darden. Wedding Day On March 10th, 2022, Gary and Shelley held their intimate wedding ceremony in their new dream backyard, just like they’d planned. Their family and closest friends surrounded them with love and support in a space they’d built together. “I got to walk through the house out to see all my family and our beautiful yard,” said Shelley Darden. “It was complete, the pool was going, and it was being heated; you could hear the gas going. To walk out and have it done was awesome; it was a big achievement. My house was built, my yard was done, and we got married!” The pastor helped integrate a piece of the backyard into the ceremony with a unique rendition of unity. The filler for the fire pit had yet to be distributed and happened to feature two different color shades. “The pastor suggested we put the rocks in vases, and at the end of the ceremony, you go back there, and you mix the rocks together in the firepit. Then no one can touch those because if they do, they’ll get burned. So if they try to mess with your wedding or with your life, they’ll get burned. So that’s what we did.” “We couldn’t have done it without everybody being on board,” said Sara Dougan. “Definitely one of the funnest projects that I’ve built; I’m so glad we were able to do it. I feel like I was in the wedding, a party planner and a pool builder. That one’s going to go down in history.” “I can’t say enough about our scheduling department and our superintendents,” said Ryan Delfino. “The teamwork here is why I’m here at California Pools, the culture of teamwork and helping each other do better. That’s why I’m here, that’s why I love this company, and that’s the culture that keeps people staying.” If you’ve been dreaming about creating your backyard oasis, you can learn about working with California Pools & Landscape. If you’d like to learn about another California Pools & Landscape backyard story, check out this stunning Scottsdale backyard . Get Started Request an Estimate Meet a Designer Get Funding Recent Posts California Pools & Landscape Honored with 17 of PebbleTec’s 2025 World’s Greatest Pools Pool Remodel Ideas – Adding a Slide California Pools & Landscape Honored with 7 of PebbleTec’s 2024 World’s Greatest Pools California Pools & Landscape Wins Nine 2024 PHTA Awards Phoenix Pool Contractor Project Cost Categories Design Pricing Projects Construction Videos Experience Ask a Question \" * \" indicates required fields Name * First Last Phone * Email How can we help you? Δ More Articles From \"Backyard Biography\" Backyard Makeover Biography – The Lappanos Backyard Biography – Swimming Pool Remodel For The Multops Backyard Biography: The McDermotts Pool Landscaping Ideas Meet Designers Request an Estimate Get Funding Search Submit Clear All Design Pricing Projects Construction Videos Experience California Pools & Landscape Honored with 17 of PebbleTec’s 2025 World’s Greatest Pools Pool Remodel Ideas – Adding a Slide California Pools & Landscape Honored with 7 of PebbleTec’s 2024 World’s Greatest Pools California Pools & Landscape Wins Nine 2024 PHTA Awards Scottsdale Design Center 23271 N. Scottsdale Rd. #A105 Scottsdale, AZ 85255 480-613-2112 Google Maps Chandler Design Center 4320 W. Chandler Blvd. #1 Chandler, AZ 85226 480-680-0139 Google Maps Queen Creek Design Center 40930 N. Ironwood Dr. #116 Queen Creek, AZ 85140 480-470-0202 Google Maps Surprise Design Center 15240 N. Cotton Ln. #104 Surprise, AZ 85388 623-244-6454 Google Maps About California Pools & Landscape Since 1988, California Pools & Landscape has been dedicated to creating exceptional outdoor spaces that bring families together. What started as a small business in a family kitchen has grown into Arizona’s ultimate backyard builder, trusted by homeowners for over 37 years. Our guiding philosophy has never changed: “What is best for the customer, is best for all of us.” In 2021, we proudly became part of Cody Pools, the nation’s largest and most trusted pool builder. This partnership allows us to offer even greater financial stability, access to premium materials, and exclusive high-volume equipment pricing, savings that we pass directly to our customers. While we’ve expanded, our heart remains the same. We are committed to delivering a seamless, enjoyable, and rewarding experience from start to finish. Our team of experts listens, collaborates, and brings each unique backyard vision to life with exceptional craftsmanship and personalized service. At California Pools & Landscape, we don’t just build pools, we create backyards where memories are made and moments are cherished for years to come! ROC Licenses 339051 339093 339094 342168 Join Our Community Newsletter Signup LinkedIn This field is for validation purposes and should be left unchanged. Δ © California Pools & Landscape All Rights Reserved. Privacy Policy . DIGITAL MARKETING STRATEGY | Developed 2025 © California Pools & Landscape All Rights Reserved. Privacy Policy . Ultimate Backyard New Pool Remodel Sizes Cocktail Spools Play Diving Lap Large Shapes Geometric Freeform Grecian Interior Sea Glass Pebble Tile Decking Travertine Deck Porcelain Pavers Concrete Pavers Cool Deck Concrete Deck Technology & Smart Automation Integration Covers Fences Products Equipment Water Quality Spas Perimeter Overflow Elevated Standalone Level Inground Acrylic Sit & Spin Commercial Pool Remodeling Community Pools Rooftop Pools Wading Pools & Splash Pads Water Features Infinity & Zero Edge Baja Shelf Swim Up Bars & In-Pool Tables Pool Waterfalls & Grottos Outdoor Fire Features Fire Pits Outdoor Fireplaces Backyard Structures BBQ Islands Outdoor Kitchens Shade Structures Landscape Gallery Learning Center Design Pricing Projects Construction Videos Experience Working With Us Buyer’s Prep Guide Our Process Dreambook App Warranty & Service Connect Request an Estimate Meet a Designer Project Estimator Get Financed Submit Claim"
    },
    {
      "url": "https://backyardftl.com/backyard/beyond-brunch-tickets/",
      "text": "Beyond Brunch Tickets – Backyard Skip to the content Search Backyard Spring Break Headquarters Menu Menu Search Stay In The Know! Search for: Close search Close Menu Home Bottle Service Menu Private Events Party Packages About Property Gallery Press Terms & Conditions Show sub menu Privacy Policy Careers Contact Covid-19 Safety Home Bottle Service Menu Private Events Party Packages About Property Gallery Press Terms & Conditions Show sub menu Privacy Policy Careers Contact Covid-19 Safety Facebook Instagram Email Beyond Brunch Tickets Table Reservations Full Name Date attending Size of your party Email/Phone Time of arrival Copy the text above, fill out and email to the link below Email The Big Three Alliance or call (754) 400-0378 for reservations * 2 bottle minimum. Wine bottles do not count. Must be liquor or champagne. ** Mimosa ends at 1pm, Food Ends at 6pm ** A purchase of 2 bottles or more will allot you 3 hours from the time you sit. If you would like to stay longer, another purchase of 2 bottles will allot you an additional 3 hours. Unfortunately, there are no substitutions allowed for package deals. If you do not see a combination package of bottles you like, you may purchase from our a la carte menu and pay individually for each bottle. Seating times are as follows: 11:00am, 11:30am, 12:00pm, 12:30pm, 1:00pm, 4:00pm, 4:30pm or 5:00pm (choose one) 3hr Max * Please note that certain sections may  require additional bottle purchases to remain in your section past your 3hr maximum time limit Select a Date Facebook Instagram Email ©\n\t\t\t\t\t\t\t2025 Backyard Web Machines by Q Branch To the top ↑ Up ↑ Order for Pickup Order for Pickup Close The Backyarders Subscribe * indicates required Email Address * First Name * Last Name * Birthday / ( mm / dd ) Phone Number Gender * Male Female Prefer not to say"
    },
    {
      "url": "https://backyardhouse.com/contact-us/",
      "text": "Backyard House | Contact us Open menu Services Models Gallery Cost Estimate Contact Us Close menu Design & Build Construction Custom Design Cost Estimate Our Models Gallery Contact us Contact us Fill out a contact form and we will get back to you as soon as possible Contact Information Contact Information Office hours are 9:00AM to 4:00PM CST Monday through Friday. Phone number +1 (512) 855-7799 Email info@backyardhouse.com Facebook Instagram LinkedIn Send us a message First name Last name Email Phone Subject Message Max. 500 characters Submit Our Locations Backyard House Austin 706 Guadalupe St Austin, TX 78701 Services Models Estimate Contact Terms Facebook Instagram LinkedIn © 2022 Backyard Building, Inc All rights reserved."
    },
    {
      "url": "https://backyardftl.com/private-events/",
      "text": "Private Events – Backyard Skip to the content Search Backyard Spring Break Headquarters Menu Menu Search Stay In The Know! Search for: Close search Close Menu Home Bottle Service Menu Private Events Party Packages About Property Gallery Press Terms & Conditions Show sub menu Privacy Policy Careers Contact Covid-19 Safety Home Bottle Service Menu Private Events Party Packages About Property Gallery Press Terms & Conditions Show sub menu Privacy Policy Careers Contact Covid-19 Safety Facebook Instagram Email Private Events Private Events, Corporate Events & Site Rentals Venue Capacity Max Capacity: 1600 Reception: 750 Seated: 300 LED lighting creates the mood in this outdoor setting complete with two large projection screens and eighteen plasma TV’s for branding and visual presentations. Take advantage of our large stage for live entertainment. Our expert talent buyers can assist with booking local bands, headline artists and  other performers. Location, Location, Location Backyard is located in the heart of the downtown Fort Lauderdale Riverwalk Arts and Entertainment District along with the IMAX Theatre, Broward Center for Performing Arts, Museum of Discovery and Science, Leiser Opera Center and local restaurants. Within four miles of the Broward County Convention Center, Backyard is just minutes away from beautiful beaches and the famous Las Olas Boulevard shops. Book Your Party or Event Private Event Software powered by Tripleseat See Our Other Private Event Venues Catering Private & Corporate Events Revolution Live, Backyard, and Stache Drinking Den + Coffee Bar are known for exceptional food, creativity, and contemporary presentation combined with outstanding service. Our cuisine abounds with modern creations as well as the very best traditions of America to help create the perfect private and corporate events. Backyard boasts an on-site culinary team, led by Chef Jen Knox . Cutting edge to traditional, custom menus and themed cuisine packages, Chef Jen Knox can accommodate any event. Beverages are served from full-service bars on two levels. With our three distinctive venues, we can certainly provide the feel, theme, and vibe that you want! Let us impress you… AND your friends. Fundraising & Planning An important part of our mission at Backyard is to take an active role in our community. We work closely with all types of charities to provide a venue for you to host a successful philanthropy to raise money and create awareness. We are also the perfect place to host your company’s next Networking Event. With our full service bars, excellent menu, and unique outdoor ambiance, we can create the perfect venue rental for you and your colleagues to mix and mingle. Bachelorette/Bachelor Parties Bachelorette – $25 / pp · Basic liquor 2-hour open bar package · Skip the entry line for everyone in your group · Reserved table seating · Complimentary bottle of champagne for the Bachelorette · Specialized DJ shoutout Bachelor – $25 / pp · Basic liquor 2-hour open bar package · Skip the entry line for everyone in your group · Reserved table seating · Round of shots for the Bachelor Party · Specialized DJ shoutout Contact Jade to make your party reservation! shanel@damngoodhospitality.com Lets Connect Revolution Live, Backyard and Stache Drinking Den Office: 954 449-1028 sales@damngoodhospitality.com Facebook Instagram Email ©\n\t\t\t\t\t\t\t2025 Backyard Web Machines by Q Branch To the top ↑ Up ↑ Order for Pickup Order for Pickup Close The Backyarders Subscribe * indicates required Email Address * First Name * Last Name * Birthday / ( mm / dd ) Phone Number Gender * Male Female Prefer not to say"
    },
    {
      "url": "https://backyardftl.com/contact/",
      "text": "Contact – Backyard Skip to the content Search Backyard Spring Break Headquarters Menu Menu Search Stay In The Know! Search for: Close search Close Menu Home Bottle Service Menu Private Events Party Packages About Property Gallery Press Terms & Conditions Show sub menu Privacy Policy Careers Contact Covid-19 Safety Home Bottle Service Menu Private Events Party Packages About Property Gallery Press Terms & Conditions Show sub menu Privacy Policy Careers Contact Covid-19 Safety Facebook Instagram Email Contact Lost & Found All lost & found items will be held in the Revolution Live box office. Please stop by or call during the following hours to retrieve lost items: Tuesday & Friday from 11AM-6PM. Valid ID will be required for pickup. For other inquiries, please contact: info@stacheftl.com 100 S.W. 3rd Avenue Fort Lauderdale, FL 33312 Main Phone: 954-449-1025 Fax: 954-462-9995 Email: Info@BackyardFTL.com Facebook Instagram Email ©\n\t\t\t\t\t\t\t2025 Backyard Web Machines by Q Branch To the top ↑ Up ↑ Order for Pickup Order for Pickup Close The Backyarders Subscribe * indicates required Email Address * First Name * Last Name * Birthday / ( mm / dd ) Phone Number Gender * Male Female Prefer not to say"
    },
    {
      "url": "https://backyardftl.com/party-packages/",
      "text": "Party Packages – Backyard Skip to the content Search Backyard Spring Break Headquarters Menu Menu Search Stay In The Know! Search for: Close search Close Menu Home Bottle Service Menu Private Events Party Packages About Property Gallery Press Terms & Conditions Show sub menu Privacy Policy Careers Contact Covid-19 Safety Home Bottle Service Menu Private Events Party Packages About Property Gallery Press Terms & Conditions Show sub menu Privacy Policy Careers Contact Covid-19 Safety Facebook Instagram Email Party Packages We offer a variety of Bachelor, Bachelorette, & Birthday Party Packages at Backyard! All Party packages include: · Express entry for everyone in your group, skip the line! · Complimentary bottle of champagne or round of shots · Specialized DJ shoutout $25 Per Person – Basic liquor 2-hour open bar package $35 Per Person – Basic liquor 3-hour open bar package $45 Per Person – Premium liquor 2-hour open bar package $55 Per Person – Premium liquor 3-hour open bar package $60 Per Person – Top shelf liquor 2-hour open bar package $75 Per Person – Top shelf liquor 3-hour open bar package Party Package Reservations can be set for arrival between 9 pm -12 am  Fridays and Saturdays. Party Packages are NOT available for Sunday Brunch. Reservations must be made 24-hours in advance and are non-refundable. Submit the form below to begin the reservation process! Your name: Your email: Your phone #: Date you will be attending: Are you planning a Bachelor, Bachelorette, or Birthday Party? How many people are in your party? We can’t wait to celebrate with you! For all questions regarding booking your next party with us, please contact Shanel via email at shanel@damngoodhospitality.com Facebook Instagram Email ©\n\t\t\t\t\t\t\t2025 Backyard Web Machines by Q Branch To the top ↑ Up ↑ Order for Pickup Order for Pickup Close The Backyarders Subscribe * indicates required Email Address * First Name * Last Name * Birthday / ( mm / dd ) Phone Number Gender * Male Female Prefer not to say"
    },
    {
      "url": "https://backyardftl.com/",
      "text": "Backyard – Spring Break Headquarters Skip to the content Search Backyard Spring Break Headquarters Menu Menu Search Stay In The Know! Search for: Close search Close Menu Home Bottle Service Menu Private Events Party Packages About Property Gallery Press Terms & Conditions Show sub menu Privacy Policy Careers Contact Covid-19 Safety Home Bottle Service Menu Private Events Party Packages About Property Gallery Press Terms & Conditions Show sub menu Privacy Policy Careers Contact Covid-19 Safety Facebook Instagram Email Backyard Scroll Down We are your Backyard. Your home away from home. Ice Cold Beers, Spritzes, and Refreshing Cocktails. Come hang out, play games, drink, and socialize. All are welcome. Only good times to be had. Memories to be shared. Special Events FOR TICKETS CLICK THE EVENT PHOTO Beyond Brunch every Sunday FOR TICKETS CLICK THE EVENT PHOTO Paradise Presents backyard bash SEPTEMBER 12 | SETEMBER 19 | SEPTEMBER 26 paradise presents: Sunday scaries – september 12 CARIBBEAN CITY – september 13 Hell in a cell – september 27 paradise presents: MYLES O’NEAL – OCTOber 10 paradise presents: Proppa halloween – OCTOber 31 layz: blackout no signal november 21 backyardftl It’s the most wonderful time of the year! 🎄 B Catch the brunch of a lifetime with @bb_sundays! E 💀 TODAY is the 15th Annual Florida Day of The D Happy Halloween! 🎃 The party’s going down TON Only 3 days to go! 💀✨ Did you know the Florid Halloween isn’t over yet! Join us THIS THURSDAY he holidays are right around the corner! 🎄✨ M Get ready for a night of thrills! 🎃 Walk throug 🎭🔥 BB Sundays: Alter Ego Edition is about to Tonight’s the night! 🌴 @old_school_saturdays 🎃👻 Halloween with @theparadisepresents at #B Just 4 days to go until @old_school_saturdays take It’s Time for the best Monday Ever‼️ It’s It’s the spookiest time of the year! 🎃 Get re Tonight’s the night! 🌟 Join us for the ultima The party in Paradise doesn't stop…🌴💜 Join Get ready for the most epic Halloween bash in Fort Y'all know what time it is — @bb_sundays 50% off Only 6 days to go, Fort Lauderdale! 🎸 The Rock Only two weeks left until we party with @old_schoo Load More Follow on Instagram The Daily THURSDAY-SATURDAY DOORS OPEN AT 9 PM In The Biz Every Night Enjoy 30% your entire tab with proof of ITB employment Private Events & Party Packages Want to get paid to party? Click the photo to sign up! Interested in Bottle Service? Inquire below! Your name* Your email* Phone Number* What day will you be hanging with us?* # of people in your party* Are you celebrating anything special? Find Us Address 100 Southwest 3rd Ave Fort Lauderdale, FL 33312 Hours Thursday- Saturday 9pm-4am Sunday Brunch 11am-7pm Facebook Instagram Email ©\n\t\t\t\t\t\t\t2025 Backyard Web Machines by Q Branch To the top ↑ Up ↑ Order for Pickup Order for Pickup Close The Backyarders Subscribe * indicates required Email Address * First Name * Last Name * Birthday / ( mm / dd ) Phone Number Gender * Male Female Prefer not to say"
    },
    {
      "url": "https://backyardftl.com/terms-conditions/",
      "text": "Terms & Conditions – Backyard Skip to the content Search Backyard Spring Break Headquarters Menu Menu Search Stay In The Know! Search for: Close search Close Menu Home Bottle Service Menu Private Events Party Packages About Property Gallery Press Terms & Conditions Show sub menu Privacy Policy Careers Contact Covid-19 Safety Home Bottle Service Menu Private Events Party Packages About Property Gallery Press Terms & Conditions Show sub menu Privacy Policy Careers Contact Covid-19 Safety Facebook Instagram Email Terms & Conditions When purchasing tickets through Ticketmaster and Universe. All ticket sales are final. In order for the purchaser and/or holder (hereinafter referred to as you “You” or “Your”) of a valid wristband or ticket (“Ticket”) to enter the event (the “Event”), You must possess a valid Ticket that permits access to the Event and check in at marked locations during specified time periods. ‍ ARTICLE 1: YOUR TICKET ‍ Please be advised, the purchase and/or use of a Ticket to, and/or entry into, the Event shall constitute Your unconditional acceptance to be bound by (i) any and all of the terms and conditions contained within this agreement (this “Agreement”) between You and Damn Good Hospitality (the “Company”) to attend all or part of the Event. For safety reasons, Company reserves the right to, without any prior notice or compensation to You: postpone, cancel, interrupt or stop the Event; provisionally keep visitors on the Event site at the end of the Event; totally or partially vacate the Event site; and deny access to the Event site regardless of the possession of a valid Ticket. Subject to the limitations of this Agreement, the Company reserves the right to change, modify, or alter any aspect of the Event (including, without limitation, the appearance of any performer or artist, and/or the order of performance of any performer or artist), at any time, for any reason whatsoever, without any prior notice or compensation to You. You understand that the artists and/or lineup for the Event may be changed and that such occurrence shall not, under any circumstances, entitle You to any claim whatsoever, including, but not limited to, a refund for Your Ticket. You understand, acknowledge, and agree that the names of any artist, act or performer contained in any Event promotional material is intended for informational purposes only, and does not, in any way, represent the importance or headline status of any single artist, act or performer, and is subject to change without prior notice. ‍ EXCEPT AS EXPLICITLY OTHERWISE PROVIDED HEREIN, YOU UNCONDITIONALLY UNDERSTAND THAT ALL TICKET SALES ARE FINAL. THERE WILL BE NO TICKET REFUNDS AND/OR TICKET EXCHANGES. THE EVENT IS A RAIN OR SHINE EVENT. ‍ If the Event is cancelled in whole, or in part, due to a Force Majeure Event (as defined below), You will not be entitled to a refund. Notwithstanding the foregoing, the Company may issue, at the Company’s sole and absolute discretion, a partial or full refund of Your Ticket, by accounting for, among other considerations, the extent and nature of the cancellation. A “Force Majeure Event” shall mean an act of God, act of terrorism, earthquake, wildfire, flood, tsunami, strike or other labor condition or dispute, an order or injunction of any court or administrative body or any other act of public authority, severe weather threatening the safety of Event attendees or similar contingency or unexpected event, and any such occurrence beyond the reasonable control of Company. You understand that in all instances, the maximum remedy You may receive for any cancellation of any part of the Event, if any, will be the face value of Your Ticket, excluding all fees, taxes and/or service charges paid by You in connection with the purchase of Your Ticket. By entering the Event, You assume any and all risk and/or danger, known and unknown, foreseeable and unforeseeable, resulting from, or incidental to, the Event, whether occurring prior to, during, or subsequent to, the Event, including, but not limited to, any death, personal injury or loss, damage or liability whatsoever. You understand that Your use of Your Ticket is contingent upon Your voluntary assumption of the risk and danger that may result from, or be incidental to, Your presence at the Event, whether occurring prior to, during or after the Event, including, but not limited to, any actions or omissions of the Company Parties (as defined herein). You acknowledge and understand that the Ticket is a revocable license to attend the Event for which it was issued, which is subject to revocation and denial of admission without compensation for any reason, including, but not limited to, Your attempted or actual violation of any of the rules set forth herein, policy or regulations and for any other action taken by You in violation of any local, state or federal law, or that may endanger other ticketholders. ARTICLE 2: TICKET AND PROOF OF AGE REQUIRED In order to enter into the Event, You must have Your own valid Ticket. One (1) Ticket is required per attendee and will only be valid on the day(s) of the Event and area(s) of the Event as indicated on the Ticket. Your Ticket is not redeemable for cash. There will be no replacements for Tickets that are lost, stolen, destroyed or damaged and You unconditionally accept the risk of damage to, loss of and/or theft of Your Ticket . Your Ticket is intended for You only. In no instance shall You share Your Ticket with any person(s) attending or attempting to attend the Event. If You are discovered to be sharing Your Ticket with another person(s), Company reserves the right, in its sole discretion, not to grant You access to the Event or eject You from the Event. To ensure that Your Ticket is valid, purchase Your Tickets from Ticketmaster, Universe or any other Company-authorized sale channels listed on the official Company website. Tickets from unauthorized sales channels (e.g., scalpers) may be forged. In no event will forged tickets be honored or eligible for a refund. If You have any questions or concerns regarding ticketing for the Event, including but not limited to, payment plans, please contact Ticketmaster or Universe customer support. You must submit Your Ticket for validation upon entry into the Event. Entry into the Event is limited to persons that meet the minimum age requirements on or before the day of the Event. To enter the Event as a General Admission Ticket holder, You must be at least twenty-one (21) years of age or older. To enter the Event with a VIP Ticket, you must be at least twenty-one (21) years of age or older. The Event is intended for mature audiences only. You must have one of the following forms of approved identification to enter the Event that demonstrate proof of age. No exceptions will be made, even if You are accompanied by an adult or a person with valid identification. Failure to provide valid identification shall preclude You from entering the Event and You shall not be entitled to any refund nor will You be entitled to, or will the Company be liable for, any other damages, including, but not limited to, incidental and/or consequential damages. In addition, during the Event, You must be able to provide valid identification if requested by a member of security or crew. If You are not able to show a valid identification, You may be promptly ejected from the Event without the opportunity to return to Your locker, and You shall not receive a refund of Your Ticket. The following original forms of identification are ACCEPTABLE: Government-Issued Passport; Driver’s License (U.S. or Canada); Military Identification Card with Photo; or Government-Issued Identification Card with Photo. The following forms of identification are UNACCEPTABLE: Expired Identification Card; School Identification Card; License/Identification Card issued in countries other than the U.S. or Canada; Birth Certificate; Social Security Card; Federal Immigration Card; Voter Registration Card; and Copies of any acceptable forms of identification. ARTICLE 3: SECURITY CHECK Access to the Event site is PROHIBITED and refused to, but not limited to, people who:• Are under the influence of illegal drugs or any other illegal substances;• Are clearly suffering from alcohol intoxication which, in Event’s staff’s sole discretion, has caused You to be in an impaired state;• Have been previously banned from Event’s and/or other events by the organizer, the administration or legal authorities;• Are demonstrating an intent to disturb the peace or to provoke someone else to do so;• Engage in fighting or disruptive behavior;• Use foul language;• Wear clothing with obscene or indecent language;• Resist the direction of and search by the Event security guards and security services;• Refuse to declare and forfeits objects that are prohibited, as set forth herein;• Distribute flyers or posters on or near the Event site. If You would like to promote one of Your events, then please visit the official Company website for . more information; and• Act in violation of the provisions of one or more articles of these regulations or in the spirit thereof. Please note all ticket holders will be searched upon entering the Event site. Security guards will inspect all objects brought onto the Event site including, but not limited to, clothing, luggage and other personal items in order to detect objects that may disrupt the course of the Event, jeopardize the safety of other ticketholders, or disturb the peace. Security guards may search any persons and property on the Event site at any time, including, but not limited to, storage lockers, and confiscate any prohibited items, in their sole discretion. Given the volume of attendees, it is not guaranteed that these objects will be returned to You. For that reason, please read Article 4 carefully. ARTICLE 4: FORBIDDEN OBJECTS ‍ PROHIBITED ITEMS FOR THE EVENT: NO GLASS OF ANY KIND NO WEAPONS OF ANY KIND (REGARDLESS OF PERMIT) NO PAINT OF ANY KIND (INCLUDING PAINT MARKERS AND SPRAY PAINT) NO FIREWORKS NO ILLEGAL SUBSTANCES NO DRUGS OR DRUG PARAPHERNALIA NO LARGE CHAINS NO LASER POINTERS NO FLAGS OR TOTEMS WITH METAL OR WOOD PIECES NO LARGE UMBRELLAS NO UNSEALED TAMPONS NO STUFFED ANIMALS/DOLLS NO PACIFIERS NO UNSEALED OVER THE COUNTER MEDICATIONS/VITAMINS (PRESCRIPTION DRUGS IN NON-APPROVED CONTAINERS MUST BE TURNED OVER TO MEDICAL) NO VENDING WITHOUT PERMIT NO BICYCLES, SCOOTERS, GO CARTS, OR ATVS NO PETS – UNLESS it is a service animal, and You are a person with disabilities, or service animals in-training and have appropriate apparel and have on Your person credentials from an accredited school for which the dog is being raised. Please e-mail Your questions regarding service animals to the Company at info@damngoodhospitality.com or visit the official Company website for details at https://www.damngoodhospitality.com/ . NO COOLERS, NO OUTSIDE FOOD OR DRINKS NO OPEN CONTAINERS NO MULTI POCKET BACKPACKS LARGER THAN 24’’ X 12’’ (CINCH PACKS ARE PERMITTED) NO LARGE BACKPACKS NO LUGGAGE NO PUSH CARTS NO SPORTS EQUIPMENT (INCLUDING FRISBEES) NO TENTS OR CAMPING GEAR NO SOAP, SHAMPOO, CONDITIONER OR OTHER DETERGENTS NO FLAMMABLE PRODUCTS NO AEROSOL CANS NO CAMERA TRIPODS NO PROJECTILES OR EXPLOSIVES NO KNIVES OR SHARP OBJECTS NO OPEN FIRES NO WATER GUNS OR MISTERS NO CHAIRS NO FLYERS, STICKERS, POSTERS NO HAMMOCKS NO GRILLS OF ANY KIND (INCLUDING PROPANE AND CHARCOAL) NO GENERATORS NO GAS MASKS OR TACTICAL GEAR NO AEROSOL CANS (INCLUDING DEODORANT AND PERFUME) NO CHINESE LANTERNS NO DRONES OR UNMANNED AERIAL VEHICLES Any other items deemed as posing a threat to the safe enjoyment of the patrons. ‍ If You bring any of the items on the above prohibited items list into the Event, such items will be confiscated and discarded and You will be subject to removal from the Event based on the sole discretion of Company. Under no circumstances will Company hold any prohibited items for You. ‍ PLEASE RESPECT YOUR BODY AND MIND. ALL PERSONS AND PROPERTY ARE SUBJECT TO SEARCH AND MAY BE REQUIRED TO TAKE OFF YOUR SHOES DURING SEARCH. COMPANY HAS A ZERO TOLERANCE FOR ILLEGAL ACTIVITIES. THE USE OF ILLEGAL DRUGS AND UNDERAGE DRINKING IS NOT PERMITTED. ANYONE FOUND WITH ILLEGAL DRUGS WILL BE SUBJECT TO REMOVAL FROM THE EVENT AND WILL NOT BE ALLOWED BACK IN. ‍ ARTICLE 5: CONDUCT AT THE EVENT At the Event, it is forbidden to: • Try to access or be in sections restricted to certain ticketholders unless in accordance with Your Ticket or credentials, such as production rooms, artists’ lodges, VIP zones, press rooms, offices, backstage and working areas; • Climb tents, constructions, fences, closures, lighting columns, tables, benches or any other infrastructure of the Event site; • Obstruct entrances, exits and evacuation routes and/or to linger at these locations any longer than strictly necessary for entering or exiting the Event site; • Wear a disguise or obstruct Your face to avoid being recognized; • Display or make texts, symbols, images, gestures, wear clothing or articles of dress which, in the sole discretion of Event staff or security personnel, contain and/or display language and/or images which are obscene, racist, xenophobic, provocative, hate speech or discriminatory; • Be under the influence of illegal drugs or any other illegal substances; • Be clearly suffering from alcohol intoxication that, in Events staff’s sole discretion, has caused You to be in an impaired state; • Disturb the peace, demonstrate an intent to disturb the peace or provoke someone else to do so, or compromise the safety of the general public; • Sell drinks, food, or any other product without the express consent of the Company; • Throw or shoot any object or liquid, or throw or shoot any other product in loose or gaseous form; • Smoke in the non-smoking areas; • Urinate in public; • Re-enter the Event after being removed or banned from the Event, even if You are in possession of a new Ticket (such Ticket will not be refunded); • Deface, mark, damage, tear down or otherwise destroy, in whole or in part, any of the decorations, infrastructure or part of the Event site; • Litter or fail to maintain the cleanliness of the Event site; • Resist the direction of, and search by, security personnel; • Refuse to declare and forfeit objects that are considered to be dangerous or off-limits by the Event’s security personnel – security personnel are under no obligation to return such forfeited items; and • Act in violation of the provisions of one (1) or more articles of these regulations or the spirit thereof. You must heed the directions of Event organizers and security personnel at all times whilst on the Event site. If You fail to comply with such directions, You will be removed from the Event site, and, if necessary, Event staff may call on the police for assistance. ARTICLE 6: RE-ENTRY Ticketholders that exit the Event will have to purchase a new Ticket to re-enter the Event the same day. If You are removed from the Event, Your ticket shall not be refunded and You will be denied re-entry, even if You are in possession of a new Ticket. If You have a new Ticket, Event staff may seize that Ticket and You shall not receive a refund. ARTICLE 7: UNAUTHORIZED SALE OR USE OF TICKET Anyone caught forging entry tickets or any other special admission tickets in order to access or sell such tickets to the Event will be prosecuted without exception. Counterfeit tickets will not be honored or refunded by the Company and Your purchase of such ticket(s) is not binding on the Company whatsoever. Anyone caught tampering with or sharing their Ticket will be immediately ejected and banned from the Event. Tickets may not be resold without prior explicit permission from the Company. Tickets which appear to have been resold without permission from the Company will not be honored or subject to a refund. The resale, attempted resale, or purchase of Your Ticket at a price higher than the official purchase price from the authorized ticket agent Ticketmaster, Universe, or other Company-authorized sale channels, is grounds for seizure and cancellation of Your Ticket without compensation. The only valid tickets are those purchased and/or redeemed through Ticketmaster, Universe or other Company-authorized sale channels listed on the official Company website. Tickets may not be used in association with any giveaway, sweepstakes, contest or similar activities, including, but not limited to, as a prize or incentive, without the Company’s prior written consent. Any Ticket so used will automatically become void at the Company’s sole discretion with no refund to You and/or the ticketholder. ‍ ARTICLE 8: RECORDINGS By attending the Event, You understand, agree and acknowledge that (i) You may be photographed and filmed, and (ii) You hereby provide the Company with Your absolute, express consent to be photographed and filmed. You further understand and agree that these images and/or recordings can be registered, stored, transmitted, broadcast/streamed, rebroadcast, and sold for archival, promotional, and/or commercial purposes, in any manner, and in any media, now known or hereafter discovered, without any compensation to You. Your name, image and/or Your likeness may be captured as part of and/or used in connection with any broadcast/stream, audio, visual, or audio-visual recording, photograph, or other reproduction or other publication of the Event (the “Footage”) and may also be used by or on behalf of the Company or any of the Company’s parent entities, subsidiaries, affiliates, partners, sponsors, officers, shareholders, successors or assigns for any purpose, including, but not limited to, archival, promotional, and commercial purposes, without any compensation to You. You waive all other rights in and to the Footage, including, but not limited to, all claims of so-called moral rights. This Footage may be used as a means to identify and facilitate the prosecution of illegal or impermissible conduct. At the Event, there will be camera surveillance for the purpose of ensuring the safety and proper operation of the Event. The Footage may be registered or stored by the Company or governmental authorities for the purpose of ensuring the security and safety of Event attendees and the enforcement of and compliance with the safety regulations on the Event site. Any recordings made by ticketholders on or near the Event site may not be used for commercial or public purposes, unless consented to by the Company (including, without limitation, having ads run on or beside such videos on YouTube and other video sharing websites). Non-professional grade small video cameras and cameras are allowed at the Event site. ARTICLE 9: MERCHANDISE Official T-shirts and other Event souvenirs are only on sale within the Event site.Unless you have received written permission from Company, You may not sell any items at the Event. Unauthorized sale of goods at the Event may result in your removal from the Event. ARTICLE 10: PARKING The Company disclaims all responsibility from losses or damages to vehicles parked on or near the Event. The Company is not responsible for losses or damage to any vehicle towed from the Event site. ARTICLE 11: REFUSE You must maintain the cleanliness of the Event site and dispose of refuse properly. The collecting points for garbage and recycling on the Event site will be clearly indicated. The bathroom facilities at the Event are free of charge. It is forbidden to use any other location as a bathroom facility. ARTICLE 12: ZERO TOLERANCE DRUGS POLICY The Company has a zero tolerance policy regarding illegal drugs. It is forbidden on the Event site to: (i) use, distribute, sell and/or to be in possession of illegal drugs; and (ii) distribute, sell or improperly use prescription or over-the-counter drugs. You understand and agree that Your use of the Ticket is contingent upon Your unconditional and voluntary acceptance to be searched for the presence of drugs, weapons, objects that may disrupt the peace or jeopardize the safety of other ticketholders, and/or other prohibited items prior to Your admission to the Event site, and/or at any time thereafter. If any of these items are found, this license for admission shall be immediately revoked, such items will be seized by security personnel and forfeited by You, or You will be immediately removed from the Event. Notwithstanding the foregoing, You are permitted to bring into the Event prescription drugs if You have a valid prescription with Your name clearly listed on the prescription. You will only be allowed to carry the dosage of medication required for the duration of the Event. If You are in violation of this rule, You will be immediately ejected from the Event site. The Event staff will closely monitor any potential illegal or prohibited drug activity, relying in part on security cameras placed throughout the Event site. ‍ Company may choose to, but shall not be required to, offer amnesty bins at the Event. ‍ By entering the Event site, You consent to be searched by Event staff. If You refuse to submit to a search by Event staff, You will be denied entry to, or ejected from, the Event site. ARTICLE 13: ADDITIONAL AMENITIES ATMs may be available at the Event site. Some open-air stages are fitted with large screens enabling anybody who is standing further away to enjoy the Event. ‍ ARTICLE 14: ADA ACCOMMODATIONS If You would like additional information about available ADA accommodations, please e-mail the Company at info@damngoodhospitality .com or visit the official Company website for details at https://www. damngoodhospitality .com/ . ARTICLE 15: EVENT SAFETY Due to weather or other conditions, the floors and/or Event grounds may in whole, or in part, slippery. ARTICLE 16: MEDICAL CARE You hereby consent to medical care and transportation in order to obtain treatment in the Event of injury as Event staff, security, police or medical professionals may deem appropriate in their reasonable discretion. You understand this waiver extends to any liability that arises out of, or is in any way connected with, the medical treatment and transportation provided in the event of an emergency and/or injury. You hereby agree to release and hold harmless the Company Parties from any liability arising out of or in connection with the actions or omissions of the Company Parties related to Your medical care. You recognize and acknowledge that there are hazards and risks of physical injury or illness and that not all such risks can be fully eliminated. By entering the Event site, You voluntarily agree to assume the full risk of death, bodily injury or property damage, regardless of severity, that may sustain as a result of attendance at the Event or while on the premises, except to the extent caused by the gross negligence or willful misconduct of the Company Parties. ARTICLE 17: INDEMNIFICATION You hereby indemnify and hold harmless BACKYARD, 3J HOSPITALITY, LLC, DAMN GOOD HOSPITALITY, STACHE, REVOLUTION LIVE, their related companies, and each of their respective representatives, officers, directors, owners, members, trustees, agents, attorneys, employees, successors and assigns, TICKETMASTER, UNIVERSE, and any other designated ticketing agent, Event sponsors/promoters, and the performing artists, including, but not limited to, their respective management, their agents, their staff and their designees (collectively, the “Company Parties”) harmless from any loss, liability, damage or cost in any way arising out of, or related to, Your actions and omissions at, around, or while traveling to and from, the Event. You hereby waive, discharge, hold harmless and covenant not to sue the Company Parties from any and all liability arising out of, or in connection with, the Event, for any claims, causes of action, obligations, lawsuits, charges, complaints, controversies, damages, costs or experiences of whatsoever kind, nature, or description, whether direct or indirect, in law or in equity, in contract or in tort, or otherwise, whether known or unknown, arising out of, or related to, the Event, Your attendance at the Event, or Your travel to and from the Event, except to the extent caused by the gross negligence or willful misconduct of the Company Parties. IN NO EVENT WILL THE COMPANY PARTIES OR THEIR SUPPLIERS, ADVERTISERS AND SPONSORS, BE RESPONSIBLE OR LIABLE TO YOU OR ANYONE ELSE FOR, AND YOU HEREBY KNOWINGLY AND EXPRESSLY WAIVE ALL RIGHTS TO SEEK, DIRECT, INDIRECT, EXEMPLARY, INCIDENTAL, SPECIAL, PUNITIVE OR CONSEQUENTIAL DAMAGES OR LOST PROFITS, REVENUES OR BUSINESS OPPORTUNITIES, OR OTHER DAMAGES OF ANY TYPE, AND ANY RIGHTS TO HAVE DAMAGES MULTIPLIED OR OTHERWISE INCREASED, ARISING OUT OF, OR IN CONNECTION WITH, THE EVENT OR ANY PRODUCT OR SERVICE PURCHASED AT THE EVENT, EVEN IF THE COMPANY PARTIES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES, AND REGARDLESS OF WHETHER THE CLAIM IS BASED UPON ANY CONTRACT, TORT, OR OTHER LEGAL OR EQUITABLE THEORY. WITHOUT LIMITING THE FOREGOING, YOU EXPRESSLY ACKNOWLEDGE AND AGREE THAT THE COMPANY PARTIES WILL HAVE NO LIABILITY OR RESPONSIBILITY WHATSOEVER FOR (a) ANY FAILURE OF ANOTHER ATTENDEE OF THE EVENT TO CONFORM TO THESE RULES, (b) PERSONAL INJURY OR PROPERTY DAMAGE OF ANY NATURE WHATSOEVER, WHETHER ARISING IN CONTRACT OR IN TORT, RESULTING FROM YOUR ATTENDANCE AT THE EVENT, (c) ANY ERRORS, MISTAKES, INACCURACIES OR OMISSIONS IN ANY CONTENT, OR (d) ANY LOST, STOLEN OR DAMAGED TICKETS, OR FAILURE OF EVENT STAFF OR SECURITY TO HONOR YOUR TICKET. YOUR SOLE AND EXCLUSIVE REMEDY FOR DISSATISFACTION WITH THE EVENT IS TO LEAVE THE EVENT . THE LIMITATIONS IN THIS ARTICLE 17 SECTION 3 WILL APPLY EVEN IF ANY LIMITED REMEDY FAILS ITS ESSENTIAL PURPOSE. THE ALLOCATION OF RISK BETWEEN US IS AN ESSENTIAL ELEMENT OF THE BASIS OF THE BARGAIN BETWEEN US. SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OR LIMITATION OF DAMAGES, SO THESE MAY NOT APPLY TO YOU. IN SUCH CASES, THE COMPANY PARTIES’ LIABILITY WILL BE LIMITED TO THE FULLEST EXTENT PERMITTED BY APPLICABLE LAW. IN NO EVENT WILL ATTORNEYS’ FEES BE AWARDED OR RECOVERABLE BY YOU. ARTICLE 18: MISCELLANEOUS PROVISIONS In no event shall the Company Parties be liable for any claim unless written notice is given within six (6) months from the date of the loss. No suit for any cause may be maintained against the Company Parties unless it is commenced within one (1) year after the Event. The parties hereto specifically consent to personal jurisdiction of said courts. These terms shall be governed by and construed under the laws of the State of Florida. Any controversy or claim arising out of or relating to these terms shall be brought only in the courts located in Miami-Dade County in the State of Florida, unless otherwise specified. You understand that the Company Parties and all other related parties, including, but not limited to, each of the Company Parties and the related parties’ management, employees, and agents, will not be held responsible, financially or otherwise, for any items that are left, lost, stolen, destroyed, confiscated, damaged or misplaced anywhere at the Event site regardless of fault or reason, so act accordingly. Any and all losses incurred by You under this Article 18, Section 3 shall be subject to Article 17, Section 1 above. The Company recommends that You do not bring any valuables to the Event. You unconditionally agree that the terms and conditions contained herein and/or referenced herein represent the entire Agreement between You and the Company with respect to its subject matter, and shall supersede and replace all prior contemporaneous understandings, communications, and agreements, written or oral, regarding such subject matter which contradict these terms, including, but not limited to, the text contained on the back of the actual Ticket and/or any contrary understanding or agreements between You and the Company. You further confirm that there are no other agreements between You and any of the other Company Parties. You unconditionally agree to be bound by any and all of the terms and conditions contained herein and/or referenced herein and any additions, changes and/or modifications thereof, which may be made from time to time without prior notice to You. Any updates to these terms and conditions will be posted to this website address. If any provision of this Agreement is found to be invalid or unenforceable, that provision shall be enforced to the maximum extent possible so as to effect the intent of the parties hereto, and the other provisions contained herein will remain in full force and effect. Company’s failure to insist upon or enforce any provision of this Agreement shall not be construed as a waiver of any provision or right. Facebook Instagram Email ©\n\t\t\t\t\t\t\t2025 Backyard Web Machines by Q Branch To the top ↑ Up ↑ Order for Pickup Order for Pickup Close The Backyarders Subscribe * indicates required Email Address * First Name * Last Name * Birthday / ( mm / dd ) Phone Number Gender * Male Female Prefer not to say"
    }
  ]
}