{
  "fuentes": [
    {
      "url": "https://thevendry.com/venue/239412/badfins-food-+-brew-clearwater-fl",
      "email": "events@badfins.com"
    },
    {
      "url": "https://badfins.com/contact-us/",
      "email": "info@badfins.com"
    },
    {
      "url": "https://www.nashvillepost.com/business/retail/food-notes-big-bad-breakfast-names-interim-culinary-director/article_d059fce6-8177-11ed-9c98-b3dd5e08239e.html",
      "email": "info@nashvillepost.com"
    },
    {
      "url": "https://www.nashvillepost.com/business/retail/food-notes-big-bad-breakfast-names-interim-culinary-director/article_d059fce6-8177-11ed-9c98-b3dd5e08239e.html",
      "email": "tips@nashvillepost.com"
    },
    {
      "url": "https://badfins.com/food-categories/desserts/",
      "email": "info@badfins.com"
    },
    {
      "url": "https://badfins.com/category/blog/",
      "email": "info@badfins.com"
    },
    {
      "url": "https://badfins.com/blog/",
      "email": "info@badfins.com"
    },
    {
      "url": "https://badfins.com/terms-conditions/",
      "email": "info@badfins.com"
    },
    {
      "url": "https://badfins.com/blog/welcome-to-clearwater-florida-the-land-of-fun-and-food/",
      "email": "info@badfins.com"
    },
    {
      "url": "https://www.foundersfoodgroup.com/",
      "email": "rsenft@tricorpacific.com"
    },
    {
      "url": "https://www.foundersfoodgroup.com/",
      "email": "tjohnstone@tricorpacific.com"
    },
    {
      "url": "https://badfins.com/beer-menu/",
      "email": "info@badfins.com"
    },
    {
      "url": "https://badfins.com/blog/qr-menu-ordering-is-now-available-at-badfins/",
      "email": "info@badfins.com"
    },
    {
      "url": "https://badfins.com/food-categories/for-kids/",
      "email": "info@badfins.com"
    },
    {
      "url": "https://badfins.com/blog/badfins-wins-the-tripadvisor-2021-travelers-choice-award/",
      "email": "info@badfins.com"
    },
    {
      "url": "https://www.forbes.com/sites/meimeifox/2019/06/07/7-entrepreneurs-shaking-up-the-food-industry/",
      "email": "corrections@forbes.com"
    },
    {
      "url": "https://www.forbes.com/sites/meimeifox/2019/06/07/7-entrepreneurs-shaking-up-the-food-industry/",
      "email": "feedback@forbes.com"
    },
    {
      "url": "https://thestrangebrew.co.uk/what-about-us/",
      "email": "whataboutus@telus.net"
    },
    {
      "url": "https://badfins.com/",
      "email": "info@badfins.com"
    },
    {
      "url": "https://badfins.com/join-our-team/",
      "email": "info@badfins.com"
    },
    {
      "url": "https://badfins.com/sides/",
      "email": "info@badfins.com"
    }
  ],
  "mails": [
    "corrections@forbes.com",
    "events@badfins.com",
    "feedback@forbes.com",
    "info@badfins.com",
    "info@nashvillepost.com",
    "rsenft@tricorpacific.com",
    "tips@nashvillepost.com",
    "tjohnstone@tricorpacific.com",
    "whataboutus@telus.net"
  ],
  "nombre_sitio": "badfins.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://thevendry.com/venue/239412/badfins-food-+-brew-clearwater-fl",
      "text": "Badfins Food + Brew - Seafood Restaurant in Clearwater, FL | The Vendry by by Search Inspiration Circles Log In Sign Up by The community and marketplace for event pros. Join Us List My Business The Vendry Organizations The Memo About the Vendry Contact Us Groupize Keep me posted with industry news, cool case studies, and events. Your email address Subscribe © 2025 THE VENDRY LLC. Privacy Terms & Conditions Terms of Use Overview Spaces Press Nearby Hotels Badfins Food + Brew Restaurant 215 S Gulfview Blvd, Clearwater, FL 33767, United States Badfins Food + Brew 215 S Gulfview Blvd, Clearwater, FL 33767, United States Request Pricing Cuisine Type Seafood # of Spaces 1 Capacity Max Seated: 100 Badfins Food + Brew’s private comfort patio and beer garden provide amazing views of Clearwater Beach and welcomes not only the casual beach diner, but also accommodates private parties and other events, such as corporate events, rehearsal dinners, receptions, birthday parties, and dinner events. Show more Show more Request Pricing 215 South Gulfview Boulevard, Clearwater, FL Show on the map Spaces Full Buyout Of The Badfins Food + Brew Max Seated: 100 Full Buyout Of The Badfins Food + Brew Max Seated: 100 Press Guided by Destiny A Local Guide: BEST Restaurants in Clearwater Beach Aug 24, 2023 shebuystravel.com The Best “Must-Try” Clearwater Beach Restaurants Jun 9, 2023 Exploring the Gulf 19 Best Downtown Clearwater Restaurants to Try in 2023 Jan 31, 2023 Guided by Destiny A Local Guide: BEST Restaurants in Clearwater Beach Aug 24, 2023 shebuystravel.com The Best “Must-Try” Clearwater Beach Restaurants Jun 9, 2023 Exploring the Gulf 19 Best Downtown Clearwater Restaurants to Try in 2023 Jan 31, 2023 Do you work for Badfins Food + Brew ? Contact us to learn more about who's managing this profile or gain access. Other Venues in Clearwater for Your Event Clearwater Restaurants Clearwater Stadiums Clearwater Hotels Clearwater Event Spaces Clearwater Boats / Yachts Clearwater Museums / Galleries Clearwater Bars / Clubs Clearwater Convention Centers Clearwater Breweries / Distilleries Clearwater Aquariums / Zoos Clearwater Performance Spaces Clearwater Coworking Spaces Clearwater Golf Courses Clearwater Restaurants Clearwater Stadiums Clearwater Hotels Clearwater Event Spaces Clearwater Boats / Yachts Clearwater Museums / Galleries Clearwater Bars / Clubs Clearwater Convention Centers Clearwater Breweries / Distilleries Clearwater Aquariums / Zoos Clearwater Performance Spaces Clearwater Coworking Spaces Clearwater Golf Courses"
    },
    {
      "url": "https://badfins.com/contact-us/",
      "text": "Contact Us | Seafood Restaurants near Clearwater BeachFL Skip to content Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Contact Us Badfins Restaurant Clearwater Beach » Contact Us Book Reservation Book a reservation for small parties up to 20 guests: Book Reservation Find Us Location 215 S. Gulfview Boulevard Clearwater, Florida 33767 Text Us 727-474-5591 (Text Only) Hours Mon - Thur - 11:30am - *BOB Fri - Sat - 11:30am - *BOB Sun - 11:30am - *BOB *Based on Business Drop Us a Line Facebook-f Instagram Twitter If you have questions or need additional information,\nplease text: 727-474-5591 First Name Last Name Email Occasion Date of Event : Number of Guests Tell us More Send Terms and Conditions: “You agree to receive [TYPES of MESSAGES] from [BUSINESS NAME]. Message frequency varies. Message and data rates may apply. For help, reply HELP or email us at [EMAIL ADDRESS]. You can opt out at any time by replying STOP.” Submit Become a \"Badfins\" Reward Member Earn 1-point for every dollar spent & $3 cashback! Oh, and be sure to stay on the lookout for double & triple point events... #moneyinthebank💰 First Name Last Name Email Send *By signing up you give Badfins permission to email you the latest happenings as well as AMAZING discount opportunities. Welcome to the family! Wyndham Grand Beach Resort 215 S. Gulfview Blvd. Clearwater, Florida 33767 - 727-474-5591 (Text Only) Facebook-f Instagram Twitter Useful Links Order Now Clearwater Beach Brewery Book an Event at Clearwater Restaurants Join Our Team at Restaurant in Clearwater FL Contact Us Restaurants on the Beach in Clearwater Read Our Blog of Restaurant at Clearwater Privacy Policy Terms & Conditions Book your next special event with us. Text us at 727-474-5591 for more information or click button below to fill out our event form. Mon - Thur - 11:30am - *BOB Fri - Sat - 11:30am - *BOB Sun - 11:30am - *BOB *Based on Business EVENT FORM Copyright © 2021 Badfins Clw Beach , LLC. All rights reserved. Powered by Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Location 215 S. Gulfview Boulevard Clearwater, Florida 33767 Phone 727-474-5591 info@badfins.com Hours Mon - Thur - 11:30am - *BOB Fri - Sat - 11:30am - *BOB Sun - 11:30am - *BOB *Based on Business Copyright © 2021 Badfins Clw Beach , LLC. All rights reserved. Optimized by Seraphinite Accelerator Turns on site high speed to be attractive for people and search engines."
    },
    {
      "url": "https://www.nashvillepost.com/business/retail/food-notes-big-bad-breakfast-names-interim-culinary-director/article_d059fce6-8177-11ed-9c98-b3dd5e08239e.html",
      "text": "Please wait while we attempt to load the requested page"
    },
    {
      "url": "https://badfins.com/food-categories/desserts/",
      "text": "Desserts Archives | Badfins Food + Brew Skip to content Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Food Categories: Desserts Cinnamon Toast Crunch Shake Vanilla Ice Cream, Caramel Sauce Whipped Cream, and topped with Cinnamon Toast Crunch Sopapillas Small order 3 for $5 / Large order 5 for $9 Fried pastry dough balls tossed in cinnamon and powdered sugar and drizzled with caramel and pineapple rum sauce Reese’s Puffs & Chocolate Shake Vanilla Ice Cream blended with Chocolate Sauce, Whipped Cream and topped with Reese’s Puffs Fruity Pebbles & Strawberry Shake Vanilla Ice Cream blended with Strawberry Sauce, Whipped Cream, and topped with Fruity Pebbles Search Search Recent Posts QR Menu Ordering Is Now Available at Badfins Everything About Our Awesome Restaurants Rewards Program The Local Favorite Seafood Restaurant at Clearwater Beach Badfins – The Best Beachfront Bar in Clearwater Beach Welcome to Clearwater, Florida : The Land of Fun and Food Recent Comments No comments to show. Become a \"Badfins\" Reward Member Earn 1-point for every dollar spent & $3 cashback! Oh, and be sure to stay on the lookout for double & triple point events... #moneyinthebank💰 First Name Last Name Email Send *By signing up you give Badfins permission to email you the latest happenings as well as AMAZING discount opportunities. Welcome to the family! Wyndham Grand Beach Resort 215 S. Gulfview Blvd. Clearwater, Florida 33767 - 727-474-5591 (Text Only) Facebook-f Instagram Twitter Useful Links Order Now Clearwater Beach Brewery Book an Event at Clearwater Restaurants Join Our Team at Restaurant in Clearwater FL Contact Us Restaurants on the Beach in Clearwater Read Our Blog of Restaurant at Clearwater Privacy Policy Terms & Conditions Book your next special event with us. Text us at 727-474-5591 for more information or click button below to fill out our event form. Mon - Thur - 11:30am - *BOB Fri - Sat - 11:30am - *BOB Sun - 11:30am - *BOB *Based on Business EVENT FORM Copyright © 2021 Badfins Clw Beach , LLC. All rights reserved. Powered by Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Location 215 S. Gulfview Boulevard Clearwater, Florida 33767 Phone 727-474-5591 info@badfins.com Hours Mon - Thur - 11:30am - *BOB Fri - Sat - 11:30am - *BOB Sun - 11:30am - *BOB *Based on Business Copyright © 2021 Badfins Clw Beach , LLC. All rights reserved. Optimized by Seraphinite Accelerator Turns on site high speed to be attractive for people and search engines."
    },
    {
      "url": "https://badfins.com/category/blog/",
      "text": "Blog Archives | Badfins Food + Brew Skip to content Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Blog QR Menu Ordering Is Now Available at Badfins February 16, 2022 November 23, 2021 by Eric Miller Just when you thought Badfins couldn’t get any better, we’ve now made it even easier for you to order and enjoy our food. QR menu codes are here and ready for your scanning pleasure. We’re always striving to be the best restaurant on Clearwater Beach. With QR menu ordering, we uphold a standard for safety … Read more Categories Blog Everything About Our Awesome Restaurants Rewards Program February 16, 2022 November 23, 2021 by Eric Miller Don’t you love getting free stuff? Especially when its stuff you actually like, like a blackened mahi taco or a berry margarita—or a beer (like one of the 34 we have on tap). With Badfins Rewards, you can get free food and drinks in all of their delicious glory simply by eating what you already … Read more Categories Blog The Local Favorite Seafood Restaurant at Clearwater Beach December 7, 2022 November 23, 2021 by Eric Miller Whether you’re a long-time resident, someone who’s just moved, or a vacationer, it’s always nice to find where the locals like to hang out. And since you’re at the beach, one of the first places you’ll want to find is the local favorite seafood restaurant at Clearwater Beach. Fresh seafood, great nightly deals, and a … Read more Categories Blog Badfins – The Best Beachfront Bar in Clearwater Beach February 16, 2022 November 23, 2021 by Eric Miller Clearwater Beach is famous for its soft, white sand stretch that draws tourists to its clear waters for jet skiing, parasail, and paddle boarding throughout the year. Raiders and scooters go round a winding promenade, bordered by casual seafood restaurants, cafes, and bars in Clearwater Beach. Pier 60 is the venue at sunset for an … Read more Categories Blog Welcome to Clearwater, Florida : The Land of Fun and Food February 16, 2022 November 23, 2021 by Eric Miller Introduction Florida is the place to be for fun-filled days and endless adventure, especially when you are at Clearwater Beach. Situated just a short distance from Tampa, Clearwater Beach is the ultimate destination for lip-smacking food, incredible drinks, and relaxation. Where is Clearwater Beach, Florida? Clearwater Beach is about 25 miles west of Tampa on … Read more Categories Blog Badfins Wins The Tripadvisor 2021 Travelers’ Choice Award December 19, 2022 November 23, 2021 by Eric Miller 2020 was the most challenging year for people who love to travel or hang out with friends. So much so that we stopped hearing “TGIF”. However, one thing that remained constant is people’s love for our brand, Badfins. We are overwhelmed and super excited to be The Tripadvisor 2021 Travelers’ Choice Award Winner. We promise … Read more Categories Blog Search Search Recent Posts QR Menu Ordering Is Now Available at Badfins Everything About Our Awesome Restaurants Rewards Program The Local Favorite Seafood Restaurant at Clearwater Beach Badfins – The Best Beachfront Bar in Clearwater Beach Welcome to Clearwater, Florida : The Land of Fun and Food Recent Comments No comments to show. Become a \"Badfins\" Reward Member Earn 1-point for every dollar spent & $3 cashback! Oh, and be sure to stay on the lookout for double & triple point events... #moneyinthebank💰 First Name Last Name Email Send *By signing up you give Badfins permission to email you the latest happenings as well as AMAZING discount opportunities. Welcome to the family! Wyndham Grand Beach Resort 215 S. Gulfview Blvd. Clearwater, Florida 33767 - 727-474-5591 (Text Only) Facebook-f Instagram Twitter Useful Links Order Now Clearwater Beach Brewery Book an Event at Clearwater Restaurants Join Our Team at Restaurant in Clearwater FL Contact Us Restaurants on the Beach in Clearwater Read Our Blog of Restaurant at Clearwater Privacy Policy Terms & Conditions Book your next special event with us. Text us at 727-474-5591 for more information or click button below to fill out our event form. Mon - Thur - 11:30am - *BOB Fri - Sat - 11:30am - *BOB Sun - 11:30am - *BOB *Based on Business EVENT FORM Copyright © 2021 Badfins Clw Beach , LLC. All rights reserved. Powered by Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Location 215 S. Gulfview Boulevard Clearwater, Florida 33767 Phone 727-474-5591 info@badfins.com Hours Mon - Thur - 11:30am - *BOB Fri - Sat - 11:30am - *BOB Sun - 11:30am - *BOB *Based on Business Copyright © 2021 Badfins Clw Beach , LLC. All rights reserved."
    },
    {
      "url": "https://badfins.com/blog/",
      "text": "Our Blogs | Restaurant at Clearwater - Badfins Skip to content Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Blog Badfins Restaurant Clearwater Beach » Blog All Articles QR Menu Ordering Is Now Available at Badfins Just when you thought Badfins couldn’t get any better, we’ve now... Read More Everything About Our Awesome Restaurants Rewards Program Don’t you love getting free stuff? Especially when its stuff you... Read More The Local Favorite Seafood Restaurant at Clearwater Beach Whether you’re a long-time resident, someone who’s just moved, or a... Read More Badfins – The Best Beachfront Bar in Clearwater Beach Clearwater Beach is famous for its soft, white sand stretch that... Read More Welcome to Clearwater, Florida : The Land of Fun and Food Introduction Florida is the place to be for fun-filled days and... Read More Badfins Wins The Tripadvisor 2021 Travelers’ Choice Award 2020 was the most challenging year for people who love to... Read More Become a \"Badfins\" Reward Member Earn 1-point for every dollar spent & $3 cashback! Oh, and be sure to stay on the lookout for double & triple point events... #moneyinthebank💰 First Name Last Name Email Send *By signing up you give Badfins permission to email you the latest happenings as well as AMAZING discount opportunities. Welcome to the family! Wyndham Grand Beach Resort 215 S. Gulfview Blvd. Clearwater, Florida 33767 - 727-474-5591 (Text Only) Facebook-f Instagram Twitter Useful Links Order Now Clearwater Beach Brewery Book an Event at Clearwater Restaurants Join Our Team at Restaurant in Clearwater FL Contact Us Restaurants on the Beach in Clearwater Read Our Blog of Restaurant at Clearwater Privacy Policy Terms & Conditions Book your next special event with us. Text us at 727-474-5591 for more information or click button below to fill out our event form. Mon - Thur - 11:30am - *BOB Fri - Sat - 11:30am - *BOB Sun - 11:30am - *BOB *Based on Business EVENT FORM Copyright © 2021 Badfins Clw Beach , LLC. All rights reserved. Powered by Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Location 215 S. Gulfview Boulevard Clearwater, Florida 33767 Phone 727-474-5591 info@badfins.com Hours Mon - Thur - 11:30am - *BOB Fri - Sat - 11:30am - *BOB Sun - 11:30am - *BOB *Based on Business Copyright © 2021 Badfins Clw Beach , LLC. All rights reserved. Optimized by Seraphinite Accelerator Turns on site high speed to be attractive for people and search engines."
    },
    {
      "url": "https://badfins.com/terms-conditions/",
      "text": "Terms & Conditions | Badfins Food + Brew Skip to content Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Terms & Conditions Recurring Message Terms and Conditions Sample Effective Date:01/01/2025 By opting in to receive SMS messages from Badfins Food + Brew (“we,” “us,” “our”), you agree to these Terms and Conditions (Terms). SMS Messaging Service By providing my phone number, I consent to receive SMS text messages from [Brand Name used to Register the campaign] for customer care messages about our restaurant times, menu and other related materials. Message and Data Rates may apply. Message Frequency You will get more than one message from us unless you opt-out, and while messaging frequency varies, you will likely receive messages and responses to the questions you asked about Badfins Food + Brew. Badfins Food + Brew reserves the right to alter the frequency of messages at any time to increase or decrease the total number of messages. Badfins Food + Brew and carriers are not liable for delays or undelivered messages. Message and Data Rates Message and data rates may apply based on your mobile carrier’s terms. Privacy Policy Your information will be handled in accordance with our Privacy Policy . Cancellation/Opt-Out Instructions You can opt out of receiving SMS messages at any time by replying STOP to any message we send you. After you opt out of text messaging, you will receive one additional message confirming your request has been processed. Help/Customer Support Text the word HELP for support. You may also contact us directly at 727-474-5591 or help@badfins.com. Liability We are not responsible for any charges, errors, or delays in SMS delivery or undelivered messages caused by your carrier or third-party service providers. Become a \"Badfins\" Reward Member Earn 1-point for every dollar spent & $3 cashback! Oh, and be sure to stay on the lookout for double & triple point events... #moneyinthebank💰 First Name Last Name Email Send *By signing up you give Badfins permission to email you the latest happenings as well as AMAZING discount opportunities. Welcome to the family! Wyndham Grand Beach Resort 215 S. Gulfview Blvd. Clearwater, Florida 33767 - 727-474-5591 (Text Only) Facebook-f Instagram Twitter Useful Links Order Now Clearwater Beach Brewery Book an Event at Clearwater Restaurants Join Our Team at Restaurant in Clearwater FL Contact Us Restaurants on the Beach in Clearwater Read Our Blog of Restaurant at Clearwater Privacy Policy Terms & Conditions Book your next special event with us. Text us at 727-474-5591 for more information or click button below to fill out our event form. Mon - Thur - 11:30am - *BOB Fri - Sat - 11:30am - *BOB Sun - 11:30am - *BOB *Based on Business EVENT FORM Copyright © 2021 Badfins Clw Beach , LLC. All rights reserved. Powered by Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Location 215 S. Gulfview Boulevard Clearwater, Florida 33767 Phone 727-474-5591 info@badfins.com Hours Mon - Thur - 11:30am - *BOB Fri - Sat - 11:30am - *BOB Sun - 11:30am - *BOB *Based on Business Copyright © 2021 Badfins Clw Beach , LLC. All rights reserved. Optimized by Seraphinite Accelerator Turns on site high speed to be attractive for people and search engines."
    },
    {
      "url": "https://badfins.com/blog/welcome-to-clearwater-florida-the-land-of-fun-and-food/",
      "text": "Clearwater, Florida: Fun Things to Do Skip to content Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Welcome to Clearwater, Florida : The Land of Fun and Food Badfins Restaurant Clearwater Beach » Welcome to Clearwater, Florida : The Land of Fun and Food SHARE Prev Badfins Wins The Tripadvisor 2021 Travelers’ Choice Award Badfins – The Best Beachfront Bar in Clearwater Beach Next Introduction Florida is the place to be for fun-filled days and endless adventure, especially when you are at Clearwater Beach. Situated just a short distance from Tampa, Clearwater Beach is the ultimate destination for lip-smacking food, incredible drinks, and relaxation. Where is Clearwater Beach, Florida? Clearwater Beach is about 25 miles west of Tampa on the Gulf Coast. You may choose to fly into Clearwater. Two of the closest airports available are the St. Petersburg-Clearwater International Airport and Tampa International Airport. Depending on the traffic, Clearwater is about 35 to 45 minutes away from Tampa by road. Beachside Activities in Clearwater Beach, Florida As the name suggests, Clearwater Beach allows you to experience the beauty of nature in its truest form. This beach, with its soft, white sand, attracts visitors from all over the world. People engage themselves in tons of activities to suit their taste, whether that is sunbathing or water sports at the beachfront promenade. Some of our visitors’ favorite activities are, Parasailing Jet-skiing Stand-up paddleboarding Rollerblading Cycling Surfing Wave running Scuba diving Snorkeling Swimming Sailing Once you are done, you can beat the heat and have a bite at Clearwater Beach restaurants and cafes that are designed to impress. As the sun sets in the evening, you may see night-time festivals with craft vendors and street performers adding excitement to your day. With great food, drinks, and activities, you can make this vacation an experience of a lifetime at this beautiful holiday destination. If you’re looking for the best Clearwater Beach restaurant, Badfins Food + Brew provides some fantastic dining experiences to make your taste buds tingle. Alternatively, you may just choose to organize your party near the sea by booking our banquet hall. With Badfins, you’re guaranteed to experience endless excitement! What to Expect in Clearwater Beach Like its namesake, the water at Clearwater Beach is extremely clear, and the white sand is so soft that it feels like a luxurious carpet when you walk on it. You will find plenty of space at the beach to enjoy and relax under the sun. You can start your day at any of the Clearwater Beach breakfast restaurants and end your evening with a walk down the beach. Aside from adventure, there are plenty of romantic things to do in Clearwater Beach , and you may bring your partner for a cozy weekend here. Where to Stay in Clearwater Beach There are plenty of hotels, resorts, and lodges available near the beach. Most of these hotels and resorts are situated right on the beach, so you do not have to worry about traveling. The restaurants vary in their prices to suit your budget, but they all offer basic amenities, guarantee hygiene, and are conveniently located. Where to Eat in Clearwater Beach Food is an area in which you can’t compromise. A good vacation is nothing without delicious food and drinks. You can always check out Badfins Food + Brew. Our comprehensive menu guarantees to blow your mind and treat your taste buds. Besides, Clearwater Beach restaurants offer the freshest seafood and craft beer. Most of them line the beach, so you are not forced to spend time away from the sea. Clearwater Beach breakfast restaurants allow you to start your day with your favorite seafood overlooking the gorgeous sea and sparkling white sand. Adventure and Romance in Clearwater Beach, Florida Adventure and romance are in the air at Clearwater! Here’s a list of romantic things to do in Clearwater Beach. Visit the Clearwater Marine Aquarium with your partner and explore marine life. Go for a 90-minute sea safari, getting a first-hand look at the aquatic life and experiencing the famous dolphins from close quarters. There are more than a hundred dolphin sculptures around Clearwater Beach. You can see the creativity of the artists on these dolphin sculptures as you stroll through the area with your partner. Pier 60, which ends at Clearwater Beach, is a tourist hub. You can find eateries, playgrounds, souvenir shops, and much more on Pier 60. A daily event called “Sunsets at Pier 60” includes street performers and musical acts. You can enjoy the beautiful sunset at the beach with your partner. Transportation in Clearwater Beach Transportation in Clearwater Beach is hassle-free and convenient. It is advisable not to bring your vehicle as you will have to worry about parking spaces every time you make a move. Instead, choose local transport options. One of the most affordable options is the Jolly Trolley that makes multiple stops along Clearwater Beach. Florida Free Rides runs every day from 9 am to 3 pm, operating only on sponsors and tips. Conclusion There are only a few places in the world where you can experience true natural beauty combined with modern amenities and incredible food and activities. Clearwater Beach is certainly one of them. It has amazing places to dine, drink, and dance while overlooking one of the best beaches in the US. Clearwater Beach is a paradise for people looking to take a break at one of the best marine destinations in the country. What adds to the experience is the lip-smacking food. Whenever your taste buds need an adventure of their own, you can always visit Badfins to order from our amazing menu and dine and drink in a great ambiance. We can’t wait for you to visit us! Become a \"Badfins\" Reward Member Earn 1-point for every dollar spent & $3 cashback! Oh, and be sure to stay on the lookout for double & triple point events... #moneyinthebank💰 First Name Last Name Email Send *By signing up you give Badfins permission to email you the latest happenings as well as AMAZING discount opportunities. Welcome to the family! Wyndham Grand Beach Resort 215 S. Gulfview Blvd. Clearwater, Florida 33767 - 727-474-5591 (Text Only) Facebook-f Instagram Twitter Useful Links Order Now Clearwater Beach Brewery Book an Event at Clearwater Restaurants Join Our Team at Restaurant in Clearwater FL Contact Us Restaurants on the Beach in Clearwater Read Our Blog of Restaurant at Clearwater Privacy Policy Terms & Conditions Book your next special event with us. Text us at 727-474-5591 for more information or click button below to fill out our event form. Mon - Thur - 11:30am - *BOB Fri - Sat - 11:30am - *BOB Sun - 11:30am - *BOB *Based on Business EVENT FORM Copyright © 2021 Badfins Clw Beach , LLC. All rights reserved. Powered by Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Location 215 S. Gulfview Boulevard Clearwater, Florida 33767 Phone 727-474-5591 info@badfins.com Hours Mon - Thur - 11:30am - *BOB Fri - Sat - 11:30am - *BOB Sun - 11:30am - *BOB *Based on Business Copyright © 2021 Badfins Clw Beach , LLC. All rights reserved. Optimized by Seraphinite Accelerator Turns on site high speed to be attractive for people and search engines."
    },
    {
      "url": "https://www.foundersfoodgroup.com/",
      "text": "A Family Owned Company | Foundersfoodgroup.com | British Columbia top of page HOME ABOUT About Meet the Founders Investment Scope Working With Us Storyboard Testimonials Differentiation Transaction Process Case Studies OUR BUSINESSES Presteve Foods Armand Agra Walt's Ganache Brands TEAM Founders Team CONTACT More Use tab to navigate through the menu items. Founders' one-page summary of portfolio and investment criteria. THE FOUNDERS STORY FULL VIDEO HOME About Us About Founders ​ FAMILY-OWNED COMPANY INVESTING ITS OWN CAPITAL Founders is a family-owned company that invests its own capital and applies operating know-how to build a group of thriving food businesses and exceptional partnerships we can all be proud of. ​ LONG HISTORY & AFFILIATIONS Founders is backed by Tricor Pacific Capital (Rod Senft & Senft family), Saville House Holdings (Richard Harris & Harris family) and Garibaldi Blue (Derek Senft). Our partners combine deep operating knowledge with over 30 years’ experience making control investments in over 80 private companies . We have a track record of transacting with speed and price certainty as a group of highly experienced partners investing our own capital. ​ BUILDING A FAMILY OF THRIVING FOOD BUSINESSES AND EXCEPTIONAL PARTNERSHIPS In 2014, we set out to build a family of related food businesses in mature categories to grow over the very long term. Since 2020, Founders is focused on its existing portfolio, including acquisition of closely-related protein platforms and add-on M&A to Armand Agra, its US protein processing and distribution business, as well as new protein platforms. In 2021, we completed a substantial add-on to Armand Agra and a new platform acquisition, Walt's Meats. ​ ​ TRICOR & SAVILLE STORYBOARDS Download the storyboard for the Senft family's Tricor Pacific Capital and the Harris family's Saville House Holdings to get a snapshot of where Founders and its shareholders are active. COMPANY HISTORY Download Founders' timeline for a snapshot overview of who we are and to see how our group of companies has evolved over time. THE SWALLOW Learn more about the Swallow . Meet the Founders MEET THE FOUNDERS FULL VIDEO Read More On Working With Us Investment Criteria Investment Scope ​ ​ ​ Primarily focused on investments in food processors and distributors; also invest in related real estate. Primary focus on businesses with $5 to $10M of EBITDA (USD or CAD); stretching to $10 to $25M of EBITDA (USD or CAD) for exceptional opportunities ; no size limitation for add-on acquisitions to existing businesses. Geographic focus in Midwest, Southwest or West of USA and Central / Western Canada, extending to East within priority segments (e.g., protein ). Preference for mature and durable businesses that are cash-flow generative, and include hard assets. Look for opportunity to invest, grow and hold a business over very long term while offering liquidity for minority shareholders and management along the way; opportunity to contribute operating know-how to create value; opportunity for the business platform to create a bigger future; opportunity to create a mutual benefit among the different businesses in the Founders Group of Food Companies. \"Founders is a family-owned company that invests its own capital and applies operating know-how to build a group of thriving food businesses and exceptional partnerships we can all be proud of.\" Read More On Transaction Process Read More On Differentiation Our Businesses Our Businesses Statement complying with the Canadian Fighting Against Forced Labour and Child Labour in Supply Chains Act New Business Platforms Founders is actively seeking to add new food processors or distributors. Click here to see our Investment Scope . Industriousness and humility. Resilience and experience. Renewal, safe return, good luck and happiness. Read More On Case Studies Working With Us Working With Us ​ ​ PARTNERSHIP ALIGNMENT We ensure alignment of interests and financial goals across all stakeholders, including transparent ownership rights and structures. ​ REFINE STRATEGY & BUILD ORGANIZATION CAPABILITY We partner with companies in creating a strategic road-map with a focus on value creation through building organization capability (leadership & culture, people & skills, knowledge & systems, tools and processes, metrics) and improvements in market and customer relevance. ​ ​ LEADERSHIP SUPPORT Founders' senior team balance operating know-how with transaction and financing skills.  We engage as an active Chairman and Board , creating freedom within a framework for companies in our group. ​ ​ VALUES-DRIVEN MINDSET We have a values-driven mindset and culture. Our core mindsets and behaviors include: 'Love of Food', 'Always Improving', 'Be Ambitious', 'Freedom within a Framework', 'Stakeholder-oriented', 'People Matter', 'Build Organization Capability' and 'Winning with Customers & Consumers'. ​ ​ INVEST, BUILD, AND HOLD We are business builders (vs. investors), with an explicit intention to own our group of companies indefinitely. ​ ​ \"We imagine a decentralized but integrated group of food and beverage companies, each with the vision and ambition to be more tomorrow than they are today, where teams are continuously focused on winning in the marketplace, developing the strength and scalability of themselves and their businesses, creating working lives that are more rewarding for all, and making a positive impact on society.” Read More On Testimonials Team Founders Team Richard Harris Managing Partner Derek Senft Managing Partner Rod Senft Partner Trevor Johnstone Partner Faye Evangelista VP Finance Ailsa Harris Business Development Director Christian Maas Managing Director Zak Nash VP Corporate Development Alex Komarov Senior Accountant Arsh Malhi Treasury Manager Founders Group of Food Companies Inc. Suite 1858, 401 West Georgia Street Vancouver, BC V6B 5A1 Canada Richard Harris , Managing Partner richard.harris@foundersfoodgroup.com +1 (604) 646-4372 Derek Senft , Managing Partner derek.senft@foundersfoodgroup.com +1 (604) 726-5051 ​ Rod Senft , Partner rsenft@tricorpacific.com +1 (604) 646-4363 ​ Trevor Johnstone , Partner tjohnstone@tricorpacific.com +1 (604) 646-4364 ​ Christian Maas , Managing Director christian.maas@foundersfoodgroup.com +1 (604) 646-4377 ​ Ailsa Harris , Business Development Director ailsa.harris@foundersfoodgroup.com +1 (604) 505-6479 ​ Zak Nash , VP Corporate Development zak.nash@foundersfoodgroup.com +1 (604) 561-0789 ​ Faye Evangelista , VP Finance faye.evangelista@foundersfoodgroup.com +1 (604) 363-9409 ​ Arsh Malhi , Group Treasury Manager arsh.malhi@foundersfoodgroup.com ​ Alexander Komarov , Senior Accountant alexander.komarov@foundersfoodgroup.com ​ ​ ​ ​ Contact Us BACK TO TOP © 2018 Founders Group of Food Companies Inc. bottom of page"
    },
    {
      "url": "https://badfins.com/beer-menu/",
      "text": "Breweries in Clearwater fl - Badfins Food + Brew Skip to content Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Beers Badfins Restaurant Clearwater Beach » Beers We Love Beer! Yep, Sooooo Much That We Have Partnered With Local Breweries For A Tap Takeover Each Month Which Will Feature (4) Epic Beers. Want More? We Thought So! Join Us On The First Friday Of Every Month For Beer School…cheers! Tampa Bay Brewing Co. Try A Flight Of These Beers For Only $8.50 $1-OFF Any Featured Beer Every Friday, All Dayyyy! Reef Donkey – American Pale Ale – ABV 5.5% $1 Off On Friday”s (5pm – 10pm) View Item Cloudy Donkey – Double dry-hopped hazy pale ale – ABV 5.5% $1 Off On Friday”s (5pm – 10pm) View Item Old Elephant Foot – Indian Pale Ale –  ABV 7.0% $1 Off On Friday”s (5pm – 10pm) View Item Strawberry Cheesecake in the Face – imperial pastry-style fruited sour ale – ABV : 8.0% $1 Off On Friday”s (5pm – 10pm) View Item Become a \"Badfins\" Reward Member Earn 1-point for every dollar spent & $3 cashback! Oh, and be sure to stay on the lookout for double & triple point events... #moneyinthebank💰 First Name Last Name Email Send *By signing up you give Badfins permission to email you the latest happenings as well as AMAZING discount opportunities. Welcome to the family! Wyndham Grand Beach Resort 215 S. Gulfview Blvd. Clearwater, Florida 33767 - 727-474-5591 (Text Only) Facebook-f Instagram Twitter Useful Links Order Now Clearwater Beach Brewery Book an Event at Clearwater Restaurants Join Our Team at Restaurant in Clearwater FL Contact Us Restaurants on the Beach in Clearwater Read Our Blog of Restaurant at Clearwater Privacy Policy Terms & Conditions Book your next special event with us. Text us at 727-474-5591 for more information or click button below to fill out our event form. Mon - Thur - 11:30am - *BOB Fri - Sat - 11:30am - *BOB Sun - 11:30am - *BOB *Based on Business EVENT FORM Copyright © 2021 Badfins Clw Beach , LLC. All rights reserved. Powered by Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Location 215 S. Gulfview Boulevard Clearwater, Florida 33767 Phone 727-474-5591 info@badfins.com Hours Mon - Thur - 11:30am - *BOB Fri - Sat - 11:30am - *BOB Sun - 11:30am - *BOB *Based on Business Copyright © 2021 Badfins Clw Beach , LLC. All rights reserved. Optimized by Seraphinite Accelerator Turns on site high speed to be attractive for people and search engines."
    },
    {
      "url": "https://badfins.com/blog/qr-menu-ordering-is-now-available-at-badfins/",
      "text": "Get your favorite food at Badfins by Scanning a QR Code Skip to content Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog QR Menu Ordering Is Now Available at Badfins Badfins Restaurant Clearwater Beach » QR Menu Ordering Is Now Available at Badfins SHARE Prev Everything About Our Awesome Restaurants Rewards Program Just when you thought Badfins couldn’t get any better, we’ve now made it even easier for you to order and enjoy our food. QR menu codes are here and ready for your scanning pleasure. We’re always striving to be the best restaurant on Clearwater Beach. With QR menu ordering, we uphold a standard for safety in this strange and tumultuous time. Not to mention easier ordering for you and less paper and plastic waste from us. It’s a win-win for everyone, and that’s what we’re all about at Badfins. How QR Menu Ordering Works It’s as easy as 1-2-3. QR codes have been around for quite a while now which means phones are ripe and ready to scan them with minimal effort on your part. 1 — OPEN THE CAMERA No app required, just open your camera up. Whether it’s an iPhone or Android phone, the standard camera app has a built-in scanner to read QR codes. No need to delete anything from your phone to make this work, just open the camera and point it at the code. 2 — “SCAN” THE QR MENU CODE Point your camera at the QR menu code and boom, a pop-up of some kind will appear. This contains a link to our site menu, no typing required. Just point and tap, that’s all there is to it. 3 — BROWSE OUR MENU OF DELICIOUSNESS Tapping that pop-up leads to our menu where you can browse our tasty offerings. And done! You’ve successfully scanned, tapped, and browsed within seconds. Why We’ve Introduced the QR Menu SAFETY We’re minimizing the number of things you need to touch in order to enjoy the Badfins experience. Traditional menus get passed around, handled by customers and our staff, posing a potential threat to your health in the current state of the world. We eliminate this by putting our menu on your phone, something that only you handle, so there’s no shuffling or handoffs. We believe QR menu ordering is the safest way to go from here on out. It helps keep our staff, you, and the community safe. We still offer traditional menus upon request, though we do promote the QR menu above all before handing them out. Become a \"Badfins\" Reward Member Earn 1-point for every dollar spent & $3 cashback! Oh, and be sure to stay on the lookout for double & triple point events... #moneyinthebank💰 First Name Last Name Email Send *By signing up you give Badfins permission to email you the latest happenings as well as AMAZING discount opportunities. Welcome to the family! Wyndham Grand Beach Resort 215 S. Gulfview Blvd. Clearwater, Florida 33767 - 727-474-5591 (Text Only) Facebook-f Instagram Twitter Useful Links Order Now Clearwater Beach Brewery Book an Event at Clearwater Restaurants Join Our Team at Restaurant in Clearwater FL Contact Us Restaurants on the Beach in Clearwater Read Our Blog of Restaurant at Clearwater Privacy Policy Terms & Conditions Book your next special event with us. Text us at 727-474-5591 for more information or click button below to fill out our event form. Mon - Thur - 11:30am - *BOB Fri - Sat - 11:30am - *BOB Sun - 11:30am - *BOB *Based on Business EVENT FORM Copyright © 2021 Badfins Clw Beach , LLC. All rights reserved. Powered by Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Location 215 S. Gulfview Boulevard Clearwater, Florida 33767 Phone 727-474-5591 info@badfins.com Hours Mon - Thur - 11:30am - *BOB Fri - Sat - 11:30am - *BOB Sun - 11:30am - *BOB *Based on Business Copyright © 2021 Badfins Clw Beach , LLC. All rights reserved. Optimized by Seraphinite Accelerator Turns on site high speed to be attractive for people and search engines."
    },
    {
      "url": "https://badfins.com/food-categories/for-kids/",
      "text": "For Kids Archives | Badfins Food + Brew Skip to content Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Food Categories: For Kids Skinny Fries – $2 Thin and crispy fries Hot Dog – $10 100% Beef Hot Dog, grilled bun, and served with a fresh fruit cup (upgrade to skinny fries +$2) Mini Cheese Quesadillas – $10 Mexican cheese blend, grilled flour tortillas, fresh fruit cup (upgrade to skinny fries +$2). Kraft Mac & Cheese – $10 Kraft Mac and cheese with no artificial flavors, preservatives or dyes and served with a fresh fruit cup. (upgrade to skinny fries +$2) Search Search Recent Posts QR Menu Ordering Is Now Available at Badfins Everything About Our Awesome Restaurants Rewards Program The Local Favorite Seafood Restaurant at Clearwater Beach Badfins – The Best Beachfront Bar in Clearwater Beach Welcome to Clearwater, Florida : The Land of Fun and Food Recent Comments No comments to show. Become a \"Badfins\" Reward Member Earn 1-point for every dollar spent & $3 cashback! Oh, and be sure to stay on the lookout for double & triple point events... #moneyinthebank💰 First Name Last Name Email Send *By signing up you give Badfins permission to email you the latest happenings as well as AMAZING discount opportunities. Welcome to the family! Wyndham Grand Beach Resort 215 S. Gulfview Blvd. Clearwater, Florida 33767 - 727-474-5591 (Text Only) Facebook-f Instagram Twitter Useful Links Order Now Clearwater Beach Brewery Book an Event at Clearwater Restaurants Join Our Team at Restaurant in Clearwater FL Contact Us Restaurants on the Beach in Clearwater Read Our Blog of Restaurant at Clearwater Privacy Policy Terms & Conditions Book your next special event with us. Text us at 727-474-5591 for more information or click button below to fill out our event form. Mon - Thur - 11:30am - *BOB Fri - Sat - 11:30am - *BOB Sun - 11:30am - *BOB *Based on Business EVENT FORM Copyright © 2021 Badfins Clw Beach , LLC. All rights reserved. Powered by Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Location 215 S. Gulfview Boulevard Clearwater, Florida 33767 Phone 727-474-5591 info@badfins.com Hours Mon - Thur - 11:30am - *BOB Fri - Sat - 11:30am - *BOB Sun - 11:30am - *BOB *Based on Business Copyright © 2021 Badfins Clw Beach , LLC. All rights reserved."
    },
    {
      "url": "https://badfins.com/blog/badfins-wins-the-tripadvisor-2021-travelers-choice-award/",
      "text": "Badfins Tripadvisor 2021 Travelers’ Choice Award Skip to content Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Badfins Wins The Tripadvisor 2021 Travelers’ Choice Award Badfins Restaurant Clearwater Beach » Badfins Wins The Tripadvisor 2021 Travelers’ Choice Award SHARE Welcome to Clearwater, Florida : The Land of Fun and Food Next 2020 was the most challenging year for people who love to travel or hang out with friends. So much so that we stopped hearing “TGIF”. However, one thing that remained constant is people’s love for our brand, Badfins. We are overwhelmed and super excited to be The Tripadvisor 2021 Travelers’ Choice Award Winner. We promise to keep loving you back and continue offering the best food and ambience at Clearwater . So, what makes Badfins special? In a world full of complexities, we just keep it simple.  You love to drink; we love throwing happy hours on weekdays. You love to eat; we love giving you the best seafood, Mexican inspired fare, fresh salads and much more. Yep, we consider ourselves foodies and look forward to sharing delicious bites with you! You love beachside views; we give you one of the best scenic views of Clearwater beach. Oh yes, there is live music on Pint Nights as well. What is Pint Night? It’s one of our best happy hour specials where you can get 50% off all 34 draft beers. Yes you read that right! That is the best happy hour special on Clearwater Beach. We aren’t bragging, but your love makes us one of the best restaurants on Clearwater Beach. BadFins Restaurant Reviews Appreciations and gratitude The 2021 Tripadvisor Traveler’s Choice Award is definitely a huge accolade; it’s unique, but awards are not new. Badfins received a nomination in the 2020 Best of the Bay Award . We are also the top rank holder among Mexican and seafood restaurants on Clearwater Beach . And how can we forget winning Yelp’s Buzzie Award? However, do you know what makes us tick? It’s your love and appreciation. Savor these words: The atmosphere was everything! Hard to not eat there every day! Amazing place on the beach! Excellent Tacos and Beer Lineup Best meal on Clearwater Beach Great food, great service! Aren’t these perfect citations for the Travelers’ Choice Award Winner ? The above lines are just a glimpse into hundreds of fantastic Tripadvisor Reviews for Badfins Food + Brew. Each and every word of these reviews are priceless for us. As Spidey says, “with greater love comes great responsibility”. We promise to give you a lot of reasons to eat extraordinarily delicious food, choose from an excellent collection of beers and wines and have the time of your life. 34 Local Beers on Tap & Handcrafted Cocktails When you start drinking, there should be no reason to stop. We have the largest selection of beers on Clearwater Beach. While we are a restaurant we have also become known as Clearwater Beach’s Brewery. We don’t brew beers onsite but we do partner with the top local breweries in and around Clearwater. BadFins Beer Menu If you prefer fantastic cocktails, then we have that covered too! We feature an awesome list of handcrafted cocktails, something for everybody. BadFins Cocktail Menu LIVE MUSIC Not only are we known for our great food and drinks but our live music is hard to beat. We feature many of the area’s top local artists such as Cutty Jones.  Doesn’t matter if you are with family, friends, on a date or simply alone. You get the best options and exciting offers. BadFins Live Music Review Food quality and variety Looking at Tripadvisor Reviews for Badfins Food + Brew, one thing is pretty clear – people love our delicious food. With changing times, we have added that extra layer of security and ease. You can order food by simply scanning the QR code on the menu. Guess what, you don’t need to download any app; scan the menu with your phone camera, and it will take you to the Badfins website, tap what you want, and that’s all. The best advantage of going to a beach restaurant is the fresh seafood, which is incredibly tasty and hard to resist. We are known for American and Mexican casual eating – fish, fries, rice bowl, nuggets and much more. The handcrafted gourmet street tacos are a must-try. However, they are only available on Wednesdays. Our food menu caters to all; we not only offer everyone’s favorite wings, but we are also vegetarian-friendly. When you are with your family, you think twice before eating out in these harsh times. However, don’t worry; we take every precaution and follow food safety protocols. Our Kids Menu is specially created keeping your little ones in mind. Never hesitate to have a relaxing family night on Clearwater beach. Excellent ambience and fantastic view It is located right next to the Clearwater Grand and across from the beautiful beach. The close proximity to the pier makes the location of the restaurant unbeatable. In a word, the atmosphere is “Fun.” We make sure you get the best comfort while you are at Badfins; not just tasty cocktails and delicious food, but you also get free WiFi, television, takeout, table service and event booking. Our wonderful and friendly staff knows how to treat guests well. We shout out loud and keep giving you regular updates on social media, our Insta handle being eatbadfins Badfins Reward Program The reward and loyalty programs are not always made for customers; they are usually a gimmick. You don’t get enough points; you cannot redeem the stuff you want. So why go for them at all? Well, it’s different at Badfins; the reward program here is unique. You eat your favorite food and drink your favorite beer, and get points, on days even double or triple reward points. Which means you earn the points super quick. We don’t stop or limit the redemption of reward points. You can use them for any item on the menu and get them absolutely free. Finally… If you want to wrap up a good beach day with a brew or hand crafted cocktail along with some fantastic local foods, your search stops at Badfins Food + Brew, one of the best restaurants and bars on Clearwater beach. The delicious seafood, the perfect blend of brew, local music, refreshing beach views, the sound of waves hitting the shores – what more do you want from life? See you soon at Badfins. Become a \"Badfins\" Reward Member Earn 1-point for every dollar spent & $3 cashback! Oh, and be sure to stay on the lookout for double & triple point events... #moneyinthebank💰 First Name Last Name Email Send *By signing up you give Badfins permission to email you the latest happenings as well as AMAZING discount opportunities. Welcome to the family! Wyndham Grand Beach Resort 215 S. Gulfview Blvd. Clearwater, Florida 33767 - 727-474-5591 (Text Only) Facebook-f Instagram Twitter Useful Links Order Now Clearwater Beach Brewery Book an Event at Clearwater Restaurants Join Our Team at Restaurant in Clearwater FL Contact Us Restaurants on the Beach in Clearwater Read Our Blog of Restaurant at Clearwater Privacy Policy Terms & Conditions Book your next special event with us. Text us at 727-474-5591 for more information or click button below to fill out our event form. Mon - Thur - 11:30am - *BOB Fri - Sat - 11:30am - *BOB Sun - 11:30am - *BOB *Based on Business EVENT FORM Copyright © 2021 Badfins Clw Beach , LLC. All rights reserved. Powered by Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Location 215 S. Gulfview Boulevard Clearwater, Florida 33767 Phone 727-474-5591 info@badfins.com Hours Mon - Thur - 11:30am - *BOB Fri - Sat - 11:30am - *BOB Sun - 11:30am - *BOB *Based on Business Copyright © 2021 Badfins Clw Beach , LLC. All rights reserved. Optimized by Seraphinite Accelerator Turns on site high speed to be attractive for people and search engines."
    },
    {
      "url": "https://www.forbes.com/sites/meimeifox/2019/06/07/7-entrepreneurs-shaking-up-the-food-industry/",
      "text": "7 Entrepreneurs Shaking Up The Food Industry Newsletters Games Share a News Tip Featured Featured America's Top Next-Gen Wealth Advisors | Paid Program Student Visionaries: Celebrating Teen Leaders Raising Money To End Blood Cancers | Paid Program Best-In-State Top Next-Gen Wealth Advisors 2025 Breaking News White House Watch Daily Cover Stories AI’s Nuanced Impact And A Quest To Quantify It DNA of Success Embracing And Bracing For AI Facing A Volatile Market, C-Suites Look To The CFO For Strategic Guidance Your Four-Part Blueprint To Unlock AI Value In 2025 | Paid Program By The Numbers: Meet The Forbes 30 Under 30 Europe Class Of 2025 Dell Technologies BrandVoice | Paid Program Scaling AI Get Your Data AI-Ready | Paid Program QUIZ: Are You Making The Most Of Your Retirement Plan? | Paid Program Shaping The Future-Ready Mobility: In Conversation With JLR And TCS | Paid Program The Pacesetter Playbook: An Executive’s Guide To  Advancing Enterprise AI | Paid Program Next Billion-Dollar Startups 2025 CXO Spotlight: The Executive's Guide to AI Video Series Billionaires Billionaires See All World's Billionaires Forbes 400 America's Richest Self-Made Women China's Richest India's Richest Indonesia's Richest Korea's Richest Thailand's Richest Japan's Richest Australia's Richest Taiwan's Richest Singapore's Richest Philippines' Richest Hong Kong's Richest Malaysia's Richest Money & Politics Innovation Innovation See All Workflow Collaboration Enterprise AI AI Agentic AI Big Data Cloud Cloud 100 Consumer Tech Creator Economy Cybersecurity Digital Transformation Enterprise Tech Future Of Work Gaming Healthcare Innovation Rules Retail Industry SAP BrandVoice | Paid Program Science Social Media Sustainability & Climate Transportation Venture Capital Technology TikTok BrandVoice | Paid Program Metronome BrandVoice | Paid Program Leadership Leadership See All Under 30 C-Suite CEO Network CFO Network CHRO Network CIO Network CMO Network Leadership Strategies Careers Education Featured Partners Deloitte BrandVoice SAP BrandVoice Stand Together BrandVoice First Tee BrandVoice Dell Technologies BrandVoice Forbes EQ | Paid Program ForbesBLK Forbes Research ForbesWomen Money Money See All Banking & Insurance ETFs & Mutual Funds Fintech Hedge Funds & Private Equity Investing Investor Hub Markets Personal Finance Retirement Taxes Top Advisor | SHOOK Wealth Management Forbes Digital Assets Forbes Digital Assets See All News Crypto Prices NFT Prices Research Learn Crypto Basics BTC DeFi Web3 Education NFTs Crypto Investments Events Crypto Portfolios Business Business See All Aerospace & Defense Energy Food & Drink Hollywood & Entertainment Law Manufacturing Media Policy Retail SportsMoney Entertainment Digest Small Business Small Business See All Entrepreneurs Franchises Small Business Strategy Lifestyle Lifestyle See All Arts Boats & Planes Cars & Bikes Dining ForbesLife Forbes Travel Guide Spirits Style & Beauty Travel Vices Watches Real Estate Real Estate See All Commercial Real Estate Forbes Global Properties Residential Real Estate Forbes Vetted Forbes Vetted See All Mattress & Sleep Bed Frames Mattresses Mattress Toppers Pillows Sheets & Bedding Sleep Products Home Bathroom Cleaning & Laundry Decor Furniture Heating & Cooling Hobbies Home Office Kitchen & Dining Outdoor Pets Storage & Organization Tools Wine & Bar Fashion Accessories Clothing Eyewear Footwear Jewelry Handbags & Purses Lingerie & Sleepwear Outdoor & Fitness Apparel Outerwear Watches Kids & Baby Gear Baby Gear Kids Clothes & Accessories Nursery Pregnancy & Postpartum Toys & Books Gear Apparel & Accessories Bikes Camping & Hiking Climbing Fishing & Hunting Fitness Golf Running Tennis & Racket Sports Tools & Tech Training & Recovery Water Sports Wellness Winter Sports Beauty & Grooming Haircare Makeup Nailcare Shaving Skincare Personal Products Wellness & Self Care Tech & Electronics Audio Cameras Computers, Tablets & Accessories Gaming Home Office Online Tools Smart Home Devices Smartphones, Smartwatches & Accessories Streaming TVs Travel Cruises Hotels & Lodging Luggage Travel Products Gifts Father's Day Holiday Mother's Day Valentine's Day Wedding Deals Coupons Black Friday Cyber Monday Amazon Prime Day Beauty & Grooming Big Sales Fashion Gear Home Tech & Electronics Travel Deals Mattress & Sleep Coupons Coupons See All Most Popular Macy's Zappos Vivid Seats SeatGeek Groupon DoorDash Stubhub Shutterfly Fashion H&M Nordstrom Zenni Optical Neiman Marcus Shopbop Ulta Beauty Zales Jos. A. Bank Software & VPNs NordVPN ExpressVPN Surfshark Squarespace Norton QuickBooks VistaPrint TurboTax Electronics Samsung Verizon Sonos Newegg Lenovo B&H eBay HP Sportswear & Gear adidas Nike Dick's Sporting Goods HOKA New Balance Athleta Alo Yoga RTIC Mattress & Sleep Mattress Firm Purple Mattress Bear Mattress Brooklinen Nectar Avocado Mattress Nolah Brooklyn Bedding Travel Booking.com Hotels.com Emirates Expedia Away Hilton Priceline Great Wolf Lounge Home & Garden Walmart Wayfair Edible Arrangements Instacart The Home Depot Lowe's Frontgate Total Wine View All Stores Lists Lists See All 30 Under 30 50 Over 50 Top Colleges Advisor Advisor See All Credit Cards Best Credit Cards Travel Credit Cards 0% APR Credit Cards Balance Transfer Credit Cards Business Credit Cards Best First Credit Card Mortgages & Loans Best Mortgage Lenders Mortgage Refinance Lenders Personal Loans Business Loans Bad Credit Loans Debt Consolidation Loans Debt Relief Companies Student Loans Refinance Private Student Loans Banking Best CD Rates High Yield Savings Accounts Money Market Accounts Checking Accounts Business Checking Accounts Budgeting Apps Best Online Banks Insurance Health Insurance Companies Medicare Life Insurance Companies Best Car Insurance Companies Cheapest Car Insurance Companies Pet Insurance Companies Travel Insurance Companies Homeowners Insurance Companies Business Services How to Start a Business LLC Services Payroll Services HR Software HRIS Systems PEO Services Applicant tracking Systems Domain Registrars Hosting Services Website Builders Ecomm Platforms Landing Page Builders VOIP Services Answering Services Project Management Software Task Management Software Gantt Chart Software VPNs Anti Virus Software Password Managers Home Services Moving Companies Long Distance Moving Companies Car Shipping Companies Home Warranty Companies Solar Companies Solar Panels Home Security Companies Home Security Systems Internet Providers Cheapest Internet Providers Fastest High Speed Internet Providers Pest Control Companies Education Forbes Advisor UK Forbes Advisor CA Forbes Advisor AU Health Health See All Mental Health Best Online Therapy Online Therapy that Takes Insurance Online Psychiatrists Best Online Dating Sites & Apps Best Senior Dating Sites Best LGBTQ Dating Sites CBD CBD Gummies CBD Oil CBD Creams CBD for Anxiety CBD for Pain Supplements Protein Powder Preworkout Collagen Powders Creatine Supplements CoQ10 Supplements Hearing Health Best Hearing Aids OTC Hearing Aids Affordable Hearing Aids Medical Devices Best Medical Alert Systems Best Medical Alert Systems with Fall Detection Diet & Weight Loss Best Weight Loss Plans Newsletters Newsletters See All Forbes Daily Editorial Newsletters Forbes Games Forbes Games See All Frase by Forbes Pinpoint by LinkedIn Queens by LinkedIn Crossclimb by LinkedIn More From Forbes More From Forbes Forbes Video Forbes 101 Forbes Magazine Forbes Asia Free Issue of Forbes © 2025 Forbes Media LLC. All Rights Reserved. Advertise with Forbes Forbes Licensing & Syndication Report a Security Issue Editorial Values and Standards Site Feedback Contact Us Careers at Forbes Tips Corrections Privacy Do Not Sell My Personal Information Terms AdChoices Reprints & Permissions Leadership ForbesWomen 7 Entrepreneurs Shaking Up The Food Industry By MeiMei Fox , Former Contributor. Forbes contributors publish independent expert analyses and insights. MeiMei Fox writes about aligning your career with your life purpose. Jun 07, 2019, 08:04am EDT Share Save This article is more than 6 years old. More than $1 billion was invested in food industry startups in 2016. This is hardly surprising when you realize that food sales in the U.S. total over $2 trillion . Within this immense category, consumers are increasingly interested in healthy foods that are local, organic, and minimally processed, companies that have a social and/or environmental mission, and any unique, specialty items. Capitalizing on these trends, here are 7 entrepreneurs who are shaking and spicing things up in the world of food. Jordan Karcher is the founder and CEO of Grounds and Hounds Coffee. Grounds and Hounds Jordan Karcher, founder and CEO of Grounds & Hounds Coffee Jordan Karcher is the 32-year-old founder and CEO of Grounds & Hounds Coffee, a company that believes great coffee can fuel an even greater purpose. Through the sale of their organic and fair-trade specialty coffees, they support dog rescue initiatives and organizations, dedicating 20% of all profits to making their “second-chance for pups” mission a reality. Karcher has had a passion for helping animals for as long as he can remember. As a child, he aspired to become a veterinarian. Then, while attending business school in 2013, he saw the value of building a business in the social impact space. “I decided that I would like my efforts at work to address issues that connect with me personally,” he says. Raising capital for a socially-conscious business has proved challenging, however. When Karcher first began meeting with potential funders, he learned that most institutional investors have a narrow interest in social impact due to the traditional emphasis on maximizing return. So he bootstrapped and refocused Grounds & Hounds to emphasize positive cash flow through e-commerce in order to fund growth, which attracted private equity in 2018. This strategy worked. The company currently is celebrating its fifth anniversary, having grown revenue by 300%. To aspiring entrepreneurs, Karcher offers this advice. “ While it is important to always follow your passion, remember that your product and the customer experience must meet or exceed that of industry competitors. People love to purchase brands they connect with emotionally and align with socially, but they will return to your competitors if the product and experience don't match their category expectations. Exist to do good, but compete as if your product and experience are all that matter.” Leah Goldglantz is the founder of Leah's Plate. Leah's Plate Leah Goldglantz, founder of Leah’s Plate Leah Goldglantz is the 32-year-old founder of Leah’s Plate, a health and wellness blog. Her goal is to inspire people to live a healthier lifestyle by educating them on which products are truly healthy, as well as providing recipes made using clean ingredients. Since we’re all short on time, Leah’s Plate recipes require minimal healthy ingredients and are quick and easy to make. Goldglantz offers baby and toddler recipes since she has two little ones at home, and also sometimes recommends non-toxic health, beauty, and home products. The first year she started Leah’s Plate, Goldglantz was happy simply to receive free products in exchange for coverage on her blog and Instagram. By the second year, she was thrilled to have a handful of sponsored posts and to be making a little money doing something she is passionate about. By the third year, Leah's Plate had gained over 100,000 followers on Instagram and was averaging $10,000 per month in revenue from brand partnerships and affiliate marketing. And it’s still growing. Before starting Leah's Plate, Goldglantz was at a low point in life. She wasn't eating well and her main focus was going to nightclubs. She made a commitment to make a big lifestyle change. Not believing in fad diets, she chose to nourish her body with wholesome foods. “Almost immediately, I felt lighter and my brain fog cleared,” she says. “I was more active and sleeping better than ever.” Now, her goal is to help others feel as good as she does. “If you do what you love, you'll never work a day in your life,” Goldglantz says to aspiring entrepreneurs. “It takes a ton of hard work and time to build a company, but never give up and always be genuine and authentic. Stay true to yourself and your goals. Don't try to cut corners or take shortcuts, because it never works to your advantage.” Daniel Zakowski is the founder and CEO of Ready, Set, Food! Ready Set Food Daniel Zakowski , founder and CEO of Ready, Set, Food! While food allergies are a significant and growing problem, research indicates that up to  80% of them can be prevented through the early and frequent introduction of allergenic foods to infants. That means that just by following the new American Association of Pediatrics guidelines for early allergen introduction, we can help prevent approximately 200,000 infants every year from developing life-threatening food allergies. Ready, Set, Food! was designed to make this process easy and affordable by providing parents with a pre-measured, all-natural supplement that dissolves easily in breastmilk, formula, or food. Using the same process proven effective in three clinical trials, it gradually exposes infants to peanuts, egg, and milk – the foods that cause 80% of all allergies. Over 300 pediatricians and allergists promote the product in their practice. Ready, Set, Food! founder and CEO Daniel Zakowski was inspired to find an effective way to help kids when his nephew Abe began suffering from severe allergies to peanuts, eggs, and milk at the age of seven months. Last year, Abe accidentally ate a bite of pizza and found himself struggling to breathe. He had to have a dose of EpiPen. Because any activity that involves food could be a danger to him, Abe has to be watched at all times. When he realized that Abe’s food allergies could likely have been prevented, Zakowski knew he had to act. This is the second company Zakowski has founded. His first company sold consumable products, including latex gloves, to dentists. Although it reached a peak revenue of $10M, it went out of business in the aftermath of the 2008 recession. “It was a difficult time,” Zakowski says. “I dealt with it in the short term by focusing on family, my new marriage, and community service in the political realm.” But when he discovered the opportunity to build a great business and also help prevent 80% of childhood food allergies, Zakowski felt compelled to dive in and overcome his prior “failure.” “We all have a difference we can make in the world, whether or not our job is the primary way we make that difference,” Zakowski says. “This is an important message because many people need to work to make ends meet and don't have the luxury of choosing a career that helps people. So remember, there are many ways we can and must help others.” Howard and Dana Bloom are the cofounders of Proper Food. Proper Food Dana and Howard Bloom, cofounders of Proper Food Dana and Howard Bloom are the cofounders of Proper Food, a high-quality grab-and-go food company launched in 2013, which currently has 12 locations between San Francisco and NYC. Proper Food aims to eliminate the dilemma between eating well and eating fast. All items are prepared from scratch each morning by a team led by Chef Munoz, who hails from a Michelin-starred kitchen. The food consists of locally-sourced ingredients such as wild fresh octopus, kale, steaks, burritos, fresh juices, and more. The husband and wife team are passionate about food and even more passionate about people. They were driven to create Proper Food to fill a need. “While working in downtown San Francisco, we found ourselves either waiting in line a half-hour for lunch or getting something unhealthy and unsatisfying.” But they also were driven by a greater life purpose, which is to have a positive impact on the lives of others. Proper Food not only makes high-quality food more accessible, but also ensures carefully sourced ingredients, treats its team well, and gives back to its communities. To date, the company has donated over 300,000 unsold meals to help feed the hungry. The biggest hardship they have faced together was the loss of Howard’s father, Michael Bloom, in 2009, just six months before the couple’s son was born. “Michael has been a major inspiration for the Proper Food philosophy. He was growing his own vegetables and cooking local, seasonal and organic before those were buzz words,” the Blooms say. The founders have this advice for people struggling to figure out their life purpose. “It takes focus and intention to listen to your heart and figure out what makes you thrive. Once you’ve figured out that part, it’s simply having the courage to take. The more you align your career with your purpose, the more energized you will feel and you’ll be amazed at how things just start to fall into place.” Steven J. Singer is the founder and CEO of Fody Food Co. Fody Food Co. Steven J. Singer, founder and CEO of Fody Food Co. In 1999, while in his 20s, Steven J. Singer founded Glutino, a company that made gluten-free food before the gluten-free movement went mainstream. He helped to grow the company from a startup to sales exceeding $50 million. Through this work, he saw the transformational outcomes the products had for people with Celiac disease. This led Singer to found Fody, the leading low FODMAP food company, which sells snacks, sauces, salsas, oils and seasonings. Consuming low FODMAP foods helps the 45 million Americans suffering from IBS to enjoy eating again. Since launching in 2016, Fody has brought the low FODMAP diet to the U.S. and been picked up by Whole Foods, Sprouts, Wegmans, and more retailers nationwide. Helping people improve their lives through specialty food products is Singer’s life purpose. “When I discovered that 75% of people suffering from IBS could find complete symptom-relief with a low FODMAP diet, I knew I had a responsibility to help,” he says. “Fody exists to help people live life to the fullest by participating in life’s greatest and simplest pleasures –  such as sharing a meal with friends.” The biggest challenge Singer has faced with Fody is getting retail buyers to move beyond their initial disbelief that a pasta sauce, marinade, ketchup without onion or garlic, or even a dairy-free Caesar salad dressing will actually taste great. “Products like ours are counterintuitive to what many buyers are used to. We overcome that when they try our products and realize we're on to something,” he says. To those looking to align their career with their life purpose, Singer says, “Don’t be afraid to enter uncharted territory. If there’s a need that’s not being met, it may mean that it’s just waiting for you to come along and blaze the trail.” Samantha Tannor is the founder of Tannor's Tea. Samantha Tannor Samantha Tannor, founder of Tannor’s Tea Tannor’s Tea creates sugar-free matcha concentrates. The company mission is to develop products that make you feel good from the inside out by focusing on pure, plant-based ingredients. Founder Samantha Tannor is an MBA student at Berkeley-Haas School of Business who comes from a background working in the food industry. She started Tannor’s Tea after traveling to Asia and discovering how popular matcha is there. She then found out that every single liquid matcha concentrate sold in the U.S. is loaded with sugar. So she decided to bring sugar-free versions to the market. As part of Berkeley's LAUNCH, a startup accelerator, she is selling Tannor’s Tea online on Amazon and in cafés around Berkeley. One hardship Tannor has faced is figuring out how to build a business without having any prior experience running a company. “I have questioned whether or not I possess the skills necessary to become an entrepreneur,” she says. “In order to combat these feelings of anxiety, I surround myself with a support system of family and friends who believe in me and genuinely wish for my success. Calling on these people has been my saving grace.” To others looking to align career and life purpose, Tannor recommends being honest with yourself. She says, “When people decide not to pursue their passions based on fear, they are doing themselves a disservice. Spend time focusing on what makes you feel inspired. By being honest with what you are truly passionate about, you will be closer to feeling fulfilled in your career.” David Sedeno is the founder of Pono Wines. Fernando Herzer David Sedeno, founder of Pono Wines David Sedeno recently left a three-decade-long career in the California Fire Service to found Pono Wines, the first Napa boutique wine from a Native Hawaiian. Born and raised in Honolulu, Sedeno wanted to create a wine in order to offer people “a taste of aloha” in every glass. Current vintages include the 2015 Mana Cabernet Sauvignon and Hapa Red Blend, and the 2017 Hoku White. \"In Hawaii, we are raised to 'live Pono' by making conscious decisions to do the right thing in terms of self, others, and the environment,” Sedeno explains. “My family instilled this mindset in me, along with the idea that seeking Pono brings an appreciation for how life can be both simple and complex. I created Pono Wines not only to exemplify the richness that exists within this dichotomy but to also invite others to experience what it means to ‘live Pono.’” One hardship Sedeno faced when starting Pono Wines was self-doubt, as the wine industry was a complete change from his day job as a firefighter. To overcome this, he applied a lesson learned during his 35 years in the fire service: If your fundamentals are sound, things should work out in your favor – as long as you don’t quit. To create Pono Wines, he wakes up every day ready to put in the hours, reach out to as many people as possible, and trust that their enjoyment of Pono will build the brand. Editorial Standards Reprints & Permissions LOADING VIDEO PLAYER... FORBES’ FEATURED Video © 2025 Forbes Media LLC. All Rights Reserved. AdChoices Privacy Statement Your Privacy Choices Cookie Preferences Digital Terms of Sale Terms of Service Contact Us Send Us Feedback Report a Security Issue Jobs At Forbes Reprints & Permissions Forbes Press Room Advertise"
    },
    {
      "url": "https://thestrangebrew.co.uk/what-about-us/",
      "text": "- What About Us? - The Strange Brew Skip to content The Strange Brew Rock music from the mid 60s onwards – podcasts, features and much more Primary Menu Podcasts Articles – Interviews Al Jardine: “I was a graduate student of the Brian Wilson school of music” Before the Super Freak: The Untold Origins of Rick James The Beat Returns: Chris Bostock on JoBoxers’ Legacy Restored King Crimson’s Jakko Jakszyk: An Extraordinary Journey of Adoption, Fame, and Finding Himself Alan Parsons: Pyramid and Beyond From Tom Jones to AC/DC: Chris Slade’s Timeline Albert Hammond: A Lifetime Of Hits And A New Body Of Work Gerry Beckley on America’s timeless appeal Robin Trower on Bridge Of Sighs Procession Ian Hunter Remains Defiant Michelle Phillips – The Mamas & The Papas Peter Rechter – Tol-Puddle Martyrs Dion “Songs Go Into Your Soul” Jenny Boyd on Icons of Rock Annie Haslam on John Wetton and Renaissance Tom Paxton and John McCutcheon Clem Burke’s Lust For Life Del Bromham – Stray John Lodge on Days Of Future Passed Kiki Dee’s Forward Motion Brian Protheroe – A Salisbury Boy Judy Collins Henry Diltz on Crosby, Stills, Nash and Young Nick Banks – Pulp Peter James Williams – The Groove Terry Fox – Cops n Robbers Geoff Bridgford: Beyond the Bee Gees Nick Drake: The Darkness Can Give The Brightest Light Nick Drake: The Way To Five Leaves Left Crafting Melodies with Jeff Christie and Lorenzo Gabanizza Judy Hauff – Rotary Connection Steve Howe: From Tomorrow to YES’s Mirror To The Sky Al Kooper: “Hey, What Are You Doing Out There?” Martin Fry – ABC on The Lexicon of Love Stan Endersby Interview – Part 1 Stan Endersby Interview – Part 2 Allan Clarke Peter Daltrey on Running Through Chelsea Bernie Marsden Andy Fairweather Low Rick Buckler on The Jam 1982 Mikael Rickfors – The Hollies Sam Brown Trevor Horn – 10 of his most important songs Fortes Mentum Mike McCartney’s Early Liverpool Geoff Emerick Life featuring Neil Sheppard and Marty Simon Tim Booth – Dr Strangely Strange Focal Point – First Bite of the Apple David Wiffen Michael Gelardi – Misty David Marks – The Lost Beach Boy Alison O’Donnell Allan Clarke – Would You Believe? Rogers & Butler – Brighter Day Glenn Cardier Woody Woodmansey on David Bowie Phill Brown – Still Rolling Dave McLean – The Chemistry Set Tim Bowness on Butterfly Mind Sean Kelly – A Fragile Tomorrow Pete Brown Cat Stevens and Zeus Andy Bown – Status Quo Fritz Michel Alan Lee Shaw – Damned If You Do Brian Willoughby The Analogues on Let It Be: Abbey Road Bill Bruford is Making a Song and Dance Andy Curran – Envy Of None Mordecai Smyth Rick Wakeman The John Carter Story Deborah Bonham Davey Johnstone – Deeper Than My Roots Ian Anderson on The Zealot Gene Hedgehoppers Anonymous – 1 Hedgehoppers Anonymous – 2 Peter Daltrey – Kaleidoscope and Fairfield Parlour John Altman Alan Parsons Icarus Peel and Crystal Jacqueline Medicine Head – Still On The Road Eddie Berman Avi Wisnia John Williams – The John Williams Syndicate James Warren – The Korgis Kartoon World Linen Ray Barry Ryan Interview Hamish Hawk Rob Gould plays Pawn Hearts Stuart Mackay – Tintern Abbey Healthy Junkies Dean Friedman’s American Lullaby Lyle Workman Quinn Sullivan How To Be A Rock Star Johnny Warman Kris Needs Peter Donegan PINHDAR Robert Berry Tar & Flowers Nick Garrie Marty Willson-Piper on MOAT Mog Jones Mike Eastman – Katch 22 Paul Brett – Stone Survivor Joe Wong Sunbirds The Anchoress Andy Watts – The Guitar Slinger Apollo Junction Kim Logan The Lickerish Quartet The Chemistry Set Raul Malo – The Mavericks Life of Stanley The Questionnaires Big Star: Winter 1970-1971 The Valkeries Anton Barbeau on Manbird Barry St John Poets & Sinners – Rogers & Butler – The John Howard interview The Road Is Long: The Hollies Story John D Bryant John Fryer Paul Meagher – The Newds Tim and Lee Friese-Greene – Short-Haired Domestic Roger Houdaille – Ex Norwegian Victor DeLorenzo Philip Rambow – The Rebel Kind Gyasi Emily Duff – Born on the Ground Chris Joe Beard – The Purple Gang Keith Christmas Greg Healey – The Lounge Bar Orchestra Roy Ayers Clive Gregson Neil Arthur – Blancmange The Outlaw Rock and Roll Photographer Joss Cope Tony Banks opens the Banks Vaults Steve Howe – Yes The Crowbars ‘The Lost 1977 Tapes’ Consortium – Ken Brown Tav Falco The Blackheart Orchestra on Mesmeranto Paul Mosley – You’re Going To Die! Hanford Flyover Curvey’s Custard Flux DD Allen Terry Rae – Hollywood Stars Paul Roland goes to 1313 Mocking Bird Lane Dreamers Wake: Looking Back at the 17th Dream of Dr Sardonicus Nathan Hall presents Scattersparks Gareth Koch Pete Bingham – Sendelica Can’t Give It Away on Seventh Avenue: The Rolling Stones and New York City Doug Seegers – From Homelessness to Overnight Sensation The Warren Davis Monday Band – part 1 The Warren Davis Monday Band – part 2 The Warren Davis Monday Band – part 3 Samantha Preis Steve Thompson’s The Long Fade – an album 50 years in the making Elfin Bow Stacey Randol Steve Popovich Jr – Cleveland Records The Analogues Bring The White Album To Life David Frangioni Corduroy – Return of The Fabric Four Mark Nevin – Strike Up The Sally Ann Cries and Whispers – Anthony Reynolds Gordon Giltrap – The Last of England James Warren – The Korgis Spectator Tony Visconti – David Bowie and Holy Holy Chris Pope – The Chords John Dunsterville – Rainbow Ffolly Barney J Barnes and The Intro John Sloman The Mojos Bill Donati Kingdom of Reptiles The Spitfires – Billy Sullivan Stone Foundation – Neil Sheasby Colin Devlin Jessica Lee Morgan on Mary Hopkin The Kool John Butler – The Loyal Serpent Graci Phillips Steve Thompson Maddy Prior Jim McCarty – Walking in the Wild Land Mark McDowell Markku Helin – Permanent Clear Light Paul Evans – Magic Bus Ian Short – The Elms Estate Paul Mex – Soundtrack Reflections Dave Miller – The Australian-New Zealand 60s scene Keeping the flavour – Andy Wickett Tyler Warren – Queen Extravaganza Karla Kane Natalie Shay Peter Howell and John Ferdinando Wally Waller – The Pretty Things Rock St Trop Martin Newell’s Jumble Sale Nathan Hall – Effigies David Gedge – Sometimes these words just don’t have to be said 62 Miles From Space CousteauX – Davey Ray Moor Interview The Dials – That Was The Future Toby Twirl Bruce Sudano Interview Stephen Emmer – Interview The Hummingbirds are Moving On Mark Nevin – My Unfashionable Opinion The Hives – Howlin’ Pelle The Krew – Part 1 The Krew – Part 2 DJ Ashba – Sixx:A.M. – The Magic Behind The Songs The Bobby Patrick Big Six Tony Prince – The Royal Ruler July – Resurrection Bob Jackson – Badfinger Edward Rogers Gilbert O’Sullivan Ken Scott – Abbey Road to Ziggy Stardust Rod Argent – And We Were Young Again Tony Klinger Mike McGear McCartney Al Stewart – Past, Present and Future Annie Haslam – Renaissance Billy Terrell Malcolm Tomlinson Obituary The Loose Ends The Tridents Colin Blunstone – Still Got That Hunger Ian Gomm – Brinsley Schwarz Mike Pender – Origins of the Searchers and The Search for Myself The Krewcats 1964-65 The Krewkats 1962-1964 Dennis Dunaway of The Alice Cooper Group Mark Wirtz Mike Piggott Steve Ellis – Time Hasn’t Changed Us The Army Hang Loose With The Surfin’ Lungs Pig Rider David Wiffen Davy O’List – Second Thoughts Jeff Christie – For All Mankind Mark Nevin: Love = Love = Love Ray Thomas – The Moody Blues The Fleur de Lys – Keith Guster Martin Newell – Welcome To Bohemia The London Beats The Movements The Way of Life Thomas McConnell Geno Washington & The Ram Jam Band 1965-1967 Hamilton and The Hamilton Movement 1965-1966 Roger Deering – SMASH Fashion Carl Douglas – Stampeding the Mod Scene – Part 1 Carl Douglas – Stampeding the Mod Scene – Part 2 Carl Douglas – Stampeding the Mod Scene – Part 3 Allan Crockford – From The Prisoners to The Galileo 7 Carl Douglas – Stampeding the Mod Scene – Part 4 Chris Devotion and The Expectations Break Out George Young, Harry Vanda and George Alexander Tír na nÓg – Looking Up Dodson and Fogg – Chris Wade Rolling with Michael Des Barres Joey Molland – From Liverpool to Memphis Say Yes to Schnauser Tony Durant and Fuchsia Andy Ellison – A Strange Affair The Pretty Things Beautify Junkyards Simon K & The Meantimers The Fantoms The Second Thoughts Patrick Campbell-Lyons – Nirvana The Sassenachs Wainwright’s Gentlemen The Tribe Andy Morten – Bronco Bullfrog The Ealing Club The Ways and Means Kontiki Suite – The North West Coast Sound Nathan Hall – Soft Hearted Scientists Andy Keiller – A voice of Influence David Wiffen French Boutik The Electric Stars – Sonic Candy Soul nick nicely Tony Hazzard – From the Heart to the Heart Mark Nevin The All Night Workers – part 1 The All Night Workers – part 2 The All Night Workers – part 3 The All Night Workers – part 4 The All Night Workers – part 5 The Summer Set – Part 1 The Summer Set – part 2 Down In LA – The Brewer and Shipley interview – part 1 Down In LA – The Brewer and Shipley interview – part 2 Jim Peterman and The Steve Miller Band – Part 1 Jim Peterman and The Steve Miller Band – Part 2 The Mind Garage – “A Total Electric Happening” Dave Slater – Focal Point, Apple and The Beatles – Part 1 Dave Slater – Focal Point, Apple and The Beatles – Part 2 Chris Spedding and King Mob Jo Jo Gunne The Dimentions McKenna Mendelson Mainline Tom Hartman of The Aerovons – World of You Denny Alexander – The Clayton Squares and The Penny Peeps Milkwood – Part 1 Milkwood – Part 2 Virgin Sleep Influence – Part 1 Influence – Part 2 Alan Avon and The Toyshop Sidewalk Society Beau – There Once Was A Time – Part 1 Beau – There Once Was A Time – Part 2 July – Magical Days – Part 1 July – Magical Days – Part 2 Jeff Christie and the Outer Limits Jeff Christie – Christie and Beyond The Dawnbreakers Amazing Friendly Apple Mark Alan Lofgren – The Past Perfect Games For May – Fruits de Mer and Mega Dodo Records – Live Curvey – The Luck of Eden Hall The Dirty Dancing Soundtrack: the inside story from its hitmaking songwriters Trevor Drury Icarus Peel About – Contact Us Light/Dark Button Search for: Podcasts Home News What About Us? News What About Us? thestrangebrew October 28, 2012 Jason Barnard speaks to the author of “What About Us?”, Bruce Welsh, an excellent new rocklopedia of Britain’s other recording groups 1962-1966. Bruce picks some of his favourite tracks from almost 1700 singles he researched from the essential period of British beat. Bruce Welsh and Jason Barnard The Redcaps – Talkin Bout You (Single A-side, Decca, 1963) The Blue Rondos – Little Baby (Single A-side, Pye, 1964) Brett Young & The Ghost Squad – You Can’t Fool Me (Single B-side to Never Again, Pye, 1964) Nix-Nomads – She’ll Be Sweeter Than You (Single B-side to You’re Nobody ‘Til Somebody Loves You, HMV, 1964) Jean and The Statesides – Putty In Your Hands (Single A-side, Columbia, 1964) The Beatmen – Now The Sun Has Gone (Single A-side, Pye, 1965) The Termites – Tell Me (Single A-side, Oriole, 1965) The Masterminds – She Belongs To Me (Single A-side, Immediate, 1965) The Montanas – All That Is Mine Can Be Yours (Single A-side, Piccadilly, 1965) The Pathfinders – Don’t You Believe It (Single A-side, Parlophone, 1965) Tierney’s Fugitives – Did You Want To Run Away (Single A-side, Decca, 1965) The Lancastrians – Not The Same Anymore (Single B-side to The World Keeps Going Round, Pye, 1966) The Loving Kind – Ain’t That Peculiar (Single A-side, Piccadilly, 1966) Thane Russal & Three – Security (Single A-side, CBS, 1966) St. Louis Union – East Side Story (Single A-side, Decca, 1966) The Sands of Time – Where Did We Go Wrong (Single A-side, Pye, 1966) Hear Bruce’s insight into the British recording groups, trios and duos that helped to shape the sounds of the sixties. Although the vast majority of these bands never set foot on North American shores, they were very much a part of what came to be known as The British Invasion. Hear selected tracks and stories from the 930 British recording groups, trios and duos, covered in “What About Us?”, who released at least one single in the U.K. between January 1962 and December 1966 . More information on “What About Us?”, including how to get your hands on a copy, can be found at: http://whataboutusrocklopaedia.com/ http://www.facebook.com/whataboutusrocklopaedia http://media.blubrry.com/thestrangebrew/thestrangebrew.co.uk/wp-content/uploads/2012/10/whataboutus.mp3 Podcast: Play in new window | Download Subscribe: Spotify | RSS Tags: Blue Rondos British Beat St Louis Union The Beatmen The Lancastrians The Masterminds The Redcaps The Termites Post navigation Previous Previous post: DC Fontana – Pentagram Man Next Next post: The Soul Sailor – The Effects of Getting Wilder and Wilder 11 thoughts on “ What About Us? ” ron sanchez says: October 28, 2012 at 7:10 pm Nice to hear the Redcaps. Dave Walker lives up here in Montana these days. He recorded two albums with my band, Donovan’s Brain and did some other sessions I produced. I’m glad you didn’t repeat that incorrect information that suggests Jimmy Page played on their records. Dave has said in no uncertain terms that Page was never on any of their records… though he has said that JP Jones may have played bass on a track great concept for your show. Cheers RS you can check out my own radio show here http://www.careerrecords.com/reports/playlists/playlists-2012.html Tony Aldridge says: October 29, 2012 at 11:16 am The Pathfinders Spent a great couple of hours with Bruce and Jan at the Liverpool launch of his book. The podcast compliments the book beautifully. Being able to hear some of the songs rather than just reading about them is a definite plus. At the time we probably didn’t pay much attention to what groups were doing in other parts of the country – even if they were available locally. For the full Pathfinders’ story and the making of ‘Don’t You Believe It’ see the website http://www.wix.com/ruffprods/the-pathfinders-web Cheers Tony Aldridge Bill Brazier says: October 31, 2012 at 9:14 am I’ve met Bruce several times over the last year to help with the compiling of What About Us and I think he’s produced a very well written book. The presentation and style of it is excellent with lots of great old 60s photos and information. There are three of us left now, myself, Bill Moseley and Paul Mountain. It’s quite an honour to have Now The Sun Has Gone as one of Bruce’s top 16 picks. A very informative book which really captures the spirit of the era. Justin Welsh says: November 16, 2012 at 7:35 pm Great show Dad, very proud of you! Svein Haugen says: November 28, 2012 at 3:56 pm Way to go buddy. Hope you have some for sale in the store front. I want a signed copy. Start working on the next one. Paul Mountain says: December 23, 2014 at 10:19 am Bruce,it’s wonderful that you have included Now the Sun has Gone in your own hit parade as Bill Moseley the composer is,as we speak in the hospital having a triple heart by-pass. We,the Beatmen are,after more than 50 years still very close and you choosing his song will give him a much needed lift and aid his recovery. Good luck from all of us with the new book. Howard Roberts says: March 9, 2015 at 10:35 pm Fantastic. So many names I remember playing with at the California Ballroom in Dunstable, Stevenage Locarno, and the Hermitage Ballroom in Hitchin, Herts. I had a quick shufty through the index and saw my old group The Niteshades in there. Here’s one from the vaults where we did the title music for a movie called Be My Guest. Here’s the clip: https://m.youtube.com/watch?v=r6SOEWXddFw&desktop_uri=%2Fwatch%3Fv%3Dr6SOEWXddFw Three of us are still in close contact, and two of us are still doing gigs. Keith John Redworth says: July 20, 2015 at 7:21 am I wonder if you know where the Termites are now. I lost contact with Rita and Tina Layzell and would like to find them.  I wrote Everyday-Everyday and was a very good friend of theirs and the Leemen their original backing group. Rita is the God-parent for one of my children. They were really great singers and wonderful friends. Any help or advice concerning them would be brilliant, and thanks for recognising talent when you hear it….. Keith John Redworth Bruce Welsh says: July 20, 2015 at 10:09 pm Hi Keith.  Both Rita and Tina are in Norfolk now.  If you send me your email I will forward it to them.  my direct email is whataboutus@telus.net lee says: September 27, 2015 at 7:39 pm never realized the doo wop roots of tell me until i heard the termits version Billy Pitt-Jones says: November 5, 2019 at 5:28 pm Only just found this site. I want to send belated thanks to Bruce and Jason for the lovely things they said about our (The Blue Rondos) debute single. With pride I can now update the info about this disk. The flip side ‘Baby I Go For You’ was used to advertise world-wide, the launch of the Huawei SP20 Smart Phone. The A side ‘Little Baby’ is covered on The ‘Samantha Fish Band’ album ‘Chills & Fever’ and is being used on the playlist  of the current tours of both ‘Samantha Fish’ and ‘The Arcs’/Black Keys. It has been used as a soundtrack to 3 motion pictures and been covered on published recordings by at least 4 artists. Not bad for a 55 years old record. Kind Regards – Billy Blue Rondo Leave a Reply Your email address will not be published. Required fields are marked * Comment * Name Email Website Yes, add me to your mailing list Notify me of follow-up comments by email. Notify me of new posts by email. Δ Related News Black Sabbath Go Out on a High With Concert for the Ages Black Sabbath Go Out on a High With Concert for the Ages Giant Steps: How a Prog Rock Frontman Became Heavy Metal’s Kingmaker Giant Steps: How a Prog Rock Frontman Became Heavy Metal’s Kingmaker Rock ‘n’ Roll and Gambling: How Rock Music Amped Up Online Casino Games Rock ‘n’ Roll and Gambling: How Rock Music Amped Up Online Casino Games New video: Don Powell on Slade, Survival and Starting Over New video: Don Powell on Slade, Survival and Starting Over Support This Site If you like what I do please support me on Ko-fi Categories Categories Select Category Articles Interview News Podcasts Recent Comments Fred Browning on Joe Meek – A Curious Mind Anonymous on The Mamas & the Papas – Top 5 Deep Cuts JR on Pat Gribben on The Adventures and the Art of Enduring Pop Cade Utterback on Mike Vickers – Manfred Mann James McDade on Bob Jackson – Badfinger Subscribe to Our Newsletter Please leave this field empty DON’T MISS A BEAT Be the first to know The Strange Brew news We don’t spam! Check your inbox or spam folder to confirm your subscription. Copyright © All rights reserved. | BroadNews by AF themes."
    },
    {
      "url": "https://badfins.com/",
      "text": "Badfins Food + Brew | Tacos & Seafood Restaurant at Clearwarer Beach Skip to content Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog This is hands down the best food on Clearwater Beach. The tuna tostadas were amazing as were the snapper bites. The live music and beer selection was amazing. We cannot say enough good things about this place. We were only here for one night and had both lunch and dinner here, if that says anything. Kudos to what they’ve done with the place. We will definitely be back! Holly F. VIEW OUR MENU Book Reservation Now serving Brunch specialties every Sunday from 11am to 4pm. - Get $5 off of unlimited mimosas when you order a brunch item VIEW BRUNCH MENU VOTED BEST MEXICAN & SEAFOOD ON CLEARWATER BEACH Badfins Food + Brew is a family friendly restaurant serving up mouthwatering seafood and Mexican dishes located at Wyndham Grand Resort on Clearwater Beach – recently voted ‘Best Beach in America’ and rated as one of the most beautiful beaches in the world. Influenced by the trendy St. Petersburg art scene and culture, Badfins Food + Brew is not like any other restaurant on Clearwater Beach and is recognized as one of the best new restaurants in the area. Dedicated to delicious food, excellent service and an inviting atmosphere Badfins Food + Brew is becoming known for its great seafood and Mexican dishes – along with a variety of local craft beers, wines, handcrafted cocktails and live music . Badfins Food + Brew’s private comfort patio and beer garden provide amazing views of Clearwater Beach and welcomes not only the casual beach diner, but also accommodates private parties and other events, such as corporate events, rehearsal dinners, wedding receptions, birthday parties, and dinner events. For more information, please fill out the form by clicking on the Book Your Event button below or click here to fill out an inquiry form. LIVE MUSIC ON CLEARWATER BEACH… JOIN US TO EXPERIENCE TAMPA BAY’s TOP TALENT LIVE MUSIC CALENDAR Order Online Powered By Order Now! Drink Menu Our drink menu offers the largest selection on Clearwater Beach. Whether you are looking for a local craft beer from one of our 34 taps, delicious hand-crafted cocktails, red or white wine, or non-alcoholic drinks we will be able to quench your thirst. Check us out every Wednesday after 5pm for half off beers. VIEW FULL MENU Lunch & Dinner Menu Badfins Food + Brew is a family friendly restaurant serving up mouthwatering seafood and Mexican dishes located at Wyndham Grand Resort on Clearwater Beach – ‘Best Beach in America’ and rated as one of the most beautiful beaches in the world. Come join us and enjoy the views on Clearwater Beach! VIEW FULL MENU 34 TAPS,MOSTLY LOCAL -DELICIOUS BEERS… VIEW ROTATING MENU OUR BLOG CHECK ALL ARTICLES QR Menu Ordering Is Now Available at Badfins Just when you thought Badfins couldn’t get any better, we’ve now... Read More Everything About Our Awesome Restaurants Rewards Program Don’t you love getting free stuff? Especially when its stuff you... Read More The Local Favorite Seafood Restaurant at Clearwater Beach Whether you’re a long-time resident, someone who’s just moved, or a... Read More Badfins – The Best Beachfront Bar in Clearwater Beach Clearwater Beach is famous for its soft, white sand stretch that... Read More Welcome to Clearwater, Florida : The Land of Fun and Food Introduction Florida is the place to be for fun-filled days and... Read More Badfins Wins The Tripadvisor 2021 Travelers’ Choice Award 2020 was the most challenging year for people who love to... Read More Become a \"Badfins\" Reward Member Earn 1-point for every dollar spent & $3 cashback! Oh, and be sure to stay on the lookout for double & triple point events... #moneyinthebank💰 First Name Last Name Email Send *By signing up you give Badfins permission to email you the latest happenings as well as AMAZING discount opportunities. Welcome to the family! Wyndham Grand Beach Resort 215 S. Gulfview Blvd. Clearwater, Florida 33767 - 727-474-5591 (Text Only) Facebook-f Instagram Twitter Useful Links Order Now Clearwater Beach Brewery Book an Event at Clearwater Restaurants Join Our Team at Restaurant in Clearwater FL Contact Us Restaurants on the Beach in Clearwater Read Our Blog of Restaurant at Clearwater Privacy Policy Terms & Conditions Book your next special event with us. Text us at 727-474-5591 for more information or click button below to fill out our event form. Mon - Thur - 11:30am - *BOB Fri - Sat - 11:30am - *BOB Sun - 11:30am - *BOB *Based on Business EVENT FORM Copyright © 2021 Badfins Clw Beach , LLC. All rights reserved. Powered by Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Location 215 S. Gulfview Boulevard Clearwater, Florida 33767 Phone 727-474-5591 info@badfins.com Hours Mon - Thur - 11:30am - *BOB Fri - Sat - 11:30am - *BOB Sun - 11:30am - *BOB *Based on Business Copyright © 2021 Badfins Clw Beach , LLC. All rights reserved. Optimized by Seraphinite Accelerator Turns on site high speed to be attractive for people and search engines."
    },
    {
      "url": "https://badfins.com/join-our-team/",
      "text": "Join Our Team at Restaurant in Clearwater FL - Badfins Skip to content Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Join Our Team Badfins Restaurant Clearwater Beach » Join Our Team Thank you for your interest in Badfins Food + Brew. Please click on the open positions below to view the detailed job description(s). You can apply for any position by filling out our online form. We look forward to hearing from you! LINE COOK | PREP DRINK SPECIALIST FOOD ATTENDANT *Not Hiring KITCHEN MANAGER | HEAD COOK Please fill out the online employment application below: First Name Last Name Social Security # Email Phone Number Are you able to work in the United States?* : Yes No Are you 18 older? * : Yes No Date of Birth* : Have you been convicted of a felony or been incarcerated in connection with a felony in the past seven years? * : Yes No If, yes please explain: Have you been convicted of a felony or been incarcerated in connection with a felony in the past seven years? * : Drink Specialist Food Attendant Cook Prep How did you hear about this position? Expected Hourly Rate: Do you have reliable method of transportation? : Yes No Date available to start work? : Name of Last Employer: Dates of Employment (from date to date): What was your position? What was your pay rate?* Reason for leaving: Tell us about your typcial day: May we contact the past employer for a reference? : Yes No Highest level of education completed?* : GED High School Technical School College SUBMIT Become a \"Badfins\" Reward Member Earn 1-point for every dollar spent & $3 cashback! Oh, and be sure to stay on the lookout for double & triple point events... #moneyinthebank💰 First Name Last Name Email Send *By signing up you give Badfins permission to email you the latest happenings as well as AMAZING discount opportunities. Welcome to the family! Wyndham Grand Beach Resort 215 S. Gulfview Blvd. Clearwater, Florida 33767 - 727-474-5591 (Text Only) Facebook-f Instagram Twitter Useful Links Order Now Clearwater Beach Brewery Book an Event at Clearwater Restaurants Join Our Team at Restaurant in Clearwater FL Contact Us Restaurants on the Beach in Clearwater Read Our Blog of Restaurant at Clearwater Privacy Policy Terms & Conditions Book your next special event with us. Text us at 727-474-5591 for more information or click button below to fill out our event form. Mon - Thur - 11:30am - *BOB Fri - Sat - 11:30am - *BOB Sun - 11:30am - *BOB *Based on Business EVENT FORM Copyright © 2021 Badfins Clw Beach , LLC. All rights reserved. Powered by Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Location 215 S. Gulfview Boulevard Clearwater, Florida 33767 Phone 727-474-5591 info@badfins.com Hours Mon - Thur - 11:30am - *BOB Fri - Sat - 11:30am - *BOB Sun - 11:30am - *BOB *Based on Business Copyright © 2021 Badfins Clw Beach , LLC. All rights reserved. Optimized by Seraphinite Accelerator Turns on site high speed to be attractive for people and search engines."
    },
    {
      "url": "https://badfins.com/sides/",
      "text": "Sides | Badfins Food + Brew Skip to content Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Badfins Restaurant Clearwater Beach » Sides Food menu - sides Tortilla Chips – $3 Crispy corn tortillas Tido’s Slaw – $3 Napa cabbage, pickled red onion, jalapenos, carrots, pickled red onions, oregano & fresh lime juice Black Beans & Cilantro-Lime Rice – $5 Black beans and cilantro lime rice Fresh Fruit Cup – $6 Cuts of seasonal fresh fruit Skinny Fries – $5 Thin and crispy fries Sauteed Mexican Spinach – $6 Baby spinach, jalapeno, cumin, garlic, Roma tomatoes, pickled red onions & cotija cheese Side Mexican Caesar – $8 Fresh romaine, cotija cheese, roma tomatoes, toasted pepitas, crispy tortilla strips, micro greens & the original Gardini’s Caesar salad dressing Other Items You May Like Strawberry & Lime Margarita View Item Strawberry Cheesecake in the Face – imperial pastry-style fruited sour ale – ABV : 8.0% View Item Very Berry Blueberry Mojito View Item Reef Donkey – American Pale Ale – ABV 5.5% View Item Prosecco View Item Flop Drop Martini View Item Milk (Chocolate Milk) View Item Blood Brother’s Bloody Mary View Item Mr. Pibb View Item Strawberry Daquiri View Item Flori-da Margari-da View Item Orange Juice View Item Apple Juice View Item Pinot Grigio View Item Unsweetened Iced Tea View Item That’s Mai Tai View Item Peach Don’t Kill My Vibe Martini View Item Mojo Java Dessertini View Item That’s What She Said Sangria View Item Sprite View Item Tropic Like Its Hot Margarita View Item Bottomless Mimosas Every Sunday till 5PM View Item Lemonade View Item Raspberry Tea View Item Hi-C Fruit Punch View Item Diet Coke View Item Lavender & Elderflower View Item B.A.P. = Bad A** Pineapple View Item The Walter White View Item Old Elephant Foot – Indian Pale Ale –  ABV 7.0% View Item Moscow Cherry Lime Mule View Item Sweetened Tea View Item Coke View Item Cloudy Donkey – Double dry-hopped hazy pale ale – ABV 5.5% View Item Beermosa View Item Barq’s Root Beer View Item Rum Runner View Item Italian Red Blend View Item No Diggity Mule View Item Bottled Water View Item Green Tea View Item Pina Colada View Item Mimosa View Item Become a \"Badfins\" Reward Member Earn 1-point for every dollar spent & $3 cashback! Oh, and be sure to stay on the lookout for double & triple point events... #moneyinthebank💰 First Name Last Name Email Send *By signing up you give Badfins permission to email you the latest happenings as well as AMAZING discount opportunities. Welcome to the family! Wyndham Grand Beach Resort 215 S. Gulfview Blvd. Clearwater, Florida 33767 - 727-474-5591 (Text Only) Facebook-f Instagram Twitter Useful Links Order Now Clearwater Beach Brewery Book an Event at Clearwater Restaurants Join Our Team at Restaurant in Clearwater FL Contact Us Restaurants on the Beach in Clearwater Read Our Blog of Restaurant at Clearwater Privacy Policy Terms & Conditions Book your next special event with us. Text us at 727-474-5591 for more information or click button below to fill out our event form. Mon - Thur - 11:30am - *BOB Fri - Sat - 11:30am - *BOB Sun - 11:30am - *BOB *Based on Business EVENT FORM Copyright © 2021 Badfins Clw Beach , LLC. All rights reserved. Powered by Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Location 215 S. Gulfview Boulevard Clearwater, Florida 33767 Phone 727-474-5591 info@badfins.com Hours Mon - Thur - 11:30am - *BOB Fri - Sat - 11:30am - *BOB Sun - 11:30am - *BOB *Based on Business Copyright © 2021 Badfins Clw Beach , LLC. All rights reserved. Optimized by Seraphinite Accelerator Turns on site high speed to be attractive for people and search engines."
    }
  ]
}