{
  "query": "badfins.com email",
  "fuentes": [
    {
      "url": "https://badfins.com/contact-us/",
      "email": "info@badfins.com"
    },
    {
      "url": "https://badfins.com/terms-conditions/",
      "email": "help@badfins.com"
    },
    {
      "url": "https://badfins.com/terms-conditions/",
      "email": "info@badfins.com"
    }
  ],
  "mails": [
    "help@badfins.com",
    "events@badfins.com",
    "info@badfins.com"
  ],
  "nombre_sitio": "badfins.com",
  "origen_extraccion": "Busqueda externa paso: email",
  "textos_fuente": [
    {
      "url": "https://badfins.com/contact-us/",
      "text": "Contact Us | Seafood Restaurants near Clearwater BeachFL Skip to content Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Contact Us Badfins Restaurant Clearwater Beach » Contact Us Book Reservation Book a reservation for small parties up to 20 guests: Book Reservation Find Us Location 215 S. Gulfview Boulevard Clearwater, Florida 33767 Text Us 727-474-5591 (Text Only) Hours Mon - Thur - 11:30am - *BOB Fri - Sat - 11:30am - *BOB Sun - 11:30am - *BOB *Based on Business Drop Us a Line Facebook-f Instagram Twitter If you have questions or need additional information,\nplease text: 727-474-5591 First Name Last Name Email Occasion Date of Event : Number of Guests Tell us More Send Terms and Conditions: “You agree to receive [TYPES of MESSAGES] from [BUSINESS NAME]. Message frequency varies. Message and data rates may apply. For help, reply HELP or email us at [EMAIL ADDRESS]. You can opt out at any time by replying STOP.” Submit Become a \"Badfins\" Reward Member Earn 1-point for every dollar spent & $3 cashback! Oh, and be sure to stay on the lookout for double & triple point events... #moneyinthebank💰 First Name Last Name Email Send *By signing up you give Badfins permission to email you the latest happenings as well as AMAZING discount opportunities. Welcome to the family! Wyndham Grand Beach Resort 215 S. Gulfview Blvd. Clearwater, Florida 33767 - 727-474-5591 (Text Only) Facebook-f Instagram Twitter Useful Links Order Now Clearwater Beach Brewery Book an Event at Clearwater Restaurants Join Our Team at Restaurant in Clearwater FL Contact Us Restaurants on the Beach in Clearwater Read Our Blog of Restaurant at Clearwater Privacy Policy Terms & Conditions Book your next special event with us. Text us at 727-474-5591 for more information or click button below to fill out our event form. Mon - Thur - 11:30am - *BOB Fri - Sat - 11:30am - *BOB Sun - 11:30am - *BOB *Based on Business EVENT FORM Copyright © 2021 Badfins Clw Beach , LLC. All rights reserved. Powered by Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Location 215 S. Gulfview Boulevard Clearwater, Florida 33767 Phone 727-474-5591 info@badfins.com Hours Mon - Thur - 11:30am - *BOB Fri - Sat - 11:30am - *BOB Sun - 11:30am - *BOB *Based on Business Copyright © 2021 Badfins Clw Beach , LLC. All rights reserved. Optimized by Seraphinite Accelerator Turns on site high speed to be attractive for people and search engines."
    },
    {
      "url": "https://badfins.com/terms-conditions/",
      "text": "Terms & Conditions | Badfins Food + Brew Skip to content Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Terms & Conditions Recurring Message Terms and Conditions Sample Effective Date:01/01/2025 By opting in to receive SMS messages from Badfins Food + Brew (“we,” “us,” “our”), you agree to these Terms and Conditions (Terms). SMS Messaging Service By providing my phone number, I consent to receive SMS text messages from [Brand Name used to Register the campaign] for customer care messages about our restaurant times, menu and other related materials. Message and Data Rates may apply. Message Frequency You will get more than one message from us unless you opt-out, and while messaging frequency varies, you will likely receive messages and responses to the questions you asked about Badfins Food + Brew. Badfins Food + Brew reserves the right to alter the frequency of messages at any time to increase or decrease the total number of messages. Badfins Food + Brew and carriers are not liable for delays or undelivered messages. Message and Data Rates Message and data rates may apply based on your mobile carrier’s terms. Privacy Policy Your information will be handled in accordance with our Privacy Policy . Cancellation/Opt-Out Instructions You can opt out of receiving SMS messages at any time by replying STOP to any message we send you. After you opt out of text messaging, you will receive one additional message confirming your request has been processed. Help/Customer Support Text the word HELP for support. You may also contact us directly at 727-474-5591 or help@badfins.com. Liability We are not responsible for any charges, errors, or delays in SMS delivery or undelivered messages caused by your carrier or third-party service providers. Become a \"Badfins\" Reward Member Earn 1-point for every dollar spent & $3 cashback! Oh, and be sure to stay on the lookout for double & triple point events... #moneyinthebank💰 First Name Last Name Email Send *By signing up you give Badfins permission to email you the latest happenings as well as AMAZING discount opportunities. Welcome to the family! Wyndham Grand Beach Resort 215 S. Gulfview Blvd. Clearwater, Florida 33767 - 727-474-5591 (Text Only) Facebook-f Instagram Twitter Useful Links Order Now Clearwater Beach Brewery Book an Event at Clearwater Restaurants Join Our Team at Restaurant in Clearwater FL Contact Us Restaurants on the Beach in Clearwater Read Our Blog of Restaurant at Clearwater Privacy Policy Terms & Conditions Book your next special event with us. Text us at 727-474-5591 for more information or click button below to fill out our event form. Mon - Thur - 11:30am - *BOB Fri - Sat - 11:30am - *BOB Sun - 11:30am - *BOB *Based on Business EVENT FORM Copyright © 2021 Badfins Clw Beach , LLC. All rights reserved. Powered by Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Home Food Menu Drink Menu Live Music Order Now Specials Book Event Contact Us Join Our Team Blog Location 215 S. Gulfview Boulevard Clearwater, Florida 33767 Phone 727-474-5591 info@badfins.com Hours Mon - Thur - 11:30am - *BOB Fri - Sat - 11:30am - *BOB Sun - 11:30am - *BOB *Based on Business Copyright © 2021 Badfins Clw Beach , LLC. All rights reserved. Optimized by Seraphinite Accelerator Turns on site high speed to be attractive for people and search engines."
    }
  ]
}