{
  "fuentes": [
    {
      "url": "https://hbanet.org/who-we-are/hba-central-staff",
      "email": "acortinas@hbanet.org"
    },
    {
      "url": "https://hbanet.org/who-we-are/hba-central-staff",
      "email": "acrolius@hbanet.org"
    },
    {
      "url": "https://hbanet.org/who-we-are/hba-central-staff",
      "email": "bbull@hbanet.org"
    },
    {
      "url": "https://hbanet.org/who-we-are/hba-central-staff",
      "email": "bfairbanks@hbanet.org"
    },
    {
      "url": "https://hbanet.org/who-we-are/hba-central-staff",
      "email": "dtrama@hbanet.org"
    },
    {
      "url": "https://hbanet.org/who-we-are/hba-central-staff",
      "email": "gtodd@hbanet.org"
    },
    {
      "url": "https://hbanet.org/who-we-are/hba-central-staff",
      "email": "jpiceno@hbanet.org"
    },
    {
      "url": "https://hbanet.org/who-we-are/hba-central-staff",
      "email": "kbrennan@hbanet.org"
    },
    {
      "url": "https://hbanet.org/who-we-are/hba-central-staff",
      "email": "kcammer@hbanet.org"
    },
    {
      "url": "https://hbanet.org/who-we-are/hba-central-staff",
      "email": "lgademsky@hbanet.org"
    },
    {
      "url": "https://hbanet.org/who-we-are/hba-central-staff",
      "email": "lpeck@hbanet.org"
    },
    {
      "url": "https://hbanet.org/who-we-are/hba-central-staff",
      "email": "lrhodes@hbanet.org"
    },
    {
      "url": "https://hbanet.org/who-we-are/hba-central-staff",
      "email": "lwhitefield@hbanet.org"
    },
    {
      "url": "https://hbanet.org/who-we-are/hba-central-staff",
      "email": "maryestutts@hbanet.org"
    },
    {
      "url": "https://hbanet.org/who-we-are/hba-central-staff",
      "email": "mmorse@hbanet.org"
    },
    {
      "url": "https://hbanet.org/who-we-are/hba-central-staff",
      "email": "mquarterman@hbanet.org"
    },
    {
      "url": "https://hbanet.org/who-we-are/hba-central-staff",
      "email": "njones@hbanet.org"
    },
    {
      "url": "https://hbanet.org/who-we-are/hba-central-staff",
      "email": "nwhite@hbanet.org"
    },
    {
      "url": "https://hbanet.org/who-we-are/hba-central-staff",
      "email": "phurtado@hbanet.org"
    },
    {
      "url": "https://hbanet.org/who-we-are/hba-central-staff",
      "email": "rsmith@hbanet.org"
    },
    {
      "url": "https://hbanet.org/who-we-are/hba-central-staff",
      "email": "shollingsworth@hbanet.org"
    },
    {
      "url": "https://hbanet.org/who-we-are/hba-central-staff",
      "email": "tdavis@hbanet.org"
    },
    {
      "url": "https://hbanet.org/who-we-are/hba-central-staff",
      "email": "thamilton@hbanet.org"
    },
    {
      "url": "https://hbanet.org/who-we-are/hba-central-staff",
      "email": "ybrito@hbanet.org"
    }
  ],
  "mails": [
    "acortinas@hbanet.org",
    "acrolius@hbanet.org",
    "bbull@hbanet.org",
    "bfairbanks@hbanet.org",
    "dtrama@hbanet.org",
    "gtodd@hbanet.org",
    "jpiceno@hbanet.org",
    "kbrennan@hbanet.org",
    "kcammer@hbanet.org",
    "lgademsky@hbanet.org",
    "lpeck@hbanet.org",
    "lrhodes@hbanet.org",
    "lwhitefield@hbanet.org",
    "maryestutts@hbanet.org",
    "mmorse@hbanet.org",
    "mquarterman@hbanet.org",
    "njones@hbanet.org",
    "nwhite@hbanet.org",
    "phurtado@hbanet.org",
    "rsmith@hbanet.org",
    "shollingsworth@hbanet.org",
    "tdavis@hbanet.org",
    "thamilton@hbanet.org",
    "ybrito@hbanet.org"
  ],
  "nombre_sitio": "bahihut.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://hbanet.org/who-we-are/hba-central-staff",
      "text": "HBA Central Staff | Meet Our Team Skip to main content Healthcare Businesswomen's Association Logo Utility Menu HBA Academy Find Your Local Chapter Cart Log in Main navigation Menu Close Our Impact Expand Our Impact The HBA is furthering the advancement and impact of women in the business of healthcare. HBA Think Tank HBA Awards HBA Annual Report HBA Think Tank An award-winning think tank of companies dedicated to accelerating equity and transforming the healthcare and life sciences industry. Announcing the 2025 HBA ACE Awards Honorees The HBA’s ACE Awards spotlight bold, people-first programs that are transforming how the industry develops, engages, and empowers its workforce. Who We Are Expand Who We Are HBA’s members and Corporate Partners represent a global workforce of more than six million professionals across the healthcare ecosystem. Leadership Teams Meet the HBA Central Staff Team Explore HBA Locations Find Your Nearest HBA Location > The HBA has 50+ locations around the globe who are leading our United Force for Change in the relentless pursuit of gender parity. Events & Programs Expand Events & Programs We bring industry leaders together for community growth, idea sharing, and real-world learning through in-person and virtual programs across the globe. Event Calendar Annual Conference HBA Academy Circle of Advisors Career Conversations Mentoring Program SPRINT Program Building Better Business Connections (3BC) 2025 HBA Annual Conference The 2025 HBA Annual Conference is the must-attend leadership event for professionals across the healthcare and life sciences industry. Against the iconic backdrop of Las Vegas at the stunning Fontainebleau Resort , the 26th HBA Annual Conference will convene a truly global community of industry executives, rising leaders, entrepreneurs, innovators, and changemakers united by one purpose: Creating Healthcare Leaders for Life . Make moves to advance your career. Are you ready to break barriers and soar to new heights? You’re not alone. The healthcare industry is ripe with opportunity, but women are still underrepresented in leadership roles. It’s time to change that. News & Insights Expand News & Insights See the latest insights, inspiration, and top news stories from across our global community. Press and Media Center HBA Press Releases and Official Statements Three Awards. One Powerful Legacy. Do you know trailblazers who are transforming the healthcare industry? Leaders who aren’t only breaking barriers—but lifting others as they rise? Now is your moment to recognize them. Introducing The HBA Foundation Advancing global health and expanding the future healthcare workforce through mission-driven giving. Membership Expand Membership Whether you’re looking to empower the women in your organization or join a diverse group of women and men driving our mission forward, only the HBA can provide industry-defining exposure, community, and opportunity. For Companies For Individuals HBA Communities Member Welcome Center Volunteer Opportunities > Take advantage of leadership and skill development opportunities designed to fit every career, every level, and every schedule. Affinity Groups > Members can find their fit through affinity groups to meet like-minded changemakers, influencers, future leaders, and allies that are advancing HBA's mission. Search here Close Who We Are HBA Central Staff The HBA Central Staff Team assists the CEO in efficiently implementing the board’s strategic objectives. The team is dedicated to providing the best member and partner experience while delivering on HBA’s value proposition. Breadcrumb Home Who We Are HBA Central Staff A Message From HBA CEO Mary Stutts Remote video URL A Culture of Success Achieving our vision demands full commitment to our core values from every team member. We strive to exemplify our values in everything we do. Складнощі з погашенням раніше взятих кредитів змушують багатьох українців шукати альтернативи. Одним із найефективніших рішень у таких ситуаціях є перекредитування позики , яке дає змогу закрити поточні зобов’язання на вигідніших умовах. Завдяки цьому позичальник отримує новий графік платежів, нижчу ставку та можливість уникнути прострочень. Такий підхід особливо актуальний для тих, хто має кілька кредитів одночасно або потрапив у складну фінансову ситуацію. Перекредитування оформлюється онлайн, часто — без додаткових перевірок, із мінімумом документів. Клієнт просто заповнює форму, вказує деталі попередньої позики, після чого компанія видає нову суму для закриття боргу. Це дозволяє зберегти кредитну історію, уникнути штрафів і стабілізувати своє фінансове становище. Our HBA Culture Staff Directory EXECUTIVE TEAM Mary Stutts Chief Executive Officer Mary Stutts is the Chief Executive Officer of the Healthcare Businesswomen’s Association (HBA) where she leads the global mission to accelerate the advancement and impact of women in the business of healthcare and health equity. Mary brings to the HBA 30 years of experience leading the strategic integration of corporate branding, marketing, health equity, inclusion, and digital innovation for biopharma, healthcare, and media companies. Her expertise and cross functional acumen have provided global leadership to organizations and Fortune 500 companies including Genentech, Bayer, Bristol Myers Squibb, Sumitovant, UnitedHealth Group, Kaiser Permanente, Stanford Health Care, and Comcast NBCUniversal. Previously, Stutts was the Global Chief Inclusion and Health Equity Officer at Real Chemistry where she drove inclusion and equitable care for clients by integrating customized digital analytics and data intelligence to increase market penetration and clinical trial diversity. Among her many accomplishments, as the former Chief Inclusion and Health Equity Officer at Stanford Health Care, Stutts worked directly with the board to curate the Inclusive Leadership Workshop which was designed to develop executives capable of leading, growing, and transforming organizations while addressing racial and social injustice and inequity amongst all stakeholders. Additionally, Stutts led Genentech’s $5 million Diversity in Clinical Trials initiative to increase the representation of people of color and women; enhanced a culture of workplace inclusion and health equity during Bristol Myers Squibb’s business model transformation; and oversaw fulfillment of the FCC’s digital equity conditions in Comcast’s California Region required for the acquisition of NBCUniversal. Stutts is a recognized advocate of women in leadership and has been at the forefront of board readiness programs to increase the representation of women and people of color on public and private corporate boards. As an accomplished author, Mary’s new book, Recurring Themes of Exclusion in the Workplace , provides an in-depth analysis of ongoing exclusionary practices in the workplace and details the path needed to achieve true “inclusive diversity.” Her book The Missing Mentor:  Women Advising Women on Power, Progress and Priorities has been dubbed a surrogate mentor for women focused on career advancement. Stutts earned a Master of Health Administration degree at the University of Southern California and is a graduate of the Executive Program on Strategy and Organization at the Stanford University Graduate School of Business. Amy Crolius, CAE Chief Operating Officer Amy has spent her career forging alliances and seeking joint solutions in cutting edge industries as they work to meet the challenges of the 21st Century. Most recently, Amy was vice president of member services for the Association for Unmanned Vehicle Systems International (AUVSI) where she succeeded in building participation and membership in virtually every sector and level of the unmanned community. She helped businesses grow by leveraging assets of the organization through education, advocacy and events. Prior to AUVSI, she spent seven years in member development and services for the World Airline Entertainment Association which represents over 90% of commercial airlines around the world. In her free time, Amy is a world traveler, having visited over sixty countries, enjoys many outdoor activities including camping and hiking, and plays competitive soccer. Nikki M. Jones Chief People, Data, & Research Strategy Officer Nikki M. Jones is a seasoned people and culture executive with over 30 years of professional business experience, including 16 years in the not-for-profit sector. She currently serves as the Chief People, Data, & Research Strategy Officer at the Healthcare Businesswomen’s Association (HBA), where she leads the development and execution of the organization's people and data strategy for professional staff. Since joining HBA in 2009, Nikki has held executive leadership roles across various functions, including finance, marketing, communications, technology, and people operations. Prior to her tenure at HBA, she held finance management positions at Johnson & Johnson, supporting the consumer care business, and at Prudential's former healthcare division, focusing on accounting and finance. Nikki earned her Bachelor of Science degree in Accounting from Elizabeth City State University, a historically Black college and university (HBCU). She is a certified human resource professional (SHRM-CP) through the Society for Human Resource Management (SHRM). In recognition of her leadership and impact, Nikki was named a Bloc Vanguard Honoree and was included in the \"100 Most Impactful Women of Color & Allies Shaping The Future of Healthcare, Life Sciences, & Biopharma\" list. Outside her professional endeavors, Nikki enjoys a fulfilling personal life with her husband of over 25 years and their three college-aged children. She has a passion for dancing and singing and is dedicated to inspiring others to make a positive impact. Nikki actively volunteers in her church's women's ministry and the broader community. She also serves as the Chair of the Board of Directors for the YWCA Princeton in Princeton, NJ, and has been a proud member of Alpha Kappa Alpha Sorority, Incorporated, for over 30 years. Varduhi Kyureghyan Chief Financial Officer Varduhi Kyureghyan is the Chief Financial Officer at the Healthcare Businesswomen’s Association (HBA), where she leads financial strategy, business development, IT, and awards. With a strong focus on sustainability and growth, she oversees global pricing strategy and financial planning to ensure HBA’s long-term success. Bringing over 15 years of expertise in finance and budget management, Varduhi has played a key role in implementing financial policies, systems, and controls to ensure compliance, transparency, and accountability since joining HBA in July 2024. With a deep commitment to social justice and human dignity, she has successfully managed multi-million-dollar grants from foundations, governments, and corporations, ensuring accurate reporting and strategic financial oversight. Before joining HBA, Varduhi served as a Consulting CFO, providing strategic and operational financial guidance to nonprofit organizations across sectors such as healthcare, social services, and human rights. She has extensive experience optimizing financial systems, securing diverse funding streams, and implementing data-driven financial strategies that enhance organizational resilience. She holds an MBA in Technology and Operations Management with specializations in Healthcare and Strategy, which she leverages to optimize financial systems, enhance operational efficiency, and align financial goals with HBA’s mission. As CFO, Varduhi is dedicated to driving financial sustainability and supporting the organization’s long-term impact and growth. Yesenia Hernandez-Brito, CAP, PACE Director, Executive Office & Global Board Affairs Yesenia Hernandez-Brito joined the HBA in January 2021 and serves as the Director, Executive Office & Global Board Affairs. In this position, Yesenia leverages her status as a Master Certified EA Pro to provide high-level support to the executive leadership team, while managing global board meetings and events. She also leverages strong relationships with a broad variety of senior level customers and member leaders. As the principal liaison to the Global Board of Directors and the Global Advisory Board, Yesenia ensures that all board activities are meticulously organized, her oversight of governance, policy, and procedure documentation further highlights her comprehensive understanding of association governance and best practices. Yesenia plays a vital role in administering HBA’s prestigious awards, ACE and the Woman of the Year (WOTY) awards. She excels in VIP management, ensuring that awardees, chairs emeritae, and founders receive exceptional support throughout their involvement. Yesenia has over 25 years' experience in board management and c-suite executive support. Before joining the HBA, she served as Director of Board Relations and Programs at a New York City nonprofit association, where she was the staff lead for the board, executive management, councils, and committees. She earned her bachelor’s degree in business administration from Baruch College and holds various certifications, including the Professional Administrative Certification of Excellence (PACE) from the American Society of Administrative Professionals (ASAP), DEI in the Workplace and Inclusive and Ethical Leadership from the USF Muma College of Business, Executive Presence Certificate from UNF Coggin College of Business, and a certificate in Association Management from the American Society of Association Professionals (ASAE). In August 2023, Yesenia was recognized as the Above the Call Award Winner at the Washington, D.C. Admin Awards. The Admin Awards is the Administrative Profession’s highest honor and nationally known as the “Academy Awards for Admins.” It is the first and only public recognition program of its kind that specifically focuses on recognizing the achievements, dedication, and importance of Administrative Professionals. She also serves on the American Society of Administrative Professionals Advisory Board, the Admin Awards Advisory Board, and the EA Pros Board. Yesenia currently resides in New Jersey with her husband and is a proud mom of three sons. She enjoys traveling, reading, and spending quality time with her extended family. STAFF TEAM Wanell Boone Senior Program Manager, HBA Think Tank Wanell Boone is the Senior Program Manager for the HBA Think Tank.  In her role, Wanell will support key initiatives and oversee programs that advance the Think Tank’s mission, foster impactful growth, and expand its influence. Wanell brings over 15 years of nonprofit program management and development expertise, including aligning programs with organizational goals, managing data-driven DEI initiatives, and fostering a culture of inclusion and continuous improvement. Her proven ability to design and deliver high-quality initiatives that serve diverse stakeholder needs will be invaluable as we continue to drive the Think Tank forward. Wanell is a proud graduate of Morgan State University, where she earned her Bachelor of Arts in Political Science. She resides in Maryland with her husband and children. Kayla Brennan Senior Manager, Global Conferences and Events Kayla Brennan joined the HBA in 2022, bringing 10 years of experience in the events and association industries to her position as Senior Manager of Global Conferences and Events. In her current role, she supports the strategy, planning, and execution of HBA’s large-scale conferences and events around the globe. With a strong background in logistics, project and program management, and attendee engagement, Kayla has developed a reputation for leveraging her versatile skillset to elevate events with experience-driven design. Prior to working at the HBA, Kayla managed the educational offerings and supported the volunteer experience at a non-profit association in the higher education space.  She holds Bachelor of Science degrees in Psychology and Sociology from Clemson University. Kayla is an avid reader, loves to travel, and currently resides in Sumter, SC, with her fiancé and their two dogs. Barbara Bull Senior Director, Member and Volunteer Experience Barbara Bull, Senior Director of Member and Volunteer Experience, joined the HBA as a part-time contract employee in 2007 and transitioned to a full-time staff role in 2009. She began her career at the HBA as an event database specialist, working directly with chapters on their signature and special events. Over the years, Barbara has held various roles in chapter operations and supporting our volunteer leaders, eventually leading to her current role. Barbara leads the Member Experience team, which oversees all aspects of component operations. This includes ensuring compliance with HBA standards and processes and providing access to the resources needed for leaders to fulfill their roles effectively. Barbara has been instrumental in shaping HBA’s new operating model and spearheaded the organization’s expansion into new geographies. Her responsibilities include developing implementation timelines and selecting key leaders to support these efforts. Barbara continues to play a critical role in driving the organization's global growth, ensuring that the member and volunteer experience remains at the highest standard. Amanda Cortinas Account Manager, Corporate Partner Engagement Amanda joined the HBA in 2022 as a member of the Corporate Account Engagement and Relations team. She comes to us as an ally for the advancement of women within the healthcare industry. Amanda was born and raised in Texas and graduated from The University of North Texas. She has a background in social work, clinical research, and pharma. She is most passionate about women’s rights, animal rights, mental health, and DV survivor support. Outside of work, Amanda enjoys spending time with her family, friends, and pets. She also enjoys traveling, antiquing, Broadway shows, and hiking to get the most picturesque views. Amanda looks forward to creating meaningful partnerships that evoke success for all. Telesia Davis, Ph.D. Vice President, Global Education, Conferences, and Events Telesia enjoys designing high-impact educational experiences. She activated this passion in her roles as director of multicultural affairs at the University of South Carolina Aiken and as dean for campus life at Presbyterian College. She later transitioned to the association space at the National Association for Campus Activities, serving as director of education and research. She joined the HBA team in early 2021 and works to establish the educational content strategy for the association and to develop global learning initiatives. Her own life-changing educational experiences ignited and cultivated her enthusiasm for education. She earned a Bachelor’s degree in English from Paine College, a Master’s degrees in student personnel services and higher education business administration and a Ph.D. in educational leadership and policies from the University of South Carolina. Telesia resides in Columbia, SC and finds joy in reading, traveling and spending time with her husband and son. She is also an avid women’s basketball fan, never missing an opportunity to cheer on her Gamecocks at UofSC and any WNBA team with former Gamecocks. Bridget Fairbanks Manager, Customer Experience Bridget Fairbanks joined the HBA family in 2015 and holds the position of customer experience manager. In this role, Bridget works a great deal in aiding in technical support questions, cancellations and refunds and general customer service questions. She also serves as support to her colleagues on the HBA staff. Bridget is new to nonprofit associations but has worked for over nine years in the healthcare industry serving in many roles from secretary, scheduling manager and administrative assistant. In her free time, Bridget enjoys spending time with her husband and two children. Samantha Fitzgerald Senior Manager, Digital Marketing Samantha Fitzgerald, Senior Manager, Digital Marketing , joined the HBA in late 2024. Samantha brings over a decade of experience in marketing and advertising, with expertise in digital marketing and graphic design. In her new role, she will be instrumental in driving the HBA's global digital presence, advancing our mission through strategic and data-driven digital initiatives. Her responsibilities will include managing the HBA’s email marketing campaigns, optimizing the HBA website and event microsites, and working closely with our sales and business development teams to enhance the overall customer journey while ensuring the HBA’s digital touchpoints deliver measurable results. A proud mom to two energetic little boys, Sam and her husband enjoy traveling and creating cherished memories on Cape Cod. Leena Gademsky Senior Director, Information Technology Leena Gademsky joined the HBA as a director of IT in 2011. She is responsible for developing and implementing HBA’s virtual technology and support strategy.  Her main duties include managing the organization’s technology-related vendors, the HBA website, the membership and event database, hardware and software, e-communications, and other technology-related activities. Leena has a master’s degree in computer science from New Jersey Institute of Technology and a bachelor’s degree in electrical engineering from India. She began her career at Electronic Data Systems and has held progressively more responsible positions within the consulting industry. She has 20+ years of experience in information technology. Tashina Hamilton Senior Account Manager, Corporate Partner Engagement Tashina Hamilton is a seasoned Senior Account Manager with a strong background in customer success, healthcare technology, and corporate engagement. She has partnered with health insurance providers, government agencies, and enterprise clients to drive strategic growth, optimize customer experiences, and strengthen corporate relationships. Passionate about relationship-building and process improvement, Tashina has led initiatives in client retention, system implementation, and stakeholder engagement to support long-term success. A Gullah native of Bluffton/Hilton Head Island, South Carolina, Tashina now resides in Metro Atlanta, Georgia. She enjoys traveling, particularly cruising with Virgin Voyages and Disney Cruises, and exploring different cuisines along the way. Outside of work, she has a passion for interior decorating and event planning. She also brings a creative touch to character transformations through makeup artistry, helping bring elaborate looks to life. With a commitment to excellence and innovation, Tashina plays a key role in advancing HBA’s mission and fostering meaningful partnerships. Katie Hartmann Associate Director, Stakeholder Operations Katie Cammer joined the HBA in October of 2013 and currently holds the position of manager of chapter care. Katie serves as the main point of contact for all chapter and affiliate board members, to include the oversight of onboarding executive committee members, ensuring compliance with HBA standards and processes, and providing access to resources needed to execute their roles and responsibilities. She aids in the development of the HBA expansion into new geographies, including determining the timeline for implementation and selecting key leaders in HBA affiliates, as well as serving as an HBA staff person on the HBA Europe expansion. Before joining the HBA, Katie previously served in a program development/office management role at a national nonprofit association. She held several roles in the government contracting/telecommunications field prior to joining the association world in 2012. She attended Christopher Newport University where she worked towards a bachelor’s of science in business administration. In her free time, she enjoys spending time with her husband and two children, as well as volunteering at her daughter’s elementary school. Serene B. Hollingsworth Director, Corporate Accounts Corporate Partner Engagement Serene B. Hollingsworth joined the HBA in 2020 as director, corporate accounts where she looks to create powerful alliances with our corporate partners to advance gender parity in healthcare executive roles. She is responsible for managing the corporate relations team and key HBA corporate partner accounts. Serene provides strategic guidance with a focus on building deep relationships and being the voice of our HBA corporate partners. Serene brings to the HBA over 15 years of experience building trusted relationships and sustaining strategic winning partnerships with key stakeholders in U.S. health systems, media, publishing and advertising verticals. She has partnered with global accounts managing relationships with McDonalds, Proctor & Gamble, Ford, AT&T and others. Outside of work, Serene is mother to four young adult daughters, grandmother to Naomi, Ezra, and Liam; and mom to a Black Lab she calls, Egypt. She is also a college sports fan. “Go Buckeyes” and March Madness fanatic! Serene is an avid reader of online content and books. She is often found reading several books at once. Many have a play list. Serene has a read list. Current read list: “The Day Howdy Doody Died My Stolen Memoir”; “Bint” The Complete Trilogy; “Anonymous Is Woman: A Global Chronicle of Gender”; “Conscious Business”; and “Washington Black”. Serene looks forward to stretching, building, and doing great work with the HBA. Petrina Hurtado Associate Director, Data Analytics and Intelligence Petrina Hurtado joined the HBA in 2014 and currently holds the position of Associate Director, Data Analytics and Intelligence. Petrina oversees the reporting and maintenance of internal data systems, ensuring stakeholders have access to accurate and actionable insights. Additionally, Petrina leads research initiatives and data analysis efforts for the HBA Think Tank, providing strategic insights to advance the HBA’s mission. Petrina earned her master’s degree in social work from the University at Buffalo with a focus on community work, research methods, and program evaluation. She received the Therese Eusanio Memorial Award for work toward social change in the area of women’s health. She has held diverse roles in both direct services and administration of nonprofits including the Erie County Coalition Against Family Violence, Haven House domestic violence shelter, and Adirondack Medical Center. Outside of work, she is an avid knitter and Buffalo Bills season ticket holder. Laura Kaflik Director, Marketing Sanjuana \"SJ\" Martinez Senior Manager, Global Education and Events Sanjuana \"SJ\" joined the HBA in May 2024 as Senior Manager, Global Education and Events, where she will contribute her expertise to managing the HBA Academy after its launch later this year; coordinating and hosting Career Conversations; coordinating aspects of the HOPE program, including mentor/scholar and coach/scholar pairings and strategy session development; supporting the Global Education Advisory Committee; contributing to global education strategy; and supporting other education initiatives as they evolve. SJ holds a Bachelor of Business Management from the University of Houston - Downtown and a Master of Science in Educational Human Resource Development with a focus in Adult Education from Texas A&M University. SJ has more than a decade of experience in various industries such as Health & Wellness, Oil & Gas, and Higher Education and holds a diverse skillset through her experiences as a Learning & Development specialist, Relationship Manager, and Career Counselor.  She is a first-generation graduate and career professional dedicated to mentoring and supporting individuals through their professional journeys with a humanist approach in order to enact change within individuals. Outside of work, SJ enjoys reading various categories of books (her favorite smell is that of a stocked bookstore) and spending time outdoors. She is bilingual in Spanish, offering translation assistance to members of her community. She continues to mentor first generation students from underrepresented groups through her close proximity to a large public university and alumni associations. SJ resides in Texas with her son and goldendoodle. Hannah McComsey Senior Manager, Communications & Media Relations Hannah McComsey is a results-driven communications professional with a decade of experience crafting compelling narratives and building strong relationships. Before joining the HBA, Hannah worked as Manager of General Communications at the University of Pennsylvania's Gene Therapy Program where she translated complex scientific research into accessible language to advocate for patients living with rare diseases. In a prior role, she worked as a reporter for ABC13 News in Lynchburg, Virginia, where she honed her skills in news writing, production and community engagement. Hannah is passionate about using her communication expertise to drive impactful results for organizations serving their communities. She enjoys developing and executing strategic communication plans, building and maintaining media relationships and crafting impactful messaging. Gazmend Meni Senior Accountant Based in Chicago, Gazmend Meni is a seasoned financial professional with over eight years of experience in financial analysis, budgeting, and financial reporting across the telecommunications, retail, healthcare, and nonprofit sectors. He holds a bachelor's degree in economics and an MBA in international finance, bringing a strong analytical and strategic approach to financial management. At the HBA, Gazmend plays a key role in managing financial operations, ensuring accuracy in reporting, and supporting strategic decision-making through financial analysis. His expertise in budgeting, compliance, and financial process optimization helps drive efficiency and fiscal responsibility within the organization. Prior to joining the HBA, he served as Budget & Financial Reporting Manager at Lutheran Social Services of Illinois, where he oversaw government financial reporting, audits, and the organization’s budgeting process. He also held key financial roles at Connectel Albania, Catholic Charities of the Archdiocese of Chicago, and the University of New York Tirana. Fluent in English, Albanian, Greek, and Italian, Gazmend brings a global perspective to financial management and thrives in cross-functional collaboration. With advanced proficiency in financial modeling and Excel, he is committed to delivering data-driven insights that support organizational growth. Outside of work, he enjoys Mediterranean cuisine and spending quality time with his wife and two children. Michelle Morse, PMP Senior Manager, Member Programs Michelle Morse joined the HBA in February 2021. She supports the HBA’s regional and chapter leaders in the development and implementation of the HBA’s volunteer-led events, including event programming and educational seminars. She prides herself in keeping programs on schedule and within scope and budget, while working toward high efficiencies and flawless execution. The part of her job that she enjoys most is relationship building with volunteer member leaders, partners and other key stakeholders. Michelle also manages other member value offerings such as the HBA mentoring program and affinity groups. This is a passion project for her, as she credits much of her own career growth and professional accomplishments to the guidance she has received from her many mentors and communities. She is excited to join the HBA’s member experience team and to have a positive impact on HBA’s mission of achieving gender parity within the field of healthcare (and ideally one day in all aspects of society). As the daughter of an immigrant, she also has a strong interest in diversifying voices in leadership roles to include individuals from various distinct and unique backgrounds. Michelle holds a Project Management Professional (PMP) certification from the Project Management Institute and a BA from American University with a focus in psychology and literature. She has over ten years’ experience working in association management first with a military nonprofit organization and, most recently, with a medical association dedicated to improving women’s health. In her free time, Michelle volunteers with her local animal rescue, curls up with a good book, and travels with friends and family. Karina Nelson Manager, Member Events and Programs Karina Nelson has worked in the nonprofit sector for several years, bringing a wealth of experience in volunteer management, event planning, and stakeholder engagement. She holds a BA in Human Communication and an MA in Interdisciplinary Studies with a concentration in Social Justice and Advocacy. Her dedication to serving others has given her a deep appreciation for her role in connecting volunteers to their missions. Karina's passion for nonprofits began in her teenage years, inspired by her Deaf mother, who led the charge and created spaces where there were none. This attitude of determination and advocacy became a cornerstone of Karina's career. Karina has held various roles throughout her career, ranging from managing volunteer teams to advocating for vulnerable populations. Currently at HBA she is the Manager, Member Events and Programs. Prior to that she was the Volunteer Manager at the Council for Economic Education - Invest in Girls, she managed 2,000 volunteers and developed a top tier volunteer program that boosted engagement from individual volunteers to corporate partners. Prior to that, at the Foundation for Foster Children, she advocated for changes benefiting children and young adults in Central Florida. At The Faine House, she reinvigorated volunteer engagement and performance through the development and implementation of comprehensive policies and guidelines. As of 2024, she continues to inspire, encourage, and lead individuals to engage with missions they care about. Lauren Peck Director, Stakeholder Engagement Lauren Peck joined HBA in December of 2013 and is currently director of stakeholder engagement. As a member of the Member Experience department, she helps oversee the HBA’s stakeholder-facing volunteer functions (corporate relations, membership, and volunteer experience), working closely with cross-functional staff, to create the optimal experience for all. In her role, Lauren is invested in designing and implementing the ideal organizational structures across HBA for maximum efficiency and volunteer satisfaction, and is a resource for volunteer leaders at all levels, across all functions. Lauren works globally across the organization: advising/supporting the global council and affinity groups; helping drive HBA’s global growth strategy/locations and Community engagement; overseeing the HBA’s global Ambassador Program and committee, and supervising HBA’s European office and European Leadership Summit team. Over her time with HBA, Lauren has held a number of evolving roles. Most recently, she was senior manager of corporate development, focusing primarily on HBA’s corporate customers. Prior to that role, she was manager of chapter development and assisted in the design of the organization’s new operating model before supporting and managing the transition into the new model with multiple regions. When Lauren first joined HBA, it was as manager of meetings and events administration, where she managed and supported the former Metro chapter (now the NY/NJ/CT Region), their board and volunteers. Before joining HBA, Lauren worked in event coordination and office management for a private entertainment company and graduated from Rutgers University with a focus in art history and Italian. Lauren currently resides in New Jersey, USA and volunteers for Big Brothers Big Sisters and YWCA Princeton. In her free time, Lauren is a self-proclaimed bookworm, loves traveling, baking (but not cooking), and spending time with her friends, family, husband and dog. Jeanne Piceno Senior Data Coordinator Jeanne Piceno joined the HBA in 2017 as a corporate accounts coordinator and has since grown into her current role as senior data coordinator. Over the years, she has played a key role in advancing the organization’s data strategy, helping ensure that HBA staff and stakeholders have the insights they need to support our members, Corporate Partners, and Member Leaders. She works to maintain data integrity and deliver actionable information that drives strategic decision-making. Prior to joining the HBA, Jeanne held roles in communications and professional development across several associations, as well as administrative and office management positions in both corporate and small business environments. She holds a BA in Communication Studies with a concentration in public relations and a minor in marketing. Malissa Quarterman Director, Finance Malissa Quarterman joined the HBA in October 2017 as the senior manager, finance. The responsibilities of this role include, general ledger maintenance and chapter financial statements and analysis. Malissa has held various accounting positions in state government, for-profit and non-profit organizations. She earned her bachelor of science in accounting at Valdosta State University in Valdosta, GA and master of business administration in business management from Strayer University. Lauren Ramsden Manager, Business Development and Sales Lauren brings to HBA over a decade of Business Development and Sales experience within the Health and Wellness Industry. Throughout her career Lauren has held various sales and leadership positions including Senior Sales Consultant and Sales Manager at Chopra Global, where for 6 years she worked alongside the esteemed pioneer of mind-body medicine, Deepak Chopra, to guide and empower individuals to embark on transformative journeys towards wellness. Lauren has also worked as a B2B National Sales Manager for the nonprofit organization, the Institute for Meditation and Inner Harmony where she developed a deep understanding and passion for contributing her skillset to driving impact and influencing outcomes within the nonprofit sector. Lauren holds a Bachelor of Communication degree from the University at Albany. She resides in Las Vegas, NV, with her husband, and two-month-old son. As a Certified Meditation and Yoga Instructor, Lauren enjoys sharing wellness practices with others. She has cultivated a deep understanding of ancient healing practices and modern methodologies, equipping her with a unique blend of traditional wisdom and contemporary insights. During her free time, she can be found spending time with her family, hiking, practicing yoga and traveling to coastal California. She is committed to making wellness accessible to all individuals and is passionate about helping others to thrive and to reach their full potential. By joining forces with the HBA, she amplifies her impact and looks forward to making a significant contribution on a global scale. Nicole Randall Global Head of External Affairs Lauren Rhodes Membership Coordinator Lauren Rhodes is Healthcare Businesswomen’s Association’s new Membership Coordinator where she will focus on supporting members and Corporate Partners. Prior to joining the HBA, she coordinated executive recruiting searches specializing in gender equity and has experience in account management. She is excited to continue pushing for an inclusive environment with gender equity in every workplace. Lauren graduated from Middle Tennessee State University with a Bachelor’s degree in Agribusiness. She and her partner live just outside of Nashville and spend their time with their animals (horse, dog, and two cats), going to concerts, and gardening. Rob Smith Senior Account Manager, Corporate Partner Engagement Rob Smith joined the HBA in 2022 as Corporate Partner Engagement, Senior Account Manager. His goals are to create a fusion of harmony with our Corporate Partners to advance gender equity in healthcare executive roles. Rob is responsible for managing many of the HBA's most key accounts. He delivers on the voice of customer and representing the needs of our partners. Rob started his career in healthcare as combat medic for the USAF and took his clinical experience to SaaS EHR software consulting industry and eventually managed services account management/vendor services for large health systems on the global level, to include the VA and DoD. Rob earned his Bachelor's of Science - Global Business from Arizona State University. He's passionate about improving the overall patient experience along with advancing and supporting those who provide patient care! LaToya Tapscott, CAE Senior Director, Global Head of the HBA Think Tank LaToya Tapscott is the Senior Director, Global Head of the HBA Think Tank and she will focus on strategic planning, governance, and the development of products and partnerships to drive the Think Tank's growth and influence. As an experienced non-profit membership association professional, she brings 15+ years of experience in driving stakeholder engagement and fostering vibrant communities across diverse sectors. Previously, she served as the Senior Director of Digital Health Communities at the College of Healthcare Information Management Executives (CHIME) where she engaged healthcare technology executives and successfully oversaw strategic partnerships. Prior to that she played a pivotal role at the Association of Corporate Counsel (ACC) in developing and executing impactful programs for committee members, volunteer leaders, and corporate sponsors. LaToya's journey in the association industry began at the National Association of Student Personnel Administrators (NASPA), where she gained valuable insights into association management through various roles. LaToya is committed to giving back to her professional community through volunteer service. She currently serves on committees with organizations such as Association Women Technology Champions (AWTC), Black Association Executives (BAE), and ASAE's Healthcare Community Advisory Committee (HCAC). LaToya resides in Maryland with her family and she holds a Bachelor of Science in Marketing from the University of MD Global Campus and is a Certified Association Executive (CAE). Gabrielle Todd Account Manager, Corporate Partner Engagement Gabrielle is passionate about the advancement of all women into executive leadership in every business vertical and a champion for social justice. Gabrielle is Healthcare Businesswomen’s Association’s (HBA) newest Corporate Partner Engagement Associate Manager. Gabrielle has a business administration, accounting, and banking background. Looking forward to learning more about the HBA and using this position to create the most positive, inclusive, and successful environment for ALL for generations to come! Danielle Trama Director, Global Business Development & Sales Danielle Trama is the Director of Global Business Development & Sales at the Healthcare Businesswomen’s Association. With over 13 years of experience in sales and customer support across both for-profit and non-profit sectors, Danielle brings a wealth of knowledge and expertise to her role. Danielle joined HBA as an Associate Manager, Sales, where she quickly demonstrated her ability to drive results and build strong relationships. Her exceptional performance led to her promotion to Director, Business Development & Sales. In this role, she oversees strategic initiatives to expand HBA’s market presence and supports the organization’s mission to advance women’s leadership roles in the healthcare industry. Throughout her career, Danielle has held various sales and management positions, including Senior Account Executive at Dispensary of Hope, where for 7 years she worked closely with pharmaceutical manufacturers and distributors. She also served as Branch Manager for a staffing agency, where she honed her skills in sales, client relations, and team leadership. Her diverse experience has equipped her with a deep understanding of market dynamics and customer needs. Danielle is passionate about making a difference in people’s lives and supporting them through challenging times. At HBA, she is committed to advancing women’s leadership roles and helping businesses enhance their gender parity initiatives. Danielle holds a Bachelor of Science degree from Middle Tennessee State University. She resides in Colorado Springs, CO, with her husband, two dogs, and two cats. In her spare time, she enjoys hosting family and friends, engaging in DIY projects, and hiking. Anna Treudt, MPH Senior Manager, Corporate Programs Anna joined the HBA in 2024 as Senior Manager, Corporate Programs. She looks to scale the Global Ambassador Program and design meaningful program offerings to its corporate partners as GAP continues to expand. Anna earned a Master of Public Health degree from Northwestern University with an emphasis on public health program evaluation and equitable resource development. Her career background includes launching national standards-based QI programs for healthcare regulators assessing hospitals/healthcare organizations. She has partnered with key health executive innovators across the industry and is focused on driving health equity competencies and building sustainable infrastructure in her work. Anna lives in Chicago, IL and loves traveling, dogs, and training for the Chicago marathon. Brittany Vincent Director of People Brittany Vincent is the Director of People at the Healthcare Businesswomen’s Association, where she leads human resources strategy with a people-first mindset. With a career rooted in driving organizational growth through talent development, Brittany brings a strong track record of coaching leaders, designing impactful training, and fostering inclusive, high-performing cultures. Her approach is both strategic and human-centered—grounded in data, but always focused on the individuals who power an organization. Known for her innovative thinking and deep commitment to people development, Brittany is currently pursuing her doctoral degree in Human Resources, further expanding her expertise in organizational behavior and leadership. Her style is approachable, thoughtful, and collaborative—balancing professionalism with a genuine care for the employee experience. Whether advising on complex workplace challenges or building scalable people strategies, Brittany brings clarity, warmth, and sharp HR acumen to every interaction. Lanesha Whitefield Senior Account Manager, Corporate Partner Engagement Lanesha Whitefield is from Nashville, Tennessee. She is a proud graduate of Middle Tennessee State University. There, she was an active member of Alpha Kappa Psi, Inc. Professional Business Fraternity. After graduating from undergrad with a BA in Business Administration with a focus in Marketing, she relocated to Chicago, IL where she attended Keller Graduate School of Management and received a Master’s in Non-Profit Organization Management. For the last 15 years, she has been an active member in her community, served as a Personal Banker, Fraud Investigator, and a Corporate Account Manager in the Chicago-land area. She is passionate about creating opportunities for youth to thrive in their chosen field and regularly enjoys watching football and track & field. Nancy White Senior Director, Awards & Recognition Nancy White joined the HBA team in early 2017 and serves as Senior Director, Awards & Recognition. In this role, Nancy leads the association’s overall communications strategy with oversight on thought leadership,  signature and awards event brand messaging, media and ally outreach, and social media. She also helps develop and publish HBA brand content, working with HBA’s global leadership and network of volunteers and partners. With more than 30+ years experience, Nancy brings significant public relations and marketing expertise to the HBA. She has worked in similar roles with other globally recognized associations including the American Institute of Architects (AIA), the American Automobile Association (AAA) and SHRM (Society for Human Resource Management). A native of Michigan, Nancy earned her bachelor’s of arts in English from Wayne State University. Interested in Joining the HBA Central Staff Team? If you share our passion for gender parity and health equity, we’d love to have you on board! Explore open positions HBA’s members and Corporate Partners represent a global workforce of more than six million professionals across the healthcare ecosystem. EXPLORE MEMBERSHIP Furthering the advancement and impact of women in the business of healthcare Footer HBA Community HBA Think Tank Career Opportunities Media Center Support Sign up for updates Connect with us Linkedin Instagram Facebook Twitter Youtube Footer Utility Governance Privacy Policy Terms of Use"
    }
  ]
}