{
  "fuentes": [
    {
      "url": "https://www.baiabeachclubmiami.com/press",
      "email": "membership@baiabeachclubmiami.com"
    },
    {
      "url": "https://www.baiabeachclubmiami.com/press",
      "email": "info@baiabeachclubmiami.com"
    },
    {
      "url": "https://www.baiabeachclubmiami.com/membership",
      "email": "membership@baiabeachclubmiami.com"
    },
    {
      "url": "https://www.baiabeachclubmiami.com/membership",
      "email": "info@baiabeachclubmiami.com"
    },
    {
      "url": "https://www.baiabeachclubmiami.com/membership",
      "email": "membership@baiabeachclubmiami.com"
    },
    {
      "url": "https://thevendry.com/venue/162608/baia-beach-club-miami-miami-beach-fl",
      "email": "lpierre@mondriansouthbeach.com"
    },
    {
      "url": "https://thevendry.com/venue/162608/baia-beach-club-miami-miami-beach-fl",
      "email": "sales@mondriansouthbeach.com"
    },
    {
      "url": "https://www.palmtreeclubmiami.com/contact-us",
      "email": "vip@palmtreeclubmiami.com"
    },
    {
      "url": "https://www.palmtreeclubmiami.com/contact-us",
      "email": "boats@palmtreeclubmiami.com"
    },
    {
      "url": "https://www.palmtreeclubmiami.com/contact-us",
      "email": "dining@palmtreeclubmiami.com"
    },
    {
      "url": "https://www.palmtreeclubmiami.com/contact-us",
      "email": "eservations@palmtreeclubmiami.com"
    },
    {
      "url": "https://www.palmtreeclubmiami.com/contact-us",
      "email": "events@palmtreeclubmiami.com"
    },
    {
      "url": "https://www.palmtreeclubmiami.com/contact-us",
      "email": "forms@tambourine.com"
    },
    {
      "url": "https://www.palmtreeclubmiami.com/contact-us",
      "email": "reception@palmtreeclubmiami.com"
    },
    {
      "url": "https://www.palmtreeclubmiami.com/contact-us",
      "email": "reservations@palmtreeclubmiami.com"
    },
    {
      "url": "https://mondrianhotels.com/south-beach-dining/baia-beach-club/",
      "email": "1949membership@baiabeachclubmiami.com"
    },
    {
      "url": "https://mondrianhotels.com/south-beach-dining/baia-beach-club/",
      "email": "membership@baiabeachclubmiami.com"
    },
    {
      "url": "https://www.gmbha.com/board-of-directors/",
      "email": "curtis@gmbha.com"
    },
    {
      "url": "https://www.baiabeachclubmiami.com/our-story",
      "email": "membership@baiabeachclubmiami.com"
    },
    {
      "url": "https://www.baiabeachclubmiami.com/our-story",
      "email": "info@baiabeachclubmiami.com"
    }
  ],
  "mails": [
    "1949membership@baiabeachclubmiami.com",
    "boats@palmtreeclubmiami.com",
    "curtis@gmbha.com",
    "dining@palmtreeclubmiami.com",
    "eservations@palmtreeclubmiami.com",
    "events@palmtreeclubmiami.com",
    "forms@tambourine.com",
    "info@baiabeachclubmiami.com",
    "lpierre@mondriansouthbeach.com",
    "membership@baiabeachclubmiami.com",
    "reception@palmtreeclubmiami.com",
    "reservations@palmtreeclubmiami.com",
    "sales@mondriansouthbeach.com",
    "vip@palmtreeclubmiami.com"
  ],
  "nombre_sitio": "baiabeachclubmiami.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.baiabeachclubmiami.com/press",
      "text": "Press | Baia Beach Club Miami Beach top of page RESERVATIONS RESTAURANT POOL SPA MEMBERS LOG IN Press DECEMBER, 22 2020 Ocean Drive Magazine Celebrates the December Edition of “The List” at Baia Beach Club at Mondrian South Beach READ MORE DECEMBER, 18 2020 The 50 Best Places to Travel in 2021 ​ ​ READ MORE DECEMBER, 14 2020 Hospitality Roundup: Baia Beach Club Opens at Mondrian South Beach ​ READ MORE DECEMBER, 8 2020 Get Ready for Great Sunsets: This Waterfront Beach Club in Miami Beach Is Opening ​ READ MORE DECEMBER, 8 2020 Get Ready for Great Sunsets: This Waterfront Beach Club in Miami Beach Is Opening ​ READ MORE ​1100 WEST AVE, MIAMI BEACH, FL 33139     |     (305) 514-1949 MEMBERSHIP@BAIABEACHCLUBMIAMI.COM CONTACT PLAN YOUR EVENT CAREERS STAY IN THE KNOW ACCESSIBILITY LEGAL COPYRIGHT 2020 BAIA BEACH CLUB CREDITS bottom of page"
    },
    {
      "url": "https://www.baiabeachclubmiami.com/membership",
      "text": "Membership | Baia Beach Club top of page RESERVATIONS RESTAURANT POOL SPA MEMBERS LOG IN Membership Membership Details: Baia Beach Club, featuring bayside indoor/outdoor restaurant & bars (15% discount on food & beverage. Tuesdays from 6pm until 10pm, 50% discount on all food & beverage) Member may bring up to 1 guest on weekends and holidays or 3 guests on weekdays. Blackout dates apply Resort pool with complimentary chaises, umbrellas, and towels Pool cabanas available for daily rental (15% discount) State-of-the-art fitness center and complimentary classes: yoga, meditation, mindfulness, deck bootcamp Full-service spa with sauna, steam and treatment rooms (15% discount on all services and retail items + annual $150 spa credit) Curated club programing focusing on food & wine, music & entertainment, fashion, art, culture, and fitness & wellness Jet skis (15% discount) Paddle boards and kayaks (complimentary) ​ Boat dockage (complimentary for the first 4 hours) Special members’ rate of 15% off best available rate on hotel rooms (upgrades based on availability) Special pricing on social events (15% discount) Invitations to Exclusive Member-Only Events Complimentary High-Speed, Wireless Internet Access throughout the Property Valet Parking (Weekdays- $5 for the first 4 hours, $5 for each additional hour. Weekends-$10 for the first 4 hours, $5 for each additional hour) For more information, please email membership@baiabeachclubmiami.com APPLY NOW ​1100 WEST AVE, MIAMI BEACH, FL 33139     |     (305) 514-1949 MEMBERSHIP@BAIABEACHCLUBMIAMI.COM CONTACT PLAN YOUR EVENT CAREERS STAY IN THE KNOW ACCESSIBILITY LEGAL COPYRIGHT 2020 BAIA BEACH CLUB CREDITS bottom of page"
    },
    {
      "url": "https://thevendry.com/venue/162608/baia-beach-club-miami-miami-beach-fl",
      "text": "Baia Beach Club Miami - Mediterranean Restaurant in Miami Beach, FL | The Vendry by by Search Inspiration Circles Log In Sign Up Overview Spaces Press Nearby Hotels Baia Beach Club Miami Restaurant 1100 West Ave, Miami Beach, FL 33139, USA Baia Beach Club Miami 1100 West Ave, Miami Beach, FL 33139, USA Request Pricing Cuisine Type Mediterranean # of Spaces 8 Capacity Max Seated: 130 Max Standing: 150 Baia Beach Club is a unique waterfront social dining and private event venue in Miami, offering a variety of indoor / outdoor spaces ideal for private events and group gatherings. We offer a range of group dining menus and beverage packages that can be customized to meet your needs. Below is an at-a-glance look at our private dining rooms. Show more Show more Request Pricing 1100 West Avenue, Miami Beach, FL Show on the map Spaces Baia Indoor Dining and Terrace Max Seated: 80 Max Standing: 150 Baia Outdoor Terrace Max Seated: 32 Max Standing: 50 Baia Indoor Dining Max Seated: 48 Max Standing: 50 The Deck Max Seated: 130 Max Standing: 150 The Lounge Max Standing: 120 Sunset Bar & Terrace Max Seated: 130 Max Standing: 150 Baia Indoor Dining and Terrace Max Seated: 80 Max Standing: 150 Baia Outdoor Terrace Max Seated: 32 Max Standing: 50 Baia Indoor Dining Max Seated: 48 Max Standing: 50 The Deck Max Seated: 130 Max Standing: 150 The Lounge Max Standing: 120 Sunset Bar & Terrace Max Seated: 130 Max Standing: 150 The Green House Max Seated: 30 Max Standing: 50 The Private Dining Room Max Seated: 8 Show more Press Thrillist The Secret to Getting Into Miami’s Most Exclusive Members-Only Clubs Mar 21, 2024 Forbes Miami Spice 2023: Where To Eat From August 1 To September 30 Jul 12, 2023 Time Out 15 Best Miami Waterfront Bars For Stunning Views May 19, 2022 Thrillist The Secret to Getting Into Miami’s Most Exclusive Members-Only Clubs Mar 21, 2024 Forbes Miami Spice 2023: Where To Eat From August 1 To September 30 Jul 12, 2023 Time Out 15 Best Miami Waterfront Bars For Stunning Views May 19, 2022 Do you work for Baia Beach Club Miami ? Contact us to learn more about who's managing this profile or gain access. Other Venues in Miami Beach for Your Event Miami Beach Event Spaces Miami Beach Performance Spaces Miami Beach Hotels Miami Beach Restaurants Miami Beach Convention Centers Miami Beach Boats / Yachts Miami Beach Stadiums Miami Beach Museums / Galleries Miami Beach Movie Theaters Miami Beach Bars / Clubs Miami Beach Private Clubs Miami Beach Breweries / Distilleries Miami Beach Coworking Spaces Miami Beach Banquet Halls Miami Beach Aquariums / Zoos Miami Beach Cultural Centers Miami Beach Corporate Offices Miami Beach Private Group Activites Miami Beach Historic Buildings Miami Beach Golf Courses Miami Beach Photo Studios Miami Beach Public Spaces Miami Beach Event Spaces Miami Beach Performance Spaces Miami Beach Hotels Miami Beach Restaurants Miami Beach Convention Centers Miami Beach Boats / Yachts Miami Beach Stadiums Miami Beach Museums / Galleries Miami Beach Movie Theaters Miami Beach Bars / Clubs Miami Beach Private Clubs Miami Beach Breweries / Distilleries Miami Beach Coworking Spaces Miami Beach Banquet Halls Miami Beach Aquariums / Zoos Miami Beach Cultural Centers Miami Beach Corporate Offices Miami Beach Private Group Activites Miami Beach Historic Buildings Miami Beach Golf Courses Miami Beach Photo Studios Miami Beach Public Spaces by The community and marketplace for event pros. Join Us List My Business The Vendry Organizations The Memo About the Vendry Contact Us Groupize Keep me posted with industry news, cool case studies, and events. Your email address Subscribe © 2025 THE VENDRY LLC. Privacy Terms & Conditions Terms of Use"
    },
    {
      "url": "https://www.palmtreeclubmiami.com/contact-us",
      "text": "Contact Us | Palm Tree Club Miami Skip to Content Palm Tree Club Miami (305) 865-7100 Rooms & Suites Offers Live Events Restaurant Happenings Our Neighborhood Gallery About Us Book Now Connect With Palm Tree Club Let’s Hear From You! Palm Tree Club Miami 1819 79th Street Causeway North Bay Village, FL 33141 Hotel Phone: 305-865-7100 Front Desk Inquiries: reception@palmtreeclubmiami.com Reservations: r eservations@palmtreeclubmiami.com Restaurant Phone: 786-204-1366 Email: dining@palmtreeclubmiami.com Marina Email: boats@palmtreeclubmiami.com Radio Channel: #71 Live Events Email: VIP@palmtreeclubmiami.com Thank you for reaching out! We will be in touch shortly. First Name * Last Name * Email Address * Comments Privacy Policy agreement I have read and agree to the Privacy Policy . Yes, I would like to receive emails with exclusive specials and offers. Submit FREQUENTLY ASKED QUESTIONS Live Music & Events What time does the live music start? Doors open at 3 PM. Is there a cover charge for guests to enjoy the live music? Only for ticketed events. Get your tickets on Posh: https://posh.vip/g/ptc-miami . Do I need a reservation to see the live music? Not unless it's a ticketed event. How long does the live music performance last? Sunset parties typically go until 12 AM. Is the music indoors or outdoors? Both. Do you have a schedule or calendar for upcoming live music performances? Yes! Be sure to check our socials and website for more details: www.palmtreeclubmiami.com . Do you offer special deals or promotions? For offers and experiences, check our OpenTable: Palm Tree Club Miami Restaurant - North Bay Village, FL | OpenTable . Are there specific days or nights dedicated to live music? Typically Saturdays and Sundays, but please check our website for more details! What time will the DJs perform at the events we've published? Stay tuned to our social media for updates on set times. What’s the dress code for events? Come as you are—sneakers, flip-flops, heels, sequins, or bikini tops. Feel free to wear jeans, shorts, or even your suit (but we hope you lose the tie). Hotel General Information Is there a minimum age to check in? Yes, guests must be 21 years or older to check-in and will be required to present a valid photo ID, in addition to their method of payment. What time is check-in and check-out? Check-in time: 4pm Check-out time: 11am Can I check in early or check out late? Early check-in or late check-out may be available upon request, subject to availability. Please contact the front desk for more information. How late can I check-in? Our front desk is available 24 hours. What is required to check-in? Guests must be 21 years or older to check in and will be required to present a valid photo ID in addition to their method of payment. Is parking available at the hotel? Yes, complimentary on-site parking is available for all hotel guests. Can I store my luggage before or after I check out? Yes, complimentary luggage storage is available at our Front Desk. Is the hotel accessible for guests with disabilities? Yes, we have accessible rooms, ramps, and elevators for your convenience. Please inform us of any specific needs prior to your arrival. Are there any extra charges or resort fees? $20 plus taxes Resort Fee is applied to all reservations. Is the hotel pet-friendly? Yes. A non-refundable $100 pet fee applies. Room and Facilities Do the rooms include complimentary Wi-Fi? Yes, free Wi-Fi is available in all rooms and public areas of the hotel. When will my room be cleaned, and how do I request additional items? Your room will receive full cleaning service every third day of your stay. For any requests, such as extra towels or amenity refills, please contact the Front Desk at any time. Are there any amenities in the rooms? Our rooms come with air conditioning, a flat-screen TV, minibar, safe, Bluetooth speaker, hair dryer, and ironing board. Check the room description for specific details. Do you have accessible rooms? We offer three accessible room types - our Accessible Classic King and Accessible Classic Double, Accessible Deluxe King. For more specifics, check out our Accessibility page. Is there a smoking policy in the hotel? Our hotel is smoke-free, and smoking is only allowed in designated areas. Please ensure compliance with our smoking policy. A $250 cleaning fee will be applied if any odor is found in the room. Do you offer breakfast? Brunch begins at 11am. Do you have a restaurant or bar on-site? Yes, we have Palm Tree Club Miami Restaurant. Open daily, our restaurant serves up coastal-American food in a casual dining environment, with all your favorites & Miami’s best sunset views! Do you offer laundry and dry cleaning services? Yes, laundry and dry cleaning services are available. Booking and Payments Does the hotel accept traveler’s checks as payment? No, we do not accept traveler’s checks as payment. Does the hotel require any deposit at check in? Yes, at check-in, we require a $150 incidental deposit per stay, in addition to the room and tax charges. This is just a hold on the credit card. If the guest doesn’t incur any incidentals or make any purchases during their stay, the hold will be released within 5 to 7 business days after check-out. Does the hotel require any deposit prior to checking in? Pre-stay deposits are dependent upon the rate plan reserved. What type of credit cards are accepted at the hotel? MasterCard, Visa, American Express, and Discover are all accepted. What is your cancellation policy? Cancellation policy depends on the reservation rate booked. We offer rates with a refundable reservation up to 72 hours before arrival, as well as discounted non-refundable rates. Can I book directly on your website? Yes, we recommend booking directly through our website for the best rates and special offers. Can I modify or cancel my reservation after booking? Cancellation/Modification policy depends on the reservation rate booked. We offer rates that may be cancelled or modified up to 72 hours before arrival, as well as discounted non-refundable rates that do not allow cancellations or modifications. Special Requests and Policies Can I send a package to the hotel? Yes, we’re happy to accept packages prior to your arrival. Please be sure that the name of the registered guest is included in the delivery information and be sure to use our Security/Receiving address: 1819 79th Street Causeway North Bay Village, FL 33141 Can I request special accommodations or amenities (e.g., flowers, champagne, etc.)? Yes, we can arrange special requests for a fee. Please contact us ahead of time to ensure availability. Do you offer shuttle service to the airport? We do not offer this service directly, however, our concierge services may assist in making a shuttle reservation with a 3rd party company. Additional Services Can I book tours or activities through the hotel? Yes, we’d be happy to assist with booking. Please stop by the front desk to inquire about available options. Our concierge team can also help with making reservations. Do you have a gym or fitness center? Yes, we have a brand-new fitness center, and it’s open 24 hours a day for your convenience! Reservations & Ticketing How can I contact the restaurant if I have further questions? You can reach us at 786-204-1366 or email us at dining@palmtreeclubmiami.com . Will there be commissions for promoters who refer clients? For more information, email VIP@palmtreeclubmiami.com . Contact Information How can I contact the hotel if I have further questions? You can reach us at 305-865-7100 or email us at reception@palmtreeclubmiami.com . Our team is available 24/7 to assist you. Join the Crew Thank you for your interest. Hidden Field First Name Last Name Email Address Privacy Policy agreement I have read and agree to the Privacy Policy . Yes, I would like to receive emails with exclusive specials and offers. Submit Palm Tree Club Miami Palm Tree Club Miami 1819 79th Street Causeway                        North Bay Village, FL                         33141 HOTEL: (305) 865-7100 reception@palmtreeclubmiami.com reservations@palmtreeclubmiami.com RESTAURANT: (786) 796-0846 dining@palmtreeclubmiami.com MARINA: boats@palmtreeclubmiami.com Radio Channel: #71 LIVE EVENTS & PRIVATE TABLES: VIP@palmtreeclubmiami.com events@palmtreeclubmiami.com Our hotel properties include Palm Tree Hotel, Palm Tree Crew Hotel, and Palm Tree Club, all operating under the Palm Tree Crew umbrella. facebook instagram pinterest Contact & FAQs Palm Tree Club Miami  2025. All Rights Reserved Accessibility Privacy Policy Sitemap Consent Preferences Hotel Web Design by close"
    },
    {
      "url": "https://mondrianhotels.com/south-beach-dining/baia-beach-club/",
      "text": "Baia Beach Club | Mondrian Hotels Skip to content Home South Beach Dining Baia Beach Club Hotel Suites Wellness Dine & Drink Meetings & Gatherings Offers Hotels Dis-loyalty Offers EN what Back EN English Français Español 简体中文 繁體中文 한국어 BOOK Hotels Abu Dhabi (Coming 2025) Bordeaux Les Carmes Cannes Doha Gold Coast (Now Open) Hong Kong Ibiza Los Angeles Maldives (Coming 2026) Mexico City Condesa Seoul Itaewon Singapore Duxton South Beach Hotel Suites Wellness Dine & Drink Meetings & Gatherings Offers MONDRIAN SOUTH BEACH Inspired by the laid-back bohemian energy, casual chic and welcoming multicultural spirit of the Mediterranean, Baia Beach Club is a world-class destination of its own, ready for you to experience right here, right now. REserve A TABLE HOURS Daily | 7:00 am – 8:00 pm LOCATION 1100 West Ave, Miami Beach, Florida 33139 CONTACT +1 305 514 1949 membership@baiabeachclubmiami.com WATERFRONT DINING Baia Beach Club is your premier waterfront dining destination with day-to-night eats on the waterfront deck, dock and dining options for those cruising by boat, and a full-service bar to connect over coffee in the morning or socialize with cocktails in the evening. Breakfast: 7:00am – 11:00am Lunch: Monday – Saturday; 12:00pm – 3:30pm Brunch: Saturday & Sunday: 11:00am – 3:00pm Dinner: Sunday – Thursday : 5:00pm – 10:00pm; Friday & Saturday: 5:00pm – 10:30pm Our Menus OPEN-AIR RESTAURANT Experience our indoor restaurant, a sophisticated and welcoming atmosphere that redefines the casual dining room experience. Designed with sliding glass doors to connect to the Baia outdoor terrace, converting the space to an open-air dining room and filling the space with natural light and breeze. 360 Tour Dock at Baia Beach Club Situated on the waterfront of Biscayne Bay, Baia Beach Club offers direct marina access and unbelievable panoramic views of Downtown, Miami. Guests can conveniently dock & dine, reserve a waterfront cabana, daybed, or bungalow, and take advantage of a full array of water sports equipment rentals, available daily. More Information Instagram Facebook LinkedIn Cookie Settings Terms and Policies Develop With Us Careers California Collection Notice Mondrian Residences EN Français Español 简体中文 繁體中文 한국어 Ennismore logo Ennismore © Ennismore 2025 Make a Booking Close Please fill in the following required field(s): Check Availability"
    },
    {
      "url": "https://www.gmbha.com/board-of-directors/",
      "text": "Board of Directors - Greater Miami and the Beaches Hotel Association (GMBHA) Skip to content Menu Home About Us Board of Directors Government Affairs Sustainability & Wellness Council Sponsorship Opportunities Contact Us Membership Member Login Member Benefits Hotel Application Allied Application Allied Upgrade Application Directory Blog Events Photo Gallery 2024 Hospitality Leadership Awards 2024 Inn Key Awards Photo Gallery Archives Webinar Recordings/Data Hospitality Resources Spring Break 2024 Diversity Equity and Inclusion Travel Guidelines Member Resources Allied Upgrade Promos Allied Promos Hurricane Preparedness Human Trafficking Training Research & Statistics Media/Press Room eNewsletter Archives News & Updates Board of Directors Our Board of Directors is comprised of 35 Hoteliers and 16 Allied members, voting members, past chairs and non-voting members. The hoteliers represent Miami, Miami Beach, Downtown Miami, Brickell, Miami Airport, Coral Gables, Coconut Grove, South Dade and North West Dade. Executive Board of Directors Amir Blattner Chairman of the Board General Manager Hyatt Regency Miami Amir Blattner Expand HYATT REGENCY MIAMI GENERAL MANAGER Mr. Blattner is a thirty year hotel veteran with a proven track record that produces brand experiences and stakeholder value for the hotel industry. In his current role as general manager, Mr. Blattner is responsible for leading all aspects of the Hyatt Regency Miami. Amir embarked on his hospitality journey in 1995 as a hotel operator at the Hyatt Regency Coral Gables, where he soon discovered his passion for the industry.Â  Hyatt soon recognized Amirâs talent and recruited him as a Corporate Management Trainee. Throughout his career, Amir held several leadership roles in various Hyatt hotels including a Director of Rooms position at Hyatt Regency Dearborn, Grand Hyatt Washington, Hyatt Regency Chicago and Hyatt Regency Baltimore, where he earned the Hyatt Hotels and Resorts Director of Rooms Award in 2011. In January of 2017, he was promoted to General Manager for the Hyatt Regency Louisville and soon after promoted to General Manager for the Hyatt Regency Savannah. During his time in Savannah, he was recognized in 2018 as General Manager of the Year with the Georgia Lodging & Hotel Association. Amir received a Bachelor of Science degree in Hospitality Management from Florida International University and a Masters in International Business from Nova Southeastern University. South Florida is home to Amir since relocating from Israel with his parents.Â  In his free time he enjoys volunteering at Camillus House, spending time with his wife, Claudia, and their two children, Jacob and Gabriella. As the new Chair of the Greater Miami & The Beaches Hotel Association, Amir said â I am thrilled for the opportunity to help promote our allied and allied upgrade membersâ interests and support our vibrant hotel industry leaders.â David Healy Treasurer Vice President & General Manager Miami Lakes Hotel David Healy Expand SHULA'S HOTEL & GOLF CLUB, GENERAL MANAGER VICE PRESIDENT & GENERAL MANAGER I was in Jersey and 13 at the time that I had my first experience in the hospitality industry. The parents of a good friend of mine hired me for the summer to work in their Italian restaurant washing dishes. We were paid cash every night and we ate very well, I thought at that time what could be better. I really appreciate the opportunity to serve on the GMBHA Board of Directors. It affords me the chance to stay in touch on the relevant issues that affect our industry while having access to a pipeline of distinguished professionals with which to collaborate on issues and ideas with. I think the GMBHA does a wonderful job promoting, growing, and being the voice of the hospitality industry for Miami while being at the forefront of exceptional programs such as the Inn Key Awards which honor the best employees in our industry. Raj Singh Past Chair General Manager Sea View Hotel Raj Singh Expand SEA VIEW HOTEL GENERAL MANAGER TREASURER First job in the hospitality industry was at Hotel Zimmer in Zell Am See, Austria, where I worked in the kitchen as a line cook and a waiter in the evening. I have enjoyed serving on the GMBHA over 10 years. Our industry has a strong voice to enhance how we conduct business locally, statewide and nationally. It is a pleasure to be involved with all its members. Peggy Benua Hospitality Professional GMBHA Executive Board Peggy Benua Expand GENERAL MANAGER IMMEDIATE PAST CHAIR After graduating from FIU with a Masters in Hotel and Food Service Administration, my career took me to other markets including San Diego, Los Angeles and Dallas. Ten years after graduation, an opportunity arose to come back to the Miami market to work at the Eden Roc. I now consider Miami my professional and personal home. The Hotel Association is a big part of why I love this community. Membership in GMBHA is what brings us together as professionals and friends, offering a support system that is rare in other hotel markets. I highly recommend that industry members and partners join the GMBHA to take advantage of the many opportunities to connect with others. Scott Berman Industry Leader Hosp.& Leisure PwC (retired) Scott Berman Expand PRICEWATERHOUSE COOPERS LLPTT PRINCIPAL, INDUSTRY LEADER HOSPITALITY & LEISURE At age 19, I worked in the front office at the Hyatt Regency in Baltimore. As a hospitality professional who leads a national consulting practice, serving on the GMBHA Board gives me a chance to connect with my fellow hoteliers locally and take the pulse of the lodging industry in my backyard. They say politics is local, and so is hospitality. I am privileged to serve with a core group of dedicated and passionate professionals. Mildred Riscigno General Manager JW Marriott Miami Mildred Riscigno Expand JW Marriott Miami General Manager Florencia Tabeni COO MDM Hotel Group Florencia Tabeni Expand MDM HOTEL GROUP CHIEF OPERATING OFFICER I started as Sales & Marketing Assistant Being part of the GMBHA Board means I have been entrusted with representing our members interests with regard to the welfare of our industry. An industry that drives significant economic value to the city and region and defines much of what Miami is to the global community. As hoteliers we have enormous responsibility to create an experience that is exceptional for all or our guests and in order to do that we work together to create a business environment conducive to that goal. So itâs exciting to be a Board member where I can be a productive part of insuring the long term health of the tourism industry in Miami. Julissa Kepner General Manager Miami Marriott Biscayne Bay Julissa Kepner Expand Miami Marriott Biscayne Bay General Manager Suzanne Amaducci-Adams Real Estate Practice Group Leader Bilzin Sumberg Suzanne Amaducci-Adams Expand BILZIN SUMBERG REAL ESTATE PRACTICE GROUP LEADER What was your first job in hospitality? My first job in the business was working Â a summer job at the front desk of a 4 diamond hotel when I was only Â 16.Â Â  When I was interviewed for the job the office manager asked what grade I was in -- I said a junior-- she thought college and I was in high school. She did not figure it out until half way through the Â summer.Â  I worked there all through high school and college. What does being on the board mean to you? I want to be on the board to help promote the industry and get to know all the local business people. Â Â The hospitality industry is a key driver of the south Â Florida economy.Â  Working together I think we can d a lot to promote the industry and the economy. Chris Rollins President CR Development/CR Construction Chris Rollins Expand CR Development / CR Construction President Jaime Stuyck Secretary Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Director of Hotel OperationsÂ  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Mr. C's Hotels & Residences Jaime Stuyck Expand Â  Â  Â  Â  Â  Â  Â  Â  Mr. C's Hotels & ResidencesÂ  Â  Â  Â  Â  Â  Â  Â  Â Director of Hotel Operations Mutlu Kucuk Complex Managing Director Loews Miami Beach Hotel Mutlu Kucuk Expand Loews Miami Beach Hotel Complex Managing Director Julie Grimes Managing Partner Doubletree Grand by Hilton Julie Grimes Expand HILTON BENTLEY MIAMI/ SOUTH BEACH HOTEL OWNERâS REP Mary Rogers Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Executive Vice PresidentÂ  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Hospitality Operations Turnberry Mary Rogers Expand Turnberry Executive Vice President Hospitality Operations Board of Directors Glenn Sampert General Manager InterContinental Miami Glenn Sampert Expand INTERCONTINENTAL MIAMI GENERAL MANAGER Samuel Sutter Vice President & Hotel Manager Fontainebleau Miami Beach Samuel Sutter Expand Fontainebleau Miami Beach Vice President & Hotel Manager Jared Galbut Managing Principal MENIN Hospitality Jared Galbut Expand MENIN HOSPITALITY MANAGING PRINCIPAL Rick Ueno General Manager W South Beach Rick Ueno Expand W South BeachÂ General Manager Trump National Doral Miami Expand TRUMP NATIONAL DORAL MIAMI GENERAL MANAGER Said Haykal General Manager Faena Miami Beach Hotel Said Haykal Expand Faena Miami Beach Hotel General Manager Nikolay Hotze Managing Director & General Manager Nobu Eden Roc Nikolay Hotze Expand ACQUALINA RESORT & RESIDENCES GENERAL MANAGER Brian Vujnovic VP & Director of Operations Robert Finvarb Companies Brian Vujnovic Expand ROBERT FINVARB COMPANIES VP & DIRECTOR OF OPERATIONS Florencia Rotemberg General Manager JW Marriott Marquis Florencia Rotemberg Expand JW MARRIOTT MARQUIS GENERAL MANAGER Ray Valentino Vice President, Hotel Operations Hilton Miami Downtown & Resorts World Bimini Ray Valentino Expand HILTON MIAMI DOWNTOWN & RESORTS WORLD BIMINI VICE PRESIDENT, HOTEL OPERATIONS Paul Lowenthal Vice President Business DevelopmentÂ  Pinnacle Live Paul Lowenthal Expand PINNACLE LIVE VICE PRESIDENT BUSINESS DEVELOPMENT Clavel Jacques-Louis General Manager Embassy Suites Miami International Airport Clavel Jacques-Louis Expand EMBASSY SUITES MIAMI INTERNATIONAL AIRPORT GENERAL MANAGER My first job in the hospitality industry was being a busser and prep cook at the Melting Pot restaurant right after graduating from high school. I have fallen in love with the industry since. Being a member of the board grants me the opportunity to make a difference in the community that we are a part of and to make the voice of the Miami Intâl Airport area hotels heard for the betterment of all stakeholders. Steve Boucher Owner Boucher Brothers, Inc. Steve Boucher Expand BOUCHER BROTHERS, INC. OWNER Alexina Beauperthuy General Manager Marriott Stanton South Beach Alexina Beauperthuy Expand MARRIOTT STANTON SOUTH BEACH GENERAL MANAGER Ericka Nelson General Manager EPIC Miami, a Kimpton Hotel Ericka Nelson Expand EPIC MIAMI, A KIMPTON HOTEL GENERAL MANAGER Haytham Said General Manager Four Seasons Hotel Miami Haytham Said Expand FOUR SEASONS HOTEL MIAMI GENERAL MANAGER Virginia Sanchez Regional Director, Gvt Affairs American Airlines Virgnia Sanchez Expand AMERICAN AIRLINES Regional Director, Government Affairs Constantino Papadopulos Founder Hygge Hospitality Constantino Papadopulos Expand HYGGE HOSPITALITY FOUNDER Joe Pasterkiewicz VP of Event Infrastructure Services Encore Joe Pasterkiewicz Expand Encore VP of Event Infrastructure Services John Sullivan Market Vice President, Luxury, U.S. East Marriott John Sullivan Expand MIAMI BEACH EDITION Market Vice President, Luxury, U.S. East Expand Past Chairs Matthias Kammerer Florencia Tabeni Robert Hill Alex Tonarelli David Healy Peggy Benua Raj Singh Tim Nardi Kimberly Wilson Charlie Hines Juan Romero Mike Furcht Doug Rodibaugh Eric Jacobs Rick Hancock Chair Emeritus Eric Jacobs ,Â Vice President, On Stream Media Ex Oficio David Whitaker President & CEO Greater Miami Convention & Visitors Bureau Rolando Aedo Chief Operating Officer Greater Miami Convention & Visitors Bureau Rocco Angelo Associate Dean & E.M. Statler Professor FIU Chaplin School of Hospitality & Tourism Mgt. Michael Cheng Dean FIU Chaplin School of Hospitality & Tourism Mgt. Gregory Bohan Instructor/Special Projects Florida Atlantic University Freddie Peterson General Manager Miami Beach Convention Center Grisette Roque Marcos Executive Director Miami Beach Visitor & Convention Authority Shelly Fano Director of Hospitality Mgt Program Miami-Dade College Hospitality Institute Ralph Cutie Director & CEO Miami-Dade Aviation Department Hydi Webb Director PortMiami Ibis Romero Executive Director Sunny Isles Beach Tourism & Marketing Council © 2025 Greater Miami and the Beaches Hotel Association (GMBHA) | Site by GrowthZone Get In Touch! 305 531 3553 1172 S. Dixie Highway, Suite 214 Coral Gables, FL 33146 Curtis@gmbha.com Additional Resources Privacy Policy Member Login Stay Connected! © Greater Miami and the Beaches Hotel Association (GMBHA). All Rights Reserved | Site by GrowthZone Scroll To Top"
    },
    {
      "url": "https://www.baiabeachclubmiami.com/our-story",
      "text": "Our Story | Baia Beach Club Miami top of page RESERVATIONS RESTAURANT POOL SPA MEMBERS LOG IN Your New Living Room on the Beach Baia Beach Club brings the effortless sophistication of international coastal living to the new and reimagined Mondrian South Beach. Inspired by the laid back bohemian energy, casual chic, and welcoming multicultural spirit of Mediterranean Coastal Living, Baia Beach Club is a world-class destination of its own, ready for you to experience right now. ​ Baia Beach Club culls together elevated, authentic food and beverage offerings, private dining experiences and immersive social activities to create a truly modern oasis of taste and tranquility in the heart of Miami. ​ In addition to Miami’s newest waterfront dining destination, memberships are available for Baia Beach Club. Within the lush tropical centerpiece of the multi-million-dollar property-wide transformation, club members can indulge in the naturally seamless blend of indoor and outdoor space, public and private areas, progressive health and wellness services, and recreational and restorative facilities for a truly singular experience that is as chic as it is casual - available to enjoy from early morning into the late night. Baia Beach Club offers a unique blend of the elevated and organic on the Biscayne Bay waterfront, for a singular experience that is both relaxing and indulgent. Whether by arranging an exclusive dinner or setting you up for a day on the water, our staff will curate your visit with outstanding, personalized service. Let us take care of whatever you may need, while you lay back and enjoy our stunning bay vistas. ​ Welcome to your new living room on the beach. ​ Take off your shoes and get comfortable. ​1100 WEST AVE, MIAMI BEACH, FL 33139     |     (305) 514-1949 MEMBERSHIP@BAIABEACHCLUBMIAMI.COM CONTACT PLAN YOUR EVENT CAREERS STAY IN THE KNOW ACCESSIBILITY LEGAL COPYRIGHT 2020 BAIA BEACH CLUB CREDITS bottom of page"
    }
  ]
}