{
  "fuentes": [
    {
      "url": "https://www.reachbaja.com/contact-us/",
      "email": "info@reachbaja.com"
    },
    {
      "url": "https://tacoslupita.com/contactus",
      "email": "info@tacoslupita.com"
    },
    {
      "url": "https://lazonamuerta.net/contact/",
      "email": "dj_convoy@lazonamuerta.blog"
    },
    {
      "url": "https://www.tacobellnewyorkcity.com/contactus",
      "email": "info@tacobellnewyorkcity.com"
    },
    {
      "url": "https://events.miami.edu/event/betsy_atkins_ceo_and_founder_of_baja_corporation_and_lisa_a_hook_former_president_and_ceo_of_neustar_5235",
      "email": "ecms@miami.edu"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "https://www.salsalitotacoshop.com/about-us",
      "email": "info@salsalitotacoshop.com"
    },
    {
      "url": "https://whiterestaurants.com/taco-bell/",
      "email": "info@whiterestaurants.com"
    },
    {
      "url": "https://whiterestaurants.com/taco-bell/",
      "email": "brian@whiterestaurants.com"
    },
    {
      "url": "https://whiterestaurants.com/taco-bell/",
      "email": "info@whiterestaurants.com"
    },
    {
      "url": "https://whiterestaurants.com/taco-bell/",
      "email": "jkelley@whitemgtcorp.com"
    },
    {
      "url": "https://whiterestaurants.com/taco-bell/",
      "email": "tdailey@whitemgtcorp.com"
    },
    {
      "url": "https://whiterestaurants.com/taco-bell/",
      "email": "tfountain@whitemgtcorp.com"
    },
    {
      "url": "https://whiterestaurants.com/taco-bell/",
      "email": "thanson@whitemgtcorp.com"
    }
  ],
  "mails": [
    "brian@whiterestaurants.com",
    "dj_convoy@lazonamuerta.blog",
    "ecms@miami.edu",
    "info@reachbaja.com",
    "info@reception-plus.de",
    "info@salsalitotacoshop.com",
    "info@tacobellnewyorkcity.com",
    "info@tacoslupita.com",
    "info@whiterestaurants.com",
    "jkelley@whitemgtcorp.com",
    "tdailey@whitemgtcorp.com",
    "tfountain@whitemgtcorp.com",
    "thanson@whitemgtcorp.com"
  ],
  "nombre_sitio": "bajatacocrescent.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.reachbaja.com/contact-us/",
      "text": "Contact Us – Reach Baja | Extiendo del Mano Home Trips About Us Contact Us Meet The Team Projects Hope Village Hope Center Camp Hope Donate Give Money Give Time Give Stuff Donate Car Donate Real Estate Donate Aircraft Donate Boat Donate Items Gift Annuities Sponsor Hope Village Hope Village Special Projects Search Menu Menu We are easy to get in touch with. You can call us, text us, DM us on social media, or use the contact form on the right to give your contact info. We do travel a lot, sometimes with our entire staff, so it can mean an extended wait for us to get back to you sometimes. Also, sometimes things can get lost in the mix, so if you do not hear back, use another method to reach out. We are good at getting back to you, but not perfect. Also, check our staff page to contact individual staff members. CONTACT US Just reach out and we’ll get back to you as soon as we can. We have locations in: San Quintin, Baja California, Mexico El Transito, Nicaragua, Central America Ndola, Zambia, Africa Our U.S. headquarters are in Sacramento, California Location: 5449 E Levee Road, Sacramento, Ca, 95835 Phone: 707.333.9089 (Office Manager, Tanya Devoll Mobile phone) Email: info@reachbaja.com Use the form to the right Social: instagram.com/reachbajainsta facebook.com/Reachbaja Non-profit information: ReachBaja is a part of The Reach Group, a California Non-profit Corporation. All donations are tax-deductible. What can we help you with? * indicates required First Name * Last Name * Phone Number Phone Type Mobile Office Home Email Address * What can we help you with? * How do you want us to contact you? email phone text Scroll to top"
    },
    {
      "url": "https://tacoslupita.com/contactus",
      "text": "Contact Us | Tacos Lupita Tacos Lupita . Home Locations Menu Events About Gallery Contact Sign in Tacos Lupita . Home Locations Menu Events About Gallery Contact +1 555-555-5556 Sign in Contact Us Contact us Contact us about anything related to our company or services. We'll do our best to get back to you as soon as possible. Name * Phone Number Email * Company Subject * Question * Email To Submit My Company 3575 Fake Buena Vista Avenue +1 555-555-5556 info@yourcompany.example.com Address Haverhill 162 River St, Haverhill, MA 01832 North Lawrence 505 Broadway, Lawrence, MA 01841 South Lawrence 499 So. Broadway Lawrence, MA 01843 Lowell 124 University Ave, Lowell, MA 01854 Contact Haverhill: 978.656.8750 North Lawrence: 978.681.4517 South Lawrence: 978.655.3714 Lowell: 978.656.8750 Email: info@tacoslupita.com Opening Hours Haverhill Monday: Closed Tues-Sun : 10AM - 9PM North Lawrence Monday: Closed Tues-Sun : 10AM - 9PM South Lawrence Monday: Closed Tues-Sun : 10AM - 9PM Lowell Sundays: Closed Monday  -  Saturday :  10AM - 9PM Follow Us Copyright © tacoslupita.com Powered by vdroidusa.com"
    },
    {
      "url": "https://lazonamuerta.net/contact/",
      "text": "Contact – La Zona Muerta La Zona Muerta Blog About Contact Home Contact Don’t hesitate to reach out with the contact information below, or send a message using the form. Get in Touch dj_convoy@lazonamuerta.blog DeviantArt YouTube Send Us a Message Go back Your message has been sent Name (required) Warning Email (required) Warning Website Warning (required) Warning Warning. Submit Δ Like Loading… Designed with WordPress Subscribe Subscribed La Zona Muerta Sign me up Already have a WordPress.com account? Log in now. La Zona Muerta Subscribe Subscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar %d"
    },
    {
      "url": "https://www.tacobellnewyorkcity.com/contactus",
      "text": "Contact Home Menu Careers Contact Home Menu Careers Contact TACO BELL NEW YORK CITY Address: 1503 Lexington Avenue New York, NY 10029 (Corner of Lexington & E. 97th Street) Phone: (646) 362 - 3400 Email: info@tacobellnewyorkcity.com Hours of Operation: Monday: 7:00AM - 12:00AM Tuesday: 7:00AM - 12:00AM Wednesday: 7:00AM - 12:00AM Thursday: 7:00AM - 1:00AM Friday: 7:00AM - 1:00AM Saturday: 7:00AM - 1:00AM Sunday: 7:00AM - 12:00AM Back To Top Taco Bell New York City, 1503 Lexington Ave, New York, NY, 10029 646-362-3400 info@tacobellnewyorkcity.com TACO BELL, 1503 LEXINGTON AVE, NEW YORK, NY, 10029 (646) 362-3400 Taco Bell New York City Website Design & Search Engine Optimization by EXPRE S EO"
    },
    {
      "url": "https://events.miami.edu/event/betsy_atkins_ceo_and_founder_of_baja_corporation_and_lisa_a_hook_former_president_and_ceo_of_neustar_5235",
      "text": "Betsy Atkins, CEO and Founder of Baja Corporation and Lisa A. Hook, Former President and CEO of Neustar - University of Miami Accessibility Options: Skip to Content Skip to Search Skip to footer Office of Disability Services Request Assistance 305-284-2374 Display: Default High Contrast University of Miami Simple text logo for University of Miami Apply About UM Give to UM Schools School of Architecture College of Arts and Sciences Miami Herbert Business School School of Communication School of Education and Human Development College of Engineering School of Law Rosenstiel School of Marine, Atmospheric, and Earth Science Miller School of Medicine Frost School of Music School of Nursing and Health Studies The Graduate School Division of Continuing and International Education Alumni Roadmap Search Tools People Search Class Search IT Help and Support CaneLink myUM Workday Blackboard Employment Privacy Statement University of Miami Simple text logo for University of Miami Search UM (Mobile) Apply Apply About UM Give to UM Schools Alumni Roadmap Academics Admissions Student Life Research UHealth Athletics Tools Popular Links News@TheU People Search IT Help and Support CaneLink myUM Workday Blackboard Employment Privacy Statement Search All Events Academics Athletics Arts Events for... Undergrad Students Grad Students Alumni Faculty/Staff Prospective Students Share Feedback All Events Academics Athletics Alumni Student Events Share Feedback All Events Academics Athletics Arts Events for... Undergrad Students Grad Students Alumni Faculty/Staff Prospective Students Search Search Log in Sign up University of Miami Past Events Betsy Atkins, CEO and Founder of Baja Corporation and Lisa A. Hook, Former President and CEO of Neustar Clear message Betsy Atkins, CEO and Founder of Baja Corporation and Lisa A. Hook, Former President and CEO of Neustar Tuesday, November 12, 2019 6:00pm to 7:00pm EST I'm Interested Share Betsy Atkins, CEO and Founder of Baja Corporation and Lisa A. Hook, Former President and CEO of Neustar Share Betsy Atkins, CEO and Founder of Baja Corporation and Lisa A. Hook, Former President and CEO of Neustar on Facebook Share Betsy Atkins, CEO and Founder of Baja Corporation and Lisa A. Hook, Former President and CEO of Neustar on Twitter Share Betsy Atkins, CEO and Founder of Baja Corporation and Lisa A. Hook, Former President and CEO of Neustar on Instagram Share Betsy Atkins, CEO and Founder of Baja Corporation and Lisa A. Hook, Former President and CEO of Neustar on LinkedIn I'm Interested About this Event Free Event Add to calendar Save to Google Calendar Save to iCal Save to Outlook Free Event Add to calendar Save to Google Calendar Save to iCal Save to Outlook Women in Boards Speakers: Betsy Atkins CEO and Founder of Baja Corporation Betsy is a 3-time CEO and serial entrepreneur & founder of Baja Corporation. She has co-founded enterprise software companies in multiple industries including energy, healthcare and networking. She is an expert at scaling companies through hyper growth and leading them to successful IPO and acquisitions. One of her more notable IPOs include the acquisition of Clear Standards by SAP and Ascend Communications ($5B in revenue) which was then acquired by Lucent for $23B. At Baja Corporation, Betsy has built 3 early stage funds and has made early investments in companies such as Yahoo, eBay and Selectica. Betsy is a corporate governance expert with an eye for making boards a competitive asset. Her corporate Board experience is vast and covers multiple industries including: Technology, Financial Services, Healthcare, Retail, Automotive, Manufacturing, and Logistics. As a Corporate Director, she brings an operational perspective which focuses on taking friction out of the consumer experience. She leverages broad contemporary knowledge of digital technology to reduce costs, drive efficiency and productivity using AI machine learning analytics to streamline processes. Previously, Betsy was the CEO of NCI, a food manufacturer creating Nutraceutical and Functional Food products. NCI created the PowerBar and healthy snacks for Kraft, Nabisco, etc. Betsy was also the CEO of Clear Standards, which developed enterprise level software for monitoring carbon emissions. A published author, Betsy’s work on Corporate Governance includes: The Conference Board, National Association of Corporate Directors (NACD), Business Insider, and Forbes. She currently serves on public company boards: Wynn Resorts, SL Green Realty and Covetrus. She is also a member on the board of Volvo Cars (private). She is a proud graduate of University of Massachusetts, Amherst. Lisa Hook Former President and CEO of Neustar Lisa A. Hook was named CEO of Neustar (NYSE: NSR) in October 2010. As President & CEO, Hook led the transformation of Neustar from telecom infrastructure to global leadership in information services. This resulted in the company being acquired at a 45% premium and going private. Prior to serving as CEO, Hook spent two years as the company's President & Chief Operating Officer, strengthening its market position and building partnerships with content and media industries. In the past, she has served on the Board of Covad Communications Group, Inc., Time Warner Telecom Inc., National Geographic Ventures and K-12, Inc., and on the Board of Trustees of the National Public Radio Foundation. Until December 2004, she served as President of AOL Broadband, Premium and Developer Services. Earlier in her career, Ms. Hook was Executive Vice President and Chief Operating Officer at Time Warner Telecom. She served as a senior advisor to the chairman of the Federal Communications Commission during the Reagan Administration, and, prior to that, was general counsel of Viacom Cable. She started her career at Hogan Hartson LLP. Ms. Hook also served as Senior Independent Director of Reed Elsevier Group, Reed Elsevier NV and Reed Elsevier PLC. In 2012, President Barrack Obama appointed her to serve on the National Security Telecommunications Advisory Committee (NSTAC). Her non-profit affiliations include being a director of Island Press, on the Advisory Board of The Peggy Guggenheim Collection, and on the Corporate Board of the John F. Kennedy Center for the Performing Arts. She is a member of the Committee of 200, an organization of the world’s most successful women entrepreneurs and innovators, and the Committee for Economic Development, a business-led public policy organization. Ms. Hook holds a B.A. from Duke University and a J.D. from Dickinson School of Law. Storer Auditorium Miami Herbert Business School 5250 University Drive, Coral Gables, Florida Space is limited. Valet parking available for $10 or self-park and pay via Pay-by-Phone. The Miami Herbert Business School’s Distinguished Leaders Lecture Series is made possible through the generosity of Southern Glazer’s Wine & Spirits. Event Details Topics Academics Audience Faculty General Public Students - Undergrad Students - Grad/Professional Students - Prospective See Who Is Interested 0 people are interested in this event I'm Interested User Activity No recent activity Sign up to post University of Miami Event Types Ceremony/Reception Community Outreach Dates/Deadlines Education/Training Exhibit Facility Operations/Closures Information Session Lecture/Conference Meeting Performance/Screening Virtual Topics Academic Calendar Academics Admissions Arts and Culture Careers Centennial Climate and Environment Climate and Health Community Diversity/Inclusion Health  and Wellness Hemispheric and Global Impact Innovation and Entrepreneurship Law and Social Justice Medical Philanthropy Research Science and Technology Social and Entertainment The U Creates Women of the U Audience Alumni Faculty General Public Parents Staff Students Activity All events All groups All places Sign up Login Submit an event University of Miami Coral Gables , FL 33146 305-284-2211 Office of Conference Services 1280 Stanford Drive, Office 1M056 Coral Gables , FL 33146 ecms@miami.edu Conference Services Planning Your Event Meeting Spaces and Rates Events and Calendar Help Contact Conference Services UM Network News@TheU Alumni Association Medical Center Hurricane Sports Employment Opportunities Visit Campus Map Parking & Transportation Connect social-facebook social-twitter social-youtube social-instagram Copyright: 2025 University of Miami. All Rights Reserved. Emergency Information Privacy Statement & Legal Notices University of Miami Powered by the Localist Community Event Platform © All rights reserved Log in Log in with CaneID or Email Address is required. Password is required. I forgot my password I don't have an account yet"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. First name Surname * First name E-Mail E-Mail * Nachricht * Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "https://www.salsalitotacoshop.com/about-us",
      "text": "About Us — Salsalito Taco Shop 0 Skip to Content MENUS HOST A FIESTA ABOUT US GALLERY CONTACT US ORDER Open Menu Close Menu MENUS HOST A FIESTA ABOUT US GALLERY CONTACT US ORDER Open Menu Close Menu MENUS HOST A FIESTA ABOUT US GALLERY CONTACT US ORDER ABOUT US FROM BAJA TO THE BAY Warm walks on the beach, sand between your toes, an ice cold cerveza in hand and a Baja fish taco… that’s what we are all about! Starting with a love of Cabo over two decades ago, our memories are filled with those warm Latin waters, boat rides to the Arch for sunset, and memories made with locals who quickly became family. Then, returning to the San Francisco Bay, and missing that swimsuit-wearing, free-spirit feeling that a great vacay always brings. That longing inspired the Salsalito Taco Shop where we bring Baja to the Bay, sharing our love of beach-side vibes and Cabo-influenced fare made with amor from our family kitchen. We love our community, our guests, and bringing back a little sand from the beach for you to enjoy. ¡Salud! SALSALITO TACO SHOP CONTACT 1115 Bridgeway Sausalito, CA 94965 salsalitotacoshop@gmail.com (415) 331-5595 Hours MON: 11-5 THURS: 11-5 FRI & SAT: 11-8 SUN: 11-7 (Closed Tues & Wed) Taco Bars & Patio Buyouts open 7 days a week!"
    },
    {
      "url": "https://whiterestaurants.com/taco-bell/",
      "text": "Taco Bell | White Management Home About About Company History Company Timeline Mission Statement Company Values The Team Brands Brands Bountiful Bread Annabel’s Dunkin’ Log Jam KFC Butcher Block Taco Bell Charity Work With Us Work With Us Benefits Apply/Open Positions Community Calendar Contact Us Team Connect Employee Handbook Customer Service Employee Benefits What’s New Select Page about taco bell Glen Bell originally created Bell’s Drive-In and Taco Tia in San Bernardino, California, in 1954. It wasn’t until 1962 when the name was changed to “Taco Bell” after Bell opened a restaurant in Downey, California. His customers specifically referred to the food as “tay-kohs.” The restaurant was then franchised in 1964, and it only took three years to open 100 more. Three years after that, Taco Bell went public with a whopping 325 restaurants. What was once a tiny drive-in restaurant has become a staple fast-food chain, and is even considered one of the healthiest fast food chains. Since the start of the first-ever Bell’s Drive-In and Taco Tia in San Bernardino, this popular fast-food chain has developed quite a diverse menu past their usual tacos. Their famous Crunchwrap Supremes, Cinnamon Twists and Mountain Dew Baja Blast have become staples for a night at Taco Bell. They recently added Nacho Fries with a delicious cheesy dipping sauce, and of course, how could you ever forget those Doritos Locos Tacos? Taco Bell has certainly created an empire since it’s early days in 1954, and Glen Bell must have been one proud “Taco Titan” in his day. meet the management 3 Brian White President, White Management  brian@whiterestaurants.com Read Bio 3 Tawnya Hanson Vice President of Operations, Quick-Service Restaurants (Dunkin, KFC, Taco Bell)  thanson@whitemgtcorp.com Read Bio 3 Tera Fountain Director of Operations, Quick-Service Restaurants (Dunkin’, KFC, Taco Bell)  tfountain@whitemgtcorp.com Read Bio 3 Josh “Bubba” Kelley Above Store Leader, Quick-Service Restaurants (KFC/Taco Bell)  jkelley@whitemgtcorp.com Read Bio 3 Brian White President, White Management  brian@whiterestaurants.com Brian White holds a BA in Economics and English from Colby College and a MBA from Boston University. Brian held his first job in the restaurant business as a summer dishwasher at the Log Jam in 1992. After earning his MBA, White worked for a short time as a financial analyst for the Atira Group, a ski resort development company based in Colorado. White worked with his father to develop a number of Cold Stone Creamery stores in the Northeast beginning in 2004. He began overseeing the day-to-day operations of most of the full-service restaurants in 20tk; he added oversight of the fast-food restaurants in 2019. White was captain of the Colby College swim team, is a former Ironman triathlete, a snow and water skier, a kayaker, and competes in mountain bike racing with his family. He lives outside of Albany with his wife Melinda, a veterinarian, their two children, and various cats and dogs. 3 Tim Dailey Vice President of Development , Quick-Service Restaurants (Dunkin, KFC, Taco Bell)  tdailey@whitemgtcorp.com Tim Dailey got his start in the restaurant business in the 1970s as a shift leader for Carrols Corporation, which operates Burger King and Popeyes brands. Dailey worked his way through the ranks for a variety of quick-service brands, including McDonald’s and Pizza Hut, before spending 24 years with a Burger King franchisee, starting as General Manager and finishing as a minority franchisee owner. Dailey joined White Management in 2019 as Vice President of Operations, and in 2020 was promoted to Vice President of Development, where he oversees store renovations and expansions. Dailey is from the Massena, NY, area, and is grateful to be back spending time with his two adult sons and their children. Dailey loves to spend time outdoors hiking, though he can also be found watching NFL games and rooting for his favorite team, the Cleveland Browns. 3 Tawnya Hanson Vice President of Operations, Quick-Service Restaurants (Dunkin, KFC, Taco Bell)  thanson@whitemgtcorp.com Tawnya Hanson first joined White Management at age 15 as a Dunkin’ team member in Plattsburgh’s Cornelia Street store. Hanson moved through the ranks, rising to Night Shift Supervisor in 1991, and becoming manager of the Dunkin in Champlain in 1994, which she recalls she agreed to do temporarily because she wanted to find “a real job”. Hanson continued to rise in the operation, overseeing the opening of a third store in Peru in 1999, and then moving into production at the Skyway location where she was responsible for supplying product to seven stores. In 2007, Hanson was named Director of Operations for the White Management Dunkin’ brands, where she has been instrumental in helping grow the business. In 2020, Hanson was promoted to Vice President of Operations, overseeing Dunkin’, KFC, and Taco Bell franchises. Hanson grew up in Plattsburgh and completed an Associate’s Degree at Clinton Community College. She is the mother of five children—Megan, Buddy (Steven), Dominick, Cameron, and Tegan. Hanson loves the challenge of her work, and the ability to set and meet goals. In her spare time, she enjoys spending time with her children, grandchildren, her mother, and stepfather. Tera Fountain Director of Operations, Quick-Service Restaurants (Dunkin’, KFC, Taco Bell)  tfountain@whitemgtcorp.com Tera Fountain joined White Management as a teenager, first working for the Dunkin Donuts store on Cornelia Street in Plattsburgh. Fountain moved up the ranks, becoming an assistant manager, and then store manager. In 2008, Fountain was promoted to Above Store Leader (ASL) where she oversaw five Dunkin’ locations in the Plattsburgh area. Fountain was promoted to Director of Operations for the eighteen Dunkin’ stores in 2020. Fountain is known among colleagues for her razor-sharp mind and dry sense of humor. She lives in Plattsburgh with her husband, and has two grown children. Josh “Bubba” Kelley Above Store Leader, Quick-Service Restaurants (KFC/Taco Bell)  jkelley@whitemgtcorp.com Josh “Bubba” Kelley joined White Management Corporation in 2001as a team member at the KFC/Taco Bell in Malone, New York. Kelley worked his way up to become General Manager of the store, and ran it for the next 13 years. Kelley was then moved to the Dunkin’ brand, and served as General Manager of Dunkin’ stores in Akwesasne and Chateauguay. Kelley was next moved to the Taco Bell brand as General Manager of Taco Bell in Plattsburgh. In 2020, Kelley was promoted to Above Store Leader (ASL) for the KFC/Taco Bell brands operated by White Management. Kelley is a native of Malone, NY, and a graduate of Franklin Academy. He lives in Burke with his wife and three sons. Fun fact about Kelley: he produces a grass-roots online story time on Thursday evenings on Facebook live , often accompanied by one or more of his sons, and in full costume. locations Malone, NY Plattsburgh, NY  413 State RT 11 / PO Box 41  (518) 561-6716  367 Cornelia St, Plattsburgh, NY, 12901  (518) 561-6716 follow taco bell on social media: Follow Follow tacobell.com work for taco bell Apply/Open Positions Work With Us Privacy Policy Mission statement White Restaurants aims to provide our guests with an unforgettable dining experience in an authentic environment, while taking care of our employees and our community. contact White Management Corporate Offices 1 East Park Row #3 Clinton, NY 13323  Info@WhiteRestaurants.com"
    }
  ]
}