{
  "fuentes": [
    {
      "url": "https://stancofair.com/contact-us/",
      "email": "fairchat@stancofair.com"
    },
    {
      "url": "https://bakercountypress.com/calendar/category/community/",
      "email": "advertising@bakercountypress.com"
    },
    {
      "url": "https://bakercountypress.com/calendar/category/community/",
      "email": "editor@bakercountypress.com"
    },
    {
      "url": "https://bakercountypress.com/calendar/category/community/",
      "email": "sports@bakercountypress.com"
    },
    {
      "url": "https://bakercountypress.com/2022/03/3-17-2022-public-notices/",
      "email": "advertising@bakercountypress.com"
    },
    {
      "url": "https://bakercountypress.com/2022/03/3-17-2022-public-notices/",
      "email": "editor@bakercountypress.com"
    },
    {
      "url": "https://bakercountypress.com/2022/03/3-17-2022-public-notices/",
      "email": "hughfish@setel.net"
    },
    {
      "url": "https://bakercountypress.com/2022/03/3-17-2022-public-notices/",
      "email": "jared@flclg.com"
    },
    {
      "url": "https://bakercountypress.com/2022/03/3-17-2022-public-notices/",
      "email": "jcrawford@marksgray.com"
    },
    {
      "url": "https://bakercountypress.com/2022/03/3-17-2022-public-notices/",
      "email": "jrichardson@marksgray.com"
    },
    {
      "url": "https://bakercountypress.com/2022/03/3-17-2022-public-notices/",
      "email": "probate@marksgray.com"
    },
    {
      "url": "https://bakercountypress.com/2022/03/3-17-2022-public-notices/",
      "email": "sports@bakercountypress.com"
    },
    {
      "url": "https://gallatincountyfairgrounds.com/about-us",
      "email": "caitlin.quisenberry@gallatin.mt.gov"
    },
    {
      "url": "https://www.bakercountyor.gov/fair/fair.html",
      "email": "bakerfair@bakercounty.org"
    },
    {
      "url": "https://www.bakercountyor.gov/fair/fair.html",
      "email": "logo-dark@2x.png"
    },
    {
      "url": "https://www.bakercountyor.gov/fair/fair.html",
      "email": "logo@2x.png"
    },
    {
      "url": "https://www.secureitsecurities.com/contact-us",
      "email": "info@secureitsecurities.com"
    },
    {
      "url": "https://perrycountyfairgrounds.com/contactus",
      "email": "perrycofair@yahoo.com"
    },
    {
      "url": "https://www.falcofair.com/contact.aspx",
      "email": "fairgrounds@falloncounty.net"
    }
  ],
  "mails": [
    "advertising@bakercountypress.com",
    "bakerfair@bakercounty.org",
    "caitlin.quisenberry@gallatin.mt.gov",
    "editor@bakercountypress.com",
    "fairchat@stancofair.com",
    "fairgrounds@falloncounty.net",
    "hughfish@setel.net",
    "info@secureitsecurities.com",
    "jared@flclg.com",
    "jcrawford@marksgray.com",
    "jrichardson@marksgray.com",
    "logo-dark@2x.png",
    "logo@2x.png",
    "perrycofair@yahoo.com",
    "probate@marksgray.com",
    "sports@bakercountypress.com"
  ],
  "nombre_sitio": "bakercountyfair.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://stancofair.com/contact-us/",
      "text": "Contact Us - Stanislaus County Fairgrounds Skip to content Home Fair Junior Livestock Auction Be Part of the Fair 2025 10-Day Schedule Buy Tickets Carnival Rides Concession & Commercial Vendors Entertainment Fair Information Getting Social Kids Club Media Information and Inquiries Media Media Releases Our Sponsors FAQ’s Contests & Competitions Exhibit Contests & Competitions Livestock Competitions Rentals Facility Rentals LED Digital Sign RV Rentals Event Calendar Drive-Thru Dinner About Board of Directors Driving Directions Employment Fair History Friends of the Fair Greening Initiatives Media Releases Public Information 802 Form Reporting 38th DAA Ticket Policy RFP Home Fair Junior Livestock Auction Be Part of the Fair 2025 10-Day Schedule Buy Tickets Carnival Rides Concession & Commercial Vendors Entertainment Fair Information Getting Social Kids Club Media Information and Inquiries Media Media Releases Our Sponsors FAQ’s Contests & Competitions Exhibit Contests & Competitions Livestock Competitions Rentals Facility Rentals LED Digital Sign RV Rentals Event Calendar Drive-Thru Dinner About Board of Directors Driving Directions Employment Fair History Friends of the Fair Greening Initiatives Media Releases Public Information 802 Form Reporting 38th DAA Ticket Policy RFP Search Home Fair Junior Livestock Auction Be Part of the Fair 2025 10-Day Schedule Buy Tickets Carnival Rides Concession & Commercial Vendors Entertainment Fair Information Getting Social Kids Club Media Information and Inquiries Media Media Releases Our Sponsors FAQ’s Contests & Competitions Exhibit Contests & Competitions Livestock Competitions Rentals Facility Rentals LED Digital Sign RV Rentals Event Calendar Drive-Thru Dinner About Board of Directors Driving Directions Employment Fair History Friends of the Fair Greening Initiatives Media Releases Public Information 802 Form Reporting 38th DAA Ticket Policy RFP Home Fair Junior Livestock Auction Be Part of the Fair 2025 10-Day Schedule Buy Tickets Carnival Rides Concession & Commercial Vendors Entertainment Fair Information Getting Social Kids Club Media Information and Inquiries Media Media Releases Our Sponsors FAQ’s Contests & Competitions Exhibit Contests & Competitions Livestock Competitions Rentals Facility Rentals LED Digital Sign RV Rentals Event Calendar Drive-Thru Dinner About Board of Directors Driving Directions Employment Fair History Friends of the Fair Greening Initiatives Media Releases Public Information 802 Form Reporting 38th DAA Ticket Policy RFP Search Contact Us Get in touch with us, Use the contact form below for all General Inquiries. Name * First Last Email * Phone Message * CAPTCHA Office Hours Monday – Thursday Main Office: 9 am-3 pm Closed on Fridays Media & News Reporter Inquiries Contact number: (209) 668-1333 x338 E-mail: fairchat@stancofair.com Home News Contact 900 N Broadway Turlock, CA 95380 Fair Office: (209) 668-1333 Facility Rental: (209) 668-1333 Ext: 301 Tickets: (209) 668-1333 Ext: 308 © 2025 Stanislaus County Fairgrounds. All Rights Reserved Privacy Policy Terms & Conditions Follow Us Facebook Twitter Instagram Youtube Pinterest Flickr X"
    },
    {
      "url": "https://bakercountypress.com/calendar/category/community/",
      "text": "Protected Content - Please read below - The Baker County Press Close Menu Log In Subscribe Home Advertise Legal Notices News Obituaries Community Sports Opinion Calendar E-Edition Newspaper-2021 Newspaper-2022 Newspaper-2023 Newspaper-2024 Newspaper-2025 Facebook X (Twitter) Instagram Home Advertise Legal Notices E-Edition Newspaper-2021 Newspaper-2022 Newspaper-2023 Newspaper-2024 Newspaper-2025 About Us Login Facebook X (Twitter) Instagram YouTube Subscribe Now! News Crime Government Obituaries Community Sports Opinion Calendar Baker Backroads Home » Protected Content – Please read below Protected Content – Please read below The article you requested \" Community Foundation of Northeast Florida announces scholarships \"  requires a e-Edition Subscriber membership. You aren't logged in to the website. So we can't tell what Membership level you are at. Please log in If you have the correct Membership level, you will be able to view the requested content. Check out our membership options here Login Username or Email: Password: signup now | forgot password? Remember Me © 2025 The Baker County Press. Contact Us Contact Advertising/Production Director: Jessica Prevatt – advertising@bakercountypress.com Contact Classifieds: Camille FitzPatrick Contact News Editor: Joel Addington – editor@bakercountypress.com Contact Publisher: Jessica Prevatt – advertising@bakercountypress.com Contact Sports Editor: Kevin Upright – sports@bakercountypress.com Privacy Policy E-edition Submit Type above and press Enter to search. Press Esc to cancel. Ad Blocker Enabled! Ad Blocker Enabled! Our website is made possible by displaying online advertisements to our visitors. Please support us by disabling your Ad Blocker. Sign In or Register Welcome Back! Login below or Register Now . Log In Remember Me Lost password? Register Now! Already registered? Login . Password (please type it twice) * password strength indicator First Name * Last Name * Street Address * City, State * Zip Code * Enter a Valid Phone number (including area code) * Yes, I want to receive updates via email. Register A password will be e-mailed to you."
    },
    {
      "url": "https://bakercountypress.com/2022/03/3-17-2022-public-notices/",
      "text": "3-17-2022 Public Notices - The Baker County Press Close Menu Log In Subscribe Home Advertise Legal Notices News Obituaries Community Sports Opinion Calendar E-Edition Newspaper-2021 Newspaper-2022 Newspaper-2023 Newspaper-2024 Newspaper-2025 Facebook X (Twitter) Instagram Home Advertise Legal Notices E-Edition Newspaper-2021 Newspaper-2022 Newspaper-2023 Newspaper-2024 Newspaper-2025 About Us Login Facebook X (Twitter) Instagram YouTube Subscribe Now! News Crime Government Obituaries Community Sports Opinion Calendar Baker Backroads Home » 3-17-2022 Public Notices Legal Notices 3-17-2022 Public Notices By Jessica Prevatt March 21, 2022 No Comments 23 Mins Read 3 Views Share Facebook Twitter Pinterest LinkedIn Tumblr Email Share Facebook Twitter INVITATION TO BID ROOF REPLACEMENT FOR FAIRGROUNDS EXHIBIT HALL BID# 2022-03 The Baker County Board of County Commissioners is seeking sealed bids from qualified General or Roofing contractors to provide labor, materials, supplies, services, etc to provide roof replacement for the Fairgrounds Exhibit Hall, located at the Baker County Fairgrounds, 5567 Lauramore Rd, Macclenny FL 32063. The exhibit hall is a metal building approximately 15,000 s.f. The County is seeking two price options: 1) Completely replace the existing roof with a like product (see specifications), or 2) Apply elastomeric coating to seal the entire roof. With either option, 12 skylights will need to be removed. Estimated cost of project $50,000-100,000. MANDATORY PRE-BID CONFERENCE will be held on April 7, 2022 at Baker County Fairgrounds, 5567 Lauramore Rd, Macclenny FL 32063, 12:00p.m. local time. Bidders are required to attend to be eligible to bid on the project. This project requires Performance and Payments Bonds to be provided. The deadline to submit questions is April 12, 2022, at 5:00 PM. Questions shall be submitted in writing to Sara Little at sara.little@bakercountyfl.org. All answers will be issued in writing via addendum on the County’s website. Due Date: Bid will be received until 2:00 p.m., April 18, 2022 in the Office of the County Manager, Baker County Board of Commissioners, 55 N. 3rd Street, Macclenny FL 32063. Bid MUST have the respondent’s name and mailing address clearly shown on the outside of the envelope or package when submitted. Submit two (2) copies of your bid in a sealed envelope or similar package marked “ROOF REPLACEMENT FOR FAIRGROUNDS EXHIBIT HALL” on the front of the envelope. Bids will be opened and respondents announced at 2:00 P.M. local time, or as soon thereafter as practical, on April 18, 2022, in the Baker County Administrative offices, 55 N. 3rd Street, Macclenny FL 32063. The bid opening is open to the public. Bid information may be obtained on-line at http://www.bakercountyfl.org/purchasing The County reserves the right, in its sole and absolute discretion, to reject any or all Bids, to cancel or withdraw this solicitation at any time and waive any irregularities in the Solicitation process. No faxed Proposals will be accepted. Additional information may be obtained from: Baker County Board of County Commissioners 55 N. 3rd St. Macclenny, FL 32063 (904) 259-3613 Website: http://www.bakercountyfl.org/purchasing 3/10-3/24c PUBLIC NOTICE ElderSource, the Area Agency on Aging for Northeast Florida, currently has funding available for state-funded home and community-based services for elders. Established organizations that provide home and community based services for the elders in Baker, Clay, Duval, Flagler, Nassau, St. Johns and Volusia Counties are encouraged to view the Request for Proposal information at www.myeldersource.org, available after Friday March 18 at 5:00 PM. A compulsory Pre-Proposal conference will be held at ElderSource, 10688 Old St Augustine Road, Jacksonville FL 32257, on Friday, March 25, 2022 at 2:00 PM. COVID protocols will be enforced. Additional deadlines and requirements are viewable in the RFP documentation. 3/17c A, R&R, INC. 11837 N SR 121 Macclenny, FL 32063 Notice of Public Sale: A, R&R INC. gives Notice of Foreclosure of Lien and intent to sell these vehicles on April 1, 2022, 10:00 am at 11837 N SR 121, Macclenny, FL 32063, pursuant to subsection 713.78 of the Florida Statutes. A, R&R INC. reserves the right to accept or reject any and/or all bids. 2006 Infiniti M35 VIN# JNKAY01EX6M115907 2004 Honda 15F VIN# 9C2KE01034R006914 3/17c NOTICE OF PUBLIC HEARING The Baker County School District School Board will hold the following public hearing on Monday, April 4, 2022, at the District School Board Room located at 270 South Boulevard East, Macclenny, Florida, beginning at 5:00 p.m. The following items will be considered at the public hearing: 2021-2022 Student Progression Plan (Requirements for Participation in Graduation Ceremonies). The public is invited and encouraged to attend. The documents will be available for preview on Monday through Friday (8:30 a.m. – 3:00 p.m.) at the Superintendent’s Office located at 270 South Boulevard East, Macclenny, Florida, beginning, Monday, March 7, 2022. You may also access the document on our district website at www.bakerk12.org. Sherrie Raulerson Superintendent of Schools 3/10-3/31c IN THE CIRCUIT COURT OF THE EIGHTH JUDICIAL CIRCUIT IN AND FOR BAKER COUNTY, FLORIDA CASE NO.: 02-2021-CP-121 IN RE: The Estate of CHARLES DWIGHT JONES, Deceased. _________________________/ NOTICE TO CREDITORS The administration of the estate of CHARLES DWIGHT JONES, deceased, whose date of death was June 12, 2021 and whose Social Security Number is xxx-xx-0470, is pending in the Circuit Court for Baker, Florida, Probate Division, the address of which is 339 East Macclenny Ave., Macclenny, FL 32063. The names and addresses of the personal representative and the personal representative’s attorney are set forth below. All creditors of the decedent and other persons having claims or demands against decedent’s estate on whom a copy of this notice is required to be served must file their claims with this court WITHIN THE LATER OF 3 MONTHS AFTER THE TIME OF THE FIRST PUBLICATION OF THIS NOTICE OR 30 DAYS AFTER THE DATE OF SERVICE OF A COPY FO THIS NOTICE ON THEM. All other creditors of the decedent and other persons having claims or demands against decedent’s estate must file their claims with this court WITHIN 3 MONTHS AFTER THE DATE OF THE FIRST PUBLICATION OF THIS NOTICE. ALL CLAIMS NOT FILED WITHIN THE TIME PERIODS SET FORTH IN SECTION 733.702 OF THE FLORIDA PROBATE CODE WILL BE FOREVER BARRED. NOTWITHSTANDING THE TIME PERIODS SET FORTH ABOVE, ANY CLAIM FILED TWO (2) YEARS OR MORE AFTER THE DECEDENT’S DATE OF DEATH IS BARRED. The date of first publication of this notice is March 10, 2022. Personal Representative: Dwight Wiley Jones, Jr. 6514 San Juan Ave. Jacksonville, FL 32210 Attorney for Estate: Hugh D. Fish, Jr. Florida Bar No. 0242861 P.O. Box 531 Macclenny, FL 32063 (904) 259-6606 hughfish@setel.net 3/10-17c ALL SAFE MINI STORAGE 190 SOUTH LOWDER STREET MACCLENNY, FLORIDA 32063 904-397-0347 The following units containing household items such as furniture, appliances, etc., will be sold by public auction Saturday, March 26, 2022, at 9:00 am to satisfy back rent. The following tenants can claim their property back if rent is paid before this date: Hunter Riggs Willie Mcgoogin Micleslu Nicolae Jessica Owen Davaun Church Johnny Harvey John Thomas Sellecca Jones Josephine Clodfelter Alicia Moore Brittany Taylor Kathy Mixon Justin Ullig Robert Starrett Justin Ullig Christopher Wood Austin Goddard Tina Adams Tina Adams Chris Miller Mabel Hoebee Mack Peebles Edward Raulerson Samantha Bryan Sara Devane Deatrice Farmer Deatrice Farmer Dexter Jackson Samuel Ivey Niyia Blue 3/10-3/17p NOTICE OF PUBLIC HEARING Notice is hereby given that a Public Hearing will be held on May 5, 2022, at 10:00 AM to receive comments concerning the Macclenny Housing Authority’s FY2022 Capital Fund Program Five-Year Action Plan. A copy of the FY2022 CFP Five-Year Action Plan will be available for review over the next 45 days at the Authority’s central office located at: 402 Stansell Avenue Macclenny, Florida 32063 The Public Hearing will also be held at the above location. Any person wishing to comment on the above document may file his or her comments in writing with the MHA’s Executive Director at the above address by 5:00 PM, May 4, 2022, or may attend the Public Hearing. All comments will be considered in preparing the final Capital Fund Program Five-Year Action Plan before submittal to the U.S. Department of Housing and Urban Development. 3/17c IN THE CIRCUIT COURT OF THE EIGHTH JUDICIAL CIRCUIT IN AND FOR BAKER COUNTY, FLORIDA CASE NO.: 02-2022-CP-012 IN RE: The Estate of Delores T. Williams, Deceased. ____________________________/ NOTICE TO CREDITORS The administration of the estate of Delores T. Williams, deceased, whose date of death was January 14, 2022, is pending in the Circuit Court for Baker County, Florida, Probate Division, the address of which is 339 E MacClenny Avenue, MacClenny, Florida. The names and addresses of the personal representative and the personal representative’s attorney are set forth below. All creditors of the decedent and other persons having claims or demands against decedent’s estate on whom a copy of this notice is required to be served must file their claims with this court ON OR BEFORE THE LATER OF 3 MONTHS AFTER THE TIME OF THE FIRST PUBLICATION OF THIS NOTICE OR 30 DAYS AFTER THE DATE OF SERVICE OF A COPY OF THIS NOTICE ON THEM. All other creditors of the decedent and other persons having claims or demands against decedent’s estate must file their claims with this court WITHIN 3 MONTHS AFTER THE DATE OF THE FIRST PUBLICATION OF THIS NOTICE. ALL CLAIMS NOT FILED WITHIN THE TIME PERIODS SET FORTH IN FLORIDA STATUTES SECTION 733.702 WILL BE FOREVER BARRED. NOTWITHSTANDING THE TIME PERIODS SET FORTH ABOVE, ANY CLAIM FILED TWO (2) YEARS OR MORE AFTER THE DECEDENT’S DATE OF DEATH IS BARRED. The date of first publication of this notice is March 17, 2022. Personal Representative: Gail R. Terry 6702 Beatrix Drive Jacksonville, Florida 32226 Attorney for Personal Representative: John R. Crawford Florida Bar No. 210358 Janice B. Richardson Florida Bar No. 036403 Attorneys for Petitioner Marks Gray, P.A. 12000 Riverplace Blvd, Suite #800 Jacksonville, Florida 32207 Telephone: (904) 398-0900 E-mail Addresses: jcrawford@marksgray.com jrichardson@marksgray.com probate@marksgray.com 3/17-3/24c IN THE CIRCUIT COURT OF THE EIGHTH JUDICIAL CIRCUIT IN AND FOR BAKER COUNTY, FLORIDA CASE NO. 21000064CAMXAX UNITED STATES OF AMERICA ACTING THROUGH THE RURAL HOUSING SERVICE OR SUCCESSOR AGENCY, UNITED STATES DEPARTMENT OF AGRICULTURE Plaintiff, vs. WILLIAM TIMOTHY MARSH A/K/A WILLIAM T. MARSH; TERESA GAYLE RAULERSON A/K/A TERESA G. RAULERSON A/K/A TERESA RAULERSON A/K/A TERESA REWIS A/K/A TERESA G. MARSH A/K/A TERESA MARSH; LONNIE CLAYTON REWIS A/K/A LONNIE C. REWIS; UNKNOWN TENANT 1; UNKNOWN TENANT 2; Defendants. _________________________/ NOTICE OF SALE NOTICE IS HEREBY GIVEN THAT, pursuant to the Final Judgment of Foreclosure entered on February 09, 2022, in this cause, in the Circuit Court of Baker County, Florida, the clerk shall sell the property situated in Baker County, Florida, described as: LOT 2, BLOCK 1, COUNTRY CLUB ESTATES, UNIT 1, ACCORDING TO PLAT THEREOF, RECORDED IN PLAT BOOK 2, PAGE 49, OF THE PUBLIC RECORDS OF BAKER COUNTY, FLORIDA. A/K/A 734 MILTONDALE RD, MACCLENNY, FL 32063-5565 at public sale, to the highest and best bidder, for cash, at the front door of the Baker County Courthouse, 339 E. Macclenny Avenue, Macclenny, FL 32063, on April 14, 2022, beginning at 11:00 AM. Any person claiming an interest in the surplus from the sale, if any, other than the property owner as of the date of the lis pendens must file a claim before the clerk reports the surplus as unclaimed. Dated this 14th day of March, 2022. Stacie D. Harvey Clerk of the Circuit Court By: Kayse Fiano Deputy Clerk eXL Legal, PLLC 12425 28th St. North, Ste. 200 St. Petersburg, FL 33716-1826 3/17-3/24c IN THE CIRCUIT COURT OF THE EIGHTH JUDICIAL CIRCUIT IN AND FOR BAKER COUNTY, FLORIDA CASE NO.: 19000049CAMXAX FIRST GUARANTY MORTGAGE CORPORATION, Plaintiff, vs. JASON ERIC WALKER A/K/A JASON E. WALKER; HEATHER M. WALKER; UNITED STATES OF AMERICA ON BEHALF OF THE ADMINISTRATOR OF THE U.S. SMALL BUSINESS ADMINISTRATION; UNKNOWN TENANT NO. 1; UNKNOWN TENANT NO. 2; and ALL UNKNOWN PARTIES CLAIMING INTERESTS BY, THROUGH, UNDER OR AGAINST A NAMED DEFENDANT TO THIS ACTION, OR HAVING OR CLAIMING TO HAVE ANY RIGHT, TITLE OR INTEREST IN THE PROPERTY HEREIN DESCRIBED, Defendant(s). __________________________/ RE-NOTICE OF SALE PURSUANT TO CHAPTER 45 NOTICE IS HEREBY GIVEN pursuant to an Order or Summary Final Judgment of foreclosure dated September 8, 2021 and an Order on Defendant Jason Walker’s Request to Cancel March 11, 2022 Foreclosure Sale dated March 9, 2022 and entered in Case No. 19000049CAMXAX of the Circuit Court in and for Baker County, Florida, wherein FIRST GUARANTY MORTGAGE CORPORATION is Plaintiff and JASON ERIC WALKER A/K/A JASON E. WALKER; HEATHER M. WALKER; UNITED STATES OF AMERICA ON BEHALF OF THE ADMINISTRATOR OF THE U.S. SMALL BUSINESS ADMINISTRATION; UNKNOWN TENANT NO. 1; UNKNOWN TENANT NO. 2; and ALL UNKNOWN PARTIES CLAIMING INTERESTS BY, THROUGH, UNDER OR AGAINST A NAMED DEFENDANT TO THIS ACTION, OR HAVING OR CLAIMING TO HAVE ANY RIGHT, TITLE OR INTEREST IN THE PROPERTY HEREIN DESCRIBED, are Defendants, I will sell to the highest and best bidder for cash at the Front Door of the Baker County Courthouse, 339 East Macclenny Avenue, Macclenny, FL 32063, 11:00 am, on May 12, 2022 , the following described property as set forth in said Order or Final Judgment, to-wit: LOT 4, FOREST GLEN, ACCORDING TO PLAT THEREOF AS RECORDED IN PLAT BOOK 3, PAGE 67, OF THE PUBLIC RECORDS OF BAKER COUNTY, FLORIDA, TOGETHER WITH A PART OF THE NORTHEAST 1/4 OF THE NORTHEAST 1/4 OF SECTION 11, TOWNSHIP 2 SOUTH, RANGE 21 EAST, BAKER COUNTY, FLORIDA, AND BEING MORE PARTICULARLY DESCRIBED AS FOLLOWS: COMMENCE AT THE NORTHEAST CORNER OF SAID SECTION 11; THENCE N 88 DEGREES 59 MINUTES 33 SECONDS WEST, ALONG THE NORTH LINE OF SAID SECTION 11, A DISTANCE OF 313.16 FEET TO THE POINT OR BEGINNING; THENCE SOUTH 01 DEGREES 18 MINUTES 24 SECONDS EAST, AND PARALLEL WITH THE EAST LINE OF SAID SECTION 11, A DISTANCE OF 260.03 FEET TO THE NORTHEAST CORNER OF LOT 4, FOREST GLEN AS RECORDED IN PLAT BOOK 3, PAGE 67, OF THE CORNER OF LOT 4, FOREST GLEN AS RECORDED IN PLAT BOOK 3, PAGE 67, OF THE PUBLIC RECORDS OF SAID COUNTY; THENCE SOUTH 89 DEGREES 50 MINUTES 32 SECONDS WEST, ALONG THE NORTH LINE OF SAID LOT 4, A DISTANCE OF 312.97 FEET TO THE NORTHWEST CORNER OF SAID LOT 4; THENCE NORTH 01 DEGREES 18 MINUTES 24 SECONDS WEST, AND PARALLEL WITH THE EAST LINE OF SAID SECTION 11, A DISTANCE OF 266.40 FEET TO A POINT ON SAID NORTH LINE OF SECTION 11; THENCE SOUTH 88 DEGREES 59 MINUTES 33 SECONDS EAST, ALONG SAID NORTH LINE, 313.16 FEET TO THE POINT OF BEGINNING. ANY PERSON CLAIMING AN INTEREST IN THE SURPLUS FROM THE SALE, IF ANY, OTHER THAN THE PROPERTY OWNER AS OF THE DATE OF THE LIS PENDENS MUST FILE A CLAIM BEFORE THE CLERK REPORTS THE SURPLUS AS UNCLAIMED. THE COURT, IN ITS DESCRETION, MAY ENLARGE THE TIME OF THE SALE. NOTICE OF THE CHANGED TIME OF SALE SHALL BE PUBLISHED AS PROVIDED HEREIN. In accordance with the Americans with Disabilities Act of 1990, persons needing special accommodation to participate in this proceeding should contact the Clerk of the Court not later than five business days prior to the proceeding at the Baker County Courthouse. Telephone 904-259-3121 or 1-800-955-8770 via Florida Relay Service. DATED at MacClenny, Florida, on March 11, 2022. Stacie D. Harvey As Clerk, Circuit Court By: Kayse Fiano As Deputy Clerk Diaz Anselmo & Associates, P.A. Attorneys for Plaintiff P.O. BOX 19519 Fort Lauderdale, FL 33318 Telephone: (954) 564-0071 3/17-3/24c IN THE CIRCUIT COURT OF THE EIGHTH JUDICIAL CIRCUIT IN AND FOR BAKER COUNTY, FLORIDA CASE NO.: 02-2021-CA-000082-CAAM CYPRESS POINTE OF MACCLENNY HOMEOWNERS ASSOCIATION, INC., a Florida non-profit Corporation, Plaintiff, vs. ADAM MCQUEEN; VATINA MCQUEEN, et al., Defendant(s). _________________________/ NOTICE OF SALE PURSUANT TO CHAPTER 45 NOTICE IS HEREBY GIVEN pursuant to Final Judgment of Foreclosure dated March 9, 2022, entered in Case No. 02-2021-CA-000082-CAAM in the Circuit Court in and for Baker County, Florida wherein CYPRESS POINTE OF MACCLENNY HOMEOWNERS ASSOCIATION, INC., is Plaintiff, and ADAM MCQUEEN; VATINA MCQUEEN, et al, is the Defendant, I will sell to the highest and best bidder for cash at: 11:00 A.M. on MAY 12, 2022 at the Baker County Courthouse, 339 E. Macclenny Avenue, Macclenny, Florida 32063. The Clerk of Court shall sell the property described to the highest bidder for cash in accordance with section 45.031, Florida Statutes., on the following described real property as set forth in the Final Judgment, to wit: LOT 70, CYPRESS POINTE UNIT 2, ACCORDING TO THE PLAT THEREOF, RECORDED IN PLAT BOOK 3, PAGES 104 THROUGH 107, INCLUSIVE, OF THE PUBLIC RECORDS OF BAKER COUNTY, FLORIDA. A/K/A: 518 ISLAMORADA DR N, MACCLENNY, FL 32063. Dated: March 14, 2022. Stacie D. Harvey Clerk of the Circuit Court By: Kayse Fiano Deputy Clerk of Court Florida Community Law Group, P.L. 1855 Griffin Road, Suite A-423 Dania Beach, FL 33004 Tel: (954) 372-5298 Fax: (866) 424-5348 Email: jared@flclg.com 3/17-3/24c IN THE CIRCUIT COURT OF THE EIGHTH JUDICIAL CIRCUIT IN AND FOR BAKER COUNTY, FLORIDA CASE NO. 2021-CA-115 HARRY O. STRATTON, Plaintiff, vs. AGNES C. BROWN, if living and if deceased, her unknown spouses, heirs, devisees, grantees, creditors and all other parties claiming by, through, under or against him; Defendant. _________________________/ NOTICE OF ACTION TO: AGNES C. BROWN; if living and if deceased, her unknown spouses, heirs, devisees, grantees, creditors and all other parties claiming by, through, under or against her RESIDENCE(S): Unknown LAST KNOWN MAILING ADDRESS: 406 Barbara Circle, Macclenny, Fl 32063 YOU ARE NOTIFIED that an action to quiet title on the property in Baker County, Florida more particularly described in Exhibit A attached hereto, has been filed against you, and you are required to serve a copy of your written defenses, if any, to it on BERNARD & SCHEMER, ESQUIRE, Plaintiff’s attorney, whose address is 480 Busch Drive, Jacksonville, Florida 32218, on or before April 1, 2022 or within 35 days of the first date of publication of this notice, and file the original with the Clerk of this Court either before service on Plaintiff’s attorney or immediately thereafter; otherwise, a default will be entered against you for the relief demanded in the complaint or petition. Exhibit A Part of the SW 1/4 of the SE 1/4 of Section 14, Township 4 South, Range 2D East, Baker County, Florida, and being more particularly described as follows: Commence at the NE corner of said SW 1/4 of the SE 1/4; Thence S 89°13’18” W, on the North line of said SW 1/4 of the SE 1/4 a distance of 768.96 feet; Thence S 0°46’42” E a distance of 218.58 feet to the Point of a curve to the left; Said Curve being concave Northeasterly and having a radius of 50.0 feet and a central angle of 54°15’00”; thence Southeasterly around an Arc of said curve a distance of 47.34 feet to the Point of Tangency of said curve; Said arc being subtended by a chord bearing and distance of South 27°54’12” E, 45.59 feet; Thence S 34°58’18” W a distance of 50.0 feet to the Point of Beginning; Thence S 55°01’42” E, a distance of 317.2 feet; thence S 40°07’58” W a distance of 221.46 feet; Thence S 73°23’28” W a distance of 271.0 feet; Thence N 16°36’32” W a distance of 330.O feet to the Point of a Curve to the right; said curve being concave Southeasterly and having a radius of 50.0 feet and Central Angle of 86°59’50”; thence Northeasterly around said curve an Arc distance of 75.92 feet; Said Arc being subtended by a chord bearing and distance of N 26°53’23” E, 68.83 feet; Thence N 70°23’18” E a distance of 170.13 feet to the point of a curve to the right; Said curve being concave Southerly and having a Radius of 50.0 feet and Central Angle of 54°35’00”; Thence Easterly around said curve an Arc distance of 47.63 feet to the point of tangency of said curve and the Point of Beginning. AND ALSO: 1/9 interest in the following described road known as Pecan Circle: Part of the SW 1/4 of the SE 1/4 of Section 14, Township 4 South, Range 20 East, Baker County, Florida, and being more particularly described as follows: Commence at the NW corner of said SW 1/4 of the SE 1/4; thence N 89° 13’18” E on the North line of said SW 1/4 of the SE 1/4 a distance of 185.0 feet to the Point of Beginning; thence continue N 89°13’18” E on said North line a distance of 365.0 feel; thence S 0°46’42” E a distance or 218.58 feet to the point of a curve to the left: said curve being concave Northeasterly and having a radius of 50.0 feet and central angle of 54°15’00”; thence Southeasterly around said curve an Arc distance of 47.34 feet to the point of tangency of said curve and reference Point “A”: Said Arc being subtended by a chord bearing and distance of S 27°54’12” E, 45.59 feet; thence S 34°58’18” W a distance of 50.0 feet to a point of a curve: said curve being concave Southerly and having a radius of 50.0 feel, and a central angle of 54°35’00”: thence Northwesterly around the Arc of said curve a distance of 47.63 feet to the point of tangency of said curve; said Arc being subtended by a chord bearing and distance of N 82°19’21” W, 45.85 feet: thence S 70°23’18” W a distance of 14.96 feet; thence N 19°36’42’’ W a distance or 50.0 feet to the point of a curve; Said curve being concave Northwesterly and having a radius of 50.0 feet, and central angle of 71°10’00”; thence Northerly around said curve an Arc distance of 62.1 feet to the point of Tangency of said curve; Said Arc being subtended by a chord bearing and distance of N 34°48’18” E, 58.19 feet: thence N 0°46’42” W a distance of 178.33 -feet: thence S 89’13’18” W a distance of 315.0 feet: thence N 0°46’42” W a distance of 25.0 feet lo the Point of Beginning, Together with, from said reference Point “A”, run thence S 55°01’42” E a distance of 502.49 feet lo the point of a curve to the right: said curve being concave Southwesterly and having a radius of 100.0 feet, and central angle of 54°08’12’’; thence Southeasterly around said curve an Arc distance of 94.49 feet to the Point of tangency of said curve; Said Arc being subtended by a chord bearing and distance of S 27°57’36” E, 91.01 feet: thence S 0°53’30” E a distance of 294.21 feet to the point of a curve to the left; said curve being concave Northwesterly and having a radius or 100.0 feet, and central angle of 90°07’13”: thence Southwesterly around said curve an Arc distance of 157.29 feet to the point of tangency of said curve; Said Arc being subtended by a chord bearing and distance of S 44°10’07” W, 141.57 feet; thence S 89°13’43” W, a distance of 418.16 feet to the point of a curve to the right; Said curve being concave Northeasterly and having a radius of 100.0 feet, and central by a chord bearing and distance of N 53°41’24” W, 120.59 feet; thence N 16°36’32” W a distance of 553.66 feet to the point of a curve to the right; Said curve being concave Southeasterly and having a radius of 100.0 feet and a central angle of 86°59’50”; thence Northeasterly around said curve an Arc distance of 151.84 feet to the point of Tangency of said curve: Said Arc being subtended by a chord bearing and distance of N 26°53’23’’ E, 137.67 feet; thence N 70°23’18” E, a distance of 155.17 feet: thence S 19°36’42” E a distance of 50.0 feet: thence S 70°23’18” W a distance of 155.17 feet to the point of a curve to the left; Said curve being concave Southeasterly and having a radius of 50.0 feet, and a central angle of 86°59’50”; thence Southerly around the Arc of said curve a distance of 75.92 feet to the point of tangency of said curve; Said Arc being subtended by a chord bearing and distance of S 26°53’23” W, 68.83 feet; thence S 16°36’32” E, a distance of 553.66 feet to the point of a curve to the left; Said curve being concave Northeasterly and having a radius of 50.0 feet, and a central angle of 74°09’45”; thence Southeasterly around said curve an Arc distance of 64.72 feet to the point of tangency of said curve; Said Arc being subtended by a chord bearing and distance of S 53°41’24” E, 60.29 feet: thence N 89°13’43” E a distance of 418.16 feet to the point of a curve to the left; Said curve being concave Northwesterly and hav1ng a radius of 50.0 feet and a central angle of 90°07’13”; thence Northeasterly around said curve an Arc distance of 78.64 feet to the point of tangency of said curve; Said Arc being subtended by a chord bearing and distance of N 44°10’07’’ E, 70.78 feet; thence N 0°53’30” W a distance of 294.21 feet to the p0irit of a curve to the left: Said curve being concave Southwesterly and having a radius of 50.0 feet and central angle of 54°08’21”; thence Northwesterly around said curve an Arc distance of 47.24 feet lo the point of tangency of said curve; Said Arc being subtended by a chord bearing and distance of N 27°57’36” W, 45.50 feet: thence N 55’01’42” W a distance of 502.2 feet; thence N 34°58’18” E a distance of 50.0 feet to said reference Point “A” and the Point of Beginning. WITNESS my hand and the seal of this Court on the 18th day of February, 2022. Stacie D. Harvey Clerk of the Court Kayse Fiano As Deputy Clerk Bernard & Schemer, P.A. 480 Busch Drive Jacksonville, FL 32218 (904) 751-6980 2/24-3/17c PUBLIC NOTICE The Northeast Florida Regional Council’s Board of Directors will be conducting an Educational Summit on Overdoses. The Summit will highlight several successful programs that have been implemented by counties in the region, in hopes they can be replicated in other communities. The focus will be on sharing best practices, understanding needs, and identifying gaps as we start the conversation on a regional level. Date/time: Thu, Mar 31, 2022, 9:00 AM EDT Location: World Golf Village Renaissance St. Augustine Resort, 500 South Legacy Trail St. Augustine, FL 32092 Notice is also given that one or more members of Boards of County Commissioners, City/Town Councils/Commissions and other entities covered under Chapter 286, Florida Statutes, may join and/or speak at this meeting. For more information or agenda, please contact Tyler Nolen at (904) 279-0880 ext. 108 or tnolen@nefrc.org. 3/17c Miracle Automotive & Truck Service Center Inc. 10510 Duval Lane Macclenny, FL 32063 Notice of Public Sale: Miracle Automotive & Truck Service Center Inc. gives Notice of Foreclosure of Lien and intent to sell these vehicles on April 1, 2022, 11:00 am at 10510 Duval Lane, Macclenny, FL 32063, pursuant to subsection 713.78 of the Florida Statutes. Miracle Automotive & Truck Service Center Inc. reserves the right to accept or reject any and/or all bids. 2004 Chevrolet Impala VIN# 2G1WF52E049223643 3/17c public notice Share. Facebook Twitter Email Jessica Prevatt Website Related Posts Legal Notices 9-4-2025 Public Notices September 3, 2025 Legal Notices 8-28-2025 Public Notices August 28, 2025 Legal Notices 8-21-2025 Public Notices August 28, 2025 Legal Notices 8-14-2025 Public Notices August 13, 2025 Legal Notices 8-7-2025 Public Notices August 6, 2025 Legal Notices 7-31-2025 Public Notices July 30, 2025 Add A Comment Comments are closed. Search Legal Notices Search for: Search Button © 2025 The Baker County Press. Contact Us Contact Advertising/Production Director: Jessica Prevatt – advertising@bakercountypress.com Contact Classifieds: Camille FitzPatrick Contact News Editor: Joel Addington – editor@bakercountypress.com Contact Publisher: Jessica Prevatt – advertising@bakercountypress.com Contact Sports Editor: Kevin Upright – sports@bakercountypress.com Privacy Policy E-edition Submit Type above and press Enter to search. Press Esc to cancel. Ad Blocker Enabled! Ad Blocker Enabled! Our website is made possible by displaying online advertisements to our visitors. Please support us by disabling your Ad Blocker. Sign In or Register Welcome Back! Login below or Register Now . Log In Remember Me Lost password? Register Now! Already registered? Login . Password (please type it twice) * password strength indicator First Name * Last Name * Street Address * City, State * Zip Code * Enter a Valid Phone number (including area code) * Yes, I want to receive updates via email. Register A password will be e-mailed to you."
    },
    {
      "url": "https://gallatincountyfairgrounds.com/about-us",
      "text": "Gallatin County Fairgrounds | History | About Us Skip to Content The State Fair Public Events Facilities Fairgrounds Future Careers/About Us Contact Us Careers/About Us Learn more about the Fairgrounds Our Mission To provide an enjoyable, safe, year-round, and multi-use public facility, emphasizing opportunities in entertainment, education, agriculture, and recreation that enhances partnerships in building a stronger community. Job Opportunities Fairgrounds Temporary Gate Staff Fairgrounds Temporary Maintenance Worker Maintenance Woker- Fairgrounds & Regional Park What We Do The Fairgrounds is a true center for activities and events that enhances partnerships and brings the community together. Our multi-use public facility operates year-round, providing a safe and enjoyable space to host events of all kinds. From sports, educational, and agricultural events to wedding receptions, class reunions, and commercial functions, our facility can be adapted to meet all your event needs and create a memorable experience. GCF-General-Policies-1.13.21.pdf Fairgrounds Community Visioning Open House Gallatin County Fairgrounds Hosting Community Visioning Open\nHouse As a central,\nmulti-purpose space that our community has used to gather for over 100 years,\nthe Gallatin\nCounty Fairgrounds is an important cultural destination and asset for our\nregion. In order to continue holding that honored space in the lives of our\ncommunity, we're embarking on a community visioning and master planning process\nto understand how to best update and utilize this space in perpetuity. Join us for the\nGallatin County Fairgrounds community visioning open house on Thursday, Feb.\n29. The event will be from 5-7 PM at the Gallatin County Fairgrounds (901 N.\nBlack Ave. in Bozeman) in Exhibit Building 4. Light refreshments will be\nserved! This is a first\nstep in the planning process and will focus on understanding the public's\ndiverse perspectives related to existing strengths, challenges and experiences\nat the fairgrounds, as well as needs and ideas for the future. Questions?\nContact Caitlin Quisenberry, fairgrounds director, at caitlin.quisenberry@gallatin.mt.gov or 406-582-3270. Our History Gallatin County Fairgrounds (GCF) has been serving the community since 1902 and the first Fair was held on the grounds in 1903. The property was purchased by a group of Bozeman pioneers in 1898 from the University of Syracuse with the express purpose of creating a regional Fairgrounds. The property is currently comprised of 26 buildings on 78 acres surrounded by the City of Bozeman. Downtown lies a few blocks to the south, Walmart and the major shopping corridor along North 7th is immediately west, major hotels are within the immediate vicinity, and direct access onto I90 is right around the corner. Historically, the Fairgrounds has served as a gathering place for the agricultural community and as host to the summer and winter fairs. Those roots still play a prominent role at the Fairgrounds today as the Gallatin Valley has grown and urbanized, and other uses and groups of people have become equally as prominent. Increasingly, sports such as ice hockey, baseball, and the shooting range draw as much interest as 4-H and rodeo. The local 4-H continue to have their year-end shows to finish their projects. Our recent history shows that the name of our Fair has changed over the years from GallaCo to Gallatin County Fair and in 2016 to Big Sky County State Fair. The story of the Fairgrounds mirrors the story of Gallatin County: new and vibrant uses have begun encroaching on the more traditional agricultural uses and some of those agricultural uses have begun to move. Fair Board Agendas 2022 Agendas April Agenda February 2022 January 2022 2021 Agendas November 2021 October 2021 September 2021 August 2021 June 2021 May 2021 April 2021 March 2021 February 2021 January 2021 2020 Agendas November 2020 October 2020 September 2020 July 2020 June 2020 May 2020 April 2020 March 2020 February January 2020 Older Board Agendas 2019 Agendas December 2019 November 2019 Special Meeting November 2019 October 2019 September 2019 August 2019 June 2019 May 2019 April 2019 February 2019 Special Meeting February 2019 January 2019 2018 Agendas December 2018 October 2018 September 2018 August 2018 June 2018 May 2018 April 2018 March 2018 February 2018 January 2018 2017 Agendas December 2017 November 2017 October 2017 09/19/2017 June 2017 May 2017 April 2017 March 2017 (Held April 4) February 2017 January 2017 2016 Agendas December 2016 November 2016 October 2016 September 2016 August 2016 May 2016 April 2016 March 2016 February 2016 January 2016 Fair Board Minutes 2021 Minutes February 2021 January 2021 2020 Minutes November 2020 October 2020 September 2020 July 2020 June 2020 May 2020 April 2020 January 2020 2019 Minutes November 2019 Special Meeting November 2019 September 2019 August 2019 June 2019 May 2019 April 2019 February 2019 Special Meeting February 2019 January 2019 October 2019 Older Board Minutes 2018 Minutes December 2018 October 2018 September 2018 August 2018 June 2018 May 2018 April 2018 March 2018 February 2018 January 2018 2017 Minutes October 2017 September 2017 June 2017 May 2017 April 2017 March 2017 (Held April 4) February 2017 2016 Minutes December 2016 November 2016 October 2016 September 2016 August 2016 May 2016 April 2016 March 2016 February 2016 January 2016 WHAT’s UP NEXT AT THE FAIRGROUNDS See All Events  Back to Top Join Our Email List Email First Name Last Name Thanks for joining our mailing list You've been successfully subscribed - thanks! SUBSCRIBE Gallatin County Fairgrounds 901 N Black Ave Bozeman, MT 59715 Home The State Fair Public Events Facilities FAQs Fairgrounds Future Careers/About Us Contact Us (406) 582-3270 (406) 582-3270   Big Sky Country State Fair App Privacy Policy Website design by JTech Communications © 2025 Gallatin County Fairgrounds"
    },
    {
      "url": "https://www.bakercountyor.gov/fair/fair.html",
      "text": "Baker County-Fair Home Departments Administrative Admin Services Clerks Commissioners Facilities Treasurer Tax Collector Roads and Land Assessors Building County Surveyor Planning Roads Transit Weeds Health & Safety District Attorney Emergency Mgmt Health Justice Court Juvenile Parole & Probation Sheriff's Office 911 Veterans Departments Fee Schedule Phone Directory Links Boards/Committees All Committees/Boards Commissions/Councils/Coalitions Task Force Volunteer Applications Cities Baker Greenhorn Haines Halfway Huntington Richland Sumpter Unity Fair & Rodeos Baker County Haines Stampede Halfway Museums Baker Heritage NHOTIC Other County Museums Natural Resources BMFPR BIC Mason Dam Project Natural Resource Plan Renewable Energy Sage Grouse Strategic Action Plan Parks Hewitt & Holcomb Other County Parks Property Fair Housing Ordinances Foreclosures Related Links Maps Other Links RFP's RPF Listing Fair Meet the Board Grounds Our Partners Directions Fair Our Mission The mission of the Baker County Fairboard is to manage, maintain and promote the Baker County Fair Grounds for the benefit of its citizens. Upcoming Events: Current Fair Information Master Plan 2600 East Street Baker City, OR   97814 Phone: (541) 523-7881 Fax: (541) 524-9567 E-mail: bakerfair@bakercounty.org Fair Meet the Board Fair Board Members Ron Rowan - Chairman Dean Defrees - Vice Chairman Michelle Kaseberg Cliff Schoeningh Terri Siddoway Mike Sulivan Fair Staff Currently Angela Robb Office Manager Ashleigh Kautz Administrative Program Assistant Maintenance/Janitorial Advisory Board Members Terri Siddoway Janice Cowan Rob Ellingson Mark Bennett 2600 East Street Baker City, OR   97814 Phone: (541) 523-7881 Fax: (541) 524-9567 E-mail: bakerfair@bakercounty.org Fair Grounds Grounds Map Click on Map to see Larger View 2600 East Street Baker City, OR   97814 Phone: (541) 523-7881 Fax: (541) 524-9567 E-mail: bakerfair@bakercounty.org Fair Our Partners Platinum Sponsors Baker City Herald Behlen Country D&B Supply Eagle Cap Nursery Eastern Oregon Rental & Sales Elkhorn Media Group Oregon Trail Livestock Supply Robbins Farm Equipment Gold Sponsors Ash Grove Cement Baker County Press Bisnett Insurance Blue Mountain Baptist Church Britt Sand & Gravel/Farwest Concrete Clarke & Clarke Insurance Community Bank Gyllenberg Equipment, Inc. Mountain Valley Dental Group Old West Federal Credit Union Oregon Trail Electric Cooperative Subway Silver Sponsors Ace Nursery ACI Banner Bank Best Western Sunridge Inn Black's Distributing, Inc C & H Pumps and Motors Gentry Auto Group Grumpy's Repair Haines Steak House Inland Cafe Lew Brothers Les Schwab Tire Center Mackenzie Ranch, LLC Miles Ranch Inc Northwest Farm Credit Services Pizza Hut Siddoway Ranches Silven Schmeits & Vaughan St. Luke's Clinic - EOMA State Farm - Nick Conklin Thomas Angus Ranch Wheatland Insurance Center, Inc Wildhorse Resort & Casino Bronze Sponsors Baker City Lions Club Baker Dental Group Baker Veterinary Hospital Chandler Herefords Inc. Guyer & Associates Harrell Hereford Ranch, Inc Kiwanis Club of Baker City Miller Lumber & Truss Oregon Sign Company Record Courier Thews Sheet Metal Garnet Sponsors Baker Botanicals Bingham Bingham & Watt Blue Mountain Design Works Chaves Consulting, Inc Crown Paper & Janitorial P&E Distributing Premier Auto Body Safeway Sid Johnson & Co. Soroptimitst International of Baker City State Farm - Gregg Hinrichsen Sweet Wife Baking Thatcher's Ace Hardware Val's Veggies Super 8 Fair Directions View Larger Map 2600 East Street Baker City, OR   97814 Phone: (541) 523-7881 Fax: (541) 524-9567 E-mail: bakerfair@bakercounty.org Baker County Oregon Official Web Site Baker County Oregon 1995 3rd Baker City, OR 97814 Phone: (541) 523-8200 Fax: (541) 523-8201 TTY: (541) 523-9538 Connect with Us Baker County operates under an EEO policy and complies with Section 504 of the Rehabilitation Act of 1973 and the Americans with Disabilities Act.  Assistance is available for individuals with disabilities by calling 541-523-8200 (TTY: 541-523-9538). Read our Liability Statement and Supported Browsers. Send questions or comments about this website to webmaster@bakercountyor.gov ."
    },
    {
      "url": "https://www.secureitsecurities.com/contact-us",
      "text": "Contact Us - Get In Touch With Our Security Systems Company 24/7 845-445-6446 info@secureitsecurities.com 24 Hour Emergency Service About Us About Us Blog Service Areas View All Nanuet Stony Point The Fire Alarm Insider's Podcast Services Interactive Home Security Security Cameras The Fire Alarm Business Blueprint Fire Alarm & Life Safety Pearl River, NY Palisades, NY Haverstraw, NY Access Control System 24/7 Professional Monitoring Fire Alarm Monitoring Jobs at SIS SIS CORP Training Center Government Government Clients Commercial Clients Our Secured Community Smart Home Store Contact Us Buy Now About Us About Us Blog Service Areas View All Nanuet Stony Point The Fire Alarm Insider's Podcast Services Interactive Home Security Security Cameras The Fire Alarm Business Blueprint Fire Alarm & Life Safety Pearl River, NY Palisades, NY Haverstraw, NY Access Control System 24/7 Professional Monitoring Fire Alarm Monitoring Jobs at SIS SIS CORP Training Center Government Government Clients Commercial Clients Our Secured Community Smart Home Store Contact Us Login Register | Login | My Cart 0 24 Hour Emergency Service Contact Us for Security Services in Rockland County, NY Home › Contact Us for Security Services in Rockland County, NY Contact Us for Security Services in Rockland County, NY Contact Secure IT Securities for Security Solutions in Rockland County Whether you're a homeowner in Pearl River or a business owner in Rockland County, Secure IT Securities\nCorp. offers security solutions to meet your specific needs. Reach out to us for a security consultation or to request a security quote . Our staff will work closely with\nyou to understand your needs and provide the best possible security solution. You can also schedule a\nsecurity assessment, to have our experts evaluate your property and recommend the most suitable\nsecurity measures. To get started, give us a call at (845) 445-6446 or fill out form below, and we'll be in touch with you. 24 Hour Emergency Service 1 Blue Hill Plaza, Suite 1509 Pearl River, NY 10965 845-445-6446 info@secureitsecurities.com Hours Monday - Friday: 8:00 AM - 5:00 PM Saturday : 9:00 AM - 3:00 PM Sunday : CLOSED Leave A Message Contact First Name: * Last Name: * City: * Phone Number : * Email: * Message: Contact Us Secure IT Securities Corp. 1 Blue Hill Plaza #1509 Pearl River, NY 10965 info@secureitsecurities.com 845-445-6446 About Us Services Interactive Home Security Security Cameras Fire AlarmLife Safety Access Control System 24-Hour Monitoring Government Commercial Clients Return Policy Standard Service Agreement Accessibility Statement Privacy Policy Our Partners Terms Of Services Smart Home Store Contact Us Blog About Us Services Interactive Home Security Security Cameras Fire AlarmLife Safety Access Control System 24-Hour Monitoring Government Commercial Clients Blog Our Partners Return Policy Cookie Policy Contact Us New York State Fire & Security License #12000295002 | Smart Home Security Solutions in Pearl River, NY My Cart 0 By using our website, you agree to the use of cookies as described in our Cookie Policy Accept × Shopping Cart × Your cart is empty. Continue Shopping"
    },
    {
      "url": "https://perrycountyfairgrounds.com/contactus",
      "text": "Contact Us/Office Hours — The Perry County Fairgrounds The Perry County Fairgrounds Cart 0 Home The Fair The Gun Bash Photo Archive The Fair Board Contact Us/Office Hours Financial  Business SPONSORS & SPECIAL THANKS Cart 0 Home The Fair The Gun Bash Photo Archive The Fair Board Contact Us/Office Hours Financial  Business SPONSORS & SPECIAL THANKS The Perry County Fairgrounds Do Anything Our Office 5445 State Route 37 West New Lexington, OH 43764 Office: 740.342.3047 Fairground Rentals: 740.342.3047 OFFICE HOURS: Tuesday:  9:00 AM TO 1PM Thursday: 9:00AM TO 1PM STARTING AUGUST 18 2025 TILL SEPT 5 2025 OFFICE HOURS  MONDAY THRU FRIDAY 9 AM TO 1 PM Contact Us Name * First Name Last Name Email Address * Subject * Message * Thank you! Perry County Fairgrounds 5445 State Route 37 W., New Lexington, Ohio, 43764 7403423047 perrycofair@yahoo.com Hours Follow Us On Social Media mailing address ,  PO BOX 189   New Lexington, Ohio 43764 street address ,   5445 state route 37 west ,New Lexington, Ohio 43764 Office phone: 740 - 342 - 3047 Email: perrycofair@yahoo.com  or  Email: Perrycoagsoc@gmail.com New Index"
    },
    {
      "url": "https://www.falcofair.com/contact.aspx",
      "text": "CONTACT US skip to main content Area Weather Hours and Directions My Account View My Account View Cart: Search Website Search Sign up for email updates from Fallon County Fairgrounds Email Get Updates Tickets & Deals FAIRGROUNDS FAIR BOARD MINUTES & AGENDA HOURS OF OPERATION FAIRGROUNDS MAP SPONSORS FAIR HISTORY LOST & FOUND EVENTS Event Calendar Fallon County Fair Other Events GET INVOLVED BE A VOLUNTEER BE A FOOD VENDOR BE A MERCHANDISE VENDOR BE A SPONSOR FACILITY RENTAL RENTING EXHIBIT HALL RENTING INDOOR/OUTDOOR ARENA Skip Navigation Links Home > CONTACT US CONTACT US Fallon County Fairgrounds PO Box 998 3440 HWY 7 Baker, MT 59313 Phone: 406.778.2451 Email:fairgrounds@falloncounty.net Fairgrounds Manager: Jennefer Wheeler 406.778.2451        PO Box 998, Baker, MT 59313 Home | FAIRGROUNDS | EVENTS | GET INVOLVED | FACILITY RENTAL | CONTACT US | Site Map | Privacy, Terms & Cookies | Purchase Policy My Account View My Account Copyright ©2025, Fallon County Fairgrounds. All Rights Reserved. Powered by Back to Top My Account Log Out Log In Search Search Tickets & Deals Hours and Directions CONTACT US Site Map Privacy, Terms & Cookies Purchase Policy"
    }
  ]
}