{
  "fuentes": [
    {
      "url": "https://www.ballchain.com/contact-us/",
      "email": "contact@ballchain.com"
    },
    {
      "url": "https://www.cntraveler.com/bars/miami/ball-and-chain",
      "email": "help@newyorker.com"
    },
    {
      "url": "https://www.farrow-ball.com/contact-us",
      "email": "customerrelations@farrow-ball.com"
    },
    {
      "url": "https://www.farrow-ball.com/contact-us",
      "email": "sales@farrow-ball.com"
    },
    {
      "url": "https://ca.trustpilot.com/review/ballandchainco.com",
      "email": "privacy@trustpilot.com"
    },
    {
      "url": "https://www.restaurantnews.com/ball-chain-founders-announce-new-restaurant-business-venture-in-little-havana-101518/",
      "email": "cheryl@trinitygrouppr.com"
    },
    {
      "url": "https://www.nbcmiami.com/news/local/ball-chain-owners-file-multi-million-dollar-suit-alleging-harassment-from-miami-officials/2563890/",
      "email": "southflorida-web@3x.png"
    },
    {
      "url": "https://www.ballandchain.ca/contact-us",
      "email": "ballandchain@bell.net"
    }
  ],
  "mails": [
    "ballandchain@bell.net",
    "cheryl@trinitygrouppr.com",
    "contact@ballchain.com",
    "customerrelations@farrow-ball.com",
    "help@newyorker.com",
    "privacy@trustpilot.com",
    "sales@farrow-ball.com",
    "southflorida-web@3x.png"
  ],
  "nombre_sitio": "ballandchainmiami.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.ballchain.com/contact-us/",
      "text": "Contact Us | Ball Chain Manufacturing \\ \\ Toggle menu 914-664-7500 Login or Sign Up 0 Search × Search × Main Menu Home Chain Finishes Chain Sizes Dog Tag Dimensions Glossary Contact Us ISO Certificate About Us Blog Shop By Category Attachments & Connectors A Couplings A Hooks Alligator Clips B Couplings #3 'B' Couplings BALL CHAIN VIPER V-TYPE CRIMP CONNECTOR #6 'B' Couplings #8 'B' Couplings #10 'B' Couplings #13 'B' Couplings #15 'B' Couplings #20 'B' Couplings #30 'B' Couplings Clamshell End Caps Clamshell End Caps Combination Pliers Connectors #1 Connectors #3 Connectors #6 Connectors #8 Connectors D Couplings End Ring Connectors Open Balls 3/32\" Open Ball 1/8\" Open Ball 5/32\" Open Ball 3/16\" Open Ball 1/4\" Open Ball 5/16\" Open Ball 3/8\" Open Ball 1/2\" Open Ball Pendants plastic connectors for #10 chain Sleeves BALL CHAIN VIPER V-TYPE CRIMP CONNECTOR Braided Wire with Screw Lock DEAL OF THE DAY Ball Chain Key Chains #3 Size Key Chains 4 Inch 4.5 Inch 6 Inch #6 Size Key Chains 4 Inch 4.5 Inch 6 Inch Ball Chain Neck Chain Lanyards #3 Standard Size Chains 24 Inch Chains 27 Inch Chains 30 inch Chains 36 Inch Chains 38 Inch Chain #6 Size Chains Ball Chain Lanyard Specials Ball Chain Pre-Cut Lengths 4\" - 6\" #3 Chain #6 Chain 8\" - 16\" #1 Chain #2 Chain #3 Chain #6 Chain #13 Chain #20 Chain 18\" + #1 Chain #2 Chain #3 Chain #6 Chain #10 Chain #13 Chain #20 Chain Ball Chain Spools #1 Chain #2 Chain #3 Chain #6 Chain #8 Chain #10 Chain #13 Chain #15 Chain #20 Chain #30 Chain #50 Chain Sterling Silver Spools Binder Rings Bottle Openers Carabiners Ceiling Fan Chains (3 Foot) Color Ball Chains & Rings Black Ball Chains Color Coated Lanyards Color Coated Spools #3 Color Coated Ball Chain Spools #6 Color Coated Ball Chain Spools #10 Color Coated Ball Chain Spools Color Key Chains Color Split Key Rings Military Camo Colors Copper Products Copper Attachments & Connectors Copper Beads Copper Conical Beads Copper Crimp Covers Copper Elliptical Bars Copper Faceted Beads Copper Fluted Beads Copper Plain Bars Copper Spiral Beads Copper Elliptical Spiral Bars Copper Round Beads Copper Rondell Beads Copper Ceiling Fan Chain Copper Pre-Cut Lengths Copper Spools Dog Tags & Accessories Blank Dog Tags Standard Size Mini (Small) Size Monster (Large) Size Custom Military Dog Tags Dog Tag Chains Dog Tag Embossing Machines Dog Tag Findings Dog Tag Key Chains Dog Tag Kits Dog Tag Silencers DOG TAG SUPPLY KIT International Flag Dog Tags Findings Alligator Clips Braided Wire with Screw Lock Cubicle Curtain Carriers E-Z Clips Key Ring & Chains Permanent Wire Fasteners Plastic Locking Tabs Shower Curtain Rings Trigger Snaps Fishing Swivels #10 Chain Fishing Swivels #15 Chain Fishing Swivels #6 Chain Fishing Swivels Hooks Jewelry Chain Nickel Plated Brass Jewelry Chains Stainless Steel Jewelry Chain Sterling Silver Jewelry Chain Sterling Silver Jewelry Spools Jump Rings Oval & Round Jump Rings Triangle Jump Rings Key Rings (Split Rings) Binder Rings Black Split Key Rings Brass Plated Steel Split Key Rings Color Split Key Rings Figure 8 Split Key Rings Gun Metal Split Key Rings Key Ring & Chains Key Ring Wire Form Light Gauge Split Key Rings Nickel Plated Steel Split Key Rings Stainless Steel Split Key Rings Metal Beads Conical Beads Crimp Covers Gold Filled Crimp Covers Sterling Silver Crimp Covers Elliptical Bars Elliptical Spiral Bars Faceted Beads Fluted Beads Plain Bars Rondell Beads Round Beads Spiral Beads Pliers for ball chains Precious Metal Products Gold Filled Products Gold Filled Crimp Covers Sterling Silver Products Sterling Silver Crimp Covers Sterling Silver Chain Spools Sterling Silver Dog Tags Sterling Silver Pre-Cut Chain Roller Shade & Vertical Blind Parts #10 Blind & Shade Ball Chain Ball Chain & Bead Chain Pendants BALL CHAIN VIPER V-TYPE CRIMP CONNECTOR(TM) plastic connectors for #10 chain Ball Chain & Bead Chain Splicing Tool #10 \"B\" Couplings Bead Chain Stop Balls Shower Curtain Rings Wallet Chains Plumbing Chain & Parts Plumbing Chain Hooks Plumbing Chain Spools Plumbing Chain Pre-Cut Gift Certificates Login or Sign Up Search × Main Menu Home Chain Finishes Chain Sizes Dog Tag Dimensions Glossary Contact Us ISO Certificate About Us Blog Shop By Category Attachments & Connectors A Couplings A Hooks Alligator Clips B Couplings #3 'B' Couplings BALL CHAIN VIPER V-TYPE CRIMP CONNECTOR #6 'B' Couplings #8 'B' Couplings #10 'B' Couplings #13 'B' Couplings #15 'B' Couplings #20 'B' Couplings #30 'B' Couplings Clamshell End Caps Clamshell End Caps Combination Pliers Connectors #1 Connectors #3 Connectors #6 Connectors #8 Connectors D Couplings End Ring Connectors Open Balls 3/32\" Open Ball 1/8\" Open Ball 5/32\" Open Ball 3/16\" Open Ball 1/4\" Open Ball 5/16\" Open Ball 3/8\" Open Ball 1/2\" Open Ball Pendants plastic connectors for #10 chain Sleeves BALL CHAIN VIPER V-TYPE CRIMP CONNECTOR Braided Wire with Screw Lock DEAL OF THE DAY Ball Chain Key Chains #3 Size Key Chains 4 Inch 4.5 Inch 6 Inch #6 Size Key Chains 4 Inch 4.5 Inch 6 Inch Ball Chain Neck Chain Lanyards #3 Standard Size Chains 24 Inch Chains 27 Inch Chains 30 inch Chains 36 Inch Chains 38 Inch Chain #6 Size Chains Ball Chain Lanyard Specials Ball Chain Pre-Cut Lengths 4\" - 6\" #3 Chain #6 Chain 8\" - 16\" #1 Chain #2 Chain #3 Chain #6 Chain #13 Chain #20 Chain 18\" + #1 Chain #2 Chain #3 Chain #6 Chain #10 Chain #13 Chain #20 Chain Ball Chain Spools #1 Chain #2 Chain #3 Chain #6 Chain #8 Chain #10 Chain #13 Chain #15 Chain #20 Chain #30 Chain #50 Chain Sterling Silver Spools Binder Rings Bottle Openers Carabiners Ceiling Fan Chains (3 Foot) Color Ball Chains & Rings Black Ball Chains Color Coated Lanyards Color Coated Spools #3 Color Coated Ball Chain Spools #6 Color Coated Ball Chain Spools #10 Color Coated Ball Chain Spools Color Key Chains Color Split Key Rings Military Camo Colors Copper Products Copper Attachments & Connectors Copper Beads Copper Conical Beads Copper Crimp Covers Copper Elliptical Bars Copper Faceted Beads Copper Fluted Beads Copper Plain Bars Copper Spiral Beads Copper Elliptical Spiral Bars Copper Round Beads Copper Rondell Beads Copper Ceiling Fan Chain Copper Pre-Cut Lengths Copper Spools Dog Tags & Accessories Blank Dog Tags Standard Size Mini (Small) Size Monster (Large) Size Custom Military Dog Tags Dog Tag Chains Dog Tag Embossing Machines Dog Tag Findings Dog Tag Key Chains Dog Tag Kits Dog Tag Silencers DOG TAG SUPPLY KIT International Flag Dog Tags Findings Alligator Clips Braided Wire with Screw Lock Cubicle Curtain Carriers E-Z Clips Key Ring & Chains Permanent Wire Fasteners Plastic Locking Tabs Shower Curtain Rings Trigger Snaps Fishing Swivels #10 Chain Fishing Swivels #15 Chain Fishing Swivels #6 Chain Fishing Swivels Hooks Jewelry Chain Nickel Plated Brass Jewelry Chains Stainless Steel Jewelry Chain Sterling Silver Jewelry Chain Sterling Silver Jewelry Spools Jump Rings Oval & Round Jump Rings Triangle Jump Rings Key Rings (Split Rings) Binder Rings Black Split Key Rings Brass Plated Steel Split Key Rings Color Split Key Rings Figure 8 Split Key Rings Gun Metal Split Key Rings Key Ring & Chains Key Ring Wire Form Light Gauge Split Key Rings Nickel Plated Steel Split Key Rings Stainless Steel Split Key Rings Metal Beads Conical Beads Crimp Covers Gold Filled Crimp Covers Sterling Silver Crimp Covers Elliptical Bars Elliptical Spiral Bars Faceted Beads Fluted Beads Plain Bars Rondell Beads Round Beads Spiral Beads Pliers for ball chains Precious Metal Products Gold Filled Products Gold Filled Crimp Covers Sterling Silver Products Sterling Silver Crimp Covers Sterling Silver Chain Spools Sterling Silver Dog Tags Sterling Silver Pre-Cut Chain Roller Shade & Vertical Blind Parts #10 Blind & Shade Ball Chain Ball Chain & Bead Chain Pendants BALL CHAIN VIPER V-TYPE CRIMP CONNECTOR(TM) plastic connectors for #10 chain Ball Chain & Bead Chain Splicing Tool #10 \"B\" Couplings Bead Chain Stop Balls Shower Curtain Rings Wallet Chains Plumbing Chain & Parts Plumbing Chain Hooks Plumbing Chain Spools Plumbing Chain Pre-Cut Gift Certificates Login or Sign Up 4th Generation Family Company - Ball Chains Proudly Made in the USA Home Contact Us Contact Us Contact Ball Chain Manufacturing Please fill out the form below or contact us by: Phone 914-664-7500 FAX: (914) 664-7460 EMAIL: contact@ballchain.com MAILING ADDRESS: Ball Chain Mfg. Co., Inc. 741 South Fulton Avenue Mount Vernon, NY 10550 Full Name Phone Number Email Address * Order Number Company Name Comments/Questions * × OK Join Our Mailing List for special offers! Email Address Contact Us 741 South Fulton Avenue Mount Vernon, NY 10550 Accounts & Orders Wishlist Login or Sign Up Shipping & Returns Privacy Policy Terms & Conditions of Use Quick Links Home Chain Finishes Chain Sizes Dog Tag Dimensions Glossary Contact Us ISO Certificate About Us Blog Recent Blog Posts LogoTags, America’s Leading Name in Custom Challenge Coins, to Showcase at Kentucky Officers Leadership Symposium Fourth Generation, Family Owned LogoTags to Showcase Custom Challenge Coins at Kentucky Emergency Services Conference LogoTags, the USA’s Leading Custom Challenge Coin Company and Part of a Fourth-Generation Family Business, Sponsors 10th Annual Independence Day Military Ball Custom Challenge Coin Leader LogoTags, Family-Owned and Operated, Proudly Donates Custom Bottle Openers to Commander Strike Fighter Wing Atlantic Group Other Ball Chain Mfg. Co., Inc. Divisions: © Ball Chain Manufacturing | Sitemap Disclaimer: All products or images displayed on this website containing logos, trademarks or other intellectual property from customer orders are shown to illustrate the reproduction capabilities of Ball Chain Manufacturing Co., Inc.. Purchase of merchandise from us in no way conveys or grants you permission to reproduce any logos, trademarks or proprietary information, nor does it transfer, grant or lease ownership of any logos, trademarks or other intellectual property rights to you.*Free shipping is available within the continental United States only and at times HI and AK.  Ball Chain Mfg. Co., reserves the right to alter, revoke, change, or suspend this offer at any time.  This cannot be combined with other offers. Please contact Ball Chain Mfg. Co., Inc. for more information."
    },
    {
      "url": "https://www.cntraveler.com/bars/miami/ball-and-chain",
      "text": "Ball & Chain - Bar Review | Condé Nast Traveler Skip to main content Newsletter Sign In Search Search Newsletter Inspiration Destinations Places to Stay News & Advice Curated Escapes Shopping Cruise Women Who Travel Video North America Chevron United States Chevron Florida Chevron Miami Chevron Review: Ball & Chain A taste of Little Havana history with a side of stress relief. Photos Save Story Save this story Save Story Save this story Reviewed by Jennifer M. Wood First impression? The first thing you notice about Ball & Chain is that green and white awning, beckoning nighthawks to Little Havana for decades. Originally opened in 1935, the historic space has seen many changes—and owners—over the years, yet it kept hints of the past, like the original pine ceiling that Billie Holiday and Count Basie played under. If it’s a quiet night you’re after, look elsewhere; the venue’s two stages are always delivering great jazz and spirited salsa. So who’s there? You won’t find a single wallflower at Ball & Chain. The historic spot is a celebratory one—jazz music fills the air, flamenco dancers are regulars, and salsa dancing lessons are part of the weekly lineup. This is a crowd that embraces classic Miami nightlife—and their enthusiasm is contagious. You’ll be on your feet practicing your own moves in no time. How are the drinks? While live music and dancing are the main draw at Ball & Chain, the Cuban theme translates to the food and drink offerings. The rum-heavy menu keeps it classic with mojitos and bananita daiquiris, and brings in some local flavors with its Calle Ocho Old Fashioned (aged rum with tobacco infused bitters and tobacco leaf) and the Miami Mule (vodka, ginger beer, and fresh Key lime juice). Worth ordering something to eat, too? While most people think of Ball & Chain as a nightclub, it’s also a full-service—and very solid—Cuban restaurant that opens for lunch each day at noon. The tapas-style menu includes house-made sweet plantain chips and Cuban sandwiches. Did the staff do you right? Given the constant buzz of music, movement, and activity, service can sometimes be slow. But the positive vibes that the place and its denizens are giving off make that a minor thing. Bottom line: what are we coming here for? While Ball & Chain can easily make for a fun-filled date night, it’ll work much better with a partner who’s eager to let his or hair down. Otherwise, it makes a great spot for meeting up—and catching up—with a group of friends who embrace an old-school Miami party vibe. Location Map Contact Miami More To Discover Hotel Kimpton Surfcomber Hotel $$ | United States, Miami, 1717 Collins Ave. A cooler, unbuttoned take on your typical South Beach Art Deco boutique Book Now at Expedia Powered By: Expedia Hotel Andaz Miami Beach by Hyatt $$$ | United States, Miami Beach, 4041 Collins Ave A refined, relaxed, and upscale spot to enjoy a less-crowded Miami Beach vacation. Book Now at Booking.com Powered By: Booking.com Hotel The Moore $$ | United States, Miami, 4040 NE 2nd Ave An Art Deco jewel rife with art installations and members-only spaces for guests. Book Now at Michelin Guide Powered By: Michelin Guide Hotel Hyatt Centric South Beach Miami $ | United States, Miami,  1600 Collins Ave The recently renovated hotel in the heart of South Beach is a relatively quiet and affordable option. Book Now at Expedia Powered By: Expedia Hotel Gale Miami Hotel & Residences $$ | United States, Miami, 159 NE 6th St Step into impenetrable tranquility right in the heart of downtown Miami. Book Now at Booking.com Powered By: Booking.com Hotel The Elser Hotel $ |  United States, Miami,  398 NE 5th St A lush yet sleek stay in downtown Miami with unbeatable waterfront views. Book Now at Expedia Powered By: Expedia Read More 18 Best Bars in Miami Pinterest Facebook Snapchat Instagram X As the most discerning, up-to-the-minute voice in all things travel, Condé Nast Traveler is the global citizen’s bible and muse, offering both inspiration and vital intel. We understand that time is the greatest luxury, which is why Condé Nast Traveler mines its network of experts and influencers so that you never waste a meal, a drink, or a hotel stay wherever you are in the world. About Condé Nast Traveler Subscribe Manage Account Newsletter Sign Up Readers' Choice Awards Archive Contact the Editors Careers User Agreement Privacy Policy Your California Privacy Rights RSS Feeds Condé Nast Store © 2025 Condé Nast. All rights reserved. Condé Nast Traveler may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices Select international site United States LargeChevron India Spain United Kingdom Middle East Germany"
    },
    {
      "url": "https://www.farrow-ball.com/contact-us",
      "text": "Contact Us | Contact Our Team | Farrow & Ball The store will not work correctly when cookies are disabled. JavaScript seems to be disabled in your browser. For the best experience on our site, be sure to turn on Javascript in your browser. Skip to Content Close Select Country Europe France Germany Ireland Europe United Kingdom North America USA Canada Stockist Login Sign in Find a Stockist Basket Toggle Nav Menu Close Back Paint Paint Our Colours Grey White Neutral Black Blue Green Orange Pink Red Yellow Purple Brown Browse our Signature Palette Our Paint Our Collections New Colours Dead Flat Carte Blanche Archive Collection All Paint Colours Our Finishes Dead Flat® Modern Emulsion Estate Emulsion Modern Eggshell Estate Eggshell Full Gloss Exterior Eggshell Exterior Masonry Casein Distemper Soft Distemper Limewash Paint For Your Interior Walls & Ceilings Interior Wood & Metal Interior Floors Exterior Wood & Metal Exterior Walls Traditional Historic Properties Introducing Dead Flat® Ultra-matt & Scrubbable Multi-surface Colour Drenching with Dead Flat® Three Looks with Dead Flat® Decorating & Design Colour Cards & Samples Colour Cards Colour Fans Paint Samples Tools & Accessories Primers & Undercoats Brushes & Rollers Books How To Preparation & Application Advice Touching Up Paint Painting Kitchen Cabinets Painting Front Doors Painting Furniture Painting Planters Technical Information Calculating Paint Quantities Find Your Finish Product Advice Sheets Enjoy a free sample pot when you order two – it’s our treat. Pick Your Sample Pots Wallpaper Wallpaper Patterns & Collections Geometric Wallpapers Striped Wallpapers Metallic Wallpapers Floral Wallpapers Damask Wallpapers Scenic Wallpapers The Purnon Papers Carte Blanche View All Wallpaper Our Wallpaper Our Collections The Purnon Papers Carte Blanche View All Wallpapers Browse by Pattern Size Small Medium Large Brochures & Samples Wallpaper Brochure Wallpaper Samples Decorating & Design Tools & Accessories Wallpaper Paste Books How To Prepare & Hang Wallpaper Order The Right Amount Technical Information Product Advice Sheets Find your favourite pattern with our free wallpaper samples Start Sampling Colour Consultancy Colour Consultancy Colour Consultancy What Is Colour Consultancy? Book Your Colour Consultancy Enquire About A Consultancy Meet Our Experts Meet Our Experts Book Joa Studholme Book Patrick O'Donnell Transformations English Cottage Paris Apartment Munich Apartment Georgian Townhouse Texas Hideaway Need a little help? Let our expert Colour Consultants bring your style to life. Book Now Inspiration & Ideas Inspiration & Ideas Inspiration by Colour White Grey Blue Green Red Orange Pink Yellow Black Brown Purple View All Inspiration Browse Inspiration Gallery Inspiration by Room Living Room Ideas Blue Living Rooms Brown Living Rooms Dark Living Rooms Grey Living Rooms Green Living Rooms Neutral Living Rooms Pink Living Rooms Red Living Rooms White Living Rooms All Living Room Inspiration Bedroom Ideas Blue Bedrooms Dark Bedrooms Grey Bedrooms Green Bedrooms Neutral Bedrooms Pink Bedrooms Red Bedrooms White Bedrooms Yellow Bedrooms All Bedroom Inspiration Kitchen Ideas Blue Kitchens Dark Kitchens Grey Kitchens Green Kitchens Neutral Kitchens Pink Kitchens White Kitchens All Kitchen Inspiration Hallway Ideas Blue Hallways Dark Hallways Grey Hallways Green Hallways Neutral Hallways Pink Hallways Red Hallways White Hallways Yellow Hallways All Hallway Inspiration Bathroom Ideas Blue Bathrooms Dark Bathrooms Grey Bathrooms Green Bathrooms Neutral Bathrooms Pink Bathrooms White Bathrooms Yellow Bathrooms All Bathroom Inspiration Exterior Ideas Front Doors Exterior Wood Exterior Walls All Exterior Inspiration Dining Room Ideas Blue Dining Rooms Dark Dining Rooms Grey Dining Rooms Green Dining Rooms Neutral Dining Rooms Pink Dining Rooms Red Dining Rooms White Dining Rooms All Dining Room Inspiration More Rooms Study Ideas Children's Room Ideas Nursery Ideas Ideas to Inspire The Chromologist Browse The Blog News Inspiration Design Projects Collaborations The Picasso Museum Tan France Layton Williams Our Podcast Episode One: Mary Portas Episode Two: Tan France All Episodes Design Advice Building Colour Schemes Ways of Decorating How Light Affects Colour Colour Drenching Discover Our Neutral Groups Sign up to our emails for inspiration, advice and everything there is to know about our new colours. Sign Up Basket Search Search Search Compare Products Home Contact Us Contact Our Team Trustpilot Take a look at our FAQs for the most common topics of conversation or get in touch if you can’t find the answer you’re looking for. Our operating hours are Monday – Friday, 8.30am - 5.30pm. Saturdays we are open between 8am and 1pm. Our live chat team are available from 9.00am - 5.30pm, Monday to Friday (excluding bank holidays). For inspiration and ideas you can head to our Instagram , Pinterest and Facebook . For information on deliveries during this period please see our delivery page. EMAIL Sales, order queries, colour and general advice sales@farrow-ball.com Technical advice customerrelations@farrow-ball.com CONTACT US Name Email Address Order Number Message Send Message Sending... PHONE Sales, order queries, colour and general advice 01202 876141 8.30am - 5.30pm Monday to Friday 8am - 1pm Saturday 9am - 1pm bank holidays (GMT) Technical Advice 01202 850240 8.30am - 5.30pm Monday to Friday 9am - 1pm bank holidays (GMT) You can also view our product advice sheets ADDRESS Farrow & Ball Uddens Estate Wimborne Dorset BH21 7NL United Kingdom LIVE CHAT Our live chat team are available from 9.00am - 5.30pm, Monday to Friday (excluding bank holidays). Click on our live chat button on the right hand side to reach one of our colour experts. Returns If you wish to return your online order, please click the button below. Request a return Delivery Issue To report a problem with your delivery please click the button below. Report a delivery issue Product or Service Issue To let us know about an issue, please click below. Let Us Help Trustpilot About Us Responsibility Sign Up to Our Emails Social Media Press Become An Affiliate Events Careers Gender Pay Report Transparency Statement Diversity, Equity and Inclusion Customer Services Delivery & Returns Help & FAQs Contact Us Klarna Farrow & Ball Showrooms International Agents Accessibility Statement Terms & Conditions Privacy Policy Cookie Policy & Online Security Follow Us Pay Securely © 2023 Farrow & Ball Ltd. All rights reserved."
    },
    {
      "url": "https://ca.trustpilot.com/review/ballandchainco.com",
      "text": "BALL & CHAIN CO. Reviews | Read Customer Service Reviews of ballandchainco.com Suggested companies 21K World School 21kschool.world • 2 reviews 2.9 The Pump Club Official thepumpclubofficial.com • 2 reviews 3.8 UXER SCHOOL uxerschool.com • 241 reviews 4.8 Categories Blog Log in For businesses For businesses Log in Categories Blog Summary About Reviews Visit website Visit website Claimed profile BALL & CHAIN CO. Thanks for visiting Trustpilot. Unfortunately, it’s not possible to leave a review here anymore because the company’s website has closed. Feel free to contact us if you have any questions. Fashion Accessories Store Visit website Companies on Trustpilot aren't allowed to offer incentives or pay to hide reviews. See what reviewers are saying KT Kaczynski Tech Tips Feb 17, 2021 All the way back in April 2020, I spent more than $100 USD on items and paid for international first class shipping, and not even an email explaining why. Absolute scam, it's been ten months and not a... See more KA Katie Aug 11, 2019 I have ordered from Ball & Chain Co multiple times over the past two years. I have had great experiences one after another. One time I had an issue with my order, emailed there support directly (sup... See more TB Theo Bareis Jan 9, 2020 Placed two orders on the 8th of December, got confirmation emails and then never heard another word from the company. I’ve emailed multiple times and requested a refund, no reply. I’m just assuming th... See more MM Mckael Moffat Jan 31, 2021 I ordered from them before and never really had an issue always got my product and what not. However about six months ago I ordered a snow globe that was on sale never got it never had an email or any... See more See all 39 reviews We perform checks on reviews Company details Fashion Accessories Store Clothing Store Information provided by various external sources Apparel, Tapestries, Homewares and more. Free US Shipping. Contact info United States ballandchainco.com People also looked at 21K World School 21kschool.world 2.9 (2) The Pump Club Official thepumpclubofficial.com 3.8 (2) UXER SCHOOL uxerschool.com 4.8 (241) 24rent - Car rental 24/7 24rent.fi 1.8 (111) Boatflex boatflex.com 3.3 (88) Redcare Apotheke redcare-apotheke.ch 4.1 (2K) warm&cold warmandcold-shop.de 4.5 (43) How Trustpilot labels reviews More filters Most recent TI TixBowie US • 49 reviews Jun 22, 2021 bruises My mother beats me with this ☹️ It hurts June 22, 2021 Unprompted review KT Kaczynski Tech Tips AU • 2 reviews Feb 17, 2021 Not worth your money All the way back in April 2020, I spent more than $100 USD on items and paid for international first class shipping, and not even an email explaining why. Absolute scam, it's been ten months and not a single item or response as to why. Do not purchase anything from here, a good alternative would be strange ways February 17, 2021 Unprompted review MM Mckael Moffat US • 1 review Jan 31, 2021 Never got order I ordered from them before and never really had an issue always got my product and what not. However about six months ago I ordered a snow globe that was on sale never got it never had an email or anything and now their website is down and their Instagram  too. Super sus don’t buy from them. It was only $11 dollars so I just let it go but I’m still annoyed. January 31, 2021 Unprompted review WW Westland Wyvern US • 1 review Oct 11, 2020 Maintenance? I never had an issue with this business before, but if their website has been undergoing maintenance for nearly two months, that's how you know they're in deep doo doo. October 11, 2020 Unprompted review deanna kay US • 5 reviews Oct 10, 2020 Do not buy from here Do not buy from here. Took my money, no emails, no posts on Instagram, no product received. October 10, 2020 Unprompted review Consumer US • 1 review Updated Sep 22, 2020 This company sucks right now This company sucks right now, and looks like it's going out of business because of it....Woodie has always been rude, but at least back in the day your order would get filled. But these days you place an order and don't even hear from them after that. Hard pass. September 22, 2020 Unprompted review DI David in STL US • 1 review Aug 6, 2020 BALL & CHAIN CO. SUX! Take your money. Never ship your purchase. Ignore email inquiries. BALL & CHAIN CO. is a COMPLETE RIP-OFF!!!! Never spend money with them... August 6, 2020 Unprompted review AC Alastair Champion CA • 1 review Jul 1, 2020 Just avoid them Same thing, used to order a lot in the past and the company was great. Now I’ve been out $80usd for 2 months, have heard nothing back over the past month of me sending weekly emails (tried different emails as a post suggested) and still nothing. I’ve opened a dispute with my card. It’s a shame to see a company that I used to really enjoy supporting just become garbage. July 1, 2020 Unprompted review AH Arianne Hallett US • 2 reviews Jun 23, 2020 Ordered from them a couple years ago… Ordered from them a couple years ago and everything was fine... I placed an order about a month ago and only got a confirmation email and that’s about it... really wish I read these reviews before! I’ve been trying to contact them and just like everyone else I get no response.. Hopefully I will be able to figure something out with my bank because this is really unprofessional. Done. June 23, 2020 Unprompted review DA DANNY US • 1 review Updated May 14, 2020 this brand is CANCELLED I've received items from them in the past (and suprisingly loved them.) But a few times they've  just completely ripped me off. Customer service is non existent. They pick and choose who's orders they fix. I had to be very passive aggressive in the email to actually get them to send my stuff out lol. I would not recommend buying anything from here unless you're fine with possibly never getting anything out of it. They also have the comments turned off on their Instagram account, probably because a lot of people aren't receiving their stuff and they don't want to be exposed as the scam artist they are. If that isn't a big RED FLAG idk what is. Shame on the brand owners, whoever is processing the order, and whoever runs the disgrace they call customer service. THIS BRAND NEEDS TO BE EXPOSED. May 14, 2020 Unprompted review TB Tayler Berez US • 1 review May 8, 2020 DONT BUY FROM THEM, They will block you on social media, not respond to your emails. I bought an item from then on April 10th. 2 weeks later I emailed them saying pretty much that I understand that shipping may be delayed because of covid and I completely understand but just wanted to know when they would expect it to ship. No answer then after 4 weeks I emailed them. No answer. Then I direct messaged them saying I’d just prefer money back. No answer. Then a few days pass and I realized all their comments are turned off so no one can comment. So then I googled them and tons of people have said the same thing happened to them so i posted all those reviews on Instagram yesterday and then emailed them again. Then I woke up this morning  to a refund from them, no email response and when I went to look at their insta I realized they blocked me. I’m lucky I got my money back, but it’s probably because i scared them in my last email. DONT BUY FROM THEM May 8, 2020 Unprompted review JN Josh Neely US • 1 review Mar 9, 2020 THIS COMPANY IS A COMPLETE SCAM!!!!!! THIS COMPANY IS A COMPLETE SCAM! If I could give them a worse review than a 1 star, I would with no hesitation. I really wish I would have read reviews on the company before I made my purchase. Ordered a couple things from them and a month later, USPS hasn't even recieved my package from them yet. Dont be a sucker like me, exit there site while you still can! March 9, 2020 Unprompted review SO Sophie US • 1 review Feb 4, 2020 They are terrible They are terrible, if you go on their Instagram they have disabled comments. I used to order stuff for them and never had an issue. I ordered a tapestry and it’s been a month. I got the shipping email 2 weeks ago and it says it hasn’t even made it to the post office. This is a scam. February 4, 2020 Unprompted review DG Daniel Goodstone GB • 1 review Updated Feb 19, 2020 Update Feb 2020, not crooks after all, oops My original review here was one star, as I was convinced they'd stolen my money and were ignoring my messages. This is an update after finally recieving my stuff. So about two months after I made my order, and after trying in vain to message the company on every social media platform they have- I read somewhere that sending multiple emails to them might end up with your messages simply being marked as spam. Doesn't excuse the fact that my very first email was also ignored, BUT- after all that time I used a different email address to contact support @ ballandchainco.com (without the spaces of course) and they literally replied within 15 minutes. Apparently something went wrong with their new fulfilment system and a bunch of orders weren't processed properly. I'd have appreciated more than a brief sorry (after 2 months I was kinda hoping for a voucher code haha) I'm also a touch suspicious that my order was suddenly marked shipped that same day I emailed, but in the end everything I paid for was sent out and I didn't lose my £30. They made it very hard to contact them, but I hadn't used that specific email before, and it worked far better than the contact form on their page. Overall I'm happy with the product, not so happy they took two months to notice they had orders that were never sent. Here's hoping it's all sorted out and I can order from them without issue from now on, as the things they sell are great. January 20, 2020 Unprompted review TB Theo Bareis US • 1 review Jan 9, 2020 $70 dollars in the hole, nothing to show for it Placed two orders on the 8th of December, got confirmation emails and then never heard another word from the company. I’ve emailed multiple times and requested a refund, no reply. I’m just assuming they stole my money, just like everyone else has dealt with. I ordered almost 70 dollars worth of stuff with 2 day shipping and now it’s 2020 with no sign of my stuff. January 9, 2020 Unprompted review Kathy Pudmanski US • 2 reviews Jan 7, 2020 So wish I read these reviews before… So wish I read these reviews before purchase. Ordered a tapestry on 12/19. Order confirmed. sent emails asking where the order is. No response. Will be disputing charges. I live in NC where there are located and it’s not like they have to ship far. January 7, 2020 Unprompted review LI Lilith US • 1 review Jan 3, 2020 Taking Money - Not Sending Products... I have bought from Ball and Chain several times over the past five years and have never had a problem. However, it appears as though they are under new management or just don't give a damn about their customers in the last few months. Really disappointed I couldn't get gifts for my sister's birthday, even though I spent almost $70 and paid way before their birthday so it would arrive on time. After I didn't hear back about a tracking number, I reached out and emailed the support team. I gave them the 3 business days it said it would take to get back. No response. I reached out two more times... *crickets* so I ended up having to dispute the charges with my bank because they literally are just taking money and not sending people their orders. A real bummer considering how much I enjoy their products. I hope this gets resolved soon and I can write them a better review. January 3, 2020 Unprompted review Ravan Kennedy US • 1 review Updated Dec 29, 2019 If I could rank them lower I would Do NOT buy from this company. I placed an order 12/14, paid for 2-3 day shipping, and got the email confirming my order on that same day, but when I hadn't gotten a shipping email after 9 days of waiting I tried reaching out, but with no response, one email requesting to just cancel my order and give me my money back. I finally received a shipping email on 12/27, rather than getting my money back like I'd prefer. It shouldn't take 13 days to get my package shipped, and you should be able to get SOME kind of response from them. The comments on their instagram are disabled and with this kind of service I'm not surprised why. They don't want to get called out on their social media for their completely poor service. Never ordering from them again and I suggest you don't either. December 29, 2019 Unprompted review MA Mae US • 3 reviews Dec 23, 2019 Horrible customer service, convinced they stole my money I have been a fan of Ball and Chain Co's merch for a while and wanted to get my boyfriend something as a stocking stuffer. I bought 50.00 worth of pins on black Friday. I was sent a shipping confirmation email with a shipping code on 12/4. its the 23rd, two days before Christmas and i have received NO updates in regards to when the item is actually shipping, just that the label was created on 12/4. I have emailed them at least 6 times, messaged them on FB and Instagram with no reply. They have their comments turned off on their photos on Instagram probably so people arent constantly blasting them. I placed my order through the afterpay company called Sezzle and I am contacting them today to try to get my money back. I wouldn't have cared if the item came after Christmas, some communication would be nice. If they are having issues getting the items from a distributor or whatever, i can be patient but a month with no communication and after multiple attempts to reaching out to them - I'm angry and let down. December 23, 2019 Unprompted review GE Genna US • 2 reviews Dec 23, 2019 Same as the other reviews here Same as the other reviews here. Placed an order, received a tracking number that says my package hasn't been fufilled since December 4th, and I've contacted customer service twice with no response. Disputing the transaction with my bank now. December 23, 2019 Unprompted review Previous 1 2 Next page The Trustpilot Experience We're open to all Anyone can write a Trustpilot review. People who write reviews have ownership to edit or delete them at any time, and they’ll be displayed as long as an account is active . We champion verified reviews Companies can ask for reviews via automatic invitations. Labeled Verified, they’re about genuine experiences. Learn more about other kinds of reviews. We fight fake reviews We use dedicated people and clever technology to safeguard our platform. Find out how we combat fake reviews . We show the latest reviews Learn about Trustpilot’s review process . We encourage constructive feedback Here are 8 tips for writing great reviews . We verify reviewers Verification can help ensure real people are writing the reviews you read on Trustpilot. We advocate against bias Offering incentives for reviews or asking for them selectively can bias the TrustScore, which goes against our guidelines . Take a closer look are you human? Choose country Canada Danmark Österreich Schweiz Deutschland Australia Canada United Kingdom Ireland New Zealand United States España Suomi Belgique België France Italia 日本 Norge Nederland Polska Brasil Portugal Sverige About About us Jobs Contact Blog How Trustpilot works Press Investor Relations Community Trust in reviews Help Center Log in Sign up Businesses Trustpilot Business Products Plans & Pricing Business Login Blog for Business Follow us on Legal Privacy Policy Terms & Conditions Guidelines for Reviewers System status Modern Slavery Statement © 2025 Trustpilot A/S. All rights reserved."
    },
    {
      "url": "https://www.restaurantnews.com/ball-chain-founders-announce-new-restaurant-business-venture-in-little-havana-101518/",
      "text": "Ball & Chain Founders Announce New Restaurant Business Venture in Little Havana | RestaurantNews.com Home Restaurant News Feed Reviews Subscribe Send News Advertising Restaurant Franchise Opportunities About Contact Privacy Ball & Chain Founders Announce New Restaurant Business Venture in Little Havana October 15, 2018 · · Facebook Tweet LinkedIn Taquerias el Mexicano is Under New Ownership and There Will be a Novelty Candy Store Miami, FL  ( RestaurantNews.com )  The co-founders who are behind bringing the legendary Ball & Chain back to life four years ago, Zack Bush, Ben Bush and Bill Fuller, are thrilled to announce their next business venture in Little Havana. Mad Room Hospitality is pleased to officially announce they have acquired ownership of the iconic Calle Ocho Mexican spot, Taquerias el Mexicano. The authentic Mexican restaurant, who first opened its doors in 1985 at 521 SW 8 th Street, has been a long-standing landmark on the Ocho.  The Bush brothers and Fuller all share the same passion to preserve old concepts (like Ball & Chain) while adding modern twists.  “ Just like we do with all of our Mad Room Hospitality concepts, we want to keep the venue as authentic as possible–several key employees that have been an integral part of the restaurant for 15-20 years have played a crucial role in ensuring the integrity of this landmark establishment ” says co-owner and one of Miami’s leading nightlife veterans, Zack Bush, “ from the recipes, to the décor and pricing, we want to keep the identity fully intact . We are proud and honored to carry the Taquerias torch on Calle Ocho ”. Taquerias el Mexicano is a legendary piece of Calle Ocho history having been in operation for over 30 years serving authentic Mexican fare in a vibrant family-friendly atmosphere.  The 2,100 square foot space offers a full-service sit-down option for diners, features a full bar and craft cocktail menu as well as take-out and delivery available.   The food menu will remain the same–offering traditional Mexican favorites for lunch and dinner including tacos, tortas, burritos, flautas, enchiladas and fajitas.  All tortillas are handmade in-house daily, and the signature mole recipe contains 17 ingredients and is still a house favorite.  Breakfast is served daily offering a small variety of dishes such as Huevos Rancheros and Chilaquiles. No meal is complete without dessert and now guests will have the option for a one-of-a-kind experience at Los Altos Dulceria.  Located upstairs directly above the restaurant, Los Altos is a Mexican novelty store and candy shop set to open in late October 2018.  Guests will be able to hand-pick authentic Mexican sweets and candy and dress up and purchase costumes as well. Taquerias el Mexico will also be launching their own line of branded candy available for purchase in-store and online. New owners Zack & Ben Bush and Bill Fuller took this new ownership responsibility very seriously having traveled to Mexico several times on research and development trips to ensure full authenticity of the food and cocktails.  It was there they met renowned bartender Erick Gaytan , who they commissioned to consult and modify the Taquerias el Mexicano cocktail menu.  Gaytan is a legend in Mexico, who’s passion for mezcal and tropical cocktails made for an ideal collaboration for a Mexican restaurant in Miami.  The star of the menu is still the “La Famosa Frozen Horchata,” created from a homemade secret recipe.  Authentic Mexican classics also decorate the menu including the “Paloma Tradicional,” Sangrita and “Frozen Sombreros,” (frozen margaritas).  Happy Hour is offered daily from 3pm – 7pm featuring two-for-one margaritas and beers. For more information please visit: www.calleochotacos.com Contact: Cheryl Kate Hohweiler Trinity Group PR cheryl@trinitygrouppr.com 732-642-1724 Facebook Tweet LinkedIn Filed in: Press Release Tags: Ball & Chain , restaurant , restaurant news , Taquerias el Mexicano Restaurant Franchise Opportunities Recent Restaurant News KRISPY KREME Celebrates International Chocolate Day With Return of Fan Favorite Chocolate Original Glazed Doughnuts, This Thursday Through Sunday Federal Court Dismisses Meritless Lawsuit Against Dickey’s Executive, Vindicating Company Huge Comeback Calls for Huge Bowls: Teriyaki Madness Returns to Albuquerque Sept. 19 Polly’s Pies Celebrates Oktoberfest with Authentic German Flavors and Pumpkin Favorites FACE Amusement and Guy Fieri Foundation Bring Teddy Bears to Central Park for the Annual New York City Buddy Walk Huddle House Launches Smashed Burger Week in Honor of National Cheeseburger Day Restaurant Franchise News from The Taco Spot, Rock N’ Roll Sushi, Newk’s Eatery, and More! New Restaurant Menu Offerings from Bennigan’s, Steak and Ale, Chipotle, Straw Hat Pizza, and More! Applebee’s Brings Back National Cheeseburger Day Deal with $8.99 Burgers & Fries California Tortilla Serves a Week of Free Chips and Guac for National Guacamole Day Local Entrepreneur Brings Kitchen Guard to Louisville, Protecting the Heart of the City’s Dining Scene Farmer Boys Introduces Fall Offerings Featuring Parm-Crusted Cheeseburgers, Farmstand Menu Refresh, Seasonal Pumpkin Beverages, and Breakfast Specials Rich Products Expands Support of Foodservice Workers Through New Partnership With Giving Kitchen Sunny Street Café Spices Up Fall with Pumpkin Pancakes and Donut Holes Lime House Commemorating International Literacy Day 2025 Bad Daddy’s Burger Bar Fall Menu Returns with Bratwurst Burger and New Treats CRÚ Food & Wine Bar Ushers in New Era with Leadership Transition and Bold Rebrand Red Lobster’s New Ultimate SpendLESS Shrimp Is Big On Flavor & Light On Your Wallet Nothing Bundt Cakes Spreads Fall Flavor With ‘Cheers to Autumn’ Collection Twin Hospitality Group Inc. Appoints Lexi Burns as Chief People Officer Surcheros Celebrates Queso Day with FREE Queso Hawaiian Bros Celebrates Second Nebraska Location Paris Baguette Ranked No. 112 in 2025 Technomic Top 500 Chain Restaurants Report, Climbing Over 20 Spots From Prior Year Huddle House Launches Smash Burger Week Avalanche Food Group Gives Back to Teachers Distributing $78,000 in Grant Checks at Twin Peaks Restaurants Across Texas and Indianapolis McDonald’s and 19 More Restaurant News Headliners of the Past Week RestaurantRecruiter.com – Own the Domain That Defines the Industry’s Hiring Solution! Subscribe to RestaurantNews.com Fresh Feed: This Week’s Best Bites from the RestaurantNews.com Feed Katz’s Never Kloses: Famous 24/7 Dining Expands to Memorial City Eat More, Save More at Lee’s Famous Recipe Chicken This September The Taco Spot Expands Nationwide: A Franchise Opportunity Fueled by Explosive Growth and a 1.5 Million-Follower Fan Base Follow Us © 2025 RestaurantNews.com . All rights reserved."
    },
    {
      "url": "https://www.nbcmiami.com/news/local/ball-chain-owners-file-multi-million-dollar-suit-alleging-harassment-from-miami-officials/2563890/",
      "text": "Ball & Chain Owners File Multi-Million Dollar Suit Alleging Harassment From Miami Officials – NBC 6 South Florida Skip to content Main Navigation Search Search for: Local Weather Video On Your Side Investigates Responds Newsletters TV Listings Watch 24/7 Create profile / Log in Dashboard Email preferences Sign out Trending 🌪️Hurricane Season 6 to Know 📺Watch News 24/7 🔎 Send a Tip What’s Being Built Here Money Chat Dangerous Drive Newsletters How to Stream Expand Miami Ball & Chain Owners File Multi-Million Dollar Suit Alleging Harassment From Miami Officials The nearly $28 million lawsuit claims city leaders instituted raid-style inspections, some at peak business hours, and \"deliberately crafted\" city ordinances targeting Ball & Chain. By NBC 6 • Published September 30, 2021 • Updated on September 30, 2021 at 11:28 pm BOOKMARKER NBC Universal, Inc. The owners of several businesses in Little Havana — including the popular Ball & Chain — have filed a federal lawsuit against the City of Miami, alleging they weaponized city departments to run those once-booming businesses out of town. The 66-page lawsuit, filed Thursday by the Mad Room Hospitality — which owns Ball & Chain and Taquerias el Mexicano, along with other businesses — seeks $27.9 million in damages from the city. Watch NBC6 free wherever you are WATCH HERE The lawsuit claims city leaders instituted raid-style inspections, some at peak business hours, and \"deliberately crafted\" city ordinances targeting Ball & Chain . Thursday’s lawsuit comes days after a leaked memo from Police Chief Art Acevedo made similar claims against commissioners. This is the latest development in a public sparring match that spanned years. In 2019, Ball & Chain's co-owner, Bill Fuller, accused Commissioner Joe Carollo of illegally targeting his businesses after Fuller supported Carollo's political rivals. “The lies, and the unethics, and the crimes that this man has committed, will come out for everyone,\" Fuller said in 2019. Carollo said at the time the ownership group was serving alcohol illegally at another business and that late-night clubs didn’t belong in the area. Local 6 to Know 13 hours ago 6 to know – Top stories of the day Miami Gardens 2 hours ago Miami Gardens mayor speaks out about deadly dog attack as police update investigation “This man has got a history of doing what he pleases, in violation of building laws, code enforcement,\" Carollo said back in 2019. Since then, the lawsuit alleged city leaders put in a plan to issue bogus code violations, and passed a law targeting Ball & Chain by creating new noise restrictions. Ball & Chain was shut down in November 2020, and Taquerias el Mexicano was shut down back in August. The lawsuit says a restaurant manager was unjustly arrested, but the charges were dropped later. Carollo told NBC 6 by phone Thursday night that he has yet to read the lawsuit, but will soon. “This is going to read like some kind of novel, but very, very short on the truth,\" he said. “This is yet another attempt on Mr. Fuller’s part to deflect his illegal management of properties and businesses onto the city.  We look forward to addressing his conduct in court,\" said Victoria Mendez, the city's attorney. This article tagged under: Miami Little Havana Joe Carollo on now 10PM: NBC6 South Florida News Trending Stories NiteTalk: Black Bobby Is King of the Block Party Miami-Dade County Man killed in overnight shooting in SW Miami-Dade: Sheriff Miami-Dade County Miami man arrested in $700K ‘credit bust out' involving 14 vehicles: Sheriff YNW Melly Alleged accomplice of rapper YNW Melly in Broward double murder takes plea deal only on 6 Man accused in Miami triple fatal crash arrested in Spain after wrongful deportation Weather Forecast Facebook Instagram TikTok Youtube About NBC 6 Our News Standards Submit Tips for Investigations Newsletters Contact Us Xfinity: Internet, TV, streaming, more WTVJ Public Inspection File WTVJ Accessibility WTVJ Employment Information FCC Applications Terms of Service Advertise with us Send Feedback Privacy Policy Your Privacy Choices CA Notice Ad Choices Copyright © 2025 NBCUniversal Media, LLC. All rights reserved Close Menu Create profile / Log in Dashboard Search for: Newsletters News NBC 6 News Local US & World Weather Weather alerts Hurricane Season On Your Side Investigates Responds Submit a tip PolitiFact Impact With Jackie Nespral Voices With Jawan Strader South Florida Live Entertainment Traffic Sports Community About NBC 6 Our News Standards Submit a Consumer Complaint Submit Photos and Video Contests TV Schedule Our Apps Newsletters TV Schedule Cozi TV Follow Us Facebook Instagram TikTok Youtube Contact Us"
    },
    {
      "url": "https://www.ballandchain.ca/contact-us",
      "text": "Contact Us — Ball & Chain Skip to Content Open Menu Close Menu Ball & Chain Store Albums Live The Vanier Playboys Our Story Media Album Reviews News Contact 0 0 Ball & Chain Store Albums Live The Vanier Playboys Our Story Media Album Reviews News Contact 0 0 Open Menu Close Menu Store Albums Live The Vanier Playboys Our Story Media Album Reviews News Contact Contact Us For booking and general inquiries about Ball And Chain or The Vanier Playboys please contact Michael and/or Jody at ballandchain@bell.net. For CD sales go to ballandchain@bell.net or cdbaby.com Get in Touch Contact Us Name * First Name Last Name Phone (###) ### #### Email * Message * Thank you! Ball & Chain Copyright @2023 Home Store Albums Live Our Story The Vanier Playboys News Album Reviews Media Contact"
    }
  ]
}