{
  "fuentes": [
    {
      "url": "https://www.sidebargrill.com/contact-us/",
      "email": "hero-contact@2x.jpg"
    },
    {
      "url": "https://balmoraleventcenter.com/",
      "email": "eventcenter@feltrim.com"
    },
    {
      "url": "https://balmoraleventcenter.com/",
      "email": "garrett@feltrim.com"
    },
    {
      "url": "https://borellis.co.uk/contact/",
      "email": "info@borellis.co.uk"
    },
    {
      "url": "https://visitcentralflorida.org/featured/balmoral-bar-and-grill/",
      "email": "events@feltrimresorts.com"
    },
    {
      "url": "https://rivervillegrill.com/contact-us/",
      "email": "info@rivervillegrill.com"
    },
    {
      "url": "https://www.balmoral-group.com/company/people",
      "email": "sarah-jane.hogg@friendsofanchor.org"
    },
    {
      "url": "https://www.balmoral-group.com/company/people",
      "email": "bill.main@balmoral.co.uk"
    },
    {
      "url": "https://www.balmoral-group.com/company/people",
      "email": "boe-website@balmoral.co.uk"
    },
    {
      "url": "https://www.balmoral-group.com/company/people",
      "email": "gary.gerrard@balmoral.co.uk"
    },
    {
      "url": "https://www.balmoral-group.com/company/people",
      "email": "group@balmoral.co.uk"
    },
    {
      "url": "https://www.balmoral-group.com/company/people",
      "email": "info@blazeman.co.uk"
    },
    {
      "url": "https://www.balmoral-group.com/company/people",
      "email": "kevin.binnie@balmoral.co.uk"
    },
    {
      "url": "https://www.balmoral-group.com/company/people",
      "email": "paul.mitchell@balmoral.co.uk"
    },
    {
      "url": "https://www.balmoral-group.com/company/people",
      "email": "tanks-website@balmoral.co.uk"
    },
    {
      "url": "https://www.crerarhotels.com/collection/balmoral-arms/dine/1852/",
      "email": "balmoralarms@crerarhotels.com"
    }
  ],
  "mails": [
    "balmoralarms@crerarhotels.com",
    "bill.main@balmoral.co.uk",
    "boe-website@balmoral.co.uk",
    "eventcenter@feltrim.com",
    "events@feltrimresorts.com",
    "garrett@feltrim.com",
    "gary.gerrard@balmoral.co.uk",
    "group@balmoral.co.uk",
    "hero-contact@2x.jpg",
    "info@blazeman.co.uk",
    "info@borellis.co.uk",
    "info@rivervillegrill.com",
    "kevin.binnie@balmoral.co.uk",
    "paul.mitchell@balmoral.co.uk",
    "sarah-jane.hogg@friendsofanchor.org",
    "tanks-website@balmoral.co.uk"
  ],
  "nombre_sitio": "balmoralbarandgrill.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.sidebargrill.com/contact-us/",
      "text": "Contact Us - Sidebar Grill 778.298.7433 | Now Hiring View Menu Promotions Order Online Book A Table Live Music Home About Us Menu Events & News Event Venue Gift Cards Contact Us CONTACT US Get In Touch Please leave your name, email and message and we will respond within 48 hours. If you have an urgent request, please feel free to call us directly. 778.298.7433 info@sidebargrill.com View Form Unit B – 100 20018 83A Ave Langley BC, V2Y 3R4 Underground Parking Available SUNDAY TO THURSDAY 11am  - 11pm FRIDAY & SATURDAY 11am  - 12am Get Directions Get In Touch Please leave your name, email and message and we will respond within 48 hours. If you have an urgent request, please feel free to call us directly at: 778-298-7433. First Name * Last Name * Email * Phone Message 778.298.7433 info@sidebargrill.com Unit B – 100 20018 83A Ave Langley BC, V2Y 3R4 Underground Parking Available Available to serve you seven days a week: Monday – Thursday 10:00am-11:00pm Friday and Saturday 9:00am – 12:00am Sunday 9:00am - 11:00pm Home About Us Menu Events & News Private Dining Gift Cards Contact Us"
    },
    {
      "url": "https://balmoraleventcenter.com/",
      "text": "Home - Balmoral Event Center MENU Inicio Salones De Eventos Bodas Fiestas de cumpleaños en Balmoral Quinceañeros Nuestros Eventos Event Expo Blog Contáctenos Inicio Salones De Eventos Bodas Fiestas de cumpleaños en Balmoral Quinceañeros Nuestros Eventos Event Expo Blog Contáctenos Home Venues Accommodations Weddings Birthday Parties Water Park Parties Graduations Quinceañeros Baby Shower & Gender Family Reunions Corporate Venue Office Hub Services Event Tickets Blogs Testimonials FAQ Contact Us Hablamos Español Call (863) 225-2665 Text (863) 225-2665 116 Kenny Blvd, Haines City, FL 33844 Copyright © 2025 Balmoral Resort Florida Designed by FCDM New event center in Polk County, Florida. Plan your celebration in Central Florida. OUR EVENTS BOOK YOUR SPACE Our Event Center will be closed on Mondays and Tuesdays during September and October . During this time, we will not be offering tours or accepting walk-ins. Thank you for your understanding, and we look forward to welcoming you on other days of the week. Hours Monday – Tuesday: Closed Wednesday – Sunday: 10:00 AM – 6:00 PM Location 116 Kenny Blvd. Haines City, FL 33844 Convenient Venue Space in Polk County, Florida Customize Your Event at Balmoral Resort, Central Florida Brand-New Venue Space Our brand-new luxury venue comes standard with modern amenities, elegant touches, and enough space for everyone on your list. Located within the same complex as Balmoral Resort Florida , the Balmoral Event Center creates a home base for everyone in attendance. Centralized Location Our event venue in Haines City Florida, Balmoral Event Center , is the newest premier event center in east Polk County. Our party venue in Central Florida is located near many popular Orlando attractions , just south of I-4. Customize your event experience with Balmoral Event Center’s variety of both indoor and outdoor spaces. Whether you’re looking to host an intimate celebration or a large corporate meeting, our brand-new venue offers flexibility. Available Spaces GRAND BALLROOM Large customizable room offering ample space for meetings, events, parties and more. Room-sharing options available. WINDOW ROOM The Window Room serves as the perfect space for small events or meetings featuring gorgeous tile floors, modern floor to ceiling windows, access to the Outdoor Beer + Wine Garden. OUTDOOR BEER + WINE GARDEN Relaxing outdoor space perfect for small meetings or a day of work out of the office. Meetings & Events in Polk County, Florida Let Our Experts Help You Plan Events Our brand-new meeting venues in Haines City Florida, popular meeting rooms near Orlando, make it easy to plan your next meeting, corporate event, training session, or conference. Through our flexible venues, seating options, and state-of-the-art amenities, our experienced staff will create the perfect meeting space for your next corporate event. Celebrations Create lifelong memories at Balmoral Event Center when you plan your next celebration at the newest venue in Central Florida. From family reunions to holiday parties to birthday celebrations, our event experts make it easy to bring your vision to life. Gather friends and family in our flexible meeting space, nestled within the Balmoral Resort Florida complex; one of the preferred meeting venues near Orlando Florida. Events Services in Polk County, Florida Plan Your Event at Balmoral Event Center Balmoral Event Center provides all the necessary services to ensure a smooth and successful event. Our experienced staff members, skilled bartenders, and professional caterers will take care of everything for you and make sure your guests’ needs are met. Our event center offers seating, tables, and linens for any occasion. With many options for event services near Orlando, we’re hopeful that you choose to bring your dream event to reality at Balmoral Event Center. Accommodations Balmoral Resort combines the amenities of the very best private resorts in Florida with the space and comfort of a modern vacation home. Townhomes Settle into our spacious townhomes at Balmoral Resort just steps from the clubhouse, and bar & grill GET IN TOUCH Pool Homes All of our single-family homes feature screened in private swimming pools, patios, and more GET IN TOUCH Amenities Guests have access to premium resort facilities, so you can make yourself right at home. GET IN TOUCH Celebrate with us & stay with us! Allow us to build you a costume accommodation package Tell us about your event and accommodation needs. Our team will be happy to build a costume package for your group. Testimonials Hear what our customers have to say I had my daughter’s Sweet 16 at Balmoral. Keshawn helped me from beginning to end—he was great! He was very patient with all of my questions and requests. The hall is beautiful and spacious. The staff on the day of the party were super helpful and friendly. I would definitely recommend Balmoral for all types of events. Thank you, Keshawn. We had our company Christmas party at Balmoral Event Center. The staff was exceptional – Keyshawn and Shea were there for every question and request. The beef tips in the Burgundy mushroom sauce were delicious. The meat melted in your mouth! The atmosphere was welcoming and classy. I have personally reserved the event center for my dad’s 94th birthday. Top-notch place, food, and service. I just wanted to reach out and thank you and your staff for the wonderful service provided for our party. Many compliments were received. The last few months have been stressful with all the planning, but you were there when we needed you. Though we thanked him personally, please reach out to William again and let him know how happy we were with his culinary expertise. Our guests were very impressed. Once again, thank you. I came here for a 15th birthday party and it was amazingly beautiful. The decoration was beautiful, the place is extremely spacious, and very clean. But, oh my goodness, the food was on another level; it was extremely delicious. Super fresh; the real chef is the best for me. We still talk about how delicious the food was. I recommend it 100%. THANK YOU for everything you did for my mom’s birthday. Everything was fantastic and your team was great to work with. Please share with the Chef that all the guests love the food and some of them eat twice. Again thank you 😊 Rosa Santos Just want to drop a note, and say thank you. Our daughter’s event on Saturday went very well and we were very happy with how everything turned out. You and your staff were amazing, thank you and Juliana and Dali, all of our guests were very impressed and very happy with how everything turned out. We love the venue, it’s a great space, and so happy that we were able to host our special family celebration there! Rebeca Martínez Where do I begin? From the moment I walked in to the exit, nothing but excellence. I can’t remember her name, but the lady in charge was on point, making us feel very comfortable, attentive, and kind—a making-it-happen kind of person. She was AMAZING! The servers provided EXCELLENT service; they were on it before I could think of it, always two steps ahead. They really made our event run smoothly. This is our first venue event, and if I’m honest, I know it won’t be the last. Thank you for all your services in this journey and to all your staff who made it happen. Mia was overwhelmed by how everything was so gorgeous and beautiful. Again, thanks a million! The Martinez Family ❤️ We celebrated our wedding at Balmoral Event center a few days ago at the window room & garden. The Garden is beautiful, the food amazing. Our guest & family enjoyed the party & are still talking about it. The center is pretty & clean. Also, beautiful surroundings like the gazebo. Shout out to the staff, specially chef Noel, our bartender & Laura. Thank you so much, all efforts paid off. Bren R The food was amazing, and you were right that the GF pizza was outstanding. We’ve been GF for almost 10 years, and this is in the top 2 best GF pizzas. Balmoral needs to talk about how great the food is. Our server was equally wonderful, and the event would not have been the same without her. Thank you! J Meredith Thank you so much for letting us practice today. The dancers really enjoyed using their passes or buying tickets to use the Waterpark after their rehearsal. Your staff was wonderful today, from Chrissy’s efficiency in messaging me about filling out waivers ahead of time, to Keyshon unlocking the gate for us, to your restaurant manager cleaning and preparing our rehearsal space. The restaurant’s food and service were great and we enjoyed hearing the laughter of children playing around the Waterpark. Overall, it was a 10 out of 10 day and we hope to make you proud during our next visit on Saturday. Thank you again! Studio C School of Dance and Productions Took the wife to the Pink Floyd tribute band concert and it was great! Went early and had dinner before the concert and it was great! Reasonable prices great service even though the place was packed! The food was excellent! Great time haven’t seen that many 70 year old Hippies since we went to see Leon Russell in concert. Joe Mospaw Contact Balmoral Event Center Thank you for your interest in Balmoral Event Center. We look forward to ensuring you event is the best it can be. If you have any questions or comments, feel free to text, call or email for more information: eventcenter@feltrim.com (863) 225-2665 HOURS: Monday-Thursday: 10am – 6pm LOCATION: 116 Kenny Blvd. Haines City, FL 33844 Phone: (863) 225-2665 Private Event Software powered by Tripleseat ✕ DON'T MISS OUT ON OUR EVENTS! MISS Health Fair – Vendor opportunity Friday, September 26th, 2025 /\n                                    Doors Open at                                    12:00am GET TICKETS DON'T MISS OUT ON OUR EVENTS! MISS CLUB B – Poolside Party! Saturday, October 4th, 2025 /\n                                    Doors Open at                                    12:00am GET TICKETS ✕ Add to cart \" \" has been added to your cart! CONTINUE BOOKING GO TO CART"
    },
    {
      "url": "https://borellis.co.uk/contact/",
      "text": "Contact – Borellis Wine Bar & Grill Skip to content Borellis Wine Bar & Grill The best location in Farnham Menu expanded collapsed Menu Reservations Comedy Club Vacancies Contact Contact Let’s talk 👋 Don’t hesitate to reach out with the contact information below, or send a message using the form. Get in Touch Borellis Borelli Yard Farnham Surrey GU9 7NU UK info@borellis.co.uk +44 1252 735254 Send Us a Message Go back Your message has been sent Name (required) Warning Email (required) Warning Phone (required) Warning Message (required) Warning Warning. Submit Δ Borellis Wine Bar & Grill ,"
    },
    {
      "url": "https://visitcentralflorida.org/featured/balmoral-bar-and-grill/",
      "text": "Balmoral Bar and Grill - Visit Central Florida Skip to content Go to VISIT CENTRAL FLORIDA SPORTS Open main menu Close main menu Deals & Specials Welcome Center Meetings & Conventions Travel Guide Blog Search Search for submit Events See & Do Eat & Drink Stay Cities & Towns Meetings Deals & Specials Facebook Twitter Pinterest Instagram YouTube Balmoral Bar and Grill The Balmoral Bar and Grill is a relaxed pool and lakeside restaurant situated within Balmoral Resort, Haines City. The restaurant is open to the public and hosts regular entertainment, live music, seasonal events, and serves up the best in comfort food and drinks. Pool day passes also available. The Balmoral Bar and Grill serves a selection of shareable appetizers, fresh salads, burgers, fish & chips, delicious sandwiches and more. This is a great place to spend a lazy afternoon. You can catch the game on the screens, let the kids play at the pool and water park, and maybe stay for some evening entertainment. Great for lunch and evening dining. Visit balmoralbarandgrill.com for menus. Chef Noel at Balmoral Bar and Grill Events Balmoral Bar & Grill and its adjacent Event Center is fast becoming one of the best spots in the Haines City / Davenport area for regular entertainment and live music.  The venue hosts everything from seasonal themed events, to family foam parties, as well as Latin music evenings and County & Western shows. Be sure to check out their event calendar for more information. Pool and Water Park Day Passes Have a day at the fabulous lakeside resort pool, or let the kids play at the water park. You can grab a lounger or even reserve a cabana, both have full poolside service. Click here to get your pass! Location The restaurant is located within Balmoral Resort Florida , Haines City just off US-27, and is open to all. ADDRESS 124 Kenny Blvd Haines City,  33844 CONTACT INFO events@feltrimresorts.com 8635883097 Visit Website TripAdvisor Traveler Rating 9 reviews APR 26, 2022 05:08:22 Good food and most of the staff were very helpful. There is also some form of entertainment available most nights MAR 7, 2022 05:13:46 Would be a 5 star but they were out of a lot of menu options, both food and beer.  Service was excellent,  food we ordered was good and the atmosphere was great JAN 27, 2022 08:36:50 The food was delicious and the service was excellent \nWe love this place so much that we got our tickets for the dueling pianos \nCan’t wait to come back Read more reviews Write a review LEARN & DISCOVER 5 Great Reasons to Spend a Weekend in Winter Haven Ready to book a family-friendly weekend getaway? Here’s a list of 5 exceptionally fun things to during weekend in Winter... See Details Re-Imagine & Rebuild the World at PLANET LEGOLAND LEGOLAND® Florida Resort in Winter Haven has introduced a world with no rules just pure creativity… PLANET LEGOLAND® opening April... See Details Most Instagram-Worthy Places in Central Florida Trip planning on Instagram is definitely a thing and we love finding new places to take pictures at Central Florida,... See Details Historic Central Florida Sites That Everyone Should See Whether you’re just visiting the area or a lifelong resident of Polk County, there is so much history in and... See Details Dog Friendly Spots in Central Florida We understand that your pets are just as important as your human family members. So we created a list of... See Details Top Brunch Spots in Central Florida If breakfast is the most important meal of the day, then brunch is the most important meal of the week!... See Details Alternative Places to Stay in Central Florida If you’re looking for cheaper places to stay near Disney World or any of the great attractions of Central Florida... See Details Weekend Getaway in Central Florida Lina Greco worked in partnership with Visit Central Florida to create this Weekend Getaway Travel Recap. Weekend Getaway to Central... See Details Top 10 Adrenaline-Rush Activities in Central Florida Central Florida’s Polk County, nestled between Orlando and Tampa, is the ultimate outdoor destination in Florida, and is packed with... See Details Top 10 Reasons to Visit LEGOLAND Florida in 2023 The number one theme park for little kids is opening new attractions and hosting lots of great seasonal events throughout... See Details Subscribe to EMAIL LIST Join our email list and stay up to date with all the great things happening in Central Florida. Notice: JavaScript is required for this content. Facebook Twitter Pinterest Instagram YouTube Central Florida Visitors & Convention Bureau 101 Adventure Court Davenport, FL 33837 1-800-828-7655 © 2025  Central Florida Visitors & Convention Bureau Polk County Savings Polk CVB Where Is Polk County, FL? Contact Us Film & TV Resources Travel Guide Media Professionals Privacy & Accessibility Travel Professionals Asset 2"
    },
    {
      "url": "https://rivervillegrill.com/contact-us/",
      "text": "Contact Us - Riverville Bar & Grill Skip to content Our location (608) 424-0020 Menu Menu Our location (608) 424-0020 Get in touch We’d love to hear from you. Here’s how you can reach us! Call us! Want to make a reservation or have a question? (608) 424-0020 Have a question? Fill out my online form . Copyright 2025 © Riverville Bar & Grill Design & Development: Accent Graphix Design Studio Home Browse our Menu Mexican Specials Menu Gallery Contact Us #image_title ×"
    },
    {
      "url": "https://www.balmoral-group.com/company/people",
      "text": "Board of Directors / Leadership team | Balmoral Group COMPANIES BALMORAL COMTEC Buoyancy, insulation and protection solutions for the offshore energy sector BALMORAL TANKS Global water, wastewater and processing storage solutions BALMORAL BUSINESS PARK Aberdeen's premier south side business location BLAZE MANUFACTURING SOLUTIONS Fire safety protection, detection and loss prevention solutions THE MARCLIFFE Luxury 5-star Hotel and Spa About us COMPANY OVERVIEW SIR JAMES S MILNE CBE PEOPLE HSEQ / SUSTAINABILITY CORE VALUES HISTORY AWARDS CSR CAREERS Contact OUR PEOPLE Like any organisation our people are, without doubt, our greatest asset. We introduce you to our leadership team here but there are many, many, more people within the company that makes it what it is today. LEADERSHIP TEAM Sir James S Milne CBE Chairman Sir James Milne CBE, DL, DHC, Hon DBA, Hon FRIAS established Balmoral Group in 1980 with just five employees designing and manufacturing glass reinforced plastic products. Today, employing more than 800 people, the privately-owned company provides design and manufacturing solutions to the global subsea, energy, civil and environmental engineering sectors. Sir James is a member of Entrepreneurial Scotland, Fellow of Prosper (formerly the Scottish Council for Development and Industry) and Chairman of the Friends of ANCHOR, a fundraising body which supports cancer care and research at Grampian University Hospitals NHS Trust. It’s all about teamwork at Balmoral. We all have strengths and weaknesses and it is important to recognise this and work together to achieve what has to be achieved. Kevin Binnie EMBA CA FSI Corporate Director Joined Balmoral in 2018 Kevin is a CA and oversees the Group’s compliance function, M&A activity and participates in Board meetings of the Group’s subsidiary companies. Additionally, he is CEO of The Milne Family Foundation. Kevin previously worked for 10 years in the energy private equity industry and prior to that was a senior corporate finance advisor with KPMG. Bill Main Group Deputy MD Joined Balmoral in 1997 Previously a partner in KPMG’s Aberdeen office, Bill is a CA and has a Bachelor of Commerce degree from Edinburgh University. He is heavily involved in the general management of the business and oversees the company’s HSEQ structure. Balmoral engenders a great loyalty within its workforce. This loyalty works both ways and is a huge benefit to the organisation and our clients as a whole. Gary Gerrard FCIBS Non-executive director Joined Balmoral in 2011 Previously regional managing director for Lloyds Banking Group in Scotland. Mr Gerrard is an independent non-executive director of Balmoral Group Holdings Limited and also attends the board meetings of several Group subsidiary companies. He has been actively involved in the creation of Balmoral Business Park since its inception. Paul Mitchell Group Financial Director Joined Balmoral in 2019. Paul is a qualified CA who has held various finance and management roles in small, medium, and large companies. Paul's experience spans across operator, service and manufacturing environments. He possesses a commercial mindset and is consistently seeking opportunities for improvement while fostering a positive working environment that enables teams to reach their maximum potential. Sarah-Jane Hogg Non-executive director Joined Balmoral Group in 2011 Sarah, CEO of Friends of ANCHOR and Trustee of The Milne Family Foundation, champions cancer support in Scotland. A leading communications expert with a first-class honours degree in Corporate Communications, she ensures Balmoral’s values are at the forefront of its diversifying operations. Her experience includes working with notable clients like Asda, Bauer Media and Carphone Warehouse during her years with Euro RSCG – a subsidiary of one the world's largest global communications groups. Read more about our chairman and managing director, Sir James S Milne CBE Sir James S Milne CBE Balmoral Group Balmoral Park, Aberdeen AB12 3GY, Scotland Contact us | Locations Reg No. SC277480 Balmoral Comtec +44 (0)1224 859000 | Email us Balmoral Tanks +44 (0)1226 340370 | Email us Balmoral Business Park +44 (0)1224 859000 | Email us BLAZE Manufacturing Solutions +44 (0)1561 378899 | Email us Legal | Modern Slavery Statement Search HOME DIVISIONS Balmoral Comtec Balmoral Tanks Balmoral Business Park BLAZE manufacturing The Marcliffe Hotel & Spa COMPANY Company overview Sir James S Milne CBE People HSEQ / Sustainability Core values Awards History CSR Careers Legal CONTACT"
    },
    {
      "url": "https://www.crerarhotels.com/collection/balmoral-arms/dine/1852/",
      "text": "﻿ 1852 at Balmoral Arms | Scottish Restaurant in Ballater Skip to main content Search Input Search our website Return to the Balmoral Arms homepage Stay Stay Back Rooms and Suites Special Offers Dog Friendly FAQs Gift Vouchers Festive Breaks Dine Dine Back View all 1852 Afternoon Tea Gift Vouchers Experiences Experiences Back Experiences at Balmoral Arms Local Guide Celebrations Corporate What's On Book Show booking options - Desktop Close Stay Dine Spa Please enter your search criteria above and press enter. Searching... Your results are shown below. We could not find any search results to match your criteria. Book a room Book a table Buy a gift Home Collection Balmoral Arms Dine 1852 Search Show the search menu - Mobile Book Show the booking menu - Mobile Menu Show the main menu - Mobile Classic Scottish brasserie and grill, a true taste of Royal Deeside with local, seasonal cuisine. Explore Seasonal, authentic and comforting dishes perfectly showcase the regions produce. Sample fresh, local flavours at 1852, brought to you by our expert chefs in our Ballater restaurant. Braised game cottage pie sits alongside Scottish salmon and shortcrust venison pie. Book a table Call +44 1339 755413 to book. Our exceptional menus previous Breakfast Menu View Breakfast Menu full title Dinner Menu View Dinner Menu full title Wine List View Wine List full title Cocktail Menu View Cocktail Menu full title next Meet the chef - Tamarin Van Zyl Tamarin leads the culinary team at Balmoral Arms across both 1852 Scottish Brasserie and Grill as well as The Ghillies Bar.  Tamarin, who hails from South Africa, is passionate about using local produce, and in Ballater, there are some fantastic local choices on our doorstep. Having previously worked with brands such as Marriott, Hilton and Hyatt, the highlight of Tamarin’s career was working at the internationally acclaimed Singita Ebony and Boulders Lodge, Sabisand, a five-star Relais & Châteaux Private Game Lodge. “Stopped here for a lovely lunch whilst staying at Balmoral. The bar was a great setting and the food was freshly cooked and delicious. Our dog also enjoyed dining with us and the staff were very welcoming towards him also. ” foodandtravel93 13-15 Victoria Road Ballater, Aberdeenshire Scotland, UK AB35 5RA Instagram Facebook YouTube TikTok © Crerar Hotel Group 2025 Collection Collection Fonab Castle Balmoral Arms Glencoe Inn Daffodil Hotel & Spa Dunkeld House Hotel Golf View Hotel & Spa Isle of Mull Hotel & Spa Loch Fyne Hotel & Spa Oban Bay Hotel Thainstone House About Us About Us Our partners Our values Careers News Terms and conditions Privacy policy Dog Friendly FAQs Inspiration Inspiration Blog Caledonian Sleeper What's On Gift Vouchers Offers & Events Offers & Events Offers Best rate guarantee Festive Breaks Can we help? Get in touch Call now to book: 01339 755413 Calls to this number will incur a charge."
    }
  ]
}