{
  "fuentes": [
    {
      "url": "https://www.bananaboat.com.au/pages/about-us",
      "email": "our_story_370x230@2x.jpg"
    },
    {
      "url": "https://www.bananaboat.com.au/pages/about-us",
      "email": "moisturising-promo-tile_370x230@2x.webp"
    },
    {
      "url": "https://www.bananaboat.com.au/pages/about-us",
      "email": "protect-the-fun-nav_370x230@2x.webp"
    },
    {
      "url": "https://www.bananaboat.com.au/pages/about-us",
      "email": "smartmists-promo-tile_370x230@2x.webp"
    },
    {
      "url": "https://www.bananaboat.com/pages/contact-us",
      "email": "banana_boat_sport_370x230@2x.jpg"
    },
    {
      "url": "https://www.bananaboat.com/pages/contact-us",
      "email": "our_story_370x230@2x.jpg"
    },
    {
      "url": "https://www.bananaboat.com/pages/contact-us",
      "email": "protect_the_fun_370x230@2x.jpg"
    },
    {
      "url": "https://www.bananaboat.com/pages/contact-us",
      "email": "new_product_fly-out_370x230@2x.jpg"
    },
    {
      "url": "https://www.newyorker.com/culture/cultural-comment/harry-belafonte-and-the-social-power-of-song",
      "email": "help@newyorker.com"
    },
    {
      "url": "https://www.palmbeachpost.com/story/news/local/2017/09/26/three-popular-downtown-boynton-restaurants/7039973007/",
      "email": "aseltzer@pbpost.com"
    },
    {
      "url": "https://www.boat-lifestyle.com/pages/board-of-directors",
      "email": "careers@imaginemarketingindia.com"
    },
    {
      "url": "https://www.boat-lifestyle.com/pages/board-of-directors",
      "email": "info@imaginemarketingindia.com"
    },
    {
      "url": "https://www.bananaboat.com.au/pages/contact-us",
      "email": "our_story_370x230@2x.jpg"
    },
    {
      "url": "https://www.bananaboat.com.au/pages/contact-us",
      "email": "moisturising-promo-tile_370x230@2x.webp"
    },
    {
      "url": "https://www.bananaboat.com.au/pages/contact-us",
      "email": "protect-the-fun-nav_370x230@2x.webp"
    },
    {
      "url": "https://www.bananaboat.com.au/pages/contact-us",
      "email": "smartmists-promo-tile_370x230@2x.webp"
    },
    {
      "url": "https://bananaboat.ca/pages/contact-us",
      "email": "banana_boat_sport_370x230@2x.jpg"
    },
    {
      "url": "https://bananaboat.ca/pages/contact-us",
      "email": "our_story_370x230@2x.jpg"
    },
    {
      "url": "https://bananaboat.ca/pages/contact-us",
      "email": "protect_the_fun_370x230@2x.jpg"
    }
  ],
  "mails": [
    "aseltzer@pbpost.com",
    "banana_boat_sport_370x230@2x.jpg",
    "careers@imaginemarketingindia.com",
    "help@newyorker.com",
    "info@imaginemarketingindia.com",
    "moisturising-promo-tile_370x230@2x.webp",
    "new_product_fly-out_370x230@2x.jpg",
    "our_story_370x230@2x.jpg",
    "protect-the-fun-nav_370x230@2x.webp",
    "protect_the_fun_370x230@2x.jpg",
    "smartmists-promo-tile_370x230@2x.webp"
  ],
  "nombre_sitio": "bananaboatboynton.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.bananaboat.com.au/pages/about-us",
      "text": "About Us – Banana Boat AU Skip to content Home All Products By Category After Sun Baby Best Sellers General Protection Kids Lotion Sunscreens Pump Sunscreens Roll-On Sunscreens Sensitive Sport Spray-On Sunscreens Ultra Explore Protect the Fun Our Story Sun 101 Be Sun Smart Sun FAQ Fun in the Sun Tips Sun Safe School Program Cart You are eligible for free shipping! Your cart is empty Home Products Category Sport Ultra General Protection Sensitive Kids Baby Aftersun Face Format Lotion Spray Roll-on Pump Gel Skin Type Sensitive Dry Normal Combination/Oily THE NEW WAY TO SPRAY PROTECT THE FUN NO MATTER WHERE THE SUN TAKES YOU - EVERYDAY Explore Protect The Fun Our Story Sun 101 Be Sun Smart Sun FAQ Fun in the Sun Tips Our Story: Born on the beach Protect the Fun: say \"yes\" to more outdoor fun Banana Boat AU Search Sun Safe School Program Foundation resources Year 1 resources FOUNDATION RESOURCES YEAR 1 RESOURCES Where to Buy About Banana Boat A SUNNY START Banana Boat® was born at Florida’s sunny Miami Beach in 1976, when the original beach protector, a lifeguard at that popular destination, realized the only sunscreens available were greasy and medicinal—and not fun at all. He made it his mission to help sunscreen feel good for a change. FOCUS ON FUN We developed an effective, non-greasy formula and paired it with packaging in bright, new colors, different from the clinical options at the time. The playful tube combined with a whimsical name helped build a brand that made sun protection finally look and feel fun for millions of families. PROTECTION FOR EVERYONE Since then, we’ve helped Protect the Fun for sun-soaked summers spent outdoors, whether at the beach or the pool, picnics or playgrounds, outdoor concerts or just playing in the yard. Anywhere there’s fun under the sun, there’s Banana Boat®—and there’s Banana Boat® protection for every kind of fun. Protection You Can Trust We’ve been protecting fun under the sun for 40 years and counting. Our dedication to safety and high-quality sunscreen means guaranteed fun-in-the sun protection that you can trust every day. Whether spray, lotion or roll on, our easy-to-apply products are designed with one idea in mind: to help you and your family enjoy every moment outdoors. Always read the label and follow the directions for use. Wear protective clothing, a hat and sunglasses in addition to sunscreen. Reapply frequently every 2 hours or more often when sweating and immediately after swimming or using a towel. Avoid prolonged high-risk sun exposure. Our Site Contact MSDS Sustainability Edgewell Legal Documents Work with us NZ Site Banana Boat AU © 2025 Edgewell. All Rights Reserved. × Banana Boat AU WHERE TO BUY Buy online Buy now Buy now Buy now Buy now Buy now Buy now"
    },
    {
      "url": "https://www.bananaboat.com/pages/contact-us",
      "text": "Contact Us – Banana Boat US Skip to content Home All Products By Category Sport Mineral Kids Baby General Protection Tanning Sunless After Sun Face By SPF Non-SPF 25 & Below 30 40 & 45 50 60 & 65 100 By Formula Lotion Spray Oil Stick & Roll On Lip Balm Gel Explore Protect the fun Our Story Sun 101 Sun Smart Our Sun-Safe Partners Sun FAQ What SPF is right for me? Fun in the sun tips Cart You are eligible for free shipping! Your cart is empty Products Category Sport Mineral Kids Baby General Protection Tanning Sunless After Sun Face SPF Non-SPF 25 & Below 30 40 & 45 50 60 & 65 100 Formula Lotion Spray Oil Stick & Roll On Lip Balm Gel Sport: Stays on so you can play on Introducing NEW ways to Protect the Fun Explore PROTECT THE FUN OUR STORY SUN 101 Sun Smart Our Sun-Safe Partners Sun FAQ SPF Guide Fun in the Sun Tips Our Story: Born on the beach Protect the Fun: say \"yes\" to more outdoor fun Banana Boat US Search Where to Buy Contact Us Let’s stay in touch. We're available Monday to Friday from 8 am to 6 pm ET. Call Us: 1-800-723-3786 (1-800-SAFESUN) Write to us: Edgewell Consumer Affairs 5901 West Side Avenue Suite 400 North Bergen, NJ 07047 Or send us an email through the form. Protection You Can Trust We’ve been protecting fun under the sun for 40 years and counting. Our dedication to safety and high-quality sunscreen means guaranteed fun-in-the sun protection that you can trust every day. Whether spray, lotion or stick, our easy-to-apply products are designed with one idea in mind: to help you and your family enjoy every moment outdoors. Our Site Contact Us Sun 101 Sun Smart Tips Country Selector Legal Documents MSDS Sustainability Edgewell U.S. Satisfaction Guarantee Work with us Do Not Sell Or Share Cookie Settings Banana Boat US © 2025 Edgewell. All Rights Reserved. ×"
    },
    {
      "url": "https://www.newyorker.com/culture/cultural-comment/harry-belafonte-and-the-social-power-of-song",
      "text": "Harry Belafonte and the Social Power of Song | The New Yorker Skip to main content Newsletter Search Search The Latest News Books & Culture Fiction & Poetry Humor & Cartoons Magazine Puzzles & Games Video Podcasts Goings On Shop 100th Anniversary Open Navigation Menu Menu Cultural Comment Harry Belafonte and the Social Power of Song By Amanda Petrusich February 22, 2017 Save this story Save this story Save this story Save this story A new anthology of the work of Harry Belafonte, pictured here in the nineteen-forties or fifties, reiterates his standing in American music. PHOTOGRAPH BY BETTMANN / GETTY Sixty-one years ago, in 1956, Harry Belafonte recorded a version of the Jamaican folk song “ Day-O ,” for his third studio album, “Calypso.” It opens with a distant and eager rumbling—as if something dark and hulking were approaching from a remote horizon. Belafonte—who was born in Harlem in 1927, but lived with his grandmother in a wooden house on stilts in Aboukir, a mountain village in Jamaica, for a good chunk of his childhood—bellows the title in a clipped island pitch. The instrumentation is spare and creeping. His voice bounces and echoes as it moves closer. It sounds like a call to prayer. The song was written sometime around the turn of the twentieth century, though to suggest that “Day-O” was formally composed in any sort of premeditated way might be overstating things. It’s a call-and-response work song, likely concocted spontaneously by overnight dockworkers cramming bunches of bananas onto ships, hot-footing it away from loose spiders, and fantasizing about rum. By 1890, the sugar trade in Jamaica had been toppled by an assortment of wars, acts of God, and political upheavals, and bananas had become the country’s primary export. “Come Mr. Tally Man, tally me banana,” Belafonte implores. “Daylight come and me wan’ go home,” his chorus chants. It is an infinitely applicable refrain, no matter what your metaphorical banana might be, or which cocktail seizes your imagination come quitting time. “Me wan’ go home” is perhaps as universal a plea for freedom as we’ve got. “Day-O” is so suffused with joy and pathos—that age-old human mishmash—that almost anybody with an actively beating heart sounds awesome singing it. Incredibly, in 1957, five more artists made it onto the U.S. Top Forty with their versions; these range from rich and enveloping (the jazz singer Sarah Vaughn ) to unsettlingly polite (the folk-pop band The Tarriers ). One of the writing credits for Belafonte’s iteration goes to Irving Burgie, or Lord Burgess, a Brooklyn-born songwriter of Barbadian descent. Belafonte’s friend and collaborator, the novelist Bill Attaway, introduced Belafonte to Burgess, whom Attaway had called “the black Alan Lomax—a walking library of songs from the islands.” The trio camped out in a suite at the Waldorf-Astoria Hotel, where Belafonte was performing a string of shows, and fiddled around with “Day-O,” which was known at the time as “The Banana Boat Song,” or “Hill and Gully Rider.” “None of us had any idea, when we recorded it, that it would be spun off as a single,” Belafonte admits, in his 2011 autobiography, “ My Song .” “Day-O” went to No. 5 on the charts, and “Calypso” became the first full-length record of any sort to sell a million copies. Belafonte had bickered with RCA over the cover. The first mockup he saw featured his body with “a big bunch of bananas superimposed on my head. I looked like Carmen Miranda in drag, only in bare feet, with a big toothy grin, as if I were saying, ‘Come to dee islands!’ ” On March 1st, Belafonte will turn ninety. This week, Sony Legacy is releasing “The Legacy of Harry Belafonte: When the Colors Come Together,” a new anthology of his work. It’s a beautiful, manifold collection, and reiterates Belafonte’s standing as one of America’s most vital and insurrectionary folk singers. There is video of Belafonte performing his song “Matilda” in 1966, at a benefit for Martin Luther King, Jr. He is lithe and balletic, slinking easily about the stage, like a stalk of tall grass bending in the breeze. When it comes time for the chorus to sing, he flaps his hands at them in a gesture I have now observed hundreds of times but still cannot figure out how to describe: it is as if his hand is attached to strings being tugged on from above. Belafonte came of age as a vocalist in an era in which tone and modulation were paramount, watched as those foundations were successfully subverted, and then grew expert at drawing from both customs. This gives his work a tense and singular dynamism. Prior to “Calypso,” Belafonte worked as a stage actor and a jazz singer, but in the early nineteen-fifties he became gripped by vernacular music, and particularly by the idea that a folk song could be an engine of actual social change. In “My Song,” he tells a story about seeing the folk singers Woody Guthrie and Lead Belly perform at the Village Vanguard, and being so remade by the experience that he arranged for a pilgrimage to the Library of Congress, in Washington, to listen to the thousands of field recordings that Alan Lomax had collected and archived there. “I just couldn’t stand the thought of going back to those mushy pop standards,” Belafonte writes. Though he had grown up in deep poverty, he fretted over his bona fides and his racially mixed origins. (His maternal grandmother was “the white daughter of a Scottish father who’d come to Jamaica to oversee a plantation for an absentee owner,” while his paternal grandfather was “a white Dutch Jew who’d drifted over to the islands after chasing gold and diamonds, with no luck at all.”) “I wasn’t even a full-fledged Jamaican, or a black from Harlem with full Afro-American roots,” he worried. “All of this mattered, deeply, in the burgeoning folk music of the early 1950s, because authenticity was what the songs were about, and an inauthentic singer, which was what I appeared to be, had no right to sing them.” Belafonte was strikingly prescient about the ways in which taste could and would be politicized, and especially about how treacherous it is to confuse consumption with action. This seems, to me, to be an unspoken but profound hindrance to all popular rebellions: if a person reads the right authors, and buys the right records, and vouches for those preferences loudly and repeatedly, it can feel like all the necessary work has been done to align oneself with the proper causes. “If you liked Harry Belafonte, you were making a political statement, and that felt good, the way it felt good to listen to Paul Robeson, and listen to what he had to say. If you were a white Belafonte fan, you felt even better. You were connecting with your better angels, reaching across the racial divide,” Belafonte writes. Or: what should be a beginning is often mistaken for an end. Eventually, Belafonte would become integral to the civil-rights movement of the nineteen-sixties, both as an adviser and confidante of King’s and a financial patron, helping to fund voter-registration drives, Freedom Rides, the March on Washington for Jobs and Freedom, and more. Over the next fifty years, his activism would extend beyond domestic concerns: he has advocated for famine relief in Africa (he was an organizer of the recording sessions for “We Are the World,” in 1985), H.I.V./ AIDS prevention and treatment, the abolition of nuclear weapons, education, the end of apartheid, and more. Most recently, he served as a co-chair of the Women’s March on Washington, held the day after Donald Trump’s Inauguration. “Calypso,” which topped the Billboard chart for thirty-one weeks, in 1956, is a curious and seductive record. The genre it was named after originated in Trinidad and Tobago, at some point in the early part of the twentieth century (use of the word to refer to a style of music was first recorded in 1930), though its beginnings are varied, ancient, and complex, and point toward West Africa, the French Antilles, and the seventeenth-century Caribbean slave trade. Musically, calypso is playful and colloquial, and rooted in a three-beat rhythm (two long beats, followed by a short beat); it directly inspirited Jamaican mento, which eventually produced ska. In the annals of pop-music history, 1956 is generally thought of as the birth year of rock and roll (as a popular format, at least), but “Calypso” outsold both self-titled LPs that the twenty-one-year-old Elvis Presley released that year. It seems strange to recall this now, but, for a time, rock and roll and calypso were in an odd footrace for cultural ubiquity. In 1957, John S. Wilson, a critic for the Times , even suggested that calypso was acquiring the edge: “Reports from the epidemic areas of popular music suggest that Elvis Presley and rock ‘n’ roll are giving way before the onslaughts of Harry Belafonte and Calypso,” Wilson writes. “The contrast could not be more extreme.” Calypso, of course, was an old and adapted tradition, whereas rock and roll was a new amalgamation, wilder and more explicitly homegrown. There are also, as Wilson points out, categorical differences between the two genres, both musically and in terms of presentation: “Mr. Belafonte’s consciously precise and rounded diction is the direct opposite of Mr. Presley’s mumbled and swallowed syllables,” Wilson writes. Belafonte’s next record, “An Evening with Belafonte,” was a collection of beloved folk songs culled from a parade of global traditions—“Hava Nageela,” “Danny Boy,” “When The Saints Go Marching In.” While he never shunned or disparaged calypso (and would eventually return to it, in 1961, with the album “Jump Up Calypso” and the effervescent and clamorous single “Jump in the Line”), Belafonte seemed plainly eager to peacock stylistically, flaunting his uncommon range. In 1958, he released “Belafonte Sings the Blues,” which is my favorite of his records, though it is, by most accounts, a middling entry in his discography. It’s not technically a collection of blues—in his liner notes, the critic Nat Hentoff admits as much, then suggests that “the feeling and the wryly unconquerable spirit of the blues pervade all the numbers,” which, while purists may disagree, seems more fundamental to the spirit of the enterprise than any chord progression—but there is a looseness and an uncooked quality to Belafonte’s voice here that feels both unprecedented and unrepeated. Belafonte’s performance of “ Losing Hand ”—a song written by Charles Calhoun for Ray Charles, who had a hit with it, in 1953—is, for me, a calamitous combination of the sly and the wounded. “I gambled on your love, baby, and got a losing hand,” Belafonte sings. He sounds like someone who has come to realize that he is completely screwed—toppled by bad love, and floundering. His predicament has nearly become amusing to him; he has been bested, but still regards his attacker with woeful, wanting eyes. “I know you don’t care, but I love you just the same,” he shrugs. In “My Song,” Belafonte has lessons for subsequent generations—advice for all the young dissidents taking up the movement—and it feels particularly timely to revisit them now. He writes, frequently, of M.L.K., who believed that anger was a necessary ingredient for change. “And I subscribe to that completely,” Belafonte writes. “I was angry when I met him. Anger had helped protect me. Martin understood my anger and saw its value. But our cause showed me how to redirect it and to make it productive.” These days, when people talk about the lack of a musical center in contemporary protest movements, it’s usually framed as a subtle critique of modern artists, who tend to sing boldly of self-empowerment and self-growth, but rarely of collective betterment. Even folk music, the genre most typically equated with facilitating social revolution, seems to have turned inward, gotten more contemplative, more confessional. Some of our musical aimlessness is attributable to the ways that audiences have changed, too—the privatization of the listening experience and the fracturing of the monoculture has spawned a million tiny, private islands of taste. Belafonte suggests that he found his power “in songs of protest, and sorrow, and hope”—that they enabled his activism. The music he loved (the field hollers and chain-gang songs of the prewar South; the work laments of Jamaica) stressed the mutual or shared experience. Anger can be crippling when it festers in isolation. Belafonte figured out how to push anger outward by bringing others close. Amanda Petrusich is a staff writer at The New Yorker and the author of “ Do Not Sell at Any Price: The Wild, Obsessive Hunt for the World’s Rarest 78rpm Records .” More: Harry Belafonte Music Protest Read More Culture Desk The Folk Power of Jamaican Dancehall Signs The New Yorker Radio Hour Episode 50: A Visit with Harry Belafonte, and an Isolated Tribe Emerges Listening Booth When the Man Tried to Sell Minimalism to the Counterculture Columbia Records saw Terry Riley’s “In C,” now rereleased for his ninetieth birthday, as a perfect anthem for the psychedelic Zeitgeist, but the mainstream couldn’t contain the composer’s utopian energies for long. A Critic at Large How Music Criticism Lost Its Edge Music writers were once known for being much crankier than the average listener. What happened? Pop Music Sabrina Carpenter’s Comedy of Errors “Man’s Best Friend,” the singer’s newest album, is an obvious companion to her 2024 breakthrough, filled with chatty asides and quick, carnal jokes. Critic’s Notebook The Lush Pain Music of Nourished by Time The artist’s latest album, “The Passionate Ones,” catches your weariness, and, with a dreamer’s irrationality, asks if you would consider transforming it, even for a while. Pop Music The Redemption of Chance the Rapper His new album, “Star Line,” has the difficult task of reacquainting the world with the artist after several tumultuous years. Humor Scenes from the “This Is Spinal Tap” Cutting-Room Floor On any given day, brilliant stuff would spontaneously fly out of someone’s mouth. A lot of that stuff had to go, to keep the film’s motor running. Profiles Is Mac DeMarco the Last Indie Rock Star? The musician’s overwhelming popularity can overshadow his ethos of self-reliance. On his new album, “Guitar,” he played every instrument and is releasing it on his own label. Takes Adam Gopnik on Joseph Mitchell’s “Joe Gould’s Secret” Mitchell captured New York’s oddballs and renegades with an understated lyricism that transformed fact into literature. Fault Lines The Joys of Moomscrolling As Tove Jansson’s lovable creatures turn eighty, new generations are discovering a world where “trolling” means weathering life’s many anxieties. A Critic at Large The Lives and Loves of James Baldwin An older generation dismissed him as passé; a newer one has recast him as a secular saint. But Baldwin’s true message remains more unsettling than either camp recognizes. News Books & Culture Fiction & Poetry Humor & Cartoons Magazine Crossword Video Podcasts 100th Anniversary Goings On Manage Account Shop The New Yorker Buy Covers and Cartoons Condé Nast Store Digital Access Newsletters Jigsaw Puzzle RSS About Careers Contact F.A.Q. Media Kit Press Accessibility Help User Agreement Privacy Policy Your California Privacy Rights © 2025 Condé Nast. All rights reserved. The New Yorker may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices Instagram Tiktok Threads X Facebook LinkedIn YouTube"
    },
    {
      "url": "https://www.palmbeachpost.com/story/news/local/2017/09/26/three-popular-downtown-boynton-restaurants/7039973007/",
      "text": "Three popular ‘downtown’ Boynton restaurants getting big makeovers News Sports Restaurants Real Estate Opinion Advertise Obituaries eNewspaper Legals LOCAL Three popular ‘downtown’ Boynton restaurants getting big makeovers Alexandra Seltzer aseltzer@pbpost.com The Therien family brought the Banana Boat to Boynton Beach nearly 40 years ago and next month will celebrate a grand reopening after a weeks-long closure to update the waterfront restaurant. There won’t be changes in the menu, prices or ownership, but there will be of a “Florida Caribbean” feel with more dock space and an emphasis on outdoor dining, said Luke Therien, one of the brothers who own the restaurant. READ: A little coffee shop back in 1996, now it’s a Boynton restaurant staple “We’re trying to connect with the Florida Caribbean atmosphere: fresh seafood on the waterfront, fishing, boating, surfing,” he said. “The decoration and the atmosphere didn’t completely reflect that.” Banana Boat off Ocean Avenue in the Boynton Harbor Marina is one of a handful of restaurants in the underdeveloped downtown are that by itself has become a destination spot, but needed a renovation. The others: Across Federal Highway also on Ocean Avenue, Hurricane Alley , recently underwent a renovation that included a new bar that is double the size of the old one, owner Kim Kelly said. And an update is in store for Prime Catch , at Federal Highway Woolbright Road also owned by the Therien family. Banana Boat, which opened in November 1978, closed Sept. 5 and is expected to reopen Oct. 5. The improvements include new bathrooms, a dock with space for eight boats instead of three, a new patio bar, hurricane-proof windows that can open on those cool winter nights and a new color scheme of white and a Caribbean blue instead of the old beige. Hurricane Alley closed in June for renovations. The restaurant, which opened more than two decades ago , had three sections but now the middle wall has been torn down to make an open room. The bar used to be about 12 feet and is now 25, which means more seating. “It’s just more of an open and airy feeling,” Kelly said. Kelly said the renovation was prompted by staff needing more space, and to keep up with the growing area. Across the street a residential and retail complex called 500 Ocean is under construction. The restaurant will also be getting a new awning, but that’s thanks — or no thanks — to Hurricane Irma. The Therien family opened Prime Catch in Riverwalk Plaza in June 2004. It’s also on the Intracoastal. A renovation will start when construction begins on the Winn-Dixie in the plaza, which will become a 10-story residential building with 326 apartments. “After 14, 15 years there’s a lot of wear and tear,” Therien said. “Prime Catch has been upscale and we will continue on that theme.” Careers Staff Directory Accessibility Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Business Advertise Your Business Promote your Event Buy and Sell Licensing & Reprints Help Center Palm Beach Post Store Subscriber Guide Manage Account Give Feedback Newspapers In Education Newsletters Facebook X eNewspaper Archives Jobs Real Estate Classifieds Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.palmbeachpost.com. All rights reserved."
    },
    {
      "url": "https://www.boat-lifestyle.com/pages/board-of-directors",
      "text": "Board of Directors Open Modal × Skip to content Get additional 5% off on Prepaid Orders | Code: BOATHEAD | Shop Now! Get additional 5% off on Prepaid Orders | Code: PAYDAY | Shop Now Categories boAt Personalisation Corporate Orders Gifting Store More Navigation boAt Lifestyle Newsletter Search Most Searched And Bought True Wireless Earphones Personalized Products Smart Watches Nirvana Wireless Neckbands Bluetooth Speakers Wireless Headphones Powerbanks Wired Earphones Soundbars × Hi boAthead! Login 0 Search Most Searched And Bought True Wireless Earphones Personalized Products Smart Watches Nirvana Wireless Neckbands Bluetooth Speakers Wireless Headphones Powerbanks Wired Earphones Soundbars Categories True Wireless Earbuds Personalised Products Neckbands Smart Watches Wireless Headphones Wireless Speakers Wired Headphones Wired Earphones Soundbars Gaming Series Party Speakers Chargers Power Banks Cables Superhero Collection Trebel for Women Limited Edition boAt Tag Mobile Accessories Expand More Back View All boAt Personalisation Corporate Orders Gifting Store More Daily Deals Blogs Refer & Earn Careers Social Responsibility Store Locator boAt Community Back View All Track Your Order Your Cart Your cart is feeling lonely Start shopping Board of Directors Sameer Mehta Whole Time Director & Chief Executive Officer Learn More × Sameer Mehta Whole Time Director & Chief Executive Officer Sameer Mehta is the Whole-time Director and Chief Executive Officer of our Company. He is also the Chief Product Officer of our Company and heads the product research and development of our Company. He is one of the founders and Promoters of our Company. He holds a bachelor’s degree in commerce from University of Mumbai. He has experience in technology, product research and development. He also co-founded Redwood Interactive which owned ‘RedGear’, a gaming brand in India. Aman Gupta Whole Time Director & Chief Marketing Officer Learn More × Aman Gupta Whole Time Director & Chief Marketing Officer Aman is the co-founder and chief marketing officer of an earwear audio company called boAt. This company has a string of products that include but aren't limited to headphones and travel chargers. 2016 saw Aman founding this company along with Sameer Mehta who is his business partner. Vivek Gambhir Non-Executive Director, Chairman Learn More × Vivek Gambhir Non-Executive Director, Chairman Vivek Gambhir is the Non-Executive Director of our Company. He holds a bachelor’s degree in science (computer science), a bachelor’s degree in arts (economics and business) from Lafayette College, Easton, Pennsylvania and a master’s degree in business administration from Harvard Business School, Boston, Massachusetts. He was the chief executive officer and managing director of Godrej Consumer Products Limited and the chief strategy officer of Godrej Industries Limited. He was associated with Bain & Company India Private Limited as a partner and was a founding member of Bain & Company’s consulting operations in India. He has previously been the co-chair of the Confederation of Indian Industry, National FMCG Committee and served as the president of the Harvard Business School Club of India. He is currently on the advisory board of the Central Square Foundation and authors a leadership blog, www.monday-8am.com. Anish Saraf Non-Executive Director Learn More × Anish Saraf Non-Executive Director Anish Saraf is a Non-Executive Director of our Company. He holds a post-graduate diploma in management from the Indian Institute of Management, Ahmedabad and is a qualified chartered accountant with the Institute of 185Chartered Accountants of India. He is associated with Warburg Pincus India Private Limited since 2006 where he currently holds the position of managing director. Purvi Sheth Non-Executive Independent Director Learn More × Purvi Sheth Non-Executive Independent Director Purvi Sheth is an Independent Director of our Company. She has passed the bachelor of arts degree examination (economics and political science) from St. Xavier’s College, Mumbai, University of Mumbai and has completed the certificate of professional development program from the Wharton Business School, University of Pennsylvania. She has been associated with the firm, Shilputsi Consultants, for more than 25 years where she currently holds the position of the chief executive officer. Aashish Kamat Non-Executive Independent Director Learn More × Aashish Kamat Non-Executive Independent Director Aashish Kamat is an Independent Director of our Company. He holds a bachelor’s degree in arts from the Franklin and Marshall College and is a member of the Pennsylvania Institute of Certified Public Accountants. He was previously the managing director in corporate & investment bank department of JP Morgan Chase Bank, N.A, the chief financial officer and managing director of Bank of America (GCIB), chief executive officer of UBS AG, Mumbai Branch, India, managing director of UBS AG, Hong Kong Branch and managing director, chief operating officer of L Catterton Asia. Anand Ramamoorthy Non-Executive Independent Director Learn More × Anand Ramamoorthy Non-Executive Independent Director Anand Ramamoorthy is an Independent Director of our Company. He holds a bachelor’s degree in engineering (metallurgical engineering) from University of Roorkee, a master’s degree in mechanical engineering from Auburn University and a master’s degree in business administration from Santa Clara University. He currently serves as the vice-president, India country executive of Micron Technology Operations India LLP. He was previously associated with Marvell Semiconductors, Inc. as senior director of India business development, and McAfee Software India Private Limited as senior director, sales. Deven Waghani Non-Executive Independent Director Learn More × Deven Waghani Non-Executive Independent Director Deven Waghani is an Independent Director of our Company. He holds a bachelor’s degree of technology in chemical engineering from Indian Institute of Technology, Bombay, and a master’ degree in business administration from the University of Chicago. He also holds a post-graduate diploma in management from Indian Institute of Management, Calcutta. He was associated with McKinsey & Company as a senior engagement manager, Microsoft as senior director – SBU strategy and business development, and Hewlett – Packard as vice president – strategy and planning. He also serves as the senior vice president – business operations, for Automation Anywhere Inc. Back to top India's fastest growing audio & wearables brand. The most incredible range of wireless earphones , earbuds , headphones , smart watches , and home audio . From workouts to adventures, boAt\n    will get you sailing! Subscribe to our email alerts! Shop True Wireless Earbuds Wireless Headphones Wired Headphones Wireless Speakers Home Audio Mobile Accessories Smart Watches TRebel Misfit Trimmers Refer & Earn Help Track Your Order Warranty & Support Return Policy Service Centers Bulk Orders Why Buy Direct Company About boAt News Read Our Blog Careers Security Investor Relations Social Responsibility Shop True Wireless Earbuds Wireless Headphones Wired Headphones Wireless Speakers Home Audio Mobile Accessories Smart Watches TRebel Misfit Trimmers Refer & Earn Help Track Your Order Warranty & Support Return Policy Service Centers Bulk Orders Why Buy Direct Company About boAt News Read Our Blog Careers Security Investor Relations Social Responsibility True Wireless Earbuds Shop by Features Noise Cancellation Earbuds Best Immortal and Airdopes Large Playback Earbuds Shop by Price Earbuds Under 1000 Earbuds Under 2000 Earbuds Under 3000 Earbuds Under 4000 Earbuds Under 5000 Smart Watches Shop by Features Bluetooth Calling Smartwatches Fitness Tracker Smartwatch Big Display Smartwatch Shop by Identity Smartwatches For Women Smartwatches For Men Shop by Price Smartwatch Under 2000 Smartwatch Under 3000 Smartwatch Under 4000 Smartwatch Under 5000 Smartwatch Under 10000 Wireless Speakers Shop by Features Portable Speakers Long Playback Speakers Party Speaker with RGB Lights Speaker with Karaoke Mic Shop by Price Bluetooth Speakers Under 1000 Bluetooth Speakers Under 2000 Bluetooth Speakers Under 3000 Bluetooth Speakers Under 5000 Bluetooth Speakers Under 8000 Soundbars Shop by Features Soundbar with Wireless Subwoofer Dolby Soundbars Soundbar with Wired Subwoofer Alexa Enabled Soundbar Shop by Price Soundbars Under 5000 Soundbars Under 10000 Soundbars Under 20000 Wireless Earphones Shop by Features Clear Calling Earphone Shop by Price Neckbands Under 1000 Neckbands Under 2000 Neckbands Under 3000 Wireless Headphones Shop by Features Noise Cancelling Headphones Wireless Gaming Headphone Long Playback Headphones Shop by Price Wireless Headphones Under 1000 Wireless Headphones Under 3000 Wireless Headphones Under 2000 Wireless Headphones Under 4000 Wireless Headphones Above 4000 Limited Editions Shop by Features Limited Editions Headphones Limited Editions Earphone Limited Edition Speakers Powerbanks Shop by Features Power Bank 10000mah Power Bank 20000mah Mobile Power Bank Fast Charging Power Bank Power Bank for iPhone Shop by Price Power Bank Under 1000 Power Bank Under 1500 Power Bank Under 2000 Chargers Shop by Features Wireless Charger Type C Charger Fast Charger USB Charger Micro USB Charger Type C Adapter Cables Shop by Features Micro USB Cable C Type Cable Lightning Cable USB C to C Cable Smart Watch Charging Cable Wired Headphones Shop by Features Wired Headphones with Mic Headphones with Mic for PC Shop by Price Wired Headphones Under 1000 Wired Headphones Under 2000 Wired Headphones Under 3000 Let's get social Let's get social Privacy Policy Terms of Use Warranty Policy © 2025 Imagine Marketing Limited. All Rights Reserved. For queries contact us: Manager, Imagine Marketing Limited Unit no. 204 & 205, 2nd floor, D-wing & E-wing, Corporate Avenue, Andheri Ghatkopar Link Road, Mumbai, Maharashtra-400093, India Home Categories Rewards Personalisation Chat"
    },
    {
      "url": "https://www.bananaboat.com.au/pages/contact-us",
      "text": "Contact Us – Banana Boat AU Skip to content Home All Products By Category After Sun Baby Best Sellers General Protection Kids Lotion Sunscreens Pump Sunscreens Roll-On Sunscreens Sensitive Sport Spray-On Sunscreens Ultra Explore Protect the Fun Our Story Sun 101 Be Sun Smart Sun FAQ Fun in the Sun Tips Sun Safe School Program Cart You are eligible for free shipping! Your cart is empty Home Products Category Sport Ultra General Protection Sensitive Kids Baby Aftersun Face Format Lotion Spray Roll-on Pump Gel Skin Type Sensitive Dry Normal Combination/Oily THE NEW WAY TO SPRAY PROTECT THE FUN NO MATTER WHERE THE SUN TAKES YOU - EVERYDAY Explore Protect The Fun Our Story Sun 101 Be Sun Smart Sun FAQ Fun in the Sun Tips Our Story: Born on the beach Protect the Fun: say \"yes\" to more outdoor fun Banana Boat AU Search Sun Safe School Program Foundation resources Year 1 resources FOUNDATION RESOURCES YEAR 1 RESOURCES Where to Buy Contact Us Let’s stay in touch. We're available Monday to Friday from 9 am to 5 pm. Call Us: 1800 761 186 Or send us an email through the form. Protection You Can Trust We’ve been protecting fun under the sun for 40 years and counting. Our dedication to safety and high-quality sunscreen means guaranteed fun-in-the sun protection that you can trust every day. Whether spray, lotion or roll on, our easy-to-apply products are designed with one idea in mind: to help you and your family enjoy every moment outdoors. Always read the label and follow the directions for use. Wear protective clothing, a hat and sunglasses in addition to sunscreen. Reapply frequently every 2 hours or more often when sweating and immediately after swimming or using a towel. Avoid prolonged high-risk sun exposure. Our Site Contact MSDS Sustainability Edgewell Legal Documents Work with us NZ Site Banana Boat AU © 2025 Edgewell. All Rights Reserved. × Banana Boat AU WHERE TO BUY Buy online Buy now Buy now Buy now Buy now Buy now Buy now"
    },
    {
      "url": "https://bananaboat.ca/pages/contact-us",
      "text": "Contact Us – Banana Boat CA Skip to content Home All Products By Category Sport Mineral Kids Baby General Protection Tanning After Sun By SPF 15 30 50+ By Formula Lotion Spray Oil Gel Roll-On Mist Explore Protect The Fun Our Story Sun 101 Sun Smart Our Sun-Safe Partners Sun FAQ What SPF is right for me? Fun in the Sun Tip eCDFT Language English Français Cart You are eligible for free shipping! Your cart is empty For more information on Banana Boat® product safety, please visit our FAQ page. Products Categories Sport Mineral Kids Baby General Protection Tanning After Sun SPF 15 30 50+ Formula Lotion Spray Oil Gel Roll-On Mist Sport: Stays on so you can play on Explore Protect The Fun Our Story Sun 101 Sun Smart Our Sun-Safe Partners Sun FAQ What SPF is right for me? Fun in the Sun Tips eCDFT Our Story: Born on the beach Protect the Fun: say \"yes\" to more outdoor fun Banana Boat CA Language Language Language English Français Language Language Language English Français Search Contact Us Let’s stay in touch. We’re available Monday to Friday from 8 am to 6 pm ET. Call Us: 1-888-786-8477 Write to us: Edgewell Consumer Affairs 5901 West Side Avenue Suite 400 North Bergen, NJ 07047 Or send us an email through the form. Protection You Can Trust We’ve been protecting fun under the sun for 40 years and counting. Our dedication to safety and high-quality sunscreen means guaranteed fun-in-the sun protection that you can trust every day. Our easy-to-apply products are designed with one idea in mind: to help you and your family enjoy every moment outdoors. Our site Contact Us Sun 101 Sun Smart Tips Our Story eCDFT Legal Documents MSDS Sustainability Edgewell Work With Us Cookie Settings Banana Boat CA © 2025 Edgewell. All Rights Reserved."
    }
  ]
}