{
  "fuentes": [
    {
      "url": "https://guidetoflorida.com/tallahassee/food-drink/bar-1903",
      "email": "directory@guidetoflorida.com"
    },
    {
      "url": "https://guidetoflorida.com/tallahassee/food-drink/bar-1903",
      "email": "name@yoursite.com"
    },
    {
      "url": "https://www.tallahassee.com/story/news/money/2020/02/14/bar-1903-inside-tallahassees-first-library-turned-bar/4690497002/",
      "email": "tlwaters@tallahassee.com"
    },
    {
      "url": "https://cba.org/about-us/who-we-are/",
      "email": "memberservice@cba.org"
    },
    {
      "url": "https://finewineliquors.com/contact-us/",
      "email": "sales@finewineliquors.com"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "https://www.tallahasseetable.com/from-library-to-libations-bar-1903-a-downtown-hit/",
      "email": "tallahassee-table-icon@2x.png"
    },
    {
      "url": "https://www.tallahasseetable.com/from-library-to-libations-bar-1903-a-downtown-hit/",
      "email": "tallahasseetable-logo@2x.png"
    }
  ],
  "mails": [
    "directory@guidetoflorida.com",
    "info@reception-plus.de",
    "memberservice@cba.org",
    "name@yoursite.com",
    "sales@finewineliquors.com",
    "tallahassee-table-icon@2x.png",
    "tallahasseetable-logo@2x.png",
    "tlwaters@tallahassee.com"
  ],
  "nombre_sitio": "bar1903tlh.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://guidetoflorida.com/tallahassee/food-drink/bar-1903",
      "text": "Bar 1903 - Guide to Florida www.guidetoflorida.com - Guide to Florida Search Home Best of Florida Best of Florida Results 2025 Best of Florida Results 2024 Best of Florida Results 2023 Best of Florida Results Best of Florida Print Annual 2024 Best of Florida Print Annual 2023 Best of Florida Print Annual Nominate a Business Vote for Your Faves How It Works Campaign Kit Stories Directory Browse Categories Browse Regions Big Bend Coastal Region Bradenton & Sarasota Region Central Panhandle Region Destin & Fort Walton Beach Region Florida Keys Region Greater Fort Lauderdale Region Greater Gainesville Region Greater Miami & Miami Beach Region Greater Orlando Region Heartland Region Jacksonville Metro & Beaches Region Lakeland & Polk County Region Nature Coast Region North Central Countryside Region Ocala, Lake & Sumter Region Palm Beach County Region Panama City & Panama City Beach Region Pensacola & Western Panhandle Region Port St. Lucie & Treasure Coast Region Southwest Florida Coast Region Space Coast Region St. Augustine Historic Coast Region St. Petersburg & Clearwater Peninsula Region Suwannee River Region Tallahassee Region List Your Business About Us Advertise Contact Us Member Login Menu Home Best of Florida Best of Florida Results 2025 Best of Florida Results 2024 Best of Florida Results 2023 Best of Florida Results Best of Florida Print Annual 2024 Best of Florida Print Annual 2023 Best of Florida Print Annual Nominate a Business Vote for Your Faves How It Works Campaign Kit Stories Directory Browse Categories Browse Regions Big Bend Coastal Region Bradenton & Sarasota Region Central Panhandle Region Destin & Fort Walton Beach Region Florida Keys Region Greater Fort Lauderdale Region Greater Gainesville Region Greater Miami & Miami Beach Region Greater Orlando Region Heartland Region Jacksonville Metro & Beaches Region Lakeland & Polk County Region Nature Coast Region North Central Countryside Region Ocala, Lake & Sumter Region Palm Beach County Region Panama City & Panama City Beach Region Pensacola & Western Panhandle Region Port St. Lucie & Treasure Coast Region Southwest Florida Coast Region Space Coast Region St. Augustine Historic Coast Region St. Petersburg & Clearwater Peninsula Region Suwannee River Region Tallahassee Region List Your Business About Us Advertise Contact Us Member Login Home United States Tallahassee Food & Drink Bar 1903 Bar 1903 Share Bars 209 E Park Ave, Tallahassee, Florida, 32301 Send Message 850-354-9739 Vote for Us! | Bars Best of Florida Vote Confirmation × Don't show this confirmation for the next 24 hours First Name Last Name Email Address Save my information and enable one-click voting for future votes on this device. I want to receive the Guide to Florida newsletter. Please complete the reCAPTCHA challenge below. Cancel Submit Your Vote! You are voting with the email Click here to switch users. Close Overview Get Directions View On Larger Map Company Name Bar 1903 Visit Website http://bar1903tlh.com Online Social Profiles Phone Number 850-354-9739 Location 209 E Park Ave Tallahassee , Florida , 32301 United States × Map View Get Directions Cancel FEATURED LISTINGS! Two Guys To Go Bradenton, FL 34207 Website 941-806-85-72 LIME Fresh Mexican Grill Plantation, FL 33324 Website (407) 383-5015 The Boathouse On Naples Bay Naples, FL 34102 Website 239-643-2235 READ AND REAP! Barbecue That Speaks for Itself Fast Repairs. Smart Service. Zero Surprises. Defending Dreams, One Case at a Time MORE TO EXPLORE! Best of Florida Voting Best Bars in Florida Guide to Alabama Georgia Business Journal Guide to Florida Get the Newsletter! Click to Subscribe Guide to Florida Subscribe Submit Story Idea Contact Us 904-515-5640 Directory List Your Company Advertise Your Company Member Login Browse Categories Best of Florida Vote For Your Favorites Download Campaign Kit Nominate a Business How it Works × Member Login * Email Address * Password Need to retrieve your password? Click Here × Get the Newsletter! The security check was not completed successfully."
    },
    {
      "url": "https://www.tallahassee.com/story/news/money/2020/02/14/bar-1903-inside-tallahassees-first-library-turned-bar/4690497002/",
      "text": "Bar 1903: Inside Tallahassee's first library-turned bar News Sports Entertainment Opinion Email Us Advertise Obituaries eNewspaper Legals MONEY Bar 1903: A toast to the next chapter of Tallahassee's first library TaMaryn Waters Tallahassee Democrat More than 100 years ago, a tall sturdy bookshelf held hundreds of books. It is now replaced with a mirrored display case of bourbon, gin, rum and cognac. The Walker Library, the first in Tallahassee, has begun a new chapter as Bar 1903 . The name pays homage to its history and stands as a throwback to old Tallahassee, when women wore Victorian fluted skirts and frilly long-neck blouses alongside men in top hats and overcoats. It was a different time, roughly 80 years after Tallahassee became the state's Capitol. Years before, Gov. David S. Walker (in office 1865-68) had shepherded the effort that launched with two small reading areas upstairs. Skip to today, it's one of the few historic buildings still open to the public, thanks to its induction into downtown nightlife. From original heart pine floors and columns, antique sconces and the \"library\" sign outside, much of it appears frozen in time. Bar operator Jesse Edmunds of Seven Hills Hospitality Group was perfectly fine running his other popular restaurants and bars: El Cocinero on Tennessee Street, and The Hawthorn Bistro & Bakery and Liberty Bar on North Monroe Street in Midtown. But a series of serendipitous events occurred — the property owner buying the lot for $350,000 in May, coming into Edmunds' restaurants as a customer, posting pictures of the property and not knowing what to do with it and Edmunds' wife seeing the post — it all seemed like destiny. Edmunds was curious about the space, one of only 65 Leon County properties listed on the National Register of Historic Places. He took an initial meeting about the 2,300-square-foot former library sitting on roughly a third of an acre. Once inside, it was love at first sight. “It was not something I was looking for or wanted to do,” Edmunds confessed. “But as soon as I walked in and looked up. I was like, ‘Oh crap. Here we go. Four.’ ” The old space has character, like something in the pages once housed along the walls. Up high, the ceiling has intricate woodwork akin to the era. None of the windows are the same height, a quirky feature Edmunds found charming. Going upstairs, the narrow staircase could easily give someone vertigo and the low balcony rails are more ornate than functional. He decided upstairs would be closed off for customers and used for storage. According to a 2016 Tallahassee Democrat article , the Walker Library served the community from 1903 to 1956, when the library moved into the basement of the Columns, an antebellum mansion two blocks west on Park Avenue (a building since relocated to Duval Street and Park Avenue, where it is the home of the James Madison Institute). Restoration on the former library spanned four months and included a new bar, walls for the restrooms, new paint and wood rejuvenation. Bar 1903 opened Feb. 7 and, within five minutes, 50 customers lined up to be among the first inside. It seats up to only 36 customers at a time and the high demand resulted in a two-hour waiting list for the rest of the night. In fact, every night has been slammed, Edmunds said, with the exception of Monday. “When we say we’re 36 seats, it’s not because we are trying to be pretentious or tight. It’s because that’s the back wall,” said Edmunds, pointing to the fireplace featuring a portrait of Walker and large windows overlooking South Calhoun Street. “People come and don’t understand they can’t just stand at the bar.\" Tapas and shareable foods, ranging from $7 to $20, are served within the 16-page, leather bound menu of food, spirits and cocktails. Edmunds uses his other businesses for production, preparation and storage for the food served at Bar 1903. “It’s almost like a stationary food truck in a way,” Edmunds explained. The first page of the menu reads “Athenaeum” — an “institution for the promotion of literary or scientific learning.” It features drinks grouped by years, such as \"Pre 1880\" with the Manhattan and the John Collins and \"1919-1933\" with a Hanky Panky and a Side Car. Edmunds said the gin and tonics selection has been wildly popular. Aside from specialty drinks, it's stirring nostalgia for residents who remember coming to Walker Library as children. It's likely to be added as a featured attraction for Tallahassee's tourism. More: From books to booze: Historic downtown Tallahassee library building will next become bar “We are thrilled to see Bar 1903 opening as the latest example of the recent growth of top-notch restaurants and nightlife options within easy walking distance of several hotels, bringing increased foot traffic and energy to downtown,\" said Kerri Post, who heads Leon County Tourism, also known as Visit Tallahassee. After the Democrat's initial story about the bar, several social media comments wrongfully assumed taxpayer money was spent to bring the bar to fruition, Edmunds said. \"People assume we got tons of handouts from the city, (that) we’re heavily subsidized like The Edison,” Edmunds said. “We have gotten not a dime. I funded this project. The landlord is private. We have done this. We haven’t had a cent of taxpayer money … This is us doing this for Tallahassee.” Contact TaMaryn Waters at tlwaters@tallahassee.com or follow @TaMarynWaters on Twitter. Never miss a story: Subscribe to the Tallahassee Democrat. Staff Directory Corrections Careers Accessibility Support Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Businesses Advertise Your Business Buy and Sell Licensing & Reprints Help Center Subscriber Guide Manage Account Give Feedback Licensing & Reprints Subscribe Today Newsletters Mobile Apps Facebook X eNewspaper Archives Jobs Real Estate Classifieds Education Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.tallahassee.com. All rights reserved."
    },
    {
      "url": "https://cba.org/about-us/who-we-are/",
      "text": "Who We Are | Canadian Bar Association CBA memberships expired on August 31, 2025. You can still renew today and continue to enjoy benefits. Please email or call us at 1-800-267-8860 with any questions. Choose your CBA site: National Branches Alberta British Columbia Manitoba New Brunswick Newfoundland & Labrador Northwest Territories Nova Scotia Nunavut Ontario Prince Edward Island Québec Saskatchewan Yukon In-House Lawyers Français Choose your CBA site: National Alberta British Columbia Manitoba New Brunswick Newfoundland & Labrador Northwest Territories Nova Scotia Nunavut Ontario Prince Edward Island Québec Saskatchewan Yukon In-House Lawyers Français About Who We Are Governance National Office Branches CBA Elections and Appointments News Contact Careers CBA Career Centre Work at the CBA Login Become a Member Login Become a Member Our Impact About Advocacy Initiatives Committees Court Interventions Resolutions Submissions Law for the Future Fund Learn more Get Involved Volunteer Volunteer with Sections Awards and Recognition Advertise with us Awards Learn more Sections Sections Enroll in Sections Essay Contests Volunteer with Sections Join a CBA National Section Executive Learn more Professional Development About CBA PD Webinars National Conferences Online Symposia On-Demand Programs Special Learning Programs Resources Resources Reconciliation, Equality and Diversity Well-Being & Lawyer Assistance Practice Tools Publications & Podcasts CBA PracticeLink Class Action Database CBA National Read now Membership Joining the CBA Fees & Benefits Group Membership CBA Partner Program Member Savings Membership Card Become a member Join now For the Public For the Public Immigrating to Canada Find a Lawyer Legal Health Checks Legal Resources Find a Lawyer Search now About Who We Are Governance National Office Branches CBA Elections and Appointments News Contact Careers CBA Career Centre Work at the CBA Our Impact About Advocacy Initiatives Committees Court Interventions Resolutions Submissions Law for the Future Fund The Law for the Future Fund provides financial support for innovative Canadian research projects in the field of law. Learn more Get Involved Volunteer Volunteer with Sections Awards and Recognition Advertise with us Awards Explore the full list of CBA awards, scholarships, recognition programs and essay contests. Learn more Sections Sections Enroll in Sections Essay Contests Volunteer with Sections Join a CBA National Section Executive Applications are open for positions on CBA National Section Executive Committees. Learn more Professional Development About CBA PD Webinars National Conferences Online Symposia On-Demand Programs Special Learning Programs CBA Aboriginal Law Conference In-Person Conference person Winnipeg, MB | September 17, 2025 View all programs Resources Resources Reconciliation, Equality and Diversity Well-Being & Lawyer Assistance Practice Tools Publications & Podcasts CBA PracticeLink Class Action Database CBA National Stay on top of changes in federal legislation, substantive law, practice management and the legal marketplace. Read now Membership Joining the CBA Fees & Benefits Group Membership CBA Partner Program Member Savings Membership Card Become a member Maximize your membership benefits through CBA Advantage discounts and get more with membership. Join now For the Public For the Public Immigrating to Canada Find a Lawyer Legal Health Checks Legal Resources Find a Lawyer Use our Find-a-Lawyer search tool to locate a lawyer who specializes in the area of law you need. Search now Home / About / Who We Are The voice of Canada’s legal profession The Canadian Bar Association champions Canada’s legal profession and the rule of law in Canada. We are the largest association for legal professionals in the country, representing over 40,000 lawyers, judges, notaries, academics and students. We connect our members to the people, knowledge and skills they need to successfully practice law. We offer a strong, unified voice and promote fair justice systems, effective law reform, wellness and equity. We are the legal profession’s go-to source for high-quality legal training and information. Explore what we do and how we work Our Vision and Mission remove_circle_outline add_circle_outline We are the essential ally and advocate of the legal profession and guardian of the rule of law in Canada. Our members are passionate about their association and the good it brings to their lives and to the world. Staff and volunteers are inspired to exceed members’ expectations every day. Our mission is to: Improve the law and the administration of justice Improve and promote access to justice Promote equity in the legal profession and in the justice system Improve and promote the knowledge, skills, ethical standards and well-being of members of the legal profession Promote the interests of CBA members and represent the legal profession nationally and internationally How We Work remove_circle_outline add_circle_outline The CBA has a National Office in Ottawa, branches in every province and territory , and an in-house counsel division called the CBA In-House Lawyers . Through the work of the CBA Executive, Board of Directors, Leadership Forum, Committees, Sections and staff at the national and branch levels, we lobby the government on important legal issues, protect the profession’s core values and actively engage with Canada’s legal community. We offer high-quality professional development programs, conferences and events. Our publications, practice tools, resources and podcasts offer insights into global and national trends affecting your work. Learn how CBA is governed Our History remove_circle_outline add_circle_outline We have been championing Canadian lawyers and Canadian law since 1896. The Canadian Bar Association has existed in its present form since 1914. The association was incorporated by a Special Act of Parliament on April 15, 1921. Quick Links 1 Governance 2 National Office 3 Branches 4 Board of Directors 5 Bylaws and Policies 6 Committees 7 Sections 8 CBA Partners Become a Member As the largest national association for legal professionals, the Canadian Bar Association delivers what you need to thrive in your career and to navigate life changes. Explore Home Contact Careers Stay Connected Terms of Use & Disclaimer Privacy Policy © Copyright 2025 The Canadian Bar Association Tracking Preferences We use cookie and similar technologies in our web sites. For more information see our privacy policy page."
    },
    {
      "url": "https://finewineliquors.com/contact-us/",
      "text": "Contact us Fine Wine Liquors Shop By Department Wine Red wine Menu Shiraz Cabernet Sauvignon Pinot Noir Red Blends Other Red Varietals Rosé Cabernet Merlot Shiraz Cabernet Merlot Grenache Tempranillo Sangiovese Nebbiolo Bordeaux Barossa Valley white Wine Menu Chardonnay Riesling Sauvignon blanc Pinot gris grigio Other white varietals White blends Dessert white Popular Regions Menu Bordeaux Barossa Valley Mclaren Vale Coonawarra Margaret River Burgundy Clare Valley Fortified Wine Menu Port Tawny Sherry Apera Vermouth Muscat Mead Tokay Topaque Popular Brands Menu Penfolds Under Wraps Wynns Wendouree Wolf Blass Tyrrell’s Top Selling Macallan 15 Year Old Double Cask $ 165.00 Availability: In Stock Glenfiddich Project XX $ 61.00 Availability: In Stock Glendronach 15 Year Old Revival $ 86.25 Availability: In Stock Beer Discover Beer Menu Craft Beer International Beer Australian Beer Mid Strength Light Beer Low Carb Beer Alcoholic Ginger Beer Home Brew Stout Pilsner Wheat Beer Dark Beer Golden Ale Porter Categories Menu Kegs Cider Craft Beer Domestic Beer Hard Seltzers Import Beer Non-Alcoholic Beer Popular Brands Menu 4 Pines Balter Coopers Little Creatures Stone & Wood Zytho New & Trending Menu New Arrivals Top Rated Craft Beer Light Low Pool Packs Cool Off Craft Beer The Lemonade Stand Country Menu Australia Sweden New Zealand France Spain From to Ready to Drink Organic Wine $69.99 Whiskey Discover whiskey Menu Scotch Whisky American Whiskey Japanese Whisky Australian Whisky Irish Whiskey Canadian Whisky Indian Whisky Discover Vodka Menu Absolut Smirnoff Hunter Distillery Stolichnaya Royal Dragon Crystal Head Poliakov Popular Brands Menu Johnnie Walker Jack Daniel’s Glenfiddich Highland Park Glen Moray Stone & Wood Fortified Wine Menu Whiskey Of The Month Flavored Whiskey Blended Scotch Rye Whiskey Single Malt Scotch Small Batch Bourbon Hot deals of summer Fresh Beer Save up $49.99 Jameson Whiskey Father’s Day Sale 40% off Sitewide! Cogac Cocktail Tequila What’s New New Gift & Accessories Best Sellers Sales & Offers -20% Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Menu Sign In or Register 0 0 $ 0.00 Contact us Home Page Contact us Don’t  hesitate to contact us \nif you need help. Whether you have a question about your order, need assistance with a product, or just want to reach out, you’re in the right place. Feel free to contact us using the details below, and we’ll get back to you as quickly as possible! Address 8560 S Cottage Grove Ave, Chicago, IL 60619, United States Call Us (630) 354-9222 Openning Monday – Friday: 8am – 10pm Saturday – Sunday: 9am – 5pm Contact sales@finewineliquors.com finewineliquorsinfo@gmail.com Got Any Questions? Use the form below to get in touch with the sales team Message Send your message Δ Search Account Cart Same-day local delivery Ground shipping directly to you Free in-store pickup 24/7 customer support Customer Service Menu Help Center My account Track my order Return policy About Us Menu Company info Press Releases Careers Reviews Investor relations Quick Links Menu Search Become a reseller Contact us Terms of service Categories Menu Brandy White Wine Champagne Vodka Tequila Get exclusive offers & rewards Sign up for our members portal to receive some exclusive offer & rewards. It’s easy and free! sign up Leave this field empty if you're human: stay connect Facebook-f Twitter Instagram Pinterest we accept Careers About Us Affiliates Privacy Settings Help Site map Copyright ©  2022 Liquory . All rights reserved. Sign in Create an Account Username or email * Password * Login Lost your password? Main menu Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Home About Us Account Blog Careers Cart Checkout Contact us Legal Notice My account Order Tracking Privacy Policy Refund and Returns Policy Reviews Sample Page Shipping Shop Terms & Conditions Track Wishlist Search for: Search All category All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell’s Black Lebel Blanton’s Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester’s Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell's Black Lebel Blanton's Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester's Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine Hide similarities Highlight differences Select the fields to be shown. Others will be hidden. Drag and drop to rearrange the order. Image SKU Rating Price Stock Availability Add to cart Description Content Weight Dimensions Additional information Click outside to hide the comparison bar Compare Top Shopping cart close ×"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. name E-Mail Nachricht First name Surname * E-Mail * Nachricht * Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "https://www.tallahasseetable.com/from-library-to-libations-bar-1903-a-downtown-hit/",
      "text": "Check out delightful food and cocktails at intimate Bar 1903 - Tallahassee Table Dining & drinking in Florida's Capital City and beyond… Home About Calendar Features Reviews Chefs Farming Contact Us Search Features Check out delightful food and cocktails at intimate Bar 1903 by Tallahassee Table March 2, 2022 written by Tallahassee Table March 2, 2022 5.7K From library to libations: Historic setting pairs top-notch menu and superb drink menu Bar 1903 has to be one of the most enchanting spots in Tallahassee. The historic building was Tallahassee’s first library, lovingly renovated by Jesse Edmunds, owner of Liberty Bar , El Cocinero and The Hawthorn Bistro & Bakery . It’s a beautiful setting, thankfully spared. My husband and I went to Bar 1903 on a recent Friday night and since we were there about 5 p.m., we were able to snag a table without a wait.You may have heard about the superb cocktail menu at Bar 1903, but the food menu is another reason to visit this charming venue. We had the grilled honey-roasted butternut squash bruschetta and it was perfect for the season. The toasted baguette was topped with the squash, arugula, whipped black pepper goat cheese, a white balsamic reduction and toasted pistachios – fantastic. Andouille and crawfish mac and cheese is one of the dishes you’ll want to share at Bar 1903. Photo / Tallahassee Table My husband and I also devoured an excellent beef and brie sandwich plus a dish of andouille and crawfish mac and cheese that was ultra rich. Comfort food with a zingy twist. Deviled eggs and pecan stuffed figs are two other treats. As for the cocktails, there’s a holiday drink menu available in December, including a Gingerbread Old-Fashioned with Old Forrester, Pimms, Gingerbread syrup and Angostura Cocao Bitters; warm, homemade apple cider with your choice of Calvados, Old Forester Bourbon and Plantation Dark Rum; I’m Dreaming Of … with St. Augustine Vodka, White Chocolate Liqueur and Peppermint whipped cream along with A Hallmark Original featuring Chai-spiced Bacoo Rum, coconut milk, evaporated milk, chestnut praline syrup and a whole egg. You’ll find modern cocktails with garnishes like a sliced of blood orange or drinks created more than a decade ago. Photo / Tallahassee Table Also, check out the trademark cocktail menu that’s divided into time periods, starting with pre-1880, including drinks that have now become standard: a Manhattan, an Old-Fashioned, Sazerac.Bar 1903 is a lovely choice normally whether for a date night or a gathering of friends, but it’s even prettier now, decked out for the holidays. Cheers! Here’s my initial story on Bar 1903 for more background. Jesse Edmunds wasn’t in the market for another new business.  But then his wife, Briana, persuaded him to check out a vacant building downtown. He reluctantly agreed because, well, it wasn’t just any building. Tallahassee’s first library, spared from demolition, was waiting to be given a new life. “I looked up and saw the ceiling and said, ‘Damn it!’ “ said Edmunds — owner of Liberty Bar and Restaurant, El Cocinero and The Hawthorn Bistro & Bakery. “It hit me like a ton of bricks.” He knew then that he wanted to take on this new project: transforming the historic David S. Walker Library, built in 1903, and saved from the construction of the Ballard Building right next door. On Friday, Feb. 7, after months of work by Edmunds and his team, Seven Hills Hospitality Group, the former library was reborn as Bar 1903. A space that once nurtured the minds of its patrons will now tempt their palates with fun small plates and dozens of classic cocktails in a lovely setting. About 50 customers were lined up at the door when the place opened at 4:30 p.m. Friday. But the place only has room for 36. My husband and I and our friends tried to get in on Saturday night but it was filled to capacity and we didn’t want to wait. I came back on Tuesday to meet with Edmunds to get a better look and hear more about his vision for Bar 1903. While there are modern accents, the former library has an intimate feel. There’s really only one main room, which is elegant and understated, with a few nooks for more  privacy. It’s decorated in soft, neutral colors with lots of woodwork and black furniture. A portrait of David S. Walker hangs over the fireplace. A narrow staircase by the bar leads to a second floor, a skinny walkway flanked by wood that encircles the main room like a VIP balcony at an opera. Sadly it’s not workable for serving the public. “Look how narrow it is,” said Edmunds. And there’s only one staircase to get up and down in case of fire. It sure adds charm to the room, though. The challenge here, at least during prime time — is getting a seat. Bar 1903 operates like this: If the room is filled to capacity, the host will keep your place and take your cell number to contact you when seating opens up (there’s no way to know whether that will be a short time or hours later though waits tend to be 30 to 40 minutes). Once you’re contacted, you have 15 minutes to come back and claim your seat. A historic building finds new life in downtown Tallahassee . Photo / Tallahassee Democrat There’s no place for standing or waiting unless you want to take a stroll. The Chain of Parks is across the street. About 400 to 500 patrons stopped by Bar 1903 over the weekend and “we seated 190 of them,” said Edmunds.  “Most had to go somewhere else” — at least until space opened, if they indeed wanted to come back. Bar 1903 is the latest downtown venture, joining the upscale restaurants Il Lusso and Saveur, the retro lounge/restaurant Rootstock and Eve on Adams, the new rooftop cocktail lounge perched above the 16-floor DoubleTree by Hilton. These places didn’t exist two years ago, but there’s room for all of them, said Edmunds. Some customers who couldn’t get into Bar 1903 went to Jesse’s other venues, Liberty and El Cocinero, and a good many had dinner and/or drinks at the other downtown destinations. “All of us won,” said Edmunds. Bar 1903 isn’t competing with full-service fine dining menus. Edmunds features small plates — charcuterie boards, bites like deviled eggs and crab toast, sandwiches and desserts. The star here is the drink menu, which offers House Cocktails, like the Demon Seal (with Bacoo 12-year rum, chai spiced maple syrup and smoked cinnamon), the Juniper Tree (with Fords Gin, Yellow Chartreuse and strawberry dust) and Heavy Metal Queen (St. Augustine vodka, rose and vanilla syrup). There’s a separate page for Gin & Tonics that’s “super cool,” said Edmunds.”I was never a gin drinker before I experienced this. It’s a complex and beautiful spirit.” Following the House Cocktails, the drinks menu is divided into time periods, starting with pre-1880, including drinks that have now become standard: a Manhattan, an Old-Fashioned, Sazerac. “There wasn’t any Internet then, but you can see what trends were like on the East Coast and the West Coast and what spirits were popular,” Edmunds said. “There was a lot of commonality.” Other timelines are 1880-1919, 1919-1933, 1933-1950, 1950-1980, 1980-2000, 200-Now and beer and wine.  Except for Miller High Life and Michelob Ultra, Bar 1903 carries beer from Florida breweries: Proof and Deep (Tallahassee), Oyster City Brewing (Apalachicola), Cigar City (Tampa) and 3 Daughters Brewing (St. Petersburg). Aside from developing the bar and menu, Edmunds and his team were also involved in doing much of the work. “I can look around and be proud,” he said. Edmunds built the bar with red oak and chinkapin wood he obtained from Quincy. He hand-milled the wood, creating 650 slabs that he fashioned into a herringbone pattern used for the top of the bar. It’s polished to a natural sheen using Odie’s Oil, developed by James Tinghitella in Sopchoppy. He also built the back of the bar and the bathrooms. Photo: Bar 1903, as work was being done to transform the library. As for that gorgeous high ceiling, it needed to have mold mitigation work. “We hired a specialty window washer who hand-mopped it using a 40-foot extension pole from the middle of the room,” said Edmunds. That ceiling, and its skylight, are stunning. “A building like this is rare and hard to find,” said Edmunds. “The stars were aligned.” Bar 1903 is 209 E. Park Ave.; 850-354-9739. It’s open from 4:30 p.m. to midnight Monday to Thursday and 4:30 to 2 a.m. Friday to Saturday. Bar 1903 Downtown Tallahassee Eve on Adams Il Lusso Jesse Edmunds Rootstock Savour Visit Tallahassee 0 comments 0 Facebook Twitter Pinterest Threads Bluesky Email Tallahassee Table previous post Vietnamese Paris Bánh Mì has a French connection next post Grove Market a top pick for your breakfast/lunch spot You may also like Thank you to a beloved Tallahassee restaurant August 7, 2025 Special feast for tomato lovers June 4, 2025 Tallahassee’s culinary world can be pretty grand April 1, 2025 Sausages: the new LINK in Midtown’s culinary lineup March 15, 2025 New pastry chef brings Italian flair to Kool... February 21, 2025 Putting a spotlight on Tallahassee’s black-owned restaurants February 7, 2025 Pastry chef Sylvia Gould pursuing new ventures January 13, 2025 Savor authentic taste of Venezuelan cuisine at VeneBites December 22, 2024 Thanksgiving: Dining out, ordering in November 15, 2024 Get a behind-the-scenes look at real farm life October 9, 2024 Leave a Comment Cancel Reply Save my name, email, and website in this browser for the next time I comment. Δ Newsletter Signup Email address: Leave this field empty if you're human: About Tallahassee Table Breaking bread together is one of our most social human activities, and I’m convinced that food is the key to knowing a place and its people. Here in Tallahassee and the surrounding area, we may not have, in sheer numbers, the dining choices some other locales have, but there’s a very vibrant — and growing — food culture here. I hope you’ll help me, and you, grow with it.  I welcome your comments and suggestions. To submit a tip or pose a question to our editors, click here. Read about our rating system. Reader Favorites Thank you to a beloved Tallahassee restaurant Special feast for tomato lovers Tallahassee’s culinary world can be pretty grand Sausages: the new LINK in Midtown’s culinary lineup New pastry chef brings Italian flair to Kool Beanz Cafe Categories Categories Select Category Bites Calendar Chefs Farming Features Florida Reader Favorites Recipes Reviews Service How to Reach Us To submit your restaurant or business listing , click here . To add an event to our events calendar , click here . To join our email list to be notified of new posts, click here . To submit a tip or pose a question to our editors, click here. Facebook Facebook Tallahassee Table Follow 1,086 1,414 Written by Rochelle Koff, dining blogger, freelance writer, former Miami Herald editor & restaurant critic. Please follow on Facebook @TheTallahasseeTable Retweet on Twitter Tallahassee Table Retweeted Lisa Desjardins @LisaDNews · 18 Jul 1946177036591984831 Thank you for the good thoughts for PBS and esp. @NewsHour.  It means the world.  We're as determined to ever.  Ways to support: 1. EASY one - let's build. Folo me - @LisaDNews.  Folo @NewsHour RT this. Reply on Twitter 1946177036591984831 Retweet on Twitter 1946177036591984831 979 Like on Twitter 1946177036591984831 2312 X 1946177036591984831 Tallahassee Table @tallytable · 27 Jan 1883966751412744656 Celebrate the Chinese New Year, 1 to 3 p.m. , at the Tallahassee Chan Center, 1310 Paul Russell Rd., with food and music. The Year of the Snake is officially celebrated for 16 days, starting Jan. 29. Would love recommendations for Chinese food in Tallahassee area. Reply on Twitter 1883966751412744656 Retweet on Twitter 1883966751412744656 0 Like on Twitter 1883966751412744656 0 X 1883966751412744656 Tallahassee Table @tallytable · 16 Mar 2024 1769110658434384101 These are wonderful concerts! 🎻 Candlelight Concerts in New York Tickets 2025 | Fever Enjoy Candlelight concerts! The best concerts performed under candlelights with live performers and in the most emblematic locations in New York. feverup.com Reply on Twitter 1769110658434384101 Retweet on Twitter 1769110658434384101 0 Like on Twitter 1769110658434384101 0 X 1769110658434384101 Retweet on Twitter Tallahassee Table Retweeted BuzzFeed @BuzzFeed · 26 Dec 2022 1607390850836828162 A specific prop seen at the beginning of the season is actually an important skincare tool that the makeup team used on each actor prior to makeup application. 9 Fascinating “Emily In Paris” Behind-The-Scenes Beauty Facts, Directly From The Show’s Makeup... A   specific   prop   seen   at   the   beginning   of   the   season   is   actually   an   important   skincare   tool   that   the   makeup   team ... www.buzzfeed.com Reply on Twitter 1607390850836828162 Retweet on Twitter 1607390850836828162 1 Like on Twitter 1607390850836828162 11 X 1607390850836828162 Tallahassee Table @tallytable · 8 Aug 2022 1556611427288465412 It was fantastic! Thanks so much TLH Beef Society and volunteers and all the breweries, food vendors and talented Ben! TLH Beer Society @TLHBeerSociety Free craft beer from 16 different local breweries. Amazing food trucks, a local oyster famer and the delicious TC Bakery. The soon-to-be famous Ben Flournoy of Quincy (he's only 16) on the 🎤 and 🎸. This was, undoubtedly, one of the most EPIC parties in Tallahassee history. Reply on Twitter 1556611427288465412 Retweet on Twitter 1556611427288465412 2 Like on Twitter 1556611427288465412 9 X 1556611427288465412 Tallahassee Table @tallytable · 3 Aug 2022 1554786866838360064 Wow! TLHBeerFest @TLHBeerFestival Our current list of who’s pouring! Yup - over 100 brewers & breweries😍 @HomebrewAssoc @JaxBeerSociety @GNVBeerSociety @TLHBeerSociety @Visit_Tally @ftibeer @Greg_Tish @Twigginsradio @bigwoodyhayes @tallytable @MadisonSocial @FLbeer @FLBeerWholesale @homebrew @beerfests Reply on Twitter 1554786866838360064 Retweet on Twitter 1554786866838360064 0 Like on Twitter 1554786866838360064 1 X 1554786866838360064 Tallahassee Table @tallytable · 14 Jul 2022 1547704820152160257 Join the anniversary celebration for the @TLHBeerSociety, the group that put our regional craft breweries on the map! Bravo! TLH Beer Society @TLHBeerSociety IT IS (FINALLY) TIME FOR THE BIG BEER SOCIETY NEWS! 🥁  roll, plz .... The 5-Year Anniversary of the #TLHBeerSociety is just weeks away - and we are throwing a MASSIVE party to celebrate! Beer. Food. Oysters. Games. And ... You are ALL invited! https://www.tallahassee.com/story/life/food/beer/2022/07/14/tlh-beer-society-turning-5-and-throwing-celebration-craft-breweries-party-august-brew-bend/10053726002/ 1/ Reply on Twitter 1547704820152160257 Retweet on Twitter 1547704820152160257 1 Like on Twitter 1547704820152160257 3 X 1547704820152160257 Retweet on Twitter Tallahassee Table Retweeted Kimba1212 @VandergriftKim · 5 Jun 2022 1533448698918756352 This is great news! #BoschLegacy Reply on Twitter 1533448698918756352 Retweet on Twitter 1533448698918756352 1 Like on Twitter 1533448698918756352 3 X 1533448698918756352 Tallahassee Table @tallytable · 1 Jun 2022 1531967496441438208 Any ideas why Amir and Laura are leaving the show? Siretha Dansby @SirethaD @AmirArison @kiterunnerbway @NBCBlacklist Please say you will be back. This is just storyline...right? Reply on Twitter 1531967496441438208 Retweet on Twitter 1531967496441438208 0 Like on Twitter 1531967496441438208 1 X 1531967496441438208 Tallahassee Table @tallytable · 11 Apr 2022 1513490124713394177 Breakfast, lunch, dinner, dessert … Reply on Twitter 1513490124713394177 Retweet on Twitter 1513490124713394177 1 Like on Twitter 1513490124713394177 0 X 1513490124713394177 Load More Facebook Twitter Instagram @2023 - All Right Reserved. Designed and Developed by WPTallahassee Back To Top Home About Calendar Features Reviews Chefs Farming Contact Us"
    }
  ]
}