{
  "fuentes": [
    {
      "url": "https://golfscape.com/tampa-golf-courses/bardmoor-golf-tennis-club",
      "email": "cove-cay-golf-club-3-m@2x.jpg"
    },
    {
      "url": "https://golfscape.com/tampa-golf-courses/bardmoor-golf-tennis-club",
      "email": "cove-cay-golf-club-3-s@2x.jpg"
    },
    {
      "url": "https://www.bardmoorgolf.com/contact/",
      "email": "361catering33777@bayouclubgolf.com"
    },
    {
      "url": "https://www.bardmoorgolf.com/contact/",
      "email": "accounting10688@bayouclubgolf.com"
    },
    {
      "url": "https://www.bardmoorgolf.com/contact/",
      "email": "catering33777@bayouclubgolf.com"
    },
    {
      "url": "https://www.bardmoorgolf.com/special-events-meetings/",
      "email": "catering33777@bayouclubgolf.com"
    },
    {
      "url": "https://ilovetheburg.com/venue/bardmoor-golf-tennis-club/",
      "email": "info@ilovetheburg.com"
    },
    {
      "url": "https://www.tampabay.com/pinellas/bardmoor-golf-amp-tennis-club-20190523/",
      "email": "licensing@zumapress.com"
    },
    {
      "url": "https://www.bardmoorgolf.com/weddings-bridal-events/",
      "email": "catering33777@bayouclubgolf.com"
    }
  ],
  "mails": [
    "361catering33777@bayouclubgolf.com",
    "accounting10688@bayouclubgolf.com",
    "catering33777@bayouclubgolf.com",
    "cove-cay-golf-club-3-m@2x.jpg",
    "cove-cay-golf-club-3-s@2x.jpg",
    "info@ilovetheburg.com",
    "licensing@zumapress.com"
  ],
  "nombre_sitio": "bardmoorgolf.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://golfscape.com/tampa-golf-courses/bardmoor-golf-tennis-club",
      "text": "Bardmoor Golf & Tennis Club ⛳️ Book Golf Online • golfscape™ Explore Destinations Help Log In Sign Up Language Currency How can we help? How can I book a tee time? 1 Navigate to your preferred golf course. Select your date of play, tee time, rentals, and number of players – and then click Book. You will receive an instant email confirmation and your tee time will be guaranteed at the course. Can I modify or cancel a booking? 1 Absolutely! If you are within the cancellation policy of your tee time, navigate to the Manage Booking page to modify or cancel your booking. What is your cancellation policy? 1 You can typically cancel your booking for a full refund within 48 hours of your tee time, but this may vary slightly by course. Cancellation policies are defined by each golf course and are clearly marked during the entire booking process as well as in your email confirmation. Why should I book with golfscape? 1 We are the only service who’s technology operates at all our partner courses – that means tee times and rates on golfscape are sourced directly. So when you make a booking, your reservation is confirmed instantly at the golf course. How can I get more help? 1 You may communicate with us anytime using the button below or email us at [email protected] – we’re happy to help! Contact us Get Started Create Account or sign up with Log In Forgot Password? Log In or log in with Profile My Bookings Log Out Tampa Golf Courses Bardmoor Golf & Tennis Club Bardmoor Golf & Tennis Club Tampa Golf Courses Next Previous Show all photos Instant Booking Confirmation Trusted by 1M+ Golfers Free Changes & Cancellations Florida golf doesn't get any better than Bardmoor. Broad, generous fairways that invite you to hit away, glistening water features that add some sparkle to your round and of course, abundant sunshine. Arnold Palmer, Payne Stewart, Fred Couples, and Tom Kite to name a few have all played here. These PGA Tour players competed here annually in the PGA read more Course Details 18 Holes Par 72 7015 yards Established in 1974 Unique Course Type Bent Grass Designed by William Diddel Club Facilities 62.check Caddy / Golf Carts 62.check Practice Facilities 62.check Lessons 62.check Dining 62.check Club / Shoe Rental 62.check Golf Shop Weather Today's condition: - Temperature: / • Sunrise: / • Sunset: / ℃ ℉ back to Bardmoor Golf & Tennis Club Map Location 8001 Cumberland Road Seminole, Florida United States View map We are getting you the best tee time rates at this course Book a Tee Time Select Date of Play Tee Times & Players Instant Booking Confirmation Trusted by 1M+ Golfers Free Changes & Cancellations Instant Booking Confirmation Trusted by 1M+ Golfers Free Changes & Cancellations Book a Tee Time More Golf Courses in Tampa View all Tampa Golf Courses 8.5 472 reviews Cove Cay Golf Club Manage Booking Blog: Futuri Visio Golf Course Operators Terms of Use Affiliate Partnerships Privacy Policy Contact Us © 2025 golfscape . All Rights Reserved. |"
    },
    {
      "url": "https://www.bardmoorgolf.com/contact/",
      "text": "Contact Us - Bardmoor Golf and Tennis Club Skip to primary navigation Skip to main content Facebook Pinterest Twitter Book a Tee Time Bardmoor Golf and Tennis Club Home Golf Book a Tee Time Course Overview Scorecard Practice Facilities PGA Instruction Golf Shop at Bardmoor Current Golf Rates Outings Tournaments & Outings Golf Leagues Request Outing Information Dining & Events Pizzeria & Grille at Bardmoor Special Events & Meetings Weddings & Bridal Events Request Special Event Information Tennis & Pickleball New Pickleball Center Tennis at Bardmoor Tennis Programs & Instruction Memberships Player Development Program Tennis & Pickleball Memberships Member Statements Contact Directions & Hours Contact Us Contact Us Bob Dailey PGA General Manager – Outing Sales (727) 392-1234, ext. 208 Admin8001@BardmoorGolf.com Kurt Lang Certified PGA Teaching Professional (727) 742-0869 kwlangpga@gmail.com Janina Krawczyk Catering & Event Sales (727) 399-1000, ext. 361 Catering33777@BayouClubGolf.com Merissa Rock Director of Tennis/Membership Sales (727) 392-1234, ext. 205 Tennis8001@BardmoorGolf.com Jim McAnally Accounting (727) 392-1234, ext. 207 Accounting10688@BayouClubGolf.com Address : 8001 Cumberland Road Seminole, FL 33777 Email : Admin8001@BardmoorGolf.com Phone : (727) 392-1234 Click Here for Directions Facebook Twitter Pinterest Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone * Comment Submit Book Your Tee Time Online For tee times over the phone, please call For tee times please call: (727) 392-1234 . Book Now Contact Info Address : 8001 Cumberland Road Seminole, FL 33777 Email : Admin8001@BardmoorGolf.com Phone : (727) 392-1234 Click Here for Directions Accessibility Policy Site Map Privacy & Cookies: This site uses cookies. By continuing to use this website, you agree to their use. To find out more, including how to control cookies, see here: Cookie Policy Owned and operated by PGA Professionals Copyright © 2025 Bardmoor Golf and Tennis Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.bardmoorgolf.com/special-events-meetings/",
      "text": "Special Events & Meetings - Bardmoor Golf and Tennis Club Skip to primary navigation Skip to main content Facebook Pinterest Twitter Book a Tee Time Bardmoor Golf and Tennis Club Home Golf Book a Tee Time Course Overview Scorecard Practice Facilities PGA Instruction Golf Shop at Bardmoor Current Golf Rates Outings Tournaments & Outings Golf Leagues Request Outing Information Dining & Events Pizzeria & Grille at Bardmoor Special Events & Meetings Weddings & Bridal Events Request Special Event Information Tennis & Pickleball New Pickleball Center Tennis at Bardmoor Tennis Programs & Instruction Memberships Player Development Program Tennis & Pickleball Memberships Member Statements Contact Directions & Hours Contact Us Special Events & Meetings A Great Clubhouse and Scenic Course Views Provide the Perfect Backdrop for Your Event “I want to take this opportunity to personally thank the staff at Bardmoor. From the front of the house to the back, your staff made our group feel extremely comfortable. The room set up was great and the food was delicious. And let’s not forget the Service Flags – that was a great touch. Looks to me we have found a new location!” – Larry Tucker, VA Luncheon Committee Member From intimate cocktail parties to corporate meetings to community events and receptions, we have the perfect location. So think of Bardmoor Golf & Tennis Club next time you are looking for a place to hold your event. We offer beautiful surroundings and a newly renovated venue featuring a stylish ballroom and an inviting outdoor patio which can accommodate events for approximately 200 guests. A highly skilled staff will assist with all the arrangements for your group. Our first-class amenities along with our professional staff will ensure that your special occasion is sure to be a memorable and successful event. Bardmoor offers affordable event packages and personalized menus for any size budget. From continental breakfasts, brunch or lunch buffets to all occasion cocktail hours to formal sit-down dinners. Menus range from delicatessen style buffets to hearty barbecues and carving stations to the best prime rib, seafood and more. For More Information or to Schedule a Tour, Please Contact: Janina Krawcyzk, Catering Director (727) 399-1000 ext 361 Catering33777@BayouClubGolf.com Click Here to Request More Information about Special Events at Bardmoor Photos courtesy of Brian C Idocks Photographics Visit BrianCIdocks.com Book Your Tee Time Online For tee times over the phone, please call For tee times please call: (727) 392-1234 . Book Now Contact Info Address : 8001 Cumberland Road Seminole, FL 33777 Email : Admin8001@BardmoorGolf.com Phone : (727) 392-1234 Click Here for Directions Accessibility Policy Site Map Privacy & Cookies: This site uses cookies. By continuing to use this website, you agree to their use. To find out more, including how to control cookies, see here: Cookie Policy Owned and operated by PGA Professionals Copyright © 2025 Bardmoor Golf and Tennis Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://ilovetheburg.com/venue/bardmoor-golf-tennis-club/",
      "text": "Bardmoor Golf & Tennis Club We use cookies to give you the best experience on our site. Learn more or close to accept. × Skip to content Stories Guides Events Visitors Tours Merch Stories Guides Events Visitors Tours Merch Search Search 0 events found. Event Submission Form Notice There were no results found. Notice There were no results found. Bardmoor Golf & Tennis Club Events Venues Bardmoor Golf & Tennis Club Address 8001 Cumberland Rd Seminole , 33777 Get Directions Phone 7274331021 Website https://www.stpetefools.com Events at this venue Today Upcoming Upcoming Select date. Previous Events Today Next Events Since I Love the Burg launched in May of 2009, it has been our mission to make St. Petersburg (a.k.a. the #BURG) the best place to live, work and play. Facebook-f Instagram Twitter Tiktok Youtube Envelope Email Subscribe All Things Good Stories Guides Events Shop Visitor's Guide More From Us History Tours About / Contact Advertise Privacy Policy That's So Tampa © All rights reserved Brought to you with ❤️ by WallMedia Partners Stories Guides Events Visitors Merch"
    },
    {
      "url": "https://www.tampabay.com/pinellas/bardmoor-golf-amp-tennis-club-20190523/",
      "text": "Bardmoor Golf & Tennis Club Search Subscribe Manage profile Donate Log in Log out Menu Close Journalism you trust. Your News. Your Way. Subscribe Support Local Journalism Donate Home Home Log in Log in Log out Log out Search Search Newsletters Newsletters Help chat Help Chat Go to the e-Newspaper Navigation caret Go to the e-Newspaper Subscribers only Featured The Marked Man Buying up the Bay Elections The Housing Experiment Latest News Navigation caret Regions Pinellas Hillsborough Pasco Hernando St. Petersburg Tampa Clearwater Topics Education Business Real Estate Politics Crime Obituaries Navigation caret Weather Navigation caret Sports Navigation caret Bucs Rays Lightning High Schools Bulls Gators Seminoles Viewpoints Navigation caret Life & Culture Navigation caret Things To Do Calendar Food Navigation caret Videos Navigation caret Photos Navigation caret Investigations Navigation caret Connect with us Navigation caret Games & Puzzles Navigation caret Shop Navigation caret Tampa Bay Times Logo The words \"Tampa Bay Times\" written in a Gothic font Hurricane News Sports Viewpoints Life & Culture Food Obituaries Classifieds Today's Paper Newsletters e-Newspaper e-Newspaper Subscribers only Subscribe Advertisement Pinellas Bardmoor Golf & Tennis Club Wheelock Communities and Gentry Land plan to purchase and redevelop Bardmoor Golf & Tennis Club, an open and active golf course, should Pinellas County allow the property to be rezoned. The developers plan to build 800 to 1,200 new residential units on the land as well as a boutique hotel, and retail, restaurant and office space.  [LUIS SANTANA   |   Times] Published MORE FOR YOU Democrat Jennifer Jenkins is challenging Ashley Moody for US Senate • The Buzz on Florida Politics Florida Holocaust Museum reopens with giant rescue boat, Elie Wiesel artifacts • History Advertisement Clearwater man who killed ex in front of daughter gets life in prison • Crime British pub The Moon Under Water finally has a new home • Food Is the Trump-DeSantis rivalry back on? Look out for 2026. • The Buzz on Florida Politics Tampa Bay school districts adopt budgets amid declining enrollment • The Education Gradebook Lawn tyranny in Tampa Bay’s rainy season | Column • Viewpoints With no more vaccine mandates, who are the most at risk in Florida? • Health Hillsborough school board votes to remove more books • Hillsborough Dick’s Sporting Goods completes multibillion-dollar deal to acquire Foot Locker • Business Advertisement Advertisement Advertisement Tampa Bay Times Logo The words \"Tampa Bay Times\" written in a Gothic font Instagram Facebook Twitter/X Youtube LinkedIn Contact Help Chat Customer Service Submit a News Tip Contact Account Digital access Home delivery Newsletters Manage my account Donate Subscriber FAQ e-Newspaper FAQ e-Newspaper App FAQ About Times Publishing Company About us Connect with us Careers Advertise Times Total Media Media Kit Place an ad Public Notices Classifieds Best of the Best Shop Champa Bay Shop Bucs Hardcover Book Lightning Hardcover Book Photo Reprints Article Reprints Article Licensing Historic Front Pages Meeting Backgrounds More Spotlight News in Education Expos Homes Sponsored Content Special Sections Apps Podcasts Archives © 2025 All Rights Reserved Times Publishing Company Privacy Policy ONLY AVAILABLE FOR SUBSCRIBERS The Tampa Bay Times e-Newspaper is a digital replica of the printed paper seven days a week that is available to read on desktop, mobile, and our app for subscribers only. To enjoy the e-Newspaper every day, please subscribe. Subscribe Log in"
    },
    {
      "url": "https://www.bardmoorgolf.com/weddings-bridal-events/",
      "text": "Weddings & Bridal Events - Bardmoor Golf and Tennis Club Skip to primary navigation Skip to main content Facebook Pinterest Twitter Book a Tee Time Bardmoor Golf and Tennis Club Home Golf Book a Tee Time Course Overview Scorecard Practice Facilities PGA Instruction Golf Shop at Bardmoor Current Golf Rates Outings Tournaments & Outings Golf Leagues Request Outing Information Dining & Events Pizzeria & Grille at Bardmoor Special Events & Meetings Weddings & Bridal Events Request Special Event Information Tennis & Pickleball New Pickleball Center Tennis at Bardmoor Tennis Programs & Instruction Memberships Player Development Program Tennis & Pickleball Memberships Member Statements Contact Directions & Hours Contact Us Weddings & Bridal Events Create Your Happily Ever After at Bardmoor Located in the heart of Pinellas County, Bardmoor Golf & Tennis Club is the perfect affordable venue for the wedding of your dreams. Whether you are planning a bridal shower for 30 or your wedding for 150 guests, our professional staff will assist you with every detail to make it memorable. Surrounded by lush fairways and scenic golf course views, Bardmoor features an outdoor ceremony site and our newly renovated venue featuring a stylish ballroom and an inviting outdoor patio which can accommodate approximately 200 guests. Bardmoor’s professional staff is experienced in hosting a wide range of bridal events including: Bridal Showers Bridal Luncheons Bachelor Golf Outings Rehearsal Dinners Wedding Ceremonies & Receptions Anniversary Celebrations Let us create the perfect blend of sophistication, elegance and warmth to match your personality and style. For More Information or to Schedule a Tour, Please Contact: Janina Krawcyzk, Catering Director (727) 399-100, ext. 361 Catering33777@BayouClubGolf.com Click Here to Request More Information about Special Events at Bardmoor Read Our Reviews from past clients 27 reviews 5.0/5.0 I had the privilege of having Liz, Jesse, and Katherine all help me with my wedding day. Those ladies made the night absolutely perfect!… read full review 5.0/5.0 The Bardmoor was where we had our wedding ceremony and reception! It was by far the BEST decision we made throughout the entire wedding… read full review 5.0/5.0 My wedding was amazing! Liz made my wedding day (and all the days leading up to this day) very smooth. I was able to contact her with any… read full review Read all 27 Reviews at Read all of our wedding reviews on our Bardmoor Golf and Tennis Club Storefront at Photos courtesy of Brian C Idocks Photographics Visit BrianCIdocks.com Book Your Tee Time Online For tee times over the phone, please call For tee times please call: (727) 392-1234 . Book Now Contact Info Address : 8001 Cumberland Road Seminole, FL 33777 Email : Admin8001@BardmoorGolf.com Phone : (727) 392-1234 Click Here for Directions Accessibility Policy Site Map Privacy & Cookies: This site uses cookies. By continuing to use this website, you agree to their use. To find out more, including how to control cookies, see here: Cookie Policy Owned and operated by PGA Professionals Copyright © 2025 Bardmoor Golf and Tennis Club All Rights Reserved. Powered by"
    }
  ]
}