{
  "fuentes": [
    {
      "url": "https://barehoofcare.com/about-us-2/",
      "email": "gokeefe@ardellan.com"
    },
    {
      "url": "https://www.yoursunlife.com/sugarbeachmauritius/contact-us/",
      "email": "info.sbr@sugarbeachmauritius.com"
    },
    {
      "url": "https://www.yoursunlife.com/sugarbeachmauritius/contact-us/",
      "email": "reservations.sugarbeach@yoursunlife.com"
    },
    {
      "url": "https://www.barefootrestaurants.com/accessibility",
      "email": "info@bythesearesorts.com"
    },
    {
      "url": "https://inzmo.com/deu/en/contact",
      "email": "info@inzmo.com"
    },
    {
      "url": "https://www.barefootbaygolf.com/contactus/",
      "email": "bbalash@bbrd.org"
    }
  ],
  "mails": [
    "bbalash@bbrd.org",
    "gokeefe@ardellan.com",
    "info.sbr@sugarbeachmauritius.com",
    "info@bythesearesorts.com",
    "info@inzmo.com",
    "reservations.sugarbeach@yoursunlife.com"
  ],
  "nombre_sitio": "barefootrestaurants.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://barehoofcare.com/about-us-2/",
      "text": "About us - The Barefoot Blacksmith Skip to Main Content Your Basket - $ 0.00 Search for: The Barefoot Blacksmith Home About us Who is the Barefoot Blacksmith? What is barefoot performance? Newsletter Contact Privacy Policy Barehoofcare What is barehoofcare? Why Barefoot? Hoof protection Growing a better hoof Need a trimmer? Our network Barefoot Horses in Action All rounders Show jumpers Eventers Hunters Trail horses Dunlop’s High Country Horses Packer’s High Country Horse Riding Endurance horses Education Trimming Workshops Sharon May-Davis Anatomy Clinics Client feedback Diploma of Equine Podiotherapy Published Articles Trimming Workshops Home on the range Lameness rehab Rehabilitation, Retirement & Holiday Agistment Mayfield Farm Facility Hire Weekend Accommodation at Mayfield Shop online Menu Home About us Who is the Barefoot Blacksmith? What is barefoot performance? Newsletter Contact Privacy Policy Barehoofcare What is barehoofcare? Why Barefoot? Hoof protection Growing a better hoof Need a trimmer? Our network Barefoot Horses in Action All rounders Show jumpers Eventers Hunters Trail horses Dunlop’s High Country Horses Packer’s High Country Horse Riding Endurance horses Education Trimming Workshops Sharon May-Davis Anatomy Clinics Client feedback Diploma of Equine Podiotherapy Published Articles Trimming Workshops Home on the range Lameness rehab Rehabilitation, Retirement & Holiday Agistment Mayfield Farm Facility Hire Weekend Accommodation at Mayfield Shop online About us banner1 banner6 banner5 banner4 banner3 banner2 Who is the Barefoot Blacksmith? Andrew Bowe is a career master farrier who specializes in the barefoot rehabilitation of horses that are either suffering from chronic lameness or are simply not performing as well as they should be. He works in conjunction with veterinarians and equine body therapists. Read more ... What is barefoot performance? Barefoot performance is having a horse that is able to do what we want it to do in our chosen equestrian discipline, but keeping it as nature intended, without a nailed on horse shoe. Read more ... Why barefoot? Why question 1000 years of solid tradition? Read more ... Newsletter Read our newsletter and the newsletter archives. View newsletter... THE BAREFOOT BLACKSMITH | PH: 03 5773 4306 | FAX: 03 5773 4307 | EMAIL: admin@barehoofcare.com | © Copyright. All rights reserved. The Barefoot Blacksmith | Ardellan Web Design"
    },
    {
      "url": "https://www.yoursunlife.com/sugarbeachmauritius/contact-us/",
      "text": "Contact Us | Sugar Beach, Luxury Mauritius Resort Explore the resorts Back The Resort Rooms & Suites Deluxe Sea View Room Deluxe Beach Front Room Premium Sea View Room Premium Beach Front Room Family Room Premium Suite Premium Accessible Room Executive Beach Front Suite Offers Restaurants & Bars Wellness & Fitness Golf Experiences & Activites Weddings Wedding Packages Legal Requirements Meetings & Celebrations Venue spaces Conferences Parties & Celebrations Gift Voucher Sunlife Sugar Beach Long Beach La Pirogue Ambre Anahita Golf & Spa Resort Anahita Golf Ile aux Cerfs Location Day Pass Contact Us EN FR DE Day Pass Location Gift Voucher Contact Us Book Now Book Now Home Sugar Beach Contact Us Have a Question? Instantly get answers to your questions. Just send us a WhatsApp message. Using a laptop but prefer to chat on your mobile? No problem! Simply scan the QR code to start the conversation. Get in touch Call, email or complete our form Our team will get back to you and we look forward to welcoming you to experience Sugar Beach. Address Wolmar Flic en Flac Mauritius For More Information: Call on: +230 403 3300 For Reservations: Call on: +230 402 0151 or Email: reservations.sugarbeach@yoursunlife.com topic General Enquiry Wedding Enquiry Meeting Enquiry Dining Enquiry Spa Enquiry I AGREE TO THE TERMS & CONDITIONS Submit Newsletter Sign Up First Name Email Address * Website_Visitor Sunlife Sugar Beach Long Beach Ambre La Pirogue I agree to the privacy policy Sustainability Financial Information & Governance Mobile App Reviews Gift Voucher Members Club Join the Team Awards Cookie Policy Privacy Policy © Copyright Sun life 2022 Sugar Beach Wolmar, Flic en Flac, Mauritius Tel: +230 403 3300 Email: info.sbr@sugarbeachmauritius.com Website by 80 Days Resorts Sunlife Sugar Beach Long Beach La Pirogue Ambre Anahita Golf & Spa Resort Anahita Golf Ile aux Cerfs"
    },
    {
      "url": "https://www.barefootrestaurants.com/accessibility",
      "text": "Panama City, Florida Restaurant Accessibility | Barefoot Restaurants Skip to main content Live Entertainment at both locations every Thursday-Saturday, 4pm-7pm, through September! Explore Barefoot Restaurants, 170 Griffin Blvd, Panama City Beach Florida Call Order Online Close Home Locations Overview Barefoot Hide-A-Way Barefoot On The Beach Menus Event Calendar Beach Cams Barefoot Restaurants Barefoot Restaurants is the place for Sunshine and Good Times in Panama City Beach! Two great beachfront locations with craft cocktails, cold brew and comfort food: Barefoot Hide-A-Way and Barefoot On The Beach! Panama City Beach, FL 888-627-0625 barefootrestaurants@bythesearesorts.com Restaurants and Website Accessibility At By The Sea Resorts, we are dedicated to inclusivity, making our Panama City Beach restaurants welcoming to all. We provide restaurants and website accessibility features that prioritize the comfort and safety of every guest. Please feel free to look at our services and see how we can meet your needs. If you have questions, contact us at 888-627-0625 or via email at info@bythesearesorts.com . Restaurants Accessibility Restaurants Accessibility Features Fire alarms for the audio & visually impaired Accessible entrance without stairs Accessible doorways for all public spaces Accessible covered area for pickup and drop-off Accessible self-parking Accessible valet parking Accessible parking spots Van-accessible parking spots 20 Accessible parking spots All accessible parking spaces are closest to the restaurant entrance Non-slip entrance ramp Ramps have sturdy railings, accessible landings Service Animals Accepted Alternative and/or large lettering on public signage Accessible path to check-in Accessible path to guest rooms Accessible path for all public spaces Accessible elevator Accessible public bathroom Accessible path to maneuver in the fitness center Accessible desks in the business center Website Accessibility Accessibility Statement for Barefoot Restaurants Date: 8/22/2024 This is an accessibility statement from Barefoot Restaurants Measures to support accessibility Barefoot Restaurants takes the following measures to ensure accessibility of Barefoot Restaurants: Employ formal accessibility quality assurance methods. Conformance status The Web Content Accessibility Guidelines (WCAG) defines requirements for designers and developers to improve accessibility for people with disabilities. It defines three levels of conformance: Level A, Level AA, and Level AAA. Barefoot Restaurants is fully conformant with WCAG 2.2 Level AA. Fully conformant means that the content fully conforms to the accessibility standard without any exceptions. Feedback We welcome your feedback on the accessibility of Barefoot Restaurants. Please let us know if you encounter accessibility barriers on Barefoot Restaurants: Phone: 888-627-0625 Business Address: 170 Griffin Blvd, Panama City Beach, Florida 32413 Compatibility with browsers and assistive technology Barefoot Restaurants is designed to be compatible with the following assistive technologies: Firefox – view additional accessibility features here Chrome – view additional Google accessibility features here Internet Explorer – view additional ease of access options here Microsoft Edge – view additional accessibility features here Safari – view Apple accessibility features here Barefoot Restaurants is not compatible with: Older web browsers: Content may not function correctly on older versions of web browsers that lack support for modern web standards, HTML5 features, or CSS3 properties. Examples: Internet Explorer 6-8, and versions of Firefox, Safari, or Chrome no longer supported by the creators (typically up to two previous versions). Non-standard browser configurations: Uncommon browser configurations, such as highly customized settings, extensions, or experimental features, may conflict with certain web content or accessibility tools. Technical specifications Accessibility of Barefoot Restaurants relies on the following technologies to work with the particular combination of web browser and any assistive technologies or plugins installed on your computer: HTML CSS JavaScript These technologies are relied upon for conformance with the accessibility standards used. Limitations and alternatives Despite our best efforts to ensure accessibility of Barefoot Restaurants, there may be some limitations based on third party entities that are providing data into the site. Please contact us if you observe an issue. Assessment approach This website was assessed for accessibility by the following approaches: Self-evaluation at site launch External evaluation: a recurring automated check via API providing tests for WCAG 2.2 specifications. Ongoing testing was conducted on: 09/03/2025; 08/03/2025; 07/02/2025; 06/09/2025; 05/02/2025; 04/01/2025; 03/06/2025; 02/05/2025; 01/06/2025; 12/01/2024; 11/25/2024; 11/07/2024; 10/03/2024; 09/01/2024; 08/22/2024 Date This statement was created on 9 February 2024 using the W3C Accessibility Statement Generator Tool. Home Accessibility Barefoot Restaurants Barefoot Restaurants is the place for Sunshine and Good Times in Panama City Beach! Two great beachfront locations with craft cocktails, cold brew and comfort food: Barefoot Hide-A-Way and Barefoot On The Beach! Panama City Beach, FL 32413 barefootrestaurants@bythesearesorts.com Barefoot Hide-A-Way Barefoot Restaurants facebook link Barefoot Restaurants instagram link Barefoot On the Beach Barefoot Restaurants facebook link Barefoot Restaurants instagram link Join the experienced staff Sunshine, Good Times, And A Beachfront Career! View Jobs Get notifications Live Cams Barefoot Bucks Sign Up Accessibility Privacy Policy Sitemap © 2025 All rights reserved. Digital Presence Powered by Milestone Inc. © 2025 All rights reserved Barefoot Hide-A-Way Barefoot Restaurants facebook link Barefoot Restaurants instagram link Barefoot On the Beach Barefoot Restaurants facebook link Barefoot Restaurants instagram link Milestone Inc."
    },
    {
      "url": "https://inzmo.com/deu/en/contact",
      "text": "Contact INZMO: Get in Touch with Us Today! | INZMO English Products Products Hello and welcome! You've just entered a world where insurance isn't just a necessity; it's a path to financial freedom. We're INZMO, and we're more than just insurance. Mobile Phone Insurance From 1.99€ / month Rental Deposit Warranty From 3.25€ / month Bicycle insurance From 4.99€ / month Laptop/Tablet Insurance From 2.99€ / month E-scooter Insurance From 4.17€ / month About us For Partners Submit a claim Submit a claim Submit a claim We're here to help! Whether it's phone, email or chat, let us know what we can help you with today! We're here to help! Whether it's phone, email or chat, let us know what we can help you with today! Contact us As an INZMO customer, there are several easy ways to get in touch with us. We're here to help with any questions you might have! Email us: info@inzmo.com Give us a call: +49 30 31193091 (available 9-17 CET, Monday-Friday; except national holidays) Chat: use our chat option down in the corner of the page to find an answer even faster. Looking to partner with INZMO? Learn about easily offering embedded insurance to your customers. Connect with one of our experts today and get started! Talk with an expert Unleash the revolution - choose the wise alternative Get covered Your e-mail address Submit Subscribe for updates See what's new Get the app Inzmo About us Imprint Products Rental Deposit Warranty Mobile Phone Insurance Laptop/Tablet Insurance Bicycle Insurance E-scooter Insurance Get in touch Contact us Partner with us Careers Legal Terms of Use Privacy Policy Cookie Notice & Policy"
    },
    {
      "url": "https://www.barefootbaygolf.com/contactus/",
      "text": "Contact Us - Barefoot Bay Golf Course Skip to primary navigation Skip to main content Skip to primary sidebar Barefoot Bay Golf Course Barefoot Bay, FL Phone: 772-664-3174 Book Tee Times Home Tee Times About Us Current Rates Scorecard Memberships Lessons Course Photos Upcoming Events Tournaments Calendar Leagues Ladies Golf Association Men’s Golf Association The 19th Hole Golf Course Wildlife E-Club Contact Us Contact Us Barefoot Bay Golf Course 1225 Barefoot Blvd, Barefoot Bay, FL 32976 772-664-3174 PGA Golf Professional Bill Balash P: 772-663-0631 F: 772-663-0318 Email: bbalash@bbrd.org Primary Sidebar Course News Barefoot Bay Junior Golf Program will take place June 2nd through June 21st. Call 772-664-3174. Facebook Barefoot Bay Golf Course Copyright © 2025 Barefoot Bay Golf Course All Rights Reserved. Powered by"
    }
  ]
}