{
  "fuentes": [
    {
      "url": "https://barkstaphouse.com/",
      "email": "rianf@outlook.com"
    },
    {
      "url": "https://www.nrn.com/people/rock-brews-names-michael-sullivan-president-and-ceo",
      "email": "jonathan.maze@penton.com"
    },
    {
      "url": "https://www.leaderdog.org/bark-and-brew/",
      "email": "stephen.moran@leaderdog.org"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "anirudh.shetye@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "beatrice.malle@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "info.nairobi@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "jane@skanem.ke"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "njogu@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "olive.kunihira@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "sachen.gudka@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "sameer.gaikwad@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "shamila.mirza@skanem.com"
    },
    {
      "url": "https://finewineliquors.com/contact-us/",
      "email": "sales@finewineliquors.com"
    },
    {
      "url": "https://aymag.com/bark-bar-ownership/",
      "email": "114378-featured-75x75@1.5x.jpg"
    },
    {
      "url": "https://aymag.com/bark-bar-ownership/",
      "email": "114378-featured-75x75@2.5x.jpg"
    },
    {
      "url": "https://aymag.com/bark-bar-ownership/",
      "email": "114378-featured-75x75@2x.jpg"
    },
    {
      "url": "https://aymag.com/bark-bar-ownership/",
      "email": "114378-featured-75x75@3x.jpg"
    },
    {
      "url": "https://aymag.com/bark-bar-ownership/",
      "email": "114397-featured-75x75@1.5x.jpg"
    },
    {
      "url": "https://aymag.com/bark-bar-ownership/",
      "email": "114397-featured-75x75@2.5x.jpg"
    },
    {
      "url": "https://aymag.com/bark-bar-ownership/",
      "email": "114397-featured-75x75@2x.jpg"
    },
    {
      "url": "https://aymag.com/bark-bar-ownership/",
      "email": "114397-featured-75x75@3x.jpg"
    },
    {
      "url": "https://aymag.com/bark-bar-ownership/",
      "email": "114435-featured-75x75@1.5x.jpg"
    },
    {
      "url": "https://aymag.com/bark-bar-ownership/",
      "email": "114435-featured-75x75@2.5x.jpg"
    },
    {
      "url": "https://aymag.com/bark-bar-ownership/",
      "email": "114435-featured-75x75@2x.jpg"
    },
    {
      "url": "https://aymag.com/bark-bar-ownership/",
      "email": "114435-featured-75x75@3x.jpg"
    },
    {
      "url": "https://aymag.com/bark-bar-ownership/",
      "email": "114500-featured-75x75@1.5x.jpg"
    },
    {
      "url": "https://aymag.com/bark-bar-ownership/",
      "email": "114500-featured-75x75@2.5x.jpg"
    },
    {
      "url": "https://aymag.com/bark-bar-ownership/",
      "email": "114500-featured-75x75@2x.jpg"
    },
    {
      "url": "https://aymag.com/bark-bar-ownership/",
      "email": "114500-featured-75x75@3x.jpg"
    },
    {
      "url": "https://aymag.com/bark-bar-ownership/",
      "email": "114535-featured-75x75@1.5x.jpg"
    },
    {
      "url": "https://aymag.com/bark-bar-ownership/",
      "email": "114535-featured-75x75@2.5x.jpg"
    },
    {
      "url": "https://aymag.com/bark-bar-ownership/",
      "email": "114535-featured-75x75@2x.jpg"
    },
    {
      "url": "https://aymag.com/bark-bar-ownership/",
      "email": "114535-featured-75x75@3x.jpg"
    },
    {
      "url": "https://aymag.com/bark-bar-ownership/",
      "email": "114539-featured-75x75@1.5x.png"
    },
    {
      "url": "https://aymag.com/bark-bar-ownership/",
      "email": "114539-featured-75x75@2.5x.png"
    },
    {
      "url": "https://aymag.com/bark-bar-ownership/",
      "email": "114539-featured-75x75@2x.png"
    },
    {
      "url": "https://aymag.com/bark-bar-ownership/",
      "email": "114539-featured-75x75@3x.png"
    },
    {
      "url": "https://aymag.com/bark-bar-ownership/",
      "email": "114601-featured-75x75@1.5x.jpg"
    },
    {
      "url": "https://aymag.com/bark-bar-ownership/",
      "email": "114601-featured-75x75@2.5x.jpg"
    },
    {
      "url": "https://aymag.com/bark-bar-ownership/",
      "email": "114601-featured-75x75@2x.jpg"
    },
    {
      "url": "https://aymag.com/bark-bar-ownership/",
      "email": "114601-featured-75x75@3x.jpg"
    },
    {
      "url": "https://aymag.com/bark-bar-ownership/",
      "email": "114621-featured-75x75@1.5x.jpg"
    },
    {
      "url": "https://aymag.com/bark-bar-ownership/",
      "email": "114621-featured-75x75@2.5x.jpg"
    },
    {
      "url": "https://aymag.com/bark-bar-ownership/",
      "email": "114621-featured-75x75@2x.jpg"
    },
    {
      "url": "https://aymag.com/bark-bar-ownership/",
      "email": "114621-featured-75x75@3x.jpg"
    },
    {
      "url": "https://aymag.com/bark-bar-ownership/",
      "email": "hbaker@aymag.com"
    }
  ],
  "mails": [
    "114378-featured-75x75@1.5x.jpg",
    "114378-featured-75x75@2.5x.jpg",
    "114378-featured-75x75@2x.jpg",
    "114378-featured-75x75@3x.jpg",
    "114397-featured-75x75@1.5x.jpg",
    "114397-featured-75x75@2.5x.jpg",
    "114397-featured-75x75@2x.jpg",
    "114397-featured-75x75@3x.jpg",
    "114435-featured-75x75@1.5x.jpg",
    "114435-featured-75x75@2.5x.jpg",
    "114435-featured-75x75@2x.jpg",
    "114435-featured-75x75@3x.jpg",
    "114500-featured-75x75@1.5x.jpg",
    "114500-featured-75x75@2.5x.jpg",
    "114500-featured-75x75@2x.jpg",
    "114500-featured-75x75@3x.jpg",
    "114535-featured-75x75@1.5x.jpg",
    "114535-featured-75x75@2.5x.jpg",
    "114535-featured-75x75@2x.jpg",
    "114535-featured-75x75@3x.jpg",
    "114539-featured-75x75@1.5x.png",
    "114539-featured-75x75@2.5x.png",
    "114539-featured-75x75@2x.png",
    "114539-featured-75x75@3x.png",
    "114601-featured-75x75@1.5x.jpg",
    "114601-featured-75x75@2.5x.jpg",
    "114601-featured-75x75@2x.jpg",
    "114601-featured-75x75@3x.jpg",
    "114621-featured-75x75@1.5x.jpg",
    "114621-featured-75x75@2.5x.jpg",
    "114621-featured-75x75@2x.jpg",
    "114621-featured-75x75@3x.jpg",
    "anirudh.shetye@skanem.com",
    "beatrice.malle@skanem.com",
    "hbaker@aymag.com",
    "info.nairobi@skanem.com",
    "jane@skanem.ke",
    "jonathan.maze@penton.com",
    "njogu@skanem.com",
    "olive.kunihira@skanem.com",
    "rianf@outlook.com",
    "sachen.gudka@skanem.com",
    "sales@finewineliquors.com",
    "sameer.gaikwad@skanem.com",
    "shamila.mirza@skanem.com",
    "stephen.moran@leaderdog.org"
  ],
  "nombre_sitio": "barkstaphouse.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://barkstaphouse.com/",
      "text": "Barks and Brews Taphouse – Largo Florida Skip to content NOW OPEN!        ★       21+ Dog Bar!        ★       7000 sq ft Facility        ★      NOW OPEN!        ★      21+ Dog Bar!        ★       7000 sq ft Facility        ★ NOW OPEN!        ★       21+ Dog Bar!        ★       7000 sq ft Facility        ★      NOW OPEN!        ★      21+ Dog Bar!        ★       7000 sq ft Facility        ★ A 21+ Off-Leash Dog Park and Taphouse Toggle Navigation Home Membership and Rules Events Menu About Supporters FAQs Contact Registration / Account Toggle Navigation Home Membership and Rules Events Menu About Supporters FAQs Contact Registration / Account NOW OPEN ! Barks and Brews “Off-Leash” Dog Park and Taphouse REGISTER NOW >> LEARN MORE >> NOW OPEN ! Barks and Brews “Off-Leash” Dog Park and Taphouse REGISTER NOW >> LEARN MORE >> NOW OPEN ! Barks and Brews “Off-Leash” Dog Park and Taphouse REGISTER NOW >> LEARN MORE >> Barks and Brews Home kexworks 2025-01-14T16:30:45-05:00 Dog-Friendly Enjoy a unique experience where your dog can play off-leash in a safe, supervised space while you relax with great drinks and friendly people. Community Meet fellow dog lovers and become part of a welcoming community that values both fun and safety for pets and their owners. Quality Offerings Indulge in a diverse menu of craft beers, delicious wines and a selection of non-alcoholic beverages, ensuring a delightful visit for all tastes. Register your Pups Today! Get a jump on your Barks and Brews Membership! Register Now! dog-3 Registration dog-2 About Barks and Brews dog-5 Events dog-1 FAQs Tag us on Instagram! @barksandbrewstaphouse Off-Leash is Paw-some! Off-Leash is Paw-some! register now! Get in touch Location 14219 Walsingham Rd, Largo, FL 33774 Phone 727-248-0244 Hours Monday CLOSED Tuesday 5pm – 10pm Wednesday 5pm – 10pm Thursday 3pm – 10pm Friday 3pm – 12am Saturday 12pm – 12am Sunday 12pm – 8pm Pages Home Membership and Rules Events Menu About Supporters FAQs Contact Subscribe Now subscribe now Thank you for subscribing. × There was an error trying to send your message. Please try again later. × © Copyright 2025 | Barks and Brews Taphouse |   All Rights Reserved   | Website Design by KexWorks Page load link Before You Visit Please click the link below to register your pup before coming! Registration is required for all dogs. We require vet records showing proof of up to date rabies, distemper, and bordetella vaccinations. All pups 10 month and older must be sprayed/neutered. Sign Up! Before You Visit Please click the link below to register your pup before coming! Registration is required for all dogs. We require vet records showing proof of up to date rabies, distemper, and bordetella vaccinations. All pups 10 month and older must be sprayed/neutered. Sign Up! Product has been added to your cart. No products in the cart. 0 Items view cart X Go to Top"
    },
    {
      "url": "https://www.nrn.com/people/rock-brews-names-michael-sullivan-president-and-ceo",
      "text": "Rock & Brews names Michael Sullivan president and CEO Nation's Restaurant News is part of the Informa Connect Division of Informa PLC INFORMA PLC | ABOUT US | INVESTOR RELATIONS | TALENT This site is operated by a business or businesses owned by Informa PLC and all copyright resides with them. Informa PLC's registered office is 5 Howick Place, London SW1P 1WG. Registered in England and Wales. Number 8860726. About Us Subscribe Advertise Multimedia Subscribe Subscribe Operations Related Topics Marketing & Branding Labor Delivery & Takeout Solutions Equipment Food Safety Executives Recent in Operations See All Fast Casual Smashburger’s new CEO, Jim Sullivan, plots brand reinvigoration Smashburger’s new CEO, Jim Sullivan, plots brand reinvigoration by Bret Thorn Sep 9, 2025 3 Min Read Family Dining Cracker Barrel suspends store remodel program amid continued brand backlash Cracker Barrel suspends store remodel program amid continued brand backlash by Joanna Fantozzi Sep 9, 2025 1 Min Read Technology Related Topics Automation Delivery Loyalty AI in Restaurants Recent in Technology See All Sponsored Content Serving Success: How Tommy Bahama is Driving Retention, Flexibility, and Performance Serving Success: How Tommy Bahama is Driving Retention, Flexibility, and Performance Sep 17, 2025 2:00 pm EDT Insights New FSTEC Technology Guide helps restaurants navigate complex tech landscape New FSTEC Technology Guide helps restaurants navigate complex tech landscape by NRN staff Sep 8, 2025 2 Min Read Segments Related Topics Fast Casual Casual Dining Fine Dining Independent Restaurants Emerging Chains Regional Chains Quick Service Eatertainment Family Dining Recent in Segments See All Fast Casual Smashburger’s new CEO, Jim Sullivan, plots brand reinvigoration Smashburger’s new CEO, Jim Sullivan, plots brand reinvigoration by Bret Thorn Sep 9, 2025 3 Min Read Quick Service Trending this week: McDonald’s splits with National Restaurant Association over tip policy See which stories readers couldn't get enough of Trending this week: McDonald’s splits with National Restaurant Association over tip policy See which stories readers couldn't get enough of by NRN staff Sep 9, 2025 10 Slides Finance Related Topics Mergers & Acquisitions Franchising Recent in Finance See All Eatertainment Pinstripes Holdings files for Chapter 11 Pinstripes Holdings files for Chapter 11 by Ron Ruggless Sep 9, 2025 1 Min Read Casual Dining TGI Fridays accelerates development plans in Peru and Japan TGI Fridays accelerates development plans in Peru and Japan by Ron Ruggless Sep 8, 2025 2 Min Read Menu Trends Related Topics Food Trends Beverage Trends Chef Trends Sandwich Trends MenuMasters Spotlight Recent in Menu Trends See All Sponsored Content Getting Saucy: How Cheese Sauce and Other Sauces are Trending on Menus Getting Saucy: How Cheese Sauce and Other Sauces are Trending on Menus Sep 10, 2025 2:00 pm EDT Fast Casual Smashburger’s new CEO, Jim Sullivan, plots brand reinvigoration Smashburger’s new CEO, Jim Sullivan, plots brand reinvigoration by Bret Thorn Sep 9, 2025 3 Min Read Insights Related Topics Restaurant Experience Expert Opinions Top 500 Restaurants Supplier News Recent in Insights See All Family Dining Cracker Barrel suspends store remodel program amid continued brand backlash Cracker Barrel suspends store remodel program amid continued brand backlash by Joanna Fantozzi Sep 9, 2025 1 Min Read Insights New FSTEC Technology Guide helps restaurants navigate complex tech landscape New FSTEC Technology Guide helps restaurants navigate complex tech landscape by NRN staff Sep 8, 2025 2 Min Read Multimedia Resources Related Topics 2025 FSTEC Restaurant Tech Guide Event Insider: FSTEC 2025 Restaurant Show Recap Event Insider: Restaurant Show Event Recap: RLC Sustainability Outlook 2025 Event Insider: CREATE Event Recap: CREATE 2025 Technology Outlook Report 2025 Data Insights Report Sponsored By Executives Segments Casual Dining Operations Rock & Brews names Michael Sullivan president and CEO Rock & Brews names Michael Sullivan president and CEO Rock & Brews names Michael Sullivan president and CEO Former Buffalo Wild Wings executive and industry veteran to lead chain’s expansion Jonathan Maze , Editor in Chief , Restaurant Business January 24, 2017 2 Min Read Rock & Brews, the restaurant and entertainment concept co-founded by members of the rock band KISS, has named Michael Sullivan president and CEO, the company said Tuesday. Sullivan, a 25-year industry veteran, will be tasked with continuing the 19-unit chain’s expansion. Rock & Brews president and CEO Michael Sullivan Photo: Rock & Brews “Sully’s experience as a multi-brand franchisee and restaurant owner and partner, combined with his success as part of the team responsible for the meteoric growth at Buffalo Wild Wings, made him a natural choice to spearhead the next phase of Rock & Brews’ expansion,” said Michael Zislis, Rock & Brews managing partner and co-founder, in a statement. Rock & Brews named Mike Reynolds CEO in 2014, but he left to become chief development officer at Mrs. Winner’s Chicken & Biscuits last April. Zislis had been acting as interim CEO since Reynolds’ departure. Sullivan has been in the restaurant business for more than 25 years, starting when he bussed tables at Aurelios Pizza at 15 years old, and continuing to when he was 22 years old and bought his first Subway location. In 2003, he went to work for Buffalo Wild Wings and helped the chain grow from 150 locations to more than 1,200 units. In 2012, he was named emerging brands director, and was tasked with acquiring concepts and integrating them into the company. Sullivan met Rock & Brews principals at an industry conference, and then visited several locations. “I was so impressed with the brand, the passion of its founding partners and its potential that I not only accepted the role of president and CEO, I personally invested in the brand,” Sullivan said in a statement. “Rock & Brews is a dynamic, one-of-a-kind experience. It’s simply cool, and I look forward to being part of its growth.” Zislis said: “He is well versed in all aspects of franchise operations and restaurant expansion. He has a keen eye for identifying top-notch, multi-unit franchisees, and we have confidence that his leadership will play an important role as Rock & Brews continues its strategic expansion and diversification.” KISS co-founders Paul Stanley and Gene Simmons, along with Zislis and concert industry veterans Dave Furano and Dell Furano, opened Rock & Brews in El Segundo, Calif., in 2012. The first location booked $10 million in sales a year. The chain has a rock-and-roll, family-friendly theme with locations in the U.S. and Mexico. Contact Jonathan Maze at [email protected] Follow him on Twitter: @jonathanmaze About the Author Jonathan Maze Editor in Chief, Restaurant Business See more from Jonathan Maze Subscribe Nation's Restaurant News Newsletters Get the latest breaking news in the industry, analysis, research, recipes, consumer trends, the latest products and more. Sign Up Now You May Also Like Insights Content Spotlight New FSTEC Technology Guide helps restaurants navigate complex tech landscape The FSTEC Restaurant Technology Guide is a free digital resource for operators Read More Featured Quick Service Dirty soda chain Fiiz Drinks looks to capitalize on beverage’s booming popularity Dirty soda chain Fiiz Drinks looks to capitalize on beverage’s booming popularity Sep 3, 2025 Casual Dining 7 take-aways from exclusive interview with Darden Restaurants CEO Rick Cardenas 7 take-aways from exclusive interview with Darden Restaurants CEO Rick Cardenas Aug 26, 2025 Sponsored Content Content Spotlight Enhance Your Loyalty Program: How Leading Restaurants Drive Revenue Through Loyalty Campaigns Read More Explore About Nation's Restaurant News Subscribe to NRN Company News Contact Us Partner With Us Our Capabilities Media Kit Conferences & Events Ad Specifications Our Brands CSP FoodService Director Nation’s Restaurant News Restaurant Business Restaurant Hospitality Technomic Join Us Subscribe Follow Us Copyright © 2025 Informa Connect Limited. Registered in England & Wales with number 01835199, registered office 5 Howick Place, London, SW1P 1WG. Website TOU | Code of conduct events | Group privacy policy | CCPA | Cookie Policy"
    },
    {
      "url": "https://www.leaderdog.org/bark-and-brew/",
      "text": "Bark & Brew - Leader Dogs for the Blind Skip to content menu Apply Orientation & Mobility Guide Dog Teen Orientation and Mobility Teen Summer Camp Donate Give Once Give Monthly Sponsor A Puppy Contact Us Search MENU Home About Meet Leader Dog Who We Are The Leader Dog Difference Leadership Team Board Members Financial Reports The Leader Dogs for the Blind Foundation Careers Our Impact Campus Facilities and Grounds Polk Residence & Training Center Canine Development Center Downtown Training Center Tours Visiting Service Dogs Events Newsletters Media Client Programs Orientation & Mobility Guide Dog Teen Orientation and Mobility Teen Summer Camp Current Clients & Graduates Volunteer Raise A Puppy Volunteer On Campus Host A Breeding Dog Ways To Give Giving Options Plan My Gift Wills and Living Trusts Donor-Advised Funds Foundation Giving Fundraise Corporate Sponsors Lions Clubs Lions and Leader Dog History Lions Club Resources Resources Be an Ambassador People Who Are Blind Professionals in Blindness Request a Speaker Virtual Learning Collaboration Events Taking the Lead Podcast Alumni Board Home » Bark & Brew Bark & Brew 5K Presented by Chief Financial Credit Union Sunday, June 8, 2025 Join us for the Bark & Brew 5K, proudly presented by Chief Financial Credit Union! Celebrate the start of summer with a scenic walk/run through the heart of Downtown Rochester, MI. All proceeds from this event support Leader Dog’s free programs and services for individuals who are blind or low vision. Don’t miss out on this exciting event – register today! The race begins at 9 a.m. Race participants receive a race t-shirt, large medal, race bib and a coupon for a free, age-appropriate beverage and food item at the post-race party. New in 2025! V.I.PAW – As a VIP, you will receive a 2025 branded Bark & Brew 5K pint glass, dog bandana, along with your race bib, shirt, medal and post-race beverage/food item. This category is capped at 500 registrants, so don't wait to register! New Course – The 2025 5K course will guide runners through Downtown Rochester, leading into Rochester Municipal Park along Paint Creek. Participants will then transition onto the Paint Creek Trail, passing the Rochester Library and crossing University Drive before reaching the finish line near the Rochester Mills Beer Company. Post-Race Party – After the race, celebrate your achievement with a complimentary beverage from Rochester Mills Beer Company and a slice of pizza, or opt for a Starbucks coffee and a Knapp's donut. No matter your choice, enjoy the moment while soaking in the amazing sounds of local musicians. After completing your race, head over to the Bark & Brew event site at Rochester Mills Beer Company to redeem your free beverage coupon! Have your non-running friends and family join you at the Bark & Brew event and continue the fun throughout the morning. Register Now Additional event details can be found on the Bark and Brew 2025 FAQ page . For event info and to sponsor Bark & Brew, contact: Email: Stephen Moran Special Events Manager Phone: 248-659-5046 Interested in becoming a sponsor for Bark and Brew? View the Leader Dog single event sponsorship form . Thank you to our sponsors Presenting Sponsor Host Location Elite Sponsor Champion Sponsor Advocate Sponsor Partner Sponsor Supporter Sponsor Light Up Leader Dog November 25, 2024 Frozen Paw 5K January 19, 2025 Dinner in the Dark February 21, 2025 Bark & Brew 5K June 8, 2025 facebook instagram linkedin youtube Donate Fundraise Footer Menu Blog Podcast FAQs Tours Shop Events Careers Adopt A Dog Contact Us Website Accessibility Statement © 2025 Leader Dogs for the Blind – 1039 S. Rochester Rd. Rochester Hills, MI 48307 | 248-651-9011"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "text": "Contact Skanem | Reach Out to Our Labelling Experts Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message We proudly present Skanem Nairobi Skanem Nairobi Sachen Gudka Managing Director +254 733 410 309 Send email Skanem Nairobi Sachen Gudka Managing Director +254 733 410 309 Send email Skanem Nairobi Anirudh Shetye Head of Sales & Marketing +254 735 052 700 Send email Skanem Nairobi Anirudh Shetye Head of Sales & Marketing +254 735 052 700 Send email Skanem Nairobi Joyce Njogu Key Account Manager +254 722 804 269 Send email Skanem Nairobi Joyce Njogu Key Account Manager +254 722 804 269 Send email We proudly present Skanem Uganda Skanem Uganda Olive Kunihira Head of Sales +256 759 589 711 Send email Skanem Uganda Olive Kunihira Head of Sales +256 759 589 711 Send email We proudly present Skanem Tanzania Skanem Tanzania Sameer Gaikwad Site Manager +255 757 803 737 Send email Skanem Tanzania Sameer Gaikwad Site Manager +255 757 803 737 Send email Skanem Tanzania Beatrice Malle Key Account Manager +255 712 110 922 Send email Skanem Tanzania Beatrice Malle Key Account Manager +255 712 110 922 Send email Skanem Tanzania Shamila Mirza Key Account Manager +255 717 477 047 Send email Skanem Tanzania Shamila Mirza Key Account Manager +255 717 477 047 Send email Locations Locations Locations How to reach us How to reach us How to reach us How to reach us Skanem Interlabels Nairobi Limited East Africa Headquarters East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa +254 202 471001 info.nairobi@skanem.com Skanem Interlabels Uganda Limited Namanve Industrial Park Mukono Uganda Africa +256 759 589711 olive.kunihira@skanem.com Skanem Tanzania Limited Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa +255 757 803737 sameer.gaikwad@skanem.com Contact us Send us a message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Products Sustainability menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy Products menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy"
    },
    {
      "url": "https://finewineliquors.com/contact-us/",
      "text": "Contact us Fine Wine Liquors Shop By Department Wine Red wine Menu Shiraz Cabernet Sauvignon Pinot Noir Red Blends Other Red Varietals Rosé Cabernet Merlot Shiraz Cabernet Merlot Grenache Tempranillo Sangiovese Nebbiolo Bordeaux Barossa Valley white Wine Menu Chardonnay Riesling Sauvignon blanc Pinot gris grigio Other white varietals White blends Dessert white Popular Regions Menu Bordeaux Barossa Valley Mclaren Vale Coonawarra Margaret River Burgundy Clare Valley Fortified Wine Menu Port Tawny Sherry Apera Vermouth Muscat Mead Tokay Topaque Popular Brands Menu Penfolds Under Wraps Wynns Wendouree Wolf Blass Tyrrell’s Top Selling Macallan 15 Year Old Double Cask $ 165.00 Availability: In Stock Glenfiddich Project XX $ 61.00 Availability: In Stock Glendronach 15 Year Old Revival $ 86.25 Availability: In Stock Beer Discover Beer Menu Craft Beer International Beer Australian Beer Mid Strength Light Beer Low Carb Beer Alcoholic Ginger Beer Home Brew Stout Pilsner Wheat Beer Dark Beer Golden Ale Porter Categories Menu Kegs Cider Craft Beer Domestic Beer Hard Seltzers Import Beer Non-Alcoholic Beer Popular Brands Menu 4 Pines Balter Coopers Little Creatures Stone & Wood Zytho New & Trending Menu New Arrivals Top Rated Craft Beer Light Low Pool Packs Cool Off Craft Beer The Lemonade Stand Country Menu Australia Sweden New Zealand France Spain From to Ready to Drink Organic Wine $69.99 Whiskey Discover whiskey Menu Scotch Whisky American Whiskey Japanese Whisky Australian Whisky Irish Whiskey Canadian Whisky Indian Whisky Discover Vodka Menu Absolut Smirnoff Hunter Distillery Stolichnaya Royal Dragon Crystal Head Poliakov Popular Brands Menu Johnnie Walker Jack Daniel’s Glenfiddich Highland Park Glen Moray Stone & Wood Fortified Wine Menu Whiskey Of The Month Flavored Whiskey Blended Scotch Rye Whiskey Single Malt Scotch Small Batch Bourbon Hot deals of summer Fresh Beer Save up $49.99 Jameson Whiskey Father’s Day Sale 40% off Sitewide! Cogac Cocktail Tequila What’s New New Gift & Accessories Best Sellers Sales & Offers -20% Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Menu Sign In or Register 0 0 $ 0.00 Contact us Home Page Contact us Don’t  hesitate to contact us \nif you need help. Whether you have a question about your order, need assistance with a product, or just want to reach out, you’re in the right place. Feel free to contact us using the details below, and we’ll get back to you as quickly as possible! Address 8560 S Cottage Grove Ave, Chicago, IL 60619, United States Call Us (630) 354-9222 Openning Monday – Friday: 8am – 10pm Saturday – Sunday: 9am – 5pm Contact sales@finewineliquors.com finewineliquorsinfo@gmail.com Got Any Questions? Use the form below to get in touch with the sales team Message Send your message Δ Search Account Cart Same-day local delivery Ground shipping directly to you Free in-store pickup 24/7 customer support Customer Service Menu Help Center My account Track my order Return policy About Us Menu Company info Press Releases Careers Reviews Investor relations Quick Links Menu Search Become a reseller Contact us Terms of service Categories Menu Brandy White Wine Champagne Vodka Tequila Get exclusive offers & rewards Sign up for our members portal to receive some exclusive offer & rewards. It’s easy and free! sign up Leave this field empty if you're human: stay connect Facebook-f Twitter Instagram Pinterest we accept Careers About Us Affiliates Privacy Settings Help Site map Copyright ©  2022 Liquory . All rights reserved. Sign in Create an Account Username or email * Password * Login Lost your password? Main menu Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Home About Us Account Blog Careers Cart Checkout Contact us Legal Notice My account Order Tracking Privacy Policy Refund and Returns Policy Reviews Sample Page Shipping Shop Terms & Conditions Track Wishlist Search for: Search All category All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell’s Black Lebel Blanton’s Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester’s Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell's Black Lebel Blanton's Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester's Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine Hide similarities Highlight differences Select the fields to be shown. Others will be hidden. Drag and drop to rearrange the order. Image SKU Rating Price Stock Availability Add to cart Description Content Weight Dimensions Additional information Click outside to hide the comparison bar Compare Top Shopping cart close ×"
    },
    {
      "url": "https://aymag.com/bark-bar-ownership/",
      "text": "Bark Bar Now Under New Ownership Art & Entertainment Museums Music Shopping Sports Weekend Events Food & Drink Cocktail Recipes Bucket Lists Face Behind the Place Recipes Restaurants Server Says Health Health Care Mental Health Guide Arkansas Mental Health Guide Archive Home/Garden Design & Bloom Featured Homes Home Resources Interior Design(ers) Murder Mystery People Ask an Expert Faces of Arkansas Get to Know AY's Best Heather's Favorite Things Local Luminary People Behind Your News Travel Arkansas Backstories Places to Stay Spring Travel Guide Travel Guide Contests & Nominations Nominate AY's Best Women in Health Care 2025 Nominate Arkansas Insurance Agents Nominate AY's Intriguing Women More Sponsored Posts Submit Event / Press Release / Info Subscribe to AY Print Magazine Subscribe to AY's newsletter Where to find AY About Us Custom Publications Digital Issues Archive Arkansas Mental Health Guide Archive Intriguing Women 2024 Men of Distinction 2024 Intriguing Women 2023 Men of Distinction 2023 Intriguing Women 2022 Men of Distinction 2022 Intriguing Women 2021 Men Of Distinction 2021 Intriguing Women 2020 Intriguing Women 2019 Intriguing Women 2018 Bark Bar Now Under New Ownership Posted by AY Staff | Sep 15, 2023 | Latest News from AY , People | 0 | After six successful years of serving as the heart of the “Barkansas” dog-loving community, the award-winning Bark Bar has been officially sold to William Doxey, a dynamic entrepreneur known for Puppy Community, regularly seen at Little Rock-area farmers’ markets. The transaction, completed by the previous owners and co-founders, Elizabeth Michael and Daniel Roda, marks an exciting new chapter for the beloved canine haven. Michael and Roda have announced this transfer of ownership as they look to focus on their other business ventures and growing family. Elizabeth Michael – Photo by Jamison Mosley Michael is the owner of Marian , a marketing consultancy firm specializing in social media marketing, public relations, and marketing automation. She has won numerous industry awards and is a member of the prestigious Meta Leader’s Network. She’s also a partner in the cannabis ad agency, Bud Agency , and contributes her expertise as the part-time executive director of the nonprofit organization SoMa Little Rock, Inc . Roda is an entrepreneur, attorney and real estate developer, having been part of the development team on large-scale historic rehabilitation projects including the AC Hotel by Marriott Little Rock and the Home2 Suites by Hilton St. Louis. In November of 2022, Roda successfully sold the financial technology company he co-founded, Abaca, to Safe Harbor Financial , where he now serves as the executive vice president and chief operating officer. A few weeks later, the Michael-Roda family welcomed their first child, Paul Michael Roda. “I’m incredibly proud of the journey Bark Bar has undertaken over the past six years,” Elizabeth Michael shared. “However, with our current workload and growing family, the time felt right to entrust Bark Bar to capable hands. William’s energy and vision, along with Allie Lindley’s leadership as the general manager, assures me that Bark Bar will continue to be ‘pawesome.’” William Doxey – Photo by Bernice Garden William Doxey, previously in technology product management, has more recently become the proprietor of the beloved local brand Puppy Community, a pop-up and online dog gear and treat retailer. Acquiring Bark Bar presents an exciting opportunity for Doxey, enabling him to establish a retail brick-and-mortar presence and further expand his brand. “I’m eager to build upon the fantastic foundation that the Bark Bar established,” said Doxey. “I’m thrilled to collaborate with Allie and the dedicated staff, as well as engage with the vibrant Bark Bar regulars (and their humans). Our collective efforts will bring new dimensions to this cherished establishment, including expanding the kitchen, upgrading the outdoor play yard and giving the interior space a fresh makeover.” Under the new ownership, Bark Bar is set to embark on a journey of growth and enhancement, continuing its reputation as a community hub for dogs and their people. Greg Henderson of Rock City Commercial represented the buyer and sellers in this transaction. READ ALSO: Live Music Lineup: Sept. 14 – Sept. 17 Share: Rate: Previous Top Weekend Events: Sept. 14 – Sept. 17 Next Get a Free Chicken Biscuit From Chick-fil-A Next Week! About The Author AY Staff Related Posts Top Weekend Events: Total Solar Eclipse Weekend April 4, 2024 Live Music Lineup: March 2 – March 5 March 2, 2023 Bonjour! Visiting The Croissanterie for the Burger Bucket List May 27, 2022 Meet Joan: A Local Pop Nostalgia Band Gaining National Attention April 17, 2023 Search Search for: Digital Issue https://youtu.be/W5Zsf-UwqWw Trending Pitcher in Banana Ball League Talks Growing up in Arkansas posted on September 1, 2025 Cousins Maine Lobster Rolling Through Central Arkansas Once Again! posted on September 8, 2025 The Attic Bar Offers Comfortable New Venue in Little Rock posted on September 4, 2025 Allan’s Microwaved Catfish & Boiled Okra — It’s a Joke, Right? posted on September 3, 2025 52 Things To Do In Eureka Springs posted on August 30, 2025 Food Bites: The Slushy Factory, Loca Luna & More posted on September 3, 2025 Cornhole Golf Course in Conway Brings Fun and Holes in One posted on August 29, 2025 Wheelin’ & Healin’: Jacksonville Car Show Rolls In to Support Animal Shelter posted on September 5, 2025 Recent Posts Get Loud, Messy & Fed at Hot Springs’ Beats & Beans Weekend! Sep 9, 2025 | Art & Entertainment , Latest News from AY , Music Eden’s Flower Truck and Botanicals Brings Beautiful Bouquets and More to NWA Sep 9, 2025 | Design & Bloom , Home & Garden , Latest News from AY , Sponsored Get Ready for the Ultimate Tailgate in Argenta This Weekend Sep 9, 2025 | Art & Entertainment , Latest News from AY , Out & About Cousins Maine Lobster Rolling Through Central Arkansas Once Again! Sep 8, 2025 | Food , Latest News from AY , Restaurants First-Ever Hot Springs Women’s Health Expo Seeks to Educate, Create Sisterhood Sep 8, 2025 | Education , Health , Health Care , Latest News from AY , Sponsored DeLuca’s Heads to Dave Portnoy’s Pizza Festival in NYC Once Again! Sep 8, 2025 | Food , Latest News from AY , Restaurants Opa! International Greek Food Festival Returns to Little Rock! Sep 8, 2025 | Art & Entertainment , Food , Latest News from AY , Out & About Arkansas Poet Carolyn Guinzio Wins 2025 Porter Fund Literary Prize Sep 5, 2025 | Education , Latest News from AY , People Wheelin’ & Healin’: Jacksonville Car Show Rolls In to Support Animal Shelter Sep 5, 2025 | Art & Entertainment , Latest News from AY , Out & About Nearly Half a Century Later, Arkansas Police Confirm Identity of Remains Found in Lee County Sep 5, 2025 | Latest News from AY , Murder Mystery Get AY Magazine Subscribe Now Newsletter Sign Up  AY Media Group (AYMG) 910 W. 2nd St., Ste. 200 Little Rock, Arkansas 72201  For advertising information, email Heather Baker hbaker@aymag.com  Phone Number 501-244-9700 Follow Follow Follow Follow Follow Subscribe About Us Careers Copyright © 2023 AY Magazine. All rights reserved."
    }
  ]
}