{
  "fuentes": [
    {
      "url": "https://www.monkless.com/contact-us",
      "email": "sales@monkless.com"
    },
    {
      "url": "https://craftbeerlocations.com/beerspot/barrel-of-monks-brewing-brewery-in-boca-raton-florida/",
      "email": "help@craftbeerlocations.com"
    }
  ],
  "mails": [
    "help@craftbeerlocations.com",
    "sales@monkless.com"
  ],
  "nombre_sitio": "barrelofmonks.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.monkless.com/contact-us",
      "text": "Contact Monkless Belgian Ales | Inquiries & Donations Skip to Content Open Menu Close Menu Visit The Brasserie The Abbey Private Events Our Bier Core Bier Seasonal Bier Distribution Partners Kegs-to-go About Order Online Brasserie Food Beer to Go Merchandise Gift Cards Contact Us Donations & Events General Inquiries 0 0 Visit The Brasserie The Abbey Private Events Our Bier Core Bier Seasonal Bier Distribution Partners Kegs-to-go About Order Online Brasserie Food Beer to Go Merchandise Gift Cards Contact Us Donations & Events General Inquiries 0 0 Open Menu Close Menu Folder: Visit Back The Brasserie The Abbey Private Events Folder: Our Bier Back Core Bier Seasonal Bier Distribution Partners Kegs-to-go About Folder: Order Online Back Brasserie Food Beer to Go Merchandise Gift Cards Folder: Contact Us Back Donations & Events General Inquiries contact us Monks May Take a Vow of Silence–But We Don’t! Got a question, a brilliant beer idea, or just want to say hello? We’re here to chat, listen, and raise a glass with you. General Inquiries Our system has encountered an error.  This exception has been automatically logged and reported. A6P9YPXZSW2R62GJX39J Donations & Events For donations and event inquires, please use the designated forms. Requests via the general inquiry form may not receive a response. Donations & sponsorships must be submitted at least 45 days before the event. Due to the high volume of requests, we cannot accomodate all causes. If we can fulfill your request, we will contact you at the provided email. Thank you for your understanding! Donation Request Donation Request Organization Name * Contact Person * First Name Last Name Email * Phone * (###) ### #### Website *if applicable http:// Is your organization a 501(c)(3) registered nonprofit? * YES NO Tax ID Number (EIN) *Required if answered yes to previous question Event/Initiative Name * Date of Event * MM DD YYYY Location of Event * Expected Attendance * Brief Description of the Event and Its Purpose * Type of Donation * Beer Donation Gift Card Merchandise Sponsorship Sponsored Location/Facility Rental Other (please specify) Will our brand be featured in event promotions? * YES NO How will Monkless Belgian Ales be recognized? * *e.g., social media shoutout, logo placement, verbal recognition Do you need a logo for promotion? * YES NO If yes, select your logo orientation Horizontal logo orientation Vertical logo orientation Have we supported your organization in the past? * Yes No Any additional comments or details? Thank you for reaching out! We’ve received your request and will get back to you as soon as possible. We appreciate your patience! Event Inquiries Event Inquiries Name * First Name Last Name Email * Phone * (###) ### #### Organization *if applicable Event Name * Preferred Date * MM DD YYYY Alternative Date(s) MM DD YYYY Start Time * Hour Minute Second AM PM End Time * Hour Minute Second AM PM Estimated Guest Count * Type of Event * E.g. Corporate Gathering, Birthday Party, Wedding Reception Budget * $ Special Requests or Accommodations Venue Preference * Please select your preferred location The Brasserie (Our full-service restaurant with stunning river views, ideal for dining-focused events) The Abbey (Our intimate and cozy taproom, perfect for casual gatherings, happy hours & strolling events) Either Location Could Work! Additional Information * Please tell us a little bit about the event and what you are looking for (fully private/semi-private dinner/dancing/lecture etc.)? Thank you for reaching out! We’ve received your request and will get back to you as soon as possible. We appreciate your patience! INFO ABOUT OUR BIER PRIVATE EVENTS CONTACT US THE BRASSERIE 803 SW Industrial Way Bend, Oregon 97702 Phone: (541) 797-6760 THE ABBEY 900 SE Wilson Avenue Bend, Oregon 97702 sales@monkless.com © 2025 Monkless Belgian Ales"
    },
    {
      "url": "https://craftbeerlocations.com/beerspot/barrel-of-monks-brewing-brewery-in-boca-raton-florida/",
      "text": "Find Craft Beers at Barrel of Monks Brewing Brewery in Boca Raton Florida Near You - Craft Beer Locations Near You Skip to content Craft Beer Locations Near You Home Locations USA Alabama Arizona Arkansas California Colorado Connecticut Delaware District of Columbia Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi New Hampshire New Mexico New Jersey New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Virginia West Virginia Washington Wisconsin Wyoming UK Submit Your Spot! Blog My Account Contact 0 MAP SEARCH Barrel of Monks Brewing Brewery in Boca Raton Florida Brewery, Beer garden, Beer store, Event venue, Restaurant ( 489 reviews ) ADDRESS & CONTACT Address 1141 S Rogers Cir #5, Boca Raton, FL 33487 GPS 26.4037802, -80.109878 Telephone +1 561-510-1253 Web http://barrelofmonks.com/ Plan My Route OPENING HOURS Monday 4-10PM Tuesday 4-10PM Wednesday 4-10PM Thursday 4-10PM Friday 4-11PM Saturday 12-11PM Sunday 12-7PM CLAIM LISTING Is info on this listing outdated? Are you owner of this business? Register and claim it now. This location is pending verification. If you are the owner reach out to help@craftbeerlocations.com Discover Barrel Of Monks Brewing: Your Local Brewery in Boca Raton, Florida Looking for a great place to enjoy craft beer near you? Welcome to Barrel Of Monks Brewing, your go-to brewery in Boca Raton, Florida. As a premier destination for craft beer lovers, we offer a wide variety of unique and flavorful brews, brewed with passion and precision. Whether you’re a beer connoisseur or new to the world of craft beer, we have something for everyone. Located at Boca Raton, FL 33432, None, , 33432, our brewery is easily accessible for residents of Boca Raton and surrounding areas. Stop by and discover why Barrel Of Monks Brewing has become a favorite spot for craft beer enthusiasts in United States of America. With a focus on Brewery and Brewery, we’re dedicated to offering a diverse selection that highlights local flavors and craftsmanship. Our friendly and knowledgeable team is ready to guide you through our extensive range of beers, helping you find the perfect brew to match your tastes. At Barrel Of Monks Brewing, we pride ourselves on exceptional customer service, expert recommendations, and a commitment to quality that sets us apart from the rest. Whether you’re enjoying a cold pint with friends or exploring new beer styles, our brewery provides the perfect setting for any occasion. Get in touch with us today at  to learn more about our offerings or plan your visit. From Brewery to , Barrel Of Monks Brewing has it all! Make us your go-to brewery for craft beer near you, and experience the best of what we have to offer. Don’t wait—explore our selection of craft beer near you and start your next beer adventure with Barrel Of Monks Brewing! Check out Barrel Of Monks Brewing’s reviews online to see why locals love us. Plan your visit to Barrel Of Monks Brewing and taste the best brews in Boca Raton today! Related FEATURES & SERVICES Price Range $$ Credit Cards Reservation LOCATION ON MAP Plan My Route CONTACT OWNER NEW SEARCH Share this: Click to share on Facebook (Opens in new window) Facebook Click to share on X (Opens in new window) X Click to email a link to a friend (Opens in new window) Email Click to share on Reddit (Opens in new window) Reddit Click to share on Threads (Opens in new window) Threads Click to share on Nextdoor (Opens in new window) Nextdoor Related Leave a review Cancel reply Your email address will not be published. Required fields are marked * Your rating * Select your rating, please. Your review Your reply to review * Name * Email * Save my name, email, and website in this browser for the next time I comment. Δ Fill all required fields, please. Use valid email address, please. Craft Beer News Craft Beer News Beer Under Glass 2025: An Evening Beneath the Skyline Our Best Beers of 2024 Our Best Beer Experiences of 2024 FoBAB 2024 Reflections FoBAB 2024 Reflections Recoil Brewing Company Brewery in Skipton Address Unit 4, Snaygill Industrial Estate, Skipton BD23 2QR Lamb Brewing Company Brewery in Skipton Address Queen's Arms, Litton, Skipton BD23 5QJ Haworth Steam Brewing Co restaurants in Keighley Address 98 Main St, Haworth, Keighley BD22 8DP Copper Dragon Brewery in Keighley Address Lee Mills, St Paul's Rd, Keighley BD21 4QW Timothy Taylor's Brewery Brewery in Keighley Address Knowle Spring Brewery, Queen's Rd, Keighley BD21 1AW Copperdragon Brewery Brewery in Skipton Address Unit 4, Snaygill Industrial Estate, Skipton BD23 2QR 1 2 3 … 1,790 Next » Get Social with Us Facebook X Instagram Home Submit Listing Blog Contact CRAFT BEER LOCATIONS | ALL RIGHT RESERVED Terms and Conditions - Privacy Policy"
    }
  ]
}