{
  "fuentes": [
    {
      "url": "https://skanemafrica.com/contact",
      "email": "anirudh.shetye@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "beatrice.malle@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "info.nairobi@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "jane@skanem.ke"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "njogu@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "olive.kunihira@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "sachen.gudka@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "sameer.gaikwad@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "shamila.mirza@skanem.com"
    },
    {
      "url": "https://www.partyslate.com/venues/barsecco",
      "email": "contact@partyslate.com"
    },
    {
      "url": "https://www.delish.com/entertaining/wine/g32870025/best-prosecco-brands/",
      "email": "info@delish.com"
    },
    {
      "url": "https://finewineliquors.com/contact-us/",
      "email": "sales@finewineliquors.com"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "https://inzmo.com/deu/en/contact",
      "email": "info@inzmo.com"
    }
  ],
  "mails": [
    "anirudh.shetye@skanem.com",
    "beatrice.malle@skanem.com",
    "contact@partyslate.com",
    "info.nairobi@skanem.com",
    "info@delish.com",
    "info@inzmo.com",
    "info@reception-plus.de",
    "jane@skanem.ke",
    "njogu@skanem.com",
    "olive.kunihira@skanem.com",
    "sachen.gudka@skanem.com",
    "sales@finewineliquors.com",
    "sameer.gaikwad@skanem.com",
    "shamila.mirza@skanem.com"
  ],
  "nombre_sitio": "barsecco.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://skanemafrica.com/contact",
      "text": "Contact Skanem | Reach Out to Our Labelling Experts Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message We proudly present Skanem Nairobi Skanem Nairobi Sachen Gudka Managing Director +254 733 410 309 Send email Skanem Nairobi Sachen Gudka Managing Director +254 733 410 309 Send email Skanem Nairobi Anirudh Shetye Head of Sales & Marketing +254 735 052 700 Send email Skanem Nairobi Anirudh Shetye Head of Sales & Marketing +254 735 052 700 Send email Skanem Nairobi Joyce Njogu Key Account Manager +254 722 804 269 Send email Skanem Nairobi Joyce Njogu Key Account Manager +254 722 804 269 Send email We proudly present Skanem Uganda Skanem Uganda Olive Kunihira Head of Sales +256 759 589 711 Send email Skanem Uganda Olive Kunihira Head of Sales +256 759 589 711 Send email We proudly present Skanem Tanzania Skanem Tanzania Sameer Gaikwad Site Manager +255 757 803 737 Send email Skanem Tanzania Sameer Gaikwad Site Manager +255 757 803 737 Send email Skanem Tanzania Beatrice Malle Key Account Manager +255 712 110 922 Send email Skanem Tanzania Beatrice Malle Key Account Manager +255 712 110 922 Send email Skanem Tanzania Shamila Mirza Key Account Manager +255 717 477 047 Send email Skanem Tanzania Shamila Mirza Key Account Manager +255 717 477 047 Send email Locations Locations Locations How to reach us How to reach us How to reach us How to reach us Skanem Interlabels Nairobi Limited East Africa Headquarters East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa +254 202 471001 info.nairobi@skanem.com Skanem Interlabels Uganda Limited Namanve Industrial Park Mukono Uganda Africa +256 759 589711 olive.kunihira@skanem.com Skanem Tanzania Limited Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa +255 757 803737 sameer.gaikwad@skanem.com Contact us Send us a message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Products Sustainability menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy Products menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy"
    },
    {
      "url": "https://www.partyslate.com/venues/barsecco",
      "text": "Barsecco | Miami Venue | PartySlate Skip to content Venues Planners Vendors Ideas Venues Planners Vendors Ideas Barsecco Find Venues / Florida / Miami / Barsecco Unclaimed Barsecco 1421 S Miami Ave, Miami, FL 33131, USA Max Seated 100 Max Standing 100 Request info Favorite Owner hasn't claimed this business If you own this business, claim your profile to update information, add photos, and more. Claim Profile Overview Gallery 0 About Barsecco ABOUT US\nBarsecco is a chic restaurant and lounge that morphs from day to night, from bright and airy to sensual and inviting. The breezy canopied terrace, located just off Brickell Avenue, welcomes guests to mix, dine, and rest with diverse seating, hanging vines, and reclaimed barn wood. Inside, a sensual edge is added to an otherwise pleasant space with plush furniture, a towering tree, and low lighting. A pleasant, sociable eating experience is encouraged when the lights dim and beverages are poured, with shared-plates pulled from many cultures and local variations. Fresh ingredients are highlighted in classic and inventive cocktails, as well as beers, bottle service, and an international range of spirits, wine, and champagne. In the later hours, programming infuses energy to ensure the mood is right for a convivial night feel fueled by cocktails, music and late night bites.\n\nThe vivid, bold decor of Barsecco creates a joyful, energetic atmosphere for any private dining experience or occasion. It includes both indoor and outdoor venues that provide the ideal ambiance and most Instagrammable backdrop for your party or event. Barsecco has six different spaces available to reserve for your event, all able to host a seated party with dinner and drinks, or a standing cocktail party with drinks and hors d'oeuvres.\n\nRated number six in Yelp's picks for Top 10 Best Private Party Restaurants near Brickell, Miami, Florida.\n\nYelp Review:\n\"I had so much fun at Barseco! My roommates and I came here and ordered a few drinks & laughed the night away. The location is walking distance from other bars so you can bar hop. The drinks were good and food was pretty standard bar food. I loved the music and neon lights. There's lots of outdoor seating that's very secluded so I feel as though it's pretty Covid safe. I can't wait to come back here!!\" Event Spaces 1 100 max seated • 100 max standing 6 Barsecco 100 Seated 100 Standing Restaurant Pricing Packages Barsecco hasn't listed their pricing yet. Connect with them directly to get a customized pricing proposal for your event. Request a Quote Amenities A/V Equipment Coat Check Handicap Accessible Kosher Kitchen Media Room Pet Friendly Pool Street Parking Valet Parking WiFi Windows Dance Floor Breakout Rooms Map 1421 S Miami Ave, Miami, FL 33131, USA Follow Us Visit Website Call If you own this business, claim your profile to update information, add photos, and more. Claim Profile Get the latest trends Our team's top picks and more straight to your inbox. Subscribe Follow us Get Started Find a Venue Find a Pro Find Ideas Browse by Event Weddings Birthdays Baby Showers Corporate Events For Event Professionals Become a Member Digital Events Contact Pro Support The Company About Us Contact PartySlate Careers Get Started Find a Venue Find a Pro Find Ideas Browse by Event Weddings Birthdays Baby Showers Corporate Events For Event Professionals Become a Member Digital Events Contact Pro Support The Company About Us Contact PartySlate Careers Privacy Policy Terms of Service Pro Terms of Service © PartySlate 2025"
    },
    {
      "url": "https://www.delish.com/entertaining/wine/g32870025/best-prosecco-brands/",
      "text": "The Best Prosecco Brands For Your Summer Spritzes, According To Sommeliers My Recipes Subscribe Membership Benefits Recipes Meals Holidays Food Trends News Kitchen Tips & Tools All Videos About Us Newsletter Follow Privacy Notice Terms Of Use Skip to Content Recipes Dinners Fall Recipes Kitchen Tips News search Subscribe sign in September Dinner Ideas Best Nostalgic Desserts Tailgate-Ready Recipes Back-To-School Dinners School Lunch Ideas Entertaining & Parties Wine Headquarters The Best Prosecco Brands For Your Summer Spritzes, According To Sommeliers The Best Prosecco Brands For Your Summer Spritzes, According To Sommeliers These expert-recommended bottles belong in your shopping cart. By Gabby Romero and Maria Miyashiro Updated: May 30, 2025 Elena Noviello // Getty Images Delish editors handpick every product we feature. We may earn commission from the links on this page. It seems like all the best food and drink to come out of Italy starts with \"p\"— pizza , pasta , prosciutto, Parmesan , prosecco. That last one is Italy's most popular version of bubbly, sparkling wine . Prosecco is often compared to champagne , which is considered to be the benchmark of sparkling wine. So what differentiates them? Prosecco is produced in the Veneto and Friuli-Venezia Giulia wine regions of Italy, while champagne is from Champagne, France. Groundbreaking, huh? Here are some less evident distinctions: prosecco is made using primarily Glera grapes in the Charmat, or tank method, which involves a secondary fermentation in stainless steel autoclaves. Champagne production is more involved and takes more time, thus commanding a higher price point. Champagne permits the use of Chardonnay, Pinot Noir, and Pinot Meunier grapes. Production requires a secondary fermentation in the bottle, known as the Méthode Traditionnelle. The difference in production results in a different bubble experience. Champagne is bottled at a minimum of six atmospheres of pressure, resulting in pinprick, consistent bubbles, while prosecco can be made at as low as one atmosphere. This lower pressure makes for a more frothy bubble that dissipates more easily. So what about the taste? Prosecco is a fruit bomb. It can have notes of peach, apple, pear, melon, and cream, combined with intense floral aromas. You may associate it with sickly sweet flavors, but the sparkling wine can range between four different styles with varying degrees of sugar. So whether you want a crisp and dry celebratory sip or a bubbly base for summer spritzes, you can rely on prosecco to get the job done. To help you pick your perfect bottle, we asked sommeliers and wine experts to share their favorite prosecco brands. Their recommendations run the gamut from versatile crowd pleasers to unique showstoppers. Need some inspo for how to serve them? Check out our favorite spritz recipes here . 1 Massimo Coletti Phoja Prosecco di Treviso Frizzante $22 at SommSelect Some proseccos are comfortable in a supporting role, but this bottle demands to be in the spotlight. Janine Coleman, Maître d'hôtel and Sommelier at Cru Uncorked , describes this prosecco as \"a multi-vintage natty wonder that displays quite a bit of earth—a favorite trait of mine. This is definitely one for enjoying on its own!\" 2 De Stefani Valdobbiadene Prosecco Superiore DOCG $26 at letstalkvinowineshop.com \"My favorite prosecco is unequivocally the De Stefani Valdobbiadene Prosecco Superiore DOCG,\" says Katie Forstner, Sommelier at Urban Hill . \"I have so much respect for Alessandro's approach to creating traditional, expressive wines from Venezia, and I think this particular sparkler is one of the most palatable, dynamic, and textured proseccos I've had the pleasure of enjoying.\" Advertisement - Continue Reading Below 3 Nino Franco Prosecco Rustico $20 at Total Wine Thomas Delasko, Sommelier and General Manager of Via Sophia , says this bottle is his go-to Prosecco. \"It offers a delicate harmony of orchard fruits—think crisp apple and ripe pear—paired with fine, persistent bubbles and a clean, dry finish,\" he says. \"Equally at home on its own, paired with food, or in a classic cocktail like a Bellini or Aperol Spritz , its versatility is unmatched.\" 4 Bisol Jeio Valdobbiadene Prosecco Superiore DOCG $18 at Total Wine This bottle was recommended by several industry experts—and for good reason. \"They are a family-owned winery that has been cultivating grapes since 1542,\" says Katherine Janowiak, Advanced Sommelier at Jamie's Bottle Shop . The wine is brut in style, so it has a nice balance of fruit and dryness.\" Joe Mele, Sommelier and co-host of The Wine Pair Podcast , also says it's worth the purchase. Advertisement - Continue Reading Below 5 Le Colture Fagher Prosecco Superiore Brut $23 at Wine.com Another one of Mele's favorites is this brut from Le Colture. \"We always look for Brut Prosecco as opposed to the more commonly found Extra Dry Prosecco,\" he says. Le Colture's Fagher strikes the perfect balance of fruity and citrus-forward notes without tasting too sweet. 6 Zardetto Prosecco Brut $12 at Total Wine Mele also recommends Zardetto's brut as an affordable bottle that punches well above its weight. This prosecco is light, clean, and crisp, which makes it the perfect summer sipper. Advertisement - Continue Reading Below 7 Santomè Prosecco Rose $15 at empirewine.com Surprise: prosecco can be pink too! \"The little bit of Pinot Noir that's blended with the Glera brings a whole new flavor profile,\" says Erika Vigen, Level III Sommelier at Uvae Kitchen & Wine Bar. \"The winery itself is family owned by third-generation wine growers and first-generation winemakers.\" The added red berry notes from the Pinot Noir make this an especially versatile bottle when pairing with food and pouring in a spritz. 8 Bortolomiol Prior Valdobbiadene Prosecco Superiore Now 13% Off $24 $21 at shopwinedirect.com This DOCG prosecco is the go-to pick for Nizuniro Altamirano, Sommelier at Bahia Hotel & Beach House's Bar Esquina . \"It has an elegant structure, fine bubbles, and a crisp acidity,\" he says. \"I love how it balances freshness with subtle complexity—it's not just a celebratory sip, it’s a wine you can truly appreciate.\" While he suggests drinking it solo to fully experience the nuance, it's also versatile enough for any kind of spritz. Advertisement - Continue Reading Below 9 Batiso Contemporaneo Prosecco Brut Now 14% Off $19 $16 at saratogawine.com Seema Prasad, restaurateur and owner of Harvest Wine Market & Miel , has a few favorite proseccos. This one from Batiso is \"just delicious juice that has a clean, tart green apple-flavored finish and a fresh citrusy scent,\" she says. 10 Domini del Leone Prosecco Spumante Brut $20 at Astor Wines Prasad's other top pick is from Domini del Leone. \"Both are farmed organically and are truly brut (less than 12 grams/liter of residual sugar), so super dry on your palate,\" she says. \"You know when you taste a wine and you quickly want to taste more...both of these do that to me.\" Advertisement - Continue Reading Below 11 santome Tenuta Santomè Prosecco DOC Treviso Brut $15 at empirewine.com Wine expert and importer Lauren Power of Lauren Power Wine and Tre Amici Imports has tasted plenty of prosecco, and this brut from Santomè is her tried and true. \"It’s my anytime sparkling. I’ll pop a bottle for happy hour, pair it with salty snacks, or pour a glass when I just want something refreshing and celebratory without overthinking it,\" she says. \"It’s also one of my favorite picks for summer entertaining because it's light, crowd-pleasing, and incredibly versatile.\" 12 Mionetto Prosecco Brut $14 at Total Wine When you step into any standard wine store, there's one prosecco that you can trust to be always in stock and always delicious. Mionetto's classic brut is crisp, not too sweet, and easy to pair in any cocktail. It's no wonder that it's our test kitchen's favorite prosecco brand. Advertisement - Continue Reading Below Wine Headquarters 49 Easy Wine Cocktail Recipes The 8 Best Kosher Wines For Passover 16 Wine Subscriptions That Are Worth Every Penny The 12 Best Wines At Costco Advertisement - Continue Reading Below The 14 Best Wines At Trader Joe's 20 Best Bottles Of Wine For Christmas 21 Cheap Wines That'll Impress Your Guests 23 Celebrity Wines We Love 17 Sparkling Wines We Love Here Are The Major Types Of Red Wine The 14 Best White Wines You Haven't Tried Yet What Are Tannins In Red Wine? Advertisement - Continue Reading Below Newsletter Subscribe Manage Subscription About Us Delish Test Kitchen Media Kit Community Guidelines Advertise With Us Other Hearst Subscriptions Delish Unlimited Membership Support Turn off Web Notifications A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2025 Hearst Magazine Media, Inc. All Rights Reserved. Privacy Notice CA Notice at Collection Your CA Privacy Rights/Shine the Light DAA Industry Opt Out Terms of Use Site Map Cookies Choices"
    },
    {
      "url": "https://finewineliquors.com/contact-us/",
      "text": "Contact us Fine Wine Liquors Shop By Department Wine Red wine Menu Shiraz Cabernet Sauvignon Pinot Noir Red Blends Other Red Varietals Rosé Cabernet Merlot Shiraz Cabernet Merlot Grenache Tempranillo Sangiovese Nebbiolo Bordeaux Barossa Valley white Wine Menu Chardonnay Riesling Sauvignon blanc Pinot gris grigio Other white varietals White blends Dessert white Popular Regions Menu Bordeaux Barossa Valley Mclaren Vale Coonawarra Margaret River Burgundy Clare Valley Fortified Wine Menu Port Tawny Sherry Apera Vermouth Muscat Mead Tokay Topaque Popular Brands Menu Penfolds Under Wraps Wynns Wendouree Wolf Blass Tyrrell’s Top Selling Macallan 15 Year Old Double Cask $ 165.00 Availability: In Stock Glenfiddich Project XX $ 61.00 Availability: In Stock Glendronach 15 Year Old Revival $ 86.25 Availability: In Stock Beer Discover Beer Menu Craft Beer International Beer Australian Beer Mid Strength Light Beer Low Carb Beer Alcoholic Ginger Beer Home Brew Stout Pilsner Wheat Beer Dark Beer Golden Ale Porter Categories Menu Kegs Cider Craft Beer Domestic Beer Hard Seltzers Import Beer Non-Alcoholic Beer Popular Brands Menu 4 Pines Balter Coopers Little Creatures Stone & Wood Zytho New & Trending Menu New Arrivals Top Rated Craft Beer Light Low Pool Packs Cool Off Craft Beer The Lemonade Stand Country Menu Australia Sweden New Zealand France Spain From to Ready to Drink Organic Wine $69.99 Whiskey Discover whiskey Menu Scotch Whisky American Whiskey Japanese Whisky Australian Whisky Irish Whiskey Canadian Whisky Indian Whisky Discover Vodka Menu Absolut Smirnoff Hunter Distillery Stolichnaya Royal Dragon Crystal Head Poliakov Popular Brands Menu Johnnie Walker Jack Daniel’s Glenfiddich Highland Park Glen Moray Stone & Wood Fortified Wine Menu Whiskey Of The Month Flavored Whiskey Blended Scotch Rye Whiskey Single Malt Scotch Small Batch Bourbon Hot deals of summer Fresh Beer Save up $49.99 Jameson Whiskey Father’s Day Sale 40% off Sitewide! Cogac Cocktail Tequila What’s New New Gift & Accessories Best Sellers Sales & Offers -20% Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Menu Sign In or Register 0 0 $ 0.00 Contact us Home Page Contact us Don’t  hesitate to contact us \nif you need help. Whether you have a question about your order, need assistance with a product, or just want to reach out, you’re in the right place. Feel free to contact us using the details below, and we’ll get back to you as quickly as possible! Address 8560 S Cottage Grove Ave, Chicago, IL 60619, United States Call Us (630) 354-9222 Openning Monday – Friday: 8am – 10pm Saturday – Sunday: 9am – 5pm Contact sales@finewineliquors.com finewineliquorsinfo@gmail.com Got Any Questions? Use the form below to get in touch with the sales team Message Send your message Δ Search Account Cart Same-day local delivery Ground shipping directly to you Free in-store pickup 24/7 customer support Customer Service Menu Help Center My account Track my order Return policy About Us Menu Company info Press Releases Careers Reviews Investor relations Quick Links Menu Search Become a reseller Contact us Terms of service Categories Menu Brandy White Wine Champagne Vodka Tequila Get exclusive offers & rewards Sign up for our members portal to receive some exclusive offer & rewards. It’s easy and free! sign up Leave this field empty if you're human: stay connect Facebook-f Twitter Instagram Pinterest we accept Careers About Us Affiliates Privacy Settings Help Site map Copyright ©  2022 Liquory . All rights reserved. Sign in Create an Account Username or email * Password * Login Lost your password? Main menu Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Home About Us Account Blog Careers Cart Checkout Contact us Legal Notice My account Order Tracking Privacy Policy Refund and Returns Policy Reviews Sample Page Shipping Shop Terms & Conditions Track Wishlist Search for: Search All category All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell’s Black Lebel Blanton’s Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester’s Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell's Black Lebel Blanton's Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester's Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine Hide similarities Highlight differences Select the fields to be shown. Others will be hidden. Drag and drop to rearrange the order. Image SKU Rating Price Stock Availability Add to cart Description Content Weight Dimensions Additional information Click outside to hide the comparison bar Compare Top Shopping cart close ×"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. First name name First E-Mail Surname * E-Mail * Nachricht * Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "https://inzmo.com/deu/en/contact",
      "text": "Contact INZMO: Get in Touch with Us Today! | INZMO English Products Products Hello and welcome! You've just entered a world where insurance isn't just a necessity; it's a path to financial freedom. We're INZMO, and we're more than just insurance. Mobile Phone Insurance From 1.99€ / month Rental Deposit Warranty From 3.25€ / month Bicycle insurance From 4.99€ / month Laptop/Tablet Insurance From 2.99€ / month E-scooter Insurance From 4.17€ / month About us For Partners Submit a claim Submit a claim Submit a claim We're here to help! Whether it's phone, email or chat, let us know what we can help you with today! We're here to help! Whether it's phone, email or chat, let us know what we can help you with today! Contact us As an INZMO customer, there are several easy ways to get in touch with us. We're here to help with any questions you might have! Email us: info@inzmo.com Give us a call: +49 30 31193091 (available 9-17 CET, Monday-Friday; except national holidays) Chat: use our chat option down in the corner of the page to find an answer even faster. Looking to partner with INZMO? Learn about easily offering embedded insurance to your customers. Connect with one of our experts today and get started! Talk with an expert Unleash the revolution - choose the wise alternative Get covered Your e-mail address Submit Subscribe for updates See what's new Get the app Inzmo About us Imprint Products Rental Deposit Warranty Mobile Phone Insurance Laptop/Tablet Insurance Bicycle Insurance E-scooter Insurance Get in touch Contact us Partner with us Careers Legal Terms of Use Privacy Policy Cookie Notice & Policy"
    }
  ]
}