{
  "fuentes": [
    {
      "url": "https://www.tripadvisor.co.nz/ShowUserReviews-g34731-d15245186-r714009620-Batch_New_Southern_Kitchen_and_Tap_West_Palm_Beach-West_Palm_Beach_Florida.html",
      "email": "wpbinfo@batchhospitalitygroup.com"
    },
    {
      "url": "https://thevendry.com/venue/181448/batch-new-southern-kitchen-and-tap:-west-palm-beach-west-palm-beach-fl",
      "email": "wpbinfo@batchhospitalitygroup.com"
    },
    {
      "url": "https://batchsouthernkitchen.com/we-are-hiring/",
      "email": "ftljobs@batchhospitalitygroup.com"
    }
  ],
  "mails": [
    "ftljobs@batchhospitalitygroup.com",
    "wpbinfo@batchhospitalitygroup.com"
  ],
  "nombre_sitio": "batchsouthernkitchen.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.tripadvisor.co.nz/ShowUserReviews-g34731-d15245186-r714009620-Batch_New_Southern_Kitchen_and_Tap_West_Palm_Beach-West_Palm_Beach_Florida.html",
      "text": "Happy hour! - Review of Batch New Southern Kitchen and Tap: West Palm Beach, West Palm Beach, FL - Tripadvisor We noticed that you're using an unsupported browser. The Tripadvisor website may not display properly.We support the following browsers: Windows: Internet Explorer , Mozilla Firefox , Google Chrome . Mac: Safari . West Palm Beach West Palm Beach Tourism West Palm Beach Accommodation West Palm Beach Bed and Breakfast West Palm Beach Holiday Rentals West Palm Beach Flights Batch New Southern Kitchen and Tap: West Palm Beach West Palm Beach Attractions West Palm Beach Travel Forum West Palm Beach Photos West Palm Beach Map All West Palm Beach Hotels West Palm Beach Hotel Deals Last Minute Hotels in West Palm Beach Skip to main content Discover Trips Review More NZD Sign in Inbox See all Sign in to get trip updates and message other travellers. West Palm Beach Hotels Things to Do Restaurants Flights Holiday Homes Travel Stories Cruises Tours Add a Place Travel Forum Airlines Travellers' Choice Help Centre Happy hour! - Batch New Southern Kitchen and Tap: West Palm Beach United States Florida (FL) West Palm Beach West Palm Beach Restaurants Batch New Southern Kitchen and Tap: West Palm Beach Search “Happy hour!” Review of Batch New Southern Kitchen and Tap: West Palm Beach 99 photos Batch New Southern Kitchen and Tap: West Palm Beach 223 Clematis St , West Palm Beach, FL 33401-5512 +1 561-708-0000 Website Improve this listing Reserve a table 2 Wed, 10/09 20:00 Ranked #73 of 851 Restaurants in West Palm Beach 100 Reviews Price range: $30 - $67 Description: Batch New Southern Kitchen & Tap is a modern casual dining restaurant & bar featuring a scratch-cooked, locally sourced new southern culinary menu and garden-to-glass cocktails. Restaurant details Description: Batch New Southern Kitchen & Tap is a modern casual dining restaurant & bar featuring a scratch-cooked, locally sourced new southern culinary menu and garden-to-glass cocktails. NCtravelz Raleigh, North Carolina 742 268 Reviewed 30 September 2019 via mobile Happy hour! We happened to arrive for dinner during happy hour and ended up at the bar instead. The happy hour deal is amazing and wasn't too crowded on a weekday. Three of us had the avocado toast, bacon tots (so good we ordered another), raw oysters, deviled eggs and mac and cheese (with brisket and fried chicken). We had a great time! Date of visit: July 2019 > > Ask NCtravelz about Batch New Southern Kitchen and Tap: West Palm Beach Thank NCtravelz This review is the subjective opinion of a Tripadvisor member and not of Tripadvisor LLC. Tripadvisor performs checks on reviews as part of our industry-leading trust & safety standards. Read our transparency report to learn more. TheBatchTeam, Owner at Batch New Southern Kitchen and Tap: West Palm Beach, responded to this review Responded 24 January 2020 Thanks for your kind words, we're glad you all had such a nice time! Anytime you're back in Florida, you know where to find us :D Cheers, The Batch Team Report response as inappropriate Thank you. We appreciate your input. This response is the subjective opinion of the management representative and not of Tripadvisor LLC Updating list... Reviews (100) Traveller rating Excellent 55 Very good 24 Average 7 Poor 5 Terrible 9 Traveller type Families Couples Solo Business Friends Time of year Mar-May Jun-Aug Sep-Nov Dec-Feb Language All languages English (100) Language English (100) Show reviews that mention All reviews brunch chicken and waffles burnt ends tots eggrolls brisket chocolate tart frittata burger fries salmon bread chilli clematis street comfort food menu items service was great Review tags are currently only available for English language reviews. Read reviews in English Go back 80 - 84 of 100 reviews jazangel Boynton Beach, Florida 16 10 Reviewed 30 September 2019 via mobile Disappointing ambiance and service From the start we had a problem. They didn’t want to seat us until the whole party was here, even though the restaurant was nearly empty, although They did end up seating us. I had the batch breakfast. There was only one option for toast which contained seeds that I can’t eat. It came without butter or jelly or offer of any. The third cup of coffee (from the kitchen) wasn’t hot. No cream only milk. After awhile a DJ started playing. Music selections great but volume ridiculously loud making it difficult to converse with each other. Even after speaking to the manager there was no change. This was brunch not happy hour. The food was very good. Date of visit: September 2019 Ask jazangel about Batch New Southern Kitchen and Tap: West Palm Beach Thank jazangel This review is the subjective opinion of a Tripadvisor member and not of Tripadvisor LLC. Tripadvisor performs checks on reviews as part of our industry-leading trust & safety standards. Read our transparency report to learn more. sfspearman 18 6 Reviewed 3 September 2019 A hidden gem of fantastic food Spent the last evening of my Palm Beach stay having dinner here, and my meal was delicious. Went with the Impossible Burger, and what made it was the B1 aioli that accompanied it. Yummy. For dessert, I ordered the Apple Crisp with house made Vanilla & Pecan ice cream- which I couldn't finish. The highlight of the meal was our server, Jay. He was possibly the kindest server I've had in recent memory. (I received some very bad news before we ordered, and I was teary throughout my visit). Without missing a beat or asking, Jay refilled my wine glass and let me cry, with the reason of \"just because\" he \"thought I needed it\". Waited after paying to speak to the manager about our experience- she (didn't get her name, unfortunately) seemed very happy that we chose Batch and had a good time. *I actually came in to try the Cathead Biscuits, but was too full after eating to order them! Date of visit: August 2019 Value Service Food Ask sfspearman about Batch New Southern Kitchen and Tap: West Palm Beach Thank sfspearman This review is the subjective opinion of a Tripadvisor member and not of Tripadvisor LLC. Tripadvisor performs checks on reviews as part of our industry-leading trust & safety standards. Read our transparency report to learn more. matthewpC9153EV West Palm Beach, Florida 14 37 Reviewed 25 August 2019 via mobile Could be better... Heard great reviews so my wife and I decided to try it out for brunch on Sunday. Fairly busy but we were seated right away. Ten minutes later our server came to take drink order of a couple coffees and waters, 15 minutes later we received our drinks and then he was gone without letting us put our order in for another 15 minutes. Chicken and waffles were very very good as promised but it should not take 40 minutes to put in an order. Music selection was excellent but a tad too loud as we had to yell across the table to have a conversation. Will give it a few months and try again as food was good but not in a hurry to rush back. Date of visit: August 2019 Ask matthewpC9153EV about Batch New Southern Kitchen and Tap: West Palm Beach 2 Thank matthewpC9153EV This review is the subjective opinion of a Tripadvisor member and not of Tripadvisor LLC. Tripadvisor performs checks on reviews as part of our industry-leading trust & safety standards. Read our transparency report to learn more. cairoamber Palm Beach Gardens, Florida 19 5 Reviewed 17 June 2019 via mobile Incredible Every single items we ordered was incredible. The ribs were delicious and the meat fell right off of the bone. The short rib burger has amazing flavor. I really enjoyed the toasted pecan whiskey sour. They grated fresh horseradish over the raw oysters. Incredible place! Date of visit: June 2019 Ask cairoamber about Batch New Southern Kitchen and Tap: West Palm Beach Thank cairoamber This review is the subjective opinion of a Tripadvisor member and not of Tripadvisor LLC. Tripadvisor performs checks on reviews as part of our industry-leading trust & safety standards. Read our transparency report to learn more. TheBatchTeam, Owner at Batch New Southern Kitchen and Tap: West Palm Beach, responded to this review Responded 24 January 2020 Thanks for the kind words Amber, we're glad you had such a nice time! hope to see you back again soon. Cheers, The Batch Team Report response as inappropriate Thank you. We appreciate your input. This response is the subjective opinion of the management representative and not of Tripadvisor LLC Previous Next 1 … 16 17 18 … Updating list... Travellers who viewed Batch New Southern Kitchen and Tap: West Palm Beach also viewed Batch New Southern Kitchen & Tap: Delray Beach 104 Reviews Delray Beach, FL Galley 628 Reviews West Palm Beach, FL Avocado Grill 693 Reviews West Palm Beach, FL Grato 277 Reviews West Palm Beach, FL All restaurants in West Palm Beach (851) Been to Batch New Southern Kitchen and Tap: West Palm Beach? Share your experiences! Write a Review Add Photos & Videos Owners: What's your side of the story? Own or manage this property? Claim your listing for free to respond to reviews, update your profile and much more. Claim Your Listing Viewed restaurants Batch New Southern Kitchen and... 100 Reviews Browse nearby Restaurants (851) | Hotels (46) | Things to Do (462) Also show Hotels Restaurants Things to Do Also show Map Satellite Map updates are paused. Zoom in to see updated info. Reset zoom Updating Map... Return to Map Revenue impacts the experiences featured on this page, learn more . © 2025 Tripadvisor LLC All rights reserved. Terms of Use Privacy and Cookies Statement Cookie consent Site Map How the site works Contact us Accessibility Statement This is the version of our website addressed to speakers of English in New Zealand . If you are a resident of another country or region, please select the appropriate version of Tripadvisor for your country or region in the drop-down menu. Tripadvisor LLC makes no guarantees for availability of prices advertised on our sites and applications. Listed prices may require a stay of a particular length or have blackout dates, qualifications or other applicable restrictions. Tripadvisor LLC is not responsible for any content on external web sites that are not owned or operated by Tripadvisor . Tripadvisor LLC is not a booking agent or tour operator. When you book with one of our partners, please be sure to check their site for a full disclosure of all applicable fees. Read more $ NZD New Zealand"
    },
    {
      "url": "https://thevendry.com/venue/181448/batch-new-southern-kitchen-and-tap:-west-palm-beach-west-palm-beach-fl",
      "text": "Batch New Southern Kitchen and Tap: West Palm Beach - Southern/Soul Restaurant in West Palm Beach, FL | The Vendry by by Search Inspiration Circles Log In Sign Up by The community and marketplace for event pros. Join Us List My Business The Vendry Organizations The Memo About the Vendry Contact Us Groupize Keep me posted with industry news, cool case studies, and events. Your email address Subscribe © 2025 THE VENDRY LLC. Privacy Terms & Conditions Terms of Use Overview Spaces Press Nearby Hotels Batch New Southern Kitchen and Tap: West Palm Beach Restaurant 223 Clematis St, West Palm Beach, FL 33401, USA Batch New Southern Kitchen and Tap: West Palm Beach 223 Clematis St, West Palm Beach, FL 33401, USA Request Pricing Cuisine Type Southern/Soul # of Spaces 2 Capacity Max Seated: 225 We’re all about cookin’ from scratch. That means we avoid frozen products, we don’t cut corners, and we only feature the freshest and best ingredients we can source. We use local products, sustainable crops, and fair trade ingredients. It may take us a little more time and a little more work, but we were taught nothin’ worthwhile comes easy, and creating the best possible meal for you is all that matters. We are proud to cater to every diet- don’t be afraid to ask our servers for vegan and gluten-free options! We focus on craft American-made spirits, new-world wines, and Florida micro-brewed beers. 100% of our bitters, tinctures, and syrups are made in house. We feature freshly squeezed & cold-pressed juices, make our own sodas, use local fresh herbs, and even brandy our own domestic cherries. We believe all of our beverages should be made to the highest possible standard with the best possible ingredients and care, so each one of your drinks is something we’re proud to call ours. Show more Show more Request Pricing 223 Clematis Street, West Palm Beach, FL Show on the map Spaces Indoor Max Seated: 225 Outdoor Patio Max Seated: 75 Indoor Max Seated: 225 Outdoor Patio Max Seated: 75 Press Secret Miami 34 Fabulous Things To Do This May 2023 In Miami May 2, 2023 Thrillist 12 Reasons to Drive to West Palm Beach Feb 16, 2021 Secret Miami 34 Fabulous Things To Do This May 2023 In Miami May 2, 2023 Thrillist 12 Reasons to Drive to West Palm Beach Feb 16, 2021 Do you work for Batch New Southern Kitchen and Tap: West Palm Beach ? Contact us to learn more about who's managing this profile or gain access. Other Venues in West Palm Beach for Your Event West Palm Beach Hotels West Palm Beach Event Spaces West Palm Beach Golf Courses West Palm Beach Restaurants West Palm Beach Coworking Spaces West Palm Beach Performance Spaces West Palm Beach Private Clubs West Palm Beach Public Spaces West Palm Beach Museums / Galleries West Palm Beach Bars / Clubs West Palm Beach Aquariums / Zoos West Palm Beach Breweries / Distilleries West Palm Beach Convention Centers West Palm Beach Boats / Yachts West Palm Beach Private Group Activites West Palm Beach Hotels West Palm Beach Event Spaces West Palm Beach Golf Courses West Palm Beach Restaurants West Palm Beach Coworking Spaces West Palm Beach Performance Spaces West Palm Beach Private Clubs West Palm Beach Public Spaces West Palm Beach Museums / Galleries West Palm Beach Bars / Clubs West Palm Beach Aquariums / Zoos West Palm Beach Breweries / Distilleries West Palm Beach Convention Centers West Palm Beach Boats / Yachts West Palm Beach Private Group Activites"
    },
    {
      "url": "https://batchsouthernkitchen.com/we-are-hiring/",
      "text": "We are Hiring - Batch Southern Kitchen & Tap Skip to content About Us West Palm Beach Ft. Lauderdale Delray About Us West Palm Beach Ft. Lauderdale Delray We Are Hiring! Want to join our team? We’d love to chat! Please fill out this form and attach a resume or email us directly at ftljobs@batchhospitalitygroup.com Name: * Required First Last Phone: * Required Email: * Required Upload your resume Max. file size: 25 MB. Batch is an equal opportunity employer. URL This field is for validation purposes and should be left unchanged. Protected by reCAPTCHA Privacy | Terms © Copyright 2018-2025 Batch Southern Kitchen & Tap. A Southern concept by Batch Hospitality Group | Website Designed by NonStop Marketing"
    }
  ]
}