{
  "fuentes": [
    {
      "url": "https://www.texrenfest.com/contact-us",
      "email": "3-col-bg@2x.jpg"
    },
    {
      "url": "https://www.texrenfest.com/contact-us",
      "email": "bg-3@2x.jpg"
    },
    {
      "url": "https://www.texrenfest.com/contact-us",
      "email": "content-image-overlay@2x.png"
    },
    {
      "url": "https://www.texrenfest.com/contact-us",
      "email": "dynamix-logo-white@2x.png"
    },
    {
      "url": "https://www.texrenfest.com/contact-us",
      "email": "map_marker@2x.png"
    },
    {
      "url": "https://www.bayareacouncil.org/events/",
      "email": "kcure@bayareacouncil.com"
    },
    {
      "url": "https://www.bayareacouncil.org/events/",
      "email": "kcure@bayareacouncil.org"
    },
    {
      "url": "https://www.bayareacouncil.org/events/",
      "email": "lmirante@bayareacouncil.org"
    },
    {
      "url": "https://bayarearenfest.com/faq/",
      "email": "digitaldash@digitalarchitects.org"
    },
    {
      "url": "https://bayarearenfest.com/about-us/",
      "email": "digitaldash@digitalarchitects.org"
    },
    {
      "url": "https://bayarearenfest.com/maps-and-directions/",
      "email": "digitaldash@digitalarchitects.org"
    },
    {
      "url": "https://bayarearenfest.com/2025-attractions/",
      "email": "digitaldash@digitalarchitects.org"
    },
    {
      "url": "https://www.bayarearenfest.com/contact/",
      "email": "digitaldash@digitalarchitects.org"
    },
    {
      "url": "https://www.bayarearenfest.com/contact/",
      "email": "info@bayarearenfest.com"
    },
    {
      "url": "https://communityimpact.com/houston/bay-area/government/2025/05/21/texas-renaissance-festival-founder-george-coulam-dies/",
      "email": "spinner@2x.gif"
    },
    {
      "url": "https://bayarearenfest.com/entertainment/",
      "email": "digitaldash@digitalarchitects.org"
    },
    {
      "url": "https://variety.com/2025/tv/obituaries-people-news/george-coulam-dead-ren-faire-1236406162/",
      "email": "obits@variety.com"
    },
    {
      "url": "https://bayarearenfestweddings.com/",
      "email": "weddings@bayarearenfest.com"
    },
    {
      "url": "https://bayarearenfestweddings.com/",
      "email": "weddings@bayarearenfestweddings.com"
    },
    {
      "url": "https://bayarearenfest.com/contact-us/",
      "email": "digitaldash@digitalarchitects.org"
    },
    {
      "url": "https://bayarearenfest.com/contact-us/",
      "email": "info@bayarearenfest.com"
    },
    {
      "url": "https://www.fox26houston.com/news/todd-mission-death-investigation-texas-renaissance-festival-king-george-home",
      "email": "fox26houstonnews@foxtv.com"
    },
    {
      "url": "https://rennfest.com/phone-mailing-info/",
      "email": "carolyn@rennfest.com"
    },
    {
      "url": "https://rennfest.com/phone-mailing-info/",
      "email": "carolyn@rennfest.com"
    },
    {
      "url": "https://rennfest.com/phone-mailing-info/",
      "email": "info@rennfest.com"
    },
    {
      "url": "https://bayarearenfest.com/",
      "email": "digitaldash@digitalarchitects.org"
    }
  ],
  "mails": [
    "3-col-bg@2x.jpg",
    "bg-3@2x.jpg",
    "carolyn@rennfest.com",
    "content-image-overlay@2x.png",
    "digitaldash@digitalarchitects.org",
    "dynamix-logo-white@2x.png",
    "fox26houstonnews@foxtv.com",
    "info@bayarearenfest.com",
    "info@rennfest.com",
    "kcure@bayareacouncil.com",
    "kcure@bayareacouncil.org",
    "lmirante@bayareacouncil.org",
    "map_marker@2x.png",
    "obits@variety.com",
    "spinner@2x.gif",
    "weddings@bayarearenfest.com",
    "weddings@bayarearenfestweddings.com"
  ],
  "nombre_sitio": "bayarearenfest.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.texrenfest.com/contact-us",
      "text": "Contact Us | Texas Renaissance Festival The Kingdom Directions, Parking, & Maps Themed Weekends Lockers Accessibility FAQ Lost and Found Newsletter Sign-Up Contact TRF Things To Do & Entertainment Entertainment Schedule Performers For Lords & Ladies (21+) For Families Guided Tours Survival Guide for Newbies Speak like a TRF Pro Where to Stay Camping at TRF Campground Map Campground Rules & FAQs Camping Passes Guilds Lodging Weddings & Events Weddings @ TRF Parties & Events Contact Weddings & Events Shops, Food, & Drinks Dragonslayer Gift Shop Shoppes Food & Drink Get Involved Become A Sponsor Cast Auditions For our Cast For our Vendors TRF Careers Media Media Pass Request Press Kit & Releases Podcast Tickets General Ticket Info Parking Passes Group Tickets Info Stay & Play Ticket Info Season Tickets Info Campground Ticket Info Liability Waiver Yes, We Donate Join us this year for our 51st Anniversary! Days Hrs Min Sec Sign Up For Our Newsletter Skip to main content Skip to footer Texas Renaissance Festival 21778 Farm to Market 1774 Todd Mission, Texas 77363 Varied The Kingdom Directions, Parking, & Maps Themed Weekends Lockers Accessibility FAQ Lost and Found Newsletter Sign-Up Contact TRF Things To Do & Entertainment Entertainment Schedule Performers For Lords & Ladies (21+) For Families Guided Tours Survival Guide for Newbies Speak like a TRF Pro Where to Stay Camping at TRF Campground Map Campground Rules & FAQs Camping Passes Guilds Lodging Weddings & Events Weddings @ TRF Parties & Events Contact Weddings & Events Shops, Food, & Drinks Dragonslayer Gift Shop Shoppes Food & Drink Get Involved Become A Sponsor Cast Auditions For our Cast For our Vendors TRF Careers Media Media Pass Request Press Kit & Releases Podcast Tickets General Ticket Info Parking Passes Group Tickets Info Stay & Play Ticket Info Season Tickets Info Campground Ticket Info Liability Waiver Yes, We Donate Information Contact Us Contact Name * Email * Choose your recipient * Select General Careers Message Submit Hidden website input Departments General Information & Management [email protected] Entertainment [email protected] Marketing / Public Relations [email protected] Group Sales / Group Events [email protected] Artists / Merchants / Food [email protected] Weddings and Events [email protected] Camping [email protected] Ticketing [email protected] Lost and Found [email protected] Bookkeeping [email protected] Newsletter Signup Want to be notified when an article is published? Enter your email address to be the first to know. Contact Email * Submit Hidden website input Facebook X (Twitter) YouTube Instagram Yelp Menu Contact Purchase Tickets Jobs Blog Media Terms and Conditions Refund Policy Information 281-356-2178 [email protected] Office Hours: 8 am - 5 pm Monday - Friday Festival Hours: 9 am - 8 pm (No Entry After 7 PM) Saturday, Sunday, Thanksgiving Friday Oct. 11 - Nov. 30, 2025 Location 21778 Farm to Market 1774 Todd Mission, TX 77363 Get Directions Thank You To Our Gold Level Sponsors Privacy Policy © 2025 Texas Renaissance Festival all rights reserved. Site Design By: Dynamix Web Design X Unsupported Browser You can use your current browser on Texrenfest.com but some functionality may not work fully. Texrenfest.com works best with the latest versions of Chrome , Firefox , or Microsoft Edge."
    },
    {
      "url": "https://www.bayareacouncil.org/events/",
      "text": "Events : Bay Area Council Events : Bay Area Council Get Our Newsletter About Executive Committee Board of Directors Member Companies History The Historic Klamath Ferry Bay Area Business Hall of Fame Professional Team Weekly Flash Newsletter Careers Contact Us Join Policy & Advocacy Business Climate Public Safety Housing Tech & Innovation Homelessness Transportation Waterfront Water, Energy & Climate Workforce of the Future Global Business & Investment Government Relations Inclusive Economy China Program Healthcare Events Events Calendar Events Overview 2025 Women’s Leadership Summit Webinars News Recent News Press Releases BAC in the News Economic Institute Get Our Newsletter About Executive Committee Board of Directors Member Companies History The Historic Klamath Ferry Bay Area Business Hall of Fame Professional Team Weekly Flash Newsletter Careers Contact Us Join Policy & Advocacy Business Climate Public Safety Housing Tech & Innovation Homelessness Transportation Waterfront Water, Energy & Climate Workforce of the Future Global Business & Investment Government Relations Inclusive Economy China Program Healthcare Events Events Calendar Events Overview 2025 Women’s Leadership Summit Webinars News Recent News Press Releases BAC in the News Economic Institute Events Oct 28 Tuesday 2025 Women’s Leadership Summit Sep 11 Thursday AI and the Future of Work: Strategies for a Changing Labor Market September                11,\n                2025 10:00 AM - 11:30 AM Historic Klamath, Pier 9, The Embarcadero at Broadway, San Francisco Sep 16 Tuesday Bay Area Community College Consortium Strategic Planning Meeting September                16,\n                2025 TBD The Historic Klamath Attendance by invitation only. Contact kcure@bayareacouncil.com for questions. Sep 16 Tuesday NCAN Quarterly Meeting September                16,\n                2025 2:30pm-4:30pm Pier 9, The Embarcadero, SF, CA 94111 Sep 24 Wednesday National Talent Collaborative September                24,\n                2025 TBD The Historic Klamath Attendance by invitation only. Contact kcure@bayareacouncil.org for questions. Sep 25 Thursday Chicago Delegation: Powering the Future September                25,\n                2025 9:00AM Chicago Oct 15 Wednesday UCLA Anderson Forecast Economic Outlook October                15,\n                2025 12:00pm - 3:00pm Historic Klamath, Pier 9, The Embarcadero at Broadway, San Francisco The UCLA Anderson Forecast’s Bay Area Regional Outlook arrives at a pivotal moment for the US and regional economy. This annual conference is pr(...) Oct 16 Thursday Coastal Act and Infill Housing Streamlining Working Group October                16,\n                2025 11:00am - 12:00pm Virtual Members contact Louis Mirante at lmirante@bayareacouncil.org for invitation to discuss the Coastal Act and ways to streamline housing in infill ar(...) Oct 23 Thursday Portland Delegation Trip: Advancing Mass Timber Payment Portal October                23,\n                2025 TBD TBD Oct 27 Monday Public Safety Committee: Oakland Public Safety Forum with Mayor Lee October                27,\n                2025 3:00 PM - 4:00 PM Oakland City Hall, 1 Frank H. Ogawa Plaza, Oakland, CA 94612 Oct 28 Tuesday Women's Leadership Summit 2025 October                28,\n                2025 1:00 PM - 5:00 PM, followed by a networking reception TBA, San Jose, CA Women's Leadership Summit 2025 - dedicated to the advancement and empowerment of women leaders from different professions and industry sectors Nov 05 Wednesday China International Import Expo - California Pavilion November                5,\n                2025 9:00am-5:00pm Shanghai, China Inviting California companies to exhibit their products and services at the biggest import-focused exhibition in the world! Nov 17 Monday Energy Committee November                17,\n                2025 1:00 - 2:30 PM Pier 9, San Francisco, CA 94111 Subscribe to The Weekly Flash Subscribe Weekly Newsletter Submitted successfully! Hmm, something went wrong. About Us Terms Privacy Contact Us ©2025 Bay Area Council, All Rights Reserved News and Guts News and Guts Search Menu Left Angle Up Angle Down Angle Right Angle Left Arrow Right Arrow Email User Play Pause Fullscreen Exit Fullscreen Unmute Mute Close Loading Gallery Arrow Gallery Youtube Facebook Facebook Twitter Instagram LinkedIn Pinterest Google + Flickr Yelp Trip Advisor"
    },
    {
      "url": "https://bayarearenfest.com/faq/",
      "text": "FAQ | Bay Area Renaissance Festival Skip to content Plan Your Visit About Us Key Policies FAQ Contact Us Maps & Directions Bring Your Dog Tickets Buy Tickets Ticket Outlets Coupon Outlets Corporate & Groups Daily Events Deals & Discounts Experience The Realm Artisan Marketplace Contests Daily Programs Entertainment Festival Food Games & Rides New in 2025 Theme Weekends Once Upon A Time Highland Fling BARKbarian Brew Fest Heroes & Havoc Ladies & Lords Shopping Day Shamrocks & Shenanigans Viking Invasion Buccaneers & Ballgowns Get Involved Employment Full Run Vendor Applications Guest Vendor Applications Food Ind. Vendor Applications Sponsors & Partners Donations Weddings Kegs ‘N’ Eggs Menu Plan Your Visit About Us Key Policies FAQ Contact Us Maps & Directions Bring Your Dog Tickets Buy Tickets Ticket Outlets Coupon Outlets Corporate & Groups Daily Events Deals & Discounts Experience The Realm Artisan Marketplace Contests Daily Programs Entertainment Festival Food Games & Rides New in 2025 Theme Weekends Once Upon A Time Highland Fling BARKbarian Brew Fest Heroes & Havoc Ladies & Lords Shopping Day Shamrocks & Shenanigans Viking Invasion Buccaneers & Ballgowns Get Involved Employment Full Run Vendor Applications Guest Vendor Applications Food Ind. Vendor Applications Sponsors & Partners Donations Weddings Kegs ‘N’ Eggs FAQ GENERAL INFORMATION TICKET INFORMATION GUEST SERVICES Q: Is Parking Free? A: Yes! Parking is free. However, if you park in a spot of the park that is labeled “No Parking”, you will be towed. Please follow the parking attendants and directions for allowed parking. Q: What are the Dates and Hours of the Festival? A: We are open Saturdays and Sundays, February 15th – March 30th. Festival hours are rain or shine from 10am – 6pm. Q: Is the Renaissance Festival open during the week? A: The Festival is only open Saturday & Sundays. Q: Are you open during inclement weather? A: We are open rain or shine. We do not offer refunds in the event of inclement weather. Q: How do I sign up to receive the Bay Area Renaissance Festival digital newsletter about events and activities? A: You can sign up for the digital newsletter here ! Q: What time are the Jousts? A: The Joust is held 3 times daily at 12:30pm, 2:30pm and 4:30pm. This is FREE to enjoy and included with festival admission. Q: Can I bring my dog? A: Yes, the Festival is Dog Friendly! See our dog rules and registration page for more info! Q: Can I bring prop or peace-tied weapons? A: Yes, any sort of foam, plastic, cardboard, toy or prop weapon is allowed. Real Swords, Knives, Dirks and Daggers are allowed, BUT they must be completely sheathed and peace-tied. Longbows are allowed as long as they are not strung. BUT arrows with tips are not allowed unless you are competing in the longbow competition that day. The Festival bans guns on our premise. Real Axes, Claymores, Maces, Antique Firearms, Pikes and Halberds are NOT allowed on the Festival site. No drawing of any weapon at any time. Must be 18 years or older to carry a weapon. If you have additional questions, please contact the Festival Office for more information at 352-999-5946. Q: What are your gluten free options? What about vegetarian options? What do I do if I’m allergic to many of the food products you serve? A: The Renaissance Festival makes every effort to accommodate the needs of our guests. If you adhere to a specific dietary regiment or have food allergies, the following Gluten Free and Vegetarian options are available to guests with special dietary requirements. Please refer to the festival program booklet for locations which you receive at the gate entrance. Due to high volume production, The Renaissance Festival food locations cannot accommodate or guarantee separation of cooking surfaces. Those guests who suffer from sensitive or life-threatening allergies (such as peanuts, tree nuts, soy, milk, eggs and wheat) should exercise extreme caution as foods are transported, stored and prepared in close proximity. Mid America Festivals is providing this information for informational purposes only. Neither MAF, its subsidiaries, affiliates, suppliers, vendors and/or employees assume responsibility for sensitivity or allergy to any food product or ingredient provided by or in our festival. Q: Is the Festival wheelchair accessible? A: The Festival is held in a natural, outdoor setting. Wheelchairs and motorized wheelchairs are allowed.  We have disabled accessible parking, and disabled accessible portable toilets. Be certain to notify parking attendants of your need for accessible parking. Q: If I leave the Festival, can I get back in? A: Yes. Please have your hand stamped at the gate when you leave. When you re-enter the Park, show your stamped hand for re-entry. Festival only allows same day re-entry to the grounds. Re-admission is not allowed after 6pm. Q: Are outside food and beverages allowed? A: The Bay Area Renaissance Festival does NOT allow outside food or beverages through our gates unless the food is a medical necessity such as infant formula/baby food. (The Festival will allow one (1) unopened (factory sealed) 20 oz bottle of water per person to be brought through the front gate.) NO re-useable/re-fillable bottles are allowed. All flasks must be empty before entering the Festival gates! You may bring a cooler to leave in your car if you wish. If you choose to do so it must remain in your car. Patrons are welcome to leave through our gates, receive a hand stamp, return to their car and reenter through our gates later during the same day. Please note: all bags are inspected at the front gate! (This is for our employee’s and patron’s safety!) If you have any questions, please call 352-999-5946. Q: How much are tickets? A: Check out our Ticket Pricing & Info here. Click here to purchase tickets online! Q: What does the admission price include? A: Enjoy the Full Festival Experience! Your admission ticket gives you access to all the exciting stage shows, including thrilling jousting competitions! Be wowed by the skill and daring of the knights as they clash in exhilarating displays of medieval combat. Of course, the fun doesn’t stop there! Feel free to browse our selection of unique arts and crafts, perfect for finding one-of-a-kind treasures. We also offer a variety of delicious food and refreshing beverages to keep you fueled throughout the day. And if you’re looking for a bit of extra excitement, be sure to check out our rides and games! With options for all ages and interests, there’s something for everyone. Please note that while access to the stage shows is included, additional costs may apply for arts and crafts, food and beverages, and rides and games. We hope you have a fantastic time at the festival! Q: Do you offer Discount Tickets? A: Please check our Deals & Discounts page . It displays each theme weekend ticket promotions. Q: Are there special discounts for Military Service Members or First Responders? A: Yes. Active military, vets, & first responders receive $5.00 off their gate admission with the proper ID. Festival Friday, all military & 1st responders get in FREE. Q: Are Weekend Festival Admission passes available? A: Yes, Weekend Passes are good for two Adult Festival entrances for one person. Passes are non-transferable. Note: Weekend Pass Holders will check in with the Festival Box Office and pick up two (2) admission tickets upon arrival. Purchase your Weekend Pass here. Q: If I wear a costume, can I get in free? A: No, but we have a costume contest that occurs every day. Check our downloadable weekly schedule under each theme weekend to review the time and location of the contest. Q: Is there an ATM Machine? A: Yes. 10 ATM machines are located on the Festival grounds. See where on the Festival Map Q: Where can I breastfeed at the Festival? A: Unfortunately, we do not have an area for breast feeding. Q: Where Is The Lost And Found? A: If you’ve lost an item, please visit the webpage here and fill out the form to get instructions on locating and collecting your item. Buy Tickets Daily Events Maps & Directions Menu Buy Tickets Daily Events Maps & Directions Receive the News of the Realm in they Inbox! Email First Name Last Name Rejoice! News of the Realm shall now grace thy inbox. Watch for forthcoming merriment! Subscribe Copyright © 2025. Mid America Festivals. All rights reserved. Developed by Digital Architects Manage Consent We use cookies to enhance the functionality and performance of this site. By continuing to browse, you consent to the use of cookies and data collection for marketing and site improvement purposes. Please note that declining cookies may affect the site’s functionality. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent"
    },
    {
      "url": "https://bayarearenfest.com/about-us/",
      "text": "About Us Skip to content Plan Your Visit About Us Key Policies FAQ Contact Us Maps & Directions Bring Your Dog Tickets Buy Tickets Ticket Outlets Coupon Outlets Corporate & Groups Daily Events Deals & Discounts Experience The Realm Artisan Marketplace Contests Daily Programs Entertainment Festival Food Games & Rides New in 2025 Theme Weekends Once Upon A Time Highland Fling BARKbarian Brew Fest Heroes & Havoc Ladies & Lords Shopping Day Shamrocks & Shenanigans Viking Invasion Buccaneers & Ballgowns Get Involved Employment Full Run Vendor Applications Guest Vendor Applications Food Ind. Vendor Applications Sponsors & Partners Donations Weddings Kegs ‘N’ Eggs Menu Plan Your Visit About Us Key Policies FAQ Contact Us Maps & Directions Bring Your Dog Tickets Buy Tickets Ticket Outlets Coupon Outlets Corporate & Groups Daily Events Deals & Discounts Experience The Realm Artisan Marketplace Contests Daily Programs Entertainment Festival Food Games & Rides New in 2025 Theme Weekends Once Upon A Time Highland Fling BARKbarian Brew Fest Heroes & Havoc Ladies & Lords Shopping Day Shamrocks & Shenanigans Viking Invasion Buccaneers & Ballgowns Get Involved Employment Full Run Vendor Applications Guest Vendor Applications Food Ind. Vendor Applications Sponsors & Partners Donations Weddings Kegs ‘N’ Eggs Welcome to the 2025 Bay Area Renaissance Festival! The Bay Area Renaissance Festival is celebrating its 47th season! Come and be a part of this long-standing tradition by visiting the festival grounds in Dade City, FL. WEEKENDS FEBRUARY 15TH – MARCH 30TH INCLUDING LADIES AND LORDS SHOPPING DAY ON MARCH 9TH 10AM – 6PM RAIN OR SHINE! About Us About the Bay Area Renaissance Festival Since its debut in Largo, Florida, the Bay Area Renaissance Festival has grown into one of Florida’s most beloved annual traditions. Set in the heart of Dade City, our vibrant festival invites guests to step into a 16th-century European village with 15 stages of entertainment, over 100 talented artisans, and immersive historical experiences. As we celebrate our 47th season, we welcome families, history buffs, and adventure seekers to experience an unforgettable world of fun, feasts, and festivities for all ages! For more information about Mid-America Festivals visit our website! Buy Tickets Daily Events Maps & Directions Menu Buy Tickets Daily Events Maps & Directions Receive the News of the Realm in they Inbox! Email First Name Last Name Rejoice! News of the Realm shall now grace thy inbox. Watch for forthcoming merriment! Subscribe Copyright © 2025. Mid America Festivals. All rights reserved. Developed by Digital Architects Manage Consent We use cookies to enhance the functionality and performance of this site. By continuing to browse, you consent to the use of cookies and data collection for marketing and site improvement purposes. Please note that declining cookies may affect the site’s functionality. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent"
    },
    {
      "url": "https://bayarearenfest.com/maps-and-directions/",
      "text": "| Bay Area Renaissance Festival Skip to content Plan Your Visit About Us Key Policies FAQ Contact Us Maps & Directions Bring Your Dog Tickets Buy Tickets Ticket Outlets Coupon Outlets Corporate & Groups Daily Events Deals & Discounts Experience The Realm Artisan Marketplace Contests Daily Programs Entertainment Festival Food Games & Rides New in 2025 Theme Weekends Once Upon A Time Highland Fling BARKbarian Brew Fest Heroes & Havoc Ladies & Lords Shopping Day Shamrocks & Shenanigans Viking Invasion Buccaneers & Ballgowns Get Involved Employment Full Run Vendor Applications Guest Vendor Applications Food Ind. Vendor Applications Sponsors & Partners Donations Weddings Kegs ‘N’ Eggs Menu Plan Your Visit About Us Key Policies FAQ Contact Us Maps & Directions Bring Your Dog Tickets Buy Tickets Ticket Outlets Coupon Outlets Corporate & Groups Daily Events Deals & Discounts Experience The Realm Artisan Marketplace Contests Daily Programs Entertainment Festival Food Games & Rides New in 2025 Theme Weekends Once Upon A Time Highland Fling BARKbarian Brew Fest Heroes & Havoc Ladies & Lords Shopping Day Shamrocks & Shenanigans Viking Invasion Buccaneers & Ballgowns Get Involved Employment Full Run Vendor Applications Guest Vendor Applications Food Ind. Vendor Applications Sponsors & Partners Donations Weddings Kegs ‘N’ Eggs Maps & Directions HOW TO GET TO THE KINGDOM DIRECTIONS TO THE FESTIVAL GROUNDS 12838 Auton Rd, Dade City, FL 33525 Located just off Highway 301 in Dade City, Florida From I-75: Take the exit onto County Road 52 and head east toward Dade City. Follow the road to Enterprise Dr., which leads directly to Auton Rd From the North: Take Highway 301 south to (Clinton Rd) CR 52, head east, and follow the festival entrance signs From the South: Take Highway 301 north to (Clinton Rd) CR 52, head east, and follow the festival entrance signs FREE PARKING Thanks to Camping World, FREE PARKING is available near the festival entrance for all guests! ACCESSIBLE PARKING We’re dedicated to ensuring a magical experience for everyone! Accessible parking is available near the entrance, just follow the signs to designated spots. If you need any assistance, our friendly staff is happy to help! We can’t wait to welcome you to the kingdom! Buy Tickets Daily Events Maps & Directions Menu Buy Tickets Daily Events Maps & Directions Receive the News of the Realm in they Inbox! Email First Name Last Name Rejoice! News of the Realm shall now grace thy inbox. Watch for forthcoming merriment! Subscribe Copyright © 2025. Mid America Festivals. All rights reserved. Developed by Digital Architects Manage Consent We use cookies to enhance the functionality and performance of this site. By continuing to browse, you consent to the use of cookies and data collection for marketing and site improvement purposes. Please note that declining cookies may affect the site’s functionality. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent"
    },
    {
      "url": "https://bayarearenfest.com/2025-attractions/",
      "text": "Attractions | Bay Area Renaissance Festival Skip to content Plan Your Visit About Us Key Policies FAQ Contact Us Maps & Directions Bring Your Dog Tickets Buy Tickets Ticket Outlets Coupon Outlets Corporate & Groups Daily Events Deals & Discounts Experience The Realm Artisan Marketplace Contests Daily Programs Entertainment Festival Food Games & Rides New in 2025 Theme Weekends Once Upon A Time Highland Fling BARKbarian Brew Fest Heroes & Havoc Ladies & Lords Shopping Day Shamrocks & Shenanigans Viking Invasion Buccaneers & Ballgowns Get Involved Employment Full Run Vendor Applications Guest Vendor Applications Food Ind. Vendor Applications Sponsors & Partners Donations Weddings Kegs ‘N’ Eggs Menu Plan Your Visit About Us Key Policies FAQ Contact Us Maps & Directions Bring Your Dog Tickets Buy Tickets Ticket Outlets Coupon Outlets Corporate & Groups Daily Events Deals & Discounts Experience The Realm Artisan Marketplace Contests Daily Programs Entertainment Festival Food Games & Rides New in 2025 Theme Weekends Once Upon A Time Highland Fling BARKbarian Brew Fest Heroes & Havoc Ladies & Lords Shopping Day Shamrocks & Shenanigans Viking Invasion Buccaneers & Ballgowns Get Involved Employment Full Run Vendor Applications Guest Vendor Applications Food Ind. Vendor Applications Sponsors & Partners Donations Weddings Kegs ‘N’ Eggs Attractions Aerial Silks Area 12:00 PM, 2:00PM, & 4:00 PM  ⋅ Aerial Silk Fantasy Birds of Prey 11:00 AM, 1:00PM, & 4:00 PM  ⋅ Knightwings Bird of Prey Chess Field 11:00 AM ⋅ Grievance Circle 12:00 PM ⋅ Tournament 1:45 PM ⋅ Pirate Recruitment 3:30 PM ⋅ Chess Match 4:20 PM ⋅ Soal Cakes Florida Swamp Knights Arena 11:00 AM, 1:00 PM, & 3:00 PM  ⋅ Florida Swamp Knights Maypole TIME EVENT 10:00 AM Opening Dance 11:00 AM Villagers Maypole Dance 12:00 PM Villagers Maypole Dance 1:30 PM Mayors Maypole 2:30 PM Villagers Maypole Dance 4:30 PM Chaos Maypole 5:30 PM Unwinding Maypole Mermaid Cove 11:00 AM – 5:30 PM ⋅ Trident Trails Parade 11:30 AM ⋅ Parade Wheel of Death Arena 12:00 PM, 2:00 PM, & 4:00 PM  ⋅ Wheel of Death 3 Eyed Raven Pub Time Event 10:15 AM Lorelei of Florida 11:00 AM Fiddle and Fret 12:15 PM Lorelei of Florida 1:00 PM Soal Cakes 1:45 PM Lorelei of Florida 3:15 PM Fiddle and Fret 4:30 PM Lorelei of Florida Buy Tickets Daily Events Maps & Directions Menu Buy Tickets Daily Events Maps & Directions Receive the News of the Realm in they Inbox! Email First Name Last Name Rejoice! News of the Realm shall now grace thy inbox. Watch for forthcoming merriment! Subscribe Copyright © 2025. Mid America Festivals. All rights reserved. Developed by Digital Architects Manage Consent We use cookies to enhance the functionality and performance of this site. By continuing to browse, you consent to the use of cookies and data collection for marketing and site improvement purposes. Please note that declining cookies may affect the site’s functionality. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent"
    },
    {
      "url": "https://www.bayarearenfest.com/contact/",
      "text": "Contact us | Bay Area Renaissance Festival Skip to content Plan Your Visit About Us Key Policies FAQ Contact Us Maps & Directions Bring Your Dog Tickets Buy Tickets Ticket Outlets Coupon Outlets Corporate & Groups Daily Events Deals & Discounts Experience The Realm Artisan Marketplace Contests Daily Programs Entertainment Festival Food Games & Rides New in 2025 Theme Weekends Once Upon A Time Highland Fling BARKbarian Brew Fest Heroes & Havoc Ladies & Lords Shopping Day Shamrocks & Shenanigans Viking Invasion Buccaneers & Ballgowns Get Involved Employment Full Run Vendor Applications Guest Vendor Applications Food Ind. Vendor Applications Sponsors & Partners Donations Weddings Kegs ‘N’ Eggs Menu Plan Your Visit About Us Key Policies FAQ Contact Us Maps & Directions Bring Your Dog Tickets Buy Tickets Ticket Outlets Coupon Outlets Corporate & Groups Daily Events Deals & Discounts Experience The Realm Artisan Marketplace Contests Daily Programs Entertainment Festival Food Games & Rides New in 2025 Theme Weekends Once Upon A Time Highland Fling BARKbarian Brew Fest Heroes & Havoc Ladies & Lords Shopping Day Shamrocks & Shenanigans Viking Invasion Buccaneers & Ballgowns Get Involved Employment Full Run Vendor Applications Guest Vendor Applications Food Ind. Vendor Applications Sponsors & Partners Donations Weddings Kegs ‘N’ Eggs Contact us Contact us Festival Site Address 12838 Auton Rd., Dade City, FL 33525 Office Phone Number 352-999-5946 Office Email Address info@bayarearenfest.com Buy Tickets Daily Events Maps & Directions Menu Buy Tickets Daily Events Maps & Directions Receive the News of the Realm in they Inbox! Email First Name Last Name Rejoice! News of the Realm shall now grace thy inbox. Watch for forthcoming merriment! Subscribe Copyright © 2025. Mid America Festivals. All rights reserved. Developed by Digital Architects Manage Consent We use cookies to enhance the functionality and performance of this site. By continuing to browse, you consent to the use of cookies and data collection for marketing and site improvement purposes. Please note that declining cookies may affect the site’s functionality. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent"
    },
    {
      "url": "https://communityimpact.com/houston/bay-area/government/2025/05/21/texas-renaissance-festival-founder-george-coulam-dies/",
      "text": "Texas Renaissance Festival founder George Coulam dies | Community Impact | Houston Advertise | Careers | Company Info | Support Us events subscribe LOGIN Select your community Support Us News Austin Metro Austin Metro Austin Metro Home Bastrop | Cedar Creek Cedar Park | Far Northwest Austin Georgetown Lake Travis | Westlake Leander | Liberty Hill North Central Austin Northwest Austin Pflugerville | Hutto Round Rock San Marcos | Buda | Kyle South Central Austin Southwest Austin | Dripping Springs Houston Metro Houston Metro Houston Metro Home Bay Area Bellaire | Meyerland | West University Conroe | Montgomery Cy-Fair | Jersey Village Cypress Heights | River Oaks | Montrose Katy | Fulshear Lake Houston | Humble | Kingwood New Caney | Porter Pearland | Friendswood | Manvel Spring | Klein Sugar Land | Missouri City The Woodlands Tomball | Magnolia Dallas | Fort Worth Metro Dallas | Fort Worth Metro Dallas | Fort Worth Metro Home Flower Mound | Highland Village | Argyle Frisco Grapevine | Colleyville | Southlake Keller | Roanoke | Northeast Fort Worth McKinney Plano North Plano South Prosper | Celina Richardson San Antonio Metro San Antonio Metro San Antonio Metro Home Boerne | Fair Oaks Ranch New Braunfels North San Antonio Northeast San Antonio Metrocom Company Topics Topics Business Development Dining Education Election Government Health Care Real Estate Transportation Email Newsletter E-Edition Advertise Company Company About Blog Careers Circulation Contact Our Team Support Us Printing CI Storytelling Support Us Today Event Calendar Texas Renaissance Festival founder George Coulam dies Trending now Texas Legislature ‘This will save lives’: New Texas laws require summer camps to ... Texas Legislature What to know: Most Texas school districts required to display donated ... Texas Legislature Second special session ends without new laws on THC, property taxes Texas Legislature Cellphone ban, library materials: 8 new Texas laws impacting public schools Government Harris County commissioners reject 64% pay raise for county’s 8 elected ... Government Tomball Fire Station No. 5 installs Harris County’s first Safe Haven ... Sponsored New laws, ongoing debates: The challenges Houston-area schools face this school ... Government Lina Hidalgo talks childhood education, reelection announcement in State of the ... Dining New restaurant, sip lounge opens in Seabrook Dining Margarita Jones looks to open by end of September Houston Bay Area Government Houston Texas Renaissance Festival founder George Coulam dies By Lizzy Spangler | 3:48 PM May 21, 2025 CDT Updated 3:48 PM May 21, 2025 CDT George Coulam founded the Texas Renaissance Festival in 1974. (Dylan McEwan/Texas Renaissance Festival) George Coulam founded the Texas Renaissance Festival in 1974. (Dylan McEwan/Texas Renaissance Festival) George Coulam, who founded the Texas Renaissance Festival and served as first mayor of Todd Mission, died May 21, according to a May 21 news release from the city of Todd Mission. Coulam was found deceased in his home, and the cause of death is under investigation by the Todd Mission Police Department, the Grimes County Sheriff’s Office and the Texas Rangers, according to the news release. Some context Coulam founded the Texas Renaissance Festival in 1974, and incorporated the city of Todd Mission in 1982, according to the news release. He also served as Todd Mission’s first and only mayor until May 8. In 2024, the Texas Renaissance Festival—which offers a recreation of a 16th-century European village with various attractions, vendors and entertainment—celebrated 50 years, Community Impact previously reported. In case you missed it On May 7, Grimes County District Judge Gary W. Chaney ordered the sale of the Texas Renaissance Festival along with over $23 million in damages and attorneys’ fees awarded to the plaintiffs following a lawsuit filed against the festival, Community Impact previously reported. What they’re saying “The city of Todd Mission offers its deepest condolences to Mr. Coulam’s family and friends. We request privacy for those affected and will provide updates as appropriate,” Todd Mission officials said via news release. “We are deeply saddened by the loss of George Coulam, founder of the Texas Renaissance Festival. For more than 50 years, he built a community that has become a cherished tradition for generations of performers, staff, and guests. At this time, we ask for respect and privacy for Mr. Coulam’s family and the extended Texas Renaissance Festival family as they grieve,” Texas Renaissance Festival officials said in a May 21 Facebook post. By Lizzy Spangler Editor Lizzy serves as editor for the Conroe/Montgomery and Tomball/Magnolia editions of Community Impact . Joining CI in August 2022, she covered government for Conroe, Jersey Village, Magnolia, Montgomery and Tomball prior to becoming editor. When not working, Lizzy enjoys hanging out with her dog, Twix, or watching reality TV. Thanks for reading! Daily news about your community is free , and your support is invaluable . Give $10 now towards CI's journalistic mission across Texas. Become a CI Patron Austin Metro Austin Metro Home Bastrop | Cedar Creek Cedar Park | Far Northwest Austin Georgetown Lake Travis | Westlake Leander | Liberty Hill North Central Austin Northwest Austin Pflugerville | Hutto Round Rock San Marcos | Buda | Kyle South Central Austin Southwest Austin | Dripping Springs Houston Metro Houston Metro Home Bay Area Bellaire | Meyerland | West University Conroe | Montgomery Cy-Fair | Jersey Village Cypress Heights | River Oaks | Montrose Katy | Fulshear Lake Houston | Humble | Kingwood New Caney | Porter Pearland | Friendswood | Manvel Spring | Klein Sugar Land | Missouri City The Woodlands Tomball | Magnolia Dallas | Fort Worth Metro Dallas | Fort Worth Metro Home Flower Mound | Highland Village | Argyle Frisco Grapevine | Colleyville | Southlake Keller | Roanoke | Northeast Fort Worth McKinney Plano North Plano South Prosper | Celina Richardson San Antonio Metro San Antonio Metro Home Boerne | Fair Oaks Ranch New Braunfels North San Antonio Northeast San Antonio Metrocom Austin Metro Austin Metro Home Bastrop - Cedar Creek Cedar Park - Far Northwest Austin Georgetown Lake Travis - Westlake Leander - Liberty Hill North Central Austin Northwest Austin Pflugerville - Hutto Round Rock San Marcos - Buda - Kyle South Central Austin Southwest Austin - Dripping Springs Houston Metro Houston Metro Home Bay Area Bellaire - Meyerland - West University Conroe - Montgomery Cy-Fair - Jersey Village Cypress Heights - River Oaks - Montrose Katy - Fulshear Lake Houston - Humble - Kingwood New Caney - Porter Pearland - Friendswood - Manvel Spring - Klein Sugar Land - Missouri City The Woodlands Tomball - Magnolia Dallas - Fort Worth Metro Dallas - Fort Worth Metro Home Flower Mound - Highland Village - Argyle Frisco Grapevine - Colleyville - Southlake Keller - Roanoke - Northeast Fort Worth McKinney Plano North Plano South Prosper - Celina Richardson San Antonio Metro San Antonio Metro Home Boerne - Fair Oaks Ranch New Braunfels North San Antonio Northeast San Antonio Metrocom Facebook Instagram LinkedIn Youtube (866) 989-6808 TERMS OF SERVICE | PRIVACY POLICY | Cookie Preferences © 2005-2025 Community Impact Newspaper Co. All rights reserved."
    },
    {
      "url": "https://bayarearenfest.com/entertainment/",
      "text": "Entertainment | Bay Area Renaissance Festival Skip to content Plan Your Visit About Us Key Policies FAQ Contact Us Maps & Directions Bring Your Dog Tickets Buy Tickets Ticket Outlets Coupon Outlets Corporate & Groups Daily Events Deals & Discounts Experience The Realm Artisan Marketplace Contests Daily Programs Entertainment Festival Food Games & Rides New in 2025 Theme Weekends Once Upon A Time Highland Fling BARKbarian Brew Fest Heroes & Havoc Ladies & Lords Shopping Day Shamrocks & Shenanigans Viking Invasion Buccaneers & Ballgowns Get Involved Employment Full Run Vendor Applications Guest Vendor Applications Food Ind. Vendor Applications Sponsors & Partners Donations Weddings Kegs ‘N’ Eggs Menu Plan Your Visit About Us Key Policies FAQ Contact Us Maps & Directions Bring Your Dog Tickets Buy Tickets Ticket Outlets Coupon Outlets Corporate & Groups Daily Events Deals & Discounts Experience The Realm Artisan Marketplace Contests Daily Programs Entertainment Festival Food Games & Rides New in 2025 Theme Weekends Once Upon A Time Highland Fling BARKbarian Brew Fest Heroes & Havoc Ladies & Lords Shopping Day Shamrocks & Shenanigans Viking Invasion Buccaneers & Ballgowns Get Involved Employment Full Run Vendor Applications Guest Vendor Applications Food Ind. Vendor Applications Sponsors & Partners Donations Weddings Kegs ‘N’ Eggs Entertainment Explore the entertainment at our Festival below! JOUSTING ATTRACTIONS STREET ACTS STAGE ACTS New in 2025 Fuego Del Sol A spellbinding fusion of fire and movement that will leave you breathless! Watch as flames dance and sparks fly in this mesmerizing performance, where skill and artistry ignite to create an unforgettable spectacle. Don’t miss this fiery display of magic and mastery! You can find Fuego Del Sol at the Tower Stage Cap’n Sean Magic The Cap’n Sean – Pirate Magician Show featuring Mirf the Magnificent! Enjoy a unique magic show that will amuse and astound you. Family friendly show enjoyed by all ages. The Cap’n and Mirf are available after every show for a meet and greet. You can find Cap’n Sean Magic at the Legends Stage! Madd Hatters Circus Sideshow Get ready for a wild ride with the Madd Hatters Circus Sideshow on the NEW Buccaneer Bay Stage—a hilarious, interactive thrill ride of a show you won’t soon forget! Hosted by the daring Madd Finn and the fearless Danger Drew! You can find the Madd Hatters Circus Show at the Buccaneer Island Stage! Tortuga Twins COME ONE, COME ALL, the Tortuga twins have returned to their home festival with a new round of rapscallions to delight audiences across the land. Callisto the handsome, Valentine the passionate, and Tuleo the easy one gracing the stage once again for the Bay Area renaissance festival. Come for the laughter and stay for the tight pants! The Tortuga Twins can be found at the Washing Well Stage ! Nissa the Gnome Nissa the Gnome roams the world bringing luck and laughter to audiences of all ages. As a professional improv storyteller, Nissa delights in inventing custom stories based on patrons’ suggestions and creating a unique and engaging experience for everyone! You can find Nissa the Gnome wandering the streets of our realm! Tampa Taiko Tampa Taiko isn’t just a drumming ensemble; we’re a cultural experience that brings the energy and spirit of traditional Japanese drumming to life. Their shows are designed to be engaging and interactive. Each performance is accompanied by a rich narrative that dives into the history and significance of Taiko drumming! You can find Tampa Taiko on the Tower Stage ! Midwife Crisis Are you ready to experience childbirth like NEVER before? Brace yourselves for “Midwife Crisis,” where comedy and ‘child-rearing’ collide in the most hilarious way possible! Led by Midwife Blair Hoskins, this show is bursting with whimsy, adult subject matter, and yes, even onions! You can find Midwife Crisis at the Haywire Circus Stage! Special Buccaneers & Ballgowns Entertainment! Come watch the Cast in Bronze and the Tampa Swamp Knights during our final weekend ONLY! Tampa Swamp Knights The Tampa Swamp Knights are professional fighters in Buhurt!  Buhurt is medieval armored combat: imagine MMA with medieval authentic armor, and fights ranging from duels, profights, and group versus group melees! This is un-choreographed full contact fighting at its most extreme! You can find the Tampa Swamp Knights in the Florida Swamp Knights Arena! Cast in Bronze The beautifully haunting sound of Cast in Bronze is like no other experience in the world! The world’s only touring artist performing hits to yesterday, today and tomorrow featuring a transportable Carillon. Performing unique arrangements of epic themes, Cast in Bronze is truly unforgettable! You can find the Cast in Bronze in the Wedding Area ! Featured Entertainment Emrys Fleet – Ratcatcher Emrys Fleet bring easy laughter with his performing rat, Pesky! Featuring Wilbur the Dancing Weasel, his comedy will blindside you! For all 46 season the Big Rat Show has been a staple for young and old alike! Bring the whole family to discover the joy that is the Rat Extravaganza! You can find Emrys Fleet at the Rat Cellar Stage ! Ace & Rosie – The Courting Jesters Not just Jesters of the court, but courters of the heart! Ace and Rosie are a delightful duo of fools that will have you falling in love with their unbelievable talent and undeniable chemistry! The Courting Jesters is a unique spectacle that combines talent, comedy, danger and romance. Ace & Rosie are a must-see for all ages! You can find Ace & Rosie at the Seahorse Stage ! Damh and Dove Mixing the power of the bagpipes with the heart pounding beat of the drums, this family-friendly experience of music will take you on a journey to the field of Athernry. This musical display is truly the reflection of a passion and love of the oldest art forms in the world! You can find Damh and Dove at the Tower Stage ! Lorelei of Florida Original pirate music, comedy, traditional Celtic music, and piratical shenanigans! We are a PG-13 show with the occasion a bit naughty and bawdy, but always able to read an audience and pivot to fully family-friendly fun. Welcome to the Crew of the Lorelei! You can find Lorelei of Florida at the 3 Eyed Raven Pub ! Drakaina Fiero – Dragon Trainer Meet Drakaina and her dragons! Flacaria, a 2-year old Romanian Red, whose name means “Flame” in Romanian and Szikra, a 6-month Hungarian Green, whose name means “Spark” in Hungarian. Pet the dragons and take your picture with them. Aspiring dragon trainers might even be lucky enough to be awarded a dragon scale! You can find Drakaina Fiero wandering the streets of the realm! Buy Tickets Daily Events Maps & Directions Menu Buy Tickets Daily Events Maps & Directions Receive the News of the Realm in they Inbox! Email First Name Last Name Rejoice! News of the Realm shall now grace thy inbox. Watch for forthcoming merriment! Subscribe Copyright © 2025. Mid America Festivals. All rights reserved. Developed by Digital Architects Manage Consent We use cookies to enhance the functionality and performance of this site. By continuing to browse, you consent to the use of cookies and data collection for marketing and site improvement purposes. Please note that declining cookies may affect the site’s functionality. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent"
    },
    {
      "url": "https://variety.com/2025/tv/obituaries-people-news/george-coulam-dead-ren-faire-1236406162/",
      "text": "George Coulam Dead: 'Ren Faire' Star, Renaissance Fest Founder Was 87 George Coulam Dead: 'Ren Faire' Star, Renaissance Fest Founder Was 87 Plus Icon Film Plus Icon TV Plus Icon What To Watch Plus Icon Music Plus Icon Docs Plus Icon Digital & Gaming Plus Icon Global Plus Icon Awards Circuit Plus Icon Video Plus Icon What To Hear Plus Icon Click to expand the Mega Menu Plus Icon Click to Expand Search Input Got a Tip? Newsletters Switch edition between U.S. Edition Asia Edition Global Edition U.S. Asia Global Variety Login Account Variety Digital Variety Archives VIP+ Welcome Manage Account View Variety Archives Variety Digital Login Subscribe Log Out Login Open Drodpwon Menu Account Open Drodpwon Menu Variety Digital Variety Archives VIP+ Welcome Manage Account View Variety Archives Variety Digital Login Subscribe Log Out Plus Icon Click to expand the Mega Menu Plus Icon Click to Expand Search Input Variety Plus Icon Read Next: CBS Reveals Fall Release Dates For ‘The Young and the Restless,’ ‘Beyond the Gates’ and More (TV News Roundup) Login Account Variety Digital Variety Archives VIP+ Welcome Manage Account View Variety Archives Variety Digital Login Subscribe Log Out Login Open Drodpwon Menu Account Open Drodpwon Menu Variety Digital Variety Archives VIP+ Welcome Manage Account View Variety Archives Variety Digital Login Subscribe Log Out Home TV Obituaries May 21, 2025 2:29pm PT George Coulam, ‘Ren Faire’ Docuseries Subject and Founder of Texas Renaissance Festival, Dies at 87 By J. Kim Murphy Plus Icon J. Kim Murphy jkimmurphy Latest Tyler Perry Accuser Derek Dixon Details Sexual Assault Allegations in TV Interview: ‘I Thought It Would Stop … and It Didn’t’ 1 day ago Brooklyn Horror Film Festival Unveils 2025 Lineup: Zombie Drag Queens, Two World Premieres and an Ernest Dickerson Tribute 2 days ago Michael Caine Coming Out of Retirement at 92 Years Old for Vin Diesel’s ‘Last Witch Hunter 2’ at Lionsgate 3 days ago See All HBO George Coulam , the founder and longstanding owner of the Texas Renaissance Festival whose eclectic lifestyle and hunt for a successor were documented in the 2024 HBO docuseries “ Ren Faire ,” was found dead in his home in Todd Mission, Texas on Wednesday morning. He was 87. An investigation remains ongoing and a cause of death is not known at this time. The Todd Mission Police Department was dispatched to Coulam’s residence, adjacent to the Renaissance Festival’s premises, on Wednesday morning. The Grimes County Sheriff’s Office and Texas Rangers were present for assistance. Coulam was pronounced dead by authorities upon arrival. Related Stories How Angelina Jolie’s Health Journey Inspired Alice Winocour’s Paris Ensemble ‘Couture': ‘It Was Quite Healing in Many Ways’ Kaitlyn Dever, Meghann Fahy and Issa Rae Among Through Her Lens Jurors “To our Texas Renaissance family and friends, we are deeply saddened by the loss of George Coulam, founder of the Texas Renaissance Festival,” the Texas Renaissance Festival wrote in a statement on social media. “For more than 50 years, he built a community that has become a cherished tradition for generations of performers, staff and guests. At this time, we ask for respect and privacy for Mr. Coulam’s family and the extended Texas Renaissance Festival family as they grieve.” Popular on Variety Coulam’s death comes less than two weeks after a Grimes County District court ordered the Texas Renaissance Festival must be sold, ending a nearly two-year civil case. In the decision, Judge Gary W. Chaney of the 506th state District Court, also ordered that Coulam must pay over $23 million in damages to cover attorney’s fees and money lost by the fest’s buyer. The suit alleged that a group of RW Lands Inc., says Texas Stargate, Inc., Royal Campground, Inc., and Texas RF, Inc. agreed to purchase the Festival, property and assets from Coulam for $60 million. The plaintiff claimed that Coulam and his associates did not provide required documents for the sale and that the original owners failed to close the transaction by its agreed-upon date. Coulam denied the allegations. Coulam founded the Texas Renaissance Festival in 1974 and has overseen its growth into the largest such gathering in the United States. Along with the court order to sell, Coulam also lost office as the mayor of the fest’s premises, Todd Mission, in early May. He had been the only mayor of the town since its 1982 incorporation until losing re-election this year, with city council member Stephen Mensing sworn in. The operations of the Texas Renaissance Festival, infamous among locals, were documented in the 2024 HBO docuseries “Ren Faire,” which followed Coulam’s less-than-motivated search for a successor to lead the festival, and the surrounding business affiliates vying to take over operations. The three-episode run also included details of Coulam’s dedicated online dating pursuits and his unforgiving temperament around his staff. The series’ events concluded prior to the emergence of the recent civil lawsuit against Coulam that reached an end in early May. “Functionally, he actually is a king. He’s created a real-life fiefdom,” series director and executive producer Lance Oppenheim told Variety in an interview before the series premiered. “The first thing he said to me was ‘I used to play the king, but now I’m a horny old man. I want to find someone that can take care of the festival.’ These were the things just flowing out of him. He was maybe looking for an outlet — somebody that he has no control over. He doesn’t have any friends that he doesn’t employ.” Coulam faced other legal troubles in recent years, including allegations of sexual harassment and wrongful termination. The festival settled a 2021 lawsuit filed by a former employee, who claimed that Coulam made her sift through “sugar daddy” websites to facilitate his romantic life. Read More About: George Coulam, Ren Faire Jump to Comments More from Variety Trump Reacts to Shooting of MAGA Influencer Charlie Kirk: ‘God Bless Him!’ ‘Barrio Triste’ Director Stillz on the Personal History Behind His Found Footage Crime Epic and How Making Bad Bunny’s Music Videos Fuels His Creativity — TIFF Quinta Brunson, Disney TV’s Craig Erwich, John Stamos Join Variety Entertainment and Technology Summit Programming PlayStation-Backed Indian Gaming Studio Casts Film Stars for Narrative Adventure ‘Mukti’ (EXCLUSIVE) Italy’s the Open Reel Snags Brazilian Drama ‘Dolores’ Ahead of San Sebastián Film Fest World Premiere, Debuts Trailer (EXCLUSIVE) ‘Sound of Freedom’ Distributor Angel Studios Closes Deal to Become Publicly Traded Company Valued at $1.6 Billion JavaScript is required to load the comments. Loading comments... Most Popular Matthew Dowd Fired From MSNBC for Charlie Kirk Comments Glen Powell Says Chris Pratt in ‘Guardians of the Galaxy’ Changed Hollywood Leading Men: You Can Be ‘Sillier’ and Not Just ‘Brooding’ Like Robert… ‘Superman’ Sequel ‘Man of Tomorrow’ Is the Story of Superman and Lex Luthor Teaming Up Against a ‘Much Bigger Threat’; Filming Eyes April 2026… Daniel Day-Lewis Speaks Out on Ending Acting Retirement After Eight Years: I Felt ‘Hollowed Out’ but ‘I Never Stopped Loving the Work… Audible’s ‘Harry Potter’ Series Expands Cast With Keira Knightley, Kit Harington, James McAvoy, Simon Pegg and More Joaquin Phoenix, Nicola Coughlan and More Join 3,900 Industry Names Pledging Not to Work With Israeli Film Institutions 'Complicit in War Crimes' Charlie Kirk Dies at 31 After Being Shot at Campus Appearance Jezebel Adds Editor’s Note to Article About Hiring ‘Witches to Curse Charlie Kirk’ Published Two Days Before He Was Assassinated Polly Holliday, Who Played Flo on ‘Alice,' Dies at 88 Jimmy Kimmel on Charlie Kirk’s Shooting Death: Can We Stop ‘Angry Finger Pointing’ and ‘Agree It’s Horrible and Monstrous to Shoot Another Human… Must Read Film COVER | Channing Tatum's 'Roofman' Reinvention By Andrew Wallenstein 1 week Film Venice Film Festival Reviews Film Cooper Hoffman on ‘The Long Walk,’ Coming of Age After 'Licorice Pizza' TV ‘SNL’ Adds Five: Meet the New Cast Members Film E. Jean Carroll Hopes Her Explosive Telluride Doc Will ‘Finish Off’ Donald Trump Sign Up for Variety Newsletters Your Email Sign Up Sign Up By providing your information, you agree to our Terms of Use and our Privacy Policy .\n\t\t\t\tWe use vendors that may also process your information to help provide our services. // This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. Variety Confidential A Variety and iHeartRadio Podcast More From Our Brands Rolling Stone Jerry Seinfeld Claims ‘Free Palestine’ Movement Doesn’t Say What It Means in Controversial KKK Comparison Robb Report This $6.5 Million Waterfront N.J. Home is Just an Hour by Boat from N.Y.C. Sportico Sporticast 483: The Rising Cost vs. Convenience of Sports Streaming WWD Longtime Bulgari Executive, Heir Francesco Trapani Dies at 68 TVLine Hannibal Creator Wants Zendaya to Play Clarice Starling in a Potential Silence of the Lambs-Themed Revival Variety About Us Advertise Media Kit Careers Legal Terms of Use Privacy Policy California Privacy Rights Privacy Preferences AdChoices Your Privacy Choices Accessibility Magazine Customer Service Back Issues Subscribe Help More Newsletters Archives Events Luminate Connect Instagram Twitter YouTube Facebook LinkedIn Variety The Business of Entertainment Subscribe Today Have a News Tip? Let us know Variety Close the menu Expand the sub menu Film News Reviews Podcasts Box Office Events Columns Trailers Expand the sub menu TV News Reviews Podcasts Ratings Pilot Scorecard Columns Trailers Expand the sub menu What To Watch Lists & Features Expand the sub menu Music News Album Reviews Concert Reviews Hitmakers Music For Screens Grammys Expand the sub menu Docs Lists & Features Expand the sub menu Tech Features Global VIP+ Tech Expand the sub menu Global News Asia Markets & Festivals Features Expand the sub menu Awards Circuit News Film Predictions TV Predictions Video Artisans Columns Awards Circuit Podcast Expand the sub menu Video Popular Cover Shoots - Behind the Scenes Actors on Actors Power of Women Events Artisans Expand the sub menu What to Hear Lists & Features Expand the sub menu More Coverage Obituaries - submit obituaries to obits@variety.com Photos Podcasts Scene Voices Theater Expand the sub menu More Variety Live Media Summits Vscore Luminate - Film & TV Variety Archives Variety500 Industry Executives Have a News Tip? Newsletters Switch edition between U.S. Edition Asia Edition Global Edition U.S. Asia Global Alerts and Newsletters Your Email Sign Up Sign Up By providing your information, you agree to our Terms of Use and our Privacy Policy .\n\t\t\t\tWe use vendors that may also process your information to help provide our services. // This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. Follow Us Got a Tip? Switch edition between U.S. Edition Asia Edition Global Edition U.S. Asia Global Advertise About Contact Us Variety is a part of Penske Media Corporation. © 2025 Variety Media, LLC. All Rights Reserved. Icon Link Plus Icon ad"
    },
    {
      "url": "https://bayarearenfestweddings.com/",
      "text": "Bay Area Renaissance Festival Weddings – Weddings @ the Bay Area Ren Fest Skip to content HOME GALLERY TESTIMONIALS CONTACT US HOME GALLERY TESTIMONIALS CONTACT US HOME GALLERY TESTIMONIALS CONTACT US HOME Webmaster 2025-06-11T16:28:37+00:00 Congratulations on your engagement! Every couple is different and every event is unique. Create your timeless event in a classic setting at the Bay Area Renaissance Festival. Imagine an era where love is worshipped in verse, laughter, dancing and song. Celebrate this ideal by stepping back in time to a picturesque 16th century English village where you are about to be wed as friends and family look on. Everything resonates with life and happiness; exactly what you always envisioned. WANT TO KNOW MORE?! With the flexibility offered to choose your package, ultimate control is maintained over your wedding style and budget. Contact us @ weddings@bayarearenfest.com to see how we can assist you on your special day. Happily Ever After Your happily ever after starts today. The Bay Area Renaissance Festival has been creating timeless weddings like this for over 30 years. Whether you choose to have a traditional or Renaissance-style wedding, we are happy to work with you, giving special attention to every detail. Our goal is to create a momentous celebration that will become a beautiful memory! Photo Gallery TESTIMONIALS Jessica (Bride) March 2025 “Thank you to everyone who helped us have an absolutely perfect Wedding Day!  We will definitely recommend planning a wedding with your group any chance we get. Everyone who attended (and those we’ve shared our photos with) have loved the idea so much.  Thank you again for everything!” Stacie (Bride) March 2025 “Thank you all so much! Jon and I loved our wedding, as did our guests. It was beautiful and all we could ask for.” Shey-la (Vow Renewal) February 2025 “It was great! Thank you for helping me. Keep on top of everything, it was very smooth process and I appreciated that. You both were amazing.” LET’S GET STARTED ON YOUR WEDDING Please, fill out this form and one of our representatives will contact you shortly. EMAIL: weddings@bayarearenfest.com • PHONE: (952) 445 7361 FIRST AND LAST NAME * PHONE NUMBER * EMAIL ADDRESS * DATE OF WEDDING * IDEAL # OF GUEST * ADDITIONAL INFO × Thank you for your message. It has been sent. × There was an error trying to send your message. Please try again later. Submit © Copyright •   Wedding Theme by Bay Area Renaissance Festival   •   All Rights Reserved   •   Powered by Mid America Festivals Go to Top"
    },
    {
      "url": "https://bayarearenfest.com/contact-us/",
      "text": "Contact us | Bay Area Renaissance Festival Skip to content Plan Your Visit About Us Key Policies FAQ Contact Us Maps & Directions Bring Your Dog Tickets Buy Tickets Ticket Outlets Coupon Outlets Corporate & Groups Daily Events Deals & Discounts Experience The Realm Artisan Marketplace Contests Daily Programs Entertainment Festival Food Games & Rides New in 2025 Theme Weekends Once Upon A Time Highland Fling BARKbarian Brew Fest Heroes & Havoc Ladies & Lords Shopping Day Shamrocks & Shenanigans Viking Invasion Buccaneers & Ballgowns Get Involved Employment Full Run Vendor Applications Guest Vendor Applications Food Ind. Vendor Applications Sponsors & Partners Donations Weddings Kegs ‘N’ Eggs Menu Plan Your Visit About Us Key Policies FAQ Contact Us Maps & Directions Bring Your Dog Tickets Buy Tickets Ticket Outlets Coupon Outlets Corporate & Groups Daily Events Deals & Discounts Experience The Realm Artisan Marketplace Contests Daily Programs Entertainment Festival Food Games & Rides New in 2025 Theme Weekends Once Upon A Time Highland Fling BARKbarian Brew Fest Heroes & Havoc Ladies & Lords Shopping Day Shamrocks & Shenanigans Viking Invasion Buccaneers & Ballgowns Get Involved Employment Full Run Vendor Applications Guest Vendor Applications Food Ind. Vendor Applications Sponsors & Partners Donations Weddings Kegs ‘N’ Eggs Contact us Contact us Festival Site Address 12838 Auton Rd., Dade City, FL 33525 Office Phone Number 352-999-5946 Office Email Address info@bayarearenfest.com Buy Tickets Daily Events Maps & Directions Menu Buy Tickets Daily Events Maps & Directions Receive the News of the Realm in they Inbox! Email First Name Last Name Rejoice! News of the Realm shall now grace thy inbox. Watch for forthcoming merriment! Subscribe Copyright © 2025. Mid America Festivals. All rights reserved. Developed by Digital Architects Manage Consent We use cookies to enhance the functionality and performance of this site. By continuing to browse, you consent to the use of cookies and data collection for marketing and site improvement purposes. Please note that declining cookies may affect the site’s functionality. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent"
    },
    {
      "url": "https://www.fox26houston.com/news/todd-mission-death-investigation-texas-renaissance-festival-king-george-home",
      "text": "Texas Renaissance Festival founder ‘King George’ dies at Todd Mission home | FOX 26 Houston Live News Weather Morning News Sports Uploads Tell 26 More Watch Live Expand / Collapse search ☰ Search site Watch Live FOX 26 on FOX LOCAL Newscasts & Replays LiveNOW from FOX YouTube FOX Soul News Local Texas National World You Decide Money FOX News Sunday Sullivan's Smart Sense Border Watch Regional News Dallas News - FOX 4 News Austin News - FOX 7 Austin Morning News Making the Grade Dr. Viviana Coles Finding Families Health Matters Pets Submit Your Legal Questions to Chris Tritico Here Your Legal Questions FOX Family Feast Weather Live Radar Live Houston-area webcams Tropical Weather JD's Hurricane Gear Test Mondays with Mike ERCOT News Traffic Weather App Pump Patrol FOX Weather Sports Astros Texans Rockets College Sports Dynamo Dash Roughnecks Friday Football Fever Player of the Week World Cup FOX 26 Shows Isiah Factor Uncensored The Nightcap The News Edge Chattin' With Chelsea What's Your Point? What's Your Point? Overtime Texas: The Issue Is Bayou City Buzz Houston Live and Local Texas Live and Local FOX 26 Originals Caroline & Rashi Allison's Cooking Diary Breaking Bond FOX 26 Crime Files FOX 26 in Focus FOX Faceoff Dollar$ & $en$e Foodies and Friends Pet Pawcast Lunch for the Soul The Missing TELL 26 Entertainment The Drop Backstage OL The Backstage Experience FOX PRIMETIME SHOWS Contests The Now with Cris About Us Meet the FOX 26 Team WATCH FOX 26 ON FOX LOCAL What's On FOX Email Newsletter Jobs at FOX 26 & My20 Internship Opportunities Mobile App Contests KRIV/KTXH FCC Public File Closed Captioning FCC Applications Contact Us HTX-tra Air Quality Alert until THU 6:45 PM CDT, Inland Brazoria County, Inland Galveston County, Inland Harris County, Galveston Island Texas Renaissance Festival founder ‘King George’ dies at Todd Mission home By FOX 26 Digital and Leslie DelasBour Updated May 21, 2025 5:56pm CDT Todd Mission FOX 26 Houston Share Copy Link Email Facebook Twitter LinkedIn Reddit Texas Renaissance Festival founder found dead in his home George Coulam, also known as \"King George,\" was found dead on Wednesday in his Todd Mission home. His death is under investigation. The Brief Texas Renaissance Festival founder George \"King George\" Coulam has died at his home in Todd Mission, officials confirm. His cause of death is not known at this time. Coulam was the founder and longtime owner of the festival. He previously served as mayor of Todd Mission for more than 40 years. TODD MISSION, Texas - Texas Renaissance Festival founder George \"King George\" Coulam has died, authorities confirm. Death investigation at King George’s home What we know: According to the Todd Mission city manager, police were called to Coulam's home at about 9 a.m. on Wednesday. He was found deceased in his home. The cause of Coulam's death is under investigation by the Texas Rangers, Todd Mission Police, and the Grimes County Sheriff's Office. Officials say there is no suspected danger to the public. What we don't know: Coulam's cause of death is not known at this time. Who is King George? Dig deeper: Coulam is the founder and longtime owner of the Texas Renaissance Festival. He started the Texas Renaissance Festival in 1974, and it has grown into the largest of its kind in the United States. In addition to being the festival's leader, Coulam served as mayor of Todd Mission for more than four decades, but lost the most recent election on May 3. In 2024, the HBO docuseries \"Ren Faire\" focused on the festival's succession and Coulam’s eventual retirement, highlighting the tension between his desire to find a romantic partner and his need to choose a successor. It also highlighted Coulam’s strict leadership style. There have been ongoing legal disputes and potential sales of the festival, with a recent judge's order in early May mandating the sale of Coulam’s properties, including the festival. ‘He built a community’ Texas Renaissance Festival founder ‘King George’ found dead in his home According to the Todd Mission city manager, George \"King George\" Coulam was pronounced dead in his home on Wednesday. FOX 26's Leslie DelasBour spoke to community members who knew him well. What they're saying: Niki Marshall is a former member of the performance company with the Texas Renaissance Festival. She says not all of her memories of George's leadership are positive, but the TRF community will keep the festival going. \"The only thing that I could say for him is that he did hire some pretty cool people to be in that space,\" said Marshall. \"He gave us the direction that we needed, and I got the opportunity to really make a difference. And it wasn’t just for me, it was for the patrons that we performed for every day.\" Organizers of the Texas Renaissance Festival sent the following statement to FOX 26: \"We are deeply saddened by the loss of George Coulam, founder of the Texas Renaissance Festival. For more than 50 years, he built a community that has become a cherished tradition for generations of performers, staff, and guests. At this time, we ask for respect and privacy for Mr. Coulam’s family and the extended Texas Renaissance Festival family as they grieve. As this is a deeply personal matter, we are not offering additional comments at this time.\" Todd Mission City Manager Neal Wendele made the following statement: \"Mr. Coulam, a visionary leader, founded the Texas Renaissance Festival in 1974, transforming a remote area into a cultural destination. His visionary leadership led to the incorporation of Todd Mission in 1982, where he served as the first and only mayor until May 8, 2025, shaping our community’s unique identity. The City of Todd Mission offers its deepest condolences to Mr. Coulam’s family and friends. We request privacy for those affected and will provide updates as appropriate.\" The Source: The information in this article was gathered from sources, the Grimes County Sheriff's Office, and the Texas Renaissance Festival. Todd Mission Grimes County Latest News Elected officials, political leaders in Harris County react to Charlie Kirk deadly shooting From DMs to Drugs: How social media fuels teen addiction Muggy air to return to Houston on Thursday Dallas beheading: Victim identified, suspect charged with capital murder New 2025 State Fair of Texas Foods Download FOX LOCAL for Free Trending Galveston police officer dies in off-duty incident WANTED: Houston murder suspect accused of shooting woman to death, injuring man 5 suspects catch felony jugging charges in Houston undercover stings Texas A&M admins demoted over LGBT courses; lawmakers call for terminations 67-year-old high-risk registered sex offender with 11 felony convictions free on bond after 2 recent arrests Daily Newsletter All the news you need to know, every day By clicking Sign Up, I confirm that I have read and agree to the Privacy Policy and Terms of Service . ENTER TO WIN Houston St. Jude Dream Home Giveaway: How to buy tickets For $100, you can enter to win a brand-new house while making a difference in the lives of children battling serious diseases. Watch Live FOX 26 on FOX LOCAL Newscasts & Replays LiveNOW from FOX YouTube FOX Soul News Local Texas National World You Decide Money FOX News Sunday Sullivan's Smart Sense Border Watch Regional News Dallas News - FOX 4 News Austin News - FOX 7 Austin Morning News Making the Grade Dr. Viviana Coles Finding Families Health Matters Pets Submit Your Legal Questions to Chris Tritico Here Your Legal Questions FOX Family Feast Weather Live Radar Live Houston-area webcams Tropical Weather JD's Hurricane Gear Test Mondays with Mike ERCOT News Traffic Weather App Pump Patrol FOX Weather Sports Astros Texans Rockets College Sports Dynamo Dash Roughnecks Friday Football Fever Player of the Week World Cup FOX 26 Shows Isiah Factor Uncensored The Nightcap The News Edge Chattin' With Chelsea What's Your Point? What's Your Point? Overtime Texas: The Issue Is Bayou City Buzz Houston Live and Local Texas Live and Local FOX 26 Originals Caroline & Rashi Allison's Cooking Diary Breaking Bond FOX 26 Crime Files FOX 26 in Focus FOX Faceoff Dollar$ & $en$e Foodies and Friends Pet Pawcast Lunch for the Soul The Missing TELL 26 Entertainment The Drop Backstage OL The Backstage Experience FOX PRIMETIME SHOWS Contests The Now with Cris About Us Meet the FOX 26 Team WATCH FOX 26 ON FOX LOCAL What's On FOX Email Newsletter Jobs at FOX 26 & My20 Internship Opportunities Mobile App Contests KRIV/KTXH FCC Public File Closed Captioning FCC Applications Contact Us HTX-tra facebook twitter instagram email New Privacy Policy Updated Terms of Use Your Privacy Choices KRIV/KTXH FCC Public File EEO Public File Closed Captioning About Us Jobs at FOX 26 & My20 Contact Us This material may not be published, broadcast, rewritten, or redistributed. ©2025 FOX Television Stations"
    },
    {
      "url": "https://rennfest.com/phone-mailing-info/",
      "text": "Maryland Renaissance Festival – Contact Us Skip to content Menu Home General Info Dates, Times & Directions Costume Rentals Food At The Faire Artisans Local Accommodations Phone & Mailing Info Wedding Information FAQS Vendor Applications Employment Applications Privacy Policy Entertainment This Year’s Story Line Our Entertainment Schedule Special Events Stage, Street Acts & Royal Court Events Musicians & Dancers Acting Company Auditions Entertainment Support Staff Map Of The Village Photos Photo Contest Winners 2025 photo contest entry form Drone Regulations and Policy Media Media Photos Storyline 2025 season release Crafts Entertainment Special Events Tickets Contact Phone & Mailing Info Festival Phone Numbers Toll Free: (800) 296-7304 Annapolis: (410) 266-7304 Fax: (410) 573-1508 Festival Email General: info@rennfest.com Entertainment questions? Contact Carolyn Spedden at carolyn@rennfest.com Festival Mailing Address Maryland Renaissance Festival P.O. Box 315 Crownsville, MD 21032-0315 Festival Shipping Address Maryland Renaissance Festival 1821 Crownsville Road Annapolis, MD 21401 Please Note: There is no postal service to the Shipping Address. Please send all mail to the Mailing Address. Maryland Renaissance Festival Mailing Address: P.O. Box 315 Crownsville, MD 21032 GPS Locator: 1821 Crownsville Road Annapolis MD, 21401 Phone: Toll Free: (800) 296-7304 Local: (410) 266-7304 Email: info@rennfest.com Home Tickets Dates, Times & Directions Entertainment Map Of The Village FAQS Privacy Policy Special Events ©  2025, Maryland Renaissance Festival. All Rights Reserved. Scroll To Top"
    },
    {
      "url": "https://bayarearenfest.com/",
      "text": "Bay Area Renaissance Festival | 2025 Tickets on sale now Skip to content Plan Your Visit About Us Key Policies FAQ Contact Us Maps & Directions Bring Your Dog Tickets Buy Tickets Ticket Outlets Coupon Outlets Corporate & Groups Daily Events Deals & Discounts Experience The Realm Artisan Marketplace Contests Daily Programs Entertainment Festival Food Games & Rides New in 2025 Theme Weekends Once Upon A Time Highland Fling BARKbarian Brew Fest Heroes & Havoc Ladies & Lords Shopping Day Shamrocks & Shenanigans Viking Invasion Buccaneers & Ballgowns Get Involved Employment Full Run Vendor Applications Guest Vendor Applications Food Ind. Vendor Applications Sponsors & Partners Donations Weddings Kegs ‘N’ Eggs Menu Plan Your Visit About Us Key Policies FAQ Contact Us Maps & Directions Bring Your Dog Tickets Buy Tickets Ticket Outlets Coupon Outlets Corporate & Groups Daily Events Deals & Discounts Experience The Realm Artisan Marketplace Contests Daily Programs Entertainment Festival Food Games & Rides New in 2025 Theme Weekends Once Upon A Time Highland Fling BARKbarian Brew Fest Heroes & Havoc Ladies & Lords Shopping Day Shamrocks & Shenanigans Viking Invasion Buccaneers & Ballgowns Get Involved Employment Full Run Vendor Applications Guest Vendor Applications Food Ind. Vendor Applications Sponsors & Partners Donations Weddings Kegs ‘N’ Eggs Weekends February 15th - March 30th BUY TICKETS DAILY EVENTS 2025 BAY AREA RENAISSANCE FESTIVAL 10AM - 6PM RAIN OR SHINE! February 15TH - March 30th MAIN ENTRANCE 12838 Auton Rd., Dade City, FL 33525 Creating a Unique 16th Century Experience Join the Villagers of Folkstone as they invite one and all to the magical 16th Century European village featuring 15 stages of exciting entertainment including: musicians, magicians, jugglers and jousting. Over 100 artisans will fill the Festival marketplace to display and sell their handcrafted goods for a truly fabulous and endless shopping experience. Patrons will interact with memorable characters and enjoy full-contact live armored jousting, 7 theme weekends, and fabulous food fit for royalty! Experience the magic as your adventure begins here! Thrill to the charge of knights jousting on their mighty steeds. Fall under the spell of the faery court. Laugh and be amazed at the clowns, jugglers, acrobats, and magicians performing on stages throughout the village or watch with excitement as birds of prey soar through the air. BUY TICKETS DAILY EVENTS OUR SPONSORS Buy Tickets Daily Events Maps & Directions Menu Buy Tickets Daily Events Maps & Directions Receive the News of the Realm in they Inbox! Email First Name Last Name Rejoice! News of the Realm shall now grace thy inbox. Watch for forthcoming merriment! Subscribe Copyright © 2025. Mid America Festivals. All rights reserved. Developed by Digital Architects Manage Consent We use cookies to enhance the functionality and performance of this site. By continuing to browse, you consent to the use of cookies and data collection for marketing and site improvement purposes. Please note that declining cookies may affect the site’s functionality. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent Subscribe Email Phone Number By providing your phone number, you agree to receive recurring automated marketing text messages (e.g. cart reminders) from this company and third parties acting on its behalf. Consent is not a condition to obtain goods or services. Msg & data rates may apply. Msg frequency varies. Reply HELP for help and STOP to cancel. You also agree to the Terms of Service and Privacy Policy . First Name Last Name Thanks for joining our mailing list You've been successfully subscribed - thanks! Sign Up"
    }
  ]
}