{
  "fuentes": [
    {
      "url": "https://www.bayfrontinnnaples.com/contact/",
      "email": "reservations@bayfrontinnnaples.com"
    },
    {
      "url": "https://www.bayfrontinnnaples.com/contact/",
      "email": "sales@bayfrontrentalsnaples.com"
    },
    {
      "url": "https://www.bayfrontinnnaples.com/contact/",
      "email": "salesandcatering@bayfrontinnnaples.com"
    },
    {
      "url": "https://www.bayfrontinnnaples.com/hotel-information/",
      "email": "reservations@bayfrontinnnaples.com"
    },
    {
      "url": "https://www.alcoholprofessor.com/blog-posts/behind-the-bar-dustin-rodriguez-the-bamboo-club",
      "email": "ryan@blankglass.com"
    },
    {
      "url": "https://www.alcoholprofessor.com/blog-posts/behind-the-bar-dustin-rodriguez-the-bamboo-club",
      "email": "adam@eatdrinklearn.com"
    },
    {
      "url": "https://www.alcoholprofessor.com/blog-posts/behind-the-bar-dustin-rodriguez-the-bamboo-club",
      "email": "allison@pleasethepalate.com"
    },
    {
      "url": "https://www.alcoholprofessor.com/blog-posts/behind-the-bar-dustin-rodriguez-the-bamboo-club",
      "email": "rebecca@rfpublicrelations.com"
    },
    {
      "url": "https://www.bayfrontinnnaples.com/privacy-notice/",
      "email": "info@bayfrontinnnaples.com"
    },
    {
      "url": "https://quicklocal.com/rtcl_listing/fl/naples/bambu-tropical-bar-grille/",
      "email": "trista@bayfrontinnnaples.com"
    }
  ],
  "mails": [
    "adam@eatdrinklearn.com",
    "allison@pleasethepalate.com",
    "info@bayfrontinnnaples.com",
    "rebecca@rfpublicrelations.com",
    "reservations@bayfrontinnnaples.com",
    "ryan@blankglass.com",
    "sales@bayfrontrentalsnaples.com",
    "salesandcatering@bayfrontinnnaples.com",
    "trista@bayfrontinnnaples.com"
  ],
  "nombre_sitio": "bayfrontinnnaples.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.bayfrontinnnaples.com/contact/",
      "text": "Contact | Bayfront Inn 5th Ave EN EN FR DE ES 239.649.5800 Book Now Menu reservations 239.649.5800 Hotel Direct 239.649.5800 Close Stay Accommodations Guest Rooms Suites Luxury Rooms Penthouse Bayview King Suite Amenities Play Rentals Boat Rentals Kayak Rentals Bike Rentals SUP Rentals Local Attractions Dine Bambu Tropical Bar & Grille Events Calendar Gift Cards Special Offers Events About Hotel Information Gallery Getting Here Community Involvement Careers Contact 1221 5th Ave South, Naples, Florida 34102 Facebook Instagram Twitter Book your stay Check In Check Out contact bayfront inn Let’s Start a Conversation No request is too great and no detail too small. We are also here to assist you before your trip to Naples Florida. Reason for Contact Reason for Contact * Reservations Group Reservations Bambu Tropical Bar & Grille Bayfront Boat Rentals First Name Last name Email Phone How can we assist you? I'd like to receive updates from Bayfront Inn Please leave this field empty 1221 5th Ave South Naples, Florida 34102 make a reservation call us Reservations 239.649.5800 Hotel Direct 239.649.5800 Fax 239.649.0523 how can we help? Reservations 239.649.5800 (reservations) 239.649.5800 (hotel direct) 239.649.0523 (fax) reservations@bayfrontinnnaples.com Group Reservations 239.649.5800 ext. 545 salesandcatering@bayfrontinnnaples.com Bambu Tropical Bar & Grille 239.649.5800 ext.520 Bayfront Boat Rentals 239.465.0223 sales@bayfrontrentalsnaples.com Dine & play 239.649.5800 learn more 239.465.0223 learn more Address 1221 5th Ave South Naples, Florida 34102 reservations 239.649.5800 Hotel Direct 239.649.5800 Join the adventure Sign up for news and other cool stuff I consent to my name and email address being collected and stored Please leave this field empty Never miss a moment Facebook Instagram Twitter © All rights reserved Privacy Notice Accessibility Contact Us Careers Directions Made by Exploritech Close Selected Dates: Check In Back to top We serve cookies to analyze traffic and customize content on this site. Privacy & Cookie Policy Got It! Manage consent Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website, anonymously. Cookie Duration Description cookielawinfo-checkbox-analytics 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\". cookielawinfo-checkbox-functional 11 months The cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Functional\". cookielawinfo-checkbox-necessary 11 months This cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\". cookielawinfo-checkbox-others 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other. cookielawinfo-checkbox-performance 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Performance\". viewed_cookie_policy 11 months The cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Functional Functional Functional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features. Performance Performance Performance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. Advertisement Advertisement Advertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads. Others Others Other uncategorized cookies are those that are being analyzed and have not been classified into a category as yet. SAVE & ACCEPT"
    },
    {
      "url": "https://www.bayfrontinnnaples.com/hotel-information/",
      "text": "Naples Florida Bayfront Inn, Waterfront Hotel Information & Reservation EN EN FR DE ES 239.649.5800 Book Now Menu reservations 239.649.5800 Hotel Direct 239.649.5800 Close Stay Accommodations Guest Rooms Suites Luxury Rooms Penthouse Bayview King Suite Amenities Play Rentals Boat Rentals Kayak Rentals Bike Rentals SUP Rentals Local Attractions Dine Bambu Tropical Bar & Grille Events Calendar Gift Cards Special Offers Events About Hotel Information Gallery Getting Here Community Involvement Careers Contact 1221 5th Ave South, Naples, Florida 34102 Facebook Instagram Twitter Book your stay Check In Check Out about hotel information Hotel information Where is the hotel located? 1221 5th Ave South Naples, Florida 34102 get directions What is the hotel phone number and email? Toll Free: 800.382.7941 Direct: 239.649.5800 Fax: 239.649.0523 Email: reservations@bayfrontinnnaples.com What is your check-in time? Our check in time is 3:00pm What is your check-out time? Our check out time is 11:00am Do you offer late checkouts? Late check-out’s available based on availability. Please text or call Do you charge for a late checkout? If so, how much? Late check-out fees are determined based on business levels. Please contact us by text or phone to determine late Do you offer express checkout? Yes please just text us or call and we would be glad to email you your receipt Can I store my luggage? Luggage Storage is Available. Please call Guest Services to Arrange What is your standard time to respond to guests? 5 minutes during Operating Hours What is the standard time for guest resolution? We will do our best to get back to all Guest Feedback as soon as possible How is cell phone coverage? All wireless networks have incredible coverage How do guests access your WiFi? Please log onto your internet brower and follow instruction Please provide the WiFi Password Please follow instructions once logged onto internet browser. No password is required Fitness Center Hours and Location? Room Key required? Fitness Facility is open 24hrs a day / 7 days a week Pool Hours and Location? Room Key required Pool is situated outside and is open from Dusk to Dawn Business Center Hours and Location? Business Centre is open 24hrs a day and located on the 2nd floor. See more Hotel information questions Parking & Transportation Self-parking fee? If so, how much? Parking is available complimentary Valet parking fee? If so, how much? Unfortunately Valet Parking is not available but please park anywhere complimentary Are there Electric Car accommodations? Unfortunately at this time we do not offer hook ups for Electric Cars. Is there Uber or Lyft in the area? Both Uber and Lyft are available. We also offer Slyder Rides here in Naples. Please contact our Guest Services Team for more information Do you offer transportation to local areas. If so what type… Hotel Shuttle, Taxi, Car Service? Hotel Shuttle is available. Please see our Concierge Department for booking times available Please provide directions to Airport? Naples Airport is situated North from our Parking Lot. See more Parking & Transportation questions Rooms & Suites What are the top 5 in room guest requested items? Extra Towels, More Coffee, Housekeeping Services, Maintenance Issue Where can I buy the bathroom lotion/products? If you have forgotten lotions, sunscreen or any other products please visit our gift shop situated in the main lobby Where can I buy the robes? Unfortunately bath robes are not available for sale at this time Is there coffee in my room? Coffee is available in Guest Rooms, Suites, and Restaurant. Is there a fridge in my room? All Guest Rooms and Suites are equipped with a Fridge Is there a hair dryer in my room? All Guest Rooms and Suites are equipped with a Hair Dryer Is there an ironing board in my room? All Guest Rooms and Suites are equipped with an Ironing Board Is there a safe in my room? All Guest Rooms and Suites are equipped with an in Room Safe Do you have Handicap Rooms? Accessible Rooms are available upon request Are your rooms nonsmoking & do you have smoking rooms? Bayfront Inn 5th Ave is 100% Non- Smoking Do you offer laundry services? Laundry Services Available. Please visit Gift Shop for Detergent Are rollaway beds available? Please let us know if a roll away bed is required Are cribs available? Please us know if a Crib is available. How do I make an outside call from the room phone? Please dial 7 then # to make outgoing calls See more Rooms & Suites questions General Amenities Please visit our amenities page for details Dining Restaurant and Bar Name, Hours and Location? Bambu Tropical Bar & Grille view details Are reservations required? Reservations preferred through hostess in the restaurant. Do you have happy hour? Happy Hour is available between the hours of 3pm – 5pm In Room Dining Hours? Available during the hours of 7am – 10pm (Sun – Thurs) 7am -11pm (Fri & Sat) Pet Policies Are pets allowed? We are a pet friendly hotel and our fee is $50 per day. Are support animals allowed? Absolutely (No Charge if owner has papers) Are there any weight or breed limits? No we don’t discriminate Address 1221 5th Ave South Naples, Florida 34102 reservations 239.649.5800 Hotel Direct 239.649.5800 Join the adventure Sign up for news and other cool stuff I consent to my name and email address being collected and stored Please leave this field empty Never miss a moment Facebook Instagram Twitter © All rights reserved Privacy Notice Accessibility Contact Us Careers Directions Made by Exploritech Close Selected Dates: Check In Back to top We serve cookies to analyze traffic and customize content on this site. Privacy & Cookie Policy Got It! Manage consent Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website, anonymously. Cookie Duration Description cookielawinfo-checkbox-analytics 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\". cookielawinfo-checkbox-functional 11 months The cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Functional\". cookielawinfo-checkbox-necessary 11 months This cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\". cookielawinfo-checkbox-others 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other. cookielawinfo-checkbox-performance 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Performance\". viewed_cookie_policy 11 months The cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Functional Functional Functional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features. Performance Performance Performance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. Advertisement Advertisement Advertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads. Others Others Other uncategorized cookies are those that are being analyzed and have not been classified into a category as yet. SAVE & ACCEPT"
    },
    {
      "url": "https://www.alcoholprofessor.com/blog-posts/behind-the-bar-dustin-rodriguez-the-bamboo-club",
      "text": "From Behind the Bar: Dustin Rodriguez of The Bamboo Club | Alcohol Professor Spirits Wine Cocktails Beer News Seasons OUR OTHER SITES More Back Spring Summer Fall Winter Back CHEESE PROFESSOR CHOCOLATE PROFESSOR VINEGAR PROFESSOR OLIVE OIL PROFESSOR PROFESSOR MEDIA GROUP Back About Us Books Recipes Videos Field Trips Beer Style Guide Vintage Alcohol Ads Kosher The Martini Spirits Wine Cocktails Beer News Seasons Spring Summer Fall Winter OUR OTHER SITES CHEESE PROFESSOR CHOCOLATE PROFESSOR VINEGAR PROFESSOR OLIVE OIL PROFESSOR PROFESSOR MEDIA GROUP More About Us Books Recipes Videos Field Trips Beer Style Guide Vintage Alcohol Ads Kosher The Martini The Class You've Always Wanted To Take From Behind the Bar with Dustin Rodriguez of The Bamboo Club Dustin Rodriguez is GM and Beverage Director at The Bamboo Club in the historic Zafaria District of Long Beach. Originally from Colorado Springs, he got his start as a busser and dishwasher at a Mexican Cantina. How would you describe your bar? A rambunctious little Tiki bar and restaurant in Long Beach, CA What drink have you added to the menu recently The “Cloud Cutter” is the most recent addition. It’s my riff on the classic Tiki cocktail; Fog Cutter. The Cloud Cutter's primary liquor is the Callisto Botanical Rum , which we infuse with hibiscus for 24 hours to give it that rich dark red color and add a nice floral aroma to the botanicals. An original Fog Cutter would consist of lemon, orgeat, gin, cognac, curacao, and cream sherry. So, we've brightened it up with pisco instead of sherry and this wonderful botanical rum Callisto, instead of gin. Cloud Cutter 1 oz lemon .5 oz orgeat 1.5 oz hibiscus infused Callisto Rum 5 oz Curacao .5 oz Martel Cognac .5 oz Barsol Pisco Fill a cocktail shaker with ice. Add the lemon, orgeat, rum, curacao, cognac and pisco and shake well. Pour with the ice into a tall Collins glass and garnish with the mint sprig and lemon wheel. What’s your go to rum? Copalli is probably my favorite rum brand at the moment. Great product and, an added bonus is that its super sustainably produced. What misunderstandings exist about tiki bars? I think that some people believe that there might be some cultural appropriation going on. But, here at The Bamboo Club, we’re here to have fun, make kick ass tropical drinks, pay homage to the creators, and respect the cultures that developed the flavors we love! How and when did you realize you wanted to work behind the bar? I was a bar back first, and the progression to bartender just happened naturally. That was over a decade ago! Who’s your favorite bartender or mentor and why? Chef Art Gonzalez, RIP. He was the first person to ask me what I really wanted to do with a bartending career, and how I was going to get there. He taught me how to utilize flavors and continually asked what I wanted to work with next as far as ingredients. He really pushed me to become the bartender I am today! What drew you to your current bar and what keeps you there? I had worked with the owners of The Bamboo Club before they ever opened The Bamboo Club in other projects. They showed me what was happening during the buildout, and I was immediately onboard! My staff keeps me here, they are the best bunch of savages you’ll ever meet! What new to you brand have enjoyed trying lately? I think the best thing I’ve tasted recently is the Alma Tepec Licor de Chile Pasilla Mixe liqueur, very nice! What drink takes you the longest to make? The Painkiller or the Fluffy Banana are tedious, only because you have to flash it for so long to get the fluff. But, I promise it’s worth it. What drink is most popular at The Bamboo Club and why? The Painkiller and Mai Tai - tiki classics - are for sure the most popular, but the Dr. Bamboo (Dr. Bird Jamaican rum, 151 rum, All-Spice, prickly pear, and cinnamon) is right behind What cocktail or spirits book have you read recently? The Cocktail Codex from the fine people over at Death & Co How many styles of ice should a bar have? I would say, at least three. My top three are rock ice (Kold Draft is the finest), crushed or pebble, and big rocks, which we like to call adult ice over here! What advice would you have for your younger self or a bartender starting out today? Take your time to become the bartender you want to be. Study and pay attention to your guests, and what they drink. Be respectful of your guests, staff, and the culture you pay homage to, when it comes to Tiki bars. And be sure to create a culture within your bar, one that people will want to return to. Cocktails , Bars Amy Sherman April 20, 2023 california , tiki Comment Facebook 0 Twitter LinkedIn 0 Pinterest 0 0 Likes Previous How Dissident Spirits Is Taking A Fresh Approach to Gin Spirits Jim Gladstone April 21, 2023 california, gin, distillery Next Corvina 101: Discovering Red Wines of The Veneto Wine Penny Sadler April 19, 2023 Italy, corvino Keep reading Blog Posts Theresa Greco 6 Affordable Proseccos to Enjoy this Summer Theresa Greco Theresa Greco Maria C. Hunt You’ll Want to Sip These Low ABV Cocktails All Summer Long Maria C. Hunt Maria C. Hunt Em Sauter 5 Great Beer Styles for Summer Em Sauter Em Sauter Patrick A. Reed Vintage Ad Archive: Summertime Madness! Patrick A. Reed Patrick A. Reed MENU HOME SPIRITS WINE COCKTAILS BEER NEWS SEASONS SPRING SUMMER FALL WINTER MORE ABOUT US BOOKS RECIPES VIDEOS FIELD TRIPS BEER STYLE GUIDE VINTAGE ADS KOSHER THE MARTINI OUR OTHER SITES CHEESE PROFESSOR CHOCOLATE PROFESSOR OLIVE OIL PROFESSOR VINEGAR PROFESSOR PROFESSOR MEDIA GROUP © 2025 The Alcohol Professor. All rights reserved. ABOUT THE AUTHOR Andrea McHugh Andrea McHugh is a New England-based food, wine and spirits, and travel writer. Her byline can be found in US News, Insider, Parade Magazine, the Boston Globe, Yankee Magazine, Classic Boat, Travel Awaits, TripSavvy, the Hartford Courant and numerous national and international publications. She’s traveled to destinations far and wide, experiencing new places through its past, present, people, and culinary culture. ABOUT THE AUTHOR Alexandra Emanuelli Alexandra Emanuelli is a professional food and beverage writer with a decade of experience. She writes for HuffPost, Southern Living, Everyday Health, Clean Eating, AllRecipes, and The Alcohol Professor and teaches writing. She lives in Ottawa, Canada, and her favorite wine is Barolo. ABOUT THE AUTHOR Carissa Chesanek Carissa Chesanek is a writer based in New York. Her work has appeared in The Miami Herald, Food Network, Forbes Travel Guide, Tasting Table, and Zagat where she was the local dining editor for two years. ABOUT THE AUTHOR James Tai James Tai is the Principal of Beeracolyte Consulting, specializing in education and training for bars, restaurants, breweries, as well as private and corporate events. In addition to beer, he holds certifications in spirits, sake, and food science, the latter being used for beer and food pairing techniques which he enjoys sharing across media platforms. James is also an International Beer Judge, lending his insight in evaluating beers to competitions such as the NYIBC. More info is available ay www.beeracolyte.com. Follow him on Twitter and Instagram @beeracolyte ABOUT THE AUTHOR Shana Clarke Shana Clarke is a wine, sake, and travel writer, and the author of 150 Vineyards You Need To Visit Before You Die. Her work has appeared in Saveur, Fortune, NPR, Wine Enthusiast, and Hemispheres. She was shortlisted for the Louis Roederer 2020 International Wine Writers’ Awards and ranked one of the “Top 20 U.S. Wine Writers That Wineries Can Work With” by Beverage Trade Network in 2021. She holds a Level 3 Advanced Certificate from Wine & Spirit Education Trust and is a Certified Sake Sommelier. She will always say yes to a glass of Champagne. Learn more at www.shanaspeakswine.com and follow her at @shanaspeakswine ABOUT THE AUTHOR Becky Garrison Becky Garrison is a satirist and storyteller. Since moving to the Pacific Northwest in 2014, she has  been covering this region's craft culture including food, beer, wine, spirits, cider, coffee and cannabis/CBD, as well as the local festival scene and the rise of secular spiritual communities. Among her recent publications include work for Beverage Masgter, Forbes, Northwest Travel & Life, The Grapevine Magazine, SIP, the Oregon Wine Press, and Spirituality & Health. Follow her travels via Instagram @Becky_Garrison or Facebook at BeckyGarrisonWriter. ABOUT THE AUTHOR Theresa Russell Theresa Russell thrives on the thrill of travel and the excitement of visiting new destinations and experiencing the local food, beverages and culture, whether in Anchorage or Zihuantanejo. Cruising has a special place in her heart, but she is no stranger to other types of travel, including hiking and cycling. She has hiked and cycled in several countries and includes hiking the Inca Trail and cycling across the North American continent as some of her most memorable trips. She is proud to have received awards for both her writing and photography. ABOUT THE AUTHOR Thei Zervaki Thei Zervaki is citizen of the world who writes about one-of-a-kind foods, distant lands, and food poetry. She loves culinary history books, strong coffee, and a glass of Riesling on hot nights. Find her at wedesserts.com and on IG @thefullybooked. ABOUT THE AUTHOR Amber Selene Turpin Amber Selene Turpin is a freelance food and travel writer based in the Santa Cruz Mountains. She is a regular contributor to The Mercury News, Edible Magazines, 7x7 and the Slow Wine Guide, with work appearing in Civil Eats, EatingWell Magazine, and many other publications over the last fifteen years. You can find her on Instagram @bonanzasprings. ABOUT THE AUTHOR Lindsay Merbaum Lindsay Merbaum is an author of feminist horror and the founder of Pick Your Potions, a consortium of witchery offering custom cocktails and mocktails, recipe sets, swag, and virtual independent study classes via The Study Coven. The literary magazine Electric Literature hosted a year-long column featuring Pick Your Potions’ booktails, and other recipes have appeared in the LA Review of Books, All American Whiskey, and on Tor.com. For more, visit www.pick-your-potions.com, or check out The Cauldron on Substack. ABOUT THE AUTHOR Mandy Naglich Mandy Naglich is certified taster, Advanced Cicerone®, National Homebrew Competition Gold Medalist, drinks educator, and writer. Her first book, How to Taste: A Guide to Discovering Flavor and Savoring Life, chronicles her adventures in the world of professional tasting and the methods anyone can use to get in touch with their senses. She covers the tastiest things happening in travel, dining, and drinks for a variety of print and online publications. Mandy lives, writes, and brews in New York City, but she documents her drinks adventures around the world at @drinkswithmandy. ABOUT THE AUTHOR Abbe Wichman Abbe Wichman is a food and drink writer based in Westchester, NY. A contributor to Westchester Magazine and HuffPost, her writing has also been featured in Spoonful and a number of Edible publications. She especially loves to profile the passionate people in food and drink. Follow her on Instagram @abbewichman and on Twitter @abbe_wichman . ABOUT THE AUTHOR Lee Sherman Lee Sherman is a data-driven journalist with 30 years experience covering technology, personal finance, music, culture, and fashion for publications including Worth, Wired, and MacWorld. He gave up drinking alcohol five years ago for health reasons and enjoys exploring the many zero proof beverages. Visit his blog The Modernist Style . ABOUT THE AUTHOR Abigail Gullo Abigail Deirdre Gullo first fell into bartending when she learned to make a Manhattan (sweet) for her beloved grandfather at the age of 7.  Abigail is a member of the United States Bartenders Guild and a proud supporter of the Museum of the American Cocktail in New Orleans.   When not behind the bar at SoBou, she is behind her computer screen blogging at www.ryegirlnyc.blogspot.com, or tweeting @nycbaby, though she would rather be singing in a Rock-n-Roll band. ABOUT THE AUTHOR Adam Centamore Adam is a professional wine and cheese educator who lives in the Boston area. He is also a culinary travel writer who has appeared in Saveur Magazine, Culture Cheese Magazine, Edible South Shore, and other print and online publications. His first book, Tasting Wine and Cheese - An Insider's Guide to Mastering the Principles of Pairing, was a finalist for Cookbook of the Year for the International Association of Culinary Professionals. He can be reached at adam@eatdrinklearn.com , and through his website, www.eatdrinklearn.com . Follow him on Instagram: @eatdrinklearn ABOUT THE AUTHOR Adam Levy Adam Levy is the \"Alcohol Professor\" and Founder of the International.\nBeverage Competitions Group. He is a man in constant search of imbibing in good stuff and sharing his knowledge with those he knows.  Born in New York with a lust for travel and to visit breweries, wineries and distilleries around the world. He loves his dog Garret Oliver and wears Red to proudly represent Rutgers Sports. ABOUT THE AUTHOR Agathe Soubien I'm a french Norman who is passionate about wines & spirits. I turned my career into it because I really believe in it. My first link with wine was when I was young, and I used to accompany my dad to choose a bottle from our cellar for friends and family dinners. So my link to wine is to share it!\nI have worked in Bordeaux for Vignobles ClÃ©ment Fayat as seller and in charge of the communication, promotion and PR. I was in Champagne this year to achieve a Vocational Bachelor's Degree in International Trade of Wines and Spirits, and now in NYC to do an internship for an importer. \nMy dream is to work in Burgundy in the next few months because I really believe that to learn about wines you need to live and feel it. You need to travel and discover the region by your eyes and senses not just in books or on the internet. I also wish to work abroad and promote French wines and spirits and share our \"savoir faire\" and way of drink. ABOUT THE AUTHOR Alec Scott Alec Scott has contributed to the New York Times, Los Angeles Times, Guardian and Smithsonian Magazine. He is the author of Until It Shimmers and Oldest San Francisco, and has taught writing at Stanford. ABOUT THE AUTHOR Alicia Raeburn Alicia Raeburn is a bartender and freelance travel and food writer. When she’s not writing, she chases her passions for running, hiking, and all outdoor activities around the world. You can see more of her work on Miles Less Traveled, a blog focused on all of the local eats and adventures she’s discovered in her travels. ABOUT THE AUTHOR Alisa Scerrato Alisa Scerrato is a bicoastal writer, editor, and educator. She has a master’s degree in Arts and Humanities Education from New York University and over two decades of experience in her field. As a journalist, she covers topics that deal with food, art, and culture. In 2020, Alisa won a San Francisco Press Club Award — 1st Place, Digital Media, Feature Story/Light Nature for her story \"As Tony's Pizza Napoletana turns 10, owner reflects on changing North Beach.\" Find Alisa on LinkedIn , Twitter , and Instagram . ABOUT THE AUTHOR Aliza Kellerman Aliza Kellerman is a booze writer, local booze advocate, & social media/digital content enthusiast. She served as the Brand Ambassador for Adirondack Distilling Company before spearheading a digital content and social media initiative for the Royal Wine Corporation. She is interested in the story behind the bottle: she believes the more you know about what you drink, the better it tastes. Follow her on Twitter @aleezabeeza. ABOUT THE AUTHOR Allan Roth Allan Roth is an academic by training but a whiskey lover by the grace of God. Since 2012 Allan has worked at Char No. 4, a whiskey bar and restaurant inspired by a passion for bourbon where he manages the beverage program, teaches whiskey classes and curates a selection of over 150 American whiskeys and dozens of others from across the globe. He is also an instructor at The Astor Center and Murrayâ€™s Cheese.  Allan lives in Brooklyn, New York and maintains a small piece of the internet at allanrothwhiskey.com. Follow him on Twitter @allanroth. ABOUT THE AUTHOR Allison Levine Allison Levine is owner of Please The Palate, a marketing and event-planning agency. A freelance writer, she contributes to numerous publications while eating and drinking her way around the world. Allison is also the host of the wine podcast Wine Soundtrack USA and a co-host of Crush On This videos on YouTube. Contact her at allison@pleasethepalate.com . ABOUT THE AUTHOR Alwynne Gwilt Alwynne Gwilt is a Canadian with a Welsh name who lives in England and finds herself frequently jaunting to Scotland and Ireland to learn and write about whisky. She escaped the world of financial journalism after falling head over heels in love with whisky and started her site, Miss Whisky (www.misswhisky.com) in 2011. She has written for dozens of titles on whisky, food, drink and travel and is always on the hunt for a new stand-out dram. Follow her @themisswhisky. ABOUT THE AUTHOR Amanda Gabriele Amanda is a spirits, food, and travel journalist who's called Brooklyn home for a decade. Besides Alcohol Professor , her work has appeared in the publications Matador, Eater, Travel + Leisure and The Manual . When she's not hunting for vintage glassware, you can find her mixing Daiquiris at home or scouring New York City for the best Martinis. Follow: Website | Instagram ABOUT THE AUTHOR Amanda Montell Amanda Montell is an NYU student, freelance writer, blogger, musical hobbyist and Brooklynite. In December 2013, she will acquire a degree in Linguistics and Creative Writing, and we'll see what happens from there. Check out her words at https://amandamontell.com/ and her images at https://www.instagram.com/amanda_montell/ . ABOUT THE AUTHOR Amanda Schuster and Andrew McFetridge Amanda Schuster is a freelance writer, and author of New York Cocktails from Cider Mill Press. Please follow her @winenshine. Andrew McFetridge is a New York City-based writer and sommelier. Follow him on Instagram @andrewmcf ABOUT THE AUTHOR Amanda Schuster Amanda Schuster is a freelance writer, and author of New York Cocktails from Cider Mill Press. Please follow her @winenshine. ABOUT THE AUTHOR Amy Miller Amy Miller is a freelance wine, food and travel writer based in New York City. She recently attained the WSET Diploma and writes about dessert and fortified wines on her blog ladolcevino.com. Follow her on twitter @la_dolce_vino. ABOUT THE AUTHOR Amy Sherman Amy Sherman is editor-in-chief of The Alcohol Professor. She is author of WinePassport: Portugal and has written about beer, wine and spirits for both consumer and industry publications including Wine Enthusiast, Cheers, VinePair, Fodor’s and TimeOut . She is also editor-in-chief of sister publications The Cheese Professor and The Chocolate Professor . ABOUT THE AUTHOR Amy Zavatto Amy Zavatto writes about spirits, wine, and cocktails for Liquor.com , Wine Enthusiast, Imbibe, and a mess of others over the last couple of decades. She is the author of several cocktail books, including The Big Book of Bourbon, Prosecco Made Me Do It: 60 Seriously Sparkling Cocktails, Forager’s Cocktails, and the Architecture of the Cocktail. She very enthusiastically judges the liqueurs category annually for the American Craft Spirits Association. It’s where all the fun is. She studied a lot and got her Level III Certification from the Wine & Spirits Education Trust. Follow her @amyzeats on Twitter and Insta. ABOUT THE AUTHOR Andrew McFetridge Andrew McFetridge is an NYC-based Certified Sommelier, Spanish and French Wine Scholar, and self-described wine nerd. Andrew graduated from The University of North Florida where he received a Bachelor's Degree in Journalism. Andrew is also an ambassador for DO Cava and has had his writing featured in SommJournal Magazine. He enjoys music, world travel, sending postcards, and brand new notebooks. ABOUT THE AUTHOR Andrew Tobia Andrew was born in New York, studied in Boston, and then came back to New York. He likes to read, watch, listen to, eat, drink, and otherwise experience things, and then write things about those things. He has two cats, which he loves too much and talks to far too often. andrew.tobia@gmail.com t: @andrewtobia i: @andrew1tobia ABOUT THE AUTHOR Andrew Wilkin Andrew is a London-born writer who has come a long way from his teenage years spent in the local boozer. Resident in Berlin since 2012, he’s been covering the German and European bar scene for Mixology magazine and has thus become well-versed in all aspects of the biz. A big fan of the gin basil smash, he’s also partial to exploring the harder side of his palette. You can find him in one of Berlin dark, smoky bars, unless it’s summer - when he’ll be more likely lounging on the canal with an extra hoppy IPA. ABOUT THE AUTHOR Andy Smith Andy Smith is a freelance writer, copywriter and editor based in New York. He writes about entertainment, politics, travel and miscellaneous topics that capture his short attention span. He seldom (okay, never) blogs for himself but lots of his 20+ years of writing samples can be found at www.andymsmith.com. ABOUT THE AUTHOR Angelo Veneziano – ABOUT THE AUTHOR Anna Mindess Anna Mindess is a writer living in Berkeley, California, who focuses on food, culture, and travel. Her work has appeared in The Los Angeles Times, The Washington Post, AFAR, Oakland Magazine, Edible East Bay Magazine, among others. In 2018, she was awarded First Place by the Association of Food Journalists for her essay on 1951 Coffee, a refugee-run coffee shop. Anna also works as an American Sign Language interpreter and seeks out Deaf-owned restaurants wherever she travels. ABOUT THE AUTHOR Anne Becerra Anne Becerra is a Certified Cicerone at The Ginger Man in New York City and has a strong passion for craft beer and the community that surrounds it. This year, Anne's very excited to represent the beer industry at a seminar for Tales of the Cocktail in New Orleans about furthering education in the spirits industry.  She teaches classes, judges beer competitions, and has been featured in several local and national media outlets including NBC, Fox and Friends, and TIME Magazine and is a recurring contributor to the popular \"Ask a Cicerone\" column on Serious Eats. She loves spreading the word about great craft beer almost as much as she loves drinking it. ABOUT THE AUTHOR Arthur Hamon Arthur Hamon, known in China as “Monsieur Baozi”, is a French China-based food and wine blogger. After many years working in hospitality industry, he started a wine business in Ningbo, where he frequently organizes tasting and events that feature French and Chinese fine wines. You can find him on WeChat (Monsieur Baozi 包子先生) and instagram @monsieurbaozi . ABOUT THE AUTHOR Ashley Ellen Martin Ashley is a certified sommelier and entrepreneur based in Toronto, Canada where she specializes in wine tasting workshops. She is fond of saying, wine, beer, and spirit is more than just what’s in the glass – it can be the stuff of legend and folklore, it’s language and geography, history, and science – and, it is with great pleasure that she has made telling these stories of provenance and production the focus of her career. ABOUT THE AUTHOR Ashlie Head Ashlie Head is a recent graduate of Florida State University with a degree in English: Editing, Writing, and Media. She recently moved to New York City to begin her career. Ashlie is interested in music, lifestyle, fashion, and travel. Follow her on instagram: @ashliehead. ABOUT THE AUTHOR Ashtin Berry Ashtin Berry is what you would call a Champagne fiend with a scotch habit and a knack for ridiculous, but tasty pairings. Fried chicken and rosÃ© Champagne will change your life! Trust her! She is working towards her WSET (Wine Spirit Education Trust) Diploma with the hopes of continuing on to become a Master of Wine. Follow her on Instagram @thecollectress as she collects experiences across the world and in your city! ABOUT THE AUTHOR Becca Yeamans-Irwin Becca Yeamans has a Bachelor's of Science in Biology from Saint Michael's College in Colchester, VT, and a Masters of Science in Environmental Sciences from the University of Virginia in Charlottesville, VA. She has extensive research experience as well as experience working in the wine industry.  She is a freelance writer with a focus on wine science and research, and is the author/creator of the technical wine blog, The Academic Wino (www.academicwino.com).  You may also follower her on twitter @TheAcademicWino. ABOUT THE AUTHOR Ben Heskett Ben is a technology marketing executive, award-winning former journalist, lifelong music fan, and wine adventurer, always willing to try something new. Inspired by the wine industry around him in California, he started www.CORKZILLA.com, a wine and music blog, in 2010. His Twitter handle is @corkzillasf. ABOUT THE AUTHOR Bernard Kenner Bernard Kenner is a freelance wine educator and writer. His interests are eclectic, becoming adept in wines from all over the globe, including Greece, Italy, Spain, Portugal, Chile, Argentina, Soviet Georgia,  Mexico, Canada, Croatia, Lebanon, Israel, France, Germany, as well as many of the wine growing regions within the United States. When he finds something interesting  to share with the world, his occasional writings can be found on isantemagazine.com, quiniwine.com  and other outlets.\nIn addition to writing, he happily hosts wine themed events such as bridal showers, birthday parties, industry and private tasting events, wine dinners and corporate team building sessions. ABOUT THE AUTHOR Betsy Andrews Betsy Andrews is an award-winning food, drink, and travel writer. She is contributing editor at Food & Wine and at SevenFifty Daily. She writes for many other publications, including Travel & Leisure, Condé Nast Traveler, the Wall Street Journal, VinePair, Serious Eats, and Plate. She is the former executive editor of Saveur and a former New York Times dining critic. You can find all her clips at betsyandrews.contently.com . She is also a poet. Her third book, Crowded, is now out from Nauset Press . ABOUT THE AUTHOR Betty Teller Betty Teller is a food writer and copy editor based in Napa, CA. Previously she had a lengthy career in museum exhibition development that culminated as exhibitions director of a (now sadly defunct) food and wine museum. She is mostly retired — but always willing to forget that to check out a new restaurant, bar, tasting room or food truck. Her humor/food column Amuse-Bouche has appeared regularly in the Napa Valley Register since 2005. ABOUT THE AUTHOR Bill McMahon Bill McMahon is a freelance writer, copywriter and content producer.   He is the author of several published secondary level textbooks and teaching guides, as well as email copy, promotional materials, online content, blogs, and business communications. He is also a published and produced playwright, as well as a screenwriter. His sitcom pilot is in development with Kierstead Productions, and you can find more of his writing on his website www.storytellingcontent.com. ABOUT THE AUTHOR Bozkurt Karasu Bozkurt \"Bozzy\" Karasu (@bozkurtkarasu) moved to NYC in 2003 to join The Wooster Group as their Production Manager after working as a freelance performing arts production manager and designer in Istanbul, Turkey for 13 years. In 2012 he moved to Cambridge, MA this time to join Theater Arts at Massachusetts Institute of Technology as a Technical Instructor. He regularly tastes whisk(e)y and blogs about it at tire-bouchon. ABOUT THE AUTHOR Brian Petro Brian Petro, a native of the great state of Ohio, found himself in the town of Dayton after graduating from the Cleveland Institute of Art. His path has wound through the design, education, and restaurant industries, all of them adding a little something to the overall flavor of his creative endeavors. The first time he stepped behind a bar, it felt like home. Ever since, he has absorbed all of the liquor knowledge he can find, from culture to history to recipes, and done his best to share what he knows with the world. Or, at least the readers of Dayton Most Metro, where he is the writer about all things cocktail. He also likes the word 'Brilliant'. ABOUT THE AUTHOR Camper English Camper English is a cocktails and spirits writer and educator and the author of Doctors and Distillers , and the Tales of the Cocktail Award-winning The Ice Book . His websites are Alcademics and CocktailSaf e . You can also find him on instagram.com/alcademics . ABOUT THE AUTHOR Cari Shane Cari Shane is a DC-based freelance journalist who writes on subjects she finds fascinating — especially science, medicine and health. Cari’s work can be found in a wide variety of publications from The Washington Post Magazine to Scientific American. ABOUT THE AUTHOR Carole Rosenblat Carole Rosenblat is a traveler through and through. Whether she’s working on a cruise ship, leading a tour, managing a corporate event, volunteering, or just learning about a different culture, she’s constantly on the go. She’s traveled to 67 and has temporarily settled in Budapest where she loves learning about the reinvigorated Hungarian wine industry. She also owns Drop Me Anywhere Tours for Women. Her bylines include National Geographic, CNN, The Daily Beast, AFAR, Atlas Obscura, and DAME Magazine among others. ABOUT THE AUTHOR Carrie Dykes Carrie Dykes is a Hudson Valley-based journalist covering wine, food, travel, and everything in between. She has bylines in Wine Enthusiast, SOMM TV, Lonely Planet, and AFAR among others. In addition to writing, she also serves as a wine judge for several highly-regarded international competitions. In her downtime, she is usually finding treasures in thrift stores and forest floors. ABOUT THE AUTHOR Carrie Honaker Carrie Honaker is a freelance writer who is not sure where she will land next, but it will involve messy eating, a spicy Tempranillo and finding the local dive bar. Her work has been featured in Wine Enthusiast, Bon Appetit, and others. You can find her on Twitter and Instagram @writeonhonaker . ABOUT THE AUTHOR Catherine Balston Catherine Balston is a freelance writer based in São Paulo, Brazil. She writes about food, travel and culture for publications that include BBC Travel, The Telegraph and Monocle. Catherine has authored a number of Brazil guidebooks, including for Fodor's, Wallpaper* and Louis Vuitton’s City Guide series. Catherine is always on look out for interesting food stories, especially those that involve cheese. Follow her on Instagram https://instagram.com/squeezeoflime or get in touch via www.catherinebalston.com . ABOUT THE AUTHOR Catherine Fallis Catherine Fallis (“fall is”) is is the world’s 5th female Master Sommelier and the founder of Planet Grape LLC, a wine consulting firm providing content, reviews, corporate and private tastings, restaurant wine program development, and speaking services. She founded Planet Grape Wine Review and her latest book is Ten Grapes to Know, The Ten and Done Wine Guide. ABOUT THE AUTHOR Cecilia Hae-Jin Lee Cecilia Hae-Jin Lee is a food and travel writer, photographer, producer and a chef. A James Beard Award nominee, she was a restaurant critic and food writer for the LA Times for nearly two decades. She has authored several books, including cookbooks on Mexican and Korean cuisines. When she's not climbing a mountain somewhere, she paints, cooks and gardens in Los Angeles. Follow her on Instagram @littlececilia1 and Twitter @littlececilia . ABOUT THE AUTHOR Cha Cababaro Cha Cababaro is a freelance creative who manages websites and creates content for different international brands across various industries. Currently, her day is made up of 60% parenting, 20% writing for Jet Gift Baskets (which has a professionally curated wine collection ), 10% shuffling her Discover Weekly on Spotify, and 10% spacing out. ABOUT THE AUTHOR Chris Wertz Chris Wertz is a veteran of the beverage business for more than 20 years. He is author of Brooklyn Spirits: Craft Distilling and Cocktails from the World's Hippest Borough, and co-founder of the amaro consulting company bitter.wine. ABOUT THE AUTHOR Christina Brooks Christina Brooks is a wine professional with ilovewine.com —a site devoted to wine information and appreciation. Her goal is to help people to gain a deeper understanding of wine by exploring its many facets through accessible, entertaining, and inspiring content. ABOUT THE AUTHOR Christine Campbell An avid traveler and lover of all things wine, Christine holds her WSET Advanced Level 3 certificate with Distinction. Driven by her passion, she started and completed her French Wine Scholar (FWS) course graduating with Highest Honors and is continuing with the inaugural Master of Champagne course through the French Wine Society.  Based in Vancouver, Canada, Christine sits on the B.C. VQA wine assessment panel and is a wine educator.  Every #WineWednesday, Christine writes on her blog girlsgogrape.com.  Follow her on twitter @girlsgogrape. ABOUT THE AUTHOR Christine Clark Christine Clark is a professional cheese and beverage nerd. She is a Certified Cheese Professional by the American Cheese Society. Her work has appeared in VinePair, Bon Appetit, Travel + Leisure, and AFAR and she has taught cheese and pairing classes across the United States. In her spare time, she plays with her chocolate lab and thinks about what she'll be eating next. Follow her latest adventures @yourcheesefriend or yourcheesefriend.com . ABOUT THE AUTHOR Cognac Expert cognac-expert.com is the leading online platform for all things related to Cognac. Founded a decade ago by brother-sister team, Max and Sophie, their love of this iconic French drink was literally written into their genes, thanks to the family estate in the Cognac region with over three generations of family history.\nToday the website has a global readership numbering into the hundreds of thousands, and is a place where Cognac lovers can discover more about their passion, communicate with others of a similar interest, and purchase Cognac from the heart of the region to be delivered anywhere around the world.\nFollow Cognac-Expert on social media:\nInstagram @cognacexpert\nFacebook https://www.facebook.com/cognacexpert/\nTwitter @cognac-expert https://twitter.com/cognac_expert ABOUT THE AUTHOR Colleen Newvine Colleen Newvine is a Brooklyn-based freelance journalist and marketing consultant with a passion for great cocktails and farmers' market produce.  She blogs about living life intentionally (https://newvinegrowing.wordpress.com) and helps her artist husband, John Tebeau, explore bars for his Great Good Places series. Follow her on Twitter @cnewvine. ABOUT THE AUTHOR Courtney Schiessl Courtney Schiessl is a Brooklyn-based wine journalist, educator, and consultant who has held sommelier positions at some of New York’s top restaurants, including Marta, Dirty French, and Terroir. Courtney has written for Forbes.com , SevenFifty Daily, SOMM Journal, Tasting Panel Magazine, and VinePair, among other publications, and she is currently pursuing the WSET Diploma in Wines. Follow her Champagne-fueled adventures on Instagram at @takeittocourt. ABOUT THE AUTHOR Danielle Macdonald Danielle loves sipping on the perfect beverage whilst exploring and reviewing both its characteristics as well as its image. With numerous articles covering various product genres, her love of journalism and branding has transformed into her profession. With a degree in creative writing, a course at The London School of Journalism, and a desire to lose herself in words and dare one say it- alcohol, Danielle is one happy, creative and beverage passionate woman.\nFind her on Linkedin at https://www.linkedin.com/in/danielle-macdonald-94991ba4/ ABOUT THE AUTHOR Demian and LeNell Camacho Santa Ana Husband and wife team Demian and LeNell Camacho Santa Ana have over 30 combined years in the beverage industry.  Together, they opened and managed Casa Coctel, a reservation only bar, in Baja California Sur, Mexico before landing in Birmingham, Alabama. They are currently working on a children's book Mommy & Daddy are Bartenders in honor of their daughter Damiana. ABOUT THE AUTHOR Devon Trevathan Devon Is a writer and producer based in Nashville, TN. She loves to travel, drink, take pictures of cocktails and inhale food. You can follow her @devontrevathan on Instagram and Twitter. ABOUT THE AUTHOR Devorah Lev-Tov Devorah Lev-Tov is a food, drinks, and travel writer based in Brooklyn, New York. She has written for publications including The New York Times, Saveur, Eater, October, Robert Parker Wine Journal, Tasting Table, Food & Wine, Conde Nast Traveler, Vogue, Zagat, USA Today, Thrillist, and more. She's traveled to France, India, Italy, China, Israel, and beyond, visiting wineries, distilleries and breweries along the way. ABOUT THE AUTHOR Dorothy Hernandez Chicago native Dorothy Hernandez is an editor and writer who is eating and drinking her way through her adopted home of Detroit. She has written for numerous online and print publications, including the Chicago Tribune's RedEye edition, The Detroit News and patch.com. Her love of exploring the best food and drink a city has to offer led her to co-found Epic Brew Tours, which specializes in craft brewery tours in Michigan.\nfacebook.com/epicbrewtours\ntwitter.com/epicbrewtours\nConnect with her on Twitter at @lennie7vk. ABOUT THE AUTHOR Dy Godsey Dy Godsey is a published mixologist, consultant and bartender currently working in Wisconsin. More Low-ABV cocktails can be found on her website, www.funbehindbars.blogspot.com ABOUT THE AUTHOR Elisa Shoenberger Elisa Shoenberger is a freelance writer and journalist in Chicago. She has written about food and drink for Wine Enthusiast, Huffington Post, Rewire, Midwesterner, Farm Flavor, and others. She also has written for the Boston Globe, US News and World Report, WIRED Magazine, and others. She has a B.A. in Latin American History from the University of Chicago, M.A. in Latin American Studies from the University of Wisconsin-Madison, and an M.B.A. in Marketing and Operations Management from Loyola University Chicago. Twitter: @vogontroubadour and at Mischief and Writing . ABOUT THE AUTHOR Ellen Kanner E llen Kanner is the author of Miami Vegan: Plant-Based Recipes from the Tropics to Your Table and the award-winning book Feeding the Hungry Ghost: Life, Faith and What to Eat for Dinner. She writes about the intersection of food, culture, community, wellness, and sustainability for outlets including HuffPost, VegNews, and Edible South Florida. She’s a vegan advocate and culinary instructor, recipe developer for major brands, and the creator of the Substack newsletter Broccoli Rising . A fifth generation Miami native, she lives with her husband in — where else? — Miami. ABOUT THE AUTHOR Elsa Holmberg Finnish citizen, born in Stockholm, Elsa worked as a cocktail bartender in Nottingham while studying for her Master’s thesis on temperance in 19th Century America. After juggling various ambassador roles in the USA, UK and Scandinavia, she eventually moved to London to work in marketing for various independent Scotch brands. Having left the corporate world, she now focuses on writing about food, drinks, travel and sustainability. Follow her: @elsamixalot ABOUT THE AUTHOR Em Sauter Em Sauter is an Advanced Cicerone®, author, beer judge and public speaker who runs the award winning website Pints and Panels which focuses on visual beer education. More info: www.pintsandpanels.com. Follow her on Twitter and Instagram @PintsandPanels. ABOUT THE AUTHOR Émilie Steckenborn Émilie Steckenborn is a certified sommelier, foodie, and host, and creator of the Bottled in China podcast and blog. Having lived in Shanghai, China, for over 10 years, Émilie oversees wine programs for top-tier businesses in Asia, including serving as the wine consultant for China Eastern Airlines. Her signature podcast, Bottled in China, shares the stories and adventures of passionate individuals, thought leaders, and business leaders in the F&B scene who are shaking things up around the world. In 2019, Émilie was named one of the top future influencers in the global beverage industry. ABOUT THE AUTHOR Emily Paster A lawyer turned food writer, Emily Paster brings passion, a sharp intellect and attention to detail to her globally-inspired, Jewish cuisine. She is the author of four cookbooks, including the best-selling Epic Air Fryer Cookbook. Her latest book is Instantly Mediterranean: Vibrant Satisfying Recipes for Your Instant Pot, Electric Pressure Cooker & Air Fryer . Emily lives outside Chicago with her husband and two ravenous teenagers. Find more of Emily’s recipes on her blog West of the Loop . ABOUT THE AUTHOR Emma Criswell Emma Criswell is head of the \"Grain Team\" at Deussen Global Communications, a sales associate at Frankly Wines and a freelance marketing consultant for wine, spirits and culinary brands. A certified sommelier, she loves funky wines, loose leaf tea and running half marathons. She doesn't love bell peppers, or red onions. Follow her on instagram @emmacriswell. ABOUT THE AUTHOR Emma Krasov Emma Krasov is a journalist, author, food and wine writer, a panelist for San Francisco International Coffee Festival and San Francisco Pistahan Festival of Filipino Food, a judge for the San Francisco International Chocolate Salon, The Best in the West Nugget Rib Cook-off (Sparks, Nevada), and San Francisco International Fragrance Salon. She regularly contributes articles about food and wine, art, entertainment, and travel to Real Travel Adventures online magazine, Kstati Russian-American newspaper, and her own award-winning blog, Art and Entertain Me. Look for Emma’s articles at: Real Travel Adventures , Kstati , and Art and Entertain Me .  Follow her on Facebook and Instagram . ABOUT THE AUTHOR Eric Zillier For 15 years Eric Zillier has worked as a sommelier or wine director at some of New York's finest restaurants including Veritas, Alto and Gotham Bar and Grill.  He is currently working on a book about his experiences in the wine business. ABOUT THE AUTHOR Flora Tsapovsky Flora Tsapovsky is a style, food and culture writer splitting her time between San Francisco and Tel Aviv. She has contributed to publications including San Francisco Chronicle, Bon Appetit, Afar and VinePair. She liked the wine spritzer before everyone else. ABOUT THE AUTHOR Francine Cohen Francine Cohen is Editor in Chief of www.insidefandb.com, a regular contributor to Beverage Industry News and www.hotelinteractive.com and a hospitality and spirits industry consultant.  She splits her time between developing successful brand marketing strategies and writing about the business of the f&b and hotel industries. Based in NYC, but happy to continue to travel the world, she has an appetite for great food and drink. Especially cheese. And snails. ABOUT THE AUTHOR Frank Dobbins Frank Dobbins is a whiskey writer from New Jersey with a focus on America’s Native Spirit. When he’s not writing about spirits you can find him on Instagram @BourbYourEnthusiasm and @BourbEnthusiam on Twitter, where he spends his time interviewing industry luminaries, cracking wise, and doing what he does best: encouraging people to bourb’ their enthusiasm. ABOUT THE AUTHOR Gabrielle Pharms Gabrielle Pharms is a Texas-based writer covering all things booze, music, and travel related. Bylines can be seen via VinePair, The Bourbon Review, Billboard, W Magazine, plus many other outlets. You can catch her at a music festival with flowers in hair and a cocktail in tote. Just make sure it’s whiskey. Follow her on Twitter @gabbynikki . ABOUT THE AUTHOR Gail Ann Williams & Steve Shapiro Gail Ann Williams and Steve Shapiro are longtime San Francisco residents and beer appreciators who have written for publications such as Celebrator Beer News, BeerAdvocate Magazine, CraftBeer.com , Beer Paper LA and others since they launched their own site, BeerbyBART.com , in 2007 to help locals and visitors explore their local beer scene via public transportation. Gail is also a Certified BJCP beer judge. The couple places a personal priority on traveling to meet beer people and trying fresh beers from the source, with select cultural and outdoor destinations tacked on for good measure. ABOUT THE AUTHOR Gary Schwind Gary Schwind is a music journalist and beer enthusiast who learned pretty much everything he knows about beer from Bart Bullington, formerly of Laguna Beach Brewing Company. In addition to being a beer aficionado, he is also an avid fan of music who has had the opportunity to interview countless music artists, including Grammy nominees. He lives in Orange County, California. You can find his music features on glidemagazine.com and americanahighways.org . ABOUT THE AUTHOR George Koutsakis As a half-Greek Scotsman, who previously lived and worked in Japanese whisky industry for years, George Koutsakis is a spirits writer specializing in Japanese whisky, world whisky, and spirits. Aside from Alcohol Professor, he currently writes for Liquor.com, Saveur Magazine, Wine Enthusiast, Distiller.com, and acts as head of content for Dekanta. ABOUT THE AUTHOR Georgia Freedman Georgia Freedman is a freelance journalist and editor based in the Bay Area. Georgia has written for Food & Wine, the Wall Street Journal, Afar, Martha Stewart Living, and many other publications and is the author of two cookbooks. She also produces the newsletter the California Table , which celebrates home cooks and home cooking from all across her home state. ABOUT THE AUTHOR James Reddicliffe James Reddicliffe is the co-founder and editor-in-chief of BK Beer Review , a blog that covers all things beer in the five boroughs. His work has been featured in the New York Times, and when he is not writing about beer or spirits, you can find him spending time with his wife and 10-week-old son Graham, who enjoys bottles of a different kind. Follow him on Instagram and Twitter at @bkbeerreview. ABOUT THE AUTHOR Jens Kerger Jens is a freelance bartender in Dresden, Germany who decided he'd rather be a good host, than a mechanical engineer. As of the moment he mainly does guest shifts, spreading the knowledge he acquires and learning with each new bar he gets to \"blow up,\" while seeking a position outside of the country. He also a brand ambassador for Absyntheum Absinthe in Germany. ABOUT THE AUTHOR Julie Kendrick Julie Kendrick is a Minneapolis-based food writer with bylines in HuffPost, Condé Nast Traveler, EatingWell and Delta Sky. Follow her on Twitter @KendrickWorks . ABOUT THE AUTHOR Haley Forest Having worked in the Hospitality sector for nearly 15 years, Haley Forest has experienced first hand the blood, sweat, tears, and manic joy that comes with it. After being involved in almost every aspect of the industry, from chef to bartender, vendor to general manager, she now is a writer and consultant, traveling around the world exploring bar communities and helping the industry progress as a whole. Follow the adventure at @HCForest. ABOUT THE AUTHOR Hannah Walhout Hannah Walhout is a writer, editor, and eater in New York City. When she isn't busy writing, she enjoys cooking, eating shawarma, traveling, and wondering whether or not the obscure beverages she buys during her travels will be confiscated at the border. Follow her on Instagram at @lunchtime_somewhere. ABOUT THE AUTHOR Hollie Stephens Hollie Stephens is an award-winning freelance writer originally from London and currently based in New Mexico. Her writing has appeared in VinePair, Pellicle, Hop Culture, and other publications. View more bylines at holliestephens.com , and follow her on Twitter @GlobeHops ABOUT THE AUTHOR Jackie Armstrong Jackie is a freelance writer and blogger. She is the founder of One Girl's Dish, a blog dedicated to food and drink events in New York. ABOUT THE AUTHOR Jackie Summers Jackie Summers is the founder of Jack From Brooklyn, and the creator of Sorel Liqueur. Follow him on Twitter and Instagram @TheLiquortarian. ABOUT THE AUTHOR Jake Emen Jake Emen is a spirits, food and travel writer currently based in Washington, D.C. His drinks coverage has been published in Whisky Advocate, Eater Drinks, Tales of the Cocktail, Washington Post Express, Distiller, The Whiskey Wash, Tasting Table, and a range of other outlets. He also runs his own site, ManTalkFood.com, and can be followed on Twitter, @ManTalkFood. ABOUT THE AUTHOR Jason Horn Jason Horn's first published story as a professional journalist (well, intern) was called \"Whiskey 101,\" and he's never looked back. He's been writing about drinks, food, travel and cannabis for more than 15 years, including as senior editor at Liquor.com , spirits columnist at Playboy.com and freelance contributor to lots of other publications. Follow him at @messyepicure on Twitter and Instagram or at themessyepicure.com ABOUT THE AUTHOR Jeanette Hurt Jeanette Hurt is the author of 15 books on food and drink, including Wisconsin Cocktails, Drink Like a Woman, The Joy of Cider, The Cheeses of Wisconsin and more. She is also the cheese and spirits contributor to Milwaukee Public Radio. ABOUT THE AUTHOR Jennifer Billock Jennifer Billock is an award-winning writer, bestselling author, and editor; co-host of the Macabre Traveler podcast; and editor of the Kitchen Witch Newsletter . She is currently dreaming of an around-the-world trip with her Boston terrier. Check out her website at jenniferbillock.com , and follow her on Twitter @jenniferbillock and Instagram @jenniferjoanbillock . ABOUT THE AUTHOR Jim Gladstone Jim Gladstone has written extensively about the arts, cuisine and travel. He is a freelance writer and creative consultant based in San Francisco. www.jimgladstone.com . ABOUT THE AUTHOR John Pomeroy John Pomeroy is the epitome of balance â€“ in life and in his cocktails. Bitten by the hospitality bug in high school and continuing through college, he used his skills to move ahead when others may have thrown in the towel â€“ literally. John went from dish washer, to busser, to waiter before finding his stride at the bar. He worked as a bartender through college at the award-winning Montrio in Monterey, CA.  It wasnâ€™t long, though, before he was recruited to open the Bernardus Lodge in Carmel Valley. Here he had the opportunity to work with and learn from world-renowned chef Cal Stamenov, and sommelier Mark Jensen, formerly of the Highlands Inn. He then went on to graduate school at the University of California at Santa Cruz, where he earned his Masters in Education, as well as the credentials he needed to be an English teacher.\nHis passion, interest, and curious nature about food and spirits remained powerful influences. While developing his knack for identfying flavors on the plate he excelled when it came to working with spirits from distillation to the creation of cocktails. Today, he is able to blend his educational training and passion by working as a spirits advocate and educator, consultant, brand ambassador and journalist.\nHis work has been featured in several magazines, and he recently wrote the cover story for Bar Business. With his active participation in the United States Bartenders Guild, New York Chapter (USBGNY) he has spent the past four years developing and solidifying relationships in the industry, affording him the opportunity to work with many of the most respected names in the business. \nIn addition to working closely on many of New York City's best cocktail programs, he has also consulted Las Ranitas, an eco-resort in Tulum, Mexico, as well as several other venues around the United States.  Additionally, his work with Purity Vodka as their national brand ambassador has garnered him even more respect and credibility within the industry, and he regularly contributes to seminars and trainings sessions at cocktail events the world over. ABOUT THE AUTHOR John Reed John Reed is the beverage director for Potash Markets in Chicago. He is an accredited WSET2, and has studied wine all over the world. John has also worked with the Beverage Tasting Institute rating wines professionally. With almost a decade buying and studying wine he has gained a unique perspective into the wine industry. ABOUT THE AUTHOR Josh Powell – ABOUT THE AUTHOR Josh Feldman and Peter Silver – ABOUT THE AUTHOR Joshua Lurie Joshua Lurie founded FoodGPS.com , a Los Angeles based company that showcases the best-tasting food and drink through online coverage and custom culinary tours. Follow him on Instagram . ABOUT THE AUTHOR Karan Nagpal – ABOUT THE AUTHOR Kathleen Willcox Kathleen Willcox has been writing about the business and culture of wine and food for more years than she’d care to reveal. Her work appears regularly in Wine Searcher, Wine Enthusiast, The Vintner Project and many other publications. Kathleen also co-authored a book called Hudson Valley Wine: A History of Taste & Terroir, which was published in 2017. Follow her wine explorations on Instagram at @kathleenwillcox . ABOUT THE AUTHOR Katie Lockhart Katie Lockhart is a travel and food journalist, copywriter and content creator traveling full-time around Asia. She writes for National Geographic, Travel + Leisure, Conde Nast Traveler, Robb Report, Afar and many more. You can follow her work and adventures on Instagram @findyourhappyplate . ABOUT THE AUTHOR Katrina Lobley Katrina Lobley writes about travel, food, and wine – in short, all the good things in life – and lives in Sydney, Australia. She writes for newspapers including The Australian, The Sydney Morning Herald, and The Saturday Paper . Follow her adventures on Instagram @katrinalobley . ABOUT THE AUTHOR Kaya Johnson Kaya Johnson is a professional interpreter from Yorkshire, UK, who is fond of writing and traveling. She enjoys sharing articles on various topics and dreams of writing a bestseller one day. She hosts this website. ABOUT THE AUTHOR Keith Allison Keith Allison is a freelance writer, traveler, and professional imbiber raised in Kentucky and living in New York City. His goal in life is to be Nick and Nora Charles. He’s also the author of the book Cocktails and Capers: Cult Films, Cocktails, Crime and Cool. ABOUT THE AUTHOR Kelly Magyarics Kelly Magyarics, DWS, is a wine, spirits and lifestyle writer, and wine educator, in the Washington, D.C. area. She can be reached through her website www.kellymagyarics.com or follow her @kmagyiarics. ABOUT THE AUTHOR Kenneth Haynes Kenneth Haynes is a Molecular Gastronomist and also a Content Creator who loves to approach the matter of social, artistic and technical aspects of food and drinks. You can read more of his articles on TodayTopReviews.com, a review site that focuses on three niches: wine, beer and cheese. ABOUT THE AUTHOR Kevin Gibson Kevin Gibson is a Louisville, Ky.-based writer who writes about breweries, restaurants and the great city he calls home. He loves the Green Bay Packers, loathes cucumbers and once interviewed Yoko Ono (pissed her off a little, too). He also is author of \"Louisville Beer: Derby City History on Draft\" and other books, and plays in a band called the Uncommon Houseflies. When he isn't running around town chasing stories or poised at his trusty laptop writing, you can often find him at one of the local breweries or chilling on his couch with his trusty sidekick Atticus. Check out KevinGibsonWriter.com to find out more about his books and why he does what he does, or feel free to call him names on Twitter: @kgramone . ABOUT THE AUTHOR Kim Westerman Kim Westerman is a certified sommelier and licensed Q-grader, and has been writing about beverages and their various intersections with culture for more than 20 years. She is based in Berkeley, California, where she explores the sensory parallels between coffee and wine at Hedonic Terroir-Driven Coffee , the roastery she founded in 2019 to bring awareness to the influences of terroir — a household word among wine drinkers — on your morning cup of coffee. Follow her on Instagram @hedoniccoffee and @throughtraveler. ABOUT THE AUTHOR Kristine Hansen Kristine Hansen is a Milwaukee food, drink, travel, and design writer and author of Wisconsin Cheese Cookbook: Creamy, Cheesy, Sweet, and Savory Recipes from the State's Best Creameries and Farmers Markets: Tours, Trails and Attractions , both from Globe Pequot Press. She also contributes to Milwaukee Magazine , nationalgeographic.com , architecturaldigest.com , travelandleisure.com , and marthastewart.com . ABOUT THE AUTHOR Laine Doss Laine Doss is the food and spirits editor for Miami New Times . She has been featured on Cooking Channel's Eat Street and Food Network's Great Food Truck Race . Laine won an Alternative Weekly award for her feature about what it's like to wait tables. A tiki cocktail aficionado, Laine is a judge at the annual South Beach Wine & Food Festival Art of Tiki event and competition and has an extensive collection of tiki mugs from bars she has visited around the world. ABOUT THE AUTHOR Laren Spirer New York Contributing Editor Laren Spirer is yet another lawyer (and freelance writer) obsessed with food and drink, who also blogs at Sweet Blog oâ€™ Mine and tweets at @sweetblogomine. She has written for Gothamist, Serious Eats, Time Out New York and Tasting Table. ABOUT THE AUTHOR Leilani Vella Leilani finds delight in the bittersweet and salty, and has been known to drink vermouth in the afternoon and sherry in the shower. She began bartending in Italian restaurants in NYC as a means to pursue an environmental biology degree at Columbia University. Her boozy curiosity first developed in her interest of biodynamic oenology while she poured in Italian wine bars to supplement to her role an ecologist for the NYC Parks Dept. Upon moving to San Francisco, she bartended in seasonally inspired restaurants and immersed herself in the world of cocktails. Her work in brand strategy for independent spirits led her to become acquainted with many the characters and traditions of bars throughout North American and Europe as she visited over 150 distilleries. Today she lives in Venice California, serves on the board of Art Beyond the Glass, and can often be found serving G and T’s while sailing across the bay. ABOUT THE AUTHOR LeNell Camacho Santa Ana LeNell Camacho Santa Ana once boasted the world's largest American whiskey selection in a retail store in her eponymous Brooklyn shop.  She plans to get her brag on again--this time back home in Bama. ABOUT THE AUTHOR Lincoln Chinnery Lincoln C. Chinnery III is a freelance cocktail journalist who has written for Edge Publications, AM New York, Metromix and VODA. Lincoln enjoys all the major spirits - Bourbon, Whiskey, Rye and is never too far from his next drink. He's a reader of all thngs related to cocktails and comic books.You can read his bar and liquor reviews at have http://haveglasswilldrink.blogspot.com/ and reach out to him on Twitter @Lincolnwrites. ABOUT THE AUTHOR Lisa Futterman Lisa Futterman, ACS CCP, is a cheese monger and freelance beverage journalist based in Chicago. Her love of cheese, wine, and spirits has taken her all over the world—from the Comté aging rooms in Fort St. Antoine in the Jura to the wild agave fields in the desert outside of Oaxaca. ABOUT THE AUTHOR Liz Susman Karp Liz Susman Karp writes about culinary history and anthropology, foodways, restaurants, and the intersection of food and culture. Her work has been published in Zagat Stories, Times-Union, Inside Hook, Modern Farmer, Hudson Valley Magazine and Westchester Magazine, among others. She feels fortunate to live in New York’s Hudson Valley, where she enjoys exploring the area’s rich agricultural heritage and offerings. ABOUT THE AUTHOR Lori Rice Lori Rice is a food and beverage writer who discovered a passion for beer and world travel over a decade ago while sitting in a biergarten in Vienna. She is a Certified Beer Server and the author-photographer of the beer cookbooks Food on Tap and Beer Bread. Lori resides next door to California’s wine country and she has yet to turn down any opportunity to catch up over a drink. Learn more about her writing and photography at loririce.com or follow her on Instagram @lori_rice . ABOUT THE AUTHOR M. T. Eley M. T. Eley is an Ohio-born writer currently living in the San Francisco Bay Area. His work is featured in The Bold Italic, Gilbert!, USA Today, The Columbus Dispatch alongside other outlets. Alongside writing, he enjoys old fashioneds, old books and old souls. You can follow his perpetual 20th-century existence on Instagram @MTEley and Twitter @M_T_Eley. ABOUT THE AUTHOR Madeline Blasberg Madeline Blasberg is a Certified Wine Consultant currently working for Etching Expressions (http://www.etchingexpressions.com/) as Official Wine Commentator & Reviewer. She has spent time living in Mendoza, Argentina where she was surrounded by wine, both personally and professionally. ABOUT THE AUTHOR Maggie Kimberl Maggie Kimberl is a bourbon writer focusing on bourbon culture and tourism in Louisville and Kentucky. When she's not covering the bourbon beat you can find her browsing through vintage vinyl with her kids or tending to her homegrown tomatoes. Follow her on Twitter, Instagram and check out her blog. ABOUT THE AUTHOR Manny Gonzales Manny Gonzales is General Manager and Beverage Director at Foundry on Elm and Saloon in Davis Square, Somerville Massachusetts where he has created one of the most compressive whisk(e)y menus in the North East. When he is not hiking with his family or planning spirit classes at his restaurants he can be found by his fireplace sipping drams of Scotch or Mezcal finding inspiration for his blog Life by the Drop http://blog.saloondavis.com. ABOUT THE AUTHOR Maria C. Hunt Maria C. Hunt , is a California-based journalist specializing in cultural stories around food, wine, design, and wellness. Her work has appeared in Esquire, Wine Enthusiast, Dwell, Architectural Digest, Elemental, The New York Times, and Christian Science Monitor. She’s the author of The Bubbly Bar: Champagne + Sparkling Wine Cocktails for Every Occasion (Clarkson Potter, 2009). ABOUT THE AUTHOR Mark Marnell Mark Marnell, is a semi-retired Chemist who left the corporate life for a far more rewarding endeavor, Beer Journalism. As a Freelance Writer, Hudson Valley NY Craft Beer Columnist and Beer Blogger, he is discovering the rest of his life, one sip at a time. When not writing about beer or drinking it, he is selling his first ever Craft Beer Crossword Puzzle Book. His motto is Cheers, Beers and New Frontiers! Catch him on Twitter at @MarnellBeer or on his website at www.marnellbeer.com. ABOUT THE AUTHOR Marnie Ann Joyce – ABOUT THE AUTHOR Mary Charlotte Elia Mary Charlotte Elia works at The Birch Bar, (http://www.thebirchbar.com/), in Norfolk, VA when she's not otherwise writing curriculum for Sunday school, singing recitals of 19th century German art songs, or presenting papers on 3rd century heretics. She blogs at Water Into Beer and tweets at @CharlotteElia. ABOUT THE AUTHOR Marysa Mitch Marysa Mitch is a freelance writer focusing on spirits, beer, and wine.  She shares her love for all things food and drink related on her blog, limerence + liquor.  You can also follow her on Twitter at @msmarysa. ABOUT THE AUTHOR Matt Archambault Matt Archambault is a beer enthusiast based in NYC.  With over 15 years of experience behind a bar, Matt is the Amazon.com of beer - if you like this, you may also like...  Join him in his own personal journey of exploration and discovery on Untappd (https://untappd.com/user/mattarchambault).  In his spare time, Matt has driven a mini-van off a cliff, endured water-boarding, and once appeared on Good Morning America as part of an elaborate prank. Follow him @supercasz. ABOUT THE AUTHOR Matthew Callahan Matthew Callahan is a graduate of Roosevelt University in Chicago, where he earned a B.F.A. in Theatre and had a wonderful eight-year career as a stage and film actor. Eventually, his passion for writing, technology, and web design got the better of him and he dove head-first into a career in geek services. In 2011 Matthew founded Digitalimit, a design and marketing agency specializing in helping entrepreneurs and small businesses find their voice online. From time to time, he also enjoys freelance writing -- especially on the topic of good drinks. Matthew lives in New York City with his wife, and their two wonderful MacBooks. Follow him on Twitter @_thinkertinker. ABOUT THE AUTHOR Meg Roebling – ABOUT THE AUTHOR Melissa Corbin Melissa Corbin is a Tennessee-based travel and culinary journalist with an appetite for the stories of people and places that make the world unique. Published by Food & Wine Magazine, Matador, Craftbeer.com , among others, she believes the best way toward positive change is loving on those around her and attests to its exponential benefit. You never know where she’ll turn up next. So, give her a holler over on Instagram @melcorbin . ABOUT THE AUTHOR Michele Herrmann Michele Herrmann writes about travel, hotels, food and drink, history, arts and culture and other fun stuff for various publications and travel and lifestyle companies. ABOUT THE AUTHOR Mike Groener Trying to intersect culinary innovation with the art of distillation. Let's disambiguate the industry of alcohol and share the research. Program manager, distiller, and creator.\nFollow Genius Gin @geniusliquids. ABOUT THE AUTHOR Natasha Bazika Natasha Bazika's writing has taken her around the world. She's covered everything from wine to resorts and dining. She writes for CNN Travel, Travel + Leisure, Vogue Living, and Thrillist Australia. Follow her adventures on @natashagracebazika . ABOUT THE AUTHOR Neal Bayless – ABOUT THE AUTHOR Nicole del Rosario Nicole del Rosario is a beer and spirits enthusiast based in Leipzig, Germany. Training to be an actual professor by day and an alcohol professor by night, she spends most of her mornings pondering Kantian ethics at the university and her evenings drinking her way through Europe. Don't be shy and come say hi on Twitter: @happyhegelian. ABOUT THE AUTHOR Nimantha Siriwardana Nim is the Co-Founder and CTO of Metacask , the marketplace for spirits-backed NFTs. Metacask also offers the spirits industry’s first fully-integrated inventory management, asset tracking, and marketing solution. Nim has over 20 years of experience in delivering technology solutions and previously worked for Goldman Sachs and Source Capital AG. ABOUT THE AUTHOR Noah Lederman Noah Lederman’s writing about the beverage industry has been featured in BBC Travel, Slate, Scientific American, VinePair, and elsewhere. Follow him on Twitter or visit his website . ABOUT THE AUTHOR Nola James Nola James is an Australian food and drink writer who splits her time between Melbourne, Victoria and Hobart, Tasmania. She’s a writer and editor for Wine Companion, Australia’s top wine magazine, and regular contributor for delicious.com.au and The Age newspaper, among others. Follow her on Instagram @nolamjames . ABOUT THE AUTHOR Nora McGunnigle Nora McGunnigle is a beer, food, and travel writer based in New Orleans. Follow her adventures on Instagram at @beerfoodtravels or her website, beerfoodtravels.com. ABOUT THE AUTHOR Pamela Wiznitzer Pamela Wiznitzer has a true passion and zest for the industry that is seen and tasted in every drink she serves. Since 2006, Pamela has been working throughout NYC and currently can be found shaking things up at The Dead Rabbit in the Financial District. She has earned honors from her industry peers such as winning Tyku's 2011 Sake challenge, selected as one of the 20 Diageo World Class 2012 Contestants, a finalist in Pama's 2011 Beyond the Glass. ABOUT THE AUTHOR Pamela Vachon Pamela Vachon is a freelance food and travel writer whose work has also appeared in Wine Enthusiast, Bon Appétit, CNET, and VinePair, among others. She is also a certified sommelier, experienced bartender, voiceover artist, musician, and instructor at NYC's Murray's Cheese. ABOUT THE AUTHOR Pameladevi Govinda Pameladevi Govinda lives in Brooklyn. She has worked at a number of wine shops in New York City. She is also wine, spirits, food and travel writer with a taste for Muscadet, and a penchant for curry. Her work has appeared in Imbibe, Vibe, CITY, IN New York, Serious Eats, Brooklyn Based, Diner Journal and more. Her previously published work and blog can be viewed at www.gajakattack.com. Follow her on Twitter @PamGovinda. ABOUT THE AUTHOR Patrick Reed – ABOUT THE AUTHOR Paul Senft Paul Senft is a Spirits Writer and Reviewer based in Metro Atlanta. His work has appeared in Got Rum? Magazine, Chilled, Distiller, Flaviar, as well as other publications covering a range of subjects related to Spirits, Travel, and the world of cocktails. He founded RumJourney.com and can be found on Facebook . ABOUT THE AUTHOR Penny Sadler Penny Sadler is a travel, wine, and food writer based in Dallas, Texas. Multiple trips to California wine country, as well as Italy and France, inspired her studies with the Wine and Spirits Education (WSET). After a stint in Napa Valley she now focuses on writing about wine through the lens of travel and lifestyle. Her favorite wines are the bottles shared with friends. You can follow her on Instagram @adventuresofacarryon and her travel and wine blog Adventures of a Carry-on . ABOUT THE AUTHOR Pete Slosberg Pete Slosberg started home brewing in 1979, the year it became legal. He went on to start Pete's Brewing Company and created the iconic Pete's Wicked Ale. After becoming the 2nd largest Craft Brewery, Pete's was acquired. Pete became enamored with Belgian beer and discovered Belgian chocolate. He then went on to start Cocoa Pete's Chocolate Adventures, which was acquired after 7 years.  Along the way, he became a certified BBQ judge and also authored the bestseller, Beer for Pete's Sake . He now mentors entrepreneurs at SCORE , an affiliate of the Small Business Administration. ABOUT THE AUTHOR Phil Galewitz Phil Galewitz has been writing about the the craft brewing industry in the Mid-Atlantic states since 2011. He lives in Washington D.C. and South Florida. Twitter: @philgalewitz Instagram: Philmorebeer. He visits over 300 breweries a year across the United States. ABOUT THE AUTHOR Philip Kampe Philip S. Kampe is a veteran wine journalist who contributes to several print and online publications, moderates wine events nationwide and judges competitions. He is a member of the distinguished Wine Media Guild and resides in the both the New York metro area and the Berkshires of Massachusetts. ABOUT THE AUTHOR Phyllis Armstrong Phyllis Armstrong's love of writing and cooking developed early in life. She pursued those passions in her professional career as a freelance writer and as an anchor and reporter for news stations in Memphis, St. Louis and Washington, D.C. She retired from WUSA-TV after 25 years of covering stories in D.C., Maryland and Virginia. She currently writes for Cuisine Noir Magazine . Her articles highlight Black chefs, restaurateurs, food producers, wineries, and innkeepers, both their achievements and challenges. She has a master’s degree in Broadcast Journalism from Northwestern University. Follow Phyllis Armstrong on LinkedIn and on Twitter @sseats ABOUT THE AUTHOR Rashaun Hall Rashaun Hall is a spirits, entertainment and culture writer based in the New York metro area. He firmly believes that after cocktails, the best part of going to a bar are the stories. He shares those stories via his Bar Time Stories Podcast. Find more of Rashaun’s writing here. ABOUT THE AUTHOR Rebecca Treon Rebecca Treon is a Denver-based food, travel, and lifestyles writer. Born and raised in Colorado, she’s also a fluent Spanish speaker. She has visited Mexico, France, Spain, Italy, England, Ireland, Holland, and Argentina and half the states. Rebecca has written for publications like BBC Travel, Huffington Post, Thrillist, Hemispheres, and many others. She’s worked as an editor at American Bungalow and DiningOut and is a correspondent for Denver & the West for Time Out. She’s the author of the forthcoming book, Colorado Food Trails. She is the proud mother of a son and a daughter and can be found at @RebeccaTreon on Instagram. ABOUT THE AUTHOR Rinku Bhattacharya Rinku Bhattacharya loves all things spice and writes the blog Spice Chronicles . She is the author of three cookbooks, including The Bengali Five Spice Chronicles and Spices and Seasons . Rinku can be found online on Facebook , Instagram , and Twitter . ABOUT THE AUTHOR Robert Haynes-Peterson Robert Haynes-Peterson is an editor and writer, recently transplanted from New York City to Seattle. He has covered wine and spirits for over fifteen years for sites such as AskMen, Business Insider, Liquor.com and for a variety of luxury publications. He raises his glass to all the hardworking distillers, blenders, bartenders and hospitality staff around the world. ABOUT THE AUTHOR Robin Goldsmith A British freelance food and drink writer who has a WSET Advanced Certificate in Wines and Spirits and is a member of CAMRA (The UK Campaign for Real Ale).\nRobin reviews food and drink products for individual companies and he regularly writes reports on trade events, such as wine tastings or food and drink shows.\nAdditionally, he has written detailed commercial reports for trade publications and many of his articles have been published on respected industry websites, such as the drinks business, Speciality Food Magazine and hostelbookers.\nWeb : www.thewritetaste.co.uk\nTwitter : @robthefoodie\nFacebook : https://www.facebook.com/TheWriteTaste ABOUT THE AUTHOR Robin Robinson Robin Robinson is a consultant to the craft spirits industry, where he helps small brands identify their unique narratives to penetrate and activate the marketplace and implement sales and marketing strategies. Prior to that, Robin was instrumental in helping to build the Compass Box Whisky Co. in the United States as its U.S. Brand Ambassador and Brand Manager over 34 markets, where he was responsible for distributor management, sales, retail and consumer education. He is the creator of the long running \"Whiskey Smackdown\" educational series at Astor Center NYC.  More information at his website www.robinrobinsonllc.com ABOUT THE AUTHOR Sara Gorelick Sara Gorelick spends her time in the world of spirits, working as an Account Director at Colangelo & Partners by day and a freelance writer by night. Her work has been included on ShakeStir.com, Examiner.com, BarNoneDrinks and other hospitality-related outlets. When Sara isn't working, reviewing or writing, she can be found laughing with family and friends or taking long walks with beagle Bailey. Follow her at @smgorelick. ABOUT THE AUTHOR Sarah Annese Sarah Annese is a freelance writer based in New York City with a focus on craft beer. She co-founded, edits and writes for www.beerunion.com, a website about beer news in NYC. Follow her on twitter @sarahbeerunion or @beerunion. ABOUT THE AUTHOR Sara Havens Sara Havens is a Louisville, Ky.-based freelance writer who pens the popular nightlife column The Bar Belle. She's author of two volumes of \"The Bar Belle,\" has a key to the city, and prefers to bathe in bourbon. If you don't find her out at the bars, you can catch her on Twitter: @TheBarBelle and on Instagram: @BarBelle_Lou. ABOUT THE AUTHOR Sharyn Foulis Sharyn Foulis is a wine educator and retail consultant working in Sydney, Australia. She gets out of bed every morning to find new ways of helping people find wines they will love. ABOUT THE AUTHOR Shoshi Parks Shoshi Parks is a Bay Area-based freelance writer specializing in food, travel and history. Her work has appeared at NPR, Smithsonian, Gastro Obscura, Civil Eats, Vinepair, Vice and a variety of other outlets. Find her online at www.shoshiparks.net . ABOUT THE AUTHOR Stacy Brooks Stacy Brooks is a Minneapolis-based freelance journalist specializing in food and travel. Her writing has been published in Cheese Connoisseur, Wine Enthusiast, and Hemispheres, and she blogs at Tangled Up In Food . ABOUT THE AUTHOR Stef Schwalb Stef Schwalb is a freelance writer and editor who specializes in food, beverage, business, and design. Her work has been featured in Boston Magazine and Boston Home, Designing Lighting, ForceBrands, The SOMM Journal, and Thirsty Magazine. She holds the WSET Level 3 certification and is pursuing ongoing wine and spirits educational opportunities in between deadlines. You can find her on Instagram and Twitter via @StefSchwalb. ABOUT THE AUTHOR Stephanie Rosenbaum Klassen Stephanie Rosenbaum Klassen is the author of 7 books, including A Little Taste of San Francisco, The Art of Vintage Cocktails, World of Doughnuts, Honey from Flower to Table, The Astrology Cookbook, and the Anti-Bride Guide: Tying the Knot Outside the Box . She has written about food, drink, travel, and the arts for numerous print and online publications, including Kinfolk, KQED, San Francisco magazine, Edible East Bay, Edible Brooklyn, Time Out NY, Chow, and the San Francisco Bay Guardian . ABOUT THE AUTHOR Susan B. Barnes Susan B. Barnes is as comfortable bicycling through Italian olive groves and SCUBA diving the wall of sharks in Fakarava as she is sipping bubbles at a Champagne house and dining at Michelin-starred restaurants. Over the years, her byline has appeared in AFAR, Allrecipes, Condé Nast Traveler, Food& Wine, Global Traveler, National Geographic Travel, Southern Living and USA Today, among many others. She’s an active member of the American Society of Journalists and Authors, and the Society of American Travel Writers. ABOUT THE AUTHOR Thea Dwelle Thea Dwelle is the creator and editor of Luscious Lushes, a wine, food, and travel blog.  For more than 7 years, she has been writing about wine, travel and technology, focusing on the story behind the wine.  When not pursuing vinous pleasure, she works in technology and is an amateur mixologist. Follow her on Twitter @Luscious_Lushes ABOUT THE AUTHOR Thomas Riley Tom Riley is  a veteran journalist, writer, and editor who left a career in education in 2010, to study and write about wine. He holds an Advanced Certificate with merit from the Wine & Spirits Education Trust, London UK (WSET), and is currently pursuing their Diploma. In addition to The Alcohol Professor, he writes for the Bay Area News Group (San Jose Mercury, Contra Costa Times, Oakland Tribune), AmericanWineryGuide.com and Berkeleyside.com's online food and wine supplement, Nosh. You can follow him at his blog The Grape Belt or on Twitter @grapebelt. ABOUT THE AUTHOR Tim Miner Tim has been tending bar in New York City since 2003.  Currently he can be found mixing drinks at The Long Island Bar in Brooklyn, New York and at The Eddy in Providence, Rhode Island. He is a cocktail bartender who loves creating new drinks. Some of his creations have been featured in such publications as: The New York Times, AM New York, The New York Post, The Spir.it, Refinery29, Becomingbklyn, and Shakestir! Tim has taught cocktail classes and consulted on cocktail programs, most recently designing the cocktail menu at French Louie in Brooklyn. He won The annual \"Bring Your Bartender to the Opera Contest and was a U.S. Finalist in the 17th Annual Calvados Nouvelle Vogue International Competiton.  When he's not behind the bar, you can find him on twitter @_tim_miner. ABOUT THE AUTHOR Tom Johnson Tom Johnson is a writer and communications consultant in Louisville, Kentucky. He has written or produced more than 100 television documentaries and published an equal number of magazine articles; played a key role in four venture capital-funded start-ups; and consulted with a half-dozen distilleries and whiskey-related attractions. As a trainer for the Aroma Academy, he teaches people how to properly nose and assess fine wines and spirits. He can be found arguing and cracking-wise on Twitter @TomSayingThings . ABOUT THE AUTHOR Tony Sachs Tony Sachs has been writing about spirits and cocktails since 2007. His work has been featured in Robb Report, the Huffington Post, Whisky Advocate, Esquire, and Serious Eats, among many other publications. He lives in New York City with his wife, daughter, and cat, and can often be found ingesting dumplings and Mai Tais while listening to Frank Sinatra. Follow him on Twitter and Instagram @RetroManNYC. ABOUT THE AUTHOR Tracey Broussard Tracey Broussard is the editor of the culinary anthology Irrepressible Appetites. She is the former Bartender’s Best and Checking In columnist for the Sun-Sentinel. When she isn’t pouring drinks in the air as a flight attendant, she can be found at home creating drinks for her family, friends, and on Instagram @Tracey.Broussard and posting recipes and culinary adventures at her blog, www.thebigeasycook.com ABOUT THE AUTHOR Tracy Weiss Tracy Weiss had her first glass of Manischewitz at age 11. She found it horrendous but knew someday (when she was of legal drinking age), sheâ€™d seek out better vino. At her alma mater Michigan State University, Tracy took advantage of half-off bottles on Wine Wednesdays. With clarity found from sampling different varieties, she began to mock girlfriends sipping Booneâ€™s Farm Strawberry Hill. An oenophile is born. This paired well with a violent cheese obsession and further motivated her to eat her way through life. Blending her passion for the finer things with a Midwestern upbringing, Tracy likes to pair fabulous wines with Dominos Pizza and crappy Chinese food.\nIn a flurry of Parisian triple crÃ¨mes, Napa cabs, and pinxtos in San Sebastian, a decade of toiling in television and talent management flew by.\nAbandoning the entertainment business to write (and eat) full time, Tracy now focuses her culinary and wine interests closer to home splitting time between Manhattan and the North Fork of Long Island. She currently freelances for food, wine and lifestyle publications while working on her upcoming website www.northforkd.com and first book.\nWhen not scribbling, Tracy enjoys oysters, all things pumpkin, cult television shows and bubbly from any region. ABOUT THE AUTHOR Trevor Hagstrom Trevor Hagstrom and Maggie Rosenberg (who snaps the photos for his stories) are food and beverage impresarios and content creators whose work and information on future projects can be found at Roadfood. ABOUT THE AUTHOR Warren Bobrow Warren Bobrow is the Food and Drink Editor of the 501c3 non profit Wild Table on Wild River Review located in Princeton, New Jersey.  He is the cocktail writer for DrinkUpNY, Foodista, The \"Fabulous\" Beekman Boys and has written over 300 articles on food, wine and spirits.  His first book, Apothecary Cocktails-  will be released by Rockport/Quayside Publishing in November 2013. He was one of 12 journalists world-wide, and the only one from the USA to participate in the FÃªte de laGastronomie- the weekend of September 22nd. 2012 in Burgundy.  He attends Tales of the Cocktail, WSWA, The Manhattan Cocktail Classic and the Boston Cocktail Summit.\nWarren was born and raised on a Biodynamic farm in NJ. You can follow him on Twitter @WarrrenBobrow1. ABOUT THE AUTHOR William Schragis Will Schragis has been busy trading jobs in as a Retail Buyer, Sommelier, Bartender, and Bourbon Distiller. He graduated from Wesleyan University in Connecticut with a Liberal Arts degree in the wonderfully vague discipline of American Studies. ABOUT THE AUTHOR Zachary Feldman Bitters, Old Men founder Zachary Feldman's origins can be traced back to the Venezuelan soldier who first told Angostura founder Dr. Johann Gottlieb Benjamin Siegert, you should really bottle this, dude. ABOUT THE AUTHOR Mike Gerrard Mike Gerrard is an award-winning travel and drinks writer, and publisher of the Travel Distilled website. He lives half the year in Cambridgeshire in England and the other half in Arizona. His most recent books are Cask Strength , the story of the barrel, and Behind Bars , what happens when alcohol meets crime. ABOUT THE AUTHOR Elly Blanchard Elly Blanchard is a freelance writer with a passion for traveling. When not exploring the world or hunting around for new cuisines to try - you will find her relaxing in the garden with her head in a good book. ABOUT THE AUTHOR Nickolaus Hines Nickolaus Hines is a food and beverage writer based in New York. His work has appeared in Atlas Obscura, Men's Journal, Supercall and more. He's always on the lookout for his next favorite drink and he will never hesitate to pet your dog. You can see what he's drinking now on his Instagram and Twitter, and see more of his work on his website. ABOUT THE AUTHOR Tina Caputo Tina Caputo is a California-based writer and editor who spent 15 years editing wine business magazines before setting off on her own to enjoy the rewards and perils of independent writing. Now she covers drinks, food, travel and produce for publications including VinePair, SevenFifty Daily, Sonoma, Visit California and more. She also posts offbeat humor pieces at at https://www.tinacaputo.com/blog. ABOUT THE AUTHOR Lisa Waterman Gray Lisa Waterman Gray is passionate about chocolate. In addition to writing for The Chocolate Professor, she wrote a cover story about Kansas chocolate shops for KANSAS! Magazine, and described chocolate shops across the nation for USAToday/10Best. E ach October through December, Waterman Gray creates weekly chocolate-focused recipe posts too, at lisawatermangray.com/ visual-traveler-blog . And several of her mouthwatering original chocolate recipes included the locally award-winning Chocolate Lover’s Pumpkin Pie. ABOUT THE AUTHOR Wendy Lee Wendy Lee is a travel addict, never happier than when visiting a new place. Along the way she seeks out opportunities to try all the local food and sample as much wine as possible. After a successful thirty year career in nonprofit management she left to pursue a dream of travel writing. Her writing can be found on Travel Awaits, Insider, Matador Network, Travel World International, and Empty Nesters Hit The Road. Wendy and her husband, Jason, live in Southern California. On the rare occasions they’re not traveling they enjoy hiking, biking, and kayaking. ABOUT THE AUTHOR Global Drinks Intel Global Drinks Intel is a must-read trade digital and print magazine for the world’s alcohol industry. Founded by highly-experienced and industry-recognised journalist Alex Smith, the publication focuses on the wine and spirits sector. Subscribe to the magazine, and register for their free weekly newsletter. ABOUT THE AUTHOR Hannah Howard Hannah Howard spent her formative years in New York eating, drinking, serving, bartending, cooking on a hot line, flipping giant wheels of cheese, and managing restaurants. She is the author of Feast: True Love in and Out of the Kitchen and Plenty: A Memoir of Food and Family. She writes for New York Magazine, Salon, and SELF and teaches food writing classes. She lives in Frenchtown, NJ and loves stinky cheese. ABOUT THE AUTHOR Matt Agonoy Matt Agonoy Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum. ABOUT THE AUTHOR Kristine Mae Bellen Bacon ipsum dolor amet biltong pig tri-tip frankfurter porchetta tenderloin spare ribs shankle. Brisket shankle chicken pork chop ribeye pastrami cow sirloin kielbasa spare ribs flank alcatra bresaola biltong prosciutto. Landjaeger doner kevin tail pork corned beef ball tip frankfurter pork belly ham. Pork loin kevin short ribs, pork hamburger boudin bacon. ABOUT THE AUTHOR Andrea McHugh Andrea McHugh is a New England-based food, wine and spirits, and travel writer. Her byline can be found in US News, Insider, Parade Magazine, the Boston Globe, Yankee Magazine, Classic Boat, Travel Awaits, TripSavvy, the Hartford Courant and numerous national and international publications. She’s traveled to destinations far and wide, experiencing new places through its past, present, people, and culinary culture. ABOUT THE AUTHOR Ruvani de Silva Ruvani de Silva is a travel-loving British Sri Lankan beverage and food writer based in Austin, Texas, with bylines including the Washington Post, Good Beer Hunting, VinePair, Pellicle, Hop Culture, Modern Farmer, Gastro Obscura, Texas Highways, Texas Monthly, Beer Is For Everyone and PorchDrinking. Ruvani is a vocal advocate for diversity, equality and inclusion in beer and is the founder of #SouthAsianBeerClub. Find her on social media @amethyst_heels and her portfolio at CraftBeerAmethyst.com. ABOUT THE AUTHOR Christina Mueller A long-time San Francisco Bay Area writer, Christina Mueller hails from the Other Coast and has spent way too much time in South America and Europe. She has covered food and wine for Eater, Fodor’s TripAdvisor/Viator, Plate, SFGATE and many others. You can find her on instagram, facebook, and read what she is up to on her blog. ABOUT THE AUTHOR David Young David Young is a freelance writer based in Fort Collins, CO. He specializes in craft beer, whiskey, outdoor adventures, and travel. He has been published in Men ’ s Journal, Forbes, SKI Magazine , and USA Today. He has more than two decades of experience writing for daily newspapers and working in public relations. David enjoys all that Colorado has to offer from mountain biking and fly-fishing to backcountry skiing and backpacking. Follow him on X , Instagram and check out his website ABOUT THE AUTHOR Erik Trinidad Erik Trinidad is a freelance travel, food, and spirits journalist, whose credits include National Geographic Traveler, BBC Travel, AFAR, VinePair, and Wine Enthusiast. He's also the author of the satirical cookbook, Fancy Fast Food: Ironic Recipes with No Bun Intended . Follow him on Instagram and Threads at: @theglobaltrip ABOUT THE AUTHOR Mark Orwoll Mark Orwoll is a veteran journalist who often writes about the intersection of wine and travel. For 30 years he was on the editorial staff of Travel + Leisure , most recently as the International Editor. As a freelance writer (since 2016) he has written about the wines of Portugal, Israel, Australia, and the United States. He is the author of a thriller, Cross Purposes , and a film book, John Wayne Speaks . He has won accolades from the North American Travel Journalists Association, the Society of American Travel Writers, and as an advisor to the White House tourism initiative “American Pathways 2000.” ABOUT THE AUTHOR Brianne Cohen Brianne Cohen is a Los Angeles based event producer, certified sommelier, wine educator, and wine writer. On the wine education side, she hosts in-person and virtual wine tasting experiences for corporate groups. She does this through highlighting diverse-owned wineries (i.e. Black, BIPOC, LGBT, and women-owned). Brianne regularly judges at international wine competitions, holds the WSET Diploma certificate, and a Master of Business Administration from Loyola Marymount University. She can be found online on Instagram and LinkedIn . ABOUT THE AUTHOR Jack Shaw As Modded 's senior writer, Jack Shaw combines his expertise in health and his love for culinary exploration to provide captivating articles on the intersection of food, drink, well-being, and vibrant living. ABOUT THE AUTHOR Theresa Greco Theresa Greco is the food and beverage writer behind “ The Food Hunter ’ s Guide to Cuisine.” Her passion for food, wine, and spirits has led her into the kitchens of well-known chefs both in the US and abroad. When she ’ s not “ hunting” for the next best spirit or food she can be found cooking delicious meals with her husband by her side. Please follow her on Instagram @foodhunter ABOUT THE AUTHOR N.C. Stevens N.C. Stevens is a freelance beverage writer based in Boston and the creator of Drinking Folk. He has traveled around four continents documenting local beverages based on interviews with the folks who make them. At home, he is a hobbyist distiller and an acolyte of iced coffee. ABOUT THE AUTHOR Chris Boiling Chris Boiling is a wine writer and winemaker. He’s the Wine Editor at William Reed, the company behind World’s Best Vineyards, World’s Best Sommeliers Selection, International Wine Challenge, and the free fortnightly newsletter Canopy. As well as being a wine writer, Chris is an aspiring winemaker, experimenting with rare grape varieties and wine styles at various wineries in Eastern and Central Europe. He will be launching the first in a unique collection of wines from his #harvest2022 adventure. These include a modern qvevri wine from Georgia, a ‘natural’ wine from Slovenia, a benchmark sustainable wine from Austria (featuring two disease-resistant grapes), and a sparkling wine from Hungary (the world’s first classic-method wine featuring Hungarian grape Pearl of Victoria and Austrian grape Gruner Veltliner). ABOUT THE AUTHOR Tania Banerjee Tania Banerjee is a freelance writer from Kolkata based in Mumbai, India. She writes about travel, culture, environment and food. Her work has appeared in Whetstone, The Juggernaut, Lonely Planet, Business Line and more. You can find her on Instagram @taniabanerjee , Twitter @taniabanerjee , and her blog, Azure Sky Follows . ABOUT THE AUTHOR Cori Solomon Cori Solomon is an award-winning writer/photographer based in Los Angeles. Her blog, The Written Palette, features eclectic articles about her experiences traveling, discovering new wines, wineries, wine regions, art and history. Cori's background in art plays a role in her writing. She utilizes the art palette visually and verbally. Cori founded LA Wine Writers. She is the President of the IFWTWA, International Food Wine Travel Writers Association. She earned her WSET Level 2 Award in Wines and Spirits, the NASA American Wine Specialist Certification, and the NASA Spanish Wine Specialist Certification. She is also a member of NATJA, SATW, and TravMedia. ABOUT THE AUTHOR Gail Ann Williams Gail Ann Williams, a longtime San Francisco resident and craft beer appreciator, has written for publications such as Celebrator Beer News, BeerAdvocate Magazine, CraftBeer.com , Beer Paper LA and others. Gail is also a Certified BJCP beer judge. She and her husband, Steve Shapiro, launched BeerbyBART.com in 2007 to help locals and visitors explore their local beer scene via public transportation. The couple prioritizes traveling to meet beer people and trying fresh beers from the source, with select cultural and outdoor destinations tacked on for good measure. ABOUT THE AUTHOR Ansley Evans Originally from Florida, Ansley Evans has lived in Murcia, Spain, for over 15 years. She is a freelance writer and translator specializing in food and travel and has translated over a dozen cookbooks. She particularly loves deep dives into Spain’s culinary traditions, especially if tastings are involved. You can find her on Instagram: @ansleysevans. ABOUT THE AUTHOR Rashmi Gopal Rao Rashmi Gopal Rao is a freelance writer based in Bengaluru. She writes on various topics like travel, food, culture, architecture and design and has been published in various publications including National Geographic, Atlas Obscura, Nikkei Asia, Fodors, The National, Architectural Digest, Khaleej Times, The Sunday Hindu, The New Indian Express and Mint Lounge. Apart from travelling, she is passionate about anything related to home decor, antiques, vintage and thrift finds. So, when not exploring new places, cultures and cuisines, you can find her at flea markets! Follow her on @rashminotes. ABOUT THE AUTHOR Ryan Stevens Ryan has been writing for the food and beverage industry for twenty years with a focus on telling the story behind the brand. He lives in Oregon, surrounded by wineries, distilleries, breweries, and his family. You can contact him at Ryan@BlankGlass.com or follow @BlankGlass on social media. ABOUT THE AUTHOR Luciana Squadrilli Luciana Squadrilli is a food and travel writer based in Rome. Senior editor at Food&Wine Italia magazine, she also contributes as a free lance to many other publications, both in Italy and abroad, mostly about pizza and extra virgin olive oil. She's also a passionate cheese lover, earning the level 1 tasting certificate at ONAF, the Italian Cheese Tasters Organization. ABOUT THE AUTHOR Lisa Mowry Lisa Mowry is an Atlanta-based writer with a passion for travel. Because of her many years writing for publications such as Better Homes & Gardens, Traditional Home, and Luxe magazine, she’s partial to trips that involve fascinating architecture and culture, but because her husband is a wildlife biologist, Lisa has also found herself in a tent in Kenya surrounded by primates and searching for salamanders in the mountains of North Carolina. ABOUT THE AUTHOR Andrea Strafile Andrea Strafile is a food and cocktail writer based in Rome. He has been Munchies Italia’s editor in chief and he works as a freelance to different magazines and websites such as: Punch Drink, Standart, Food & Wine Italy, National Geographic UK and Penguin Random House among others. He also has a lifestyle magazine about beauty and classic menswear called Valet.\nIn over 10 years of experience, what really makes him feel alive is to be able to tell unapologetically beautiful stories. ABOUT THE AUTHOR Mario Stojanac As a published food, travel, and wine writer, Mario Stojanac has had the good fortune to travel across the globe, experiencing unique wineries, distilleries, and unforgettable meals along the way. A NATJA award finalist, Mario completed his WSET Level 3 wine award from the International Wine Education Guild based in London, UK. His love for wine is only surpassed by his love of pairing it with a fine meal and, ultimately, sharing it with others. ABOUT THE AUTHOR Sailor Guevara Sailor Guevara is an award-winning spirits industry professional, mixologist, cat mom, metal head, and contributing writer for many print and digital spirit and cocktail-focused outlets. In 2024, the American Distilling Institute named Sailor one of its Top Spirits Influencers. Sailor is also the host of the Drink Like Sailor Podcast . ABOUT THE AUTHOR Rich Manning Rich Manning has been writing about drink, food, and travel since 2004. His work can be found in several publications, including VinePair, Imbibe, Food & Wine, Artisan Spirit, and InsideHook. When he’s not on the road exploring a distillery or digging into a city’s cocktail scene, he lives in the greater Los Angeles area with his wife. You can follow his semi-occasional Instagram posts @rich.manning2.0 . ABOUT THE AUTHOR Robert Lublin Robert I. Lublin is Professor of Theatre Arts at the University of Massachusetts. He is the author of Costuming the Shakespearean Stage and contributing co-editor of two books: Reinventing the Renaissance and The Afterlives of Frankenstein . He has also been a libations reviewer for Drinkhacker.com for over a decade and regularly teaches wine and whisky appreciation classes for Arlington Community Education. ABOUT THE AUTHOR Merle Rosenstein Merle Rosenstein is a freelance travel, wine, and food writer with Level 2 Wine and Spirit Education Trust (WSET) certification from Toronto, Canada. She has written for Quench Magazine, Wander With Wonder, Best Health, and Next Avenue. Rosenstein has a second home in Hawaii and has toured wineries across Chile, sipped wine in Spain, and interviewed winemakers in Tuscany. You can catch up with Merle at superbubbie.ca , on Facebook , or on Instagram ABOUT THE AUTHOR Caroline Eubanks Caroline Eubanks is a travel and spirits writer from Atlanta, Georgia, and author of A Boozy History of Atlanta: People, Places & Drinks that Made a City . Her work has appeared in Bon Appétit, Food & Wine, InsideHook, VinePair, and Wine Enthusiast. She is a member of the Society of American Travel Writers, the Authors Guild, and the Atlanta Press Club, as well as a winner of two Lowell Thomas awards. Follow along with her work on Instagram at @cairinthecity and on her website, carolineeubanks.com . ABOUT THE AUTHOR Kara Nielsen Kara Nielsen is a food and beverage trend expert and Chief Trendologist at Kara Nielsen Food Trends . She tracks and translates trends for a variety of audiences, including CPG and foodservice clients seeking insights for new product development. Kara earned a master’s in gastronomy at Boston University and holds two WSET Certificates. Social: @trendologistk ABOUT THE AUTHOR Andrew Faulkner Andrew Faulkner is a professional journalist who came into distilled spirits through the side door. With a bachelor’s degree in journalism and a dozen years in newspapers, Faulkner found himself working for photographer Bill Owens in 2005, shortly after Owens founded the American Distilling Institute. For 14 years, he had a ringside seat to the rise of craft American spirits, assembling ADI’s weekly newsletter, coordinating workshops, building the judging program, and editing Distiller magazine. Faulkner is the recipient of ADI’s Lifetime Achievement Award for Service to the Distilled Spirits Industry, and still enjoys writing about the people behind the booze. ABOUT THE AUTHOR Courtney Iseman Courtney Iseman is a Brooklyn-based drinks writer and content consultant. Her work has appeared in Bon Appétit, The Washington Post, Food & Wine, Wine Enthusiast, Punch, Inside Hook, Men’s Journal, VinePair, and more. To see her work, visit courtneyliseman.com ; you can also buy her zine on the connections between craft beer and Tarot at BeanToBarstool.com . Find her on Instagram at @highwaytohops for photos of her pug, Darby. ABOUT THE AUTHOR Kristen Richard Kristen's fascination with beverage history and the science of drinks is a guiding force in her work. When she is not traveling down a random rabbit hole of esoteric booze knowledge, you can usually find her hiking, camping, biking, or sitting at a brewery patio somewhere."
    },
    {
      "url": "https://www.bayfrontinnnaples.com/privacy-notice/",
      "text": "Privacy Notice | Bayfront Inn 5th Ave EN EN FR DE ES 239.649.5800 Book Now Menu reservations 239.649.5800 Hotel Direct 239.649.5800 Close Stay Accommodations Guest Rooms Suites Luxury Rooms Penthouse Bayview King Suite Amenities Play Rentals Boat Rentals Kayak Rentals Bike Rentals SUP Rentals Local Attractions Dine Bambu Tropical Bar & Grille Events Calendar Gift Cards Special Offers Events About Hotel Information Gallery Getting Here Community Involvement Careers Contact 1221 5th Ave South, Naples, Florida 34102 Facebook Instagram Twitter Book your stay Check In Check Out Privacy Notice This Privacy Policy describes Our policies and procedures on the collection, use and disclosure of Your information when You use the Service and tells You about Your privacy rights and how the law protects You. We use Your Personal data to provide and improve the Service. By using the Service, You agree to the collection and use of information in accordance with this Privacy Policy. This Privacy Policy has been created with the help of the Privacy Policy Generator . Interpretation and Definitions Interpretation The words of which the initial letter is capitalized have meanings defined under the following conditions. The following definitions shall have the same meaning regardless of whether they appear in singular or in plural. Definitions For the purposes of this Privacy Policy: Account means a unique account created for You to access our Service or parts of our Service. Company (referred to as either “the Company”, “We”, “Us” or “Our” in this Agreement) refers to Bayfront Inn 5th Ave, 1221 5th Ave South, Naples, Florida 34102. Cookies are small files that are placed on Your computer, mobile device or any other device by a website, containing the details of Your browsing history on that website among its many uses. Country refers to: Florida, United States Device means any device that can access the Service such as a computer, a cellphone or a digital tablet. Personal Data is any information that relates to an identified or identifiable individual. Service refers to the Website. Service Provider means any natural or legal person who processes the data on behalf of the Company. It refers to third-party companies or individuals employed by the Company to facilitate the Service, to provide the Service on behalf of the Company, to perform services related to the Service or to assist the Company in analyzing how the Service is used. Usage Data refers to data collected automatically, either generated by the use of the Service or from the Service infrastructure itself (for example, the duration of a page visit). Website refers to Bayfront Inn 5th Ave, accessible from https://www.bayfrontinnnaples.com You means the individual accessing or using the Service, or the company, or other legal entity on behalf of which such individual is accessing or using the Service, as applicable. Collecting and Using Your Personal Data Types of Data Collected Personal Data While using Our Service, We may ask You to provide Us with certain personally identifiable information that can be used to contact or identify You. Personally identifiable information may include, but is not limited to: Email address Usage Data Usage Data Usage Data is collected automatically when using the Service. Usage Data may include information such as Your Device’s Internet Protocol address (e.g. IP address), browser type, browser version, the pages of our Service that You visit, the time and date of Your visit, the time spent on those pages, unique device identifiers and other diagnostic data. When You access the Service by or through a mobile device, We may collect certain information automatically, including, but not limited to, the type of mobile device You use, Your mobile device unique ID, the IP address of Your mobile device, Your mobile operating system, the type of mobile Internet browser You use, unique device identifiers and other diagnostic data. We may also collect information that Your browser sends whenever You visit our Service or when You access the Service by or through a mobile device. Tracking Technologies and Cookies We use Cookies and similar tracking technologies to track the activity on Our Service and store certain information. Tracking technologies used are beacons, tags, and scripts to collect and track information and to improve and analyze Our Service. The technologies We use may include: Cookies or Browser Cookies. A cookie is a small file placed on Your Device. You can instruct Your browser to refuse all Cookies or to indicate when a Cookie is being sent. However, if You do not accept Cookies, You may not be able to use some parts of our Service. Unless you have adjusted Your browser setting so that it will refuse Cookies, our Service may use Cookies. Flash Cookies. Certain features of our Service may use local stored objects (or Flash Cookies) to collect and store information about Your preferences or Your activity on our Service. Flash Cookies are not managed by the same browser settings as those used for Browser Cookies. For more information on how You can delete Flash Cookies, please read “Where can I change the settings for disabling, or deleting local shared objects?” available here Web Beacons. Certain sections of our Service and our emails may contain small electronic files known as web beacons (also referred to as clear gifs, pixel tags, and single-pixel gifs) that permit the Company, for example, to count users who have visited those pages or opened an email and for other related website statistics (for example, recording the popularity of a certain section and verifying system and server integrity). Cookies can be “Persistent” or “Session” Cookies. Persistent Cookies remain on Your personal computer or mobile device when You go offline, while Session Cookies are deleted as soon as You close Your web browser. Learn more about cookies: Cookies: What Do They Do? . We use both Session and Persistent Cookies for the purposes set out below: Necessary / Essential Cookies Type: Session CookiesAdministered by: Us Purpose: These Cookies are essential to provide You with services available through the Website and to enable You to use some of its features. They help to authenticate users and prevent fraudulent use of user accounts. Without these Cookies, the services that You have asked for cannot be provided, and We only use these Cookies to provide You with those services. Cookies Policy / Notice Acceptance Cookies Type: Persistent CookiesAdministered by: Us Purpose: These Cookies identify if users have accepted the use of cookies on the Website. Functionality Cookies Type: Persistent CookiesAdministered by: Us Purpose: These Cookies allow us to remember choices You make when You use the Website, such as remembering your login details or language preference. The purpose of these Cookies is to provide You with a more personal experience and to avoid You having to re-enter your preferences every time You use the Website. For more information about the cookies we use and your choices regarding cookies, please visit our Cookies Policy or the Cookies section of our Privacy Policy. Use of Your Personal Data The Company may use Personal Data for the following purposes: To provide and maintain our Service , including to monitor the usage of our Service. To manage Your Account: to manage Your registration as a user of the Service. The Personal Data You provide can give You access to different functionalities of the Service that are available to You as a registered user. For the performance of a contract: the development, compliance and undertaking of the purchase contract for the products, items or services You have purchased or of any other contract with Us through the Service. To contact You: To contact You by email, telephone calls, SMS, or other equivalent forms of electronic communication, such as a mobile application’s push notifications regarding updates or informative communications related to the functionalities, products or contracted services, including the security updates, when necessary or reasonable for their implementation. To provide You with news, special offers and general information about other goods, services and events which we offer that are similar to those that you have already purchased or enquired about unless You have opted not to receive such information. To manage Your requests: To attend and manage Your requests to Us. For business transfers: We may use Your information to evaluate or conduct a merger, divestiture, restructuring, reorganization, dissolution, or other sale or transfer of some or all of Our assets, whether as a going concern or as part of bankruptcy, liquidation, or similar proceeding, in which Personal Data held by Us about our Service users is among the assets transferred. For other purposes : We may use Your information for other purposes, such as data analysis, identifying usage trends, determining the effectiveness of our promotional campaigns and to evaluate and improve our Service, products, services, marketing and your experience. We may share Your personal information in the following situations: With Service Providers: We may share Your personal information with Service Providers to monitor and analyze the use of our Service, to contact You. For business transfers: We may share or transfer Your personal information in connection with, or during negotiations of, any merger, sale of Company assets, financing, or acquisition of all or a portion of Our business to another company. With Affiliates: We may share Your information with Our affiliates, in which case we will require those affiliates to honor this Privacy Policy. Affiliates include Our parent company and any other subsidiaries, joint venture partners or other companies that We control or that are under common control with Us. With business partners: We may share Your information with Our business partners to offer You certain products, services or promotions. With other users: when You share personal information or otherwise interact in the public areas with other users, such information may be viewed by all users and may be publicly distributed outside. With Your consent : We may disclose Your personal information for any other purpose with Your consent. Retention of Your Personal Data The Company will retain Your Personal Data only for as long as is necessary for the purposes set out in this Privacy Policy. We will retain and use Your Personal Data to the extent necessary to comply with our legal obligations (for example, if we are required to retain your data to comply with applicable laws), resolve disputes, and enforce our legal agreements and policies. The Company will also retain Usage Data for internal analysis purposes. Usage Data is generally retained for a shorter period of time, except when this data is used to strengthen the security or to improve the functionality of Our Service, or We are legally obligated to retain this data for longer time periods. Transfer of Your Personal Data Your information, including Personal Data, is processed at the Company’s operating offices and in any other places where the parties involved in the processing are located. It means that this information may be transferred to — and maintained on — computers located outside of Your state, province, country or other governmental jurisdiction where the data protection laws may differ than those from Your jurisdiction. Your consent to this Privacy Policy followed by Your submission of such information represents Your agreement to that transfer. The Company will take all steps reasonably necessary to ensure that Your data is treated securely and in accordance with this Privacy Policy and no transfer of Your Personal Data will take place to an organization or a country unless there are adequate controls in place including the security of Your data and other personal information. Disclosure of Your Personal Data Business Transactions If the Company is involved in a merger, acquisition or asset sale, Your Personal Data may be transferred. We will provide notice before Your Personal Data is transferred and becomes subject to a different Privacy Policy. Law enforcement Under certain circumstances, the Company may be required to disclose Your Personal Data if required to do so by law or in response to valid requests by public authorities (e.g. a court or a government agency). Other legal requirements The Company may disclose Your Personal Data in the good faith belief that such action is necessary to: Comply with a legal obligation Protect and defend the rights or property of the Company Prevent or investigate possible wrongdoing in connection with the Service Protect the personal safety of Users of the Service or the public Protect against legal liability Security of Your Personal Data The security of Your Personal Data is important to Us, but remember that no method of transmission over the Internet, or method of electronic storage is 100% secure. While We strive to use commercially acceptable means to protect Your Personal Data, We cannot guarantee its absolute security. Detailed Information on the Processing of Your Personal Data The Service Providers We use may have access to Your Personal Data. These third-party vendors collect, store, use, process and transfer information about Your activity on Our Service in accordance with their Privacy Policies. Usage, Performance and Miscellaneous We may use third-party Service Providers to provide better improvement of our Service. Google Places Google Places is a service that returns information about places using HTTP requests. It is operated by GoogleGoogle Places service may collect information from You and from Your Device for security purposes. The information gathered by Google Places is held in accordance with the Privacy Policy of Google: https://www.google.com/intl/en/policies/privacy/ Children’s Privacy Our Service does not address anyone under the age of 13. We do not knowingly collect personally identifiable information from anyone under the age of 13. If You are a parent or guardian and You are aware that Your child has provided Us with Personal Data, please contact Us. If We become aware that We have collected Personal Data from anyone under the age of 13 without verification of parental consent, We take steps to remove that information from Our servers. If We need to rely on consent as a legal basis for processing Your information and Your country requires consent from a parent, We may require Your parent’s consent before We collect and use that information. Links to Other Websites Our Service may contain links to other websites that are not operated by Us. If You click on a third party link, You will be directed to that third party’s site. We strongly advise You to review the Privacy Policy of every site You visit. We have no control over and assume no responsibility for the content, privacy policies or practices of any third party sites or services. Changes to this Privacy Policy We may update Our Privacy Policy from time to time. We will notify You of any changes by posting the new Privacy Policy on this page. We will let You know via email and/or a prominent notice on Our Service, prior to the change becoming effective and update the “Last updated” date at the top of this Privacy Policy. You are advised to review this Privacy Policy periodically for any changes. Changes to this Privacy Policy are effective when they are posted on this page. Contact Us If you have any questions about this Privacy Policy, You can contact us: By email: info@bayfrontinnnaples.com By phone: 239.649.5800 Address 1221 5th Ave South Naples, Florida 34102 reservations 239.649.5800 Hotel Direct 239.649.5800 Join the adventure Sign up for news and other cool stuff I consent to my name and email address being collected and stored Please leave this field empty Never miss a moment Facebook Instagram Twitter © All rights reserved Privacy Notice Accessibility Contact Us Careers Directions Made by Exploritech Close Selected Dates: Check In Back to top We serve cookies to analyze traffic and customize content on this site. Privacy & Cookie Policy Got It! Manage consent Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website, anonymously. Cookie Duration Description cookielawinfo-checkbox-analytics 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\". cookielawinfo-checkbox-functional 11 months The cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Functional\". cookielawinfo-checkbox-necessary 11 months This cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\". cookielawinfo-checkbox-others 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other. cookielawinfo-checkbox-performance 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Performance\". viewed_cookie_policy 11 months The cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Functional Functional Functional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features. Performance Performance Performance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. Advertisement Advertisement Advertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads. Others Others Other uncategorized cookies are those that are being analyzed and have not been classified into a category as yet. SAVE & ACCEPT"
    },
    {
      "url": "https://quicklocal.com/rtcl_listing/fl/naples/bambu-tropical-bar-grille/",
      "text": "Bambu Tropical Bar & Grille | Quick Local Menu Close Home Business Magazine Industries We Serve Login Home Business Magazine Industries We Serve Login Add a Free Business Home Business Magazine Industries We Serve Login Home / Restaurant / Bambu Tropical Bar & Grille Bambu Tropical Bar & Grille Report Abuse Report Abuse × Your Complaint * False or Misleading Information Outdated or Incorrect Details Inappropriate or Offensive Content Scams or Illegal Activities Submit 0.0 rating based on 1,234 ratings (0 Reviews) 1221 5th Ave S, Naples, FL 34102 +1 239-649-5800 www.bayfrontinnnaples.com Write a Review About Services Services Areas Questions and Answers Q1 : What is the physical location of  Bambu Tropical Bar & Grille \n    ? A : The physical location of Bambu Tropical Bar & Grille is at 1221 5th Ave S, Naples, FL 34102 Q2 : What is the contact phone number for Bambu Tropical Bar & Grille in 1221 5th Ave S, Naples, FL 34102? A : You can reach Bambu Tropical Bar & Grille in 1221 5th Ave S, Naples, FL 34102 at +1 239-649-5800 . Q3 : What services or products does  Bambu Tropical Bar & Grille offer in 1221 5th Ave S, Naples, FL 34102? A : Bambu Tropical Bar & Grille provides Restaurant services in the  1221 5th Ave S, Naples, FL 34102 area. Q4 : What is the email address of Bambu Tropical Bar & Grille ? A : Bambu Tropical Bar & Grille's email address is trista@bayfrontinnnaples.com . Q5 : What is the official website of  Bambu Tropical Bar & Grille ? A : The official website of Bambu Tropical Bar & Grille is http://www.bayfrontinnnaples.com/dining-nightlife.php . Customer Reviews Share Business Location Get Directions 1221 5th Ave S, Naples, FL 34102 People Also Viewed Testing Restaurant 5.0 rating based on 1,234 ratings View Details Olive Tree Restaurant 0.0 rating based on 1,234 ratings View Details Blue Hill At Stone Barns 0.0 rating based on 1,234 ratings View Details Doner Point 0.0 rating based on 1,234 ratings View Details Aura Lounge 0.0 rating based on 1,234 ratings View Details Find the best local services and businesses quickly with QuickLocal. Follow Us On Top Cities New York Los Angeles Chicago Houston Phoenix Boston Dallas Miami Atlanta Quick Links Categories Latest Content Business Magazine Contact Us Pricing About Us Help Center Privacy Policy Term of use Services Add a Free Business Create Free Account SEO & Link Building Service Industries We Help Partnership Local Exposure Statewide Exposure National Exposure Article Submission QUICKLOCAL™ is a trademark of Quick Local LLC. Copyright © Quick Local 2025"
    }
  ]
}