{
  "fuentes": [
    {
      "url": "https://bayfrontparkmiami.com/board-of-trustees/",
      "email": "info@bayfrontparkmiami.com"
    },
    {
      "url": "https://bayfrontparkmiami.com/bayfront-park/",
      "email": "info@bayfrontparkmiami.com"
    },
    {
      "url": "https://bayfrontparkmiami.com/updates-from-instagram/",
      "email": "info@bayfrontparkmiami.com"
    },
    {
      "url": "https://bayfrontparkmiami.com/",
      "email": "info@bayfrontparkmiami.com"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "https://bayfrontparkmiami.com/park-events/",
      "email": "info@bayfrontparkmiami.com"
    },
    {
      "url": "https://bayfrontparkmiami.com/park-events/",
      "email": "sbutler@miamigov.com"
    },
    {
      "url": "https://www.nps.gov/aboutus/contactus.htm?StartRow=51&pk=&sn=fe",
      "email": "app-promo-phones@2x.png"
    },
    {
      "url": "https://bayfrontparkmiami.com/frequently-asked-questions/",
      "email": "info@bayfrontparkmiami.com"
    },
    {
      "url": "https://bayfrontparkmiami.com/contact/",
      "email": "info@bayfrontpark.com"
    },
    {
      "url": "https://bayfrontparkmiami.com/contact/",
      "email": "info@bayfrontparkmiami.com"
    },
    {
      "url": "https://bayfrontparkmiami.com/contact/",
      "email": "josephnieman@livenation.com"
    },
    {
      "url": "https://bayfrontparkmiami.com/contact/",
      "email": "sbutler@miamigov.com"
    },
    {
      "url": "https://bayfrontparkmiami.com/contact/",
      "email": "sbutler@miamigov.comcom"
    },
    {
      "url": "https://bayfrontparkmiami.com/bayfront-park-2/",
      "email": "info@bayfrontparkmiami.com"
    },
    {
      "url": "https://bayfrontparkmiami.com/bayfront-park-2/",
      "email": "sbutler@miamigov.com"
    },
    {
      "url": "https://bcparksfoundation.ca/us/",
      "email": "info@bcparksfoundation.ca"
    },
    {
      "url": "https://www.duluthnewstribune.com/news/local/new-manager-proposed-for-duluths-bayfront-festival-park-venue",
      "email": "ppassi@duluthnews.com"
    },
    {
      "url": "https://www.duluthnewstribune.com/news/local/duluth-council-hands-bayfront-management-back-to-decc",
      "email": "ppassi@duluthnews.com"
    }
  ],
  "mails": [
    "app-promo-phones@2x.png",
    "info@bayfrontpark.com",
    "info@bayfrontparkmiami.com",
    "info@bcparksfoundation.ca",
    "info@reception-plus.de",
    "josephnieman@livenation.com",
    "ppassi@duluthnews.com",
    "sbutler@miamigov.com",
    "sbutler@miamigov.comcom"
  ],
  "nombre_sitio": "bayfrontparkmiami.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://bayfrontparkmiami.com/board-of-trustees/",
      "text": "BOARD OF TRUSTEES – BAYFRONT PARK MIAMI Skip to content HOME EVENTS Menu Toggle PLAN YOUR VISIT PAST EVENTS BOARD MEETINGS Menu Item PARKS Menu Toggle BAYFRONT PARK MAURICE A. FERRÉ PARK ABOUT Menu Toggle HISTORY INSTAGRAM POSTS RULES AND REGULATIONS FREQUENTLY ASKED QUESTIONS PRESS RELEASE CONTACT Main Menu HOME EVENTS Menu Toggle PLAN YOUR VISIT PAST EVENTS BOARD MEETINGS Menu Item PARKS Menu Toggle BAYFRONT PARK MAURICE A. FERRÉ PARK ABOUT Menu Toggle HISTORY INSTAGRAM POSTS RULES AND REGULATIONS FREQUENTLY ASKED QUESTIONS PRESS RELEASE CONTACT Main Menu BOARD OF TRUSTEES The Bayfront Park Management Trust was created in 1987, by the Miami City Commission, to manage Bayfront Park “for the purpose of insuring maximum community utilization and enjoyment.” The Trust also manages Maurice A. Ferré Park. The nine (9) member board is led by our Chairman and Commissioner Miguel Angel Gabela. All Board meetings are open to the public. Meeting agendas can be viewed on this page approximately one week ahead of time and are subject to change. BOARD OF TRUSTEES The Bayfront Park Management Trust was created in 1987, by the Miami City Commission, to manage Bayfront Park “for the purpose of insuring maximum community utilization and enjoyment.” The Trust also manages Maurice A. Ferré Park. The nine (9) member board is led by our Chairman and Commissioner Miguel Angel Gabela. All Board meetings are open to the public. Meeting agendas can be viewed on this page approximately one week ahead of time and are subject to change. BAYFRONT PARK MANAGEMENT TRUST BOARD MEETING AGENDA Upcoming and Past Scheduled Meetings All Board of Trustee meetings are open to the public. Meeting agendas can be viewed on this page approximately one week ahead of time and are subject to change. Trust Agenda Monday, October 20, 2025 BAYFRONT PARK MANAGEMENT TRUST  BOARD MEETING AGENDA Monday, October 20, 2025 (6:00 PM) 301 N Biscayne Blvd MIAMI FL 33132 Agenda items TBA Read more Trust Agenda Monday, September 8, 2025 BAYFRONT PARK MANAGEMENT TRUST  BOARD MEETING AGENDA Monday, September 8, 2025 (6:00 PM) 301 N Biscayne Blvd MIAMI FL 33132   I. WELCOME, PLEDGE OF ALLEGIANCE, ROLL CALL II. PUBLIC COMMENTS – (Limited to 2 minutes) III. APPROVAL ITEMS Approval of Minutes from June 24, 2025 Trust Meeting Approval of Minutes from July 7, 2025 … Trust Agenda Monday, September 8, 2025 Read More » Read more Trust Agenda Friday, July 25, 2025 BAYFRONT PARK MANAGEMENT TRUST  BOARD MEETING AGENDA Friday, July 25, 2025 (12:30 PM) 301 N Biscayne Blvd MIAMI FL 33132   I. WELCOME, PLEDGE OF ALLEGIANCE, ROLL CALL, LOBBYIST NOTE II. PUBLIC COMMENTS – (Limited to 2 minutes) III. APPROVAL ITEMS IV. GENERAL ITEMS 1. Dock Repair 2. Irrigation System Repair V. POTENTIAL EVENTS 1. … Trust Agenda Friday, July 25, 2025 Read More » Read more Trust Agenda Monday, June 16, 2025 BAYFRONT PARK MANAGEMENT TRUST  BOARD MEETING AGENDA Monday, June 16, 2025 (12:30 PM) 301 N Biscayne Blvd MIAMI FL 33132   I. WELCOME, PLEDGE OF ALLEGIANCE, ROLL CALL, LOBBYIST NOTE II. PUBLIC COMMENTS – (Limited to 2 minutes) III. APPROVAL ITEMS Approval of Minutes from May 12, 2024 Trust Meeting Approval of Minutes from May … Trust Agenda Monday, June 16, 2025 Read More » Read more Trust Agenda Monday, June 9, 2025 BAYFRONT PARK MANAGEMENT TRUST SPECIAL BOARD MEETING AGENDA Tuesday, June 9, 2025 (1:00 PM) 301 N Biscayne Blvd MIAMI FL 33132   I. WELCOME, PLEDGE OF ALLEGIANCE, ROLL CALL, LOBBYIST NOTE II. PUBLIC COMMENTS – (Limited to 2 minutes) III. APPROVAL ITEMS Approval of Minutes from May 12, 2025 Trust Meeting IV. RESOLUTIONS AND DISCUSSION … Trust Agenda Monday, June 9, 2025 Read More » Read more Trust Agenda Tuesday, May 20, 2025 BAYFRONT PARK MANAGEMENT TRUST SPECIAL BOARD MEETING AGENDA Tuesday, May 20, 2025 (1:00 PM) 3500 PAN AMERICAN DR. MIAMI FL 33133-5504   I. WELCOME, PLEDGE OF ALLEGIANCE, ROLL CALL, LOBBYIST NOTE   II. PUBLIC COMMENTS – (Limited to 5 minutes)   III. DISCUSSION ITEMS  A. Bayfront Park Management Trust Organizational Review   Next Meeting: June … Trust Agenda Tuesday, May 20, 2025 Read More » Read more Trust Agenda Monday, May 12, 2025 Trust Agenda Monday, May 12, 2025 Read more Trust Agenda Monday, April 14, 2025 Trust Agenda Monday, April 14, 2025 Read more Trust Agenda Monday, March 10, 2025 Trust Agenda Monday, March 10, 2025 Read more Trust Agenda Monday, February 24, 2025 Trust Agenda Monday, February 24, 2025 Read more Trust Agenda Monday, February 3, 2025 Trust Agenda Tuesday, January 7, 2025 Read more Trust Agenda Tuesday, January 7, 2025 Trust Agenda Tuesday, January 7, 2025 Read more Trust Agenda Friday, December 20th, 2024 Trust Agenda Friday, December 20th, 2024 Read more Trust Agenda Monday, December 9th, 2024 Trust Agenda Monday, December 9th, 2024 Read more Trust Agenda Tuesday, October 29th, 2024 Tuesday, October 29th, 2024 Read more Tuesday, September 24th, 2024 Tuesday, September 24th, 2024 Read more Special Board Meeting Thursday 15th August 2024 Special Board Meeting Thursday 15th August 2024 Read more Trust Agenda Tuesday, July 30th, 2024 Trust Agenda Tuesday, July 30th, 2024 Read more Trust Agenda Tuesday, June 25th, 2024 Trust Agenda Tuesday, June 25th, 2024 Read more Trust Agenda Tuesday, May 21st, 2024 Trust Agenda Tuesday, May 21st, 2024 Read more CHAIRMAN Chairman Commissioner Miguel Angel Gabela Bayfront Park Management Trust Board Members Commissioner Miguel Angel Gabela Ms. Marie Loussaint Ms. Ana Matos Mr. Christopher Penelas Mr. Carlos Martell Mr. Javier Banos, Esq. Mr. Horacio Stuart Aguirre Mr. Pasco (Pat) Santangelo Mr. Steven Smith HOME EVENTS EXHIBITIONS Menu Toggle Jiménez Deredia in Miami Dogs & Cats Walkway and Sculptures BOARD MEETINGS Menu Item PARKS Menu Toggle BAYFRONT PARK MAURICE A. FERRÉ PARK ABOUT Menu Toggle INSTAGRAM POSTS RULES AND REGULATIONS FREQUENTLY ASKED QUESTIONS PRESS RELEASE CONTACT HOME EVENTS EXHIBITIONS Menu Toggle Jiménez Deredia in Miami Dogs & Cats Walkway and Sculptures BOARD MEETINGS Menu Item PARKS Menu Toggle BAYFRONT PARK MAURICE A. FERRÉ PARK ABOUT Menu Toggle INSTAGRAM POSTS RULES AND REGULATIONS FREQUENTLY ASKED QUESTIONS PRESS RELEASE CONTACT 301 North Biscayne Boulevard Miami, Florida 33132 305-358-7550 bayfrontparkmiami.com For more information please write to: info@bayfrontparkmiami.com Park operating hours from 7:00 am to 11:00 pm daily. Office Hours: Monday to Friday from 9:00 AM to 5:30 PM, closed on Saturdays and Sundays Unless there is a Special Event SUBSCRIBE Leave this field empty if you're human: Copyright © 2025 BAYFRONT PARK MIAMI | Powered by [FULLCO Studio] BAYFRONT PARK RULES AND REGULATIONS MAURICE A. FERRÉ PARK RULES AND REGULATIONS PARK HOURS: 7:00 a.m. to 10:00 p.m. Please keep the Park clean by not damaging the Park or its furnishings. Use of the Park and its amenities shall be used for its intended use and safely. Benches are strictly intended for sitting and NOT sleeping or laying down. Park sculptures and monuments are meant to be viewed and enjoyed. Please do not touch, sit, climb, nor deface any public art or monument. No aggressive or threatening behavior is allowed in the Park, including aggressive panhandling or soliciting. ONLY Trust authorized vehicles are allowed in the Park. No skateboarding or other motorized vehicles are allowed in the Park. No fires, hunting nor molesting wildlife are allowed in the Park. No littering or dumping personal belongings. Deposit trash in trash containers. No camping nor use of temporary structures, such as tents, chairs, hammocks or card board are allowed in the Park. No swimming, no fishing, nor solicitation without a Bayfront Park Management Trust issued permit in the Park. No Consumption of alcoholic beverages unless a special permit is obtained from Bayfront Park Management Trust. All commerce, advertising, vending, or business must be approved by Bayfront Park Management Trust. All docking, launching, or landing of a vessel requires a permit from Bayfront Park Management Trust. Any organized activity, event, or gatherings, such as photoshoots and video shoots require a permit from Bayfront Park Management Trust. No drones are allowed in the Park unless authorized by Bayfront Park Management Trust. All dogs must be on a leash and dog owners are responsible for picking up any waste, as well as any damage caused to the Park by owner’s dog. Any Park visitor found violating park rules will be removed from the premises and           enforced by Bayfront Park Security and City of Miami Police. For Permits and inquiries, please contact our Bayfront Park office: 305-358-7550 or at info@bayfrontparkmiami.com . THANK YOU FOR VISITING, COME AGAIN SOON! The above rules are detailed in Chapter 38 of the City of Miami Code; and enforced by Bayfront Park Staff, Bayfront Park Security, and City of Miami Police CLOSE STOP HUMAN TRAFFICKING CLOSE WELCOME TO MAURICE A. PARK Maurice A. Ferré Park has transformed into an open-air museum, boasting spectacular venues in close proximity to the bay, where breathtaking outdoor events take place. It offers magnificent views not only of Biscayne Bay but also the downtown Miami skyline, making it a privileged location for unforgettable gatherings. The park’s surroundings feature stunning artwork showcased along the Dogs and Cats Walkway, as well as an extraordinary area housing the Jiménez Deredia exhibition, which will be available throughout the entire year. Formerly called Museum Park, the 21-acre Maurice A. Ferré Park is home to the Peréz Art Museum Miami and the Patricia and Phillip Frost Museum of Science. Located north of AmericanAirlines Arena, this park is considered an extension of Bayfront Park. It sits right on Biscayne Bay and has an outdoor amphitheater, grassy areas, walking and biking baths and Plaza de la Marina Española (Spanish Navy Plaza), a monument that honors the Spanish Navy and its arrival in the Americas on October 12, 1492. X WELCOME TO BAYFRONT PARK Bayfront Park, originally called Royal Palm Park, is the oldest public gathering space in the Greater Miami community. Established in 1896, it started with a pavilion and green space used for sports activities. Over the years, it expanded to include a bandshell and became a venue for various events. Today, Bayfront Park spans 32 acres in Downtown Miami, offering stunning views of Biscayne Bay. It features open lawn spaces, a seaside path, sandy beach area, performance venues, VIP seating, tropical rock garden, and a historic waterfall from 1926. Discover a peaceful oasis tucked away in the heart of Miami. It’s the perfect place to relax, explore, and enjoy unhurried walks. Whether you’re having a picnic or participating in outdoor activities, this captivating park invites you, with its stunning waterfront views and expansive green spaces, to escape the bustling city and immerse yourself in the tranquility of nature. X Scroll to Top"
    },
    {
      "url": "https://bayfrontparkmiami.com/bayfront-park/",
      "text": "BAYFRONT PARK – BAYFRONT PARK MIAMI Skip to content BAYFRONT PARK Enter Now go to Maurice A. Ferré park Miami's go-to venue for major spectacles, renowned as the city's top event center. A popular park for large-scale shows and gatherings. Nestled on prime grounds, overlooking Biscayne Bay, it boasts an outdoor amphitheater and vast green spaces. Maurice A Ferré Park, an open-air museum, where art comes alive amidst nature. Perfect for families looking to immerse in artistic experiences while enjoying relaxation and outdoor activities. Enter Now Maurice A. Ferré Park Go to Bayfront Park HOME EVENTS Menu Toggle PLAN YOUR VISIT PAST EVENTS BOARD MEETINGS Menu Item PARKS Menu Toggle BAYFRONT PARK MAURICE A. FERRÉ PARK ABOUT Menu Toggle HISTORY INSTAGRAM POSTS RULES AND REGULATIONS FREQUENTLY ASKED QUESTIONS PRESS RELEASE CONTACT HOME EVENTS Menu Toggle PLAN YOUR VISIT PAST EVENTS BOARD MEETINGS Menu Item PARKS Menu Toggle BAYFRONT PARK MAURICE A. FERRÉ PARK ABOUT Menu Toggle HISTORY INSTAGRAM POSTS RULES AND REGULATIONS FREQUENTLY ASKED QUESTIONS PRESS RELEASE CONTACT BAYFRONT PARK RULES AND REGULATIONS MAURICE A. FERRÉ PARK RULES AND REGULATIONS PARK HOURS: 7:00 a.m. to 10:00 p.m. Please keep the Park clean by not damaging the Park or its furnishings. Use of the Park and its amenities shall be used for its intended use and safely. Benches are strictly intended for sitting and NOT sleeping or laying down. Park sculptures and monuments are meant to be viewed and enjoyed. Please do not touch, sit, climb, nor deface any public art or monument. No aggressive or threatening behavior is allowed in the Park, including aggressive panhandling or soliciting. ONLY Trust authorized vehicles are allowed in the Park. No skateboarding or other motorized vehicles are allowed in the Park. No fires, hunting nor molesting wildlife are allowed in the Park. No littering or dumping personal belongings. Deposit trash in trash containers. No camping nor use of temporary structures, such as tents, chairs, hammocks or card board are allowed in the Park. No swimming, no fishing, nor solicitation without a Bayfront Park Management Trust issued permit in the Park. No Consumption of alcoholic beverages unless a special permit is obtained from Bayfront Park Management Trust. All commerce, advertising, vending, or business must be approved by Bayfront Park Management Trust. All docking, launching, or landing of a vessel requires a permit from Bayfront Park Management Trust. Any organized activity, event, or gatherings, such as photoshoots and video shoots require a permit from Bayfront Park Management Trust. No drones are allowed in the Park unless authorized by Bayfront Park Management Trust. All dogs must be on a leash and dog owners are responsible for picking up any waste, as well as any damage caused to the Park by owner’s dog. Any Park visitor found violating park rules will be removed from the premises and           enforced by Bayfront Park Security and City of Miami Police. For Permits and inquiries, please contact our Bayfront Park office: 305-358-7550 or at info@bayfrontparkmiami.com . THANK YOU FOR VISITING, COME AGAIN SOON! The above rules are detailed in Chapter 38 of the City of Miami Code; and enforced by Bayfront Park Staff, Bayfront Park Security, and City of Miami Police CLOSE STOP HUMAN TRAFFICKING CLOSE WELCOME TO MAURICE A. PARK Maurice A. Ferré Park has transformed into an open-air museum, boasting spectacular venues in close proximity to the bay, where breathtaking outdoor events take place. It offers magnificent views not only of Biscayne Bay but also the downtown Miami skyline, making it a privileged location for unforgettable gatherings. The park’s surroundings feature stunning artwork showcased along the Dogs and Cats Walkway, as well as an extraordinary area housing the Jiménez Deredia exhibition, which will be available throughout the entire year. Formerly called Museum Park, the 21-acre Maurice A. Ferré Park is home to the Peréz Art Museum Miami and the Patricia and Phillip Frost Museum of Science. Located north of AmericanAirlines Arena, this park is considered an extension of Bayfront Park. It sits right on Biscayne Bay and has an outdoor amphitheater, grassy areas, walking and biking baths and Plaza de la Marina Española (Spanish Navy Plaza), a monument that honors the Spanish Navy and its arrival in the Americas on October 12, 1492. X WELCOME TO BAYFRONT PARK Bayfront Park, originally called Royal Palm Park, is the oldest public gathering space in the Greater Miami community. Established in 1896, it started with a pavilion and green space used for sports activities. Over the years, it expanded to include a bandshell and became a venue for various events. Today, Bayfront Park spans 32 acres in Downtown Miami, offering stunning views of Biscayne Bay. It features open lawn spaces, a seaside path, sandy beach area, performance venues, VIP seating, tropical rock garden, and a historic waterfall from 1926. Discover a peaceful oasis tucked away in the heart of Miami. It’s the perfect place to relax, explore, and enjoy unhurried walks. Whether you’re having a picnic or participating in outdoor activities, this captivating park invites you, with its stunning waterfront views and expansive green spaces, to escape the bustling city and immerse yourself in the tranquility of nature. X Scroll to Top"
    },
    {
      "url": "https://bayfrontparkmiami.com/updates-from-instagram/",
      "text": "UPDATES FROM INSTAGRAM – BAYFRONT PARK MIAMI Skip to content HOME EVENTS Menu Toggle PLAN YOUR VISIT PAST EVENTS BOARD MEETINGS Menu Item PARKS Menu Toggle BAYFRONT PARK MAURICE A. FERRÉ PARK ABOUT Menu Toggle HISTORY INSTAGRAM POSTS RULES AND REGULATIONS FREQUENTLY ASKED QUESTIONS PRESS RELEASE CONTACT Main Menu HOME EVENTS Menu Toggle PLAN YOUR VISIT PAST EVENTS BOARD MEETINGS Menu Item PARKS Menu Toggle BAYFRONT PARK MAURICE A. FERRÉ PARK ABOUT Menu Toggle HISTORY INSTAGRAM POSTS RULES AND REGULATIONS FREQUENTLY ASKED QUESTIONS PRESS RELEASE CONTACT Main Menu INSTAGRAM POSTS bayfrontparkmia El Comisionado Joe Carollo, Chairman del Bayfront Visión en Acción:\n\nLa nueva fuente en el Bayfron @kiara_true brought the party to life at Bayfront More than 794,000 people tuned in to enjoy the New @joecarollonow, President of Bayfront Park Managem @marger enchanted Bayfront Park’s New Year’s f @albitacantante brought the stage to life at Bayfr @aymeenuviolaofficial took the spotlight at Bayfro @willychirino lit up the stage at Bayfront Park’ @lucreciaagua_ brought pure magic to Bayfront Park We lived unforgettable moments at this exciting Ne Vivimos momentos inolvidables en esta gran celebra Feel the energy of the upcoming New Year! Come to Celebrating at the big New Year’s party with @yo Wishing you a joyful New Year filled with health, Join us at Bayfront Park for the New Year’s Eve Be part of the New Year’s Eve party at Bayfront Celebrate the arrival of the New Year with @srtada Experience the magic of New Year’s Eve with @osn @hannarivas invites you to the New Year’s Eve pa Load More Follow on Instagram HOME EVENTS EXHIBITIONS Menu Toggle Jiménez Deredia in Miami Dogs & Cats Walkway and Sculptures BOARD MEETINGS Menu Item PARKS Menu Toggle BAYFRONT PARK MAURICE A. FERRÉ PARK ABOUT Menu Toggle INSTAGRAM POSTS RULES AND REGULATIONS FREQUENTLY ASKED QUESTIONS PRESS RELEASE CONTACT HOME EVENTS EXHIBITIONS Menu Toggle Jiménez Deredia in Miami Dogs & Cats Walkway and Sculptures BOARD MEETINGS Menu Item PARKS Menu Toggle BAYFRONT PARK MAURICE A. FERRÉ PARK ABOUT Menu Toggle INSTAGRAM POSTS RULES AND REGULATIONS FREQUENTLY ASKED QUESTIONS PRESS RELEASE CONTACT 301 North Biscayne Boulevard Miami, Florida 33132 305-358-7550 bayfrontparkmiami.com For more information please write to: info@bayfrontparkmiami.com Park operating hours from 7:00 am to 11:00 pm daily. Office Hours: Monday to Friday from 9:00 AM to 5:30 PM, closed on Saturdays and Sundays Unless there is a Special Event SUBSCRIBE Leave this field empty if you're human: Copyright © 2025 BAYFRONT PARK MIAMI | Powered by [FULLCO Studio] BAYFRONT PARK RULES AND REGULATIONS MAURICE A. FERRÉ PARK RULES AND REGULATIONS PARK HOURS: 7:00 a.m. to 10:00 p.m. Please keep the Park clean by not damaging the Park or its furnishings. Use of the Park and its amenities shall be used for its intended use and safely. Benches are strictly intended for sitting and NOT sleeping or laying down. Park sculptures and monuments are meant to be viewed and enjoyed. Please do not touch, sit, climb, nor deface any public art or monument. No aggressive or threatening behavior is allowed in the Park, including aggressive panhandling or soliciting. ONLY Trust authorized vehicles are allowed in the Park. No skateboarding or other motorized vehicles are allowed in the Park. No fires, hunting nor molesting wildlife are allowed in the Park. No littering or dumping personal belongings. Deposit trash in trash containers. No camping nor use of temporary structures, such as tents, chairs, hammocks or card board are allowed in the Park. No swimming, no fishing, nor solicitation without a Bayfront Park Management Trust issued permit in the Park. No Consumption of alcoholic beverages unless a special permit is obtained from Bayfront Park Management Trust. All commerce, advertising, vending, or business must be approved by Bayfront Park Management Trust. All docking, launching, or landing of a vessel requires a permit from Bayfront Park Management Trust. Any organized activity, event, or gatherings, such as photoshoots and video shoots require a permit from Bayfront Park Management Trust. No drones are allowed in the Park unless authorized by Bayfront Park Management Trust. All dogs must be on a leash and dog owners are responsible for picking up any waste, as well as any damage caused to the Park by owner’s dog. Any Park visitor found violating park rules will be removed from the premises and           enforced by Bayfront Park Security and City of Miami Police. For Permits and inquiries, please contact our Bayfront Park office: 305-358-7550 or at info@bayfrontparkmiami.com . THANK YOU FOR VISITING, COME AGAIN SOON! The above rules are detailed in Chapter 38 of the City of Miami Code; and enforced by Bayfront Park Staff, Bayfront Park Security, and City of Miami Police CLOSE STOP HUMAN TRAFFICKING CLOSE WELCOME TO MAURICE A. PARK Maurice A. Ferré Park has transformed into an open-air museum, boasting spectacular venues in close proximity to the bay, where breathtaking outdoor events take place. It offers magnificent views not only of Biscayne Bay but also the downtown Miami skyline, making it a privileged location for unforgettable gatherings. The park’s surroundings feature stunning artwork showcased along the Dogs and Cats Walkway, as well as an extraordinary area housing the Jiménez Deredia exhibition, which will be available throughout the entire year. Formerly called Museum Park, the 21-acre Maurice A. Ferré Park is home to the Peréz Art Museum Miami and the Patricia and Phillip Frost Museum of Science. Located north of AmericanAirlines Arena, this park is considered an extension of Bayfront Park. It sits right on Biscayne Bay and has an outdoor amphitheater, grassy areas, walking and biking baths and Plaza de la Marina Española (Spanish Navy Plaza), a monument that honors the Spanish Navy and its arrival in the Americas on October 12, 1492. X WELCOME TO BAYFRONT PARK Bayfront Park, originally called Royal Palm Park, is the oldest public gathering space in the Greater Miami community. Established in 1896, it started with a pavilion and green space used for sports activities. Over the years, it expanded to include a bandshell and became a venue for various events. Today, Bayfront Park spans 32 acres in Downtown Miami, offering stunning views of Biscayne Bay. It features open lawn spaces, a seaside path, sandy beach area, performance venues, VIP seating, tropical rock garden, and a historic waterfall from 1926. Discover a peaceful oasis tucked away in the heart of Miami. It’s the perfect place to relax, explore, and enjoy unhurried walks. Whether you’re having a picnic or participating in outdoor activities, this captivating park invites you, with its stunning waterfront views and expansive green spaces, to escape the bustling city and immerse yourself in the tranquility of nature. X Scroll to Top"
    },
    {
      "url": "https://bayfrontparkmiami.com/",
      "text": "BAYFRONT PARK MIAMI Skip to content BAYFRONT PARK ENTER NOW Welcome to the Bayfront Park Management Trust Where creating exceptional experiences within our parks is our priority. Our commitment to fostering strong community relationships, coupled with our dedication to preserving and enhancing the unique qualities of each park is what sets us apart. Established in 1924, Bayfront Park, our 32-acre urban oasis in the heart of downtown Miami, offers stunning views of Biscayne Bay and the city skyline. In addition, Maurice A. Ferré Park, a 30-acre public park, adds to the vibrant green spaces to our thriving urban community. Both parks host various amenities and a diverse array of events, serving as beloved destinations for residents and visitors alike, earning their reputation as Miami’s Central Parks. Join us as we continue to make Bayfront Park and Maurice A. Ferré Park, beautiful and inspirational spaces for all to enjoy. FAQs | RULES AND REGULATIONS MAURICE A FERRÉ PARK ENTER NOW BAYFRONT PARK ENTER MAURICE A. FERRÉ PARK ENTER Welcome to the Bayfront Park Management Trust Where creating exceptional experiences within our parks is our priority. Our commitment to fostering strong community relationships, coupled with our dedication to preserving and enhancing the unique qualities of each park is what sets us apart. Established in 1924, Bayfront Park, our 32-acre urban oasis in the heart of downtown Miami, offers stunning views of Biscayne Bay and the city skyline. In addition, Maurice A. Ferré Park, a 30-acre public park, adds to the vibrant green spaces to our thriving urban community. Both parks host various amenities and a diverse array of events, serving as beloved destinations for residents and visitors alike, earning their reputation as Miami’s Central Parks. Join us as we continue to make Bayfront Park and Maurice A. Ferré Park, beautiful and inspirational spaces for all to enjoy. FAQs | RULES AND REGULATIONS HOME EVENTS EXHIBITIONS Menu Toggle Jiménez Deredia in Miami Dogs & Cats Walkway and Sculptures BOARD MEETINGS Menu Item PARKS Menu Toggle BAYFRONT PARK MAURICE A. FERRÉ PARK ABOUT Menu Toggle INSTAGRAM POSTS RULES AND REGULATIONS FREQUENTLY ASKED QUESTIONS PRESS RELEASE CONTACT HOME EVENTS EXHIBITIONS Menu Toggle Jiménez Deredia in Miami Dogs & Cats Walkway and Sculptures BOARD MEETINGS Menu Item PARKS Menu Toggle BAYFRONT PARK MAURICE A. FERRÉ PARK ABOUT Menu Toggle INSTAGRAM POSTS RULES AND REGULATIONS FREQUENTLY ASKED QUESTIONS PRESS RELEASE CONTACT BAYFRONT PARK RULES AND REGULATIONS MAURICE A. FERRÉ PARK RULES AND REGULATIONS PARK HOURS: 7:00 a.m. to 10:00 p.m. Please keep the Park clean by not damaging the Park or its furnishings. Use of the Park and its amenities shall be used for its intended use and safely. Benches are strictly intended for sitting and NOT sleeping or laying down. Park sculptures and monuments are meant to be viewed and enjoyed. Please do not touch, sit, climb, nor deface any public art or monument. No aggressive or threatening behavior is allowed in the Park, including aggressive panhandling or soliciting. ONLY Trust authorized vehicles are allowed in the Park. No skateboarding or other motorized vehicles are allowed in the Park. No fires, hunting nor molesting wildlife are allowed in the Park. No littering or dumping personal belongings. Deposit trash in trash containers. No camping nor use of temporary structures, such as tents, chairs, hammocks or card board are allowed in the Park. No swimming, no fishing, nor solicitation without a Bayfront Park Management Trust issued permit in the Park. No Consumption of alcoholic beverages unless a special permit is obtained from Bayfront Park Management Trust. All commerce, advertising, vending, or business must be approved by Bayfront Park Management Trust. All docking, launching, or landing of a vessel requires a permit from Bayfront Park Management Trust. Any organized activity, event, or gatherings, such as photoshoots and video shoots require a permit from Bayfront Park Management Trust. No drones are allowed in the Park unless authorized by Bayfront Park Management Trust. All dogs must be on a leash and dog owners are responsible for picking up any waste, as well as any damage caused to the Park by owner’s dog. Any Park visitor found violating park rules will be removed from the premises and           enforced by Bayfront Park Security and City of Miami Police. For Permits and inquiries, please contact our Bayfront Park office: 305-358-7550 or at info@bayfrontparkmiami.com . THANK YOU FOR VISITING, COME AGAIN SOON! The above rules are detailed in Chapter 38 of the City of Miami Code; and enforced by Bayfront Park Staff, Bayfront Park Security, and City of Miami Police CLOSE STOP HUMAN TRAFFICKING CLOSE WELCOME TO MAURICE A. PARK Maurice A. Ferré Park has transformed into an open-air museum, boasting spectacular venues in close proximity to the bay, where breathtaking outdoor events take place. It offers magnificent views not only of Biscayne Bay but also the downtown Miami skyline, making it a privileged location for unforgettable gatherings. The park’s surroundings feature stunning artwork showcased along the Dogs and Cats Walkway, as well as an extraordinary area housing the Jiménez Deredia exhibition, which will be available throughout the entire year. Formerly called Museum Park, the 21-acre Maurice A. Ferré Park is home to the Peréz Art Museum Miami and the Patricia and Phillip Frost Museum of Science. Located north of AmericanAirlines Arena, this park is considered an extension of Bayfront Park. It sits right on Biscayne Bay and has an outdoor amphitheater, grassy areas, walking and biking baths and Plaza de la Marina Española (Spanish Navy Plaza), a monument that honors the Spanish Navy and its arrival in the Americas on October 12, 1492. X WELCOME TO BAYFRONT PARK Bayfront Park, originally called Royal Palm Park, is the oldest public gathering space in the Greater Miami community. Established in 1896, it started with a pavilion and green space used for sports activities. Over the years, it expanded to include a bandshell and became a venue for various events. Today, Bayfront Park spans 32 acres in Downtown Miami, offering stunning views of Biscayne Bay. It features open lawn spaces, a seaside path, sandy beach area, performance venues, VIP seating, tropical rock garden, and a historic waterfall from 1926. Discover a peaceful oasis tucked away in the heart of Miami. It’s the perfect place to relax, explore, and enjoy unhurried walks. Whether you’re having a picnic or participating in outdoor activities, this captivating park invites you, with its stunning waterfront views and expansive green spaces, to escape the bustling city and immerse yourself in the tranquility of nature. X Scroll to Top"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. name Surname First First name Surname * E-Mail * Nachricht * Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "https://bayfrontparkmiami.com/park-events/",
      "text": "EVENTS – BAYFRONT PARK MIAMI Skip to content HOME EVENTS Menu Toggle PLAN YOUR VISIT PAST EVENTS BOARD MEETINGS Menu Item PARKS Menu Toggle BAYFRONT PARK MAURICE A. FERRÉ PARK ABOUT Menu Toggle HISTORY INSTAGRAM POSTS RULES AND REGULATIONS FREQUENTLY ASKED QUESTIONS PRESS RELEASE CONTACT Main Menu HOME EVENTS Menu Toggle PLAN YOUR VISIT PAST EVENTS BOARD MEETINGS Menu Item PARKS Menu Toggle BAYFRONT PARK MAURICE A. FERRÉ PARK ABOUT Menu Toggle HISTORY INSTAGRAM POSTS RULES AND REGULATIONS FREQUENTLY ASKED QUESTIONS PRESS RELEASE CONTACT Main Menu BAYFRONT PARK EVENTS BAYFRONT PARK EVENTS Events Looking for something to do today, tonight, this weekend? At Bayfront Park and Maurice a Ferre Park you can always find something fun for you or the whole family. Outdoor concerts, free yoga classes, holiday parties, and more.  Check in often as we’re always adding new events. For information on hiring events, contact SANTRAVIA BUTLER sbutler@miamigov.com Events Looking for something to do today, tonight, this weekend? At Bayfront Park and Maurice a Ferre Park you can always find something fun for you or the whole family. Outdoor concerts, free yoga classes, holiday parties, and more.  Check in often as we’re always adding new events. For information on hiring events, contact SANTRAVIA BUTLER sbutler@miamigov.com Plan your visit by navigating through the calendar view according to your convenience Plan your visit by navigating through the calendar view according to your convenience Monthly Weekly Daily List September 2025 Free Yoga Via Zoom SPONSORED BY BAPTIST HEALTH SOUTH FLORIDA 09 Sep 5:00 pm - 6:00 pm Bayfront Park 301 Biscayne Blvd, Miami, FL 33132 Facebook Twitter Linkedin Email View Detail Yoga Classes by Donation Free Yoga Classes with Instructor Nicolay Del Salto at Bayfront Park. 10 Sep 6:00 pm - 7:00 pm Bayfront Park 301 Biscayne Blvd, Miami, FL 33132 Facebook Twitter Linkedin Email View Detail Free Yoga Via Zoom SPONSORED BY BAPTIST HEALTH SOUTH FLORIDA 11 Sep 5:00 pm - 6:00 pm Bayfront Park 301 Biscayne Blvd, Miami, FL 33132 Facebook Twitter Linkedin Email View Detail Yoga Classes by Donation Free Yoga Classes with Instructor Nicolay Del Salto at Bayfront Park. 15 Sep 6:00 pm - 7:00 pm Bayfront Park 301 Biscayne Blvd, Miami, FL 33132 Facebook Twitter Linkedin Email View Detail Free Yoga Via Zoom SPONSORED BY BAPTIST HEALTH SOUTH FLORIDA 16 Sep 5:00 pm - 6:00 pm Bayfront Park 301 Biscayne Blvd, Miami, FL 33132 Facebook Twitter Linkedin Email View Detail Yoga Classes by Donation Free Yoga Classes with Instructor Nicolay Del Salto at Bayfront Park. 17 Sep 6:00 pm - 7:00 pm Bayfront Park 301 Biscayne Blvd, Miami, FL 33132 Facebook Twitter Linkedin Email View Detail Free Yoga Via Zoom SPONSORED BY BAPTIST HEALTH SOUTH FLORIDA 18 Sep 5:00 pm - 6:00 pm Bayfront Park 301 Biscayne Blvd, Miami, FL 33132 Facebook Twitter Linkedin Email View Detail Yoga Classes by Donation Free Yoga Classes with Instructor Nicolay Del Salto at Bayfront Park. 22 Sep 6:00 pm - 7:00 pm Bayfront Park 301 Biscayne Blvd, Miami, FL 33132 Facebook Twitter Linkedin Email View Detail Free Yoga Via Zoom SPONSORED BY BAPTIST HEALTH SOUTH FLORIDA 23 Sep 5:00 pm - 6:00 pm Bayfront Park 301 Biscayne Blvd, Miami, FL 33132 Facebook Twitter Linkedin Email View Detail Yoga Classes by Donation Free Yoga Classes with Instructor Nicolay Del Salto at Bayfront Park. 24 Sep 6:00 pm - 7:00 pm Bayfront Park 301 Biscayne Blvd, Miami, FL 33132 Facebook Twitter Linkedin Email View Detail Free Yoga Via Zoom SPONSORED BY BAPTIST HEALTH SOUTH FLORIDA 25 Sep 5:00 pm - 6:00 pm Bayfront Park 301 Biscayne Blvd, Miami, FL 33132 Facebook Twitter Linkedin Email View Detail Yoga Classes by Donation Free Yoga Classes with Instructor Nicolay Del Salto at Bayfront Park. 29 Sep 6:00 pm - 7:00 pm Bayfront Park 301 Biscayne Blvd, Miami, FL 33132 Facebook Twitter Linkedin Email View Detail No event found! Load More HOME EVENTS EXHIBITIONS Menu Toggle Jiménez Deredia in Miami Dogs & Cats Walkway and Sculptures BOARD MEETINGS Menu Item PARKS Menu Toggle BAYFRONT PARK MAURICE A. FERRÉ PARK ABOUT Menu Toggle INSTAGRAM POSTS RULES AND REGULATIONS FREQUENTLY ASKED QUESTIONS PRESS RELEASE CONTACT HOME EVENTS EXHIBITIONS Menu Toggle Jiménez Deredia in Miami Dogs & Cats Walkway and Sculptures BOARD MEETINGS Menu Item PARKS Menu Toggle BAYFRONT PARK MAURICE A. FERRÉ PARK ABOUT Menu Toggle INSTAGRAM POSTS RULES AND REGULATIONS FREQUENTLY ASKED QUESTIONS PRESS RELEASE CONTACT 301 North Biscayne Boulevard Miami, Florida 33132 305-358-7550 bayfrontparkmiami.com For more information please write to: info@bayfrontparkmiami.com Park operating hours from 7:00 am to 11:00 pm daily. Office Hours: Monday to Friday from 9:00 AM to 5:30 PM, closed on Saturdays and Sundays Unless there is a Special Event SUBSCRIBE Leave this field empty if you're human: Copyright © 2025 BAYFRONT PARK MIAMI | Powered by [FULLCO Studio] BAYFRONT PARK RULES AND REGULATIONS MAURICE A. FERRÉ PARK RULES AND REGULATIONS PARK HOURS: 7:00 a.m. to 10:00 p.m. Please keep the Park clean by not damaging the Park or its furnishings. Use of the Park and its amenities shall be used for its intended use and safely. Benches are strictly intended for sitting and NOT sleeping or laying down. Park sculptures and monuments are meant to be viewed and enjoyed. Please do not touch, sit, climb, nor deface any public art or monument. No aggressive or threatening behavior is allowed in the Park, including aggressive panhandling or soliciting. ONLY Trust authorized vehicles are allowed in the Park. No skateboarding or other motorized vehicles are allowed in the Park. No fires, hunting nor molesting wildlife are allowed in the Park. No littering or dumping personal belongings. Deposit trash in trash containers. No camping nor use of temporary structures, such as tents, chairs, hammocks or card board are allowed in the Park. No swimming, no fishing, nor solicitation without a Bayfront Park Management Trust issued permit in the Park. No Consumption of alcoholic beverages unless a special permit is obtained from Bayfront Park Management Trust. All commerce, advertising, vending, or business must be approved by Bayfront Park Management Trust. All docking, launching, or landing of a vessel requires a permit from Bayfront Park Management Trust. Any organized activity, event, or gatherings, such as photoshoots and video shoots require a permit from Bayfront Park Management Trust. No drones are allowed in the Park unless authorized by Bayfront Park Management Trust. All dogs must be on a leash and dog owners are responsible for picking up any waste, as well as any damage caused to the Park by owner’s dog. Any Park visitor found violating park rules will be removed from the premises and           enforced by Bayfront Park Security and City of Miami Police. For Permits and inquiries, please contact our Bayfront Park office: 305-358-7550 or at info@bayfrontparkmiami.com . THANK YOU FOR VISITING, COME AGAIN SOON! The above rules are detailed in Chapter 38 of the City of Miami Code; and enforced by Bayfront Park Staff, Bayfront Park Security, and City of Miami Police CLOSE STOP HUMAN TRAFFICKING CLOSE WELCOME TO MAURICE A. PARK Maurice A. Ferré Park has transformed into an open-air museum, boasting spectacular venues in close proximity to the bay, where breathtaking outdoor events take place. It offers magnificent views not only of Biscayne Bay but also the downtown Miami skyline, making it a privileged location for unforgettable gatherings. The park’s surroundings feature stunning artwork showcased along the Dogs and Cats Walkway, as well as an extraordinary area housing the Jiménez Deredia exhibition, which will be available throughout the entire year. Formerly called Museum Park, the 21-acre Maurice A. Ferré Park is home to the Peréz Art Museum Miami and the Patricia and Phillip Frost Museum of Science. Located north of AmericanAirlines Arena, this park is considered an extension of Bayfront Park. It sits right on Biscayne Bay and has an outdoor amphitheater, grassy areas, walking and biking baths and Plaza de la Marina Española (Spanish Navy Plaza), a monument that honors the Spanish Navy and its arrival in the Americas on October 12, 1492. X WELCOME TO BAYFRONT PARK Bayfront Park, originally called Royal Palm Park, is the oldest public gathering space in the Greater Miami community. Established in 1896, it started with a pavilion and green space used for sports activities. Over the years, it expanded to include a bandshell and became a venue for various events. Today, Bayfront Park spans 32 acres in Downtown Miami, offering stunning views of Biscayne Bay. It features open lawn spaces, a seaside path, sandy beach area, performance venues, VIP seating, tropical rock garden, and a historic waterfall from 1926. Discover a peaceful oasis tucked away in the heart of Miami. It’s the perfect place to relax, explore, and enjoy unhurried walks. Whether you’re having a picnic or participating in outdoor activities, this captivating park invites you, with its stunning waterfront views and expansive green spaces, to escape the bustling city and immerse yourself in the tranquility of nature. X Scroll to Top"
    },
    {
      "url": "https://www.nps.gov/aboutus/contactus.htm?StartRow=51&pk=&sn=fe",
      "text": "Contact Us (U.S. National Park Service) An official website of the United States government Here's how you know Here's how you know Official websites use .gov A .gov website belongs to an official government\norganization in the United States. Secure .gov websites use HTTPS A lock ( Lock Locked padlock icon ) or https:// means you've safely connected to\nthe .gov website. Share sensitive information only on official,\nsecure websites. Skip to global NPS navigation Skip to the main content Skip to the footer section National Park Service Search Search This Site All NPS Open Menu Close Menu Explore This Park Explore the National Park Service Exiting nps.gov Cancel About Us Contact Us Contact Us Important Links Frequently Asked Questions Entrance Passes Jobs Pets Help us help you by directing your question to the right people! Before you send an email, check out frequently asked questions , which includes information about the National Park Service, visiting parks (including entrance passes ), and other topics. Parks For information about a specific park (or to report an error on a park webpage), type the park's name into the search box below to get the park's contact information. If you have a park-specific question, it's best to communicate directly with that park. Park names Select a park Abraham Lincoln Birthplace National Historical Park Acadia National Park Adams National Historical Park African American Civil War Memorial African Burial Ground National Monument Agate Fossil Beds National Monument Ala Kahakai National Historic Trail Alagnak Wild River Alaska Public Lands Alcatraz Island Aleutian Islands World War II National Historic Area Alibates Flint Quarries National Monument Allegheny Portage Railroad National Historic Site Amache National Historic Site American Memorial Park Amistad National Recreation Area Anacostia Park Andersonville National Historic Site Andrew Johnson National Historic Site Aniakchak National Monument & Preserve Antietam National Battlefield Apostle Islands National Lakeshore Appalachian National Scenic Trail Appomattox Court House National Historical Park Arches National Park Arkansas Post National Memorial Arlington House, The Robert  E. Lee Memorial Assateague Island National Seashore Aztec Ruins National Monument Badlands National Park Baltimore-Washington Parkway Bandelier National Monument Belmont-Paul Women's Equality National Monument Bent's Old Fort National Historic Site Bering Land Bridge National Preserve Big Bend National Park Big Cypress National Preserve Big Hole National Battlefield Big South Fork National River & Recreation Area Big Thicket National Preserve Bighorn Canyon National Recreation Area Birmingham Civil Rights National Monument Biscayne National Park Black Canyon Of The Gunnison National Park Blackstone River Valley National Historical Park Blackwell School National Historic Site Blue Ridge Parkway Bluestone National Scenic River Booker T Washington National Monument Boston African American National Historic Site Boston Harbor Islands National Recreation Area Boston National Historical Park Brices Cross Roads National Battlefield Site Brown v. Board of Education National Historical Park Bryce Canyon National Park Buck Island Reef National Monument Buffalo National River Butterfield Overland National Historic Trail Cabrillo National Monument California National Historic Trail Camp Nelson National Monument Canaveral National Seashore Cane River Creole National Historical Park Canyon de Chelly National Monument Canyonlands National Park Cape Cod National Seashore Cape Hatteras National Seashore Cape Henry Memorial Part of Colonial National Historical Park Cape Krusenstern National Monument Cape Lookout National Seashore Capitol Hill Parks Capitol Reef National Park Captain John Smith Chesapeake National Historic Trail Capulin Volcano National Monument Carl Sandburg Home National Historic Site Carlisle Federal Indian Boarding School National Monument Carlsbad Caverns National Park Carter G. Woodson Home National Historic Site Casa Grande Ruins National Monument Castillo de San Marcos National Monument Castle Clinton National Monument Castle Mountains National Monument Catoctin Mountain Park Cedar Breaks National Monument Cedar Creek & Belle Grove National Historical Park Chaco Culture National Historical Park Chamizal National Memorial Channel Islands National Park Charles Pinckney National Historic Site Charles Young Buffalo Soldiers National Monument Chattahoochee River National Recreation Area Chesapeake & Ohio Canal National Historical Park Chesapeake Bay Chickamauga & Chattanooga National Military Park Chickasaw National Recreation Area Chiricahua National Monument Christiansted National Historic Site City Of Rocks National Reserve Civil War Defenses of Washington Clara Barton National Historic Site Colonial National Historical Park Colorado National Monument Coltsville National Historical Park Congaree National Park Constitution Gardens Coronado National Memorial Cowpens National Battlefield Crater Lake National Park Craters Of The Moon National Monument & Preserve Cumberland Gap National Historical Park Cumberland Island National Seashore Curecanti National Recreation Area Cuyahoga Valley National Park César E. Chávez National Monument Dayton Aviation Heritage National Historical Park De Soto National Memorial Death Valley National Park Delaware Water Gap National Recreation Area Denali National Park & Preserve Devils Postpile National Monument Devils Tower National Monument Dinosaur National Monument Dry Tortugas National Park Dwight D. Eisenhower Memorial Ebey's Landing National Historical Reserve Edgar Allan Poe National Historic Site Effigy Mounds National Monument Eisenhower National Historic Site El Camino Real de los Tejas National Historic Trail El Camino Real de Tierra Adentro National Historic Trail El Malpais National Monument El Morro National Monument Eleanor Roosevelt National Historic Site Ellis Island Part of Statue of Liberty National Monument Emmett Till and Mamie Till-Mobley National Monument Eugene O'Neill National Historic Site Everglades National Park Federal Hall National Memorial Fire Island National Seashore First Ladies National Historic Site First State National Historical Park Flight 93 National Memorial Florissant Fossil Beds National Monument Ford's Theatre National Historic Site Fort Bowie National Historic Site Fort Caroline National Memorial Fort Davis National Historic Site Fort Donelson National Battlefield Fort Dupont Park Fort Foote Park Fort Frederica National Monument Fort Laramie National Historic Site Fort Larned National Historic Site Fort Matanzas National Monument Fort McHenry National Monument and Historic Shrine Fort Monroe National Monument Fort Necessity National Battlefield Fort Point National Historic Site Fort Pulaski National Monument Fort Raleigh National Historic Site Fort Scott National Historic Site Fort Smith National Historic Site Fort Stanwix National Monument Fort Sumter and Fort Moultrie National Historical Park Fort Union National Monument Fort Union Trading Post National Historic Site Fort Vancouver National Historic Site Fort Washington Park Fossil Butte National Monument Frances Perkins National Monument Franklin Delano Roosevelt Memorial Frederick Douglass National Historic Site Frederick Law Olmsted National Historic Site Fredericksburg & Spotsylvania National Military Park Freedom Riders National Monument Friendship Hill National Historic Site Gates Of The Arctic National Park & Preserve Gateway Arch National Park Gateway National Recreation Area Gauley River National Recreation Area General Grant National Memorial George Rogers Clark National Historical Park George Washington Birthplace National Monument George Washington Carver National Monument George Washington Memorial Parkway Gettysburg National Military Park Gila Cliff Dwellings National Monument Glacier Bay National Park & Preserve Glacier National Park Glen Canyon National Recreation Area Glen Echo Park Gloria Dei Church National Historic Site Golden Gate National Recreation Area Golden Spike National Historical Park Governors Island National Monument Grand Canyon National Park Grand Canyon-Parashant National Monument Grand Portage National Monument Grand Teton National Park Grant-Kohrs Ranch National Historic Site Great Basin National Park Great Egg Harbor River Great Falls Park Great Sand Dunes National Park & Preserve Great Smoky Mountains National Park Green Springs Greenbelt Park Guadalupe Mountains National Park Guilford Courthouse National Military Park Gulf Islands National Seashore Hagerman Fossil Beds National Monument Haleakalā National Park Hamilton Grange National Memorial Hampton National Historic Site Harmony Hall Harpers Ferry National Historical Park Harriet Tubman National Historical Park Harriet Tubman Underground Railroad National Historical Park Harry S Truman National Historic Site Hawaiʻi Volcanoes National Park Herbert Hoover National Historic Site Historic Jamestowne Part of Colonial National Historical Park Home Of Franklin D Roosevelt National Historic Site Homestead National Historical Park Honouliuli National Historic Site Hopewell Culture National Historical Park Hopewell Furnace National Historic Site Horseshoe Bend National Military Park Hot Springs National Park Hovenweep National Monument Hubbell Trading Post National Historic Site Ice Age Floods National Geologic Trail Ice Age National Scenic Trail Independence National Historical Park Indiana Dunes National Park Isle Royale National Park Iñupiat Heritage Center James A Garfield National Historic Site Jean Lafitte National Historical Park and Preserve Jewel Cave National Monument Jimmy Carter National Historical Park John Day Fossil Beds National Monument John Fitzgerald Kennedy National Historic Site John Muir National Historic Site Johnstown Flood National Memorial Joshua Tree National Park Juan Bautista de Anza National Historic Trail Kalaupapa National Historical Park Kaloko-Honokōhau National Historical Park Katahdin Woods and Waters National Monument Katmai National Park & Preserve Kenai Fjords National Park Kenilworth Park & Aquatic Gardens Kennesaw Mountain National Battlefield Park Keweenaw National Historical Park Kings Mountain National Military Park Klondike Gold Rush - Seattle Unit National Historical Park Klondike Gold Rush National Historical Park Knife River Indian Villages National Historic Site Kobuk Valley National Park Korean War Veterans Memorial Lake Clark National Park & Preserve Lake Mead National Recreation Area Lake Meredith National Recreation Area Lake Roosevelt National Recreation Area Lassen Volcanic National Park Lava Beds National Monument LBJ Memorial Grove on the Potomac Lewis & Clark National Historic Trail Lewis and Clark National Historical Park Lincoln Boyhood National Memorial Lincoln Home National Historic Site Lincoln Memorial Little Bighorn Battlefield National Monument Little River Canyon National Preserve Little Rock Central High School National Historic Site Longfellow House Washington's Headquarters National Historic Site Lowell National Historical Park Lower Delaware National Wild and Scenic River Lower East Side Tenement Museum National Historic Site Lyndon B Johnson National Historical Park Maggie L Walker National Historic Site Maine Acadian Culture Mammoth Cave National Park Manassas National Battlefield Park Manhattan Project National Historical Park Manzanar National Historic Site Marsh - Billings - Rockefeller National Historical Park Martin Luther King, Jr. Memorial Martin Luther King, Jr. National Historical Park Martin Van Buren National Historic Site Mary McLeod Bethune Council House National Historic Site Medgar and Myrlie Evers Home National Monument Mesa Verde National Park Mill Springs Battlefield National Monument Minidoka National Historic Site Minute Man National Historical Park Minuteman Missile National Historic Site Mississippi National River & Recreation Area Missouri National Recreational River Mojave National Preserve Monocacy National Battlefield Montezuma Castle National Monument Moores Creek National Battlefield Mormon Pioneer National Historic Trail Morristown National Historical Park Mount Rainier National Park Mount Rushmore National Memorial Muir Woods National Monument Natchez National Historical Park Natchez Trace National Scenic Trail Natchez Trace Parkway National Capital Parks-East National Mall and Memorial Parks National Park of American Samoa National Parks of New York Harbor Natural Bridges National Monument Navajo National Monument New Bedford Whaling National Historical Park New England National Scenic Trail New Jersey Pinelands National Reserve New Orleans Jazz National Historical Park New Philadelphia National Historic Site New River Gorge National Park & Preserve Nez Perce National Historical Park Nicodemus National Historic Site Ninety Six National Historic Site Niobrara National Scenic River Noatak National Preserve North Cascades National Park North Country National Scenic Trail Obed Wild & Scenic River Ocmulgee Mounds National Historical Park Oklahoma City National Memorial Old Spanish National Historic Trail Olympic National Park Oregon Caves National Monument & Preserve Oregon National Historic Trail Organ Pipe Cactus National Monument Overmountain Victory National Historic Trail Oxon Cove  Park & Oxon Hill Farm Ozark National Scenic Riverways Padre Island National Seashore Palo Alto Battlefield National Historical Park Paterson Great Falls National Historical Park Pea Ridge National Military Park Pearl Harbor National Memorial Pecos National Historical Park Pennsylvania Avenue Perry's Victory & International Peace Memorial Petersburg National Battlefield Petrified Forest National Park Petroglyph National Monument Pictured Rocks National Lakeshore Pinnacles National Park Pipe Spring National Monument Pipestone National Monument Piscataway Park Point Reyes National Seashore Pony Express National Historic Trail Port Chicago Naval Magazine National Memorial Potomac Heritage National Scenic Trail Poverty Point National Monument President William Jefferson Clinton Birthplace Home National Historic Site Presidio of San Francisco Prince William Forest Park Pullman National Historical Park Puʻuhonua o Hōnaunau National Historical Park Puʻukoholā Heiau National Historic Site Rainbow Bridge National Monument Reconstruction Era National Historical Park Redwood National and State Parks Richmond National Battlefield Park Rio Grande Wild & Scenic River River Raisin National Battlefield Park Rock Creek Park Rocky Mountain National Park Roger Williams National Memorial Roosevelt Campobello International Park Rosie the Riveter WWII Home Front National Historical Park Russell Cave National Monument Sagamore Hill National Historic Site Saguaro National Park Saint Croix Island International Historic Site Saint Croix National Scenic Riverway Saint Paul's Church National Historic Site Saint-Gaudens National Historical Park Salem Maritime National Historical Park Salinas Pueblo Missions National Monument Salt River Bay National Historical Park and Ecological Preserve San Antonio Missions National Historical Park San Francisco Maritime National Historical Park San Juan Island National Historical Park San Juan National Historic Site Sand Creek Massacre National Historic Site Santa Fe National Historic Trail Santa Monica Mountains National Recreation Area Saratoga National Historical Park Saugus Iron Works National Historic Site Scotts Bluff National Monument Selma To Montgomery National Historic Trail Sequoia & Kings Canyon National Parks Shenandoah National Park Shiloh National Military Park Sitka National Historical Park Sleeping Bear Dunes National Lakeshore Springfield 1908 Race Riot National Monument Springfield Armory National Historic Site Star-Spangled Banner National Historic Trail Statue Of Liberty National Monument Ste. Geneviève National Historical Park Steamtown National Historic Site Stones River National Battlefield Stonewall National Monument Sunset Crater Volcano National Monument Tallgrass Prairie National Preserve Thaddeus Kosciuszko National Memorial The White House and President's Park Theodore Roosevelt Birthplace National Historic Site Theodore Roosevelt Inaugural National Historic Site Theodore Roosevelt Island Theodore Roosevelt National Park Thomas Cole National Historic Site Thomas Edison National Historical Park Thomas Jefferson Memorial Thomas Stone National Historic Site Timpanogos Cave National Monument Timucuan Ecological & Historic Preserve Tonto National Monument Touro Synagogue National Historic Site Trail Of Tears National Historic Trail Tule Lake National Monument Tule Springs Fossil Beds National Monument Tumacácori National Historical Park Tupelo National Battlefield Tuskegee Airmen National Historic Site Tuskegee Institute National Historic Site Tuzigoot National Monument Ulysses S Grant National Historic Site Upper Delaware Scenic & Recreational River Valles Caldera National Preserve Valley Forge National Historical Park Vanderbilt Mansion National Historic Site Vicksburg National Military Park Vietnam Veterans Memorial Virgin Islands Coral Reef National Monument Virgin Islands National Park Voyageurs National Park Waco Mammoth National Monument Walnut Canyon National Monument War In The Pacific National Historical Park Washington Monument Washington-Rochambeau Revolutionary Route National Historic Trail Washita Battlefield National Historic Site Weir Farm National Historical Park Whiskeytown National Recreation Area White Sands National Park Whitman Mission National Historic Site William Howard Taft National Historic Site Wilson's Creek National Battlefield Wind Cave National Park Wing Luke Museum Affiliated Area Wolf Trap National Park for the Performing Arts Women's Rights National Historical Park World War I Memorial World War II Memorial Wrangell - St Elias National Park & Preserve Wright Brothers National Memorial Wupatki National Monument Yellowstone National Park Yorktown Battlefield Part of Colonial National Historical Park Yosemite National Park Yucca House National Monument Yukon - Charley Rivers National Preserve Zion National Park National Park Service Submit a media inquiry (for members of the media) Ask questions about our agency Report errors or technical difficulties Addresses and phone numbers for national and regional offices Freedom of Information Act Customer service standards Additional Links Entrance passes Recreation.gov for many park reservations such as camping Authorized concessioners (see park websites for information about specific services) This Site All NPS Experience Your America. Download the NPS app to navigate the parks on the go. National Park Service U.S. Department of the Interior Accessibility Privacy Policy FOIA Notices Contact The National Park Service NPS FAQ No Fear Act Disclaimer Vulnerability Disclosure Policy USA.gov"
    },
    {
      "url": "https://bayfrontparkmiami.com/frequently-asked-questions/",
      "text": "Frequently Asked Questions – BAYFRONT PARK MIAMI Skip to content HOME EVENTS Menu Toggle PLAN YOUR VISIT PAST EVENTS BOARD MEETINGS Menu Item PARKS Menu Toggle BAYFRONT PARK MAURICE A. FERRÉ PARK ABOUT Menu Toggle HISTORY INSTAGRAM POSTS RULES AND REGULATIONS FREQUENTLY ASKED QUESTIONS PRESS RELEASE CONTACT Main Menu HOME EVENTS Menu Toggle PLAN YOUR VISIT PAST EVENTS BOARD MEETINGS Menu Item PARKS Menu Toggle BAYFRONT PARK MAURICE A. FERRÉ PARK ABOUT Menu Toggle HISTORY INSTAGRAM POSTS RULES AND REGULATIONS FREQUENTLY ASKED QUESTIONS PRESS RELEASE CONTACT Main Menu FREQUENTLY ASKED QUESTIONS What are the park's operating hours? 7:00 a.m. to 10:00 p.m. Are pets allowed in the park? Yes. Pets are allowed in the park. All dogs must be on a leash, and dog owners are responsible for picking up any waste from their pets. Are picnics, barbecues, events, or meetings allowed? Any organized activity or gathering requires a permit. Get in touch with Bayfront Park Management Trust at 305-358-7550 or email us at info@bayfrontparkmiami.com . Is alcohol permitted? Consumption of alcohol is prohibited at both parks, except during authorized events. Is there an entrance fee? No. It’s free admission. Is fishing allowed? No. Fishing is not allowed in the park. Is swimming or boating allowed? Swimming is not allowed, and docking or landing any sea vessel in the park requires a permit. Are motorized or battery-operated bikes and scooters allowed in the parks? No, motorized or battery-operated bikes and scooters are not permitted. What is the address of Bayfront Park and Maurice A. Ferré Park? Bayfront Park is located at 301 Biscayne Blvd, Miami, FL 33132, and Maurice A. Ferré Park is located at 1075 Biscayne Blvd, Miami, FL 33132. Where are the bathrooms located at Bayfront Park and Maurice A. Ferré Park? Public restrooms are available at both parks. At Maurice A. Ferré Park, they are located near to the dog park enclosure and next to the parking zone, and at Bayfront Park, they are located in front of the InterContinental Hotel. Where can I park and how much does parking cost? Parking at Bayfront Park costs $20 USD and is located next to the Bayfront Park Management Trust offices. It’s open from: Monday to Sunday from 10 am to 11 pm, Owners parked after hours are subject to being towed at the owners’ expense. HOME EVENTS EXHIBITIONS Menu Toggle Jiménez Deredia in Miami Dogs & Cats Walkway and Sculptures BOARD MEETINGS Menu Item PARKS Menu Toggle BAYFRONT PARK MAURICE A. FERRÉ PARK ABOUT Menu Toggle INSTAGRAM POSTS RULES AND REGULATIONS FREQUENTLY ASKED QUESTIONS PRESS RELEASE CONTACT HOME EVENTS EXHIBITIONS Menu Toggle Jiménez Deredia in Miami Dogs & Cats Walkway and Sculptures BOARD MEETINGS Menu Item PARKS Menu Toggle BAYFRONT PARK MAURICE A. FERRÉ PARK ABOUT Menu Toggle INSTAGRAM POSTS RULES AND REGULATIONS FREQUENTLY ASKED QUESTIONS PRESS RELEASE CONTACT 301 North Biscayne Boulevard Miami, Florida 33132 305-358-7550 bayfrontparkmiami.com For more information please write to: info@bayfrontparkmiami.com Park operating hours from 7:00 am to 11:00 pm daily. Office Hours: Monday to Friday from 9:00 AM to 5:30 PM, closed on Saturdays and Sundays Unless there is a Special Event SUBSCRIBE Leave this field empty if you're human: Copyright © 2025 BAYFRONT PARK MIAMI | Powered by [FULLCO Studio] BAYFRONT PARK RULES AND REGULATIONS MAURICE A. FERRÉ PARK RULES AND REGULATIONS PARK HOURS: 7:00 a.m. to 10:00 p.m. Please keep the Park clean by not damaging the Park or its furnishings. Use of the Park and its amenities shall be used for its intended use and safely. Benches are strictly intended for sitting and NOT sleeping or laying down. Park sculptures and monuments are meant to be viewed and enjoyed. Please do not touch, sit, climb, nor deface any public art or monument. No aggressive or threatening behavior is allowed in the Park, including aggressive panhandling or soliciting. ONLY Trust authorized vehicles are allowed in the Park. No skateboarding or other motorized vehicles are allowed in the Park. No fires, hunting nor molesting wildlife are allowed in the Park. No littering or dumping personal belongings. Deposit trash in trash containers. No camping nor use of temporary structures, such as tents, chairs, hammocks or card board are allowed in the Park. No swimming, no fishing, nor solicitation without a Bayfront Park Management Trust issued permit in the Park. No Consumption of alcoholic beverages unless a special permit is obtained from Bayfront Park Management Trust. All commerce, advertising, vending, or business must be approved by Bayfront Park Management Trust. All docking, launching, or landing of a vessel requires a permit from Bayfront Park Management Trust. Any organized activity, event, or gatherings, such as photoshoots and video shoots require a permit from Bayfront Park Management Trust. No drones are allowed in the Park unless authorized by Bayfront Park Management Trust. All dogs must be on a leash and dog owners are responsible for picking up any waste, as well as any damage caused to the Park by owner’s dog. Any Park visitor found violating park rules will be removed from the premises and           enforced by Bayfront Park Security and City of Miami Police. For Permits and inquiries, please contact our Bayfront Park office: 305-358-7550 or at info@bayfrontparkmiami.com . THANK YOU FOR VISITING, COME AGAIN SOON! The above rules are detailed in Chapter 38 of the City of Miami Code; and enforced by Bayfront Park Staff, Bayfront Park Security, and City of Miami Police CLOSE STOP HUMAN TRAFFICKING CLOSE WELCOME TO MAURICE A. PARK Maurice A. Ferré Park has transformed into an open-air museum, boasting spectacular venues in close proximity to the bay, where breathtaking outdoor events take place. It offers magnificent views not only of Biscayne Bay but also the downtown Miami skyline, making it a privileged location for unforgettable gatherings. The park’s surroundings feature stunning artwork showcased along the Dogs and Cats Walkway, as well as an extraordinary area housing the Jiménez Deredia exhibition, which will be available throughout the entire year. Formerly called Museum Park, the 21-acre Maurice A. Ferré Park is home to the Peréz Art Museum Miami and the Patricia and Phillip Frost Museum of Science. Located north of AmericanAirlines Arena, this park is considered an extension of Bayfront Park. It sits right on Biscayne Bay and has an outdoor amphitheater, grassy areas, walking and biking baths and Plaza de la Marina Española (Spanish Navy Plaza), a monument that honors the Spanish Navy and its arrival in the Americas on October 12, 1492. X WELCOME TO BAYFRONT PARK Bayfront Park, originally called Royal Palm Park, is the oldest public gathering space in the Greater Miami community. Established in 1896, it started with a pavilion and green space used for sports activities. Over the years, it expanded to include a bandshell and became a venue for various events. Today, Bayfront Park spans 32 acres in Downtown Miami, offering stunning views of Biscayne Bay. It features open lawn spaces, a seaside path, sandy beach area, performance venues, VIP seating, tropical rock garden, and a historic waterfall from 1926. Discover a peaceful oasis tucked away in the heart of Miami. It’s the perfect place to relax, explore, and enjoy unhurried walks. Whether you’re having a picnic or participating in outdoor activities, this captivating park invites you, with its stunning waterfront views and expansive green spaces, to escape the bustling city and immerse yourself in the tranquility of nature. X Scroll to Top"
    },
    {
      "url": "https://bayfrontparkmiami.com/contact/",
      "text": "CONTACT – BAYFRONT PARK MIAMI Skip to content HOME EVENTS Menu Toggle PLAN YOUR VISIT PAST EVENTS BOARD MEETINGS Menu Item PARKS Menu Toggle BAYFRONT PARK MAURICE A. FERRÉ PARK ABOUT Menu Toggle HISTORY INSTAGRAM POSTS RULES AND REGULATIONS FREQUENTLY ASKED QUESTIONS PRESS RELEASE CONTACT Main Menu HOME EVENTS Menu Toggle PLAN YOUR VISIT PAST EVENTS BOARD MEETINGS Menu Item PARKS Menu Toggle BAYFRONT PARK MAURICE A. FERRÉ PARK ABOUT Menu Toggle HISTORY INSTAGRAM POSTS RULES AND REGULATIONS FREQUENTLY ASKED QUESTIONS PRESS RELEASE CONTACT Main Menu CONTACT All rental inquiries for the FPL Solar Amphitheater at Bayfront Park should be directed to Live Nation at: josephnieman@livenation.com . For all other booking information , please contact our Special Event Manager Santravia Butler at: sbutler@miamigov.com . Parks are open from 7:00 am a 10:00 pm daily. Office Hours: Monday to Friday from 9:00 AM to 5:30 PM, closed on Saturdays and Sundays Unless there is a Special Event. CONTACT All rental inquiries for the FPL Solar Amphitheater at Bayfront Park should be directed to Live Nation at josephnieman@livenation.com . For all other booking information , please contact our Events Coordinator Parks are open from 7:00 am a 10:00 pm daily. Office Hours: Monday to Friday from 8:00 AM to 6:00 PM, closed on Saturdays and Sundays Unless there is a Special Event. FOLLOW US Park Locations For more information please write to: info@bayfrontparkmiami.com For all other booking information Please contact our Special Event Manager Santravia Butler: sbutler@miamigov.comcom 305.358.7550 Park Locations For more information please write to: info@bayfrontpark.com For all other booking information Please contact our Special Event Manager Santravia Butler email: sbutler@miamigov.comcom 305.358.7550 FOLLOW US Bayfront Park Miami 301 Biscayne Blvd, Miami, FL 33132 Maurice A. Ferré Park 1075 Biscayne Blvd, Miami, FL 33132 HOME EVENTS Menu Toggle PLAN YOUR VISIT PAST EVENTS BOARD MEETINGS Menu Item PARKS Menu Toggle BAYFRONT PARK MAURICE A. FERRÉ PARK ABOUT Menu Toggle HISTORY INSTAGRAM POSTS RULES AND REGULATIONS FREQUENTLY ASKED QUESTIONS PRESS RELEASE CONTACT HOME EVENTS Menu Toggle PLAN YOUR VISIT PAST EVENTS BOARD MEETINGS Menu Item PARKS Menu Toggle BAYFRONT PARK MAURICE A. FERRÉ PARK ABOUT Menu Toggle HISTORY INSTAGRAM POSTS RULES AND REGULATIONS FREQUENTLY ASKED QUESTIONS PRESS RELEASE CONTACT 301 North Biscayne Boulevard Miami, Florida 33132 305-358-7550 bayfrontparkmiami.com For more information please write to: info@bayfrontparkmiami.com Park operating hours from 7:00 am to 11:00 pm daily. Office Hours: Monday to Friday from 9:00 AM to 5:30 PM, closed on Saturdays and Sundays Unless there is a Special Event SUBSCRIBE Leave this field empty if you're human: Copyright © 2025 BAYFRONT PARK MIAMI | Powered by [FULLCO Studio] BAYFRONT PARK RULES AND REGULATIONS MAURICE A. FERRÉ PARK RULES AND REGULATIONS PARK HOURS: 7:00 a.m. to 10:00 p.m. Please keep the Park clean by not damaging the Park or its furnishings. Use of the Park and its amenities shall be used for its intended use and safely. Benches are strictly intended for sitting and NOT sleeping or laying down. Park sculptures and monuments are meant to be viewed and enjoyed. Please do not touch, sit, climb, nor deface any public art or monument. No aggressive or threatening behavior is allowed in the Park, including aggressive panhandling or soliciting. ONLY Trust authorized vehicles are allowed in the Park. No skateboarding or other motorized vehicles are allowed in the Park. No fires, hunting nor molesting wildlife are allowed in the Park. No littering or dumping personal belongings. Deposit trash in trash containers. No camping nor use of temporary structures, such as tents, chairs, hammocks or card board are allowed in the Park. No swimming, no fishing, nor solicitation without a Bayfront Park Management Trust issued permit in the Park. No Consumption of alcoholic beverages unless a special permit is obtained from Bayfront Park Management Trust. All commerce, advertising, vending, or business must be approved by Bayfront Park Management Trust. All docking, launching, or landing of a vessel requires a permit from Bayfront Park Management Trust. Any organized activity, event, or gatherings, such as photoshoots and video shoots require a permit from Bayfront Park Management Trust. No drones are allowed in the Park unless authorized by Bayfront Park Management Trust. All dogs must be on a leash and dog owners are responsible for picking up any waste, as well as any damage caused to the Park by owner’s dog. Any Park visitor found violating park rules will be removed from the premises and           enforced by Bayfront Park Security and City of Miami Police. For Permits and inquiries, please contact our Bayfront Park office: 305-358-7550 or at info@bayfrontparkmiami.com . THANK YOU FOR VISITING, COME AGAIN SOON! The above rules are detailed in Chapter 38 of the City of Miami Code; and enforced by Bayfront Park Staff, Bayfront Park Security, and City of Miami Police CLOSE STOP HUMAN TRAFFICKING CLOSE WELCOME TO MAURICE A. PARK Maurice A. Ferré Park has transformed into an open-air museum, boasting spectacular venues in close proximity to the bay, where breathtaking outdoor events take place. It offers magnificent views not only of Biscayne Bay but also the downtown Miami skyline, making it a privileged location for unforgettable gatherings. The park’s surroundings feature stunning artwork showcased along the Dogs and Cats Walkway, as well as an extraordinary area housing the Jiménez Deredia exhibition, which will be available throughout the entire year. Formerly called Museum Park, the 21-acre Maurice A. Ferré Park is home to the Peréz Art Museum Miami and the Patricia and Phillip Frost Museum of Science. Located north of AmericanAirlines Arena, this park is considered an extension of Bayfront Park. It sits right on Biscayne Bay and has an outdoor amphitheater, grassy areas, walking and biking baths and Plaza de la Marina Española (Spanish Navy Plaza), a monument that honors the Spanish Navy and its arrival in the Americas on October 12, 1492. X WELCOME TO BAYFRONT PARK Bayfront Park, originally called Royal Palm Park, is the oldest public gathering space in the Greater Miami community. Established in 1896, it started with a pavilion and green space used for sports activities. Over the years, it expanded to include a bandshell and became a venue for various events. Today, Bayfront Park spans 32 acres in Downtown Miami, offering stunning views of Biscayne Bay. It features open lawn spaces, a seaside path, sandy beach area, performance venues, VIP seating, tropical rock garden, and a historic waterfall from 1926. Discover a peaceful oasis tucked away in the heart of Miami. It’s the perfect place to relax, explore, and enjoy unhurried walks. Whether you’re having a picnic or participating in outdoor activities, this captivating park invites you, with its stunning waterfront views and expansive green spaces, to escape the bustling city and immerse yourself in the tranquility of nature. X Scroll to Top"
    },
    {
      "url": "https://bayfrontparkmiami.com/bayfront-park-2/",
      "text": "HOME – BAYFRONT PARK MIAMI Skip to content HOME EVENTS Menu Toggle PLAN YOUR VISIT PAST EVENTS BOARD MEETINGS Menu Item PARKS Menu Toggle BAYFRONT PARK MAURICE A. FERRÉ PARK ABOUT Menu Toggle HISTORY INSTAGRAM POSTS RULES AND REGULATIONS FREQUENTLY ASKED QUESTIONS PRESS RELEASE CONTACT Main Menu HOME EVENTS Menu Toggle PLAN YOUR VISIT PAST EVENTS BOARD MEETINGS Menu Item PARKS Menu Toggle BAYFRONT PARK MAURICE A. FERRÉ PARK ABOUT Menu Toggle HISTORY INSTAGRAM POSTS RULES AND REGULATIONS FREQUENTLY ASKED QUESTIONS PRESS RELEASE CONTACT Main Menu WELCOME TO BAYFRONT PARK MIAMI Welcome to the Park Bayfront Park, originally called Royal Palm Park, is the oldest public gathering space in the Greater Miami community. Established in 1896, it started with a pavilion and green space used for sports activities. Over the years, it expanded to include a bandshell and became a venue for various events. Today, Bayfront Park spans 32 acres in Downtown Miami, offering stunning views of Biscayne Bay. It features open lawn spaces, a seaside path, sandy beach area, performance venues, VIP seating, tropical rock garden, and a historic waterfall from 1926. READ MORE Welcome to the Park Bayfront Park, originally called Royal Palm Park, is the oldest public gathering space in the Greater Miami community. Established in 1896, it started with a pavilion and green space used for sports activities. Over the years, it expanded to include a bandshell and became a venue for various events. Today, Bayfront Park spans 32 acres in Downtown Miami, offering stunning views of Biscayne Bay. It features open lawn spaces, a seaside path, sandy beach area, performance venues, VIP seating, tropical rock garden, and a historic waterfall from 1926. READ MORE UPCOMING EVENTS Looking for an exciting activity today, tonight, or this weekend? Look no further than Bayfront Park and Maurice A Ferré Park, where you can always find something enjoyable for you and your family. From outdoor concerts to free Yoga classes and holiday parties, there’s a variety of entertaining events to choose from. Make sure to check back regularly as we continually update our offerings. Get ready for a fantastic and memorable experience! For all other booking information Please contact our Special Event Manager Santravia Butler at: sbutler@miamigov.com 09 September Bayfront Park Free Yoga Via Zoom Evento recurrente 301 Biscayne Blvd, Miami, FL 33132 Facebook Twitter Linkedin Email View Detail 10 September Bayfront Park Yoga Classes by Donation Evento recurrente 301 Biscayne Blvd, Miami, FL 33132 Facebook Twitter Linkedin Email View Detail No event found! Introducing Our New Initiative : Bayfront Park Newsletter! SUBSCRIBE Leave this field empty if you're human: UPCOMING EVENTS Looking for something to do today, tonight, this weekend? at Bayfront Park and Maurice A Ferré Park you can always find something fun for you or the whole family. Outdoor concerts, free Yoga classes, holiday parties and more. Check in often as we are adding new events. For all other booking information Please contact our Special Event Manager Santravia Butler at: sbutler@miamigov.com 09 September Bayfront Park Free Yoga Via Zoom Evento recurrente 301 Biscayne Blvd, Miami, FL 33132 Facebook Twitter Linkedin Email View Detail 10 September Bayfront Park Yoga Classes by Donation Evento recurrente 301 Biscayne Blvd, Miami, FL 33132 Facebook Twitter Linkedin Email View Detail No event found! THE PLACES FPL Solar Amphitheater at Bayfront Park is located within Bayfront Park and is managed and operated by Live Nation. It reopened in August of 2009 after a multi-million dollar renovation that included permanent reserved seats; new, picturesque sightlines to Biscayne Bay; a new superior roof structure; state-of-the-art production capabilities; VIP boxes with table service and VIP parking; permanent, new restroom facilities; expanded concessions, and more. In 2020, the new FPL Solar Amphitheater at Bayfront Park was completed, which has 500 solar panels. The canopy-like solar structure covers nearly 400 feet of walkway around the venue. The Bayfront Park Amphitheater has been renamed the FPL Solar Amphitheater at Bayfront Park. The solar panels double as a research facility and showcase Miami’s commitment to sustainability. Also included in the 500-panel solar installation are seven solar trees located around the park. The solar canopy and trees feature LED lighting that illuminate the venue at night and can be programmed to change colors to coincide with special events. The Bayfront Park Amphitheater is framed within the majesty and beauty of Miami's Central Park, it can hold up to ten thousand people, with 2500 fixed seats and an additional 7300 on the lawn. Get ready to be captivated by world-class performances in a truly exceptional setting! FPL solar AMPHITHEATER Discover the charming playground located at the southern end of the park, right next to the Tina Hills Pavilion. Hours: Daily from Sunrise to Sundown Adults are only allowed in the play area when accompanied by children under 12. The Lee & Tina Hills features the latest in playground design, including rubber safety surfacing, and a unique play sculpture. In addition, there are benches and trash receptacles adjacent to the playground. The “play sculpture,” crafted by Cemrock Landscapes, Inc., depicts a rising wave and features a dolphin, a turtle, and a manatee. This “made to order” sculpture was created to showcase the marine animals typical to the waters of Miami. The sculpture is suitable for children ages 5-12 Play scultpture featuring manatee and a turtle “play sculpture,” crafted by Cemrock Landscapes, Inc., depicts a rising wave and features a dolphin, a turtle, and a manatee. In addition, some of the playground features include a pirate ship, bouncers, and a “supermax” structure which includes slides and several climbing apparatuses.Playground slide and climbing Playground climbing net Playground pirate ship. Explore this amazing playground and create long lasting memories. The LEe & TINA HILLS playground The The Tina Hills Pavilion, located within the park, is a versatile venue for a range of events. With a capacity of 1,000, it accommodates intimate concerts, receptions, corporate functions, and press conferences. The pavilion offers fixed seating for 200 guests and lawn seating for 800, providing flexible arrangements. Its open-air design allows for a captivating experience, whether facing the stage or enjoying the picturesque views of Biscayne Bay. Discover this exceptional venue for your next gathering or performance, and create memorable moments for the whole family. Pavillion TINA HILLS MEET THE PARK MEET THE PARK HOME EVENTS Menu Toggle PLAN YOUR VISIT PAST EVENTS BOARD MEETINGS Menu Item PARKS Menu Toggle BAYFRONT PARK MAURICE A. FERRÉ PARK ABOUT Menu Toggle HISTORY INSTAGRAM POSTS RULES AND REGULATIONS FREQUENTLY ASKED QUESTIONS PRESS RELEASE CONTACT HOME EVENTS Menu Toggle PLAN YOUR VISIT PAST EVENTS BOARD MEETINGS Menu Item PARKS Menu Toggle BAYFRONT PARK MAURICE A. FERRÉ PARK ABOUT Menu Toggle HISTORY INSTAGRAM POSTS RULES AND REGULATIONS FREQUENTLY ASKED QUESTIONS PRESS RELEASE CONTACT 301 North Biscayne Boulevard Miami, Florida 33132 305-358-7550 bayfrontparkmiami.com For more information please write to: info@bayfrontparkmiami.com Park operating hours from 7:00 am to 11:00 pm daily. Office Hours: Monday to Friday from 9:00 AM to 5:30 PM, closed on Saturdays and Sundays Unless there is a Special Event SUBSCRIBE Leave this field empty if you're human: Copyright © 2025 BAYFRONT PARK MIAMI | Powered by [FULLCO Studio] BAYFRONT PARK RULES AND REGULATIONS MAURICE A. FERRÉ PARK RULES AND REGULATIONS PARK HOURS: 7:00 a.m. to 10:00 p.m. Please keep the Park clean by not damaging the Park or its furnishings. Use of the Park and its amenities shall be used for its intended use and safely. Benches are strictly intended for sitting and NOT sleeping or laying down. Park sculptures and monuments are meant to be viewed and enjoyed. Please do not touch, sit, climb, nor deface any public art or monument. No aggressive or threatening behavior is allowed in the Park, including aggressive panhandling or soliciting. ONLY Trust authorized vehicles are allowed in the Park. No skateboarding or other motorized vehicles are allowed in the Park. No fires, hunting nor molesting wildlife are allowed in the Park. No littering or dumping personal belongings. Deposit trash in trash containers. No camping nor use of temporary structures, such as tents, chairs, hammocks or card board are allowed in the Park. No swimming, no fishing, nor solicitation without a Bayfront Park Management Trust issued permit in the Park. No Consumption of alcoholic beverages unless a special permit is obtained from Bayfront Park Management Trust. All commerce, advertising, vending, or business must be approved by Bayfront Park Management Trust. All docking, launching, or landing of a vessel requires a permit from Bayfront Park Management Trust. Any organized activity, event, or gatherings, such as photoshoots and video shoots require a permit from Bayfront Park Management Trust. No drones are allowed in the Park unless authorized by Bayfront Park Management Trust. All dogs must be on a leash and dog owners are responsible for picking up any waste, as well as any damage caused to the Park by owner’s dog. Any Park visitor found violating park rules will be removed from the premises and           enforced by Bayfront Park Security and City of Miami Police. For Permits and inquiries, please contact our Bayfront Park office: 305-358-7550 or at info@bayfrontparkmiami.com . THANK YOU FOR VISITING, COME AGAIN SOON! The above rules are detailed in Chapter 38 of the City of Miami Code; and enforced by Bayfront Park Staff, Bayfront Park Security, and City of Miami Police CLOSE STOP HUMAN TRAFFICKING CLOSE WELCOME TO MAURICE A. PARK Maurice A. Ferré Park has transformed into an open-air museum, boasting spectacular venues in close proximity to the bay, where breathtaking outdoor events take place. It offers magnificent views not only of Biscayne Bay but also the downtown Miami skyline, making it a privileged location for unforgettable gatherings. The park’s surroundings feature stunning artwork showcased along the Dogs and Cats Walkway, as well as an extraordinary area housing the Jiménez Deredia exhibition, which will be available throughout the entire year. Formerly called Museum Park, the 21-acre Maurice A. Ferré Park is home to the Peréz Art Museum Miami and the Patricia and Phillip Frost Museum of Science. Located north of AmericanAirlines Arena, this park is considered an extension of Bayfront Park. It sits right on Biscayne Bay and has an outdoor amphitheater, grassy areas, walking and biking baths and Plaza de la Marina Española (Spanish Navy Plaza), a monument that honors the Spanish Navy and its arrival in the Americas on October 12, 1492. X WELCOME TO BAYFRONT PARK Bayfront Park, originally called Royal Palm Park, is the oldest public gathering space in the Greater Miami community. Established in 1896, it started with a pavilion and green space used for sports activities. Over the years, it expanded to include a bandshell and became a venue for various events. Today, Bayfront Park spans 32 acres in Downtown Miami, offering stunning views of Biscayne Bay. It features open lawn spaces, a seaside path, sandy beach area, performance venues, VIP seating, tropical rock garden, and a historic waterfall from 1926. Discover a peaceful oasis tucked away in the heart of Miami. It’s the perfect place to relax, explore, and enjoy unhurried walks. Whether you’re having a picnic or participating in outdoor activities, this captivating park invites you, with its stunning waterfront views and expansive green spaces, to escape the bustling city and immerse yourself in the tranquility of nature. X Scroll to Top"
    },
    {
      "url": "https://bcparksfoundation.ca/us/",
      "text": "Who We Are | BC Parks Foundation BC Parks Foundation Home Why Us What You Supporters Blog Give Shop Who We Are BC Parks Foundation Reports Strategic Plan 2024-2030 ERROR: An iframe should be displayed here but your browser version does not support iframes. Please update your browser to its most recent version and try again. Click here to download the report. BCPF Annual Report 2024/2025 ERROR: An iframe should be displayed here but your browser version does not support iframes. Please update your browser to its most recent version and try again. Click here to download the report. BCPF Annual Report 2023/2024 ERROR: An iframe should be displayed here but your browser version does not support iframes. Please update your browser to its most recent version and try again. Click here to download the report. BCPF Annual Report 2022/2023 ERROR: An iframe should be displayed here but your browser version does not support iframes. Please update your browser to its most recent version and try again. Click here to download the report. BCPF Annual Report 2021/2022 ERROR: An iframe should be displayed here but your browser version does not support iframes. Please update your browser to its most recent version and try again. Click here to download the report. BCPF Annual Report 2020/2021 ERROR: An iframe should be displayed here but your browser version does not support iframes. Please update your browser to its most recent version and try again. Click here to download the report. Board Warren Beach Board Treasurer, Chair of Finance and Audit Committee Warren graduated from UBC in 1989 with a BA in Political Science and was a member of the Men’s Varsity Rowing Team throughout his time there. After graduating, he went on to earn his Chartered Accountant designation with Ernst and Young in Vancouver. His career has spanned a number of industries and he has served as CFO of Sierra Systems Group, TimberWest and Aritzia. He then went on to serve as CEO of Hold It All Inc., the holding company of Chip Wilson (founder of Lululemon) and as the President & CEO of Augusta Capital Corporation. He is currently the Chief Strategy and Innovation Officer at Odlum Brown. Warren has completed executive education at Harvard University and has obtained the ICD.D designation for Corporate Board Governance at the University of Toronto Rotman School of Management. Warren is a member of the UBC Alumni Advisory Council, and he serves on the Finance & Audit Committee of Alumni UBC. He is a member of the UBC “Gold of Life” Committee supporting rowing at the University of British Columbia. Warren is also a member of the Cabinet of the Business Laureates of B.C. Hall of Fame and is a mentor/coach with the Forum for Women Entrepreneurs. Previously, Warren served for six years as Vice-Chair of the Board of the BC Woman’s Health Foundation. He served for over ten years as a Foundation Director of the Boys and Girls Clubs Foundation of Southcoast BC and served for seven years on the Cabinet of the United Way, including acting as Cabinet Co-Chair in 2011/12. In 2022, Warren was awarded the Fellow Chartered Accountant (FCPA, FCA) designation by his peers in recognition of his professional and community contributions. In 2024, Warren was inducted into the UBC Sports Hall of Fame in the “Builder” category along with his peers on the UBC Gold For Life Committee. Warren is a member of the Lotus Cycling Team based in Vancouver. Ross Beaty Board Chair,  Chair of Executive and Strategy Committee Ross is a geologist and resource entrepreneur with over 45 years of experience in the international minerals and renewable energy industries. A graduate of the University of BC in geology and law and Imperial College in geology, Ross is an internationally recognized leader in both non-renewable and renewable resource development. He has founded and divested a number of companies and remains founder and chairman of Pan American Silver Corp., one of the world’s leading silver producers, and founder and chairman of Alterra Power Corp., a mid-sized renewable energy company with solar, wind, hydro and geothermal power operations in BC, Texas, Indiana and Iceland. Ross is also a well-known environmental philanthropist, primarily through The Sitka Foundation. He serves on the advisory board of the Nature Trust of BC, is a director of The Pacific Salmon Foundation, a director of Panthera, and is patron of the Beaty Biodiversity Center at the University of British Columbia. Barbara Brink Board Member Barbara is a Member of the Order of Canada and the Order of British Columbia. She was the founder, chair, CEO and driving force behind the creation of Science World in Vancouver, and currently sits on the boards of Junior Achievement of BC and Architectural Institute of BC. She previously founded and chaired the West Vancouver Community Centres Society. Barbara also serves as co-chair of the Business Laureates of BC Hall of Fame Cabinet. Thanks to her leadership, the gala remains in the top three list of events in BC and has raised more than $10 million since its inception. Barbara has also chaired the VGH and UBC Hospital Foundation, was two-year chair of the United Way Campaign, founder of Leadership Vancouver, and vice chair of the Laurier Institution. She was on the board of Legal Services Society and the West Vancouver Police Board, and is a consultant in governance and in resource development. In 2014, Barbara received the Business in Vancouver Influential Women in Business Lifetime Achievement Award. Cynthia Callison Board Vice Chair and Chair of Conservation Fund Committee Cynthia is a founding partner of Callison & Hanna Law Firm.  She has been a leading negotiator in agreements between Indigenous peoples, governments, and resource developers. She is a graduate of the Sauder School of Business and the Allard School of Law at UBC and she received a Masters in Constitutional Law from Osgoode Hall Law School. She is a well regarded public speaker and an invited presenter at global dialogues on Indigenous peoples. She currently serves on a number of boards which provide leadership for revitalizing Indigenous well-being. Cynthia is a member of the Tahltan Nation whose territory is the Stikine River Watershed in northwestern BC. Ric Careless Emeritus For over almost 50 years, Ric has been a passionate advocate for British Columbia’s world class parks and wilderness. During this time, he led citizen campaigns that have protected four million hectares across British Columbia including: the Spatsizi – Stikine, Purcell Mountains, Babine Mountains, Height of the Rockies, Tatshenshini, Chilcotin Mountains, Cathedral-Snowy and Nitinat Triangle in Pacific Rim National Park. Ric co-founded the Sierra Club of British Columbia in 1970, as well as the BC Wilderness Tourism Association in the 1990’s. Since 1989, he has served as the executive director of BC Spaces for Nature. Ric is the chair of the campaign for BC Parks, a multi-organizational alliance concerned with improving the resourcing of our province’s park system, and is also president of the BC Parks Elders Society. His consulting company, Ethos Environmental, has specialized on wilderness conservation and ecotourism policy formulation and strategy. For this lifetime of work, Ric has received numerous awards in Canada, the US and BC, where he is a recipient of the Order of British Columbia. Linda Coady Board Member Linda Coady is an experienced leader on sustainable development challenges in Canada with a track record of working with diverse groups to advance new solutions. Most recently, she served as President and CEO of the BC Council of Forest Industries (COFI), a trade association that engages with government, First Nations, and others on policies and partnerships for a sustainable forest industry in BC. Prior to that, she was Executive Director of the Pembina Institute, a leading Alberta-based think tank on innovation in public policy and business strategy that can accelerate GHG emissions reduction. Linda has held positions in the public, private, and non-profit sectors. Her past roles include Chief Sustainability Officer at Enbridge Inc., Vice-President of Sustainability for the Vancouver 2010 Olympic Games, and Vice-President for the Pacific Region at WWF-Canada. She also served as Vice-President of Environmental Affairs for the BC operations of forestry companies Weyerhaeuser and MacMillan Bloedel. Linda has contributed her expertise on sustainability as a member of advisory groups to municipal, provincial, and federal governments. She currently serves on British Columbia’s Climate Solutions Council and Softwood Lumber Advisory Council . Jessica Hopkins Chair of Protected Areas Committee Jessica is a member of the Sekw’el’was community, which is part of the St’at’imc Nation. She is the General Manager at Splitrock Environmental Consulting. Jessica attended Nicola Valley Institute of Technology and Vancouver Island University, specializing in fisheries and aquaculture science. She also has a certificate in Environmental Monitoring. Jessica loves being an integral part of her community and when she is not working she can be found spending time with friends and family or planning her next exciting adventure. Daniel Johnston Board Secretary, Chair of Governance and Human Resources Committee A lawyer by profession, Dan is a conflict prevention and resolution specialist who deals with a wide range of complex, multi-party, aboriginal, commercial, environmental, land use and public policy issues. Examples of Dan’s mediation work include many of British Columbia’s CORE and LRMP land use processes, the Whitehorse Mining Initiative, the Canadian Roundtable on Corporate Social Responsibility and the Canadian Extractive Industries Operating in Developing Countries, the Great Bear Rainforest (over a seventeen year period), BC Hydro’s Energy Efficiency and Conservation Committee, the Canadian Boreal Forest Agreement, numerous issues associated with fin-fish aquaculture in BC, the British Columbia Climate Leadership Team, and the discussions between a number of oil sands companies and environmental organizations that led to their mutual support of the 2016 Alberta Climate Leadership Plan. He is also a founding member and director of the COCO Cafe, an award winning social enterprise established to create skills training, employment and socialization opportunities for persons with developmental disabilities, and a director of the Nanaimo Association for Community Living. Rudy Kerklaan Board Member Rudy has more than three decades of experience in the investment industry. He was a fixed income portfolio manager for many years as well as a founding partner of Connor, Clark & Lunn Investment Management in 1982. Rudy helped start up CC&L Private Capital in 1997, serving on the company’s management committee and the board of directors for many years. A graduate of Concordia University with an MBA, he also served as a Western Canada’s ambassador for Concordia’s $250 million Capital Campaign. Rudy is a CFA charterholder and served as the President Vancouver Society of Financial Analysts. Rudy takes an active involvement in his community and in particular with United Way, holding many volunteer roles with the organization since 1997 including account Chair of Major Gifts, Co-Chair of the UWLM Annual Campaign and Board Member. In 2022, Rudy became Board Chair of United Way British Columbia and is currently Past Chair and member of the Governance Committee. In 2015 Rudy was proud to receive the Joseph and Rosalie Segal United Way Community Vision Award, which recognizes commitment to the betterment of the community through leadership and support of United Way. In 2023, he joined the Board of United Way Centraide and is a member of the Finance & Audit Committee. Rudy is also an active member of the United Church Community serving as Chair of Finance and on the Board of Trustees of his congregation. He is currently a Co-Chair of the Forward First Capital Campaign, a major re-development project that will serve the Indigenous and Downtown Eastside communities. In 2023, Rudy joined the Board of the Vancouver School of Theology Foundation and is a member of the Investment Advisory Committee. After celebrating his 40th wedding anniversary with his wife Elizabeth, 2 daughters Emily, Heather and their partners, and grandkids; Rudy recently retired from Connor, Clark & Lunn Private Capital Ltd. as Vice Chairman. Both Emily and Heather are also active supporters of the United Way with Heather currently serving on the United Way Gen-X committee. Tamara Little Board Member Tamara brings 20+ years’ experience in corporate communications, public affairs and government relations to her clients, including eight years at Canada’s top two public relations and public affairs firms where she was a Director and Vice President. Before that she spent eleven years in public service advising Ministers and Mayors in B.C. municipal and provincial governments. Tamara’s main interest is how to bring an integrated set of solutions to help clients communicate with audiences and achieve broad support and build profile and reputation. She is an expert in issues management and crisis communications, in which she frequently trains clients. As a trained social scientist (Anthropologist), Tamara is committed to using research and insights on which to base programs. Tamara’s clients have included some of B.C.'s largest companies and organizations, including marine shippers, terminals and ports, business associations, regulated utilities, energy sector, including renewables, natural gas and LNG projects and associations, forestry and mining companies, associations, universities, transportation organizations, municipal governments, Indigenous Governments, not-for-profits and others. Tamara spent seven years in B.C. Government communications, in Manager and Director roles, leading all communications for the Ministries of Energy Mines and Petroleum Resources, Transportation and the Treaty Negotiations Office. She also served as communications, government relations and marketing director for Partnerships BC, the provincially-owned company responsible for public capital project procurement. Before that she ran a B.C.-wide consultation program for the Legislature on treaty negotiations, and spent four years advising Mayors and City Managers on Aboriginal relations and treaty negotiations. Tamara has honours Undergraduate and Master’s Degrees in Anthropology from UBC, focused on BC Indigenous Nations. Tamara grew up in small-town B.C. in Penticton, and lives in East Vancouver with her husband and son. She is an avid creator, including painting, sewing and calligraphy and loves to read. She has a passion for community volunteering and governance. She is the former Chair of the Kettle Friendship Society Board , a mental health care and housing organization; the former Chair of the Kitsilano Neighbourhood House as well as its Fundraising Committee; the former chair of the Public Affairs Association of Canada BC Chapter and is a member of the Greater Vancouver Board of Trade . She is trained in public engagement and consultation through the International Association of Public Participation (IAP2) . Greg Moore Special Advisor Greg currently serves as a consultant and advisor to parks, public lands, and conservation efforts in the United States and globally. Recent consulting assignments include the Appalachian Trail Conservancy, the Chesapeake Bay Conservancy, Amigos de los Parques in Patagonia, Chile, and the International Landscape Conservation Network (ILCN). Through the ILCN, he is advising landscape conservation projects in Europe, China, and Canada. Greg was the founder and longtime President & CEO of the Golden Gate National Parks Conservancy. During his more than three decades of leadership, the Conservancy grew to become one of the most successful, innovative, and accomplished nonprofit support organizations to any national park in the United States. The Conservancy is recognized for its accomplishments in park design, cross sector partnerships, large scale conservation efforts, environmental philanthropy, community engagement, and public support. Under Greg’s leadership, the Conservancy provided more than $750 million in support to park projects and programs at the Golden Gate National Parks –and supported over 25,000 volunteers annually. During his tenure, the Conservancy received numerous awards for excellence in interpretation, conservation, youth programs, philanthropic and park improvement efforts. Greg has served as an advisor to national parks and public land efforts throughout the United States – including well-known locations such as Yosemite, Grand Canyon, and more. He has worked on international assignments as an advisor to conservation and park projects in in Australia, Chile, China, Italy, New Zealand, Canada, and South Africa. Greg holds a B.S. in Conservation of Natural Resources from U.C. Berkeley with a minor in Landscape Architecture and completed a Mid-career Fellowship in Environmental Planning at the University of Washington. He currently serves on the board of the Conservation Lands Foundation, on the Advisory Board of Amigos de los Parques in Patagonia, Chile and as an advisor to the BC Parks Foundation. Jim Standen Board Member Jim was appointed the assistant deputy minister of BC Parks & Conservation Officer Service on October 14th, 2014. Previous to this, Jim was the assistant deputy minister of Environmental Protection Division for four years. Jim started his career in government as an auxiliary fisheries technician in Kamloops in 1992. Since then, he has held positions in environmental stewardship, planning and assessment, environmental protection, strategic policy and water management. Prior to becoming ADM, Jim was director of the Regional Operations Branch for the Environmental Protection Division and chair of the Coast Region Interagency Directors Committee. During his 25-year career with the Ministry of Environment, he has had the opportunity to develop a broad knowledge of the business of the ministry and expertise in strategic planning, financial management and legislation and policy development. Jim has a Bachelor of Science in Biology from the University of British Columbia, and studied accounting/business at UBC and Thompson Rivers University. Jim was a trustee on the Saanich Board of Education from 2005-2014. He was vice chair of the board from 2011 through 2014, and chaired the Finance and Facilities Committee, Policy Committee and Human Resources Committee at various times. Jim was also a member of the Capital Regional District Roundtable on the Environment and Economy from 2001- 2003. Jim shares a home in North Saanich with his wife, Penny, and kids Conor, Stephanie and Maddy. Terry Teegee Board Member Terry Teegee's ancestry is Dakelh, Gitxsan, and Sekani and he is a member of the Takla First Nation. He is the elected regional chief of the British Columbia Assembly of First Nations (AFN) serving his third term. He is passionate about nature and indigenous protected and conserved areas, serving as the AFN Representative on the United Nations Convention on Biodiversity. With a Bachelor of Science Degree in Natural Resources Management and a diploma in Natural Resources Technology, Terry has been deeply involved in natural resources and related policies throughout his career. Regional Chief Teegee also chairs the AFN's United Nations Declaration on the Rights of Indigenous Peoples Implementation Committee and was instrumental in the development and historic passing of the Declaration on the Rights of Indigenous Peoples Act in BC. Ivan Thompson Chair of Fundraising and Communications Committee Ivan evolved a passion for the people and places of British Columbia’s wild salmon ecosystem into his life’s primary work. By fortunate accident, in 1981 he came to live in the mighty Skeena watershed. Had he been able to find his first teaching job further south, he probably would have taken it. Instead, he moved to a village on the wilderness shores of Lake Babine. Over the next two decades, he fell more and more deeply in love with the area as he explored much of the Skeena, the Stikine and the North Coast while working as a teacher, outdoor instructor, counsellor, and college director. Ivan engaged with northern BC communities in the land use planning initiatives of the nineties that led to a doubling of the BC’s protected areas network, and later with North Coast indigenous communities in accessing conservation financing to enable their environmental and economic visions for the Great Bear Rainforest. For most of the past two decades, he has helped guide philanthropic foundations in investing in protection of healthy lands and waters as the heart of life and livelihoods in BC. Ivan worked as program officer with the Gordon and Betty Moore Foundation from 2007 to 2017 and then as senior advisor with MakeWay’s Pacific Salmon Watershed’s Fund until 2022. He continues to advise and facilitate relationships amongst philanthropic, government, indigenous and NGO leaders through his roles of practitioner fellow at the University of Victoria’s Centre for Global Studies and of trustee with the boards of the BC Parks Foundation and the Portland-based Wild Salmon Centre. Gill Winckler Board Member Gill grew up in South Africa where she graduated with a bachelor of science degree and then went on to become a Chartered Accountant. She is an avid outdoor enthusiast, often walking and biking in the local forests, kayaking and having outdoor picnics and barbeques. She has been a director of the Trans Canada Trail board since 2018, and is aiming to cycle the whole trail across the country. Gill worked initially in the auditing profession and in corporate finance in South Africa and London, UK. She spent 16 years with the mining company BHP Billiton in London, moving with them to Vancouver in 2009. Her 20 years in mining saw her involved with corporate and divisional strategy, mergers and acquisitions, divestments, exploration as well as project evaluation and development. Gill is a director of Pan American Silver Corp., West Fraser Timber Ltd and FLSmidth & Co. A/S. Track Record Our board members and staff bring extensive experience and a proven capacity for large-scale impact. Since 2018, your generosity and support for BC Parks Foundation has created lasting change in the landscapes that British Columbians love. Together, we've: Protected beautiful places that boost health, protect wildlife and their habitat, store carbon, help prevent drought and flooding, and provide recreation and cultural benefits. Launched Canada's first National Park Prescription program with healthcare professionals across Canada. Launched the Discover Parks Ambassador program providing youth-led programming and engagement to park visitors in BC's parks. Inspired British Columbians to reach over 30 million observations of nature. Launched Learning By Nature with school districts across BC, so that kids can be healthy and improve learning outcomes through increased greenspace on school grounds. Together, our board members and staff have successfully created and managed companies valued at over $5 billion, held senior leadership roles in government agencies, and played pivotal roles in landmark conservation efforts such as the Great Bear Rainforest Agreement, the Canadian Boreal Forest Agreement, the Wild Salmon Policy, and the BC Climate Leadership Team. Additionally, they’ve led campaigns resulting in the creation of over four million hectares of parks in British Columbia, demonstrating their commitment and expertise in achieving ambitious conservation goals. The Foundation's Annual Report can be downloaded here . For copies of previous reports, please email info@bcparksfoundation.ca . The Foundation retains an auditor for its financial statements. Champions Robert Bateman Founding Member & Champion In many ways parks have made me who I am. As an Ontario boy, I thought of Algonquin Park as a kind of Nirvana. It denoted wilderness and nature in a pure form. Wolves roamed there. When I landed a job, ages 17-19, doing “chores” at the research station, I thought I’d died and gone to heaven. It also became apparent that the people who worked in parks, the rangers and naturalists, were an important part of the scene. They appreciate and protect nature for others to enjoy. These people became my role models. BC parks are among the most spectacular in the world because this province is blessed with a great variety of natural habitats from mountains to marine. We need to use them or lose them but at the same time we must not love them to death with too many amenities. It will take vigilance and budgets to guarantee that our parks will be as beneficial to future generations as they are to us. Wade Davis My life took a turn at 15 when I spent a summer in Manning Park, working as a member of the Youth Crew, building trails, fighting fires, maintaining the campgrounds. Splitting firewood in the sun, with room and board and three dollars a day the only financial reward, taught me that work is not about money; it's about pride, strength, perseverance and grit, values that would forge the foundation of my professional life. Altogether, I worked eight seasons for BC Parks, culminating in a much coveted position as the first park ranger in the Spatsizi Plateau, British Columbia's largest wilderness park. My job description was deliciously vague; public relations and wilderness assessment. In two four month seasons my partner and I encountered not a dozen visitors, leaving us free to wander, as we mapped the trails, surveyed the wildlife, ran the rivers, and established routes up all the major peaks. This prolonged apprenticeship with the Parks, all that I learned in E.C. Manning and Naikoon, Mount Assiniboine, Atlin Mountain, Mount Edziza, and Spatsizi Plateau, left me with both a deep appreciation of nature, and a profound sense of belonging, a spirit of place that is the essence of Canadian patriotism. In good measure, I owe my life and career to BC Parks. Surely the opportunities that I had in my youth, the chance to unburden an adolescent mind and reward the body with hard physical work, to experience for the first time the true miracle of nature, to seek the promise of transformation, even transcendence, as found only in the wild heart of the world, ought to be part of the birthright of every new generation of British Columbians. Ben Haggar Freelance photographer, writer, and content creator Spending time recreating in nature was a keystone of my upbringing and set me on a path to appreciate and help to protect wild places. Connecting with nature allows me to feel centred and balanced within myself. When I moved to BC from Ontario at age 19, I was overwhelmed at the scale of the fog cloaked mountains, old growth cedars, and cold green waves rolling in towards pristine beaches. With so much incredible diversity, I couldn’t believe that the entire province wasn’t one huge provincial park! I feel incredibly lucky for the recreational opportunities here in BC. From surfing Naikoon in Haida Gwaii, bikepacking the South Chilcotins, ski touring at Kokanee, and climbing the Squamish Chief and Garibaldi from my front door. It gives me real peace of mind knowing that these special areas are protected and that there is an endless supply of new discoveries and experiences to be had right here at home in BC. Greg Hill Skier, film maker, climber, and sustainable adventurer Many of my most memorable moments were in the parks in British Columbia. I have savored my freedom moving through the mountains, contemplated life surrounded by giant cedars and finished days watching the sun set into the Pacific Ocean. These parks are the identity of BC and need to be protected and preserved for our kids and theirs, while also enjoyed by us. John Montalbano My family did not have very many luxuries. Growing up as a child in East Vancouver, our weekend family time was exploring the numerous parks to the north and east of Vancouver. Free access to parks was essential for my parents to entertain and educate my sister and me. I love our parks to this day. Dr. Sally Otto From Ruckle Provincial Park in the Garry oak ecosystem to the glacier-fed lakes of Mount Assiniboine, the parks of British Columbia are truly majestic. Camping in these parks allows families, like mine, to experience nature directly and to pass along to our children a love of wildlife. The parks are also a critical refuge for the most endangered animals and plants. BC is home to the most species diversity of any province in Canada but also home to the most species at risk. Without well managed parks, we are likely to lose dozens, if not hundreds, of the animal and plant species that make BC so special. Eric Peterson Founding Member and Champion I was born in Port Alberni and grew up on Vancouver Island. That was the era when family vacations meant packing the camping gear into the trunk of the Buick and heading off down one BC's brand new highways. It was pure exploration and discovery - the Cariboo, the Slocan Valley, the Big Bend highway, the Chilcotin - exploring the wonders of the province by day, and pulling in for the night at a BC Parks campground. Those experiences kindled my love of exploration and new vistas, which took me around the world as a scientist (biology PhD) then later as a technology entrepreneur. I founded the BC-based Tula Foundation in 2002 and set up Tula’s Hakai Institute in 2010. Hakai develops the tools, systems, people and insights we need to understand our coastal ecosystems in the context of climate change, and to deal with the consequences that are coming. We operate field stations at remote locations on the BC coast. We have our own scientific staff plus a large network that includes university researchers, government scientists and First Nations. For the past eight years we have enjoyed a very close and productive partnership with BC Parks via our Calvert Island field station, which is located in the heart of the Great Bear Rainforest. Strategic Advisors Miro Ceretnig Yee Chan Bob Kronbauer Garry Mancell Roy Millen “ BC's parks are our pride and joy, naturally. ” Darcy Dobell, board member Subscribe to our newsletter today. Links Newsletter Careers Donate Blog Press Room Contact Photo Credits Privacy Policy Shop © BC Parks Foundation 2025 Accept cookies This website uses cookies to ensure you get the best experience on our website"
    },
    {
      "url": "https://www.duluthnewstribune.com/news/local/new-manager-proposed-for-duluths-bayfront-festival-park-venue",
      "text": "New manager proposed for Duluth's Bayfront Festival Park venue - Duluth News Tribune | News, weather, and sports from Duluth, Minnesota $2 for 6 months SUBSCRIBE NOW Read Today's Paper Thursday, September 11 🏆Best of the Best winners 🗞️Advertise with us 🚢Edmund Fitzgerald 🔍Explore DNT archives Advertise With Us Digital Advertising Print Advertising Printing Services TV Advertising Video Services Place a Public Notice Get Our Advertising Newsletter Sponsored Content News Local Minnesota Wisconsin National World The Vault Agweek Forum News Network Weather Sports Prep Prep standings College Bulldogs Hockey Pro Northland Outdoors Obituaries Health Business Business Announcements Opinion Editorials Columns Letters Cartoons Lifestyle Arts / Entertainment Home / Garden Astro Bob Comics Free Games Community Milestones Calendar Contests Announcements From The Archives Bygones Archives FAQ Podcasts Listings Classifieds Public Notices JobsHQ Local Interest The Woman Today 20 Under 40 Account FCC Network Profile Newsletters Help Subscriber Benefits Sections $2 for 6 months SUBSCRIBE NOW Log in Account $2 for 6 months SUBSCRIBE NOW Sponsored By Sponsored By An organization or individual has paid for the creation of this work but did not approve or review it. ADVERTISEMENT ADVERTISEMENT News Local New manager proposed for Duluth's Bayfront Festival Park venue After one year under private management, the popular outdoor event space could return to the control of the Duluth Entertainment Convention Center. A sold-out crowd fills the area near the stage during Trampled by Turtles on July 8, 2023, at Bayfront Festival Park in Duluth. Clint Austin / File / Duluth Media Group By Peter Passi December 15, 2024 at 9:13 PM Comments Share Share this article News Reporting News Reporting Based on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources. The Trust Project What is this? DULUTH — City councilors are expected to determine Monday night who shall manage the city’s most prominent and popular outdoor venue, Bayfront Festival Park. Last year, the city awarded the contract to a private firm, Winterfell Management LLC, wresting control away from the Duluth Entertainment Convention Center, which had overseen the park for more than a decade. ADVERTISEMENT But Winterfell’s tenure at the helm of Bayfront appears likely to prove brief. On Monday, the Duluth City Council will be asked to hand management of the park and venue to the DECC for the next five years. The city’s request for proposals elicited three responses, with evaluators scoring the DECC’s and Winterfell’s proposals first and second, respectively. Hartman said the DECC was encouraged by city staff to bid for the five-year Bayfront contract. It stands to receive $443,031 in management fees from the city over the next five years and, in turn, agrees to share ticket revenues and sponsorship funds with the city. Crowds of people attending Duluth's Fourth Fest at Bayfront Festival Park explore the food trucks and pop-up shops. Wyatt Buckner / 2024 file / Duluth Media Group Winterfell agreed to manage Bayfront for $82,900 in 2025 — $2,100 less than what the DECC will receive for its first year — and then to allow the city to adjust pay annually in accordance with its implicit price deflator calculation. The DECC and the Winterfell revenue-sharing proposals are difficult to compare, as they draw on different mixes of park rental fees, ticket fees and sponsorships. Jeff Stark, Winterfell’s president and founder, said he was disappointed that the evaluation team lacked what he considered to be adequate representation from the city’s hospitality industry. In a letter to supporters, he wrote: “By all metrics, 2024 was a tremendous success and looked to be a pivotal building block to Bayfront’s continued development as the (premier) outdoor venue in the Midwest. Records were set in attendance, booked dates and revenues generated for the City of Duluth.” ADVERTISEMENT Stark said he and his team had hoped to build on that momentum in the years ahead, before learning that evaluators had recommended to city councilors that management of the park be returned to the DECC’s control for the next five years. Hartman said he and staff respectfully question Winterfell's claims of record attendance in 2024, given the number of events the park hosted and poor weather that negatively effected turnout. Last year, the DECC had been asked if it wished to continue managing Bayfront, and City Administrator David Montgomery described the organization’s interest as “lukewarm” at best. At the time, DECC Executive Director Dan Hartman said revenues from Bayfront were quite modest, considering the amount of staff time it consumed. He referred to Bayfront as “a beautiful distraction.” While Hartman said staff would be willing to continue their oversight of Bayfront in 2024, he also expressed greater interest in a renewed focus on improving its operation of nine other DECC venues. How does the decc work? DECC 101: Explaining Duluth's harborfront complex Nov 7, 2023 The DECC had been operating on tight margins in 2023 and had found it necessary to cut staff, letting go of a number of employees, including then-director of operations Jeff Stark, a 28-year employee of the organization. In September 2023, The DECC requested and received a $1 million line of credit from the city to ensure it could continue to meet its financial obligations despite recent cash-flow concerns. The DECC ultimately did not need to draw on that credit line, but Hartman said it provided a helpful safety net for the organization. ADVERTISEMENT Retired DECC Director Dan Russell, who now serves as vice president of Winterfell, said, “I think the hospitality industry is very upset because I think they recognize the potential of what Bayfront means for this town and what it can be.” But Hartman said, \"At this point, I have heard from no one in the hospitality industry who is concerned about the DECC managing Bayfront again. And those I have heard from have seemed excited about the prospect of the DECC managing it again.\" Kat Riggins of Kat Riggins and Her Blues Revival smiles and applauds with the crowd during the band's set at the Bayfront Blues Festival on Aug. 9, at Bayfront Festival Park. Dan Williamson / File / Duluth Media Group Stark said one of Winterfell’s accomplishments was in helping to “reestablish Bayfront as a brand.” In terms of advertising, he said, “We tried to not only hit the Duluth market but the Twin Cities metro markets and outstate, as well.” Stark said Bayfront also increased its social media activity to expand its audience. “Bayfront is this iconic venue, and we all know that here in Duluth,” he said, noting that Winterfell has worked hard to raise the profile across the nation and to build broader awareness of what the unique waterfront venue has to offer. Stark said Winterfell has sought to extend the outdoor venue’s season, with the help of acts such as Willie Nelson, which DECC staff had booked in the year than had been the previous norm, and by hosting events such as a celebration of the University of Minnesota Duluth’s hockey opener well into the fall. also read Over objections, Duluth City Council approves marketing contract with Arizona firm Dec 9, 2024 Hartman said the DECC is back on firmer financial footing now, and its interest in managing the DECC has been reignited, in part, by the soon-to-be-opened Portside Park, an outdoor space located between the William A. Irvin and Pioneer Hall. ADVERTISEMENT This new venue has a recommended audience capacity of about 4,000 guests, as compared with 8,500 at Bayfront. But Hartman stressed the importance of coordinating the two venues’ activities so as to avoid booking potentially competing acts that could weaken the gate receipts at each. As Duluth continues to attract more event promoters, Hartman said, “The last thing anyone in the community wants, for example, is to have two big country shows on the same night, because that’s disastrous for everyone involved.” “You really need to have one person coordinating that, because otherwise, potentially, these promoters could each lose hundreds of thousands of dollars on a show, and after that, they’re never going to return,” Hartman said. This story originally misstated the differential between what the DECC and Winterfell Management offered to accept as compensation for managing Bayfront next year. The Winterfell proposal was for $2,100 less than the DECC offered in 2025. It was updated at 12:25 p.m. Dec. 16 with the correct figure. The News Tribune regrets the error. This story was updated at 9 p.m. Dec. 15, with additional commentary from Dan Hartman, executive director of the DECC.  It was originally posted at 7:05 p.m. the same day. more by peter passi Local Duluth police lock down Denfeld High School to arrest student A 16-year-old accused of second-degree assault was arrested without incident. 1d ago · By Peter Passi Local Duluth stormwater rate case overflows to appeal 2d ago · By Peter Passi Local Duluth mayor proposes staffing cuts to contain property tax increases 6d ago · By Peter Passi Local Proposed Minnesota Power sale to BlackRock rouses concern Sep 3 · By Peter Passi Comments Share Share this article News Reporting News Reporting Based on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources. The Trust Project What is this? Tags Tags DULUTH DULUTH CITY COUNCIL GOVERNMENT AND POLITICS TOURISM DNT SOCIAL MEDIA By Peter Passi Peter Passi covers city and county government for the Duluth News Tribune. He joined the paper in April 2000, initially as a business reporter but has worked a number of beats through the years. Conversation ADVERTISEMENT What To Read Next Local Wrenshall family mourns 11-year-old daughter killed by truck 6h ago · By Macklin Caruso Local MnDOT gives update on Twin Ports Interchange, Blatnik Bridge projects 6h ago · By Brielle Bredsten Local Police release name of woman who died in Virginia crash 10h ago · By Staff reports Get Local ADVERTISEMENT Must Reads Contests News Tribune announces Best of the Best 2025 winners 15h ago Subscribers Only Lifestyle Was this Minnesotan ‘the loneliest woman in America’? 16h ago · By Tracy Briggs Arts and Entertainment Photos and video: Glensheen concert series wraps up for the summer 6h ago · By Dan Williamson Minnesota Minnesota politicians condemn Charlie Kirk shooting, call it ‘political violence’ 9h ago · By Mary Murphy Account Manage My Account Privacy Policy Terms and Conditions Policies and Standards Subscriber Benefits News Subscription Options Email Newsletters E-Paper Our News Network Contact Get Help Contact Us Advertise With Us Get Our Advertising Newsletter Careers More JobsHQ Classifieds Public Notices Twitter Instagram Facebook © 2025 Duluth News Tribune and Forum Communications Company |   Office: 222 W. Superior St, Duluth, MN 55802   |   Send mail to: P.O. Box 16046, Duluth, MN 55816  |   (218) 723-5281  |  ISSN 2834-9210 We see that you have javascript disabled. Please enable javascript and refresh the page to continue reading local news. If you feel you have received this message in error, please contact the customer support team at 1-833-248-7801."
    },
    {
      "url": "https://www.duluthnewstribune.com/news/local/duluth-council-hands-bayfront-management-back-to-decc",
      "text": "Duluth council hands Bayfront management back to DECC - Duluth News Tribune | News, weather, and sports from Duluth, Minnesota $2 for 6 months SUBSCRIBE NOW Read Today's Paper Thursday, September 11 🏆Best of the Best winners 🗞️Advertise with us 🚢Edmund Fitzgerald 🔍Explore DNT archives Advertise With Us Digital Advertising Print Advertising Printing Services TV Advertising Video Services Place a Public Notice Get Our Advertising Newsletter Sponsored Content News Local Minnesota Wisconsin National World The Vault Agweek Forum News Network Weather Sports Prep Prep standings College Bulldogs Hockey Pro Northland Outdoors Obituaries Health Business Business Announcements Opinion Editorials Columns Letters Cartoons Lifestyle Arts / Entertainment Home / Garden Astro Bob Comics Free Games Community Milestones Calendar Contests Announcements From The Archives Bygones Archives FAQ Podcasts Listings Classifieds Public Notices JobsHQ Local Interest The Woman Today 20 Under 40 Account FCC Network Profile Newsletters Help Subscriber Benefits Sections $2 for 6 months SUBSCRIBE NOW Log in Account $2 for 6 months SUBSCRIBE NOW Sponsored By Sponsored By An organization or individual has paid for the creation of this work but did not approve or review it. ADVERTISEMENT ADVERTISEMENT News Local Duluth council hands Bayfront management back to DECC The Duluth Entertainment Convention Center will regain control of the city's premiere outdoor venue. Polica perform at Bayfront Festival Park in Duluth on Aug. 2, 2023. Jay Gabler / File / Duluth Media Group By Peter Passi December 16, 2024 at 10:22 PM Comments Share Share this article News Reporting News Reporting Based on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources. The Trust Project What is this? DULUTH — Bayfront Festival Park will be back under familiar management come 2025, as the Duluth Entertainment Convention Center resumes control of the popular outdoor venue after a year on the sidelines. Winterfell Management LLC won the management contract last year following an abbreviated selection process that did not follow typical city protocols due to an abbreviated timeline. At the time, the DECC Executive Director Dan Hartman indicated a willingness to continue managing Bayfront but also expressed no opposition to having the work reassigned to Winterfell. ADVERTISEMENT Heading into 2025, the city issued a request for proposals, garnering responses from three interested parties, including the DECC and Winterfell, which scored first and second, respectively, when a review committee evaluated the candidates. Jeff Stark, Winterfell’s president and founder, earlier expressed disappointment that his firm had not received a contract extension, as the city lined up Bayfront’s manager for the next five years. also read Duluth mayor proposes staffing cuts to contain property tax increases 6d ago Duluth library advocates call for sustained funding Aug 26 Duluth mayor warns council of pending tough budget decisions Aug 25 Hartman said city staff had encouraged the DECC to take another run at overseeing Bayfront. He explained that the opening of Portside Park — a new outdoor venue located between the William A. Irvin and Pioneer Hall — requires closer coordination with Bayfront, and having both venues under DECC control should ensure stronger lines of communication, as well as better orchestration. At large Councilor Azrin Awal thanked city administration for heeding the council’s request for a more conventional and thorough request-for-proposals review process as decisions about Bayfront’s management for the next five years were being made this time around. The DECC will receive $443,031 over the next five years under the Bayfront management contract approved Monday. The DECC also will share a portion of revenues with the city as part of the agreement. Comments Share Share this article News Reporting News Reporting Based on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources. The Trust Project What is this? Tags Tags GOVERNMENT AND POLITICS DULUTH CITY COUNCIL DULUTH ENTERTAINMENT CONVENTION CENTER BAYFRONT FESTIVAL PARK DNT SOCIAL MEDIA By Peter Passi Peter Passi covers city and county government for the Duluth News Tribune. He joined the paper in April 2000, initially as a business reporter but has worked a number of beats through the years. Conversation ADVERTISEMENT What To Read Next Local Wrenshall family mourns 11-year-old daughter killed by truck 6h ago · By Macklin Caruso Local MnDOT gives update on Twin Ports Interchange, Blatnik Bridge projects 6h ago · By Brielle Bredsten Local Police release name of woman who died in Virginia crash 10h ago · By Staff reports Get Local ADVERTISEMENT Must Reads Contests News Tribune announces Best of the Best 2025 winners 15h ago Subscribers Only Lifestyle Was this Minnesotan ‘the loneliest woman in America’? 16h ago · By Tracy Briggs Arts and Entertainment Photos and video: Glensheen concert series wraps up for the summer 6h ago · By Dan Williamson Minnesota Minnesota politicians condemn Charlie Kirk shooting, call it ‘political violence’ 9h ago · By Mary Murphy Account Manage My Account Privacy Policy Terms and Conditions Policies and Standards Subscriber Benefits News Subscription Options Email Newsletters E-Paper Our News Network Contact Get Help Contact Us Advertise With Us Get Our Advertising Newsletter Careers More JobsHQ Classifieds Public Notices Twitter Instagram Facebook © 2025 Duluth News Tribune and Forum Communications Company |   Office: 222 W. Superior St, Duluth, MN 55802   |   Send mail to: P.O. Box 16046, Duluth, MN 55816  |   (218) 723-5281  |  ISSN 2834-9210 We see that you have javascript disabled. Please enable javascript and refresh the page to continue reading local news. If you feel you have received this message in error, please contact the customer support team at 1-833-248-7801."
    }
  ]
}