{
  "fuentes": [
    {
      "url": "https://bcoadventures.com/about-us/",
      "email": "guest@domain.com"
    },
    {
      "url": "https://bcoadventures.com/about-us/",
      "email": "info@bayoucityoutdoors.com"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "email": "info@scibpaints.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "daren.echeveria@bayclubs.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "desone.parker@bayclubs.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "diana.poff@bayclubs.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "jake.stafford@bayclubs.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "josh.lyon@bayclubs.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "laurie.miner@bayclubs.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "paula.neubert@bayclubs.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "todd.mcwilliams@bayclubs.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "anne.wharton@bayclubs.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "annie.batista@bayclubs.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "ayyub.hansia@bayclubs.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "bayclubconnect@bayclubs.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "brenner.gerry@bayclubs.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "charlie.galvez@bayclubs.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "cori.fanucchi@bayclubs.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "danielle.palmer@bayclubs.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "dawn.latreille@bayclubs.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "dbauer@proclub.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "info.bces@bayclubs.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "info.bcrb@bayclubs.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "info.bcsm@bayclubs.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "info.bcbt@bayclubs.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "info.bccc@bayclubs.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "info.bccs@bayclubs.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "info.bccv@bayclubs.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "info.bcf@bayclubs.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "info.bcfd@bayclubs.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "info.bcg@bayclubs.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "info.bchs@bayclubs.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "info.bcm@bayclubs.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "info.bcp@bayclubs.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "info.bcpo@bayclubs.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "info.bcrh@bayclubs.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "info.bcrs@bayclubs.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "info.bcrv@bayclubs.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "info.bcsc@bayclubs.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "info.bcsf@bayclubs.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "info.bcssf@bayclubs.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "info.bcst@bayclubs.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "info.bcwc@bayclubs.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "info.brgc@bayclubs.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "info.frcc@bayclubs.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "info.mcc@bayclubs.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "james.lent@bayclubs.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "loren.powers@bayclubs.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "nick.diciaula@bayclubs.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "nicole.janicki@bayclubs.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "patty.becher@bayclubs.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "ray.manning@bayclubs.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "tony.allegre@bayclubs.com"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "email": "tyce@harborsquare.com"
    },
    {
      "url": "https://bayoucityenergy.com/about-us/our-team/",
      "email": "info@bayoucityenergy.com"
    },
    {
      "url": "https://www.mygulfcoastproperty.com/largo-homes/bayou-club/",
      "email": "cindy@mygulfcoastproperty.com"
    },
    {
      "url": "https://www.mygulfcoastproperty.com/largo-homes/bayou-club/",
      "email": "name@website.com"
    },
    {
      "url": "https://www.bayougc.com/memberships/",
      "email": "mskiba@texas-city-tx.org"
    },
    {
      "url": "https://www.1golf.eu/en/club/bayou-golf-club/",
      "email": "golf-club-detail@2x.png"
    },
    {
      "url": "https://www.1golf.eu/en/club/bayou-golf-club/",
      "email": "manager7979@bayouclubgolf.com"
    },
    {
      "url": "https://www.1golf.eu/en/club/bayou-golf-club/",
      "email": "travel@albrecht.de"
    }
  ],
  "mails": [
    "anne.wharton@bayclubs.com",
    "annie.batista@bayclubs.com",
    "ayyub.hansia@bayclubs.com",
    "bayclubconnect@bayclubs.com",
    "brenner.gerry@bayclubs.com",
    "charlie.galvez@bayclubs.com",
    "cindy@mygulfcoastproperty.com",
    "cori.fanucchi@bayclubs.com",
    "danielle.palmer@bayclubs.com",
    "daren.echeveria@bayclubs.com",
    "dawn.latreille@bayclubs.com",
    "dbauer@proclub.com",
    "desone.parker@bayclubs.com",
    "diana.poff@bayclubs.com",
    "golf-club-detail@2x.png",
    "guest@domain.com",
    "info.bcbt@bayclubs.com",
    "info.bccc@bayclubs.com",
    "info.bccs@bayclubs.com",
    "info.bccv@bayclubs.com",
    "info.bces@bayclubs.com",
    "info.bcf@bayclubs.com",
    "info.bcfd@bayclubs.com",
    "info.bcg@bayclubs.com",
    "info.bchs@bayclubs.com",
    "info.bcm@bayclubs.com",
    "info.bcp@bayclubs.com",
    "info.bcpo@bayclubs.com",
    "info.bcrb@bayclubs.com",
    "info.bcrh@bayclubs.com",
    "info.bcrs@bayclubs.com",
    "info.bcrv@bayclubs.com",
    "info.bcsc@bayclubs.com",
    "info.bcsf@bayclubs.com",
    "info.bcsm@bayclubs.com",
    "info.bcssf@bayclubs.com",
    "info.bcst@bayclubs.com",
    "info.bcwc@bayclubs.com",
    "info.brgc@bayclubs.com",
    "info.frcc@bayclubs.com",
    "info.mcc@bayclubs.com",
    "info@bayoucityenergy.com",
    "info@bayoucityoutdoors.com",
    "info@scibpaints.com",
    "jake.stafford@bayclubs.com",
    "james.lent@bayclubs.com",
    "josh.lyon@bayclubs.com",
    "laurie.miner@bayclubs.com",
    "loren.powers@bayclubs.com",
    "manager7979@bayouclubgolf.com",
    "mskiba@texas-city-tx.org",
    "name@website.com",
    "nick.diciaula@bayclubs.com",
    "nicole.janicki@bayclubs.com",
    "patty.becher@bayclubs.com",
    "paula.neubert@bayclubs.com",
    "ray.manning@bayclubs.com",
    "todd.mcwilliams@bayclubs.com",
    "tony.allegre@bayclubs.com",
    "travel@albrecht.de",
    "tyce@harborsquare.com"
  ],
  "nombre_sitio": "bayouclubgolf.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://bcoadventures.com/about-us/",
      "text": "About us - Bayou City Adventures About Us BCO Testimonials Buddies & Equipment Loaner Program Newsletter Travel Trips Travel Blog Discover Houston Blog Hiking How to build a Campfire Farmer’s Market Texas RenFest Events Calendar Join! Log In Sign in Bayou City Adventures Search for: Bayou City Adventures About Us BCO Testimonials Buddies & Equipment Loaner Program Newsletter Travel Trips Travel Blog Discover Houston Blog Hiking How to build a Campfire Farmer’s Market Texas RenFest Events Calendar Join! Log In Search for: Meet Bayou City Outdoors... Our Members... With over 700 active members, we are a diverse, friendly, fun, and adventurous group of people. We are open to both couples and singles that are interested in making a fundamental change in their life for the better. This is not a dating club. All of our events are group-oriented, providing a safe as well as a fun way of participating in many activities and meeting lots of new people . There is a broad range of backgrounds, interests, experiences, and abilities. We have members from all over the world! There is always a friendly, fun crowd and always new and interesting people to meet! Some of our stats : Our members range from 18 to 80 years of age, but the majority of our members are in their 30's, 40's, or 50's.  Club members are about 55% female, 45% male.  About 55% are single, and about 45% are couples.  Many of our members have children, or pets they consider children. Check out Public Photos to see photos from our events Meet our Event Leaders Our Activities... Bayou City Outdoors is a crazy active and social outdoor club, planning and hosting multiple events each week . We are continually adding new events and keeping members informed of club activities via the site, our newsletter and our private Facebook group. Whether you want to explore the nightlife or the area's best hiking trails, you'll find activities on our calendar to suit your tastes. Our events reflect a wide range of interests , giving members the opportunity to share adventures with positive, lively people like themselves in a safe, structured environment. Additionally, many of these events are planned with the beginner in mind, so you'll have many opportunities to try a broad range of new activities. All events are either free, subject to group discounts or are at cost. You can find us on Facebook , too! Want more...? Get to know Bayou City Outdoors! ∼∼∼∼∼∼ Check out our Event Calendar to see what is open for Non-Members Click Here for what's new in Houston! Something for Everyone... Art Galleries, Backpacking, Tennis, Walking, Camping, Scuba diving, Cycling, Social Events, Charity Events, Dining Out, Spelunking, Swimming, Geocache, Kayaking, Happy Hours, Bowling, Live Music, Climbing, Mountain Biking, Trail Running, Museums, Movies, Fishing, Dancing, Farmer's Markets, Hiking, Running, Travel, Boating, Dog-Friendly, Skiing, Sailing, MS-150 Ride, Theatre, Parties, Golf, Yoga ...and many more! Check out our Calendar here! Houston Events and meet new friends Bayou City Outdoors We do the work – you simply show up! Houston's event, adventure, and social club Click Here to Join Us! You not only have access to fun activities and the chance to be a part of a great group of people but also... 100's of Member Only Exclusive events - free or with a discount on special outings Full access to our online calendar Ready-made buddy list! Great for all singles, couples, and parents - all people you'll want to get outdoors and have fun with! Member profiles Need gear? Members have access to our free, gear loaner program! Need a kayak? We'll set you up. How about a bike? Want to go camping for the weekend? FREE Demos throughout the year on selected gear from our sponsors Want to Travel? We travel the country and the globe.  Plus, with BCO you'll always have a travel buddy to share in your adventures Full reciprocity to our sister clubs in other cities in the American Outdoor Adventure Network Meet people that share your active interests Buddy Program for new members so you never feel uncomfortable coming alone... ( What's the Buddy Program? ) We’re so sure you’ll love being a part of our membership that we offer a full, 30-day money-back guarantee. Our job is to bring more fun to your life!  Our members are busy professionals. Long commutes, business and school deadlines, personal errands…when do you find the time to plan your play? Make today the day you get out from behind your desk, get moving, get active, meet new friends, and have loads of fun! Don’t wait, you’ll be missing out on something special. There are events going on every day. Sign up, show up and start having fun, today.  You’ll meet people who live right here, in your city.  Active and interesting people who value their time and enjoy being a part of something special. Ready to get started? Click here and Join us! © 2025 - Bayou City Outdoors - Terms, Conditions and Liability Waiver - Contact us Report There was a problem reporting this post. Harassment Harassment or bullying behavior Inappropriate Contains mature or sensitive content Misinformation Contains misleading or false information Offensive Contains abusive or derogatory content Suspicious Contains spam, fake content or potential malware Other Report note Report Block Member? Please confirm you want to block this member. You will no longer be able to: See blocked member's posts Mention this member in posts Invite this member to groups Message this member Add this member as a connection Please note: This action will also remove this member from your connections and send a report to the site admin.\t\t\t\t\t\t\t\n\t\t\t\t\t\t\tPlease allow a few minutes for this process to complete. Confirm Report You have already reported this ."
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "text": "Contact Us: Get In Touch With Asian Paints for your Painting Needs Contact Us: We’d Love To Hear From You 16815 Popular searches Interior Paints Exterior Paints Shade cards SEARCH RESULTS {{searchItem.map.shadeCode}} {{searchItem.map.shadeFamilyName}}: {{searchItem.map.shadeName}} {{searchItem.map.title}} RELATED SEARCH NO MATCHES FOUND! Did you mean? {{spellCheck}} Log-In Hello! Hello! Signout en ar {{minicart.cartcount > 0 ? minicart.cartcount : 0}} ↻ Processing... You have {{minicart.cartcount}} items {{item[\"product\"][\"name\"]}} - + ₹ {{item[\"totalPrice\"][\"value\"]}} Total ₹ {{minicart.totalprice}} Checkout ↻ Menu PAINTS & COLOUR PAINTS & COLOUR Services Services WATERPROOFING WATERPROOFING INSPIRATION INSPIRATION Login/Register PAINTS & COLOUR All PAINTS & COLOUR EXPLORE COLOURS Colour Catalogue Home Colour Guide PAINT PRODUCTS Interior Paints Exterior Paints Waterproofing Wood Paints Metal Paints Undercoats RESOURCES Paint Budget Calculator Ideas Gallery Colour visualizer SERVICES Paint Store Near Me Book Painting Services Services All Services Beautiful Homes Painting Service Scib Stars WATERPROOFING All WATERPROOFING Bathrooms Terrace and Tanks Roof & Basement Interiors Tiling All Products INSPIRATION All INSPIRATION Get Inspired Paint calculator Gallery Colour Next Guides DecorPro Resources Colour Visualizer Ideas Gallery Please enter your mobile number To receive the dealer details on SMS Mobile * SUBMIT Get in Touch We’d love to hear from you Head Office Scib Chemical S.A.E 6th of October Cirt, 4th Industrial (1/3/B)B Tel:            (+202)38281090-99 Fax: (+202)38331271 Scib Paints Helpline* For enquiries, feedback and complaints please call on 16815 or write to us at info@scibpaints.com Mobile number +91 00:59 ↻ ↻ Need help with your painting needs? Fill the form below to book a free site evaluation by a Scib Paints Beautiful Homes Painting Service expert. Name Mobile Number +20 Governorate * Email By proceeding, you are authorizing Scib Paints and its suggested contractors to get in touch with you through calls, sms, or e-mail. Book an appointment ↻ Thank you! We value your interest in Scib Paints Beautiful Homes Service. We will get in touch with you shortly to schedule a visit by an expert. Try again! Oops! Something went wrong. We couldn't process your request. Please try again? Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Our Divisions More about Asian Paints Congratulations You have subscribed. Contact Us 16815 EMAIL ABOUT Research & Technology Careers Contact Us Certificates RESOURCES FAQs POLICIES Quality Policy Customer Policy Cookie Policy Environment Policy EHS Policy TOOLS Colour Catalogue Color with AP APP/Website​ COUNTRY EGYPT Country EGYPT India GLOBAL BANGLADESH MIDDLE EAST FIJI NEPAL SRI LANKA ETHIOPIA CONNECT DOWNLOAD OUR PAINTING APP CONNECT WITH US ©Scib Paints - All rights reserved Congratulations You have subscribed. Welcome User Login OR Continue as guest You have been successfully logged out Login An OTP has been sent to your registered mobile number and email id. 00:00 Resend By clicking submit, I agree to terms and conditions SUBMIT Register Please enter the 5 digit OTP sent via SMS to verify your mobile number! 00:00 Resend I agree to terms and conditions SUBMIT Please enter your mobile number To receive the dealer details on SMS SUBMIT Provide a delivary address Fullname* Email* Mobile* +91 Flat/House No/Floor* Colony/Street/Locality* Landmark City* Pincode* SUBMIT User already exist redirecting you for the login page Paint Budget Calculator Get instant estimates Calculate now Waterproofing Calculator Get an instant estimate Calculate now"
    },
    {
      "url": "https://www.bayclubs.com/contact-us/",
      "text": "Contact Us, Club Phone and Email Addresses | The Bay Club Scroll Down Start your back to school routine now. JOIN TODAY Start your back to school routine now. JOIN TODAY × Enjoy the club for a day on us*. JOIN NOW *Restrictions apply. Toggle navigation Join Memberships Alumni Member Benefits Visit a Club Join Now Join GOLF Clubs Golf Amenities Classes Camps Members Overview SHAPING OUR FUTURE 2025 Annual Update Connect Log In Alumni Classes Events Perks & Partnerships FAQ Contact Us What's New × Fitness ELEVATE Fitness Centers Fitness Training Group Exercise IGNITE Pilates Recovery Yoga Cycling Sports Swim Basketball Golf Pickleball Racquetball Squash Tennis Family After School Programs Childcare Family Events Kids Camps Hospitality Connect Business Suite Dining Hotel Laundry Services Locker Room Parties and Events Private Events Sauna Spa Steam Room × Northern California Marin Bay Club Rolling Hills Bay Club Ross Valley StoneTree Golf Club Bay Club Marin San Francisco Bay Club San Francisco Bay Club Gateway Bay Club Financial District Bay Club South San Francisco East Bay North + South Crow Canyon Country Club Bay Club Pleasanton Bay Club Fremont Bay Club Walnut Creek Peninsula Bay Club Redwood Shores Bay Club Broadway Pickleball & Tennis Santa Clara Bay Club Santa Clara San Jose Bay Club Courtside Boulder Ridge Golf Club Southern California Los Angeles Manhattan Country Club Bay Club El Segundo Bay Club Santa Monica Bay Club Redondo Beach San Diego Bay Club Carmel Valley Fairbanks Ranch Country Club Pacific Northwest Washington Harbor Square Athletic Club NEW 425 Fitness Bothell NEW 425 Fitness Issaquah NEW 425 Fitness Redmond NEW PRO Club Bellevue PRO Club Seattle Oregon Portland Happy to Help Contact Member Services For questions about billing, membership or any other questions, please email or log into Bay Club Connect for more information. bayclubconnect@bayclubs.com Bay Club Connect Login Contact Your Club To speak with Club management, please call or email the Club directly. Pacific Northwest Washington Campus Harbor Square Athletic Club 160 W Dayton St Edmonds, WA  98020 425.778.3546 info.bchs@bayclubs.com Tyce Tallman General Manager 425-778-3546 tyce@harborsquare.com 425 Fitness Bothell 18524 Bothell Everett Hwy Bothell, WA 98012 425-486-2805 425 Fitness Issaquah 1025 Gilman Blvd Suite E9 Issaquah, WA 98027 425-369-8585 425 Fitness Redmond 7956 178th Pl NE Redmond, WA 98052 425-883-9494 PRO Club Bellevue 4455 148th Avenue N.E. Bellevue, WA 98007 425.885.5566 Debbie Bauer Executive Vice President 425.895.6533 dbauer@proclub.com PRO Club Seattle 501 Eastlake Ave E., 2nd Floor Seattle, WA 98109 206.332.1873 Debbie Bauer Executive Vice President 425.895.6533 dbauer@proclub.com Oregon Campus Bay Club Portland 18120 SW Lower Boones Ferry Road Tigard, OR 97224 503.968.4500 info.bcpo@bayclubs.com Danielle Palmer General Manager 415-901-9285 danielle.palmer@bayclubs.com Northern California Marin Campus Bay Club Rolling Hills 351 San Andreas Drive Novato, CA  94945 415.897.2185 info.bcrh@bayclubs.com Charlie Galvez Club Manager 415-209-6090 charlie.galvez@bayclubs.com Bay Club Ross Valley 235 Bon Air Road Kentfield, CA 94904 415.461.5431 info.bcrv@bayclubs.com Ayyub Hansia Senior Vice President 415-945-3025 ayyub.hansia@bayclubs.com StoneTree Golf Club 9 StoneTree Lane Novato, CA 94945 415.209.6090 info.bcst@bayclubs.com Brenner Gerry VP/General Manager 650-776-6422 brenner.gerry@bayclubs.com Bay Club Marin 220 Corte Madera Town Center Corte Madera, CA 94925 415.945.3000 info.bcm@bayclubs.com Desone Parker Senior Vice President 415-945-3052 Desone.Parker@bayclubs.com San Francisco Campus Bay Club San Francisco 150 Greenwich Street San Francisco, CA 94111 415.433.2200 info.bcsf@bayclubs.com Nicole Janicki Senior Vice President 415-461-5431 nicole.janicki@bayclubs.com Bay Club at the Gateway 370 Drumm Street San Francisco, CA 94111 415.616.8800 info.bcg@bayclubs.com Jake Stafford Club  Manager 415.901.9203 Jake.Stafford@bayclubs.com Bay Club Financial District 555 California Street San Francisco, CA 94104 415.362.7800 info.bcfd@bayclubs.com Ray Manning VP/General Manager 415.901.9277 ray.manning@bayclubs.com Bay Club South San Francisco Tennis & Pickleball 501 Carter Street Daly City, CA 94014 415.777.9000 info.bcssf@bayclubs.com Ray Mannning VP/General Manager 415-901-9277 ray.manning@bayclubs.com East Bay North + South Campus Crow Canyon Country Club 711 Silver Lake Drive Danville, California  94526 925.735.5700 info.bccc@bayclubs.com Daren Echeveria VP/General Manager 510-226-6069 Daren.Echeveria@bayclubs.com Bay Club Pleasanton 7090 Johnson Drive Pleasanton, CA 94588 925.463.2822 info.bcp@bayclubs.com Josh Lyon Senior Vice President 925-225-2444 Josh.lyon@bayclubs.com Bay Club Fremont 46650 Landing Parkway Fremont, CA 94538 510.226.8500 info.bcf@bayclubs.com Patty Becher VP/General Manager 408-458-4105 patty.becher@bayclubs.com Bay Club Walnut Creek 2805 Jones Road Walnut Creek, CA 94597 925.938.8700 info.bcwc@bayclubs.com Paula Neubert Executive Vice President 925-938-8700 Paula.Neubert@bayclubs.com Peninsula Campus Bay Club Redwood Shores 200 Redwood Shores Parkway Redwood City, CA 94065 650.593.4900 info.bcrs@bayclubs.com Cori Fanucchi Senior Vice President 650.232.1067 cori.fanucchi@bayclubs.com Bay Club Broadway Pickleball & Tennis 60 Edwards Court Burlingame, CA 94010 650.517.5999 info.bcbt@bayclubs.com James Lent Senior Vice President james.lent@bayclubs.com Santa Clara Campus Bay Club Santa Clara 3250 Central Expressway Santa Clara, CA 95051 408.738.2582 info.bcsc@bayclubs.com Laurie Miner VP/General Manager 408.738.2582 Laurie.Miner@bayclubs.com San Jose Campus Bay Club Courtside 14675 S Winchester Boulevard Los Gatos, CA 95032 408.395.7111 info.bccs@bayclubs.com Todd McWilliams II Senior Vice President 408-331-2953 Todd.McWilliams@bayclubs.com Boulder Ridge Golf Club 1000 Old Quarry Rd San Jose, CA 95123 408.323.9900 info.brgc@bayclubs.com Loren Powers VP/General Manager 408.331.2930 loren.powers@bayclubs.com Southern California Los Angeles Campus Manhattan Country Club 1330 Parkview Avenue Manhattan Beach, CA 90266 310.546.5656 info.mcc@bayclubs.com Anne Wharton Executive Vice President 310-562-0002 anne.wharton@bayclubs.com Bay Club El Segundo 2250 Park Place El Segundo, CA 90245 310.643.6878 info.BCES@bayclubs.com Annie Batista Executive Vice President 310-703-5404 annie.batista@bayclubs.com Bay Club Santa Monica 2425 Olympic Boulevard Santa Monica, CA 90404 310.829.4995 info.BCSM@bayclubs.com Diana Poff General Manager 310-379-8202 Diana.Poff@bayclubs.com Bay Club Redondo Beach 819 North Harbor Drive Redondo Beach, CA 90277 310.376.9443 info.BCRB@bayclubs.com Tony Allegre Vice President/General Manager 323.807.7971 tony.allegre@bayclubs.com San Diego Campus Bay Club Carmel Valley 12000 Carmel Country Road San Diego, CA 92130 858.509.9933 info.bccv@bayclubs.com Nick Diciaula Executive Vice President 858-369-3227 nick.diciaula@bayclubs.com Fairbanks Ranch Country Club 15150 San Dieguito Road Rancho Santa Fe, CA 92067 858.259.8811 info.frcc@bayclubs.com Dawn Latreille Vice President/General Manger 858.519.3307 dawn.latreille@bayclubs.com × Having Trouble Connecting With Us? We’re Here To Help! If you need assistance logging into or navigating Bay Club Connect, simply fill out the form below and we’ll be in touch shortly. First Name Last Name Phone Email Member Number Home Club Choose your Home Club PRO Club Bellevue Harbor Square Athletic Club PRO Club Bellevue PRO Club Seattle Bay Club Portland Bay Club Rolling Hills StoneTree Golf Club Bay Club Ross Valley Bay Club Marin Bay Club Walnut Creek Bay Club San Francisco Bay Club at the Gateway Bay Club Financial District Crow Canyon Country Club Bay Club South San Francisco Tennis & Pickleball Bay Club Pleasanton Bay Club Broadway Pickleball & Tennis Bay Club Redwood Shores Bay Club Fremont Bay Club Santa Clara Bay Club Courtside Boulder Ridge Golf Club Bay Club Santa Monica Bay Club El Segundo Manhattan Country Club Bay Club Redondo Beach Fairbanks Ranch Country Club Bay Club Carmel Valley Additional Notes (optional) SUBMIT All fields required unless otherwise noted. Press Room Blog Contact Us Careers © 2025 The Bay Club Company. 1620 Montgomery Street, Unit 250 San Francisco, CA 94111 Privacy Policy & Terms of Use Privacy Settings Membership Guidelines Sitemap Chat now Book a Quick Video Call REQUEST FOLLOW UP Visit a Club Choose a Club Select one Harbor Square Athletic Club PRO Club Bellevue PRO Club Seattle Bay Club Portland Bay Club Rolling Hills StoneTree Golf Club Bay Club Ross Valley Bay Club Marin Bay Club Walnut Creek Bay Club San Francisco Bay Club at the Gateway Bay Club Financial District Crow Canyon Country Club Bay Club South San Francisco Tennis & Pickleball Bay Club Pleasanton Bay Club Broadway Pickleball & Tennis Bay Club Redwood Shores Bay Club Fremont Bay Club Santa Clara Bay Club Courtside Boulder Ridge Golf Club Bay Club Santa Monica Bay Club El Segundo Manhattan Country Club Bay Club Redondo Beach Fairbanks Ranch Country Club Bay Club Carmel Valley First Name Last Name Email City State AL AK AR AZ CA CO CT DC DE FL GA HI IA ID IL IN KS KY LA MA MD ME MI MN MO MS MT NC NE NH NJ NM NV NY ND OH OK OR PA RI SC SD TN TX UT VT VA WA WI WV WY Phone Zip SUBMIT Questions? Let's Chat! × WE’RE SO HAPPY YOU’RE HERE. At the Bay Club, we strive to craft experiences that create a robust and active lifestyle for our members – with a focus on sports, fitness, hospitality, and family. A key piece of our success is listening to the needs of our members and using their input to influence our programming and amenities. And, we have found it is just as important to listen early – before the membership has even started. So, please tell us a little about what brought you here today and what you would like your Bay Club experience to look like. We thank you for taking the time to share a little bit about yourself and look forward to assisting you. What brought you here and why would you like to become a part of the Bay Club? Tell us about who the membership is for and how you envision it fitting into your life. What location are you interested in? Select a region Oregon Marin San Francisco East Bay Peninsula South Bay Los Angeles San Diego Select a club Portland Select a club StoneTree Golf Club Ross Valley Marin Select a club Walnut Creek Pleasanton Fremont Select a club San Francisco The Gateway Financial District SF Tennis Select a club Santa Clara Courtside Boulder Ridge Golf Club Fremont Select a club Pacific Palisades Santa Monica El Segundo Manhattan Country Club Redondo Beach Rolling Hills Select a club Fairbanks Ranch Country Club Carmel Valley Select a club Redwood Shores Broadway Tennis How can we help? How would you prefer to be communicated with? First Name Last Name Email Phone Street (optional) City (optional) State AL AK AR AZ CA CO CT DC DE FL GA HI IA ID IL IN KS KY LA MA MD ME MI MN MO MS MT NC NE NH NJ NM NV NY ND OH OK OR PA RI SC SD TN TX UT VT VA WA WI WV WY Zip Code (optional) Submit × Visit a Club First Name Last Name Email Phone Number Street (optional) City (optional) State (optional) AL AK AR AZ CA CO CT DC DE FL GA HI IA ID IL IN KS KY LA MA MD ME MI MN MO MS MT NC NE NH NJ NM NV NY ND OH OK OR PA RI SC SD TN TX UT VT VA WA WI WV WY Zip Code (optional) How did you hear about us? (optional) Select an option Commercial Billboard Social Media Digital Ad Online Search Friend or Family Other Advertisement Select a Club Choose a Club to visit PRO Club Bellevue Harbor Square Athletic Club PRO Club Bellevue PRO Club Seattle Portland Rolling Hills StoneTree Golf Club Ross Valley Marin Walnut Creek San Francisco The Gateway Financial District Crow Canyon Country Club South San Francisco Tennis & Pickleball Pleasanton Broadway Pickleball & Tennis Redwood Shores Fremont Santa Clara Courtside Boulder Ridge Golf Club Santa Monica El Segundo Manhattan Country Club Redondo Beach Fairbanks Ranch Country Club Carmel Valley Submit"
    },
    {
      "url": "https://bayoucityenergy.com/about-us/our-team/",
      "text": "Our Team | Bayou City Energy Skip to content About Our Team Our Approach Portfolio News Investor Login Main Menu Our Team BCE’s team of professionals have several decades of combined natural resources investing experience and a track record of building successful upstream businesses throughout commodity price cycles. Leadership We have assembled a team with highly relevant experience from varied perspectives in the natural resources investing, corporate finance, and legal disciplines, enabling a comprehensive understanding of investment risks and opportunities. William McMullen Founder & Managing Partner Andrew Koehler Managing Director, CFO, & CCO Darren Lindamood Managing Director & General Counsel Richard Wynne Managing Director Noah Hutchinson Senior Associate Cody langford Associate Mandy Roberts Controller Julia Blevins Assistant Controller Cyndhia Lasso Executive Office Administrator Natalie Duran Administrative Assistant William McMullen Founder & Managing Partner As the Firm’s Founder and Managing Partner, Mr. McMullen leads the Firm’s Investment Committee and is currently Chairman of the Board of Directors for White Knight Production and all partnerships with Mach Resources. Prior to founding BCE in 2015, Mr. McMullen served in various investment team and banker capacities at White Deer Energy, Denham Capital Management and UBS Investment Bank. Mr. McMullen was a co-founder and board member at the Ara Partners Group based in Houston, TX. He is an Ambassador for the Congaree Foundation and member of the Petroleum Club of Houston. He served as the inaugural Chairman for the Houston Young Professionals Endeavor, a program of the Greater Houston Partnership and as CFO and Board Member of the Young Professionals in Energy (“YPE”) organization, a non-profit group with more than 40,000 members worldwide. Mr. McMullen earned his Bachelor’s degree in Economics, with Honors, from Harvard University. Andrew Koehler Managing Director, CFO, & CCO Mr. Koehler serves as Managing Director, CFO and CCO for the Firm. As a Managing Director, Mr. Koehler is on the Firm’s Investment Committee and is currently on the Board of Directors for White Knight Production and all partnerships with Mach Resources. Mr. Koehler’s primary focus areas are portfolio management, fund administration and reporting, regulatory compliance, and new investment evaluation, structuring, and execution. Additionally, Mr. Koehler assists in fundraising, deal sourcing, and leads investment professional recruiting for the firm. Mr. Koehler joined the firm near its inception in early 2015 as Senior Associate. Prior to Bayou City, Mr. Koehler worked as an Associate and Analyst within the Energy Investment Banking group of Canaccord Genuity. While with Canaccord, Mr. Koehler worked on various capital markets and advisory transactions within the upstream and oilfield services sectors, including equity and debt private placements, public equity issuances, reverse mergers, and asset acquisitions and divestitures. Mr. Koehler graduated Summa Cum Laude from Tulane University with a B.A. in Economics and Political Science and a B.S. in Psychology and was elected to Phi Beta Kappa. Darren Lindamood Managing Director & General Counsel Mr. Lindamood serves as Managing Director and General Counsel for the Firm. As a Managing Director, Mr. Lindamood is on the Firm’s Investment Committee and is on the Board of Directors for all partnerships with Mach Resources. As General Counsel, he advises the Firm on all legal matters relating to fund and portfolio management. Prior to joining Bayou City, Mr. Lindamood was an attorney with Norton Rose Fulbright (formerly, Fulbright & Jaworski). He earned his law degree from Wake Forest University School of Law, where he served as Executive Editor of the Law Review. He graduated from Wake Forest University with a B.A. in English and was elected to Phi Beta Kappa. Richard Wynne Managing Director Mr. Wynne serves as Managing Director for the Firm. As a Managing Director, Mr. Wynne is on the Firm’s Investment Committee and is currently on the Board of Directors for White Knight Production and all partnerships with Mach Resources. Prior to joining Bayou City, Mr. Wynne worked as Director of Finance for one of ECP’s portfolio companies, Sendero Midstream. Previously, Mr. Wynne worked in the business development group for Plains All American Pipeline and as an Analyst in UBS Investment Bank’s Global Energy Group. Mr. Wynne holds an MBA from Columbia University and a BA in Political Science from Yale University. Noah hutchinson SENIOR ASSOCIATE Prior to joining Bayou City, Mr. Hutchinson was an associate in the Energy Investment Banking Group at Truist Securities in Houston, where he focused on A&D and M&A advisory work within the energy industry. Mr. Hutchinson graduated from Texas Christian University with a Bachelor of Business Administration with a finance concentration. Cody langford ASSOCIATE Prior to joining Bayou City, Mr. Langford was a Corporate Associate at Pickering Energy Partners, where he focused primarily on financial reporting, fund operations and accounting, and investor relations. Mr. Langford began his career with BDO USA, LLP, where he worked as a Senior Associate in their Valuation and Business Analytics division, with a focus on the financial services and oil and gas sectors. Mr. Langford holds a BSBA in Finance from The University of Arizona. Mandy Roberts Controller Prior to joining Bayou City, Mrs. Roberts worked as the Fund Accountant at Siltstone Capital, LLC, a private equity fund in Houston, Texas. Previous to Siltstone Capital, Mrs. Roberts worked as the Fund Accountant at White Deer Energy. Mrs. Roberts joined White Deer in 2013 after four years with Melton & Melton, LLP. At Melton & Melton, Mrs. Roberts worked as a Supervisor on audit engagements in various industries. Mrs. Roberts graduated with honors from Lamar University with a BBA in Accounting. Julia Blevins Assistant Controller Before joining Bayou City Energy, Mrs. Blevins was a Senior Auditor for two years at Whitley Penn, LLP. Over those two years, she supervised audit engagements in various industries, one of which was Bayou City. Prior to Whitley Penn, Mrs. Blevins resided in Fargo, North Dakota where she worked at Fiebiger, Swanson, West & Co., PLLP as a Staff Accountant. At FSW, she prepared individual and business tax returns and performed bookkeeping services. Mrs. Blevins graduated Summa Cum Laude from North Dakota State University with a B.S. in Accounting and is a Certified Public Accountant. Cyndhia Lasso Executive Office Administrator Prior to joining Bayou City, Ms. Lasso worked as the Manager of E&B Brewery Lofts, while serving as the Executive Assistant to the Owner and CEO of E&B Brewery Lofts and Pellerito Foods, Inc. in Detroit, MI. Ms. Lasso joined E&B Brewery Lofts in 2015 after fourteen years with PASCO Property Management. At PASCO, Ms. Lasso worked as the Accounts Receivable Administrator. While with PASCO Property Management Ms. Lasso oversaw the accounts receivable department while providing support to the property managers and condominium association members. Natalie Duran Administrative Assistant Prior to joining Bayou City Energy, Ms. Duran worked as a legal assistant at TrammellPC, a personal injury law firm in Houston, Texas. Ms. Duran graduated from Houston Community College with an Associate of Arts. oUR aPPROACH Low-risk, Yield-oriented Our Portfolio Cash flow generating, top-tier operators Growth equity capital for operators Reach out to BCE Contact Us About Our Team Our Approach Portfolio News Investor Login About Our Team Our Approach Portfolio News Investor Login About Us Portfolio Our Approach Team News Privacy Notice Terms of Use Contact Us 2229 San Felipe Street Suite 1075 Houston, TX 77019 713-400-8200 info@bayoucityenergy.com Copyright © 2025 Bayou City Energy ALL RIGHTS RESERVED | Design by Blue Atlas Scroll to Top"
    },
    {
      "url": "https://www.mygulfcoastproperty.com/largo-homes/bayou-club/",
      "text": "Bayou Club Homes for Sale Largo FL | Bayou Club Real Estate MENU Areas CONDOS Anna Maria To Siesta Key Pinellas County Sarasota/Bradenton Tampa All Beachfront Condos All Downtown Condos HOMES Anna Maria To Siesta Key Apollo Beach Pinellas County Sarasota/Bradenton Tampa BEACHFRONT CONDOS All Beachfront Clearwater Beach To St Pete Beach Anna Maria To Siesta Key Condos BEACH Beachfront Condos Anna Maria Island Clearwater Beach Indian Rocks Beach Indian Shores Island Estates Longboat Key Madeira Beach Redington Beach Sand Key St Pete Beach Siesta Key Treasure Island See All Beachfront MAINLAND Mainland Condos Belleair Clearwater Dunedin Gulfport Largo Sarasota Downtown Seminole St Pete Downtown St Petersburg Tampa Tampa Downtown Tarpon Springs See All Mainland Condos LIFESTYLE Condos by Lifestyle 55+ Beachfront Downtown Golf Investment Non-Flood Zone Condos Pet-Friendly Tennis Waterfront Homes BEACH Anna Maria Island Clearwater Beach Indian Rocks Beach Indian Shores Island Estates Longboat Key Madeira Beach Redington Beach St Pete Beach Treasure Island See All Beachfront Homes MAINLAND Apollo Beach Belleair Clearwater Dunedin Gulfport Largo Oldsmar Seminole St Petersburg Tampa Tarpon Springs See All Mainland Homes LIFESTYLE Homes by Lifestyle Gated Golf Non-Flood Zone Homes Tennis Waterfront Lifestyles CONDOS Beachfront Downtown Condos 55+ Golf Investment Non-Flood Zone Condos Pet-Friendly Tennis Waterfront All Lifestyle Searches HOMES Gated Golf Non-Flood Zone Homes Tennis Waterfront All Lifestyle Searches MORE LIFESTYLES Fun For Kids Things To Do Videos Search Search Tips Advanced Search Search by Map Zip Code Search Property Tracker Featured Listings Contact About Meet The Team Testimonials Get Help From A Local Expert Buyers Sellers Communities Choose Condos Choose Homes More Login / Register Blog (727) 619-2799 ENGLISH 中文 FRANÇAIS 한국어 ITALIANO 日本語 DEUTSCH PORTUGUÊS РУССКИЙ ESPAÑOL TIẾNG VIỆT Home Largo Homes Bayou Club Bayou Club Homes for Sale Bayou Club homes for sale are some of the most luxurious homes in Pinellas County. The homes are nestled in the popular Bayou Club golf course in Largo, Fl. The centerpiece of the community is the signature designed Tom Fazio golf course. Bayou Club Estates homes have spectacular views of this amazing course, exceptional layouts, and the craftsmanship you would expect in luxury real estate. Bayou Club homes for sale include one and two-story layouts with a variety of architectural styles. The “typical” Bayou Club home for sale is a 4 bedroom 3 bath home with a little over 3,000 sq ft of living space, but plans vary widely. There are homes as big as 7,000 sq ft with 5 bedrooms and 4+ baths. Virtually all the homes have at least 3 bedrooms and 2 baths and over 2,000 sq ft of living area. Although there is a community pool to enjoy, most of the homes also have private pools with screened lanais. Read More Below... Interested in a home in Largo Florida? Save time and give us a call at 727-619-2799 or use our handy contact form . Homes for Sale in Bayou Club September 10, 2025 7 Listed 79 Avg. DOM $366.45 Avg. $ / Sq.Ft. $950,000 Med. List Price Gallery Photo View List Map Map View Get Alerts! Refine Results Price (Highest) Price (Lowest) Days on Site (Newest) Days on Site (Oldest) Bedrooms (Most) 7 Properties Open 9/14 $969,000 50 7719 Aralia WAY Seminole,  FL 33777 Bayou Club Estates Tr 5 Ph 4 3 Beds 2 F 1 1/2 Baths 2,589 Sq.Ft. MLS #: TB8418053 $859,900 61 9980 Sago Point Dr Seminole,  FL 33777 Bayou Club Estates Tr 5 Ph 3 4 Beds 3 Baths 2,900 Sq.Ft. MLS #: TB8411442 $1,949,000 83 7401 Water Silk Dr Pinellas Park,  FL 33782 Bayou Club Estates Rep Ph 1 5 Beds 5 F 1 1/2 Baths 5,284 Sq.Ft. MLS #: TB8403681 $2,499,999 66 8707 Silverthorn Rd Seminole,  FL 33777 Bayou Club Estates T 5 Beds 5 Baths 5,061 Sq.Ft. MLS #: TB8400998 $950,000 23 7521 Aralia WAY Seminole,  FL 33777 Bayou Club Estates Tr 5 Ph 2 3 Beds 2 F 1 1/2 Baths 2,423 Sq.Ft. MLS #: A4656338 $890,000 81 9800 Sago Point Dr Seminole,  FL 33777 Bayou Club Estates Tr 5 Ph 1 3 Beds 2 F 1 1/2 Baths 2,674 Sq.Ft. MLS #: TB8394327 $819,900 31 7279 Maidencane Ct Seminole,  FL 33777 Bayou Club Estates T 3 Beds 2 F 1 1/2 Baths 2,674 Sq.Ft. MLS #: TB8362417 See All Homes in Largo Fl Popular Largo Subdivisions Bardmoor Homes Bayou Club Collins Estates Del Prado Gated Communities Golf Communities Harbor Bluffs Harbor Hills Hillcrest Manor Homes by School District Imperial Point Homes Keene Park Largo Fl Expert Largo Homes Luxury Homes Orangewood Waterfront Homes More Information About Bayou Club Homes for Sale The Bayou Club is a deed-restricted community with a gated entrance for your privacy and security. Location The neighborhood is at the intersection of Largo, Seminole, and Pinellas Park just south of Brian Dairy Rd between Starkey and Belcher Rd. Bayou Club Estates is about 2 miles east of Lake Seminole, 7 miles from Indian Rocks Beach, and 10 miles from Clearwater Beach. It is about 17 miles from downtown St Pete and 20 miles from Tampa International Airport. What's Nearby Indian Rocks Beach and Indian Shores are the Gulf Beaches closest to the Bayou Club. They are about 10 miles west of the community. Walsingham Park is about 5 miles west and the south entrance to the park is on 102nd Ave N. The park offers wonderful picnic spots on Walsingham Lake, 2 dog parks, and several trails for walking or bike riding. The War Veterans Memorial Park is 7 miles southwest of the Bayou Club. Veterans Memorial Park has a memorial to our military veterans, great picnic spots, beautiful walking and biking trails, and a kayak launch out to Boca Ciega Bay and the bayou. Take in a play or concert at Ruth Eckerd Hall just 12 miles northeast of the Bayou Club. Downtown St Pete is just 17 miles away and it’s a fun to spend a day or evening having dinner or enjoying the nightlife. Lifestyle Residents love the country club atmosphere and the sense of community of living in this beautiful neighborhood. It is a great community for golf or just taking a walk, or relaxing by your pool and enjoying a golf view. Why People Live in Bayou Club Largo This is one of the nicest subdivisions in the Largo/Seminole area. The gated entranced provide a sense of security and rolling fairways and beautiful greens are the picture of tranquility. There is a real sense of community at Bayou Club Estates and the golf amenities are second to none in the area. Interested in Bayou Club or another Largo Florida home? We are here to help. Give us a call at 727-619-2799 or use our handy contact form below. TOP OF PAGE Δ Use the Handy Contact Form Below To Get In Touch First Name: Last Name: Email Address: Phone: I am Interested in: Select One Buying Selling Buying & Selling Leasing Broker / Agent Property Type: Select One Condominium Single Family Residence Town House Investment Properties Commercial Land/Lot Vacation Properties Other Bedrooms: Any 1 2 3 4 5 6 Bathrooms: Any 1 2 3 4 5 6 Min Price: No Min $50,000 $60,000 $70,000 $80,000 $90,000 $100,000 $125,000 $150,000 $175,000 $200,000 $225,000 $250,000 $275,000 $300,000 $325,000 $350,000 $375,000 $400,000 $425,000 $450,000 $475,000 $500,000 $550,000 $600,000 $650,000 $700,000 $750,000 $800,000 $850,000 $900,000 $950,000 $1,000,000 $1,100,000 $1,200,000 $1,300,000 $1,400,000 $1,500,000 $1,600,000 $1,700,000 $1,800,000 $1,900,000 $2,000,000 Max Price: No Max $50,000 $60,000 $70,000 $80,000 $90,000 $100,000 $125,000 $150,000 $175,000 $200,000 $225,000 $250,000 $275,000 $300,000 $325,000 $350,000 $375,000 $400,000 $425,000 $450,000 $475,000 $500,000 $550,000 $600,000 $650,000 $700,000 $750,000 $800,000 $850,000 $900,000 $950,000 $1,000,000 $1,100,000 $1,200,000 $1,300,000 $1,400,000 $1,500,000 $1,600,000 $1,700,000 $1,800,000 $1,900,000 $2,000,000 Do You Require Lender Information? Yes No Questions / Where Are You Looking? Submit By proceeding, you expressly consent to receive texts at the number you provided, including marketing, from MyGulfCoastProperty.com about real estate related matters, but not as a condition of purchase. Message frequency varies. You can text Help for help and Stop to cancel. You also agree to our Terms of Service and to our Privacy Policy regarding the information relating to you. Message and data rates may apply. Additionally, you expressly consent to receiving calls at the number you provided, including marketing by auto-dialer, pre-recorded or artificial voice, and email, from  MyGulfCoastProperty.com about real estate related matters, but not as a condition of purchase. This consent applies even if you are on a corporate, state or national Do Not Call list. Messages may be processed by an automated system. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Contact MyGulfCoastProperty.com Keller Williams St Pete 360 Central Avenue, Suite 600 St Petersburg, FL 33701 O: (727) 619-2799 E: Email Us Navigation Areas Condos Homes Lifestyles Search Contact About Buyers Sellers View All Popular Searches Beachfront Condos Intracoastal Waterfront Condos St Pete Downtown Condos Waterfront Homes 55+ Condos Accessibility | Terms of Service | Privacy Policy | DMCA Notice | Property Listings | Sitemap © Copyright 2025 My Florida Coastal Team. All Rights Reserved. Real Estate Websites by Sierra Interactive We're Here to Help Feel free to reach out any time: MyGulfCoastProperty.com Keller Williams St Pete 360 Central Avenue, Suite 600 St Petersburg, FL 33701 O: (727) 619-2799 E: Email Us Have a Question or Want a Free Market Report? Contact Us Home Blog Areas CONDOS Anna Maria To Siesta Key Pinellas County Sarasota/Bradenton Tampa All Beachfront Condos All Downtown Condos HOMES Anna Maria To Siesta Key Apollo Beach Pinellas County Sarasota/Bradenton Tampa BEACHFRONT CONDOS All Beachfront Clearwater Beach To St Pete Beach Anna Maria To Siesta Key Condos BEACH Beachfront Condos Anna Maria Island Clearwater Beach Indian Rocks Beach Indian Shores Island Estates Longboat Key Madeira Beach Redington Beach Sand Key St Pete Beach Siesta Key Treasure Island See All Beachfront MAINLAND Mainland Condos Belleair Clearwater Dunedin Gulfport Largo Sarasota Downtown Seminole St Pete Downtown St Petersburg Tampa Tampa Downtown Tarpon Springs See All Mainland Condos LIFESTYLE Condos by Lifestyle 55+ Beachfront Downtown Golf Investment Non-Flood Zone Condos Pet-Friendly Tennis Waterfront Homes BEACH Anna Maria Island Clearwater Beach Indian Rocks Beach Indian Shores Island Estates Longboat Key Madeira Beach Redington Beach St Pete Beach Treasure Island See All Beachfront Homes MAINLAND Apollo Beach Belleair Clearwater Dunedin Gulfport Largo Oldsmar Seminole St Petersburg Tampa Tarpon Springs See All Mainland Homes LIFESTYLE Homes by Lifestyle Gated Golf Non-Flood Zone Homes Tennis Waterfront Lifestyles CONDOS Beachfront Downtown Condos 55+ Golf Investment Non-Flood Zone Condos Pet-Friendly Tennis Waterfront All Lifestyle Searches HOMES Gated Golf Non-Flood Zone Homes Tennis Waterfront All Lifestyle Searches MORE LIFESTYLES Fun For Kids Things To Do Videos Search Search Tips Advanced Search Search by Map Zip Code Search Property Tracker Featured Listings Contact About Meet The Team Testimonials Get Help From A Local Expert Buyers Sellers Communities Choose Condos Choose Homes Other Get Help Questions? We're Here to Help Recently From Our Blog Waldorf Astoria Residences St. Petersburg Launch Sales – Downtown’s Tallest Luxury Tower By Rich Kisida 9/10/2025 What People Love About Clearwater Beach Condos | My Florida Coastal Team By Rich Kisida 9/5/2025 We're Here to Help Feel free to reach out any time: MyGulfCoastProperty.com Keller Williams St Pete 360 Central Avenue, Suite 600 St Petersburg, FL 33701 O: (727) 619-2799 E: Email Us Have a Question or Want a Free Market Report? Contact Us"
    },
    {
      "url": "https://www.bayougc.com/memberships/",
      "text": "Memberships - Bayou Golf Course Skip to primary navigation Skip to main content Skip to footer Facebook Bayou Golf Course Home Course Book a Tee Time Course Details Rates Memberships Events Upcoming Events Tournaments Facilities Contact Memberships Whether you have been golfing your entire life, or you have just begun to appreciate this classic game, Bayou Golf Course offers a membership option for you. Our challenging layout and friendly staff work in tandem to ensure that our members will enjoy perfecting their game and enjoying time with family and friends. Green Fee Membership Price Resident $1,050 Resident Senior 62 $700 Non Resident $1,100 Non Resident 62 $750 Family Membership Price Resident $1,575 Resident Senior 62 $1,050 Non Resident $1,650 Non Resident 62 $1,125 Members do not pay green fees all day Monday thru Friday and after 11:00 on  Saturdays, Sundays & Holidays. Members that choose to play defore 11:00 on weekends & Holidays will receive 50% off the price of a  regular green fee. All members receive complimentary range balls Membership Request Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone * Comment Submit Footer About the Course Prepare yourself for an unparalleled golfing experience. Our course is a pleasure for golfers of any skill level to play.  Test your accuracy with our fairways, water hazards and sand traps; we have everything you need to challenge you and improve your game. Weather TEXAS CITY WEATHER Contact Us 2800 Ted Dudley Dr. Texas City, Texas 77592 409-739-9622 mskiba@texas-city-tx.org Facebook Bayou Golf Course | 2800 Ted Dudley Dr. Texas City, Texas 77592 | 409-739-9622 Copyright © 2025  Bayou Golf Course All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.1golf.eu/en/club/bayou-golf-club/",
      "text": "Bayou Golf Club, Largo, FL - Albrecht Golf Guide Golf Courses Golf Hotels Golf Packages Bookshop Apps Sign in / Sign up Saved Items Deutsch English Español Italiano Albrecht Golf Guide Golf courses in North America United States Florida Bayou Golf Club 18 Hole Private Overview Course Visitors Amenities Club Reviews No image available Bayou Golf Club 7979 Bayou Club Blvd, Largo, FL 33777-3040, USA Phone: +1 727-399-1000 , Fax: +1 727-398-4364 manager7979@bayouclubgolf.com www.bayouclubgolf.com Map Save Share The Course 18-Hole Course Driving Range  &  Practice area Visitors welcome? By invitation only. Season: Year round The Course 18-Hole Course Opened in 1992. Design: Tom Fazio . Terrain: Water hazards Technical difficulty: Moderate Scorecard Tee Par CR Slope Length Gold (Men) 72 75.1 136 7085 yards Blue (Men) 72 72.1 133 6580 yards White (Men) 72 70.3 121 6139 yards Green (Men) 72 66.9 117 5518 yards Practice Facilities Driving Range Putting Green Chipping Green Visitors 18-Hole Course Reserved for members and their guests. Etiquette Softspikes required. Amenities Club Amenities Clubhouse Club accepts credit cards Pro Shop Restaurant Bar Snack Bar Beverage Cart Rentals Clubs for hire Electro-cart for hire The Club Personnel Title Name Manager Scott Gray Enlarge / get directions Nearby Courses Bardmoor Golf & Tennis Club Largo (0 km) 18 Hole 77 € / 18 Holes Seminole Lake Country Club Seminole (4.2 km) 18 Hole Fairway Village Golf Course Largo (4.9 km) 9 Hole See all User Reviews There are no user reviews yet. Been to Bayou Golf Club ? Share your experiences! Write a Review Golf Packages Tenerife, Spain Tivoli La Caleta Tenerife Resort 5 stars Very good 8,4 / 10 7 Nights 5 green fees from € 1475 per person Tenerife, Spain Hacienda del Conde Meliá Collection Golf & Spa 5 stars Wonderful 9,1 / 10 7 Nights HB unlimited golf from € 1231 per person La Gomera, Spain Hotel Jardín Tecina 4 stars Excellent 8,7 / 10 7 Nights HB 5 green fees from € 833 per person Majorca, Spain Elba Sunset Mallorca 4 stars Very good 8,2 / 10 7 Nights 5 green fees from € 855 per person Majorca, Spain VIVA Golf Adults Only 18+ 4 stars Superior Very good 8,4 / 10 7 Nights HB 5 green fees from € 1083 per person Sicily, Italy Verdura Resort 5 stars Excellent 8,8 / 10 7 Nights 4 green fees from € 1269 per person Porto Cervo, Italy Cervo Hotel, Costa Smeralda Resort 5 stars Excellent 8,8 / 10 7 Nights unlimited golf from € 1042 per person Cyprus Almyra 5 stars Very good 8,2 / 10 7 Nights 4 green fees from € 928 per person All Packages Get a €20 discount on your golf vacation with our newsletter Sign up for our newsletter and be the first to discover new golf packages, special offers, and exclusive golf tours. As a bonus, you will receive a €20 discount code for your next golf vacation. Yes, please send me the newsletter You can change your mind at any time by clicking the unsubscribe link in the footer of any newsletter you receive from us, or by contacting us at travel@albrecht.de . We will treat your information with respect. You can find details about our privacy practices here . By clicking above, you agree that we may process your information in accordance with these terms. Follow us on Instagram New Golf Guide Africa Asia Caribbean Central America Europe Middle East North America Pacific South America Golf Packages Book Golf Holiday Travel Themes Golf Round Trips Group Golf Tours Early Booking Deals Majorca Canary Islands Tuscany Algarve Andalusia Greece All Destinations Mobile App Golf Guide for iPhone Golf Guide for iPad Info Contact/Imprint Media Information Privacy Policy Terms Feedback © 2025 Albrecht Golf Verlag GmbH"
    }
  ]
}