{
  "fuentes": [
    {
      "url": "https://britishhome-ca.us/our-team-staff-board-members/",
      "email": "info@britishhome-ca.us"
    },
    {
      "url": "https://www.americantaproom.com.sg/about-us",
      "email": "info@americantaproom.com.sg"
    },
    {
      "url": "https://www.taproombeerco.com/contact",
      "email": "mgmt@sdtaproom.com"
    },
    {
      "url": "https://www.taproombeerco.com/contact",
      "email": "mgmt@taproombeerco.com"
    },
    {
      "url": "https://sltablet.com/2024/05/07/spotlight-shines-on-bbs-pourhouse-adding-flair-to-downtown-clermont/",
      "email": "rfarr47938@aol.com"
    },
    {
      "url": "https://bb-online.com/contactus.shtml",
      "email": "info@bb-online.com"
    },
    {
      "url": "https://www.pourtaphouse.com/about-us",
      "email": "info@pourtaphouse.com"
    },
    {
      "url": "https://bb-360.org/contact-us/",
      "email": "info@bbcamp.org"
    },
    {
      "url": "https://www.bbprice.co.uk/contact-us/",
      "email": "chosen-sprite@2x.png"
    },
    {
      "url": "https://www.sdtaproom.com/contact",
      "email": "mgmt@sdtaproom.com"
    },
    {
      "url": "https://www.columbiagorgenews.com/news/naked-winery-moves-to-former-pourhouse-space/article_e4159a8c-b53e-11e9-a633-eb79e1f5068b.html",
      "email": "info@gorgenews.com"
    },
    {
      "url": "https://www.forbes.com/companies/bjs-restaurants/",
      "email": "feedback@forbes.com"
    }
  ],
  "mails": [
    "chosen-sprite@2x.png",
    "feedback@forbes.com",
    "info@americantaproom.com.sg",
    "info@bb-online.com",
    "info@bbcamp.org",
    "info@britishhome-ca.us",
    "info@gorgenews.com",
    "info@pourtaphouse.com",
    "mgmt@sdtaproom.com",
    "mgmt@taproombeerco.com",
    "rfarr47938@aol.com"
  ],
  "nombre_sitio": "bbspourhouses.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://britishhome-ca.us/our-team-staff-board-members/",
      "text": "Our Team: Staff / Board Members – The British Home in California Skip to content Contact Us Jobs Admins Home About Us Our Team: Staff / Board Members Donors and Ways to Give Volunteer Opportunities History of the British Home The Cottages Admissions & Amenities Admissions Rates FAQs Events Public Events Friends & Family Activities Celebrations Ingathering DBE Ordinary people doing EXTRAORDINARY\r\nthings. Our Team: Staff / Board Members “Ordinary people doing extraordinary things” the British Home staff and board are dedicated to the mission and vision of our splendid Home. The warm, caring atmosphere of “home” generated throughout the British Home’s campus is in large part due to our staff, many who have served for a number of years, and create a natural, warm, personal connection with our resident family. Staff are given excellent training and the opportunity to improve and grow.  They all work full time and some have been with us for 5, 10, or even 20 years. Volunteering to serve on the Home’s board are citizens who genuinely care about eldercare, and appreciate that retirement living is a new beginning and one of life’s milestone decisions to be taken deliberately by all concerned parties. Our Staff Departments Include: Administration Dietary Nursing Housekeeping Activities Maintenance The Executive Board and Directors The British Home Board is made up of the Executive Board and eight directors. Download Fact Sheet Request Brochure Download Brochure We have lots of activities scheduled every month, for every type of participant! Download Event Calendar Download Weekly Menu Volunteer for The British Home Today! Volunteer Today! Donors and Ways to Give Memorial Request Form Newspapers Queen Elizabeth - Spectrum News The British Home in California, Ltd.  |  647 Manzanita Ave., Sierra Madre, CA 91024  |  License #191501668"
    },
    {
      "url": "https://www.americantaproom.com.sg/about-us",
      "text": "Who We Are | Americantaproomsg top of page Home Who We Are Beers Food ATR Rewards Beer Geek Speaks Contact More... Use tab to navigate through the menu items. ABOUT AMERICAN TAPROOM A SIMPLE IDEA American Taproom was founded by three beer enthusiasts with more than 30 years experience running busy bars, bustling restaurants, and active beer retail and distribution businesses.  We aren’t just in the beer bar business, we are in the beer business from nose to tail and we can’t wait for you to love beer as much as we do! We realized this passion by recognizing the critical importance of proper beer service, and how this comes to our customers through a team of servers with the knowledge, the love of each and every beer on tap to keep, pour, and serve not only great beer but a great beer experience! Each and every one of our servers behind the bar is a Certified Beer Server (Level 1), certified by the Cicerone Certification Program.  American Taproom also has 2 of the only 6 Certified Cicerones (Level 2) in Singapore to help curate the selection, and ensure you’re experiencing beer at its best! Bar Manager/Founder Johnny Christensen | Level 2 Certified Cicerone Coming from an extensive F&B and craft beer background in the US, Johnny is one out of the six Certified Cicerones that can be found in Singapore. He is the main figure that oversees operations at American Taproom. Johnny is also the owner of the retail craft beer store, Beer Force, that is located in Holland Village. Our Locations American Taproom, Stanley 2 Stanley St Singapore 068721 ​ +65 8809 1974 American Taproom, Geylang 71/73 Geylang Road Singapore 389195 ​ +65 8181 4267 American Taproom, Waterloo 261 Waterloo Street, #01-23 Singapore 180261 ​ +65 9632 1570 Operating Hours *Our hours may vary depending on how busy we are. Please give us a call/WhatsApp us to confirm before you visit, especially near closing hours! Monday - Thursday: 11.30am - 11.00pm Friday & Saturday: 11.30am - 12:00am Sunday: Closed Monday - Wednesday: 3pm - 12am Thursday - Sunday: 11:30am - 12am Monday - Sunday 12 noon - 12:00am info@americantaproom.com.sg © 2025 Copyright - American Taproom. All Rights Reserved. bottom of page"
    },
    {
      "url": "https://www.taproombeerco.com/contact",
      "text": "Get in Touch with Taproom Beer Co | Contact Us Today — TapRoom Beer Co 0 Skip to Content Beer Beer Guest Beer, Cocktails, Cider Wines Kegs Food Coffee Brunch Reservations Private Events Contact Contact Us Employment Gift Cards Fundraisers About PB LOCATION Open Menu Close Menu Beer Beer Guest Beer, Cocktails, Cider Wines Kegs Food Coffee Brunch Reservations Private Events Contact Contact Us Employment Gift Cards Fundraisers About PB LOCATION Open Menu Close Menu Folder: Beer Back Beer Guest Beer, Cocktails, Cider Wines Kegs Food Coffee Brunch Reservations Private Events Folder: Contact Back Contact Us Employment Gift Cards Fundraisers About PB LOCATION Visit us Sun – Thurs : 11:00 am -10:00 pm Fri & Sat : 10:00 am – 11:00pm Kitchen open until 10pm nightly. 2000 El Cajon Blvd. San Diego, CA 92104 Phone: 619-539-7738 mgmt@taproombeerco.com Hit us up! Name * First Name Last Name Email * Subject * Message * Thank you! LOCATIONS NORTH PARK 2000 El Cajon Blvd. San Diego, CA 92104 (619) 539-7738 Mon - Fri:  11am - 11pm Sat & Sun: 10am - 11pm mgmt@taproombeerco.com PACIFIC BEACH 1269 Garnet Ave, San Diego, CA 92109 (858) 274-1010 Mon – Thurs: 10:30am – 9:30pm Fri & Sat : 10am – 10pm Sun: 10:00 am – 9:30 pm mgmt@sdtaproom.com"
    },
    {
      "url": "https://sltablet.com/2024/05/07/spotlight-shines-on-bbs-pourhouse-adding-flair-to-downtown-clermont/",
      "text": "Spotlight Shines On BB's Pourhouse: Adding Flair to Downtown Clermont | South Lake Tablet Facebook Instagram Front Page Features News The South Lake Community Churches and Fellowship Clubs Community Organizations Obituaries Pets Schools Sports/Wellness Sports Wellness Business Events Upcoming Events Weekly Meetings Fundraisers Concerts and Theater Calendar of Events Submit Your Event FREE SUBSCRIPTION South Lake Business Directory Search South Lake Tablet Front Page Features News The South Lake Community Churches and Fellowship Clubs Community Organizations Obituaries Pets Schools Sports/Wellness Sports Wellness Business Events Upcoming Events Weekly Meetings Fundraisers Concerts and Theater Calendar of Events Submit Your Event FREE SUBSCRIPTION South Lake Business Directory [pro_ad_display_adzone id=\"510\"] Business Front Page Spotlight Shines On BB’s Pourhouse: Adding Flair to Downtown Clermont May 7, 2024 BB’s Pourhouse, the latest addition to Clermont’s downtown scene, officially opened its doors to the public on May 3rd. Situated at 756 W. Montrose St, within the Art Walk location, the taproom promises to be a game-changer for beer and wine enthusiasts seeking a novel drinking experience. BB’s Pourhouse stands as a complementary companion to the Black Bear Kitchen. Through new technology, guest can choose from a wide selection of beers and wines, and manage their drinks and pour sizes in a do-it-yourself experience…..no server! A corridor leads from Black Bear Kitchen to BBs Pour House. The ribbon-cutting ceremony for BBs Pourhouse and Black Bear Kitchen was presided over by the South Lake Chamber of Commerce. The event symbolized a warm welcome to the business community. Experience the fusion of tradition and innovation. For further information, contact BB’s Pourhouse at +1 863-242-3530 or visit their web at BBs Pourhouse. TAGS BBs Pourhouse/Black Bear Kitchen Facebook Twitter Email Previous article Lake-Sumter State College Sixty-Ninth Commencement: Transforming Lives And Futures Across Lake And Sumter Counties Next article A Night to Remember at Prom 2024’s Masquerade Ball at Disney’s Epcot Michelle Delaney RELATED ARTICLES MORE FROM AUTHOR Clubs Planting Knowledge In The Community: Plants For Cooper Memorial Library And Clermont City Hall Churches and Fellowship New Beginnings Pantry in Urgent Need of Donations Events Cops N’ Cones for Kids: A Sweet Day of Community Fun (Sept 22) Current Month september VFW Bingo VFW Post 5277 855 W. DeSoto St 07 mar (mar 7) 6:30 pm 26 dec (dec 26) 9:30 pm VFW Bingo Event Details VFW 855 W. Desoto St. Clermont Fla. 34711 DOWNSTAIRS\nBingo starts at 6:30 doors open at 5 PM all are welcome.\n😊WE ROLLED BACK OUR PRICES TO 10 YEARS AGO.\nFood and beverages Event Details VFW 855 W. Desoto St. Clermont Fla. 34711 DOWNSTAIRS Bingo starts at 6:30 doors open at 5 PM all are welcome. 😊WE ROLLED BACK OUR PRICES TO 10 YEARS AGO. Food and beverages are available. NO SMOKING come make a friend or be one. 50/50 with 3 prizes Time March 7 (Friday) 6:30 pm - December 26 (Friday) 9:30 pm Location VFW Post 5277 855 W. DeSoto St Organizer Veterans of Foreign Wars post 5277 Bob Farrell 855 W. Desoto Street Clermont Florida 34711 Calendar GoogleCal VFW Bingo VFW Post 5277 855 W. DeSoto St 25 apr (apr 25) 6:30 pm 13 feb (feb 13) 9:30 pm VFW Bingo Event Details VFW 855 W. Desoto St. Clermont Fla. 34711 DOWNSTAIRS\nBingo starts at 6:30 doors open at 5 PM all are welcome.\n😊WE ROLLED BACK OUR PRICES TO 10 YEARS AGO.\nFood and beverages Event Details VFW 855 W. Desoto St. Clermont Fla. 34711 DOWNSTAIRS Bingo starts at 6:30 doors open at 5 PM all are welcome. 😊WE ROLLED BACK OUR PRICES TO 10 YEARS AGO. Food and beverages are available. NO SMOKING come make a friend or be one. 50/50 with 3 prizes Time April 25 (Friday) 6:30 pm - February 13 (Friday) 9:30 pm Location VFW Post 5277 855 W. DeSoto St Organizer Veterans of Foreign Wars post 5277 Bob Farrell 855 W. Desoto Street Clermont Florida 34711 Calendar GoogleCal Clermont City Council Meetings Clermont City Hall 685 West Montrose St. 09 sep 3:00 pm Clermont City Council Meetings Event Details https://clermontfl.portal.civicclerk.com\n\nClermont City Council meetings are held the second and fourth Tuesday of the month at 3 pm Event Details https://clermontfl.portal.civicclerk.com Clermont City Council meetings are held the second and fourth Tuesday of the month at 3 pm Time (Tuesday) 3:00 pm Location Clermont City Hall 685 West Montrose St. Calendar GoogleCal Franchises - An Easier Way to Becoming Your Own Boss Mid-Florida SCORE Webinar presentations 10 sep 10:00 am 11:30 am Franchises - An Easier Way to Becoming Your Own Boss Helping Build and Repair Your Credit Mid-Florida SCORE Webinar presentations 10 sep 12:00 pm 1:00 pm Helping Build and Repair Your Credit 4CCDC club meeting Online Online 10 sep 6:30 pm 7:30 am 4CCDC club meeting Event Details The 4 Corners Clermont Democratic Club (4CCDC) meets virtually on the 2nd Wednesday of every month from 6:30 to 7:30 pm on Zoom. 4CCDC represents the residents of South Lake Event Details The 4 Corners Clermont Democratic Club (4CCDC) meets virtually on the 2nd Wednesday of every month from 6:30 to 7:30 pm on Zoom. 4CCDC represents the residents of South Lake County fighting for equal opportunities, families and justice. Everyone is invited to attend to hear great guest speakers, meet candidates and learn about issues that affect us all. Our next meeting is February 8, 2023. Sign up at: mobilize.us/LakeCountyDEC/event/544981 Facebook.com/4CCDC or Twitter.com/$CCDemClub. Time (Wednesday) 6:30 pm - 7:30 am Location Online Online Organizer 4CCDC Diane Ferriter 16201 Egret Hill St, Clermont, FL Calendar GoogleCal Sept 11 Memorial Ceremony Clermont Arts and Recreation Center 3700 S US Hwy 27, Clermont, FL 34711 11 sep 10:00 am Sept 11 Memorial Ceremony Event Details Join the Clermont Fire Department and the Clermont Police Department for their Annual September 11 Memorial Ceremony. \n\nTogether, they will honor and remember the lives lost and the heroic actions of Event Details Join the Clermont Fire Department and the Clermont Police Department for their Annual September 11 Memorial Ceremony. Together, they will honor and remember the lives lost and the heroic actions of first responders on that tragic day Time (Thursday) 10:00 am Location Clermont Arts and Recreation Center 3700 S US Hwy 27, Clermont, FL 34711 Calendar GoogleCal Recent Articles Planting Knowledge In The Community: Plants For Cooper Memorial Library And Clermont City Hall September 9, 2025 New Beginnings Pantry in Urgent Need of Donations September 9, 2025 Cops N’ Cones for Kids: A Sweet Day of Community Fun (Sept 22) September 8, 2025 South Lake High School Game Results/Summary September 8, 2025 Exhale Hookah Lounge Brings Big City Vibes to Clermont September 8, 2025 Article Categories Business Churches and Fellowship Clubs Community Organizations Concerts and Theater Events Features Front Page Front Page Featured Fund Raisers Health Meetings News Obituaries Pets Schools Sports Wellness The South Lake Community Uncategorized Copyright © 2022-2024 - South Lake Tablet - A Buena Vista Publishing Company. All Rights Reserved. X X"
    },
    {
      "url": "https://bb-online.com/contactus.shtml",
      "text": "Contact Us / About Us - BB Online International domain registration and IP protection since 1997 Control Panel View Your Basket Currency Currency $ AUD kr DKK € EUR £ GBP $ NZD kr SEK $ USD R ZAR Support: +44 (0)1582 572148 (Standard rate call) Home Domains Domain Type Domains A-Z Global Top Level Country Code Regions, Cities & Places IDN Domains Arabic (النصي) Chinese (脚本) Cyrillic (скрипт) Japanese (スクリプト) Korean (스크립트) Regional Domains Europe America Asia Africa Oceania / Pacific Caribbean Island New Top Level Domains Live Sunrise/Landrush/GA Not yet Live Closed - Private Domains Intellectual Property Packages Protection Packs Essential Protection Extra Protection Encyclopædia Data Sheets IANA Delegation Info. General Info. Registration Info. Register Register Renew IDN Domains Back Order Prices Domains Domains A - Z (by suffix) Domains A - Z (by country) New Top Level Internationalised Domains CCTld Backorders New Gtld Backorders Geographically European American Asian African Oceanian Caribbean Islands Services Redemption Request a Quotation Intellectual Property Packages Web site Hosting Email Hosting Domain Transfers Sales Quote Services Domains Renew Back Order Domain Administration Domain Transfers Diagnose Request a Quotation Everything Included Intellectual Property IP Monitoring Protected Marks Lists Intellectual Property Packages Portfolio Assistance Other Hosting Caveat emptor DNS Security Extensions ERRP & ICANN Affiliate scheme Whois Lookups RDAP Lookups Login Domain Control Panel Account Panel Help Affiliate scheme DNS Security Extensions Domain Administration Our use of Cookies Privacy Policy Questions Answered Talk to Us Whois Lookups Domain Control Panel Account Panel Talk to Us About Us Who we are Our Memberships What our customers say Service Levels Let us know Talk to Us Report Abuse Make a complaint Feedback Terms T&Cs Registry T&Cs Media BB Online Blog Blog Twitter Contact Information BB Online PO Box 2162 Luton Bedfordshire LU3 2YT United Kingdom Tel : +44 (0)1582 572148 Fax : +44 (0)1582 585057 Support : support@bb-online.com Accounts : info@bb-online.com Tel Pages : bbonline.tel Response Times : Telephone : Please telephone us and speak to one of our team for immediate support. Email : Please email us if you do not require immediate support, we endeavour to respond to all email queries within 8 hours. Depending on the volume emails our response time may vary, but we will reply within 2 working days. Acknowledgements Flag Icons Provided by FAM FAM FAM ( http://www.famfamfam.com ) Additional Content In places content in this site is supplemented by data from Wikipedia. It is licensed under the GNU Free Documentation License , Wikipedia . Navigation Menu Home Register Domains The Domain List Internationalised Domains Internationalised Name Converter New Top Level Domains Prices Request a Quotation Services Recover a domain Intellectual Property Packages Portfolio Assistance Transfer Diagnose Affiliate Scheme Web Packages Email Packages Whois Lookups Questions Answered Terms & Conditions Encyclopædia Factsheets by Country Code Delegation Information General Information Registration Information DNS Security Extensions ICANN Resources Resources Talk to Us Who we are Talk to us Memberships What our customers say Login Control Panel Domain Renewal Home Top Questions Answered Who we are Terms & Conditions Talk to us PO Box 2162, Luton, Bedfordshire, LU3 2YT, UK. Registered in England & Wales No. 3458098 VAT: GB 707 122 077 ©1997-2024 Copyright BB Online UK Limited, International Domain Registrars, Reproduction partial or otherwise is strictly prohibited. BB Online ® , Domain Recover ® , Domain Trace ® are registered Trademarks of BB Online UK Ltd."
    },
    {
      "url": "https://www.pourtaphouse.com/about-us",
      "text": "About Us | Pour Tap House HOME EVENTS ON TAP MENU ON TAP COCKTAILS SPIRITS TO GO BEER AND COCKTAILS WINE, CANS, GLUTEN FREE SODAS, N/A, SNACKS ABOUT CONTACT Get in touch 555-555-5555 info@pourtaphouse.com EVENTS ON TAP MENU ON TAP COCKTAILS SPIRITS TO GO BEER AND COCKTAILS WINE, CANS, GLUTEN FREE SODAS, N/A, SNACKS ABOUT CONTACT CONTACT US ABOUT POUR TAP HOUSE Mission Our mission is to provide the community an exceptional environment to socialize, relax and interact with one another while enjoying a wide selection of beers, craft seasonal cocktails, and an envious selection of bourbon … one \"Pour\" at a time. Who We Are Pour is a craft beer tap house with 30 draft lines focusing on the best beer we can source. We feature local, national, and global breweries on constant rotation. Our high-end whiskey selection features the world's best distilleries. We also have a passion for creating perfectly-crafted cocktails. We've been nominated for best cocktails in Denver and make one of the best Old Fashioned's in Colorado. Feel free to talk to any of our bartenders about your pallet preferences for a beer or cocktail recommendation. Food isn't our specialty so we allow you to bring your favorite food in, or dine from one of the quality food trucks we invite to our neighborhood almost nightly. We look forward to seeing you at Pour and will gladly host any type of social gathering you can dream up. Contact us to inquire about renting our mezzanine or entire bar to host your event. What People are saying.... Something for Everyone \" Pour Tap House truly has a wide variety of beers, especially styles of beer from so many local breweries (not just the crowd favorites). They also have an extensive bourbon and whisky list, plus killer cocktails. Meaning there is actually something for everyone \" - Liv R MashIt Hidden Gem \" I found this little Gem.... Great selection of local beers. Great Bourbon selection. Mary was a sweet, cute and interesting person. They open the garage door and the breeze came in and it was amazing. If you have a few hours of spend before you go to the airport, this is your spot. \" - Bruno FabuFit Cool Little Spot \" A cool little spot for drinks, came here with my brother and his friend. I ordered a old fashion and a whiskey sour I forgot the name. Delicious drinks and well priced. \" - Anton YesSuits Opening HOURS OPEN HOURS Mon - Wed 4:00 pm - 10:00 pm Thursday 4:00 pm - 11:00 pm Friday 2:00 pm - 12:00 am Saturday 1:00 pm - 12:00 am Sunday 1:00 pm - 9:00 pm HOME EVENTS ON TAP MENU ON TAP COCKTAILS SPIRITS TO GO BEER AND COCKTAILS WINE, CANS, GLUTEN FREE SODAS, N/A, SNACKS ABOUT CONTACT PRIVACY POLICY NAVIGATION © 2025 All Rights Reserved | Pour Tap House ADDRESS 720-460-1611 info@pourtaphouse.com 12433 E 104th Place #102 Commerce City, CO 80022 Website by Bryt•Idea Consulting LLC CONNECT Are a Loyalty member? Download the Clover App and Start earning rewards. Apple App Store | Google Play Share by:"
    },
    {
      "url": "https://bb-360.org/contact-us/",
      "text": "Contact Us  - BB360 I am here to... Register for camp Work for Camp Rent Camp Donate Camps BB CAMP About BB Camp Dates & Rates Camp Activities Location Grants & Financial Aid New Camper Guide Parent Manual BB DAY CAMPS About BB Day Camp Dates & Rates Grants & Financial Aid BB Day Camp Parent Manuals Family Camps ADULT CAMPS Divorce and Discovery Last day of Camp Men’s Camp ReJewvenation Work for Camp Programs Youth Programs BB B’nai Mitzvah PJ Library School Break Camps Teen Programs BBYO BB B’nai Mitzvah Staff In Training Summer Leadership Programs Service Programs Lincoln County Food Program Events About Us BB360 About BB360 Staff & Board of Directors Impact Report Our History Men’s Camp The History of BB Camp Rent Camp Careers Work for BB360 Work for BB Camp Shop Our Swag Shop Contact Us Ways to give Giving Make a donation Buy a Paver Etz Chaim Legacy Society Second Century Fund Drive Volunteer Search BB360 Office Hours and Contact Info Office Address 6443 SW Beaverton-Hillsdale Hwy, Suite 234, Portland, OR 97221 Phone and Fax Phone: 503-496-7444 Fax: 503-452-0750 Email info@bbcamp.org BB Camp Phone 503-452-3443 (during the year only) BB Day Camp Phone 503-496-7447 Click here for a full staff list and phone numbers BB Camp Office Hours and Contact Info Hours (During Summer Season) Monday-Friday: 8:30 AM to 6:00 PM Saturday: Closed for Shabbat Sunday: 8:30 AM to 6:00 PM Phone 541-994-2218 Fax 503-452-0750 We check phone messages frequently when the office is closed, including evenings and throughout Shabbat. Have Questions? Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone Number Comment or Message Send Camp Mailing Address For the safety of our Campers, we do not share our location. Please address mail as follows: Campers Name and Grade in Fall BB Camp P.O. Box 110 Neotsu, OR 97364 contact us if you’re interested in visiting camp SIGN UP FOR CAMP BB Overnight Camp BB Day Camp Family Camps Leadership Programs WORK WITH US Work for Camp Work for BB360 DISCOVER MORE Make a Donation Events Rent Camp Volunteer Contact Us Privacy Policy Tax ID#: 91-1842787 Supported By The B’nai Brith Mens Camp Association, a 501(c)(3) Oregon non-profit, supports BB360. Register for Camp Returning Campers New Campers I have a question about Overnight Camp Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone Number Comment or Message Send Day Camps Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone Number Comment or Message Send BBYO/Teen programming Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone Number Comment or Message Send Year-round Youth & Family Events Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone Number Comment or Message Send Donations Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone Number Comment or Message Send Adult Events Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone Number Comment or Message Send Other Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone Number Comment or Message Send Copyright © 2025 BB360 - All rights reserved"
    },
    {
      "url": "https://www.bbprice.co.uk/contact-us/",
      "text": "Get In Touch | Contact Us | B.B. Price Skip to content +44 (0)1384 413341 Twitter Link Linkedin Link YouTube Logo About Us Company History Meet The Team Quality & Approvals Sectors Rail Power Lines Other Processes Steel Fabrications Forging Drop Forging Hand Forging Upset Forging Galvanizing Shot Blasting Laser Cutting Pressings Angle Line Threading Products Crossarms Eye Bolts Eye Nuts Insulator Pins Shackles Turnbuckles U Bolts Harris (Steels) Limited Latest News Contact Us About Us Company History Meet The Team Quality & Approvals Sectors Rail Power Lines Other Processes Steel Fabrications Forging Drop Forging Hand Forging Upset Forging Galvanizing Shot Blasting Laser Cutting Pressings Angle Line Threading Products Crossarms Eye Bolts Eye Nuts Insulator Pins Shackles Turnbuckles U Bolts Harris (Steels) Limited Latest News Contact Us +44 (0)1384 413341 Twitter Link Linkedin Link YouTube Icon Get In Touch Contact us today! You're not going to be left to fend off an outrageously long phone menu; You're not going to be placed on hold for an eternity; and Your enquiry isn't going to be lost in the abyss, never to be seen again. We value your time and therefore we aim to provide an exceptional customer experience that we would want to receive ourselves! Contact Us Name * Email * Phone Department * Sales Accounts Quality Technical Job Vacancies Other Please enter Your Enquiry * CAPTCHA Corngreaves Road (Head Office) Unit 1 City Estate, Corngreaves Road, Cradley Heath, West Midlands, B64 7EP Tel: 01384 413 341 Fax: 01384 413 311 Newtown Street (Fabrications Dept.) Newtown Street, Cradley Heath, West Midlands, B64 5LB Tel: 01384 413 341 Fax: 01384 413 311 Rumbow Works (Forging Dept.) Rumbow, Halesowen, West Midlands, B63 3HU Tel: 0121 550 1018 Fax: 0121 501 3834 Lodgefield Road (Central Distribution) Lodgefield Road, Halesowen, West Midlands, B62 8AX Tel: 0121 559 1041 Fax: 0121 559 0429 Contact Contact Us +44 (0)1384 413341 Find Us Find Us About Us Company History Sectors Quality & Approvals FAQs Company Policies Brexit Statement Dignity at Work Diversity Equity and Inclusion Modern Slavery & Human Trafficking Statement Privacy Statement Sexual Harassment Prevention Process Fabrications Forging Galvanizing Laser Cutting Pressings Threading News Blogs News YouTube Link Twitter Link Linkedin Link © 2025 All Rights Reserved  |  B.B. Price Limited We are using cookies to give you the best experience on our website. You can find out more about which cookies we are using or switch them off in settings . Accept Close GDPR Cookie Settings Privacy Overview Strictly Necessary Cookies 3rd Party Cookies Powered by GDPR Cookie Compliance Privacy Overview This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping our team to understand which sections of the website you find most interesting and useful. Strictly Necessary Cookies Strictly Necessary Cookie should be enabled at all times so that we can save your preferences for cookie settings. Enable or Disable Cookies Enabled Disabled 3rd Party Cookies This website uses Google Analytics to collect anonymous information such as the number of visitors to the site, and the most popular pages. Keeping this cookie enabled helps us to improve our website. Enable or Disable Cookies Enabled Disabled Enable All Save Settings"
    },
    {
      "url": "https://www.sdtaproom.com/contact",
      "text": "Get in Touch with SD TapRoom | Contact Us Today — SD TapRoom 0 Skip to Content Beer Draft List Bottles Wine & more Pliny the Younger Food Brunch Brewery (North Park) Reservations Private Events Contact Contact Us Employment Fundraiser Hosting Gift Cards About About Events Press Open Menu Close Menu Beer Draft List Bottles Wine & more Pliny the Younger Food Brunch Brewery (North Park) Reservations Private Events Contact Contact Us Employment Fundraiser Hosting Gift Cards About About Events Press Open Menu Close Menu Folder: Beer Back Draft List Bottles Wine & more Pliny the Younger Food Brunch Brewery (North Park) Reservations Private Events Folder: Contact Back Contact Us Employment Fundraiser Hosting Gift Cards Folder: About Back About Events Press Visit us 1269 Garnet Ave. San Diego, CA 92109 (6 blocks from the beach) mgmt@sdtaproom.com // (858) 274-1010 Hours Mon – Thurs: 10:30am – 11:00pm Fri & Sat : 10:00am – 12:00am Sun: 10:00am – 11:00pm Kitchen Hours Mon – Thurs: 10:30am – 9:30pm Fri & Sat : 10:00am – 10:00pm Sun: 10:00am – 9:30pm Brunch Hours Sat & Sun 10:00 am – 1:00 pm Hit us up! Name * First Name Last Name Email * Subject * Message * Thank you! LOCATIONS PACIFIC BEACH 1269 Garnet Ave. San Diego, CA 92109 (858) 274-1010 Mon – Thurs: 10:30am – 11:00pm Fri & Sat : 10:00am – 12:00am Sun: 10:00am – 10:00 pm Pizza Delivery in Mission Beach Pizza Delivery in Pacific Beach NORTH PARK 2000 El Cajon Blvd. San Diego, CA 92104 (619) 539-7738 Mon - Friday:  11:00am - 11:00pm Sat & Sun: 10:00am - 11:00pm Subscribe Stay informed, deals, discounts, etc. Email Address Sign Up Thank you! Check your email to confirm subscription. Copyright © 2025 TapRoom Beer Company. All Rights Reserved. Privacy Policy"
    },
    {
      "url": "https://www.columbiagorgenews.com/news/naked-winery-moves-to-former-pourhouse-space/article_e4159a8c-b53e-11e9-a633-eb79e1f5068b.html",
      "text": "Please wait while we attempt to load the requested page"
    },
    {
      "url": "https://www.forbes.com/companies/bjs-restaurants/",
      "text": "BJ's Restaurants | BJRI Stock Price, Company Overview & News Newsletters Games Share a News Tip Featured Featured America's Top Next-Gen Wealth Advisors | Paid Program Student Visionaries: Celebrating Teen Leaders Raising Money To End Blood Cancers | Paid Program Best-In-State Top Next-Gen Wealth Advisors 2025 Breaking News White House Watch Daily Cover Stories AI’s Nuanced Impact And A Quest To Quantify It DNA of Success Embracing And Bracing For AI Facing A Volatile Market, C-Suites Look To The CFO For Strategic Guidance Your Four-Part Blueprint To Unlock AI Value In 2025 | Paid Program By The Numbers: Meet The Forbes 30 Under 30 Europe Class Of 2025 Dell Technologies BrandVoice | Paid Program Scaling AI Get Your Data AI-Ready | Paid Program QUIZ: Are You Making The Most Of Your Retirement Plan? | Paid Program Shaping The Future-Ready Mobility: In Conversation With JLR And TCS | Paid Program The Pacesetter Playbook: An Executive’s Guide To  Advancing Enterprise AI | Paid Program Next Billion-Dollar Startups 2025 CXO Spotlight: The Executive's Guide to AI Video Series Billionaires Billionaires See All World's Billionaires Forbes 400 America's Richest Self-Made Women China's Richest India's Richest Indonesia's Richest Korea's Richest Thailand's Richest Japan's Richest Australia's Richest Taiwan's Richest Singapore's Richest Philippines' Richest Hong Kong's Richest Malaysia's Richest Money & Politics Innovation Innovation See All Workflow Collaboration Enterprise AI AI Agentic AI Big Data Cloud Cloud 100 Consumer Tech Creator Economy Cybersecurity Digital Transformation Enterprise Tech Future Of Work Gaming Healthcare Innovation Rules Retail Industry SAP BrandVoice | Paid Program Science Social Media Sustainability & Climate Transportation Venture Capital Technology TikTok BrandVoice | Paid Program Metronome BrandVoice | Paid Program Leadership Leadership See All Under 30 C-Suite CEO Network CFO Network CHRO Network CIO Network CMO Network Leadership Strategies Careers Education Featured Partners Deloitte BrandVoice SAP BrandVoice Stand Together BrandVoice First Tee BrandVoice Dell Technologies BrandVoice Forbes EQ | Paid Program ForbesBLK Forbes Research ForbesWomen Money Money See All Banking & Insurance ETFs & Mutual Funds Fintech Hedge Funds & Private Equity Investing Investor Hub Markets Personal Finance Retirement Taxes Top Advisor | SHOOK Wealth Management Forbes Digital Assets Forbes Digital Assets See All News Crypto Prices NFT Prices Research Learn Crypto Basics BTC DeFi Web3 Education NFTs Crypto Investments Events Crypto Portfolios Business Business See All Aerospace & Defense Energy Food & Drink Hollywood & Entertainment Law Manufacturing Media Policy Retail SportsMoney Entertainment Digest Small Business Small Business See All Entrepreneurs Franchises Small Business Strategy Lifestyle Lifestyle See All Arts Boats & Planes Cars & Bikes Dining ForbesLife Forbes Travel Guide Spirits Style & Beauty Travel Vices Watches Real Estate Real Estate See All Commercial Real Estate Forbes Global Properties Residential Real Estate Forbes Vetted Forbes Vetted See All Mattress & Sleep Bed Frames Mattresses Mattress Toppers Pillows Sheets & Bedding Sleep Products Home Bathroom Cleaning & Laundry Decor Furniture Heating & Cooling Hobbies Home Office Kitchen & Dining Outdoor Pets Storage & Organization Tools Wine & Bar Fashion Accessories Clothing Eyewear Footwear Jewelry Handbags & Purses Lingerie & Sleepwear Outdoor & Fitness Apparel Outerwear Watches Kids & Baby Gear Baby Gear Kids Clothes & Accessories Nursery Pregnancy & Postpartum Toys & Books Gear Apparel & Accessories Bikes Camping & Hiking Climbing Fishing & Hunting Fitness Golf Running Tennis & Racket Sports Tools & Tech Training & Recovery Water Sports Wellness Winter Sports Beauty & Grooming Haircare Makeup Nailcare Shaving Skincare Personal Products Wellness & Self Care Tech & Electronics Audio Cameras Computers, Tablets & Accessories Gaming Home Office Online Tools Smart Home Devices Smartphones, Smartwatches & Accessories Streaming TVs Travel Cruises Hotels & Lodging Luggage Travel Products Gifts Father's Day Holiday Mother's Day Valentine's Day Wedding Deals Coupons Black Friday Cyber Monday Amazon Prime Day Beauty & Grooming Big Sales Fashion Gear Home Tech & Electronics Travel Deals Mattress & Sleep Coupons Coupons See All Most Popular Macy's Zappos Vivid Seats SeatGeek Groupon DoorDash Stubhub Shutterfly Fashion H&M Nordstrom Zenni Optical Neiman Marcus Shopbop Ulta Beauty Zales Jos. A. Bank Software & VPNs NordVPN ExpressVPN Surfshark Squarespace Norton QuickBooks VistaPrint TurboTax Electronics Samsung Verizon Sonos Newegg Lenovo B&H eBay HP Sportswear & Gear adidas Nike Dick's Sporting Goods HOKA New Balance Athleta Alo Yoga RTIC Mattress & Sleep Mattress Firm Purple Mattress Bear Mattress Brooklinen Nectar Avocado Mattress Nolah Brooklyn Bedding Travel Booking.com Hotels.com Emirates Expedia Away Hilton Priceline Great Wolf Lounge Home & Garden Walmart Wayfair Edible Arrangements Instacart The Home Depot Lowe's Frontgate Total Wine View All Stores Lists Lists See All 30 Under 30 50 Over 50 Top Colleges Advisor Advisor See All Credit Cards Best Credit Cards Travel Credit Cards 0% APR Credit Cards Balance Transfer Credit Cards Business Credit Cards Best First Credit Card Mortgages & Loans Best Mortgage Lenders Mortgage Refinance Lenders Personal Loans Business Loans Bad Credit Loans Debt Consolidation Loans Debt Relief Companies Student Loans Refinance Private Student Loans Banking Best CD Rates High Yield Savings Accounts Money Market Accounts Checking Accounts Business Checking Accounts Budgeting Apps Best Online Banks Insurance Health Insurance Companies Medicare Life Insurance Companies Best Car Insurance Companies Cheapest Car Insurance Companies Pet Insurance Companies Travel Insurance Companies Homeowners Insurance Companies Business Services How to Start a Business LLC Services Payroll Services HR Software HRIS Systems PEO Services Applicant tracking Systems Domain Registrars Hosting Services Website Builders Ecomm Platforms Landing Page Builders VOIP Services Answering Services Project Management Software Task Management Software Gantt Chart Software VPNs Anti Virus Software Password Managers Home Services Moving Companies Long Distance Moving Companies Car Shipping Companies Home Warranty Companies Solar Companies Solar Panels Home Security Companies Home Security Systems Internet Providers Cheapest Internet Providers Fastest High Speed Internet Providers Pest Control Companies Education Forbes Advisor UK Forbes Advisor CA Forbes Advisor AU Health Health See All Mental Health Best Online Therapy Online Therapy that Takes Insurance Online Psychiatrists Best Online Dating Sites & Apps Best Senior Dating Sites Best LGBTQ Dating Sites CBD CBD Gummies CBD Oil CBD Creams CBD for Anxiety CBD for Pain Supplements Protein Powder Preworkout Collagen Powders Creatine Supplements CoQ10 Supplements Hearing Health Best Hearing Aids OTC Hearing Aids Affordable Hearing Aids Medical Devices Best Medical Alert Systems Best Medical Alert Systems with Fall Detection Diet & Weight Loss Best Weight Loss Plans Newsletters Newsletters See All Forbes Daily Editorial Newsletters Forbes Games Forbes Games See All Frase by Forbes Pinpoint by LinkedIn Queens by LinkedIn Crossclimb by LinkedIn More From Forbes More From Forbes Forbes Video Forbes 101 Forbes Magazine Forbes Asia Free Issue of Forbes © 2025 Forbes Media LLC. All Rights Reserved. Advertise with Forbes Forbes Licensing & Syndication Report a Security Issue Editorial Values and Standards Site Feedback Contact Us Careers at Forbes Tips Corrections Privacy Do Not Sell My Personal Information Terms AdChoices Reprints & Permissions Get in Touch Get In Touch With BJ's Restaurants Get In Touch PROFILE upgrade profile Upgrade To Receive Expanded Profile Features BJ's Restaurants BJRI Huntington Beach, California $32.81 -0.74 (-2.21%) Share Price as of September 9 4:00:00 PM EST Upgrade to gain access to exclusive features and add your profile photo. Learn More Forbes does not accept payment for placement on lists. From the Editor BJ's Restaurants, Inc. (BJ's) owns and operates 103 restaurants located in 13 states (California, Texas, Arizona, Colorado, Oregon, Nevada, Florida, Ohio, Oklahoma, Kentucky, Indiana, Louisiana and Washington) as March 4, 2011. BJ's restaurants operate either as a BJ's Restaurant & Brewery, which includes a brewery within the restaurant, a BJ's Restaurant & Brewhouse, which receives the beer it sells from one of its breweries or an approved contract brewer of its recipe beers (contract brewer), or a BJ's Pizza & Grill, which is a smaller format, full-service restaurant with a more limited menu... Read More BJ's Restaurants, Inc. (BJ's) owns and operates 103 restaurants located in 13 states (California, Texas, Arizona, Colorado, Oregon, Nevada, Florida, Ohio, Oklahoma, Kentucky, Indiana, Louisiana and Washington) as March 4, 2011. BJ's restaurants operate either as a BJ's Restaurant & Brewery, which includes a brewery within the restaurant, a BJ's Restaurant & Brewhouse, which receives the beer it sells from one of its breweries or an approved contract brewer of its recipe beers (contract brewer), or a BJ's Pizza & Grill, which is a smaller format, full-service restaurant with a more limited menu than its other restaurants. The Company's menu features its deep-dish pizza, its own handcrafted beers, as well as a selection of appetizers, entrees, pastas, sandwiches, specialty salads and desserts, including its Pizookie dessert. Its BJ's Restaurant & Brewery restaurants feature in-house brewing facilities where BJ's handcrafted beers are produced for some of its restaurants. Read Less BJ's Restaurants Stats As of August 2025 Industry Restaurants Founded 1978 Headquarters Huntington Beach, California Country/Territory United States Interim CEO and Director C. Bradford Richmond Employees 20,000 Forbes Lists #69 America's Best Employers By State (2025) Restaurants BJ's Restaurants (BJRI) Stock Price Performance BJ's Restaurants (BJRI) Stock Key Data Summary Additional Data Analysts Historical Quotes Key Data Previous Close 33.55 Open 33.33 Day’s Range 32.61 x 33.48 Volume 500,496 52 Week Range 27.89 x 47.02 Market Cap $725.89M P/E Ratio (ttm) 28.02 Forward P/E 14.48 Diluted EPS (ttm) 1.17 Dividends Per Share N/A Dividend Yield N/A Ex-Dividend Date Nov 7, 2019 Valuation Measures P/E Ratio (ttm) 28.02 Forward P/E 14.48 Price to Sales (ttm) 0.54 Price to Book Value (ttm) 1.88 Price to Tangible Book Value (ttm) 1.91 Total Enterprise Value to EBIT (ttm) 24.72 Total Enterprise Value to EBITDA (ttm) 6.41 Total Enterprise Value to Total Revenue (ttm) 0.85 Markets data provided by S&P and by Xignite Profitability Metrics Gross Margin (ttm) 15.08% Operating Margin (ttm) 3.47% Net Margin (ttm) 1.99% Return on Assets (ttm) 2.90% Return on Equity (ttm) 7.12% Revenue and Earnings Metrics Revenue (ttm) $1.38B Revenue Per Share (ttm) 60.95 Revenue Growth (y/o/y) 4.07% EBITDA (ttm) $121.79M EBITDA Growth (y/o/y) 19.78% Diluted EPS (ttm) 1.17 Diluted EPS Growth (y/o/y) -4.07 Cash and Debt Metrics Total Cash $25.96M Total Cash Per Share 1.17 Total Debt $477.66M Total Debt/Equity 123.57% Current Ratio 0.38 All values as of most recently reported quarter unless otherwise noted. Markets data provided by S&P and by Xignite Consensus Recommendation Hold Consensus Price 42.33 Range of Price Targets 37.00 to 50.00 Range of EPS 1.98 to 2.74 Consensus EPS 2.27 Consensus Revenue $1.42B Range of Revenue $1.41B to N/A Consensus Price Target is the stock price analysts expect to see within a period of 0-18 months. EPS and Revenue estimates are for the next 12 months. Markets data provided by S&P and by Xignite DATE OPEN HIGH LOW CLOSE ADJUSTED CLOSE VOLUME Sep 9, 2025 33.33 33.48 32.61 32.81 32.81 5,004 Sep 8, 2025 33.68 34.09 33.09 33.55 33.55 550,513 Sep 5, 2025 34.06 34.56 33.40 33.56 33.56 488,777 Sep 4, 2025 33.85 34.11 33.59 33.90 33.90 513,452 Sep 3, 2025 33.01 34.08 33.01 33.85 33.85 802,311 Sep 2, 2025 33.19 33.59 32.95 33.16 33.16 426,441 Aug 29, 2025 33.84 33.88 33.17 33.56 33.56 468,579 Aug 28, 2025 34.23 34.37 33.33 33.69 33.69 518,492 Aug 27, 2025 33.92 34.50 33.92 34.22 34.22 573,178 Aug 26, 2025 33.77 34.43 33.72 34.27 34.27 529,116 Markets data provided by S&P and by Xignite Related People & Companies Los Angeles Clippers Located in Los Angeles-Long Beach-Santa Ana, CA Metropolitan Area View Profile Los Angeles Dodgers Located in Los Angeles-Long Beach-Santa Ana, CA Metropolitan Area View Profile Los Angeles Lakers Located in Los Angeles-Long Beach-Santa Ana, CA Metropolitan Area View Profile Red Robin Gourmet Burgers Related by Industry: Restaurants View Profile Ron Shaich Company Stakeholder View Profile More on Forbes 27 minutes ago NHL Goalie Dustin Wolf Commits To Calgary Flames With 7-Year Extension Calgary Flames GM Craig Conroy continues to lock up his young core, inking goalie Dustin Wolf to a seven-year extension on Tuesday. By Carol Schram Senior Contributor 1 hour ago Toronto Film Festival: Sydney Sweeney Boxes Free Of Her Jeans-Ad Thing Hard on the heels of Venice, the brawny Toronto Film Festival has opened with a fine cast of red-carpet runners and baying packs of coursing-dog paparazzi. Here's what's cool. By Guy Martin Senior Contributor 1 hour ago Naoya Inoue Vs. Murodjon Akhmadaliev Fight Card: Date, Time, Location Everything you need to know about Sunday's Naoya Inoue Vs. Murodjon Akhmadaliev boxing fight card, including event date, time, location, and streaming info. By Trent Reinsmith Contributor 2 hours ago $50 Billion Copper Merger Could Spark Bigger Mining Deals Canada's Teck Resources and London-listed Anglo American have agreed to a merger of equals which will create one of the world's biggest copper producers By Tim Treadgold Contributor 2 hours ago Today’s Wordle #1544 Hints And Answer For Wednesday, September 10th Looking for help with today's New York Times Wordle? Here are some expert hints, clues and commentary to help you solve today's Wordle and sharpen your guessing game. By Erik Kain Senior Contributor 2 hours ago The Bizarre Ending Of ‘The Conjuring: Last Rites,’ Explained ‘The Conjuring: Last Rites’ closes a chapter of the series, delivering a bizarre final battle with a mirror, marking an emotional end to the Warren’s investigations. By Dani Di Placido Senior Contributor 2 hours ago Today’s NYT Pips Hints And Solutions For Wednesday, September 10th Looking for help with today's New York Times Pips? Here are some expert hints, clues and commentary to help you solve today's puzzle and sharpen your skills. By Erik Kain Senior Contributor 2 hours ago Trump Signs Order Targeting Drug Ads On TV—But Stops Short Of Ban RFK Jr. Proposed The order stops short of a ban on pharmaceutical drug advertisements floated by Health Secretary Robert F. Kennedy Jr. last year. By Antonio Pequeño IV Forbes Staff 2 hours ago ZEROBASEONE Create ‘An Iconic Moment’ With ‘Lovesick Game’ Live From Vevo Studios ZEROBASEONE deliver 'NEVER SAY NEVER' album track \"Lovesick Game\" live from Vevo Studios in an intimate, vocal-focused performance that leader Sung Han Bin calls iconic. By Jeff Benjamin Senior Contributor 2 hours ago How Will Murdoch Succession Impact Fox News, Wall Street Journal And More? The Murdoch succession deal gives Lachlan Murdoch control of his father's conservative media empire. Experts say the board will likely let him set the tone. By Toni Fitzgerald Senior Contributor 3 hours ago Ready For Some Football? When It Comes To Gambling, Odds Are The IRS Is Watching, Too Gambling is huge in the U.S., and no league is more popular for oddsmakers than the NFL. With billions of dollars changing hands, the IRS wants its share of the winnings. By Kelly Phillips Erb Forbes Staff 3 hours ago Dick’s Bets On Foot Locker To Kick Start Global Growth Across Brands As a huge deal closes to see Dick's take over Foot Locker, the two brands need to leverage each other's strengths in order to compete in a fracturing athleisure market. By Mark Faithfull Contributor 3 hours ago First Mars Explorers Could Live Inside Lava Tubes Of Dormant Volcanos Space robotics experts have created a team of intelligent robots that can be lofted to Mars to map lava tubes that can provide sanctuaries for the first human explorers. By Kevin Holden Platt Contributor 4 hours ago Lachlan Murdoch’s Control Of Fox And News Corp. Sets The Stage For M&A Lachlan Murdoch now holds full control of Fox and News Corp, raising fresh questions about media consolidation and the future of his family's empire. By Andy Meek Senior Contributor 4 hours ago Canelo Alvarez Vs. Terence Crawford Full Boxing Fight Card Odds We look at the early fight week betting odds for the Saturday, September 14 super middleweight title fight headlined Canelo Alvarez vs. Terence Crawford boxing card. By Trent Reinsmith Contributor 5 hours ago Noche UFC Fight Card: Date, Time, Location, How To Watch Or Stream We prepare you for Saturday's Noche UFC 2025 fight card: Date, time, location and how to watch or stream the Diego Lopes vs. Jean Silva headlined UFC Fight Night card. By Trent Reinsmith Contributor Aug 21, 2025 Meet America’s Best Employers By State 2025 These companies topped Forbes' rankings across the country because they offer employees paths to career advancement, generous benefits and community. By Haniya Rae Contributor More Articles also on forbes NHL Goalie Dustin Wolf Commits To Calgary Flames With 7-Year Extension Toronto Film Festival: Sydney Sweeney Boxes Free Of Her Jeans-Ad Thing Naoya Inoue Vs. Murodjon Akhmadaliev Fight Card: Date, Time, Location © 2025 Forbes Media LLC. All Rights Reserved. AdChoices AdChoices Privacy Statement Do Not Sell or Share My Personal Information Limit the Use of My Sensitive Personal Information Cookie Preferences Terms of Service Digital Terms of Sale Contact Us Send Us Feedback Report a Security Issue Jobs At Forbes Forbes Accolades Forbes Press Room Advertise"
    }
  ]
}