{
  "fuentes": [
    {
      "url": "https://www.campnewyork.com/board-of-directors-staff/",
      "email": "ann@campnewyork.com"
    },
    {
      "url": "https://www.campnewyork.com/board-of-directors-staff/",
      "email": "bryan@jonespond.com"
    },
    {
      "url": "https://www.campnewyork.com/board-of-directors-staff/",
      "email": "ed@campbellcampground.com"
    },
    {
      "url": "https://www.campnewyork.com/board-of-directors-staff/",
      "email": "emily@campnewyork.com"
    },
    {
      "url": "https://www.campnewyork.com/board-of-directors-staff/",
      "email": "info@campnewyork.com"
    },
    {
      "url": "https://www.campnewyork.com/board-of-directors-staff/",
      "email": "info@leespark.com"
    },
    {
      "url": "https://www.campnewyork.com/board-of-directors-staff/",
      "email": "jerry@brooksidecampgrounds.com"
    },
    {
      "url": "https://www.campnewyork.com/board-of-directors-staff/",
      "email": "jonathon_goldberg@equitylifestyle.com"
    },
    {
      "url": "https://www.campnewyork.com/board-of-directors-staff/",
      "email": "louise@lebanoncampground.com"
    },
    {
      "url": "https://www.campnewyork.com/board-of-directors-staff/",
      "email": "max@redrockponds.com"
    },
    {
      "url": "https://www.campnewyork.com/board-of-directors-staff/",
      "email": "mda1223@yahoo.com"
    },
    {
      "url": "https://www.campnewyork.com/board-of-directors-staff/",
      "email": "patty@dreamlakecampground.com"
    },
    {
      "url": "https://www.campnewyork.com/board-of-directors-staff/",
      "email": "sleepyhollowlake@yahoo.com"
    },
    {
      "url": "https://www.campnewyork.com/board-of-directors-staff/",
      "email": "trisa_miller@equitylifestyle.com"
    },
    {
      "url": "https://www.yoursunlife.com/sugarbeachmauritius/contact-us/",
      "email": "info.sbr@sugarbeachmauritius.com"
    },
    {
      "url": "https://www.yoursunlife.com/sugarbeachmauritius/contact-us/",
      "email": "reservations.sugarbeach@yoursunlife.com"
    },
    {
      "url": "https://www.discover850.com/listing/beach-camp-brewpub-grayton-beach/",
      "email": "chosen-sprite@2x.png"
    },
    {
      "url": "https://www.discover850.com/listing/beach-camp-brewpub-grayton-beach/",
      "email": "icons-ffffff@2x.png"
    },
    {
      "url": "https://www.beachcampbeer.com/bc-beer",
      "email": "info@beachcampbeer.com"
    },
    {
      "url": "https://www.beachcampbeer.com/grayton-events",
      "email": "info@beachcampbeer.com"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "email": "administrativedirector@communityartsmentorship.com"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "email": "communications@communityartsmentorship.com"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "email": "culturalengagement@communityartsmentorship.com"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "email": "innovationliaison@communityartsmentorship.com"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "email": "managingdirector@communityartsmentorship.com"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "email": "programcoordinator@communityartsmentorship.com"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "email": "sponsorship@communityartsmentorship.com"
    },
    {
      "url": "https://batsonriver.com/wells-maine/",
      "email": "infowells@batsonriver.com"
    },
    {
      "url": "https://finewineliquors.com/contact-us/",
      "email": "sales@finewineliquors.com"
    },
    {
      "url": "https://www.beachcampbeer.com/collective",
      "email": "info@beachcampbeer.com"
    },
    {
      "url": "https://www.beachcampbeer.com/main-grayton",
      "email": "info@beachcampbeer.com"
    },
    {
      "url": "https://bb-360.org/contact-us/",
      "email": "info@bbcamp.org"
    },
    {
      "url": "https://campbb.com/forms-staff/",
      "email": "info@campbb.com"
    },
    {
      "url": "https://campbb.com/forms-staff/",
      "email": "shaikin@campbb.com"
    }
  ],
  "mails": [
    "administrativedirector@communityartsmentorship.com",
    "ann@campnewyork.com",
    "bryan@jonespond.com",
    "chosen-sprite@2x.png",
    "communications@communityartsmentorship.com",
    "culturalengagement@communityartsmentorship.com",
    "ed@campbellcampground.com",
    "emily@campnewyork.com",
    "icons-ffffff@2x.png",
    "info.sbr@sugarbeachmauritius.com",
    "info@bbcamp.org",
    "info@beachcampbeer.com",
    "info@campbb.com",
    "info@campnewyork.com",
    "info@leespark.com",
    "infowells@batsonriver.com",
    "innovationliaison@communityartsmentorship.com",
    "jerry@brooksidecampgrounds.com",
    "jonathon_goldberg@equitylifestyle.com",
    "louise@lebanoncampground.com",
    "managingdirector@communityartsmentorship.com",
    "max@redrockponds.com",
    "mda1223@yahoo.com",
    "patty@dreamlakecampground.com",
    "programcoordinator@communityartsmentorship.com",
    "reservations.sugarbeach@yoursunlife.com",
    "sales@finewineliquors.com",
    "shaikin@campbb.com",
    "sleepyhollowlake@yahoo.com",
    "sponsorship@communityartsmentorship.com",
    "trisa_miller@equitylifestyle.com"
  ],
  "nombre_sitio": "beachcampbeer.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.campnewyork.com/board-of-directors-staff/",
      "text": "Board of Directors & Staff - Camp New York Please ensure Javascript is enabled for purposes of website accessibility Skip to content Request a Guide About About Us Board of Directors & Staff CONY Hall of Fame & CONY Fellows Job Postings News Events CONY Members Support Camp Good Days Blog Hot Deals Member Center Affiliate Members Member Enrollment Marketing Opportunities Programs COVID-19 Resources Join Today Membership Benefits Member Enrollment Member Login Find a Campground Board of Directors & Staff Established in 1963, Campground Owners of New York, Inc. (CONY) is a for-profit trade association dedicated to the promotion, growth, improvement, and development of independently owned campgrounds in New York State. Two full-time staff persons manage the day-to-day operations of the association. The board of directors is comprised of campground owners or managers representing designated regions across the entire state, plus an executive committee of campground operators. Office location and correspondence: 100 Saratoga Village Blvd, Ste 37S Malta, New York 12020 info@campnewyork.com , 585-586-4360 Staff Emily Simmons President & CEO 585-586-4360 emily@campnewyork.com Ann Flach Marketing & Communications Manager 585-586-4360, ext 2 ann@campnewyork.com Board of Directors (2024-2025) Chairman: Matt Anderson Camp Chautauqua Stow, NY mda1223@yahoo.com Executive Committee Chair 1 st Vice Chair: Vacant 2 nd Vice Chair: Nina Latello Sleepy Hollow Lake Resort Akron, NY sleepyhollowlake@yahoo.com Marketing Committee Chair 3 rd Vice Chair: Patty Jarnot Dream Lake Campground Warsaw, NY patty@dreamlakecampground.com Governance Committee Chair Immediate Past Chair: Scott Sherwood Spruce Row Campground & RV Park Ithaca, NY sprucerow1@gmail.com Executive Committee Member Treasurer: Edward Marden Camp Bell Campground Campbell, NY ed@campbellcampground.com Executive Committee Member Secretary: Bryan Schaefer Jones Pond Campground & RV Park Angelica, NY Â bryan@jonespond.com Executive Committee Member Regional Directors Chautauqua-Allegheny: John Tinelli Triple R Camping Resort & Trailer Sales Franklinville, NY Counties: Allegany, Cattaraugus, Chautauqua. Greater Niagara: Max Han Red Rock Ponds RV Resort Holley, NY max@redrockponds.com Counties: Erie, Genesee, Niagara, Orleans, Wyoming. Alternate Director: Finger Lakes: Randy Case Grants' Vacation Park Fair Haven, NY racase49@gmail.com Counties: Cayuga, Chemung, Cortland, Livingston, Monroe, Onondaga, Ontario, Schuyler, Seneca, Steuben, Tioga, Tompkins, Wayne, Yates. Alternate Director: Central New York: Louise Hartshorn Lebanon Reservoir Campground Hamilton, NY louise@lebanoncampground.com Counties: Broome, Chenango, southern Herkimer (all locations south of the intersections of NY Routes 365 and 8), Madison, Oneida, Montgomery, Otsego, northern Schoharie (all locations northwest of Interstate 88). Alternate Director: 1000 Islands-Seaway/Eastern Lake Ontario: Trisa Miller Brennan Beach RV Resort Pulaski, NY trisa_miller@equitylifestyle. com Counties: Jefferson, Oswego, northern St. Lawrence (all locations northwest of US Route 11). Alternate Director: The Adirondacks: Cathy Dunlap Old Forge Camping Resort Old Forge, NY Counties: Clinton, Essex, Franklin, Hamilton, Lewis, Warren, northern Herkimer (all locations north of the Intersection of Routes 365 & 8), southern St. Lawrence (all locations southeast of US Route 11). Capital-Saratoga: Mandy Duncan Lee's Park Campground Saratoga Springs, NY info@leespark.com Counties: Albany, Rensselaer, Saratoga, Schenectady, Washington Alternate Director: Jared Foro, Whispering Pines Campsites & RV Park, Greenfield Center, NY. The Catskills: Jerry Schroader Brookside Campground Catskill, NY jerry@brooksidecampgrounds.com Counties: Delaware, Greene, Sullivan, western Ulster (all locations west of Interstate 87), and southern Schoharie (all locations southeast of Interstate 88). Alternate Director: Hudson Valley/Long Island: John Forman Sylvan Lake Beach Park Hopewell Junction, NY Counties: Columbia, Dutchess, Orange, Putnam, Rockland, Westchester, Suffolk, and eastern Ulster (all locations east of Interstate 87). Alternate Director: At-Large Director: Jonathon Goldberg, Equity Lifestyle Properties, Inc. jonathon_goldberg@equitylifestyle.com CONY Board Presidents (1964-2010)/Board Chairpersons (2010 and ongoing) 1964 to 1967 Merrill R. Bull Arrowhead Camping Area Delevan, NY 1968 to 1969 Robert LaPoint Chedmardo Campsite Pulaski, NY 1970 Frank Brundage Hickory Hill Campground Bath, NY 1971 to 1972 Arthur Bedell River Road Campground Corinth, NY 1973 to 1974 Robert D. Kunzman Pine Valley Campground Endicott, NY 1975 to 1976 Harry Wood, Jr. Miller Hollow Campground Roscoe, NY 1977 to 1978 Roger C. Anderson Camp Chautauqua Stow, NY 1979 to 1981 Olga âOllieâ Mizerak Cooperstown Shadow Brook Campground Cooperstown, NY 1982 to 1983 Robert London Skyway Camping Resort Greenfield Park, NY 1984 to 1986 Edwin Lighthall Yogi Bearâs Jellystone Park at Mexico Mexico, NY 1987 to 1988 Albert G. Kaufman Upper Delaware Campground Callicoon, NY 1989 to 1990 Edgar Hollwedel Lei-Ti Campground Batavia, NY 1990 to 1992 Andy Joehl Indian Ridge Campground Catskill, NY 1992 to 1994 Ford Gilbert âGilâ Paddock Deer River Campsite 1994 to 1995 Barbara Lighthall Yogi Bearâs Jellystone Park at Mexico 1995 to 1998 Ford Gilbert âGilâ Paddock Deer River Campsite Malone, NY 1998 to 2001 Mark Anderson Camp Chautauqua Stow, NY 2001 to 2007 Janine Paddock Deer River Campsite Malone, NY 2007 to 2011 Scott Sherwood Spruce Row Campground & RV Park Ithaca, NY 2011 to 2014 Michael Papp West Canada Creek Campsites Poland, NY 2014 to 2018 Gregg Nicholls Lake Bluff Campground Wolcott, NY 2018 to 2023 Scott Sherwood Spruce Row Campground & RV Park Ithaca, NY 2023 to Present Matt Anderson Camp Chautauqua Stow, NY CONY Executive Administrators/Presidents & CEOs 1975 to 2007 Robert C. Klos, Sr. Executive Administrator 2006 to 2023 Donald G. Bennett, Jr. President & CEO 2023 to Present Emily Simmons President & CEO © 2025 Camp New York | Site by GrowthZone Get In Touch! 585-586-4360 100 Saratoga Village Blvd, Malta, NY 12020 info@campnewyork.comÂ Facebook Instagram YouTube Pinterest Additional Resources FAQ Privacy Policy Terms of Use Request a Free Guide Campground Owners of New York is dedicated to the promotion, growth, improvement, and development of independently owned campgrounds in New York State. © Camp New York. All Rights Reserved | Site by GrowthZone Scroll To Top"
    },
    {
      "url": "https://www.yoursunlife.com/sugarbeachmauritius/contact-us/",
      "text": "Contact Us | Sugar Beach, Luxury Mauritius Resort Explore the resorts Back The Resort Rooms & Suites Deluxe Sea View Room Deluxe Beach Front Room Premium Sea View Room Premium Beach Front Room Family Room Premium Suite Premium Accessible Room Executive Beach Front Suite Offers Restaurants & Bars Wellness & Fitness Golf Experiences & Activites Weddings Wedding Packages Legal Requirements Meetings & Celebrations Venue spaces Conferences Parties & Celebrations Gift Voucher Sunlife Sugar Beach Long Beach La Pirogue Ambre Anahita Golf & Spa Resort Anahita Golf Ile aux Cerfs Location Day Pass Contact Us EN FR DE Day Pass Location Gift Voucher Contact Us Book Now Book Now Home Sugar Beach Contact Us Have a Question? Instantly get answers to your questions. Just send us a WhatsApp message. Using a laptop but prefer to chat on your mobile? No problem! Simply scan the QR code to start the conversation. Get in touch Call, email or complete our form Our team will get back to you and we look forward to welcoming you to experience Sugar Beach. Address Wolmar Flic en Flac Mauritius For More Information: Call on: +230 403 3300 For Reservations: Call on: +230 402 0151 or Email: reservations.sugarbeach@yoursunlife.com topic General Enquiry Wedding Enquiry Meeting Enquiry Dining Enquiry Spa Enquiry I AGREE TO THE TERMS & CONDITIONS Submit Newsletter Sign Up First Name Email Address * Website_Visitor Sunlife Sugar Beach Long Beach Ambre La Pirogue I agree to the privacy policy Sustainability Financial Information & Governance Mobile App Reviews Gift Voucher Members Club Join the Team Awards Cookie Policy Privacy Policy © Copyright Sun life 2022 Sugar Beach Wolmar, Flic en Flac, Mauritius Tel: +230 403 3300 Email: info.sbr@sugarbeachmauritius.com Website by 80 Days Resorts Sunlife Sugar Beach Long Beach La Pirogue Ambre Anahita Golf & Spa Resort Anahita Golf Ile aux Cerfs"
    },
    {
      "url": "https://www.discover850.com/listing/beach-camp-brewpub-grayton-beach/",
      "text": "Beach Camp Brewpub - Grayton Beach - Discover850"
    },
    {
      "url": "https://www.beachcampbeer.com/bc-beer",
      "text": "Beach Camp Brewing Co - Beer from Here — Beach Camp 0 Skip to Content Our Beer Story Visit Happy Hour Events Grayton Events Parties & Catering Food Truck MENUS Open Menu Close Menu Our Beer Story Visit Happy Hour Events Grayton Events Parties & Catering Food Truck MENUS Open Menu Close Menu Our Beer Story Visit Happy Hour Folder: Events Back Grayton Events Parties & Catering Food Truck MENUS Our beer Where to find Beach camp Beer You can find Beach Camp Beer in 6 packs at 6 Wine World locations from Panama City Beach to Pensacola! Our 6 packs, crowlers, growlers, and drafts are all available at the Brewpubs. (+ More retailers coming soon!) Click to find Wine world near you! What’s on tap? We’ve got magic brewing in our tanks! A broad range of in-house brews are available at both of our Beach Camp Brewpub locations, as well as a limited selection offered at multiple restaurants and bars on the Gulf Coast, including The Craft Bar. Crab Island Blonde Ale Blonde Ale - 5.3% ABV - 18 IBU Watch your toes! The Crab Island Blonde Ale pinches with a bready and light profile. Balanced and easy sipping! Probably, the best Blonde Ale on the Emerald Coast. Souvenir IPA IPA - American - 7.2% ABV - 58 IBU Get me a Souvenir! Drink this beer at the beach, and bring it home to share! Enjoy the apricot and sweet melon flavors with a pleasantly bitter and dry finish for a Citra hop expression. High Tide Hefe Wheat Beer - Hefeweizen - 5.7% ABV - 19 IBU Clove and bubblelicious on the nose with banana-o-ramo on the palate. Dank Sinatra IPA - American - 7.01% ABV - 45 IBU So dankin’ good! Juicy IPA at its best! Amber-Jack Amber Ale - 6.5% ABV - 27 IBU Malty in your mouth, followed by a mildly bitter finish that we recommend pairing with our pulled pork sandwich. Delicious! ‘cause we can! Two Beach Camp favorites are now available in 12oz, 6 pack cans! Take the Beach home with you - stop at the brewpubs or a retailer near you today! Crab Island Blonde Ale Blonde Ale - 5.3% ABV - 18 IBU Watch your toes! The Crab Island Blonde Ale pinches with a bready and light profile. Balanced and easy sipping! Probably, the best Blonde Ale on the Emerald Coast. Souvenir IPA IPA - American - 7.2% ABV - 58 IBU Get me a Souvenir! Drink this beer at the beach, and bring it home to share! Enjoy the apricot and sweet melon flavors with a pleasantly bitter and dry finish for a Citra hop expression. Limited Release Get them while you can! This selection of seasonal and special brews won’t last long. Uncle Dunkel Wheat Beer - Dunkelweizen - 4.78% ABV - 10 IBU Uncle’s dark hefe with malty goodness! Bread crust and caramel. This is a Farmhouse...Ale Farmhouse Ale - Saison - 5.9% ABV - 21 IBU This Belgian style puts off a mild earthy hop aroma with hints of black pepper, citrus, and banana. Marzen the Martian Märzen - 6.2% ABV - 19 IBU Sweet apricot for a malty, clean, and rich aftertaste! Mozart Smash Lager- Vienna - 6.3% ABV - 24 IBU Our latest addition to our series of SMSH beers combines Vienna Malt with Czech Saaz hops. Herbal aroma with a mild earthy bitterness and a slight malty sweetness. Beach Camp ESB Bitter- Extra Special - 5.75% ABV - 45 IBU Aroma of sweet hay and grain. Malty sweetness greets the palate, followed by a mild bitterness over the tongue, then an effervescent and creamy finish. Ale I Want For Christmas Red Ale - 7.92% ABV - 58 IBU A punch of clove due to the phenols created by the wheat beer yeast. To balance the spice, we added blood orange to the tank. Holiday simmer in the pot! The Bold Brew Coffee Porter Porter - Coffee - 6.7% ABV - 7 IBU A local coffee shop provided us with some amazing Guatemalan Roast to release a wake me up brew! Cheers! COMING SOON Stout Walton Long Strange Tripel Pilsner Doppelbock Meet the brewers Will Dargavell Brewmaster A South Walton local, Will began brewing beer nearly a decade ago in his college home at the University of Florida. He moved to Sonoma County, where he honed his skills through work at local wineries. Through this, he realized “it takes good beer to make great wine” and knew that his passion lied in those industries. Moving back to South Walton, Will sought to provide great beer to the local community he knew and loved - and began as assistant brewer at Beach Camp before quickly moving up to his current Brewmaster position where he creates unique recipes and aims to brew some of the best beer the Emerald Coast has to offer. Chase Boutwell Assistant Brewer Chase Boutwell is an Okaloosa County native. Born at Eglin AFB and graduated from Choctawhatchee High School in 2008. A bartender’s bartender with over a decade of experience. A true local with a passion of knowledge and craft beer, he can come up with a beer name almost as well as he can drink it. Committed to brewing the best beer on the beach! LEAD STAFF Will Dargavell Brewmaster Chase Boutwell Assistant Brewer Justin Grev Creative Director RECENT PRESS Featured on 30A.com Gallery State of the art brewing facilities Visit the Brewpubs work with us! Band Booking A Member of Wine World’s Coastal Culinary Collective Learn More About Us Military Discount Beach Camp Brewing Co. & Brewpubs, Florida Grayton Beach BREWERY, BAR, RESTAURANT AND BEER GARDEN LOCATION PAGE 170 E County Hwy 30A, Santa Rosa Beach, FL 32459 info@beachcampbeer.com (850) 213-4000"
    },
    {
      "url": "https://www.beachcampbeer.com/grayton-events",
      "text": "Grayton Events — Beach Camp 0 Skip to Content Our Beer Story Visit Happy Hour Events Grayton Events Parties & Catering Food Truck MENUS Open Menu Close Menu Our Beer Story Visit Happy Hour Events Grayton Events Parties & Catering Food Truck MENUS Open Menu Close Menu Our Beer Story Visit Happy Hour Folder: Events Back Grayton Events Parties & Catering Food Truck MENUS Grayton BEACH CAMP ALL DAY MarGARITA & TACO specials Tuesdays! TRIVIA NIGHT THURSDAYS Mar 14 Live Music with Chris Willman Friday, March 14, 2025 6:00 PM 9:00 PM Google Calendar ICS Friday Night Live: Music in the Beer Garden at Beach Camp Brewpub 🎶🍻 Unwind under the stars every Friday night from 6-9 PM in Beach Camp Brewpub’s beautiful beer garden with live music from some of the area’s favorite artists. Grab a cold craft brew, settle in with chef-driven coastal bites, and let the music set the tone for a perfect evening in Grayton Beach. Good beer, great vibes, and live tunes—Friday nights View Event → Mar 7 LIVE MUSIC with Grayson Turner Friday, March 7, 2025 6:00 PM 7:00 PM Google Calendar ICS Friday Night Live: Music in the Beer Garden at Beach Camp Brewpub 🎶🍻 Unwind under the stars every Friday night from 6-9 PM in Beach Camp Brewpub’s beautiful beer garden with live music from some of the area’s favorite artists. Grab a cold craft brew, settle in with chef-driven coastal bites, and let the music set the tone for a perfect evening in Grayton Beach. Good beer, great vibes, and live tunes—Friday nights View Event → Jun 22 Hello LALO! Thursday, June 22, 2023 7:00 PM 8:00 PM Google Calendar ICS Hello LALO! Try the new LALO Tequila at Beach Camp Brewpub June 21 & 22 Learn more View Event → May 5 CINCO DE MAYO FIESTA Friday, May 5, 2023 8:00 PM 10:00 PM Google Calendar ICS Join us for a Cinco de Mayo celebration with live music outside by Tanner Gray Tacos and Tequila specials 8-10 at Beach Camp Grayton View Event → Apr 9 Easter Brunch Sunday, April 9, 2023 11:00 AM 3:00 PM Beach Camp Brewpub (map) Google Calendar ICS Come Enjoy Easter Sunday Brunch at Beach Camp Brewpub! Special menu items just for this event and a bottomless mimosa option! View Event → Mar 26 BEACH LOBSTER! Cousin's Maine Lobster Food Truck Visit Sunday, March 26, 2023 12:00 PM 5:00 PM Google Calendar ICS Cousin’s Maine Lobster hits the Beach Sunday the 26th! Come grab something delicious from their food truck and get a discounted Beach Camp Beer! They’ll be here 12-5, so come when you’re hungry! View Event → Oct 15 Harvest Festival's Afterparty: BBQ on The Block Saturday, October 15, 2022 4:00 PM 8:00 PM The Wine Bar Watercolor (map) Google Calendar ICS The 6th Annual Harvest Wine and Food Festival wraps up with a BBQ Block Party on Watercolor Ave! Live Music, BBQ, Wine, Beer, & Cocktails available 4-8 on Saturday at the end of the Grand Tasting. See ya there! View Event → Oct 13 Oktoberfest Trivia Night Thursday, October 13, 2022 7:00 PM 8:00 PM Google Calendar ICS It’s Trivia Night with a TWIST! Celebrate Oktoberfest @ Beach Camp with beer, food, & fun! Cool prizes for the winners of the Stein Hoist, German Spelling Bee, and Pretzel Eating Contest! Teams can be up to 4 people, $5 per entrant View Event → Jul 10 Beach Camp Bash - Grayton Sunday, July 10, 2022 4:00 PM 8:00 PM Beach Camp Brewpub Grayton Beach (map) Google Calendar ICS Join us for BBQ, Beer, Live Music, big prize Raffle, & More on Sunday! Tickets are just $25 INCLUDES: Admission, First Beach Camp Beer, BBQ Plate, & 1 Raffle Ticket Ticket Page View Event → Jun 28 Live Music with Rhett Plash Tuesday, June 28, 2022 6:00 PM 8:00 PM Google Calendar ICS View Event → Jun 24 Live Music with Tanner Grey Friday, June 24, 2022 6:00 PM 8:00 PM Google Calendar ICS View Event → Jun 21 Live Music with Dion Jones Tuesday, June 21, 2022 6:00 PM 8:00 PM Google Calendar ICS View Event → Jun 19 Live Music with Arsenault Sunday, June 19, 2022 6:00 PM 8:00 PM Google Calendar ICS View Event → Jun 14 Live Music with Josh Hinton Tuesday, June 14, 2022 6:00 PM 8:00 PM Google Calendar ICS View Event → Jun 10 Live Music with Arsenault Friday, June 10, 2022 6:00 PM 8:00 PM Google Calendar ICS View Event → Jun 7 Live Music with Rhett Plash Tuesday, June 7, 2022 6:00 PM 8:00 PM Google Calendar ICS View Event → Jun 5 Live Music with Chris Willman Sunday, June 5, 2022 2:00 PM 4:00 PM Google Calendar ICS View Event → Jun 3 Live Music with Kyle Lamonica Friday, June 3, 2022 6:00 PM 8:00 PM Google Calendar ICS View Event → May 31 Live Music with Dion Jones Tuesday, May 31, 2022 6:00 PM 7:00 PM Google Calendar ICS View Event → May 27 Live Music with Arsenault Friday, May 27, 2022 6:00 PM 8:00 PM Google Calendar ICS View Event → May 24 Live Music with Arsenault Tuesday, May 24, 2022 6:00 PM 7:05 PM Google Calendar ICS View Event → May 22 Live Music with Josh Hinton Sunday, May 22, 2022 2:00 PM 3:55 PM Google Calendar ICS View Event → May 22 Sunday Brunch Sunday, May 22, 2022 10:00 AM 1:00 PM Google Calendar ICS Join us for Sunday Brunch! BRUNCH MENU View Event → Apr 24 Sunday Brunch Sunday, April 24, 2022 10:00 AM 11:00 AM Google Calendar ICS Join us for Sunday Brunch! BRUNCH MENU View Event → Apr 17 Sunday Brunch Sunday, April 17, 2022 10:00 AM 11:00 AM Google Calendar ICS Join us for Sunday Brunch! BRUNCH MENU View Event → Apr 10 Sunday Brunch Sunday, April 10, 2022 10:00 AM 11:00 AM Google Calendar ICS Join us for Sunday Brunch! BRUNCH MENU View Event → Apr 3 Sunday Brunch Sunday, April 3, 2022 10:00 AM 2:00 PM Google Calendar ICS Join us for Sunday Brunch! BRUNCH MENU View Event → work with us! Band Booking A Member of Wine World’s Coastal Culinary Collective Learn More About Us Military Discount Beach Camp Brewing Co. & Brewpubs, Florida Grayton Beach BREWERY, BAR, RESTAURANT AND BEER GARDEN LOCATION PAGE 170 E County Hwy 30A, Santa Rosa Beach, FL 32459 info@beachcampbeer.com (850) 213-4000"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "text": "OUR TEAM | CAMP top of page Home ABOUT OUR TEAM JOIN THE TEAM PROGRAMS TACT URBAN ARTS NORTHERN LIGHTS BLUEGRASS MUSIC CAMP GIRLS ROCK THE NORTH YOUTH MUSIC CAMPS RESIDENCIES CULTURAL FOUNDATIONS MUSIC IN SCHOOLS ARTS EXPLORATION TOUR SOA FIDDLE MENTORSHIP CURRICULUM DEVELOPMENT HIP HOP COLLABORATION MUSIC TEACHER MENTORSHIP CONTACT NEWS DOYLEFEST LINEUP AND TICKETS ABOUT GET INVOLVED GALLERY CONTACT PAST PERFORMERS DONATE Our Team. Rooted in the arts. Experts in various fields, working together to share their talents in communities across Saskatchewan. Eliza Doyle managingdirector@communityartsmentorship.com Co - Founder / Managing Director Eliza is a professional musician, songwriter and recording artist, teacher, community advocate, leader and is the co-founder behind Saskatchewan’s arts organization, C.A.M.P; Community Arts Mentorship Program. Her focus on fostering the arts while supporting local community capacity to deliver arts programming has been welcomed throughout communities in Saskatchewan. Offering services to remote and under-served communities presents new challenges, and all of CAMP programming serves to mitigate these obstacles. Familiar with the arts and music industry in Saskatchewan, she also aims to provide the opportunity and mentorship available to people with challenges in access due to location and lack of resources. Holly Rae Yuzicapi culturalengagement@communityartsmentorship.com Co - Founder / Cultural Consultant The co-founder of CAMP and a proud Dakota/Lakota from the Standing Buffalo Dakota Nation in Treaty 4 Territory, Saskatchewan.  Holly grew up in the beautiful Qu'Appelle valley.  Coming from a large family, Holly has been able to observe and learn from many generations of the Goodwill and Yuzicapi families.  The strength of her sense of identity was nurtured and shaped by her family and community.  Without realizing it at the time, Holly started doing cultural arts sharing from a young age which really is rooted in participating in powwow dancing and attending other cultural events on a regular basis.  She has evolved into an independent natural materials artist that loves to facilitate cultural arts engagement opportunities to all audiences.  Holly is proud of how she was raised and is very thankful for all that her family has taught her.  Respectfully representing the spirit and potential of those teachings is why Holly does the work that she does.  It is how she chooses to honour her family. LJ Tyson Kimbley innovationliaison@communityartsmentorship.com Innovation Liaison LJ Tyson is a singer-songwriter from Prince Albert, Saskatchewan. The has used his identity as inspiration for creating lyrics and melodies. LJ has had music played across Canada and beyond. His latest release Home On A Rainbow was critically acclaimed and awarded a prize from SOCAN TD Indigenous Songwriter Awards. LJ currently works as Innovation Liaison for Community Arts mentorship program, bringing music to remote and underserved communities. Steph Cameron administrativedirector@communityartsmentorship.com Administrative Director Saskatchewan-based artist Steph Cameron has gained recognition for her unique take on contemporary Americana music, lively instrumentation, and captivating lyrics. From her early days of busking, she has become an internationally touring professional recording artist. Her critically acclaimed debut album, Sad-Eyed Lonesome Lady, released on Pheromone Recordings in 2014, was nominated for the Polaris Music Prize and praised as the #1 Canadian album of that year by PopMatters, while No Depression called it \"a stunning debut.\" This success led her to join the Paquin Artist Agency and embark on national tours. Her expertise in performing is the real world experience CAMP participants benefit the most from . Zoe Slusar programcoordinator@communityartsmentorship.com Program Coordinator Zoe Slusar was the voice actress for Kid Goku in the English dubs of the Dragon Ball and Dragon Ball GT anime, done by Blue Water Studios. She also provided the voice of Sai Saici in Kidou Butouden G Gundam, as well as the video game Gundam: Battle Assault 2.\n\nZoe also voiced the character Jungo in the Flemish created series.\n\nZoe, also known by her stage name ZHE the Free, released her first rap EP album titled The Love EP in September 2020. This album charted #1 on 90.9 CJSW in Calgary, Alberta in November 2020. Mitchell Dureault programcoordinator@communityartsmentorship.com Program Coordinator Mitch Dureault is a seasoned professional music instructor and traditional musician, who comes from the Treaty 4 Territory of the southern Saskatchewan prairies. Currently sitting as a board member, and working instructor for C.A.M.P., Mitch is an advocate for the arts and has a strong focus on decolonizing his own music & teaching practices. He regularly draws from his B.A. in International Studies while working with and aiding organisations, communities, and schools in the development and implementation of equitable and continual art programming throughout the province. Mitch is also very passionate about the promotion and preservation of the local culture of Saskatchewan fiddling and has been making efforts to visit and interview as many fiddlers as possible from across the province for his Saskatchewan Fiddle History Project, a multi-year project in which he collects stories, tunes, and histories from these individuals in an attempt to preserve and document the ever evolving diverse intricacies of the provinces fiddling culture. Jille Shotton communications@communityartsmentorship.com sponsorship@communityartsmentorship.com​ Marketing and Communications Director\\ Sponsorship Jille Shotton joined the Community Arts Mentorship Program in 2024 as the Marketing and Communications Director, bringing a decade of experience in festival marketing, promotions, and community building within Saskatchewan's arts and culture sector. Her background includes managing marketing, communications, sponsorship, and onsite operations for events such as the Northern Lights Bluegrass & Old Time Music Festival, Winterruption, Ness Creek Music Festival, Fiddlyness, Shivering Strings and the Children's Festival of Saskatchewan. Jille is passionate about strengthening communities through the arts, having organized open jams, Bluegrass Brunch, radio shows, and various events and festivals. Her work focuses on creating inclusive, vibrant spaces where the community can connect and thrive. Lillanohna Naytowhowcon President LILI, an Indigenous singer, songwriter, and recording artist hailing from Sturgeon Lake First Nation in Saskatchewan, blends her passion for music and independent songwriting. She is actively engaged in community projects that celebrate and honour Indigenous culture through a fusion of traditional Cree songs, indie rock, folk, hip-hop, and dance music. In 2024, expect the release of her music under the esteemed blessed-street record label, marking a significant chapter in her musical journey. The album includes collaboration with recording artist Lancelot Knight in Six Underwater, showcasing her versatility. Proudly identifying as a nehiyaw iskwew, she seamlessly weaves her creative pursuits into a traditional lifestyle, contributing to a First Nation Healing Lodge under the guidance of elders and knowledge keepers. The past year has been a transformative period characterized by healing and growth, with her music echoing the spirit of loss, hope, and perseverance. Her vocal style is both distinctive and heartfelt, drawing inspiration from grassroots music festivals, independent artists, and the eclectic vibes of the city. A nomadic spirit with a touch of witchy charm, LILI invites all to partake in the enchantment of her melodies. Travis Beatty Board Member Travis Beatty is from Timber Bay, Saskatchewan and is instrumentalist. He has a studio in Saskatoon, Saskatchewan called Rez Rat Recording, and is passionate about helping community and youth in Saskatchewan. He joined the CAMP Sask Arts Board of Directors in October 2023, and we are very lucky to have him! JOIN THE MAILING LIST SIGN UP NOW Thanks to our supporting organizations Email: managingdirector@communityartsmentorship.com Tel: 306-774-5888 bottom of page"
    },
    {
      "url": "https://batsonriver.com/wells-maine/",
      "text": "Brewery in Wells, Maine | Batson River Fish Camp Skip to content LOCATIONS & HOURS BIDDEFORD KENNEBUNK PORTLAND WELLS EVENTS BIDDEFORD CALENDAR KENNEBUNK CALENDAR PORTLAND CALENDAR WELLS CALENDAR PRIVATE EVENTS BEER & SPIRITS OUR SPIRITS OUR BEERS WHAT’S ON TAP IN BIDDEFORD WHAT’S ON TAP IN KENNEBUNK WHAT’S ON TAP IN PORTLAND WHAT’S ON TAP IN WELLS BREWERY TOURS MENUS BIDDEFORD MENU KENNEBUNK MENU PORTLAND MENU WELLS MENU RESERVATIONS BIDDEFORD PORTLAND GIFT CARDS × LOCATIONS & HOURS BIDDEFORD KENNEBUNK PORTLAND WELLS EVENTS BIDDEFORD CALENDAR KENNEBUNK CALENDAR PORTLAND CALENDAR WELLS CALENDAR PRIVATE EVENTS BEER & SPIRITS OUR SPIRITS OUR BEERS WHAT’S ON TAP IN BIDDEFORD WHAT’S ON TAP IN KENNEBUNK WHAT’S ON TAP IN PORTLAND WHAT’S ON TAP IN WELLS BREWERY TOURS MENUS BIDDEFORD MENU KENNEBUNK MENU PORTLAND MENU WELLS MENU RESERVATIONS BIDDEFORD PORTLAND GIFT CARDS Batson River Fish Camp – Wells, Maine Wells has been a summertime hotspot for generations, and we’re excited to add our brand of year-round flavor. Located just off Route 1 on the way to one of the best beaches in southern Maine, Batson River Fish Camp in Wells, Maine is the perfect place to refuel and recharge when you’re sightseeing, adventuring, or exploring this iconic area and nearby Ogunquit. Expect a delicious menu of New American Pub Fare along with a carefully curated selection of cocktails using housemade spirits as well as a selection of craft beers brewed on site. This location houses our brewery and production facility which can be viewed during a brewery tour! WELLS HOURS Monday         11:30am-9pm Tuesday      11:30am-9pm Wednesday  11:30am-9pm Thursday    11:30am-9pm Friday          11:30am-9pm Saturday       11:30am – 9pm Sunday          11:30am – 9pm BREWERY TOURS Friday 4PM Advance signup required: Click Here to Book Wells Menu Order takeout ADD NAME TO Waitlist CONTACT US Call Us: 207-360-7255 Email: infowells@batsonriver.com Our Wells location currently accepts waitlists for parties of 2 or more. For groups of 7 or more; we take reservations in advance. Please contact the e-mail above for more information. PRESS | CAREERS | GIFT CARDS | EVENTS KENNEBUNK 12 Western Avenue Kennebunk, Maine 04043 Call Us: 207-967-8821 PORTLAND 82 HanoverStreet Portland, Maine 04101 Call Us: 207-800-4680 BIDDEFORD 17 Lincoln Street Biddeford, Maine 04005 Call Us: 207-815-3980 WELLS 73 Mile Road Wells, Maine 04090 Call Us: 207-360-7255 We use cookies on our website to give you the most relevant experience by remembering your preferences and repeat visits. By clicking “Accept”, you consent to the use of ALL the cookies. We will never sell your information to a third party. Privacy Policy Cookie settings ACCEPT Manage consent Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT"
    },
    {
      "url": "https://finewineliquors.com/contact-us/",
      "text": "Contact us Fine Wine Liquors Shop By Department Wine Red wine Menu Shiraz Cabernet Sauvignon Pinot Noir Red Blends Other Red Varietals Rosé Cabernet Merlot Shiraz Cabernet Merlot Grenache Tempranillo Sangiovese Nebbiolo Bordeaux Barossa Valley white Wine Menu Chardonnay Riesling Sauvignon blanc Pinot gris grigio Other white varietals White blends Dessert white Popular Regions Menu Bordeaux Barossa Valley Mclaren Vale Coonawarra Margaret River Burgundy Clare Valley Fortified Wine Menu Port Tawny Sherry Apera Vermouth Muscat Mead Tokay Topaque Popular Brands Menu Penfolds Under Wraps Wynns Wendouree Wolf Blass Tyrrell’s Top Selling Macallan 15 Year Old Double Cask $ 165.00 Availability: In Stock Glenfiddich Project XX $ 61.00 Availability: In Stock Glendronach 15 Year Old Revival $ 86.25 Availability: In Stock Beer Discover Beer Menu Craft Beer International Beer Australian Beer Mid Strength Light Beer Low Carb Beer Alcoholic Ginger Beer Home Brew Stout Pilsner Wheat Beer Dark Beer Golden Ale Porter Categories Menu Kegs Cider Craft Beer Domestic Beer Hard Seltzers Import Beer Non-Alcoholic Beer Popular Brands Menu 4 Pines Balter Coopers Little Creatures Stone & Wood Zytho New & Trending Menu New Arrivals Top Rated Craft Beer Light Low Pool Packs Cool Off Craft Beer The Lemonade Stand Country Menu Australia Sweden New Zealand France Spain From to Ready to Drink Organic Wine $69.99 Whiskey Discover whiskey Menu Scotch Whisky American Whiskey Japanese Whisky Australian Whisky Irish Whiskey Canadian Whisky Indian Whisky Discover Vodka Menu Absolut Smirnoff Hunter Distillery Stolichnaya Royal Dragon Crystal Head Poliakov Popular Brands Menu Johnnie Walker Jack Daniel’s Glenfiddich Highland Park Glen Moray Stone & Wood Fortified Wine Menu Whiskey Of The Month Flavored Whiskey Blended Scotch Rye Whiskey Single Malt Scotch Small Batch Bourbon Hot deals of summer Fresh Beer Save up $49.99 Jameson Whiskey Father’s Day Sale 40% off Sitewide! Cogac Cocktail Tequila What’s New New Gift & Accessories Best Sellers Sales & Offers -20% Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Menu Sign In or Register 0 0 $ 0.00 Contact us Home Page Contact us Don’t  hesitate to contact us \nif you need help. Whether you have a question about your order, need assistance with a product, or just want to reach out, you’re in the right place. Feel free to contact us using the details below, and we’ll get back to you as quickly as possible! Address 8560 S Cottage Grove Ave, Chicago, IL 60619, United States Call Us (630) 354-9222 Openning Monday – Friday: 8am – 10pm Saturday – Sunday: 9am – 5pm Contact sales@finewineliquors.com finewineliquorsinfo@gmail.com Got Any Questions? Use the form below to get in touch with the sales team Message Send your message Δ Search Account Cart Same-day local delivery Ground shipping directly to you Free in-store pickup 24/7 customer support Customer Service Menu Help Center My account Track my order Return policy About Us Menu Company info Press Releases Careers Reviews Investor relations Quick Links Menu Search Become a reseller Contact us Terms of service Categories Menu Brandy White Wine Champagne Vodka Tequila Get exclusive offers & rewards Sign up for our members portal to receive some exclusive offer & rewards. It’s easy and free! sign up Leave this field empty if you're human: stay connect Facebook-f Twitter Instagram Pinterest we accept Careers About Us Affiliates Privacy Settings Help Site map Copyright ©  2022 Liquory . All rights reserved. Sign in Create an Account Username or email * Password * Login Lost your password? Main menu Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Home About Us Account Blog Careers Cart Checkout Contact us Legal Notice My account Order Tracking Privacy Policy Refund and Returns Policy Reviews Sample Page Shipping Shop Terms & Conditions Track Wishlist Search for: Search All category All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell’s Black Lebel Blanton’s Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester’s Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell's Black Lebel Blanton's Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester's Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine Hide similarities Highlight differences Select the fields to be shown. Others will be hidden. Drag and drop to rearrange the order. Image SKU Rating Price Stock Availability Add to cart Description Content Weight Dimensions Additional information Click outside to hide the comparison bar Compare Top Shopping cart close ×"
    },
    {
      "url": "https://www.beachcampbeer.com/collective",
      "text": "Beach Camp is a Wine World Restaurant & part of the Coastal Restaurant Group — Beach Camp 0 Skip to Content Our Beer Story Visit Happy Hour Events Grayton Events Parties & Catering Food Truck MENUS Open Menu Close Menu Our Beer Story Visit Happy Hour Events Grayton Events Parties & Catering Food Truck MENUS Open Menu Close Menu Our Beer Story Visit Happy Hour Folder: Events Back Grayton Events Parties & Catering Food Truck MENUS About Wine World’s Coastal Restaurant Group Thank you for enjoying the Wine World Lifestyle with us at a Wine World Coastal Restaurant Group location, where culinary excellence meets warm hospitality. Our group comprises three unique dining destinations: The Wine Bar, The Craft Bar, and Beach Camp Brewpub. Each of our establishments is dedicated to creating memorable experiences, serving our community, and treating every guest like a cherished neighbor. Our Philosophy Wine World’s Coastal Restaurant Group all believe that great food and drink bring people together. Our menus are crafted with fresh, locally sourced ingredients, ensuring every dish is as vibrant and dynamic as the community we serve. Our chefs take pride in transforming these ingredients into culinary delights that excite the senses and leave a lasting impression. Exceptional Drink Offerings Our drink lists are as renowned as our food. Whether you're a wine connoisseur, a cocktail enthusiast, or a craft beer lover, you'll find something to love at our establishments. The Wine Bar boasts an ever-evolving selection of fine wines from around the world, perfectly curated to complement any meal. The Craft Bar is known for its innovative cocktails, expertly mixed to delight and surprise. At Beach Camp Brewpub, our locally brewed craft beers are a testament to our dedication to quality and flavor, offering a range of styles to suit every palate. A Place for Everyone We take immense pride in being an excellent place to work, fostering a positive and inclusive environment for our team members. Our commitment to exceptional service and community spirit is evident in everything we do, from the welcoming atmosphere to the personalized attention each guest receives. Join Us We invite you to explore each of our unique dining experiences: Visit The Wine Bar: Discover an exquisite selection of wines and a menu designed to elevate your dining experience. Visit The Wine Bar Visit The Craft Bar: Experience innovative cocktails and a vibrant atmosphere where creativity and flavor come together. Visit The Craft Bar Visit Wine World: A favorite stop for Locals and Visitors, Wine World has Spirits, Beer, Gourmet Cheeses, and of course, a carefully curated selection of wines from the most rare to the best bang for the buck. Visit Wine World Thank you for choosing Beach Camp Brewpub, an essential part of the Wine World Restaurant Group. We look forward to welcoming you and making every visit a memorable one. work with us! Band Booking A Member of Wine World’s Coastal Culinary Collective Learn More About Us Military Discount Beach Camp Brewing Co. & Brewpubs, Florida Grayton Beach BREWERY, BAR, RESTAURANT AND BEER GARDEN LOCATION PAGE 170 E County Hwy 30A, Santa Rosa Beach, FL 32459 info@beachcampbeer.com (850) 213-4000"
    },
    {
      "url": "https://www.beachcampbeer.com/main-grayton",
      "text": "Welcome to the Grayton Beach Camp Brewpub! — Beach Camp 0 Skip to Content Our Beer Story Visit Happy Hour Events Grayton Events Parties & Catering Food Truck MENUS Open Menu Close Menu Our Beer Story Visit Happy Hour Events Grayton Events Parties & Catering Food Truck MENUS Open Menu Close Menu Our Beer Story Visit Happy Hour Folder: Events Back Grayton Events Parties & Catering Food Truck MENUS Check out our Happy Hour! Grayton beach - 30a Our Original Brewpub in Historic Grayton Beach: A fully operational brewing facility offering local seafood, barbecue, a full bar and upscale cocktail program, and of course, the Best Beer on the Beach! Food Menu Drink menu kids menu draft menu late night menu HOURS Sunday-Wednesday 11am-11pm (Kitchen closes 10:00pm) Thursday-Saturday 11am-12am (Late Night Kitchen closes 11:30pm) Artist booking Contact 170 E County Hwy 30A, Santa Rosa Beach, FL 32459 850-213-4000 Sign up for emails! Sign up with your email address to receive news, freebies, and updates. Email Address Sign Up We respect your privacy. We protect and never sell data. Thank you! local-restaurant-best-seafood-bbq-drinks work with us! Band Booking A Member of Wine World’s Coastal Culinary Collective Learn More About Us Military Discount Beach Camp Brewing Co. & Brewpubs, Florida Grayton Beach BREWERY, BAR, RESTAURANT AND BEER GARDEN LOCATION PAGE 170 E County Hwy 30A, Santa Rosa Beach, FL 32459 info@beachcampbeer.com (850) 213-4000"
    },
    {
      "url": "https://bb-360.org/contact-us/",
      "text": "Contact Us  - BB360 I am here to... Register for camp Work for Camp Rent Camp Donate Camps BB CAMP About BB Camp Dates & Rates Camp Activities Location Grants & Financial Aid New Camper Guide Parent Manual BB DAY CAMPS About BB Day Camp Dates & Rates Grants & Financial Aid BB Day Camp Parent Manuals Family Camps ADULT CAMPS Divorce and Discovery Last day of Camp Men’s Camp ReJewvenation Work for Camp Programs Youth Programs BB B’nai Mitzvah PJ Library School Break Camps Teen Programs BBYO BB B’nai Mitzvah Staff In Training Summer Leadership Programs Service Programs Lincoln County Food Program Events About Us BB360 About BB360 Staff & Board of Directors Impact Report Our History Men’s Camp The History of BB Camp Rent Camp Careers Work for BB360 Work for BB Camp Shop Our Swag Shop Contact Us Ways to give Giving Make a donation Buy a Paver Etz Chaim Legacy Society Second Century Fund Drive Volunteer Search BB360 Office Hours and Contact Info Office Address 6443 SW Beaverton-Hillsdale Hwy, Suite 234, Portland, OR 97221 Phone and Fax Phone: 503-496-7444 Fax: 503-452-0750 Email info@bbcamp.org BB Camp Phone 503-452-3443 (during the year only) BB Day Camp Phone 503-496-7447 Click here for a full staff list and phone numbers BB Camp Office Hours and Contact Info Hours (During Summer Season) Monday-Friday: 8:30 AM to 6:00 PM Saturday: Closed for Shabbat Sunday: 8:30 AM to 6:00 PM Phone 541-994-2218 Fax 503-452-0750 We check phone messages frequently when the office is closed, including evenings and throughout Shabbat. Have Questions? Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone Number Comment or Message Send Camp Mailing Address For the safety of our Campers, we do not share our location. Please address mail as follows: Campers Name and Grade in Fall BB Camp P.O. Box 110 Neotsu, OR 97364 contact us if you’re interested in visiting camp SIGN UP FOR CAMP BB Overnight Camp BB Day Camp Family Camps Leadership Programs WORK WITH US Work for Camp Work for BB360 DISCOVER MORE Make a Donation Events Rent Camp Volunteer Contact Us Privacy Policy Tax ID#: 91-1842787 Supported By The B’nai Brith Mens Camp Association, a 501(c)(3) Oregon non-profit, supports BB360. Register for Camp Returning Campers New Campers I have a question about Overnight Camp Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone Number Comment or Message Send Day Camps Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone Number Comment or Message Send BBYO/Teen programming Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone Number Comment or Message Send Year-round Youth & Family Events Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone Number Comment or Message Send Donations Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone Number Comment or Message Send Adult Events Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone Number Comment or Message Send Other Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone Number Comment or Message Send Copyright © 2025 BB360 - All rights reserved"
    },
    {
      "url": "https://campbb.com/forms-staff/",
      "text": "Camp BB Riback | Staff REGISTER About Us Discover About Us Programs Activities Jewish Life at Camp BB Land Acknowledgment More Info Dates and Fees High School Credits at Camp FAQ Forms Parents – Register a Camper Parent Manual Staff – Apply Now! Staff Year-Round Staff Summer Staff Alumni Directors Staff – Apply Now! Gallery Scholarships Scholarships One Happy Camper & Bursaries Riback Scholarship Cohen Scholarship Forms Calgary IBP Edmonton IBP Forms Ted & Betty Riback / Bill Cohen Scholarship Application Other Opportunities Hebrew Free Loans Mitzvah Projects Stewardship  Programs Current Invesment Campaigns Life and Legacy Donate your Bottles DIRECT to Camp Donate – Tribute Cards & Campaigns Contact Us Shop Events, Pools and Campaigns MERCH REGISTER About Us -- Discover ---- About Us ---- Programs ---- Activities ---- Jewish Life at Camp BB ---- Land Acknowledgment -- More Info ---- Dates and Fees ---- High School Credits at Camp ---- FAQ -- Forms ---- Parents – Register a Camper ---- Parent Manual ---- Staff – Apply Now! Staff -- Year-Round Staff -- Summer Staff -- Alumni -- Directors -- Staff – Apply Now! Gallery Scholarships -- Scholarships ---- One Happy Camper & Bursaries ---- Riback Scholarship ---- Cohen Scholarship -- Forms ---- Calgary IBP ---- Edmonton IBP Forms ---- Ted & Betty Riback / Bill Cohen Scholarship Application -- Other Opportunities ---- Hebrew Free Loans ---- Mitzvah Projects Stewardship  Programs -- Current Invesment Campaigns -- Life and Legacy -- Donate your Bottles DIRECT to Camp -- Donate – Tribute Cards & Campaigns Contact Us Shop -- Events, Pools and Campaigns -- MERCH Staff Staff & Employment 2025 Staff Application CLICK HERE to join our team! Summer Employment at Camp BB Riback The traditions of Camp BB Riback are maintained and enhanced every summer by the enthusiasm and creativity of new and returning staff and campers. A role on the staff team at Camp is a great responsibility and a great opportunity. Make a difference for yourself and those you serve – a summer at Camp BB Riback is not just a summer of fun…it is a lifetime of friendships, memories, traditions and skills! Apply today! Examples of common positions at Camp BB Riback include: Job Listings Leadership Team (Manager, Assistant Director) Senior Staff Team – Camper Unit Coordinator Senior Staff Team – Specialty/Activity Area Sr. Specialist Waterfront Specialist – Power Boat, Water Ski, Wake Board Paddle Sports (Canoe/Kayak) Specialist Pool Specialist Horseback Riding Specialist Altitude (High Ropes, Zip Line, Climbing Wall) Specialist Bikes Specialist Discovery (Outdoor Education/Tripping) Specialist Performing Arts Specialist (Musicals & Drama) Creative Arts Specialist (Pottery, Arts & Crafts, etc.) Media Specialist (Camp Photographer/Videographer, AV Specialist, etc.) Bunk/Cabin Counsellor Office & Administration Maintenance Kitchen Staff (Chef, Assistant Cook, Kitchen help, Dishwashers) Camp Nurse/Medic Summer 2025 Staff Application It is important to note that all staff at Camp BB Riback are COUNSELLORS FIRST. This means that the #1 priorities of all persons on the staff team are the safety, health, and happiness of our campers, regardless of areas of responsibility or the specifics of individual job descriptions. It is also possible that ANY staff member may be asked and/or required to provide care for, supervision of, or reside with campers. All staff are also expected to contribute effort and attention to the overall functioning of our programs and services and to assist with the cleaning and maintenance of the facilities and properties when required. Please read and complete this form carefully. Incomplete applications may not be processed. Some positions may require employees that are 18 years of age or older or require specific certifications or experience. Applicants must currently be completing Grade 11 or older. Applications will be reviewed as they come in. Interviews and employment offers may take place as soon as suitable candidates are identified. PREFERENCE MAY BE GIVEN TO EARLY APPLICANTS . Some positions may be filled before the application deadlines (so please apply early) and some positions may remain open past deadlines until suitable candidates are found. Thank you for your interest in employment at Camp BB Riback. If you have any questions or would like to recommend candidates please contact the Director, Stacy Shaikin at shaikin@campbb.com or the camp office at 587-988-9771. To include a cover letter, resume or other documents in your application please email it to the Camp Office. Telephone: 587-988-9771 Tel. Toll Free: 1-800-267-2267 Fax: 1-888-896-9771 Email: info@campbb.com Web: www.campbb.com **TO PRINT OR SAVE A COPY FOR YOUR RECORDS (optional). Each section/page must be printed or saved separately. Right click on the page and select “print”. Choose your printer (for a paper version) or select “Print to PDF” and assign a unique filename and location to save an electronic copy. Repeat this process for each page/section BEFORE clicking “continue”. 2025 Application Forms: CLICK HERE Camp BB Riback Summers of fun & adventure… LIFETIMES of friendships, memories, traditions, and skills: Campers: Grade 1-11 Staff: Grade 12 & Older Resources Donate Dates and Fees Staff Forms Parents Forms FAQ Life and Legacy Social Media Contact Us Toll Free 1-800-267-2267 Calgary 587-988-9771 Email info@campbb.com Sponsors"
    }
  ]
}