{
  "fuentes": [
    {
      "url": "https://www.beachside.directory/about/contact",
      "email": "info@beachside.directory"
    },
    {
      "url": "https://www.beachside.directory/about/contact",
      "email": "name@yoursite.com"
    },
    {
      "url": "https://www.ormondbeach.org/Directory.aspx?did=14",
      "email": "cityclerk@ormondbeach.org"
    },
    {
      "url": "https://ormondbeach.org/1013/Tomoka-Reserve",
      "email": "cityclerk@ormondbeach.org"
    },
    {
      "url": "https://ormondbeach.org/1013/Tomoka-Reserve",
      "email": "comdev@ormondbeach.org"
    },
    {
      "url": "https://www.beachsidevacations.com/contact-us",
      "email": "experience@avantstay.com"
    },
    {
      "url": "https://www.beachsidevacations.com/contact-us",
      "email": "newhomes@avantstay.com"
    },
    {
      "url": "https://www.beachsidellc.com/contact.html",
      "email": "sales@beachsidellc.com"
    },
    {
      "url": "https://www.beachsideormond.com/musicandevents",
      "email": "contact@beachsideormond.com"
    },
    {
      "url": "https://www.beachside.com.au/contact-us",
      "email": "normanville@echoholidayparks.com.au"
    },
    {
      "url": "https://www.beachsideormond.com/home",
      "email": "contact@beachsideormond.com"
    },
    {
      "url": "https://www.beachsideormond.com/",
      "email": "contact@beachsideormond.com"
    },
    {
      "url": "https://beachsidepartners.com/about-us/",
      "email": "jason@beachsidepartners.com"
    },
    {
      "url": "https://beachsidepartners.com/about-us/",
      "email": "jon@beachsidepartners.com"
    },
    {
      "url": "https://beachsidepartners.com/about-us/",
      "email": "jason@beachsidepartners.com"
    },
    {
      "url": "https://beachsidepartners.com/about-us/",
      "email": "jon@beachsidepartners.com"
    },
    {
      "url": "https://beachsidepartners.com/about-us/",
      "email": "lori@beachsidepartners.com"
    },
    {
      "url": "https://beachsidepartners.com/about-us/",
      "email": "lori@beachsidepartners.com"
    },
    {
      "url": "https://beachsidepartners.com/about-us/",
      "email": "nick@beachsidepartners.com"
    },
    {
      "url": "https://beachsidepartners.com/about-us/",
      "email": "nick@beachsidepartners.com"
    },
    {
      "url": "https://beachsidepartners.com/about-us/",
      "email": "team@beachsidepartners.com"
    },
    {
      "url": "https://www.beachsideormond.com/menu",
      "email": "contact@beachsideormond.com"
    },
    {
      "url": "https://beachsidekeywest.com/contact-us",
      "email": "beachside@brightwild.com"
    }
  ],
  "mails": [
    "beachside@brightwild.com",
    "cityclerk@ormondbeach.org",
    "comdev@ormondbeach.org",
    "contact@beachsideormond.com",
    "experience@avantstay.com",
    "info@beachside.directory",
    "jason@beachsidepartners.com",
    "jon@beachsidepartners.com",
    "lori@beachsidepartners.com",
    "name@yoursite.com",
    "newhomes@avantstay.com",
    "nick@beachsidepartners.com",
    "normanville@echoholidayparks.com.au",
    "sales@beachsidellc.com",
    "team@beachsidepartners.com"
  ],
  "nombre_sitio": "beachsideormond.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.beachside.directory/about/contact",
      "text": "Contact Us - The Beachside Directory Contact Us Member Login Get Your Business Listed Home Full Directory Beachside Directory Browse by Category Eat Beer, Wine or Alcohol Breakfast Buffet Catering Delivery Services Dinner Greek Ice Cream/Candy/Desert Indian Italian Lunch Oceanfront Personal Chef Pizza Seafood Thai Stay AirBnB Annual Rentals Hotels and Motels Timeshares Timeshare Sales Timeshare Rentals Things to Do Boating Fishing Kids Activities, Camps, Tutoring Paddleboards, Kayaks, Jet Skis Scuba Yoga Shop Personal Services Alterations, Dry Cleaning & Laundry Auto Service & Repair Beauty Cleaning & Cleaners Health & Fitness Nonprofits Moving & Storage Other Photographers & Videographers Pest Control & Iguana Removal Pets & Pet Needs Postal Services Psychics Senior Care Services Assistance & Care Assisted or Independent Living Facilities Estate or Medicaid Planning Home Modifications Relocation Assistance Travel Transportation Tutoring and Education Weddings & Special Events Professional Services Accounting/Bookkeeping/Payroll/Taxes Banking/Lending Chambers of Commerce and Business Networking Groups Computers/Technology Credit Card Processing Dentists Doctors - Medical Providers Chiropractors Counselors & Therapists Physical Therapy Providers Urgent Care Insurance Lawyers Business Law Elder Law & Estate Planning Immigration Personal Injury Real Estate Marketing, Printers, Graphic Design & Public Relations Other Real Estate Agents Staffing Services Wealth Managers Repairs & Remodeling Air Conditioning Asphalt paving, repairs & striping Commercial New Construction & Renovations Dumpsters Electrical General Flooring Impact Windows or Doors Interior Design Services Kitchens & Baths Other Painters Pools Plumbers Roofers Window Treatments Deals/Coupons Events Calendar View Community Corner Home Full Directory Beachside Directory Browse by Category Eat Beer, Wine or Alcohol Breakfast Buffet Catering Delivery Services Dinner Greek Ice Cream/Candy/Desert Indian Italian Lunch Oceanfront Personal Chef Pizza Seafood Thai Stay AirBnB Annual Rentals Hotels and Motels Timeshares Timeshare Sales Timeshare Rentals Things to Do Boating Fishing Kids Activities, Camps, Tutoring Paddleboards, Kayaks, Jet Skis Scuba Yoga Shop Personal Services Alterations, Dry Cleaning & Laundry Auto Service & Repair Beauty Cleaning & Cleaners Health & Fitness Nonprofits Moving & Storage Other Photographers & Videographers Pest Control & Iguana Removal Pets & Pet Needs Postal Services Psychics Senior Care Services Assistance & Care Assisted or Independent Living Facilities Estate or Medicaid Planning Home Modifications Relocation Assistance Travel Transportation Tutoring and Education Weddings & Special Events Professional Services Accounting/Bookkeeping/Payroll/Taxes Banking/Lending Chambers of Commerce and Business Networking Groups Computers/Technology Credit Card Processing Dentists Doctors - Medical Providers Chiropractors Counselors & Therapists Physical Therapy Providers Urgent Care Insurance Lawyers Business Law Elder Law & Estate Planning Immigration Personal Injury Real Estate Marketing, Printers, Graphic Design & Public Relations Other Real Estate Agents Staffing Services Wealth Managers Repairs & Remodeling Air Conditioning Asphalt paving, repairs & striping Commercial New Construction & Renovations Dumpsters Electrical General Flooring Impact Windows or Doors Interior Design Services Kitchens & Baths Other Painters Pools Plumbers Roofers Window Treatments Deals/Coupons Events Calendar View Community Corner GOT A QUESTION Contact Us Here Fill In The Form to Contact Us * Name * Email Phone Number * Enter A Message * Answer Security Question The security check was not completed successfully. How Can We Help You? Contact us and we'll get back to you shortly. Please be as specific as possible. Be sure to leave your full contact information for the quickest reply. This is a great way to send a message and connect with our team. Join Our Newsletter Click to Subscribe About Finding Beach Area Businesses is easy by searching our trusted network of top-rated Beach Area Businesses. Website How It Works List Your Business Search Browse Categories Browse Locations Support Member Login Contact Us Beach Area Businesses - Get Listed Today © 2025 The Beachside Directory All Rights Reserved Terms of Use Privacy Policy × Member Login * Email Address * Password Forgot Password? Click to Reset Password List your business today List Your Company by Clicking Here × Join Our Newsletter * Answer Security Question The security check was not completed successfully."
    },
    {
      "url": "https://www.ormondbeach.org/Directory.aspx?did=14",
      "text": "Staff Directory • Parks and Recreation Skip to Main Content facebook Instagram Search Government Departments Economic Development Residents How Do I... Home Staff Directory Parks and Recreation Physical Address: Administration Offices 399 North US1 Ormond Beach, FL 32174 Phone: 386-676-3250 Link: Parks and Recreation Page Registration Office Hours Monday - Thursday 8:00 a.m. - 4:30 p.m. Friday 8:00 a.m. - 3:00 p.m. Staff Name Title Email Phone Additional Phone Carolin, Robert Parks and Recreation Director 386-676-3279 Sibley, Stefan Assistant Parks and Recreation Director 386-676-3246 Lisicki, David Facilities Maintenance Contract Manager 386-676-3220 Branning, Austin Assistant Performing Arts Center Coordinator 386-676-3231 Brewer, Ryan Athletic Supervisor 386-676-3280 Britto, Kelly Office Manager 386-676-3277 Dionne, Sara Recreation Program Specialist 386-676-3293 Daly, Siobhan Cultural Center Coordinator 386-676-3216 Dehili, Sam Special Events Coordinator 386-676-3365 Demchak, Michael Contract Manager / Landscape Contracts 386-676-3286 Durost, Kim Office Assistant 386-676-3276 Edwards, Liviston Recreation Leader (South Ormond Neighborhood Ctr) 386-676-3231 Garcia, Sarah Recreation Center Coordinator, Environmental Discovery Center 386-615-7081 Johnson, Sonja Community Events Coordinator 386-676-3241 Koplin, Lori Nova Comm Center & Special Populations Coordinator 386-676-3252 Community Events 351 Andrews Street Ormond Beach FL 32174 Directions Physical Address: View Map 351 Andrews Street Ormond Beach, FL 32174 Phone: 386-676-3241 Link: Community Events Page Hours Monday - Friday 8:00 a.m. - 5:00 p.m. Nova Community Center 440 N Nova Road Ormond Beach FL 32174 Directions Physical Address: View Map 440 N Nova Road Ormond Beach, FL 32174 Phone: 386-676-3252 Hours Monday - Friday 8:00 a.m. - 5:00 p.m. Registration Office 399 North US1 Ormond Beach FL 32174 Directions Physical Address: View Map 399 North US1 Ormond Beach, FL 32174 Phone: 386-676-3250 Link: Leisure Services Page Hours Monday - Friday 8:00 a.m. - 4:30 p.m. The Casements 25 Riverside Drive Ormond Beach FL 32176 Directions Physical Address: View Map 25 Riverside Drive Ormond Beach, FL 32176 Phone: 386-676-3216 Fax: 386-676-3363 Link: The Casements Page Office Hours Monday - Friday 8:30 a.m. - 5:00 p.m. Return to Staff Directory Live Edit Airport Bidding Opportunities Boards & Committees Brownfield Program Budget Information City Commission Codes & Legislation Economic Development Election Information Employment ePlans Leisure Services Mayor's Fitness Challenge Itinerant Application Newsletters/Updates Ormond Crossings Ormond Beach CRAs Road Closures Sports Field Conditions Transparency Reports Utility Payments Pay Your Bill Agendas & Minutes City Commission Tyler Civic Access Permits and Plans Notify Me® Get Connected Show Tickets Purchase Tickets Transparency Keep Informed AlertVolusia Get Emergency Alerts CUSTODIAN OF PUBLIC RECORDS City Clerk 22 South Beach Street Ormond Beach, FL 32174 Email City Clerk Phone: 386-677-0311 Contact Us City Hall 22 South Beach Street Ormond Beach, FL 32174 Phone: 386-677-0311 Under Florida law, e-mail addresses are public records. If you do not want\r\nyour e-mail address released in response\r\nto a\r\npublic records request, do not send electronic\r\nmail to this entity. Instead, contact\r\nthis office by\r\nphone or in writing. Resources Staff Directory City Calendar Frequently Asked Questions Subscribe to City News Contact the City /QuickLinks.aspx Using This Site Home Accessibility & Statement Site Map Copyright Notices Government Websites by CivicPlus® /QuickLinks.aspx Home My Account Printer Friendly Email Page Contact Us Hear This Page RSS Site Map Translate Page Notifications Documents Help Facebook Twitter Pinterest Delicious Blogger LinkedIn Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://ormondbeach.org/1013/Tomoka-Reserve",
      "text": "Tomoka Reserve | City of Ormond Beach, FL - Official Website Skip to Main Content facebook Instagram Search Government Departments Economic Development Residents How Do I... Home Departments Planning / Zoning Development Projects Tomoka Reserve Tomoka Reserve Updates: *12/18/2023 Update: This application has withdrawn and no additional updates will be provided to this webpage. Please see https://www.ormondbeach.org/1036/Tomoka-Reserve-R-2-Zoning for updates to the zoning map amendment application under review. *11/22/2023 Update: The Tomoka Reserve project has withdrawn its application for the PRD Development Order for project PRD 2022-043. A request has been made to move forward with their zoning map amendment application from PRD, Planned Residential Development, to R-2, Single-Family Low Density. The letter is provided here . No date for a Planning Board meeting has been established and updates will be provided on the city's website. *11/03/2023 Update: The City Commission packet is available on the City's website at www.ormondbeach.org/agenda . *11/03/2023 Update: The City Commission audio link (during the meeting) is: https://youtube.com/live/4whfV-AGgPg?feature=share . *11/03/2023 Reminder: The City Commission meeting will be held at Calvary Christian Center, 1687 West Granada Boulevard and will start at 6:00 p.m. *10/04/2023 Update: The first reading of the Tomoka Reserve application for the issuance of the development order is scheduled for November 7, 2023 as part of the regular City Commission agenda. The meeting will be held at Calvary Christian Center, 1687 West Granada Boulevard and will start at 6p.m. There have been no project updates as of October 4, 2023. **09/22/2023 Update: Link for broadcast of September 26, 2023 Planning Board: https://youtube.com/live/QzTA4geTe_U?feature=share *09/14/2023 Update: Planning Board report for the September 26, 2023 Planning Board meeting is provided below. *09/07/2023 Update: Site plan submittal provided below. *09/07/2023 Update: Planning Board meeting to be held on September 26, 2023 at Calvary Christian Center at 1687 West Granada Boulevard, Ormond Beach, FL 32174, starting at 6:00 p.m. *08/17/2023 Update: There are three updates from the Planning Board continuation packet issued August 11, 2023. The first update (Attachment 16) which is additional correspondence from August 10, 2023 to August 16, 2023. The second update (Attachment 17) is additional information provided by the applicant. The third update (Attachment 18) is a staff PowerPoint detailing the applicant's responses to staff recommendations. The updates are provided below and on the Planning Board webpage located here . *08/17/2023 Update: City staff received additional information (Attachment 17) from the project team for the Tomoka Reserve project. This material is supplemental to the existing submittal and has not been reviewed by the Site Plan Review Committee. The Planning Board can act upon the original site plan presented at the July 13, 2023 meeting. CIty staff would advise the Planning Board that the additional information should be considered a material change. If there is a desire to alter the site plan presented on July 13, 2023 then an additional review by the Site Plan Review Committee (SPRC), public notice, and the opportunity for public comments. It is important to note that the August 21, 2023 Planning Board meeting has been advertised as a continuation of July 13, 2023 with no public/audience comments based upon where the July 13, 2023 meeting stopped. Any material change is required to occur with public notification and a new public hearing. **08/11/2023 Update: The August 21, 2023 Planning Board packet is available and located here . ** 08/02/2023 Update: The continuation of the July 13, 2023 Planning Board meeting shall occur on August 21, 2023 starting at 6:00 p.m. at Tomoka Christian Church, located at 1450 Hand Avenue . **08/02/2023 Update: The continuation of the July 13, 2023 Planning Board meeting was in the Board discussion portion of the meeting and this is where the August 21, 2023 meeting shall resume. The Planning Board may call upon city staff, the applicant and the Tomoka Oaks Homeowners' Association for any updates or questions during the Board discussion. Because the audience/public comments portion of the Planning Board meeting have concluded and been closed, there will not be comment cards available or the opportunity for public comments at the August 21, 2023 continuation meeting. **08/02/2023 Update: Link for recording of July 13, 2023 Planning meeting: https://youtube.com/live/ZtdFx0FIdq8?feature=share **07/03/2023 Update: The Planning Board packet is available and located here . **06/22/2023 Update: The Tomoka Reserve project has been scheduled for the July 13, 2023 Ormond Beach Planning Board meeting to be held at Calvary Christian Center at 1687 West Granada Boulevard, Ormond Beach, FL 32174, starting at 6:00 p.m. Additional information is provided below under the Planning Board section. **06/09/2023 Update: The Tomoka Reserve project is tentatively scheduled for July 13, 2023 Planning Board.  Written comments on the project for inclusion in the packet can be sent to comdev@ormondbeach.org - please include \"For Planning Board\" in subject line. **06/09/2023 Update: SPRC resubmittal for July 13, 2023 Planning Board received. **05/11/2023 Update: SPRC comments (3rd review issued). **04/12/2023 Update: Updated traffic impact analysis available under the Status section. **02/21/2023 Update: SPRC comments issued and provided below under Status section. **01/23/2023 Update: The Tomoka Reserve project requested a 90-day extension to their required site plan resubmittal from January 28, 2023 to April 28, 2023 which staff granted under Section 4-05 of the Land Development Code. **01/19/2023 Update: The neighborhood meeting notice for February 8, 2023 is available here . **01/19/2023 Update: The second submittal for the project is provided below.  The project's neighborhood meeting is required to occur prior to the second SPRC review comments. **12/15/2022 Update: The review of the Traffic Impact Analysis is available here . **12/15/2022 Update: The project has identified hazardous trees that require removal and the information is available here . **11/17/2022 Update: The project team requested a 90 day extension to respond to Site Plan Review Committee comments.  A resubmital (or an additional extension) is required on or before January 28, 2023. **9/21/2022 Update: A traffic impact analysis has been received by city staff and is available here . **8/8/2022 Update: A demolition application has been submitted and is under review for all structures associated with the former Tomoka Oaks golf course property.  Demolition permits are reviewed/issued/inspected by the city's Building Department. Status: Pre-application meeting: January 5, 2022. Submittal of site plan: April 13, 2022 (1st review), January 19, 2023 (2nd review), May 1, 2023 (3rd review), June 8, 2023 (4th review). Submittal of Planned Development amendment: April 13, 2022. Site Plan Review Committee (SPRC) review: May 3, 2022 (1st), February 21, 2023 (2nd review), May 11, 2023 (3rd review). June 28, 2023 (4th review), DUE September 13, 2023 (5th review) *06.28.2023, Request for additional information, SPRC comments - Tomoka Reserve *06.28.2023, Correspondence received during 4th review . * 05.11.2023, Request for additional information, SPRC comments - Tomoka Reserve. *05.11.2023, Correspondence received during 3rd review. * 05.05.2023, Traffic Impact Analysis comments. *02.21.2023, Request for additional information, SPRC comments - Tomoka Reserve *02.20.2023, Correspondence received from 01.19.2023 to 02.20.2023 *05.03.2022, Request for additional information, SPRC comments - Tomoka Reserve *05.03.2022, Correspondence received during 1st SPRC review September 26, 2023 Planning Board Information September 26, 2023 Planning Board Agenda Staff Report Outline Combined Staff Report Staff Report Attachment 1: Outstanding SPRC comments Attachment 2: Maps Attachment 3: Correspondence received Attachment 4: Traffic Information Attachment 5: Environmental Information Attachment 6: School Concurrency Attachment 7: Neighborhood Meeting summaries Attachment 8: Analysis of development ability Attachment 9: Applicant provided information Attachment 10: Site plan, September 6, 2023 Attachment 11: Planning Board minutes Attachment 12: PowerPoints Attachment 13: Older information that has been updated Site plan Submittal from September 6, 2023 Site plan submitted 09.06.2023 Documents from September 6, 2023 2023 09 06 Buffer Tree Planting Locations 2023 09 06 v2 Buffer Planting Maintenance Plan Project Narrative - PB Revision List Revised architectural standards for PB Additional Review Tomoka Oaks- Nova Rd. Road Diet Tech Memo DRAFT (2023-08-31) Information submitted after the Planning Board. Attachment 12: Additional correspondence after Planning Board packet Attachment 13: Additional Cobb Cole information Attachment 14: Staff and applicant PowerPoints Attachment 15: Additional Correspondence - 07.13.2023 to 08.10.2023 Attachment 16: Additional Correspondence - 08.10.2023 to 08.16.2023 Attachment 17: Additional Information provided by the applicant on 08.16.2023 Attachment 18: Staff PowerPoint detailing the applicant's responses to staff recommendations Planning Board information Planning Memorandum regarding application process, 08.02.2023 . Location map of Tomoka Christian Church, meeting location of Planning Board continuation meeting on 08.21.2023 . Planning Memorandum regarding application process, 06.22.2023. Abutter Letter notice, 06.23.2023. Location map of Calvary Christian Church, meeting location of Planning Board meeting Planning Board Staff Report 07.13.2023 Tomoka Reserve, Issuance of a Development Order, PB Report - Combined 07.13.2023 Tomoka Reserve, Issuance of a Development Order, PB Report Attachment 1 - SPRC Comments Attachment 2 - Location, land use, and zoning maps Attachment 3 - Correspondence received Attachment 4 - Traffic Attachment 5 - Environmental Information Attachment 6 - School concurrency Attachment 7- Neighborhood meeting Attachment 8 - Setbacks Attachment 9 - Ownership Attachment 10 - Applicant provided information Attachment 11 - Site Plans Site Plan update, submitted 06.26.2023 Tomoka Reserve, site plan update Site Plan submitted 06.08.2023 Tomoka Reserve site plan, 06.08.2023 combined 21067 Setbacks C4 (1) Draft 4 Buffer Planting Maintenance Plan (06.06.23) PD1_21067 COV PD2-PD6_21067 ODP PD2 (1) PD2-PD6_21067 ODP PD3 (1) PD2-PD6_21067 ODP PD4 (1) PD2-PD6_21067 ODP PD5 (1) PD2-PD6_21067 ODP PD6 (1) PD2-PD6_21067 ODP PD7 (1) PD2-PD6_21067 ODP PD8 (1) PD2-PD8_21067 ODP VT (1) PD7-PD8_21067 UTL PD9 PD7-PD8_21067 UTL PD10 Document submitted 06.08.2023 Project Narrative-Waiver List Property Record Card Tomoka Oaks-Revised Updated TIA Revised (2023-06-07) Tomoka Oaks Env. Summary Letter Updated TIA Response to Comments 3rd Sufficiency 2023-06-07 Site Plan submitted 04.28.2023 Tomoka Reserve site plan, 04.28.2023 Documents submitted 04.28.2023 Response Letter 04.28.23 04.11.2023, Response comments to TIA 04.11.2023, Updated Traffic Impact Analysis 04.12.2023, Triumph Oaks, Ownership Phase 4 Storm Calcs Density Study Exhibit B 04.27.23 Finding of Adequacy Tomoka Reserve Project Narrative 04.28.23 Updated Traffic Impact Analysis 04.11.2023 Updated traffic impact analysis Response to traffic comments Neighborhood Meeting Letter notice Second submittal Planned Residential Development plans Documents 21067 Tomoka Reserve Storm Package 21067 Tomoka Reserve Water distribution Calculations Connectivity Map Holding Summary LDC Standards Review for Tomoka Reserve Owner's Policy of Title Insurance - For submittal Project Narrative and Waiver List Resident Response letter Tomoka Reserve Rezoning Response letter Tomoka Reserve Summary of Tomoka Oaks Resident Meeting Tomoka Reserve Bike Ped Memo Traffic study information: 09.21.2022 Traffic Impact Analysis 06.01.2022, Tomoka Oaks methodology approval letter.pdf 5361.04 Response to City Methodology Comments - finalized 5.16.22 5361.04 Response to Buckholz Methodology Comments - finalized 5.16.22 5361.02 Tomoka Oaks - TIA Methodology - Updated RTC Information submitted April 13, 2022 (1st review) Site Plan Tomoka Reserve PD Plans Tomoka Reserve Survey Documents Tomoka Reserve PD Application Tomoka Reserve PD Authorization Tomoka Reserve PD BA_ESA Triumph Oaks Tomoka Reserve PD Cover Letter Tomoka Reserve PD Deed Tomoka Reserve PD Narrative PD Property Appraiser Card Tomoka Reserve PD Sunbiz Information Tomoka Reserve PD TIA Methodology - Submitted 03.01.22 Tomoka Reserve SPRC Site Plan Application Neighborhood meeting: Required. February 8, 2023. Planning Board: Required. July 13, 2023. Continuation on September 26, 2023 - Calvary Christian Center. City Commission (1st reading): Required. To be determined. City Commission (2nd reading): Required. To be determined. 121 East Breakaway Trails - Commercial Tract A Ormond Beach Holdings, LLC Ormond Enclave Plantation Oaks Major Amendment Tattersall at Tymber Creek Tomoka Reserve Tomoka Reserve, R-2 Zoning Tomoka Reserve – Order of Denial Tymber Creek Apartments Utility Payments Pay Your Bill Agendas & Minutes City Commission Tyler Civic Access Permits and Plans Notify Me® Get Connected Show Tickets Purchase Tickets Transparency Keep Informed AlertVolusia Get Emergency Alerts CUSTODIAN OF PUBLIC RECORDS City Clerk 22 South Beach Street Ormond Beach, FL 32174 Email City Clerk Phone: 386-677-0311 Contact Us City Hall 22 South Beach Street Ormond Beach, FL 32174 Phone: 386-677-0311 Under Florida law, e-mail addresses are public records. If you do not want\r\nyour e-mail address released in response\r\nto a\r\npublic records request, do not send electronic\r\nmail to this entity. Instead, contact\r\nthis office by\r\nphone or in writing. Resources Staff Directory City Calendar Frequently Asked Questions Subscribe to City News Contact the City /QuickLinks.aspx Using This Site Home Accessibility & Statement Site Map Copyright Notices Government Websites by CivicPlus® /QuickLinks.aspx Home My Account Printer Friendly Email Page Contact Us Hear This Page RSS Site Map Translate Page Notifications Documents Help Facebook Twitter Pinterest Delicious Blogger LinkedIn Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.beachsidevacations.com/contact-us",
      "text": "Contact Us | Beachside Vacations (843) 886-5586 Vacation Rentals Events & Offsites Property Management Homeowner Portal Let's get in touch We’re always happy to answer questions or show off our homes. Drop us a line and we’ll get back to you as soon as possible! ​ ​ ​ Send Meet 1517 Palm Blvd, Suite F Isle of Palms, South Carolina 29451 Email experience@avantstay.com Phone (843) 886-5586 9am - 5pm ET We are here to set the new standard for short-term rental experiences. For guest & booking inquiries: experience@avantstay.com (843) 886-5586 For property management inquiries: newhomes@avantstay.com (855) 683-1768 Are you a current homeowner? Log in to Lighthouse Quick Links Home Vacation Rentals Beach Gear Site Map Travel Protection Insurance Area Guide Activities and Services Isle of Palms Sullivan's Island Wild Dunes Wild Dunes Amenities Historic Charleston Things To Do Blog About Us Directions Contact Us Sign Up for Our Newsletter Property Management Real Estate Privacy Policy Stay in the loop Keep up with our featured homes, new locations, and travel tips! Oh, and get $100 off your first stay with us. First name Email Sign up Facebook Facebook Instagram Instagram Twitter YouTube YouTube Terms & Conditions Privacy Policy Affirm Disclosures © 2025 AvantStay, Inc. All rights reserved. Terms & Conditions Privacy Policy Affirm Disclosures Facebook Facebook Instagram Instagram Twitter YouTube YouTube © 2025 AvantStay, Inc. All rights reserved."
    },
    {
      "url": "https://www.beachsidellc.com/contact.html",
      "text": "Contact - Beachside Software - software development, support and private cloud hosting +1 (573) 427-7896 sales@beachsidellc.com Toggle navigation Home About Technology Java .Net Lotus Notes PHP Expertise Front-end Development Sales Force Development OutSystems Platform Development BPO Medical Billing Medical Coding Accounting Executive Team Contact Contact US Thank you for your interest in Beachside Software 's services. We will be glad to answer all your questions as well as estimate any project of yours. Our specialists will process the request and we will get back to you to provide a valuable insight. Contact Info Telephone +1 (573) 427-7896 Mail sales@beachsidellc.com Location 241 Rope Mill Pkwy, Woodstock, GA, 30188, USA Contact Form Name: * Company Name: Mobile Number * Email ID: * Message: © Beachside Software . 2019. All Rights Reserved."
    },
    {
      "url": "https://www.beachsideormond.com/musicandevents",
      "text": "Music & Events — Beachside 0 Skip to Content About Menu Music & Events Gallery Our Venues Merchandise Contact Subscribe VIP Members Open Menu Close Menu About Menu Music & Events Gallery Our Venues Merchandise Contact Subscribe VIP Members Open Menu Close Menu About Menu Music & Events Gallery Our Venues Merchandise Contact Subscribe VIP Members Salty D’s HOURS Salty D’s is normally closed Mondays & Tuesdays… but you know we love to make exceptions! 🍹 Keep an eye on our calendar for special events like Margaritaville Monday and Latin Night ! you never know when we’ll be throwing a party. 🎶 Monday Closed Tuesday Closed Wednesday 4 PM–10 PM Thursday 4 PM -10 PM Friday 11 AM–11 PM Saturday 10 AM–11 PM Sunday 10 AM–7PM Location 790 S Atlantic Ave Ormond Beach, FL 32176 Contact contact@beachsideormond.com (386) 888-0790"
    },
    {
      "url": "https://www.beachside.com.au/contact-us",
      "text": "Contact Us — Beachside Holiday Park 0 Skip to Content Home About Us Group Bookings Park Map FAQ Gallery Accommodation Family Cabin 6 Berth Family Cabin 5 Berth Family Cabin Accessible 4 Berth Pet Friendly Family Cabin Pet Friendly Deluxe Cabin Deluxe Cabins Spa Cabin 4 Berth Spa Cabin 2 Berth Powered Sites Holiday Deals Activities & Facilities Local Attractions Contact Us Book Today Open Menu Close Menu Home About Us Group Bookings Park Map FAQ Gallery Accommodation Family Cabin 6 Berth Family Cabin 5 Berth Family Cabin Accessible 4 Berth Pet Friendly Family Cabin Pet Friendly Deluxe Cabin Deluxe Cabins Spa Cabin 4 Berth Spa Cabin 2 Berth Powered Sites Holiday Deals Activities & Facilities Local Attractions Contact Us Book Today Open Menu Close Menu Folder: Home Back About Us Group Bookings Park Map FAQ Gallery Folder: Accommodation Back Family Cabin 6 Berth Family Cabin 5 Berth Family Cabin Accessible 4 Berth Pet Friendly Family Cabin Pet Friendly Deluxe Cabin Deluxe Cabins Spa Cabin 4 Berth Spa Cabin 2 Berth Powered Sites Folder: Holiday Deals Back Activities & Facilities Local Attractions Contact Us Book Today Contact Us We Have Re-branded! Same Park. Same Managers. New Name, Look and Owners. Click to go to Echo Holiday Parks Get in Touch If you have any questions or comments, please don’t hesitate to reach out using the contact form or via phone. Email: normanville@echoholidayparks.com.au Phone: 08 8558 2458 Name * First Name Last Name Email * Phone (###) ### #### Message * Thank you! We’ll be in touch with you shortly. Beachside Holiday Park is the ultimate family destination in the quaint South Australian small town of Normanville. Address: 157 Williss Drive, Normanville, SA, 5204, Australia Phone: 08 8558 2458 Email: normanville@echoholidayparks.com.au Owned by Caravan Park Op Co PTY LTD Quick Links Home Accommodation Holiday Deals Activities & Facilities Local Attractions Contact Us Help & FAQs FAQs Park Information Privacy Policy Cancellation and Refund Policy Terms & Conditions Park Information © 2025 Beachside Holiday Park. | All Rights Reserved."
    },
    {
      "url": "https://www.beachsideormond.com/home",
      "text": "Home — Beachside 0 Skip to Content About Menu Music & Events Gallery Our Venues Merchandise Contact Subscribe VIP Members Open Menu Close Menu About Menu Music & Events Gallery Our Venues Merchandise Contact Subscribe VIP Members Open Menu Close Menu About Menu Music & Events Gallery Our Venues Merchandise Contact Subscribe VIP Members Make it stand out It all begins with an idea. Maybe you want to launch a business. Maybe you want to turn a hobby into something more. Or maybe you have a creative project to share with the world. Whatever it is, the way you tell your story online can make all the difference. Discover Culinary Delights Featured Products Flavor Fiesta $25 Table Tantalizer $25 Taste Journey $25 Shop all Get to know us Welcome to our vibrant world of flavors where your taste buds take the lead on a whimsical culinary escapade! Join us for an unforgettable adventure, where every dish tells a story and every meal is a reason to celebrate. Learn more Follow us on social Social Contact Us Interested in working together? Fill out some info and we will be in touch shortly. We can’t wait to hear from you! Name * First Name Last Name Email * Message * Thank you! Salty D’s HOURS Salty D’s is normally closed Mondays & Tuesdays… but you know we love to make exceptions! 🍹 Keep an eye on our calendar for special events like Margaritaville Monday and Latin Night ! you never know when we’ll be throwing a party. 🎶 Monday Closed Tuesday Closed Wednesday 4 PM–10 PM Thursday 4 PM -10 PM Friday 11 AM–11 PM Saturday 10 AM–11 PM Sunday 10 AM–7PM Location 790 S Atlantic Ave Ormond Beach, FL 32176 Contact contact@beachsideormond.com (386) 888-0790"
    },
    {
      "url": "https://www.beachsideormond.com/",
      "text": "Beachside 0 Skip to Content About Menu Music & Events Gallery Our Venues Merchandise Contact Subscribe VIP Members Open Menu Close Menu About Menu Music & Events Gallery Our Venues Merchandise Contact Subscribe VIP Members Open Menu Close Menu About Menu Music & Events Gallery Our Venues Merchandise Contact Subscribe VIP Members Hello there! Welcome to Beachside, where good times, ocean breezes, and great food await! I’m Dee, your new owner! I’m thrilled to finally make my dream a reality and to bring a lively and laid-back atmosphere to Ormond Beach. We are family-owned and operated and passionate about serving up the freshest meals and creating the best experience in town. Come join us on the weekends for some dancing and indulge in our delicious meals featuring secret recipes you won't find anywhere else. Prepare yourself for a culinary adventure at our vibrant new venue, The Lounge at Beachside! Located downstairs, you can groove to live music or head upstairs to our deck for breathtaking ocean views and refreshing sea breezes. With mouthwatering dishes, a lively atmosphere, and memories waiting to be made, it's the perfect spot to unwind and enjoy the best of beach life! Join us and experience the fun—your table is waiting! DINE, DANCE, REPEAT. now serving weekend brunch! now serving weekend brunch! now serving weekend brunch! “ Awesome family owned ...great food...fun music ....a must visit !!! Food: 5/5  |  Service: 5/5  |  Atmosphere: 5/5 ” — Google Review “ First time here, best of the best! Great music and service ” — Google Review “ Nice owners, very involved! Great bands, music starts early and it’s not too loud! Food: 5/5  |  Service: 5/5  |  Atmosphere: 5/5 ” — Google Review “ Amazing evening ! Music, upbeat & fantastic food! We enjoyed the Ribeye and it was the best we’ve had in Daytona Beach! Owners are super friendly and staff on top of things. What an awesome experience. Won’t be our last!! Food: 5/5  |  Service: 5/5  |  Atmosphere: 5/5 ” — Google Review “ Love the atmosphere here. The food and drinks were wonderful. We had the opportunity to meet the owners. They were great as well. They recently took over ownership in September and they are doing a great job in the neighborhood. He must frequent this local and locally owned business. Live music all weekend and great food and drinks Wednesday through Sunday. Food: 5/5  |  Service: 5/5  |  Atmosphere: 5/5 ” — Google Review “ So many good things to say: Soulfire band will keep you dancing and Rockin’. Our servers, being a foodie I have to brag on the food. Been here about five times and had five different food items and you will not be disappointed. Food: 5/5  |  Service: 5/5  |  Atmosphere: 5/5 ” — Google Review “ Great food, great bands, great owners and staffs !!! Food: 5/5  |  Service: 5/5  |  Atmosphere: 5/5 ” — Google Review “ Had a wonderful meal. The Ribeye is so awesome very friendly atmosphere and the band Soulfire was very entertaining. Best date night the wife and I have had in a very very long time would love to congratulate the owners Mike and Dee on a job well done keep up the awesome hard work your staff is very organized. Food: 5/5  |  Service: 5/5  |  Atmosphere: 5/5 ” — Google Review “ My family came here in October and were very impressed with this place, so we decided to come back for NYE. I tell you the food is amazing, we’ve had the Pork tacos, Chicken/pork skewers with rice, burgers, shrimp and oh so delicious feta fries. Real chef with great food not just bar food. The staff are always friendly and steady checking on us, Kiana and Ocean are super fun. The owners Dee and Mike are very gracious hosts and very awesome people. The downstairs lounge is so beautifully decorated and what a great view upstairs on the deck. They have a nice variety of entertainment with live music, open jam and just music playing on the house speakers. We come to Daytona from Georgia often and look forward to visiting them each time. We would definitely recommend coming here. Food: 5/5  |  Service: 5/5  |  Atmosphere: 5/5 ” — Google Review Meet Your Head Chef Rafael MENU WEEKEND BRUNCH MUSIC & EVENTS GALLERY MERCHANDISE CONTACT Subscribe Don’t miss out! Sign up now to receive our monthly calendar and all upcoming events! First Name Last Name Email Address Sign Up We respect your privacy, DONT FORGET TO LIKE US ON FACEBOOK! Facebook Thank you! Salty D’s HOURS Salty D’s is normally closed Mondays & Tuesdays… but you know we love to make exceptions! 🍹 Keep an eye on our calendar for special events like Margaritaville Monday and Latin Night ! you never know when we’ll be throwing a party. 🎶 Monday Closed Tuesday Closed Wednesday 4 PM–10 PM Thursday 4 PM -10 PM Friday 11 AM–11 PM Saturday 10 AM–11 PM Sunday 10 AM–7PM Location 790 S Atlantic Ave Ormond Beach, FL 32176 Contact contact@beachsideormond.com (386) 888-0790"
    },
    {
      "url": "https://beachsidepartners.com/about-us/",
      "text": "Multi-Family Advisors | Beachside Partners Skip to content Home About Us About Us Our Services Current Offerings Sales Portfolio Sales Portfolio Deal Stories Contact Us Home About Us About Us Our Services Current Offerings Sales Portfolio Sales Portfolio Deal Stories Contact Us About Us At Beachside Partners, our approach is simple: treat every transaction with the care and commitment we’d give our own. We’re not just here to make a sale we’re here to be true advisors. Whether our clients are buying, selling, or planning for the future, we focus on what’s best for them not just what closes a deal. We own multifamily property ourselves, so we understand what it means to be on both sides of a transaction. That ownership mindset shapes how we work we bring clear guidance, strong analytics, and real-world experience to help our clients make smart, confident decisions. More than anything, we believe in building long-term relationships. Our clients trust us because we show up with honesty, transparency, and a commitment to doing things the right way even when it’s not the easy way. Jonathan Standring FOUNDER | DRE#01893163 | 805-689-1919 JON@BEACHSIDEPARTNERS.COM Jon Standring is the Founder and President of Beachside Partners, a Santa Barbara based real estate advisory firm specializing in multifamily real estate along California’s South Coast. Since obtaining his broker’s license in 2010, Jon has closed over $350 million in real estate transactions throughout California. After graduating from UCSB in 2008, Jon began his career at Orion Realty Group, a subsidiary of Fidelity National Financial, where he managed corporate leasing across the country. He later joined Radius Group, focusing on multifamily sales throughout Santa Barbara County. In 2015, he launched Beachside Partners to offer a more hands-on, advisory-first approach rooted in local expertise, transparency, and long-term relationships.  Jon brings clarity and strategy to the table, making him a trusted resource for clients who want to explore every option before making informed, confident decisions. His passion for real estate goes beyond transactions. As President of the Coastal Housing Coalition, Jon is actively involved in advancing housing solutions that support Santa Barbara’s local workforce and protect the region’s long-term vitality. Through this role, he collaborates with public and private stakeholders to shape policy, raise awareness, and drive meaningful action around community based housing. Outside of work, Jon is a dedicated father who loves coaching his sons’ youth sports and enjoying life in Santa Barbara with his wife, Lisa, and their three boys: James, Jacob, and Luke Riley. Contact Jon Nick Henry PARTNER  |  DRE#01748131 | 805-705-7311 NICK@BEACHSIDEPARTNERS.COM Nick Henry specializes in the sale of apartment buildings in Ventura & Santa Barbara Counties. Since 2008, Henry has closed 200 real estate transactions totaling over $275 million in sales. He has represented numerous investors, as well as multiple affordable housing agencies, in buying and selling both large and small multifamily investment properties. Mr. Henry owns multiple apartment buildings himself. Prior to practicing brokerage, Nick managed approximately 50 apartment buildings and homes at one of the largest property management companies in Santa Barbara. Mr. Henry is a graduate of the University of California, Santa Cruz.  Outside of real estate Nick enjoys spending time with his wife and 3 boys and being as active as possible through mountain biking, surfing and coaching youth sports. Contact Nick Lori Zahn ASSOCIATE BROKER  |  DRE#01914851 | 805-451-2712 LORI@BEACHSIDEPARTNERS.COM Covering the tri-counties from Ventura through San Luis Obispo, Lori’s path has taken her from duplexes through $75M portfolio sales. Prior to joining Beachside Partners as an Associate Broker, Lori spent 11 years with Radius Commercial Real Estate and Investments where she played an integral role on a highly successful team specializing in multi-family sales. The immense diversity of her transactions makes navigating complexities her trademark/specialty. Owning a personal portfolio including multi-family, commercial and residential properties, along with her construction background, are the beginning of her skill set. She is determined to have transactions be seamless for her clients. Zahn integrates creativity, value-creation, determination and authenticity to the buyers and sellers she represents; serving them with excellence and integrity. As a California native, Lori has deep roots in Santa Barbara and regularly volunteers with many local non-profits. She and her husband own Sol Wave Water Inc, a water conditioning company, she is a Board Member for the Santa Barbara Rental Property Association, member of Santa Barbara Navy League, Honorary Plank Owner of the USS Santa Barbara, prior Co-Chair for Heart Walk & Executive Committee “Go For Red” – American Heart Association, and active participant for SGI-USA – Santa Barbara. Contact Lori Jason Liehr ASSOCIATE AGENT  |  DRE#02152826 | 805-406-6463 JASON@BEACHSIDEPARTNERS.COM Jason specializes in the sale of multi-family properties within the Santa Barbara and Ventura territories. Since 2021 Jason has closed over 50 commercial real estate transactions along the south coast. His deep understanding of the local markets and refined analytical acumen serve as the foundation for his ability to provide invaluable strategic advice to his clients. Jason has earned a reputation for building lasting relationships that are based off integrity and care. Prior to joining Beachside Partners, Jason worked for a local brokerage firm where he brokered a multitude of lease and sale transaction in the industrial, retail and office sector. This depth of knowledge across product types allows Jason to utilize customized strategies to navigate complex transactions and provide exceptional results. Jason has resided in Santa Barbara since 2010 and is a graduate from the University of California Santa Barbara. He currently lives in Goleta with his wife and one young daughter. Contact Jason Agent Territory Map From Ventura County to San Luis Obispo County Beachside Partners has established themselves as premier Multi-Family advisors. Instagram Linkedin Facebook Navigation Home About Us About Us Our Services Current Offerings Sales Portfolio Sales Portfolio Deal Stories Contact Us Home About Us About Us Our Services Current Offerings Sales Portfolio Sales Portfolio Deal Stories Contact Us Get In Touch 128 E. Carrillo Street, Santa Barbara, CA 93101 Team@BeachsidePartners.com 805-453-5097 DRE#02001768 © 2025 Beachside Partners, Inc. DRE#02001768  All material presented herein is intended for informational purposes only and is compiled from sources deemed reliable but has not been verified. Multi Family Advisors Home About Us About Us Our Services Current Offerings Sales Portfolio Sales Portfolio Deal Stories Contact Us © 2022 All Rights Reserved"
    },
    {
      "url": "https://www.beachsideormond.com/menu",
      "text": "Menu — Beachside 0 Skip to Content About Menu Music & Events Gallery Our Venues Merchandise Contact Subscribe VIP Members Open Menu Close Menu About Menu Music & Events Gallery Our Venues Merchandise Contact Subscribe VIP Members Open Menu Close Menu About Menu Music & Events Gallery Our Venues Merchandise Contact Subscribe VIP Members BRUNCH EVERY SATURDAY 10-1 & ALL DAY SUNDAY Salty D’s HOURS Salty D’s is normally closed Mondays & Tuesdays… but you know we love to make exceptions! 🍹 Keep an eye on our calendar for special events like Margaritaville Monday and Latin Night ! you never know when we’ll be throwing a party. 🎶 Monday Closed Tuesday Closed Wednesday 4 PM–10 PM Thursday 4 PM -10 PM Friday 11 AM–11 PM Saturday 10 AM–11 PM Sunday 10 AM–7PM Location 790 S Atlantic Ave Ormond Beach, FL 32176 Contact contact@beachsideormond.com (386) 888-0790"
    },
    {
      "url": "https://beachsidekeywest.com/contact-us",
      "text": "Contact Us | Key West Oceanfront Hotel | Beachside Resort ROOMS DINING RESORT AMENITIES MEETINGS & EVENTS CALENDAR CONTACT US BOOK NOW BOOK NOW FAQ CONTACT US CONTACT US CONTACT US Check-in & check out What time is check-in and check-out? What time is check-in and check-out? What time is check-in and check-out? Can I request an early check-in or late check-out? Can I request an early check-in or late check-out? Can I request an early check-in or late check-out? Can I manage my reservation online? Can I manage my reservation online? Can I manage my reservation online? What is the cancellation policy? What is the cancellation policy? What is the cancellation policy? Can I store my luggage before check-in or after check-out? Can I store my luggage before check-in or after check-out? Can I store my luggage before check-in or after check-out? Is the resort pet-friendly? Is the resort pet-friendly? Is the resort pet-friendly? Housekeeping & Facilities Is housekeeping service available? Is housekeeping service available? Is housekeeping service available? Need extra supplies? Need extra supplies? Need extra supplies? Is this hotel is a smoke-free property? Is this hotel is a smoke-free property? Is this hotel is a smoke-free property? Do you have a business center? Do you have a business center? Do you have a business center? Is there an onsite laundry facility? Is there an onsite laundry facility? Is there an onsite laundry facility? What kind of coffee makers are in each residence? What kind of coffee makers are in each residence? What kind of coffee makers are in each residence? ACTIVITES & WELLNESS Is the pool heated year-round? Is the pool heated year-round? Is the pool heated year-round? What are the pool and hot tub hours? What are the pool and hot tub hours? What are the pool and hot tub hours? How deep is the pool? How deep is the pool? How deep is the pool? Are pool towels provided? Are pool towels provided? Are pool towels provided? Is there a gym onsite? Is there a gym onsite? Is there a gym onsite? Do you offer fitness classes? Do you offer fitness classes? Do you offer fitness classes? Is there an onsite concierge? Is there an onsite concierge? Is there an onsite concierge? Can I reserve an excursion before arrival? Can I reserve an excursion before arrival? Can I reserve an excursion before arrival? PARKING & TRANSPORTATION Can I park onsite? Can I park onsite? Can I park onsite? Is there a parking fee? Is there a parking fee? Is there a parking fee? Can I dock my boat at the resort? Can I dock my boat at the resort? Can I dock my boat at the resort? Do you offer a shuttle service? Do you offer a shuttle service? Do you offer a shuttle service? Is there an airport shuttle? Is there an airport shuttle? Is there an airport shuttle? Can I schedule a custom shuttle pickup outside of designated stops? Can I schedule a custom shuttle pickup outside of designated stops? Can I schedule a custom shuttle pickup outside of designated stops? RESTAURANTS & DINING What are the dining options at the resort? What are the dining options at the resort? What are the dining options at the resort? Is room service available? Is room service available? Is room service available? Where can I get ice? Where can I get ice? Where can I get ice? CONTACT US FOR MORE INFORMATION CONTACT US FOR MORE INFORMATION ADDRESS 3841 N Roosevelt Blvd Key West, FL 33040 EMAIL beachside@brightwild.com PHONE 305-330-5681 ADDRESS 3841 N Roosevelt Blvd Key West, FL 33040 EMAIL beachside@brightwild.com PHONE 305-330-5681 For more information about our facilities or services please contact us via phone or email and we will get back to you within 24 hours. For more information about our facilities or services please contact us via phone or email and we will get back to you within 24 hours. NAME EMAIL MESSAGE SUBMIT SUBMIT SUBMIT FROM POOLSIDE TO BEACHSIDE YOUR KEY WEST RETREAT AWAITS BOOK NOW Beachside resort 3841 N Roosevelt Blvdâ¨â¨Key West, FL 33040 NAVIGATION Home Rooms Dining Amenities Meetings & Events Calendar Contact Us FAQ Resort Map CONNECT beachside@brightwild.com 305 330-5681 FROM POOLSIDE TO BEACHSIDE YOUR KEY WEST RETREAT AWAITS BOOK NOW Beachside resort 3841 N Roosevelt Blvdâ¨â¨Key West, FL 33040 NAVIGATION Home Rooms Dining Amenities Meetings & Events Calendar Contact Us FAQ Resort Map CONNECT beachside@brightwild.com 305 330-5681 FROM POOLSIDE TO BEACHSIDE YOUR KEY WEST RETREAT AWAITS BOOK NOW Beachside resort 3841 N Roosevelt Blvdâ¨â¨Key West, FL 33040 NAVIGATION Home Rooms Dining Amenities Meetings & Events Calendar Contact Us FAQ Resort Map CONNECT beachside@brightwild.com 305 330-5681"
    }
  ]
}