{
  "fuentes": [
    {
      "url": "https://bellhopcigars.com/about/",
      "email": "help@bellhopcigars.com"
    },
    {
      "url": "https://www.bellhopship.com/contact-us",
      "email": "info@bellhopship.com"
    },
    {
      "url": "https://members.doporlando.com/member-by-level/Contact/LE10OxxL",
      "email": "info@doporlando.com"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "https://www.forbes.com/sites/christiankreznar/2018/12/18/bellhops-raises-314-million-to-make-moving-less-miserable/",
      "email": "corrections@forbes.com"
    },
    {
      "url": "https://www.forbes.com/sites/christiankreznar/2018/12/18/bellhops-raises-314-million-to-make-moving-less-miserable/",
      "email": "feedback@forbes.com"
    }
  ],
  "mails": [
    "corrections@forbes.com",
    "feedback@forbes.com",
    "help@bellhopcigars.com",
    "info@bellhopship.com",
    "info@doporlando.com",
    "info@reception-plus.de"
  ],
  "nombre_sitio": "bellhopbar.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://bellhopcigars.com/about/",
      "text": "About us | Bellhop Cigars No Taxes. No Duties. Select category Select category Danny's Humidor Premium Cigars Honduran Cigars Nicaraguan Cigars Search Login / Register 0 Compare 0 items $ 0.00 Menu 0 items $ 0.00 Shop Cigars Cigars by Country Cuban Cigars Dominican Cigars Nicaraguan Cigars Honduran Cigars Bellhop Signature Cigars New Blends Cigar Collections Danny's Humidor Sleeves & Samplers Back In Stock Almost Gone New Arrivals Cigar Brands Collections Blog Concierge Join the Bellhop Newsletter Search About us Home » About us The Bellhop Cigars Difference Our objective is to provide you with the best possible prices for Cuban Cigars, Armistice cigars and other premium brands at BellhopCigars.com. Now there’s no need to wait for those special discounts on your favorite cigar. Over the last 14 years our international purchasing power has grown enormously and due to the strength of the American dollar we can now offer everyday low prices. Getting your cigars from Bellhop makes you part of one of the largest cigar buying groups in the world. The only way we can keep our prices low for you is by leveraging the sales of a large cigar buying group (our valued customers). Ensure you check out our emails when we send them! Buying from bellhopcigars.com can guarantee you lower and lower prices on your favorite cigars. Join Our Newsletter Shipping Cuban Cigars are one of the most difficult perishable products to ship securely into the United States. Bellhop Cigars offer the fastest and safest shipping to our customers versus any other competitor. Our customers choose Bellhop because of our reliability. Learn More No Taxes. No Duties. No BS. Because we do not charge any levies, duties or taxes, we technically have the best prices online for Cuban cigars. Because you will not be charged at your door when your order arrives (unlike our competition) our prices are some of the most competitive you’ll find. When purchasing from our competitors, you may discover weeks later that your Federal Government has sent you an invoice for Duties & Taxes not paid. Best Cigar Quality. 100% Guaranteed Authentic. Bellhop Cigars has a 14 year flawless reputation for delivering the highest quality Cuban and Premium cigars to our U.S.A. customers. No one else comes close. Our cigars are inspected meticulously by our cigar and humidor experts before shipping. If, for whatever reason, you are not satisfied with our cigars, please email us immediately at help@bellhopcigars.com . If you find cheaper prices for cigars online, be wary of counterfeit cigars ! Our cigars 100% guaranteed authentic Cuban. Get Help With Your Order Email Us help@bellhopcigars.com © 2025 Bellhop Cigars, All Rights Reserved. Shop Cigars Cuban Cigars Premium Cigars Cigar Accessories Important Info Shipping Help & FAQ About Us Search Store Cigars Cuban Cigars Dominican Cigars Nicaraguan Cigars Honduran Cigars Danny’s Humidor Back In Stock Almost Gone New Arrivals Home Shop Cigars Cigar Brands Cigar Collections Blog Concierge About us Help & FAQ Compare Login / Register Sign in Close Username or email address * Password * Log in Lost your password? Remember me No account yet? Create an Account Shop 0 items Cart My account"
    },
    {
      "url": "https://www.bellhopship.com/contact-us",
      "text": "Contact us | Bellhop Logistics top of page info@bellhopship.com PHONE: 855-623-5546 Where resort-like service meets shipping solutions Contact the Concierge Services Small Package E-commerce Less-than-truckload Full Truckload International Import & Export Audit & Analysis Supply Chain Consultative Services Concierge Contact us Book a meeting About Us Why Bellhop? Over The Road Blog More For Your Business More Use tab to navigate through the menu items. Get in Touch Drop us a line and we'll get back to you in jiffy! Contact Us Thanks for submitting! Submit Bellhop Logistics info@bellhopship.com PHONE: 855-623-5546 FAX: 818-221-1759 Los Angeles, CA, USA ©2023 by Bellhop Logistics. Privacy Policy Do Not Sell My Personal Information bottom of page"
    },
    {
      "url": "https://members.doporlando.com/member-by-level/Contact/LE10OxxL",
      "text": "Contact Bellhop  - Downtown Orlando Partnership Inc Skip to content Menu Home About The Epicenter of an Unstoppable Opportunity Economy Board of Directors Board Application Team DOP Careers Internships Volunteer Opportunities DOP Foundation 2025 Sponsorship Opportunities Members Our Investors Key Stakeholders Membership Benefits Members by Level Job Board Directory Join Now Events Events Calendar Sponsor an Event First Friday Third Thursday ConnectDTO Downtown Business Forum Black History Month: Meet The Artists Reception Golden Brick Awards Chow on Church Downtown Employee Appreciation Week State of Downtown Golf Scramble News Downtown Drip Downtown Voices DOP in the News Member Spotlights Subscribe Contact Member Login Join Menu Home About The Epicenter of an Unstoppable Opportunity Economy Board of Directors Board Application Team DOP Careers Internships Volunteer Opportunities DOP Foundation 2025 Sponsorship Opportunities Members Our Investors Key Stakeholders Membership Benefits Members by Level Job Board Directory Join Now Events Events Calendar Sponsor an Event First Friday Third Thursday ConnectDTO Downtown Business Forum Black History Month: Meet The Artists Reception Golden Brick Awards Chow on Church Downtown Employee Appreciation Week State of Downtown Golf Scramble News Downtown Drip Downtown Voices DOP in the News Member Spotlights Subscribe Contact Contact Bellhop My Contact Information Name * Email Address * Subject * Message * Powered By GrowthZone © 2025 Downtown Orlando Partnership Inc | Site by GrowthZone Say Hello 407-228-3891 PO Box 2026, Orlando, FL 32802 333 S Garland Ave, 13th Floor, Orlando, FL 32801 info@doporlando.com Additional Resources Member Directory Login Privacy Policy Stay Connected! LinkedIn Instagram Facebook youtube twitter © 2025 Downtown Orlando Partnership Inc. All Rights Reserved | Site by GrowthZone Scroll To Top"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. First name Surname * E-Mail * name First Nachricht Nachricht * Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "https://www.forbes.com/sites/christiankreznar/2018/12/18/bellhops-raises-314-million-to-make-moving-less-miserable/",
      "text": "Bellhops Raises $31.4 Million To Make Moving Less Miserable Newsletters Games Share a News Tip Featured Featured America's Top Next-Gen Wealth Advisors | Paid Program Student Visionaries: Celebrating Teen Leaders Raising Money To End Blood Cancers | Paid Program Best-In-State Top Next-Gen Wealth Advisors 2025 Breaking News White House Watch Daily Cover Stories AI’s Nuanced Impact And A Quest To Quantify It DNA of Success Embracing And Bracing For AI Facing A Volatile Market, C-Suites Look To The CFO For Strategic Guidance Your Four-Part Blueprint To Unlock AI Value In 2025 | Paid Program By The Numbers: Meet The Forbes 30 Under 30 Europe Class Of 2025 Dell Technologies BrandVoice | Paid Program Scaling AI Get Your Data AI-Ready | Paid Program QUIZ: Are You Making The Most Of Your Retirement Plan? | Paid Program Shaping The Future-Ready Mobility: In Conversation With JLR And TCS | Paid Program The Pacesetter Playbook: An Executive’s Guide To  Advancing Enterprise AI | Paid Program Next Billion-Dollar Startups 2025 CXO Spotlight: The Executive's Guide to AI Video Series Billionaires Billionaires See All World's Billionaires Forbes 400 America's Richest Self-Made Women China's Richest India's Richest Indonesia's Richest Korea's Richest Thailand's Richest Japan's Richest Australia's Richest Taiwan's Richest Singapore's Richest Philippines' Richest Hong Kong's Richest Malaysia's Richest Money & Politics Innovation Innovation See All Workflow Collaboration Enterprise AI AI Agentic AI Big Data Cloud Cloud 100 Consumer Tech Creator Economy Cybersecurity Digital Transformation Enterprise Tech Future Of Work Gaming Healthcare Innovation Rules Retail Industry SAP BrandVoice | Paid Program Science Social Media Sustainability & Climate Transportation Venture Capital Technology TikTok BrandVoice | Paid Program Metronome BrandVoice | Paid Program Leadership Leadership See All Under 30 C-Suite CEO Network CFO Network CHRO Network CIO Network CMO Network Leadership Strategies Careers Education Featured Partners Deloitte BrandVoice SAP BrandVoice Stand Together BrandVoice First Tee BrandVoice Dell Technologies BrandVoice Forbes EQ | Paid Program ForbesBLK Forbes Research ForbesWomen Money Money See All Banking & Insurance ETFs & Mutual Funds Fintech Hedge Funds & Private Equity Investing Investor Hub Markets Personal Finance Retirement Taxes Top Advisor | SHOOK Wealth Management Forbes Digital Assets Forbes Digital Assets See All News Crypto Prices NFT Prices Research Learn Crypto Basics BTC DeFi Web3 Education NFTs Crypto Investments Events Crypto Portfolios Business Business See All Aerospace & Defense Energy Food & Drink Hollywood & Entertainment Law Manufacturing Media Policy Retail SportsMoney Entertainment Digest Small Business Small Business See All Entrepreneurs Franchises Small Business Strategy Lifestyle Lifestyle See All Arts Boats & Planes Cars & Bikes Dining ForbesLife Forbes Travel Guide Spirits Style & Beauty Travel Vices Watches Real Estate Real Estate See All Commercial Real Estate Forbes Global Properties Residential Real Estate Forbes Vetted Forbes Vetted See All Mattress & Sleep Bed Frames Mattresses Mattress Toppers Pillows Sheets & Bedding Sleep Products Home Bathroom Cleaning & Laundry Decor Furniture Heating & Cooling Hobbies Home Office Kitchen & Dining Outdoor Pets Storage & Organization Tools Wine & Bar Fashion Accessories Clothing Eyewear Footwear Jewelry Handbags & Purses Lingerie & Sleepwear Outdoor & Fitness Apparel Outerwear Watches Kids & Baby Gear Baby Gear Kids Clothes & Accessories Nursery Pregnancy & Postpartum Toys & Books Gear Apparel & Accessories Bikes Camping & Hiking Climbing Fishing & Hunting Fitness Golf Running Tennis & Racket Sports Tools & Tech Training & Recovery Water Sports Wellness Winter Sports Beauty & Grooming Haircare Makeup Nailcare Shaving Skincare Personal Products Wellness & Self Care Tech & Electronics Audio Cameras Computers, Tablets & Accessories Gaming Home Office Online Tools Smart Home Devices Smartphones, Smartwatches & Accessories Streaming TVs Travel Cruises Hotels & Lodging Luggage Travel Products Gifts Father's Day Holiday Mother's Day Valentine's Day Wedding Deals Coupons Black Friday Cyber Monday Amazon Prime Day Beauty & Grooming Big Sales Fashion Gear Home Tech & Electronics Travel Deals Mattress & Sleep Coupons Coupons See All Most Popular Macy's Zappos Vivid Seats SeatGeek Groupon DoorDash Stubhub Shutterfly Fashion H&M Nordstrom Zenni Optical Neiman Marcus Shopbop Ulta Beauty Zales Jos. A. Bank Software & VPNs NordVPN ExpressVPN Surfshark Squarespace Norton QuickBooks VistaPrint TurboTax Electronics Samsung Verizon Sonos Newegg Lenovo B&H eBay HP Sportswear & Gear adidas Nike Dick's Sporting Goods HOKA New Balance Athleta Alo Yoga RTIC Mattress & Sleep Mattress Firm Purple Mattress Bear Mattress Brooklinen Nectar Avocado Mattress Nolah Brooklyn Bedding Travel Booking.com Hotels.com Emirates Expedia Away Hilton Priceline Great Wolf Lounge Home & Garden Walmart Wayfair Edible Arrangements Instacart The Home Depot Lowe's Frontgate Total Wine View All Stores Lists Lists See All 30 Under 30 50 Over 50 Top Colleges Advisor Advisor See All Credit Cards Best Credit Cards Travel Credit Cards 0% APR Credit Cards Balance Transfer Credit Cards Business Credit Cards Best First Credit Card Mortgages & Loans Best Mortgage Lenders Mortgage Refinance Lenders Personal Loans Business Loans Bad Credit Loans Debt Consolidation Loans Debt Relief Companies Student Loans Refinance Private Student Loans Banking Best CD Rates High Yield Savings Accounts Money Market Accounts Checking Accounts Business Checking Accounts Budgeting Apps Best Online Banks Insurance Health Insurance Companies Medicare Life Insurance Companies Best Car Insurance Companies Cheapest Car Insurance Companies Pet Insurance Companies Travel Insurance Companies Homeowners Insurance Companies Business Services How to Start a Business LLC Services Payroll Services HR Software HRIS Systems PEO Services Applicant tracking Systems Domain Registrars Hosting Services Website Builders Ecomm Platforms Landing Page Builders VOIP Services Answering Services Project Management Software Task Management Software Gantt Chart Software VPNs Anti Virus Software Password Managers Home Services Moving Companies Long Distance Moving Companies Car Shipping Companies Home Warranty Companies Solar Companies Solar Panels Home Security Companies Home Security Systems Internet Providers Cheapest Internet Providers Fastest High Speed Internet Providers Pest Control Companies Education Forbes Advisor UK Forbes Advisor CA Forbes Advisor AU Health Health See All Mental Health Best Online Therapy Online Therapy that Takes Insurance Online Psychiatrists Best Online Dating Sites & Apps Best Senior Dating Sites Best LGBTQ Dating Sites CBD CBD Gummies CBD Oil CBD Creams CBD for Anxiety CBD for Pain Supplements Protein Powder Preworkout Collagen Powders Creatine Supplements CoQ10 Supplements Hearing Health Best Hearing Aids OTC Hearing Aids Affordable Hearing Aids Medical Devices Best Medical Alert Systems Best Medical Alert Systems with Fall Detection Diet & Weight Loss Best Weight Loss Plans Newsletters Newsletters See All Forbes Daily Editorial Newsletters Forbes Games Forbes Games See All Frase by Forbes Pinpoint by LinkedIn Queens by LinkedIn Crossclimb by LinkedIn More From Forbes More From Forbes Forbes Video Forbes 101 Forbes Magazine Forbes Asia Free Issue of Forbes © 2025 Forbes Media LLC. All Rights Reserved. Advertise with Forbes Forbes Licensing & Syndication Report a Security Issue Editorial Values and Standards Site Feedback Contact Us Careers at Forbes Tips Corrections Privacy Do Not Sell My Personal Information Terms AdChoices Reprints & Permissions Leadership Leadership Strategies Bellhops Raises $31.4 Million To Make Moving Less Miserable By Christian Kreznar , Former Staff. I write for Forbes Magazine and Forbes.com. Dec 18, 2018, 08:00am EST Share Save This article is more than 6 years old. Bellhops at work. Photo courtesy of Bellhops. “Moving is an $18 billion industry that people loathe.” It’s a dire pronouncement, but Bellhops CEO Luke Marklin is almost unrelentingly positive. As of today, the moving services startup has expanded to 31 metro areas, maintained near perfect levels of customer feedback, and secured $51 million in venture funding (the latest round, a Series C led by Advance Venture Partners and announced today, brought on $31.4 million). “It’s a big industry with very little technology, and a big opportunity to disrupt,” he says. At its core, Bellhops is a matching service, connecting people looking to move with drivers and loading crews through a single interface. Users give their zip code, property details, and preferred dates to receive estimates and schedule the trip. They're then connected with the truck owner-operators and movers who are registered on the app (\"Bellhops\" in company speak). Underpinning the platform is a rigorous battery of reviews that track the performance of individual Bellhops. Scores determine which workers are kept on, promoted, and given access to preferential jobs. “We have over 30 pieces of data on every move - reviews from customers, Bellhops review each other - it manifests in a report card you can evaluate in real-time,” says Marklin. “Traditionally, the problem with the industry is a lack of hospitality. Moving is an intimate process - people are inviting us into their homes.” Bellhops’ tech solutionism is paired with a corporate culture that stresses a polite, hardworking demeanor - ensured with the aforementioned reviews and a lengthy vetting process. Think Southern hospitality by way of Big Data. ( In a local news PR coup , Marklin was able to showcase the company’s culture, giving a car to a 20-year-old Bellhop who’d walked 20 miles to his first day of work.) If it all seems familiar, it’s no coincidence. Marklin is an ex-Uber executive, and Bellhops is openly following their playbook: rapid expansion, promotional rates, and copious data collection. And, just like Uber, its revenue streams are propped up with significant venture capital. Bellhops declined to comment, but Forbes estimates total revenue for the company is in the low double-digit millions, a figure dwarfed by their $51 million in venture backing. Bellhops was founded in 2011 by Cam Doody and Stephen Vlahos in Auburn, Alabama. Initially a college business, the two had early success marketing their services to freshmen during move-in. By 2013, Doody and Vlahos had graduated, and with seed funding from Chattanooga’s Lamp Post Group, developed the base tech that Bellhops now operates on. The team followed the money and set up shop in Chattanooga, where the company is still headquartered. MORE FOR YOU The new platform brought them attention and further funding. In late 2014 the company completed its Series A, a $6 million deal led by Binary Capital that also brought on names like Alexis Ohanian and Garry Tan of Initialized Capital Management. Only a year later they closed their Series B, a $13.5 million round led by Canaan Partners with further buy-in from their earlier backers. “We invested when [Bellhops] was much smaller and regionally focused,” says Dan Ciporin, the General Partner at Canaan who led the Series B. “As it started to grow, we realized it needed a CEO who had scaled before.” With the blessing of Doody and Vlahos, the search for a veteran to take the reins began (Doody remains on at Bellhops as President and Chairman of the Board; Vlahos left in 2017 to pursue other ventures). By mid-2017, that search took them to Luke Marklin, who at the time was a General Manager at Uber based in Atlanta. “Luke doesn’t toot his own horn much, but this is a guy who went up the ranks of Uber and ended up running the Southeastern United States,” says Ciporin. “[At Bellhops], he took a company that was already growing rapidly and applied rocket fuel to it.” While the early platform was dedicated to providing labor for moves, the company has since expanded and now provides full end-to-end service. Bellhops will load your things, ship them out, and unload them at the destination. This year, they began offering this service over long distances. Marklin says it is the fastest growing sector of their business. “I think they are very thoughtful about the crawl, walk, run strategy,” says Courtney Robinson, the Advance Ventures General Partner who led the Series C round. “Rather than build a product that runs out of the gate, they did it manually for a few months, figured out the feature set they needed, and built the product around that.” It’s an impressive offering, but whether Bellhops can become a fixture in how people move is still an open question. Despite generating over $18 billion in revenue annually, the moving industry is notoriously fragmented, with small-scale movers making up nearly 50% of the market. Bellhops and other startups, like Lugg and Dolly, are hoping to tie up those loose ends in a single platform, but it’s a tough sell. Unlike ride-sharing, moving services don’t have frequent repeat customers, and jobs are heavily concentrated in the summer. Factor in a dependence on a healthy housing market and the picture gets even more complicated. “Everyone’s pursuing the same business model,” says IBISWorld Senior Analyst Darshan Kalyani. “When one tries to capture the national market, competition will fizzle out and we’ll be left with one or two.” “There are very few ‘Uber for X,’ ‘Warby Parker for X’ startups in 2018 that are still exciting,” says Robinson. Bellhops might just be the exception. Got a tip? Share confidential information with Forbes. Editorial Standards Reprints & Permissions LOADING VIDEO PLAYER... FORBES’ FEATURED Video © 2025 Forbes Media LLC. All Rights Reserved. AdChoices Privacy Statement Your Privacy Choices Cookie Preferences Digital Terms of Sale Terms of Service Contact Us Send Us Feedback Report a Security Issue Jobs At Forbes Reprints & Permissions Forbes Press Room Advertise"
    }
  ]
}