{
  "fuentes": [
    {
      "url": "https://bigskyarts.org/pages/staff",
      "email": "brian@bigskyarts.org"
    },
    {
      "url": "https://bigskyarts.org/pages/staff",
      "email": "jesine@bigskyarts.org"
    },
    {
      "url": "https://bigskyarts.org/pages/staff",
      "email": "kate@bigskyarts.org"
    },
    {
      "url": "https://bigskyarts.org/pages/staff",
      "email": "katie@bigskyarts.org"
    },
    {
      "url": "https://bigskyarts.org/pages/staff",
      "email": "sierra@bigskyarts.org"
    },
    {
      "url": "https://bigskyarts.org/pages/staff",
      "email": "tamara@bigskyarts.org"
    },
    {
      "url": "https://bigskyarts.org/pages/staff",
      "email": "yvonne@bigskyarts.org"
    },
    {
      "url": "https://www.giarts.org/board-directors",
      "email": "gia@giarts.org"
    }
  ],
  "mails": [
    "brian@bigskyarts.org",
    "gia@giarts.org",
    "jesine@bigskyarts.org",
    "kate@bigskyarts.org",
    "katie@bigskyarts.org",
    "sierra@bigskyarts.org",
    "tamara@bigskyarts.org",
    "yvonne@bigskyarts.org"
  ],
  "nombre_sitio": "bigarts.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://bigskyarts.org/pages/staff",
      "text": "Staff Events Calendar Music in the Mountains Auction for the Arts Bravo! Big Sky Music Festival Big Sky Artisan Festival Upcoming Film Festivals Education Art Classes Outreach Youth Art Programs Public Art Public Art Overview Installations Public Art Angel Fund Get Involved Volunteer Partners Calls For Art Careers About Our New Home Mission, Vision & Values History Staff Board Members Financials & Reports Contact Us Latest News Give Now! ||| Events Calendar Music in the Mountains Auction for the Arts Bravo! Big Sky Music Festival Big Sky Artisan Festival Upcoming Film Festivals Education Art Classes Outreach Youth Art Programs Public Art Public Art Overview Installations Public Art Angel Fund Get Involved Volunteer Partners Calls For Art Careers Careers About Our New Home Mission, Vision & Values History Staff Board Members Financials & Reports Contact Us Latest News Give Now! Staff Brian Hurlbut EXECUTIVE DIRECTOR EMAIL As Executive Director, Brian manages the day-to-day operations of the Arts Council as well as securing the artists for all of our events. He’s been a leader in the Big Sky arts and nonprofit community since 2001 when he first joined the ACBS. Originally from western New York, Brian has a BA in International Studies from the University of Buffalo (SUNY) and attended the University of Montana Graduate School of Journalism. In addition to leading the ACBS, Brian is also an accomplished writer, musician and snowboarder, and father to two adventurous kids. He’s proudly lived in Montana for 30 years. Katie Alvin DEVELOPMENT DIRECTOR EMAIL More than 30 years ago, Katie moved to Big Sky where she’s lived ever since, sinking deep roots and falling in love with the people and organizations that make Big Sky exceptional. She’s worked in government, academia, and the private sector, but after more than two decades of nonprofit work, helping organizations get things done has become her passion and specialty. With a BS in Soils and a MA in Education, she’s found that mastering a useful skill set and developing meaningful relationships has been her career path roadmap. Katie loves recreating outside, traveling, live music, building things, snapping photos, and being amazed daily at the beauty of the world around her with family and friends. Jesine Munson Public Art & Outreach Coordinator EMAIL Jesine Munson was born and raised in Montana. Hailing from Havre, she has lived in Bozeman since 2007. Jesine has gone to school for far too long and has a Master’s and Bachelor’s degree in Art History and a BFA with a focus in Ceramics. In 2023, she completed her PhD in American Studies and occasionally still teaches as an adjunct professor at Montana State University. Her research is in Pragmatist Aesthetics and Moral Imagination, and she profoundly believes that living more artistically is key to the survival of our species. She based her research Compassion Project , a Bozeman non-profit whose mission is to teach and spread compassion through art and mindfulness. Jesine embodies these values every day and believes the key to community building is through compassionate dialogue and creative connection, the art of living, as she calls it. Public art is foundational in these beliefs, and she is eager to get to work in cultivating a strong community in Big Sky with the idea that Public Art is Public Health. Jesine loves art and the outdoors, and her dream day is to be out-of-service with her dogs (Lucy & Chester) and brand new baby, Monte Edgar. Tamara Knappenberger Events & Volunteer Coordinator EMAIL Born and raised on a ranch out of Casper, Wyoming, Tamara grew up immersed in the Western landscape and community. She earned a BA in Geography (GIS) from the University of Wyoming and BFA in Graphic Design from Montana State University. She has spent her whole career working in the non-profit realm and supports several local organizations with volunteer service in her free time. She teaches dance for grown-ups, art and photography with kids, DJs at KGLT, is a third-generation 4-H leader, greatly admires the local comedy scene, loves horses, and is overwhelmingly proud of her two exceptional (and freshly adulted) children. Yvonne Leung Stewardship Coordinator EMAIL Yvonne's non-profit career began when her daughter's preschool asked her to join the board. She later worked at the Montana Outdoor Science School and found her passion in stewardship and fundraising work. She spends her free time volunteering for the Girl Scouts, fundraising for the art efforts at her children's elementary school, and of course doing all the fun outdoor Montana things. Originally from Hong Kong, Yvonne and her family moved to Bozeman 8 years ago. She had her first ever snowboard lesson at Moonlight Basin many years ago and now watching her kids learn to ski in Big Sky is very special! Kate Hammermeister Digital Media Coordinator EMAIL Kate joined the Arts Council with a background in Communications, Advertising, and Digital Marketing from Appalachian State University. Recently relocating to Montana, Kate has been drawn to Big Sky for years, captivated by its natural beauty and vibrant community. With a passion for photography and videography, she brings her creative eye to capturing the arts in Big Sky, showcasing the talent and culture that the Arts Council supports. Outside of work, Kate loves hiking, camping, and immersing herself in the Montana outdoors. Sierra Hooge Studio Coordinator EMAIL Sierra is the newest member of The Arts Council Studio Instructor Team and has proven to be a dedicated and talented ceramic artist. Sierra teaches pottery and manages the art classroom/studio in the BASE community center, and also runs the open studio program. Shannon Brennan Studio Art Educator Shannon joined the Arts Council studio staff in the fall of 2024 and is teaching our beginner and intermediate stained glass classes. Shannon is excited to be back in Big Sky after leaving in 2021, and in addition to teaching art she works full time as the Center Director of Morningstar Learning Center. Having lived in many different mountain towns throughout the west from Leavenworth, WA to Breckenridge, CO, Big Sky has always been the one that felt most like home. You can often find Shannon in the mountains skiing, climbing, rafting, hiking, or sitting in her hammock with a cup of tea and a good book. Zach Stephens Studio Art Educator Zach Stephens lives here in Big Sky teaches beginner pottery classes as well as certain open studio sessions. Zach joined the ACBS team in the fall of 2024 and we're excited to have him in the studio! © 2025 ARTS COUNCIL OF BIG SKY 77 Lone Peak Dr, PO Box 160308 Big Sky, MT 59716 Click Here to learn about Our New Home 406.995.2742 | EMAIL | SUBSCRIBE"
    },
    {
      "url": "https://www.giarts.org/board-directors",
      "text": "Board of Directors | Grantmakers in the Arts Skip to main content Contact GIA GIA Reader Publication Become A GIA Member 450 Lexington Ave, Unit 4501 | New York, NY | gia@giarts.org Facebook LinkedIn YouTube RSS ❮ ❯ Facebook Instagram LinkedIn YouTube Flickr RSS Welcome, Advanced Search User account menu Log in Become a GIA Member Toggle navigation Main navigation Home About About GIA Our Mission Board of Directors GIA Team Annual Reports Funding Partners Contact Us Programs & Events Annual Conference Webinars Forums, Summits, & Workshops Podcast Twitter Chats Special Series Conference Proceedings Funding Focus Areas Racial Equity Public Policy and Advocacy Capitalization Support for Individual Artists Arts Funding at the Intersection... News News from the Field The President's Blog Press Room and Announcements Arts Funders Respond Subscribe to the News Digest Resources Library GIA Reader GIA Reader Archive Arts Funding Trends Conference Archive Membership Advanced Search User account menu Log in Become a GIA Member About GIA Submenu About GIA Our Mission Board of Directors GIA Team Annual Reports Funding Partners Contact Us Board of Directors Tariana Navas-Nieves, Chair Denver Arts & Venues Tariana Navas-Nieves, Deputy Director for Denver Arts & Venues, City and County of Denver, has 30 years of experience in management, equity and race and social justice work, philanthropy, curatorial practice, translation and interpretation, television, and communications. She oversees the City departments of Public Art, Cultural Programs & Events, Creative Industries, SCFD Tier III (Tax District) funding, Arts Education, and the agency’s numerous cultural investments and grant programs. Navas-Nieves is also on the City’s Equity Leadership Team responsible for the oversight and implementation of the City’s equity platform working with all City agencies and ~13K employees. Navas-Nieves serves on national, regional and local boards including: GIA, Philanthropy Colorado (Chair), Philanthropy Colorado Arts & Culture Funders (Co-Chair), Denver Latino Commission, and the Community ACTS Fund focused on funding to support BIPOC, people with disabilities, LGBTQ+, and other historically marginalized communities. She is co-author of the Re-Tool: Racial Equity in the Panel Process , and created the learning series “How to be an Anti-Racist Organization. A Conversation with Dwinita & Tariana.” With an expertise in Latin American and American Indian art, she has also served in curatorial posts at the Colorado Springs Fine Arts Center, Denver Art Museum, Museo de las Americas, and for private collections in the US and Puerto Rico. Eleanor Savage, Vice Chair Jerome Foundation Eleanor Savage is president & CEO of the Jerome Foundation, which seeks to contribute to a dynamic and evolving culture by supporting the creation, development, and production of new works by early career/emerging artists. Savage has focused much of her work in the field of arts philanthropy as an advocate for racial equity and undoing racism. She is one of the founding members of the Racial Equity Funder Collaborative, a Minnesota-based learning and action cohort focused on furthering equity and justice in philanthropy. She recently authored the collaboratively developed RE-Tool: Racial Equity in the Panel Process , a discussion tool to encourage racial equity in the review and selection process. Savage is a co-chair for GIA’s Support for Individual Artists Committee. Previously, she was the associate director of Events and Media Production at Walker Art Center for 16 years. As a queer, civic-minded, anti-racist producer, Savage instigated many community-focused, artist-centered programs in the Twin Cities, supporting artists in all creative disciplines. Savage received an MFA in Arts Management from Virginia Tech and a BFA in Psychology and Theater from Mercer University. Pam Breaux, Treasurer National Assembly of State Arts Agencies Pam Breaux joined the National Assembly of State Arts Agencies (NASAA) in 2015. As president and CEO, she works with the association’s board of directors and staff to advance NASAA’s policy and programmatic mission to strengthen America’s state and jurisdictional arts agencies. A native of Lafayette, Louisiana, Breaux has held leadership positions at the local, state and national levels. While in Louisiana state government, she was secretary of the Louisiana Department of Culture, Recreation and Tourism (CRT), among other roles. She was executive director of the Arts and Humanities Council of Southwest Louisiana and managed southwest Louisiana’s Decentralized Arts Funding Program. She has served on the boards of the U.S. Travel Association, NASAA, South Arts and the Louisiana Board of International Commerce. Breaux is currently a member of the U.S. National Commission on UNESCO. She graduated from McNeese State University and earned an M.A. from the University of Louisiana at Lafayette. Michelle Coffey, Secretary Lambent Foundation As executive director, Michelle Coffey designs, implements, and furthers the strategic agenda, leadership, and vision of Lambent Foundation. Lambent Foundation leverages the critical role of arts and culture at the intersection of social justice. Through innovative grantmaking, they explore the impact of contemporary art as a strategy for promoting sustainable cultural practices in New York City, New Orleans, and Nairobi. Prior to the creation of Lambent Foundation in January 2009, Coffey was director of Starry Night Fund and Senior Philanthropic Advisor at Tides Foundation. With a global lens, her areas of focus included Human Rights, Women/Girls, Criminal Justice Reform, Arts and Culture and HIV/AIDS. In addition, she currently serves on the boards of Creative Capital Foundation, the Brownsville Multi-Service Family Health Care Center in East New York, and most recently, Socrates Sculpture Park. Board of Directors Susan A. Anderson Alaska Pacific University Susan A. Anderson, M.Ed., was with The CIRI Foundation (TCF) 23 years and became President/CEO soon after she started. She is a remarkable steward, deeply dedicated to helping thousands of people change their lives through education, cultural, and artistic knowledge. Susan, who is of Tlingit heritage and an original CIRI enrollee, was one of the first recipients of TCF’s scholarships. She is the creator of the A Journey to What Matters: Increased Alaska Native Art & Culture work at The Ciri Foundation in partnership with the Margaret A. Cargill Philanthropies. Grant funding is available to support projects driven by Alaska Native communities and promotes intergenerational transference of knowledge related to Alaska Native artistic and cultural practices and supports Alaska Native Artists. Susan is the Board Secretary of Alaska Pacific University (designated as a Native Student Serving Institution and working toward becoming a Tribal University), Board Member of Cook Inlet Native Head Start, and the Alaska Children’s Trust. She has served as Chair of the Alaska Humanities Forum, the United Way of Anchorage, Best Beginnings Alaska, University of Alaska Foundation and served on the national Native Americans in Philanthropy Board. She is also a past member of the University of Alaska Anchorage’s College of Education and College of Arts and Sciences advisory committees, Philanthropy Northwest, and the Western Interstate Commission on Higher Education. Rocío Aranda-Alvarado Ford Foundation Rocío Aranda-Alvarado is part of Ford Foundation’s Creativity and Free Expression team. An art historian, curator and museum worker, she joined Ford in 2018 after serving as curator at El Museo del Barrio for nearly a decade. She received a Ph.D. from The Graduate Center, CUNY, and an M.A. from Tulane University. Aranda-Alvarado is also on the adjunct faculty of the Art Department at Hunter College and her writing has appeared in various publications. At Ford, she is leading work on support for US Latine art and artists in collaboration with the Mellon Foundation. She also leads support for AAPI grantees confronting Anti-Asian sentiment and is part of design teams for work around the US-Mexico border and a new national disability network initiative. With art historian and curator Deborah Cullen, she is also editing a book on the history of US Latine art for academic and general audiences. Jennifer Coleman The George Gund Foundation Jennifer Coleman is the Program Director of Creative Culture and Art at The George Gund Foundation in Cleveland, Ohio. In her eight years at the Foundation, Jennifer has deeply explored Cleveland’s art ecosystem and the issues that are important to its vitality: prioritizing organization sustainability through operational support; equity in arts funding and resource allocation; arts education in the Cleveland public school system; the structure of the arts and culture civic leadership; and the continuing issue of maintaining public funding for the arts. A hallmark of her early tenure at the foundation was her work to integrate the practices of racial equity and justice within the Cleveland arts community. She has worked with both local and national organizations and foundations to form a committed network willing to imagine what a truly diverse and thriving arts community looks like in Cleveland and what must happen to make that vision reality. She was asked to organize the first-ever arts mayoral summit in 2021 to communicate the importance of the arts community to the city and worked closely with the City of Cleveland to develop a vision and framework for its first arts and culture cabinet-level position. Sharon DeMark St. Paul & Minnesota Foundation Sharon DeMark (she/her/hers) is a program officer for the Saint Paul & Minnesota Foundation, the F. R. Bigelow Foundation and the Mardag Foundation in the areas of arts and humanities, aging services, and legal services. She is an active member of the Racial Equity Funders Collaborative, working with other arts funders in Minnesota to address inequities and injustice in the field. Prior to working in philanthropy, she headed education/community engagement departments for theaters and performing arts centers in the Twin Cities and New York City. In that work she was instrumental in founding international children’s festivals at the Ordway Center for the Performing Arts in Saint Paul and at the Brooklyn Academy of Music. Sharon has sat on selection panels for Saint Paul Cultural STAR, the Minnesota State Arts Board, the Metropolitan Regional Arts Council, and the Wisconsin Arts Board. Sharon is also a watercolor artist. She collaborated with poet Margaret Hasse on a book of poems and paintings entitled “Shelter,” published by Nodin Press. Sharon lives in Saint Paul with her family and loves seeing live theater and music and biking along the Mississippi. Adriana Gallego Arts Foundation for Tucson and Southern Arizona As an artist at the service of other artists, Adriana Gallego's work in arts administration and education is motivated by human rights, where she seeks to connect people with meaningful resources that grow personal and organizational capacity, build community, foster collaboration, and bridge cultural understanding. Leading from this perspective, Gallego was the first chief operating officer of the National Association of Latino Arts and Cultures (NALAC). She also recently served as co-chair the Grantmakers in the Arts Support for Individual Artist Committee. Previously, she was director of Strategic Initiatives with the Arizona Commission on the Arts, Educational Assistant at the Norton Simon Museum, and arts educator throughout the Southwest. She has served on many review panels, advisory boards, and committees including the National Endowment for the Arts, Arizona Mexico Commission, Arizona Public Art Network, Transportation Enhancement Review Committee, Asset Building for Artists of Color Advisory Board and Flagstaff Cultural Partners Arts Advisory Board, and The Association of American Cultures. Tina Kuckkahn NDN Collective Tina Kuckkahn, J.D., is a citizen of the Lac du Flambeau Tribe of Lake Superior Chippewa and a descendant of the Lac Courte Oreilles Band of Lake Superior Chippewa Indians.  As the Managing Director for NDN Collective’s Foundation, Kuckkahn helps lead a holistic, multilingual grantmaking strategy for international funding streams across Turtle Island and related Island Nations. Kuckkahn was the Founding Director of the “House of Welcome” Longhouse Education and Cultural Center at The Evergreen State College, from 1996 until 2018, when she became Evergreen’s first Vice President of Indigenous Arts, Education and Tribal Relations.  Kuckkahn serves on the Board of Directors for Grantmakers in the Arts, the Waaswaagoning Living Arts and Cultures Center, and the Advisory Circle of the NARF-Morning Star Sacred Places Protection Project. Bao-Long Chu Houston Endowment Bao-Long Chu is program director, Arts and Parks, for Houston Endowment. Long directs grantmaking for the foundation’s arts and parks portfolio. Prior to joining Houston Endowment in 2015, Long was associate director of the literary-education nonprofit Writers in the Schools (WITS) where he developed his extensive background in literacy, arts, and community engagement and worked in collaboration with a wide variety of Houston-area institutions and organizations, including Art League Houston, Houston Grand Opera, Texas Children’s Hospital, and University of Houston Moores School of Music. Long has also written and presented extensively on writing pedagogy, the connection between art and the refugee experience, and non-profit programming. Originally from Vietnam, Long earned a Bachelor of Arts degree in English and psychology from Houston Baptist University and a Master of Fine Arts degree in creative writing from the University of Houston Creative Writing Program. His poems and essays have been published in several anthologies, including The New Anthology of American Poetry: Postmodernisms 1950-Present and From Both Sides Now: The Poetry of the Vietnam War and Its Aftermath . His libretto for the opera Bound , composed by Huang Ruo, premiered in Houston in 2014, New York in 2019, and Seattle in 2023. Kathy Mouachepao Metropolitan Regional Arts Council Kathy Mouacheupao (she/her/hers) joined the MRAC team as executive director in June 2018. She has been an MRAC applicant, panelist, and board member and brings all of those perspectives to her role. She is passionate about the intersection of arts, culture and community and has dedicated her personal and professional life to the field. Prior to MRAC, Mouacheupao served as Program Officer for Creative Placemaking with the Twin Cities Local Initiatives Corporation. In her earlier career, she was the Executive Director for the Center for Hmong Arts and Talent. She was a 2016 Roy Wilkins Fellow and a 2011 Bush Leadership Fellow. Currently, she is Vice Chair for the Forum of Regional Arts Councils of MN, and serves as a member of MN Citizens for the Arts Board, the Racial Equity Funders Collaborative, the We Are Still Here MN Philanthropy Task Force, and the Building More Philanthropy with Purpose Giving Circle. Anna Needham Arizona Commission on the Arts Anna Needham is an enrolled citizen of the Red Lake Nation of Ojibwe. She is a theatre artist, Indigenous rights advocate, and arts administrator.  She currently serves as the Tribal Relations Manager for the Arizona Commission on the Arts, acting as the agency’s liaison with the 22 Tribal Nations in Arizona. Anna graduated from New York University’s Tisch School of the Arts with a Bachelor in Fine Arts in Theatre and minor in Producing. She participated in the Spring 2018 Native American Political Leadership Program at George Washington University. As part of the program, she was able to intern at the National Endowment for the Arts. She then went on to intern at the Phoenix Office of Arts & Culture before she was hired in 2019 by the Arts Commission to be the Artist Programs Coordinator. In that role, she ran and developed grants, services, and programs for individual artists. Beyond her work at the Arts Commission, Anna participated in the development of the first national Native Arts & Cultures Convening and companion federal resource guide produced in February 2020. She has been a panelist for other local, regional, and national funders, including the National Endowment for the Arts. She is currently part of the Circle of Advisors for the National Assembly of State Arts Agencies’ Strengthening State Arts Agency Relationships with Native Communities initiative. In 2022, Anna developed the foundational Tribal Consultation Policy for the Arizona Commission on the Arts, the first and currently only of the total 56 state and jurisdictional arts agencies in the United States. Glenisse Pagán Ortiz Filantropía Puerto Rico (Philanthropy Puerto Rico) Glenisse Pagán Ortiz is executive director of Filantropía Puerto Rico (Philanthropy Puerto Rico), a philanthropy-serving organization connecting philanthropic entities and amplifying their voice and impact in areas of equity, collaboration, transparency and social justice. As a convener of funders with grantmaking focus on Puerto Rico, they lead efforts to improve the lives of the marginalized. Pagán was born, raised, and lives in Puerto Rico where she leads a multi-passionate life learning, teaching, challenging others, and being challenged. She also loves technology, nature, adventure, but above all, she lives to inspire people to take action and help them find their purpose. Upon graduating from Electrical Engineering at the University of Puerto Rico’s Mayagüez campus (UPRM), Pagán began working with Kodak and later with Motorola, who granted her a scholarship for a Master’s degree at Georgia Tech. For the next 17 years, Pagán worked at Lucent Technologies and Cisco Systems. She began her career as a Systems Engineer and ended as a Business Developer Manager in charge of teams throughout Latin America. In 2018, she began working as chief operating officer for Filantropía Puerto Rico (then called Foundation Network of Puerto Rico), and in 2019 she was named executive director. Zeyba Rahman Doris Duke Foundation for Islamic Arts Zeyba Rahman is senior program officer for the Building Bridges Program of the Doris Duke Foundation for Islamic Art. Rahman joined the Doris Duke Foundation for Islamic Art, an extension of the Doris Duke Charitable Foundation, in 2013 as senior program officer for the Building Bridges Program. Rahman manages the Program’s national grant making to support projects that advance relationships, increase understanding between American Muslim and non-Muslim communities. Prior to joining the foundation, Rahman led internationally and nationally recognized projects as an artistic director and producer to promote understanding and communal harmony between diverse communities. In that capacity, she has served as: director, Asia and North America, Fes Festival of World Sacred Music in Morocco; creative consultant, Public Programs, Metropolitan Museum of Art’s Arab Lands, Turkey, Iran, Central Asia and Later South Asia Galleries; curator, Brooklyn Academy of Music’s Mic Check Hip Hop; senior advisor, Muslim Voices: Arts & Ideas Festival led by Asia Society and Brooklyn Academy of Music in collaboration with more than fifteen leading New York City-based institutional cultural and educational partner; artistic director, Arts Midwest’s Caravanserai: A Place Where Cultures Meet; chief curator, Alliance Francaise’s World Nomads Morocco Festival and project director, Mid Atlantic Arts Foundation’s Global Cultural Connections. She is an advisor to Artworks for Freedom, an organization using the arts for strategic communication to fight human trafficking; and serves on the steering committee of the Switzerland-based Aga Khan Trust for Culture’s Music Awards and the nominating committee of the Civitella Foundation in Italy. Twice honored by New York City’s government, Rahman is the subject of two television profiles as a global arts leader. Michelle Ramos Foundation for Louisiana Dr. Michelle Ramos applies critical race theory and lived experiences to disrupt long standing white supremacist structures and systems. Her work focuses on shifting power to Black and Brown people through pushing boundaries, challenging status quo and reflecting values of equity and justice in her day-to-day practice. Before leading Alternate ROOTS, she worked as Managing Director for the Vera Institute of Justice New Orleans and Program Officer for the Women’s Foundation of California. She serves on the boards of Foundation for Louisiana, Dancing Grounds and Performing Arts Alliance. A licensed attorney with a PhD in Psychology, she has significant organizing experience and has committed her career to serving communities and individuals adversely impacted by issues of race, gender, disability, class, socioeconomics, inequitable laws and systemic oppression. She has consulted for over 20 years nationally and internationally. She is the proud mother of Broadway choreographer, Ellenore Scott, and since retiring from her own dance career, Ramos has continued to teach dance, has competed as an Ironman triathlete and now enjoys her southern New Orleans lifestyle. Kristin Sakoda Los Angeles County Department of Arts and Culture Kristin Sakoda is the Director of the newly-established Los Angeles County Department of Arts and Culture, the local arts agency dedicated to advancing arts, culture, and creativity throughout Los County, the largest county in the U.S. The Department of Arts and Culture provides grants and technical assistance to hundreds of nonprofit organizations; administer the largest paid arts internship program in the nation; coordinates public-private arts education initiatives; increases access to creative career pathways; commissions civic artwork; supports free community programs; leads the LA County Cultural Equity and Inclusion Initiative; and advances cross-sector cultural strategies to address civic issues. An arts executive, attorney, and performing artist, Ms. Sakoda has over 25 years of multi-faceted experience in the cultural field. She formerly served as the Executive Director of the LA County Arts Commission, which transitioned into the first-ever Department under her leadership. Ms. Sakoda previously served as a key strategist for arts and culture at the New York City Department of Cultural Affairs holding the posts of General Counsel and Deputy Commissioner, and holds a J.D. from NYU School of Law and B.A. from Stanford University specializing in Race and Ethnicity and Feminist Studies. She is a member of the Americans for the Arts’ United States Urban Arts Federation comprised of the chief executives of the local arts agencies of the nation’s largest 60 cities, and previously served on the board of her former dance company Urban Bush Women. Robert Smith III Surdna Foundation Robert Smith III (he/him) is Surdna Foundation's Senior Program Officer of the Thriving Cultures Program, leading a $10 million portfolio focused on unleashing the radical imagination of artists and culture workers in the service of racial justice. He manages the Program’s grantmaking, learning strategies, and collaborations with grantees, partners, and funders that further the Foundation’s social justice mission. Robert’s work is guided by the long struggle for freedom as summed up in these two quotes. “As a culture worker who belongs to an oppressed people, my job is to make revolution irresistible.” — Toni Cade Bambara, Conversations with Toni Cade Bambara “Without new visions, we don’t know what to build, only what to knock down. We not only end up confused, rudderless, and cynical, but we forget that making a revolution is not a series of clever maneuvers and tactics, but a process that can and must transform us.” – Robin D.G. Kelley, Freedom Dreams: The Black Radical Imagination Before joining  Surdna in 2019, he served as Associate Director of the National Public Housing Museum in Chicago, IL, the only cultural institution devoted to telling the story of public housing in the United States. Robert has held positions at the Art Institute of Chicago, the Walker Art Center, the Minnesota Historical Society, and OutRight Action International. He has served on the boards of Project Fierce Chicago, a grassroots response to LGBTQ youth homelessness; PFund Foundation, an LGBTQ community foundation based in Minneapolis; and the Brown University Alumni Association. Born and raised in South Florida, he is a graduate of Brown University and the University of Minnesota. Quita Sullivan New England Foundation for the Arts Quita Sullivan (Montaukett/Shinnecock) is the program director for Theater at New England Foundation for the Arts (NEFA) where she leads the National Theater Project, supporting the creation and touring of devised, ensemble-based theater. She holds Bachelor and Master of Arts degrees in Theatre from Knox College and SUNY Stony Brook, respectively, as well as a Juris Doctorate from Wayne State University Law School. Before law school, she worked as a Stage Manager at ETA in Chicago and was the first stage manager for ETA’s production of Checkmates by Ron Milner, directed by Woodie King, Jr. She later worked at Great Lakes Performing Artist Associates, a not-for-profit artist management office, creating contracts, and managing booking and performing fees for musicians in the Great Lakes area. After law school, she practiced environmental justice law for 10 years in Detroit and Boston. She is a senior fellow of the Environmental Leadership Program and an alumna of the artEquity Facilitator Training. She is also a former Associated Grant Makers Diversity Fellow, the mission of which was to identify, recruit, and cultivate emerging practitioners of color who represent the next generation of philanthropic leaders and offer them training, support and strong community. She continues to work to support equity and inclusion at all levels of theater and grant making. She is a frequent speaker on supporting Indigenous Artists and Land Acknowledgement. Prior to joining NEFA as a staff member, Sullivan was an advisor for NEFA’s Native Arts Program. Outside of work, she continues to develop her own artistic talents as a beadwork artist. Sullivan is Of Counsel to and an enrolled member of the Montaukett tribe. Photo by Jeffrey Lyons Filiault. Marissa Tirona Grantmakers Concerned with Immigrants and Refugees Marissa Tirona is President of Grantmakers Concerned with Immigrants and Refugees, where she leads the organization’s efforts to move money and power to immigrant and refugee communities and galvanizes funders to resource a robust immigration and refugee rights power-building ecosystem. Previously, she was a program officer at the Ford Foundation, where she managed a multi-issue, multi-country portfolio as part of the BUILD initiative, Ford’s flagship program designed to strengthen organizations and networks core to the global social justice infrastructure. Before joining Ford, Marissa led the Blue Shield of California Foundation’s efforts to address, prevent, and ultimately end domestic violence and promote health equity in California. Prior to that, she was senior project director at CompassPoint Nonprofit Services, where she led comprehensive, multiyear leadership initiatives. Marissa currently serves on the boards of the Foundation for Child Development, Grantmakers in the Arts, United Philanthropy Forum, and Change Elemental. She holds a J.D. from Santa Clara University School of Law, is a member of the California State Bar, and has a B.A. in English literature with a concentration in women’s studies from Swarthmore College. Carlton Turner First Peoples Fund Carlton Turner is an artist, agriculturalist, researcher, and co-founder of the Mississippi Center for Cultural Production (Sipp Culture). Turner serves on the board of First Peoples Fund, Imagining America, Project South, and the National Black Food and Justice Alliance. A member of the We Shall Overcome Fund Advisory Committee at the Highlander Center for Research and Education and is the former Executive Director of Alternate ROOTS, he is also a founding partner of the Intercultural Leadership Institute. Turner is an Interdisciplinary Research Fellow with the Robert Woods Johnson Foundation and was named to the Yerba Buena Center for the Arts YBCA100. He is a former Ford Foundation Art of Change Fellow and former Cultural Policy Fellow at the Creative Placemaking Institute at Arizona State University’s Herberger Institute for Design in the Arts. Turner is also co-founder and co-artistic director, with his brother Maurice Turner, of the group M.U.G.A.B.E.E. (Men Under Guidance Acting Before Early Extinction), a Mississippi-based performing arts group that blends of jazz, hip-hop, spoken word poetry and soul music together with non-traditional storytelling. Sixto Wagan Greater Houston BIPOC Arts Network and Fund Sixto Wagan is the Project Director for the Greater Houston BIPOC Arts Network and Fund (BANF). Using the collective impact approach to social change as a model, BANF is structured as a community-led collaborative fund and a resource network guided by arts leaders, arts practitioners, and funders. Acknowledging historical underinvestment in Houston BIPOC cultures and art communities, the initiative will cede decision-making power about grants to the very communities impacted by funding decisions. Previously, he founded and developed the Center for Art and Social Engagement (CASE) in the Kathrine G. McGovern College of the Arts at the University of Houston. At CASE, Wagan developed pilot programs, community partnerships, and research initiatives that centered creativity and community in impact conversations for 21st  century cities.  He also led DiverseWorks, serving as Artistic Director, Co-Executive Director and Performing Arts Curator. During his tenure, he nurtured artists, communities and emerging arts organizations through commissions and place-based initiatives. Wagan continues to expand his work as a strategic visioning and cultural equity facilitator. He has been a speaker and moderator at national convenings around topics of equity, leadership development, transition planning, and community stewardship Special Series: For the Love of Radical Giving Podcast Tune into For the Love of Radical Giving podcast, a GIA Reader miniseries that deconstructs traditional philanthropy and celebrates the joy and power of giving out of love. Each episode explores radical, innovative, community-driven approaches that challenge traditional philanthropic models, highlighting the voices and experiences of those actively working to democratize philanthropy and create equitable, impactful change. GIA · For the Love of Radical Giving Miniseries | GIA Reader | 2024 · ALL PODCASTS Explore the conference blog Videos from the GIA 2024 Conference are now available for streaming. Don't miss a thing: Sign up for GIA news & updates Discover the Benefits of Becoming a GIA Member © Grantmakers in the Arts | Photo Credits | Privacy Policy | gia@giarts.org 2024 Member Survey Please fill out the survey. Your feedback is invaluable in helping shape our programming. Take the Survey Facebook Instagram LinkedIn YouTube Flickr RSS"
    }
  ]
}