{
  "fuentes": [
    {
      "url": "https://www.cascade-hotel.com/contact-us",
      "email": "info@cascade-hotel.com"
    },
    {
      "url": "https://www.wlrn.org/culture/2014-10-30/a-history-of-the-biltmore-miamis-best-known-creepy-hotel",
      "email": "jmarch@wlrn.org"
    },
    {
      "url": "https://www.biltmorehotel.com/careers/job-openings/",
      "email": "hronlinebh@biltmorehotel.com"
    },
    {
      "url": "https://www.biltmorehotel.com/contact-us/",
      "email": "general@biltmorehotel.com"
    },
    {
      "url": "https://www.biltmorehotel.com/contact-us/",
      "email": "pr@biltmorehotel.com"
    },
    {
      "url": "https://www.biltmorehotel.com/careers/biltmore-hotel-human-resources-team/",
      "email": "hronlinebh@biltmorehotel.com"
    },
    {
      "url": "https://www.biltmorehotel.com/es/contact/",
      "email": "general@biltmorehotel.com"
    },
    {
      "url": "https://www.biltmorehotel.com/es/contact/",
      "email": "pr@biltmorehotel.com"
    },
    {
      "url": "https://www.biltmorehotel.com/careers/",
      "email": "hronlinebh@biltmorehotel.com"
    },
    {
      "url": "https://biltmorehotel.com/contact-miami-resort/",
      "email": "general@biltmorehotel.com"
    },
    {
      "url": "https://biltmorehotel.com/contact-miami-resort/",
      "email": "pr@biltmorehotel.com"
    }
  ],
  "mails": [
    "general@biltmorehotel.com",
    "hronlinebh@biltmorehotel.com",
    "info@cascade-hotel.com",
    "jmarch@wlrn.org",
    "pr@biltmorehotel.com"
  ],
  "nombre_sitio": "biltmorehotel.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.cascade-hotel.com/contact-us",
      "text": "Contact Us | Cascade Hotel cascade INTRODUCTION ACCOMODATION SERVICES TARIFF GAllERY CONTACT US Making reservations for your group has never been easier. We offer an Online Reservation. Check In Check Out Room Type Super Deluxe Deluxe Country Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bosnia and Herzegowina Botswana Bouvet Island Brazil Brunei Darussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Canada Cape Verde Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos (Keeling) Islands Colombia Comoros Congo Cook Islands Costa Rica Cote d'Ivoire Croatia (Hrvatska) Cuba Cyprus Czech Republic Denmark Djibouti Dominica Dominican Republic East Timor Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Ethiopia Falkland Islands (Malvinas) Faroe Islands Fiji Finland France France, Metropolitan French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guinea Guinea-Bissau Guyana Haiti Honduras Hong Kong Hungary Iceland India Indonesia Iraq Ireland Israel Italy Jamaica Japan Jordan Kazakhstan Kenya Kiribati Korea Kuwait Kyrgyzstan Latvia Lebanon Lesotho Liberia Libyan Arab Jamahiriya Liechtenstein Lithuania Luxembourg Macau Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Monaco Mongolia Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands Netherlands Antilles New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island Northern Mariana Islands Norway Oman Pakistan Palau Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Reunion Romania Russian Federation Rwanda Saint Kitts and Nevis Saint LUCIA Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Seychelles Sierra Leone Singapore Slovakia (Slovak Republic) Slovenia Solomon Islands Somalia South Africa Spain Sri Lanka St. Helena St. Pierre and Miquelon Sudan Suriname Swaziland Sweden Switzerland Syrian Arab Republic Tajikistan Thailand Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkey Turkmenistan Turks and Caicos Islands Tuvalu Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Venezuela Viet Nam Virgin Islands (British) Virgin Islands (U.S.) Wallis and Futuna Islands Western Sahara Yemen Yugoslavia Zambia Zimbabwe 977-1-4439602 / 4439603 630 true dots bottomright 230 true true 800 none 5000 fade false 60 bottom 30 5000 fade false 60 bottom 30 5000 fade false 60 bottom 30 5000 fade false 60 bottom 30 5000 fade false 60 bottom 30 5000 fade false 60 bottom 30 5000 fade false 60 bottom 30 5000 fade false 60 bottom 30 Contact Us We are only 15 minutes drive from the Tribhuvan international airport, close to the royal palace museum, It is within easy access to all centres of tourist interests and walking distances to all the major embassies like the British Embassy (5 mins) French Embassy (2mins) Indian Embassy (5mins) Japanese Embassy (5 mins) and the American Embassy (20 mins).Our guests can take advantage of tasting all kinds of different cuisines at the restaurant in the hotel as well as restaurants surrounding the Lazimpat area. Hotel Cascade Pvt. Ltd. G.P.O Box: 11450 Lazimpat, Kathmandu, Nepal Phone: 977-1-4439602, 4439603, 4418757 Email: info@cascade-hotel.com , cascadehotel@gmail.com www.cascade-hotel.com Your Name (required) Your Email (required) Subject Your Message View Larger Map © 2011.Cascade Hotel.All Rights Reserved. Home | Accomodation | Services | Tariff | Gallery | Contact us Terms & Condition"
    },
    {
      "url": "https://www.wlrn.org/culture/2014-10-30/a-history-of-the-biltmore-miamis-best-known-creepy-hotel",
      "text": "A history of the Biltmore, Miami's best-known creepy hotel | WLRN Search Query Show Search HOME News Latest Headlines News In Brief Government & Politics Education Americas Environment Law & Justice Business & Economy Investigations Arts & Culture PolitiFact Florida Health Weather Special Series Archive Latest Headlines News In Brief Government & Politics Education Americas Environment Law & Justice Business & Economy Investigations Arts & Culture PolitiFact Florida Health Weather Special Series Archive Radio & Podcasts Radio Radio Schedule How to listen to WLRN Classical Podcasts Americas Decoded Killer Train The Florida Roundup The South Florida Roundup Bright Lit Place Detention By Design Tallahassee Takeover Folk & Acoustic Music The Public Storyteller Radio Radio Schedule How to listen to WLRN Classical Podcasts Americas Decoded Killer Train The Florida Roundup The South Florida Roundup Bright Lit Place Detention By Design Tallahassee Takeover Folk & Acoustic Music The Public Storyteller Newsletters TV Television TV Schedule WLRN Passport WLRN Documentaries Watch WLRN Producing For WLRN Ways To Watch WLRN Television TV Schedule WLRN Passport WLRN Documentaries Watch WLRN Producing For WLRN Ways To Watch WLRN Support Members Membership Drawing Giveaways Vehicle Donation WLRN Passport Planned Giving Tax Savvy Giving More ways to give Member Portal Login Sponsorship Corporate Sponsorship Corporate Circle Members Membership Drawing Giveaways Vehicle Donation WLRN Passport Planned Giving Tax Savvy Giving More ways to give Member Portal Login Sponsorship Corporate Sponsorship Corporate Circle About WLRN Mission and Vision WLRN Management Miami-Dade County Public School Board WLRN Staff WLRN Jobs Privacy Policy Comment Policy Source Tracking Policy WLRN Public Files and Records Commitment to Equal Employment Opportunities Local Content and Service Report Annual Programming Report WLRN's Community Advisory Board WLRN Captioning Certificate WLRN Mission and Vision WLRN Management Miami-Dade County Public School Board WLRN Staff WLRN Jobs Privacy Policy Comment Policy Source Tracking Policy WLRN Public Files and Records Commitment to Equal Employment Opportunities Local Content and Service Report Annual Programming Report WLRN's Community Advisory Board WLRN Captioning Certificate MORE Events Calendar Shop WLRN Station Tours Producing For WLRN Mobile Listening Troubleshooting Events Calendar Shop WLRN Station Tours Producing For WLRN Mobile Listening Troubleshooting © 2025 WLRN Menu Show Search Search Query DONATE Play Live Radio Next Up: 0:00 0:00 0:00 0:00 Available On Air Stations On Air Now Playing WLRN NPR News On Air Now Playing WLRN Classical All Streams HOME News Latest Headlines News In Brief Government & Politics Education Americas Environment Law & Justice Business & Economy Investigations Arts & Culture PolitiFact Florida Health Weather Special Series Archive Latest Headlines News In Brief Government & Politics Education Americas Environment Law & Justice Business & Economy Investigations Arts & Culture PolitiFact Florida Health Weather Special Series Archive Radio & Podcasts Radio Radio Schedule How to listen to WLRN Classical Podcasts Americas Decoded Killer Train The Florida Roundup The South Florida Roundup Bright Lit Place Detention By Design Tallahassee Takeover Folk & Acoustic Music The Public Storyteller Radio Radio Schedule How to listen to WLRN Classical Podcasts Americas Decoded Killer Train The Florida Roundup The South Florida Roundup Bright Lit Place Detention By Design Tallahassee Takeover Folk & Acoustic Music The Public Storyteller Newsletters TV Television TV Schedule WLRN Passport WLRN Documentaries Watch WLRN Producing For WLRN Ways To Watch WLRN Television TV Schedule WLRN Passport WLRN Documentaries Watch WLRN Producing For WLRN Ways To Watch WLRN Support Members Membership Drawing Giveaways Vehicle Donation WLRN Passport Planned Giving Tax Savvy Giving More ways to give Member Portal Login Sponsorship Corporate Sponsorship Corporate Circle Members Membership Drawing Giveaways Vehicle Donation WLRN Passport Planned Giving Tax Savvy Giving More ways to give Member Portal Login Sponsorship Corporate Sponsorship Corporate Circle About WLRN Mission and Vision WLRN Management Miami-Dade County Public School Board WLRN Staff WLRN Jobs Privacy Policy Comment Policy Source Tracking Policy WLRN Public Files and Records Commitment to Equal Employment Opportunities Local Content and Service Report Annual Programming Report WLRN's Community Advisory Board WLRN Captioning Certificate WLRN Mission and Vision WLRN Management Miami-Dade County Public School Board WLRN Staff WLRN Jobs Privacy Policy Comment Policy Source Tracking Policy WLRN Public Files and Records Commitment to Equal Employment Opportunities Local Content and Service Report Annual Programming Report WLRN's Community Advisory Board WLRN Captioning Certificate MORE Events Calendar Shop WLRN Station Tours Producing For WLRN Mobile Listening Troubleshooting Events Calendar Shop WLRN Station Tours Producing For WLRN Mobile Listening Troubleshooting Arts & Culture A history of the Biltmore, Miami's best-known creepy hotel WLRN Public Media Published October 31, 2023 at 10:00 AM EDT Facebook Twitter LinkedIn Email Listen • 3:52 1 of 5 Looking east over the golf course at the Miami Biltmore Hotel. State Archives of Florida, Florida Memory, http://floridamemory.com/items/show/24482 2 of 5 The interior of the Biltmore Hotel in Coral Gables is rumored to be haunted. The historic hotel was also used as a military hospital and a medical school. Fishbaugh, W. A.(William A.), 1873-1950 / State Archives of Florida, Florida Memory, http://floridamemory.com/items/show/165357 3 of 5 John McEntee Bowman and George E. Merrick on the steps of Biltmore Country Club. Fishbaugh, W. A.(William A.), 1873-1950 / State Archives of Florida, Florida Memory, http://floridamemory.com/items/show/37321 4 of 5 Babe Ruth and the former governor of New York, Al Smith, playing a round of golf at the Miami Biltmore, as it was called. Romer, G. W. (Gleason Waite), 1887-1971 5 of 5 The Biltmore Hotel in 2010 Jorge Royan This article was originally published on Oct. 30, 2014. The Biltmore Hotel in Coral Gables wasn't always a hotel. It was built in 1926 by a young developer named George Merrick, who's known as the founder of Coral Gables. The hotel became a place to host glamorous fashion shows, galas, golf tournaments and water shows in what was then the largest pool in the world. At a loud party on the 13th floor of the hotel in 1929, a gangster named Thomas \"Fatty\" Walsh was shot and killed by another gangster. That murder yielded a lot of ghost rumors over the years. READ MORE: This South Florida literary journal gives us a closer look at the strange and occult Credit Julia Duba Betsy Skipp in her Coral Gables home. When Skipp was growing up, she and her friends would sneak into the abandoned Biltmore Hotel. Then World War II happened and the federal government transformed the Biltmore into a military hospital. Once the war was over, it continued being a hospital for veterans. In 1952, the University of Miami made the Biltmore its first home. When the hospital closed in 1968, the Biltmore became an abandoned shell. That's when neighborhood kids started sneaking in. \"All the kids would always talk about how there must be ghosts in there,\" says Betsy Skipp, who grew up in Coral Gables and would sneak into the Biltmore with her friends. \"You'd sneak out of the house and we all had flashlights.\" So many kids were sneaking into the shuttered building, that the City of Coral Gables decided to hire a security guard. Kim Dunn-Zocco also grew up in Coral Gables and would sneak into the shuttered building. Sneaking past the guard, whom they nicknamed \"The Greenie\" after the guard's green golf-cart, was part of the fun, she says. \"Once you got in, that's when it started to get a little creepy and quiet and creaky,\" says Zocco. Check out this 1988 student documentary called \"The Biltmore's Strange Guest List\" produced by Kathy Bolduc as a final project for a University of Miami class. Because the Biltmore had been a veteran's hospital and a medical school, Zocco says her friends' worst fear was the possibility of seeing a dead body inside the building. One time, her friend swore he saw a severed limb. \"I remember we just ripped it out of there and hauled ourselves all the way home.\" In 1983, Coral Gables put $55 million into renovating the Biltmore. The hotel reopened in 1987 and was restored to glory. Ten years later, the Biltmore was added to the National Registry of Historic Places. Credit Julia Duba Linda Spitzer shares a photo of herself telling ghost stories in the Biltmore Hotel lobby. Still, the ghost stories kept swirling. Starting in 1994, Linda Spitzer told ghost stories every Thursday night in the Biltmore's lobby. She was a staple for 10 years, before she moved to Lake Worth. \"The guests loved it,\" says Spitzer, who would wear sun hats reminiscent of The Roaring Twenties. \"I would tell them I'm here from 7 p.m. until 7:30 p.m. and it would drag on until 8 p.m.\" READ MORE: Looking for ghost stories? Here are 5 new YA books that will haunt you She did her research before telling her stories, but she says her best material came from the hotel guests themselves. Today the Biltmore is far from the creepy place that once terrified the children of Coral Gables. For Zocco, it's been an inescapable part of life. Her husband's uncle was a veteran patient when it was a hospital, her father went to medical school as a University of Miami student, she and her sister both had jobs at the hotel. And now she takes her family there for brunch. \"It's such a beautiful building with so much history and so much mystery that you can't help but be drawn to it whether it's empty or living and breathing.\" Credit Courtesy: Kim Dunn-Zocco Zocco was 17 years old when she worked at the Biltmore's banquet. Browse more photos of the Biltmore Hotel on the Miami Herald's Flashback Miami archive . Tags Arts & Culture Coral Gables Biltmore Hotel Halloween Miami-Dade County Facebook Twitter LinkedIn Email Public funding is gone. But WLRN is still here—because of YOU. WLRN has lost over $3 million in federal and state support. Your donation today helps fill the gap and keeps trusted, local journalism alive. If you value the stories you read, please give now. Support WLRN Latest Stories South Florida Cuban ex-CIA agent Felix Rodriguez: From Bay of Pigs to Che Guevara's execution Education Florida flunks sex ed in national report Development Riviera Beach launches $400 million water plant Health Florida Democrats urge DeSantis to stop plans to ban childhood vaccine mandates More On This Topic Monthly art event gives artists a voice and community in Little Havana 'Behind the Eye': Former CBS president pens memoir of his life in TV news business Stephen Muss, developer who helped revive Miami Beach, dies at 97 After decades of neglect, Miami leaders and activists see hope in Marine Stadium plans Stay Connected twitter instagram youtube pinterest facebook linkedin © 2025 WLRN About Contact Us Donate Underwrite Shop Newsletters FCC Public Files WLRN-TV FCC Public File WLRN-FM FCC Public File WKWM-FM FCC Public File WLRN Public Files and Records EEO Report Station Public Files Contact - James March  (305) 995-2446 or JMarch@wlrn.org WLRN Management"
    },
    {
      "url": "https://www.biltmorehotel.com/careers/job-openings/",
      "text": "Careers - The Biltmore Hotel Skip to content Go to... The Biltmore Centennial About Us Gallery Membership Shops FAQ Contact Us 305 445 1926 80 °F Accommodations Rooms Suites Presidentials Amenities Dining Fontana Restaurant Cascade Fairways Sunday Brunch Brandi’s The Biltmore Bar In-Room Dining Afternoon Tea Posto DOLCE Wellness Spa Salon Fitness Tennis Pool The Club Juice Bar Golf Golf Overview Course Information Golf Membership Course Policies Jim McLean Golf School Announcements Events Weddings Meetings Celebrations Corporate Events Production & Filming Offers Calendar Reservations Go to... Accommodations Rooms Suites Presidentials Amenities Dining Fontana Restaurant Cascade Fairways Sunday Brunch Brandi’s The Biltmore Bar In-Room Dining Afternoon Tea Posto DOLCE Wellness Spa Salon Fitness Tennis Pool The Club Juice Bar Golf Golf Overview Course Information Golf Membership Course Policies Jim McLean Golf School Announcements Events Weddings Meetings Celebrations Corporate Events Production & Filming Offers Calendar Reservations Off Canvas Toggle Reservations Careers Careers 2024-07-15T17:49:12-04:00 Biltmore Hotel Careers At the Biltmore Hotel in Miami, we refer to our team members as Storytellers. We seek storytellers who are passionate about The Biltmore and our guests to create unique and memorable experiences. Storytellers who build relationships with our guests and each other. A storyteller is someone who takes personal ownership in producing a high quality and detailed experience for the guest and their fellow storytellers. Storytellers take pride in achieving their personal best. A career at The Biltmore is one you can be proud of. Our storytellers are recognized in the industry for their outstanding contributions to hospitality. Apply Now Diverse and Inclusive Workplace Environment We encourage everyone to be charming, stylish, unique, and iconic, but most of all, be yourself. Open Positions Whether you are just beginning your hospitality career or seeking an opportunity to advance and grow. The Biltmore Hotel in Coral Gables/ Miami has the following opportunities available for you. Apply Now Benefits We offer attractive compensation and benefits packages to our storytellers at The Biltmore Coral Gables Miami. Full-time storytellers are eligible* for: Competitive Compensation Medical, Dental, & Vision Insurance Paid Time Off Health & Wellness Programs Storyteller Discounts for Golf, Spa, Dining, Fitness and Retail Complimentary Parking and Shift Meal 401(k) Plans Recognition Awards and Events Discounts on Local Entertainment and Services Career Advancement Training and Opportunities *Eligibility requirements may apply Contact Us The Biltmore Human Resources team is available to answer any questions related to employment and recruitment opportunities. Contact Us Sign Up for Our Newsletter Sign Up Contact Us 1200 ANASTASIA AVENUE, CORAL GABLES, FL. 33134 1 855 311 6903 80 °F 1200 ANASTASIA AVENUE CORAL GABLES, FL. 33134 1 855 311 6903 Helpful Links Press Careers Contact Us Gift Cards FAQ GableStage Theatre Company Donation Requests BILTMORE HOTEL © Privacy Policy Website Accessibility Sitemap Page load link Accommodations Rooms Suites Presidentials Amenities Dining Fontana Restaurant Cascade Fairways Sunday Brunch Brandi’s The Biltmore Bar In-Room Dining Afternoon Tea Posto DOLCE Wellness Spa Salon Fitness Tennis Pool The Club Juice Bar Golf Golf Overview Course Information Golf Membership Course Policies Jim McLean Golf School Announcements Events Weddings Meetings Celebrations Corporate Events Production & Filming Offers Calendar Reservations The Biltmore Centennial About Us Gallery Membership Shops FAQ Contact Us 305 445 1926 80 °F Go to Top"
    },
    {
      "url": "https://www.biltmorehotel.com/contact-us/",
      "text": "Contact Us - The Biltmore Hotel Skip to content Go to... The Biltmore Centennial About Us Gallery Membership Shops FAQ Contact Us 305 445 1926 79 °F Accommodations Rooms Suites Presidentials Amenities Dining Fontana Restaurant Cascade Fairways Sunday Brunch Brandi’s The Biltmore Bar In-Room Dining Afternoon Tea Posto DOLCE Wellness Spa Salon Fitness Tennis Pool The Club Juice Bar Golf Golf Overview Course Information Golf Membership Course Policies Jim McLean Golf School Announcements Events Weddings Meetings Celebrations Corporate Events Production & Filming Offers Calendar Reservations Go to... Accommodations Rooms Suites Presidentials Amenities Dining Fontana Restaurant Cascade Fairways Sunday Brunch Brandi’s The Biltmore Bar In-Room Dining Afternoon Tea Posto DOLCE Wellness Spa Salon Fitness Tennis Pool The Club Juice Bar Golf Golf Overview Course Information Golf Membership Course Policies Jim McLean Golf School Announcements Events Weddings Meetings Celebrations Corporate Events Production & Filming Offers Calendar Reservations Off Canvas Toggle Reservations Contact Us Contact Us 2024-07-15T14:14:03-04:00 We Want to Hear From You Please use the dropdown menu in the Reason For Contacting Us field in order to expedite reaching the proper department \" * \" indicates required fields Name * First Last Email * Phone Reason for contacting us: * Business Meeting Wedding Special Event Press Other Message * The Biltmore Hotel Miami-Coral Gables 1200 Anastasia Avenue Coral Gables,FL 33134 United States of America Social Media, Press & Media Inquiries PR@biltmorehotel.com General Inquiries General@biltmorehotel.com Sign Up for Our Newsletter Sign Up Contact Us 1200 ANASTASIA AVENUE, CORAL GABLES, FL. 33134 1 855 311 6903 79 °F 1200 ANASTASIA AVENUE CORAL GABLES, FL. 33134 1 855 311 6903 Helpful Links Press Careers Contact Us Gift Cards FAQ GableStage Theatre Company Donation Requests BILTMORE HOTEL © Privacy Policy Website Accessibility Sitemap Page load link Accommodations Rooms Suites Presidentials Amenities Dining Fontana Restaurant Cascade Fairways Sunday Brunch Brandi’s The Biltmore Bar In-Room Dining Afternoon Tea Posto DOLCE Wellness Spa Salon Fitness Tennis Pool The Club Juice Bar Golf Golf Overview Course Information Golf Membership Course Policies Jim McLean Golf School Announcements Events Weddings Meetings Celebrations Corporate Events Production & Filming Offers Calendar Reservations The Biltmore Centennial About Us Gallery Membership Shops FAQ Contact Us 305 445 1926 79 °F Go to Top"
    },
    {
      "url": "https://www.biltmorehotel.com/careers/biltmore-hotel-human-resources-team/",
      "text": "Careers - The Biltmore Hotel Skip to content Go to... The Biltmore Centennial About Us Gallery Membership Shops FAQ Contact Us 305 445 1926 80 °F Accommodations Rooms Suites Presidentials Amenities Dining Fontana Restaurant Cascade Fairways Sunday Brunch Brandi’s The Biltmore Bar In-Room Dining Afternoon Tea Posto DOLCE Wellness Spa Salon Fitness Tennis Pool The Club Juice Bar Golf Golf Overview Course Information Golf Membership Course Policies Jim McLean Golf School Announcements Events Weddings Meetings Celebrations Corporate Events Production & Filming Offers Calendar Reservations Go to... Accommodations Rooms Suites Presidentials Amenities Dining Fontana Restaurant Cascade Fairways Sunday Brunch Brandi’s The Biltmore Bar In-Room Dining Afternoon Tea Posto DOLCE Wellness Spa Salon Fitness Tennis Pool The Club Juice Bar Golf Golf Overview Course Information Golf Membership Course Policies Jim McLean Golf School Announcements Events Weddings Meetings Celebrations Corporate Events Production & Filming Offers Calendar Reservations Off Canvas Toggle Reservations Careers Careers 2024-07-15T17:49:12-04:00 Biltmore Hotel Careers At the Biltmore Hotel in Miami, we refer to our team members as Storytellers. We seek storytellers who are passionate about The Biltmore and our guests to create unique and memorable experiences. Storytellers who build relationships with our guests and each other. A storyteller is someone who takes personal ownership in producing a high quality and detailed experience for the guest and their fellow storytellers. Storytellers take pride in achieving their personal best. A career at The Biltmore is one you can be proud of. Our storytellers are recognized in the industry for their outstanding contributions to hospitality. Apply Now Diverse and Inclusive Workplace Environment We encourage everyone to be charming, stylish, unique, and iconic, but most of all, be yourself. Open Positions Whether you are just beginning your hospitality career or seeking an opportunity to advance and grow. The Biltmore Hotel in Coral Gables/ Miami has the following opportunities available for you. Apply Now Benefits We offer attractive compensation and benefits packages to our storytellers at The Biltmore Coral Gables Miami. Full-time storytellers are eligible* for: Competitive Compensation Medical, Dental, & Vision Insurance Paid Time Off Health & Wellness Programs Storyteller Discounts for Golf, Spa, Dining, Fitness and Retail Complimentary Parking and Shift Meal 401(k) Plans Recognition Awards and Events Discounts on Local Entertainment and Services Career Advancement Training and Opportunities *Eligibility requirements may apply Contact Us The Biltmore Human Resources team is available to answer any questions related to employment and recruitment opportunities. Contact Us Sign Up for Our Newsletter Sign Up Contact Us 1200 ANASTASIA AVENUE, CORAL GABLES, FL. 33134 1 855 311 6903 80 °F 1200 ANASTASIA AVENUE CORAL GABLES, FL. 33134 1 855 311 6903 Helpful Links Press Careers Contact Us Gift Cards FAQ GableStage Theatre Company Donation Requests BILTMORE HOTEL © Privacy Policy Website Accessibility Sitemap Page load link Accommodations Rooms Suites Presidentials Amenities Dining Fontana Restaurant Cascade Fairways Sunday Brunch Brandi’s The Biltmore Bar In-Room Dining Afternoon Tea Posto DOLCE Wellness Spa Salon Fitness Tennis Pool The Club Juice Bar Golf Golf Overview Course Information Golf Membership Course Policies Jim McLean Golf School Announcements Events Weddings Meetings Celebrations Corporate Events Production & Filming Offers Calendar Reservations The Biltmore Centennial About Us Gallery Membership Shops FAQ Contact Us 305 445 1926 80 °F Go to Top"
    },
    {
      "url": "https://www.biltmorehotel.com/es/contact/",
      "text": "Contact Us - The Biltmore Hotel Skip to content Go to... The Biltmore Centennial About Us Gallery Membership Shops FAQ Contact Us 305 445 1926 79 °F Accommodations Rooms Suites Presidentials Amenities Dining Fontana Restaurant Cascade Fairways Sunday Brunch Brandi’s The Biltmore Bar In-Room Dining Afternoon Tea Posto DOLCE Wellness Spa Salon Fitness Tennis Pool The Club Juice Bar Golf Golf Overview Course Information Golf Membership Course Policies Jim McLean Golf School Announcements Events Weddings Meetings Celebrations Corporate Events Production & Filming Offers Calendar Reservations Go to... Accommodations Rooms Suites Presidentials Amenities Dining Fontana Restaurant Cascade Fairways Sunday Brunch Brandi’s The Biltmore Bar In-Room Dining Afternoon Tea Posto DOLCE Wellness Spa Salon Fitness Tennis Pool The Club Juice Bar Golf Golf Overview Course Information Golf Membership Course Policies Jim McLean Golf School Announcements Events Weddings Meetings Celebrations Corporate Events Production & Filming Offers Calendar Reservations Off Canvas Toggle Reservations Contact Us Contact Us 2024-07-15T14:14:03-04:00 We Want to Hear From You Please use the dropdown menu in the Reason For Contacting Us field in order to expedite reaching the proper department \" * \" indicates required fields Name * First Last Email * Phone Reason for contacting us: * Business Meeting Wedding Special Event Press Other Message * The Biltmore Hotel Miami-Coral Gables 1200 Anastasia Avenue Coral Gables,FL 33134 United States of America Social Media, Press & Media Inquiries PR@biltmorehotel.com General Inquiries General@biltmorehotel.com Sign Up for Our Newsletter Sign Up Contact Us 1200 ANASTASIA AVENUE, CORAL GABLES, FL. 33134 1 855 311 6903 79 °F 1200 ANASTASIA AVENUE CORAL GABLES, FL. 33134 1 855 311 6903 Helpful Links Press Careers Contact Us Gift Cards FAQ GableStage Theatre Company Donation Requests BILTMORE HOTEL © Privacy Policy Website Accessibility Sitemap Page load link Accommodations Rooms Suites Presidentials Amenities Dining Fontana Restaurant Cascade Fairways Sunday Brunch Brandi’s The Biltmore Bar In-Room Dining Afternoon Tea Posto DOLCE Wellness Spa Salon Fitness Tennis Pool The Club Juice Bar Golf Golf Overview Course Information Golf Membership Course Policies Jim McLean Golf School Announcements Events Weddings Meetings Celebrations Corporate Events Production & Filming Offers Calendar Reservations The Biltmore Centennial About Us Gallery Membership Shops FAQ Contact Us 305 445 1926 79 °F Go to Top"
    },
    {
      "url": "https://www.biltmorehotel.com/careers/",
      "text": "Careers - The Biltmore Hotel Skip to content Go to... The Biltmore Centennial About Us Gallery Membership Shops FAQ Contact Us 305 445 1926 80 °F Accommodations Rooms Suites Presidentials Amenities Dining Fontana Restaurant Cascade Fairways Sunday Brunch Brandi’s The Biltmore Bar In-Room Dining Afternoon Tea Posto DOLCE Wellness Spa Salon Fitness Tennis Pool The Club Juice Bar Golf Golf Overview Course Information Golf Membership Course Policies Jim McLean Golf School Announcements Events Weddings Meetings Celebrations Corporate Events Production & Filming Offers Calendar Reservations Go to... Accommodations Rooms Suites Presidentials Amenities Dining Fontana Restaurant Cascade Fairways Sunday Brunch Brandi’s The Biltmore Bar In-Room Dining Afternoon Tea Posto DOLCE Wellness Spa Salon Fitness Tennis Pool The Club Juice Bar Golf Golf Overview Course Information Golf Membership Course Policies Jim McLean Golf School Announcements Events Weddings Meetings Celebrations Corporate Events Production & Filming Offers Calendar Reservations Off Canvas Toggle Reservations Careers Careers 2024-07-15T17:49:12-04:00 Biltmore Hotel Careers At the Biltmore Hotel in Miami, we refer to our team members as Storytellers. We seek storytellers who are passionate about The Biltmore and our guests to create unique and memorable experiences. Storytellers who build relationships with our guests and each other. A storyteller is someone who takes personal ownership in producing a high quality and detailed experience for the guest and their fellow storytellers. Storytellers take pride in achieving their personal best. A career at The Biltmore is one you can be proud of. Our storytellers are recognized in the industry for their outstanding contributions to hospitality. Apply Now Diverse and Inclusive Workplace Environment We encourage everyone to be charming, stylish, unique, and iconic, but most of all, be yourself. Open Positions Whether you are just beginning your hospitality career or seeking an opportunity to advance and grow. The Biltmore Hotel in Coral Gables/ Miami has the following opportunities available for you. Apply Now Benefits We offer attractive compensation and benefits packages to our storytellers at The Biltmore Coral Gables Miami. Full-time storytellers are eligible* for: Competitive Compensation Medical, Dental, & Vision Insurance Paid Time Off Health & Wellness Programs Storyteller Discounts for Golf, Spa, Dining, Fitness and Retail Complimentary Parking and Shift Meal 401(k) Plans Recognition Awards and Events Discounts on Local Entertainment and Services Career Advancement Training and Opportunities *Eligibility requirements may apply Contact Us The Biltmore Human Resources team is available to answer any questions related to employment and recruitment opportunities. Contact Us Sign Up for Our Newsletter Sign Up Contact Us 1200 ANASTASIA AVENUE, CORAL GABLES, FL. 33134 1 855 311 6903 80 °F 1200 ANASTASIA AVENUE CORAL GABLES, FL. 33134 1 855 311 6903 Helpful Links Press Careers Contact Us Gift Cards FAQ GableStage Theatre Company Donation Requests BILTMORE HOTEL © Privacy Policy Website Accessibility Sitemap Page load link Accommodations Rooms Suites Presidentials Amenities Dining Fontana Restaurant Cascade Fairways Sunday Brunch Brandi’s The Biltmore Bar In-Room Dining Afternoon Tea Posto DOLCE Wellness Spa Salon Fitness Tennis Pool The Club Juice Bar Golf Golf Overview Course Information Golf Membership Course Policies Jim McLean Golf School Announcements Events Weddings Meetings Celebrations Corporate Events Production & Filming Offers Calendar Reservations The Biltmore Centennial About Us Gallery Membership Shops FAQ Contact Us 305 445 1926 80 °F Go to Top"
    },
    {
      "url": "https://biltmorehotel.com/contact-miami-resort/",
      "text": "Contact Us - The Biltmore Hotel Skip to content Go to... The Biltmore Centennial About Us Gallery Membership Shops FAQ Contact Us 305 445 1926 79 °F Accommodations Rooms Suites Presidentials Amenities Dining Fontana Restaurant Cascade Fairways Sunday Brunch Brandi’s The Biltmore Bar In-Room Dining Afternoon Tea Posto DOLCE Wellness Spa Salon Fitness Tennis Pool The Club Juice Bar Golf Golf Overview Course Information Golf Membership Course Policies Jim McLean Golf School Announcements Events Weddings Meetings Celebrations Corporate Events Production & Filming Offers Calendar Reservations Go to... Accommodations Rooms Suites Presidentials Amenities Dining Fontana Restaurant Cascade Fairways Sunday Brunch Brandi’s The Biltmore Bar In-Room Dining Afternoon Tea Posto DOLCE Wellness Spa Salon Fitness Tennis Pool The Club Juice Bar Golf Golf Overview Course Information Golf Membership Course Policies Jim McLean Golf School Announcements Events Weddings Meetings Celebrations Corporate Events Production & Filming Offers Calendar Reservations Off Canvas Toggle Reservations Contact Us Contact Us 2024-07-15T14:14:03-04:00 We Want to Hear From You Please use the dropdown menu in the Reason For Contacting Us field in order to expedite reaching the proper department \" * \" indicates required fields Name * First Last Email * Phone Reason for contacting us: * Business Meeting Wedding Special Event Press Other Message * The Biltmore Hotel Miami-Coral Gables 1200 Anastasia Avenue Coral Gables,FL 33134 United States of America Social Media, Press & Media Inquiries PR@biltmorehotel.com General Inquiries General@biltmorehotel.com Sign Up for Our Newsletter Sign Up Contact Us 1200 ANASTASIA AVENUE, CORAL GABLES, FL. 33134 1 855 311 6903 79 °F 1200 ANASTASIA AVENUE CORAL GABLES, FL. 33134 1 855 311 6903 Helpful Links Press Careers Contact Us Gift Cards FAQ GableStage Theatre Company Donation Requests BILTMORE HOTEL © Privacy Policy Website Accessibility Sitemap Page load link Accommodations Rooms Suites Presidentials Amenities Dining Fontana Restaurant Cascade Fairways Sunday Brunch Brandi’s The Biltmore Bar In-Room Dining Afternoon Tea Posto DOLCE Wellness Spa Salon Fitness Tennis Pool The Club Juice Bar Golf Golf Overview Course Information Golf Membership Course Policies Jim McLean Golf School Announcements Events Weddings Meetings Celebrations Corporate Events Production & Filming Offers Calendar Reservations The Biltmore Centennial About Us Gallery Membership Shops FAQ Contact Us 305 445 1926 79 °F Go to Top"
    }
  ]
}