{
  "fuentes": [
    {
      "url": "https://discussions.probrewer.com/forum/help-wanted-for-hire-brewery-jobs-brewery-work/help-wanted/brewer-assistant-brewer/18669-experienced-head-brewer-brewmaster-wanted-miami-fl",
      "email": "info@biscaynebaybrewing.com"
    },
    {
      "url": "https://thevendry.com/venue/272066/biscayne-bay-brewing-company-miami-fl",
      "email": "info@biscaynebaybrewing.com"
    },
    {
      "url": "https://www.miamidda.com/venue/biscayne-bay-brewing-company/",
      "email": "info@miamidda.com"
    }
  ],
  "mails": [
    "info@biscaynebaybrewing.com",
    "info@miamidda.com"
  ],
  "nombre_sitio": "biscaynebaybrewing.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://discussions.probrewer.com/forum/help-wanted-for-hire-brewery-jobs-brewery-work/help-wanted/brewer-assistant-brewer/18669-experienced-head-brewer-brewmaster-wanted-miami-fl",
      "text": "Experienced Head Brewer/Brewmaster Wanted - Miami, FL - \r\n\t\t\r\n\t\tProBrewer Discussion Board Login or Sign Up Logging in... Important - ProBrewer is moving to a single sign-on - [ Learn More ] Clicking login or register below will redirect you to ProBrewer.com to start your login there. You will be returned to the Discussions once you are logged in. Login or Register Log in with News and Expert Topics Events Classified Ads Jobs Discussions Tools Allied Trade Directory ProBrewerGPT Search What's New in Discussions Newest Discussion Topics Newest Job Posts Newest For Hire ads What's New in Discussions Newest Discussion Topics Newest Job Posts Newest For Hire Discussion Help Wanted / For Hire - Brewery jobs, brewery work Help Wanted Brewer/Assistant Brewer If this is your first visit, be sure to check out the FAQ . You will need to register before you can post. To start viewing messages, select the forum that you want to visit from the selection below. Announcement Collapse Jobs Migration done Update to the new ProBrewer Jobs system is complete -- find your next job at https://probrewer.com/jobs See more See less Experienced Head Brewer/Brewmaster Wanted - Miami, FL Collapse X Collapse Posts Latest Activity Photos Search Page of 1 Filter Time All Time Today Last Week Last Month Show All Discussions only Photos only Videos only Links only Polls only Events only Filtered by: Clear All new posts Previous template Next biscaynebay Registered User Join Date: Jul 2012 Posts: 1 Share Tweet #1 Experienced Head Brewer/Brewmaster Wanted - Miami, FL 03-06-2013, 11:08 AM Biscayne Bay Brewing Company, a brewery located in Miami, Florida is looking for a Brewmaster.  This is an exciting opportunity to be a leading brewer in a young and growing market.  With just one production brewery and two brewpubs in greater Miami, BBBC will provide a much needed local product of the highest quality to meet the expanding thirst of craft beer drinkers seeking local product. The ideal candidate will possess: •\tMinimum of three (3) years of experience in a Commercial Production Brewery or High Volume Brew Pub. •\tMinimum of an Associate’s Degree in a related technical field or a High School Diploma with three (3) years manufacturing experience in a brewery environment. •\tMust have strong communication skills with good team dynamics and possess strong planning and organizational skills. •\tMust have strong analytical and problem solving skills. •\tMust have knowledge of recipe development. •\tMust have a solid understanding of all aspects of brewing, cellaring, yeast handling, CIP and sanitizing. •\tMust have a strong mechanical background with the ability to troubleshoot and resolve mechanical problems. •\tMust have the ability to execute brewery preventative maintenance (PM) program. •\tShould have prior packaging, bottling and racking experience. •\tShould have a good understanding of Laboratory Operations /Quality Assurance /Quality Control, with a basic knowledge of chemistry and biology. •\tShould have a strong work ethic and the ability to multitask. •\tShould have self-motivation and the ability to work alone, as well as the ability to work efficiently as part of a team. •\tMust be computer literate in spreadsheets and Microsoft Office. Job duties and responsibilities include: •\tOversee Final Equipment Installation •\tBrew and oversee the brewing and packaging operations •\tRecipe development •\tProduction scheduling •\tSupervise lab work •\tMaintain all brewing equipment including CIP and SIP •\tManaging Assistant/Apprentice Brewers •\tInventory management •\tExpansion plan development and implementation •\tEducate tasting room staff on production and beer styles Brewery Details •\tJV Northwest 3 vessel 15 barrel brewhouse. •\tAnnual expected production 2500 bbls. •\tTasting Room •\t15,000 Sq.Ft. facility We are offering a competitive compensation package to match experience and education level.  Benefits package includes Relocation, Health Insurance, Paid Vacation/Holidays and a bonus structure that will keep the team motivated and share in the success of the brewery. Please contact at info@biscaynebaybrewing.com Tags: brewery set up , brewmaster , brewmaster job , head brewer , head brewer job Previous template Next ProBrewer.com Help Contact Us Privacy Terms of Service Archive Go to top © ProBrewer / Real Beer Media, Inc. Powered by vBulletin® Version 5.7.5 Copyright © 2025 MH Sub I, LLC dba vBulletin. All rights reserved. All times are GMT-7. This page was generated at 09:19 PM. Working... Yes No OK OK Cancel X We process personal data about users of our site, through the use of cookies and other technologies, to deliver our services, personalize advertising, and to analyze site activity. We may share certain information about our users with our advertising and analytics partners. For additional details, refer to our Privacy Policy . By clicking \" I AGREE \" below, you agree to our Privacy Policy and our personal data processing and cookie practices as described therein. You also acknowledge that this forum may be hosted outside your country and you consent to the collection, storage, and processing of your data in the country where this forum is hosted. I Agree"
    },
    {
      "url": "https://thevendry.com/venue/272066/biscayne-bay-brewing-company-miami-fl",
      "text": "Biscayne Bay Brewing Company - Brewery / Distillery in Miami, FL | The Vendry by by Search Inspiration Circles Log In Sign Up by The community and marketplace for event pros. Join Us List My Business The Vendry Organizations The Memo About the Vendry Contact Us Groupize Keep me posted with industry news, cool case studies, and events. Your email address Subscribe © 2025 THE VENDRY LLC. Privacy Terms & Conditions Terms of Use Overview Spaces Press Nearby Hotels Biscayne Bay Brewing Company Brewery / Distillery 100 NE 1st Ave, Miami, FL 33132, USA Cbd Biscayne Bay Brewing Company 100 NE 1st Ave, Miami, FL 33132, USA Cbd Request Pricing # of Spaces 1 Space Biscayne Bay Brewing is a locally owned, independent brewery located in downtown Miami. We offer a variety of craft beers, including Regatta Double IPA, Tropical Bay IPA, Marlins Lager, Pass Time Pilsner, Miami Pale Ale, and La Colada Porter. As the Official Craft Beer of the Miami Marlins and the Official Independent Brewery of the Miami HEAT, we are proud to bring our thoughtfully crafted Miami-made beer to sports fans. Visit our taproom in the heart of Downtown Miami to enjoy our quality craft beer in a quality crafted space. Show more Request Pricing 100 Northeast 1st Avenue, Miami, FL Show on the map Spaces Full Buyout of Biscayne Bay Brewing Company Full Buyout of Biscayne Bay Brewing Company Press Thrillist Your All-Season Guide to Cheering On the Miami Marlins at loanDepot Park Mar 27, 2024 Secret Miami 13 Touchdown-Worthy Spots To Watch The Miami Dolphins Play Sep 28, 2023 Miami New Times March 2023 Miami Restaurant Openings and Closings Apr 4, 2023 Thrillist Your All-Season Guide to Cheering On the Miami Marlins at loanDepot Park Mar 27, 2024 Secret Miami 13 Touchdown-Worthy Spots To Watch The Miami Dolphins Play Sep 28, 2023 Miami New Times March 2023 Miami Restaurant Openings and Closings Apr 4, 2023 Do you work for Biscayne Bay Brewing Company ? Contact us to learn more about who's managing this profile or gain access. Other Venues in Miami for Your Event Miami Event Spaces Miami Performance Spaces Miami Hotels Miami Restaurants Miami Convention Centers Miami Boats / Yachts Miami Museums / Galleries Miami Stadiums Miami Movie Theaters Miami Bars / Clubs Miami Private Clubs Miami Breweries / Distilleries Miami Coworking Spaces Miami Banquet Halls Miami Aquariums / Zoos Miami Cultural Centers Miami Corporate Offices Miami Private Group Activites Miami Historic Buildings Miami Photo Studios Miami Public Spaces Miami Event Spaces Miami Performance Spaces Miami Hotels Miami Restaurants Miami Convention Centers Miami Boats / Yachts Miami Museums / Galleries Miami Stadiums Miami Movie Theaters Miami Bars / Clubs Miami Private Clubs Miami Breweries / Distilleries Miami Coworking Spaces Miami Banquet Halls Miami Aquariums / Zoos Miami Cultural Centers Miami Corporate Offices Miami Private Group Activites Miami Historic Buildings Miami Photo Studios Miami Public Spaces"
    },
    {
      "url": "https://www.miamidda.com/venue/biscayne-bay-brewing-company/",
      "text": "Economic Development Miami Economic Development Miami For the latest local updates on COVID-19, please click here Media and Press Center Public Meetings Translate Reset to default language... Afrikaans Albanian Amharic Arabic Armenian Azerbaijani Basque Belarusian Bengali Bosnian Bulgarian Catalan Cebuano Chichewa Chinese (Simplified) Chinese (Traditional) Corsican Croatian Czech Danish Dutch Esperanto Estonian Filipino Finnish French Frisian Galician Georgian German Greek Gujarati Haitian Creole Hausa Hawaiian Hebrew Hindi Hmong Hungarian Icelandic Igbo Indonesian Irish Italian Japanese Javanese Kannada Kazakh Khmer Korean Kurdish (Kurmanji) Kyrgyz Lao Latin Latvian Lithuanian Luxembourgish Macedonian Malagasy Malay Malayalam Maltese Maori Marathi Mongolian Myanmar (Burmese) Nepali Norwegian Pashto Persian Polish Portuguese Punjabi Romanian Russian Samoan Scots Gaelic Serbian Sesotho Shona Sindhi Sinhala Slovak Slovenian Somali Spanish Sundanese Swahili Swedish Tajik Tamil Telugu Thai Turkish Ukrainian Urdu Uzbek Vietnamese Welsh Xhosa Yiddish Yoruba Zulu Social Instagram Twitter YouTube Facebook LinkedIn Email Search Focus Areas Economic Development Enhanced Services Urban Planning Marketing & Communications Research & Reports Community Resources Explore Downtown Attractions Dine Shop Stay Downtown Nightlife Getting to and Around Downtown About Us Welcome to Downtown Miami DDA Budget DDA Procurement DDA District Maps DDA Board DDA Staff Contact Us Event Calendar Living Living Downtown Mia Doing Business Doing Business Downtown Mia Exploring Exploring Downtown Mia Epicenter of the Americas Discover the Possibilities Latest Events Click here to apply to this free training Built In Miami Program 2025: A free training program designed for tech startups, digital products, or innovative local businesses More... Download English Press Release FC Barcelona to move its commercial operations to Downtown Miami Download Spanish Press Release Click here for grant information Miami DDA offers Incentive Grants for New, Expanding, or Relocating Businesses More... Click here to view document Facts About the Miami Downtown Development Authority (Miami DDA) More... Download the 3D Map Miami DDA Unveils Interactive 3D Development Map Detailing Rapid Growth of Downtown Miami 3D Map Visual Demo Click here for route and hours Freebee Downtown Circulator More... Living in Downtown Miami Truly electrifying and uniquely refreshing, Downtown Miami is a special place to call home. With extensive and diverse living options, including more than 100 residential buildings, you’ll find something for everyone here – from the young professional to the growing family unit. When it comes to activities, there’s an equal wealth of choices waiting outside your door. Let us help you learn more about living in our ever-evolving, always-intriguing home. Whether you are a current resident or are looking to become one, we want to help you En Vogue with everything that is happening from the arts and food scenes to the ins outs of major projects transforming Downtown Miami. Doing Business in Downtown Miami As the Epicenter of the Americas, Downtown Miami connects our businesses and companies to the country – and the world – like no other U.S. city. Much like our vibrant and active residential community, the businesses and companies that call Downtown Miami home choose us to become part of something special and dynamic. We can help you, and your organization find your footing in our thriving city – and learn more about what the future holds in store for us all. Exploring Downtown Miami Life. Work. Adventure. No matter what brings you to Downtown Miami, you’ll never run out of options, ideas, or excursions to enjoy here. Iconic and inventive architecture, happening hotspots, energetic events to tropical escapes, and much more, you can find it all here, with us. We’re here to help you see and do everything you desire in Downtown Miami – and maybe even discover something you didn’t know you were looking for. Small Business & Loan Assistance Getting Around Town Community Resources Dine Incentives Small Business Assistance Business Minute Small Business Solutions Community Resources Places to Stay Getting Around Town Dine Message to DWNTWNRs For Information On Miami DDA's Annual Report for FY 2023-2024 including Projects and Initiatives Click Here What is the Miami Downtown Development Authority? The Miami Downtown Development Authority (Miami DDA) is an independent agency of the City of Miami funded by a special tax levy on properties within its district boundaries. The agency is governed by a 15-member board of directors, including three public appointees and 12 downtown property owners, business owners, and/or residents. The board sets policy direction, which is implemented by a multi-disciplinary team under the executive director's oversight. Our mission is to grow, strengthen, and promote the economic health and vitality of Downtown Miami. As an autonomous agency of the City, the Miami DDA advocates, facilitates, plans, and executes business development, planning, capital improvements, and marketing and communication strategies. We commit to fulfill our mission collaboratively, ethically, and professionally, consistent with the Authority's public purpose. 1967 We were established 15 Member board 2 Square miles @joiseyshowaa · Twilight Miami Skyline · CC BY-SA 2.0 Latest News Florida Trend (online) | Miami Economic Outlook 3.5.25 Read More World Redeye (online) – Unveiling Miami DDAs Interactive 3D Development Map at Frost Planetarium 3.6.25 Read More Floridian Development (online) | Miamis Downtown Development Authority Reveals an Interactive 3D Mapping Tool for Miami Skyscraper D 3.14.25 Read More View All News Upcoming Events Miami DDA Board of Directors Meeting 9.19.25 MIAMI DDA BOARD OF DIRECTORS MEETING The September meeting of the Miami DDA Board of Directors will be held at the Miami DDA Offices and will be open... See Details Miami DDA Board of Directors Meeting 10.17.25 MIAMI DDA BOARD OF DIRECTORS MEETING The October meeting of the Miami DDA Board of Directors will be held at the Miami DDA Offices and will be open to... See Details View All Events Proudly Serving Downtown Miami: The Arts & Entertainment District, Miami CBD, and Brickell. Contact us today to learn more about our great districts. Arts & Entertainment Central Business District Brickell Contact us today to learn more about our great districts. Under Florida law, e-mail addresses and contact information are public records. If you do not want your information released in response to a public records request, do not submit your information to this entity. Instead, contact the Miami Downtown Development Authority (DDA) by phone or in writing. Arts & Entertainment Central Business District Brickell @downtownmia Miami DDA Marketing & Events Business Support + Economic Development Enhanced Services Urban Planning – Hidden Data + Research Research & Reports – unpublished Maps Community Grants Explore Downtown Things to Do Dining Nightlife Hotels Shopping Getting Around Calendars Public Meetings Media Center Newsletters Video Spotlights Press Downloadable Images Miami DDA Logos Get Downtown Updates Subscribe Under Florida law, e-mail addresses and contact information are public records. If you do not want your information released in response to a public records request, do not submit your information to this entity. Instead, contact the Miami Downtown Development Authority (DDA) by phone or in writing. Made with by Pacific54 © 2019 Miami Downtown Development Authority ADA Compliance Annual Report Focus Areas Economic Development Enhanced Services Urban Planning Marketing & Communications Research & Reports Community Resources Explore Downtown Attractions Dine Shop Stay Downtown Nightlife Getting to and Around Downtown About Us Welcome to Downtown Miami DDA Budget DDA Procurement DDA District Maps DDA Board DDA Staff Contact Us Event Calendar Phone: +1 ( 305 ) 579-6675 200 S Biscayne Blvd #2929 Miami, FL 33131 We are using cookies to give you the best experience on our website. You can find out more about which cookies we are using or switch them off in settings . Accept Close GDPR Cookie Settings Privacy Overview Strictly Necessary Cookies Powered by GDPR Cookie Compliance Privacy Overview This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping our team to understand which sections of the website you find most interesting and useful. Strictly Necessary Cookies Strictly Necessary Cookie should be enabled at all times so that we can save your preferences for cookie settings. Enable or Disable Cookies Enabled Disabled Enable All Save Settings"
    }
  ]
}