{
  "fuentes": [
    {
      "url": "https://www.pnj.com/story/entertainment/dining/2023/03/29/milton-blackwater-bistro-gets-menu-upgrade-under-new-chef-culinary-director/70051545007/",
      "email": "tgiberson@pnj.com"
    },
    {
      "url": "http://blackwatersecurity.net/Main/ContactUs",
      "email": "info@black-water.co.uk"
    },
    {
      "url": "http://blackwatersecurity.net/Main/ContactUs",
      "email": "info@international-intelligence.co.uk"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "email": "info@scibpaints.com"
    },
    {
      "url": "https://www.giftly.com/gift-card/blackwater-bistro-milton",
      "email": "corporate@giftly.com"
    },
    {
      "url": "https://www.giftly.com/gift-card/blackwater-bistro-milton",
      "email": "merchants@giftly.com"
    },
    {
      "url": "https://www.bistrolive.com/contact-us/",
      "email": "sarahh@bistrolive.com"
    },
    {
      "url": "https://www.bistrolive.com/contact-us/",
      "email": "elliec@bistrolive.com"
    },
    {
      "url": "https://www.bistrolive.com/contact-us/",
      "email": "info@bistrolive.com"
    },
    {
      "url": "https://www.bistrolive.com/contact-us/",
      "email": "kellye@bistrolive.com"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "https://www.bistrolive.com/helpful-info/join-our-team/",
      "email": "info@bistrolive.com"
    },
    {
      "url": "https://blackwaterrising.org/about-us/",
      "email": "info@blackwaterrising.org"
    },
    {
      "url": "https://www.blackwateretf.com/contact-us/",
      "email": "enquiries@blackwateretf.com"
    },
    {
      "url": "https://blackwaterdistillery.ie/about/who-we-are/",
      "email": "caroline@blackwaterdistillery.ie"
    },
    {
      "url": "https://blackwaterdistillery.ie/about/who-we-are/",
      "email": "dan@blackwaterdistillery.ie"
    },
    {
      "url": "https://blackwaterdistillery.ie/about/who-we-are/",
      "email": "john@blackwaterdistillery.ie"
    },
    {
      "url": "https://blackwaterdistillery.ie/about/who-we-are/",
      "email": "leslie@blackwaterdistillery.ie"
    },
    {
      "url": "https://blackwaterdistillery.ie/about/who-we-are/",
      "email": "peter@blackwaterdistillery.ie"
    }
  ],
  "mails": [
    "caroline@blackwaterdistillery.ie",
    "corporate@giftly.com",
    "dan@blackwaterdistillery.ie",
    "elliec@bistrolive.com",
    "enquiries@blackwateretf.com",
    "info@bistrolive.com",
    "info@black-water.co.uk",
    "info@blackwaterrising.org",
    "info@international-intelligence.co.uk",
    "info@reception-plus.de",
    "info@scibpaints.com",
    "john@blackwaterdistillery.ie",
    "kellye@bistrolive.com",
    "leslie@blackwaterdistillery.ie",
    "merchants@giftly.com",
    "peter@blackwaterdistillery.ie",
    "sarahh@bistrolive.com",
    "tgiberson@pnj.com"
  ],
  "nombre_sitio": "blackwater-bistro.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.pnj.com/story/entertainment/dining/2023/03/29/milton-blackwater-bistro-gets-menu-upgrade-under-new-chef-culinary-director/70051545007/",
      "text": "Milton’s Blackwater Bistro gets menu upgrade under new chef, director News Sports Play Opinion Advertise Obituaries eNewspaper Legals DINING Milton's Blackwater Bistro is changing, but owners say it is for the best Brittany Misencik Pensacola News Journal Milton’s Blackwater Bistro is filled to the brim with history. The restaurant, a former family residence from the early 1900s, has been transformed into one of Milton’s go-to spots for elevated dining in the area. While the restaurant embraces preserving its history — original flooring, walls and windows still intact — it is seeing a modern twist with the addition of Jason Brewer as the new culinary director of operations. Brewer made a name for himself at Pace’s Bar515 Cocktails & Tapas where he shined in creating playful tapas and uniquely composed entrees. Under Brewer’s leadership, Bar515 earned the best restaurant award in the Pace/Miton area in the 2022 Best of the Bay awards. Brewer himself won the Best Chef category for 2022. Brewer's experience as a professional chef goes back over 25 years. He has gained experience from different cities and chefs, such as world-renowned celebrity chef Emeril Lagasse at Delmonico Steakhouse, that he has brought with him to Pensacola. The current Blackwater menu is built on country classics, like the hearty Mom’s Meatloaf, Chicken Pot Pie loaded with country veggies and a deep-dish Marie’s Lasagna. But Brewer plans to add more modernized, elevated options to the menu to keep even the regular customers on their toes. Looking for a free mini puzzle? Play the USA TODAY Quick Cross now. Blackwater Bistro owners Paul and Pam Kilmartin are excited to see the restaurant evolving as Milton does, “finally becoming a destination we always thought it would be.” “We are thrilled to have Jason be part of the Bistro family,” the Kilmartins wrote in a statement. “His reputation and experience speaks for itself. Jason’s reputation and expertise will take the Bistro from a good restaurant — to a great restaurant.” Brewer said he has big plans for Blackwater Bistro’s future. “Basically, what I’m coming in to do is enhancing — doing everything I possibly can to work with the team to enhance people’s dining experience,” Brewer said. “I feel like the restaurant is doing amazing and has a lot of hidden potential that we haven’t cracked into yet. … The staff, the owners, the management — everybody here has just been open arms welcoming to me.” More on Brewer's time at Bar515 Bar515 Cocktails & Tapas creates social hangout in Pace, with the help of a local pro chef Looking for Milton eats? Best Milton restaurants: Nine restaurants that do Southern cooking (and more) right What changes are coming for Blackwater Bistro? Brewer will be starting off slowly with introducing weekend dinner specials before he touches the permanent menu. Over the next few months he will sift through the menu’s best hits to see what should stay or go. He has a loyal crew ready to learn, some who have been with the restaurant since its conception, who can help execute dishes the restaurant has not seen before. For his first dinner feature that debuted last week, he worked with his staff on a pan-seared triggerfish with smoked green tomato gazpacho, roasted fingerling potatoes and a cilantro and lime crema. This week, he has a braised lamb shank with sun-dried tomato feta polenta in the works. “With the equipment and everything we have here, I have the opportunity to do a lot crazier kind of specials and dinner features that can really showcase the abilities of the staff here and try to bring in more of a clientele,” Brewer said. Not only does he plan to enhance the menu’s complexity, but also to incorporate more local ingredients into the dishes. His long-term goal is to create a menu that changes every season with rotating items. He would also like to increase the variety of fresh fish and specialty meats. “I was talking to staff the other day, it’s like, ‘We’ve all been out to dinner, we’ve all heard the same song and dance for years and years and years. How can you make yourself stick out? How can you make us stick out giving just a little bit more touch that they can’t get anywhere else?’” Brewer said. Brewer said he also plans to take some of the house cocktails to the next level to make Blackwater Bistro a place to enjoy a craft cocktail in the city. He said the current menu has a variety of popular drinks, but he would like to add some special touches, like muddled fruits and smoked glasses. “The craft cocktail, speakeasy style bar is what is popular right now, and it’s not going anywhere,” Brewer said. “The bar staff here is very, very good and they’re very knowledgeable.” Even as the menu gets some upgrades, he plans to hold onto the same comfortable atmosphere that makes it a favorite spot for family friendly get-togethers, friend celebrations or date nights. “I want to be able to do that style of food, but then I want people to come in and not have that uptight fine-dining atmosphere,” Brewer said. “If you come in here in a pair of shorts and a tank top, or you come in here in a suit — you’re going to get treated the same and you’re going to enjoy your food.\" Follow the Blackwater Bistro Facebook page for further updates and information. About Us Staff Directory Corrections Careers Accessibility Support Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Businesses Advertise Your Business Buy and Sell Licensing & Reprints Help Center Subscriber Guide Manage Account Give Feedback Subscribe Today Newsletters Mobile Apps Facebook X eNewspaper Archives Jobs Real Estate Classifieds Education Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.pnj.com. All rights reserved."
    },
    {
      "url": "http://blackwatersecurity.net/Main/ContactUs",
      "text": "Black Water Security Home About Us About Us Management Team Counter Espionage Counter Espionage TSCM Sweeps A guide to TSCM Sweeps A guide to Listening Devices Purchasing TSCM equipment Computer Forensics Intelligence Security Risk Assessments Data Breach Investigations Competitive Intelligence Corporate Investigations Due Diligence Surveillance Services Litigation Support Private Investigations Command & Control Info Case Studies Travel Advisories Media Library Courses & Lectures Contact Contact us “Contact Black Water Security!” London Office Black Water Security 88 Kingsway London WC2B 6AA United Kingdom Telephone: +44 207 7911627 Email: info@international-intelligence.co.uk Head Office Black Water Security The Leas, Eastington Gloucestershire GL10 3SQ United Kingdom Telephone: +44 1453 791444 Email: info@international-intelligence.co.uk Washington DC Office Black Water Security 20 F St, 7th Floor Capitol Hill Washington DC 20001 United States of America Telephone: +1 202 507 6269 Email: info@international-intelligence.co.uk Black Water Security 88 Kingsway, London WC2B 6AA United Kingdom Contact Telephone: +44 207 7911627 Email: info@black-water.co.uk Legal Info Privacy Policy Cookie Policy Copyright & Trademark Connect with us Follow Us © Black Water Security . All Rights Reserved. 2025 Designed by HTML Codex"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "text": "Contact Us: Get In Touch With Asian Paints for your Painting Needs Contact Us: We’d Love To Hear From You 16815 Popular searches Interior Paints Exterior Paints Shade cards SEARCH RESULTS {{searchItem.map.shadeCode}} {{searchItem.map.shadeFamilyName}}: {{searchItem.map.shadeName}} {{searchItem.map.title}} RELATED SEARCH NO MATCHES FOUND! Did you mean? {{spellCheck}} Log-In Hello! Hello! Signout en ar {{minicart.cartcount > 0 ? minicart.cartcount : 0}} ↻ Processing... You have {{minicart.cartcount}} items {{item[\"product\"][\"name\"]}} - + ₹ {{item[\"totalPrice\"][\"value\"]}} Total ₹ {{minicart.totalprice}} Checkout ↻ Menu PAINTS & COLOUR PAINTS & COLOUR Services Services WATERPROOFING WATERPROOFING INSPIRATION INSPIRATION Login/Register PAINTS & COLOUR All PAINTS & COLOUR EXPLORE COLOURS Colour Catalogue Home Colour Guide PAINT PRODUCTS Interior Paints Exterior Paints Waterproofing Wood Paints Metal Paints Undercoats RESOURCES Paint Budget Calculator Ideas Gallery Colour visualizer SERVICES Paint Store Near Me Book Painting Services Services All Services Beautiful Homes Painting Service Scib Stars WATERPROOFING All WATERPROOFING Bathrooms Terrace and Tanks Roof & Basement Interiors Tiling All Products INSPIRATION All INSPIRATION Get Inspired Paint calculator Gallery Colour Next Guides DecorPro Resources Colour Visualizer Ideas Gallery Please enter your mobile number To receive the dealer details on SMS Mobile * SUBMIT Get in Touch We’d love to hear from you Head Office Scib Chemical S.A.E 6th of October Cirt, 4th Industrial (1/3/B)B Tel:            (+202)38281090-99 Fax: (+202)38331271 Scib Paints Helpline* For enquiries, feedback and complaints please call on 16815 or write to us at info@scibpaints.com Mobile number +91 00:59 ↻ ↻ Need help with your painting needs? Fill the form below to book a free site evaluation by a Scib Paints Beautiful Homes Painting Service expert. Name Mobile Number +20 Governorate * Email By proceeding, you are authorizing Scib Paints and its suggested contractors to get in touch with you through calls, sms, or e-mail. Book an appointment ↻ Thank you! We value your interest in Scib Paints Beautiful Homes Service. We will get in touch with you shortly to schedule a visit by an expert. Try again! Oops! Something went wrong. We couldn't process your request. Please try again? Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Our Divisions More about Asian Paints Congratulations You have subscribed. Contact Us 16815 EMAIL ABOUT Research & Technology Careers Contact Us Certificates RESOURCES FAQs POLICIES Quality Policy Customer Policy Cookie Policy Environment Policy EHS Policy TOOLS Colour Catalogue Color with AP APP/Website​ COUNTRY EGYPT Country EGYPT India GLOBAL BANGLADESH MIDDLE EAST FIJI NEPAL SRI LANKA ETHIOPIA CONNECT DOWNLOAD OUR PAINTING APP CONNECT WITH US ©Scib Paints - All rights reserved Congratulations You have subscribed. Welcome User Login OR Continue as guest You have been successfully logged out Login An OTP has been sent to your registered mobile number and email id. 00:00 Resend By clicking submit, I agree to terms and conditions SUBMIT Register Please enter the 5 digit OTP sent via SMS to verify your mobile number! 00:00 Resend I agree to terms and conditions SUBMIT Please enter your mobile number To receive the dealer details on SMS SUBMIT Provide a delivary address Fullname* Email* Mobile* +91 Flat/House No/Floor* Colony/Street/Locality* Landmark City* Pincode* SUBMIT User already exist redirecting you for the login page Paint Budget Calculator Get instant estimates Calculate now Waterproofing Calculator Get an instant estimate Calculate now"
    },
    {
      "url": "https://www.giftly.com/gift-card/blackwater-bistro-milton",
      "text": "Blackwater Bistro Gift & Greeting Cards - Email, Text or Print - 5147 Elmira St, Milton, FL Restaurants Travel Spa & Beauty Activities Shopping Universal Brands Top Cities Multi-Place Corporate Restaurants Travel Spa & Beauty Activities Shopping Universal Brands Top Cities Multi-Place Corporate Gifts Gift Cards Milton Restaurants Blackwater Bistro Blackwater Bistro Gift Card Blackwater Bistro Giftly A beautiful gift card alternative for Blackwater Bistro Blackwater Bistro 100% satisfaction guarantee Gift Amount $25 $50 $75 $100 $250 $500 $1000 Other Gift Design Continue 100% satisfaction guarantee Enter an amount between $5 and $1,000 Confirm Amount Blackwater Bistro (428) (850) 623-1105 Categories Breakfast & Brunch, Sandwiches, Coffee & Tea Location 5147 Elmira St, Milton, FL Gift Tips Try the brunch menu and don't miss the biscuits and gravy, a customer favorite. Order the Italian Pizza for a filling and flavorful lunch option, perfect for sharing. Sample the sweet potato waffle fries, which are highly recommended as a must-try side dish. Enjoy the live music on Fridays and Saturdays, adding to the vibrant atmosphere of the bistro. Ask for Madison as your server for attentive and friendly service, as she is frequently praised by guests. Click here to send a gift up to $1,000 with the suggestion to use it at Blackwater Bistro. Is this your business? Claim your business to update business information, customize this listing, and more! Learn more about Blackwater Bistro Price $$ Ambience Casual Hours Tuesday-Thursday: 11AM-9PM Friday-Saturday: 11AM-10PM Sunday: 9AM-2PM Blackwater Bistro is a charming restaurant located in downtown Milton, Florida. This local eatery is well-loved for its warm atmosphere and delicious menu offerings, making it a favorite among residents and visitors alike. Ambiance : Casual dining with outdoor seating options that create a welcoming environment. Cuisine : Features a diverse menu including breakfast, sandwiches, pizzas, and southern-inspired dishes. Highlights : Known for its friendly service with standout staff members, and a lively atmosphere with live music on weekends. With a focus on fresh ingredients and a varied menu, diners can enjoy anything from hearty brunch options to flavorful lunch sandwiches. The restaurant also takes pride in its service, with staff often going the extra mile to ensure a pleasant dining experience. Whether stopping in for a casual meal or a special occasion, Blackwater Bistro guarantees satisfaction for all who visit. Customer Reviews Kayanna P. 08/05/2025 First timers, Place was great, server Madison Took great care of us and was very attentive! Will be back! read review Katie B. 08/19/2025 This is my second time here...I'm not local but have enjoyed this place both times I've come! The service was great- Natalie was an awesome server... she... read review Carolyn S. 07/03/2025 One of my besties and I had lunch here. She ordered the artichoke cheesecake for our appetizer. Amazing, delicious, decadent, etc., I could keep on going.... read review Great Alternatives Buy a Gift & Greeting Card for Masons : Masons is a charming and welcoming restaurant nestled in the heart of Milton, serving up delectable cuisine that delights the taste buds and leaves a lasting impression. Gift $100 for Cisco's : Cisco's in Milton is a charming family-owned restaurant that delights diners with its delectable menu and warm, welcoming ambiance. Updated: September 09, 2025 The Giftly Advantage With Giftly you strike a perfect balance, the thoughtfulness of a Blackwater Bistro gift card with the flexibility of money. Easy to buy online. Have it delivered now or later Send it with a personalized greeting card 3 easy ways for your recipient to redeem the gift See a Sample Gift 100% satisfaction guaranteed No wasted balance Easy to customize How it works You customize a gift Gift up to $1,000 with the suggestion to use it at Blackwater Bistro. Delivered in a personalized greeting card. They receive the gift Gifts can be sent by email, SMS*, mail or you can print it yourself. They enjoy it! They redeem the gift on our website and choose to deposit the funds in their bank account, Paypal account or to have a Visa Gift Card mailed to them. They can spend the money at Blackwater Bistro or anywhere else they like! Top Related Gifts Dharma Blue Fresh Flavors in a Historic Setting 300 S Alcaniz St, Pensacola, FL 4.0 (277) • $$ • Sushi Bars Mimmo's Ristorante Italiano Taste of Sicily in Destin 979 Us Hwy 98 E, Destin, FL 4.3 (1.2k) • $$ • Italian Bozos Too Fresh seafood, casual vibes. 1815 11th St, Pascagoula, MS 4.1 (195) • $$ • Seafood El Paisita Authentic Mexican Restaurant Savor the Taste of Mexico 3800 S Hickory Ln, Loxley, AL 4.0 (99) • $ • Mexican Jim 'N Nick's Bar-B-Q Authentic Southern BBQ fixes Brand 10k+ reviews • Barbeque IT'SUGAR Sweeten your day Brand 2.4k reviews • Candy Stores Dodge's Southern Style Southern comfort food delight Brand 492 reviews • Convenience Stores Char Restaurant Steakhouse indulgence awaits Brand 1.4k reviews • Steakhouses Mama Lattes Sip, Savor, Smile at Mama Lattes 5412 Stewart St, Milton, FL 4.4 (72) • $ • Coffee & Tea The Prost Office A Toast to Community and Flavor 6821 Caroline St, Milton, FL 3.7 (6) • Chicken Wings McKinely's Sandwich Shop Crafted Comfort in Every Bite 5262 Stewart St, Milton, FL 4.3 (79) • $$ • Sandwiches Boomerang Pizza Kitchen Retro Vibes, New York Slices 5227 Willing St, Milton, FL 4.1 (242) • $$ • Pizza More Nearby Businesses David's Catfish House 5129 Dogwood Dr, Milton, FL 3.6 (123) • $$ • Seafood Doc's Liquors 5198 Willing St, Milton, FL 4.5 (8) • $$ • Beer, Wine & Spirits Rollo's Seafood 6462 Caroline St, Milton, FL 4.5 (31) • $$ • Seafood Markets El Paso Mexican Grill 5041 Dogwood Dr, Milton, FL 3.5 (119) • Mexican Nim's Garden 6536 US- 90, Milton, FL 3.0 (35) • $ • Chinese Texan B's BBQ 5139 Elmira St, Milton, FL 3.9 (8) • Food Trucks Eats 5722 Stewart St, Milton, FL 5.0 (2) • Food Trucks Milton Quality Bakery 6727 Caroline St, Milton, FL 4.5 (201) • $ • Bakeries Tom Thumb Food Store 6025 Stewart St, Milton, FL Convenience Stores Scoops Ice Cream and Sweets 5830 Dogwood Dr, Milton, FL 4.7 (16) • Ice Cream & Frozen Yogurt Kobi Hibachi and Sushi 5828 Dogwood Dr, Milton, FL 3.8 (14) • Sushi Bars An An Food Truck Milton, FL 4.3 (7) • Asian Fusion Outer Limits Restaurant 5717 Vonnie Branch Rd, Milton, FL 4.8 (6) • Fast Food Waffle House - Milton 2662 Avalon Blvd, Milton, FL 4.3 (20) • $ • Diners The Sweet Greek 6776 Caroline St, Milton, FL 4.4 (25) • Coffee & Tea Bean & Bites Bistro 5722 Stewart St, Milton, FL 5.0 (1) • Bakeries Taco Town 5382 N Stewart St, Milton, FL 3.7 (41) • $ • Mexican Ace's Restaurant 6583 Caroline St, Milton, FL 4.2 (117) • $ • Southern Milton Pic N Sav 5221 Stewart St, Milton, FL 3.3 (9) • $ • Grocery Brown Bagger 6820 Caroline St, Milton, FL 4.5 (13) • Food Trucks Jin Jin Chinese Restaurant 6209 Hwy 90, Milton, FL 2.6 (38) • $ • Chinese Culver's 6389 US Hwy 90, Milton, FL 3.4 (9) • Ice Cream & Frozen Yogurt Corintos TO GO 5173 Stewart St, Milton, FL 5.0 (1) • Soul Food 850 Barbecue 7060 Hwy 90, Milton, FL 4.6 (5) • Food Trucks El Chavo 5161 Dogwood Dr, Milton, FL 3.3 (3) • Tacos Yamato Japanese Steakhouse 6550 Caroline St, Milton, FL 3.4 (24) • Japanese Stella's Place 5717 Vonnie Branch Rd, Milton, FL 4.7 (21) • Barbeque Krisp Kruchy Chicken 8551 Keshav Taylor Dr, Milton, FL 4.2 (5) • Chicken Wings The Greasy Spoon 7413 Uss Enterprise St, Milton, FL 4.0 (9) • $ • American Food Outlet 6516 Caroline St, Milton, FL 3.7 (15) • $$ • Grocery La Hacienda Mexican Restaurant 6471 Caroline St, Milton, FL 3.8 (81) • $ • Mexican Main Moon Restaurant 5444 Dogwood Dr, Milton, FL 3.7 (66) • $ • Chinese Quick Mart Country Cafe 5967 Berryhill Rd, Milton, FL 3.3 (4) • $ • Southern Cejo's Corner 5472 Stewart St, Milton, FL 3.3 (4) • American Quick Food Mart 5967 Berry Hill Rd, Milton, FL 4.0 (2) • $ • Convenience Stores Chef Richards Comfort Foods Milton, FL 4.5 (2) • Food Trucks Tom Thumb Food Stores 5953 Willard Norris Rd, Milton, FL 3.0 (1) • $ • Convenience Stores Holland Farms 2055 Homer Holland Rd, Milton, FL 3.4 (31) • $ • Fruits & Veggies Saucy’s Frozen Treats & Tasty Eats 6509 Caroline St, Milton, FL 3.4 (23) • Ice Cream & Frozen Yogurt Bypass Farmer's Market 5177 Dogwood Dr, Milton, FL 4.4 (21) • $ • Fruits & Veggies Tom Thumb Food Store 5280 Whiting Field Blvd, Milton, FL 3.0 (1) • $ • Convenience Stores Aces Hangar 3966 Avalon Blvd, Milton, FL 4.5 (13) • Bars See More Help If you have questions, need help, or want to modify, resend, or cancel a gift, please see our Support Center , where you can access an array of self-service tools and our FAQ. For other questions or issues, please contact support@giftly.com . Gift Disclosure The Giftly Prepaid Gift is redeemed for money through the Giftly website. It is not issued, endorsed, or accepted by any third-party merchant (including any third-party merchant explicitly referenced in this Giftly Prepaid Gift), and is not covered by the CARD Act. Giftly Prepaid Gifts never expire and there are no inactivity fees. Please see the Giftly Prepaid Gift Agreement for the complete terms. Breakfast & Brunch Sandwiches Coffee & Tea 3.9 >300 3 single place gcdp gift_and_greeting_card_in_title_tag Milton, FL M S Help Help Center How Giftly works FAQ support@giftly.com Corporate Why Giftly Sign Up Log In corporate@giftly.com Merchants Customize listing Remove listing Settlement Notice FAQ merchants@giftly.com About Team Press Blog Legal Terms Privacy Gift Agreement Business categories Restaurants Travel Shopping Activities Spa & Beauty Outdoors Going Out Nationwide Brands All Business Categories Business locations Atlanta Austin Boston Chicago Dallas Denver Detroit Houston Las Vegas Los Angeles Miami Minneapolis New York Oakland Philadelphia Phoenix Portland St. Louis San Diego San Francisco San Jose Seattle Wash, DC Browse All Restaurants Seafood Steakhouses Italian French Asian Fusion Pizza Sushi Burgers Mexican Japanese All Restaurant Types Gift Ideas Multi-Place Gift Ideas The Giftly Prepaid Gift is issued by Sunrise Banks N.A., St. Paul, MN 55103, Member FDIC. * Standard data rates, fees, and charges may apply to send by text. Copyright © 2025 Giftly. All rights reserved."
    },
    {
      "url": "https://www.bistrolive.com/contact-us/",
      "text": "Contact Bistro Live | Get in Touch & Plan Your Event 0116 262 1212 BOOK Menu Whats On Leicester Nottingham Milton Keynes Special Offers Christmas What's On Christmas (current) Hen Parties (current) Birthdays (current) Other Events Great Nights Out NYE Private Parties Our Business Club School Proms Helpful Info FAQ's Latest News Meet the Team What People Say About Us Where we are Join Our Team Food Menus September to November 2025 Christmas Menu 2025 Drinks Menu (current) Contact Us (current) My Account Make a payment BOOK 0116 262 1212 Select an option below to help us direct you to the right person Select an option below to help us direct you to the right person Get In Touch Make An Enquiry Download A Hen Party Brochure Download A Christmas Brochure Download A Birthday Brochure Hire Bistro Live Exclusively Enquire About Business Club Host Your Prom Event Get In Touch Make An Enquiry Download A Hen Party Brochure Download A Christmas Brochure Download A Birthday Brochure Hire Bistro Live Exclusively Enquire About Business Club Host Your Prom Event Need to contact us? We Can Help... Got a question and not got the time to give us a call? Just fill in below and we'll get back to you asap! Title... Mr Mrs Miss Ms Dr Prof Sir Lord Lady Enter your post code and click to find your address Address lookup Or Enter address manually Location... Leicester Nottingham Milton Keynes Date of Birth How did you hear about us? Recommended by a friend Found you on Google Saw a Facebook post Other social media post Received an email Received a text I’ve been to Bistro Live before Other Please wait whilst your request is submitted. Do not click 'Back' By clicking the button above you agree to us contacting you in order to deal with your enquiry. You also agree to receiving information about our nights out. Please note - we will process and use your data in accordance with our Privacy Policy . YES, I’m happy to receive further information NO, I don’t want to receive further information Found the date you're looking for? GREAT - fill in the form below and we will check the availability for you. One of the team will give you a call and let you know if we can fit you in... Title... Mr Mrs Miss Ms Dr Prof Sir Lord Lady Enter your post code and click to find your address Address lookup Or Enter address manually Preferred Party Date Location... Leicester Nottingham Milton Keynes Date of Birth How did you hear about us? Recommended by a friend Found you on Google Saw a Facebook post Other social media post Received an email Received a text I’ve been to Bistro Live before Other Please wait whilst your request is submitted. Do not click 'Back' By clicking the button above you agree to us contacting you in order to deal with your booking enquiry. You also agree to receiving information about our nights out. Please note - we will process and use your data in accordance with our Privacy Policy . YES, I’m happy to receive further information NO, I don’t want to receive further information Request a Hen Brochure To request your copy of our hen brochure with details about the night and our packages please fill in your details below and we'll email it over! Title... Mr Mrs Miss Ms Dr Prof Sir Lord Lady Enter your post code and click to find your address Address lookup Or Enter address manually Likely Date of Hen Night Location... Leicester Nottingham Milton Keynes Date of Birth How did you hear about us? Recommended by a friend Found you on Google Saw a Facebook post Other social media post Received an email Received a text I’ve been to Bistro Live before Other Please wait whilst your request is submitted. Do not click 'Back' By clicking the button above you agree to us contacting you in order to deal with your hen party enquiry. Please note - we will process and use your data in accordance with our Privacy Policy. YES, I’m happy to receive further information NO, I don’t want to receive further information Request a Christmas Brochure To request your copy of our Christmas brochure with details about our nights and our packages, please fill in your details below and we'll email it over! Title... Mr Mrs Miss Ms Dr Prof Sir Lord Lady Enter your post code and click to find your address Address lookup Or Enter address manually Preferred Party Date Location... Leicester Nottingham Milton Keynes Date of Birth How did you hear about us? Recommended by a friend Found you on Google Saw a Facebook post Other social media post Received an email Received a text I’ve been to Bistro Live before Other Please wait whilst your request is submitted. Do not click 'Back' By clicking the button above you agree to us contacting you in order to deal with your Christmas enquiry. Please note - we will process and use your data in accordance with our Privacy Policy. YES, I’m happy to receive further information NO, I don’t want to receive further information Having trouble filling in this form? Click here to email us with your name, email address and contact number and we’ll get in touch! Download a Birthday Brochure To request your copy of our Birthday Brochure, with details about the night and our packages, please fill in your details below and we'll email it over! Title... Mr Mrs Miss Ms Dr Prof Sir Lord Lady Enter your post code and click to find your address Address lookup Or Enter address manually Preferred Party Date Location... Leicester Nottingham Milton Keynes Date of Birth How did you hear about us? Recommended by a friend Found you on Google Saw a Facebook post Other social media post Received an email Received a text I’ve been to Bistro Live before Other Please wait whilst your request is submitted. Do not click 'Back' By clicking the button above you agree to us contacting you in order to deal with your birthday party enquiry. Please note - we will process and use your data in accordance with our Privacy Policy. YES, I’m happy to receive further information NO, I don’t want to receive further information Privately Hire Bistro Live Looking for an impressive venue for your corporate event or private party? Just fill in the form and we will get back to you asap! Title... Mr Mrs Miss Ms Dr Prof Sir Lord Lady Enter your post code and click to find your address Address lookup Or Enter address manually Preferred Party Date Date of Event Location... Leicester Nottingham Milton Keynes Date of Birth How did you hear about us? Recommended by a friend Found you on Google Saw a Facebook post Other social media post Received an email Received a text I’ve been to Bistro Live before Other Please wait whilst your request is submitted. Do not click 'Back' By clicking the button above you agree to us contacting you in order to deal with your private party enquiry. Please note - we will process and use your data in accordance with our Privacy Policy. YES, I’m happy to receive further information NO, I don’t want to receive further information Join us for Business Club Our monthly networking event might be the perfect opportunity for you. Just fill the form in below, add the name of your business and the month you'd like to attend and Sarah will be in contact with you. Please note, the Business Club runs at our Leicester Venue ONLY. Title... Mr Mrs Miss Ms Dr Prof Sir Lord Lady Enter your post code and click to find your address Address lookup Or Enter address manually Location... Leicester Nottingham Milton Keynes Date of Birth How did you hear about us? Recommended by a friend Found you on Google Saw a Facebook post Other social media post Received an email Received a text I’ve been to Bistro Live before Other Please wait whilst your request is submitted. Do not click 'Back' Project Prom at Bistro Live Looking for an impressive venue for your prom event? Just fill in the form and we will get back to you asap! Title... Mr Mrs Miss Ms Dr Prof Sir Lord Lady Enter your post code and click to find your address Address lookup Or Enter address manually Preferred Party Date Date of Event Location... Leicester Nottingham Milton Keynes Date of Birth How did you hear about us? Recommended by a friend Found you on Google Saw a Facebook post Other social media post Received an email Received a text I’ve been to Bistro Live before Other Please wait whilst your request is submitted. Do not click 'Back' YES, I’m happy to receive further information NO, I don’t want to receive further information Quick Links Hen Parties Birthdays Christmas Blog T's & C's Privacy Policy Cookie Policy Bistro Live Ltd, registered in England no. 4106667. Registered office: 89-91 Charles St, Leicester, LE1 1FA × MESSAGE SENT! You've successfully updated your booking CLOSE ITEMS Loading... CLOSE"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. name Datenschutz First First name Surname * E-Mail * Nachricht * Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "https://www.bistrolive.com/helpful-info/join-our-team/",
      "text": "Join the Bistro Live Team | Careers in Events & Hospitality 0116 262 1212 BOOK Menu Whats On Leicester Nottingham Milton Keynes Special Offers Christmas What's On Christmas (current) Hen Parties (current) Birthdays (current) Other Events Great Nights Out NYE Private Parties Our Business Club School Proms Helpful Info FAQ's Latest News Meet the Team What People Say About Us Where we are Join Our Team Food Menus September to November 2025 Christmas Menu 2025 Drinks Menu (current) Contact Us (current) My Account Make a payment BOOK 0116 262 1212 Join the Team at Bistro Live APPLY TO WORK WITH US NOW Are you hard working and willing to learn? Fun and lively with a bubbly personality? A team worker with great attitude? Because that's EXACTLY what we're looking for... But most of all, (whether you work in the kitchen; in the bar; or on the restaurant floor), you understand our customer service philosophy - it's all about our customers! Our focus is to make sure that every customer that comes to Bistro Live has a brilliant and memorable event So, whether you're looking for a part-time job whilst you're at college or university, or you're looking for a career, Bistro Live is a great place to work. WE'RE CURRENTLY LOOKING FOR... Bar Service Staff To prepare a variety of cocktails and drinks for service to customers as part of the Bistro Live experience. We are recruiting for fun, energetic and passionate people to work in our busy bars. Some experience would be helpful but what we really need is someone with a great attitude and a passion for service. We can train you in the technical skills as long as you are willing to put your heart and soul into learning and using them. Party Hosts To help us deliver a brilliant experience on with outstanding customer service to all of our customers for their lunches and evenings We are recruiting for fun, energetic and passionate people with great communication skills to work in our busy live music restaurants. Some experience would be helpful but what we really need is someone with a great attitude and a passion for service. We can train you in the technical skills as long as you are willing to put your heart and soul into learning and using them. ★ Start Date: ASAP ★ Location: Leicester, Nottingham and Milton Keynes ★ Salary / Hours: Competitive, Part time ★ Benefits: Discounted party nights / Performance bonus APPLY TO WORK WITH US NOW Quick Links Hen Parties Birthdays Christmas Blog T's & C's Privacy Policy Cookie Policy Bistro Live Ltd, registered in England no. 4106667. Registered office: 89-91 Charles St, Leicester, LE1 1FA × MESSAGE SENT! You've successfully updated your booking CLOSE ITEMS Loading... CLOSE"
    },
    {
      "url": "https://blackwaterrising.org/about-us/",
      "text": "About Us – Blackwater Rising Skip to content info@blackwaterrising.org Contact Board Log In About Events Volunteer Donate Toggle Search Toggle Mobile Menu Growing Food, Growing Community Blackwater Rising brings people together to grow fresh, nutritious food and share it with neighbors who need it most. Through community gardens across Cambridge, MD, we’re helping our town eat well—and having fun along the way. From the soil up, our work is about more than food—it’s about connection, care, and community. Our mission is inspired by the long-standing spirit of determination that defines Cambridge. Rooted in resilience, we honor the legacy of local changemakers by growing something new: stronger relationships, greater food access, and a healthier, more joyful place to call home. 🙌  All Hands Welcome Whether you’re a Master Gardener, an artist, a neighbor with a shovel, or someone who just likes to weed, there’s a place for you here. Our team is made up of volunteers, donors, and partners who believe in building something better—together. We’re cultivating trust, resilience, and joy—right here in our own backyard. Volunteer 🌿 Dig Into Our Feed Follow us on Facebook to see what’s growing and get the latest updates from the garden. Visit Facebook © 2025 Blackwater Rising. All rights reserved. Legal / Privacy About Events Volunteer Donate Name (Required) Email Address (Required)"
    },
    {
      "url": "https://www.blackwateretf.com/contact-us/",
      "text": "Contact - BLACKWATER Navigation SALARY SURVEY – RESULTS OUR SERVICES RECRUITMENT CONSULTING BRAND BUILDING INSIGHTS GET THE NEWSLETTER PAST NEWSLETTERS & ARTICLES VIDEOS & PODCASTS REPORTS LEARNING & DEVELOPMENT ETF TRAINING HUB ETFCAREER.COM MOOLAH INVEST ABOUT ABOUT US BLACKWATER IN THE MEDIA CONTACT US SALARY SURVEY – RESULTS OUR SERVICES RECRUITMENT CONSULTING BRAND BUILDING INSIGHTS GET THE NEWSLETTER PAST NEWSLETTERS & ARTICLES VIDEOS & PODCASTS REPORTS LEARNING & DEVELOPMENT ETF TRAINING HUB ETFCAREER.COM MOOLAH INVEST ABOUT ABOUT US BLACKWATER IN THE MEDIA CONTACT US CONTACT US LET'S MAKE THIS HAPPEN CONTACT US FILL OUT THE FORM BELOW AND WE'LL BE IN TOUCH Contact Us FIRST NAME * LAST NAME * COMPANY * EMAIL * SUBJECT * MESSAGE * SUBMIT If you are human, leave this field blank. We use cookies on our website to give you the most relevant experience by remembering your preferences and repeat visits. By clicking “Accept All”, you consent to the use of ALL the cookies. However, you may visit \"Cookie Settings\" to provide a controlled consent. Cookie Settings Accept All Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website, anonymously. Cookie Duration Description cookielawinfo-checkbox-analytics 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\". cookielawinfo-checkbox-functional 11 months The cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Functional\". cookielawinfo-checkbox-necessary 11 months This cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\". cookielawinfo-checkbox-others 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other. cookielawinfo-checkbox-performance 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Performance\". viewed_cookie_policy 11 months The cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Functional Functional Functional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features. Performance Performance Performance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. Advertisement Advertisement Advertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads. Others Others Other uncategorized cookies are those that are being analyzed and have not been classified into a category as yet. SAVE & ACCEPT DOWNLOAD REPORT 2022 - Direct Indexing - Chapter 1 2021 European Fund Managers Survey First Name * Surname * Company * Email * I have read and agree to the Privacy Policy * I agree Submit If you are human, leave this field blank. × DOWNLOAD REPORT 2021 European Fund Managers Survey 2021 European Fund Managers Survey First Name * Surname * Company * Email * I have read and agree to the Privacy Policy * I agree Submit If you are human, leave this field blank. × DOWNLOAD REPORT 2022 - The changing landscape of ETF Distribution The changing landscape of ETF Distribution First Name * Surname * Company * Email * I have read and agree to the Privacy Policy * I agree Submit If you are human, leave this field blank. × DOWNLOAD REPORT 2022 - The Transatlantic Divide in ETF Distribution Practices The Transatlantic Divide in ETF Distribution Practices First Name * Surname * Company * Email * I have read and agree to the Privacy Policy * I agree Submit If you are human, leave this field blank. × DOWNLOAD REPORT 2022 ETF and Digital Assets Outlook 2022 ETF and Digital Assets Outlook First Name * Surname * Company * Email * I have read and agree to the Privacy Policy * I agree Submit If you are human, leave this field blank. × DOWNLOAD REPORT 2022 - The Global Crypto ETP Ecosystem Explained The Global Crypto ETP Ecosystem Explained First Name * Surname * Company * Email * I have read and agree to the Privacy Policy * I agree Submit If you are human, leave this field blank. × DOWNLOAD REPORT 2022 - Digital Asset Salary Survey 2022 Global ETF and Digital Assets Salary Survey First Name * Surname * Company * Email * I have read and agree to the Privacy Policy * I agree Submit If you are human, leave this field blank. × our Services Insights About Learning & Development our Services Insights About Learning & Development Contact Us ©Blackwater 2024 Legal Privacy Statement Terms of Use Quick links ETF Consulting ETF Recruitment ETF PR and Content Creation News & Insights Newsletter Media & Press releases Get in touch Contact us 71-75 Shelton Street London WC2H 9JQ e: enquiries@blackwateretf.com"
    },
    {
      "url": "https://blackwaterdistillery.ie/about/who-we-are/",
      "text": "Who We Are | Blackwater Distillery Skip to content Enjoy FREE SHIPPING with all orders over €60  *Ireland only. Blackwater Distillery Shop Gift Sets Gin Whiskey Vodka All Products Visit Us Our Spirits Gin Vodka Irish Whisky Cocktails Podcast About Who We Are Our Location A Little History Blog Shop Now Who We Are Home / About / Who We Are We Are A Micro-Distillery Based In West Waterford On The Banks Of The Blackwater River We like to keep it real, which is why early in the morning we switch on the lights, open the post and fire up the still. In our 1950s coverted hardware store in Ballyduff, we make award-winning gin and small batch Irish whisky. Our Team Peter Mulryan Founder & CEO View Profile × Peter Mulryan Founder & CEO In the days before Blackwater Distillery, Peter traveled the world as a TV producer and in his spare time wrote several books about whiskey. Now he runs a distillery, his goal is to produce excellent spirits and bring transparency and honesty to the category. When he’s not working he’s either eating, sleeping or playing the mandolin. peter@blackwaterdistillery.ie Close Caroline Senior Founder & COO View Profile × Caroline Senior Founder & COO Caroline Senior brings years of organisational expertise to the Blackwater team. In her time as Artistic Director at Garter Lane Arts Centre in Waterford, she was responsible for the complete refurbishment of the theatre, and produced and toured several theatre productions with Waterford playwright, Jim Nolan. She brought these skills to the refurbishment of the distillery’s new home and visitor’s centre in 2017-18, transforming a former 1950s hardware store in the heart of Ballyduff Upper. A former member of the Arts Council and a classically trained musician, Caroline plays piano and cello, and is relishing the prospect of her greatest challenge to date – the formation of the Blackwater Distillery Band. caroline@blackwaterdistillery.ie Close John Wilcox Head Distiller View Profile × John Wilcox Head Distiller John jumped across the pond in late 2018 to join the Blackwater team. With over a decade working in the craft spirits sector in the US, he brings to Blackwater a diverse portfolio of experience and ideas. He specialises in mixed grain whisky, and is particularly excited about the continued evolution of the whisky category in Ireland. John is proud to call Ireland home, and considers it an honour to be part of the movement to revive heritage Irish whisky styles. In his free time, John battles demons with his fiddle, explores forgotten ruins, and, time permitting, slays dragons. John’s Life Goals, 2020, Lockdown Edition Go to the pub Yell at mountains with Bjork Secure world peace by making the best whisky possible john@blackwaterdistillery.ie Close Dan Grummell Brand Manager View Profile × Dan Grummell Brand Manager A proud Kerry man by way of London, Dan joined Blackwater in 2018 as our Brand Manager after working for nearly a decade in FMCG marketing teams. As Dan said, working at Blackwater Distillery is much more than a job, it’s a lifestyle of working with real friends who want to put this distillery on the global map and most importantly have some fun along the way. A massive lover of sports and most recently photography, he can also be found most weekends coaching his son’s soccer team to let off some steam! Looking after our marketing and local sales, Dan is the man and can be contacted on dan@blackwaterdistillery.ie or +353 85 256 1967 dan@blackwaterdistillery.ie Close Leslie Fitzell Non-Executive Director View Profile × Leslie Fitzell Non-Executive Director Joining the Blackwater Team in 2019, Leslie is Non Executive Director and provides strategic advice to the board and management team. He brings a breadth and depth of experience across  food and drink, having worked in a range of international strategy,  marketing and commercial  roles in companies including Unilever, Bass, United Distillers and over 20 years at Seagram/Pernod Ricard. Leslie left Chivas Brothers, Pernod Ricard’s largest global brand company  in 2018 where he was Board director with responsibilities for Strategy & Development covering the scotch and gin portfolio. Today, Leslie lives outside London and specialises in supporting and helping develop a range of startups and early stage disruptor food and drinks companies to achieve their ambitions. leslie@blackwaterdistillery.ie Close Barry Donnellan Director View Profile × Barry Donnellan Director Over 25 years working in the television industry as a cameraman, Barry has been lucky to have travelled the world doing what he’s loved since the age of 16. It’s this job and the inclement Irish weather that he has to thank for his involvement in Blackwater Distillery. It all started on a wet stormy Kerry beach in 2014, when then-RTE producer Peter Mulryan told of his plans to open a distillery. Barry jumped at the chance of this new adventure and joined him as one of the co-founders and directors in the company. As a committed vodka drinker he has been dragged kicking and screaming along with the gin revolution and he’s learned to love the smell of juniper….well, most of the time! They say that ‘it never rains but it pours’ but sometimes, just sometimes, it is worth standing in the rain and getting a little wet…you never know what might happen! barry@blackwaterdistillery.ie Close Quick Links Home Story Gin Whisky Vodka Visit Us Blog Contact Shop Sitemap Contact Blackwater Distillery Ballyduff Upper Co Waterford P51 C5C 6 Ireland Tel: +353 (0) 58 60732 Email: hello@blackwaterdistillery.ie Follow Us Check out our social media. We're on facebook, twitter, instagram, youtube. Cookie Policy | Privacy Policy | Delivery & Returns Directors: Barry Donnellan, Leslie Fitzell, Peter Mulryan, Caroline Senior, Michael Boehler VAT No: 3280655WH | Bus Reg No: 543070 Website Design & Development by Passion for Creative, Waterford, Dublin BOOK NOW BOOK NOW"
    }
  ]
}