{
  "fuentes": [
    {
      "url": "https://www.corkchamber.ie/about-us/who-we-are/",
      "email": "imelda@corkchamber.ie"
    },
    {
      "url": "https://www.corkchamber.ie/about-us/who-we-are/",
      "email": "lhurley@corkchamber.ie"
    },
    {
      "url": "https://www.corkchamber.ie/about-us/who-we-are/",
      "email": "accounts@corkchamber.ie"
    },
    {
      "url": "https://www.corkchamber.ie/about-us/who-we-are/",
      "email": "alicia@corkchamber.ie"
    },
    {
      "url": "https://www.corkchamber.ie/about-us/who-we-are/",
      "email": "amoriarty@corkchamber.ie"
    },
    {
      "url": "https://www.corkchamber.ie/about-us/who-we-are/",
      "email": "annette@corkchamber.ie"
    },
    {
      "url": "https://www.corkchamber.ie/about-us/who-we-are/",
      "email": "annie@corkchamber.ie"
    },
    {
      "url": "https://www.corkchamber.ie/about-us/who-we-are/",
      "email": "bo@corkchamber.ie"
    },
    {
      "url": "https://www.corkchamber.ie/about-us/who-we-are/",
      "email": "cathal@corkchamber.ie"
    },
    {
      "url": "https://www.corkchamber.ie/about-us/who-we-are/",
      "email": "fionaodonovan@corkchamber.ie"
    },
    {
      "url": "https://www.corkchamber.ie/about-us/who-we-are/",
      "email": "garrett@corkchamber.ie"
    },
    {
      "url": "https://www.corkchamber.ie/about-us/who-we-are/",
      "email": "grace@corkchamber.ie"
    },
    {
      "url": "https://www.corkchamber.ie/about-us/who-we-are/",
      "email": "juliet@corkchamber.ie"
    },
    {
      "url": "https://www.corkchamber.ie/about-us/who-we-are/",
      "email": "kate@corkchamber.ie"
    },
    {
      "url": "https://www.corkchamber.ie/about-us/who-we-are/",
      "email": "kevin@corkchamber.ie"
    },
    {
      "url": "https://www.corkchamber.ie/about-us/who-we-are/",
      "email": "lhurley@corkchamber.ie"
    },
    {
      "url": "https://www.corkchamber.ie/about-us/who-we-are/",
      "email": "lisa@corkchamber.ie"
    },
    {
      "url": "https://www.corkchamber.ie/about-us/who-we-are/",
      "email": "naoimh@corkchamber.ie"
    },
    {
      "url": "https://www.corkchamber.ie/about-us/who-we-are/",
      "email": "vicky@corkchamber.ie"
    },
    {
      "url": "https://portugalcork.com.au/pages/contact-us",
      "email": "info@yourstore.com"
    },
    {
      "url": "https://portugalcork.com.au/pages/contact-us",
      "email": "sales@portugalcork.com.au"
    },
    {
      "url": "https://portugalcork.com.au/pages/contact-us",
      "email": "sales@yourstore.com"
    },
    {
      "url": "https://corksncrafts.com/about-us/",
      "email": "info@corksncrafts.com"
    },
    {
      "url": "https://corksncrafts.com/about-us/",
      "email": "events@corksncrafts.com"
    },
    {
      "url": "https://corksncrafts.com/about-us/",
      "email": "info@corksncrafts.com"
    },
    {
      "url": "https://cianoart.com/contact-ciano-art/",
      "email": "info@cianoart.com"
    },
    {
      "url": "https://blockdesign.co.uk/pages/contact-us",
      "email": "alienor@goodgoodgoods.fr"
    },
    {
      "url": "https://blockdesign.co.uk/pages/contact-us",
      "email": "mark@wallisandcompany.com"
    },
    {
      "url": "https://blockdesign.co.uk/pages/contact-us",
      "email": "sales@blockdesign.co.uk"
    },
    {
      "url": "https://fintech.com/blog/drinking-buddies-block-15-brewing-company",
      "email": "sales@fintech.com"
    },
    {
      "url": "https://fintech.com/blog/drinking-buddies-block-15-brewing-company",
      "email": "activation@fintech.com"
    },
    {
      "url": "https://fintech.com/blog/drinking-buddies-block-15-brewing-company",
      "email": "info@fintech.com"
    },
    {
      "url": "https://fintech.com/blog/drinking-buddies-block-15-brewing-company",
      "email": "sales@fintech.com"
    },
    {
      "url": "https://craftdesignconstruction.co.uk/contact-us/",
      "email": "richard@craftdesignconstruction.co.uk"
    }
  ],
  "mails": [
    "accounts@corkchamber.ie",
    "activation@fintech.com",
    "alicia@corkchamber.ie",
    "alienor@goodgoodgoods.fr",
    "amoriarty@corkchamber.ie",
    "annette@corkchamber.ie",
    "annie@corkchamber.ie",
    "bo@corkchamber.ie",
    "cathal@corkchamber.ie",
    "events@corksncrafts.com",
    "fionaodonovan@corkchamber.ie",
    "garrett@corkchamber.ie",
    "grace@corkchamber.ie",
    "imelda@corkchamber.ie",
    "info@cianoart.com",
    "info@corksncrafts.com",
    "info@fintech.com",
    "info@yourstore.com",
    "juliet@corkchamber.ie",
    "kate@corkchamber.ie",
    "kevin@corkchamber.ie",
    "lhurley@corkchamber.ie",
    "lisa@corkchamber.ie",
    "mark@wallisandcompany.com",
    "naoimh@corkchamber.ie",
    "richard@craftdesignconstruction.co.uk",
    "sales@blockdesign.co.uk",
    "sales@fintech.com",
    "sales@portugalcork.com.au",
    "sales@yourstore.com",
    "vicky@corkchamber.ie"
  ],
  "nombre_sitio": "block15srq.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.corkchamber.ie/about-us/who-we-are/",
      "text": "Who we are - Cork Chamber Skip to content Member Directory About Us News Contact Search Member Login Member Directory About Us News Contact Search Member Login Menu Close Membership Open menu Membership Benefits Testimonials Partner Programme Member Activity Member Directory Promotional opportunities Chamber Ambassadors Expert HR Advice and Supports Events Open menu Events Overview Upcoming Events Cork Digital Marketing Awards Gallery Training & Development Open menu Upcoming Courses Training & Development Supports International Services Open menu International Services Overview Connecting Cork Enterprise Europe Network REEValue Export Documentation Post Brexit Advice International Connections Public Affairs Open menu Public Affairs Overview Advocacy Our Focus Advocacy Our Mandate Sustainability Open menu Sustainability Overview Sustainable Cork Programme Sustainable Cork Programme Webinar Series Environment Social Workability Cork Governance Become a member About Us News Contact Member Directory About Us News Contact Search Member Login Become a member Home About Us Who we are Who we are Our exemplary board, led by President Rob Horgan, sets out a vision and strategy for our Chamber of Commerce, designed to support our members’ growth and to enhance our city region. Our dedicated and highly skilled team of professionals deliver across all our business functions ensuring our members have the opportunity to grow and excel through our services. Meet the Team Conor Healy Chief Executive Contact Details Conor Healy Chief Executive The Chief Executive is responsible for the operational activities of the Chamber, working with the President, the Board of Directors and Committee Chairpersons in developing the overall strategic plan of the Chamber and coordinating its implementation. Annie FitzGibbon Director of Member Services Contact Details Annie FitzGibbon Director of Member Services (021) 4530145 annie@corkchamber.ie Annie is responsible for the Membership Team, focusing on both recruitment and retention, with a strong focus on engagement to ensure all members are maximising value from their membership Naoimh Frawley Director of People, Operations & Governance Contact Details Naoimh Frawley Director of People, Operations & Governance (021) 4530131 naoimh@corkchamber.ie Naoimh manages the day to day operations within Cork Chamber. She is responsible for the development and implementation of policies and procedures to promote continuous improvement. Naoimh is champion of our extensive employee wellbeing programme,oversees the chambers internal sustainability agenda, is health & safety officer and is Cork Chambers Data Leader. Cathal McSweeney Director of Public and International Affairs Contact Details Cathal McSweeney Director of Public and International Affairs (021) 4530137 cathal@corkchamber.ie Cathal is the Director of Public and International Affairs, with responsibility for lobbying and advocacy activities of Cork Chamber. He focuses on representing the interests of the Cork businesses through engagement with the members, stakeholders, local politicians and elected representatives. Cathal works to ensure that the interests of the Cork region remain on the national agenda. Bo Browne Communications & Marketing Manager Contact Details Bo Browne Communications & Marketing Manager (021) 4530146 bo@corkchamber.ie Bo manages the communications and marketing for Cork Chamber. A communications conduit between Chamber activities, our valued members and external media, Bo channels our news through digital and traditional platforms while nurturing a consistent and authentic brand profile for Cork Chamber. Lisa Dennehy Events Manager Contact Details Lisa Dennehy Events Manager (021) 4530149 lisa@corkchamber.ie Lisa works as Events Manager as part of the Events team and is responsible for the creation, organization and administration of the extensive calendar of events throughout the year. Creating opportunities and facilitating the sharing of experiences by connecting our members. Tim Garde Business & Development  Manager Contact Details Tim Garde Business & Development  Manager Ruby Hardie-Brown Office Assistant Contact Details Ruby Hardie-Brown Office Assistant Ruby is responsible for performing office duties such as helping organise and maintaining office common areas, greeting clients at reception, updating private contact address books and recording export documentation for Chamber records. Ruby also supports the Chamber team with work related errands and diverse tasks. Juliet Haykal Operations Executive Contact Details Juliet Haykal Operations Executive juliet@corkchamber.ie Juliet is the Operations Executive, bringing over 10 years of diverse experience in visual and graphic arts, international relations, and operations. She has worked with NGOs, embassies, and marketing companies across the Middle East, Latin America, and Europe. Holding an MA in International Relations from UCC, Juliet works closely with the Chamber team, providing executive-level support to operations. Carmel Holland Finance Manager/Company Secretary Contact Details Carmel Holland Finance Manager/Company Secretary (021) 4530134 accounts@corkchamber.ie Carmel responsibilities as finance manager include overseeing end-to-end finance operations of the Chamber, financial planning and analysis.  She is responsible for all accounting functions and is the point of contact for all finance-related matters.  As Company Secretary Carmel ensures compliance with all obligations under company law and contributes to the promotion of good governance at the Chamber. Lisa Hurley PA & Operations Support Contact Details Lisa Hurley PA & Operations Support Lhurley@corkchamber.ie Lisa is the primary telephone and reception contact within Cork Chamber along with providing general office administration support to the team. Lisa provides a high-level customer service to members, non-members and stakeholders of Cork Chamber. Grace Kelleher International Manager Contact Details Grace Kelleher International Manager (021) 4509044 grace@corkchamber.ie Grace is the International Manager at Cork Chamber. Grace is responsible for leading and delivering Cork Chamber’s international stakeholder engagement in addition to overseeing key projects: Connecting Cork, Enterprise Europe Network (EEN), REEValue and leading the Cork Financial Services Forum activities. Grace joined Cork Chamber as the EEN Executive in 2022. Alicia Mateos-Cárdenas REEValue & Sustainability Lead Contact Details Alicia Mateos-Cárdenas REEValue & Sustainability Lead (021) 4530139 alicia@corkchamber.ie Alicia leads the Energy Efficiency and Renewable Energy in the Value Chain REEValue project, funded by the European Commission. Her role encompasses project management, business engagement, and oversight of the online REEValue platform. Additionally, she serves as a central, cross-functional lead for all Chamber sustainability activities, collaborating closely with the senior management team and the Sustainability Committee. Alicia holds a PhD in Environmental Science and brings substantial expertise in engaging with national and international high-level environmental policymakers, along with a proven track record in impactful media communications. Imelda Mulcahy Export Documentation Manager Contact Details Imelda Mulcahy Export Documentation Manager (021) 4530130 Imelda@corkchamber.ie Imelda is the Export Documentation Manager with responsibility for all export services at Cork Chamber. This includes Certificates of Origin, Notarisation and Legalisation of documentation required for exporting. Imelda is also responsible for meeting the Chambers statutory obligations to Chambers Ireland as an authorised Chamber of the issuance of Certificates of Origin. With over 20 years’ experience Imelda has vast knowledge of the export documentation process and is always ready to assist member companies with their documentation requirements. Kate Murray Training & Development Executive Contact Details Kate Murray Training & Development Executive 087 3753014 kate@corkchamber.ie Kate is a member of the Cork Chamber Skillnet team; as part of the team, Kate supports trainees and companies in reaching their training needs. This includes scheduling courses, conducting training needs assessments, sourcing quality trainers and providing quality assurance. Aoife Moriarty Public Affairs & Communications Executive Contact Details Aoife Moriarty Public Affairs & Communications Executive amoriarty@corkchamber.ie Public Affairs & Communications Executive Vicky O’ Connor Events & Marketing Executive Contact Details Vicky O’ Connor Events & Marketing Executive 087 7646282 vicky@corkchamber.ie Vicky works as Events Executive as part of the Events team and supports the Events Manager with the creation, organisation and administration of the extensive calendar of events throughout the year. Creating opportunities and facilitating the sharing of experiences by connecting our members. Fiona O Donovan Public Affairs & Communications Manager Contact Details Fiona O Donovan Public Affairs & Communications Manager fionaodonovan@corkchamber.ie Fiona supports and drives Cork Chamber’s policy and advocacy efforts, representing member interests to government, stakeholders, and the media. As well as monitoring policy developments, Fiona is responsible for shaping strategic responses and building strong relationships across the public and private sectors. Fiona plays a key role in ensuring that Cork Chamber is a proactive and influential voice on key business and economic issues. Annette O’Keeffe Membership Executive Contact Details Annette O’Keeffe Membership Executive (021) 4530136 annette@corkchamber.ie Annette works as a Membership Executive as part of the membership services team. Annette is responsible for the implementation of membership processes, acting as the first point of contact for enquiries to effectively communicate the Chamber offering and encourage membership engagement. Kevin O’Neill Policy & Research Executive Contact Details Kevin O’Neill Policy & Research Executive kevin@corkchamber.ie Kevin is the Cork Development Forum (CDF) Policy & Research Executive. He advocates on behalf of the CDF for the sustainable development of the Cork region, assisting the CDF in guiding government policy through political and stakeholder engagement, and policy research and formulation. Garrett O’Rourke Training & Development Manager Contact Details Garrett O’Rourke Training & Development Manager (086) 7777737 garrett@corkchamber.ie Garrett manages the day-to-day training operations and strategic direction of the network. Cork Chamber Skillnet is a multi-sector learning network for companies of all sizes in the South West region. Cork Chamber Skillnet facilitate funded enterprise led, bespoke training courses, personal & professional development programmes, seminar, and workshops. Monica Valdes EEN Advisor Contact Details Monica Valdes EEN Advisor Monica brings significant expertise in EU-funded projects and experience assisting SMEs with inquiries and opportunities. She holds an MSc in International Public Policy and Diplomacy from University College Cork (UCC). Through the EEN, Monica will be working with SMEs in the region in helping them to innovate and grow on an international scale. She will combine international business expertise with her local knowledge to offer personalised services and opportunities to businesses. Meet the Board Rob Horgan President Read More Rob Horgan President Rob Horgan is the President of Cork Chamber and the owner of the multi-award-winning Velo Coffee Roasters, which was listed in the Sunday Business Post’s ‘EI Top 100 to Follow’. Velo Coffee Roasters supplies award-winning, locally roasted coffee to international retail and food service. Having graduated from the Royal Agricultural College in 1996, Rob has worked in many facets of the food industry both in the UK and Ireland. Susie Horgan Vice President Read More Susie Horgan Vice President Susie Horgan founded Springboard Communications in 2011, and has developed the business into a multi-award winning communications agency from Cork. She has worked for over 20 years in senior communications roles advising many household names. Susie is a graduate of UCC and UCD and was named Network Cork Businesswoman of the Year 2017. She is a Non-Executive Director of UCC Academy and on the Board of Governors at Fota Wildlife Park. She set up the CUH Charity Ball, which has raised significant funds for the Cork University Hospital. Susie also sat on the voluntary steering committee for the Chamber 200 commemorations. David Swinburne Honorary Secretary Read More David Swinburne Honorary Secretary David is a Chartered Accountant and Advisory Partner at Forvis Mazars in Ireland with over 20 years of professional services experience in business advisory, turnaround and restructuring, corporate finance, transaction services and forensic accounting. He holds a B. Comm from NUI Galway and master’s in accounting from UCD. He is also a member of the Review Committee of the Legal Services Regulatory Authority (“LSRA”) and Evaluation Committee of LEO South Cork. Michael Nolan Honorary Treasurer Read More Michael Nolan Honorary Treasurer Michael is a Partner in Grant Thornton and is the Partner-in-charge of the Cork office. Grant Thornton is Ireland’s fastest growing professional services firm. With over 1,450 people in 7 offices across the Ireland, the firm deliver solutions to all business challenges. It’s Cork office now employs over 120 people and has played a significant part in the firm’s overall growth. Michael leads the local Audit and Advisory service lines working with domestic, international and financial services clients on a wide variety of engagements. He is a fellow of the Chartered Accountants Ireland and a graduate of University College Cork. Gillian Bergin Dell Technologies Read More Gillian Bergin Dell Technologies Senior Consultant at Dell Technologies in Global Business Transformation, specialising in Change Management and Change Leadership. Gillian’s passion is the intersection of people, process, technology and culture, leading teams and organisations through disruptive change. Putting people at the heart of how we work, enabling us to simplify complexity, work smarter and lead better in dynamic work environments. 30 years in the Technology industry, Gillian has held both technical and non-technical roles, people-management and individual contributor roles and operates at a global level. She recently completed her term as Chair of it@cork and was instrumental in the MOU bringing it@cork and KerrySciTech together under the umbrella brand of Tech Industry Alliance. She has represented Dell and it@cork on many regional forums and has a strong regional network. She holds a Masters in Data Business, BA in Economics & Computer Science and Higher Diplomas in Accounting & MIS, and Business Innovation and Digital Transformation. She enjoys podcasts, music, reading and writing. Maria Desmond Enable Ireland Read More Maria Desmond Enable Ireland Maria Desmond is Regional Fundraising Manager at Enable Ireland, a national charity which won Cork Chamber Non-Profit of the Year in 2017 and has provided disability services in Cork for over 70 years. Maria holds honours Commerce and Masters Degrees and has a background in marketing and market research. She won a Network Cork Businesswoman of the Year Award in 2018. Having grown up in a local family business, she is passionate about all things Cork. Michael Harte Dairygold Co-Operative Society Limited Read More Michael Harte Dairygold Co-Operative Society Limited Michael, a Chartered Management Accountant, is Chief Financial Officer of Dairygold since 2006 and has worked for Dairygold for over 30 years. Dairygold is one of Ireland’s largest Dairy Co-Operatives, with its headquarters located in Mitchelstown, County Cork, generating over €1 Billion in turnover per annum. Michael, as part of the senior leadership team and together with the Board, is responsible for driving the strategic direction of the busines as well as ensuring the appropriate reporting, policies, procedures and controls are in place to drive the financial performance and protect the financial integrity of the business. Michael’s business and financial acumen has been developed over 30 years, through the various financial roles he has held across Dairygold’s wide range of businesses, together with his continued professional development. Fiona Kearney The Glucksmann UCC Read More Fiona Kearney The Glucksmann UCC Fiona Kearney is the founding Director of the Glucksman, an award-winning contemporary art museum on the campus of University College Cork. In this position, she has curated numerous exhibitions of Irish and international art and established the gallery as a place of creative engagement for all ages and abilities. A graduate of UCC and TCD, Kearney has published widely on contemporary art and photography, and throughout her career has received several distinguished awards including the NUI Prix d’Honneur from the French Government, a UCC President’s Award for Research on Innovative Forms of Teaching and the Jerome Hynes Fellowship on the Clore Leadership Programme. She is an assessor on the Museum Standards Programme of Ireland, and a board member of the Irish Architecture Foundation and Cork Midsummer Festival. Anne – Marie Linehan J.W.O’ Donovan Solicitors Read More Anne – Marie Linehan J.W.O’ Donovan Solicitors Anne-Marie Linehan is a law graduate of UCC and a partner in J.W.O’ Donovan Solicitors based on the South Mall in Cork city. Anne-Marie’s practice involves advising corporate and private clients in the key practice areas of commercial and residential property, construction, banking and finance. Anne-Marie was initially co-opted onto the Board of Cork Chamber to fill a sectoral gap in legal expertise. Since then, she has fully immersed herself in the role, bringing valuable insights and dedication to the Board’s work. Over the past two years, Anne-Marie has been an active and engaged member of the Cork Chamber Board. Anne-Marie is the current chair of the Governance and Nomination Committee, ensuring fairness and transparency in how the Chamber is run.  She also sits on the Audit and Risk Committee, helping to ensure the Chamber business model is sustainable and able to support the next generation of Cork businesses.  For the past two years, Anne-Marie has also been a judge for the Cork Company of the Year Awards and represented Cork Chamber at meetings with Government Ministers and at the recent tri party meeting with the Dublin & Northern Ireland Chambers A respected figure in the Cork business community for more than 30 years, Anne Marie has supported countless clients and businesses to grow and thrive both in Cork and beyond. If elected, Anne-Marie will continue to bring her business acumen and her real joy in doing business in Cork to enhance her contribution to the Board, the Chamber and, most importantly, to you, Chamber members. Carmel Lonergan Trigon Hotels Read More Carmel Lonergan Trigon Hotels As an accomplished strategic leader in the hospitality industry, she brings a wealth of expertise and a dedication to innovation. With a comprehensive background spanning revenue management, financial forecasting, and operations management, she has refined her skills in driving business success and nurturing avenues for growth. Throughout her career, she has showcased a steadfast commitment to cultivating talent, spearheading continuous improvement endeavours, and championing sustainability in Cork. These principles closely resonate with the values upheld by the Cork Chamber, her insights and ability to collaborate will drive positive change within the Cork community. With her domestic and international experiences Carmel has a robust foundation in strategic leadership and planning. Coupled with her hands-on role as the Director of Group Operations for Trigon Hotels in Cork, she possesses an intimate understanding of the local market dynamics and the myriad of challenges and opportunities confronting businesses in the region. Carmel is passionate about the opportunity to join the Cork Chamber board because she believes that her diverse skillset and sectoral insight can contribute to the board’s strategic vision and decision-making processes. She is committed to supporting the growth and development of businesses in Cork, fostering collaboration, and driving positive economic impact in the region. In essence, she will bring blend of strategic leadership, industry acumen, and a passion for fostering growth and sustainability within Cork. Eager to contribute to the Cork Chamber board, she is poised to play an integral role in shaping the future prosperity of the Cork business community. Jim McGrath AbbVie Cork Read More Jim McGrath AbbVie Cork Jim joined AbbVie Cork in Feb 2015 and is Head of Finance. He spent a secondment in Ludwigshafen Germany as Finance Head in 2018/19.  Prior to joining AbbVie, Jim worked in Operations Finance with Alexion Ireland, and has also previously held several roles of increasing responsibility within the GSK group in Operations and Financial Services. Jim is a qualified Management Accountant (FCMA) and Member of Institute of Directors. He holds a Bachelor of Arts degree and is Lean Six Sigma Black Belt certified. Richard Morrissey Moneycorp Read More Richard Morrissey Moneycorp Richard Morrissey is Head of Corporate Sales at Moneycorp Technologies Limited, a world leading  payments fintech . Richard has worked for over 25 years with various banks, domestic and international in the treasury arena and has held senior business development roles in the US,UK and Ireland. He sits on the Dublin Chapter board and Global Forum of BITA . He was also part of the team that set up the CUH Charity Ball . Originally from North Cork he is a lifelong Cork GAA supporter and holds a BBS degree from DCU. Garrett O’Keeffe Solarwinds Read More Garrett O’Keeffe Solarwinds Garrett O’ Keeffe is currently the Site Leader for Solarwinds, a US Software Multinational, here in Cork. He is also the Vice President of Customer Success globally, and has worked for Solarwinds for 10 years. Solarwinds are based in Citygate and employ 180 people in Cork, and were honoured to win Cork Company Of The Year in 2015, an effort which Garrett spearheaded. Born in Cork,  Garrett has worked in Cork all his life in various roles for companies such as Esat Telecom, BT Ireland and Vodafone. Healso worked for 6 years as an executive coach. He graduated with a BComm from UCC in 1991, and in 2020 completed a Masters in Human Resources (also in UCC). Garrett believes his unique blend of large corporate experience, self-employment and academic insight, makes me a great candidate to join the Chamber board, as he has seen the challenges facing both ends of the business spectrum. Having a multinational member of the board would bring a perspective that is necessary, given the importance of that sector to the business community here in Cork. His relationship with the Chamber goes back to 1998, when Esat Telecom was a sponsor of the Cork Company of The Year Awards. At that time he also sat on the Telecoms Committee. More recently he has been a contributor at the Chamber Leadership Forum, including being a panel member in 2023, where he spoke about the challenges facing businesses due to the housing crisis. Garrett was also asked to represent the Multinational Sector on this topic at a Chamber meeting with the Taoiseach in 2023. On a personal level, Garrett is a keen follower of Cork hurling, was involved for many years with underage hurling in Cloughduv and is a member of Lee Valley Golf Club. Conor O’Toole Clayton Hotel Cork City Read More Conor O’Toole Clayton Hotel Cork City Conor has worked in the hospitality sector for over 30 years in a range of management roles and has been heavily involved in leading and driving company culture through team collaboration.  His proven success with leading teams and collaborating closely with peers has helped fulfil the value of “success is dependent on team collaboration”. In his current role, Conor manages and leads Cork’s largest 4-star Hotel. His strengths are customer focus, with my eye constantly on the changing needs and behavior of our valued customers.  With a long-standing record of initiative, innovation, achievement of outstanding results and the successful management of KPI’s, he has developed and executed strategies which he believes will bring value to this role. He enjoys the challenge of board membership in various aspects of the community and is confident that they will prove beneficial to Cork Chamber of Commerce should he be fortunate enough to be elected. Throughout the course of his career, Conor has honed his business development skills.  He is an astute problem-solver capable of prioritising and managing complex projects with proficiency. He exercises innovation, decision-making and project management in contribution of team efforts and organisational improvements. He is open minded and focused on new developments. He has proven to be effective and motivational with proficiency in critical thinking and collaborative work with others. Conor enjoys brainstorming and coordinating efforts to achieve a common goal. Conor believes he will bring exceptional leadership qualities, excellent communication skills, ambition, results focused mindset, innovation and vision to this role. Catherine Sheridan DNV Read More Catherine Sheridan DNV An energy professional with 20 years utility experience, Catherine’s key focus is to help Ireland, and Europe achieve Net Zero 2050. A Chartered Engineer and Fellow of Engineers Ireland; project manager and communications expert, her experience include site and contract management as well as commercial roles with national utilities. Dr Jean van Sinderen-Law European Relations and Public Affairs, UCC Read More Dr Jean van Sinderen-Law European Relations and Public Affairs, UCC Educated to post-doctorate level as a scientist, Jean is a highly accomplished professional with over 30 years of experience in academia. In her roles at University College Cork, she focuses on establishing and nurturing national and international partnerships to advance UCC’s education, research, and public engagement missions. She has strong advocacy and influencing skills, extending her reach to policymakers and business leaders both nationally and internationally. She and her teams have informed, connected and promoted the university and this region, only one measurable outcome of which has been the generation of in excess of €200M of income for the University. Committed to internationalisation, one notable achievement is her role as the founder and director of the European University Alliance, UNIC, which consists of 10 universities across Europe. Jean has received recognition for her achievements, including being named the “Women Mean Business” Business Woman of the year in Ireland in 2010. Jean aims to leverage her extensive experience and network to benefit the Cork Chamber. She understands the dynamics of effective partnerships between academia and business, emphasizing talent provision and research outcomes. She also plays a crucial role in promoting Cork as a business-friendly destination, working in partnership with organizations like the IDA to attract multinational companies. Jean is committed to influencing policy to drive economic growth, particularly in the higher education sector. She believes that strengthening the links between the Chamber and UCC can ensure that education programmes meet the changing needs of the business community. If elected to the Chamber’s Board, she pledges to raise awareness of UCC’s  learning, teaching and research among Chamber members and enhance interaction with Chamber members and the University’s global partnership base. In summary, Jean’s candidacy for the Cork Chamber Board brings a wealth of experience in partnership building, policy influence, and academia-business interface, with a focus on driving economic growth and fostering collaboration between academia and the business community in Cork. Noreen Walsh AIB Read More Noreen Walsh AIB Noreen Walsh is Head of AIB Cork, Cork’s largest bank.  She is responsible for leading a team of over 250 staff across 26 branches throughout Cork City and County. A graduate of University of Limerick, Noreen is a customer focused senior Financial and Banking services expert, with over 24 years experience gained from working in a variety of roles within AIB. These included positions in AIB’s Wealth Division, Regional Roles in AIB’s Retail and Business Banking areas and Branch Manager position’s in Mallow and South Mall branches. Noreen is responsible for driving the performance of her team by consistently putting the customer first and delivering the best banking experience. You might also like ... Membership News Meet the Team Membership Membership Benefits Testimonials Partner Programme Member Activity Member Directory Promotional opportunities About Us About Us Overview What we do Who we are Promotional opportunities News Gift Card Contact Events Events Overview Upcoming Events Cork Digital Marketing Awards Cork Company of the Year Awards Gallery News Podcast – On Point, Unscripted Press Releases Quarterly Economic Trends Chamberlink Magazine Membership News Training Upcoming Courses Training & Development Supports International Services International Overview Connecting Cork Export Documentation Post Brexit Advice International Connections Advocacy Advocacy Our Focus Advocacy Our Mandate Sustainability Sustainability Overview Environment Governance Social Workability Cork Sustainable Cork Programme Cork Chamber © Fitzgerald House, Summerhill North, Cork, T23 TD90 Company Registration Number - 13918 Sitemap Covid Protocol Privacy Policy Cookie Policy Site by Granite"
    },
    {
      "url": "https://portugalcork.com.au/pages/contact-us",
      "text": "Get in Touch | Contact Us for Premium Cork Products | Portugal Cork Co Skip to content Products Products Cork Sheets Cork Rolls Cork Walls Floor Tiles Architectural Range Acoustic Cork Underlay Green Flow Collection Raw Cork Yoga Collection Adhesives & Coatings About Us Why Cork? Contact Us Log in Facebook Instagram LinkedIn Search our site Products Wall Range Floor Range Adhesives & Coatings Architectural Range Projects About Us Contact Us Clear Products Cork Sheets Cork Rolls Cork Walls Floor Tiles Architectural Range Acoustic Cork Underlay Green Flow Collection Raw Cork Yoga Collection Adhesives & Coatings About Us Why Cork? Contact Us Search our site Products Wall Range Floor Range Adhesives & Coatings Architectural Range Projects About Us Contact Us Clear Log in Cart Get in touch Name Email * Phone number Product / Project Comment Send message This site is protected by hCaptcha and the hCaptcha Privacy Policy and Terms of Service apply. Customer Service sales@portugalcork.com.au Head Office & Dispatch 3D / 1 - 3 Endeavour Road, Caringbah 2229 Contact for Showroom 1800 291 003 Follow us Facebook Instagram LinkedIn Dispatch & Collection Only 3D / 1-3 Endeavour Road, Caringbah, NSW, 2229, Australia Mon - Fri, 8:30am - 3:30pm Get directions Explore Search Contact Us Why Cork? Links Refund Policy The Cork Edit Join our cork newsletter for new products and project inspiration Enter email here Apply Within For Trade sales@portugalcork.com.au 1800 291 003 Facebook Instagram LinkedIn Follow us on social media! © 2025, Portugal Cork Co . All rights reserved. Refund policy Privacy policy Terms of service Country/region AUD $ NZD $ Update country/region Country/region Australia (AUD $) Australia (AUD $) New Zealand (NZD $) Home Menu Search Shop Cart Account Choosing a selection results in a full page refresh."
    },
    {
      "url": "https://corksncrafts.com/about-us/",
      "text": "About Us | Corks 'n Crafts info@corksncrafts.com Call us  : (702) 574-9996 Menu Home About Us About Us Corks ‘n Crafts is a modern DIY craft + sip studio. Think of your local paint and wine place, but better. Much, much better! Blogs FAQ’s Get Crafty with Friends! Book Now Class Schedule Class Schedule Corks ‘n Crafts offers many options for classes. From holidays, to candles, to special décor, we have classes for everybody. Book a Class About Our Class Events Make A Project! Reserve Now Franchise Private Parties Private Parties Parties with Corks ‘n Crafts are more than just a get together – it’s a hands-on experience! We offer a variety of projects at every skill and age level. Whether it’s a birthday party for kids or adults, online team building, ladies’ night out or family fun day – we have something for everyone! Kids/Teens Adults Team Building Fundraisers Virtual Workshops Join a Class! Learn More Activations Activations Corks ‘n Crafts offers the same studio projects but delivered to your door.  Everything is provided from tables and chairs to supplies, paints and even the drop cloths. Children’s Activations Corporate Activations Private Parties! Book Now Gift Cards Contact Us Home About Us Blogs FAQs Class Schedule About Our Class Book a Class Events Franchise Private Parties Kids/ Teens Adults Fundraisers Team Building Virtual Workshops Activations Children’s Activations Corporate Activations Gift Cards Contact Us About Us Corks ‘n Crafts is LAs Vegas Premier Mobile Art Event company. About Us Corks n Crafts is a woman-owned, premier mobile art experience company based in Las Vegas, specializing in creative workshops and on-site event activations. For over 8 years, we’ve partnered with corporate groups, destination management companies, wedding planners, and private clients to deliver high-end, hands-on crafting experiences that leave a lasting impression. Our team has executed events of all sizes—from intimate gatherings to large-scale activations with over 1,500 guests—always with a focus on quality, creativity, and seamless execution. From custom charcuterie boards and seasonal resin art to interactive mixology classes and curated take-home stations, every experience is designed to be both engaging and turnkey. We handle all setup, instruction, and materials—transforming any venue into a dynamic creative space where guests can relax, connect, and create something meaningful. Contact Us  Pop-Up Events Come find us at your favorite bars, cafes, and event venues. We love setting up our art studio in your favorite places. Event schedule  At Home Parties We love to party! Let us guide your guests through a creative journey where they are “Literally Creating Memories.” Learn More  Event Activations Crafting activations are the most fun addition to any party or event.  if you need a quick and attractive activation at your event we have a wide variety of options. Learn More our vision Bringing community together Our team knows the value in creating something with your own hands. We bring together people from every walk of life and show them they too can create masterpieces. We want every person  to know the joy of creating art with their own hands. No experience? No problem. It’s our passion to guide your creativity. Sign Up Founder & Owner Raised in Western Pennsylvania, Alainah Paul grew up with a strong appreciation for craftsmanship, creativity, and hard work. Inspired by her coal miner grandfather and her father—a commercial fashion photographer with a talent for building everything, including their family home—Alainah developed a passion for hands-on creation from an early age. That passion, combined with an eye for design and a drive to build something of her own, would eventually lead her to launch Corks n Crafts . Alainah began her career in the fashion industry, working with world-renowned brands such as Chanel, Wynn Resorts, and The Venetian. After co-founding two fashion sock lines with her husband, she turned her attention toward experience-based entrepreneurship. As a mother of four daughters and a lifelong creative, Alainah saw an opportunity to blend artistry with business—offering unique, engaging, and meaningful experiences through crafting. Since founding Corks n Crafts , Alainah has spent the past 8 years working closely with corporate clients, destination management companies, and event professionals to deliver high-end mobile workshops and custom activations. Known for her attention to detail, creativity, and collaborative approach, she ensures that every event—whether for 15 or 1,500 guests—is thoughtfully executed and truly unforgettable. Alainah currently works with the Las Vegas based mobile team as well as the Corks N Crafts franchise development group. Contact Us Unique, Instagrammable, and Completely On-the-Go Chat with an event coordinator today! Email Us  Mobile Art Events serving the Las Vegas Community.  info@corksncrafts.com  (702)574-9996 Follow Follow Follow Quick Link Home About Us Blogs FAQs Contact Us Services About Our Class Book a Class Events Franchise Children’s Activations Corporate Activations Copyright © 2025 Corks N’ Crafts. All Rights Reserved. Refund Policy | Privacy Policy We are so excited to party and create with you and your guests. Fill out the form and one of our event coordinators will be in touch shortly. Be sure to check your email for confirmation! During holidays and weekends are team might be assisting in our busy studio. Please allow 24 business hours for a personalized response from our Event Coordinators. Please contact us at events@corksncrafts.com with any any questions. Event Inquiry Form Name (Required) First Last Email (Required) Phone (Required) Address Street Address Address Line 2 City State / Province / Region ZIP / Postal Code Country Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cabo Verde Cambodia Cameroon Canada Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Congo, Democratic Republic of the Cook Islands Costa Rica Croatia Cuba Curaçao Cyprus Czechia Côte d'Ivoire Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Eswatini Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Macedonia Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Romania Russian Federation Rwanda Réunion Saint Barthélemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Sweden Switzerland Syria Arab Republic Taiwan Tajikistan Tanzania, the United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkmenistan Turks and Caicos Islands Tuvalu Türkiye US Minor Outlying Islands Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Venezuela Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Åland Islands Country Event Type (Required) Select Event Type Kid's Birthday Adult Birthday Corporate Party Team Building Virtual Event Social - Other Offsite Party (Your Location) Desired Event Date (Required) MM slash DD slash YYYY Est. Guest Count (Required) How did you hear about us? (Required) × Our Spring Sale Has Started You can see how this popup was set up in our step-by-step guide: https://wppopupmaker.com/guides/auto-opening-announcement-popups/ × × SIGN UP NOW To- Receive Monthly Promo Codes & Exclusive Discounts Enter your information below and we will email you a code to use when you register online for your first class at Corks ‘n Crafts! Name (Required) First Last Email Address (Required) × Our Spring Sale Has Started You can see how this popup was set up in our step-by-step guide: https://wppopupmaker.com/guides/auto-opening-announcement-popups/ ×  Presets Color Primary #1196CC Secondary #202c45"
    },
    {
      "url": "https://cianoart.com/contact-ciano-art/",
      "text": "Contact Ciano Art – Reach Out for Enquiries or Commissions Home About Me Artist Statement Blog Collected Works Archive Originals Available Catalogue Contact Select Page Contact Ciano Art Have a question or want to connect about a specific piece? Use the form below to contact Ciano Art directly. Send a Message to Ciano Art Name Email Address Message Submit Why Contact Ciano Art? Whether you’re a collector interested in bold original abstract art or a gallery seeking fresh contemporary work, contacting Ciano Art connects you directly with the artist behind emotionally resonant and thought-provoking pieces. Ciano’s large-scale artworks are known for their raw energy, layered symbolism, and rebellious visual language — ideal for those who value originality and expression. Ciano has exhibited in Cork and beyond, and works with collectors and professionals across Ireland and internationally. Every enquiry is handled personally and with care, whether you’re asking about an available piece, need guidance choosing the right artwork for your space, or want to learn more about upcoming exhibitions. Follow the Creative Process To see what happens behind the scenes — including new work, studio updates, and works-in-progress — follow Ciano Art on Instagram. It’s a great way to stay connected and see new pieces as they emerge. Learn More About the Artist If you’d like to better understand the creative influences and journey behind Ciano Art, you can also read the artist statement here . It offers insight into the philosophy and evolution of the work. Final Note Whether your message is about acquiring artwork, featuring it in an exhibition, or simply connecting — don’t hesitate to reach out. Contact Ciano Art today and start the conversation. Prefer to reach out via social? Connect with me below. Follow Follow Follow Follow Ciano is an Irish visual artist based in Cork. EXPLORE Originals All Works Contact INFO About Me Artist Statement Blog Collected Works Archive CONNECT: For inquiries: info@cianoart.com Follow Follow Follow Follow © Ciano Art 2025 Manage Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent WhatsApp me"
    },
    {
      "url": "https://blockdesign.co.uk/pages/contact-us",
      "text": "Contact Us\n – Block Design Skip to main content Country selector (GBP £) (EUR €) (EUR €) (EUR €) (EUR €) (BGN лв.) (CAD $) (EUR €) (EUR €) (CZK Kč) (DKK kr.) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (GBP £) (HUF Ft) (EUR €) (EUR €) (GBP £) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (GBP £) (PLN zł) (EUR €) (EUR €) (RON Lei) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (SEK kr) (GBP £) (GBP £) (USD $) (EUR €) We're B Corporation Certified! We're B Corporation Certified! We're B Corporation Certified! We're B Corporation Certified! We're B Corporation Certified! We're B Corporation Certified! We're B Corporation Certified! We're B Corporation Certified! We're B Corporation Certified! We're B Corporation Certified! We support 1% for the planet We support 1% for the planet We support 1% for the planet We support 1% for the planet We support 1% for the planet We support 1% for the planet We support 1% for the planet We support 1% for the planet We support 1% for the planet We support 1% for the planet Country selector (GBP £) (EUR €) (EUR €) (EUR €) (EUR €) (BGN лв.) (CAD $) (EUR €) (EUR €) (CZK Kč) (DKK kr.) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (GBP £) (HUF Ft) (EUR €) (EUR €) (GBP £) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (GBP £) (PLN zł) (EUR €) (EUR €) (RON Lei) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (SEK kr) (GBP £) (GBP £) (USD $) (EUR €) Pegboards Back Pegboards Pegboards Pegboard Accessories Pegboard Packages Cork Boards Shop by Room Back Shop by Room Living Room Kitchen | Dining Office Bedroom Bathroom COLLECTIONS Back COLLECTIONS ColorLab Idle Hands Tinned Goods 7Supply Tile Collection Gifts Back Gifts Gifts for Her Gifts for Him Gifts for Kids Gifts for Creatives Secret Santa Christmas Gifts Boredom Busters Tinned Gifts Gifts Under £20 Gift Sets Gift Vouchers COMING SOON Trade Country selector (GBP £) (EUR €) (EUR €) (EUR €) (EUR €) (BGN лв.) (CAD $) (EUR €) (EUR €) (CZK Kč) (DKK kr.) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (GBP £) (HUF Ft) (EUR €) (EUR €) (GBP £) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (GBP £) (PLN zł) (EUR €) (EUR €) (RON Lei) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (SEK kr) (GBP £) (GBP £) (USD $) (EUR €) Pegboards Pegboards Pegboard Accessories Pegboard Packages Cork Boards Shop by Room Living Room Kitchen | Dining Office Bedroom Bathroom COLLECTIONS ColorLab Idle Hands Tinned Goods 7Supply Tile Collection Gifts Gifts for Her Gifts for Him Gifts for Kids Gifts for Creatives Secret Santa Christmas Gifts Boredom Busters Tinned Gifts Gifts Under £20 Gift Sets Gift Vouchers COMING SOON Trade Country selector (GBP £) (EUR €) (EUR €) (EUR €) (EUR €) (BGN лв.) (CAD $) (EUR €) (EUR €) (CZK Kč) (DKK kr.) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (GBP £) (HUF Ft) (EUR €) (EUR €) (GBP £) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (GBP £) (PLN zł) (EUR €) (EUR €) (RON Lei) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (SEK kr) (GBP £) (GBP £) (USD $) (EUR €) Sign up and save Sign up for our newsletter and become a part of the Block online community and get 15% off your first purchase. Be the first to know about new products, exclusive offers and our latest styling advice! 📌 Email address This site is protected by hCaptcha and the hCaptcha Privacy Policy and Terms of Service apply. Cookie consent We use cookies and similar technologies to provide the best experience on our website. Refer to our Privacy Policy for more information. accept decline Get in touch Contact us Thank you for visiting our website. If you have any questions relating to our products, or need any help with an order that you have placed, please feel free to contact us by using this contact form. Alternatively, please get in touch with us on one of the following: Address: Block, The Forge, Newport, St Germans, Cornwall, PL12 5NX T: 01503 230003 E: hello@blockdesign.co.uk If you are a retailer and would like to stock our products, we'd love to hear from you! If you are in the UK please contact Amy on sales@blockdesign.co.uk or call her on 01503 230003. For US and Canada trade enquiries please get in touch with our agent Mark Wallis on mark@wallisandcompany.com - you'll find more brilliant brands here. And for French enquiries please contact Aliénor at alienor@goodgoodgoods.fr - explore more of Aliénor's beautiful brands here www.goodgoodgoods.fr View our brochure Block, The Forge, Newport, St. Germans Cornwall PL12 5NP Open in maps Monday - Thursday 9am - 5pm Friday 9am - 4pm Name Email Message Send This site is protected by hCaptcha and the hCaptcha Privacy Policy and Terms of Service apply. About the store 2025 © Block Design. Block Design began in 2000. Our aim is to bring joy, infusing life with colour, distinctive design and products made to last. Block Design has a certification as a B Corporation, joining a growing group of companies reinventing business by pursuing purpose as well as profit. Our products celebrate your creativity. We aim to empower you to achieve your personal and professional goals. We’re inspired when we see our products in your beautiful homes and studios, so please do keep tagging us on Instagram: @blockdesign Help ABOUT BLOCK DESIGN BLOG Contact us Terms of Service Refund policy Delivery Resources Pegboards Cork Boards Shop by Room COLLECTIONS Gifts COMING SOON Trade Faire Wholesale Newsletter Be the first to receive updates on new arrivals, special promos and sales. Email address This site is protected by hCaptcha and the hCaptcha Privacy Policy and Terms of Service apply. Country selector (GBP £) (EUR €) (EUR €) (EUR €) (EUR €) (BGN лв.) (CAD $) (EUR €) (EUR €) (CZK Kč) (DKK kr.) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (GBP £) (HUF Ft) (EUR €) (EUR €) (GBP £) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (GBP £) (PLN zł) (EUR €) (EUR €) (RON Lei) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (EUR €) (SEK kr) (GBP £) (GBP £) (USD $) (EUR €) Copyright Block Design American Express Apple Pay Bancontact Diners Club Discover Google Pay iDEAL Maestro Mastercard PayPal Shop Pay Union Pay Visa Search here... Cancel Popular products Sale Hallway Pegboard Package 2 £147.00 £117.60 Sale Hallway Pegboard Package 1 £187.00 £149.60 Great Hair Day £15.00 Gradient Solitaire £30.00 Your Cart You are £100.00 from free shipping. Leave a note with your order Total £0.00 GBP Tax included and shipping calculated at checkout Continue shopping Checkout One or more of the items in your cart is a recurring or deferred purchase. By continuing, I agree to the cancellation policy and authorize you to charge my payment method at the prices, frequency and dates listed on this page until my order is fulfilled or I cancel, if permitted. Your cart is currently empty. Click here to continue shopping ."
    },
    {
      "url": "https://fintech.com/blog/drinking-buddies-block-15-brewing-company",
      "text": "Drinking Buddies: Block 15 Brewing Company | Fintech Skip to content Featured Blog: Learn About End-to-End Alcohol Invoice Data Integration with Fintech’s PaymentSource® Pro Sales Support Industries Close Industries Open Industries Accounting Firms For accounting firms of all sizes servicing hospitality and retail businesses. Hospitality For bars, restaurants, hotels, venues, casinos, and other hospitality businesses. Retail Stores For retail businesses of all sizes, from a single site operator to enterprise-level. Alcohol Suppliers For breweries, wineries, distilleries, and other beverage alcohol producers. Alcohol Distributors For alcohol distributors and self-distributing suppliers of all sizes delivering wholesale products. Vendors & Supply Chain Partners For vendors and supply chain partners selling goods, services, and supplies to consumer businesses. Resources Close Resources Open Resources Blog Read our blog to learn how our technology is revolutionizing the industries we serve. News Stay updated with industry press and what’s new at Fintech. Events Meet the Fintech team at a conference, trade show, or local event. Business Cases Read about how Fintech has helped alcohol businesses across all three tiers. Alcohol Regulations Use our tool to learn about alcohol regulations throughout the U.S. Integration Ecosystem Learn more about our software integrations. Featured Blog The Escalating Appeal of Consignment Selling in the Modern Retail Landscape Company Close Company Open Company Team Learn about our leadership team. Culture Learn about the Fintech culture. Partners Explore our partners who share our value-driven commitment. Careers Find your next career here and join the Fintech team. About Fintech Fintech has been dedicated to serving the beverage alcohol industry for 34 years. Supported by TA Associates and General Atlantic, Fintech stands as a foremost leader in this sector. Its flagship product, PaymentSource®, is leveraged by over 274,000 retail and hospitality businesses, as well as more than 7,700 alcohol distributors, vendors, and suppliers… Contact Close Contact Open Contact Connect with Sales sales@fintech.com (813) 288-1980 (Option 2) Client Support / Activation support@fintech.com activation@fintech.com (813) 288-1980 (option 1) Login Get Started Drinking Buddies: Block 15 Brewing Company Written By: Matt Lalli, Fintech Marketing Category: Alcohol Distributors , Drinking Buddies , General , Retailers , Suppliers ​When it comes to variety, no one does it quite like Block 15 Brewing. Offering unique hop-forward ales, crisp lagers, barrel-aged rarities, and one of the Northwest’s most extensive wild & sour programs, Block 15 produces a range of artfully crafted beers, brewed with a nod toward fresh ingredients and fresh thinking. To learn more, we sat down with Pascal Fritz, Marketing Manager and Creative Director for Block 15 to discuss their beer, his transition from the corporate world to the craft beer industry, and how Block 15 serves their local community. Tell me about yourself: What’s your background, when did you first hear about Block 15 , and how did you become involved? So, I am our team’s Marketing Manager and Creative Director and have been with Block 15 for about ten months now. This is my first job in the craft brewing industry, and I couldn’t be more excited! I came to craft beer from the corporate world after working for Nike for 13 years in brand marketing and realizing I was ready to try something different. The position at Block 15 presented itself at the perfect time and it’s been really cool to apply my learnings from a large corporate atmosphere to something that’s a little bit faster, more agile, and has more potential for creativity! Was transitioning into the craft beer industry something you were thinking about for a while? Yeah, it actually was. Just from a personal interest standpoint, I have always been a fan of craft beer. I love how passionate the craft beer community is about the stories they tell and products they create, and how deep the community runs. I personally became passionate about the craft beer world after meeting people within the community, ultimately involving myself in learning more about certain beers and specific breweries. It was about then when I decided I wanted to transition into the industry, and now here we are! What was the first craft beer you drank? The first craft beer I ever had was a New Belgium Fat Tire. I was living in Kansas City at the time and I took a trip out to Colorado to snowboard over spring break. It blew my mind to see what flavorful beer tasted like and to see what craft beer had to offer. T ell us about Block 15. How did the brewery get started? When was it founded? Block 15 was founded in 2008, so we just celebrated our 13 th anniversary, which is a great milestone. I feel like we have an established footprint in our home state of Oregon, with a very loyal following from being around for so long. It was founded by Nick and Kristen Arzner, who, after attending college in Indiana, returned back to Nick’s home state of Oregon, where they found the perfect opportunity in Corvallis to open up a small brewery in the city’s downtown district. At the time, Corvallis had quite a small craft beer footprint – the Arzner’s wanted to focus on creating great beer beyond the standard IPAs and amber ales and get the local community excited about different and unique craft beer offerings. In 2015 we expanded to build a production facility on the south end of town where we were able to put out a significantly higher amount of beer. It’s been a great experience and Corvallis feels like the right place for Block 15 to thrive. What’s your all-time favorite Block 15 Beer? That’s a tough question… it’s like asking to pick your favorite child! Personally, I love very hop-forward beers, and not too long ago we released Joy Pale Ale, our newest year-round offering. It’s a modern take on a pale, but very approachable at 5% ABV. As you get older, you can’t always crush beers, so it’s nice to have something that’s super refreshing and flavorful, still hop-full, but won’t necessarily leave you hurting in the morning! What is Block 15’s best-selling beer? Far and away, our best-selling beer is Sticky Hands. It’s our double IPA and flagship beer and has been a massive hit throughout the years! It’s kind of funny to say that a double IPA is your most popular beer, but it has an extremely loyal fanbase. We have a base Sticky Hands offering and throughout the year we do variants on that base recipe to surprise and delight our fans. You guys are situated in beautiful Corvallis, Oregon. What activities would you recommend to someone visiting Corvallis for the first time? Corvallis is in a great location in the Willamette Valley, which is a breadbasket of farms, vineyards, and trails. The Oregon coast is just a little over an hour away, and combined with the hiking, mountain biking, and school spirit of Oregon State University, Corvallis is the ideal place for any outdoor enthusiast. Obviously, I have to get out there and visit sometime. Which of your beers would you recommend a first-timer at Block 15? We take pride in being very good at brewing a variety of beers while still keeping our selection approachable and inviting. No matter what you’re into, we’re going to have an offering that we’re confident you’ll really enjoy! Obviously, we create a lot of hop-forward beers and IPAs, but our barrel catalog is amazing. In fact, we were the first brewery in Oregon to have a cool ship – so we have spontaneously fermented beers that are incredible. Our Peche is a GABF Award-Winning beer, and ultimately, I would put our catalog up against anyone out there! Speaking of Corvallis, Block 15 is well represented in the community. Could you tell me more about the People’s Pint initiative? At Block 15, we have a tremendous focus on our local community and how we can help to improve it. With our People’s Pint initiative, we work with a new non-profit partner every month to help fundraise for their initiatives. We do so by earmarking one on-tap beer that will run throughout the month, and a portion of those proceeds go directly to the organization. It’s been an amazing experience to hear the stories of these incredible groups and find ways we can help out in any way possible. Block 15 predominantly distributes in Oregon and Washington currently, but I noticed you have a few distribution locations in Arizona; are you planning to expand outside of the Pacific North West? As a self-distributor, we primarily distribute in Oregon and Washington, but every once in a while, we will have the opportunity to partner with another distributor to get out of state. The Arizona opportunity presented itself last year, and since we hold very high standards when it comes to the shipment of our beer, we made sure that our distribution partner cold-shipped our beer and delivered it in an appropriate amount of time after brewing. Ultimately, we saw it as a unique opportunity to surprise the beer drinkers down in Arizona as they continue to develop their craft beer scene. We want our growth in Arizona to happen organically, though we do have plans for overall growth in the future. We know you’re a self-distributor: where can we find you? What is your most successful channel? The easiest place to find our offerings and where you can find our beer is through our website . We have an interactive “find our beer” map feature where you can see which locations sell our packaged goods and which places have Block 15 beer on draft. We partner with some incredibly loyal bottle shops all throughout Oregon and Washington that have our product on hand nearly all year round. We try to limit the doors we get into though, it’s important for us to build relationships with those shops we do conduct business with. What do you see as the next big trend in the craft beer industry? I personally feel that the next trend in the craft beer industry will be continuing beer education with your drinkers. Something I’m super excited about is our initiative to highlight where our ingredients are coming from. It goes beyond informing our customers on what exact type of hops went into their beer – we want to highlight what farms they’re coming from and in what regions certain ingredients originate. This has existed in the food industry for years at well-established restaurants, and we have found that the interest level is there in the craft beer community as well. We loved speaking with Pascal about the ins and outs of Block 15 Brewing – their superb catalog of beer is surpassed only by their dedication to the craft beer world, as well as their local community. If you find yourself in the Pacific Northwest, pick up a pack of Block 15 beer to enjoy while taking in the great outdoors, or head over to Corvallis to sip some brews at any of their three locations! Be sure to also follow Block 15 Brewing on Facebook , Twitter , and Instagram . Share to your social media. Facebook LinkedIn X Get Started Today! Fill out the form to connect with a Fintech team member. Read More From Fintech Scan-Based Trading: The Strategy for Categories with High Shrink & Low Sales Profitability Read More End-to-End Alcohol Invoice Data Integration with Fintech’s PaymentSource® Pro Read More Brewing a Nation: How the Beer Industry Powers the U.S. Economy in 2025 Read More How Digital Invoicing is Transforming the Alcohol Industry Read More Contact Support: (813) 288-1980 opt 1 Sales: (813) 288-1980 opt 2 Sales@fintech.com 3109 W Dr Martin Luther King Jr Blvd Suite 200, Tampa, Florida 33607 Industry Solutions Accounting Firms Alcohol Distributors Alcohol Suppliers Hospitality Businesses Retail Businesses Vendors & Supply Chain Partners Accounting Firms Alcohol Distributors Alcohol Suppliers Hospitality Businesses Retail Businesses Vendors & Supply Chain Partners Resources Alcohol Regulations Blog Business Cases Careers Events Integration Ecosystem News Partners Alcohol Regulations Blog Business Cases Careers Events Integration Ecosystem News Partners Facebook-f X-twitter Linkedin Instagram Fintech Logos Fintech Logos Copyright © 2025 all rights reserved Terms of Use Privacy Policy"
    },
    {
      "url": "https://craftdesignconstruction.co.uk/contact-us/",
      "text": "Contact Us | Cork Flooring Company | Handmade Cement Tiles HOME ABOUT US MATERIALS FURNITURE LIGHTING HOMEWARE Menu 0 Shopping Cart CONTACT US Richard Claridge Architect – ARB 097111A Director CDC. Craft Design Construction Ltd. Cristina D’Cotta Legacy Flat B, 54 Rosslyn Hill London NW3 1ND United Kingdom richard@craftdesignconstruction.co.uk +44 (0) 7881424262 Your Name (required) Your Email (required) Your phone number (required) Query Δ Stay Connected Δ Cork Twitter Children's Pinterest Products Materials Help & Information CONTACT US NEWS ARTICLES PRIVACY POLICY TERMS & CONDITIONS, SHIPPING Membership We Accept © Copyright  - Craft Design Construction Designed by wpwink.com Registered address: 54, Flat B, Rosslyn Hill, London NW3 1ND United Kingdom Company Registration Number: 07923078 VAT Number: GB137854289 Powered by wpchatsupport.com Powered by woohelpdesk.com Scroll to top"
    }
  ]
}