{
  "fuentes": [
    {
      "url": "https://www.giftly.com/gift-card/blue-jackets-gastropub-orlando-3",
      "email": "corporate@giftly.com"
    },
    {
      "url": "https://www.giftly.com/gift-card/blue-jackets-gastropub-orlando-3",
      "email": "merchants@giftly.com"
    },
    {
      "url": "https://communityreport.bluejackets.com/",
      "email": "cbjfoundation@bluejackets.com"
    },
    {
      "url": "https://communityreport.bluejackets.com/",
      "email": "cbjfoundation@bluejackets.com"
    },
    {
      "url": "https://www.bluejacketdc.com",
      "email": "grege@churchkeydc.com"
    },
    {
      "url": "https://www.bluejacketdc.com",
      "email": "info@bluejacketdc.com"
    },
    {
      "url": "https://www.nytimes.com/athletic/6296948/2025/04/21/blue-jackets-coaches-staff/",
      "email": "league-1-color@2x.png"
    },
    {
      "url": "https://www.nytimes.com/athletic/6296948/2025/04/21/blue-jackets-coaches-staff/",
      "email": "league-10-color@2x.png"
    },
    {
      "url": "https://www.nytimes.com/athletic/6296948/2025/04/21/blue-jackets-coaches-staff/",
      "email": "league-14-color@2x.png"
    },
    {
      "url": "https://www.nytimes.com/athletic/6296948/2025/04/21/blue-jackets-coaches-staff/",
      "email": "league-15-color@2x.png"
    },
    {
      "url": "https://www.nytimes.com/athletic/6296948/2025/04/21/blue-jackets-coaches-staff/",
      "email": "league-16-color@2x.png"
    },
    {
      "url": "https://www.nytimes.com/athletic/6296948/2025/04/21/blue-jackets-coaches-staff/",
      "email": "league-17-color@2x.png"
    },
    {
      "url": "https://www.nytimes.com/athletic/6296948/2025/04/21/blue-jackets-coaches-staff/",
      "email": "league-2-color@2x.png"
    },
    {
      "url": "https://www.nytimes.com/athletic/6296948/2025/04/21/blue-jackets-coaches-staff/",
      "email": "league-20-color@2x.png"
    },
    {
      "url": "https://www.nytimes.com/athletic/6296948/2025/04/21/blue-jackets-coaches-staff/",
      "email": "league-22-color@2x.png"
    },
    {
      "url": "https://www.nytimes.com/athletic/6296948/2025/04/21/blue-jackets-coaches-staff/",
      "email": "league-23-color@2x.png"
    },
    {
      "url": "https://www.nytimes.com/athletic/6296948/2025/04/21/blue-jackets-coaches-staff/",
      "email": "league-28-color@2x.png"
    },
    {
      "url": "https://www.nytimes.com/athletic/6296948/2025/04/21/blue-jackets-coaches-staff/",
      "email": "league-29-color@2x.png"
    },
    {
      "url": "https://www.nytimes.com/athletic/6296948/2025/04/21/blue-jackets-coaches-staff/",
      "email": "league-3-color@2x.png"
    },
    {
      "url": "https://www.nytimes.com/athletic/6296948/2025/04/21/blue-jackets-coaches-staff/",
      "email": "league-30-color@2x.png"
    },
    {
      "url": "https://www.nytimes.com/athletic/6296948/2025/04/21/blue-jackets-coaches-staff/",
      "email": "league-31-color@2x.png"
    },
    {
      "url": "https://www.nytimes.com/athletic/6296948/2025/04/21/blue-jackets-coaches-staff/",
      "email": "league-32-color@2x.png"
    },
    {
      "url": "https://www.nytimes.com/athletic/6296948/2025/04/21/blue-jackets-coaches-staff/",
      "email": "league-34-color@2x.png"
    },
    {
      "url": "https://www.nytimes.com/athletic/6296948/2025/04/21/blue-jackets-coaches-staff/",
      "email": "league-35-color@2x.png"
    },
    {
      "url": "https://www.nytimes.com/athletic/6296948/2025/04/21/blue-jackets-coaches-staff/",
      "email": "league-37-color@2x.png"
    },
    {
      "url": "https://www.nytimes.com/athletic/6296948/2025/04/21/blue-jackets-coaches-staff/",
      "email": "league-39-color@2x.png"
    },
    {
      "url": "https://www.nytimes.com/athletic/6296948/2025/04/21/blue-jackets-coaches-staff/",
      "email": "league-4-color@2x.png"
    },
    {
      "url": "https://www.nytimes.com/athletic/6296948/2025/04/21/blue-jackets-coaches-staff/",
      "email": "league-40-color@2x.png"
    },
    {
      "url": "https://www.nytimes.com/athletic/6296948/2025/04/21/blue-jackets-coaches-staff/",
      "email": "league-42-color@2x.png"
    },
    {
      "url": "https://www.nytimes.com/athletic/6296948/2025/04/21/blue-jackets-coaches-staff/",
      "email": "league-43-color@2x.png"
    },
    {
      "url": "https://www.nytimes.com/athletic/6296948/2025/04/21/blue-jackets-coaches-staff/",
      "email": "league-44-color@2x.png"
    },
    {
      "url": "https://www.nytimes.com/athletic/6296948/2025/04/21/blue-jackets-coaches-staff/",
      "email": "league-45-color@2x.png"
    },
    {
      "url": "https://www.nytimes.com/athletic/6296948/2025/04/21/blue-jackets-coaches-staff/",
      "email": "league-47-color@2x.png"
    },
    {
      "url": "https://www.nytimes.com/athletic/6296948/2025/04/21/blue-jackets-coaches-staff/",
      "email": "league-48-color@2x.png"
    },
    {
      "url": "https://www.nytimes.com/athletic/6296948/2025/04/21/blue-jackets-coaches-staff/",
      "email": "league-5-color@2x.png"
    },
    {
      "url": "https://www.nytimes.com/athletic/6296948/2025/04/21/blue-jackets-coaches-staff/",
      "email": "league-54-color@2x.png"
    },
    {
      "url": "https://www.nytimes.com/athletic/6296948/2025/04/21/blue-jackets-coaches-staff/",
      "email": "league-56-color@2x.png"
    },
    {
      "url": "https://www.nytimes.com/athletic/6296948/2025/04/21/blue-jackets-coaches-staff/",
      "email": "league-58-color@2x.png"
    },
    {
      "url": "https://www.nytimes.com/athletic/6296948/2025/04/21/blue-jackets-coaches-staff/",
      "email": "league-59-color@2x.png"
    },
    {
      "url": "https://www.nytimes.com/athletic/6296948/2025/04/21/blue-jackets-coaches-staff/",
      "email": "league-6-color@2x.png"
    },
    {
      "url": "https://www.nytimes.com/athletic/6296948/2025/04/21/blue-jackets-coaches-staff/",
      "email": "league-60-color@2x.png"
    },
    {
      "url": "https://www.nytimes.com/athletic/6296948/2025/04/21/blue-jackets-coaches-staff/",
      "email": "league-62-color@2x.png"
    },
    {
      "url": "https://www.nytimes.com/athletic/6296948/2025/04/21/blue-jackets-coaches-staff/",
      "email": "league-63-color@2x.png"
    },
    {
      "url": "https://www.nytimes.com/athletic/6296948/2025/04/21/blue-jackets-coaches-staff/",
      "email": "league-7-color@2x.png"
    },
    {
      "url": "https://www.nytimes.com/athletic/6296948/2025/04/21/blue-jackets-coaches-staff/",
      "email": "league-9-color@2x.png"
    }
  ],
  "mails": [
    "cbjfoundation@bluejackets.com",
    "corporate@giftly.com",
    "grege@churchkeydc.com",
    "info@bluejacketdc.com",
    "league-1-color@2x.png",
    "league-10-color@2x.png",
    "league-14-color@2x.png",
    "league-15-color@2x.png",
    "league-16-color@2x.png",
    "league-17-color@2x.png",
    "league-2-color@2x.png",
    "league-20-color@2x.png",
    "league-22-color@2x.png",
    "league-23-color@2x.png",
    "league-28-color@2x.png",
    "league-29-color@2x.png",
    "league-3-color@2x.png",
    "league-30-color@2x.png",
    "league-31-color@2x.png",
    "league-32-color@2x.png",
    "league-34-color@2x.png",
    "league-35-color@2x.png",
    "league-37-color@2x.png",
    "league-39-color@2x.png",
    "league-4-color@2x.png",
    "league-40-color@2x.png",
    "league-42-color@2x.png",
    "league-43-color@2x.png",
    "league-44-color@2x.png",
    "league-45-color@2x.png",
    "league-47-color@2x.png",
    "league-48-color@2x.png",
    "league-5-color@2x.png",
    "league-54-color@2x.png",
    "league-56-color@2x.png",
    "league-58-color@2x.png",
    "league-59-color@2x.png",
    "league-6-color@2x.png",
    "league-60-color@2x.png",
    "league-62-color@2x.png",
    "league-63-color@2x.png",
    "league-7-color@2x.png",
    "league-9-color@2x.png",
    "merchants@giftly.com"
  ],
  "nombre_sitio": "bluejacketsgastro.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.giftly.com/gift-card/blue-jackets-gastropub-orlando-3",
      "text": "Blue Jackets Gastropub Giftly - Beautiful Gift Card Alternative Restaurants Travel Spa & Beauty Activities Shopping Universal Brands Top Cities Multi-Place Corporate Restaurants Travel Spa & Beauty Activities Shopping Universal Brands Top Cities Multi-Place Corporate Gifts Gift Cards Orlando Going Out Blue Jackets Gastropub Blue Jackets Gastropub Gift Card Blue Jackets Gastropub Giftly A beautiful gift card alternative for Blue Jackets Gastropub Blue Jackets Gastropub 100% satisfaction guarantee Gift Amount $25 $50 $75 $100 $250 $500 $1000 Other Gift Design Continue 100% satisfaction guarantee Enter an amount between $5 and $1,000 Confirm Amount Blue Jackets Gastropub (34) (407) 896-2688 Categories Wine Bars, Cocktail Bars, Burgers Location 4868 New Broad St, Orlando, FL Gift Ideas for Blue Jackets Gastropub Blue Jackets Gastropub, located in Orlando, FL 32814, is the perfect spot to find unique and thoughtful gifts for anyone in your life who appreciates great food and drinks. For the foodie in your life, consider gifting them a dinner at Blue Jackets Gastropub. With a classic menu of steak, lamb, sandwiches, and fresh seafood, there's something for everyone to enjoy. And don't forget about the drinks - the bar offers an eclectic selection of family-owned, small-batch liquors and wine to tantalize your palate. If you're looking for a smaller gift, why not consider picking up a bottle of the gastropub's signature cocktail mix? Your loved one can recreate the gastropub's classic drinks at home, making it the perfect gift for the home bartender. And for those who prefer wine, Blue Jackets Gastropub offers a carefully curated selection of bottles to choose from. For the beer lover in your life, consider gifting them a growler of their favorite beer from the gastropub's rotating taps. It's the perfect gift for someone who loves trying new brews and will be a hit at any party or gathering. And for those who appreciate a good dining experience, consider gifting a gift card to Blue Jackets Gastropub. It's the perfect way to give the gift of a delicious meal and a memorable night out. Overall, Blue Jackets Gastropub has something for everyone when it comes to gift giving. With a focus on great food and drinks, your loved ones are sure to appreciate any gift that comes from this gastropub. Click here to send a gift up to $1,000 with the suggestion to use it at Blue Jackets Gastropub. Is this your business? Claim your business to update business information, customize this listing, and more! Learn more about Blue Jackets Gastropub Price $$ Blue Jackets Gastropub, located in Orlando, FL 32814, is a must-visit for those looking for a casual and contemporary dining experience. This gastropub offers a classic menu of steak, lamb, sandwiches, and fresh seafood for both lunch and dinner, making it the perfect spot for any time of day. But that's not all - the bar at Blue Jackets Gastropub offers an eclectic selection of family-owned, small-batch liquors and wine to tantalize your palate. If you're a fan of classic cocktails, you'll find plenty to love here as well. The ambience at Blue Jackets Gastropub is casual and welcoming, with both indoor and outdoor seating options available. Whether you're looking to catch up with friends over drinks or have a romantic dinner with your significant other, this gastropub has you covered. While some recent reviewers have expressed disappointment with their experience, others have raved about the food and atmosphere. Stephanie S. found the outdoor tables to be \"cute\" and enjoyed a reasonably priced glass of wine, while Mayson J. had a less-than-great service experience but appreciated the hopefulness that came with visiting a new restaurant. Overall, Blue Jackets Gastropub is a great spot for those looking for a relaxed dining experience with classic and elevated menu options. Whether you're a local or just passing through, be sure to add this gastropub to your list of must-visit restaurants in Orlando. Great Alternatives Buy a Gift & Greeting Card for Cork & Plate : Cork & Plate, a culinary gem nestled in the heart of Orlando, is an inviting restaurant where food enthusiasts can indulge in a delectable menu featuring a fusion of international flavors crafted with locally sourced ingredients. Gift $100 for Wine 4 Oysters : Indulge in a culinary experience like no other at Wine 4 Oysters in Orlando, where the perfect pairing of exquisite wines and delectable oysters awaits. Updated: August 31, 2025 The Giftly Advantage With Giftly you strike a perfect balance, the thoughtfulness of a Blue Jackets Gastropub gift card with the flexibility of money. Easy to buy online. Have it delivered now or later Send it with a personalized greeting card 3 easy ways for your recipient to redeem the gift See a Sample Gift 100% satisfaction guaranteed No wasted balance Easy to customize How it works You customize a gift Gift up to $1,000 with the suggestion to use it at Blue Jackets Gastropub. Delivered in a personalized greeting card. They receive the gift Gifts can be sent by email, SMS*, mail or you can print it yourself. They enjoy it! They redeem the gift on our website and choose to deposit the funds in their bank account, Paypal account or to have a Visa Gift Card mailed to them. They can spend the money at Blue Jackets Gastropub or anywhere else they like! Top Related Gifts Main Street at Lakewood Ranch Music, Food, and Fun Await You 8100 Lakewood Main St, Bradenton, FL 5.0 (2) • Music Venues Bacan Taste Latin Elegance in Every Sip 6100 Wave Hotel Dr, Orlando, FL 4.5 (263) • $$$ • Cocktail Bars Flutes Champagne Bar Bubbles and Bliss Await You 480 N Orlando Ave, Winter Park, FL 4.7 (43) • Wine Bars Vue 360 Rooftop Bar Sip and Soak in Stunning Views 455 E Shore Dr, Clearwater, FL 4.2 (17) • Lounges Grape & The Grain Sip Local, Savor Unique Wines 1110 Virginia Dr, Orlando, FL 4.4 (108) • $$ • Wine Bars Swirlery Wine Bar Sip Global Wines in a Cozy Spot 1508 E Michigan St, Orlando, FL 4.8 (79) • $$ • Wine Bars The Imperial Wine Bar & Beer Garden Sip and Savor in Style 1800 N Orange Ave, Orlando, FL 4.5 (223) • $$ • Wine Bars Bites & Bubbles Sip, Savor, and Celebrate Life 1618 N Mills Ave, Orlando, FL 4.2 (298) • $$ • Wine Bars More Nearby Businesses Eola Wine Company 430 E Central Blvd, Orlando, FL 4.2 (300) • $$ • Wine Bars Avalon General 3801 Avalon Park E Blvd, Orlando, FL 4.7 (3) • Wine Bars Wine Bar George at MCO 1 Jeff Fuqua Blvd, Orlando, FL 4.9 (7) • Wine Bars Orange County Brewers Terminal C, Orlando, FL 4.1 (11) • Wine Bars Curious Cork Wine & Provisions 14383 Narcoossee Rd, Orlando, FL 4.5 (60) • Wine Bars Moonrise Bar + Moonrise Grill 5500 Epic Blvd, Orlando, FL 4.7 (3) • Wine Bars Arden 1420 Alden Rd, Orlando, FL 5.0 (4) • Wine Bars The Hangry Bison 250 W Plant St, Winter Garden, FL 4.0 (375) • $$ • Wine Bars VINIA Wine & Kitchen 444 West New England Ave, Winter Park, FL 4.9 (161) • $$ • Wine Bars cork&olive 1061 S Sun Dr, Lake Mary, FL 4.5 (92) • $$ • Wine Bars Juicy & Crab 7777 W Irlo Bronson Memorial Hwy, Kissimmee, FL 4.1 (226) • Wine Bars Cape Town Lounge and Wine Bar 2901 Osceola Pkwy, Lake Buena Vista, FL 3.3 (3) • Wine Bars Wine Bar George 1610 E Buena Vista Dr, Lake Buena Vista, FL 4.5 (907) • $$$ • Wine Bars The Nest At Papilio 439 N Donnelly St, Mount Dora, FL 5.0 (3) • Wine Bars Cooper's Hawk Winery & Restaurant- Orlando - Waterford Lakes, FL 529 N Alafaya Trl, Orlando, FL 4.3 (1.2k) • $$ • Wine Bars Sparrow Wine Bar 807 N Orange Ave, Orlando, FL 4.5 (33) • Wine Bars Digress Wine 1215 Edgewater Dr, Orlando, FL 4.7 (32) • Wine Bars The Escobar Kitchen 420 E Church St, Orlando, FL 4.8 (15) • Wine Bars Bar Moonshine 1001 Epic Blvd, Orlando, FL 4.3 (3) • Wine Bars Quicksand Bar à Vin 1903 E Colonial Dr, Orlando, FL 4.8 (19) • Wine Bars The Attic Door 28 W Plant St, Winter Garden, FL 4.2 (183) • $$ • Wine Bars Vintage Vino 310 Broadway, Kissimmee, FL 4.4 (53) • $$ • Wine Bars Spill Wine & Beer Bar 1196 Tree Swallow Dr, Winter Springs, FL 4.1 (53) • $$ • Wine Bars Ellens Wine Room 440 S Sanford Ave, Sanford, FL 4.4 (20) • $$ • Wine Bars Cru Quarters At The Mayflower 1620 Mayflower Ct, Winter Park, FL 4.6 (13) • Wine Bars Tooting Otter 1014 Miami Springs Dr, Longwood, FL 5.0 (2) • Wine Bars Spice Road Table 200 Epcot Center Dr, Lake Buena Vista, FL Wine Bars Salty Rim Bar & Grill 3058 Pirate Way, Kissimmee, FL 4.1 (20) • Wine Bars Tessa Wine & Cigar Bar 2425A S Hiawassee Rd, Orlando, FL 4.0 (3) • $$ • Wine Bars Formaggio & Friends 4745 S Orange Ave, Orlando, FL 4.9 (17) • Wine Bars Wine & Corks 420 East Church St, Orlando, FL 4.9 (12) • Wine Bars Lorelei 737 N Thornton Ave, Orlando, FL 4.3 (31) • Wine Bars The Nook on Robinson 2432 E Robinson St, Orlando, FL 4.8 (41) • Wine Bars The Wine Bar 3885 Avalon Park Blvd, Orlando, FL 3.0 (2) • Wine Bars The Imperial at Washburn Imports - Sanford 116 E1st St, Sanford, FL 4.5 (146) • $$ • Wine Bars The Wine Room on Park Avenue 270 S Park Ave, Winter Park, FL 4.3 (764) • $$ • Wine Bars Urban on Plant Kitchen & Bar 132 W Plant St, Winter Garden, FL 3.8 (377) • $$ • Wine Bars Pierre's Wine Cellar 142 W Lakeview Ave, Lake Mary, FL 4.9 (29) • $$ • Wine Bars Morse Code Lounge 163 E Morse Blvd, Winter Park, FL 4.5 (19) • Wine Bars Venezia Wine Veranda 5475 Lorkey Ln, Melbourne, FL 3.9 (15) • Wine Bars Back 40 Wine 719 West Ave, Clermont, FL 5.0 (6) • Wine Bars Filomena's Pizzeria & Ristorante 350 E Seminole Blvd, Sanford, FL 1.0 (1) • Wine Bars See More Help If you have questions, need help, or want to modify, resend, or cancel a gift, please see our Support Center , where you can access an array of self-service tools and our FAQ. For other questions or issues, please contact support@giftly.com . Gift Disclosure The Giftly Prepaid Gift is redeemed for money through the Giftly website. It is not issued, endorsed, or accepted by any third-party merchant (including any third-party merchant explicitly referenced in this Giftly Prepaid Gift), and is not covered by the CARD Act. Giftly Prepaid Gifts never expire and there are no inactivity fees. Please see the Giftly Prepaid Gift Agreement for the complete terms. Wine Bars Cocktail Bars Burgers 3.6 30-39 5 single place gcdp beautiful_gift_card_alternative_in_title_tag Orlando, FL XXL M Help Help Center How Giftly works FAQ support@giftly.com Corporate Why Giftly Sign Up Log In corporate@giftly.com Merchants Customize listing Remove listing Settlement Notice FAQ merchants@giftly.com About Team Press Blog Legal Terms Privacy Gift Agreement Business categories Restaurants Travel Shopping Activities Spa & Beauty Outdoors Going Out Nationwide Brands All Business Categories Business locations Atlanta Austin Boston Chicago Dallas Denver Detroit Houston Las Vegas Los Angeles Miami Minneapolis New York Oakland Philadelphia Phoenix Portland St. Louis San Diego San Francisco San Jose Seattle Wash, DC Browse All Restaurants Seafood Steakhouses Italian French Asian Fusion Pizza Sushi Burgers Mexican Japanese All Restaurant Types Gift Ideas Multi-Place Gift Ideas The Giftly Prepaid Gift is issued by Sunrise Banks N.A., St. Paul, MN 55103, Member FDIC. * Standard data rates, fees, and charges may apply to send by text. Copyright © 2025 Giftly. All rights reserved."
    },
    {
      "url": "https://communityreport.bluejackets.com/",
      "text": "Home - Columbus Blue Jackets Foundation Get Involved FOR OUR FUTURE Corporate Caring FOR EACH OTHER Board of Directors FOR THE NEXT GENERATION FOR THE 5th LINE Your browser does not support the video tag. Your browser does not support the video tag. 100,000+ YOUTH SERVED $15M+ TOTAL GRANTED SINCE 2000 $2M+ COMMUNITY IMPACT 100,000+ YOUTH SERVED $15M+ TOTAL GRANTED SINCE 2000 $2M+ COMMUNITY IMPACT WE BELIEVE in supporting the health and wellness of children in Central OHIO We commit time, resources and financial support to organizations dedicated to pediatric cancer care, education, health & safety and youth hockey development. For Our Future Over the past quarter century, the Blue Jackets’ no-cost education programs have brought hockey into the classroom to teach teamwork, responsibility and respect in a fun, interactive way. A priority of the Blue Jackets and the Blue Jackets Foundation has been, and continues to be, making reading accessible to all children in our community by investing in education through literacy. Learn More For Each Other The fight against pediatric cancer has been one of the Blue Jackets Foundation’s primary areas of focus since the team’s inception in 2000. Kids fighting cancer are our heroes and we support them by offering unique experiences and program funding. Some call it therapy through distraction, but most kids call it fun. Learn More For the next generation Since the team’s arrival and Foundation’s creation in 2000, we have worked tirelessly to grow the game we love. Our commitment to the development of youth hockey and reducing barriers to participation in our sport runs deep as we believe everyone deserves the opportunity to play. Learn More for the 5th line Every season, Blue Jackets players, team personalities, staff and fans invest their time, energy and compassion to assist those in need within our community. This culture of giving and support reflects the values of the Blue Jackets organization, establishes a strong connection between the team and our community and demonstrates how sports transcend the ice to uplift our communities. Learn More Support Us Columbus Blue Jackets 200 W. Nationwide Blvd., Columbus, OH 43215 BlueJackets.com/Community CBJFoundation@BlueJackets.com 614-246-4315 For Our Future For the 5th Line BOARD OF Directors For Each Other Corporate Caring For the Next Generation Get Involved Learn more throughout the year delivered to your inbox Subscribe now at cbj.co/subscription © 2025 Columbus Blue Jackets Hockey Club and the National Hockey League. All\n                    Rights Reserved. Site by Makeway Privacy Policy"
    },
    {
      "url": "https://www.bluejacketdc.com",
      "text": "Bluejacket Brewery | Navy Yard | Washington DC top of page RESERVATIONS PRIVATE DINING EVENTS FIRST CLASS CATERING “Follow the trail of Nationals fans to Bluejacket, a soaring brewery, restaurant and bar spread over three levels in a historic building in Navy Yard” “ ​ Condé Nast Traveler ​ BLUEJACKET Brewery & Restaurant · Southeast DC Open Daily Beginning 11 AM Bluejacket is a three-story brewery, restaurant & bar located on the corner of Tingey & 4th Street SE in the heart of the Navy Yard / Capitol Riverfront neighborhood of Washington, DC. From Director of Brewing Operations, Ro Guenzel, and Beverage Director/ Partner, Greg Engert, Bluejacket serves a rotating selection of 20 drafts and cask ales, along with special bottles, every day. And you can take your favorite pours home with you - Bluejacket sells freshly-canned and bottled beer for takeaway. A brewery without boundaries, Bluejacket specializes in the small-batch production of traditional lagers, hop-forward brews, classic British-style beers, barrel-aged rarities and fruited sours. Through careful ingredient selection, bespoke brewery design & time-honored techniques, Bluejacket crafts full-flavored ales and lagers with the intentional, slow production approach that leads to memorable beer experiences. ​ The dining room and bar are the natural complement to Bluejacket. It’s a generous gathering place for friends to enjoy the beers in the presence of the elaborate brewing system used to make them, paired with dishes created by an incomparable culinary team using local, seasonal ingredients designed with the flavor profiles of the beers in mind. 300 Tingey Street SE Washington DC 20003 Telephone (202) 524 4862 Inquiries: info@bluejacketdc.com today's drafts retail offerings Dinner menu brunch menu whiskeys, wines & cocktails PATIO THE ORIGINS A Neighborhood Restaurant Group Concept Established 2012 Bluejacket was launched in 2012 as a brewery with an understanding of and respect for the traditions and techniques of classic brewing coexist with a spirit of constant experimentation, innovation, and collaboration, leading to delicious beers that showcase seasonality, culinary inspiration, and historic interpretation. Expect beers that range from intensely flavored to subtly nuanced; that offer something distinctive and satisfying for every palate and every plate; and that reflect equally the past, present, and future of genuine craft brewing. The brewery also ships its beer to carefully selected restaurants, bars, and retail outlets throughout the region and offers a limited number of cans onsite. The restaurant and bar features a constantly rotating selection of twenty bluejacket beers and five bluejacket cask ales, all poured at the appropriate temperature, and most available only on-site. The menu refines and extends the classic fare of beer halls and public houses and features the best locally sourced products available. The space that Bluejacket occupies is as distinctive as the brewery itself. Built in 1919, the building – known as the boilermaker shops – was part of the navy yards ship and munitions manufacturing complex, and it is one of the few true industrial buildings remaining in Washington, DC. The name Bluejacket is a navy term for an enlisted person (enlistees receive the bluejacket manual, the basic handbook for U.S Navy personnel), and it is intended to pay homage to the history of our building and our neighborhood that we are now a part of. We hope you find it as inspiring as we do as we add a new, very different chapter to its history. “One Of The Most Highly Anticipated New Breweries In America” ESQUIRE MAGAZINE THE HOURS Open Daily For Reservations & Walk Ins Full Bar Early Until Late Monday through Thursday 11 am until 10:30 pm Bar Open Until Midnight ......... Friday & Saturday 11 am until 11:30 pm Bar Open Until 1:30 am ......... Sunday 11 am until 9:30 pm Bar Open Until 11 pm ........ Weekend Brunch Saturday & Sunday 11 am to 3 pm make a reservation CARRYOUT / DELIVERY PURCHASE GIFT CARDS join the mailing list 300 tingey street se dc 20003 telephone 202 524 4862 info@bluejacketdc.com Media inquirie s bottom of page"
    },
    {
      "url": "https://www.nytimes.com/athletic/6296948/2025/04/21/blue-jackets-coaches-staff/",
      "text": "Blue Jackets make several changes to support staff, re-sign assistant coaches - The Athletic NHL Teams Scores & Schedule Standings Podcasts Fantasy NHL Odds NHL Picks Free-Agent Big Board Red Light Newsletter Blue Jackets make several changes to support staff, re-sign assistant coaches By Aaron Portzline April 21, 2025 COLUMBUS, Ohio — After one season on the job, Columbus Blue Jackets president and general manager Don Waddell is ready to put his stamp on the franchise. Waddell confirmed to The Athletic on Monday that several longtime employees were informed over the weekend that they would not return, most notably strength and conditioning coach Kevin Collins, who had been with the Blue Jackets since 2010. Advertisement Also let go were two employees who have been with the Blue Jackets since they arrived as an NHL expansion team in 2000: equipment manager Jamie Healy and video coach Dan Singleton. Naoto “Nates” Goto, who worked under Collins as an assistant athletic trainer since 2012-13, also was told he won’t return, Waddell said. Meanwhile, Waddell told The Athletic that assistant coaches Niklas Backstrom (goaltending), Jared Boll and Steve McCarthy, all of whom spent the 2024-25 season in the final year of their contracts, have signed extensions. He would not specify the terms. Happy 1,000th game to #CBJ strength and conditioning coach, Kevin Collins. 👏👏👏 pic.twitter.com/bxgKcChpqM — Columbus Blue Jackets (@BlueJacketsNHL) October 25, 2023 Collins’ departure is most notable. The Blue Jackets frequently have been among the NHL leaders in man-games lost due to injury, and previous administrations — GM Jarmo Kekalainen and his predecessor, Scott Howson — have done offseason deep-dives in attempts to find out the cause. Mostly, it was dismissed as bad luck. This season, the Blue Jackets lost 324 man-games, with veteran leaders Boone Jenner (shoulder, 56 games), Erik Gudbranson (shoulder, 66) and Sean Monahan (wrist, 28) all missing extended time, along with young winger Yegor Chinakhov (back, 44). It marked the third straight season the Blue Jackets totaled more than 300 man-games lost. In 2022-23, the Jackets set a franchise record with 565 man-games lost to injury. Let's hear it for #CBJ Head Equipment Manager Jamie Healy who worked his 2,000th pro game on Saturday in Seattle! 👏👏👏 pic.twitter.com/PPxqCvHfNl — Columbus Blue Jackets (@BlueJacketsNHL) February 1, 2023 Healy was the Blue Jackets’ assistant equipment manager until 2022, when longtime equipment manager Tim Leroy was fired and Healy was promoted. In addition to his NHL work, Healy has worked four IIHF World Championships as part of the Team USA staff. (Photo: Nick Turchiaro / Imagn Images) Sep 10, 2025 Connections: Sports Edition Spot the pattern. Connect the terms Find the hidden link between sports terms Play today's puzzle Tagged To: Columbus Blue Jackets Aaron Portzline is a senior writer for The Athletic NHL based in Columbus, Ohio. He has been a sportswriter for more than 30 years, winning national and state awards as a reporter at the Columbus Dispatch. In addition, Aaron has been a frequent contributor to the NHL Network and The Hockey News, among other outlets. Follow Aaron on Twitter @ Aportzline National Boxing Bundesliga Champions League Championship College Football College Sports Copa America Copa del Rey Cricket Culture Cycling Europa League European Championship FA Cup Fantasy Baseball Fantasy Basketball Fantasy Football Fantasy Hockey Fantasy Premier League FIFA Club World Cup Formula 1 Gaming Global Sports Golf International Football La Liga League Cup League One League Two Memorabilia & Collectibles Men's College Basketball Men's World Cup Mixed Martial Arts MLB MLS Motorsports NASCAR NBA NFL NHL NWSL Olympics Opinion Peak Premier League Sailing Scottish Premiership Serie A Soccer Sports Betting Sports Business Tennis Top Sports News WNBA Women's College Basketball Women's Euros Women's Hockey Women's Soccer Women's World Cup The Athletic Ink Podcasts Headlines US Arizona Atlanta Baltimore Bay Area Boston Buffalo Carolina Chicago Cincinnati Cleveland Columbus Dallas Denver Detroit Houston Indiana Jacksonville Kansas City Las Vegas Los Angeles Memphis Miami Minnesota Nashville New Orleans New York Oklahoma Oregon Orlando Philadelphia Pittsburgh Sacramento San Antonio San Diego Seattle St. Louis Tampa Bay Utah Washington DC Wisconsin Canada Calgary Edmonton Montreal Ottawa Toronto Vancouver Winnipeg Partners Collectibles by eBay Odds by BetMGM Tickets by Viagogo Subscribe Start Subscription Group Subscriptions HQ About Us Careers Code of Conduct Editorial Guidelines Business Inquiries Press Inquiries Support FAQ Forgot Password? Contact Us Terms of Service Newsletters The Pulse The Bounce The Windup Prime Tire Full Time Until Saturday Scoop City The Athletic FC MoneyCall Red Light © 2025 The Athletic Media Company, A New York Times Company Privacy Policy Your Ad Choices Support Sitemap"
    }
  ]
}