{
  "fuentes": [
    {
      "url": "https://thebluewolftavern.com/about-us/",
      "email": "info@thebluewolftavern.com"
    },
    {
      "url": "https://tallahasseearts.org/venue/blue-tavern/",
      "email": "info@tallahasseearts.org"
    },
    {
      "url": "https://theblueskytavern.com/contact-us",
      "email": "events@theblueskytavern.com"
    },
    {
      "url": "https://bluecanyonrestaurant.com/about-us",
      "email": "brill@dblshft.com"
    },
    {
      "url": "https://bluecanyonrestaurant.com/about-us",
      "email": "valvoelker@bluecanyonrestaurant.com"
    },
    {
      "url": "https://www.thebluerosestudio.com/contact-us",
      "email": "customerservice@thebluerosestudio.com"
    },
    {
      "url": "https://www.thebluerosestudio.com/contact-us",
      "email": "customerservice@thebluerosestudio.com"
    },
    {
      "url": "https://www.blueducktavern.com/contact/",
      "email": "saleswasph@hyatt.com"
    }
  ],
  "mails": [
    "brill@dblshft.com",
    "customerservice@thebluerosestudio.com",
    "events@theblueskytavern.com",
    "info@tallahasseearts.org",
    "info@thebluewolftavern.com",
    "saleswasph@hyatt.com",
    "valvoelker@bluecanyonrestaurant.com"
  ],
  "nombre_sitio": "bluetaverntallahassee.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://thebluewolftavern.com/about-us/",
      "text": "About Us - Blue Wolf Tavern | Boardman, Ohio Restaurants About Us Menus All Day Menu Specials Lil Pup Menu Drink Menu Dessert Menu Party Tray Menu Carryout Cocktails News & Events Gallery Contact Contact Order Now Reservations Select Page About The Blue Wolf Tavern Blue Wolf Tavern is a farm-to-table eatery serving award-winning handcrafted recipes using homegrown ingredients envisioned by Executive Chef, Joe Rzonsa. Our menu is inspired by the culture and focus of locally-sourced ingredients and sustainable food. Along with gourmet food, you can eat, drink and converse in a cozy and comfortable environment inspired by the northern woods. In The Spirit Of The Wolf The wolf conjures up images of beauty and of fear, mystery and power. Their deep and mournful howls tell stories of long travels and cold, dark nights. There was a time when the wolf lived among us, envied by Native Americans for its ability to survive and thrive, protect its pack and be in balance with the world it shared. Wolves embrace a life of wild freedom. These highly socialized creatures carry themselves with certainty and pride, being friendly but never tame. Today, the wolf is an endangered species and resides mostly in Northwestern Canada and a few northwestern states in the United States. They still signify loyalty, success, perseverance, stability, thought and intuition. Our Story Great-tasting food using fresh and homegrown ingredients was the vision of Executive Chef, Joe Rzonsa. Blue Wolf Tavern first opened its doors in Struthers, Ohio in 2001 and quickly became a popular choice among patrons in Youngstown and the Mahoning Valley for its mouth-watering recipes, warm service and enjoyable atmosphere. Blue Wolf Tavern needed to expand and moved to its current location at 1295 Boardman-Canfield Road in Boardman, Ohio in 2004. The name, look and feel were the inspiration of a beautiful postcard of a wolf standing in front of burning woods, causing the wolf to have a bluish hue. The end result is a cozy dining experience filled with exceptional food made entirely from scratch. So come on in, sit down and enjoy a great meal! Blue Wolf Tavern 1295 Boardman-Canfield Rd. Boardman, OH 44512 330.726.1736 info@thebluewolftavern.com Navigation About Us Menus News & Events Gallery Tavern Hours Mon-Thu: 11:30am – 9pm Fri-Sat: 11:30am – 10pm Sun: 12pm – 8pm Lounge Open Late! Prices and availability subject to change. Follow Us Grab Your Gift Cards Today! *No refunds © 2025 Blue Wolf Tavern Site created by PALO Creative®"
    },
    {
      "url": "https://tallahasseearts.org/venue/blue-tavern/",
      "text": "Blue Tavern English English French German Italian Portuguese Russian Spanish SUBMIT YOUR INFO LOGIN REGISTER LOGOUT MY ACCOUNT There are no recent bookmarks. subscribe follow capture tweet watch connect access Submit an Event LOG-IN REGISTER LOGOUT MY ACCOUNT SEARCH MENU EVENTS Art Camps Classes & Workshops Adult Classes Kids Classes Music Lessons Online Lessons Dance Family Film Free Heritage Literature Music Make Music Tallahassee 2025 Online Theatre PUBLIC ART Art in Public Places Exhibit with COCA GALLERIES Artport Gallery City Hall Gallery COCA Exhibition Online Galleries Outdoor Public Art Asphalt Art Great Art for Greater Bond History and Culture Trail Public Art Walks Sculpture Scape TLH Mural Makeover Voice of Trees – Tallahassee ARTS EDUCATION FUNDING OPPORTUNITIES Arts Education Grant Classroom Funding Lifelong Learning TEACHING RESOURCES COCA for Kids COCA in the Classroom Digital Resources Local, State, National Public Art Teachable Works School Mentoring Winterfest Winter Festival Student Artwork Form Winter Festival Teacher Participation Application GRANTS & RESOURCES Accessibility Directories Artists Businesses Organizations Outdoor Public Art Venues & Spaces Get Involved Grants Apply for a COCA Grant (FY26) Manage Your COCA Grant (FY25 and earlier) Grant-Related Marketing Material Submission Professional Development Resources MARKETING & SERVICES Advertising Opportunities Classifieds Marketing Assistance Media Guide Newsletters Services Artist Visa Support Technical Assistance MEMBERSHIP COCA Business Sponsors ABOUT COCA COCA’s 40th Anniversary Call for Musicians: 40th Anniversary  Local Music Playlist About COCA Bylaws & Policies COCA Staff and Board Mission, History & Values Join the COCA Team Cultural Plan Strategic Plan Arts Advocacy COCA SPOTLIGHT Contact COCA Economic Development License Plates Public Notices Tallahassee Creates EVENTS Art Camps Classes & Workshops Adult Classes Kids Classes Music Lessons Online Lessons Dance Family Film Free Heritage Literature Music Make Music Tallahassee 2025 Online Theatre PUBLIC ART Art in Public Places Exhibit with COCA GALLERIES Artport Gallery City Hall Gallery COCA Exhibition Online Galleries Outdoor Public Art Asphalt Art Great Art for Greater Bond History and Culture Trail Public Art Walks Sculpture Scape TLH Mural Makeover Voice of Trees – Tallahassee ARTS EDUCATION FUNDING OPPORTUNITIES Arts Education Grant Classroom Funding Lifelong Learning TEACHING RESOURCES COCA for Kids COCA in the Classroom Digital Resources Local, State, National Public Art Teachable Works School Mentoring Winterfest Winter Festival Student Artwork Form Winter Festival Teacher Participation Application GRANTS & RESOURCES Accessibility Directories Artists Businesses Organizations Outdoor Public Art Venues & Spaces Get Involved Grants Apply for a COCA Grant (FY26) Manage Your COCA Grant (FY25 and earlier) Grant-Related Marketing Material Submission Professional Development Resources MARKETING & SERVICES Advertising Opportunities Classifieds Marketing Assistance Media Guide Newsletters Services Artist Visa Support Technical Assistance MEMBERSHIP COCA Business Sponsors ABOUT COCA COCA’s 40th Anniversary Call for Musicians: 40th Anniversary  Local Music Playlist About COCA Bylaws & Policies COCA Staff and Board Mission, History & Values Join the COCA Team Cultural Plan Strategic Plan Arts Advocacy COCA SPOTLIGHT Contact COCA Economic Development License Plates Public Notices Tallahassee Creates Venue Type Amusement Park Arena/Stadium Bar/Tavern Bookstore Business/Company Campground Church Community Center Concert Hall Cultural District Fairgrounds Farm Gallery Government Historic Building/Landmark Hotel/Inn Library Museum Nightclub Online/Virtual Park/Garden Performing Arts Center Restaurant/Cafe School Shopping District Studio Theater State / Province AL FL GA City/Town Ashford Bellwood Black Chancellor Coffee Springs Columbia Cottonwood Cowarts Dothan Five Points Geneva Gordon Hartford Headland Malvern Newville Pansey Samson Shorterville Slocomb Webb Alford Apalachicola Bascom Bonifay Branford Bristol Campbellton Carrabelle Chattahoochee Chipley Cottondale Crawfordville Cross City Cypress Day Eastpoint Ebro Fort White Fountain Graceville Grand Ridge Greensboro Greenville Greenwood Gretna Havana Highland City Horseshoe Beach Jasper Jennings Lake City Lamont Lee Live Oak Lloyd Lulu Lynn Haven Madison Malone Marianna Mayo Mc Alpin Mexico Beach Midway Monticello Noma Old Town Panacea Panama City Panama City Beach Perry Pinetta Ponce de Leon Port Saint Joe Quincy Rosemary Beach Saint Marks Sneads Sopchoppy Steinhatchee Tallahassee Trenton Vernon Wausau Wellborn Westville Wewahitchka White Springs Woodville Youngstown Adel Alapaha Albany Arlington Baconton Bainbridge Barney Barwick Berlin Blakely Bluffton Boston Brinson Brookfield Cairo Camilla Cecil Chula Climax Coleman Colquitt Cuthbert Damascus Dixie Doerun Edison Ellenton Enigma Fort Gaines Funston Hahira Iron City Jakin Lake Park Lakeland Leary Leesburg Lenox Meigs Morgan Morven Moultrie Nashville Naylor Newton Norman Park Ochlocknee Omega Pelham Poulan Quitman Ray City Rebecca Sale City Shellman Smithville Sparks Statenville Stockton Sumner Sycamore Sylvester Thomasville Tifton Ty Ty Valdosta Warwick Whigham Zip/Postal Code 31601 31602 31603 31604 31605 31606 31620 31622 31625 31626 31627 31629 31632 31635 31636 31637 31638 31639 31641 31643 31645 31647 31648 31649 31698 31699 31701 31702 31703 31704 31705 31706 31707 31708 31716 31720 31721 31722 31727 31730 31733 31744 31747 31749 31753 31757 31758 31763 31765 31768 31771 31773 31775 31776 31779 31781 31783 31784 31787 31788 31789 31790 31791 31792 31793 31794 31795 31796 31799 32008 32013 32024 32025 32038 32052 32053 32055 32056 32059 32060 32061 32062 32064 32066 32094 32096 32301 32302 32303 32304 32305 32306 32307 32308 32309 32310 32311 32312 32313 32314 32315 32316 32317 32318 32320 32321 32322 32324 32326 32327 32328 32329 32330 32331 32332 32333 32336 32337 32340 32341 32343 32344 32345 32346 32347 32348 32350 32351 32352 32353 32355 32358 32359 32362 32395 32399 32401 32402 32403 32404 32405 32406 32407 32408 32409 32410 32411 32412 32413 32417 32420 32423 32425 32426 32428 32431 32432 32437 32438 32440 32442 32443 32444 32445 32446 32447 32448 32449 32452 32455 32456 32457 32460 32461 32462 32463 32464 32465 32466 32628 32648 32680 32693 33846 36301 36302 36303 36304 36305 36312 36313 36314 36316 36318 36319 36320 36321 36340 36343 36344 36345 36349 36353 36370 36373 36375 36376 36477 36855 39813 39817 39818 39819 39823 39824 39825 39827 39828 39834 39836 39837 39840 39841 39846 39851 39859 39861 39862 39866 39870 39886 39897 Accessibility Accessible Parking Accessible Restrooms All Gender Restrooms Assisted Listening Braille Changing Stations Drop Off Elevator Family Restrooms Info Large Print Low Vision Service Animal TTD/TTY Volume Control Telephone Wheelchair Access SEARCH Advanced Filters Home Venue Blue Tavern Comment Facebook Twitter Linkedin Print Blue Tavern A room full of people: Blue Tavern is a new bar/venue in Midtown within easy walking distance from Levy and Lafayette Park neighborhoods. Serving beer, wine, coffee, tea, and sodas — a perfect quiet spot to enjoy conversation, reading, art, without TV or canned music. Now providing WiFi for customers. Menu offerings include soups and sandwiches prepared on the premises. Baked goods and snacks available. Parking available onsite, street-side or in public parking lots. Hours: Mon-Thu 5-midnight; Fri-Sat 4-1. Closed Sunday. Live music most nights. Acoustic blues Mondays. Occasional literary and film events. For booking, contact clhamby65@gmail.com or 850-264-6916 StarMetro bus stop next door: Big Bend line stops every 30 minutes A room full of people: Blue Tavern is a new bar/venue in Midtown within easy walking distance from Levy and Lafayette Park neighborhoods. Serving beer, wine, coffee, tea, and sodas — a perfect quiet spot to enjoy conversation, reading, art, without TV or canned music. Now providing WiFi for customers. Menu offerings include soups and sandwiches prepared on the premises. Baked goods and snacks available. Parking available onsite, street-side or in public parking lots. Hours: Mon-Thu 5-midnight; Fri-Sat 4-1. Closed Sunday. Live music most nights. Acoustic blues Mondays. Occasional literary and film events. For booking, contact clhamby65@gmail.com or 850-264-6916 StarMetro bus stop next door: Big Bend line stops every 30 minutes View less MORE ABOUT THIS VENUE Venue Type: Bar/Tavern ; Nightclub ; Restaurant/Cafe LOCATION Blue Tavern 1206 North Monroe St., Tallahassee, FL 32303 View in Google Maps MAKE IT A NIGHT View map Don’t see your business listed here? Email us to add it! Expand [+] ALBUQUERQUE LITTLE THEATRE FOOD Cheese Coffee Caf Downtown Liu Chinese Fast Food Vinaigrette Garcias Kitchen The Original Route 66 Malt Shop Bottger Mansion of Old Town Accommodation Bottger Mansion of Old Town Liu Chinese Fast Food Drink Bottger Mansion of Old Town Liu Chinese Vinaigrette Accessibility Information Wheelchair Access ADDITIONAL ACCESSIBILITY INFO: The front door is accessible by wheelchair; our bathroom is also accessible. There are no dedicated handicapped parking spaces, but if you call us ahead of time we will reserve a spot in front for you: (850) 212-5204. PARKING INFO Parking available onsite, street-side or in public parking lots nearby. PUBLIC HOURS Monday-Thursday 5-midnight Friday-Saturday 4-1 Closed Sunday PUBLIC ADMISSION FEES No admission fee unless ticketed music event as posted Some weeknight events $2 added to bar tab Most weekend events $5 or $10 added to bar tab or collected at door UPCOMING EVENTS PAST EVENTS Steve Sternberg at Bluesday Tuesdays at the Blue Tavern Presented by Blue Tavern Tallahassee at Blue Tavern Sep 9, 2025 Accessibility Info Facebook Twitter Linkedin Jazzmatazz - BAMA Presented by Blue Tavern Tallahassee at Blue Tavern Aug 30, 2025 Accessibility Info Facebook Twitter Linkedin Charlie Morris Presented by Blue Tavern Tallahassee at Blue Tavern Jul 15, 2025 Accessibility Info Facebook Twitter Linkedin Happy Hour with Matthew Cravener Presented by Blue Tavern Tallahassee at Blue Tavern Jun 18, 2025 Accessibility Info Facebook Twitter Linkedin Once Great Estate & Dave Pucik @ the Req Room Presented by Blue Tavern Tallahassee at Blue Tavern Jun 7, 2025 Accessibility Info Facebook Twitter Linkedin Grant Peeples at The Blue Tavern Presented by Grant Peeples at Blue Tavern May 16, 2025 Accessibility Info Facebook Twitter Linkedin SHOW MORE PHOTOS Room Full of People Room Full of People Room Ready for People Caleb Vaughn A Symphony Danny Goddard A Choro Night Sir Charles &amp; Band A Choro Night The New 76ers Contact information Email / Website / Facebook / 1206 North Monroe St., Tallahassee, FL 32303 850-212-5204 COMMENTS Leave a comment Your email address will not be published. Required fields are marked * * Email address is required! * This is not email address! * Author name is required! * Comment content is required! Your name * Your email * Comment * You may use these HTML tags and attributes : <a href=\"\" title=\"\"> <abbr title=\"\"> <acronym title=\"\"> <b> <blockquote cite=\"\"> <cite> <code> <del datetime=\"\"> <em> <i> <q cite=\"\"> <s> <strike> <strong> * Please check the box to prove you are not a robot Find A Venue Search by Keyword Venue Type Amusement Park Arena/Stadium Bar/Tavern Bookstore Business/Company Campground Church Community Center Concert Hall Cultural District Fairgrounds Farm Gallery Government Historic Building/Landmark Hotel/Inn Library Museum Nightclub Online/Virtual Park/Garden Performing Arts Center Restaurant/Cafe School Shopping District Studio Theater State / Province AL FL GA City/Town Ashford Bellwood Black Chancellor Coffee Springs Columbia Cottonwood Cowarts Dothan Five Points Geneva Gordon Hartford Headland Malvern Newville Pansey Samson Shorterville Slocomb Webb Alford Apalachicola Bascom Bonifay Branford Bristol Campbellton Carrabelle Chattahoochee Chipley Cottondale Crawfordville Cross City Cypress Day Eastpoint Ebro Fort White Fountain Graceville Grand Ridge Greensboro Greenville Greenwood Gretna Havana Highland City Horseshoe Beach Jasper Jennings Lake City Lamont Lee Live Oak Lloyd Lulu Lynn Haven Madison Malone Marianna Mayo Mc Alpin Mexico Beach Midway Monticello Noma Old Town Panacea Panama City Panama City Beach Perry Pinetta Ponce de Leon Port Saint Joe Quincy Rosemary Beach Saint Marks Sneads Sopchoppy Steinhatchee Tallahassee Trenton Vernon Wausau Wellborn Westville Wewahitchka White Springs Woodville Youngstown Adel Alapaha Albany Arlington Baconton Bainbridge Barney Barwick Berlin Blakely Bluffton Boston Brinson Brookfield Cairo Camilla Cecil Chula Climax Coleman Colquitt Cuthbert Damascus Dixie Doerun Edison Ellenton Enigma Fort Gaines Funston Hahira Iron City Jakin Lake Park Lakeland Leary Leesburg Lenox Meigs Morgan Morven Moultrie Nashville Naylor Newton Norman Park Ochlocknee Omega Pelham Poulan Quitman Ray City Rebecca Sale City Shellman Smithville Sparks Statenville Stockton Sumner Sycamore Sylvester Thomasville Tifton Ty Ty Valdosta Warwick Whigham Zip/Postal Code 31601 31602 31603 31604 31605 31606 31620 31622 31625 31626 31627 31629 31632 31635 31636 31637 31638 31639 31641 31643 31645 31647 31648 31649 31698 31699 31701 31702 31703 31704 31705 31706 31707 31708 31716 31720 31721 31722 31727 31730 31733 31744 31747 31749 31753 31757 31758 31763 31765 31768 31771 31773 31775 31776 31779 31781 31783 31784 31787 31788 31789 31790 31791 31792 31793 31794 31795 31796 31799 32008 32013 32024 32025 32038 32052 32053 32055 32056 32059 32060 32061 32062 32064 32066 32094 32096 32301 32302 32303 32304 32305 32306 32307 32308 32309 32310 32311 32312 32313 32314 32315 32316 32317 32318 32320 32321 32322 32324 32326 32327 32328 32329 32330 32331 32332 32333 32336 32337 32340 32341 32343 32344 32345 32346 32347 32348 32350 32351 32352 32353 32355 32358 32359 32362 32395 32399 32401 32402 32403 32404 32405 32406 32407 32408 32409 32410 32411 32412 32413 32417 32420 32423 32425 32426 32428 32431 32432 32437 32438 32440 32442 32443 32444 32445 32446 32447 32448 32449 32452 32455 32456 32457 32460 32461 32462 32463 32464 32465 32466 32628 32648 32680 32693 33846 36301 36302 36303 36304 36305 36312 36313 36314 36316 36318 36319 36320 36321 36340 36343 36344 36345 36349 36353 36370 36373 36375 36376 36477 36855 39813 39817 39818 39819 39823 39824 39825 39827 39828 39834 39836 39837 39840 39841 39846 39851 39859 39861 39862 39866 39870 39886 39897 Accessibility Accessible Parking Accessible Restrooms All Gender Restrooms Assisted Listening Braille Changing Stations Drop Off Elevator Family Restrooms Info Large Print Low Vision Service Animal TTD/TTY Volume Control Telephone Wheelchair Access OUR PARTNERS COCA's programs are sponsored in part by the City of Tallahassee, Leon County, the State of Florida, Department of State, Division of Cultural Affairs, Community Foundation of North Florida, Knight Foundation, National Endowment for the Arts, and the Tallahassee Community Redevelopment Agency. COCA, the Council on Culture & Arts, is a non-profit organization that serves as the facilitator and voice for the arts and cultural industry in Florida's capital area. COCA provides information and promotes the arts and culture to both citizens and visitors. ABOUT US DIRECTORIES CLASSIFIEDS PARTNERS CONTACT US 114 S DUVAL STREET TALLAHASSEE, FL 32301 LOCAL NUMBER: (850) 224-2500 EMAIL: info@tallahasseearts.org © Copyright 2025 - Council on Culture & Arts | Contact Us | Site Map | Privacy Policy Powered by ARTSOPOLIS The COCA office currently has adjusted office hours to 1 PM – 5 PM to accommodate pickup for Winterfest. These hours will be adjusted from Tuesday, February 11, through Friday, February 28 . Regular office hours will return on Monday, March 3. For questions, feel free to contact staff via phone or email. In addition, access to Railroad Avenue between Gaines Street & FAMU Way is down to one lane heading south. For access to the COCA office, please take Gaines Street as currently, the COCA office is not accessible off of FAMU Way."
    },
    {
      "url": "https://theblueskytavern.com/contact-us",
      "text": "Contact us HOME FOOD & DRINK SUMMER 2025 MENU BRUNCH 2025 CURRENT BEER LIST WINE WHISKEY WINGS THE TAVERN RED MILL RIBS N WHISKEY THE BEER GARDEN PRIVATE EVENTS MUSIC & EVENTS EVENTS CALENDAR PERFORM AT BST PAIRING DINNERS FUNDRAISERS GIFT CARDS BLUE SKY GIFT SHOP APPLY HERE! NOW EXPANDING, NOW HIRING.  CLICK HERE TO JOIN THE BLUE SKY FAMILY! HOME FOOD & DRINK SUMMER 2025 MENU BRUNCH 2025 CURRENT BEER LIST WINE WHISKEY WINGS THE TAVERN RED MILL RIBS N WHISKEY THE BEER GARDEN PRIVATE EVENTS MUSIC & EVENTS EVENTS CALENDAR PERFORM AT BST PAIRING DINNERS FUNDRAISERS GIFT CARDS BLUE SKY GIFT SHOP APPLY HERE! Contact Us The Blue Sky Tavern 895 Old Trail Road, Etters, Pennsylvania 17319, United States Phone Number:  # 717-822-0500 Email: events@theblueskytavern.com Get directions Copyright © 2021 The Blue Sky Tavern - All Rights Reserved. Contact us Powered by Welcome to The Blue Sky Tavern! Join our mailing list for specials and events. Sign Up here This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Decline Accept"
    },
    {
      "url": "https://bluecanyonrestaurant.com/about-us",
      "text": "Blue Canyon Kitchen & Tavern | Twinsburg, OH | About Us We're sorry but publication doesn't work properly without JavaScript enabled. Please enable it to continue. Our Philosophy The Adventures of the Blue Canyon At Blue Canyon, we strive to bring people together. Our award winning food will “entertain your tastebuds” and we accept nothing less than excellence from our team. It’s important to us that guests are treated like family by caring, thoughtful and warm people who are among the best in their fields. From the owners to the entire staff, everyone at Blue Canyon is held to the highest standards. They’re a friendly group, ready to meet your needs. Blue Canyon Kitchen and Tavern’s team invites you to enjoy the wonderful things life has to offer. Relax in our comfortable lodge setting while you sip martinis and settle in for a succulent meal prepared by our outstanding and creative chefs. After dessert, you’re just steps away from your evening accommodations with the Hilton Garden Inn Cleveland/Twinsburg. Indulge & Experience Escape from the everyday at Blue Canyon Kitchen & Tavern. Come indulge and experience all that Blue Canyon has to offer, from our unique vacation dining atmosphere and culture to our one of a kind, award-winning menu. It’s impossible not to sit back, laugh with friends and enjoy new twists on classic homemade dishes. Sitting atop a sandstone bluff that overlooks gorgeous views of wooded rolling landscapes of Northeast Ohio, Blue Canyon Restaurant offers an unparalleled rustic, cozy atmosphere. The restaurant’s design was inspired by the grand lodges located throughout the National Parks of the United States. Surrounded by hand-hewn cedar logs, soaring cathedral ceilings and multiple fieldstone fireplaces, you’re bound to step away from the daily stresses of life. Sit next to one of our breathtaking full window walls, as they provide dramatic views, or cozy up in our warm Kitchen Dining Room. The scenery and atmosphere of Blue Canyon Restaurant and Tavern complements the delectable and creative American Cuisine that our talented chefs create each night. Meet Our Management Bob Voelker CEO / President Val Voelker Principal Scott Coffman Director of Culinary / Executive Chef Private Dining & Catering Team Katie Stell Private Dining/Catering Director Ashley Bakewell Private Dining/Catering Coordinator Contact Us Today!"
    },
    {
      "url": "https://www.thebluerosestudio.com/contact-us",
      "text": "CONTACT US | The Blue Rose Studio top of page Log In HOME SHOP Divinity of the Soul Chakra Collection Love Language Colletion Accessories Apparel Home Decor Drinkware Plush Toys Stationary ARTWORK Love Language Chakra Art Flower Art CONTACT US BLOG ABOUT THE CREATIVE POLICIES F&Q Intellectual Property Disclaimer Privacy and Legal Information Statement Return and Exchange Policy Terms of Service Wholesale More Use tab to navigate through the menu items. Email us: Customer Service ​ Snail mail us: PO Box 279 Montgomery, New York 12549 ​ Visit us: TheBlueRoseStudio.com ​ Other Online Store: dreamstime.com/littlebluerose First name (Required) Last name (Required) Email (Required) Yes, subscribe me to your monthly newsletter. We love to hear from you, leave us a message! Submit Site Menu Home Shop Artwork Contact Us Blog About the Creative Shop by Chakra Root Sacral Solar Plexus Heart Throat 3rd Eye Crown Shop by Language Arabic Chinese Dutch English French German Greek Hawaiian Hebrew Irish Italian Japanese Polish Spanish Shop by Apparel Scrunchies Windbreakers Crop Tees Shirts Sweatshirts Tank Tops Leggings Shoes Shop by Product Tote Bags Candles Pillows Plush Toys Canvas Prints Mugs Stationary Policies FAQ Intellectual Property Disclaimer Privacy and Legal Return and Exchange Terms of Service Wholesale Blue Rose Studio • PO Box 279 Montgomery • New York 12549 CustomerService@TheBlueRoseStudio.com • 914.236.0555 ©2006~2024 TheBlueRoseStudio™, Angelina T. Collins. All rights reserved. bottom of page"
    },
    {
      "url": "https://www.blueducktavern.com/contact/",
      "text": "Contact Blue Duck Tavern Restaurant | Washington D.C. Skip to main content Hours & Location Story Menus Blue Duck Lounge Private Events Reservations Toggle Navigation Hours & Location Story Menus Blue Duck Lounge Private Events Careers Gift Cards Park Hyatt Washington, D.C. Awards Contact Terms & Conditions Do Not Sell Privacy Policy Reservations Email Signup Facebook Twitter Instagram Yelp TripAdvisor Email powered by BentoBox Main content starts here, tab to start navigating Contact Us Connect with us by phone at +1 202 419 6755 . We look forward to hearing from you. To reserve our Chef's Table or arrange a Private Event, please contact us at saleswasph@hyatt.com . leave this field blank Please, enter a valid name Name - Required Please, enter a valid email Email - Required Please, enter a valid phone number Phone Number - Required What are you getting in touch about? - Optional What are you getting in touch about? General Press Please, enter a valid your message Your Message - Required Send Please check errors in the form above Thank you for your inquiry. We’ll be in touch shortly. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Reservations Email Signup Facebook Twitter Instagram Yelp TripAdvisor Email Careers Gift Cards Park Hyatt Washington, D.C. Awards Contact Terms & Conditions Do Not Sell Privacy Policy Email Signup powered by BentoBox leave this field blank Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."
    }
  ]
}