{
  "fuentes": [
    {
      "url": "https://www.bocadunes.com/about-us-golf/",
      "email": "tracy@bocadunes.com"
    },
    {
      "url": "https://www.bocadunes.com/about-us-golf/",
      "email": "bocadunescatering@comcast.net"
    },
    {
      "url": "https://www.bocadunes.com/about-us-golf/",
      "email": "bocadunesgolf@comcast.net"
    },
    {
      "url": "https://www.bocadunes.com/tournaments-events/",
      "email": "tracy@bocadunes.com"
    },
    {
      "url": "https://www.bocadunes.com/tournaments-events/",
      "email": "bocadunesgolf@comcast.net"
    },
    {
      "url": "https://www.bocadunes.com/golf/leagues/",
      "email": "tracy@bocadunes.com"
    },
    {
      "url": "https://www.bocadunes.com/golf/leagues/",
      "email": "bocadunesgolf@comcast.net"
    },
    {
      "url": "https://www.par3-executive-golf.com/Florida/FLPalmBeachNineHoleatBocaDunesGolfCountryClub.htm",
      "email": "info@9holegolfcourses.com"
    },
    {
      "url": "https://www.bocadunes.com/directions/",
      "email": "bocadunesgolf@comcast.net"
    },
    {
      "url": "https://www.bocadunes.com/directions/",
      "email": "tracy@bocadunes.com"
    },
    {
      "url": "https://www.bocadunes.com/contactus/",
      "email": "tracy@bocadunes.com"
    },
    {
      "url": "https://www.bocadunes.com/contactus/",
      "email": "bocadunesgolf@comcast.net"
    },
    {
      "url": "https://www.bocadunes.com/banquets-events/rehearsal-welcome-dinners/",
      "email": "bocadunescatering@comcast.net"
    }
  ],
  "mails": [
    "bocadunescatering@comcast.net",
    "bocadunesgolf@comcast.net",
    "info@9holegolfcourses.com",
    "tracy@bocadunes.com"
  ],
  "nombre_sitio": "bocadunes.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.bocadunes.com/about-us-golf/",
      "text": "Special Events - Boca Dunes Golf and Country Club Skip to main content Skip to footer Boca Dunes Golf and Country Club Boca Raton, FL Phone Number: 561-451-1600 Address: 1400 Country Club Drive, Boca Raton, FL 33428 Pro Shop Email: bocadunesgolf@comcast.net Banquets & Catering Email: Tracy@bocadunes.com Home About Us Golf Rates Course Photos Memberships Tee Times Public Tee Times Book Member Tee Times Tournaments Leagues E-Club Contact Us Staff Location & Directions Book Tee Times Special Events Welcome to Boca Dunes Golf & Country Club! Boca Dunes Executive Course a par 62 with eight par 4’s and ten par 3’s. New tiff-eagle greens, lush landscaping, and continuous concrete cart paths throughout the entire course. The course has been designed to accommodate golfers of all skill levels. The clubhouse features spectacular ballrooms with sweeping views of the golf course. We have a beautiful veranda overlooking the wedding garden as well as breath-taking golf course views – a perfect spot for your cocktail and hors d’oeuvres receptions. Before you tee off or after you finish your round, stop by our pro shop! We have a nice selection of apparel and accessories. Names like Titleist, FootJoy, and Srixon assure you that you’re buying the best at affordable prices. Food and beverages are conveniently located in the pro shop for you to grab and go on your way out. Don’t forget to enjoy a cold beer after your round on our patio! Special Events Boca Dunes Country Club offers the finest special event facilities in the Boca Raton area. We offer full service catering, trained catering and event professionals will help you with a menu your guests will love. We have the experience and facility to accommodate 30-200 guests. Cocktails can be served on our veranda while your guests enjoy the golf course view. Your event will be set beautifully in one of our four banquet rooms. Whether it’s a wedding, bar/bat mitzvah, social event or any celebration, we think of every detail so you don’t. Our professional event staff is ready to help plan your special day!  For a private tour and consultation contact our events department 561-451-1600 ext. 116 or Click Here to Email Us! Footer Write a review today! Copyright © 2025 Boca Dunes Golf and Country Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.bocadunes.com/tournaments-events/",
      "text": "Tournaments & Events - Boca Dunes Golf and Country Club Skip to main content Skip to footer Boca Dunes Golf and Country Club Boca Raton, FL Phone Number: 561-451-1600 Address: 1400 Country Club Drive, Boca Raton, FL 33428 Pro Shop Email: bocadunesgolf@comcast.net Banquets & Catering Email: Tracy@bocadunes.com Home About Us Golf Rates Course Photos Memberships Tee Times Public Tee Times Book Member Tee Times Tournaments Leagues E-Club Contact Us Staff Location & Directions Book Tee Times Tournaments & Events Tournaments Tournaments Boca Dunes is the area’s premier golf tournament and outing facility. Boca Dunes Golf & Country Club is the perfect place to host your next tournament.  We have experience with all types of events:  charity, school, fundraising and company or business outings.  Our professional and courteous staff is ready to assist you in planning and running your golf tournament.  We can accommodate your tournament and execute the days activities with the finest of detail.  Give us a call, bring your committee out for a round of golf and talk to us about how we can help run a successful golf event for you. For more information about our tournament services, call 561-451-1600. Footer Write a review today! Copyright © 2025 Boca Dunes Golf and Country Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.bocadunes.com/golf/leagues/",
      "text": "Leagues available at Boca Dunes Golf and Country Club Skip to main content Skip to footer Boca Dunes Golf and Country Club Boca Raton, FL Phone Number: 561-451-1600 Address: 1400 Country Club Drive, Boca Raton, FL 33428 Pro Shop Email: bocadunesgolf@comcast.net Banquets & Catering Email: Tracy@bocadunes.com Home About Us Golf Rates Course Photos Memberships Tee Times Public Tee Times Book Member Tee Times Tournaments Leagues E-Club Contact Us Staff Location & Directions Book Tee Times Leagues Leagues Leagues Boca Dunes Golf and Country Club is the perfect club to host your corporate or group league. Leagues at Boca Dunes run year-round and vary with the season.    Contact us to find which league fits your skill level best, or if you’d like to create a new one!    Leagues at Boca Dunes are filled with good people, superb golf and great times. Join us today, as everyone is welcome! For more information, call 561-451-1600 ext. 101. Footer Write a review today! Copyright © 2025 Boca Dunes Golf and Country Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.par3-executive-golf.com/Florida/FLPalmBeachNineHoleatBocaDunesGolfCountryClub.htm",
      "text": "Boca Dunes Golf & Country Club, Boca Raton, Florida Par 3 Golf Courses Home (current) United States Alabama Alaska Arizona Arkansas California Colorado Connecticut DC Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington West Virginia Wisconsin Wyoming International Africa Australia Austria Belgium Canada Caribbean China Croatia CzechRep Denmark Finland France Germany Hungary Iceland Indonesia Ireland Luxembourg Mexico Netherlands New Zealand Norway Portugal Singapore Spain Turkey United Arab Emirates United Kingdom Add/Edit Course About Us Join Email List Our Other Golf Sites GroupChips.com GolfPuns.com GolfMajors2020.com ReachTheGreen.com WinFreeGolfBalls.com Boca Dunes Golf & Country Club, Boca Raton, Florida Get your short game on! Florida Home Florida Course List Florida County Map Boca Dunes Golf & Country Club 1400 Country Club Dr Boca Raton FL 33428 Phone: (561) 451-1600 Type: Semi Private Par: 62 Holes: 18 Website: http://bocadunes.com/ Comments: The golf course is a Devlin/VonHagee masterpiece with a 7,000 yard, 18 hole championship design. In addition to our renovated tees, we have added forward tees on all 18 holes, giving you an option of playing a true Executive Par 62 course. This allows Boca Dunes to accommodate golfers of any skill level. We're open to the public and also offer several types of memberships. Photos info@9holegolfcourses.com Copyright © Morton Technologies, LLC - All rights reserved | Privacy Policy Our disclosure to you: We spend a great deal of time keeping our directory up-to-date.  We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for us to earn fees by linking to Amazon.com and affiliated sites.  We also partner with other advertisers like Rock Bottom Golf and earn commissions by linking to their websites as well.  Please contact us if you have any questions. Par 3 and Executive Golf Courses Privacy Notice × Privacy Notice This privacy notice discloses the privacy practices for Par 3 and Executive Golf Courses. This privacy notice applies solely to information collected by this website. It will notify you of the following: What personally identifiable information is collected from you through the website, how it is used and with whom it may be shared. What choices are available to you regarding the use of your data. The security procedures in place to protect the misuse of your information. How you can correct any inaccuracies in the information. Information Collection, Use, and Sharing We are the sole owners of the information collected on this site. We only have access to/collect information that you voluntarily give us via email or other direct contact from you. We will not sell or rent this information to anyone. We will use your information to respond to you, regarding the reason you contacted us. We will not share your information with any third party outside of our organization, other than as necessary to fulfill your request, e.g. to ship an order. Unless you ask us not to, we may contact you via email in the future to tell you about specials, new products or services, or changes to this privacy policy. Your Access to and Control Over Information You may opt out of any future contacts from us at any time. You can do the following at any time by contacting us via the email address or phone number given on our website: See what data we have about you, if any. Change/correct any data we have about you. Have us delete any data we have about you. Express any concern you have about our use of your data. Security We take precautions to protect your information. When you submit sensitive information via the website, your information is protected both online and offline. Wherever we collect sensitive information (such as credit card data), that information is encrypted and transmitted to us in a secure way. You can verify this by looking for a lock icon in the address bar and looking for \"https\" at the beginning of the address of the Web page. While we use encryption to protect sensitive information transmitted online, we also protect your information offline. Only employees who need the information to perform a specific job (for example, billing or customer service) are granted access to personally identifiable information. The computers/servers in which we store personally identifiable information are kept in a secure environment. If you feel that we are not abiding by this privacy policy, you should contact us immediately via email. Registration In order to use this website, a user must first complete the registration form. During registration a user is required to give certain information (such as name and email address). This information is used to create a unique user account for you to access our web portal. At your option, you may also provide demographic information (such as gender or age) about yourself, but it is not required. Orders We request information from you on our order form. To buy from us, you must provide contact information (like name and shipping address) and financial information (like credit card number, expiration date). This information is used for billing purposes and to fill your orders. If we have trouble processing an order, we'll use this information to contact you. Cookies We use \"cookies\" on this site. A cookie is a piece of data stored on a site visitor's hard drive to help us improve your access to our site and identify repeat visitors to our site. For instance, when we use a cookie to identify you, you would not have to log in a password more than once, thereby saving time while on our site. Cookies can also enable us to track and target the interests of our users to enhance the experience on our site. Usage of a cookie is in no way linked to any personally identifiable information on our site. Some of our business partners may use cookies on our site (for example, advertisers). However, we have no access to or control over these cookies. Sharing We share aggregated demographic information with our partners and advertisers. This is not linked to any personal information that can identify any individual person.  We use a credit card processing company to bill users for goods and services. These companies do not retain, share, store or use personally identifiable information for any secondary purposes beyond filling your order. Links This website may contain links to other sites. Please be aware that we are not responsible for the content or privacy practices of such other sites. We encourage our users to be aware when they leave our site and to read the privacy statements of any other site that collects personally identifiable information. Surveys & Contests From time-to-time our site requests information via surveys or contests. Participation in these surveys or contests is completely voluntary and you may choose whether or not to participate and therefore disclose this information. Information requested may include contact information (such as name and shipping address), and demographic information (such as zip code, age level). Contact information will be used to notify the winners and award prizes. Survey information will be used for purposes of monitoring or improving the use and satisfaction of this site. Close We'd like permission to email you ONCE a month! We promise, just once a month.  We will email you news about our site, deals and offers from Golf retailers, and other Golf info you might find interesting! You can opt-out at any time, but we hope you don't. Just enter your email below.  We will send you a validation link to confirm you really do want email from us (we respect your privacy). Email Address Also enter me for FREE Monthly Golf Ball Drawing at WinFreeGolfBalls.com * Click here to submit form and join our list! * We also own WinFreeGolfBalls.com - we will NEVER sell or otherwise transfer your email address to anyone.  Never! No thanks Golf info isn't important to me"
    },
    {
      "url": "https://www.bocadunes.com/directions/",
      "text": "Location & Directions - Boca Dunes Golf and Country Club Skip to main content Skip to primary sidebar Skip to footer Boca Dunes Golf and Country Club Boca Raton, FL Phone Number: 561-451-1600 Address: 1400 Country Club Drive, Boca Raton, FL 33428 Pro Shop Email: bocadunesgolf@comcast.net Banquets & Catering Email: tracy@bocadunes.com Home Golf Rates Course Photos Scorecard Memberships Tee Times Public Tee Times Book Member Tee Times Video Banquets & Events Tournaments & Events Leagues Upcoming Events E-Club Flyer Specials Contact Us Location & Directions Staff Book Tee Times Location & Directions Directions Boca Dunes Golf & Country Club 1400 Country Club Drive Boca Raton, Florida 33428 Located west of Lyons Road, on SW 8th Street between Palmetto Park Road and Hillsboro Blvd. For More Information Call 561.451.1600 Primary Sidebar Hours of Operation 7:00 AM - 5:00 PM 7 Days a Week Footer Write a review today! Copyright © 2025 Boca Dunes Golf and Country Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.bocadunes.com/contactus/",
      "text": "Contact Us - Boca Dunes Golf and Country Club Skip to main content Skip to footer Boca Dunes Golf and Country Club Boca Raton, FL Phone Number: 561-451-1600 Address: 1400 Country Club Drive, Boca Raton, FL 33428 Pro Shop Email: bocadunesgolf@comcast.net Banquets & Catering Email: Tracy@bocadunes.com Home About Us Golf Rates Course Photos Memberships Tee Times Public Tee Times Book Member Tee Times Tournaments Leagues E-Club Contact Us Staff Location & Directions Book Tee Times Contact Us Contact Us Boca Dunes Golf & Country Club 1400 Country Club Drive Boca Raton, Florida 33428 Pro Shop:  561-451-1600 ext. 101 Director Of Golf: Tami Rehard Email Tami Golf Course Superintendent: Manuel Pereida Footer Write a review today! Copyright © 2025 Boca Dunes Golf and Country Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.bocadunes.com/banquets-events/rehearsal-welcome-dinners/",
      "text": "Rehearsal & Welcome Dinners - Boca Dunes Golf and Country Club Skip to main content Skip to primary sidebar Skip to footer Boca Dunes Golf and Country Club Boca Raton, FL Book Tee Times Rehearsal & Welcome Dinners Rehearsal & Welcome Dinners There are many aspects to the perfect wedding. Boca Dunes Golf and Country Club is a great setting for not only that magical day but the days leading up to it. Bride and grooms getting married at Boca Dunes can take some of the stress out of planning by hosting their rehearsal dinner in the same location as their wedding. With diverse menus we are able to offer a variety of foods that will be a hit with your closest family and friends. Boca Dunes is the perfect venue for anyone looking to have a Welcome Dinner for out of town guests. Whether your wedding is here or somewhere else, we would love to be any part of your special day. For a private tour and consultation contact our events department. 561-451-1600 ext. 116 or Click Here to Email Us! View Our Photo Tour! Dinner Menus and Prices All American Grill Sizzling Barbeque Station Reception Luau Rehearsal Surf & Turf Grill Enhance your Rehearsal Menu Showcase Event Wednesday, January 31st, 2018 at 7:00 PM RSVP Now Primary Sidebar Banquets & Events Form Private Event Software powered by Tripleseat Footer Write a review today! Copyright © 2025 Boca Dunes Golf and Country Club All Rights Reserved. Powered by"
    }
  ]
}