{
  "fuentes": [
    {
      "url": "https://www.bocawoodscc.com/overview-contact",
      "email": "administrativeoffices@bocawoodscc.com"
    },
    {
      "url": "https://www.bocawoodscc.com/overview-contact",
      "email": "hrbw@bocawoodscc.com"
    },
    {
      "url": "https://www.bocawoodscc.com/overview-contact",
      "email": "jmoe@bocawoodscc.com"
    },
    {
      "url": "https://www.bocawoodscc.com/overview-contact",
      "email": "membership@bocawoodscc.com"
    },
    {
      "url": "https://www.bocawoodscc.com/overview-contact",
      "email": "tennis@bocawoodscc.com"
    },
    {
      "url": "https://www.prnewswire.com/news-releases/boca-woods-country-clubs-director-of-operations-receives-prestigious-professional-designation-302438829.html",
      "email": "membership@bocawoodscc.com"
    },
    {
      "url": "https://bocaratonobserver.com/locations/boca-woods-country-club/",
      "email": "info@bocaratonobserver.com"
    },
    {
      "url": "https://bocaratonobserver.com/locations/boca-woods-country-club/",
      "email": "membership@bocawoodscc.com"
    },
    {
      "url": "https://www.bocawoodscc.com/meet-the-team",
      "email": "dsweet@bocawoodscc.com"
    },
    {
      "url": "https://www.bocawoodscc.com/meet-the-team",
      "email": "fbadmin@bocawoodscc.com"
    },
    {
      "url": "https://www.bocaratonrealestate.com/boca-woods/",
      "email": "info@bocaratonrealestate.com"
    },
    {
      "url": "https://www.bocaratonrealestate.com/boca-woods/",
      "email": "name@website.com"
    }
  ],
  "mails": [
    "administrativeoffices@bocawoodscc.com",
    "dsweet@bocawoodscc.com",
    "fbadmin@bocawoodscc.com",
    "hrbw@bocawoodscc.com",
    "info@bocaratonobserver.com",
    "info@bocaratonrealestate.com",
    "jmoe@bocawoodscc.com",
    "membership@bocawoodscc.com",
    "name@website.com",
    "tennis@bocawoodscc.com"
  ],
  "nombre_sitio": "bocawoodscc.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.bocawoodscc.com/overview-contact",
      "text": "Contact Boca Woods Country Club | Exclusive Golf & Amenities About the Club Membership Request Information Meet the Team Philanthropy Lifestyle Community Overview Social & Clubs Real Estate Events & Videos Club Tour Golf The Lakes Course The Woods Course Meet our Golf Pros Racquet Sports Tennis Pickleball Bocce Meet our Racquet Sports Team Wellness Fitness Spa Services Meet our Wellness Team Dining Overview Meet our F&B Team Contact Us Get in Touch Directions Careers image Menu About the Club Membership Request Information Meet the Team Philanthropy Lifestyle Community Overview Social & Clubs Real Estate Events & Videos Club Tour Golf The Lakes Course The Woods Course Meet our Golf Pros Racquet Sports Tennis Pickleball Bocce Meet our Racquet Sports Team Wellness Fitness Spa Services Meet our Wellness Team Dining Overview Meet our F&B Team Contact Us Get in Touch Directions Careers image Member Login Get in Touch We'd Love To Hear From You Get in Touch with Boca Woods Learn more about private country club life at Boca Woods by contacting Membership. Request more Information Clubhouse 561.487.2800 Membership Office 561.487.2800 > Ext:147 Pro Shop 561.487.2800 > Ext:131 Racquet Sports Office 561.487.2800 > Ext:134 Human Resources 561.487.2800 > Ext:118 10471 Boca Woods Ln. Boca Raton, FL 33428 Phone: 561.487.2800 Member Login Contact Us Careers Map & Directions © Boca Woods Country Club Powered by Northstar Technologies Follow Us Member Login"
    },
    {
      "url": "https://www.prnewswire.com/news-releases/boca-woods-country-clubs-director-of-operations-receives-prestigious-professional-designation-302438829.html",
      "text": "Boca Woods Country Club's Director of Operations Receives Prestigious Professional Designation Accessibility Statement Skip Navigation Resources Blog Journalists Client Login Send a Release News Products Contact Search Search When typing in this field, a list of search results will appear and be automatically updated as you type. Searching for your content... No results found. Please change your search terms and try again. News in Focus Browse News Releases All News Releases All Public Company English-only News Releases Overview Multimedia Gallery All Multimedia All Photos All Videos Multimedia Gallery Overview Trending Topics All Trending Topics Business & Money Auto & Transportation All Automotive & Transportation Aerospace, Defense Air Freight Airlines & Aviation Automotive Maritime & Shipbuilding Railroads and Intermodal Transportation Supply Chain/Logistics Transportation, Trucking & Railroad Travel Trucking and Road Transportation Auto & Transportation Overview View All Auto & Transportation Business Technology All Business Technology Blockchain Broadcast Tech Computer & Electronics Computer Hardware Computer Software Data Analytics Electronic Commerce Electronic Components Electronic Design Automation Financial Technology High Tech Security Internet Technology Nanotechnology Networks Peripherals Semiconductors Business Technology Overview View All Business Technology Entertain­ment & Media All Entertain­ment & Media Advertising Art Books Entertainment Film and Motion Picture Magazines Music Publishing & Information Services Radio & Podcast Television Entertain­ment & Media Overview View All Entertain­ment & Media Financial Services & Investing All Financial Services & Investing Accounting News & Issues Acquisitions, Mergers and Takeovers Banking & Financial Services Bankruptcy Bond & Stock Ratings Conference Call Announcements Contracts Cryptocurrency Dividends Earnings Earnings Forecasts & Projections Financing Agreements Insurance Investments Opinions Joint Ventures Mutual Funds Private Placement Real Estate Restructuring & Recapitalization Sales Reports Shareholder Activism Shareholder Meetings Stock Offering Stock Split Venture Capital Financial Services & Investing Overview View All Financial Services & Investing General Business All General Business Awards Commercial Real Estate Corporate Expansion Earnings Environmental, Social and Governance (ESG) Human Resource & Workforce Management Licensing New Products & Services Obituaries Outsourcing Businesses Overseas Real Estate (non-US) Personnel Announcements Real Estate Transactions Residential Real Estate Small Business Services Socially Responsible Investing Surveys, Polls and Research Trade Show News General Business Overview View All General Business Science & Tech Consumer Technology All Consumer Technology Artificial Intelligence Blockchain Cloud Computing/Internet of Things Computer Electronics Computer Hardware Computer Software Consumer Electronics Cryptocurrency Data Analytics Electronic Commerce Electronic Gaming Financial Technology Mobile Entertainment Multimedia & Internet Peripherals Social Media STEM (Science, Tech, Engineering, Math) Supply Chain/Logistics Wireless Communications Consumer Technology Overview View All Consumer Technology Energy & Natural Resources All Energy Alternative Energies Chemical Electrical Utilities Gas General Manufacturing Mining Mining & Metals Oil & Energy Oil and Gas Discoveries Utilities Water Utilities Energy & Natural Resources Overview View All Energy & Natural Resources Environ­ment All Environ­ment Conservation & Recycling Environmental Issues Environmental Policy Environmental Products & Services Green Technology Natural Disasters Environ­ment Overview View All Environ­ment Heavy Industry & Manufacturing All Heavy Industry & Manufacturing Aerospace & Defense Agriculture Chemical Construction & Building General Manufacturing HVAC (Heating, Ventilation and Air-Conditioning) Machinery Machine Tools, Metalworking and Metallurgy Mining Mining & Metals Paper, Forest Products & Containers Precious Metals Textiles Tobacco Heavy Industry & Manufacturing Overview View All Heavy Industry & Manufacturing Telecomm­unications All Telecomm­unications Carriers and Services Mobile Entertainment Networks Peripherals Telecommunications Equipment Telecommunications Industry VoIP (Voice over Internet Protocol) Wireless Communications Telecomm­unications Overview View All Telecomm­unications Lifestyle & Health Consumer Products & Retail All Consumer Products & Retail Animals & Pets Beers, Wines and Spirits Beverages Bridal Services Cannabis Cosmetics and Personal Care Fashion Food & Beverages Furniture and Furnishings Home Improvement Household, Consumer & Cosmetics Household Products Jewelry Non-Alcoholic Beverages Office Products Organic Food Product Recalls Restaurants Retail Supermarkets Toys Consumer Products & Retail Overview View All Consumer Products & Retail Entertain­ment & Media All Entertain­ment & Media Advertising Art Books Entertainment Film and Motion Picture Magazines Music Publishing & Information Services Radio & Podcast Television Entertain­ment & Media Overview View All Entertain­ment & Media Health All Health Biometrics Biotechnology Clinical Trials & Medical Discoveries Dentistry FDA Approval Fitness/Wellness Health Care & Hospitals Health Insurance Infection Control International Medical Approval Medical Equipment Medical Pharmaceuticals Mental Health Pharmaceuticals Supplementary Medicine Health Overview View All Health Sports All Sports General Sports Outdoors, Camping & Hiking Sporting Events Sports Equipment & Accessories Sports Overview View All Sports Travel All Travel Amusement Parks and Tourist Attractions Gambling & Casinos Hotels and Resorts Leisure & Tourism Outdoors, Camping & Hiking Passenger Aviation Travel Industry Travel Overview View All Travel Policy & Public Interest Policy & Public Interest All Policy & Public Interest Advocacy Group Opinion Animal Welfare Congressional & Presidential Campaigns Corporate Social Responsibility Domestic Policy Economic News, Trends, Analysis Education Environmental European Government FDA Approval Federal and State Legislation Federal Executive Branch & Agency Foreign Policy & International Affairs Homeland Security Labor & Union Legal Issues Natural Disasters Not For Profit Patent Law Public Safety Trade Policy U.S. State Policy Policy & Public Interest Overview View All Policy & Public Interest People & Culture People & Culture All People & Culture Aboriginal, First Nations & Native American African American Asian American Children Diversity, Equity & Inclusion Hispanic Lesbian, Gay & Bisexual Men's Interest People with Disabilities Religion Senior Citizens Veterans Women People & Culture Overview View All People & Culture In-Language News Arabic español português Česko Danmark Deutschland España France Italia Nederland Norge Polska Portugal Россия Slovensko Suomi Sverige Overview Distribution by PR Newswire AI Tools Multichannel Amplification Guaranteed Paid Placement SocialBoost All Products General Inquiries Editorial Bureaus Partnerships Media Inquiries Worldwide Offices Hamburger menu Send a Release ALL CONTACT INFO Contact Us 888-776-0942 from 8 AM - 10 PM ET Send a Release Client Login Resources Blog Journalists RSS News in Focus Browse All News Multimedia Gallery Trending Topics Business & Money Auto & Transportation Business Technology Entertain­ment & Media Financial Services & Investing General Business Science & Tech Consumer Technology Energy & Natural Resources Environ­ment Heavy Industry & Manufacturing Telecomm­unications Lifestyle & Health Consumer Products & Retail Entertain­ment & Media Health Sports Travel Policy & Public Interest People & Culture People & Culture Send a Release Client Login Resources Blog Journalists RSS Overview Distribution by PR Newswire AI Tools Multichannel Amplification SocialBoost All Products Send a Release Client Login Resources Blog Journalists RSS General Inquiries Editorial Bureaus Partnerships Media Inquiries Worldwide Offices Send a Release Client Login Resources Blog Journalists RSS Boca Woods Country Club's Director of Operations Receives Prestigious Professional Designation News provided by Boca Woods Country Club Apr 28, 2025, 07:55 ET Share this article Share to X Share this article Share to X BOCA RATON, Fla. , April 25, 2025 /PRNewswire/ -- Kyle Hillhouse , CCM, Director of Operations of the Boca Woods Country Club in Boca Raton, Florida , has been awarded with the Certified Club Manager (CCM) designation by the Club Management Association of America (CMAA). The CCM designation indicates that a club management professional has completed a rigorous course of study and training and shows a dedication to proficiency and expertise in club management. Approximately 1,500 CMAA members hold this prestigious designation. Director of Operations Kyle Hillhouse pictured with General Manager David Sweet during a club celebration. \"Two thumbs up for Easter! Director of Operations Kyle Hillhouse brings the holiday spirit as the Easter Bunny, ready for takeoff at the Club's festive helicopter arrival.\" \"Director of Operations Kyle Hillhouse provides exceptional service with a smile, engaging with members during an elegant dinner event.\" Boca Woods Country Club's Director of Operations Receives Prestigious Professional Designation Post this Established in 1965, the CCM designation is the hallmark of professionalism in club management. It is a valuable, internationally recognized, and widely-respected mark of an individual's long-term commitment to professional development and the club industry. In order to receive the CCM designation, one must invest time in specified educational requirements through the Business Management Institutes, attend the World Conference on Club Management, and maintain activity within their local chapter. After these conditions have been met, the individual must pass the CCM Exam. Kyle was approved by the Certification Committee of CMAA after successfully passing an extensive certification examination on club operations. He/she joins more than 1,500 club managers worldwide who have attained this hallmark of professionalism in club management.  Through the Certified Club Manager designation, CMAA encourages the education and advancement of its members and assists club officers and members in securing the most efficient and successful club operations available. About Boca Woods Country Club Boca Woods Country Club is an established Residential Equity Club located in Boca Raton , Florida.  Since 1986 Boca Woods has provided residents with lifestyle amenities that have grown to include two championship golf courses, seven har-tru tennis courts, four pickleball courts with lights for night play, an expansive practice facility including a lighted putting green, 10,000 square feet of state-of-the-art fitness facilities, fully-functioning ai-driven zoom rooms for meetings and multiple dining venues.  The Club is more than its amenities:  it is a Community of people who care for each other and share common interests. Boca Woods is committed to continuous growth and improvement, exemplified by Club's investment in continuing education at all levels within the Organization.  All-team educational events over the years have featured keynote speakers such as Kelly Merbler , Andy Stangenberg , John DiJulius , Corey Saban and others – helping the team unify their efforts toward creating wonderful Member experiences and strengthening connection with the shared values represented through CHARACTER.  For more information follow Boca Woods on LinkedIn, Facebook and Instagram. About CMAA Founded in 1927, the Club Management Association of America (CMAA) is the largest professional association for managers of membership clubs with 6,800 members throughout the US and internationally. Our members contribute to the success of more than 2,500 country, golf, athletic, city, faculty, military, town, and yacht clubs. The objectives of the Association are to promote relationships between club management professionals and other similar professions; to encourage the education and advancement of members; and to provide the resources needed for efficient and successful club operations. Under the covenants of professionalism, education, leadership, and community, CMAA continues to extend its reach as the leader in the club management practice. CMAA is headquartered in Alexandria, VA , with 42 professional chapters and more than 40 student chapters and colonies. Learn more at cmaa.org . Contact: Meg Friedlander [email protected] 561-487-2800; 147 SOURCE Boca Woods Country Club WANT YOUR COMPANY'S NEWS FEATURED ON PRNEWSWIRE.COM? 440k+ Newsrooms & Influencers 9k+ Digital Media Outlets 270k+ Journalists Opted In GET STARTED × Modal title Also from this source Boca Woods Country Club: Easter Egg Hunt a Resounding Success! Boca Woods Country Club hosted a spectacular Easter egg hunt on April 20th, providing a memorable experience for its members and their families. The... Grand Opening of the Rees Jones \"Woods\" golf course announced at Boca Woods Country Club Boca Woods Country Club is thrilled to announce the grand opening of its newly redesigned Woods golf course. This momentous occasion took place on... More Releases From This Source Explore Residential Real Estate Real Estate Hotels and Resorts Travel News Releases in Similar Topics Contact PR Newswire Call PR Newswire at 888-776-0942 from 8 AM - 9 PM ET Chat with an Expert Contact Us General Inquiries Editorial Bureaus Partnerships Media Inquiries Worldwide Offices Products For Marketers For Public Relations For IR & Compliance For Agency All Products About About PR Newswire About Cision Become a Publishing Partner Become a Channel Partner Careers Accessibility Statement Global Sites APAC APAC - Simplified Chinese APAC - Traditional Chinese Brazil Canada Czech Denmark Finland France Germany India Indonesia Israel Italy Japan Korea Mexico Middle East Middle East - Arabic Netherlands Norway Poland Portugal Russia Slovakia Spain Sweden United Kingdom Vietnam My Services All New Releases Platform ProfNet Data Privacy Do not sell or share my personal information : Submit via [email protected] Call Privacy toll-free: 877-297-8921 Contact PR Newswire Products About My Services All News Releases Platform ProfNet Call PR Newswire at 888-776-0942 Terms of Use Privacy Policy Information Security Policy Site Map RSS Cookies Copyright © 2025 Cision US Inc."
    },
    {
      "url": "https://bocaratonobserver.com/locations/boca-woods-country-club/",
      "text": "Boca Woods Country Club - bocaratonobserver.com Skip to main content Search Subscribe facebook instagram RSS Culture Buzz Destinations Features Style Wellness Food & Drink Bites Cheers Chef Profile Readers’ Choice Restaurant Guide Restaurant News Review Community Around Town Community News Flash Giving Back La Vida Boca Happenings Calendar Editor's Corner Out 'N' About Guides Charity Country Clubs Education Top Docs Top Lawyers Visitors Profiles Country Club Collection Cuisine Scene Health Care Heroes Inspired Home Men On The Move Power Players Professional Edge Top Docs Top Lawyers Wonder Women Fresh Picks Home Boca Woods Country Club Boca Woods Country Club 10471 Boca Woods Lane , Boca Raton , Florida 33428 Print Video Photos Map × 1 of 7 × 2 of 7 × 3 of 7 × 4 of 7 × 5 of 7 × 6 of 7 × 7 of 7 Prev Next Nearby Nearby Events Address 10471 Boca Woods Lane , Boca Raton , Florida 33428 Phone 561-487-2800 Visit Website A Private Boca Raton Country Club Boca Woods Country Club welcomes members to an upscale and active lifestyle set in a relaxed and comfortable country club setting. It's a family friendly community where neighbors become friends and friends become family.  Members embrace a complete lifestyle with an array of resort-style amenities including 36-holes of spectacular golf, 8 Har Tru tennis courts, modern Fitness Center, card rooms and an elegant-contemporary clubhouse for dining and socializing. Lifelong friendships are made while enjoying a life well lived. In an effort to expand and upgrade the services and amenities available to our members, Boca Woods Country Club has developed a comprehensive Facilities Enhancement Plan. The heart of the Plan is a new building, which will be located on the site of the existing cart barn building. This building will feature: A new state of the art Fitness Center comprised of exercise studios, gym, spin room, laundry, lounges and multi-purpose areas. A Spa with treatment rooms for massage and space for a physical therapy area, a salon, lounges, steam rooms and saunas. New men's and women's locker and bath facilities with lounges, shoe cleaning services and showers. New golf and tennis operations center with pro shops, fitting rooms and staff offices. Cart barn with golf cart staging and club cleaning areas. Administrative offices and reception area In addition, our redesigned clubhouse will allow for a new entry lobby, bathrooms, expanded and properly designed administrative offices, and much needed conference, meeting and multi-use space. The décor throughout the new and renovated areas will contain modern finishes and details and abundant natural light. In addition, tailored functional and aesthetic finishes are planned for each of the individual areas as appropriate. Amenities And Services: Golf: The Lakes Course was designed by Karl Litten who apprenticed to one of the greatest golf course architects, Robert von Hagge. Recently redesigned by Kipp Schulties, the Lakes Course tests the golfer's skill as it brings water into play on 15 of its 18 holes. It is a beautifully landscaped course with a number of doglegs allowing for high risk/reward shot making. The newly renovated Woods Course was the first of the two courses built at Boca Woods Country Club. It was designed by golf course architect, Joe Lee, who has designed over 200 world-class championship golf courses including the famous Blue Monster at the Doral Resort in Miami, Florida.  The course is characterized by gentle doglegs, elevated, fast sloping greens and the strategic placement of numerous bunkers throughout its 18 broad fairways maintained in excellent condition. Tennis: 7 Har-Tru Courts with 4 lit for evening play, 2 Pickleball Courts Fitness Center: Members enjoy the convenience of a workout in the Club’s fitness facility replete with state-of-the-art equipment, a weight room and cardio studio. Our experienced staff managed by our Certified Training Director will help you achieve your fitness goals. Take advantage of expert professional instruction, personal training and massage therapy. Weekly group fitness classes are complimentary.  Get fit with Pilates, yoga, Boot Camp, Zumba or Water Aerobics classes.  With a variety of exercise options utilizing the latest equipment and an outdoor heated swimming pool, it’s easy to live well and maintain a healthy lifestyle at Boca Woods. Dining: Our innovative culinary team brings passion and acclaimed experience to Boca Woods Country Club. The results are a 5-star dining experience in the sophisticated ambiance of a private club. Enjoy the warm and friendly attitude of our professional, well-trained staff. Boca Woods is a club where members are greeted by name and appreciate an exceptional level of service in a relaxed dining atmosphere. The entire staff is dedicated to providing an outstanding experience for you and your guests. The Dining Room and Sunset Terrace: Savor dinner and enjoy a show in our Club Dining Room, or unwind on the Sunset Terrace, with panoramic golf vistas. The Bar: Enjoy craft cocktails and happy hour offered daily. Try Boca Woods house-made, barrel aged whiskey in your next Old Fashioned or Manhattan. Membership Information: To learn more about Boca Woods Country Club, please contact our Director of Membership & Marketing, Adria Worthington, at membership@bocawoodscc.com or 561-487-2800 ext. 147. Back to Search Results Tags Golf Tennis Tweets by @https://twitter.com/bocawoodscc?lang=en 7700 Congress Ave., Suite 3115 Boca Raton, FL 33487 561-982-8960 info@bocaratonobserver.com About Team Advertise Sponsorships Awards Issue Archive Subscribe Careers Contact Privacy Policy Terms © 2024 A&A Publishing Corp Built with Metro Publisher™"
    },
    {
      "url": "https://www.bocawoodscc.com/meet-the-team",
      "text": "Meet the Team | Boca Woods Country Club Experts About the Club Membership Request Information Meet the Team Philanthropy Lifestyle Community Overview Social & Clubs Real Estate Events & Videos Club Tour Golf The Lakes Course The Woods Course Meet our Golf Pros Racquet Sports Tennis Pickleball Bocce Meet our Racquet Sports Team Wellness Fitness Spa Services Meet our Wellness Team Dining Overview Meet our F&B Team Contact Us Get in Touch Directions Careers image Menu About the Club Membership Request Information Meet the Team Philanthropy Lifestyle Community Overview Social & Clubs Real Estate Events & Videos Club Tour Golf The Lakes Course The Woods Course Meet our Golf Pros Racquet Sports Tennis Pickleball Bocce Meet our Racquet Sports Team Wellness Fitness Spa Services Meet our Wellness Team Dining Overview Meet our F&B Team Contact Us Get in Touch Directions Careers image Member Login Meet our F&B Team CULINARY STAFF Jeffrey Terentieff Executive Chef 561.487.2800 ext: 126 Originally born and raised in Connecticut, Chef Jeff Terentieff hails from a family deeply rooted in the food and beverage industry. After a decorated service in the U.S. Army, he attended The Culinary Institute of America. Relocating to Boca Raton in 1999, Jeff continued to carve his path in upscale restaurants. In 2006, he made the leap into the world of country clubs starting at Boca West Country Club, and quickly working his way up to the role of Executive Sous Chef. After 10 years he was offered his first Executive chef position at Gleneagles Golf & Country Club in Delray Beach and then at Aberdeen Golf & Country Club in Boynton Beach. Most recently, Jeff returned to Boca West, overseeing a substantial $13 million annual F&B operation, and playing a pivotal role in the $70 million clubhouse renovation. Jeff currently resides in East Boca with his 3 young children. He loves to cook at home as well as engulf himself in all things related. Jeff is an avid golfer, active church member, gym fanatic, and lover of all things outdoors. Rowan Newman Executive Sous Chef 561.487.2800 ext: 127 Rowan Newman joined Boca Woods in 2021. He has almost 20 years of experience working in Palm Beach County Country Clubs. He started his career at Boca West Country Club as an international employee from Capetown, South Africa. This is where he worked his way into a management training program that allowed him to stay on staff year-round. He remained at Boca West for nearly ten years, where he gained the knowledge to work every outlet of the seven fullservice restaurants on site, his favorite being the fine dining steak house. When given the opportunity to further his career, Rowan moved to Hunters Run Country Club in Boynton Beach in 2013. This is where he began broadening his knowledge of food, menu writing, and teamwork as a Sous Chef. He remained at Hunters Run until now, and he is excited to be a part of such a talented management team that is so passionate about their crafts. He looks forward to adding his expertise to the group. Rowan is a Boca Raton resident where he lives with his wife and children. Devlin Page Director of Dining Operations [email protected] (561) 487-2800 ext.143 Devlin Wilkie-Page is an experienced Senior Food and Beverage Manager with nearly a decade in the hospitality industry. His career began in the United States under the H2B visa program at Gleneagles Country Club, laying a strong foundation for his growth in the field. Over the years, Devlin has gained valuable experience across prestigious clubs, including Ridgewood Country Club, the River Club, and the Atlanta Athletic Club, managing diverse dining and event operations. Serving as Senior Food and Beverage Manager at the Atlanta Athletic Club in Georgia, Devlin oversees menu development, staff recruitment, inventory management, and member relations, with a focus on financial efficiency and quality service. His expertise in banquet and event management, relationship-building, and strategic operations is complemented by his active involvement in the Georgia Chapter of the Club Management Association of America. Devlin is excited to bring his experience and dedication to Boca Woods as he joins the team, eager to deliver high-quality dining experiences and build meaningful relationships with Members. Jordan Findlay Food& Beverage Operations Manager [email protected] (561) 487-2800 ext.135 Jordan Findlay, hailing from South Africa, embarked on his American journey on a H2B visa. His rise in the hospitality industry is marked by his tenure at various esteemed country clubs on the East Coast of the USA. Starting as a server assistant in 2016, Jordan's dedication and passion led him to ascend in the industry through the roles of Server, Captain, Food and Beverage Supervisor which all built is foundation to his current role as Operations Manager, where he now oversees complex operations and ensures excellence in service. With a keen focus on fine dining experiences, Jordan grew his expertise with renowned establishments such as Boca West Country Club, Ibis Country Club, Baltusrol Golf Club, and more. His journey reflects a commitment to creating unforgettable events, delivering exceptional service, and orchestrating lively parties. Jordan's passion for learning and advancing his education is a driving force in his career. Committed to personal and professional growth, he continues to seek opportunities to expand his knowledge and skills in the dynamic field of hospitality. His continuous expansion of his education sets the stage for a promising and evolving career in the industry. Want to contact our Dining Team? REQUEST MORE INFORMATION Please fill out our online form to learn more about Boca Woods Country Club. Click here to Contact Us 10471 Boca Woods Ln. Boca Raton, FL 33428 Phone: 561.487.2800 Member Login Contact Us Careers Map & Directions © Boca Woods Country Club Powered by Northstar Technologies Follow Us Member Login"
    },
    {
      "url": "https://www.bocaratonrealestate.com/boca-woods/",
      "text": "Boca Woods Country Clubs Homes For Sale | Boca Raton Real Estate HOME Login / Register contact us 561.998.9015 ENGLISH 中文 FRANÇAIS 한국어 ITALIANO 日本語 DEUTSCH PORTUGUÊS РУССКИЙ ESPAÑOL TIẾNG VIỆT Champagne & Parisi Search Homes Condos Townhomes Agents Resources Contact Boca Raton Real Estate Search Home Homes Boca Woods Boca Woods Country Club Boca Woods is an exclusive, gated country club community located in West Boca Raton, FL. Known as one of the premier country clubs in all of South Florida, this well-established private community is a tropical paradise with an exceptional location, a beautiful selection of luxurious homes, and world-class amenities. Boca Woods Homes for Sale Boca Woods Country Club September 10, 2025 19 Listed 59 Avg. DOM $402.37 Avg. $ / Sq.Ft. $799,000 Med. List Price Gallery Photo View List Map Map View Get Alerts! Refine Results Price (Highest) Price (Lowest) Days on Site (Newest) Days on Site (Oldest) Bedrooms (Most) 19 Properties Page 1 of 2 $599,000 Neighborhood: Boca Woods Country Club 4 21380 Bridge View Drive Boca Raton,  FL 33428 3 Beds 2 Baths 2,000 Sq.Ft. 1985 Year Built 5 Days on Site R11121633 MLS MLS #: R11121633 $999,000 Neighborhood: Boca Woods Country Club 4 10984 Boca Woods Lane Boca Raton,  FL 33428 3 Beds 2 F 1 1/2 Baths 2,412 Sq.Ft. 1986 Year Built 5 Days on Site R11121770 MLS MLS #: R11121770 $490,000 Neighborhood: Boca Woods Cc 21392 Bridge View Drive Boca Raton,  FL 33428 3 Beds 2 Baths 2,020 Sq.Ft. 1986 Year Built 9 Days on Site R11120361 MLS MLS #: R11120361 $1,585,000 Neighborhood: Boca Woods Country Club 10182 Boca Woods Ln Boca Raton,  FL 33428 4 Beds 2 F 1 1/2 Baths 2,643 Sq.Ft. 1981 Year Built 12 Days on Site F10524197 MLS MLS #: F10524197 $2,695,000 Neighborhood: Boca Woods Country Club 8 11164 Boca Woods Lane Boca Raton,  FL 33428 3 Beds 4 F 1 1/2 Baths 4,200 Sq.Ft. 1988 Year Built 17 Days on Site R11118393 MLS MLS #: R11118393 $3,475,000 Neighborhood: Boca Woods Country Club 1 10290 Silver Lake Drive Boca Raton,  FL 33428 4 Beds 5 F 1 1/2 Baths 2,937 Sq.Ft. 1988 Year Built 19 Days on Site R11118126 MLS MLS #: R11118126 $600,000 Neighborhood: Boca Woods Country Club 1 10255 Sunset Bend Drive Boca Raton,  FL 33428 3 Beds 2 Baths 2,352 Sq.Ft. 1985 Year Built 22 Days on Site R11117117 MLS MLS #: R11117117 $699,000 Neighborhood: Boca Woods Country Club 11434 Boca Woods Lane Boca Raton,  FL 33428 3 Beds 2 Baths 2,018 Sq.Ft. 1986 Year Built 24 Days on Site R11116807 MLS MLS #: R11116807 $549,000 Neighborhood: Boca Woods Country Club 5 11162 Clover Leaf Circle Boca Raton,  FL 33428 3 Beds 2 Baths 2,008 Sq.Ft. 1984 Year Built 27 Days on Site R11116119 MLS MLS #: R11116119 $559,000 Neighborhood: Boca Woods Country Club 11146 Highland Circle Boca Raton,  FL 33428 3 Beds 2 Baths 2,008 Sq.Ft. 1982 Year Built 51 Days on Site R11109513 MLS MLS #: R11109513 $850,000 Neighborhood: Boca Woods Country Club 10718 Boca Woods Lane Boca Raton,  FL 33428 3 Beds 2 F 1 1/2 Baths 2,442 Sq.Ft. 1983 Year Built 58 Days on Site R11107757 MLS MLS #: R11107757 $1,095,000 Neighborhood: Boca Woods Country Club 4 10791 River Glenn Drive Boca Raton,  FL 33428 3 Beds 2 F 1 1/2 Baths 2,726 Sq.Ft. 1991 Year Built 67 Days on Site R11105140 MLS MLS #: R11105140 Prev 1 2 Next Features of Boca Woods Homes Constructed from 2001 to 2003, Boca Woods consists of 650 beautiful, single-family homes offering a variety of designs and floor plans from which to choose . These elegant one- and two-story homes range in size from 1,500 to over 3,000 square feet of luxurious living space and are complete with many desirable features. Some of the features available in homes for sale in Boca Woods Country Club include: Upgraded tile and hardwood flooring Designer kitchens with stainless steel appliances Granite countertops in the kitchens and baths Private swimming pools Beautiful outdoor living spaces Two- to three-car garages All homes in Boca Woods offer gorgeous views of rolling green fairways, tranquil lakes, and the surrounding nature preserve . With a wide variety of unique-styled homes, Boca Woods offers something for every type of home buyer. Amenities At Boca Woods Boca Woods provides members with the ultimate country club lifestyle, complete with a host of world-class amenities that can be enjoyed year-round. For the tennis enthusiasts, Boca Woods features eight Har-Tru tennis courts , four of which are lighted for evening play, as well as free weekly clinics. There are also group and private lessons available, which are conducted by USPTA certified tennis professionals. Boca Woods also has two 18-hole championship golf courses both of which are unique but equally challenging for golfers of every level. The Lakes Course was designed by famed golf course architect Karl Litten, and The Woods Course was designed by legendary architect Joe Lee. Naturally, Boca Woods provides expert golf instruction and free weekly clinics with the P.G.A professional staff, as well as year-round tournaments. Boca Woods also has an expansive driving range, a newly re-designed chipping area, and a practice sand bunker for golfers who want to work on improving their game. Boca Woods has a newly-expanded, state-of-the-art Fitness Center complete with top-of-the-line cardio and weight training equipment, as well as his and her locker rooms. The fitness center offers a variety of classes such as aerobics, Pilates, Zumba, and Yoga, as well as private personal training and professional massage therapy. The beautiful clubhouse at Boca Woods offers a variety of dining options sure to impress even those with the most discerning of palates. From quick and casual to formal dining options to formal, the executive chef takes great pride in the menu, always offering new and innovative cuisine in addition to traditional favorites. Boca Woods also offers an award-winning wine program recognized with an Award of Merit by the CMAA International Wine Society, making it one of the 50 clubs nationwide to receive this recognition. Regarding activities and fun, these are endless at Boca Woods , with a host of social events and activities scheduled throughout the year. From weekly organized games and card competitions in the men's and women's card rooms to formal galas and evening events, Boca Woods provides a diverse social calendar that keeps members engaged and encourage friendship and socialization within the community. Boca Woods Location Boca Woods located in a convenient West Boca Raton location, between Glades and Palmetto Park Road, just west of Lyons Road. The community is situated mere minutes from some of the best that South Florida has to offer, such as: Pristine Beaches Natural Parks Fine Restaurants Mizner Park Boca Raton Resort & Club Gumbo Limbo Nature Center Boca Town Center Mall Boca Raton Museum of Art iPic movie theaters I95 and Florida's Turnpike Some of the best schools in the area Overall, living in Boca Woods provides you with a luxurious lifestyle, a warm, peaceful atmosphere, and the ideal location that anyone would desire in country club living. If would like to learn more about Boca Woods homes for sale or would like additional information about any of the other Boca Raton country club communities , please call us at 561-998-9015 . You may also contact us by completing the brief form provided below and one of our Boca Raton real estate experts will reach out to assist you promptly. We at Champagne & Parisi Real Estate are committed to providing the highest level of professional real estate services & unparalleled customer service when working to help our clients achieve their personal real estate goals. We look forward to having the opportunity to assist you in finding your next dream home in Boca Raton, FL! Contact Us About Boca Woods First Name: Last Name: Email Address: Phone: Questions / Comments: Submit By proceeding, you expressly consent to receive texts at the number you provided, including marketing, from Champagne & Parisi Real Estate about real estate related matters, but not as a condition of purchase. Message frequency varies. You can text Help for help and Stop to cancel. You also agree to our Terms of Service and to our Privacy Policy regarding the information relating to you. Message and data rates may apply. Additionally, you expressly consent to receiving calls at the number you provided, including marketing by auto-dialer, pre-recorded or artificial voice, and email, from  Champagne & Parisi Real Estate about real estate related matters, but not as a condition of purchase. This consent applies even if you are on a corporate, state or national Do Not Call list. Messages may be processed by an automated system. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Other Boca Raton Country Club Developments Boca Country Club Boca Greens Boca Grove Boca Lago Boca Pointe Boca West Boca Woods Bocaire Broken Sound Polo Club Royal Palm Yacht & Country Club St. Andrews Country Club Stonebridge Woodfield Country Club navigation Click here to view all Boca Raton residential neighborhoods . Boca Raton Neighborhoods Boca Bath & Tennis Boca Falls Boca Marina Yacht Club Long Lake Estates Millpond New Floresta Newport Bay Club Oaks at Boca Raton Old Floresta Palm Beach Farms Parkside Royal Oak Hills Saturnia Seasons Timbercreek Woodfield Hunt Club View All Neighborhoods Featured Home Searches All Homes Newest Listings Pool Homes Country Clubs Schools No HOA Homes New Construction Price Reductions Waterfront Homes BoCa Raton Market Stats Pricing trends, average days on market, and more, updated every day. View All stats What's My Home's Value? Our professional analysis includes data on recent sales and current market trends. Find Out Now Search Homes Condos Townhomes Agents Blog Resources Contact Site Map Property Listings Champagne & Parisi Boca Raton Real Estate - Champagne & Parisi Real Estate 561.998.9015 | info@bocaratonrealestate.com Accessibility | Terms of Service | Privacy Policy | DMCA Notice © Copyright 2025 Champagne & Parisi Real Estate"
    }
  ]
}