{
  "fuentes": [
    {
      "url": "https://www.bocawoodscc.com/overview-contact",
      "email": "administrativeoffices@bocawoodscc.com"
    },
    {
      "url": "https://www.bocawoodscc.com/overview-contact",
      "email": "hrbw@bocawoodscc.com"
    },
    {
      "url": "https://www.bocawoodscc.com/overview-contact",
      "email": "jmoe@bocawoodscc.com"
    },
    {
      "url": "https://www.bocawoodscc.com/overview-contact",
      "email": "membership@bocawoodscc.com"
    },
    {
      "url": "https://www.bocawoodscc.com/overview-contact",
      "email": "tennis@bocawoodscc.com"
    },
    {
      "url": "https://naplesgolfguy.com/golf-communities/boca-royale-golf-country-club/",
      "email": "matt@naplesgolfguy.com"
    },
    {
      "url": "https://naplesgolfguy.com/golf-communities/boca-royale-golf-country-club/",
      "email": "info@naplesgolfguy.com"
    }
  ],
  "mails": [
    "administrativeoffices@bocawoodscc.com",
    "hrbw@bocawoodscc.com",
    "info@naplesgolfguy.com",
    "jmoe@bocawoodscc.com",
    "matt@naplesgolfguy.com",
    "membership@bocawoodscc.com",
    "tennis@bocawoodscc.com"
  ],
  "nombre_sitio": "bocaroyale.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.bocawoodscc.com/overview-contact",
      "text": "Contact Boca Woods Country Club | Exclusive Golf & Amenities About the Club Membership Request Information Meet the Team Philanthropy Lifestyle Community Overview Social & Clubs Real Estate Events & Videos Club Tour Golf The Lakes Course The Woods Course Meet our Golf Pros Racquet Sports Tennis Pickleball Bocce Meet our Racquet Sports Team Wellness Fitness Spa Services Meet our Wellness Team Dining Overview Meet our F&B Team Contact Us Get in Touch Directions Careers image Menu About the Club Membership Request Information Meet the Team Philanthropy Lifestyle Community Overview Social & Clubs Real Estate Events & Videos Club Tour Golf The Lakes Course The Woods Course Meet our Golf Pros Racquet Sports Tennis Pickleball Bocce Meet our Racquet Sports Team Wellness Fitness Spa Services Meet our Wellness Team Dining Overview Meet our F&B Team Contact Us Get in Touch Directions Careers image Member Login Get in Touch We'd Love To Hear From You Get in Touch with Boca Woods Learn more about private country club life at Boca Woods by contacting Membership. Request more Information Clubhouse 561.487.2800 Membership Office 561.487.2800 > Ext:147 Pro Shop 561.487.2800 > Ext:131 Racquet Sports Office 561.487.2800 > Ext:134 Human Resources 561.487.2800 > Ext:118 10471 Boca Woods Ln. Boca Raton, FL 33428 Phone: 561.487.2800 Member Login Contact Us Careers Map & Directions © Boca Woods Country Club Powered by Northstar Technologies Follow Us Member Login"
    },
    {
      "url": "https://naplesgolfguy.com/golf-communities/boca-royale-golf-country-club/",
      "text": "Boca Royale Golf and Country Club - Naples Golf Homes | Naples Golf Guy Property Search Golf Communities Naples Bonita Springs / Estero Fort Myers Greater Sarasota Bundled Equity Luxury Buyers Sellers Discover SWFL FAQ’s Dinning & Entertainment Shopping Beaches Calendar of Events Golf Accommodations Healthcare Arts & Attractions About Us Naples Golf Guy Team Downing Frye Realty Contact Us Testimonials Blog Property Search Golf Communities Naples Bonita Springs / Estero Fort Myers Greater Sarasota Bundled Equity Luxury Buyers Sellers Discover SWFL FAQ’s Dinning & Entertainment Shopping Beaches Calendar of Events Golf Accommodations Healthcare Arts & Attractions About Us Naples Golf Guy Team Downing Frye Realty Contact Us Testimonials Blog 239.370.0892 info@naplesgolfguy.com Back to Greater Sarasota Golf Communities Boca Royale Golf and Country Club Boca Royale Golf and Country Club is a semi-private golf club in Englewood, Florida. This gated golf community features an 18-hole golf course renovated in 2024 by Gordy Lewis. Memberships are available, or you can pay as you play. In addition to the golf, members have access to first-class amenities. Amenities include Tennis, Pickleball, Fitness Center, Spa, and large community pool with lap lanes. Also, the elegant, recently renovated clubhouse in the community’s center offers fine dining and a more casual experience. Boca Royale features a unique blend of newer construction homes with old Florida charm. Additionally, its location is just minutes away from stunning Florida beaches, new dining and shopping, and plenty of healthcare options. Bottom Line The Naples Golf Guy Team specializes in helping buyers and sellers with their real estate needs in golf communities. Contact us today. Location: Englewood, Florida Club Type: Semi-Private Country Club Membership Type: Non-Equity Real Estate Homes for Sale $360,000 - $1,600,000 View Homes For Sale The Naples Golf Guy Team has 20 years of experience helping Buyers and Sellers with their real estate needs in Southwest Florida. Call, text or email us today for more information. Stay informed with automatic property alerts… Learn what your home is worth… Sign up for our monthly market report. Membership Information Maximum Number of Golf Memberships 400 Is Membership Required? Yes Non-Resident Memberships Available? Yes Membership Fees Golf Membership Initiation Fee: $25,000 Annual Golf Dues: $7,740 Social or Club Membership Initiation Fee: $1,000 Annual Social Dues: $1,558 Please be aware, other membership options may be available. Additional fees such as capital assessments, a food and beverage minimum, trail fee or taxes may apply. Please feel free to contact us for additional information. Golf Course Information Number of Courses 1 (18 Holes) Caddies Available No Practice Range Yes Own your own cart Yes Course Ratings / Scorecards Renovated 2024 Golf Course Architect Gordy Lewis Par: 71 Holes: 18 Yards Diamond 6640 Platinum 6124 Gold 5485 Ladies Tees Gold 5485 Saphire 4577 Ruby 3864 Amenities Gated community One Golf Course Club house Community Pool Tennis Pickleball Fitness center Where is Boca Royale Golf and Country Club Located Boca Royale Golf and Country Club 1601 Englewood Road Englewood, Florida 34223 941.475.6464 Visit Club Website Back to Greater Sarasota Golf Communities Note: We make every effort to make sure our information for this Golf Club is current and accurate. Information about the tees and membership change over time. Please feel free to email us at info@naplesgolfguy.com if you see any information that needs to be corrected. Stay in the know by subscribing to our newsletter Enter your email address 239.370.0892 info@naplesgolfguy.com ©2025 Naples Golf Guy Privacy Policy Accessiblity made by exploritech We serve cookies to analyze traffic and customize content on this site. Privacy & Cookie Policy Got It! Manage consent Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website, anonymously. Cookie Duration Description cookielawinfo-checkbox-analytics 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\". cookielawinfo-checkbox-functional 11 months The cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Functional\". cookielawinfo-checkbox-necessary 11 months This cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\". cookielawinfo-checkbox-others 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other. cookielawinfo-checkbox-performance 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Performance\". viewed_cookie_policy 11 months The cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Functional Functional Functional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features. Performance Performance Performance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. Advertisement Advertisement Advertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads. Others Others Other uncategorized cookies are those that are being analyzed and have not been classified into a category as yet. SAVE & ACCEPT"
    }
  ]
}