{
  "fuentes": [
    {
      "url": "https://bluesfestivalguide.com/boca-raton-fl-blues-festival-boca-blues-samantha-fish-tab-benoit-vanessa-collier-tommy-castro-morenov-16-17-2024/",
      "email": "info@bluesfestivalguide.com"
    },
    {
      "url": "https://bluesfestivalguide.com/boca-raton-fl-blues-festival-boca-blues-samantha-fish-tab-benoit-vanessa-collier-tommy-castro-morenov-16-17-2024/",
      "email": "info@latitude88.com"
    },
    {
      "url": "https://www.bocabluesfest.com/about",
      "email": "info@latitude88.com"
    },
    {
      "url": "https://www.beaconfestival.net/contact-us",
      "email": "info@beaconfestival.net"
    },
    {
      "url": "https://www.beaconfestival.net/contact-us",
      "email": "trade@beaconfestival.net"
    },
    {
      "url": "https://bluesfestivalguide.com/team/",
      "email": "heather_p@bluesfestivalguide.com"
    },
    {
      "url": "https://bluesfestivalguide.com/team/",
      "email": "info@bluesfestivalguide.com"
    },
    {
      "url": "https://bluesfestivalguide.com/team/",
      "email": "michelelundeen@live.com"
    }
  ],
  "mails": [
    "heather_p@bluesfestivalguide.com",
    "info@beaconfestival.net",
    "info@bluesfestivalguide.com",
    "info@latitude88.com",
    "michelelundeen@live.com",
    "trade@beaconfestival.net"
  ],
  "nombre_sitio": "bocabluesfest.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://bluesfestivalguide.com/boca-raton-fl-blues-festival-boca-blues-samantha-fish-tab-benoit-vanessa-collier-tommy-castro-morenov-16-17-2024/",
      "text": "Boca Raton, FL Blues Festival ~ BOCA BLUES Skip to content New Orleans 2025 Crescent City Blues & BBQ Festival October 10-12, 2025 with Devon Allman’s Blues Summit, Bobby Rush, Tab Benoit, and more — New Orleans 2025 Crescent City Blues & BBQ Festival October 10-12, 2025 with Devon Allman’s Blues Summit, Bobby Rush, Tab Benoit, and more — New Orleans 2025 Crescent City Blues & BBQ Festival October 10-12, 2025 with Devon Allman’s Blues Summit, Bobby Rush, Tab Benoit, and more — New Orleans 2025 Crescent City Blues & BBQ Festival October 10-12, 2025 with Devon Allman’s Blues Summit, Bobby Rush, Tab Benoit, and more — New Orleans 2025 Crescent City Blues & BBQ Festival October 10-12, 2025 with Devon Allman’s Blues Summit, Bobby Rush, Tab Benoit, and more — New Orleans 2025 Crescent City Blues & BBQ Festival October 10-12, 2025 with Devon Allman’s Blues Summit, Bobby Rush, Tab Benoit, and more — New Orleans 2025 Crescent City Blues & BBQ Festival October 10-12, 2025 with Devon Allman’s Blues Summit, Bobby Rush, Tab Benoit, and more — New Orleans 2025 Crescent City Blues & BBQ Festival October 10-12, 2025 with Devon Allman’s Blues Summit, Bobby Rush, Tab Benoit, and more — New Orleans 2025 Crescent City Blues & BBQ Festival October 10-12, 2025 with Devon Allman’s Blues Summit, Bobby Rush, Tab Benoit, and more — New Orleans 2025 Crescent City Blues & BBQ Festival October 10-12, 2025 with Devon Allman’s Blues Summit, Bobby Rush, Tab Benoit, and more Home News Videos Music Calendar SUBMIT FESTIVAL/EVENT 2025 Festivals/Events Upcoming Festival/Event Search Festival/Event Festival/Event Archives Links SUBMIT BAND/BUSINESS LINKS Agents-Promoters Art-Photography Band/Artist Site Books Club/Cafe Cruise Festival Producer Hotel Magazines & Newsletters Management Media Services Museums Organizations Production Radio Station Record Label-Agency Schools-Education-Scholarships Societies Travel Vendor/Shop Venue-Promoter-Calendar The Magazine 2025 2024 2023 2022 2021 2020 2019 2018 2017 2016 2015 2014 2013 2012 Archive Newsletter Advertising Media Kit Print Magazine Rate Card Website Advertising Rate Card e-Guide Rate Card Highlighted Festival Posting Digital Edition Rate Card Social Media Rate Card Featured Video Rate Card Custom E-Blast Rate Card MP3 Rate Card Sponsorship Publicity Services About Our Story Team Shout Outs Link Us Up Contact Us Privacy and Legal Info Menu Close Home News Videos Music Calendar SUBMIT FESTIVAL/EVENT 2025 Festivals/Events Upcoming Festival/Event Search Festival/Event Festival/Event Archives Links SUBMIT BAND/BUSINESS LINKS Agents-Promoters Art-Photography Band/Artist Site Books Club/Cafe Cruise Festival Producer Hotel Magazines & Newsletters Management Media Services Museums Organizations Production Radio Station Record Label-Agency Schools-Education-Scholarships Societies Travel Vendor/Shop Venue-Promoter-Calendar The Magazine 2025 2024 2023 2022 2021 2020 2019 2018 2017 2016 2015 2014 2013 2012 Archive Newsletter Advertising Media Kit Print Magazine Rate Card Website Advertising Rate Card e-Guide Rate Card Highlighted Festival Posting Digital Edition Rate Card Social Media Rate Card Featured Video Rate Card Custom E-Blast Rate Card MP3 Rate Card Sponsorship Publicity Services About Our Story Team Shout Outs Link Us Up Contact Us Privacy and Legal Info Boca Raton, FL Blues Festival ~ BOCA BLUES - Samantha Fish, Tab Benoit, Vanessa Collier, Tommy Castro, more… Nov. 16-17, 2024 - Get Tickets Today! Boca Raton, FL Blues Festival ~ BOCA BLUES – Samantha Fish, Tab Benoit, Vanessa Collier, Tommy Castro, more…Nov. 16-17, 2024 Boca Raton, FL Blues Festival ~ BOCA BLUES – Samantha Fish, Tab Benoit, Vanessa Collier, Tommy Castro, more… Nov. 16-17, 2024 – Get Tickets Today! Latitude-88, Inc. is proud to announce South Florida’s only Blues Festival!  Sunset Cove Amphitheater in Boca Raton, FL. This unique 2-day music festival will feature 10 amazing bands performing nothing but the blues in a beautiful outdoor setting. National acts such as Samantha Fish, Tab Benoit, Vanessa Collier, Tommy Castro, Ally Venable and even Muddy Water’s eldest son – Mud Morganfield from Chicago, to name a few. The festival’s main stage will be set up on a beautiful grass amphitheater field, surrounded by water, with ample standing and sitting space for attendees. Plenty of food and beverage vendors offer a variety of delicious options. Delicious food, full liquor bars and good times with friends all weekend. With a capacity for only 4,000 per day, this is a more intimate setting for blues and music festival fans but packed with huge headline talent! Come out and enjoy this one-of-a-kind event in Boca Raton, FL before the holiday stress. Tickets are $50.00 per day with free re-entry the same day for the ultimate music fest freedom! Ticket info and to purchase online here: www.BocaBluesFest.com/tickets The main festival website: www.BocaBluesFest.com Gates: 10:30 AM to 9:30 PM Both Days. Music starts 12 Noon Both Days! Enjoy the Journey with us… Contact: Latitude-88, Inc. 772-492-6105 info@latitude88.com P.O. Box 691205 Vero Beach, FL 32969 Tags : Samantha Fish , Vannessa Collier Read more articles Previous Post Samantha Fish :: WILD HEART You Might Also Like Greg Nagy :: STRANDED April 23, 2015 Hank Mowery :: EXCUSES PLENTY October 15, 2015 Trinidaddio Blues Fest, 8-26-17, Fabulous Thunderbirds featuring Kim Wilson, John Primer, Alexis Suter! July 20, 2017 Email Us 775-846-8238 Click here for Advertising Rates Sign Up for weekly BLUES FESTIVAL E-GUIDE newsletter! Easy & Free. Packed full of blues news, blues society updates, band tours, \nand of course, dozens of blues festivals, and more.\nExpect to see it in your inbox each Thursday.\nPlease enter your email address below: Subscribe to our Newsletter Email Address Follow Us Latest Blues News Latest Blues News New Orleans 2025 Crescent City Blues & BBQ Festival October 10-12, 2025 with Devon Allman’s Blues Summit, Bobby Rush, Tab Benoit, and more BLACK MOUNTAIN Blues Festival on September 26-28, 2025 in Black Mountain, North Carolina Celebrates Music, Community, and Resilience Blues Rock has a new name…DENNIS JONES! Copyright ©2025 - Blues Festival Guide"
    },
    {
      "url": "https://www.bocabluesfest.com/about",
      "text": "ABOUT | Boca Blues Festival top of page Boca Blues Festival 2024 South Florida's Only Blues Festival HOME LINEUP! TICKETS LODGING ABOUT CONTACT FAQ BAG POLICY More Use tab to navigate through the menu items. EMAIL: info@latitude88.com PHONE: 772-492-6105 Company: Latitude-88, Inc. Mailing address: P.O. Box 691205 Vero Beach, FL 32969 ​ The Boca Blues Festival is a brand that will host its debut annual Blues Festival at the Sunset Cove Amphitheater 20405 Amphitheater Circle Boca Raton, FL 33498 in 2024. ​ A unique 2 day music festival experience combining the love of nothing but the Blues on stage along with delicious foods, beer & full liquor bars and an amazing weekend to remember with friends and family. 10 bands on stage with professional sound and lighting. ​ Lattiude-88, Inc. also produces the Vero Beach, FL Blues Festival and multiple art and cultural events around Florida. © 2024 Boca Blues Festival bottom of page"
    },
    {
      "url": "https://www.beaconfestival.net/contact-us",
      "text": "Contact Us | Beacon Festival top of page Last Beacon EVER!! Home About Us 2024 Tickets Schedule Bands Schedule Kids Zone Schedule Evolution Stage Full Programme of Events Explore Feel Good Area KidsZone Camping Food & Drink Map of the Site 2024 Charity Applications Travel Volunteers Information FAQ's Disability Access Sponsors 2024 Sponsorship Opportunities Contact Us Last One Ever More Use tab to navigate through the menu items. Contact Us We are keen to hear from anyone. Just fill in the form below and one of the team will be in touch. We are all volunteers so it might not be instant but we WILL get back to you. BANDS We are only accepting applications for the Teen Stage, all other stages are complete. Beacon Music Page TRADE STALLS Please use this email - trade@beaconfestival.net and do NOT use the form below. Small Heading Thanks! Message sent. Send 15th-16th June 2018 Watlington Hill Farm © 2022 by Beacon Festival bottom of page"
    },
    {
      "url": "https://bluesfestivalguide.com/team/",
      "text": "Team - Blues Festival Guide Magazine and Online Directory of Blues Festivals Skip to content New Orleans 2025 Crescent City Blues & BBQ Festival October 10-12, 2025 with Devon Allman’s Blues Summit, Bobby Rush, Tab Benoit, and more — New Orleans 2025 Crescent City Blues & BBQ Festival October 10-12, 2025 with Devon Allman’s Blues Summit, Bobby Rush, Tab Benoit, and more — New Orleans 2025 Crescent City Blues & BBQ Festival October 10-12, 2025 with Devon Allman’s Blues Summit, Bobby Rush, Tab Benoit, and more — New Orleans 2025 Crescent City Blues & BBQ Festival October 10-12, 2025 with Devon Allman’s Blues Summit, Bobby Rush, Tab Benoit, and more — New Orleans 2025 Crescent City Blues & BBQ Festival October 10-12, 2025 with Devon Allman’s Blues Summit, Bobby Rush, Tab Benoit, and more — New Orleans 2025 Crescent City Blues & BBQ Festival October 10-12, 2025 with Devon Allman’s Blues Summit, Bobby Rush, Tab Benoit, and more — New Orleans 2025 Crescent City Blues & BBQ Festival October 10-12, 2025 with Devon Allman’s Blues Summit, Bobby Rush, Tab Benoit, and more — New Orleans 2025 Crescent City Blues & BBQ Festival October 10-12, 2025 with Devon Allman’s Blues Summit, Bobby Rush, Tab Benoit, and more — New Orleans 2025 Crescent City Blues & BBQ Festival October 10-12, 2025 with Devon Allman’s Blues Summit, Bobby Rush, Tab Benoit, and more — New Orleans 2025 Crescent City Blues & BBQ Festival October 10-12, 2025 with Devon Allman’s Blues Summit, Bobby Rush, Tab Benoit, and more Home News Videos Music Calendar SUBMIT FESTIVAL/EVENT 2025 Festivals/Events Upcoming Festival/Event Search Festival/Event Festival/Event Archives Links SUBMIT BAND/BUSINESS LINKS Agents-Promoters Art-Photography Band/Artist Site Books Club/Cafe Cruise Festival Producer Hotel Magazines & Newsletters Management Media Services Museums Organizations Production Radio Station Record Label-Agency Schools-Education-Scholarships Societies Travel Vendor/Shop Venue-Promoter-Calendar The Magazine 2025 2024 2023 2022 2021 2020 2019 2018 2017 2016 2015 2014 2013 2012 Archive Newsletter Advertising Media Kit Print Magazine Rate Card Website Advertising Rate Card e-Guide Rate Card Highlighted Festival Posting Digital Edition Rate Card Social Media Rate Card Featured Video Rate Card Custom E-Blast Rate Card MP3 Rate Card Sponsorship Publicity Services About Our Story Team Shout Outs Link Us Up Contact Us Privacy and Legal Info Menu Close Home News Videos Music Calendar SUBMIT FESTIVAL/EVENT 2025 Festivals/Events Upcoming Festival/Event Search Festival/Event Festival/Event Archives Links SUBMIT BAND/BUSINESS LINKS Agents-Promoters Art-Photography Band/Artist Site Books Club/Cafe Cruise Festival Producer Hotel Magazines & Newsletters Management Media Services Museums Organizations Production Radio Station Record Label-Agency Schools-Education-Scholarships Societies Travel Vendor/Shop Venue-Promoter-Calendar The Magazine 2025 2024 2023 2022 2021 2020 2019 2018 2017 2016 2015 2014 2013 2012 Archive Newsletter Advertising Media Kit Print Magazine Rate Card Website Advertising Rate Card e-Guide Rate Card Highlighted Festival Posting Digital Edition Rate Card Social Media Rate Card Featured Video Rate Card Custom E-Blast Rate Card MP3 Rate Card Sponsorship Publicity Services About Our Story Team Shout Outs Link Us Up Contact Us Privacy and Legal Info Kaati – Publisher : We continue to have fun with the Blues Festival Guide magazine, the weekly Blues Festival e-Guide newsletter, and this website, and especially working with the Blues Societies across the nation! I encourage you to become a member, or start a Blues Society in your area… there is power in numbers and we all have to work together to keep America’s original roots music in the forefront of our culture. My background is in magazine publishing, so I produced festival programs for a while and then eventually, the Reggae Festival Guide magazine in 1995 and the Blues Festival Guide magazine in 2003. I hope that you find this website useful for your entertainment planning and be sure to check back often for festival updates! Click here for contact information. Cheryl O’Grady – Sales Manager & Marketing Director : During my childhood in Sacramento, CA, I was exposed to a wide-variety of music because my parents owned a jukebox route that serviced over 80 bars and other establishments. My family’s business activities sparked my interest in people, and the jukebox in the living room hooked me on blues at an early age. I am currently owner of COG Promotions, a privately held promotions business (after retiring with 27 years of service as a Social Worker in Nevada. Moving toward a career in promoting blues was a natural for me. I have been with the Blues Festival Guide (BFG) magazine from its inception and have helped it grow into a respected and highly developed marketing corporation. I have traveled and attended blues festivals across the U.S. enjoying varied festival cultures and am specifically interested in youth involvement at festivals and have obtained a wealth of information to share as a festival consultant. I was one of the founders of the Reno Blues Society (Reno, NV), serving on the RBS Board for seven years and was instrumental in producing over 35 Blues shows featuring headliners including Buddy Guy, Charlie Musselwhite, Koko Taylor and many others. I graduated with a BA in Social Welfare from California State University Sacramento in 1973. As a Social Worker and an RBS Board member I have been involved in fund raising for a variety of charities. I work with festivals, music promoters, musicians, record labels, etc. developing and implementing effective and affordable marketing campaigns. In addition, I’m a true fan of the genre and if you’re trying to get your information to the blues industry or the fans I can help. Michele Lundeen – Blues e-Guide editor : Greetings and thanks for diggin’ the blues! I currently live and perform as a blues singer, songwriter, bandleader in the San Diego, CA area. As a performer, as well as a writer and researcher, I’m into sharing every facet of blues music. I’ve always felt that “blues” is not only about music, but an honest, human expression of life’s trials and tribulations. Soulful and earthy … it cannot be denied. The wealth of history and music that I have discovered over the years has been so enriching and its rewards are a’ plenty. In Nov 2004, I released my debut CD, SONG INSIDE ME featuring 9 self-penned originals out of 12 tracks and some very special guests in the studio with me like slide master Roy Rogers. I’m a founding member and editor of the Reno Blues Society and Blues Lovers United of San Diego and have owned my own graphics/print brokerage since 1985. I represented San Diego in the Blues Foundation’s Intl’ Blues Challenge (IBC) in 2000, am a multiple San Diego Blues Awards “Best Blues” nominee. I’m also active as a presenter/performer in the local Blues In The Schools (BITS) program. My website is www.michelelundeen.com and you can also find my CD, SONG INSIDE ME, at www.cdbaby.com/Lundeen . michelelundeen@live.com Heather Penrod – Administrative Fairy Godmother and Distribution Manager : My immersion in music started at a young age. My grandfather was a musician & my mom played trombone so our house was always full of music. Mom taught me to twist & Jitterbug in the living room. I played flute all the way thru school & picked up enough guitar to play at it. I was General Manager of an awesome Roadhouse in Verdi, NV, Rancho Nevada, where I got introduced to the blues & fell in love. After that I helped start a blues club in the basement of a biker bar & got involved in the Reno Blues Society. I created the local band listings for the RBS & started helping book the local blues bands. I ended up on the Board & helped with all of their events. Contact me if you need help marketing your band or festival: heather_p@ bluesfestivalguide.com Irene Johnson – Editor : As Editor for the Blues Festival Guide, I work with our team to create an entertaining and valuable tool for our readers that can help plan festival calendars, foster connections with the greater blues community, and keep the blues alive. That feeling of standing in front of a festival stage, reveling in the camaraderie of your fellow festival-goers as your spirits lift together in response to the music? The Blues Festival Guide is that in print, right in your pocket. Belinda Holloway – Blues Festival Guide Ambassador : A long-time music fan, festie and Memphis resident, you will find me at blues festivals and industry events such as the International Blues Challenge and the Blues Music Awards promoting our magazine. If you see me, please say hello! Marilyn Stringer – Staff Photographer, Writer, Consultant : I have always loved music and photography and fell in love with the the blues at an early age. When the two collided with my transition to digital photography in 2004, I was hooked. Capturing the passion of the musicians, connecting with the fans,  and sharing it all has become my passion. Ten years after I jumped in fully to this, I published my first book in 2014 of interviews and photos in my series “Blues In The 21 st Century” followed by two more photo books of 10 years at Portland’s Waterfront Blues Festival and, during the COVID lockdown, I put together a decade of photos from the Blues Music Awards to raise funds for the COVID Relief Fund. Although I work during the day as an accountant, my true love is photography. I work with the printed and digital magazines, artist management, blues festivals and venues, record labels, and all the musicians I love to capture. I was recently awarded a Keeping The Blues Alive award from the The Blues Foundation and was inducted into the Arizona Blues Hall of Fame for my extensive work promoting the blues! Just doing my part to Keep The Blues Alive! Beth Rudolph – Consultant and distribution : Beth Rudolph, originally from New York, was influenced by her father’s blues music collection at a very young age. Working with Special Needs Children as an educator, administrator and principal for over 36 years, she believes that music is an essential part of learning. She started a Blues Music Curriculum in her school and brought in various blues artists to work with the kids. Although officially retired from her educational career, music remains her passion. She moved to Boca Raton, FL, in 2015 and participates in the South Florida Blues Society, acted as manager and promoter at South Florida blues venue The Funky Biscuit, and now the director of artist relations, booking and promoting at South Florida music venue Crazy Uncle Mike’s. Goran Petko – Art Director : Hello there! I live in Zagreb, Croatia, where Im running my own Graphic and Web design company Aqua Design since 2001. My services includes Graphic and Web Design for wide range of press media materials and web/multimedia design.Creative solutions for your Magazines, Catalogs, Posters, Calendars, Flyers, Brochures, Tickets, Book covers, Websites, Blogs, eCommerce sites etc. As an Art-Director at RBA Publishing my responsibilities are Reggae and Blues Festival Guide Magazine Graphic Designs and Pre-Press, Web Design and Maintenance for both sites and Reggae e-Guide Newsletter design. If you need any kind of Design works/assistance, please do not hesitate to contact me via RBA Publishing. Leave a Reply Comment Enter your name or username to comment Enter your email address to comment Enter your website URL (optional) Email Us 775-846-8238 Click here for Advertising Rates Sign Up for weekly BLUES FESTIVAL E-GUIDE newsletter! Easy & Free. Packed full of blues news, blues society updates, band tours, \nand of course, dozens of blues festivals, and more.\nExpect to see it in your inbox each Thursday.\nPlease enter your email address below: Subscribe to our Newsletter Email Address Follow Us Latest Blues News Latest Blues News New Orleans 2025 Crescent City Blues & BBQ Festival October 10-12, 2025 with Devon Allman’s Blues Summit, Bobby Rush, Tab Benoit, and more BLACK MOUNTAIN Blues Festival on September 26-28, 2025 in Black Mountain, North Carolina Celebrates Music, Community, and Resilience Blues Rock has a new name…DENNIS JONES! Copyright ©2025 - Blues Festival Guide"
    }
  ]
}