{
  "fuentes": [
    {
      "url": "https://www.bocaratonrealestate.com/bocaire/",
      "email": "info@bocaratonrealestate.com"
    },
    {
      "url": "https://www.bocaratonrealestate.com/bocaire/",
      "email": "name@website.com"
    },
    {
      "url": "https://www.mscorecard.com/mscorecard/showcourse.php?cid=141520691636788375",
      "email": "membership@bocairecc.com"
    },
    {
      "url": "https://bocaratonobserver.com/profiles/bocaire-country-club/",
      "email": "info@bocaratonobserver.com"
    },
    {
      "url": "https://bocaratonobserver.com/locations/bocaire-country-club/",
      "email": "info@bocaratonobserver.com"
    },
    {
      "url": "https://bocaratonobserver.com/locations/bocaire-country-club/",
      "email": "membership@bocairecc.com"
    },
    {
      "url": "https://www.hole19golf.com/courses/bocaire-country-club",
      "email": "membership@bocairecc.com"
    },
    {
      "url": "https://www.1golf.eu/en/club/bocaire-country-club/",
      "email": "golf-club-detail@2x.png"
    },
    {
      "url": "https://www.1golf.eu/en/club/bocaire-country-club/",
      "email": "membership@bocairecc.com"
    },
    {
      "url": "https://www.1golf.eu/en/club/bocaire-country-club/",
      "email": "travel@albrecht.de"
    },
    {
      "url": "https://www.bocaexpert.com/bocaire.php",
      "email": "marker--hover--listing-stack@2x.png"
    },
    {
      "url": "https://www.bocaexpert.com/bocaire.php",
      "email": "marker--listing-stack@2x.png"
    },
    {
      "url": "https://www.bocaratonrealestate.com/boca-country-club/",
      "email": "info@bocaratonrealestate.com"
    },
    {
      "url": "https://www.bocaratonrealestate.com/boca-country-club/",
      "email": "name@website.com"
    }
  ],
  "mails": [
    "golf-club-detail@2x.png",
    "info@bocaratonobserver.com",
    "info@bocaratonrealestate.com",
    "marker--hover--listing-stack@2x.png",
    "marker--listing-stack@2x.png",
    "membership@bocairecc.com",
    "name@website.com",
    "travel@albrecht.de"
  ],
  "nombre_sitio": "bocairecc.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.bocaratonrealestate.com/bocaire/",
      "text": "Bocaire Country Club Homes For Sale | Boca Raton Real Estate HOME Login / Register contact us 561.998.9015 ENGLISH 中文 FRANÇAIS 한국어 ITALIANO 日本語 DEUTSCH PORTUGUÊS РУССКИЙ ESPAÑOL TIẾNG VIỆT Champagne & Parisi Search Homes Condos Townhomes Agents Resources Contact Boca Raton Real Estate Search Home Homes Bocaire Bocaire Country Club Bocaire Country Club is a gated private country club community situated on 300 acres of tropical South Florida foliage and shimmering lakes. L ocated in the heart of Boca Raton , Bocaire has the reputation of having one of the warmest, most welcoming neighborhood atmospheres in all of South Florida. This sophisticated community is truly a country club paradise. Bocaire Homes for Sale Bocaire September 10, 2025 7 Listed 91 Avg. DOM $586.85 Avg. $ / Sq.Ft. $2,499,000 Med. List Price Gallery Photo View List Map Map View Get Alerts! Refine Results Price (Highest) Price (Lowest) Days on Site (Newest) Days on Site (Oldest) Bedrooms (Most) 7 Properties $2,275,000 Neighborhood: Bocaire Golf Club 2 4564 Bocaire Boulevard Boca Raton,  FL 33487 4 Beds 4 Baths 4,546 Sq.Ft. 1987 Year Built 29 Days on Site R11115288 MLS MLS #: R11115288 $2,499,000 Neighborhood: Bocaire Golf Club No 2 4500 Bocaire Blvd Boulevard Boca Raton,  FL 33487 4 Beds 4 F 1 1/2 Baths 3,271 Sq.Ft. 1986 Year Built 38 Days on Site R11112702 MLS MLS #: R11112702 $3,460,500 Neighborhood: Bocaire Golf Club 1 4825 Bocaire Boulevard Boca Raton,  FL 33487 3 Beds 4 F 1 1/2 Baths 4,800 Sq.Ft. 1987 Year Built 71 Days on Site R11104290 MLS MLS #: R11104290 $2,650,000 Neighborhood: Bocaire Country Club 17582 Bocaire Way Boca Raton,  FL 33487 4 Beds 5 Baths 4,560 Sq.Ft. 1988 Year Built 75 Days on Site R11103290 MLS MLS #: R11103290 $1,995,000 Neighborhood: Bocaire Golf Club 1 4800 Bocaire Boulevard Boca Raton,  FL 33487 5 Beds 4 F 1 1/2 Baths 4,502 Sq.Ft. 1992 Year Built 130 Days on Site R11087353 MLS MLS #: R11087353 $3,850,000 Neighborhood: Bocaire Golf Club 2 4356 Kasso Circle Boca Raton,  FL 33487 5 Beds 7 F 1 1/2 Baths 5,510 Sq.Ft. 1985 Year Built 136 Days on Site R11085568 MLS MLS #: R11085568 $1,599,000 Neighborhood: Bocaire Golf Club No 1 4869 Tallowwood Lane Boca Raton,  FL 33487 4 Beds 5 F 1 1/2 Baths 4,002 Sq.Ft. 1985 Year Built 165 Days on Site R11076491 MLS MLS #: R11076491 More About Bocaire Country Club Homes for Sale Consisting of 237 custom-built estate homes situated on oversized lots , Bocaire offers a diverse selection of unique homes for sale with something perfect for every taste and style. Homes for sale in Bocaire Country Club range in size from 2,500 to over 6,500 square feet of living space, with a wide selection of spacious floor plans from which to choose. These luxurious homes boast many designer finishes and upscale interior features. Some of the features commonly found in Bocaire homes for sale include: Chef-inspired kitchens with stainless steel appliances Granite counters in kitchens and baths High-end tile and hardwood flooring Soaring vaulted ceilings Floor to ceiling windows providing ample natural light Spacious master suites with custom walk-in closets Luxurious marble baths Every home in Bocaire Country Club offers gorgeous views of rolling golf course greens, shimmering lakes, and/or the community's lush tropical landscape. With meticulously-maintained, large private lots , many of the homes also feature outdoor living spaces perfect for entertaining, as well as summer kitchens and private swimming pools. Bocaire Country Club Membership & Amenities Bocaire Country Club is known for its professional service and luxurious world-class amenities that provide members with the ultimate South Florida country club lifestyle. The r ecently refurbished 18-hole golf course was designed by legendary golf architect Joe Lee and has essentially no tee times. With an excellent teaching staff, a fully stocked pro shop, designated chipping and putting areas, driving range, and bunker practice area, Bocaire caters to golfers of all levels . Tennis at Bocaire is also spectacular , as the community offers everything from private and group lessons to active league play, as well as seasonal tennis events held throughout the year. There is a fully stocked pro shop with top-of-the-line tennis gear and apparel, and of course, five lighted Har-Tru clay tennis courts. The resort-style aquatic center is one of the newest and most luxurious additions to Bocaire and features a beautiful beach entry pool. The 4,300 square foot fitness center features state-of-the-art weight training and cardio equipment, a full staff of certified personal trainers, and a host of group fitness classes including aerobics, Zumba, Pilates, and Yoga. The fitness center also has a luxurious spa that offers a wide range of relaxing spa services. In addition to these services and amenities, the 36,000 square foot clubhouse offers year-round exquisite dining in multiple venues and an extensive calendar of social events . Residents take part in dinner shows and seasonal celebrations, caviar and vodka tastings, family programs, and a variety of card games. With only 240 resident members , Bocaire strives to provide the highest level of service and top-rated amenities to ensure an exceptional member experience. Bocaire Country Club Location Located off of Military Trail in the heart of Boca Raton, Bocaire is just minutes away from all that you could ever ask for in South Florida. Bocaire is conveniently located near some of the area's finest shopping, dining, and entertainment options, as well as  the following attractions and activities in Boca Raton: South Florida Beaches Boca Raton Community Parks Mizner Park Boca Raton Resort & Club Gumbo Limbo Nature Center Boca Town Center Mall Boca Raton Museum of Art iPic movie theaters I95 and Florida's Turnpike for easy getaways Top-rated area schools Bocaire Country Club is definitely an ideal place to call home for those seeking an active, friendly, and luxurious lifestyle . If Bocaire sounds like the perfect country club community to call home, you may want to visit similar country club communities in Boca Raton , such as Polo Club and Woodfield Country Club , both of which also offer a beautiful selection of luxurious homes, world-class amenities, and a friendly, welcoming atmosphere. Contact Us About BocaIre Country Club Living in Bocaire Country Club provides the ultimate luxurious and exclusive country club lifestyle that one would expect from a private club of this caliber. If you would like to learn more about Bocaire or any of the other developments in Boca Raton , please contact us at 561-998-9015 . You may also reach us by completing the online contact form below, and one of our experienced agents will promptly reach out to assist you. We at Champagne & Parisi Real Estate pride ourselves on our market knowledge, industry expertise, and our commitment to providing exceptional customer service. We look forward to assisting you in finding your next South Florida dream home! Contact Us About Bocaire Country Club First Name: Last Name: Email Address: Phone: Questions / Comments: Submit By proceeding, you expressly consent to receive texts at the number you provided, including marketing, from Champagne & Parisi Real Estate about real estate related matters, but not as a condition of purchase. Message frequency varies. You can text Help for help and Stop to cancel. You also agree to our Terms of Service and to our Privacy Policy regarding the information relating to you. Message and data rates may apply. Additionally, you expressly consent to receiving calls at the number you provided, including marketing by auto-dialer, pre-recorded or artificial voice, and email, from  Champagne & Parisi Real Estate about real estate related matters, but not as a condition of purchase. This consent applies even if you are on a corporate, state or national Do Not Call list. Messages may be processed by an automated system. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. More Country Club Developments in Boca Raton Boca Country Club Boca Greens Boca Grove Boca Lago Boca Pointe Boca West Boca Woods Bocaire Broken Sound Polo Club Royal Palm Yacht & Country Club St. Andrews Country Club Stonebridge Woodfield Country Club navigation Click here to view all Boca Raton residential communities . Boca Raton Neighborhoods Boca Bath & Tennis Boca Falls Boca Marina Yacht Club Long Lake Estates Millpond New Floresta Newport Bay Club Oaks at Boca Raton Old Floresta Palm Beach Farms Parkside Royal Oak Hills Saturnia Seasons Timbercreek Woodfield Hunt Club View All Neighborhoods Featured Home Searches All Homes Newest Listings Pool Homes Country Clubs Schools No HOA Homes New Construction Price Reductions Waterfront Homes BoCa Raton Market Stats Pricing trends, average days on market, and more, updated every day. View All stats What's My Home's Value? Our professional analysis includes data on recent sales and current market trends. Find Out Now Search Homes Condos Townhomes Agents Blog Resources Contact Site Map Property Listings Champagne & Parisi Boca Raton Real Estate - Champagne & Parisi Real Estate 561.998.9015 | info@bocaratonrealestate.com Accessibility | Terms of Service | Privacy Policy | DMCA Notice © Copyright 2025 Champagne & Parisi Real Estate"
    },
    {
      "url": "https://www.mscorecard.com/mscorecard/showcourse.php?cid=141520691636788375",
      "text": "Bocaire Country Club - Bocaire | mScorecard Login Sign Up home Home flag Courses contact_support Contact menu Courses Contact Login Sign Up Login Sign Up Home Courses Show Course Bocaire Country Club 4989 Bocaire Blvd 33487 Boca Raton, FL USA phone 561-998-1615 email membership@bocairecc.com desktop_windows http://bocairecc.com/ Course: Bocaire course type Golf measurement Yards Please login to view full course information Login Sign Up for Free Men Tees Ladies Hole Par SI Gold Blue Blue/White White Silver Red Green Par SI 1 4 -- 370 343 343 333 305 275 264 -- -- 2 5 -- 523 513 489 489 459 449 424 -- -- 3 3 -- 194 184 184 165 155 126 119 -- -- 4 5 -- 614 584 542 542 465 451 438 -- -- 5 4 -- 416 404 374 374 340 326 287 -- -- 6 4 -- 384 368 368 342 333 313 281 -- -- 7 4 -- 360 335 335 326 303 292 250 -- -- 8 3 -- 182 145 145 136 121 111 99 -- -- 9 4 -- 386 371 332 332 322 285 224 -- -- Out 36 3429 3247 3112 3039 2803 2628 2386 36 10 5 -- 528 498 498 486 437 426 365 -- -- 11 4 -- 265 257 257 230 216 155 150 -- -- 12 3 -- 171 158 158 146 135 130 112 -- -- 13 4 -- 412 398 342 342 309 301 329 -- -- 14 4 -- 456 412 367 367 355 324 295 -- -- 15 4 -- 388 378 378 334 326 312 270 -- -- 16 3 -- 195 170 160 160 151 141 118 -- -- 17 5 -- 519 498 498 488 446 435 386 -- -- 18 4 -- 463 426 412 412 362 328 319 -- -- In 36 3397 3195 3070 2965 2737 2552 2344 36 Total 72 6826 6442 6182 6004 5540 5180 4730 72 Men CR/Slope front 9 back 9 --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- Women CR/Slope front 9 back 9 --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- Coordinates 90 points stored on 18 holes Your Stats Rounds Played: 0 Average Score: - Best Score: - Worst Score: - First Round: - Last Round: - This page shows golf course information for Bocaire Country Club in Boca Raton, USA. The golf course has 18 holes and its total par is 72 If the information is incorrect, please let us know using the contact form . © 2025 Velocor Ltd | Terms & Privacy Policy"
    },
    {
      "url": "https://bocaratonobserver.com/profiles/bocaire-country-club/",
      "text": "Bocaire Country Club - bocaratonobserver.com Skip to main content Search Subscribe facebook instagram RSS Culture Buzz Destinations Features Style Wellness Food & Drink Bites Cheers Chef Profile Readers’ Choice Restaurant Guide Restaurant News Review Community Around Town Community News Flash Giving Back La Vida Boca Happenings Calendar Editor's Corner Out 'N' About Guides Charity Country Clubs Education Top Docs Top Lawyers Visitors Profiles Country Club Collection Cuisine Scene Health Care Heroes Inspired Home Men On The Move Power Players Professional Edge Top Docs Top Lawyers Wonder Women Fresh Picks Country Club Collection Cuisine Scene Health Care Heroes Inspired Home Men On The Move Power Players Professional Edge Top Docs Top Lawyers Wonder Women Home Profiles Bocaire Country Club Bocaire Country Club November 22, 2024 7:04 AM RSS Print × Expand Located in Boca Raton, just south of Delray Beach, Bocaire Country Club offers an intimate and boutique-style club experience that epitomizes South Florida luxury. Known for its exceptional service and amenities, Bocaire is a haven for members seeking a sense of community within an exclusive setting. With 240 custom-built estate homes set on at least one-third of an acre amid fairways, lakes and landscaped golf course beds, Bocaire offers a picturesque and spacious environment. × Expand “Together we are Bocaire,” says General Manager Loraine Vienne, reflecting the camaraderie that unites members. This inclusive atmosphere makes Bocaire a unique community where everyone feels at home. The stunning golf course designed by Kipp Schulties, features some of Boca Raton’s highest elevations. The course is a draw for golfers of all levels, complemented by an excellent teaching staff, fully equipped golf shop and practice areas for chipping, putting and driving. × Expand × Expand For those who enjoy racquet sports, Bocaire’s tennis and pickleball facilities offer both group and private lessons, league play and seasonal events on Har-Tru clay courts and tournament-style pickleball courts. “The country club industry is evolving, and Bocaire is leading these changes in a boutique community setting,” says Vienne. The resort-style aquatic center boasts a beach-entry pool with lap lanes, while the 4,300-square-foot fitness center includes state-of-the-art weight and cardio equipment, personal trainers and classes like Spin, Zumba, Pilates and yoga. Newly added treatment rooms provide a variety of wellness services from massages to facials. × Expand The 36,000-square-foot clubhouse offers fine and casual dining, a vibrant indoor-outdoor bar with views of the 18th hole and an array of social events including dinner shows, lunch and learn programs and speaker series. With a rotating menu and seasonal celebrations, Bocaire’s culinary offerings are diverse and innovative. Looking ahead to 2025, Bocaire plans to expand its programming with additional wellness classes, cultural tours and a broader array of nongolf activities, reinforcing its commitment to an inclusive club culture. Bocaire Country Club, 4989 Bocaire Blvd., Boca Raton, 561-997-6556, bocairecc.com Get directions and contact information from the directory listing . Country Club Collection Special Advertising Section × Expand Back to Search Results Tags Profile Country Club Collection November 22, 2024 7:04 AM 7700 Congress Ave., Suite 3115 Boca Raton, FL 33487 561-982-8960 info@bocaratonobserver.com About Team Advertise Sponsorships Awards Issue Archive Subscribe Careers Contact Privacy Policy Terms © 2024 A&A Publishing Corp Built with Metro Publisher™"
    },
    {
      "url": "https://bocaratonobserver.com/locations/bocaire-country-club/",
      "text": "Bocaire Country Club - bocaratonobserver.com Skip to main content Search Subscribe facebook instagram RSS Culture Buzz Destinations Features Style Wellness Food & Drink Bites Cheers Chef Profile Readers’ Choice Restaurant Guide Restaurant News Review Community Around Town Community News Flash Giving Back La Vida Boca Happenings Calendar Editor's Corner Out 'N' About Guides Charity Country Clubs Education Top Docs Top Lawyers Visitors Profiles Country Club Collection Cuisine Scene Health Care Heroes Inspired Home Men On The Move Power Players Professional Edge Top Docs Top Lawyers Wonder Women Fresh Picks Home Bocaire Country Club Bocaire Country Club 4989 Bocaire Blvd. , Boca Raton , Florida 33487 Print Photos Map × 1 of 5 × 2 of 5 × 3 of 5 × 4 of 5 × 5 of 5 Prev Next Nearby Nearby Events Address 4989 Bocaire Blvd. , Boca Raton , Florida 33487 Phone 561-997-6556 Visit Website Together We Are Bocaire Located in Boca Raton, just south of Delray Beach, Bocaire is perfectly situated near world-class restaurants, amazing shopping, cultural centers, and of course, beautiful beaches. Bocaire is an exclusive, private club with a limited number of memberships. With 238 custom-built estate homes each set on a minimum of 1/3 acre amidst magnificent fairways, serene lakes, and beautiful landscaping, you’ll see that every detail has been meticulously considered. Members and guests receive exceptional and personal attention from our professional staff who take pride in ensuring incredible service is always the rule, never the exception. “Bocaire is a welcoming community. It does not feel pretentious or cold. The new golf course is spectacular, the members are social and easy going, and the size of the community is ideal. There is something for everyone in our family to enjoy. We happen to love tennis and golf, our kids enjoy basketball, and we all love the food and events!” - FIVE YEAR RESIDENT The Challenge at Bocaire Bocaire’s impressive $8 million dollar golf course designed by Kipp Schulties, features some of the highest elevations in the area. No tee times or reservations are ever needed, so if you can only play 4 holes after work, you’re free to do so! This is truly golf at your leisure, your pace, and your level. The Challenge is aesthetically pleasing with rolling hills, rock walls, strategically placed water vistas, and bunkers. Members enjoy generous family golf privileges without green fees for parents, children, or grandchildren—Bocaire is golf, played well. Social Offerings & Exquisite Dining With a packed calendar of social events and entertainment, life is never dull at Bocaire. For those seeking a more active community life, Bocaire offers a wide array of functions in addition to sports such as themed dinners, elegant gala events, charity functions, caviar, vodka and wine tastings, and more. Bocaire offers casual or elegant indoor dining with exquisite cuisine year-round. Bocaire’s renowned Executive Chef has over 20 years of experience. His talented culinary team uses the freshest and finest ingredients to create distinctive lunch and dinner menus as well as our signature Sunday Brunch that is not to be missed. Pride In Who We Are Combined with exceptional, individualized service and a full calendar of social events and activities, Bocaire is the Country Club you’ve been looking for. At Bocaire, you belong to more than just a country club—you are part of a community. For more information, call 561-998-1615 or visit membership@bocairecc.com . Back to Search Results Tags Golf Tennis Tweets by @https://twitter.com/bocairecc?lang=en 7700 Congress Ave., Suite 3115 Boca Raton, FL 33487 561-982-8960 info@bocaratonobserver.com About Team Advertise Sponsorships Awards Issue Archive Subscribe Careers Contact Privacy Policy Terms © 2024 A&A Publishing Corp Built with Metro Publisher™"
    },
    {
      "url": "https://www.hole19golf.com/courses/bocaire-country-club",
      "text": "Bocaire Country Club - Golf Course Information | Hole19 Apps Discover Courses The 19th Hole Shop Sign In All courses ... Bocaire Country Club All courses United States Florida Bocaire Country Club Join 4.8M+ golfers worldwide today. Download now! Hole19 is the leading golf app for tracking scores, navigating courses with GPS precision, and unlocking performance insights. 5 Bocaire Country Club Boca Raton, FL, United States This course is mapped and available on Hole19 App Discover The Challenge at Bocaire: a stunning 18-hole course in Boca Raton, FL, featuring elite design, practice facilities, and luxury amenities. Description Bocaire Country Club in Boca Raton, Florida, offers an exceptional 18-hole golf experience designed to impress both seasoned players and newcomers. Known as \"The Challenge at Bocaire,\" this championship course underwent a stunning $8 million renovation, reopening in January 2019. The redesign elevated every aspect of the course, blending strategic playability with breathtaking aesthetics. Golfers can enjoy meticulously maintained fairways, expertly crafted bunkers, and challenging greens tailored for all skill levels.  \n\nComplement your round with access to world-class practice facilities, including a driving range and short-game areas designed to refine your skills. The elegant clubhouse offers luxurious amenities such as fine dining, a pro shop, and spaces to relax after your game, making Bocaire a premier destination for locals and visitors alike. Nestled in Boca Raton’s sunny paradise, Bocaire Country Club delivers an unforgettable golfing experience in one of Florida's most vibrant regions. Know Your Handicap at Bocaire Country Club Calculate My Handicap Select Course Combination 18, 18 Holes Scorecard Tee Distance PAR CR SR green ladies 4325 72 66.5 117 gold men 6241 72 73.1 138 blue men 5890 72 71.1 131 black men 6438 72 74.1 139 white men 5490 72 69.3 126 white ladies 5490 72 74.8 136 silver men 5065 72 67 120 silver ladies 5065 72 72 130 red men 4736 72 65.5 117 red ladies 4736 72 70 123 green men 4325 72 63.1 111 Leaderboard Loading Phone number +1 (561 *** *** Show more Email membership@bocairecc.com Where is it? Bocaire Country Club, 4989 Bocaire Blvd, Boca Raton,, FL 33487 Find similar golf courses. Get Hole19 App today. Find and play the best golf courses with ease using the Hole19 app. Hole19 provides a seamless way to access course information and improve your game. Closest courses You might want to consider playing other courses around the same area. Here are some of the closest: 5 Polo Club of Boca Raton (Equestrian) Florida, USA 4.7 Polo Club of Boca Raton (Club) Florida, USA 4.9 Delaire Country Club Delray Beach, FL, United States 4.3 Boca Delray Golf & Country Club Delray Beach, FL, United States 4.7 Boca Raton Golf & Racquet Club Boca Raton, FL, United States 3.6 Lakeview Golf Club Delray Beach, FL, United States Discover Top Golf Courses with Hole19 App Find and play the best golf courses with ease using the Hole19 app. Hole19 provides a seamless way to access course information and improve your game. Download Hole19 now and elevate your golfing experience. However you play. Play More. Hole19 Golf App All features Apple Devices Android Devices Premium CORE Golf App All features Apple Devices For Golfers Shop Discover Courses HCP Calculator Glossary The 19th Hole All posts Hole19 News Courses Game improvement Reviews For Partners Advertise with us Press Kit About About Hole19 Careers Contacts Support Help Center Terms & Conditions Privacy Policy © 2025 H19 Ltd"
    },
    {
      "url": "https://www.1golf.eu/en/club/bocaire-country-club/",
      "text": "Bocaire Country Club, Boca Raton, FL - Albrecht Golf Guide Golf Courses Golf Hotels Golf Packages Bookshop Apps Sign in / Sign up Saved Items Deutsch English Español Italiano Albrecht Golf Guide Golf courses in North America United States Florida Bocaire Country Club 18 Hole Private Overview Course Visitors Amenities Club Reviews No image available Bocaire Country Club 4989 Bocaire Blvd, Boca Raton, FL 33487-1163, USA Phone: +1 561-998-1602 , Fax: +1 561-995-5194 membership@bocairecc.com www.bocairecc.com Map Save Share The Course 18-Hole Course Driving Range  &  Practice area Visitors welcome? By invitation only. Season: Year round The Course 18-Hole Course Opened in 1984. Design: Joe Lee . Terrain: Water hazards Technical difficulty: Moderate Scorecard Tee Par CR Slope Length Gold (Men) 72 72.2 133 6670 yards Blue (Men) 72 70 132 6286 yards White (Men) 72 67 121 5579 yards Red (Women) 72 65.4 116 5280 yards Green (Women) 72 29.1 124 4991 yards Practice Facilities Driving Range Putting Green Chipping Green Visitors 18-Hole Course Reserved for members and their guests. Etiquette Softspikes required. Amenities Club Amenities Clubhouse Pro Shop Restaurant Bar Rentals Clubs for hire Electro-cart for hire The Club Personnel Title Name Pro Russell Carlson Enlarge / get directions Nearby Courses Polo Club of Boca Raton Boca Raton (0.8 km) 36 Hole Delaire Country Club Delray Beach (0.8 km) 27 Hole Boca Delray G&CC Delray Beach (1.2 km) 18 Hole See all User Reviews There are no user reviews yet. Been to Bocaire Country Club ? Share your experiences! Write a Review Golf Packages Tenerife, Spain Tivoli La Caleta Tenerife Resort 5 stars Very good 8,4 / 10 7 Nights 5 green fees from € 1475 per person Tenerife, Spain Hacienda del Conde Meliá Collection Golf & Spa 5 stars Wonderful 9,1 / 10 7 Nights HB unlimited golf from € 1231 per person La Gomera, Spain Hotel Jardín Tecina 4 stars Excellent 8,7 / 10 7 Nights HB 5 green fees from € 833 per person Majorca, Spain Elba Sunset Mallorca 4 stars Very good 8,2 / 10 7 Nights 5 green fees from € 855 per person Majorca, Spain VIVA Golf Adults Only 18+ 4 stars Superior Very good 8,4 / 10 7 Nights HB 5 green fees from € 1083 per person Sicily, Italy Verdura Resort 5 stars Excellent 8,8 / 10 7 Nights 4 green fees from € 1269 per person Porto Cervo, Italy Cervo Hotel, Costa Smeralda Resort 5 stars Excellent 8,8 / 10 7 Nights unlimited golf from € 1042 per person Cyprus Almyra 5 stars Very good 8,2 / 10 7 Nights 4 green fees from € 928 per person All Packages Get a €20 discount on your golf vacation with our newsletter Sign up for our newsletter and be the first to discover new golf packages, special offers, and exclusive golf tours. As a bonus, you will receive a €20 discount code for your next golf vacation. Yes, please send me the newsletter You can change your mind at any time by clicking the unsubscribe link in the footer of any newsletter you receive from us, or by contacting us at travel@albrecht.de . We will treat your information with respect. You can find details about our privacy practices here . By clicking above, you agree that we may process your information in accordance with these terms. Follow us on Instagram New Golf Guide Africa Asia Caribbean Central America Europe Middle East North America Pacific South America Golf Packages Book Golf Holiday Travel Themes Golf Round Trips Group Golf Tours Early Booking Deals Majorca Canary Islands Tuscany Algarve Andalusia Greece All Destinations Mobile App Golf Guide for iPhone Golf Guide for iPad Info Contact/Imprint Media Information Privacy Policy Terms Feedback © 2025 Albrecht Golf Verlag GmbH"
    },
    {
      "url": "https://www.bocaexpert.com/bocaire.php",
      "text": "Bocaire Country Club Homes For Sale | Bocaire Country Club, Boca Raton FL Skip to main content Search Dropdown arrow Search MLS New Listings Featured Listings Communities Dropdown arrow South Florida Cities Boca Raton Boynton Beach Deerfield Beach Delray Beach Highland Beach Hillsboro Beach Ocean Ridge Parkland West Palm Beach Lifestyles Dropdown arrow Lifestyles Waterfront Homes 55+ Active Adult Golf & Country Clubs Gated Communities Downtown Living Waterfront Condos Montoya Circle Sell About Dropdown arrow About Meet our Team Join our Team Local Info Contact Us Read our Blog My Dashboard My Dashboard Favorites Saved Searches Messages Preferences Sign Out Sign In 561.866.7584 Menu Close Home Golf and Country Club Communities Bocaire Country Club Bocaire Country Club Homes For Sale Search homes in Bocaire Country Club - Boca Raton FL Bocaire Country Club is is one of Boca Raton’s finest residential golf and country club communities. Bocaire Country club offers a wide variety of recreational and leisure activities for the entire family to enjoy year round. Bocaire's Clubhouse provides gala social events including full-service formal dining, grill room, lounge, card rooms, fitness center and locker rooms. The tennis complex features six lighted Har-Tru courts with two on-site tennis professionals and seasonal men's and women's tennis programs. Golf and tennis pro shops are also available with full-service as well as valet parking. For more information about Bocaire Country Club homes for sale , give us a call now or click on any of the active MLS listings below that catch your eye to view additional details and photos. View listings for homes for sale at Bocaire Country Club or see below for more information on the many amenities offered in this community. Browse Bocaire Country Club Homes For Sale Bedrooms Bathrooms Price Range Save\n                        Search Sort by: Price, high to low Dropdown arrow $3,850,000 4356 Kasso Cir, Boca Raton 5\n                                    Beds 8\n                                    Baths 5,510 SqFt Residential MLS® # RX-11085568 $3,460,500 ↓ $28,000 4825 Bocaire Blvd, Boca Raton 3\n                                    Beds 5\n                                    Baths 4,800 SqFt Residential MLS® # RX-11104290 $3,149,000 ↓ $100,000 17607 Bocaire Pl, Boca Raton 6\n                                    Beds 5\n                                    Baths 4,650 SqFt Residential MLS® # RX-11048095 $2,699,000 ↓ $200,000 17654 Bocaire Way, Boca Raton 6\n                                    Beds 7\n                                    Baths 5,100 SqFt Residential MLS® # RX-11004929 $2,650,000 17582 Bocaire Way, Boca Raton 4\n                                    Beds 5\n                                    Baths 4,560 SqFt Residential MLS® # RX-11103290 $2,499,000 4500 Bocaire Blvd Blvd, Boca Raton 4\n                                    Beds 5\n                                    Baths 3,271 SqFt Residential MLS® # RX-11112702 $2,275,000 4564 Bocaire Blvd, Boca Raton 4\n                                    Beds 4\n                                    Baths 4,546 SqFt Residential MLS® # RX-11115288 $2,100,000 ↓ $299,000 4484 Bocaire Blvd Blvd, Boca Raton 4\n                                    Beds 6\n                                    Baths 4,517 SqFt Residential MLS® # RX-11100023 $1,995,000 ↓ $105,000 4800 Bocaire Blvd, Boca Raton 5\n                                    Beds 5\n                                    Baths 4,502 SqFt Residential MLS® # RX-11087353 $1,599,000 ↓ $200,000 4869 Tallowwood Lane, Boca Raton 4\n                                    Beds 6\n                                    Baths 4,002 SqFt Residential MLS® # RX-11076491 Pending $1,200,000 17401 Spring Tree Lane, Boca Raton 4\n                                    Beds 2\n                                    Baths 2,314 SqFt Residential MLS® # RX-11104935 $1,199,000 17634 Lake Park Rd, Boca Raton 4\n                                    Beds 2\n                                    Baths 2,240 SqFt Residential MLS® # RX-11117301 $779,000 ↓ $40,000 4253 Sugar Pine Dr, Boca Raton 3\n                                    Beds 2\n                                    Baths 1,621 SqFt Residential MLS® # RX-11059937 Under Contract $4,900 17414 Spring Tree Ln Lane, Boca Raton 4\n                                    Beds 2\n                                    Baths 2,231 SqFt Rental MLS® # RX-11120401 CONTINUE SEARCHING GOLF COURSE HOMES IN THE AREA If you're not seeing anything that fits your needs and wants here, start browsing other available golf and country club homes for sale in and around beautiful Boca Raton, FL! For more information about Bocaire Country Club real estate, or any other Boca Raton property, contact Gloria Singer at 561.866.7584. ^ Back to Bocaire Country Club homes for sale Communities Delray Beach Highland Beach Boynton Beach Boca Raton Ocean Ridge Information About Us Our Agents Our Listings Contact Us Popular Pages Local Communities Home Evaluation Real Estate Blog Search Listings Boca Expert Realty LLC 561.866.7584 hello@bocaexpert.com Facebook Twitter LinkedIn © 2025 Real Estate Webmasters All Rights Reserved. | Sitemap | Accessibility | Privacy Policy Real Estate Webmasters will open a new window All listings featuring the BMLS logo are provided by BeachesMLS, Inc.This information is not verified for authenticity or accuracy and is not guaranteed.Copyright © 2025 BeachesMLS, Inc. Listing information last updated on September 10th, 2025 at 6:45pm EDT."
    },
    {
      "url": "https://www.bocaratonrealestate.com/boca-country-club/",
      "text": "Boca Country Club Homes for Sale | Boca Raton Real Estate HOME Login / Register contact us 561.998.9015 ENGLISH 中文 FRANÇAIS 한국어 ITALIANO 日本語 DEUTSCH PORTUGUÊS РУССКИЙ ESPAÑOL TIẾNG VIỆT Champagne & Parisi Search Homes Condos Townhomes Agents Resources Contact Boca Raton Real Estate Search Home Homes Boca Country Club Boca Country Club Boca Country Club, previously referred to as Boca Raton Golf & Tennis Club, is widely known as one of the best value country club communities in Boca Raton, FL. Country club membership is not mandatory for residents, making Boca Country Club a popular choice for those who want to live in a gated country club-style community without the expensive membership fees. Boca Country Club features a 24-hour manned gated entrance and is situated on a vast expanse of lush Florida landscape, with incredible lakes located near the border of Delray Beach & Boca Raton, FL. Boca Country Club Homes For Sale Boca Country Club features almost 1,000 residences that were constructed in the late '80s and early '90s , including condominiums, villas, coach homes, townhomes , and single-family homes for sale. The residences at Boca Country Club are spread throughout 12 distinct villages, each of which boasts a unique character and charm. The diverse selection of residences in Boca Country Club ranges from 1,300 to just over 3,000 square feet of living space, though all offer beautiful views of the surrounding community and golf course, providing the sense of living in a tropical paradise. Boca Country Club Homes for Sale September 10, 2025 13 Listed 132 Avg. DOM $349.10 Avg. $ / Sq.Ft. $539,500 Med. List Price Gallery Photo View List Map Map View Get Alerts! Refine Results Price (Highest) Price (Lowest) Days on Site (Newest) Days on Site (Oldest) Bedrooms (Most) 13 Properties Page 1 of 2 $399,000 Neighborhood: Eastbrooke Coach Homes Co 17060 Emile Street #9 Boca Raton,  FL 33487 3 Beds 2 Baths 1,666 Sq.Ft. 1994 Year Built 9 Days on Site R11120483 MLS MLS #: R11120483 $649,000 Neighborhood: Mykonos Court Of Boca Gol 3783 Mykonos Court Boca Raton,  FL 33487 3 Beds 2 Baths 1,498 Sq.Ft. 1991 Year Built 12 Days on Site R11119902 MLS MLS #: R11119902 $439,500 Neighborhood: Fairways At Somerset Cond 17270 Boca Club Boulevard #1702 Boca Raton,  FL 33487 3 Beds 2 Baths 1,347 Sq.Ft. 1990 Year Built 55 Days on Site R11108807 MLS MLS #: R11108807 $665,000 Neighborhood: Candlewood 17720 Candlewood Ter Terrace Boca Raton,  FL 33487 3 Beds 2 Baths 1,886 Sq.Ft. 1988 Year Built 85 Days on Site R11100027 MLS MLS #: R11100027 $539,500 Neighborhood: Fairways At Boca Golf & T 17340 Boca Club Boulevard #702 Boca Raton,  FL 33487 3 Beds 2 Baths 1,347 Sq.Ft. 1987 Year Built 105 Days on Site R11094591 MLS MLS #: R11094591 $529,000 Neighborhood: St Tropez At Boca Golf Co 17287 Boca Club 1 Boulevard #1 Boca Raton,  FL 33487 3 Beds 2 Baths 1,440 Sq.Ft. 1993 Year Built 107 Days on Site R11094103 MLS MLS #: R11094103 $725,000 Neighborhood: Candlewood 17744 Candlewood Terrace Boca Raton,  FL 33487 3 Beds 2 Baths 1,886 Sq.Ft. 1988 Year Built 133 Days on Site R11086455 MLS MLS #: R11086455 $698,000 Neighborhood: Greens At Boca Golf And T 17144 Bermuda Village Drive Boca Raton,  FL 33487 3 Beds 3 Baths 1,682 Sq.Ft. 1997 Year Built 134 Days on Site R11086334 MLS MLS #: R11086334 $479,000 Neighborhood: Eastbrooke Coach Homes Co 17051 Emile Street #5 Boca Raton,  FL 33487 3 Beds 2 Baths 1,666 Sq.Ft. 1994 Year Built 140 Days on Site R11084576 MLS MLS #: R11084576 $449,000 Neighborhood: Fairways At Somerset Cond 17280 Boca Club 2208 Boulevard #2208 Boca Raton,  FL 33487 3 Beds 2 Baths 1,271 Sq.Ft. 1990 Year Built 170 Days on Site R11074896 MLS MLS #: R11074896 $465,000 Neighborhood: Eastbrooke Coach Homes Co 17061 Emile Street #3 Boca Raton,  FL 33487 3 Beds 2 Baths 1,448 Sq.Ft. 1994 Year Built 177 Days on Site R11072525 MLS MLS #: R11072525 Open 9/13 $675,000 Neighborhood: Mykonos Court Of Boca Gol 3716 Mykonos Court Boca Raton,  FL 33487 3 Beds 2 F 1 1/2 Baths 1,859 Sq.Ft. 1991 Year Built 244 Days on Site R11050856 MLS MLS #: R11050856 Prev 1 2 Next The ViLLAGES Of Boca Country Club The villages within Boca Country Club include: Antigua Point: offers a beautiful selection of one-story, single-family homes, many of which boast beautiful golf course and lake views. Balboa Point: features single-family homes on larger lots surrounded by amazing golf course views and beautiful lakes. Bermuda Village: this pet-friendly community offers 61 private courtyard villas with detached guesthouses. Candlewood: this village is made up of one- and two-story townhouses as well as one- and two-story courtyard homes. Eastbrooke: this small village consists of 36 coach homes with private driveways, garages, and panoramic views. Fairways: this family-friendly community consists of 13 multi-unit buildings with large patios and private balconies. Mykonos Court: this Grecian style village consists of 66 charming courtyard homes. Somerset ABC: consists of 37 villa-style semi-attached one- and two-story homes, as well as 88 private condominiums. SpyGlass Walk: this charming village consists of two mid-rise condominium buildings featuring excellent views from wrap-around balconies. St. Tropez: this quiet community features 117 one- and two-story coach homes and attached villas. The Greens: this community features 61 exclusive townhomes featuring one- and two-car garages. Tiffany Trace: this unique community offers three- to four-bedroom single-patio homes as well as two-story townhomes with volume ceilings and breathtaking views. Boca Country Club Location Boca Country Club is ideally situated in a central location near the border of Delray Beach-Boca Raton. Just minutes away are the gorgeous South Florida coastline and pristine local beaches, the famous Atlantic Avenue in Delray, I-95, Florida's Turnpike, and some of the best dining and shopping options in the area. The community is also zoned for some of Boca Raton's top-rated public schools, including Calusa Elementary School , Omni Middle School , and Spanish River Community High School . Overall, living in Boca Country Club provides residents and members with an extravagant lifestyle, a picturesque environment, and beautifully-designed homes. If Boca Country Club sounds like the perfect community to suit your home buying needs and your desired lifestyle, you may want to explore other country club communities in Boca Raton including Boca Pointe and Boca Greens which also do not currently require club membership for homeowners. If you are interested in purchasing a home in Boca Country Club or would like to learn more about country club communities in the area, please call us at 561-998-9015 . You may also reach us by completing the simple online contact form provided below and one of our Boca Raton property specialists will reach out to assist you. We at Champagne & Parisi Real Estate look forward to assisting you with all of your Boca Raton real estate needs! Looking for similar communities like Boca Country Club? See below... Boca Pointe Boca Lago Boca Greens Contact Us About Boca Raton Country Club First Name: Last Name: Email Address: Phone: Questions / Comments: Submit By proceeding, you expressly consent to receive texts at the number you provided, including marketing, from Champagne & Parisi Real Estate about real estate related matters, but not as a condition of purchase. Message frequency varies. You can text Help for help and Stop to cancel. You also agree to our Terms of Service and to our Privacy Policy regarding the information relating to you. Message and data rates may apply. Additionally, you expressly consent to receiving calls at the number you provided, including marketing by auto-dialer, pre-recorded or artificial voice, and email, from  Champagne & Parisi Real Estate about real estate related matters, but not as a condition of purchase. This consent applies even if you are on a corporate, state or national Do Not Call list. Messages may be processed by an automated system. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Other Boca Raton Country Club Communities Boca Country Club Boca Greens Boca Grove Boca Lago Boca Pointe Boca West Boca Woods Bocaire Broken Sound Polo Club Royal Palm Yacht & Country Club St. Andrews Country Club Stonebridge Woodfield Country Club Boca Raton Neighborhoods Boca Bath & Tennis Boca Falls Boca Marina Yacht Club Long Lake Estates Millpond New Floresta Newport Bay Club Oaks at Boca Raton Old Floresta Palm Beach Farms Parkside Royal Oak Hills Saturnia Seasons Timbercreek Woodfield Hunt Club View All Neighborhoods Featured Home Searches All Homes Newest Listings Pool Homes Country Clubs Schools No HOA Homes New Construction Price Reductions Waterfront Homes BoCa Raton Market Stats Pricing trends, average days on market, and more, updated every day. View All stats What's My Home's Value? Our professional analysis includes data on recent sales and current market trends. Find Out Now Search Homes Condos Townhomes Agents Blog Resources Contact Site Map Property Listings Champagne & Parisi Boca Raton Real Estate - Champagne & Parisi Real Estate 561.998.9015 | info@bocaratonrealestate.com Accessibility | Terms of Service | Privacy Policy | DMCA Notice © Copyright 2025 Champagne & Parisi Real Estate"
    }
  ]
}