{
  "fuentes": [
    {
      "url": "https://www.dorchestercollection.com/los-angeles/hotel-bel-air/dining/bar-lounge",
      "email": "restaurant.hba@dorchestercollection.com"
    },
    {
      "url": "https://www.dorchestercollection.com/los-angeles/hotel-bel-air/dining/bar-lounge",
      "email": "info.hba@dorchestercollection.com"
    },
    {
      "url": "https://www.dorchestercollection.com/los-angeles/hotel-bel-air/dining/bar-lounge",
      "email": "restaurant.hba@dorchestercollection.com"
    },
    {
      "url": "https://www.dorchestercollection.com/los-angeles/hotel-bel-air/dining/bar-lounge",
      "email": "u003einfo.hba@dorchestercollection.com"
    },
    {
      "url": "https://www.dorchestercollection.com/los-angeles/hotel-bel-air/dining/bar-lounge",
      "email": "u003erestaurant.hba@dorchestercollection.com"
    },
    {
      "url": "https://www.bolivar.gr/contact/",
      "email": "info@bolivar.gr"
    },
    {
      "url": "https://www.columbiarestaurant.com/ybor-city-tampa",
      "email": "carolineo@crg1905.com"
    },
    {
      "url": "https://www.columbiarestaurant.com/ybor-city-tampa",
      "email": "comments@crg1905.com"
    },
    {
      "url": "https://www.blubeach.com.mt/contact-us/",
      "email": "blubeachmanager@lifestyle-grp.com"
    },
    {
      "url": "https://www.blubeach.com.mt/contact-us/",
      "email": "info@blubeach.com.mt"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "ayoo@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "bcutts@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "boxoffice@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "cdungca@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "dht@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "dmatlin@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "doshima@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "elane@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "emcfadden@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "jmartin@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "kmatsuno@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "productions@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "rtandal@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "vgreen@diamondheadtheatre.com"
    }
  ],
  "mails": [
    "ayoo@diamondheadtheatre.com",
    "bcutts@diamondheadtheatre.com",
    "blubeachmanager@lifestyle-grp.com",
    "boxoffice@diamondheadtheatre.com",
    "carolineo@crg1905.com",
    "cdungca@diamondheadtheatre.com",
    "comments@crg1905.com",
    "dht@diamondheadtheatre.com",
    "dmatlin@diamondheadtheatre.com",
    "doshima@diamondheadtheatre.com",
    "elane@diamondheadtheatre.com",
    "emcfadden@diamondheadtheatre.com",
    "info.hba@dorchestercollection.com",
    "info@blubeach.com.mt",
    "info@bolivar.gr",
    "jmartin@diamondheadtheatre.com",
    "kmatsuno@diamondheadtheatre.com",
    "productions@diamondheadtheatre.com",
    "restaurant.hba@dorchestercollection.com",
    "rtandal@diamondheadtheatre.com",
    "u003einfo.hba@dorchestercollection.com",
    "u003erestaurant.hba@dorchestercollection.com",
    "vgreen@diamondheadtheatre.com"
  ],
  "nombre_sitio": "bolivarmiamibeach.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.dorchestercollection.com/los-angeles/hotel-bel-air/dining/bar-lounge",
      "text": "Mediterranean Food In Los Angeles | Bar & Lounge At Hotel Bel-Air The Dorchester 45 Park Lane London, UK Coworth Park Ascot, UK Le Meurice Hôtel Plaza Athénée Paris, France Hotel Principe di Savoia Milan, Italy Hotel Eden Rome, Italy The Beverly Hills Hotel Hotel Bel-Air Los Angeles, USA The Lana The Alba Dubai, UAE Tokyo Tokyo, Japan Explore our hotels Mayfair Park Residences London, UK AVA at Palm Jumeirah One at Palm Jumeirah The Lana Residences ORLA ORLA Infinity VELA VELA Viento The Alba Residences Dubai, UAE Explore all our RESIDENCES Festive Offers What's on Superior Room Deluxe Room Deluxe Room with Patio Grand Deluxe King with Patio and Fireplace Loft Studio Canyon Studio Junior Suite Junior Pool Suite Bel-Air Suite with Patio Canyon Suite with Plunge Pool and Fireplace Two-Bedroom Bel-Air Suite with Balcony Premier Canyon Suite with Plunge Pool and Fireplace Grand Suite Swan Lake Suite Patio Suite Grace Kelly Suite Stone Canyon Suite The Bell Suite Two-Bedroom Chalon Suite Presidential Suite EXPLORE ALL OUR ROOMS & SUITES The Restaurant at Hotel Bel-Air Bar & Lounge The Living Room The Pâtisserie at Hotel Bel-Air Explore our restaurants & bars Wellness Gifts About Pool Art Overview Gallery GLOBAL MENU Accessibility CONTACT BOOK Close Hotel Bel-Air Hotel Bel-Air HOTEL BEL-AIR BOOK Home Page / Los Angeles / Hotel Bel-Air / Dining / Bar & Lounge Bar & Lounge Where anecdotes abound The famously cool bar and lounge, where the stars come to party and the anecdotes abound. Menus Bar sample menu Opening hours Sunday – Thursday 3 – 11pm Friday and Saturday 3pm – 1am General information Dress code Smart casual Guests Adults only Vibe Stylish setting Entertainment Art Cuisine Drinks Nightly music Live entertainment The Bar & Lounge invites you to linger over a delicious cocktail while you enjoy our live music sessions every evening. ART Lining the walls Norman Seeff’s iconic photographs line the walls of the Bar & Lounge, capturing artists and innovators such Cher, Tina Turner and Steve Jobs in unique and unguarded moments. CUISINE To complement a cocktail or two The Bar & Lounge's afternoon and evening menu offers casual late-day and dinner fare, including a Mediterranean mezze platter or artisanal cheeses to share, as well as a selection of entrées. Drinks The finest tastes An inventive cocktail menu, utilising the freshest ingredients of the season paired with high-end spirits. 01 10 Restaurants and bars at Hotel Bel-Air explore all restaurants and bars For every occasion and every mood, Hotel Bel-Air has the restaurant for you. The place to be The Restaurant at Hotel Bel-Air The finest, locally-sourced ingredients crafted into a creative menu. Delivering modern Californian cuisine with a Mediterranean influence in a relaxed, yet elegant setting. This is LA dining at its stylish best. Book your table Explore Casual The Pâtisserie at Hotel Bel-Air Designed to evoke the nostalgia of a classic French boulangerie, yet carefully tailored to the relaxed California vibe that is Hotel Bel-Air. Order online Explore Cosy and intimate The Living Room Acting as a wonderful introduction to our legendary low-key glamour, this is an airy space of not only great beauty but somewhere to gather, meet with friends, and celebrate good times. Feel at home from the moment you arrive. Explore GIFTS & EXPERIENCES Worthy of any wishlist Share the Hollywood moment with our curated selection of gifts and experiences, inspired by Hotel Bel-Air. Explore Gifts & Experiences Get in touch with us Please get in touch if you have any questions about our hotels, a hotel reservation or a booking at one of our restaurants, bars or spas. Contact Be the first to know about our Dorchester Collection news and exclusive experiences Sign Up Hotels The Dorchester, London 45 Park Lane, London Coworth Park, Ascot Le Meurice, Paris Hôtel Plaza Athénée, Paris Hotel Principe di Savoia, Milan Hotel Eden, Rome The Lana, Dubai The Beverly Hills Hotel, Los Angeles Hotel Bel-Air, Los Angeles Tokyo – future opening The Alba, Dubai – future opening Residences Mayfair Park Residences, London AVA at Palm Jumeirah, Dubai One at Palm Jumeirah, Dubai The Lana Residences, Dubai ORLA, Dubai ORLA Infinity, Dubai VELA, Dubai VELA Viento, Dubai The Alba Residences, Dubai Media and sales Media Centre Collect magazine Diamond club Development Worldwide sales Get to know us About The Edit Careers Dorchester Collection Academy Environmental, Social & Governance Follow us Gifts Gifts Get in touch Contact Privacy policy Terms of use Digital accessibility Booking terms CCPA © 2025 Dorchester Services. All Rights Reserved. Close Contact us +1 310 909 1644 [email protected] Contact us"
    },
    {
      "url": "https://www.bolivar.gr/contact/",
      "text": "Get in touch - Bolivar Beach Club Home Restaurant Beach & Sun Check our Menu The Club Upcoming Events Past Events Buy tickets International DJ Lineup Photo Albums Video Channel RSV table / gazebo Boutique Get in touch Reservation Home Discover Bolivar Restaurant Beach & Sun The Club Upcoming Events Past Events Buy tickets Reserve a table International DJ Lineup Photo Albums Video Channel Check our Menu RSV table / gazebo Boutique Get in touch Facebook Instagram Twitter Youtube Tripadvisor Facebook Instagram Twitter Youtube Tripadvisor Home Discover Bolivar Restaurant Beach & Sun The Club Upcoming Events Past Events Buy tickets Reserve a table International DJ Lineup Photo Albums Video Channel Check our Menu RSV table / gazebo Boutique Get in touch Facebook Instagram Twitter Youtube Tripadvisor Facebook Instagram Twitter Youtube Tripadvisor Location / Opening Hours / Share your thoughts Get in touch Location Bolivar Beach Bar Leoforos Poseidonos Akti tou Hliou Beach Alimos 17455, Athens Greece Opening Hours Monday to Friday 08:00 - 05:00 Call / E-mail T: +30 210 9 831018 E: info@bolivar.gr Whatsapp Share your thoughts If you have questions or comments, please get a hold of us in whichever way is most convenient. Ask away. There is no reasonable question that our team can not answer. First Name Last Name Email Telephone Message Send Home Restaurant Beach & Sun The Club Check our Menu Boutique Get in touch Facebook-f Instagram Twitter Youtube Tripadvisor © Copyright 2025 Bolivar Beach Bar All rights reserved. Privacy Policy Terms & Conditions COVID-19 Regulations No products in the cart. Table Booking Name* Email* Phone* Date* Time* Seats* 1 person 2 people 3 people 4 people 5 people 6 people 7 people 8 people 9 people 10 people 11 people 12 people 13 people 14 people 15 people 16 people 17 people 18 people 19 people 20+ people Special Requests I consent to  Bolivar Beach Club  collecting my details through this form."
    },
    {
      "url": "https://www.columbiarestaurant.com/ybor-city-tampa",
      "text": "Ybor City, Tampa | Columbia Restaurant top of page Columbia Restaurant Since 1905 – Florida's Oldest Restaurant℠ Gift Cards Home Reservations Lunch & Dinner Reservations Group Dining & Catering Curbside Pickup Flamenco Show - Ybor City Locations View All Locations Ybor City, Tampa St. Armands Circle, Sarasota Historic District, St. Augustine Sand Key, Clearwater Celebration, Near Orlando Columbia Cafe at the TBHC Columbia Cafe at Tampa Airport Food & Drink Menus Recipes Curbside Pickup Group Dining & Catering Wine – Columbia Vino Club Our Story About Us In The News Media Kit Sponsorship & Donations FAQ Join Our Team Shop Gift Cards Gift Shop Ybor City, Tampa Live music, gourmet food and more than 120 years of history. Visit The Original Columbia Restaurant in Ybor City, Tampa. RESERVATIONS Hours Of Operation: 11 a.m. - 9 p.m. Sunday through Thursday 11 a.m. -  10 p.m. Friday & Saturday To Order Convenient Curbside Pickup: CALL NOW For Events, Banquets And Catering: Contact us 2117 E. 7th Ave., Tampa, FL 33605 Donation & Sponsorship Requests Lunch Menu dinner Menu Flamenco Show Named \"One of Florida's Top Restaurants\" since 1967. Located at 2117 E. 7th Ave., the Columbia Restaurant has a total of 52,000 square feet with seating for up to 1,700 customers and encompasses an entire city block. It earned the \"Distinguished Restaurants of North America Award of Excellence\" 2005 - 2008, one of the most prestigious awards in the fine dining industry. 1903 Cafe Dining Room The 1903 corner saloon transformed into the Columbia Restaurant in 1905, using the same iconic bar. Today, the Cafe Dining room is one of 15 dining rooms in the restaurant. Read More 1935 The Red Room Opened in 1935 with the Don Quixote dining room, then known as the Red Lounge bar in the 1960s and '70s, this dining room once featured entrances to the restaurant's secret speakeasy. Read More 1937 El Patio Balcony The balcony above the Patio Dining Room features exquisite hand-painted tiles and expansive access to natural light. Read More 2001 La Familia Dining Room The Familia de Casimiro was named in honor of the founder of the restaurant, Casimiro Hernandez Sr., and is designed to resemble a Spanish wine cellar, with space for private meetings. Read More 1920 La Fonda Dining Room Once its own restaurant neighboring the Saloon Columbia, La Fonda became a Columbia Restaurant dining room at the start of Prohibition. Read More 1937 Kings Room The Kings Dining room offers private dining and a dance floor for special events such as banquets and ceremonies.  Portraits of past and present Kings & Queens of the Krewe of the Knights of Sant' Yago of Gasparilla hang on the walls. Read More 1937 Sancho Panza Dining Room This dining room, named for Don Quixote's faithful companion, opened the same year as El Patio because of the success of the Don Quoxite Dining Room. Read More 2001 Andalucia Dining Room This is one of two new dining rooms built in the restaurant since the 1950s. The Andalucia dining room seats up to 80 people. Read More 1935 Don Quixote Dining Room When the Don Quixote Room opened in 1935 it became not only Tampa’s first air-conditioned dining room, but also featured colorful tiles depicting the windmill-tilting character of Cervantes’ classic novel. Read More 1937 El Patio Dining Room The colorful mosaic-tiled fountain in the Patio Dining Room has a statue in the middle called \"Arion and the Dolphin.” The statue is a replica of a sculpture found in the ruins of Pompeii. Read More 1955 El Siboney Dining Room Opening on New Year’s Eve 1955, the Siboney Room once featured two fountains, sculptures, paintings, tapestries and antiques. Today, this ballroom hosts flamenco performances and large banquets. Read More 2002 Don Quixote Mezzanine In 2001, 4th-generation caretaker Richard Gonzmart rebuilt the original Don Quixote Mezzanine from the room's opening in 1935. Read More Room By Room - Ybor Browse Gift Cards FAQ - Dress Code Feedback Hiring Restaurants By Location Accessibility Statement Donation Requests Follow Us Subscribe To Our Email Newsletter Email Subscribe © 2022 by Columbia Restaurant. Visit 1905Family.com To Learn About Our Sibling Restaurants. bottom of page"
    },
    {
      "url": "https://www.blubeach.com.mt/contact-us/",
      "text": "Contact Us – Blu Beach Club Restaurant and Lounge Bar Skip to main content Hit enter to search or ESC to close Close Search 0 Menu Book a Table Reserve a Sunbed 0 was successfully added to your cart. Menu Contact Us Today! GET IN TOUCH! If you have any questions please feel free to get in touch by calling us +35621387536 | +356 7938 7538 , by email , alternatively via Facebook Messenger To reserve a table online seamlessly, you may utilise our online system For group bookings, events, corporate inquiries, or exclusivity requests, kindly proceed to our groups and events request form Home About Menu Groups and Events Contact Us Contact : +356 2138 7536 +356 7938 7538 Location: Marfa Road Mellieha Opening Hours: Monday to Sunday - 8:00am till Late Deliveries: All day including evenings Close Menu Book a Table Reserve a Sunbed Home About Weekend Roast Menus Breakfast Menu Food Menu Special Menus Bottomless Brunch Menu Chef Tasting Menu Weekend Roast Spirits Golden Hour Groups & Events Events Setup Gift Vouchers News Contact Us We use cookies on our website to give you the most relevant experience by remembering your preferences and repeat visits. By clicking “Accept”, you consent to the use of ALL the cookies. Cookie settings ACCEPT Manage consent Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these cookies, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may have an effect on your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "text": "Staff & Board of Directors - Diamond Head Theatre Skip to content Box Office: (808) 733-0274 | Business Office: (808) 733-0277 Facebook Instagram YouTube LinkedIn Email Search for: Shows & Tickets Buy Tickets Season Subscriptions Seat Map Show Archive Subscriber Login Donate Annual Giving Capital Campaign Producer’s Club Sponsorship ‘Ilima Awards Auditions Show Auditions Shooting Stars Classes Year-Round Classes Summer Musical Theatre Experience Shooting Stars Instructors Scholarships About Staff & Board of Directors Instructors Volunteer Rentals News Show Archive Your New Theatre Theatrical Arts Building Make a Gift Sponsor a Seat Photos News Capital Campaign Donors Contact BUY TICKETS Staff & Board of Directors Jacque Vaughn 2025-07-23T06:29:51-10:00 STAFF & BOARD OF DIRECTORS We bring the magic of theatre to all Trevor Tamashiro, Executive Director Trevor joined Diamond Head Theatre as Executive Director in April 2023. Born and raised in Hawaii, and a graduate of Punahou School, he brings nearly 20 years of experience in nonprofit executive leadership. Trevor started his journey in New York City working for Broadway Dance Center. Other positions include: Chief Advancement Officer of The Diller-Quaile School of Music; Deputy Director of Saratoga International Theater Institute; and Deputy/Program Director for The Drama League of New York. Trevor is a member of the Association of Fundraising Professionals and is a Certified Fund Raising Executive (CFRE). He holds a degree in Theatre Arts from University of Miami, a Master of Business Administration degree from Pace University, and a Master of Science degree in Nonprofit Management from Columbia University. John Rampage, Artistic Director John Rampage is a performer, actor, choreographer, and director who has served as Diamond Head Theatre’s Artistic Director since 1995. He is the creative mastermind behind all of the theatre’s productions and programs, overseeing the curation of two or more shows each season and selects directors, musical directors, and set designers. His relationship with the theatre began in 1975 where he performed as Tommy Gilas in the 1975 production of Music Man. In the 1980s, Rampage danced and sang his way across the U.S. and Europe and returned in 1991 as choreographer of Evita. More than 120 productions have been shared with the community under his oversight. A 47-time Po‘okela Award winner for excellence in the theatre, John is also the recipient of the Hawaii State Theatre Council 2006 Pierre Bowman Award. OUR TEAM Dana Matlin Business Manager & Capital Campaign Coordinator 808.733-0277 (ext. 303) Krysta Matsuno Individual & Corporate Gifts Manager 808.733-0277 (ext. 306) Erin McFadden Director of Education & Shooting Stars 808.733-0277 (ext. 308) Brando Cutts Facilities & House Manager Volunteer Inquiries 808.733-0277 (ext. 310) Chandler Converse Production & Special Events Coordinator 808.733-0277 (ext. 304) Jamie Martin Box Office Manager 808.733-0277 (ext. 312) Mary Meinel Assistant Box Office Manager Kyle Sombrero Box Office Assistant & Concession Manager Skye Tonokawa Box Office Assistant Andrea Yoo Box Office & Admin Assistant 808.733-0277 (ext. 321) Emily Lane Costume Shop Manager 808.733-0277 (ext. 320) Candy Dungca Lead Stitcher 808.733-0277 (ext. 321) Kanani Sato Stitcher 808.733-0277 (ext. 321) Quinn Curammeng Stitcher 808.733-0277 (ext. 321) Dawn Oshima Lighting Supervisor, Master Stage Electrician 808.733-0277 (ext. 331) Brian Sullivan Technical Director Vincent Green Production Associate 808.733-0277 (ext. 333) Randy Tandal Production Associate 808.733-0277 (ext. 333) Kyle Conner Scene Shop Assistant Ryan Sullivan Scene Shop Assistant Cheyne Nomura House Manager Rochelle Uchibori House Manager Amy Sato Showtime Box Office Assistant Malia Connor Concession Manager Olga Moroz Concession Manager BOARD OF DIRECTORS Officers Colin Miwa CHAIR Trevor Bracher VICE CHAIR, Chair-Elect Mike Ching VICE CHAIR Matthew Pennaz VICE CHAIR Mark Wong VICE CHAIR Jennifer Tanabe SECRETARY Gabe Lee TREASURER Rick Chong IMMEDIATE PAST CHAIR Board Members Cathy Camp Sidney C. L. Char Wayne Chi Rick Ching Jennifer Diesman Uson Y. Ewart Elisia Flores Dennis Francis Candes Meijide Gentry Kay Hampton Randy Harris Todd Iacovelli Kathleen Lin-Hurtubise Mariko Lyons John Magauran, M.D. Tony Mizuno David Okabe Karyn R. Okada Laurence Paxton Nigel Pentland Richard M. Rand Paul M. Saito Kelly Sanders Dean Shigemura Travis Tanaka Sharen Wago Indru Watumull Carolyn A. Berry Wilson Wendell J. Wo Steven Wong Vernon Wong Anna Steenerson Young Diamond Head Theatre is America’s third oldest continuously running community theatre. We are an independent nonprofit that relies on community support. Diamond Head Theatre recognizes the use of diacritical markings in the modern orthography of Hawaiian language. These markings may be omitted to give you the best experience with our website. 520 Makapuu Avenue Honolulu, Hawaii 96816 Box Office Hours: Monday through Friday 10 am to 4 pm Box Office: (808) 733-0274 Business Office: (808) 733-0277 Click Here to Email Us SIGN UP FOR E-NEWS Subscriber Login FOLLOW US © 2024 Diamond Head Theatre | All Rights Reserved | Privacy Policy | About Accessibility | Site created by Transcendence Pacific. Toggle Sliding Bar Area Our Community Giving Campaign needs your kokua to build a new arts complex. Diamond Head Theatre is a 501(c)(3) nonprofit organization. FEIN 99-0073495 Page load link Go to Top"
    }
  ]
}