{
  "fuentes": [
    {
      "url": "https://www.naplesgolfguy.com/bonita-fairways/",
      "email": "matt@naplesgolfguy.com"
    },
    {
      "url": "https://www.naplesgolfguy.com/bonita-fairways/",
      "email": "info@naplesgolfguy.com"
    },
    {
      "url": "https://www.naplesgolfguy.com/bonita-fairways/",
      "email": "matt@naplesgolfguy.com"
    },
    {
      "url": "https://www.bonitafairways.com/contact/",
      "email": "travis@bonitafairways.com"
    },
    {
      "url": "https://www.bonitafairways.com/contact/",
      "email": "travissnyder@pga.com"
    },
    {
      "url": "https://www.bonitafairways.com/contact/",
      "email": "info@bonitafairways.com"
    },
    {
      "url": "https://www.bonitafairways.com/golf/scorecard/",
      "email": "info@bonitafairways.com"
    },
    {
      "url": "https://naplesgolfguy.com/golf-communities/bonita-fairways-golf-club/",
      "email": "matt@naplesgolfguy.com"
    },
    {
      "url": "https://naplesgolfguy.com/golf-communities/bonita-fairways-golf-club/",
      "email": "info@naplesgolfguy.com"
    },
    {
      "url": "https://www.spanishwellscountryclub.com/contact-us",
      "email": "gerald.beaudry@spanishwellscountryclub.com"
    },
    {
      "url": "https://www.spanishwellscountryclub.com/contact-us",
      "email": "cindy.holstineshiner@spanishwellscountryclub.com"
    },
    {
      "url": "https://www.spanishwellscountryclub.com/contact-us",
      "email": "ckelley@spanishwellscountryclub.com"
    },
    {
      "url": "https://www.spanishwellscountryclub.com/contact-us",
      "email": "dominic.dent@spanishwellscountryclub.com"
    },
    {
      "url": "https://www.spanishwellscountryclub.com/contact-us",
      "email": "dvolk@spanishwellscountryclub.com"
    },
    {
      "url": "https://www.spanishwellscountryclub.com/contact-us",
      "email": "jeffrey.gunning@spanishwellscountryclub.com"
    },
    {
      "url": "https://www.spanishwellscountryclub.com/contact-us",
      "email": "mark.antle@spanishwellscountryclub.com"
    },
    {
      "url": "https://www.spanishwellscountryclub.com/contact-us",
      "email": "rosgood@spanishwellscountryclub.com"
    },
    {
      "url": "https://www.spanishwellscountryclub.com/contact-us",
      "email": "siegfried.wroebel@spanishwellscountryclub.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "ayoo@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "bcutts@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "boxoffice@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "cdungca@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "dht@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "dmatlin@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "doshima@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "elane@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "emcfadden@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "jmartin@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "kmatsuno@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "productions@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "rtandal@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "vgreen@diamondheadtheatre.com"
    },
    {
      "url": "https://www.golflink.com/golf-courses/fl/bonita-springs/bonita-fairways",
      "email": "customerservice@golflink.com"
    },
    {
      "url": "https://www.bonitafairways.com/home/",
      "email": "info@bonitafairways.com"
    }
  ],
  "mails": [
    "ayoo@diamondheadtheatre.com",
    "bcutts@diamondheadtheatre.com",
    "boxoffice@diamondheadtheatre.com",
    "cdungca@diamondheadtheatre.com",
    "cindy.holstineshiner@spanishwellscountryclub.com",
    "ckelley@spanishwellscountryclub.com",
    "customerservice@golflink.com",
    "dht@diamondheadtheatre.com",
    "dmatlin@diamondheadtheatre.com",
    "dominic.dent@spanishwellscountryclub.com",
    "doshima@diamondheadtheatre.com",
    "dvolk@spanishwellscountryclub.com",
    "elane@diamondheadtheatre.com",
    "emcfadden@diamondheadtheatre.com",
    "gerald.beaudry@spanishwellscountryclub.com",
    "info@bonitafairways.com",
    "info@naplesgolfguy.com",
    "jeffrey.gunning@spanishwellscountryclub.com",
    "jmartin@diamondheadtheatre.com",
    "kmatsuno@diamondheadtheatre.com",
    "mark.antle@spanishwellscountryclub.com",
    "matt@naplesgolfguy.com",
    "productions@diamondheadtheatre.com",
    "rosgood@spanishwellscountryclub.com",
    "rtandal@diamondheadtheatre.com",
    "siegfried.wroebel@spanishwellscountryclub.com",
    "travis@bonitafairways.com",
    "travissnyder@pga.com",
    "vgreen@diamondheadtheatre.com"
  ],
  "nombre_sitio": "bonitafairways.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.naplesgolfguy.com/bonita-fairways/",
      "text": "Golf - Naples Golf Homes | Naples Golf Guy Property Search Golf Communities Naples Bonita Springs / Estero Fort Myers Greater Sarasota Bundled Equity Luxury Buyers Sellers Discover SWFL FAQ’s Dinning & Entertainment Shopping Beaches Calendar of Events Golf Accommodations Healthcare Arts & Attractions About Us Naples Golf Guy Team Downing Frye Realty Contact Us Testimonials Blog Property Search Golf Communities Naples Bonita Springs / Estero Fort Myers Greater Sarasota Bundled Equity Luxury Buyers Sellers Discover SWFL FAQ’s Dinning & Entertainment Shopping Beaches Calendar of Events Golf Accommodations Healthcare Arts & Attractions About Us Naples Golf Guy Team Downing Frye Realty Contact Us Testimonials Blog 239.370.0892 info@naplesgolfguy.com basic search FIND YOUR Dream Home Select a Property Type Single Family Residential Rentals Lots and Land Multifamily Residential Mobile Homes Commercial Select a City Naples Bonita Springs Marco Island Estero Fort Myers Fort Myers Beach Miromar Lakes North Fort Myers Captiva Sanibel Advanced Search Sell Your Home Golf Southwest Florida boasts over 200 golf clubs, offering a diverse selection of both private and public courses. This region is renowned as a premier destination for golf enthusiasts, featuring vibrant communities centered around the sport. In addition to its top-tier golf courses, Southwest Florida is home to some of the best golf stores and PGA teaching professionals, providing comprehensive resources for golfers of all skill levels. Private Golf Clubs Private Golf Clubs Explore more than 200 private golf clubs from Naples to Sarasota. Learn More Public Golf Clubs Public Golf Clubs Southwest Florida is home to some of the best golf courses in the state. Explore more than 25 public golf courses in the area. Learn More Golf Lessons Golf Lessons PGA Teaching professionals offering top-tier golf lessons in Southwest Florida. learn More Golf Stores Golf Stores Southwest Florida boasts a wide variety of golf stores catering to enthusiasts of all levels. Find a store near you. learn More About Naples Golf Guy For expert guidance in Southwest Florida real estate, contact Naples Golf Guy, Matt Klinowski P.A. Whether you’re looking to buy a single-family home or condo in Naples, Bonita Springs, Estero, Ft. Myers or Sarasota I can help. With over 20 years of experience, I offer valuable market information and insights into individual communities to help you find the perfect home and lifestyle in the best golf community to fit your needs. Reach out to me today to get started! Contact Matt: Matt@NaplesGolfGuy.com or at 239-370-0892 Stay in the know by subscribing to our newsletter Enter your email address 239.370.0892 info@naplesgolfguy.com ©2025 Naples Golf Guy Privacy Policy Accessiblity made by exploritech We serve cookies to analyze traffic and customize content on this site. Privacy & Cookie Policy Got It! Manage consent Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website, anonymously. Cookie Duration Description cookielawinfo-checkbox-analytics 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\". cookielawinfo-checkbox-functional 11 months The cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Functional\". cookielawinfo-checkbox-necessary 11 months This cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\". cookielawinfo-checkbox-others 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other. cookielawinfo-checkbox-performance 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Performance\". viewed_cookie_policy 11 months The cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Functional Functional Functional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features. Performance Performance Performance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. Advertisement Advertisement Advertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads. Others Others Other uncategorized cookies are those that are being analyzed and have not been classified into a category as yet. SAVE & ACCEPT"
    },
    {
      "url": "https://www.bonitafairways.com/contact/",
      "text": "Contact Us – Bonita Fairways Golf Club Skip to content Home Golf Flyover Hole by Hole Scorecard Player Card Club Rentals Gift Cards Golf Lesson Events Event Request Bobcat Cafe Menu Contact Us Home Golf Flyover Hole by Hole Scorecard Player Card Club Rentals Gift Cards Golf Lesson Events Event Request Bobcat Cafe Menu Contact Us Book Now Player Card Home Golf Flyover Hole by Hole Scorecard Player Card Club Rentals Gift Cards Golf Lesson Events Event Request Bobcat Cafe Menu Contact Us Home Golf Flyover Hole by Hole Scorecard Player Card Club Rentals Gift Cards Golf Lesson Events Event Request Bobcat Cafe Menu Contact Us Contact Us Bonita Fairways Golf Club 26740 Sammoset Way Bonita Springs, FL 34135 (239) 947-9100 info@bonitafairways.com Monday – Sunday – 7AM – 3PM Director of Operations Travis Snyder, PGA (239) 947-9100 Travis@bonitafairways.com Have questions? Get in touch! Name Last Name Email Phone Message I agree that my submitted data is collected and stored. Get in Touch Quick links Home About Us Our Team Testimonials Contact Us Get in Touch With Us ​​Your Premier Golf Destination In Southwest Florida Contact Us 26740 Sammoset Way Bonita Springs, FL 34135 info@bonitafairways.com (239) 947-9100 POWERED BY Copyright © 2025 Bonita Fairways Golf Club All Rights Reserved. Scroll to Top"
    },
    {
      "url": "https://www.bonitafairways.com/golf/scorecard/",
      "text": "Scorecard – Bonita Fairways Golf Club Skip to content Home Golf Flyover Hole by Hole Scorecard Player Card Club Rentals Gift Cards Golf Lesson Events Event Request Bobcat Cafe Menu Contact Us Home Golf Flyover Hole by Hole Scorecard Player Card Club Rentals Gift Cards Golf Lesson Events Event Request Bobcat Cafe Menu Contact Us Book Now Player Card Home Golf Flyover Hole by Hole Scorecard Player Card Club Rentals Gift Cards Golf Lesson Events Event Request Bobcat Cafe Menu Contact Us Home Golf Flyover Hole by Hole Scorecard Player Card Club Rentals Gift Cards Golf Lesson Events Event Request Bobcat Cafe Menu Contact Us Scorecard Quick links Home About Us Our Team Testimonials Contact Us Get in Touch With Us ​​Your Premier Golf Destination In Southwest Florida Contact Us 26740 Sammoset Way Bonita Springs, FL 34135 info@bonitafairways.com (239) 947-9100 POWERED BY Copyright © 2025 Bonita Fairways Golf Club All Rights Reserved. Scroll to Top"
    },
    {
      "url": "https://naplesgolfguy.com/golf-communities/bonita-fairways-golf-club/",
      "text": "Bonita Fairways Property Search Golf Communities Naples Bonita Springs / Estero Fort Myers Greater Sarasota Bundled Equity Luxury Buyers Sellers Discover SWFL FAQ’s Dinning & Entertainment Shopping Beaches Calendar of Events Golf Accommodations Healthcare Arts & Attractions About Us Naples Golf Guy Team Downing Frye Realty Contact Us Testimonials Blog Property Search Golf Communities Naples Bonita Springs / Estero Fort Myers Greater Sarasota Bundled Equity Luxury Buyers Sellers Discover SWFL FAQ’s Dinning & Entertainment Shopping Beaches Calendar of Events Golf Accommodations Healthcare Arts & Attractions About Us Naples Golf Guy Team Downing Frye Realty Contact Us Testimonials Blog 239.370.0892 info@naplesgolfguy.com Back to Bonita Springs / Estero Golf Communities Bonita Fairways Golf Club Bonita Fairways Golf Club in an executive golf course in Bonita Springs, Florida. Gordon Lewis designed the 3400-yard, par 61, 18-hole course which is open to the public. The beauty of the course is that it challenges your short game as well as your long game. There are seven par 4’s; the remainder are par 3’s. The back nine feature Florida-style hills and valleys, sand traps, and several small waterholes. The front nine keep you on your toes with larger waterholes, sand traps, and doglegs–all surrounded by a pristine nature preserve. When the game is over, stop by One More Round for a delicious lunch, a cool drink, or just a little friendly conversation. A course that’s perfect for all ages and levels. Bonita Fairways is one of the few golf communities offering new condos in a new neighborhood called Botanika. This new construction development is a three-building, 75-unit enclave offering buyers a selection of seven different floor plans ranging from a one-bedroom plus den up to a three-bedroom unit. Botanika residents will have access to their own exclusive clubhouse while also having access to the greater amenities of Bonita Fairways. In addition to the golf course, residents have access to a resort-style pool, a spa, tennis courts, pickleball, bocce ball and state of the art fitness center. Bottom Line The Naples Golf Guy Team specializes in helping buyers and sellers with their real estate needs in Southwest Florida Golf Communities. Contact us today for more information. Location: Bonita Springs, Florida Club Type: Semi-Private Membership Type: Pay as you play Real Estate Home Price Ranges Single Family: $460,000 – $700,000 View Homes for Sale Condos: $350,000 – $612,000 View Condos for Sale The Naples Golf Guy Team has more than 20 years of experience helping Buyers and Sellers with their real estate needs in Southwest Florida. Call, text, or email us today for more information. Stay informed with automatic property alerts… Learn what your home is worth… Sign up for our monthly market report Membership Fees Golf Fees: Pay as you Play Golf Dues: N/A Social Fee: N/A Social Dues: N/A Golf Course Information Bonita Fairways Course Number of Courses: 1 (18 Holes) Opened: 1993 Architect: Gordon Lewis Caddies Available: No Practice Range: No Own Your Own Cart: No Course Ratings / Scorecard Par: 61 Holes: 18 Yards Blue 3388 White 2785 Red 2338 Amenities Gated Community One Private Golf Course Clubhouse Resort-Style Pool Fitness Center Spa Tennis Courts Bocce Ball Courts Pickleball Courts Where is Bonita Fairways Golf Course Located Bonita Fairways Golf Course 9751 West Terry Street Bonita Springs, FL 34135 239.947.9100 Visit Club Website Back to Bonita Springs / Estero Golf Communities Note: We make every effort to make sure our information for this golf course is current and accurate. Information about the tees and membership change over time. Please feel free to email us at info@naplesgolfguy.com if you see any information that needs to be corrected. Stay in the know by subscribing to our newsletter Enter your email address 239.370.0892 info@naplesgolfguy.com ©2025 Naples Golf Guy Privacy Policy Accessiblity made by exploritech We serve cookies to analyze traffic and customize content on this site. Privacy & Cookie Policy Got It! Manage consent Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website, anonymously. Cookie Duration Description cookielawinfo-checkbox-analytics 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\". cookielawinfo-checkbox-functional 11 months The cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Functional\". cookielawinfo-checkbox-necessary 11 months This cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\". cookielawinfo-checkbox-others 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other. cookielawinfo-checkbox-performance 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Performance\". viewed_cookie_policy 11 months The cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Functional Functional Functional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features. Performance Performance Performance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. Advertisement Advertisement Advertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads. Others Others Other uncategorized cookies are those that are being analyzed and have not been classified into a category as yet. SAVE & ACCEPT"
    },
    {
      "url": "https://www.spanishwellscountryclub.com/contact-us",
      "text": "Contact Us, Driving Directions | Spanish Wells Golf Country Club 239.992.5100 | CONTACT US Skip to main content About About the Club FAQs & About the Community Club News Contact Us Dress Code About the Club FAQs & About the Community Club News Contact Us Dress Code Golf Download Our App Book A Tee Time The Course Golf Lessons Practice Facility Dress Code Download Our App Book A Tee Time The Course Golf Lessons Practice Facility Dress Code Join Lifestyle Events Weddings & Showers Banquets & Parties Outings & Tournaments Calendar of Events Weddings & Showers Banquets & Parties Outings & Tournaments Calendar of Events Dine Store Login Member Sign In Email Password Password is hidden Show Remember Me Sign In Forgot Password? Search Close Search Keyword Search Search Keyword Search Login Member Sign In Email Password Password is hidden Show Remember Me Sign In Forgot Password? 85° Wed 09/10 light rain 88°/78° Thu 09/11 clear sky 89°/79° Fri 09/12 overcast clouds 89°/76° Book A Tee Time Contact Us Get in touch or find driving directions to Spanish Wells Golf & Country Club X CONTACT INFORMATION ADDRESS 9801 Treasure Cay Lane Bonita Springs, FL 34135 PHONE Tel | 239.992.5100 Fax | 239.992.9623 Pro Shop | 239.992.5522 FEEDBACK Comments & suggestions welcome Call 888-986-0699 to share comments GET IN TOUCH OR FIND US Please submit your inquiry and a member from our team will in touch. You may also contact us by other means below; utilize the map below for directions. We hope to see you soon! CONTACT US FORM First Name Last Name Email Phone Subject Message Submit MEET THE TEAM SIEGFRIED WROEBEL, PGA, CMAA General Manager Email DEBBIE VOLK Office Manager Email CINDY HOLSTINE-SHINER Sales Manager Email CASEY KELLEY Director of Wellness & Fitness Email RICH OSGOOD Golf Course Superintendent Email JERRY BEAUDRY Executive Chef Email DOMINIC DENT Courts Professional Email MARK ANTLE Director Of Golf Email JEFF GUNNING Head Golf Professional Email LET'S GET SOCIAL FOLLOW US ON FACEBOOK Follow us on Facebook to know what events and specials are happening. TAG US ON INSTAGRAM Let's share photos! Check in on Instagram on your next visit. READ OUR REVIEWS See what others are saying about the course. Read reviews from past guests. BOOK A TEE TIME Don't pay fees! Book direct through our website. Book A Round DOWNLOAD OUR APP Find some of our best deals on our FREE app - download today! About Our App MANAGED BY QUICK LINKS Club Memberships Calendar of Events Golf Outings Online Store CONTACT US 239.992.5100 Submit an Inquiry facebook instagram ADDRESS 9801 Treasure Cay Lane Bonita Springs, FL 34135 Get Driving Directions PLAY GOLF CALL 239.992.5522 OR Book A Tee Time NEWSLETTER SUBSCRIBE TO GET THE LATEST NEWS AND OFFERS I consent to receive emails from Spanish Wells Golf and Country Club. I can unsubscribe anytime. Email Thank you for subscribing. Enter Another Email Subscribe Copyright © 2025. Spanish Wells Golf and Country Club. All Rights Reserved. Privacy Policy Terms of Use Accessibility Sitemap"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "text": "Staff & Board of Directors - Diamond Head Theatre Skip to content Box Office: (808) 733-0274 | Business Office: (808) 733-0277 Facebook Instagram YouTube LinkedIn Email Search for: Shows & Tickets Buy Tickets Season Subscriptions Seat Map Show Archive Subscriber Login Donate Annual Giving Capital Campaign Producer’s Club Sponsorship ‘Ilima Awards Auditions Show Auditions Shooting Stars Classes Year-Round Classes Summer Musical Theatre Experience Shooting Stars Instructors Scholarships About Staff & Board of Directors Instructors Volunteer Rentals News Show Archive Your New Theatre Theatrical Arts Building Make a Gift Sponsor a Seat Photos News Capital Campaign Donors Contact BUY TICKETS Staff & Board of Directors Jacque Vaughn 2025-07-23T06:29:51-10:00 STAFF & BOARD OF DIRECTORS We bring the magic of theatre to all Trevor Tamashiro, Executive Director Trevor joined Diamond Head Theatre as Executive Director in April 2023. Born and raised in Hawaii, and a graduate of Punahou School, he brings nearly 20 years of experience in nonprofit executive leadership. Trevor started his journey in New York City working for Broadway Dance Center. Other positions include: Chief Advancement Officer of The Diller-Quaile School of Music; Deputy Director of Saratoga International Theater Institute; and Deputy/Program Director for The Drama League of New York. Trevor is a member of the Association of Fundraising Professionals and is a Certified Fund Raising Executive (CFRE). He holds a degree in Theatre Arts from University of Miami, a Master of Business Administration degree from Pace University, and a Master of Science degree in Nonprofit Management from Columbia University. John Rampage, Artistic Director John Rampage is a performer, actor, choreographer, and director who has served as Diamond Head Theatre’s Artistic Director since 1995. He is the creative mastermind behind all of the theatre’s productions and programs, overseeing the curation of two or more shows each season and selects directors, musical directors, and set designers. His relationship with the theatre began in 1975 where he performed as Tommy Gilas in the 1975 production of Music Man. In the 1980s, Rampage danced and sang his way across the U.S. and Europe and returned in 1991 as choreographer of Evita. More than 120 productions have been shared with the community under his oversight. A 47-time Po‘okela Award winner for excellence in the theatre, John is also the recipient of the Hawaii State Theatre Council 2006 Pierre Bowman Award. OUR TEAM Dana Matlin Business Manager & Capital Campaign Coordinator 808.733-0277 (ext. 303) Krysta Matsuno Individual & Corporate Gifts Manager 808.733-0277 (ext. 306) Erin McFadden Director of Education & Shooting Stars 808.733-0277 (ext. 308) Brando Cutts Facilities & House Manager Volunteer Inquiries 808.733-0277 (ext. 310) Chandler Converse Production & Special Events Coordinator 808.733-0277 (ext. 304) Jamie Martin Box Office Manager 808.733-0277 (ext. 312) Mary Meinel Assistant Box Office Manager Kyle Sombrero Box Office Assistant & Concession Manager Skye Tonokawa Box Office Assistant Andrea Yoo Box Office & Admin Assistant 808.733-0277 (ext. 321) Emily Lane Costume Shop Manager 808.733-0277 (ext. 320) Candy Dungca Lead Stitcher 808.733-0277 (ext. 321) Kanani Sato Stitcher 808.733-0277 (ext. 321) Quinn Curammeng Stitcher 808.733-0277 (ext. 321) Dawn Oshima Lighting Supervisor, Master Stage Electrician 808.733-0277 (ext. 331) Brian Sullivan Technical Director Vincent Green Production Associate 808.733-0277 (ext. 333) Randy Tandal Production Associate 808.733-0277 (ext. 333) Kyle Conner Scene Shop Assistant Ryan Sullivan Scene Shop Assistant Cheyne Nomura House Manager Rochelle Uchibori House Manager Amy Sato Showtime Box Office Assistant Malia Connor Concession Manager Olga Moroz Concession Manager BOARD OF DIRECTORS Officers Colin Miwa CHAIR Trevor Bracher VICE CHAIR, Chair-Elect Mike Ching VICE CHAIR Matthew Pennaz VICE CHAIR Mark Wong VICE CHAIR Jennifer Tanabe SECRETARY Gabe Lee TREASURER Rick Chong IMMEDIATE PAST CHAIR Board Members Cathy Camp Sidney C. L. Char Wayne Chi Rick Ching Jennifer Diesman Uson Y. Ewart Elisia Flores Dennis Francis Candes Meijide Gentry Kay Hampton Randy Harris Todd Iacovelli Kathleen Lin-Hurtubise Mariko Lyons John Magauran, M.D. Tony Mizuno David Okabe Karyn R. Okada Laurence Paxton Nigel Pentland Richard M. Rand Paul M. Saito Kelly Sanders Dean Shigemura Travis Tanaka Sharen Wago Indru Watumull Carolyn A. Berry Wilson Wendell J. Wo Steven Wong Vernon Wong Anna Steenerson Young Diamond Head Theatre is America’s third oldest continuously running community theatre. We are an independent nonprofit that relies on community support. Diamond Head Theatre recognizes the use of diacritical markings in the modern orthography of Hawaiian language. These markings may be omitted to give you the best experience with our website. 520 Makapuu Avenue Honolulu, Hawaii 96816 Box Office Hours: Monday through Friday 10 am to 4 pm Box Office: (808) 733-0274 Business Office: (808) 733-0277 Click Here to Email Us SIGN UP FOR E-NEWS Subscriber Login FOLLOW US © 2024 Diamond Head Theatre | All Rights Reserved | Privacy Policy | About Accessibility | Site created by Transcendence Pacific. Toggle Sliding Bar Area Our Community Giving Campaign needs your kokua to build a new arts complex. Diamond Head Theatre is a 501(c)(3) nonprofit organization. FEIN 99-0073495 Page load link Go to Top"
    },
    {
      "url": "https://www.golflink.com/golf-courses/fl/bonita-springs/bonita-fairways",
      "text": "Bonita Fairways Golf Club, Bonita Springs, FL - Scorecard & Overview Join Now Log In Book a Tee Time Find a Course Learn Equipment Instruction Lifestyle Tour Golf Travel All Articles Resources Find Driving Ranges Find Golf Simulators About Us Find golf lessons Newsletter Join Now Log In Newsletter Search Courses Enter Keyword Home Courses FL Bonita Springs Public 3 2 Reviews Bonita Fairways Golf Club Designed by Gordon G. Lewis and opened in 1993 Bonita Fairways - Bonita Springs , Florida Course Details Scorecard Flyover Views Yardage Maps Reviews Nearby Courses Course Details Holes: 18 Par: 58 Length: 2950 yards Driving Ranges: No The 18-hole \"Bonita Fairways\" course at the Bonita Fairways Golf Club facility in Bonita Springs , Florida features 2950 yards of golf from the longest tees for a par of 58. The course rating is 0 and it has a slope rating of 0. The estimated green fees for 18 holes is $95. Designed by Gordon G. Lewis, the Bonita Fairways golf course opened in  1993. Estimated Green Fees $95 These rates are an estimate of what you might expect to pay at Bonita Fairways with a cart. Actual rates may vary. Fees are typically lowest Monday through Thursday and during twilight (late afternoon and evenings). Expect to pay the highest rates on weekends. Scorecard for Bonita Fairways HOLE 1 2 3 4 5 6 7 8 9 OUT 10 11 12 13 14 15 16 17 18 IN TOT Blue 0.00/0 300 185 285 153 270 300 160 110 155 1918 280 120 95 280 165 225 120 95 140 1520 3438 0.00/0 265 110 237 118 235 260 125 90 90 1530 245 95 65 235 130 200 90 90 105 1255 2785 0.00/0 230 100 198 81 220 240 85 75 85 1314 225 80 55 175 89 170 70 65 95 1024 2338 Par 4 3 4 3 4 4 3 3 3 31 4 3 3 4 3 4 3 3 3 30 61 Swipe to See full table Bonita Fairways Flyover Experience the course like never before with our Flyover feature. Get a bird's-eye view of each hole, helping you strategize your round and navigate the course with precision. Bonita Fairways Yardage Maps Plan your shots effectively with our Yardage Maps. Click on the yardage maps for detailed measurements on every hole, including distances to hazards and key landmarks, ensuring you make the right decisions on every swing. FRONT 9 BACK 9 HOLE 1 HOLE 2 HOLE 3 HOLE 4 HOLE 5 HOLE 6 HOLE 7 HOLE 8 HOLE 9 Load More Holes HOLE 10 HOLE 11 HOLE 12 HOLE 13 HOLE 14 HOLE 15 HOLE 16 HOLE 17 HOLE 18 Reviewer Photos What Golfers are Saying 3 Based on 2 Reviews Write a review Add a Photo Drop Photo Here or Click to Upload Submit The Golfin' G. Reviewed January 31, 2024 Jimmy Lynn – President of Lifestyle Management Group of Florida – has come a long way since we first met in 2011. After spending 10 years in the golf industry, running sales and marketing for the largest publisher of golf travel information in the world, I had taken a position outside of golf but was still doing a little writing about golf courses and equipment. On the occasions I was sent some equipment, I would head over to the driving range at Gateway Golf and Country Club. I had worked out a deal with then General Manager, Jimmy Lynn, mentioning his club’s facilities in those earlier articles. Our friendship grew and we ended up playing a fair amount of golf together. Life happened; Jimmy moved to a club down in Naples and I relocated to Lakeland to be closer to family. Fast forward 12 years and we both have new, successful career paths. Jimmy found an investor and they created Lifestyle Management Group of Florida which owns and/or manages four clubs in Southwest Florida:  The Club at Westminster, Quail Creek Village, Bonita Fairways, and The Club at Gateway. As a management company, LMGOF’s goal is to elevate each private club and make them relevant in every aspect of services, facilities, and finances, thus creating sustainability for the long term with elating membership. In the words of Jimmy Lynn, Bonita Fairways Golf Club in Bonita Springs “Is an amazing success story. During the season, the tee sheets are always full, and the Cafe is packed.” The par 61, 3500-yard golf course was designed by Gordon Lewis and is anything but a pushover with six holes in the 300-yard range. The golf course is surrounded by a nature preserve and the lakes that you’ll encounter as you play your way around the course will challenge both your short game and your long game as well! The course was renovated in the summer of 2021, and with its impeccable conditioning, it’s the perfect place to enjoy a quick round of golf with family and friends. Before your round, warm up your short game and putting stroke on the full-size putting green. There’s a fully stocked pro shop in case you need any last-minute necessities, and the Bobcat Café can handle your thirst and hunger before and after your round. Lifestyle Management Group of Florida has proven to be a top-notch golf management company in SW Florida. Lynn adds “We don’t want to be a big company but only want to be truly hands-on in all things we do and partner with the clubs we manage. If you need help or just want to talk shop please call Jimmy Lynn at 813-767-3855. I’ve known Jimmy for a long time and one thing is certain, he always delivers! Good things will come from Jimmy Lynn and his staff at LMGOF. Read More Michael Z. Reviewed February 21, 2011 Felt like robbed by poor service.  Booked tee time 3:03 by telephone call.  Specified we will do 18 holes.  Paid at the clubhouse for 18 holes, never got to 1st tee until 3:20.  Finished the front 9 by 5:05 because it was so cramped only to fined out the clubhouse had closed... could not use any washroom facilities which are none existing on the course.  Never got any further than the 10th hole because it was getting darker and we were busting at the bladder... It was alright to take our money and disappear at 5 o'clock sharp.  The course is not bad but I WOULD DEFINITELY NOT RECOMMEND IT BECAUSE OF THE POOR SERVICE.  Even on line booking tee times specifies past 4 o'clock bookings!!!!!  The person at the clubhouse must have known for sure how busy it was... the starter knew. Read More View More Courses in Bonita Springs Bonita Bay Club, Bay Island Course Private Year Opened: 2023 26680 Country Club Dr, Bonita Springs, FL, 34134 5 miles from the center of Bonita Springs view course details 18 Holes 72 Par 7,006 Yards Driving Range: Yes Bonita National Golf & Country Club, Bonita National Course Private Year Opened: 2015 17481 Bonita National Blvd, Bonita Springs, FL, 34135 6 miles from the center of Bonita Springs view course details 18 Holes 72 Par 7,019 Yards Driving Range: Yes The Colony Golf & Country Club, Colony Course Private Year Opened: 2016 4101 Pelican Colony Blvd, Bonita Springs, FL, 34134-6903 5 miles from the center of Bonita Springs view course details 18 Holes 72 Par 6,802 Yards Driving Range: Yes Copperleaf Golf Club, Copperleaf Course Private Year Opened: 2015 23101 Copperleaf Blvd, Bonita Springs, FL, 34135-8137 3 miles from the center of Bonita Springs view course details 18 Holes 72 Par 7,174 Yards Driving Range: Yes Bonita Bay Club, Creekside Course Private Year Opened: 1985 26680 Country Club Dr, Bonita Springs, FL, 34134 5 miles from the center of Bonita Springs view course details 18 Holes 72 Par 6,742 Yards Driving Range: Yes Spanish Wells Golf and Country Club, East Course Public Year Opened: 2018 9801 Treasure Cay Ln, Bonita Springs, FL, 34135-6810 5 miles from the center of Bonita Springs view course details book a tee time 9 Holes 36 Par 3,355 Yards Driving Range: Yes Palmira Golf Club, Egret Course Private Year Opened: 2022 28501 Matteotti Vw, Bonita Springs, FL, 34135-8090 5 miles from the center of Bonita Springs view course details 9 Holes 36 Par 3,732 Yards Driving Range: Yes The Nest Golf Club, Gator Course Private Year Opened: 2016 4450 Pelicans Nest Dr, Bonita Springs, FL, 34134-7911 5 miles from the center of Bonita Springs view course details 18 Holes 73 Par 7,042 Yards Driving Range: Yes Highland Woods Golf & Country Club, Highland Woods Course Private Year Opened: 2015 9100 Highland Woods Blvd, Bonita Springs, FL, 34135-2300 4 miles from the center of Bonita Springs view course details 18 Holes 72 Par 6,971 Yards Driving Range: Yes Hunter's Ridge Golf & Country Club, Hunter's Ridge Course Private Year Opened: 2022 12500 Hunters Ridge Blvd, Bonita Springs, FL, 34135-3401 4 miles from the center of Bonita Springs view course details 18 Holes 72 Par 6,167 Yards Driving Range: Yes The Nest Golf Club, Hurricane Course Private Year Opened: 2015 4450 Pelicans Nest Dr, Bonita Springs, FL, 34134-7911 5 miles from the center of Bonita Springs view course details 18 Holes 72 Par 6,808 Yards Driving Range: Yes Palmira Golf Club, Ibis Course Private Year Opened: 2021 28501 Matteotti Vw, Bonita Springs, FL, 34135-8090 5 miles from the center of Bonita Springs view course details 9 Holes 36 Par 3,671 Yards Driving Range: Yes Nearby cities with courses Estero 11 Courses Fort Myers 36 Courses Lehigh Acres 4 Courses Miromar Lakes 1 Course Naples 48 Courses 9751 W Terry St, Bonita Springs, FL 34135-4420 239-947-9100 Visit course website Caption Join the GolfLink Newsletter! Sign up for golf news, information, and special offers. SUBSCRIBE By signing up you agree to receive communications from GolfLink and select partners in accordance with our Privacy Policy . You may opt out of email messages/withdraw consent at any time. FOLLOW US JOIN OUR NEWSLETTER Sign up for golf news, information and special offers SUBSCRIBE SUPPORT About GolfLink Partner With Us Contact GolfLink Support Privacy Policy Terms of Use Do Not Sell my Personal Information FOLLOW US Copyright © 1996-2025, LoveToKnow Media . All rights reserved. GolfLink™ is a trademark or registered trademark of LoveToKnow Media in the United States and or other countries."
    },
    {
      "url": "https://www.bonitafairways.com/home/",
      "text": "Bonita Fairways Golf Club – ​​Your Premier Golf Destination In Southwest Florida Home Golf Flyover Hole by Hole Scorecard Player Card Club Rentals Gift Cards Golf Lesson Events Event Request Bobcat Cafe Menu Contact Us Home Golf Flyover Hole by Hole Scorecard Player Card Club Rentals Gift Cards Golf Lesson Events Event Request Bobcat Cafe Menu Contact Us Book Now Player Card YOUR PREMIER GOLF DESTINATION IN SOUTHWEST FLORIDA Bonita Fairways Golf Club Book a Tee Time Quickly book your tee time and hit the course hassle-free Learn More Golf Lessons Book your golf lesson online in seconds with PGA Certified Instructors and start improving today Learn More Club Rentals Reserve your club rentals online in seconds for a seamless round Learn More Gift Cards Give the gift of golf—purchase a Bonita Fairways gift card online today and make someone’s next round unforgettable! Learn More Hole-by-Hole Flyover Take an Aerial Tour of the Course Experience a stunning tour of the course and strategize your round of golf. BOOK NOW Best Local Golf Club Our championship course and elegant clubhouse provide the perfect backdrop for any occasion. With customizable packages, professional staff, and world-class amenities, we ensure every detail of your event exceeds expectations. Experienced event coordinators Professional photography services Tournament gift packages Professional instruction available Designed for Excellence Challenging yet rewarding experience that caters to golfers of all skill levels. Championship Golf Challenge your skills, with every hole offering a unique test of precision, strategy, and endurance. Premier Destination Golfers seeking world-class facilities, exceptional service, and an unforgettable playing experience Precision - Improvement - Confidence Customize Your Learning Coaching Book a lesson and start hitting longer, straighter, and more consistent shots! Pro Instructors Personalized coaching tailored to your swing and skill level! Award Winning World-class design come together for an unforgettable round Club Goals Helping players of all skill levels improve their game while enjoying world-class facilities What Our Guests Say About Bonita Fairways Golf Club “Excellent course conditions, affordable, welcoming, and they created a pleasant golfing experience that’s definitely worth coming back again.” Tim Voss Weekend Golfer “ The clubhouse dining experience is exceptional. It’s the perfect place to relax and enjoy a meal after a round of golf. like Greece and Rome, sports with religious & cultural rituals ” Michle Smith Sr. Instructor “ The clubhouse dining experience is exceptional. It’s the perfect place to relax and enjoy a meal after a round of golf. like Greece and Rome, sports with religious & cultural rituals ” Michle Smith Sr. Instructor “ The clubhouse dining experience is exceptional. It’s the perfect place to relax and enjoy a meal after a round of golf. like Greece and Rome, sports with religious & cultural rituals ” Michle Smith Sr. Instructor “ The clubhouse dining experience is exceptional. It’s the perfect place to relax and enjoy a meal after a round of golf. like Greece and Rome, sports with religious & cultural rituals ” Michle Smith Sr. Instructor OUR COURSES Experience the Golf Trip of Your Dreams With Us Golf Practice Sharpen your swing at our on-site golf practice facility featuring professional-grade hitting cages for all skill levels. Read More Walking or Riding Enjoy the convenience of a complimentary golf cart included with your round to enhance your experience on the course. Read More Pro-Shop Explore the latest golf apparel and accessories in our fully stocked Pro Shop, featuring top brands and stylish gear for every golfer, every season. Read More Restaurant & Bar Cuisine and handcrafted cocktails at our elegant Bobcat Cafe, where floor-to-ceiling windows offer panoramic views. Read More Courses Instructors Our experienced course instructors provide personalized guidance to help players of all skill levels improve their game and enjoy every round. Read More Golf Outings & Events Host unforgettable golf outings and events with us, complete with tailored packages, scenic views, and seamless coordination from start to finish. Read More About Us PREMIER GOLF DESTINATION IN SOUTHWEST FLORIDA Nestled in the heart of beautiful Bonita Springs, Florida. We are a privately owned 18 hole public executive golf course. Designed by Gordon Lewis, Bonita Fairways is a Par 61, 3500 yard golf course perfect for all ages and levels of golfing! 18 Holes of Golf Exclusive Tee Times PGA Certified Instructors Public and Private Lessons Book Lesson PRICING PLAN CUSTOM GOLF Summer Golf Packages As a member of our golf club, you gain access to an array of exclusive benefits and privileges. We ensure that your experience with us is nothing short of exceptional. Single Membership Summer Golf Package​ $550 yearly Get Started Free Range Balls, 7-day Advance Book, & Reciprocal Privileges for Tee Times What’s Includes: Premium Golf Glove Practice Facilities On Site Golf Professional Couples Membership Summer Golf Package​ $750 yearly Get Started Free Range Balls, 7-day Advance Book, & Reciprocal Privileges for Tee Times What’s Includes: Premium Golf Glove Bonita Fairways Golf Hat On Site Golf Professional Family Membership Summer Golf Package​ $950 yearly Get Started Free Range Balls, 7-day Advance Book, & Reciprocal Privileges for Tee Times What’s Includes: Premium Golf Glove Bonita Fairways Golf Hat Sleeve of Golf Balls Online Pro Shop Golf Cart Bag TaylorMade... $27.00 $45.24 Golf Gun Bag PGM CZ-33... $27.00 $45.24 Golf Gloves PGM CZ White... $27.00 $45.24 Golf Gloves Footjoy GTxt... $27.00 $45.24 Contact Us Have questions?\nGet in touch! Name Last Name Email Phone Message I agree that my submitted data is collected and stored. Get in Touch Quick links Home About Us Our Team Testimonials Contact Us Get in Touch With Us ​​Your Premier Golf Destination In Southwest Florida Contact Us 26740 Sammoset Way Bonita Springs, FL 34135 info@bonitafairways.com (239) 947-9100 POWERED BY Copyright © 2025 Bonita Fairways Golf Club All Rights Reserved. Scroll to Top"
    }
  ]
}