{
  "fuentes": [
    {
      "url": "https://www.groupon.com/biz/bonita-springs-fl/bonita-bay-marina",
      "email": "verify@r.groupon.com"
    },
    {
      "url": "https://www.eatatjacks.com/pages/our-story/",
      "email": "cropped-logo@3x-2-100x100.png"
    },
    {
      "url": "https://www.eatatjacks.com/pages/our-story/",
      "email": "cropped-logo@3x-2-150x150.png"
    },
    {
      "url": "https://www.eatatjacks.com/pages/our-story/",
      "email": "cropped-logo@3x-2.png"
    },
    {
      "url": "https://www.bonitabaymarina.net/backwaterjacks",
      "email": "adriannah@bonitabaymarina.net"
    },
    {
      "url": "https://www.claimsjournal.com/news/midwest/2020/05/28/297305.htm",
      "email": "newsdesk@claimsjournal.com"
    },
    {
      "url": "https://www.jacksrestaurant.ca/contact-us",
      "email": "lakefield@jacksrestaurant.ca"
    },
    {
      "url": "https://www.bonitabaymarina.net/about-bonita-bay-marina",
      "email": "tibel@bonitabaymarina.net"
    },
    {
      "url": "https://www.bonitabaymarina.net/about-bonita-bay-marina",
      "email": "tibel@bonitabaymarina.net"
    },
    {
      "url": "https://www.kbjacks.com/contact",
      "email": "jennyf@brginc.com"
    },
    {
      "url": "https://www.kbjacks.com/contact",
      "email": "jims@brginc.com"
    },
    {
      "url": "https://www.kbjacks.com/contact",
      "email": "resume@brginc.com"
    },
    {
      "url": "https://www.easyleadz.com/company/backwater-jacks",
      "email": "xxxx@bonitabaymarina.net"
    },
    {
      "url": "https://www.bonitabaymarina.net/drop-us-a-line",
      "email": "caras@bonitabaymarina.net"
    },
    {
      "url": "https://www.bonitabaymarina.net/drop-us-a-line",
      "email": "chef@bonitabaymarina.net"
    },
    {
      "url": "https://www.bonitabaymarina.net/drop-us-a-line",
      "email": "cory@bonitabaymarina.net"
    },
    {
      "url": "https://www.bonitabaymarina.net/drop-us-a-line",
      "email": "jaimed@bonitabaymarina.net"
    },
    {
      "url": "https://www.bonitabaymarina.net/drop-us-a-line",
      "email": "rob@sweetwaterlifestyles.com"
    },
    {
      "url": "https://www.bonitabaymarina.net/drop-us-a-line",
      "email": "stephenk@bonitabaymarina.net"
    },
    {
      "url": "https://www.bonitabaymarina.net/drop-us-a-line",
      "email": "tibel@bonitabaymarina.net"
    }
  ],
  "mails": [
    "adriannah@bonitabaymarina.net",
    "caras@bonitabaymarina.net",
    "chef@bonitabaymarina.net",
    "cory@bonitabaymarina.net",
    "cropped-logo@3x-2-100x100.png",
    "cropped-logo@3x-2-150x150.png",
    "cropped-logo@3x-2.png",
    "jaimed@bonitabaymarina.net",
    "jennyf@brginc.com",
    "jims@brginc.com",
    "lakefield@jacksrestaurant.ca",
    "newsdesk@claimsjournal.com",
    "resume@brginc.com",
    "rob@sweetwaterlifestyles.com",
    "stephenk@bonitabaymarina.net",
    "tibel@bonitabaymarina.net",
    "verify@r.groupon.com",
    "xxxx@bonitabaymarina.net"
  ],
  "nombre_sitio": "bonitabaymarina.net",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.groupon.com/biz/bonita-springs-fl/bonita-bay-marina",
      "text": "Backwater Jacks Restaurant, 27598 Marina Pointe Drive, Bonita Springs, FL - Groupon Download our app for exclusive deals Sell on Groupon English Chicago Sign In Beauty & Spas Beauty & Spas Massage Hair Removal Face & Skin Care Cosmetic Procedures Spas Hair & Styling Health & Fitness Weight Loss Nail Salons Dental Brows & Lashes Tanning Beauty & Spas Things To Do Things To Do Fun & Leisure Tickets & Events Kids Activities Sightseeing & Tours Sports & Outdoors Museums & Galleries Photography Amusement Parks Bowling Trampoline & Bounce Houses Boat Tours Classes Escape Games Arcades Things To Do Auto & Home Auto & Home Oil Change Auto Repair & Maintenance Car Wash Parking Home Services Cleaning Services Bedding Furniture Patio, Lawn & Garden Kitchen & Dining Auto & Home Food & Drink Food & Drink Restaurants Cafes & Treats Bakeries Bars Breweries, Wineries & Distilleries Groceries & Markets American Restaurants Asian Restaurants Latin American Restaurants Pizza Seafood Restaurants Steakhouse Food & Drink Gifts Gifts Recipient For Her For Him For Couples For Kids Occasion Birthday Anniversary Wedding Graduation Interest Foodies Relaxing Care Sports Fun Leisure Housewarming Travelers Learning Price Under $10 Under $20 Under $50 Under $100 $100+ More Trending gifts Personalized gifts Flowers, Sweets & Baskets Gift cards Gifts Local Local Beauty & Spas Personal Services Health & Fitness Retail Things To Do Food & Drink Auto & Home Improvement Home Services Gift Cards Local Travel Travel Air-Inclusive Waterparks Casinos Family Romantic Beach Destinations City Outdoor Activities All-Inclusive Cruises Culinary Luxury Spa & Wellness Unique Lodging Travel Goods Goods Health & Beauty Products Fragrance Hair Care Vitamins & Supplements Sexual Wellness Personal Care Skin Care Oral Care Health Care Cosmetics Bath & Body Men's Health & Beauty Massage Aromatherapy Shaving & Grooming For the Home Bedding Furniture Kitchen & Dining Luggage Outdoor Décor Patio, Lawn & Garden Mattresses & Accessories Storage & Organization Bath Home Appliances Floor Care & Cleaning Home Decor Office & School Supplies Seasonal Decor Women's Fashion Women's Clothing Women's Accessories Intimates Women's Shoes Maternity Clothing Personalized Gifts Photo Books Cards, Invitations & Stationery Canvas & Photo Art Custom Gifts & Gadgets Jewelry Clothing & Accessories Home Decor Kitchen Accessories Baby & Kids Pets Bags More Flowers, Sweets & Baskets CBD Cell Phones & Accessories Software Electronics Video Games Jewelry & Watches Men's Fashion Grocery & Household Auto & Home Improvement Sports & Outdoors Pet Supplies Baby & Kids Toys Goods Coupons Coupons Popular Brands Amazon Costco eBay Expedia Great Clips Hotels.com Macy's Nike Pizza Hut The Home Depot TurboTax Viator VistaPrint Walmart Wayfair Trending Betterhelp Booking.com Budget Cabela's Dick's Sporting Goods HBO Max Macy's Old Navy Paramount+ ProFlowers Sam's Club Shutterfly Sunglass Hut TaxSlayer Wayfair Coupons Blog Best 4th of July Sales & Promo Codes Sephora Sales Calendar 2024 Hobby Lobby 2024 Sales Calendar Amazon Prime Day Deals on July 16 & 17 Amazon Prime Discount: Do You Qualify? Amazon Music Unlimited Free 3-Month Trial Ulta 2024 Sales Calendar Back to School: Shop Tax-Free Weekends Nike Factory Outlet Stores Lowe's 2024 Sales Calendar Home Depot 2024 Seasonal Sales Guide Nordstrom Anniversary Sale Calendar Walmart Vision Center Price Guide Cheapest Diaper Deals this Week Macy's 2024 Sales Calendar Coupons Home Backwater Jacks Restaurant, Bonita Springs Backwater Jacks Restaurant, Bonita Springs 27598 Marina Pointe Drive, Bonita Springs, FL 34134 Deals at this location No deals are currently available at this location. This merchant doesn't have any deals and is not affiliated with Groupon. Please contact them directly for services. Is this your business? Similar deals Popular Gift Bowlero Up to 73% Off Bowling with Shoe Rental Included at Bowlero $103.52 $36 -65% 4.7 (67,059) Book Online Chicago White Sox 2025 Chicago White Sox - Up to 60% Off 333 West 35th Street, Chicago 3.5 mi $28.13 $11.20 /tk -60% Popular Gift Lucky Strike Bowling Lucky Strike: Up to 73% Off Bowling +  Included Shoe Rentals $103.52 $36 -65% 4.8 (1,444) How to reach us © MapTiler © OpenStreetMap contributors Backwater Jacks Restaurant 1123.1 mi 27598 Marina Pointe Drive, Bonita Springs, FL 34134 Closed Opening at 3:00 PM Closed Opening at 3:00 PM Call Directions Visit website Price Good for Kids Takes Reservations +12399923010 http://www.bonitabaymarina.net/backwater-jacks.htm About Backwater Jacks Restaurant Build your own burger at Bonita Bay Marina — this restaurant serves all-American food. A catering menu is also available if you're looking to dazzle the guests at your next shindig. The parking lot near Bonita Bay Marina will have you in and out in a jiffy. Stop putting off the best meal of your year and come into Bonita Bay Marina's restaurant for some good old American favorites! Customer Reviews 100% Verified Reviews All Groupon reviews are from people who have redeemed deals with this merchant. Review requests are sent by email to customers who purchased the deal. | | | | | | Trending in Groupon Groupon is your place for savings and discovery while exploring fun activities in your city and around the country. Explore categories Popular Things Nearby Things To Do In Popular Cities By Cities Coupons and Promo Codes Beauty & Spas Deep Tissue Massage Near You Full Body Massage Near You Teeth Cleaning Near You Lash Extensions Near You Keratin Treatment Near You Reflexology Near You Eyebrow Threading Near You Brazilian Wax Near You Pedicure Near You Day Spa Near You Lip Fillers Near You Tanning Near You Massage Near You Laser Hair Removal Near You Nail Salon Near You Couples Massage Near You Salon Near You Barber Shops Near You Hair Salons Near You Spa Near You Haircut Near You Botox Near You Facials Near You Waxing Near You Food & Drink Food Near You American Restaurants Near You Bars Near You Chinese Food Near You Indian Food Near You Italian Restaurants Near You Mexican Food Near You Pizza Near You Steakhouses Near You Sushi Near You Things To Do Fun Activities Near You Cheap Movie Tickets Events Near You Photography Classes Near You Kids Shows Near You Cheap Concert Tickets Things to Do Near You Amusement Parks Near You Arcade Near You Bowling Near You Escape Room Near You Kids Activities Near You Mini Golf Near You Museums Near You Trampoline Park Near You Zoos Near You Health & Fitness Eye Exam Near You Dentist Near You Teeth Whitening Near You B12 Shots Near You Pilates Near You Chiropractor Near You Dance Classes Near You Dermatologist Near You Fitness Classes Near You Colon Cleanse Near You Invisalign Near You Golf Near You Gyms Near You Weight Loss Clinic Near You Yoga Near You Automotive Oil Change Near You Car Detailing Near You Car Wash Near You Mechanic Near You Wheel Alignment Near You Personal Services Classes Near You Hobbies Near You Cooking Classes Near You Photographers Near You Home Services Air Duct Clening Near You Carpet Cleaning Near You Things To Do In Atlanta Things To Do In Austin Things To Do In Baltimore Things To Do In Boston Things To Do In Calgary Things To Do In Charleston Things To Do In Charlotte Things To Do In Chicago Things To Do In Dallas Things To Do In Denver Things To Do In Edmonton Things To Do In Houston Things To Do In Las Vegas Things To Do In Los Angeles Things To Do In Miami Things To Do In New York City Things To Do In Orlando Things To Do In Ottawa Things To Do In Philadelphia Things To Do In Phoenix Things To Do In Portland Things To Do In San Antonio Things To Do In San Diego Things To Do In San Francisco Things To Do In San Jose Things To Do In Seattle Things To Do In Tampa Things To Do In Toronto Things To Do In Vancouver Things To Do In Washington D.C. Things To Do In Indianapolis Atlanta Austin Baltimore Boston Calgary Charleston Charlotte Chicago Dallas Denver Edmonton Houston Las Vegas Los Angeles Miami New York City Orlando Ottawa Philadelphia Phoenix Portland San Antonio San Diego San Francisco San Jose Seattle Tampa Toronto Vancouver Washington D.C. 1-800-Flowers Coupons Adidas Promo Codes Amazon Promo Codes American Eagle Promo Codes Ancestry DNA Coupons ASOS Promo Codes Bed Bath & Beyond Coupons Boohoo Promo Codes eBay Coupons Edible Arrangements Coupons Forever 21 Coupons H&R Block Coupons Home Depot Coupons Kohl's Coupons L.L.Bean Coupons Lowe's Coupons Macy's Coupons Michaels Coupons Old Navy Coupons Quickbooks Coupons Samsung Coupons Sephora Coupons Target Coupons TJ Maxx Coupons Turbotax Service Codes Udemy Coupons Verizon Wireless Promo Codes Walmart Coupons Weight Watchers Coupons Zales Promo Codes Get the Groupon App Unlock up to 90% discounts on the go with the Groupon app! Exclusive deals, push notifications, and digital vouchers at your fingertips. Get the App 100M+ downloads Groupon Sites USA United Kingdom France Deutschland Italia España Polska Nederland Ireland UAE België Canada Australia Sign up for the latest deals By subscribing, I agree to the Terms of Use and have read the Privacy Statement . Follow Us Support Customer Support Report Infringement Refund Policies Merchant Class Action Settlement Notice Sell on Groupon Join Groupon Marketplace Run a Groupon Campaign How does Groupon work for Merchants Sponsor your Campaign Affiliate Program Vendor Code of Conduct Company About Groupon Jobs Press Investor Relations Management Team Quick Links Treat Yourself Things To Do Coupons Gifts for Occasions © 2025 Groupon, Inc. All Rights Reserved. Terms and Conditions Privacy Statement Do Not Sell or Share My Personal Information Accessibility Sitemap Customer Support Licenses"
    },
    {
      "url": "https://www.eatatjacks.com/pages/our-story/",
      "text": "Our Story - Jack's Family Restaurants Skip to content ALL ABOUT THE SOUTH OUR STORY CAREERS COMMUNITY SIGN UP LOGIN OUR STORY CAREERS COMMUNITY SIGN UP LOGIN Search ORDER ONLINE MENU BREAKFAST SANDWICHES DRINKS SIDES CHICKEN DESSERTS KIDS SALADS FEATURED LOCATIONS ALL ABOUT REWARDS™ CATERING CAREERS OUR STORY COMMUNITY PRIVACY POLICY IDEAS POLICY GIFT CARD POLICY SAFE FOOD HANDLING MENU FEATURED BREAKFAST SANDWICHES DRINKS SIDES CHICKEN DESSERTS KIDS SALADS ALL ABOUT REWARDS™ CATERING LOCATIONS ORDER ONLINE Our Story OUR ROOTS ALL ABOUT THE SOUTH COMMUNITY FIRST LEADERSHIP OUR ROOTS ALL ABOUT THE SOUTH COMMUNITY FIRST LEADERSHIP A SOUTHERN LEGACY In 1960, Jack’s fired up its very first grill in Homewood, Alabama. Our walk-up hamburger joint was an instant hit. Who could turn down our 10-cent sodas, 15-cent fries and 20-cent shakes? From the get-go, we had the best people serving up the best food you could find, and we treated our customers like family.\n\nAs our community has grown larger over the years, we’ve remained committed to values that go beyond our food—like giving back. And while times have certainly changed, one thing remains the same: good food and good people make for a great time, and that’s what helps our customers step into our Southern story every time they stop by. NO PLACE LIKE HOME Jack’s will always be proud to call the South home. As we continue to expand and innovate our offerings, the Southern hospitality our guests cherish still serves as a compass guiding our decisions. Can we please with over 250 locations in Alabama, Tennessee, Georgia and Mississippi, it’s safe to say Jack’s truly is “All About the South.” SOUTHERN STATE OF MIND We’d be nowhere without our communities. That’s why giving back and going the extra mile to provide our Jack’s family with the comfort they deserve is so important to us. Whether it’s through a holiday parade or a simple charity donation, our presence goes far beyond our restaurant walls—and we like it that way. LEADERSHIP Todd Bartmess CEO Todd Bartmess isn’t your stereotypical CEO. Since joining Jack’s in 2015, Bartmess has worked tirelessly to get up close and personal with all things Jack’s. From top level operations to visiting individual restaurants to meeting with our team members, he keeps a pulse on it all. He loves to be with the people who make the brand work everyday and has a passion for developing great leaders within the organization. He has more than 25 years of experience in managing quick service restaurants. Prior to coming to Jack’s, he was serving as President and CEO of Heartland Food LLC., the second largest franchise operator of Burger King Restaurants in the world. Throughout his diverse career, Todd has held a variety of roles for major brands including Burger King, Dunkin Brands, Boston Market and Taco Bell. In his spare time, Todd tries to stay active by hiking, biking, and running. He is also committed to serving his community by volunteering at his church and with Boy Scouts of America. He and his wife Judy have been married for 30 years and have two adult children – Melissa, mom to his ‘awesome’ granddaughter Aurora, and Conner who was recently married in August 2017. Depending on the day of the week, Todd’s favorite Jack’s items include: a double cheeseburger with extra pickles, chicken fingers with Comeback sauce or a smoked sausage and egg biscuit. Matthew Lallatin CFO, Jack’s Family Restaurants Matt joined Jack’s in October, 2016, and serves as Jack’s Chief Financial Officer. Prior to joining Jack’s, Matt worked in a variety of industries and with companies ranging in size from start-ups to global Fortune 10. Most recently, Matt was the CFO of CHEP North America, a leading global supply chain solutions company based in Atlanta. Prior to that role, Matt held a variety of progressively senior financial positions at Mrs. Fields, Savoy Pharmaceuticals, Kmart, and DaimlerChrysler. Matt holds a Masters of Business Administration degree from the Brigham Young University Marriott School of Management in Provo, Utah. He is married with five children and loves living in the Birmingham area and eating a delicious Big Bacon burger when he has the chance. Billie Jo Waara CMO, Jack’s Family Restaurants Billie Jo Waara, Chief Marketing Officer, joined Jack’s in January 2020. She is responsible for overall brand positioning, marketing, creative, media and culinary product development for this Southern company.  Since joining the team, Billie Jo has launched several strategic initiatives including key technology-enabled Guest occasions such as online ordering and loyalty rewards. She has led innovative marketing initiatives for several industries including hospitality, quick service restaurants, travel, tourism and retail for the past 20 years. Prior to joining Jack’s, Billie Jo served as the Chief Marketing Officer for other restaurant brands including Cicis Pizza and Taco John’s. Billie Jo’s previous experience includes advertising agency leadership, she was the Director of the South Dakota Office of Tourism and served as a locally elected official as the Minnehaha County Treasurer. Waara graduated from Augustana College with a double major in Business Administration and International Government, and received her MBA from the University of South Dakota. Billie Jo and her family recently moved to Birmingham and are having fun exploring the area’s many hiking and biking trails–they usually stop by Jack’s for fried chicken, mashed potatoes and lemonade milkshakes on their way back home. Dana Taylor COO/President, Jack’s Family Restaurants Dana Taylor joined Jack’s in 2021, and she’s served in a number of roles within Ops Services, Human Resources and Operations before becoming President & Chief Operating Officer. She is passionately committed to making Jack’s the best possible — improving day-to-day efficiencies while building a runway to allow Jack’s teams to grow and develop into future roles. Dana is a 15-year veteran who previously held finance, operations, innovation and strategy leadership roles with both Panera Bread and Bain & Company. She obtained her master’s from Harvard Business School and her bachelor’s in chemical engineering from the University of Texas. Her happy place is hiking or being at the beach with her husband, two daughters and their dogs. And while Jack’s famous biscuits are her absolute favorite, her daughters and husband can’t pass a Jack’s without asking for a milkshake! Chris Incorvati CTO, Jack’s Family Restaurants Chris joined Jack’s in August 2024 and serves at Chief Technology officer overseeing the Information Technology teams for Jack’s. Chris has 30+ years of restaurant experience as an operator and information technology leader. He has led award-winning teams recognized for innovations in technology and customer engagement. Prior to joining Jack’s, Chris led technology teams at Panera, Au Bon Pain, and Legal Sea Foods. While at Legal Sea Foods his team rolled out the first enterprise point of sale in the US and the first Ingenico pay at table devices in North America. Chris brings a unique perspective to information technology with a strong background in restaurant operations. He is passionate about restaurant technology working to simplify operator and guest experiences. He believes in the philosophy of “Unreasonable Hospitality”. Chris has a Bachelor of Arts degree in Communications from Westfield State University. Chris is an avid sports fan and is loving the college sport scene in Alabama. Chris’s favorite Jack’s items are the chicken fingers with comeback sauce and Jack’s famous biscuits. ABOUT US Our Story Leadership Team Commercials Delicious Deals CAREERS Apply Here! COMMUNITY News & Community Jacks Gives Back Jack’s Family Fund CONTACT US General Questions Donations & Requests Facebook Tiktok Youtube Instagram T&C PRIVACY POLICY IDEAS POLICY GIFT CARD POLICY SAFE FOOD HANDLING T&C PRIVACY POLICY IDEAS POLICY GIFT CARD POLICY SAFE FOOD HANDLING © 2025 JACK'S FAMILY RESTAURANTS, LP Close A- A+ Keyboard Navigation Readable Font Underline Links Show Links Clear cookies Images Greyscale Invert Colors Remove Animations Close"
    },
    {
      "url": "https://www.bonitabaymarina.net/backwaterjacks",
      "text": "Bonita Bay Marina top of page Proud Sponsor of the FineMark Women's Pro Tennis Championships. Home Classified Ads About the Marina Backwater Jacks About the Boat Club Contacts More Use tab to navigate through the menu items. Backwater Jacks Bar & Restaurant ​ Please call for Reservations and Events: 239-992-3010 ​ Backwater Jacks Summer Hours have Started! Thursday, Friday, and Saturday RESERVATIONS REQUIRED IF COMING FROM OUTSIDE THE GATES OF BONITA BAY Lunch Hours: 11:00am - 3:00pm Happy Hour & Bar Bites 3:00pm - 6:00pm Dinner Hours: 5:00pm - 8:00pm Reservations Dinner Menu Bar Bites Menu Backwater Jacks Hits Local TV! Welcome to Backwater Jacks! Welcome to Backwater Jacks! Play Video Share Whole Channel This Video Facebook Twitter Pinterest Tumblr Copy Link Link Copied Search videos Search video... Now Playing 01:50 Play Video Now Playing 02:24 Play Video Now Playing 01:47 Play Video Gallery We are proud to be the first restaurant in Lee County to endorse the Eat Local Lee initiative linking local food producers to consumers. Click Here Jacks To The Max! Our Jack's Pack Dining Rewards Program ​ Jack’s Pack is our dining rewards program. It was created to reward you for helping the restaurant stay open year-round as a dining amenity inside the gates for the entire Bonita Bay community. ​ The $350 + tax annual fee can almost pay for itself through exclusive member discounts – 10% off all food & beverage purchases, including in-home catering; 10% off purchases at our Marina Ships Store; and 2% off purchases of marine gasoline. Plus, only Jack’s Pack members can make advance reservations and request a seating area, including our new outdoor deck overlooking the Marina.  We are almost always crowded in-season, so Jack’s Pack members can be sure they will have a table waiting.  Non-members can call the same day and can’t request a seating area. ​ Joining is easy.  Ask for a Jack’s Pack application at the restaurant or Marina Ships Store during operating hours or click on the Jack’s Pack image above to print a copy. Membership is on a calendar year basis, but we offer a pro-rata rate from October 1st through year-end (no exceptions). Call the restaurant at 239-992-3010 or email Adrianna at adriannah@bonitabaymarina.net for more information. ​ We promise you won’t be disappointed! Join Our Email List Success! Message received. Send Follow us on social media! JP Gallery bottom of page"
    },
    {
      "url": "https://www.claimsjournal.com/news/midwest/2020/05/28/297305.htm",
      "text": "Lake of the Ozarks Business Owner Defends Actions Skip to content Insurance Journal Insurance Journal TV Academy of Insurance MyNewMarkets.com Carrier Management Featured Stories IMEs: The Secret Advantage in a Workers’ Compensation Claim NHTSA Is Probing 287K Chrysler Minivans Over Steering Issues Judge OKs Chap. 11 Plan for Diocese With $246M Claims Fund Search for News Search Front Page Most Popular AI & Technology Expert Viewpoints Research Videos/Podcasts Newsletters Lake of the Ozarks Business Owner Defends Actions By Jim Salter and Summer Ballentine | May 28, 2020 Email This Subscribe to Newsletter Email to a friend Facebook Tweet LinkedIn Print Article Article O’FALLON, Mo. — The owner of a business that hosted crowded pool parties over the Memorial Day weekend at Missouri’s Lake of the Ozarks says no laws were broken and safety measures were in place to protect against the spread of the coronavirus. Social media postings over the weekend showed large crowds of mostly young people without masks and not adhering to social distancing guidelines at pools along the central Missouri lake that is a popular weekend getaway for people in the state and the surrounding region. Many of photos and videos showed people in an area of the lake nicknamed “Party Cove.” Political leaders in St. Louis, St. Louis County and Kansas City, along with Kansas’ health secretary, encouraged 14-day self-quarantines for anyone involved in the parties. Some labeled the gatherings “reckless” and worried that revelers would return home after becoming unwittingly exposed to the virus that causes COVID-19 and potentially spread it to others. St. Louis County Executive Sam Page, a Democrat and a medical doctor, noted studies suggest people can be infected with the virus without feeling sick. Those people can then spread the virus to older adults and people with existing health problems who are more vulnerable to more severe illness, including pneumonia, and death. “The pictures that emerged from Lake of the Ozarks over the weekend were an international example of bad behavior,” Page said Wednesday. Backwater Jacks, a bar and restaurant that has a pool, was among the places with big crowds. Owner Gary Prewitt said in a statement that no laws were broken, though the images appeared to show people violating Republican Gov. Mike Parson’s state order requiring social distancing. Prewitt’s statement said temperatures were checked at the pool entrance by medical staff hired for the event and free bottles of hand sanitizer were distributed. Staff members were given the option not to work. The statement noted that the business is seasonal and about one-third of its busy season has already been lost due to coronavirus-related closures. “We stand by our decision to move forward with Memorial Day Weekend plans,” Prewitt’s statement said. Although Missouri’s social distancing order gives enforcement authority to both the state and local health departments, Parson has said enforcement responsibility lies with local health departments. The health director in one lake-area county, Osage, said he had no enforcement authority. The health director in Camden County, where Backwater Jacks is located, did not respond to email messages seeking comment. Parson allowed businesses and attractions to reopen May 4, but the state order requires 6-foot (2-meter) social distancing through at least the end of May. St. Louis and St. Louis County are just now phasing in reopening because COVID-19, the illness caused by the virus, was so devastating there. More than half of Missouri’s 12,291 confirmed cases have occurred in those locations, along with more than two-thirds of the state’s 686 deaths. Copyright 2025 Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Was this article valuable? Yes No Thank you! Please tell us what we can do to improve this article. Submit No Thanks Thank you! % of people found this article valuable. Please tell us what you liked about it. Submit No Thanks Here are more articles you may enjoy. Apollo Settles Suit Against Ex-Athene Executives Before Trial Hundreds of Workers Detained in Immigration Raid at Hyundai’s Billion-Dollar Georgia Facility Tropical Activity on Track to Increase After Quiet Atlantic Hurricane Peak Jury Rules Google Must Pay $425 Million in Class Action Over Privacy Want to stay up to date? Get the latest insurance news sent straight to your inbox. Email Address Submit Email This Subscribe to Newsletter Email to a friend Facebook Tweet LinkedIn Print Article Categories: Midwest News Topics: bad behavior , coronavirus-related closures , hand sanitizer , health director , Lake of the Ozarks , medical staff , self-quarantine , social distancing , temperatures screening Have a news tip? Email us at newsdesk@claimsjournal.com See All Comments (0) More News Tropical Activity on Track to Increase After Quiet Atlantic Hurricane Peak US Electric Car Uptake Will Slow Further on Trump Policies Former WhatsApp Employee Says Bosses Ignored Cybersecurity Flaws Independent Medical Examiners: The Secret Advantage in a Workers’ Comp Claim More News Features Read This Next Lake of the Ozarks Business Owner Defends Actions Report: Ransomware Attacks Costlier as Threat Actors Become More Systemic Buffett's Oregon Utility Says Fire Lawsuits Pose Shutdown Risk Former WhatsApp Employee Says Bosses Ignored Cybersecurity Flaws Independent Medical Examiners: The Secret Advantage in a Workers' Comp Claim Claims News Latest news Most Popular News News by Topic Yesterday Site Search Search Features AI & Technology Expert Viewpoints Claims Videos & Podcasts Claims Jobs Industry Events Newswire Connect with us Email Newsletters For Your Website RSS Feeds X (Twitter) Facebook LinkedIn Do Not Sell My Info Claims Journal Submit News Advertise Subscribe Contact Us Link to Us Wells Media Group Network Insurance Journal MyNewMarkets.com Insurance Journal TV Academy of Insurance Carrier Management © 2025 by Wells Media Group, Inc. Privacy Policy | Terms & Conditions | Site Map"
    },
    {
      "url": "https://www.jacksrestaurant.ca/contact-us",
      "text": "Contact Us – Jack's Family Restaurant Home PDF Menus Breakfast Menu Lunch & Dinner Menu Gallery Order Lakefield Contact Us Contact Us Contact Us Get In Touch With Us Lakefield Contact Info 1 Strickland Street (705) 652-3474 lakefield@jacksrestaurant.ca Open Hours Monday: 7:00 am - 8:00 pm Tuesday: 7:00 am - 8:00 pm Wednesday: 6:30 am - 8:00 pm Thursday: 6:30 am - 8:00 pm Friday: 6:30 am - 8:00 pm Saturday: 8:00 am - 8:00 pm Sunday: 8:00 am - 8:00 pm Contact Info 1 Strickland Street (705) 652-3474 jacks.lakefield.restaurant@gmail.com Hours Of Operation Summer Hours: Monday–Thursday: 8:00 AM – 7:30 PM Friday–Saturday: 8:00 AM – 8:00 PM Sunday: 8:00 AM – 7:30 PM Leave Us a Message Please use the form below to get it touch with us for any questions you may have Contact Us Name: Email: Subject: Message: Thank you for contacting us. We will get back to you as soon as possible. Oops, there was an error sending your message. Please try again later. © Copyright 2025 | All Rights Reserved | Jack's Family Restaurant Web Design By: Customer Contact Solutions Share by:"
    },
    {
      "url": "https://www.bonitabaymarina.net/about-bonita-bay-marina",
      "text": "Bonita Bay Marina top of page Proud Sponsor of the FineMark Women's Pro Tennis Championships. Home Classified Ads About the Marina Backwater Jacks About the Boat Club Contacts More Use tab to navigate through the menu items. About the Marina BONITA BAY MARINA Essential Information Phone: (239) 495-3222 Fax: (239) 495-0801 GPS Location: N26° 20.315 W 081° 49.677 Staff: Marina Manager/VP of Operations: Tibe Larson Dockmaster: Stephen Kildahl Ships Store Manager: Caraline Shapton Hours of Operation: 8:00 a.m. – 5:00 p.m. The Marina is open 7 days a week (closed Thanksgiving, Christmas Day, and New Year's Day). Selling A Boat? Try Our New Classified Ads Instructions Download Ad Form Marina-Recommended Vendors Click Here Updated Channel Chatter Click Here Take to the Water With Sweetwater Lifestyles! Widely considered the best charter service in Southwest Florida, Sweetwater has been a Bonita Bay tradition since 1992. Offering sunset cruises, dolphin tours, fishing charters and much more, Sweetwater Lifestyles is the ideal way to hit the water! Visit Now Visiting the Marina ​ If you are interested in visiting the Marina, please call us at 239-495-3222 so we can clear you through the Gate House the day of your visit. Having Your Boat Launched ​ Boats are launched between 8:30 am and 4:00 pm daily.  We utilize an online software product called BoatCloud to schedule launches.  When your boat arrives for storage, you will receive an email link to join BoatCloud.  To save time at the dock, you can request fuel and ice on the Boat Cloud, as well as live shrimp (during season from October through April).  Alternatively, you can call the Ships Store at 239-495-3222 one hour in advance to have your boat launched (subject to available launch times). ​ Using the Marina After Hours ​ Launching: Request a launch time through BoatCloud or call the Ships Store at 239-495-3222 before 3:30 p.m. Your boat will be tied to the floating dock for your use. Returning: Tie your boat to the floating dock; Marina staff will pull your boat in the morning. Holidays: For Christmas, Thanksgiving, and New Year's Day, please alert the Ships Store the day ahead if you would like to have your boat available. ​ Purchases & Payments ​ Boaters are encouraged to use their Marina account for Marina Purchases. Guests may pay via ACH, with Cash, Visa, or MasterCard. ​ Storage ​ The length of the boat is determined by measuring the distance from the back of the engine or platform to the front of the anchor or pulpit. Maximum draft at the Marina is 36” (per our permitting agreement). Storage is billed on the 25th day of the month for the upcoming month of storage. Click the link below for storage rates or call Tibe Larson at 239-495-3222 for more information and availability. ​ CLICK HERE TO STORAGE RATES ​ Work Racks ​ There are several work racks for boaters’ use, and can be used for washing, waxing, and repairs to the vessels. Racks are available on a first-come first- served basis. As a courtesy to other boaters, during the busy season please limit the time for washing of boats to ½ hour. All vessels must be out of the water to be washed. ​ Mobile Mechanics ​ For repairs required on vessels, there are several independent mobile mechanics available for assistance. If a vessel is under warranty, dealers are permitted to perform warranty work here as well. All vendors must have a Certificate of Insurance on file with the Marina. More information is available at the Ships Store. ​ Services Available Through the Marina ​ Please click the link below for services and rates available through the marina or call 239-495-3222 for more information or to request services. ​ CLICK HERE TO VIEW SERVICES ​ Safety Recommendations & Helpful Hints ​ The Marina monitors channel 72 VHF during normal operating hours. Towing insurance is recommended for all boat owners. Bonita Bay Marina has partnered with Tow Boat U.S. For more information please call Tow Boat U.S. directly at 239-945-1664. The US Coast Guard monitors VHF Channel 16 in case of an emergency. A waterway chart showing the route from the Bonita Bay Marina to the Gulf of Mexico is available at the Ships Store. The marked route is north from the Marina to New Pass. When there is a Hurricane Watch issued the marina may choose to bring some or all of the boats moored outside into dry dock for the storm. Boats who are affected will be billed a “hurricane haul out” fee. If you are concerned about a storm, call the marina at 239-495-3222, or e-mail tibel@bonitabaymarina.net The Marina is available for assistance with all your boating needs. Should you have any questions or need boating advice, please feel free to visit the Ships Store in person or by phone at 239-495-3222. Our friendly staff will be happy to assist you in every possible way. ​ ​ ​ bottom of page"
    },
    {
      "url": "https://www.kbjacks.com/contact",
      "text": "Contact Information | Kickback Jack's Jump to navigation Menu Locations Contact Donation Requests Order Online Aloca, TN Bristol, TN Asheboro, NC Danville, VA Durham, NC Fayetteville, NC Fredericksburg, VA Greensboro, NC (Battleground) Greensboro, NC (New Garden Rd) Greenville, NC Hickory, NC High Point, NC Johnson City, TN Mooresville, NC Raleigh, NC (Garner) Richmond, VA (Midlothian) Richmond, VA (W Broad St) Southern Pines, NC Suffolk, VA Wilmington, NC Winston Salem, NC Contact Kickback Jack's Kickback Jack’s® is owned and operated by Battleground Restaurant Group, Inc. **Please see our Location pages on the website to find the contact information for your local Kickback Jack's Restaurant Battleground Restaurant Group, Inc. P.O. Box 10398 Greensboro, NC 27408 P: 336.272.9355  (Headquarters Number) F: 336.369.3162 www.brginc.com Download Our Mobile App for Easy Ordering! Have A Question For Us? Name * Phone * Email * Subject * - Select - Comments/Feedback General Inquiry Real Estate Location * - Select - Raleigh, NC Danville, VA Greensboro, NC (Battleground Ave) Greensboro, NC (New Garden Rd) Fayetteville, NC Wilmington, NC Asheboro, NC Richmond, VA (West Broad St) Richmond, VA (Midlothian Turnpike) Fredericksburg, VA Greenville, NC Hickory, NC Southern Pines, NC Mooresville, NC High Point, NC Durham, NC Winston Salem, NC Johnson City, TN Suffolk, VA Aloca, TN Bristol, TN How can we help you? * © 2019 Kickback Jacks, LLC. All Rights Reserved. Digital Marketing and Design by COCG/. Menu Locations Careers Privacy Policy Contact"
    },
    {
      "url": "https://www.easyleadz.com/company/backwater-jacks",
      "text": "Backwater Jacks - Employees, Business, Industry & CEO | EasyLeadz Loading… Home Phone Number Finder Pricing EasyProspect Start Free Trial Schedule Demo Overview Top Contacts Financials Trademarks GST Competitors Technology Backwater Jacks - Employees, Business, Industry & CEO View Backwater Jacks's Top Management Contact Numbers Name Backwater Jacks Industry Restaurants Want to update? Headquarters Bonita Springs, Florida, United States Want to update? Website http://www.bonitabaymarina.net Want to update? Social Handles Want to update? Company Type Not Available Want to update? Company Stage Non Funded Want to update? CEO Not Available Want to update? Specialities Not available Want to update? Contact Number Not Available Want to update? Contact Email Not Available Want to update? Founder Not Available Want to update? No of employees 9 as on 25 Feb 2025 Want to update? Founded Year Not Available Want to update? Revenue 0 to 1 crores as on 25 Feb 2025 Want to update? Owned By Private Want to update? MNC No Want to update? Backwater Jacks Frequently Asked Questions Where are Backwater Jacks headquarters? Backwater Jacks headquarters are in Bonita Springs, Florida, United States. How many employees does  Backwater Jacks have? Backwater Jacks has 9 employees. What sector does  Backwater Jacks operate in? Backwater Jacks is in restaurants sector. What does Backwater Jacks Do ? Backwater Jacks is in to restaurants and related business category. What does Backwater Jacks specialize into ? We are not able to find any specialities related to Backwater Jacks at the moment. Who is the CEO of Backwater Jacks ? We do not have the information about the CEO of Backwater Jacks. Our systems are trying to find it, we will update it as soon as we have it. Backwater Jacks- Phone & Email of Top Employees & Directors Human Resources (HR) HR Head and director View xxxx@bonitabaymarina.net 98530***** CEO Chief Executive Officer View xxxx@bonitabaymarina.net 98650***** Founder and Cofounder Founder View xxxx@bonitabaymarina.net 98971***** MD Managing Director View xxxx@bonitabaymarina.net 98514***** Finance Finance Head and Director View xxxx@bonitabaymarina.net 98661***** Operations Operations Head and Director View xxxx@bonitabaymarina.net 98749***** Information Technology (IT) IT Head and Director View xxxx@bonitabaymarina.net 98936***** Sales Sales Head and Director View xxxx@bonitabaymarina.net 98848***** Marketing Marketing Head and Director View xxxx@bonitabaymarina.net 98488***** Purchase and Procurement Purchase Head and Director View xxxx@bonitabaymarina.net 98289***** Admin Admin Head and Director View xxxx@bonitabaymarina.net 98932***** Legal Legal Head and Director View xxxx@bonitabaymarina.net 98257***** CSR CSR Head and Director View xxxx@bonitabaymarina.net 98397***** Download our free EasyLeadz Chrome extension. Find contact numbers for 250M+ people on Internet directly. No Credit Card Required. One Click Signup. SIGN UP FOR FREE The most accurate data ever GDPR Compliant 150M Personal Emails 200M Work Emails 100M Direct Dials 250M Professional Profiles 30M Company Profiles Support Privacy Policies Terms of Service GDPR Opt-out Company About Us Our Data Contact Us Download our chrome extension Mr. E - Find B2B contacts universally Email us support@easyleadz.com Connect with us : X Want contacts of top management of Backwater Jacks? Try Mr. E's contact finder tool and fetch direct mobile numbers of decision-makers of all companies globally. Grow your sales now. Start Free Trial Free Trial with 5 contacts. No Credit Card Required. One-click Signup."
    },
    {
      "url": "https://www.bonitabaymarina.net/drop-us-a-line",
      "text": "Bonita Bay Marina top of page Proud Sponsor of the FineMark Women's Pro Tennis Championships. Home Classified Ads About the Marina Backwater Jacks About the Boat Club Contacts More Use tab to navigate through the menu items. Drop us a line! Please Contact Us ​ For all Marina inquiries, including slip rentals, please call: 239-495-3222 For all inquiries about Backwater Jacks restaurant, including private events, please call us at: 239-992-3010 ​ For all inquiries about Sweetwater Lifestyles Boat Club or any charter boats, including fishing & sunset charters, please call: 239-405-7155 You can reach key members of our team at the contacts below: ​ Meet the Team ​ Marina Captain Tibe Larson Vice President of Marina Operations 239-495-3222 tibel@bonitabaymarina.net Captain Stephen Kildahl Dock Master 239-495-3222 stephenk@bonitabaymarina.net Caraline Shapton Ships Store Manager 239-495-3222 caras@bonitabaymarina.net Backwater Jacks Cory Bass Manager & Chef 239-992-3010 cory@bonitabaymarina.net ​ Sweetwater Lifestyles & Adventures Captain Rob Michelsen Manager 239-405-7155 rob@sweetwaterlifestyles.com We would love to hear from you! Success! Message received. Send bottom of page"
    }
  ]
}