{
  "fuentes": [
    {
      "url": "https://bonnethouse.wordpress.com/contact-us/",
      "email": "lindaschaller@bonnethouse.org"
    },
    {
      "url": "https://bonnethouse.wordpress.com/contact-us/",
      "email": "monicaestevez@bonnethouse.org"
    },
    {
      "url": "https://bonnethouse.wordpress.com/contact-us/",
      "email": "nichollemaudlin@bonnethouse.org"
    },
    {
      "url": "https://bonnethouse.wordpress.com/contact-us/",
      "email": "patrickshavloske@bonnethouse.org"
    },
    {
      "url": "https://bonnethouse.wordpress.com/contact-us/",
      "email": "stephendraft@bonnethouse.org"
    },
    {
      "url": "https://www.wedding-spot.com/venue/3128/bonnet-house-museum-gardens/",
      "email": "awardwinner@2x.png"
    },
    {
      "url": "https://www.wedding-spot.com/venue/3128/bonnet-house-museum-gardens/",
      "email": "byob@2x.png"
    },
    {
      "url": "https://www.wedding-spot.com/venue/3128/bonnet-house-museum-gardens/",
      "email": "valet@2x.png"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "gabe@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "info@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "leadershipboard@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "olivia@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "oliviac@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "scott@journeysherwood.org"
    },
    {
      "url": "http://www.bonner.org/staff",
      "email": "ahoy@bonner.org"
    },
    {
      "url": "http://www.bonner.org/staff",
      "email": "cdavis@bonner.org"
    },
    {
      "url": "http://www.bonner.org/staff",
      "email": "info@bonner.org"
    },
    {
      "url": "http://www.bonner.org/staff",
      "email": "jengr@bonner.org"
    },
    {
      "url": "http://www.bonner.org/staff",
      "email": "liz@bonner.org"
    },
    {
      "url": "http://www.bonner.org/staff",
      "email": "meena@bonner.org"
    },
    {
      "url": "http://www.bonner.org/staff",
      "email": "nfo@bonner.org"
    },
    {
      "url": "http://www.bonner.org/staff",
      "email": "rhackett@bonner.org"
    },
    {
      "url": "http://www.bonner.org/staff",
      "email": "rshah@bonner.org"
    }
  ],
  "mails": [
    "ahoy@bonner.org",
    "awardwinner@2x.png",
    "byob@2x.png",
    "cdavis@bonner.org",
    "gabe@journeysherwood.org",
    "info@bonner.org",
    "info@journeysherwood.org",
    "jengr@bonner.org",
    "leadershipboard@journeysherwood.org",
    "lindaschaller@bonnethouse.org",
    "liz@bonner.org",
    "meena@bonner.org",
    "monicaestevez@bonnethouse.org",
    "nfo@bonner.org",
    "nichollemaudlin@bonnethouse.org",
    "olivia@journeysherwood.org",
    "oliviac@journeysherwood.org",
    "patrickshavloske@bonnethouse.org",
    "rhackett@bonner.org",
    "rshah@bonner.org",
    "scott@journeysherwood.org",
    "stephendraft@bonnethouse.org",
    "valet@2x.png"
  ],
  "nombre_sitio": "bonnethouse.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://bonnethouse.wordpress.com/contact-us/",
      "text": "contact us | bonnet house museum & gardens blog Search bonnet house museum & gardens blog Home about us contact us contact us questions? comments? need more info?  or high-res photos? have a media inquiry? interested in renting our property? want to schedule a group tour? give us a call…954.563.5393 (see extensions below) or shoot us an email… visit us at 900 north birch road, fort lauderdale, florida 33304 Home marketing & media contact monica estevez, monicaestevez@bonnethouse.org/ ext. 127 development, sponsorship info. patrick shavloske, patrickshavloske@bonnethouse.org/ext. 140 wedding planning  information nicholle maudlin, nichollemaudlin@bonnethouse.org/ ext. 120 educational programming, volunteering, & group tours linda schaller, lindaschaller@bonnethouse.org/ ext. 137 curatorial, exhibition info. stephen draft, stephendraft@bonnethouse.org/ ext. 138 Share this: Click to email a link to a friend (Opens in new window) Email Click to print (Opens in new window) Print Click to share on Facebook (Opens in new window) Facebook Click to share on Reddit (Opens in new window) Reddit Click to share on X (Opens in new window) X Like Loading... 2 Responses to “contact us” Peter Hayes 03/15/2012 at 3:21 pm # Hi we just visited yesterday, loved it. I was curious about the Bartletts home in Beverly MA (Whitehall) we live 2 towns away in Topsfield. It was demolished in 2004. Now a 27 Home development is located there. http://www.salemnews.com/local/x1150906117/Board-approves-27-houses-at-Chapmans-Corner http://www.manorhomesbeverly.com/history.htm Reply Tierra Loveless 04/30/2013 at 5:26 pm # My name is Tierra, and I have created a blog for my journalism class about music, and there is a picture on here that I would love to use, so if you want me to take it down, please email me and let me know. Reply Leave a comment Cancel reply Δ Archives Archives Select Month November 2014 August 2014 July 2014 June 2014 May 2014 April 2014 March 2014 February 2014 January 2014 December 2013 November 2013 October 2013 September 2013 August 2013 June 2013 February 2013 January 2013 November 2012 October 2012 September 2012 July 2012 April 2012 March 2012 January 2012 December 2011 November 2011 September 2011 August 2011 July 2011 June 2011 May 2011 April 2011 February 2011 December 2010 November 2010 Email Subscription Enter your email address to subscribe to this blog and receive notifications of new posts by email. Email Address: Sign me up! Join 1,630 other subscribers September 2025 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 « Nov Flickr Photos More Photos Twitter Updates Tweets by bonnethouse Create a free website or blog at WordPress.com. Privacy & Cookies: This site uses cookies. By continuing to use this website, you agree to their use. To find out more, including how to control cookies, see here: Cookie Policy Subscribe Subscribed bonnet house museum & gardens blog Join 27 other subscribers Sign me up Already have a WordPress.com account? Log in now. bonnet house museum & gardens blog Subscribe Subscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar Loading Comments... Write a Comment... Email (Required) Name (Required) Website %d Design a site like this with WordPress.com Get started"
    },
    {
      "url": "https://www.wedding-spot.com/venue/3128/bonnet-house-museum-gardens/",
      "text": "Bonnet House Museum & Gardens | Venue - Fort Lauderdale, FL | Wedding Spot You need to enable JavaScript to run WS React Application. ☰ Alabama » Alaska » Arizona » Arkansas » California (Northern) » California (Southern) » Colorado » Connecticut » Delaware » Washington DC » Florida » Georgia » Hawaii » Idaho » Illinois » Indiana » Iowa » Kansas » Kentucky » Louisiana » Maine » Maryland » Massachusetts » Michigan » Minnesota » Mississippi » Missouri » Montana » Nebraska » Nevada » New Hampshire » New Jersey » New Mexico » New York » North Carolina » North Dakota » Ohio » Oklahoma » Oregon » Pennsylvania » Rhode Island » South Carolina » South Dakota » Tennessee » Texas » Utah » Vermont » Virginia » Washington » West Virginia » Wisconsin » Wyoming » Mexico » Costa Rica » Caribbean Islands » See all regions Hotel Room Blocks Browse Venues Blog Sign In Join as a Venue What's Popular Not in Northern California ? See our other Locations . Price this venue to get your estimate, no strings attached. PRICE THIS VENUE Price this venue to get your estimate, no strings attached. PRICE THIS VENUE Price this venue to get your estimate, no strings attached. PRICE THIS VENUE 1 / 8 Photo by: Neo Art Photography Report Bonnet House Museum & Gardens 954-703-2608 CALL VENUE FAVORITE Venue highlights Award winner BYO Valet parking Venue details Style: Historic/Landmark Building, Museum/Gallery, Mansion, Private Estate, Park/Garden Guest capacity: Accommodates up to 350 guests Services: Ceremony / Reception Outdoor VIEW OPTIONS Location: 900 North Birch Road Fort Lauderdale, FL 33304 Awards: Description: Located along the edge of the Atlantic coast on Birch Road, the Bonnet House Museum & Gardens is a tropical and romantic place to tie the knot in Fort Lauderdale. Positioned on 35-acres of lush lawns and gardens, this venue features a stunning blend of indoor and outdoor spaces. Best suited for brides and grooms hoping to say ‘I do’ outdoors, the Museum & Gardens provides private use of the courtyard and surrounding gardens for your special day. Equipped with a Spanish style architecture, stone walkways, and stately fountains, this venue makes it easy capture the captivating wedding day photos you always dreamed of. Whether you prefer the aromatic atmosphere of the hibiscus garden, awe-inspiring view of the courtyard, or the cozy setting of the lawn, every space at the venue features a mixture of bold details and subtle accents. If you are searching for a memorable location to host an unforgettable wedding and reception, the Bonnet House Museum & Gardens is a natural choice. READ MORE Additional details Service Options Venue notes The rental fee ranges from $4,200 to $9,000 for a ceremony and reception and includes 4 hours of event time excluding set up and clean up time. The fee for a ceremony only wedding starts at $1,000. Additional hours can be arranged for a fee of $850/hr. A refundable security deposit of $1,000 is required. Amenities and Restrictions Amenities - Wedding planning services - Bride's dressing area - Dance floor - Outdoor lighting - Security - Day-of coordinator - No kitchen - Large parking lot Restrictions - BYO alcohol - Venue must approve all decorations - General liability insurance required - No rice, birdseed, confetti, etc. - Choose from a list for catering - Amplified music OK indoors and outdoors - Smoking in designated areas only - Alcohol must be served by licensed bartender/caterer - Music must end by 11:30PM Amenities - Wedding planning services - Bride's dressing area - Dance floor - Outdoor lighting - Security - Day-of coordinator - No kitchen - Large parking lot Restrictions - BYO alcohol - Venue must approve all decorations - General liability insurance required - No rice, birdseed, confetti, etc. - Choose from a list for catering - Amplified music OK indoors and outdoors - Smoking in designated areas only - Alcohol must be served by licensed bartender/caterer - Music must end by 11:30PM Bonnet House Museum & Gardens 954-703-2608 CALL VENUE FAVORITE Venue Highlights Award winner BYO Valet parking STARTING AT $7,790 FOR 50 GUESTS Price this venue to get your customized estimate, no strings attached PRICE THIS VENUE Interested in this venue? Don't miss out! Message this venue now to check their availability and receive more information. No commitment required. CONTACT VENUE PRICE VENUE CONTACT VENUE Service options Ceremony Outdoor only Max Outdoor capacity: 350 Reception Outdoor only Max Outdoor capacity: 250 STARTING AT $7,790 FOR 50 GUESTS Price this venue to get your customized estimate, no strings attached PRICE THIS VENUE Contact First name Last name Email Number of guests Preferred wedding date My dates are flexible Your message Hi,\nI found you on Wedding Spot and I would like to receive more information about having a wedding at your venue. By submitting this inquiry, you accept our Terms of Service and Privacy Policy . Send Message no thanks, take me back Your Privacy Choices Report Photo(s) What's the issue? * Inappropriate content Not my venue Infringes my rights Your email address * Additional information * Which photo(s) should be taken down; your role i.e. employee of the venue, owner of the venue, photographer) Submit Cancel | © 2025 Cvent Inc. privacy policy | terms of service Your Privacy Choices Wedding Spot Home About Services Find Venue Venues By Region Hotel Room Blocks News Press Releases In The News Spot Blog Terms Terms Of Service Privacy Policy Your Privacy Choices Help Contact Us FAQ How It Works"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "text": "Leadership Team — Journey Church New Here? Find Us Plan a Visit Leadership Team About Us Who We Are What We Believe Journey Kids Journey Youth Journey Women Journey Men Partners Next Steps Discipleship Bands Connection Card Serve Need Prayer? Journey Groups Be Baptized Membership at Journey Need Help? Summer at Journey Messages Give LiveStream New Here? Find Us Plan a Visit Leadership Team About Us Who We Are What We Believe Journey Kids Journey Youth Journey Women Journey Men Partners Next Steps Discipleship Bands Connection Card Serve Need Prayer? Journey Groups Be Baptized Membership at Journey Need Help? Summer at Journey Messages Give LiveStream Leadership Team New Here Find Us Plan a Visit Leadership Team Journey Church Staff Team Scott Edinger Lead Pastor scott@journeysherwood.org Olivia Pothoff Pastor of Worship & Care olivia@journeysherwood.org Gabe Nielsen Director of Journey Youth gabe@journeysherwood.org Olivia Cuddeford Director of Journey Kids oliviac@journeysherwood.org Journey Church Leadership Board The Leadership Board at Journey Church is made up of six members of the Journey Church family and the Lead Pastor. They are assigned to help guide, equip, and empower the pastors and staff at Journey Church to fulfill the mission and vision that God has uniquely given us. Our current Leadership Board members: Megan O’Connell, Jon Burgi, Lacey McNay, Ed Hatch, Amy Schlapper, Josh Thoreson. If you have any questions for the Leadership Board please email: leadershipboard@journeysherwood.org Back to Top Events Messages FOLLOWING JESUS TOGETHER Phone 503.610.0759 Email info@journeysherwood.org Gather 22689 SW Pine Street, Sherwood, OR Mail PO Box 322, Sherwood, OR 97140 Subscribe To Our Weekly Update Sign up with your email address to receive our weekly email updates. First Name Last Name Email Address Sign Up We respect your privacy. Thank you for signing up for our Weekly Update!"
    },
    {
      "url": "http://www.bonner.org/staff",
      "text": "Staff —  The Corella & Bertram F. Bonner Foundation Bonner Foundation Staff Home About Mission History Staff Contact Job Openings Announcements Programs The Bonner Program Crisis Ministry Program Initiatives Career Connections Capacity-Building Projects Community-Engaged Learning Capstone Projects Pathways Project Policy Research Social Action Student Impact Survey Streamlining Operations Training, Education & Reflection Opportunities Apply to be a Bonner Bonner Alumni Network Start a Bonner Program Graduate School Partnerships Bonner National Partners Meetings 2025 New Bonner Staff Orientation Fall 2025 Bonner Congress Meeting Fall 2025 Bonner Network Meeting News The Corella & Bertram F. Bonner Foundation Home About Mission History Staff Contact Job Openings Announcements Programs The Bonner Program Crisis Ministry Program Initiatives Career Connections Capacity-Building Projects Community-Engaged Learning Capstone Projects Pathways Project Policy Research Social Action Student Impact Survey Streamlining Operations Training, Education & Reflection Opportunities Apply to be a Bonner Bonner Alumni Network Start a Bonner Program Graduate School Partnerships Bonner National Partners Meetings 2025 New Bonner Staff Orientation Fall 2025 Bonner Congress Meeting Fall 2025 Bonner Network Meeting News About Mission History Staff Contact Job Openings Announcements Board of Trustees Charles C. Goodfellow , Chair, former Bank of New York Investment Officer (Cranford, NJ) William Bush , BDT & Company (Chicago, IL) Bernie Flynn, former President & CEO of New Jersey Manufacturers Insurance Group (West Trenton, NJ) and Chief Executive Officer of Mercer Street Friends (Trenton, NJ) Shannon Maynard , Executive Director, Congressional Hunger Center (Washington, DC) and Bonner Alum (University of Richmond) Dr. Beth Paul , President, Nazareth College (Rochester, NY), and former Provost at Stetson University (FL) and Faculty Member at The College of New Jersey (NJ) Tony Richardson , President of the George Gund Foundation (Cleveland, OH) and Bonner Alum (Oberlin College) Staff Robert Hackett , President rhackett@bonner.org Robert Hackett joined the Bonner Foundation in 1992 as Vice President and Director of the Bonner Scholars Program and assumed the role of President in July, 2010. Prior to joining the Bonner Foundation, Bobby worked at the Telesis Corporation, an affordable housing developer in Washington, D.C. With his friend Wayne Meisel, Bobby helped start Campus Outreach Opportunity League (COOL) in 1984, serving as its managing director of the during its first three years of operation. COOL organized initiatives that promoted the development of the national service movement and the role of students as leaders within it. In addition, Bobby worked in various capacities with the Youth Policy Institute, a Washington, D.C.-based non-partisan organization that researches and reports on public policies and evidence-based program models on social issues, especially those relating to young people. Bobby received his bachelors degree from Harvard University in 1985 and a masters in public and private management from Yale University's School of Organization and Management in 1990. Bobby oversaw the Foundation’s work, funded by Learn & Serve America, to seed community-based research at more than 30 colleges and universities and efforts. He also led the Foundation’s efforts to   to replicate the Bonner Scholar Program model using AmeriCorps Education Awards. Bobby has continued to expand and deepen the integration of community-driven projects and capacity building (including public policy research) through the development of Bonner’s Know Your Issue curriculum, which teaches students to investigate the root causes and potential solutions to pressing problems. Bobby has worked over the past decade to integrate the teaching of social action into academic courses across the country and world. This work is done in partnership with Dr. Scott Myers Lipton, professor emeritus of San Jose State University, whose course model has students learning social action by doing it during the semester the course is taught. Ariane Hoy , Vice President for Program and Resource Development ahoy@bonner.org Dr. Ariane Hoy joined the Foundation in 2004. As Vice President, Ariane leads strategic initiatives to promote program quality and deeper, more pervasive campus-wide engagement. Ariane serves on the national advisory boards for the American Association of College and Universities’ VALUE (Valid Assessment of Learning in Undergraduate Education) Initiative and National Advisory Committee of the Carnegie Community Engagement Classification. She served on the boards for AAC&U’s publications and the Center for Engaged Democracy, which promotes the development of civically engaged majors, minors, concentrations, and certificates. She is a member of the advisory board for Civic Learning and Democratic Engagement (CLDE) working to promote pathways for all students. Ari is co-editor of Deepening Community Engagement in Higher Education: Forging New Pathways (Palgrave 2013) and co-author of Civic Engagement at the Center: Building Democracy through Integrated Co-curricular and Curricular Experiences (AACU 2008), as well as  resource material (such as training for faculty and student leaders) on the Bonner Wiki. Fueled by experiences as a student and volunteer, Ariane found a passion for civic engagement. While attending Stanford University, she engaged in East Palo Alto with elementary students, teachers, nonprofits, and the school district, developing coalitions to mobilize students and faculty into working with the community. She researched economic and policy issues, creating a credit-bearing CBR course taught by community leaders with student in local internships. She was awarded the John Gardner Fellowship to work full-time with the Ravenswood City School District, mentored by its Superintendent. Ari spent five years at City Year (which engages 17 to 25 year-olds in full-time service), building systems and training to replicate the national organization. As Jumpstart’s Vice President for Program, Ari oversaw the development of a proven evidence-based national program that engages college students as teachers in Head Start programs. At Echoing Green (New York), Ari helped create resources  for social entrepreneurs. As Executive Director of Campus Outreach Opportunity League (COOL), she developed large-scale conferences and programs for student leadership of civic engagement. Ari earned a bachelor's in Political Science. She earned a master’s in higher education from Drexel University and a doctorate in higher education leadership at the University of Pennsylvania, while working full-time. Her research focuses on institutionalization of community engagement and its potential to support student success, post-graduate careers, and the effectiveness of higher education. Rachayita Shah, Director of Community Engaged Learning rshah@bonner.org Dr. Rachayita Shah brings a rich background and teaching experience in curriculum and instructional design. Her work at Bonner includes consultations with and curricular guidance to administrators, faculty, and student leaders involved in institutionalizing community and civic engagement. She earned a doctorate from Florida Atlantic University’s (FAU) Ph.D. program in Curriculum and Instruction and Bachelor's and Master’s degrees in English Literature from India. Before joining the Bonner Foundation, she worked at FAU as Visiting Instructor and taught courses focused on diversity, multicultural education, human rights, and social justice. She also worked as Program Manager at FAU’s Center for Holocaust and Human Rights Education, where she facilitated teacher professional development, provided curriculum consultations to K-12 educators, and managed Holocaust education and human rights-oriented events. As a member of the Florida Department of Education Commissioner’s Task Force on Holocaust Education, she served on curriculum writing team for integrating the content of the Holocaust in middle school civics lessons. Rachayita’s areas of expertise and research include teacher professional development, community-engaged learning, and multicultural education. At Bonner, she has developed new resources for faculty, staff, and student leaders, including curriculum for faculty development in community-engaged learning  and in course design. She also helped lead the Racial Justice Initiative and Writer’s Webinar, guiding more than 20 faculty and staff in their development of public scholarship. She has also developed self-paced resources on course design, community-engaged learning, and other topics within the Bonner Learning Community , an online platform for the network. Liz Brandt , Community Engagement Director liz@bonner.org Liz Brandt joined the Bonner Foundation staff in August 2018 as the Community Engagement Director. In this role she designs and manages Foundation initiatives for supporting Bonner Program member campuses and campus-wide community engagement. She supports planning of national conferences, resource and curriculum development, conducts campus visits, cultivates and manages strategic partnerships with graduate schools, and identifies and shares best practices and models. As a community engagement professional in higher education, Liz strives to build just and equitable communities by transforming higher education institutions to be agents of collaborative social change and educating and preparing students for civically engaged lives. Growing up in rural Kentucky and in a low-income family, Liz understands first-hand the challenges of economic and social inequality. She was the recipient of the Corella & Bertram F. Bonner Scholarship, which created the opportunity for her access and experience the transformative nature of higher education. As a Bonner Scholar, Liz served as the Senior Intern and a Bonner Congress Representative. Also at Centre, Liz had transformative experiences studying abroad in Ghana, Northern Ireland, and Guatemala. After graduating, Liz worked as a campus organizer for the Massachusetts Public Interest Research Group, a non-profit that trains college students in grassroots organizing tactics to tackle issues such as hunger and homelessness, renewable energy, and student debt. After serving in that role, Liz returned to Centre College to serve for two years as the Coordinator of the Bonner Program and Community Service. In this role, Liz managed Centre's sixty student Bonner Program, including designing training and education, restructuring the program to incorporate an Issue-Based model, and cultivating and supporting 30+ community partnerships. She also focused on curriculum change, helping to develop a Social Justice Minor at Centre and serving on the Shepherd Higher Education Consortium on Poverty Internship (SHECP) committee, to develop social justice academic coursework and internships. Liz also holds a Bachelors of Arts in Anthropology and Sociology from Centre College in Danville, KY. She earned her master’s degree in Higher Education with concentrations in Administration & Leadership and Educational Policy from Drexel University. Her thesis is published in the Journal of Higher Education Outreach and Engagement (2022) where she studied the barriers and pathways for Community Engagement Professionals (CEPs) to thrive in higher education. She was selected as a 2022-2023 Engaged Scholar with Campus Compact and is currently serving as a Student-Centered Engagement Research Fellow for the Community Engagement Professional Competency research project with Campus Compact. Liz’s areas of expertise include community engagement strategy and leadership, program development and management, higher education, student development and leadership, capacity building, and professional development. She enjoys cooking, hiking, reading, and traveling and exploring new cultures and communities. Liz has traveled to five continents, over fifteen countries, and twenty-nine states in the U.S. Clifton Davis, Operations and Special Projects Coordinator cdavis@bonner.org Clifton Davis joined the Bonner Foundation in November 2022 as the Operations and Special Projects Coordinator. Cliff manages Bonner Foundation grant making and reporting, annual meeting logistics, internal and external communications and operations. He will provides support to new Bonner Leader Programs and special projects. Prior to joining the Bonner Foundation Staff, Cliff served as an Educator with the Stewart County School District in Lumpkin,GA. Worked as an Implementation Specialist for E&T Associates servicing K-12 schools in Atlanta, GA. He worked as Program Coordinator for the First-Year Experience and Summer Academy at Morehouse College. Cliff is a 2019 Bonner Scholar and Oprah Winfrey Scholar alum from Morehouse College where he organized many community initiatives on the issues of education access and homelessness. Cliff received his Bachelor of Arts in Political Science.  He also received his Master's in Public Service from the Clinton School at the University of Arkansas in Little Rock. Jeniffer Gonzalez Reyes, Director of Communications & Campus Engagement jengr@bonner.org Jeniffer Gonzalez Reyes joined the Bonner Foundation in February 2023 as the Program Manager and now serves as the Director of Communications & Campus Engagement. In her role, Jeniffer helps ensure that community-engaged professionals are effective in building and sustaining high-quality campus programs. She develops new or refines existing training and curriculum to provide technical assistance to colleges and universities within the Bonner Network. She supports planning for national conferences, conducts campus visits, and manages international and national organizations that enrich and support the Bonner Program and Network. In her communications role, she carries out communication strategies and operational development to further our efforts in sharing our resources and the Bonner model. Jeniffer is a Bonner Scholar 2019 alum from Guilford College. She earned a Bachelor of Science in Physics. As a Bonner Scholar, Jeniffer served as a Bonner Congress Representative and Site Coordinator. Jeniffer organized many community initiatives on issues of access to high education and immigrant rights. One of these initiative was Soy un Leader, an annual conference that provided crucial information for access to higher education for 500+ disenfranchised and undocumented/DACAmented high school students in surrounding counties of Greensboro, NC. After graduating Jeniffer worked as the Bonner Program Coordinator for Allegheny College in Meadville, PA. Jeniffer managed Allegheny’s Hybrid Leader/Scholar Bonner Program of 60 students, including new student onboarding, curriculum/training design, and implementation. She established a more efficient student-led Bonner Leadership Team structure and cultivated and maintained community partnerships. Prior to joining the Bonner Foundation Staff, Jeniffer was a program manager for UNC Chapel Hill School of Government in Chapel Hill, NC. She worked as an administrative liaison to faculty, NC judicial officials, and attorneys. Meena Peruvemba, Director of Finance and Administration meena@bonner.org Meena Peruvemba is a dedicated finance professional with many years of non-profit accounting experience in Canada. Prior to joining the Bonner Foundation, Meena worked with The Council of Canadians (social justice organization) for the past six years. She has also worked with many non-profit organizations in Canada. She comes with a wide range of experience in business advising, small business lending, strategic planning, financial accounting, and audit preparations.  She also has served on many non-profit boards as a treasurer. Meena completed a master’s in business administration (MBA Finance) from The University of Saskatchewan in Canada. Following the Masters, she pursued CPA and received her CPA certification in Ontario Canada. Recently she migrated from Canada to the United States to be closer to her family. NATIONAL SUMMER INTERNS Naya Adla Class of 2026                          Stetson University Naya Adla is a junior Bonner Scholar at Stetson University, majoring in Digital Arts, and Applied Mathematics with a concentration in Data Science. Originally from Syria and raised in Egypt, Naya holds dear her Arab heritage and strives to serve the Arab community in Florida. In addition to heading the Middle Eastern & North African Association at Stetson she holds several other leadership roles pivotal in community building. Within the Bonner Program at Stetson, Naya has served a Student Coordinator and a Freshman Class-Based Leader. She represented Stetson at the Bonner Congress in 2023 and attended the Bonner SLI during the summer of 2024. She has also worked closely with the International Student Office, where she is deeply involved in supporting international and exchange students. Naya is passionate about bridging the world of data analytics with social justice to produce innovative solutions, particularly in the fields of higher education and environmental sustainability. Outside of academics and community work, Naya enjoys cooking dishes from different cuisines around the world. Her favorite cuisines are Syrian and Mexican. She also loves traveling and explore different landscapes around the US. She has been to North Carolina, Massachusetts, and Ohio, among others. Naya’s favorite tradition is collecting magnets from her travels. Naya is excited to work with the Bonner Foundation and she believes this internship will provide her with the skills necessary to prepare for a career in higher education and civic leadership. Michael Deem Jr. Class of 2026          Rider University Michael Deem Jr. is a third-year student studying Film and Television and Entrepreneurship at Rider University. In his Bonner Program at Rider, he serves as the Site-Based Team Leader for Arm in Arm and is also a member of both the Bonner Leadership Team and the Social Media Team. Through these roles, he aims to engage Bonner Leaders and the greater campus community by providing meaningful and fulfilling experiences. Michael is ecstatic to collaborate on innovative projects and contribute to the ongoing growth of the Bonner Program. Prior to joining The Bonner Foundation, Michael served in Rider University's Student Government Association as both Vice President for Communications and Executive Vice President. In these roles, he led initiatives such as coordinating the semesterly Town Hall and planning and facilitating weekly Senate meetings. He also extends his service beyond Bonner through Circle K International , serving on the executive board at both the club and district levels. Michael is also an intern at the James R. Halsey Foundation of the Arts in Hamilton, NJ — a nonprofit organization that supports youth in the Greater Trenton-Hamilton area by providing filmmaking classes. This program empowers students to express themselves through the film medium, offering a safe space for their voices to be heard, while also helping them develop transferable skills for college and future careers. After this summer, Michael will pursue internships in the film industry. In the spring semester of his senior year, he will participate in Rider University's Semester in LA program, gaining hands-on experience on the same sets and studio lots where many beloved films and television shows are created. He looks forward to soaking in every bit of knowledge and building valuable connections during his time in Los Angeles. After graduation, Michael aims to build a career in film as a producer or production coordinator. He also aspires to create his own independent films that reflect his core values, especially around mental health advocacy, environmental sustainability, and disability representation in media. Olivia Gray Class of 2027      Spelman College Olivia Gray is a sophomore at Spelman College, majoring in Elementary Education with a minor in Political Science. A proud Bonner Scholar, Olivia has dedicated herself to community service, focusing on improving the wellness of students in Atlanta Public Schools and nonprofit organizations. She has taken on leadership roles within the Bonner Scholar Program, serving as the 2023-2024 First Year Class Coordinator and the 2024-2025 Second Year Class Coordinator, helping her peers engage in meaningful service projects. Beyond her community involvement, Olivia is passionate about education and policy. She aims to combine her love for teaching with her interest in political advocacy, specifically in the areas of early childhood education and nonprofit work. Olivia has a deep commitment to creating opportunities for students, particularly those from underrepresented backgrounds, to succeed in the classroom and beyond. Olivia brings a creative flair to her campus life by serving as the local nail technician for her fellow students and being a previous pageant contestant of NAM! She is driven by a belief in the power of self-love, self-care, and community empowerment. Joseph (JP) Liddy Class of 2026      Oberlin College A proud Chicagoan, J.P. Liddy (he/him) is a rising senior at Oberlin College. After years of experience working with nonprofits, his passion for community service flourished through the Bonner Scholar Program at Oberlin, where he was given the resources and agency to explore work with a myriad of Cleveland-area service sites. Through hosting dialogues, crafting workshops, and structuring community-building methods with members of the surrounding Oberlin community as a member of Oberlin's Bonner Leadership Team, he has gained hands-on experience as a leader and changemaker. He has organized events and coordinated programming for large conventions and conferences such as Oberlin's IMPACT Summit and the 2024 Bonner Summer Leadership Institute and built lasting relationships throughout the Bonner Network that have strengthened his experience in higher education by introducing him to a world of active social educators and civically engaged changemakers. Through this opportunity to intern for the Bonner Foundation, Liddy hopes to expand his understanding of the Bonner Foundation's long-term agenda to instill the core commitments within the current classes of Bonners while strengthening ties with the nationwide Bonner Network as he prepares to lead the onboarding process for Oberlin's incoming class of Bonner Scholars. A diligent opportunist with the giddy spirit of Buddy the Elf, he is currently finishing a semester abroad in Bath, England, where he is working to complete his second novel. Kayla Rogers Class of 2025       Centre College Kayla Rogers is a current senior at Centre College, graduating in May with a BA in Politics and a BA in History with a minor in Social Justice. Originally from Frankfort, Kentucky, Kayla is deeply committed to grassroots organizing and political activism in her home state, with a particular focus on education access, civic engagement, and community empowerment. In alignment with these goals, she led a campus-wide letter-writing campaign during her junior year to mobilize student voices against anti-DEI legislation in Kentucky. As a Bonner, Kayla has served in multiple leadership roles, including as the PR & Activities Specialist on the Bonner Leadership Team. In this role, she worked to amplify the program’s visibility and foster stronger connections within Bonner. She continued her commitment to the Centre College Bonner program as the Bonner Ambassador where she has initiated professional development and alumni relations. In this new position, she has curated an internship and fellowship database to meet the needs of her diversely disciplined program as well as an annual newsletter to include alumni in the program’s operations. Beyond Bonner, Kayla is an elected representative of the Student Government Association, a department representative for the Politics major, and created a political section of the campus newspaper, The Cento. She has also studied abroad in Strasbourg, France, where she deepened her understanding of international politics and human rights. Kayla is passionate about advancing social justice through policy advocacy and plans to continue building her skills in community organizing within the nonprofit sector. Former Staff Wayne Meisel , Founding President of the Bonner Foundation and currently Executive Director of The Center for Faith & Service Wayne Meisel was hired in 1989 by Mr. Bonner as the founding president of the Bonner Foundation, which he led for the first next 21 years.  In his first two years he launched the two programs that continue to define the Bonner Foundation.  The Crisis Ministry Program which funds anti-hunger efforts and the Bonner Program which is the largest privately-funded, service-based scholarship program in the country with 3,000 students serving annually at 65+ colleges and universities. Meisel has been a longtime advocate of service, service learning, and community engagement. Click here for a profile that traces his career from college up to the present. Back to Top THE CORELLA & BERTRAM F. BONNER FOUNDATION 10 Mercer Street, Princeton, NJ 08540 t 609.924.6663   • i nfo@bonner.org"
    }
  ]
}