{
  "fuentes": [
    {
      "url": "https://craftbeerlocations.com/beerspot/botanical-brewing-taproom-brewery-in-cape-coral-florida/",
      "email": "help@craftbeerlocations.com"
    },
    {
      "url": "https://nuwavebotanicals.com/product/botanical-brewing-sparkling-elixir/",
      "email": "e7d54b729aaf49ea8b2f80dae22860aa@sentry.zipify.com"
    },
    {
      "url": "https://nuwavebotanicals.com/product/botanical-brewing-sparkling-elixir/",
      "email": "f14faca962674f149161045845b21b35@sentry.zipify.com"
    },
    {
      "url": "https://mkebrewing.com/taproom/",
      "email": "accounting@eagleparkbrewing.com"
    },
    {
      "url": "https://mkebrewing.com/taproom/",
      "email": "info@eagleparkbrewing.com"
    },
    {
      "url": "https://mkebrewing.com/taproom/",
      "email": "memberships@eagleparkbrewing.com"
    },
    {
      "url": "https://mkebrewing.com/taproom/",
      "email": "sales@eagleparkbrewing.com"
    }
  ],
  "mails": [
    "accounting@eagleparkbrewing.com",
    "e7d54b729aaf49ea8b2f80dae22860aa@sentry.zipify.com",
    "f14faca962674f149161045845b21b35@sentry.zipify.com",
    "help@craftbeerlocations.com",
    "info@eagleparkbrewing.com",
    "memberships@eagleparkbrewing.com",
    "sales@eagleparkbrewing.com"
  ],
  "nombre_sitio": "botanicalbrewingco.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://craftbeerlocations.com/beerspot/botanical-brewing-taproom-brewery-in-cape-coral-florida/",
      "text": "Find Craft Beers at Botanical Brewing Taproom Brewery in Cape Coral Florida Near You - Craft Beer Locations Near You Skip to content Craft Beer Locations Near You Home Locations USA Alabama Arizona Arkansas California Colorado Connecticut Delaware District of Columbia Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi New Hampshire New Mexico New Jersey New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Virginia West Virginia Washington Wisconsin Wyoming UK Submit Your Spot! Blog My Account Contact 0 MAP SEARCH Botanical Brewing Taproom Brewery in Cape Coral Florida Brewery, Cafe, Lounge ( 138 reviews ) ADDRESS & CONTACT Address 839 Miramar St, Cape Coral, FL 33904 GPS 26.5609943, -81.9559477 Telephone +1 239-341-4380 Web http://www.botanicalbrewingco.com/ Plan My Route OPENING HOURS Monday 7AM-2AM Tuesday 7AM-2AM Wednesday 7AM-2AM Thursday 7AM-2AM Friday 7AM-2AM Saturday 7AM-2AM Sunday 7AM-2AM CLAIM LISTING Is info on this listing outdated? Are you owner of this business? Register and claim it now. This location is pending verification. If you are the owner reach out to help@craftbeerlocations.com Discover Botanical Brewing Taproom: Your Local Brewery in Cape Coral, Florida Looking for a great place to enjoy craft beer near you? Welcome to Botanical Brewing Taproom, your go-to brewery in Cape Coral, Florida. As a premier destination for craft beer lovers, we offer a wide variety of unique and flavorful brews, brewed with passion and precision. Whether you’re a beer connoisseur or new to the world of craft beer, we have something for everyone. Located at 839 Miramar St, Cape Coral, FL 33904, Caloosahatchee, 839 Miramar St, 33904, our brewery is easily accessible for residents of Cape Coral and surrounding areas. Stop by and discover why Botanical Brewing Taproom has become a favorite spot for craft beer enthusiasts in United States of America. With a focus on Brewery and Brewery, we’re dedicated to offering a diverse selection that highlights local flavors and craftsmanship. Our friendly and knowledgeable team is ready to guide you through our extensive range of beers, helping you find the perfect brew to match your tastes. At Botanical Brewing Taproom, we pride ourselves on exceptional customer service, expert recommendations, and a commitment to quality that sets us apart from the rest. Whether you’re enjoying a cold pint with friends or exploring new beer styles, our brewery provides the perfect setting for any occasion. Get in touch with us today at +1 239-341-4380 to learn more about our offerings or plan your visit. From Brewery, Cafe, Lounge to , Botanical Brewing Taproom has it all! Make us your go-to brewery for craft beer near you, and experience the best of what we have to offer. Don’t wait—explore our selection of craft beer near you and start your next beer adventure with Botanical Brewing Taproom! Check out Botanical Brewing Taproom’s reviews online to see why locals love us. Plan your visit to Botanical Brewing Taproom and taste the best brews in Cape Coral today! Related FEATURES & SERVICES Price Range $$ Credit Cards Reservation LOCATION ON MAP Plan My Route CONTACT OWNER NEW SEARCH Share this: Click to share on Facebook (Opens in new window) Facebook Click to share on X (Opens in new window) X Click to email a link to a friend (Opens in new window) Email Click to share on Reddit (Opens in new window) Reddit Click to share on Threads (Opens in new window) Threads Click to share on Nextdoor (Opens in new window) Nextdoor Related Leave a review Cancel reply Your email address will not be published. Required fields are marked * Your rating * Select your rating, please. Your review Your reply to review * Name * Email * Save my name, email, and website in this browser for the next time I comment. Δ Fill all required fields, please. Use valid email address, please. Craft Beer News Craft Beer News Beer Under Glass 2025: An Evening Beneath the Skyline Our Best Beers of 2024 Our Best Beer Experiences of 2024 FoBAB 2024 Reflections FoBAB 2024 Reflections Recoil Brewing Company Brewery in Skipton Address Unit 4, Snaygill Industrial Estate, Skipton BD23 2QR Lamb Brewing Company Brewery in Skipton Address Queen's Arms, Litton, Skipton BD23 5QJ Haworth Steam Brewing Co restaurants in Keighley Address 98 Main St, Haworth, Keighley BD22 8DP Copper Dragon Brewery in Keighley Address Lee Mills, St Paul's Rd, Keighley BD21 4QW Timothy Taylor's Brewery Brewery in Keighley Address Knowle Spring Brewery, Queen's Rd, Keighley BD21 1AW Copperdragon Brewery Brewery in Skipton Address Unit 4, Snaygill Industrial Estate, Skipton BD23 2QR 1 2 3 … 1,790 Next » Get Social with Us Facebook X Instagram Home Submit Listing Blog Contact CRAFT BEER LOCATIONS | ALL RIGHT RESERVED Terms and Conditions - Privacy Policy"
    },
    {
      "url": "https://nuwavebotanicals.com/product/botanical-brewing-sparkling-elixir/",
      "text": "Botanical Brewing Sparkling Drinks - Nuwave Botanicals JavaScript is required to view this page. Skip to content 🚚 USPS Priority & Ground Delivery times are estimates and not guaranteed.     \n      🚚 USPS Priority & Ground Delivery times are estimates and not guaranteed.    \n      🚚 USPS Priority & Ground Delivery times are estimates and not guaranteed. Home Shop All Kratom Brands Kratom Brands Nu Experience Botanicals EXP Botanicals Capsule Connection Botanical Brewing Chief Kratom Flow Hello Kanna Hush Kratom K Chill K Shot K Tropix Kratomade Kratom Kaps Kryptic Kratom Lit Culture MIT 45 Mit Freeze Mit Therapy Mini Freeze Mit Wellness Odyssey OPMS Professor Whyte's Remarkable Herbs Relax Aid Kratom Ultra Enhanced Viva Zen White Rabbit Whole Herbs Zen K Zen Zion Herbals Kratom Products Kratom Products Kratom Capsules Kratom Powder Kratom Shots Kratom Extracts Kratom Bundles Kratom Strains Kratom Strains Red Vein Green Vein White Vein Yellow Vein Gold Vein Kratom Effects Kratom Effects Calming Energizing Focus Uplifting Refreshing Effects Creativity Better Socializing Productivity Relaxation Balanced Effects Loyalty Points Store Locator About About Kratom Blog About Us Contact Us Log in Twitter Facebook Pinterest Instagram Home Shop All Kratom Brands Nu Experience Botanicals EXP Botanicals Capsule Connection Botanical Brewing Chief Kratom Flow Hello Kanna Hush Kratom K Chill K Shot K Tropix Kratomade Kratom Kaps Kryptic Kratom Lit Culture MIT 45 Mit Freeze Mit Therapy Mini Freeze Mit Wellness Odyssey OPMS Professor Whyte's Remarkable Herbs Relax Aid Kratom Ultra Enhanced Viva Zen White Rabbit Whole Herbs Zen K Zen Zion Herbals Kratom Products Kratom Capsules Kratom Powder Kratom Shots Kratom Extracts Kratom Bundles Kratom Strains Red Vein Green Vein White Vein Yellow Vein Gold Vein Kratom Effects Calming Energizing Focus Uplifting Refreshing Effects Creativity Better Socializing Productivity Relaxation Balanced Effects Loyalty Points Store Locator About Kratom Blog About Us Contact Us Twitter Facebook Pinterest Instagram Search Log in Cart Skip to product information Open media 1 in modal Open media 2 in modal Open media 3 in modal Open media 4 in modal Open media 5 in modal Open media 6 in modal Open media 7 in modal Open media 8 in modal 1 / of 8 Botanical Brewing Sparkling Elixir Botanical Brewing Sparkling Elixir Drinks Regular price $8.99 Regular price Sale price $8.99 Unit price / per Sale Sold out Shipping calculated at checkout. Satisfaction Guaranteed Lab tested & 100% pure Green Kratom Tiki Apple White Kratom Island Breeze Red Kratom Blueberry Lemonade CAT 5 Elixir Blend Peach on a Beach Offer Green Kratom Tiki Apple White Kratom Island Breeze Red Kratom Blueberry Lemonade CAT 5 Elixir Blend - Unavailable Peach on a Beach Product variants Green Kratom Tiki Apple - $8.99 White Kratom Island Breeze - $8.99 Red Kratom Blueberry Lemonade - $8.99 CAT 5 Elixir Blend - $15.99 - Sold out Peach on a Beach - $8.99 Earn [points_amount] on this purchase. Learn More Quantity ( 0 in cart) Decrease quantity for Botanical Brewing Sparkling Elixir Increase quantity for Botanical Brewing Sparkling Elixir Decrease quantity for Botanical Brewing Sparkling Elixir Increase quantity for Botanical Brewing Sparkling Elixir Add to cart $8.99 View full details 0 Satisfied Customers 0 Unique Kratom Strains 0 Orders Shipped Botanical Brewing Sparkling Elixir Botanical Brewing Sparkling Drinks Better than booze, plant-based kratom mood-enhancing beverages available in delectable Tiki Apple, Hibiscus Berry, Bimini Blue, and Orange Dream flavors! A perfect option for first time kratom users that is bubbly, refreshing, and effective! Each 12oz can contains about 5g of kratom – this lower dose Kratom drink is flavored with real juices and other all-natural ingredients — each flavor provides a slightly different experience, just remember to chill it before you enjoy it. Tiki Apple Flavor – Energy Made with mainly Green Vein Kratom, perfect for a tasty midday pick-me-up. Apple and Organic lemon combine to deliver a zesty kick that realigns your focus and enhances your mood. Ingredients: filtered water, apple juice, agave, monk fruit, Mitragyna Speciosa, natural flavors, citric acid, vitamin c, malic acid, tartaric acid. Hibiscus Berry – Relax Made with mainly Red Vein Kratom, perfect for winding down and relaxing your body. Sweet berry and fragrant hibiscus mix to create a pleasant experience on your palate. Experience enhanced freedom of movement and deep relaxation. Ingredients: filtered water, berry juice, agave, monk fruit, Mitragyna Speciosa, natural flavors, citric acid, vitamin c, malic acid, tartaric acid. Bimini Blue – Focus Made with mainly White Vein Kratom, perfect for energizing your body and focusing your mind. Sweet berry and fragrant hibiscus mix to create a pleasant experience on your palate. Experience enhanced freedom of movement and deep relaxation. Ingredients: filtered water, fruit juice, agave, monk fruit, Mitragyna Speciosa, natural flavors, citric acid, vitamin c, malic acid, tartaric acid. Orange Dream – Calm A mix of kratom strains, this yummy natural orange flavored elixir calms your senses and prepares you for a night of socializing. Ingredients: filtered water, orange juice, monk fruit, agave, Mitragyna Speciosa, natural flavors, citric acid, vitamin c, malic acid, tartaric acid, methysticum. Have you tried kratom drinks? Perfect for those who love the grab and go approach and the many different flavors of kratom drinks available. If you want a stronger potency in the same easy to take anywhere liquid or capsule, checkout our best selection of kratom extracts. Available in single 12 oz cans. Botanical Brewing Sparkling Drinks are made with 100% pure , lab tested Mitragyna Speciosa. The NuWave Difference We believe in making kratom education and products more accessible to those who could benefit from its wellness properties. We ethically source our kratom from Indonesia, where we empower local farmers, their families, and communities to thrive. That’s the NuWave difference. POP, SIP & ENJOY THE NATURAL BLISS OF A PLANT BUZZ Kratom Elixirs Experience the ultimate fusion of flavor, relaxation, and wellness with Botanical Brewing Kratom Elixirs! These handcrafted, plant-based beverages are designed to elevate your kratom journey, delivering unparalleled satisfaction with every sip. Whether you're looking to unwind after a long day or stay energized on the go, our elixirs are the perfect companion for your lifestyle. BEST EFFECTS OF Kava DRINKS Kava is a root from the South Pacific known for its mood enhancing effects that leave you with a calm and focused mind. Kava has many relaxing properties that tend to produce a slight numbing sensation on the tongue. Additional Information Weight 0.81 lb Dimensions 6 in x 2 in x 2 in Count Green Kratom Tiki Apple Type Drinks Weight 0.81 lb Dimensions 6 in x 2 in x 2 in Count Green Kratom Tiki Apple Type Drinks Weight 0.81 lb Dimensions 6 in x 2 in x 2 in Count Green Kratom Tiki Apple Type Drinks Weight 0.81 lb Dimensions 6 in x 2 in x 2 in Count Green Kratom Tiki Apple Type Drinks Weight 0.81 lb Dimensions x  x Count Green Kratom Tiki Apple Type Drinks You may also like EXP Premium Red Vein Blend Capsules Sale Capsules EXP Premium Red Vein Blend Capsules Regular price From $5.98 Regular price $59.80 Sale price From $5.98 Unit price / per Sale EXP Premium Green Maeng Da Blend Capsules Sale Capsules EXP Premium Green Maeng Da Blend Capsules Regular price From $5.98 Regular price $59.80 Sale price From $5.98 Unit price / per Sale EXP Premium White Vein Capsules Sale Capsules EXP Premium White Vein Capsules Regular price From $5.98 Regular price $59.80 Sale price From $5.98 Unit price / per Sale EXP Premium Ménage à Trois Capsules Sale Capsules EXP Premium Ménage à Trois Capsules Regular price From $5.98 Regular price $59.80 Sale price From $5.98 Unit price / per Sale EXP Premium Green Maeng Da Blend Powder Sale Powder EXP Premium Green Maeng Da Blend Powder Regular price From $5.98 Regular price $25.50 Sale price From $5.98 Unit price / per Sale 1 Kilo Experience Kratom Powder Bundle Bundles 1 Kilo Experience Kratom Powder Bundle Regular price $99.00 Regular price Sale price $99.00 Unit price / per EXP Bliss Shot Sale Drinks EXP Bliss Shot Regular price From $9.99 Regular price $119.88 Sale price From $9.99 Unit price / per Sale Experience Green Maeng Da Powder Sale Powder Experience Green Maeng Da Powder Regular price From $5.98 Regular price $106.74 Sale price From $5.98 Unit price / per Sale Experience White Maeng Da Powder Sale Powder Experience White Maeng Da Powder Regular price From $5.98 Regular price $106.74 Sale price From $5.98 Unit price / per Sale EXP Premium Red Vein Powder Jar Sale Powder EXP Premium Red Vein Powder Jar Regular price From $5.98 Regular price $25.50 Sale price From $5.98 Unit price / per Sale EXP Premium White Vein Powder Jar Sale Powder EXP Premium White Vein Powder Jar Regular price From $5.98 Regular price $25.50 Sale price From $5.98 Unit price / per Sale Experience Power Blend Powder Sale Powder Experience Power Blend Powder Regular price From $5.98 Regular price $106.74 Sale price From $5.98 Unit price / per Sale Experience Red Bali Powder Sale Powder Experience Red Bali Powder Regular price From $5.98 Regular price $106.74 Sale price From $5.98 Unit price / per Sale EXP Premium 500ct Capsule 4x Bundle Sale Bundles EXP Premium 500ct Capsule 4x Bundle Regular price $220.00 Regular price $280.00 Sale price $220.00 Unit price / per Sale Experience Red Maeng Da Powder Sale Powder Experience Red Maeng Da Powder Regular price From $5.98 Regular price $106.74 Sale price From $5.98 Unit price / per Sale 1 / of 15 View all Our Kratom Experts Are Here To Help Call Us Toll Free, M-F 8am to 8pm CST, 5 days a week 866-420-5728 Email orders@nuwavebotanicals.com A happy customer is our first priority and all NuWave Botanicals staff will go the extra mile to make it happen. We will greet you with a warm welcome and a courteous attitude to give you a pleasant shopping experience. If you’re looking for one of the best places to buy Kratom online, then NuWave Botanicals has you covered! Follow Us: Facebook Instagram Twitter Pinterest Shop Kratom Kratom Capsules Kratom Powder Kratom Shots Kratom Extracts Bundle & Save Ultimate Sampler Pack Shop By Brand EXP Botanicals Experience Botanicals OPMS Remarkable Herbs Whole Herbs Legal Home Shop All About Contact Privacy Policy Return Policy Terms and Conditions Shipping Policy Lab Test Results Wholesale Signup Form Contact Us Call Us At: 866-420-5728 Visit Our Store : 206 Main St, Suite B Spring, TX 77373 View on Google Maps Hours Of Operation: Mon-Fri: 10:00 AM – 4:00 PM Saturday and Sunday: Closed Facebook Instagram Twitter Pinterest © 2025, NuWave Botanicals Powered by Shopify Refund policy Privacy policy Terms of service Shipping policy Disclaimer :- This product is not available for shipment to the following states: Alabama, Arkansas, Indiana, Rhode Island, Wisconsin; or the following counties: Sarasota County (Florida), San Diego (California), Oceanside (California), Alton (Illinois), Jerseyville (Illinois), Edwardsville County (Illinois), Columbus (Mississippi), Union County (Mississippi), Ascension (Louisiana), Franklin (Louisiana), Rapides (Louisiana) This product is not for use by or sale to persons under the age of 18. This product should be used only as directed on the label. It should not be used if you are pregnant or nursing. Consult with a physician before use if you have a serious medical condition or use prescription medications. A Doctor’s advice should be sought before using this and any supplemental dietary product. All trademarks and copyrights are property of their respective owners and are not affiliated with nor do they endorse this product. These statements have not been evaluated by the FDA. This product is not intended to diagnose, treat, cure or prevent any disease. By using this site, you agree to follow the Privacy Policy and all Terms & Conditions printed on this site. Void Where Prohibited by Law. Choosing a selection results in a full page refresh. Opens in a new window. Age Verification You must be 21 years old to enter. Yes No By entering this site you are agreeing to the Terms of Use and Privacy Policy ."
    },
    {
      "url": "https://mkebrewing.com/taproom/",
      "text": "Taproom - Milwaukee Brewing Co Visit our new taproom in Bay View! Learn More Skip to main content Close Search Menu 0 Menu 0 was successfully added to your cart. Taproom Our Location Tap Beer To Go Beer Looking to get in touch? Please reach out via the appropriate email address below! Putting on an event? We’ve got you covered . TAPROOM ADDRESS: 2335 S Kinnickinnic Ave Milwaukee, WI 53202 HOURS Sunday 12pm – 8pm Monday Closed Tuesday – Thursday 3pm – 9pm Friday – Saturday 12p m – 12am TOUR ADDRESS: S64 W15640 Commerce Center PKWY Muskego, WI 53150 General Inquiries: info@eagleparkbrewing.com Memberships: memberships@eagleparkbrewing.com Sales (Commercial Accounts Only): sales@eagleparkbrewing.com Billing & Accounts Payable: accounting@eagleparkbrewing.com Craft beer. Made here. Craft beer. Made here. Craft beer. Made here. Craft beer. Made here. Craft beer. Made here. Taproom 2335 S Kinnickinnic Ave Milwaukee, WI 53207 Get Directions Facebook Instagram © 2025 Milwaukee Brewing Co. Close Menu Taproom Location Info Beer To Go Beer Beer & Spirits Finder EVENTS EVENT CALENDAR Private Events Membership Tours About Contact Us My Account Gift Cards Taproom 2335 S Kinnickinnic Ave Milwaukee, WI 53207 Get Directions facebook instagram"
    }
  ]
}