{
  "fuentes": [
    {
      "url": "https://skanemafrica.com/contact",
      "email": "anirudh.shetye@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "beatrice.malle@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "info.nairobi@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "jane@skanem.ke"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "njogu@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "olive.kunihira@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "sachen.gudka@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "sameer.gaikwad@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "shamila.mirza@skanem.com"
    },
    {
      "url": "https://finewineliquors.com/contact-us/",
      "email": "sales@finewineliquors.com"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "email": "info@scibpaints.com"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    }
  ],
  "mails": [
    "anirudh.shetye@skanem.com",
    "beatrice.malle@skanem.com",
    "info.nairobi@skanem.com",
    "info@reception-plus.de",
    "info@scibpaints.com",
    "jane@skanem.ke",
    "njogu@skanem.com",
    "olive.kunihira@skanem.com",
    "sachen.gudka@skanem.com",
    "sales@finewineliquors.com",
    "sameer.gaikwad@skanem.com",
    "shamila.mirza@skanem.com"
  ],
  "nombre_sitio": "bottlenosebrewing.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://skanemafrica.com/contact",
      "text": "Contact Skanem | Reach Out to Our Labelling Experts Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message We proudly present Skanem Nairobi Skanem Nairobi Sachen Gudka Managing Director +254 733 410 309 Send email Skanem Nairobi Sachen Gudka Managing Director +254 733 410 309 Send email Skanem Nairobi Anirudh Shetye Head of Sales & Marketing +254 735 052 700 Send email Skanem Nairobi Anirudh Shetye Head of Sales & Marketing +254 735 052 700 Send email Skanem Nairobi Joyce Njogu Key Account Manager +254 722 804 269 Send email Skanem Nairobi Joyce Njogu Key Account Manager +254 722 804 269 Send email We proudly present Skanem Uganda Skanem Uganda Olive Kunihira Head of Sales +256 759 589 711 Send email Skanem Uganda Olive Kunihira Head of Sales +256 759 589 711 Send email We proudly present Skanem Tanzania Skanem Tanzania Sameer Gaikwad Site Manager +255 757 803 737 Send email Skanem Tanzania Sameer Gaikwad Site Manager +255 757 803 737 Send email Skanem Tanzania Beatrice Malle Key Account Manager +255 712 110 922 Send email Skanem Tanzania Beatrice Malle Key Account Manager +255 712 110 922 Send email Skanem Tanzania Shamila Mirza Key Account Manager +255 717 477 047 Send email Skanem Tanzania Shamila Mirza Key Account Manager +255 717 477 047 Send email Locations Locations Locations How to reach us How to reach us How to reach us How to reach us Skanem Interlabels Nairobi Limited East Africa Headquarters East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa +254 202 471001 info.nairobi@skanem.com Skanem Interlabels Uganda Limited Namanve Industrial Park Mukono Uganda Africa +256 759 589711 olive.kunihira@skanem.com Skanem Tanzania Limited Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa +255 757 803737 sameer.gaikwad@skanem.com Contact us Send us a message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Products Sustainability menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy Products menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy"
    },
    {
      "url": "https://finewineliquors.com/contact-us/",
      "text": "Contact us Fine Wine Liquors Shop By Department Wine Red wine Menu Shiraz Cabernet Sauvignon Pinot Noir Red Blends Other Red Varietals Rosé Cabernet Merlot Shiraz Cabernet Merlot Grenache Tempranillo Sangiovese Nebbiolo Bordeaux Barossa Valley white Wine Menu Chardonnay Riesling Sauvignon blanc Pinot gris grigio Other white varietals White blends Dessert white Popular Regions Menu Bordeaux Barossa Valley Mclaren Vale Coonawarra Margaret River Burgundy Clare Valley Fortified Wine Menu Port Tawny Sherry Apera Vermouth Muscat Mead Tokay Topaque Popular Brands Menu Penfolds Under Wraps Wynns Wendouree Wolf Blass Tyrrell’s Top Selling Macallan 15 Year Old Double Cask $ 165.00 Availability: In Stock Glenfiddich Project XX $ 61.00 Availability: In Stock Glendronach 15 Year Old Revival $ 86.25 Availability: In Stock Beer Discover Beer Menu Craft Beer International Beer Australian Beer Mid Strength Light Beer Low Carb Beer Alcoholic Ginger Beer Home Brew Stout Pilsner Wheat Beer Dark Beer Golden Ale Porter Categories Menu Kegs Cider Craft Beer Domestic Beer Hard Seltzers Import Beer Non-Alcoholic Beer Popular Brands Menu 4 Pines Balter Coopers Little Creatures Stone & Wood Zytho New & Trending Menu New Arrivals Top Rated Craft Beer Light Low Pool Packs Cool Off Craft Beer The Lemonade Stand Country Menu Australia Sweden New Zealand France Spain From to Ready to Drink Organic Wine $69.99 Whiskey Discover whiskey Menu Scotch Whisky American Whiskey Japanese Whisky Australian Whisky Irish Whiskey Canadian Whisky Indian Whisky Discover Vodka Menu Absolut Smirnoff Hunter Distillery Stolichnaya Royal Dragon Crystal Head Poliakov Popular Brands Menu Johnnie Walker Jack Daniel’s Glenfiddich Highland Park Glen Moray Stone & Wood Fortified Wine Menu Whiskey Of The Month Flavored Whiskey Blended Scotch Rye Whiskey Single Malt Scotch Small Batch Bourbon Hot deals of summer Fresh Beer Save up $49.99 Jameson Whiskey Father’s Day Sale 40% off Sitewide! Cogac Cocktail Tequila What’s New New Gift & Accessories Best Sellers Sales & Offers -20% Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Menu Sign In or Register 0 0 $ 0.00 Contact us Home Page Contact us Don’t  hesitate to contact us \nif you need help. Whether you have a question about your order, need assistance with a product, or just want to reach out, you’re in the right place. Feel free to contact us using the details below, and we’ll get back to you as quickly as possible! Address 8560 S Cottage Grove Ave, Chicago, IL 60619, United States Call Us (630) 354-9222 Openning Monday – Friday: 8am – 10pm Saturday – Sunday: 9am – 5pm Contact sales@finewineliquors.com finewineliquorsinfo@gmail.com Got Any Questions? Use the form below to get in touch with the sales team Message Send your message Δ Search Account Cart Same-day local delivery Ground shipping directly to you Free in-store pickup 24/7 customer support Customer Service Menu Help Center My account Track my order Return policy About Us Menu Company info Press Releases Careers Reviews Investor relations Quick Links Menu Search Become a reseller Contact us Terms of service Categories Menu Brandy White Wine Champagne Vodka Tequila Get exclusive offers & rewards Sign up for our members portal to receive some exclusive offer & rewards. It’s easy and free! sign up Leave this field empty if you're human: stay connect Facebook-f Twitter Instagram Pinterest we accept Careers About Us Affiliates Privacy Settings Help Site map Copyright ©  2022 Liquory . All rights reserved. Sign in Create an Account Username or email * Password * Login Lost your password? Main menu Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Home About Us Account Blog Careers Cart Checkout Contact us Legal Notice My account Order Tracking Privacy Policy Refund and Returns Policy Reviews Sample Page Shipping Shop Terms & Conditions Track Wishlist Search for: Search All category All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell’s Black Lebel Blanton’s Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester’s Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell's Black Lebel Blanton's Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester's Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine Hide similarities Highlight differences Select the fields to be shown. Others will be hidden. Drag and drop to rearrange the order. Image SKU Rating Price Stock Availability Add to cart Description Content Weight Dimensions Additional information Click outside to hide the comparison bar Compare Top Shopping cart close ×"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "text": "Contact Us: Get In Touch With Asian Paints for your Painting Needs Contact Us: We’d Love To Hear From You 16815 Popular searches Interior Paints Exterior Paints Shade cards SEARCH RESULTS {{searchItem.map.shadeCode}} {{searchItem.map.shadeFamilyName}}: {{searchItem.map.shadeName}} {{searchItem.map.title}} RELATED SEARCH NO MATCHES FOUND! Did you mean? {{spellCheck}} Log-In Hello! Hello! Signout en ar {{minicart.cartcount > 0 ? minicart.cartcount : 0}} ↻ Processing... You have {{minicart.cartcount}} items {{item[\"product\"][\"name\"]}} - + ₹ {{item[\"totalPrice\"][\"value\"]}} Total ₹ {{minicart.totalprice}} Checkout ↻ Menu PAINTS & COLOUR PAINTS & COLOUR Services Services WATERPROOFING WATERPROOFING INSPIRATION INSPIRATION Login/Register PAINTS & COLOUR All PAINTS & COLOUR EXPLORE COLOURS Colour Catalogue Home Colour Guide PAINT PRODUCTS Interior Paints Exterior Paints Waterproofing Wood Paints Metal Paints Undercoats RESOURCES Paint Budget Calculator Ideas Gallery Colour visualizer SERVICES Paint Store Near Me Book Painting Services Services All Services Beautiful Homes Painting Service Scib Stars WATERPROOFING All WATERPROOFING Bathrooms Terrace and Tanks Roof & Basement Interiors Tiling All Products INSPIRATION All INSPIRATION Get Inspired Paint calculator Gallery Colour Next Guides DecorPro Resources Colour Visualizer Ideas Gallery Please enter your mobile number To receive the dealer details on SMS Mobile * SUBMIT Get in Touch We’d love to hear from you Head Office Scib Chemical S.A.E 6th of October Cirt, 4th Industrial (1/3/B)B Tel:            (+202)38281090-99 Fax: (+202)38331271 Scib Paints Helpline* For enquiries, feedback and complaints please call on 16815 or write to us at info@scibpaints.com Mobile number +91 00:59 ↻ ↻ Need help with your painting needs? Fill the form below to book a free site evaluation by a Scib Paints Beautiful Homes Painting Service expert. Name Mobile Number +20 Governorate * Email By proceeding, you are authorizing Scib Paints and its suggested contractors to get in touch with you through calls, sms, or e-mail. Book an appointment ↻ Thank you! We value your interest in Scib Paints Beautiful Homes Service. We will get in touch with you shortly to schedule a visit by an expert. Try again! Oops! Something went wrong. We couldn't process your request. Please try again? Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Our Divisions More about Asian Paints Congratulations You have subscribed. Contact Us 16815 EMAIL ABOUT Research & Technology Careers Contact Us Certificates RESOURCES FAQs POLICIES Quality Policy Customer Policy Cookie Policy Environment Policy EHS Policy TOOLS Colour Catalogue Color with AP APP/Website​ COUNTRY EGYPT Country EGYPT India GLOBAL BANGLADESH MIDDLE EAST FIJI NEPAL SRI LANKA ETHIOPIA CONNECT DOWNLOAD OUR PAINTING APP CONNECT WITH US ©Scib Paints - All rights reserved Congratulations You have subscribed. Welcome User Login OR Continue as guest You have been successfully logged out Login An OTP has been sent to your registered mobile number and email id. 00:00 Resend By clicking submit, I agree to terms and conditions SUBMIT Register Please enter the 5 digit OTP sent via SMS to verify your mobile number! 00:00 Resend I agree to terms and conditions SUBMIT Please enter your mobile number To receive the dealer details on SMS SUBMIT Provide a delivary address Fullname* Email* Mobile* +91 Flat/House No/Floor* Colony/Street/Locality* Landmark City* Pincode* SUBMIT User already exist redirecting you for the login page Paint Budget Calculator Get instant estimates Calculate now Waterproofing Calculator Get an instant estimate Calculate now"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. First name Surname * name E-Mail Nachricht E-Mail * Nachricht * Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    }
  ]
}