{
  "fuentes": [
    {
      "url": "https://bouncesportingclub.com/contact/",
      "email": "info@branditgrp.com"
    },
    {
      "url": "https://www.palmbeachpost.com/story/entertainment/dining/2024/07/23/delray-beach-atlantic-avenue-dining-scene-four-new-restaurants-four-on-way/74438097007/",
      "email": "eritz@pbpost.com"
    },
    {
      "url": "https://www.clowns.com/faq/",
      "email": "inquiries@clowns.com"
    },
    {
      "url": "https://countrymanors.net/contact-us/",
      "email": "cmaoffice@countrymanors.net"
    },
    {
      "url": "https://www.scratchmedia.net/about-us",
      "email": "contact@scratchmedia.net"
    },
    {
      "url": "https://us.bouncepad.com/pages/contact-us",
      "email": "logo_white_f610c5b7-f066-4644-8378-64b727887283_190x@2x.png"
    },
    {
      "url": "https://bouncesportingclub.com/delray/",
      "email": "info@branditgrp.com"
    },
    {
      "url": "https://bouncemkt.com/pages/contact-us",
      "email": "info@stagheaddesigns.com"
    },
    {
      "url": "https://whatnowmia.com/bounce-sporting-club-plans-delray-location/",
      "email": "artboard-1@3x-1024x507-1-1.png"
    },
    {
      "url": "https://whatnowmia.com/bounce-sporting-club-plans-delray-location/",
      "email": "contact@whatnow.com"
    }
  ],
  "mails": [
    "artboard-1@3x-1024x507-1-1.png",
    "cmaoffice@countrymanors.net",
    "contact@scratchmedia.net",
    "contact@whatnow.com",
    "eritz@pbpost.com",
    "info@branditgrp.com",
    "info@stagheaddesigns.com",
    "inquiries@clowns.com",
    "logo_white_f610c5b7-f066-4644-8378-64b727887283_190x@2x.png"
  ],
  "nombre_sitio": "bouncesportingclub.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://bouncesportingclub.com/contact/",
      "text": "Contact – Bounce Venues Skip to content Toggle Navigation MENUS DELRAY BEACH, FL MONTAUK, NY PENSACOLA BEACH, FL RESERVE DELRAY BEACH, FL MONTAUK, NY PENSACOLA BEACH, FL HAPPENINGS DELRAY BEACH, FL MONTAUK, NY PENSACOLA BEACH, FL PRIVATE EVENTS DELRAY BEACH, FL MONTAUK, NY PENSACOLA BEACH, NY LOCATIONS DELRAY BEACH, FL MONTAUK, NY PENSACOLA BEACH, FL Toggle Navigation MENUS DELRAY BEACH, FL MONTAUK, NY PENSACOLA BEACH, FL RESERVE DELRAY BEACH, FL MONTAUK, NY PENSACOLA BEACH, FL HAPPENINGS DELRAY BEACH, FL MONTAUK, NY PENSACOLA BEACH, FL PRIVATE EVENTS DELRAY BEACH, FL MONTAUK, NY PENSACOLA BEACH, NY LOCATIONS DELRAY BEACH, FL MONTAUK, NY PENSACOLA BEACH, FL Contact Admin 2025-06-10T17:55:09+00:00 Contact Us We want to hear from you. See our location contact info below. Bounce Beach Delray bouncedelray@branditgrp.com 561-846-7010 33 SE 3rd Ave Suite 101 Delray Beach Florida United States 33483 Bounce Beach Montauk bouncebeachres@branditgrp.com 631-647-8000 148 S Emerson Avenue Montauk New York United States 11954 Bounce Beach Pensacola bouncepcola@branditgrp.com 850-347-6068 400 Quietwater Beach Rd Pensacola Beach Florida United States 32561 Your Beachside Sports Bar Here to Serve General Inquiries General Inquiries Press Careers Contact Menus Reserve Locations Stay tuned with our newsletter JOIN LIST Thank you for joining our newsletter! × There was an error submitting. Please try again. × Delray Beach Socials Montauk NY Socials Pensacola Beach Socials © 2025 • Brandit Hospitality Group •   All Rights Reserved   •   Site by Spaz Media Page load link Go to Top"
    },
    {
      "url": "https://www.palmbeachpost.com/story/entertainment/dining/2024/07/23/delray-beach-atlantic-avenue-dining-scene-four-new-restaurants-four-on-way/74438097007/",
      "text": "New restaurants in Delray Beach: BBQ; Italian; Mexican; Asian; Bounce News Sports Restaurants Real Estate Opinion Advertise Obituaries eNewspaper Legals DINING Delray Beach's Atlantic Avenue dining scene has several new additions, coming attractions Eddie Ritz Palm Beach Post No stranger to great restaurants , Delray Beach's Atlantic Avenue has gotten a recent influx of new dining destinations and several more are slated to open in the coming months. Located on, or just off, the ultra-cool thoroughfare, these new restaurants promise to bring even more options to diners. Among the newcomers, an award-winning West Palm Beach restaurant that's opening a second location. The fare at these new restaurants includes barbecue, Italian, Southwestern, Asian fusion, upscale American and even a spot dedicated to soft, gooey cookies. Here are four that are on their way and four more that recently opened and are ready to serve: Soon to open in Delray Beach: Tropical Smokehouse Chef Rick Mace will soon be bringing his beloved and award-winning barbecue to Delray Beach. Taking over the space formerly occupied by Pour and Famous on Atlantic Avenue, chef Rick said it will take approximately six to eight months to complete the buildout and open the new Tropical Smokehouse location. He said the concept will be slightly different than the West Palm Beach restaurant with a heavier focus on their amazing ribs and their absolutely, knock-it-out-of-the-park burgers. Looking for a free mini puzzle? Play the USA TODAY Quick Cross now. Information: at 524 W. Atlantic Ave., Delray Beach. eattropical.com Opening ETA: Early 2025 More: 5 best burgers in Palm Beach County for National Hamburger Day Gabriella's Modern Italian Making its way from New Jersey to South Florida, the popular restaurant, Gabriella’s Italian Steakhouse, will soon arrive in South Florida. When Gabriella’s Modern Italian arrives in the fall, expect an extensive food and drink menu. Owner Frankie Brusco said the South Florida iteration, will lean a little bit \"more Italian, less steakhouse.\" The restaurant is all new construction that will have both indoor dining and a covered patio with seating for 60 guests. And in a town that runs tight on parking, Gabriella's will have its own parking area. Many of the popular dishes from the New Jersey location will be making their way to Delray Beach, Brusco said. That includes truffle ricotta, spicy rigatoni, firecracker shrimp and bistecca alla fiorentina (a 40-ounce, 45-day dry aged, porterhouse, served with steak fries, garlic confit, preserved lemon, bone marrow and parsley salad) for two. Information: 40 NE Seventh Ave., Delray Beach. gabriellasfl.com Opening ETA: October 2024 More: Popular Italian restaurant with New Jersey roots coming to downtown Delray Beach Roka Hula This modern Asian fusion concept restaurant and bar actually began in Orlando at parent company True Grit's Voodoo Bayou location. True Grit director of operations Chris Acosta said Roka Hula is a speakeasy within Voodoo Bayou in Orlando and that they are taking that concept and elevating it into a full restaurant. Described as a \"modern Asian tiki bar,\" by Acosta, their website calls it \"a provocative journey into a hidden world of exotic cocktails and exquisite elevated dishes.\" Though a lease has been signed and construction has begun, Acosta declined to give a precise opening date beyond saying \"2025.\" He said the menu will feature many of the same dishes offered in Orlando. That menu includes shareables like ginger tuna crispy rice and hibachi wagyu bites as well as pork belly baos, sashimi, nigiri and much more. The Orlando cocktail menu includes many creatively-named cocktails like the 'go-go devil,' 'Saigon suzy,' 'boneshaker boba,' and many more. Information: 270 E. Atlantic Ave., Delray Beach. rokahula.com/delray-beach Opening ETA: 2025 Geronimo Tequila Bar & Southwest Grill New Haven, Connecticut-based Geronimo Hospitality Co. will be bringing the authentic taste of Santa Fe, New Mexico to the Delray Beach with their Geronimo Tequila Bar and Southwest Grill. Their chefs use ingredients directly from the southwest and the menu includes taste temptations like the fried cauliflower, Frito pie, Navajo frybread, buffalo steak chile soup, tacos, quesadillas, burritos and main plates with dishes including pork chiles rellenos, mixed grill molcajete, gaujillo-braised short rib and more. In addition, the restaurant will offer a massive selection of tequila with hundreds of options. There are currently two Geronimo Tequila Bar and Southwest Grills. The first is in Fairfield, Connecticut and opened in 2003 and the second is in New Haven and opened in 2007. Information: 105 E. Atlantic Ave., Delray Beach. geronimobarandgrill.com Opening ETA: early 2025 Now open in Delray Beach The Standard This local restaurant known for it's upmarket approach to a casual watering hole, recently expanded to downtown Delray Beach. Lifelong Boca Raton residents, owners, and business partners, Nicolas and Ryan Martinez, officially unveiled their second outpost in June, in the city's SoFa neighborhood. In less than a month, the duo transformed the standalone building with a full renovation that features an all-new indoor dining room and bar, large u-shaped covered outdoor bar, sprawling outdoor patio, and full kitchen. Property owner, Brian Rosen says The Standard is the perfect fit for the space formerly occupied by The O.G., a concept he originally opened in 2017 as a three-month pop-up that found enduring success as a locals' favorite watering hole. Moving forward, Nicolas and Ryan — who opened the first location in the midst of the pandemic — say their goal is to offer the downtown scene a new option for a late-night bar and restaurant serving affordably-priced food and drink. The menu mirrors the one offered in Boca Raton with a mix of American-inspired dishes along with the addition of tacos, entrée-style salads, and quesadillas. \"We've had great success in Boca Raton, and always wanted to bring that to Delray Beach,\" says Nicolas. \"The Standard is a place where people can afford to go five nights a week, or really splurge and celebrate.\" ~ Nicole Danna Information: 166 SE Second Ave., Delray Beach. instagram.com/thestandardelray Bounce Promising an 'elevated sports bar experience,' Bounce Delray opened in April just off Atlantic Avenue in downtown Delray Beach. Occupying the space that was once Delray Beach Market, Bounce features a menu suitable for carnivores, herbivores, gluten-free or a combination. Shareables include options such as tuna poke nachos, kale artichoke dip and blackened fish tacos along with their wildly popular bang bang shrimp and the fried mac & cheese bars. They have several varieties of wings and tenders including the super-cool sounding 'Hot Cheetos encrusted.' The menu also features pizzas and handhelds like the Bounce smash burger, buffalo chicken sliders and the charred ahi tuna sando. For the full 'sports bar' experience, they have over 20 televisions including one that's a 60-foot wide LED wall. The massive, literally larger-than-life image is described as \"beyond crystal clear.\" Information: 33 SE Third St., Delray Beach. bouncesportingclub.com/delray More: Popular NY restaurant comes to Delray with monster TV wall, tasty elevated bar food menu Chip City Opened in May, this purveyor of sweet treats offers over three dozen varieties of fresh-baked, served-warm cookies. Co-founder Teddy Gailas believes they nailed the definition of cookie heaven with \"five- to six-ounce, thick cookies that are crispy on the outside, gooey in the center.\" At any given time, the shop offer nine varieties of cookies. That offering includes five standards — chocolate chip, cookies n' cream, s'mores and confetti, along with the dairy-free chocolate chip, which is also vegan. The remaining four change weekly and can include blueberry cheesecake, the brookie, cookie butter with Biscoff filling, dark chocolate peanut butter, horchata, mocha cookie, Nutella sea salt, oatmeal apple pie, peanut butter & jelly, red velvet cookies n' cream, teddi-fetti featuring Teddy Grahams, triple chocolate, and white chocolate macadamia. Information: 302 E. Atlantic Ave., Delray Beach. chipcitycookies.com More: New York City-based gourmet cookie shop now open in Delray Beach Sugar Factory American Brasserie This eatery, and sometimes celebrity hot spot, sits in the 300 block of Atlantic Avenue in the space formerly occupied by Lionfish. It had a soft opening on May 18 and is now serving dinner and brunch on the weekends. With over 20 locations throughout the United States, The Sugar Factory is known for its eight-ounce monster burgers (including the Flaming Hot Cheetos burger and the 24K Gold burger), hot honey chicken waffles, soups, salads and more. There are area-specific dishes as well and for Delray Beach one of them is the fried Oreo cheesecake buttermilk pancakes. Take already great buttermilk pancakes then top them with fried Oreos, chocolate sauce, a slice of NY cheesecake, whipped cream, Oreo crumbles, and powdered sugar. Let the good times roll! An official grand opening is planned for the fall. Operating hours are 4 to 10 p.m. Monday, Thursday and Friday; 11:30 a.m. to 11 p.m. Saturday and 11:30 a.m. to 10 p.m. Sunday. Closed on Tuesdays and Wednesdays. Information: 307 E. Atlantic Ave., Delray Beach. sugarfactory.com/delray-beach Eddie Ritz is a journalist at The Palm Beach Post , part of the USA TODAY Florida Network. You can reach him at eritz@pbpost.com . Help support our journalism. Subscribe today . Careers Staff Directory Accessibility Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Business Advertise Your Business Promote your Event Buy and Sell Licensing & Reprints Help Center Palm Beach Post Store Subscriber Guide Manage Account Give Feedback Newspapers In Education Newsletters Facebook X eNewspaper Archives Jobs Real Estate Classifieds Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.palmbeachpost.com. All rights reserved."
    },
    {
      "url": "https://www.clowns.com/faq/",
      "text": "Clowns.com FAQ's | Answers to Commonly Asked Questions Party Packages Clowns Magicians Characters Princesses Super Heroes Themes Holidays & Religious Events Concession Rentals Bounce Houses Bounce Houses & Jumps Combos Slides Dry Slides Water Slides Obstacle Courses Inflatable Games & Sports Toddlers & Juniors Party Rentals Photo Booths Carnival Games Interactive Games Carnival Tent Rentals Gallery Face Painting Contact us Search Request a Call Client Portal Menu New York New York Florida 200 Meacham Avenue , Elmont NY 11003 516-577-0000 Home › Clowns.com’s Frequently Asked Questions Clowns.com’s Frequently Asked Questions Type of FAQs Main FAQs Character FAQs Bounce House FAQs Concession Rentals FAQs Party Rentals FAQs Face Paint FAQs Title What comes with my party package? Our party packages come with 1 female clown and 1 male magician. The magician will do balloon twisting, magic tricks, and make cotton candy for all the kids and adults to enjoy. The clown will provide face painting or temporary tattoos and bubble games for all the party guests. Both entertainers will do singing & dancing, kids music, play interactive games, and even host an interactive magic show where they’ll have a crowning ceremony for your child. Do you have live bunny rabbits in your magic shows? Beginning on 04/20/2025, we’re bringing back live bunny rabbits for magic shows! If your event date is on or after 04/20/2025, you can add a live bunny rabbit to your party package for only an additional $10. What is your booking process? To book and secure your desired time and date, we require a $100 dollar deposit for entertainment & equipment rentals. We require a $200 dollar deposit on any inflatable bounce house packages. We then put together a contract which will include all of the details of your event. The contract is then e-mailed to you where you may review and sign a final copy. Once you sign a copy of your party contract, you will receive an email receipt and confirmation stating that your event is now booked. The remainder of the balance is due the day of the party before the start of the entertainment. We accept Visa, MasterCard, Discover, & Amex. Please note that deposits are not refundable, but transferable with a 14 day notice of cancellation. How many characters can I have at my party? You can have as many characters as you want at your party! The more, the merrier! How long in advance should I book a character? At Clowns.com we typically have a waiting list 3 to 4 weeks in advance of your desired party date. For example, if your party is taking place on May 4th, chances are that date has already been fully booked by April 4th. The reason we are booked this far in advance is that we only have a select number of entertainers who work in-house. We do not contract or hire outside entertainers. This is contrary to how 99% of the clown industry works. While no one will ever admit it, this is unfortunately what takes place. We believe that we cannot sacrifice the quality of our show by hiring someone who does not understand the level of service which our clients expect. This is why we are selective about which parties we decide to take on. We recommend booking your party as soon as you are sure of the date and time of your event. What areas do you service? In New York, we service Long Island, Queens, the Bronx, Brooklyn, Manhattan, Yonkers & Southern Westchester. In Florida, we service Boca Raton, Boynton Beach, Coconut Creek, Coral Springs, Deerfield Beach, Delray Beach, Fort Lauderdale, Margate, Parkland, and West Palm Beach. How does my party package change with a character? Your party becomes more fun! In addition to everything that comes with your standard party package, a character will pose for pictures, play games, dance, and more with the children! Plus, every character comes with themed music from their respective TV shows. Are your costumes in good condition? Our costumes and equipment are of the highest quality. Our equipment is kept clean and regularly maintained. We own (instead of rent) all of our own costumes, so you can be sure that our costumes are very clean and fresh with no rips or stains. What do your characters do? Our characters are extremely animated and not only pose for pictures but dance and play games with the children. Moreover, all of our characters come with themed music from their respective TV shows. Can you tell me about your entertainers? All of our entertainers are between the ages of 21 & 29. All of our entertainers must have either an Education degree or Theater degree. All entertainers must do a minimum 6 month rigorous training program. Our entertainers are clean cut and know to put on a great performance. How early or late do your entertainers show up to my event? Our entertainers will arrive at your event up to 30 minutes before their scheduled arrival time, which can be found in your contract. We provide a 30 minute window to accommodate any potential delays and unforeseen circumstances preventing a timely arrival. What age groups do you entertain? Our entertainers are specifically trained to entertain children between the ages of 1-12. Are your clowns scary? Our clowns do not look scary! They do not wear makeup (face paint), gloves or wigs. Please view our Gallery to get a better feel for how our clowns look. What’s the difference between your Silver, Gold, and Platinum Packages? Our Silver package is a 60 minute package and is geared to entertain 10 – 15 Children. Our Gold package is a 90 minute package and is geared to entertain 15 – 25 Children. Our Platinum package is a 2 Hour package and is geared to entertain 30 – 50 Children. If you have 15 children and still want the 2 Hour Platinum package, we do accommodate that request. In those situations you will get more detailed face painting, a lot more games, sing-a-longs and a longer Magic Show. Are you insured & bonded? Yes, we are fully insured & bonded. Do you travel to the event/venue? Yes, we travel to all types of venues, from private homes to catering halls, restaurants, clubs, & more. How early or late can my event take place? Earliest event starting time is at 9 A.M. and the latest party starts no later than 11 P.M. If your event falls outside of that time range please call one of our party consultants at: 516-577-0000. How long does it take to set up? All of our entertainers have preset bins, so everything is organized and ready to go. On average setup time is less than 4 minutes. Do you accommodate Religious Events? Yes, please let us know what you require and we will make sure to accommodate your request. Our entertainers are experienced in Communions, Christenings, Upsherin, Mundan, & many more. Do I need to provide the entertainers with anything? Yes, we ask the host to please provide a medium sized table with 2 chairs and an electrical outlet. This will ensure that your event will start right away. Please also note that Clowns.com is not responsible for electricity. How much space do the entertainers need? We have done events everywhere, from small studio apartments to huge auditoriums and coliseums. We will do our very best to work with the space we are provided with and make sure that everyone has a good time whether the space is small or extremely spacious. After I pay my deposit, when is the final balance due? ALL FINAL PAYMENTS MUST BE MADE AT LEAST 72 HOURS PRIOR TO YOUR BOOKED EVENT DATE. We accept payments through Venmo, Zelle, Cash App, and credit card payment. How much should I tip the entertainers? Gratuities are appreciated and are NOT already included in our package prices. Like most services, an appropriate gratuity ranges from 15%-25 of the total package price. How many characters can I have at my party? You can have as many characters as you want at your party! The more, the merrier! How long in advance should I book a character? At Clowns.com we typically have a waiting list 3 to 4 weeks in advance of your desired party date. For example, if your party is taking place on May 4th, chances are that date has already been fully booked by April 4th. The reason we are booked this far in advance is that we only have a select number of entertainers who work in-house. We do not contract or hire outside entertainers. This is contrary to how 99% of the clown industry works. While no one will ever admit it, this is unfortunately what takes place. We believe that we cannot sacrifice the quality of our show by hiring someone who does not understand the level of service which our clients expect. This is why we are selective about which parties we decide to take on. We recommend booking your party as soon as you are sure of the date and time of your event. What areas can I book a character in? In New York, you can book a character for events in Long Island, Queens, the Bronx, Brooklyn, Manhattan, Yonkers & Southern Westchester. In Florida, you can book a character for events in Boca Raton, Boynton Beach, Coconut Creek, Coral Springs, Deerfield Beach, Delray Beach, Fort Lauderdale, Margate, Parkland, and West Palm Beach. How does my party package change with a character? Your party becomes more fun! In addition to everything that comes with your standard party package, a character will pose for pictures, play games, dance, and more with the children! Plus, every character comes with themed music from their respective TV shows. Are your costumes in good condition? Our costumes are of the highest quality. We own (instead of rent) all of our own costumes, so you can be sure that our costumes are very clean and fresh with no rips or stains. What do your characters do? Our characters are extremely animated and not only pose for pictures but dance and play games with the children. Moreover, all of our characters come with themed music from their respective TV shows. Can you tell me about your entertainers? All of our entertainers are between the ages of 21 & 29. All of our entertainers must have either an Education degree or Theater degree. All entertainers must do a minimum 6 month rigorous training program. Our entertainers are clean cut and know to put on a great performance. How early or late does your character show up to my event? Our entertainers will arrive at your event up to 30 minutes before their scheduled arrival time, which can be found in your contract. We provide a 30 minute window to accommodate any potential delays and unforeseen circumstances preventing a timely arrival. How big are the bounce houses? Our bounce houses vary greatly in size. We also always recommend an extra foot of space for the length, width, and height of the area you’ll be placing the bounce house to ensure the safety of all the children playing in it. For example, if your bounce house is 17’L x 17’W x 15’H, we would recommend a space of at least 18’L x 18’W x 16’H. Bounce Houses and Combo Slides can range from 15 to 29 feet in length, 15 to 20 feet in width, and 13 to 19 feet in height. Inflatable Slides can range from 17 to 65 feet in length, 10 to 22 feet in width, and 12 to 30 feet in height. Obstacle Courses can range from 30 to 110 feet in length, 10 to 20 feet in width, and 12 to 20 feet in height. Inflatable Games can range from 5 to 45 feet in length, 4 to 28 feet in width, and 7 to 21 feet in height. Indoor Bounce Houses can range from 8 to 18 feet in length, 8 to 18 feet in width, and 8 to 10 feet in height. How much room around the bounce houses do I need for safe operation? We also always recommend an extra foot of space for the length, width, and height of the area you’ll be placing the bounce house to ensure the safety of all the children playing in it. For example, if your bounce house is 17’L x 17’W x 15’H, we would recommend a space of at least 18’L x 18’W x 16’H. How many kids can fit in a bounce house? It depends on the size of the bounce house, however we recommend a 1500 pound weight limit for the safety of the children Can bounce houses be inflated inside? Yes, bounce houses can be inflated inside! Simply plug in the bounce house to an outlet to inflate. However, this may change depending on the size of the bounce house. Our bounces houses require at least 5,000 watts of power to operate properly. What happens if it’s raining the day of my party? Please check the weather forecast 72 hours in advance of your party! We will honor weather-related requests made with reasonable notice before the event date. Does the bounce house need its own generator? No, most bounce houses do not require a generator. Because our bounce houses can be plugged into an outlet to inflate, a generator is usually not necessary. However, for specific instances of outdoor events with no outlet available, you will need to provide a generator to inflate your bounce house. How do I power the generator? The generators require gas to operate. Depending on the length of your event the generator may run out of fuel to operate properly. You will be responsible for ensuring that your generator is properly fueled. How far in advance should I book a bounce house? At Clowns.com we typically have a waiting list 3 to 4 weeks in advance of your desired party date. For example, if your party is taking place on May 4th, chances are that date has already been fully booked by April 4th. The reason we are booked this far in advance is that we only have a select number of entertainers who work in-house. We do not contract or hire outside entertainers. This is contrary to how 99% of the clown industry works. While no one will ever admit it, this is unfortunately what takes place. We believe that we cannot sacrifice the quality of our show by hiring someone who does not understand the level of service which our clients expect. This is why we are selective about which parties we decide to take on. We recommend booking your party as soon as you are sure of the date and time of your event. When are the bounce houses delivered and picked up? Bounce houses are delivered as early as the night before your party, or as late as the morning of the party, depending on the routing schedules created for that specific weekend. Bounce houses are then picked up the day after your party. What areas do you rent bounce houses in? In New York, you can book our bounce houses for events in Long Island, Queens, the Bronx, Brooklyn, Manhattan, Yonkers & Southern Westchester. In Florida, you can book our bounce houses for events in Boca Raton, Boynton Beach, Coconut Creek, Coral Springs, Deerfield Beach, Delray Beach, Fort Lauderdale, Margate, Parkland, and West Palm Beach. Are your bounce houses clean? Yes, we clean our bounce houses before they are sent out each day for events, and after they are picked up. How long does it take to set up a bounce house? Bounce houses usually take about 30 minutes to set up, from drop off to being fully inflated. Do I have to set up the concession by myself, or do you provide an attendant? No, you won’t have to set up any of our concessions. The party entertainers will set up the cotton candy machines, and for any other concession, a separate team will be at your party to help make sure the concessions are set up properly. Do I have to run the concession by myself, or do you provide an attendant? No, our party entertainers will make cotton candy for your party guests! If you have any other concession rentals, we will be sending a separate team to set up and distribute those concessions. Some examples of other concessions are popcorn, snow cones, and ice cream! How early are concessions delivered, and how late are they picked up? The concessions are delivered up to 1 hour before the start time of your event, and picked up after your event concludes. Which of your concessions are kosher? Our kosher concessions include all of our concessions are kosher! This even holds true with our hot dogs, as we only supply the grill/cart. What are the electrical requirements of your concessions? Our concessions require at least 5,000 watts. How do I power a generator? Generators require gas to operate. Depending on the length of your event the generator may run out of fuel to operate properly. You will be responsible for ensuring that your generator is properly fueled. What comes with my concession? Every concession rental comes with an attendant and the concession machine. For popcorn, cotton candy and donuts, we will supply everything as far as food for your party. For snow cones and ice cream, we supply the flavors to make the treats delicious. You will be responsible for the ice and milk, if applicable. For hot dogs, you will be responsible for supplying the hot dogs, buns, and condiments for your guests. We will supply the cheese for the nacho machine, but you will be responsible for supplying the chips for your party guests. How many concessions can I have at my party? There is no limit to the number of concessions you are allowed to rent for your party! You’ll just need to make sure you can accommodate any electrical requirements or supply any food, depending on the concession rental. How long in advance should I book a concession for my party? At Clowns.com we typically have a waiting list 3 to 4 weeks in advance of your desired party date. For example, if your party is taking place on May 4th, chances are that date has already been fully booked by April 4th. The reason we are booked this far in advance is that we only have a select number of entertainers who work in-house. We do not contract or hire outside entertainers. This is contrary to how 99% of the clown industry works. While no one will ever admit it, this is unfortunately what takes place. We believe that we cannot sacrifice the quality of our show by hiring someone who does not understand the level of service which our clients expect. This is why we are selective about which parties we decide to take on. We recommend booking your party as soon as you are sure of the date and time of your event. What areas can I book a concession in? In New York, you can book our concession rentals for events in Long Island, Queens, the Bronx, Brooklyn, Manhattan, Yonkers & Southern Westchester. In Florida, you can book our concession rentals for events  in Boca Raton, Boynton Beach, Coconut Creek, Coral Springs, Deerfield Beach, Delray Beach, Fort Lauderdale, Margate, Parkland, and West Palm Beach. How does my party package change with a concession? Your party hardly changes at all! The only difference is more snacks for your guests to enjoy, and to make sure there’s enough food for everyone. Keep in mind, every party package already comes with delicious cotton candy? Is your equipment in good condition? Our equipment is of the highest quality. It’s kept clean and regularly maintained. We own (instead of rent) all of our own equipment, so you can be sure that our machines are very clean and fresh. Do I have to set up the party rental by myself? We send an attendant to help set up our photo booths and select electronic games, and the remainder of our party rentals will need to be set up. However, if you want to forgo setting up yourself, you can add an attendant for an additional fee. How early are party rentals delivered, and how late are they picked up? Party rentals can arrive up to 1 hour before the start time of your party, and are picked up after your party concludes. What are the electrical requirements of your party rentals? Our party rentals that require power all require at least 5,000 watts of power to operate properly. What comes with my party rental? Your party rental comes with the machine or game rented, an attendant to help set up depending on the machine or if you requested an attendant for an additional fee, and depending on the party rental, any add-ons that come with it! A great example of this is the double-sided backdrop that is included with our photo booths. How many party rentals can I have at my party? You can have as many party rentals as you want at your party. The more, the merrier! How long in advance should I book a party rental for my party? At Clowns.com we typically have a waiting list 3 to 4 weeks in advance of your desired party date. For example, if your party is taking place on May 4th, chances are that date has already been fully booked by April 4th. The reason we are booked this far in advance is that we only have a select number of entertainers who work in-house. We do not contract or hire outside entertainers. This is contrary to how 99% of the clown industry works. While no one will ever admit it, this is unfortunately what takes place. We believe that we cannot sacrifice the quality of our show by hiring someone who does not understand the level of service which our clients expect. This is why we are selective about which parties we decide to take on. We recommend booking your party as soon as you are sure of the date and time of your event. What areas can I book a party rental in? In New York, you can book our party rentals for events in Long Island, Queens, the Bronx, Brooklyn, Manhattan, Yonkers & Southern Westchester. In Florida, you can book our party rentals for events in Boca Raton, Boynton Beach, Coconut Creek, Coral Springs, Deerfield Beach, Delray Beach, Fort Lauderdale, Margate, Parkland, and West Palm Beach. How does my party package change with a party rental? Depending on the party rental you’ve selected for your party, an attendant will be present at your party to help set up and work the party rental, or we’ll simply drop off the addition before your party and pick it up after. Is your equipment in good condition? Our equipment is of the highest quality. We own (instead of rent) all of our own equipment, so you can be sure that our machines are very clean and operate correctly. If it’s hot, will your face paint melt? Nope! Our face paint is made with special properties made to withstand all sorts of elements, including the heat (and sweat that comes with it)! Is your face paint included in your party packages? Yes, our face paint is included in all of our party packages! If your child doesn’t want face paint, or is too young to get face paint, we also have temporary tattoos as an option. If your child wants face paint, but not on their face, we can also paint on their hands or arms. Can I book just your face paint? No, we don’t offer only face paint. But why would you stop there? Our party packages come with face paint, plus 1 female clown and 1 male magician. The magician will do balloon twisting, magic tricks, and make cotton candy for all the kids and adults to enjoy. The clown will provide face painting or temporary tattoos and bubble games for all the party guests. Both entertainers will do singing & dancing, kids music, play interactive games, and even host an interactive magic show where they’ll have a crowning ceremony for your child. What can the kids at my party get for face paint? Anything they want! Their wish is our command. What if the kids at my party don’t want face paint? We have plenty of alternatives! If they still want face paint, but not on their face, our entertainers can paint on their hands or arms. If they don’t want paint altogether, we have temporary tattoos that your kids will love! Is your face paint safe for sensitive skin? Yes, our face paint is safe for sensitive skin! It’s formulated properly to be hypoallergenic and safe for children (and adults) with sensitive skin. How easily does your face paint wash off? Extremely easily; nothing some warm water and soap can’t handle! What happens if the face paint accidentally gets in a child’s eye? The face paint is safe and will not hurt your children’s eyes. If face paint does get into a child’s eye, simply wash their eye with warm water. What happens if the face paint accidentally gets in a child’s mouth? The face paint is safe to ingest, although we definitely don’t recommend it! After all, it belongs on faces making artwork, not in tummies for snack time. Party Packages Clowns Magicians Characters Princess Superhero Themes Science Party Concession Rentals Cotton Candy Cart Popcorn Machine Snow Cone Machine Hot Dog Cart Ice Cream Machine Donut Machine Bounce House Rentals Combo Slides Dry Slides Water Slides Obstacle Courses Inflatable Games Toddlers & Juniors Party Rentals Photobooths Carnival Games Interactive Games Carnival Tent Rentals Company About Us Photo Gallery Testimonials Blog Catalog Careers Contact us Our Contacts inquiries@clowns.com New York 200 Meacham Avenue , Elmont NY 11003 516-577-0000 Florida 610 S Military Trail , Deerfield Beach FL 33442 954-570-0000 Our Contacts Get Your Free Quote Request a call Client Portal View on Google Maps Google Rating 4.8 © 2025 Clowns.com. All rights reserved. Clowns.com Terms Of Use Clowns.com Copyright Policy Privacy Policy Costumer Disclaimer Sitemap"
    },
    {
      "url": "https://countrymanors.net/contact-us/",
      "text": "Contact Details | Country Manors Association, Inc. Skip to content Country Manors Association, Inc. Home About Us Contact Us × Home About Us Contact Us Home About Us Contact Us × Home About Us Contact Us Contact Us Reach Out To Us Thanks for stopping by! Country Manors Association, Inc. is a condominium association with villas that carry all the necessary amenities. The condominium has eight sections, each with a heated pool and a carport for each villa. Enjoy the benefits by becoming a member. If you wish to become a member or need further information on our condominium, please do not hesitate to contact us. For any other questions or concerns, you may have, drop us a line! Contact Info Phone (561) 498-8300 Fax (561) 498-4099 4900 Country Manors Boulevard, Delray Beach, FL 33445 cmaoffice@countrymanors.net send us a message Name * * Phone * * Email * * Message Comments This field is for validation purposes and should be left unchanged. Country Manors Association, Inc. 4900 Country Manors Boulevard Delray Beach, FL 33445 cmaoffice@countrymanors.net Tuesday: 9:00 AM - 12:00 NOON Wednesday: 3:00 PM -6:00 PM Friday: 9:00 AM -12:00 NOON Home About Us Contact Us © 2025, Country Manors Association, Inc. All Rights Reserved. Scroll To Top"
    },
    {
      "url": "https://www.scratchmedia.net/about-us",
      "text": "About Us - Scratch Media Media Technology Store My Account Home Services Contact Us Google Maps Behind the Repairs Our Story Many of you may remember us as CRCT Electronics, originally located inside of Pak it Tight, a USPS post office in Delray Beach, Florida. While our roots in media & technology span back several years, our official journey as a dedicated local business started in January of 2023. Over time, as our service offerings expanded, the physical limitations of our modest location were quickly outpaced by the needs of complex equipment and workspace alike. In search of a location that better aligned with our vision, we relocated to a commercial location in Boca Raton. Now equipped with sufficient space to offer a wide range of services, we were ready to serve our community with an elevated customer experience. Our Brand When we decided to rebrand from CRCT Electronics to Scratch Media, it was about more than just a name change—it was about redefining who we are and what we stand for. The name Scratch Media reflects our philosophy: everything we do, we build from scratch. Whether it’s a custom computer build, a tailored IT solution, or a creative media project, we start with a blank slate and craft solutions uniquely designed to fit your needs. This name embodies our dedication to innovation, creativity, and precision in everything we create. It’s a reminder of our roots in personalized service and our commitment to delivering results that truly stand apart. Our Mission At Scratch Media, our mission is to meet the diverse needs of our clients by delivering exceptional solutions across technology and media. From quick repairs and system optimizations to ambitious creative projects, we approach every task with a level of care and dedication as if our own. Whether you're seeking to fix, enhance, or create, we're here to fill in the blanks to bring your vision to life. We are deeply grateful to our customers who have been with us since the beginning and continue to trust us with their needs. Your support and loyalty have been instrumental in our growth, and we look forward to serving you for many years to come. Services Smartphone Repair Tablet Repair Computer Repair Virus Removal System Tune Up Data Backup & Recovery Custom PC Build 3D Printing Soldering & DIY Info About Us FAQ Guidelines Repair Policy Refund Policy Privacy Policy Street Address 4331 N Dixie Hwy, Suite #2 Boca Raton, FL 33431 Business Hours Monday to Friday - 10AM to 5PM Saturday - Appointment Only Contact +1 (786) 423-7398 contact@scratchmedia.net © Scratch Media LLC 2025"
    },
    {
      "url": "https://us.bouncepad.com/pages/contact-us",
      "text": "Bouncepad | Contact Skip to content Free shipping for online orders over $100 to the US. New Launch: Twist, Twin & Reach tablet mounts – flexible, secure, and stylish. Shop Shop Shop by Type Shop by Type Desk Mount Wall Mount Floor Stand Free Standing Dual Mount Meeting Room Controllers iPad POS Stands Accessories ALL TYPES Shop By Device Shop By Device Apple iPad Apple iPad Air Apple iPad Mini Apple iPad Pro Samsung Galaxy Tab Microsoft Surface ALL DEVICES Shop by Product Shop by Product Original Range Core Range Twin Eddy Click Go Link Utility Line Wing Sumo Shop by Use Case Shop by Use Case Point of Sale Visitor Management Staff Management Parking Management Digital Signage Self-Service ALL USE CASES Shop by Environment Shop by Environment Reception Retail Hospitality Meeting Rooms Events Banking Healthcare Education ALL ENVIRONMENTS Support Support Help Desk Help Desk Contact Us Shipping Returns FAQs Wholesale About Us About Us Our Story Our Journal Our Case Studies Socials Socials Instagram LinkedIn Facebook Twitter Resources Resources Samsung Guides Samsung Guides Turn Off Autolock Clear Cache Disable Auto Brightness Kiosk Mode Maximize Battery Life What Samsung tablet do you have? iPad Guides iPad Guides Turn Off Autolock Clear Cache Disable Auto Brightness Kiosk Mode Maximize Battery Life What iPad do you have? Product Guides Product Guides Top 5 Products for POS Top 5 Products for Parking Management Top 5 Products for Visitor Management Top 5 Products for Self-Service Top 5 Products for Customer Feedback Label Top 5 iPad Wall Mounts Top 5 iPad Floor Stands Helpful Reads Helpful Reads USB Types Explained Tablet Charging Explained Apple vs Samsung vs Microsoft POE Explained ADA Compliance Original vs Core Range Mounting from Above or Below? Click vs Eddy All Resources Log in Twitter Facebook Instagram Shop Shop by Type Desk Mount Wall Mount Floor Stand Free Standing Dual Mount Meeting Room Controllers iPad POS Stands Accessories ALL TYPES Shop By Device Apple iPad Apple iPad Air Apple iPad Mini Apple iPad Pro Samsung Galaxy Tab Microsoft Surface ALL DEVICES Shop by Product Original Range Core Range Twin Eddy Click Go Link Utility Line Wing Sumo Shop by Use Case Point of Sale Visitor Management Staff Management Parking Management Digital Signage Self-Service ALL USE CASES Shop by Environment Reception Retail Hospitality Meeting Rooms Events Banking Healthcare Education ALL ENVIRONMENTS Support Help Desk Contact Us Shipping Returns FAQs Wholesale About Us Our Story Our Journal Our Case Studies Socials Instagram LinkedIn Facebook Twitter Resources Samsung Guides Turn Off Autolock Clear Cache Disable Auto Brightness Kiosk Mode Maximize Battery Life What Samsung tablet do you have? iPad Guides Turn Off Autolock Clear Cache Disable Auto Brightness Kiosk Mode Maximize Battery Life What iPad do you have? Product Guides Top 5 Products for POS Top 5 Products for Parking Management Top 5 Products for Visitor Management Top 5 Products for Self-Service Top 5 Products for Customer Feedback Label Top 5 iPad Wall Mounts Top 5 iPad Floor Stands Helpful Reads USB Types Explained Tablet Charging Explained Apple vs Samsung vs Microsoft POE Explained ADA Compliance Original vs Core Range Mounting from Above or Below? Click vs Eddy All Resources United States Choose Your Location United States United Kingdom France Deutschland Europe United States Canada Australia Rest of world Confirm Search Log in Cart Item added to your cart Check out Continue shopping Contact Us Have some questions? We’d love to hear from you. Whether you’d like to speak about a custom project, specific product or have a delivery query, our team is here to help. Please reach out to us using the contact methods below. Our friendly and dedicated customer service team is available Monday through to Friday between 9AM and 5PM (UK Time). Email our team customerservice@bouncepad.com Give us a call US +1 617 804 0110 Chat with us Prefer a quick chat? Just click the chat icon below. Alternatively, fill out the contact form below and we’ll get back to you as soon as we can. Name Email * Phone number Comment Send Shop Free Standing Desk Mount Floor Stand Wall Mount Dual Mount iPad POS Stand Meeting Room Controllers Accessories Explore About Us Contact Us Shipping Wholesale Journal Case Studies Terms and Conditions Privacy Policy Contact Bouncepad North America Inc. Suite Bouncepad 198 Tremont Street Boston, MA, 02116 United States +1 617 804 0110 customerservice@bouncepad.com Twitter Facebook Instagram Linkedin Country/region Subscribe to our emails Email Payment methods Amazon American Express Apple Pay Diners Club Discover Google Pay Mastercard PayPal Shop Pay Venmo Visa © 2025, Bouncepad North America Inc Choosing a selection results in a full page refresh. English English"
    },
    {
      "url": "https://bouncesportingclub.com/delray/",
      "text": "Bounce Delray Beach Skip to content Toggle Navigation MENUS DELRAY BEACH, FL MONTAUK, NY PENSACOLA BEACH, FL RESERVE DELRAY BEACH, FL MONTAUK, NY PENSACOLA BEACH, FL HAPPENINGS DELRAY BEACH, FL MONTAUK, NY PENSACOLA BEACH, FL PRIVATE EVENTS DELRAY BEACH, FL MONTAUK, NY PENSACOLA BEACH, NY LOCATIONS DELRAY BEACH, FL MONTAUK, NY PENSACOLA BEACH, FL Toggle Navigation MENUS DELRAY BEACH, FL MONTAUK, NY PENSACOLA BEACH, FL RESERVE DELRAY BEACH, FL MONTAUK, NY PENSACOLA BEACH, FL HAPPENINGS DELRAY BEACH, FL MONTAUK, NY PENSACOLA BEACH, FL PRIVATE EVENTS DELRAY BEACH, FL MONTAUK, NY PENSACOLA BEACH, NY LOCATIONS DELRAY BEACH, FL MONTAUK, NY PENSACOLA BEACH, FL Location Delray Beach Admin 2025-06-02T16:04:30+00:00 MENUS | RESERVE | GALLERY | HAPPENINGS | PRIVATE EVENTS | CONTACT | HOURS Bounce Beach Delray Bounce Beach Delray Experience Delray Beach Florida in a new dining atmosphere. Menus + Reserve Menus + Reserve Menus FOOD MENU FOOD MENU DRINK MENU DRINK MENU Book Now RESERVE TABLE RESERVE TABLE EVENT TICKETS EVENT TICKETS Loading the next set of gallery items... Load More Events Calendar Click for Events Calendar Click for Events Calendar Host Your Event at Bounce Square Footage Interior: 5200 Square Feet Exterior: 325 Square Feet Table & Seating Plan Interior: 21 Tables + 96 Seats Bar Stools: 37 Exterior: 7 Tables + 28 Seats Audio Visual Custom 2 Sided Chandelier 20 LED TV’s LED Wall Click for Private Event Booking Form Click for Private Event Booking Form Contact & Location 33 SE 3rd Ave Suite 101 Delray Beach Florida United States 33483 bouncedelray@branditgrp.com 561-846-7010 Hours Monday 6pm – 2am Tuesday 4pm – 2am Wednesday 4pm – 2am Thursday 3pm – 2am Friday 4pm – 2am Saturday 11:30am – 2am Sunday 11:30am – 2am Your Beachside Sports Bar Here to Serve General Inquiries General Inquiries Press Careers Contact Menus Reserve Locations Stay tuned with our newsletter JOIN LIST Thank you for joining our newsletter! × There was an error submitting. Please try again. × Delray Beach Socials Montauk NY Socials Pensacola Beach Socials © 2025 • Brandit Hospitality Group •   All Rights Reserved   •   Site by Spaz Media Page load link Go to Top"
    },
    {
      "url": "https://bouncemkt.com/pages/contact-us",
      "text": "CONTACT US FREE SHIPPING ON ORDERS $75+ Search 0 Cart SHOP By Size Boys 0-24 Months Girls 0-24 Months Boys 2-5 Years Girls 2-5 Years Boys 6-12 Years Girls 6-12 Years By Gender All Boys All Girls Gender Neutral By Type Shoes Tops Bottoms Dresses One Piece Outerwear Sets Swimwear NEW ARRIVALS NWT SUSTAINABLE BRANDS SALE SELL TO US GET STARTED FAQs OUR STORY VISIT US BLOG 0 CONTACT US Hours of Operation Monday – Friday: 10 AM – 5 PM Saturday: 10 AM – 2 PM Sunday - Closed For any general inquiries, please submit your questions and information in the form provided and someone will be in touch. Want to reach us right away? Feel free to call at (551) 256-0788 or email hello@bouncemkt.com and we'll respond as soon as possible. Bounce Mkt 720 Monroe Street Suite E410 Hoboken, NJ 07030 Name * Email * How can we help? * Submit Should be Empty: About Us Shop gently used kids' clothing at Bounce Mkt. Sustainable, affordable, and adorable—shipped nationwide or shop in-store in Hoboken, NJ. We make it secondhand shopping as easy on you as it is on the planet. Facebook Follow on X Pinterest Instagram Shop New Arrivals Baby Toddler Boys Girls Shoes SALE Company Our Story Our Blog We're Hiring Why Bounce Mkt Terms of Use Privacy Policy Shipping Policy Refund Policy Contact Us Subscribe to Text Messages Customer Care How Can We Help? FAQs Subscribe to Text Messages Check Your Store Credit Balance Here How To Use Store Credit Balance How To Use Online Rewards Schedule a Pick Up Out of State Sell Online Hours & Location Our Sustainability Promise Subscribe Be the first to know about new collections and exclusive offers. Subscribe © 2025, Bounce Mkt Powered by Shopify Payment methods American Express Diners Club Discover JCB Maestro Mastercard PayPal Shop Pay Union Pay Visa"
    },
    {
      "url": "https://whatnowmia.com/bounce-sporting-club-plans-delray-location/",
      "text": "Bounce Sporting Club Plans Delray Location Home News Restaurants Retail Real Estate Business Owners Get Coverage Join Accelerate Event Browse Partners Resource Guide Preferred Partners View Partner Directory Become a Partner Cities Atlanta Austin Boston Charleston Charlotte Chicago Columbus Dallas Denver Detroit Houston Jacksonville Las Vegas Los Angeles Memphis Miami Montreal Nashville New Orleans New York Orange County Orlando Philadelphia Phoenix Portland Sacramento San Antonio San Diego San Francisco Seattle Tampa Toronto Washington D.C. Atlanta Austin Boston Charleston Charlotte Chicago Columbus Dallas Denver Detroit Houston Jacksonville Las Vegas Los Angeles Memphis Montreal Miami Nashville New Orleans New York Orange County Orlando Philadelphia Phoenix Portland Sacramento San Antonio San Diego San Francisco Seattle Tampa Toronto Washington D.C. SUBSCRIBE TO NEWSLETTER SUBSCRIBE Search Home News Restaurants Retail Real Estate Business Owners Get Coverage Join Accelerate Event Browse Partners Resource Guide Preferred Partners View Partner Directory Become a Partner Cities Atlanta Austin Boston Charleston Charlotte Chicago Columbus Dallas Denver Detroit Houston Jacksonville Las Vegas Los Angeles Memphis Miami Montreal Nashville New Orleans New York Orange County Orlando Philadelphia Phoenix Portland Sacramento San Antonio San Diego San Francisco Seattle Tampa Toronto Washington D.C. Restaurants Bounce Sporting Club Plans Delray Location It’s the fourth location for the high-end sports-bar-meets-nightlife brand Published Date: November 21, 2022, 6:00 PM EST Written By Neil Cooney News Writer Share SHARE Next year, Delray Beach will become home to the newest Bounce Sporting Club . The high-end sports bar chain, with its unique nightlife flare, currently has locations operating in New York City , Chicago , and Montauk . The Delray location will be the fourth restaurant for the brand, developed by BrandIt Hospitality Group . Bounce Sporting Club Delray is still in its planning phase, BrandIt Group founder Yosi Benvenisti told What Now on Monday. “We’re planning on having outdoor and indoor space,” Benvenisti said. “We’re still playing off our American fare, everything made from scratch, but we’re gearing it up toward the warmer climate. There will be more for the South Florida Palette.” Bounce’s menu has featured chicken wings and strips in flavors like Naked, Smoked, Classic Buffalo, Spicy Koreatown, and Maple Bacon. Its burgers have included the BSC Burger ( Lafrieda classic blend, tomato confit, white cheddar, sunny fried hen egg, arugula, secret sauce ) and the Impossible Burger. A selection of small bites includes Chicken Shawarma Tacos, Truffle Mushroom Flatbread, and Pulled Chicken Nachos. The Delray Beach location will open at 33 SE Third Ave. , just south of the intersection with East Atlantic Avenue , on the north side of the Delray Beach Market food hall. It is expecting an opening in Summer/Fall 2023. “We’re very excited to be part of the great Delray entertainment district,” Benvenisti said. Photo: Official 33 SE 3rd Ave, Delray Beach, FL 33483 Be the First to Know From new restaurant openings to exciting retail launches and real estate insights, be the first to know what’s happening in Miami Subscribe & Stay Ahead Share This Article Facebook Copy Link Print By Neil Cooney Follow: Neil Cooney is a freelance writer. He has received an MFA in Creative Writing from Syracuse University, and his work has been published in the Masters Review. Based in Nashville, he spends his free time cooking Korean food and studying chess. Previous Article International Fast Casual Falafel Chain Maoz Vegetarian Plans Boynton Beach Location Next Article Pummarola Pizzeria Napoletana to Open in Fort Lauderdale Leave a Comment Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Δ Other Relevant News Dolce Bistro Opening with Pan-Caribbean Cuisine in Sunrise September 5, 2025 Neil Cooney Motek Taking Over Former Maty’s Space in Midtown Miami September 5, 2025 Neil Cooney Toma Boba Submits Paperwork for West Palm Beach Space September 5, 2025 Neil Cooney I Love Dumplings Opening in North Miami Beach September 5, 2025 Neil Cooney Fluke Martini & Crudo Bar to Reopen in the Fall September 4, 2025 Neil Cooney Einstein Bros. Bagels Heads to Royal Palm Beach September 4, 2025 Neil Cooney The Tree House Play and Cafe Expanding to Pompano Beach September 4, 2025 Neil Cooney Ready to Open, Grow, or Expand Your Business? What Now connects leading organizations across the restaurant, retail, and real estate industries nationwide, empowering you to grow, expand, and thrive in local markets. Let’s Talk! GOT A NEWS STORY/TIP? Something opening or closing in your neighborhood? Drop us a note: [email protected] Pre-Opening Checklist Our Partner Guide outlines every step in opening a restaurant — from concept creation to securing a lease to hiring your team, and everything in between. Download Now More From Miami Local News First Hot Yoga and Cold Plunge Studio Opening in Downtown Miami Riya Singh July 14, 2025 Local News After 40 Years, This Palm Beach Ice Cream Shop Is Saying Goodbye Twinkle Jha May 12, 2025 Local News Miami’s Ultimate Racing Event Returns – And It’s More Exciting Than Ever Midhun Hari April 28, 2025 Weekly Must Reads Miami Toma Boba Submits Paperwork for West Palm Beach Space Neil Cooney | September 5, 2025 Miami LM Restaurants Opening Lucky Lou’s Raw Bar in Deerfield Beach Neil Cooney | May 21, 2025 Miami Report Says This Florida City’s Homeowners Carry the Nation’s Heaviest Climate Burden Riya Singh | September 3, 2025 Miami I Love Dumplings Opening in North Miami Beach Neil Cooney | September 5, 2025 Popular News from Other Cities Phoenix Major Phoenix Builder Enters Chapter 11 Bankruptcy Proceedings Deepali Singla | September 8, 2025 San Francisco Fried Chicken Spot in San Francisco Closed Temporarily After Health Inspection Twinkle Jha | September 8, 2025 Atlanta Cumming Barbecue Spot Under New Ownership Emily McGinn | September 5, 2025 Denver Construction Underway on Lone Tree Jack’s Katie Porter | September 5, 2025 Something opening or closing in your ‘hood? Drop us a Note: [email protected] © What Now Media Group 2025. All rights reserved. About Company Contact Copyright Privacy Policy Welcome Back! Sign in to your account Username or Email Address Password Remember me Lost your password?"
    }
  ]
}