{
  "fuentes": [
    {
      "url": "https://bowdenmedicine.com/contact-us/",
      "email": "info@bowdenmedicine.com"
    },
    {
      "url": "https://www.bow-school.org.uk/Staff/Staff-list/",
      "email": "enquiry@bow-school.org.uk"
    },
    {
      "url": "https://www.bowdensown.com.au/contact-us",
      "email": "info@bowdensown.com.au"
    },
    {
      "url": "https://bowdenscollegetown.com/",
      "email": "bowdens@sphospitality.com"
    },
    {
      "url": "https://bowdenscollegetown.com/",
      "email": "bowdens@sphospitality.com"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "email": "info@scibpaints.com"
    },
    {
      "url": "https://leadiq.com/c/bowden-manufacturing/5a1d9d352300005a008d0ff2",
      "email": "john@bowdenmfg.com"
    },
    {
      "url": "https://leadiq.com/c/bowden-manufacturing/5a1d9d352300005a008d0ff2",
      "email": "name@company.com"
    },
    {
      "url": "https://leadiq.com/c/bowden-manufacturing/5a1d9d352300005a008d0ff2",
      "email": "sales@leadiq.com"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "https://bowdenbros.com/contact-us",
      "email": "enquiries@springltd.co"
    },
    {
      "url": "https://bowdenbros.com/contact-us",
      "email": "gepro@siol.com"
    },
    {
      "url": "https://bowdenbros.com/contact-us",
      "email": "help@springltd.co"
    },
    {
      "url": "https://bowdenbros.com/contact-us",
      "email": "info@prudentqatar.com"
    },
    {
      "url": "https://bowdenbros.com/contact-us",
      "email": "mark@techmark.co.nz"
    },
    {
      "url": "https://bowdenbros.com/contact-us",
      "email": "office@streamer-electric.com"
    },
    {
      "url": "https://bowdenbros.com/contact-us",
      "email": "orders@springltd.co"
    },
    {
      "url": "https://bowdenbros.com/contact-us",
      "email": "rajeesh@khaybertrading.com"
    },
    {
      "url": "https://bowdenbros.com/contact-us",
      "email": "ranadhir@haris.com"
    },
    {
      "url": "https://bowdenbros.com/contact-us",
      "email": "returns@springltd.co"
    },
    {
      "url": "https://bowdenbros.com/contact-us",
      "email": "sales@pentaesp.com.au"
    },
    {
      "url": "https://bowdenbros.com/contact-us",
      "email": "sales@suparule.co.za"
    },
    {
      "url": "https://www.bowdenincservices.com/pages/contact-us",
      "email": "help@bowdenenterprise.com"
    },
    {
      "url": "https://www.hanoverco.com/leadership/",
      "email": "info@www.hanoverco.com"
    }
  ],
  "mails": [
    "bowdens@sphospitality.com",
    "enquiries@springltd.co",
    "enquiry@bow-school.org.uk",
    "gepro@siol.com",
    "help@bowdenenterprise.com",
    "help@springltd.co",
    "info@bowdenmedicine.com",
    "info@bowdensown.com.au",
    "info@prudentqatar.com",
    "info@reception-plus.de",
    "info@scibpaints.com",
    "info@www.hanoverco.com",
    "john@bowdenmfg.com",
    "mark@techmark.co.nz",
    "name@company.com",
    "office@streamer-electric.com",
    "orders@springltd.co",
    "rajeesh@khaybertrading.com",
    "ranadhir@haris.com",
    "returns@springltd.co",
    "sales@leadiq.com",
    "sales@pentaesp.com.au",
    "sales@suparule.co.za"
  ],
  "nombre_sitio": "bowdenscollegetown.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://bowdenmedicine.com/contact-us/",
      "text": "Contact Us - Bowden Medicine Facebook-f Instagram info@bowdenmedicine.com Cheltenham (215)548-3390 Cottman (215)728-4151 Center City (215)977-7721 Cheltenham (215)548-3390 Cottman (215)728-4151 Center City (215)977-7721 Home About Us Services Pain Management Physical therapy Chiropractic Services Massage Therapy Acupuncture Occupational therapy Injection therapy Dr. Bowden and our dedicated team of healthcare professionals are committed to providing you with exceptional care. Dr. Bowden, a seasoned and compassionate practitioner, leads our team with a wealth of experience in holistic healthcare, specializing in physical therapy, pain management, chiropractic services, and more. Our collective expertise ensures that you receive the highest standard of personalized care, tailored to your unique needs. Attorney’s Contact Us Home About Us Services Pain Management Physical therapy Chiropractic Services Massage Therapy Acupuncture Occupational therapy Injection therapy Dr. Bowden and our dedicated team of healthcare professionals are committed to providing you with exceptional care. Dr. Bowden, a seasoned and compassionate practitioner, leads our team with a wealth of experience in holistic healthcare, specializing in physical therapy, pain management, chiropractic services, and more. Our collective expertise ensures that you receive the highest standard of personalized care, tailored to your unique needs. Attorney’s Contact Us Home About Us Services Pain Management Physical therapy Chiropractic Services Massage Therapy Acupuncture Occupational therapy Injection therapy Dr. Bowden and our dedicated team of healthcare professionals are committed to providing you with exceptional care. Dr. Bowden, a seasoned and compassionate practitioner, leads our team with a wealth of experience in holistic healthcare, specializing in physical therapy, pain management, chiropractic services, and more. Our collective expertise ensures that you receive the highest standard of personalized care, tailored to your unique needs. Attorney’s Contact Us Home About Us Services Pain Management Physical therapy Chiropractic Services Massage Therapy Acupuncture Occupational therapy Injection therapy Dr. Bowden and our dedicated team of healthcare professionals are committed to providing you with exceptional care. Dr. Bowden, a seasoned and compassionate practitioner, leads our team with a wealth of experience in holistic healthcare, specializing in physical therapy, pain management, chiropractic services, and more. Our collective expertise ensures that you receive the highest standard of personalized care, tailored to your unique needs. Attorney’s Contact Us Contact Us First Name Last Name Email Subject Medical Pain Management Physical Therapy Occupational Therapy Message Send Messege Contact Us Get in touch We value your questions and feedback. Please don’t hesitate to reach out to us with any inquiries or concerns. Our Philadelphia Locations Center City (215) 977-7721 (215) 977-7325 205 North Broad Street, Suite 500 Philadelphia, PA 19107 Cheltenham (215) 548-3390 (215) 549-8998 1738 West Cheltenham Avenue Philadelphia, PA 19126 Cottman Avenue (215) 728-4151 (215) 728-4153 1220 Cottman Avenue Philadelphia, PA 19111 Quick Links Home About Us Services Attorney’s Contact Us Home About Us Services Attorney’s Contact Us Contact Info 205 North Broad Street Suite 500 Philadelphia, PA 19107 (215) 977-7721 (215) 977-7325 1738 West Cheltenham Avenue Philadelphia, PA 19126 (215) 548-3390 (215) 549-8998 1220 Cottman Avenue Philadelphia, PA 19111 (215) 728-4151 (215) 728-4153 Make an Appointment Unlock a pain-free tomorrow – schedule your appointment with Dr. Bowden Medicine today and take the first step toward a happier you. CHELTENHAM CENTER CITY COTTMAN Stay Connected Facebook Instagram Copyright © 2023. All rights reserved. Thank You for Reaching Out to Bowden Medicine! We’ll Be in Touch Soon."
    },
    {
      "url": "https://www.bow-school.org.uk/Staff/Staff-list/",
      "text": "Bow School - Our Staff Skip to main content Staff Login Our Instagram About Us Welcome Our Vision Our Values Unicef Rights Respecting School Priorities 2024/2028 Ofsted Results KS4 Results 2025 KS4 Success Stories KS5 Results 2025 KS5 Success Stories Governing Board Governance Meet Our Governors Our Staff Joining Us Why Choose Bow? Our Prospectus Admissions Transition Open Events 2026 Meet our Students What Our Parents Say Careers at Bow Why Choose a Career at Bow? Staff Testimonials Current Vacancies The Bow Experience Curriculum Big Ideas Bow Super Curriculum GCSE Options 2025 Reading and Reading Lists Beyond the Classroom Personal Development Student Wellbeing Careers Education Partnerships Primary Partnerships STEM Education Bow Gives Back Our Ambassadors Sixth Form Parents and Community Parent Ambassadors Becoming a Parent Ambassador Calendar of Events Parents Ambassador Forum Workshops and Courses Coffee Mornings Events Trips Parent Partnership Attendance and Punctuality Arbor Parent Portal School Lunches Parent View Letters to Parents Calendar Alumni Information Admissions Policies Key Information Pupil Premium Strategy & Catch Up Funding Music Development Plan Safeguarding Safeguarding Team Safeguarding Resources Special Educational Needs Times of the Day and Opening Hours Equalities Uniform EAL- English as an Additional Language News Latest News Magazines Sixth Form Newsletter Calendar Term Dates Bow Bulletin Contact Us Contact Details Lettings Bow School Our Staff About Us Welcome Our Vision Our Values Unicef Rights Respecting School Priorities 2024/2028 Ofsted Results KS4 Results 2025 KS4 Success Stories KS5 Results 2025 KS5 Success Stories Governing Board Governance Meet Our Governors Our Staff Our Staff STAFF LIST 2025/26 Contact BOW School 44 Twelvetrees Crescent London E3 3QW 020 7536 5525 Monday - Friday: 7:30 AM to 4:30 PM enquiry@bow-school.org.uk © 2020 · Legal Information Website Design by Grebot Donnelly\r\n\t\t\t\t\tAssociates & Greenhouse\r\n\t\t\t\t\tSchool Websites Search site"
    },
    {
      "url": "https://www.bowdensown.com.au/contact-us",
      "text": "Contact Us HOME NEW GEAR CAR CARE Exterior Interior 4WD Products Microfibre Detailing Tools Car Cleaning Kits Value Packs Merchandise GUIDES Exterior Care Interior Care STOCKISTS LATEST NEWS EVENTS Detailing Days 1800 351 308 0 HOME NEW GEAR CAR CARE Back View All CAR CARE Exterior Interior 4WD Products Microfibre Detailing Tools Car Cleaning Kits Value Packs Merchandise GUIDES Back View All GUIDES Exterior Care Interior Care STOCKISTS LATEST NEWS EVENTS Back View All EVENTS Detailing Days Login/ Register Wishlist Home Contact Us Categories Exterior Products Interior Products 4WD Products Microfibre Cloths Value Packs Car Cleaning Kits Detailing Tools New Products Contact Us Email Enquiry Form Complete this form to email us your enquiry. First Name Required Surname Contact Phone Number Email Address Required Preferred Method of Contact Email Phone Message BE THE FIRST TO KNOW! Insider tips & news right in your inbox find a stockist Connect With Us MENU Our Story The Team News Products Events Australian Made Tested on Animals Available From And many other independent retailers. Contact Free Call: 1800 351 308 info@bowdensown.com.au P.O Box 962 Buderim Qld, Australia 4556 Copyright © 2025 Bowden's Own All Rights Reserved Privacy Statement Terms of use"
    },
    {
      "url": "https://bowdenscollegetown.com/",
      "text": "Bowden's at College Town Home About Calendar MENU Reservations Contact Welcome Home About Calendar MENU Reservations Contact Welcome BOWDEN’S AT COLLEGETOWN A sports-themed restaurant in CollegeTown with chef crafted sports bar fare, cocktails, an expansive patio – and, dadgummit, honoring the Florida State coaching legend Bobby Bowden. WEEKLY HAPENNINGS CALENDAR OF EVENTS SEATING ON HOME GAME WEEKENDS WILL BE FIRST COME, FIRST SERVED. COME ON IN! LOCATED IN COLLEGE TOWN 619 s woodward ave c103 TALLAHASSEE, FLORIDA 32304 (850)558-5592 bowdens@SPHOSPITALITY.COM MAKE A RESERVATION ONLINE HOURS monday - thursday 11:30am till 12am Friday - saturday 11:30am till 2am sunday 11:30am till 10pm BOWDEN’S CAN BE RENTED ANY DAY OF THE WEEK FOR A PRIVATE EVENT MAKE A RESERVATION EVENTS & LARGE PARTIES HOST YOUR NEXT EVENT WITH US - CLICK HERE TO GET STARTED! SUBSCRIBE Sign up with your email address to receive news and updates. Email Address Sign Up We respect your privacy. Thank you! Back To Top 619 S WOODWARD AVE C103 TALLAHASSEE, FL 32304 LOCATED IN COLLEGE TOWN RESERVATIONS |    J OIN OUR TEAM"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "text": "Contact Us: Get In Touch With Asian Paints for your Painting Needs Contact Us: We’d Love To Hear From You 16815 Popular searches Interior Paints Exterior Paints Shade cards SEARCH RESULTS {{searchItem.map.shadeCode}} {{searchItem.map.shadeFamilyName}}: {{searchItem.map.shadeName}} {{searchItem.map.title}} RELATED SEARCH NO MATCHES FOUND! Did you mean? {{spellCheck}} Log-In Hello! Hello! Signout en ar {{minicart.cartcount > 0 ? minicart.cartcount : 0}} ↻ Processing... You have {{minicart.cartcount}} items {{item[\"product\"][\"name\"]}} - + ₹ {{item[\"totalPrice\"][\"value\"]}} Total ₹ {{minicart.totalprice}} Checkout ↻ Menu PAINTS & COLOUR PAINTS & COLOUR Services Services WATERPROOFING WATERPROOFING INSPIRATION INSPIRATION Login/Register PAINTS & COLOUR All PAINTS & COLOUR EXPLORE COLOURS Colour Catalogue Home Colour Guide PAINT PRODUCTS Interior Paints Exterior Paints Waterproofing Wood Paints Metal Paints Undercoats RESOURCES Paint Budget Calculator Ideas Gallery Colour visualizer SERVICES Paint Store Near Me Book Painting Services Services All Services Beautiful Homes Painting Service Scib Stars WATERPROOFING All WATERPROOFING Bathrooms Terrace and Tanks Roof & Basement Interiors Tiling All Products INSPIRATION All INSPIRATION Get Inspired Paint calculator Gallery Colour Next Guides DecorPro Resources Colour Visualizer Ideas Gallery Please enter your mobile number To receive the dealer details on SMS Mobile * SUBMIT Get in Touch We’d love to hear from you Head Office Scib Chemical S.A.E 6th of October Cirt, 4th Industrial (1/3/B)B Tel:            (+202)38281090-99 Fax: (+202)38331271 Scib Paints Helpline* For enquiries, feedback and complaints please call on 16815 or write to us at info@scibpaints.com Mobile number +91 00:59 ↻ ↻ Need help with your painting needs? Fill the form below to book a free site evaluation by a Scib Paints Beautiful Homes Painting Service expert. Name Mobile Number +20 Governorate * Email By proceeding, you are authorizing Scib Paints and its suggested contractors to get in touch with you through calls, sms, or e-mail. Book an appointment ↻ Thank you! We value your interest in Scib Paints Beautiful Homes Service. We will get in touch with you shortly to schedule a visit by an expert. Try again! Oops! Something went wrong. We couldn't process your request. Please try again? Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Our Divisions More about Asian Paints Congratulations You have subscribed. Contact Us 16815 EMAIL ABOUT Research & Technology Careers Contact Us Certificates RESOURCES FAQs POLICIES Quality Policy Customer Policy Cookie Policy Environment Policy EHS Policy TOOLS Colour Catalogue Color with AP APP/Website​ COUNTRY EGYPT Country EGYPT India GLOBAL BANGLADESH MIDDLE EAST FIJI NEPAL SRI LANKA ETHIOPIA CONNECT DOWNLOAD OUR PAINTING APP CONNECT WITH US ©Scib Paints - All rights reserved Congratulations You have subscribed. Welcome User Login OR Continue as guest You have been successfully logged out Login An OTP has been sent to your registered mobile number and email id. 00:00 Resend By clicking submit, I agree to terms and conditions SUBMIT Register Please enter the 5 digit OTP sent via SMS to verify your mobile number! 00:00 Resend I agree to terms and conditions SUBMIT Please enter your mobile number To receive the dealer details on SMS SUBMIT Provide a delivary address Fullname* Email* Mobile* +91 Flat/House No/Floor* Colony/Street/Locality* Landmark City* Pincode* SUBMIT User already exist redirecting you for the login page Paint Budget Calculator Get instant estimates Calculate now Waterproofing Calculator Get an instant estimate Calculate now"
    },
    {
      "url": "https://leadiq.com/c/bowden-manufacturing/5a1d9d352300005a008d0ff2",
      "text": "Bowden Manufacturing Company Overview, Contact Details & Competitors | LeadIQ Learn more at LeadIQ.com Start free Insights Similar companies Tech Stack Media & News Email Format FAQ Insights Advanced Manufacturing Capabilities Bowden Manufacturing has extensive high-precision machining capabilities spanning CNC machining, grinding, turning, milling, and drilling/tapping, making it well-suited for clients in aerospace, medical, automotive, and industrial sectors seeking reliable production of complex, high-strength components. Potential for Custom Equipment Investment The company's willingness to invest in dedicated machinery to extend its capabilities suggests openness to tailored manufacturing solutions, presenting opportunities for customized projects and strategic partnerships with clients requiring specialized equipment. Targeted Industry Focus With experience serving aerospace, medical, and automotive markets, Bowden Manufacturing can leverage its expertise to target these industries further, particularly companies looking for high-temperature and high-strength material processing. Growing Market Presence Operating in a region with a focus on manufacturing near Northeastern Ohio, Bowden Manufacturing can explore collaborations with local OEMs and contractors to expand its customer base and increase regional market share. Digital Engagement Opportunities Utilizing multiple digital platforms like LinkedIn, Twitter, and SEO tools indicates an active online presence; enhancing digital outreach and lead generation efforts could open new sales channels and attract clients looking for innovative manufacturing partners. Similar companies to Bowden Manufacturing Modern Industries $10M $50M PTI Industries $10M $50M Cadence Design Systems $1B Waukesha Metal Products $10M $50M Intrex Aerospace Explore similar companies Bowden Manufacturing Tech Stack Bowden Manufacturing uses 8 technology products and services including RSS, Shopify, Twitter Emoji (Twemoji), and more. Explore Bowden Manufacturing 's tech stack below. RSS Content Management System Shopify E-commerce Twitter Emoji (Twemoji) Font Scripts jQuery Migrate Javascript Libraries Google Maps Maps LinkedIn Online Community Software Yoast SEO Search Engines Piwik System Analytics & Monitoring Media & News Bowden Manufacturing 's Email Address Formats Bowden Manufacturing uses at least 1 format(s): Bowden Manufacturing Email Formats Example Percentage First@bowdenmfg.com John@bowdenmfg.com 55% FLast@bowdenmfg.com JDoe@bowdenmfg.com 42% LastFir@bowdenmfg.com DoeJoh@bowdenmfg.com 1% F.Last@bowdenmfg.com J.Doe@bowdenmfg.com 2% See more formats Frequently Asked Questions Where is Bowden Manufacturing 's headquarters located? Bowden Manufacturing 's main headquarters is located at 4590 Beidler Rd., Willoughby, Ohio 44094, US . The company has employees across 2 continents, including North America Europe . What is Bowden Manufacturing 's phone number? You can contact Bowden Manufacturing 's main corporate office by phone at +1-440-946-**** . For more prospecting data, LeadIQ has access to up-to-date and accurate contact information within our platform. Find, capture, and sync contact data to your CRM and sales tools in one click. What is Bowden Manufacturing 's official website and social media links? Bowden Manufacturing 's official website is bowdenmfg.com and has social profiles on LinkedIn . What is Bowden Manufacturing 's SIC code NAICS code ? Bowden Manufacturing 's SIC code is 3599 - Industrial and Commercial Machinery and Equipment, Not Elsewhere Classified NAICS code is 333 - Machinery Manufacturing . How many employees does Bowden Manufacturing have currently? As of August 2025 , Bowden Manufacturing has approximately 54 employees across 2 continents, including North America Europe . Key team members include Chief Operating Officer: W. H. President: A. M. Director-Sales: C. L. . Explore Bowden Manufacturing 's employee directory with LeadIQ. What industry does Bowden Manufacturing belong to? Bowden Manufacturing operates in the Machinery Manufacturing industry. What technology does Bowden Manufacturing use? Bowden Manufacturing 's tech stack includes RSS Shopify Twitter Emoji (Twemoji) jQuery Migrate Google Maps LinkedIn Yoast SEO Piwik . What is Bowden Manufacturing 's email format? Bowden Manufacturing 's email format typically follows the pattern of . Find more Bowden Manufacturing email formats with LeadIQ. Bowden Manufacturing Machinery Manufacturing United States 51-200 Employees Specializing in high-strength, high-temperature materials, Bowden effectively delivers the High-Precision Machining Services you expect. With over 30,000 sq. ft. of equipment capability ranging from CNC machining, grinding, turning, milling, and drilling/tapping; we routinely handle prototypes & large-scale production for medical, automotive, aerospace and industrial. We have the ability and willingness to invest in dedicated machinery to extend our capabilities when necessary. Sign up for free to view info Email Format Employee directory Company Overview Headquarters 4590 Beidler Rd., Willoughby, Ohio 44094, US Phone number +1-440-946-**** Website bowdenmfg.com SIC Code 3599 - Industrial and Commercial Machinery and Equipment, Not Elsewhere Classified NAICS Code 333 - Machinery Manufacturing Employees 51-200 Media & News Read more news Funding & Financials Funding & Financials Company Leadership W. H. Chief Operating Officer Mobile Phone Email A. M. President Mobile Phone Email C. L. Director-Sales Mobile Phone Email C. H. General Manager Mobile Phone Email D. R. Operations Manager Mobile Phone Email Employee Directory A. M. Quality Inspector Mobile Phone Email C. P. Entry-Level Mechanical Engineer Mobile Phone Email C. B. L. Product Development Engineer Mobile Phone Email E. S. Mechanical Engineer Mobile Phone Email J. B. Sales Representative Mobile Phone Email Go to Employee Directory Ready to create more pipeline? Get a demo and discover why thousands of SDR and Sales teams trust LeadIQ to help them build pipeline confidently. Sign me up Ready to create more pipeline? Get a demo and discover why thousands of SDR and Sales teams trust LeadIQ to help them build pipeline confidently. Book a demo Platform Identify prospect data Track sales triggers Compose personalized messages Enrich Salesforce data Success Stories Resources Pricing Blog Company Search Support Careers Data Community Our Data Privacy Center Legal Privacy Policy Cookie Policy Terms of Service Do Not Sell or Share My Personal Information Compare LeadIQ vs. Zoominfo LeadIQ vs. Apollo LeadIQ vs. Lusha LeadIQ vs. Cognism LeadIQ vs. Seamless.ai LeadIQ vs. Usergems LeadIQ vs. Champify Contact 1-888-653-2347 support@leadiq.com sales@leadiq.com Â© LeadIQ, Inc. All rights reserved."
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. First name Surname E-Mail name Surname * E-Mail * Nachricht * Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "https://bowdenbros.com/contact-us",
      "text": "Contact Us | Bowden Bros Ltd Products Services About us Contact Us Contact Us Please get in touch with us via email, phone or using the form below Please contact one of our agents if you are outside the UK for further information Follow us on LinkedIn to stay up to date here Telephone +44 (0) 1306 74 33 55 Email enquiries@springltd.co orders@springltd.co help@springltd.co returns@springltd.co Address Units 9 & 14 April Court, Sybron Way, Crowborough, East Sussex, TN6 3DZ Australia Agent PENTA Australia HYLEC - TMAC sales@pentaesp.com.au Tel: +61 7 3826 6000 New Zealand Agent Techmark International Ltd mark@techmark.co.nz Tel: +644 5627638 South Africa Agent Suparule Pty Ltd sales@suparule.co.za Tel: +27 11 452 9800 Slovenia Agent GEPRO Inženiring Samo Kalač s.p. gepro@siol.com Tel: +386 2 300 21 90 Dubai & Abu Dhabi Agent Haris Al Afaq ranadhir@haris.com Tel: +9714 2719624 Bahrain Agent Khyber Trading rajeesh@khaybertrading.com Tel: +973 17720747 Qatar Agent PRUDENT Engg & Services Co. info@prudentqatar.com Tel: +974 44431867 Worldwide Apart from Countries with existing agencies STREAMER Electric Ag. office@streamer-electric.com Tel: +41 81250 0525 Malaysia Agent MIRR Ventures SDN BHD mirrventures@gmail.com Tel: +60 39108 0880 Units 9 & 14 April Court, Sybron Way, Crowborough, East Sussex, TN6 3DZ +44 (0) 1306 74 33 55 enquiries@springltd.co orders@springltd.co help@springltd.co returns@springltd.co Copyright © 2025 Trading name of Spring (Europe) Ltd. Contact Us Terms of use Privacy Policy LinkedIn"
    },
    {
      "url": "https://www.bowdenincservices.com/pages/contact-us",
      "text": "Contact Us – Bowden Enterprise Services. LLC Shopping cart 0 item Account Login Register My Account Wishlist Currency : USD USD EUR AUD GBP JPY Language: English English French Toggle navigation Home Products About Us Contact Us Product Blog Promo Commercials Product Explanation Videos Search Contact Us Home Contact Us Contact us Find Us Here send a message Name Email Phone Number Message Have a question? Fill out the contact form. We’d love to hear from you Raleigh, NC bowdenenterpriseservices@gmail.c www.bowdenincservices.com Keep in touch Raleigh, NC help@bowdenenterprise.com Follow Us Facebook Twitter Instagram Pinterest Youtube Google Plus Recent Tweet Tweets by @KingsNQueensAcc Newsletter Make sure that you always the first receive our latest news and promotion by signup your email Information Services Account Support © 2025 Bowden Enterprise Services. LLC Quantity Subtotal: Add to Cart Scroll To Top Panel Tool Float style Float header Float topbar Layout mode Default Boxed Large Header mode Header Default Skins Close Home Products About Us Contact Us Product Blog Promo Commercials Product Explanation Videos Thanks for contacting us. We'll get back to you as soon as possible. Name Email Address Job Your Story"
    },
    {
      "url": "https://www.hanoverco.com/leadership/",
      "text": "Leadership - Hanover Company Skip to main content About Us Who We Are Leadership Hanover History Capabilities Multifamily Development Industrial Development Construction Property Management Gallery Portfolio Live at Hanover Careers Working at Hanover Join The Team Contact Privacy Policy | Digital Accessibility. About Us Who We Are Leadership Hanover History Capabilities Multifamily Development Industrial Development Construction Property Management Gallery Portfolio Live at Hanover Careers Working at Hanover Join The Team Contact Results Found (0) See All Results Our Leadership Guiding Excellence, Inspiring Innovation At Hanover Company, our leadership team is committed to upholding the highest standards of integrity, vision, and expertise. With decades of experience in real estate development, our leaders drive innovation, foster a culture of excellence, and create lasting value for our residents, employees, and investors. Senior Leadership Multifamily Industrial Property Management Construction Capital Markets Murry Bowden Founder & Executive Chairman View Profile Murry Bowden Founder & Executive Chairman Murry Bowden, founder of Hanover Company, has been involved in all aspects of apartment acquisitions, development, construction, management and finance since the company’s formation. He is responsible for strategic planning, risk management, operational oversight and investment decisions. Murry graduated cum laude from Dartmouth College with a Bachelor’s Degree and holds a Juris Doctorate from the University of Texas Law School. He devotes time to various charities and educational institutions. Brandt Bowden Chief Executive Officer View Profile Brandt Bowden Chief Executive Officer As Chief Executive Officer, Brandt Bowden oversees Capital, Development and Construction efforts for Hanover Company. He is integral to the planning and execution of Hanover’s corporate strategy. Brandt joined Hanover in 2002 as a Development Partner covering the East Coast. In 2009, Brandt headed Hanover’s Capital Markets division and soon took on the role of Chief Investment Officer. As CIO, he oversaw the investment and financing of approximately $5 billion in apartment development. Brandt is an active member of the Urban Land Institute and serves on the Multifamily Gold Council. He earned his Bachelor of Arts degree from Dartmouth College, and currently serves as the Houston-area District Enrollment Director. In addition, Brandt serves on the Board of Trustees at The Kinkaid School. Jeb Bowden Chief Operating Officer View Profile Jeb Bowden Chief Operating Officer As Chief Operating Officer, Jeb Bowden is responsible for the strategic oversight of Hanover Company’s Property Management, Asset Management, Global Support Services, Human Resources, Information Technology, and Accounting departments. Since joining Hanover, he has worked on over $17 billion in multifamily properties—spanning from openings to sales—across 17 U.S. markets. He has also opened development offices in Poland and Turkey, and established an operating service company in Ahmedabad, India, now employing over 100 team members. Jeb serves on Hanover’s Investment Committee for both its Multifamily and Industrial platforms. He graduated cum laude with a Bachelor of Arts from Vanderbilt University and serves on the board of the Children’s Museum of Houston. John Nash President View Profile John Nash President As President of Hanover Company, John Nash is primarily involved in managing Hanover’s risks, both legal and financial. Since joining the company in 1996, John has been involved in all aspects of the development and construction of over 75,000 apartment units. Prior to joining Hanover, John was a Partner with the firm Mayer, Brown and Platt with experience in all aspects of real estate acquisitions, sales, workouts, lending, leasing and development across all asset types. He is a graduate of the University of Texas and earned his Juris Doctorate from Southern Methodist University School of Law, where he was an Editor for the Southwestern Law Journal. John has served on the executive boards of several community organizations. John Garibaldi President – Multifamily View Profile John Garibaldi President – Multifamily John Garibaldi has been with Hanover for over 25 years, starting as a Development Partner in Houston in 1999.  During his tenure, he has been instrumental in the expansion of Hanover’s development footprint across the country and is involved in all aspects of Hanover’s apartment development, construction, management, and finance.  Previously, John was a Development Partner for both The Finger Companies and Gross Investments in Houston, and Trammell Crow Residential in the San Francisco Bay area.  John received an MBA from the Stanford Graduate School of Business, where he was President of his graduating class. He also holds an Engineering Degree from the University of Notre Dame.  John has been involved in many local and national charitable organizations, including being on the Board of the Memorial Park Conservancy during its recent expansion and has participated in multiple Habitat for Humanity’s builds, both internationally and domestically. David Hudson President – Industrial View Profile David Hudson President – Industrial As President of the Industrial Division, David Hudson is responsible for all Hanover Company’s acquisition and development activities in the industrial sector. He has over 30 years of commercial real estate and industrial development experience with a proven track record of building industrial development platforms. Previously, David was the President of Griffin Partners Development and the Houston Business Unit Head for Duke Realty, where he led the management of both firms’ industrial development practices. David holds a Bachelor of Business Administration in Accounting from Texas Tech University, is a CPA and licensed as a Texas Real Estate Broker. Jim Fenwick President – Property Management View Profile Jim Fenwick President – Property Management As President of Property Management, Jim Fenwick is responsible for managing all property operations within the Hanover portfolio. Previously, Jim served as President for Miller-Valentine Group, a privately held, vertically integrated real estate firm, where he led a team managing more than 13,000 units in 15 states. He also served as the Northeast Executive Vice President of Equity Residential Properties, a company known as an urban and high-rise expert with oversight of more than $6 billion dollars in real estate. Jim managed their Northeast portfolio of 154 properties, which totaled more than 50,000 units in 14 states. Jim joined Hanover in 2014 and has been instrumental in establishing a service orientation, and delivering a world-class, customer-centric experience. Thomas Knutson President – Construction View Profile Thomas Knutson President – Construction Overseeing all areas of Hanover Company’s preconstruction, construction and design management activities, Thomas Knutson’s construction experience ranges from large-scale institutional work, office building, industrial warehouse, infrastructure work as well as all types of multifamily and mixed-use projects. Prior to becoming President of Construction in December 2019, Thomas served as Hanover’s Vice President of Estimating and Preconstruction, overseeing all budget efforts by the Construction division from 2009 to 2019. Before joining Hanover in 2007, Thomas worked as a Project Manager for Manhattan Construction and a Superintendent for Camden Property Trust. Thomas graduated from Texas A&M University with a Bachelor of Science degree in Construction Science. Judi Hopper Chief Financial Officer View Profile Judi Hopper Chief Financial Officer Judi Hopper joined Hanover Company in 1998 and now manages the Accounting, Tax and Financial Reporting functions. Prior to joining the company, she was an Audit Manager with Arthur Andersen, L.L.P. in Houston. Her client base consisted of a diverse group of public and private companies in the real estate, waste disposal, distribution and manufacturing industries. While at Arthur Anderson, Judi served on Hanover’s audit engagement for four years before joining the company. A Certified Public Accountant, she graduated from the University of Texas at Austin with a Bachelor of Business Administration degree and a Master’s Degree in Accounting. Roxanne Cox Chief Human Resources Officer View Profile Roxanne Cox Chief Human Resources Officer As Chief Human Resources Officer, Roxanne Cox leads Hanover Company’s HR organization. Roxanne oversees initiatives targeted at attracting, developing and retaining Hanover employees. Prior to joining Hanover, Roxanne was the Vice President of Human Capital for several global real estate operating companies, including Verde Realty and Security Capital Group. In these positions, she provided strategic oversight of the HR function, led the development of organizational leaders, and implemented innovative compensation and benefits solutions. Roxanne earned her BA, MBA, and PhD in Business with a specialization in HRM from New Mexico State University. She is certified as a Senior Professional, Human Resources (SPHR) and a SHRM Senior Certified Professional (SHRM-SCP) and sits on the University of Houston-Downtown HRM Advisory Council. Theresa Blades Chief Investment Officer View Profile Theresa Blades Chief Investment Officer Theresa Blades joined Hanover Company in 2012. As Chief Investment Officer, Theresa is primarily responsible for overseeing Hanover Company’s sourcing of equity and debt nationally and project level underwriting. Theresa holds a Bachelor of Arts in Economics from Stanford University. Tami Feigl Edwards General Counsel View Profile Tami Feigl Edwards General Counsel Tami Feigl Edwards joined Hanover Company in 2015.  As General Counsel, Tami manages and supervises the legal team, which is responsible for the company’s transactional real estate and corporate legal matters.  Before joining Hanover, Tami was a partner at Norton Rose Fulbright in Houston, where she counseled a variety of clients in sophisticated real estate transactions.  She holds a Juris Doctorate from The University of Texas School of Law. Mark Friedman Vice President – Risk Management View Profile Mark Friedman Vice President – Risk Management As Vice President of Risk Management, Mark Friedman is responsible for leading and mentoring Hanover’s risk management team, including creating strategies, policies, and procedures for identifying, assessing, and mitigating risk associated with the ownership, development, investment, and management of multifamily and industrial assets. Before joining Hanover in 2019, Mark served as Senior Vice President of Risk Management at HealthPeak Properties, LOWE Enterprises, and The Irvine Company. While at HealthPeak and The Irvine Company, Mark maintained the position of President of Captive Insurance Companies. During his tenure with LOWE Enterprises, Mark served as Chair of the American Hotel and Lodging Association Risk Management Committee. Currently, he serves on the Risk Management Committee of the National Multifamily Housing Committee (NHMC). Mark has a Bachelor of Science in Business Administration from California State University, Long Beach, and a Master of Business Administration from the University of California, Los Angeles, Anderson School of Management. Prior to his risk management career, Mark played on the ATP professional tennis circuit, competing in all major tournaments, including Wimbledon, the U.S. Open, and the Australian and French Open Championships. Adam Harbin Regional Development Partner – Atlanta & Florida View Profile Adam Harbin Regional Development Partner – Atlanta & Florida Adam Harbin is responsible for overseeing Hanover’s development activity throughout the Florida region and the Atlanta region.  Since joining Hanover in 2005, Adam has overseen the development of over 11,500 units and 150,000 square feet of ground-floor retail, representing over $3.5 billion in total capitalization, on projects of all product types, including high-rise, mid-rise, suburban, and mixed-use, in various markets across the Northeast, Mid-Atlantic, and Southeast.  Prior to joining Hanover, Adam practiced law at the New York office of Latham & Watkins, where he worked primarily in bank and project finance.  Adam earned a Classics degree from the University of Alabama and a law degree from the University of Texas. Bo Buchanan Regional Development Partner – Carolinas & Nashville View Profile Bo Buchanan Regional Development Partner – Carolinas & Nashville Bo Buchanan has over 30 years of experience in the real estate industry. He started his career with Hanover Company in 1993 as the Corporate Controller, and has since held several positions, including Development Partner and Vice President of Property Management. Currently, Bo works on the acquisition and development of properties in the Carolinas and Nashville. His track record includes overseeing the development of over 6,000 units in North Carolina, Florida, and Virginia. Bo graduated from Texas A&M University and holds a Bachelor of Science Degree in Business. David Hall Regional Development Partner – Greater Boston & New York View Profile David Hall Regional Development Partner – Greater Boston & New York David Hall leads Hanover’s multi-family development efforts throughout greater Boston, New England and New York. His tenure at Hanover includes a dynamic portfolio of 39 urban and suburban projects, totaling over 11,000 apartment homes and over $4.4 billion in total capitalization. Prior to joining Hanover in 2007, David spent 16 years directing complex developments across multiple property types nationwide, including the redevelopment of a US Navy base for LNR Property Corporation, a national portfolio of office buildings for KBS Realty Advisors and various mixed-use projects for Trammell Crow Company. David earned his MBA from the Kellogg School at Northwestern University and a Bachelor of Arts degree from Dartmouth College. He is active in support of several charitable causes and educational institutions. Ryan Hamilton Regional Development Partner – Texas View Profile Ryan Hamilton Regional Development Partner – Texas Ryan Hamilton has over 25 years of experience in the real estate industry and has worked at Hanover Company since 2004. Ryan is responsible for overseeing Hanover Company’s presence and continued growth in Houston, Austin, and Dallas/Fort Worth. Ryan has developed over 5,550 apartment homes across Texas, Southern California, and Colorado, totaling over $2.0 billion in total capitalization. Prior to joining Hanover Company, Ryan worked for Henry S. Miller Commercial, the largest independent real estate brokerage firm in Texas, where he represented clients in Income Property Sales, Project Leasing, Development Consulting, Property Acquisition and Excess Property Disposition. Ryan earned a Bachelor of Science in Economics and Finance from The University of Texas at Dallas. Scott Youdall Regional Development Partner – West Coast View Profile Scott Youdall Regional Development Partner – West Coast Scott Youdall is responsible for overseeing Hanover Company’s development activity throughout California and Seattle, working out of the San Francisco Bay Area. Since joining Hanover in 2014, Scott has overseen the development of over 5,000 units, representing over $2 billion in total capitalization. Before joining Hanover, Scott served as Vice President of Acquisitions for SummerHill Apartment Communities, where he was responsible for growing the firm’s multi-family development portfolio. Scott has extensive experience in California, where he has spent over 20 years procuring and entitling new development sites for both apartment and single-family home communities. He is a graduate of Cornell University and holds an MBA from the Haas School of Business at the University of California, Berkeley. Caroline Erck Development Partner – Houston View Profile Caroline Erck Development Partner – Houston Caroline Erck serves as Development Partner at Hanover Company and is responsible for sourcing and leading multifamily development efforts in Houston, TX. Prior to joining Hanover, Caroline worked for five years in Strategy & Management Consulting before transitioning to the commercial real estate industry. She began her career at Hanover in Asset Management, where she was responsible for numerous asset operations and dispositions before joining the Development Division. As an industry leader, she participated in the inaugural ULI Women’s Amplify Program in 2022 the NAIOP Developing Leaders Program in 2024, and currently serves as the ULI Local Product Council Chair for Multi-Family in Houston. Caroline holds both a bachelor’s degree, graduating summa cum laude, and a Master of Business Administration, from Texas A&M University. Chris Nash Development Partner – Dallas View Profile Chris Nash Development Partner – Dallas Christopher Nash leads Hanover’s development efforts in the Dallas-Fort Worth metroplex. Prior to joining Hanover in 2016, Christopher worked for Trammell Crow Residential, developing multifamily projects in Houston. He holds a Master of Science in Finance and a Bachelor of Business Administration in Real Estate Finance from Southern Methodist University. Christopher serves on the Advisory Board at the Folsom Institute for Real Estate at SMU. He is also an active member of the Greater Houston Partnership’s Real Estate Committee, ULI, and The Real Estate Council (TREC). Jake Denney Development Partner – Mid-Atlantic View Profile Jake Denney Development Partner – Mid-Atlantic Leading Hanover Company’s development efforts in the Mid-Atlantic market, Jake Denney is responsible for the acquisition, entitlement, and execution of multi-family and mixed-use development projects from Pennsylvania through Virginia. Jake joined Hanover Company in 2021 after beginning his career with a four-year stint at Gables Residential, where he contributed to the development of 1,209 apartment units across the Boston and DC markets. Jake holds a Master of Business Administration and a Master of Public Policy from Georgetown University, where he graduated Core Honors. He earned his Bachelor of Arts degree from Tufts University, where he graduated Magna Cum Laude with highest thesis honors. Joe Gambill Development Partner – Southern California View Profile Joe Gambill Development Partner – Southern California Joe Gambill leads Hanover’s development efforts in Southern California. Joe manages the acquisition, financing and development for all projects in the area. Previously, Joe served as Managing Director at Wood Partners for more than a decade, where he was responsible for the company’s assets in Southern California totaling over 3,500 units with a total capitalization of over $1.3B. Joe earned a bachelor’s degree in Construction Science and Management from Clemson University and a master’s degree in Real Estate Development from the Price School of Public Policy at the University of Southern California. He is a member of the Urban Land Institute in Los Angeles. Lauren Goebel Development Partner – Florida View Profile Lauren Goebel Development Partner – Florida As Development Partner, Lauren Goebel is responsible for leading Hanover Company’s multifamily development efforts in Florida. Based out of Palm Beach, Lauren focuses on the acquisition, entitlement and development of ground-up multifamily projects across the state. Since joining Hanover in 2021, Lauren has led the sourcing and vertical development of Hanover Riverwalk, a 36-story, 380-unit high-rise in downtown Fort Lauderdale, and has initiated the acquisition and development of approximately 2,000 additional units across the state. Lauren holds a Bachelor of Architecture from The University of Texas, as well as a Master’s of Real Estate Development from New York University, where she graduated with honors. Previously, Lauren was Head of Real Estate for Global RE Group, a family office and real estate investment company focused on large-scale acquisition and development opportunities. Prior to joining Global RE Group, Lauren was Vice President of Investments for Mack-Cali Realty Corporation, where she executed numerous commercial acquisitions and dispositions exceeding $500M in total asset value. Lauren started her career in real estate as a Development Manager at The Rockefeller Group, where she helped manage ground-up developments across the northeast. Steffi Russell Development Partner – Arizona & Colorado View Profile Steffi Russell Development Partner – Arizona & Colorado Leading Hanover Company’s development efforts in the Denver and Phoenix markets, Steffi Russell has facilitated the acquisition, planning, and development of over $800 million in residential and mixed-use projects, comprising more than 2,000 apartment units. Previously, Steffi worked for Google, Inc., where she was responsible for the land acquisition and infrastructure development of datacenter sites in the Western United States. Steffi holds a Bachelor of Arts in Math and Economics from Rice University, where she graduated Cum Laude with Departmental Honors. Steve Dazzo Development Partner – Greater Boston View Profile Steve Dazzo Development Partner – Greater Boston Steve Dazzo is a Development Partner with Hanover Company, where he leads all acquisition and development efforts across New England. Since joining Hanover in 2015, he has overseen the acquisition, planning, entitlement, and execution of multifamily and mixed-use developments—from complex urban redevelopment to suburban communities throughout the region. Steve holds a Bachelor of Arts in Economics from Dartmouth College, where he captained the football team and played rugby. Zach Anderson Development Partner – Northern California & Seattle View Profile Zach Anderson Development Partner – Northern California & Seattle Zach Anderson leads Hanover’s acquisition and development efforts in the Northern California and Puget Sound regions. Since joining Hanover in 2018, Zach’s primary roles include sourcing, procuring, and entitling projects in his respective markets. Prior to joining Hanover, Zach served as Director of Acquisitions for Anton DevCo, a regional multifamily developer in California. Before Anton, Zach spent four years as a commercial broker with Colliers International and Cushman & Wakefield, where he was involved in transactions totaling approximately $450 million. Zach graduated from Tufts University with a B.A. in Economics and received his M.B.A. from the Haas School of Business at the University of California, Berkeley. Kayvan Zarea Design Development Partner View Profile Kayvan Zarea Design Development Partner Kayvan Zarea serves as Design Development Partner at Hanover, bringing over 20 years of experience in the design and execution of large-scale commercial and residential developments. A licensed architect in seven states, he has led the development, design, and construction of projects totaling more than $2 billion across Hanover’s portfolio. Kayvan plays a pivotal leadership role in advancing projects throughout the East Coast and Southern United States, guiding them from inception through final delivery. He holds a Bachelor of Architecture from the University of Houston’s Gerald D. Hines College of Architecture and an Executive MBA from Texas A&M University’s Mays Business School. Rick Stinson Design Development Partner View Profile Rick Stinson Design Development Partner With a background that includes over 40 years of architectural experience in the design and development of commercial and residential projects, Rick Stinson joined The Hanover Company as a Development Partner in 2004.  Rick currently serves as a Design Development Partner managing project design and execution activities in California, Arizona and Washington. Over the course of his career, he has been directly involved in the development, design, and construction contract administration of high-density residential projects comprising more than 14,000 apartment units. Rick earned a Bachelor of Science in Architecture from The University of Texas at Arlington. Stephen Luna Design Development Partner View Profile Stephen Luna Design Development Partner With a background that includes over 20 years of experience in the design and development of commercial and residential projects, Stephen Luna is responsible for managing Hanover Company’s design and construction oversight activities. Currently, he focuses on projects in Texas, North Carolina, Massachusetts, Maryland, and Washington D.C. He was previously Hanover’s Director of Design and oversaw the architectural design of all urban projects. In this role, Stephen worked to develop standards of quality in design and construction throughout Hanover’s entire portfolio. Stephen earned a Bachelor of Architecture Degree from The University of Texas at Austin. Deanna Chalfant VP – Development View Profile Deanna Chalfant VP – Development Deanna Chalfant serves as Vice President of Development in Hanover’s California and Washington markets. With over 15 years of real estate development experience, she has expertly managed complex urban projects, delivering more than 3,000 units with a portfolio exposure exceeding $1.1 billion. Prior to joining Hanover, Deanna worked at Essex Property Trust as Vice President of Development, overseeing multifamily development projects across the Bay Area, Southern California, and the Pacific Northwest. Deanna’s expertise spans the entire project lifecycle, from site selection and financial modeling to entitlements, construction, and occupancy. Deanna holds a Bachelor of Arts in Sociology from the University of California, Santa Barbara, and completed the Executive Leadership Program at the University of California, Berkeley’s Haas School of Business. Chase LeBlanc Director of Landscape Architecture View Profile Chase LeBlanc Director of Landscape Architecture As Hanover Company’s Director of Landscape Architecture, Chase LeBlanc is responsible for managing the landscape planning, design, documentation, and construction administration functions for the entire portfolio. Chase joined Hanover in 1997 and is a licensed Landscape Architect in multiple states. His career has included landscape design responsibility for over 150 investment-grade properties, totaling more than 45,000 units. He earned a Bachelor of Landscape Architecture Degree from Texas A&M University. Wayne Andrist Director of Interior Architecture View Profile Wayne Andrist Director of Interior Architecture Wayne Andrist serves as the Director of Interior Design at The Hanover Company, where he leads the design and development of amenities, corridors, lobbies, and residential units. He brings over 30 years of experience in corporate and hospitality interiors and has been recognized with six AIA and IIDA Design Awards. Prior to joining Hanover in 2008, Wayne spent five years with GFF in Dallas and seven years with Design Collective in Baltimore, where he first collaborated with Hanover in 2003. He holds a Bachelor of Architecture from the University of Wisconsin–Milwaukee and a Master of Architecture from the University of Houston. Wayne has also pursued international studies at Oxford University in England and the Centre d’Études d’Architecture et d’Urbanisme in Saintes, France. Dan Gordon Regional Development Partner View Profile Dan Gordon Regional Development Partner Dan Gordon is responsible for overseeing Hanover Company’s industrial development efforts in the Northeast with a focus on Maryland, Washington, DC, Virginia, Pennsylvania, New Jersey and the New York City metro area. Previously, Dan was a Development Partner in Hanover Company’s multifamily division responsible for overseeing development efforts in the Mid-Atlantic with a focus on the greater Washington, D.C. and Philadelphia areas. Before that, Dan was an attorney at a mergers and acquisitions litigation boutique in Wilmington, Delaware. Dan is a member of the Board of the New York Center for Child Development and a member of the Board of the New York Center for Infants and Toddlers. He holds a Bachelor of Arts in Economics-Philosophy from Columbia University, as well as an MBA in Real Estate and Finance from The Wharton School at the University of Pennsylvania, where he graduated with honors. He also attended the University of Virginia School of Law, where he obtained his JD, was a member of the Virginia Law Review, and graduated Order of the Coif. Anthony Feenick Development Partner – Southern California View Profile Anthony Feenick Development Partner – Southern California Anthony Feenick leads Hanover’s Industrial Division development efforts in the Southern California market. Prior to joining Hanover in 2022, Anthony worked as a Senior Director of Acquisitions, Development, and Asset Management at Tishman Speyer where he focused on multifamily, office, and life science investments in the Los Angeles and Denver markets. Anthony holds a Bachelor of Arts in Economics and Political Science from Northwestern University and an MBA in Real Estate from Columbia Business School. James Melody Development Partner – Texas View Profile James Melody Development Partner – Texas James Melody leads Hanover Company’s industrial land acquisition and development efforts in Texas, with a focus on opportunities in Houston, Dallas/Fort Worth, San Antonio and Austin. Prior to joining Hanover Company in 2022, James was a Director of Industrial Development at Lovett Industrial, executing on over three million square feet of warehouse space across Texas. Before Lovett, James was at Clarion Partners in New York City, where, as a member of the East Coast acquisitions team, he contributed to the purchase of over $1.0 billion in commercial property investments. James holds a Master of Science in Real Estate Development from Columbia University and a Bachelor of Finance from the University of Texas. Jeff Onstott Development Partner – Atlanta View Profile Jeff Onstott Development Partner – Atlanta Jeff Onstott is responsible for overseeing Hanover Company’s industrial land acquisitions and development efforts in Atlanta. Jeff started his career with Hanover Company in 2012 and previously served as Vice President of Capital Markets, where he oversaw Hanover Company’s sourcing of equity financing and underwriting for East Coast multifamily development. Jeff holds a Bachelor of Arts degree from Dartmouth College. Tim Bolton Senior Vice President – Construction View Profile Tim Bolton Senior Vice President – Construction With over 35 years of experience within the development and construction industry, Tim Bolton oversees predevelopment, design, and construction activities for projects in Los Angeles, Orange County, Northern California, and the Pacific Northwest. Prior to joining Hanover, Tim was the Senior Vice President & Partner with Lowe Enterprises and oversaw all of their resort development activities throughout the United States. Tim graduated from California Polytechnic State University at San Luis Obispo with a Bachelor’s Degree in Construction Management and has also completed the Executive Real Estate Management Program at Harvard Business School. Tom Denney Senior Vice President – Construction View Profile Tom Denney Senior Vice President – Construction Tom Denney manages the construction function of Hanover Company’s Northeast Regional Office in Boston, Massachusetts. With over 20 years of experience at Hanover, Tom is responsible for overseeing design, construction planning and execution for projects throughout the Northeast and Pennsylvania regions. Tom earned a Bachelor’s Degree in Business Management and a Master’s Degree in Civil Engineering from Worcester Polytechnic Institute. Jason Lister Vice President – Construction View Profile Jason Lister Vice President – Construction With over 25 years of experience with Hanover, Jason Lister manages Hanover’s construction initiatives in Atlanta, GA, and the Houston and Dallas areas in Texas. Jason is responsible for overseeing the construction aspect of the design process, predevelopment, construction planning and logistics, and execution of multifamily and mixed-use projects. On the path to becoming Vice President, Jason was a vital contributor to the addition of over 18 properties and 6,000 units to the Hanover portfolio across the country from California to Massachusetts, down to Florida, and throughout Texas and Colorado. Jim MacMichael Vice President – Construction View Profile Jim MacMichael Vice President – Construction Jim MacMichael is responsible for managing predevelopment, design, and construction activities for projects in the Mid-Atlantic and Southeast regions. Jim has 30 years of experience in construction and development and has managed complex commercial, mixed-use, multifamily, and industrial projects. Before joining Hanover, Jim served as President at JLB Builders, LLC and oversaw predevelopment, design, and construction activities for their multifamily projects throughout the United States. Jim graduated from Virginia Polytechnic Institute and State University in Blacksburg, VA, with a Bachelor of Science in Civil Engineering. Matt Mangum Vice President – Construction View Profile Matt Mangum Vice President – Construction Matt Mangum currently oversees all construction-related aspects of Hanover’s design process, predevelopment, planning, logistics, and project execution across the San Diego, Colorado, Arizona, and Austin markets. Since joining Hanover in 2005, he has advanced through the organization, successfully executing a diverse range of project types—including urban wraps, high-density podiums, industrial warehouses, and high-rise towers. Matt holds a Bachelor of Science in Construction Science, graduating with honors from Texas A&M University, where he also served as Company Commander in the Corps of Cadets. Mike Wright Vice President – Preconstruction & Estimating View Profile Mike Wright Vice President – Preconstruction & Estimating Mike Wright is responsible for the management and success of the Estimating and Preconstruction functions. He oversees all conceptual feasibility budgets, tracks project budgets during the design and pre-construction phases, works in collaboration with the Development and Design teams to produce efficient project designs and ensures that Hanover Company’s construction standards are properly documented for all projects throughout the United States. Prior to joining Hanover in 2005, Mike worked as an Estimator for Tribble & Stephens Co., a private, commercial general contractor providing nationwide construction services. Mike graduated summa cum laude from Texas State University with a Bachelor of Science in Construction Science. Zion Patton Vice President – Operations View Profile Zion Patton Vice President – Operations Zion Patton manages the construction division’s safety programs and operations functions. His responsibilities include maintaining policies and procedures across the portfolio, training employees in all standard operating procedures, and overseeing the safety function, scheduling department, and construction administrative support staff. Zion joined Hanover in 2020 with 25 years of experience in the construction industry. Before joining Hanover Company, Zion served as Director of Construction at Emmerson Construction, focusing on multifamily and mixed-use projects in California. Bennie Motis Director of Safety & Quality Assurance View Profile Bennie Motis Director of Safety & Quality Assurance With over 20 years of experience in the multi-family industry, Bennie Motis started his career with Hanover Company in 1993. As a Quality Assurance Associate, he oversaw a portfolio of 20 communities, managed construction turnover, maintenance training and warranty control programs. In 2010, he joined United Dominion Realty as the Director of Quality Assurance. In that position he was responsible for managing inspections of fire and life safety, elevators and major mechanical systems across a 200-community portfolio in 15 states. Bennie rejoined Hanover in 2014, and currently leads the Quality Assurance Department. He oversees the construction turnover process, warranty programs and ensures the operating assets are being maintained, as well as working with various departments including, Development, Risk Management and Asset Management. Earl Smalley Director of Property Operations View Profile Earl Smalley Director of Property Operations As Director of Property Operations, Earl Smalley is responsible for oversight of all ancillary services, Property Management systems, ad valorem tax, and financial reporting. He joined Hanover Company in 1994, and has since worked in all areas of Property Management, including Accounting, Operations and Asset Management. His expertise includes executing value added strategies and establishing processes that will have the maximum impact on Hanover’s bottom line. Ryan Fontaine Director of Marketing Operations View Profile Ryan Fontaine Director of Marketing Operations As Director of Marketing Operations, Ryan Fontaine is responsible for marketing and openings of Hanover’s nationwide property portfolio. Ryan began his property management career with Hanover in 2008, overseeing marketing and leasing for over 1200 apartment units. Ryan rejoined Hanover after working as the Regional Vice President over Boston and Rhode Island at Bozzuto Group, where he was responsible for mixed-use, lease-ups, and value-add projects and focused on advisory work for future developments. Ryan earned his Bachelor of Arts and Science Degree from Bridgewater State University in Massachusetts. Monica Fife Senior Regional Manager View Profile Monica Fife Senior Regional Manager Monica Fife has over 35 years of experience in the multi-family property management industry. Before joining the Hanover team in 2018, Monica served as a Regional Manager for Greystar Property Management. Throughout her career, she also served as the Regional Director of Management with Martin Fein Interests for ten years and was a Property Manager for eighteen years with companies such as Gables Residential, Winther Investments and The Morgan Group. Monica is a CAM and CAPS designate through the National Apartment Association. As a Regional Manager, she is responsible for managing property operations in Houston and Denver, and Florida. Blake Cardwell Regional Manager View Profile Blake Cardwell Regional Manager Blake Cardwell oversees all property operations at Austin and Houston properties in Hanover Company’s portfolio. Blake has over 15 years of experience in the multifamily property management industry and has successfully managed properties nationwide for UDR and Hanover Company. In 2008, he began his career at Hanover Company in Quality Assurance before serving onsite at multiple Hanover Company properties, where he spearheaded the lease-up of three high-rise properties. Blake is CAM certified through the National Apartment Association and holds a Bachelor of Business Administration in Management from Texas State University. Chelsie Ruggieri Regional Manager View Profile Chelsie Ruggieri Regional Manager Chelsie Ruggieri oversees all property operations within the Northern California region of Hanover’s portfolio. Since joining Hanover Company in 2016, she has successfully led teams through lease-ups and stabilized communities across Phoenix, Denver, Southern California, and Northern California. Her extensive experience in diverse markets has positioned her as a strategic leader committed to operational excellence and team development. Chelsie is a graduate of Arizona State University and holds a bachelor’s degree in Marketing from the W.P. Carey School of Business. Keri Billings Regional Manager View Profile Keri Billings Regional Manager Keri Billings brings more than 25 years of Property Management experience to Hanover Company. As Regional Manager for Central Texas and Southern California, Keri’s experience includes pre-development, new construction lease-ups, and high-rise/mixed-use projects, resulting in a wide range of knowledge in all aspects of Property Management. Rebecca Aydelotte Regional Manager View Profile Rebecca Aydelotte Regional Manager Rebecca Aydelotte oversees all property operations within the Mid-Atlantic Region of Hanover’s portfolio. Since joining Hanover Company in 2015, she has skillfully led teams at both lease-up and stabilized properties and worked to establish Hanover’s roots when the company ventured into new markets in Pennsylvania and the Washington metropolitan area. Rebecca is a graduate of Syracuse University and holds a Bachelor of Science from the S.I. Newhouse School of Public Communications. Throughout her career, she has been instrumental in identifying top talent and is dedicated to the growth and development of each teammate. Connor Dempsey Capital Markets Managing Director View Profile Connor Dempsey Capital Markets Managing Director Connor Dempsey joined Hanover Company in 2016. As Capital Markets Managing Director, Connor is primarily responsible for working on Hanover Company’s sourcing of both equity and debt financing and underwriting in the Texas, Colorado, Arizona, California, and Washington markets. Connor holds a Bachelor of Arts in Economics from Dartmouth College. Emily Coty Capital Markets Managing Director View Profile Emily Coty Capital Markets Managing Director Emily Coty joined Hanover Company in 2015. As Capital Markets Managing Director, Emily is primarily responsible for working on Hanover Company’s sourcing of equity and debt financing and underwriting for East Coast development. Emily earned her Bachelor of Arts in Art History from Yale University. Departments Senior Leadership Multifamily Industrial Property Management Construction Capital Markets Murry Bowden Founder & Executive Chairman View Profile Murry Bowden Founder & Executive Chairman Murry Bowden, founder of Hanover Company, has been involved in all aspects of apartment acquisitions, development, construction, management and finance since the company’s formation. He is responsible for strategic planning, risk management, operational oversight and investment decisions. Murry graduated cum laude from Dartmouth College with a Bachelor’s Degree and holds a Juris Doctorate from the University of Texas Law School. He devotes time to various charities and educational institutions. Brandt Bowden Chief Executive Officer View Profile Brandt Bowden Chief Executive Officer As Chief Executive Officer, Brandt Bowden oversees Capital, Development and Construction efforts for Hanover Company. He is integral to the planning and execution of Hanover’s corporate strategy. Brandt joined Hanover in 2002 as a Development Partner covering the East Coast. In 2009, Brandt headed Hanover’s Capital Markets division and soon took on the role of Chief Investment Officer. As CIO, he oversaw the investment and financing of approximately $5 billion in apartment development. Brandt is an active member of the Urban Land Institute and serves on the Multifamily Gold Council. He earned his Bachelor of Arts degree from Dartmouth College, and currently serves as the Houston-area District Enrollment Director. In addition, Brandt serves on the Board of Trustees at The Kinkaid School. Jeb Bowden Chief Operating Officer View Profile Jeb Bowden Chief Operating Officer As Chief Operating Officer, Jeb Bowden is responsible for the strategic oversight of Hanover Company’s Property Management, Asset Management, Global Support Services, Human Resources, Information Technology, and Accounting departments. Since joining Hanover, he has worked on over $17 billion in multifamily properties—spanning from openings to sales—across 17 U.S. markets. He has also opened development offices in Poland and Turkey, and established an operating service company in Ahmedabad, India, now employing over 100 team members. Jeb serves on Hanover’s Investment Committee for both its Multifamily and Industrial platforms. He graduated cum laude with a Bachelor of Arts from Vanderbilt University and serves on the board of the Children’s Museum of Houston. John Nash President View Profile John Nash President As President of Hanover Company, John Nash is primarily involved in managing Hanover’s risks, both legal and financial. Since joining the company in 1996, John has been involved in all aspects of the development and construction of over 75,000 apartment units. Prior to joining Hanover, John was a Partner with the firm Mayer, Brown and Platt with experience in all aspects of real estate acquisitions, sales, workouts, lending, leasing and development across all asset types. He is a graduate of the University of Texas and earned his Juris Doctorate from Southern Methodist University School of Law, where he was an Editor for the Southwestern Law Journal. John has served on the executive boards of several community organizations. John Garibaldi President – Multifamily View Profile John Garibaldi President – Multifamily John Garibaldi has been with Hanover for over 25 years, starting as a Development Partner in Houston in 1999.  During his tenure, he has been instrumental in the expansion of Hanover’s development footprint across the country and is involved in all aspects of Hanover’s apartment development, construction, management, and finance.  Previously, John was a Development Partner for both The Finger Companies and Gross Investments in Houston, and Trammell Crow Residential in the San Francisco Bay area.  John received an MBA from the Stanford Graduate School of Business, where he was President of his graduating class. He also holds an Engineering Degree from the University of Notre Dame.  John has been involved in many local and national charitable organizations, including being on the Board of the Memorial Park Conservancy during its recent expansion and has participated in multiple Habitat for Humanity’s builds, both internationally and domestically. David Hudson President – Industrial View Profile David Hudson President – Industrial As President of the Industrial Division, David Hudson is responsible for all Hanover Company’s acquisition and development activities in the industrial sector. He has over 30 years of commercial real estate and industrial development experience with a proven track record of building industrial development platforms. Previously, David was the President of Griffin Partners Development and the Houston Business Unit Head for Duke Realty, where he led the management of both firms’ industrial development practices. David holds a Bachelor of Business Administration in Accounting from Texas Tech University, is a CPA and licensed as a Texas Real Estate Broker. Jim Fenwick President – Property Management View Profile Jim Fenwick President – Property Management As President of Property Management, Jim Fenwick is responsible for managing all property operations within the Hanover portfolio. Previously, Jim served as President for Miller-Valentine Group, a privately held, vertically integrated real estate firm, where he led a team managing more than 13,000 units in 15 states. He also served as the Northeast Executive Vice President of Equity Residential Properties, a company known as an urban and high-rise expert with oversight of more than $6 billion dollars in real estate. Jim managed their Northeast portfolio of 154 properties, which totaled more than 50,000 units in 14 states. Jim joined Hanover in 2014 and has been instrumental in establishing a service orientation, and delivering a world-class, customer-centric experience. Thomas Knutson President – Construction View Profile Thomas Knutson President – Construction Overseeing all areas of Hanover Company’s preconstruction, construction and design management activities, Thomas Knutson’s construction experience ranges from large-scale institutional work, office building, industrial warehouse, infrastructure work as well as all types of multifamily and mixed-use projects. Prior to becoming President of Construction in December 2019, Thomas served as Hanover’s Vice President of Estimating and Preconstruction, overseeing all budget efforts by the Construction division from 2009 to 2019. Before joining Hanover in 2007, Thomas worked as a Project Manager for Manhattan Construction and a Superintendent for Camden Property Trust. Thomas graduated from Texas A&M University with a Bachelor of Science degree in Construction Science. Judi Hopper Chief Financial Officer View Profile Judi Hopper Chief Financial Officer Judi Hopper joined Hanover Company in 1998 and now manages the Accounting, Tax and Financial Reporting functions. Prior to joining the company, she was an Audit Manager with Arthur Andersen, L.L.P. in Houston. Her client base consisted of a diverse group of public and private companies in the real estate, waste disposal, distribution and manufacturing industries. While at Arthur Anderson, Judi served on Hanover’s audit engagement for four years before joining the company. A Certified Public Accountant, she graduated from the University of Texas at Austin with a Bachelor of Business Administration degree and a Master’s Degree in Accounting. Roxanne Cox Chief Human Resources Officer View Profile Roxanne Cox Chief Human Resources Officer As Chief Human Resources Officer, Roxanne Cox leads Hanover Company’s HR organization. Roxanne oversees initiatives targeted at attracting, developing and retaining Hanover employees. Prior to joining Hanover, Roxanne was the Vice President of Human Capital for several global real estate operating companies, including Verde Realty and Security Capital Group. In these positions, she provided strategic oversight of the HR function, led the development of organizational leaders, and implemented innovative compensation and benefits solutions. Roxanne earned her BA, MBA, and PhD in Business with a specialization in HRM from New Mexico State University. She is certified as a Senior Professional, Human Resources (SPHR) and a SHRM Senior Certified Professional (SHRM-SCP) and sits on the University of Houston-Downtown HRM Advisory Council. Theresa Blades Chief Investment Officer View Profile Theresa Blades Chief Investment Officer Theresa Blades joined Hanover Company in 2012. As Chief Investment Officer, Theresa is primarily responsible for overseeing Hanover Company’s sourcing of equity and debt nationally and project level underwriting. Theresa holds a Bachelor of Arts in Economics from Stanford University. Tami Feigl Edwards General Counsel View Profile Tami Feigl Edwards General Counsel Tami Feigl Edwards joined Hanover Company in 2015.  As General Counsel, Tami manages and supervises the legal team, which is responsible for the company’s transactional real estate and corporate legal matters.  Before joining Hanover, Tami was a partner at Norton Rose Fulbright in Houston, where she counseled a variety of clients in sophisticated real estate transactions.  She holds a Juris Doctorate from The University of Texas School of Law. Mark Friedman Vice President – Risk Management View Profile Mark Friedman Vice President – Risk Management As Vice President of Risk Management, Mark Friedman is responsible for leading and mentoring Hanover’s risk management team, including creating strategies, policies, and procedures for identifying, assessing, and mitigating risk associated with the ownership, development, investment, and management of multifamily and industrial assets. Before joining Hanover in 2019, Mark served as Senior Vice President of Risk Management at HealthPeak Properties, LOWE Enterprises, and The Irvine Company. While at HealthPeak and The Irvine Company, Mark maintained the position of President of Captive Insurance Companies. During his tenure with LOWE Enterprises, Mark served as Chair of the American Hotel and Lodging Association Risk Management Committee. Currently, he serves on the Risk Management Committee of the National Multifamily Housing Committee (NHMC). Mark has a Bachelor of Science in Business Administration from California State University, Long Beach, and a Master of Business Administration from the University of California, Los Angeles, Anderson School of Management. Prior to his risk management career, Mark played on the ATP professional tennis circuit, competing in all major tournaments, including Wimbledon, the U.S. Open, and the Australian and French Open Championships. Adam Harbin Regional Development Partner – Atlanta & Florida View Profile Adam Harbin Regional Development Partner – Atlanta & Florida Adam Harbin is responsible for overseeing Hanover’s development activity throughout the Florida region and the Atlanta region.  Since joining Hanover in 2005, Adam has overseen the development of over 11,500 units and 150,000 square feet of ground-floor retail, representing over $3.5 billion in total capitalization, on projects of all product types, including high-rise, mid-rise, suburban, and mixed-use, in various markets across the Northeast, Mid-Atlantic, and Southeast.  Prior to joining Hanover, Adam practiced law at the New York office of Latham & Watkins, where he worked primarily in bank and project finance.  Adam earned a Classics degree from the University of Alabama and a law degree from the University of Texas. Bo Buchanan Regional Development Partner – Carolinas & Nashville View Profile Bo Buchanan Regional Development Partner – Carolinas & Nashville Bo Buchanan has over 30 years of experience in the real estate industry. He started his career with Hanover Company in 1993 as the Corporate Controller, and has since held several positions, including Development Partner and Vice President of Property Management. Currently, Bo works on the acquisition and development of properties in the Carolinas and Nashville. His track record includes overseeing the development of over 6,000 units in North Carolina, Florida, and Virginia. Bo graduated from Texas A&M University and holds a Bachelor of Science Degree in Business. David Hall Regional Development Partner – Greater Boston & New York View Profile David Hall Regional Development Partner – Greater Boston & New York David Hall leads Hanover’s multi-family development efforts throughout greater Boston, New England and New York. His tenure at Hanover includes a dynamic portfolio of 39 urban and suburban projects, totaling over 11,000 apartment homes and over $4.4 billion in total capitalization. Prior to joining Hanover in 2007, David spent 16 years directing complex developments across multiple property types nationwide, including the redevelopment of a US Navy base for LNR Property Corporation, a national portfolio of office buildings for KBS Realty Advisors and various mixed-use projects for Trammell Crow Company. David earned his MBA from the Kellogg School at Northwestern University and a Bachelor of Arts degree from Dartmouth College. He is active in support of several charitable causes and educational institutions. Ryan Hamilton Regional Development Partner – Texas View Profile Ryan Hamilton Regional Development Partner – Texas Ryan Hamilton has over 25 years of experience in the real estate industry and has worked at Hanover Company since 2004. Ryan is responsible for overseeing Hanover Company’s presence and continued growth in Houston, Austin, and Dallas/Fort Worth. Ryan has developed over 5,550 apartment homes across Texas, Southern California, and Colorado, totaling over $2.0 billion in total capitalization. Prior to joining Hanover Company, Ryan worked for Henry S. Miller Commercial, the largest independent real estate brokerage firm in Texas, where he represented clients in Income Property Sales, Project Leasing, Development Consulting, Property Acquisition and Excess Property Disposition. Ryan earned a Bachelor of Science in Economics and Finance from The University of Texas at Dallas. Scott Youdall Regional Development Partner – West Coast View Profile Scott Youdall Regional Development Partner – West Coast Scott Youdall is responsible for overseeing Hanover Company’s development activity throughout California and Seattle, working out of the San Francisco Bay Area. Since joining Hanover in 2014, Scott has overseen the development of over 5,000 units, representing over $2 billion in total capitalization. Before joining Hanover, Scott served as Vice President of Acquisitions for SummerHill Apartment Communities, where he was responsible for growing the firm’s multi-family development portfolio. Scott has extensive experience in California, where he has spent over 20 years procuring and entitling new development sites for both apartment and single-family home communities. He is a graduate of Cornell University and holds an MBA from the Haas School of Business at the University of California, Berkeley. Caroline Erck Development Partner – Houston View Profile Caroline Erck Development Partner – Houston Caroline Erck serves as Development Partner at Hanover Company and is responsible for sourcing and leading multifamily development efforts in Houston, TX. Prior to joining Hanover, Caroline worked for five years in Strategy & Management Consulting before transitioning to the commercial real estate industry. She began her career at Hanover in Asset Management, where she was responsible for numerous asset operations and dispositions before joining the Development Division. As an industry leader, she participated in the inaugural ULI Women’s Amplify Program in 2022 the NAIOP Developing Leaders Program in 2024, and currently serves as the ULI Local Product Council Chair for Multi-Family in Houston. Caroline holds both a bachelor’s degree, graduating summa cum laude, and a Master of Business Administration, from Texas A&M University. Chris Nash Development Partner – Dallas View Profile Chris Nash Development Partner – Dallas Christopher Nash leads Hanover’s development efforts in the Dallas-Fort Worth metroplex. Prior to joining Hanover in 2016, Christopher worked for Trammell Crow Residential, developing multifamily projects in Houston. He holds a Master of Science in Finance and a Bachelor of Business Administration in Real Estate Finance from Southern Methodist University. Christopher serves on the Advisory Board at the Folsom Institute for Real Estate at SMU. He is also an active member of the Greater Houston Partnership’s Real Estate Committee, ULI, and The Real Estate Council (TREC). Jake Denney Development Partner – Mid-Atlantic View Profile Jake Denney Development Partner – Mid-Atlantic Leading Hanover Company’s development efforts in the Mid-Atlantic market, Jake Denney is responsible for the acquisition, entitlement, and execution of multi-family and mixed-use development projects from Pennsylvania through Virginia. Jake joined Hanover Company in 2021 after beginning his career with a four-year stint at Gables Residential, where he contributed to the development of 1,209 apartment units across the Boston and DC markets. Jake holds a Master of Business Administration and a Master of Public Policy from Georgetown University, where he graduated Core Honors. He earned his Bachelor of Arts degree from Tufts University, where he graduated Magna Cum Laude with highest thesis honors. Joe Gambill Development Partner – Southern California View Profile Joe Gambill Development Partner – Southern California Joe Gambill leads Hanover’s development efforts in Southern California. Joe manages the acquisition, financing and development for all projects in the area. Previously, Joe served as Managing Director at Wood Partners for more than a decade, where he was responsible for the company’s assets in Southern California totaling over 3,500 units with a total capitalization of over $1.3B. Joe earned a bachelor’s degree in Construction Science and Management from Clemson University and a master’s degree in Real Estate Development from the Price School of Public Policy at the University of Southern California. He is a member of the Urban Land Institute in Los Angeles. Lauren Goebel Development Partner – Florida View Profile Lauren Goebel Development Partner – Florida As Development Partner, Lauren Goebel is responsible for leading Hanover Company’s multifamily development efforts in Florida. Based out of Palm Beach, Lauren focuses on the acquisition, entitlement and development of ground-up multifamily projects across the state. Since joining Hanover in 2021, Lauren has led the sourcing and vertical development of Hanover Riverwalk, a 36-story, 380-unit high-rise in downtown Fort Lauderdale, and has initiated the acquisition and development of approximately 2,000 additional units across the state. Lauren holds a Bachelor of Architecture from The University of Texas, as well as a Master’s of Real Estate Development from New York University, where she graduated with honors. Previously, Lauren was Head of Real Estate for Global RE Group, a family office and real estate investment company focused on large-scale acquisition and development opportunities. Prior to joining Global RE Group, Lauren was Vice President of Investments for Mack-Cali Realty Corporation, where she executed numerous commercial acquisitions and dispositions exceeding $500M in total asset value. Lauren started her career in real estate as a Development Manager at The Rockefeller Group, where she helped manage ground-up developments across the northeast. Steffi Russell Development Partner – Arizona & Colorado View Profile Steffi Russell Development Partner – Arizona & Colorado Leading Hanover Company’s development efforts in the Denver and Phoenix markets, Steffi Russell has facilitated the acquisition, planning, and development of over $800 million in residential and mixed-use projects, comprising more than 2,000 apartment units. Previously, Steffi worked for Google, Inc., where she was responsible for the land acquisition and infrastructure development of datacenter sites in the Western United States. Steffi holds a Bachelor of Arts in Math and Economics from Rice University, where she graduated Cum Laude with Departmental Honors. Steve Dazzo Development Partner – Greater Boston View Profile Steve Dazzo Development Partner – Greater Boston Steve Dazzo is a Development Partner with Hanover Company, where he leads all acquisition and development efforts across New England. Since joining Hanover in 2015, he has overseen the acquisition, planning, entitlement, and execution of multifamily and mixed-use developments—from complex urban redevelopment to suburban communities throughout the region. Steve holds a Bachelor of Arts in Economics from Dartmouth College, where he captained the football team and played rugby. Zach Anderson Development Partner – Northern California & Seattle View Profile Zach Anderson Development Partner – Northern California & Seattle Zach Anderson leads Hanover’s acquisition and development efforts in the Northern California and Puget Sound regions. Since joining Hanover in 2018, Zach’s primary roles include sourcing, procuring, and entitling projects in his respective markets. Prior to joining Hanover, Zach served as Director of Acquisitions for Anton DevCo, a regional multifamily developer in California. Before Anton, Zach spent four years as a commercial broker with Colliers International and Cushman & Wakefield, where he was involved in transactions totaling approximately $450 million. Zach graduated from Tufts University with a B.A. in Economics and received his M.B.A. from the Haas School of Business at the University of California, Berkeley. Kayvan Zarea Design Development Partner View Profile Kayvan Zarea Design Development Partner Kayvan Zarea serves as Design Development Partner at Hanover, bringing over 20 years of experience in the design and execution of large-scale commercial and residential developments. A licensed architect in seven states, he has led the development, design, and construction of projects totaling more than $2 billion across Hanover’s portfolio. Kayvan plays a pivotal leadership role in advancing projects throughout the East Coast and Southern United States, guiding them from inception through final delivery. He holds a Bachelor of Architecture from the University of Houston’s Gerald D. Hines College of Architecture and an Executive MBA from Texas A&M University’s Mays Business School. Rick Stinson Design Development Partner View Profile Rick Stinson Design Development Partner With a background that includes over 40 years of architectural experience in the design and development of commercial and residential projects, Rick Stinson joined The Hanover Company as a Development Partner in 2004.  Rick currently serves as a Design Development Partner managing project design and execution activities in California, Arizona and Washington. Over the course of his career, he has been directly involved in the development, design, and construction contract administration of high-density residential projects comprising more than 14,000 apartment units. Rick earned a Bachelor of Science in Architecture from The University of Texas at Arlington. Stephen Luna Design Development Partner View Profile Stephen Luna Design Development Partner With a background that includes over 20 years of experience in the design and development of commercial and residential projects, Stephen Luna is responsible for managing Hanover Company’s design and construction oversight activities. Currently, he focuses on projects in Texas, North Carolina, Massachusetts, Maryland, and Washington D.C. He was previously Hanover’s Director of Design and oversaw the architectural design of all urban projects. In this role, Stephen worked to develop standards of quality in design and construction throughout Hanover’s entire portfolio. Stephen earned a Bachelor of Architecture Degree from The University of Texas at Austin. Deanna Chalfant VP – Development View Profile Deanna Chalfant VP – Development Deanna Chalfant serves as Vice President of Development in Hanover’s California and Washington markets. With over 15 years of real estate development experience, she has expertly managed complex urban projects, delivering more than 3,000 units with a portfolio exposure exceeding $1.1 billion. Prior to joining Hanover, Deanna worked at Essex Property Trust as Vice President of Development, overseeing multifamily development projects across the Bay Area, Southern California, and the Pacific Northwest. Deanna’s expertise spans the entire project lifecycle, from site selection and financial modeling to entitlements, construction, and occupancy. Deanna holds a Bachelor of Arts in Sociology from the University of California, Santa Barbara, and completed the Executive Leadership Program at the University of California, Berkeley’s Haas School of Business. Chase LeBlanc Director of Landscape Architecture View Profile Chase LeBlanc Director of Landscape Architecture As Hanover Company’s Director of Landscape Architecture, Chase LeBlanc is responsible for managing the landscape planning, design, documentation, and construction administration functions for the entire portfolio. Chase joined Hanover in 1997 and is a licensed Landscape Architect in multiple states. His career has included landscape design responsibility for over 150 investment-grade properties, totaling more than 45,000 units. He earned a Bachelor of Landscape Architecture Degree from Texas A&M University. Wayne Andrist Director of Interior Architecture View Profile Wayne Andrist Director of Interior Architecture Wayne Andrist serves as the Director of Interior Design at The Hanover Company, where he leads the design and development of amenities, corridors, lobbies, and residential units. He brings over 30 years of experience in corporate and hospitality interiors and has been recognized with six AIA and IIDA Design Awards. Prior to joining Hanover in 2008, Wayne spent five years with GFF in Dallas and seven years with Design Collective in Baltimore, where he first collaborated with Hanover in 2003. He holds a Bachelor of Architecture from the University of Wisconsin–Milwaukee and a Master of Architecture from the University of Houston. Wayne has also pursued international studies at Oxford University in England and the Centre d’Études d’Architecture et d’Urbanisme in Saintes, France. Dan Gordon Regional Development Partner View Profile Dan Gordon Regional Development Partner Dan Gordon is responsible for overseeing Hanover Company’s industrial development efforts in the Northeast with a focus on Maryland, Washington, DC, Virginia, Pennsylvania, New Jersey and the New York City metro area. Previously, Dan was a Development Partner in Hanover Company’s multifamily division responsible for overseeing development efforts in the Mid-Atlantic with a focus on the greater Washington, D.C. and Philadelphia areas. Before that, Dan was an attorney at a mergers and acquisitions litigation boutique in Wilmington, Delaware. Dan is a member of the Board of the New York Center for Child Development and a member of the Board of the New York Center for Infants and Toddlers. He holds a Bachelor of Arts in Economics-Philosophy from Columbia University, as well as an MBA in Real Estate and Finance from The Wharton School at the University of Pennsylvania, where he graduated with honors. He also attended the University of Virginia School of Law, where he obtained his JD, was a member of the Virginia Law Review, and graduated Order of the Coif. Anthony Feenick Development Partner – Southern California View Profile Anthony Feenick Development Partner – Southern California Anthony Feenick leads Hanover’s Industrial Division development efforts in the Southern California market. Prior to joining Hanover in 2022, Anthony worked as a Senior Director of Acquisitions, Development, and Asset Management at Tishman Speyer where he focused on multifamily, office, and life science investments in the Los Angeles and Denver markets. Anthony holds a Bachelor of Arts in Economics and Political Science from Northwestern University and an MBA in Real Estate from Columbia Business School. James Melody Development Partner – Texas View Profile James Melody Development Partner – Texas James Melody leads Hanover Company’s industrial land acquisition and development efforts in Texas, with a focus on opportunities in Houston, Dallas/Fort Worth, San Antonio and Austin. Prior to joining Hanover Company in 2022, James was a Director of Industrial Development at Lovett Industrial, executing on over three million square feet of warehouse space across Texas. Before Lovett, James was at Clarion Partners in New York City, where, as a member of the East Coast acquisitions team, he contributed to the purchase of over $1.0 billion in commercial property investments. James holds a Master of Science in Real Estate Development from Columbia University and a Bachelor of Finance from the University of Texas. Jeff Onstott Development Partner – Atlanta View Profile Jeff Onstott Development Partner – Atlanta Jeff Onstott is responsible for overseeing Hanover Company’s industrial land acquisitions and development efforts in Atlanta. Jeff started his career with Hanover Company in 2012 and previously served as Vice President of Capital Markets, where he oversaw Hanover Company’s sourcing of equity financing and underwriting for East Coast multifamily development. Jeff holds a Bachelor of Arts degree from Dartmouth College. Tim Bolton Senior Vice President – Construction View Profile Tim Bolton Senior Vice President – Construction With over 35 years of experience within the development and construction industry, Tim Bolton oversees predevelopment, design, and construction activities for projects in Los Angeles, Orange County, Northern California, and the Pacific Northwest. Prior to joining Hanover, Tim was the Senior Vice President & Partner with Lowe Enterprises and oversaw all of their resort development activities throughout the United States. Tim graduated from California Polytechnic State University at San Luis Obispo with a Bachelor’s Degree in Construction Management and has also completed the Executive Real Estate Management Program at Harvard Business School. Tom Denney Senior Vice President – Construction View Profile Tom Denney Senior Vice President – Construction Tom Denney manages the construction function of Hanover Company’s Northeast Regional Office in Boston, Massachusetts. With over 20 years of experience at Hanover, Tom is responsible for overseeing design, construction planning and execution for projects throughout the Northeast and Pennsylvania regions. Tom earned a Bachelor’s Degree in Business Management and a Master’s Degree in Civil Engineering from Worcester Polytechnic Institute. Jason Lister Vice President – Construction View Profile Jason Lister Vice President – Construction With over 25 years of experience with Hanover, Jason Lister manages Hanover’s construction initiatives in Atlanta, GA, and the Houston and Dallas areas in Texas. Jason is responsible for overseeing the construction aspect of the design process, predevelopment, construction planning and logistics, and execution of multifamily and mixed-use projects. On the path to becoming Vice President, Jason was a vital contributor to the addition of over 18 properties and 6,000 units to the Hanover portfolio across the country from California to Massachusetts, down to Florida, and throughout Texas and Colorado. Jim MacMichael Vice President – Construction View Profile Jim MacMichael Vice President – Construction Jim MacMichael is responsible for managing predevelopment, design, and construction activities for projects in the Mid-Atlantic and Southeast regions. Jim has 30 years of experience in construction and development and has managed complex commercial, mixed-use, multifamily, and industrial projects. Before joining Hanover, Jim served as President at JLB Builders, LLC and oversaw predevelopment, design, and construction activities for their multifamily projects throughout the United States. Jim graduated from Virginia Polytechnic Institute and State University in Blacksburg, VA, with a Bachelor of Science in Civil Engineering. Matt Mangum Vice President – Construction View Profile Matt Mangum Vice President – Construction Matt Mangum currently oversees all construction-related aspects of Hanover’s design process, predevelopment, planning, logistics, and project execution across the San Diego, Colorado, Arizona, and Austin markets. Since joining Hanover in 2005, he has advanced through the organization, successfully executing a diverse range of project types—including urban wraps, high-density podiums, industrial warehouses, and high-rise towers. Matt holds a Bachelor of Science in Construction Science, graduating with honors from Texas A&M University, where he also served as Company Commander in the Corps of Cadets. Mike Wright Vice President – Preconstruction & Estimating View Profile Mike Wright Vice President – Preconstruction & Estimating Mike Wright is responsible for the management and success of the Estimating and Preconstruction functions. He oversees all conceptual feasibility budgets, tracks project budgets during the design and pre-construction phases, works in collaboration with the Development and Design teams to produce efficient project designs and ensures that Hanover Company’s construction standards are properly documented for all projects throughout the United States. Prior to joining Hanover in 2005, Mike worked as an Estimator for Tribble & Stephens Co., a private, commercial general contractor providing nationwide construction services. Mike graduated summa cum laude from Texas State University with a Bachelor of Science in Construction Science. Zion Patton Vice President – Operations View Profile Zion Patton Vice President – Operations Zion Patton manages the construction division’s safety programs and operations functions. His responsibilities include maintaining policies and procedures across the portfolio, training employees in all standard operating procedures, and overseeing the safety function, scheduling department, and construction administrative support staff. Zion joined Hanover in 2020 with 25 years of experience in the construction industry. Before joining Hanover Company, Zion served as Director of Construction at Emmerson Construction, focusing on multifamily and mixed-use projects in California. Bennie Motis Director of Safety & Quality Assurance View Profile Bennie Motis Director of Safety & Quality Assurance With over 20 years of experience in the multi-family industry, Bennie Motis started his career with Hanover Company in 1993. As a Quality Assurance Associate, he oversaw a portfolio of 20 communities, managed construction turnover, maintenance training and warranty control programs. In 2010, he joined United Dominion Realty as the Director of Quality Assurance. In that position he was responsible for managing inspections of fire and life safety, elevators and major mechanical systems across a 200-community portfolio in 15 states. Bennie rejoined Hanover in 2014, and currently leads the Quality Assurance Department. He oversees the construction turnover process, warranty programs and ensures the operating assets are being maintained, as well as working with various departments including, Development, Risk Management and Asset Management. Earl Smalley Director of Property Operations View Profile Earl Smalley Director of Property Operations As Director of Property Operations, Earl Smalley is responsible for oversight of all ancillary services, Property Management systems, ad valorem tax, and financial reporting. He joined Hanover Company in 1994, and has since worked in all areas of Property Management, including Accounting, Operations and Asset Management. His expertise includes executing value added strategies and establishing processes that will have the maximum impact on Hanover’s bottom line. Ryan Fontaine Director of Marketing Operations View Profile Ryan Fontaine Director of Marketing Operations As Director of Marketing Operations, Ryan Fontaine is responsible for marketing and openings of Hanover’s nationwide property portfolio. Ryan began his property management career with Hanover in 2008, overseeing marketing and leasing for over 1200 apartment units. Ryan rejoined Hanover after working as the Regional Vice President over Boston and Rhode Island at Bozzuto Group, where he was responsible for mixed-use, lease-ups, and value-add projects and focused on advisory work for future developments. Ryan earned his Bachelor of Arts and Science Degree from Bridgewater State University in Massachusetts. Monica Fife Senior Regional Manager View Profile Monica Fife Senior Regional Manager Monica Fife has over 35 years of experience in the multi-family property management industry. Before joining the Hanover team in 2018, Monica served as a Regional Manager for Greystar Property Management. Throughout her career, she also served as the Regional Director of Management with Martin Fein Interests for ten years and was a Property Manager for eighteen years with companies such as Gables Residential, Winther Investments and The Morgan Group. Monica is a CAM and CAPS designate through the National Apartment Association. As a Regional Manager, she is responsible for managing property operations in Houston and Denver, and Florida. Blake Cardwell Regional Manager View Profile Blake Cardwell Regional Manager Blake Cardwell oversees all property operations at Austin and Houston properties in Hanover Company’s portfolio. Blake has over 15 years of experience in the multifamily property management industry and has successfully managed properties nationwide for UDR and Hanover Company. In 2008, he began his career at Hanover Company in Quality Assurance before serving onsite at multiple Hanover Company properties, where he spearheaded the lease-up of three high-rise properties. Blake is CAM certified through the National Apartment Association and holds a Bachelor of Business Administration in Management from Texas State University. Chelsie Ruggieri Regional Manager View Profile Chelsie Ruggieri Regional Manager Chelsie Ruggieri oversees all property operations within the Northern California region of Hanover’s portfolio. Since joining Hanover Company in 2016, she has successfully led teams through lease-ups and stabilized communities across Phoenix, Denver, Southern California, and Northern California. Her extensive experience in diverse markets has positioned her as a strategic leader committed to operational excellence and team development. Chelsie is a graduate of Arizona State University and holds a bachelor’s degree in Marketing from the W.P. Carey School of Business. Keri Billings Regional Manager View Profile Keri Billings Regional Manager Keri Billings brings more than 25 years of Property Management experience to Hanover Company. As Regional Manager for Central Texas and Southern California, Keri’s experience includes pre-development, new construction lease-ups, and high-rise/mixed-use projects, resulting in a wide range of knowledge in all aspects of Property Management. Rebecca Aydelotte Regional Manager View Profile Rebecca Aydelotte Regional Manager Rebecca Aydelotte oversees all property operations within the Mid-Atlantic Region of Hanover’s portfolio. Since joining Hanover Company in 2015, she has skillfully led teams at both lease-up and stabilized properties and worked to establish Hanover’s roots when the company ventured into new markets in Pennsylvania and the Washington metropolitan area. Rebecca is a graduate of Syracuse University and holds a Bachelor of Science from the S.I. Newhouse School of Public Communications. Throughout her career, she has been instrumental in identifying top talent and is dedicated to the growth and development of each teammate. Connor Dempsey Capital Markets Managing Director View Profile Connor Dempsey Capital Markets Managing Director Connor Dempsey joined Hanover Company in 2016. As Capital Markets Managing Director, Connor is primarily responsible for working on Hanover Company’s sourcing of both equity and debt financing and underwriting in the Texas, Colorado, Arizona, California, and Washington markets. Connor holds a Bachelor of Arts in Economics from Dartmouth College. Emily Coty Capital Markets Managing Director View Profile Emily Coty Capital Markets Managing Director Emily Coty joined Hanover Company in 2015. As Capital Markets Managing Director, Emily is primarily responsible for working on Hanover Company’s sourcing of equity and debt financing and underwriting for East Coast development. Emily earned her Bachelor of Arts in Art History from Yale University. Explore Hanover Company Learn more about Hanover Company’s commitment to excellence and our distinctive culture. Work At Hanover About Hanover 1780 S Post Oak Ln, Houston, TX 77056 (713) 267-2100 © Hanover Corporate | All Rights Reserved.  | Privacy Policy | Accessibility Statement | Hanover Group Health Plan MRF | Do Not Sell or Share My Info"
    }
  ]
}