{
  "fuentes": [
    {
      "url": "https://www.bowenyardwh.com/contact",
      "email": "benjamin@rippleshandcrafted.com"
    },
    {
      "url": "https://www.bowenyardwh.com/contact",
      "email": "contactus@bowenyardwh.com"
    },
    {
      "url": "https://www.bowenyardwh.com/contact",
      "email": "management@maritimewh.com"
    },
    {
      "url": "https://boweninc.com/contact/",
      "email": "info@boweninc.com"
    },
    {
      "url": "https://www.totalyardworks.ca/contact-us/",
      "email": "info@totalyardworks.ca"
    },
    {
      "url": "https://contactout.com/Paul-Bowen-83258462",
      "email": "paul@bowenadvisors.com"
    },
    {
      "url": "https://www.bowenyardwh.com/events",
      "email": "contactus@bowenyardwh.com"
    },
    {
      "url": "https://www.bowencraggs.com/get-in-touch/",
      "email": "dmcgrath@bowencraggs.com"
    },
    {
      "url": "https://www.bowencraggs.com/get-in-touch/",
      "email": "spayton@bowencraggs.com"
    },
    {
      "url": "https://www.bowencraggs.com/get-in-touch/",
      "email": "tgolden@bowencraggs.com"
    },
    {
      "url": "https://www.bowenyardwh.com/maritime",
      "email": "contactus@bowenyardwh.com"
    },
    {
      "url": "https://www.bowenyardwh.com/restaurants",
      "email": "contactus@bowenyardwh.com"
    },
    {
      "url": "https://visitcentralflorida.org/featured/bowen-yard/",
      "email": "contactus@bowenyardwh.com"
    },
    {
      "url": "https://www.publishersweekly.com/pw/by-topic/authors/profiles/article/95349-the-unstoppable-rhys-bowen.html",
      "email": "publishersweekly@omeda.com"
    },
    {
      "url": "https://www.publishersweekly.com/pw/by-topic/authors/profiles/article/95349-the-unstoppable-rhys-bowen.html",
      "email": "mike@nextstepsmarketing.com"
    },
    {
      "url": "https://www.wmnorthwest.com/kirkland/contactus/",
      "email": "pnwcmservices@wm.com"
    },
    {
      "url": "https://www.wmnorthwest.com/kirkland/contactus/",
      "email": "pnwrsservices@wm.com"
    },
    {
      "url": "https://www.wmnorthwest.com/kirkland/contactus/",
      "email": "utilitybilling@kirklandwa.gov"
    },
    {
      "url": "https://www.bmbinc.com/contact-us/",
      "email": "info@bmbinc.com"
    },
    {
      "url": "https://laltoday.6amcity.com/city/winter-haven-bowen-yard",
      "email": "cjacobson@laltoday.com"
    },
    {
      "url": "https://laltoday.6amcity.com/city/winter-haven-bowen-yard",
      "email": "rdelgado@6amcity.com"
    },
    {
      "url": "https://www.bowenyardwh.com/lakehousekitchen",
      "email": "contactus@bowenyardwh.com"
    },
    {
      "url": "https://www.bowenyardwh.com/",
      "email": "contactus@bowenyardwh.com"
    },
    {
      "url": "https://www.biography.com/actors/a83896298/bowen-yang",
      "email": "editor@biography.com"
    },
    {
      "url": "https://bowen.co.nz/contact/",
      "email": "spec@bowen.co.nz"
    }
  ],
  "mails": [
    "benjamin@rippleshandcrafted.com",
    "cjacobson@laltoday.com",
    "contactus@bowenyardwh.com",
    "dmcgrath@bowencraggs.com",
    "editor@biography.com",
    "info@bmbinc.com",
    "info@boweninc.com",
    "info@totalyardworks.ca",
    "management@maritimewh.com",
    "mike@nextstepsmarketing.com",
    "paul@bowenadvisors.com",
    "pnwcmservices@wm.com",
    "pnwrsservices@wm.com",
    "publishersweekly@omeda.com",
    "rdelgado@6amcity.com",
    "spayton@bowencraggs.com",
    "spec@bowen.co.nz",
    "tgolden@bowencraggs.com",
    "utilitybilling@kirklandwa.gov"
  ],
  "nombre_sitio": "bowenyardwh.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.bowenyardwh.com/contact",
      "text": "Contact | Bowen Yard top of page Menu Close Home Restaurants History Contact Events Home Restaurants History Contact Events Subscribe to our newsletter Email * Yes, subscribe me to your newsletter. Submit Contact six/ten for future business opportunities in Winter Haven. Contact Maritime management@maritimewh.com View Site Soce Market socemarket@gmail.com View Site Ato (863) 225 9752 View Site Ripples benjamin@rippleshandcrafted.com View Site The Lakehouse Kitchen (863) 269 5028 View Site BG's Indian Kitchen (813) 693 9439 View Site Home Restaurants History Contact Events More Use tab to navigate through the menu items. Bowen Yard 308 4th St SW Winter Haven, FL contactus@bowenyardwh.com © 2024 by Bowen Yard. Site created by Destroyer Media . Home Restaurants History Contact Events bottom of page"
    },
    {
      "url": "https://boweninc.com/contact/",
      "text": "Contact - Bowen Search for: About Us Our Team Services Cross-Border Transactions News Careers Contact Industries Cloud & CX Cloud Data & AI Infrastructure Cybersecurity CX & EX Defense Tech & Government Services Sustainability Agriculture Water & Waste Energy Search for: About Us Industries Cloud & CX Cloud CX & EX Cybersecurity Data & AI Infrastructure Defense Tech & Government Services Sustainability Agriculture Energy Water & Waste Our Team Services Cross-Border Transactions News Careers Contact Contact Us Bowen Boston 22 Boston Wharf Road, 7th Floor Boston, MA 02210 Bowen Plymouth 34 Main Street Extension, Suite 203 Plymouth, MA 02360 Call Us: 1.617.245.1666 Fax: 1.617.249.0985 Email Us: info@boweninc.com Send Us a Message Sending... Join Bowen Bowen continuously seeks experienced industry and banking professionals to join our firm at all levels. We have a strong track record of offering accelerated career development in our rapidly expanding growth tech focused sectors. We are always interested in hearing from talented professionals who are looking for a high-integrity, fast-paced, team-oriented culture. Please reach out to begin a discussion of opportunities at Bowen. Position * Analyst Associate Intern Attach Your CV * Maximum size: 20MB Allowed formats: PDF or Word Sending... Subscribe to our insights Sign Up About Us Our Team Services Cross-Border Transactions News Careers Contact Industries Cloud & CX Cloud Data & AI Infrastructure Cybersecurity CX & EX Defense Tech & Government Services Sustainability Agriculture Water & Waste Energy About Us Our Team Services Cross-Border Transactions News Careers Contact Industries Cloud & CX Cloud Data & AI Infrastructure Cybersecurity CX & EX Defense Tech & Government Services Sustainability Agriculture Water & Waste Energy Privacy Policy Creation : LaBOITE Copyrights © 2025 Bowen Inc. All Rights Reserved. Follow Us Member Of Creation : LaBOITE"
    },
    {
      "url": "https://www.totalyardworks.ca/contact-us/",
      "text": "Get In Touch | Contact Total Yard Works Landscaping & Fences Home Services Fence Installation Deck Installation Gazebos & Pergolas Landscaping Services Decorative Stone & Boulder Drainage & Drains Driveway Paving & Installation Edging & Borders Firepits & Fireplaces Outdoor Kitchens & Counters Paver & Patio Installation Retaining Walls Steps & Stairs Walkways & Paths Commercial Services Wooden Fences Gallery Reviews FAQ Contact (204) 291-8616 [email protected] Working hours:\r\nMon-Fri   8:30 –4:30 791 Erin Street Winnipeg\r\nR3G 2W2 Get Quoted Tel: +2042918616 [email protected] Home Services Fence Installation Deck Installation Gazebos & Pergolas Landscaping Services Decorative Stone & Boulder Drainage & Drains Driveway Paving & Installation Edging & Borders Firepits & Fireplaces Outdoor Kitchens & Counters Paver & Patio Installation Retaining Walls Steps & Stairs Walkways & Paths Commercial Services Wooden Fences Gallery Reviews FAQ Contact FREE ONLINE QUOTES Let’s Get Started Please fill out the following form with as much and as detailed information as possible. Contact Us (light) Your Name * Phone Email * Street Address of Project * Service Requested * Project Type Residential Fence Residential Deck Landscaping Repair & Restore Commercial Fencing Other Working Conditions? Fence Type Chain Link Wood Ornamental Style Black Chain Link Galvanized Chain Link Unsure Yet Height 4 foot 5 foot 6 foot Unsure Yet Post Style 4x4 Post 6x6 Post Hybrid (Metal/Wood) Unsure Yet Height 4 foot 5 foot 6 foot 6.5 foot Unsure Yet Style Majestic Classic Genesis Unsure Height 4 foot 5 foot 6 foot Unsure Yet Gates & Entrance Options Standard Single Swing Oversized Single Swing Double Swing Sliding Gate Other / Multiple (Specify in comments) Tear Down / Haul Away Teardown / Haulaway? Deck Deck Options Wooden Deck Composite Deck Unsure yet Approx Dimensions / Square Footage? Railing Wood Railing Regel Railing Unsure Yet Height Under 2 foot Over 2 foot Unsure Yet Landscaping Landscaping Project Patio Walkway Driveway Sod / Turf Full Landscape Retaining Wall Leveling / Grading Tree / Plants Other? Landscaping Commercial / Industrial Fence Options Not Sure Yet Chain Link Fencing Wood Fencing Ornamental Fencing Gates & Entrances Commercial Repair Style Galvanized Black Not Sure Yet Height 6 foot 8 foot 10 foot Other Style 4x4 Post 6x6 Post Hybrid Posts Other / Not Sure Height 6 foot 8 foot Other / Not Sure Style Classic Genesis Majestic Other Height 6 foot 8 foot Other / Not Sure Gates & Entrance Standard Sliding Swinging Double Swing Other / Not Sure Repair & Restore Repair Options Chain Link Fencing Repair Wood Fencing Repair Gate & Door Repair Commercial Fencing Repair Other (Specify Below / Picture Upload) Message * File Upload Drop a file here or click to upload Choose File Maximum file size: 40MB Submit If you are human, leave this field blank. Hours Of Operation Monday Tuesday Wednesday Thursday Friday Saturday Sunday 08:30 – 16:30 08:30 – 16:30 08:30 – 16:30 08:30 – 16:30 08:30 – 16:30 Closed Closed Talk With Someone Need to get in touch with our staff directly? We typically reply within a few business hours Call the Office (204) 291-8616 Send an Email [email protected] Connect on Socials View our social profiles and subscribe to stay up to date with us on your favorite platforms Lets Get Your Project Started Free Quote Request Please fill out the following form with as much and as detailed information as possible. Include any details on obstacles in the work environment, existing structures / fences, if you require us to take garbage etc. Contact Us Your Name * Phone Email * Street Address of Project * Service Requested * Project Type Residential Fence Residential Deck Landscaping Repair & Restore Commercial Fencing Other Working Conditions? Fence Type Chain Link Wood Ornamental Style Black Chain Link Galvanized Chain Link Unsure Yet Height 4 foot 5 foot 6 foot Unsure Yet Post Style 4x4 Post 6x6 Post Hybrid (Metal/Wood) Unsure Yet Height 4 foot 5 foot 6 foot 6.5 foot Unsure Yet Style Majestic Classic Genesis Unsure Height 4 foot 5 foot 6 foot Unsure Yet Gates & Entrance Options Standard Single Swing Oversized Single Swing Double Swing Sliding Gate Other / Multiple (Specify in comments) Tear Down / Haul Away Teardown / Haulaway? Deck Deck Options Wooden Deck Composite Deck Unsure yet Approx Dimensions / Square Footage? Railing Wood Railing Regel Railing Unsure Yet Height Under 2 foot Over 2 foot Unsure Yet Landscaping Landscaping Project Patio Walkway Driveway Sod / Turf Full Landscape Retaining Wall Leveling / Grading Tree / Plants Other? Landscaping Commercial / Industrial Fence Options Not Sure Yet Chain Link Fencing Wood Fencing Ornamental Fencing Gates & Entrances Commercial Repair Style Galvanized Black Not Sure Yet Height 6 foot 8 foot 10 foot Other Style 4x4 Post 6x6 Post Hybrid Posts Other / Not Sure Height 6 foot 8 foot Other / Not Sure Style Classic Genesis Majestic Other Height 6 foot 8 foot Other / Not Sure Gates & Entrance Standard Sliding Swinging Double Swing Other / Not Sure Repair & Restore Repair Options Chain Link Fencing Repair Wood Fencing Repair Gate & Door Repair Commercial Fencing Repair Other (Specify Below / Picture Upload) Message * File Upload Drop a file here or click to upload Choose File Maximum file size: 40MB Submit If you are human, leave this field blank. Copyright ©2013-2025 Total Yard Works Landscaping & Fences - All Rights Reserved."
    },
    {
      "url": "https://contactout.com/Paul-Bowen-83258462",
      "text": "Paul Bowen Email & Phone Number | Founder & CEO | Bowen - ContactOut Product Overview Our Data Clients Use Cases Sales Recruiters Features Search Portal Chrome Extension API More Integrations Data Enrichment Gmail Enrichment Email Campaigns Support ContactSheets Overview Our Data Learn more about our data Clients See how companies succeed with ContactOut Use Cases Sales Hit your sales goals with ease Recruiters Speed up hiring of top talent Features Search Portal Find the right prospects quickly with 20+ search filters Chrome Extension Supercharge your prospecting across the the web API Power your products with instant access to a large-scale database More Integrations Data Enrichment Gmail Enrichment Email Campaigns Support ContactSheets Pricing Knowledge How to use ContactOut How to Start a Startup 50+ Sales Call Recordings Recruitment Mastery Hub Sales Mastery Hub Founder's Blog Startup Curriculum How to use ContactOut Watch & learn on how to get started with ContactOut How to Start a Startup How we built ContactOut to 8 figures in revenue. Video series with screen shares. 50+ Sales Call Recordings Real life call recordings of top companies (Hubspot, Shopify, Paypal, Zoom, and many more) Recruitment Mastery Hub A comprehensive collection of 250+ recruiting resources Sales Mastery Hub Our collection of 300+ sales articles, videos, guides, and more - all in one place! Founder's Blog Our CEO's reflections on life, productivity, and personal development Startup Curriculum The most actionable curriculum featuring 100+ resources and a step by step guide. Get a demo Log in Sign up for free Sign up for free Log in PB Paul Bowen Founder & CEO at Bowen | Boston, Massachusetts, United States View Paul Bowen's Email & Phone Number Paul Bowen Socials Paul Bowen Work Board Member | Executive Committee at Good Sports, Inc. in November 2017 to Present Founder & CEO at Bowen in July 2002 to Present Board of Advisors at Dingman Center For Entrepreneurship in January 2008 to January 2013 See more See less Paul Bowen Skills Business Strategy Corporate Development Venture Capital Private Equity Mergers & Acquisitions Investment Banking Start-ups Cloud Computing M&A experience Valuation Strategic Partnerships Mergers Entrepreneurship Financial Modeling VoIP Due Diligence SaaS Corporate Finance Product Marketing Telecommunications Go-to-market Strategy Private Placements Executive Management IPO Business Development See more See less About Paul Bowen's Current Company Bowen Discover more about Bowen Frequently Asked Questions about Paul Bowen What is Paul Bowen email address? Email Paul Bowen at [email protected] and [email protected] . This email is the most updated Paul Bowen's email found in 2025. What is Paul Bowen phone number? Paul Bowen phone number is 13177018261. How to contact Paul Bowen? To contact Paul Bowen send an email to [email protected] or [email protected] . If you want to call Paul Bowen try calling on 13177018261. What company does Paul Bowen work for? Paul Bowen works for Bowen What is Paul Bowen's role at Bowen? Paul Bowen is Founder & CEO What industry does Paul Bowen work in? Paul Bowen works in the Investment Banking industry. Paul Bowen Email Addresses Email Paul Bowen at [email protected] and [email protected] . This email is the most updated Paul Bowen's email found in 2025. pa**** [email protected] Personal Email p*****@bowenadvisors.com Work Email Paul Bowen Phone Numbers Paul Bowen phone number is 13177018261. (413) ***-*169 Phone number View Paul Bowen's Email & Phone Number Not the Paul Bowen you were looking for? Find personal and work emails for over 250M professionals. Search People like Paul Bowen TH Taylor Harkness Chief Financial Officer\n                                                                    at LCCI Ready Mix Concrete KS Karim Saleh Executive Director\n                                                                    at Goldman Sachs TV Tony Vincent Managing Director\n                                                                    at Transact Capital Partners, LLC JM Jeff Mcgowan Customer Loyalty Manager\n                                                                    at IKEA DT Damon Thomas Business Owner, Director, Author, TV Host\n                                                                    at DT Production RM Rick Mitchell Director of Loss Prevention, Inventory Control and Fraud\n                                                                    at Conn's HomePlus CH Chris Haynor US Sales Leader\n                                                                    at tiptap PK Paul Kruger Director, Baseball Operations\n                                                                    at Texas Rangers Baseball Club RB Rachel Burbank Manager, Customer Success\n                                                                    at Granicus DS Don Shanks Sr. Capture Manager at Leidos\n                                                                    at Leidos LO Laila Overs Voice Over Artist, Singer\n                                                                    at Laila Berzins Voice Overs OG Oscar Gonzalez Partner & Managing Director, Commerce and Enterprise Solutions\n                                                                    at United Virtualities | We Are UV AP Andy Palmen President and CEO\n                                                                    at Palmen Auto Stores LA Luanne Ansaldo President\n                                                                    at CHRISTUS Santa Rosa Hospital-Medical Center PJ Paul James National Sales Leader - Personal Lines\n                                                                    at The Hanover Insurance Group RC Rachel Cullen President & CEO\n                                                                    at Ruiz Foods JC John Collins Adjunct Professor of Law\n                                                                    at Santa Clara University School of Law RS Ross Simmons Director of Valuations\n                                                                    at SFR3 Fund HC Humberto Carrillo Regional Solution Manager\n                                                                    at GBM as a Service PS Paul Stark Lead Solutions Consultant\n                                                                    at Google PT Paul Thompson Director\n                                                                    at ENIGMA Center for Worldwide Medicine, Imaging & Genomics BL Brad Lawrenz Executive Vice President of Sales\n                                                                    at Deep Blue Data, LLC DT Dan Trister Executive Vice President\n                                                                    at Israel Discount Bank of New York GH Gary Hall Partner\n                                                                    at American Triple I JW Jordan Williams Incoming Business Leadership Program Analyst July 2021\n                                                                    at LinkedIn RA Ron Adams Assistant Coach\n                                                                    at Golden State Warriors Show more Show less Engage\n                                                                candidates 10x faster Enjoy unlimited access\n                                                                and discover candidates outside of LinkedIn Learn more Sign Up Trusted by 1.4M users from 76% of\n                                    Fortune 500 companies The most accurate data ever CCPA Compliant GDPR Compliant 150M Personal Emails 200M Work Emails 100M Direct Dials 250M Professional Profiles 40M Company Profiles Find anyone, anywhere with ContactOut today Making remote or global hires? Connecting with key decision-makers? We can help. 40 emails / month 3 phone numbers / month Works on standard LinkedIn only Work emails, personal emails, mobile numbers * 1 user per company limit Sign up for free No credit card required © 2025 ContactOut. All rights reserved. Directory Top 200 Famous People Directory Top Companies in IT Company Search by Industry Free Tools Celebrity Directory Product Our Data Clients Pricing Use Cases Sales Recruiters Use Cases Sales Recruiters Features Chrome Extension Search Portal API Email Campaigns Integrations Data Enrichment ContactSheets Company About Us Careers Contact Us Legal Terms of Use Privacy Privacy Policy Do Not Sell My Info Resources How to use ContactOut Knowledge Base How to Start a Startup Recruitment Mastery Hub Cold Email Mastery Hub Sales Mastery Hub Founder's Blog Legal Terms of Use Privacy Privacy Policy Do Not Sell My Info"
    },
    {
      "url": "https://www.bowenyardwh.com/events",
      "text": "Events | Bowen Yard top of page Menu Close Home Restaurants History Contact Events Home Restaurants History Contact Events Upcoming Events & Live Music Powered by Home Restaurants History Contact Events More Use tab to navigate through the menu items. Bowen Yard 308 4th St SW Winter Haven, FL contactus@bowenyardwh.com © 2024 by Bowen Yard. Site created by Destroyer Media . Home Restaurants History Contact Events bottom of page"
    },
    {
      "url": "https://www.bowencraggs.com/get-in-touch/",
      "text": "Get in touch | Bowen Craggs Our services Benchmarking Visitor Research Consultancy The Index Current leaders Index Snapshot Index methodology Our thinking Challenges Latest articles Podcast Our research Leadership insights About us Why Bowen Craggs Meet the team Join the team Get in touch Search Home Get in touch Get in touch To discuss how to be part of the Corporate Digital Communications Index and how to achieve excellence in digital communications Work email * Company name * First name * Last name * Job title * Phone number (optional) Message * * denotes a mandatory field Information given here will only be used for the agreed purpose and to send you updates on Bowen Craggs services and upcoming events. Further information about how we process your personal data can be found in our privacy policy Learn about the challenges of corporate digital communications Find out about The Corporate Digital Communications Index For all sales enquiries: Tom Golden Director of Sales & Marketing email: tgolden@bowencraggs.com For PR & media: Scott Payton Chief Executive Officer email: spayton@bowencraggs.com For administration & finance Denise McGrath Head of Finance & Administration email: dmcgrath@bowencraggs.com Bowen Craggs & Co Ltd. Office Address: Bowen Craggs, 60 Grays Inn Road, London WC1X 8LU Registered in England & Wales Company Number: 04467508. VAT number: GB 798 6174 61. Registered address: Accountax House, 420A Streatham High Road, London, SW16 3SN Click here to see our location on Google Maps Bowen Craggs Inc. Office Address: Bowen Craggs, 230 Park Avenue, 3rd Floor West, New York, NY 10169, USA Registered address: 251 Little River Drive, Wilmington, DE, 19808, USA Click here to see our location on Google Maps Want to work with us? Check out our latest job opportunities © Bowen Craggs & Co. Ltd. 2025 Home Our services The Index Our thinking About us Get in touch Our policies and commitments Privacy Cookies Accessibility Hub log-in For commentary on how to be more effective online Subscribe to our newsletter Subscribe to our online effectiveness newsletter Our monthly email provides insights and commentary on the latest developments in corporate digital communications from the Bowen Craggs Index™ Work email * First name * Last name * Job title * Company name * * denotes a mandatory field Information given here will only be used for the agreed purpose and to send you updates on Bowen Craggs services and upcoming events. Further information about how we process your personal data can be found in our privacy policy"
    },
    {
      "url": "https://www.bowenyardwh.com/maritime",
      "text": "Maritime | Bowen Yard top of page Menu Close Home Restaurants History Contact Events Home Restaurants History Contact Events Elevate your seafood dining experience and immerse yourself in the epitome of refined indulgence at this distinguished upscale seafood restaurant. 302 4th St SW ​ (863) 225-2801 ​ Monday – Thursday 11:00am – 10:00pm Friday and Saturday 11:00am – 12:00am Sunday 11:00am – 9:00pm Visit Website Home Restaurants History Contact Events More Use tab to navigate through the menu items. Bowen Yard 308 4th St SW Winter Haven, FL contactus@bowenyardwh.com © 2024 by Bowen Yard. Site created by Destroyer Media . Home Restaurants History Contact Events bottom of page"
    },
    {
      "url": "https://www.bowenyardwh.com/restaurants",
      "text": "Restaurants | Bowen Yard top of page Menu Close Home Restaurants History Contact Events Home Restaurants History Contact Events Dine in Style. MARITIME It's a Raw Bar Revolution. Maritime is an upscale seafood haven where culinary artistry meets coastal perfection. Learn More RIPPLES ICE CREAM RIPPLES isn't just ice cream, it's like a summer vacation by the lake for your mouth. Each scoop is handcrafted from real ingredients right here in our shop; no bulk suppliers and no artificial additives. Learn More ATO At ĀTO, the rice is your canvas... whether you want it as a burrito, or in a bowl; add only the freshest and highest quality ingredients available to make your own edible art. Learn More SOCE MARKET Neighborhood market and quick service restaurant. Serving healthy, fresh food fast. Learn More LAKE HOUSE KITCHEN Vibrantly fresh authentic Mexican food Learn More BG's Indian Kitchen Fast, flavorful Indian eats, made fresh and ready to go! Learn More Home Restaurants History Contact Events More Use tab to navigate through the menu items. Bowen Yard 308 4th St SW Winter Haven, FL contactus@bowenyardwh.com © 2024 by Bowen Yard. Site created by Destroyer Media . Home Restaurants History Contact Events bottom of page"
    },
    {
      "url": "https://visitcentralflorida.org/featured/bowen-yard/",
      "text": "Bowen Yard - Visit Central Florida Skip to content Go to VISIT CENTRAL FLORIDA SPORTS Open main menu Close main menu Deals & Specials Welcome Center Meetings & Conventions Travel Guide Blog Search Search for submit Events See & Do Eat & Drink Stay Cities & Towns Meetings Deals & Specials Facebook Twitter Pinterest Instagram YouTube Bowen Yard Bowen Yard offers a unique blend of dining options, open-air seating, and live entertainment, making it a must-visit destination for locals and visitors alike. Bowen Yard – Downtown Winter Haven’s Vibrant New Food Hall A Culinary Destination in the Heart of Winter Haven Bowen Yard is Downtown Winter Haven’s newest food and event venue, where diverse culinary experiences and community gatherings come together. Located right down from Grove Roots Brewing Co. , Bowen Yard offers a unique blend of dining options, open-air seating, and live entertainment, making it a must-visit destination for locals and visitors alike. Diverse Dining Options Bowen Yard features six distinct eateries, each offering a unique culinary experience: Maritime : An upscale seafood haven specializing in raw bar offerings like oysters and ceviche, alongside non-seafood options such as steak frites and falafel gyros. Enjoy their walk-up bar window for a to-go drink on the lawn. Ripples Handcrafted Ice Cream: A gourmet ice cream shop creating small-batch frozen desserts from scratch, using real ingredients without artificial additives. ĀTO: A creative eatery where rice becomes your canvas, offering customizable sushi burritos and poke bowls made with the freshest ingredients. The Lake House Kitchen: Serving vibrant and authentic Mexican cuisine, this spot brings traditional flavors to a modern setting. Hemingway’s Cuban Kitchen: Offering a modern take on classic Cuban dishes, blending traditional recipes with contemporary flair. SoCe Market : A neighborhood market and quick-service restaurant providing healthy, fresh food options in a cozy setting. Community and Entertainment Beyond its diverse food offerings, Bowen Yard is designed as a communal space for relaxation and entertainment. The venue features a large recreational yard with ample outdoor seating, shaded patios, and areas for games like cornhole. Live music and other events are regularly hosted, creating a lively atmosphere for all ages. ADDRESS 308 4th St SW Winter Haven,  33880 CONTACT INFO contactus@bowenyardwh.com (863) 299-1195 Visit Website LEARN & DISCOVER 5 Great Reasons to Spend a Weekend in Winter Haven Ready to book a family-friendly weekend getaway? Here’s a list of 5 exceptionally fun things to during weekend in Winter... See Details Re-Imagine & Rebuild the World at PLANET LEGOLAND LEGOLAND® Florida Resort in Winter Haven has introduced a world with no rules just pure creativity… PLANET LEGOLAND® opening April... See Details Most Instagram-Worthy Places in Central Florida Trip planning on Instagram is definitely a thing and we love finding new places to take pictures at Central Florida,... See Details Historic Central Florida Sites That Everyone Should See Whether you’re just visiting the area or a lifelong resident of Polk County, there is so much history in and... See Details Dog Friendly Spots in Central Florida We understand that your pets are just as important as your human family members. So we created a list of... See Details Top Brunch Spots in Central Florida If breakfast is the most important meal of the day, then brunch is the most important meal of the week!... See Details Alternative Places to Stay in Central Florida If you’re looking for cheaper places to stay near Disney World or any of the great attractions of Central Florida... See Details Weekend Getaway in Central Florida Lina Greco worked in partnership with Visit Central Florida to create this Weekend Getaway Travel Recap. Weekend Getaway to Central... See Details Top 10 Adrenaline-Rush Activities in Central Florida Central Florida’s Polk County, nestled between Orlando and Tampa, is the ultimate outdoor destination in Florida, and is packed with... See Details Top 10 Reasons to Visit LEGOLAND Florida in 2023 The number one theme park for little kids is opening new attractions and hosting lots of great seasonal events throughout... See Details Subscribe to EMAIL LIST Join our email list and stay up to date with all the great things happening in Central Florida. Notice: JavaScript is required for this content. Facebook Twitter Pinterest Instagram YouTube Central Florida Visitors & Convention Bureau 101 Adventure Court Davenport, FL 33837 1-800-828-7655 © 2025  Central Florida Visitors & Convention Bureau Polk County Savings Polk CVB Where Is Polk County, FL? Contact Us Film & TV Resources Travel Guide Media Professionals Privacy & Accessibility Travel Professionals Asset 2"
    },
    {
      "url": "https://www.publishersweekly.com/pw/by-topic/authors/profiles/article/95349-the-unstoppable-rhys-bowen.html",
      "text": "The Unstoppable Rhys Bowen Self-Pub Jobzone | Login Logout | Subscribe: Log In Logout ADVERTISEMENT Home > Authors > Profiles The Unstoppable Rhys Bowen At age 82, the bestselling author has written 150 books, traveled the world, and palled around with Simon & Garfunkel. And she’s just getting warmed up By Elaine Szewczyk\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t | Jun 21, 2024 Rhys Bowen lives in a cozy house with her husband of 57 years on a hill in Marin County, north of San Francisco, a place with views of Mt. Tamalpais and a yard that’s a favorite stop for hungry deer and rabbits. “I don’t have the lovely English garden I always dreamed of, because the animals eat everything,” the 82-year-old British expat author laments over FaceTime on a late spring afternoon from her media room, which is filled with some of the 150 books for kids, teens, and adults—including 56 mysteries and historical novels—that she’s written since moving to the U.S. in 1967. Equipped with professional lighting and a green screen for book club interviews, the room is much more well-appointed than the comparatively small office where Bowen writes, when she and her husband, John, 90, aren’t at their other home, in Arizona. “I like to feel like I’m in a capsule when I’m writing,” Bowen says. “I’m easily distracted and need silence. But I have a husband who tends to come in and say things like, ‘Where did we put those insurance papers?’ There have been times when I’ve wanted to kill him, but we’re still together.” Revered for her witty prose and irresistible dialogue, Bowen is like the protagonists in her novels: clever, fun, and a pleasure to be around. Her staggering literary output includes the Royal Spyness and the Molly Murphy historical mystery series —the latter of which she cowrites with her daughter Clare—and several standalone historical novels. Her books have sold nearly 10 million copies, in more than 30 languages, according to the Jane Rotrosen Agency, which represents the author, and have been honored with Agatha, Anthony, and Macavity awards. Bowen’s latest, The Rose Arbor (Lake Union, Aug.), concerns Liz Houghton, an obituary writer in 1960s London whose drab life hits overdrive when she begins investigating the disappearance of a young girl named Lucy. Liz tags along with her roommate, Marisa, a detective with the Metropolitan Police, on a work trip to Dorset, where she learns of the disappearance of three other girls 25 years earlier, during WWII. As Liz digs into the circumstances surrounding the disappearances, her sleuthing takes her to Tydeham, a village that was occupied by the British military during the war and left in ruins. Liz begins to have haunting visions of the girls that make her wonder: is she psychic or just losing it? She isn’t sure, but keeps digging and, as she does, discovers shocking things about Lucy, the other girls, and her own complicated past. The idea for The Rose Arbor came after Bowen read an article about a WWII-era village that had been commandeered by the British military and used as a practice site for the D-Day invasion. “I saw photos of the creepers growing over the destroyed walls and it struck a chord,” she says. “I started thinking about the girls who had been evacuated during the war. Mothers would take their children with a label around their necks to the train station and hand them over. The train would stop in the countryside and kids would get off and a farmer would say, ‘I’ll take that one.’ Often there was no recordkeeping. How many children disappeared or were abused? That was on my mind, too, and it came together that way.” For Bowen, building a novel can be scary. She doesn’t outline or plan, preferring instead to be surprised. “This sounds corny, but the characters come to me,” she says. “I say hello and follow what they do. The first 100 pages are intense—I panic—but then I can see the light and rush ahead.” Strong female sleuths are central. “Female empowerment is important. Women against all odds. Women who’ve been underestimated. I like to bring them into the spotlight.” Danielle Marshall, Bowen’s editor at Amazon Publishing, calls the author the hardest working woman in the business. “She’s delightful, and busy, busy, busy,” Marshall says. “She’s one of the finest authors I’ve ever worked with—and always beautifully dressed.” Born in 1941 in Bath, England, Janet Quin-Harkin took the pen name Rhys Bowen—her Welsh grandfather’s name—when she began writing mysteries in the 1990s. She never liked the name Janet, even as a kid, and often felt lonely growing up. As a teen she wanted to be a movie star and wrote scripts for herself. “They always ended with everybody sobbing,” she recalls. After graduating from the University of London in 1963, where she studied modern languages, Bowen worked at the BBC as a studio manager. It was the Swinging ’60s, and Bowen—who loves to sketch, play the harp, and sing—moonlighted as a folk singer at the legendary club Bungie’s and hung out with Simon & Garfunkel. “I had my white vinyl boots and Vidal Sassoon haircut,” she remembers, “and it was great.” In 1966, tired of dreary London, she moved to Australia to work at the Australian Broadcasting Corporation and met and married her husband—a fellow British expat—whom she followed to San Francisco in 1967. “In Australia, I had visions of dating rugged sheep farmers, and I met this English aristocrat who always wore a tie,” she says. “It was the opposite of anything I intended.” After settling in San Francisco and having four kids, Bowen began writing books for young people—until, she says, “I got burned out on the high school drama”—then turned to mysteries, adding that she always favored cozies over darker noir, which never meshed with her personality. She writes 1,500 words a day, more if it’s going well. “ Madness is the word to describe it,” she says of her schedule, “but I like being busy. Even if my husband and I are at a resort, the first day I can sit with a piña colada, but by the second day I’m going to take out a kayak.” Meg Ruley, Bowen’s agent, says Bowen is a natural storyteller with a special touch. “Whatever book Rhys is writing feels authentic,” Ruley notes. “She has a well of creativity and hasn’t slowed down. In fact, she’s more energized. Send me whatever she’s on.” For Bowen, the spark never fades—for her writing or her life. “I don’t feel old at all,” she says. “I can be walking down the street and think, ‘Oh, that’s a cute guy,’ and then I suddenly think, ‘Don’t be stupid,’ but it doesn’t change.” A lifelong adventure seeker, she has traveled to India, the Himalayas, and Sri Lanka, and while she’s pretty Americanized these days, she still drinks a cup of English tea at four each afternoon, and can’t resist a bit of Marmite. Her astonishing work ethic has brought her tremendous success, but Bowen is wise enough to realize what truly matters in life. “What’s most important are my friends and family,” she says. “In that way, I’ve been very blessed.” Elaine Szewczyk’s writing has appeared in McSweeney’s and other publications. She’s the author of the novel I’m with Stupid . A version of this article appeared in the 06/24/2024 issue of Publishers Weekly under the headline: ADVERTISEMENT More from pw The Big Indie Books of Fall 2025 5 Kitchen Memoirs for Fans of ‘The Bear’ 12 Genre-Stretching Works of Fiction 6 Mysteries to Scratch That ‘White Lotus’ Itch About Us | Contact Us | Submission Guidelines | FAQ | Subscriber Services | Advertising Info | Terms of Use | Privacy Policy | Do Not Sell | Calls for Info | Editorial Calendar | Archives | Press | © PWxyz, LLC. All rights reserved. PUBLISHERS WEEKLY and the PW Logo are trademarks of PWxyz, LLC. News Obituaries Book Deals Financial Reporting Page to Screen Bookselling Publisher News Awards & Prizes Comics Business Deals Shows & Events Cooking People Religion Audio Books Manufacturing Marketing PW Picks Licensing U.S. Book Show Reviews Fiction Mystery/Thriller Sci-Fi/Fantasy/Horror Romance/Erotica Comics Poetry Inspirational Fiction Nonfiction Lifestyle Religion Children's Web Exclusive BookLife Bestsellers Children's Frontlist Fiction Children's Picture Books Hardcover Frontlist Fiction Hardcover Frontlist Nonfiction Top 10 Overall Trade Paper Frontlist Children's Authors Book News Industry News Authors Profiles Interviews Why I Write BookLife Previews Adult Previews Children's Previews Religion Listings On-Sale Calendar Galley Talk Digital Devices Copyright Retailing Conferences Content / e-books Apps Digital Marketplace The Roundup International Deals News Trade Shows Frankfurt Book Fair London Book Fair Bologna Book Fair Sharjah Book Fair China Showcase Translation Database Job Zone Job Moves Find Us Facebook Twitter Instagram LinkedIn PW LinkedIn PW Religion & Spirituality LinkedIn PW School Librarian AI X Stay ahead with Tip Sheet! Free newsletter: the hottest new books, features and more X X Loading... Email Address Password Log In Forgot Password Premium online access is only available to PW subscribers. If you have an active subscription and need to set up or change your password, please click here . New to PW ? To set up immediate access, click here . NOTE: If you had a previous PW subscription, click here to reactivate your immediate access . PW site license members have access to PW ’s subscriber-only website content. If working at an office location and you are not \"logged in\", simply close and relaunch your preferred browser. For off-site access, click here . To find out more about PW ’s site license subscription options, please email Mike Popalardo at: mike@nextstepsmarketing.com . Thank you for visiting Publishers Weekly . There are 3 possible reasons you were unable to login and get access our premium online pages. You are NOT a current subscriber to Publishers Weekly magazine. To get immediate access to all of our Premium Digital Content try a monthly subscription for as little as $15 per month. You may cancel at any time with no questions asked. Click here for details about Publishers Weekly ’s monthly subscription plans. You are a subscriber but you have not yet set up your account for premium online access. Contact customer service (see details below) to add your preferred email address and password to your account. You forgot your password and you need to retrieve it. Click here to retrieve reset your password. Your company has a site license, use our easy login. Enter your work email address in the Site License Portal. Customer Service If you have questions, contact: Email: PublishersWeekly@omeda.com Call:1-800 -278-2991 (outside US/Canada, call +1-847-513-6135) 8:00 am - 4:30 pm, Monday-Friday (Central) To subscribe: click here ."
    },
    {
      "url": "https://www.wmnorthwest.com/kirkland/contactus/",
      "text": "Contact Us - WMNorthwest Skip to content City of Kirkland Residential Apartments/Condos Commercial Facebook You Tube Twitter Recycling Garbage Compost Collection Rates and Billing Pay My Bill Home Contact Us Curbside Garbage, Recycling and Yard / Food Waste Service: Contact the City of Kirkland: Start or stop residential service Inquire about residential billing City of Kirkland - Utility Division 425-587-3150 Email: utilitybilling@kirklandwa.gov 123 Fifth Avenue Kirkland, WA 98033 Send residential payments to: City of Kirkland - Utility Billing PO Box 3865 Seattle, WA 98124-3865 Or, Pay On Line: www.kirklandwa.gov/paymentus Contact WM: To report missed residential collection Increase or decrease garbage or recycling service Order a replacement container Order electronic or bulky waste collection WM Customer Service 425-587-0040 (M-F 7 am - 7 pm, SAT 9 am - 1 pm) Email: WM\n                                    Residential Service Fax: 866-284-1337 Commercial Garbage, Recycling and Billing Commercial Customer Service: Phone: 425-587-0040 (M-F 7 am - 7 pm, SAT 9 am - 1 pm) Email: WM Commercial\n                      Customer Service Fax: 866-284-133 Commercial Billing WM Commercial Billing PO Box 541065 Los Angeles, CA 90054-1065 WM offers an easy way to pay your Commercial garbage bill. More Information ( Commercial Accounts Only) Contact Us Para información en Español For Information Call: 425-587-0040 NEED HELP? CHAT NOW M-F 7 am - 7 pm Sat 8 am - 12 pm We'd Like to Hear From You! Your questions, compliments and comments are important to us. Send us an e-mail. WM Customer Service Report a Problem See an error on the site? Or, ways it can be improved? Let us know - Click here Facebook You Tube Twitter © 2025 WM Intellectual Property Holdings, L.L.C. Site Map Privacy Policy Terms of Use Disputes & Arbitration Accessability Your Privacy Choices California Privacy Notice WM, formerly known as Waste Management, is North America's leading provider of comprehensive environmental solutions. US Privacy Policy Update Effective June 12, 2025 Privacy Policy Close Scroll To Top"
    },
    {
      "url": "https://www.bmbinc.com/contact-us/",
      "text": "Contact Us - Bowen, Miclette & Britt Insurance Agency, LLC (713) 880-7100 Client Access Menu About Us Insurance Services 24/7 Emergency Contact Commercial Insurance Construction Workers’ Compensation Energy Environmental Liability Food and Beverage Healthcare Law Firm Manufacturing Marine Business Public Entities Real Estate Small Businesses Technology Companies Transportation Employee Benefits Compliance Core Coverages Employee Benefit Solutions Human Resource Outsourcing Technological Resources Wellness & Productivity Estate and Business Planning Wealth Transfer Planning Business Planning Personal and Family Life Insurance Audit International Insurance Management Liability Insurance Umbrella Insurance Personal Insurance Approach to Private Insurance Family Office Services High Net Worth Individuals Retirement Planning Our Products Risk Management Claims Monitoring Corporate Legal Consulting Loss Control Services Safety Training Calendar Surety Bonds People Insights Contact Us Contact Us For general inquiries, please fill out the form below. Contact * First Last Company Name Email * Phone Message CAPTCHA Inquiry Disclaimer Please note completion of any request(s) for information does not constitute the purchase of insurance. No coverage may be added, changed or bound as a result of submitting a request for information or quotation of insurance. All coverage must be confirmed by the agency in writing subject to an acceptable signed application meeting the underwriting guidelines of the Insurance Company. 24/7 Emergency Contacts Sheryl Reynaud Claims Manager Mobile: 832-362-9588 Office: 713-802-6108 Paul Cerone Chief Operating Officer Mobile: 713-876-6175 Office: 713-867-5330 Ed Britt President & CEO Office: 713-880-7170 Career Opportunities Bowen, Miclette & Britt is always on the lookout for bright, motivated, and pro-active individuals to fill positions that may become available. Our corporate office is located in Houston, Texas. Please contact us for more information at 713-880-7100 or click here to submit your resume via email . Transparency in Coverage Machine Readable Files This plan year, Bowen Miclette & Britt is using Cigna for its fully insured health plan. For access to Machine-Readable Files about the plan, please visit the carrier’s website. Cigna – Machine Readable Files Locations Texas Houston Corporate Office 2800 North Loop West, Suite 1100, Houston, TX 77092 Local: 713-880-7100 Toll Free: 800-966-5497 Fax: 713-880-7166 Dayton ALLSURANCE AGENCY 110 Sterling Ave, Dayton, TX 77535 Local: 936-257-1700 Fax: 936-257-1701 The Woodlands TECHNICAL ASSURANCE 26623 Oak Ridge Drive, The Woodlands, TX 77380 Local: 281-296-9997 Fax: 281-296-9998 Kingwood DORMER INSURANCE SERVICES 13 North Main St, Kingwood, TX 77339 Local: 281-360-3252 Spring M SURETY SERVICES 26623 Oak Ridge Drive, Spring, TX 77380 Local: 281-602-8892 Arkansas Fort Smith 21 North 2nd Street, Suite 203, Fort Smith, AR 72901 Local: 479-289-6414 Toll Free: 877-722-6936 Fax: 479-709-9493 Florida Maitland 850 Concourse Parkway South Suite 105 Maitland, FL 32751 Local: 407-647-1616 Toll Free: 800-474-5686 Fax: 407-628-1635 West Palm Beach 1555 Palm Beach Lakes Boulevard, Suite 960D, West Palm Beach, FL 33401 Local: 561-712-4699 Toll Free: 866-478-5896 Fax: 561-712-4930 Louisiana New Orleans 1100 Poydras Street Suite 1250, New Orleans, Louisiana, 70163 Local: 504-599-8800 Toll Free: 888-488-7838 Fax: 504-599-8801 Merrimac Marine Insurance, LLC Panama City Beach 14101 Panama City Beach Pkwy. Suite 330 Panama City Beach, FL 32413 Local: 850-534-0083 Toll Free: 800-681-1998 Fax: 888-908-1998 Maitland 850 Concourse Pkwy South Suite 105 Maitland, FL 32751 Local: 407-647-1296 Toll Free: 888-443-4073 Fax: 407-647-4508 www.merrimacins.com Services About Us People Contact Us Commercial Insurance Employee Benefits Risk Management Client Access Texas Houston – HQ 2800 North Loop West Suite  1100 Houston, TX 77092 800-966-5497 Dayton The Woodlands Kingwood Spring 1111 North Loop West Suite 400 Houston, TX 77008 Arkansas Fort Smith Louisiana New Orleans Florida Maitland West Palm Beach Panama City Beach Privacy Policy Sitemap © 2025 All Rights Reserved Bowen, Miclette & Britt Insurance Agency, LLC We use cookies on our website to give you the most relevant experience by remembering your preferences and repeat visits. By clicking “Accept”, you consent to the use of ALL the cookies. Do not sell my personal information . Cookie Settings Accept All Read Our Privacy Policy & Cookie Notice Here Manage consent Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website, anonymously. Cookie Duration Description cookielawinfo-checkbox-advertisement 1 year The cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Advertisement\". cookielawinfo-checkbox-analytics 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\". cookielawinfo-checkbox-functional 11 months The cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Functional\". cookielawinfo-checkbox-necessary 11 months This cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\". cookielawinfo-checkbox-others 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other. cookielawinfo-checkbox-performance 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Performance\". CookieLawInfoConsent 1 year Records the default button state of the corresponding category & the status of CCPA. It works only in coordination with the primary cookie. spcsrf 2 hours This cookie is used for ensuring the security of the website and visitors. This cookie ensures visitor browsing security by preventing cross-site request forgery. viewed_cookie_policy 11 months The cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Functional Functional Functional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features. Cookie Duration Description mailchimp_landing_site 1 month The cookie is set by the email marketing service MailChimp. Performance Performance Performance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. Cookie Duration Description CONSENT 16 years 4 months 21 days 10 hours 21 minutes These cookies are set via embedded youtube-videos. They register anonymous statistical data on for example how many times the video is displayed and what settings are used for playback.No sensitive data is collected unless you log in to your google account, in that case your choices are linked with your account, for example if you click “like” on a video. SPSI session This cookie is used for setting a unique ID for the session and it collects user behaviour on the website during the session. This collected information is used for statistical purposes. _ga 2 years This cookie is installed by Google Analytics. The cookie is used to calculate visitor, session, campaign data and keep track of site usage for the site's analytics report. The cookies store information anonymously and assign a randomly generated number to identify unique visitors. _gat_gtag_UA_130155693_1 1 minute This cookie is set by Google and is used to distinguish users. _gat_gtag_UA_167764500_1 1 minute This cookie is set by Google and is used to distinguish users. _gid 1 day This cookie is installed by Google Analytics. The cookie is used to store information of how visitors use a website and helps in creating an analytics report of how the website is doing. The data collected including the number visitors, the source where they have come from, and the pages visted in an anonymous form. Advertisement Advertisement Advertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads. Cookie Duration Description IDE 1 year 24 days Used by Google DoubleClick and stores information about how the user uses the website and any other advertisement before visiting the website. This is used to present users with ads that are relevant to them according to the user profile. test_cookie 15 minutes This cookie is set by doubleclick.net. The purpose of the cookie is to determine if the user's browser supports cookies. VISITOR_INFO1_LIVE 5 months 27 days This cookie is set by Youtube. Used to track the information of the embedded YouTube videos on a website. YSC session This cookies is set by Youtube and is used to track the views of embedded videos. yt-remote-connected-devices never These cookies are set via embedded youtube-videos. yt-remote-device-id never These cookies are set via embedded youtube-videos. yt.innertube::nextId never This cookie, set by YouTube, registers a unique ID to store data on what videos from YouTube the user has seen. yt.innertube::requests never This cookie, set by YouTube, registers a unique ID to store data on what videos from YouTube the user has seen. Others Others Other uncategorized cookies are those that are being analyzed and have not been classified into a category as yet. Cookie Duration Description adOtr session No description available. cookietest session No description fx_count 2 years No description fx_document_title session No description fx_info 7 days No description fx_referrer 7 days No description fx_uuid 2 years No description mcfxCookiesVersion 2 years No description mcfxVSID 10 minutes No description paddos_frgIO 1 year No description PRLST session No description available. sbtsck 1 day No description available. SPSE session No description available. sp_lit 5 minutes No description available. UTGv2 5 months 27 days No description available. visitorId 1 year No description SAVE & ACCEPT Powered by"
    },
    {
      "url": "https://laltoday.6amcity.com/city/winter-haven-bowen-yard",
      "text": "Downtown Winter Haven's new Bowen Yard development nears completion - LALtoday Topics Business City Culture Events Food History Real Estate Sports Travel and Outdoors Wellness City Guides Live Work Experience Events Jobs Games The Buy Advertise instagram facebook linkedin Menu Topics Business City Culture Events Food History Real Estate Sports Travel and Outdoors Wellness City Guides Live Work Experience Events Jobs Games The Buy Advertise instagram facebook linkedin Search Query Submit Search Show Search Support Us Button Widget Support Us ☕️ Buy us a coffee 🤝 Advertise City Downtown Winter Haven’s new Bowen Yard development nears completion Get ready to “Gather, Eat, Chill” at Bowen Yard in downtown Winter Haven. February 22, 2024 • Rilee Delgado , Connor Jacobson Facebook Twitter Nextdoor Email Copy Link copied Get ready to gather, eat, chill. Rendering by Alexine Polumbo, owner of Aviva Design Studio Meet Bowen Yard, a Winter Haven food and event space coming this spring to the intersection of 4th Street and Avenue D Southwest. According to Beth Evans, director of leasing for developer Six/Ten LLC , the finished project will be similar to The Joinery , but “turned inside out.” In addition to the existing SoCe Market, a new, full-size restaurant and bar and four smaller, synergistic food + drink concepts are also in the works — that means we’re looking at a total of six dining options when Bowen Yard is complete. All six eateries have officially been announced: SoCe Market | Bodega-style eatery with indoor seating and a shaded patio ATO | Sushi burrito + poke bowl spot with a current location in The Joinery Maritime | Seafood and oyster bar The Lake House Kitchen | Classic Mexican fare Hemingway’s Cuban Kitchen | Modern take on Cuban dishes Ripples Handcrafted Ice Cream | Gourmet ice cream + frozen desserts Another angle of Bowen Yard shows angled parking, shaded pedestrian areas, seating, and activities like corn hole. Rendering by by Alexine Polumbo, owner of Aviva Design Studio Between the dining options, patrons can eat, lounge, and enjoy live music on the shared, pedestrian-only outdoor gathering space. Picture this: Shady patios, lounging and dining furniture, and string lights. Did we mention it’s going to be pet-friendly? Evans says patrons will be able to walk with their alcoholic beverages from space to space within Bowen Yard thanks to special permitting obtained by Six/Ten. Read: Grab your favorite cocktail and start up a game of cornhole with your friends. Click through our gallery below for progress photos of the development. 1 / 7 Photos via Six/Ten LLC 2 / 7 Photos via Six/Ten LLC 3 / 7 Photos via Six/Ten LLC 4 / 7 Photos via Six/Ten LLC 5 / 7 Photos via Six/Ten LLC 6 / 7 Photos via Six/Ten LLC 7 / 7 Photos via Six/Ten LLC An opening date is still TBA, but Six/Ten says Bowen Yard will open around April or May. What are you most looking forward to? Tell us in our survey . Facebook Twitter Nextdoor Email Copy Link copied The Buy Home Why we like the Dyson V12 Cordless Vacuum — plus, a coupon code for HSN September 7, 2025 · Sarah Leonhardt The Buy Pilates gear that make a big difference in your workout September 4, 2025 · Victoria Bardega Home Cozy fall essentials from Home Shopping Network to refresh your home on a budget August 28, 2025 · Staff Shop The Buy More from LALtoday Food Dine on history at Lakeland’s oldest restaurants Take a bite of Lakeland’s past at these restaurants that have stood the test of time. September 9, 2025 · Connor Jacobson Travel and Outdoors Meet 5 prehistoric creatures who once roamed Polk County Millions of years ago, marine animals, mammals, and reptiles called Florida home. Learn about five whose fossils have been found in the Bone Valley area of Polk County. September 8, 2025 · Connor Jacobson Weather Fall weather forecast for Lakeland Prepare for fall weather in Lakeland, Florida with these seasonal temperature and precipitation outlooks. September 8, 2025 · Staff New to Lakeland How to find a new doctor in Lakeland This city boasts top-ranked medical providers and specialty services. Our comprehensive guide will help you find the care you need — whether you’re new to town or just looking around. September 4, 2025 · Victoria Bardega Work What you need to know about flying out of Lakeland Linder International Airport We’re here to make your flying process plane and simple. September 3, 2025 · Staff 4 Spirit Halloween stores come to the Lakeland area The store finds vacant retail spaces and signs temporary leases to set up shop leading up to Halloween — but locations can change each year. September 2, 2025 · Michael Beausoleil City Lakeland library features you didn’t know existed Check out a book, then check out these unique library features that cardholders can enjoy. September 2, 2025 · Connor Jacobson Events Stack your calendar with monthly events around Lakeland These events bring together your favorite vendors on the same day each month in nearby downtown areas and historic districts. August 28, 2025 · Connor Jacobson City Top Clicks: Here’s what you loved in LALtoday last month We keep an eye on your clicks to make sure LALtoday is always filled with content you love. August 28, 2025 · Danielle Johnson Events Plan Ahead: Don’t miss these events happening in Lakeland Bookmark this guide for a curated list of events taking place each month that we’re most looking forward to. August 27, 2025 · Staff Resources Subscribe Advertise Newsletter Archive About Us Careers Contact Us Legal Privacy Policy Please ensure Javascript is enabled for purposes of website accessibility © 6AM City Inc. 2025. All rights reserved. twitter instagram facebook linkedin"
    },
    {
      "url": "https://www.bowenyardwh.com/lakehousekitchen",
      "text": "Lakehouse Kitchen | Bowen Yard top of page Menu Close Home Restaurants History Contact Events Home Restaurants History Contact Events Vibrantly fresh authentic Mexican food 308 4th St SW ​ Sun-Thursday 10-8pm Fri & sat 10-10pm Visit Website Home Restaurants History Contact Events More Use tab to navigate through the menu items. Bowen Yard 308 4th St SW Winter Haven, FL contactus@bowenyardwh.com © 2024 by Bowen Yard. Site created by Destroyer Media . Home Restaurants History Contact Events bottom of page"
    },
    {
      "url": "https://www.bowenyardwh.com/",
      "text": "The Bowen Yard | food hall | 308 4th St SW, Winter Haven, FL 33880, USA top of page Menu Close Home Restaurants History Contact Events Home Restaurants History Contact Events something for everyone Explore Subscribe to our newsletter Email * Yes, subscribe me to your newsletter. Submit Home Restaurants History Contact Events More Use tab to navigate through the menu items. Bowen Yard 308 4th St SW Winter Haven, FL contactus@bowenyardwh.com © 2024 by Bowen Yard. Site created by Destroyer Media . 312 4th St SW 312 4th St SW 312 4th St SW 316 4th St SW Home Restaurants History Contact Events bottom of page"
    },
    {
      "url": "https://www.biography.com/actors/a83896298/bowen-yang",
      "text": "Bowen Yang - SNL, Podcast & Career Search Newsletter History - Culture Musicians Athletes Movies - TV Artists Power - Politics Business Scientists Scholars - Educators Activists True Crime BIO Buys Privacy Notice Terms Of Use Skip to Content History & Culture Musicians Athletes Movies & TV Newsletter Charlie Sheen’s Addiction Lainey Wilson Rupert Murdoch Howard Stern Elvis & Tom Parker’s Feud Famous Actors Bowen Yang Bowen Yang Bowen Yang is a comedian, actor and podcaster who is the first Chinese-American cast member of 'Saturday Night Live.' By Biography.com Editors Updated: Jun 21, 2024 1:09 PM EDT Photo: Mary Ellen Matthews/NBCU Photo Bank/NBCUniversal via Getty Images via Getty Images // Getty Images We may earn commission from links on this page, but we only recommend products we back. (1990-) Jump to: Who Is Bowen Yang? Early Life and Family Conversion Therapy and Aftermath College and Early Comedy Career 'Saturday Night Live' TV and Video Podcasts Quick Facts: Who Is Bowen Yang? Bowen Yang was born in Australia in 1990 and grew up in Canada and Colorado. He is the first Chinese-American cast member of Saturday Night Live , as well as the first gay man to be part of the show for more than one season. Yang brought a new perspective to SNL , often performing in and/or writing scenes in which queerness is incorporated into characters without being used as a punchline. Yang is also known for his work on the podcast Las Culturistas and has appeared on several television shows, including a regular role on Awkwafina Is Nora From Queens . Early Life and Family Bowen Yang was born in 1990 in Brisbane, Australia. Yang's family left China for Australia so his father could pursue a doctorate in mining engineering. Because Yang has an older sister, he's noted , \"I wouldn’t have been born if my parents had stayed in China,\" due to the one-child policy in effect at the time. Yang's mother was a gynecologist in China. Yang grew up speaking Mandarin at home and going to Chinese Sunday school with his sister. When he was young, Yang relocated with his family from Australia to Canada, where they lived outside Montreal. The family moved to the Denver suburb of Aurora when Yang was 9 . There, he became a devoted fan of Saturday Night Live . Yang attended Smoky Hill High School and was part of an improv troupe known as Spontaneous Combustion. Before graduating high school in 2008, he was voted \"Most Likely to Be a Cast Member on Saturday Night Live .\" Conversion Therapy and Aftermath When Yang was 17, he left a chat window open on a shared family computer that alerted his parents to the fact their son was gay. Yang told The New York Times what happened next: \"They just sat me down and yelled at me and said, 'We don't understand this. Where we come from, this doesn't happen.'\" \"I had never seen my dad cry before up until that point,\" Yangshared with GQ . \"And I was coming home from school every day to him sobbing.\" Yang's parents set up conversion therapy sessions in Colorado Springs, a two-hour drive away, and he agreed to go. He said of the experience, \"It was just crazy. Explain the gay away with pseudoscience.\" After completing the course of conversion therapy, Yang was allowed to attend New York University, where his sister was already a student and could keep an eye on him. During college, Yang again came out to his family. Though their initial reaction was once more unsupportive, he waited until his parents began to accept, or at least live with, his sexuality. \"My dad every now and then will toe that line and be like, You could try women!\" Yang admitted in 2020. \"And I'm like… Don't. It's almost an endearing kind of homophobia, if such a thing exists.\" Today, Yang maintains a strong relationship with his family. They have vacationed together, and his parents are proud of his success on Saturday Night Live . \"They know that that job has been hard won for me, and that it means a lot, and it means a lot to them too,\" Yang said in 2021. \"They think, 'Wow, he pulled it off.' And my mom said to me recently, she was like, 'Bowen you're very lucky to be doing this.' And I was like, 'I know, mom.'\" College and Early Comedy Career Yang was a pre-med chemistry major at New York University, inspired in part by the TV drama Grey's Anatomy . However, he continued to do comedy while in school. Instead of heading to medical school after graduating, Yang became a graphic designer and pursued his comedy career via auditions and shows. 'Saturday Night Live' In 2018, Yang started as a writer for season 44 of Saturday Night Live . That season he also stepped in front of the camera to appear as North Korean dictator Kim Jong-un . In 2019, Yang's work on SNL resulted in an Emmy nomination for Outstanding Writing for A Variety Series. Yang became a featured player for the following season of SNL , making him the first Chinese-American cast member in the show's history. The characters he portrayed included politician Andrew Yang and a Chinese trade representative known as Trade Daddy. Yang remained a featured player in the 2020-21 season. He contributed to memorable sketches such as \"Pride Month Song,\" about the tribulations members of the LGBTQ+ community can face in June. In March 2021, he spoke out against violence against Asian Americans on Weekend Update. In July 2021, Yang became the first featured cast member of SNL — as opposed to the show's more established repertory players — to receive an Emmy nomination as Outstanding Supporting Actor In A Comedy Series. The episode he submitted for awards consideration was from April 2021, in which he portrayed the iceberg that sank the Titanic , who was promoting an EDM fantasia album. At the start of Saturday Night Live 's 2021-22 season, Yang was elevated from featured to repertory cast member. He's said of his time on the show, \"I thought going in that I had to have this very broad, very palatable sensibility that works for everybody, but then the stuff that I'm the most proud of, and probably even got the most success from, was outwardly an expression of queerness or gayness. That’s been a nice surprise.\" Instead of focusing on his own success in breaking barriers on SNL , Yang said in an interview with NPR in 2021, \"I kind of don't really care about how my tenure on the show is perceived in any particular way, other than…I want this to facilitate something better for the next person.\" TV and Video Yang portrays Awkwafina 's cousin on her TV series Awkwafina Is Nora From Queens . He has guest starred on shows like High Maintenance , Broad City and Girls5eva . In 2016, he appeared on the second season of the web series The Outs . Yang was known for sharing lip-sync videos on social media. His subjects have ranged from Tyra Banks on America's Next Top Model to Sandra Oh 's work as Dr. Cristina Yang on Grey's Anatomy . Podcasts Yang began making the podcast Las Culturistas , which delves into pop culture, with his friend and co-host Matt Rogers in 2016. In 2021, Yang joined an impressive roster of queer performers, including Cynthia Nixon , Jane Lynch, Margaret Cho and Tony Kushner, in the scripted podcast Hot White Heist . He starred as a gay man who partners with a lesbian cult to break into a top-secret sperm bank. Quick Facts: FULL NAME: Bowen Yang BORN: November 6, 1990 BIRTHPLACE: Brisbane, Queensland, Australia﻿ Fact Check We strive for accuracy and fairness.If you see something that doesn't look right, contact us !﻿ Biography.com Editors Staff Editorial Team and Contributors The Biography.com staff is a team of people-obsessed and news-hungry editors with decades of collective experience. We have worked as daily newspaper reporters, major national magazine editors, and as editors-in-chief of regional media publications. Among our ranks are book authors and award-winning journalists. Our staff also works with freelance writers, researchers, and other contributors to produce the smart, compelling profiles and articles you see on our site. To meet the team, visit our About Us page: https://www.biography.com/about/a43602329/about-us Watch Next Advertisement - Continue Reading Below Famous Actors Inside Charlie Sheen’s Addiction Struggles Charlie Sheen Kathy Bates Almost Retired. Then Came ‘Matlock.’ Steve Martin’s Life and Career in Photos Advertisement - Continue Reading Below Judy Garland Bruce Willis Did Shirley Temple Almost Play Dorothy? Aubrey Plaza Opens Up About Grief in New Interview Kevin Costner Patrick Swayze: The Freak Injury That Nearly Derailed His Dancing Career Matthew Perry Chris Pratt Advertisement - Continue Reading Below About Biography.com Newsletter Contact Us Other Hearst Subscriptions A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2025 Hearst Magazine Media, Inc. Site contains certain content that is owned A&E Television Networks, LLC. All Rights Reserved. Biography and associated logos are trademarks of A+E Networks®protected in the US and other countries around the globe. Privacy Notice Terms of Use CA Notice at Collection DAA Industry Opt Out Your CA Privacy Rights/Shine the Light Cookies Choices"
    },
    {
      "url": "https://bowen.co.nz/contact/",
      "text": "Contact Us - Bowen Hospital Careers Contact eAdmissions Log in Make a Payment Patients & Visitors For Patients Your Admission Information Your Journey With Us Forms & Resources Payment Information FAQs Feedback For Visitors Patient Services Audiology Bisson Plastic Surgery Bowen Eye Clinic Bowen Icon Cancer Centre Endoscopy at Bowen Gynaecology Ophthalmology Robotic Orthopaedic Surgery Pacific Radiology at Bowen Hospital How We Help Our Specialties Our Services Our Facilities Our Difference Our Specialists Find a Specialist GPs & Specialists Specialist Hub Incredible Partnerships Our Difference Innovation How We Help You Our Specialties Our Facilities Our Difference For GPs Education Our Specialists Find a Specialist About About Bowen About Us Our History Our Team Quality Contact Us Updates News Media Join Us Careers Holidays Act Former Employee Remediation Information × Contact Us Bowen Hospital Please note we do not have an Emergency Dept at Bowen Hospital.  Please contact 111 in an emergency. Address Bowen Hospital, 98 Churchill Drive, Crofton Downs, Wellington 6035, New Zealand Phone +64 4 479 2069 Fax +64 4 479 8520 Bowen Hospital is situated on Churchill Drive in the suburb of Crofton Downs, approximately 3km north of Wellington City, on the main road between Wilton and Ngaio. It is easily accessible by train and bus. The closest bus stop to the centre is Stop 4137 – Churchill Drive near Bowen Hospital and is a short two minute walk to Bowen Icon Cancer Centre. Bus and train timetables can be viewed through www.metlink.org.nz Bowen Specialist Centre Bowen has a wide variety of specialists consulting on the campus. Many are surgeons who also operate at the hospital. Bowen Icon Cancer Centre Bowen Icon Cancer Centre is dedicated to delivering world-class private cancer treatment and personalised support. Address 98 Churchill Drive, Crofton Downs, Wellington Phone +64 4 479 2019 Fax +64 4 479 8563 Email spec@bowen.co.nz Address Level B3, Bowen Specialist Centre, 98 Churchill Drive, Crofton Downs, Wellington 6035 Phone +64 4 896 0200 Fax +64 4 896 0201 Bowen Specialist Centre Bowen has a wide variety of specialists consulting on the campus. Many are surgeons who also operate at the hospital. Bowen Icon Cancer Centre Bowen Icon Cancer Centre is dedicated to delivering world-class private cancer treatment and personalised support. Address 98 Churchill Drive, Crofton Downs, Wellington Phone +64 4 479 2019 Fax +64 4 479 8563 Address Level B3, Bowen Specialist Centre, 98 Churchill Drive, Crofton Downs, Wellington 6035 Phone +64 4 896 0200 Fax +64 4 896 0201 Make an enquiry If you have a question or enquiry that is not urgent, feel free to contact us through the contact form below. We will get back you as soon as we can. Δ Name * Email * Message * Submit Contact Bowen Hospital, 98 Churchill Drive, Crofton Downs, Wellington 6035 +64 4 479 2069 Patients & Visitors Your Admission Information Your Journey With Us Find A Specialist Our Facilities Our Services Your Rights GPs & Specialists Specialist Hub Innovation Facilities For Specialists Education About Us Careers Sustainability Quality Contact Us Updates News Media Proudly part of Copyright © 2023 Evolution Healthcare – All Rights Reserved. No information or material can be copied or distributed without our express permission. Privacy Policy Terms & Conditions"
    }
  ]
}