{
  "fuentes": [
    {
      "url": "https://www.bpbrewing.com/events",
      "email": "info@bpbrewing.com"
    },
    {
      "url": "https://www.tpkbrewing.com/",
      "email": "info@tpkbrewing.com"
    },
    {
      "url": "https://www.tpkbrewing.com/",
      "email": "info@tpkbrewing.com"
    },
    {
      "url": "https://cumberlink.com/news/local/communities/carlisle/back-porch-to-business-carlisle-brewery-plans-opening-after-two-year-renovation-process/article_f5824690-a274-11ed-a2a7-876e744b4ebd.html",
      "email": "mseiler@cumberlink.com"
    },
    {
      "url": "https://backporchbrewinginc.com/contact",
      "email": "flags@2x.png"
    },
    {
      "url": "https://backporchbrewinginc.com/contact",
      "email": "info@backporchbrewinginc.com"
    },
    {
      "url": "https://www.bpbrewing.com/contact",
      "email": "info@bpbrewing.com"
    },
    {
      "url": "https://www.blockbrewingcompany.com/contact-us/",
      "email": "info@blockbrewingcompany.com"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "email": "accounts.payable@parkwaybrewing.com"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "email": "events@parkwaybrewing.com"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "email": "grant@parkwaybrewing.com"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "email": "kim@parkwaybrewing.com"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "email": "mic@parkwaybrewing.com"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "email": "mike@parkwaybrewing.com"
    },
    {
      "url": "https://www.rockinghambrewing.com/about-us",
      "email": "info@rockinghambrewing.com"
    },
    {
      "url": "https://www.rockinghambrewing.com/about-us",
      "email": "west@rockinghambrewing.com"
    },
    {
      "url": "https://www.bpbrewing.com/our-story",
      "email": "info@bpbrewing.com"
    }
  ],
  "mails": [
    "accounts.payable@parkwaybrewing.com",
    "events@parkwaybrewing.com",
    "flags@2x.png",
    "grant@parkwaybrewing.com",
    "info@backporchbrewinginc.com",
    "info@blockbrewingcompany.com",
    "info@bpbrewing.com",
    "info@rockinghambrewing.com",
    "info@tpkbrewing.com",
    "kim@parkwaybrewing.com",
    "mic@parkwaybrewing.com",
    "mike@parkwaybrewing.com",
    "mseiler@cumberlink.com",
    "west@rockinghambrewing.com"
  ],
  "nombre_sitio": "bpbrewing.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.bpbrewing.com/events",
      "text": "Events — Back Porch Brewing Co. | Venice, FL 0 Skip to Content Order Online Food Beer on Tap Events Our Story Contact Open Menu Close Menu Order Online Food Beer on Tap Events Our Story Contact Open Menu Close Menu Order Online Food Beer on Tap Events Our Story Contact EVENTS We offer a variety of events at the Brewery in Venice, Florida. Weekly Beer Releases! Check out our Facebook and Instagram for new releases Fall Promotion All Day Monday Pints & Bites $16 for a choice of a Sando, Panini, or Salad and a Pint of Beer *applicable taxes will apply, applies to pints $7 and under, no substitutions Oktoberfest at Back Porch Saturday, September 27th Our annual Oktoberfest Event Featuring 3 Special German Beers Beer braised bratwurst and housemade pickled cabbage Music with Petra and Teresa 2-5pm Get off your rocker, don’t miss out on the biggest celebration this fall! Stay tuned for more events! If you’re interested in hosting an event at Back Porch Brewing, corporate meeting, social get together, showers, birthdays, community events, just contact our event coordinator and we’ll help you plan a great time. Contact Our Events Coordinator Brett on Facebook “I never knew about this place, until my brother was visiting and found it on google. I’ve been back 3 more times since. Great selection of wine, and craft beer. I’m a picky IPA drinker, so I usually start with a flight, then pick my favorite..” Erick on Facebook “Wow! What a place, first I want to give a shout out to our bartenders… They were very knowledgeable in their products, super nice and friendly.. The beer was great, the panini sandwich was the bomb.. That orange jelly jam on the sandwich was amazing!! BEER ON TAP EVENTS OUR STORY CONTACT HOURS Monday-Thursday 12pm-9pm Friday-Saturday 12pm-10pm Sunday 12pm-8pm LOCATION 3469 Precision Drive North Venice, Florida 34275 Located directly off the highway 941-218-4156 Directions ©2024 Back Porch Brewing Co. All online orders must be picked up the same day they are ordered. Thank you!"
    },
    {
      "url": "https://www.tpkbrewing.com/",
      "text": "Welcome | TPK BREWING CO. top of page ABOUT OUR STORY OUR MISSION OUR STAFF PAST NEWSLETTERS TAVERN FOOD TAPLIST COCKTAILS ZERO PROOF WINE & CIDER GIFT CARDS MERCH GAMING BOOK A GAME MEET THE GMS CORPORATE BOOKINGS PUBLISHED CONTENT WELCOME TO TPK EVENTS SPECIAL EVENTS GAMING CALENDAR FAQS CONTACT More Use tab to navigate through the menu items. Log In > AN ALE FOR EVERY TALE Hail and well met! Welcome to the website of TPK Brewing Co., a craft brewery and public house with a geeky twist! In addition to being your newest, family-friendly neighborhood tavern in Portland, Oregon, we have a full-time staff of professional Game Masters running various tabletop roleplaying games for our patrons. Board game cafes have revolutionized how and where we play board games. We want to bring the revolution to roleplaying games by serving our guests original story content and thematic beer releases. ​ Gaming not your thing? Don't worry, we'll still have exceptional craft beer and food waiting for you. ​ Food by En Vida PDX . ABOUT US Geek Week 2025: Ales & Scales Mon, Sep 01 This year's Geek Week is all about that classic D&D favorite: DRAGONS! Learn more Multiple Dates GM Networking Thu, Sep 11 I'm a Game Master looking to make industry connections. RSVP Ales & Scales Painting Class Mon, Sep 15 Tonight we're painting dragons with Corvid Creations! RSVP Multiple Dates Musicale Monday Mon, Sep 15 Live tavern music for all ages! Learn more Multiple Dates Drop-In Dungeons Presents: Shadowdark Megadungeon Tue, Sep 16 Explore a multi-level megadungeon and massive detailed custom world using Shadowdark RPG. Learn more Multiple Dates Bierstacheln @ TPK Thu, Sep 18 Join us for our twice-monthly beer poking event! RSVP Multiple Dates FWD RPG PNW Presents: Thirsty Third Thursdays Thu, Sep 18 Thirsty Sword Lesbians is a roleplaying game for telling queer stories with friends. If you love angsty disaster lesbians with swords, you have come to the right place. Learn more Ales & Scales Night Market Mon, Sep 22 Celebrate the end of Geek Week 2025 with a night market! RSVP Multiple Dates Bierstacheln @ TPK Wed, Sep 24 Join us for our twice-monthly beer poking event! RSVP Bridge of the Gods Thu, Sep 25 The Leyfarers return to The Drift Peaks to explore a floating landmass that resides in the clouds known as Thunder Island. Buy Tickets Thunder Island Brewing Co Presents: Magic the Gathering Commander Tournament Fri, Sep 26 Join us for our first official Magic tournament, hosted by our friends over at Thunder Island! Buy Tickets Multiple Dates Tabletop Takeover Mondays Mon, Sep 29 Forward RPG PNW is taking over the space for a night of beginner friendly, non-D&D one-shots! Learn more Multiple Dates 5e Character Creation Workshop Thu, Oct 02 I'm looking to make a 5e character, either solo or with friends. RSVP Multiple Dates Tabletop Takeover Mondays Mon, Oct 06 Join us for our monthly Pathfinder Society takeover! Learn more Multiple Dates Musicale Monday Mon, Oct 06 Live tavern music for all ages! Learn more Multiple Dates Drop-In Dungeons Presents: Shadowdark Megadungeon Tue, Oct 07 Explore a multi-level megadungeon and massive detailed custom world using Shadowdark RPG. Learn more Multiple Dates Open Painting Night Mon, Oct 13 We're throwing down the drop cloths and turning our upstairs into a miniature painting haven for the night RSVP Multiple Dates FWD RPG PNW Presents: Thirsty Third Thursdays Thu, Oct 16 Thirsty Sword Lesbians is a roleplaying game for telling queer stories with friends. If you love angsty disaster lesbians with swords, you have come to the right place. Learn more Load More We will keep it secret, we will keep it safe. SUBMIT Please verify your email to join the party, adventurer! SIGN UP FOR THE TPK BREWING CO. NEWSLETTER 5051 SE HAWTHORNE BLVD. PORTLAND, OR 97215 WEDNESDAY - MONDAY 11:00 AM - 11:00 PM TUESDAY 5:00 PM - 11:00 PM (503) 231-6354 INFO@TPKBREWING.COM CODE OF CONDUCT & ACCESSIBILITY PRIVACY POLICY CAREERS Special thank you to Simon Sotelo of Weird Wonderful for our main logo design, Lindsey Shea for our website photography, Alejandra Gutiérrez for our \"An Ale for Every Tale\" slogan design, Elodie Kahler for our building illustration, and Spyder for our Val'Ruvina staff portraits! ​ TPK BREWING CO. and AN ALE FOR EVERY TALE are registered trademarks of TPK Brewing, LLC. ​ Interested in supporting the brewery further? Take a look at our Patron Program here . ​ ​ bottom of page"
    },
    {
      "url": "https://cumberlink.com/news/local/communities/carlisle/back-porch-to-business-carlisle-brewery-plans-opening-after-two-year-renovation-process/article_f5824690-a274-11ed-a2a7-876e744b4ebd.html",
      "text": "Back Porch to Business: Carlisle brewery plans opening after two-year renovation process Skip to main content Skip to main content You are the owner of this article. Edit Article Add New Article Close You have permission to edit this article. Edit Close 57° Log In Subscribe Guest Logout Read Today's E-edition News Local Business Crime Nation & World Politics State Education Markets & Stocks News Tip Obituaries Share a story Recent Obituaries Find an Obituary Archives Sports High School College Penn State Professional Outdoors Casino Opinion Submit a letter Letters Editorials Columnists Cartoons Lifestyles Arts & Theatre Movies & TV Music Local Scene Events Calendar Comics Puzzles Contests Play Food & Cooking Home & Garden Health Parenting Fashion People Pets Travel Faith Join the community News tip Share video Send a story Share a photo Sponsored Content Brand Ave. Studios Print Edition E-edition E-edition Archives Special Sections Buy & Sell Place an Ad Jobs Cars Marketplace Shop Local Public Notices Shopping Customer Service Manage Subscription Activate Digital Subscription Newsletter sign-up Subscribe Contact us Help Center Gift Subscriptions Mobile Apps Weather: Live Radar Facebook Twitter YouTube Pinterest Instagram © 2025 Lee Enterprises Terms of Service | Privacy Policy Subscribe Read Today's E-edition Subscribe Log In Welcome, Guest My Subscription Help Center My Account Dashboard Profile Saved items Logout E-edition News Obituaries Sports Opinion Puzzles Lifestyles Public Notices Jobs 57° Clear Share This Facebook Twitter Bluesky WhatsApp SMS Email Back Porch to Business: Carlisle brewery plans opening after two-year renovation process 0 Comments Share this Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Alert Top Story Carlisle Back Porch to Business: Carlisle brewery plans opening after two-year renovation process Maddie Seiler Feb 2, 2023 Feb 2, 2023 Updated Mar 9, 2024 0 1 of 3 Tables and chairs fill the dining room of Back Porch Brewing at 133 N. Hanover St. in Carlisle. Maddie Seiler Taps line the wall behind the bar of Back Porch Brewing at 133 N. Hanover St. in Carlisle. Maddie Seiler Back Porch Brewing owners Rod Harman, left and Tim Wickard will open their business at 133 N. Hanover St. in Carlisle on Friday. Maddie Seiler Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Maddie Seiler Back Porch Brewing began just there, on Rod Harman’s back porch. Well, technically it began in his kitchen and migrated outside for more space (and perhaps less mess). At 3 p.m. Friday though, the business will officially open its doors at 133 N. Hanover St., in Carlisle, a space Harman leased with long-time friend and Back Porch Brewing co-owner Tim Wickard in 2021. “We’re still friends after two years of renovations,” Wickard joked. Given the opportunity to describe the extensive renovation process to transform the building, which formerly housed Cumberland Valley Bible Book Service, into a fully functional brewery, Wickard used a single word: nightmare. The Sentinel: News New brewery in Carlisle remains under construction with anticipated opening in November Maddie Seiler He and Harman completed the majority of the renovation work themselves, including digging a trench for sewer lines, pouring concrete, installing dry wall and painting ceilings, all while both worked full time at separate jobs. People are also reading… Parents air frustration over canceled bus routes at Cumberland Valley School District Capital Area Intermediate Unit board removes Big Spring representative Vietnamese pho restaurant makes Carlisle debut Woman sentenced to 10.5 to 21 years for human trafficking as DA's office announces another prostitution sting 'A sad day': Mechanicsburg hardware store to close after 117 years Philly cheesesteak, roast pork restaurant opens in Mechanicsburg South Middleton School District continues to see higher numbers of English language learners High School Football: Week 3 final score, coverage recap (Sept. 5) New Cumberland marketer aims to rebuild trust in industry by helping small businesses List of 2025 fall festivals in Cumberland County Food Review: Don't miss Oak Grove Farms' hot bar in Monroe Township Carlisle school district looks to engage more with parents of LeTort, Mount Holly Springs students Carlisle therapist starts groups focused on men's mental health AI data center developers to hold outreach meeting Tuesday in Middlesex Township Cumberland County Children & Youth exceeded its expense budget by $3.4 million in 2024-25 “We have to balance how much time we spend at the brewery [and] we have to balance spending time with our families,” Harman said. “So it’s been quite a challenge.” Wickard said the most difficult part was bringing the space up to compliance with fire codes, specifically regarding the installation of a two-hour fire rated ceiling. It took eight months to find a suitable system, he said. “I came into this project a little naïve, thinking, I’m just gonna throw up a couple of walls and put a bathroom in and a kitchen, and we’re going to serve beer,” Wickard said. “It just didn’t work that way.” While the process extended beyond Back Porch Brewing’s anticipated opening in November, Wickard and Harman wrapped up the building’s finishing touches for code compliance last week, just in time to open. Midstate Digital Communities Out of the ashes: Newville's Whiskers Brewing opens first floor after February fire Maddie Seiler Harman said he’s always had a desire to open his own restaurant. “I never thought it was gonna be like, this big. ... I was looking at something very small,” he said. “But I’ve had a passion for craft beer, and got him (Tim) into the craft beer scene several years ago and I said, ‘I would love to own my own brewery,’ and he said, ‘Let’s go for it.’” On the cusp of opening, Harman doesn’t think it will sink in that Back Porch Brewing is open until the first customer walks through the door and drinks the first beer. Having never managed a restaurant, Wickard said he’s both nervous and excited. “I’m excited to see the end result,” he said. “You know, we’ve put a lot of blood, sweat and tears into this place, and to see that first customer come through the door and hopefully to see every seat sat in, is ... it’s just overwhelming.” Back Porch Brewing will have a limited food and drink menu for the first two weekends of February, featuring craft beer, including lagers, ales, stouts and porters and appetizers only. These include onion rings, fries, tater kegs and fried pickles. Beer for the first two weekends will cost $5.50 per pint or $9 for a flight of four. The business will also operate on limited hours for the first two weekends and will be open from 3 p.m. to 11 p.m. Friday, noon to 11 p.m. Saturday, and noon to 9 p.m. Sunday. On the third week of February, open hours will expand to include 3 p.m. to 10 p.m. Wednesday and Thursday. Food options down the road will include burgers, chicken sandwiches and pulled pork, or as Wickard described them, items you can grill on a back porch. In the future, Back Porch Brewing also hopes to offer gluten-free beers, along with homemade sodas, sours and seltzers. “We want to have something for everybody, but the main goal is to have plenty of beer for all beer drinkers,” Wickard said. IPAs to Pilsners: The best beer of every type IPAs to Pilsners: The best beer of every type In 1956, archaeologists working in northern Israel’s Raqefet Cave—once home to the Natufian people (13,050–7,550 B.C.)—stumbled upon an astonishing discovery : 13,000-year-old fermented gruel. Archaeologists had found prehistoric evidence of beer before in the remnants of ancient brewing that have surfaced in China, Mesopotamia, and North Africa. But this was the oldest—and it was the oldest to a great extent. The beer residue—a thin gruel-type beer—found in Raqefet Cave precedes other archaeological evidence by at least 5,000 years. For as long as humans have farmed cereals like wheat, barley, and rice, humans have fermented at least some of it into beer . The Mesopotamians produced beer from bread and documented its ritual consumption on stone tablets. Ancient Egyptians, who recorded the world’s first beer recipe on papyrus scrolls, drank it during religious ceremonies. The Nubian culture in the central Nile River Valley used beer as an antibiotic . In 2,100 B.C., Babylonian King Hammurabi enshrined regulations for tavern keepers and brewers in his famous Code of Hammurabi. Beer became so inextricably linked to the ancient grain-growing civilizations of Europe, Asia, the Middle East, and North Africa that the Greek writer Sophocles (450 B.C.) considered beer, alongside vegetables, meat, and bread, to be a vital component of a healthy diet. (In an era when the average Greek lived about 35 years, Sophocles, it should be noted, lived to the ripe age of 90.) Fast forward many centuries and beer production is now an exacting science comprising complex flavor profiles, exotic additives, carefully measured formulas, and humongous sterilized stainless-steel vats. Gone is the thick, syrupy brew favored by Germanic tribes and disdained by Ancient Romans. Instead, breweries nowadays turn out flavorful, easy-drinking beers. Long evolved from the Natufians' fermented gruel, modern beer satisfies a range of tastes for a global market. Beer styles are distinguished by three key factors: color (pale to dark), hoppy bitterness (0 to 100 International Bitterness Units, or IBU), and alcohol content (3% to 20% alcohol by volume). From classic to cultured bacteria, Stacker identified 35 different styles and used BeerAdvocate’s sweeping database of craft brews to determine the best individual beers among them. The ratings and rankings are accurate as of March 2021. From Canada to Belgium, read on to find the best beers of every style, then go out and make old Sophocles proud. You may also like: Best beers from every state You may also like: Superfoods that have been used by other cultures for generations Alexey Andr Tkachenko // Shutterstock Russian imperial stout - Beer: Marshmallow Handjee - Brewery: 3 Floyds Brewing Co. (Indiana) - ABV: 15% - Beer Advocate score: 100 - User score: 4.81 Higher in alcohol than its American and British counterparts, the complex and bold Russian imperial stout was first brewed in England for Peter the Great during a sojourn in the Isles. The curiously named, barrel-aged with vanilla beans, 15% ABV Marshmallow Handjee is a love-it-or-hate-it beer with many reviewers claiming that it’s overwrought, which is kind of a hallmark of Russian imperial stouts. Bernardo Couto // Shutterstock New England IPA - Beer: Heady Topper - Brewery: The Alchemist (Vermont) - ABV: 8% - Beer Advocate score: 100 - User score: 4.76 The style that put American craft brewing on the map, hoppy with a hint of citrus coupled with a hazy-golden hue, high IBU, and medium-high ABV defines a true New England IPA. British colonialists fortified their ales with extra hops for the long trip to India, and thus India pale ale was born. American brewers said, “Hold my beer,” and went out and doubled or tripled the number of hops used in a standard IPA. Enter the New England IPA. The 8% ABV Heady Topper from Vermont’s Alchemist is a double-hopped masterpiece exuding notes of grapefruit and pine. AdamChandler86 // Flickr Imperial IPA - Beer: Pliny The Younger - Brewery: Russian River Brewing Company (California) - ABV: 10.3% - Beer Advocate score: 100 - User score: 4.75 On the high end of both the IBU and ABV scales, imperial IPAs appear reddish to yellowish and are the strongest, hoppiest version of an IPA. Pliny the Younger, from Northern California’s Russian River Brewing, sits at 10.25% ABV and elicits much love from reviewers who report “flavors of pine, resin, citrus, herbal and earthy” and an overall experience that was “so smooth and so intense.” Brandon Burke // Flickr Lambic - Beer: Zenne Y Frontera - Brewery: Brouwerij 3 Fonteinen (Belgium) - ABV: 7% - Beer Advocate score: 100 - User score: 4.74 A traditional lambic, born in Belgium, is reddish-gold in appearance and mildly bitter with medium ABV. The 7% ABV Zenne y Frontera is meant to blur the lines between wine and beer—it’s aged for 12 months in 40-year-old oak casks and is the result of a collaboration between a brewmaster and sommelier. Reviewers have responded in kind with references to it being “the best lambic” and “my favorite beer...ever.” Alexey Pevnev // Shutterstock American wild ale - Beer: Westly - Brewery: Sante Adairius Rustic Ales (California) - ABV: 8.5% - Beer Advocate score: 100 - User score: 4.69 Wild, naturally occurring yeasts introduced through inoculated oak barrels or sour mash give this rustic beer its name, which is medium-high in ABV and medium-low in IBU. The environmental yeast should lend an earthy, “farmhouse” taste. Flavor profiles vary dramatically and are often complex, exemplified by the 8.5% ABV Westly from the Sante Adairius Rustic Ales brewery in Santa Cruz, California, which pushes apricots during a super-long barrel-aging process. You may also like: IPAs to Oktoberfest: the best beer of every type Bashutskyy // Shutterstock Saison - Beer: Ann - Brewery: Hill Farmstead Brewery (Vermont) - ABV: 6.5% - Beer Advocate score: 100 - User score: 4.68 Traditionally a summer treat brewed in simple Belgian farmhouses, the golden-hued and medium-low in bitterness Belgian Saison is brewed year-round now. ABV varies greatly among Saisons, but the wine-barrel-aged Ann from Hill Farmstead Brewery packs a punch at 6.5%, which has reviewers praising it as “super flavorful” and “exceptional.” AdamChandler86 // Flickr English barleywine - Beer: Aaron - Brewery: Hill Farmstead Brewery (Vermont) - ABV: 9% - Beer Advocate score: 100 - User score: 4.63 Barley wines don’t mess around: These copper-red sipping beers reach double digits on the ABV scale, hit medium-high in bitterness, and are often barrel-aged like their grape-based namesake. However, Aaron from Hill Farmstead Brewery is low in ABV at 9% and is bottle-aged, but reviewers love its “flavors of caramel, brown sugar, dates, raisins, butterscotch” and applaud the “complex and smooth” experience. Steven Guzzardi // Flickr American pale ale - Beer: Zombie Dust - Brewery: 3 Floyds Brewing Co. (Indiana) - ABV: 6.2% - Beer Advocate score: 100 - User score: 4.62 Golden-red in appearance, a classic American pale ale offers hints of citrus and pine with medium bitterness and a low ABV. Zombie Dust ignores tradition (some reviewers claim this should be classified as an IPA) by going big on ABV at 6.2% and intensely hoppy like its British cousin, better known as an extra-special bitter or ESB. Scott Maurer Milk stout - Beer: Moment Of Clarity - Brewery: Tree House Brewing Company (Massachusetts) - ABV: 7.7% - Beer Advocate score: 100 - User score: 4.55 Once on the verge of extinction, the creamy and sweet milk stout originated in 19th-century England when blue-collar workers added whole milk to their lunchtime stout porters. Milk stouts trend toward the medium-high end of the ABV scale and Tree House Brewing’s Moment of Clarity is no exception at 7.7%. Reviewers cite its “perfectly balanced chocolate, coffee, & maple” flavors and a “beautiful pour... inky black and oily with 1.5 fingers of brownish head.” siamionau pavel // Shutterstock Oatmeal stout - Beer: Breakfast Stout - Brewery: Founders Brewing Company (Michigan) - ABV: 8.3% - Beer Advocate score: 100 - User score: 4.55 First brewed in the mid-1800s, oatmeal stouts were once believed to be a remedy for sickness and were often prescribed to nursing mothers and sick children on account of their “healthy” properties. While there is a degree of truth to the fact that the addition of oats does make these beers slightly healthier, we still wouldn’t recommend them to those suffering from a stomach bug. Founders Brewing Company’s Breakfast Stout, brewed with oats, two types of coffee, and bitter chocolate, is described as “the coffee lovers consummate beer” with a cinnamon-colored head. You may also like: 50 ways food has changed in the last 50 years edwin // Flickr German pilsner - Beer: Poetica #2 - Brewery: Hill Farmstead Brewery (Vermont) - ABV: 4.9% - Beer Advocate score: 96 - User score: 4.54 German pilsners might just be the most iconic beer style in modern history . Brought to America in the mid-1800s by German immigrants, this style of beer—light in color with a malty-sweetness and mid-level bitterness—has been wildly popular ever since. Poetica #2 is a brilliant take on the style, brewed in an oak barrel for five months, before emerging “beautiful, soft, and refined.” AdamChandler86 // Flickr Berliner Weisse - Beer: DFPF - Brewery: J. Wakefield Brewing (Florida) - ABV: 3.5% - Beer Advocate score: 100 - User score: 4.53 Growing in popularity in America, Berliner-style Weisse are refreshing, tart, and fruit-forward. Typically lower in the ABV scale , they are often made with no hops, which eliminates much of the bitterness found in other types of beer and makes them much easier to pair. The DFPF from J. Wakefield Brewing is made with dragon fruit and passion fruit, resulting in a fruity, sour, tart drink whose carbonation makes it easy to finish. sfcaconcierge // Flickr American porter - Beer: Everett Porter - Brewery: Hill Farmstead Brewery (Vermont) - ABV: 7.5% - Beer Advocate score: 100 - User score: 4.51 As dark as a black hole in space, the distinctly American porter eschews the roasted hops and barley of its European brethren, is medium in IBUs, and very high on the ABV scale. Hill Farmstead Brewery, never one to play by the rules, stretches the definition of an American porter by mixing roasted German malts with American barley and hops. At 7.5%, it’s also on the low-end of ABV for an American porter. Nejron Photo // Shutterstock Black ale - Beer: Barrel-Aged Double Shot Double Black - Brewery: Bent Paddle Brewing Co. (Minnesota) - ABV: 11.2% - Beer Advocate score: 98 - User score: 4.48 Almost as dark as an American porter, black ales have high IBUs, medium alcohol content, and are characterized by dark-roasted malt and caramel flavors. True to form, the Double Shot Double Black from Bent Paddle is inky black with hints of vanilla and coffee, but bucks tradition with 15 months of aging in bourbon barrels that produces a robust 11.2% ABV. Shane N. Cotee // Shutterstock Flanders red ale - Beer: Rodenbach Caractère Rouge - Brewery: Brouwerij Rodenbach N.V. (Belgium) - ABV: 7% - Beer Advocate score: 99 - User score: 4.48 A beer that wants to be a wine, complexity is what a Flanders red ale strives for. Oak barrel-aged with fruit, the specialty yeast strains produce distinctive sharp, fruity, sour, and tart flavors in this medium-high ABV and medium-low IBU beer. From the Dutch-speaking Flanders region of Belgium, the 7% ABV Rodenbach is aged for two-and-a-half years and exudes tradition as well as notes of wood and caramel. You may also like: Breweries to try this summer in every state Fellowship of the Rich // Flickr American IPA - Beer: Nelson - Brewery: Alpine Beer Company (California) - ABV: 7% - Beer Advocate score: 98 - User score: 4.45 A relative newcomer to the craft beer scene, American IPAs are a take on British IPAs that feature more citrusy and fruity notes. Alpine Beer Company’s Nelson is a perfectly golden iteration, laced with tropical, pine, and fruity aromas, and finished with a crisp, white foam. Described as “well-balanced,” “multifaceted,” and “mellow” the beer pairs well with spicy foods. Four Brewers // Flickr Hefeweizen - Beer: Hefeweissbier - Brewery: Bayerische Staatsbrauerei Weihenstephan (Germany) - ABV: 5.4% - Beer Advocate score: 98 - User score: 4.45 German Hefeweizens are crafted through a unique mix of wheat malt, yeast, fruit, and spices. Different in both taste and appearance from other German offerings, these beers are amber in color, with fruity (typically banana) and spicy (typically clove) aromas rounded out with lots of carbonation. Bayerische Staatsbrauerei Weihenstephan, the oldest continuously operating brewery in the world, makes a classic version of the beer that drinks incredibly smoothly . Kirill Z // Shutterstock Cream Ale - Beer: Cafe Y Churro - Brewery: Carton Brewing Company (New Jersey) - ABV: 12% - Beer Advocate score: 97 - User score: 4.43 Bright yellow, mildly bitter, and low in ABV, cream ales are extremely drinkable beers that can use ale or lager yeasts. Cafe y Churro looks like a traditional cream ale but upends the conventional formula with a robust 12% ABV and notes of coffee, vanilla, and cream. Dmitry Egorov // Shutterstock Oktoberfest - Beer: Augustiner Bräu Märzen Bier - Brewery: Augustiner Bräu - Kloster Mülln (Austria) - ABV: 4.6% - Beer Advocate score: 94 - User score: 4.43 Oktoberfest beers have historically been brewed in the spring and aged throughout the summer, then broken out in early fall (right around the time of the current Oktoberfest festival) for drinking. Rich in malt, with a toasted bread aroma, and a clean finish, these beers are often found to be quite similar to Vienna lagers. Lovers of the Augustiner Bräu Märzen Bier say that there’s no better experience than enjoying a freshly poured draft at the brewery’s Salzburg beer garden. Roger // Flickr Fruit and Field Beer - Beer: Wisconsin Belgian Red - Brewery: New Glarus Brewing Company (Wisconsin) - ABV: 4% - Beer Advocate score: 98 - User score: 4.42 Fruit and field beers are brewed with fruit. But brewmasters also use herbs and vegetables, thus the “and field” portion of the name. Varying greatly in color and ABV, they’re typically medium-low to low in IBUs. The Wisconsin Belgian Red from New Glarus is brewed from Wisconsin-grown Montmorency cherries, looks ruby red, tastes like cherry pie, and hits 4% ABV. New Glarus only sells its beers in Wisconsin, so you'll have to visit or get a friend to ship it to you if you live out of state. You may also like: Most diverse food cities in the world Brent MacAloney // Flickr Biere de Garde - Beer: Biere De Norma - Brewery: Hill Farmstead Brewery (Vermont) - ABV: 7% - Beer Advocate score: 97 - User score: 4.41 Literally translated as “beer for keeping,” a French Biere de Garde comes in blond, amber, and brown versions, and trends toward medium-low on ABV and IBU scales. Oak-barrel-fermented, Hill Farmstead Brewery’s Biere de Norma contains 7% ABV and has a unique tart taste owing to its secretive in-house culture. Tiny House Brewing & Farmstead // Flickr Brett - Beer: Nightmare On Brett - Brewery: Crooked Stave Artisan Beer Project (Colorado) - ABV: 9.7% - Beer Advocate score: 96 - User score: 4.38 Named after Brettanomyces yeast that lends it a leathery, phenolic, and acidic character, Brett beers are all over the place on the ABV, color, and IBU scales. They are often mistaken for sours. The Nightmare on Brett is super dark in color, sits at 7.7% ABV, and has prompted reviewers to note it’s “a real bourbon treat on the nose” and “very memorable.” Master1305 // Shutterstock Doppelbock - Beer: Ayinger Celebrator - Brewery: Ayinger Privatbrauerei (Germany) - ABV: 6.7% - Beer Advocate score: 97 - User score: 4.37 High in ABV and dark in color , Doppelbocks are a stronger version of German bock beers. First brewed by monks in Munich, the beers are malty and hearty, typically with fruit flavors, like prune or raisin, offering up a hint of sweetness. Ayinger Privatbrauerei’s Celebrator is almost black, with festive foam, notes of coffee, and very little of the sweetness typically found in the style. Thomas Cizauskas // Flickr Tripel - Beer: La Fin Du Monde - Brewery: Unibroue (Quebec) - ABV: 9% - Beer Advocate score: 97 - User score: 4.36 First brewed by Trappist monks, a Belgian tripel balances smooth flavor and a golden-to-amber hue with high ABV and medium-low IBU. Quebec-based Unibroue pays homage to this history with its 9% ABV La Fin du Monde (“The End of the World”), a hazy golden tripel cultured with an ancient European yeast. eddie welker // Flickr Rye Beer - Beer: Rye On Rye On Rye - Brewery: Boulevard Brewing Co. (Missouri) - ABV: 14% - Beer Advocate score: 95 - User score: 4.34 Varying greatly in color and ABV, ryes typically fall on the medium-low end of the bitterness spectrum and appear darker and redder the more rye is used. To be considered a rye beer, enough of the namesake ingredient must be evident in the appearance and taste. Boulevard Brewing’s Rye On Rye On Rye is aged twice in rye-whiskey barrels and promises considerable impairment at 14% ABV. You may also like: Signature dishes from 30 American cities Lauren Cunningham // Flickr Pumpkin Beer - Beer: Pumpkinator - Brewery: Saint Arnold Brewing Company (Texas) - ABV: 10% - Beer Advocate score: 95 - User score: 4.32 Somewhere in Munich, monks are rolling in their graves at the thought of pumpkin-spiced beer, yet here we are. Like other infused beers, characteristics of pumpkin drafts vary depending on the base beer used, usually an ale. This beer is best enjoyed in fall and paired with wild game, and many American craft brewers offer a take on pumpkin beers. The 10% ABV Pumpkinator from Saint Arnold Brewing won a gold medal at the 2017 Great American Beer Festival, making it one of North America’s best. Texas.713 // Flickr Smoke Beer - Beer: Bar Fly - Brewery: Midnight Sun Brewing Co. (Alaska) - ABV: 11.6% - Beer Advocate score: 95 - User score: 4.30 Any style of beer, from a lager to an ale, can be smoked—as the name simply refers to the process of smoking the malt over beechwood or cherrywood, which then infuses the finished product with a distinctive flavor. Midnight Sun Brewing Co.’s smoked beer , Bar Fly, is an imperial stout that combines the malt with molasses and brown sugar, resulting in a “somber and smoky” drink that has a slow-building flavor profile and a smooth finish. Jeremy Keith // Flickr Blonde ale - Beer: Eureka W/ Citra - Brewery: Tree House Brewing Company (Massachusetts) - ABV: 4.1% - Beer Advocate score: 95 - User score: 4.28 On the low end of the international-bitterness-units (IBU) and alcohol-by-volume (ABV) scale, a blonde ale is light and drinkable, golden in appearance, and pairs well with a sunny summer day. The Eureka w/ Citra, from Massachusetts-based Tree House Brewing, adds a citrus twist to the mix, earning accolades from reviewers who call it “refreshing” with a “mild tropical fruit nose.” Juan Monroy // Flickr Kolsch - Beer: Sprang - Brewery: Trillium Brewing Company (Massachusetts) - ABV: 4.9% - Beer Advocate score: 94 - User score: 4.27 Invented in Cologne, Germany as an easy-drinking springtime beer, Kolsch comes in a golden-straw color, reaches medium-low on the IBU and ABV spectrums, and straddles the divide between lagers and ales. Trillium Brewing’s Sprang hews closely to this heritage with a low ABV of 4.9%, minimal bitterness, and a refreshing and fruity character. But a lower fermentation temperature leaves a hazy appearance, a unique quality in the world of ordinarily crisp and clear Kolsch beers. Bogac Erkan // Shutterstock Scottish Ale - Beer: Dark Island Reserve - Brewery: Orkney Brewery (Scotland) - ABV: 10% - Beer Advocate score: 91 - User score: 4.16 Scottish ales are all about the malt flavor in the expense of hops, which breeds a crisp-red color and low IBU and ABV scores. Scotland’s Orkney Brewery, however, flips the script on the tradition with the Dark Island Reserve, an oily-black and 10% ABV that reviewers note is “like drinking scotch. Dark fruits and wood. Malt sweetness.” You may also like: 50 most popular chain restaurants in America uncene // Flickr Chile Beer - Beer: Fatali Four - Brewery: Upright Brewing Company (Oregon) - ABV: 4.5% - Beer Advocate score: 91 - User score: 4.15 A North American invention, chile beers are pale ales or lagers with precisely what they promise—a noticeable dose of chile peppers. Color, IBU, and ABV depend on the base beer, but most chile beers incorporate jalapeno peppers (or their juice or oils). The 4.5% ABV Fatali Four, courtesy of Oregon’s Upright Brewing, hurdles its jalapeno-using competitors by adding African Fatali peppers two months before bottling. rubixcuben // flickr English brown ale - Beer: Cubano-Style Espresso Brown Ale - Brewery: Cigar City Brewing (Florida) - ABV: 5.5% - Beer Advocate score: 92 - User score: 4.13 An iconic style, English brown ales should be toasty and robust, reddish in color, and medium-low on the IBU and ABV scales. Another Cigar City favorite, the 5.5% Espresso Brown Ale meets these requirements, but with its addition of Cuban-style espresso beans almost pushes this beer into the realm of stouts. Almost. DJ Waldow // Flickr California Common - Beer: East Coast Common Lager - Brewery: Smuttynose Brewing Company (New Hampshire) - ABV: 7.4% - Beer Advocate score: 90 - User score: 4.08 Brewed with lager yeast but fermented like an ale, the California Common is a pale orange-brown, hits right in the middle of the ABV and IBU scales, and was pioneered by San Francisco’s Anchor Steam Brewing. The East Coast Common pays tribute to its American heritage until right after the fermentation process when Smuttynose brewmasters shock the batch with dry hops. Jazz Guy // Flickr American lager - Beer: First Call - Brewery: Modist Brewing Co. (Minnesota) - ABV: 6.5% - Beer Advocate score: 89 - User score: 4.07 It wasn’t until WWII, when brewers replaced rationed grain with rice , that America crafted a lager to call its own. Typically lower in ABV and bitterness, the style’s primary focus is less on bringing together complex flavors and more on creating straw-colored, drinkable brew. Modist Brewing Co.’s take on an American lager has a strong coffee punch layered with sweet notes and a scant amount of carbonation. Alexey Andr Tkachenko // Shutterstock Irish red ale - Beer: Brian Boru - Brewery: 3 Floyds Brewing Co. (Indiana) - ABV: 6.5% - Beer Advocate score: 91 - User score: 4.06 Many reviewers note that 3 Floyds Brewing Co.’s Brian Boru, an Irish red ale, is more hoppy than other brands of the style . Still, they overwhelmingly rate the beer highly, thanks to its color, fruity aroma, and approachability, which are standards in this style of craft beer. You may also like: McDonald's menu items from abroad Alexander Prokopenko // Shutterstock Maddie Seiler is a news reporter for The Sentinel and cumberlink.com covering Carlisle and Newville. You can contact her at mseiler@cumberlink.com and follow her on Twitter at: @SeilerMadalyn 0 Comments Love 0 Funny 0 Wow 0 Sad 0 Angry 0 Be the first to know Get local news delivered to your inbox! Sign up! * I understand and agree that registration on or use of this site constitutes agreement to its user agreement and privacy policy . Maddie Seiler News Reporter Author facebook Author twitter Author email Follow Maddie Seiler Related to this story A look inside Carlisle's newest brewery Tables and chairs fill Back Porch Brewing's dining room awaiting customers. The business will open at 133 N. Hanover Street in Carlisle Friday… Watch Now: Related Video White House says Trump believes the Israeli attack on Hamas in Qatar doesn't advance peace Scrolling Your Phone On The Toilet Increases Risk Of Hemorrhoids Scrolling Your Phone On The Toilet Increases Risk Of Hemorrhoids Epstein victims beg Trump admin to release the files Epstein victims beg Trump admin to release the files Supreme Court lifts immigration restrictions, US cities like Chicago brace for Trump takeover Supreme Court lifts immigration restrictions, US cities like Chicago brace for Trump takeover Close × Facebook Twitter YouTube Pinterest Instagram Sites & Partners Amplified Midstate Homeseller PA Wheels For You Penn State The Sentinel Special Sections Varsity Sports Services About Us Activate Full Access Advertise With Us Become a Carrier Contact Us Customer Service Career Opportunities Dealer Returns Licensing Shopping © Copyright 2025 The Sentinel , 327 B Street Carlisle, PA 17013 Terms of Use | Privacy Policy | Advertising Terms of Use | Do Not Sell My Info | Cookie Preferences Powered by BLOX Content Management System from bloxdigital.com . Notifications Settings You don't have any notifications. Get up-to-the-minute news sent straight to your device. Topics News Alerts Subscribe Breaking News Subscribe Back × You are logged in Switch accounts Secure transaction. Cancel anytime. Have an account? Log In Back × Sign Up Account processing issue - the email address may already exist User information Username (Optional) This is the name that will be displayed next to your photo for comments, blog posts, and more. Choose wisely! * First name * Last name * Email Address Your email address will be used to confirm your account. We won't share it with anyone else. * Password Create a password that only you will remember. If you forget it, you'll be able to recover it using your email address. * Confirm Password Confirm your password. CAPTCHA Create Account or Sign up with Facebook Google Have an account? Log In × You're all set! Thank you . Your account has been registered, and you are now logged in. Check your email for details. OK Back × Log In Invalid password or account does not exist Email Address Password Forgot your password? Log In Email me a log in link or Sign in with Facebook Google Admin login Subscribe Need an account? Sign Up Back × Reset Password Submitting this form below will send a message to your email with a link to change your password. Email or Screen Name CAPTCHA Reset Password × Forgot Password An email message containing instructions on how to reset your password has been sent to the email address listed on your account. Back × Email me a log in link Account Email CAPTCHA Send Email Back × Promotional Offers Enter Promo Code Redeem No promotional rates found. Back × Purchase Gift Purchase Access × An error occurred × Secure & Encrypted Sign in with Email Address Continue with Email Address or Continue with Facebook Continue with Google What's your email address? Email Password Confirm password What's your name? First name Last name Who is this gift for? Recipient name Recipient email Optional message for the recipient Who is this gift from? Purchaser name Purchaser email Delivery date Delivery date What's your billing location? Address City State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, Canada Zip Code Country United States of America US Virgin Islands United States Minor Outlying Islands Canada Mexico, United Mexican States Bahamas, Commonwealth of the Cuba, Republic of Dominican Republic Haiti, Republic of Jamaica Afghanistan Albania, People's Socialist Republic of Algeria, People's Democratic Republic of American Samoa Andorra, Principality of Angola, Republic of Anguilla Antarctica (the territory South of 60 deg S) Antigua and Barbuda Argentina, Argentine Republic Armenia Aruba Australia, Commonwealth of Austria, Republic of Azerbaijan, Republic of Bahrain, Kingdom of Bangladesh, People's Republic of Barbados Belarus Belgium, Kingdom of Belize Benin, People's Republic of Bermuda Bhutan, Kingdom of Bolivia, Republic of Bosnia and Herzegovina Botswana, Republic of Bouvet Island (Bouvetoya) Brazil, Federative Republic of British Indian Ocean Territory (Chagos Archipelago) British Virgin Islands Brunei Darussalam Bulgaria, People's Republic of Burkina Faso Burundi, Republic of Cambodia, Kingdom of Cameroon, United Republic of Cape Verde, Republic of Cayman Islands Central African Republic Chad, Republic of Chile, Republic of China, People's Republic of Christmas Island Cocos (Keeling) Islands Colombia, Republic of Comoros, Union of the Congo, Democratic Republic of Congo, People's Republic of Cook Islands Costa Rica, Republic of Cote D'Ivoire, Ivory Coast, Republic of the Cyprus, Republic of Czech Republic Denmark, Kingdom of Djibouti, Republic of Dominica, Commonwealth of Ecuador, Republic of Egypt, Arab Republic of El Salvador, Republic of Equatorial Guinea, Republic of Eritrea Estonia Ethiopia Faeroe Islands Falkland Islands (Malvinas) Fiji, Republic of the Fiji Islands Finland, Republic of France, French Republic French Guiana French Polynesia French Southern Territories Gabon, Gabonese Republic Gambia, Republic of the Georgia Germany Ghana, Republic of Gibraltar Greece, Hellenic Republic Greenland Grenada Guadaloupe Guam Guatemala, Republic of Guinea, Revolutionary\nPeople's Rep'c of Guinea-Bissau, Republic of Guyana, Republic of Heard and McDonald Islands Holy See (Vatican City State) Honduras, Republic of Hong Kong, Special Administrative Region of China Hrvatska (Croatia) Hungary, Hungarian People's Republic Iceland, Republic of India, Republic of Indonesia, Republic of Iran, Islamic Republic of Iraq, Republic of Ireland Israel, State of Italy, Italian Republic Japan Jordan, Hashemite Kingdom of Kazakhstan, Republic of Kenya, Republic of Kiribati, Republic of Korea, Democratic People's Republic of Korea, Republic of Kuwait, State of Kyrgyz Republic Lao People's Democratic Republic Latvia Lebanon, Lebanese Republic Lesotho, Kingdom of Liberia, Republic of Libyan Arab Jamahiriya Liechtenstein, Principality of Lithuania Luxembourg, Grand Duchy of Macao, Special Administrative Region of China Macedonia, the former Yugoslav Republic of Madagascar, Republic of Malawi, Republic of Malaysia Maldives, Republic of Mali, Republic of Malta, Republic of Marshall Islands Martinique Mauritania, Islamic Republic of Mauritius Mayotte Micronesia, Federated States of Moldova, Republic of Monaco, Principality of Mongolia, Mongolian People's Republic Montserrat Morocco, Kingdom of Mozambique, People's Republic of Myanmar Namibia Nauru, Republic of Nepal, Kingdom of Netherlands Antilles Netherlands, Kingdom of the New Caledonia New Zealand Nicaragua, Republic of Niger, Republic of the Nigeria, Federal Republic of Niue, Republic of Norfolk Island Northern Mariana Islands Norway, Kingdom of Oman, Sultanate of Pakistan, Islamic Republic of Palau Palestinian Territory, Occupied Panama, Republic of Papua New Guinea Paraguay, Republic of Peru, Republic of Philippines, Republic of the Pitcairn Island Poland, Polish People's Republic Portugal, Portuguese Republic Puerto Rico Qatar, State of Reunion Romania, Socialist Republic of Russian Federation Rwanda, Rwandese Republic Samoa, Independent State of San Marino, Republic of Sao Tome and Principe, Democratic Republic of Saudi Arabia, Kingdom of Senegal, Republic of Serbia and Montenegro Seychelles, Republic of Sierra Leone, Republic of Singapore, Republic of Slovakia (Slovak Republic) Slovenia Solomon Islands Somalia, Somali Republic South Africa, Republic of South Georgia and the South Sandwich Islands Spain, Spanish State Sri Lanka, Democratic Socialist Republic of St. Helena St. Kitts and Nevis St. Lucia St. Pierre and Miquelon St. Vincent and the Grenadines Sudan, Democratic Republic of the Suriname, Republic of Svalbard & Jan Mayen Islands Swaziland, Kingdom of Sweden, Kingdom of Switzerland, Swiss Confederation Syrian Arab Republic Taiwan, Province of China Tajikistan Tanzania, United Republic of Thailand, Kingdom of Timor-Leste, Democratic Republic of Togo, Togolese Republic Tokelau (Tokelau Islands) Tonga, Kingdom of Trinidad and Tobago, Republic of Tunisia, Republic of Turkey, Republic of Turkmenistan Turks and Caicos Islands Tuvalu Uganda, Republic of Ukraine United Arab Emirates United Kingdom of Great Britain & N. Ireland Uruguay, Eastern Republic of Uzbekistan Vanuatu Venezuela, Bolivarian Republic of Viet Nam, Socialist Republic of Wallis and Futuna Islands Western Sahara Yemen Zambia, Republic of Zimbabwe What's your delivery address? Copy billing location Address City State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, Canada Zip code Country United States of America US Virgin Islands United States Minor Outlying Islands Canada Mexico, United Mexican States Bahamas, Commonwealth of the Cuba, Republic of Dominican Republic Haiti, Republic of Jamaica Afghanistan Albania, People's Socialist Republic of Algeria, People's Democratic Republic of American Samoa Andorra, Principality of Angola, Republic of Anguilla Antarctica (the territory South of 60 deg S) Antigua and Barbuda Argentina, Argentine Republic Armenia Aruba Australia, Commonwealth of Austria, Republic of Azerbaijan, Republic of Bahrain, Kingdom of Bangladesh, People's Republic of Barbados Belarus Belgium, Kingdom of Belize Benin, People's Republic of Bermuda Bhutan, Kingdom of Bolivia, Republic of Bosnia and Herzegovina Botswana, Republic of Bouvet Island (Bouvetoya) Brazil, Federative Republic of British Indian Ocean Territory (Chagos Archipelago) British Virgin Islands Brunei Darussalam Bulgaria, People's Republic of Burkina Faso Burundi, Republic of Cambodia, Kingdom of Cameroon, United Republic of Cape Verde, Republic of Cayman Islands Central African Republic Chad, Republic of Chile, Republic of China, People's Republic of Christmas Island Cocos (Keeling) Islands Colombia, Republic of Comoros, Union of the Congo, Democratic Republic of Congo, People's Republic of Cook Islands Costa Rica, Republic of Cote D'Ivoire, Ivory Coast, Republic of the Cyprus, Republic of Czech Republic Denmark, Kingdom of Djibouti, Republic of Dominica, Commonwealth of Ecuador, Republic of Egypt, Arab Republic of El Salvador, Republic of Equatorial Guinea, Republic of Eritrea Estonia Ethiopia Faeroe Islands Falkland Islands (Malvinas) Fiji, Republic of the Fiji Islands Finland, Republic of France, French Republic French Guiana French Polynesia French Southern Territories Gabon, Gabonese Republic Gambia, Republic of the Georgia Germany Ghana, Republic of Gibraltar Greece, Hellenic Republic Greenland Grenada Guadaloupe Guam Guatemala, Republic of Guinea, Revolutionary\nPeople's Rep'c of Guinea-Bissau, Republic of Guyana, Republic of Heard and McDonald Islands Holy See (Vatican City State) Honduras, Republic of Hong Kong, Special Administrative Region of China Hrvatska (Croatia) Hungary, Hungarian People's Republic Iceland, Republic of India, Republic of Indonesia, Republic of Iran, Islamic Republic of Iraq, Republic of Ireland Israel, State of Italy, Italian Republic Japan Jordan, Hashemite Kingdom of Kazakhstan, Republic of Kenya, Republic of Kiribati, Republic of Korea, Democratic People's Republic of Korea, Republic of Kuwait, State of Kyrgyz Republic Lao People's Democratic Republic Latvia Lebanon, Lebanese Republic Lesotho, Kingdom of Liberia, Republic of Libyan Arab Jamahiriya Liechtenstein, Principality of Lithuania Luxembourg, Grand Duchy of Macao, Special Administrative Region of China Macedonia, the former Yugoslav Republic of Madagascar, Republic of Malawi, Republic of Malaysia Maldives, Republic of Mali, Republic of Malta, Republic of Marshall Islands Martinique Mauritania, Islamic Republic of Mauritius Mayotte Micronesia, Federated States of Moldova, Republic of Monaco, Principality of Mongolia, Mongolian People's Republic Montserrat Morocco, Kingdom of Mozambique, People's Republic of Myanmar Namibia Nauru, Republic of Nepal, Kingdom of Netherlands Antilles Netherlands, Kingdom of the New Caledonia New Zealand Nicaragua, Republic of Niger, Republic of the Nigeria, Federal Republic of Niue, Republic of Norfolk Island Northern Mariana Islands Norway, Kingdom of Oman, Sultanate of Pakistan, Islamic Republic of Palau Palestinian Territory, Occupied Panama, Republic of Papua New Guinea Paraguay, Republic of Peru, Republic of Philippines, Republic of the Pitcairn Island Poland, Polish People's Republic Portugal, Portuguese Republic Puerto Rico Qatar, State of Reunion Romania, Socialist Republic of Russian Federation Rwanda, Rwandese Republic Samoa, Independent State of San Marino, Republic of Sao Tome and Principe, Democratic Republic of Saudi Arabia, Kingdom of Senegal, Republic of Serbia and Montenegro Seychelles, Republic of Sierra Leone, Republic of Singapore, Republic of Slovakia (Slovak Republic) Slovenia Solomon Islands Somalia, Somali Republic South Africa, Republic of South Georgia and the South Sandwich Islands Spain, Spanish State Sri Lanka, Democratic Socialist Republic of St. Helena St. Kitts and Nevis St. Lucia St. Pierre and Miquelon St. Vincent and the Grenadines Sudan, Democratic Republic of the Suriname, Republic of Svalbard & Jan Mayen Islands Swaziland, Kingdom of Sweden, Kingdom of Switzerland, Swiss Confederation Syrian Arab Republic Taiwan, Province of China Tajikistan Tanzania, United Republic of Thailand, Kingdom of Timor-Leste, Democratic Republic of Togo, Togolese Republic Tokelau (Tokelau Islands) Tonga, Kingdom of Trinidad and Tobago, Republic of Tunisia, Republic of Turkey, Republic of Turkmenistan Turks and Caicos Islands Tuvalu Uganda, Republic of Ukraine United Arab Emirates United Kingdom of Great Britain & N. Ireland Uruguay, Eastern Republic of Uzbekistan Vanuatu Venezuela, Bolivarian Republic of Viet Nam, Socialist Republic of Wallis and Futuna Islands Western Sahara Yemen Zambia, Republic of Zimbabwe Phone Subtotal: Total: How would you like to pay? Add New Card I Agree to the Subscription Terms of Use. This service will be automatically renewed and your credit card billed once it nears expiration. Secure transaction. Secure transaction. Cancel anytime. × You're all set! Thank you . Your gift purchase was successful! Your purchase was successful, and you are now logged in. A receipt was sent to your email. OK × An error occurred This offer is currently unavailable. Close"
    },
    {
      "url": "https://backporchbrewinginc.com/contact",
      "text": "contact us We use cookies to improve your experience on our site. By using our site, you consent to the use of cookies. Rejecting cookies will prevent non-essential cookies from loading. Accept all Accept essential Home About Us Events Contact Us Menu's Gallery Order food online Get in Touch with Us Contact our friendly team for inquiries, reservations, or to learn more about our brewery. We're here to make your visit exceptional Musicians wanting to book If you are a musician or band looking to book with us please click the button below to take you to our musician booking form. Musician booking form Contact Us Contact Us SEND! Contact Us [email protected] 717-254-6134 133 N. Hanover st Carlisle, PA 17013"
    },
    {
      "url": "https://www.bpbrewing.com/contact",
      "text": "Contact — Back Porch Brewing Co. | Venice, FL 0 Skip to Content Order Online Food Beer on Tap Events Our Story Contact Open Menu Close Menu Order Online Food Beer on Tap Events Our Story Contact Open Menu Close Menu Order Online Food Beer on Tap Events Our Story Contact CONTACT Have a Question for Us? Fill out the Contact Form, or give us a Ring at 941-218-4156 . Name * First Name Last Name Email * Subject * Message * Thank you! LOCATED JUST EAST FROM I-75 ON LAUREL RD 3469 Precision Dr. North Venice, FL 34275 BEER ON TAP EVENTS OUR STORY CONTACT HOURS Monday-Thursday 12pm-9pm Friday-Saturday 12pm-10pm Sunday 12pm-8pm LOCATION 3469 Precision Drive North Venice, Florida 34275 Located directly off the highway 941-218-4156 Directions ©2024 Back Porch Brewing Co. All online orders must be picked up the same day they are ordered. Thank you!"
    },
    {
      "url": "https://www.blockbrewingcompany.com/contact-us/",
      "text": "Contact Us - Block Brewing Skip to content FACEBOOK INSTAGRAM Home About Block Brewing – Brighton Block Brewing – Howell Banquets & Catering Our Beers Mug Club Gift Cards Events News Employment Contact Contact Us Contact we would love to hear from you You can Get in touch with us by email, phone, mail or by filling out the form below how to reach us bLOCK BREWING - HOWELL, MI By Mail: 1140 S. Michigan Ave. Howell, MI 48843 Email: [email protected] Phone: (517) 540-0300 bLOCK BREWING - BRIGHTON, MI By Mail: 1840 South Old US 23 Brighton, MI 48114 Email: [email protected] Phone: (810) 206-3990 get in touch Send Brighton Hours Sun-Thurs: 11am to 10pm Fri & Sat: 11am to 11pm Howell Hours Sun-Thurs: 11am to 10pm Fri & Sat: 11am to 11pm catering or banquet inquiries Click for more info on catering or banquets 🚨🍻NOW   ON   TAP   AT   OUR   BRIGHTON  ... Open We're   kicking   off   American   Craft   Beer   Week  ... Open Happy   Mother's   Day   to   all   you   amazing  ... Open 🚨🍻Now   on   Tap   at   our   Brighton   Location:   TAN  ... Open Happy   Cinco   de   Mayo!! We've   got   some... Open May   The   4th   Be   With   You! Stop   into   the  ... Open Happy   Friday   Everyone,   we   made   it   to   the  ... Open Happy   Saturday!! We're   throwing   out... Open 🚨🍻NEW   BEER   ALERT   🚨🍻 ... Open It's   Flux   Friday!!!   Come   enjoy   this   beautiful... Open It's   a   beautiful   day   to   come   enjoy   a   brew   on  ... Open Hoppy   Easter!!   We're   throwing   out   some   new,  ... Open Happy   National   Beer   Day!! Come   celebrate  ... Open Something   Wicked   this   way   comes.   .   With  ... Open It's   a   slam   *Dunk*,   vote   Block   for   March  ... Open Load More This error message is only visible to WordPress admins Error: Access Token is not valid or has expired. Feed will not update. Contact us block brewing Howell Facebook 1140 S Michigan Ave Howell, MI 48843 (517) 540-0300 [email protected] block brewing Brighton Facebook 1840 South Old US 23 Brighton, MI 48114 (810) 206-3990 [email protected] Howell hours Sun-Thurs: 11am -10pm Fri & Sat: 11am - 11pm Brighton hours Sun-Thurs: 11am - 10pm Fri & Sat: 11am - 11pm quick links Our Brews Brighton Location Howell Location Mug Club Gift Cards Banquets & Catering Employment Block Brewing Company was founded on the concept of bringing together a simple love of craft beer and great food and we want to share that passion with you. Designed and powered by Brewing Sites | Privacy Policy"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "text": "Contact - Parkway Brewing Company Skip to content Parkway Brewing Company Home Brews Where to find Parkway Distribution Online Store About Us Our Team Our Story The Tasting Room On Tap This Week’s Live Music and Food Trucks Private Events Monthly Music & Food Truck Calendar Visiting Parkway Pilot Batch Online Store Beer Buzz Contact Facebook Twitter Instagram Contact Contact Have a specific question? See below for the right contact and we’d love to answer that question for you! Private Events: events@parkwaybrewing.com For music/talent bookings, food trucks, or anything tasting room related: No Phone Calls Please, All Music Booking by Email ONLY kim@parkwaybrewing.com For  sales and distribution: grant@parkwaybrewing.com mike@parkwaybrewing.com For brewing, and general manager: mike@parkwaybrewing.com For office manager: mic@parkwaybrewing.com For invoices: accounts.payable@parkwaybrewing.com Share this: Click to share on Facebook (Opens in new window) Click to share on Twitter (Opens in new window) Click to share on Pinterest (Opens in new window) Click to print (Opens in new window) Subscribe for Updates Search our Site Distinctive Beers Crafted With Care In The Heart Of The Blue Ridge parkwaybrewing.com 739 Kessler Mill Road Exit 141 on I-81, SALEM, VA 540-404-9810 kim@parkwaybrewing.com Facebook Twitter Instagram Brewery Hours Monday – 2pm to 8pm Tuesday – 2pm to 8pm Wednesday – 2pm to 9pm Thursday – 2pm to 9pm Friday – 12pm to 9pm Saturday – 12pm to 9pm Sunday – 12pm to 8pm Holiday Closures: Christmas Day, New Years Day, Memorial Day, July 4th, Labor Day, Thanksgiving Day © 2025 Parkway Brewing Co. | Custom Wordpress Development by William Alexander"
    },
    {
      "url": "https://www.rockinghambrewing.com/about-us",
      "text": "Who We Are | Rockingham Brewing Company | Rockingham Brewing Company Home Who We Are Visit Our Derry Taproom Taproom Info Current Offerings Order Beer To-Go in Derry Visit Our Newport Taproom Contact Us Purchase Gift Cards Home Who We Are Visit Our Derry Taproom Taproom Info Current Offerings Order Beer To-Go in Derry Visit Our Newport Taproom Contact Us Purchase Gift Cards Rockingham Brewing Company Trust the Pig. 1 Corporate Park Dr #1 Derry, NH 03038 USA 603.995.1543 Our Story Rob & Ali Leleszi first connected over a rousing game of beer pong in New York City in 2007. Early on,  it was clear that  they would go on to do great things together, but it took  six years to figure out what those things were. During that time, Rob cultivated his passion & skill for homebrewing and received an Associates Degree in Brewing Science from the Siebel Institute.  He then started an invaluable internship at Port Jeff Brewing Company in Long Island.  It was a long commute from Brooklyn, and even longer work hours, but Rob's love for brewing only grew. At the same time, Ali, who had always dreamed of owning her own      business, had become a self-professed beer snob and was reading up on the business side of brewing. It was then they decided to open up their own brewery and started scouting the perfect locale for their 10 barrel brew system.  They stopped when they found the blossoming town of Derry, NH, in Ali’s home state. Rockingham Brewing opened its doors in February of 2015.  About one month after opening, Rob and Ali hired their first full time employee, Remy, a Great Pyrenees mix rescue.   Since then, the team has grown into 10 hard-working & fun-loving individuals, who focus on brewing & sharing a well-rounded portfolio of beers, to ensure there is always an option for everyone to  enjoy.  They are all thrilled to be part of the growing local beer community in Rockingham County, NH. Rockingham Brewing Company - 1 Corporate Park Drive Unit #1 Derry, NH 03038      603.216.2324     info@rockinghambrewing.com   Wednesday-Friday 4-8p     Saturday 1-8p    Sunday 1-6p Rockingham West - 300 Sunapee Street Newport, NH 03773      west@rockinghambrewing.com                           Thursday-Friday 4-8p     Saturday 1-8p    Sunday 1-6p Follow us on facebook & Instagram"
    },
    {
      "url": "https://www.bpbrewing.com/our-story",
      "text": "Our Story — Back Porch Brewing Co. | Venice, FL 0 Skip to Content Order Online Food Beer on Tap Events Our Story Contact Open Menu Close Menu Order Online Food Beer on Tap Events Our Story Contact Open Menu Close Menu Order Online Food Beer on Tap Events Our Story Contact Our Story Welcome to Back Porch Brewery and Taproom! We’re Sarah and Anthony Tomaselli, life partners and the proud owners of Back Porch Brewing. Born and raised in New England’s smallest state, we’ve spent over 40 years in the hospitality industry. In 2018, we set out for Florida with a vision: to create a warm, inviting space where friends and families could come together to enjoy our craft beers, handpicked wines, and creative cuisine. It wasn’t easy, but we’re thrilled to say that dream is now a reality. We can’t wait to welcome you to Back Porch Brewing! We are your local-family operated taproom. WHEN YOU ARE HERE, YOU ARE FAMILY! GOOD BEER & WINE  DESERVES TO BE ENJOYED WITH THE ONES YOU LOVE. So come join us on the Back Porch and take time to enjoy life! Our Venice, Florida brewery was created on the idea to meet in a place where you feel at home with good beer & wine. BEER ON TAP EVENTS OUR STORY CONTACT HOURS Monday-Thursday 12pm-9pm Friday-Saturday 12pm-10pm Sunday 12pm-8pm LOCATION 3469 Precision Drive North Venice, Florida 34275 Located directly off the highway 941-218-4156 Directions ©2024 Back Porch Brewing Co. All online orders must be picked up the same day they are ordered. Thank you!"
    }
  ]
}