{
  "fuentes": [
    {
      "url": "https://www.massconvention.com/about-us/staff-directory",
      "email": "info@massconvention.com"
    },
    {
      "url": "https://www.islander.org/2025/05/1st-responders-ready-for-holiday-summer-season/",
      "email": "info@islander.org"
    },
    {
      "url": "https://www.islander.org/2025/05/1st-responders-ready-for-holiday-summer-season/",
      "email": "news@islander.org"
    },
    {
      "url": "https://www.islander.org/2025/05/1st-responders-ready-for-holiday-summer-season/",
      "email": "sales@islander.org"
    },
    {
      "url": "https://www.gauseandassociates.com/portfolio-view/bradenton-area-convention-center/",
      "email": "bob@gauseandassociates.com"
    },
    {
      "url": "https://conventionsouth.com/directory-online/Bradenton-Area-Convention--Visitors-Bureau",
      "email": "info@bacvb.com"
    },
    {
      "url": "https://conventionsouth.com/directory-online/Bradenton-Area-Convention--Visitors-Bureau",
      "email": "kirsten.lovett@bacvb.com"
    },
    {
      "url": "https://www.bradentongulfislands.com/media/contact",
      "email": "bfrancis@maddenmedia.com"
    },
    {
      "url": "https://www.islander.org/2023/12/ferry-rides-linking-island-mainland-set-to-begin-dec-8/",
      "email": "info@islander.org"
    },
    {
      "url": "https://www.islander.org/2023/12/ferry-rides-linking-island-mainland-set-to-begin-dec-8/",
      "email": "news@islander.org"
    },
    {
      "url": "https://www.islander.org/2023/12/ferry-rides-linking-island-mainland-set-to-begin-dec-8/",
      "email": "sales@islander.org"
    }
  ],
  "mails": [
    "bfrancis@maddenmedia.com",
    "bob@gauseandassociates.com",
    "info@bacvb.com",
    "info@islander.org",
    "info@massconvention.com",
    "kirsten.lovett@bacvb.com",
    "news@islander.org",
    "sales@islander.org"
  ],
  "nombre_sitio": "bradentongulfislands.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.massconvention.com/about-us/staff-directory",
      "text": "MCCA Massachusettes Convention Center Authority Navigation: sections Planners Exhibitors Attendees Community About Us Events Linked In Twitter Facebook Search Home About Us Contact Us Staff Directory Navigation: main Planners Exhibitors Attendees Community Work With Us Business Opportunities Job Openings Corporate Social Responsibility Green Environment Grants Program Overview Community Partnership Grant Hospitality Scholarship Grant Diversity Arts Culture of Caring Conventions C.A.R.E Art Program About Us About Us Thomas M. Menino Convention & Exhibition Center The Lawn On D John B. Hynes Veterans Memorial Convention Center MassMutual Center Boston Common Garage Lot On D MMC Convention Center Carpark Contact Us BCEC Hynes MassMutual Boston Common Garage The Lawn on D Board of Directors Chief Executive Officer Staff Directory Press Releases Press Releases Newsletters Meeting Resources Financial Statement Public Records Request Privacy Policy Events Book an Event BCEC Overview Hynes Overview The Lawn on D Staff Directory Administration Name Title Contact info Marcel Vernon, Sr. Chief Executive Officer (617) 954-1030 Daunielle Brown Chief of Staff (617) 954-1049 Joanna Estilet Office Administrator (617) 954-2028 John Towle Director of Government and Community Affairs (617) 954-1077 Claudia R. Russell Director of Internal Audit (617) 954-3502 Operations Name Title Contact info Diane DiAntonio General Manager (617) 954-2308 Michael Tedford Assistant General Manager - Hynes (617) 954-1132 Kristen Kinahan Assistant General Manager - BCEC (617) 954-2026 Carol Gagnon Director of Standardization and Quality Assurance (617) 954-2033 Steven Vallarelli Food and Beverage Manager (617) 954-1032 Mary Hart Executive Assistant (617) 954-2164 Marketing - Bring your next event to the BCEC, the Hynes Convention Center or The Lawn On D! To learn how, contact our Signature Boston Sales Team at 877-393-3393 or sales@SignatureBoston.com. They are also your point of contact for advertising opportunities at our facilities, including the BCEC Marquee and the digital displays at both the BCEC and the Hynes Convention Center. Name Title Contact info Event Services Name Title Contact info Nate Little Director of Event Communications (617) 954-2309 Katherine Feeney Director of Event Services - BCEC (617) 954-2437 Alexandra Carver Deputy Director of Event Services (617) 954-3314 Stephen Galeotalanza Senior Event Services Manager - Hynes (617) 954-2175 Shannon Lazinsk Senior Event Services Manager - BCEC (617) 954-3067 Stacey Compton-Maga Event Services Manager - Hynes (617) 954-1017 Christina Fitzgerald Senior Event Services Manager - BCEC (617) 954-2030 Abigayle Lee Event Services Manager - BCEC (617) 954-1123 Giorgio Arbisi Event Services Manager - BCEC (617) 954-2473 Kimberly Ekstrand Event Services Coordinator (617) 954-2458 Thomas Kilduff Event Services Manager - Hynes (617) 954-2238 Olivia McGrath Event Services Manager - BCEC (617) 954-1074 Reagan McGrath Event Services Coordinator (617) 954-2398 Kelly Costigan Event Services Lawn on D Coordinator (617) 954-2021 Bridget Lacey Event Services Manager (617) 954-3500 Client, Exhibitor & Guest Services Name Title Contact info Christine O’Neil Director of Exhibitor & Guest Services (617) 954-2810 Stephen Lovejoy Senior Guest Services Manager (617) 954-1157 Lillian Pierce Guest Services Assistant Manager (617) 954-1158 Gianni Coleta Exhibitor Services Coordinator (617) 954-2183 Tyler Dalby Senior Exhibitor Services Associate (617) 954-2321 Jalisa Ford Senior Exhibitor Services Associate (617) 954-2469 Therese Surrette Exhibitor Services Assistant Manager (617) 954 -1029 Garrett Holzer Senior Exhibitor Services Associate (617)  954-2327 Madline Chrisom Exhibitor Services Associate (617) 954-2232 Jessica Tran Exhibitor Services Associate (617) 954-1096 Communications & External Relations - External Communications/Media Inquiries Name Title Contact info David Silk Chief Communications Officer (617) 954-2383 Arthur Fritch Community Liaison (617) 954-2115 Philip Crohan Senior Manager of Communications & External Relations (617) 954-2081 Mark O'Leary Communications & External Relations Manager (617) 954-2832 Abbey Raynes Communications & External Relations Coordinator (617) 954-2256 Legal Services Name Title Contact info Kevin Scanlon, Esq. General Counsel (617) 908-0326 Christine Pulgini, Esq. Associate General Cousnel (617) 954-1021 Jeannemarie Joyce, Esq. Assistant General Counsel (617) 954-2324 Finance & Accounting Name Title Contact info Bradley McMillin Chief Financial Officer (617) 954-2558 Carrie Wright Accounting Supervisor (617) 954-2172 Cassandra Bullock Senior Accountant (617) 954-2078 Jakir Tarafder Senior Accountant (617) 954-1044 Paul Devlin Accountant (617) 954-1179 Kevin Martin Accountant (617) 954-2109 Susan Geary Controller (617) 954-1059 Human Resources Name Title Contact info Lennie De Souza Chief Human Resources Officer (617) 954-1095 Lesley Peters Payroll Supervisor (617) 954-2408 Carolyn Ryan Deputy Chief Human Resources Officer (617) 954-3240 Maria Ferris Senior Human Resources Specialist (617) 954-2443 Stefany Matos Talent Acquisition Specialist (617) 954-1052 Public Safety Name Title Contact info Allen Proctor Director of Public Safety (617) 954-1162 Chris Raposa Deputy Director of Public Safety (617)954-2822 Michael Brownell Senior Public Safety Manager - Command Center (617) 954-2480 Richard Colley Senior Public Safety Manager - Facility Operations (617) 954-2093 Nicholas Scachetti Senior Public Safety Manager - Event Operations (617) 954- 2305 Stephen Jones Public Safety Manager  - Facility Operations (617) 954-2361 Patrick McDonough Public Safety Manager - Event Operations (617) 954-2116 Charles Page Public Safety Manager - Event Operations (617) 954-1031 Scott Palladino Public Safety Manager - Facilities (857) 869-3099 Darryl Lodge Public Safety Manager - Facilities (617) 954-2049 Tylor Begay Assistant Public Safety Manager - Event Operations (617)954-1024 Michael Pyles Assistant Public Safety Manager - Event Operations (617) 954-2516 Susan Provenzano Office Administrator (617) 954-1023 Ian Simmons Assistant Public Safety Manager - Events Ops (617) 954-2519 Procurement Name Title Contact info Brendan Flynn Director of Purchasing (617) 954-2104 Mark Evers Warehouse Manager (617) 954-2837 Nicole Russo Purchasing Coordinator & Buyer (617) 954-2730 Sorraia Tavares Chief Procurement Supplier Diversity Officer (617) 954-2482 Information Technology Name Title Contact info Robert Noonan Chief Information Security Officer (617) 954-2487 Brian Hayes Director of Technical Operations (617) 954-2467 Ed Bryan Director of Enterprise Risk & Quality Assurance (617) 954-2071 Building Services, Engineering & Maintenance Name Title Contact info John Donahue Chief of Operations & Capital Projects (617) 954-2042 Evan W. Harwood Building Superintendent (617) 954-2413 Robert Butts Building Superintendent (617) 954-2062 Edwin Carrasquillo Assistant Building Superintendent (617) 954-2414 Johnny Figueroa Building Services Manager (617) 954-1019 Juan Oller Building Services Manager (617) 954-1119 Erin Anderson Manager of Capital Projects (617) 954-2337 Indrit Metaji Senior Capital Projects Manager (617) 954-2027 Transportation Name Title Contact info Shannon Smith Director of Transportation (617) 954 2355 Bob Carey Transportation Manager - Internal Operations (617) 947-5753 Kwok Chan Transportation Manager - Internal Operations (617) 954-3571 Brad Hill Transportation Manager - External Operations (617) 954-1028 Kin Kai Tse Scheduling & Staff Development Manager (617) 954-2518 Mary Linders Senior Transportation Manager - Contracts & Projects (617) 954-2142 Back to Top Navigation: site wide Home Contact Us Directions Work with Us News & Press Releases Explore Boston Privacy Policy Our Venues Thomas M. Menino Convention & Exhibition Center The Lawn on D John B. Hynes Veterans Memorial Convention Center MassMutual Center Boston Common Garage Linked In Twitter Facebook YouTube Subscribe (RSS) Massachusetts Convention Center Authority 415 Summer St Boston, MA 02210 P: 617.954.2000 , F: 617.954.2299 E: info@massconvention.com General Information Navigation: legal information © 2025 Massachusetts Convention Center Authority"
    },
    {
      "url": "https://www.islander.org/2025/05/1st-responders-ready-for-holiday-summer-season/",
      "text": "1st responders ready for holiday, summer season - The Anna Maria Islander 33 Body of missing Bean Point swimmer recovered Holmes Beach, county officials discuss paid beach parking Bradenton Beach moves to adopt $5M budget Cortez Marina neighbors push back on public boat ramp plan Toggle navigation E Edition News Latest News Streetlife Real Estate Obituaries Sports Sports Fishing Classifieds This weeks ads Place an AD Contact Us islander Store Submit Subscribe Today! Island news brings us together Subscribe for unlimited digital access to the news that matters to your community. #AMITOGETHER 1st responders ready for holiday, summer season by Robert Anderson on May 20, 2025 | Be the first to comment Facebook Twitter Subscribe Memorial Day weekend traditionally draws large crowds to Anna Maria Island and local public safety officials say they’re ready. “We will have some overtime officers out,” Bradenton Beach police Lt. Lenard Diaz said in a May 14 interview with The Islander. “We don’t really know what kind of weekend it’s going to be. Since the hurricanes, it’s been really kind of hit or miss as far as crowds.” But Diaz said he expects a busy beach weekend and he encouraged parents to keep an eye on their children. He also encouraged motorists to pack their patience. There likely will be traffic congestion and parking scarcity, though all public paid parking lots in the city have been repaired since the 2024 hurricanes and will be open. Diaz encouraged early arrival due to limited parking. In Holmes Beach, police Chief Bill Tokajer said his officers will be out in full force. “We are going to have officers out in force making sure that everybody is doing what they are supposed to be doing,” he said. “We want to make sure everyone has a safe weekend.” He warned of heavy traffic and advised visitors to plan accordingly. “Make sure you give yourself plenty of time to get to the island,” Tokajer said. “There’s going to be a lot of traffic. A lot of people. A lot of cars.” Motorists can find a parking map at holmesbeachfl.org under the “Find Parking” option in the “I want to…” section. Motorists should park “with all four tires off” the pavement, Tokajer advised. In 2024, 53,170 vehicles entered the island via the Manatee Avenue Bridge over Memorial Day weekend, based on information from the city’s license plate reader system. Tokajer said he anticipates similar numbers, weather permitting, this weekend. In Anna Maria, Sgt. Brett Getman, who heads up the Manatee County Sheriff’s Office substation, said the city was coordinating with special response teams and adding extra staff. “Like in years past, we are going to have extra overtime, traffic deputies, special response team members and extra beach patrols,” he said. Traffic safety will be a focus. “Children in golf carts need to have on a seat belt,” Getman said. “Our main focus is to educate people but we will also write citations if necessary.” “We want to have a fun family environment,” he said. “Just respect the beaches, throw your trash away and respect everyone’s personal space.” At the beaches, there will be law enforcement patrols, including the mounted police unit at Coquina Beach in Bradenton Beach. And Capt. Marshall Greene of the Manatee County Beach Patrol said all lifeguard stands — at Cortez, Coquina and Manatee beaches — will be staffed. “We’ll also have a roving patrol — one of our lifeguards driving from Coquina, Cortez and Manatee,” Greene said. “They’ll be patrolling up and down the beaches to make sure there’s safety across the whole island.” A personal watercraft also will be deployed during the busiest hours to patrol swim zones and respond to emergencies. “Come to the beach hydrated and with sun protection. Be ready to watch your children,” Greene advised. “A great way for parents to do that is to set up facing the water so their kids stay within sight.” He suggested families take a photo at the start of the day in case someone gets lost: “That way, if someone goes missing, we know exactly what they’re wearing and what they look like. It helps us tremendously.” Greene added that lifeguards are available for questions: “Oh yeah, we’re all very approachable and we love answering safety questions,” he said. “Anything that helps the safety of the beach — that’s what we’re here for. We want to prevent incidents before they occur.” Ferry from the mainland To ease road congestion, Manatee County’s Gulf Islands Ferry operates Thursday-Sunday. The ferry has two stops — one at the Riverwalk Pier, 452 Third Ave. W., Bradenton, and at the Historic Bridge Street Pier, 200 Bridge St., Bradenton Beach. Also, Manatee County Area Transit operates fare-free buses on Manatee Avenue and Cortez Road from the mainland, as well as an island trolley between the Anna Maria City Pier site in Anna Maria and Coquina Beach in Bradenton Beach. For more information about the ferry, go to bradentongulfislands.com. For more about MCAT, go to mymanatee.org. More from The Islander May 20, 2025 AM receives 2 bids to demo City Pier walkway May 20, 2025 Anna Maria Elementary bids farewell to 2 after decades of service May 20, 2025 RoadWatch: Eyes on the road – 05-21-2025 May 20, 2025 Holmes Beach drops memorial bench replacement cost to $1K Facebook Twitter Subscribe To advertise here, please visit our rates page or contact us at: sales@islander.org Phone: (941) 778-7978 Fax: (941) 778-9392 The Islander Poll: Do you swim at Bean Point? Yes. I used to. Never did. Where’s that? View Results Loading ... 3-Day Weather Forecast Newsletter signup Sign up to receive FREE email alerts when we update our site with news and classfieds. Email Please wait... Subscribe Thank you for sign up! Popular News Islander E-Edition For $36 a year , you can view all the news, photos, opinions, columns and community announcements To access this content, you must Subscribe here , or log in if you are a member. View our e-Edition Members On your mobile On your tablet Get news alerts Contact us Contact Us The Anna Maria Islander 10303 Spoonbill Road W., Bradenton FL 34209 Phone: (941) 778-7978 Fax: (941) 778-9392 For general information: info@islander.org Site design & maintained by Wayne Ansell Islander News Headlines E Edition Classifieds Place a Classified Ad Fishing Obituaries Real Estate Sports Streetlife Other Links About Us Legislative Contacts Privacy Copyright Archives Island Links Islander Store Web Services Subscribe Newsletter signup Sign up to receive FREE email alerts when we update our site with news and classfieds. Email Please wait... Subscribe Thank you for sign up! Social Media We use cookies to ensure that we give you the best experience on our website. If you continue to use this site we will assume that you are happy with it. Ok"
    },
    {
      "url": "https://www.gauseandassociates.com/portfolio-view/bradenton-area-convention-center/",
      "text": "Bradenton Area Convention Center Home Gause and  Associates, Inc. Meet the Team Testimonials Recent News Project Portfolio Athletic Facilities Commercial Office Docks Environmental Permitting Educational Recreational Sustainable Residential Subdivisions Institutional Services Testimonials Contact Us Bradenton Area Convention Center Main Institutional Bradenton Area Convention Center « Previous post Next Post » Institutional Client: Kronos Capital Info: Budget: $20,000,000 - Project Scope includes DRI modification, Development orders, planning, civil Engineering, landscape architectural and owner representation services associated with the approval and construction of the Inspired Living ALF in east Manatee County.  The project included the construction of a dog park area, swimming pool feature as well as permitting a boardwalk/gazebo structure within an existing lake. Comments are closed. 323 10th Ave. W. Suite 102 Palmetto, FL 34221 Office: 941.981.3089 Mobile: 941.713.0782 License: LA 00942 bob@gauseandassociates.com Facebook © Copyright 2017 Gause and Associates Website Design by SK Graphic Design"
    },
    {
      "url": "https://conventionsouth.com/directory-online/Bradenton-Area-Convention--Visitors-Bureau",
      "text": "Bradenton Area Convention & Visitors Bureau – Directory of Southern US Event Venues and Destinations – ConventionSouth Directory of Southern US Event Venues and Destinations - ConventionSouth ConventionSouth Skip to content Subscribe E-mail Sign-up ACCOUNT SETTINGS LOG OUT Home News Features Awards Awards Meeting Pros Resorts Resorts New or Renovated Music & Meetings Readers Choice Awards Meeting Pros to Watch Nominations Awards Nominations Readers’ Choice Awards Voting Destinations Destinations Hot Dates/Hot Deals Virtual Tours Event Planners’ Guides Southern Flavor Small Markets Convention Centers Health and Wellness New and Renovated Radiant Resorts Recreation and Meetings Small Markets Southern Fun Trend Cities WOW Destinations & Venues Rendezvous South Directory Resources Resources Industry Reports COVID-19 Information Digital Editions Newsletters Industry Reports Back The national planners’ resource for Southern destinations Search for: Directory of Southern US Event Venues and Destinations Bradenton Area Convention & Visitors Bureau << Back to previous page One Haben Blvd. Palmetto, FL 34221 www.bradentongulfislands.com Tel: (941) 729-9177 For More Information: Anna Pohl, General Manager info@bacvb.com Kirsten Lovett, Sales Representative kirsten.lovett@bacvb.com Metro Area Rooms 3,500 Largest Room Block City-wide 1,000 City Population 54,437 Area Population 323,510 Privacy Policy About Contact Advertise Advertise Subscribe Conference Awards Cookie Policy Login Lost your password? Don't have an account? Register here Register Sign-up for your account with Convention South. Please check the box below to confirm you would like to be added to Kenilworth Media’s various e-mail communications (includes e-newsletters, a survey now and then, and offers to the Convention South industry*). Leave this empty: YES, I CONSENT *We do not sell your e-mail address to 3rd parties, we simply forward their offers to you. Of course, you always have the right to unsubscribe from any communications you receive from us, should you change your mind in the future. We value your privacy We use cookies on our website to give you the most relevant experience by remembering your preferences and repeat visits. By clicking “Accept All”, you consent to the use of ALL the cookies. However, you may visit \"Cookie Settings\" to provide a controlled consent. Cookie Settings Accept All Consent Preferences Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website, anonymously. Cookie Duration Description cookielawinfo-checkbox-analytics 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\". cookielawinfo-checkbox-functional 11 months The cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Functional\". cookielawinfo-checkbox-necessary 11 months This cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\". cookielawinfo-checkbox-others 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other. cookielawinfo-checkbox-performance 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Performance\". viewed_cookie_policy 11 months The cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Functional functional Functional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features. Performance performance Performance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors. Analytics analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. Cookie Duration Description _ga 2 years The _ga cookie, installed by Google Analytics, calculates visitor, session and campaign data and also keeps track of site usage for the site's analytics report. The cookie stores information anonymously and assigns a randomly generated number to recognize unique visitors. _gat 1 minute This cookie is installed by Google Universal Analytics to restrain request rate and thus limit the collection of data on high traffic sites. _gat_UA- 1 minute A variation of the _gat cookie set by Google Analytics and Google Tag Manager to allow website owners to track visitor behaviour and measure site performance. The pattern element in the name contains the unique identity number of the account or website it relates to. _gid 1 day Installed by Google Analytics, _gid cookie stores information on how visitors use a website, while also creating an analytics report of the website's performance. Some of the data that are collected include the number of visitors, their source, and the pages they visit anonymously. CONSENT 2 years YouTube sets this cookie via embedded youtube-videos and registers anonymous statistical data. vuid 2 years Vimeo installs this cookie to collect tracking information by setting a unique ID to embed videos to the website. Advertisement advertisement Advertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads. Cookie Duration Description loc never AddThis sets this geolocation cookie to help understand the location of users who share the information. OAGEO session OpenX sets this cookie to avoid the repeated display of the same ad. OAID 1 year Cookie set to record whether the user has opted out of the collection of information by the AdsWizz Service Cookies. VISITOR_INFO1_LIVE 5 months 27 days A cookie set by YouTube to measure bandwidth that determines whether the user gets the new or old player interface. YSC session YSC cookie is set by Youtube and is used to track the views of embedded videos on Youtube pages. yt-remote-connected-devices never YouTube sets this cookie to store the video preferences of the user using embedded YouTube video. yt-remote-device-id never YouTube sets this cookie to store the video preferences of the user using embedded YouTube video. Others others Other uncategorized cookies are those that are being analyzed and have not been classified into a category as yet. Reject All Save My Preferences Accept All"
    },
    {
      "url": "https://www.bradentongulfislands.com/media/contact",
      "text": "Contact Information Press Trip Request Form 0º Search Beaches Discover Events Plan Water Ferry Newsletter Travel Guide Sustainability Menu Water Ferry Newsletter Sustainability Discover Arts & Culture Eat & Drink Outdoor Activities Shopping Spas & Wellness Beaches Beach Cams Beach Conditions Plan Getting Here 360 Degree Tour International Booking Stay Hotels & Resorts Rental Homes & Condos RV Parks & Campgrounds Events Meetings Sports Trip Inspiration Signature Venues Follow Us Loading 0º MEDIA Inquiries Bradenton Area Convention & Visitors Bureau Press Contact Kolby Gayson, Marketing and Communications Director, APR (941) 729-9177 Ext. 3956 [email protected] Domestic Public Relations Agency Press Contact Brianna Francis Madden Media (864) 606-9319 [email protected] International Press Contacts Bradenton Area Convention & Visitors Bureau Press Contact Kelly Clark, Global Affairs Director (941) 729-9177 Ext. 3946 [email protected] United Kingdom Agency Press Contact Barry Johnston, Gosh PR +44 (0)7715502054 [email protected] Press Trip Request Form Hello and thank you for your interest in the Bradenton Area! We welcome media inquiries from reporters, bloggers and influencers looking to learn more about our destination to share with others. If you would like for our destination to consider a familiarization trip request, please fill out the form below at least 30 days prior to your requested arrival time for domestic travel and 60 days for international travel. Partner Login Search Accessibility Travel Guide Meetings Discover Sports Venues Trip Inspiration Contact Us Sitemap Privacy Policy Film Media Facebook Pinterest Twitter Instagram ©2025 Bradenton Area Convention and Visitors Bureau in Bradenton, Florida | All Rights Reserved Get Your Destination Guide Subscribe To Our Newsletter Stay Connected"
    },
    {
      "url": "https://www.islander.org/2023/12/ferry-rides-linking-island-mainland-set-to-begin-dec-8/",
      "text": "Ferry rides linking island-mainland set to begin Dec. 8 - The Anna Maria Islander 33 Body of missing Bean Point swimmer recovered Holmes Beach, county officials discuss paid beach parking Bradenton Beach moves to adopt $5M budget Cortez Marina neighbors push back on public boat ramp plan Toggle navigation E Edition News Latest News Streetlife Real Estate Obituaries Sports Sports Fishing Classifieds This weeks ads Place an AD Contact Us islander Store Submit Subscribe Today! Island news brings us together Subscribe for unlimited digital access to the news that matters to your community. #AMITOGETHER Ferry rides linking island-mainland set to begin Dec. 8 by Ryan Paice on December 5, 2023 | Be the first to comment Facebook Twitter Subscribe People board the Downtown Duchess Nov. 20 for the ferry’s inaugural voyage to the island. The ferry is set to launch for public transit Dec. 8. The service will initially operate 10 a.m.-9 p.m. Friday-Sunday, ferrying passengers between downtown Bradenton, the Anna Maria City Pier and the Historic Bridge Street Pier in Bradenton Beach. Islander Photo: Ryan Paice A map from the Gulf Islands Ferry webpage — www.bradentongulfislands.com/gulf-islands-ferry — shows the planned routes for the two 50-foot catamarans to be put into service Dec. 8. A one-way trip will cost $5-$8, with children under the age of 3 riding for free. Islander Courtesy Photo Dec. 8 update: An announcement for the Gulf Islands Ferry Service said the startup was delayed until January. Public transport is taking to the seas to link Anna Maria Island to mainland Bradenton. Manatee County’s Gulf Islands Ferry program will begin at 10 a.m. Friday, Dec. 8, pending final certification from the U.S. Coast Guard. The service includes two 50-foot catamarans operated by Clearwater-based Gulf Coast Water Taxi, which will staff each of the 49-passenger vessels with two crew members on the route. The program will initially run 10 a.m.-9 p.m. Friday-Sunday, ferrying passengers between downtown Bradenton, the Anna Maria City Pier and the Historic Bridge Street Pier in Bradenton Beach. Future ferry stops are planned for Coquina Beach and Longboat Key. The first leg of the trip — Bradenton to Anna Maria — is estimated to take 35 minutes. A one-way trip will cost $8, which is discounted to $5 for children ages 3-11 and $6 for seniors 55 and up. Children under the age of 3 ride free. Passengers will be allowed beach gear on the ferries, as well as service animals and “leashed, well-behaved pets … as long as they do not bother other guests,” according to a Gulf Islands Ferry fact sheet. The service also can accommodate groups, as long as arrangements are made at least two weeks ahead by emailing Kristi Watson at kristi@gulfcoastwatertaxi.com. More from The Islander December 5, 2023 Islanders welcome holiday season with tree lighting December 5, 2023 5 applicants now seeking 2 Anna Maria commission seats December 5, 2023 Playing shy with Santa September 9, 2025 Body of missing Bean Point swimmer recovered Facebook Twitter Subscribe To advertise here, please visit our rates page or contact us at: sales@islander.org Phone: (941) 778-7978 Fax: (941) 778-9392 The Islander Poll: Do you swim at Bean Point? Yes. I used to. Never did. Where’s that? View Results Loading ... 3-Day Weather Forecast Newsletter signup Sign up to receive FREE email alerts when we update our site with news and classfieds. Email Please wait... Subscribe Thank you for sign up! Popular News Islander E-Edition For $36 a year , you can view all the news, photos, opinions, columns and community announcements To access this content, you must Subscribe here , or log in if you are a member. View our e-Edition Members On your mobile On your tablet Get news alerts Contact us Contact Us The Anna Maria Islander 10303 Spoonbill Road W., Bradenton FL 34209 Phone: (941) 778-7978 Fax: (941) 778-9392 For general information: info@islander.org Site design & maintained by Wayne Ansell Islander News Headlines E Edition Classifieds Place a Classified Ad Fishing Obituaries Real Estate Sports Streetlife Other Links About Us Legislative Contacts Privacy Copyright Archives Island Links Islander Store Web Services Subscribe Newsletter signup Sign up to receive FREE email alerts when we update our site with news and classfieds. Email Please wait... Subscribe Thank you for sign up! Social Media We use cookies to ensure that we give you the best experience on our website. If you continue to use this site we will assume that you are happy with it. Ok"
    }
  ]
}