{
  "fuentes": [
    {
      "url": "https://www.thebreakercollective.com/contactus",
      "email": "admin1@thebreakercollective.com"
    },
    {
      "url": "https://www.thebreakercollective.com/contactus",
      "email": "admin@thebreakercollective.com"
    },
    {
      "url": "https://www.thebreakers.com/careers/",
      "email": "reservations@thebreakers.com"
    },
    {
      "url": "https://www.optimaproperties.com/breakers-west-west-palm-beach-florida/",
      "email": "info@optimaproperties.com"
    },
    {
      "url": "https://www.optimaproperties.com/breakers-west-west-palm-beach-florida/",
      "email": "kim@optimaproperties.com"
    },
    {
      "url": "https://www.breakersnorth.com/contact/",
      "email": "holiday@breakersnorth.com"
    },
    {
      "url": "https://www.thebreakers.com/press-resource-center/general-information/fact-sheet/",
      "email": "reservations@thebreakers.com"
    },
    {
      "url": "https://breakers-fc.com/about/staff/",
      "email": "kian@breakersacademy.org"
    },
    {
      "url": "https://breakers-fc.com/about/staff/",
      "email": "markus@breakersacademy.org"
    },
    {
      "url": "https://breakers-fc.com/about/staff/",
      "email": "nisa@breakersacademy.org"
    },
    {
      "url": "https://breakers-fc.com/about/staff/",
      "email": "sergi@breakersacademy.org"
    },
    {
      "url": "https://breakers-fc.com/about/staff/",
      "email": "victor@breakersacademy.org"
    },
    {
      "url": "https://breakers-fc.com/about/staff/",
      "email": "zoran@breakersacademy.org"
    }
  ],
  "mails": [
    "admin1@thebreakercollective.com",
    "admin@thebreakercollective.com",
    "holiday@breakersnorth.com",
    "info@optimaproperties.com",
    "kian@breakersacademy.org",
    "kim@optimaproperties.com",
    "markus@breakersacademy.org",
    "nisa@breakersacademy.org",
    "reservations@thebreakers.com",
    "sergi@breakersacademy.org",
    "victor@breakersacademy.org",
    "zoran@breakersacademy.org"
  ],
  "nombre_sitio": "breakerswestclub.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.thebreakercollective.com/contactus",
      "text": "Contact us — The Breaker Collective 0 Skip to Content Home About The Breakout Upcoming Events Sign Up Services Contact Us Open Menu Close Menu Home About The Breakout Upcoming Events Sign Up Services Contact Us Open Menu Close Menu Home About The Breakout Upcoming Events Sign Up Services Contact Us Get in Touch with The Breaker Collective We'd love to hear from you! Your ideas, feedback, and questions are valuable to us. Whether you're curious about our locations, services, or have suggestions for our collective, don't hesitate to reach out. Your input helps us make The Breaker Collective better for everyone. You can reach us by filling out the form below or emailing us directly at admin1@thebreakercollective.com. Thank you for being part of our community. Your involvement is helping to break barriers and build a better future for women everywhere. The Breaker Collective email: admin1@thebreakercollective.com Hampshire, UK Name * First Name Last Name Email * Subject Message * Thank you! We respect your privacy. Your information is safe and will never be shared The Breaker Collective: breaking barriers in work-life balance for women. Contact Us Privacy Policy"
    },
    {
      "url": "https://www.thebreakers.com/careers/",
      "text": "Join Our Team | Careers at The Breakers Skip to main content MENU CALL Check Availability Accommodations Guest Rooms Suites Flagler Club Accessible Rooms & Suites Amenities Browse All Accommodations Activities Pools & Beach Bungalows The Spa Fitness Golf Racquet Sports Shopping Family Activities Holiday Events Browse All Activities Dining HMF Flagler Steakhouse Seafood Bar Echo Henry’s Palm Beach The Italian Restaurant The Circle The Beach Club Restaurant Ocean House The Surf Break In-Room Dining Sunday Brunch Special Events & Holidays Browse All Dining Events Meetings Weddings & Celebrations Venues & Floor Plans Browse All Events Special Offers Resort Offers Dining Offers Browse All Special Offers Photos About The Breakers Mobile App Memberships Gift Cards Contact Us Careers Call: Check Availability Check Availability With more than 100 available opportunities, discover the perfect career The Breakers is where you belong. Here, it's more than making a living—it's making a life. APPLY NOW Workplace Information Superior compensation and benefits, a culture of giving back, opportunities to grow—find out what makes us a world-renowned workplace SEE MORE Great Place to Work® We are honored to be named a Fortune 100 Best Companies to Work For® SEE MORE Join Our Team We’re always searching for dynamic individuals to join The Breakers team—view our available positions and apply online APPLY NOW On-Campus Recruiting We search worldwide, giving top talent the chance to learn and evolve their skills at our award-winning resort SEE MORE From The Team Hear team members share their experiences and what it's like to work at The Breakers VIDEO Social Impact Our sense of social responsibility extends to our team, our environment and our community SEE MORE Stay Connected: Follow us on LinkedIn to peek inside our culture and see the newest jobs available --- From Fortune . ©2025 Fortune Media IP Limited. All rights reserved. Fortune and Fortune 100 Best Companies to Work For® are registered trademarks of Fortune Media IP Limited and are used under license. Fortune and Fortune Media IP Limited are not affiliated with, and do not endorse products or services of The Breakers. Give the Gift of Luxury: The Breakers Gift Card PURCHASE NOW About The Breakers Contact Us Location Guest Policies Careers Press Resource Center Residential Leases Resort Accessibility Privacy Policy CA Notice at Collection Terms of Use Accessibility Sign Up for Special Offers Sign Up for Special Offers CONNECT WITH US The Breakers One South County Road Palm Beach , FL 33480 © 2025 The Breakers Palm Beach, FL. All rights reserved. Close"
    },
    {
      "url": "https://www.optimaproperties.com/breakers-west-west-palm-beach-florida/",
      "text": "Breakers West County Club Homes for Sale in West Palm Beach, Florida Serving South Florida For over 40 years Facebook Facebook Twitter Twitter LinkedIn LinkedIn Pinterest Pinterest Instagram Instagram Instagram Instagram Active Rain Active Rain Realtor Realtor yelp yelp 561.251.7170 info@optimaproperties.com Buyer Agency About Buyer Agency Buyer Representation – Exclusive Buyer’s Agent Customer vs. Client Exclusive Buyers Single Agency Duties Glossary of Terms Fair Housing Pledge For Buyers Property Search Exclusive Buyers Single Agency Duties New Construction Assistance Relocation Assistance Buyer’s Guide Foreign Buyers Guide Home Buying Tips & Advice Finance Center Home Buyer Resources In The News Glossary of Terms Property Organizer Communities South Florida Broward County Coral Springs Deerfield Beach Fort Lauderdale Hillsboro Beach Lauderdale By The Sea Lighthouse Point Parkland Pompano Beach Sea Ranch Lakes Palm Beach County Boca Raton Boynton Beach Delray Beach Gulf Stream Highland Beach Hypoluxo Juno Beach Jupiter Jupiter Inlet Colony Lake Worth Manalapan North Palm Beach & Lake Park Ocean Ridge Palm Beach Palm Beach Gardens Singer Island South Palm Beach Tequesta Wellington Westlake West Palm Beach Property Search Services Relocation Assistance Vacation Properties Investment Properties Evaluating a Real Estate Investment Tax Deductions For Rental Properties Exclusive Buyers Single Agency Duties Fair Housing Pledge Meet Kim Meet Kim Exclusive Buyer Agent Testimonials Blog Blog Contact Us! Back Home Home » Breakers West Country Club Breakers West Country Club Breakers West Country Club in a luxury, gated home community in West Palm Beach , located in Palm Beach County, Florida. Real estate in Breakers West is dived into villas, single family homes and custom estate homes. The 540 homes in Breakers West Country Club are located throughout the luxury enclave in various smaller and often gated subdivisions. Breakers West Country Club is conveniently located to both downtown West Palm Beach and Wellington and features 2 entrances for easy access to the community. Close to the areas best schools, shopping and dining, Breakers West puts you at the center of it all. Breakers West features two championship golf courses including one designed by Rees Jones. Residents of the stunning Breakers West also enjoy a terrific tennis facility, large fitness center, resort-style swimming pool with Jacuzzi and 670 acre wildlife sanctuary. Breakers West subdivisions include; Sand Drift Villas, Fairway Villas, Spray Cottages, Gulfstream Cottages, Seagull Park, Cypress Isles Estates, The Enclave, Flagler Manor, The Colony, The Lakes, Breakers Pointe, Flagler Estates, The Estates and Clubhouse Estates. Breakers West Country Club has NO mandated club membership. Unlike any other country club communities in the area, Breakers West gives you the choice to pick which membership suits your needs, or none at all. There are 2 exclusive country clubs in the Breakers West community: Breakers West Country Club and Mayacoo Lakes Country Club. Breakers West Country Club offers unique and creative membership options for anyone dreaming of living in an active community with fantastic amenities at your disposal. Mayacoo Lakes offers its members an exceptional golf course design combined with pristine playing conditions. Mayacoo Lakes’ members continue to reinforce family values and traditions passed down from generation to generation. As one of the bigger and more populous cities in Palm Beach County , West Palm Beach offers a variety of residential real estate choices for almost any preference and budget. Potential homeowners may select from all sorts of condominiums, town homes and villas, or single-family homes from the different communities in the city. There’s also a wide range of architectural styles available, whether you’re looking for a contemporary, tropical, or more traditionally styled structure (the latter, especially in the historic districts). Just minutes from the Palm Beach International Airport , City Place and the Kravis Center in West Palm Beach , Worth Avenue on the Island of Palm Beach , Jupiter, Singer Island and Wellington . View Homes for Sale in Breakers West Country Club below.  Call Kim Bregman at 561-251-7170 for a private showing. 18 Results Refine Search Min. Price $ Max. Price $ Beds Any 1+ 2+ 3+ 4+ 5+ Baths Any 1+ 2+ 3+ 4+ 5+ Update Sort Price (High to Low) Price (Low to High) Status City Listing Date Type / Price Descending Listing Number Open Home Date Asc 1504 Breakers West Boulevard, West Palm Beach, FL 33411 1 $3,850,000 Beds: 4 Baths: 4 | 1 Sq. Ft.: 4,414 67 Photos 1504 Breakers West Boulevard, West Palm Beach, FL 33411 × Close Virtual Tour Listing # RX-11104744 1648 Cypress Row Drive, West Palm Beach, FL 33411 2 $3,550,000 Beds: 4 Baths: 4 | 1 Sq. Ft.: 5,612 73 Photos 1648 Cypress Row Drive, West Palm Beach, FL 33411 × Close Virtual Tour Listing # RX-11083862 1785 Flagler Manor Circle, West Palm Beach, FL 33411 3 $2,699,000 Beds: 4 Baths: 3 | 1 Sq. Ft.: 3,274 81 Photos 1785 Flagler Manor Circle, West Palm Beach, FL 33411 × Close Virtual Tour Listing # RX-11088668 1921 Flagler Estates Drive, West Palm Beach, FL 33411 4 $2,600,000 Beds: 4 Baths: 5 Sq. Ft.: 4,423 75 Photos 1921 Flagler Estates Drive, West Palm Beach, FL 33411 × Close Virtual Tour Listing # RX-11106577 1257 Breakers West Boulevard, West Palm Beach, FL 33411 5 $2,350,000 Beds: 3 Baths: 2 | 1 Sq. Ft.: 3,480 42 Photos 1257 Breakers West Boulevard, West Palm Beach, FL 33411 × Close Virtual Tour Listing # RX-11102524 1697 Mayacoo Lakes Boulevard, West Palm Beach, FL 33411 6 $2,350,000 Beds: 3 Baths: 3 | 1 Sq. Ft.: 3,489 67 Photos 1697 Mayacoo Lakes Boulevard, West Palm Beach, FL 33411 × Close Virtual Tour Listing # RX-11089564 1770 Flagler Manor Circle, West Palm Beach, FL 33411 7 $1,500,000 Beds: 4 Baths: 3 | 1 Sq. Ft.: 3,274 60 Photos 1770 Flagler Manor Circle, West Palm Beach, FL 33411 × Close Virtual Tour Listing # RX-11093497 9445 E Fairway Terrace, West Palm Beach, FL 33411 8 $1,285,000 Beds: 3 Baths: 3 Sq. Ft.: 1,898 50 Photos 9445 E Fairway Terrace, West Palm Beach, FL 33411 × Close Virtual Tour Listing # RX-11063815 1121 Sand Drift Way #D, West Palm Beach, FL 33411 9 $825,000 Beds: 3 Baths: 2 Sq. Ft.: 2,027 59 Photos 1121 Sand Drift Way #D, West Palm Beach, FL 33411 × Close Virtual Tour Listing # RX-11114065 9453 E Fairway Terrace, West Palm Beach, FL 33411 10 $719,000 Beds: 2 Baths: 2 | 1 Sq. Ft.: 1,759 50 Photos 9453 E Fairway Terrace, West Palm Beach, FL 33411 × Close Virtual Tour Listing # RX-11103536 9005 Baybury Lane, West Palm Beach, FL 33411 11 $672,000 Beds: 3 Baths: 2 Sq. Ft.: 2,069 23 Photos 9005 Baybury Lane, West Palm Beach, FL 33411 × Close Virtual Tour Listing # RX-10992940 1120 Sand Drift Way #D, West Palm Beach, FL 33411 12 $599,000 Beds: 3 Baths: 2 Sq. Ft.: 2,016 50 Photos 1120 Sand Drift Way #D, West Palm Beach, FL 33411 × Close Virtual Tour Listing # RX-11077802 9158 Heathridge Drive, West Palm Beach, FL 33411 13 $550,000 Beds: 3 Baths: 2 | 1 Sq. Ft.: 2,069 61 Photos 9158 Heathridge Drive, West Palm Beach, FL 33411 × Close Virtual Tour Listing # RX-11061820 9089 Baybury Lane, West Palm Beach, FL 33411 14 $545,000 Beds: 3 Baths: 2 | 1 Sq. Ft.: 2,069 32 Photos 9089 Baybury Lane, West Palm Beach, FL 33411 × Close Virtual Tour Listing # RX-11068369 9190 Heathridge Drive, West Palm Beach, FL 33411 15 $514,500 Beds: 3 Baths: 2 Sq. Ft.: 1,471 31 Photos 9190 Heathridge Drive, West Palm Beach, FL 33411 × Close Virtual Tour Listing # RX-11114458 9358 Heathridge Drive, West Palm Beach, FL 33411 16 $499,000 Beds: 3 Baths: 2 Sq. Ft.: 1,471 54 Photos 9358 Heathridge Drive, West Palm Beach, FL 33411 × Close Virtual Tour Listing # RX-11104711 9023 Baybury Lane, West Palm Beach, FL 33411 17 $490,000 Beds: 3 Baths: 2 Sq. Ft.: 1,536 43 Photos 9023 Baybury Lane, West Palm Beach, FL 33411 × Close Virtual Tour Listing # RX-11068811 1151 Sand Drift Way #C, West Palm Beach, FL 33411 18 $449,000 Beds: 3 Baths: 2 | 1 Sq. Ft.: 1,795 51 Photos 1151 Sand Drift Way #C, West Palm Beach, FL 33411 × Close Virtual Tour Listing # RX-11067540 « 1 of 1 » This information is not verified for authenticity or accuracy and is not guaranteed. © 2025 Beaches MLS, Inc. All rights reserved. The data relating to real estate for sale/lease on this website comes from a cooperative data exchange program of the Multiple Listing Service (MLS) in which these Brokers participate. The properties displayed may not be all of the properties in the MLS database or all of the properties listed with Brokers participating in the cooperative data exchange program. Properties listed by Brokers other than this Broker are marked with the IDX Symbol, indicating an agreement to the exchanged property information. Detailed information about such properties includes the name of the listing Broker's Company. Information is thought to be reliable but is not guaranteed to be accurate. You are advised to verify facts that are important to you. No warranties, expressed or implied are provided for the data herein, or for their use or interpretation by the user. This information is protected from unlawful duplication by copyright. Federal law prohibits discrimination on the basis of race, color, religion, sex, handicap, familial status, or national origin in the sale, rental or financing of housing. The listing broker's offer of compensation is made to participants of BeachesMLS, where the listing is filed, as well as participants of MLSs participating in MLSAdvantage or a data share with BeachesMLS. Beaches MLS data last updated at September 10, 2025, 6:52 PM ET Real Estate IDX Powered by iHomefinder Kim N. Bregman Optima Properties Lic. Real Estate Broker EBA, CEBA, ABR, REALTOR, MBA, RSPS kim@optimaproperties.com Palm Beach and Broward Counties 561-251-7170 Cell 561-892-0937 Fax SOUTH FLORIDA communities Find My Dream Property Help Me Relocate Schedule A Complimentary Consultation Sign Up For A Personalized Listing Cart All information is provided by the licensed REALTOR®/Broker/Agent. This information is not verified for authenticity or accuracy and is not guaranteed. This website is not responsible or liable in any manner for any content posted herein or in connection with our services. Information is not guaranteed and must be confirmed by the end user. Buyer Agency About Buyer Agency Buyer Representation – Exclusive Buyer’s Agent Customer vs. Client Exclusive Buyers Single Agency Duties Glossary of Terms Fair Housing Pledge For Buyers Property Search Exclusive Buyers Single Agency Duties New Construction Assistance Relocation Assistance Buyer’s Guide Foreign Buyers Guide Home Buying Tips & Advice Finance Center Home Buyer Resources In The News Glossary of Terms Property Organizer Communities South Florida Broward County Coral Springs Deerfield Beach Fort Lauderdale Hillsboro Beach Lauderdale By The Sea Lighthouse Point Parkland Pompano Beach Sea Ranch Lakes Palm Beach County Boca Raton Boynton Beach Delray Beach Gulf Stream Highland Beach Hypoluxo Juno Beach Jupiter Jupiter Inlet Colony Lake Worth Manalapan North Palm Beach & Lake Park Ocean Ridge Palm Beach Palm Beach Gardens Singer Island South Palm Beach Tequesta Wellington Westlake West Palm Beach Property Search Services Relocation Assistance Vacation Properties Investment Properties Evaluating a Real Estate Investment Tax Deductions For Rental Properties Exclusive Buyers Single Agency Duties Fair Housing Pledge Meet Kim Meet Kim Exclusive Buyer Agent Testimonials Blog Blog Contact Us! Copyright © 2025 OPTIMA PROPERTIES. All Rights Reserved. Privacy Policy | Intellectual Property Rights | Sitemap | Real Estate Website Design & Internet Marketing by Agent Image MLS"
    },
    {
      "url": "https://www.breakersnorth.com/contact/",
      "text": "Contact - Enquire - Get Directions - Breakers North Skip to content BOOK DIRECT & SAVE NOW +61 7 5538 8888 Facebook Instagram Home Accommodation 1 Bedroom Apartments 2 Bedroom Beachfront 2 Bedroom Beachront Superior 2 Bedroom City View 2 Bedroom Ocean View 2 Bedroom Pool View 2 Bedroom Deluxe Garden View Location About Resort & Facilities FAQs Guest Reviews Long Stays Permanent Rentals Specials Gallery Contact Book Now Menu Home Accommodation 1 Bedroom Apartments 2 Bedroom Beachfront 2 Bedroom Beachront Superior 2 Bedroom City View 2 Bedroom Ocean View 2 Bedroom Pool View 2 Bedroom Deluxe Garden View Location About Resort & Facilities FAQs Guest Reviews Long Stays Permanent Rentals Specials Gallery Contact Book Now Previous slide Next slide Contact Us (07) 5538 8888 holiday@breakersnorth.com 50 Old Burleigh Rd, Surfers Paradise, Gold Coast Reception open 7 days 8.30am – 5pm Monday – Friday 8.30am – 2pm Saturday 8.30am – 12pm Sunday If you’re checking in after office hours, please contact us prior to your arrival to arrange access to our afterhours key safe. Enquire Now 50 Old Burleigh Rd - Get Directions Join VIP Club & Save Contact Us Phone: (07) 5538 8888 International: +61 7 5538 8888 Email: holiday@breakersnorth.com © Breakers North Gold Coast Book Now Home Accommodation Location About Specials Gallery Blog Contact Long Stays Permanent Rentals Privacy Policy Terms & Conditions Menu Home Accommodation Location About Specials Gallery Blog Contact Long Stays Permanent Rentals Privacy Policy Terms & Conditions Location 50 Old Burleigh Rd, Surfers Paradise, Gold Coast, QLD, 4217 Site by Comworks Book Your summer holidays now Get in quick for your bookings as our remaining rooms are moving fast!"
    },
    {
      "url": "https://www.thebreakers.com/press-resource-center/general-information/fact-sheet/",
      "text": "Fact Sheet Skip to main content MENU CALL Check Availability Accommodations Guest Rooms Suites Flagler Club Accessible Rooms & Suites Amenities Browse All Accommodations Activities Pools & Beach Bungalows The Spa Fitness Golf Racquet Sports Shopping Family Activities Holiday Events Browse All Activities Dining HMF Flagler Steakhouse Seafood Bar Echo Henry’s Palm Beach The Italian Restaurant The Circle The Beach Club Restaurant Ocean House The Surf Break In-Room Dining Sunday Brunch Special Events & Holidays Browse All Dining Events Meetings Weddings & Celebrations Venues & Floor Plans Browse All Events Special Offers Resort Offers Dining Offers Browse All Special Offers Photos About The Breakers Mobile App Memberships Gift Cards Contact Us Careers Call: Check Availability Check Availability Press Resource Center General Information Fact Sheet Resort Overview Resort Profile: One of America’s most iconic resorts, The Breakers is an Italian Renaissance-style hotel situated on 140 acres of oceanfront property on the island of Palm Beach, Florida. Founded in 1896 by magnate Henry Morrison Flagler, and still in the hands of his heirs today, this legendary destination continues to thrive independent of chain affiliation. Renowned for its commitment to social responsibility, The Breakers actively supports its team, the local community, and environmental initiatives. Its historic significance is also recognized nationally, earning a place on the National Register of Historic Places. Architecture: Inspired by the magnificent Italian villas of the 1400s (specifically the Villa Medici in Rome), The Breakers' Mediterranean-style architecture features an eight-story palace by the sea with sun-filled North and South Loggias, iconic Twin Belvedere Towers and graceful arches throughout. The lushly landscaped 1,040-foot, palm-lined main drive leads to the resort’s Florentine Fountain, modeled after the Boboli Gardens in Florence. The hotel’s breathtaking lobby is influenced by the Great Hall of the Palazzo Carrega in Genoa (circa 1560). Location: The Breakers is six miles from Palm Beach International Airport (PBI), 42 miles from Fort Lauderdale–Hollywood International Airport (FLL) and 72 miles from Miami International Airport (MIA). Both Interstate 95 and the Florida Turnpike provide easy access to South County Road, which leads directly to the resort’s main entrance. Climate: With close proximity to the Gulfstream, Palm Beach enjoys a subtropical climate noted for year-round breezes and moderate temperatures ranging from 75-85 degrees. Ownership: Flagler System, Inc. (FSI) is the privately held parent company and original family ownership of The Breakers Palm Beach , Breakers West Country Club , One North Breakers Row , and various commercial real estate properties on the island. Each year, an investment averaging $30 million in capital improvements and ongoing revitalization carefully balances preservation and modernization. Leadership: Paul N. Leone, CEO, and Tricia Taylor, President, lead a dedicated and diverse team of 2,400 employees. Residences: One North Breakers Row is a private enclave of 79 luxurious, oceanfront apartments available for residential lease. Memberships: Access to premium amenities and exclusive courtesies is available through various club memberships at The Breakers Ocean Club and Breakers West Country Club . Accommodations: The resort features 534 guest rooms, including 72 suites—among them are the most elaborate: the Imperial and Royal Poinciana Suites. Each room offers captivating views of the Atlantic or resort grounds, décor inspired by Palm Beach’s casually chic lifestyle and complimentary high-speed WiFi. Childproofing and parental equipment are also available upon request. An intimate, exceptionally customized experience, The Breakers’ luxurious Flagler Club is an exclusive, 21-room boutique hotel nestled atop the resort. Private access leads to beautifully appointed accommodations, top-of-the-line amenities, an elegant Lounge and panoramic rooftop Terrace, as well as personalized service from pre-arrival to departure. Guest Services: Committed to guest satisfaction, the resort’s highly attentive team fulfills a range of services, such as concierge, laundry, valet parking, and complimentary house car/shuttle to off-site restaurants and retail boutiques. Amenities: Ten restaurants range from casual beachfront to stylishly sophisticated, while a world-class private beach club hosts four pools, six whirlpool spas, 25 poolside bungalows and a variety of watersports. In addition, there are two 18-hole golf courses, 16 racquet courts, a world-class indoor/outdoor spa, an oceanfront fitness center, 13 signature boutiques, Via Flagler by The Breakers - an al fresco shopping plaza, and a Family Entertainment Center. There is also never a resort fee. Dining: Flagler Steakhouse : Located on the second floor of The Breakers Golf & Racquet Clubhouse, this fresh take on the classic American chophouse serves a diverse menu of outstanding steaks, fish, classic broiler items and more. The restaurant’s climate-controlled outdoor terrace provides al fresco dining with panoramic views of Ocean Course. HMF : Named after resort founder, Henry M. Flagler, this chic social club gives a modern nod to the classic Palm Beach cocktail culture of the 50s and 60s. The menu flaunts eclectic, globally-influenced shared plates, handcrafted cocktails and an award-winning wine list. Seafood Bar : Creating the sense of dining aboard a luxury, private yacht, this oceanfront restaurant is a dining favorite among guests and Palm Beach residents. The menu boasts the freshest seafood, inspiring cocktails and Master Sommelier-selected wines. The Circle : An architectural gem with arched windows that offer glimpses of the Atlantic and a soaring 30-foot, hand-painted ceiling, The Circle welcomes guests daily for breakfast. Each morning, an artfully crafted buffet, as well as an à la carte menu are served. The restaurant’s spectacular Sunday Brunch is a Palm Beach tradition not to be missed. The Italian Restaurant : This casual, yet contemporary, restaurant is adjacent to the Family Entertainment Center, making it a favorite for guests of all ages. Classic comfort dishes and lighter menu selections highlight the flavors of Italy. Outdoor patio seating is available. Restaurants located off property Echo : Situated only a few minutes from the resort, this stylish, highly popular restaurant spotlights the distinct cuisines of Asia, specifically the aromatic and flavorful specialties of China, Japan, Korea, Thailand and Vietnam. Henry’s Palm Beach : This inviting, American-inspired bistro showcases elevated comfort food with character. It is located at Via Flagler by The Breakers on Royal Poinciana Way, Palm Beach’s original Main Street (minutes from the hotel). Available exclusively for hotel guests and club members In-Room Dining : A complete menu of breakfast, lunch, dinner and light fare is available to enjoy in the privacy of one's guest room. Ocean House : Located at the south end of The Beach Club with gorgeous pool and ocean views, this beach house-style restaurant, with a covered wrap-around porch, welcomes guests with laid-back luxury. An inspired daytime menu of light bites, colorful salads, sandwiches, seafood and refreshing cocktails can be enjoyed among swaying palms and sea breezes. The Beach Club Restaurant : Coming Soon -this transformation will feature a stylishly relaxed setting serving coastal Mediterranean cuisine. Learn more . The Surf Break : Steps from the shore, this open-air oasis envelops guests with tranquil breezes and ocean views; guests can relax with a refreshing cocktail or light bite. Recreation & Activities: Beach Club : Exclusively available for hotel guests and club members, the resort’s private Beach Club treats visitors to magnificent vistas of the ocean, as well as: Four Pools & Six Whirlpool Spas : Includes an adult-only pool and zero-entry pool—ideal for families. 25 Poolside Bungalows : Available for daytime rental, these premium poolside cabanas are the perfect oasis for couples, families and friends. Each vibrant, island-chic retreat has a private full bathroom with shower, an individual climate control system, a dedicated concierge and much more. Watersports : Splash the day away with a variety of activities such as kayaking, paddleboarding, boogie boarding and more. Family Entertainment Center : Activities, entertainment and games for guests of all ages can be found at this 6,100-square-foot, multi-faceted complex: Arcade : Explore more than 20 classic and contemporary games, from Skee-Ball, Super Shot Basketball and air hockey to a video game lounge with Xbox® and PlayStation® 4. Family Programs : Specially designed daily activities are available for guests of all ages and varying interests, from poolside spin art and campfire films to bike rentals, trivia and more. Outdoor Playground : The 4,500-square-foot playground is designed for movement with slides, tunnels, bridges and other park-like activities. Sunshades and outdoor lighting allow for family fun day or night. Recreation : A nine-hole mini golf course and outdoor basketball court are perfect for individual or group play. Golf : Two 18-hole courses deliver variety and playability for all levels. Ocean Course : Discover acre upon acre of lush greens at one of Florida’s oldest golf courses. Most recently redesigned by renowned golf course architect Rees Jones, Ocean Course offers contemporary playability for all skill levels. The Breakers Rees Jones® Course : Located 10 miles from the resort and set against the backdrop of the picturesque Breakers West residential community, The Breakers Rees Jones® Course allows for flexible play with varying degrees of risk, reflecting the signature style for which this eminent architect is known. John Webster Golf Academy : Nationally recognized golf professionals provide instruction in private lesson and golf school formats, ideal for players of all skill levels. Children’s clinics and custom club fittings are available. Ocean Fitness : This spectacular, 6,000-square-foot, indoor-outdoor fitness center is located above the resort’s Beach Club complex. An array of resources help individuals reach their personal fitness goals in an inspiring ocean-view setting. A network of customized fitness solutions includes state-of-the-art equipment, expert personal training and complimentary fitness classes . A half mile away, guests may bike, jog or take a leisurely stroll outdoors along the Intracoastal Waterway on Palm Beach’s Lake Trail. Tennis : The new, world-class tennis & racquet facilities feature 16 state-of-the-art, open-air courts - inclusive of tennis, pickleball and padel - each with an exclusive comfort and refreshment station. Players have a choice of three surfaces for preferred tennis play (hydroponic grass, hydro clay or cushioned hardtop). Clinics and private lessons with USPTA/USPTR-certified professional instructors are available, while covered and lighted courts provide flexible play options. The Shops at The Breakers : Absolutely Suitable® – designer swimwear and accessories Guerlain – fragrance, skincare and cosmetics direct from Paris Mary Lily’s® – sweet treats, ice cream, frozen custard and gelato Match at The Breakers® – the ultimate shoe salon for resort footwear Mix at The Breakers® – fine and fashion jewelry and accessories News & Gourmet® – artisan coffee, distinctive gifts, books and more Polo Ralph Lauren – contemporary apparel from a classic American designer Polo Ralph Lauren Kids – timeless attire for boys, girls and baby Signature Shop – private label collections of logo’ed clothing and accessories The Beach Shop – sun products, beach toys, hats and more The Sports Pro Shop – sports apparel and equipment boutique Off-site boutiques located at Via Flagler by The Breakers : Main Street by The Breakers® – gift shop & classic café with donuts, home décor and more SHAN – high-end resort wear and swimwear The Spa : The indoor-outdoor spa embraces guests with a contemporary, Italian-inspired design and a fresh, soothing atmosphere that engages all the senses. Amenities include 17 treatment rooms; a private courtyard; lounges for men, women and co-ed use; and a salon area for hair and nail services. A carefully curated menu of treatments, delivered by expertly trained professionals, features the finest, handcrafted skin and body care products. Meetings & Events: Conference Services : With over 80,000 square feet of versatile meeting space, The Breakers offers a diverse array of indoor and outdoor venues ideal for events of 50 to 1,000 guests. From grand ballrooms and executive boardrooms to beautifully landscaped lawns, courtyards, and gardens, each setting provides its own unique character and style. Our dedicated team delivers highly personalized service, comprehensive in-house support, and expert audiovisual production to ensure every event is seamless and memorable. Weddings & Social Events : A celebrated destination for unforgettable celebrations, The Breakers offers guests an experience of seaside glamour, gracious hospitality, and world-class amenities—all set within an atmosphere of relaxed elegance. From majestic ballrooms and oceanfront lawns overlooking the Atlantic to charming courtyards framed by lush tropical foliage, each venue is thoughtfully designed to inspire and impress.  Just 10 miles away, Breakers West Country Club , provides an additional scenic setting within a tranquil residential and recreational enclave. Our seasoned team of event specialists is dedicated to crafting extraordinary experiences, tailoring every detail to reflect each client’s unique vision. In-house culinary experts—including award-winning chefs and Master Sommeliers—create custom menus, curated wine pairings, and inventive cocktail presentations. The resort’s retail division also offers bespoke gifting and amenities. With flawless execution and personalized service, every celebration at The Breakers is nothing short of spectacular. Peek inside: Photo Gallery Historical Timeline Check Availability Give the Gift of Luxury: The Breakers Gift Card PURCHASE NOW About The Breakers Contact Us Location Guest Policies Careers Press Resource Center Residential Leases Resort Accessibility Privacy Policy CA Notice at Collection Terms of Use Accessibility Sign Up for Special Offers Sign Up for Special Offers CONNECT WITH US The Breakers One South County Road Palm Beach , FL 33480 © 2025 The Breakers Palm Beach, FL. All rights reserved. Close"
    },
    {
      "url": "https://breakers-fc.com/about/staff/",
      "text": "Staff - Breakers F.C. Skip to content Parent Login Menu About us About News Coaching Staff Board of Directors Sponsors Alumni History MLS NEXT About MLS NEXT MLS NEXT Programs MLS NEXT Staff MLS NEXT Teams Tournaments Competitive Cal North X2 League NorCal Premier League Teams Player Pathway College Advisory International Donations Partners Albright College FF Academy Resources Fields Visiting Team Contact Safety FAQs Coaching Education Referee Assignor Laws of The Game Privacy Menu About us About News Coaching Staff Board of Directors Sponsors Alumni History MLS NEXT About MLS NEXT MLS NEXT Programs MLS NEXT Staff MLS NEXT Teams Tournaments Competitive Cal North X2 League NorCal Premier League Teams Player Pathway College Advisory International Donations Partners Albright College FF Academy Resources Fields Visiting Team Contact Safety FAQs Coaching Education Referee Assignor Laws of The Game Privacy Coaches Our methodology is driven by intelligent soccer training designed to develop players of great cognition, competence and character. Unlike traditional training, we look to provide training upon sound pedagogical practices that encourage players to seek effective solutions with vision, precision, and pace. Zoran Djuric U15 HEAD COACH zoran@breakersacademy.org Victor Morales U16 head coach victor@breakersacademy.org Markus Kothner U17 and U16 head coach markus@breakersacademy.org Andrew Cleary Athletic Performance Coach Nisa Saveljic Sports Director nisa@breakersacademy.org Kian Van Der Meer Goalkeeper coach kian@breakersacademy.org Maxence Huin Assistant coach : U15-U14 Miguel Sandoval U14 Head Coach Antonio Ortiz U13 Head coach Breakers F.C. California Featured Sponsor About Us Staff & Coaches Alumni Breakers FC History MLS NEXT MLS NEXT PROGRAMS MLS NEXT Staff MLS NEXT TEAMS FFA Santa Cruz Select / Competitive Recreational Tournaments Donations Connect on Social Copyright © 2024 Breakers FC"
    }
  ]
}