{
  "fuentes": [
    {
      "url": "https://www.belfairsgolfclub.co.uk/contact-us",
      "email": "info@belfairsgolfclub.co.uk"
    },
    {
      "url": "https://www.breckenridgehomeowners.com/login/",
      "email": "breckenridge@castlegroup.com"
    },
    {
      "url": "https://www.breckenridgehomeowners.com/about-us/",
      "email": "breckenridge@castlegroup.com"
    },
    {
      "url": "https://www.breckenridgehomeowners.com/about-us/",
      "email": "dlisiewski@castlegroup.com"
    },
    {
      "url": "https://www.breckenridgehomeowners.com/about-us/",
      "email": "mjuan@castlegroup.com"
    },
    {
      "url": "https://www.breckenridgehomeowners.com/about-us/",
      "email": "sallen@castlegroup.com"
    },
    {
      "url": "https://www.golflink.com/golf-courses/fl/estero/breckenridge",
      "email": "customerservice@golflink.com"
    },
    {
      "url": "https://www.brmhoaservices.com/about",
      "email": "owner@rmlodging.com"
    },
    {
      "url": "https://grandharbor.com/about/",
      "email": "membership@grandharbor.com"
    },
    {
      "url": "https://www.brmhoaservices.com/",
      "email": "owner@rmlodging.com"
    },
    {
      "url": "https://breckenridgehomeowners.com/login/?redirect=%2Frequests",
      "email": "breckenridge@castlegroup.com"
    },
    {
      "url": "https://www.naplescondoboutique.com/breckenridge/",
      "email": "info@naplescondoboutique.com"
    },
    {
      "url": "https://www.lifeinbonitasprings.com/blog/bundled-golf-in-bonita-springs-and-estero-florida/",
      "email": "chris@lifeinbonitasprings.com"
    },
    {
      "url": "https://www.topnotchhomepros.com/paid-members-directory/breckenridge-golf-tennis-club/",
      "email": "dlisiewski@castlegroup.com"
    },
    {
      "url": "https://www.topnotchhomepros.com/paid-members-directory/breckenridge-golf-tennis-club/",
      "email": "dsponito@castlegroup.com"
    },
    {
      "url": "https://www.topnotchhomepros.com/paid-members-directory/breckenridge-golf-tennis-club/",
      "email": "marilyn.ramirez@castlegroup.com"
    },
    {
      "url": "https://www.topnotchhomepros.com/paid-members-directory/breckenridge-golf-tennis-club/",
      "email": "sallen@castlegroup.com"
    },
    {
      "url": "https://www.breckenridgehomeowners.com/amenities/",
      "email": "breckenridge@castlegroup.com"
    },
    {
      "url": "https://www.breckenridgehomeowners.com/contact-us/",
      "email": "breckenridge@castlegroup.com"
    },
    {
      "url": "https://breckenridgehomeowners.com/",
      "email": "breckenridge@castlegroup.com"
    },
    {
      "url": "https://www.breckenridgehomeowners.com/home/",
      "email": "breckenridge@castlegroup.com"
    }
  ],
  "mails": [
    "breckenridge@castlegroup.com",
    "chris@lifeinbonitasprings.com",
    "customerservice@golflink.com",
    "dlisiewski@castlegroup.com",
    "dsponito@castlegroup.com",
    "info@belfairsgolfclub.co.uk",
    "info@naplescondoboutique.com",
    "marilyn.ramirez@castlegroup.com",
    "membership@grandharbor.com",
    "mjuan@castlegroup.com",
    "owner@rmlodging.com",
    "sallen@castlegroup.com"
  ],
  "nombre_sitio": "breckenridgehomeowners.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.belfairsgolfclub.co.uk/contact-us",
      "text": "Contact Us | Belfairs Golf Club :: Essex Members Login Welcome Visitors Information Green Fees Membership Safeguarding Adult Safeguarding Policy Children & Young Person Safeguarding Members & Visitors Code of Conduct Equality, Diversity & Inclusion Policy Club Disciplinary Regulations Golf The Course Scorecard Tour of the Course Local Rules General Club Noticeboard Clubhouse Social Programme Clubhouse Noticeboard Charity Page Dress Code R & A Club History Course Conditions Pro Shop Members Mens Captain's Welcome Mens Noticeboard Mens Competition News Mens Match Overview Ladies Ladies Captain's Welcome Ladies Noticeboard Ladies Club Competition Overview Ladies Match Overview Mixed Mixed Club Competition Overview Mixed Match Overview Seniors Seniors Welcome Seniors Noticeboard Seniors Club Competition Overview Seniors Match Overview Juniors Juniors Welcome Juniors Noticeboard Juniors Club Competition Overview Juniors Match Overview Club Gallery Honours Board Mens Honours Board Ladies Honours Board Seniors Honours Board Juniors Honours Board Members Only Diary Map/Directions Contact Us Recent Site Updates CAPTAIN'S DAY: July 6th 24-Jul-2025 13:16 LADIES CAPTAIN'S DAY: June 26th 24-Jul-2025 12:43 Club Gallery 24-Jul-2025 12:40 Contact Us Belfairs Golf Club, Eastwood Road North, Leigh-on-Sea, Essex, SS9 4LR Should you have any questions or comments please feel free to get in touch. You can use the online contact form below, where your message will be dealt with as appropriate, or alternatively contact us on the telephone numbers below. Honorary Secretary , Peter Mahoney: Tel: 01702 526 911 You may complete this form to send an email directly to Belfairs Golf Club. Alternatively, you can send an email to the following email address: info@belfairsgolfclub.co.uk . Contact Form Name Email Phone Subject **Please select an option** Clubhouse General Membership Members Website Account Request a Handicap Certificate Visitor Message Please do not provide anything sensitive here, like health details, or your credit card number. Verification We do not support SPAM and we would never sell your information to anyone. Any correspondence is strictly confidential. We will only use the above information to contact you about your query. Address Belfairs Golf Club Eastwood Road North Leigh-on-Sea Essex SS9 4LR Contact phone: 01702 526 911 email: info@belfairsgolfclub.co.uk Tee Times phone: 01702 525 345 Links RSS Feed Cookie and Privacy Contact Us Map/Directions Copyright © Belfairs Golf Club , 2011-2025. All Rights Reserved. Website Design and Cloud Hosting by Uxello. Website System - Golf Club CMS"
    },
    {
      "url": "https://www.breckenridgehomeowners.com/login/",
      "text": "Login Login Toggle navigation Menu Home About Us Homes for Sale/Lease Homeowners Homeowners Address Book Calendar Events Forms Requests Tennis/Pickleball Reservations Master Board Master Board Architectural Review Committee Board Certificates Board Sanctioned Committees Breckenridge Documents Breckenridge Survey Results (2025) Budget Contracts Financials/Audit Management Companies Master Board & Association Officers Master Board Minutes Master Insurances Meeting Video Links Weekly Report from Office Contact Us Login The form contains errors.  Please correct them and re-submit. Username Password Show Password Remember Me Forgot Password Forgot Username Breckenridge Golf & Tennis Club 20091 Wimbleton Ct Estero, FL 33928 breckenridge@castlegroup.com Office Number: 239.992.5959 Office Fax: 239.948.0066 Contact us Office Hours: Monday - Friday: 8am - 4pm Professionally Managed by Castle Group https://www.castlegroup.com/ © Copyright 2025 Breckenridge Golf and Tennis Club | Community Website by HOA Sites | Terms of Use | Admin"
    },
    {
      "url": "https://www.breckenridgehomeowners.com/about-us/",
      "text": "Breckenridge Golf and Tennis Club Login Toggle navigation Menu Home About Us Homes for Sale/Lease Homeowners Homeowners Address Book Calendar Events Forms Requests Tennis/Pickleball Reservations Master Board Master Board Architectural Review Committee Board Certificates Board Sanctioned Committees Breckenridge Documents Breckenridge Survey Results (2025) Budget Contracts Financials/Audit Management Companies Master Board & Association Officers Master Board Minutes Master Insurances Meeting Video Links Weekly Report from Office Contact Us Contact Us Office Hours: Monday - Friday 8:00 am to 4:00 pm Lunch Break: 12:00 pm to 12:30 pm Office Staff: Deborah Lisiewski- General Manager dlisiewski@castlegroup.com P: 239-992-5959 F: 239-948-0066 Job Summary: Supervisor of 6 employees, provide the financial and administrative duties, process/approve invoices, review the owner's account to ensure accounts are current and if not, follow-up emails/phone calls, forward pasted due accounts to attorney, solicit, analyze and negotiate contracts on behalf of the association. Maintain the association's financial record books, accounts, and other records as provided by the Association By-Laws and in accordance with Florida Statutes, as amended from time to time, and issue certificates of account/estoppel certificates. Assist with the Finance Committee in preparing an operating budget. Assist with our CPA on annual audit and provide all documentation, Prepare and send, as needed letters, reports, and notices as may be reasonably requested by the Board of Directors., and attend all meetings of the Board of Directors, as may be necessary, annual meeting, budget meeting and any other general membership meetings of the Association. Perform routine property inspections and make written recommendations to the Board of Directors for maintenance and improvements to the common property. P: 239-992-5959 F: 239-948-0066 Job Summary: Supports the Property Manager on site with any delegated administrative, financial, or operational tasks. Preps for board meetings and set up the packages, zoom, and send out email communications. Prepare board minutes. Maintain the activities account and assists the lifestyle director with event budgeting. Complete deposits, refund checks, and end-of-month reports for the accounting department. Collect/put together items for the weekly reports. Handle merchandise and office supply inventory. Work with committee members on updating information and handling part of the workload: ARC and Storage Lot committee, work with the most. Collect and process rental applications. Provides training for new hires. Assists with investigations, and tap/log reviews for any unusual incidents. Maintains office spreadsheets, logs, records, and forms. Resolves and follow-ups with all complaints/issues and reports to the Property Manager. Create and send out email blast communications to residents when needed. Handles new homeowner orientations. Attend mandatory meetings when needed. Complete Castle Training. Work with rangers on parking violations. Maintain the community website. Answers phones promptly and assists residents with questions, and concerns, signing for events, providing gate equipment, and any other tasks they may need assistance with. Marilyn Juan -  Administrative Assistant mjuan@castlegroup.com P: 239-992-5959 F: 239-948-0666 Job Summary: Answers phones promptly and assists residents with questions and concerns. Inputs/processed work orders and guest passes submitted through the website. Maintain association files. Provide and program gate access to residents. Maintain homeowner roaster, database, mail instructions, and homeowner files. Assists with the rental application process as well as with processing new homeowners. Plan and execute all association events but not limited to reservations, ticket sales, facilitation preparation, and on occasion work with residents on events. Work with the Assistant Property Manager to maintain the event budget. Create Activity reports for each event. Create flyers and send out event information via email to owners. Attending and hosting clubhouse-sponsored events. Negotiate contracts with food vendors and entertainment. Maintain completed and current files of all events and reservations. Updated community website and channel. Prepare weekly items to give to the assistant property manager. Create the monthly newsletter. Complete tasks/duties delegated by supervisors. Maintenance Staff: Steadmon Allen- Maintenance Manager sallen@castlegroup.com P: 239-850-9262 Job Summary: Supervisor to 3 employees, the Maintenance Supervisor is responsible for the daily supervision of Maintenance Staff. He is responsible for department organization, performing maintenance checks, supervising the inspection of all mechanical sections of the building, and reporting to building management in all areas. The Maintenance Supervisor is also responsible for the seamless running of all the building mechanics, HVAC, pools, cleanliness, organization of these areas, and maintaining a team of energized and motivated Assist with hurricane preparation of the property. Steve Nick  Maintenance Tech Steve 1: Every Tuesday, Thursday, and Friday, Steve from our maintenance crew helps maintain the bocce courts to ensure they are properly taken care of. Every morning a maintenance staff member cleans the trash and pine needles off the pool deck. Along with wiping down the tables Painting or touching up all common areas as needed. Makes general carpentry, electrical, plumbing, mechanical, and other minor community/building repairs, and maintains records and other maintenance reports as directed by supervisor. Reports needed for major repairs to Community Association Manager Maintenance Supervisor. Checks all lighting daily, Pressure washes decks, sidewalks, and entrances, as necessary to maintain a neat appearance, and assists with hurricane preparation of the property. Larry Milewski Maintenance Tech Larry 2: Every day, Larry from the maintenance staff checks the chemical and sanitation levels for all the pools and spas. If there needs to be any adjustments made, then he will do so. Along with checking the levels, he checks the flow meters, psi, and vacuum gages and will clean the filters if they are not accurate. These are tasks that are not done daily but regularly are checking the Sprinkler Zones and making repairs if needed. The sprinkler meter readings for all of Breckenridge are done once a month and given to the office to submit to the county on a quarterly basis. Assist with hurricane preparation of property. Clemente Diego Maintenance Tech Clemente 3: Clemente opens the clubhouse and pools every week morning. He also comes up to the clubhouse daily to take the trash out, replace paper goods, and ensures that during the day the clubhouse stays clean for our residents. In the mornings and sometimes throughout the day, he will clean the pool bathrooms and ensure the trash cans are not full. On a daily basis when maintenance is driving around for their work, if they see any branches or palm fawns in the general area/golf course, they will pick them up. Assist with hurricane preparation of property. Rangers: Ranger Phone: 239-850-9264 John Conrad Chris Harris Bob Johnson Arty Martinez Job Summary: With every shift each ranger checks in with the office to see if any specific duties need to be handled. Rangers check each amenity to ensure residents/guests/renters are registered and following the rules. Reports violations to the property manager and fills out daily ranger logs to report the work they do. Check golf carts and vehicles for proper and current stickers, if not in compliance a warning ticket is issued. Enforces rules of no runners, walkers, or bikers on the golf cart path. Check the golfer's sign-in sheets and turn them in to the office. Be on the lookout for underage drivers on golf carts. check first aid kits at the pools/clubhouse. Assist and educate owners and guests.  Opening and closing of the pools and clubhouse. In constant communication with the office during their shift and perform any duties required by management. Breckenridge Golf & Tennis Club 20091 Wimbleton Ct Estero, FL 33928 breckenridge@castlegroup.com Office Number: 239.992.5959 Office Fax: 239.948.0066 Contact us Office Hours: Monday - Friday: 8am - 4pm Professionally Managed by Castle Group https://www.castlegroup.com/ © Copyright 2025 Breckenridge Golf and Tennis Club | Homeowners Association Website by HOA Sites | Terms of Use | Admin"
    },
    {
      "url": "https://www.golflink.com/golf-courses/fl/estero/breckenridge",
      "text": "Breckenridge Golf & Tennis Club, Estero, FL - Scorecard & Overview Join Now Log In Book a Tee Time Find a Course Learn Equipment Instruction Lifestyle Tour Golf Travel All Articles Resources Find Driving Ranges Find Golf Simulators About Us Find golf lessons Newsletter Join Now Log In Newsletter Search Courses Enter Keyword Home Courses FL Estero Private N/A No Reviews Yet Breckenridge Golf & Tennis Club Opened in 1990 Breckenridge - Estero , Florida Course Details Reviews Nearby Courses Course Details Holes: 18 Par: 54 Length: 1726 yards Driving Ranges: No The 18-hole \"Breckenridge\" course at the Breckenridge Golf & Tennis Club facility in Estero , Florida features 1726 yards of golf from the longest tees for a par of 54. The course rating is 0 and it has a slope rating of 0. The estimated green fees for 18 holes is $0. The Breckenridge golf course opened in  1990. What Golfers are Saying N/A Be the first to leave a review Write a review Add a Photo Drop Photo Here or Click to Upload Submit View More Courses in Estero Old Corkscrew Golf Club, Corkscrew Course Public Year Opened: 2007 17320 Corkscrew Rd, Estero, FL, 33928-9417 7 miles from the center of Estero view course details book a tee time 18 Holes 72 Par 7,393 Yards Driving Range: Yes Villages At Country Creek, Country Creek Course Private Year Opened: 2016 21180 Country Creek Dr, Estero, FL, 33928-2239 1 mile from the center of Estero view course details 18 Holes 61 Par 3,871 Yards Driving Range: No Fountain Lakes Community Golf Course, Fountain Lakes Course Private Year Opened: 1979 22201 Fountain Lakes Blvd, Estero, FL, 33928-2305 3 miles from the center of Estero view course details 9 Holes 27 Par 681 Yards Driving Range: No The Club At Grandezza, Grandezza Course Private Year Opened: 2001 11481 Grande Oak Blvd, Estero, FL, 33928-7601 1 mile from the center of Estero view course details 18 Holes 72 Par 7,079 Yards Driving Range: Yes Pelican Sound Golf & River Club, Lakes Course Private Year Opened: 2016 4561 Pelican Sound Blvd, Estero, FL, 33928-5909 2 miles from the center of Estero view course details 9 Holes 36 Par 3,440 Yards Driving Range: Yes Pelican Sound Golf & River Club, River Course Private Year Opened: 2016 4561 Pelican Sound Blvd, Estero, FL, 33928-5909 2 miles from the center of Estero view course details 9 Holes 36 Par 3,402 Yards Driving Range: Yes Pelican Sound Golf & River Club, Sound Course Private Year Opened: 2016 4561 Pelican Sound Blvd, Estero, FL, 33928-5909 2 miles from the center of Estero view course details 9 Holes 36 Par 3,622 Yards Driving Range: Yes Stoneybrook Golf Club, Stoneybrook Course Public Year Opened: 1999 21251 Stoneybrook Golf Blvd, Estero, FL, 33928-6236 1 mile from the center of Estero view course details book a tee time 18 Holes 72 Par 7,353 Yards Driving Range: Yes West Bay Club, West Bay Course Private Year Opened: 2018 4606 W Bay Blvd, Estero, FL, 33928-3977 3 miles from the center of Estero view course details 18 Holes 72 Par 6,878 Yards Driving Range: Yes Wildcat Run Golf & Country Club, Wildcat Run Course Private Year Opened: 2023 20300 Country Club Dr, Estero, FL, 33928-2037 2 miles from the center of Estero view course details 18 Holes 72 Par 7,012 Yards Driving Range: Yes Nearby cities with courses Alva 1 Course Bonita Springs 26 Courses Cape Coral 2 Courses Fort Myers 39 Courses Lehigh Acres 4 Courses Miromar Lakes 1 Course Naples 27 Courses 20091 Wimbleton Ct, Estero, FL 33928-2150 (239) 992-5959 Visit course website Caption Join the GolfLink Newsletter! Sign up for golf news, information, and special offers. SUBSCRIBE By signing up you agree to receive communications from GolfLink and select partners in accordance with our Privacy Policy . You may opt out of email messages/withdraw consent at any time. FOLLOW US JOIN OUR NEWSLETTER Sign up for golf news, information and special offers SUBSCRIBE SUPPORT About GolfLink Partner With Us Contact GolfLink Support Privacy Policy Terms of Use Do Not Sell my Personal Information FOLLOW US Copyright © 1996-2025, LoveToKnow Media . All rights reserved. GolfLink™ is a trademark or registered trademark of LoveToKnow Media in the United States and or other countries."
    },
    {
      "url": "https://www.brmhoaservices.com/about",
      "text": "About The Breck HOA and Property Management Team Home Communities Availability Services Owners HOA Online Portals Residents Owners HOA About Contact Pay Rent Home Communities Availability Services Owners HOA Online Portals Residents Owners HOA About Contact Pay Dues About Us Qualified Experts, Local Knowledge. As a member of the Community Associations Institute, and holder of the Certified Manager of Communications designation (CMCA), Breckenridge Resort Managers is your trusted and qualified resource for management of your Homeowners Association. With our own in-house cleaning and maintenance staff, professional accounting systems and partners, and a dedication to punctual and professional management, we can quickly convert your association from passively, to actively managed within months. Our management does not stop with paying bills and fixing issues reported to us. We actively seek out ways to improve operations, budget, and planning components of your HOA, giving your ownership comfort in knowing their association is primed for success. We employ proper maintenance and reserve schedules for all of our HOA’s, ensure appropriate reserve funding, look closely after budgets, and discover maintenance issues before they become assessments. If you are looking for active, professional, and uniquely qualified HOA management, please contact us to see how we can help you find a better solution for the needs of your association. Our job is your community. CONTACT US Toby Babich President & CEO Toby began his real estate career in 2001 as Realty Executives 100 agent, with a specialization in residential sales and valuations. In 2003, he and his wife, Lauretta, founded Realty Executives Integrity First. The startup company quickly grew into one of the most prominent brokerages in Baton Rouge, Louisiana. As the principal owner and manager of the brokerage, Toby oversaw all aspects of marketing, finances, portfolio management, and operations. In 2008, Lauretta and Toby relocated back to Breckenridge, Toby's hometown. In the Breckenridge area, Toby finds fulfillment through community and industry involvement, holding some of the most prominent certifications in the real estate industry, as well as seats on many boards and committees. Toby is a member of the Community Associations institute, where he holds Certified Manager of Community Associations designation as well as an Association Management Specialist designation. Additionally, Toby is an experienced real estate agent, holding an active Colorado License with a Resort and Second homes Property Specialist certification. Toby spends his free time with his wonderful family, skiing, working on and riding in his jeep, and volunteering his time to serve Breckenridge. Lauretta Babich General Manager Lauretta oversees all aspects of reservations, housekeeping, owner services, guest services, and general operations. She is a graduate of Louisiana State University with a major in communications, holds a Colorado real estate license with a Resort and Second Homes Property Specialist (RSPS) designation, and is an active member of the Breckenridge Community. Lauretta truly enjoys people, and demonstrates proficient levels of customer service, but makes it look effortless. In her spare time, she enjoys raising her three little ones, belly dancing, and enjoying our mountain community. 970-453-9551 owner@rmlodging.com 100 S Main St, Breckenridge, CO 80424, 9am - 5pm, Monday - Friday Online Portal Log In | Sign Up Owner Portal Log In | Sign Up Sitemap | Accessibility © All Rights Reserved. Breckenridge Resort Managers Share by:"
    },
    {
      "url": "https://grandharbor.com/about/",
      "text": "About - Grand Harbor Golf and Beach Club Skip to content Skip to content MEMBER LOGIN Home About Membership Golf Beach Club Tennis Dining Experiences Fitness Contact Us OUR STORY CONTINUOUSLY ELEVATING CLUB LIFE FOR OUR MEMBERSHIP Our membership is at the heart of our story. Everything we do is designed to enhance their club experience. Located in beautiful Vero Beach, we provide unparalleled opportunities for leisure and recreation. From our two thoughtfully designed and exciting golf courses to the tranquil expanse of our Beach Club, every day at Grand Harbor is a chance to live exceptionally. EXPERIENCE GRAND HARBOR OUR STAFF Michael Gibson General Manager LEARN MORE Troy Pare Director of Golf LEARN MORE Josh Breda Director of Agronomy LEARN MORE Rico Hosena Beach Club Executive Chef LEARN MORE Joe Ferro Executive Chef LEARN MORE Tim Blouin Executive Pastry Chef LEARN MORE Marco Osorio Director of Sports LEARN MORE Jodi Vogt Director of Membership LEARN MORE Matt depino Director of Facilities and Construction TONY ALBANO Manager of Information Systems Donna rainbow Beach Club Manager Walter Ruiz F&B Operations Manager Robby Gutermuth Clubhouse Operations Manager Joel Brown Assistant F&B Manager Andrian Bitere Manager in Development Jennifer Moore Chief Financial Officer Joy Hernandez Director of Human Resources Grand Harbor is indeed GRAND with an amazing membership and staff! Deb Fletcher, Grand Harbor Member EXPERIENCE GRAND HARBOR Clubhouse: 4985 Club Terrace, Vero Beach, Florida 32967 772-778-9000 Beach Club: 8500 Highway A1A, Vero Beach, Florida 32963 772-231-2600 Twitter Instagram Facebook-f Phone-alt Envelope Quick Links About Membership Membership Portal Terms of Service Contact Us INQUIRE TODAY First Name Last Name Email Address Message SUBMIT ©2025 Grand Harbor Golf & Beach Club. All Rights Reserved Michael Gibson General Manager Michael Gibson’s professional achievements span over three decades of excellence in the golf and hospitality industry. He has been a dedicated member of the CMAA Seminole Region Charity Golf Tournament Committee over 25 years, showcasing his commitment to charitable causes. Michael served as General Manager at Old Marsh Golf Club, where he helped achieve six years of Platinum Clubs of America status and Emerald Distinguished Club honors. He participated in the 2014 Boca Ballroom Battle, raising over $50,000 for the George Snow Scholarship Fund. Under his leadership, Boca Grove was named a Top 100 Golf Shop by the Association of Golf Merchandisers in 2019 and won Country Club of the Year from Luxury Travel Guide. Michael has served as General Manager of Grand Harbor Golf & Beach Club for nearly four years, following the transition from developer ownership to a member-owned club. During his tenure, the Club has gained 400+ new members, and his leadership was instrumental in earning the Distinguished Clubs of America award. Michael’s dedication to the Club and its members is unwavering, continuously enhancing the member experience. Living grand has never been better! Troy Pare Director of Golf at Grand Harbor Troy Pare, originally from Rhode Island, has been a golf professional for 27 years, with 17 years as a Head Golf Professional/Director of Golf. He began his current role as Director of Golf at Grand Harbor Golf and Beach Club in Vero Beach, Florida, on March 4, 2021, where he also works on the membership team. Prior to Grand Harbor, Troy served as Head Golf Professional at Ledgemont Country Club and as Director of Operations & Head Golf Professional at The Preserve at Boulder Hills, a private club offering outdoor activities like golf, hunting, and fly fishing. He was also the Head Golf Professional at Wannamoisett Country Club in Rumford, Rhode Island. Married for 23 years with two teenage boys, Troy thrives in the busy, multi-tasking environment of Grand Harbor. Josh Breda Director of Agronomy Josh Breda is the Director of Agronomy at Grand Harbor, bringing over 24 years of experience in agronomy and golf course maintenance. He holds a Bachelor of Science degree in Turfgrass Science from Clemson University and has previously worked at renowned clubs such as The Ford Plantation in Richmond Hill, GA, The Savannah Golf Club, The Polo Club in Boca Raton, and Riddell’s Bay Golf Club in Warwick, Bermuda. With a passion for working outdoors and a love for the game of golf, Josh finds his favorite aspect of working at Grand Harbor to be the close-knit team atmosphere and the opportunity to maintain beautiful, world-class golf courses. His day-to-day responsibilities include overseeing all aspects of turf management, coordinating with the grounds team, and ensuring the courses are in top condition for members and guests throughout the year. Rico Hosena Executive Chef at Grand Harbor Chef Rico Hosena has been in the kitchen since 1989, working and training with chefs from all over the world. He started working for the five-star luxury resort, Sofitel Philippine Plaza Manila. This is where Rico learned to be versatile in all food and beverage operations, starting as a cook and then learning the ropes as a waiter and guest services professional. In 2007 Rico came to America on an H2B program, where he met Michael Gibson working at Old Marsh Golf Club. Every six months, he would travel north and work at other restaurants and Clubs including Kiawah Island, Mountain Air Country Club and Martha’s Vineyard. In April 2021, Rico had the opportunity to join Michael again when he was offered the position as Executive Chef of the Beach Club. Rico’s goal has been to elevate the dining experience by offering exceptional restaurant-quality food, breaking away from the typical country club fare. With his team, he is turning the vision of creating the best restaurant in Vero Beach into a reality. Joe Ferro Executive Chef Joe began his career in Buffalo, NY at popular restaurants Le Metro Bistro and Bakery and The Left Bank, expanding his culinary knowledge in these scratch kitchens. He soon became Executive Chef at the historic Buffalo Launch Club, the world’s oldest power boating club. Following his passion for food and cooking, he moved to South Florida. Eventually he joined the team at Table 26, later taking over as Executive Chef. Years later he moved on the The Club at Admirals Cove (AC) as Executive Sous Chef. After five years at AC, Joe took on the role of Executive Chef at Grand Harbor. Joe aims to leave his culinary mark by creating a home where his creative vision and extensive expertise can flourish. His ability to blend traditional techniques with modern flair sets him apart, making him a standout in the industry. Tim Blouin Executive Pastry Chef Tim Blouin began his career at Grand Harbor in 2001, though his culinary journey started long before that. Originally from Nashua, New Hampshire, Tim discovered his passion for cooking in high school, studying Culinary Arts. He went on to attend New Hampshire College Culinary Institute and briefly trained at a culinary school in Northern France. His early career was filled with seasonal work, spending summers at The Harbor View Hotel on Martha’s Vineyard and winters at The Village at Breckenridge in Colorado. Tim’s true passion for pastry ignited when he trained under Master Pastry Chef Steven James at The Balsams Grand Resort in Dixville Notch, New Hampshire. Chef James introduced him to pastry competitions and arranged opportunities to work with top pastry chefs during the off-seasons at prestigious locations such as Mohonk Mountain House in New York, The Cloister on Sea Island in Georgia, Kingsmill Resort in Virginia, and The American Club in Wisconsin. Tim eventually found his way to Vero Beach, Florida, after visiting a friend working at Windsor, and the rest is history. Tim is one of Grand Harbor’s “sweetest” assets, bringing passion and expertise to every creation. With his personal touch, each dessert becomes a true masterpiece! Marco Osorio Director of Sports With a career spanning over 20 years, Marco has a unique background as an ATP player, high-performance coach, tournament organizer, and club manager. He reached the top 200 in both singles and doubles and, as a Davis Cup player for Mexico, claimed victories over Roger Federer and the Bryan brothers. After retiring from professional tennis, Marco became one of Mexico’s top high-performance coaches, mentoring multiple national champions and serving as Davis Cup Captain. Marco has also organized over 50 world-class tournaments, earning five International Tennis Federation (ITF) awards for hosting the best “Grade A” tournaments globally—events as prestigious as the Grand Slams. In club management, he served as COO of Mexico’s largest sports club organization and successfully turned around the Vero Beach Tennis Club after purchasing it in 2011. He later became General Manager of the Boulevard. Since 2018, Marco has worked at Grand Harbor, first as Head Tennis Professional and then as Tennis Director. In 2021, he took on a dual role as Sports Director and Tournament Director for the Vero Beach International Tennis Open. Marco also holds three graduate degrees, including an MBA, and frequently speaks at sports and tennis conferences worldwide. Jodi Vogt Director of Membership Jodi is the Director of Membership at Grand Harbor, where she finds joy in both welcoming prospective members and building lasting relationships with current ones. She enjoys meeting new people, giving tours of the club, and sharing the unique experiences Grand Harbor has to offer. Along with handling the membership application process, Jodi ensures a smooth and personalized experience for each new member. With a background in psychology, sociology, and nonprofit management, Jodi brings a warm and thoughtful approach to her work, making every member feel welcome and appreciated at Grand Harbor."
    },
    {
      "url": "https://www.brmhoaservices.com/",
      "text": "Breckenridge Property and HOA Management - Home Home Communities Availability Services Owners HOA Online Portals Residents Owners HOA About Contact Pay Rent Home Communities Availability Services Owners HOA Online Portals Residents Owners HOA About Contact Pay Dues Search Long Term Rental Homes Any City Any Price Min. Price Max. Price All Beds Studio 1 bed 2 beds 3 beds 4 beds 5+ beds All Baths 1 bath 2 baths 3 baths 4 baths 5+ baths Search Our Services Check Availability Find homes in the Breckenridge, Colorado area and get the lifestyle you deserve. Maintenance Requests Quickly submit maintenance requests that go directly to our maintenance queue. Find your community Check out the HOA communities we manage and log-in to your portal. Your Experience and Trusted Property Management Partner. As a member Of the Community Associations Institute, and holder of the Certified Manager of Communications designation (CMCA), Breckenridge Resort Managers is your trusted and qualified resource for management of your Homeowners Association. With our own in-house cleaning and maintenance staff, professional accounting systems and partners, and a dedication to punctual and professional management, we can quickly convert your association from passively, to actively managed within months. Learn More Our Communities Lincoln West Mall The Lincoln West Mall is a signature structure in Breckenridge, standing two stories high, and consisting of 5 individually owned spaces of different sizes. The mall offers onsite restrooms, a loading dock, heated sidewalk and plaza, main street frontage, and a beautiful interior common area with elevator and skylight. Val D' Isere Val D' Isere condos is nestled in the heart of Breckenridge, just across the street from Breckenridge Gondola, and just steps off Main Street from everything Breckenridge has to offer. The building consists of 44 individually owned residential units. Connect Breck Building The Connect Breck building is a mixed used commercial and residential building, consisting of two floors of wholly owner commercial space, and six individually owned residential units. The building features plenty of storage, forced air conditioning, common stairwells and an elevator, and plenty of parking. Main Street Mall Main Street Mall is a centrally located commercial building Der Steiermark Der Steiermark Condos is one of the premiere locations in Breckenridge, just across the street from the base of Peak 9, 1/2 block off Main Street and steps from everything Breckenridge has to offer. The building consists of 36 individually owned residential units and 3 commercial businesses- Mountain Wave, Blue River Sports, and the famous Mi Casa Mexican restaurant. Avalanche The Avalanche building is a mixed-used commercial and residential building, consisting of two floors, ground floor commercial space, and second floor individually owned residential units. Los Pinos Description coming soon Ten Mile Suites Located 2 blocks from downtown Breckenridge. This HOA consists of 7 Condos. Wildwood Suites Wildwood Lodge is a 36 unit condominium complex located just 2 blocks from main street, and adjacent to 4 O'Clock run. Wildflower ll Located up Boreas Pass. The two buildings consist of 30 individually owned condos. Wendell Square A commercial and residential complex in Breckenridge, Colorado located in on Ridge Street. It has 4 commercial units on the first floor facing Ridge Street and 4 residential units on the second story with private parking behind the complex, including a one-car garage for each residential unit. Excellent location in the heart of downtown Breckenridge. Sundowner ll Information coming soon Woods Manor Information coming soon The Settlement Information coming soon Wildflower l Information coming soon See Availability Have questions? Contact us! We're happy to help. Call: 970-453-9551 Email: owner@rmlodging.com Name Email Phone Message Thank you for contacting us. We will get back to you as soon as possible Oops, there was an error sending your message. Please try again later 970-453-9551 owner@rmlodging.com 100 S Main St, Breckenridge, CO 80424, 9am - 5pm, Monday - Friday Online Portal Log In | Sign Up Owner Portal Log In | Sign Up Sitemap | Accessibility © All Rights Reserved. Breckenridge Resort Managers Share by:"
    },
    {
      "url": "https://breckenridgehomeowners.com/login/?redirect=%2Frequests",
      "text": "Login Login Toggle navigation Menu Home About Us Homes for Sale/Lease Homeowners Homeowners Address Book Calendar Events Forms Requests Tennis/Pickleball Reservations Master Board Master Board Architectural Review Committee Board Certificates Board Sanctioned Committees Breckenridge Documents Breckenridge Survey Results (2025) Budget Contracts Financials/Audit Management Companies Master Board & Association Officers Master Board Minutes Master Insurances Meeting Video Links Weekly Report from Office Contact Us Login The form contains errors.  Please correct them and re-submit. Username Password Show Password Remember Me Forgot Password Forgot Username Breckenridge Golf & Tennis Club 20091 Wimbleton Ct Estero, FL 33928 breckenridge@castlegroup.com Office Number: 239.992.5959 Office Fax: 239.948.0066 Contact us Office Hours: Monday - Friday: 8am - 4pm Professionally Managed by Castle Group https://www.castlegroup.com/ © Copyright 2025 Breckenridge Golf and Tennis Club | Homeowner Association Website by HOA Sites | Terms of Use | Admin"
    },
    {
      "url": "https://www.naplescondoboutique.com/breckenridge/",
      "text": "Breckenridge Golf and Tennis Club - Estero Real Estate - Breckenridge Homes For Sale MENU Search Advanced Search Search by Map Property Tracker Featured Listings Neighborhoods Bay Colony Bonita Bay Marco Island Mercato Naples Cay Old Naples Pelican Bay Tiburon Bayfront Coquina Sands Mediterra Moorings Naples Park Park Shore Talis Park Vanderbilt Beach Lifestyles 55+ Active Adult Boating Golf Luxury Luxury Gated Low Fees Pet Friendly School District Urban Living Waterfront Buy Buying Property Finder Our Guarantee Mortgage Calculator First Time Home Buying Out Of Country Purchasers Foreign Buyers Condo Buyer Considerations Florida Tax Advantages HOAs & CDDs Establishing Florida Residency Sell Selling Marketing Plan Home Evaluation Why Premiere Plus Realty iBuyer Pitfalls FSBO Challenges Downsizing Considerations Pricing Considerations About About Us Our Featured Listings Contact More Login / Register Blog (239) 908-0600 ENGLISH 中文 FRANÇAIS 한국어 ITALIANO 日本語 DEUTSCH PORTUGUÊS РУССКИЙ ESPAÑOL TIẾNG VIỆT Home Estero Breckenridge Breckenridge Golf and Tennis Club Breckenridge is a private development of homes and condos located within Breckenridge Golf & Tennis Club. The bundled golf community includes coach homes, attached villas, townhomes and condominiums. All homes have lake or golf course views. Community amenities include an 18-hole, Par 3 golf course, a fitness facility, five heated swimming pools and eight Har-Tru tennis courts as well as pickleball facilities. Bocce ball courts, as well as room to play shuffleboard and water volleyball provide additional recreational options. The Breckenridge Clubhouse also features a fully-equipped kitchen, as well as tennis and golf pro shops.  In addition, there is reserved storage in the community for RV and boat owners.  Coconut Point Mall is two miles away from the development. Breckenridge is located in Estero west of US 41, between Pine Road and Broadway Avenue West. Breckenridge Homes And Condos For Sale Breckenridge Homes And Condos For Sale September 10, 2025 12 Listed 50 Avg. DOM $236.13 Avg. $ / Sq.Ft. $369,950 Med. List Price Gallery Photo View List Map Map View Get Alerts! Refine Results Price (Highest) Price (Lowest) Days on Site (Newest) Days on Site (Oldest) Bedrooms (Most) 12 Properties $450,000 Neighborhood: Village On Crescent Lake 4219 Tequesta Dr Estero,  FL 33928 3 Beds 2 Baths 1,965 Sq.Ft. 2000 Year Built 48 Days on Site 225048604 MLS Grice Realty Inc $445,900 Neighborhood: Village On Crystal Lake 4158 Pensacola Ave Estero,  FL 33928 3 Beds 2 F 1 1/2 Baths 1,803 Sq.Ft. 1997 Year Built 119 Days on Site 225046984 MLS RE/MAX Realty Group $439,000 Neighborhood: Village On Crystal Lake 4162 Tequesta Dr Estero,  FL 33928 3 Beds 2 F 1 1/2 Baths 1,745 Sq.Ft. 1998 Year Built 296 Days on Site 224088298 MLS RE/MAX Realty Group $410,000 Neighborhood: Village On Crescent Lake 4230 Pensacola Ave Estero,  FL 33928 3 Beds 3 Baths 1,974 Sq.Ft. 2000 Year Built 181 Days on Site 225027569 MLS RE/MAX Realty Group $399,999 Neighborhood: Village On Crystal Lake 4191 Pensacola Ave Estero,  FL 33928 3 Beds 2 F 1 1/2 Baths 2,025 Sq.Ft. 1998 Year Built 71 Days on Site 225060397 MLS Broker Brothers Llc $385,000 Neighborhood: Village On Golden Pond 4135 Jace Ct Estero,  FL 33928 3 Beds 2 F 1 1/2 Baths 1,625 Sq.Ft. 1994 Year Built 108 Days on Site 225050351 MLS RE/MAX Realty Group $354,900 Neighborhood: Greenwood Village At Breckenridge 4218 Jace Ct Estero,  FL 33928 2 Beds 2 Baths 1,385 Sq.Ft. 1993 Year Built 164 Days on Site 225032958 MLS RE/MAX Realty Group $349,900 Neighborhood: Village On Golden Pond 4190 Jace Ct Estero,  FL 33928 3 Beds 2 F 1 1/2 Baths 1,625 Sq.Ft. 1994 Year Built 2 Days on Site 225070038 MLS Downing Frye Realty Inc. $349,000 Neighborhood: Preserve Ii 19870 Breckenridge Dr #205 Estero,  FL 33928 3 Beds 2 Baths 1,243 Sq.Ft. 2002 Year Built 152 Days on Site 225034292 MLS Robert Slack Llc $317,500 Neighborhood: Preserve Ii 19870 Breckenridge Dr #504 Estero,  FL 33928 3 Beds 2 Baths 1,243 Sq.Ft. 2002 Year Built 149 Days on Site 225036798 MLS Align Right Realty Srq Opulenc $315,000 Neighborhood: Preserve Ii 19870 Breckenridge Dr #207 Estero,  FL 33928 2 Beds 2 Baths 1,379 Sq.Ft. 2002 Year Built 119 Days on Site 225046996 MLS Berkshire Hathaway Florida $308,900 Neighborhood: Greenwood Village At Breckenridge 4259 Ute Ct Estero,  FL 33928 2 Beds 2 Baths 1,359 Sq.Ft. 1988 Year Built 171 Days on Site 225027480 MLS Keller Williams Elite Realty Breckenridge Homes And Condos Recent Sales 8 Properties Address Beds Baths Sq.Ft. List Price Sold Price $/Sq.Ft. Sold Date 4150 Tequesta Dr Estero,  FL 33928 3 3 2,025 $489,900 $470,000 $232.10 5/1/25 4217 Jace Ct Estero,  FL 33928 3 3 1,623 $449,900 $422,000 $260.01 3/21/25 4167 Pensacola Ave Estero,  FL 33928 3 3 2,214 $439,500 $415,000 $187.44 7/23/25 4220 Pensacola Ave #5202 Estero,  FL 33928 3 3 1,974 $409,000 $400,000 $202.63 5/30/23 19880 Breckenridge Dr #404 Estero,  FL 33928 2 2 1,243 $345,000 $345,000 $277.55 11/14/23 20151 Ian Ct #307 Estero,  FL 33928 3 2 1,243 $349,900 $335,000 $269.51 8/21/23 19880 Breckenridge Dr #307 Estero,  FL 33928 2 2 1,453 $318,900 $310,000 $213.35 5/30/25 4212 Ute Ct Estero,  FL 33928 2 2 1,359 $314,000 $307,000 $225.90 9/27/24 Search Estero Communities.... Belle Lago Cascades of Estero Corkscrew Estates Corkscrew Shores Estero Place Marsh Landing Mirasol at Coconut Point Osprey Cove Place at Corkscrew Quarterdeck Cove Rapallo Rookery Pointe Stoneybrook WildBlue Search All Area Listings Enter Location, Zip, Address or MLS # Search Homes Advanced Search Search Estero Estero Condos Estero Gated Communities Estero Golf Communities Estero New Construction Estero Pool Homes Search Estero Communities Bella Terra Belle Lago Cascades at Estero Coconut Point Corkscrew Estates Corkscrew Shores Grandezza Pelican Bay Place at Corkscrew Preserve at Corkscrew Rapallo Shadow Wood Stoneybrook Tidewater West Bay Club Wildcat Run Verdana Village Villagio From Our Blog - Estero Estero Next-Level Amenities and Concierge Experiences Define Ritz Estero BY Mark Washburn 1/23/2025 Estero Estero Neighborhoods Ideal for First-time Home Buyers BY Mark Washburn 10/8/2024 View All Blog Posts Lifestyle Searches 55+ Communities Boating Communities Golf Communities Luxury Condos Luxury Gated Low Fees Pet-Friendly School District Urban Living Waterfront Featured Communities Bay Colony Bayfront Coquina Sands Kalea Bay Lely Resort Marco Island Mercato Moorings Naples Cay Naples Park Naples Square Old Naples Park Shore Pelican Bay Pelican Marsh Talis Park The Dunes The Vineyards Tiburon Vanderbilt Beach Today's Naples, FL Listings Residential New Today Price Reduced Recently Sold Contact Naples Condo Boutique Team Premiere Plus Realty Co 9015 Strada Stell Ct, Ste 104 Naples, FL 34109 O: (239) 908-0600 M: (239) 908-0600 E: Email Us Connect Facebook Instagram Pinterest Navigation Search Neighborhoods Lifestyles Buy Sell About Contact Popular Searches Newest Listings Single Family Condos & Townhomes Luxury Homes Featured Listings Accessibility | Terms of Service | Privacy Policy | DMCA Notice | Property Listings | Sitemap © Copyright 2025 Naples Condo Boutique Team. All Rights Reserved. Real Estate Websites by Sierra Interactive We're Here to Help Feel free to reach out any time: Naples Condo Boutique Team Premiere Plus Realty Co 9015 Strada Stell Ct, Ste 104 Naples, FL 34109 O: (239) 908-0600 M: (239) 908-0600 E: Email Us Connect Facebook Instagram Pinterest Have a Question or Want a Free Market Report? Contact Us Home Blog Search Advanced Search Search by Map Property Tracker Featured Listings Neighborhoods Bay Colony Bonita Bay Marco Island Mercato Naples Cay Old Naples Pelican Bay Tiburon Bayfront Coquina Sands Mediterra Moorings Naples Park Park Shore Talis Park Vanderbilt Beach Lifestyles 55+ Active Adult Boating Golf Luxury Luxury Gated Low Fees Pet Friendly School District Urban Living Waterfront Buy Buying Property Finder Our Guarantee Mortgage Calculator First Time Home Buying Out Of Country Purchasers Foreign Buyers Condo Buyer Considerations Florida Tax Advantages HOAs & CDDs Establishing Florida Residency Sell Selling Marketing Plan Home Evaluation Why Premiere Plus Realty iBuyer Pitfalls FSBO Challenges Downsizing Considerations Pricing Considerations About About Us Our Featured Listings Contact Questions? We're Here to Help Recently From Our Blog Riverfront Living Awaits at Serrano in Bonita By Mark Washburn 9/9/2025 Horizons Boasts Elevated Living on Florida’s Gulf Coast By Mark Washburn 8/29/2025 We're Here to Help Feel free to reach out any time: Naples Condo Boutique Team Premiere Plus Realty Co 9015 Strada Stell Ct, Ste 104 Naples, FL 34109 O: (239) 908-0600 M: (239) 908-0600 E: Email Us Connect Facebook Instagram Pinterest Have a Question or Want a Free Market Report? Contact Us"
    },
    {
      "url": "https://www.lifeinbonitasprings.com/blog/bundled-golf-in-bonita-springs-and-estero-florida/",
      "text": "Bundled Golf in Bonita Springs and Estero Florida Today's Hot New Listings! Click to See List Now! ✕ Home Search Homes Home Value Selling - Listing Buying Market Reports Blog About Contact Login Call or Text Chris - 239-273-7430 Sign in to your account Email Phone Number Need to reset your phone number? Log In Your browser does not support iframes. Don't have an account with us? Click here to sign up. Search Bonita Springs Estero Bundled Golf Properties! City All Ave Maria Babcock Ranch Bonita Springs Cape Coral Captiva Estero Fort Myers Fort Myers Beach Goodland Immokalee Labelle Lehigh Acres Marco Island Miromar Lakes Naples North Fort Myers Port Charlotte Punta Gorda Sanibel Upper Captiva Development All Developments Acreage Ambassador Condo Arroyal Arroyal Heights Aurora Condominiums Barefoot Bay Barefoot Beach Bay Harbor Club Condo Beach And Tennis Club Bell Villa Bermuda Lago Bonita Bay Bonita Beach Bonita Beach Club Bonita Beach Plantation House Bonita Beach Trailer Park Bonita Beachwalk Bonita Del Sol Bonita Fairways Bonita Farms Bonita Golf Club Bonita Isles Bonita Lakes Bonita Landing Bonita National Golf And Country Club Bonita Park Bonita Pines Bonita Royal Condo Phase 1 Bonita Sands Bonita Shores Bonita Springs Bonita Springs Country Club Bonita Springs Golf & Country Club Bonita St James Village Bonita Village Brendan Cove Bridgewater Brookside Estates Carolands Casa Bonita Citadel Cockleshell Village Cordera Cypress Plantations Condo Cypress Preserve Dolphin Cove Edenbridge Gardens El Dorado Acres Estero Bay Shores Fairway Dunes Condo Fairway Pines Condo Fairwinds Forest Mere Townhouse Community Gardens Of Bonita Springs Glen Manor Greens At Bonita Springs Gulf Harbor Gull Haven Hacienda Village Hawthorne Heitmans Helfenstein Estates Hickory Harbour Hickory Pointe Hidden Lakes At Woods Edge Highland Woods Hunters Ridge Imperial Bonita Estates Imperial Gates Imperial Harbor Imperial River Imperial Shores Irish Pines Island Beach Club Condo Lake Pointe Lakemont Cove Lakeside Hideaway Ledford Shores Leisure Time Campsites Leitner Creek Manor Lighthouse Bay At The Brooks Limetree Park Little Hickory Little Hickory Bay Little Hickory Shores Lovers Key Beach Club Meadowlark Estates Mobile Villas Morton Grove Condo Not Applicable Nuttinglikit Grove Oak Ridge Oakland Acres Oakland Acres Trailer Park Ohlman Acres Orange Grove Trailer Park Palmira Golf And Country Club Paloma Paradise Village Park Place Pelican Landing Pelican Pointe Condo Pelican Ridge Pine Haven Condo Pirate's Cove Ii Pirates Cove Polynesian Villas Richview Rio Vista Unrecorded Subdivision Riviera Colony Robert Dodds Subd Rosemary Park San Carlos Estates San Mirage San Remo Sandy Hollow Sea Isles Seasons At Bonita Serrano Solis Grande Sorrento Spanish Gardens Spanish Harbor Spanish Wells Spring Creek Estates Spring Creek Village Spring Lakes Sun Coast Acres Sunset Acres Tarpon Bend Unrec Tba The Colony At Pelican Landing The Egret The Sanctuary Trieste Preserve Tropic Acres Valencia Bonita Vanderbilt Lakes Vasari Villa Bonita Villa Mar Bonita Beach Village Walk Of Bonita Springs Villages Of Bonita Wildwood Preserve Woods Edge Worthington Price No Limit $50,000 $100,000 $150,000 $200,000 $250,000 $300,000 $350,000 $400,000 $450,000 $500,000 $550,000 $600,000 $650,000 $700,000 $750,000 $800,000 $850,000 $900,000 $950,000 $1 Million $1.5 Million $2 Million $2.5 Million $3 Million $3.5 Million $4 Million $4.5 Million $5 Million $6 Million $7 Million TO Max List Price No Limit $50,000 $100,000 $150,000 $200,000 $250,000 $300,000 $350,000 $400,000 $450,000 $500,000 $550,000 $600,000 $650,000 $700,000 $750,000 $800,000 $850,000 $900,000 $950,000 $1 Million $1.5 Million $2 Million $2.5 Million $3 Million $3.5 Million $4 Million $4.5 Million $5 Million $6 Million $7 Million Beds Any 1+ 2+ 3+ 4+ 5+ 6+ Baths Any 1+ 2+ 3+ 4+ 5+ 6+ Property Type Single Family Condo Land Income Manufactured Home Advanced Search Address Search Bundled Golf - Golf Membership Included In Southwest Florida we primarily have two types of golf memberships in the area; Bundled Golf and Golf Equity or Membership Golf. In the Bonita Springs and Estero Florida area some of the gated communities are built around and showcase the amenity of golf.  Homes and condos are built with golf course views and offer a variety of ways to become a member or play the golf course. Golf equity or membership golf means that there is golf available with the purchase of a membership.  The membership purchase is usually optional and each community charges a different rate for their equity, plus annual fees as well as greens, cart or trail fees. Bundled golf means that every home owner in the community automatically becomes a member of the golf club.  If you aren’t a serious golfer a bundled golf community may not be the first choice.  Membership has its privileges but it also comes with mandatory fees on a recurring, annual basis.  Depending upon the community fees, at this time, begin around $10,000 per year and up, plus trail or greens fees. If you’re looking for bundled golf communities in Bonita Springs or Estero, Florida here is a list of neighborhoods that offer golf with the purchase of real estate.  All of the bundled golf communities below offer single family homes as well as condominiums.  Highland Woods, Worthington and Spring Run also have attached villa homes, as well as, condominiums and single family villa homes. Bonita Springs Bundled Golf -Estero Bundled Golf Bonita National - Bonita Springs, Florida (Part of the Community is social membership only) Breckenridge Golf and Country Club– Estero, Florida Copperleaf at The Brooks – Bonita Springs, Florida Highland Woods Golf & Country Club – Bonita Springs, Florida Hunter's Ridge - Bonita Springs (Part of the Community is social membership.) Pelican Sound – Estero, Florida Spring Run at The Brooks – Bonita Springs, Florida Vasari Golf and Country Club – Bonita Springs, Florida Villages at Country Creek – Estero, Florida Worthington Golf & Country Club – Bonita Springs, Florida To learn more about bundled golf communities and the bundled golf lifestyle call 239-273-7430. The Latest Bonita Springs & Estero Bundled Golf Listings 26751 Clarkston DR Unit 205, Bonita Springs — St Andrews Verandas $409,000 Explore the stunning Carlton Veranda, a remarkable gem situated in the highly sought-after Highland Woods bundled golf community. This pristine 2-bedroom, 2-bathroom home... 2 Beds 2 Baths 225070141 MLS St Andrews Verandas Bldg. ACTIVE Status 4190 Jace CT, Estero $349,900 Enjoy this 3 bedroom / 2.5 bath lakefront home along with everything Breckenridge has to offer. As you enter the home you will be drawn to the high cathedral ceilings. En... 3 Beds 2.5 Baths 225070038 MLS ACTIVE Status 28064 Cavendish CT Unit 2408, Bonita Springs — Cavendish Court $278,500 Exciting updates are underway at Worthington Country Club—with no assessments or added debt to homeowners! Planned community enhancements include resurfaced tennis courts... 2 Beds 2 Baths 225069824 MLS Cavendish Court Bldg. ACTIVE Status 17961 Bonita National BLVD Unit 524, Bonita Springs — Bonita National Golf And Country Club $410,000 *TURNKEY FURNISHED 2BR/2BA CONDO WITH FULL GOLF MEMBERSHIP*\r\nWelcome to resort-style living at its finest! This beautifully updated 2 bedroom, 2 bathroom\r\nTURNKEY furnish... 2 Beds 2 Baths 225068319 MLS Bonita National Golf And Country Club Bldg. ACTIVE Status 13246 Sherburne Cir Unit 1301, Bonita Springs — Worthington $399,900 THIS EXCEPTIONAL HOME WITH STUNNING LAKE VIEWS - READY FOR YOU TO MOVE IN AND START LIVNG THE DREAM: Step into a beautifully maintained, fully furnished home with 2 spaci... 2 Beds 2 Baths 225069440 MLS Worthington Bldg. ACTIVE Status 13217 Sherburne Cir Unit 504, Bonita Springs — Worthington $409,000 ▼ Searching for a bundled 18-hole golfing community? Look no further than Worthington Country Club, one of Southwest Florida’s most sought-after bundled golf communities. T... 2 Beds 2 Baths 225069393 MLS Worthington Bldg. ACTIVE Status 17911 Bonita National Blvd Unit 142, Bonita Springs — Bonita National Golf And Country Club $398,000 Discover this stunning top floor Bellini 2 BR + Den condo offered Turnkey Furnished and includes a Full Social Membership. Styled in coastal flair with an open, light fil... 2 Beds 2 Baths 225069557 MLS Bonita National Golf And Country Club Bldg. ACTIVE Status 23560 Wisteria Pointe DR Unit 507, Estero — Wisteria Pointe $549,900 FIRST FLOOR END UNIT WITH SPECTACULAR GOLF COURSE AND LAKE VIEWS from this 2+ Den, 2 Bath coach home in the demand gated, bundled golf community of Copperleaf at the Broo... 2 Beds 2 Baths 225069005 MLS Wisteria Pointe Bldg. ACTIVE Status 20930 Island Sound Circle Unit 302, Estero $499,000 Pelican Sound Golf & River Club, Estero, Florida. Welcome to this premier lifestyle destination here in Southwest Florida. If you like to play golf, or want to spend the ... 2 Beds 2 Baths 2025007322 MLS ACTIVE Status 20916 Island Sound CIR Unit 206, Estero — Island Sound $450,000 Take in the Florida sunshine with this 3 bed 2 bath end unit Condo in Island Sound, a prestigious bundled Golf Community! This home is the original builder's model offere... 3 Beds 2 Baths 225068686 MLS Island Sound Bldg. ACTIVE Status 28510 Westmeath Ct, Bonita Springs — Bonita National Golf And Country Club $1,100,000 GOLF MEMBERSHIP INCLUDED. This \"Maria\" will MARVEL, offering a true blend of luxury and comfort, and it is offered \"Turnkey\" furnished. The kitchen is the heart of the ho... 4 Beds 3 Baths 225068653 MLS Bonita National Golf And Country Club Bldg. ACTIVE Status 12091 Toscana WAY Unit 102, Bonita Springs — Toscana $415,000 Your home, your membership, your course! Step into a turnkey carriage home at Vasari Country Club, where golf, leisure, and community come together.\r\n\r\nThis spacious firs... 2 Beds 2 Baths 225068861 MLS Toscana Bldg. ACTIVE Status 12658 Buttonbush Place, Bonita Springs $650,000 This Hunters Ridge Golf & Country Club Coastal-Beach-Inspired Pool Home sits on an oversized 1/3-acre lot & is lushly landscaped. A private slice of Florida paradise can ... 3 Beds 2 Baths 2025007148 MLS ACTIVE Status 20981 Island Sound CIR Unit 101, Estero — Island Sound $499,000 This lovely, first floor end unit coach home shows like new construction and is now available in southwest Florida's sought after bundled golf community, Pelican Sound.  ... 2 Beds 2 Baths 225068038 MLS Island Sound Bldg. ACTIVE Status 4640 Turnberry Lake DR Unit 306, Estero — Turnberry $524,900 Rarely available top floor, three bedroom end unit is now available in Pelican Sound Golf & River Club, in the highly desirable Turnberry neighborhood. Enjoy panoramic la... 3 Beds 2 Baths 225068343 MLS Turnberry Bldg. ACTIVE Status 9350 Highland Woods BLVD Unit 4101, Bonita Springs — Terrace I $384,900 Want to play Golf, Pickleball, work out and just be happy? This is it! First-Floor End Unit 2 plus a den with Spectacular Golf Course Views!\r\nThis beautifully maintained,... 2 Beds 2 Baths 225068732 MLS Terrace I Bldg. ACTIVE Status 17990 Bonita National Blvd Unit 2114, Bonita Springs — Bonita National Golf And Country Club $489,000 GOLF MEMBERSHIP INCLUDED! Welcome to your dream retreat condo, offered \"Turnkey\" furnished! This beautifully re-modeled \"Diangelo\" condo is a true gem. Offering a seamles... 2 Beds 2 Baths 225068246 MLS Bonita National Golf And Country Club Bldg. ACTIVE Status 28131 Edenderry Ct, Bonita Springs — Bonita National Golf And Country Club $839,000 This \"Isabella\" home is sure to impress! Built in 2017, very lightly used and meticulously cared for, and offered \"Turnkey\" Furnished, including furniture from \"Gouse,\" s... 4 Beds 2 Baths 225066912 MLS Bonita National Golf And Country Club Bldg. ACTIVE Status 28011 Cookstown Ct Unit 3502, Bonita Springs — Bonita National Golf And Country Club $599,900 WELCOME to Beautiful Bonita National Golf & Country Club. This Exquisite Designed 3 BR 2 BATH Social Membership Coach Home offers A breathtaking view over looking the Lak... 3 Beds 2 Baths 225068405 MLS Bonita National Golf And Country Club Bldg. ACTIVE Status 17251 Cherrywood Ct Unit 8904, Bonita Springs — Bonita National Golf And Country Club $599,000 Luxury Coach Home in Bonita National Golf & Country Club!\r\nExperience resort-style living in this stunning 3-bedroom, 2-bath COACH home, perfectly situated on an idyllic,... 3 Beds 2 Baths 225068584 MLS Bonita National Golf And Country Club Bldg. ACTIVE Status 23570 Wisteria Pointe DR Unit 608, Estero — Wisteria Pointe $619,000 RARELY AVAILABLE upstairs END-UNIT coach home in the premier Wisteria Point neighborhood of Copperleaf! This spacious residence includes a TWO-CAR GARAGE and offers breat... 3 Beds 2 Baths 225067654 MLS Wisteria Pointe Bldg. ACTIVE Status 20818 Blacksmith, Estero — Country Creek $309,000 Welcome to this well-maintained 3-bedroom, 2-bath attached villa, nestled in the highly sought-after Country Creek Golf Community in Estero, Florida. Boasting a prime loc... 3 Beds 2 Baths 225065564 MLS Country Creek Bldg. ACTIVE Status 9350 Highland Woods BLVD Unit 4303, Bonita Springs — Terrace I $330,000 Welcome to Your Piece of Paradise - Ideal for Personal Use or Investment!\r\n\r\nThis desirable 2-bedroom 2-bath condo in the prestigious bundled golf community of Highland W... 2 Beds 2 Baths 225067211 MLS Terrace I Bldg. ACTIVE Status 28201 L Burton Fletcher Ct, Bonita Springs — Hunters Ridge $899,000 Elegant Courtyard Pool Home with Guest Cabana! GOLF MEMBERSHIP INCLUDED! This beautifully updated courtyard pool home features 2 bedrooms and 2 baths in the main house, p... 3 Beds 3 Baths 225068116 MLS Hunters Ridge Bldg. ACTIVE Status 20930 Island Sound Cir Unit 102, Estero — Pelican Sound $374,900 Beautifully updated in 2024, this 2 bedroom, 2 bathroom condo offers 1,258 square feet of comfortable living in Pelican Sound Golf & River Club. The first-floor location ... 2 Beds 2 Baths 225065797 MLS Pelican Sound Bldg. ACTIVE Status 28625 Lisburn Ct, Bonita Springs — Bonita National Golf And Country Club $1,700,000 **Stunning Turnkey Furnished Home with Golf Membership!** Discover this elegant and comfortable turnkey residence featuring three spacious bedrooms and a versatile den. T... 4 Beds 3.5 Baths 225050636 MLS Bonita National Golf And Country Club Bldg. ACTIVE Status 28481 Rochester Ct, Bonita Springs — Worthington $990,000 WOW… THIS MAGNIFICENT HOME IS READY FOR YOU TO WALK IN AND START LIVING THE DREAM:Stunning 3-Bedroom + Den Home in Worthington – Move-In Ready Luxury\r\nDiscover casual ele... 3 Beds 2 Baths 225067237 MLS Worthington Bldg. ACTIVE Status 9351 Spring Run Blvd Unit 3203, Estero — Spring Run At The Brooks $285,000 NO GOLF IN WAITING, START TO PLAY RIGHT NOW in the prestigious bundled golf community of Spring Run at the Brooks!!!! This Audobon Certified Golf Course with its beautifu... 2 Beds 2 Baths 225067460 MLS Spring Run At The Brooks Bldg. ACTIVE Status 23510 Caraway Lakes Drive, Estero $1,100,000 Luxurious Furnished Pool Home on the 18th Hole in Copperleaf at The Brooks – Estero, FL\r\nWelcome to your dream home in the highly sought-after Copperleaf at The Brooks, a... 3 Beds 3 Baths 2025003146 MLS ACTIVE Status 26871 Clarkston DR N Unit 12104, Bonita Springs — St Andrews Verandas $429,000 Your paradise awaits when you arrive at this meticulously maintained 2 bedrooms plus den with detached garage in the St Andrews Verandas! Not only is there the most relax... 2 Beds 2 Baths 225066403 MLS St Andrews Verandas Bldg. ACTIVE Status 28072 Cavendish CT Unit 2205, Bonita Springs — Worthington $199,000 Located in Worthington Country Club, this delightful and welcoming first-floor Chatham model residence. The open great room concept features two bedrooms, two baths, gran... 2 Beds 2 Baths 225067078 MLS Worthington Bldg. ACTIVE Status 28042 Bridgetown CT Unit 4611, Bonita Springs — Bonita National Golf And Country Club $459,000 Step into this sought after ground floor, \"Arabella\" floor plan offering 2 bedrooms plus a den, 2 bathrooms, and a 1 car garage in the resort style community of Bonita Na... 2 Beds 2 Baths 225066033 MLS Bonita National Golf And Country Club Bldg. ACTIVE Status 12607 Fox Ridge Dr Unit 4202, Bonita Springs — Hunters Ridge $439,000 GOLF MEMBERSHIP INCLUDED ($50,000 VALUE)! Hunters Ridge is a Private Golf & Country Club. Hunters Ridge is a private golf and country club, not a bundled community only 4... 3 Beds 3 Baths 225066449 MLS Hunters Ridge Bldg. ACTIVE Status Bonita Springs — Bonita National Golf And Country Club $1,250,000 HERE IT IS! One of the most popular floor plans by Lennar, the nearly 2300 square feet Maria Model.  This home has it all.  Golf Membership, Southern exposure, view of La... 4 Beds 3 Baths 225066383 MLS Bonita National Golf And Country Club Bldg. ACTIVE Status 20940 Island Sound CIR Unit 105, Estero — Island Sound $375,000 Live the ultimate Southwest Florida lifestyle in this stunning first-floor condo for sale in Pelican Sound Golf & River Club, Estero’s premier waterfront bundled golf com... 2 Beds 2 Baths 225066257 MLS Island Sound Bldg. ACTIVE Status 19851 Breckenridge DR Unit 108, Estero — Preserve I $282,000 THE COMMUNITY:\r\n ---Breckenridge is made up of 842 units including condos, villas, and coach homes that overlook 5 lakes. The outdoor amenities include 5 swimming pools, ... 3 Beds 2 Baths 225066190 MLS Preserve I Bldg. ACTIVE Status 17941 Bonita National Blvd Unit 334, Bonita Springs — Bonita National Golf And Country Club $390,000 ▼ Golf membership is included in this beautifully maintained 2-bedroom, 2-bath, 3rd floor unit with breathtaking lake and golf course views in the highly sought-after gated... 2 Beds 2 Baths 225063986 MLS Bonita National Golf And Country Club Bldg. ACTIVE Status 28089 Wicklow Ct, Bonita Springs — Bonita National Golf And Country Club $799,000 Social Membership included. Experience resort-style living in this beautifully appointed 4-bedroom, 3-bathroom home with a 3-car garage and 2,267 sq ft of living space, l... 4 Beds 3 Baths 225064687 MLS Bonita National Golf And Country Club Bldg. ACTIVE Status 20624 Candlewood, Estero — Country Creek $319,900 Enjoy beautiful fountain views of the 10th and 11th fairway from your private lanai!  This unique layout with a Great Room design offers ample open space for your maximum... 2 Beds 2 Baths 225065501 MLS Country Creek Bldg. ACTIVE Status 13640 Worthington WAY Unit 1902, Bonita Springs — Worthington $215,000 Located in Worthington Country Club, this first-floor Chatham model residence offers open great room concept features two bedrooms and two baths including newer stainless... 2 Beds 2 Baths 225065664 MLS Worthington Bldg. ACTIVE Status 13511 Southampton DR, Bonita Springs $549,900 ▼ Sought-After Floor Plan | 3-Bed, 2-Bath Pool Home in Worthington Country Club.\r\nLocated in the highly desirable Worthington Country Club, this beautifully updated 3-bedro... 3 Beds 2 Baths 225065779 MLS ACTIVE Status 11041 Corsia Trieste WAY Unit 205, Bonita Springs — Trieste $415,000 Live the Golf Course Dream in Trieste at Vasari! This stunning second-floor former model condo offers soaring 15-foot ceilings, elegant decorative moldings, and southern ... 2 Beds 2 Baths 225065306 MLS Trieste Bldg. ACTIVE Status 20111 Ian Ct Unit 306, Estero — Breckenridge $249,900 Turnkey top floor Bayview model with a terrific view being sold turnkey. Many upgrades and well maintained. Kitchen updated by Cornerstone Kitchens. Updated bathrooms inc... 2 Beds 2 Baths 225065543 MLS Breckenridge Bldg. ACTIVE Status 20710 Persimmon Place, Estero $299,900 Welcome to easy Florida living! This beautifully maintained 2-bedroom, 2 bathroom single-family home is located in the highly desirable Villages at Country Creek, right i... 2 Beds 2 Baths 2025003773 MLS ACTIVE Status 28076 Foxrock Court, Bonita Springs $1,050,000 Take a look at what could be your new home in Bonita National - A gated community located in the heart of Bonita Springs! This home is known as the Maria model and contai... 4 Beds 3 Baths 2025003495 MLS ACTIVE Status 9331 Spring Run BLVD Unit 3003, Estero — Winding Stream $299,000 ▼ Experience exceptional living in this spacious two-bedroom, two-bath home located in the highly sought-after Spring Run at the Brooks. Nestled within a vibrant bundled go... 2 Beds 2 Baths 225064464 MLS Winding Stream Bldg. ACTIVE Status 20608 Candlewood Hollow, Estero $379,000 ▼ WATER VIEWS AND GOLF COURSE VIEWS, UPDATED KITCHEN AND BATHS, AND GOLF INCLUDED! Welcome to your refined retreat in the heart of Country Creek, Estero’s premier golf cour... 2 Beds 2 Baths 225064692 MLS ACTIVE Status 13904 Southampton DR Unit 3101, Bonita Springs — Wedgewood Fountain $409,900 ▼ OVER $70K IN UPGRADES, TURNKEY FURNISHED, AND IMMEDIATE GOLF MEMBERSHIP! Welcome to this charming Bundled golf Condo in Worthington CC that boasts several upgrades, inclu... 2 Beds 2 Baths 225064519 MLS Wedgewood Fountain Bldg. ACTIVE Status 13966 Southampton DR Unit 4504, Bonita Springs — Worthington $454,000 Immediate golf membership included! This second-floor carriage home offers panoramic views of the community’s longest lake vista. A thoughtfully enclosed lanai is positio... 2 Beds 2 Baths 225064174 MLS Worthington Bldg. ACTIVE Status 12060 Toscana Way Unit 102, Bonita Springs — Vasari $515,000 Refined Florida living at its best! Located in the coveted Vasari community, this south-facing carriage home with expansive golf-course views and full modern renovations ... 2 Beds 2 Baths 225064052 MLS Vasari Bldg. ACTIVE Status 17330 Galway RUN, Bonita Springs $854,500 ▼ *SOCIAL MEMBERSHIP INCLUDED* Nestled on a peaceful preserve lot in the highly sought-after gated community of Bonita National Golf & Country Club, this meticulously maint... 3 Beds 2 Baths 225064023 MLS ACTIVE Status 13631 Worthington Way Unit 1711, Bonita Springs $279,999 Be prepared to be impressed.  Beautiful, tastefully decorated,  TURNKEY, updated, 2 bedroom golf view condo in Worthington.  This is the condo you have been waiting for. ... 2 Beds 2 Baths 2025000543 MLS ACTIVE Status 17991 Bonita National Boulevard Unit 843, Bonita Springs $399,900 This is your chance to own a condo where you'll have the luxury of breathtaking sunsets overlooking the largest lake in Bonita National and the first green of the golf co... 2 Beds 2 Baths 225032506 MLS ACTIVE Status 4158 Pensacola Avenue, Estero $445,900 Turnkey 3BR 2 ½ Bath Home with Attached Garage \r\nThis beautifully updated “Barbados” model Town Home, offers a spacious open floor plan with vaulted ceilings and is truly... 3 Beds 3 Baths 225046984 MLS ACTIVE Status 4150 Gunnison Court Unit 722, Estero $214,000 Turnkey 2 Bed, 2 Bath Condo in Desirable Breckenridge Community\r\n\r\nWelcome to this beautifully maintained second-floor Wellington floorplan, offering 2 bedrooms and 2 bat... 2 Beds 2 Baths 225034550 MLS ACTIVE Status 4690 Turnberry Lake Drive Unit 104, Estero $359,000 First Floor Unit with Golf Course Views – Turnkey Furnished!\r\n\r\nEnjoy the beautiful neighborhood of Turnberry in Pelican Sound. Relax on your very private lanai while tak... 2 Beds 2 Baths 225042486 MLS ACTIVE Status 4261 Ute Court, Estero $284,000 Seller is offering a one-year home warranty and will pay all association assessments through the end of 2025. This beautifully maintained 2-bedroom, 2-bath townhome with ... 2 Beds 2 Baths 225018504 MLS ACTIVE Status 13010 Amberley Court Unit 210, Bonita Springs $269,900 This is your opportunity to own a GOLF MEMBERSHIP INCLUDED condo in one of Bonita Springs' finest community Worthington Golf & Country Club. This is definitely a place yo... 2 Beds 2 Baths 225043451 MLS ACTIVE Status 4162 Tequesta Drive, Estero $439,000 Stunning Barbados Model Townhome with Lake Views.  Discover your dream home in the highly sought-after Breckenridge Association!\r\nThis turnkey Barbados model townhome boa... 3 Beds 3 Baths 224088298 MLS ACTIVE Status 12803 Maiden Cane Lane, Bonita Springs $370,000 WELCOME TO THE LOWEST PRICED VILLA in the highly sought-after gated community of Hunters Ridge Golf and Country Club—a private, gated 24-hour guarded neighborhood offerin... 3 Beds 2 Baths 225062247 MLS ACTIVE Status 20151 Ian Court Unit 201, Estero $294,900 Beautifully maintained and highly sought-after end-unit condominium offering versatility with 3 bedrooms or 2 bedrooms plus a den, along with 2 bathrooms. This home has b... 2 Beds 2 Baths 225013574 MLS ACTIVE Status 20930 Island Sound Circle Unit 402, Estero $395,000 Welcome to your dream PENTHOUSE in the heart of Southwest Florida’s most vibrant and BEAUTIFUL GATED COMMUNITY — the prestigious Pelican Sound Golf & River Club. This exq... 2 Beds 2 Baths 225044625 MLS ACTIVE Status 20760 Country Creek Drive Unit 613, Estero $230,000 ▼ Discover comfort and convenience in this 2-bedroom plus den, 2-bathroom condo located in the desirable Country Creek community! Enjoy peaceful pond views from the screene... 2 Beds 2 Baths 225034992 MLS ACTIVE Status 4151 Ashcroft Court Unit 112, Estero $225,000 Welcome to 4151 Ashcroft Court Unit 112, a beautifully appointed first-floor condo in the highly desirable Wellington at Breckenridge. This 2 bedroom, 2 bathroom home off... 2 Beds 2 Baths 225042097 MLS ACTIVE Status 19870 Breckenridge Drive Unit 504, Estero $317,500 Welcome to this beautifully maintained 5th-floor condo in the highly sought-after community of Breckenridge in Estero. This turn-key furnished 3-bedroom, 2-bath unit offe... 3 Beds 2 Baths 225036798 MLS ACTIVE Status 12068 Via Cercina Drive, Bonita Springs $1,295,000 Exquisite Former Model Home in Premier Vasari Country Club.\r\nWelcome to your dream home in Vasari Country Club, Southwest Florida’s premier bundled golf community, where ... 3 Beds 2 Baths 225056977 MLS ACTIVE Status 17350 Cherrywood Court Unit 6603, Bonita Springs $685,000 COME SEE THIS \"WOW\" COACH HOME!!  This is an impressive second floor, 3 bedroom/2 bath/2 car oversized garage condo with a big lanai and sweeping sunset views. What enjoy... 3 Beds 2 Baths 225046329 MLS ACTIVE Status 12651 Hunters Lakes Court, Bonita Springs $600,000 ▼ REDUCED!  Welcome to 12651 Hunters Lakes Ct! This exquisite 4-bedroom, 2.5-bathroom pool home offers a luxurious living space. Built in 1996, this property is in model-pe... 4 Beds 3 Baths 225021323 MLS ACTIVE Status 4135 Jace Court, Estero $385,000 Don't Miss This Exceptional Opportunity!\r\nDiscover this beautifully maintained Barbados Townhome in the highly desirable Breckenridge Golf & Tennis Club—PRICED TO SELL an... 3 Beds 3 Baths 225050351 MLS ACTIVE Status 28076 Cavendish Court Unit 2107, Bonita Springs $349,000 Why wait over a year and pay rising membership and cart fees—when you can tee off the same day you close? With no guarantee of future costs, this is your opportunity to l... 3 Beds 2 Baths 225052759 MLS ACTIVE Status 4218 Jace Court, Estero $354,900 Rarely Available Villa, with Stunning Lake Views – Turnkey & Move-In Ready!\r\n\r\nDiscover the charm of this highly sought-after 2-bedroom, 2-bath villa, featuring an attach... 2 Beds 2 Baths 225032958 MLS ACTIVE Status 19870 Breckenridge Drive Unit 207, Estero $315,000 The Breckenridge gated community offers resort style living steps from your door, with golf, tennis, pickleball, shuffleboard, bocce, 5 pools & spa, clubhouse, pavilion (... 2 Beds 2 Baths 225046996 MLS ACTIVE Status 19880 Breckenridge Drive Unit 505, Estero $294,900 Top-Floor Lakewood Model with Stunning Upgrades in Breckenridge – Estero, FL\r\n\r\nSellers are including a one-year Choice Home Warranty for added peace of mind!\r\n\r\nStep int... 3 Beds 2 Baths 225004804 MLS ACTIVE Status 17270 Cherrywood Court Unit 5904, Bonita Springs $595,000 ▼ Are you ready to live the ultimate SW Florida lifestyle in the prestigious, gated Bonita National Golf & Country Club? Welcome to 17270 Cherrywood Ct #5904 in Bonita Spri... 3 Beds 2 Baths 225055772 MLS ACTIVE Status 20621 Country Creek Drive Unit 3125, Estero $249,000 ▲ PRICE IMPROVEMENT! Completely renovated and meticulously maintained 2nd floor condo has beautiful lake and golf course views. High ceilings and an open great room floor p... 2 Beds 2 Baths 225022739 MLS ACTIVE Status 4040 Durango Court Unit 101, Estero $237,900 ▼ End unit, 1437 sq ft, with 3 bedrooms, 2 bathrooms and carport *  No water from hurricanes * Wooded area behind for privacy * Wood look tile floors throughout, no carpet ... 3 Beds 2 Baths 225052717 MLS ACTIVE Status 17981 Bonita National BLVD Unit 715, Bonita Springs — Bonita National Golf And Country Club $379,900 ▼ Welcome home to this West facing, beautiful 2-bedroom, 2-bathroom first-floor walkout condo is perfectly situated in front of the first tee box of the community’s stunnin... 2 Beds 2 Baths 225063269 MLS Bonita National Golf And Country Club Bldg. ACTIVE Status 17290 Cherrywood CT Unit 6103, Bonita Springs — Bonita National Golf And Country Club $690,000 Tired of the same old routine and searching for a home that offers more than just a place to live? Incredible opportunity at Luxurious Bonita National Golf and Country Cl... 3 Beds 2 Baths 225062396 MLS Bonita National Golf And Country Club Bldg. ACTIVE Status 12695 Fox Ridge DR, Bonita Springs $379,000 This Turnkey Furnished attached villa in Hunters Ridge Golf & Country Club provides 2 bedrooms plus a large den that can easily be used as a 3rd bedroom, 2-car garage and... 2 Beds 2 Baths 225062889 MLS ACTIVE Status 13271 Sherburne CIR Unit 2501, Bonita Springs — Wedgewood Sherburne $408,000 ▼ Discover the perfect blend of comfort, convenience, and leisure in this stunning 1st-floor carriage home, nestled within the highly sought-after bundled golf community of... 3 Beds 2 Baths 225062227 MLS Wedgewood Sherburne Bldg. ACTIVE Status 28181 Alfred Moore Ct, Bonita Springs — Hunters Ridge $290,000 Excellent location! Cul-de-sac with lake and golf course view! Hunters Ridge is a Private Golf & Country Club, not a bundled community only 420 golf members, no Chelsea s... 225062036 MLS Hunters Ridge Bldg. ACTIVE Status 24361 Copperleaf BLVD, Estero $1,149,000 ▲ STUNNING 3 BEDROOM, DEN, 2 BATH OAKWOOD MODEL with gorgeous golf course and lake views of the 9th hole in the sought after bundled golf community of COPPERLEAF AT THE BRO... 3 Beds 2 Baths 225061055 MLS ACTIVE Status 11081 Corsia Trieste WAY Unit 104, Bonita Springs — Trieste $415,000 Turnkey Bonita Springs Condo for Sale in Vasari Country Club\r\n\r\nEvery day feels like a getaway at 11081 Corsia Trieste Way Unit 104 in Bonita Springs, Florida. Now offere... 2 Beds 2 Baths 225060163 MLS Trieste Bldg. ACTIVE Status 4191 Pensacola Ave, Estero — Breckenridge $399,999 Discover the spacious Cancun Model, a three-bedroom, two-and-a-half-bath end unit boasting picturesque long lake views. The kitchen features a vaulted ceiling and a windo... 3 Beds 2.5 Baths 225060397 MLS Breckenridge Bldg. ACTIVE Status 28051 Bridgetown Ct Unit 5725, Bonita Springs — Bonita National Golf And Country Club $469,000 Welcome to Bonita National where your Florida dream becomes a reality! Stunning second floor coach home is located in Bonita National Golf and Country Club with gorgeous ... 2 Beds 2 Baths 225054706 MLS Bonita National Golf And Country Club Bldg. ACTIVE Status 28601 Firenze WAY Unit 102, Bonita Springs — Firenze $615,000 Fully Renovated & Turnkey with Golf Membership Included + Stunning Golf Course Views!\r\nMove right in to this beautifully updated home offering a long, panoramic view of t... 2 Beds 2 Baths 225058292 MLS Firenze Bldg. ACTIVE Status 28600 Pienza CT, Bonita Springs $1,089,000 Move-In Ready! Renovated Home with Golf Membership on Coveted Pienza Court.\r\n\r\nWelcome to your dream home in Vasari! This fully renovated, turnkey-furnished single-family... 3 Beds 2 Baths 225059133 MLS ACTIVE Status 9300 Highland Woods BLVD Unit 3105, Bonita Springs — Highland Woods $259,900 ▼ TURNKEY FIRST FLOOR CONDO WITH GOLF COURSE VIEWS & NEW LUXURY VINYL PLANK FLOORING – SELLER IS MOTIVATED!! Discover the perfect blend of comfort and convenience in this m... 2 Beds 2 Baths 225057000 MLS Highland Woods Bldg. ACTIVE Status 13221 Sherburne CIR Unit 601, Bonita Springs — Wedgewood At Worthington $375,000 Let's Make A Deal! Seller says Make Me Move.\r\n\r\nWelcome to the best value in bundled golf living in Southwest Florida! This first-floor carriage home in the coveted Worth... 3 Beds 2 Baths 225055005 MLS Wedgewood At Worthington Bldg. ACTIVE Status 13162 Bridgeford AVE, Bonita Springs $1,099,000 ▼ Immediate full golf membership included! The largest single-family home on charming Bridgeford Avenue. This expansive three-bedroom, 3.5-bath residence offers southern ex... 3 Beds 3.5 Baths 225057169 MLS ACTIVE Status 12085 Via Siena CT Unit 102, Bonita Springs — Firenze $525,000 GOLF MEMBERSHIP included with this charming carriage home in Vasari Country Club!  Located in the sought-after Firenze community with only 42 units sharing a private pool... 2 Beds 2 Baths 225056860 MLS Firenze Bldg. ACTIVE Status 12015 Matera LN Unit 201, Bonita Springs — Matera $389,900 Indulge in the ultimate golf lifestyle with this completely renovated and furnished 2-bedroom, 2-bathroom plus den, end unit condominium, complete with BUNDLED GOLF!  Ste... 2 Beds 2 Baths 225056628 MLS Matera Bldg. ACTIVE Status 26901 Clarkston DR Unit 106, Bonita Springs — St Andrews Verandas $469,000 ▼ Discover the allure of this beautifully remodeled Carlton Veranda in the sought-after Highland Woods community. This stunning home showcases an open kitchen concept featu... 2 Beds 2 Baths 225057143 MLS St Andrews Verandas Bldg. ACTIVE Status 13235 Sherburne CIR Unit 1603, Bonita Springs — Wedgewood Sherburne $429,900 Beautifully Updated Winchester Carriage Home in Worthington Country Club.  This stunning second-floor home is being offered turnkey furnished and features tasteful update... 2 Beds 2 Baths 225056976 MLS Wedgewood Sherburne Bldg. ACTIVE Status 26691 Clarkston Dr Unit 206, Bonita Springs — Highland Woods $450,000 Located in the heart of Bonita Springs, this beautifully updated 2-bedroom, 2-bathroom condo offers 1,256 square feet of living space withe exceptional views of the golf ... 2 Beds 2 Baths 225049327 MLS Highland Woods Bldg. ACTIVE Status 13090 Amberley CT Unit 1103, Bonita Springs — Amberley Court $209,000 ▼ Move-in ready and impeccably maintained, this 2-bedroom, 2-bathroom ground-floor condo in Worthington is being sold turn key. Offering nearly 1,100 square feet of comfort... 2 Beds 2 Baths 225055407 MLS Amberley Court Bldg. ACTIVE Status 18011 Bonita National BLVD Unit 945, Bonita Springs — Bonita National Golf And Country Club $380,000 Full golf membership included! Enjoy unlimited play on the Gordon Lewis 18-hole course, active tennis, resort pool with tiki bar and café, U-Topia Spa, vibrant social cal... 2 Beds 2 Baths 225055517 MLS Bonita National Golf And Country Club Bldg. ACTIVE Status 28076 Cavendish Ct Unit 2102, Bonita Springs — Worthington $245,500 This beautifully upgraded first-floor condo is not only priced to sell! Step inside to discover a fully furnished, move-in-ready home featuring two spacious bedrooms, fre... 2 Beds 2 Baths 225055726 MLS Worthington Bldg. ACTIVE Status 28103 Kerry CT, Bonita Springs $860,000 ▼ Beautifully maintained Stanford model in Bonita National offering 4 bedrooms, 3 baths, and 2,271 sq ft of open-concept living space. This home features granite countertop... 4 Beds 3 Baths 225054088 MLS ACTIVE Status 13651 Southampton DR, Bonita Springs $599,000 Move right in to this totally renovated sought after Aston floorplan detached villa home. Lovely furnishings throughout are included. This floorplan offers a wide open fe... 3 Beds 2 Baths 225053099 MLS ACTIVE Status 13247 Sherburne CIR Unit 1901, Bonita Springs — Worthington $349,900 ▼ Enjoy serene golf course views from this well-appointed three-bedroom, two-bath residence with northeast exposure. Overlooking the 14th hole, the home features elegant ti... 3 Beds 2 Baths 225051238 MLS Worthington Bldg. ACTIVE Status 17961 Bonita National BLVD Unit 514, Bonita Springs — Bonita National Golf And Country Club $384,900 ▼ FULL GOLF MEMBERSHIP INCLUDED, TURNKEY FURNISHED AND VERY WELL CARED FOR!!!  COMING SOON--Pickleball and Bocce!! Exceptional Resort-Style Living at Bonita National Golf &... 2 Beds 2 Baths 225046204 MLS Bonita National Golf And Country Club Bldg. ACTIVE Status 20902 Blacksmith Forge, Estero $299,000 ▼ Price Improvement! Welcome to a charming 2-bedroom, 2-bathroom corner villa perfectly situated within the friendly and vibrant BUNDLED GOLF community of The Villages at C... 2 Beds 2 Baths 225036283 MLS ACTIVE Status 23581 Sandycreek Ter Unit 1107, Estero — Spring Run At The Brooks $369,900 Welcome to Paradise! Enjoy serene views of the 8th hole green in this bundled, gated golf community at Spring Run. This charming turnkey furnished 2-bedroom, 2-bath carri... 2 Beds 2 Baths 225049945 MLS Spring Run At The Brooks Bldg. ACTIVE Status 21551 Pelican Sound DR Unit 202, Estero — Edgewater $599,900 It doesn’t get any better than this!   It is all about the ‘LIFESTYLE’ -  GOLF, GOLF, GOLF –   INCLUDED – 27 Holes, a Racket Club Complex Center with tennis and pickle-ba... 3 Beds 2 Baths 225045645 MLS Edgewater Bldg. ACTIVE Status 23560 Wisteria Pointe DR Unit 506, Estero — Wisteria Pointe $495,000 ▼ STUNNING GOLF COURSE VIEWS from this first floor 2+ den coach home in the sought after gated, bundled golf community of Copperleaf at the Brooks.  This freshly painted co... 2 Beds 2 Baths 225050020 MLS Wisteria Pointe Bldg. ACTIVE Status 11091 Corsia Trieste WAY Unit 206, Bonita Springs — Trieste $410,000 ▼ Golf included! Check out this two-bedroom plus den updated second-floor condominium, in the heart of the beautiful Vasari Country Club. This unit has been recently update... 2 Beds 2 Baths 225049338 MLS Trieste Bldg. ACTIVE Status 28171 L Burton Fletcher Ct, Bonita Springs — Hunters Ridge $670,000 ▼ This spacious, open floorplan ranch has lots of natural light and a large designer pool and spa.  It is in a gated country club community, where all residents are social ... 3 Beds 2 Baths 225049091 MLS Hunters Ridge Bldg. ACTIVE Status 9296 Spring Run Blvd, Estero — Spring Run At The Brooks $625,000 Rarely available end unit attached villa home located in the desirable Coral Cove section of Spring Run at the Brooks. This villa homes offer easy condo like living with ... 2 Beds 2 Baths 225048674 MLS Spring Run At The Brooks Bldg. ACTIVE Status 20950 Rivers Ford, Estero $534,000 ▼ New price. Enjoy our newly renovated 18-hole, par-61 executive golf course, designed for both casual and avid golfers. Whether you're perfecting your swing or just enjoyi... 2 Beds 2 Baths 225048027 MLS ACTIVE Status 4219 Tequesta DR, Estero — Village On Crescent Lake $450,000 Welcome to your slice of paradise in the heart of Estero! This stunning 2nd-floor Antigua III coach home in the coveted Breckenridge community offers the perfect blend of... 3 Beds 2 Baths 225048604 MLS Village On Crescent Lake Bldg. ACTIVE Status 28564 Longford Ct, Bonita Springs — Bonita National Golf And Country Club $1,215,000 ▼ GOLF MEMBERSHIP INCLUDED! This beautifully appointed 4-bedroom, 2-bath single-family Princeton model features a spacious 3-car garage and comes with bundled golf, giving ... 4 Beds 2 Baths 225048170 MLS Bonita National Golf And Country Club Bldg. ACTIVE Status 28135 Foxrock CT, Bonita Springs $945,900 ▼ Your Slice of Paradise Awaits in Bonita Springs! Welcome to the sought-after Maria model, with DEEDED SOCIAL MEMBERSHIP in Bonita National Golf and Country Club, where yo... 4 Beds 3 Baths 225046375 MLS ACTIVE Status Estero — Country Creek $389,900 ▼ NEW TO MARKET - Welcome to this spacious, well-cared for 2 bedroom, 2 bath home with a den and true eat-in-kitchen.  The bright and roomy kitchen boasts generous counter ... 2 Beds 2 Baths 225044104 MLS Country Creek Bldg. ACTIVE Status 26841 CLARKSTON DR Unit 105, Bonita Springs — St Andrews Verandas $439,000 COME AND VIEW THIS BEAUTIFUL VERANDA HOME IN HIGHLAND WOODS OVERLOOKING THE GOLF COURSE! THIS HOME HAS HAD LONG TIME OWNERS FROM THE MIDWEST SO IT HAS BEEN VERY LIGHTLY U... 2 Beds 2 Baths 225042528 MLS St Andrews Verandas Bldg. ACTIVE Status 4651 Turnberry Lake DR Unit 201, Estero — Turnberry $500,000 Bright southwest facing, top floor end unit home with an incredible panoramic view of golf, lake and quaint wooden bridge in the distance.\r\nWonderful corner lanai to enjo... 3 Beds 2 Baths 225041543 MLS Turnberry Bldg. ACTIVE Status 13641 Worthington Way Unit 1612, Bonita Springs — Worthington $299,900 IMMACULATE TURNKEY CONDO WITH GOLF AND LAKE VIEWS:\r\nThis beautifully maintained 3-bedroom, 2-bathroom condo, 2nd floor, offers 1,311 sq. ft. of bright, inviting living sp... 3 Beds 2 Baths 225043399 MLS Worthington Bldg. ACTIVE Status 19851 Breckenridge Dr Unit 102, Estero — Breckenridge $298,000 ▼ Spacious First-Floor Condo with Lake & Golf Course Views in The Preserve at Breckenridge.\r\nWelcome to this beautifully maintained 2-bedroom, 2-bathroom first-floor condo ... 2 Beds 2 Baths 225043257 MLS Breckenridge Bldg. ACTIVE Status 28436 Altessa WAY Unit 102, Bonita Springs — Matera $418,000 Step into Paradise Living with Bundled Golf Membership Included!\r\n\r\nWelcome to over 1,600 square feet of fully furnished comfort in this completely renovated, top-to-bott... 2 Beds 2 Baths 225041011 MLS Matera Bldg. ACTIVE Status 28068 Cavendish CT Unit 2303, Bonita Springs — Cavendish Court $285,000 Step into effortless Florida living with this beautifully maintained, TURNKEY 2-bedroom, 2-bathroom first-floor unit in the sought-after Cavendish Court at Worthington. O... 2 Beds 2 Baths 225041062 MLS Cavendish Court Bldg. ACTIVE Status Like or Share Loading likes... Share on Facebook Share on X (Twitter) Share on LinkedIn Address Search Bundled Golf in Bonita Springs & Estero Bonita National Breckenridge Copperleaf Country Creek Highland Woods Hunters Ridge Pelican Sound Spring Run at The Brooks Vasari Worthington Bonita Springs Communities Arbel Arlington Park Barefoot Beach Bermuda Park Bermuda Ridge Bonita Bay Bonita Beachwalk Bonita Fairways Bonita Farms Bonita Golf & CC Bonita Golf Villas Bonita Isles Bonita Lakes Bonita Landing Bonita National Bonita Pines Bonita Village Brendan Cove Cape Hickory Cedar Creek Carolands Citadel Condo Cockleshell Village Copperleaf Cordera Cordova at Spanish Wells Edenbridge Eden Rock El Dorado Acres Forest Creek Villas Hacienda Village Hawthorne Heitmans Highland Woods Hunters Ridge Imperial Harbor Imperial Palms Imperial Shores Lakes of San Souci Lakeside Hideaway Lighthouse Bay Mango Creek Marbella Spanish Wells Meadowbrook Mirasol Coconut Point Morton Grove Nuttinglikit Grove Palmesta Palmira Golf CC Paloma Paradise Village Pebble Pointe Pelican Landing Penn Dell Park Pine Haven Pirates Cove Plan of Riverside Preserve Bonita Springs Quail Creek Quail West Rapallo Coconut Point Richview Rio Vista Estates River Royale River Terrace Sanctuary Imperial River San Carlos Estates San Mirage San Remo Palmira Seasons Serrano Shadow Wood Shore Woods Solenzara Sorrento Spanish Gardens Spanish Wells Spring Creek Village Spring Run Talis Park The Colony The Greens The Tides Villages of Bonita Village Walk Waterfront Homes Valencia Bonita Vanderbilt Lakes Vasari Village Garden Villanova Colonnades Worthington Recent Bonita Springs Golf Communities Posts Pending Sale Citadel Condo Bonita Springs Florida - Listing Agent Public Golf in Bonita Springs, Florida Own Your Own Golf Cart in Bonita Springs Estero Florida Bonita Springs Florida Golf Course Capital of the World Hunter’s Ridge Golf & Country Club Tour [Video] Bonita Bay Real Estate Market Report Sept 1, 2012 Real Estate, Country Clubs & The Web Bundled Golf in Bonita Springs and Estero Florida Riverside Park Easter Weekend Events Fun on the Cheap | Bonita Beach, Florida Subscribe to our Bonita Springs Florida Newsletter by adding your email address! Additional Navigation Home Advanced Search Selling Buying Market Reports Featured Properties Blog About Us Contact Us Chris Griffith, Realtor The Best Bonita Springs Listing Agent The Griffith Group Downing Frye Realty, Inc. 27399 Riverview Center Blvd. Suite 101 Bonita Springs, FL 34134 239-273-7430 Call/Tex t © 2025 - All Rights Reserved Bonita Bay Waterfront Homes Bundled Golf Equity Golf Barefoot Beach IDX Real Estate Websites by • Accessibility • Terms • Privacy"
    },
    {
      "url": "https://www.topnotchhomepros.com/paid-members-directory/breckenridge-golf-tennis-club/",
      "text": "Breckenridge Golf & Tennis Club - Top Notch Home Pros HOME FIND LOCAL PROS AVE MARIA NAPLES FORT MYERS MARCO ISLAND CAPE CORAL BONITA SPRINGS – ESTERO EVENTS MEMBERSHIP MEMBERSHIP HOME CONTACT US LOG IN Facebook Breckenridge Golf & Tennis Club Home Breckenridge Golf & Tennis Club Breckenridge Golf & Tennis Club Home / Breckenridge Golf & Tennis Club Breckenridge Golf & Tennis Club Home » Breckenridge Golf & Tennis Club Contact Information Phone: 239-992-5959 Address: 20091 Wimbleton Ct , Estero, Florida, USA 33928 Email: breckenridge@castlegroup.com Website: view our site Facebook: https://www.facebook.com/BreckenridgeGolfandTennisClub/ Description: Breckenridge is made up of 842 units including condos, villas, and coach homes that overlook 5 lakes.  Our outdoor amenities include 5 swimming pools, an 18-hole Par 3 bundled golf course, 8 lighted HAR TRU tennis courts, 3 pickleball courts, and 3 bocce courts. Indoor amenities include a fitness room, a library, a catering kitchen, and a large common area and lanai. To view more information on our amenities, see below for photos and brief descriptions. The clubhouse offers numerous regularly scheduled activities such as bingo, knitting, exercise classes, bridge, euchre, poker, and other card groups.  Special events vary but include themed parties and dinner dances with live entertainment! Deborah Lisiewski- Property Manager dlisiewski@castlegroup.com P: 239-992-5959 F: 239-948-0066 Da'sia Sponito- Assistant Property Manager/ Office Manager dsponito@castlegroup.com P: 239-992-5959 Marilyn Ramirez -  Front Deck/ Lifestyle Coordinator marilyn.ramirez@castlegroup.com P: 239-992-5959 Steadmon Allen- Maintenance Manager sallen@castlegroup.com P: 239-850-9262 Communities - Membership OUR SERVICES PLUMBING SERVICES ROOFING SERVICES HOME WATCH ELECTRICAL SERVICES LANDSCAPING SERVICES HOUSECLEANING SERVICES REMODELING SERVICES PAINTING SERVICES FLOORING FINANCIAL & INSURANCE PEST CONTROL TINT SERVICES HEATING & A/C HANDYMAN ACCOUNTING RESTORATION HOME INSPECTION BUSINESS SERVICES HEALTH & WELLNESS LOCATIONS WE SERVE AVE MARIA NAPLES FORT MYERS MARCO ISLAND CAPE CORAL BONITA SPRINGS – ESTERO © 2025 Top Notch Home Pros. All Rights Reserved."
    },
    {
      "url": "https://www.breckenridgehomeowners.com/amenities/",
      "text": "About Us Login Toggle navigation Menu Home About Us Homes for Sale/Lease Homeowners Homeowners Address Book Calendar Events Forms Requests Tennis/Pickleball Reservations Master Board Master Board Architectural Review Committee Board Certificates Board Sanctioned Committees Breckenridge Documents Breckenridge Survey Results (2025) Budget Contracts Financials/Audit Management Companies Master Board & Association Officers Master Board Minutes Master Insurances Meeting Video Links Weekly Report from Office Contact Us About Us Click Here to View Current Master Fee Schedule for 2025 Breckenridge Property Map About Breckenridge Brochure (Tells Process of Closing and Estoppels) - If you need to view Rules and Budgets, then the current owner has access to those items on the website, which they will be able to download for you. For sale signs and specs - (If you have an open house or showing, please contact the office at 239-992-5959 or breckenridge@castlegroup.com for code and rules ) Management Companies (Each Local Association has different management companies) Breckenridge Golf & Tennis Club is a private community where gracious gulf coast living awaits you.  Whether you are a winter visitor or a year-round resident, you will love to call Breckenridge Home! Breckenridge is made up of 842 units, including condos, villas, and coach homes that overlook 5 lakes.  Our outdoor amenities include 5 swimming pools, an 18-hole Par 3 bundled golf course, 8 lighted HAR TRU tennis courts, 3 pickleball courts, 6 shuffleboard courts and 3 bocce courts. Indoor amenities include a fitness room, a library, a catering kitchen, and a large common area and lanai. To view more information on our amenities, see below for photos and brief descriptions. The clubhouse offers numerous regularly scheduled activities such as bingo, knitting, exercise classes, bridge, euchre, poker, and other card groups.  Special events vary but include themed parties and dinner dances with live entertainment! Whether renters, part-time or full-time residents, Breckenridge provides a warm and welcoming environment where residents take pride in our community and truly care about our neighbors! Bocce Courts We have 3 Bocce Courts adjacent to the main pool.  Equipment is provided. Fitness Room (view 1) Fitness Room (view 2) The Fitness Room is located inside the Clubhouse and is accessible every day from 7:00 am to 10:00 pm.  It is open to residents, renters, and their guests. Lanai (View 1) Lanai (View 2) Lanai (View 3) A beautiful view, no matter what angle of the lanai you choose to sit. You can watch tennis players, view the lake or enjoy the pool side. Golf Course We offer a private 3 par Golf Course with 18 holes.  Golf Scrambles & open golf is open to all residents, tenants & tenants' guests. Golf Range & Putting Ring The Golf Range is located at Hole #10 (behind the tennis courts). Horseshoes The Horseshoe pit is located behind the tennis courts by golf course hole #10. Ping Pong The Ping Pong table is located on the Lanai of the Breckenridge Clubhouse. The paddles and balls are hanging on at the end of one of the tables underneath. Pools Clubhouse Main Pool Clubhouse Hot Tub The main pool with the hot tub is located at the clubhouse.  The remaining 4 pools are located throughout the community and can be viewed on the Breckenridge Property Map . Shuffle Board Courts There are 6 Shuffle Board Courts adjacent to the clubhouse.  The equipment is located in the storage shed by the courts. Pickleball Courts There are 3 Pickleball courts. Residents & Renters can make online reservations 5 days in advance. Tennis Courts There are 8 Tennis Courts.  Court #8 is equipped with a ball machine.  Residents & Renters can make online reservations 5 days in advance. Breckenridge Golf & Tennis Club 20091 Wimbleton Ct Estero, FL 33928 breckenridge@castlegroup.com Office Number: 239.992.5959 Office Fax: 239.948.0066 Contact us Office Hours: Monday - Friday: 8am - 4pm Professionally Managed by Castle Group https://www.castlegroup.com/ © Copyright 2025 Breckenridge Golf and Tennis Club | Community Website by HOA Sites | Terms of Use | Admin"
    },
    {
      "url": "https://www.breckenridgehomeowners.com/contact-us/",
      "text": "Breckenridge Golf and Tennis Club Login Toggle navigation Menu Home About Us Homes for Sale/Lease Homeowners Homeowners Address Book Calendar Events Forms Requests Tennis/Pickleball Reservations Master Board Master Board Architectural Review Committee Board Certificates Board Sanctioned Committees Breckenridge Documents Breckenridge Survey Results (2025) Budget Contracts Financials/Audit Management Companies Master Board & Association Officers Master Board Minutes Master Insurances Meeting Video Links Weekly Report from Office Contact Us Contact Us Please contact us with your thoughts, questions and suggestions. Your Name Your Email Address Phone How can we help you? Check Breckenridge Golf & Tennis Club 20091 Wimbleton Ct Estero, FL 33928 breckenridge@castlegroup.com Office Number: 239.992.5959 Office Fax: 239.948.0066 Contact us Office Hours: Monday - Friday: 8am - 4pm Professionally Managed by Castle Group https://www.castlegroup.com/ © Copyright 2025 Breckenridge Golf and Tennis Club | Homeowners Association Website by HOA Sites | Terms of Use | Admin"
    },
    {
      "url": "https://breckenridgehomeowners.com/",
      "text": "Breckenridge Golf and Tennis Club Login Toggle navigation Menu Home About Us Homes for Sale/Lease Homeowners Homeowners Address Book Calendar Events Forms Requests Tennis/Pickleball Reservations Master Board Master Board Architectural Review Committee Board Certificates Board Sanctioned Committees Breckenridge Documents Breckenridge Survey Results (2025) Budget Contracts Financials/Audit Management Companies Master Board & Association Officers Master Board Minutes Master Insurances Meeting Video Links Weekly Report from Office Contact Us Newsletter September 2025 September 2025 Newsletter August 2025 Newsletter July 2025 Newsletter June 2025 Newsletter May 2025 Newsletter May 2025 Newsletter April 2025 Newsletter January 2025 Newsletter December 2024 Newsletter November 2024 Newsletter View Archives Notices/Agenda Please login to view this area. Community Information Please login to view this area. Upcoming Events Tennis and Pickleball Reservations Contact Us Breckenridge Golf & Tennis Club 20091 Wimbleton Ct Estero, FL 33928 breckenridge@castlegroup.com Office Number: 239.992.5959 Office Fax: 239.948.0066 Contact us Office Hours: Monday - Friday: 8am - 4pm Professionally Managed by Castle Group https://www.castlegroup.com/ © Copyright 2025 Breckenridge Golf and Tennis Club | Condo Website by HOA Sites | Terms of Use | Admin"
    },
    {
      "url": "https://www.breckenridgehomeowners.com/home/",
      "text": "Breckenridge Golf and Tennis Club Login Toggle navigation Menu Home About Us Homes for Sale/Lease Homeowners Homeowners Address Book Calendar Events Forms Requests Tennis/Pickleball Reservations Master Board Master Board Architectural Review Committee Board Certificates Board Sanctioned Committees Breckenridge Documents Breckenridge Survey Results (2025) Budget Contracts Financials/Audit Management Companies Master Board & Association Officers Master Board Minutes Master Insurances Meeting Video Links Weekly Report from Office Contact Us Newsletter September 2025 September 2025 Newsletter August 2025 Newsletter July 2025 Newsletter June 2025 Newsletter May 2025 Newsletter May 2025 Newsletter April 2025 Newsletter January 2025 Newsletter December 2024 Newsletter November 2024 Newsletter View Archives Notices/Agenda Please login to view this area. Community Information Please login to view this area. Upcoming Events Tennis and Pickleball Reservations Contact Us Breckenridge Golf & Tennis Club 20091 Wimbleton Ct Estero, FL 33928 breckenridge@castlegroup.com Office Number: 239.992.5959 Office Fax: 239.948.0066 Contact us Office Hours: Monday - Friday: 8am - 4pm Professionally Managed by Castle Group https://www.castlegroup.com/ © Copyright 2025 Breckenridge Golf and Tennis Club | Condo Website by HOA Sites | Terms of Use | Admin"
    }
  ]
}