{
  "fuentes": [
    {
      "url": "https://brevardzoo.planningyourlegacy.org/contact-us",
      "email": "dcassario@brevardzoo.org"
    },
    {
      "url": "https://brevardzoo.planningyourlegacy.org/contact-us",
      "email": "dmp.forms@stelter.com"
    },
    {
      "url": "https://restoreourshores.org/contact/",
      "email": "v.wilcock@brevardzoo.org"
    },
    {
      "url": "https://restoreourshores.org/contact/",
      "email": "arearden@brevardzoo.org"
    },
    {
      "url": "https://restoreourshores.org/contact/",
      "email": "hgattle@brevardzoo.org"
    },
    {
      "url": "https://restoreourshores.org/contact/",
      "email": "hleonard@brevardzoo.org"
    },
    {
      "url": "https://restoreourshores.org/contact/",
      "email": "jhansen@brevardzoo.org"
    },
    {
      "url": "https://restoreourshores.org/contact/",
      "email": "kschneider@brevardzoo.org"
    },
    {
      "url": "https://restoreourshores.org/contact/",
      "email": "lcorcoran@brevardzoo.org"
    },
    {
      "url": "https://restoreourshores.org/contact/",
      "email": "maggier@brevardzoo.org"
    },
    {
      "url": "https://restoreourshores.org/contact/",
      "email": "mpadgett@brevardzoo.org"
    },
    {
      "url": "https://restoreourshores.org/contact/",
      "email": "restoreourshores@brevardzoo.org"
    },
    {
      "url": "https://restoreourshores.org/contact/",
      "email": "smeyer@brevardzoo.org"
    },
    {
      "url": "https://restoreourshores.org/contact/",
      "email": "tprovoncha@brevardzoo.org"
    },
    {
      "url": "https://restoreourshores.org/contact/",
      "email": "vwilcock@brevardzoo.org"
    },
    {
      "url": "https://restoreourshores.org/contact/",
      "email": "ygutierrez@brevardzoo.org"
    },
    {
      "url": "https://brevardzoo.org/conservation/conservation-programs/support/",
      "email": "arearden@brevardzoo.org"
    },
    {
      "url": "https://brevardzoo.org/conservation/conservation-programs/support/",
      "email": "bforte@brevardzoo.org"
    },
    {
      "url": "https://brevardzoo.org/conservation/conservation-programs/support/",
      "email": "restoreourshores@brevardzoo.org"
    },
    {
      "url": "https://www.buildingourzoo.com/contact-vzds/",
      "email": "vzds@buildingourzoo.com"
    },
    {
      "url": "https://www.buildingourzoo.com/contact-vzds/",
      "email": "zoostore@buildingourzoo.com"
    },
    {
      "url": "https://www.zoo.org.au/about-us/contact-us/",
      "email": "contact@zoo.org.au"
    },
    {
      "url": "https://brevardzoo.org/visit/discounts/",
      "email": "deptguestservices@brevardzoo.org"
    },
    {
      "url": "https://southwickszoo.com/contact-us/",
      "email": "guestservices@southwickszoo.com"
    },
    {
      "url": "https://brevardzoo.org/careers/",
      "email": "hr@brevardzoo.org"
    },
    {
      "url": "https://brevardzoo.org/careers/",
      "email": "ebrummer@brevardzoo.org"
    },
    {
      "url": "https://brevardzoo.org/careers/",
      "email": "jbrown@brevardzoo.org"
    },
    {
      "url": "https://treetoptrek.com/",
      "email": "egracie@brevardzoo.org"
    },
    {
      "url": "https://brevardzoo.org/volunteer-programs/",
      "email": "restoreourshores@brevardzoo.org"
    },
    {
      "url": "https://brevardzoo.org/volunteer-programs/",
      "email": "voladmin@brevardzoo.org"
    },
    {
      "url": "https://brevardzoo.org/faqs/",
      "email": "cheri@brevardzoo.org"
    }
  ],
  "mails": [
    "arearden@brevardzoo.org",
    "bforte@brevardzoo.org",
    "cheri@brevardzoo.org",
    "contact@zoo.org.au",
    "dcassario@brevardzoo.org",
    "deptguestservices@brevardzoo.org",
    "dmp.forms@stelter.com",
    "ebrummer@brevardzoo.org",
    "egracie@brevardzoo.org",
    "guestservices@southwickszoo.com",
    "hgattle@brevardzoo.org",
    "hleonard@brevardzoo.org",
    "hr@brevardzoo.org",
    "jbrown@brevardzoo.org",
    "jhansen@brevardzoo.org",
    "kschneider@brevardzoo.org",
    "lcorcoran@brevardzoo.org",
    "maggier@brevardzoo.org",
    "mpadgett@brevardzoo.org",
    "restoreourshores@brevardzoo.org",
    "smeyer@brevardzoo.org",
    "tprovoncha@brevardzoo.org",
    "v.wilcock@brevardzoo.org",
    "voladmin@brevardzoo.org",
    "vwilcock@brevardzoo.org",
    "vzds@buildingourzoo.com",
    "ygutierrez@brevardzoo.org",
    "zoostore@buildingourzoo.com"
  ],
  "nombre_sitio": "brevardzoo.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://brevardzoo.planningyourlegacy.org/contact-us",
      "text": "Contact Us | Brevard Zoo Skip to main content Menu Planned Giving Home Easy Gifts Wills and Living Trusts Beneficiary Designations Give From Your IRA Income Gifts Charitable Remainder Trusts More Ways to Give Memorials and Tribute Gifts Real Estate Endowed Gifts Donor Advised Funds Charitable Lead Trusts Appreciated Securities Resources & More Gift Illustrator Your Planning Library Bequest Language Planning Toolkit Rafiki Circle Supporters Like You For Professional Advisors Contact Us Planned Giving Contact Us Contact Us How Can We Help You? Donna Toth-Cassario Senior Major Gifts Manager Phone: 321.254.9453, ext. 1014 Email: dcassario@brevardzoo.org Contact Us Form Have a question or comment? Please use this form to let us know. First Name First name is required Last Name Last name is required Email Address Please include an '@' in the email address Phone (Optional) Comments Checkpoint Submit Contact Us Our planned giving team would be happy to speak with you in confidence, with no obligation. I Have a Question Already included us in your estate plan? Let Us Know Let’s Talk! Donna Toth-Cassario 321.254.9453, ext. 1014 dcassario@brevardzoo.org Legal name: East Coast Zoological Society of Florida Federal tax ID number: 59-2496749 Information contained herein was accurate at the time of posting. The information on this website is not intended as legal or tax advice. For such advice, please consult an attorney or tax advisor. Figures cited in any examples are for illustrative purposes only. References to tax rates include federal taxes only and are subject to change. State law may further impact your individual results. California residents: Annuities are subject to regulation by the State of California. Payments under such agreements, however, are not protected or otherwise guaranteed by any government agency or the California Life and Health Insurance Guarantee Association. Oklahoma residents: A charitable gift annuity is not regulated by the Oklahoma Insurance Department and is not protected by a guaranty association affiliated with the Oklahoma Insurance Department. South Dakota residents: Charitable gift annuities are not regulated by and are not under the jurisdiction of the South Dakota Division of Insurance. © 2025 Brevard Zoo 8225 N. Wickham Road, Melbourne, Florida, 32940 Privacy Policy Email signup Facebook Twitter Instagram Yelp Tripadvisor I Have a Question Let us know your questions. I Have a Question Comments Name Name is required Email Address Please include an '@' in the email address Submit Thank You for Contacting Us Someone from Brevard Zoo will be in contact with you soon. If you need to speak to us immediately, please call us at 321.254.9453, ext. 1014."
    },
    {
      "url": "https://restoreourshores.org/contact/",
      "text": "Our Team - Restore Our Shores DONATE Mailchimp Facebook Projects Living Shoreline Oysters Oyster Reefs Oyster Gardening Shuck & Share Clams Mangroves Seagrass Buffer Zones Learn More Our Commitment Water Quality Data & Map Other Lagoon Resources Get Involved Volunteer Partners Universities Corporate Government NGO Shuck & Share Contact Us WHAT’S NEW! DONATE NEWSLETTER Connect with Conservationists Have a question for the Restore Our Shores team? Email restoreourshores@brevardzoo.org . Restore Our Shores is one of the many conservation projects at Brevard Zoo . You can read more about the Zoo’s conservation efforts here . Ashley Rearden Director of Conservation arearden@brevardzoo.org , ext. 284 Originally from the Midwest, Florida was always a favorite vacation spot where I could soak in sun, enjoy the beaches and watch the wildlife.  I was thrilled when a position opened at Brevard Zoo that would allow me to use my previous work experience, directing education and operation teams, to help manage the Zoo’s Restore Our Shores program.  Over time my position here has expanded to include overseeing all aspects of the conservation team, giving me the opportunity to use my experience to guide a very passionate group of individuals toward meaningful conservation action.  I really enjoy spending my time focused on making positive change in our community and in my free time I love being able to experience all that Florida has to offer with my family. Tyler Provoncha Conservation Manager (Contact Tyler for Oyster Reef Project Designs and Permitting) tprovoncha@brevardzoo.org , ext. 464 Born and raised in Brevard County, I have always enjoyed kayaking and exploring the lagoon. This passion for being outside and my desire to understand how to preserve the natural beauty around me led me to pursue an Environmental Science degree at Florida Tech. During my time there I worked with muck, oxygen dynamics, and other abiotic factors and how they relate to lagoon restoration. I am proud to use that knowledge to help our conservation team, as well as to direct our permitting and monitoring efforts. When I’m not in the field, I enjoy gardening or visiting parks and trails around Florida. Maggie Rice Conservation Office Administrator (Contact Maggie for any questions regarding our volunteer program, to schedule a group volunteer event, request an outreach speaker, or for general inquiries about Restore Our Shores.) maggier@brevardzoo.org , ext. 381 Hi, I’m Maggie! As a lifelong resident of Melbourne, I grew up on the Space Coast, where I spent a lot of time on the water, whether it was on the beach or kayaking through the Indian River Lagoon. This nurtured a profound appreciation for Florida’s natural beauty and resources. With a passion for marine life, I still enjoy spending time in the water whenever I can. In my spare time, I love to paint, watch movies, and love all things football (SKOL Vikings!). I have a diverse career background including experiences at Walt Disney World, nursing homes, and teaching in the classroom. I am thrilled to be part of the Restore Our Shores team, and I am so excited to be making a positive impact both in the office and in the field whenever I can! Hope Leonard Conservation Restoration Coordinator hleonard@brevardzoo.org , ext. 1012 Growing up in Melbourne, FL I was always outside; whether I was at the beach, on a spoil island or playing soccer, I have always loved being out in the Florida sun. As a kid I was fascinated watching Jeff Corwin and Steve Irwin on animal planet; my love for animals only grew when my dad brought me on a turtle walk for my eighth birthday. Every summer of my childhood was spent either at Brevard Zoo Camp or hiking up in Idaho with my grandmother. These experiences made choosing my undergraduate degree simple: zoology. During my time at the University of Florida, I took a specialty class in sea turtle biology which inspired me skipping my college graduation to move to Greece and accept a job in loggerhead sea turtle conservation. While I was there, I was convinced by some of my colleagues to pursue a masters in Global Ecology & Conservation based out of Cardiff, Wales, UK. When covid hit I felt the lagoon calling me home, so I finished my masters and pursued a position in Brevard. I am so happy to now be a part of the Restore Our Shores team and am ecstatic that I now get to work to make my home a better place for generations to come. Vonn Schneider Conservation Restoration Coordinator (Contact Vonn for questions regarding seagrass and clam restoration projects) kschneider@brevardzoo.org ,  ext 492 Hello!  I’m Vonn and I oversee the seagrass and clam projects.  As a Space Coast Native, I have always been around water. From playing with snails at the sandbars of the Indian River Lagoon to jumping off waterfalls in North Carolina, I naturally bond with all bodies of water. Growing up in Satellite Beach, I have developed a special bond with the Indian River Lagoon. I am an avid catch-and-release angler and have spent many hours on the water enjoying the beauty of our areas precious resource. Having received my Bachelor’s Degree in General Biology and Master’s Degree in Biotechnology from Florida Institute of Technology, I have followed in both my parents’ footsteps of becoming a Panther Alumni. Specializing in plant physiology, I have gained three years research experience studying kin recognition in Arbidopsis thaliana seedlings contributing to multiple peer-reviewed journals. I am excited to start my conservation career by joining the Restore Our Shores team. Victoria Wilcock Conservation Restoration Coordinator (Contact Victoria for questions regarding the oyster gardening program as well as Florida native buffer zone projects) vwilcock@brevardzoo.org , ext 376 Hi, I’m Tori! I am a Conservation Restoration Coordinator for Restore Our Shores and I am responsible for the Oyster Gardening program and the Buffer Zone Project. You may also see me out doing outreach, workshops, and other events sharing my experience and passion for Conservation and all the projects that we do. Originally from the UK, I have travelled the world working and volunteering in several different careers which have given me the transferable skills, experience, and amazing opportunity to live and work in this beautiful county I now call home and doing a career I have always dreamed of.  I am incredibly grateful for the team, volunteers and community that I get to spend each day with, as well as this unbelievable opportunity to give back to nature and be a part of Restoring Our Shores. Hosanna Owen Conservation Restoration Coordinator (Contact Hosanna for information on our Shuck and Share program and potential partnerships) hgattle@brevardzoo.org , ext. 601 Hi, I’m Hosanna! Being a Brevard County native, I have enjoyed being outside and in the environment, especially with the Indian River Lagoon and local beaches so close by. My love of the environment was largely influenced by the Brevard Zoo, as I attended camps, zoo events, and had the opportunity to be a Zoo Teen during middle school and high school and intern in college. This led me to pursue a degree in Environmental Science at Nova Southeastern University. Throughout my schooling, my love for the environment only grew through fieldwork and volunteering. I am extremely passionate about the environmental restoration occurring throughout this county and beyond! I am so excited about the opportunity to be a part of this amazing team. When I am not working, I enjoy going to the beach, exploring natural areas, and learning more about Florida’s environment! Jenny Hansen Conservation Research Coordinator jhansen@brevardzoo.org Growing up in California and visiting the beach in the summer, I have always loved the water. I attended the University of California, Santa Barbara to pursue a degree in Aquatic Biology and became fascinated with how organisms interact with their fluid environment. This led me to specialize in biological oceanography, studying wave dynamics in seagrass meadows to obtain my PhD from the University of Virginia. An opportunity to build a life in Florida with our young family became available and we jumped at it. I have become passionate about preserving and restoring the Indian River Lagoon through my position managing oyster and seagrass restoration projects with the Brevard County Natural Resources Management Department. Now I am so excited to be working with the Brevard Zoo and this amazing team of restoration practitioners! Yagen Gutierrez Conservation Specialist ygutierrez@brevardzoo.org Hi, I’m Yagen! I was born in Cuba and migrated to the United States (Miami) when I was 7. I have always loved the ocean and exploring the outdoors.  Like many kids, my dream was to be a dolphin trainer.  However, I immediately changed my mind when I started working with manatees and sea turtles doing rescue and rehabilitation while doing my undergraduate.  I have a Masters Degree from NOVA Southeastern University in Marine and Coastal Studies.  Over the course of my career, I’ve developed extensive international experience and exposure which has enabled me to connect people from multiple backgrounds with conservation and educational efforts.  I joined Brevard Zoo as we become more involved with our local populations of manatees and the efforts to stabilize the species.  I have also been working very close with the Restore our Shores team and all their efforts.  I’m the happiest when I’m surrounded by other planet lovers like myself and everybody at the Zoo is just that! In my free time I enjoy camping with my family in our travel trailer, I’m the leader of my daughters Girl Scout Troop, race in endurance events (triathlons & ultra marathons) and I am section backpacking the Appalachian Trail and any other trail I can run off to! Liam Corcoran Field Technician (Construction) lcorcoran@brevardzoo.org Hi, I’m Liam. Born and raised in Northern Virginia, I moved to Melbourne to study Marine Biology at the Florida Institute of Technology. After moving to the area, I quickly fell in love with the Indian River Lagoon and the surrounding wildlife. Growing up, I spent my free time learning about and exploring my local forests, streams, and ponds. I still take that wonder into my daily life, I enjoy camping, hiking, and spending time in the water. My passion for the water doesn’t stop in the field, I am an avid aquarist with a mix of freshwater and marine aquariums. Now, working in conservation to protect our local ecosystems, things have come full circle. Madeline Padgett Field Technician mpadgett@brevardzoo.org Hi, I’m Madeline! I am originally from Tennessee, which is where I first fell in love with nature and the outdoors from a very young age. This love led me to pursue a Bachelor’s degree in Environmental Science/Ecology from Lee University, where I was involved in research projects involving brook trout and hellbenders. After graduating, I went on to be a marine conservation intern with a group called A Rocha, spending six months in the Titusville area and then three months in Austin, Texas. While in Florida, I had the opportunity to volunteer with Restore Our Shores and immediately knew that this was a group I wanted to work with. It felt like this was a group that was really making a difference for the Indian River Lagoon. Luckily when I moved back to the area, they had an opening and now here I am! I’m very excited to see where this position takes me. Skyler Meyer Field Technician smeyer@brevardzoo.org Having grown up fishing, hiking and camping I have always had a lot of love and admiration for the environment. Our oceans and connecting waterways though have always been particularly special to me. This led me to pursue a degree in Marine Science from Eckerd College, where I was also fortunate enough to intern in the independent fisheries monitoring division at the FWC research institute during my senior year. After graduation I spent a year with Volusia County’s habitat conservation team and now, I am here with our fantastic team at Restore our Shores. I am thrilled to be a part of this team and look forward to making the waterways that I personally use and love a better and healthier environment for years to come. Restore Our Shores is a program of Brevard Zoo © 2025"
    },
    {
      "url": "https://brevardzoo.org/conservation/conservation-programs/support/",
      "text": "Support - Brevard Zoo East Coast Zoological Foundation Sea Turtle Healing Center Future Aquarium Venues Tickets Membership Donate Tickets Membership Donate Visit Membership Adventures Tips for a Great Visit Food and Drink Accessibility Groups Upcoming Events Events Upcoming Events Host an Event Support Our Partners Corporate Engagement Jaguar Society Planned Giving Celebration and Remembrance Matching Gifts Volunteer Programs Internships Learn Schools Early Childhood Camps Adult Programs Family Programs Teen Volunteers Homeschool Groups Conservation Sustainability Conservation Programs Conservation Partners Restore Our Shores Quarters for Conservation Grant Opportunities About Mission Animal Wellness News East Coast Zoological Foundation Sea Turtle Healing Center Future Aquarium Venues Shop Support Brevard Zoo's Mission \"We Share Our Joy of Nature to Help Wildlife and People Thrive\" Volunteer for Conservation We highly encourage the community to participate in our local conservation projects! If you would like to get involved, please email the appropriate contact below. Restore Our Shores : restoreourshores@brevardzoo.org Florida scrub-jays : ARearden@BrevardZoo.org FrogWatch USA : Brianna Forte at bforte@brevardzoo.org Perdido key beach mice : ARearden@BrevardZoo.org Pollinators : ARearden@BrevardZoo.org Quarters for Conservation Sea Turtle Healing Center Conservation Partners Sustainability Support Restore Our Shores Conservation Report Get Conservation e-News! Stay updated with news on current and upcoming conservation programs. Media FAQs Accessibility Careers Volunteering Contact Us 8225 North Wickham Road, Melbourne, FL 32940 321.254.9453 ©2025 East Coast Zoological Foundation, All Photos ©East Coast Zoological Foundation and affiliates, unless otherwise noted. Accredited by the Association of Zoos and Aquariums View Terms & Privacy Policy Tickets Membership Donate Visit Membership Adventures Tips for a Great Visit Food and Drink Accessibility Groups Upcoming Events Back Events Upcoming Events Host an Event Back Support Our Partners Corporate Engagement Jaguar Society Planned Giving Celebration and Remembrance Matching Gifts Volunteer Programs Internships Back Learn Schools Early Childhood Camps Adult Programs Family Programs Teen Volunteers Homeschool Groups Back Conservation Sustainability Conservation Programs Conservation Partners Restore Our Shores Quarters for Conservation Grant Opportunities Back About Mission Animal Wellness Back News East Coast Zoological Foundation Sea Turtle Healing Center Future Aquarium Venues Shop × Close Panel"
    },
    {
      "url": "https://www.buildingourzoo.com/contact-vzds/",
      "text": "Valley Zoo Development Society | Contact VZDS DONATE NEWSLETTER PRESS LIVESTREAM BLOG ZOO NEWSLETTER PRESS LIVESTREAM BLOG ZOO ABOUT PROJECTS SUPPORT EVENTS CAFE SHOP THE VZDS Mandate History Board of Directors Join the Board Contact Us Edmonton VALLEY ZOO About Zoo-tique Zoo Focus The Wild Times CURRENT REVITALIZATION PROJECTS Current Projects Overview Aspen Restoration Project Carnivore Modernization Project Red Panda Yard PAST REVITALIZATION PROJECTS Arctic Wolf Habitat Project Arctic Wolf Habitat Project Northern Leopard Frog Project Conservation Carousel Project NWB Phase 1 Arctic Shores Entry & Wander CONSERVATION PROJECTS Lucy’s Legacy Painting for Conservation Northern Leopard Frog Project Species Survival Program Red Panda Network Makira Conservation Arctic Programs Partner Organizations EDUCATION Education Conservation Video Series Pay It Forward For The Planet Subsidy Program REVITALIZATION SUPPORT Adopt An Exhibit “Leaf” A Legacy Lucy’s Legacy Monthly Donorship Multi-Year Pledge ZooBuilder Program HOST A FUNDRAISER At Your Store At School Community Groups Corporate Events Celebrations SPONSOR + ADOPT Adopt An Animal Adopt An Exhibit Sponsor An Event MORE WAYS… Memorial Giving Donate A Car Planned Giving EVENTS Zoominescence AAA Parent Tea Party ZooBrew Spilling The Beans ADOPT Adopt An Animal Adopt An Exhibit ART Harbour Seal Art Local Artists Lucy Elephant Art Reproductions Lucy Elephant Kiss Reproductions BABY Crinkle Toys BOOKS Books Coloring + Activity CLOTHING Hats Adult Face Masks Kid’s Face Masks DONATIONS “Leaf” A Legacy ZooBuilder EVZ EXCLUSIVES Bottles + Mugs Home + Gift EVZ Magnets GAMES & PUZZLES Board + Card Puzzles PLUSH Wild Republic Artist Series Plush Audobon Birds Ecokins EVZ Custom Plush Huggers Hanging Large Plush 12″ – 30″ Small Plush 3″ – 11″ Snakesss Wild Calls Wildlife Artists Conservation Critters Eco Pals Finger Puppets PLUSH CONT… Aurora Flopsie Douglas Company Douglas Plush Fiesta Toy Plush + Beanies JEWELRY Jewelry TOYS Toys SPECIALS Seasonal CLEARANCE Clearance Shop CONTACT US CONTACT VZDS There are so many ways to get in touch with us: Give us a call, stop by the Zoo-tique on your next trip to the Edmonton Valley Zoo, get a hold of us on social media, drop us an email, or send us a letter. No matter how you choose to contact us, we’d love to hear from you… Follow Follow Follow CONTACT VZDS Box 2359 Edmonton, Alberta T5J 2R7 P | 780.496.6924 F | 780.944.7529 E | vzds@buildingourzoo.com CONTACT ZOO-TIQUE 13315 Buena Vista Road Edmonton, Alberta T5R 5R1 P | 780.496.6924 F | 780.944.7529 E | zoostore@buildingourzoo.com YOUR MESSAGE Δ HELP BUILD OUR ZOO! It is through today’s zoos that future generations will come to a greater understanding of the human impact on the natural world and be motivated to preserve it and reverse the damage already done. Every donation, big or small, helps us revitalize our beloved Edmonton Valley Zoo! Thank you for caring for the animals, our children’s future and the planet! DONATE! JOB OPPORTUNITIES DONATION REQUESTS VOLUNTEER WISHLIST PRIVACY POLICY RETURN & REFUND POLICY CONTACT Copyright ©September 10, 2025 | VZDS"
    },
    {
      "url": "https://www.zoo.org.au/about-us/contact-us/",
      "text": "Contact us | Zoos Victoria Close Zoos Victoria acknowledges and respects the Traditional Owners as the original custodians of the land and waters, their ability to care for Country, and deep spiritual connection to it. We honour Elders past and present whose knowledge and wisdom has ensured the continuation of culture and traditional practices. Proceed to Website Skip to main content Visit Our Zoos Accessibility Language English Arabic Cantonese Mandarin Hindi French Italian Korean Spanish Portuguese German Punjabi Vietnamese Log in Menu Buy Tickets Membership Visit Our Zoos Back Visit Our Zoos Australian Bushland Kyabram Fauna Park Melbourne Werribee Donate Back Donate Donate Today Animal Adopters Future Hands Fellowship Endowment Fund Fundraise for wildlife Our supporters Conservation Partners Online Shop Back Online Shop Gift Membership Online Shop Gift cards Premium Gifts & Experiences Education Back Education Excursion Programs Teacher PD Plan your visit Youth Programs Tertiary Fighting Extinction Schools Adult Training Teaching Resources Fighting Extinction Back Fighting Extinction Local threatened species Community Conservation Campaigns Global Partnerships Sustainability Research and publications About Us Back About Us Sponsors and partners Governance, policies & procurement Careers Volunteer Youth Advisory Committee Contact us Login Contact Us Tickets & Bookings 1300 966 784 Search Close Buy Tickets Which of our Zoos would you like to purchase tickets for? Psst! Become a zoo member for just $12.45/month over 12 months to enjoy unlimited entry to our zoos! Become a Member Contact us Before getting in touch with us, check out our latest FAQs in case your question has already been answered: Read our FAQs Emergency help for wildlife Couldn't find an answer? Get in touch with us: Phone: 1300 966 784 Email: contact@zoo.org.au Note: we are experiencing an extremely high volume of calls and emails at the moment so the phone wait time and email response time may be lengthy. We apologise for any inconvenience this causes. Are you a journalist? Please visit our media enquiries page >> Write to us: Zoos Victoria Wurundjeri Country PO Box 74 Parkville, Victoria 3052 Australia Visit us: Glen Eadie Avenue Healesville, Victoria 3777 Wurundjeri Country Open 9am-5pm daily 75 Lake Rd Kyabram, Victoria 3620 Yorta Yorta Country Open 10am-5pm daily except Christmas day Elliott Avenue Parkville, Victoria 3052 Wurundjeri Country Open 9am-5pm daily K Road Werribee, Victoria 3030 Bunurong and Wadawurrung Country Open 9am-5pm daily (last entry at 3.30pm) Have feedback about your visit? Fill out the form below: Name Email What zoo did you visit? Melbourne Zoo Werribee Open Range Zoo Healesville Sanctuary Kyabram Fauna Park Enter your feedback Back to top Tickets & Bookings 1300 966 784 Contact Us Login Zoo Shop Emergency Wildlife Help / Privacy & Legal / Accessibility Digital agency - Calico © Zoos Victoria"
    },
    {
      "url": "https://brevardzoo.org/visit/discounts/",
      "text": "Discounts - Brevard Zoo East Coast Zoological Foundation Sea Turtle Healing Center Future Aquarium Venues Tickets Membership Donate Tickets Membership Donate Visit Membership Adventures Tips for a Great Visit Food and Drink Accessibility Groups Upcoming Events Events Upcoming Events Host an Event Support Our Partners Corporate Engagement Jaguar Society Planned Giving Celebration and Remembrance Matching Gifts Volunteer Programs Internships Learn Schools Early Childhood Camps Adult Programs Family Programs Teen Volunteers Homeschool Groups Conservation Sustainability Conservation Programs Conservation Partners Restore Our Shores Quarters for Conservation Grant Opportunities About Mission Animal Wellness News East Coast Zoological Foundation Sea Turtle Healing Center Future Aquarium Venues Shop Daily Admission Discounts Admission must be purchased at the Zoo to receive these discounts. AZA Reciprocal Admission Receive 50% off General Admission when you show your Member card and ID(s). All named adults must show ID. Offer applies to those the membership covers only (guest options do not apply). Visit the main service window upon arrival for purchase. Please note that the number of reciprocal admissions may vary. We recommend calling ahead before visiting a participating zoo or aquarium to confirm their participation and check for any restrictions or disclaimers. View participating AZA organizations. Florida SNAP EBT or WIC Discount If you have a Florida SNAP EBT or WIC card with a valid state-issued ID matching the name and state as on the card, we offer the following discount: Take 50% off general Zoo admission for yourself and up to six dependents under age 18. This offer is available onsite only. Tickets must be purchased in person. The discount for general admission is for daytime only and may not be applicable with any other offer, discount or for any events or programs. State-issued photo ID must be from the same state the EBT or WIC card was issued. Cardholder’s name must be printed on the EBT or WIC card and on the state-issued photo ID. This offer valid only for Florida residents. Military Discount Current military and veterans (including any spouse or dependents) will receive $5 off onsite admission to Brevard Zoo. Proof of military service is required. Accepted methods of identification include a United States Uniformed Services Privilege and Identification Card (active/reserve/retired), current Leave and Earnings Statement, DD 214, veteran ID, uniform or photograph in uniform. Group Rates Get ready for a wild adventure with our zoo group packages! Groups of 15 or more people are eligible for a general admission discount, plus exclusive perks. Visit the groups page for more information. Questions about our discounts? Please email deptguestservices@brevardzoo.org or call 321-254-9453×0. Media FAQs Accessibility Careers Volunteering Contact Us 8225 North Wickham Road, Melbourne, FL 32940 321.254.9453 ©2025 East Coast Zoological Foundation, All Photos ©East Coast Zoological Foundation and affiliates, unless otherwise noted. Accredited by the Association of Zoos and Aquariums View Terms & Privacy Policy Tickets Membership Donate Visit Membership Adventures Tips for a Great Visit Food and Drink Accessibility Groups Upcoming Events Back Events Upcoming Events Host an Event Back Support Our Partners Corporate Engagement Jaguar Society Planned Giving Celebration and Remembrance Matching Gifts Volunteer Programs Internships Back Learn Schools Early Childhood Camps Adult Programs Family Programs Teen Volunteers Homeschool Groups Back Conservation Sustainability Conservation Programs Conservation Partners Restore Our Shores Quarters for Conservation Grant Opportunities Back About Mission Animal Wellness Back News East Coast Zoological Foundation Sea Turtle Healing Center Future Aquarium Venues Shop × Close Panel"
    },
    {
      "url": "https://southwickszoo.com/contact-us/",
      "text": "Contact Us | Southwick's Zoo 1-800-258-9182 Visitor Info Plan Your Visit Information & Tickets Guest Services Safety Rules & FAQs Our Animals Dining & Gift Shops Field Trips Kids Birthday Parties Things to Do Rides & Attractions Shows & Keeper Talks Animal Encounters Giraffe Encounters Rhino Encounters Sloth Encounters Zoo Events Zoo Events The Great Jack O’Lantern Journey Host a Private Event Weddings, Corporate Outings, and more! Kids Birthday Parties EARTH Ltd & Education What is EARTH Ltd? Learn about EARTH Ltd Memberships ZooMobile Program Junior Zookeeping Wild Adventure Programs Spring Wild Adventure Programs Summer Wild Adventure Programs Additional Resources Girl Scouts SNE Contact Us Employment Employment Internships Volunteers/Docent Program Donation Requests Memorial Benches and Picnic Tables Tickets & Visitor Information Select Page Contact Us We would love to hear from you! Please fill out the form below and we will get in touch with you as soon as we can. Looking for information about zoo rules and answers to common questions? Visitor & Admission Information Safety Rules & Frequently Asked Questions Note regarding donation requests: Please be aware that, due to the high volume of requests we receive, we cannot fulfill fundraiser donation requests sent electronically (email, the contact form below,or social media) . All donation requests must be mailed to the zoo along with a self addressed stamped envelope. Please click here for donation request guidelines. Name * First Last Email * Enter Email Confirm Email Phone * What department would you like to send your message to? * Guest Services Admissions Questions Animal Related Questions Birthday Parties Comments EARTH Limited EARTH Memberships Education Programs Employment Event Planning Field Trips and Group Sales Food/Beverage/Concessions Galliford's Restaurant & Tavern General Questions Gift Shops Internships/Docent Program Marketing/Advertising Rides Zoomobile Program or Educational Outreach Donation Requests:  Please be aware that, due to the high volume of requests we receive, we cannot fulfill fundraiser donation requests sent electronically. All donation requests must be mailed to the zoo along with a self addressed stamped envelope. Please visit www.southwickszoo.com/donation-requests/ for donation request guidelines. How Can We Help You? Would you like to sign up to receive our monthly e-newsletter? Yes No Comments This field is for validation purposes and should be left unchanged. Zoo Information Line: 1-800-258-9182 Guest Services 1-800-258-9182 x 211 Group Sales: 1-800-258-9182 x 501 Lost & Found: 1-800-258-9182 x 211 Birthday Parties: 1-800-258-9182 x 312 Event Planning, Corporate Outings: 1-800-258-9182 x 213 EARTH Ltd- Betsey Brewer: 1-800-258-9182 ZooMobiles: 1-800-258-9182 x 208 Education Programs & Internships: 1-800-258-9182 x 208 Food & Beverage Department (Allergy questions): 1-800-258-9182 x 205 Zoo Veterinarian: Dr. Samantha King 1-800-258-9182 x 210 Purple Peacock Gift Shop: 1-800-258-9182 x 203 Marketing / Advertising: 1-800-258-9182 x 212 So much to see and do at Southwick’s Zoo! Located in the heart of the Blackstone River Valley, just minutes away from Routes 495 and 146, Southwick’s Zoo offers a full day of family fun! See what’s new at New England’s Largest Zoo. We are open every day, rain or shine, from 10 AM – 5 PM including holidays. We hope to see you soon! Helpful Links Purchase Tickets Zoo Map Upcoming Events Rides & Attractions Shows & Keeper Talks Contact Us 1-800-258-9182 Send us an Email 2 Southwick Street Mendon, MA. 01756 Copyright © Southwick's Zoo 2025 | All rights reserved Follow Follow"
    },
    {
      "url": "https://brevardzoo.org/careers/",
      "text": "Careers - Brevard Zoo East Coast Zoological Foundation Sea Turtle Healing Center Future Aquarium Venues Tickets Membership Donate Tickets Membership Donate Visit Membership Adventures Tips for a Great Visit Food and Drink Accessibility Groups Upcoming Events Events Upcoming Events Host an Event Support Our Partners Corporate Engagement Jaguar Society Planned Giving Celebration and Remembrance Matching Gifts Volunteer Programs Internships Learn Schools Early Childhood Camps Adult Programs Family Programs Teen Volunteers Homeschool Groups Conservation Sustainability Conservation Programs Conservation Partners Restore Our Shores Quarters for Conservation Grant Opportunities About Mission Animal Wellness News East Coast Zoological Foundation Sea Turtle Healing Center Future Aquarium Venues Shop Careers CURRENT JOB OPENINGS Guest Services: To apply, send a cover letter and resume to jbrown@brevardzoo.org . Closing date is Thursday, September 11, 2025 at 5:00 PM. Events Flipper: To apply, send a resume and cover letter to ebrummer@brevardzoo.org . Closing date is Friday, September 19, 2025 at 5:00 PM. We are always accepting applications for Adventure Services Guide. HOW TO APPLY Please send resume and cover letter to HR@brevardzoo.org or the Hiring Manager email indicated in the posting instructions. INTERNSHIPS PAID INTERNSHIPS Lagoon Quest Intern Description Application UNPAID INTERNSHIPS Click here for information regarding our unpaid internship program. About Us Careers Media Ticket Donation Requests FAQs Terms of Usage Contact Us Media FAQs Accessibility Careers Volunteering Contact Us 8225 North Wickham Road, Melbourne, FL 32940 321.254.9453 ©2025 East Coast Zoological Foundation, All Photos ©East Coast Zoological Foundation and affiliates, unless otherwise noted. Accredited by the Association of Zoos and Aquariums View Terms & Privacy Policy Tickets Membership Donate Visit Membership Adventures Tips for a Great Visit Food and Drink Accessibility Groups Upcoming Events Back Events Upcoming Events Host an Event Back Support Our Partners Corporate Engagement Jaguar Society Planned Giving Celebration and Remembrance Matching Gifts Volunteer Programs Internships Back Learn Schools Early Childhood Camps Adult Programs Family Programs Teen Volunteers Homeschool Groups Back Conservation Sustainability Conservation Programs Conservation Partners Restore Our Shores Quarters for Conservation Grant Opportunities Back About Mission Animal Wellness Back News East Coast Zoological Foundation Sea Turtle Healing Center Future Aquarium Venues Shop × Close Panel"
    },
    {
      "url": "https://treetoptrek.com/",
      "text": "Home - Treetop Trek Skip to main content East Coast Zoological Foundation Brevard Zoo Sea Turtle Healing Center Future Aquarium Venues Hit enter to search or ESC to close Close Search Menu Tickets Waivers Adult Waiver (18+) Minor Waiver ZIP INTO NEW ADVENTURES! Treetop Trek is now part of Brevard Zoo’s experience and requires Zoo admission. We’ve revamped the courses, making them shorter, more exciting, and more affordable. Take your adventure to new heights with a Treetop Trek and Brevard Zoo combo ticket! Enjoy discounted access to both the Zoo and thrilling zipline courses, all in one unforgettable experience. Check out the different combos below! ZIP IT + CANOPY WALK + ZOO (BEST VALUE) Open daily from 9:30 AM to 3:00 PM Experience the Rainforest Revealed like never before with our Canopy Walk, an easy-paced, self-guided adventure that offers a unique perspective from high in the trees. Ascend via staircase and encounter 20 elements while spotting monkeys, jaguars, giant otters, and more. For an added thrill, try our new Zip It course, where you’ll zip over the scenic Wetlands on a 650’ line, reaching speeds of 15 to 20 miles per hour, before ascending above the treetops and zipping back on an 800’ line for another exhilarating ride. Includes Zoo admission. Save $15. More Canopy Walk Details More Zip It Details $57.95/Adult | $52.95/Senior | $46.95/Child BOOK NOW MEMBERS ZIP IT + ZOO Open daily from 9:30 AM to 3:00 PM Zip It offers an exhilarating experience with a 650-foot zip line across the Wetlands, reaching speeds of 15 to 20 mph, followed by an 800-foot return zip line at similar speeds. This course takes about 30 to 45 minutes to complete, providing breathtaking views of the surrounding natural beauty along the way. Includes Zoo admission. Save $8. More Zip It Details $39.95/Adult | $34.95/Senior | $28.95/Child BOOK NOW MEMBER CANOPY WALK + ZOO Open daily from 9:30 AM to 3 PM See animals from a whole new perspective, up in the trees! Canopy Walk is an easy-paced, self-guided outdoor adventure that takes you over a section of our Rainforest Revealed. Ascend into the trees by a staircase and experience 20 elements all while seeing monkeys, jaguar, giant otters and more. Includes Zoo admission. Save $8. More Canopy Walk Details $49.95/Adult | $44.95/Senior | $38.95/Child BOOK NOW MEMBERS CHALLENGE + ZOO Open Monday - Friday with times at 9:45 AM and 1:45 PM Open on Saturday & Sunday from 9:30 AM - 3:00 PM. Guests will navigate a Challenge Reloaded course with 5 zips and 17 elements, including a 70′ high zip line over wetlands, concluding with an 800′ zip line return. Includes Zoo admission. Save $15. More Challenge Details $52.95/Adult | $47.95/Senior | $41.95/Child. BOOK NOW MEMBERS All CHUTES + ZOO Open daily at 10:15 AM & 2:45 PM Chutes and Ladders is a fun, family-friendly adventure course featuring 22 elements and 2 zip lines. This course takes 30 to 45 minutes to complete and is designed especially for kids, offering just the right mix of challenge and excitement. Includes Zoo admission. Save $5. More Chutes Details $41.95/Child (Ages 3-11) | $52.90/Youth (ages 12+) BOOK NOW MEMBERS BE SURE TO BRING CLOSED TOE & HEEL SHOES COMFORTABLE CLOTHES REFILLABLE WATER BOTTLE THINGS TO KNOW Waiver & Age Requirements All guests under the age of 18 must have a waiver signed by parent or natural guardian before going on the course. As required by Florida Statute 744.301, only a Natural Guardian (natural or adoptive parent) may sign a waiver for anyone under 18 years of age to participate on any Treetop Trek course. No other signature is permitted under the statute. Physical Requirements A minimum 67″ vertical reach, harness max 250lbs with 48″ waist & max 26″ leg openings. Guests that are pregnant or have underlying health conditions that can put them in danger are strictly prohibited from participating. Weather Requirements Storms with lightning happen regularly in Florida. For the safety of our guests, Treetop Trek stops all course activities when lightning is present. We are required to wait 30 minutes after lightning leaves the area before resuming activities. No refunds will be issued once a guest clears the orientation area, for weather or for failure to follow course and safety regulations. GROUP ADVENTURES Have a group of 15 or more and seeking a thrilling and unique bonding experience? Treetop Trek is the perfect choice! We offer three different courses designed to foster bonds that will extend beyond that final zip. Book an adventure for your next team outing, special event, or family reunion! Contact 321-254-9453 ext. 490 or e-mail egracie@brevardzoo.org for more info. Please note, group reservations must be placed a minimum of three weeks in advance. Safety Standards FAQ 8225 North Wickham Road, Melbourne, FL 32940 ©2024 East Coast Zoological Foundation., All Photos ©East Coast Zoological Foundation and affiliates, unless otherwise noted. Accredited by the Association of Zoos and Aquariums View Terms & Privacy Policy Close Menu Tickets Waivers Adult Waiver (18+) Minor Waiver"
    },
    {
      "url": "https://brevardzoo.org/volunteer-programs/",
      "text": "Volunteer Opportunities | Brevard Zoo East Coast Zoological Foundation Sea Turtle Healing Center Future Aquarium Venues Tickets Membership Donate Tickets Membership Donate Visit Membership Adventures Tips for a Great Visit Food and Drink Accessibility Groups Upcoming Events Events Upcoming Events Host an Event Support Our Partners Corporate Engagement Jaguar Society Planned Giving Celebration and Remembrance Matching Gifts Volunteer Programs Internships Learn Schools Early Childhood Camps Adult Programs Family Programs Teen Volunteers Homeschool Groups Conservation Sustainability Conservation Programs Conservation Partners Restore Our Shores Quarters for Conservation Grant Opportunities About Mission Animal Wellness News East Coast Zoological Foundation Sea Turtle Healing Center Future Aquarium Venues Shop Volunteer Programs VOLUNTEER LOGIN E-LEARNING LOGIN As a community Zoo, we encourage public involvement in all aspects of our operations. We are dependent upon and very grateful to our volunteers, who assist with everything from special events to educational programs. CURRENT OPENINGS There’s a lot to do at the Zoo! Would you like to be a kayak guide or an animal interpreter? Click here to take a look at all of the opportunities available to volunteers. The next Volunteer Applicant Orientation will be on Saturday, February 14, 2026, from 9 AM – 12 PM. The Orientation is followed by a scheduled interview and then a mandatory class on Saturday, February 28, 2026 from 9 AM – 3 PM for all volunteers accepted into the program. HOW TO APPLY TO THE ADULT VOLUNTEER PROGRAM Applicants to the adult volunteer program (16 years of age or older) are required to: Submit an online application . If you have any further questions, please read our FAQs or contact us at voladmin@brevardzoo.org or 321.254.9453 x218 . TEENS 13–16 CAN VOLUNTEER, TOO! Click here for information about our Zoo Teen program. GROUP VOLUNTEER OPPORTUNITIES To sign up your group for a Restore Our Shores volunteer opportunity, please fill out this form and return it to restoreourshores@brevardzoo.org . Participants must be 14 years of age or older. Most groups should not exceed 15 participants. Large groups can be accommodated at offsite locations with enough notice. VOLUNTEER PROGRAMS ZOO TEEN PROGRAMS INTERNSHIPS e-LEARNING ACADEMY APPLICATIONS Media FAQs Accessibility Careers Volunteering Contact Us 8225 North Wickham Road, Melbourne, FL 32940 321.254.9453 ©2025 East Coast Zoological Foundation, All Photos ©East Coast Zoological Foundation and affiliates, unless otherwise noted. Accredited by the Association of Zoos and Aquariums View Terms & Privacy Policy Tickets Membership Donate Visit Membership Adventures Tips for a Great Visit Food and Drink Accessibility Groups Upcoming Events Back Events Upcoming Events Host an Event Back Support Our Partners Corporate Engagement Jaguar Society Planned Giving Celebration and Remembrance Matching Gifts Volunteer Programs Internships Back Learn Schools Early Childhood Camps Adult Programs Family Programs Teen Volunteers Homeschool Groups Back Conservation Sustainability Conservation Programs Conservation Partners Restore Our Shores Quarters for Conservation Grant Opportunities Back About Mission Animal Wellness Back News East Coast Zoological Foundation Sea Turtle Healing Center Future Aquarium Venues Shop × Close Panel"
    },
    {
      "url": "https://brevardzoo.org/faqs/",
      "text": "FAQs | Brevard Zoo East Coast Zoological Foundation Sea Turtle Healing Center Future Aquarium Venues Tickets Membership Donate Tickets Membership Donate Visit Membership Adventures Tips for a Great Visit Food and Drink Accessibility Groups Upcoming Events Events Upcoming Events Host an Event Support Our Partners Corporate Engagement Jaguar Society Planned Giving Celebration and Remembrance Matching Gifts Volunteer Programs Internships Learn Schools Early Childhood Camps Adult Programs Family Programs Teen Volunteers Homeschool Groups Conservation Sustainability Conservation Programs Conservation Partners Restore Our Shores Quarters for Conservation Grant Opportunities About Mission Animal Wellness News East Coast Zoological Foundation Sea Turtle Healing Center Future Aquarium Venues Shop FAQs Phone: 321.254.9453 Fax: 321.259.5966 Mail: Brevard Zoo 8225 North Wickham Road Melbourne, FL 32940 About Us Careers Media Ticket Donation Requests FAQs Terms of Usage Contact Us General Information What are the operating hours? The Zoo is open daily from 9:30 am to 5 pm . Last admission at 3:30 pm. Members can get into the Zoo early at 9 am . See current guidelines. Some sections of the Zoo open late. Paws On and Lands of Change: Australia and Beyond open at 10 am. Sometimes the Zoo closes early for special events. We are closed Thanksgiving and Christmas Day. On rare occasions, the Zoo will close to accommodate large groups. Sign up for our email newsletter or “like” us on Facebook for advance notifications about these closures. What are the current ticket prices? Buy online and save! Click here to see pricing. What special events are planned for this year? Visit our events calendar for upcoming events. We add events throughout the year, so be sure to check back often. What kinds of food does the Zoo serve? We offer several dining options for you and your family to enjoy during your visit to the Zoo. At Nourish 321, indulge in mouth-watering burgers, hearty sandwiches and wholesome salads; these made-to-order items include vegan and vegetarian options, so you’re sure to find something to please your palate. Adjacent to Nourish 321 are kiosks featuring frozen drinks, Dippin’ Dots ice cream, snacks and more. Enjoy fresh pizza and sandwiches at Slice, a walk-up venue overlooking the Indian River Play Lagoon in Paws On. When you’re done splashing around, stop by Cones for soft-serve ice cream, Dole Whip and frozen alcoholic beverages. Not all venues are open every day. Call ahead or visit the administrative office for more information. Outside food is not permitted in the Zoo, but you may use the picnic tables outside the main entrance. Where can I get a map of the Zoo? Click here to view a map of the Zoo. How do I apply for a job at Zoo? We are hiring for positions across several departments. Visit our careers page for more information. What is the mailing address and phone number? Brevard Zoo 8225 N. Wickham Road Melbourne, FL 32940 For general park information, please call 321.254.9453 . Can I sign up to receive Zoo updates? Join our email list for free biweekly newsletters highlighting animal news, special events, discounts and volunteer opportunities. Follow us on Facebook , Twitter and Instagram , too. Park Information Is smoking or vaping permitted in the Zoo? The Zoo is a smoke-free facility. Smoking and vaping are only permitted in the parking lot. Is the Zoo handicap accessible? The Zoo is handicap accessible. Some areas include gentle ramps or tightly compacted substrate. There is an elevated walkway in Rainforest Revealed that is accessible by stairs or electronic lift; we recommend calling prior to your visit to ensure the lift is operational. Do you rent wheelchairs, strollers or ECVs? Strollers, wheelchairs and ECVs are rented on a first-come, first-serve basis and are available at the main entrance. Please see our main service window to purchase your rentals. Wheelchair……………….. …………..$10 Single Stroller…………………. ………$9 Double Stroller…………………. …….$11 Electric Conveyance Vehicle….$27 (ID required) Does the Zoo have automatic tellers (ATMs)? An ATM is located inside the Zoo’s entrance. What happens if I lose something in the Zoo? Found personal property is kept in the Zoo’s administrative office for 24 hours, then discarded. We accept no responsibility whatsoever for items left in the Zoo. What happens if it rains or there is a thunderstorm? The Zoo is open rain or shine and the vast majority of our experiences are outdoors. When lightning is within a ten-mile radius, we initiate a weather hold. This ensures the safety of both our animals, who may need to temporarily move off habitat, and our visitors, as certain activities may need to be temporarily closed. Refunds and rain checks are not offered for inclement weather. What should we do if our party is separated? Arrange a meeting place and time should your party become separated. Feel free to approach any staff member or volunteer for assistance. We are unable to make announcements over a loudspeaker. How do I re-enter the Zoo if I have to leave for some reason? Please see a gift store associate for a hand stamp before leaving and present the stamp upon re-entry. Does the Zoo have a dress code? In keeping with our family-friendly atmosphere, and for health and safety reasons, the Zoo strictly enforces a dress code. Proper attire must be worn in the park at all times, including shirts and appropriate footwear except in the water play area of Paws On. Clothing with rude, vulgar or offensive language or graphics is not permitted at any time. Zoo admission may be denied if clothing is deemed by management to be inappropriate. What is the Zoo's alcoholic beverage policy? Alcoholic beverages may not be brought into the Zoo. Alcoholic beverages purchased in the park may not leave the premises. Excessive consumption of alcohol is cause for ejection from the park without refund. No one under 21 years of age is permitted to consume alcoholic beverages, and proper identification is required to purchase and/or consume alcoholic beverages at the Zoo (one drink per customer at one time). Guests are prohibited from taking beer or wine purchased in the park out through the front gate. Are pets permitted in the Zoo? Pets are not permitted in the Zoo, with the exception of service animals. Service animals must be checked in at the front office. Under Florida statute, animals are not to be kept in vehicles unattended. Pricing & Admission What are the current ticket prices? A variety of ticket packages are available. See Adventures & Packages for information and prices of Zoo packages, activities and other options. What does my general admission ticket include? Your ticket includes admission into the Zoo. Certain experiences, such as animal feedings, kayak tours and train rides, require an additional fee. Does my child need a ticket? Children under three years of age are admitted at no charge. All guests ages three and older require a ticket. Do you offer group discounts? Yes. Groups of 15 or more people are eligible for a general admission discount. Visit the groups page for more information. How much is parking? Parking is always free. Do you sell gift certificates? Gift certificates are not available, but you can purchase tickets and memberships for others through our online store . What forms of payment are accepted? We accept cash as well as Mastercard, Visa, Discover and American Express cards. Checks are not accepted. Do you offer AAA discounts? We do not offer AAA discounts. Do you offer an EBT/WIC discount? If you have a Florida SNAP EBT or WIC card with a valid state-issued ID matching the name and state as on the card, we offer the following discounts: Take 50% off general Zoo admission for yourself and up to six dependents under age 18. This offers is available onsite only. Tickets must be purchased in person. The discount for general admission is for daytime only and may not be applicable with any other offer, discount or for any events or programs. State-issued photo ID must be from the same state the EBT or WIC card was issued. Cardholder’s name must be printed on the EBT or WIC card and on the state-issued photo ID. This offer valid only for Florida residents. Do you offer military discounts? Tickets can be purchased at the Zoo to receive a discount. Reservations will not be required. A $2 surcharge will still apply. Do you offer a travel agent discount? No. However, group rates are available. Do you offer rainchecks? We do not offer refunds or rainchecks for inclement weather. Online Purchases How do I renew my membership online? Click here . After choosing your selected membership, click the Join Now or Renew Now button. If you are renewing, you will need your Member ID number or your email address to complete the process. Will my membership card be mailed to me? No. We know longer have plastic membership cards. To activate your digital membership card, you will need to download the Pass Play Membership App from the Apple App or Google Play stores. Or Click here for the link . If you have any questions, please contact us at cheri@brevardzoo.org . Do tickets have an expiration date? Date-specific tickets are valid only on the specific dates shown. Tickets and memberships without specific dates are valid during the current operating season. What is the refund policy? No refunds or rain checks will be issued due to inclement weather.  If not used on your scheduled day, must be used by the end of the purchase year. The Zoo is an outdoor facility. Please plan your trip to the Zoo accordingly based on the anticipated weather conditions for that day. No refunds will be issued to anyone removed from the Zoo for failure to follow the Rules of the Wild . For questions or concerns about your tickets, please contact Guest Services at 321-254-9453 ext. 489. What if I made a mistake when ordering items from this site? Before you make your final purchase, carefully review your selections. We do not offer refunds for any tickets purchased online or at the gate. Our tickets are non-transferable. Tickets purchased for park special events are only accepted at the gate for the day of the event. How can I contact customer support? If you wish to speak with a customer support agent, please call 321.254.9453 and press 0. Tips for a Great Visit Admission Values The best way to visit the Zoo is often — with a Zoo membership . Available online or at our front gate, get a membership and visit as often as you want for as long as you choose. One-day tickets are also available. Adverse Weather Conditions/Rain The Zoo is open rain or shine, except in the event of a hurricane. Refunds or rainchecks for inclement weather are not offered. Alcoholic Beverage Policy Alcoholic beverages may not be brought onto Zoo property. Attendance/Best Days to Visit The park is less crowded on weekdays, especially Tuesdays and Wednesdays. Automatic Tellers (ATMs) There is one ATM located at the main entrance for your convenience. Credit Cards We accept Mastercard, Visa, Discover and American Express. Currency Exchange We do not offer a currency exchange. Dress Code In keeping with our family-friendly atmosphere, and for health and safety reasons, Brevard Zoo strictly enforces a dress code. Proper attire must be worn in the park at all times, including shirts and appropriate footwear except in the water play area of Paws On. Clothing with rude, vulgar or offensive language or graphics is not permitted at any time. Bathing suits may be worn only in the water park area. Park admission may be denied if clothing is deemed by management to be inappropriate. First Aid We offer first aid at the front office, 321 Nourish and in Paws On. For assistance, ask any staff member. Group Sales Groups of 15 or more people are eligible for a group discount. See Group Rates . Service Animals Pets are not permitted in the park, with the exception of service animals. Service animals must check in at the front office. Under Florida statute, animals cannot be left in vehicles unattended. Recreational Wheels (roller skates, skateboards, etc.) No recreation wheels, including Heelys and other tennis shoe-style roller skates, are permitted in the Zoo. Military Discount Current military and veterans (including any spouse or dependents) will receive $5 off onsite admission to Brevard Zoo.  Proof of military service is required. Accepted methods of identification include a United States Uniformed Services Privilege and Identification Card (active/reserve/retired), current Leave and Earnings Statement, DD 214, veteran ID, uniform or photograph in uniform. Please note: you must purchase tickets onsite to receive the discount. Re-Entering the Park Please see a gift store associate for a hand stamp before leaving and present the stamp upon re-entry. Weapons Policy Firearms and weapons of any kind are not permitted on Zoo grounds. Media FAQs Accessibility Careers Volunteering Contact Us 8225 North Wickham Road, Melbourne, FL 32940 321.254.9453 ©2025 East Coast Zoological Foundation, All Photos ©East Coast Zoological Foundation and affiliates, unless otherwise noted. Accredited by the Association of Zoos and Aquariums View Terms & Privacy Policy Tickets Membership Donate Visit Membership Adventures Tips for a Great Visit Food and Drink Accessibility Groups Upcoming Events Back Events Upcoming Events Host an Event Back Support Our Partners Corporate Engagement Jaguar Society Planned Giving Celebration and Remembrance Matching Gifts Volunteer Programs Internships Back Learn Schools Early Childhood Camps Adult Programs Family Programs Teen Volunteers Homeschool Groups Back Conservation Sustainability Conservation Programs Conservation Partners Restore Our Shores Quarters for Conservation Grant Opportunities Back About Mission Animal Wellness Back News East Coast Zoological Foundation Sea Turtle Healing Center Future Aquarium Venues Shop × Close Panel"
    }
  ]
}