{
  "fuentes": [
    {
      "url": "https://www.wedding-spot.com/venue/9483/brew-hub/",
      "email": "indooroutdoor@2x.png"
    },
    {
      "url": "https://www.wedding-spot.com/venue/9483/brew-hub/",
      "email": "valet@2x.png"
    },
    {
      "url": "https://gulfpack.com.sa/contact-us/",
      "email": "sales@gulfpack.com.sa"
    },
    {
      "url": "https://visitcentralflorida.org/featured/brew-hub/",
      "email": "info@brewhub.com"
    },
    {
      "url": "https://www.lakelandhillsymca.net/contact/",
      "email": "membership@lhymca.com"
    },
    {
      "url": "https://www.brewhub.com/contact/",
      "email": "grow@brewhub.com"
    },
    {
      "url": "https://rusticgrain.com/casestudies/brew-hub-lakeland-fl/",
      "email": "info@rusticgrain.com"
    },
    {
      "url": "https://brewround.com/contact-us/",
      "email": "info@brewround.com"
    }
  ],
  "mails": [
    "grow@brewhub.com",
    "indooroutdoor@2x.png",
    "info@brewhub.com",
    "info@brewround.com",
    "info@rusticgrain.com",
    "membership@lhymca.com",
    "sales@gulfpack.com.sa",
    "valet@2x.png"
  ],
  "nombre_sitio": "brewhub.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.wedding-spot.com/venue/9483/brew-hub/",
      "text": "Brew Hub | Venue - Lakeland, FL | Wedding Spot You need to enable JavaScript to run WS React Application. ☰ Alabama » Alaska » Arizona » Arkansas » California (Northern) » California (Southern) » Colorado » Connecticut » Delaware » Washington DC » Florida » Georgia » Hawaii » Idaho » Illinois » Indiana » Iowa » Kansas » Kentucky » Louisiana » Maine » Maryland » Massachusetts » Michigan » Minnesota » Mississippi » Missouri » Montana » Nebraska » Nevada » New Hampshire » New Jersey » New Mexico » New York » North Carolina » North Dakota » Ohio » Oklahoma » Oregon » Pennsylvania » Rhode Island » South Carolina » South Dakota » Tennessee » Texas » Utah » Vermont » Virginia » Washington » West Virginia » Wisconsin » Wyoming » Mexico » Costa Rica » Caribbean Islands » See all regions Hotel Room Blocks Browse Venues Blog Sign In Join as a Venue What's Popular Not in Northern California ? See our other Locations . Price this venue to get your estimate, no strings attached. PRICE THIS VENUE Price this venue to get your estimate, no strings attached. PRICE THIS VENUE Price this venue to get your estimate, no strings attached. PRICE THIS VENUE 1 / 8 Provided by: Brew Hub Report Brew Hub 863-698-7600 CALL VENUE FAVORITE Venue highlights Indoor and outdoor spaces Valet parking Venue details Style: Event Center Guest capacity: Accommodates up to 175 guests Services: Ceremony / Reception Indoor / Outdoor VIEW OPTIONS Location: 3900 South Frontage Road Lakeland, FL 33815 Description: Tie the knot with your love and dance the night away in style at the gleaming Tasting Room, an open-floor venue space at the Brew Hub! With warm earthy tones all around, the Tasting Room offers a unique rustic setting for a relaxed yet chic wedding celebration. Hand-crafted wooden tables and chairs set the scene for a night to remember, and a small outdoor patio provides an intimate space for a breath of fresh air. With a low-key atmosphere that doesn’t sacrifice on style and personality, it’s the perfect modern and fun wedding space to wow your guests as you exchange your vows. READ MORE Additional details Service Options Venue notes The rental fee ranges from $1,500 to $3,000 for a ceremony and reception and includes 6 hours of event time excluding set up and clean up time. There is a food and beverage minimum applied to all events. Please inquire directly with the venue regarding all day rentals on Monday and Tuesday. Amenities and Restrictions Amenities - Wedding planning services - Bride's dressing area - Venue set up and clean up - Votive candles - Day-of coordinator - Kitchen for prep only - Large parking lot - Dance area - Silverware and glassware provided Restrictions - Food & beverage minimum - Beer and wine only - No rice, birdseed, confetti, etc. - Approved outside caterer allowed - Amplified music OK indoors and outdoors - Smoking outside only - Alcohol must be provided by venue - Music must end by 2:00AM Amenities - Wedding planning services - Bride's dressing area - Venue set up and clean up - Votive candles - Day-of coordinator - Kitchen for prep only - Large parking lot - Dance area - Silverware and glassware provided Restrictions - Food & beverage minimum - Beer and wine only - No rice, birdseed, confetti, etc. - Approved outside caterer allowed - Amplified music OK indoors and outdoors - Smoking outside only - Alcohol must be provided by venue - Music must end by 2:00AM Links Brew Hub 863-698-7600 CALL VENUE FAVORITE Venue Highlights Indoor and outdoor spaces Valet parking STARTING AT $3,129 FOR 50 GUESTS Price this venue to get your customized estimate, no strings attached PRICE THIS VENUE Interested in this venue? Don't miss out! Message this venue now to check their availability and receive more information. No commitment required. CONTACT VENUE PRICE VENUE CONTACT VENUE Service options Ceremony Indoor / Outdoor available Max Indoor capacity: 175 Max Outdoor capacity: 150 Reception Indoor / Outdoor available Max Indoor capacity: 120 Max Outdoor capacity: 120 STARTING AT $3,129 FOR 50 GUESTS Price this venue to get your customized estimate, no strings attached PRICE THIS VENUE Contact First name Last name Email Number of guests Preferred wedding date My dates are flexible Your message Hi,\nI found you on Wedding Spot and I would like to receive more information about having a wedding at your venue. By submitting this inquiry, you accept our Terms of Service and Privacy Policy . Send Message no thanks, take me back Your Privacy Choices Report Photo(s) What's the issue? * Inappropriate content Not my venue Infringes my rights Your email address * Additional information * Which photo(s) should be taken down; your role i.e. employee of the venue, owner of the venue, photographer) Submit Cancel | © 2025 Cvent Inc. privacy policy | terms of service Your Privacy Choices Wedding Spot Home About Services Find Venue Venues By Region Hotel Room Blocks News Press Releases In The News Spot Blog Terms Terms Of Service Privacy Policy Your Privacy Choices Help Contact Us FAQ How It Works"
    },
    {
      "url": "https://gulfpack.com.sa/contact-us/",
      "text": "Contact GulfPack | Get in Touch with Us We’re just a few clicks away. Want to join our team, invest in us, or learn more about our products? Simply fill in the form; our team will help you through everything. To stay updated, follow us on Linkedin. Back to Home I’m interested in Purchasing GulfPack Products Becoming a Supplier Career Opportunities General Inquiry Your details Work email Select Country Code Afghanistan (+93) Albania (+355) Algeria (+213) American Samoa (+1684) Andorra (+376) Angola (+244) Argentina (+54) Armenia (+374) Aruba (+297) Australia (+61) Austria (+43) Azerbaijan (+994) Bahamas (+1242) Bahrain (+973) Bangladesh (+880) Barbados (+1246) Belarus (+375) Belgium (+32) Belize (+501) Benin (+229) Bermuda (+1441) Bhutan (+975) Bolivia (+591) Bosnia and Herzegovina (+387) Botswana (+267) Brazil (+55) British Indian Ocean Territory (+246) Brunei Darussalam (+673) Bulgaria (+359) Burkina Faso (+226) Burundi (+257) Cambodia (+855) Cameroon (+237) Canada (+1) Cape Verde (+238) Cayman Islands (+345) Central African Republic (+236) Chad (+235) Chile (+56) China (+86) Colombia (+57) Comoros (+269) Congo (+242) Congo (Democratic Republic) (+243) Cook Islands (+682) Costa Rica (+506) Croatia (+385) Cuba (+53) Curaçao / Caribbean Netherlands (+599) Cyprus (+357) Czech Republic (+420) Denmark (+45) Djibouti (+253) Dominica (+1) Ecuador (+593) Egypt (+20) El Salvador (+503) Equatorial Guinea (+240) Eritrea (+291) Estonia (+372) Eswatini (Swaziland) (+268) Ethiopia (+251) Falkland Islands (+500) Faroe Islands (+298) Fiji (+679) Finland (+358) France (+33) Gabon (+241) Gambia (+220) Georgia (+995) Germany (+49) Ghana (+233) Gibraltar (+350) Greece (+30) Greenland (+299) Guadeloupe (+590) Guatemala (+502) Guinea (+224) Guinea-Bissau (+245) Guyana (+592) Haiti (+509) Honduras (+504) Hong Kong (+852) Hungary (+36) Iceland (+354) India (+91) Indonesia (+62) Iran (+98) Iraq (+964) Ireland (+353) Israel (+972) Italy (+39) Jamaica (+1) Japan (+81) Jordan (+962) Kazakhstan (+7) Kenya (+254) Kiribati (+686) Kuwait (+965) Kyrgyzstan (+996) Laos (+856) Latvia (+371) Lebanon (+961) Lesotho (+266) Liberia (+231) Libya (+218) Liechtenstein (+423) Lithuania (+370) Luxembourg (+352) Macau (+853) Macedonia (+389) Madagascar (+261) Malawi (+265) Malaysia (+60) Maldives (+960) Mali (+223) Malta (+356) Martinique (+596) Mauritania (+222) Mauritius (+230) Mexico (+52) Moldova (+373) Monaco (+377) Mongolia (+976) Montenegro (+382) Morocco (+212) Mozambique (+258) Myanmar (+95) Namibia (+264) Nauru (+674) Nepal (+977) Netherlands (+31) New Zealand (+64) Nicaragua (+505) Niger (+227) Nigeria (+234) Niue (+683) Norfolk Island / Antarctica (+672) North Korea (+850) Norway (+47) Oman (+968) Pakistan (+92) Palau (+680) Palestine (+970) Panama (+507) Papua New Guinea (+675) Paraguay (+595) Peru (+51) Philippines (+63) Poland (+48) Portugal (+351) Qatar (+974) Réunion / Mayotte (+262) Romania (+40) Russia (+7) Rwanda (+250) Saint Helena (+290) Saint Pierre and Miquelon (+508) Samoa (+685) San Marino (+378) São Tomé and Príncipe (+239) Saudi Arabia (+966) Senegal (+221) Serbia (+381) Seychelles (+248) Sierra Leone (+232) Singapore (+65) Slovakia (+421) Slovenia (+386) Solomon Islands (+677) Somalia (+252) South Africa (+27) South Korea (+82) Spain (+34) Sri Lanka (+94) Sudan (+249) Suriname (+597) Sweden (+46) Switzerland (+41) Syria (+963) Taiwan (+886) Tajikistan (+992) Tanzania (+255) Thailand (+66) Timor-Leste (+670) Togo (+228) Tokelau (+690) Tonga (+676) Trinidad and Tobago (+1) Tunisia (+216) Turkey (+90) Turkmenistan (+993) Uganda (+256) Ukraine (+380) United Arab Emirates (+971) United Kingdom (+44) United States (+1) Uruguay (+598) Uzbekistan (+998) Vanuatu (+678) Vatican City (+379) Venezuela (+58) Vietnam (+84) Wallis and Futuna (+681) Yemen (+967) Zambia (+260) Zimbabwe (+263) Please leave this field empty. Message/ Comments Is there anything you’d like to share? Δ Please note that this is not an application to seek funding or other services for a new venture or business. By clicking \"Contact us\" you agree to GulfPack’s Privacy Policy. Our Locations Corporate Office Abdulla Fouad Holding Tower Building 8808, 5th floor, King Fahd Bin Abdul Aziz Road, Al Qashlah Dist., Dhahran 34232, Kingdom of Saudi Arabia +966 13 341 2244 Manufacturing facility P.O. Box 1503 Jubail-31951, Kingdom of Saudi Arabia +966 13 341 2244 Sales & Distribution Hub Gulf Pack Americas, Inc. 11 South 12th Street 1st Floor, Richmond VA 23219, USA Egypt Office Galleria 40, Plot 40, 26 July St., 6th of October City, 12568 Egypt +20 106 333 3988 Tunisia Office Avenue Farhat Hached, Immeuble Chebil Bloc B- Sidi Rezig, Megrine 2033 Tunisia +216 26 792 792 Sales Offices Americas Richmond, Virginia Guadalajara, Mexico Buenos Aires, Argentina Africa Casablanca, Morocco Tunis, Tunisia Cairo, Egypt Europe Madrid, Spain Florence, Italy Athens, Greece Middle East Kindgom of Saudi Arabia Contact Now Home About Us BOPP Films CPP Films Packaging Toolbox Contact Us Careers Events Media Corporate Office Abdulla Fouad Holding Tower Building 8808, 5th floor, King Fahd Bin Abdul Aziz Road, Al Qashlah Dist., Dhahran 34232, Kingdom of Saudi Arabia Tel: +966133412244 Production Facility P.O. Box 1503 Jubail-31951, Kingdom of Saudi Arabia Privacy & Terms AR"
    },
    {
      "url": "https://visitcentralflorida.org/featured/brew-hub/",
      "text": "Brew Hub - Lakeland Brewery - Visit Central Florida Skip to content Go to VISIT CENTRAL FLORIDA SPORTS Open main menu Close main menu Deals & Specials Welcome Center Meetings & Conventions Travel Guide Blog Search Search for submit Events See & Do Eat & Drink Stay Cities & Towns Meetings Deals & Specials Facebook Twitter Pinterest Instagram YouTube Brew Hub Brew Hub is a craft beer brewing and packaging facility in Lakeland. The tasting room is open Wednesday - Sunday. Beer is always available on draft and to-go options include 6-packs, growler fills, and crowlers. Wine, hard seltzer, and cider is also available. Brew Hub in Lakeland, FL Nestled along the bustling I-4 corridor between Tampa and Orlando, Brew Hub stands as more than just a production brewery – it’s an inviting oasis featuring a dynamic tasting room experience. With a rich legacy spanning over a decade, they take immense pride in crafting a myriad of award-winning, high-caliber brews inspired by the diverse essence of Florida. Their commitment to quality and innovation sets them apart, inviting enthusiasts to savor the true essence of Florida’s brewing culture. See what’s on tap by visiting brewhub.com . Brew Hub’s Tasting Room is open 5 days a week, Wednesday-Sunday. A delicious variety of food trucks change daily, you’ll find the rotation schedule on Facebook . ADDRESS 3900 S Frontage Rd Lakeland,  33815 CONTACT INFO info@brewhub.com 863-698-7600 Visit Website TripAdvisor Traveler Rating 89 reviews JUL 15, 2024 07:08:57 Visited the area for our anniversary and saw this from the highway I-4 and were curious so we stopped. Glad we did! A great little place to sit and relax and enjoy a beer or two! They no longer offer... OCT 29, 2022 13:03:55 Top notch service to help try a few ales but in the end I settled on a guava cider! My hubby in a coffee ale! Yum!! \nDrove in, plenty of free parking, clean bathrooms and bar area and can even have... APR 19, 2022 14:30:01 The restaurant was Friday-night full and the server told us that the order will not be fast.  However, waiting over 40 minutes is not acceptable.  \nThe restaurant business is suffering from staffing... Read more reviews Write a review LEARN & DISCOVER Safari Wilderness Ranch Knowledgeable tour guides at Safari Wilderness Ranch will lead the way through 260-acres in custom safari vehicles, answering questions and… See Details Spend a Weekend in Lakeland See how much fun you’ll have when you plan a weekend in Lakeland, FL. Tour the world’s largest collection of... See Details Grove Roots Brewing Co. Grove Roots Brewing Co. produce artisanal ales inspired by the local Florida culture and influenced by rich heritage and community… See Details Adventure On Tap See Details Subscribe to EMAIL LIST Join our email list and stay up to date with all the great things happening in Central Florida. Notice: JavaScript is required for this content. Facebook Twitter Pinterest Instagram YouTube Central Florida Visitors & Convention Bureau 101 Adventure Court Davenport, FL 33837 1-800-828-7655 © 2025  Central Florida Visitors & Convention Bureau Polk County Savings Polk CVB Where Is Polk County, FL? Contact Us Film & TV Resources Travel Guide Media Professionals Privacy & Accessibility Travel Professionals Asset 2"
    },
    {
      "url": "https://www.lakelandhillsymca.net/contact/",
      "text": "Contact - Lakeland Hills Family YMCA Skip to content LAKELAND HILLS FAMILY Y LAKELAND HILLS FAMILY Y MENU LAKELAND HILLS FAMILY Y Search for: JOIN REGISTER GIVE Toggle Navigation About Who We Are Leadership Team Employment at the Y Financial Reports Facility Information Child Protection Privacy Policy Join Join the Y Membership Benefit Corporate Membership Financial Assistance Give Give Fit For The Future Endowment Volunteer Donors & Partners Programs Programs Overview Adult Sports Adult Sports Overview Adult Basketball Adult Pickleball Adult Sports Leagues Adult Volleyball Certification Courses Childcare & Camps Childcare and Camps Child Watch (Babysitting) Infant & Toddler Care Kids Club Before and After School Care Preschool & Pre-K Summer Camp Rockaway River Country Club Camp Health & Wellness Health & Wellness Overview Active Older Adults Adaptive Programs Group Exercise Adult Healthy Living Programs Personal Training Swimming Swim Overview Adaptive Swim Adult Swim Lessons & Aquatic Exercise Competitive Swim Team Drowning Elimination Parent & Child Water Safety Youth Swim Lessons Youth & Teen Programs Youth & Teen Programs Overview Fit Kids Personal Training Fun & Fitness Preschool Youth Gaming Club STEM Teen Leaders Youth & Teen Special Events Teen Programs Youth & Teen Sports Youth & Teen Sports Overview Basketball Soccer Indoor Youth Leagues Dance Snowboarding Parkour Schedules Events Special Events Youth & Teen Special Events Kids Night Out Annual Golf Outing Annual Dinner Meeting Birthday Parties Turkey Trot Contact More Annual Dinner Meeting Community Engagement Rentals at the Y Vendors & Suppliers News & Media Member Login X CLOSE Toggle Navigation About Who We Are Leadership Team Employment at the Y Financial Reports Facility Information Child Protection Privacy Policy Join Join the Y Membership Benefit Corporate Membership Financial Assistance Give Give Fit For The Future Endowment Volunteer Donors & Partners Programs Programs Overview Adult Sports Adult Sports Overview Adult Basketball Adult Pickleball Adult Sports Leagues Adult Volleyball Certification Courses Childcare & Camps Childcare and Camps Child Watch (Babysitting) Infant & Toddler Care Kids Club Before and After School Care Preschool & Pre-K Summer Camp Rockaway River Country Club Camp Health & Wellness Health & Wellness Overview Active Older Adults Adaptive Programs Group Exercise Adult Healthy Living Programs Personal Training Swimming Swim Overview Adaptive Swim Adult Swim Lessons & Aquatic Exercise Competitive Swim Team Drowning Elimination Parent & Child Water Safety Youth Swim Lessons Youth & Teen Programs Youth & Teen Programs Overview Fit Kids Personal Training Fun & Fitness Preschool Youth Gaming Club STEM Teen Leaders Youth & Teen Special Events Teen Programs Youth & Teen Sports Youth & Teen Sports Overview Basketball Soccer Indoor Youth Leagues Dance Snowboarding Parkour Schedules Events Special Events Youth & Teen Special Events Kids Night Out Annual Golf Outing Annual Dinner Meeting Birthday Parties Turkey Trot Contact More Annual Dinner Meeting Community Engagement Rentals at the Y Vendors & Suppliers News & Media Member Login REGISTER HERE Give Search for: Contact 2025-08-25T10:48:20-06:00 Contact Us Lakeland Hills YMCA is community-centered, bringing people of all ages and backgrounds together, to nurture potential and mobilize local communities to effect lasting and meaningful change. We look forward to helping you with your needs and answering any questions you may have. Feel free to contact us via the form below or through a membership representative at one of our local YMCAs. Contact Us Form × Contact Lakeland Hills Family Y Name * First Last Email * Who do you want to contact? * President and Chief Executive Officer, Alex Martinez Fund Development Associate, Dante Gonzalez Health & Wellness Director, Kelly Najjar Assistant Camp and Program Director, Quentin Pickering Camp & Youth Program Director, Linnea Berry Website Manager, Carmen Fritsch HR Director, Renee Dorn Chief Operating Officer, Devon Maloney Assistant Aquatics Director & Swim Lesson Coordinator, Yash Kothari Controller, Gail Shelby Fitness Director, Gerry Gessie Member Services Coordinator, Hope Hornick IT Director, Jonathan Ogintz Aquatics Manager/Lifeguard Coordinator, Sydney Jasinski Vice President Fund Development, Kaite Burke Community Engagement Manager, Kelly Horvath Early Childhood Learning Center Director, Michele Leaman Buildings and Grounds Assistant Director, Mika Newman Buildings and Grounds Director, Mike Ambrosi Membership Administrator/Day Camp Bookkeeper, Nancy Dunham Member Services Director, Reneé Welch Vice President Marketing and Membership, Rosemary Linder Day Competitive Swim Team & HR Administrator, Sarah Gulbin Senior Program Director, Shannon Bujoreanu Chief Financial Officer, Robert Marzan Early Childhood Learning Center Program Specialist & I-SWAP Manager, Cynthia Rodriguez Message * CAPTCHA LinkedIn This field is for validation purposes and should be left unchanged. Δ Close Lakeland Hills Family YMCA 100 Fanny Road Mountain Lakes, NJ Phone: 973-334-2820 membership@lhymca.com Frequently Asked Questions What are your facility hours? Our hours are: Monday – Friday 5:00 A.M – 10:30 P.M. Saturday – Sunday 7:00 A.M. – 6:00 P.M. Directions Can I access other YMCA’s with my Lakeland Hills YMCA membership? Yes. We are proud to offer our members access to YMCA facilities across the United States and Canada that participate in Nationwide Membership. This way, our members can use the Y as often as they like, making it easier to achieve their health and wellness goals. Are group exercise classes available? Yes. We have over 65 weekly classes offered from Yoga to HIT. These classes offer a great workout in a class setting, and are all included with your membership. Can I bring a friend? Yes. As a member, you are given 3 guest passes per year. You can bring a friend up to 3X for free. After that there is a fee. Guests/friends can use facility a max of 3X per year and then must become a member. Is there a trial membership to try out the Y? Yes. We have a 1-Week Trial Membership for free.  After that, we have several options that you can choose as a new member. What benefits do I get with my membership? Full Privilege Membership entitles you to use the pool, basketball gymnasium, Health and Fitness Training Center, general membership locker rooms, as well as group fitness, yoga, spinning classes, and all aqua exercise classes. Plus, three free guest passes per year and a fitness orientation. Some age restrictions apply. Long Term Locker Membership offers full privilege membership plus an assigned locker and towel service in an adult only locker room which includes steam room, sauna and TV. What are the pool hours? For Pool Hours and available swim times, please visit our schedules page where you can download swim times as well as gymnasium and group fitness class times. Do you offer financial assistance? Yes. We offer financial aid to ensure that no one is turned away from a Y program or service due to an inability to pay. Visit our Financial Assistance page for more information. STAY CURIOUS Want to know more about how you can make an impact in the community? Fill out this simple form to learn how to get involved. About Us Join Give Volunteer Test Contact Leadership Team Register Privacy Policy Member Login Facility Hours Y Hours Mon-Fri: 5:00am-10:15pm Sat-Sun: 7:00am – 5:45pm Desk Hours Mon-Fri: 8:00am-8:00pm Sat-Sun: 8:00am – 4:00pm Learn more >> CONNECT WITH US Copyright © Lakeland Hills YMCA Lakeland Hills YMCA | 100 Fanny Road | Mountain Lakes, NJ 07046 | 973.334.2820 Site designed by Daxko Toggle Sliding Bar Area Page load link Last chance this week to register for fall classes, which begin Monday, September 8. Registration available 24/7 online. + +"
    },
    {
      "url": "https://www.brewhub.com/contact/",
      "text": "Contact - Brew Hub | Lakeland, FL Skip to content Home Our Services Contact Home Our Services Contact WORK WITH US contact us Don't hesitate to reach out! get in touch Are you interested in learning more about how to grow your brands? Tell us a little bit about yourself or just give us a call. General Inquiry Phone: (863) 698-7600 General Inquiry Email: [email protected] Brew Hub 3900 Frontage Road S Lakeland, Florida 33815 driving directions to lakeland brewery From Orland to Lakeland Take I-4 to exit 25 for County Line Road. Take a right on N County Line Road and then your first left on to Southside Frontage Road. Brew Hub is located approximately 2 miles down on the right. From Tampa to Lakeland Take I-4 to exit 25 for County Line Road. Take a right on N County Line Road and then your first left on to Southside Frontage Road. Brew Hub is located approximately 2 miles down on the right. From Lakeland, FL Travel west on Polk Parkway/FL-570. Take exit 1 for Clark Road and continue straight through two stoplights. Take a right on Southside Frontage Road and Brew Hub is located approximately 1 mile down on the right. Your Name *Required Your Email *Required Subject Your Message Send Think we make a good match? We’d love to hear from you! get in touch navigation Home Services Contact where to find us 3900 S Frontage Road Lakeland, Florida 33815 general inquiry CONTACT Phone: (863) 698-7600 [email protected] Facebook Twitter Instagram Linkedin brew hub's top faq Powered and Designed by Brewing Sites © 2023 Brew Hub Privacy Policy WORK with us Are you interested in learning more about how to grow your brands? Tell us a little bit about yourself or just give us a call. Full Name Phone Email Which program interests you? Inquire Now give us a call (863) 698-7600 Facebook Twitter Instagram Linkedin"
    },
    {
      "url": "https://rusticgrain.com/casestudies/brew-hub-lakeland-fl/",
      "text": "Brew Hub – Lakeland, FL | Rustic Grain Call Us : (314) 690-3633 Search Menu Home Commercial Services Case Studies Menu View All Case Studies Brew Hub – Lakeland, FL Brewery   |   Posted on September 30, 2015 Digital Strike – Targeted Marketing Office Fixtures   |   Posted on September 29, 2015 Juniper Restaurant   |   Posted on September 27, 2015 Serendipity Gallery Retail   |   Posted on September 26, 2015 How it Works Consultation Gallery Brewery Brew Hub – Lakeland, FL \"Just like there is a story in every beer that we brew, there is a story to every piece Rustic Grain created.\" Diane Schoen - Brew Hub Watch Video Brew Hub was founded in 2012 in St. Louis, Missouri by a team of industry executives and craft brewing experts led by Timothy Schoen.  Brew Hub provides an entirely new business model for the craft brewing industry. With the right products and partnership opportunities, they’re putting the power back into the hands of the brand holder—without the capital exposure. The Challenge When Brew Hub approached Rustic Grain, it was a match made in heaven. Being big craft beer fanatics, the Brew Hub concept and the possibility of this being our first brewery project truly got the creative juices flowing. Although there are always major challenges with a project of this scale and uniqueness, one of the biggest issues was designing and fabricating for a project that was over 1000 mi away. Some additional challenges were as follows: Managing the routine architectural changes of a building being built from scratch, Ensuring our proposed designs would fit the unique environment Brew Hub was trying to create in their Florida location. Coordinating specific installations by the Rustic Grain team Taking necessary steps to ensure our products would adhere to the tough Florida climate. The Approach Through (online) meetings with project managers, architects and on-site contractors, we were able to design and produce the entire project in our St. Louis facility along with the Brew Hub principals.   After rounds of computer generated furniture design plans and wood samples created for final furniture finishes, we were able to create the space featured. In addition, 90% of the material sourced for this project came from a barn in St. Clair, Missouri. Adding an even more unique touch to this one-of-a-kind brewery. Signature Piece: Tasting Tables Wood: Reclaimed Pine Barnwood Finish: Oil Hardware: Custom Steel Straps Tasting tab Project Inventory 2 Tasting Tables Wood Type: Reclaimed Barn Wood Finish: Oil Hardware: Custom Steel Table Top Frame Built from a combination of reclaimed barn wood 6\"x6\" beams and floor joists Bistro Square Rounds Wood Type: Reclaimed Pine Barn Wood Finish: Dark Walnut Oil Overall Dimensions: 36\" SQ x 30\" (h) Butterfly Hinges to extend to 60\" round table top Black Matte Bistro Base 2 O'Fallon Collection Dining Tables Wood Type: Reclaimed Pine Barn Wood Finish: Natural Overall Dimensions: 72\"(l) x 30\"(l) x 30\"(h) Seats: 6 36\" Round Bistro Bar Table Wood Type: Reclaimed Pine Barn Wood Finish: Dark Walnut Oil Overall Dimensions: 36\" Round x 42\"(h) Bistro Bar Base with reclaimed wood caps Bar & Back Bar Wood Type: Reclaimed Pine Barn Wood Finish: Natural Over 100' of reclaimed bar top Epoxy top coat finish Accent pieces: boat cleats for bag hooks Custom Merchandise Display Wood Type: Mix Reclaimed Barn Wood Finish: Natural Overall Dimensions: 120\"(w) x 108\"(h) Cabinet Doors with reclaimed bolt door pulls Glass inset display case Learn More \"Just like there is a story in every beer that we brew, there is a story to every piece Rustic Grain created.\" Diane Schoen - Brew Hub Post navigation Digital Strike – Targeted Marketing Schedule A Consultation Every Piece Has A Story To Tell Every piece Rustic Grain creates has its own story to tell. Our craftsmen strive to preserve the customer’s ability to see that story. Every Brass Tag links our client's story to the barn it came from. Learn About Our Tags > Stay Connected Houzz Etsy Google Plus LinkedIn Twitter Pinterest Instagram Facebook Join Our Mailing List Email * CAPTCHA Comments This field is for validation purposes and should be left unchanged. About Residential Commercial Shop News Contact My Account Cart Check Out Pay Invoice Customer Service Rustic Grain 205 E Davis St St Louis, Missouri 63111 info@rusticgrain.com Phone: (314) 690-3633 Showroom Hours: By Appointment Only ©2015 Rustic Grain® Rights Reserved. Privacy Policy Terms & Conditions Disclaimer Site Map Hand coded with love by Brevity , in St. louis, MO"
    },
    {
      "url": "https://brewround.com/contact-us/",
      "text": "Contact Us | BrewRound Skip to content Coffee drinkers Find Coffee Shops Takeaway Coffee Best Coffee of Instagram Coffee Shop Owners Coffee Shop Subscription Mobile Ordering Loyalty and Rewards Attract more customers Coffee drinkers Find Coffee Shops Takeaway Coffee Best Coffee of Instagram Coffee Shop Owners Coffee Shop Subscription Mobile Ordering Loyalty and Rewards Attract more customers Shop sign up Get in touch Want to get in touch? We'd love to hear from you. Here's how you can reach us... Talk to sales Interest in what BrewRound offers? Get in touch with our sales team to join the platform. Send us an email Contact customer support Have you had an issue with the app or an order? Get in touch so we can make things right. Send us an email Find us BrewRound LTD Popeshead Court Offices Peter Lane York YO1 8SU Registered in England & Wales: 12660289 Something else? Do you have another enquiry for BrewRound? Whatever it is, we’d love to hear from you. Please complete the contact form below OR call us on 07969370313 Name Email Message Submit enquiry Mobile ordering Find the best coffee See all locations Coffee shops in York Coffee shops in Leeds Coffee shops in Manchester Coffee shops in Hull BrewRound About Us Blog Contact Us For Coffee Shop Owners Why join BrewRound? Pricing F.A.Q Subscription Service like Pret A Manger Follow Us Twitter Instagram Facebook ©2023 BrewRound Privacy Policy | Terms and Conditions | Cookie Policy This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Cookie settings ACCEPT Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these cookies, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may have an effect on your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Functional Functional Functional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features. Cookie Duration Description __cf_bm 30 minutes Cloudflare set the cookie to support Cloudflare Bot Management. _hjAbsoluteSessionInProgress 30 minutes Hotjar sets this cookie to detect a user's first pageview session, which is a True/False flag set by the cookie. _hjIncludedInPageviewSample 2 minutes Hotjar sets this cookie to check whether a user is included in the data sampling defined by the site's pageview limit. ig_did past Instagram installs this cookie so that its widgets are enabled on the website. li_gc 5 months 27 days Linkedin set this cookie for storing visitor's consent regarding using cookies for non-essential purposes. lidc 1 day LinkedIn sets the lidc cookie to facilitate data center selection. mid past The mid cookie is set by Instagram to personalise user experience by remembering user preferences and settings. TawkConnectionTime session Tawk.to, a live chat functionality, sets this cookie. For improved service, this cookie helps remember users so that previous chats can be linked together. twk_idm_key session Tawk set this cookie to allow the website to recognise the visitor in order to optimize the chat-box functionality. UserMatchHistory 1 month LinkedIn sets this cookie for LinkedIn Ads ID syncing. Performance Performance Performance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. Cookie Duration Description __gads 1 year 24 days Google sets this cookie under the DoubleClick domain, tracks the number of times users see an advert, measures the campaign's success, and calculates its revenue. This cookie can only be read from the domain they are currently on and will not track any data while they are browsing other sites. __hstc 5 months 27 days Hubspot set this main cookie for tracking visitors. It contains the domain, initial timestamp (first visit), last timestamp (last visit), current timestamp (this visit), and session number (increments for each subsequent session). _fbp 3 months Facebook sets this cookie to display advertisements when either on Facebook or on a digital platform powered by Facebook advertising after visiting the website. _ga 1 year 1 month 4 days Google Analytics sets this cookie to calculate visitor, session and campaign data and track site usage for the site's analytics report. The cookie stores information anonymously and assigns a randomly generated number to recognise unique visitors. _ga_* 1 year 1 month 4 days Google Analytics sets this cookie to store and count page views. _gat_gtag_UA_* 1 minute Google Analytics sets this cookie to store a unique user ID. _gid 1 day Google Analytics sets this cookie to store information on how visitors use a website while also creating an analytics report of the website's performance. Some of the collected data includes the number of visitors, their source, and the pages they visit anonymously. _hjFirstSeen 30 minutes Hotjar sets this cookie to identify a new user’s first session. It stores the true/false value, indicating whether it was the first time Hotjar saw this user. AnalyticsSyncHistory 1 month Linkedin set this cookie to store information about the time a sync took place with the lms_analytics cookie. hubspotutk 5 months 27 days HubSpot sets this cookie to keep track of the visitors to the website. This cookie is passed to HubSpot on form submission and used when deduplicating contacts. ln_or 1 day Linkedin sets this cookie to registers statistical data on users' behaviour on the website for internal analytics. Advertisement Advertisement Advertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads. Cookie Duration Description __gpi 1 year 24 days Google Ads Service uses this cookie to collect information about from multiple websites for retargeting ads. bcookie 1 year LinkedIn sets this cookie from LinkedIn share buttons and ad tags to recognize browser IDs. bscookie 1 year LinkedIn sets this cookie to store performed actions on the website. fr 3 months Facebook sets this cookie to show relevant advertisements by tracking user behaviour across the web, on sites with Facebook pixel or Facebook social plugin. IDE 1 year 24 days Google DoubleClick IDE cookies store information about how the user uses the website to present them with relevant ads according to the user profile. test_cookie 15 minutes doubleclick.net sets this cookie to determine if the user's browser supports cookies. Others Others Other uncategorized cookies are those that are being analyzed and have not been classified into a category as yet. Cookie Duration Description _ca.5f2843ada67f460029bccad6 1 year 1 month 4 days Description is currently not available. _ca.5fb25bb528d4cd0029083ce6 1 year 1 month 4 days Description is currently not available. _ca.6439a5811321960029126c3b 1 year 1 month 4 days Description is currently not available. _hjIncludedInSessionSample_1886234 2 minutes Description is currently not available. _hjSession_1886234 30 minutes Description is currently not available. _hjSessionUser_1886234 1 year Description is currently not available. original_referrer never No description available. SAVE & ACCEPT Powered by"
    }
  ]
}