{
  "fuentes": [
    {
      "url": "https://route1views.com/travel/brewhound-dog-park-bar-a-canine-paradise-in-neptune-beach-fl/",
      "email": "guest@domain.com"
    },
    {
      "url": "https://drink.brewdog.com/uk/customer-services/contact-us",
      "email": "pr@brewdog.com"
    },
    {
      "url": "https://www.crafthallphilly.com/unleashed",
      "email": "info@crafthallphilly.com"
    },
    {
      "url": "https://www.crafthallphilly.com/unleashed",
      "email": "info@crafthallphilly.com"
    },
    {
      "url": "https://www.babeswhohustle.com/home/babes/lwyckoff",
      "email": "lauren@brew-hound.com"
    }
  ],
  "mails": [
    "guest@domain.com",
    "info@crafthallphilly.com",
    "lauren@brew-hound.com",
    "pr@brewdog.com"
  ],
  "nombre_sitio": "brew-hound.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://route1views.com/travel/brewhound-dog-park-bar-a-canine-paradise-in-neptune-beach-fl/",
      "text": "BrewHound Dog Park & Bar: A Canine Paradise in Neptune Beach, FL - Route 1 Views Home Travel Articles Create About FAQ About Shop Login/ Signup Search for: Home Travel Articles Create About FAQ About Shop Sign in Sign up Search for: On route and almost there ! Previous Next BrewHound Dog Park & Bar: A Canine Paradise in Neptune Beach, FL Looking for a slice of paradise for Fido to romp around unleashed making new friends while you can sit back with a cold one? Welcome to BrewHound Dog Park, a place for your four-legged furry pals to find their own tail-waggin brand of bliss in a park designed with their joy in mind. At the same time while in this puppy paradise as dogs from Chihuahuas to Great Danes bound around yapping and sniffing out new friends,  you can mingle and choose from a selection of local brewmasters finest on tap. While tails wag,  people laugh and beer flows freely, you hear the carefree banter of the phrase “good boy” and “cheers” as this place takes the concept of bringing your best friend to a bar to another level. In the cool community of Neptune Beach, both people and pooches alike are welcome with a warmth of the Florida Sun. The grounds are so well-groomed  you would think one of the local PGA groundskeepers work here. The wine list here is like a grape’s greatest hits album and there’s a refreshing line of non-alcoholic beverages.   They also have fresh brewed cold bean coffee and espresso too. It’s a magical mix of frolic and freedom that makes this spot more than a patch of grass,  but a time of unadulterated joy for your loyal buddy. As the pints go down amongst all the friendly chatter, and the clink of glasses toasting to these dog day afternoons, you realize you have found doggie heaven. Safety and cleanliness are top priorities, as the staff’s attentiveness ensures the area is pristine and everyone is having a ball. The park is easily accessible and there’s plenty of parking. Day passes and memberships are available for both locals and visitors. So bring your furry friend to this tail waggin, beer sipping, friend making oasis among Florida’s palm trees. Paula Garland FL Neptune Beach Sep 18, 2024 Animals Bars Pets Next Location: Neptune Beach FL Get Directions Paula Garland Sep 18, 2024 Share BrewHound Dog Park & Bar: A Canine Paradise in Neptune Beach, FL SHARE 3 Like 0 'been there 1 Comment 5 Share Submit Comment Anonymous Great Concept 0 Like Reply 12 months Submit Comment Timeline Paula created this post 12 months ago Related Experiences Have you had an experience at this place? Share your own experience here! Share Your Experience More Views For You! Have another story to tell? Create an account and get started . It's free! Top Show List See Map reset Posts View History Loading Views . . . Looking for something different? Go on a journey through East Coast States Go back destination: Current Screen: Browsing History Close FOLLOW US GET IN TOUCH Question? Request? Issues? Get in touch with us here. Contact Name * Last * Email * Message * Captcha Submit If you are human, leave this field blank. About FAQS Login Shop Register Travel RT1 Privacy Notice Terms of Use About Route 1 © 2025 Double Ohs Music, LLC. All Rights Reserved. Route1Views Loading Close Save changes"
    },
    {
      "url": "https://drink.brewdog.com/uk/customer-services/contact-us",
      "text": "Get in touch | BrewDog Contact Details FREE Delivery Over £50 BOOK a Table Book UNLIMITED Wings Shop Bars Discover CONTACT US - CUSTOMER SERVICE Please check our our FAQs first here before contacting us. Standard orders are delivered within 3 working days, Monday to Friday, with free standard delivery for orders over £40. We aim to deliver Personalised Cans within 4 working days. Please be aware in some circumstances our courier partners may take a little longer to deliver your beer. See our Delivery and Returns page for more details. Customer Service operating hours: Monday to Friday, 9am – 6pm Here’s our most common questions: 1) How can I track my order? 2) Part of my order is damaged or missing 3) Checkout, placing an order and website queries 4) EFP benefits 5) How do I change my marketing preferences? For any queries with orders or any other queries we’re available via our support ticket request link here only. Please select the most relevant ‘subject’, from the dropdown options, to help speed things up. Any contact received outside of this form will not be responded to. Our direct email address is only available due to accessibility purposes. For PR enquiries please email: [email protected] This is for the media/journalists only and any other requests will not be responded to at this email address. If you are unable to create a support ticket due to accessibility reasons please email [email protected] Our brewery address is: BrewDog PLC, Balmacassie Industrial Estate, Ellon, Aberdeenshire. AB41 8BX. Cheers, Team BrewDog Careers Company Information Franchise Opportunities Trade Enquiries Cookie Preferences Terms & Conditions Responsibility Modern Slavery Act Gender Gap Statement Privacy Policy Country UK Germany Netherlands France Spain Australia USA Language English Follow us Secure SSL Checkout © Copyright BrewDog 2015- 2025 ; all images and content owned and produced by BrewDog PLC"
    },
    {
      "url": "https://www.crafthallphilly.com/unleashed",
      "text": "Unleashed — Craft Hall | A Family Friendly Sports Bar 0 Skip to Content Menu Playground Unleashed Gift Cards Events Book an Event FAQs TAKE OUT Delivery Uber Eats DoorDash GrubHub Join Our Team Contact Mainstay Independent Brewing Open Menu Close Menu Menu Playground Unleashed Gift Cards Events Book an Event FAQs TAKE OUT Delivery Uber Eats DoorDash GrubHub Join Our Team Contact Mainstay Independent Brewing Open Menu Close Menu Menu Playground Unleashed Gift Cards Events Book an Event FAQs TAKE OUT Folder: Delivery Back Uber Eats DoorDash GrubHub Join Our Team Contact Mainstay Independent Brewing Unleashed: Bark & Beer is a dog park / beer garden hybrid, where your pups can play off-leash while you relax with a cold one. Our Bark & Beer offers over 40 seats for human hangs and 2,000 sq. ft of turf for your dog to sniff out. And, you can let loose without leaving the park - our team provides contactless ordering and delivery for all of our breed-themed cocktails and beer. Sit. Stay. Have fun. The ONLY dogs allowed inside are service animals! If you want to enjoy our full food and drink offerings with your pup, please visit our Puppy Porch located on the side of Craft Hall. Have a drink while you hang with all your furry friends. CRAFT HALL PATRONS ONLY NO FOOD OR TREATS LEASH YOUR DOG WHILE ENTERING AND EXITING USE DOG PARK AT YOUR OWN RISK OWNERS ARE LEGALLY RESPONSIBLE FOR THE BEHAVIORS OF THEIR DOGS AT ALL TIMES DOG WASTE MUST BE CLEANED UP IMMEDIATELY CHILDREN MUST BE SUPERVISED NO DOGS UNDER THE AGE OF 4 MONTHS We have just a few rules in the dog park Maltese Liquors? What’s That? It’s our custom dog “cocktail,”get it? Served as an 8oz mixture to add to your dog's water dish, each flavoris made with fresh fruit or vegetables and blended with coconut water until smooth.  All rinds or seeds that may be unsafe for pups were removed prior to blending. FLAVORS: Blueberry, Pineapple, Watermelon, and Veggie Smoothie Slide 1 Slide 1 (current slide) Slide 2 Slide 2 (current slide) Slide 3 Slide 3 (current slide) Slide 4 Slide 4 (current slide) Slide 5 Slide 5 (current slide) Slide 6 Slide 6 (current slide) HOURS Monday- Friday: 4PM-12AM Saturday: 11AM-12AM Sunday: 11AM-10PM Kitchen closes 2 hours before close 2024 Winner CRAFT HALL 901 N Delaware Ave Philadelphia, PA 19123 info@crafthallphilly.com AN FCM HOSPITALITY RESTAURANT"
    },
    {
      "url": "https://www.babeswhohustle.com/home/babes/lwyckoff",
      "text": "BABES WHO HUSTLE home book club newsletter contact #babeswhohustle “In the future, there will be no female leaders. There will just be leaders.” ― Sheryl Sandberg Sep 14 Sep 14 Lauren Wyckoff | Co-Owner, BrewHound Dog Park + Bar Chelsea DuDeVoire Lauren is the co-founder and co-owner at BrewHound Dog Park + Bar, a Neptune Beach, FL-based dog park featuring local craft coffee, beer and wine on tap. With a 12-year background in environmental science and a lifelong love of dogs, she has created the business of her dreams—which has also filled a gap in her local market. BrewHound is the product of Lauren’s combined passions for the great outdoors, community building, and supporting fellow small business—and we can’t wait to see what’s in store for BrewHound next. The Basics: Hometown: Garden City, NY Current city: Jacksonville, FL Alma mater: Florida State University Degree: B.S., Environmental Studies + Physical Geography Very first job: Receptionist, Supercuts Hustle: Co-Owner + Co-Founder, BrewHound Dog Park + Bar The Interests: Babe you admire and why? There are countless women who have inspired me, but at the current moment: Byron Katie . I was recently introduced to her book, ‘Loving What Is’ , and it’s one of those deep dives that really frames your thinking and enables you to live more fully and heart-forward. Go-to coffee order and/or adult beverage? A nice peaty scotch, preferably from Islay . Favorite pup breed(s) at the moment? I’m a huge fan of mutts of any kind, and houndies. The Hustle: Tell us about your hustle, providing a summary of your roles and the work you do daily. I am the co-owner + co- founder of BrewHound Dog Park + Bar. BrewHound is a magical place on an acre in Neptune Beach, FL where pups frolic, play, and meet friends—while humans do the same over specialty coffees, local beers, and wine. Once upon a time (about five years ago), my partner Jason and I were drinking some greyhounds poolside in Orlando when the idea lightbulb popped above his head. From there, we started brewing something beautiful. It has been a wild ride and we’ve learned SO much. From working full-time while creating and crafting this dream of ours into reality, to now having BrewHound as our full-time job, it’s been both an enriching and profoundly intense adventure. Day-to-day, I handle all-things bar related, financial, marketing, social media, events, community connection, customer service and member relations, along with our managers and insight from Jason. BrewHound has a variety of activities for people and pups. How long did it take to design and build the space? Where did you draw inspiration from in the process? From idea inception and planning to opening our doors and fences took us three and a half years. There was a lot of ebb and flow throughout the process, and when I say we learned A TON, we did—and still are, every. single. day. Jason and I are both lovers of the wilderness and drew our inspiration for our bar structure and park design from outdoor spaces we love. Prior to opening BrewHound, what were you doing as an environmental scientist? Was it important for you to implement green practices into the park’s design and business model? Prior to opening BrewHound I worked as an environmental scientist for 12 years—specifically as a wetland scientist—so I essentially worked in the dark and majestic swamps of Florida for the state Department of Environmental Protection, the Army Corps of Engineers, and in the private sector as well. Respecting our wild places and choosing greener practices—even though they are often more costly—is extremely important to us. To name a few things, we have solar panels on our roof to offset our energy usage, we pay for a recycling program for our cans + cardboard, we use biodegradable compostable drinkware for to-go orders, and our doggie poop bags are made from plants. We also garden and grow accoutrements for our tea cocktails! What’s the community and culture like around BrewHound? We are a big family here at BrewHound, which also extends to our members. Whether they be day pass members, annual pass holders, or one time visitors , we are all Family. Our community culture is one of love. We love and respect each other + every person who walks through our gates. You never know what someone is going through, and we are all human, so we offer compassion and honor each other often. Off the top of your head, are some notable things to happen at BrewHound so far? We have had countless relationships forged here at BrewHound—friendships and beyond—from seeing folks invite one another to their weddings, or going off on adventures together beyond BrewHound. One of our baristas even met her now husband here! Most recently, we had an engagement here, right by our splash pad. How have your past professional and academic experiences and lessons prepared you for the work you do today? How have they not prepared you? Working so close to nature in the wild and outdoors has provided me with a great respect for it. It’s also helped me to have an adaptability in extreme conditions, whether they be physical or emotional. What has the transition to being a mom while owning a business—and a pack of doggos—been like? I could write a book on this alone! I will say that I couldn't have dreamed of or anticipated being wrapped in more love or support than this BrewHound fam of ours has provided. You will see me daily with Little T strapped to me, hanging in his harness or hanging out with Madi, our yard manager, as she watches over The Yard. He is surrounded with the unconditional love of dogs and gracious, loving, kind people daily. I've always been a ‘night owl’ when my creative juices are flowing—which hasn't changed—so after I put him to bed, I get to work on the planning phases of things and the graphic design portion of events or outreach materials. With three dogs and a baby, there is a constant state of howling or singing in the house. It’s so darn fun. How has being a woman impacted your professional experiences? What can we collectively do to support and empower women in your industry today? Outdoor fieldwork and the field sciences as a whole is an especially male-dominated field. The idea that, as women, we might not be ‘tough enough’ to handle various situations was common initially, until work was underway and we had the opportunity to prove what we’re capable of. I was often eager for these challenges to show someone what I could do or the extreme elements I could withstand—yet it wasn't actually for them. The growth I experienced at this time in my life showed me that we all have the capacity to break or change preconceived notions of self—but not for others, only for ourselves. We are all here for growth, to lift each other up and see each other’s worth in all things. What’s one thing you’re proud to have accomplished in your career thus far? I'm humbled to be able to have an impact on my community in such a positive way, to be able to donate much needed funds to nonprofits, and to provide a space for people to gather and support dogs and people in need. Who are some women in your field that you look to for inspiration? Geri Bernard is a fellow business owner here in Jacksonville. She owns Painting with a Twist in San Marco , and has been a brilliant sounding board for advice and calming heightened energies at times of stress. I think it’s very important to find a tribe of women you can trust and relate to. Career and/or life advice for other babes? Believe in yourself—even when others don't; when they tell you ‘no’ or that you can't do something.  Check in with your heart and let it pull you; dispel your fear by staying in the present moment and taking baby steps towards what you’re building. Connect with Lauren: Instagram / Email This interview has been condensed and edited. In partnership with: BrewHound Dog Park + Bar Located in Neptune Beach, FL and co-owned by Lauren Wyckoff and Jason Underwood, BrewHound Dog Park + Bar is a unique gathering place for dogs and their owners to play and mingle outside, enjoy delicious cold (or hot) beverages, and relax in the beautiful sunshine. Learn more about BrewHound here , and follow along on Instagram + Facebook for more information. Join our community: Instagram / Facebook / Shop / Newsletter / Nominate a Babe Chelsea DuDeVoire Facebook 0 Twitter LinkedIn 0 Reddit Pinterest 0 0 Likes Chelsea DuDeVoire Chelsea DuDeVoire Sep 21 Yazi Davis | Wedding + Elopement Photographer Aug 31 Charnae' Wynn | Owner, iGlam Lash and Beauty Salon home about team shop nominate partnerships mailing list"
    }
  ]
}