{
  "fuentes": [
    {
      "url": "https://brickhousetavern.com/about-us",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://www.injuryrelief.com/bars/brick-house-tavern-and-tap/",
      "email": "info@injuryrelief.com"
    },
    {
      "url": "https://www.groupon.com/biz/tampa/brick-house-tavern-tap",
      "email": "verify@r.groupon.com"
    }
  ],
  "mails": [
    "filler@godaddy.com",
    "info@injuryrelief.com",
    "verify@r.groupon.com"
  ],
  "nombre_sitio": "brickhousetavernandtap.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://brickhousetavern.com/about-us",
      "text": "BrickHouse Tavern - Restaurant, Davidson, Restaurants Nearby Home MENU Order Online TAP ROOM Events About Us Contact Us More Home MENU Order Online TAP ROOM Events About Us Contact Us Sign In My Account Signed in as: filler@godaddy.com My Account Sign out Signed in as: filler@godaddy.com Home MENU Order Online TAP ROOM Events About Us Contact Us Account My Account Sign out Sign In My Account About Us About Us Located in the heart of Davidson, N.C., The Brickhouse Tavern has been serving the Lake Norman community for 20 years. Once inside, patrons are surrounded by the history of Davidson as they sit within the brick walls of the old Davidson Cotton Mill built in the 1890’s. The unique building has seating options in the dining room, tap room, and outdoor patio area. This distinctive space offers up a casual atmosphere that is the perfect setting to a complete dining experience. The Brickhouse Tavern offers an extensive menu of classic dishes and bold flavors. Guests have their choice of appetizers, salads, sandwiches, C.A.B. burgers, pastas, seafood, pizza, and other Brickhouse specialties. As a compliment to the superb food, The Brickhouse Tavern offers more than 70 beer selections, including a wide-range of Carolina Craft brews. The largest selection in the Lake Norman area! Whether dining in or placing an order to go, The Brickhouse Tavern is proud to create each order from scratch…just for you! Outside its brick walls, The Brickhouse Tavern prides itself on giving back to the community who so graciously supports them. The Brickhouse Tavern has partnered with organizations such as The Ada Jenkins Center, Davidson College, and NASCAR Technical Institute, to give back to those in need. The Brickhouse Tavern is also a proud supporter of the Davidson Wildcats. Starting in 2018, we will sponsor the Brickhouse Above the Rim Bar, located in Belk Arena, with all proceeds going back to Davidson College. Special Events We have space available for private events and for small to large parties. Whether you are looking to host a business lunch, cocktail reception, graduation party, or holiday party, we can help make your event special. In addition to the space, we will help you design the perfect menu to fit your needs. We would be happy to discuss how to be a part of your next event! Call us at 704.987.2022 or email mngrbrickhousetavern@gmail.com Proud Partner of the Davidson Wildcats The Brickhouse Tavern is a proud supporter of the Davidson Wildcats! And beginning in 2018, the Davidson-based restaurant will sponsor the Brickhouse Above the Rim Bar, located in Belk Arena. The bar will serve Layup Lager  exclusively with all proceeds going back to Davidson College. So, stop by The Brickhouse Tavern for a pre-game bite then head over to Belk Arena for a Layup Lager and 40 minutes of on-court action! Go Wildcats! Copyright © 2020 Brickhouse Tavern - All Rights Reserved. Powered by GoDaddy"
    },
    {
      "url": "https://www.injuryrelief.com/bars/brick-house-tavern-and-tap/",
      "text": "Brick House Tavern and Tap Investigated by TABC - Grossman Law Offices RECENT SUCCESS STORY: $4,000,000 SEMI-TRUCK ACCIDENT SETTLEMENT Contact us with questions: (855) 326-0000 Brick House Tavern and Tap Investigated by TABC Last Updated: December 20th, 2022 By: Mike Grossman Attorneys Our Attorneys and Staff Michael Grossman Founder of Grossman Law From 2012–2020, Thomson Reuters Has Recognized Michael Grossman as One of the Top Lawyers in Texas View profile Keith Purdue, Esq. Partner Having litigated hundreds of cases, Keith Purdue is one of Texas' most experienced truck accident and dram shop attorneys. View profile Meet the team Referrals Referring Attorneys “whatever the defense brought up, they were prepared... Hon. Dan Robles 100s of lawyers across the country have referred cases to Grossman Law Offices. We’re known for our litigation prowess. We have the resources to take on any case. We move cases quickly and efficiently. We never keep referring attorneys in the dark. refer your case Cases We Take Cases We Take Truck Accidents Read the guide Wrongful Death Read the guide Dram Shop Read the guide see all cases Results Settlements & Verdicts $7,592,060.00 Settlement WRONGFUL DEATH / 3RD PARTY DRAM SHOP $7,500,000.00 Settlement WRONGFUL DEATH / COMMERCIAL VEHICLE ACCIDENT $4,000,000.00 Settlement COMMERCIAL VEHICLE ACCIDENT / BRAIN INJURY all results Testimonials Testimonials & Success Stories \"All I can say is I'm grateful.\" Marcela \"Without them I wouldn’t have much in the way of a life.\" Shaun R. \"I think they're the best dram shop firm in Texas Attorney Adam Loewy testimonials Articles Articles EXPLORE BY TOPIC: Wrongful Death Dram Shop Truck Accidents Workers' Comp Personal Injury Car Accidents Non-Subscriber Hiring a Lawyer Valuing Cases FEATURED ARTICLES How Does Commercial Truck Accident Insurance Work? Read the article How Does Witness Testimony Work in a Truck Accident Case? Read the article browse all Blog Blog Sep 9, 2025 Examining the School Bus Crash on Cook Road in LaFayette, GA Sep 9, 2025 What Caused the School Bus Crash on US 152 Near Minco, OK? Sep 9, 2025 Analyzing the 18-Wheeler Crash on I-610 in Houston, TX explore more Contact Contact Grossman Law (855) 326-0000 (214) 833-7751 info@injuryrelief.com Contact us ES EN free consultations AVAILABLE 24/7 855-326-0000 ES EN Home Attorneys & Staff Michael Grossman Keith Purdue Cory Carlson Gene Mattison See All Attorneys & Staff… Cases We Take See All Areas of Practice… Wrongful Death Cases Truck Accident Cases Wheel-Off Truck Accidents Dram Shop Cases Fatal Work Accidents Non-Subscriber Cases Personal Injury Cases Car Accident Cases Motorcycle Accident Cases Workers’ Compensation Cases Grossman Law Blog Articles Browse the Complete Library… Truck Accidents Wrongful Death Dram Shop Car Accidents Non-Subscriber Hiring a Lawyer FAQ Referring Attorneys Settlements and Verdicts Success Stories Locations We Serve Best Texas Lawyer Lists Dallas Fort Worth Garland Irving Mckinney Plano See all locations we serve… Contact Us Home Bars Brick House Tavern and Tap Investigated by TABC Bars Investigated by the TABC Brick House Tavern and Tap Investigated by TABC Last Updated: December 20th, 2022 By: Mike Grossman Brick House Tavern and Tap Investigated by TABC Considering A Dram House Case Against Brick House Tavern and Tap? Here's What You Need To Know My firm has handled more dram shop cases than any other in Texas. With 30 years of experience behind me, I have seen countless examples of bars that fail to follow alcohol service regulations and the tragic consequences that can result. This issue is more rampant that people realize, and one of my goals is to bring it to the public's attention. One way I do this is by reviewing Texas Alcoholic Beverage Commission complaint records and posting about my findings. If you think you may have a dram shop (liquor liability) claim and want to know how to proceed, please call me at (855) 326-0000. Based out of Houston, Brick House Tavern and Tap is a chain of sports bars owned by Landry's Inc. With 21 locations across 10 states, the brand has made a name for itself with its creative menu and wide variety of craft beers on tap. However, through the years, it has also attracted a significant amount of attention from the TABC for allegations of liquor law violations. Between 2015 and 2019, agents conducted no fewer than nine investigations into its Texas locations' liquor law practices. In my experience, it is uncommon for a bar without a history of run-ins with the TABC to end up on the hook for contributing to a wrongful death or injury. Virtually every bar I have ever sued was already on the authorities' radar. That's why I pay close attention to bars with several recent complaints against them. The more investigations a bar has had, the greater my concern is that it could one day cause an accident. Note: Investigations are not proof of wrongdoing. However, if authorities investigate and fail to find evidence, it doesn't necessarily mean an establishment is innocent, either. The purpose of this article is simply to relay publicly-available information about incidents where the TABC has investigated Brick House Tavern and Tap for possible criminal or administrative violations. TABC Investigations of Brick House Tavern and Tap Between Austin - 11680 Research Boulevard 'A' Allegations: Law enforcement lodged a complaint on 04/26/2017, alleging that a staff member was intoxicated on the job. The TABC launched an investigation into the claim and found sufficient evidence to issue a citation. On 11/21/2017, agents finished their work on this case. On 11/21/2017, a concerned citizen contacted the TABC alleging three violations at this location. The first claim was that a breach of the peace (typically a fight) took place. The other two allegations were that the bar permitted a staff member to sell drugs on the premises and sold alcohol to an intoxicated patron. Authorities looked into the matter, but they were unable to find any proof to corroborate the claims. Unable to take any action, they closed the case on 01/17/2018. Grapevine - 700 W State Highway 114 Allegations: A member of the Grapevine community reached out to TABC on 01/29/2019, claiming that this location sold alcohol to an intoxicated patron. For most liquor law violations, the TABC requires either video footage of the incident or eyewitness testimony from one of its agents before it can take legal action. In this particular instance, authorities had neither. On 03/20/2019, after an almost two-month investigation, the case came to a close. A second investigation of this location took place on 06/03/2019, after TABC received a citizen complaint again charging the bar with selling alcohol to a drunk customer. As in the previous investigation, authorities had no video evidence of the incident and were thus unable to take any action. On 07/30/2019, TABC decided to shut this case. Houston - 17111 Tomball Parkway Allegations: A citizen complaint, filed on 12/10/2018, alleged that staff delivered an alcoholic beverage to a drunk person. The TABC followed up with an investigation shortly thereafter. After almost four months of inquiry, agents failed to produce any proof capable of corroborating the claim. Consequently, the case concluded on 03/23/2019 without any further action. Sugar Land - 19740 Southwest Fwy Allegations: On 08/14/2018, TABC received a law enforcement complaint alleging that bar staff sold alcohol to a patron who was already over the limit. Authorities looked into the matter, but after over a month of investigation, they were unable to locate any evidence of wrongdoing. As a result, they chose to close the case on 09/24/2018. San Antonio - 1011 N Loop 1604 W Allegations: On 02/19/2015, a member of staff at this location contacted the TABC an claimed that the bar sold alcohol to a minor. While the source of the complaint might seem odd, staff are in fact required by law to report any violations they see to the authorities. TABC agents followed up with an investigation, but were unable to prove the allegation. As a result, the inquiry ended without further action on 04/09/2015. Texas Law Says Accident Victims Can Sue Bad Bars If you would like to learn more about Texas dram shop law (i.e. lawsuits against bars who play a role in injurious or fatal accidents), please visit our Texas Dram Shop Law Info Page . Free Injury Consultation (855) 326-0000 Or, contact us via our online form. “Call Grossman before you call any other firm.” Nathan B. We are Ready to Help 24/7 Getting the help you need after an injury shouldn’t be complicated. At Grossman Law, we make it\n\t\t\t\t\tsimple. Global Footer Form Get Your Free Case Evaluation Prefer the phone? Call our office: (855) 326-0000 First Name * Last Name * Email * Phone * Message * Clio Facebook This field is for validation purposes and should be left unchanged. Submit information What to expect after submitting your information: We’ll be in touch within minutes We respond to messages day and night. You can expect to hear from a member of\n\t\t\t\t\t\t\t\t\tour team within minutes of your submission. We’ll listen to your story We’ll listen to the details of your case and give you our qualified, honest\n\t\t\t\t\t\t\t\t\tassessment as to the strength of your case. We’ll get to work on your behalf If we believe you have a valid claim, we’ll offer to represent you. If you\n\t\t\t\t\t\t\t\t\tagree, you’ll sign up and we’ll immediately get to work on your case. In our near-30 year history, Grossman Law Offices has won thousands of cases. We pride ourselves on our aggressive litigation approach and our goal of obtaining maximum compensation for every client. IMPORTANT NOTICE: The information on this website is for informational purposes only. This website should not be taken as legal advice. Prior results do not guarantee a similar outcome. This information should not be taken as the formation of a lawyer or attorney client relationship. For more details, read the full disclaimer below. AREAS SERVED INCLUDE: Dallas | Fort Worth | Plano | Irving | Garland | Mckinney | Frisco | Carrollton | Flower Mound | Grande Prairie | Grapevine | Haltom City | Coppell | Southlake | And throughout the state of Texas . Visit 3890 W. Northwest Hwy Suite 100 Dallas, TX 75220 Directions 855-326-0000 Email info@injuryrelief.com Site Pages Meet Our Team Articles Blog Contact Us Privacy Policy Sitemap Disclaimer ©\n\t\t\t\t\t2025\t\t\t\t\tGrossman Law Offices. All Rights Reserved. Site By: Get Your Free & Immediate Case Evaluation Let us show you how we are different. We only take select cases and we litigate them; we're not a settlement mill. First Name * Last Name * Phone * Email * Message * Clio Phone This field is for validation purposes and should be left unchanged. submit free evaluation We Never Spam* Call 24/7 (855) 326-0000 Or Call Us 855-326-0000 Get Instant Answers Ask Anything About Our Firm"
    },
    {
      "url": "https://www.groupon.com/biz/tampa/brick-house-tavern-tap",
      "text": "Brick House Tavern + Tap, 1102 North Dale Mabry Highway, Tampa, FL - Groupon Download our app for exclusive deals Sell on Groupon English Chicago Sign In Beauty & Spas Beauty & Spas Massage Hair Removal Face & Skin Care Cosmetic Procedures Spas Hair & Styling Health & Fitness Weight Loss Nail Salons Dental Brows & Lashes Tanning Beauty & Spas Things To Do Things To Do Fun & Leisure Tickets & Events Kids Activities Sightseeing & Tours Sports & Outdoors Museums & Galleries Photography Amusement Parks Bowling Trampoline & Bounce Houses Boat Tours Classes Escape Games Arcades Things To Do Auto & Home Auto & Home Oil Change Auto Repair & Maintenance Car Wash Parking Home Services Cleaning Services Bedding Furniture Patio, Lawn & Garden Kitchen & Dining Auto & Home Food & Drink Food & Drink Restaurants Cafes & Treats Bakeries Bars Breweries, Wineries & Distilleries Groceries & Markets American Restaurants Asian Restaurants Latin American Restaurants Pizza Seafood Restaurants Steakhouse Food & Drink Gifts Gifts Recipient For Her For Him For Couples For Kids Occasion Birthday Anniversary Wedding Graduation Interest Foodies Relaxing Care Sports Fun Leisure Housewarming Travelers Learning Price Under $10 Under $20 Under $50 Under $100 $100+ More Trending gifts Personalized gifts Flowers, Sweets & Baskets Gift cards Gifts Local Local Beauty & Spas Personal Services Health & Fitness Retail Things To Do Food & Drink Auto & Home Improvement Home Services Gift Cards Local Travel Travel Air-Inclusive Waterparks Casinos Family Romantic Beach Destinations City Outdoor Activities All-Inclusive Cruises Culinary Luxury Spa & Wellness Unique Lodging Travel Goods Goods Health & Beauty Products Fragrance Hair Care Vitamins & Supplements Sexual Wellness Personal Care Skin Care Oral Care Health Care Cosmetics Bath & Body Men's Health & Beauty Massage Aromatherapy Shaving & Grooming For the Home Bedding Furniture Kitchen & Dining Luggage Outdoor Décor Patio, Lawn & Garden Mattresses & Accessories Storage & Organization Bath Home Appliances Floor Care & Cleaning Home Decor Office & School Supplies Seasonal Decor Women's Fashion Women's Clothing Women's Accessories Intimates Women's Shoes Maternity Clothing Personalized Gifts Photo Books Cards, Invitations & Stationery Canvas & Photo Art Custom Gifts & Gadgets Jewelry Clothing & Accessories Home Decor Kitchen Accessories Baby & Kids Pets Bags More Flowers, Sweets & Baskets CBD Cell Phones & Accessories Software Electronics Video Games Jewelry & Watches Men's Fashion Grocery & Household Auto & Home Improvement Sports & Outdoors Pet Supplies Baby & Kids Toys Goods Coupons Coupons Popular Brands Amazon Costco eBay Expedia Great Clips Hotels.com Macy's Nike Pizza Hut The Home Depot TurboTax Viator VistaPrint Walmart Wayfair Trending Betterhelp Booking.com Budget Cabela's Dick's Sporting Goods HBO Max Macy's Old Navy Paramount+ ProFlowers Sam's Club Shutterfly Sunglass Hut TaxSlayer Wayfair Coupons Blog Best 4th of July Sales & Promo Codes Sephora Sales Calendar 2024 Hobby Lobby 2024 Sales Calendar Amazon Prime Day Deals on July 16 & 17 Amazon Prime Discount: Do You Qualify? Amazon Music Unlimited Free 3-Month Trial Ulta 2024 Sales Calendar Back to School: Shop Tax-Free Weekends Nike Factory Outlet Stores Lowe's 2024 Sales Calendar Home Depot 2024 Seasonal Sales Guide Nordstrom Anniversary Sale Calendar Walmart Vision Center Price Guide Cheapest Diaper Deals this Week Macy's 2024 Sales Calendar Coupons Home Brick House Tavern + Tap, Tampa Brick House Tavern + Tap, Tampa 1102 North Dale Mabry Highway, Tampa, FL 33607 Deals at this location No deals are currently available at this location. This merchant doesn't have any deals and is not affiliated with Groupon. Please contact them directly for services. Is this your business? Similar deals House of Blues ( 7 Locations ) Show or Night Out dining packages for 2 or 4 individuals at House of Blues (Up to 42% Off) 1490 East Buena Vista Drive, Orlando 994.4 mi $96 $65 -32% Book Online Chicago Skyline Tiki Chic Party Cruise on Lake Michigan Island Party Boat $35 3.8 (26) Crepe It Up And Bowls Sip Lattes, Bite Croissants, Savor Crepes – Ultimate Indulgence 1340 75th Street, Downers Grove 22.1 mi $26.28 $18 -32% 5 (38) How to reach us © MapTiler © OpenStreetMap contributors Brick House Tavern + Tap 1004.5 mi 1102 North Dale Mabry Highway, Tampa, FL 33607 Open Closes at 1:00 AM Open Closes at 1:00 AM Call Directions Visit website Parking Price Takes Reservations +18133509108 http://brickhousetavernandtap.com About Brick House Tavern + Tap You can't beat the classics. Stop in at Brick House Tavern + Tap for some good home American cooking.  Whether you are looking for food low in fat or gluten-free, this restaurant is the place you want to eat.  Don't go thirsty during dinner! This restaurant also offers a splendid drink list featuring wine, beer, and more.  Don't miss out on the great happy hour deals at Brick House Tavern + Tap.  Brick House Tavern + Tap is well-known for being able to seat large parties.  Summer meals will taste even better when you enjoy them on Brick House Tavern + Tap's gorgeous patio.  Check email, shop online, or get the latest game scores on Brick House Tavern + Tap's free wifi. Weekends are when crowds really head to Brick House Tavern + Tap, so plan accordingly.  Throw on your favorite T-shirt and head out the door — dining at Brick House Tavern + Tap is all about comfort.  You can also grab your grub to go. The only thing tastier than our food and drinks is the free parking.  At Brick House Tavern + Tap, bikers can lock their bikes safely outside. It will typically cost you about $30 to enjoy a meal at Brick House Tavern + Tap.  The friendly staff at Brick House Tavern + Tap are ready and waiting to cook and serve your favorite American meal.  See what great American fare is cooking up next at Brick House Tavern + Tap.  Brick House Tavern + Tap has been highly-rated by restaurant-goers, so stop by today and see what the hype is about. Trending in Groupon Groupon is your place for savings and discovery while exploring fun activities in your city and around the country. Explore categories Popular Things Nearby Things To Do In Popular Cities By Cities Coupons and Promo Codes Beauty & Spas Deep Tissue Massage Near You Full Body Massage Near You Teeth Cleaning Near You Lash Extensions Near You Keratin Treatment Near You Reflexology Near You Eyebrow Threading Near You Brazilian Wax Near You Pedicure Near You Day Spa Near You Lip Fillers Near You Tanning Near You Massage Near You Laser Hair Removal Near You Nail Salon Near You Couples Massage Near You Salon Near You Barber Shops Near You Hair Salons Near You Spa Near You Haircut Near You Botox Near You Facials Near You Waxing Near You Food & Drink Food Near You American Restaurants Near You Bars Near You Chinese Food Near You Indian Food Near You Italian Restaurants Near You Mexican Food Near You Pizza Near You Steakhouses Near You Sushi Near You Things To Do Fun Activities Near You Cheap Movie Tickets Events Near You Photography Classes Near You Kids Shows Near You Cheap Concert Tickets Things to Do Near You Amusement Parks Near You Arcade Near You Bowling Near You Escape Room Near You Kids Activities Near You Mini Golf Near You Museums Near You Trampoline Park Near You Zoos Near You Health & Fitness Eye Exam Near You Dentist Near You Teeth Whitening Near You B12 Shots Near You Pilates Near You Chiropractor Near You Dance Classes Near You Dermatologist Near You Fitness Classes Near You Colon Cleanse Near You Invisalign Near You Golf Near You Gyms Near You Weight Loss Clinic Near You Yoga Near You Automotive Oil Change Near You Car Detailing Near You Car Wash Near You Mechanic Near You Wheel Alignment Near You Personal Services Classes Near You Hobbies Near You Cooking Classes Near You Photographers Near You Home Services Air Duct Clening Near You Carpet Cleaning Near You Things To Do In Atlanta Things To Do In Austin Things To Do In Baltimore Things To Do In Boston Things To Do In Calgary Things To Do In Charleston Things To Do In Charlotte Things To Do In Chicago Things To Do In Dallas Things To Do In Denver Things To Do In Edmonton Things To Do In Houston Things To Do In Las Vegas Things To Do In Los Angeles Things To Do In Miami Things To Do In New York City Things To Do In Orlando Things To Do In Ottawa Things To Do In Philadelphia Things To Do In Phoenix Things To Do In Portland Things To Do In San Antonio Things To Do In San Diego Things To Do In San Francisco Things To Do In San Jose Things To Do In Seattle Things To Do In Tampa Things To Do In Toronto Things To Do In Vancouver Things To Do In Washington D.C. Things To Do In Indianapolis Atlanta Austin Baltimore Boston Calgary Charleston Charlotte Chicago Dallas Denver Edmonton Houston Las Vegas Los Angeles Miami New York City Orlando Ottawa Philadelphia Phoenix Portland San Antonio San Diego San Francisco San Jose Seattle Tampa Toronto Vancouver Washington D.C. 1-800-Flowers Coupons Adidas Promo Codes Amazon Promo Codes American Eagle Promo Codes Ancestry DNA Coupons ASOS Promo Codes Bed Bath & Beyond Coupons Boohoo Promo Codes eBay Coupons Edible Arrangements Coupons Forever 21 Coupons H&R Block Coupons Home Depot Coupons Kohl's Coupons L.L.Bean Coupons Lowe's Coupons Macy's Coupons Michaels Coupons Old Navy Coupons Quickbooks Coupons Samsung Coupons Sephora Coupons Target Coupons TJ Maxx Coupons Turbotax Service Codes Udemy Coupons Verizon Wireless Promo Codes Walmart Coupons Weight Watchers Coupons Zales Promo Codes Get the Groupon App Unlock up to 90% discounts on the go with the Groupon app! Exclusive deals, push notifications, and digital vouchers at your fingertips. Get the App 100M+ downloads Groupon Sites USA United Kingdom France Deutschland Italia España Polska Nederland Ireland UAE België Canada Australia Sign up for the latest deals By subscribing, I agree to the Terms of Use and have read the Privacy Statement . Follow Us Support Customer Support Report Infringement Refund Policies Merchant Class Action Settlement Notice Sell on Groupon Join Groupon Marketplace Run a Groupon Campaign How does Groupon work for Merchants Sponsor your Campaign Affiliate Program Vendor Code of Conduct Company About Groupon Jobs Press Investor Relations Management Team Quick Links Treat Yourself Things To Do Coupons Gifts for Occasions © 2025 Groupon, Inc. All Rights Reserved. Terms and Conditions Privacy Statement Do Not Sell or Share My Personal Information Accessibility Sitemap Customer Support Licenses"
    }
  ]
}