{
  "fuentes": [
    {
      "url": "https://www.bricksmanitowoc.com/",
      "email": "office@bricksmanitowoc.com"
    },
    {
      "url": "https://www.jerseyshoreonline.com/brick/six-seek-seats-on-brick-school-board/",
      "email": "ariccardi@jerseyshoreonline.com"
    },
    {
      "url": "https://www.jerseyshoreonline.com/brick/six-seek-seats-on-brick-school-board/",
      "email": "news@jerseyshoreonline.com"
    },
    {
      "url": "http://brickhousetally.com/contact-us",
      "email": "info@brickhauspizza.com"
    },
    {
      "url": "http://brickhousetally.com/contact-us",
      "email": "info@brickhousetally.com"
    },
    {
      "url": "https://bricktopspub.com/",
      "email": "micah@micahrich.com"
    },
    {
      "url": "https://www.brickschools.org/",
      "email": "jgfroehrer@brickschools.org"
    },
    {
      "url": "https://www.jerseyshoreonline.com/brick/meet-the-candidates-seeking-seats-on-brick-school-board/",
      "email": "ariccardi@jerseyshoreonline.com"
    },
    {
      "url": "https://www.jerseyshoreonline.com/brick/meet-the-candidates-seeking-seats-on-brick-school-board/",
      "email": "news@jerseyshoreonline.com"
    }
  ],
  "mails": [
    "ariccardi@jerseyshoreonline.com",
    "info@brickhauspizza.com",
    "info@brickhousetally.com",
    "jgfroehrer@brickschools.org",
    "micah@micahrich.com",
    "news@jerseyshoreonline.com",
    "office@bricksmanitowoc.com"
  ],
  "nombre_sitio": "bricksgnv.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.bricksmanitowoc.com/",
      "text": "Gourmet Burgers | Brick's Downtown Bar & Grill | Manitowoc top of page HOME MENU Purchase Gift Cards CORNERSTONE LOUNGE ABOUT BRICK'S DBG APPLY CONTACT Shop More Use tab to navigate through the menu items. Parties Greater than 8, Please Call to Make Your Reservation *920.374.4570 Click       Here Phone MAKE RESERVATION Shop ORDER ONLINE Click        Here Star JOIN OUR LOYALTY PROGRAM Click         Here Welcome to Brick's Downtown Bar & Grill! ​ We are excited to share with you a savory dining experience featuring gourmet burgers in a recently renovated 1894 historic building. ​ Located at the corner of Washington Street and South 8th Street, our building is a cornerstone of the Historic Downtown Manitowoc district. Check Out Brick's Facebook Page! Contact ​ 939 South 8th Street Manitowoc, WI 54220 ​ 920-374-4570 ​ office@bricksmanitowoc.com Hours ​ Monday - Saturday 11:00 AM - 12:00 AM* Kitchen Open Monday-Wednesday 8 PM Thursday-Saturday 9 PM Sunday     Closed ​ © 2020 Brix Place LLC bottom of page"
    },
    {
      "url": "https://www.jerseyshoreonline.com/brick/six-seek-seats-on-brick-school-board/",
      "text": "Six Seek Seats On Brick School Board - Jersey Shore Online Facebook Instagram Linkedin Mail Twitter Youtube News Subscribe To Our Newsletter Ocean County Toms River Manchester Berkeley Brick Jackson Plumsted Southern Ocean Howell Monmouth County Sports Toms River Online Bricktown Online Newspapers Advertise Pay My Advertising Bill Classifieds Submit News Business Directory About Us Contact Search Home About Us Advertise Classifieds Submit News Contact Facebook Instagram Linkedin Mail Twitter Youtube Sign in Welcome! Log into your account your username your password Forgot your password? Get help Password recovery Recover your password your email A password will be e-mailed to you. Jersey Shore Online News Subscribe To Our Newsletter Ocean County Toms River Manchester Berkeley Brick Jackson Plumsted Southern Ocean Howell Monmouth County Sports Toms River Online Bricktown Online Newspapers Advertise Pay My Advertising Bill Classifieds Submit News Business Directory About Us Contact Home Brick Six Seek Seats On Brick School Board Brick Six Seek Seats On Brick School Board By Alyssa Riccardi - October 30, 2024 Facebook Twitter Pinterest WhatsApp Linkedin ReddIt Email Print Photo courtesy Pixabay BRICK – Brick Township residents will have the chance to choose between six candidates to fill three seats on the Board of Education in the November election. The Board of Education will be seeing big changes after this election season, as two incumbents are not seeking re-election – Board President Stephanie Wohlrab and member Nicole Siebert. Wohlrab was elected in 2015 and is currently completing her ninth year on the board. Siebert was elected to her first term in 2018 and is finishing her sixth year on the board. School board races are supposed to be nonpartisan, so the candidates aren’t referred to by their political party. Instead, they are allowed to have a short slogan after their name. Current member Victoria Pakala is seeking her fourth term on the board. She was first elected in 2015 and is running on the “Believe in Brick” slogan. She is joined by newcomers John Henry and Nancy Ellson Pakala worked as a special education teacher for about 25 years and is currently retired. She was an active PTA member who organized fundraisers, events, activities and chaired various PTA programs. Henry is a retired teacher from public education after 29 years. He worked for the New Jersey School Boards Association as the senior manager of their STEAM and Sustainable Jersey programs. He’s a member of Brick’s Green Team and former PTA member of the Collingswood School District. Ellson holds a Master’s of Science in Nursing and Post-Master’s degree – Psychiatric/MH Nurse Practitioner. She is a nurse practitioner. Under the “Common Sense 4Education” slogan, Greg J. Cohen, George Malgeri, and Georgia Lane-Hansen are seeking election. Cohen is director of transportation for the West Orange Public Schools and a former bus driver for the Brick Township Schools. Cohen has served as a member and was past president of Pioneer Hose Fire Company. He is also prior Vice President of American Legion Riders Post 348 Brick, and prior member of the father club at Midstreams School. Lane-Hansen is a retired educator and administrator, and Malgeri is a graduate student. The Brick Times reached out to this year’s candidates with the same questions requesting their thoughts and opinions on issues within the district. At the time of publication, Nancy Ellson, George Malgeri, and Georgia Lane-Hansen did not provide responses. What are biggest issues facing the district, and how do you plan on addressing them? Pakala : “The biggest issue facing Brick Schools today is adequate state funding for all of our public school programs, pre-K to 12. We must pressure Trenton to come up with a funding formula that provides students in Brick with a thorough and efficient education! I mean all students! Federal and NJ state laws mandate educational standards and programs that are grossly unfunded. Brick schools lost more than $22.2 million in state funding over seven years under S-2. I have been to Trenton and the State Department of Education to advocate for Brick students. I lobby legislators to express my concern for Brick. I will continue to do so. I encourage our Brick Schools superintendent, Dr. Thomas Farrell, to be a significant voice before the NJ Senate Education committee, the DOE and in our local area.” Henry : “From my understanding, a significant challenge of Brick schools is a shortfall of funding. There is no doubt, this has, and can continue to place a burden on the staff. I also know that given the circumstances, the board, administrators, teachers and parents are doing the best they can by working together to support student success.” “I would work collaboratively with other board members first, looking to see what has been done to date to secure adequate funding to continue programs in the school district. Also, to see what may be involved in advocating for increased state funding support. This could include reaching out to state officials to lobby with the assistance of NJ School Boards Association (NJSBA). I would also suggest looking into creating an educational foundation for Brick schools and investigate partnerships with local businesses and grants to see if creative funding solutions can occur through the foundation.” Cohen : “My priorities will focus on addressing reduced funding, promoting transparency, reducing class sizes, and supporting educators and students.” “I will advocate for increased funding from Trenton – not the taxpayers of Brick – to combat the impact of budget cuts on our schools. I will work to enhance communication between the administration, school board, parents, and the community. Everyone deserves to be informed about decisions and developments affecting our schools. I will prioritize initiatives to reduce class sizes to ensure that each student receives personalized attention. I will focus on providing our teachers with the resources they need while also promoting programs that support student well-being and academic success. Together, we can create a stronger educational experience for all in Brick Township.” Is there anything new that you would want to do for the schools? Pakala: “As it is, our students have a well-balanced choice of classes and programs to teach them, inspire them and challenge them. We provide many support programs for all our students, including those who have special needs and abilities. Brick offers more services today as far as pre-K, academic endeavors and social and emotional support for all students than it did nine years ago. As our student body continues to grow and diversify, I look forward to our curriculum offerings, sports programs and art education programs to expand and reach the interest of more students.” “I have served on many BOE committees and can attest to my commitment to negotiate generous and fair contracts for our staff.  Since I have served on the BOE, I have witnessed a huge commitment to teacher support, mentoring and professional development opportunities. This must be a priority for any future BOE member!” Henry: “Since I am not on the Board of Education as of yet, I am not completely familiar with every policy in Brick Schools. If elected, I would work with other board members so I can understand where my previous experiences in STEAM, sustainability, innovation and teaching design thinking can contribute or support to the excellent programs that already exist in Brick Schools.” “I support student centered learning and student innovation and creativity that promotes thinking outside the box. I would also like to see students having the opportunities to see a wide-range and to have a diverse understanding of career choice pathways from college, to career and technical and military.” “I believe that teachers are the backbone of the school district and a priority is for them to have the support and the tools necessary for all students to succeed. I would like to see what is being done and what can be accomplished given time constraints and funding shortfalls to improve teaching and learning. I know currently, parents are encouraged to attend board meetings and to openly communicate their concerns or suggestions. I would continue to support that parents do this more frequently and feel comfortable bringing their questions to the superintendent and to board meetings when they need further explanation.” “Being a survivor and now a thriver of cancer I learned a great deal about how emotional health is critical to surviving a life-threatening illness. Emotional health is also important for students’ academic achievement, so I would like to see what is currently being accomplished in the areas of Social and Emotional Learning (SEL) and perhaps bring a personal and unique perspective to SEL.” Cohen: “My vision for the Brick Township School District, addressing issues related to taxes, transparency, and classroom sizes will be at the forefront of our initiatives.” “I believe that clear communication about how taxpayer dollars are spent is essential. I would implement a comprehensive budget transparency program that provides detailed, easy-to-understand reports to the community. This would include regular updates on funding allocations, expenditures, and the impact of state funding cuts. To further enhance transparency, I propose hosting more community forums focused on the budget process. These forums would allow residents to voice their concerns and priorities regarding spending, providing valuable input that can help shape budget decisions. This collaborative approach can also empower parents and taxpayers to advocate for necessary resources, especially in light of reduced funding from Trenton.” “To maximize classroom efficiency and enhance learning experiences, I propose integrating technology that supports differentiated instruction. By leveraging digital tools, teachers can better manage larger classes and tailor lessons to meet diverse learning needs, helping to alleviate some of the challenges associated with larger classroom sizes. Establishing regular assessments to gauge the effectiveness of budget allocations and staffing decisions will ensure we are making informed choices. By focusing on these initiatives, we can create a more transparent, responsive, and effective educational environment in Brick Township.” Share Facebook Twitter Pinterest WhatsApp Linkedin ReddIt Email Print Previous article Concerns Shared Over Project: 2025 Next article Breast Cancer Walk Shines Light On Much Needed Research Alyssa Riccardi Alyssa Riccardi is a Reporter for Micromedia Publications/Jersey Shore Online. She holds a Bachelor’s Degree in Radio/TV/Film and Journalism from Rowan University. At school she enjoyed writing for her school’s paper and working on set of her school’s TV station. Mail RELATED ARTICLES MORE FROM AUTHOR No Charges In Brick Death Following Police Encounter Classic Cars Rolling Into Brick For Summer Cruise-In Facebook Ads Become Political Football In Brick Magician Casts A Spell On Crowd In Brick Brick Man’s Killer Sentenced To 30 Years Brick PBA Celebrates 20th Annual Car Show ABOUT US Micromedia Publications provides Jersey Shore News online, weekly newspapers, print & digital advertising for Ocean & Monmouth County. Reach us at 732-657-7344. Contact us: news@jerseyshoreonline.com FOLLOW US Facebook Instagram Linkedin Mail Twitter Youtube Home About Us Advertise Classifieds Submit News Contact © 2025 Micromedia Publications, Inc."
    },
    {
      "url": "http://brickhousetally.com/contact-us",
      "text": "Brick House Restaurant & Bar Welcome Menu Online Orders Welcome Menu Online Orders Online Orders Click here to place your order online through Toast. Order Online Top LOCATION Brick House Restaurant & Bar 402 W. College Ave Tallahassee, FL 32301 850-577-1230 HOURS OF OPERATION: Sunday : Closed Monday - Saturday: 12pm - 12am"
    },
    {
      "url": "https://bricktopspub.com/",
      "text": "Brick's Pub Great Food. Chill Vibes. WE ARE OPEN! Great Food. Chill Vibes. WE ARE OPEN! Great Food. Chill Vibes. WE ARE OPEN! Great Food. Chill Vibes. WE ARE OPEN! View Menu Dine In. Carry Out. Contactless Service. Dine In. Carry Out. Contactless Service. Dine In. Carry Out. Contactless Service. Dine In. Carry Out. Contactless Service. Dog Friendly Patio. COME SEE US! Dog Friendly Patio. COME SEE US! Dog Friendly Patio. COME SEE US! Dog Friendly Patio. COME SEE US! Brick’s Pub Brick’s Pub Brick’s Pub Brick’s Pub Brick’s Pub Brick’s Pub Brick’s Pub Brick’s Pub Home Menu Events About Us ORDER ONLINE More Home Menu Events About Us ORDER ONLINE Home Menu Events About Us ORDER ONLINE Photo Gallery Stay Connected Hungry? Order Now. Order Online Order Online Contact Us Questions. Comments. Ideas. Concerns Name Phone Email* Send This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Special Requests? Do you have dietary concerns? Questions about an upcoming event? Drop us a line, and we'll get back to you soon! Brick's Pub 1807 West Slaughter Lane, Austin #100, Texas 78748, United States 512.494.5239 Brickspub1@gmail.com Hours Mon 08:00 am – 10:00 pm Tue 08:00 am – 10:00 pm Wed 08:00 am – 10:00 pm Thu 08:00 am – 10:00 pm Fri 08:00 am – 12:00 am Sat 08:00 am – 12:00 am Sun 08:00 am – 10:00 pm Get directions What They're Saying Copyright © 2025 Brick's Pub - All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.brickschools.org/",
      "text": ""
    },
    {
      "url": "https://www.jerseyshoreonline.com/brick/meet-the-candidates-seeking-seats-on-brick-school-board/",
      "text": "Meet The Candidates Seeking Seats On Brick School Board - Jersey Shore Online Facebook Instagram Linkedin Mail Twitter Youtube News Subscribe To Our Newsletter Ocean County Toms River Manchester Berkeley Brick Jackson Plumsted Southern Ocean Howell Monmouth County Sports Toms River Online Bricktown Online Newspapers Advertise Pay My Advertising Bill Classifieds Submit News Business Directory About Us Contact Search Home About Us Advertise Classifieds Submit News Contact Facebook Instagram Linkedin Mail Twitter Youtube Sign in Welcome! Log into your account your username your password Forgot your password? Get help Password recovery Recover your password your email A password will be e-mailed to you. Jersey Shore Online News Subscribe To Our Newsletter Ocean County Toms River Manchester Berkeley Brick Jackson Plumsted Southern Ocean Howell Monmouth County Sports Toms River Online Bricktown Online Newspapers Advertise Pay My Advertising Bill Classifieds Submit News Business Directory About Us Contact Home Brick Meet The Candidates Seeking Seats On Brick School Board Brick Meet The Candidates Seeking Seats On Brick School Board By Alyssa Riccardi - October 16, 2023 Facebook Twitter Pinterest WhatsApp Linkedin ReddIt Email Print File Photo BRICK – Brick Township residents will have the chance to decide between four candidates to fill two seats on the Board of Education in the November election. School board races are supposed to be nonpartisan, so the candidates aren’t referred to by their political party. Instead, they are allowed to have a short slogan after their name. Alison Kennedy (Campaign Photo) Current members Alison Kennedy and Michael A. Blandina will be seeking re-election, while Mike Mesmer and Gregory J. Cohen will be coming in to fight for the two seats. Kennedy is a Main Office Secretary at Brielle Elementary School and has been a Brick Board of Education member since she was appointed to fill a vacancy in October 2022. She was the PTA President at Veterans Memorial Elementary school for four years. Prior to that she was the board secretary. Additionally, she belongs to the PTAs at VMES, VMMS as well as a member of the newly formed Brick Memorial PTSA. Blandina is retired from state employment and the owner of Total Package Party Planning & Events, LLC. He’s currently serving his first term on the Brick Board of Education and is currently serving on the Brick Township Municipal Utilities Authority. In the past, Blandina has served on the Brick Township Municipal Alliance Committee and Alcohol Drug Abuse and Youth Services as well as the Brick Township Property Maintenance Board. In addition, he’s been the Chairman of the Ocean County Columbus Day Parade Committee for more than 30 years. Michael Blandina (Campaign Photo) Mesmer is currently in senior management for Bracco Diagnostics, which is a healthcare company that specializes in radiology products. Although he has no previous experience in public office, he is seeking his first elected position on the Brick Board of Education as his son will soon be entering the school district. In addition, Mesmer is currently a Board Member for the Healthcare Materials Management Society of New Jersey where he holds the position Vice President, Education. Mike Mesmer (Campaign Photo) Cohen is currently the director of transportation for the West Orange School District. He previously was the Supervisor of Transportation for the Edison School District and also held the same position for the Moorestown School District. Cohen has no previous experience in public office, however he did serve as TWU Chairman while in the Brick School District and was the President of the non-certified supervisors of the Brick Board of Education. Cohen has served as a member and was past president of Pioneer Hose Fire Company. He is also a member of the American Legion and is very active with the Legion Riders. Gregory Cohen (Campaign Photo) What are biggest issues facing the district, and how do you plan on addressing them? Kennedy : “Our biggest issue the last few years has been funding. Since 2017, the Brick School District has been losing millions of dollars from their state funding. This has caused our class sizes to grow tremendously, some of our facilities projects to take a back seat, as well as a loss of staff. I plan to continue the work I’ve been a part of since before I became a BOE member in October 2022. I will continue to rally in Trenton. I will continue to call our legislators. I will continue to educate my friends and neighbors so that they too can join the fight against S-2 and be aware of what’s happening to our schools.” “Another issue that concerns me is the government trying to take control of our parental rights. I do believe the schools want the parents involved. I think the government is trying to prevent that involvement. I am currently the chair of the policy and planning committee. Our committee has worked very hard and spent many hours reading and researching, speaking to lawyers and advisors to make sure that our Brick Schools policies involve the parents! I will continue to advocate on behalf of the parents of Brick students to make sure we never lose our children to politics!” “Lastly, I feel that politics do not belong in our schools. Our children deserve the best of the best. Not what the right wants, or the left wants. What the children need should be the most important. I am not affiliated with any political party. My intentions are pure and true. I just want what’s best for the students, parents and community.” Blandina: “State Aid Cuts are the biggest issue facing our district, with more than $20 million cut from the district in the past six years. I have continually supported and urged others to support any bill coming out of the State Legislature in Trenton that restores Brick Township’s funding. We have a long way to go but must continually push the governor and legislature to give Brick Township our fair share of aid. They should restore what they took from us.” “Additionally, I am against state mandates and support home rule. I believe, we in Brick Township should be the ones deciding what is best for our children.” Mesmer: “There are many issues facing our district today. Three of the biggest include lack of transparency when it comes to parental rights, loss of school funding, and below-average test scores. I will work to ensure the Brick Board of Education has clear and transparent communication with parents when it comes to what our students will be taught. I will focus on providing parents with the information that can help drive successful decision making on future policies. We are still seeing many effects, both mentally and socially, from COVID learning loss. Brick must fight for fair funding while spending our money wisely based on data-driven and evidence-based decisions to ensure the available funds are providing the most benefit to our students.” Cohen: “I believe parents have a right to know everything that is going on with their children in school. There should be complete transparency with nothing hidden from parents. I hope to take the lead on pushing back on any mandates from Trenton and repealing any policies that do not acknowledge the primacy of parental rights.” “Another very important issue is the effects of the S-2 legislation which severely cut funding to the Brick School District. Our Brick Board of Education needs to work with other similarly affected districts and our local legislators to fight in Trenton to rectify the S-2 cuts. We need the parents and citizens of Brick to help in this effort after all its about putting our children first.” “The district’s transportation services are dysfunctional at the moment and dealing with serious issues such as a driver shortage, elimination of sport team buses, and children having to walk and cross hazardous streets. I will review the current transportation plan and budget to identify ways services can be improved while still being cost effective.” Is there anything new that you would want to do for the schools? Kennedy : “I want to continue working with our Policy & Planning committee to ensure that our parents are not written out of the script. While it is my responsibility to comply with the law, I want to continue to fight for local control at the state level. I do believe that united, our Brick community can achieve greatness. I will continue to work tirelessly to stay focused on Brick issues and not let national or state issues distract and divide our community. This is about our Brick families, our Brick faculty/staff and ultimately our Brick children.” “I want to continue this Board’s success in bringing stability to the administration of the district. I am excited to continue working with Dr. Farrell on the 5-year strategic plan for advancing the district.” Blandina: “ I would like to see the schools more involved with community events. My belief is that it would help make more rounded students and adults after graduation. Additionally, work to have more businesses and community organizations to be a part of school events. I would like to see more students remain in Brick Township after graduation and believe more community involvement at a younger age fosters a tighter community and increases the likelihood of students making Brick Township their permanent home.” “Two items close to my heart are the condition of our aging facilities and the security of the schools. I feel we have made progress over the past few years and must continue to do so. We need to finish replacing the ventilation systems as well as putting air conditioning into the remaining schools. In the world we live in, security of our school children and staff has become more challenging. Although we have made progress over several years, I feel more needs to be done to make our schools even more safe and secure.” Mesmer: “I will prioritize our children’s health, safety, and wellbeing in every decision made. I will advocate for parental involvement and would like to increase information sharing between the Board and parents so that there is clear understanding of what policies are being voted on and how it will impact the students of the district. We must come together as a community to stand up for what is right and prioritize a quality education for each and every child. There should be zero tolerance for bullying and parents need to be made aware of what is going on inside the schools. We need to promote a healthy lifestyle and mental wellbeing with counseling services available for children in need.” Cohen: “I want to bring common sense and transparency back to the Brick Board of Education. I will also work to increase the parent and citizen involvement in our schools most importantly at Board meetings. Board meeting agendas should be readily available at (and before) the Board meetings and should also contain sufficient explanation of the business being conducted. I will also support an environment where educators and staff will have the ability to speak their mind without fear of retribution. I want to truly place our children first.” Share Facebook Twitter Pinterest WhatsApp Linkedin ReddIt Email Print Previous article Bike, Scooter, & Skate Enthusiasts Celebrate Park Grand Opening Next article Virtual Math Class Concerns Parent Alyssa Riccardi Alyssa Riccardi is a Reporter for Micromedia Publications/Jersey Shore Online. She holds a Bachelor’s Degree in Radio/TV/Film and Journalism from Rowan University. At school she enjoyed writing for her school’s paper and working on set of her school’s TV station. Mail RELATED ARTICLES MORE FROM AUTHOR No Charges In Brick Death Following Police Encounter Classic Cars Rolling Into Brick For Summer Cruise-In Facebook Ads Become Political Football In Brick Magician Casts A Spell On Crowd In Brick Brick Man’s Killer Sentenced To 30 Years Brick PBA Celebrates 20th Annual Car Show ABOUT US Micromedia Publications provides Jersey Shore News online, weekly newspapers, print & digital advertising for Ocean & Monmouth County. Reach us at 732-657-7344. Contact us: news@jerseyshoreonline.com FOLLOW US Facebook Instagram Linkedin Mail Twitter Youtube Home About Us Advertise Classifieds Submit News Contact © 2025 Micromedia Publications, Inc."
    }
  ]
}