{
  "query": "brimstonewoodfiregrill.com contact",
  "fuentes": [
    {
      "url": "https://brimstonewoodfiregrill.com/privacy-policy/",
      "email": "info@brgconcepts.com"
    },
    {
      "url": "https://sfbwmag.com/fire-brimstone/",
      "email": "sfbw-logo-2023-100x50-v6-@2x.png"
    },
    {
      "url": "https://sfbwmag.com/fire-brimstone/",
      "email": "info@sfbwmag.com"
    }
  ],
  "mails": [
    "sfbw-logo-2023-100x50-v6-@2x.png",
    "info@sfbwmag.com",
    "info@brgconcepts.com"
  ],
  "nombre_sitio": "brimstonewoodfiregrill.com",
  "origen_extraccion": "Busqueda externa paso: contact",
  "textos_fuente": [
    {
      "url": "https://brimstonewoodfiregrill.com/privacy-policy/",
      "text": "Privacy Policy | Brimstone Woodfire Grill Skip to content October is Breast Cancer Awareness Month. Drink Pink! & we’ll donate $1 towards Breast Cancer Research. Learn More. Home Menus Meetings + Private Events Our Story Gift Cards Upcoming Events Get Directions Blog Privacy Policy Last Updated: November 14th, 2023 Brimstone Woodfire Grill takes seriously the confidentiality of your personal information. The following Privacy Policy sets forth our information gathering and dissemination practices for this website. BY ACCESSING OR USING THIS WEBSITE, YOU HEREBY AGREE TO THE TERMS OF THIS PRIVACY POLICY AND CONSENT TO THE COLLECTION AND USE OF INFORMATION AS DISCUSSED IN THIS PRIVACY POLICY. IF YOU DO NOT AGREE TO THE TERMS OF THIS PRIVACY POLICY, DO NOT ACCESS THIS WEBSITE. AMENDMENTS We may modify or amend this Privacy Policy at any time, which changes will be effective immediately upon their posting on this website. Material changes will be posted conspicuously on this website. Users will be notified of any updates via email. NON-US USERS Brimstone Woodfire Grill IS A FLORIDA LIMITED LIABILITY COMPANY AND THE PRODUCTS AND SERVICES ARE PROVIDED BY Brimstone Woodfire Grill ARE BASED IN THE UNITED STATES. THE PERSONAL INFORMATION THAT YOU PROVIDE WILL BE TRANSFERRED TO AND MAINTAINED IN Brimstone Woodfire Grill RECORDS IN THE UNITED STATES. IF YOU DO NOT CONSENT TO THIS TRANSFER, DO NOT ACCEPT THIS PRIVACY POLICY OR OTHERWISE USE THE WEBSITE. OWNERSHIP Brimstone Woodfire Grill maintains full rights to any information collected on this website, and may freely collect, use and disclose such information unless prohibited by this Privacy Policy or applicable law. In the event of a change in control, reorganization, merger or sale by Brimstone Woodfire Grill of assets, any information owned by or in the control of Brimstone Woodfire Grill may be transferred to such Brimstone Woodfire Grill successor, who will comply with the terms of this Privacy Policy. Personally Identifiable Information – what we collect and how we use it and share it. You may visit this website without disclosing any personally identifiable information. The only times we will collect personally identifiable information from you are if you request to receive our email newsletter, sign up for a loyalty program (eBites), you make an online purchase, or you request to receive more information from us. Brimstone Woodfire Grill may collect any content, record, or electronic communication of any kind that you provide to us, whether in the course of placing an order or otherwise requesting information. This information may include your (1) contact information (name, telephone number, physical address, email address), (2) shipping information, (3) payment information, and (4) other personal information required so that we may provide you with the information or services that you request. You may choose to submit additional information, which we will collect if you choose to provide it. We may use this information so that we may communicate with you with respect to your request and to send you the information and materials you request. You may also request to receive additional communications from Brimstone Woodfire Grill for marketing and other purposes communicated to you. If you choose to request such communications, we will use your personally identifiable information for the purpose indicated. If you choose to opt-out of any such communications, you may do so at any time and without penalty by clicking on the “opt-out” link at the bottom of any email you receive from us. We do not sell, rent or loan any of your personally identifiable information to any third party. However, we may use and share information with those persons and third-party vendors specifically involved in the processing of your payment or your request to receive information or services from Brimstone Woodfire Grill. These entities consist of our payment processor and digital marketing company’s assets, as well as our hosting providers and other information technology service providers. In addition, Brimstone Woodfire Grill reserves the right to use and share your information in the event Brimstone Woodfire Grill believes doing so is necessary to operate this website or where such disclosure may be required by law, or to protect Brimstone Woodfire Grill right or the rights of others Non-Personally Identifiable Information – what we collect and how we use it and share it. When you browse our website, you are able to do so anonymously. However, we may passively collect anonymous information when you are on our website. Analytics Like many websites, we use a third party service provider, such as Google Analytics, to collect information about your use of our website. We track data about traffic to our website and your visit to and experience on our website, which information we use to improve our website structure and content. Cookies Brimstone Woodfire Grill may use cookies to track the use of our website and to facilitate and enhance your experience on our website. “Cookies” are small pieces of information that are stored by your browser on your computer’s hard drive. Our cookies enable us to facilitate access to different aspects of our website. For example, by showing when and how you and others visit our website, cookies help us to see which pages of the website are popular and which are not. Cookies can also help us to improve your enjoyment of this website, for example, by remembering your address or other personal information when you request information or services on the website. These may also be used for remarketing purposes, such as to serve up banner ads to you as you use the Internet, as further set forth below. Most web browsers automatically accept cookies, but you can disable this function so that your browser will not accept cookies. Please be aware that disabling this function may impact your use and enjoyment of this website. Please note that if you clear your cookies after your visit, such as to discontinue receiving or viewing our banner ads as you use the Internet, our website will place a new cookie on your browser if you revisit our website at a later date. Web Beacons Web beacons (also known as clear gifs, pixel tags or web bugs) are tiny graphics with a unique identifier, similar in function to cookies, which are used to track the online movements of web users or to access cookies. Unlike cookies, which are stored on the user’s computer hard drive, web beacons are embedded invisibly on the web pages (or in e-mail) and are about the size of the period at the end of this sentence. Web beacons may be used to deliver or communicate with cookies, to count users who have visited certain pages and to understand usage patterns. These web beacons may belong to us or our third party marketing and analytics vendors and service providers. IP Addresses Brimstone Woodfire Grill logs IP addresses for systems administration purposes. IP addresses are not used to track a user’s session. This information only helps us determine how often different areas of our site are visited. We do not link IP address to any information that is personally identifiable. AGGREGATED INFORMATION Brimstone Woodfire Grill maintains full rights to any information collected on this website, and may freely collect, use and disclose such information unless prohibited by this Privacy Policy. In addition, we may take personally identifiable information you provide to us and aggregate it with information of other users and customers such that the data no longer identifies you. We may use aggregated information that does not uniquely identify you when it enables us to improve and enrich our services and website content. RETARGETING THIRD PARTY AD NETWORKS AND BEHAVIORAL ADVERTISING As you browse our website, advertising cookies will be placed on your computer so that we can understand what you are interested in. Our display advertising partner, AdRoll, then enables us to present you with retargeting advertising on other sites based on your previous interaction with our website. The techniques our partners employ do not collect personal information such as your name, email address, postal address or telephone number. You can visit WWW.NETWORKADVERTISING.ORG/CHOICES/ to opt out of AdRoll and their partners’ targeted advertising. We contract with service providers to serve ads on our behalf across the Internet. They will collect anonymous information about your visits to our web site, and your interaction with our products and services. They may also use information about your visits to this website to target advertisements for goods and services. These targeted advertisements may appear on other websites that you visit as you browse the Internet. Opting out will not in any way affect your use of our website. CREDIT CARD INFORMATION We do not process credit card information for payment for any products or services you may order from this website. Brimstone Woodfire Grill contracts with a third party service provider that complies with the payment card industry data security standards (PCI DSS) to collect and process your credit card information. We do not store or maintain any credit card information. ACCESS BY CHILDREN This website is not directed toward children under 13 years of age and Brimstone Woodfire Grill does not knowingly collect or use information from children under 13 through this website. SECURITY We limit access to personally identifiable information about you to our employees and third-party service providers who we reasonably believe need to have access to your information to provide you with the information or services you request from Brimstone Woodfire Grill. This website has security measures in place to help protect against the loss, misuse and alteration of the information under our control. While we cannot guarantee that loss, misuse or alteration to data will not occur, Brimstone Woodfire Grill uses industry standards, such as Secure Socket Layers (“SSL”) technology, to help safeguard against such occurrences. In certain areas, the information passed between your browser and our system is encrypted with SSL technology to create a protected connection between you and our website to ensure confidentiality. In the event that a breach into our security systems occurs and there is a possibility that an unauthorized person acquires your personal information, Brimstone Woodfire Grill will notify you of such a breach to the extent required under applicable law. Access to Your Personal Information You may request that we update your personal information or correct any factual errors that you believe may exist regarding this information by updating your profile on eBites. THIRD-PARTY WEBSITES This website may link to, or be linked to, other websites not maintained by or related to Brimstone Woodfire Grill. Brimstone Woodfire Grill is not responsible for the privacy policies or practices of any third parties or third-party websites, including any linked or linking websites. To the extent that you disclose personally identifiable information to any such third parties, different rules may apply to their use and disclosure of personal information that you disclose to them. We encourage you to review the privacy policies of such websites before disclosing your personal information to them. DO NOT TRACK We will automatically collect cookies and other non-personally identifying information when you visit this site. Due to this automatic collection, we currently do not have the technical capability to complete do not track requests and therefore cannot honor them at this time. CHOICE AND CONTROL In order to provide service to you, we may send you communications related to your transactions, security, or the administration of this website. From time to time, we may also send you other messages or updates about Brimstone Woodfire Grill, our website, and promotions or other activities. If you do not wish to receive non-transaction/security related communications from Brimstone Woodfire Grill, you may opt-out by clicking the “unsubscribe” link in the communication or contact us where specified in the “Contact Us” link on this website. Please note that if you opt out of receiving communications from us, we may still send you service communications. PRIVACY RIGHTS If you are a California resident, you have rights in relation to your Personal Information; however, your rights are subject to certain exceptions. For instance, we cannot disclose specific pieces of Personal Information if the disclosure would create a substantial, articulable, and unreasonable risk to the security of the Personal Information, your account with us or the security of our network systems. Right Against Discrimination. You have the right not to be discriminated against for exercising any of the rights described in this section. We will not discriminate against you for exercising your right to know, delete or opt-out of sales. Right to Know. You have the right to request in writing: (i) a list of the categories of Personal Information, such as name, address, email address, that a business has disclosed to third-parties during the immediately preceding calendar year for the third-parties’ direct marketing purposes, and (ii) the names and addresses of all such third-parties. In addition, you have the right to request: (i) the categories of Personal Information we have collected about you, (ii) the categories of sources from which Personal Information is collected, (iii) the business or commercial purpose for the information collection, (iv) the categories of third-parties with whom we have shared Personal Information, and (v) the specific pieces of Personal Information we hold about an individual. You have the right to request a copy of the specific Personal Information we collected about you during the 12 months before your request. Right to Delete. You have the right to request us delete any Personal Information we have collected from you or maintain about you, subject to certain exceptions. To assert your right to know or your right to delete your Personal Information, please contact as provided in the statement below. To verify your identity, we may ask you to verify Personal Information we already have on file for you. If we cannot verify your identity from the information we have on file, we may request additional information from you, which we will only use to verify your identity, and for security or fraud-prevention purposes. In addition, California Civil Code Section 1798.83 permits customers of Brimstone Woodfire Grill who are California residents to request certain information regarding our disclosure of Personal Information to third-parties for their direct marketing purposes. In your request, please specify that you want a “Brimstone Woodfire Grill Privacy Rights Notice.” Please allow 30 days for a response. To make such a request, please call us at 954.430.2333 or write us at: 14575 SW 5th Street Pembroke Pines, FL 33027 UPDATES TO THIS POLICY We may update this Privacy Policy from time to time and make changes to information previously collected, as permitted by law. If we make material changes, we will post the updated Privacy Policy on this page with a “Updated” effective date of the revisions. We encourage you to look for updates and changes to this Privacy Policy by checking this date when you access our websites and mobile applications. CONTACTING US If you have any questions or concerns regarding this Privacy Policy, please contact us at info@brgconcepts.com . Located Inside Shops at Pembroke Gardens 14575 SW 5th Street Pembroke Pines, FL 33027 Phone 954.430.2333 Event Inquiries Submit Here Privacy Policy Opt-Out Preferences Manage Cookie Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent"
    },
    {
      "url": "https://sfbwmag.com/fire-brimstone/",
      "text": "The Fire at Brimstone - S. Florida Business & Wealth Lifestyle Magazine Digital Magazine Skip to content Main Navigation S. Florida Business & Wealth Search for: Sections Calendar Community Event Calendar Submit an event Cruise Corner Editor’s Choice Editor’s Choice Profiles Great Places and Spaces Events Event Recap Apogee Awards CEO Connect CEO Connect: Women of Influence Diversity & Inclusion Awards HR Awards Prestigious Women Awards Industries Aviation Banking & Financial Advice Cars, Boats & Toys Dining Education & Philanthropy Entrepreneurs & Business Strategy Health Care & Wellness Industry Superstars Interior Design, Art & Architecture Law/Professional Services Marine Real Estate Retail Technology Travel & Recreation Local Buzz One Liners Broward Miami Dade Palm Beach Signature Events ALL EVENTS S. Florida Legal Guide Browse the Legal Guide Listing Update Your Listing Sponsored Content Sponsored Content The Good Life Thought Leadership Commercial Real Estate Tips From Marcus & Millichap Financial Insights | First American Bank Webinars Web Extras About SFBW Advertising With Us Contact Us Digital Magazines Meet The Team Subscribe Social Media Connect Our Other Brands South Florida Business & Wealth Subscribe Header Navigation Editor’s Choice Signature Events Upcoming Events Event Highlights Excellence in Human Resources 2025 Apogee Awards Diversity & Inclusion Awards Prestigious Women Awards Up & Comer Awards Industries Dining Travel & Recreation Real Estate Entrepreneurs & Business Strategy Industry Superstars Banking & Financial Advice Health Care & Wellness Interior Design, Art & Architecture Cars, Boats & Toys Retail Education & Philanthropy Law & Professional Services Technology Thought Leadership Financial Insights | First American Bank Commercial Real Estate Tips From Marcus & Millichap Calendar Community Event Calendar Submit an Event Webinars About Us Contact Us Meet The Team Advertise with SFBW Stocks Ticker Editor's Choice The Fire at Brimstone July 8, 2014 | SFBW Staff If you are at all familiar with the South Florida food scene, you provably have heard of restaurants like Grille 401 on Las Olas Boulevard, Brimstone Woodfire Grill in Pembroke Gardens or Piñon Grill in Boca Raton. These restaurants are not only hot spots for dining, but are all owned by Brimstone WFG Holding Co., which is emerging as one of South Florida’s leading restaurant groups. Brimstone is a subsidiary of Jeffrey R. Anderson Real Estate Inc., a family-owned real estate development company based in Cincinnati. J.R. Anderson, Vice President of Development said the company’s decision to open in South Florida was real estate driven yet influenced by their appetite for good cuisine. �We are developers at heart, but my father (Jeffrey R. Anderson) has a background in the restaurant industry and food is something we are very passionate about,” says J.R. Anderson, Vice President of Development for Jeffrey R. Anderson Real Estate. Brimstone opened its first restaurant in South Florida, Brimstone Woodfire Grill, in September of 2008 in the upscale shopping center of Shops at Pembroke Gardens, which the real estate company also owns. Piñon Grill in Boca Raton followed in November of 2010, and then Grille 401 on Las Olas Boulevard, which rapidly emerged as a power dining spot for the business crowd. Notably, it has succeeded in a space where Zucca Pasta “N Grill, Riley McDermott’s, Bova Prime and Rare Las Olas didn’t last all that long. �We are dedicated to doing a few things really well, and there is a core menu in all of our restaurants that will have a familiar feel for anyone who has dined in any of our establishments,” Andy Fox, Director of Operations for Brimstone. Each of Brimstone WFG’s restaurants has a unique feel, but there are trademark elements that encompass all of the restaurants. Beyond having menus that appeal to almost everyone, each of Brimstone’s South Florida restaurants have been designed to capitalize on South Florida’s world famous weather with outside dining. Initially, Brimstone Woodfire Grill was the only restaurant to have an outdoor space along with live entertainment Thursday through Saturday. Eventually, there was an opportunity to add a sushi bar and develop an outdoor space for Grille 401, a move that has transformed the look and feel of the restaurant. The outdoor space at Piñon Grill was completed in February.  The new expansion features a 16-seat bar and patio with 10 tables and provides Boca with a refined energetic bar that takes advantage of South Florida’s beauty and scenery. There is no doubt that Brimstone WFG Holding Company’s restaurants have become staples in South Florida, and the company is looking at a fast-casual concept and other neighborhoods for further expansion in the region. ? About Brimstone Brimstone WFG Holding Co. is a national restaurant group and a subsidiary of Jeffrey R. Anderson Real Estate, a commercial real estate development company based in Cincinnati. WFG Holding Company’s South Florida locations include several restaurants serving new American cuisine: ” Grille 401, 401 E. Las Olas Blvd., Fort Lauderdale, www.grille401.com, 954.767.0222 ” Brimstone Woodfire Grill, Shops of Pembroke Gardens, 14575 SW 5th St., Pembroke Pines, www.brimstonewoodfiregrill.com, 954.430.2333 ” Piñon Grill, The Terrace at Town Center, 6000 Glades Rd., Boca Raton, www.pinongrill.com, 561.391.7770 Print Share Share on Facebook Share on Twitter Share on LinkedIn Share on Pinterest Tags: Kyle W. Ankney You May Also Like The Great Translator July 8, 2014 NEW SOUTH FLORIDA July 8, 2014 South Florida’s Big Lifesaver July 8, 2014 Meet the Willy Wonka of South Florida July 10, 2014 Latest PRNEWS Relocates U.S. Headquarters to Miami Sep 12, 2025 Blancpain Shrinks an Icon Sep 9, 2025 Broward County Finally Goes Virtual Sep 9, 2025 Awards & Events Beyond the Role Sep 9, 2025 Latest Issue READ LATEST ISSUE MAGAZINE ARCHIVE More Editor's Choice Posts Comvest Partners Targets Opportunities In Health Care July 8, 2014 | SFBW Staff What types of companies do you invest in and why? We invest in lower middle market companies where we see opportunities for operational improvements and growth. We invest in sectors Read More The Big Squeeze August 28, 2014 | SFBW Staff Uncertainty is the watchword for South Florida’s community banks as they grapple with the banking reform regulations resulting from the Dodd-Frank Act. Dodd-Frank already has more than 5,000 pages of Read More Live with John Kanas July 8, 2014 | SFBW Staff John Kanas burst onto the business scene in South Florida as part of an investment team that took over the remnants of BankUnited after it was seized by regulators during Read More The Latest Financial Gold Rush: Crowdfunding July 8, 2014 | SFBW Staff Crowdfunding is one of the hottest words in finance these days – unfortunately Florida risks turning into a laggard. A panel on crowdfunding drew, well, a crowd at the eMerge Read More Other Posts Executive Fashion July 8, 2014 | SFBW Staff Who: Kim Cagiano  What: Senior Vice President, Director of Sales and Marketing  Where: SunTrust Bank  Banking attire used to be ultra conservative, but acceptable office wear has become more fashion Read More Gestational Surrogacy:  Putting Our Buns In Her Oven July 8, 2014 | SFBW Staff I was under the impression that once you decide to start a family, you toss the birth control and give it the “old college try.” BAM! There you are in Read More South Florida’s Big Lifesaver August 28, 2014 | SFBW Staff The disappearance of Malaysia Airlines Flight 370 shows how difficult searches can be, but making them easier is a daily job at one of the oldest manufacturers in South Florida. Read More Miami’s trade decreases 5.32% July 8, 2014 | SFBW Staff Total U.S. trade was up 2.79% through May, but trade in South Florida was down 5.32%, according to Coral Gables-based WorldCity, which crunched Census Bureau Data. A continuing factor in Read More Editor’s Choice Sponsored Advertising with SFBW Company South Florida Business & Wealth (SFBW) is South Florida’s premier business and lifestyle magazine serving Miami-Dade, Broward and Palm Beach counties. From the corner suite, to the worlds of wealth management and philanthropy, to the finer things (real estate, travel, auto, yachts, design), SFBW is your curated guide to aiming higher and living well. Read More… 3200 N. Federal Highway Suite 228 Boca Raton, FL 33431 (954) 601-3979 info@sfbwmag.com About SFBW Contact SFBW Advertise with SFBW Latest Digital Edition View All Editions Subscribe Email Address Email This field is for validation purposes and should be left unchanged. Social Connect"
    }
  ]
}