{
  "fuentes": [
    {
      "url": "https://www.britishopenpub.com/contact-british-open-pub/",
      "email": "admin@britishopenpub.com"
    },
    {
      "url": "https://www.britishopenpub.com/contact-british-open-pub/",
      "email": "catering@britishopenpub.com"
    },
    {
      "url": "https://www.britishopenpub.com/menus/",
      "email": "catering@britishopenpub.com"
    },
    {
      "url": "https://inzmo.com/deu/en/contact",
      "email": "info@inzmo.com"
    },
    {
      "url": "https://www.morningadvertiser.co.uk/Article/2024/02/23/Who-is-in-charge-at-the-UK-s-biggest-pub-companies/",
      "email": "rebecca.weller@wrbm.com"
    },
    {
      "url": "https://beerandpub.com/about-us/",
      "email": "contact@beerandpub.com"
    },
    {
      "url": "https://www.quora.com/Why-are-the-owners-of-British-pubs-called-landlords",
      "email": "jo@samaritans.org"
    },
    {
      "url": "https://www.britishopenpub.com/catering/",
      "email": "catering@britishopenpub.com"
    },
    {
      "url": "https://theyorknorwich.co.uk/about-us/",
      "email": "btn-arrow-hover@2x.png"
    },
    {
      "url": "https://theyorknorwich.co.uk/about-us/",
      "email": "btn-arrow-normal@2x.png"
    },
    {
      "url": "https://theyorknorwich.co.uk/about-us/",
      "email": "facebook-down@2x.png"
    },
    {
      "url": "https://theyorknorwich.co.uk/about-us/",
      "email": "facebook-normal@2x.png"
    },
    {
      "url": "https://theyorknorwich.co.uk/about-us/",
      "email": "insta-down@2x.png"
    },
    {
      "url": "https://theyorknorwich.co.uk/about-us/",
      "email": "insta-normal@2x.png"
    },
    {
      "url": "https://theyorknorwich.co.uk/about-us/",
      "email": "twitter-down@2x.png"
    },
    {
      "url": "https://theyorknorwich.co.uk/about-us/",
      "email": "twitter-normal@2x.png"
    },
    {
      "url": "https://www.britishopenpub.com/about-the-british-open-pub/",
      "email": "catering@britishopenpub.com"
    },
    {
      "url": "https://www.britishfuture.org/about-us/who-we-are/",
      "email": "info@britishfuture.org"
    },
    {
      "url": "https://www.britishfuture.org/about-us/who-we-are/",
      "email": "steve@britishfuture.org"
    },
    {
      "url": "https://bestofbritishpub.com/",
      "email": "team@latofonts.com"
    },
    {
      "url": "https://www.britishopenpub.com/events-at-british-open-pub/",
      "email": "catering@britishopenpub.com"
    },
    {
      "url": "https://www.thepunteroxford.co.uk/contactus",
      "email": "reservations@thepunteroxford.co.uk"
    },
    {
      "url": "https://www.mnsi.org.uk/contact-page/",
      "email": "enquiries@mnsi.org.uk"
    },
    {
      "url": "https://www.mnsi.org.uk/contact-page/",
      "email": "enquiries@mnsi.org.uk"
    },
    {
      "url": "https://www.britishopenpub.com/",
      "email": "catering@britishopenpub.com"
    }
  ],
  "mails": [
    "admin@britishopenpub.com",
    "btn-arrow-hover@2x.png",
    "btn-arrow-normal@2x.png",
    "catering@britishopenpub.com",
    "contact@beerandpub.com",
    "enquiries@mnsi.org.uk",
    "facebook-down@2x.png",
    "facebook-normal@2x.png",
    "info@britishfuture.org",
    "info@inzmo.com",
    "insta-down@2x.png",
    "insta-normal@2x.png",
    "jo@samaritans.org",
    "rebecca.weller@wrbm.com",
    "reservations@thepunteroxford.co.uk",
    "steve@britishfuture.org",
    "team@latofonts.com",
    "twitter-down@2x.png",
    "twitter-normal@2x.png"
  ],
  "nombre_sitio": "britishopenpub.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.britishopenpub.com/contact-british-open-pub/",
      "text": "Contact The British Open Pub - The British Open Pub click here to ORDER NOW Menus Events About Us Gift Cards Contact Order Now Order Catering Menus Events About Us Gift Cards Contact Order Now Order Catering Questions, comments, or need assistance with placing an order? Reach out to us!  941-492-9227  admin@britishopenpub.com  367 Jacaranda Blvd., Venice, FL 34292 Hours Sun-Wed: 11AM to 10PM Thurs: 11AM to 11PM Fri & Sat: 11AM to 12AM Brunch Sun: 11AM to 2PM Happy Hour Daily: 11AM to 6PM. Location 367 Jacaranda Boulevard Venice, FL 34292 Contact us 941.492.9227 catering@britishopenpub.com Follow Follow Join Our Rewards Program Sign up for savings and rewards! SIgn Up Join Our Rewards Program Sign up for savings and rewards! SIgn Up ® 2025 The British Open Pub Privacy Policy"
    },
    {
      "url": "https://www.britishopenpub.com/menus/",
      "text": "Menus - The British Open Pub - The British Open Pub click here to ORDER NOW Menus Events About Us Gift Cards Contact Order Now Order Catering Menus Events About Us Gift Cards Contact Order Now Order Catering  UPDATED MENU COMING SOON! Please feel free to navigate through our Menus. HAPPY HOUR 11-6pm Everyday! Excludes holidays $2 OFF ALL HOUSE WINES $2 OFF SINGLE LIQUOR WELL DRINKS excludes margaritas, martinis, etc $1 OFF NON-ROTATING BEERS TEE-OFF Shrimp Stack A light and fresh stack of chilled shrimp, avocado, and mango salsa drizzled with remoulade aioli Sausage Rolls English sausage wrapped in flaky pastry Rings & Shrooms Beer battered onion rings and button mushrooms Poutine Our English chips topped with fried cheese curds and smothered in brown gravy Big Bavarian Pretzel A plate sized pretzel accompanied by beer cheese for dipping Scotch Eggs *pub favorite Hard boiled eggs wrapped in English sausage and breaded Pub Flat Breads *pub favorite Bacon & Avocado Flatbread drizzled in balsamic glaze Buffalo Chicken Flatbread with homemade ranch dressing Brie and Green Apple Flatbread with Melba drizzle and almonds Gaelic Rolls *pub favorite Tender homecooked corned beef blended with fresh cabbage and swiss cheese, tucked into a pub sized egg roll and served with creamy mustard sauce Crispers Home-made potato chips served with ranch for dipping Pub Nachos Our crispers smothered with melted cheese, tomatoes, scallions, and jalapeno ranch sauce *Top ‘em with chicken, chili, or sriracha bourbon pork Chicken Tenders Hand breaded juicy chicken tenderloins with ranch for dipping Chicken Wings Your choice of: Mild • Medium • Hot • Hot Honey Garlic • Jameson BBQ Sauce Served with celery and ranch or blue cheese (6) • (12) • (18) BRITISH FAVORITES Squire John’s Fish & Chips *pub favorite The pride and joy of the British Open! A generous portion of North Atlantic cod fried in a light beer batter, baked or blackened — Available in Regular Portion or Light Portion Liver & Onions Tender beef liver, sautéed with onions, topped with bacon, accompanied with smashed potatoes and covered with a light brown gravy — Available in Regular Portion or Light Portion Proper British Cod Cakes Tender North Atlantic Cod poached and blended with Yukon Gold Mashed potatoes, seasoning and spices and panko bread crumbs and then pan fried Bangers & Mash English style pork sausages served with sautéed onions, smashed potatoes & brown gravy — Available in Regular Portion or Light Portion Pub Steak Black Gold Espresso rubbed certified angus beef teres major seared and served with a bourbon butter sauce, accompanied by mashed potatoes Corned Beef & Cabbage *pub favorite Hand sliced home-cooked corned beef accompanied by sautéed shredded cabbage and smashed potato FROM OUR KETTLES Monday Cream of Mushroom Tuesday Tomato Bisque Wednesday Split Pea with Ham Thursday Chicken & Rice Friday Clam Chowder Weekends Chef ’s Choice Everyday Beef & Bean Chili French Onion PUB PIES, PASTIES & WELLINGTONS Cottage Pie Or as Grandma called it – Shepherd’s Pie. Ground beef, peas, carrots & onions topped with smashed potatoes and melted cheese Regular Portion Light Portion Chicken & Mushroom Pie An old favorite . . . tender pieces of chicken breast and mushrooms cooked in cream sauce, topped off with flaky pastry Veggie Pie Edamame, broccoli, corn, red peppers, carrots & mushrooms cooked in cream sauce topped off with flaky pastry Steak & Ale Pie Tender chunks of slow cooked prime rib, button mushrooms and a brown ale gravy topped off with flaky pastry Cornish Pastie *pub favorite Ground beef, onions, potatoes, peas and carrots wrapped in flaky pastry Chicken & Broccoli Pastie Chicken, broccoli and cheese wrapped in flaky pastry Prime Rib Pastie Shaved prime rib with cheese wrapped in flaky pastry Meatloaf Wellington *pub favorite Our homemade meatloaf, wrapped in puff pastry, sliced, grilled, topped with mushrooms and brown gravy, accompanied by smashed potatoes FAIRWAY SPECIALS Yankee Pot Roast Tender, mouth-watering roast beef with smashed potatoes and served with jardinière sauce Prime Rib of Beef *pub favorite A hearty-sized cut served with smashed potatoes and au jus Add (5) Shrimp | Add Crab Cake Creamy Garlic Salmon Sautéed Salmon filet over Yukon mashed potatoes and sautéed spinach finished with creamy lemon-garlic sauce. Chicken & Chips Hand breaded juicy chicken tenderloins with chips and your choice of chicken gravy or ranch for dipping Fettuccine Alfredo Our mascot’s favorite — Large shrimp sautéed with spinach, tomatoes, peas, onions and roasted red peppers, finished with a creamy garlic sauce over fettuccine Shrimp & Chips *pub favorite Hand breaded, grilled or blackened shrimp & English chips Almond Crusted Baked Scrod Tender scrod lightly coated with almonds and panko breadcrumbs, topped with a creamy garlic sauce and served with mashed potatoes HANDHELDS Served with choice of English Chips, Crispers or Coleslaw. Subs may be an additional cost. Pretzel Bun or Gluten Free Burger Bun Chicken Club Grilled chicken topped with avocado, bacon, pickled red onions, HP aioli, lettuce and tomato on grilled sourdough bread Corned Beef Reuben Hand cut corned beef brisket, sauerkraut, thousand island dressing and swiss cheese on grilled marble rye bread Barron’s Prime Rib Bomber *pub favorite Shaved prime rib, onions and mushrooms with your choice of cheese on a toasted hoagie roll with au jus Sriracha Bourbon Pork Sandwich Pulled pork piled high tossed in sriracha bourbon sauce and topped with a scoop of coleslaw Fish Sandwich Fried, baked or blackened cod served with lettuce and tomato, on a hoagie roll Bacon Brie LT *pub favorite Our twist on the BLT adds melted brie cheese and mayo to the usual suspects on a crispy baguette Pub Style Chicken Salad Homemade chicken salad atop lettuce, tomato and a toasted pretzel bun. Or make it traditional on white, wheat or marble rye! Ranch House Chicken Sandwich Fried chicken topped with bacon and sliced brie on a pretzel bun, drizzled with ranch dressing Vegetarian Reuben (vegetarian) Marinated and sliced portobello mushroom, sauerkraut, and Swiss cheese on grilled rye bread with 1000 island dressing Bourbon Bacon Burger What a mouthful!!!! Bourbon glazed premium blended burger topped with bacon, Havarti cheese, onion straws and HP aioli on top of a grilled Pretzel Bun BOP Patty Melt Our specially blended burger on rye bread with sautéed onions, Swiss cheese and HP aioli Build Your Own Burger An exceptional blend of ground chuck, brisket and short rib served on a brioche bun Load It Your Way American cheese, cheddar, swiss, provolone, sautéed onions, sautéed mushrooms Smoked cheddar, smoked gouda, brie sauce, blue cheese, bacon, fried egg, portabello ON THE GREEN Dressings: Ranch, Bleu Cheese, Honey Mustard, Oil & Vinegar, Thousand Island, Balsamic Vinaigrette, Raspberry Vinaigrette Ceasar Salad Our secret recipe with shaved parmesan and croutons English Cobb Salad *pub favorite Mixed garden lettuce topped with bacon, egg, tomato, peas, bleu cheese crumbles and scallions Sand Wedge Iceberg wedge with crispy Jameson glazed bacon, smoked gouda, tomatoes, ranch and a drizzle of balsamic glaze Seasonal Salad Ask your Server about our Specialty Seasonal Selection. Top any salad with… Chicken Salad Shrimp or Marinated Portabella Chicken Breast Cod Salmon SAND TRAP SIDES English Chips (American steak fries) Homemade Mashed Potatoes Coleslaw Crispers (homemade potato chips) Peas Carrots Broccoli Vegetable Medley Garlic Red Potatoes Pub Beans (green beans sautéed with mushrooms, onion, & garlic) Onion Rings Side Salad Ceasar Salad Homemade Mac & Cheese Side of Beef or Chicken Gravy JUNIOR GOLFERS Age 10 years and under, Please! Mac & Cheese • Chicken Fingers & Chips • Grilled Cheese & Chips Burger & Chips • Fish & Chips Kid’s Ice Cream Sundae (1 scoop) AFTER DINNER DRINKS British Open Pub Irish Coffee Irish Cream & Irish Whiskey Nutty Irishman Coffee Irish Cream & Hazelnut Liquor Kilted Cup Coffee Irish Cream & Drambuie Spiced Honey Whiskey Peppermint Paddy Coffee Irish Cream & Peppermint Schnapps Butter Cream Coffee Irish Cream & Butterscotch Schnapps Fancy a pot of English Tea? We serve P.G. Tips DESSERTS Add a scoop of vanilla ice cream Bread Pudding *pub favorite A classic recipe served warm with cream Apple Cobbler Deep dish with sweet cinnamon apples drizzled with caramel sauce Cinnamon Caramel Crunch *pub favorite Vanilla bean ice cream in flaky puff pastry, sprinkled with cinnamon and sugar, and topped with caramel and whipped cream Chocolate Cake Moist layers of chocolate cake and fudge served hot or cold Key Lime Pie Rich, authentic key lime pie Peanut Butter Pie Creamy peanut butter pie topped with Reese’s Peanut Butter Cups Ask about our Dessert of the Day! LUNCH SPECIALS ’til 4 pm Soup & Salad Soup of the day and House or Caesar Salad Substitute French Onion • Chowder • Chili BRUNCH MENU served Sundays from 11am – 2pm Full English Breakfast Two eggs, rashers, english banger, black pudding, white pudding, baked beans, grilled tomatoes, and mushrooms. Served with toast. The American Two eggs cooked your way, bacon, hash browns, toast, and melba sauce. Corned Beef Hash Homemade hash of fresh cooked corned beef and red potatoes. Served with 2 eggs and toast. Jameson Avocado Toast A homemade avocado spread on our marble rye bread. Topped with two eggs, diced tomato, red onion and sprinkled with our own Jameson glazed bacon. Irish Benedict This sliced irish bacon on an english muffin, topped with poached eggs, and homemade hollandaise sauce. Served with hash browns. Bloody Mary Queen of Scotts Our classic favorite – as bold as the women it’s named after. Spice it up with Absolut Peppar Mary & The Boys Add a “Gulf” touch to your Mary. Our Mary surrounded by her boys – 6 large beer boiled gulf shrimp served chilled. Don’t like Bloody’s (Like Kelly), Substitute with a glass of Jameson and keep the boys Bottomless Mimosa or Peach Bellini La Marca Prosecco Mimosa La Marca Prosecco Peach Bellini Guinness Nitro Cold Brew In a Can Order Here Hours Sun-Wed: 11AM to 10PM Thurs: 11AM to 11PM Fri & Sat: 11AM to 12AM Brunch Sun: 11AM to 2PM Happy Hour Daily: 11AM to 6PM. Location 367 Jacaranda Boulevard Venice, FL 34292 Contact us 941.492.9227 catering@britishopenpub.com Follow Follow Join Our Rewards Program Sign up for savings and rewards! SIgn Up Join Our Rewards Program Sign up for savings and rewards! SIgn Up ® 2025 The British Open Pub Privacy Policy"
    },
    {
      "url": "https://inzmo.com/deu/en/contact",
      "text": "Contact INZMO: Get in Touch with Us Today! | INZMO English Products Products Hello and welcome! You've just entered a world where insurance isn't just a necessity; it's a path to financial freedom. We're INZMO, and we're more than just insurance. Mobile Phone Insurance From 1.99€ / month Rental Deposit Warranty From 3.25€ / month Bicycle insurance From 4.99€ / month Laptop/Tablet Insurance From 2.99€ / month E-scooter Insurance From 4.17€ / month About us For Partners Submit a claim Submit a claim Submit a claim We're here to help! Whether it's phone, email or chat, let us know what we can help you with today! We're here to help! Whether it's phone, email or chat, let us know what we can help you with today! Contact us As an INZMO customer, there are several easy ways to get in touch with us. We're here to help with any questions you might have! Email us: info@inzmo.com Give us a call: +49 30 31193091 (available 9-17 CET, Monday-Friday; except national holidays) Chat: use our chat option down in the corner of the page to find an answer even faster. Looking to partner with INZMO? Learn about easily offering embedded insurance to your customers. Connect with one of our experts today and get started! Talk with an expert Unleash the revolution - choose the wise alternative Get covered Your e-mail address Submit Subscribe for updates See what's new Get the app Inzmo About us Imprint Products Rental Deposit Warranty Mobile Phone Insurance Laptop/Tablet Insurance Bicycle Insurance E-scooter Insurance Get in touch Contact us Partner with us Careers Legal Terms of Use Privacy Policy Cookie Notice & Policy"
    },
    {
      "url": "https://www.morningadvertiser.co.uk/Article/2024/02/23/Who-is-in-charge-at-the-UK-s-biggest-pub-companies/",
      "text": "Who is in charge at the UK's biggest pub companies default-output-block.skip-main The Inspiration for Pub Success Since 1794 Register Search menu home menu home Latest Food & Drink Legal Operations Companies Resources Events Close menu Queryly search Home Latest Show Latest sub sections News Trends & Analysis Opinion & Interviews Investments New Product Development Events Podcasts Promotional Features Food & Drink Show Food & Drink sub sections Beer Cask Cider Low & No Alcohol Soft & Hot Drinks Spirits & Cocktails Wine Food Trends Ingredients Menu Ideas Snacks Legal Show Legal sub sections Health & Safety Legislation Licensing Law Property Law Operations Show Operations sub sections Design & Furnishings Entertainment & Events Environmental, Social & Governance Equipment Financial Marketing Staffing Technology Companies Show Companies sub sections Admiral Taverns Greene King Marston's Punch Pubs & Co Star Pubs & Bars Stonegate Group Independent Operators Managed Groups Gastropubs Resources Show Resources sub sections Ale & Stout Bar & Catering Equipment Cellar, Dispense & Bar Equipment Cider Design & Refurbishment Entertainment Food Lager Legal Marketing Outdoor Professional Services RTDs Security Smoking & Alternatives Soft drinks Spirits Technology Training Wine Work wear Suppliers Events Show Events sub sections Shows & Conferences Editorial Webinars Awards Meet those in charge of the UK's biggest pub companies By Rebecca Weller 23-Feb-2024 Last updated on 27-Sep-2024 at 08:07 GMT Into the boardroom: Who is in charge at the UK's biggest pub companies? (Credit:Getty/Klaus Vedfelt) The Morning Advertiser has taken a look behind the scenes and into the boardrooms of the UK’s six biggest pub companies. Made up of Stonegate, Greene King, Marston’s, Star Pubs & Bars, Punch and Admiral Taverns, we get to know each of the businesses leaders and learn about their history. Stonegate: David McDowall Britain’s biggest pubco is managed by chief executive office David McDowall, who succeeded Simon Longbottom in November 2022. McDowall brought a wealth of experience with him when he joined Stonegate, which has 4,500 pubs, having previously worked as president and chief operating officer at BrewDog. The CEO, who has 15 years of board level experience in the sector and is also a board member of trade body UKHospitality, had been with BrewDog since 2015, when he was  appointed managing director of its bars. McDowall also held the position of non-executive chair for competitive socialising brand NQ64 from December 2020 to January this year and worked as group operations director for the G1 Group for more than six years, from December 2008 to December 2014. Last summer, McDowall spoke to The Morning Advertiser’s Editor Ed Bedington about his excitement for his new role with Stonegate and detailed his future plans for the business, including a focus on digital innovation and opportunities to expand the firm further. Read more here . Greene King: Nick Mackenzie Nick Mackenzie has been CEO of Greene King, which has more than 2,700 sites, since 2019. His predecessor, Rooney Anand, had previously held the position for 14 years. Prior to joining Greene King, Mackenzie was boss of leisure company Merlin Entertainments with more than 20 years’ experience in a variety of roles within the industry. Mackenzie is also a qualified charted surveyor and started his career working with Bass and then with Allied Domecq as its acquisitions direction before joining Burger King as its development director. He joined The Tussauds Group in 2002, which was subsequently acquired by Merlin in 2007, where he remained to head up its property and development group. In 2011, Mackenzie became managing director at Resort Theme Parks before moving across to lead the Midway business in 2015. He also previously held the role of independent non-executive director for pub group Thwaites – which he relinquished before joining Greene King. In December last year, Mackenzie was also elected as chairman of the British Beer & Pub Association (BBPA) replacing St Austell Brewery chief executive Kevin George. Star Pubs & Bars: Lawson Mountstevens Lawson Mountstevens has been managing director of Star Pubs & Bars, which is part of Heineken UK and has a portfolio of around 2,400 pubs, since 2016. Though the pubco boss has worked with Heineken UK for more than two decades, having first joined the global brewer as a regional sales director in January 2000 and progressing to a national sales director position in 2007. In 2011, Mountstevens, who also has a degree in economic from the University of Manchester, was appointed as Heineken UK’s on trade managing director before the moving on to take the reigns at Star Pubs & Bars. Prior to this, from 1992 to 2000, he worked at Scottish & Newcastle, which was acquired by Heineken in 2008 and subsequently became Star Pubs & Bars in 2012. Marston’s: Justin Platt The most recent appointment in our round up, Justin Platt has been at the helm of Marston’s since January this year. His appointment was announced in November 2023, after his predecessor Andrew Andrea agreed with the pubco’s board he would step down from the chief executive office role with immediate effect. Platt was appointed following an external process and brought more than 30 years’ experience with him to Marston’s. He had spent the previous 12 years at Merlin Entertainments, most recently as chief strategy officer and, prior to that, in a variety of operational leadership roles. Platt also has a degree in economics from the University of Leeds. Punch Pubs: Andy Spencer Andy Spencer was appointed as chief executive officer of Punch Pubs in September 2024, taking over the position from Clive Chesser . Spencer first joined Punch as managing director in February 2019 and worked his way up to chief operating officer before being taking on the role of CEO. Prior to this, Spencer had worked at Brewhouse & Kitchen as group operations director and for Metropolitan Pub Company as operations director before that. The CEO, who has a Bachelor of Science degree in hotel and catering management from the University of Surrey, also worked for Greene King from 2001 to 2012, rising up the ranks from senior sales development manager to business development director. Admiral Taverns: Chris Jowsey Closing our round-up we have Admiral Taverns boss Chris Jowsey, who has been heading things up at the pubco since 2019. Jowsey, who has more than 20 years’ experience in the sector, took over the role as Admiral chief executive officer from Kevin Georgel and had previously worked as Heineken UK’s on-trade director since 2016. Prior to this, the CEO had taken on various roles with Heineken, having joined the company in 2009, and previously worked as a regional managing director for Newcastle Breweries followed by a similar role at John Smiths. Jowsey also has a Batchelors degree and MBA in philosophy, politics and economics from University College, Oxford. Related Topics Independent Operators Related news Woodforde's unveils new cask range 23-Feb-2024 By Rebecca Weller Woodforde’s Brewery has announced a new cask beer range, the Brewers Signature range, which features bespoke brews, each created by one their brewers. 8 things to know about King Charles III banknotes 23-Feb-2024 By Nikkie Thatcher With new banknotes showing the portrait of King Charles III set to enter circulation this summer, we’ve looked at what you need to know about the new notes and delved into the history of polymer cash. Demand for American sports in pubs 'growing exponentially' 23-Feb-2024 By Rebecca Weller Showing American sports offers “massive benefits” for operators as demand grows “exponentially”, but passion is key to tap into the trend, Hickory’s managing director John Welsh told The Morning Advertiser (MA). Show More Headlines More → Clarkson loses £27k as ‘hackers’ target pub MA Leaders Norwich: a fine city for insight The changing face of the Great British Pub The MA Lock In Podcast Webinars More → Next editorial webinar → 24 Sep 2025 The Cask Project: why should you trust cask beer? Opens in new window Promotional features More → How having Wingman by your side can boost your bottom line Paid for and content provided by BrewDog The 9-Darter: Foster’s Nine Steps to Pub Success William Blake named second Sky Business GOAT winner Morning Advertiser Advertise with us Apply to reuse our content Opens in new window Press Releases - Guidelines Features Calendar About us Contact us Why Register? Resources Report a technical problem Whitelist our Newsletters Help Centre RSS Feed Podcast Archives"
    },
    {
      "url": "https://beerandpub.com/about-us/",
      "text": "About Us | BBPA Login/Register Become a Member Contact Us About Us Membership and Events View Our Membership Events Calendar Policy & Campaigns Policy & Campaigns View Our Policy Areas Manifesto 2024 Brewing Communities: A BBPA and Create Streets Report 2025 Welsh State of the Nation Report BBPA and Frontier Economics - Impact of recent economic trends on pubs and breweries​ UK Brewing Sector: Climate risk and resilience News Data & Statistics Resources & Shop Login/Register About Us Back About Us Membership and Events Back Membership and Events Our Membership Events Calendar Policy & Campaigns Back Policy & Campaigns Policy & Campaigns Back Policy & Campaigns Our Policy Areas Manifesto 2024 Brewing Communities: A BBPA and Create Streets Report 2025 Welsh State of the Nation Report BBPA and Frontier Economics - Impact of recent economic trends on pubs and breweries​ UK Brewing Sector: Climate risk and resilience News Data & Statistics Resources & Shop Become a Member Contact Us BBPA Scotland Wales About Us A passion for beer and pubs We are the UK's leading trade association representing pubs and breweries. Our members brew over 90% of British beer and own over 20,000 pubs. We are a passionate, experienced team, delivering tangible change and benefits for our members to ensure a thriving pub and brewing sector in the UK. We are the voice of pubs and brewers. \"We're here to speak up for our members, to make sure pubs and brewers running brilliant businesses in every single part of the UK are heard. \"Our pubs and breweries are a cornerstone of British heritage and we're here to make sure they're a part of our country's future.\" Emma McClarkin OBE, Chief Executive, BBPA Meet our Team Get in touch Visit Us BBPA 61 Queen Street London EC4R 1EB General Enquiries 020 7627 9173 contact@beerandpub.com Back to top Not found what you're looking for? . About Us Our Team News & Media Get In Touch Login/Register Policy & Campaigns Taxation Sustainability Diversity & Inclusion Community & Wellbeing Login/Register Members Area News Login/Register © Copyright. Registered in England and Wales No. 01182734 | Built by: Cold Banana Cookies Policy Privacy Notice"
    },
    {
      "url": "https://www.quora.com/Why-are-the-owners-of-British-pubs-called-landlords",
      "text": "Why are the owners of British pubs called 'landlords'? - Quora Something went wrong. Wait a moment and try again. Try again Please enable Javascript and refresh the page to continue"
    },
    {
      "url": "https://www.britishopenpub.com/catering/",
      "text": "Catering by The British Open Pub - The British Open Pub click here to ORDER NOW Menus Events About Us Gift Cards Contact Order Now Order Catering Menus Events About Us Gift Cards Contact Order Now Order Catering Hours Sun-Wed: 11AM to 10PM Thurs: 11AM to 11PM Fri & Sat: 11AM to 12AM Brunch Sun: 11AM to 2PM Happy Hour Daily: 11AM to 6PM. Location 367 Jacaranda Boulevard Venice, FL 34292 Contact us 941.492.9227 catering@britishopenpub.com Follow Follow Join Our Rewards Program Sign up for savings and rewards! SIgn Up Join Our Rewards Program Sign up for savings and rewards! SIgn Up ® 2025 The British Open Pub Privacy Policy"
    },
    {
      "url": "https://theyorknorwich.co.uk/about-us/",
      "text": "About Us - The York Norwich End Of Summer Party, Sunday 24th August 12-10pm, … visit the What’s On Page for details. End Of Summer Party, Sunday 24th August 12-10pm, … visit the What’s On Page for details. End Of Summer Party, Sunday 24th August 12-10pm, … visit the What’s On Page for details. End Of Summer Party, Sunday 24th August 12-10pm, … visit the What’s On Page for details. Skip to content Book Now Home About Us Food & Wine + Food & Wine Christmas 2024 Private Dining & Parties What’s On Bookings Contact Us Careers Book Now Home About Us Food & Wine + Food & Wine Christmas 2024 Private Dining & Parties What’s On Bookings Contact Us Careers Book Now FOLLOW US: About Us About Us Our Story We’re a team of passionate individuals who’ve taken our wealth of experience in the hospitality industry to launch our flagship pub, The York Norwich. Inspired by the places, food and wine we enjoy, we’ve created a space that is welcoming to everyone, a place where friends, families and individuals can meet, relax and unwind while enjoying great food and drink. A Brief History Dating back to 1878, The York has a legacy of being a mainstay in the community serving as a popular, well-loved pub in the Golden Triangle. We aim to honour this heritage by bringing back some of that Victorian charm such as the Pétanque pitch in the pub garden – a nod to The York bowling club who were based at The York in the early 1920’s whilst introducing some of our own personal touches such as an ever-changing, seasonal menu reflecting our love of modern British food. BOOK NOW Our Ethos Upon reviving life back into The York we’re focused on seasonality, locality and affordability. With an abundance of quality farms, bakeries and seafood purveyors in the Norfolk area it is our aim to showcase these ingredients and produce alongside an enticing drinks offering from exciting brewers and distilleries. A Place to Relax Step into The York and instantly feel a sense of warmth and comfort. If it’s cold outside you’ll be sure to find an open fire flickering away, sink into our sumptuous ox blood Chesterfields and comfortable seating and let the afternoon turn into evening. If the sun is shining head on out to the beer garden for a game of boules or sit amongst the herb gardens, either way you’ll be able to enjoy lunch, dinner or bar snacks served throughout the day. Explore our menu and wine list below. OUR MENU Our Suppliers We take great pride in supporting local suppliers and creating strong relationships within the community. We collaborate with some of the best producers in the region food producers for our ever-changing menu, our drinks menu with locally brewed cask ales, beers and gin right through to local florists for our private dining events and parties. Fresh, Local, Sustainable. With Norfolk’s culinary heritage we’re working with some of the best ingredients and drinks suppliers around. Our meat and hand reared beef is from Swannington Farm, seafood & game from Howard & Son , fruit and vegetables from Barsby Produce and fresh, artisan breads from the bakers at Dozen Bakery feature throughout our modern British menu. With a strong focus on seasonality and use of fresh local produce, our menu reflects the rich offering Norfolk and the surrounding areas have to offer. Our drinks list features drinks from local suppliers such as; Lacons Brewery , Wildcraft Brewery and Aspall Cyder of Suffolk and other locally brewed cask ales alongside gin from Bullards . We also serve a number of popular European beers alongside our low-intervention wine list – explore our wine list below VIEW WINE LIST Subscribe Now Thank You Thank you, your sign up request was successful! Please check your e-mail inbox to confirm. Join the mailing list for the latest news and offers from The York Norwich. Don’t miss out on seasonal events and exclusive deals. Enter your email address: Leave this field empty if you're human: Opening Hours Weds 16:00 — 23:00 Thurs 16:00 — 23:00 Fri 12:00 — 23:00 Sat 12:00 — 23:00 Sun 10:00 — 21:00 Food Served: Weds 17:00 — 21:00 Thurs 17:00 — 21:00 Fri 12:00 — 21:00 Sat 12:00 — 21:00 Sun 10:00 — 16:00 We are closed Monday and Tuesday. Reservations can be made via the online booking form by using the button below. For bookings greater than 20 please use the Enquiries Form via the Contact Us page or call us to discuss your requirements. BOOK NOW Contact Us The York 1 Leicester St. Norwich, NR2 2AS +44 (0)1603 652 721 Location We’re only a 10 minute walk from Norwich City Centre. Located in the heart of the famous ‘Golden Triangle’ NR2. Copyright ©  2025 The York Norwich. The York Norwich is a trading name of Bacchus Pubs Ltd. Cookie Policy Privacy Policy Design & Site by Process Subscribe Now Thank You Thank you, your sign up request was successful! Please check your e-mail inbox to confirm. Join the mailing list for the latest news and offers from The York Norwich. Don’t miss out on seasonal events and exclusive deals. Enter your email address: Leave this field empty if you're human: Close We respect your privacy. Unsubscribe anytime. CLOSE We use cookies to improve your experience on our site. Learn more. Accept Decline Manage Consent | Privacy Policy ✕ Manage Cookie Consent We use cookies to enhance your browsing experience and enable essential functions on our website. Some cookies are categorised as \"Necessary\" are automatically stored on your browser as they are crucial for the basic operation of the site - they can no be adjusted using these tools. Additionally, we use third-party cookies to help us analyse your usage of the website. These cookies are stored in your browser only with your prior consent. You have the option to enable or disable some or all of these cookies. Statistical Cookies Statistical or analytical cookies are used to gain insights into how visitors interact with the website. These cookies collect data on metrics like visitor count, bounce rate, traffic sources, and more, helping us understand and improve site performance. Advertising Cookies Advertisement cookies deliver personalised ads based on the pages you previously visited and help analyse the effectiveness of ad campaigns. Accept All Save Preferences Reject All ✕ Visit Cookie Policy Page Cookies"
    },
    {
      "url": "https://www.britishopenpub.com/about-the-british-open-pub/",
      "text": "About Us - The British Open Pub - The British Open Pub click here to ORDER NOW Menus Events About Us Gift Cards Contact Order Now Order Catering Menus Events About Us Gift Cards Contact Order Now Order Catering People are the heart and soul of any pub. Whether you curl up in our quaint English dining room or pony up to the neighborhood bar, you are sure to feel at home! We proudly serve everything from British favorites of fish & chips, cottage pie, and liver & onions to pub grub including juicy angus burgers and hot honey garlic wings. With over 300 whiskies, 20 draught beers, many fine wines & spirits, and specials, everyone is sure to find what they’ve been craving! The British Open Pub is the place to come for comfortable food, friends, and atmosphere! Pubs have always been the place to gather and chat. People are the heart and soul of any pub. The pub patron is not just a customer, but a guest and a friend. We strive to emulate the warmth and character of an English Village Pub, continuing and age-old British Tradition! History of The British Open Pub Originally opened in 1998, the British Open Pub has become a staple in the Venice Community!  Now led by mother/daughter team Kathy & Kelly Olliver, the British Open Pub remains committed to offering a consistent, quality product for a fair price.  The Pub is also privileged to be able to support many non-profits in the Venice Community. A Dog-Friendly Patio! Owners are allowed to accompany their well-behaved dogs on our Garden Patio!  Fill up with a fresh made peanut butter burger or skinny chicken off our Puppy Pub menu or cool off with our homemade doggie ice cream!  We love to pamper our Pub Pooches! The Whiskey Uprising With over 300 whiskies, there is always something new to enjoy at the British Open Pub.  The Whiskey Club meets on the 2nd Wednesday of each month to taste and learn about different whiskey selections.  Amateurs and Aficionados, alike, are encouraged to join in the fun! Hours Sun-Wed: 11AM to 10PM Thurs: 11AM to 11PM Fri & Sat: 11AM to 12AM Brunch Sun: 11AM to 2PM Happy Hour Daily: 11AM to 6PM. Location 367 Jacaranda Boulevard Venice, FL 34292 Contact us 941.492.9227 catering@britishopenpub.com Follow Follow Join Our Rewards Program Sign up for savings and rewards! SIgn Up Join Our Rewards Program Sign up for savings and rewards! SIgn Up"
    },
    {
      "url": "https://www.britishfuture.org/about-us/who-we-are/",
      "text": "Who we are - British Future Home About us Current funders Jobs Media Trustees Who we are What we do Projects and Themes Publications News Events Partner with us Contact s About us Who we are What we do Future programme Vision and values Current funders Trustees Media Jobs Partner Support us Projects & Themes Publications News Events Partner with us Contact About us - Who we are Sunder Katwala Director of British Future Sunder Katwala is the director of British Future. He has previously worked as a journalist. He was general secretary of the Fabian Society thinktank from 2003 to 2011, and was previously a leader writer and internet editor at the Observer, a research director of the Foreign Policy Centre and commissioning editor for politics and economics at the publisher Macmillan. He celebrated his 10th wedding anniversary with his wife, Stacy, in 2011, and is the proud father of four children, Zarina, Jay, Sonny and Indira. His support for Everton and Southend United football clubs reflects an upbringing in Cheshire and Essex, though he was born in Doncaster, Yorkshire, to parents who came to Britain from India and Ireland, to work for the NHS. Sunder is the author of 'How to be a patriot: Why love of country can end our very British culture war,' published by Harper North. Steve Ballinger Director of Communications Steve Ballinger is Director of Communications. Over the last 25 years he has worked in media and communications roles at Amnesty International UK, Shelter, VSO and the Advertising Standards Authority before joining British Future.  \r\nSteve grew up in Leamington Spa in the West Midlands and went to university in Leeds. He describes himself as an enthusiastic but unsuccessful golfer, poker player and Nottingham Forest supporter, but a decent cook. He lives with his partner Sara in east London. Heather Rolfe Director of Research & Relationships Heather Rolfe is Director of Research and Relationships. She was previously Head of Research at Demos. Prior to that she led the social policy team at the National Institute of Economic and Social Research where her work focused on the economic and social impact of migration, including public attitudes. Heather was born in Bradford but grew up in Bristol and Hertfordshire. She went to university in Sheffield and Southampton, where she wrote her PhD on the experience of workplace automation. She lives in South London with her husband Simon, and close to her two grown up daughters. Heather loves London, especially its galleries, museums and restaurants. She loves it so much that she gets homesick on holiday. Heena Khaled Events and Engagement Manager Heena Khaled is the Events and Engagement Manager at British Future. She runs and develops British Future’s event programme. Jake Puddle Senior Researcher Jake Puddle is a Senior Researcher at British Future. He grew up in Canterbury before moving to London, where he completed a Master’s in Global Governance and Ethics at University College London. Jake’s work has involved co-delivering Talk Together, the UK’s biggest conversation about what divides us and what action is needed to create a more socially connected society. He has also authored multiple reports on the role of sport, history, volunteering and major events to build social connections between people from different backgrounds. Outside of work, Jake is a keen cook and can usually be found experimenting with curry recipes. Avaes Mohammad Associate Fellow Avaes Mohammad is a teacher at Eden Girls School Waltham Forest, a Muslim secondary school in East London. He has written publicly about race, identity and Muslim inclusion and integration. \r\nAvaes brings a range of experience to the team, from his current role in education to his background in the chemical sciences and practice as a professional playwright and poet. He was formerly a staff member at British Future, managing the 'Unknown and Untold' project which sought to raise public awareness during the First World War Centenary of the 400,000 Muslims from undivided India who served in the British Army in WW1 Jill Rutter Associate Fellow Jill Rutter’s Associate Fellowship is focused on integration and  cohesion. She was a co-author of British Future's After the Riots report and worked with British Future and Belong staff on research for the Commission on Community and Cohesion.\r\n \r\nFrom 2016-2021 Jill was  Director of Strategy and Relationships at British Future. She  helped set up the Together Coalition and led Talk Together, the UK’s biggest conversation about what divides us and what brings us together in the wake of COVID-19. Jill also led the National Conversation on Immigration, which engaged more than 20,000 people. Jill has previously worked in academia, for the Refugee Council, the Institute for Public Policy Research, Learning and Work Intitute and for the funder Spirit of 2012.  She is the author of many books and articles on immigration, integration and community cohesion including Moving Up and Getting On (Policy Press, 2015). Patrick Vernon Associate Fellow Patrick Vernon has led the campaign for a national Windrush Day since 2010 and in 2018 kick-started the campaign for an amnesty for the Windrush Generation in response to the Windrush Scandal. He is a writer and broadcaster for national and international media on healthcare, cultural heritage and race, and co-authored ‘100 Great Black Britons’.\r\nPatrick is Associate Director at the Centre for Ageing Better, Independent non-executive Director of Birmingham and Solihull Integrated Care System, Chair of the Citizenship Partnership for HSIB and non-executive Director for Hertfordshire NHS Trust. In August 2021 he was appointed Honorary Professor of cultural heritage and community leadership for the Department of Community Development at Wolverhampton University. Patrick was awarded an OBE in 2012 for his work on tackling health inequalities in ethnic minority communities. Kirren Rathor Media and Communications Officer Kirren brings to British Future 15 years’ experience as a Senior Journalist at BBC News, where she covered some of the world’s biggest stories including elections in the UK and overseas. She has covered race relations across the UK, including extremism and the investigation into the murder of Stephen Lawrence, and also has a specialist background in the cultural and political landscapes across South Asia. \r\nOutside of the BBC Kirren has also worked in specialist factual current affairs developing documentaries and podcasts. Saffron Powell PhD Placement Researcher Saffron Powell is a PhD Placement Researcher at British Future. She is a UKRI ESRC funded PhD candidate at King’s College London researching how teacher education providers across England prepare new teachers for an ethnically diverse society at a time where the teacher workforce in England remains predominately White British, yet our school children are the most ethnically diverse they have ever been. With a background in Biomedical Science and a master’s in teacher education from the University of Oxford, Saffron taught secondary school science for over 7 years, holding roles such as head of biology, KS3 science coordinator and newly qualified teacher (NQT - now ECT) mentor, before leaving the classroom to pursue her PhD. Also see Trustees Meet our trustees. Our experienced Board of Trustees ensures the good governance of British Future and offers valuable insight and experience to the staff team. Read More What we do British Future’s research into public attitudes on issues such as immigration, integration and identity helps us and our partners develop effective messages that reach and persuade new audiences. We offer constructive policy solutions to people’s legitimate concerns and work to find common ground that can bring people together. Read More Funders British Future is a registered charity. We are grateful to our funders – trusts and foundations, business voices and civic society organisations - and welcome discussions about future partnerships. Read More British Future’s latest activity on Twitter British Future @britishfuture · 8h 1965457134801608958 As Newham Mayor @rokhsanafiaz says, the Independent Commission on Inclusion and Belonging in Multi-Ethnic Newham wants to hear from Newham residents. If you live in Newham, click here to find out more and fill in the residents' survey: Rokhsana Fiaz OBE @rokhsanafiaz Through our joint commission with @britishfuture, we’re listening to residents & tackling inequalities linked to class, ethnicity & faith. Building a Fairer Newham means embedding fairness across all services, for every resident. https://www.newham.gov.uk/public-health-safety/new-commission-wants-hear-residents-partners-inclusion-belonging Reply on Twitter 1965457134801608958 Retweet on Twitter 1965457134801608958 1 Like on Twitter 1965457134801608958 1 Twitter 1965457134801608958 British Future @britishfuture · 4 Sep 1963498861252522334 Djed Spence hopes to inspire others as England’s first Muslim player Djed Spence hopes becoming first Muslim England player will inspire others Djed Spence hopes to inspire a new generation if he becomes the first Muslim player to represent the England men's team. www.bbc.co.uk Reply on Twitter 1963498861252522334 Retweet on Twitter 1963498861252522334 0 Like on Twitter 1963498861252522334 7 Twitter 1963498861252522334 British Future @britishfuture · 1 Sep 1962408866555072879 UK to tighten family member rules for asylum cases - bbc UK suspends refugee family reunion applications Yvette Cooper outlines her plans as MPs return to Parliament after a summer of protests at asylum hotels. www.bbc.com Reply on Twitter 1962408866555072879 Retweet on Twitter 1962408866555072879 0 Like on Twitter 1962408866555072879 0 Twitter 1962408866555072879 British Future @britishfuture · 29 Aug 1961339641853804561 What's going on with all the England flags going up across the country? @NewsAnnabelle of @politico  talks to our @sundersays, @JYDenham and others to find out https://www.politico.eu/article/operation-raise-the-colours-st-georges-cross-union-jack-flags-britain-immigration-far-right-protests/ Twitter feed image. Reply on Twitter 1961339641853804561 Retweet on Twitter 1961339641853804561 3 Like on Twitter 1961339641853804561 6 Twitter 1961339641853804561 British Future @britishfuture · 15 Aug 1956312942112022572 As we mark #VJDay80, in which millions of soldiers from pre-partition India, Africa & the Caribbean served, worth noting that only 55% of UK public know that Indian soldiers fought for Britain in the World Wars. Just 24% are aware that soldiers from Kenya or Jamaica served.[1/4] Twitter feed image. Reply on Twitter 1956312942112022572 Retweet on Twitter 1956312942112022572 6 Like on Twitter 1956312942112022572 9 Twitter 1956312942112022572 British Future @britishfuture · 15 Aug 1956275452693074291 New column marking #VJDay80 today from @sundersays for @EasternEye Sunder Katwala @sundersays The three short months between VE Day in May and VJ day in August changed the contours of the postwar world, reshaping British politics, the map of Europe and the future of conflict in a new nuclear age. My column  this week ahead of tomorrow's 80th anniversary commemorations Reply on Twitter 1956275452693074291 Retweet on Twitter 1956275452693074291 0 Like on Twitter 1956275452693074291 0 Twitter 1956275452693074291 Retweet on Twitter British Future Retweeted Robert Colvile @rcolvile · 15 Aug 1956273367578808615 Important stat from ONS. Concerns about crime and migration are rising but people still care most about cost of living and NHS. Politicians need a message/plan on those too... Twitter feed image. Reply on Twitter 1956273367578808615 Retweet on Twitter 1956273367578808615 2 Like on Twitter 1956273367578808615 5 Twitter 1956273367578808615 British Future @britishfuture · 14 Aug 1956004239458652527 Ahead of the 80th anniversary of #VJDay tomorrow, @sundersays writes for @easterneye on the importance today of commemorating the multi-ethnic, multi-faith armies that won the war [1/2] Twitter feed image. Reply on Twitter 1956004239458652527 Retweet on Twitter 1956004239458652527 1 Like on Twitter 1956004239458652527 1 Twitter 1956004239458652527 British Future @britishfuture · 14 Aug 1955903217239478693 We're excited to be hosting a fringe event at the #SMCSymposium on 9 September, which aims to challenge conventional thinking about social mobility and explore insights into the causes of socio-economic disadvantage [1/2] Twitter feed image. Reply on Twitter 1955903217239478693 Retweet on Twitter 1955903217239478693 0 Like on Twitter 1955903217239478693 0 Twitter 1955903217239478693 British Future @britishfuture · 12 Aug 1955227717206425895 As small boat crossings are set to hit 50,000 sinec Labour came to power, our @sundersays is talking to @BBCWorldatOne at 1.15 about six years of policy failure and what can be done Twitter feed image. Reply on Twitter 1955227717206425895 Retweet on Twitter 1955227717206425895 1 Like on Twitter 1955227717206425895 3 Twitter 1955227717206425895 Load More Engaging people’s hopes and fears about integration and immigration, identity and race. Working for a confident and welcoming Britain, inclusive and fair to all.\r\n\r\n\r\nRegistered charity number 1159291 Contact us British Future 13 Elliott’s Place, London N1 8HX info@britishfuture.org Media Contact Steve Ballinger British Future Director of Communications steve@britishfuture.org Mob. 07807 348 988 (No text messages to this number please) GDPR | Legal | Cookies Website by"
    },
    {
      "url": "https://bestofbritishpub.com/",
      "text": "Best of British pub 16909 \nHigh Grove Blvd\nClermont, Florida\n34714\n\n☎️  352-227-3231 16909 \nHigh Grove Blvd\nClermont, Florida\n34714\n\n☎️  352-227-3231 16909 \nHigh Grove Blvd\nClermont, Florida\n34714\n\n☎️  352-227-3231 16909 \nHigh Grove Blvd\nClermont, Florida\n34714\n\n☎️  352-227-3231 Open 9am- late 7 days a week Child and pet friendly! Premier league, Champions league and international games shown live British pub owned and operated by Brits! EVENTS Live Sports WE HAVE 8 LARGE TV'S SHOWING LIVE FOOTBALL, RUGBY AND CRICKET BRITISH BEERS! WE HAVE A GREAT SELECTION OF BEERS ON TAP INC OLD SPECKLED HEN, TENNENTS, WREXHAM LAGER, GUINNESS, KILKENNY, STELLA, PLUS OTHER FAVOURITES SUCH AS MICH ULTRA, MAGNERS AND YUENGLING About us FIND US ON FACEBOOK AND INSTAGRAM @BESTOFBRITISHPUB we are a family owned and operated pub in the heart of Florida at 16909 High Grove Blvd, Clermont 34714 FREE HIGH SPEED INTERNET WI-FI @bestofbritishpub Contact Us Drop us a line! Name Email* Send This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Get on down to the pub for a drink and some pub grub! Best of British pub 16909 High Grove Boulevard, Clermont, Florida 34714, United States 3522273231 Hours Mon 09:00 am – 12:00 am Tue 09:00 am – 12:00 am Wed 09:00 am – 12:00 am Thu 09:00 am – 12:00 am Fri 09:00 am – 12:00 am Sat 09:00 am – 12:00 am Sun 09:00 am – 02:00 am Get directions Copyright © 2025 Best of British pub  - All Rights Reserved. Powered by This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://www.britishopenpub.com/events-at-british-open-pub/",
      "text": "Events at The British Open Pub - The British Open Pub click here to ORDER NOW Menus Events About Us Gift Cards Contact Order Now Order Catering Menus Events About Us Gift Cards Contact Order Now Order Catering Join us for the upcoming British Open Pub events! August September 2025 October MO TU WE TH FR SA SU 1 Team Trivia – 7:30pm Team Trivia – 7:30pm 7:30 pm Join us for great food and fun Trivia! RESERVATIONS are required.  Call to reserve your seat: 941-492-9227\n , ... 2 3 4 5 Live Music – Justin Layman 7pm to 10pm Live Music – Justin Layman 7pm to 10pm 7:00 pm - 10:00 pm 6 Live Music – Doug Burns 7pm to 10pm Live Music – Doug Burns 7pm to 10pm 7:00 pm - 10:00 pm 7 8 Team Trivia – 7:30pm Team Trivia – 7:30pm 7:30 pm Join us for great food and fun Trivia! RESERVATIONS are required.  Call to reserve your seat: 941-492-9227\n , ... 9 Happy Hour with the Dan Garrison the maker of Garrison Brothers Bourbon Whiskey  3pm to 4:30pm Happy Hour with the Dan Garrison the maker of Garrison Brothers Bourbon Whiskey  3pm to 4:30pm 3:00 pm - 4:30 pm Bourbon lovers save the date! Meet Dan Garrison, Distillery founder of Garrison Brothers Texas Straight Bourbon Whiskey for happy hour on Sept 9th from 3:00pm to 4:30pm.\n , ... 10 Whiskey Wednesday Featuring Registered Distillery One (RDOne) 6:45pm Whiskey Wednesday Featuring Registered Distillery One (RDOne) 6:45pm 6:45 pm - 9:00 pm Join us in September for Whiskey Wednesday featuring Registered Distillery One (RDOne)!! As always, seating opens at 6:15pm, welcome cocktails are served at 6:45pm, and the program begins at 7pm!! Ticket price includes welcome cocktail, flight of 4 Whiskey tastes, and associated gratuity. As seating is very limited for , ... 11 12 Live Music – Seamus McCarthy 7pm to 10pm Live Music – Seamus McCarthy 7pm to 10pm 7:00 pm - 10:00 pm 13 British Invasion Night with The Occasions 7pm to 10pm British Invasion Night with The Occasions 7pm to 10pm 7:00 pm - 10:00 pm As a British Pub we can’t help but dedicate an evening to our heritage and the great music from the Beatles and more! Come join the fun, it’s guaranteed you will know most of these songs and maybe even want to sing along!\n , ... 14 15 Team Trivia – 7:30pm Team Trivia – 7:30pm 7:30 pm Join us for great food and fun Trivia! RESERVATIONS are required.  Call to reserve your seat: 941-492-9227\n , ... 16 17 18 19 Live Music – Shindig 7pm to 10pm Live Music – Shindig 7pm to 10pm 7:00 pm - 10:00 pm 20 BOPtoberfest Menu Starts BOPtoberfest Menu Starts 8:00 am - 6:00 pm Enjoy authentic german favorites starting Sept 20th\n , ... Live Music – Karlus Trapp 7pm to 10pm Live Music – Karlus Trapp 7pm to 10pm 7:00 pm - 10:00 pm 21 22 Team Trivia – 7:30pm Team Trivia – 7:30pm 7:30 pm Join us for great food and fun Trivia! RESERVATIONS are required.  Call to reserve your seat: 941-492-9227\n , ... 23 24 25 26 Live Music – Jonny Puma 7pm to 10pm Live Music – Jonny Puma 7pm to 10pm 7:00 pm - 10:00 pm 27 Live Music – Vince Berardi 7pm to 10pm Live Music – Vince Berardi 7pm to 10pm 7:00 pm - 10:00 pm 28 29 Team Trivia – 7:30pm Team Trivia – 7:30pm 7:30 pm Join us for great food and fun Trivia! RESERVATIONS are required.  Call to reserve your seat: 941-492-9227\n , ... 30 1 2 3 4 5 September 2025 10 Sep Whiskey Wednesday Featuring Registered Distillery One (RDOne) 6:45pm Wednesday EVENT DETAIL 12 Sep Live Music – Seamus McCarthy 7pm to 10pm Friday EVENT DETAIL 13 Sep British Invasion Night with The Occasions 7pm to 10pm Saturday EVENT DETAIL 15 Sep Team Trivia – 7:30pm Monday EVENT DETAIL 19 Sep Live Music – Shindig 7pm to 10pm Friday EVENT DETAIL 20 Sep BOPtoberfest Menu Starts Saturday EVENT DETAIL 20 Sep Live Music – Karlus Trapp 7pm to 10pm Saturday EVENT DETAIL 22 Sep Team Trivia – 7:30pm Monday EVENT DETAIL 26 Sep Live Music – Jonny Puma 7pm to 10pm Friday EVENT DETAIL 27 Sep Live Music – Vince Berardi 7pm to 10pm Saturday EVENT DETAIL 29 Sep Team Trivia – 7:30pm Monday EVENT DETAIL October 2025 03 Oct Live Music – Justin Layman 7pm to 10pm Friday, British Open Pub EVENT DETAIL No event found! Load More Hours Sun-Wed: 11AM to 10PM Thurs: 11AM to 11PM Fri & Sat: 11AM to 12AM Brunch Sun: 11AM to 2PM Happy Hour Daily: 11AM to 6PM. Location 367 Jacaranda Boulevard Venice, FL 34292 Contact us 941.492.9227 catering@britishopenpub.com Follow Follow Join Our Rewards Program Sign up for savings and rewards! SIgn Up Join Our Rewards Program Sign up for savings and rewards! SIgn Up ® 2025 The British Open Pub Privacy Policy"
    },
    {
      "url": "https://www.thepunteroxford.co.uk/contactus",
      "text": "Contact Us — The Punter Pub Oxford 0 Skip to Content Home Menu & Wine BOOK A TABLE Open Menu Close Menu Home Menu & Wine BOOK A TABLE Open Menu Close Menu Home Menu & Wine BOOK A TABLE How To Get In Touch With Us For parties of six or more, we recommend making reservation with us, and although we do our best to answer the phones during our busy service hours - we ask that you send us an email detailing your enquiry and we will get back to you at the earliest opportunity. Alternatively for walk-ins, we seat parties on a first come, first served basis, and will always do our best to find you a table. For enquiries please send us a message via the email link below: reservations@thepunteroxford.co.uk Sometimes some email clients don’t like the link we’ve provided above so if your having problems emailing us ? Don’t worry. Just give us a call on: 01865 248832 We look forward to hearing from you ! The Punter Oxford  | 7 South Street | OX2 0BE reservations@thepunteroxford.co.uk | 01865 248832 The Bar Sunday–Thursday 12pm–10:30pm Friday–Saturday 12pm–11pm The Kitchen Monday–Friday 12pm–2.30pm & 5:30pm–8:30pm Saturday & Sunday 12pm–8.30pm"
    },
    {
      "url": "https://www.mnsi.org.uk/contact-page/",
      "text": "Contact Us | Get in touch | MNSI Contact Us | Get in touch | MNSI Skip to content Skip to main menu We're always looking to improve our website. If you spot an issue please email: Enquiries@mnsi.org.uk . News, events and blog Jobs Accessibility MNSI Menu Search Menu About us Our team Our governance HSIB legacy For families Investigation overview for families Consent Investigation process for families Information in other languages and formats Help and support for families NHS Resolution Early Notification scheme Family feedback For NHS Investigation overview for NHS Refer a case to us Investigation process for NHS Information collection Staff interviews Help and support for NHS staff Staff feedback Health Equity Assessment and Resource Toolkit (HEART) and Health Equity Warning Score (HEWS) Information sharing between MNSI and CQC For other professionals Coroners Police service Position statement for regulatory bodies Publications Work with us Jobs Subject Matter Advisors Contact us Make a complaint about MNSI About us Our team Our governance HSIB legacy For families Investigation overview for families Consent Investigation process for families Information in other languages and formats Help and support for families NHS Resolution Early Notification scheme Family feedback For NHS Investigation overview for NHS Refer a case to us Investigation process for NHS Information collection Staff interviews Help and support for NHS staff Staff feedback Health Equity Assessment and Resource Toolkit (HEART) and Health Equity Warning Score (HEWS) Information sharing between MNSI and CQC For other professionals Coroners Police service Position statement for regulatory bodies Publications Work with us Jobs Subject Matter Advisors Contact us Make a complaint about MNSI News, events and blog Jobs Home > Contact us Contact us You can contact us by email or using the form on this page. You can find out how to ask us for information we hold on our Information requests page. Email Enquiries@mnsi.org.uk Alternatively, please use this form. Name* Email* Subject* Message* Privacy policy accepted MNSI Get in touch Contact us Share family feedback Share NHS staff feedback Statements Accessibility Privacy notice Modern slavery and human trafficking statement enquiries@mnsi.org.uk Share this page: X Share on Twitter LinkedIn Share on LinkedIn Facebook Share on Facebook WhatsApp Share on whatsapp Email Share over email © 2025 MNSI. All rights reserved."
    },
    {
      "url": "https://www.britishopenpub.com/",
      "text": "The British Open Pub - Venice, FL Restaurant - The British Open Pub click here to ORDER NOW Menus Events About Us Gift Cards Contact Order Now Order Catering Menus Events About Us Gift Cards Contact Order Now Order Catering Welcome to the British Open Pub Quaint English Dining & Neighborhood Pub Welcome to the British Open Pub Quaint English Dining & Neighborhood Pub Whiskey Wednesday Tickets Join us in September for Whiskey Wednesday featuring the RD ONE (Register Distillery One)! As always, seating opens at 6:15pm, welcome cocktails are served at 6:45pm, and the program begins at 7pm!! Ticket price includes welcome cocktail, flight of 4 Bourbon tastes, and associated gratuity. As seating is very limited for this event, thank you for understanding that we are unable to refund tickets after Sept 3rd. If you find yourself unable to make it after that time, please let us know and we will attempt to help offer your ticket to anyone who may be on our waitlist! Now Offering Online Ordering for Take-Away: Order Here View Menus Upcoming Events Available 11am – 2pm on Sundays only! Available 11am – 2pm on Sundays only! The True Fish & Chips Food Truck Experience is Here. Join us at one of our mobile stops or Events near you. Catering for your next event! We now offer an authentic British menu for full event catering. Your guests are sure to love the food. View our catering info Hours Sun-Wed: 11AM to 10PM Thurs: 11AM to 11PM Fri & Sat: 11AM to 12AM Brunch Sun: 11AM to 2PM Happy Hour Daily: 11AM to 6PM. Location 367 Jacaranda Boulevard Venice, FL 34292 Contact us 941.492.9227 catering@britishopenpub.com Follow Follow Join Our Rewards Program Sign up for savings and rewards! SIgn Up Join Our Rewards Program Sign up for savings and rewards! SIgn Up ® 2025 The British Open Pub Privacy Policy"
    }
  ]
}