{
  "fuentes": [
    {
      "url": "https://brix33.com/contact-us/",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://brix33.com/contact-us/",
      "email": "info@ndiscovered.com"
    },
    {
      "url": "https://guidetoflorida.com/new-port-richey/food-drink/brix-33-fine-wines-and-bistro",
      "email": "directory@guidetoflorida.com"
    },
    {
      "url": "https://guidetoflorida.com/new-port-richey/food-drink/brix-33-fine-wines-and-bistro",
      "email": "name@yoursite.com"
    },
    {
      "url": "https://joinbrix.com/",
      "email": "carol@joinbrix.com"
    },
    {
      "url": "https://brix33.com",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://brix33.com",
      "email": "info@ndiscovered.com"
    },
    {
      "url": "https://reviews.birdeye.com/brix-33-fine-wines-and-bistro-149163660636729",
      "email": "profiles@birdeye.com"
    },
    {
      "url": "https://www.jbrix.com/contact-us",
      "email": "emily@jbrix.com"
    },
    {
      "url": "https://www.jbrix.com/contact-us",
      "email": "jody@jbrix.com"
    }
  ],
  "mails": [
    "carol@joinbrix.com",
    "directory@guidetoflorida.com",
    "emily@jbrix.com",
    "filler@godaddy.com",
    "info@ndiscovered.com",
    "jody@jbrix.com",
    "name@yoursite.com",
    "profiles@birdeye.com"
  ],
  "nombre_sitio": "brix33.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://brix33.com/contact-us/",
      "text": "Contact Us Home Menus Apps, Entrées & More Weekly Chef Selections Early Evening Entrées Signature Cocktails Wine Reservations Events Martini Night Wine Down Wednesday Events Calendar Gift Cards Private Dining Testimonials Location & Hours Contact Us Home Menus Apps, Entrées & More Weekly Chef Selections Early Evening Entrées Signature Cocktails Wine Reservations Events Martini Night Wine Down Wednesday Events Calendar Gift Cards Private Dining Testimonials Location & Hours Contact Us More Home Menus Apps, Entrées & More Weekly Chef Selections Early Evening Entrées Signature Cocktails Wine Reservations Events Martini Night Wine Down Wednesday Events Calendar Gift Cards Private Dining Testimonials Location & Hours Contact Us Sign In Create Account My Account Signed in as: filler@godaddy.com My Account Sign out Signed in as: filler@godaddy.com Home Menus Apps, Entrées & More Weekly Chef Selections Early Evening Entrées Signature Cocktails Wine Reservations Events Martini Night Wine Down Wednesday Events Calendar Gift Cards Private Dining Testimonials Location & Hours Contact Us Account My Account Sign out Sign In My Account Contact Us Drop us a line! Name Email* Send This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Better yet, see us in person! We love our customers, so feel free to visit during normal business hours. Brix33 8351 Florida Highway 54, New Port Richey, Florida 34655, United States 727-835-7912 Stay in the loop with all things Brix33! Join our mailing list for exclusive updates, special offers, Sign up for our email list Connect With Us Click to view our Privacy Policy Copyright © 2025 Brix33 - All Rights Reserved. Powered by This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://guidetoflorida.com/new-port-richey/food-drink/brix-33-fine-wines-and-bistro",
      "text": "Brix 33 Fine Wines and Bistro - Guide to Florida www.guidetoflorida.com - Guide to Florida Search Home Best of Florida Best of Florida Results 2025 Best of Florida Results 2024 Best of Florida Results 2023 Best of Florida Results Best of Florida Print Annual 2024 Best of Florida Print Annual 2023 Best of Florida Print Annual Nominate a Business Vote for Your Faves How It Works Campaign Kit Stories Directory Browse Categories Browse Regions Big Bend Coastal Region Bradenton & Sarasota Region Central Panhandle Region Destin & Fort Walton Beach Region Florida Keys Region Greater Fort Lauderdale Region Greater Gainesville Region Greater Miami & Miami Beach Region Greater Orlando Region Heartland Region Jacksonville Metro & Beaches Region Lakeland & Polk County Region Nature Coast Region North Central Countryside Region Ocala, Lake & Sumter Region Palm Beach County Region Panama City & Panama City Beach Region Pensacola & Western Panhandle Region Port St. Lucie & Treasure Coast Region Southwest Florida Coast Region Space Coast Region St. Augustine Historic Coast Region St. Petersburg & Clearwater Peninsula Region Suwannee River Region Tallahassee Region List Your Business About Us Advertise Contact Us Member Login Menu Home Best of Florida Best of Florida Results 2025 Best of Florida Results 2024 Best of Florida Results 2023 Best of Florida Results Best of Florida Print Annual 2024 Best of Florida Print Annual 2023 Best of Florida Print Annual Nominate a Business Vote for Your Faves How It Works Campaign Kit Stories Directory Browse Categories Browse Regions Big Bend Coastal Region Bradenton & Sarasota Region Central Panhandle Region Destin & Fort Walton Beach Region Florida Keys Region Greater Fort Lauderdale Region Greater Gainesville Region Greater Miami & Miami Beach Region Greater Orlando Region Heartland Region Jacksonville Metro & Beaches Region Lakeland & Polk County Region Nature Coast Region North Central Countryside Region Ocala, Lake & Sumter Region Palm Beach County Region Panama City & Panama City Beach Region Pensacola & Western Panhandle Region Port St. Lucie & Treasure Coast Region Southwest Florida Coast Region Space Coast Region St. Augustine Historic Coast Region St. Petersburg & Clearwater Peninsula Region Suwannee River Region Tallahassee Region List Your Business About Us Advertise Contact Us Member Login Home United States Florida New Port Richey Food & Drink Brix 33 Fine Wines and Bistro Brix 33 Fine Wines and Bistro Share 2025 Best of Florida Honorable Mention Winner Specialty Restaurants 8351 FL-54 Unit 109, New Port Richey, Florida, 34655 Send Message 727-835-7912 Vote for Us! | Specialty Restaurants Best of Florida Vote Confirmation × Don't show this confirmation for the next 24 hours First Name Last Name Email Address Save my information and enable one-click voting for future votes on this device. I want to receive the Guide to Florida newsletter. Please complete the reCAPTCHA challenge below. Cancel Submit Your Vote! You are voting with the email Click here to switch users. Close Overview Get Directions View On Larger Map Company Name Brix 33 Fine Wines and Bistro Visit Website http://brix33.com Online Social Profiles Phone Number 727-835-7912 Location 8351 FL-54 Unit 109 New Port Richey , Florida , 34655 United States × Map View Get Directions Cancel FEATURED LISTINGS! Meat Candy BBQ Gulf Breeze, FL 32563 Website 904-445-8830 Bella Napoli Pizzeria & Restaurant Port Charlotte, FL 33980 Website 941-764-8000 Tony's Latin Food Fort Walton Beach, FL 32548 Website READ AND REAP! Southern Comfort With a Side of Soul! Dinner with a View (And Maybe a Gator) Englewood’s Sweet Spot! MORE TO EXPLORE! Best of Florida Voting Best Specialty Restaurants in Florida Guide to Alabama Georgia Business Journal Guide to Florida Get the Newsletter! Click to Subscribe Guide to Florida Subscribe Submit Story Idea Contact Us 904-515-5640 Directory List Your Company Advertise Your Company Member Login Browse Categories Best of Florida Vote For Your Favorites Download Campaign Kit Nominate a Business How it Works × Member Login * Email Address * Password Need to retrieve your password? Click Here × Get the Newsletter! The security check was not completed successfully."
    },
    {
      "url": "https://joinbrix.com/",
      "text": "Brix | Brix AI | Recruiting Made Easy with AI Automation HR Solutions Recruiter HR Assistant Global Talent Network Onboarding Manager Performance Manager For Developers Blogs for Developers Discord Community Job Board For Employers Blogs for Employer Case Study EOR Services FAQs Discover globally powered by AI Matching your talent needs with 100,000+ pre-vetted Brix candidates Try for Free hr+ Screening duration % English Speaker % F500 Brix Empowers Your Global Workforce. Delegate HR tasks to Brix's AI-powered experts, enabling you to build a top-tier global team in under two weeks, saving time and resources. Contact Us Try for Free 01 Input job details, Brix auto-crafts ideal profiles. Simply input job details; Brix Recruiter automates job descriptions, talent scoring, and pre-screening. Try for Free Describe your candidate * Provide a detailed description of your ideal candidate or use the template provided below... 0 / 1000 Tab Weâll use this description to generate related skills for you. Select the skills you want to include in your job description. Clear All Try an example Generate I want to hire an Software Engineer with 5 years of experience 20/150 Enter job detailsï¼1/2) OKï¼ 3 sï¼ 02 All that's left is the interview. Brix systematically matches talents with job profiles, selecting pre-vetted high-quality applicants ready for interviews. Track recruitment status effortlessly. 03 Onboard with passion, not location. Onboarding Manager ensures global compliance and payroll across 120+ countries, providing expert support from offer letters to paychecks. Rajesh Kumar ðµð­ Philippine peso (â±, PHP) Filipino and English See Guide Emil Kolben ð¨ð¿ Czech koruna (KÄ, CZK) Czech See Guide Peter Zhao ð¨ð³ Chinese yuan (Â¥, CNY) Chinese See Guide Oleksandr Ivanov ð¸ð¬ Singapore dollar (S$, SGD) English, Malay, Mandarin, and Tamil See Guide Onboard in 90 seconds. Get your global squad set up in just 90 seconds with all essentialsâfrom offer letters to benefits. Local Currency Payments. Pay your team in local currency for satisfaction and compliance. HR, IT, and Finance in one system. Onboard, pay, manage, and offboard in one system to save time and cut admin overhead. 04 Team Insights at a Glance. Performance Manager provides instant insights into team performance, enhancing the efficiency and effectiveness of remote management. Stay updated on your team's project progress with Jira Integration. Board views provide clear insights into sprint progress, work scope, and project deadlines. Visualize the issue-solving pipeline to manage teams' work hours and issue distribution. Team Overview helps you better understand team memberâs contributions and work status. Personalized reports on each team memberâs work status and emotional well-being. Adjust and allocate tasks reasonably to enhance team efficiency. Assess each member's OKR completion and provide fair ratings. Establish a clear team structure for better workflow coordination. Align team members with organizational OKRs and encourage self-assessment. Implement OKRs and performance evaluations for effective team management. Customized, Smooth, and Secure Experience. Integrate with your preferred tools to customize a smooth and secure automated HR workflow. Try for Free Use Integration to Break Hiring Barrier. Automate every step, link up with your go-to tools, hire faster, ditch the mistakes, and level up your productivity. Try for Free John (Ashby Integration User) \"I am glad Brix integrated with Ashby. Now I can enjoy Brix's AI scoring and filtering capabilities alongside Ashby's HRIS features on one platform.\" David (Greenhouse Integration User) \"Brix's integration with Greenhouse made it easy for me to streamline our hiring process and keep track of candidates.\" Emily (Lever Integration User) \"Lever's interface for managing interview processes can be complex, making it challenging to track and manage specific job recruitment flows, and Brix solves this issue.\" Why Choose Brix? John Burke LEADERSHIP CEO of UBIX.AI âWith Brixâs help, weâve finally been able to create a global team with round-the-clock support for our developers. Weâve definitely gained an edge over our competitors with Brix on our side.â KK LEADERSHIP Tech Cofounder at Nyquist Data Inc. âBrix's top-tier talent has been a game-changer for our competitiveness, providing 70% of our remote team at just 40% of the cost.â 1 Â /Â 2 Shaping the future of work with our AI-driven HR management solution Request A Proposal AI-Driven HR Management Solution PRODUCTS Employer of Record (EOR) Hiring Management Pricing Plan FAQs HOW IT WORKS How We Vet How To Start How To Manage RESOURCES Customer Stories About Blog Contact Â© 2025 Brix. All Rights Reserved by Worldforce Inc. Privacy Policy Terms & Conditions"
    },
    {
      "url": "https://brix33.com",
      "text": "Brix33 Brix33 Featured on the cover of New Port Richey City Lifestyle Early Evening Entrées Early Evening Entrées Early Evening Entrées Early Evening Entrées Served 4:00 pm – 5:00 pm Tuesday - Thursday Weekly Chef Selections Weekly Chef Selections Weekly Chef Selections Weekly Chef Selections 20% Tuesdays 20% Tuesdays 20% Tuesdays 20% Tuesdays Tuesday's enjoy 20% off any main entree from 4 - 9 PM (Excluding the White Truffle Lobster Risotto Specials) Wine Down Wednesday Wine Down Wednesday Wine Down Wednesday Wine Down Wednesday Enjoy 25% off all glasses or bottles of our wine and 50% off select wines Martini Thursday Martini Thursday Martini Thursday Martini Thursday Select Martini's are $5 Home Menus Apps, Entrées & More Weekly Chef Selections Early Evening Entrées Signature Cocktails Wine Reservations Events Martini Night Wine Down Wednesday Events Calendar Gift Cards Private Dining Testimonials Location & Hours Contact Us Home Menus Apps, Entrées & More Weekly Chef Selections Early Evening Entrées Signature Cocktails Wine Reservations Events Martini Night Wine Down Wednesday Events Calendar Gift Cards Private Dining Testimonials Location & Hours Contact Us More Home Menus Apps, Entrées & More Weekly Chef Selections Early Evening Entrées Signature Cocktails Wine Reservations Events Martini Night Wine Down Wednesday Events Calendar Gift Cards Private Dining Testimonials Location & Hours Contact Us Sign In Create Account My Account Signed in as: filler@godaddy.com My Account Sign out Signed in as: filler@godaddy.com Home Menus Apps, Entrées & More Weekly Chef Selections Early Evening Entrées Signature Cocktails Wine Reservations Events Martini Night Wine Down Wednesday Events Calendar Gift Cards Private Dining Testimonials Location & Hours Contact Us Account My Account Sign out Sign In My Account Click to make a reservation About Brix33 Our History Born from a passion for outstanding food, delicious wine and superior customer service. Let the culmination of Brix 33's passions become your destination for delicious food and delightful libations in a relaxed and comfortable setting. Our Atmosphere At Brix33, we believe that the dining experience is about more than just the food. That's why we've created a warm and welcoming atmosphere that's perfect for enjoying a meal with friends or family. From our cozy couches to our friendly staff, everything about our restaurant is designed to make you feel right at home. Stay in the loop with all things Brix33! Join our mailing list for exclusive updates, special offers Sign up for our email list Visit Us Brix33 8351 State Road 54, New Port Richey, Florida 34655, United States Call us for a reservation at 727-835-7912 Hours Mon Closed Tue 04:00 pm – 09:00 pm Wed 04:00 pm – 09:00 pm Thu 04:00 pm – 09:00 pm Fri 05:00 pm – 09:00 pm Sat 05:00 pm – 09:00 pm Sun Closed Get directions Follow us on Social Media Click to view our Privacy Policy Copyright © 2025 Brix33 - All Rights Reserved. Powered by This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://reviews.birdeye.com/brix-33-fine-wines-and-bistro-149163660636729",
      "text": "Brix 33 Fine Wines and Bistro - 949 Reviews - American in Trinity, FL - Birdeye Write a review For businesses Trinity, FL Restaurants American Brix 33 Fine Wines and Bistro Claim this profile This profile has not been claimed by the business owner or representative. Claim this business to update business information, get appointment requests, engage visitors with web chat, and more! Brix 33 Fine Wines and Bistro Share business profile 4.6 949 reviews American Trinity, FL Write a review Request appointment Send a message About this business Restaurants American Brix 33 is a casual upscale restaurant offering outstanding food in a relaxed and comfortable environment. Also offered is a full service wine and beer bar and a retail wine store. Brix 33 has a private event room available for parties and corporate events Location details Suggest edits 8351 FL-54 Unit 109, Ste 109, Trinity, FL, 34655, United States Get directions Weekday Schedule Status Mon 9:00 a.m. to 6:00 p.m. Tue 9:00 a.m. to 6:00 p.m. Wed 9:00 a.m. to 6:00 p.m. Thu 9:00 a.m. to 6:00 p.m. Fri 9:00 a.m. to 6:00 p.m. Sat Closed Sun Closed 4.6 949 reviews Write a review Select a rating Facebook (201) Google (748) Birdeye (0) Grace Brewer on Facebook Recommended 4 years ago It was a really cute place, for maybe like a girls night or a date. Food was good but the Martini was delicious! Sandy Deadmond on Facebook Recommended 4 years ago Very nice impressive atmosphere, excellent service and the food was delicious and served up uniquely! My new favorite Florida restaurant. Business response: Thank you for coming in! We hope to see you again soon 🙂 Dennis Watkins on Facebook Recommended 4 years ago Good was amazing. We will go back! Everyone was super friendly. Business response: Thanks for coming in Dennis! Patrick Laden on Facebook Recommended 4 years ago Great food\nGood service\nNice ambiance Michelle Lewis on Facebook Recommended 4 years ago Amazing meal!! Great service. Highly recommend. We will definitely be back! Business response: Thank you, Michelle! We are happy you enjoyed your experience. See you back soon! Robin Mariah Queal on Facebook Recommended 5 years ago New to the area. Asked on the local “FB Page” and was directed to your establishment. We LOVED it! The Charcuterie Board was very unique and tasty. The Steak was so tender I barely needed my knife. My Daughter’s (6 yrs old) favorite part was your Chocolate Cake, she highly recommends it. We will definitely be back. Business response: Awesome! Thank you so much for coming in with your family. We’re so happy you enjoyed everything. (And Welcome to New Port Richey!) Joseph Royer on Facebook Recommended 5 years ago amazing food, drinks specially on Thursday 5$ martini cant go wrong Rob Grant on Facebook Recommended 5 years ago Awesome Food, Great Service, Great people!! Susan Hausler on Facebook Recommended 5 years ago FabYOUlous Place... wonderful food\nWe got to go tonight. While I was waiting on my order I had a Sangria... loved that it had lots of Fruit... It’s nice to have a MARINATED FRUIT COCKTAIL after you finish the drink❤️🍷❤️🍷❤️🍷 1 2 3 4 5 6 7 8 9 10 Frequently asked questions about Brix 33 Fine Wines and Bistro How is Brix 33 Fine Wines and Bistro rated? Brix 33 Fine Wines and Bistro has a 4.6 star rating with 949 reviews. When is Brix 33 Fine Wines and Bistro open? Brix 33 Fine Wines and Bistro is open now. It will close at 6:00 p.m. Browse nearby Healthcare Automotive Real estate Wellness Home services Consumer services Dental Legal Finance Contractors Retail Need help? Contact us. Speak with a specialist to learn how you can grow with Birdeye. We are reachable at profiles@birdeye.com Is this your business? Update business information, get appointment requests, engage visitors with web chat, and more! Claim this profile Business information Suggest edits 8351 FL-54 Unit 109, Ste 109, Trinity, FL, 34655, United States Request appointment Call us Send a message https://brix33.com/ Google Facebook Popular Restaurants resources Blog Strategies to do digital marketing for restaurants If you are looking for amazing techniques to market your restaurants only then this is your go-to blog. Read everything about digital marketing for restaurants. 15 min read Blog 6 tips for restaurant reputation management Online reputation of your business brings you more revenue. Learn about how to grow your reputation in this blog 15 min read Blog Review Sites for Restaurants, Bars, and Food Trucks Learn about these review sites for Restaurants and food industry 15 min read Popular in Trinity, FL Pizza Restaurants American Fast Food Coffee & Tea Asian Fusion Breakfast & Brunch Chinese Desserts Ice Cream & Frozen Yogurt Birdeye for businesses Attract Listings Reviews Referrals Pages Google Seller Ratings Convert Webchat Social Appointments Mass Texting Payments Delight Messaging Surveys Insights Benchmarking Ticketing Platform BirdAI Analytics Integrations Google Partnership Birdeye Mobile App Solutions Small Business Enterprise Objectives Google for local business Review Management Review Generation Online Reputation Management Customer Messaging Referral Marketing Website Chat Google Reviews Google My Business Facebook Reviews Business Listings Management Customer Experience Social Media Management Industries Automotive Dental Financial Services Healthcare Home Services Legal Property Management Public Storage Real Estate Retail Wellness Learn more Company About Us Leadership Team Watch Demo Book a time Resources Blog Press Product Updates Careers Success Stories Birdeye Reviews Birdeye Results Legal Resources Contact Us Services Managed Services Professional Services Support and Tools Google Reviews Calculator AI Review Response Generator Google Review Link Generator Scan Your Business Find a Business For Developers Birdeye Support Refer a Business Customer Advocacy Program CONTACT SUPPORT Terms & Conditions Privacy Policy Security GDPR HIPAA CCPA Generative AI Policy © 2025 Birdeye Inc"
    },
    {
      "url": "https://www.jbrix.com/contact-us",
      "text": "Contact — J. Brix Wines J. Brix Wines Wines Shop Media/Trade Story Vineyards Tastings Contact Wine Clubs Member Shop Sign In My Account Wines / Shop Media/Trade Story / Vineyards / Tastings / Contact / Wine Clubs / Member Shop / Sign In My Account Contact Wines / Shop Media/Trade Story / Vineyards / Tastings / Contact / Wine Clubs / Member Shop / Sign In My Account The J. Brix crew wants to hear from you! Name * First Name Last Name Email Address * Message * Thank you for your interest in J. Brix! We look forward to connecting. Only Love, Emily & Jody VISIT US AT OUR SAN MARCOS TASTING ROOM! 250 N. City Dr., Suite 10 San Marcos, CA 92078 T 760.994.7295 E emily@jbrix.com //  jody@jbrix.com Copyright 2012-2025 J. Brix Wines. All Rights Reserved . Privacy Policy"
    }
  ]
}