{
  "fuentes": [
    {
      "url": "https://teamboard.cloud/",
      "email": "atlassian@devsamurai.com"
    },
    {
      "url": "https://www.shakermuseum.us/leadership",
      "email": "contact@shakermuseum.us"
    },
    {
      "url": "https://www.brokenshaker.com/private-events-chicago/",
      "email": "events.chicago@thefreehand.com"
    },
    {
      "url": "https://www.brokenshaker.com/private-events-chicago/",
      "email": "teams@authentic.nyc"
    },
    {
      "url": "https://www.brokenshaker.com/new-york-menus/",
      "email": "teams@authentic.nyc"
    },
    {
      "url": "https://www.iceshaker.com/pages/faq-contact",
      "email": "e7d54b729aaf49ea8b2f80dae22860aa@sentry.zipify.com"
    },
    {
      "url": "https://www.iceshaker.com/pages/faq-contact",
      "email": "f14faca962674f149161045845b21b35@sentry.zipify.com"
    },
    {
      "url": "https://www.iceshaker.com/pages/faq-contact",
      "email": "info@iceshaker.com"
    },
    {
      "url": "https://www.shakergroup.com/contact-us/",
      "email": "ajax-loader@2x.gif"
    },
    {
      "url": "https://www.shakergroup.com/contact-us/",
      "email": "info@shakergroup.com"
    },
    {
      "url": "https://www.shakergroup.com/contact-us/",
      "email": "infokenya@shakeregypt.com"
    },
    {
      "url": "https://www.shakergroup.com/contact-us/",
      "email": "infokenya@shakergroup.com"
    },
    {
      "url": "https://www.shakergroup.com/contact-us/",
      "email": "infoalgeria@shakergroup.com"
    },
    {
      "url": "https://www.shakergroup.com/contact-us/",
      "email": "infocairo@shakergroup.com"
    },
    {
      "url": "https://www.shakergroup.com/contact-us/",
      "email": "infoiraq@shakergroup.com"
    },
    {
      "url": "https://www.shakergroup.com/contact-us/",
      "email": "infomorocco@shakergroup.com"
    },
    {
      "url": "https://www.shakergroup.com/contact-us/",
      "email": "infoqatar@shakergroup.com"
    },
    {
      "url": "https://www.shakergroup.com/contact-us/",
      "email": "inforiyadh@shakergroup.com"
    },
    {
      "url": "https://www.shakergroup.com/contact-us/",
      "email": "infouganda@shakergroup.com"
    },
    {
      "url": "https://www.brokenshaker.com/private-events-la/",
      "email": "events.losangeles@thefreehand.com"
    },
    {
      "url": "https://www.brokenshaker.com/private-events-la/",
      "email": "teams@authentic.nyc"
    },
    {
      "url": "https://moverandshakerco.com/pages/about",
      "email": "e7d54b729aaf49ea8b2f80dae22860aa@sentry.zipify.com"
    },
    {
      "url": "https://moverandshakerco.com/pages/about",
      "email": "f14faca962674f149161045845b21b35@sentry.zipify.com"
    },
    {
      "url": "https://moverandshakerco.com/pages/about",
      "email": "info@moverandshakerco.com"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "email": "info@scibpaints.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "anirudh.shetye@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "beatrice.malle@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "info.nairobi@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "jane@skanem.ke"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "njogu@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "olive.kunihira@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "sachen.gudka@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "sameer.gaikwad@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "shamila.mirza@skanem.com"
    },
    {
      "url": "https://genius.com/albums/Lifehouse/Who-we-are",
      "email": "inquiry@genius.com"
    },
    {
      "url": "https://miamitake.com/behind-bar-gabriel-orta/",
      "email": "newsmokies-01@2x-small-4-blue.svg"
    },
    {
      "url": "https://miamitake.com/behind-bar-gabriel-orta/",
      "email": "newsmokies-01@2x-small-4.svg"
    },
    {
      "url": "https://signalcleveland.org/owner-of-deteriorating-shaker-square-apartment-buildings-meets-with-tenants/",
      "email": "nick@signalcleveland.org"
    },
    {
      "url": "https://www.brokenshaker.com/menu/happy-hour-miami/",
      "email": "fb.fhmia@thefreehand.com"
    },
    {
      "url": "https://www.brokenshaker.com/menu/happy-hour-miami/",
      "email": "teams@authentic.nyc"
    },
    {
      "url": "https://www.brokenshaker.com/",
      "email": "teams@authentic.nyc"
    },
    {
      "url": "https://www.brokenshaker.com/private-events-miami/",
      "email": "events.miami@thefreehand.com"
    },
    {
      "url": "https://www.brokenshaker.com/private-events-miami/",
      "email": "teams@authentic.nyc"
    },
    {
      "url": "https://www.brokenshaker.com/miami-menus/",
      "email": "teams@authentic.nyc"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "https://www.brokenshaker.com/location/new-york-hours-and-location/",
      "email": "teams@authentic.nyc"
    },
    {
      "url": "https://www.brokenshaker.com/privacy-policy",
      "email": "legal@thefreehand.com"
    },
    {
      "url": "https://www.brokenshaker.com/privacy-policy",
      "email": "teams@authentic.nyc"
    },
    {
      "url": "https://www.cntraveler.com/bars/miami-beach/the-broken-shaker",
      "email": "help@newyorker.com"
    },
    {
      "url": "https://teamboard.cloud/teamboard-for-monday-com/",
      "email": "atlassian@devsamurai.com"
    }
  ],
  "mails": [
    "ajax-loader@2x.gif",
    "anirudh.shetye@skanem.com",
    "atlassian@devsamurai.com",
    "beatrice.malle@skanem.com",
    "contact@shakermuseum.us",
    "e7d54b729aaf49ea8b2f80dae22860aa@sentry.zipify.com",
    "events.chicago@thefreehand.com",
    "events.losangeles@thefreehand.com",
    "events.miami@thefreehand.com",
    "f14faca962674f149161045845b21b35@sentry.zipify.com",
    "fb.fhmia@thefreehand.com",
    "help@newyorker.com",
    "info.nairobi@skanem.com",
    "info@iceshaker.com",
    "info@moverandshakerco.com",
    "info@reception-plus.de",
    "info@scibpaints.com",
    "info@shakergroup.com",
    "infoalgeria@shakergroup.com",
    "infocairo@shakergroup.com",
    "infoiraq@shakergroup.com",
    "infokenya@shakeregypt.com",
    "infokenya@shakergroup.com",
    "infomorocco@shakergroup.com",
    "infoqatar@shakergroup.com",
    "inforiyadh@shakergroup.com",
    "infouganda@shakergroup.com",
    "inquiry@genius.com",
    "jane@skanem.ke",
    "legal@thefreehand.com",
    "newsmokies-01@2x-small-4-blue.svg",
    "newsmokies-01@2x-small-4.svg",
    "nick@signalcleveland.org",
    "njogu@skanem.com",
    "olive.kunihira@skanem.com",
    "sachen.gudka@skanem.com",
    "sameer.gaikwad@skanem.com",
    "shamila.mirza@skanem.com",
    "teams@authentic.nyc"
  ],
  "nombre_sitio": "brokenshaker.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://teamboard.cloud/",
      "text": "Project Management, Resouce Planning and Gantt Chart for Jira Products ProScheduler for Jira Task Management WBS Gantt Chart Resource/Team Management Project/Portfolio Timeline Workload Management Project/Portfolio Calendar Time Tracking Report & Dashboard TimePlanner for Jira Resource Management Team Management Time Tracking, Timesheets Cost Management Client Management Report & Dashboard TeamBoard for monday.com Task Management Work Management Resource/Team Management Time Tracking Program Board TeamBoard for Salesforce Task Management Resource Management Time Tracking Reporting Portfolio Management Solutions By Industry IT Teams Marketing Sales Human Resources Operations Real Estate Customer Support Healthcare Retail By Capability Small Business Medium Business Enterprise Business By Use Case Project Managers Team Leaders Product Owners Business Owners Contractors HR Managers Financial Controllers Pricing ProScheduler for Jira TimePlanner for Jira TeamBoard for monday.com TeamBoard for Salesforce Resources Documentation Blogs What’s New eBooks Video Tutorial Webinars Integrations FAQs Support Contact us Schedule a Demo Support Desk Test on Sandbox About Us Trust Center Leave a review TeamBoard ProScheduler for Jira TeamBoard TimePlanner for Jira TeamBoard for monday.com TeamBoard for Salesforce Try Now Manage Work, Resources, and Time for Every Team in Jira Your One-Stop Solution for Project Management, Resource Planning, WBS Gantt Charts, Time Tracking, and Timesheets Our Solutions Book a Demo Trusted by Teams from TeamBoard ProScheduler for Jira Project Management, Resource Planning, Gantt Chart for Jira Top-rated capacity planning solution for projects, programs, and portfolios. Project management, tempo, structure timeline, WBS Gantt chart & risk management for Jira. Resource Planning WBS Gantt Chart & Timeline Time Tracking & Workload Report & Dashboard Project Risk Management Unlock Project Efficiency → TeamBoard TimePlanner for Jira Resource Capacity, Time Tracking & Timesheets for Jira Resource Management, Team Management , Time Tracking, Timesheets, and Cost Tracking for Jira Profile Management Task Planning Team Collaboration Timelog, Timesheets Leave, Event Planning Invoicing, and Billable Hours Tracking Client Management Optimize Your Workflow → TeamBoard for monday.com Resource Planning and Time Tracking for monday.com Resource management, capacity planning, and reports for teams to visualize projects and time management. Resource Planning with ease Workload Distribution Time Tracking & Timesheets Get Started with Resource Planning → TeamBoard for Salesforce Project and Resource Management for Salesforce Manage work and Plan resources seamlessly, Track and Report for Salesforce Work Management Resource Planning Track & Report Manage Your Resources → TeamBoard Features Project management The project management feature helps managers in overseeing their projects effectively. Learn more → Resource Planning Resource Planning feature help managers in optimizing their workforce and asset allocation. Learn more → WBS Gantt Chart WBS Gantt Chart facilitating project visualization and timeline tracking for managers. Learn more → Time Tracking, TimeSheets Time Tracking, TimeSheets allow managers to monitor hours spent on tasks accurately. Learn more → Cost Management Cost Management enables managers to oversee and control project budgets efficiently. Learn more → Others Additional features such as leave and vacation management, risk management, detailed issue tables, workload distribution, comprehensive reporting, teamboard, scheduling,… Let Our Customers Speak for Us! TimePlanner manages the application costs and consumption of materials within the project Claudio Pirtraroia on Atlassian Marketplace After a long search, found a right one shop tool that gives me insights on Workload, What is being allocated and time spent. Jacob Rajesh on Atlassian Marketplace Lovely app and great customer service. This app is very useful for us to plan resource and tasks for projects and portfolios. Look forward to the completed Gantt features and project budget management as you guys promised. Highly recommend. Hakan Eriksson on Atlassian Marketplace Beautiful app! fancy scheduler and modern UIUX, I strongly recommend this over other expensive legacy timesheets apps. Brian Ng on Atlassian Marketplace The app looks promising I have just installed it today and starting to discover it’s features. One thing I couldn’t find a way around is cancelling an Approved Vacation or changing it’s period range, it will be awesome if such option is available. Badry Hassan on Atlassian Marketplace I am using this app daily to manage my team and very satisfied with its capabilities. Support guys are very nice and normally response instantly. Keep up a good work the Samurais! Nathan Carter on Atlassian Marketplace Integrates with Multiple Platforms Integrates seamlessly with Atlassian , monday.com , and Salesforce environments and offers a centralized platform for managing tasks, projects, and resources effectively. Explore all TeamBoard Solutions Blog Posts All , Project Management 29 Aug at 6:41 am AML Case Management Tool for Your Project Management Needs All , Project Management 28 Aug at 12:03 am 7 Task Project Management Warning Signs To Watch For Resource Planning , TeamBoard TimePlanner , Time Management 9 Jul at 6:39 am TimePlanner vs. Activity Timeline: Best tool for Jira time tracking TeamBoard TimePlanner , Time Management 30 Jun at 6:08 am TimePlanner vs. Timesheets: Comparing Jira time tracking tools TeamBoard ProScheduler , Work Productivity 30 Jun at 4:06 am How to Boost Your Remote Work Productivity Project Management 20 Jun at 10:06 am 10 Common Mistakes to Avoid When Using Gantt Charts in Project Management All , Resource Planning 11 Feb at 4:50 am Why Task Management is the Missing Link in Agile Resource Planning Project Management 9 Jan at 8:30 am 2025 Project Management Trends: Essential Tools and Breakthrough Innovations TeamBoard TimePlanner 8 Jan at 3:56 am New Team UI and Exciting Updates in TimePlanner | Upcoming Release for Jira Cloud All , TeamBoard for monday.com , Time Management 5 Dec 2024 5 Tips to Optimize Time Tracking with Teamboard App on monday.com View All Blogs We’re Here for You! Knowledge Base App Support Desk Request Demo One-Stop Solution for project management, resource planning, WBS gantt charts, time tracking, and timesheets. Twitter YouTube Pinterest Facebook LinkedIn Solutions Gantt Chart for Jira with TeamBoard Resource Planning Cost Management Resource Management Time tracking, Timesheets Project Management Support Documentation Video About Us Contact Us TeamBoard Demo Request eBooks Pricing Test on Sandbox Trust Center Sitemap Other products ProductGo AssetIT Mocky Leanboard AgileTest AgileBox Routemap TaskFord AssetLoom Contact Us hello@teamboard.cloud +81 50 362 78910 DevSamurai, Inc. 3-6-25 Komone, Itabashi-ku, Tokyo 173-0037 Japan © 2022 TeamBoard. All Right Reserved. Menu"
    },
    {
      "url": "https://www.shakermuseum.us/leadership",
      "text": "Leadership – Shaker Museum Home Collections Explore Collections History of the Shakers Past Exhibitions About Museum Today Mission Leadership History of the Museum Makers’ Circle Work With Us Our 990 Visit New Shaker Museum Location Pop-up Exhibitions Online Collections Mount Lebanon Historic Site Give Donate Become a Member Be a Corporate Partner Estate Planning Our Supporters Capital Campaign Press In the News Press Releases X Shaker Museum Home Collections Explore Collections History of the Shakers Past Exhibitions About Museum Today Mission Leadership History of the Museum Makers’ Circle Work With Us Our 990 Visit New Shaker Museum Location Pop-up Exhibitions Online Collections Mount Lebanon Historic Site Give Donate Become a Member Be a Corporate Partner Estate Planning Our Supporters Capital Campaign Press In the News Press Releases X Leadership Shaker Museum is supported by a committed, engaged, and active board of trustees; daily operations are run by a devoted and tireless staff. CLAUDIA GOULD Executive Director JERRY GRANT Director of Library & Collections Katie Krocheski Advancement Associate LISA MALONE JACKSON Deputy Director ELIZABETH MILLER Visitor Engagement Associate ELSBETH PANCRAZI Director of Development MELISSA PETERS Office Manager Dana Rasso Senior Communications Manager Board Members BEN BISCHOFF Board Director Ben Bischoff is a registered architect and contractor in New York and is the principal of MADE Design/Build, which is distinguished by an embrace of building craft designed with innovation and originality for residential and commercial projects. Ben has been a trustee of Shaker Museum since 2018 and serves as the chair of the building committee leading the development of the new home for the Shaker Museum collection. JAMES KOCIS Board Director James Kocis is the founder and former CEO of Burgiss, a data and analytics financial technologies company recently acquired by MSCI. Jim earned a degree in chemical engineering from the New Jersey Institute of Technology and has a life-long commitment to open space and public works, having begun his career in environmental conservation and planning in the New Jersey Meadowlands. He resides in Hoboken, New Jersey and Chatham, New York. JOHN SCHOBEL Vice Chair John Schobel is the former CEO/Founder of \nRegEd Inc., which he transformed into the \nmarket-leading provider of regulatory compliance education and enterprise solutions for the financial services industry. John holds a B.A. from New York University and a J.D. from Washington University. His interests include art and architecture, consumer electronics, innovative software, and the promotion of financial literacy for underserved communities. PAUL CASSIDY Chair Paul Cassidy has been a Shaker Museum trustee since 2010 and board chair since 2016.  In addition to a keen appreciation of Shaker design, Paul is most interested in building community based on the Shaker core values of integrity, inclusion, and innovation.  Paul has a widely varied background in hospitality and construction, and currently lives in Stuyvesant, New York with his husband, Vernon Evenson. JOE KUSNICK Board Director Joe Kusnick is the founding principal of AE Greyson. Born and raised in Miami/Coral Gables, Florida, Joe earned his Bachelor of Architecture degree with a focus on new urbanism studying with Andrés Duany and Elizabeth Plater-Zyberk at the University of Miami. Joe is a lead sponsor of the Institute of Classical Architecture & Art’s In Your Neighborhood film series,  Open House New York, and the New York Landmarks Preservation Foundation. JEREMY STYNES Secretary Jeremy Stynes is the Managing Director of Innovation at BDO USA, driving new revenue across the Forensics practice through partnerships and technology transformation. Jeremy has worked for Fortune 100 companies, consulting firms, nonprofits, and academic institutions. He holds two bachelor’s degrees from Emory University in art history and French and a master’s degree from Harvard in technology. His interests include AI, architecture, Hudson Valley historic preservation, and LGBTQ+ philanthropy. CARL R. FISCHER IV Board Director Carl R. Fischer IV is the Global Head of Marketing for Bloomberg Connects, a free app providing cultural organizations a platform to broaden access to their collections. Supported by Bloomberg Philanthropies, Bloomberg Connects has more than 2.8 million users and features multimedia guides to hundreds of cultural spaces around the world. Carl’s passion for the arts was kindled by childhood visits to the Philadelphia Museum of Art. He holds a B.A. from Hobart College and splits his time between Austerlitz, New York, and Brooklyn. LAEL LOCKE Board Director Lael Locke is a longtime resident of Chatham, where she remains active in both local government and community organizations. A former newspaper editor and publisher whose projects included a free monthly newspaper distributed in Columbia and Duchess counties, she also worked as a project specialist with the New York Planning Federation, a statewide planning and zoning nonprofit. Lael joined the board in 2021. KAREN SUEN-COOPER Board Director Karen Suen-Cooper, a fashion veteran in the luxury sector and Parsons School of Design alumna, is co-founder of The Punctilious Mr. P’s Place Card Co., a luxury home accessories brand. Their namesake “place card” is the welcome gesture of inclusion and belonging. The brand is inspired by the gracious country life of Old Chatham, home of Shaker Museum. JOHN FRISHKOPF Treasurer John Frishkopf is the founder and CEO of Klocke Estate, an earth-to-glass destination brandy distillery in Claverack, New York. John is also an advisory/operating partner of several investment funds, serves on the board of directors of two companies, and was a founder of NewStar Financial where he was the treasurer and head of asset management. He received his bachelor’s degree from MIT and his master’s in management science from MIT Sloan. PHIL MEEKS Board Director Phil Meeks recently retired as the EVP/President at Spectrum Enterprise and was formerly at Time Warner Cable, Cox Business, MCI, and AT&T. He is board chair for the Harlem Valley Rail Trail and on the board of advisors for the New York State Trust for Public Land. Phil earned a bachelor’s degree in marketing/journalism at the University of Georgia and currently resides in Ghent, New York, and New York City. KATHY WEISER Board Director Kathy Weiser was born and raised in Buffalo, New York, and currently divides her time between Columbia County and New York City’s Upper West Side. Kathy is a retired lead paralegal/administrator for a commercial litigation practice group at a major New York City law firm. The former secretary of the board for the Anderson School, Kathy joined the board in 2019 and is the current chair of the development committee. RAE GILSON Board Director Rae Gilson enjoyed a long and successful career in real estate sales and property management in New York City and recently brought her real estate expertise to the Hudson Valley where she has had a home for decades.  Rae has served on the board since 2014 and is a passionate student of the Shaker legacy. She leads the volunteer team that helps maintain the historic Mount Lebanon site. RACHEL ROBBINS Board Director Rachel Robbins is the cofounder and executive director of Tangible Mind, a design and social innovation nonprofit based in the Hudson Valley and Cambridge, Massachusetts. Prior to her work in the social sector, she spent 18 years in emerging tech, helping companies to innovate through design leadership and strategy, and has taught design at the Keller Center for Innovation in Engineering at Princeton University in their entrepreneurship track and in the Parsons School of Design Strategic Design and Management program. In 2020, she was a visiting fellow in the Parsons Transdisciplinary Design program and the Design for Social Innovation and Sustainability program (DESIS). She believes in the potential for design and creative thinking to transform society. COLLECTIONS Explore Collections History of the Shakers Past Exhibitions ABOUT Museum Today Our Mission Leadership History of the Museum Makers’ Circle Work With Us Our 990 VISIT New Shaker Museum Location Pop-up Exhibitions Online Collection Mount Lebanon Historic Site GIVE Donate Become a Member Corporate Partners Estate Planning Our Supporters Capital Campaign PRESS In the News Press Releases Contact Us 518.794.9100 contact@shakermuseum.us Follow Us Instagram Facebook Youtube Linkedin-in Sign up for our newsletter Your email address Subscribe Privacy Policy Terms of Service PO Box 328, Chatham, NY 12037 Shaker Museum © 2023 All Rights Reserved. JERRY GRANT Director of Library & Collections Jerry Grant came to Shaker Museum in the fall of 1987 following a decade of experience working in various capacities at Shaker museums and as a maker of Shaker furniture. Jerry has published and lectured widely about the Shakers. Jerry and his wife live in East Chatham, New York, equidistant from Shaker Museum’s historic site at Mount Lebanon and its upcoming new facility in Chatham. Katie Krocheski Advancement Associate Katie Krocheski (Advancement Associate) is a graduate of the University of Connecticut, where she majored in art history, co-founded the Art + Art History Club, and interned at the Wadsworth Atheneum and New Britain Museum of American Art. In addition to supporting all aspects of Shaker Museum’s fundraising and membership initiatives, Katie will also be greeting visitors at Shaker Museum’s Kinderhook pop-up exhibition space. Lisa Malone Jackson Deputy Director Lisa Malone Jackson brings a wealth of experience and dedication to her role as Deputy Director of Shaker Museum. For the past eight years, she has been an integral part of the museum’s executive leadership team. She has worked closely with the Board of Directors and the staff to execute the strategic plan for the institution. Her vision and leadership have been instrumental in the museum’s growth and success during her tenure. Lisa conceived of and continues to spearhead the highly successful Be in the Gift capital campaign. Her strategic approach to major fundraising efforts has consistently yielded impressive results. Additionally, Lisa has played a crucial operations role, helping the museum navigate the pandemic, thoughtfully recruiting new staff members, and creating key positions to build the museum’s capacity and broaden its reach. Her commitment to a dynamic organizational structure has allowed the museum to develop and offer increasingly diverse and engaging programming that delivers on its mission. Elizabeth Miller Visitor Engagement Associate Elizabeth Miller lives in Chatham, New York and has been working with Shaker Museum pop-ups since 2021.  Elizabeth was formerly the owner and buyer for Jenny B. Goode New York, a renowned retail home goods and specialty gift boutique, and she was also a personal stylist for Bergdorf Goodman. Elsbeth Pancrazi Director of Development Elsbeth Pancrazi (she/her) brings more than 15 years of experience fundraising for New York arts, cultural, and environmental institutions including Brooklyn Botanic Garden, Center for Book Arts, and the New York Hall of Science (NYSCI). She sees museums as transformational public resources with the potential to improve lives and communities —and provide some of the best inspirations for how to build a more thoughtful and equitable society. She holds a BA from Vassar College and an MFA in creative writing from New York University. In addition to her work as a fundraiser, she is a poet, an artist, a reader, and a gardener. Melissa Peters Office Manager Melissa Peters has been working at Shaker Museum since 2018.  She has lived in Columbia County for over 25 years and been involved with several other local nonprofits including Powell House, The Alternative Learning Center, and Behold New Lebanon. Dana Rasso Senior Communications Manager Dana Rasso has 20+ years of experience with non-profits developing specialized media content and strategies for diverse audiences. Her work encompasses advocacy in reproductive justice, discriminatory policing, abusive immigration practices, religious discrimination, and LGBTQ persecution. Dana has a BFA in art history from Savannah College of Art and Design and an MA in communications management and technology from New York University."
    },
    {
      "url": "https://www.brokenshaker.com/private-events-chicago/",
      "text": "Chicago Private Events | The Broken Shaker in the US Skip to main content About New York sub-menu New York About Happenings Private Events Reservations Menus Los Angeles sub-menu Los Angeles About Happenings Private Events Reservations Menus Miami sub-menu Miami About Happenings Private Events Reservations Menus Chicago sub-menu Chicago About Happenings Private Events Reservations Menus Madrid sub-menu Madrid About Happenings Private Events Madrid Menus Reservations Toggle Navigation About New York sub-menu New York About Happenings Private Events Reservations Menus Los Angeles sub-menu Los Angeles About Happenings Private Events Reservations Menus Miami sub-menu Miami About Happenings Private Events Reservations Menus Chicago sub-menu Chicago About Happenings Private Events Reservations Menus Madrid sub-menu Madrid About Happenings Private Events Madrid Menus Freehand Hotels Press Contact Us Privacy Policy Reservations Email Signup Instagram powered by BentoBox Main content starts here, tab to start navigating Slide 1 of 3 Slide 2 of 3 Slide 3 of 3 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Planning an Event With Us? FREEHAND CHICAGO Whether you’re hosting an intimate dinner with friends or a happy hour for your team, we’re here to provide you with a variety of unique spaces tailored to your needs. Please contact our sales team for more information. (312) 940-3699 events.chicago@thefreehand.com Private Event Software powered by Tripleseat Reservations Instagram Freehand Hotels Press Contact Us Privacy Policy Email Signup powered by BentoBox leave this field blank Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Reservations Location - Required Location Broken Shaker | Cocktail Bar & Restaurant in the US Miami Chicago Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Please, select a date Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."
    },
    {
      "url": "https://www.brokenshaker.com/new-york-menus/",
      "text": "New York Menus | Broken Shaker in the US Skip to main content About New York sub-menu New York About Happenings Private Events Reservations Menus Los Angeles sub-menu Los Angeles About Happenings Private Events Reservations Menus Miami sub-menu Miami About Happenings Private Events Reservations Menus Chicago sub-menu Chicago About Happenings Private Events Reservations Menus Madrid sub-menu Madrid About Happenings Private Events Madrid Menus Reservations Toggle Navigation About New York sub-menu New York About Happenings Private Events Reservations Menus Los Angeles sub-menu Los Angeles About Happenings Private Events Reservations Menus Miami sub-menu Miami About Happenings Private Events Reservations Menus Chicago sub-menu Chicago About Happenings Private Events Reservations Menus Madrid sub-menu Madrid About Happenings Private Events Madrid Menus Freehand Hotels Press Contact Us Privacy Policy Reservations Email Signup Instagram powered by BentoBox Main content starts here, tab to start navigating Menus HOUSE COCKTAILS HAPPY HOUR FOOD WINES BEER & SELTZERS NON ALCOHOLIC HOUSE COCKTAILS $18 OSCAR DE LA HOYA Dobel Diamanté Tequila, Diplomatico Planas Rum, Aperol, Strawberry, Fire Tincture BROKEN SHAKER OLD FASHIONED Jack Daniels Bonded Rye Whiskey, Demerara, Angostura Bitters, Regan’s Orange Bitters FLATIRON NEGRONI Fords Gin, Campari, Carpano Antica UP ON THE ROOF Su Casa Mezcal, Chambord, Watermelon, Basil, Fire Tincture EAST OF EDEN Codigo Blanco Tequila, St. Germain, Verjus Blanc, Cucumber, Mint OAXACAN SLING BLADE Rosaluna Mezcal, Cherry Herring, Combier, Pomegranate ASPHALT JUNGLE Hendrick’s Gin, Choya Yuzu Shu,\nGiffard Lichi-Li, Pear ELECTRIC WARRIOR Absolut Elyx Vodka, St. Germain, Lemon-Lime Cordial, Rosemary THYME IS MONÉ Malfy Con Limone Gin, Le Moné, Meyer Lemon Aperitif, Thyme, Prosecco RED BULL RAY-FRESHER Tequila, Fresh Lime Juice, Agave, Red Bull Red Edition (Watermelon)\n(also available “skinny”with Sugar-Free Red Bull Red Edition) SPECIALS DAILY FROZEN Ask a team member! $ 18 DAILY PUNCH Ask a team member! $ 14 MOCKTAILS $14 SINLESS PASSION Seedlip Grove 42, Pomegranate, Cinnamon,\nPineapple, Passionfruit, Ginger Beer MANGO NOGRITA Ritual Tequila Alternative, Lemon-Lime Cordial, Mango, Honey, Tajin MYKONOS SPRITZ - NYC Ritual Gin Alternative, Fever Tree Mediterranean Tonic, Olive Brine, Grapefruit, Rosemary TUESDAY - SATURDAY: 4PM-6PM COCKTAILS $13 DAILY PUNCH Ask a Team Member! CLASSIC MARGARITA De-Nada Tequila, Triple Sec, Agave, Salted Rim THYME IS MONE Le Moné Meyer Lemon Aperitif, Malfy Con Limone Gin, Thyme, Prosecco, Lemon BEERS $6 Add a shot of Gran Centenario Tequila or Jack Daniel's Whiskey $6 TECATE WINE $10 HOUSE WHITE HOUSE RED FOOD GUAC & CHIPS $ 9 HUMMUS & PITA $ 9 SPICY TUNA CRISPY RICE Yellowfin Tuna, Pickled Ginger, Spicy Aioli, Jalapeños $ 12 FRIED FISH TACO Blue Corn Tortilla, Tempura Battered Fish, Red Cabbage, Pico de Gallo, Chipotale Aioli $ 10 FRENCH FRIES $ 6 Daily 4pm - 11pm BITES GUACAMOLE Housemade Guacamole, Burnt Poblano Salsa, Chips $ 15 ROASTED RED PEPPER HUMMUS Crudite, Pita Bread $ 13 SPICY TUNA CRISPY RICE Yellowfin Tuna, Pickled Ginger, Spicy Aioli, Jalapeños $ 16 SHRIMP CEVICHE Wild Caught Shrimp, Passion Fruit, Avocado,\nJalapeños, Red Onion, Cilantro, Green Plantains $ 16 MUSHROOM CRISPY CHEESE TACO Two Open Face Blue Corn Tortillas, Mushrooms,\nAvocado Salsa Verde, Pickled Red Onion Mushroom $ 16 Add Chicken + $ 5 FRIED FISH TACOS Two Blue Corn Tortillas, Tempura Battered Fish, Red Cabbage, Pico de Gallo, Chipotle Aioli $ 18 SANDWICHES Served with Fries or Salad CRISPY CHICKEN SANDWICH Cabbage Slaw, Scallions, Pickles, Yuzu Ranch $ 18 BROKEN SHAKER BURGER Beef Patty, American Cheese, Pickles, Onions, Shaker Sauce Single $ 15 Make It A Double + $ 5 SALAD HOUSE SALAD Gem Lettuce, Radishes, Radicchio, Fennel, Lemon-Thyme Vinaigrette Salad $ 12 Add Avocado + $ 3 SIDES FRENCH FRIES $ 9 PITA BREAD $ 5 FRIED PLANTAINS $ 5 SWEETS HOUSE BAKED COOKIES Two Chocolate Chip Cookies Cookies $ 8 Add Vanilla Bean Ice Cream + $ 5 Add Chocolate or Caramel Sauce + $ 3 BUBBLY CAPOSALDO PROSECCO Veneto, Italy Glass $ 14 Bottle $ 60 G.H. MUMM BRUT NV Reims, FR Glass $ 20 Bottle $ 85 WHITE SWIFT SAUVIGNON BLANC Marlborough, NZ Glass $ 16 Bottle $ 70 ROSE SYMPHONIE CHATEAU STE. MARGUERITE Côte de Provence, FR Glass $ 17 Bottle $ 75 RED BOEN PINOT NOIR Tri Country, CA Glass $ 17 Bottle $ 75 BEER & SELTZERS MEXICAN LAGER $ 7 PERONI $ 9 MONTAUK TROPICAL IPA $ 8 WOLFFER ESTATE DRY ROSE CIDER 12oz $ 14 LAKE HOUR Flavors: Watermelon Cucumber, Peach Jasmine, Rosemary Yuzu\n5% ABV Single Can $ 9 Bucket of 5 $ 40 MOCKTAILS SINLESS PASSION Seedlip Grove 42, Pomegranate, Cinnamon, Pineapple, Passionfruit, Ginger Beer $ 14 MANGO NOGRITA Ritual Tequila Alternative, Lemon-Lime Cordial, Mango, Honey, Tajin $ 14 MYKONOS SPRITZ Ritual Gin Alternative, Fever Tree Mediterranean Tonic, Olive Brine, Grapefruit, Rosemary $ 14 NA BEER & WINE PERONI 0.0% $ 8 BERO HAZY IPA $ 8 KOLONNE NULL ROSE Glass $ 14 Bottle $ 60 Reservations Instagram Freehand Hotels Press Contact Us Privacy Policy Email Signup powered by BentoBox leave this field blank Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Reservations Location - Required Location Broken Shaker | Cocktail Bar & Restaurant in the US Miami Chicago Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Please, select a date Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."
    },
    {
      "url": "https://www.iceshaker.com/pages/faq-contact",
      "text": "Contact Us & FAQs | Ice Shaker Accessibility Staement Skip to content Free Shipping on Orders $50+ Menu Search Shop Bottles SHAKERS 26oz Ice Shakers 20oz Skinny Shakers Accessories & Parts The Custom Shop Community Initiatives About Us Contact Us Ice Shaker USD $ Country Afghanistan (AFN ؋) Åland Islands (EUR €) Albania (ALL L) Algeria (DZD د.ج) Andorra (EUR €) Angola (USD $) Anguilla (XCD $) Antigua & Barbuda (XCD $) Argentina (USD $) Armenia (AMD դր.) Aruba (AWG ƒ) Ascension Island (SHP £) Australia (AUD $) Austria (EUR €) Azerbaijan (AZN ₼) Bahamas (BSD $) Bahrain (USD $) Bangladesh (BDT ৳) Barbados (BBD $) Belarus (USD $) Belgium (USD $) Belize (BZD $) Benin (XOF Fr) Bermuda (USD $) Bhutan (USD $) Bolivia (BOB Bs.) Bosnia & Herzegovina (BAM КМ) Botswana (BWP P) Brazil (USD $) British Indian Ocean Territory (USD $) British Virgin Islands (USD $) Brunei (BND $) Bulgaria (BGN лв.) Burkina Faso (XOF Fr) Burundi (BIF Fr) Cambodia (KHR ៛) Cameroon (XAF CFA) Canada (CAD $) Cape Verde (CVE $) Caribbean Netherlands (USD $) Cayman Islands (KYD $) Central African Republic (XAF CFA) Chad (XAF CFA) Chile (USD $) China (CNY ¥) Christmas Island (AUD $) Cocos (Keeling) Islands (AUD $) Colombia (USD $) Comoros (KMF Fr) Congo - Brazzaville (XAF CFA) Congo - Kinshasa (CDF Fr) Cook Islands (NZD $) Costa Rica (CRC ₡) Côte d’Ivoire (XOF Fr) Croatia (EUR €) Curaçao (ANG ƒ) Cyprus (EUR €) Czechia (CZK Kč) Denmark (DKK kr.) Djibouti (DJF Fdj) Dominica (XCD $) Dominican Republic (DOP $) Ecuador (USD $) Egypt (EGP ج.م) El Salvador (USD $) Equatorial Guinea (XAF CFA) Eritrea (USD $) Estonia (EUR €) Eswatini (USD $) Ethiopia (ETB Br) Falkland Islands (FKP £) Faroe Islands (DKK kr.) Fiji (FJD $) Finland (EUR €) France (EUR €) French Guiana (EUR €) French Polynesia (XPF Fr) French Southern Territories (EUR €) Gabon (XOF Fr) Gambia (GMD D) Georgia (USD $) Germany (EUR €) Ghana (USD $) Gibraltar (GBP £) Greece (EUR €) Greenland (DKK kr.) Grenada (XCD $) Guadeloupe (EUR €) Guatemala (GTQ Q) Guernsey (GBP £) Guinea (GNF Fr) Guinea-Bissau (XOF Fr) Guyana (GYD $) Haiti (USD $) Honduras (HNL L) Hong Kong SAR (HKD $) Hungary (HUF Ft) Iceland (ISK kr) India (INR ₹) Indonesia (IDR Rp) Iraq (USD $) Ireland (EUR €) Isle of Man (GBP £) Israel (ILS ₪) Italy (EUR €) Jamaica (JMD $) Japan (JPY ¥) Jersey (USD $) Jordan (USD $) Kazakhstan (KZT ₸) Kenya (KES KSh) Kiribati (USD $) Kosovo (EUR €) Kuwait (USD $) Kyrgyzstan (KGS som) Laos (LAK ₭) Latvia (EUR €) Lebanon (LBP ل.ل) Lesotho (USD $) Liberia (USD $) Libya (USD $) Liechtenstein (CHF CHF) Lithuania (EUR €) Luxembourg (EUR €) Macao SAR (MOP P) Madagascar (USD $) Malawi (MWK MK) Malaysia (MYR RM) Maldives (MVR MVR) Mali (XOF Fr) Malta (EUR €) Martinique (EUR €) Mauritania (USD $) Mauritius (MUR ₨) Mayotte (EUR €) Mexico (USD $) Moldova (MDL L) Monaco (EUR €) Mongolia (MNT ₮) Montenegro (EUR €) Montserrat (XCD $) Morocco (MAD د.م.) Mozambique (USD $) Myanmar (Burma) (MMK K) Namibia (USD $) Nauru (AUD $) Nepal (NPR Rs.) Netherlands (EUR €) New Caledonia (XPF Fr) New Zealand (NZD $) Nicaragua (NIO C$) Niger (XOF Fr) Nigeria (NGN ₦) Niue (NZD $) Norfolk Island (AUD $) North Macedonia (MKD ден) Norway (USD $) Oman (USD $) Pakistan (PKR ₨) Palestinian Territories (ILS ₪) Panama (USD $) Papua New Guinea (PGK K) Paraguay (PYG ₲) Peru (PEN S/) Philippines (PHP ₱) Pitcairn Islands (NZD $) Poland (PLN zł) Portugal (EUR €) Qatar (QAR ر.ق) Réunion (EUR €) Romania (RON Lei) Russia (USD $) Rwanda (RWF FRw) Samoa (WST T) San Marino (EUR €) São Tomé & Príncipe (STD Db) Saudi Arabia (SAR ر.س) Senegal (XOF Fr) Serbia (RSD РСД) Seychelles (USD $) Sierra Leone (SLL Le) Singapore (SGD $) Sint Maarten (ANG ƒ) Slovakia (EUR €) Slovenia (EUR €) Solomon Islands (SBD $) Somalia (USD $) South Africa (USD $) South Georgia & South Sandwich Islands (GBP £) South Korea (KRW ₩) South Sudan (USD $) Spain (EUR €) Sri Lanka (LKR ₨) St. Barthélemy (EUR €) St. Helena (SHP £) St. Kitts & Nevis (XCD $) St. Lucia (XCD $) St. Martin (EUR €) St. Pierre & Miquelon (EUR €) St. Vincent & Grenadines (XCD $) Sudan (USD $) Suriname (USD $) Svalbard & Jan Mayen (USD $) Sweden (SEK kr) Switzerland (CHF CHF) Taiwan (TWD $) Tajikistan (TJS ЅМ) Tanzania (TZS Sh) Thailand (THB ฿) Timor-Leste (USD $) Togo (XOF Fr) Tokelau (NZD $) Tonga (TOP T$) Trinidad & Tobago (TTD $) Tristan da Cunha (GBP £) Tunisia (USD $) Türkiye (USD $) Turkmenistan (USD $) Turks & Caicos Islands (USD $) Tuvalu (AUD $) U.S. Outlying Islands (USD $) Uganda (UGX USh) Ukraine (UAH ₴) United Arab Emirates (AED د.إ) United Kingdom (GBP £) United States (USD $) Uruguay (UYU $U) Uzbekistan (UZS so'm) Vanuatu (VUV Vt) Vatican City (EUR €) Venezuela (USD $) Vietnam (VND ₫) Wallis & Futuna (XPF Fr) Western Sahara (MAD د.م.) Yemen (YER ﷼) Zambia (USD $) Zimbabwe (USD $) Search Login Cart 0 items 0 Shop Bottles Accessories & Parts The Custom Shop Community Initiatives About Us Contact Us USD $ Country Afghanistan (AFN ؋) Åland Islands (EUR €) Albania (ALL L) Algeria (DZD د.ج) Andorra (EUR €) Angola (USD $) Anguilla (XCD $) Antigua & Barbuda (XCD $) Argentina (USD $) Armenia (AMD դր.) Aruba (AWG ƒ) Ascension Island (SHP £) Australia (AUD $) Austria (EUR €) Azerbaijan (AZN ₼) Bahamas (BSD $) Bahrain (USD $) Bangladesh (BDT ৳) Barbados (BBD $) Belarus (USD $) Belgium (USD $) Belize (BZD $) Benin (XOF Fr) Bermuda (USD $) Bhutan (USD $) Bolivia (BOB Bs.) Bosnia & Herzegovina (BAM КМ) Botswana (BWP P) Brazil (USD $) British Indian Ocean Territory (USD $) British Virgin Islands (USD $) Brunei (BND $) Bulgaria (BGN лв.) Burkina Faso (XOF Fr) Burundi (BIF Fr) Cambodia (KHR ៛) Cameroon (XAF CFA) Canada (CAD $) Cape Verde (CVE $) Caribbean Netherlands (USD $) Cayman Islands (KYD $) Central African Republic (XAF CFA) Chad (XAF CFA) Chile (USD $) China (CNY ¥) Christmas Island (AUD $) Cocos (Keeling) Islands (AUD $) Colombia (USD $) Comoros (KMF Fr) Congo - Brazzaville (XAF CFA) Congo - Kinshasa (CDF Fr) Cook Islands (NZD $) Costa Rica (CRC ₡) Côte d’Ivoire (XOF Fr) Croatia (EUR €) Curaçao (ANG ƒ) Cyprus (EUR €) Czechia (CZK Kč) Denmark (DKK kr.) Djibouti (DJF Fdj) Dominica (XCD $) Dominican Republic (DOP $) Ecuador (USD $) Egypt (EGP ج.م) El Salvador (USD $) Equatorial Guinea (XAF CFA) Eritrea (USD $) Estonia (EUR €) Eswatini (USD $) Ethiopia (ETB Br) Falkland Islands (FKP £) Faroe Islands (DKK kr.) Fiji (FJD $) Finland (EUR €) France (EUR €) French Guiana (EUR €) French Polynesia (XPF Fr) French Southern Territories (EUR €) Gabon (XOF Fr) Gambia (GMD D) Georgia (USD $) Germany (EUR €) Ghana (USD $) Gibraltar (GBP £) Greece (EUR €) Greenland (DKK kr.) Grenada (XCD $) Guadeloupe (EUR €) Guatemala (GTQ Q) Guernsey (GBP £) Guinea (GNF Fr) Guinea-Bissau (XOF Fr) Guyana (GYD $) Haiti (USD $) Honduras (HNL L) Hong Kong SAR (HKD $) Hungary (HUF Ft) Iceland (ISK kr) India (INR ₹) Indonesia (IDR Rp) Iraq (USD $) Ireland (EUR €) Isle of Man (GBP £) Israel (ILS ₪) Italy (EUR €) Jamaica (JMD $) Japan (JPY ¥) Jersey (USD $) Jordan (USD $) Kazakhstan (KZT ₸) Kenya (KES KSh) Kiribati (USD $) Kosovo (EUR €) Kuwait (USD $) Kyrgyzstan (KGS som) Laos (LAK ₭) Latvia (EUR €) Lebanon (LBP ل.ل) Lesotho (USD $) Liberia (USD $) Libya (USD $) Liechtenstein (CHF CHF) Lithuania (EUR €) Luxembourg (EUR €) Macao SAR (MOP P) Madagascar (USD $) Malawi (MWK MK) Malaysia (MYR RM) Maldives (MVR MVR) Mali (XOF Fr) Malta (EUR €) Martinique (EUR €) Mauritania (USD $) Mauritius (MUR ₨) Mayotte (EUR €) Mexico (USD $) Moldova (MDL L) Monaco (EUR €) Mongolia (MNT ₮) Montenegro (EUR €) Montserrat (XCD $) Morocco (MAD د.م.) Mozambique (USD $) Myanmar (Burma) (MMK K) Namibia (USD $) Nauru (AUD $) Nepal (NPR Rs.) Netherlands (EUR €) New Caledonia (XPF Fr) New Zealand (NZD $) Nicaragua (NIO C$) Niger (XOF Fr) Nigeria (NGN ₦) Niue (NZD $) Norfolk Island (AUD $) North Macedonia (MKD ден) Norway (USD $) Oman (USD $) Pakistan (PKR ₨) Palestinian Territories (ILS ₪) Panama (USD $) Papua New Guinea (PGK K) Paraguay (PYG ₲) Peru (PEN S/) Philippines (PHP ₱) Pitcairn Islands (NZD $) Poland (PLN zł) Portugal (EUR €) Qatar (QAR ر.ق) Réunion (EUR €) Romania (RON Lei) Russia (USD $) Rwanda (RWF FRw) Samoa (WST T) San Marino (EUR €) São Tomé & Príncipe (STD Db) Saudi Arabia (SAR ر.س) Senegal (XOF Fr) Serbia (RSD РСД) Seychelles (USD $) Sierra Leone (SLL Le) Singapore (SGD $) Sint Maarten (ANG ƒ) Slovakia (EUR €) Slovenia (EUR €) Solomon Islands (SBD $) Somalia (USD $) South Africa (USD $) South Georgia & South Sandwich Islands (GBP £) South Korea (KRW ₩) South Sudan (USD $) Spain (EUR €) Sri Lanka (LKR ₨) St. Barthélemy (EUR €) St. Helena (SHP £) St. Kitts & Nevis (XCD $) St. Lucia (XCD $) St. Martin (EUR €) St. Pierre & Miquelon (EUR €) St. Vincent & Grenadines (XCD $) Sudan (USD $) Suriname (USD $) Svalbard & Jan Mayen (USD $) Sweden (SEK kr) Switzerland (CHF CHF) Taiwan (TWD $) Tajikistan (TJS ЅМ) Tanzania (TZS Sh) Thailand (THB ฿) Timor-Leste (USD $) Togo (XOF Fr) Tokelau (NZD $) Tonga (TOP T$) Trinidad & Tobago (TTD $) Tristan da Cunha (GBP £) Tunisia (USD $) Türkiye (USD $) Turkmenistan (USD $) Turks & Caicos Islands (USD $) Tuvalu (AUD $) U.S. Outlying Islands (USD $) Uganda (UGX USh) Ukraine (UAH ₴) United Arab Emirates (AED د.إ) United Kingdom (GBP £) United States (USD $) Uruguay (UYU $U) Uzbekistan (UZS so'm) Vanuatu (VUV Vt) Vatican City (EUR €) Venezuela (USD $) Vietnam (VND ₫) Wallis & Futuna (XPF Fr) Western Sahara (MAD د.م.) Yemen (YER ﷼) Zambia (USD $) Zimbabwe (USD $) Account Shop Bottles SHAKERS SHAKERS 26oz Ice Shakers 20oz Skinny Shakers Clear Close ICE SHAKER FAQs PRODUCT FAQs Picking out the perfect insulated cup can be intimidating with all of the options available in today's market. But don't worry!  We're here to help! Check out some of our Frequently Asked Questions about our products below to see what makes Ice Shaker better than the rest! What makes Ice Shaker Bottles different than the rest? When Ice Shaker CEO, Chris Gronkowski set out to create the Ice Shaker Bottle, he set out to create a bottle that would help alleviate all of the issues he had with other protein shaker bottles in the marketplace. He wanted a protein shaker bottle that: Perfectly blend his protein powder so that no chunky protein was left behind Would keep his beverage ice-cold for hours Never have to worry about bottle sweat, leaks, or spills Wasn't so noisy. Who likes to listen to metal banging on metal anyways?! Didn't leave behind a smelly odor Today, these are the features that makes Ice Shaker better than the rest. My plastic shaker only cost $15. Why would I pay more for an Ice Shaker Bottle? This is one of our favorite questions! We know that plastic shaker bottles are cheap in price... which usually translates to cheaply made. Did you know that a plastic shaker bottle's lifespan is only 2 months?! (Sometimes even shorter since one missed wash can ruin the entire cup!) You'll never have to worry about that with an Ice Shaker Bottle! Made from kitchen-grade stainless steel, Ice Shaker Bottles will not absorb odors, are durably designed to withstand a fall, are dishwasher safe, and can be used for much more than protein shakes. The Ice Shaker Bottle is the only bottle you'll ever need! Are Ice Shaker products dishwasher safe? Most of our Ice Shaker Bottles are top-rack dishwasher safe. However, we always recommend your dry your Ice Shaker using the low heat setting on your dishwasher. The color/pattern of your bottle will determine if your bottle is dishwasher safe or not. TOP-RACK DISHWASHER SAFE, LOW-HEAT DRY: All solid-colored bottles All ombre-colored bottles Lids Straws HAND WASH ONLY: All patterned bottles. For example: Pineapple, Snakeskin, US Army Camo, Snowflake etc. Ice Shaker Jugs - due to the size of Ice Shaker Jugs, they will not fit on the top rack of a dishwasher. Because of this, we recommend hand washing your Ice  Shaker Jug. How long will my drink stay ice-cold? All Ice Shaker Bottles & Jugs are made with a double wall vacuum insulated design that keeps beverages ice-cold for hours. Depending on which bottle you buy and what size determines exactly how long your beverage will stay ice-cold. Our smallest bottle promises to keep your beverage ice-cold for 24+ hours with the time increasing by the size of the bottle you buy. We've tested our products and are 100% confident in them (check out the 3rd party testing report we had done on our bottles). Our bottles work. Period... But so does science. Please keep in mind that the amount of ice and the temperature of the liquid you put into your Ice Shaker will affect how long your drink stays ice cold.  To maximize the effectiveness of your Ice Shaker, we recommend filling it up with ice and pouring already-cool liquid into it.  If minimal ice is used or warm/room temperature liquid is poured in, a lot of the ice will immediately melt before the cup even gets the chance to show off its insulating abilities! Which bottles are best for hot drinks? We recommend the 26oz Flex Bottle or the 26oz Skinny Tumbler for hot beverages since they feature lids that allow for proper venting. Though our Shaker Bottles will certainly keep your beverages piping hot, the lids on them do not allow the steam put off by the hot liquid to properly vent. This causes pressure to build up and could splash a small amount of hot liquid in your face when you open the pop-top lid. Pressure from this steam can also cause the pop-top to open unintentionally. Please use caution if you do use your Ice Shaker Protein Shaker Bottle for hot drinks. Can I customize my Ice Shaker bottle? Yes! Our state-of-the-art laser engraving machine makes it easy and fast for us to engrave your Ice Shaker bottle. All customizations are done using a laser that leaves a permanent engraving on your bottle that will never fade, rub off or chip...EVER! For a small up-charge, you can add an engraving the back, front, or front & back of your bottle. Add your name, a quote, logo, or a clipart to your Ice Shaker Bottle! The options are endless! Check out our custom shop to get started! Please note not all bottles are available for customization. What is the difference between Flex Bottles, Shaker Bottles, & Sport Bottles? Great question! In short, the difference is in the lids. All bottles feature the same insulated cup. Ice Shaker's Shaker Bottles are designed to perfectly blend protein powder shakes, pre workouts, BCAAs, and more with its patented twist-on agitator that silently and seamlessly blends your beverage. The patented agitator can also be used to infuse your drink with fruit and can also work as a strainer to prevent ice from passing through. Shaker bottles also come with a spill-proof and 100% leak-proof lid. The lid also has a convenient carry handle built into the lid and features a pop-top spout to drink from. Shaker Bottles do not come with a straw. Ice Shaker's Flex Bottles are designed for both hot and cold beverages including coffee, tea, water, smoothies, carbonated drinks, and more. Our Flex Bottles come with our unique Flex Lids which offer TWO ways to sip!  The unique Flex Lid lets you choose how you want to sip your favorite drink: flip up the lid tab to drink from the spout on the edge of the lid or insert the included straw into the straw hole in the center of the lid to sip your drink from a straw. When not in use, use the rubber stopper to plug the straw hole so that your cup doesn't leak!  Our Flex Bottles comes with one reusable Tritan Straw. Ice Shaker's Sport Bottles are designed for those on the go. Available in three sizes, our Sport Bottles are 100% leak and spill proof and are great for toddlers, kids, teens, and adults! You can use the Sport Bottle for beverages like sport drinks, water, juices, iced teas, and lemonade. The twist-on, leak-proof lid comes with a Flip Up Sport Straw with an internal straw (included) that makes it very easy to sip your drink and has a handle built into the lid for easy carrying to and from home. Do Ice Shaker Bottles fit in cup holders? All Ice Shaker Bottles are designed to fit in standard size cup holders except for the Half Gallon Jugs and One Gallon Jugs. Do you offer a warranty on your products? All of our products including the lids come with a 1-year warranty on manufacturer defects. This would include anything that breaks or fails from normal use. Please note that our warranty does not cover issues caused by normal wear and tear, accidental drops/damage, improper use or care of the product including irregular cleaning or maintenance of the product (i.e. odor, mold, discoloration). If your Ice Shaker Bottle parts have been damaged or broken, we do offer replacement parts here . An item I want is out of stock. How can I get notified when it's back in stock? If an item you want is out of stock, simply click on the Red \"Notify Me When Available\" button on the product page, put in your email address, and as soon as we get it back in stock you will receive an email letting you know! ORDER PROCESSING FAQs We get it. Placing an order on a new site you've never purchased from before can be scary. But rest assured! We are moving as fast as possible to get your order delivered to you. In the mean time, here's some Frequently Asked Questions when it comes to order processing. How long does it take to process & ship my order? We are sticklers for fast shipping, so we do our best to get non-custom orders shipped out within 24 hours from the time they are placed.  Weekend orders are the exception (we are spending time with our families) but, we will get those out the following Monday. Orders with custom engravings can take 3-5 business days to process before shipment. There are some different options to choose from when shipping your order, which you can select towards the end of the checkout process after you enter your ship to address. For orders in the US, we ship via FedEx and USPS. The shipping option you choose will depend on how fast your order gets to your once it's left our warehouse. Shipping options include: Standard (4-7 business days): $7.99 Home/Ground for smaller orders (2-4 business days): $2.99 - $4.99 Express (2 business days): $11.95 We also offer Express Saver and Overnight, but the shipping price for these options will generate based on your ship to location and the weight of your order. For international orders , we ship via FedEx, Passport, and APC. Shipping times and prices vary for all countries and will generate based on your ship to location and the weight of your order. Please note that not all of these shipping options will always be available as they depend on your ship to location and weight of your order. Where will my order ship from? All orders placed on Iceshaker.com process and ship from our warehouse facility in Southlake, TX. How do I track my order once it's shipped? When your order has shipped, a tracking number will be sent to the email you provided when placing your order. You can simply click on the tracking number in the email and it will redirect you to the correct website to track your package. For domestic shipments, we ship via USPS and FedEx. For international shipments, we currently ship via FedEx, Passport, and APC. When you receive a tracking number, your package will ship out within the next 24 hours regardless of if the tracking number is showing a scan in or not. We do not have any further tracking information other than what is being shown on the carrier's website. Do you ship internationally? Yes! Please select your country in the dropdown at checkout. How do I track an International Order? For international orders, we use consolidated shipping. This means that your package will not scan in until it reaches the consolidation center, which may take a couple of days. Please do not be alarmed if your package is still showing that it is in \"Pre-Shipment\" status after you receive your tracking notification. Rest assured that your package is on its way and will be updated with the shipping progress once it reaches the consolidation center. If your package is being shipped via FedEx, once it reaches its destination country, it will be transferred to and delivered through your local carrier. When you receive a tracking number, your package will ship out from our facility within the next 24 hours regardless of if the tracking number is showing a scan in or not. We do not have any further tracking information other than what is being shown on the carrier's website. Do I have to purchase shipping insurance? You certainly do not have to purchase shipping insurance if you do not want to. However, there are \"perks\" if you do. If you purchase shipping insurance, it will protect you against lost, stolen or damaged packages.  If your package is lost or stolen, we ask that you wait at least 3 days before contacting us to make sure the package is indeed lost or stolen and wasn't just incorrectly marked as delivered.  If the package is damaged, please contact us asap and we will be happy to send out a replacement. What is AFTERPAY? Buy now, PAY LATER! You will notice when you checkout that there is an option to pay using Afterpay. Afterpay allows our shoppers to break down their cart total into 4 interest free payments. The process is very simple and it allows our shoppers even more freedom when purchasing from us.  Simply select Afterpay as your payment method and click \"Complete Order\". You will be redirected to Afterpay North America to securely enter payment information and see your payment terms and amounts.  Afterpay will automatically notify you when your next payment is due! *Afterpay is available only to US Residents. What is your return & refund policy? We offer a limited, 30-day product return policy.  If at any time during the 30 day period you decide you no longer want your Ice Shaker, simply send the UNUSED product back to us and we'll refund you in full once we receive it.  Let us reiterate...UNUSED product.  We will not accept products that have been used. If you return a used product, we will deny the refund and provide photograph documentation via email citing why we cannot accept the return.  If you are unhappy with your used product due to performance/functionality/cosmetic reasons, please contact us at info@iceshaker.com. We will address the issue and take necessary actions to correct the problem. Do you offer wholesale? We sure do!  We offer wholesale on both custom and non-custom orders.  To learn more about purchasing wholesale from us, please click HERE to be directed to our wholesale information page. You will find that we make purchasing wholesale from us quick and easy. If you're interested in placing a custom wholesale, you won't find anyone with turnaround times as lightning fast as ours! TROUBLESHOOTING FAQs Use these tips to help you get the most out of your Ice Shaker bottle! My Ice Shaker Bottle isn't performing as it should. What should I do? Please contact us at info@iceshaker.com. It may be a simple fix, or it could be a manufacturing defect in which case, as long as the product is still within the 1-year warranty, we will correct the issue immediately after we gather the necessary information needed from you. Once we've gathered all the necessary information from you, we will send the proper replacement. If it outside the 1-year warranty, then we will provide next steps that you can take to correct the issue. Customer Satisfaction is our top priority! My Ice Shaker Protein Shaker Bottle is leaking. How do I fix that? Listen for 2 clicks when closing your Ice Shaker pop-top lid. Our Shaker lids have a two-click system in place to ensure that your bottle only opens up when YOU want it to.  When closing your pop-top, be sure that you hear/feel two clicks.  If it only clicks once, it may look closed, but it is not sealed all the way. Only after the 2nd click does the lid become leak-proof. My Ice Shaker Bottle has an odor. How can I fix that? If your bottle is not washed properly, the protein or any other food/drink will start to spoil and will cause an odor. The good thing is that our bottles are made of premium kitchen-grade stainless steel and will not absorb the odor. If you do leave protein in your cup for an extended period of time, please clean with warm water and soap, or put the cup and lid on the top rack in your dishwasher. Please note that our lids are made out of plastic and if you are continuing to get an odor, it will be from the lid or seal and not the stainless-steel bottle. You will need to remove the seal to clean it. Please refer to the question above for further details on how to clean your seal. If you are still having issues with odor after trying all of this, then it might just be time for a new lid, which will come with a new seal. Replacement parts can be purchased here. Seal Maintenance The Seal in the lid does need to be taken out and cleaned regularly. It is okay to clean the seal once a week, but just be sure that the seal is completely dry before you put it back into the lid to avoid any moisture, bacteria growth, or odors.  To remove the seal from the lid, use a butter knife to easily and gently pop it out of place. Once it's cleaned and dry, you can put it back in and secure it with a butter knife. When putting the seal back in the lid, make sure you push it down into the groove of the lid and that it is lying flat all the way around and ensure that it hugs the rim of the cup to keep it nice and sealed. If you're experiencing any odor issues with the lid or seal of your bottle, take the seal out of the lid and soak both the lid and the seal in a small amount of hot water (enough to cover it) along with 1-2 tablespoons of baking soda to help pull out the odor. Let them sit in the mixture for at least one hour, then wash them with warm water and soap and let them dry completely. Once they're dry, you can put the seal back in the lid. How do I know what size bottle I have? Most of our products have internal measurement lines. However, the lines do not go all the way up to the top of the bottle, leaving space above the last line. So if your bottle's highest measurement line inside is 15oz, then you have a 20oz size bottle. If your highest measurement line inside your bottle is 20oz, then you have a 26oz size bottle. If your highest measurement line inside your bottle is 30oz, then you have a 36oz size bottle. Our 14oz Sport Bottle, 20oz Sport Bottle, 20oz Skinny Tumbler, Half Gallon Jugs, and One Gallon Jugs DO NOT have internal measurement lines. Got a question that didn't get answered above? We're here to help! CONTACT US Our customer service hours are 8:00am to 4:00pm CST Monday through Friday. Reach out to us during these hours to get your questions answered. By Phone 817-329-6478 We're working hard to get your order to you as fast as possible and may not be able to answer the phone right away. If so, please leave a voicemail with your name & phone number, and a customer support representative will get back to you as soon as possible. By E-mail info@iceshaker.com Our customer support representative works hard and has a lot of emails to respond to on some days. Please allow up to 1 business day for a response. We promise to answer your questions as fast as possible. Go to item 1 Go to item 2 Free Shipping Get free ground shipping on orders $50 (US only) Customer Service Available M - F | 8:00am - 4:00pm CST Fast Order Processing Most orders ship from our facility in 1-2 business days Warranty Support We offer a one-year limited warranty on all of our products Go to item 1 Go to item 2 Go to item 3 Go to item 4 Sign Up for Access to Deals & More CUSTOMER SUPPORT FAQs Contact Us Custom Business Logos Custom Team Logos Gift Cards Register Your ICE SHAKER Store Locator Warranty Policy COMPANY About Us Affiliate Programs Blog Community Initiatives Hero Discounts - VerifyPass Wholesale 3rd Party Product Testing POLICIES Accessibility Statement Privacy Policy Returns & Refund Policy Shipping Policy Terms of Service United States (USD $) Country Afghanistan (AFN ؋) Åland Islands (EUR €) Albania (ALL L) Algeria (DZD د.ج) Andorra (EUR €) Angola (USD $) Anguilla (XCD $) Antigua & Barbuda (XCD $) Argentina (USD $) Armenia (AMD դր.) Aruba (AWG ƒ) Ascension Island (SHP £) Australia (AUD $) Austria (EUR €) Azerbaijan (AZN ₼) Bahamas (BSD $) Bahrain (USD $) Bangladesh (BDT ৳) Barbados (BBD $) Belarus (USD $) Belgium (USD $) Belize (BZD $) Benin (XOF Fr) Bermuda (USD $) Bhutan (USD $) Bolivia (BOB Bs.) Bosnia & Herzegovina (BAM КМ) Botswana (BWP P) Brazil (USD $) British Indian Ocean Territory (USD $) British Virgin Islands (USD $) Brunei (BND $) Bulgaria (BGN лв.) Burkina Faso (XOF Fr) Burundi (BIF Fr) Cambodia (KHR ៛) Cameroon (XAF CFA) Canada (CAD $) Cape Verde (CVE $) Caribbean Netherlands (USD $) Cayman Islands (KYD $) Central African Republic (XAF CFA) Chad (XAF CFA) Chile (USD $) China (CNY ¥) Christmas Island (AUD $) Cocos (Keeling) Islands (AUD $) Colombia (USD $) Comoros (KMF Fr) Congo - Brazzaville (XAF CFA) Congo - Kinshasa (CDF Fr) Cook Islands (NZD $) Costa Rica (CRC ₡) Côte d’Ivoire (XOF Fr) Croatia (EUR €) Curaçao (ANG ƒ) Cyprus (EUR €) Czechia (CZK Kč) Denmark (DKK kr.) Djibouti (DJF Fdj) Dominica (XCD $) Dominican Republic (DOP $) Ecuador (USD $) Egypt (EGP ج.م) El Salvador (USD $) Equatorial Guinea (XAF CFA) Eritrea (USD $) Estonia (EUR €) Eswatini (USD $) Ethiopia (ETB Br) Falkland Islands (FKP £) Faroe Islands (DKK kr.) Fiji (FJD $) Finland (EUR €) France (EUR €) French Guiana (EUR €) French Polynesia (XPF Fr) French Southern Territories (EUR €) Gabon (XOF Fr) Gambia (GMD D) Georgia (USD $) Germany (EUR €) Ghana (USD $) Gibraltar (GBP £) Greece (EUR €) Greenland (DKK kr.) Grenada (XCD $) Guadeloupe (EUR €) Guatemala (GTQ Q) Guernsey (GBP £) Guinea (GNF Fr) Guinea-Bissau (XOF Fr) Guyana (GYD $) Haiti (USD $) Honduras (HNL L) Hong Kong SAR (HKD $) Hungary (HUF Ft) Iceland (ISK kr) India (INR ₹) Indonesia (IDR Rp) Iraq (USD $) Ireland (EUR €) Isle of Man (GBP £) Israel (ILS ₪) Italy (EUR €) Jamaica (JMD $) Japan (JPY ¥) Jersey (USD $) Jordan (USD $) Kazakhstan (KZT ₸) Kenya (KES KSh) Kiribati (USD $) Kosovo (EUR €) Kuwait (USD $) Kyrgyzstan (KGS som) Laos (LAK ₭) Latvia (EUR €) Lebanon (LBP ل.ل) Lesotho (USD $) Liberia (USD $) Libya (USD $) Liechtenstein (CHF CHF) Lithuania (EUR €) Luxembourg (EUR €) Macao SAR (MOP P) Madagascar (USD $) Malawi (MWK MK) Malaysia (MYR RM) Maldives (MVR MVR) Mali (XOF Fr) Malta (EUR €) Martinique (EUR €) Mauritania (USD $) Mauritius (MUR ₨) Mayotte (EUR €) Mexico (USD $) Moldova (MDL L) Monaco (EUR €) Mongolia (MNT ₮) Montenegro (EUR €) Montserrat (XCD $) Morocco (MAD د.م.) Mozambique (USD $) Myanmar (Burma) (MMK K) Namibia (USD $) Nauru (AUD $) Nepal (NPR Rs.) Netherlands (EUR €) New Caledonia (XPF Fr) New Zealand (NZD $) Nicaragua (NIO C$) Niger (XOF Fr) Nigeria (NGN ₦) Niue (NZD $) Norfolk Island (AUD $) North Macedonia (MKD ден) Norway (USD $) Oman (USD $) Pakistan (PKR ₨) Palestinian Territories (ILS ₪) Panama (USD $) Papua New Guinea (PGK K) Paraguay (PYG ₲) Peru (PEN S/) Philippines (PHP ₱) Pitcairn Islands (NZD $) Poland (PLN zł) Portugal (EUR €) Qatar (QAR ر.ق) Réunion (EUR €) Romania (RON Lei) Russia (USD $) Rwanda (RWF FRw) Samoa (WST T) San Marino (EUR €) São Tomé & Príncipe (STD Db) Saudi Arabia (SAR ر.س) Senegal (XOF Fr) Serbia (RSD РСД) Seychelles (USD $) Sierra Leone (SLL Le) Singapore (SGD $) Sint Maarten (ANG ƒ) Slovakia (EUR €) Slovenia (EUR €) Solomon Islands (SBD $) Somalia (USD $) South Africa (USD $) South Georgia & South Sandwich Islands (GBP £) South Korea (KRW ₩) South Sudan (USD $) Spain (EUR €) Sri Lanka (LKR ₨) St. Barthélemy (EUR €) St. Helena (SHP £) St. Kitts & Nevis (XCD $) St. Lucia (XCD $) St. Martin (EUR €) St. Pierre & Miquelon (EUR €) St. Vincent & Grenadines (XCD $) Sudan (USD $) Suriname (USD $) Svalbard & Jan Mayen (USD $) Sweden (SEK kr) Switzerland (CHF CHF) Taiwan (TWD $) Tajikistan (TJS ЅМ) Tanzania (TZS Sh) Thailand (THB ฿) Timor-Leste (USD $) Togo (XOF Fr) Tokelau (NZD $) Tonga (TOP T$) Trinidad & Tobago (TTD $) Tristan da Cunha (GBP £) Tunisia (USD $) Türkiye (USD $) Turkmenistan (USD $) Turks & Caicos Islands (USD $) Tuvalu (AUD $) U.S. Outlying Islands (USD $) Uganda (UGX USh) Ukraine (UAH ₴) United Arab Emirates (AED د.إ) United Kingdom (GBP £) United States (USD $) Uruguay (UYU $U) Uzbekistan (UZS so'm) Vanuatu (VUV Vt) Vatican City (EUR €) Venezuela (USD $) Vietnam (VND ₫) Wallis & Futuna (XPF Fr) Western Sahara (MAD د.م.) Yemen (YER ﷼) Zambia (USD $) Zimbabwe (USD $) Amazon American Express Apple Pay Diners Club Discover Google Pay Mastercard PayPal Shop Pay Venmo Visa © 2025, Ice Shaker. Powered by Shopify Shipping Protection from Damage, Loss & Theft, starting at $0.99 USD On Off Find Our Store Current Location Find My Location Search Radius Search Radius Measurement Kilometer Mile Tags More » Less « Search List Map One or more of the items in your cart is a recurring or deferred purchase. By continuing, I agree to the cancellation policy and authorize you to charge my payment method at the prices, frequency and dates listed on this page until my order is fulfilled or I cancel, if permitted."
    },
    {
      "url": "https://www.shakergroup.com/contact-us/",
      "text": "contact us – Shaker Group home about us projects Buildings Hotels& Resosrts HealthCare High-Rise Buildings Airports Sport Facilities Special Projects Shopping Malls Office Buildings Educational Facilities Infrastructure Industrial HV Substations Data Centers Power Generation Trasmission Lines Utilities & Roads Water Treatment Renewables District Cooling contact us home about us projects Buildings Hotels& Resosrts HealthCare High-Rise Buildings Airports Sport Facilities Special Projects Shopping Malls Office Buildings Educational Facilities Infrastructure Industrial HV Substations Data Centers Power Generation Trasmission Lines Utilities & Roads Water Treatment Renewables District Cooling contact us contact us ahmedsalah 2019-05-28T09:24:43+00:00 EGYPT Plots 277-278, Second business sector, El Teseen street, New Cairo, Egypt. Tel: +20 2 25872500 Fax: +20 2 25872513 Email: infocairo@shakergroup.com KSA Abou Baker Al Sadik EXIT 6, Riyadh, KSA P.O. Box 51912, Riyadh, KSA Tel: +966 11 4540 877 Email: inforiyadh@shakergroup.com QATAR 6th Floor Al Mana Tower B, Al Sadd, Ring Road P.O Box. 55781, Doha, Qatar Tel: +974 4466 4203 Fax +974 4466 7843 Email: infoqatar@shakergroup.com MOROCCO 353 Angle Bd. Mohamed V et Résistance 7ème Etage, Casablanca, Morocco Tel: +212 522 2427 59 Fax +212 522 4096 01 Email: infomorocco@shakergroup.com ALGERIA Bt.10 n.4 Cite 170 Said Hamdine Bir Mourad Rais, Algiers Tel: +213 770 93 53 33 Fax: +213 770 93 53 33 Email: infoalgeria@shakergroup.com UGANDA Rofra housem Gaba road, Kansagna, 3rd floor Room 7, Kampala, Uganda Tel: +256 77 318 5354 +256 75 5155 010 Email: infouganda@shakergroup.com Kenya Kalson Towers, 5th floor, Parklands, Nairobi, Kenya Tel: +254 73 884 5752 Email: infoKenya@shakergroup.com IRAQ Al Arasat Al Hindiya, Area No 929, Alley No 13, Building No 11, Karada, Baghdad, Iraq Tel: +964 770 886 7692 Email: infoiraq@shakergroup.com DROP US A MESSAGE Your name * Your email address * Subject Your Message Contact Us Email: info@shakergroup.com Working Days/Hours: Sun - Thu / 8:30 AM - 5:30 PM Quick Links Home About us Projects Buildings Infrastructure Contact us Newsletter Keep up on our always evolving product features and technology. Enter your e-mail and subscribe to our newsletter. Follow Us Facebook Twitter Linkedin © Copyright 2021 Shaker Group. All Rights Reserved.  Designed and developed by NRG Digital"
    },
    {
      "url": "https://www.brokenshaker.com/private-events-la/",
      "text": "Los Angeles Private Events | The Broken Shaker in the US Skip to main content About New York sub-menu New York About Happenings Private Events Reservations Menus Los Angeles sub-menu Los Angeles About Happenings Private Events Reservations Menus Miami sub-menu Miami About Happenings Private Events Reservations Menus Chicago sub-menu Chicago About Happenings Private Events Reservations Menus Madrid sub-menu Madrid About Happenings Private Events Madrid Menus Reservations Toggle Navigation About New York sub-menu New York About Happenings Private Events Reservations Menus Los Angeles sub-menu Los Angeles About Happenings Private Events Reservations Menus Miami sub-menu Miami About Happenings Private Events Reservations Menus Chicago sub-menu Chicago About Happenings Private Events Reservations Menus Madrid sub-menu Madrid About Happenings Private Events Madrid Menus Freehand Hotels Press Contact Us Privacy Policy Reservations Email Signup Instagram powered by BentoBox Main content starts here, tab to start navigating Slide 1 of 2 Slide 2 of 2 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Planning an Event With Us? Whether you’re hosting an intimate dinner, a gathering with friends or celebrating a special occasion, we’re here to provide you with a variety of options tailored to your event needs. Please contact our sales team for more information. 213-395-9532 events.losangeles@thefreehand.com Private Event Software powered by Tripleseat Reservations Instagram Freehand Hotels Press Contact Us Privacy Policy Email Signup powered by BentoBox leave this field blank Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Reservations Location - Required Location Broken Shaker | Cocktail Bar & Restaurant in the US Miami Chicago Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Please, select a date Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."
    },
    {
      "url": "https://moverandshakerco.com/pages/about",
      "text": "About Us – Mover & Shaker Co New Arrivals Pins New Arrivals All Pins Agave Pins Botanic Pins Buttons Coffee & Matcha Pins Cocktail Critters Pins New Releases Classic Cocktail Pins Love & Victory Pins Pizza Pins The Vault Vintage Pins Apparel New Arrivals All Apparel Tees Hats & Beanies Socks Bandanas Button-Up Shirts Outerwear Barware New Arrivals Cocktail Kingdom New Arrivals Atomizer Barspoons Citrus Juicers Cocktail Kits Dasher Bottles & Dash Darts Jiggers Mixing Glasses Shaker Tins Spoons Stepped Jiggers Strainers Swizzles Tasting Journal Tongs Barspoons Cocktail Kits Dehydrated Garnishes Jiggers Juicers M&SCo Essentials Mixing Glasses Muddlers Peelers Pour Spouts Stepped Jiggers Strainers Swizzles Tins Tongs Accessories New Arrivals All Accessories Air Fresheners Bolo Ties Bundles Buttons Calendars Candles Classic 8 Ball Coffee Mugs Croc Charms Cufflinks Dehydrated Garnishes Dice Gift Cards Glassware Kits Keychains Magnets Mouse Pads Nalgenes Ornaments Patches Posters & Prints Puzzles Rugs Sharpie Holster Stickers Tote Bags Bitters Custom Custom Pins Custom Apparel Info About Us Wholesale FAQ Sale Mystery Items Sale Log in Search Facebook Instagram USE CODE 'FREESHIP75' FOR FREE STANDARD SHIPPING ON ANY DOMESTIC ORDER OF $75 OR MORE! Menu Cart New Arrivals Pins New Arrivals All Pins Agave Pins Botanic Pins Buttons Coffee & Matcha Pins Cocktail Critters Pins New Releases Classic Cocktail Pins Love & Victory Pins Pizza Pins The Vault Vintage Pins Apparel New Arrivals All Apparel Tees Hats & Beanies Socks Bandanas Button-Up Shirts Outerwear Barware New Arrivals Cocktail Kingdom New Arrivals Atomizer Barspoons Citrus Juicers Cocktail Kits Dasher Bottles & Dash Darts Jiggers Mixing Glasses Shaker Tins Spoons Stepped Jiggers Strainers Swizzles Tasting Journal Tongs Barspoons Cocktail Kits Dehydrated Garnishes Jiggers Juicers M&SCo Essentials Mixing Glasses Muddlers Peelers Pour Spouts Stepped Jiggers Strainers Swizzles Tins Tongs Accessories New Arrivals All Accessories Air Fresheners Bolo Ties Bundles Buttons Calendars Candles Classic 8 Ball Coffee Mugs Croc Charms Cufflinks Dehydrated Garnishes Dice Gift Cards Glassware Kits Keychains Magnets Mouse Pads Nalgenes Ornaments Patches Posters & Prints Puzzles Rugs Sharpie Holster Stickers Tote Bags Bitters Custom Custom Pins Custom Apparel Info About Us Wholesale FAQ Sale Mystery Items Sale Log in Cart ( 0 ) Search About Us Who We Are At the intersection of pop culture and cocktail culture, where the world’s greatest bartenders conspire–that’s where you’ll find Mover & Shaker , a Jacksonville, FL-based boutique creative agency (of sorts) with its proverbial finger ever on the pulse of what’s happening in the hospitality industry. Who is Mover & Shaker? Call us what you will, Mover & Shaker is the brainchild of accomplished industry veteran Nick Hogan. Founder, Nick Hogan ( @boldcitybourbon ) Born out of his shared passion for creating memorable experiences and a keen eye for great design, the Mover & Shaker brand has become a banner of sorts for the new generation of bartenders and hospitality professionals who fully embrace the service industry lifestyle and the colorful, diverse community that surrounds it. Nick is a seasoned bartender with a lengthy list of cocktail competition wins and industry accolades under his belts. Though you’re more likely to catch him slinging merch than shaking cocktails these days, his years of experience behind the bar has given them sharp insight into the cult and culture of hospitality. His unique and informed perspective is what makes Mover & Shaker such an authentic and relatable brand capable of reaching and resonating with their discerning niche. What we do There’s more to Mover & Shaker than just pins and shirts. We bring great ideas to life, then we bring them to the people, wherever they are. Some of those ideas are wholly our own. Collaboration with Death & Co For others, we collaborate with brands of all sizes who are interested in reaching hospitality professionals and the most hardcore cocktail enthusiasts with exciting merchandise collections, full-blown digital campaigns, engaging social media content , and much, much more. Interested in collaborating with us? Drop us a line and we’ll reach out to discuss the details. Learn More About Mover & Shaker Here Bartender at Large Podcast: Entrepreneurship w/ Mover & Shaker Bon Appétit Love Cocktails? Wear One of These Pins to Prove It Follow Us on Facebook & Instagram Newsletter Sign up for our newsletter to stay up to date on new releases and sales! Subscribe Policies & Information Search FAQs Privacy Policy Refund policy Terms of Service Social Media Facebook Instagram Contact info@moverandshakerco.com Mover & Shaker Co. © 2025, Mover & Shaker Co Powered by Shopify American Express Apple Pay Bancontact Diners Club Discover Google Pay iDEAL Mastercard PayPal Shop Pay Visa Close (esc) Popup Use this popup to embed a mailing list sign up form. Alternatively use it as a simple call to action with a link to a product or a page. Subscribe Age verification By clicking enter you are verifying that you are old enough to consume alcohol. Enter Search Search Main menu New Arrivals Pins Apparel Barware Accessories Bitters Custom Info Sale Shopping Cart Your cart is currently empty. Shop now"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "text": "Contact Us: Get In Touch With Asian Paints for your Painting Needs Contact Us: We’d Love To Hear From You 16815 Popular searches Interior Paints Exterior Paints Shade cards SEARCH RESULTS {{searchItem.map.shadeCode}} {{searchItem.map.shadeFamilyName}}: {{searchItem.map.shadeName}} {{searchItem.map.title}} RELATED SEARCH NO MATCHES FOUND! Did you mean? {{spellCheck}} Log-In Hello! Hello! Signout en ar {{minicart.cartcount > 0 ? minicart.cartcount : 0}} ↻ Processing... You have {{minicart.cartcount}} items {{item[\"product\"][\"name\"]}} - + ₹ {{item[\"totalPrice\"][\"value\"]}} Total ₹ {{minicart.totalprice}} Checkout ↻ Menu PAINTS & COLOUR PAINTS & COLOUR Services Services WATERPROOFING WATERPROOFING INSPIRATION INSPIRATION Login/Register PAINTS & COLOUR All PAINTS & COLOUR EXPLORE COLOURS Colour Catalogue Home Colour Guide PAINT PRODUCTS Interior Paints Exterior Paints Waterproofing Wood Paints Metal Paints Undercoats RESOURCES Paint Budget Calculator Ideas Gallery Colour visualizer SERVICES Paint Store Near Me Book Painting Services Services All Services Beautiful Homes Painting Service Scib Stars WATERPROOFING All WATERPROOFING Bathrooms Terrace and Tanks Roof & Basement Interiors Tiling All Products INSPIRATION All INSPIRATION Get Inspired Paint calculator Gallery Colour Next Guides DecorPro Resources Colour Visualizer Ideas Gallery Please enter your mobile number To receive the dealer details on SMS Mobile * SUBMIT Get in Touch We’d love to hear from you Head Office Scib Chemical S.A.E 6th of October Cirt, 4th Industrial (1/3/B)B Tel:            (+202)38281090-99 Fax: (+202)38331271 Scib Paints Helpline* For enquiries, feedback and complaints please call on 16815 or write to us at info@scibpaints.com Mobile number +91 00:59 ↻ ↻ Need help with your painting needs? Fill the form below to book a free site evaluation by a Scib Paints Beautiful Homes Painting Service expert. Name Mobile Number +20 Governorate * Email By proceeding, you are authorizing Scib Paints and its suggested contractors to get in touch with you through calls, sms, or e-mail. Book an appointment ↻ Thank you! We value your interest in Scib Paints Beautiful Homes Service. We will get in touch with you shortly to schedule a visit by an expert. Try again! Oops! Something went wrong. We couldn't process your request. Please try again? Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Our Divisions More about Asian Paints Congratulations You have subscribed. Contact Us 16815 EMAIL ABOUT Research & Technology Careers Contact Us Certificates RESOURCES FAQs POLICIES Quality Policy Customer Policy Cookie Policy Environment Policy EHS Policy TOOLS Colour Catalogue Color with AP APP/Website​ COUNTRY EGYPT Country EGYPT India GLOBAL BANGLADESH MIDDLE EAST FIJI NEPAL SRI LANKA ETHIOPIA CONNECT DOWNLOAD OUR PAINTING APP CONNECT WITH US ©Scib Paints - All rights reserved Congratulations You have subscribed. Welcome User Login OR Continue as guest You have been successfully logged out Login An OTP has been sent to your registered mobile number and email id. 00:00 Resend By clicking submit, I agree to terms and conditions SUBMIT Register Please enter the 5 digit OTP sent via SMS to verify your mobile number! 00:00 Resend I agree to terms and conditions SUBMIT Please enter your mobile number To receive the dealer details on SMS SUBMIT Provide a delivary address Fullname* Email* Mobile* +91 Flat/House No/Floor* Colony/Street/Locality* Landmark City* Pincode* SUBMIT User already exist redirecting you for the login page Paint Budget Calculator Get instant estimates Calculate now Waterproofing Calculator Get an instant estimate Calculate now"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "text": "Contact Skanem | Reach Out to Our Labelling Experts Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message We proudly present Skanem Nairobi Skanem Nairobi Sachen Gudka Managing Director +254 733 410 309 Send email Skanem Nairobi Sachen Gudka Managing Director +254 733 410 309 Send email Skanem Nairobi Anirudh Shetye Head of Sales & Marketing +254 735 052 700 Send email Skanem Nairobi Anirudh Shetye Head of Sales & Marketing +254 735 052 700 Send email Skanem Nairobi Joyce Njogu Key Account Manager +254 722 804 269 Send email Skanem Nairobi Joyce Njogu Key Account Manager +254 722 804 269 Send email We proudly present Skanem Uganda Skanem Uganda Olive Kunihira Head of Sales +256 759 589 711 Send email Skanem Uganda Olive Kunihira Head of Sales +256 759 589 711 Send email We proudly present Skanem Tanzania Skanem Tanzania Sameer Gaikwad Site Manager +255 757 803 737 Send email Skanem Tanzania Sameer Gaikwad Site Manager +255 757 803 737 Send email Skanem Tanzania Beatrice Malle Key Account Manager +255 712 110 922 Send email Skanem Tanzania Beatrice Malle Key Account Manager +255 712 110 922 Send email Skanem Tanzania Shamila Mirza Key Account Manager +255 717 477 047 Send email Skanem Tanzania Shamila Mirza Key Account Manager +255 717 477 047 Send email Locations Locations Locations How to reach us How to reach us How to reach us How to reach us Skanem Interlabels Nairobi Limited East Africa Headquarters East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa +254 202 471001 info.nairobi@skanem.com Skanem Interlabels Uganda Limited Namanve Industrial Park Mukono Uganda Africa +256 759 589711 olive.kunihira@skanem.com Skanem Tanzania Limited Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa +255 757 803737 sameer.gaikwad@skanem.com Contact us Send us a message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Products Sustainability menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy Products menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy"
    },
    {
      "url": "https://genius.com/albums/Lifehouse/Who-we-are",
      "text": "Lifehouse - Who We Are Lyrics and Tracklist | Genius {{:: 'cloudflare_always_on_message' | i18n }} GENIUS | | | Facebook Twitter Instagram Snapchat TikTok Youtube Album Who We Are Lifehouse Released June 18, 2007 Who We Are Tracklist 1 Disarray Lyrics 2 First Time Lyrics 8.6K 3 Whatever It Takes Lyrics 19.6K 4 Who We Are Lyrics 5 Broken Lyrics 24.5K 6 The Joke Lyrics 7 Easier To Be Lyrics 8 Make Me Over Lyrics 9 Mesmerized Lyrics 10 Bridges Lyrics 11 Learn You Inside Out Lyrics 12 Storm Lyrics 5.1K 13 Keep The Change Lyrics 14 You and Me (Live In Portland) Lyrics 15 Hanging by a Moment (acoustic) Lyrics 17 I Want You to Know Lyrics 18 Signs Of Life Lyrics 19 If This Is Goodbye Lyrics 20 You and Me (Extended Wedding Version) Lyrics Broken (New/Radio Version) Lyrics About “Who We Are” “Who We Are” is the fourth studio album by American alternative rock band Lifehouse. It was on June 18, 2007, by Geffen Records. It peaked at number fourteen on the Billboard 200, selling 49,000 copies in its first week. It was certified Gold in the United States by the RIAA on October 22, 2008. “Who We Are” Q&A What was the experience like recording for the album? Band member Wade on his experience on writing songs for “Who We Are.”: This time around it was about not having any preconceived notions. It was about letting the tape machine roll and getting the music down spontaneously. I’m at a place where it doesn’t matter to me what other people think. I’m comfortable being myself. I’m writing from an honest place, not thinking about who’s going to hear it, what they’re going to think or how they’re going to interpret it. The lyrics can’t be contrived. They have to hit you right in the heart.\" Via TheFishOc What is the most popular song on Who We Are by Lifehouse? When did Lifehouse release Who We Are ? Album Credits Viola Leah Katz Organ Rocco Deluca Cello Richard Dodd Violin Daphne Chen & Eric Gorfain Keyboards Jude Cole & Pat Leonard Strings Arranger Stephen Lu Background Vocals Jude Cole & Bryce Soderberg Bass Bryce Soderberg Piano Jude Cole & Jason Wade Guitar Jude Cole , Mark Goldenberg & Jason Wade Vocals Jason Wade Album Credits Producers John Fields , Jude Cole , Lifehouse & 1 more Writers Jason Wade , Jude Cole & Rick Woolstenhulme Jr More Lifehouse albums Goodbye Kanan Greatest Hits Show all albums by Lifehouse Home L Lifehouse Who We Are About Genius Contributor Guidelines Press Shop Advertise Privacy Policy Licensing Jobs Developers Terms of Use Copyright Policy Contact Us Do Not Sell My Personal Information Sign in © 2025 ML Genius Holdings, LLC Verified Artists All Artists: A B C D E F G H I J K L M N O P Q R S T U V W X Y Z # Hot songs: HUNTR/X - Golden (Romanized) Creep Best Part Ordinary Nandito Ako View All"
    },
    {
      "url": "https://miamitake.com/behind-bar-gabriel-orta/",
      "text": "Meet Gabriel Orta, co-owner of Bar Lab, Broken Shaker in Miami Skip to content Menu Home About Contact Menu Home About Contact Home » Food Meet Gabriel Orta, co-owner of Bar Lab, Broken Shaker in Miami October 11, 2022 Food Local Chefs Miami Beach Cocktails at Broken Shaker (photo by Morgan Overholt/MiamiTake.com) The man who changed the game for the Miami cocktail scene Meet Gabriel Orta, a renowned mixologist, is the co-owner of Bar Lab – a one-stop-shop consulting agency and internationally recognized hospitality management company. Orta, alongside his business partner Elad Zvi, have been shaking up the Miami nightlife scene for years and have no intention of slowing down. Gabriel Orta, co-owner of Bar Lab (photo courtesy of Bar Lab) The pair launched their first bar – Broken Shaker at the Freehand Miami – in 2012. Broken Shaker was originally meant to be a temporary 30-day pop-up installment. But its instant popularity ultimately led to a partnership with the Sydell Group, which gave the Broken Shaker a permanent home, cementing its legendary status amongst tourists and locals alike. Fueled by the success of their pioneer venture, the duo later went on to launch additional restaurant concepts, as well as additional locations for Broken Shaker, in major cities across the United States including Chicago, Los Angeles, and New York. Broken Shaker’s outdoor patio (photo by Morgan Overholt/MiamiTake.com) They also cofounded local Miami favorites 27 Restaurant, Taqueria Hoja, Margot Natural Wine and Aperitivo Bar and the Anderson with each venue is designed to offer a one-of-a-kind experience and serve as a reflection of the community in which it resides. Today, the original Broken Shaker location in Miami serves up a variety of tacos, burgers and of course, hand-crafted signature cocktails. The Peach Boulevard cocktail at Broken Shaker (photo by Morgan Overholt/MiamiTake.com) In fact, it’s Orta’s unique take on cocktails has made him a sought-after commodity in the Miami restaurant scene. His inventive Chorizo Cordial, for example, is a smoky, spicy take on the classic sweet liqueur that is used in many of his cocktails. In recent years, Bar Lab has been awarded several accolades and honors including Outstanding Bar Program and a ranking on the World’s 50 Best Bars list. Bar Lab is also the two-time winner of the Spirited Award at the Tales of the Cocktail for Best American Hotel Bar. And The Anderson was voted one of Esquire’s Best Bars of 2018. To learn more about Gabriel Orta and Bar Lab, check out their website at bar-lab.com. Categories Food , Local Chefs , Miami Beach Tags Miami ABOUT THE AUTHOR Morgan Overholt Morgan is the founder Morgan Media LLC, a graphic design agency and the co-founder of TheSmokies.com LLC – a media company that specializes in regional travel sites. ABOUT MIAMITAKE.COM Disclosure: As an Amazon Associate and a partner of other affiliate programs including Booking.com, CJ and Tripster, we may earn commissions from qualifying purchases via links found in this article. Local celebrity Kiko Suarez uses his talents to support local business Culinary Director, founder and chef Jose Icardi’s impressive resume Search Recent Posts Worst Times to visit Fort Lauderdale (photos by James Overholt/Miamitake.com) Worst Times To Visit Fort Lauderdale Biscayne Bay from Miami Beach during sunset (photo by halbergman/iStockphoto.com) Is Miami a State? Traffic in Brickell Downtown Miami (photo by benedek/iStockphoto.com) Why Is Traffic So Bad in Miami? Things to do in Downtown Miami (photo by James Overholt/Miamitake.com) Things To Do in Downtown Miami & Brickell Welcome to MiamiTake.com! Interested in being featured on MiamiTake.com? Contact Us © 2025 TheSmokies.com LLC Privacy Policy Close Home About Contact"
    },
    {
      "url": "https://signalcleveland.org/owner-of-deteriorating-shaker-square-apartment-buildings-meets-with-tenants/",
      "text": "Owner of Shaker Square apartments meets with tenants Know what’s happening in local government Join 30,000+ Clevelanders who trust our free daily newsletter . From City Hall to Cuyahoga County Council, we cover what matters to you. \" * \" indicates required fields Email * Name This field is for validation purposes and should be left unchanged. Δ Close ✉️ Newsletters 🤍 DONATE Search for: Search Local News Open dropdown menu Arts & Culture Community Economy Education Elections Government Health Housing News Quiz Public Safety Things to do Weekly Chatter Documenters Open dropdown menu About Documenters Become A Documenter Podcast Public Meeting Briefs How to 216 Open dropdown menu How to 216 The Follow Up Special reports Open dropdown menu Browns to Brook Park Cleveland for Sale Cleveland’s historic Black churches Cleveland Police Oversight Cuyahoga County property tax news and resources Lead poisoning hazards The Housing Squeeze Signal Newsrooms Open dropdown menu Signal Akron Signal Cincinnati Signal Statewide About us Primary election today City Council Voter Guide Fresh Fest Property tax help YouTube Instagram Facebook X Linkedin Close Skip to content Primary election today City Council Voter Guide Fresh Fest Property tax help YouTube Instagram Facebook X Linkedin Signal Cleveland ✉️ Newsletters 🤍 DONATE 🤍 DONATE Menu Local News Open dropdown menu Arts & Culture Community Economy Education Elections Government Health Housing News Quiz Public Safety Things to do Weekly Chatter Documenters Open dropdown menu About Documenters Become A Documenter Podcast Public Meeting Briefs How to 216 Open dropdown menu How to 216 The Follow Up Special reports Open dropdown menu Browns to Brook Park Cleveland for Sale Cleveland’s historic Black churches Cleveland Police Oversight Cuyahoga County property tax news and resources Lead poisoning hazards The Housing Squeeze Signal Newsrooms Open dropdown menu Signal Akron Signal Cincinnati Signal Statewide About us Open Search Search for: Search Posted in Government , News Owner of deteriorating Shaker Square apartment buildings meets with tenants In a recording of a closed-to-press meeting with tenants and city officials, a Shaker Boulevard landlord promises to fix lingering maintenance problems. by Nick Castele February 24, 2023 October 18, 2024 Share this: Click to share on X (Opens in new window) X Click to share on Facebook (Opens in new window) Facebook Click to share on LinkedIn (Opens in new window) LinkedIn Click to email a link to a friend (Opens in new window) Email Click to print (Opens in new window) Print Ronald James, a tenant who lives near Shaker Square, gives a tour of the property to Cleveland building inspectors in November 2022. Credit: Nick Castele / Signal Cleveland An out-of-town owner and property managers of a set of shabby apartment buildings near Shaker Square faced a room of frustrated tenants this week. The meeting capped a monthslong effort by tenant organizers to bring problems in the buildings – located at 12701 and 12500-12600 Shaker Boulevard – to the attention of media and Cleveland officials. We’re 100% local. 100% nonprofit. Signal Cleveland is powered by people like you. We don’t have a paywall, and we don’t take orders from corporate media. Support our nonprofit newsroom with a tax-deductible donation today. Yaacov Amar, who told tenants he was a part owner of the buildings, said he was working to fix up the multi-family complexes, which were in “disgusting” condition when the ownership group bought them. From Cleveland City Hall to Cuyahoga County Council, our free daily newsletter provides you with essential local government news. More than 30,000 Clevelanders stay informed with Signals 216. Join them. \" * \" indicates required fields Email * Name This field is for validation purposes and should be left unchanged. Δ Amar acknowledged that the building was beset by water leaks and that some tenants had gone without working heat. He introduced a new set of property managers, who suggested the previous management company hadn’t lived up to its responsibilities. “We are here to work together, and we are trying to do our best,” Amar said. News media were asked to leave the Wednesday night meeting, which was held at a community hall across the street from Our Lady of Peace Catholic Church. Signal Cleveland obtained an audio recording of the gathering afterward. A water leak damaged the ceiling hallway in a Shaker Square apartment building, shown here in November 2022. The hole has since been patched. Credit: Nick Castele / Signal Cleveland The current owners bought the properties for $12.4 million in January 2022. At the time, Crain’s Cleveland Business identified the ownership as a venture by AMG Realty Group and the Chetrit family. The buildings are held by Shaker Heights Apartments Owner LLC, which shares an address with the Chetrit Organization, property and mortgage records show. Cleveland has seen a wave of investors, many from out of state, purchasing apartments and single-family homes. Officials have had difficulty reaching and prosecuting code violators who operate through limited liability companies and live far from the assets they own. The city’s Building and Housing director this week told Cleveland City Council that a slate of legislative reforms would be coming to get a handle on investor-owned properties. In early February, Council President Blaine Griffin and Ward 4 Council Member Deborah Gray held a press conference highlighting residents’ complaints. Gray later traveled to New York City in an effort to talk with the owners. Griffin moderated the Wednesday night event, where he pressed the owner and managers to give tenants a timeline for maintenance work. Tenants complained of broken heating systems, water leaks and poor security in the buildings. One woman said she’d been using her oven to keep her apartment warm. “There is such a lack of professionalism and professional standards for taking care of these buildings,” another woman said. “As an owner and all of you all investors, we should be your first priority.” The new property managers said they had set up a portal for processing maintenance complaints and were working through 2,000 work orders. For tenants without heat, they said a fix would be coming over the next week. Ward 4 Cleveland City Council Member Deborah Gray talks with reporters about problems in a set of Shaker Boulevard apartment buildings in February. Credit: Nick Castele / Signal Cleveland The tension between residents and the owners is also playing out in Cleveland Housing Court. Last April, a city building inspector cited the owners for peeling paint, water-damaged walls, a broken smoke detector and broken exit signs, records show. The city later cited the owners for failing to comply with an order to fix the problems. The owners have hired local attorneys and pleaded not guilty to the violations. More than two dozen tenants are also facing eviction for unpaid rent, court records show. On Wednesday night, Griffin said he had been told by housing court officials that the evictions would not proceed until the buildings’ code violation cases are resolved. “Today was about getting results,” the council president said. “If you don’t get the results that these guys said that they’re here today to do, then the city will be taking aggressive action.” In the early February press conference, Griffin raised the possibility of the city bringing a public nuisance lawsuit against the owners. The council president told Signal Cleveland that he, Law Director Mark Griffin and Building and Housing Director Sally Martin O’Toole also met separately with the owner and managers before the gathering with tenants this week. Ronald James, a tenant who has helped organize his neighbors, told Signal Cleveland that he was paying his rent into escrow until the landlords fix problems in the building. He said he appreciated that Griffin and Gray were at the meeting to hear the owner and managers’ promises. As for the promises themselves: “I’ll believe it when I see it,” he said. This story has been updated to reflect the fact that company holding title to the buildings shares an address with the Chetrit Organization, not the Chetrit Group. For Clevelanders. Supported by Clevelanders. Every day, our team tells the stories that reflect Greater Cleveland — its people, its challenges, and its progress. We hold leaders accountable, highlight real solutions, and make sure all voices are heard. This year alone, we’ve broken down how policy decisions at the state and federal levels are impacting our neighborhoods. We’ve kept a close watch on local politics — from the race for Cleveland City Council to the decisions behind Mayor Justin Bibb’s $2.1 billion budget proposal. We’re also celebrating Clevelanders — like Stefan Johnson, aka “Snack Daddy,” who became a viral sensation, and the East Tech High School robotics team chasing their championship dreams. We’re here for Cleveland, every single day. And we’re always free to read. Support from readers like you powers this work. Make a tax-deductible donation today and help us keep Cleveland connected and informed. With gratitude, Lila Mills Editor-in-Chief Signal Cleveland Nick Castele nick@signalcleveland.org Government Reporter I follow how decisions made at Cleveland City Hall and Cuyahoga County headquarters ripple into the neighborhoods. I keep an eye on the power brokers and political organizers who shape our government. I am a graduate of the Medill School of Journalism at Northwestern University and have covered politics and government in Northeast Ohio since 2012. More by Nick Castele Don't miss breaking news or helpful guides. Sign up for our text messages. \" * \" indicates required fields Enter your phone number here * Your ZIP code * This field is hidden when viewing the form Your name First Last LinkedIn This field is for validation purposes and should be left unchanged. Δ Latest News Cleveland’s City Council primary was a good night for incumbents: See results here by Nick Castele September 9, 2025 September 10, 2025 What to know before you vote: Cleveland primary edition by Nick Castele and Signal Cleveland Staff September 6, 2025 Redistricting season is here. Ohio wants your congressional map by Andrew Tobias September 5, 2025 September 5, 2025 Legal saga continues for Cleveland’s court fights against Shaker Boulevard apartment owner by Nick Castele September 3, 2025 Join Us 📨 Subscribe for free ❤️ Donate 📣 Advertise with us Latest Meeting Briefs ‘There is no affordable housing,’ Cleveland Housing Court judge tells Ward 5 residents by Cleveland Documenters September 3, 2025 RTA rider satisfaction soars even as fare revenue lags by Cleveland Documenters August 28, 2025 August 28, 2025 Stockyards transformation project receives $2.3 million loan from City of Cleveland by Gennifer Harding-Gosnell and Cleveland Documenters August 25, 2025 August 25, 2025 Gridiron Gridlock: Browns Brook Park stadium tees up $82 million worth of road work by Cleveland Documenters August 21, 2025 August 21, 2025 About Us Meet the Signal Cleveland team Submit a news tip Careers Subscribe Our donors ❤️ Donate Manage my donations Governance & transparency FAQ Contact us Republishing guidelines Advertise with Signal Cleveland Local News Arts & Culture Community Economy Education Elections Government Health Public Safety Things to do Weekly Chatter Resources How to 216 Things to do in Greater Cleveland Local government Meeting Briefs Become a Documenter Terms of Service Privacy Policy Sign up for our free newsletters More than 30,000 Clevelanders subscribe to Signal Cleveland’s free newsletters to stay informed. Join them. \" * \" indicates required fields Enter your email here! * X/Twitter This field is for validation purposes and should be left unchanged. Δ © 2025 Signal Cleveland Powered by Newspack YouTube Instagram Facebook X Linkedin"
    },
    {
      "url": "https://www.brokenshaker.com/menu/happy-hour-miami/",
      "text": "Happy Hour | Broken Shaker | Cocktail Bar & Restaurant in the US Skip to main content About New York sub-menu New York About Happenings Private Events Reservations Menus Los Angeles sub-menu Los Angeles About Happenings Private Events Reservations Menus Miami sub-menu Miami About Happenings Private Events Reservations Menus Chicago sub-menu Chicago About Happenings Private Events Reservations Menus Madrid sub-menu Madrid About Happenings Private Events Madrid Menus Reservations Toggle Navigation About New York sub-menu New York About Happenings Private Events Reservations Menus Los Angeles sub-menu Los Angeles About Happenings Private Events Reservations Menus Miami sub-menu Miami About Happenings Private Events Reservations Menus Chicago sub-menu Chicago About Happenings Private Events Reservations Menus Madrid sub-menu Madrid About Happenings Private Events Madrid Menus Freehand Hotels Press Contact Us Privacy Policy Reservations Email Signup Instagram powered by BentoBox Main content starts here, tab to start navigating Happy Hour Sunday thru Thursday 5pm - 7pm Drinks The Luckiest Appleton Signature Rum, Martini & Aperol, Coppalli Cacao, Amaro, Orange Oleo, Strawberry & Lime $ 12 Aperol Spritz Aperol topped with Soda Water & Prosecco $ 9 Miller High Life Beer American Lager 4.6% ABV $ 5 Rotating House Wine Selection (By the Glass) Red or White Wine $ 9 Food Happy Meal Cheeseburger with pickles, onion & shaker sauce, French fries & Miller High Life bottle or soda $ 13 Street Tacos (2) Chicken Tinga or Oyster Mushroom Soft corn tortilla, cilantro-onions, salsa macha (*P), guac taquero $ 10 Harissa Buffalo Wings (5 Wings) $ 8 French Fries $ 6 20% gratuity included on all checks No more than 4 credit cards allowed per check *P = Peanut allergy Please alert your server to any allergies before ordering. Consuming raw or undercooked meats, poultry, seafood, shellfish, or eggs may increase your risk of foodborne illness For all current menus and prices please email FB.FHMIA@thefreehand.com Reservations Instagram Freehand Hotels Press Contact Us Privacy Policy Email Signup powered by BentoBox leave this field blank Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Reservations Location - Required Location Broken Shaker | Cocktail Bar & Restaurant in the US Miami Chicago Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Please, select a date Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."
    },
    {
      "url": "https://www.brokenshaker.com/",
      "text": "Broken Shaker | Cocktail Bar & Restaurant in the US Skip to main content About New York sub-menu New York About Happenings Private Events Reservations Menus Los Angeles sub-menu Los Angeles About Happenings Private Events Reservations Menus Miami sub-menu Miami About Happenings Private Events Reservations Menus Chicago sub-menu Chicago About Happenings Private Events Reservations Menus Madrid sub-menu Madrid About Happenings Private Events Madrid Menus Reservations Toggle Navigation About New York sub-menu New York About Happenings Private Events Reservations Menus Los Angeles sub-menu Los Angeles About Happenings Private Events Reservations Menus Miami sub-menu Miami About Happenings Private Events Reservations Menus Chicago sub-menu Chicago About Happenings Private Events Reservations Menus Madrid sub-menu Madrid About Happenings Private Events Madrid Menus Freehand Hotels Press Contact Us Privacy Policy Reservations Email Signup Instagram powered by BentoBox Homepage Main content starts here, tab to start navigating Slide 1 of 14 Slide 2 of 14 Slide 3 of 14 Slide 4 of 14 Slide 5 of 14 Slide 6 of 14 Slide 7 of 14 Slide 8 of 14 Slide 9 of 14 Slide 10 of 14 Slide 11 of 14 Slide 12 of 14 Slide 13 of 14 Slide 14 of 14 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides WELCOME TO BROKEN SHAKER Started as a pop up in Miami in 2012 and established as an industry favorite by 2014, Broken Shaker is a cocktail bar inspired by the beauty of the Caribbean. In partnership with operators Authentic Hospitality , the bar is now in five cities: Miami , New York , Los Angeles , Chicago and Madrid . Visit us for an inspired drink and bite at any of them. As James Beard Award semi-finalists & Tale’s of the Cocktail’s Best American Hotel Bar winners, we take our liquor seriously. New York A year round rooftop cocktail bar with sweeping views of Manhattan, Broken Shaker NYC is located 18 floors above the Gramercy and Flatiron neighborhoods in Freehand Hotel. View Happenings Los Angeles An oasis in the heart of Downtown LA, Broken Shaker is located on Freehand Hotel's rooftop pool deck and offers an eclectic menu of handcrafted cocktails and small bites. View Happenings Miami The one that started it all, Broken Shaker Miami consists of a patio nestled poolside amongst the interior courtyard of Freehand Hotel. View Happenings Chicago Expect the perfect blend of ingredients and international flavors from Tales of the Cocktail’s “Best Hotel Bar” award-winning duo and explore our diverse street-food inspired menu. View Happenings Madrid Where Madrid’s skyline meets creative cocktails, Broken Shaker sits atop Generator Hotel, bringing bold flavours and rooftop vibes to the heart of the city. View Happenings Follow Us @BrokenShaker Reservations Instagram Freehand Hotels Press Contact Us Privacy Policy Email Signup powered by BentoBox leave this field blank Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Reservations Location - Required Location Broken Shaker | Cocktail Bar & Restaurant in the US Miami Chicago Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Please, select a date Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."
    },
    {
      "url": "https://www.brokenshaker.com/private-events-miami/",
      "text": "Miami Private Events | The Broken Shaker in the US Skip to main content About New York sub-menu New York About Happenings Private Events Reservations Menus Los Angeles sub-menu Los Angeles About Happenings Private Events Reservations Menus Miami sub-menu Miami About Happenings Private Events Reservations Menus Chicago sub-menu Chicago About Happenings Private Events Reservations Menus Madrid sub-menu Madrid About Happenings Private Events Madrid Menus Reservations Toggle Navigation About New York sub-menu New York About Happenings Private Events Reservations Menus Los Angeles sub-menu Los Angeles About Happenings Private Events Reservations Menus Miami sub-menu Miami About Happenings Private Events Reservations Menus Chicago sub-menu Chicago About Happenings Private Events Reservations Menus Madrid sub-menu Madrid About Happenings Private Events Madrid Menus Freehand Hotels Press Contact Us Privacy Policy Reservations Email Signup Instagram powered by BentoBox Main content starts here, tab to start navigating Slide 1 of 10 Slide 2 of 10 Slide 3 of 10 Slide 4 of 10 Slide 5 of 10 Slide 6 of 10 Slide 7 of 10 Slide 8 of 10 Slide 9 of 10 Slide 10 of 10 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Looking to Plan an Event? WE'D LOVE TO HOST YOU! Recently revamped by Authentic Hospitality, industry staple Broken Shaker offers three distinct event areas, each with their own bar: the Patio, the Pool and the Secret Garden. They can be booked individually for groups of up to 100 or combined for larger groups of up to 500. A private entrance is also available. Additionally, Broken Shaker is located adjacent to Authentic Hospitality's newest bar, Ray's Hometown Bar . Combined, the two bars can accommodate up to 700 guests. You can also use smaller parts of both bars to create your own unique event for a smaller guest count. Need hotel rooms to go with your event? Broken Shaker is within Freehand Hotel and is happy to accommodate room blocks. Inquire with our sales team below for more information. (305) 531-2727 events.miami@thefreehand.com Private Event Software powered by Tripleseat Reservations Instagram Freehand Hotels Press Contact Us Privacy Policy Email Signup powered by BentoBox leave this field blank Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Reservations Location - Required Location Broken Shaker | Cocktail Bar & Restaurant in the US Miami Chicago Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Please, select a date Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."
    },
    {
      "url": "https://www.brokenshaker.com/miami-menus/",
      "text": "Miami Menus | The Broken Shaker in the US Skip to main content About New York sub-menu New York About Happenings Private Events Reservations Menus Los Angeles sub-menu Los Angeles About Happenings Private Events Reservations Menus Miami sub-menu Miami About Happenings Private Events Reservations Menus Chicago sub-menu Chicago About Happenings Private Events Reservations Menus Madrid sub-menu Madrid About Happenings Private Events Madrid Menus Reservations Toggle Navigation About New York sub-menu New York About Happenings Private Events Reservations Menus Los Angeles sub-menu Los Angeles About Happenings Private Events Reservations Menus Miami sub-menu Miami About Happenings Private Events Reservations Menus Chicago sub-menu Chicago About Happenings Private Events Reservations Menus Madrid sub-menu Madrid About Happenings Private Events Madrid Menus Freehand Hotels Press Contact Us Privacy Policy Reservations Email Signup Instagram powered by BentoBox Main content starts here, tab to start navigating FOOD DRINKS LA PISCINA A 20% Gratuity will be added to every check. No more than 4 credit cards per check. Please alert your server to any allergies before ordering. Consuming raw or undercooked meats, poultry, seafood, shellfish, or eggs may increase your risk of foodborne illness. BITES GUACAMOLE House Fried Tortilla Chips $ 11 ROASTED RED PEPPER HUMMUS Pita, Crudite $ 12 SHRIMP CEVICHE Wild Caught Shrimp, Passion Fruit, Avocado,\nJalapeno, Red Onion, Cilantro, Green Plantains $ 14 CRISPY CHEESE MUSHROOM TACO Two Corn Tortillas, Avocado Salsa, Cremini Mushrooms, Pickled Red Onion Mushroom $ 13 Chicken Ting + $ 3 GRIOT AND PIKLIZ Crispy Haitian Style Pork & Spicy Slaw\nServed with Two Plantains $ 14 GRILLED FISH TACOS Two Corn Tortillas, Mahi Mahi, Salsa Guajillo,\nChipotle Aioli, Red Cabbage, Cilantro $ 16 FRENCH FRIES A Broken Shaker Classic\nChoose Regular or Seasoned $ 7.50 SKEWERS COCONUT CURRY SHRIMP Cabbage, Peppers, Carrots, Onions $ 15 AJI PANCA BEEF Pickled Red Onion, Cilantro $ 15 BBQ JERK CHICKEN Lime Aioli, Pikliz, Scallions $ 15 SANDWICHES BROKEN SHAKER BURGER Beef Patty, American Cheese, Pickles\nOnions, Shaker Sauce, Served with Fries Single Patty $ 16 Make it a Double + $ 5 FRIED CHICKEN SANDWICH Yuzu Ranch, Slaw, Scallions, Pickles, Served with Fries $ 16 SALAD WEDGE SALAD Iceberg Lettuce, Tomatoes, Bacon, Red Onion,\nBlue Cheese Crumble\nChoice of Classic Blue Cheese Dressing, Yuzu\nKosho Rancho or Lemon-Thyme Vinaigrette Salad $ 12 Add Avocado + $ 3 Add a Skewer + $ 8 SWEETS TRES LECHES Vanilla Sponge Cake Soaked in a Sweet Trio of\nMilk, Garnished with Whipped Cream and\nStrawberry $ 10 CINNAMON SUGAR CHURROS Caramel Dipping Sauce As is $ 8 Add Ice Cream Scoop $ 2 20% gratuity is added on all checks No more than 4 credit cards allowed per check COCKTAILS WELCOME TO MIAMI $15 RIO AZUL Grey Goose, St. George Chile, Blue Curaçao, Grapefruit SHORELINE SPRITZ Hendrick’s Gin, Bianco Vermouth, Suze, Grapefruit, Angostura TORO ROSSO El Jimador Tequila, St. George Chile, Watermelon, Topped with Red Bull Energy BREAKFAST IN THE MOONLIGHT Santa Teresa 1796 Rum, Wray & Nephew Rum, Orgeat, Passionfruit, Pineapple UP ON THE ROOF Ten to One Rum, Chareau, Watermelon, Basil, Fire Tincture, Tajin CLASSIC RIFFS $15 THE SCOTCH & TONIC Bruichladdich Scotch, Banana, Cacao, All Spice, Tonic GLORIOUS BASTERD Glenlivet 12 Scotch, Italicus, Fernet Branca, Ginger NIGHT TRAIN Jack Daniels Bonded, Ramazotti, Cynar, Demerara, Angostura, Orange Bitters ALWAYS SUMMER NEGRONI Beefeater Gin, Saler’s Aperitif, Martel VS, Cocchi Americano, Wintermelon Bitters, Grapefruit OUR AGAVE FRIENDS $15 SOTOL PALOMA Cardenxe Sotol, Aperol, Watermelon, Soda EAST OF EDEN Codigo Blanco Tequila, St. Germain, Sauvignon Blanc, Cucumber, Mint BOBBY BONILLA DAY El Jimador Tequila, Piment d'Espelette Cordial, Ancho Reyes, Mango, Tiki Bitters, Tarragon LA BAMBA COLADA Maestro Dobel Tequila, Walnut Cordial, Nixta Elote Liqueur, Coconut, Pineapple OAXACAN SLING BLADE Ilegal Reposado Mezcal, Cherry Herring, Cointreau Noir, Benedictine, Grenadine, Pineapple, Angostura DOWN THE RABBIT HOLE Rosaluna Mezcal, Nixta, Giffard Piment, Cacao, Carrot, Ginger FROZENS $15 FROZEN PINA COLADA Bacardi Ocho Rum, Pineapple, Coconut FROZEN STRAWBERRY MARGARITA Patron Reposado, Strawberry, Citrus MOCKTAIL $12 BASIL BABY SWIZZLE Aplos Calme Non-Alcoholic Spirit, Cucumber, Ginger Beer ROTATING BREWS PERONI Italian lager 5.1% ABV $ 8 MONOPOLIO Mexican Blonde Lager 5% ABV $ 7 MODELO Lager 4.7% ABV $ 7 EVER HAZE IPA $ 9 FUNKY BUDDHA HOP GUN IPA $ 9 COORS LIGHT Light Lager 4.2% ABV $ 7 BUDWEISER $ 7 MILLER HIGH LIFE American lager 4.6% ABV Single $ 6 Bucket of 5 $ 25 LAKE HOUR CANNED SELTZER Flavors: Watermelon Cucumber, Peach Jasmine, Rosemary Yuzu Single $ 8 Bucket of 6 $ 45 SPARKLING CAMPO VIEJO CAVA Glass $ 14 Bottle $ 55 MOET & CHANDON IMPERIAL CHAMPAGNE BRUT Glass $ 30 Bottle $ 150 MOET & CHANDON IMPERIAL ROSE CHAMPAGNE Bottle $ 175 RUINART BLANC DE BLANCS CHAMPAGNE Bottle $ 400 WHITE EMMOLO SAUVIGNON BLANC Suisun Valley, CA Glass $ 14 Bottle $ 55 JORDAN CHARDONNAY Russian River Valley, CA Glass $ 25 Bottle $ 100 ROSE MAISON SAINTE MARGUERITE Cotes du Provence, FR Glass $ 14 Bottle $ 55 RED CHLOE CABERNET SAUVIGNON Monterey County, CA Glass $ 14 Bottle $ 55 JORDAN CABERNET SAUVIGNON Russian River Valley, CA Glass $ 30 Bottle $ 165 NON-ALCOHOLIC PERONI 0.0% $ 8 SMART WATER $ 6 TOPO CHICO $ 6 ASSORTED SODAS Coke, Diet Coke, Sprite & Gingerale $ 4 RED BULL Classic, Sugar Free, Watermelon, Watermelon Sugar Free $ 7 Download PDF Reservations Instagram Freehand Hotels Press Contact Us Privacy Policy Email Signup powered by BentoBox leave this field blank Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Reservations Location - Required Location Broken Shaker | Cocktail Bar & Restaurant in the US Miami Chicago Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Please, select a date Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. First name Nachricht name E-Mail Surname * E-Mail * Nachricht * Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "https://www.brokenshaker.com/location/new-york-hours-and-location/",
      "text": "New York | Hours + Location | Broken Shaker | Cocktail Bar & Restaurant in the US Skip to main content About New York sub-menu New York About Happenings Private Events Reservations Menus Los Angeles sub-menu Los Angeles About Happenings Private Events Reservations Menus Miami sub-menu Miami About Happenings Private Events Reservations Menus Chicago sub-menu Chicago About Happenings Private Events Reservations Menus Madrid sub-menu Madrid About Happenings Private Events Madrid Menus Reservations Toggle Navigation About New York sub-menu New York About Happenings Private Events Reservations Menus Los Angeles sub-menu Los Angeles About Happenings Private Events Reservations Menus Miami sub-menu Miami About Happenings Private Events Reservations Menus Chicago sub-menu Chicago About Happenings Private Events Reservations Menus Madrid sub-menu Madrid About Happenings Private Events Madrid Menus Freehand Hotels Press Contact Us Privacy Policy Reservations Email Signup Instagram powered by BentoBox Main content starts here, tab to start navigating Slide 1 of 15 Slide 2 of 15 Slide 3 of 15 Slide 4 of 15 Slide 5 of 15 Slide 6 of 15 Slide 7 of 15 Slide 8 of 15 Slide 9 of 15 Slide 10 of 15 Slide 11 of 15 Slide 12 of 15 Slide 13 of 15 Slide 14 of 15 Slide 15 of 15 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Hours & Location 23 Lexington Avenue, New York, NY 10010 (212) 475-1920 Hours of Operation Tuesday - Wednesday 4pm - 12am Thursday - Saturday 4pm - 1am Sunday - Monday Closed 21+ After 6pm Happy Hour 4- 6pm daily About A rooftop cocktail bar with sweeping views of Manhattan, Broken Shaker offers an eclectic menu of handcrafted cocktails and fresh bites. Operated by Authentic Hospitality , Broken Shaker is a James Beard Award finalist and winner of Tales of the Cocktail’s Best American Hotel Bar. We are located on the 18th floor of Freehand Hotel. During the colder months, the entrance is through the hotel lobby. During the warmer months, the entrance moves to 24th Street. Interested in hosting an event with us? Email us at teams@authentic.nyc and our event team would be glad to assist. Make a Reservation Get Directions Happenings Check out our upcoming events. Learn More Private Events From fashion shows, film and photoshoots, birthdays, fashion shows and even meetings, our event team is ready to host you! Book Now Reservations Join us for a delicious meal and great drinks. Make a Reservation Our Menus Check out our current offerings. View Menus Reservations Instagram Freehand Hotels Press Contact Us Privacy Policy Email Signup powered by BentoBox leave this field blank Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Reservations Location - Required Location Broken Shaker | Cocktail Bar & Restaurant in the US Miami Chicago Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Please, select a date Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."
    },
    {
      "url": "https://www.brokenshaker.com/privacy-policy",
      "text": "Privacy Policy | Broken Shaker | Cocktail Bar & Restaurant in the US Skip to main content About New York sub-menu New York About Happenings Private Events Reservations Menus Los Angeles sub-menu Los Angeles About Happenings Private Events Reservations Menus Miami sub-menu Miami About Happenings Private Events Reservations Menus Chicago sub-menu Chicago About Happenings Private Events Reservations Menus Madrid sub-menu Madrid About Happenings Private Events Madrid Menus Reservations Toggle Navigation About New York sub-menu New York About Happenings Private Events Reservations Menus Los Angeles sub-menu Los Angeles About Happenings Private Events Reservations Menus Miami sub-menu Miami About Happenings Private Events Reservations Menus Chicago sub-menu Chicago About Happenings Private Events Reservations Menus Madrid sub-menu Madrid About Happenings Private Events Madrid Menus Freehand Hotels Press Contact Us Privacy Policy Reservations Email Signup Instagram powered by BentoBox Main content starts here, tab to start navigating Privacy Policy Updated On 11/26/2024 PRIVACY NOTICE Version 4.0 Last Updated: 1st December 2024 Our Commitment to Data Privacy Your privacy is important to Freehand Hostel Manager LLC, its affiliates and partners (“Freehand,” “we,” “us,” “our”). To better protect your privacy, we are providing information explaining our information practices. This Privacy Policy (“this Policy”) describes how we gather and use information for visitors of this website and guests at our hotels. If you have any questions regarding our use of your Personal Information, or this Policy, please contact legal@thefreehand.com. You do not need to take any action as a result of this Policy, but if you reside in California, you may have certain rights as described below in the section headed “Special Information for California Consumers”. It is important that you read this Policy together with any other privacy notice or fair processing notice we may provide on specific occasions when we are collecting or processing Personal Information about you, so that you are fully aware of how and why we are using your data. This Policy supplements the other notices and is not intended to override them. This website is not intended for children and we do not knowingly collect, solicit or sell data relating to children. This Policy covers: The Personal Information we collect about you How we obtain your Personal Information and Other Data How we use your Personal Information and Other Data Disclosure of Personal Information and Other Data How we keep your Personal Information secure How long we retain your Personal Information Your rights Special Information for California Consumers How to contact us. Third Party Sites and Links Our website may include links to third party websites, plug-ins and applications. Clicking on those links or enabling those connections may allow third parties to collect or share data about you. We do not control these third-party websites and are not responsible for their processing of your Personal Information. When you leave our website, we encourage you to read the privacy policy of every website you visit. 1. THE PERSONAL INFORMATION WE COLLECT ABOUT YOU “Personal Information” are data that identify you as an individual or relate to an identifiable individual. Freehand collects the following categories of Personal Information from you: Personal identifiers Categories of personal information related to California Customer Records statute (Cal. Civ. Code § 1798.80); Commercial information; Audio, electronic and visual information; Internet or other electronic network activity information; Geolocation Data; and Protected classification information. Freehand also collects the following specific types of Personal Information, when providing you with our products and services:- Name Gender Postal address Telephone number Email address Credit and debit card number or other payment data Financial Information in limited circumstances such as residential services Language preference Date and place of birth Nationality, passport, visa or other government-issued identification data Important dates, such as birthdays, anniversaries and special occasions Travel itinerary, tour group or activity data Prior guest stays, interactions, goods and services purchased, special service and amenity requests Geolocation information Social media account ID, profile photo and other data publicly available We will also collect the following types of Personal Information for the following purposes: Images and video and audio data via security cameras located in public areas, such as hallways and lobbies, in our properties Guest preferences and personalised data such as your interests, activities, hobbies, food and beverage choices, services and amenities of which you advise us, or which we learn about during your visit. 2. HOW WE OBTAIN YOUR PERSONAL INFORMATION Personal Information is collected in a variety of ways: Online Services. Personal Information is collected through online services either directly or through an affiliate booking website, such as: The reservation process The check out process for electronic folio receipts The purchase of goods or services through the website or ecommerce website Communication via email Connecting or posting to social media related to the properties To participate in a survey, contest or promotional offer Property Visits. Personal Information is collected when guests visit our properties or use on- property services and outlets, such as: Restaurants Concierge services Health clubs Spas Offline Interactions. Personal Information is collected when individuals attend promotional events that we host or in which we participate, or when you provide your Personal Information to facilitate an event. Reservations and Customer Service Centers. Personal Information is collected when you make a reservation over the phone, communicate with us by email or contact customer services. These communications may be recorded for the purposes of quality assurance and training Other Sources. Personal Information is also collected from other sources, such as public databases, joint marketing partners, data analytics vendors and other third parties Internet-Connected Devices. Personal Details may also be collected from internet-connected devices available in our properties. For example, a smart assistant device may be available for your use and to tailor your accommodations and experience “Other Data” are data that generally do not reveal your specific identity or do not directly relate to an individual. To the extent Other Data reveals your specific identity or relates to an individual, we will treat Other Data as Personal Information. Other Data includes: Browser and device data App usage data Data collected through cookies, pixel tags and other technologies Demographic data and other data provided by you Aggregated data We Collect Other Data in a Variety of Ways We collect certain data through your browser or automatically through your device, such as your Media Access Control (MAC) address, computer type (Windows or Mac), screen resolution, operating system name and version, device manufacturer and model, language, internet browser type and version and the name and version of the Online Services (such as the Apps) you are using. We use this data to ensure that our Online Services function properly. Cookies We collect certain data from cookies, which are pieces of data stored directly on the computer or mobile device that you are using. Cookies allow us to collect data such as browser type, time spent on the Online Services, pages visited, referring URL, language preferences and other aggregated traffic data. We use the data for security purposes, to facilitate navigation, to display data more effectively, to collect statistical data, to personalize your experience while using the Online Services and to recognize. See the Cookie list on your computer to assist your use of the Online Services. We also gather statistical data about use of the Online Services to continually improve design and functionality, understand how they are used and assist us with resolving questions. What is a Cookie? A cookie is a text file that contains small amounts of data downloaded to your device when you visit a web site. A cookie is sent back to the web site on each subsequent visit or to another web site that recognizes that cookie. Cookies enable a website to recognize your computer, mobile, or other device. As with most other websites, we place cookies on your device to understand more about your visit and help us enhance your experience. You can find more information about cookies at: www.allaboutcookies.org Cookies on this Site We will use Cookies to: Remember your username and password for future visits so that log-in is easier and faster; Remember your language and other preferences; Ensure you obtain all requested information; Provide a safe and secure service for online transactions; Measure how many people use the Site, and how they use it, so that we may keep it running quickly and efficiently; and Help us and others deliver communications and content to you that are relevant and responsive to your interests and location. There are four different categories of cookies used on our Sites: cookies that are strictly necessary; cookies that record functionality requests; cookies that assist with the performance of our Sites; and advertising cookies. Each purpose is outlined below. Strictly Necessary Cookies These cookies are required to allow you to navigate a Site and utilize its various features, such as accessing secure areas of the Site. Services that you have requested, such as making a hotel reservation online, could not be provided without these cookies. These cookies do not collect information that could be used for advertising purposes. Functional Cookies These cookies allow a Site to collect information about your choices, such as your region or preferred language. This allows the Site to personalize content for you. These cookies can also be used to store login information and to remember the changes you have made to the font, text size, and other customizable features on the Site. Although the information collected by these cookies does not personally identify you, these cookies may be able to identify you when combined with other data, because they track certain ISP information for your settings. They do not gather information about you that could be used for advertising or tracking where you have been on the Internet. Performance Cookies These cookies gather information about how you use this Site to ensure efficient operation of the Site’s functions. For example, they may collect information regarding whether you encountered problems or errors from one of the pages or which pages you visit most often. These cookies do not directly collect information that personally identifies you. When you provide information that identifies you, we may use these cookies to provide relevant information on the Site, based on your activities and information you have provided on the Site. Targeting Cookies These cookies collect information regarding your browsing habits. They are usually placed by third party advertising networks, such as those owned by Google, Facebook or other third parties. They remember when you visit this Site and share this information with other organizations, including advertisers. They do this to tailor online advertisements to you or your interests. Although these cookies can track your visits to sites on the Internet, the cookies themselves do not usually personally identify you. How to Manage Cookies You can restrict or block cookies that are set by the Site (or any other site on the Internet) by adjusting your browser settings or you can click here. You may visit www.allaboutcookies.org to obtain more information regarding cookies and how to adjust the cookie settings on various browsers. This site explains how to delete cookies from your computer. Please be aware that restricting cookies may restrict the functionality of the Site. Pixel Tags and Other Similar Technologies We collect data from pixel tags (also known as web beacons and clear GIFs), which are used with some Online Services to, among other things, track the actions of users of the Online Services (including email recipients), measure the success of our marketing campaigns and compile statistics about usage of the Online Services. Your IP Address We collect your IP address; a number that is automatically assigned to the computer that you are using by your Internet Service Provider (ISP). An IP address is identified and logged automatically in our server log files when a user accesses the Online Services, along with the time of the visit and the pages that were visited. We use IP addresses to calculate usage levels, diagnose server problems and administer the Online Services. We also may derive your approximate location from your IP address. Aggregated Data We may aggregate data that we have collected, and this aggregated data will not personally identify you or any other user. 3. HOW WE USE YOUR PERSONAL INFORMATION We use Personal Information and Other Data to provide you with Services, to develop new offerings and to protect Freehand and our guests as detailed below. In some instances, we will request that you provide Personal Information or Other Data to us directly. If you do not provide the data that we request, or prohibit us from collecting such data, we may not be able to provide the requested Services. We will let you know if this is ever the case. We use Personal Information and Other Data for the following business purposes, under the following lawful bases: Purpose Activity Lawful Basis 1. To facilitate reservations, payment, send administrative information, confirmations or pre-arrival messages, to assist you with meetings and events and to provide you with other information about the area and the property at which you are scheduled to visit. When you register to use our services or facilities, we collect your personal contact details, payment information, passport details and any other information required to facilitate the purposes stated. Performance of Contract 2. To support our electronic receipt program. When you provide an email address when making a reservation, we use that email address to send you a copy of your bill. If you make a reservation for another person using your email address, that person’s bill will be emailed to you, as well. Legitimate Interest 3. To personalize the Services according to your Personal Preferences. We use Personal Information and Other Data to personalize the Services and improve your experiences, including when you contact our reservations center, visit one of our properties or use the Online Services. We do this to customize your experience according to your Personal Preferences and present offers tailored to your Personal Preferences. Legitimate Interest 4. To communicate with you about goods and services according to your Personal Preferences. We use Personal Information and Other Data to send you marketing communications and promotional offers, as well as periodic customer satisfaction, market research or quality assurance surveys. Consent 5. To offer sweepstakes, activities, events and promotions. We use Personal Information and Other Data to allow you to participate in sweepstakes, contests and other promotions and to administer these activities. Some of these activities have additional rules and may contain additional information about how we use and disclose your Personal Information. We suggest that you read any such rules carefully. Consent 6. For business administration, to uphold the law and to maintain the safety and security of our guests, employees and property. We use Personal Information and Other Data for data analysis, audits, security and fraud monitoring and prevention (including with the use of closed-circuit television, card keys and other security systems). Legitimate Interest Legal Obligation 7. To continually develop the products and services we provide. We use Personal Information and Other Data for developing new goods and services, enhancing, improving or modifying our Services, identifying usage trends, determining the effectiveness of our promotional campaigns and operating and expanding our business activities. Legitimate Interest 4. DISCLOSURE OF PERSONAL INFORMATION AND OTHER DATA Our goal is to provide you with the highest level of hospitality and services, and to do so, we share the following categories of Personal Information: Personal Identifiers; Categories of personal information related to California Customer Records statute (Cal. Civ.Code § 1798.80); Commercial information; Audio, electronic and visual information; Geolocation Data; and Special categories of personal information. The business purposes for which we disclose these categories of personal information and the third parties with whom we share it are described in detail below: Purpose Third-Party Recipients 1. We disclose Personal Information and Other Data to Owners of Freehand-branded properties and other companies in the Freehand and Generator brand of companies for the purposes described in this Privacy Statement, such as providing and offering products and services to Freehand. Owners and Franchisees 2 We disclose Personal Information and Other Data with select Strategic Business Partners who provide goods, services and offers that enhance your experience at our properties or that we believe will be of interest to you. By sharing data with these Strategic Business Partners, we are able to make personalized services and unique travel experiences available to you. For example, this sharing enables restaurant, health club, concierge and other outlets at our properties to provide you with services. This sharing also enables us to provide you with a single source for purchasing packages that include travel-related services, such as airline tickets, rental cars and vacation packages. Strategic Business Partners 3. We disclose Personal Information and Other Data to third-party affiliates, vendors and service providers for the purposes described in this Privacy Statement and to support Freehand’s operations. Examples of service providers include companies that provide website hosting, data analysis, payment processing, order fulfilment, billing, information technology and related infrastructure provision, customer services, email delivery, marketing, auditing and other services. Service Providers 4. We may disclose or transfer your Personal Information and Other Data to a third party in the event of any reorganization, merger, sale, joint venture, assignment, transfer, or other disposition of all or any portion of the Freehand business, assets or stock (including any bankruptcy or similar proceedings). Corporate Restructure Entities 5. We may disclose your Personal Information to the employers of guests who used a corporate credit card for purchases. Employers of Guests 6. We may disclose your Personal Information to any event organizers participating in planning events with / on behalf of Freehand. Event Organizers 7. We may disclose your Personal Information to legal and regulatory authorities, our professional advisors (such as lawyers, accountants, auditors, etc.), or law enforcement agencies to support Freehand’s operations and comply with legal and contractual obligations. Government Authorities and Professional Advisors Other Uses and Disclosures We will use and disclose Personal Information as we believe to be necessary or appropriate: to comply with applicable law and contractual obligations, including laws outside your country of residence; to comply with legal process; to respond to requests from public and government authorities, including authorities outside your country of residence and to meet national security or law enforcement requirements; to enforce our terms and conditions; to protect our operations; to protect the rights, privacy, safety or property of Freehand, you or others; and to allow us to pursue available remedies or limit the damages that we may sustain. We may use and disclose Other Data for any purpose, except where we are not allowed to under applicable law. In some instances, we may combine Other Data with Personal Information (such as combining your name with your location). If we do, we will treat the combined data as Personal Information for so long as it is combined. We do not sell, and in the past 12 months have not sold, your personal information. 5. HOW WE KEEP YOUR PERSONAL INFORMATION SECURE We use appropriate organizational, technical and administrative measures to protect Personal Information. Unfortunately, no data transmission or storage system can be guaranteed to be 100% secure. If you have reason to believe that your interaction with us is no longer secure (for example, if you feel the security of your account has been compromised), please immediately notify us in accordance with the “Contacting Us” section on the website. 6. HOW LONG WE RETAIN YOUR PERSONAL INFORMATION We will only retain your Personal Information for as long as is necessary to fulfil the purposes for which we collected it, including satisfying any legal, accounting, or reporting requirements. To determine the appropriate retention period for Personal Information, we consider the amount, nature, and sensitivity of the Personal Information, the potential risk of harm from unauthorized use or disclosure, the purposes for which we process your Personal Information and whether we can achieve those purposes through other means, along with the applicable legal requirements. In some circumstances we may anonymize your Personal Information (so that it can no longer be associated with you) for research or statistical purposes, in which case we may use this information indefinitely without further notice to you. For further information on how long we retain your Personal Information, please contact legal@thefreehand.com. 7. YOUR RIGHTS You are provided with certain rights in relation to the processing of your personal data, including to: Request access to personal data about you (a “data subject access request”). This enables you to receive a copy of the personal data we hold about you, and to check that we are processing it lawfully; Request rectification, correction, or updating to any of the personal data that we hold about you. This enables you to have any incomplete or inaccurate information we hold about you corrected; Request personal data provided by you to be transferred in machine-readable format (“data portability”); Request erasure of personal data. This enables you to ask us to delete or remove personal data where there is no good reason for us continuing to process it. You also have the right to ask us to delete or remove personal data where you have exercised your right to object to processing (see below); Request the restriction of processing of your personal data. This enables you to ask us to suspend the processing of personal data about you (e.g., if you want us to establish its accuracy or the reason for processing it); and Object to the processing of your personal data in certain circumstances. This right may apply where the processing of your personal data is based on our legitimate interests. Some of these rights are not absolute and are subject to various conditions under applicable data protection and privacy legislation, laws, and regulations to which we are subject. If at any time you decide that you no longer wish to be contacted for marketing purposes, or if you would like to exercise any of your rights as set out above, you can contact us atlegal@thefreehand.com. You will not have to pay a fee to access your personal data (or to exercise any of the other rights). However, we may charge a reasonable fee if your request for access is clearly unfounded or excessive. Alternatively, we may refuse to comply with the request in such circumstances. In addition to the above, please note that you have the right to make a complaint at any time to the relevant data protection supervisory authority if you are concerned about the way in which we are handling your personal data. Please allow up to thirty (30) days for a response, from the day of your request submission. 8. SPECIAL INFORMATION FOR CALIFORNIA CONSUMERS California residents may request a list of certain third parties to which we have disclosed personally identifiable information about you for their own direct marketing purposes. You may make one request per calendar year. In your request, please attest to the fact that you are a California resident and provide a current California address for your response. You may request this information in writing by contacting us through one of the methods listed under the “How to contact us” section. California Consumer Privacy Act (CCPA) Consumer Rights If you are a resident of California, the CCPA grants you the following specific rights regarding your personal information. To exercise the rights, you must submit a verified consumer request. We will deliver a response to you within 45 days of receiving the verifiable consumer request. Right to Know You have the right to submit a verifiable consumer request, that we disclose the following to you in a readily useable format covering the 12-month period preceding your request: The categories of personal information we have collected about you The categories of sources of the personal information we have collected about you The business or commercial purpose(s) for collecting personal information The categories of third parties with whom we share personal information The specific pieces of personal information we have collected about you The categories of personal information we have disclosed for a business purpose Verifiable consumer requests to know may be submitted through one of the following methods: Send an email to legal@thefreehand.com entitled “CCPA Request”; or Submit a consumer request at the front desk of any Freehand Hotel location. A consumer may submit a request to know and receive a response twice within a 12-month period. Right to Request Deletion You have the right to request that we delete any personal information that we have collectedfrom you. However, we are not required to comply with a request to delete, if it is necessary forus to retain the personal information to: Complete the transaction for which we collected the personal information, provide a good or service that you requested, take actions reasonably anticipated within the context of our ongoing business relationship with you, or otherwise perform our contract with you; Detect security incidents, protect against malicious, deceptive, fraudulent, or illegal activity, or prosecute those responsible for such activities; Debug products to identify and repair errors that impair existing intended functionality; Exercise free speech, ensure the right of another consumer to exercise their free speech rights, or exercise another right provided for by law. Comply with the California Electronic Communications Privacy Act (Cal. Penal Code § 1546 et. seq); Engage in public or peer-reviewed scientific, historical, or statistical research in the public interest that adheres to all other applicable ethics and privacy laws, when the information’s deletion may likely render impossible or seriously impair the research’s achievement, if you previously provided informed consent; Enable solely internal uses that are reasonably aligned with consumer expectations based on your relationship with us; Comply with legal obligations; or Make other internal and lawful uses of that information that are compatible with the context in which you provided it. Verifiable consumer requests to delete may be submitted through one of the following methods: Send an email to legal@thefreehand.com entitled “CCPA Request”; or Submit a consumer request at the front desk of any Freehand Hotel location. Right to Non-Discrimination You have the right to be free from discrimination when you exercise your consumer rights under the CCPA, including by: Denying you goods or services; Charging you a different price or rate for goods or services, including through granting discounts or other benefits, or imposing penalties; Providing you a different level of quality of goods or services; or Suggesting that you may receive a different rate for goods or services or a different level or quality of goods or services. We may, however, offer you financial incentives for the collection, sale or deletion of your personal information. We may also offer you a different price, rate, level or quality of goods or services if that difference is reasonably related to the value provided to us by your data. 9. HOW TO CONTACT US If you have any questions regarding our use of your Personal Information, or this Policy, please contact legal@thefreehand.com. Alternatively, you may wish to write to: Freehand Hostel Manager LLC Freehand New York 23 Lexington Avenue New York, NY 10010 Changes to this Policy and Your Personal Information This Policy is regularly reviewed and was last updated on 1st October 2024. It is important that the Personal Information we hold about you is accurate and up to date. Please keep us informed if your Personal Information changes during your relationship with us. Reservations Instagram Freehand Hotels Press Contact Us Privacy Policy Email Signup powered by BentoBox leave this field blank Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Reservations Location - Required Location Broken Shaker | Cocktail Bar & Restaurant in the US Miami Chicago Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Please, select a date Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."
    },
    {
      "url": "https://www.cntraveler.com/bars/miami-beach/the-broken-shaker",
      "text": "The Broken Shaker, Miami - Bar Review | Condé Nast Traveler Skip to main content Newsletter Sign In Search Search Newsletter Inspiration Destinations Places to Stay News & Advice Curated Escapes Shopping Cruise Women Who Travel Video North America Chevron United States Chevron Florida Chevron Miami Beach Chevron Review: Broken Shaker The bar that built Miami's cutting edge drinks scene Chevron Chevron Photos Save Story Save this story Save Story Save this story Reviewed by Jennifer M. Wood First impression? Miami owes much of its reputation as one of America’s most innovative cocktail cities to Broken Shaker. In 2012, the former pop-up bar found a permanent home at The Freehand , an upscale hostel where the vibe tends toward house party. Though there is a bar, follow the throng of thirsty patrons to find a seat in the quaint little courtyard—complete with twinkling lights and mismatched furniture—or around the pool. You’ll thank us. So who’s there? It may have started as a cool spot for Locals, but its national reputation, which has brought two James Beard Award nominations, and additional outposts in Chicago, Los Angeles and New York, have brought out-of-towners in droves. For co-owner Gabriel Orta, what's kept it hopping is a welcoming “Old European World meets Key West meets Hawaii” vibe. “It’s a place where everyone is welcome,” he says. “The atmosphere is relaxed, but we take hospitality seriously.” It’s the kind of spot where one drink turns into three (or more), with no regrets. How are the drinks? Cocktails are the main attraction here. There are seasonal drinks as well as monthly specials, but there’s also a daily-changing menu that’s made with whatever looks good in the bar’s onsite garden (so don’t be surprised to find fresh fruits or sprigs of basil in your drink). Some drinks, like their version of a Pimm’s Cup or Old-Fashioned, are standards (and stars); other drinks may appear only for a night. Consider going in a small group to take advantage of the Bartender’s Special: You choose a spirit, fruit, and botanical and the bartender will customize a pitcher. Worth ordering something to eat, too? Though The Freehand is also home to 27 Restaurant (which is worth a separate trip), Broken Shaker serves up an impressive menu of globally inspired bar bites. This menu, too, changes often, although you should always find a selection of tacos and other handheld bites. For day drinkers, they serve lunch and cocktails poolside from noon to 5 p.m. on weekdays. Did the staff do you right? Though attentive service can be a bit of a crapshoot in Miami Beach, Broken Shaker never fails to impress. Even when the house is packed, the personable staffers (many of whom seem to have been there since the bar first opened) will take the time to help you sort out the menu and your many options, making you feel like you’re the only customer in the world. Wrap it up: what are we coming here for? On a warm night, sitting under the twinkling lights, it's hard not to have a romantic night out. But it’s also a great place to catch up with friends, especially as the bar accepts reservations for groups of six or more (which is a rarity for bars of its ilk). Location Map Contact 2727 Indian Creek Dr., Miami Beach, Florida 33140 United States (786) 325-8974 http://thefreehand.com/miami/venues/the-broken-shaker/ More To Discover Hotel Shelborne by Proper: First In $$ | United States, Miami Beach, 1801 Collins Avenue A new, grown-up iteration of Miami Beach’s midcentury Art Deco scene Book Now at Expedia Powered By: Expedia Hotel 1 Hotel South Beach $$ | USA, Miami Beach, 2341 Collins Ave. Seaside in Miami's South Beach—a sexy, glamour-at-your-fingertips stay. Book Now at Booking.com Powered By: Booking.com Hotel Faena Hotel Miami Beach $$$ | United States, Miami Beach, 3201 Collins Ave. If you want to know what it feels like to live in a big-budget Hollywood musical, try staying at Faena Miami Beach. Book Now at Skylark Powered By: Skylark Hotel Nobu Hotel Miami Beach $$ | United State, Miami Beach,  4525 Collins Ave The most reasonably-priced of Miami Beach's myriad five-stars. Book Now at Expedia Powered By: Expedia Resort Eden Roc Miami Beach $$ | United States, Miami Beach, 4525 Collins Ave. Along an exclusive stretch of beach. Book Now at Expedia Powered By: Expedia Hotel The Setai Miami Beach $$$ | United States, Miami Beach, 2001 Collins Ave. At The Setai, Art Deco glamour and Asian-inspired luxury combine to create a truly tranquil stay. Book Now at Expedia Powered By: Expedia Read More 18 Best Bars in Miami Pinterest Facebook Snapchat Instagram X As the most discerning, up-to-the-minute voice in all things travel, Condé Nast Traveler is the global citizen’s bible and muse, offering both inspiration and vital intel. We understand that time is the greatest luxury, which is why Condé Nast Traveler mines its network of experts and influencers so that you never waste a meal, a drink, or a hotel stay wherever you are in the world. About Condé Nast Traveler Subscribe Manage Account Newsletter Sign Up Readers' Choice Awards Archive Contact the Editors Careers User Agreement Privacy Policy Your California Privacy Rights RSS Feeds Condé Nast Store © 2025 Condé Nast. All rights reserved. Condé Nast Traveler may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices Select international site United States LargeChevron India Spain United Kingdom Middle East Germany"
    },
    {
      "url": "https://teamboard.cloud/teamboard-for-monday-com/",
      "text": "TeamBoard for monday.com - TeamBoard - Resource planning, project management and Gantt Chart for Jira, monday.com Products ProScheduler for Jira Task Management WBS Gantt Chart Resource/Team Management Project/Portfolio Timeline Workload Management Project/Portfolio Calendar Time Tracking Report & Dashboard TimePlanner for Jira Resource Management Team Management Time Tracking, Timesheets Cost Management Client Management Report & Dashboard TeamBoard for monday.com Task Management Work Management Resource/Team Management Time Tracking Program Board TeamBoard for Salesforce Task Management Resource Management Time Tracking Reporting Portfolio Management Solutions By Industry IT Teams Marketing Sales Human Resources Operations Real Estate Customer Support Healthcare Retail By Capability Small Business Medium Business Enterprise Business By Use Case Project Managers Team Leaders Product Owners Business Owners Contractors HR Managers Financial Controllers Pricing ProScheduler for Jira TimePlanner for Jira TeamBoard for monday.com TeamBoard for Salesforce Resources Documentation Blogs What’s New eBooks Video Tutorial Webinars Integrations FAQs Support Contact us Schedule a Demo Support Desk Test on Sandbox About Us Trust Center Leave a review TeamBoard ProScheduler for Jira TeamBoard TimePlanner for Jira TeamBoard for monday.com TeamBoard for Salesforce Try Now TeamBoard for monday.com Resource Management, Calendar, Recurring Tasks & Time Tracking, Timesheets – All in One Place! Start your free trial Book a Demo Resource Scheduler Plan and Assign Tasks with Ease Simple Task Planning : Assign tasks based on team availability and capacity. Real-Time Updates: Changes sync automatically across your monday.com boards. Avoid Overload: Track team workloads to prevent overburdening anyone. Clear Overview: See tasks on a visual timeline to spot potential issues early. Try for free → Working Capacity & Holiday Calendar Manage Workloads and Time Off with Ease Track Capacity: Easily see how much work each team member can handle. Plan for Time Off : Keep track of holidays, vacation days, and time off to avoid scheduling conflicts. Leave Requests : Track and approve team members’ time off requests in one place. Balance Workloads: Adjust tasks based on team availability to ensure no one is overloaded. Try for free → Time Tracking & Timesheets Effortlessly Track Time and Manage Timesheets Simple Time Tracking : Log time spent on tasks directly in the app. Timesheet Management : Review and approve timesheets with a few clicks. Easy Reports: Generate reports to see where time is being spent and optimize your workflow. Try for free → Calendar View Get a Clear Overview of Tasks and Deadlines View Tasks & Deadlines : See all your tasks and deadlines in one calendar. Customizable Views: Switch between daily, weekly, or yearly views to fit your needs. Track Holidays: Easily manage team holidays and ensure proper planning. Stay Organized: Keep track of all upcoming work and prevent scheduling conflicts. Try for free → Recurring Tasks Automate Repetitive Tasks and Save Time Set Up Once, Automate Forever : Create tasks that automatically repeat on your preferred schedule. Flexible Scheduling: Choose from daily, weekly, or custom intervals. Stay Organized: Keep recurring tasks organized and ensure nothing gets missed. Save Time: Eliminate the need to manually recreate tasks over and over again. Try for free → Manage Multiple Boards in Dashboard & Reports Track Multiple Boards in One Unified Dashboard Unified Dashboard : Monitor all your projects and teams in one place. Custom Reports: Create interactive reports to track performance, progress, and resource usage. Cross-Board Management: Easily manage tasks and resources from multiple boards within a single dashboard. Real-Time Updates: Get live insights into your team’s performance and project timelines. Try for free → Get Started with TeamBoard for monday.com Getting Started is Simple Start using TeamBoard in just a few clicks. Install the app from the monday.com marketplace, explore its intuitive features like the Resource Scheduler, Calendar View, and Timesheets, and see how it transforms your workflow. Need help? Book a free demo and let us guide you through everything your team needs to get started quickly and effectively. Access the Quick Start Guide → Integrate with monday.com Integrates seamlessly with monday.com environments and offers a centralized platform for managing tasks, projects, and resources effectively. Install Now TeamBoard for monday.com Features Resource Planning Resource Planning helps managers optimize their workforce and workload distribution. Try for free Project management Project management empowers managers to oversee their projects effectively. Try for free Workload Management It involves the process of efficiently distributing and managing work across your team members. Try for free Time Tracking Time Tracking lets managers monitor hours spent on tasks accurately. Try for free Calendar View This feature helps individuals and teams see at a glance what needs to be accomplished daily, weekly, monthly, or even annually. Try for free Others Additional features include work capacity, holiday scheme, timesheet, task planning, comprehensive reporting,… Try for free Blog Posts Resource Planning , TeamBoard TimePlanner , Time Management 9 Jul at 6:39 am TimePlanner vs. Activity Timeline: Best tool for Jira time tracking TeamBoard TimePlanner , Time Management 30 Jun at 6:08 am TimePlanner vs. Timesheets: Comparing Jira time tracking tools TeamBoard ProScheduler , Work Productivity 30 Jun at 4:06 am How to Boost Your Remote Work Productivity Project Management 20 Jun at 10:06 am 10 Common Mistakes to Avoid When Using Gantt Charts in Project Management All , Resource Planning 11 Feb at 4:50 am Why Task Management is the Missing Link in Agile Resource Planning Project Management 9 Jan at 8:30 am 2025 Project Management Trends: Essential Tools and Breakthrough Innovations TeamBoard TimePlanner 8 Jan at 3:56 am New Team UI and Exciting Updates in TimePlanner | Upcoming Release for Jira Cloud All , TeamBoard for monday.com , Time Management 5 Dec 2024 5 Tips to Optimize Time Tracking with Teamboard App on monday.com Project Management 4 Dec 2024 🎅 Santa’s Workshop: Project Management Tips for a Productive Season All , TeamBoard TimePlanner 2 Dec 2024 Common Challenges of Leave Management in Jira and How to Overcome them View All Blogs We’re Here for You! Knowledge Base App Support Desk Request Demo One-Stop Solution for project management, resource planning, WBS gantt charts, time tracking, and timesheets. Twitter YouTube Pinterest Facebook LinkedIn Solutions Gantt Chart for Jira with TeamBoard Resource Planning Cost Management Resource Management Time tracking, Timesheets Project Management Support Documentation Video About Us Contact Us TeamBoard Demo Request eBooks Pricing Test on Sandbox Trust Center Sitemap Other products ProductGo AssetIT Mocky Leanboard AgileTest AgileBox Routemap TaskFord AssetLoom Contact Us hello@teamboard.cloud +81 50 362 78910 DevSamurai, Inc. 3-6-25 Komone, Itabashi-ku, Tokyo 173-0037 Japan © 2022 TeamBoard. All Right Reserved. Menu"
    }
  ]
}