{
  "fuentes": [
    {
      "url": "https://sites.google.com/pgahq.com/brokensoundclub-sdog/home",
      "email": "glofstead@pgahq.com"
    },
    {
      "url": "https://sites.google.com/pgahq.com/brokensoundclub-sdog/home",
      "email": "tlogan@pgahq.com"
    },
    {
      "url": "https://www.bluegolf.com/amateur/programs/bgtmabsc/about.html",
      "email": "jwaber@brokensoundclub.org"
    },
    {
      "url": "https://www.clubspot.app/contact-support",
      "email": "info@clubspot.app"
    },
    {
      "url": "https://sound.london/contact-us",
      "email": "letsparty@sound.london"
    },
    {
      "url": "https://sound.london/contact-us",
      "email": "marketing@sound.london"
    },
    {
      "url": "https://sound.london/contact-us",
      "email": "play@sound.london"
    },
    {
      "url": "https://sound.london/contact-us",
      "email": "r.ashcroft@verve.com"
    }
  ],
  "mails": [
    "glofstead@pgahq.com",
    "info@clubspot.app",
    "jwaber@brokensoundclub.org",
    "letsparty@sound.london",
    "marketing@sound.london",
    "play@sound.london",
    "r.ashcroft@verve.com",
    "tlogan@pgahq.com"
  ],
  "nombre_sitio": "brokensoundclub.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://sites.google.com/pgahq.com/brokensoundclub-sdog/home",
      "text": "Broken Sound Club Search this site Embedded Files Skip to main content Skip to navigation Broken Sound Club Broken Sound Club Boca Raton, FL Senior Director of Golf Operations ABOUT BROKEN SOUND CLUB Boca Raton, FL | Encompassing nearly 1,000 acres at the main club and 200 acres at The Old Course, Broken Sound Club has 1,600 residents consisting of both Single-Family and Multi-Family residences. The Club provides members with a lifestyle that embodies the perfect balance of active living, professional success, athletic excellence, and socializing at our luxurious, gated golf and country club community. Nestled within our community are 28 distinct residential villages, each boasting its own distinctive character and charm. Our community boasts an impressive array of award-winning amenities, just minutes away from your doorstep, including a two-acre poolscape with a bistro, a 38,000-square-foot, LEED Certified Moonstone Spa & Fitness Center, 23 tennis courts, and 4 pickleball courts. And let's not forget about our two world-renowned golf courses, both GEO Certified and Audubon Sanctuary Certified. The Old Course was designed by Rees Jones and hosted the PGA Tour Champions James Hardie Pro Football of Fame Invitational. The Club Course was originally designed by Gene Bates and redesigned in 2017 by Matt Swanson. Our private club is renowned for its signature warmth, elegance, and genuine hospitality. We take pride in delivering a lifestyle that is second to none. CLUB VALUES The Members of Broken Sound believe in and are committed to a family-oriented club that is friendly and progressive, open, and responsive to the interests of its members and respectful of its customs and traditions. Broken Sound is known in the area for having a membership that promotes camaraderie and appreciates and supports its staff. CLUB VISION Provide the finest golf experience, facilities, and amenities for those seeking an active, meaningful, and fulfilling lifestyle. CLUB MISSION Broken Sound exists to increase the value of Broken Sound membership and the satisfaction of its members. We will preserve our natural beauty while maintaining championship-caliber golf courses and top-rated facilities, emphasizing sound fiscal management and service excellence, to provide members with a rewarding lifestyle and a friendly social environment. Learn More CLUB DETAILS Facility: Member-Owned Course Access: Private Number of Holes: 36 Golf Shop Sales: $1M (Cost +20% Model) Total Annual Rounds: 58,000 rounds of golf (Collectively) Old Course: 22,000 Annual Rounds, 350 Old Course Memberships, $200,000 Initiation Fee Club Course: 36,000 Annual Rounds, 470 Club Course Memberships, $150,000 Initiation Fee 60% of the membership are full-time residents Board Members: 9 Employees: 60 Employees (FTE) in season POSITION OVERVIEW Title: Senior Director of Golf Operations Reports to: General Manager/COO Supervises: Direct oversight of all golf operations, in close coordination with each course's Superintendent and other department heads Position Description: The Senior Director of Golf Operations (SDOG) at Broken Sound will be the leader, an engaged, highly visible presence, who takes full ownership of the club's golf operations. This individual will be a strategic, forward-thinking visionary, shaping the future of golf at Broken Sound while fostering meaningful connections with all member constituencies. The ideal candidate is a hands-on leader with their finger on the pulse of the entire golf experience. They will embody the highest standards of integrity, professionalism, and diplomacy, and be an approachable presence among both members and staff. A strong manager and an inspiring leader, the SDOG will value collaboration and respect the contributions of volunteers and team members at every level. They must be capable of setting and upholding high standards while holding both staff and members accountable to those expectations. The SDOG will be expected to elevate the golf experience through creative programming, exceptional service, and a strategic approach to operations. Ultimately, this is a role for someone with vision, intellect, business acumen, and the ability to shape and deliver a golf experience that reflects the excellence and energy of Broken Sound. INITIAL PRIORITIES AND KEY CHARACTERISTICS Team Builder - unify both Courses into a cohesive unit vs stand-alone operations and separate teams. A team builder who has a history of attracting, developing, motivating, and retaining a high-performance team of professionals to propel the operation forward Ability to sustain a culture of premier service and adherence to standards Knowledgeable in best practices in top-performing and high-member satisfaction operations across the country A highly visible and interactive individual committed to engaging members at every opportunity to develop high levels of member satisfaction A proven track record in player and program development, working with all levels of playing abilities and diverse skill levels to grow the game A strong team leader focused on two-way communication with all team members Experience in similar club environments where traditions and respect, both personally and with the Club, are intrinsically rooted To reiterate, fostering a culture of solidarity and teamwork throughout the team and the Club at large is very important to the staff and membership. Significant to this expectation is the ability to lead a team of friendly, engaging, competent, and passionate staff who are sincere about serving the Club's members. CANDIDATE QUALIFICATIONS A verifiable record of working closely and successfully in a private club, with an active Board and committees, while providing visionary leadership and partnership with the General Manager/COO A verifiably unblemished career track that demonstrates a record of tenure and commitment to previous employers, where career moves were for the enhancement of skills and experiences as opposed to unplanned career changes A minimum of 3-5 years of verifiable, progressive leadership and golf management experience. A high level of playing ability or playing enjoyment Strong golf community network Verifiable ability to attract, hire, develop, and lead a high-performing team of professionals while setting and maintaining standards of performance appropriate to perpetuating the mission and values of Broken Sound Exceptionally strong communication skills with members and staff, creating an open exchange environment to move the golf operations forward in a consistently positive, passionate manner EXPERIENCE AND QUALIFICATIONS Including, but not limited to, the following: PGA Class A Certification is required A Bachelor's Degree in Business Administration or Golf Management would be advantageous, but not required Working knowledge of Microsoft Office with specific emphasis on Word, Excel, and Outlook programs Prior knowledge and experience with Club Management Software with a focus on POS (Club Essentials), Tee Times (Fore Tee's), and Tournament Management (Golf Genius) programs. The Club is strongly interested in the best candidates, regardless of where they currently live, but those with ties to this geographic area, or the strong ability to grasp the overall \"culture and style\" of it, are critically important. The key attributes, as outlined above, include the proven ability to continue to elevate services, programming, and execution of a well-defined \"mission.\" The role of the SDOG at Broken Sounds should be attractive to those qualified candidates seeking a stable, long-term commitment in the community with outstanding schools and quality of life. For the right individual with passion, enthusiasm, and consistently enhanced skill sets, Broken Sound can be the \"pinnacle of one's career\" role! COMPENSATION AND BENEFITS A base salary commensurate with experience, plus participation in the company's bonus program. Additionally, the following benefits apply: Medical, dental, vision, disability, & life insurance Paid vacation accrual according to company policy Holiday pay Cell phone allowance Playing & Practicing Privileges APPLICATION INSTRUCTIONS All applications MUST be submitted through the PGA of America's Career Services Department as described below. Resume deadline is May 23, 2025 at 10:00 am Eastern Time Combine your cover letter, resume, references, and any supporting documents into one (1) PDF document with the following file naming convention: Last Name, First Name, Broken Sound Club, Senior Director of Golf Operations Please address all correspondence to - Mr. Ken Kosak | General Manager/COO | Broken Sound Club Click Here to Submit Your Application Ted Logan and Geoff Lofstead are leading this search. Please contact them with any questions. tlogan@pgahq.com glofstead@pgahq.com The employer does not wish to be contacted at this time Learn more about ExecuSearch To serve as the most trusted professional resource for employers seeking experts to lead an organization in the golf and hospitality industry, and support their future success by serving as lifelong partners. Report abuse Page details Page updated Report abuse"
    },
    {
      "url": "https://www.bluegolf.com/amateur/programs/bgtmabsc/about.html",
      "text": "About the Broken Sound Club Broken Sound Club Broken Sound Club About amateur Share ⨯ Messenger Messenger Gmail Twitter Facebook Email Click to copy link About 36 Hole Private Facility with 18 Hole Club Course including all homes, tennis, spa, gym & main clubhouse with the additional private club inside the club called The Old Course. Description THE OLD COURSE AT BROKEN SOUND CLUB Home to the PGA Tour Champions Season Opener for 15 consecutive years (2007-2021), The Old Course is a secluded 18-hole course designed by industry leaders, Joe Lee (1978) Gene Bates (2004), and Rees Jones (2022). Hidden in the heart of Boca Raton, this golfer's sanctuary offers the camaraderie and ambiance you would expect in a traditional golf club in an unexpected private place. Reminiscent of courses in the Pinehurst, North Carolina area, you play the renowned course through a landscape of woods, stone bridges, wildlife, lakes, and lagoons. The Northern course style, with its varied elevation and eighty-five bunkers fulfill the needs of even the most diehard golfer. Although it has very small undulations compared to most clubs, the greens have been voted the best greens on the champions Tour by officials and players for the past fifteen years. Basic Info Location 2401 Willow Springs Drive, Boca Raton FL  33496 2401 Willow Springs Drive Boca Raton FL  33496 Contact Info Contact Jeff Waber, PGA - Director of Golf, The Old Course Phone (561) 994-8505 Email Jwaber@brokensoundclub.org Social Products BlueGolf 360 Tours & Associations Overview Registration Tournament Management Marketing CRM BlueGolf TM Clubs Overview Features BlueGolf.com Golfers Home My BlueGolf Apps Tournaments Junior Amateur Professional Courses Featured PGA Tour Top 100 Top Architects Search Resources Newsroom Contact Terms of Use Privacy Accessibility Copyright © 2025 BlueGolf, LLC. All Rights Reserved. Save in your lists Favorites New list Create New List List Name Cancel OK Sign In Enter your email or mobile number Enter your email or mobile number Enter the 4-digit code sent to you at . Sign in with password Welcome back, sign in to continue I forgot my password I don't have an account Continue with Facebook Continue with Google What is your mobile number? For quicker sign in (optional) What is your email address? What’s your name? Create your account password"
    },
    {
      "url": "https://www.clubspot.app/contact-support",
      "text": "ClubSpot Club Management - Contact Us top of page Home Solutions Custom Club App Membership Management Online Club Lotto Data Security Club Communications Group Messaging Club Events Ticketing Customer Stories Contact Contact - Support Contact - Sales Blog Pricing Meet The Team How To Setup Guide Admin Tutorials User Tutorials More... Use tab to navigate through the menu items. Get a Demo Login Need support? Get in touch! For the quickest response time for general customer support or ticketing queries, contact us via our  live chat button at the bottom right of the screen. You can also reach us using the support email and contact number below where a member of our team will get in touch with you as soon as possible. Live Chat via orange button in right corner below Quickest Response ​ ​ Email: support@clubspo t.app Mob: 087 032 2866 ​ CAVAN DIGITAL HUB, KILMORE BUSINESS PARK, DUBLIN RD. CAVAN Enjoying your experience with ClubSpot? We'd love to hear from you! Click here to leave us a review! Company Home About Us Contact Us Careers FAQs Privacy Policy GDPR Club Referrals Terms of Service Contact Email: info@clubspot.app Mob: 087 032 2866 Stradone, Cavan, H12 Y066 © ClubSpot 2022 All Rights Reserved bottom of page"
    },
    {
      "url": "https://sound.london/contact-us",
      "text": "Contact Us - Get in Touch | SOUND Skip to content Book A Table Menu Music Sports Christmas New Years Eve Book A Table Facebook Instagram TikTok CONTACT US SOUND Cafe Monday - Thursday: 11.00 am to 11.00 pm Friday & Saturday: 11.00 am to 11.30 pm Sunday: 11.00 am to 10.30 pm SOUND SPORTS BAR Monday - Thursday: 5.00 pm to 11.00 pm Friday: 5.00 pm to 11.30 pm Saturday: 11 am to 11.30 pm Sunday:11.00 am to 10.30 pm SOUND Bar Sunday - Wednesday: 11.00 am to 0.00 am Thursday, Friday & Saturday: 11.00 am to 2.00 am Opening Hours Get  in Touch Looking for more information? A host team is here to help, use the form below to send us a message. First Name * Email * Last Name Phone Number * Message * I'd like to receive news, offers and updates from SOUND Phone: 020 7479 5078 Come and Find us at: The Cumberland Hotel, Great Cumberland Place, Marble Arch, London, W1H 7DL Speak to Our Team General Enquiries Hello@sound.london Media Enquiries Marketing@sound.london Group Enquiries Letsparty@sound.london Artist Enquiries Play@sound.london First Name * Last Name * Email * I'd like to receive news, offers and updates from SOUND Stay in the Loop Sign up for the latest updates, exclusive offers, and events. Don’t miss out on all the exciting happenings at SOUND. Facebook Instagram TikTok Contact us Book a Table Group Booking The Cumberland Careers Partners Terms and Conditions Privacy Policy Cookie Policy 0207479 5078 The Cumberland Hotel,\nGreat Cumberland Place, Marble Arch, London, W1H 7DL © 2025 SOUND"
    }
  ]
}