{
  "fuentes": [
    {
      "url": "https://www.brooksvillecc.com/events/weddings-banquets/",
      "email": "chauca@brooksvillecc.com"
    },
    {
      "url": "https://www.golfnow.com/tee-times/facility/4119-brooksville-country-club/search",
      "email": "nbc-golf-white@2x.png"
    },
    {
      "url": "https://brooksvillecc.com/summer-camp/",
      "email": "tshea@brooksvillecc.com"
    },
    {
      "url": "https://www.lipplyrealestate.com/brooksville/sherman-hills/",
      "email": "name@website.com"
    },
    {
      "url": "https://www.1golf.eu/en/club/brooksville-country-club-at-majestic-oaks/",
      "email": "bccadministration@brooksvillecc.com"
    },
    {
      "url": "https://www.1golf.eu/en/club/brooksville-country-club-at-majestic-oaks/",
      "email": "golf-club-detail@2x.png"
    },
    {
      "url": "https://www.1golf.eu/en/club/brooksville-country-club-at-majestic-oaks/",
      "email": "travel@albrecht.de"
    },
    {
      "url": "https://brooksvillecc.com/contact-us/",
      "email": "majesticoaks@brooksvillecc.com"
    },
    {
      "url": "https://brooksvillecc.com/contact-us/",
      "email": "managerdwisner@brooksvillecc.com"
    },
    {
      "url": "https://brooksvillecc.com/contact-us/",
      "email": "agodwin@brooksvillecc.com"
    },
    {
      "url": "https://brooksvillecc.com/contact-us/",
      "email": "awilson@brooksvillecc.com"
    },
    {
      "url": "https://brooksvillecc.com/contact-us/",
      "email": "dwisner@brooksvillecc.com"
    },
    {
      "url": "https://brooksvillecc.com/contact-us/",
      "email": "gtuzzi@brooksvillecc.com"
    },
    {
      "url": "https://brooksvillecc.com/contact-us/",
      "email": "kellyl@brooksvillecc.com"
    },
    {
      "url": "https://brooksvillecc.com/contact-us/",
      "email": "majesticoaks@brooksvillecc.com"
    },
    {
      "url": "https://brooksvillecc.com/contact-us/",
      "email": "nancy@brooksvillecc.com"
    },
    {
      "url": "https://brooksvillecc.com/contact-us/",
      "email": "pickleball@brooksvillecc.com"
    }
  ],
  "mails": [
    "agodwin@brooksvillecc.com",
    "awilson@brooksvillecc.com",
    "bccadministration@brooksvillecc.com",
    "chauca@brooksvillecc.com",
    "dwisner@brooksvillecc.com",
    "golf-club-detail@2x.png",
    "gtuzzi@brooksvillecc.com",
    "kellyl@brooksvillecc.com",
    "majesticoaks@brooksvillecc.com",
    "managerdwisner@brooksvillecc.com",
    "name@website.com",
    "nancy@brooksvillecc.com",
    "nbc-golf-white@2x.png",
    "pickleball@brooksvillecc.com",
    "travel@albrecht.de",
    "tshea@brooksvillecc.com"
  ],
  "nombre_sitio": "brooksvillecc.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.brooksvillecc.com/events/weddings-banquets/",
      "text": "Weddings And Banquets - Brooksville Country Club Skip to content About About The Club Accolades Gallery Our Team Play Golf The Course Tee Times Scorecard Course Rates Golf Lessons Youth on Course Golf Tournaments Membership Membership Plans Membership Application Member Login Facilities Majestic Oaks Restaurant Menu Fitness Facility Pickleball Court Special Events Weddings and Banquets Golf Tournaments Pickleball Events Pickleball Coaching Bar & Restaurant Summer Camp 2025 Contact Us About About The Club Accolades Gallery Our Team Play Golf The Course Tee Times Scorecard Course Rates Golf Lessons Youth on Course Golf Tournaments Membership Membership Plans Membership Application Member Login Facilities Majestic Oaks Restaurant Menu Fitness Facility Pickleball Court Special Events Weddings and Banquets Golf Tournaments Pickleball Events Pickleball Coaching Bar & Restaurant Summer Camp 2025 Contact Us Book a Tee Time Weddings and Banquets Get in Touch WEDDINGS & BANQUETS The selection of the perfect venue for your wedding and/or wedding reception is an important decision. Let Brooksville Country Club become the special place where you begin your lives together. Majestic ancient oak trees draped with Spanish moss grace our beautiful 18-hole golf course – a distinctive and lovely backdrop for your wedding day. Our clubhouse dining rooms feature beautiful views of our golf course. Our elegant facilities are perfect for your traditional, modern, or unconventional wedding. From formal dining to casual buffets, We pride ourself on excellent food and a quality presentation. We have a professional event planner on staff to assist with your special event. You may contact Conrad Hauca at 352-796-8236 or Email him at chauca@brooksvillecc.com\n\nYour event deserves a special venue, and Brooksville Country Club is that special place. Nestled among the majestic oaks, our clubhouse dining rooms feature beautiful views of our golf course. Wedding Receptions Anniversary Celebrations Birthday Parties Family Reunions Corporate Events or Any Other Special Occasion. image gallery Host Your Banquet REQUEST MORE INFORMATION Event Booking Full Name (Required) Event Name or Company (Required) Address Street Address City State / Province / Region ZIP / Postal Code Country Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cabo Verde Cambodia Cameroon Canada Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Congo, Democratic Republic of the Cook Islands Costa Rica Croatia Cuba Curaçao Cyprus Czechia Côte d'Ivoire Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Eswatini Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Macedonia Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Romania Russian Federation Rwanda Réunion Saint Barthélemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Sweden Switzerland Syria Arab Republic Taiwan Tajikistan Tanzania, the United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkmenistan Turks and Caicos Islands Tuvalu Türkiye US Minor Outlying Islands Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Venezuela Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Åland Islands Country Phone Email Type of Event Number of Players Requested Date MM slash DD slash YYYY Alternate Date MM slash DD slash YYYY Message X/Twitter This field is for validation purposes and should be left unchanged. subscribe to our newsletter Subscribe to our Newsletter and be the first to receive exciting updates, event invitations, and insider insights. Join our community today for a front-row seat to all things BCC. Full Name Email Address subscribe Newsletter First Name (Required) Last Name (Required) Email Address (Required) Company This field is for validation purposes and should be left unchanged. Home Golf Course Tee Times Course Rates Memberships About Facilities Events Learn Golf Contact Us Home Golf Course Tee Times Course Rates Memberships About Facilities Events Learn Golf Contact Us tee times (352) 796-8879 Fitness Center (352) 251-8757 Bar & Restaurant (352) 819-4843 Office (352) 251-8762 Facebook-f Instagram Map-marker-alt Brooksville Country Club | 23446 Links Drive, Brooksville, Florida 34601 © 2025 Brooksville Country Club. All Rights Reserved."
    },
    {
      "url": "https://www.golfnow.com/tee-times/facility/4119-brooksville-country-club/search",
      "text": "Brooksville Country Club Tee Times - Brooksville FL Log In / Sign Up Hot Deals Courses Near Me Destinations Best Courses Rewards Join GolfPass Gift Cards Search Hot Deals Near Me Off Sort Distance Time Price Golfers Holes Facility Type Reset Filters Featured League Available Brooksville Country Club 23446 Links Drive , Brooksville , Florida , 34601 Holes 18 Par 72 Length 6812 yards Slope 128 Rating 71.5 The most visible amenity of Brooksville Country Club is the championship golf course. The addition of four rock quarry holes, designed by renowned architect Bobby Weed, has set Brooksville Country Club apart from the crowd. The contoured and rolling fairways, dramatic elevation changes, beautifully conditioned course and picturesque back drop creates a breathtaking course and a great challenge.\nThe par-72, 18-hole course features four tee boxes to challenge every level of golfer. It stretches for 6,812 yards from the farthest tees, and it has a slope rating of 128 and a course rating of 72.9 Read More... Directions Course Details Review Mobile Check-In Skip the line and check in for your tee time directly in the GolfNow app. Learn More Leagues Available Social golf leagues available at this course Join Now Powered by Spark Golf We partnered up with Spark Golf to bring you social, competitive 9-hole leagues at your favorite courses. Each round has a 2-person team & individual game with end of league champs. Compete in a laid-back atmosphere over 9-holes Play with friends and meet like-minded new ones. Join the League × Last Modified: 9/8/2025 8:24:01 PM +00:00 Policies Metal spikes allowed: No Credit cards accepted: Yes Singles allowed: No Fivesomes allowed: No Dress Code: No denim, collared shirt and bermuda shorts required Rentals/Services Carts: Yes Clubs: Yes Caddies available: No Practice/Instruction Driving range: Yes Pitching/chipping area: Yes Putting green: Yes Teaching pro: Yes Read More... View Full Map Directions More Hot Deals Searching next 3 days... × There are no Hot Deals available for the date selected. Fetching more results... Unable to Complete Search We're sorry, there was an error completing your search. Try changing locations, changing the date, expanding your distance, or updating your filters. How About a Mulligan? We’re sorry, there are currently no available tee times for your search. Try changing locations, changing the date, expanding your distance, or updating your filters. In the cabbage. There are no Daily Deal options on this date. Please check back again for another shot at Daily Deals. Check Next Day View All Nearby Tee Times Search Hot Deals Get your golf on Information About Us Careers Contact Us Help Gift Cards Rewards Premier Card Ad Choices Privacy Policy Cookie Preferences CA Notice Terms of Service - New Resources Destinations Best Tee Time Deals Weekend Tee Times Course Directory Private Club Directory GolfNow Reviews Mobile Apps Promotions Blog Simulators Private Clubs Featured Courses GolfNow Spotlights Club Champion Fittings Businesses Partner Support Golf Facilities GolfNow for Courses List My Facility on GolfNow Other Partnership Requests Partner Brands NBC Sports Golf Channel GolfPass GolfNow Compete TeeOff SportsEngine HQ SportsEngine Motion Don't miss out on great golf deals, special offers and more! Yes! Please send me offers and news from GolfNow and GolfPass by email about products and services offered by us and our Partners Stay Connected Yes! Please send me offers and news from GolfNow and GolfPass by email about products and services offered by us and our Partners Subscribe Our Mobile Apps © Copyright 2025 GolfNow. All rights reserved."
    },
    {
      "url": "https://brooksvillecc.com/summer-camp/",
      "text": "Overnight Day And Summer Camp At The Brooksville Country Club - American Collegiate Academy - Brooksville Country Club Skip to content About About The Club Accolades Gallery Our Team Play Golf The Course Tee Times Scorecard Course Rates Golf Lessons Youth on Course Golf Tournaments Membership Membership Plans Membership Application Member Login Facilities Majestic Oaks Restaurant Menu Fitness Facility Pickleball Court Special Events Weddings and Banquets Golf Tournaments Pickleball Events Pickleball Coaching Bar & Restaurant Summer Camp 2025 Contact Us About About The Club Accolades Gallery Our Team Play Golf The Course Tee Times Scorecard Course Rates Golf Lessons Youth on Course Golf Tournaments Membership Membership Plans Membership Application Member Login Facilities Majestic Oaks Restaurant Menu Fitness Facility Pickleball Court Special Events Weddings and Banquets Golf Tournaments Pickleball Events Pickleball Coaching Bar & Restaurant Summer Camp 2025 Contact Us Book a Tee Time Brooksville Country Club K-12 Camp in Brooksville, Florida Brooksville Country Club Youth Summer Camp Program Choose a camp that is right for you Sign Up Now American Collegiate Academy the owner of the Brooksville Country Club has been approved by the city of Brooksville to open a K-12 school for 1200 students with dorm rooms for 150 students focused on high-level academics and top level sports along side the Brooksville Country Club. (please note the Country Club will continue to operate alongside the school). In preparation of the school opening, Brooksville Country Club will offer a 5 and 9 day stem plus sports camps with day and overnight options in cooperation with the Chinsegut Hill Retreat. Contact Tom Shea with any additional questions. Phone: 813-728-4466 Email: tshea@brooksvillecc.com 5 Day Camp Schedule: June 17th - 21st Day 1 Day 2 Day 3 Day 4 Day 5 Day 1 ARRIVAL Arrive 1 pm. Tour the Brooksville Country Club facility, followed by a meeting with the staff. Conduct a swim test at Brooksville Country Club for summer campers; non-swimmers will wear life jackets and receive lessons with out life jackets during swim time, while swimmers can enjoy supervised swim time. 5:30 PM: Pick up for Day Campers 5:00 to 6:00 PM: Dinner at Brooksville Country Club for Overnight Campers. 6:30 PM: Check into cabins at Chinsegut Hill Retreat, a historic retreat managed by Brooksville City and built by the University of South Florida for Overnight Campers. Sign Up Now Day 2 Full Activity Day Breakfast at Chinsegut Hill Retreat for Overnight Campers. 8:30 AM: Drop off for Day Campers. 9:00 AM to 10:00 AM: Stem activity for Day Campers 9:40 AM: Drive ten minutes to Brooksville Country Club for Overnight Campers. 10:00 AM to 12:00 PM: Introduction to golf with golf pro Tom Shea for all Campers. 12:00 to 1:00 PM: Lunch at Brooksville Country Club for all Campers. 1:00 to 2:00 PM: Pickleball Lessons for all Campers 2:00 to 4:00 PM: Swimming at the Country Club for all Campers. 4:00 to 6:00 PM: Out to Nature with Florida A&M University for a STEM Class in Chinsegut Wildlife and Environmental Area for all Campers. 6:00 PM: Pick up for Day Campers 6:00 to 7:00 PM: Dinner at Brooksville Country Club for Overnight Campers. 7:00 PM: Drive ten minutes back to Chinsegut Hill Retreat for Overnight Campers. Sign Up Now Day 3 Sports and Activity Day Breakfast at Chinsegut Hill Retreat for Overnight Campers. 7:45 AM: Drive to Brooksville Country Club for Overnight Campers. 8:00 AM to 8:30 AM: Drop off for Day Campers. 8:00 to 10:00 AM: Pickleball lessons at Brooksville Country Club for all Campers. 10:00 AM to 12:00 PM: STEM with Tom Shea for all Campers. 1:00 to 2:00 PM: Lunch at Brooksville Country Club for all Campers. 1:00 to 5:00 PM: Crystal River tour to see incredible wildlife for all Campers. Stem class. 5:30 PM: Pick up at Brooksville Country Club for Day Campers. 6:00 to 7:00 PM: Barbecue at Chinsegut Hill Retreat for Overnight Campers and bonfire. Sign Up Now Day 4 Water and Mermaid Adventure Breakfast at lodging for Overnight Campers. 8:30 AM: Drop off for Day Campers. 9:00 AM to 5:00 PM: Visit Buccaneers Bay Water Park, the focal point of the Netflix documentary \"Merpeople.\" Enjoy the live mermaid show, water slides, and swimming at the crystal-clear Weeki Wachee River (lunch - bagged lunch) for all Campers. 5:30 PM: Pick up for Day Campers. Dinner at Brooksville Country Club for Overnight Campers. Sign Up Now Day 5 Sports and Activity Day Breakfast at Chinsegut Hill Retreat for Overnight Campers. 8:30 PM: Drop off for Day Campers. 9:00 to 11:00 AM: STEM program at Chinsegut Wildlife and Environmental Area with Florida Fish and Wildlife staff, where kids will learn to track animals and do archery for all Campers. 12:00 to 1:00 PM: Lunch at Brooksville Country Club for all Campers. 1:00 to 2:00 PM: Golf Lessons for all Campers. 2:00 to 4:00 PM: Swimming at Brooksville Country Club for all Campers. 4:00 to 6:00 PM: Pickleball lesson with pickleball pro for all Campers. 5:30 PM to 6:00 PM: Pick up for Day Campers. 6:00 to 7:00 PM: Dinner at Brooksville Country Club for Overnight Campers. 7:30 PM: Return to Chinsegut Hill Retreat for Overnight Campers. Sign Up Now 9 Day Camp Schedule: June 17th - 25th Day 1 Day 2 Day 3 Day 4 Day 5 Day 6 Day 7 Day 8 Day 9 Day 1 ARRIVAL Arrive 1 pm. Tour the Brooksville Country Club facility, followed by a meeting with the staff. Conduct a swim test at Brooksville Country Club for summer campers; non-swimmers will wear life jackets and receive lessons with out life jackets during swim time, while swimmers can enjoy supervised swim time. 5:30 PM: Pick up for Day Campers 5:00 to 6:00 PM: Dinner at Brooksville Country Club for Overnight Campers. 6:30 PM: Check into cabins at Chinsegut Hill Retreat, a historic retreat managed by Brooksville City and built by the University of South Florida for Overnight Campers. Sign Up Now Day 2 Full Activity Day Breakfast at Chinsegut Hill Retreat for Overnight Campers. 8:30 AM: Drop off for Day Campers. 9:00 AM to 10:00 AM: Stem activity for Day Campers 9:40 AM: Drive ten minutes to Brooksville Country Club for Overnight Campers. 10:00 AM to 12:00 PM: Introduction to golf with golf pro Tom Shea for all Campers. 12:00 to 1:00 PM: Lunch at Brooksville Country Club for all Campers. 1:00 to 2:00 PM: Pickleball Lessons for all Campers 2:00 to 4:00 PM: Swimming at the Country Club for all Campers. 4:00 to 6:00 PM: Out to Nature with Florida A&M University for a STEM Class in Chinsegut Wildlife and Environmental Area for all Campers. 6:00 PM: Pick up for Day Campers 6:00 to 7:00 PM: Dinner at Brooksville Country Club for Overnight Campers. 7:00 PM: Drive ten minutes back to Chinsegut Hill Retreat for Overnight Campers. Sign Up Now Day 3 Sports and Activity Day Breakfast at Chinsegut Hill Retreat for Overnight Campers. 7:45 AM: Drive to Brooksville Country Club for Overnight Campers. 8:00 AM to 8:30 AM: Drop off for Day Campers. 8:00 to 10:00 AM: Pickleball lessons at Brooksville Country Club for all Campers. 10:00 AM to 12:00 PM: STEM with Tom Shea for all Campers. 1:00 to 2:00 PM: Lunch at Brooksville Country Club for all Campers. 1:00 to 5:00 PM: Crystal River tour to see incredible wildlife for all Campers. Stem class. 5:30 PM: Pick up at Brooksville Country Club for Day Campers. 6:00 to 7:00 PM: Barbecue at Chinsegut Hill Retreat for Overnight Campers and bonfire. Sign Up Now Day 4 Water and Mermaid Adventure Breakfast at lodging for Overnight Campers. 8:30 AM: Drop off for Day Campers. 9:00 AM to 5:00 PM: Visit Buccaneers Bay Water Park, the focal point of the Netflix documentary \"Merpeople.\" Enjoy the live mermaid show, water slides, and swimming at the crystal-clear Weeki Wachee River (lunch - bagged lunch) for all Campers. 5:30 PM: Pick up for Day Campers. Dinner at Brooksville Country Club for Overnight Campers. Sign Up Now Day 5 Sports and Activity Day Breakfast at Chinsegut Hill Retreat for Overnight Campers. 8:30 PM: Drop off for Day Campers. 9:00 to 11:00 AM: STEM program at Chinsegut Wildlife and Environmental Area with Florida Fish and Wildlife staff, where kids will learn to track animals and do archery for all Campers. 12:00 to 1:00 PM: Lunch at Brooksville Country Club for all Campers. 1:00 to 2:00 PM: Golf Lessons for all Campers. 2:00 to 4:00 PM: Swimming at Brooksville Country Club for all Campers. 4:00 to 6:00 PM: Pickleball lesson with pickleball pro for all Campers. 5:30 PM to 6:00 PM: Pick up for Day Campers. 6:00 to 7:00 PM: Dinner at Brooksville Country Club for Overnight Campers. 7:30 PM: Return to Chinsegut Hill Retreat for Overnight Campers. Sign Up Now Day 6 Travel Day Breakfast at lodging for Overnight Campers. 8:30 AM: Drop off for Day Campers. 9:00 AM to 1:00 PM: Visit the University of South Florida, explore the campus, and attend a STEM class on nature conservation for all Campers. 1:00 to 2:00 PM: Lunch at McDonald's for all Campers. 2:00 to 5:00 PM: Tampa Bay Tour, visiting downtown and the University of South Florida for all Campers. 6:00 PM: Pick up for Day Campers. 6:00 to 7:00 PM: Dinner at Brooksville Country Club for Overnight Campers. 7:30 PM: Return to Chinsegut Hill Retreat for Overnight Campers. Sign Up Now Day 7 Activity Day at Brooksville Country Club Breakfast at Chinsegut Hilltop Retreat for Overnight Campers. 8:30 AM: Drop off for Day Campers. 9:00 AM to 10:00 AM: Pickleball for Day Campers. 10:00 AM to 12:00 PM: Golf lessons at Brooksville Country Club for all Campers. 12:00 to 1:00 PM: Lunch at Brooksville Country Club for all Campers. 1:00 to 2:00 PM: Pickleball for all Campers. 2:00 to 4:00 PM: Swimming at Brooksville Country Club for all Campers: 4:00 to 6:00 PM: STEM with Tom Shea for all Campers. 6:00 to 9:00: Pick up for Day School Campers. 6:00 to 9:00 PM: Barbecue, outdoor movie at the pool, and Swimming at Brooksville Country Club for all Campers. 8:30 PM: Return to Chinsegut Hilltop Retreat for Overnight Campers. Sign Up Now Day 8 Clearwater Beach and ACA School Breakfast at Chinsegut Hilltop Retreat for Overnight Campers. 8:30 AM: Drop off Day Campers. 9:00 AM to 5:00 PM: Visit American Collegiate Academy (ACA) school, Clearwater Beach, the boardwalk, and take a boat on the intercoastal and Gulf to see Dolphins in their natural habitat and other wildlife or visit the Clearwater Marine Aquarium (depending on availability) for all Campers. 6:00 PM: Pick Up Day Campers. 6:00 PM: Dinner at Brooksville Country Club for Overnight Campers. Sign Up Now Day 9 Awards and Goodbyes Breakfast at Chinsegut Hilltop Retreat for Overnight Campers. 8:30 to 10:00 AM: Golf tournament all Campers 10:00 AM to 2:00 PM: Swimming, barbecue, and games with staff. 2:00 to 4:00 PM: Pickleball tournament all Campers. 4:00 to 5:00 PM: Certificate and awards ceremony for golf, pickleball, STEM,  at Brooksville Country Club. 5:30 PM: All Campers pick up. Sign Up Now Travel and Adventure in World-Famous Florida (international) 13 Day Camp (INTERNATIONAL): June 17th - 29th Day 1 Day 2 Day 3 Day 4 Day 5 Day 6 Day 7 Day 8 Day 9 Day 10 Day 11 Day 12 Day 13 Day 1 ARRIVAL Pick up at Orlando Airport, then drive to Brooksville Country Club, a renowned golf and country club in central Florida. Enjoy lunch either on the road or at Brooksville Country Club. Tour the Brooksville Country Club facility, followed by a meeting with the staff. Conduct a swim test at Brooksville Country Club for summer campers; non-swimmers will wear life jackets and receive lessons with out life jackets during swim time, while swimmers can enjoy supervised swim time. 5:00 to 6:00 PM: Dinner at Brooksville Country Club. 6:30 PM: Check into cabins at Chinsegut Hill Retreat, a historic retreat managed by Brooksville City and built by the University of South Florida. Sign Up Now Day 2 Full Activity Day Breakfast at Chinsegut Hill Retreat. 9:40 AM: Drive ten minutes to Brooksville Country Club. 10:00 AM to 12:00 PM: Introduction to golf with golf pro Tom Shea. 12:00 to 1:00 PM: Lunch at Brooksville Country Club. 1:00 to 2:00 PM: English Lesson at the Country Club. 2:00 to 4:00 PM: Swimming at the Country Club. 4:00 to 6:00 PM: Out to Nature with Florida A&M University for a STEM Class in Chinsegut Wildlife and Environmental Area. 6:00 to 7:00 PM: Dinner at Brooksville Country Club. 7:00 PM: Drive ten minutes back to Chinsegut Hill Retreat. Sign Up Now Day 3 Sports and Activity Day Breakfast at Chinsegut Hill Retreat. 7:45 AM: Drive to Brooksville Country Club. 8:00 to 10:00 AM: Pickleball lessons at Brooksville Country Club. 10:00 AM to 12:00 PM: STEM with Tom Shea. 1:00 to 2:00 PM: Lunch at Brooksville Country Club. 1:00 to 5:00 PM: Crystal River tour to see incredible wildlife. Stem class. 6:00 to 7:00 PM: Barbecue at Chinsegut Hill Retreat and bonfire. Sign Up Now Day 4 Water and Mermaid Adventure Breakfast at lodging. 9:00 AM to 5:00 PM: Visit Buccaneers Bay Water Park, the focal point of the Netflix documentary \"Merpeople.\" Enjoy the live mermaid show, water slides, and swimming at the crystal-clear Weeki Wachee River (lunch - bagged lunch). Dinner at Brooksville Country Club. Sign Up Now Day 5 Sports and Activity Day Breakfast at Chinsegut Hill Retreat. 9:00 to 11:00 AM: STEM program at Chinsegut Wildlife and Environmental Area with Florida Fish and Wildlife staff, where kids will learn to track animals and do archery. 12:00 to 1:00 PM: Lunch at Brooksville Country Club. 1:00 to 2:00 PM: English Lesson in the classroom at Brooksville Country Club. 2:00 to 4:00 PM: Swimming at Brooksville Country Club. 4:00 to 6:00 PM: Pickleball lesson with pickleball pro Igor. 6:00 to 7:00 PM: Dinner at Brooksville Country Club. 7:30 PM: Return to Chinsegut Hill Retreat. Sign Up Now Day 6 Travel Day Breakfast at lodging. 9:00 AM to 1:00 PM: Visit the University of South Florida, explore the campus, and attend a STEM class on nature conservation. 1:00 to 2:00 PM: Lunch at McDonald's. 2:00 to 5:00 PM: Tampa Bay Tour, visiting downtown and the University of South Florida. 6:00 to 7:00 PM: Dinner at Brooksville Country Club. 7:30 PM: Return to Chinsegut Hill Retreat. Sign Up Now Day 7 Activity Day at Brooksville Country Club Breakfast at Chinsegut Hilltop Retreat. 10:00 AM to 12:00 PM: Golf lessons at Brooksville Country Club. 12:00 to 1:00 PM: Lunch at Brooksville Country Club. 1:00 to 2:00 PM: English Lesson. 2:00 to 4:00 PM: Swimming at Brooksville Country Club. 4:00 to 6:00 PM: STEM with Tom Shea. 6:00 to 9:00 PM: Barbecue, outdoor movie at the pool, and Swimming at Brooksville Country Club. 8:30 PM: Return to Chinsegut Hilltop Retreat. Sign Up Now Day 8 Clearwater Beach and ACA School Breakfast at Chinsegut Hilltop Retreat. 9:00 AM to 5:00 PM: Visit American Collegiate Academy (ACA) school, Clearwater Beach, the boardwalk, and take a boat on the intercoastal and Gulf to see Dolphins in their natural habitat and other wildlife or visit the Clearwater Aquarium (depending on availability). 6:00 PM: Dinner at Brooksville Country Club. Sign Up Now Day 9 Awards and Goodbyes Breakfast at Chinsegut Hilltop Retreat. 8:00 to 10:00 AM: Visit the Florida Mermaid Trail, a unique walking tour showcasing the cultural history and natural beauty of downtown Brooksville. 10:00 AM to 2:00 PM: Swimming, barbecue, and games with staff. 2:00 to 4:00 PM: Wrap up English and STEM sessions. 4:00 to 5:00 PM: Certificate and awards ceremony for golf, pickleball, STEM, and English at Brooksville Country Club. 5:00 to 6:30 PM: Goodbye dinner at Brooksville Country Club. Sign Up Now Day 10 TRAVEL Breakfast at lodging. 8:00 AM to 2:00 PM: Tour Gainesville and the University of Florida, visit the campus, and attend a STEM class. Lunch in Gainesville. 2:00 to 4:00 PM: Travel to Orlando. 4:00 to 8:00 PM: Outlet shopping in Orlando Premium Outlets. Dinner at the outlet. Sign Up Now Day 11 Disney Epcot Center Breakfast at lodging. 9:00 AM to 6:00 PM: Disney Epcot Center. 6:00 to 7:00 PM: Dinner. Sign Up Now Day 12 Apopka Wildlife Park 7:00 AM to 12:00 PM: Visit Lake Apopka Wildlife Drive to see alligators and other wildlife in their natural habitat. Lunch on the road. 1:00 to 5:00 PM: Disney Springs. Sign Up Now Day 13 Flight and Travel 5:30 PM: All Campers pick up. Sign Up Now Camp Signup Form Summer Camp Signup Camper's Information Campers Full Name (Required) Date of Birth (Required) MM slash DD slash YYYY Gender (Required) Male Female Friends at Camp Camper's Guardian(s) Mother's Full Name (Required) Father's Full Name (Required) Mother's Phone Number Father's Phone Number Home Address Street Address Address Line 2 City State / Province / Region ZIP / Postal Code Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cabo Verde Cambodia Cameroon Canada Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Congo, Democratic Republic of the Cook Islands Costa Rica Croatia Cuba Curaçao Cyprus Czechia Côte d'Ivoire Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Eswatini Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Macedonia Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Romania Russian Federation Rwanda Réunion Saint Barthélemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Sweden Switzerland Syria Arab Republic Taiwan Tajikistan Tanzania, the United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkmenistan Turks and Caicos Islands Tuvalu Türkiye US Minor Outlying Islands Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Venezuela Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Åland Islands Country Email Address Email Address (other) Type of Camp (Required) 1/2 Day Golf Camp Full Day Golf Camp Friday Camp BCC 9 Day/Night Camp BCC 9 Days Only Camp BCC 5 Day/Night Camp BCC 5 Days Only Camp ACA Camp Collegiate 1 week (Clearwater) ACA Camp Collegiate + Transportation 1 week (Clearwater) ACA Camp Collegiate 2 weeks (Clearwater) ACA Camp Collegiate + Transportation 2 weeks (Clearwater) ACA Camp Collegiate 3 weeks (Clearwater) ACA Camp Collegiate + Transportation 3 weeks (Clearwater) ACA Camp Collegiate 4 weeks (Clearwater) ACA Camp Collegiate + Transportation 4 weeks (Clearwater) Total Brooksville Country Club K-12 Camp in Brooksville, Florida OVERNIGHT and DAYtime SUMMER CAMP for k-12 BCC invites kids to an exciting summer camp with both daytime and overnight options. Explore a world of adventure with golf and pickleball lessons, and a STEM class held in the scenic Chinsegut Wildlife and Environmental Area. Adventure awaits with exciting field trips to Crystal River, Buccaneer Bay, and the famous Weeki Wachee Springs. Join us for a summer filled with fun, learning, and unforgettable memories! Exciting Outdoor Activities Engaging Workshops Certified Instructors Sign Up Now subscribe to our newsletter Subscribe to our Newsletter and be the first to receive exciting updates, event invitations, and insider insights. Join our community today for a front-row seat to all things BCC. Full Name Email Address subscribe Newsletter First Name (Required) Last Name (Required) Email Address (Required) X/Twitter This field is for validation purposes and should be left unchanged. Home Golf Course Tee Times Course Rates Memberships About Facilities Events Learn Golf Contact Us Home Golf Course Tee Times Course Rates Memberships About Facilities Events Learn Golf Contact Us tee times (352) 796-8879 Fitness Center (352) 251-8757 Bar & Restaurant (352) 819-4843 Office (352) 251-8762 Facebook-f Instagram Map-marker-alt Brooksville Country Club | 23446 Links Drive, Brooksville, Florida 34601 © 2025 Brooksville Country Club. All Rights Reserved."
    },
    {
      "url": "https://www.lipplyrealestate.com/brooksville/sherman-hills/",
      "text": "Sherman Hills - Brooksville Homes for Sale MENU Search Advanced Search Search by Map Search by Zip Code Property Tracker Brokerage Listings Communities Pinellas County Real Estate Pasco County Real Estate Hillsbourgh County Real Estate Hernando County Real Estate Buyers Buyers Mortgage Calculator Mortgage Pre-Approval First Time Buyers Making an Offer What Are Closing Costs? Escrow: Now What? Financial Terms Glossary Personalized Home Search Sellers Sellers Pricing Your Home Matterport Marketing Your Home Showing and Staging Your Home Adding Value Free Market Analysis About About Agent Testimonials Careers Contact More Login / Register Blog (727) 314-1000 ENGLISH 中文 FRANÇAIS 한국어 ITALIANO 日本語 DEUTSCH PORTUGUÊS РУССКИЙ ESPAÑOL TIẾNG VIỆT Home Brooksville Sherman Hills Sherman Hills Homes for Sale - Brooksville, Florida ACTIVE AND PENDING LISTINGS IN SHERMAN HILLS September 10, 2025 9 Listed 92 Avg. DOM $177.00 Avg. $ / Sq.Ft. $289,900 Med. List Price Gallery Photo View List Map Map View Get Alerts! Refine Results Price (Highest) Price (Lowest) Days on Site (Newest) Days on Site (Oldest) Bedrooms (Most) 9 Properties Pending $269,900 Neighborhood: Sherman Hills Ph V 7099 Crested Orchid Dr Brooksville,  FL 34602 3 Beds 2 Baths 1,546 Sq.Ft. 2020 Year Built 120 Days on Site TB8382224 MLS MLS #: TB8382224 $270,000 Neighborhood: Sherman Hills Ph V 6910 Redbay Dr Brooksville,  FL 34602 3 Beds 2 Baths 1,546 Sq.Ft. 2020 Year Built 50 Days on Site W7877556 MLS MLS #: W7877556 $285,000 Neighborhood: Sherman Hills Sec 3 6698 Wirevine Dr Brooksville,  FL 34602 3 Beds 2 Baths 1,546 Sq.Ft. 2017 Year Built 170 Days on Site G5094707 MLS MLS #: G5094707 Pending $285,000 Neighborhood: Sherman Hills Sec 3 30475 Satinleaf RUN Brooksville,  FL 34602 3 Beds 2 Baths 1,629 Sq.Ft. 2017 Year Built 169 Days on Site TB8366277 MLS MLS #: TB8366277 $289,900 Neighborhood: Sherman Hills Sec 1 7260 Sherman Hills Blvd Brooksville,  FL 34602 3 Beds 2 Baths 1,587 Sq.Ft. 2005 Year Built 16 Days on Site W7878437 MLS MLS #: W7878437 $299,000 Neighborhood: Sherman Hills Sec 2 7059 Wirevine Dr Brooksville,  FL 34602 4 Beds 2 Baths 1,860 Sq.Ft. 2007 Year Built 79 Days on Site W7876412 MLS MLS #: W7876412 $305,000 Neighborhood: Sherman Hills Ph V 6949 Crested Orchid Dr Brooksville,  FL 34602 4 Beds 2 F 1 1/2 Baths 1,825 Sq.Ft. 2019 Year Built 194 Days on Site T3515032 MLS MLS #: T3515032 $315,000 Neighborhood: Sherman Hills Ph V 7149 Crested Orchid Dr Brooksville,  FL 34602 4 Beds 3 Baths 1,825 Sq.Ft. 2020 Year Built 7 Days on Site TB8422571 MLS MLS #: TB8422571 $327,958 Neighborhood: Sherman Hills Sec 3 31018 Satinleaf RUN Brooksville,  FL 34602 3 Beds 2 Baths 1,629 Sq.Ft. 2016 Year Built 34 Days on Site TB8415499 MLS MLS #: TB8415499 Sherman Hills Real Estate - Brooksville, FL Sherman Hills is a beautiful single family home community in Brooksville, FL . This is a golf course community , and also includes a country club, community pool and a pro shop for all your golfing needs. Homes in this development range in square footage from around 1,418 square feet to over 3,283 square feet with 1 and 2 car garages. Located in Hernando County , you are just a few miles away from Ridge Manor Community Park, Withlacoochee State Trail and I-75. These adorable homes are perfect for families who enjoy nature walks, biking, golfing, or fishing. Sherman Hills would be a wonderful place to call home. If you wold like more information about Sherman Hills, enter your information in the contact form below to get in touch with one of our highly skilled agents. Send inquiry on this Community First Name: * Last Name: * Email Address: * Phone: * Questions / Comments: * Submit By proceeding, you expressly consent to receive texts at the number you provided, including marketing, from Lipply Real Estate about real estate related matters, but not as a condition of purchase. Message frequency varies. You can text Help for help and Stop to cancel. You also agree to our Terms of Service and to our Privacy Policy regarding the information relating to you. Message and data rates may apply. Additionally, you expressly consent to receiving calls at the number you provided, including marketing by auto-dialer, pre-recorded or artificial voice, and email, from  Lipply Real Estate about real estate related matters, but not as a condition of purchase. This consent applies even if you are on a corporate, state or national Do Not Call list. Messages may be processed by an automated system. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. RECENTLY SOLD PROPERTY (IF ANY) FOR THIS COMMUNITY Recently Sold Listings in Sherman Hills September 10, 2025 9 Listed 118 Avg. DOM $183.82 Avg. $ / Sq.Ft. $289,000 Med. List Price Gallery Photo View List Map Map View Get Alerts! Refine Results Price (Highest) Price (Lowest) Days on Site (Newest) Days on Site (Oldest) Bedrooms (Most) 9 Properties Sold $260,000 Neighborhood: Sherman Hills Sec 3 6731 Wirevine Dr Brooksville,  FL 34602 3 Beds 2 Baths 1,629 Sq.Ft. 2017 Year Built 6/30/25 Sold On TB8320749 MLS MLS #: TB8320749 Sold $262,000 Neighborhood: Sherman Hills Sec 1 31330 Spoonflower WAY Brooksville,  FL 34602 2 Beds 2 Baths 1,278 Sq.Ft. 2003 Year Built 5/17/25 Sold On TB8324889 MLS MLS #: TB8324889 Sold $280,000 Neighborhood: Sherman Hills Sec 3 30861 Water Lily Dr Brooksville,  FL 34602 3 Beds 2 Baths 1,546 Sq.Ft. 2016 Year Built 4/29/25 Sold On W7873879 MLS MLS #: W7873879 Sold $280,000 Neighborhood: Sherman Hills Sec 2 7061 Lamium Ct Brooksville,  FL 34602 3 Beds 2 Baths 1,306 Sq.Ft. 2016 Year Built 7/28/25 Sold On TB8380181 MLS MLS #: TB8380181 Sold $289,000 Neighborhood: Sherman Hills Ph V 6555 Redbay Dr Brooksville,  FL 34602 3 Beds 2 Baths 1,504 Sq.Ft. 2019 Year Built 6/2/25 Sold On W7872984 MLS MLS #: W7872984 Sold $289,500 Neighborhood: Sherman Hills Sec 3 30886 Satinleaf RUN Brooksville,  FL 34602 3 Beds 2 Baths 1,546 Sq.Ft. 2015 Year Built 5/6/25 Sold On W7873286 MLS MLS #: W7873286 Sold $300,000 Neighborhood: Sherman Hills Sec 2 7105 Wirevine Dr Brooksville,  FL 34602 3 Beds 2 Baths 1,958 Sq.Ft. 2019 Year Built 3/28/25 Sold On W7872820 MLS MLS #: W7872820 Sold $305,000 Neighborhood: Sherman Hills Sec 1 7292 Sherman Hills Blvd Brooksville,  FL 34602 4 Beds 2 Baths 1,915 Sq.Ft. 2005 Year Built 8/29/25 Sold On W7872672 MLS MLS #: W7872672 Sold $355,000 Neighborhood: Sherman Hills Sec 2 6887 Wirevine Dr Brooksville,  FL 34602 4 Beds 2 Baths 1,754 Sq.Ft. 2011 Year Built 6/3/25 Sold On TB8322313 MLS MLS #: TB8322313 Contact Lipply Real Estate 3302 Alt 19 Palm Harbor, FL 34683 O: (727) 314-1000 F: (727) 216-6549 E: Email Us Connect Facebook Instagram YouTube Pinterest Navigation Search Communities Buyers Sellers About Contact Popular Searches Featured Listings Newest Listings Single Family Condos & Townhomes Luxury Homes Accessibility | Terms of Service | Privacy Policy | DMCA Notice | Property Listings | Sitemap © Copyright 2025 Lipply Real Estate. All Rights Reserved. Real Estate Websites by Sierra Interactive We're Here to Help Feel free to reach out any time: Lipply Real Estate 3302 Alt 19 Palm Harbor, FL 34683 O: (727) 314-1000 F: (727) 216-6549 E: Email Us Connect Facebook Instagram YouTube Pinterest Have a Question or Want a Free Market Report? Contact Us Home Blog Search Advanced Search Search by Map Search by Zip Code Property Tracker Brokerage Listings Communities Pinellas County Real Estate Pasco County Real Estate Hillsbourgh County Real Estate Hernando County Real Estate Buyers Buyers Mortgage Calculator Mortgage Pre-Approval First Time Buyers Making an Offer What Are Closing Costs? Escrow: Now What? Financial Terms Glossary Personalized Home Search Sellers Sellers Pricing Your Home Matterport Marketing Your Home Showing and Staging Your Home Adding Value Free Market Analysis About About Agent Testimonials Careers Contact Questions? We're Here to Help Recently From Our Blog Buying a Home with Student Debt By Marianne Knowles 4/22/2024 How to Fix A Condensate Drain Line By Adi Rakanovic 2/22/2024 We're Here to Help Feel free to reach out any time: Lipply Real Estate 3302 Alt 19 Palm Harbor, FL 34683 O: (727) 314-1000 F: (727) 216-6549 E: Email Us Connect Facebook Instagram YouTube Pinterest Have a Question or Want a Free Market Report? Contact Us"
    },
    {
      "url": "https://www.1golf.eu/en/club/brooksville-country-club-at-majestic-oaks/",
      "text": "Brooksville Country Club, Brooksville, FL - Albrecht Golf Guide Golf Courses Golf Hotels Golf Packages Bookshop Apps Sign in / Sign up Saved Items Deutsch English Español Italiano Albrecht Golf Guide Golf courses in North America United States Florida Brooksville Country Club 18 Hole Public Overview Course Visitors Prices Amenities Club Reviews No image available Brooksville Country Club 23446 Links Drive, Brooksville, FL 34601, USA Phone: +1 352-796-8879 bccadministration@brooksvillecc.com brooksvillecc.com Map Save Share The Course 18-Hole Course Driving Range  &  Practice area Visitors welcome? Yes - every day. Season: Year round Green fees $45 - 55 (38-47 €) / 18 Holes The Course 18-Hole Course Opened in 1971. Design: Bobby Weed & William F. Mitchell . Style: Parkland. Technical difficulty: Moderate Scorecard Tee Par CR Slope Length Black (Men) 72 72.9 128 6812 yards Blue (Men) 72 73.8 123 6357 yards White (Men) 72 69 122 6000 yards Gold (Men) 72 67.9 118 5572 yards Red (Women) 72 70.6 118 5300 yards Practice Facilities Driving Range Putting Green Chipping Green Visitors 18-Hole Course Visitors are welcome every day. Etiquette Softspikes required. Green Fees 18-Hole Course Green Fee Mon - Fri Sat, Sun, Holidays 18 Holes $45 (38 €) $55 (47 €) Amenities Club Amenities Clubhouse Outdoor pool Club accepts credit cards Pro Shop Restaurant Bar Snack Bar Beverage Cart Rentals Clubs for hire The Club Personnel Title Name Manager David Alberson Enlarge / get directions Nearby Courses Southern Hills Plantation Club Brooksville (8.6 km) 5.0 of 5 stars (1) 18 Hole Hernando Oaks GC Brooksville (11 km) 18 Hole 42-50 € / 18 Holes Sherman Hills GC Brooksville (12 km) 18 Hole 15 € / 18 Holes See all User Reviews There are no user reviews yet. Been to Brooksville Country Club ? Share your experiences! Write a Review Golf Packages Tenerife, Spain Tivoli La Caleta Tenerife Resort 5 stars Very good 8,4 / 10 7 Nights 5 green fees from € 1475 per person Tenerife, Spain Hacienda del Conde Meliá Collection Golf & Spa 5 stars Wonderful 9,1 / 10 7 Nights HB unlimited golf from € 1231 per person La Gomera, Spain Hotel Jardín Tecina 4 stars Excellent 8,7 / 10 7 Nights HB 5 green fees from € 833 per person Majorca, Spain Elba Sunset Mallorca 4 stars Very good 8,2 / 10 7 Nights 5 green fees from € 855 per person Majorca, Spain VIVA Golf Adults Only 18+ 4 stars Superior Very good 8,4 / 10 7 Nights HB 5 green fees from € 1083 per person Sicily, Italy Verdura Resort 5 stars Excellent 8,8 / 10 7 Nights 4 green fees from € 1269 per person Porto Cervo, Italy Cervo Hotel, Costa Smeralda Resort 5 stars Excellent 8,8 / 10 7 Nights unlimited golf from € 1042 per person Cyprus Almyra 5 stars Very good 8,2 / 10 7 Nights 4 green fees from € 928 per person All Packages Get a €20 discount on your golf vacation with our newsletter Sign up for our newsletter and be the first to discover new golf packages, special offers, and exclusive golf tours. As a bonus, you will receive a €20 discount code for your next golf vacation. Yes, please send me the newsletter You can change your mind at any time by clicking the unsubscribe link in the footer of any newsletter you receive from us, or by contacting us at travel@albrecht.de . We will treat your information with respect. You can find details about our privacy practices here . By clicking above, you agree that we may process your information in accordance with these terms. Follow us on Instagram New Golf Guide Africa Asia Caribbean Central America Europe Middle East North America Pacific South America Golf Packages Book Golf Holiday Travel Themes Golf Round Trips Group Golf Tours Early Booking Deals Majorca Canary Islands Tuscany Algarve Andalusia Greece All Destinations Mobile App Golf Guide for iPhone Golf Guide for iPad Info Contact/Imprint Media Information Privacy Policy Terms Feedback © 2025 Albrecht Golf Verlag GmbH"
    },
    {
      "url": "https://brooksvillecc.com/contact-us/",
      "text": "Contact Us - Brooksville Country Club Skip to content About About The Club Accolades Gallery Our Team Play Golf The Course Tee Times Scorecard Course Rates Golf Lessons Youth on Course Golf Tournaments Membership Membership Plans Membership Application Member Login Facilities Majestic Oaks Restaurant Menu Fitness Facility Pickleball Court Special Events Weddings and Banquets Golf Tournaments Pickleball Events Pickleball Coaching Bar & Restaurant Summer Camp 2025 Contact Us About About The Club Accolades Gallery Our Team Play Golf The Course Tee Times Scorecard Course Rates Golf Lessons Youth on Course Golf Tournaments Membership Membership Plans Membership Application Member Login Facilities Majestic Oaks Restaurant Menu Fitness Facility Pickleball Court Special Events Weddings and Banquets Golf Tournaments Pickleball Events Pickleball Coaching Bar & Restaurant Summer Camp 2025 Contact Us Book a Tee Time Contact Us course rates book a tee time Brooksville Country Club 23446 Links Drive\nBrooksville, Florida 34601 Tee Times (352) 796-8879 Main Line / Directory (352) 796-8236 Office (352) 251-8762 Fitness Center (352) 251-8757 Bar & Restaurant (352) 819-4843 Contact Us Contact Form Name (Required) Email (Required) Phone Inquiry Type Golf Tournament Event / Banquet Membership Pickleball Fitness Center General Inquiry Other Comments URL This field is for validation purposes and should be left unchanged. Staff David Wisner CEO/General Manager dwisner@brooksvillecc.com (352) 251-8762 Kelly Lagedrost Head Golf Professional/Director of Golf kellyl@brooksvillecc.com (352) 251-8758 Allen Wilson Golf Course Superintendent awilson@brooksvillecc.com Restaurant & Bar / Events MajesticOaks@brooksvillecc.com (352) 819-4843 Adam Godwin Business Operations / Finance agodwin@brooksvillecc.com (352) 251-8762 Gina Tuzzi Membership gtuzzi@brooksvillecc.com Nancy Shen Accounting / Membership nancy@brooksvillecc.com (352) 251-8762 Jody Anderson Pickleball Marketing Director pickleball@brooksvillecc.com (352) 560-8520 Hours of Operation Pro Shop Hours Monday – Sunday 7am – 6pm Fitness Facility Monday – Saturday 8:00am – 6:00pm Sunday 12:00 pm – 6:00 pm Restaurant Sunday – Wednesday: (Lunch) 11:00 am – 5:00 pm Thursday, Friday & Saturday: (lunch + dinner) 10:00 am – 8:00 pm Friday: (lunch) 11:00 am – 3:00 pm subscribe to our newsletter Subscribe to our Newsletter and be the first to receive exciting updates, event invitations, and insider insights. Join our community today for a front-row seat to all things BCC. Full Name Email Address subscribe Newsletter First Name (Required) Last Name (Required) Email Address (Required) Name This field is for validation purposes and should be left unchanged. Home Golf Course Tee Times Course Rates Memberships About Facilities Events Learn Golf Contact Us Home Golf Course Tee Times Course Rates Memberships About Facilities Events Learn Golf Contact Us tee times (352) 796-8879 Fitness Center (352) 251-8757 Bar & Restaurant (352) 819-4843 Office (352) 251-8762 Facebook-f Instagram Map-marker-alt Brooksville Country Club | 23446 Links Drive, Brooksville, Florida 34601 © 2025 Brooksville Country Club. All Rights Reserved."
    }
  ]
}