{
  "fuentes": [
    {
      "url": "https://www.cfbroward.org/about-us/board-staff",
      "email": "abaker@cfbroward.org"
    },
    {
      "url": "https://www.cfbroward.org/about-us/board-staff",
      "email": "akah@cfbroward.org"
    },
    {
      "url": "https://www.cfbroward.org/about-us/board-staff",
      "email": "areid@cfbroward.org"
    },
    {
      "url": "https://www.cfbroward.org/about-us/board-staff",
      "email": "bburkhart@cfbroward.org"
    },
    {
      "url": "https://www.cfbroward.org/about-us/board-staff",
      "email": "cbrown@cfbroward.org"
    },
    {
      "url": "https://www.cfbroward.org/about-us/board-staff",
      "email": "cburrell@cfbroward.org"
    },
    {
      "url": "https://www.cfbroward.org/about-us/board-staff",
      "email": "cdorko@cfbroward.org"
    },
    {
      "url": "https://www.cfbroward.org/about-us/board-staff",
      "email": "cperez@cfbroward.org"
    },
    {
      "url": "https://www.cfbroward.org/about-us/board-staff",
      "email": "info@cfbroward.org"
    },
    {
      "url": "https://www.cfbroward.org/about-us/board-staff",
      "email": "jbryan@cfbroward.org"
    },
    {
      "url": "https://www.cfbroward.org/about-us/board-staff",
      "email": "jlewis@cfbroward.org"
    },
    {
      "url": "https://www.cfbroward.org/about-us/board-staff",
      "email": "joa@cfbroward.org"
    },
    {
      "url": "https://www.cfbroward.org/about-us/board-staff",
      "email": "jsaldivar@cfbroward.org"
    },
    {
      "url": "https://www.cfbroward.org/about-us/board-staff",
      "email": "jvones@cfbroward.org"
    },
    {
      "url": "https://www.cfbroward.org/about-us/board-staff",
      "email": "kenglehardt@cfbroward.org"
    },
    {
      "url": "https://www.cfbroward.org/about-us/board-staff",
      "email": "kmarmol@cfbroward.org"
    },
    {
      "url": "https://www.cfbroward.org/about-us/board-staff",
      "email": "ljacquett@cfbroward.org"
    },
    {
      "url": "https://www.cfbroward.org/about-us/board-staff",
      "email": "mmtoole@cfbroward.org"
    },
    {
      "url": "https://www.cfbroward.org/about-us/board-staff",
      "email": "nmitchell@cfbroward.org"
    },
    {
      "url": "https://www.cfbroward.org/about-us/board-staff",
      "email": "nthies@cfbroward.org"
    },
    {
      "url": "https://www.cfbroward.org/about-us/board-staff",
      "email": "rsobelson@cfbroward.org"
    },
    {
      "url": "https://www.cfbroward.org/about-us/board-staff",
      "email": "sbrown@cfbroward.org"
    },
    {
      "url": "https://www.cfbroward.org/about-us/board-staff",
      "email": "ylawson@cfbroward.org"
    },
    {
      "url": "https://calendar.broward.edu/2024/11/fall_dance-concert.html",
      "email": "vpadept@broward.edu"
    },
    {
      "url": "https://www.broward.edu/about/leadership/presidents-newsletter/newsletters/march-2025.html",
      "email": "alumni@broward.edu"
    },
    {
      "url": "https://www.broward.edu/about/leadership/presidents-newsletter/newsletters/march-2025.html",
      "email": "mediarelations@broward.edu"
    },
    {
      "url": "https://www.broward.edu/about/leadership/presidents-newsletter/newsletters/march-2025.html",
      "email": "officeofthepresident@broward.edu"
    },
    {
      "url": "https://www.broward.edu/about/community/facility/",
      "email": "centralfacilities@broward.edu"
    },
    {
      "url": "https://www.broward.edu/about/community/facility/",
      "email": "miramarfacilities@broward.edu"
    },
    {
      "url": "https://www.broward.edu/about/community/facility/",
      "email": "northfacilities@broward.edu"
    },
    {
      "url": "https://www.broward.edu/about/community/facility/",
      "email": "southfacilities@broward.edu"
    },
    {
      "url": "https://centurionbanquethall.com/contact/",
      "email": "info@centurionbanquethall.com"
    },
    {
      "url": "https://www.broward.edu/baileyhall/",
      "email": "baileyhall@broward.edu"
    },
    {
      "url": "https://www.broward.edu/baileyhall/history.html",
      "email": "baileyhall@broward.edu"
    },
    {
      "url": "https://calendar.broward.edu/2024/11/jazz_club.html",
      "email": "vpadept@broward.edu"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "email": "info@scibpaints.com"
    },
    {
      "url": "https://dev1.broward.edu/about/community/trio/eoc.html",
      "email": "trio@broward.edu"
    }
  ],
  "mails": [
    "abaker@cfbroward.org",
    "akah@cfbroward.org",
    "alumni@broward.edu",
    "areid@cfbroward.org",
    "baileyhall@broward.edu",
    "bburkhart@cfbroward.org",
    "cbrown@cfbroward.org",
    "cburrell@cfbroward.org",
    "cdorko@cfbroward.org",
    "centralfacilities@broward.edu",
    "cperez@cfbroward.org",
    "info@centurionbanquethall.com",
    "info@cfbroward.org",
    "info@scibpaints.com",
    "jbryan@cfbroward.org",
    "jlewis@cfbroward.org",
    "joa@cfbroward.org",
    "jsaldivar@cfbroward.org",
    "jvones@cfbroward.org",
    "kenglehardt@cfbroward.org",
    "kmarmol@cfbroward.org",
    "ljacquett@cfbroward.org",
    "mediarelations@broward.edu",
    "miramarfacilities@broward.edu",
    "mmtoole@cfbroward.org",
    "nmitchell@cfbroward.org",
    "northfacilities@broward.edu",
    "nthies@cfbroward.org",
    "officeofthepresident@broward.edu",
    "rsobelson@cfbroward.org",
    "sbrown@cfbroward.org",
    "southfacilities@broward.edu",
    "trio@broward.edu",
    "vpadept@broward.edu",
    "ylawson@cfbroward.org"
  ],
  "nombre_sitio": "broward.edu",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.cfbroward.org/about-us/board-staff",
      "text": "Community Foundation of Broward | Board and Staff X Attention Internet Explorer Users: To enjoy the full experience, more speed and security, please use or download one of these free, up-to-date browsers below: Microsoft Edge Â Â Â |Â Â Â Mozilla Firefox Â Â Â |Â Â Â Google Chrome Â Â Â |Â Â Â Opera Software Log In Fundholders Nonprofits Board Members Donate Now About Us What We Do Board & Staff Mission, Vision & Values Community Leadership & Impact Financial Information Careers Building Community and Opportunity Give Prospective Donors Fundholders Advisors Receive Apply for Grants Apply for Scholarships Training, Support & Resources Learn Center for Nonprofit Excellence Impact Stories Events FAQs Publications News Videos Contact Us Board and Staff The Community Foundation of Browardâs experienced leadership team is committed to creating a community that is a vibrant place where everyone can thrive, feel connected and have the opportunity to reach their full potential. Board of Directors Our dynamic Board of Directors includes innovative executives and dedicated community leaders who guide our leadership and grantmaking, driving us to create BOLD impact. Mona Pittenger Chair Mona is an activist and philanthropist who calls Fort Lauderdale home. In 2011, she retired as owner of a real estate company specializing in the management and sale of government foreclosures. She was a founding Board Member of Our Fund Foundation, an LGBT foundation in Fort Lauderdale. Originally from Oklahoma, Mona co-founded the Tulsa Girls Art School, a nonprofit serving underprivileged girls. She previously served as a member of the Board of Trustees for Phillips Theological Seminary in Tulsa as well as the national boards of Lambda Legal, Victory Fund and Freedom for All Americans. Mona Pittenger Mona is an activist and philanthropist who calls Fort Lauderdale home. In 2011, she retired as owner of a real estate company specializing in the management and sale of government foreclosures. She was a founding Board Member of Our Fund Foundation, an LGBT foundation in Fort Lauderdale. Originally from Oklahoma, Mona co-founded the Tulsa Girls Art School, a nonprofit serving underprivileged girls. She previously served as a member of the Board of Trustees for Phillips Theological Seminary in Tulsa as well as the national boards of Lambda Legal, Victory Fund and Freedom for All Americans. Read more Jonathan K. Allen Vice Chair Jonathan serves as Director of Broward Countyâs Water and Wastewater Services Business Operations Division. He earned a bachelorâs degree in economics from Florida A&M University and a masterâs degree in public administration from the University of Kansas. He has held past positions as City Manager, Assistant City Manager, Public Works Director and other roles for five local governments in Kansas and Florida. He is an active member of the New Mount Olive Baptist Church, Alpha Phi Alpha Fraternity Inc., National Forum for Black Public Administrators and other civic/professional organizations. Jonathan K. Allen Jonathan serves as Director of Broward Countyâs Water and Wastewater Services Business Operations Division. He earned a bachelorâs degree in economics from Florida A&M University and a masterâs degree in public administration from the University of Kansas. He has held past positions as City Manager, Assistant City Manager, Public Works Director and other roles for five local governments in Kansas and Florida. He is an active member of the New Mount Olive Baptist Church, Alpha Phi Alpha Fraternity Inc., National Forum for Black Public Administrators and other civic/professional organizations. Read more Burnadette Norris-Weeks Secretary Burnadette is a partner in Austin Pamies Norris Weeks Powell, PLLC. She serves a counsel to various governmental entities, including cities in Broward, Miami-Dade and Palm Beach counties. She is a Past Chair for the Greater Fort Lauderdale Chamber of Commerce and is a member of the Board Directors for Habitat for Humanity of Broward. Burnadette is founder of the Women of Color Empowerment Institute, Inc. and also serves as a member of the Federal Judicial Nominating Conference for the Southern District of Florida. Burnadette Norris-Weeks Burnadette is a partner in Austin Pamies Norris Weeks Powell, PLLC. She serves a counsel to various governmental entities, including cities in Broward, Miami-Dade and Palm Beach counties. She is a Past Chair for the Greater Fort Lauderdale Chamber of Commerce and is a member of the Board Directors for Habitat for Humanity of Broward. Burnadette is founder of the Women of Color Empowerment Institute, Inc. and also serves as a member of the Federal Judicial Nominating Conference for the Southern District of Florida. Read more Bertha Henry Treasurer Bertha has a longstanding career in public service, with more than 30 years of experience in public administration. In 2022, she retired as Broward County Administrator. As the countyâs top executive officer, she managed a nearly $6 billion budget and directed more than 7,000 employees from more than 60 county agencies. She began working for Broward County in 1996, serving as assistant to the county administrator. She later became Miamiâs assistant city manager of finance administration. In 2000, she returned to Broward County to serve as deputy county administrator for eight years prior to her appointment as county administrator. In 2017, she was honored with the International City/County Management Association Career Excellence Award. Bertha has a bachelorâs degree in Government and a masterâs degree in Public Administration and from Florida State University. Bertha Henry Bertha has a longstanding career in public service, with more than 30 years of experience in public administration. In 2022, she retired as Broward County Administrator. As the countyâs top executive officer, she managed a nearly $6 billion budget and directed more than 7,000 employees from more than 60 county agencies. She began working for Broward County in 1996, serving as assistant to the county administrator. She later became Miamiâs assistant city manager of finance administration. In 2000, she returned to Broward County to serve as deputy county administrator for eight years prior to her appointment as county administrator. In 2017, she was honored with the International City/County Management Association Career Excellence Award. Bertha has a bachelorâs degree in Government and a masterâs degree in Public Administration and from Florida State University. Read more Ramona Lacy Fowler At-Large Ramona is an Executive Advisor to health care organizations. She has consulted with hundreds of hospitals, health systems and academic medical centers as well as GPOs, technology companies, physician practice companies and health plans. She was co-founder and Managing Partner of Prism Healthcare Partners, a health care consulting firm. Prior to that, she was a Principal for Wellspring Partners, the third-largest healthcare consulting company firm. She served on the Board of two health care consulting firms, Prism Healthcare Partners and Wellspring Partners, and she serves on the Community Foundation of Browardâs Investment Committee. Ramona Lacy Fowler Ramona is an Executive Advisor to health care organizations. She has consulted with hundreds of hospitals, health systems and academic medical centers as well as GPOs, technology companies, physician practice companies and health plans. She was co-founder and Managing Partner of Prism Healthcare Partners, a health care consulting firm. Prior to that, she was a Principal for Wellspring Partners, the third-largest healthcare consulting company firm. She served on the Board of two health care consulting firms, Prism Healthcare Partners and Wellspring Partners, and she serves on the Community Foundation of Browardâs Investment Committee. Read more Eric J. Vainder At-Large Eric is Northern Trustâs Senior Market Executive for Broward County. Since joining Northern Trust in 1998, he has closely advised high-net-worth families, individuals and foundations in all areas of wealth management. Prior to his current role, he served as Senior Managing Director of a Private Client Advisory Team based in Miami. Eric's community involvement includes serving as Chairman of the Board of Easter Seals of South Florida; Board Member of the Overtown Youth Center; Chairman of the United Way's Professional Advisors Committee in Miami-Dade; Advisory Board Member for Philanthropy Miami; and Member of the Nationwide Gift Planning Advisor Council for the American Cancer Society. Eric J. Vainder Eric is Northern Trustâs Senior Market Executive for Broward County. Since joining Northern Trust in 1998, he has closely advised high-net-worth families, individuals and foundations in all areas of wealth management. Prior to his current role, he served as Senior Managing Director of a Private Client Advisory Team based in Miami. Eric's community involvement includes serving as Chairman of the Board of Easter Seals of South Florida; Board Member of the Overtown Youth Center; Chairman of the United Way's Professional Advisors Committee in Miami-Dade; Advisory Board Member for Philanthropy Miami; and Member of the Nationwide Gift Planning Advisor Council for the American Cancer Society. Read more Holly Hudson Bodenweber Holly is president of the Hudson Family Foundation who is serving her second stint on the Community Foundation Board. Hollyâs other local leadership roles include board positions for the NSU Art Museum, Funding Arts Broward, Broward Library Foundation and Pine Crest School. In addition, she is actively involved in numerous community organizations, including the Broward Center for the Performing Arts, Young at Art, Broward Health, Humane Society of Broward, Joe DiMaggioâs Childrenâs Hospital, JDRF, Diabetes Research Institute, American Heart Association, Boys and Girls Clubs of Broward, the Jack and Jill Center, Take Stock in Children, Heart Gallery of Broward County, Habitat for Humanity and YMCA. A Broward County native, Holly attended Pine Crest School in Fort Lauderdale. She graduated from Southern Methodist University in Dallas, Texas with a bachelorâs degree in Art History. Holly Hudson Bodenweber Holly is president of the Hudson Family Foundation who is serving her second stint on the Community Foundation Board. Hollyâs other local leadership roles include board positions for the NSU Art Museum, Funding Arts Broward, Broward Library Foundation and Pine Crest School. In addition, she is actively involved in numerous community organizations, including the Broward Center for the Performing Arts, Young at Art, Broward Health, Humane Society of Broward, Joe DiMaggioâs Childrenâs Hospital, JDRF, Diabetes Research Institute, American Heart Association, Boys and Girls Clubs of Broward, the Jack and Jill Center, Take Stock in Children, Heart Gallery of Broward County, Habitat for Humanity and YMCA. A Broward County native, Holly attended Pine Crest School in Fort Lauderdale. She graduated from Southern Methodist University in Dallas, Texas with a bachelorâs degree in Art History. Read more Ted Christie Ted is former president and CEO of Spirit Airlines. He joined the airline in 2012, previously serving as its President, Senior Vice President and CFO. Prior to joining Spirit, he served as CFO of Pinnacle Airlines Corp, an airline holding company with subsidiaries flying as Delta Connection, United Express and US Airways Express. Ted began his airline career at Frontier Airlines in 2002. He was also Vice President of Finance at a Denver asset-based finance institution and served as an Economist for the Arizona taxing authority. Ted earned a Bachelor of Business Administration in Finance from the University of Arizona. Ted Christie Ted is former president and CEO of Spirit Airlines. He joined the airline in 2012, previously serving as its President, Senior Vice President and CFO. Prior to joining Spirit, he served as CFO of Pinnacle Airlines Corp, an airline holding company with subsidiaries flying as Delta Connection, United Express and US Airways Express. Ted began his airline career at Frontier Airlines in 2002. He was also Vice President of Finance at a Denver asset-based finance institution and served as an Economist for the Arizona taxing authority. Ted earned a Bachelor of Business Administration in Finance from the University of Arizona. Read more Marianela âNelaâ Collado Marianela is a senior wealth advisor and is CEO and co-owner of Tobias Financial Advisors in Plantation, Florida. She also serves as Chair of the Professional Advisors Council at the Community Foundation of Broward. She is passionate about giving back and being involved in her community and has earned recognition such as Mother of the Year by Healthy Mothers, Healthy Babies (2021). In addition, she is a Board member of Nova Southeastern Universityâs Planned Giving Council, Planned Giving Council of Broward, Gildaâs Club South Florida, and a member of many more organizations. Marianela âNelaâ Collado Marianela is a senior wealth advisor and is CEO and co-owner of Tobias Financial Advisors in Plantation, Florida. She also serves as Chair of the Professional Advisors Council at the Community Foundation of Broward. She is passionate about giving back and being involved in her community and has earned recognition such as Mother of the Year by Healthy Mothers, Healthy Babies (2021). In addition, she is a Board member of Nova Southeastern Universityâs Planned Giving Council, Planned Giving Council of Broward, Gildaâs Club South Florida, and a member of many more organizations. Read more Aurelio Fernandez Aurelio, a health care professional for more than 45 years, is former President and CEO for Memorial Healthcare System. Previously, he spent 11 years in a variety of positions with Tenet Healthcare, including CEO at Hialeah Hospital and Florida Medical Center and Executive Director for Tenet Network Management. Aurelio is active in many organizations and has served in leadership roles for Catholic Health Services, the Florida Hospital Association, the Safety Net Hospital Alliance of Florida, Broward Workshop and the South Florida Hospital Healthcare Association. He was appointed to serve on the Transition Advisory Committee for Health and Wellness for Governor Ron DeSantis in 2018. He was born in Havana, Cuba and has lived in South Florida for 60 years. He earned a bachelorâs degree in Business Administration and a masterâs degree in Health Services Administration from Florida International University. Aurelio Fernandez Aurelio, a health care professional for more than 45 years, is former President and CEO for Memorial Healthcare System. Previously, he spent 11 years in a variety of positions with Tenet Healthcare, including CEO at Hialeah Hospital and Florida Medical Center and Executive Director for Tenet Network Management. Aurelio is active in many organizations and has served in leadership roles for Catholic Health Services, the Florida Hospital Association, the Safety Net Hospital Alliance of Florida, Broward Workshop and the South Florida Hospital Healthcare Association. He was appointed to serve on the Transition Advisory Committee for Health and Wellness for Governor Ron DeSantis in 2018. He was born in Havana, Cuba and has lived in South Florida for 60 years. He earned a bachelorâs degree in Business Administration and a masterâs degree in Health Services Administration from Florida International University. Read more Trevor Fried Trevor is a financial advisor, published author and senior portfolio management director/founder of The Las Olas Group at Morgan Stanley. He serves as a member of the Investment Committee of the Community Foundation of Broward. Fried is also a Community Foundation of Broward Community Builder, a group of local philanthropists who create endowed charitable funds of $1 million or more to shape a brighter future for Broward. He is an active member or Board member of several civic and benevolent organizations in Broward County. Since 2013, he has been a member of the Planned Giving Council of Broward. He recently served as the Board Chair at Gildaâs Club of South Florida and continues serving as an honorary Board member. In addition, he is a volunteer Guardian for Honor Flight South Florida. In 2019, he was appointed as a trustee of the South Florida National Parks Trust. Trevor Fried Trevor is a financial advisor, published author and senior portfolio management director/founder of The Las Olas Group at Morgan Stanley. He serves as a member of the Investment Committee of the Community Foundation of Broward. Fried is also a Community Foundation of Broward Community Builder, a group of local philanthropists who create endowed charitable funds of $1 million or more to shape a brighter future for Broward. He is an active member or Board member of several civic and benevolent organizations in Broward County. Since 2013, he has been a member of the Planned Giving Council of Broward. He recently served as the Board Chair at Gildaâs Club of South Florida and continues serving as an honorary Board member. In addition, he is a volunteer Guardian for Honor Flight South Florida. In 2019, he was appointed as a trustee of the South Florida National Parks Trust. Read more David W. Horvitz David is the Chairman of the Board and CEO of South Ocean Capital Partners, and previously Chairman of WLD Enterprises. He is a board member of United States Artists and a founder and former chair of the board of Camp Boggy Creek. David is also on the board of The Lewis Prize, a grantmaking organization in the arts focused on music education. He is the past Chair of the Board of Governors of the NSU Art Museum Ft. Lauderdale and was a Trustee of the Kresge Foundation. He is a graduate of Kenyon College and has a J.D. from the University of Florida. David W. Horvitz David is the Chairman of the Board and CEO of South Ocean Capital Partners, and previously Chairman of WLD Enterprises. He is a board member of United States Artists and a founder and former chair of the board of Camp Boggy Creek. David is also on the board of The Lewis Prize, a grantmaking organization in the arts focused on music education. He is the past Chair of the Board of Governors of the NSU Art Museum Ft. Lauderdale and was a Trustee of the Kresge Foundation. He is a graduate of Kenyon College and has a J.D. from the University of Florida. Read more Susanne Cornfeld Hurowitz Susanne is President of HB Capital Group, a privately held, real estate investment and management company. She was formerly President of SCH Consulting, which advised nonprofit organizations on strategic planning initiatives. Prior to that, she was Director of Development for Homes for the Homeless in New York and has remained on the board for the past 15 years. Susanne serves on the board of the Joe DiMaggio Childrenâs Hospital Foundation/Memorial Hospital Foundation. She is a member of the Weill Cornell Medicine Deanâs Council, Dyson Advisory Council at Cornell University, Advisory Board for Columbia Business Schoolâs Tamer Center for Social Enterprise, University of Miami Department of Neurology Advisory Board and the Institute for Children and Poverty Board of Directors. Susanne holds a bachelorâs degree from Tufts University and an MBA from Columbia University. Susanne Cornfeld Hurowitz Susanne is President of HB Capital Group, a privately held, real estate investment and management company. She was formerly President of SCH Consulting, which advised nonprofit organizations on strategic planning initiatives. Prior to that, she was Director of Development for Homes for the Homeless in New York and has remained on the board for the past 15 years. Susanne serves on the board of the Joe DiMaggio Childrenâs Hospital Foundation/Memorial Hospital Foundation. She is a member of the Weill Cornell Medicine Deanâs Council, Dyson Advisory Council at Cornell University, Advisory Board for Columbia Business Schoolâs Tamer Center for Social Enterprise, University of Miami Department of Neurology Advisory Board and the Institute for Children and Poverty Board of Directors. Susanne holds a bachelorâs degree from Tufts University and an MBA from Columbia University. Read more Alice Lucia Jackson Alice is a former Senior Vice President of Jones Lang LaSalle who completed a 36-year in commercial real estate. She was honored by her business peers in 2017 with a Lifetime Achievement Award and she also received the 2017 Magnolia United Way Leadership Award. Alice is a Leadership Broward graduate and a Tocqueville Society member. She serves on the Breast Cancer Research Foundationâs National Advisory Board. Alice previously served on the Community Foundation Board from 2016-2021. Alice Lucia Jackson Alice is a former Senior Vice President of Jones Lang LaSalle who completed a 36-year in commercial real estate. She was honored by her business peers in 2017 with a Lifetime Achievement Award and she also received the 2017 Magnolia United Way Leadership Award. Alice is a Leadership Broward graduate and a Tocqueville Society member. She serves on the Breast Cancer Research Foundationâs National Advisory Board. Alice previously served on the Community Foundation Board from 2016-2021. Read more Ken Kappner Ken has more than 35 years of industry experience in supply chain management, having held senior executive-level positions at several Fortune 500 companies including Procter & Gamble, Quaker Oats â PepsiCo, Electronic Arts and Samsung. In addition to the Community Foundation of Broward, he has volunteered with numerous national and local nonprofit organizations, such as the Cincinnati Better Business Bureau, Junior Achievement, The Our Fund Foundation, Sunserve and the United Church of Christ Fort Lauderdale. Ken Kappner Ken has more than 35 years of industry experience in supply chain management, having held senior executive-level positions at several Fortune 500 companies including Procter & Gamble, Quaker Oats â PepsiCo, Electronic Arts and Samsung. In addition to the Community Foundation of Broward, he has volunteered with numerous national and local nonprofit organizations, such as the Cincinnati Better Business Bureau, Junior Achievement, The Our Fund Foundation, Sunserve and the United Church of Christ Fort Lauderdale. Read more Dara Levan Dara is a writer, podcaster and founder of Every Soul Has a Story. What Dara began as a blog has expanded to include a podcast in which she interviews inspiring guests from around the globe. She is a board member for Joe DiMaggio Childrenâs Hospital Foundation/Memorial Hospital Foundation and a former board member for Goodman Jewish Family Services of Broward County, Junior Achievement of South Florida, and I Care I Cure Childhood Cancer Foundation. Dara is a founding member of the Circle of Friends for the Alvin Sherman Library Research, Information, and Technology Center at Nova Southeastern University and a graduate of Leadership Broward. Dara has a bachelorâs degree in English and minor in journalism from Indiana University. She earned her masterâs degree in Communication Sciences and Disorders from Nova Southeastern University. Dara Levan Dara is a writer, podcaster and founder of Every Soul Has a Story. What Dara began as a blog has expanded to include a podcast in which she interviews inspiring guests from around the globe. She is a board member for Joe DiMaggio Childrenâs Hospital Foundation/Memorial Hospital Foundation and a former board member for Goodman Jewish Family Services of Broward County, Junior Achievement of South Florida, and I Care I Cure Childhood Cancer Foundation. Dara is a founding member of the Circle of Friends for the Alvin Sherman Library Research, Information, and Technology Center at Nova Southeastern University and a graduate of Leadership Broward. Dara has a bachelorâs degree in English and minor in journalism from Indiana University. She earned her masterâs degree in Communication Sciences and Disorders from Nova Southeastern University. Read more Sigrid S. McCawley Sigrid is a Managing Partner of Boies Schiller Flexner, where she helps oversee nearly 200 attorneys in the U.S. and London. She has more than 20 years of experience litigating some of the most sophisticated commercial litigation disputes in the country and abroad. Sigrid has been a leader in the legal fight on behalf of victims in high-profile sex trafficking cases, including the Jeffrey Epstein case. She was named Litigator of the Year by The American Lawyer and Top Ten Female Litigator in 2020, 2021 and 2022 by Benchmark Litigation. Her community involvement includes serving on ChildNetâs Board of Directors as well as the Jack & Jill Centerâs Board of Directors. Sigrid S. McCawley Sigrid is a Managing Partner of Boies Schiller Flexner, where she helps oversee nearly 200 attorneys in the U.S. and London. She has more than 20 years of experience litigating some of the most sophisticated commercial litigation disputes in the country and abroad. Sigrid has been a leader in the legal fight on behalf of victims in high-profile sex trafficking cases, including the Jeffrey Epstein case. She was named Litigator of the Year by The American Lawyer and Top Ten Female Litigator in 2020, 2021 and 2022 by Benchmark Litigation. Her community involvement includes serving on ChildNetâs Board of Directors as well as the Jack & Jill Centerâs Board of Directors. Read more Greg Medalie Greg is a partner at Medalie & Medalie P.A. and has been a member of the Florida Bar for 32 years. His primary practice areas are trusts & estates, business transactions and real estate. He is former Chair of the Community Foundationâs Professional Advisors Committee and a founding member of the PACâs Special Forces planning team. He represented the Community Foundation as a Co-Chair for the 2019 Joint Tax and Estate Planning Seminar. Greg served for ten years as chair of the 450-member Wills, Trusts, and Estates Section of the Broward County Bar Association and he served as president of Florida Bar Grievance Committee âLâ in Broward County. Greg Medalie Greg is a partner at Medalie & Medalie P.A. and has been a member of the Florida Bar for 32 years. His primary practice areas are trusts & estates, business transactions and real estate. He is former Chair of the Community Foundationâs Professional Advisors Committee and a founding member of the PACâs Special Forces planning team. He represented the Community Foundation as a Co-Chair for the 2019 Joint Tax and Estate Planning Seminar. Greg served for ten years as chair of the 450-member Wills, Trusts, and Estates Section of the Broward County Bar Association and he served as president of Florida Bar Grievance Committee âLâ in Broward County. Read more Pam E. Booker Pettis Pam is a longtime South Florida attorney who currently works with the Law Offices of Austin Pamies Norris Weeks Powell PLLC. In addition to serving as a Board member with the Community Foundation of Broward, she serves the community as the Chair of the Community Education Alliance. She has served on the Board of Directors for the Pace Center for Girls and First Tee of the Treasure Coast. Pam E. Booker Pettis Pam is a longtime South Florida attorney who currently works with the Law Offices of Austin Pamies Norris Weeks Powell PLLC. In addition to serving as a Board member with the Community Foundation of Broward, she serves the community as the Chair of the Community Education Alliance. She has served on the Board of Directors for the Pace Center for Girls and First Tee of the Treasure Coast. Read more Brian M. Poulin Brian is a Principal and co-founder of Evergreen Partners, LLC. He has a background in tax law and has been a developer and owner of rental real estate for over 25 years. Brian is also a Principal of Preservation Management, Inc., an affiliated property management company. Previously, Brian was a founding Principal in The Wishcamper Group and he held positions with Wishcamper Properties, Inc., Baker Newman & Noyes, and KPMG Peat Marwick. He has served on nonprofit boards including The National Leased Housing Association, The Orange Bowl Committee and the Humane Society of Broward County. Brian M. Poulin Brian is a Principal and co-founder of Evergreen Partners, LLC. He has a background in tax law and has been a developer and owner of rental real estate for over 25 years. Brian is also a Principal of Preservation Management, Inc., an affiliated property management company. Previously, Brian was a founding Principal in The Wishcamper Group and he held positions with Wishcamper Properties, Inc., Baker Newman & Noyes, and KPMG Peat Marwick. He has served on nonprofit boards including The National Leased Housing Association, The Orange Bowl Committee and the Humane Society of Broward County. Read more John Templeton John is CEO of Templeton & Company. He also leads the firmâs Audit and Accounting practice. He is an experienced provider of valuation, accounting, auditing and advisory services for private enterprises in a variety of industries, including real estate, construction, nonprofit, educational institutions, health care, agriculture, manufacturing and distribution. John is licensed as a Certified Public Accountant in Florida and Georgia. He received the Young Alumni Award from Palm Beach Atlantic University, recognizing his contributions to his community and workplace. John Templeton John is CEO of Templeton & Company. He also leads the firmâs Audit and Accounting practice. He is an experienced provider of valuation, accounting, auditing and advisory services for private enterprises in a variety of industries, including real estate, construction, nonprofit, educational institutions, health care, agriculture, manufacturing and distribution. John is licensed as a Certified Public Accountant in Florida and Georgia. He received the Young Alumni Award from Palm Beach Atlantic University, recognizing his contributions to his community and workplace. Read more Staff Our staff of highly skilled experts with unmatched community knowledge: Provides leadership and resources to support solutions to Browardâs big challenges Partners with our Fundholders to foster philanthropy that shapes a brighter future for our community Builds endowment that keeps pace with Browardâs growing needs Jennifer O'Flannery Anderson, Ph.D. President/CEO Jennifer O'Flannery Anderson, Ph.D., began as President/CEO of the Community Foundation of Broward (CFB) in August 2020. Before joining the CFB she served as Vice President of Advancement and Community Relations at Nova Southeastern University (NSU). Â She previously worked at Florida Atlantic University (FAU) as VP for Community Engagement and Executive Director of the FAU Foundation and served as President/CEO of the United Way of Broward County. Appointed by Governor Ron DeSantis, Jennifer serves on the Executive Committee of CareerSource Florida Board. Jennifer also serves on the National Council on Foundationsâ Community Advisory Group and the Florida Community Foundations Steering Committee. Â She holds a bachelorâs degree from Florida State University, a masterâs degree from the University of South Florida, and a Doctor of Philosophy in Public Administration from FAU. She has lived in Fort Lauderdale for more than 23 years with her husband Peter and their two dogs. â Contact Email: joa@cfbroward.org Phone: 954-761-9503 ext. 101 Jennifer O'Flannery Anderson, Ph.D. Jennifer O'Flannery Anderson, Ph.D., began as President/CEO of the Community Foundation of Broward (CFB) in August 2020. Before joining the CFB she served as Vice President of Advancement and Community Relations at Nova Southeastern University (NSU). Â She previously worked at Florida Atlantic University (FAU) as VP for Community Engagement and Executive Director of the FAU Foundation and served as President/CEO of the United Way of Broward County. Appointed by Governor Ron DeSantis, Jennifer serves on the Executive Committee of CareerSource Florida Board. Jennifer also serves on the National Council on Foundationsâ Community Advisory Group and the Florida Community Foundations Steering Committee. Â She holds a bachelorâs degree from Florida State University, a masterâs degree from the University of South Florida, and a Doctor of Philosophy in Public Administration from FAU. She has lived in Fort Lauderdale for more than 23 years with her husband Peter and their two dogs. â Contact Email: joa@cfbroward.org Phone: 954-761-9503 ext. 101 Read more Andria Baker Manager, Database and Development Andria Baker has two decades of experience in the areas of business administration, management and accounting, in both the public and private sectors. She has previously worked in development at American Friends of the Hebrew University. She holds a bachelorâs degree in Business Supervision and Management and certification in Accounting Technology from Broward College. Â Contact Email:Â abaker@cfbroward.org Phone: 954-761-9503 ext. 121 â Andria Baker Andria Baker has two decades of experience in the areas of business administration, management and accounting, in both the public and private sectors. She has previously worked in development at American Friends of the Hebrew University. She holds a bachelorâs degree in Business Supervision and Management and certification in Accounting Technology from Broward College. Â Contact Email:Â abaker@cfbroward.org Phone: 954-761-9503 ext. 121 â Read more Cathy Brown Director of the Broward Center for Nonprofit Excellence Cathy Brown, Director of the Community Foundationâs Broward Center for Nonprofit Excellence, has more than 15 years of experience in nonprofit management and fundraising as well as expertise in curriculum design and instruction. Prior to joining the Community Foundation, she designed and taught courses for The Fund Raising School, an institute of Lilly Family School of Philanthropy at Indiana University. Â Cathy is a member of Association of Fundraising Professionals, Association for Talent Development and several other professional organizations. She is a graduate of Hanover College, Indiana University Bloomington, and Lilly Family School of Philanthropy at IUPUI. Â She is a nationally certified Associate Professional in Talent Development. Contact Email: cbrown@cfbroward.org Phone: 954-761-9503, ext. 119 â Cathy Brown Cathy Brown, Director of the Community Foundationâs Broward Center for Nonprofit Excellence, has more than 15 years of experience in nonprofit management and fundraising as well as expertise in curriculum design and instruction. Prior to joining the Community Foundation, she designed and taught courses for The Fund Raising School, an institute of Lilly Family School of Philanthropy at Indiana University. Â Cathy is a member of Association of Fundraising Professionals, Association for Talent Development and several other professional organizations. She is a graduate of Hanover College, Indiana University Bloomington, and Lilly Family School of Philanthropy at IUPUI. Â She is a nationally certified Associate Professional in Talent Development. Contact Email: cbrown@cfbroward.org Phone: 954-761-9503, ext. 119 â Read more Sheri Brown Grosvenor Vice President, Community Impact Sheri Brown Grosvenor, Vice President, Community Impact, has served the Foundation for over 20 years and is a member of the Florida Philanthropic Network, Community Foundation Opportunity Network (CFON) Leadership Council, and Community Foundations National Standards Board. Â She is a graduate of Leadership Broward, the American Express Leadership Academy, and Leadership Florida Class XXXIV. Her community involvement includes service to The Links, Incorporated; Delta Sigma Theta Sorority, Inc.; and Women of Tomorrow Mentoring Program. A Broward native, Sheri received her B.A. degree in English from Florida A&M University and her M.S. degree in Human Resource Development from Barry University. â Contact Email: sbrown@cfbroward.org Phone: 954-761-9503 ext. 103 â â Sheri Brown Grosvenor Sheri Brown Grosvenor, Vice President, Community Impact, has served the Foundation for over 20 years and is a member of the Florida Philanthropic Network, Community Foundation Opportunity Network (CFON) Leadership Council, and Community Foundations National Standards Board. Â She is a graduate of Leadership Broward, the American Express Leadership Academy, and Leadership Florida Class XXXIV. Her community involvement includes service to The Links, Incorporated; Delta Sigma Theta Sorority, Inc.; and Women of Tomorrow Mentoring Program. A Broward native, Sheri received her B.A. degree in English from Florida A&M University and her M.S. degree in Human Resource Development from Barry University. â Contact Email: sbrown@cfbroward.org Phone: 954-761-9503 ext. 103 â â Read more Jennifer Bryan Manager, Finance and Operations Jennifer Bryan, Accounting Associate, has more than 10 years of banking experience, both as an investment operations officer and as a loan booking specialist at City National Bank of Florida. Jennifer also has six years of accounting experience in several industries, most recently as Senior Staff Accountant at the YMCA of South Florida. She graduated with honors with a BSBA degree in finance from the University of Florida. Contact Email: jbryan@cfbroward.org Phone: 954-761-9503, ext. 104 â Jennifer Bryan Jennifer Bryan, Accounting Associate, has more than 10 years of banking experience, both as an investment operations officer and as a loan booking specialist at City National Bank of Florida. Jennifer also has six years of accounting experience in several industries, most recently as Senior Staff Accountant at the YMCA of South Florida. She graduated with honors with a BSBA degree in finance from the University of Florida. Contact Email: jbryan@cfbroward.org Phone: 954-761-9503, ext. 104 â Read more Bethany Burkhart Coordinator of Donor Services Bethany Burkhart, Coordinator of Donor Services at the Community Foundation, has over a decade of experience in nonprofit and program development, community outreach, grants management, fundraising and marketing. Â Harnessing her passion and creativity, she champions holistic philanthropy, education, social mobility, environmental preservation and health care enhancement, advocating for individual rights and diversity through development and community outreach. Before joining the Community Foundation, Bethany worked for Broward Childrenâs Center. She is an alumnus of Broward College and Florida International University where she majored in Psychology and with a minor in International Relations. Contact Email: bburkhart@cfbroward.org Phone: 954â761-950, ext. 156 â Bethany Burkhart Bethany Burkhart, Coordinator of Donor Services at the Community Foundation, has over a decade of experience in nonprofit and program development, community outreach, grants management, fundraising and marketing. Â Harnessing her passion and creativity, she champions holistic philanthropy, education, social mobility, environmental preservation and health care enhancement, advocating for individual rights and diversity through development and community outreach. Before joining the Community Foundation, Bethany worked for Broward Childrenâs Center. She is an alumnus of Broward College and Florida International University where she majored in Psychology and with a minor in International Relations. Contact Email: bburkhart@cfbroward.org Phone: 954â761-950, ext. 156 â Read more Cassandra Burrell Director, Community Impact Cassandra Burrell, Director of Community Impact, has more than 10 years of experience in the Social/Human Services field in the nonprofit sector, specifically in public health. Prior to coming to Community Foundation, Cassandra served as Division Manager of Health Initiatives at the Urban League of Broward County. Â She has a bachelorâs degree in Human Services and Counseling and a masterâs in Public Administration from Nova Southeastern University. Contact Email: cburrell@cfbroward.org Phone: 954-761-9503 ext. 119 â Cassandra Burrell Cassandra Burrell, Director of Community Impact, has more than 10 years of experience in the Social/Human Services field in the nonprofit sector, specifically in public health. Prior to coming to Community Foundation, Cassandra served as Division Manager of Health Initiatives at the Urban League of Broward County. Â She has a bachelorâs degree in Human Services and Counseling and a masterâs in Public Administration from Nova Southeastern University. Contact Email: cburrell@cfbroward.org Phone: 954-761-9503 ext. 119 â Read more Carol Dorko Chief Financial Officer/Chief Operating Officer Carol Dorko, Chief Financial Officer/Chief Operating Officer, has nearly 30 years of progressive experience in the areas of accounting, finance, human resources, IT and operations in both the public and private sectors. She is a member of the Council on Foundations Financial and Administrative Officer Group and an American Express Leadership Academy graduate. She is an alumnus of the University of Pittsburgh and Duquesne University School of Law. â Contact Email: cdorko@cfbroward.org Phone: 954-761-9503 ext. 107 â â Carol Dorko Carol Dorko, Chief Financial Officer/Chief Operating Officer, has nearly 30 years of progressive experience in the areas of accounting, finance, human resources, IT and operations in both the public and private sectors. She is a member of the Council on Foundations Financial and Administrative Officer Group and an American Express Leadership Academy graduate. She is an alumnus of the University of Pittsburgh and Duquesne University School of Law. â Contact Email: cdorko@cfbroward.org Phone: 954-761-9503 ext. 107 â â Read more Kirk Englehardt Vice President, Marketing and Communications Kirk Englehardt is a veteran communicator with more than 25 years of experience. He grew up in Broward County and holds a master of public administration degree from Florida Atlantic University and a bachelor of science degree in communication from Florida State University. Kirk led award-winning communications teams at the Georgia Institute of Technology (Georgia Tech), the Georgia Department of Education, and Broward County Public Schools. He has also been a media relations specialist for the Broward Sheriff's Office and a reporter for South Florida's WIOD Newsradio 610. â Contact Email: kenglehardt@cfbroward.org Phone: 954-761-9503 ext. 105 â â Kirk Englehardt Kirk Englehardt is a veteran communicator with more than 25 years of experience. He grew up in Broward County and holds a master of public administration degree from Florida Atlantic University and a bachelor of science degree in communication from Florida State University. Kirk led award-winning communications teams at the Georgia Institute of Technology (Georgia Tech), the Georgia Department of Education, and Broward County Public Schools. He has also been a media relations specialist for the Broward Sheriff's Office and a reporter for South Florida's WIOD Newsradio 610. â Contact Email: kenglehardt@cfbroward.org Phone: 954-761-9503 ext. 105 â â Read more Latoya Jacquett Coordinator, Hospitality Latoya Jacquett, Coordinator of Hospitality, has more than 15 years of Administration and Hospitality experience. Prior to joining the Foundation, she worked at the Boca Resort & Club as Sales Administrative Assistant & VIP Coordinator. She obtained a Bachelorâs Degree in Business Administration from Kaplan University and an Associateâs Degree in Graphic Design from Broward College/FAU Program. â Contact Email: ljacquett@cfbroward.org Phone: 954-761-9503 ext. 111 â Latoya Jacquett Latoya Jacquett, Coordinator of Hospitality, has more than 15 years of Administration and Hospitality experience. Prior to joining the Foundation, she worked at the Boca Resort & Club as Sales Administrative Assistant & VIP Coordinator. She obtained a Bachelorâs Degree in Business Administration from Kaplan University and an Associateâs Degree in Graphic Design from Broward College/FAU Program. â Contact Email: ljacquett@cfbroward.org Phone: 954-761-9503 ext. 111 â Read more Amanda Kah Senior Director, Donor Services Amanda Kah, Senior Director of Donor Services, has worked at Donors Forum of South Florida as its communications and member services manager. She obtained a B.A. in International Relations from Claremont McKenna College and a M.A. in International Affairs from George Washington University. â Contact Email: akah@cfbroward.org Phone: 954-761-9503 ext. 115 â â Amanda Kah Amanda Kah, Senior Director of Donor Services, has worked at Donors Forum of South Florida as its communications and member services manager. She obtained a B.A. in International Relations from Claremont McKenna College and a M.A. in International Affairs from George Washington University. â Contact Email: akah@cfbroward.org Phone: 954-761-9503 ext. 115 â â Read more Yvette Lawson Executive Assistant to CEO/Office Manager Yvette Echevarria-Lawson, Executive Assistant/Office Manager joined the Community Foundation April 2021. Â She earned a Bachelors in Business Administration Â from Baruch College in New York. Â Began her career at Citibank where she left after 19 years as an Assistant Vice President. Â She brings with her over 15 years of experience as an Executive Assistant working for Deutsche Bank, DirecTV Latin America, Rexall Sundown and DHL. â Contact Email: ylawson@cfbroward.org Phone: 954-761-9503 ext. 100 Yvette Lawson Yvette Echevarria-Lawson, Executive Assistant/Office Manager joined the Community Foundation April 2021. Â She earned a Bachelors in Business Administration Â from Baruch College in New York. Â Began her career at Citibank where she left after 19 years as an Assistant Vice President. Â She brings with her over 15 years of experience as an Executive Assistant working for Deutsche Bank, DirecTV Latin America, Rexall Sundown and DHL. â Contact Email: ylawson@cfbroward.org Phone: 954-761-9503 ext. 100 Read more Jasmine Lewis-Fontus Manager, Donor Services Jasmine Lewis-Fontus, Manager of Donor Services, is a South Florida native with more than a decade of experience in grants management, program development and relationship building. Prior to joining the Community Foundation, Jasmine worked for the Boys & Girls Clubs of Broward County as well as the Broward Sheriffâs Office. She is a graduate of the University of South Florida. Contact Email: jlewis@cfbroward.org Phone: 954-761-9503, ext. 110 â Jasmine Lewis-Fontus Jasmine Lewis-Fontus, Manager of Donor Services, is a South Florida native with more than a decade of experience in grants management, program development and relationship building. Prior to joining the Community Foundation, Jasmine worked for the Boys & Girls Clubs of Broward County as well as the Broward Sheriffâs Office. She is a graduate of the University of South Florida. Contact Email: jlewis@cfbroward.org Phone: 954-761-9503, ext. 110 â Read more Kelly Marmol Vice President, Philanthropic Services Kelly Marmol, Vice President of Philanthropic Services, has more than 20 years of experience in financial services and development. Her passion for helping others led to a career fostering philanthropy that supports education, social and economic mobility, the environment and health care. Prior to joining the Community Foundation, Kelly held senior development positions at Florida Atlantic University, the University of Miami, Methodist Childrenâs Home Society and Oakland University, raising resources for youth enrichment, student success and varied research projects. Â Kelly earned a B.S. in child development from Michigan State University and an M.A. in teaching from Oakland University. Â Kelly received a certificate in fundraising from the Lilly School of Philanthropy. â Contact Email: kmarmol@cfbroward.org Phone: 954-761-9503 ext. 155 Kelly Marmol Kelly Marmol, Vice President of Philanthropic Services, has more than 20 years of experience in financial services and development. Her passion for helping others led to a career fostering philanthropy that supports education, social and economic mobility, the environment and health care. Prior to joining the Community Foundation, Kelly held senior development positions at Florida Atlantic University, the University of Miami, Methodist Childrenâs Home Society and Oakland University, raising resources for youth enrichment, student success and varied research projects. Â Kelly earned a B.S. in child development from Michigan State University and an M.A. in teaching from Oakland University. Â Kelly received a certificate in fundraising from the Lilly School of Philanthropy. â Contact Email: kmarmol@cfbroward.org Phone: 954-761-9503 ext. 155 Read more Noel Mitchell Grants Administration Manager Noel Mitchell, Grants Administration Manager, is an experienced manager with a strong background in private, public and nonprofit administration, operations and development. Prior to joining the Community Foundation, Noel was Operations and Development Manager for Point CounterPoint and New Music On the Point â a chamber music summer camp and festival in Leicester, Vermont. Prior to that, he was a Finance and Administrative Assistant at Vanguard Medical. Noel is a Board Member for Music Haven in New Haven, Connecticut. He earned his bachelorâs degree in political science from the University of Connecticut. Contact Email: nmitchell@cfbroward.org Phone: 954-761-9503, ext. 109 â Noel Mitchell Noel Mitchell, Grants Administration Manager, is an experienced manager with a strong background in private, public and nonprofit administration, operations and development. Prior to joining the Community Foundation, Noel was Operations and Development Manager for Point CounterPoint and New Music On the Point â a chamber music summer camp and festival in Leicester, Vermont. Prior to that, he was a Finance and Administrative Assistant at Vanguard Medical. Noel is a Board Member for Music Haven in New Haven, Connecticut. He earned his bachelorâs degree in political science from the University of Connecticut. Contact Email: nmitchell@cfbroward.org Phone: 954-761-9503, ext. 109 â Read more Christine Perez Senior Director, Philanthropic Services Christine Perez, Senior Director of Philanthropic Services, has more than a decade of experience in the nonprofit sector. Prior to joining the Community Foundation, Christine led fundraising and marketing initiatives â including major gifts programs, special events and planned giving â for Camillus House in Miami. She previously served as Chief Administrative Officer and Director of Development at CADA of Northwest Louisiana, which provides comprehensive addiction treatment to underserved communities. She earned her bachelorâs degree from the University of Central Florida and holds the Certified Fundraising Executive (CFRE) designation. She serves as President of the Association of Fundraising Professionals (AFP) Miami Chapter. Contact Email: cperez@cfbroward.org Phone: 954-761-9503 ext. 137 â Christine Perez Christine Perez, Senior Director of Philanthropic Services, has more than a decade of experience in the nonprofit sector. Prior to joining the Community Foundation, Christine led fundraising and marketing initiatives â including major gifts programs, special events and planned giving â for Camillus House in Miami. She previously served as Chief Administrative Officer and Director of Development at CADA of Northwest Louisiana, which provides comprehensive addiction treatment to underserved communities. She earned her bachelorâs degree from the University of Central Florida and holds the Certified Fundraising Executive (CFRE) designation. She serves as President of the Association of Fundraising Professionals (AFP) Miami Chapter. Contact Email: cperez@cfbroward.org Phone: 954-761-9503 ext. 137 â Read more Andy Reid Director of Communications Andy Reid, Director of Communications, has more than 20 years of communications experience from working as a journalist in Florida. He is a former editorial writer and reporter for the South Florida Sun Sentinel, who throughout his journalism career specialized in writing about government, growth and development and environmental issues. Prior to moving to South Florida in 2005, Andrew worked as a reporter at the Tampa Tribune, Stuart News and the Winter Haven News Chief. He has a bachelorâs degree in communications from Florida State University. Contact Email: areid@cfbroward.org Phone: 954-761-9503 ext. 102 â â Andy Reid Andy Reid, Director of Communications, has more than 20 years of communications experience from working as a journalist in Florida. He is a former editorial writer and reporter for the South Florida Sun Sentinel, who throughout his journalism career specialized in writing about government, growth and development and environmental issues. Prior to moving to South Florida in 2005, Andrew worked as a reporter at the Tampa Tribune, Stuart News and the Winter Haven News Chief. He has a bachelorâs degree in communications from Florida State University. Contact Email: areid@cfbroward.org Phone: 954-761-9503 ext. 102 â â Read more Jonathan Saldivar Data research & Development Coordinator Jonathan Saldivar, Data Research and Development Coordinator, has worked in the nonprofit sector for more than 20 years. Â Prior to joining the Community Foundation, he worked at Food For the Poor as an Administrative Assistant and Research Specialist, where he contributed to the organization's operations and research initiatives. Â He is also a passionate arts advocate and served as the Associate Director of the Mosaic Theatre in Plantation, Florida, for several years. Â Jonathan is a playwright and majored in English and Theater at Manhattanville College in Purchase, New York. Contact Email: jsaldivar@cfbroward.org Phone: 954-761-9503, ext. 158 Jonathan Saldivar Jonathan Saldivar, Data Research and Development Coordinator, has worked in the nonprofit sector for more than 20 years. Â Prior to joining the Community Foundation, he worked at Food For the Poor as an Administrative Assistant and Research Specialist, where he contributed to the organization's operations and research initiatives. Â He is also a passionate arts advocate and served as the Associate Director of the Mosaic Theatre in Plantation, Florida, for several years. Â Jonathan is a playwright and majored in English and Theater at Manhattanville College in Purchase, New York. Contact Email: jsaldivar@cfbroward.org Phone: 954-761-9503, ext. 158 Read more Rodney Sobelson Senior Director, Finance and Operations Rodney Sobelson, Senior Director, Finance and Operations, has over 25 years of experience in not-for-profit accounting and auditing. Â Prior to coming to the Community Foundation, he spent 14 years as controller and AVP for Finance and Administration with Florida Memorial University, and the 9 years prior to that with the firm Deloitte and Touche, rising to the level of Audit Manager. Â He graduated with a BS in Accounting and MBA from Florida International University and is a certified public accountant in the State of Florida. Contact Email: rsobelson@cfbroward.org Phone: 954-761-9503, ext. 130 Rodney Sobelson Rodney Sobelson, Senior Director, Finance and Operations, has over 25 years of experience in not-for-profit accounting and auditing. Â Prior to coming to the Community Foundation, he spent 14 years as controller and AVP for Finance and Administration with Florida Memorial University, and the 9 years prior to that with the firm Deloitte and Touche, rising to the level of Audit Manager. Â He graduated with a BS in Accounting and MBA from Florida International University and is a certified public accountant in the State of Florida. Contact Email: rsobelson@cfbroward.org Phone: 954-761-9503, ext. 130 Read more Nancy Thies, CAPÂ® Executive, Philanthropic Services Nancy Thies, Executive, Philanthropic Services, has more than 30 years of experience in philanthropic consultation, fund development, sales and marketing. She has held leadership positions with Holy Cross Hospital, United Way of Broward County and Miller Brewing Company. Nancy serves on the Executive Committee for the Friends of Birch State Park board and is a member of the Planned Giving and Estate Planning Councils of Broward. She is a graduate of the University of Wisconsin-Madison where she earned her bachelorâs degree in journalism, and has earned her Chartered Advisor in Philanthropy (CAP Â® ) designation from the American College of Financial Services. â Contact Email: nthies@cfbroward.org Phone: 954-761-9503 ext. 106 â â Nancy Thies, CAPÂ® Nancy Thies, Executive, Philanthropic Services, has more than 30 years of experience in philanthropic consultation, fund development, sales and marketing. She has held leadership positions with Holy Cross Hospital, United Way of Broward County and Miller Brewing Company. Nancy serves on the Executive Committee for the Friends of Birch State Park board and is a member of the Planned Giving and Estate Planning Councils of Broward. She is a graduate of the University of Wisconsin-Madison where she earned her bachelorâs degree in journalism, and has earned her Chartered Advisor in Philanthropy (CAP Â® ) designation from the American College of Financial Services. â Contact Email: nthies@cfbroward.org Phone: 954-761-9503 ext. 106 â â Read more Mary Margaret Toole Director, Philanthropic Services Mary Margaret Toole, Director of Philanthropic Services, worked in the financial services industry prior to joining the Community Foundation. She began her career in Birmingham, AL as a financial advisor for Raymond James. After working for several years in Birmingham, she made the move south to Fort Lauderdale and joined E*TRADE Financial as a consultant in their high-net-worth client group. She attended the University of Alabama, majoring in Finance with a specialization in Professional Sales. Contact Email: mmtoole@cfbroward.org Phone: 954-761-9503, ext. 116 â Mary Margaret Toole Mary Margaret Toole, Director of Philanthropic Services, worked in the financial services industry prior to joining the Community Foundation. She began her career in Birmingham, AL as a financial advisor for Raymond James. After working for several years in Birmingham, she made the move south to Fort Lauderdale and joined E*TRADE Financial as a consultant in their high-net-worth client group. She attended the University of Alabama, majoring in Finance with a specialization in Professional Sales. Contact Email: mmtoole@cfbroward.org Phone: 954-761-9503, ext. 116 â Read more Jessica Vones Director, Philanthropic Services Jessica Vones, Director of Philanthropic Services, spent 10 years with the Broward Health system, first as Director of Development for Children's Diagnostic & Treatment Center (CDTC) and later as Director of Major Gifts for the Broward Health Foundation. Previously, Jessica was the Community Relations Coordinator for the Miami Dolphins. Jessica is a Broward County native and a graduate of the University of Florida, where she received her bachelorâs degree in Recreation, Parks and Tourism with a concentration in Event Management and a minor in Business Administration. Jessica lives in Plantation with her husband and two young sons. Contact Email: jvones@cfbroward.org Phone: 954-761-9503 ext. 113 â Jessica Vones Jessica Vones, Director of Philanthropic Services, spent 10 years with the Broward Health system, first as Director of Development for Children's Diagnostic & Treatment Center (CDTC) and later as Director of Major Gifts for the Broward Health Foundation. Previously, Jessica was the Community Relations Coordinator for the Miami Dolphins. Jessica is a Broward County native and a graduate of the University of Florida, where she received her bachelorâs degree in Recreation, Parks and Tourism with a concentration in Event Management and a minor in Business Administration. Jessica lives in Plantation with her husband and two young sons. Contact Email: jvones@cfbroward.org Phone: 954-761-9503 ext. 113 â Read more Community Foundation Former Board Members Suzanne Y. Allen* W. George Allen* J. David Armstrong Jr. Elliot B. Barnett* Richard A. Berkowitz Francie Bishop Good Gary E. Bitner James J. Blosser* Nancy W. Blosser Holly Bodenweber Cynthia Borders-Byrd Francis B. Brogan, Jr. Anthony Brunson Gale M. Butler Doria M. Camaraza Rita Case Barbara R. Castell Margarita T. Castellon D. Keith Cobb Joan K. Crain Jan C. Crocker Jan R. Cummings Ward J. Curtis Jr.* James B. Davis Shaun M. Davis John B. Deinhardt* Elizabeth C. Deinhardt* Louise F. Dill James Donnelly Patricia Du Mont Katherine M. Eggleston Richard L. Engberg Leonard L. Farber* Bernardo B. Fernandez Jr. George E. Gadson Linda L. Gill Daniel E. Gordon Wilson B. Greaton Jr. Howard Greenberg Barbara Grevior William Gundlach* Steven J. Halmos Edward T. Hashek Frank E. Helsom Robert J. Henninger Jr. Frederick L. Hicks David W. Horvitz William D. Horvitz* Walter E. Howard Steven W. Hudson Marti Huizenga* Edwin A. Huston* R. Stephen Hyatt Joseph E. Jack* Alice Lucia Jackson Bacardi Jackson Nona L. Jones Janet C. Jordan Anne K. Joyner Robert B. Judd Thomas O. Katz Patricia R. Kearns Stewart R. Kester Sr.* James B. LaBate, Jr. Christine L. Lambertus Michael G. Landry Raymond H. Leightman Armando Leighton, Jr.* Jarett S. Levan Susie Levan* Alan J. Levy* Marsha O. Levy Herschell Gordon Lewis* Jack R. Loving Patricia L. Mahaney Mark R. Maller Peggy Hogan Marker Wendy Masi John C. McKeon Cori Flam Meltzer H. Kent Mergler Virginia I. Miller Frederick V. Miller* Joseph R. Millsaps* Albert J. Miniaci Karen Mitchell Curran Chris Mobley Maj. Gen. James W. Monroe Jan Moran Dev Motwani Thomas P. O'Donnell* A. Gordon Oliver* Thomas R. Oliveri Stacy Ostrau Charles L. Palmer Arlene Pecora David E. Ratcliffe Carlos J. Reyes Mary Riedel Leonard Robbins* Sally J. Robbins Ramon A. Rodriguez Roy L. Rogers Jacquelyn Rogow Brett A. Rose Barbara Roti Juliet Murphy Roulhac John W. Ruffin Jr.* Maria T. Sanjuan Tony Segreto William L. Shillington Christopher L. Smith William A. Snyder Raymond C. Southern George E. Sullivan William F. Sullivan Kim Sweers Paul Tanner J. Kenneth Tate Judith M. Thiel Norman D. Tripp* Leslie C. Tworoger Jose B. Valle* Elaine Vasquez Douglas J. Von Allmen John M. Walsh* Steven H. Woods* *Deceased Sign up for our newsletter to receive updates delivered to your inbox. Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. Please try again. This site was made possible thanks to support by: ABOUT OurÂ Story Board &Â Staff Financial Information Careers Board Portal ADVISORS How We Work With You Tools & Resources Professional Advisors Council Endowment Calculator Trust, Estate and Annuity Calculator DONORS Donor Portal BE BOLD Leadership Campaign Fundholder Resources Community Builders Legacy Society NONPROFITS Nonprofit Portal Broward Center for Nonprofit Excellence Apply for Grants Apply for Scholarships Brand Guidelines Â© Copyright 2024 by Community Foundation of Broward. Privacy Policy. CONTACTÂ US 910 East Las Olas Boulevard Suite 200 Ft. Lauderdale, FL 33301 954.761.9503 info@cfbroward.org Special Thanks This site was made possible by support from: Â© Copyright 2023 by Community Foundation of Broward. Privacy Policy."
    },
    {
      "url": "https://calendar.broward.edu/2024/11/fall_dance-concert.html",
      "text": "Fall Dance Concert Accessibility Options: Skip to Content Skip to Search Skip to Footer Institutional Accessibility Open Alternative Formats for this page × Current Students Community Faculty/Staff Alumni Give Login + Future Students Applicant Portal Current Students OneAccess Faculty/Staff OneAccess Locations Calendar Contact Us Apply Request Info Notifications Login Future Students Applicant Portal Current Students OneAccess Faculty/Staff OneAccess Academics Admissions & Financial Aid Student Resources About Notifications Degree Seeking Areas of Study (Pathways to Completion) Degrees vs. Certificates Honors College International Education Study Abroad Dual Enrollment for High School Students Summer Academy for Recent Grads General Education Digital Badges Non-Credit Workforce & Continuing Education Health Sciences Continuing Education Kids and Teens English Language / ESOL Career Focus Adult and Community Education (ACE) Industry Certifications Corporate Education Rapid Credentials Resources Academic Calendar College Catalog Course Finder Degree Finder Institutional Accessibility Professional Licensure Disclosure Registrar's Office Syllabus Library Textbook Archives Admissions Admissions Overview Apply Campus Tours Testing and Assessment Credit for Prior Learning Residency Special Admissions Bachelor's Programs Admissions Health Sciences Admissions International Students Music Admissions Transient Students Get a Quick Start Paying for College Tuition Overview Financial Aid Scholarships How to Pay / Cashier Financial Aid Forms Work Study Programs Veterans & Service Members Refunds Special Circumstances Foster Care & Homeless Youth Support Special/ Unusual Circumstances Apply Now Request Info Student Forms Academic Resources Academic Success Centers (ASC) Accessibility Resources BC Talks Bookstore Civic Literacy Requirement College Catalog Employment Solutions Internships Library Peer Mentoring Registrar's Office Study Abroad Syllabus Library Textbook Archives Transfer Services Student Achievement Initiatives (SAI) Registration Support Advising First Year Experience (FYE) Navigate Orientation (NSO) QLESS Financial Support Emergency Aid Health & Wellbeing College Read Mental and Emotional Wellbeing Seahawk Outreach Services (SOS) Dining Fitness Student Life Student Publications Submit Student Concern Technology Support Help Desk Portal Call: 954-201-7521 On-Campus Support Cybersecurity Awareness Hub Register Now Academic Calendar Student Forms Order Transcripts About Us Accreditation Broward College by the Numbers History Jobs (Talent and Culture, HR) Student Achievement Awards & Rankings Request Public Records Connect with Broward Contact Us Locations & Maps Directory Business with Broward Partnership Impact Facilities News and Media Our Leadership Board of Trustees Office of the President Senior Management Team Community Community Engagement Partnering with Broward Adult and Community Education (ACE) Health Sciences Simulation Center (HSSC) TRIO Visual & Performing Arts Accessibility Options: Skip to Content Skip to Search Skip to Footer Institutional Accessibility Open Alternative Formats for this page × Current Students Community Faculty/Staff Alumni Give Login + Future Students Applicant Portal Current Students OneAccess Faculty/Staff OneAccess Locations Events Contact Apply Request Info Notifications Login Future Students Applicant Portal Current Students OneAccess Faculty/Staff OneAccess Academics $_EscapeTool.xml($title) Admissions & Financial Aid $_EscapeTool.xml($title) Student Resources $_EscapeTool.xml($title) About $_EscapeTool.xml($title) Help Alternate Formats Calendar Home 2024 11 Fall Dance Concert Fall Dance Concert Join us for an exciting evening of dance as the Broward College Dance Ensemble proudly presents its Fall Dance Concert!  You won't want to miss this special event featuring new works by Broward College faculty, students, alumni, and guest choreographers.  Prepare to be entertained and inspired! Free Admisson Bailey Hall Related Events Details November 22 - 23, 2024 Audience Alumni Community Faculty International Staff Students Type Cultural Social Location Central Campus Tags AHCD Bailey Hall Dance Visual and Performing Arts Contact vpadept@broward.edu http://broward.edu/vpa Share Post to Facebook Tweet to Twitter Share to LinkedIn Pin to Pinterest Send to Email Save Add to Google Add to Outlook Add to Yahoo Download as iCal Related Events Back to Events Attention! This site is best viewed in a modern browser and is not compatible with Internet Explorer (IE). Please use another browser, such Chrome, Safari, Edge, or Firefox for the best user experience. I UNDERSTAND - take me to the site anyway Help Alternate Formats Notifications 954-201-7350 111 East Las Olas Blvd Fort Lauderdale, FL 33301 Contact Us Maps & Locations People + Board of Trustees Community/Public Directory Doing Business with BC Jobs Office of the President Information + Accreditation BC Online Calendar College Navigator Institutional Effectiveness Libraries Maps and Locations News and Media Policies and Procedures Privacy Policy Request Public Records Strategic Plan Get Help + Accessibility BC Concernline Campus Safety and Security Contact Us Seahawk Outreach Services (SOS) Office of the Student Ombudsperson/Submit a Student Concern Get Started + Request Information Apply Now Register for Classes © | Broward College does not discriminate on the basis of race, color, sex, gender, national origin, religion, age, disability, marital status, sexual orientation, gender identity, genetic information or other legally protected classification in its programs and activities. View our non-discrimination policies and Title IX policies ."
    },
    {
      "url": "https://www.broward.edu/about/leadership/presidents-newsletter/newsletters/march-2025.html",
      "text": "President's Message Accessibility Options: Skip to Content Skip to Search Skip to Footer Institutional Accessibility Open Alternative Formats for this page × Current Students Community Faculty/Staff Alumni Give Login + Future Students Applicant Portal Current Students OneAccess Faculty/Staff OneAccess Locations Events Contact Apply Request Info Notifications Login Future Students Applicant Portal Current Students OneAccess Faculty/Staff OneAccess Academics Admissions & Financial Aid Student Resources About Notifications Degree Seeking Areas of Study (Pathways to Completion) Degrees vs. Certificates Honors College International Education Study Abroad Dual Enrollment for High School Students Summer Academy for Recent Grads General Education Digital Badges Non-Credit Workforce & Continuing Education Health Sciences Continuing Education Kids and Teens English Language / ESOL Career Focus Adult and Community Education (ACE) Industry Certifications Corporate Education Rapid Credentials Resources Academic Calendar College Catalog Course Finder Degree Finder Institutional Accessibility Professional Licensure Disclosure Registrar's Office Syllabus Library Textbook Archives Admissions Admissions Overview Apply Campus Tours Testing and Assessment Credit for Prior Learning Residency Special Admissions Bachelor's Programs Admissions Health Sciences Admissions International Students Music Admissions Transient Students Get a Quick Start Paying for College Tuition Overview Financial Aid Scholarships How to Pay / Cashier Financial Aid Forms Work Study Programs Veterans & Service Members Refunds Special Circumstances Foster Care & Homeless Youth Support Special/ Unusual Circumstances Apply Now Request Info Student Forms Academic Resources Academic Success Centers (ASC) Accessibility Resources BC Talks Bookstore Civic Literacy Requirement College Catalog Employment Solutions Internships Library Peer Mentoring Registrar's Office Study Abroad Syllabus Library Textbook Archives Transfer Services Student Achievement Initiatives (SAI) Registration Support Advising First Year Experience (FYE) Navigate Orientation (NSO) QLESS Financial Support Emergency Aid Health & Wellbeing College Read Mental and Emotional Wellbeing Seahawk Outreach Services (SOS) Dining Fitness Student Life Student Publications Submit Student Concern Technology Support Help Desk Portal Call: 954-201-7521 On-Campus Support Cybersecurity Awareness Hub Register Now Academic Calendar Student Forms Order Transcripts About Us Accreditation Broward College by the Numbers History Jobs (Talent and Culture, HR) Student Achievement Awards & Rankings Request Public Records Connect with Broward Contact Us Locations & Maps Directory Business with Broward Partnership Impact Facilities News and Media Our Leadership Board of Trustees Office of the President Senior Management Team Community Community Engagement Partnering with Broward Adult and Community Education (ACE) Health Sciences Simulation Center (HSSC) TRIO Visual & Performing Arts Accessibility Options: Skip to Content Skip to Search Skip to Footer Institutional Accessibility Open Alternative Formats for this page × Current Students Community Faculty/Staff Alumni Give Login + Future Students Applicant Portal Current Students OneAccess Faculty/Staff OneAccess Locations Events Contact Apply Request Info Notifications Login Future Students Applicant Portal Current Students OneAccess Faculty/Staff OneAccess Academics $_EscapeTool.xml($title) Admissions & Financial Aid $_EscapeTool.xml($title) Student Resources $_EscapeTool.xml($title) About $_EscapeTool.xml($title) Help Alternate Formats Home About Broward College Office of the President President's Newsletter March 2025 Broward College Update President's Message March 2025 To the Esteemed Faculty, Staff, Students, Alumni, Friends and Supporters of Broward College: Welcome to the new Broward College Update! This monthly newsletter will provide you with news and key updates across Broward College.  Our goal is to promote Broward College and all of the great things happening regularly with our students, faculty, staff, alumni and leadership.  Under the leadership of our District Board of Trustees, we will continue to transform the lives of all students and adult learners with an eye towards the future and I’m excited for what’s ahead! March 24th marked my first month as President and Chief Executive Officer of Broward College, and I continue to be excited and energized about the path ahead for the College. Being part of the Seahawk Nation has been terrific – it is everything I thought it would be, and so much more! We are all partners on this journey toward making Broward College the number one destination for academic excellence , and as part of that, I will be providing regular updates to share news about the College. I want everyone in the Seahawk family to hear success stories about great programs, high-achieving students, awards that we have received and our accomplished alumni.  As I continue my listening sessions around the College, I’ve heard a very clear uniform message to better tell our story and promote all aspects of the College.  I’ve heard your feedback and I’m taking action! As you know, I hit the ground running on Day 1, and those efforts haven’t subsided as I continue engaging with students, faculty and staff across our three campuses. In fact, this week I participated in three student “meet and greet” events – South, Central and North campuses – where I talked directly with students to get their thoughts and ideas about our College, what we’re doing right and what we could be doing better. Earlier in the week, I conducted my first media interview with our student-run newspaper, The Observer , surrounded by students as I answered meaningful questions from our student reporters. What I have already seen is that our faculty and staff are dedicated while ensuring our students receive a high-quality education, and that our students are already accomplished in so many ways as they work to fulfill their dreams. But I know we can do even better, and my mission is to take Broward College to the next level, whether that’s updating our academic offerings to meet the challenges of tomorrow or upgrading our facilities to provide the best learning environments for our students. As the legislative session continues in Tallahassee, I want to assure you that our District Board of Trustees has tasked me securing more appropriations for the College, including strongly advocating for the remaining $15 million needed for buildings 56 and 57 on our North Campus, along with a separate allocation that supports the entire Florida College System.  As you know, the appropriation for buildings 56 and 57 would allow us to develop a state-of-the-art STEM, Health Sciences and Nursing complex that will modernize and expand the College's infrastructure.  This project will enhance the College's academic offerings, attract and retain students and faculty and address workforce gaps in the IT and health care sectors. While in Tallahassee, I met with dozens of legislators and key partners promoting the achievements of the College, including huddling with faculty who were also at the Capitol. We conveyed our commitment to student success, serving more than 51,000 students annually in a diverse range of academic programs across eight pathways. We also shared with our legislators some of our honors and accolades, including that our College was ranked number one in least debt acquired by students in Southern Regional Colleges in 2023 by U.S. News & World Report and was ranked in the top five colleges in the nation in 2023 by the Aspen Institute and recognized again in 2025 by the Aspen Institute as a semi-finalist. Working with our District Board of Trustees, my desire is for Broward College to remain a perennial Top 5 college in the nation! In short, the future is bright, and I am honored to be working alongside you as, together, we make Broward College the number one destination for academic excellence . As always, please feel free to contact me directly at officeofthepresident@broward.edu . Go Seahawks! Torey Alston President and CEO Read More Board Action The following are agenda items approved by the Broward College District Board of Trustees at its March 11, 2025, regular meeting. The Board authorized a letter of intent to negotiate a five-year lease with Battersby Golf to operate and manage the golf driving range and instruction center on North Campus. Battersby will also spend nearly $130,000 on improvements to the range. The Board also approved an agreement with Render Safe Inc. to provide two 40-hour courses on advanced investigative techniques of human trafficking crimes, approved by the Florida Department of Law Enforcement. This aligns with the College’s ongoing efforts to increase education and awareness about human trafficking in South Florida. In arts and entertainment news, the Board approved an agreement with the Chopin Foundation of the United States, Inc. to provide a recital as part of the Rosemary Duffy Larson Concert Series. The performance, designed to enhance the cultural offerings of the Visual & Performing Arts Department, took place on March 22 at Bailey Hall. To view the recording for this meeting, go HERE . To read the full agenda, go HERE . Read More Student Spotlight This month’s student spotlight focuses on Zachary Whalen , President of the Student Government Association at the A. Hugh Adams Central Campus in Davie. Where are you from originally? Living my entire life so far in Fort Lauderdale, I am a Broward County native through and through. What's your major? I am a high school senior at the College Academy at Broward College about to graduate at the end of the Spring 2025 semester with my Associate of Arts degree in the business pathway. What is your ultimate professional goal? To own or directly support social enterprises that improve our communities and the environment. What advice would you give to incoming students? To get the most value out of your time here at Broward College, maximize your time outside of the classroom and involve yourself in our rich community. By actively joining clubs on campus, getting to know your professors through office hours, and seeking out mentors to help you navigate school and life challenges, you will be best positioned to capitalize on the opportunities that Broward College offers. Use Broward College as a time to explore your interests and the kind of person you strive to become. What was the best part about being a BC student? Because the institution caters to such a diverse student population, the best part about being a student at Broward College was the flexibility. With a myriad of courses being offered at all times of the day, students can shape their schedules according to their lifestyles, interests and responsibilities. For me, my schedule allowed me to commit myself to representing my peers in our SGA while still having time to socialize and play sports with friends. What's one important thing you learned outside the classroom while at BC? One thing that has defined my time outside of the classroom at Broward College is the importance of building a strong network of peers and mentors. These valuable people remind you of your worth when times get hard and encourage you to take on new challenges. If you would like to nominate a student to be featured, please email us at mediarelations@broward.edu Read More Faculty/Staff Spotlight This month’s faculty/staff spotlight focuses on Donna Numeroff , an adjunct math professor who has been with the College for 31 years. Numeroff is also a dual enrollment math professor for the College at Marjory Stoneman Douglas High School. Professor Numeroff taught President Alston while a student in Broward County Public Schools. What drew you to becoming an educator? I was a software engineer upon graduating college. After a few years, I realized that working in front of a computer was too isolating for me. With my love for math I felt that teaching would give me a greater sense of purpose and fulfillment. Being a life-long learner, I really enjoy the educational atmosphere at both the high school and college levels. I like taking difficult topics and simplifying them in a way that students can understand them. That “ah – ha” moment by students never gets old. What is the best part of being a faculty member at Broward College? I enjoy working with college students to assist them achieve their educational goals toward their chosen profession. Having the flexibility to teach in the evenings works well with my schedule. Evening classes provide a diverse student population, from those who are going back to school to change careers to Dual Enrollment high school students striving to get college credits. This mix makes for wonderful class discussions. Every class has their own personality and is different each term. Since 2017, Broward College partnered with Broward County Public Schools to offer Dual Enrollment courses at certain high schools. Since I was already a Broward College faculty member, it was a no brainer to teach this course. It started with one class of 15 students taking college algebra. Now I teach three classes of between 20 – 25 students taking college algebra in the Fall semester and pre-calculus/algebra in the Spring semester. Students get six math college credits from Broward College before graduating high school. Working with the faculty members at Broward College to keep this partnership going has been a wonderful experience. What are the changes you’ve seen over the years in the classroom? The most prevalent change I have seen in the classroom is the student attachment to their cell phones. My mantra to the students before each class is “please put your cell phones away, take your ear pods out and get ready to learn.” What is your favorite food? Though I love many types of food, if I had to pick one it would be shrimp and pasta. What would you do if you won the lottery? Get a personal Pickleball coach and play Pickleball every day If you would like to nominate a faculty member to be featured, please email us at mediarelations@broward.edu Read More Alumni Spotlight This month’s alumni spotlight focuses on Tamecka McKay from the Class of 2012. If you ever needed an example of you should never give up, look no further than Tamecka McKay. The Broward College alumna, who is currently the Chief Information Officer for the City of Fort Lauderdale, took 10 years to complete her degree at Broward College. “I could only take one class at a time because of my responsibilities outside of school,” said McKay. Despite the long duration in obtaining her degree, the mother, wife, and full-time employee emphasized that the experience was valuable, allowing her to gain maturity and work experience alongside her education. Because of the focus and dedication, she was able to excel in each course she took and graduated with highest honors. Due to her academic excellence, she was invited to become a member of the Phi Theta Kappa Honor Society, a prestigious organization that recognizes high-achieving students and provides opportunities for leadership and personal growth. It was her unique story that led Broward College Alumni & Friends to invite her to come to back to campus and share her story and insight with today’s students. So, in February, she made her way to Central Campus where she spoke with students at a Career Conversations on an alumni panel. The event was moderated by Central Campus Student Government President Zachary Whalen and Senator Naima Allonce, who are both College Academy students. Responding to questions from the student leaders, Tamecka discussed her role as CIO overseeing technology infrastructure and digital services for the city, her previous positions in public service and her experience as a non-traditional student at Broward College. Tamecka emphasized the importance of students starting to network while in college leveraging expertise from professors and mentors. She encouraged them to participate in college activities to develop their communication and organizational skills and aspirations, noting this is especially important for students without role models in their immediate family. “Tamecka McKay is a prime example of how the flexibility of a Broward College education can pave the way toward remarkable success,” said Whalen. “Her determination to succeed despite adversity profoundly resonated with the student audience.” And she didn’t stop at Broward College – after earning her degree here, Tamecka went on to earn two master's degrees from Florida International University and is currently working toward her Doctorate in Public Administration at Nova Southeastern University. If you would like to nominate an alumnus to be considered for a Spotlight, please send an email to alumni@broward.edu Read More News & Events There’s always something exciting going on at Broward College’s campuses and locations. These are just some of the recent highlights of what our students, faculty and staff have been up to around the College: Earlier this month, Broward College partnered with other educational institutions in the South Florida Education Center and co-hosted the sold-out Artificial Intelligence Vocational, Instructional and Business Expo (AI V.I.B.E.) . The event was located Bailey Hall and Florida Atlantic University’s Liberal Arts Building. Open to students and the public, AI V.I.B.E. featured panels with industry leaders and elected officials to discuss AI in the workplace. The College’s student-run art and literary magazine Panku was recently honored as a REALM First Class magazine by the National Council of Teachers of English . The 2024 REALM contest included nominations for 422 student magazines spread across 46 states and five countries. Panku was among the 125 magazines that were awarded the contest’s highest distinction, REALM First Class. In January, the College hosted the 3rd Annual 5K Walk for Human Trafficking Awareness at the A. Hugh Adams Central Campus in Davie. This effort, which coincided with National Human Trafficking Prevention Month, was part of the College’s ongoing efforts to raise awareness about human trafficking. Related events included an in-person human trafficking information session and webinar featuring expert panelists. If you have something that is newsworthy happening on your campus, in your classroom or on stage, please let us know - send us an email at mediarelations@broward.edu Read More Did You Know...? Here are some fun facts and info about Broward College that you may not know. Broward College is one of the Top Ten Colleges in the nation after being named a semifinalist for the prestigious 2025 Aspen Prize and a Finalist with Distinction for the 2023 prize. Between June 2023 and July 2024, 231 police cadets at the Institute of Public Safety successfully passed the SOCE on the first attempt. After holding classes at temporary locations, the Sheldon J. Schlesinger Hall opened in 1979 as the first permanent building on the South Campus . It contained classrooms, student services, and offices. In fall 2025 Broward College will begin offering an Associate of Science degree in Applied Artificial Intelligence (AI) and a Technical Certificate - Artificial Intelligence Practitioner. Read More Calendar Find out what exciting things are happening across all of Broward College’s campuses. Follow Us On Social Apply Now - Start Your Education at Broward College Give Now - Help Support Broward College Attention! This site is best viewed in a modern browser and is not compatible with Internet Explorer (IE). Please use another browser, such Chrome, Safari, Edge, or Firefox for the best user experience. I UNDERSTAND - take me to the site anyway Help Alternate Formats Notifications 954-201-7350 111 East Las Olas Blvd Fort Lauderdale, FL 33301 Contact Us Maps & Locations People + Board of Trustees Community & Public Directory Doing Business with BC Jobs Office of the President Information + Accreditation BC Online Calendar College Navigator Institutional Effectiveness Libraries Maps and Locations News and Media Policies and Procedures Privacy Policy Request Public Records Strategic Plan Get Help + Accessibility BC Concernline Campus Safety and Security Contact Us Seahawk Outreach Services (SOS) Office of the Student Ombudsperson/Submit a Student Concern Get Started + Request Information Apply Now Register for Classes © | Broward College does not discriminate on the basis of race, color, sex, gender, national origin, religion, age, disability, marital status, sexual orientation, gender identity, genetic information or other legally protected classification in its programs and activities. View our non-discrimination policies and Title IX policies ."
    },
    {
      "url": "https://www.broward.edu/about/community/facility/",
      "text": "Facility Rentals Accessibility Options: Skip to Content Skip to Search Skip to Footer Institutional Accessibility Open Alternative Formats for this page × Current Students Community Faculty/Staff Alumni Give Login + Future Students Applicant Portal Current Students OneAccess Faculty/Staff OneAccess Locations Events Contact Apply Request Info Notifications Login Future Students Applicant Portal Current Students OneAccess Faculty/Staff OneAccess Academics Admissions & Financial Aid Student Resources About Notifications Degree Seeking Areas of Study (Pathways to Completion) Degrees vs. Certificates Honors College International Education Study Abroad Dual Enrollment for High School Students Summer Academy for Recent Grads General Education Digital Badges Non-Credit Workforce & Continuing Education Health Sciences Continuing Education Kids and Teens English Language / ESOL Career Focus Adult and Community Education (ACE) Industry Certifications Corporate Education Rapid Credentials Resources Academic Calendar College Catalog Course Finder Degree Finder Institutional Accessibility Professional Licensure Disclosure Registrar's Office Syllabus Library Textbook Archives Admissions Admissions Overview Apply Campus Tours Testing and Assessment Credit for Prior Learning Residency Special Admissions Bachelor's Programs Admissions Health Sciences Admissions International Students Music Admissions Transient Students Get a Quick Start Paying for College Tuition Overview Financial Aid Scholarships How to Pay / Cashier Financial Aid Forms Work Study Programs Veterans & Service Members Refunds Special Circumstances Foster Care & Homeless Youth Support Special/ Unusual Circumstances Apply Now Request Info Student Forms Academic Resources Academic Success Centers (ASC) Accessibility Resources BC Talks Bookstore Civic Literacy Requirement College Catalog Employment Solutions Internships Library Peer Mentoring Registrar's Office Study Abroad Syllabus Library Textbook Archives Transfer Services Student Achievement Initiatives (SAI) Registration Support Advising First Year Experience (FYE) Navigate Orientation (NSO) QLESS Financial Support Emergency Aid Health & Wellbeing College Read Mental and Emotional Wellbeing Seahawk Outreach Services (SOS) Dining Fitness Student Life Student Publications Submit Student Concern Technology Support Help Desk Portal Call: 954-201-7521 On-Campus Support Cybersecurity Awareness Hub Register Now Academic Calendar Student Forms Order Transcripts About Us Accreditation Broward College by the Numbers History Jobs (Talent and Culture, HR) Student Achievement Awards & Rankings Request Public Records Connect with Broward Contact Us Locations & Maps Directory Business with Broward Partnership Impact Facilities News and Media Our Leadership Board of Trustees Office of the President Senior Management Team Community Community Engagement Partnering with Broward Adult and Community Education (ACE) Health Sciences Simulation Center (HSSC) TRIO Visual & Performing Arts Accessibility Options: Skip to Content Skip to Search Skip to Footer Institutional Accessibility Open Alternative Formats for this page × Current Students Community Faculty/Staff Alumni Give Login + Future Students Applicant Portal Current Students OneAccess Faculty/Staff OneAccess Locations Events Contact Apply Request Info Notifications Login Future Students Applicant Portal Current Students OneAccess Faculty/Staff OneAccess Academics $_EscapeTool.xml($title) Admissions & Financial Aid $_EscapeTool.xml($title) Student Resources $_EscapeTool.xml($title) About $_EscapeTool.xml($title) Help Alternate Formats Home About Broward College Community Facility Rentals Facility Rentals and Reservations Looking for a special place to hold your next event? Look no further. Whether it is a small, informal get-together or a large, extravagant ceremony, Broward College has a facility that is perfect for your next occasion. Check for availability, rates, insurance requirements, and any restrictions. Contact the listed person to make your reservation. Bailey Hall Bailey Concert Hall can provide a unique setting for your next event. We offer a 1,081-seat full-service theatre, including an in-house box office. Contact This facility is currently unavailable. Tigertail Lake Recreational Center Broward College's watersports, sailing, climbing, challenge course/teambuilding facility, and full-service conference center. Please visit the Tigertail website for more information. Address Box Office Hours Contact Location 580 Gulfstream Way Dania Beach, FL 33304 Box Office Hours Sunday Monday Tuesday Wednesday Thursday Friday Saturday 9 a.m. - 5 p.m. 9 a.m. - 5 p.m. 9 a.m. - 5 p.m. 9 a.m. - 5 p.m. 9 a.m. - 5 p.m. 9 a.m. - 5 p.m. 9 a.m. - 5 p.m. Contact Natalie Justice Manager Rentals www.tigertaillake.com Classrooms Please open, type, print, sign, and send the original Facility/Equipment Request Form (PDF) to the appropriate campus for processing two weeks before the event. Central Campus Thea Apostol Office of the Dean of Business Affairs 3501 Davie Road Davie, FL 33314 954-201-6624 centralfacilities@broward.edu North Campus Veronika Fiore Office of the Dean of Business Affairs 1000 Coconut Creek Blvd. Coconut Creek, FL 33066 954-201-2402 northfacilities@broward.edu South Campus Carol Nohan Office of the Dean of Business Affairs 7200 Pines Blvd. Pembroke Pines, FL 33028 954-201-8001 southfacilities@broward.edu Willis Holcombe Center Oscar Silva Center Manager Building 33 111 East Las Olas Blvd. Fort Lauderdale, FL 33301 954-201-8803 miramarfacilities@broward.edu Pines Center Oscar Silva Center Manager 16957 Sheridan Street Pembroke Pines, FL 33331 954-201-8803 miramarfacilities@broward.edu Miramar West Center Oscar Silva Center Manager 1930 SW 145th Avenue Miramar, FL 33027 954-201-8803 miramarfacilities@broward.edu Weston Center Oscar Silva Center Manager 4205 Bonaventure Blvd. Weston, FL 33332 954-201-8803 miramarfacilities@broward.edu Attention! This site is best viewed in a modern browser and is not compatible with Internet Explorer (IE). Please use another browser, such Chrome, Safari, Edge, or Firefox for the best user experience. I UNDERSTAND - take me to the site anyway Help Alternate Formats Notifications 954-201-7350 111 East Las Olas Blvd Fort Lauderdale, FL 33301 Contact Us Maps & Locations People + Board of Trustees Community & Public Directory Doing Business with BC Jobs Office of the President Information + Accreditation BC Online Calendar College Navigator Institutional Effectiveness Libraries Maps and Locations News and Media Policies and Procedures Privacy Policy Request Public Records Strategic Plan Get Help + Accessibility BC Concernline Campus Safety and Security Contact Us Seahawk Outreach Services (SOS) Office of the Student Ombudsperson/Submit a Student Concern Get Started + Request Information Apply Now Register for Classes © | Broward College does not discriminate on the basis of race, color, sex, gender, national origin, religion, age, disability, marital status, sexual orientation, gender identity, genetic information or other legally protected classification in its programs and activities. View our non-discrimination policies and Title IX policies ."
    },
    {
      "url": "https://centurionbanquethall.com/contact/",
      "text": "Contact Us - Centurion Banquet Hall Home About Us Services Birthday Parties Sweet 16 / Quinceañera First Communion Bar/Bat Mitzvah Baby Shower Corporate Events Funeral / Memorial Weddings Anniversaries Holiday Parties Other Special Occasions Gallery Contact Us Reservations 224-500-8679 Get in touch Contact Us Centurion Banquet Hall Get in touch with Centurion Banquet Hall for all your event needs. Whether you're planning a wedding, corporate event, or special celebration, our team is here to assist you. Fill out the form or contact us directly for more information. We look forward to making your event unforgettable! Reservations 224-500-8679 Email Info info@centurionbanquethall.com Address 3315 Milwaukee Ave, Northbrook, IL 60062 Get in touch CONTACT First Name Last Name Phone Number Event Type Guest Count - Select - 25 to 120 120 to 350 350+ Email Event Date Event Time - Select - 8 am to 4 pm 6 pm to 1 am Additional Comments How did you hear about us? - Select - Google Word of Mouth Other Submit Each of our guest rooms feature a private bath, wi-fi, cable television and include full breakfast. Reservation 855 100 4444 Call us, it's toll-free. Rooms & Suites Hotel Booking Form Check in Check out Adults 1 Adult 2 Adults 3 Adults 4 Adults Children 1 Children 2 Childrens 3 Childrens 4 Childrens Check Availability The Cappa Explore Home About Us services Gallery Contact Us Contact 3315 Milwaukee Ave, Northbrook, IL 60062 224-500-8679 info@centurionbanquethall.com © 2025 Centurion Banquet Hall"
    },
    {
      "url": "https://www.broward.edu/baileyhall/",
      "text": "Bailey Hall at Broward College Accessibility Options: Skip to Content Institutional Accessibility Open Alternative Formats for this page × Events History of Bailey Hall Technical Donate Donate Events History of Bailey Hall Technical Help Alternate Formats Welcome to Bailey Hall Bailey Hall is a multilevel performing arts center on the Central Campus of Broward College that provides events for education, conversation and entertainment. Home baileyhall Upcoming Events See All Events Parking Bailey Hall is accessible from Davie Road and College Avenue. Primary parking is in the south lot by Bailey Hall. Additional parking is available in the parking garage. Parking at Bailey Hall is complimentary. Bailey Hall Policies To help everyone enjoy the events in Bailey Hall, we ask that patrons please adhere to the following policies: Latecomers will be seated at the discretion of management. Silence all electronic devices prior to entering the theater. No food or drink in the theater. Bottled water is allowed. Any device that makes excessive noise will not be allowed (ie. air horns, whistles...) No pets Contact Us 3501 Davie Rd, Davie, FL 33314 baileyhall@broward.edu Home of Broward College's Visual & Performing Arts Learn More Attention! This site is best viewed in a modern browser and is not compatible with Internet Explorer (IE). Please use another browser, such Chrome, Safari, Edge, or Firefox for the best user experience. I UNDERSTAND - take me to the site anyway © | Broward College does not discriminate on the basis of race, color, sex, gender, national origin, religion, age, disability, marital status, sexual orientation, gender identity, genetic information or other legally protected classification in its programs and activities. View our non-discrimination policies and Title IX policies ."
    },
    {
      "url": "https://www.broward.edu/baileyhall/history.html",
      "text": "History of Bailey Hall Accessibility Options: Skip to Content Institutional Accessibility Open Alternative Formats for this page × Events History of Bailey Hall Technical Donate Donate Events History of Bailey Hall Technical Help Alternate Formats Ralph R. Bailey Hall Campus President A. Hugh Adams envisioned it as a premier cultural performance facility, superb educational center for the arts and a destination for entertainment and culture lovers from the tri-county area. Home baileyhall Bailey Hall History A History of Bailey Hall Groundbreaking for the Ralph R. Bailey Concert Hall, a $5.6 million performing arts facility, was on November 4, 1976. The facility was envisioned as a showplace center for cultural arts in western Broward County. The hall was named in honor of Mr. Bailey, a Hallandale engineer and real estate investor who had once owned the property on which the Golden Isles neighborhood was built. He sold it to developers in 1955. When Bailey died in 1961 he had no heirs to pass his assets on to, so he bequeathed 80 percent of his estate to projects supporting community improvement. The projects were to be selected by the personal representative of his estate, who also died shortly thereafter. The task of personal representative fell to Broward attorney James D. Camp Jr., who had never met Mr. Bailey, but who sought out friends of Mr. Bailey to see what selections he might have made. In addition to the funds for the construction of Bailey Hall, Mr. Bailey’s estate also benefited the Museum of Art and a scholarship fund was created in his name, supporting law students from Broward County studying at the University of Florida’s law school, along with other worthy causes. The Bailey estate’s first donation to Broward Community College was $525,000, followed by a later donation of $475,000 to provide seed money for the college for the 1,201-seat performing arts center. The Bailey estate’s contribution was matched with $2 million from the Community Educational Facilities Act of 1975, sponsored by Gov. Graham. Other funds came from the college and individual donors. Broward Community College’s third president, A. Hugh Adams, envisioned Bailey Hall as a showplace facility which would fill a huge cultural void in Broward County, particularly the rapidly growing southwest part of the county. Before the 1970s, Broward’s leading cultural arts facilities were in Fort Lauderdale: War Memorial Auditorium, with 2,100 seats, opened in 1950 and by 1970 was already looking dowdy. Just down Sandy Nininger Drive in Holiday Park was Parker Playhouse, at 1,167 seats a smaller performance venue, but a more opulent facility. Parker Playhouse opened on February 6, 1967. In addition to his aspirations for Bailey Hall as a premier cultural performance facility, President Adams also envisioned it as a superb educational center for the arts and a destination for entertainment and culture lovers from the tri-county area. Four dignitaries turned the earth at the groundbreaking ceremonies: Graham, honorary college trustee James D. Camp, Jr.; Florida Education Commissioner Ralph Turlington and Broward attorney Sheldon Schlesinger, who also served as chairman of the Broward Community College District Board of Trustees. The Fort Lauderdale architectural firm of William G. Crawford and Associates, who also designed the Community College of Broward College’s first seven buildings on Central, who handled the transition of the Downtown Center from a bank to an education complex, designed the Sea Ranch Lakes shopping center, and many of Broward County’s public schools, designed Bailey Hall. The center’s original anticipated completion date was September 28, 1978, but along the way, nearly anything that could go wrong did. Iron workers and truckers struck, rain delayed construction and construction materials were in short supply. After the center opened, problems continued; cracks appeared and leaks opened up. The problems occurred, the Miami Herald said, because of the center’s grand size and scope. :”Few universities, let alone community colleges, can boast of such a facility,” wrote the Herald’s Colleen Gallagher. The hall opened a year and a half later than anticipated, with a dedication gala on October 13, 1979. Gov. Bob Graham was the guest of honor for the ceremony; the evening’s entertainment was a star-spangled selection of popular and patriotic music. The community did embrace Bailey Hall and up to the point the Broward Center for the Performing Arts opened in February 1991, Bailey Hall reigned supreme. Inside Bailey Hall are the E. Virginia Leyland Curren Room and the James P. Howard Playbill Alley. The ashes of Mr. Howard, who worked in Bailey Hall as an employee and a volunteer after retirement, are stitched securely high into the drapery at Bailey Hall, and are not visible from the audience area, or on the stage. Mrs. Curren’s family donated $80,000 toward construction of the center. In 1981, the college received a $100,000 donation from the estate of Betty J. McMillion, an original member of the faculty. The donation, made in memory of her parents, purchased the world’s largest completely portable pipe and electronic organ, custom designed for Bailey Hall. The organ has more than 300 pipes and more than 40 speakers placed within the hall. The organ remains in Bailey Hall to this day. In the performing arts center’s first five years, more than 600,000 patrons viewed cultural arts programs there. That happened, in large part, because of the exhaustive variety of celebrities, luminaries and literary lions who visited there to entertain. Guests to grace our stage Tony Bennett The Boys Choir of Harlem Cab Calloway Chinese Magic Circus of Taiwan The Dalai Lama Ferrante & Teicher Mac Frampton The Martha Graham Dance Company Cary Grant Roosevelt (Rosey) Grier Harvard Glee Club Israeli Chassidic Festival Rev. Jesse Jackson Hal Linden Trini Lopez Yo-Yo Ma Johnny Mathis Maureen McGovern Preservation Hall Jazz Band Diana Rigg Cliff Robertson Nipsey Russell Doc Severinsen Mel Torme Forrest Tucker Contact Us 3501 Davie Rd, Davie, FL 33314 baileyhall@broward.edu Home of Broward College's Visual & Performing Arts Learn More Attention! This site is best viewed in a modern browser and is not compatible with Internet Explorer (IE). Please use another browser, such Chrome, Safari, Edge, or Firefox for the best user experience. I UNDERSTAND - take me to the site anyway © | Broward College does not discriminate on the basis of race, color, sex, gender, national origin, religion, age, disability, marital status, sexual orientation, gender identity, genetic information or other legally protected classification in its programs and activities. View our non-discrimination policies and Title IX policies ."
    },
    {
      "url": "https://calendar.broward.edu/2024/11/jazz_club.html",
      "text": "Bailey Hall Jazz Club Accessibility Options: Skip to Content Skip to Search Skip to Footer Institutional Accessibility Open Alternative Formats for this page × Current Students Community Faculty/Staff Alumni Give Login + Future Students Applicant Portal Current Students OneAccess Faculty/Staff OneAccess Locations Calendar Contact Us Apply Request Info Notifications Login Future Students Applicant Portal Current Students OneAccess Faculty/Staff OneAccess Academics Admissions & Financial Aid Student Resources About Notifications Degree Seeking Areas of Study (Pathways to Completion) Degrees vs. Certificates Honors College International Education Study Abroad Dual Enrollment for High School Students Summer Academy for Recent Grads General Education Digital Badges Non-Credit Workforce & Continuing Education Health Sciences Continuing Education Kids and Teens English Language / ESOL Career Focus Adult and Community Education (ACE) Industry Certifications Corporate Education Rapid Credentials Resources Academic Calendar College Catalog Course Finder Degree Finder Institutional Accessibility Professional Licensure Disclosure Registrar's Office Syllabus Library Textbook Archives Admissions Admissions Overview Apply Campus Tours Testing and Assessment Credit for Prior Learning Residency Special Admissions Bachelor's Programs Admissions Health Sciences Admissions International Students Music Admissions Transient Students Get a Quick Start Paying for College Tuition Overview Financial Aid Scholarships How to Pay / Cashier Financial Aid Forms Work Study Programs Veterans & Service Members Refunds Special Circumstances Foster Care & Homeless Youth Support Special/ Unusual Circumstances Apply Now Request Info Student Forms Academic Resources Academic Success Centers (ASC) Accessibility Resources BC Talks Bookstore Civic Literacy Requirement College Catalog Employment Solutions Internships Library Peer Mentoring Registrar's Office Study Abroad Syllabus Library Textbook Archives Transfer Services Student Achievement Initiatives (SAI) Registration Support Advising First Year Experience (FYE) Navigate Orientation (NSO) QLESS Financial Support Emergency Aid Health & Wellbeing College Read Mental and Emotional Wellbeing Seahawk Outreach Services (SOS) Dining Fitness Student Life Student Publications Submit Student Concern Technology Support Help Desk Portal Call: 954-201-7521 On-Campus Support Cybersecurity Awareness Hub Register Now Academic Calendar Student Forms Order Transcripts About Us Accreditation Broward College by the Numbers History Jobs (Talent and Culture, HR) Student Achievement Awards & Rankings Request Public Records Connect with Broward Contact Us Locations & Maps Directory Business with Broward Partnership Impact Facilities News and Media Our Leadership Board of Trustees Office of the President Senior Management Team Community Community Engagement Partnering with Broward Adult and Community Education (ACE) Health Sciences Simulation Center (HSSC) TRIO Visual & Performing Arts Accessibility Options: Skip to Content Skip to Search Skip to Footer Institutional Accessibility Open Alternative Formats for this page × Current Students Community Faculty/Staff Alumni Give Login + Future Students Applicant Portal Current Students OneAccess Faculty/Staff OneAccess Locations Events Contact Apply Request Info Notifications Login Future Students Applicant Portal Current Students OneAccess Faculty/Staff OneAccess Academics $_EscapeTool.xml($title) Admissions & Financial Aid $_EscapeTool.xml($title) Student Resources $_EscapeTool.xml($title) About $_EscapeTool.xml($title) Help Alternate Formats Calendar Home 2024 11 Bailey Hall Jazz Club Bailey Hall Jazz Club The Bailey Hall Jazz Club presents the Broward College Jazz Combos featuring the music of Miles Davis and Freddie Hubdard. All proceeds will support the Broward College Jazz program in its mission to educate upcoming jazz musicians. Light wine and refreshments will be served. Admission: $25 (100-person limit) Get tickets here ! Bailey Hall Related Events Details November 3, 2024 Audience Alumni Community Faculty International Staff Type Cultural Social Location Central Campus Tags AHCD Bailey Hall Music Visual and Performing Arts Contact 954-201-6843 vpadept@broward.edu http://broward.edu/vpa Share Post to Facebook Tweet to Twitter Share to LinkedIn Pin to Pinterest Send to Email Save Add to Google Add to Outlook Add to Yahoo Download as iCal Related Events Back to Events Attention! This site is best viewed in a modern browser and is not compatible with Internet Explorer (IE). Please use another browser, such Chrome, Safari, Edge, or Firefox for the best user experience. I UNDERSTAND - take me to the site anyway Help Alternate Formats Notifications 954-201-7350 111 East Las Olas Blvd Fort Lauderdale, FL 33301 Contact Us Maps & Locations People + Board of Trustees Community/Public Directory Doing Business with BC Jobs Office of the President Information + Accreditation BC Online Calendar College Navigator Institutional Effectiveness Libraries Maps and Locations News and Media Policies and Procedures Privacy Policy Request Public Records Strategic Plan Get Help + Accessibility BC Concernline Campus Safety and Security Contact Us Seahawk Outreach Services (SOS) Office of the Student Ombudsperson/Submit a Student Concern Get Started + Request Information Apply Now Register for Classes © | Broward College does not discriminate on the basis of race, color, sex, gender, national origin, religion, age, disability, marital status, sexual orientation, gender identity, genetic information or other legally protected classification in its programs and activities. View our non-discrimination policies and Title IX policies ."
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "text": "Contact Us: Get In Touch With Asian Paints for your Painting Needs Contact Us: We’d Love To Hear From You 16815 Popular searches Interior Paints Exterior Paints Shade cards SEARCH RESULTS {{searchItem.map.shadeCode}} {{searchItem.map.shadeFamilyName}}: {{searchItem.map.shadeName}} {{searchItem.map.title}} RELATED SEARCH NO MATCHES FOUND! Did you mean? {{spellCheck}} Log-In Hello! Hello! Signout en ar {{minicart.cartcount > 0 ? minicart.cartcount : 0}} ↻ Processing... You have {{minicart.cartcount}} items {{item[\"product\"][\"name\"]}} - + ₹ {{item[\"totalPrice\"][\"value\"]}} Total ₹ {{minicart.totalprice}} Checkout ↻ Menu PAINTS & COLOUR PAINTS & COLOUR Services Services WATERPROOFING WATERPROOFING INSPIRATION INSPIRATION Login/Register PAINTS & COLOUR All PAINTS & COLOUR EXPLORE COLOURS Colour Catalogue Home Colour Guide PAINT PRODUCTS Interior Paints Exterior Paints Waterproofing Wood Paints Metal Paints Undercoats RESOURCES Paint Budget Calculator Ideas Gallery Colour visualizer SERVICES Paint Store Near Me Book Painting Services Services All Services Beautiful Homes Painting Service Scib Stars WATERPROOFING All WATERPROOFING Bathrooms Terrace and Tanks Roof & Basement Interiors Tiling All Products INSPIRATION All INSPIRATION Get Inspired Paint calculator Gallery Colour Next Guides DecorPro Resources Colour Visualizer Ideas Gallery Please enter your mobile number To receive the dealer details on SMS Mobile * SUBMIT Get in Touch We’d love to hear from you Head Office Scib Chemical S.A.E 6th of October Cirt, 4th Industrial (1/3/B)B Tel:            (+202)38281090-99 Fax: (+202)38331271 Scib Paints Helpline* For enquiries, feedback and complaints please call on 16815 or write to us at info@scibpaints.com Mobile number +91 00:59 ↻ ↻ Need help with your painting needs? Fill the form below to book a free site evaluation by a Scib Paints Beautiful Homes Painting Service expert. Name Mobile Number +20 Governorate * Email By proceeding, you are authorizing Scib Paints and its suggested contractors to get in touch with you through calls, sms, or e-mail. Book an appointment ↻ Thank you! We value your interest in Scib Paints Beautiful Homes Service. We will get in touch with you shortly to schedule a visit by an expert. Try again! Oops! Something went wrong. We couldn't process your request. Please try again? Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Our Divisions More about Asian Paints Congratulations You have subscribed. Contact Us 16815 EMAIL ABOUT Research & Technology Careers Contact Us Certificates RESOURCES FAQs POLICIES Quality Policy Customer Policy Cookie Policy Environment Policy EHS Policy TOOLS Colour Catalogue Color with AP APP/Website​ COUNTRY EGYPT Country EGYPT India GLOBAL BANGLADESH MIDDLE EAST FIJI NEPAL SRI LANKA ETHIOPIA CONNECT DOWNLOAD OUR PAINTING APP CONNECT WITH US ©Scib Paints - All rights reserved Congratulations You have subscribed. Welcome User Login OR Continue as guest You have been successfully logged out Login An OTP has been sent to your registered mobile number and email id. 00:00 Resend By clicking submit, I agree to terms and conditions SUBMIT Register Please enter the 5 digit OTP sent via SMS to verify your mobile number! 00:00 Resend I agree to terms and conditions SUBMIT Please enter your mobile number To receive the dealer details on SMS SUBMIT Provide a delivary address Fullname* Email* Mobile* +91 Flat/House No/Floor* Colony/Street/Locality* Landmark City* Pincode* SUBMIT User already exist redirecting you for the login page Waterproofing Calculator Get an instant estimate Calculate now"
    },
    {
      "url": "https://dev1.broward.edu/about/community/trio/eoc.html",
      "text": "Educational Opportunity Center (EOC) at Broward College Accessibility Options: Skip to Content Skip to Search Skip to Footer Institutional Accessibility Open Alternative Formats for this page × Current Students Community Faculty/Staff Alumni Give Login + Future Students Applicant Portal Current Students OneAccess Faculty/Staff OneAccess Locations Events Contact Apply Request Info Updates Notifications Locations Events Contact Login Future Students Applicant Portal Current Students OneAccess Faculty/Staff OneAccess Academics Admissions & Financial Aid Student Resources About Updates Notifications Search Degree Seeking Areas of Study (Pathways to Completion) Degrees vs. Certificates Honors College International Education Study Abroad Dual Enrollment for High School Students Summer Academy for Recent Grads General Education Digital Badges Non-Credit Workforce & Continuing Education Health Sciences Continuing Education Kids and Teens English Language / ESOL Career Focus Adult and Community Education (ACE) Industry Certifications Corporate Education Rapid Credentials Resources Academic Calendar College Catalog Course Finder Degree Finder Institutional Accessibility Professional Licensure Disclosure Registrar's Office Syllabus Library Textbook Archives Admissions Admissions Overview Apply Campus Tours Testing and Assessment Credit for Prior Learning Residency Special Admissions Bachelor's Programs Admissions Health Sciences Admissions International Students Music Admissions Transient Students Get a Quick Start Paying for College Tuition Overview Financial Aid Scholarships How to Pay / Cashier Financial Aid Forms Work Study Programs Veterans & Service Members Refunds Special Circumstances Foster Care & Homeless Youth Support Special/ Unusual Circumstances Apply Now Request Info Student Forms Academic Resources Academic Success Centers (ASC) Accessibility Resources BC Talks Bookstore Civic Literacy Requirement College Catalog Employment Solutions Internships Library Peer Mentoring Registrar's Office Study Abroad Syllabus Library Textbook Archives Transfer Services Student Achievement Initiatives (SAI) Registration Support Advising First Year Experience (FYE) Navigate Orientation (NSO) QLESS Financial Support Emergency Aid Health & Wellbeing College Read Mental and Emotional Wellbeing Seahawk Outreach Services (SOS) Dining Fitness Student Life Student Publications Submit Student Concern Technology Support Help Desk Portal Call: 954-201-7521 On-Campus Support Cybersecurity Awareness Hub Register Now Academic Calendar Student Forms Order Transcripts About Us Accreditation Broward College by the Numbers History Jobs (Talent and Culture, HR) Student Achievement Awards & Rankings Request Public Records Connect with Broward Contact Us Locations & Maps Directory Business with Broward Partnership Impact Facilities News and Media Our Leadership Board of Trustees Office of the President Senior Management Team Community Community Engagement Partnering with Broward Adult and Community Education (ACE) Health Sciences Simulation Center (HSSC) TRIO Visual & Performing Arts Accessibility Options: Skip to Content Skip to Search Skip to Footer Institutional Accessibility Open Alternative Formats for this page × Current Students Community Faculty/Staff Alumni Give Login + Future Students Applicant Portal Current Students OneAccess Faculty/Staff OneAccess Locations Events Contact Apply Request Info Notifications Login Future Students Applicant Portal Current Students OneAccess Faculty/Staff OneAccess Updates Search Accessibility Chat Academics $_EscapeTool.xml($title) Admissions & Financial Aid $_EscapeTool.xml($title) Student Resources $_EscapeTool.xml($title) About $_EscapeTool.xml($title) Help Alternate Formats Accessibility Home About Broward College Community TRIO Educational Opportunity Center (EOC) Educational Opportunity Center (EOC) You Can. We can help. Thinking about going to college, technical school, or any other kind of postsecondary education? Not sure where to start? Need help understanding how to apply or how to pay for it? Educational Opportunity Center (EOC) can help. Our FREE services are designed to take the guesswork out of beginning or continuing your education. More education can mean more job opportunities, a faster climb up the career ladder, and a larger paycheck. Regardless of your age, it's never too late to complete the degree or training you've always wanted. We can help you to determine which college, university, technical, vocational, or career program is right for you. We can also assist with applying to your desired program, and with obtaining federal and state grants and/or private scholarship funding to help you pay for it. Ready to get started? All you have to do is complete a TRIO application today. After you complete the TRIO application, you will receive an email with a link to register for a TRIO workshop or schedule a one-on-one appointment. We look forward to working with you. Complete a TRIO Application Program Flyer (PDF) Services Offered Workshops Educational Mobile Unit One-on-one assistance TRIO Educational Mobile Unit No transportation? Not near our offices? No problem. We can come to you. Join us at one of our next Mobile Unit stops. If you are a community organization, school, company, etc. you can request the TRIO Educational Mobile Unit to attend your event . Priority will be given to: Organizations or events seeking to serve income-eligible, first-generation adult populations (ages 19 and older) TRIO EOC targeted zip codes in Broward County Track Mobile Unit Services, Eligibility and Resources Services & Eligibility Academic Services Financial Services Career Services The Educational Opportunity Center (EOC) is the fourth of eight federal TRIO programs and was authorized by the Higher Education Amendments of 1972. Broward College received a grant to administer the EOC program which opened its doors in 2017. The objective of the EOC program is to increase postsecondary education enrollment among Broward County adults. We work on behalf of all postsecondary institutions. We provide direct support and resources to assist Broward County adults with overcoming academic and financial barriers to beginning (or returning to complete) their postsecondary education. The program also provides services to improve the financial and economic literacy of participants, in order to improve their likelihood of success. Eligibility To participate in this FREE educational program, a potential program participant should meet the following criteria: Be a citizen or permanent resident of the United States (or provide documentation of intent to become a permanent resident) Be at least nineteen years old (maybe younger in special circumstances) Veterans are eligible at any age, provided all other criteria are met Express a desire to enroll in an adult education program or a program of postsecondary education Preference is given to prospective students whose parents have not completed a 4-year (bachelor's) degree and whose income falls within federal guidelines We provide the following academic services to assist participants enroll in postsecondary education: We can help you set and achieve your educational goals. We provide assistance with the completion of admissions applications for any college, university, technical, vocational, or career program in any location. We can help you to prepare for standardized testing that may be required for admission. We provide the following services to assist participants with matters related to their educational finances: We provide assistance with completing financial aid applications, and with finding additional sources of funding to pay for postsecondary education. We assist with resolving past issues that may affect eligibility, including Satisfactory Academic Progress issues and student loan default. We provide financial literacy information to increase participants' likelihood of future success. We provide the following services to aid in the career development of our participants: We provide college and career guidance and information. We assist with identifying the right postsecondary educational opportunity to meet your career goals. We can assist in the selection of a major to support your career interests. Contact Us Our team is here to assist with any questions. Email us today. We look forward to working with you. Contact TRIO Attention! This site is best viewed in a modern browser and is not compatible with Internet Explorer (IE). Please use another browser, such Chrome, Safari, Edge, or Firefox for the best user experience. I UNDERSTAND - take me to the site anyway Help Alternate Formats Notifications 954-201-7350 111 East Las Olas Blvd Fort Lauderdale, FL 33301 Contact Us Maps & Locations People + Board of Trustees Community & Public Directory Doing Business with BC Jobs Office of the President Information + Accreditation BC Online Calendar College Navigator Institutional Effectiveness Libraries Maps and Locations News and Media Policies and Procedures Privacy Policy Request Public Records Strategic Plan Get Help + Accessibility BC Concernline Campus Safety and Security Contact Us Seahawk Outreach Services (SOS) Office of the Student Ombudsperson/Submit a Student Concern Get Started + Request Information Apply Now Register for Classes © | Broward College does not discriminate on the basis of race, color, sex, gender, national origin, religion, age, disability, marital status, sexual orientation, gender identity, genetic information or other legally protected classification in its programs and activities. View our non-discrimination policies and Title IX policies ."
    }
  ]
}