{
  "fuentes": [
    {
      "url": "https://www.browncreekfarm.com/contact-us",
      "email": "browncreekfarm@outlook.com"
    },
    {
      "url": "https://www.brownfamilyproduce.com/about-us",
      "email": "jodi@brownfamilyproduce.com"
    },
    {
      "url": "https://store.brownsfoodco.com/pages/contact-us",
      "email": "info@brownscheese.com"
    },
    {
      "url": "https://guidetoflorida.com/oxford/food-drink/brown-and-brown-farms--country-store",
      "email": "directory@guidetoflorida.com"
    },
    {
      "url": "https://guidetoflorida.com/oxford/food-drink/brown-and-brown-farms--country-store",
      "email": "name@yoursite.com"
    },
    {
      "url": "https://www.brownfarmermedia.com/meet-the-team",
      "email": "deboraho@brownfarmermedia.com"
    },
    {
      "url": "https://www.brownfarmermedia.com/meet-the-team",
      "email": "info@brownfarmermedia.com"
    },
    {
      "url": "https://www.brownsorchards.com",
      "email": "info@brownsorchards.com"
    }
  ],
  "mails": [
    "browncreekfarm@outlook.com",
    "deboraho@brownfarmermedia.com",
    "directory@guidetoflorida.com",
    "info@brownfarmermedia.com",
    "info@brownscheese.com",
    "info@brownsorchards.com",
    "jodi@brownfamilyproduce.com",
    "name@yoursite.com"
  ],
  "nombre_sitio": "brownandbrownfarms.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.browncreekfarm.com/contact-us",
      "text": "CONTACT US | Browncreekfarm top of page HOME ABOUT US FARM FRESH EGGS CONTACT US More Use tab to navigate through the menu items. Brown Creek Farm CONTACT US Whether you have questions, are interested in our services, or just want to say hi, send us a message or give us a call and we will get in touch! ​ Alternatively, follow our journey on social media ​ 250-666-1169 We'll get back to you shortly! Submit Details Brown Creek Farm 250-666-1169 browncreekfarm@outlook.com Store Policy Shipping & Delivery Term & Conditions FAQ © 2023 by Brown Creek Farm. bottom of page"
    },
    {
      "url": "https://www.brownfamilyproduce.com/about-us",
      "text": "ABOUT US | Brown Family Farm | CSA Farm | Oak Park, MN top of page CSA WHAT WE GROW PRICING PICK UP SITES WHY US GALLERY ADD-ONS PORK HERITAGE HOGS SHOP THE FARM ABOUT US TESTIMONIALS SUSTAINABLE FARMING CERTIFICATIONS & ASSOCIATIONS FALL SALE BLOG ABOUT US A B O U T   U S We are a husband and wife run CSA Share farm, established in 2012 by Owner Ben Brown. We come from humble beginnings, starting our farm on just a few of acres of family land with a handful of seeds. We didn’t have any equipment, seeding trays, or even a tractor, but we made it work. ​ We are sustainably farming about 15 acres of land this 2024 season. We've got land at our farm that we work and then we also rent land from a neighbor for our sweet corn. ​ We started our farm by \"sprinkling seeds anywhere, anyone would let us\". Being first generational farmers means we didn't inherit equipment or land; we used what we could afford and grew slowly. ​ We used to farm 3 acres in Big Lake, 3 acres in Elk River, and another 5 acres in Zimmerman. Of course, it isn’t ideal to have to travel between fields, but we were adamantly working towards owning our farm. ​ WE BOUGHT OUR FOREVER FARM IN 2020. ​ Now we're farming our land here and we aren't traveling anywhere really. Our corn is next door basically. This is ideal for saving time, energy and money too. Literally, our family dream come true. ​ If you eat our food, you have a hand in what we create. Thank you for supporting us and our farming endeavors through our CSA program. We are so proud to grow for our community. Thank you for your encouragement and motivation! H O W   I T   A L L   B E G A N Ben & I met at Central Lakes College. He was going for a Horticulture degree and I was going for my Natural Resources degree. Fast forward through us finishing our degrees and getting married & starting our family, we knew what our calling was. ​ Ben has over 20 years of experience working for the neighbor’s farm, at just 33 years old. His experience has been crucial of course. Ben would help the Nelson's start the greenhouses for bedding plants and potted flowers. Then, transition into farm season with a variety of crops that they grew. A big part of his experience was being at the farmer’s markets. At a young age he was getting experience selling bedding plants and veggies at the St. Paul & Minneapolis Farmer's Markets. ​ Ben is the rock in our farm, without him, nothing would be possible! He brings his education and passion together in the fields, and even gets a little giddy when there is a cool cross pollination of colors in the winter squash. ​ Hi! I’m Jodi . I am the voice behind our website, our blog posts, and emails. During the harvest season, I enjoy washing, packing and delivering a great majority of your food. Being able to work with the beautiful bounty of the season is my passion! ​ I don’t come from a farming background. I grew up in Apple Valley and pursued a career in Natural Resources. Prior to starting our farm, I worked for the DNR in their specialty AIS (Aquatic Invasive Species) programs. ​ I was the program supervisor for the Brainerd Public school district’s afterschool Science and Nature Program. Through that program, I coordinated many projects with the Soil and Water Conservation District including taking the kids on field trips for fishing and entering an AIS poster contest that was shared throughout the state. We were raising crayfish and tadpoles in aquariums in my class, anything to do with bugs and dirt is my favorite! ​ This seems to be a perfect fit. Many of my soil sciences and aquatic biology classes have contributed to our understanding of watersheds, wells, surface/ ground water irrigation, and many other biological indicators that we are happy to have as tools on our farm. ​ Ben & I are happy to have the opportunity to pursue what we enjoy and sharing it with our 3 kids is very special! They understand a lot of complex natural relationships and enjoy digging and harvesting with us. We're very lucky in that they are so interested in what we're doing. They work on the farm a little bit to save for things they want and it's just such a joy as a parent to see your kids succeed and work hard. ​ W e are happily growing produce for our community and showing our kids what we think is really important in so many ways. Thank you for supporting our family farm! You know the expression: THEY GROW LIKE WEEDS. Thank you for the opportunity to grow for you this season!! ~The Brown Family OUR FARM 7526 160th Ave Oak Park, MN 56357 Phone: (952) 836-5263 Email: Jodi@brownfamilyproduce.com HELP TERMS FAQ CONTACT © 2024 Brown Family Farm. All rights reserved. bottom of page"
    },
    {
      "url": "https://store.brownsfoodco.com/pages/contact-us",
      "text": "Get In Touch – Brown’s Food Co. Skip to content Left Continue shopping Your Order You have no items in your cart You might like String Cheese 180 g KSh400.00 Add to cart One time delivery of Organic Milk - 4 bottles 1.6 litres KSh600.00 Add to cart Log in / Join FAQs Contact Facebook Instagram KSh0.00 Brown's Cheese Brown’s Dairy Brown’s Organic Brown’s Pizzas Delia’s Ice Cream Dips and Jams The Cracker Shack Grove+Meadow Bakery Seasonal Cheese Wheels + save on single use plastic use! Return Plastic Bags to our shops at Sarit, Yaya, or Village Market for recycling FOR NEXT DAY DELIVERY, PLEASE PLACE ORDERS BEFORE 4PM: MONDAYS - FRIDAYS. WE ARE CLOSED ON SUNDAYS. Get In Touch As a family-run business, we care about our customers We want to hear from you We’re a small family-run business. And even though we’ve grown over the years, our values remain the same: natural, wholesome food, support for local farmers and a personal touch. So if you have a question or idea or would just like to say hello, we’d love to hear from you. As a small team, we are busy, but we will aim to get back to all queries within 48 hours or give us a call at 0728 999 654 Name: Email: Phone: Message: Our Customers Love Us Glad to see you have a Organic cheese on the market finally plus the Organic cheddar is quite delicious. Pungent creamy depth of flavor. I’ve been a organic farmer for 40 years so it makes me happy to see small steps happening here. Chemical use us so out of control and zero accountability. Keep up the good work. STUART DICKSON CUSTOMER Morning, I have to congratulate you on your organic cheddar. I hate to say this but it is the one thing I always bring back from England as I struggle to find a tasty mature cheddar in Kenya. You have nailed it! Amanda Beak What a truly superb job! So impressed by your dedication and commitment to your craft and to Kenya. Onwards and upwards! Elizabeth Olepangi Farm This blue cheese is exceptional! Emma Childs Emmakoko D2, Your non dairy yoghurt Is to die for! I have nearly eaten a whole pot already. No strong taste of coconut. I will be needing a regular order. Thanks Emma Craig Back to the top Sun Power Products Ltd P O Box 41112 Nairobi Kenya 00100 T: +254 728999654 info@brownscheese.com Our Story Get In Touch FAQs Blog Deliveries and Subscriptions Facebook Instagram Copyright\n          © 2025 Brown’s Food Co."
    },
    {
      "url": "https://guidetoflorida.com/oxford/food-drink/brown-and-brown-farms--country-store",
      "text": "Brown & Brown Farms and Country Store - Guide to Florida www.guidetoflorida.com - Guide to Florida Search Home Best of Florida Best of Florida Results 2025 Best of Florida Results 2024 Best of Florida Results 2023 Best of Florida Results Best of Florida Print Annual 2024 Best of Florida Print Annual 2023 Best of Florida Print Annual Nominate a Business Vote for Your Faves How It Works Campaign Kit Stories Directory Browse Categories Browse Regions Big Bend Coastal Region Bradenton & Sarasota Region Central Panhandle Region Destin & Fort Walton Beach Region Florida Keys Region Greater Fort Lauderdale Region Greater Gainesville Region Greater Miami & Miami Beach Region Greater Orlando Region Heartland Region Jacksonville Metro & Beaches Region Lakeland & Polk County Region Nature Coast Region North Central Countryside Region Ocala, Lake & Sumter Region Palm Beach County Region Panama City & Panama City Beach Region Pensacola & Western Panhandle Region Port St. Lucie & Treasure Coast Region Southwest Florida Coast Region Space Coast Region St. Augustine Historic Coast Region St. Petersburg & Clearwater Peninsula Region Suwannee River Region Tallahassee Region List Your Business About Us Advertise Contact Us Member Login Menu Home Best of Florida Best of Florida Results 2025 Best of Florida Results 2024 Best of Florida Results 2023 Best of Florida Results Best of Florida Print Annual 2024 Best of Florida Print Annual 2023 Best of Florida Print Annual Nominate a Business Vote for Your Faves How It Works Campaign Kit Stories Directory Browse Categories Browse Regions Big Bend Coastal Region Bradenton & Sarasota Region Central Panhandle Region Destin & Fort Walton Beach Region Florida Keys Region Greater Fort Lauderdale Region Greater Gainesville Region Greater Miami & Miami Beach Region Greater Orlando Region Heartland Region Jacksonville Metro & Beaches Region Lakeland & Polk County Region Nature Coast Region North Central Countryside Region Ocala, Lake & Sumter Region Palm Beach County Region Panama City & Panama City Beach Region Pensacola & Western Panhandle Region Port St. Lucie & Treasure Coast Region Southwest Florida Coast Region Space Coast Region St. Augustine Historic Coast Region St. Petersburg & Clearwater Peninsula Region Suwannee River Region Tallahassee Region List Your Business About Us Advertise Contact Us Member Login Home United States Florida Oxford Food & Drink Brown & Brown Farms and Country Store Brown & Brown Farms and Country Store Share 2025 Best of Florida Regional Winner Produce Markets & Local Farms 13940 US-301, Oxford, Florida, 34484 Send Message 352-748-2085 Vote for Us! | Produce Markets & Local Farms Best of Florida Vote Confirmation × Don't show this confirmation for the next 24 hours First Name Last Name Email Address Save my information and enable one-click voting for future votes on this device. I want to receive the Guide to Florida newsletter. Please complete the reCAPTCHA challenge below. Cancel Submit Your Vote! You are voting with the email Click here to switch users. Close Overview Get Directions View On Larger Map Company Name Brown & Brown Farms and Country Store Visit Website https://brownandbrownfarms.com/ Online Social Profiles Phone Number 352-748-2085 Location 13940 US-301 Oxford , Florida , 34484 United States × Map View Get Directions Cancel FEATURED LISTINGS! Sweet As Cyn Coffee House & Donuts Callahan, FL 32011 Website 904-879-6698 FINS Seafood & Dive Bar Cape Coral,  33904 Website 239-984-5449 Forked-Personal Chef & Catering Davie,  33328 Website 954-254-9934 READ AND REAP! Barbecue That Speaks for Itself The Folks Making Fetch Happen! Fast Repairs. Smart Service. Zero Surprises. MORE TO EXPLORE! Best of Florida Voting Best Produce Markets & Local Farms in Florida Guide to Alabama Georgia Business Journal Guide to Florida Get the Newsletter! Click to Subscribe Guide to Florida Subscribe Submit Story Idea Contact Us 904-515-5640 Directory List Your Company Advertise Your Company Member Login Browse Categories Best of Florida Vote For Your Favorites Download Campaign Kit Nominate a Business How it Works × Member Login * Email Address * Password Need to retrieve your password? Click Here × Get the Newsletter! The security check was not completed successfully."
    },
    {
      "url": "https://www.brownfarmermedia.com/meet-the-team",
      "text": "Brown Farmer Media Group | Team top of page ABOUT ​ Brown Farmer Media Group, Inc. (BFMG) is a premier, full-service communications firm, specializing in elevating brands as well as providing media connections and strategic partnerships for emerging and established business leaders, corporations, and non-profits. BFMG establishes a legacy relationship with clients to provide a steady, sure climb to next level outcomes while creating a professional and rewarding experience for all involved. Our mission of solving problems, addressing issues, and meeting needs allow us to raise the profile of dynamic individuals and organizations while strengthening communities. BFMG has a standard of high-level performance with an emphasis on quality, not quantity. MEET THE TEAM Deborah O. Farmer President of Brown Farmer Media Group Inc., a full-service, Chicago & Atlanta based communications firm Deborah Olivia Farmer is president of Brown Farmer Media Group Inc., a full-service, Chicago-based communications firm. Established in 2014, the fast-growing firm provides strategic media advice and counsel to a select clientele that includes small businesses and entrepreneurs, faith-based and community organizations, media personalities and more throughout the Chicagoland area and nationwide. Deborah Olivia was born into a family that stressed loyalty to kin, community, church and country. With that mantra instilled in her from birth, she has made a conscious, persistent effort to use her talents and hard work to reach personal goals, while assisting others in achieving theirs. ​ Prior to forming her company, Deborah Olivia was named Director of Station Relations in 2006 at NBC5-TV Chicago, an NBC Universal owned and operated broadcast station. Serving as the link between the station and the community, she provided media exposure for hundreds of underserved, non-profit organizations across the city of Chicago and surrounding suburbs. Under her leadership, NBC5 sponsored several community initiatives focusing on health & wellness, youth & education, and arts & culture, including the Making A Difference Campaign, which raised awareness of those giving back to the community. ​ Read more... Dr. Carol L Adams, Ph.D President & CEO Urban Prescriptives (Consultant) Dr. Carol L. Adams is President of Urban Prescriptives, Inc., a consulting firm that specializes in program and organizational development for educational, social, cultural and philanthropic institutions.  This venture merges the diverse experiences that comprise her remarkable career as an applied sociologist, social activist, and change agent. Adams has astutely moved from theory to action in a number of key positions, implementing evidence-based practice and informing practice-based evidence in every one.  Among them: President and CEO of the DuSable Museum of African American History; Secretary of the Department of Human Services for the state of Illinois; Director of Executive Director of the House of Blues Foundation; Director of Resident Services and Programs for the Chicago Housing Authority; Director of Northeastern Illinois University’s Center for Inner City Studies; and Director of African American Studies at Loyola University. Urban Prescriptives focuses on organizational development in these critical areas: Ideation, Civic Engagement, Social Marketing, Corporate Social Responsibility, Evaluation, and Strategic Planning.  Collective Impact and Synergistic Planning models are the primary means through which organizations are advanced to increased innovation and effectiveness.  Clients include major universities, museums, governmental agencies, and non-profits. Adams’ branding campaigns are ubiquitous and include : “Du Something” for the DuSable Museum; “Bring It On Home” for the University of Chicago Obama Library campaign; “I’ve Got Next” for Next Level Health; “Don’t Shoot, I Wanna Grow Up” for Ceasefire; and “Be The Change” for the Chicago Police Department. Known for her development acumen, Dr. Adams has raised over $400 million for a variety of agencies and institutions, both public and private.  She is a thought leader frequently asked to serve as an advisor on public policy and civic engagement by legislators, corporate leaders, and governmental entities throughout the world.  Closer to home, she is the founder of the South Shore Works, a movement dedicated to transformational community economic development in her beloved South Shore neighborhood. Dr. Adams serves on the Board of the Association for the Advancement of Creative Musicians (AACM),  After School Matters, and the city of Chicago’s Department of Cultural Affairs and Special Events., among others. Her memberships include: the Conference of Minority Public Administrators, Quadrangle Club, the Association of African American Museums, The Chicago Network, Choose Chicago, The Economic Club, the UIC African American Leadership Council, and the American Alliance of Museums. Among her many awards and honors are: the Illinois Arts Council Governor’s Award in the Arts, the Outstanding Humanitarian Award from the NAACP, the YWCA of Metropolitan Chicago Leadership in Education Award, Illinois Board of Higher Education Community Service Award and the Tradition Keepers Award from The Chicago Association of Black Storytellers. She’s also been named to Ebony Magazine’s “Power 100 List,” Today’s Chicago Woman’s 100 Women of Influence and Crain’s “Who’s Who in Chicago” List. Liz Anderson Director of Video Content Creation and Community Outreach Liz Anderson, is known for her exceptional ability to capture significant moments through the lens of her camera. With a passion for videography, editing, and content creation, Liz embarked on her journey in 2013 when she acquired her first professional camera. Since then, Liz has carved a remarkable path in the industry, collaborating with a diverse clientele that includes well-known music artists, actors, actresses, TV stars, and independent artists. Her portfolio boasts an impressive range of projects, from capturing red carpet events to immortalizing the energy of concerts, conferences, and fashion shows. Some of the notable events Liz has covered include the Emmy Awards, BET Awards, Image Awards, Grammy Foundation, Essence Festival, TD Jakes' Mega Fest, AT&T, Verizon, Hip Hop Caucus Climate Change Tour, Latino Fashion Week, and many more. In 2018, Liz showcased her versatility by working alongside industry luminaries like Billy Dec, Waka Flocka Flame, London On DA Track, and others in the thrilling production \"Mollywood.\" Additionally, Liz contributed her expertise as a second AC for the pilot of the TV series, \"Conrad.\" Liz's commitment to professional growth and excellence led her to earn a Bachelor's degree in Radio-TV Broadcasting from Lewis University in 2019. In 2021, she furthered her education and expertise by obtaining a Master of Arts in Organizational Leadership, coupled with an Executive Coaching Certification. This unique blend of industry experience and academic accomplishment positions Liz as a valuable professional, enabling her to assist organizations, small businesses, and clients in promoting their branding and content creation needs. David Gethers Vice President of External Affairs & Strategic Partnerships (Dallas, Texas) David A. Gethers is Founder & CEO of David A. Gethers SPEAKS, LLC and Co-Founder and Vice-President of partnering and community engagement of, The 2Gethers Foundation. David A. Gethers is a dynamic and energetic speaker on topics such as Leadership, Cultural Relevancy, Decision Making, and more. David delivers transformational messages of empowerment and possibilities to diverse audiences. He is a compassionate and servant leader who reaches the hearts of his audience with his exceptional charge: live with impact, intention, and integrity. David is the former Vice-President of the Student Senate at Governors State University. A member of Manhood Development Camp, the former Youth Pastor at Nehemiah Christian Ministries and is involved in a host of others. As a well sought-after speaker, David has spoken at Operation Push, Illinois State Capital, New Faith International Ministries, and many other businesses and organizations. David earned a Bachelor of Arts in Interdisciplinary Studies from Governors State University. He is currently attending Olivet Nazarene University earning his Master’s in Ministry Leadership. He is an Associate Minister at Faith Movers Church, in University Park, IL. and resides in Crete, IL with his wife, Tiffany, and their three daughters Brittney, Victoria, and Davye. Josh Benson Vice President of Social Media and Content Marketing at BFMG Josh has over nine years of experience creating, implementing, and optimizing social media strategy for companies and brands. He has worked with some of the biggest influencers such as The Kardashians, Snoop Dogg and more. He has created photo and video content, from 15 second commercials to long form documentaries. When creating content, he comes from the mindset of making it through understanding analytics first, then creating something unique and trending. Josh has also created websites for charter schools, construction companies and more within the Chicago area. These websites are all designed to work responsively and intuitively for traffic driven from social media. Wendell Burts Community Affairs Director Wendell Burts serves as the Community Affairs Director at Brown Farmer Media Group, where he plays a pivotal role in bridging the gap between the firm and the community. With a passion for community engagement and a knack for building strong relationships, Wendell has successfully spearheaded numerous outreach initiatives. His notable projects include extensive work with the Chicago Fire Department, where he led outreach programs aimed at enhancing public safety awareness and fostering community trust. Additionally, Wendell has been instrumental in collaborating with the Lawndale Christian Development Center, driving initiatives that support community development and empowerment. Wendell's expertise extends to various other projects, where he has consistently demonstrated his ability to connect with diverse community members and stakeholders. His commitment to fostering positive change and his strategic approach to community affairs make him an invaluable asset to Brown Farmer Media Group. As the bridge between BFMG and the community, Wendell Burts ensures that the firm's projects resonate with and benefit the communities they serve, embodying the mission of Brown Farmer Media Group to drive meaningful impact and positive change. Jean A. Williams Print Journalist (Consultant) Jean A. Williams grew up in New Orleans, but relocated to Chicago after finishing college at Dillard University, where she earned a bachelor's degree in mass communication. She has largely worked as a writer and editor for newspapers, magazines, corporations and associations, but she also is a filmmaker (with an MFA in cinema directing from Columbia College) and designer of handmade jewelry, wall art, housewares, accessories and other products. As a print journalist, Ms. Williams has worked as a reporter and editor at the New Orleans Times-Picayune, Jet Magazine, the Chicago Sun-Times, and the ADA News. She wrote the nonfiction business memoir \"Sweet Expectations: Michele Hoskins' Recipe for Success,\" published by Adams Media in 2004. As a filmmaker, Ms. Williams has written, produced and directed three short films: \"Oh Brother, My Sister\"; “Ninth Grade Ned”; and “BARACKED.” Her short film \"Oh Brother, My Sister\" won the Lagniappe Award at the 11th New Orleans Film & Video Festival. A huge lover of books, she has served as board chair of the Children's Book Fair in Hyde Park and is working on a young adult novel. Visit her website: JeanWilliamsStudio.com Follow on social media: Instagram - @jean_williams_studio and @jean_the_creator Facebook - Jean Williams Studio Zvonimir Moric Social Media/Art Director (Consultant) A seasoned Art Director and UX/UI Designer with over 13 years of experience in many facets of design and the overall creative process. Worked in the Lightbank.com/Groupon.com offices for about 5 years and had the privilege to work closely with many of  the startups that were created through the Lightbank VC fund. Have a very strong understanding marketing, sales, design,  development, business strategy, raising capital, and team building. ​ I have a strong talent for building supportive environments that bring out the best in creative professionals. Fully capable of  managing multiple projects from concept to completion, according to client specifications in a high pressure, deadline driven environment. Specific areas of expertise include: user interface design, user experience design, branding & identity, marketing, business strategy, product design, investor pitch decks, and project management. Tamaka Stephens Special Events Director (Consultant) Tamaka Stephens is an upscale event planner and owner of TM Stephens Events & Designs, where she specializes in event management. For more than a decade, Tamaka has created sophisticated, timeless, and luxurious event experiences under her company's brand. Alexy Irving Marketing and Communications Specialist Alexy Irving is a social media and marketing specialist, and photographer. Alexy has worked with event venues, magazines, and other creative companies to elevate their presentation, visibility, and online presence.​ Ingrid Grimes-Myles Makeup Artist Ingrid Grimes-Myles is a renowned makeup artist based in Chicago, known for her role as Michelle Obama's makeup artist during key events including the 2008 presidential campaign and Obama's early presidency. A lifelong Chicagoan with a psychology degree from UIC, Grimes-Myles has also worked with numerous celebrities and politicians, enhancing her reputation as a skilled makeup professional, particularly praised for her work with eyebrows. Her deep-rooted connection with Michelle Obama began before Barack Obama's presidential campaign, reflecting a longstanding personal and professional relationship. Aaja Corinne Magee Media Communications Director (Consultant) At BFMG, Aaja is responsible for managing the company’s brand presence as well as developing key communication for the company, clients, and stakeholders. Prior to joining the team, Aaja worked in both the corporate and entrepreneurial sectors in the areas of branding, marketing, event coordination, operations, and visual presentation. Amer Gosby Public  Information Director Amer Goosby is a passionate leader with a love for fashion, the community, and events. She began her career as the PR Manager for Daniels Entertainment Group, a veteran public relations firm rooted in the entertainment industry. HOME OUR CAPABILITIES CONTACT ABOUT MEET THE FOUNDER MEET THE TEAM MEET OUR INTERNS PRESS VIDEOS GALLERY CAMPAIGNS BFMG NEWS CLIENT NEWS PRESS RELEASES More Use tab to navigate through the menu items. Contact us today to learn more about our customized plan to elevate your brand. ​ Brown Farmer Media Group, Inc. Chicago & Atlanta Locations deboraho@brownfarmermedia.com CHI: (773) 310-7701 ATL: ( 404) 277-8651 Send Thanks! Message sent. © 2020 by Brown Farmer Media Group, Inc. Experience by A'darah. bottom of page"
    },
    {
      "url": "https://www.brownsorchards.com",
      "text": "Brown's Orchards & Farm Market York… | Brown's Orchard & Farm Markets Crab & Peach Dinner Sat., August 16th 4-6pm (last day to reserve a seat is this Fri., Aug. 8th) Crab & Peach Dinner Details Today's Hours: 8am – 6pm Call us: 717-428-2036 Login Market Cafe Farm & Fun Weddings Catering Shop 0 Your Cart No items in cart. Start shopping now. Market Cafe Farm & Fun Weddings Catering Shop Cart 0 Today's Hours: 8am – 6pm Call us: 717-428-2036 WELCOME TO Brown’s Orchards & Farm Market It takes only one visit to feel like you’re part of the family and to know that your first visit won’t be your last. Wedding Website Peach Plum & Nectarine Harvest Schedule Join Our Email Newsletter Sign up for our email newsletters for what's new, specials. promotions and upcoming events Name Email Signup Brown's Newsletter Join Our Team Bakery Fundraiser 2025 Our own Peaches! Plums & Nectarines! LOCAL FARMERS & What We Grow Our own Peaches, Plums & Nectarines! Brown's harvests our own strawberries, cherries, peaches, nectarines, plums, and apples May through October. We also bring in produce from other local farmers. Local Harvest Schedule Your favorite Bakery keeps getting sweeter! Brown's Bakery Sugar Cakes, Whoopie Pies, Cherry Pudding and Apple Dumplings top the list of our customer favorites! And have you tried our Apple Cider Donuts?! You'll also find our team of cake decorators to be some of the best around. Cake Ordering Guide YES! we can still help you get married in 2025! Your Appley-Ever After... Brown's Orchard View Weddings Ask us about our Fall 2025 Wedding Special! 50 People for only $5000! Ceremony, Reception, Catered Meal, & Wedding Cake! Brown's offers beautiful orchard views at our tent wedding venue available May - October. We also offer catering, cakes & dessert bars, wedding favors, & hotel welcome gifts. Our petite wedding packages are great for an intimate, affordable celebration. Your Appley-Ever After starts at Brown's! Check out our wedding website here . Wedding Venue Info Custom Gift Giving Shop Gift Baskets Brown's online ordering makes entertaining and gift giving easy. Let us brighten someone's day with a Brown's gift basket filled with our own orchard fresh seasonal fruit and homemade bakery treats. Gift Baskets are delivered locally on Tuesdays & Fridays only. Buy Gift Baskets Now ABOUT US Family owned and operated for over 75 years Family values run through the very core of the Brown's Orchards experience, which has been owned and operated by three generations of the Brown family, all committed to home-grown excellence. Since 1948, Brown's has transformed from a small, simple farm and roadside stand into a 29,000 sq. ft. farm market and one of the region's favorite family destinations. The business is currently run by Mary Brown, wife of the late Dave Brown. Contact Us A Five Star Experience “Worth the visit!” Visiting the area and fell in love could have spent hours browsing and shopping! Sandra H. |  April 16, 2025 “Ten out of Ten!” I can't say enough good things about this place. No matter what you're in the mood for, they have it. Salty to sweet, and most of it home made! 10/10 William M. |  June 17, 2025 links Home Food Menus Events Market Contact Us Visit Us open hours Sun ... 8am – 6pm Mon ... 8am – 6pm Tue ... 8am – 6pm Wed ... 8am – 6pm Thu ... 8am – 6pm Fri ... 8am – 6pm Sat ... 8am – 6pm contact us 8892 Susquehanna Trail South, Loganville, PA 17342 GPS directions use: 254 S. Main St, Loganville, PA 17342 info@brownsorchards.com 717-428-2036 © 2025 Brown's Orchard & Farm Markets. All rights reserved. Terms of Service | Privacy and Data Usage Policy | Web Design York PA"
    }
  ]
}