{
  "fuentes": [
    {
      "url": "https://www.firstcallgolf.com/industry-news/release/2021-08-03/burnt-store-marina-country-club-welcomes-new-general-manager",
      "email": "rmyers@troon.com"
    },
    {
      "url": "https://burntoranges.org/contact-us/",
      "email": "board@burntoranges.org"
    },
    {
      "url": "https://burntoranges.org/contact-us/",
      "email": "volunteer@burntoranges.org"
    },
    {
      "url": "https://www.bsgac.org/dining/",
      "email": "lrouse@bsgac.org"
    },
    {
      "url": "https://www.bsgac.org/dining/",
      "email": "proshop@bsgac.org"
    },
    {
      "url": "https://www.cfmovers.com/burnt-store-marina/",
      "email": "cfmovers1@comcast.net"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "gabe@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "info@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "leadershipboard@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "olivia@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "oliviac@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "scott@journeysherwood.org"
    },
    {
      "url": "https://www.bsgac.org/contact/",
      "email": "lrouse@bsgac.org"
    },
    {
      "url": "https://www.bsgac.org/contact/",
      "email": "proshop@bsgac.org"
    },
    {
      "url": "https://burntstoremarinarealtygroup.com/marina-information/",
      "email": "julie@juliesolem.com"
    },
    {
      "url": "https://burntstoremarinarealtygroup.com/marina-information/",
      "email": "rgraves1@comcast.net"
    },
    {
      "url": "https://www.bsgac.org/request-membership/",
      "email": "lrouse@bsgac.org"
    },
    {
      "url": "https://www.bsgac.org/request-membership/",
      "email": "proshop@bsgac.org"
    }
  ],
  "mails": [
    "board@burntoranges.org",
    "cfmovers1@comcast.net",
    "gabe@journeysherwood.org",
    "info@journeysherwood.org",
    "julie@juliesolem.com",
    "leadershipboard@journeysherwood.org",
    "lrouse@bsgac.org",
    "olivia@journeysherwood.org",
    "oliviac@journeysherwood.org",
    "proshop@bsgac.org",
    "rgraves1@comcast.net",
    "rmyers@troon.com",
    "scott@journeysherwood.org",
    "volunteer@burntoranges.org"
  ],
  "nombre_sitio": "bsgac.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.firstcallgolf.com/industry-news/release/2021-08-03/burnt-store-marina-country-club-welcomes-new-general-manager",
      "text": "Burnt Store Marina CC names John Abbott as GM Skip to main content News GOLF INDUSTRY TFC / PR NEWSWIRE Industry AGM Business Links Living NGCOA VORTEX RAIN CHECK CAREERS Calendar Features COLUMNS DESIGN NOTES TFC INBOX LIFESTYLE EPSON TOUR THE FRIARS GOLF CLUB POLLS Podcasts Content Clubhouse Cookie Jar Golf Driver$ Golf Innerview ModGolf Videos Content Clubhouse Coach Mo Golf Show Up River Film Co. Events Archives Show Search Search Query Submit Search Industry News Burnt Store Marina Country Club welcomes new general manager Aug 03, 2021 LinkedIn Twitter Email Show more sharing options Share Close extra sharing options LinkedIn Twitter Email Copy Link URL Copied! Print Punta Gorda, Fla. (August 3, 2021) – Burnt Store Marina Country Club recently welcomed John Abbott as the club’s new general manager. Abbott will oversee all elements of the semi-private facility located in Punta Gorda, Florida including the club’s 27-hole executive golf course, the Linkside Café, member and guest service, as well as membership sales and marketing. Abbott has 20-plus years of golf and hospitality experience having most recently served as the head golf professional at Herons Glen Golf & Country Club in North Fort Myers, Florida since 2012. A native of Olney, Maryland, Abbott’s love for golf sprouted while a member of his high school golf team and has progressed from there. During his career, Abbott has served as an assistant golf professional, teaching professional, head golf professional and general manager. He has worked at public and private golf facilities in Maryland, Delaware and Florida. In addition to his golf industry experience, while living in the Washington D.C. area Abbott launched a successful contracting business and later opened a beverage retail business. “We’re delighted to welcome John to Burnt Store Marina Country Club and have him lead the club’s operations,” said Troon Director of Operations Zack Vervaecke, PGA.  “His knowledge and enthusiasm will be a great addition as we continue to elevate the country club experience.” Abbott has a degree in business administration from Frostburg State University in Frostburg, Maryland. Located on the Lee/Charlotte County line, Burnt Store Marina Country Club features a 27-hole executive golf course designed by Ron Garl and Mark McCumber. The 9-hole Heron, Osprey and Pelican courses meander through native woodlands with lakes and water features coming into play on 21 of the 27 holes. Burnt Store Marina Country Club is owned by the PGI Section 22 HOA and has a vibrant and active social calendar. The club’s Linkside Café is open to the public for lunch seven days a week, and open to members-only for dinner on Tuesday evenings. The club has a variety of golf and social memberships available for purchase. The Burnt Store Marina community is located on the east side of Charlotte Harbor, just 10 miles east of the Intra-Coastal Waterway and the Gulf of Mexico. The privately gated waterfront community is comprised of more than 1907 residences. Burnt Store Marina is a first-class yachting resort with 525 in-water slips, plus 450 dry docks. Honours Golf, the Birmingham, Alabama-based division of Troon, began managing Burnt Store Marina Country Club in June of this year. For more information on Burnt Store Marina Country Club, visit www.bsgac.org . About Honours Golf Headquartered in Birmingham, Ala., Honours Golf was founded on a vision to provide award-winning golf courses with unparalleled course conditions, hire dedicated team members who share a passion for golf, and deliver impeccable personalized service. As a result, Honours Golf has grown to become the Southeast’s leading golf course development and management company. In 2014, Honours Golf was acquired by Troon and operates as a subsidiary of the global brand. Honours Golf currently operates 23 award-winning daily fee, resort and private club facilities including the King & Bear at World Golf Village Resort in St. Augustine, Fla.; Reunion Golf & Country Club in Madison, Miss., Craft Farms Golf Resort and Peninsula Golf & Racquet Club in Gulf Shores, Ala. For more information on Troon’s Honours Golf Division, visit www.honoursgolf.com . About Troon Headquartered in Scottsdale, Ariz., Troon is the world’s largest golf management company providing services at 585-plus locations around the globe, including managing 630-plus 18-hole equivalent golf courses. In addition to golf, Troon specializes in homeowner association management, private residence clubs, estate management and associated hospitality venues. Troon’s award-winning food and beverage division operates and manages 620-plus food and beverage operations located at golf resorts, private clubs, daily fee golf courses and recreational facilities. With properties located in 45-plus states and 30-plus countries, Troon’s family of brands includes Troon Golf, Troon Privé, Troon International, Honours Golf, OB Sports, Indigo Golf Partners, CADDIEMASTER, True Club Solutions, Cliff Drysdale Tennis and RealFood Hospitality, Strategy and Design. Troon-affiliated properties include Indian Wells Golf Resort in Indian Wells, California; Yas Links Abu Dhabi in the United Arab Emirates; The Club at Savannah Harbor in Savannah, Georgia; and Lake of Isles in North Stonington, Connecticut. For additional news and information, visit www.Troon.com . Media Contact: Rob Myers Troon 480.477.0506 rmyers@troon.com Industry News LinkedIn Twitter Email Show more sharing options Share Close extra sharing options LinkedIn Twitter Email Copy Link URL Copied! Print 960 Morrison Drive, Suite 300, Charleston, South Carolina 29403 Copyright © 2025, The First Call, a division of Buffalo Groupe , LLC. All rights reserved. Who We Are About Us Media Kit Press Release Program Archives Support Subscribe Privacy Policy Terms of Use"
    },
    {
      "url": "https://burntoranges.org/contact-us/",
      "text": "Contact Us Skip to content Home Florida Afterburn Florida Afterburn Florida Afterburn Tickets Afterburn 2025 Theme Camp Application Afterburn 2025 Art Grant Application Afterburn 2025 Effigy Application About Us Contact Us News & Updates Home Florida Afterburn Florida Afterburn Florida Afterburn Tickets Afterburn 2025 Theme Camp Application Afterburn 2025 Art Grant Application Afterburn 2025 Effigy Application About Us Contact Us News & Updates Menu Get in touch with Burnt Oranges! Have a question, suggestion, or just want to say hello? We'd love to hear from you! Submit a request for contact form to the right or reach out via our social media channels. Your feedback helps us make Burnt Oranges and Afterburn even better. Let's connect! Email Name Address Message Submit Thank you! Your message has been sent. Unable to send your message. Please fix errors then try again. St Petersburg, Florida 33709 board@burntoranges.org volunteer@burntoranges.org Home Florida Afterburn About Us Contact Us News & Updates Home Florida Afterburn About Us Contact Us News & Updates This site was created with the Nicepage This site was created with the Nicepage"
    },
    {
      "url": "https://www.bsgac.org/dining/",
      "text": "LINKSIDE CAFE @ BSMCC - Burnt Store Marina CC Skip to primary navigation Skip to main content Book a Tee Time Facebook Facebook Burnt Store Marina CC HOME Home Employment Tee Times Golf Course Details Rates Forms & Policies Events Events at BSMCC Open to Public Calendar Membership LINKSIDE CAFE @ BSMCC Contact Us Menu HOME Home Employment Tee Times Golf Course Details Rates Forms & Policies Events Events at BSMCC Open to Public Calendar Membership LINKSIDE CAFE @ BSMCC Contact Us LINKSIDE CAFE HOURS OF OPERATION Monday – Saturday: 11AM-3PM Lunch Tuesdays & Fridays: 5PM-8PM Dinner Sunday: CLOSED Wednesday & Saturday: 5PM-8PM subject to availability Happy Hour Monday – Saturday 3pm-5pm HOURS ARE SUBJECT TO CHANGE. ANY QUESTIONS PLEASE CALL AHEAD. Reservations suggested for dinner or events Please Call and make reservations for parties of 6 or more Call 941-637-6405 Lunch Menus Dinner Menus Wine List Page Footer Privacy & Cookies: This site uses cookies. By continuing to use this website, you agree to their use. To find out more, including how to control cookies, see here: Cookie Policy About us 24315 Vincent Ave Punta Gorda, FL 33955 Admin Office: (941) 639-4151 lrouse@bsgac.org Golf Shop: (941) 637-1577 proshop@bsgac.org PUNTA GORDA WEATHER Burnt Store Marina CC | 24315 Vincent Ave Punta Gorda, FL 33955 |  (941) 639-4151 Copyright © 2025 Burnt Store Marina CC All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.cfmovers.com/burnt-store-marina/",
      "text": "Burnt Store Marina Movers"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "text": "Leadership Team — Journey Church New Here? Find Us Plan a Visit Leadership Team About Us Who We Are What We Believe Journey Kids Journey Youth Journey Women Journey Men Partners Next Steps Discipleship Bands Connection Card Serve Need Prayer? Journey Groups Be Baptized Membership at Journey Need Help? Summer at Journey Messages Give LiveStream New Here? Find Us Plan a Visit Leadership Team About Us Who We Are What We Believe Journey Kids Journey Youth Journey Women Journey Men Partners Next Steps Discipleship Bands Connection Card Serve Need Prayer? Journey Groups Be Baptized Membership at Journey Need Help? Summer at Journey Messages Give LiveStream Leadership Team New Here Find Us Plan a Visit Leadership Team Journey Church Staff Team Scott Edinger Lead Pastor scott@journeysherwood.org Olivia Pothoff Pastor of Worship & Care olivia@journeysherwood.org Gabe Nielsen Director of Journey Youth gabe@journeysherwood.org Olivia Cuddeford Director of Journey Kids oliviac@journeysherwood.org Journey Church Leadership Board The Leadership Board at Journey Church is made up of six members of the Journey Church family and the Lead Pastor. They are assigned to help guide, equip, and empower the pastors and staff at Journey Church to fulfill the mission and vision that God has uniquely given us. Our current Leadership Board members: Megan O’Connell, Jon Burgi, Lacey McNay, Ed Hatch, Amy Schlapper, Josh Thoreson. If you have any questions for the Leadership Board please email: leadershipboard@journeysherwood.org Back to Top Events Messages FOLLOWING JESUS TOGETHER Phone 503.610.0759 Email info@journeysherwood.org Gather 22689 SW Pine Street, Sherwood, OR Mail PO Box 322, Sherwood, OR 97140 Subscribe To Our Weekly Update Sign up with your email address to receive our weekly email updates. First Name Last Name Email Address Sign Up We respect your privacy. Thank you for signing up for our Weekly Update!"
    },
    {
      "url": "https://www.bsgac.org/contact/",
      "text": "Contact Us - Burnt Store Marina CC Skip to primary navigation Skip to main content Book a Tee Time Facebook Facebook Burnt Store Marina CC HOME Home Employment Tee Times Golf Course Details Rates Forms & Policies Events Events at BSMCC Open to Public Calendar Membership LINKSIDE CAFE @ BSMCC Contact Us Menu HOME Home Employment Tee Times Golf Course Details Rates Forms & Policies Events Events at BSMCC Open to Public Calendar Membership LINKSIDE CAFE @ BSMCC Contact Us Contact Us Email Lisa Rouse at: lrouse@bsgac.org Hours 9AM – 3PM Monday thru Friday Address 24315 Vincent Ave Punta Gorda, FL 33955 Phone Call the Golf and Gift Shop at(941) 637-1577 Call the office administration(941) 639-4151 Please use the form below to contact us! Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone * Comments Submit Page Footer Privacy & Cookies: This site uses cookies. By continuing to use this website, you agree to their use. To find out more, including how to control cookies, see here: Cookie Policy About us 24315 Vincent Ave Punta Gorda, FL 33955 Admin Office: (941) 639-4151 lrouse@bsgac.org Golf Shop: (941) 637-1577 proshop@bsgac.org PUNTA GORDA WEATHER Burnt Store Marina CC | 24315 Vincent Ave Punta Gorda, FL 33955 |  (941) 639-4151 Copyright © 2025 Burnt Store Marina CC All Rights Reserved. Powered by"
    },
    {
      "url": "https://burntstoremarinarealtygroup.com/marina-information/",
      "text": "Marina Information – Burnt Store Marina Ron Graves - Broker/Owner Direct: 239-848-6856 Email: rgraves1@comcast.net Julie Solem SFR & SRS - Realtor Direct: 763-370-3903 Email: julie@juliesolem.com Drop Anchor Timeless Treasures Await You menu Home Marina Information Medical Media Transportation Attractions Government Education Office Contacts MARINA INFORMATION Harbormaster Office 941-637-0083 Visit Website Safe Harbor Marinas 972-488-1314 Visit Website Fitness & Racquet Club 941-575-3260 Visit Website Cass Cay Restaurant & Bar 941-347-7148 Visit Website Linkside Café 941-637-6405 Visit Website Golf & Activities Club 941-639-4151 Visit Website Platinum Point Yacht Club 941-639-0733 Visit Website Pier One Yacht Sales 941-637-7788 Visit Website Marina Main Gate (24-hours) 941-639-8226 EMAIL Matecumbe Gate (Commercial) 941-639-1038 The Trading Post (Ship’s Store) 941-677-3137 Marina Dry Storage 941-639-0875 Golf & Gift Shop 941-637-1577 EMAIL Golf Cart Rentals (Florida Golf Carts Express, LLC) 941-889-8171 Visit Website The Beacon Monthly Community Newspaper Visit Website Map of Burnt Store Marina Click Image to View Full Size Condominiums Single Family Homes Villas Townhouses BURNT STORE MARINA REALTY GROUP 3190-C Matecumbe Key Road, Punta Gorda, FL 33955 Office: 941-621-4924 2025 © All Rights Reserved | Burnt Store Marina Realty Group Developed by SITESPRING"
    },
    {
      "url": "https://www.bsgac.org/request-membership/",
      "text": "Membership - Burnt Store Marina CC Skip to primary navigation Skip to main content Book a Tee Time Facebook Facebook Burnt Store Marina CC HOME Home Employment Tee Times Golf Course Details Rates Forms & Policies Events Events at BSMCC Open to Public Calendar Membership LINKSIDE CAFE @ BSMCC Contact Us Menu HOME Home Employment Tee Times Golf Course Details Rates Forms & Policies Events Events at BSMCC Open to Public Calendar Membership LINKSIDE CAFE @ BSMCC Contact Us Membership Welcome to the fun of being a BSMCC Member! Enjoy all the Activities, Classes, Social Life, Dining, Games and Golf at BSMCC. Help keep our Club vibrant with new members. You will enjoy the warm welcome and camaraderie of our members and staff. Membership is open to everyone wherever you live. Our Membership Year runs from Nov 1st to Oct 31st with renewals due by Oct 30th each year. Membership begins with a basic Social Membership to which you can add Annual Golf or Seasonal Golf Membership and Trail pass. The Club also offers a Gold Card Membership with a House Account as an option to any membership. A 6.5% sales tax are added to all membership fees. TRANSFER OF MEMBERSHIP: ( Click to view Guide to Transfers ) You may apply to the Club using the Transfer Form view as a PDF in a new tabto have your Membership transferred to a new owner of your property. Please return your membership cards with the form. New cards will be issued to the new owner. The new owner must come to the Administration office and file an application.  Each year thereafter they would need to renew the membership by October 30th. RENTAL UNITS: Owners of Rental Units may take out Social and Golf Memberships for their rental units. This will give Social Membership privileges to all who stay in the unit. If you add Golf Membership, it can only be used by a specified individual or couple during any one stay. The owners of rental units must register their tenants with the office and obtain temporary renter’s cards for the tenants using membership privileges during their stay. Rental Unit Owners may also fill out the Listing Application to list their unit in the Rental Listing on web page. This listing is a great place for people seeking a rental that will give them a chance to enjoy membership at Burnt Store Marina CC. Membership Categories & Privileges Social Membership provides for the members, their household and guests staying in their home. Golf Membership must be combined with a Social Membership . Golf Privileges are specific to the Golf Member. Use of the Clubhouse according to policies Eligibility for all Club Social Activities and Classes 15% Discount at Linkside Cafe (does not apply on food specials or special events) 15% Discount for Golf, Golf Carts, and Range Balls Discount on USGA Handicap Services Optional Gold Card Prepaid House Account for Members Gold Card establishes a prepaid house account giving the member the privilege of charging food and beverage at Linkside Café, Social Event sales in the Administration office, along with golf and merchandise in the Golf & Gift Shop. May not be used for postal and office services. You may use a credit card, check or cash to make a deposit to Gold Card accounts.  Deposits may be made anytime the Admin office is open. Funds in the Gold Card account will be carried over from one membership year to another. Golf & Gift Shop Merchandise and Linkside Cafe purchases. Office Services – Copies, Faxes, and Postal Services Web Site and Email Blasts Communications Games: Bocce Ball, Croquet, Bingo, Horseshoes, Bean Bags (Corn Hole), Trivia and much more! Eligibility for golf leagues, scrambles and most golf tournaments and events 7-day advance tee times for golf The best value is an Annual Golf Membership for Couples and Singles. We also offer Seasonal Golf Membership for play November 1st to April 30th. Golf Membership Privileges are specific to the Golf Member. You will have all the privileges of your Social Membership, PLUS: No cart or trail fees 3 Guest passes for golf, cart and range 16 Day Advance Tee Times Eligibility for golf leagues and ALL golf tournaments and events Free GHIN Handicap Service Unlimited Use of Range and practice areas Golf Rounds Quick Self Check in – for Golf Members only Summer Golf Reciprocals APPLY TODAY AND JOIN THE FUN! The application forms are available at the Administration Office in the Clubhouse. Information on payment methods and mailing instructions are contained on the application form. RESIGNATION: A resignation of membership must be submitted in writing using the Transfer of Property or Resignation Form. The membership cards are to be returned with the form. If you are moving you can transfer your membership to your new address or transfer it to the buyer of your unit. Every member is very important to the Club and we would appreciate a chance to discuss any considerations of resignation with a member before a resignation is submitted. The Club is a member operated club and membership fees are crucial to providing the Club’s services. Request More Information Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone * Comments Submit Page Footer Privacy & Cookies: This site uses cookies. By continuing to use this website, you agree to their use. To find out more, including how to control cookies, see here: Cookie Policy About us 24315 Vincent Ave Punta Gorda, FL 33955 Admin Office: (941) 639-4151 lrouse@bsgac.org Golf Shop: (941) 637-1577 proshop@bsgac.org PUNTA GORDA WEATHER Burnt Store Marina CC | 24315 Vincent Ave Punta Gorda, FL 33955 |  (941) 639-4151 Copyright © 2025 Burnt Store Marina CC All Rights Reserved. Powered by"
    }
  ]
}