{
  "fuentes": [
    {
      "url": "https://www.dckwwgroup.com/contact-us",
      "email": "bbrown@dckwwgroup.com"
    },
    {
      "url": "https://www.dckwwgroup.com/contact-us",
      "email": "info@dckwwgroup.com"
    },
    {
      "url": "https://bunbury.collinsbooks.com.au/pages/4071-ContactUs",
      "email": "bunbury@collinsbooks.com.au"
    },
    {
      "url": "https://www.mainemaritimemuseum.org/team",
      "email": "buyer@maritimeme.org"
    },
    {
      "url": "https://www.mainemaritimemuseum.org/team",
      "email": "education@maritimeme.org"
    },
    {
      "url": "https://www.mainemaritimemuseum.org/team",
      "email": "events@maritimeme.org"
    },
    {
      "url": "https://www.mainemaritimemuseum.org/team",
      "email": "info@maritimeme.org"
    },
    {
      "url": "https://www.mainemaritimemuseum.org/team",
      "email": "reservations@maritimeme.org"
    },
    {
      "url": "https://thevendry.com/venue/91089/bunbury-miami-miami-fl",
      "email": "geraldine@bunburymiami.com"
    },
    {
      "url": "https://www.palmtreeclubmiami.com/contact-us",
      "email": "vip@palmtreeclubmiami.com"
    },
    {
      "url": "https://www.palmtreeclubmiami.com/contact-us",
      "email": "boats@palmtreeclubmiami.com"
    },
    {
      "url": "https://www.palmtreeclubmiami.com/contact-us",
      "email": "dining@palmtreeclubmiami.com"
    },
    {
      "url": "https://www.palmtreeclubmiami.com/contact-us",
      "email": "eservations@palmtreeclubmiami.com"
    },
    {
      "url": "https://www.palmtreeclubmiami.com/contact-us",
      "email": "events@palmtreeclubmiami.com"
    },
    {
      "url": "https://www.palmtreeclubmiami.com/contact-us",
      "email": "forms@tambourine.com"
    },
    {
      "url": "https://www.palmtreeclubmiami.com/contact-us",
      "email": "reception@palmtreeclubmiami.com"
    },
    {
      "url": "https://www.palmtreeclubmiami.com/contact-us",
      "email": "reservations@palmtreeclubmiami.com"
    },
    {
      "url": "https://www.bunbury.wa.gov.au/contact",
      "email": "info@bunbury.wa.gov.au"
    },
    {
      "url": "https://www.bunbury.wa.gov.au/contact",
      "email": "records@bunbury.wa.gov.au"
    },
    {
      "url": "https://www.bunbury.wa.gov.au/contact",
      "email": "u003einfo@bunbury.wa.gov.au"
    }
  ],
  "mails": [
    "bbrown@dckwwgroup.com",
    "boats@palmtreeclubmiami.com",
    "bunbury@collinsbooks.com.au",
    "buyer@maritimeme.org",
    "dining@palmtreeclubmiami.com",
    "education@maritimeme.org",
    "eservations@palmtreeclubmiami.com",
    "events@maritimeme.org",
    "events@palmtreeclubmiami.com",
    "forms@tambourine.com",
    "geraldine@bunburymiami.com",
    "info@bunbury.wa.gov.au",
    "info@dckwwgroup.com",
    "info@maritimeme.org",
    "reception@palmtreeclubmiami.com",
    "records@bunbury.wa.gov.au",
    "reservations@maritimeme.org",
    "reservations@palmtreeclubmiami.com",
    "u003einfo@bunbury.wa.gov.au",
    "vip@palmtreeclubmiami.com"
  ],
  "nombre_sitio": "bunburymiami.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.dckwwgroup.com/contact-us",
      "text": "Contact Us | Get in Touch Now — DCK 0 Skip to Content Home About Us Our Services Our Team Projects Careers Contact Us Open Menu Close Menu Home About Us Our Services Our Team Projects Careers Contact Us Open Menu Close Menu Home About Us Our Services Our Team Projects Careers Contact Us Contact Us Our Offices: Tel: +1 305 529 6200 Miami Headquarters: Merrick Plaza 2199 Ponce de Leon Boulevard, Suite 201 Coral Gables, Florida 33134 USA New York: The Chrysler Building 405 Lexington Avenue, 59th Floor New York, New York 10174 USA Pittsburgh: Cranberry Crossroads 2009 Mackenzie Way, Suite 100 Cranberry Township, Pennsylvania 16066 USA Puerto Rico: DCK International Group, LLC Antigua and Barbuda: DCK Antigua Group, Ltd. Jasmin Court, Suite No. 20 Friars Hill Road St. John’s, Antigua Bahamas: Bahamas Building Solutions, Inc. Poinciana House West Mall & Poinciana Drive Freeport, Bahamas Belize: DCK Building Solutions Belize, Ltd. Equity House, 84 Albert Street Belize City, Belize District, C.A. Saint Lucia: DCK Building Solutions SL, Ltd. Quadrant Row, 911-Brazil Street P.O. Box 722, Castries LC04 101 Saint Lucia, W.I. Sint Maarten: SXM Building Solutions, BV Unit #1, 68 Welfare Road, Plaza Del Lago Simpson Bay, Sint Maarten Turks and Caicos Islands: DCK TCI, Ltd. Unit A210, Regent Village East, Grace Bay Road Providenciales - Turks & Caicos Islands For new project inquiries please contact: BILL BROWN Chief Executive Officer +1 305 529 6222 Office +1 305 562 9600 Mobile Email Me For general inquiries, please use the contact form below: Name * First Name Last Name Phone * Country (###) ### #### Email * Message * Thank you! DCK Tel: +1 305 529 6200 2199 Ponce de Leon Boulevard Suite 201 Coral Gables, Florida 33134 USA © 2025 DCK Worldwide Group, LLC  │  Florida License CGC1531864"
    },
    {
      "url": "https://bunbury.collinsbooks.com.au/pages/4071-ContactUs",
      "text": "CONTACT US - Collins Booksellers Bunbury Categories Account 10+ Years Junior Readers 6+ Years Junior Readers Animals, Nature & Pets Art & Crafts Australiana Bargain Books Biographies, Memoirs & True Stories Body, Mind & Spirit BookTok Romance Business, Management & Leadership Cameras & Photography Children's Picture Books Children's Reference Classic Fiction Colouring, Sticker & Activity Books Computers & Technology Cooking, Food & Drink Crime Thrillers Dictionaries & General Reference Early Learning (ages 2+) Environmentalism, Sustainability & Self Sufficiency Fantasy & Science Fiction Fashion and Beauty Fiction Foreign Language Games, Puzzles & Hobbies Gardening Gift & Inspiration Health & Diet History Home, Style & Living Humour Investment & Personal Finance Journals and Stationery Kids Board Books Manga & Graphic Novels Military Music & Musicians Parenting, Pregnancy & Family Philosophy & Psychology Poetry Politics, Current Affairs & Social Issues Pop Culture Books Romantasy Sciences & Academia Self Development short stories Sports & Recreation Teenage & Young Adult Fiction Transport Travel Guides, Maps & Atlases True Crime ABOUT THIS SHOP TERMS & CONDITIONS CONTACT US GIFT CARDS COLLINS CLUB EVENTS AUDIOBOOKS FRANCHISE OPPORTUNITIES SEPTEMBER READING GUIDE Login/Sign up Collins Booksellers Home 0 items Login/Sign up Search for books Start typing to search by keyword, title, author or ISBN Searching... Going to product page... Toggle navigation ABOUT THIS SHOP TERMS & CONDITIONS CONTACT US GIFT CARDS COLLINS CLUB EVENTS AUDIOBOOKS FRANCHISE OPPORTUNITIES SEPTEMBER READING GUIDE CONTACT US Browse by category Toggle navigation 10+ Years Junior Readers 6+ Years Junior Readers Animals, Nature & Pets Art & Crafts Australiana Bargain Books Biographies, Memoirs & True Stories Body, Mind & Spirit BookTok Romance Business, Management & Leadership Cameras & Photography Children's Picture Books Children's Reference Classic Fiction Colouring, Sticker & Activity Books Computers & Technology Cooking, Food & Drink Crime Thrillers Dictionaries & General Reference Early Learning (ages 2+) Environmentalism, Sustainability & Self Sufficiency Fantasy & Science Fiction Fashion and Beauty Fiction Foreign Language Games, Puzzles & Hobbies Gardening Gift & Inspiration Health & Diet History Home, Style & Living Humour Investment & Personal Finance Journals and Stationery Kids Board Books Manga & Graphic Novels Military Music & Musicians Parenting, Pregnancy & Family Philosophy & Psychology Poetry Politics, Current Affairs & Social Issues Pop Culture Books Romantasy Sciences & Academia Self Development short stories Sports & Recreation Teenage & Young Adult Fiction Transport Travel Guides, Maps & Atlases True Crime CONTACT US Collins Booksellers Bunbury Contact Tel: (08) 9791 3755 Email: bunbury@collinsbooks.com.au Opening Hours Monday:         9:00 - 5:00 Tuesday:         9:00 - 5:00 Wednesday:    9:00 - 5:00 Thursday:       9:00 - 5:00 Friday:           9:00 - 4:00 Saturday:       9:00 - 4:00 Visit 117 Victoria Street Bunbury WA 6230 Collins Booksellers Bunbury 117 Victoria Street, Bunbury, Western Australia ABN: 41 898 818 448 bunbury@collinsbooks.com.au Collins Booksellers Home System by Circle © CircleSoft 2025."
    },
    {
      "url": "https://www.mainemaritimemuseum.org/team",
      "text": "Our Team | Staff, Interns, Volunteers & Board of Trustees — Maine Maritime Museum 0 Skip to Content Maine Maritime Museum Exhibits Cruises Give More Plan Your Visit Cruises Exhibits The Bath Iron Works Story: By Land & Sea Calendar of Events Group Tours Weddings & Event Rentals Digital Guide Collection Education Camp Museum History Our Team Mission, Vision, Values Business Support Donation Requests & Guidelines The Rhumb Line Press Contact Store Win This Boat! Join Open Menu Close Menu Maine Maritime Museum Exhibits Cruises Give More Plan Your Visit Cruises Exhibits The Bath Iron Works Story: By Land & Sea Calendar of Events Group Tours Weddings & Event Rentals Digital Guide Collection Education Camp Museum History Our Team Mission, Vision, Values Business Support Donation Requests & Guidelines The Rhumb Line Press Contact Store Win This Boat! Join Open Menu Close Menu Exhibits Cruises Give Folder: More Back Plan Your Visit Cruises Exhibits The Bath Iron Works Story: By Land & Sea Calendar of Events Group Tours Weddings & Event Rentals Digital Guide Collection Education Camp Museum History Our Team Mission, Vision, Values Business Support Donation Requests & Guidelines The Rhumb Line Press Contact Store Win This Boat! Join Our Team A dedicated group of individuals–our staff, board of trustees, interns, and volunteers–make this museum a leading cultural institution and community pillar. As active stewards and educators of history and culture, of our historic site, and of our collections, we strive to inspire an ever-growing audience to experience the local, regional, and global stories of Maine. Leadership Team Featured Chelsea Lane, Director of Visitor Experience Read More → Kurt Spiridakis, Director of Boatbuilding Read More → Jason Morin, Director of Operations Read More → Luke Gates-Milardo, Director of Exhibits & Learning Read More → Chris Timm, Executive Director Read More → Rebecca Roche, Chief Advancement Officer Read More → Chris Jacobs, Director of Finance Read More → Kelly Page, Curator of Collections Read More → Current Opportunities Featured Exhibit Designer Visitor Service Assistants (Volunteer) Visitor Experience Associate Percy & Small Shipyard Guide (Volunteer) Donnell House Guide (Volunteer) Our Board of Trustees, comprised of a group of dedicated individuals, who collectively guide and advise museum policies. Board of  Trustees OFFICERS Thomas C. Whelan, Chair Loren B. Wright, Vice Chair Ross Burgess, Treasurer Lon F. Povich, Secretary TRUSTEES EMERITI Stephen C. Caulfield George H. McEvoy Jackson A. Parker William A. Rogers Elena D. Vandervoort David R. Weiss VOLUNTEER CHAIR Joan Knight TRUSTEES Greger C. Anderson William J. Brennan Tess Chakkalakal Joseph A. Drago Susan S. Duncan Kristin L. Fletcher Raymond E. Hender Leonard W. Langer Kenneth Moller John G. Morse Andrew Perry Carl D. Rapp Mandy Reynolds Thomas Sturgeon Thomas C. Whelan Nancy A. Wilkes Victoria M. Willock John Zittel Volunteer with Us A SENSE OF ACCOMPLISHMENT… As a nonprofit organization, the museum depends on its volunteers who annually contribute over $500,000 worth of their time, skills, and talents. As a Maine Maritime Museum volunteer, you will be able to work with others who share your interests and experience the sense of camaraderie that has lured people to the museum for over 50 years. There is something for everyone: maritime history, historic homes, gardening, art, education, and much more! Throughout the year, volunteers are invited to join in receptions, dinners, and cruises that celebrate their contributions. Volunteers who donate at least 15 hours of their time are also eligible for a complimentary membership and other exclusive benefits. VOLUNTEER LOG IN Looking for something else? To schedule a school visit for children, email us at education@maritimeme.org . To schedule a group tour for adults, email us at reservations@maritimeme.org . For weddings and private events, email us at events@maritimeme.org . For press inquiries, or anything else, email us at info@maritimeme.org . Prospective vendors for our museum store, email our store buyer at buyer@maritimeme.org . To inquire about donating an item to the collection, please complete this form . Have a question for the Curatorial Team? Submit a research request . Subscribe to Our Newsletter Sign up with your email address to receive news and updates. Email Address Sign Up Thank you! Plan Your Visit Cruises Exhibits The Bath Iron Works Story: By Land & Sea Calendar of Events Group Tours &   Charters Weddings & Rentals Digital Guide Collection & Research Education School Visits Learning Resources Our Programs Discovery Boatbuilding For Homeschool Camps Support Join Give Business Support Donation Requests & Guidelines About Museum History Our Team Mission, Vision, Values The Rhumb Line Press Win This Boat! Store Contact Location 243 Washington St Bath, ME 04530 Hours Monday – Sunday 9:30 am – 5:00 pm Closed Thanksgiving, Christmas & New Year’s Day, and occasionally if we get some weather. Questions? We’re here. info@maritimeme.org (207) 443-1316 ©2025 Maine Maritime Museum | Privacy Policy | Digital Guide | Instagram | Facebook | Volunteer Login"
    },
    {
      "url": "https://thevendry.com/venue/91089/bunbury-miami-miami-fl",
      "text": "Bunbury Miami - South American Restaurant in Miami, FL | The Vendry by by Search Inspiration Circles Log In Sign Up by The community and marketplace for event pros. Join Us List My Business The Vendry Organizations The Memo About the Vendry Contact Us Groupize Keep me posted with industry news, cool case studies, and events. Your email address Subscribe © 2025 THE VENDRY LLC. Privacy Terms & Conditions Terms of Use Overview Spaces Press Nearby Hotels Bunbury Miami Restaurant 55 NE 14th St, Miami, FL 33132, USA Media Art Entertainment Bunbury Miami 55 NE 14th St, Miami, FL 33132, USA Media Art Entertainment Request Pricing Cuisine Type South American # of Spaces 1 Catering and Events are opportunities for us to work closely with our guests. Special occasions for us to share our dedication to the art of celebration in exciting new ways. \n\nContact Us and let us help you shape your next event to perfection! Show more Show more Request Pricing 55 Northeast 14th Street, Miami, FL Show on the map Spaces Event Space Event Space Press The Business Journals 5 South Florida Restaurants Make Yelp's 'top 100 Places To Eat In 2024' List Jan 23, 2024 Forbes Miami Spice 2023: Where To Eat From August 1 To September 30 Jul 12, 2023 The Infatuation Where To Eat Near The Miami Heat Arena - Miami - The Infatuation Jan 12, 2023 The Infatuation The 16 Best Restaurants In Downtown Miami - Miami - The Infatuation Dec 1, 2022 The Business Journals 5 South Florida Restaurants Make Yelp's 'top 100 Places To Eat In 2024' List Jan 23, 2024 Forbes Miami Spice 2023: Where To Eat From August 1 To September 30 Jul 12, 2023 The Infatuation Where To Eat Near The Miami Heat Arena - Miami - The Infatuation Jan 12, 2023 The Infatuation The 16 Best Restaurants In Downtown Miami - Miami - The Infatuation Dec 1, 2022 Do you work for Bunbury Miami ? Contact us to learn more about who's managing this profile or gain access. Other Venues in Miami for Your Event Miami Event Spaces Miami Performance Spaces Miami Hotels Miami Restaurants Miami Convention Centers Miami Boats / Yachts Miami Museums / Galleries Miami Stadiums Miami Movie Theaters Miami Bars / Clubs Miami Private Clubs Miami Breweries / Distilleries Miami Coworking Spaces Miami Banquet Halls Miami Aquariums / Zoos Miami Cultural Centers Miami Corporate Offices Miami Private Group Activites Miami Historic Buildings Miami Photo Studios Miami Public Spaces Miami Event Spaces Miami Performance Spaces Miami Hotels Miami Restaurants Miami Convention Centers Miami Boats / Yachts Miami Museums / Galleries Miami Stadiums Miami Movie Theaters Miami Bars / Clubs Miami Private Clubs Miami Breweries / Distilleries Miami Coworking Spaces Miami Banquet Halls Miami Aquariums / Zoos Miami Cultural Centers Miami Corporate Offices Miami Private Group Activites Miami Historic Buildings Miami Photo Studios Miami Public Spaces"
    },
    {
      "url": "https://www.palmtreeclubmiami.com/contact-us",
      "text": "Contact Us | Palm Tree Club Miami Skip to Content Palm Tree Club Miami (305) 865-7100 Rooms & Suites Offers Live Events Restaurant Happenings Our Neighborhood Gallery About Us Book Now Connect With Palm Tree Club Let’s Hear From You! Palm Tree Club Miami 1819 79th Street Causeway North Bay Village, FL 33141 Hotel Phone: 305-865-7100 Front Desk Inquiries: reception@palmtreeclubmiami.com Reservations: r eservations@palmtreeclubmiami.com Restaurant Phone: 786-204-1366 Email: dining@palmtreeclubmiami.com Marina Email: boats@palmtreeclubmiami.com Radio Channel: #71 Live Events Email: VIP@palmtreeclubmiami.com Thank you for reaching out! We will be in touch shortly. First Name * Last Name * Email Address * Comments Privacy Policy agreement I have read and agree to the Privacy Policy . Yes, I would like to receive emails with exclusive specials and offers. Submit FREQUENTLY ASKED QUESTIONS Live Music & Events What time does the live music start? Doors open at 3 PM. Is there a cover charge for guests to enjoy the live music? Only for ticketed events. Get your tickets on Posh: https://posh.vip/g/ptc-miami . Do I need a reservation to see the live music? Not unless it's a ticketed event. How long does the live music performance last? Sunset parties typically go until 12 AM. Is the music indoors or outdoors? Both. Do you have a schedule or calendar for upcoming live music performances? Yes! Be sure to check our socials and website for more details: www.palmtreeclubmiami.com . Do you offer special deals or promotions? For offers and experiences, check our OpenTable: Palm Tree Club Miami Restaurant - North Bay Village, FL | OpenTable . Are there specific days or nights dedicated to live music? Typically Saturdays and Sundays, but please check our website for more details! What time will the DJs perform at the events we've published? Stay tuned to our social media for updates on set times. What’s the dress code for events? Come as you are—sneakers, flip-flops, heels, sequins, or bikini tops. Feel free to wear jeans, shorts, or even your suit (but we hope you lose the tie). Hotel General Information Is there a minimum age to check in? Yes, guests must be 21 years or older to check-in and will be required to present a valid photo ID, in addition to their method of payment. What time is check-in and check-out? Check-in time: 4pm Check-out time: 11am Can I check in early or check out late? Early check-in or late check-out may be available upon request, subject to availability. Please contact the front desk for more information. How late can I check-in? Our front desk is available 24 hours. What is required to check-in? Guests must be 21 years or older to check in and will be required to present a valid photo ID in addition to their method of payment. Is parking available at the hotel? Yes, complimentary on-site parking is available for all hotel guests. Can I store my luggage before or after I check out? Yes, complimentary luggage storage is available at our Front Desk. Is the hotel accessible for guests with disabilities? Yes, we have accessible rooms, ramps, and elevators for your convenience. Please inform us of any specific needs prior to your arrival. Are there any extra charges or resort fees? $20 plus taxes Resort Fee is applied to all reservations. Is the hotel pet-friendly? Yes. A non-refundable $100 pet fee applies. Room and Facilities Do the rooms include complimentary Wi-Fi? Yes, free Wi-Fi is available in all rooms and public areas of the hotel. When will my room be cleaned, and how do I request additional items? Your room will receive full cleaning service every third day of your stay. For any requests, such as extra towels or amenity refills, please contact the Front Desk at any time. Are there any amenities in the rooms? Our rooms come with air conditioning, a flat-screen TV, minibar, safe, Bluetooth speaker, hair dryer, and ironing board. Check the room description for specific details. Do you have accessible rooms? We offer three accessible room types - our Accessible Classic King and Accessible Classic Double, Accessible Deluxe King. For more specifics, check out our Accessibility page. Is there a smoking policy in the hotel? Our hotel is smoke-free, and smoking is only allowed in designated areas. Please ensure compliance with our smoking policy. A $250 cleaning fee will be applied if any odor is found in the room. Do you offer breakfast? Brunch begins at 11am. Do you have a restaurant or bar on-site? Yes, we have Palm Tree Club Miami Restaurant. Open daily, our restaurant serves up coastal-American food in a casual dining environment, with all your favorites & Miami’s best sunset views! Do you offer laundry and dry cleaning services? Yes, laundry and dry cleaning services are available. Booking and Payments Does the hotel accept traveler’s checks as payment? No, we do not accept traveler’s checks as payment. Does the hotel require any deposit at check in? Yes, at check-in, we require a $150 incidental deposit per stay, in addition to the room and tax charges. This is just a hold on the credit card. If the guest doesn’t incur any incidentals or make any purchases during their stay, the hold will be released within 5 to 7 business days after check-out. Does the hotel require any deposit prior to checking in? Pre-stay deposits are dependent upon the rate plan reserved. What type of credit cards are accepted at the hotel? MasterCard, Visa, American Express, and Discover are all accepted. What is your cancellation policy? Cancellation policy depends on the reservation rate booked. We offer rates with a refundable reservation up to 72 hours before arrival, as well as discounted non-refundable rates. Can I book directly on your website? Yes, we recommend booking directly through our website for the best rates and special offers. Can I modify or cancel my reservation after booking? Cancellation/Modification policy depends on the reservation rate booked. We offer rates that may be cancelled or modified up to 72 hours before arrival, as well as discounted non-refundable rates that do not allow cancellations or modifications. Special Requests and Policies Can I send a package to the hotel? Yes, we’re happy to accept packages prior to your arrival. Please be sure that the name of the registered guest is included in the delivery information and be sure to use our Security/Receiving address: 1819 79th Street Causeway North Bay Village, FL 33141 Can I request special accommodations or amenities (e.g., flowers, champagne, etc.)? Yes, we can arrange special requests for a fee. Please contact us ahead of time to ensure availability. Do you offer shuttle service to the airport? We do not offer this service directly, however, our concierge services may assist in making a shuttle reservation with a 3rd party company. Additional Services Can I book tours or activities through the hotel? Yes, we’d be happy to assist with booking. Please stop by the front desk to inquire about available options. Our concierge team can also help with making reservations. Do you have a gym or fitness center? Yes, we have a brand-new fitness center, and it’s open 24 hours a day for your convenience! Reservations & Ticketing How can I contact the restaurant if I have further questions? You can reach us at 786-204-1366 or email us at dining@palmtreeclubmiami.com . Will there be commissions for promoters who refer clients? For more information, email VIP@palmtreeclubmiami.com . Contact Information How can I contact the hotel if I have further questions? You can reach us at 305-865-7100 or email us at reception@palmtreeclubmiami.com . Our team is available 24/7 to assist you. Join the Crew Thank you for your interest. Hidden Field First Name Last Name Email Address Privacy Policy agreement I have read and agree to the Privacy Policy . Yes, I would like to receive emails with exclusive specials and offers. Submit Palm Tree Club Miami Palm Tree Club Miami 1819 79th Street Causeway                        North Bay Village, FL                         33141 HOTEL: (305) 865-7100 reception@palmtreeclubmiami.com reservations@palmtreeclubmiami.com RESTAURANT: (786) 796-0846 dining@palmtreeclubmiami.com MARINA: boats@palmtreeclubmiami.com Radio Channel: #71 LIVE EVENTS & PRIVATE TABLES: VIP@palmtreeclubmiami.com events@palmtreeclubmiami.com Our hotel properties include Palm Tree Hotel, Palm Tree Crew Hotel, and Palm Tree Club, all operating under the Palm Tree Crew umbrella. facebook instagram pinterest Contact & FAQs Palm Tree Club Miami  2025. All Rights Reserved Accessibility Privacy Policy Sitemap Consent Preferences Hotel Web Design by close"
    },
    {
      "url": "https://www.bunbury.wa.gov.au/contact",
      "text": "Contact - City of Bunbury Skip to main content Live Play Council Business Projects Contact Contact Us 4 Stephen Street, Bunbury, WA, 6230 08 9792 7000 info@bunbury.wa.gov.au Contact Us © City of Bunbury 2025 Community Portal Our Websites https://www.bunbury.wa.gov.au/bunbury-brighter https://www.bunbury.wa.gov.au/sports-centre https://www.bunbury.wa.gov.au/wildlife-park https://www.bunbury.wa.gov.au/libraries https://www.bunbury.wa.gov.au/museum https://www.bunbury.wa.gov.au/brag Contact Contact Home Contact Our Administration building on Stephen Street is open to in-person enquiries Monday to Friday, 8:30am to 5.00pm. Cashier open 8.30am to 4.30pm. We are also available by email, phone or online form. Community Portal It is now easier than ever for Bunbury residents to request a service or report an issue to the City of Bunbury, through our new Community Portal. The online hub allows residents to lodge and track reports and service requests, such as reporting graffiti, litter and fallen trees or requesting bin replacements, just to name a few. Community members can sign up and create an account to stay up to date with a report or service request lodged with the City. The portal also features an AI assistant to ask questions and, where possible, get real-time information and responses. Visit the Community Portal via the button below. Community Portal City of Bunbury Administration Building 08 9792 7000 Email 4 Stephen Street Bunbury, Western Australia 6230 Monday to Friday 8:30am to 5.00pm Cashier 8.30am to 4.30pm Closed weekends and public holidays . Map of City of Bunbury 4 Stephen Street If you need to contact the City of Bunbury, please complete the form below so we can assist you. Please note that submitted information will only be attended to during office hours. Send us a message First name * Last name * Organisation Email address * Phone number * Address Suburb State / Territory - Select - Western Australia Australian Capital Territory New South Wales Northern Territory Queensland South Australia Tasmania Victoria Message * Submit Duty ranger (24 hours) 9792 7106 After hours For all after hours emergencies including Rangers, Waste and Recycling, Works and Service: 9792 7000 Contact Us 4 Stephen Street, Bunbury, WA, 6230 08 9792 7000 info@bunbury.wa.gov.au Follow Us @bunburycity @cityofbunbury City of Bunbury @cityofbunbury The City of Bunbury acknowledge the traditional owners of the land, the Noongar Wardandi people and their continuing connection to the land, waters and community. We pay our respects to all members of the Aboriginal communities and their culture; and to Elders past, present and emerging. Terms and Conditions Privacy Policy Accessibility © City of Bunbury 2025"
    }
  ]
}