{
  "fuentes": [
    {
      "url": "https://www.rockypatel.com/about/contact/",
      "email": "farmtour@rockypatel.com"
    },
    {
      "url": "https://www.rockypatel.com/about/contact/",
      "email": "info@rockypatel.com"
    },
    {
      "url": "https://www.burnbyrockypatel.com/naples-cigar-events/guy-fieri-at-burn-with-espinosa-cigars",
      "email": "ivan@burnbyrockypatel.com"
    },
    {
      "url": "https://www.visitpittsburgh.com/directory/burn-by-rocky-patel/",
      "email": "caleb@burnbyrockypatel.com"
    },
    {
      "url": "https://www.visitpittsburgh.com/directory/burn-by-rocky-patel/",
      "email": "info@visitpittsburgh.com"
    },
    {
      "url": "https://www.burnbyrockypatel.com/naples",
      "email": "brandonr@burnbyrockypatel.com"
    },
    {
      "url": "https://www.burnbyrockypatel.com/naples",
      "email": "ivan@burnbyrockypatel.com"
    },
    {
      "url": "https://www.burnbyrockypatel.com/naples",
      "email": "info@burnbyrockypatel.com"
    },
    {
      "url": "https://www.burnbyrockypatel.com/naples-cigar-events/a-night-in-old-havana",
      "email": "ivan@burnbyrockypatel.com"
    },
    {
      "url": "https://www.burnbyrockypatel.com/naples-cigar-events/schools-out-for-summer-at-burn",
      "email": "ivan@burnbyrockypatel.com"
    },
    {
      "url": "https://www.rockypatel.com/event/burn-by-rocky-patel-naples-feat-rocky-patel-2/",
      "email": "ivan@burnbyrockypatel.com"
    },
    {
      "url": "https://www.burnbyrockypatel.com/naples-cigar-events/a-night-with-the-bunnies-at-burn",
      "email": "ivan@burnbyrockypatel.com"
    },
    {
      "url": "https://www.burnbyrockypatel.com/naples-cigar-events/anniversary-at-burn",
      "email": "ivan@burnbyrockypatel.com"
    },
    {
      "url": "https://www.burnbyrockypatel.com/naples-cigar-events/year-of-the-snake-release-party",
      "email": "ivan@burnbyrockypatel.com"
    }
  ],
  "mails": [
    "brandonr@burnbyrockypatel.com",
    "caleb@burnbyrockypatel.com",
    "farmtour@rockypatel.com",
    "info@burnbyrockypatel.com",
    "info@rockypatel.com",
    "info@visitpittsburgh.com",
    "ivan@burnbyrockypatel.com"
  ],
  "nombre_sitio": "burnbyrockypatel.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.rockypatel.com/about/contact/",
      "text": "Contact - Rocky Patel Premium Cigars Skip to content Un-authorized Retailers FAQ News My Account Cigars 30th Anniversary Year of the Snake Full Portfolio Top Rated Cigars New Cigars Nicaraguan Collection Honduran Collection Shop Full Catalog Accessories Apparel Man Cave RP Art Gallery Returns & Warranty Retailers Our Retailers Special Edition Retailers Un-authorized Retailers Cigars 30th Anniversary Year of the Snake Full Portfolio Top Rated Cigars New Cigars Shop Full Catalog Accessories Apparel Man Cave RP Art Gallery Returns & Warranty Retailers Our Retailers Special Edition Retailers Un-authorized Retailers Events Cigar Events Cigar Smoking World Championship Our Factories How a Cigar is Made Cigar Factories Factory Tour About Story of Rocky Patel RP Family Your RP Reps FAQ RP Cinema Tubeaux by Rocky Patel News Contact My account Cart Events Cigar Events Cigar Smoking World Championship Our Farms How a Cigar is Made Cigar Factories Cigar Factory: Honduras Cigar Factory: Nicaragua Factory Tour About Story of Rocky Patel RP Cinema RP Family Your RP Reps Contact Welcome to the family CORPORATE OFFICE 4244 Corporate Square Naples, FL 34104 Tel: 239.593.1833 Fax: 239.593.1839 For customer service, please email Info@rockypatel.com For question regarding our Farm & Factory tour , please email Farmtour@rockypatel.com Sign up to be a RP VIP MEMBER Email Address Please enter a valid email address. Subscribe! Thanks for subscribing! Please check your email for further instructions. Something went wrong. Please check your entries and try again. Lighters Cutters Ashtrays Cigars HOME FAQ The Family Making a  cigar BURN Lounge © 2025 Rocky Patel Premium Cigars, INC. – All rights reserved | Privacy Policy | Cookie Policy | FAQ | Contact Scroll To Top"
    },
    {
      "url": "https://www.burnbyrockypatel.com/naples-cigar-events/guy-fieri-at-burn-with-espinosa-cigars",
      "text": "Guy Fieri at BURN with Espinosa Cigars! on Nov 11, 2024 | Naples, FL Event |Cigar Bar | BURN by Rocky Patel Naples Close World of BURN Home Our Humidor Locker Membership Latest News Rocky Patel Premium Cigars Career Opportunities Locations Naples, FL Indianapolis, IN Atlanta, GA Pittsburgh, PA Oklahoma City, OK Locker Membership Locations close Locations Naples, FL Indianapolis, IN Atlanta, GA Pittsburgh, PA Oklahoma City, OK BURN Naples Events Guy Fieri at BURN with Espinosa Cigars! November 11, 2024 Event Details Event Guy Fieri at BURN with Espinosa Cigars! Date & Time November 11, 2024 7:00 PM Attire Location â 9110 Strada Place, Suite 6160 Naples, FL, 34108 (239) 653 - 9013 Get your Tickets vip & Bottle Service Events Burn Naples Get notifications about events VIP & Group Bookings Get Notifications BURN's flagship walk-in humidor, crafted from Spanish cedar, boasts an impressive array of over 400 premium hand-rolled cigars. Among these offerings, you'll discover the complete Rocky Patel Premium Cigar collection readily available within all our humidors. Please reach out to your local BURN location for information on all other Premium Cigar Brands that they carry. Guy Fieri at BURN with Espinosa Cigars // BURN Naples Join us for an unforgettable evening as celebrity chef and cigar enthusiast Guy Fieri makes a special appearance at BURN by Rocky Patel Naples! Enjoy exclusive Espinosa cigar specials , crafted cocktails, and the unique opportunity to meet Guy Fieri in person. Whether you're a cigar aficionado or just looking for an extraordinary night out, this event promises to deliver great flavors and unforgettable vibes. Cover Charge is $25 that will go towards cigar purchases during the night. Locker members no cost for entry and you will enjoy passed appetizers! Donât miss out! â For table reservations, bottle service, reach out to Ivan@burnbyrockypatel.com â Get your Tickets vip & Bottle Service Events Burn Naples Upcoming Events January 5, 2026 Industry Night at BURN! Sunday & Monday January 7, 2026 Ladies Night at BURN! Join the BURN Family * indicates required Name Email Address * Burn Location Burn Atlanta Burn Indianpolis Burn Naples Burn OKC Burn Pittsburgh Other Locations Atlanta Naples Indianapolis Oklahoma CIty Pittsburgh Explore more Latest News Rocky Patel premium Cigars Career Opportunities The Humidor The Humidor Locker Membership Our Events January 5, 2026 Industry Night at BURN! Sunday & Monday January 7, 2026 Ladies Night at BURN! All events All Events"
    },
    {
      "url": "https://www.visitpittsburgh.com/directory/burn-by-rocky-patel/",
      "text": "BURN by Rocky Patel | Visit Pittsburgh Skip to content Newsletter Discover Your Persona 81 ° F 0 Saved Navigation Things to Do Free Things to Do Family Fun Tours & Sightseeing Outdoor Adventure Arts & Culture Shopping Health & Wellness Pittsburgh Sports Teams Casinos & Gaming Film Festivals Events & Festivals Submit Your Event This Week in Pittsburgh Celebrate America's 250th Annual Events Holiday Events Halloween Events Film Festivals Food Festivals Marathons, Runs & Walks Oktoberfest Pittsburgh Hotels & Resorts Restaurants & Culinary Bars & Nightlife Pittsburgh Craft Breweries Wineries & Distilleries Farms & Farmers Markets Plan Your Trip Pittsburgh Insider's Guide Beyond Pittsburgh Transportation Group Tour Explore Black Culture & Heritage LGBTQIA+ Travel in Pittsburgh Pet-friendly Travel College Visits Senior Travel Medical Travel Accessibility Guide Weather Welcome Centers Newsletter Neighborhoods 2026 NFL Draft Meetings and Events Meet in Pittsburgh Hotels Event Services Marketing Toolkit Submit RFP Contact Us Show Your Badge SportsPITTSBURGH About SportsPITTSBURGH Sports Event Planner Sports Facilities Calendar of Events Sports Event Attendee Power of Sports Economy Weddings & Reunions Media Partners Discover Your Persona Home BURN by Rocky Patel Website Email BURN by Rocky Patel Pittsburgh is an evolution in cigar lounges fashioned for those who enjoy fine cigars, premium spirits, delectable \ncuisine, trendy house music and live entertainment. The flagship lounge \nopened in Naples, Florida in 2019 where it continues to thrive today. \nBURN Pittsburgh opened in April 2018 on Pittsburgh's trendy North Shore.\n Owned and operated by Rocky Patel, the founder of Rocky Patel Premium \nCigars, BURN showcases a unique mix of exotic and regional decor \ndistinctive to each city. The posh atmosphere attracts a diverse crowd \nseeking the joy of life's luxurious pleasures. Cheers! Cuisines Amenities Details American Amenities ADA Accessible Entertainment Live Entertainment Save BURN by Rocky Patel 346 North Shore Dr. Pittsburgh, Pennsylvania 15212 Details Open in Google Maps Map Full View BURN by Rocky Patel 346 North Shore Dr. Pittsburgh, Pennsylvania 15212 (412) 586-5854 Hours M-F: 2 p.m.-2 a.m; S-Su: 12 p.m.-2 a.m. Price Range $$ = $10-$25 Plan Your Trip with the new Pittsburgh Insider's Guide Start Planning Contact Us Privacy Blog About Us 120 Fifth Avenue Fifth Avenue Place Suite 2800 Pittsburgh, PA 15222 (412) 281-7711 Toll Free: (877) 568-3744 ©️2025 Visit Pittsburgh. All Rights Reserved. Privacy Policy This site uses cookies to enhance your experience. Accept Experience Builder Quick Search Full Search Location Map"
    },
    {
      "url": "https://www.burnbyrockypatel.com/naples",
      "text": "Naples' Best Cigar Lounge | Mercato Naples | Live Music | Cigar Bar | Cigar Humidor | Craft Cocktails | Premium Liquor | BURN by Rocky Patel Naples | Naples, Florida Close World of BURN Home Our Humidor Locker Membership Latest News Rocky Patel Premium Cigars Career Opportunities Locations Naples, FL Indianapolis, IN Atlanta, GA Pittsburgh, PA Oklahoma City, OK Locker Membership Locations close Locations Naples, FL Indianapolis, IN Atlanta, GA Pittsburgh, PA Oklahoma City, OK burn naples Info Hours & Info Daily: 2 pm to 2 am Weekly Specials Photo Gallery Contact & Directions Contact 9110 Strada Place, Suite 6160 Naples, FL, 34108 (239) 653 - 9013 Menu Events Reserve vip & Group bookings Reservations Reservations Please Call: 239-653-9013 If you're looking to secure a reservation that promises a delightful experience, simply dial 239-653-9013. Whether it's for an intimate dinner, a special event, or just to ensure your spot at the table, our dedicated team is ready to assist you. Reserve Full Venue To reserve the entire venue, kindly reach out via email to Ivan@burnbyrockypatel.com . When emailing, please ensure to include the following details: date time party size Contact phone number We look forward to accommodating your event and ensuring a memorable experience for you and your guests. VIP & Group Bookings Our Gallery Discover BURN The Experience Enjoy lifeâs pleasures The Experience Enjoy lifeâs pleasures Welcome to BURN Naples, where luxury and sophistication converge to offer an unparalleled experience for aficionados of premium cigars, fine spirits, craft cocktails, and live entertainment. Our Events January 5, 2026 Industry Night at BURN! Sunday & Monday January 7, 2026 Ladies Night at BURN! All events All Events Discover Luxury Our Specials Weekly Events Our Specials Weekly Events MONDAYS \"Industry Night\" 25% Off for our Service Friends from 10pm - 2am â WEDNESDAYSâ¨ \"Ladiesâ Night\" Specials on Eleven Vodka, Santos Tequila, and Aviation Gin. $9 Glasses of Moet Brut and Vueve Cliquot Brut till 10pm Happy Hour all Night â SUNDAYS â \"Industry Night\" 25% Off for our Service Friends from 6pm - 2am â ____________ â HUMIDOR HAPPY HOUR â Monday - Friday | Open - 7pm Buy 5 or more Rocky Patel Cigars and get 20% off â Happy Hour 7 Days a Week | From Open to 7 PM 50% Off beverages priced $14 and under. 25% Off beverages priced $15 and over. Excluding Allocated and Rare Items. Humidor Cigar Humidor Cigar Explore our meticulously curated cigar collection at BURN Naples, boasting over 400 premium hand-rolled cigars to ensure aficionados find their perfect match. Elevate your smoking experience and discover the finest selections at our Naples location. Our Humidor Locker Membership Premium Cocktails, Liquors, Wine V.I.P. Lounge Exclusive V.I.P. Lounge Exclusive Experience VIP luxury at BURN by Rocky Patel, meticulously tailored for your party at our Naples location. Whether it's an intimate evening or an extravagant celebration, our dedicated staff and welcoming atmosphere ensure an unforgettable experience. V.I.P. Reservations Our Gallery Latest News April 1, 2025 30th Anniversary is Coming April 1, 2025 You Need to Try the Rocky Patel Emerald December 12, 2024 Conviction Box Giveaway! September 23, 2024 BURN Atlanta Cigar Lounge Wins \"Best Cigar Lounge in Atlanta\" at Atlanta Cigar Week! June 17, 2024 Experience Deadwood! Cigar Deals All Month Long May 1, 2024 \"Year of the Dragon\" by Rocky Patel is almost here! April 23, 2024 Conviction by Rocky Patel March 11, 2024 Rocky Patel Premium Cigars March 21, 2024 Learn how a cigar is made All News All News Important Information Management Brandon Ruganis - General Manager Email: BrandonR@burnbyrockypatel.com Phone: (239) 986-4970 Ivan Zdravkovic - VIP Manager Email: Ivan@burnbyrockypatel.com Phone: (239) 298-9707 Contact 9110 Strada Place,Suite 6160 Naples, FL 34108 (239) 653-9013 info@burnbyrockypatel.com Dress Appropriate, tasteful attire must be worn at all times. Gentlemen may not wear caps, casual shorts, open-toed shoes, or athletic gear. Â Casual business attire, a collared shirt or sports coat is required for gentlemen. Â Ladies may not wear athletic gear or excessively ripped clothing. Thank you. Job Opportunities Management Opportunities General Staff Bar Staff Reservations Career Opportunities Apply for locker BURN's flagship walk-in humidor, crafted from Spanish cedar, boasts an impressive array of over 400 premium hand-rolled cigars. Among these offerings, you'll discover the complete Rocky Patel Premium Cigar collection readily available within all our humidors. Please reach out to your local BURN location for information on all other Premium Cigar Brands that they carry. Contact Us BURN's flagship walk-in humidor, crafted from Spanish cedar, boasts an impressive array of over 400 premium hand-rolled cigars. Among these offerings, you'll discover the complete Rocky Patel Premium Cigar collection readily available within all our humidors. Please reach out to your local BURN location for information on all other Premium Cigar Brands that they carry. Join the BURN Family * indicates required Name Email Address * Burn Location Burn Atlanta Burn Indianpolis Burn Naples Burn OKC Burn Pittsburgh Other Locations Atlanta Naples Indianapolis Oklahoma CIty Pittsburgh Explore more Latest News Rocky Patel premium Cigars Career Opportunities The Humidor The Humidor Locker Membership"
    },
    {
      "url": "https://www.burnbyrockypatel.com/naples-cigar-events/a-night-in-old-havana",
      "text": "A Night in Old Havana on Oct 17, 2024 | Naples, FL Event |Cigar Bar | BURN by Rocky Patel Naples Close World of BURN Home Our Humidor Locker Membership Latest News Rocky Patel Premium Cigars Career Opportunities Locations Naples, FL Indianapolis, IN Atlanta, GA Pittsburgh, PA Oklahoma City, OK Locker Membership Locations close Locations Naples, FL Indianapolis, IN Atlanta, GA Pittsburgh, PA Oklahoma City, OK BURN Naples Events A Night in Old Havana October 17, 2024 Event Details Event A Night in Old Havana Date & Time October 17, 2024 7:00 PM Attire Havana Inspired Location â 9110 Strada Place, Suite 6160 Naples, FL, 34108 (239) 653 - 9013 Get your Tickets vip & Bottle Service Events Burn Naples Get notifications about events VIP & Group Bookings Get Notifications BURN's flagship walk-in humidor, crafted from Spanish cedar, boasts an impressive array of over 400 premium hand-rolled cigars. Among these offerings, you'll discover the complete Rocky Patel Premium Cigar collection readily available within all our humidors. Please reach out to your local BURN location for information on all other Premium Cigar Brands that they carry. Step into the vibrant world of Havana with A Night in Old Havana at BURN Naples on October 17th! Immerse yourself in the sultry rhythms, fine cigars, and premium spirits that capture the essence of the Cuban capital. The evening kicks off with an exclusive Locker Member Reception at 6pm, where our members will enjoy an intimate experience before the event opens to the public at 7pm. Sip on the exquisite Ron Zacapa 23, a liquor known for its rich, complex flavors, while savoring the exceptional Year of The Dragon cigar by Rocky Patel, carefully selected for this special occasion. Throughout the night, take advantage of cigar box deals while you enjoy the atmosphere of luxury and celebration. Whether you're a seasoned cigar aficionado or just looking for a night of indulgence, this event promises a unique, memorable experience. For Table & Bottle Service, Please Contact Ivan@burnbyrockypatel.com . Donât miss your chance to enjoy the spirit of Old Havana in the heart of Naples! Get your Tickets vip & Bottle Service Events Burn Naples Upcoming Events January 5, 2026 Industry Night at BURN! Sunday & Monday January 7, 2026 Ladies Night at BURN! Join the BURN Family * indicates required Name Email Address * Burn Location Burn Atlanta Burn Indianpolis Burn Naples Burn OKC Burn Pittsburgh Other Locations Atlanta Naples Indianapolis Oklahoma CIty Pittsburgh Explore more Latest News Rocky Patel premium Cigars Career Opportunities The Humidor The Humidor Locker Membership Our Events January 5, 2026 Industry Night at BURN! Sunday & Monday January 7, 2026 Ladies Night at BURN! All events All Events"
    },
    {
      "url": "https://www.burnbyrockypatel.com/naples-cigar-events/schools-out-for-summer-at-burn",
      "text": "Schools out for Summer at BURN! on Jun 19, 2025 | Naples, FL Event |Cigar Bar | BURN by Rocky Patel Naples Close World of BURN Home Our Humidor Locker Membership Latest News Rocky Patel Premium Cigars Career Opportunities Locations Naples, FL Indianapolis, IN Atlanta, GA Pittsburgh, PA Oklahoma City, OK Locker Membership Locations close Locations Naples, FL Indianapolis, IN Atlanta, GA Pittsburgh, PA Oklahoma City, OK BURN Naples Events Schools out for Summer at BURN! June 19, 2025 Event Details Event Schools out for Summer at BURN! Date & Time June 19, 2025 7:00 PM Attire Location â 9110 Strada Place, Suite 6160 Naples, FL, 34108 (239) 653 - 9013 Get your Tickets vip & Bottle Service Events Burn Naples Get notifications about events VIP & Group Bookings Get Notifications BURN's flagship walk-in humidor, crafted from Spanish cedar, boasts an impressive array of over 400 premium hand-rolled cigars. Among these offerings, you'll discover the complete Rocky Patel Premium Cigar collection readily available within all our humidors. Please reach out to your local BURN location for information on all other Premium Cigar Brands that they carry. Schoolâs Out For Summer â June 19th at 7PM Class is officially out, and the summer celebration starts here at BURN by Rocky Patel Naples . Join us on Thursday, June 19th at 7PM for an unforgettable night that kicks off the season with style, flavor, and flair. Expect an electric atmosphere with: ð¥ Cigar deals on premium selections ð¹ Drink specials crafted to cool you down ð A fun and playful school's-out theme , featuring our staff dressed for the occasion Whether you're ready to toast to summer freedom or just looking for a midweek escape, this is your chance to indulge in a night of luxury and excitement. For table and bottle service, please contact: Ivan â ivan@burnbyrockypatel.com | 239.298.9707 Photos and videos may be taken during this event. By attending, you consent to your image being used by BURN by Rocky Patel. Get your Tickets vip & Bottle Service Events Burn Naples Upcoming Events January 5, 2026 Industry Night at BURN! Sunday & Monday January 7, 2026 Ladies Night at BURN! Join the BURN Family * indicates required Name Email Address * Burn Location Burn Atlanta Burn Indianpolis Burn Naples Burn OKC Burn Pittsburgh Other Locations Atlanta Naples Indianapolis Oklahoma CIty Pittsburgh Explore more Latest News Rocky Patel premium Cigars Career Opportunities The Humidor The Humidor Locker Membership Our Events January 5, 2026 Industry Night at BURN! Sunday & Monday January 7, 2026 Ladies Night at BURN! All events All Events"
    },
    {
      "url": "https://www.rockypatel.com/event/burn-by-rocky-patel-naples-feat-rocky-patel-2/",
      "text": "BURN by Rocky Patel Naples (feat. Rocky Patel) - Rocky Patel Premium Cigars Skip to content Un-authorized Retailers FAQ News My Account Cigars 30th Anniversary Year of the Snake Full Portfolio Top Rated Cigars New Cigars Nicaraguan Collection Honduran Collection Shop Full Catalog Accessories Apparel Man Cave RP Art Gallery Returns & Warranty Retailers Our Retailers Special Edition Retailers Un-authorized Retailers Cigars 30th Anniversary Year of the Snake Full Portfolio Top Rated Cigars New Cigars Shop Full Catalog Accessories Apparel Man Cave RP Art Gallery Returns & Warranty Retailers Our Retailers Special Edition Retailers Un-authorized Retailers Events Cigar Events Cigar Smoking World Championship Our Factories How a Cigar is Made Cigar Factories Factory Tour About Story of Rocky Patel RP Family Your RP Reps FAQ RP Cinema Tubeaux by Rocky Patel News Contact My account Cart Events Cigar Events Cigar Smoking World Championship Our Farms How a Cigar is Made Cigar Factories Cigar Factory: Honduras Cigar Factory: Nicaragua Factory Tour About Story of Rocky Patel RP Cinema RP Family Your RP Reps Contact « All Events This event has passed. BURN by Rocky Patel Naples (feat. Rocky Patel) May 21 @ 7:00 pm - 10:00 pm « Galiano Cigar Room Queensbury Cigar & Pipe » 🐍 Year of the Snake Party at BURN Naples 🐍 Wednesday, May 21st | 7 PM Join us at BURN by Rocky Patel Naples for the official celebration of Rocky Patel’s newest release — Year of the Snake. Be among the first to experience this bold new cigar, inspired by the mystique and power of the snake. Enjoy exclusive Year of the Snake cigar specials, themed cocktails, and an unforgettable night steeped in luxury and allure. Slither in and raise a glass to the next legendary blend in the Rocky Patel lineup. For Table & Bottle Service, Please Contact: Ivan | ivan@burnbyrockypatel.com | 239.298.9707 Add to calendar Google Calendar iCalendar Outlook 365 Outlook Live Details Date: May 21 Time: 7:00 pm - 10:00 pm Event Category: Rocky Patel Website: https://www.burnbyrockypatel.com/naples-cigar-events/year-of-the-snake-release-party Venue BURN by Rocky Patel Naples 9110 Strada Place #6160 Naples , FL 34108 United States + Google Map Phone (239) 653-9013 View Venue Website « Galiano Cigar Room Queensbury Cigar & Pipe » Sign up to be a RP VIP MEMBER Email Address Please enter a valid email address. Subscribe! Thanks for subscribing! Please check your email for further instructions. Something went wrong. Please check your entries and try again. Lighters Cutters Ashtrays Cigars HOME FAQ The Family Making a  cigar BURN Lounge © 2025 Rocky Patel Premium Cigars, INC. – All rights reserved | Privacy Policy | Cookie Policy | FAQ | Contact Scroll To Top"
    },
    {
      "url": "https://www.burnbyrockypatel.com/naples-cigar-events/a-night-with-the-bunnies-at-burn",
      "text": "A Night With the Bunnies at BURN! on Apr 17, 2025 | Naples, FL Event |Cigar Bar | BURN by Rocky Patel Naples Close World of BURN Home Our Humidor Locker Membership Latest News Rocky Patel Premium Cigars Career Opportunities Locations Naples, FL Indianapolis, IN Atlanta, GA Pittsburgh, PA Oklahoma City, OK Locker Membership Locations close Locations Naples, FL Indianapolis, IN Atlanta, GA Pittsburgh, PA Oklahoma City, OK BURN Naples Events A Night With the Bunnies at BURN! April 17, 2025 Event Details Event A Night With the Bunnies at BURN! Date & Time April 17, 2025 7:00 PM Attire Location â 9110 Strada Place, Suite 6160 Naples, FL, 34108 (239) 653 - 9013 Get your Tickets vip & Bottle Service Events Burn Naples Get notifications about events VIP & Group Bookings Get Notifications BURN's flagship walk-in humidor, crafted from Spanish cedar, boasts an impressive array of over 400 premium hand-rolled cigars. Among these offerings, you'll discover the complete Rocky Patel Premium Cigar collection readily available within all our humidors. Please reach out to your local BURN location for information on all other Premium Cigar Brands that they carry. Night With The Bunnies at BURN Naples ð°ð¥ Join us on April 17th at 7 PM for a night of playful elegance, premium cigars, and handcrafted cocktailsâbrought to you by Casamigos Tequila . Our staff will be dressed as bunnies, setting the scene for an unforgettable evening of fun and luxury. Sip on expertly crafted Casamigos cocktails, enjoy the finest cigars, and indulge in the unmatched BURN experience. ð Date: April 17th â° Time: 7 PM ð¸ Sponsored by: Casamigos Tequila For table & bottle service , contact Ivan@burnbyrockypatel.com | 239-298-9707 Get your Tickets vip & Bottle Service Events Burn Naples Upcoming Events January 5, 2026 Industry Night at BURN! Sunday & Monday January 7, 2026 Ladies Night at BURN! Join the BURN Family * indicates required Name Email Address * Burn Location Burn Atlanta Burn Indianpolis Burn Naples Burn OKC Burn Pittsburgh Other Locations Atlanta Naples Indianapolis Oklahoma CIty Pittsburgh Explore more Latest News Rocky Patel premium Cigars Career Opportunities The Humidor The Humidor Locker Membership Our Events January 5, 2026 Industry Night at BURN! Sunday & Monday January 7, 2026 Ladies Night at BURN! All events All Events"
    },
    {
      "url": "https://www.burnbyrockypatel.com/naples-cigar-events/anniversary-at-burn",
      "text": "Anniversary at BURN! on Feb 28, 2025 | Naples, FL Event |Cigar Bar | BURN by Rocky Patel Naples Close World of BURN Home Our Humidor Locker Membership Latest News Rocky Patel Premium Cigars Career Opportunities Locations Naples, FL Indianapolis, IN Atlanta, GA Pittsburgh, PA Oklahoma City, OK Locker Membership Locations close Locations Naples, FL Indianapolis, IN Atlanta, GA Pittsburgh, PA Oklahoma City, OK BURN Naples Events Anniversary at BURN! February 28, 2025 Event Details Event Anniversary at BURN! Date & Time February 28, 2025 6:00 PM Attire Location â 9110 Strada Place, Suite 6160 Naples, FL, 34108 (239) 653 - 9013 Get your Tickets vip & Bottle Service Events Burn Naples Get notifications about events VIP & Group Bookings Get Notifications BURN's flagship walk-in humidor, crafted from Spanish cedar, boasts an impressive array of over 400 premium hand-rolled cigars. Among these offerings, you'll discover the complete Rocky Patel Premium Cigar collection readily available within all our humidors. Please reach out to your local BURN location for information on all other Premium Cigar Brands that they carry. Join us at BURN by Rocky Patel Naples on February 28th at 6 PM as we celebrate another incredible year with our Anniversary Party! Enjoy an unforgettable evening with a special guest appearance from Rocky Patel , exclusive cigar deals, box specials, featured drinks, and more . The night is proudly sponsored by Casamigos Tequila , bringing you exceptional pours to elevate the celebration. Don't miss this chance to indulge in premium cigars, top-tier spirits, and a night of luxury. For table or bottle service , please contact Ivan@burnbyrockypatel.com or call 239-298-9707 . â Get your Tickets vip & Bottle Service Events Burn Naples Upcoming Events January 5, 2026 Industry Night at BURN! Sunday & Monday January 7, 2026 Ladies Night at BURN! Join the BURN Family * indicates required Name Email Address * Burn Location Burn Atlanta Burn Indianpolis Burn Naples Burn OKC Burn Pittsburgh Other Locations Atlanta Naples Indianapolis Oklahoma CIty Pittsburgh Explore more Latest News Rocky Patel premium Cigars Career Opportunities The Humidor The Humidor Locker Membership Our Events January 5, 2026 Industry Night at BURN! Sunday & Monday January 7, 2026 Ladies Night at BURN! All events All Events"
    },
    {
      "url": "https://www.burnbyrockypatel.com/naples-cigar-events/year-of-the-snake-release-party",
      "text": "Year of the Snake Release Party! on May 21, 2025 | Naples, FL Event |Cigar Bar | BURN by Rocky Patel Naples Close World of BURN Home Our Humidor Locker Membership Latest News Rocky Patel Premium Cigars Career Opportunities Locations Naples, FL Indianapolis, IN Atlanta, GA Pittsburgh, PA Oklahoma City, OK Locker Membership Locations close Locations Naples, FL Indianapolis, IN Atlanta, GA Pittsburgh, PA Oklahoma City, OK BURN Naples Events Year of the Snake Release Party! May 21, 2025 Event Details Event Year of the Snake Release Party! Date & Time May 21, 2025 7:00 PM Attire Location â 9110 Strada Place, Suite 6160 Naples, FL, 34108 (239) 653 - 9013 Get your Tickets vip & Bottle Service Events Burn Naples Get notifications about events VIP & Group Bookings Get Notifications BURN's flagship walk-in humidor, crafted from Spanish cedar, boasts an impressive array of over 400 premium hand-rolled cigars. Among these offerings, you'll discover the complete Rocky Patel Premium Cigar collection readily available within all our humidors. Please reach out to your local BURN location for information on all other Premium Cigar Brands that they carry. ð Year of the Snake Party at BURN Naples ð Wednesday, May 21st | 7 PM Join us at BURN by Rocky Patel Naples for the official celebration of Rocky Patel's newest release â Year of the Snake . Be among the first to experience this bold new cigar, inspired by the mystique and power of the snake. Enjoy exclusive Year of the Snake cigar specials , themed cocktails, and an unforgettable night steeped in luxury and allure. Slither in and raise a glass to the next legendary blend in the Rocky Patel lineup. For Table & Bottle Service, Please Contact: Ivan | ivan@burnbyrockypatel.com | 239.298.9707 Get your Tickets vip & Bottle Service Events Burn Naples Upcoming Events January 5, 2026 Industry Night at BURN! Sunday & Monday January 7, 2026 Ladies Night at BURN! Join the BURN Family * indicates required Name Email Address * Burn Location Burn Atlanta Burn Indianpolis Burn Naples Burn OKC Burn Pittsburgh Other Locations Atlanta Naples Indianapolis Oklahoma CIty Pittsburgh Explore more Latest News Rocky Patel premium Cigars Career Opportunities The Humidor The Humidor Locker Membership Our Events January 5, 2026 Industry Night at BURN! Sunday & Monday January 7, 2026 Ladies Night at BURN! All events All Events"
    }
  ]
}