{
  "fuentes": [
    {
      "url": "https://www.muranolondon.com/contact/",
      "email": "enquiries@muranolondon.com"
    },
    {
      "url": "https://www.muranolondon.com/contact/",
      "email": "info@gemmabellandcompany.com"
    },
    {
      "url": "https://lazonamuerta.net/contact/",
      "email": "dj_convoy@lazonamuerta.blog"
    },
    {
      "url": "https://www.cafemurano.co.uk/restaurants/covent-garden-restaurant/",
      "email": "coventgarden@cafemurano.co.uk"
    },
    {
      "url": "https://www.cafemurano.co.uk/restaurants/covent-garden-restaurant/",
      "email": "privatedining@cafemurano.co.uk"
    },
    {
      "url": "https://www.groupon.com/biz/altamonte-springs-fl/cafe-murano-1",
      "email": "verify@r.groupon.com"
    },
    {
      "url": "https://www.murano.com.mx/en/directivos",
      "email": "investors@murano.com.mx"
    },
    {
      "url": "https://gifts.cafemurano.co.uk/contact-us/",
      "email": "cafe-murano-logo-gold@2x.png"
    },
    {
      "url": "https://www.cafemurano.co.uk/restaurants/st-james-restaurant/",
      "email": "feedback@cafemurano.co.uk"
    },
    {
      "url": "https://www.cafemurano.co.uk/restaurants/st-james-restaurant/",
      "email": "privatedining@cafemurano.co.uk"
    },
    {
      "url": "https://www.cafemurano.co.uk/restaurants/st-james-restaurant/",
      "email": "reception@cafemurano.co.uk"
    },
    {
      "url": "https://www.cafemurano.com/contact-us/",
      "email": "info@cafemurano.com"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "https://finewineliquors.com/contact-us/",
      "email": "sales@finewineliquors.com"
    }
  ],
  "mails": [
    "cafe-murano-logo-gold@2x.png",
    "coventgarden@cafemurano.co.uk",
    "dj_convoy@lazonamuerta.blog",
    "enquiries@muranolondon.com",
    "feedback@cafemurano.co.uk",
    "info@cafemurano.com",
    "info@gemmabellandcompany.com",
    "info@reception-plus.de",
    "investors@murano.com.mx",
    "privatedining@cafemurano.co.uk",
    "reception@cafemurano.co.uk",
    "sales@finewineliquors.com",
    "verify@r.groupon.com"
  ],
  "nombre_sitio": "cafemurano.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.muranolondon.com/contact/",
      "text": "Contact Us - British-Italian Michelin-star Restaurant - Murano Menus Private Dining Gifting Journal Team Careers Contact Reservations Close Contact Finding us 20 Queen Street Mayfair London W1J 5PP +44 (0)20 7495 1127 enquiries@muranolondon.com For Private Hires & Private Events please contact: enquiries@muranolondon.com For Press please contact: info@gemmabellandcompany.com Opening Hours MONDAY – THURSDAY Lunch: 12:00pm – 2:30pm Dinner: 6:00pm – 10:00pm FRIDAY – SATURDAY Lunch: 12:00pm – 3:00pm Dinner: 6:30pm – 10:00pm Newsletter sign up → 20 Queen Street Mayfair, London W1J 5PP. +44 (0)20 7495 1127 nearest station: Green park Angela Hartnett → Cafe Murano → © 2025 Murano Legal → Design by Ignite → Back to top ↑ Reservations → Menus Private Dining Gifting Journal Team Careers Contact Reservations Reservations To make a reservation please book online or email us enquiries@muranolondon.com If a suitable reservation is not available online, please email the restaurant and we shall do our best to accommodate your request. Group Bookings For private events or groups of 9 or over please call us directly. For tables of 2 and above we require Credit or Debit card details to secure the booking. Please note that a fee might apply in the event of a no-show or a cancellation made less than 48 hours prior to the seating time. Hear the latest news from Murano Your Email Address Your First Name Your Last Name If you are interested in hearing from Murano, please tick this box Please select that you agree with the privacy statement"
    },
    {
      "url": "https://lazonamuerta.net/contact/",
      "text": "Contact – La Zona Muerta La Zona Muerta Blog About Contact Home Contact Don’t hesitate to reach out with the contact information below, or send a message using the form. Get in Touch dj_convoy@lazonamuerta.blog DeviantArt YouTube Send Us a Message Go back Your message has been sent Name (required) Warning Email (required) Warning Website Warning (required) Warning Warning. Submit Δ Like Loading… Designed with WordPress Subscribe Subscribed La Zona Muerta Sign me up Already have a WordPress.com account? Log in now. La Zona Muerta Subscribe Subscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar %d"
    },
    {
      "url": "https://www.cafemurano.co.uk/restaurants/covent-garden-restaurant/",
      "text": "Italian Restaurant in Covent Garden - Angela Hartnett’s Cafe Murano Cafe Murano Logo Home Restaurants St James’s Covent Garden Bermondsey Marylebone Menus Private Dining News & Events Careers About us Shop Online Book a Table Covent Garden Restaurant 36 Tavistock Street London WC2E 7PB 020 7240 3654 coventgarden@cafemurano.co.uk Let us know how your visit was Opening Hours MON 12.00PM - 3.00PM 5.00PM - 10.30PM TUE 12.00PM - 3.00PM 5.00PM - 10.30PM WED 12.00PM - 3.00PM 5.00PM - 10.30PM THU 12.00PM - 3.00PM 5.00PM - 10.30PM FRI 12.00PM - 3.00PM 5.00PM - 10.30PM SAT 12.00PM - 3.00PM 5.00PM - 10.30PM SUN 12.00PM - 6.00PM Opening Hours MON 12.00PM - 3.00PM 5.00PM - 10.30PM TUE 12.00PM - 3.00PM 5.00PM - 10.30PM WED 12.00PM - 3.00PM 5.00PM - 10.30PM THU 12.00PM - 3.00PM 5.00PM - 10.30PM FRI 12.00PM - 3.00PM 5.00PM - 10.30PM SAT 12.00PM - 3.00PM 5.00PM - 10.30PM SUN 12.00PM - 6.00PM About Menus Private Dining Visit Covent Garden Leather banquettes and a long marble dining bar for Angela Hartnett’s Italian dishes. Our Covent Garden restaurant, in the heart of London. Relaxed, welcoming, and intimate. Private dining experiences and theatre menu options to enjoy every day of the week. Menus A La Carte Lunch/Theatre Dessert Wine Select dining space First floor dining room Pastificio Private Dining Intimate first floor private dining room Dedicated bar Skylight roof Seating for 20-50 guests Summer menu 2024 Events Brochure Wine list Covent Garden features two unique private dining rooms. On the first floor a large dining room flooded with natural light  accommodates 20-50 guests and includes a dedicated bar, while next door to the restaurant a more intimate space for up to 14 guests within our pasta shop/Italian deli. Please email privatedining@cafemurano.co.uk to enquire now. Enquire Now Private Dining Pastificio Intimate space Housed within pasta shop / deli up to 22 guests Summer Menu 2024 Private Dining Brochure Wine List Covent Garden features two unique private dining rooms. On the first floor a large dining room flooded with natural light  accommodates 20-50 guests and includes a dedicated bar, while next door to the restaurant a more intimate space for up to 22 guests within our pasta shop/Italian deli. Please email privatedining@cafemurano.co.uk to enquire now. Enquire Now Visit 36 Tavistock Street London WC2E 7PB 020 7240 3654 coventgarden@cafemurano.co.uk Let us know how your visit was Book a Table Subscribe to our mailing list Sign up Now Cafe Murano Marylebone Cafe Murano Bermondsey Cafe Murano St James’s Cafe Murano Covent Garden Careers Privacy Policy Angela Hartnett Murano Website by Ignite Book a Table Please select a restaurant Select restaurant Marylebone Bermondsey St James’s Covent Garden Book a Table Subscribe to our mailing list Preferred Location* Covent Garden St James Bermondsey Marylebone Consent If you are interested in hearing more information about Cafe Murano, tick this box I agree with the privacy statement"
    },
    {
      "url": "https://www.groupon.com/biz/altamonte-springs-fl/cafe-murano-1",
      "text": "Cafe Murano, 309 Cranes Roost Boulevard, Altamonte Springs, FL - Groupon Download our app for exclusive deals Sell on Groupon English Chicago Sign In Beauty & Spas Beauty & Spas Massage Hair Removal Face & Skin Care Cosmetic Procedures Spas Hair & Styling Health & Fitness Weight Loss Nail Salons Dental Brows & Lashes Tanning Beauty & Spas Things To Do Things To Do Fun & Leisure Tickets & Events Kids Activities Sightseeing & Tours Sports & Outdoors Museums & Galleries Photography Amusement Parks Bowling Trampoline & Bounce Houses Boat Tours Classes Escape Games Arcades Things To Do Auto & Home Auto & Home Oil Change Auto Repair & Maintenance Car Wash Parking Home Services Cleaning Services Bedding Furniture Patio, Lawn & Garden Kitchen & Dining Auto & Home Food & Drink Food & Drink Restaurants Cafes & Treats Bakeries Bars Breweries, Wineries & Distilleries Groceries & Markets American Restaurants Asian Restaurants Latin American Restaurants Pizza Seafood Restaurants Steakhouse Food & Drink Gifts Gifts Recipient For Her For Him For Couples For Kids Occasion Birthday Anniversary Wedding Graduation Interest Foodies Relaxing Care Sports Fun Leisure Housewarming Travelers Learning Price Under $10 Under $20 Under $50 Under $100 $100+ More Trending gifts Personalized gifts Flowers, Sweets & Baskets Gift cards Gifts Local Local Beauty & Spas Personal Services Health & Fitness Retail Things To Do Food & Drink Auto & Home Improvement Home Services Gift Cards Local Travel Travel Air-Inclusive Waterparks Casinos Family Romantic Beach Destinations City Outdoor Activities All-Inclusive Cruises Culinary Luxury Spa & Wellness Unique Lodging Travel Goods Goods Health & Beauty Products Fragrance Hair Care Vitamins & Supplements Sexual Wellness Personal Care Skin Care Oral Care Health Care Cosmetics Bath & Body Men's Health & Beauty Massage Aromatherapy Shaving & Grooming For the Home Bedding Furniture Kitchen & Dining Luggage Outdoor Décor Patio, Lawn & Garden Mattresses & Accessories Storage & Organization Bath Home Appliances Floor Care & Cleaning Home Decor Office & School Supplies Seasonal Decor Women's Fashion Women's Clothing Women's Accessories Intimates Women's Shoes Maternity Clothing Personalized Gifts Photo Books Cards, Invitations & Stationery Canvas & Photo Art Custom Gifts & Gadgets Jewelry Clothing & Accessories Home Decor Kitchen Accessories Baby & Kids Pets Bags More Flowers, Sweets & Baskets CBD Cell Phones & Accessories Software Electronics Video Games Jewelry & Watches Men's Fashion Grocery & Household Auto & Home Improvement Sports & Outdoors Pet Supplies Baby & Kids Toys Goods Coupons Coupons Popular Brands Amazon Costco eBay Expedia Great Clips Hotels.com Macy's Nike Pizza Hut The Home Depot TurboTax Viator VistaPrint Walmart Wayfair Trending Betterhelp Booking.com Budget Cabela's Dick's Sporting Goods HBO Max Macy's Old Navy Paramount+ ProFlowers Sam's Club Shutterfly Sunglass Hut TaxSlayer Wayfair Coupons Blog Best 4th of July Sales & Promo Codes Sephora Sales Calendar 2024 Hobby Lobby 2024 Sales Calendar Amazon Prime Day Deals on July 16 & 17 Amazon Prime Discount: Do You Qualify? Amazon Music Unlimited Free 3-Month Trial Ulta 2024 Sales Calendar Back to School: Shop Tax-Free Weekends Nike Factory Outlet Stores Lowe's 2024 Sales Calendar Home Depot 2024 Seasonal Sales Guide Nordstrom Anniversary Sale Calendar Walmart Vision Center Price Guide Cheapest Diaper Deals this Week Macy's 2024 Sales Calendar Coupons Home Cafe Murano, Altamonte Springs Cafe Murano, Altamonte Springs 309 Cranes Roost Boulevard, Altamonte Springs, FL 32701 Deals at this location No deals are currently available at this location. This merchant doesn't have any deals and is not affiliated with Groupon. Please contact them directly for services. Is this your business? Similar deals House of Blues ( 7 Locations ) Show or Night Out dining packages for 2 or 4 individuals at House of Blues (Up to 42% Off) 1490 East Buena Vista Drive, Orlando 994.4 mi $96 $65 -32% Book Online Chicago Skyline Tiki Chic Party Cruise on Lake Michigan Island Party Boat $35 3.8 (26) Crepe It Up And Bowls Sip Lattes, Bite Croissants, Savor Crepes – Ultimate Indulgence 1340 75th Street, Downers Grove 22.1 mi $26.28 $18 -32% 5 (38) How to reach us © MapTiler © OpenStreetMap contributors Cafe Murano 977.8 mi 309 Cranes Roost Boulevard, Altamonte Springs, FL 32701 Closed Opening at 11:00 AM Closed Opening at 11:00 AM Call Directions Visit website Parking Good for Kids Price Takes Reservations +14078345880 http://www.cafe-murano.com About Cafe Murano Fill up on fare from Cafe Murano in Altamonte Springs and be sure to satisfy your stomach. Enjoy a drink with your dinner ? this restaurant has a full bar to serve up a glass of wine, beer, or more. No need to splurge on a babysitter ? tots will be right at home chowing down at this restaurant. On warmer days, you can take advantage of Cafe Murano's al fresco patio seating. Seating is readily available at Cafe Murano for those with large parties. Stay connected at no cost thanks to Cafe Murano's wifi. For those who prefer to dress down for dinner, Cafe Murano's low-key style is the perfect match. Need to get out of the house? Order and pick up from this restaurant. At Cafe Murano, drivers can settle for safe parking in the lot next door. Cafe Murano makes bikers feel at ease with the multiple storage racks outside. Cafe Murano is serving up five-star food at a reasonable price. If you're looking to rack up your frequent flyer miles, feel free to pay by major credit card. Customer Reviews 100% Verified Reviews All Groupon reviews are from people who have redeemed deals with this merchant. Review requests are sent by email to customers who purchased the deal. | | | | | | Trending in Groupon Groupon is your place for savings and discovery while exploring fun activities in your city and around the country. Explore categories Popular Things Nearby Things To Do In Popular Cities By Cities Coupons and Promo Codes Beauty & Spas Deep Tissue Massage Near You Full Body Massage Near You Teeth Cleaning Near You Lash Extensions Near You Keratin Treatment Near You Reflexology Near You Eyebrow Threading Near You Brazilian Wax Near You Pedicure Near You Day Spa Near You Lip Fillers Near You Tanning Near You Massage Near You Laser Hair Removal Near You Nail Salon Near You Couples Massage Near You Salon Near You Barber Shops Near You Hair Salons Near You Spa Near You Haircut Near You Botox Near You Facials Near You Waxing Near You Food & Drink Food Near You American Restaurants Near You Bars Near You Chinese Food Near You Indian Food Near You Italian Restaurants Near You Mexican Food Near You Pizza Near You Steakhouses Near You Sushi Near You Things To Do Fun Activities Near You Cheap Movie Tickets Events Near You Photography Classes Near You Kids Shows Near You Cheap Concert Tickets Things to Do Near You Amusement Parks Near You Arcade Near You Bowling Near You Escape Room Near You Kids Activities Near You Mini Golf Near You Museums Near You Trampoline Park Near You Zoos Near You Health & Fitness Eye Exam Near You Dentist Near You Teeth Whitening Near You B12 Shots Near You Pilates Near You Chiropractor Near You Dance Classes Near You Dermatologist Near You Fitness Classes Near You Colon Cleanse Near You Invisalign Near You Golf Near You Gyms Near You Weight Loss Clinic Near You Yoga Near You Automotive Oil Change Near You Car Detailing Near You Car Wash Near You Mechanic Near You Wheel Alignment Near You Personal Services Classes Near You Hobbies Near You Cooking Classes Near You Photographers Near You Home Services Air Duct Clening Near You Carpet Cleaning Near You Things To Do In Atlanta Things To Do In Austin Things To Do In Baltimore Things To Do In Boston Things To Do In Calgary Things To Do In Charleston Things To Do In Charlotte Things To Do In Chicago Things To Do In Dallas Things To Do In Denver Things To Do In Edmonton Things To Do In Houston Things To Do In Las Vegas Things To Do In Los Angeles Things To Do In Miami Things To Do In New York City Things To Do In Orlando Things To Do In Ottawa Things To Do In Philadelphia Things To Do In Phoenix Things To Do In Portland Things To Do In San Antonio Things To Do In San Diego Things To Do In San Francisco Things To Do In San Jose Things To Do In Seattle Things To Do In Tampa Things To Do In Toronto Things To Do In Vancouver Things To Do In Washington D.C. Things To Do In Indianapolis Atlanta Austin Baltimore Boston Calgary Charleston Charlotte Chicago Dallas Denver Edmonton Houston Las Vegas Los Angeles Miami New York City Orlando Ottawa Philadelphia Phoenix Portland San Antonio San Diego San Francisco San Jose Seattle Tampa Toronto Vancouver Washington D.C. 1-800-Flowers Coupons Adidas Promo Codes Amazon Promo Codes American Eagle Promo Codes Ancestry DNA Coupons ASOS Promo Codes Bed Bath & Beyond Coupons Boohoo Promo Codes eBay Coupons Edible Arrangements Coupons Forever 21 Coupons H&R Block Coupons Home Depot Coupons Kohl's Coupons L.L.Bean Coupons Lowe's Coupons Macy's Coupons Michaels Coupons Old Navy Coupons Quickbooks Coupons Samsung Coupons Sephora Coupons Target Coupons TJ Maxx Coupons Turbotax Service Codes Udemy Coupons Verizon Wireless Promo Codes Walmart Coupons Weight Watchers Coupons Zales Promo Codes Get the Groupon App Unlock up to 90% discounts on the go with the Groupon app! Exclusive deals, push notifications, and digital vouchers at your fingertips. Get the App 100M+ downloads Groupon Sites USA United Kingdom France Deutschland Italia España Polska Nederland Ireland UAE België Canada Australia Sign up for the latest deals By subscribing, I agree to the Terms of Use and have read the Privacy Statement . Follow Us Support Customer Support Report Infringement Refund Policies Merchant Class Action Settlement Notice Sell on Groupon Join Groupon Marketplace Run a Groupon Campaign How does Groupon work for Merchants Sponsor your Campaign Affiliate Program Vendor Code of Conduct Company About Groupon Jobs Press Investor Relations Management Team Quick Links Treat Yourself Things To Do Coupons Gifts for Occasions © 2025 Groupon, Inc. All Rights Reserved. Terms and Conditions Privacy Statement Do Not Sell or Share My Personal Information Accessibility Sitemap Customer Support Licenses"
    },
    {
      "url": "https://www.murano.com.mx/en/directivos",
      "text": "Grupo Murano EN | ES Home Our company About Murano Strategy Our history Strategic Partners Insights Portfolio Sustainability Investors Contact Management In order to achieve its objectives, Grupo Murano’s operations leverages on a fully multidisciplinary team with\n                  over 20 years of combined experience in the Mexican real estate sector, and also specializes in all matters related\n                  to the structuring of business with operators, providing a first class awareness to pinpoint business opportunities\n                  in Mexico. Elias Sacal Chairman Marcos Sacal CEO / Member of the Board Marco Vázquez Head of Projects Leonel Martínez Legal counselor Gerardo Corona VP, Investor Relations & Strategy / Member of the Board Antonio Álvarez Chief Asset Management Officer & Head of Hospitality Business × Elias Sacal Marcos Sacal Marco Vázquez Leonel Martínez Gerardo Corona Antonio Álvarez Mr. Sacal is the founding member of Bay View Grand and Chairman\n                                    of the Board of Murano . He is a leader within Mexico’s tourism and lodging industry with over 20 years\n                                    of experience developing, acquiring and financing real estate projects. Mr. Sacal developed the “Second Home Living”\n                                    experience for international buyers interested in owning a vacation home in Mexico which was entirely financed with\n                                    local investments. He has led the development of multiple residential real estate projects including BVG Cancun,\n                                    Residencial BVG Ixtapa, Marina Ixtapa and Grand Venetian BVG, among others. Mr. Sacal has been a member of the Patronato del Museo Nacional de Antropología e Historia , the World Federation of Friends of Museums, and adviser\n                                    to the Princess Grace Foundation (Monaco). Mr. Marcos Sacal is the Chief Executive Officer of Murano , overseeing the construction and sale of Residencial Marina BVG Ixtapa for\n                                    over US$89 million, the sale of Residencial Villa Alejandra BVG for US$48 million and Grand Venetian BVG Vallarta for US$300 million.\n                                    He has prior experience in developing technology and Software as a Service (SaaS) platforms for the operation and management of real\n                                    estate assets. He holds a Bachelor’s degree in Business Administration from Universidad Anáhuac , a certification in Corporate Finance\n                                    from the Instituto Tecnológico Autónomo de México (ITAM), and a Finance diploma with a certification in Project Evaluation from Harvard University. Mr. Marco Vázquez has more than 17 years of experience in real estate development, serving as Project Manager for Sanz Arquitectos Asociados since 2005. Before joining Murano, he also worked as Project Manager at Bay View Grand where he led several developments such as Villa Alejandra in Acapulco Guerrero, Grand Ventean in Puerto Vallarta, and Residencial Gran Dorado, in the State of Mexico, among others. Mr. Martínez has a Master’s Degree in Law and broad expertise in contracts, agreements and national and international bids for the development of important projects valued for over US$870 million, highlighting: The Emisor Oriente Tunnel, the Grand Island Hotel, the Samalayuca-Sasabe Gas Pipeline, the Landing Track 03 and Main Terminal of the New International Airport of Mexico City and the New School of Judges in Mexico City. He currently performs as legal counselor of the Murano Group, for projects such as the Wyndham Hotel in Mexico City and Grand Island Cancun Hotel. Mr. Corona has 26 years of experience in strategic business units, financial products, capital goods imports, risk analysis, portfolio recovery and financial structure to foreign trade productive projects at Mexico’s Development Banking. Former Mexico’s Undersecretary of Innovation and Touristic Development. Founder and CEO of GC Intelligi S.C., consulting firm conducting analysis, investigation and consultancy services to hotel projects and of infrastructure in Mexico. Among other positions, Mr. Gerardo Corona was CEO of International and Institutional Relations and Director of Financing for the Tourism Sector at Bancomext. Antonio Álvarez brings 30 years’ luxury hospitality leadership experience to his role, including serving in top positions at\n                                  some of the world’s finest and most celebrated luxury hotels. A specialist in operations, protocols, and logistics – Mr. Álvarez is the epitome of a dynamic international hotelier. His exceptional leadership skills and ability to perform in different\n                                  cultural contexts have made him a valued asset to major Hotel groups & Hospitality development companies around the world. Mr. Álvarez has developed a strong commitment to building and sustaining cohesive, top-performing teams. His background\n                                  includes over 20 years of leadership within different luxury hotel companies portfolio, and has significantly contributed\n                                  to service excellence at Hilton, Ritz-Carlton and Hyatt Hotels based in Western Europe, USA, and Asia Pacific. Result-oriented strategic leader who promotes a culture of excellence and offers a strong track record of performance\n                                  in both Hotel and Corporate business units. Mr. Álvarez has proven abilities in meeting all objectives within company targets and retail / Hospitality operations. Experienced Top Senior Executive and skilled Managing Director & General Manager with\n                                  expertise in hotel management, food and beverage operations, profit and loss management, and guest services operations. Proven areas of expertise also include: Strategic Planning & Organizational leadership, Budgeting & Cost Management,\n                                  Revenue Management & New Business Development, Process Design & Productivity Improvement, Growth & Expansion Strategies,\n                                  Profitability & Cost Analysis, Team Building & Performance Improvement, Contract Negotiations & Strategic Alliances. Murano is a real estate company with extensive experience in the design, structure and delivery of large scale hospitality and commercial projects across Mexico QUICK LINKS About Murano Portfolio Strategic Partners ESG Corporate Headquarters: 25 Berkeley Square London W1J 6HN United Kingdom Mexico City Office: AV. Ffcc de Cuernavaca No. 20, 12 Floor Lomas de Chapultepec, Sección III Miguel Hidalgo,  11000, Mexico City IR contact: +44 207 1676440 investors@murano.com.mx Keep in touch: MURANO © All rights reserved 2021 | Designed and generated by"
    },
    {
      "url": "https://gifts.cafemurano.co.uk/contact-us/",
      "text": "Contact Us - Cafe Murano - Gift Vouchers Contact Us Terms and Conditions Close Home Gift Vouchers Books Contact Us Terms and Conditions Return to main website Contact us Need help? Drop us an email at [email protected] Contact Us Terms and Conditions Subscribe to Email List Submit Incorrect email format Please enter an email address © 2025 Cafe Murano - Gift Vouchers Designed by Ignite. Powered by © Cafe Murano - Gift Vouchers 2020 View Basket £ 0.00"
    },
    {
      "url": "https://www.cafemurano.co.uk/restaurants/st-james-restaurant/",
      "text": "Italian Restaurant St James's - Angela Hartnett's Cafe Murano Cafe Murano Logo Home Restaurants St James’s Covent Garden Bermondsey Marylebone Menus Private Dining News & Events Careers About us Shop Online Book a Table St James's Restaurant 33 St. James's Street London SW1A 1HD 020 3371 5559 reception@cafemurano.co.uk Let us know how your visit was Opening Hours MON 12.00 - 3.00PM, 5.00 - 10.30PM TUE 12.00 - 3.00PM, 5.00 - 10.30PM WED 12.00 - 3.00PM, 5.00 - 10.30PM THU 12.00 - 3.00PM, 5.00 - 10.30PM FRI 12.00 - 3.00PM, 5.00 - 10.30PM SAT 12.00 - 10.30PM SUN 12.00 - 4.30PM Opening Hours MON 12.00 - 3.00PM, 5.00 - 10.30PM TUE 12.00 - 3.00PM, 5.00 - 10.30PM WED 12.00 - 3.00PM, 5.00 - 10.30PM THU 12.00 - 3.00PM, 5.00 - 10.30PM FRI 12.00 - 3.00PM, 5.00 - 10.30PM SAT 12.00 - 10.30PM SUN 12.00 - 4.30PM About Menus Theatre Dining Private Dining Visit St James Join us at Cafe Murano St James's to enjoy Angela Hartnett’s uplifting Italian dishes. Our restaurant near Green Park and Piccadilly Circus, with a warm and welcoming atmosphere. Relax, unwind, and enjoy the rich flavours of Italy's many diverse regions. Please note that due to building limitations, our restrooms are located on the lower ground floor and are not wheelchair accessible. Menus A La Carte Lunch/Theatre Dessert Wine Theatre Dining Complete your evening with a pre theatre dinner near Piccadilly, just a short walk from many of the West End Theatres. Please feel free to join us pre or post your performance, and experience the flavours of Italy. We open for pre theatre dinner from 5.30pm and serve our post theatre menu from 10.00pm. View Menu Private Dining Intimate semi-private dining room. Mood lighting Banquette seating for up to 22 guests Book your next event at one of the best Italian restaurants in London. Please email privatedining@cafemurano.co.uk to enquire now. Enquire Now Menu Please note due to building limitations, Cafe Murano St. James does not have an accessible restroom. Visit 33 St. James's Street London SW1A 1HD 020 3371 5559 reception@cafemurano.co.uk Let us know how your visit was Book a Table Subscribe to our mailing list Sign up Now Cafe Murano Marylebone Cafe Murano Bermondsey Cafe Murano St James’s Cafe Murano Covent Garden Careers Privacy Policy Angela Hartnett Murano Website by Ignite Book a Table Please select a restaurant Select restaurant Marylebone Bermondsey St James’s Covent Garden Book a Table Subscribe to our mailing list Preferred Location* Covent Garden St James Bermondsey Marylebone Consent If you are interested in hearing more information about Cafe Murano, tick this box I agree with the privacy statement"
    },
    {
      "url": "https://www.cafemurano.com/contact-us/",
      "text": "contact us – Cafe Murano Cafe Murano Menu Home Location Gift Cards Our Menus Catering & Events Employment Make a Reservation Home Location Gift Cards Our Menus Catering & Events Employment Make a Reservation Send Us A Note Cafe Murano 309 Cranes Roost Blvd Altamonte Springs, FL (407) 834-5880 info@cafemurano.com Live Music Is Friday, Saturday & Sunday. Happy Hour: Mon – Fri 4-7 Saturday: 11-5 About Us Our food is carefully created using the freshest ingredients made from scratch. There are two cardinal rules of Italian cuisine – eat locally and eat seasonally. Food is part of the rhythm of life, and so Italians eagerly await the arrival of seasonal ingredients . We at Café Murano bring these themes from Italy to you. Quick Links Lunch Menu Dinner Menu Sunday Brunch Menu Catering & Events Red Wine Menu White Wine Menu (407) 834-5880 309 Cranes Roost Blvd Altamonte Springs, Fl. 32701 Copyright © 2021, Café Murano, All Right Reserved (Built by 21st Century Marketing) Terms & Conditions Refund Policy Support"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. E-Mail name Nachricht First name Surname * E-Mail * Nachricht * Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "https://finewineliquors.com/contact-us/",
      "text": "Contact us Fine Wine Liquors Shop By Department Wine Red wine Menu Shiraz Cabernet Sauvignon Pinot Noir Red Blends Other Red Varietals Rosé Cabernet Merlot Shiraz Cabernet Merlot Grenache Tempranillo Sangiovese Nebbiolo Bordeaux Barossa Valley white Wine Menu Chardonnay Riesling Sauvignon blanc Pinot gris grigio Other white varietals White blends Dessert white Popular Regions Menu Bordeaux Barossa Valley Mclaren Vale Coonawarra Margaret River Burgundy Clare Valley Fortified Wine Menu Port Tawny Sherry Apera Vermouth Muscat Mead Tokay Topaque Popular Brands Menu Penfolds Under Wraps Wynns Wendouree Wolf Blass Tyrrell’s Top Selling Macallan 15 Year Old Double Cask $ 165.00 Availability: In Stock Glenfiddich Project XX $ 61.00 Availability: In Stock Glendronach 15 Year Old Revival $ 86.25 Availability: In Stock Beer Discover Beer Menu Craft Beer International Beer Australian Beer Mid Strength Light Beer Low Carb Beer Alcoholic Ginger Beer Home Brew Stout Pilsner Wheat Beer Dark Beer Golden Ale Porter Categories Menu Kegs Cider Craft Beer Domestic Beer Hard Seltzers Import Beer Non-Alcoholic Beer Popular Brands Menu 4 Pines Balter Coopers Little Creatures Stone & Wood Zytho New & Trending Menu New Arrivals Top Rated Craft Beer Light Low Pool Packs Cool Off Craft Beer The Lemonade Stand Country Menu Australia Sweden New Zealand France Spain From to Ready to Drink Organic Wine $69.99 Whiskey Discover whiskey Menu Scotch Whisky American Whiskey Japanese Whisky Australian Whisky Irish Whiskey Canadian Whisky Indian Whisky Discover Vodka Menu Absolut Smirnoff Hunter Distillery Stolichnaya Royal Dragon Crystal Head Poliakov Popular Brands Menu Johnnie Walker Jack Daniel’s Glenfiddich Highland Park Glen Moray Stone & Wood Fortified Wine Menu Whiskey Of The Month Flavored Whiskey Blended Scotch Rye Whiskey Single Malt Scotch Small Batch Bourbon Hot deals of summer Fresh Beer Save up $49.99 Jameson Whiskey Father’s Day Sale 40% off Sitewide! Cogac Cocktail Tequila What’s New New Gift & Accessories Best Sellers Sales & Offers -20% Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Menu Sign In or Register 0 0 $ 0.00 Contact us Home Page Contact us Don’t  hesitate to contact us \nif you need help. Whether you have a question about your order, need assistance with a product, or just want to reach out, you’re in the right place. Feel free to contact us using the details below, and we’ll get back to you as quickly as possible! Address 8560 S Cottage Grove Ave, Chicago, IL 60619, United States Call Us (630) 354-9222 Openning Monday – Friday: 8am – 10pm Saturday – Sunday: 9am – 5pm Contact sales@finewineliquors.com finewineliquorsinfo@gmail.com Got Any Questions? Use the form below to get in touch with the sales team Message Send your message Δ Search Account Cart Same-day local delivery Ground shipping directly to you Free in-store pickup 24/7 customer support Customer Service Menu Help Center My account Track my order Return policy About Us Menu Company info Press Releases Careers Reviews Investor relations Quick Links Menu Search Become a reseller Contact us Terms of service Categories Menu Brandy White Wine Champagne Vodka Tequila Get exclusive offers & rewards Sign up for our members portal to receive some exclusive offer & rewards. It’s easy and free! sign up Leave this field empty if you're human: stay connect Facebook-f Twitter Instagram Pinterest we accept Careers About Us Affiliates Privacy Settings Help Site map Copyright ©  2022 Liquory . All rights reserved. Sign in Create an Account Username or email * Password * Login Lost your password? Main menu Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Home About Us Account Blog Careers Cart Checkout Contact us Legal Notice My account Order Tracking Privacy Policy Refund and Returns Policy Reviews Sample Page Shipping Shop Terms & Conditions Track Wishlist Search for: Search All category All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell’s Black Lebel Blanton’s Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester’s Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell's Black Lebel Blanton's Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester's Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine Hide similarities Highlight differences Select the fields to be shown. Others will be hidden. Drag and drop to rearrange the order. Image SKU Rating Price Stock Availability Add to cart Description Content Weight Dimensions Additional information Click outside to hide the comparison bar Compare Top Shopping cart close ×"
    }
  ]
}