{
  "fuentes": [
    {
      "url": "https://sound.london/contact-us",
      "email": "letsparty@sound.london"
    },
    {
      "url": "https://sound.london/contact-us",
      "email": "marketing@sound.london"
    },
    {
      "url": "https://sound.london/contact-us",
      "email": "play@sound.london"
    },
    {
      "url": "https://sound.london/contact-us",
      "email": "r.ashcroft@verve.com"
    },
    {
      "url": "https://www.cafe27fl.com/events",
      "email": "info@cafe27fl.com"
    },
    {
      "url": "https://www.gothambarandgrill.com/about",
      "email": "bret@gotham.restaurant"
    },
    {
      "url": "https://rivervillegrill.com/contact-us/",
      "email": "info@rivervillegrill.com"
    }
  ],
  "mails": [
    "bret@gotham.restaurant",
    "info@cafe27fl.com",
    "info@rivervillegrill.com",
    "letsparty@sound.london",
    "marketing@sound.london",
    "play@sound.london",
    "r.ashcroft@verve.com"
  ],
  "nombre_sitio": "cafe27fl.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://sound.london/contact-us",
      "text": "Contact Us - Get in Touch | SOUND Skip to content Book A Table Menu Music Sports Christmas New Years Eve Book A Table Facebook Instagram TikTok CONTACT US SOUND Cafe Monday - Thursday: 11.00 am to 11.00 pm Friday & Saturday: 11.00 am to 11.30 pm Sunday: 11.00 am to 10.30 pm SOUND SPORTS BAR Monday - Thursday: 5.00 pm to 11.00 pm Friday: 5.00 pm to 11.30 pm Saturday: 11 am to 11.30 pm Sunday:11.00 am to 10.30 pm SOUND Bar Sunday - Wednesday: 11.00 am to 0.00 am Thursday, Friday & Saturday: 11.00 am to 2.00 am Opening Hours Get  in Touch Looking for more information? A host team is here to help, use the form below to send us a message. First Name * Email * Last Name Phone Number * Message * I'd like to receive news, offers and updates from SOUND Phone: 020 7479 5078 Come and Find us at: The Cumberland Hotel, Great Cumberland Place, Marble Arch, London, W1H 7DL Speak to Our Team General Enquiries Hello@sound.london Media Enquiries Marketing@sound.london Group Enquiries Letsparty@sound.london Artist Enquiries Play@sound.london First Name * Last Name * Email * I'd like to receive news, offers and updates from SOUND Stay in the Loop Sign up for the latest updates, exclusive offers, and events. Don’t miss out on all the exciting happenings at SOUND. Facebook Instagram TikTok Contact us Book a Table Group Booking The Cumberland Careers Partners Terms and Conditions Privacy Policy Cookie Policy 0207479 5078 The Cumberland Hotel,\nGreat Cumberland Place, Marble Arch, London, W1H 7DL © 2025 SOUND"
    },
    {
      "url": "https://www.cafe27fl.com/events",
      "text": "EVENTS | Cafe 27 top of page HOME EVENTS PHOTO GALLERY MENU SHOP CONTACT UPCOMING EVENTS Cafe 27 Freestyle Friday with Felix Sama Fri, Oct 03 Southwest Ranches Ranked the #1 spot for Freestyle Fridays in Florida, Cafe 27 boasts a unique experience. Hosted by Florida's own DJ Felix Sama, a radio personality, remixer, and entrepreneur, these once-a-month events bring together hundreds of freestyle enthusiasts. https://www.facebook.com/share/p/16i1dww3aA/ RSVP Book Your Event Make your next event unforgettable at Cafe27! We offer a charming space perfect for gatherings of all kinds. To discuss your event and book your date, simply contact us and we'll help you create a memorable experience. Book Now Venue Gallery There may be no better way to communicate what we do than through images. As you browse our site, take a few moments to let your eyes linger here, and see if you can get a feel for our signature touch. Address 4690 US Hwy 27, Southwest Ranches, FL 33332 Phone (954) 306-4000 Email info@cafe27fl.com Connect An Oasis on the Edge of Civilization bottom of page"
    },
    {
      "url": "https://www.gothambarandgrill.com/about",
      "text": "About — Gotham Restaurant Cart 0 About JOURNAL GALLERY Chocolate SHOP Library Careers Cart 0 About JOURNAL GALLERY Chocolate SHOP Library Careers GOTHAM RESTAURANT In November of 2021, Gotham reopened with new owners for the first time since 1984. After closing for 18 months during the pandemic, Gotham came back with an updated name—trading “Bar and Grill” for “Restaurant”— a redesigned interior by its original architect James Biber, and a new menu with longtime former pastry chef Ron Paprocki in the role of executive chef. Historically decorated with an unprecedented six three-star New York Times reviews, Gotham’s new owners—former Managing Partner Bret Csencsitz and environmentalist Kevin Conrad—sought to honor this legacy while ushering Gotham into a greener, more mindful era. Filling the restaurant with books, music, and art to complement its world-class dining, Csencsitz’s stated goal is to make Gotham “the most meaningful restaurant in New York.” Arts and dining programming, from evening jazz to exclusive wine dinners, make Gotham a vibrant, ever-evolving destination like the city it calls home. Over the years a host of iconic chefs have cut their teeth in Gotham kitchen. With Gotham’s four decades of culinary history behind him, Paprocki has captured the spirit of Gotham’s approachable yet unforgettable cuisine while introducing his own vision for the menu. The goal to provide unpretentious service in an environment that inspires you and your conversation remains the same today as in 1984. PRESS AND ACCOLADES CLICK TO READ THE REVIEWS OUR PEOPLE BRET CSENCSITZ Managing Partner Since 2007 Bret has served at the helm of Gotham , first as GM then as managing partner, ensuring that the restaurant lives up to its legacy while continuing to push boundaries as a leader in the New York dining scene. During his time on 12th Street, he has also helped develop the Gotham Chocolates program as well as a collection of fine culinary products under the label, Gotham Selections. Csencsitz has also demonstrated his commitment to New York and the food movement through his ongoing work with GrowNYC, on whose board he now serves. Like many in the industry Bret has his roots in the performing arts, having spent much of his early time in the city as a classically trained actor, director, and producer. His studies in the work of the Bard have impacted nearly every aspect of his life and work, including naming his son William…and his daughter Cordelia! Food, family, and the arts remain Csencsitz’s driving passions as he works to cement Gotham’s legacy as New York’s most enduringly excellent and meaningful dining institution. RON PAPROCKI Executive Chef Over the years a host of iconic chefs have cut their teeth in Gotham kitchen. For this new era, Ron Paprocki moves into the role of Executive Chef after nearly ten years as Gotham’s Head Pastry Chef and the co-creator of Gotham Chocolates with Csencsitz in 2015. With Gotham’s four decades of culinary history behind him, Paprocki will draw on the past to reconnect our generations of customers with the cuisine they’ve missed while introducing his own vision for the menu. Prior to Gotham, Ron received his culinary training at Elisabeth-Knipping Schule in Kassel, Germany, and served as an apprentice pastry chef at Café Alheit in Kassel. Upon receiving his diploma in 2004, Ron moved to New York where he became Head Baker and Assistant Pastry Chef at the celebrated Financier Patisserie. Since then he’s been part of the opening teams of Saschsa Bakery/Restaurant, as well as Gordon Ramsay at The London. Chef Paprocki joined the Gotham team in 2012, initially heading up the Pastry Department. In his 2019 3-star New York Times review, restaurant critic Pete Wells raved about Chef Paprocki’s pastry prowess, heralding his pain perdu and soufflés, and calling his tarte Tatin “the greatest in the city.” DANIEL SANON General Manager After serving the late great Four Seasons as General Manager from 2009 to its closing in 2020, Daniel chose to bring his mastery of hospitality downtown for Gotham’s reopening. We are honored and grateful he did. A trilingual leader who has filled every role front and back of house, Daniel is a team and business builder who has a special way with guests and a gift for shaping an elevated yet seemingly effortless fine-dining experience. OUR PARTNERS BALDOR SPECIALTY FOODS BRANDT BEEF BURLAP & BARREL CRESCENT DUCK FARM D’ARTGNAN DEBRAGGA DEMKOTA RANCH BEEF DONE4NY TRUFFLES HEERMANCE FARM GROWNYC ISLAND CREEK OYSTERS NATOORA NIMAN RANCH NORWICH MEADOWS FARM PIERLESS FISH PLANTIN | KAVIARI REGALIS FOODS ROSE AND ARROW ESTATE SMALLHOLD SOLEX FINE FOODS THE CHEFS’ WAREHOUSE TIVOLI MUSHROOMS UNION SQUARE GREENMARKET LOCATION 12 East 12th Street New York, NY 10003 NEARBY TRAINS 4/5/6/N/Q/R/W to Union Square F/M to 6th Ave and 14th Street 1/2/3 to 7th Ave and 14th Street A/C/E to 8th Ave and 14th Street then L to Union Square Gotham Restaurant 12 East 12th Street, New York, NY, 10003, United States 212-380-8660 bret@gotham.restaurant Hours Mon 12:00pm-2:15pm, 5:30pm-9:45pm Tue 12:00pm-2:15pm, 5:30pm-9:45pm Wed 12:00pm-2:15pm, 5:30pm-9:45pm Thu 12:00pm-2:15pm, 5:30pm-9:45pm Fri 12:00pm-2:15pm, 5:30pm-10:00pm Sat 5:00pm-10:30pm Sun 5:00pm-9:45pm"
    },
    {
      "url": "https://rivervillegrill.com/contact-us/",
      "text": "Contact Us - Riverville Bar & Grill Skip to content Our location (608) 424-0020 Menu Menu Our location (608) 424-0020 Get in touch We’d love to hear from you. Here’s how you can reach us! Call us! Want to make a reservation or have a question? (608) 424-0020 Have a question? Fill out my online form . Copyright 2025 © Riverville Bar & Grill Design & Development: Accent Graphix Design Studio Home Browse our Menu Mexican Specials Menu Gallery Contact Us #image_title ×"
    }
  ]
}