{
  "fuentes": [
    {
      "url": "https://www.davinci.de/en/about-us/corporate-culture/",
      "email": "info@davinci.de"
    },
    {
      "url": "https://www.davinci.de/en/about-us/corporate-culture/",
      "email": "steffen.rometsch@davinci.de"
    },
    {
      "url": "https://www.davincisciencecenter.org/contact-us/",
      "email": "ask@davincisciencecenter.org"
    },
    {
      "url": "https://www.davincisciencecenter.org/contact-us/",
      "email": "chosen-sprite@2x.png"
    },
    {
      "url": "https://www.davincisciencecenter.org/contact-us/",
      "email": "members@davincisciencecenter.org"
    },
    {
      "url": "https://www.davincisciencecenter.org/contact-us/",
      "email": "volunteers@davincisciencecenter.org"
    },
    {
      "url": "https://www.mydavinci.com/contactus.html",
      "email": "info@mydavinci.com"
    },
    {
      "url": "https://www.mydavinci.com/contactus.html",
      "email": "info@mydavinci.com"
    },
    {
      "url": "https://www.mydavinci.com/contactus.html",
      "email": "orders@mydavinci.com"
    },
    {
      "url": "https://www.mydavinci.com/contactus.html",
      "email": "orders@mydavinci.com"
    },
    {
      "url": "https://www.mydavinci.com/contactus.html",
      "email": "partners@mydavinci.com"
    },
    {
      "url": "https://www.davinciworkshopcafe.com/",
      "email": "info@davinciworkshopcafe.com"
    },
    {
      "url": "https://davincitrading.com/about-us/",
      "email": "recruitment@davincitrading.com"
    },
    {
      "url": "https://raphaeldelio.medium.com/whats-the-connection-between-leonardo-da-vinci-a-cup-of-coffee-in-lisbon-and-the-nature-of-9098205f6a8f",
      "email": "pressinquiries@medium.com"
    },
    {
      "url": "https://caffevinci.co.uk/",
      "email": "info@caffevinci.com"
    },
    {
      "url": "https://www.skoladavinci.cz/o-nas/about-da-vinci-school",
      "email": "info@skoladavinci.cz"
    },
    {
      "url": "https://www.skoladavinci.cz/o-nas/about-da-vinci-school",
      "email": "jana.nemeckova@skoladavinci.cz"
    },
    {
      "url": "https://www.skoladavinci.cz/o-nas/about-da-vinci-school",
      "email": "jmeno.prijmeni@skoladavinci.cz"
    },
    {
      "url": "https://www.skoladavinci.cz/o-nas/about-da-vinci-school",
      "email": "marketa.korinkova@skoladavinci.cz"
    },
    {
      "url": "https://allmusicmagazine.com/venues/cafe-da-vinci/",
      "email": "all-music-logo-white@2x.png"
    },
    {
      "url": "https://allmusicmagazine.com/venues/cafe-da-vinci/",
      "email": "info@cafedavincideland.com"
    },
    {
      "url": "https://www.compasspoint.org/board-caf%C3%A9-archives",
      "email": "info@compasspoint.org"
    }
  ],
  "mails": [
    "all-music-logo-white@2x.png",
    "ask@davincisciencecenter.org",
    "chosen-sprite@2x.png",
    "info@cafedavincideland.com",
    "info@caffevinci.com",
    "info@compasspoint.org",
    "info@davinci.de",
    "info@davinciworkshopcafe.com",
    "info@mydavinci.com",
    "info@skoladavinci.cz",
    "jana.nemeckova@skoladavinci.cz",
    "jmeno.prijmeni@skoladavinci.cz",
    "marketa.korinkova@skoladavinci.cz",
    "members@davincisciencecenter.org",
    "orders@mydavinci.com",
    "partners@mydavinci.com",
    "pressinquiries@medium.com",
    "recruitment@davincitrading.com",
    "steffen.rometsch@davinci.de",
    "volunteers@davincisciencecenter.org"
  ],
  "nombre_sitio": "cafedavincideland.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.davinci.de/en/about-us/corporate-culture/",
      "text": "Corporate culture | DaVinci en de my DaVinci Social Wall Apply now Career Career You will only be good at what you do of you enjoy doing it. We are looking for: Engineers, project leaders, developers and technicians for the automotive, energy management and Smart City areas. Job search Job profiles Overview Job profiles Development engineer Technical project manager Test engineer Component manager Software engineer Designer Functional safety manager Working for Da Vinci Employee opinions Overview Employee opinions Employee opinion from Cengizhan Temtek Employee opinion from Dirk Pühl Employee opinion from Markus Forner Employee opinion from Samuel Röhl Employee opinion from Anisa Müller Employee opinion from Thomas Conrady Initiative application Relocation FAQ for applicants Services Services Technical project management System development Software development Electronics development Mechanical design Testing Overview Testing Component testing Electronics testing Software testing FAQ for companies Industries Industries Automotive Overview Automotive Automated system tests case study Energy E-Bike Aerospace Mechanical Engineering Medical Technology Commercial Vehicles and Construction Machinery Railway Industry Defense Public Sector Projects Overview Projects Control element testing Cross-model implementation of controls Series support About Us About Us Corporate culture Values & advantages History/Max's story Locations Contact Contact Contact form Contact partners Career Back Overview\n                    Career Job search Job profiles Back Overview\n        Job profiles Development engineer Technical project manager Test engineer Component manager Software engineer Designer Functional safety manager Working for Da Vinci Employee opinions Back Overview\n        Employee opinions Employee opinion from Cengizhan Temtek Employee opinion from Dirk Pühl Employee opinion from Markus Forner Employee opinion from Samuel Röhl Employee opinion from Anisa Müller Employee opinion from Thomas Conrady Initiative application Relocation FAQ for applicants Services Back Overview\n                    Services Technical project management System development Software development Electronics development Mechanical design Testing Back Overview\n        Testing Component testing Electronics testing Software testing FAQ for companies Industries Back Overview\n                    Industries Automotive Back Overview\n        Automotive Automated system tests case study Energy E-Bike Aerospace Mechanical Engineering Medical Technology Commercial Vehicles and Construction Machinery Railway Industry Defense Public Sector Projects Back Overview\n        Projects Control element testing Cross-model implementation of controls Series support About Us Back Overview\n                    About Us Corporate culture Values & advantages History/Max's story Locations Contact Back Contact form Contact partners en de my DaVinci Social Wall Apply now Corporate culture DA VINCI ENGINEERING Hauptstätter Straße 149 D-70178 Stuttgart Phone Mail +49 711 722 40 - 0 / Fax  +49 711 722 40 - 198 info@davinci.de For applicants, frequently asked questions about career opportunities, application documents and job interviews: FAQ for applicants For companies: frequently asked questions about our services, excepteur sint occaecat cupidatat non proident: FAQ for companies Start About Us Corporate culture Uncomplicated and warm Open and supportive Familial and together Above all, we are human: open, familial and warm. First and foremost we are human beings. Our specialists for the automotive, energy management and information technology areas are creative, individual people with history, experiences, desires, hopes and goals. With families and friendships. These individuals and all their needs are our main focus. Because we want to achieve something together with you, we place value on empathetic cooperation. This requires communication on an equal footing and transparent decisions. Uncomplicated and warm It is not only important to our founder and company owner Massimiliano “Max” Cava for Da Vinci Engineering to maintain its Italian/familial identity . Together we are constantly working on ensuring that our company maintains an uncomplicated, open and warm atmosphere despite its strong growth. In this way we make it possible for each and every person, people from many different nations, to feel welcome and in good hands with us. \"There is always room for new ideas.” Samuel Röhl, IT specialist for system integration who has been with Da Vinci since 2020: Find out more Open and supportive A new job brings many changes with it. We support new colleagues from home and abroad throughout the entire relocation process. Moving house and looking for an apartment are just one aspect – we provide support with visits to government offices, visa issues, work permits and language courses. Our open arms begin with helping hands. We also address problems as clearly and directly as we address topics. So that everyone feels comfortable with us. More about our integration services Familial and together The Italian/familial corporate culture is a commitment for us: We take all of our colleagues and their needs and individual life situations seriously. If something changes, then we find a solution together. “Max has always given me a considerable amount of freedom for implementing my ideas and gave me responsibility at an early stage” Anisa Müller, Head of Sales, who has been at Da Vinci since 2007 Find out more We are only as good as the community of our colleagues. This is why we specifically create opportunities for also interfacing with each other outside of work and grow together as a team. On a small and large scale, be it public viewing, the Cannstatter Wasen, a ski trip or a summer festival . “Many other companies promise a great deal to begin with, but there really is something behind it here.” Overall vehicle development project manager Cengizhan Temtek, who has worked at Da Vinci since 2017: Find out more Long term and satisfied We are a service provider with heart. We also approach our customers with the same appreciation and openness that we have for our colleagues. The satisfaction of our employees also pays off directly for our customers – not only do they perform better, but they are also willing to react to new challenges flexibly, quickly and reliably . We can respond quickly and creatively to your personnel bottlenecks. Thanks to the long-term relationships with our employees, we can fall back on numerous experienced specialists. In work contracts, we put together various teams who create professional solutions for our customers with a new, fresh perspective – we have the right, bright minds for every requirement . Our working models For applicants Any questions about us as an employer? Please contact me. Steffen Rometsch Team Coordinator Phone Mail +49 711 72240 - 128 steffen.rometsch@davinci.de Da Vinci Engineering GmbH Hauptstätter Straße 149 70178 Stuttgart Phone Fax Mail +49 711 72240 - 0 +49 711 72240 - 198 info@davinci.de Careers Job search Job profile Entry level Employee opinions Speculative application Relocation FAQ for applicants Services Electronics development Mechanical design Software development System development Technical PM FAQ for companies Industries About us Corporate culture Values & advantages History/Max's story Locations Contact Contact partners Contact form Social Media ©2025 Da Vinci Engineering Imprint Data protection Liability disclaimer"
    },
    {
      "url": "https://www.davincisciencecenter.org/contact-us/",
      "text": "Contact Da Vinci Science Center | Get in Touch Skip to the content Sep 9 Open Today! 10AM-5PM Become a Member Host an Event Donate Search for: Donate Search for: What’s Happening Main Exhibits LVHN My Body Curiosity Hall Science in the Making ATAS Innovation Studio Lehigh River Watershed City Center Gallery Science Theater Traveling Exhibits Mickey Mouse Clubhouse: The Exhibit – Open Sept. 27 Body Worlds 101 – Open Feb. 13, 2026 Events Nathan Pyle Book Launch – Sep 19 Fab Lab Maker Workshops Little Learner’s Community Drop-ins Traveling Exhibit Coming Soon – Mickey Mouse Clubhouse: The Exhibit Open September 27 – In Mickey Mouse Clubhouse: The Exhibit, join Mickey, Minnie, Donald, Daisy, and Goofy inside the Clubhouse to plan and throw a surprise birthday party for Pluto! Learn More Plan Your Visit Visitor Info Visit Us Parking & Directions Retail & Dining Where to Stay Group Visits Birthday Parties Social Narrative & Sensory Map Around the Area Discover Lehigh Valley Downtown Allentown Book a Private Event Private Events Da Vinci Science Center at PPL Pavilion is the perfect venue for corporate gatherings, team building workshops, weddings, and more! Book Today! Learn with Us For Families School’s Out Science Camps Science Clubs Scout Programs Fab Lab Workshops Salvaggio Little Learner’s Lab For Educators School Field Trips Traveling Science Programs Mobile Fabrication Lab Professional Development Career Connection Days STEAM Career Pathways Program District Connect Membership Program Da Vinci Science Center STEAM Awards For Educators School Field Trips Interactive learning opportunities for students of all ages! Book your trip today! Learn More Special Offer District Connect Members SAVE on Field Trips this fall! District Connect members pay only $10 per student when booking field trips this fall! Learn More About Us Who We Are Meet Our Team Our Mission and History Our Impact / Community Annual Reports & Company Policies Our Initiatives: STEAM For All Linny Fowler STEAM Scholarship Fund Women in Science & Engineering (WISE) Initiative STEAM Career Pathways Program Isaacman Next Generation Science Institute Access for All Discount Program Volunteer & Career Opportunities Careers & Internships Volunteer Reach Out News / Press Room Contact Us Membership & Support Membership: Pay Less, Get MORE! Become a Member Corporate Memberships Community Connect Memberships District Connect Membership Program Allentown School District Memberships Individual Support Make Your Gift Curiosity Circle: Monthly Giving Lovett Legacy Society Leonardo Society Science Soiree EITC Giving STEAM Student Scholarship Awards STEAM Educator Awards Corporate Support Sponsorships Event Rentals Corporate Memberships Science Soiree EITC Support STEAM Awards Linny Fowler STEAM Scholarship Fund Support Us Make Your Gift Your support will help us to bring science to life and lives to science in so many ways! Donate Buy Tickets Become a Member Host an Event Home > Contact Us Contact Us Have a question? We’re more than happy to help! Reach Out Email Us Call Us Here’s some helpful contact information Da Vinci Science Center 815 W. Hamilton  Street Allentown, PA 18101 Main Phone and Fax: 484.664.1002 Field Trips and Scouts Phone: 610.841.1875 Outreach Phone: 610.841.1391 Visitor Services: ask@davincisciencecenter.org Membership: members@davincisciencecenter.org Volunteer Services: volunteers@davincisciencecenter.org Click here for a list of staff members. Donation Requests Any requests not submitted through the Donation Request form will not be considered. Submit a Request Reach Out Name (Required) First Last Email (Required) Phone What are you contacting us about? (Required) Select one Visitor/Guest Services Membership Group Visits/Field Trips Camps Traveling Science Programs Event Rentals/Birthday Parties Ticket Donations Media Inquiry Scout Programs Individual or Corporate Giving Scholarships Volunteering Fab Lab/Media Production Studio Careers and Internships Allentown School District STREAM Academy Comments or Questions (Required) CAPTCHA X/Twitter This field is for validation purposes and should be left unchanged. Submit Not sure what you’re looking for? Here’s a few places to start! Summer Camps Through hands-on activities, captivating experiments, and collaborative projects, campers will unleash their curiosity, cultivate critical-thinking skills, and ignite a passion for learning. Learn More Become a Member Memberships pay for themselves in just a few visits, enjoy tons of benefits, and inspire a lifetime of learning. Learn More Host an Event Looking for the perfect venue to host your private events? Look no further than Da Vinci Science Center at PPL Pavilion! Learn More Support Us Your support will help us bring science to life and lives to science in so many ways — including our exhibit experiences, academic and visitor programs, professional development for educators, and our new facility. Become a Member Make a Donation Our Partners Visit Us Da Vinci Science Center at PPL Pavilion 815 W. Hamilton Street Allentown, PA 18101 Call Us: 484.664.1002 Email Us: ask@davincisciencecenter.org Operational funding has been provided by a grant from the Pennsylvania Historical and Museum Commission’s Cultural and Historical Support Program, a program funded by the Commonwealth of Pennsylvania. Helpful Links Exhibits Become a Member Contact Us Careers and Internships News & Press Releases Directions & Parking Volunteer Stay Up-to-Date Sign Up For Free Updates Connect With Us F T L Y I DSC Staff Portal Terms of Use and Privacy © 2025 Da Vinci Science Center Proud partner of"
    },
    {
      "url": "https://www.mydavinci.com/contactus.html",
      "text": "Contact Us | myDaVinci Hand Draw Your Memories Stroke by Stroke since 2000 100% Money Back Guarantee My Account (888) 716-4085 Special Requests 0 Photo to Art Gift Guide View Our Craft Inspiration & ideas Print on Canvas Traditional Modern Fun Art Traditional Hand Drawn/Painted Modern Digitally Hand Painted Fun Art Hand Painted Faces Pencil Sketch from $95 Watercolor from $149 DaVinci Sketch from $119 Ink Rendering from $66 Color Pencil from $139 Oil Painting from $199 Vintage Ink Art on Wood from $135 Color Pencil on Wood from $215 Pop Art 27 styles Oil Painting Giclee from $129 Caricatures 434 styles In Masterpieces 213 styles Art My Way Add your text on 500+ artworks Engraved Wood Art Engrave your thoughts Custom Paper Cut Hand-cut paper cut Celebrity Art Diverse-Unique-Exclusive Custom Metal Signs Authentic-Nostalgic-Retro Print on Canvas Photo Enhancements Photo Restoration Occasions Wedding Anniversary Father's Day Mother's Day Holiday Valentine's Day x House-Warming New Baby Graduation Retirement Memorial Portrait Galleries by Subject Family Pets, Dogs , Cats Couple Houses Y Woman Man Horses Group Children , Babies Gift Shops Gift Certificate Most Popular New &  Improved Contact Us myDaVinci wants to hear from you! myDaVinci looks forward to your comments and suggestions for ways to improve \r\n            our business. Let us know what you think about our site, our products or anything \r\n            else that comes to mind.  We are also available via phone M-F 9:00am-4:30pm \r\n            CST to help you with any questions or concerns you may have with the ordering \r\n            process or your existing order. Feel free to chat with us online for any inquiries on M-F 9:00am-4:30pm CST and Sun. -Thur.  8:00pm-4:30am CST. Customer Support and Order Information: Email: orders@mydavinci.com Toll-Free (North America) : 888-716-4085 General Questions and Comments: Email: info@mydavinci.com Partnership Opportunities: myDaVinci is growing fast and we plan to keep turning great ideas into beautiful works of art. If you are interested  \r\nin learning more about our partnership opportunities please contact us at partners@mydavinci.com. For more\r\ninformation about partnering with myDaVinci, please visit our Partnership Program page. About Us About Us Customer Reviews Privacy Affiliates Partners Customer Service Contact Us My Account Upload Photos Guarantee FAQs Gift Certificate Tips, Site News, Discounts & Promotions Mailing List Subcribe Stay Connected © 2000-2025 mydavinci.com Inc. All Rights Reserved. myDaVinci.com, Art for Memories are the registered trademarks\r\n            of myDaVinci.com Inc."
    },
    {
      "url": "https://www.davinciworkshopcafe.com/",
      "text": "Da Vinci Workshop and Cafe | STEM camps | 2311 Bethel Church Road, Bethel Park, PA, USA top of page Home Plans & Pricing Book Online Shop Online Shopping Loyalty Blog Members Shared Gallery Gift Card More Use tab to navigate through the menu items. Log In DaVinci Workshop and Cafe Welcome! 🎉 Welcome to Da Vinci Workshop & Café – Where Creativity Meets Community! ☕🛠️ We’re more than just a café—we’re a hands-on, family-friendly makerspace designed to inspire curiosity, creativity, and connection for all ages. Whether you're dropping in for a fresh cup of locally roasted coffee and a pastry, or diving into a day of building, crafting, and exploring in our makerspace—walk-ins are always welcome! 🧩 Grab a Day Pass to enjoy our interactive Workshop areas, or 💫 Become a Family Member and unlock exclusive perks—saving your family hundreds of dollars a year on access, camps, classes, and events! 🌟 Here’s what you’ll find at Da Vinci: Kids Section (Ages 3–14): STEAM-based fun, discovery, and hands-on learning Family Makerspace: A collaborative zone where all ages can create together Cozy Café & Boutique: Enjoy locally baked pastries, snacks, and artisan coffee—open to everyone, no pass required! 🎨 Looking for a unique venue? Our versatile space is also available to book for private events, workshops, or art shows. Whether you're hosting a birthday, teaching a class, or showcasing your work, Da Vinci offers a welcoming and creative environment to bring your vision to life. So come in, get inspired, and make something amazing. Your next great idea starts here—at Da Vinci Workshop & Café! ​ Learn More Submit Thanks for submitting! Upcoming Events An Italian Day with Da Vinci Sat, Sep 13 2311 Bethel Church Rd More info Buy Tickets Italian Dance Workshop with Allegro Dance Company Sat, Sep 13 2311 Bethel Church Rd More info Buy Tickets For little ones -Storytelling and Learn Italian  - Meet & Greet the author Sat, Sep 13 2311 Bethel Church Rd More info Buy Tickets Paint & Sip Party Fri, Sep 26 Bethel Park More info Buy Tickets Motion-Sensing Spider Workshop 5-10 yrs old (includes kiwico package and snack) Sat, Sep 27 2311 Bethel Church Rd More info Buy Tickets Don’t Tell Comedy Pittsburgh Sat, Nov 08 2311 Bethel Church Rd More info RSVP Don’t Tell Comedy Pittsburgh  Dec Sat, Dec 06 2311 Bethel Church Rd More info RSVP Opening  Hours: St Monday – Friday: 9:00am- 8:00pm​​ Saturdays: 12:00pm – 8:00pm Sundays only for Events and Birthday Parties ​ ​ Close on: Memorial day July 4th Weekend Labor Day ThanksGiving Christmas Day New Year Eve ​ Davinci Family Summer Break. - Closed : July 27th -August  3rd ​ ​ ​ Come Visit us at : 2311 Old Bethel Church Rd, Bethel Park, PA 15102 (2nd Floor) info@davinciworkshopcafe.com 412-979-3181 * If you required assistance with stairs or wheelchair accessibility, kindly contact us in advance vis email. ​ ​ ​ Contact ©2023 by Da Vinchi Workshop and Cafe. Proudly created with Wix.com bottom of page"
    },
    {
      "url": "https://davincitrading.com/about-us/",
      "text": "About us - Da Vinci Trading Skip to content About us Events Connect FAQ About us Events Connect FAQ About us Events Connect Careers About us Events Connect Careers Careers A trading house for game-changers Da Vinci is a proprietary trading house made up of some of the sharpest minds and most passionate players in the industry. We’re motivated by the common goal to create the best trading house in the world. Discover Careers Our Story Da Vinci, founded in 2015 by a team of entrepreneurial trading experts, is a leading proprietary trading firm. We keep our work smart by making the most of our team’s strategic minds. Our unique approach to trading combined with our focus on creating a motivating work environment has been key to establishing ourselves in the markets. We are headquartered in the home of the world’s first stock market, Amsterdam, and we have offices in Mumbai, Hong Kong and Miami. Using our own capital, we trade various financial instruments on some of the most prominent exchanges worldwide with short to medium-term strategies. How we contribute It is our responsibility to contribute to the trading industry and society by creating a more transparent and sustainable investment environment. We actively and continuously participate in industry fora and stimulate valuable discussions. Connect Explore Core Roles Explore what it means to work on our trading floor. Working as a Software Engineer Working at Da Vinci Working as a Trader Working as a Quantitative Researcher Working at Da Vinci Be good, work hard, and great things will happen Every member of our team stands out for their sharp mind and strong drive, but we do our best work together. We are non-hierarchical and support employees in exploring their interests and strengths, placing no limit on personal growth. We encourage our people to speak up, providing everyone with an opportunity to shape the firm’s future. Discover Careers Let’s change the game together About us Events Careers Connect About us Events Careers Connect Instagram LinkedIn YouTube X Instagram LinkedIn YouTube X Address Hildegard von Bingenstraat 12, 1081 LH, Amsterdam Phone +31 20 294 7010 Email recruitment@davincitrading.com Copyright: 2025 Da Vinci FAQ Privacy Policy FAQ Privacy Policy"
    },
    {
      "url": "https://raphaeldelio.medium.com/whats-the-connection-between-leonardo-da-vinci-a-cup-of-coffee-in-lisbon-and-the-nature-of-9098205f6a8f",
      "text": "What’s the Connection Between Leonardo Da Vinci, a Cup of Coffee in Lisbon, and the Nature of Software Development? | by Raphael De Lio | Medium Sitemap Open in app Sign up Sign in Medium Logo Write Sign up Sign in What’s the Connection Between Leonardo Da Vinci, a Cup of Coffee in Lisbon, and the Nature of Software Development? Raphael De Lio 3 min read · Dec 21, 2023 -- 1 Listen Share In Walter Isaacson’s biography of Leonardo Da Vinci, he writes about an incident that occurred while Leonardo was painting one of his most famous works, “The Last Supper.” Press enter or click to view image in full size The Last Supper (Leonardo) Isaacson describes how the Prior of the church that had commissioned the work became irritated with Leonardo’s procrastination and complained to Ludovico Sforza, the then Duke of Milan. He wanted Leonardo never to put down the brush, as if he were an employee working in his garden. When the artist was summoned by the Duke, the two ended up discussing how creativity manifests. Leonardo explained that sometimes you need to go slow, take breaks, and even procrastinate. This allows ideas to mature and intuition to be stimulated. Men of high intellect, he said to the duke, sometimes make their greatest advances when they work less, as their minds are occupied with their ideas and the refinement of concepts that will later take shape. Press enter or click to view image in full size This passage reminded me of a moment I experienced in a café in Lisbon in 2022. In one of our conversations, my colleague Marcelo Maluf Teixeira , holding a cup in his hand, compared it to the ever-evolving nature of software. \"A coffee cup is a finished product; once it is molded, baked, and painted, it is complete. There are no updates or revisions needed. In contrast, software is a dynamic entity, constantly in a state of development and improvement.\" As programmers, we often encounter the “Prior of the Church” mentality in our workplaces, represented by managers or executives who expect us to always be on standby, tirelessly typing to deliver software. They often see programming as a continuous production line, where the work is simply completing tasks one after the other. However, the reality of programming is that it is a creative and iterative process, where ‘active procrastination’ plays a crucial role. Procrastination, when understood as a period of reflection and incubation of ideas, is essential in the world of programming. It’s not about avoiding work, but recognizing that conscious breaks and periods of reflection are vital for innovation and creative problem-solving. In these moments, instead of incessantly writing code, we allow ourselves to absorb and contemplate the problem as a whole, often finding more effective and innovative solutions. Leonardo often took years to finish a painting, and in some cases, like the famous “Mona Lisa,” he continued to work and make changes until the end of his life. He was always experimenting with new techniques, like sfumato, a shading technique that creates a smooth transition between colors, giving an almost ethereal quality to his paintings. Leonardo also left us a tip on how to deal with that stubborn manager. He told the Prior that he still had two heads to paint, Christ’s and Judas’, and claimed he was having trouble finding a model for Judas and would use the Prior’s image if he continued to pester him. The Duke burst out laughing, saying Leonardo had thousands of reasons to do so. And the poor Prior was embarrassed and went back to taking care of his garden, leaving Leonardo in peace. Stay curious! Software Development Leonardo Da Vinci Art Lisbon Coffee -- -- 1 Written by Raphael De Lio 1K followers · 55 following Software Engineer | Developer Advocate | International Conference Speaker | Tech Content Creator | Working @ Redis | https://linktr.ee/raphaeldelio Responses ( 1 ) See all responses Help Status About Careers Press Blog Privacy Rules Terms Text to speech"
    },
    {
      "url": "https://caffevinci.co.uk/",
      "text": "Caffe Vinci Coffee Coffee Beans Coffee Pods Filter Coffee Cafetiere Coffee Decaffeinated Coffee Fairtrade Coffee Instant Coffee Coffee Machines Coffee Machines Machine Packages Bean 2 Cup Grinders Hot Water Boilers Barista Equipment Knockout Drawers Tampers Jugs Temp-Pal Crockery Cleaning Products Ingredients Hot Chocolate Birchall Teas Monin Syrups Sugars Milk Biscuits Toppings Frappe Powder Barista Training Installation & Servicing Facebook Instagram Contact us at +44 1642 455145 or info@caffevinci.com. Menu Cart Coffee Coffee Beans Coffee Pods Filter Coffee Cafetiere Coffee Decaffeinated Coffee Fairtrade Coffee Instant Coffee Coffee Machines Coffee Machines Machine Packages Bean 2 Cup Grinders Hot Water Boilers Barista Equipment Knockout Drawers Tampers Jugs Temp-Pal Crockery Cleaning Products Ingredients Hot Chocolate Birchall Teas Monin Syrups Sugars Milk Biscuits Toppings Frappe Powder Barista Training Installation & Servicing Cart ( 0 ) CAFFE VINCI COFFEE THE COFFEE LOVER'S COFFEE. PURCHASE BEANS WHO IS CAFFE VINCI? We are a family owned Coffee and Equipment specialist with over 30 years Coffee and Hospitality sector experience. Our formula for great coffee is the finest coffee beans, quality and reliable equipment, knowledge, training and complete service. This is what we deliver to our customers. Caffe Vinci is the UK Importer and distributor of Fiorenzato Traditional Espresso Machines and Grinders available for purchase, rent or lease . We supply all Barista essentials, sundries and Free on Loan branded crockery and point of sale to our trade customers. MORE ABOUT US COFFEE We are constantly seeking to improve and evolve to bring the perfect cup of coffee. COFFEE EQUIPMENT We are the largest importer for Fiorenzato Espresso Machine. Click here for more information. INSTALLATION & SERVICING Caffe Vinci has its own in house machine servicing department. BARISTA TRAINING Tailor your training to your specific business so that we can succeed together. Add to Cart Fresco Blend £20.18 Add to Cart Exclusive Blend £18.08 Add to Cart Organic Fairtrade Blend £22.30 Add to Cart 100% Arabica Blend £22.82 View all beans QUALITY PRODUCT Our blends are produced with the finest washed green beans using Sweet Arabicas from the plateaus of Brazil which impart chocolate and nutty flavours whilst high quality robustas from Africa and India add body and bring together the aromas, textures, and tastes resulting in a coffee with a pleasing complexity and creates a unique product, a smooth blend with a depth of flavour. OUR BEANS Testimonials The machine internals are extremely well laid out which made a pleasant change from the machines they replaced. Coffee quality is excellent- big improvement in taste, pour consistency and crema with both machines but especially with the Piazza San Marco, as I had expected, being an avid fan of lever machines. O'Conaills Chocolate Shop Caffe Vinci is the only company we would go to for espresso machines. We have just purchased our fourth Fiorenzato Piazza San Marco, the machine is stunning and our customers love the coffee it produces! VALENTINA'S FINE FOODS We were looking for an espresso machine and coffee specialist in the UK and were surprised to be recommended a company sitting right on our door-step. The machines really were something to behold. If the look of the machines wasn't enough to make the decision for us then the taste of the coffee they produced certainly was! ROCKLIFFE HALL HOTEL, SPA & GOLF CLUB We thought we were selling a great tasting coffee until Jim from Caffe Vinci persuaded us to try their range of espresso beans and we were extremely impressed. We were pleased with the positive feedback we got from our customers. Our sales have increased and there has been no looking back! DEAN & DANIELLAS JESMOND Caffe Vinci came highly recommended to us and they delivered with some first class equipment and great tasting coffee. Their service is second to none and their contribution to the success of Beaches and Cream is really appreciated. Thanks Caffe Vinci ! BEACHES AND CREAM CULLERCOATES Newsletter Get up to date coffee news and offers from Caffe Vinci. Sign up for our Exclusive Newsletter! Email Subscribe Menu About Us Contact Us Return Policy Terms & Conditions Delivery & Returns Contact Us info@caffevinci.com +44 1642 455145 13 Newcomen Road Middlesbrough England TS6 6PS United Kingdom Social Facebook Instagram © 2025, Caffe Vinci Powered by Shopify Close (esc) Popup Use this popup to embed a mailing list sign up form. Alternatively use it as a simple call to action with a link to a product or a page. Subscribe Age verification By clicking enter you are verifying that you are old enough to consume alcohol. Enter Basket Your basket is currently empty. Shop now"
    },
    {
      "url": "https://www.skoladavinci.cz/o-nas/about-da-vinci-school",
      "text": "About us | Da Vinci School Ãvod MateÅskÃ¡ Å kola ZÃ¡kladnÃ­ Å¡kola StÅednÃ­ Å¡kola Poradna O nÃ¡s Menu Ãvod O nÃ¡s About da vinci school Å kola da Vinci Learn about Å kola da Vinci and our philosophy. Contact us. About Our School Da Vinci School is a private innovative school based on democratic principles. Our school was opened in 2010 and is located in the village of DolnÃ­ BÅeÅ¾any on the outskirts of Prague. The campus houses a kindergarten, primary and secondary school, and a school counselling centre. Our students and teachers can make use of a gym, swimming pool, as well as specialised classrooms for teaching arts and ceramics, music, and science. The school also has its own cafÃ© called Caffinci and a school cafeteria. The forest kindergarten is located about 2 km away from the campus. In our school, a lot of attention is paid to student autonomy and independence in learning; internal motivation - of both students and teachers - is of greatest priority. In our understanding, school is a place where both students and teachers learn constantly - it is a place for lifelong learning, but also a place where we experience the âNowâ. Both students and teachers take part in the decision-making processes of the school. Teachers work around subjects and subject areas aiming for interdisciplinarity. The older the students are, the more opportunities they have to influence their educational path, taking over responsibility for their own learning. Project work is an integral part of the school curriculum at all stages of schooling. Through project work, we encourage the formation of mixed-age and mixed-ability groups, supporting peer learning and the development of soft skills, teamwork and leadership, as well as discussion skills, presentation skills, and research skills. Currently, 262 children and teenagers attend our school, accompanied by 50 teachers and 11 members of non-teaching staff. Our Values We help everyone to be themselves and to express themselves freely. We support the development of internal motivation. We create a safe environment based on mutual trust. We create our school together and participate in the decision-making. We support the understanding of one's self-awareness, self-worth, values and attitudes. We act freely and accept responsibility for our actions. We live a full life in the here and now. We support the maximum use of one's potential. We respect everyone's right to unconditional acceptance and love. We perceive learning as a life journey to the fundamental questions. International cooperation We are keen on international cooperation and have many partner schools in a number of countries, both across Europe and worldwide. We have participated in a number of class exchanges as well as Erasmus+ projects. Currently, we are conducting two Erasmus+ KA1 projects thanks to which our teachers attend courses and visit schools abroad. We also host incoming teachers and teaching assistants from abroad.Â Our Erasmus Plus Courses Thanks to our experience with all kinds of projects as well as with various innovative methods, we have decided to create our own Erasmus Plus courses - one about Reflection and one about Non-Traditional sports. Â Reflection that is conducted properly can be a great source of inspiration. It can make teaching more effective and develop the relationship not only between you and your students, but also the relationships the students have among themselves. This course can become the starting point for your further (self)development and your work with the class. Reflection as a part of the educational process, schoolactivities, and a source of inspiration Reflection that is conducted properly can be a great source of inspiration. It can make teaching more effective and develop the relationship not only between you and your students, but also the relationships the students have among themselves. This course can become the starting point for your further (self)development and your work with the class. Sounds interesting?Â Learn more about the courses here . Come and learn with us! Play and get inspired! Contact information School Office: MarkÃ©ta KoÅÃ­nkovÃ¡ at marketa.korinkova@skoladavinci.cz Deputy Head for International Cooperation: Jana NÄmeÄkovÃ¡ at jana.nemeckova@skoladavinci.cz Da Vinci School Na DrahÃ¡ch 20 Â 252 41 DolnÃ­ BÅeÅ¾anyÂ Czech Republic VAT: CZ71341137 OID: E10093020 (Erasmus+ Organisation ID) International projects Read about the various projects (including Erasmus+) - in Czech. Erasmus Plus Course Do you want to learn with us? Check this out! Na webu pouÅ¾Ã­vÃ¡me analytickÃ© a marketingovÃ© cookies. AnalytickÃ© nÃ¡m pomÃ¡hajÃ­ zlepÅ¡ovat web. MarketingovÃ© zase umoÅ¾ÅujÃ­, aby se o naÅ¡Ã­ Å¡kole dozvÄdÄly i dalÅ¡Ã­ rodiny. MÅ¯Å¾eme sbÃ­rat ty vaÅ¡e? Ano Ne Adresa StÅednÃ­ Å¡kola, zÃ¡kladnÃ­ Å¡kola a mateÅskÃ¡ Å¡kola da Vinci Na DrahÃ¡ch 20 252 41 DolnÃ­ BÅeÅ¾any Kontakty +420 608 333 567 info@skoladavinci.cz uk2msr8 (datovÃ¡ schrÃ¡nka) jmeno.prijmeni@skoladavinci.cz Odkazy Edookit JÃ­delnÃ­Äek English - about us Erasmus+ courses Â© 2010â2023 StÅednÃ­ Å¡kola, zÃ¡kladnÃ­ Å¡kola a mateÅskÃ¡ Å¡kola da Vinci"
    },
    {
      "url": "https://allmusicmagazine.com/venues/cafe-da-vinci/",
      "text": "Cafe Da Vinci - All Music Magazine Logout Search Search News Reviews Album Reviews Concert Reviews Interviews Galleries Podcasts Editorials Videos Contact News Reviews Album Reviews Concert Reviews Interviews Galleries Podcasts Editorials Videos Contact Festivals Contributors Advertising Festivals Contributors Advertising Venues Edit Venue Details Add Upcoming Show Reset Password Cafe Da Vinci Deland Rock (386) 736-0008 info@cafedavincideland.com View Website 112 W. Georgia Avenue Deland Florida 32720 Smoking About The Venue Cafe DaVinci was founded in 1993 primarily as a jazz club where artists, musicians and friends could come together. While the music may have expanded well beyond jazz, the vibe remains the same 20 years later. This little hidden gem in small-town Deland has featured acts well beyond its stature including JJ Grey of Mofro, The Wailers and The Avett Brothers to name a few. Our inside bar is pretty cool, but where people truly fall in love is once they step into the 5,000 square foot outdoor courtyard. Many people say it feels like New Orleans dropped down into Deland. Our favorite, most universal descriptor we use is ‘AMAZEBALLS’ and the fact that we have a great selection of liquor, beer & wine makes it even more ‘AMAZEBALLS’! Upcoming Events: No events yet, check back later! Contact Us © 2025 All Music Magazine. All rights reserved. Privacy Policy"
    },
    {
      "url": "https://www.compasspoint.org/board-caf%C3%A9-archives",
      "text": "Board Café Archives Jump to navigation About Us Our Story Rooted in liberation, growing through community Vision and Values A liberated future within reach Meet the Team The people behind the work Contact Let's connect Our Programs Workshops Spaces to grow, learn, and lead Capacity Building & Consulting Building organizational power for collective liberation Peer Networks Connection that strengthens movements Learning Communities Awakening possibility through collective learning Resource Hub Blog Reflections from the field Announcements Keep up with CompassPoint Tools and Resources Helpful Downloads Cart Login search Donate Board Café Archives Board Café Archives Board Café is a column for and about nonprofit boards. Short enough to read over a cup of coffee, the column appears regularly in Blue Avocado , the online magazine for people who work and volunteer in the nonprofit sector. New Board Café articles can be read on the Blue Avocado website or you can have the magazine delivered to you via email sign up for a free subscription at blueavocado.org. From 1997 to mid-2008, Board Café was a standalone publication of CompassPoint's. You can access past issues from this period in the Board Café Archives below. Big Decisions: Mergers, Closing Down Mergers: What Does a Typical Process Look Like? (06-28-2004) The Right Way to Go Out of Business (07-17-2000) Thinking About Going Out of Business (06-08-2000) Should Your Nonprofit Be Considering a Merger? (08-09-1998) Board Committees and Officers Governance Committees: Positive Trend on Nonprofit Boards (03-14-2003) Board Committee Job Descriptions (02-08-1999) Should Boards Have Committees, and if so, Which Ones? (01-24-1999) Sample Job Descriptions for Board Officers (11-09-1998) Board Direction and Role The Board's Role in Raising Money (03-24-2008) Working Board vs. Governing Board (01-17-2008) The Right Way to Resign from the Board (10-15-2007) Critical Path for the Board (03-21-2006) Why Boards Don't Govern Part 2 (11-19-2004) Why Boards Don't Govern Part 1 (10-28-2004) Ten Quick Ways to Improve Board Meetings (08-30-2004) The CompassPoint Board Model for Governance and Support: Part 2 (08-13-2003) The CompassPoint Board Model for Governance and Support (07-23-2003) The Strategic Board Agenda (12-23-2002) The Board's Role in Personnel (06-27-2001) Board Responsibilities for Volunteers (06-07-1999) Board Meetings, Board Packets, Tools What Information Should Board Members Have? (02-14-2006) Self Assessment for the Board (02-01-2005) What To Do With Board Members Who Don't Do Anything (09-14-2004) Five Ways to Get in Trouble (01-23-2004) What to Do When You Really, Really Disagree with a Board Decision (02-14-2003) By-Laws in Brief (11-25-2002) Dominating Personalities on the Board (05-20-2002) Board Meeting Packets (01-26-2001) Are We Doing a Good Job? (05-18-2000) Removing a Difficult Board Member (10-12-1999) Where to Have a Board Retreat (08-01-1999) A \"360 Degree Evaluation\" of the Agency (04-13-1999) Should the Board Hold Executive Sessions? (10-12-1998) Making the Most of Time Together (05-11-1998) Board Members: Recruiting, Diversity What is the Role of an Attorney on the Board (02-28-2008) Five Fast Ways to Recruit New Board Members (10-31-2006) Proposed Diversity Principles (04-15-2002) Young Voices in the Boardroom (10-19-2000) Sample Conflict of Interest Policy (01-14-2000) The Right Way to Do the Right Thing: Thinking About Ethics (12-14-1999) Questions to Ask Yourself Before Joining Your Next Board (07-13-1999) Diversity for Organizations Based in Minority Communities (03-10-1999) Removing a Board Member (12-07-1998) The Diversity Issue: Part 2 (01-12-1998) The Diversity Issue (12-09-1997) Especially for Board Chairs Board Chair: Making Your Mark (10-01-2005) Checklist for Success as a Board Chair (07-30-2001) Governance Committees: New Trend on Nonprofit Boards (08-15-2000) Executive Directors Getting a New Executive Director Off to the Right Start (03-29-2007) Firing the Executive Director (03-06-2007) Accepting Responsibility for the Board (05-06-2006) Succession Planning for Nonprofits of All Sizes (08-01-2005) How Much to Pay the Executive Director? (06-01-2005) What is Micromanagement and What Isn't? (02-25-2004) Support Your Local Executive Director (06-26-2002) Job Description for Executive Director (09-21-2000) Should the CEO Have a Vote on the Board? (04-13-2000) Hiring a New Executive Director? (03-20-2000) Annual Evaluation of the Executive Director (09-14-1999) When the Executive Director Leaves: The Job of the Board's Executive Transition Committee (09-08-1998) Finance and Budget Organizing the Board to Support the Revenue Strategy (08-13-2007) Budget Crunch (04-15-2003) Loans From Board Members (01-23-2003) The Board and the Budget: Beauty and the Beast? (09-27-2002) What You Need to do About Insurance (11-01-2001) Readiness for Earned-Income Ventures (05-30-2001) A Board-Staff \"Contract\" for Financial Accountability (11-21-2000) Six Things the Board President Should Check Before the 990 is Filed (04-13-1998) Fundraising Raising Money in 30 Days (06-19-2003) The Board Should Raise Money: True or False? (03-18-2002) What is a Fundraising Feasibility Study and Is It Worth It? (08-30-2001) New Findings on Nonprofit CEO Pay and Board Member Giving (02-22-2001) Five Things One Board Member Can Do to Raise $100 to $5,000 (05-10-1999) Two Simple Ways to Communicate Expectations About Money (02-09-1998) Miscellaneous The Twelve Board Cafe Days of Christmas (12-15-2007) Nonprofit Copyrights (11-27-2007) What 5,000 Board Café Readers Think About Boards (01-19-2007) List of the Best: Books, Websites and More (09-01-2005) Alligators in the Sewer: Myths and Urban Legends About Nonprofits (07-01-2005) A Board Leads an Organization Out of the Ashes (01-24-2005) Spotlight on Corporate Boards (08-22-2002) What Now? (10-01-2001) Nonprofit and Corporate Boards: Same or Different? (12-21-2000) Public Policy Sarbanes Oxley and Nonprofits (04-30-2004) Yes or No: Lobbying by Nonprofits (09-15-2003) Templates and Samples Dashboard for Nonprofits (05-01-2005) Policy Adoption Process (04-01-2005) Sample Conflict of Interest Policy (05-27-2004) A Board Member Contract (10-30-2003) What is an Advisory Board and Should We Have One? (10-24-2002) An Annual Board Committee Report (11-10-1997) Have questions? Let's talk! info@compasspoint.org Privacy Statement Donate now Stay connected Sign Up for Our Newsletter © 2025 CompassPoint Nonprofit Services"
    }
  ]
}