{
  "fuentes": [
    {
      "url": "https://www.calaveras-ideas.com/who-we-are",
      "email": "letsgo@calaverasideas.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "anirudh.shetye@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "beatrice.malle@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "info.nairobi@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "jane@skanem.ke"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "njogu@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "olive.kunihira@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "sachen.gudka@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "sameer.gaikwad@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "shamila.mirza@skanem.com"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "email": "info@scibpaints.com"
    },
    {
      "url": "https://lazonamuerta.net/contact/",
      "email": "dj_convoy@lazonamuerta.blog"
    },
    {
      "url": "https://calaverascantina.com/contact-calaveras-cantina/",
      "email": "bocaevents@calaverascantina.com"
    },
    {
      "url": "https://calaverascantina.com/contact-calaveras-cantina/",
      "email": "jupiterevents@calaverascantina.com"
    }
  ],
  "mails": [
    "anirudh.shetye@skanem.com",
    "beatrice.malle@skanem.com",
    "bocaevents@calaverascantina.com",
    "dj_convoy@lazonamuerta.blog",
    "info.nairobi@skanem.com",
    "info@scibpaints.com",
    "jane@skanem.ke",
    "jupiterevents@calaverascantina.com",
    "letsgo@calaverasideas.com",
    "njogu@skanem.com",
    "olive.kunihira@skanem.com",
    "sachen.gudka@skanem.com",
    "sameer.gaikwad@skanem.com",
    "shamila.mirza@skanem.com"
  ],
  "nombre_sitio": "calaverascantina.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.calaveras-ideas.com/who-we-are",
      "text": "who we are | Calaveras Ideas top of page our work who we are contact More Use tab to navigate through the menu items. Good news: It’s easier than ever to target your audience with a message. Bad news: It’s harder than ever to compel them to act. We rectify the latter. Simply put, Calaveras creates exceptionally motivating concepts that are the beating heart of all successful marketing eff orts, including: Branding / Strategy / Websites / Digital Display / Social Media / Video / Email / Traditional Media About our name. Calaveras are the symbolic skulls focal to the Mexican and Central American \"Day of the Dead\" tradition. These festivities are a celebration of individual life. We believe every brand has a life, too. And it's our job to make it worth celebrating. Yes, that’s what we believe. But we’re not alone. Because our clients believe it, too. Leadership Experienced, yet curious. Highly creative, yet strategic. Collaborative with you - yet demanding of ourselves. That describes the leadership at Calaveras. And why clients turn to us to help lead their efforts in new and better directions. Dave Kwasnick Partner / Creative Director There are two types of creatives: those who like to wear black and those who enjoy doing the work. Dave is the latter. He’s also a seeming contradiction, employing a rational, strategic approach to create singularly exceptional (and effective) work throughout his career. Dave started as a writer before rising to the ranks of associate creative director, strategist, creative director and executive creative director. Calaveras is his second experience owning an agency. Dave has had the privilege of working with many national brands at agencies in Minneapolis, Chicago and Pittsburgh. He’s the recipient of numerous national and local awards, as well as an inductee into the AAF Pittsburgh Advertising Hall of Achievement. An avid birder and lover of history, Dave enjoys annoying his wife and two children with facts about both. Matthew Axeman Partner / Creative Director Matt hungers to create visually stunning, supremely effective work. But don’t let his executions fool you. Matt’s truest talent comes into play long before images take shape on a page. That’s because he excels at divining human insights and developing them into the core concepts that galvanize consumers into action. Matt’s thirst for creative perfection has led him to master a wide array of skills, from 3-D animation to UX design. A lifelong auto enthusiast, you’ll find Matt pushing the limits behind the wheel or under the hood when he’s not working. Leadership client experience. We're in good company. Awards& Recognition Just a little bit of something shiny. featured work who we are contact Email: letsgo@calaverasideas.com Address: 1546 Fulton St Pittsburgh, PA 1 5233 Contact us Thanks! Submit © 2025 Calaveras. All rights reserved. bottom of page"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "text": "Contact Skanem | Reach Out to Our Labelling Experts Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message We proudly present Skanem Nairobi Skanem Nairobi Sachen Gudka Managing Director +254 733 410 309 Send email Skanem Nairobi Sachen Gudka Managing Director +254 733 410 309 Send email Skanem Nairobi Anirudh Shetye Head of Sales & Marketing +254 735 052 700 Send email Skanem Nairobi Anirudh Shetye Head of Sales & Marketing +254 735 052 700 Send email Skanem Nairobi Joyce Njogu Key Account Manager +254 722 804 269 Send email Skanem Nairobi Joyce Njogu Key Account Manager +254 722 804 269 Send email We proudly present Skanem Uganda Skanem Uganda Olive Kunihira Head of Sales +256 759 589 711 Send email Skanem Uganda Olive Kunihira Head of Sales +256 759 589 711 Send email We proudly present Skanem Tanzania Skanem Tanzania Sameer Gaikwad Site Manager +255 757 803 737 Send email Skanem Tanzania Sameer Gaikwad Site Manager +255 757 803 737 Send email Skanem Tanzania Beatrice Malle Key Account Manager +255 712 110 922 Send email Skanem Tanzania Beatrice Malle Key Account Manager +255 712 110 922 Send email Skanem Tanzania Shamila Mirza Key Account Manager +255 717 477 047 Send email Skanem Tanzania Shamila Mirza Key Account Manager +255 717 477 047 Send email Locations Locations Locations How to reach us How to reach us How to reach us How to reach us Skanem Interlabels Nairobi Limited East Africa Headquarters East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa +254 202 471001 info.nairobi@skanem.com Skanem Interlabels Uganda Limited Namanve Industrial Park Mukono Uganda Africa +256 759 589711 olive.kunihira@skanem.com Skanem Tanzania Limited Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa +255 757 803737 sameer.gaikwad@skanem.com Contact us Send us a message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Products Sustainability menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy Products menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "text": "Contact Us: Get In Touch With Asian Paints for your Painting Needs Contact Us: We’d Love To Hear From You 16815 Popular searches Interior Paints Exterior Paints Shade cards SEARCH RESULTS {{searchItem.map.shadeCode}} {{searchItem.map.shadeFamilyName}}: {{searchItem.map.shadeName}} {{searchItem.map.title}} RELATED SEARCH NO MATCHES FOUND! Did you mean? {{spellCheck}} Log-In Hello! Hello! Signout en ar {{minicart.cartcount > 0 ? minicart.cartcount : 0}} ↻ Processing... You have {{minicart.cartcount}} items {{item[\"product\"][\"name\"]}} - + ₹ {{item[\"totalPrice\"][\"value\"]}} Total ₹ {{minicart.totalprice}} Checkout ↻ Menu PAINTS & COLOUR PAINTS & COLOUR Services Services WATERPROOFING WATERPROOFING INSPIRATION INSPIRATION Login/Register PAINTS & COLOUR All PAINTS & COLOUR EXPLORE COLOURS Colour Catalogue Home Colour Guide PAINT PRODUCTS Interior Paints Exterior Paints Waterproofing Wood Paints Metal Paints Undercoats RESOURCES Paint Budget Calculator Ideas Gallery Colour visualizer SERVICES Paint Store Near Me Book Painting Services Services All Services Beautiful Homes Painting Service Scib Stars WATERPROOFING All WATERPROOFING Bathrooms Terrace and Tanks Roof & Basement Interiors Tiling All Products INSPIRATION All INSPIRATION Get Inspired Paint calculator Gallery Colour Next Guides DecorPro Resources Colour Visualizer Ideas Gallery Please enter your mobile number To receive the dealer details on SMS Mobile * SUBMIT Get in Touch We’d love to hear from you Head Office Scib Chemical S.A.E 6th of October Cirt, 4th Industrial (1/3/B)B Tel:            (+202)38281090-99 Fax: (+202)38331271 Scib Paints Helpline* For enquiries, feedback and complaints please call on 16815 or write to us at info@scibpaints.com Mobile number +91 00:59 ↻ ↻ Need help with your painting needs? Fill the form below to book a free site evaluation by a Scib Paints Beautiful Homes Painting Service expert. Name Mobile Number +20 Governorate * Email By proceeding, you are authorizing Scib Paints and its suggested contractors to get in touch with you through calls, sms, or e-mail. Book an appointment ↻ Thank you! We value your interest in Scib Paints Beautiful Homes Service. We will get in touch with you shortly to schedule a visit by an expert. Try again! Oops! Something went wrong. We couldn't process your request. Please try again? Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Our Divisions More about Asian Paints Congratulations You have subscribed. Contact Us 16815 EMAIL ABOUT Research & Technology Careers Contact Us Certificates RESOURCES FAQs POLICIES Quality Policy Customer Policy Cookie Policy Environment Policy EHS Policy TOOLS Colour Catalogue Color with AP APP/Website​ COUNTRY EGYPT Country EGYPT India GLOBAL BANGLADESH MIDDLE EAST FIJI NEPAL SRI LANKA ETHIOPIA CONNECT DOWNLOAD OUR PAINTING APP CONNECT WITH US ©Scib Paints - All rights reserved Congratulations You have subscribed. Welcome User Login OR Continue as guest You have been successfully logged out Login An OTP has been sent to your registered mobile number and email id. 00:00 Resend By clicking submit, I agree to terms and conditions SUBMIT Register Please enter the 5 digit OTP sent via SMS to verify your mobile number! 00:00 Resend I agree to terms and conditions SUBMIT Please enter your mobile number To receive the dealer details on SMS SUBMIT Provide a delivary address Fullname* Email* Mobile* +91 Flat/House No/Floor* Colony/Street/Locality* Landmark City* Pincode* SUBMIT User already exist redirecting you for the login page Paint Budget Calculator Get instant estimates Calculate now Waterproofing Calculator Get an instant estimate Calculate now"
    },
    {
      "url": "https://lazonamuerta.net/contact/",
      "text": "Contact – La Zona Muerta La Zona Muerta Blog About Contact Home Contact Don’t hesitate to reach out with the contact information below, or send a message using the form. Get in Touch dj_convoy@lazonamuerta.blog DeviantArt YouTube Send Us a Message Go back Your message has been sent Name (required) Warning Email (required) Warning Website Warning (required) Warning Warning. Submit Δ Like Loading… Designed with WordPress Subscribe Subscribed La Zona Muerta Sign me up Already have a WordPress.com account? Log in now. La Zona Muerta Subscribe Subscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar %d"
    },
    {
      "url": "https://calaverascantina.com/contact-calaveras-cantina/",
      "text": "Contact Calaveras Cantina | Mexican Cuisine Boca Raton (561) 576-2132 |  Jupiter (561) 320-9661 Menu Jupiter Menu Boca Raton Menu Locations Boca Raton Jupiter Banquet/Catering Holiday Banquet Promotion Event Booking Promotion Book Your Event Catering Events Boca Raton Events Jupiter Events Membership Program Gift Cards Purchase Gift Card Manage Card About Us Contact Careers Investment Opportunity Gallery Reviews Menu Jupiter Menu Boca Raton Menu Locations Boca Raton Jupiter Banquet/Catering Holiday Banquet Promotion Event Booking Promotion Book Your Event Catering Events Boca Raton Events Jupiter Events Membership Program Gift Cards Purchase Gift Card Manage Card About Us Contact Careers Investment Opportunity Gallery Reviews Home About Menus Gallery News Social Reviews Contact Contact Calaveras Cantina | Mexican Cuisine 16025 wp-singular,page-template,page-template-full_width,page-template-full_width-php,page,page-id-16025,wp-theme-bridge,ajax_fade,page_not_loaded,,qode-theme-ver-10.0,wpb-js-composer js-comp-ver-6.9.0,vc_responsive Contact Jupiter Located in Harbourside Place 125 Dockside Circle, Jupiter, FL 33477 Phone: (561) 320-9661 Hours Monday – Thursday 11:30AM to 11:00PM Friday 11:30AM to 1:00AM Saturday 11:00AM to 1:00AM Sunday 11:00AM to 10:00PM For large parties or events, please contact us at: jupiterevents@calaverascantina.com GET DIRECTIONS Boca Raton Located in Mizner Park 409 Plaza Real, Boca Raton, FL 33432 Phone: (561) 576-2132 Hours Monday – Thursday 11:30AM to 11:00PM Friday 11:30AM to 12:00AM Saturday 11:00AM to 12:00AM Sunday 11:00AM to 10:00PM For large parties or events, please contact us at: bocaevents@calaverascantina.com GET DIRECTIONS Get In Touch Name * Email * Phone Your Message (*) denotes required field Join Our Email List for Special Offers, Promotions, & Events! Join Now LOCATIONS LOCATIONS BOCA RATON MENU BOCA RATON MENU JUPITER MENU JUPITER MENU Contact Calaveras Cantina Jupiter : (561) 320-9661 Boca Raton : (561) 576-2132 Join Our Email List for Special Offers, Promotions, & Events! Join Our Email Club Review Jupiter on Yelp Review Boca Raton on Yelp OUR LOCATION Jupiter in Harbourside Place 125 Dockside Circle Jupiter, FL 33477 GET DIRECTIONS Boca Raton in Mizner Park 409 Plaza Real Boca Raton, FL 33432 GET DIRECTIONS Boca Raton BOCA RATON HOURS (561) 576-2132 Jupiter JUPITER HOURS (561) 320-9661 Navigation Home About Locations Boca Raton Menu Jupiter Menu Boca Raton Events Jupiter Events Book Your Event Catering Gallery Reviews Contact Privacy Policy Copyright (c) 2025- Created and Managed By Brian Marketing Group Copyright (c) 2025- Created and Managed By Brian Marketing Group Full Name Company or Business Name Phone Email Date Estimated Guest Attendance Event Location —Please choose an option— Jupiter Boca Raton Are you interested in Pickup or Delivery? —Please choose an option— Pickup Delivery Time of Event Occasion Special Request × Full Name Company or Business Name Phone Email Date Estimated Guest Attendance Event Location —Please choose an option— Jupiter Boca Raton Time of Event Occasion Special Request × X"
    }
  ]
}