{
  "fuentes": [
    {
      "url": "https://www.caledoniabrewing.com/",
      "email": "cb@caledoniabrewing.com"
    },
    {
      "url": "https://wineandcanvas.com/tampa/venue/caledonia-brewing-dunedin/",
      "email": "infofl@wineandcanvas.com"
    },
    {
      "url": "https://lazonamuerta.net/contact/",
      "email": "dj_convoy@lazonamuerta.blog"
    },
    {
      "url": "https://www.caledoniabrewing.com/current-menu/",
      "email": "cb@caledoniabrewing.com"
    },
    {
      "url": "https://www.caledoniabrewing.com/photos/",
      "email": "cb@caledoniabrewing.com"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "email": "info@scibpaints.com"
    },
    {
      "url": "https://www.caledoniabrewing.com/about/",
      "email": "cb@caledoniabrewing.com"
    },
    {
      "url": "https://www.caledoniabrewing.com/upcoming-events/",
      "email": "cb@caledoniabrewing.com"
    },
    {
      "url": "https://caledoniabrewing.smartonlineorder.com/",
      "email": "cb@caledoniabrewing.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "anirudh.shetye@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "beatrice.malle@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "info.nairobi@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "jane@skanem.ke"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "njogu@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "olive.kunihira@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "sachen.gudka@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "sameer.gaikwad@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "shamila.mirza@skanem.com"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "email": "accounts.payable@parkwaybrewing.com"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "email": "events@parkwaybrewing.com"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "email": "grant@parkwaybrewing.com"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "email": "kim@parkwaybrewing.com"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "email": "mic@parkwaybrewing.com"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "email": "mike@parkwaybrewing.com"
    },
    {
      "url": "https://thunderstruckbonsai.com/events/caledonia-brewing/",
      "email": "larry@thunderstruckbonsai.com"
    },
    {
      "url": "https://thunderstruckbonsai.com/events/caledonia-brewing/",
      "email": "larry@thunderstruckbonsai.com"
    },
    {
      "url": "https://thunderstruckbonsai.com/events/caledonia-brewing/",
      "email": "larry@thunderstruckbonsai.com"
    },
    {
      "url": "https://www.caledoniabrewing.com/tag/dunedin-times/",
      "email": "cb@caledoniabrewing.com"
    },
    {
      "url": "https://www.tampabay.com/things-to-do/food/spirits/we-tried-that-brewing-beer-at-caledonia-brewing-in-dunedin/2333639/",
      "email": "hfreund@tampabay.com"
    }
  ],
  "mails": [
    "accounts.payable@parkwaybrewing.com",
    "anirudh.shetye@skanem.com",
    "beatrice.malle@skanem.com",
    "cb@caledoniabrewing.com",
    "dj_convoy@lazonamuerta.blog",
    "events@parkwaybrewing.com",
    "grant@parkwaybrewing.com",
    "hfreund@tampabay.com",
    "info.nairobi@skanem.com",
    "info@scibpaints.com",
    "infofl@wineandcanvas.com",
    "jane@skanem.ke",
    "kim@parkwaybrewing.com",
    "larry@thunderstruckbonsai.com",
    "mic@parkwaybrewing.com",
    "mike@parkwaybrewing.com",
    "njogu@skanem.com",
    "olive.kunihira@skanem.com",
    "sachen.gudka@skanem.com",
    "sameer.gaikwad@skanem.com",
    "shamila.mirza@skanem.com"
  ],
  "nombre_sitio": "caledoniabrewing.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.caledoniabrewing.com/",
      "text": "Caledonia Brewing – Dunedin, FL Menu Skip to content Home Order Online Menu & Merch Events History & Hours Photos Caledonia Drinking Society Caledonia Brewing on Main ST in Downtown Dunedin, Fl Caledonia Art by Jay Titus Caledonia Brewing on Main Street in Dunedin, FL serving craft beer and wine T-Shirts are Available at the Brewery Get your Caledonia Brewing T-Shirts inside our Dunedin craft beer bar A Wide Angle Look Inside Inside our brewery in Dunedin, FL, proudly serving the surrounding areas; including Tampa, St. Pete and Clearwater A Closer Look at the Craft Beer Bar Come enjoy one of our small batch, hand crafted beers. Dunedin, Fl Our Beers Our Location Upcoming Events 587 Main St. Dunedin, FL 34698 -- (727) 351-5105 -- cb@caledoniabrewing.com Caledonia Brewing – Dunedin, FL | Powered by Mantra & WordPress."
    },
    {
      "url": "https://wineandcanvas.com/tampa/venue/caledonia-brewing-dunedin/",
      "text": "Caledonia Brewing (Dunedin) - Wine and Canvas - Tampa / St Pete/ Clearwater Find Another Location Paint and Sip – FAQ Shopping Cart Shopping Cart 0 Shopping Cart What We Do Canvas Paint and Sip Parties Cookies and Canvas Board Art Wine Glass Painting Paint Your Pet Private Parties Event Calendar Private Events Shop Mobile Painting Party Pack Gift Certificate “On-Demand” Paint and Sip Contact Us Blog Want to Teach? Menu Menu 1 event found. << ALL EVENTS Caledonia Brewing (Dunedin) Events Venues Caledonia Brewing (Dunedin) Caledonia Brewing (Dunedin) Started by friends and beer enthusiasts that were home brewers, we decided to take our passion and skills to the next level in our beer-centric home town of Dunedin, FL where we work, live, and play. Caledonia is a name given to Scotland by the Romans and is a nod to the local Scottish heritage here in Dunedin (Sterling Scotland is our sister city). Scotland’s National animal, the unicorn is featured in our logo and decor as well as the Scottish flag, The Saltire. We are known for our Rat Arsed Scotch Ale and its little brother Half Arsed Scottish Ale. We also host The Dunedin Chapter of the New World Celts monthly. Caledonia Brewing offers monthly paint and sip events in Dunedin with Wine & Canvas. See what’s on the calendar by visiting our EVENTS CALENDAR page. You can learn more about the brewery by checking out their WEBSITE LINK. Caledonia Brewing (Dunedin) 587 Main St. Dunedin , FL 34698 United States Get Directions (727) 351-5105 https://www.caledoniabrewing.com Events at this venue Today Upcoming Upcoming Select date. September 2025 Wed 24 Wed, Sep 24th, 2025 @ 6:00 pm - 9:00 pm Dunedin Paint and Pour – Pier into Paradise Caledonia Brewing (Dunedin) 587 Main St., Dunedin, FL, United States Join us for a colorful night of creativity at our Dunedin Paint & Pour, where we’ll be painting Pier Into Paradise! Get Tickets $39.00 16 tickets left Previous Events Today Next Events Subscribe to calendar Google Calendar iCalendar Outlook 365 Outlook Live Export .ics file Export Outlook .ics file We Put the ART in pARTy! Navigate Find Location Private Events Contact Us Blog Contact Info Phone: (866) 631-0226 Email: support@wineandcanvas.com Follow Us: Facebook Instagram Youtube © - Wine & Canvas, All Rights Reserved | Website Design Privacy Policy Terms & Conditions Account Access Accessibility Link to: Mastry’s Brewing (St. Pete Beach) Link to: Mastry’s Brewing (St. Pete Beach) Mastry’s Brewing (St. Pete Beach) Link to: Big Storm Brewing Clearwater – paint and sip location Link to: Big Storm Brewing Clearwater – paint and sip location Big Storm Brewing Clearwater – paint and sip location Scroll to top Scroll to top Scroll to top"
    },
    {
      "url": "https://lazonamuerta.net/contact/",
      "text": "Contact – La Zona Muerta La Zona Muerta Blog About Contact Home Contact Don’t hesitate to reach out with the contact information below, or send a message using the form. Get in Touch dj_convoy@lazonamuerta.blog DeviantArt YouTube Send Us a Message Go back Your message has been sent Name (required) Warning Email (required) Warning Website Warning (required) Warning Warning. Submit Δ Like Loading… Designed with WordPress Subscribe Subscribed La Zona Muerta Sign me up Already have a WordPress.com account? Log in now. La Zona Muerta Subscribe Subscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar %d"
    },
    {
      "url": "https://www.caledoniabrewing.com/current-menu/",
      "text": "Current Menu & Merch – Caledonia Brewing – Dunedin, FL Menu Skip to content Home Order Online Menu & Merch Events History & Hours Photos Caledonia Drinking Society Current Menu & Merch Comments are closed. Contact Us: Address 587 Main St. Dunedin, FL 34698 Phone (727) 351-5105 Email CB@CaledoniaBrewing.com Facebook @CaledoniaBrewing Instagram @CaledoniaBrewing Twitter @CaledoniaBrews Categories Categories Select Category Uncategorized Calendar September 2025 M T W T F S S « Feb 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 Caledonia Brewing – Dunedin, FL | Powered by Mantra & WordPress."
    },
    {
      "url": "https://www.caledoniabrewing.com/photos/",
      "text": "Caledonia Photos – Caledonia Brewing – Dunedin, FL Menu Skip to content Home Order Online Menu & Merch Events History & Hours Photos Caledonia Drinking Society Caledonia Photos New World Celts Game Show Night at Caledonia Brewing Brew Day at Caledonia Brewing Caledonia Drinking Society Boar’s Head Snacks Available at Caledonia Brewing Dunedin Santa Con 2018 Weekly Music Trivia Winners Orange Peel Pub Crawl Local Artist Jay Titus Dunedin Car Show Dunedin Rotary Beer Olympics at Caledonia Brewing Music Trivia at Caledonia Retrograde Music Video Night every Sunday at Caledonia Brewing Oktoberfest at Caledonia Brewing Thrift Store Prom at Caledonia Brewing Game Show Night at Caledonia Brewing Tacky Tourist Pub Crawl Grand Opening Comments are closed. Contact Us: Address 587 Main St. Dunedin, FL 34698 Phone (727) 351-5105 Email CB@CaledoniaBrewing.com Facebook @CaledoniaBrewing Instagram @CaledoniaBrewing Twitter @CaledoniaBrews Categories Categories Select Category Uncategorized Calendar September 2025 M T W T F S S « Feb 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 Caledonia Brewing – Dunedin, FL | Powered by Mantra & WordPress."
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "text": "Contact Us: Get In Touch With Asian Paints for your Painting Needs Contact Us: We’d Love To Hear From You 16815 Popular searches Interior Paints Exterior Paints Shade cards SEARCH RESULTS {{searchItem.map.shadeCode}} {{searchItem.map.shadeFamilyName}}: {{searchItem.map.shadeName}} {{searchItem.map.title}} RELATED SEARCH NO MATCHES FOUND! Did you mean? {{spellCheck}} Log-In Hello! Hello! Signout en ar {{minicart.cartcount > 0 ? minicart.cartcount : 0}} ↻ Processing... You have {{minicart.cartcount}} items {{item[\"product\"][\"name\"]}} - + ₹ {{item[\"totalPrice\"][\"value\"]}} Total ₹ {{minicart.totalprice}} Checkout ↻ Menu PAINTS & COLOUR PAINTS & COLOUR Services Services WATERPROOFING WATERPROOFING INSPIRATION INSPIRATION Login/Register PAINTS & COLOUR All PAINTS & COLOUR EXPLORE COLOURS Colour Catalogue Home Colour Guide PAINT PRODUCTS Interior Paints Exterior Paints Waterproofing Wood Paints Metal Paints Undercoats RESOURCES Paint Budget Calculator Ideas Gallery Colour visualizer SERVICES Paint Store Near Me Book Painting Services Services All Services Beautiful Homes Painting Service Scib Stars WATERPROOFING All WATERPROOFING Bathrooms Terrace and Tanks Roof & Basement Interiors Tiling All Products INSPIRATION All INSPIRATION Get Inspired Paint calculator Gallery Colour Next Guides DecorPro Resources Colour Visualizer Ideas Gallery Please enter your mobile number To receive the dealer details on SMS Mobile * SUBMIT Get in Touch We’d love to hear from you Head Office Scib Chemical S.A.E 6th of October Cirt, 4th Industrial (1/3/B)B Tel:            (+202)38281090-99 Fax: (+202)38331271 Scib Paints Helpline* For enquiries, feedback and complaints please call on 16815 or write to us at info@scibpaints.com Mobile number +91 00:59 ↻ ↻ Need help with your painting needs? Fill the form below to book a free site evaluation by a Scib Paints Beautiful Homes Painting Service expert. Name Mobile Number +20 Governorate * Email By proceeding, you are authorizing Scib Paints and its suggested contractors to get in touch with you through calls, sms, or e-mail. Book an appointment ↻ Thank you! We value your interest in Scib Paints Beautiful Homes Service. We will get in touch with you shortly to schedule a visit by an expert. Try again! Oops! Something went wrong. We couldn't process your request. Please try again? Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Our Divisions More about Asian Paints Congratulations You have subscribed. Contact Us 16815 EMAIL ABOUT Research & Technology Careers Contact Us Certificates RESOURCES FAQs POLICIES Quality Policy Customer Policy Cookie Policy Environment Policy EHS Policy TOOLS Colour Catalogue Color with AP APP/Website​ COUNTRY EGYPT Country EGYPT India GLOBAL BANGLADESH MIDDLE EAST FIJI NEPAL SRI LANKA ETHIOPIA CONNECT DOWNLOAD OUR PAINTING APP CONNECT WITH US ©Scib Paints - All rights reserved Congratulations You have subscribed. Welcome User Login OR Continue as guest You have been successfully logged out Login An OTP has been sent to your registered mobile number and email id. 00:00 Resend By clicking submit, I agree to terms and conditions SUBMIT Register Please enter the 5 digit OTP sent via SMS to verify your mobile number! 00:00 Resend I agree to terms and conditions SUBMIT Please enter your mobile number To receive the dealer details on SMS SUBMIT Provide a delivary address Fullname* Email* Mobile* +91 Flat/House No/Floor* Colony/Street/Locality* Landmark City* Pincode* SUBMIT User already exist redirecting you for the login page Paint Budget Calculator Get instant estimates Calculate now Waterproofing Calculator Get an instant estimate Calculate now"
    },
    {
      "url": "https://www.caledoniabrewing.com/about/",
      "text": "History and Hours – Caledonia Brewing – Dunedin, FL Menu Skip to content Home Order Online Menu & Merch Events History & Hours Photos Caledonia Drinking Society History and Hours Opened April 6th 2017, Caledonia Brewing is a small batch craft brewery in the heart of Downtown Dunedin, FL. We’re housed in the historic 1924 Dunedin Times building at 587 Main St. Focusing on natural and organic ingredients we serve many of our own small batch craft beers along with some local guest taps from time to time. Caledonia also offers several varietals of wine and other drinks like hard seltzers, sangria and ciders. We also offer many NA beer and options. Our taproom is a large open space with community tables that are perfect for parties, meet ups, meetings, events and games. Call Hollie at 727-351-5105 to reserve a date or table at Caledonia.  We also have a covered pet friendly outdoor patio with seating and a bike rack. We are locally owned and operated and members of the Florida Brewers Guild, Brewers Association, Downtown Dunedin Merchants Association and Dunedin Chamber of Commerce. Started by friends and beer enthusiasts that were home brewers, we decided to take our passion and skills to the next level in our beercentric home town of Dunedin, FL where we work, live and play. Caledonia is name given to Scotland by the Romans and is a nod to the local Scottish heritage here in Dunedin (Sterling Scotland is our sister city). Scotland’s National animal, the unicorn is featured in our logo and decor as well as the Scottish flag, The Saltire. We are known for our Rat Arsed Scotch Ale and its little brother Half Arsed Scottish Ale. We also host The Dunedin Chapter of the New World Celts monthly. Hours Monday 2pm-12am Tuesday 2pm- 12am Wednesday 2pm-12 am Thursday- 2pm-12am Friday- 12pm-12am Saturday-12pm- 12am Sunday-12pm- 10pm 21 and up after 8pm Call (727) 351-5105 2 Responses to History and Hours Pingback: FL AM Group Luncheon – Sat, June 8 | Florida AM Group Pingback: Florida Focus – 1st Installment – Small Towns | The Multifamily Site Leave a Reply Cancel reply You must be logged in to post a comment. Contact Us: Address 587 Main St. Dunedin, FL 34698 Phone (727) 351-5105 Email CB@CaledoniaBrewing.com Facebook @CaledoniaBrewing Instagram @CaledoniaBrewing Twitter @CaledoniaBrews Categories Categories Select Category Uncategorized Calendar September 2025 M T W T F S S « Feb 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 Caledonia Brewing – Dunedin, FL | Powered by Mantra & WordPress."
    },
    {
      "url": "https://www.caledoniabrewing.com/upcoming-events/",
      "text": "Upcoming Events – Caledonia Brewing – Dunedin, FL Menu Skip to content Home Order Online Menu & Merch Events History & Hours Photos Caledonia Drinking Society Upcoming Events Bonsai and Brews every 3rd Wed at Caledonia Brewing Caledonia Brewing  at The Dunedin Beer Fest 2017 Weekly and Monthly Events Caledonia Drinking Society Member Night- every Tuesday, members enjoy $1 off mug fills. Member renew in March, any open spaces will be chosen via lottery. Music Trivia every Thursday – Join us for Tampa bay’s original and best music trivia. We do it every Thursday at 7:30 pm, all decades, all genres music. Prizes for the top 3 teams and the top team gets to hoist the coveted unicorn trophy in glory. Hosted by Big Trophy Trivia. Retrograde: Music Videos from the 80’s and 90’s – VJ Hural Knight plays all your favorite Alternative and New Wave Music Videos from the 80’s and 90’s on the TVs at Caledonia. We do this every Sunday night from 7-10pm 21 and up. New World Celts Monthly Meeting – NWC meet the 1st Monday of every month, come meet some new friends and see what great things they do for our community. Bonsai Workshop with Thunderstruck Bonsai – Aug 20th 7pm.  (3rd Wed of every month) Come pick a tree and a pot and then turn it into a beautiful Bonsai with all instruction and materials provided. Get tickets here Mandala Monday – Aug 25th 6:30 pm-Join Jennifer of HomeGrown & RockSolid for this fun & creative class learning simple techniques to create your own mandala creation. Sign up here Bacon Brunch – Sept 7th 11:30am Palate Culinary Services serves up a delicious gourmet brunch here at the brewery. Tickets required. Pop Up Plant Shop with Evergreen Plant Experience – Sept 3rd 6-9 pm Backspin with DJenerate- Aug 15th, 3rd Friday of every month, DJ playing old school themes, requests and more Music Bingo –  Aug 18th 7:30pm-3rd Mon of every month, Free to Play , 21 and up Bubbles and Bingo –  2nd and 4th Tuesday of each month, Our own Alex is hosting  Bingo night at Caledonia. Join her for traditional bingo with a bubbly twist . We will have specials on Prosecco and Champagne as well as discounted charcuterie. 21 and up Paint Workshop with Wine and Canvas – Aug 27th 6pm Special Events Hops for Hope Fundraiser and donation collectio n Aug 22nd 5-8pm Yacht Rock Party Aug 31st 8pm Oktoberfest at Caledonia Sept 26-28 Caledonia Wine and Beer Mixer Sept 30th 7pm What We Brew in the Shadows Vampire Soiree Oct 10th 8pm Thanksgiving Eve Dance Party Nov 26th 8pm-midnight Upcoming Live Music- All shows after 8pm are 21 and up Joe Denny and the Joy Riders Aug 23rd 8pm Crackerbillys Aug 30th 8pm Boney Fiend Sept 6th 8pm Trey Wanvig Duo Sept 12th 8pm Jazz Phools Oktoberfest Band Sept 27th 8pm Sam Williams Oct 3rd 8pm Peaches and Karim Oct 11th 8pm Matt Zitwer Duo Nov 1st 8pm Stick and Ditty Nov 8th 8pm 12 Strings and A Fiddle Nov 15th 8pm Taylor Jansen Trio Nov 29th 8pm Want to schedule your event here? Call Hollie at 727-351-5105 Looking for more things to do in Dunedin… https://www.kayak.com/Dunedin.16187.guide Bubbles and Bingo at Caledonia Brewing Thrift Store Prom at Caledonia Brewing Retrograde: Music Video Night with VJ Hural Knight Orange Festival Yacht Rock Night! Outlander Premier Party at Caledonia Music Trivia every Thursday 7:30pm Studio 54 Night at Caledonia Brewing Roper Romp at Caledonia Brewing Comments are closed. Contact Us: Address 587 Main St. Dunedin, FL 34698 Phone (727) 351-5105 Email CB@CaledoniaBrewing.com Facebook @CaledoniaBrewing Instagram @CaledoniaBrewing Twitter @CaledoniaBrews Categories Categories Select Category Uncategorized Calendar September 2025 M T W T F S S « Feb 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 Caledonia Brewing – Dunedin, FL | Powered by Mantra & WordPress."
    },
    {
      "url": "https://caledoniabrewing.smartonlineorder.com/",
      "text": "Caledonia Brewing Online Store | Order your favorite Caledonia Beers and Merchandise! 727-351-5105 cb@caledoniabrewing.com Home My Orders Cart Checkout Select Page Order Online Powered by Smart Online Order Facebook X Terms - Privacy - Accessibility"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "text": "Contact Skanem | Reach Out to Our Labelling Experts Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message We proudly present Skanem Nairobi Skanem Nairobi Sachen Gudka Managing Director +254 733 410 309 Send email Skanem Nairobi Sachen Gudka Managing Director +254 733 410 309 Send email Skanem Nairobi Anirudh Shetye Head of Sales & Marketing +254 735 052 700 Send email Skanem Nairobi Anirudh Shetye Head of Sales & Marketing +254 735 052 700 Send email Skanem Nairobi Joyce Njogu Key Account Manager +254 722 804 269 Send email Skanem Nairobi Joyce Njogu Key Account Manager +254 722 804 269 Send email We proudly present Skanem Uganda Skanem Uganda Olive Kunihira Head of Sales +256 759 589 711 Send email Skanem Uganda Olive Kunihira Head of Sales +256 759 589 711 Send email We proudly present Skanem Tanzania Skanem Tanzania Sameer Gaikwad Site Manager +255 757 803 737 Send email Skanem Tanzania Sameer Gaikwad Site Manager +255 757 803 737 Send email Skanem Tanzania Beatrice Malle Key Account Manager +255 712 110 922 Send email Skanem Tanzania Beatrice Malle Key Account Manager +255 712 110 922 Send email Skanem Tanzania Shamila Mirza Key Account Manager +255 717 477 047 Send email Skanem Tanzania Shamila Mirza Key Account Manager +255 717 477 047 Send email Locations Locations Locations How to reach us How to reach us How to reach us How to reach us Skanem Interlabels Nairobi Limited East Africa Headquarters East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa +254 202 471001 info.nairobi@skanem.com Skanem Interlabels Uganda Limited Namanve Industrial Park Mukono Uganda Africa +256 759 589711 olive.kunihira@skanem.com Skanem Tanzania Limited Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa +255 757 803737 sameer.gaikwad@skanem.com Contact us Send us a message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Products Sustainability menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy Products menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "text": "Contact - Parkway Brewing Company Skip to content Parkway Brewing Company Home Brews Where to find Parkway Distribution Online Store About Us Our Team Our Story The Tasting Room On Tap This Week’s Live Music and Food Trucks Private Events Monthly Music & Food Truck Calendar Visiting Parkway Pilot Batch Online Store Beer Buzz Contact Facebook Twitter Instagram Contact Contact Have a specific question? See below for the right contact and we’d love to answer that question for you! Private Events: events@parkwaybrewing.com For music/talent bookings, food trucks, or anything tasting room related: No Phone Calls Please, All Music Booking by Email ONLY kim@parkwaybrewing.com For  sales and distribution: grant@parkwaybrewing.com mike@parkwaybrewing.com For brewing, and general manager: mike@parkwaybrewing.com For office manager: mic@parkwaybrewing.com For invoices: accounts.payable@parkwaybrewing.com Share this: Click to share on Facebook (Opens in new window) Click to share on Twitter (Opens in new window) Click to share on Pinterest (Opens in new window) Click to print (Opens in new window) Subscribe for Updates Search our Site Distinctive Beers Crafted With Care In The Heart Of The Blue Ridge parkwaybrewing.com 739 Kessler Mill Road Exit 141 on I-81, SALEM, VA 540-404-9810 kim@parkwaybrewing.com Facebook Twitter Instagram Brewery Hours Monday – 2pm to 8pm Tuesday – 2pm to 8pm Wednesday – 2pm to 9pm Thursday – 2pm to 9pm Friday – 12pm to 9pm Saturday – 12pm to 9pm Sunday – 12pm to 8pm Holiday Closures: Christmas Day, New Years Day, Memorial Day, July 4th, Labor Day, Thanksgiving Day © 2025 Parkway Brewing Co. | Custom Wordpress Development by William Alexander"
    },
    {
      "url": "https://thunderstruckbonsai.com/events/caledonia-brewing/",
      "text": "Bonsai & Brews at Caledonia Brewing | Dunedin (727) 266-6791‬ Larry@ThunderstruckBonsai.com Facebook Instagram RSS Facebook Instagram RSS My Account Checkout 0 Items About Us Shop Events Events Information Bonsai & Brews Locations Frequently Asked Questions Calendar Blog & Resources Gallery Contact Us Select Page Home Events Archive Bonsai & Brews Events Bonsai & Brews at Caledonia Brewing | Dunedin Date Wed, Sep 17 2025 Time 7:00 pm - 9:00 pm Cost $75.00 GET TICKETS Bonsai & Brews Events Bonsai & Brews at Caledonia Brewing | Dunedin Join Thunderstruck Bonsai for Bonsai & Brews at Caledonia Brewing ! Whether you’re brand new to bonsai or just looking for a creative night out, this event is designed to be fun, approachable, and unforgettable. We’ll kick things off with a quick intro to bonsai, then dive into styling your own tropical pre-bonsai tree. You’ll choose your tree and ceramic pot, and we’ll guide you through pruning, wiring, and potting; step by step. No experience needed, and all materials and tools are provided for the workshop. Caledonia Brewing offers a cozy, laid-back vibe with a rotating selection of house-brewed beers, local guest taps, cider, and wine. It’s the perfect setting to relax, sip something delicious, and create something you’ll be proud to take home. Each Ticket Includes: – A tropical species pre-bonsai tree – Ceramic glazed bonsai pottery – Instructions to style and care for your new bonsai tree – Wire, bonsai soil, and substrate – Use of all necessary tools provided – Aftercare instructions and guidance Space is limited and these events tend to sell out, especially in Dunedin. Grab your tickets early and come grow with us! Share this event + Add to Google Calendar + iCal / Outlook export X Location Caledonia Brewing 587 Main Street, Dunedin, FL, USA 1 Select Ticket 2 Attendees 3 Checkout Dates: Wed, Sep 17 2025 7:00 pm - 9:00 pm Wed, Oct 15 2025 7:00 pm - 9:00 pm Wed, Nov 19 2025 7:00 pm - 9:00 pm Event Ticket | Caledonia $75 Available Tickets: 14 Caledonia Brewing | Dunedin The \"Event Ticket | Caledonia\" ticket is sold out or not available for some of dates. You can try another ticket or another date. Total: 0 Next Tags Bonsai Bonsai & Brews Caledonia Brewing Dunedin Events Tampa Bay Workshops Labels Dunedin Organizer Larry Naeder Phone 727-266-6791 Email larry@ThunderstruckBonsai.com Website Larry Naeder | Thunderstruck Bonsai Other Organizers Artists Larry Naeder Larry Naeder Larry Nader is the owner of Thunderstruck Bonsai, a nursery dedicated to creating living bonsai art. His deep passion for bonsai artistry has earned him widespread recognition and respect in the bonsai community. Larry has displayed his trees at the EPCOT International Flower & Garden Festival for three consecutive years, showcasing his skill. He has participated in various national bonsai exhibitions, where his work has been celebrated for its artistic quality and technical execution. As the owner of Thunderstruck Bonsai, Larry has built a thriving business dedicated to nurturing and cultivating premium bonsai specimens. He is deeply committed to fostering a strong sense of community through education and consultation on bonsai care. Larry actively engages with the community through workshops and educational events, teaching enthusiasts and newcomers about the artistry and techniques of bonsai. In addition to his impressive achievements, Larry serves as the Vice President of the Suncoast Bonsai Society and is a member of the BSF Epcot Committee. He is also a dedicated student of renowned bonsai artist Nacho Marin, further enhancing his expertise and artistry. Justin Zabinski Justin Zabinski Next Occurrences Wed, Oct 15 2025 7:00 pm -  9:00 pm Wed, Nov 19 2025 7:00 pm -  9:00 pm Thunderstruck Bonsai 5.0 Based on 159 reviews powered by G o o g l e review us on JG Douthat 19:53 17 Dec 24 This was a great class! I had been looking forward to learning more about bonsai and how to start off and I was surprised at how much I learned and enjoyed my time. I would highly recommend to anyone wanting a fun outing! Steve Poisall 12:59 16 Dec 24 Great information, fun atmosphere, quality products! Erin Roberts 00:16 08 Dec 24 We had a great time trimming and repotting our Bonsai’s! The Thunderstruck crew were so helpful and knowledgeable and made it a really fun afternoon. Definitely would do this again.❤️❤️ See All Reviews Reviews TSB-Unique-ID-2025 Thunderstruck Bonsai 5.0 Based on 159 reviews powered by G o o g l e review us on JG Douthat 19:53 17 Dec 24 This was a great class! I had been looking forward to learning more about bonsai and how to start off and I was surprised at how much I learned and enjoyed my time. I would highly recommend to anyone wanting a fun outing! Steve Poisall 12:59 16 Dec 24 Great information, fun atmosphere, quality products! Erin Roberts 00:16 08 Dec 24 We had a great time trimming and repotting our Bonsai’s! The Thunderstruck crew were so helpful and knowledgeable and made it a really fun afternoon. Definitely would do this again.❤️❤️ Walt Blenner 22:36 04 Dec 24 Knowing nothing about growing Bonsai trees, we eagerly took Larry's class and in 2 hours or less came away with all we need to make a go of it. Larry was instructive, knowledgeable and patient with our group who demonstrated no skills in this new living hobby. There's much more to learn if we want to expand beyond one growing Jade plant, but I'm looking forward to more of Larry's good talents. carmen stockton 15:18 04 Dec 24 It was a great time…. Learned a lot and would love to do it again!!! Very nice teachers!! Errol Stewart 05:00 27 Nov 24 Man, those guys gave an incredibly well laid out, informative and hands on presentation presentation covering Bonsai.  All of their folks were knowledgeable and knew how to interact with folks who didn't really have a clue...  If you are considering dabbling in bonsai plant, I highly recommend one of their courses... Misty Heath 22:18 27 Apr 24 The venue was great. The instructor very knowledgeable and walked us through styling our bonsai. We had a great time. Leonard Mencio 15:30 24 Apr 24 What a great Birthday gift by my wife! She registered us last weekend with Thunderstruck Bonsai’s ,“Bonsai and Brews Event” for my Birthday, and we had a phenomenal time. Owner and Operators, Larry and Justine made the session of learning different aspects of bonsai creations so much fun. Both Larry and Justine are very approachable, friendly and a wealth of information. We got to pick our own tree, and pot to work on, while all the tools and materials were provided and ready when we got there. There was a short and extremely informative basic bonsai class with Larry and Justine (he was the artist, sort-of, lol), before working on our bonsai. Although given creative freedom, they both were great at getting around to everyone, coaching your pruning and designs, potting and wiring, if needed. When it’s all done… you have learned some of the basics, have a gentle grasp of bonsai designs, and best of all… you take your bonsai home! Loved this event, and we highly recommend this for any occasion! Great event, great guys and loads of fun… yes, the drinks were really good! A+ Chris Lay 10:38 19 Apr 24 Very enjoyable and informative evening.  Thanks!!!! Tiffany Potter 17:16 18 Apr 24 Did the Bonsai class at Caledonia Brewing last night. A lot of fun! Selection of trees and pots was great. Instructions were easy to follow and instructors were amazing. Highly recommend. Can't wait to see how my Bonsai progresses Stephanie Andreassen 17:15 18 Apr 24 Great beginner workshop! Learned a lot and can’t wait to see how my new bonsai comes along! Greg Daloiso 20:49 03 Apr 24 My wife and I had a great time and learned a lot. Would definitely do it again Denise Leider 20:45 23 Mar 24 Lot's of fun. Very knowledgeable instructor and they gave much needed assistance. Great atmosphere at Keel & Curley Winery too. Shannon Wagner 00:55 21 Mar 24 Annemarie Schriever 20:25 20 Mar 24 This was such a an amazing experience!! So glad we did it. Wasn't relaxing and fun. Everyone is very nice! Melanie “Melanie Ann” Rhoades 22:18 19 Mar 24 My husband, and I decided to sign up and see what's this is all about. Thinking it's a quick here do this and move on. It was so much more and so fun. We got instructions on the different shapes and the different types of care to preform (with a follow up email with added reminders for care and upkeep). We got to pick from a variety of pots and were shown how to start and how to cut the plants! I will say I loved this and it was worth every penny. Melissa Fuller 21:12 19 Mar 24 We attended a group class and had a great time! They went over history of the bonsai and different types of trees. We trimmed our own trees (with help when needed) and had a wonderful night. It was nice to go home with our own tree. Kristy Roberts 09:49 13 Mar 24 Such a great experience! We learned a lot. The workshop was very hands on and we had a bunch of help. I’m excited to see how my tree turns out. Kim Markgraf 05:07 08 Mar 24 We had so much fun with the bonsai and brews event put on by Larry! It was a super informative experience, and was so cool to learn the process and create something that we can keep up at home! I highly recommend it for a group event or date night out! Stacey Keys 00:22 27 Feb 24 Seminar was fun and the location at Bonsai Beverage was a perfect location Deena Murphy 18:59 22 Feb 24 Great experience! The instructors were very knowledgeable and helpful with teaching us about Bonsai techniques. Can’t wait to see how my tree evolves over time. Tania 19:31 20 Feb 24 The 2 hour Bonsai seminar with Bonsai, potting material, and a real ceramic pot all included at Beerbusters was fun! The teachers/owners were knowledgeable and helpful. I found a tree and pot I loved and which spoke to me. I can't wait to do more with my little tree. They even found me a few clippings to start some more trees on my own. They followed up with care instructions. I've yet to read the instructions but I hope they will remind of about how to clip, water, and feed them. I only wish it was a bit longer so I could learn about connect with my table mates! heather pfiel 05:14 20 Feb 24 Amazing class! Amazing teachers! I left this class feeling inspired, and with a profound appreciation for the art of bonsai. The passion transcends from teacher to student! Thank you so much! Highly recommend to any and all! What a great experience! Sally Frakes 13:15 18 Feb 24 Learned about the history of Bonsai and the Art of taking care of our precious species. Unique experience with Thunderstruck Bonsai. M. Keith Fox 11:32 18 Feb 24 Bonsai & Brews was a great introduction to the Bonsai way of growing an authentic piece of art. Larry and his assistant were fantastic with their one-on-one attention in a group class—a shout-out to 3 Daughters Brewery. Dana M 01:23 29 Jan 24 We had a great time and we learned so much!! Linda Gasser 22:26 23 Jan 24 My husband Lenny & I immensely enjoyed your recent session of Bonsai & Brews at 3 Daughters Brewpub at Clearwater Beach Thanks so much for doing these programs!  What a great idea & a great way to spread your love of this living & creative art to others! And, I expect I may have now begun a new hobby! We had such fun learning something new! I also appreciated the follow-up care guide you sent afterwards so our new bonsai trees will get off to a great start. Hope you keep these going & go to more places too! --Linda & Lenny  (NYS & Sandkey) Judith Taub 18:02 23 Jan 24 It was a really wonderful experience you learn a lot of information and bring home your own bonsai tree. Recommend for all Evan Richardson 18:30 19 Jan 24 Went to one of the workshops. Very informative and a great time. Would recommend. Abigail Xiques 02:19 16 Jan 24 We truly had a great time at this event! Thunderstruck had beautiful trees to pick from and they were very helpful with questions and suggestions. Nanette Axibal 22:23 15 Jan 24 Attended Bonzai & Brew and had a great learning experience.  Highly recommended! Amanda Sholler 20:40 15 Jan 24 Was very enjoyable and Knowledgeable MELISSA GRIMA 15:34 08 Dec 23 I attended the Bonsai and Brews event and loved it! All the supplies were provided, and it was fun and educational experience. Larry and Justin were also very helpful and attentive. I would highly recommend! Chris Ramos 04:26 20 Nov 23 Wife and I had an amazing time learning how to grow and care for Bonsais. Barbara Travis 14:44 13 Nov 23 I had so much fun and learned so much from this class! I would highly recommend Thunderstruck! Darlene Hill 20:23 10 Nov 23 I had so much fun. Class was so informative and amazing.  I truly enjoyed being able to pot and trim my own bonsai tree with the one on one help I had making it feel like I really did it myself. I would recommend this class to anyone who wants to try bonsai! Thank you so much for a wonderful experience. Jo-Ann Christina 16:26 10 Nov 23 Great fun! Lots of interesting information. Excellent personalized attention to all who attended. Melanie Peek 12:40 30 Oct 23 I would definitely recommend Bonsai and Brews! Larry and Justin did a great job educating us on the art of bonsai. They took the time to help each person step by step on how to pot them, trim them and care for them! I will definitely attend one of these events again! Thanks Thunderstruck💚 Guincho dee 14:00 20 Oct 23 This was so much fun!! I enjoyed learning about bonsai and how to keep my tree alive lol! Would not hesitate to attend another event and recommend this to everyone!! R T 20:13 18 Sep 23 I had a good time at the Introductory Bonsai Class by Thunderstruck Bonsai.  The venue and drinks were good and the instructors were fun and helpful. Thomas “Mr Tom” Gatta 15:30 18 Sep 23 Man o man where do I start!!! This was an experience we can never forget!!! It was a nice date with my wife and she loved it!! We learned something new that day and appreciate this class so much. These dudes definitely are the real heroes. They are BONSAI tree legends!! Luke Herchenbach 13:34 26 Jul 22 Larry is amazing. I bought my first tree from him at a festival and just this past weekend I brought it back to him for confirmation that I’m not killing my plant, along with another bonsai I bought, that I am CERTAIN I was killing. He took the time to teach me how to prune my Jade and confirmed with me that my other plant isn’t dying. I was so impressed with his insights I ended up buying a second tree. This guy really knows what he is doing and I’m 100% looking forward to buying more trees from him in the future. Emily Stairs Abenchuchan 14:40 17 Jun 22 We went to the Bonsai and Brews at 3 Daughters last night and it was awesome! Larry is not only knowledgeable, he is kind. He had 2 assistants with him (Justin and I think his name was Kai?) who were also knowledgeable and kind. There was no concern about doing it \"wrong\", they gave support and gentle guidance and encouraged us to be creative and tell a story with our bonsai styles. Larry's passion for bonsai is contagious and he's got a real skill for showing the beauty of the art. 10/10 Faye Podlesney 01:42 20 May 22 What an incredibly beautiful display of bonsai. He was extremely knowledgeable and meticulous in his craft! We bought 4 bonsai from him and wanted to replant them in the proper season. He was kind enough to make sure we had all the proper equipment and walk us through each step.  I would highly recommend this business for any and all bonsai needs. HE ALSO DOES WORKSHOPS!!! How cool!!!! johnny cage 12:08 04 May 22 The guy really takes care of these trees, i bought a few bonsai trees for a gift for my mother's bday, a couple Barbados cherry bonsai trees and the one you seen in karate kid. She loved them, now she has some new additions to her garden. Stop by and take a look for yourself, you wont be disappointed. Drew Kate Sommers 13:16 16 Apr 22 Thunderstruck Bonsai is one of the best bonsai places we've ever visited. We were very impressed with the quality and variety of the trees, and how they are so well cared for. That's not always the case at the nurseries by us but it's obvious Larry knows what he's doing and is passionate about it.  He is a wealth of knowledge and patiently answered all our questions.  We went with the intention of just looking around (we live in IL and are here on vacation) and left with 2 beautiful trees that were very reasonably priced and my son is crazy about.  Thank you, Thunderstruck Bonsai! Fantastic place. Get In Touch Interested in hosting a bonsai event?! Drop your info below and we will get in touch with you! First Name Last Name Email Address Subject Subject Class Product Message 6 + 1 = Submit Follow Follow Follow EVENTS Information Upcoming Events Bonsai & Brews Event Locations Host An Event FAQ’s Calendar QUICK LINKS About Shop Reviews Events Blog Gallery My Account Contact Us Team Building with Bonsai Workshops: Cultivating Connections and Creativity Celebrating Bonsai & Brews: A Spotlight on Lynn Gonzalez Celebrating Florida’s Finest Breweries with Bonsai & Brews Citrus Hills Garden Club embraces the art of bonsai A Romantic Journey for Your Date Night: Bonsai & Brews Larry Naeder of Thunderstruck Bonsai featured on WFLA’s Daytime Say hello to your newest obsession: Bonsai Bonsai & Brews on Great Day Live Tampa Bay Thunderstruck Bonsai in Pinellas Park brings zen art of tiny trees to a bar near you Voyage Tampa: Meet Larry Copyright © 2021-2025 Thunderstruck Bonsai.  © 2021-2025 Bonsai & Brews. All rights reserved. Follow Follow Follow 0 TSB-Unique-ID-2025 My cart Close cart Your cart is empty. Looks like you haven't made a choice yet. Got a discount code? Apply Subtotal $ 0.00 Tax $ 0.00 Shipping Total $ 0.00 Your cart is empty. Shop now"
    },
    {
      "url": "https://www.caledoniabrewing.com/tag/dunedin-times/",
      "text": "Dunedin Times – Caledonia Brewing – Dunedin, FL Menu Skip to content Home Order Online Menu & Merch Events History & Hours Photos Caledonia Drinking Society Tag Archives: Dunedin Times Our Location By admin | February 23, 2016 - 3:54 pm | February 23, 2016 Uncategorized Leave a comment We are proud to live, work, and play in beautiful downtown Dunedin. It is the oldest city south of Cedar Key in Florida, founded in 1899 and named after Edinburgh, the capital of Scotland. This city and Caledonia Brewery have strong Scottish heritage and are proud of our roots. The city is home to the annual Dunedin Highland games and we are neighbors of the Scottish American society. We are also close to Florida Auto Exchange Stadium, the Spring training site for the Toronto Blue Jays as well as one of the worlds best beaches, Honeymoon Island. We are located on the gateway of historic Main Street and are housed in the old Dunedin Times Building, the original hometown newspaper that was built in 1925. The newspaper was printed here until 1965 and then became home to a popular local business Dunedin Printing. We are happily restoring the building to its original glory. Tagged baseball , Beaches , Beer , Blue Jays , building , Caledonia , Cedar Key , Craft Beer , Dunedin , Dunedin Printing , Dunedin Times , Gateway , Grant Field , Highland Games , History , Main Street , Scotland , Scottish American society , tourism Contact Us: Address 587 Main St. Dunedin, FL 34698 Phone (727) 351-5105 Email CB@CaledoniaBrewing.com Facebook @CaledoniaBrewing Instagram @CaledoniaBrewing Twitter @CaledoniaBrews Categories Categories Select Category Uncategorized Calendar September 2025 M T W T F S S « Feb 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 Caledonia Brewing – Dunedin, FL | Powered by Mantra & WordPress."
    },
    {
      "url": "https://www.tampabay.com/things-to-do/food/spirits/we-tried-that-brewing-beer-at-caledonia-brewing-in-dunedin/2333639/",
      "text": "We Tried That: Brewing beer at Caledonia Brewing in Dunedin Search Subscribe Manage profile Donate Log in Log out Menu Close Journalism you trust. Your News. Your Way. Subscribe Support Local Journalism Donate Home Home Log in Log in Log out Log out Search Search Newsletters Newsletters Help chat Help Chat Go to the e-Newspaper Navigation caret Go to the e-Newspaper Subscribers only Featured The Marked Man Buying up the Bay Elections The Housing Experiment Latest News Navigation caret Regions Pinellas Hillsborough Pasco Hernando St. Petersburg Tampa Clearwater Topics Education Business Real Estate Politics Crime Obituaries Navigation caret Weather Navigation caret Sports Navigation caret Bucs Rays Lightning High Schools Bulls Gators Seminoles Viewpoints Navigation caret Life & Culture Navigation caret Things To Do Calendar Food Navigation caret Videos Navigation caret Photos Navigation caret Investigations Navigation caret Connect with us Navigation caret Games & Puzzles Navigation caret Shop Navigation caret Tampa Bay Times Logo The words \"Tampa Bay Times\" written in a Gothic font Hurricane News Sports Viewpoints Life & Culture Food Obituaries Classifieds Today's Paper Newsletters e-Newspaper e-Newspaper Subscribers only Subscribe Advertisement Bars & Breweries We Tried That: Brewing beer at Caledonia Brewing in Dunedin Carlynn Crosby stirs malted barley in a kettle with hot water at Caledonia Brewing in Dunedin as she helps brew Classic Jeff Pale Ale under the watchful eye of co-owner and brewer Dave Dally. By Carlynn Crosby, Times Correspondent Published MORE FOR YOU In Dunedin, MockFusion creates bar atmosphere minus the alcohol • Bars & Breweries Temple Terrace bets big on boozy pickleball complex • Bars & Breweries Advertisement After 2 years, Clearwater brewery reopens under new management • Bars & Breweries Move to bigger location equals more business for St. Petersburg sports bar • Bars & Breweries Sip and learn at Savoir, St. Petersburg’s newest wine bar • Food This new restaurant is doing something Tampa Bay diners haven’t seen before • Food After a rocky start, Mango’s Southern Kitchen + Bar finds its footing • Food This Safety Harbor brewery is expanding. Here’s what to know. • Bars & Breweries Here’s the first retail spot coming to St. Petersburg’s tallest tower, 400 Central • Food A new Japanese cocktail lounge is coming to Tampa Heights • Food Advertisement Advertisement Advertisement Tampa Bay Times Logo The words \"Tampa Bay Times\" written in a Gothic font Instagram Facebook Twitter/X Youtube LinkedIn Contact Help Chat Customer Service Submit a News Tip Contact Account Digital access Home delivery Newsletters Manage my account Donate Subscriber FAQ e-Newspaper FAQ e-Newspaper App FAQ About Times Publishing Company About us Connect with us Careers Advertise Times Total Media Media Kit Place an ad Public Notices Classifieds Best of the Best Shop Champa Bay Shop Bucs Hardcover Book Lightning Hardcover Book Photo Reprints Article Reprints Article Licensing Historic Front Pages Meeting Backgrounds More Spotlight News in Education Expos Homes Sponsored Content Special Sections Apps Podcasts Archives © 2025 All Rights Reserved Times Publishing Company Privacy Policy ONLY AVAILABLE FOR SUBSCRIBERS The Tampa Bay Times e-Newspaper is a digital replica of the printed paper seven days a week that is available to read on desktop, mobile, and our app for subscribers only. To enjoy the e-Newspaper every day, please subscribe. Subscribe Log in"
    }
  ]
}