{
  "fuentes": [
    {
      "url": "https://www.calusanature.org/about",
      "email": "cmickolayck@calusanature.org"
    },
    {
      "url": "https://www.calusanature.org/about",
      "email": "cnameth@calusanature.org"
    },
    {
      "url": "https://www.calusanature.org/about",
      "email": "eraddatz@calusanature.org"
    },
    {
      "url": "https://www.calusanature.org/about",
      "email": "jhodge@calusanature.org"
    },
    {
      "url": "https://www.calusanature.org/about",
      "email": "kpaulus@calusanature.org"
    },
    {
      "url": "https://www.calusanature.org/about",
      "email": "maxxc@calusanature.org"
    },
    {
      "url": "https://www.calusanature.org/about",
      "email": "nwielert@calusanature.org"
    },
    {
      "url": "https://www.calusanature.org/about",
      "email": "rmickolayck@calusanature.org"
    },
    {
      "url": "https://www.calusanature.org/about",
      "email": "tsherman@calusanature.org"
    },
    {
      "url": "https://www.calusanature.org/get-involved",
      "email": "admin@calusanature.org"
    },
    {
      "url": "https://www.calusanature.org/get-involved",
      "email": "volunteer@calusanature.org"
    },
    {
      "url": "https://www.calusanature.org/post/summer-camp-registration-now-open-sign-up-today",
      "email": "eraddatz@calusanature.org"
    },
    {
      "url": "https://volunteer.unitedwaylee.org/agency/detail/?agency_id=128189",
      "email": "volunteer@unitedwaylee.org"
    },
    {
      "url": "https://volunteer.unitedwaylee.org/agency/detail/?agency_id=128189",
      "email": "admin@calusanature.org"
    },
    {
      "url": "https://volunteer.unitedwaylee.org/agency/detail/?agency_id=128189",
      "email": "volunteer@calusanature.org"
    },
    {
      "url": "https://www.calusanature.org/post/renowned-cartoonist-doug-macgregor-to-headline-calusa-nature-center-s-first-ever-arts-crafts-fair",
      "email": "eraddatz@calusanature.org"
    },
    {
      "url": "https://www.calusanature.org/post/renowned-cartoonist-doug-macgregor-to-headline-calusa-nature-center-s-first-ever-arts-crafts-fair",
      "email": "lkessler@calusanature.org"
    },
    {
      "url": "https://www.calusanature.org/post/renowned-cartoonist-doug-macgregor-to-headline-calusa-nature-center-s-first-ever-arts-crafts-fair",
      "email": "volunteer@calusanature.org"
    },
    {
      "url": "https://www.calusanature.org/education",
      "email": "education@calusanature.org"
    },
    {
      "url": "https://www.calusanature.org/education",
      "email": "education@calusanature.org"
    },
    {
      "url": "https://www.calusanature.org/post/celebrate-a-bright-2025-join-us-in-the-joy-of-protecting-nature-and-enjoy-our-holiday-lights-one-mo",
      "email": "eraddatz@calusanature.org"
    },
    {
      "url": "https://www.news-press.com/story/news/local/2024/09/05/calusa-nature-center-taylor-swift-mesmerica-360-laser-light-shows-fort-myers-florida-tickets/74951140007/",
      "email": "crunnells@gannett.com"
    },
    {
      "url": "https://www.theatrenantucket.org/about-us/staff-and-board-of-directors",
      "email": "info@theatrenantucket.org"
    },
    {
      "url": "https://www.calusanature.org/post/goodbye-milton-hello-thrill-on-cncp-reopens-saturday",
      "email": "eraddatz@calusanature.org"
    },
    {
      "url": "https://www.calusanature.org/post/goodbye-milton-hello-thrill-on-cncp-reopens-saturday",
      "email": "info@calusanature.org"
    },
    {
      "url": "https://www.wgcu.org/tags/calusa-nature-center-planetarium",
      "email": "wgcumain@fgcu.edu"
    },
    {
      "url": "https://signup.com/group/759736404069",
      "email": "volunteer@calusanature.org"
    },
    {
      "url": "https://news.wgcu.org/show/gulf-coast-life/2025-04-09/stargazing-and-nurturing-nature-at-the-calusa-nature-center-planetarium",
      "email": "mkiniry@wgcu.org"
    },
    {
      "url": "https://news.wgcu.org/show/gulf-coast-life/2025-04-09/stargazing-and-nurturing-nature-at-the-calusa-nature-center-planetarium",
      "email": "wgcumain@fgcu.edu"
    },
    {
      "url": "https://www.calusanature.org/",
      "email": "c183baa23371454f99f417f6616b724d@sentry.wixpr"
    },
    {
      "url": "https://www.calusanature.org/post/happy-holidays-from-calusa-nature-center-don-t-miss-our-stunning-holiday-lights",
      "email": "eraddatz@calusanature.org"
    },
    {
      "url": "https://www.tripowervacationrentals.com/calusa-nature-center-planetarium/",
      "email": "rentals@c21tripower.com"
    },
    {
      "url": "https://www.calusanature.org/about/plan-your-visit/",
      "email": "cmickolayck@calusanature.org"
    },
    {
      "url": "https://www.calusanature.org/about/plan-your-visit/",
      "email": "cnameth@calusanature.org"
    },
    {
      "url": "https://www.calusanature.org/about/plan-your-visit/",
      "email": "eraddatz@calusanature.org"
    },
    {
      "url": "https://www.calusanature.org/about/plan-your-visit/",
      "email": "jhodge@calusanature.org"
    },
    {
      "url": "https://www.calusanature.org/about/plan-your-visit/",
      "email": "kpaulus@calusanature.org"
    },
    {
      "url": "https://www.calusanature.org/about/plan-your-visit/",
      "email": "maxxc@calusanature.org"
    },
    {
      "url": "https://www.calusanature.org/about/plan-your-visit/",
      "email": "nwielert@calusanature.org"
    },
    {
      "url": "https://www.calusanature.org/about/plan-your-visit/",
      "email": "rmickolayck@calusanature.org"
    },
    {
      "url": "https://www.calusanature.org/about/plan-your-visit/",
      "email": "tsherman@calusanature.org"
    }
  ],
  "mails": [
    "admin@calusanature.org",
    "c183baa23371454f99f417f6616b724d@sentry.wixpr",
    "cmickolayck@calusanature.org",
    "cnameth@calusanature.org",
    "crunnells@gannett.com",
    "education@calusanature.org",
    "eraddatz@calusanature.org",
    "info@calusanature.org",
    "info@theatrenantucket.org",
    "jhodge@calusanature.org",
    "kpaulus@calusanature.org",
    "lkessler@calusanature.org",
    "maxxc@calusanature.org",
    "mkiniry@wgcu.org",
    "nwielert@calusanature.org",
    "rentals@c21tripower.com",
    "rmickolayck@calusanature.org",
    "tsherman@calusanature.org",
    "volunteer@calusanature.org",
    "volunteer@unitedwaylee.org",
    "wgcumain@fgcu.edu"
  ],
  "nombre_sitio": "calusanature.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.calusanature.org/about",
      "text": "About | Calusa Nature Center and Planetarium top of page Donate Nurture Nature Memberships Sponsorships Member Log In Virtual Tour Home About Us Planetarium Planetarium Schedule Sounds of the Ocean YOUniverse Nature Center Education Events & Registration Haunted Walk Holiday Lights Event Rentals Get Involved Volunteer Application Internships Careers Wish List News More Use tab to navigate through the menu items. Calusa Nature Center & Planetarium Introducing the largest green space in the City of Fort Myers Inspiring people to connect with nature History Staff Board Transparency Meet our staff Professional, passionate, and green! The Calusa Nature Center and Planetarium staff know their stuff and are excited to share their knowledge with you! Learn more about them here. Staff Eric Raddatz Executive Director eraddatz@calusanature.org Maxx Chadwick Animal Care & Internship Coordinator maxxc@calusanature.org Chris Mickolayck Marketing Manager/Administrative Assistant cmickolayck@calusanature.org Nancy Wielert Educator Carrie Nameth Education and Wildlife Director Sarah Temple Seasonal Camp Teacher cnameth@calusanature.org Todd Sherman Planetarium Supervisor tsherman@calusanature.org Kelly Paulus Animal Care Specialist/Educator kpaulus@calusanature.org Rob Mickolayck Guest Services Manager rmickolayck@calusanature.org Johnathan Hodge Planetarium Assistant jhodge@calusanature.org Marsh Greenbaum Seasonal Camp Teacher nwielert@calusanature.org Board of Trustees The Calusa Nature Center and Planetarium is grateful for the leadership of our Board of Trustees. Check out the talent that is leading us into the twenty first century! Board Executive Committee Britta Soderqvist Chair About Britta Brian Goldberg Executive Committee About Brian Kaitlin Danks Secretary About Kaitlin David Yates Executive Committee About David Carol Reynolds Treasurer About Carol Edwin (Win) Everham Executive Committee About Win Not Pictured: ​ ​ Chris Campbell ​ ​ ​ Breanna Frankel Trustees William (Bill) Hammond Trustee Emeritus Connie Bennett-Martin About Connie Susie Hassett About Susie Dick Anderson Brent Jackson Not Pictured: ​ Chris Campbell Charles Schwass Jeff Starrak ​ ​ ​ About Dick Transparency and accountability Building trust in our community is vitally important for our success. We strive to encourage investment and involvement through continued transparency on our fundraising, projects, programs, and achievements. Follow us along as we grow here! UPDATED BY-LAWS Trasparency The Calusa Nature Center and Planetarium is proud to have achieved the Candid Gold Transparency Seal for 2024. Candid (formerly GuideStar) showcases nonprofit organizations and helps them build trust through transparency in their work and financials. See more below. Read More Knowing we are a sound investment is important when you are considering where to donate your funds. To support our commitment to transparency and accountability, we made it easy to access our public 990 forms, required documentation to the IRS. You can access them below. Read More Thank you to our Sponsors & Partners Open Hours: Tuesday - Sunday: 10am - 4pm ​ Pricing: Adults $13 Children $7 Members Free Up CALUSA NATURE CENTER AND PLANETARIUM IS REGISTERED WITH THE STATE OF FLORIDA. A COPY OF THE OFFICIAL REGISTRATION (CH661) AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES BY CALLING TOLL-FREE 1-800-435-7352 WITHIN THE STATE OR VISITING WWW.800HELPFLA.COM . REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL, OR RECOMMENDATION BY THE STATE. OUR CONFIDENTIALITY POLICY, CONFLICT OF INTEREST POLICY AND WHISTLEBLOWER POLICY ARE AVAILABLE UPON REQUEST. EIN #23-7090889 Contact Us © 2024 by CNCP ​ bottom of page"
    },
    {
      "url": "https://www.calusanature.org/get-involved",
      "text": "Get Involved | Calusa Nature Center top of page Donate Nurture Nature Memberships Sponsorships Member Log In Virtual Tour Home About Us Planetarium Planetarium Schedule Sounds of the Ocean YOUniverse Nature Center Education Events & Registration Haunted Walk Holiday Lights Event Rentals Get Involved Volunteer Application Internships Careers Wish List News More Use tab to navigate through the menu items. Help Us Inspire the Next Generation of Environmentalists! Volunteer Our volunteers are a huge part of what makes Calusa Nature Center & Planetarium a success. You can  earn volunteer or service-learning hours in a number of areas such as: gardening, landscaping, maintenance, office work, animal care, education and more! Fill out an application via the Volunteer Application on the dropdown menu. If you have any questions, please email volunteer@calusanature.org Donate As a 501c3 not-for-profit organization, we receive all our funding from admission and donations. Every dollar we receive is put back into the care of our animals and the upkeep of our 105 acres. If you would prefer to donate items to help us with our everyday functions, we are always in need of new and used items such as: sheets and towels, hand and dish soap, hand sanitizer, sunscreen and bug spray, dog toys, produce, peanut butter, cleaning supplies, gardening tools, and office supplies! Visit here for a current list of urgent needs. If you have any other items you wish to donate, please give us a call to see if we can put them to good use: 239.275.3435 ​ Internships We offer a wide variety of professional internships at the high school, undergraduate, and graduate school levels. We work directly with each individual student to develop an internship plan to focus on the goals and responsibilities of the student to maximize the real-world experience provided. Internships we have available but are not limited to: Environmental Education Research Wildlife/Zoology Non-profit Management Marketing and Public Relations Astronomy and Astronomy Education Event Planning and Fundraising Hospitality and Tourism For an internship application, or, if you do not see an internship opportunity on the list but have an idea and concept of what you would like to accomplish during your professional experience, please email admin@calusanature.org . DONATE Thank you to our Sponsors & Partners Open Hours: Tuesday - Sunday: 10am - 4pm ​ Pricing: Adults $13 Children $7 Members Free Up CALUSA NATURE CENTER AND PLANETARIUM IS REGISTERED WITH THE STATE OF FLORIDA. A COPY OF THE OFFICIAL REGISTRATION (CH661) AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES BY CALLING TOLL-FREE 1-800-435-7352 WITHIN THE STATE OR VISITING WWW.800HELPFLA.COM . REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL, OR RECOMMENDATION BY THE STATE. OUR CONFIDENTIALITY POLICY, CONFLICT OF INTEREST POLICY AND WHISTLEBLOWER POLICY ARE AVAILABLE UPON REQUEST. EIN #23-7090889 Contact Us © 2024 by CNCP ​ bottom of page"
    },
    {
      "url": "https://www.calusanature.org/post/summer-camp-registration-now-open-sign-up-today",
      "text": "Summer Camp Registration Now Open – Sign Up Today! top of page Donate Nurture Nature Memberships Sponsorships Member Log In Virtual Tour Home About Us Planetarium Planetarium Schedule Sounds of the Ocean YOUniverse Nature Center Education Events & Registration Haunted Walk Holiday Lights Event Rentals Get Involved Volunteer Application Internships Careers Wish List News More Use tab to navigate through the menu items. All Posts Planetarium Search Summer Camp Registration Now Open – Sign Up Today! eraddatz7 Mar 5 7 min read Registration is now officially open for our highly anticipated Summer Camp program! With a variety of fun-filled, educational, and adventurous camps, there’s something for every child this summer. From exciting outdoor exploration to hands-on activities and live animal encounters, our summer camps offer an unforgettable experience. Each camp is designed with a 20-child maximum and will be led by two experienced lead counselors, supported by full-time staff and interns. Our camps are tailored to specific age groups, and we adhere strictly to our grade-level guidelines to ensure the best experience for every child. Registration is now open for our Summer Camp program, offering a variety of fun, educational, and adventurous camps for children. With a 20-child maximum per camp and experienced counselors, kids will explore the outdoors, engage in hands-on activities, and enjoy live animal encounters. Camp Details: Cost: $200 per week for members $250 per week for non-members Special rate for the week of July 4th: $180 for members, $200 for non-members Camp Times: Drop-off: 8:30–9:00 AM Pick-up: 3:30–4:00 PM Camp activities: 9:00 AM–3:30 PM Activities Include: Indoor/outdoor exploration, hands-on crafts, games, hikes, planetarium shows, and live animal encounters. What to Bring: Change of clothes Towel Water shoes Refillable water bottle Sunscreen & insect repellent Packed lunch & extra snacks Available Camps by Week and Grade Level: June 9th Wild Florida (1st-3rd grade) Junior Naturalist (4th-6th grade) June 16th Outdoor Survival (1st-4th grade) Outdoor Survival (5th-8th grade) June 23rd Nocturnal Nature (1st-3rd grade) Riveting Reptiles (4th-6th grade) June 30th Feathered Friends (1st-5th grade) July 7th Space Science (4th-6th grade) Space Adventures (1st-3rd grade) July 14th Nature Crime Scene Investigators (4th-6th grade) Nature Detectives (1st-3rd grade) July 21st Outdoor Survival (5th-8th grade) Outdoor Survival (1st-4th grade) July 28th Nature Maker Space (4th-6th grade) Nature Maker Space (1st-3rd grade) August 4th Wild About Water (1st-4th grade) Camp registration will remain open until camps fill or until the Friday before the camp week begins. Don’t miss out – sign up early to secure a spot for your child! For more information or to register, please visit https://www.calusanature.org/calusa-summer-camps and buy your tickets now ! Make this summer one to remember with unforgettable experiences, lifelong friendships, and the wonders of nature! ALSO COMING UP: Night Hikes March 28, April 25, May 30 (Times Vary) Join us for an immersive night hike through our preserve, where you can listen for owls, search the sky for bats, and discover constellations. Learn how animals adapt to the darkness, all while exploring the nighttime world. Get your tickets now! Nature Speaker Series – Dr. Bill Hammond March 12, 2025 | 7:00 PM Dr. Bill Hammond, a passionate advocate for environmental conservation, emphasizes that nurturing nature is not only vital for preserving biodiversity but also essential for our well-being. By fostering a deeper connection to the natural world, we can develop a greater sense of responsibility to protect and sustain the environment for future generations. Dr. Hammond believes that spending time in nature has profound benefits for mental health, offering a sense of peace and renewal that is often lost in our fast-paced, technology-driven lives. He advocates for educational initiatives that encourage individuals to appreciate the intricate relationships within ecosystems and the essential role we all play in maintaining ecological balance. Nurturing nature, according to Dr. Hammond, is a responsibility that binds us together as stewards of the Earth, ensuring a healthier planet for all living beings. Get your tickets now! Come for a free taping of Gulf Coast Life at Calusa Nature Center March 22 at 10 a.m. Gulf Coast Life Broadcast on WGCU at Calusa Nature Center & Planetarium! March 22, 2025 | 10:00 AM Gulf Coast Life to Feature Calusa Nature Center & Planetarium on March 22nd We’re excited to announce that Gulf Coast Life , airing on WGCU, will be featuring Calusa Nature Center & Planetarium on March 22nd at 10 a.m. ! Join us for this exciting segment as Gulf Coast Life highlights the beauty and educational experiences that Calusa has to offer. The segment will feature fascinating nature talks, interviews with special guests, and showcase the vibrant atmosphere of our 105-acre sanctuary. It’s a fantastic opportunity to learn more about the incredible work being done at Calusa while surrounded by the wonders of nature. Gulf Coast Life is a locally produced talk show that strives to connect listeners to the people, places, and things that make Southwest Florida unique. The show is produced and hosted by Mike Kiniry , with contributing hosts John Davis , Cary Barbor , and Tara Calligan . The event is free and open to the public on a first-come, first-served basis , so be sure to arrive early to enjoy this exciting experience. If you'd like to explore the museum and planetarium for the rest of the day, the prices are: $13 for adults $7 for children Free for members For more information on memberships and to learn more about our museum and planetarium, please visit www.calusanature.org . Wizarding World Adventure March 22, 2025 | 1:00 PM – 6:00 PM Wizards, witches, and muggles alike are invited to experience the magic at Calusa Nature Center & Planetarium . Enjoy a magic trail , create a potion in the potions lab , sip on a butterbeer , and participate in a costume contest . There will be spell demonstrations , magical crafts, and more! Stay tuned for official event details and ticket information! Get your tickets now! Paint and Sip: Ocean Breeze & Evening Storm – Bob Ross-Inspired Painting Workshops in Fort Myers Join us for two exciting Paint and Sip workshops in Fort Myers on Sunday, April 6th, 2025 ! These beginner-friendly, certified Bob Ross oil-painting sessions are led by Mathew Halstead C.R.I. from Lazy Painter Brushworks . Whether you're a beginner or experienced artist, these fun and creative workshops are the perfect opportunity to create a stunning masterpiece. Ocean Breeze Workshop (10:00 AM – 12:00 PM): Dive into the beauty of the \"Ocean Breeze\" painting and take home your own 12x16 masterpiece. Evening Storm Workshop (2:00 PM – 4:00 PM): Create a breathtaking \"Evening Storm\" painting in this second session of the day. Both workshops include all painting supplies, and participants should wear clothes that can get messy. It’s essential to arrive on time as catching up during the session can be challenging. Ticket Information: Price per session: $100.00 (+$2.50 service fee) Ticket Sales End: April 5th, 8:00 PM Don't miss out on this chance to unleash your inner artist and enjoy a relaxing, step-by-step painting experience. Reserve your spot today and get ready for a fun-filled day of creativity! Get your tickets now! Earth Day Birthday Celebration April 19, 2025 | 10:00 AM – 5:00 PM Celebrate Earth Day at CNCP with a full day of fun for all ages! Featuring guided hikes , live animal presentations , arts and crafts, and an array of local vendors , it’s the perfect family event to learn about environmental stewardship. Get your tickets now! Music Under the Stars May 1, 2025 | 7:00 PM Enjoy an evening of live music with Doug Sheminski opening for Andy Wahlberg at CNCP’s Music Under the Stars concert. It’s the perfect way to spend a night under the sky with great music and great company! Get your tickets now! Sponsorship Opportunities Available Sponsorship opportunities are available for all upcoming CNCP events! Your support helps us continue offering these educational programs and ensures that our preserve remains a place for future generations to explore and enjoy. As a sponsor, you’ll receive recognition at our events and visibility among an engaged, community-minded audience. For more information, contact Eric Raddatz at eraddatz@calusanature.org or call 239-275-3435 . Nurture Nature Campaign: Help Us Preserve Our Sanctuary We’re excited with the success of our \"Nurture Nature\" Campaign in 2025, dedicated to improving CNCP’s facilities and educational programs. Your support will help us maintain essential infrastructure, repair boardwalks , preserve local wildlife , and expand our outreach efforts. This campaign is especially important as we work to create a deeper connection between local youth and the natural world—something that’s more vital than ever in an age where technology often pulls us away from nature. Become a nature nurturer today! Host Your Event at CNCP Did you know CNCP offers a unique venue for events? Whether you’re planning a wedding, meeting, or party, our indoor and outdoor spaces offer a beautiful natural setting for any occasion. Contact us to learn more about holding your event at CNCP. Learn more about rentals and book today! Mesmerica: A Visual Music Journey Every Weekend Mesmerica is a one-of-a-kind visual music experience , blending stunning 3D art with the soothing sounds of James Hood . It’s the perfect way to relax and experience a world of hypnotic imagery and sound. Get your tickets now! Become a Member Today When you become a CNCP member , you enjoy a host of exclusive benefits, including: Free admission to trails, planetarium shows, and live animal talks Discounts on camps, workshops, and select events 10% off at the gift shop Free or discounted admission to over 180 nature centers nationwide Join today and connect with nature all year long About Calusa Nature Center & Planetarium: Founded in 1969 , the Calusa Nature Center & Planetarium has served as Southwest Florida's premier environmental education destination for over 50 years. CNCP is a 501(c)(3) tax-exempt organization , and donations are tax-deductible to the fullest extent of the law. Sponsorship and partnership opportunities are also available for those interested in making a significant impact together with us. The 105-acre sanctuary houses butterfly gardens, bird aviaries, nature trails, and the only public planetarium in the region. CNCP provides educational experiences that promote environmental awareness, scientific discovery, and a lifelong love of nature, inspiring future generations of environmental stewards and advocates. • A Special Thank You: We extend our heartfelt thanks to Ace Hardware, the place with the helpful hardware folks, as well as continuing supporters, including Vulcan Materials, R4 Roofing , Aux Delicies , Famous Dave’s , The City of Fort Myers , HERC, SWFL PRODUCE, Sanibel Captiva Community Bank , The Fred and Jean Allegretti Foundation , Heitman House , Babcock Ranch and the Fort Myers Film Festival. • Stay Connected Cozy at home? Experience the Calusa Nature Center virtually. Visit our YouTube channel for fun videos! ! Enjoy our FREE T360 tour from your couch: #HomeBoundAdventures #NatureAtHome . Immerse yourself in our fresh interactive education videos here. Make your event unforgettable with one of Florida's unique venues! From weddings and showers to meetings and parties, we offer stunning indoor and outdoor spaces. Reach out now to reserve your date! Media Contact: Calusa Nature Center & Planetarium For more information or to purchase tickets, visit www.calusanature.org or contact Eric Raddatz , Executive Director, at eraddatz@calusanature.org . Phone: (239) 275-3435 Website: calusanature.org #HolidayLights #SantaMeetAndGreet #HolidayLaserShows #SupportWildlife #NatureLovers #ExploreNature #CalusaNature #NurtureNature BECOME A NATURE NURTURER: DONATE HERE ATE HERE Recent Posts See All Fall Thrills, Chills & Family Fun Await at Calusa Nature Center & Planetarium! What's Up in SW FL Skies: September \"eclipse season\" and Equinox, Saturn still mostly edge-on, meteors... Fun All Year Long at Calusa Nature Center & Planetarium! Thank you to our Sponsors & Partners Open Hours: Tuesday - Sunday: 10am - 4pm ​ Pricing: Adults $13 Children $7 Members Free Up CALUSA NATURE CENTER AND PLANETARIUM IS REGISTERED WITH THE STATE OF FLORIDA. A COPY OF THE OFFICIAL REGISTRATION (CH661) AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES BY CALLING TOLL-FREE 1-800-435-7352 WITHIN THE STATE OR VISITING WWW.800HELPFLA.COM . REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL, OR RECOMMENDATION BY THE STATE. OUR CONFIDENTIALITY POLICY, CONFLICT OF INTEREST POLICY AND WHISTLEBLOWER POLICY ARE AVAILABLE UPON REQUEST. EIN #23-7090889 Contact Us © 2024 by CNCP ​ bottom of page"
    },
    {
      "url": "https://volunteer.unitedwaylee.org/agency/detail/?agency_id=128189",
      "text": "Calusa Nature Center & Planetarium | United Way of Lee, Hendry, and Glades Skip to main content Open side bar. Return to our Website Return to our Website Sign Up Login Help Calendar Open top navigation menu. Return to our Website Return to our Website Sign Up Login Help Calendar Home Dashboard Get Connected Icon Opportunities Get Connected Icon Events Get Connected Icon Agencies Get Connected Icon Groups / Corporate / Days of Caring Get Connected Icon Storm Recovery Efforts Get Connected Icon Volunteer Opportunities for Students Get Connected Icon VITA Tax Prep Get Connected Icon Post a Volunteer Opp Get Connected Icon DIY & Self Guided Projects Get Connected Icon Reading Opportunities Get Connected Icon Frequently Asked Questions (FAQs) Get Connected Icon Court Mandated Hours Collapse Menu Collapse Menu Home Dashboard Agencies Calusa Nature Center & Planetarium Calusa Nature Center & Planetarium Animals Arts & Culture Community Education Environment Family Health Mental Wellness Become a Fan Share Agency Who We Are Established in 1970, Calusa Nature Center & Planetarium has been a part of the Southwest Florida community for nearly 50 years! Our mission, inspiring people to connect with nature, is accomplished by educating both children and adults about our unique ecosystem and environmental issues concerning our area. We strive to provide a holistic environmental education program encompassing all areas from astronomy to ecology. Our 105-acre site is home to many rescue animals, butterfly and bird aviaries, two nature trails, SWFL's only planetarium theater, and much more! What We Do Volunteer Our volunteers are a huge part of what makes Calusa Nature Center & Planetarium a success. You can earn volunteer or service-learning hours in a number of areas such as: animal care, education, gardening, landscaping, maintenance, office work, planetarium/museum docent and more! Looking for FESTIVITY FUN?  Our Annual Haunted Walk and Holiday Light events are always looking for committee and event day volunteers too. Fill out an application via the Volunteer Application by clicking here If you have any questions, please email volunteer@calusanature.org Internships We offer a wide variety of professional internships at the high school, undergraduate, and graduate school levels. We work directly with each individual student to develop an internship plan to focus on the goals and responsibilities of the student to maximize the real-world experience provided. Internships we have available but are not limited to: Environmental Education Research Wildlife/Zoology Non-profit Management Marketing and Public Relations Physics/Astrophysics and Astronomy Event Planning and Fundraising Hospitality and Tourism For an internship application, or, if you do not see an internship opportunity on the list but have an idea and concept of what you would like to accomplish during your professional experience, please email admin@calusanature.org . Brought to you by United Way of Lee, Hendry, and Glades - Agency Site Details Get Connected Icon (239) 275-3435 Get Connected Icon volunteer@calusanature.org Get Connected Icon David Hayes Get Connected Icon General Manager https://www.calusanature.org/ Agency Opportunities Get Connected Icon Is Ongoing Holiday Volunteers Needed  Haunted Walk & Holiday Lights Calusa Nature Center & Planetarium View Details Share Opportunity Get Connected Icon Is Ongoing Animal/Wildlife Care, Education, Landscaping Calusa Nature Center & Planetarium View Details Share Opportunity See more opportunities Website: Get Connected Icon Facebook: Get Connected Icon LinkedIn: Get Connected Icon Get Connected Icon Previous Get Connected Icon Next Get Connected Icon Resume the photo slider Get Connected Icon Pause the photo slider Get Connected Icon 3450 Ortiz Ave Fort Myers\r\n                                                , FL 33905 Get Connected Icon Daily 10am-4pm Facebook Facebook X/Twitter X/Twitter YouTube Youtube LinkedIn LinkedIn Instagram Instagram Privacy Policy Contact Us × Our websites uses cookies This site uses cookies to improve your experience and analyze site traffic. We do not use cookies for advertising or marketing purposes. Read more about how we use cookies in Privacy Policy . By clicking accept, you consent to our use of cookies. Show Cookie Preferences Necessary (Always active) Analytics Analytical cookies are used to understand how users interact with the website. They help provide information on metrics like number of visitors, bounce rate, traffic source, etc. Accept"
    },
    {
      "url": "https://www.calusanature.org/post/renowned-cartoonist-doug-macgregor-to-headline-calusa-nature-center-s-first-ever-arts-crafts-fair",
      "text": "Renowned Cartoonist Doug MacGregor to Headline Calusa Nature Center’s First-Ever Arts & Crafts Fair top of page Donate Nurture Nature Memberships Sponsorships Member Log In Virtual Tour Home About Us Planetarium Planetarium Schedule Sounds of the Ocean YOUniverse Nature Center Education Events & Registration Haunted Walk Holiday Lights Event Rentals Get Involved Volunteer Application Internships Careers Wish List News More Use tab to navigate through the menu items. All Posts Planetarium Search Renowned Cartoonist Doug MacGregor to Headline Calusa Nature Center’s First-Ever Arts & Crafts Fair eraddatz7 Apr 10 6 min read FORT MYERS, FL (April 10, 2025) — The Calusa Nature Center & Planetarium is proud to announce that one of Southwest Florida’s most beloved artists and storytellers, Doug MacGregor , will be the featured headliner at the Center’s Arts & Crafts Fair on May 10, 2025 , from 10:00 AM to 4:00 PM . With a career spanning over four decades, Doug MacGregor is a celebrated cartoonist, children’s book author, illustrator, musician, and advocate for arts in healthcare. His whimsical, imaginative art has brought smiles to generations of readers and viewers alike. Known for his long tenure as editorial cartoonist for The News-Press , MacGregor has also made a profound impact in hospitals, schools, and libraries across the region. At the Arts & Crafts Fair, Doug will lead special art sessions and demonstrations, showcasing the joyful power of creativity to connect us with both nature and each other. His original artwork and books will be available for purchase, and he will generously contribute an exclusive piece to the Calusa Nature Center’s permanent collection. “Doug’s creativity, compassion, and deep connection to the Southwest Florida community make him the perfect artist to headline this new celebration of nature and expression,” said Eric Raddatz , Executive Director of the Calusa Nature Center. “We are beyond honored to host him for what will be an unforgettable day.” Also joining the festivities is acclaimed local painter Whitney Hackett , known for her dreamlike, nostalgia-infused works that celebrate everyday life through a playful and heartfelt lens. Hackett is the creative force behind Quartz and Clover and Curio , two artistic staples in downtown Fort Myers. The Arts & Crafts Fair will take place on the scenic grounds of the Calusa Nature Center—a 105-acre preserve home to nature trails, butterfly gardens, animal exhibits, and the region’s only public planetarium. The event will feature local artists and artisans whose work celebrates themes of nature, wildlife, and the cosmos , with offerings including handmade jewelry, sculpture, textiles, pottery, and more. Artist Vendor Information: Date: Saturday, May 10, 2025 Time: 10:00 AM – 4:00 PM Location: Calusa Nature Center & Planetarium, 3450 Ortiz Ave, Fort Myers, FL Vendor Fee: $50 (Featured artists are exempt) Apply: Email volunteer@calusanature.org with samples and a short artist bio Indoor and outdoor spaces available Featured artist spots and vendor spaces are limited. Interested artists are encouraged to apply early to be part of this one-of-a-kind opportunity to showcase their work in a vibrant, nature-filled setting. For tickets or to learn more about the Arts & Crafts Fair or to become a sponsor, vendor, or volunteer, please visit www.calusanature.org or reach out to: Media Contact: Eric Raddatz, Executive Director📧 eraddatz@calusanature.org📞 (239) 275-3435 Event Coordinator: Laina Kessler📧 lkessler@calusanature.org About Doug MacGregor: Doug MacGregor is a professional cartoonist, musician, author, and former Arts in Healthcare Coordinator for Lee Health. He has published six children’s books, volunteers at Golisano Children’s Hospital, and performs with his 60s/70s rock band, The Rosada Project . His editorial cartoons are archived at Syracuse University, Ohio State, and Florida Gulf Coast University. 🌎 Earth Day Birthday Celebration at CNCP April 19, 2025 | 10:00 AM – 5:00 PMLocation: Calusa Nature Center & Planetarium | 3450 Ortiz Ave, Fort Myers, FL 33905 Celebrate Earth Day with us in Southwest Florida’s largest green space! Enjoy a full day of hands-on activities including guided hikes, live animal talks, eco-crafts, solar viewing, and more. Explore our beautiful 105-acre sanctuary and learn how to make a difference for the planet. 🎟 Tickets: Adults: $13 Children (3–12): $7 Members: Free – Become a member 🎶 Special guest Dhruva’ , from the Americana Community Music Association, returns with nature songs for kids! 🛰 Plus: Live music, four planetarium shows, and over 10+ community partners including:Girl Scouts of Gulfcoast Florida, Florida Trail Association – Alligator Amblers, Cape Coral Friends of Wildlife, Lee County Solid Waste, Southwest Florida Astronomical Society, Audubon of SWFL, FWC staff, The Water School at FGCU, Calusa Waterkeeper, and ECHO. 👉 Get your Earth Day tickets now! calusanature.org “Earth Day is a chance to reconnect with nature, learn something new, and have fun as a community. We’re proud to offer a day full of meaningful experiences for all ages.” – Eric Raddatz, Executive Director 🌀 Also Coming Up at CNCP 🎥 Mesmerica: A Visual Music Journey Experience this 3D immersive planetarium show featuring music by James Hood.🗓 Every weekend | 🎟 Get your tickets now! 🌿 Nurture Nature Campaign Help preserve our sanctuary, improve facilities, and expand outreach.💚 Support the campaign calusanature.org 🎉 Host Your Next Event with Us Weddings, meetings, birthdays, and more — indoors or in nature!📅 Book your venue calusanature.org 🌟 Become a Member Free admission, discounts, and reciprocal access to 180+ nature centers nationwide.🐢 Join today calusanature.org 📣 Sponsor a CNCP Event Gain community exposure and support local environmental education.📧 Contact: eraddatz@calusanature.org | 📞 (239) 275-3435 Sponsorship Opportunities Available Sponsorship opportunities are available for all upcoming CNCP events! Your support helps us continue offering these educational programs and ensures that our preserve remains a place for future generations to explore and enjoy. As a sponsor, you’ll receive recognition at our events and visibility among an engaged, community-minded audience. For more information, contact Eric Raddatz at eraddatz@calusanature.org or call 239-275-3435 . Nurture Nature Campaign: Help Us Preserve Our Sanctuary We’re excited with the success of our \"Nurture Nature\" Campaign in 2025, dedicated to improving CNCP’s facilities and educational programs. Your support will help us maintain essential infrastructure, repair boardwalks , preserve local wildlife , and expand our outreach efforts. This campaign is especially important as we work to create a deeper connection between local youth and the natural world—something that’s more vital than ever in an age where technology often pulls us away from nature. Become a nature nurturer today! Host Your Event at CNCP Did you know CNCP offers a unique venue for events? Whether you’re planning a wedding, meeting, or party, our indoor and outdoor spaces offer a beautiful natural setting for any occasion. Contact us to learn more about holding your event at CNCP. Learn more about rentals and book today! Become a Member Today When you become a CNCP member , you enjoy a host of exclusive benefits, including: Free admission to trails, planetarium shows, and live animal talks Discounts on camps, workshops, and select events 10% off at the gift shop Free or discounted admission to over 180 nature centers nationwide Join today and connect with nature all year long About Calusa Nature Center & Planetarium: Founded in 1969 , the Calusa Nature Center & Planetarium has served as Southwest Florida's premier environmental education destination for over 50 years. CNCP is a 501(c)(3) tax-exempt organization , and donations are tax-deductible to the fullest extent of the law. Sponsorship and partnership opportunities are also available for those interested in making a significant impact together with us. The 105-acre sanctuary houses butterfly gardens, bird aviaries, nature trails, and the only public planetarium in the region. CNCP provides educational experiences that promote environmental awareness, scientific discovery, and a lifelong love of nature, inspiring future generations of environmental stewards and advocates. • A Special Thank You: We extend our heartfelt thanks to Ace Hardware, the place with the helpful hardware folks, as well as continuing supporters, including Vulcan Materials, R4 Roofing , Aux Delicies , Famous Dave’s , The City of Fort Myers , HERC, SWFL PRODUCE, Sanibel Captiva Community Bank , The Fred and Jean Allegretti Foundation , Heitman House , Babcock Ranch and the Fort Myers Film Festival. • Stay Connected Cozy at home? Experience the Calusa Nature Center virtually. Visit our YouTube channel for fun videos! ! Enjoy our FREE T360 tour from your couch: #HomeBoundAdventures #NatureAtHome . Immerse yourself in our fresh interactive education videos here. Make your event unforgettable with one of Florida's unique venues! From weddings and showers to meetings and parties, we offer stunning indoor and outdoor spaces. Reach out now to reserve your date! BECOME A NATURE NURTURER: DONATE HERE Summer Camp Camp registration will remain open until camps fill or until the Friday before the camp week begins. Don’t miss out – sign up early to secure a spot for your child! For more information or to register, please visit https://www.calusanature.org/calusa-summer-camps and buy your tickets now ! Make this summer one to remember with unforgettable experiences, lifelong friendships, and the wonders of nature! Recent Posts See All Fall Thrills, Chills & Family Fun Await at Calusa Nature Center & Planetarium! What's Up in SW FL Skies: September \"eclipse season\" and Equinox, Saturn still mostly edge-on, meteors... Fun All Year Long at Calusa Nature Center & Planetarium! Thank you to our Sponsors & Partners Open Hours: Tuesday - Sunday: 10am - 4pm ​ Pricing: Adults $13 Children $7 Members Free Up CALUSA NATURE CENTER AND PLANETARIUM IS REGISTERED WITH THE STATE OF FLORIDA. A COPY OF THE OFFICIAL REGISTRATION (CH661) AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES BY CALLING TOLL-FREE 1-800-435-7352 WITHIN THE STATE OR VISITING WWW.800HELPFLA.COM . REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL, OR RECOMMENDATION BY THE STATE. OUR CONFIDENTIALITY POLICY, CONFLICT OF INTEREST POLICY AND WHISTLEBLOWER POLICY ARE AVAILABLE UPON REQUEST. EIN #23-7090889 Contact Us © 2024 by CNCP ​ bottom of page"
    },
    {
      "url": "https://www.calusanature.org/education",
      "text": "Education | Calusa Nature Center and Planetarium top of page Donate Nurture Nature Memberships Sponsorships Member Log In Virtual Tour Home About Us Planetarium Planetarium Schedule Sounds of the Ocean YOUniverse Nature Center Education Events & Registration Haunted Walk Holiday Lights Event Rentals Get Involved Volunteer Application Internships Careers Wish List News More Use tab to navigate through the menu items. Education Education Education Education Connecting with Nature through Education! There are so many things to learn and explore at the Calusa Nature Center and Planetarium! You will find all you need to know about our amazing youth and adult education programs here. Find the program that suits your needs and get learning! Homeschool More Nature Explorers More Preschool More Explore the Shore More Nature Speaker More Night Hikes More Field Trips More Planetarium Shows More Homeschool Homeschool at Calusa! (PRE-REGISTRATION REQUIRED) *NEW!* Class for ages 13-16 coming soon. ​ ALL classes will re-start in OCTOBER, mark your calendars! ​ Join us for our Homeschool-ology classes! Each month will focus on a different “ology” study topic like Zoology, Entomology, Ornithology, and more! Classes will be held rain or shine so please prepare appropriately. Our current class format is a drop-off program. Parents and siblings not registered for the class are not allowed to stay for the entirety of the class. There will be time at the beginning and end of each class for you to see the activity stations, interact with your child, and ask any question and gather take home materials. Each class will contain classroom instruction time and may include activities such as crafts, outdoor exploration, a live animal encounter, and short hikes. Students should bring a labeled refillable water bottle and preferred bug spray & sunscreen. ​ Homeschool Schedule for FALL 2025! ​ Homeschool classes will usually be held the 1st & 2nd Thursdays of each month. NEW for Fall-a class for Ages 13-16! October 2nd: Ages 5-8 from 10am-12pm and Ages 9-12 from 1-3pm October 23rd: Ages 13-16 from 1-3pm Zoology-Animal Communication Say What?- Animals communicate for many reasons like to defend territory, find a mate, care for young, and alert others to danger. Through a series of exploration stations, games, and activities students will explore the different methods animals use to communicate. This class will include activities, games, & a live animal presentation. November 6th: Ages 5-8 from 10am-12pm and Ages 9-12 from 1-3pm November 13th: Ages 13-16 from 1-3pm Dendrology-Trees! Tree Anatomy & Physiology Do trees ever stop growing? Do all trees lose their leaves in cooler weather? How many tree species are there in FL? Through a series of activities students will learn about the parts of a tree and their functions, how a tree grows, and the different types of trees we have. We will take a Tree Id hike on our Pine Loop trail to learn how to identify the most common trees of SWFL. December 4th: Ages 5-8 from 10am-12pm and Ages 9-12 from 1-3pm December 11th: Ages 13-16 from 1-3pm Ecology-Food Chains & Webs Food Chains & Webs: Through a variety of games and activities students will learn about our local food chains and how we as humans fit into and affect them. Students will even help feed some of the animals at the Nature Center while learning all about food chains and webs  our animals are a part of. Sessions may fill up before we have a chance to note they are full on our website! If you are unable to view or book a session on the ticket purchase page, then please contact our Education Coordinator, Carrie by emailing her here to be put on a waitlist. ​ ​ The cost is $20 per non-member child or $15 for members. Homeschool Thursday ticket prices do not include general CNCP admission, which can be purchased separately but is not required for this program. General CNCP admission is required for access to CNCP after the end of the program time. If you are planning to stay on site while your child/children attend class purchasing a membership will offer you the best price and savings. Proof of membership is required for the discount, please bring your membership card. Ages 5-8 from 10 am - 12 pm (Drop off from 9:50am-10:00am and pick up from 12:00 - 12:10pm) Ages 9-12 from 1 pm - 3 pm (Drop off from 12:50-1:00pm and pick up from 3:00 - 3:10pm) Ages 13-16 from 1 pm - 3 pm (Drop off from 12:50-1:00pm and pick up from 3:00 - 3:10pm) Membership Offer Thu, Oct 02 Homeschool: Zoology-Animal Communication / Fort Myers Buy Tickets Oct 02, 2025, 10:00 AM – 3:00 PM Fort Myers, 3450 Ortiz Ave, Fort Myers, FL 33905, USA Say What?- Animals communicate for many reasons like to defend territory, find a mate, care for young, and alert others to danger. +17 more Membership Offer Thu, Oct 23 Homeschool: Zoology-Animal Communication / Fort Myers Buy Tickets Oct 23, 2025, 1:00 PM – 3:00 PM Fort Myers, 3450 Ortiz Ave, Fort Myers, FL 33905, USA Say What?- Animals communicate for many reasons like to defend territory, find a mate, care for young, and alert others to danger. See All Membership Offer Thu, Nov 06 Homeschool: Dendrology-Trees! / Fort Myers Buy Tickets Nov 06, 2025, 10:00 AM – 3:00 PM Fort Myers, 3450 Ortiz Ave, Fort Myers, FL 33905, USA Do trees ever stop growing? Do all trees lose their leaves in cooler weather? How many tree species are there in FL? +3 more Membership Offer Thu, Nov 13 Homeschool: Dendrology-Trees! / Fort Myers Buy Tickets Nov 13, 2025, 1:00 PM – 3:00 PM Fort Myers, 3450 Ortiz Ave, Fort Myers, FL 33905, USA Do trees ever stop growing? Do all trees lose their leaves in cooler weather? How many tree species are there in FL? Membership Offer Thu, Dec 04 Homeschool: Ecology-Food Chains & Webs / Fort Myers Buy Tickets Dec 04, 2025, 10:00 AM – 3:00 PM Fort Myers, 3450 Ortiz Ave, Fort Myers, FL 33905, USA Through a variety of games and activities students will learn about our local food chains and how we as humans fit into and affect them. +3 more Membership Offer Thu, Dec 11 Homeschool: Ecology-Food Chains & Webs / Fort Myers Buy Tickets Dec 11, 2025, 1:00 PM – 3:00 PM Fort Myers, 3450 Ortiz Ave, Fort Myers, FL 33905, USA Through a variety of games and activities students will learn about our local food chains and how we as humans fit into and affect them. See All Natue Explorers Nature Explorers Nature Explorers is limited to 15 children per day, please be aware that this program may sell out! This is a Drop-Off program. Ages 5-11, $10 / child Our programs are designed to take place almost entirely outside, where children will have lots of fresh air and space to spread out! Preschool Wednesdays Calusa Nature Center & Planetarium-Preschool Programs for Fall 2025 ​ Back by popular demand! Join us on the first Wednesday of every month from 10-11am for our Preschool Program! Designed to capture a preschooler's sense of curiosity and cultivate a connection to the natural world, each program will include a story, craft, & either a short hike or live animal encounter. ​ Ages 3-5 • CNCP Members $9 | Non-Members $12 The price is per child and includes one adult per child. It does not include museum admission. Sessions may fill up before we have a chance to note they are full on our website! If you are unable to view or book a session on the ticket purchase page, then please contact our Education Coordinator, Carrie, by emailing here to be put on a waitlist. ​ This program is for children ages 3-5 and includes one adult per child. Cost for this program is $12 for non-members, $9 for members and does not include museum admission. Visit our website www.calusanature.org for more information. This is NOT a drop-off program and all children must have an adult with them. For classroom space only ONE adult per child is allowed. October 1st: Say What? Can animals talk to each other? What do bird chirps & songs mean? How does a lizard tell you they are happy, sad, or angry?  Learn all about the different ways animals use to communicate to us & each other. This program will include a story, activity stations & a live animal encounter. November 5th: Terrific Trees! Where do trees live? How do trees grow? Why are trees different from other plants? Come learn all about the lives and types of trees we have at the Nature Center. This program will include a story, exploration stations, & a short tree hike on our trail. December 3rd: Chomp & Crunch! What Do Animal Eat? What does a baby alligator eat? How does a frog catch a fly? Does a panther stalk it’s prey? Come learn all about what animals eat, how they hunt, & what a food chain is. This program will include a story, exploration stations, a craft, & a live animal encounter. ​ Membership Offer Wed, Oct 01 Preschool: Say What? / Fort Myers Buy Tickets Oct 01, 2025, 10:00 AM – 11:00 AM Fort Myers, 3450 Ortiz Ave, Fort Myers, FL 33905, USA Can animals talk to each other? What do bird chirps & songs mean? How does a lizard tell you they are happy, sad, or angry? Membership Offer Wed, Nov 05 Preschool: Terrific Trees! / Fort Myers Buy Tickets Nov 05, 2025, 10:00 AM – 11:00 AM Fort Myers, 3450 Ortiz Ave, Fort Myers, FL 33905, USA Where do trees live? How do trees grow? Why are trees different from other plants? Come learn all about the lives and types of trees we have at the Nature Center. Membership Offer Wed, Dec 03 Preschool: Chomp & Crunch! / Fort Myers Buy Tickets Dec 03, 2025, 10:00 AM – 11:00 AM Fort Myers, 3450 Ortiz Ave, Fort Myers, FL 33905, USA What does a baby alligator eat? How does a frog catch a fly? Does a panther stalk it’s prey? Preschool NIGH T HIKES Admission: $20 Ages: Recommended 6+ Watch the sky for bats, listen for owls, and search the night sky for constellations. This walk starts just after sunset so please wear close-toed shoes and be prepared for rain and mosquitoes. These night hikes are an awesome educational experience with minimal flashlight use, while wonderful for most ages, it may not be appropriate for very young children. Night Hikes No events at the moment Nature Speaker Series Calusa Nature Center and Planetarium invite you to attend our Nature Speaker Series. Join us on the second Wednesday of each month (Oct-April) at 7:00 pm in the Planetarium. Members: Free | Non-Members: $15 ​ This monthly series will feature experts from many different wildlife, conservation, and environmental fields. Each speaker is unique and will bring fascinating stories of their work and passion to our guests. Nature Speaker Field Trips Field Trips Bring your school classes, homeschool groups, scout troops, or other groups of any age out to Calusa Nature Center and Planetarium for a field trip! ​ Choose from a variety of offerings for your field trips! There's something here for every group, from guided nature walks to private planetarium shows. Mix and match our 45-minute programs to give your group a visit that meets your educational goals and interests! ​ SEPTEMBER-MAY PROGRAM OFFERINGS: Field trips start at $10 per child and $15 per adult and include up to three programs. Additional programs can be added for $3 per person per program. Guided Nature Walk - Explore our trails with a guided walk tailored to grade-level topics and interests. Live Animal Talk - Meet some of our animals up close and personal and learn about their adaptations and habitats. Butterfly House and Birds of Prey Aviary Tour - Explore our butterfly house and learn about our bald eagles. Planetarium Movie - Experience a full-dome planetarium movie selected for your group's age and interests. Planetarium Q&A Session - Meet one of our planetarium educators for a tour of the night sky as they answer your questions about the stars, planets & beyond. Museum Exploration and Gift Shop - Discover our natural history museum and visit our gift shop in this self-guided exploration time. JUNE-AUGUST PROGRAM OFFERINGS: Field trips start at $10 per child and $15 per adult and include up to three programs. Additional programs can be added for $3 per person per program. Live Animal Talk - Meet some of our animals up close and personal and learn about their adaptations and habitats. Birds of Prey Aviary Tour & Museum Exploration - Tour our Bird Aviary to learn about our injured and rescued birds and explore our exhibits and live animals in our natural history museum. Planetarium Movie - Experience a full-dome planetarium movie selected for your group's age and interests. Planetarium Q&A Session - Meet one of our planetarium educators for a tour of the night sky as they answer your questions about the stars, planets & beyond. Field trips are available Tuesday-Friday during normal operating hours (normally starting at 10:00 am and ending at 1:00pm) and must be booked at least 2 weeks in advance. We require a $100 non-refundable deposit to hold your place, please be prepared to pay your deposit within 7 business days of your request. Maximum group size: 80 participants (or 3 classes) per day. Larger groups will need to be split over multiple days. For Scout troops, we now offer special badge programs to help complete requirements to earn your badges! Scout programs run for approximately 3 hours, start at $15 per person, and can be customized based on the ages and interests of your troop. Please indicate which scouting organization your troop is part of when you submit your request form. ​ If you have any other questions feel free to contact our Education Department by email here. Submit Request Meet Some of our Resident Animals! Prince the African Sulcata Tortoise Learn Moe the Salamander Learn Hector the Corn Snake Learn Sal - Argentine Tegu Learn Biggie and Smalls the American Alligators Learn Lucy the Eastern Box Turtle Learn Thank you to our Sponsors & Partners Open Hours: Tuesday - Sunday: 10am - 4pm ​ Pricing: Adults $13 Children $7 Members Free Up CALUSA NATURE CENTER AND PLANETARIUM IS REGISTERED WITH THE STATE OF FLORIDA. A COPY OF THE OFFICIAL REGISTRATION (CH661) AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES BY CALLING TOLL-FREE 1-800-435-7352 WITHIN THE STATE OR VISITING WWW.800HELPFLA.COM . REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL, OR RECOMMENDATION BY THE STATE. OUR CONFIDENTIALITY POLICY, CONFLICT OF INTEREST POLICY AND WHISTLEBLOWER POLICY ARE AVAILABLE UPON REQUEST. EIN #23-7090889 Contact Us © 2024 by CNCP ​ bottom of page"
    },
    {
      "url": "https://www.calusanature.org/post/celebrate-a-bright-2025-join-us-in-the-joy-of-protecting-nature-and-enjoy-our-holiday-lights-one-mo",
      "text": "Celebrate a Bright 2025: Join Us in the Joy of Protecting Nature and Enjoy Our Holiday Lights One More Weekend! top of page Donate Nurture Nature Memberships Sponsorships Member Log In Virtual Tour Home About Us Planetarium Planetarium Schedule Sounds of the Ocean YOUniverse Nature Center Education Events & Registration Haunted Walk Holiday Lights Event Rentals Get Involved Volunteer Application Internships Careers Wish List News More Use tab to navigate through the menu items. All Posts Planetarium Search Celebrate a Bright 2025: Join Us in the Joy of Protecting Nature and Enjoy Our Holiday Lights One More Weekend! eraddatz7 Dec 27, 2024 5 min read Calusa Nature Center and Planetarium: Celebrating Milestones and Building a Sustainable Future for 2025 Fort Myers, FL – December 27, 2024 – As the year draws to a close, the Calusa Nature Center & Planetarium reflects on an impactful 2024 and looks ahead to exciting opportunities in 2025. This year has been a testament to the power of community support, environmental education, and innovative programming. With your help, we aim to continue nurturing nature and inspiring the next generation of environmental stewards. See what it is like to tour the 105 acres of unspoiled Calusa Nature Center & Planetarium with this cool video. Year-End Appeal: Nurture Nature Together Long-time SWFL leader and CNCP Executive Director Eric Raddatz emphasizes the importance of year-end giving to sustain the center’s vital mission: \"The mission is tied to my personal mission—to nurture nature, to preserve our surrounding and all that nature offers, including our unspoiled Florida, its wildlife, birds, and future generations,\" said Eric Raddatz. Your donation ensures we can offer hands-on learning, preserve local wildlife, and expand community outreach. Contributions help support the planetarium, the only one within a 90-mile radius, offering unique educational experiences. Donate Now : calusanature.org/donate Get your membership to the Calusa Nature Center & Planetarium Membership and Admission Rate Updates In response to rising operational costs, the center will adjust membership and daily admission rates starting January 15, 2025. New Membership Rates: Student Membership: $20/year Individual Membership: $50/year Family & Friends Membership: $90/year Grandparent & Extended Family Membership: $105/year New Admission Rates: Children: $7 Adults: $13 Lock in current membership rates by purchasing or renewing before January 15, 2025. Members enjoy year-round access to exhibits, planetarium shows, and discounts. Learn more at www.calusanature.org/plans-pricing Holiday LIghts continues for one more weekend! Don't miss the campfire and cocoa at the end of the trail! Holiday Lights 2024: A Festive Success The VIP Opening Night Gala started this year’s Holiday Lights event in style. The weeks following have seen our community enjoy exclusive access to the illuminated trail, a meet-and-greet with Santa, and festive treats. Holiday Lights continues one more weekend, this Friday, Saturday, and Sunday from 6 to 9 PM. Tickets: Adults (12 & up): $10 Children (3-11): $5 Members: Free (Membership ID required) Proceeds benefit wildlife conservation, educational programs, and environmental preservation. Purchase tickets at calusanature.org . Fischer Family Foundation: Supporting Summer Camp Scholarships The Fischer Family Foundation awarded $6,000 to Calusa Nature Center and Planetarium to provide scholarships for nature-based summer camps. These scholarships empower children from disadvantaged backgrounds to explore the outdoors and develop a lifelong appreciation for the environment. “The organizations we support embody resilience, community, and transformation,” said Scott Fischer, founder of the Fischer Family Foundation. For more information, visit SFE-US.com/Fischer-Family-Foundation . 17th Annual BUG Chase 5K Run Mark your calendar for the Fort Myers Metro-McGregor Kiwanis BUG Chase 5K Run on January 25, 2025, hosted at Calusa Nature Center and Planetarium. This event supports the \"Bring Up Grades\" (BUG) program, encouraging academic improvement in local elementary students. Event Details: Location: 3450 Ortiz Avenue, Fort Myers, FL Time: 8:30 AM (Race day registration begins at 7:30 AM) Registration: $25 (pre-registration by December 6), $30 (December 7-January 24), $35 (race day); Youth discounts available. Proceeds benefit the BUG program and other youth initiatives. Register at MetroMcGregorKiwanis.com . Sponsorships start at $100. Contact Rachel Toomey at Rachel.Toomey33@gmail.com for details. Planetarium Director Heather Preston is honored by Executive Director Eric Raddatz as she moves to emeritus status, handing the reins over to Planetarium Manager Todd Sherman. Planetarium Leadership: Honoring Heather Preston The Planetarium at the Calusa Nature Center has created a new star. After a decade of extraordinary service, long-time Planetarium Director Heather Preston has transitioned to the role of Planetarium Director Emeritus. Under her guidance, the planetarium became a beacon of education and inspiration, delighting countless visitors with the wonders of the cosmos. Heather's dedication and vision elevated the planetarium’s programming and outreach, ensuring its place as a cherished community resource. As Heather steps back to a part-time role, Todd Sherman will assume the position of Planetarium Manager. Todd, who began his journey at the Nature Center by leading planetarium operations during Heather’s sabbatical in the Pacific Northwest, brings a wealth of knowledge and enthusiasm to this new chapter. Heather’s legacy will continue to shine as she supports Todd and the planetarium team. Mesmerica Visitors can enjoy the newly refurbished planetarium, the only one within a 90-mile radius, playing shows every day and select nights, including the visually immersive and hypnotic Mesmerica . This special show combines the mesmerizing music of Grammy-nominated composer James Hood with stunning 3D animated art from artists around the world. Designed to transcend time and engage your senses, Mesmerica is an unforgettable journey of sound and light. “I want Mesmerica to inspire you into taking a journey with me inside the mind, to engage your senses and feelings with a miraculous alchemy of sound and light!” said James Hood, show creator. What the Visitors are Saying Recent visitors have shared their excitement about the transformation of the Calusa Nature Center and Planetarium. One patron exclaimed, 'This place must be under new ownership!' while another added, 'This place seems way cooler than I remember!' These reviews highlight the center's refreshed atmosphere, with many noting a renewed positive energy and engaging programming benefitting our community. About Calusa Nature Center & Planetarium Founded in 1969, Calusa Nature Center & Planetarium has been a leading environmental education destination in Southwest Florida. Our 105-acre sanctuary features butterfly gardens, bird aviaries, nature trails, and the only public planetarium in the region. We are dedicated to fostering a love of nature and environmental stewardship through engaging exhibits, educational programs, and community outreach. Become part of our mission to nurture nature and inspire future generations. Together, we can ensure that Calusa Nature Center & Planetarium remains a place of discovery, connection, and wonder for years to come. • A Special Thank You: We extend our heartfelt thanks to our new sponsor Ace Hardware, the place with the helpful hardware folks, as well as continuing supporters, including Vulcan Materials, R4 Roofing , Aux Delicies , Famous Dave’s , The City of Fort Myers , HERC, Sanibel Captiva Community Bank , The Fred and Jean Allegretti Foundation , Heitman House , and the Fort Myers Film Festival. • Stay Connected Cozy at home? Experience the Calusa Nature Center virtually! Enjoy our FREE T360 tour from your couch: #HomeBoundAdventures #NatureAtHome . Immerse yourself in our fresh interactive education videos here. Make your event unforgettable with one of Florida's unique venues! From weddings and showers to meetings and parties, we offer stunning indoor and outdoor spaces. Reach out now to reserve your date! Media Contact: Eric Raddatz, Executive Director Calusa Nature Center & Planetarium Email: eraddatz@calusanature.org Phone: (239) 275-3435 \"Together, we can strengthen our commitment to nature and create lasting connections to the natural world,\" concludes Raddatz. \"Thank you for helping us nurture nature and stay tuned for a major celebration planned for Earth Day 2025.\" DONATE Come see Rob and get our new nature nurturer t-shirts for gifts or to let the world know where you stand! Recent Posts See All Fall Thrills, Chills & Family Fun Await at Calusa Nature Center & Planetarium! What's Up in SW FL Skies: September \"eclipse season\" and Equinox, Saturn still mostly edge-on, meteors... Fun All Year Long at Calusa Nature Center & Planetarium! Thank you to our Sponsors & Partners Open Hours: Tuesday - Sunday: 10am - 4pm ​ Pricing: Adults $13 Children $7 Members Free Up CALUSA NATURE CENTER AND PLANETARIUM IS REGISTERED WITH THE STATE OF FLORIDA. A COPY OF THE OFFICIAL REGISTRATION (CH661) AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES BY CALLING TOLL-FREE 1-800-435-7352 WITHIN THE STATE OR VISITING WWW.800HELPFLA.COM . REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL, OR RECOMMENDATION BY THE STATE. OUR CONFIDENTIALITY POLICY, CONFLICT OF INTEREST POLICY AND WHISTLEBLOWER POLICY ARE AVAILABLE UPON REQUEST. EIN #23-7090889 Contact Us © 2024 by CNCP ​ bottom of page"
    },
    {
      "url": "https://www.news-press.com/story/news/local/2024/09/05/calusa-nature-center-taylor-swift-mesmerica-360-laser-light-shows-fort-myers-florida-tickets/74951140007/",
      "text": "Calusa Nature Center: Renovated planetarium showing Taylor Swift, more News Cape Coral Sports Opinion Restaurants Advertise Obituaries eNewspaper Legals LOCAL Southwest Florida's only planetarium gets upgrade, plans Taylor Swift laser shows, more Charles Runnells Fort Myers News-Press Southwest Florida's only planetarium was long overdue for an overhaul. The roof, the seats, the floor — they'd all been there since the planetarium opened way back in 1986, says Heather Preston, planetarium director at the Calusa Nature Center & Planetarium . And it showed. The roof leaked. The chairs were uncomfortable. And everything just looked … old. Not anymore, though. The Fort Myers planetarium just finished a major upgrade that includes new floors and carpeting, a new roof and comfy seats that now — for the first time — recline and have head support. \"The new planetarium is going to be great,\" says Calusa Nature Center's executive director, Eric Raddatz. \"It's going to feel like 2024 in there, and not 1985.\" The upgrade goes hand-in-hand with the last major change at the planetarium in 2020 : A 5.1 surround-sound system and high-end, Digitarium Lambda Plus laser-projection system. The planetarium reopened Wednesday after being closed about a month for renovations. A grand reopening takes place Friday, Sept. 27, including a free open house and limited screenings of planetarium shows. There will also be a VIP reception and movie screening that night. Tickets for the VIP event are $150. Raddatz says he can't wait for people to see the new place — the only public planetarium anywhere near Southwest Florida. \"From Bradenton to Miami,\" he says, \"we're the only planetarium in a 180-mile radius.\" More renovations needed at Calusa Nature Center & Planetarium The planetarium upgrade is costing \"at least a couple hundred thousands\" dollars, Raddatz says. They're in the middle of a capital campaign to raise about $100,000 for the roof, alone, he says, and they're about halfway toward that goal. \"We're still working on it,\" he says. They're also trying to raise money for other, much-needed renovations at the 51-year-old Calusa Nature Center. That work includes: Repairs and new lights for the parking lot, A new roof for the nature center, A new sign out front, And repairs for the center's air-conditioning system. Then there's the center's boardwalk, which has been closed since being damaged by Hurricanes Irma and Ian. \"That's probably going to be a million, just to fix that,\" Raddatz says. Together, all these repairs, he says, will end up costing \"millions of dollars.\" That's why they're looking for partnerships and sponsorships to pay for everything, including $10 million for the renaming of the center and $1 million for the renaming of the planetarium. \"There's a lot we can do,\" Raddatz says. \"We have a lot of projects.\" Mesmerica 360, Taylor Swift and more expected to be big draw at new planetarium Until then, Raddatz and Preston hope the renovated planetarium attracts more people to Calusa Nature Center to see its various shows and attractions. That includes real-time and prerecorded views of the night sky projected onto the planetarium dome, all-new laser-light shows starting in November (including Taylor Swift and Pink Floyd) and the popular, psychedelic \"Mesmerica 360\" series. That last series combines music with dream-like, 360-degree visuals that put people in a calm, peaceful mood, Preston says. \"It's like a guided meditation,\" Preston says. \"This is intended to be a healing experience.\" The \"Mesmerica\" shows have been a big hit at the planetarium, Raddatz says.  \"We sell out every weekend.\" On top of that, the planetarium plans to bring more concerts and theatrical plays to its upgraded planetarium stage, starting with the \"Music Under the Stars\" concert Oct. 17. That show features local singer-songwriters Brian Smalley, Bill Metts, and Roy Schneider from the Americana Community Music Association . With all the new upgrades at the planetarium, people will be able to watch those shows with better visibility and more leg room in the approximately 80 seats (down from about 87). \"It should be a  good experience,\" Preston says. To learn more about the planetarium and get tickets to upcoming shows, visit calusanature.org . For updates on the nature center, visit facebook.com/CalusaNature. Charles Runnells is an arts and entertainment reporter for The News-Press and the Naples Daily News. To reach him, call 239-335-0368 (for tickets to shows, call the venue) or email him at crunnells@gannett.com . Follow or message him on social media: Facebook ( facebook.com/charles.runnells.7 ), X (formerly Twitter) ( @charlesrunnells ), Threads (@crunnells1) and Instagram ( @crunnells1 ). Staff Directory Corrections Careers Accessibility Support Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Businesses Advertise Your Business Promote Your Event Buy and Sell Licensing & Reprints Help Center Subscriber Guide Manage Account Give Feedback Subscribe Today Newsletters Mobile Apps Facebook X eNewspaper Archives Jobs Real Estate Classifieds Education Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.news-press.com. All rights reserved."
    },
    {
      "url": "https://www.theatrenantucket.org/about-us/staff-and-board-of-directors",
      "text": "Team SUPPORTÂ US BUY TICKETS SHOWS & TICKETS 2025 SEASON SEASON SUBSCRIPTIONS & GIFT CARDS WHAT TO EXPECT AT THE THEATRE PAST SEASONS GALLERY ABOUT US OUR MISSION & HISTORY STAFF AND BOARD OF DIRECTORS JOBS & VOLUNTEER OPPORTUNITIES AUDITIONS CONTACT US SPOTLIGHT ON SUPPORT SEASON PRODUCERS BUSINESS SPONSORS BUY TICKETS PRODUCING ARTISTIC DIRECTOR Justin Cerne EXECUTIVE DIRECTOR Bethany Oliver ARTISTIC DIRECTOR EMERITUS John Shea COMPANY MANAGER Emily Dunn THEATRE OPERATIONS Katy Feldhahn AUDIENCE ENGAGEMENT Johannah Johnson RESIDENT COSTUME DESIGNER Casey Sayre Boukus RESIDENT LIGHTING DESIGNER Stephen Petrelli RESIDENT SOUND DESIGNER Tony Wagner BOARD OF DIRECTORS Kay Bernon Beth English Ellie Gottwald, VP* David Handy Cecelia Johnson Holly Johnson David Kaytes, President* Karen Keelan Susan Lucier, Clerk* Linda Mason Jean Doyen de Montaillou Chris Mortenson, Treasurer* Helene Patterson Maureen Phillips, Treasurer Designate* Maria Roach, VP* Lisa Soeder* David Southwell, VP* * Executive Committee EMERITUS DIRECTORS Max N. Berry Barbara L. Elder Toby Greenberg Frank Morral Judith Greenberg Seinfeld THEATRE COUNCIL Rebecca Becker Bruce Beni Jane Forman Kathryn Garre-Ayars Victoria Girvan Jill Karp Peggy Kaufman Christina Rose Manca Terry Schubach Les Silverman FRIENDS OF THE THEATRE Amb. Elizabeth Frawley Bagley Jim Bennett Kate Brosnan Jane Condon Fritz Michel Join Our Newsletter Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. EMAIL info@theatrenantucket.org PHONE 508-228-4305 MAILINGÂ ADDRESS POÂ BOX 1297 Nantucket, MA 02554 STAGE Bennett Hall 62 Centre Street VIRTUAL BOX OFFICE Online:Â Â Â www.theatrenantucket.org Email: info@theatrenantucket.org Tickets can be purchased one hour prior to showtime at Bennett Hall."
    },
    {
      "url": "https://www.calusanature.org/post/goodbye-milton-hello-thrill-on-cncp-reopens-saturday",
      "text": "Goodbye Milton. Hello Thrill-On. CNCP Reopens Saturday! top of page Donate Nurture Nature Memberships Sponsorships Member Log In Virtual Tour Home About Us Planetarium Planetarium Schedule Sounds of the Ocean YOUniverse Nature Center Education Events & Registration Haunted Walk Holiday Lights Event Rentals Get Involved Volunteer Application Internships Careers Wish List News More Use tab to navigate through the menu items. All Posts Planetarium Search Goodbye Milton. Hello Thrill-On. CNCP Reopens Saturday! eraddatz7 Oct 10, 2024 4 min read Fort Myers, FL – We are excited to announce that Milton is gone and we are back in action starting this Saturday! After the recent challenges, our nature center, planetarium, Haunted Walk, and Mesmerica experiences will still be closed tomorrow but will reopen this Saturday, inviting everyone to join us for a weekend of adventure and fun. We understand the impact of the hurricane has been tough, but it’s time to shake off the dust and get back outside, or inside at our planetarium if you are looking for some AC and a great show! Our dedicated team and our amazing creatures have made it through safely, and we’re fully powered up and ready to welcome you! Join us for our Haunted Walk starting this Saturday and discover the wonders waiting for you. We can't wait to see you all again! Starting October 12 , the darkness descends upon the Nature Center every Friday, Saturday, and Sunday in October, beginning at 7:30 PM . Are you brave enough to face the terrors that await? Do you know how creepy 105 acres of unspoiled Florida preserves can be at night in season? Creepier than a hurricane named Milton! Venture into our haunted trails, where the spirits of nature and ghoulish creatures come alive! This is not just a walk in the park—it's a heart-pounding adventure designed to send chills down your spine while supporting a noble cause. The Haunted Walk serves as a crucial fundraiser, ensuring our beloved animal residents receive the care they need for the upcoming year. Details of the Haunting: What: 51st Annual Haunted Walk Where: Calusa Nature Center, 3450 Ortiz Ave, Fort Myers, FL 33905 Tickets: $20 in advance, $25 at the door Haunted Walk Dates: Saturday, October 12 starting at 7:30 PM Sunday, October 13 starting at 7:30 PM Friday, October 18 starting at 7:30 PM Saturday, October 19 starting at 7:30 PM Sunday, October 20 starting at 7:30 PM Friday, October 25 starting at 7:30 PM Saturday, October 26 starting at 7:30 PM Sunday, October 27 starting at 7:30 PM Get your tickets at www.calusanature.org or at the door! We will delight you with fright! Feel the chill of the night air as you encounter ghostly guides, spine-tingling surprises, and the unknown lurking in the shadows. Secure your tickets now —if you dare! Join us for a hauntingly good time, and remember, every scream helps feed and care for our animal residents. Get ready for an unforgettable night of thrills, frights, and laughter. Can you handle the fear? Contact: Calusa Nature Center & Planetarium3450 Ortiz AvenueFort Myers, FL 33905 Email: info@calusanature.org Phone: 239.275.3435 Upcoming Events: • Mesmerica: Be mesmerized by our featured presentation, Mesmerica 360 – an extraordinary 360-degree projection experience offering virtual reality-like visuals combined with soothing and stimulating effects. 🎥✨ This immersive show features music by Grammy-nominated composer and percussionist James Hood and 3D animated art from international artists. Mesmerica 360 tickets are available. tickets are available. Tickets can be purchased at calusanature.org and Mesmerica Tickets . (OH and see a great News-Press article about our grand renovation of our planetarium here!) • Forest Bathing Date: Monday, October 14, 2024 Time: 9:30 AM – 11:30 AM Location: Calusa Nature Center, 3450 Ortiz Ave, Fort Myers Tickets available now! Experience the calming effects of nature in the largest green space in Fort Myers. Join us for a rejuvenating session of forest bathing. • Homeschool: Cryptozoology (Ages 9-12) Date: Thursday, October 17, 2024 Time: 1:00 PM – 3:00 PM Location: Calusa Nature Center, 3450 Ortiz Ave, Fort Myers Tickets available now! Delve into the intriguing world of cryptozoology and discover creatures that exist on the fringes of science. • Music Under the Stars Date: Thursday, October 17, 2024 Time: 7:00 PM Location: Planetarium at Calusa Nature Center, 3450 Ortiz Ave, Fort Myers Tickets available now! Enjoy Acoustic Americana music featuring Brian Smalley, Bill Metts, and Roy Schneider in the Planetarium. • Holiday Lights Date: Friday, December 6, 2024 Time: 6:00 PM – 9:30 PM Location: Calusa Nature Center, 3450 Ortiz Ave, Fort Myers Tickets available now! Join us for our annual Holiday Lights event, featuring festive displays and activities for the whole family. Daily Programming: Tuesday - Saturday: 12:15 PM & 2:15 PM: Planetarium Show 1:15 PM: Animal Talk Sunday: 12:15 PM, 2:15 PM, & 3:15 PM: Planetarium Show 1:15 PM: Animal Talk Support Our Renovation: Help us bring our newly renovated Planetarium to life by donating to our capital campaign here . Explore special sponsorship opportunities, including naming rights for Planetarium seats and other key features here . 💖 Follow us on social media for updates and sneak peeks into the haunted fun! Disclaimer: This event may not be suitable for young children or those with a weak heart. Enter at your own risk! A Special Thank You: We extend our heartfelt thanks to our supporters, including Vulcan Materials, R4, Aux Delicies, Famous Dave’s, The City of Fort Myers, The Fred and Jean Allegretti Foundation, Heitman House, and the Fort Myers Film Festival. Stay Connected Cozy at home? Experience the Calusa Nature Center virtually! Enjoy our FREE T360 tour from your couch: #HomeBoundAdventures #NatureAtHome . Immerse yourself in our fresh interactive education videos here. Make your event unforgettable with one of Florida's unique venues! From weddings and showers to meetings and parties, we offer stunning indoor and outdoor spaces. Reach out now to reserve your date! Stay connected and learn more about our events and programming by visiting www.calusanature.org or following us on social media. For a recent look at our renovation updates, check out the NBC2 story here . For media inquiries or interview opportunities, please contact: Contact: Eric Raddatz Executive Director Calusa Nature Center & Planetarium 3450 Ortiz Avenue Fort Myers, FL 33905 Email: eraddatz@calusanature.org Phone: 239.275.3435 Website: www.calusanature.org Recent Posts See All Fall Thrills, Chills & Family Fun Await at Calusa Nature Center & Planetarium! What's Up in SW FL Skies: September \"eclipse season\" and Equinox, Saturn still mostly edge-on, meteors... Fun All Year Long at Calusa Nature Center & Planetarium! Thank you to our Sponsors & Partners Open Hours: Tuesday - Sunday: 10am - 4pm ​ Pricing: Adults $13 Children $7 Members Free Up CALUSA NATURE CENTER AND PLANETARIUM IS REGISTERED WITH THE STATE OF FLORIDA. A COPY OF THE OFFICIAL REGISTRATION (CH661) AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES BY CALLING TOLL-FREE 1-800-435-7352 WITHIN THE STATE OR VISITING WWW.800HELPFLA.COM . REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL, OR RECOMMENDATION BY THE STATE. OUR CONFIDENTIALITY POLICY, CONFLICT OF INTEREST POLICY AND WHISTLEBLOWER POLICY ARE AVAILABLE UPON REQUEST. EIN #23-7090889 Contact Us © 2024 by CNCP ​ bottom of page"
    },
    {
      "url": "https://www.wgcu.org/tags/calusa-nature-center-planetarium",
      "text": "Calusa Nature Center & Planetarium | WGCU PBS & NPR for Southwest Florida Search Query Show Search LIVE TV Schedules TV Schedules Radio Schedules TV Schedules Radio Schedules News Arts & Culture Business/Economy Crime Culture & Connections Education Environment Government & Politics Gulf Coast Life Health Hurricane Recovery Immigration Science & Tech Southwest Florida In Focus News Sports Water Quality Report Weather Page Beacon Arts & Culture Business/Economy Crime Culture & Connections Education Environment Government & Politics Gulf Coast Life Health Hurricane Recovery Immigration Science & Tech Southwest Florida In Focus News Sports Water Quality Report Weather Page Beacon Listen WGCU-FM Live WGCU Classical Gulf Coast Life Gulf Coast Life Arts Edition Gulf Coast Life Book Club Three Song Stories The Last Ride With the Wild Things Ye Gods All Radio Programs WGCU-FM Live WGCU Classical Gulf Coast Life Gulf Coast Life Arts Edition Gulf Coast Life Book Club Three Song Stories The Last Ride With the Wild Things Ye Gods All Radio Programs Watch Live TV Video On Demand PBS Passport Southwest Florida In Focus News WGCU YouTube Channel WGCU News YouTube The Florida Channel Live TV Video On Demand PBS Passport Southwest Florida In Focus News WGCU YouTube Channel WGCU News YouTube The Florida Channel Education For Educators For Parents Watch PBS Kids For Educators For Parents Watch PBS Kids Events WAYS TO GIVE Membership Renew Your Membership Major Giving Planned Giving Strategic Campaign Corporate Sponsorship Membership Renew Your Membership Major Giving Planned Giving Strategic Campaign Corporate Sponsorship Member Login WGCU Member Login PBS Passport Login WGCU Member Login PBS Passport Login © 2025 WGCU News Menu PBS and NPR for Southwest Florida Show Search Search Query LIVE TV Donate Play Live Radio Next Up: 0:00 0:00 0:00 0:00 Available On Air Stations On Air Now Playing WGCU-FM News Stream On Air Now Playing WGCU-FM Classical On Air Now Playing WGCU Beacon All Streams Schedules TV Schedules Radio Schedules TV Schedules Radio Schedules News Arts & Culture Business/Economy Crime Culture & Connections Education Environment Government & Politics Gulf Coast Life Health Hurricane Recovery Immigration Science & Tech Southwest Florida In Focus News Sports Water Quality Report Weather Page Beacon Arts & Culture Business/Economy Crime Culture & Connections Education Environment Government & Politics Gulf Coast Life Health Hurricane Recovery Immigration Science & Tech Southwest Florida In Focus News Sports Water Quality Report Weather Page Beacon Listen WGCU-FM Live WGCU Classical Gulf Coast Life Gulf Coast Life Arts Edition Gulf Coast Life Book Club Three Song Stories The Last Ride With the Wild Things Ye Gods All Radio Programs WGCU-FM Live WGCU Classical Gulf Coast Life Gulf Coast Life Arts Edition Gulf Coast Life Book Club Three Song Stories The Last Ride With the Wild Things Ye Gods All Radio Programs Watch Live TV Video On Demand PBS Passport Southwest Florida In Focus News WGCU YouTube Channel WGCU News YouTube The Florida Channel Live TV Video On Demand PBS Passport Southwest Florida In Focus News WGCU YouTube Channel WGCU News YouTube The Florida Channel Education For Educators For Parents Watch PBS Kids For Educators For Parents Watch PBS Kids Events WAYS TO GIVE Membership Renew Your Membership Major Giving Planned Giving Strategic Campaign Corporate Sponsorship Membership Renew Your Membership Major Giving Planned Giving Strategic Campaign Corporate Sponsorship Member Login WGCU Member Login PBS Passport Login WGCU Member Login PBS Passport Login Calusa Nature Center & Planetarium Arts & Culture Events and Programming Coordinator Michael Hebler plans to expand cinema at the Alliance Tom Hall With a background as an international film publicist for Disney, Warner Brothers and Lionsgate, Events and Programming Coordinator Michael Hebler is determined to expand the importance of cinema at the Alliance for the Arts. Listen • 1:52 Arts & Culture Bill Taylor announces lineup for Theatre Conspiracy's farewell tour Tom Hall This season will be Theatre Conspiracy’s last in Southwest Florida. Founder and Producing Artistic Director Bill Taylor has announced a lineup of 11 blockbuster shows for its farewell tour. Since the company is no longer at the Alliance for the Arts, it has arranged to stage this season’s shows in the Off Broadway Palm, Calusa Nature Center and Planetarium and The Laboratory Theater of Florida. Listen • 2:13 Arts & Culture Southwest Florida's artful alternatives for Valentine's Day Tom Hall Looking for an artful way to observe Valentine’s Day? Consider these three alternatives to flowers and chocolates. Listen • 1:10 Arts & Culture Eric Raddatz bringing full-dome films to Fort Myers Film Festival and Calusa Planetarium Tom Hall Although they’ve been around for years, dome films are making a comeback. Known for cutting edge programming, the Fort Myers Film Festival is joining this trend. Director Eric Raddatz, has recently announced the Film Festival’s collaboration with Calusa Nature Center & Planetarium and is preparing to issue a call for dome film submissions. Listen • 1:55 WGCU is your trusted source for news and information in southwest Florida. We are a nonprofit public service, and your support is more critical than ever. Keep public media strong and donate now. Thank you. Stay Connected twitter instagram youtube facebook linkedin © 2025 WGCU News Make a Donation Become a Member Major Giving Corporate Sponsor Donate Your Car or Boat About WGCU Staff Directory Careers FCC Public Files Privacy Policy CALL: 239-590-2300 EMAIL: wgcumain@fgcu.edu Directions & Parking Member Login Sign Up for Emails"
    },
    {
      "url": "https://signup.com/group/759736404069",
      "text": "Group Page: Calusa Nature Center and Planetarium | SignUp.com [ X ] What We Do Create a SignUp Find My SignUp Idea Center Free Sign Up Sheets for Event Planning and Volunteer Management Back to School Planning Center: Tips & Ideas for a Successful Back-to-School Season Class Party Planning Center: Ideas, Tips and Reminders Community Action and Activism Planning Center Fall Activities & Events Planning Center Fundraising Planning Center: Time-Saving Tips and Creative Ideas Holiday Season Activities & Events End-of-School Planning Center Parent-Teacher Conference Planning Center Potluck Planning: Time-Saving Tips and Reminders Room Parent Ideas and Classroom Coordination School Activities Planning Center: Ideas, Tips and Reminders for Well-Organized School Events Spring Activities & Events Planning Center Summertime Planning Center Teacher Appreciation Planning Center: Tips, Tricks & Ideas for Celebrating Teacher Appreciation Week Volunteer Appreciation Planning Center Youth Sports Planning Center Business Events Planning Center Church Events Planning Center Special Events Planning Center News & More Idea Center: Resources, Planning Tips & Ideas to save you time organizing volunteers and events Help Log in Register Loading Group... Calusa Nature Center and Planetarium Welcome to Calusa Nature Center and Planetarium (CNCP)! Thank you for your interest in volunteering with our team, volunteers are what makes our mission of \"Inspiring People to Connect with Nature\", possible for our community. If you are new to volunteering with CNCP, please sign up first for an orientation on Sunday at 11 am. Please Note: We have set schedules for volunteers, meaning: you must commit to the full time you sign up for. We have a three strike rule for late volunteers or for no-shows. Below you can find all of our available volunteering opportunities! We are excited to work with you! {{act.activity.title}} : {{act.totalassignments}} : {{act.totalassignments}} {{act.totaljobs}} {{act.collected|currency}} {{act.goal|currency}} SignUp is free thanks to our sponsors: © 2025 VolunteerSpot, Inc. All Rights Reserved. Back to Top ^ | Terms of Service | Privacy Policy (CCPA) | Site Map | Contact | Help | Advertise With Us | Demo Back to Top ^ Go To Home Find My SignUp Sign In Register Help & Resources Help Center Quick Tip Videos Collect Money Compare Pricing Logos & Buttons Company About Company Press Releases Team SignUp.com Company Fact Sheet [pdf] In the News Partners & Pages Responsible Disclosure Policy Responsible Disclosure Hall Of Fame Do Not Sell My Personal Information Connect Contact Brand Partner Hub Advertise With Us About SignUp.com At SignUp.com, we believe that when people get together, great things happen. That’s why parents and teachers, business and community leaders, and friends and coworkers trust our coordination resources and applications to save time and achieve remarkable outcomes. Our simple, intuitive SignUp sheets and scheduling tools make it easy for people to join together and say YES to pitching in, signing up, and helping out. No waiting for approvals and passwords, no software to install—just free, easy scheduling and SignUp tools for everyday heroes. Use SignUp.com for anything including school activities, potlucks, service projects, carnivals and walk-a-thons, class parties, teacher appreciation events, swim meets, tournaments, charity races, office hours, car pool, parent-teacher conference SignUps and more. Automatic reminders help participants keep their commitments, and easy online calendar editing, reporting and messaging saves time and energy, so everyone can do more GOOD! Bummer! An error has occurred on this page. We have sent an error report back to the geeks. Possible recovery paths: You may be able to refresh the page and continue. Is it a repeated error? Please email Support with the details. Bummer! An error has occurred on this page. Unfortunately you are using an unsupported browser.\n            SignUp.com is not able to support technology this old. Possible recovery paths: You should upgrade as soon as possible . It's free! Privacy Manager"
    },
    {
      "url": "https://news.wgcu.org/show/gulf-coast-life/2025-04-09/stargazing-and-nurturing-nature-at-the-calusa-nature-center-planetarium",
      "text": "Stargazing and nurturing nature at the Calusa Nature Center & Planetarium | WGCU PBS & NPR for Southwest Florida Search Query Show Search LIVE TV Schedules TV Schedules Radio Schedules TV Schedules Radio Schedules News Arts & Culture Business/Economy Crime Culture & Connections Education Environment Government & Politics Gulf Coast Life Health Hurricane Recovery Immigration Science & Tech Southwest Florida In Focus News Sports Water Quality Report Weather Page Beacon Arts & Culture Business/Economy Crime Culture & Connections Education Environment Government & Politics Gulf Coast Life Health Hurricane Recovery Immigration Science & Tech Southwest Florida In Focus News Sports Water Quality Report Weather Page Beacon Listen WGCU-FM Live WGCU Classical Gulf Coast Life Gulf Coast Life Arts Edition Gulf Coast Life Book Club Three Song Stories The Last Ride With the Wild Things Ye Gods All Radio Programs WGCU-FM Live WGCU Classical Gulf Coast Life Gulf Coast Life Arts Edition Gulf Coast Life Book Club Three Song Stories The Last Ride With the Wild Things Ye Gods All Radio Programs Watch Live TV Video On Demand PBS Passport Southwest Florida In Focus News WGCU YouTube Channel WGCU News YouTube The Florida Channel Live TV Video On Demand PBS Passport Southwest Florida In Focus News WGCU YouTube Channel WGCU News YouTube The Florida Channel Education For Educators For Parents Watch PBS Kids For Educators For Parents Watch PBS Kids Events WAYS TO GIVE Membership Renew Your Membership Major Giving Planned Giving Strategic Campaign Corporate Sponsorship Membership Renew Your Membership Major Giving Planned Giving Strategic Campaign Corporate Sponsorship Member Login WGCU Member Login PBS Passport Login WGCU Member Login PBS Passport Login © 2025 WGCU News Menu PBS and NPR for Southwest Florida Show Search Search Query LIVE TV Donate Play Live Radio Next Up: 0:00 0:00 0:00 0:00 Available On Air Stations On Air Now Playing WGCU-FM News Stream On Air Now Playing WGCU-FM Classical On Air Now Playing WGCU Beacon All Streams Schedules TV Schedules Radio Schedules TV Schedules Radio Schedules News Arts & Culture Business/Economy Crime Culture & Connections Education Environment Government & Politics Gulf Coast Life Health Hurricane Recovery Immigration Science & Tech Southwest Florida In Focus News Sports Water Quality Report Weather Page Beacon Arts & Culture Business/Economy Crime Culture & Connections Education Environment Government & Politics Gulf Coast Life Health Hurricane Recovery Immigration Science & Tech Southwest Florida In Focus News Sports Water Quality Report Weather Page Beacon Listen WGCU-FM Live WGCU Classical Gulf Coast Life Gulf Coast Life Arts Edition Gulf Coast Life Book Club Three Song Stories The Last Ride With the Wild Things Ye Gods All Radio Programs WGCU-FM Live WGCU Classical Gulf Coast Life Gulf Coast Life Arts Edition Gulf Coast Life Book Club Three Song Stories The Last Ride With the Wild Things Ye Gods All Radio Programs Watch Live TV Video On Demand PBS Passport Southwest Florida In Focus News WGCU YouTube Channel WGCU News YouTube The Florida Channel Live TV Video On Demand PBS Passport Southwest Florida In Focus News WGCU YouTube Channel WGCU News YouTube The Florida Channel Education For Educators For Parents Watch PBS Kids For Educators For Parents Watch PBS Kids Events WAYS TO GIVE Membership Renew Your Membership Major Giving Planned Giving Strategic Campaign Corporate Sponsorship Membership Renew Your Membership Major Giving Planned Giving Strategic Campaign Corporate Sponsorship Member Login WGCU Member Login PBS Passport Login WGCU Member Login PBS Passport Login Environment Gulf Coast Life Stargazing and nurturing nature at the Calusa Nature Center & Planetarium By Mike Kiniry Published April 9, 2025 at 9:38 AM EDT Listen • 28:46 Courtesy photo Mike Kiniry; Eric Raddatz, Executive Director of the Calusa Nature Center and Planetarium; and Kaitlin Danks, Secretary of the Executive Committee of the center’s Board of Trustees In the early 1960s members of a newly formed local chapter of the Junior Welfare League decided that Fort Myers needed a natural history museum and planetarium. They began raising money through haunted house fundraising events, and momentum began building to establish a site for environmental and science education. In 1972, the City of Fort Myers granted a 105-acre lease of city property on the corner of Colonial Boulevard and Ortiz Avenue. A 1,200 square foot church building called The Iona House was donated to the Center in the late 70s and was moved to the current site of the Calusa Nature Center and Planetarium . Over the decades, the nonprofit has introduced countless young people to the natural world, and the cosmos, through educational programs. But their offerings aren’t only for young people — the Center has also provided astronomy programs and laser light shows. These days its 105-acre site features a natural history museum with live native and teaching animals, a butterfly garden and raptor aviary, as well as exhibits about the animals, plants, and environment of Southwest Florida. And they host events like music under the stars, paint and sips, night hikes, summer camps, and even an event called Potter in the Park . We sat down in their planetarium on a Saturday morning to shine some light on the work they do and the resources they provide to the community. Guests: Eric Raddatz, Executive Director of the Calusa Nature Center and Planetarium Kaitlin Danks, Secretary of the Executive Committee of the center’s Board of Trustees WGCU is your trusted source for news and information in Southwest Florida. We are a nonprofit public service, and your support is more critical than ever. Keep public media strong and donate now . Thank you. Tags Gulf Coast Life Gulf Coast Life Environment Space Mike Kiniry mkiniry@wgcu.org See stories by Mike Kiniry WGCU is your trusted source for news and information in southwest Florida. We are a nonprofit public service, and your support is more critical than ever. Keep public media strong and donate now. Thank you. Stay Connected twitter instagram youtube facebook linkedin © 2025 WGCU News Make a Donation Become a Member Major Giving Corporate Sponsor Donate Your Car or Boat About WGCU Staff Directory Careers FCC Public Files Privacy Policy CALL: 239-590-2300 EMAIL: wgcumain@fgcu.edu Directions & Parking Member Login Sign Up for Emails"
    },
    {
      "url": "https://www.calusanature.org/",
      "text": "Calusa Nature Center & Planetarium | Fort Myers, FL top of page Donate Nurture Nature Memberships Sponsorships Member Log In Virtual Tour Home About Us Planetarium Planetarium Schedule Sounds of the Ocean YOUniverse Nature Center Education Events & Registration Haunted Walk Holiday Lights Event Rentals Get Involved Volunteer Application Internships Careers Wish List News More Use tab to navigate through the menu items. Connect Connect Connect Connect With With With With Nature Nature Nature Nature SOTO-KeyVisual-Wide-with Logo Help Us Inspire and Educate Southwest Florida! Each year, the Calusa Nature Center hosts t Nurture Nature SOTO-KeyVisual-Wide-with Logo 1/14 Daily Programming (included with admission) Subject to change/cancellation Tuesday - Saturday 12:15 pm Planetarium Show 1:15 pm Animal Talk 2:15 pm Planetarium Show Sunday 12:15 pm Planetarium Show 1:15 pm Animal Talk 2:15 pm Planetarium Show 3:15 pm Planetarium Show To see our planetarium shows for the month, click here! Wednesday 11:00 am Solar Viewing Check out our YouTube and see how we're nurturing nature! Upcoming Events Planetarium Premiere: The Earth Above Wed, Sep 17 More info Buy Tickets Multiple Dates Friendly Forest Sat, Sep 20 More info Buy Tickets Multiple Dates Friendly Forest Sun, Sep 21 More info Buy Tickets Membership Offer Preschool: Say What? Wed, Oct 01 More info Buy Tickets Membership Offer Homeschool: Zoology-Animal Communication Thu, Oct 02 More info Buy Tickets Multiple Dates CNCP's Annual Haunted Walk Fri, Oct 03 More info Buy Tickets Multiple Dates CNCP's Annual Haunted Walk Sat, Oct 04 More info Buy Tickets Multiple Dates CNCP's Annual Haunted Walk Sun, Oct 05 More info Buy Tickets Multiple Dates CNCP's Annual Haunted Walk Fri, Oct 10 More info Buy Tickets Multiple Dates CNCP's Annual Haunted Walk Sat, Oct 11 More info Buy Tickets Multiple Dates CNCP's Annual Haunted Walk Sun, Oct 12 More info Buy Tickets Multiple Dates CNCP's Annual Haunted Walk Fri, Oct 17 More info Buy Tickets Multiple Dates CNCP's Annual Haunted Walk Sat, Oct 18 More info Buy Tickets Multiple Dates YOUniverse / LIFE FORCE SOUND MEDITATION BENEATH THE COSMOS Sun, Oct 19 More info Buy Tickets Multiple Dates CNCP's Annual Haunted Walk Sun, Oct 19 More info Buy Tickets Membership Offer Homeschool: Zoology-Animal Communication Thu, Oct 23 More info Buy Tickets Music Under The Stars Thu, Oct 23 More info Buy Tickets Multiple Dates CNCP's Annual Haunted Walk Fri, Oct 24 More info Buy Tickets Load More Thank you to our Sponsors & Partners Open Hours: Tuesday - Sunday: 10am - 4pm ​ Pricing: Adults $13 Children $7 Members Free Up CALUSA NATURE CENTER AND PLANETARIUM IS REGISTERED WITH THE STATE OF FLORIDA. A COPY OF THE OFFICIAL REGISTRATION (CH661) AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES BY CALLING TOLL-FREE 1-800-435-7352 WITHIN THE STATE OR VISITING WWW.800HELPFLA.COM . REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL, OR RECOMMENDATION BY THE STATE. OUR CONFIDENTIALITY POLICY, CONFLICT OF INTEREST POLICY AND WHISTLEBLOWER POLICY ARE AVAILABLE UPON REQUEST. EIN #23-7090889 Contact Us © 2024 by CNCP ​ bottom of page"
    },
    {
      "url": "https://www.calusanature.org/post/happy-holidays-from-calusa-nature-center-don-t-miss-our-stunning-holiday-lights",
      "text": "Happy Holidays from Calusa Nature Center! 🎁 Don’t Miss Our Stunning Holiday Lights 🎄 top of page Donate Nurture Nature Memberships Sponsorships Member Log In Virtual Tour Home About Us Planetarium Planetarium Schedule Sounds of the Ocean YOUniverse Nature Center Education Events & Registration Haunted Walk Holiday Lights Event Rentals Get Involved Volunteer Application Internships Careers Wish List News More Use tab to navigate through the menu items. All Posts Planetarium Search Happy Holidays from Calusa Nature Center! 🎁 Don’t Miss Our Stunning Holiday Lights 🎄 eraddatz7 Dec 11, 2024 2 min read FORT MYERS, FL – The VIP Opening Night Gala for the 2024 Holiday Lights Event at the Calusa Nature Center & Planetarium was a huge success! On Dec. 5, guests enjoyed early access to the stunning ⅓ mile illuminated trail, met Santa, watched a dazzling laser show, and grooved to festive music. The red carpet was rolled out, and attendees indulged in delicious food from Outback Steakhouse and Bellacino's Pizza, plus exclusive hors d'oeuvres and wine from our members' special collections. It was the perfect sneak peek before the official opening! The Holiday Lights event is now open to the public every Friday, Saturday, and Sunday in December, from 6 to 9 PM. Don’t miss the chance to experience over a million twinkling lights, a winter wonderland on the Pine Loop Trail, festive music, seasonal treats, and more! This event is a wonderful way to celebrate the season while supporting the important work of the Calusa Nature Center & Planetarium. Ticket prices: Adults (12 & up): $10 Children (3-11): $5 Members: Free (Membership ID required) Proceeds from ticket sales benefit wildlife conservation efforts, educational programs, and environmental preservation. By attending, you’re helping to support the vital work of the Calusa Nature Center, from rehabilitating injured wildlife to fostering environmental education. Holiday Lights will run every Friday, Saturday, and Sunday in December from 6 to 9 PM. Get your tickets today and be part of this magical holiday experience! From our staff to you and your families — Happy Holidays! For more information or to buy tickets, visit calusanature.org . #HolidayLights #SupportWildlife #NurtureNature #CalusaNature #SponsorAppreciation • A Special Thank You: We extend our heartfelt thanks to our new sponsor Ace Hardware, the place with the helpful hardware folks, as well as continuing supporters, including Vulcan Materials, R4 Roofing , Aux Delicies , Famous Dave’s , The City of Fort Myers , Sanibel Captiva Community Bank , The Fred and Jean Allegretti Foundation , Heitman House , and the Fort Myers Film Festival. • Stay Connected Cozy at home? Experience the Calusa Nature Center virtually! Enjoy our FREE T360 tour from your couch: #HomeBoundAdventures #NatureAtHome . Immerse yourself in our fresh interactive education videos here. Make your event unforgettable with one of Florida's unique venues! From weddings and showers to meetings and parties, we offer stunning indoor and outdoor spaces. Reach out now to reserve your date! Media Contact: Calusa Nature Center & Planetarium Email: eraddatz@calusanature.org Phone: (239) 275-3435 Website: calusanature.org #HolidayLights #SantaMeetAndGreet #HolidayLaserShows #SupportWildlife #NatureLovers #ExploreNature #CalusaNature #NurtureNature Recent Posts See All Fall Thrills, Chills & Family Fun Await at Calusa Nature Center & Planetarium! What's Up in SW FL Skies: September \"eclipse season\" and Equinox, Saturn still mostly edge-on, meteors... Fun All Year Long at Calusa Nature Center & Planetarium! Thank you to our Sponsors & Partners Open Hours: Tuesday - Sunday: 10am - 4pm ​ Pricing: Adults $13 Children $7 Members Free Up CALUSA NATURE CENTER AND PLANETARIUM IS REGISTERED WITH THE STATE OF FLORIDA. A COPY OF THE OFFICIAL REGISTRATION (CH661) AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES BY CALLING TOLL-FREE 1-800-435-7352 WITHIN THE STATE OR VISITING WWW.800HELPFLA.COM . REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL, OR RECOMMENDATION BY THE STATE. OUR CONFIDENTIALITY POLICY, CONFLICT OF INTEREST POLICY AND WHISTLEBLOWER POLICY ARE AVAILABLE UPON REQUEST. EIN #23-7090889 Contact Us © 2024 by CNCP ​ bottom of page"
    },
    {
      "url": "https://www.tripowervacationrentals.com/calusa-nature-center-planetarium/",
      "text": "Calusa Nature Center & Planetarium Skip to main content My Rentals Recently Viewed (0) 239-463-5887 Vacation Rentals New Units Search by Bedroom Studio and 1 Bedroom Rentals 2 Bedrooms 3 Bedrooms 4+ Bedrooms Search All Rentals Search by Location North End of Fort Myers Beach Time Square Area of FMB Mid-Island Fort Myers Beach South End of Fort Myers Beach Fort Myers San Carlos / Near Fort Myers Search by Type Beachfront Beachfront Homes Beachfront Condos Canal & Bayfront Rentals with Pools Dog Friendly Private Homes Luxury Homes Condos & Apartments Search by Length of Stay Annual & Long Term Rentals Bi-Weekly Rentals Weekly Minimum Rentals Monthly Minimum Rentals Search by Complex Property Map Property List Search All Rentals Availability Calendar Long Term Rentals Current Specials Property Walkthroughs Guests Bicycle, Golf Cart & Scooter Rentals Book Direct and Save Check-In / Check-Out Instructions Terms & Conditions Travel Insurance Turtle Time on Fort Myers Beach Who’s Open For Business Rental Management Vacation Rental Property Management Annual Rental Management Owner’s Portal Explore Bicycle, Golf Cart & Scooter Rentals Do Something Fun See Someplace Cool Enjoy Awesome Eats Experience Exciting Events Discover the Beach Learn Island History Book Direct and Save Read All Blog Posts Turtle Time on Fort Myers Beach Who’s Open For Business About Us Contact Us Reviews Getting to Fort Myers Beach Book Direct and Save Sales We proudly speak English, Español , and Deutsch ! AT CHECKOUT, USE CODE \"SUM20\" FOR UP TO A 20% DISCOUNT! (Click here for eligible properties) {{select.label}} {{select.label}} {{option.name}} Search Calusa Nature Center & Planetarium About Established in 1970, Calusa Nature Center & Planetarium has been a part of the Southwest Florida community for nearly 50 years! Our mission, inspiring people to connect with nature, is accomplished by educating both children and adults about our unique ecosystem and environmental issues concerning our area. We strive to provide a holistic environmental education program encompassing all areas from astronomy to ecology.  Our 105-acre site is home to many rescue animals, butterfly and bird aviaries, two nature trails, SWFL’s only planetarium theater, and much more! Hours of Operation Tuesday – Sunday 10 am – 4 pm Admission Non-Members: Adults – $10 • Children 3-12 – $5 • Under 3 – FREE Discounts for Seniors, Students, Military, First Responders and AAA – Inquire at the front desk Pet Policy We are not a pet-friendly facility. Only task-trained service dogs are allowed at Calusa Nature Center and Planetarium. Location 3450 Ortiz Avenue, Fort Myers, Florida 33905 We are located at the intersection of Colonial Blvd and Ortiz Avenue in Fort Myers. For more information, please visit: https://www.calusanature.org/ Recent Posts Island Hopper Songwriter Fest on Fort Myers Beach Annual Roar Offshore Powerboat Race on Fort Myers Beach KJ’s Steakhouse Doc Ford’s Rum Bar & Grille Naples Princess Categories ~ Explore Fort Myers Beach ~ Activities Attractions Awesome Eats Events Shopping Uncategorized Most Popular Articles How to Win a Sandsculpting Championship Book Direct and Save A Guide to The Beaches Near Fort Myers Beach TriPower Vacation Rentals 2001 & 2085 Estero Blvd. Fort Myers Beach, FL USA 33931 239-463-5887 rentals@c21tripower.com OWNER PORTAL Rentals All Rentals Beachfront Pet Friendly Rentals with Pools Condominiums in Fort Myers Beach North End Mid Island South End Quick Links Home Explore Privacy Policy About Us Sales Testimonials Book Direct and Save Rentals A-Z Sign Up For Specials & Updates Email CAPTCHA Name This field is for validation purposes and should be left unchanged. Δ © Copyright 2025  Vacation Rentals Fort Myers Beach | TriPower | Terms Website managed by RealTech Webmasters This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. ← Close Menu Vacation Rentals New Units Search by Bedroom Studio and 1 Bedroom Rentals 2 Bedrooms 3 Bedrooms 4+ Bedrooms Search All Rentals Search by Location North End of Fort Myers Beach Time Square Area of FMB Mid-Island Fort Myers Beach South End of Fort Myers Beach Fort Myers San Carlos / Near Fort Myers Search by Type Beachfront Beachfront Homes Beachfront Condos Canal & Bayfront Rentals with Pools Dog Friendly Private Homes Luxury Homes Condos & Apartments Search by Length of Stay Annual & Long Term Rentals Bi-Weekly Rentals Weekly Minimum Rentals Monthly Minimum Rentals Search by Complex Property Map Property List Search All Rentals Availability Calendar Long Term Rentals Current Specials Property Walkthroughs Guests Bicycle, Golf Cart & Scooter Rentals Book Direct and Save Check-In / Check-Out Instructions Terms & Conditions Travel Insurance Turtle Time on Fort Myers Beach Who’s Open For Business Rental Management Vacation Rental Property Management Annual Rental Management Owner’s Portal Explore Bicycle, Golf Cart & Scooter Rentals Do Something Fun See Someplace Cool Enjoy Awesome Eats Experience Exciting Events Discover the Beach Learn Island History Book Direct and Save Read All Blog Posts Turtle Time on Fort Myers Beach Who’s Open For Business About Us Contact Us Reviews Getting to Fort Myers Beach Book Direct and Save Sales Check out our Property Walkthroughs! × Leave a review! ×"
    },
    {
      "url": "https://www.calusanature.org/about/plan-your-visit/",
      "text": "About | Calusa Nature Center and Planetarium top of page Donate Nurture Nature Memberships Sponsorships Member Log In Virtual Tour Home About Us Planetarium Planetarium Schedule Sounds of the Ocean YOUniverse Nature Center Education Events & Registration Haunted Walk Holiday Lights Event Rentals Get Involved Volunteer Application Internships Careers Wish List News More Use tab to navigate through the menu items. Calusa Nature Center & Planetarium Introducing the largest green space in the City of Fort Myers Inspiring people to connect with nature History Staff Board Transparency Meet our staff Professional, passionate, and green! The Calusa Nature Center and Planetarium staff know their stuff and are excited to share their knowledge with you! Learn more about them here. Staff Eric Raddatz Executive Director eraddatz@calusanature.org Maxx Chadwick Animal Care & Internship Coordinator maxxc@calusanature.org Chris Mickolayck Marketing Manager/Administrative Assistant cmickolayck@calusanature.org Nancy Wielert Educator Carrie Nameth Education and Wildlife Director Sarah Temple Seasonal Camp Teacher cnameth@calusanature.org Todd Sherman Planetarium Supervisor tsherman@calusanature.org Kelly Paulus Animal Care Specialist/Educator kpaulus@calusanature.org Rob Mickolayck Guest Services Manager rmickolayck@calusanature.org Johnathan Hodge Planetarium Assistant jhodge@calusanature.org Marsh Greenbaum Seasonal Camp Teacher nwielert@calusanature.org Board of Trustees The Calusa Nature Center and Planetarium is grateful for the leadership of our Board of Trustees. Check out the talent that is leading us into the twenty first century! Board Executive Committee Britta Soderqvist Chair About Britta Brian Goldberg Executive Committee About Brian Kaitlin Danks Secretary About Kaitlin David Yates Executive Committee About David Carol Reynolds Treasurer About Carol Edwin (Win) Everham Executive Committee About Win Not Pictured: ​ ​ Chris Campbell ​ ​ ​ Breanna Frankel Trustees William (Bill) Hammond Trustee Emeritus Connie Bennett-Martin About Connie Susie Hassett About Susie Dick Anderson Brent Jackson Not Pictured: ​ Chris Campbell Charles Schwass Jeff Starrak ​ ​ ​ About Dick Transparency and accountability Building trust in our community is vitally important for our success. We strive to encourage investment and involvement through continued transparency on our fundraising, projects, programs, and achievements. Follow us along as we grow here! UPDATED BY-LAWS Trasparency The Calusa Nature Center and Planetarium is proud to have achieved the Candid Gold Transparency Seal for 2024. Candid (formerly GuideStar) showcases nonprofit organizations and helps them build trust through transparency in their work and financials. See more below. Read More Knowing we are a sound investment is important when you are considering where to donate your funds. To support our commitment to transparency and accountability, we made it easy to access our public 990 forms, required documentation to the IRS. You can access them below. Read More Thank you to our Sponsors & Partners Open Hours: Tuesday - Sunday: 10am - 4pm ​ Pricing: Adults $13 Children $7 Members Free Up CALUSA NATURE CENTER AND PLANETARIUM IS REGISTERED WITH THE STATE OF FLORIDA. A COPY OF THE OFFICIAL REGISTRATION (CH661) AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES BY CALLING TOLL-FREE 1-800-435-7352 WITHIN THE STATE OR VISITING WWW.800HELPFLA.COM . REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL, OR RECOMMENDATION BY THE STATE. OUR CONFIDENTIALITY POLICY, CONFLICT OF INTEREST POLICY AND WHISTLEBLOWER POLICY ARE AVAILABLE UPON REQUEST. EIN #23-7090889 Contact Us © 2024 by CNCP ​ bottom of page"
    }
  ]
}