{
  "fuentes": [
    {
      "url": "https://guidetoflorida.com/key-largo/food-drink/cc-wood-fire-eats",
      "email": "directory@guidetoflorida.com"
    },
    {
      "url": "https://guidetoflorida.com/key-largo/food-drink/cc-wood-fire-eats",
      "email": "name@yoursite.com"
    },
    {
      "url": "https://www.secureitsecurities.com/contact-us",
      "email": "info@secureitsecurities.com"
    },
    {
      "url": "https://www.giftly.com/gift-card/c-and-c-wood-fired-eats-key-largo",
      "email": "corporate@giftly.com"
    },
    {
      "url": "https://www.giftly.com/gift-card/c-and-c-wood-fired-eats-key-largo",
      "email": "merchants@giftly.com"
    },
    {
      "url": "https://firedoor.com.au/about/",
      "email": "info@firedoor.com.au"
    }
  ],
  "mails": [
    "corporate@giftly.com",
    "directory@guidetoflorida.com",
    "info@firedoor.com.au",
    "info@secureitsecurities.com",
    "merchants@giftly.com",
    "name@yoursite.com"
  ],
  "nombre_sitio": "candcwoodfiredeats.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://guidetoflorida.com/key-largo/food-drink/cc-wood-fire-eats",
      "text": "C&C wood fire eats - Guide to Florida www.guidetoflorida.com - Guide to Florida Search Home Best of Florida Best of Florida Results 2025 Best of Florida Results 2024 Best of Florida Results 2023 Best of Florida Results Best of Florida Print Annual 2024 Best of Florida Print Annual 2023 Best of Florida Print Annual Nominate a Business Vote for Your Faves How It Works Campaign Kit Stories Directory Browse Categories Browse Regions Big Bend Coastal Region Bradenton & Sarasota Region Central Panhandle Region Destin & Fort Walton Beach Region Florida Keys Region Greater Fort Lauderdale Region Greater Gainesville Region Greater Miami & Miami Beach Region Greater Orlando Region Heartland Region Jacksonville Metro & Beaches Region Lakeland & Polk County Region Nature Coast Region North Central Countryside Region Ocala, Lake & Sumter Region Palm Beach County Region Panama City & Panama City Beach Region Pensacola & Western Panhandle Region Port St. Lucie & Treasure Coast Region Southwest Florida Coast Region Space Coast Region St. Augustine Historic Coast Region St. Petersburg & Clearwater Peninsula Region Suwannee River Region Tallahassee Region List Your Business About Us Advertise Contact Us Member Login Menu Home Best of Florida Best of Florida Results 2025 Best of Florida Results 2024 Best of Florida Results 2023 Best of Florida Results Best of Florida Print Annual 2024 Best of Florida Print Annual 2023 Best of Florida Print Annual Nominate a Business Vote for Your Faves How It Works Campaign Kit Stories Directory Browse Categories Browse Regions Big Bend Coastal Region Bradenton & Sarasota Region Central Panhandle Region Destin & Fort Walton Beach Region Florida Keys Region Greater Fort Lauderdale Region Greater Gainesville Region Greater Miami & Miami Beach Region Greater Orlando Region Heartland Region Jacksonville Metro & Beaches Region Lakeland & Polk County Region Nature Coast Region North Central Countryside Region Ocala, Lake & Sumter Region Palm Beach County Region Panama City & Panama City Beach Region Pensacola & Western Panhandle Region Port St. Lucie & Treasure Coast Region Southwest Florida Coast Region Space Coast Region St. Augustine Historic Coast Region St. Petersburg & Clearwater Peninsula Region Suwannee River Region Tallahassee Region List Your Business About Us Advertise Contact Us Member Login Home United States Key Largo Food & Drink C&C wood fire eats C&C wood fire eats Share Specialty Restaurants 99201 Overseas Hwy, Key Largo, Florida, 33037 Send Message 305-451-0995 Vote for Us! | Specialty Restaurants Best of Florida Vote Confirmation × Don't show this confirmation for the next 24 hours First Name Last Name Email Address Save my information and enable one-click voting for future votes on this device. I want to receive the Guide to Florida newsletter. Please complete the reCAPTCHA challenge below. Cancel Submit Your Vote! You are voting with the email Click here to switch users. Close Overview Get Directions View On Larger Map Company Name C&C wood fire eats Visit Website http://candcwoodfiredeats.com Online Social Profiles Phone Number 305-451-0995 Location 99201 Overseas Hwy Key Largo , Florida , 33037 United States × Map View Get Directions Cancel FEATURED LISTINGS! Meat Candy BBQ Gulf Breeze, FL 32563 Website 904-445-8830 Loyd Have Mercy Restaurant Titusville, FL 32780 Website 321-223-0107 Secret Gardens Winery & Farm Sebring, FL 33875 Website 863-414-4618 READ AND REAP! Barbecue That Speaks for Itself Englewood’s Sweet Spot! Bon Voyage Without the Baggage MORE TO EXPLORE! Best of Florida Voting Best Specialty Restaurants in Florida Guide to Alabama Georgia Business Journal Guide to Florida Get the Newsletter! Click to Subscribe Guide to Florida Subscribe Submit Story Idea Contact Us 904-515-5640 Directory List Your Company Advertise Your Company Member Login Browse Categories Best of Florida Vote For Your Favorites Download Campaign Kit Nominate a Business How it Works × Member Login * Email Address * Password Need to retrieve your password? Click Here × Get the Newsletter! The security check was not completed successfully."
    },
    {
      "url": "https://www.secureitsecurities.com/contact-us",
      "text": "Contact Us - Get In Touch With Our Security Systems Company 24/7 845-445-6446 info@secureitsecurities.com 24 Hour Emergency Service About Us About Us Blog Service Areas View All Nanuet Stony Point The Fire Alarm Insider's Podcast Services Interactive Home Security Security Cameras The Fire Alarm Business Blueprint Fire Alarm & Life Safety Pearl River, NY Palisades, NY Haverstraw, NY Access Control System 24/7 Professional Monitoring Fire Alarm Monitoring Jobs at SIS SIS CORP Training Center Government Government Clients Commercial Clients Our Secured Community Smart Home Store Contact Us Buy Now About Us About Us Blog Service Areas View All Nanuet Stony Point The Fire Alarm Insider's Podcast Services Interactive Home Security Security Cameras The Fire Alarm Business Blueprint Fire Alarm & Life Safety Pearl River, NY Palisades, NY Haverstraw, NY Access Control System 24/7 Professional Monitoring Fire Alarm Monitoring Jobs at SIS SIS CORP Training Center Government Government Clients Commercial Clients Our Secured Community Smart Home Store Contact Us Login Register | Login | My Cart 0 24 Hour Emergency Service Contact Us for Security Services in Rockland County, NY Home › Contact Us for Security Services in Rockland County, NY Contact Us for Security Services in Rockland County, NY Contact Secure IT Securities for Security Solutions in Rockland County Whether you're a homeowner in Pearl River or a business owner in Rockland County, Secure IT Securities\nCorp. offers security solutions to meet your specific needs. Reach out to us for a security consultation or to request a security quote . Our staff will work closely with\nyou to understand your needs and provide the best possible security solution. You can also schedule a\nsecurity assessment, to have our experts evaluate your property and recommend the most suitable\nsecurity measures. To get started, give us a call at (845) 445-6446 or fill out form below, and we'll be in touch with you. 24 Hour Emergency Service 1 Blue Hill Plaza, Suite 1509 Pearl River, NY 10965 845-445-6446 info@secureitsecurities.com Hours Monday - Friday: 8:00 AM - 5:00 PM Saturday : 9:00 AM - 3:00 PM Sunday : CLOSED Leave A Message Contact First Name: * Last Name: * City: * Phone Number : * Email: * Message: Contact Us Secure IT Securities Corp. 1 Blue Hill Plaza #1509 Pearl River, NY 10965 info@secureitsecurities.com 845-445-6446 About Us Services Interactive Home Security Security Cameras Fire AlarmLife Safety Access Control System 24-Hour Monitoring Government Commercial Clients Return Policy Standard Service Agreement Accessibility Statement Privacy Policy Our Partners Terms Of Services Smart Home Store Contact Us Blog About Us Services Interactive Home Security Security Cameras Fire AlarmLife Safety Access Control System 24-Hour Monitoring Government Commercial Clients Blog Our Partners Return Policy Cookie Policy Contact Us New York State Fire & Security License #12000295002 | Smart Home Security Solutions in Pearl River, NY My Cart 0 By using our website, you agree to the use of cookies as described in our Cookie Policy Accept × Shopping Cart × Your cart is empty. Continue Shopping"
    },
    {
      "url": "https://www.giftly.com/gift-card/c-and-c-wood-fired-eats-key-largo",
      "text": "C&C Wood Fired Eats Gift & Greeting Cards - Email, Text or Print - 99201 Overseas Hwy, Key Largo, FL Restaurants Travel Spa & Beauty Activities Shopping Universal Brands Top Cities Multi-Place Corporate Restaurants Travel Spa & Beauty Activities Shopping Universal Brands Top Cities Multi-Place Corporate Gifts Gift Cards Key Largo Restaurants C&C Wood Fired Eats C&C Wood Fired Eats Gift Card C&C Wood Fired Eats Giftly A beautiful gift card alternative for C&C Wood Fired Eats C&C Wood Fired Eats 100% satisfaction guarantee Gift Amount $25 $50 $75 $100 $250 $500 $1000 Other Gift Design Continue 100% satisfaction guarantee Enter an amount between $5 and $1,000 Confirm Amount C&C Wood Fired Eats (301) (305) 451-0995 Categories Pizza, Pubs, New American Location 99201 Overseas Hwy, Key Largo, FL Gift Tips Try the Four Cheese Pizza drizzled with honey for a unique flavor twist that many guests rave about. Don't miss out on the impressive Meatballs Ricotta Pizza – it's a favorite among locals and visitors alike. Ask for the Cuban pizza special if you want to try a unique take on traditional pizza, it's highly recommended. Explore the house chips topped with blue cheese for a delicious appetizer to start your meal. Enjoy the happy hour specials from 4 to 6 p.m. for great deals on food and drinks. Click here to send a gift up to $1,000 with the suggestion to use it at C&C Wood Fired Eats. Is this your business? Claim your business to update business information, customize this listing, and more! Learn more about C&C Wood Fired Eats Price $$ Ambience Casual Year Established 2016 C&C Wood Fired Eats is a popular restaurant located in Key Largo, FL 33037. Known for its wood-fired pizzas and cozy ambiance, it attracts both locals and tourists looking for a relaxing dining experience. Ambiance : Casual and relaxed, C&C Wood Fired Eats offers a cozy atmosphere with a touch of Italian flair. Cuisine : Specializing in Neapolitan wood-fired pizzas, artisanal cheeses, meats, and a selection of small bites. Highlights : Notable for its unique pizza specials, extensive drink options, and friendly, attentive service. The restaurant emphasizes quality ingredients and offers various options for those seeking a casual meal with friends or family. Guests can enjoy a selection of craft beers and wines, making it an ideal spot for a laid-back evening or a festive gathering. With a menu that changes from time to time, C&C Wood Fired Eats delights diners with innovative flavors and seasonal specials. Great Alternatives Gift $100 for Italian Food Company : Indulge in the authentic flavors of Italy at Italian Food Company, a Key Largo gem serving up a delectable array of traditional dishes made with love and passion. Buy a Gift & Greeting Card for Markito's Pizza : Markito's Pizza in Key Largo offers a delicious array of handcrafted pizzas and Italian dishes that will satisfy any craving for authentic flavors. Updated: September 05, 2025 The Giftly Advantage With Giftly you strike a perfect balance, the thoughtfulness of a C&C Wood Fired Eats gift card with the flexibility of money. Easy to buy online. Have it delivered now or later Send it with a personalized greeting card 3 easy ways for your recipient to redeem the gift See a Sample Gift 100% satisfaction guaranteed No wasted balance Easy to customize How it works You customize a gift Gift up to $1,000 with the suggestion to use it at C&C Wood Fired Eats. Delivered in a personalized greeting card. They receive the gift Gifts can be sent by email, SMS*, mail or you can print it yourself. They enjoy it! They redeem the gift on our website and choose to deposit the funds in their bank account, Paypal account or to have a Visa Gift Card mailed to them. They can spend the money at C&C Wood Fired Eats or anywhere else they like! Top Related Gifts Matteo's Trattoria Italian Charm in Every Bite 233 S Federal Hwy, Boca Raton, FL 3.5 (450) • $$$ • Italian Quinto Fire-Cooked Flavors, Miami Style 788 Brickell Plz, Miami, FL 3.6 (571) • $$$ • Steakhouses Cut 432 Savor the Best in Steak and Seafood 432 E Atlantic Ave, Delray Beach, FL 4.2 (663) • $$$ • Steakhouses Mongolia Wok Savory Dishes from the Heart of Asia 1403 Lyons Rd, Coconut Creek, FL 3.1 (87) • $ • Chinese Tower Of Pizza Pizza Dreams Made Delicious 100600 Overseas Hwy, Key Largo, FL 3.5 (379) • $$ • Italian DiGiorgio's Cafe Largo Family Flavors of Italy and Beyond 99530 Overseas Hwy, Key Largo, FL 3.9 (442) • $$ • Italian Sand Bar Poolside Bites in Key Largo 97450 Overseas Hwy, Key Largo, FL 4.3 (7) • Burgers Sharkeys Savor Coastal Vibes in Key Largo 522 Caribbean Dr, Key Largo, FL 3.9 (803) • $$ • American More Nearby Businesses Eco Eats 99607 Overseas Hwy, Key Largo, FL 4.3 (64) • $$ • New American Doc's Diner 99696 Overseas Hwy, Key Largo, FL 4.2 (523) • $$ • Seafood Alfredo’s Cookhouse 102250 Overseas Hwy, Key Largo, FL 4.4 (263) • $$ • Breakfast & Brunch Mrs Mac's Kitchen II 99020 Overseas Hwy, Key Largo, FL 4.2 (891) • $$ • American Skipper's Dockside 528 Caribbean Dr, Key Largo, FL 3.8 (1.1k) • $$ • Seafood Pilot House Restaurant & Marina 13 Seagate Blvd, Key Largo, FL 3.8 (517) • $$ • Seafood Blackwater Siren 107690 Overseas Hwy, Key Largo, FL 4.3 (510) • $$ • American Gus' Grille - Reefhouse Resort & Marina 103800 Overseas Hwy, Key Largo, FL 3.5 (136) • $$ • Seafood Shipwreck's Bar & Grill 45 Garden Cove Dr, Key Largo, FL 3.9 (413) • $$ • Seafood Grati Cafe 102900 Overseas Hwy, Key Largo, FL 4.2 (94) • $$ • Juice Bars & Smoothies Buffalo Steakhouse & Seafood 103360 Overseas Hwy Ky, Key Largo, FL 3.7 (27) • $$ • Seafood Keys' Meads 99411 Overseas Hwy, Key Largo, FL 4.9 (42) • $$ • Meaderies La Marea 97450 Overseas Hwy, Key Largo, FL 2.9 (32) • $$ • Steakhouses Remedy's Nutrition 99696 Overseas Hwy, Key Largo, FL 3.6 (15) • $$ • Health Markets Buzzard's Roost Grill & Pub 21 Garden Cove Dr, Key Largo, FL 4.2 (692) • $$ • Seafood Bayside Grille & Sunset Bar 99540 Overseas Hwy, Key Largo, FL 3.7 (478) • $$ • Seafood Sal's Ballyhoo's 97860 Overseas Hwy, Key Largo, FL 4.2 (624) • $$ • Seafood Keys Bite 99000 Overseas Hwy, Key Largo, FL 4.3 (384) • $$ • American The Key Thai Restaurant & Sushi Bar 99611 Overseas Hwy Bay 5, Key Largo, FL 4.5 (143) • $$ • Sushi Bars Dennys Latin Cafe 99610 Overseas Hwy, Key Largo, FL 4.2 (322) • $$ • Cuban Sol by the Sea 97450 Overseas Hwy, Key Largo, FL 3.7 (270) • $$ • Caribbean Sundowners 103900 Overseas Hwy, Key Largo, FL 3.3 (1.1k) • $$ • Seafood Alabama Jack's 58000 Card Sound Rd, Key Largo, FL 3.7 (641) • $$ • Seafood Harriette's Restaurant 95710 Overseas Hwy, Key Largo, FL 4.4 (1.0k) • $$ • Breakfast & Brunch Tradewinds Liquors 101441 Overseas Hwy, Key Largo, FL 3.5 (22) • $$ • Beer, Wine & Spirits Mike's BBQ 101 101900 Overseas Hwy, Key Largo, FL 4.9 (109) • $$ • Food Trucks Lazy Lobster Seafood Restaurant 102770 Overseas Hwy, Key Largo, FL 4.2 (1.1k) • $$$ • Seafood Pinecrest Bakery - Key Largo 99100 Overseas Hwy, Key Largo, FL 3.3 (287) • $ • Bakeries Snappers Oceanfront Restaurant & Bar 139 Seaside Ave, Key Largo, FL 3.5 (896) • $$ • Seafood The Fish House 102401 Overseas Hwy, Key Largo, FL 4.2 (1.7k) • $$ • Seafood Sushi Sake Key Largo 103400 Overseas Hwy, Key Largo, FL 3.7 (154) • $$ • Sushi Bars The Hideout Restaurant 47 Shoreland Dr, Key Largo, FL 4.0 (338) • $$ • American Key Largo Conch House 100211 Overseas Hwy, Key Largo, FL 4.0 (920) • $$ • Seafood Mrs Mac's Kitchen - Overseas Hwy 99336 Overseas Hwy, Key Largo, FL 4.3 (2.1k) • $$ • American Num-Thai & Sushi Bar Restaurant 103200 Overseas Hwy, Key Largo, FL 4.1 (328) • $$ • Sushi Bars Hobo's Cafe 101691 Overseas Hwy, Key Largo, FL 4.4 (1.6k) • $$$ • New American Coco Plum Place 98275 Overseas Hwy, Key Largo, FL 4.6 (131) • $$ • Coffee & Tea Keys Chocolates & Ice Cream 100470 Overseas Hwy, Key Largo, FL 4.3 (355) • $$ • Ice Cream & Frozen Yogurt Sparky's Sweet Treats 99625 Overseas Hwy, Key Largo, FL 3.7 (80) • $$ • Ice Cream & Frozen Yogurt High Tide Restaurant 99411 Overseas Hwy, Key Largo, FL 4.7 (272) • $$ • Seafood Las Olas Ceviche and Sushi 97450 Overseas Hwy, Key Largo, FL 3.6 (32) • $$ • Sushi Bars Snook's Bayside Restaurant & Grand Tiki 99470 Overseas Hwy, Key Largo, FL 3.5 (1.2k) • $$$ • Bars See More Help If you have questions, need help, or want to modify, resend, or cancel a gift, please see our Support Center , where you can access an array of self-service tools and our FAQ. For other questions or issues, please contact support@giftly.com . Gift Disclosure The Giftly Prepaid Gift is redeemed for money through the Giftly website. It is not issued, endorsed, or accepted by any third-party merchant (including any third-party merchant explicitly referenced in this Giftly Prepaid Gift), and is not covered by the CARD Act. Giftly Prepaid Gifts never expire and there are no inactivity fees. Please see the Giftly Prepaid Gift Agreement for the complete terms. Pizza Pubs New American 4.5 >300 4 single place gcdp gift_and_greeting_card_in_title_tag Key Largo, FL M XS Help Help Center How Giftly works FAQ support@giftly.com Corporate Why Giftly Sign Up Log In corporate@giftly.com Merchants Customize listing Remove listing Settlement Notice FAQ merchants@giftly.com About Team Press Blog Legal Terms Privacy Gift Agreement Business categories Restaurants Travel Shopping Activities Spa & Beauty Outdoors Going Out Nationwide Brands All Business Categories Business locations Atlanta Austin Boston Chicago Dallas Denver Detroit Houston Las Vegas Los Angeles Miami Minneapolis New York Oakland Philadelphia Phoenix Portland St. Louis San Diego San Francisco San Jose Seattle Wash, DC Browse All Restaurants Seafood Steakhouses Italian French Asian Fusion Pizza Sushi Burgers Mexican Japanese All Restaurant Types Gift Ideas Multi-Place Gift Ideas The Giftly Prepaid Gift is issued by Sunrise Banks N.A., St. Paul, MN 55103, Member FDIC. * Standard data rates, fees, and charges may apply to send by text. Copyright © 2025 Giftly. All rights reserved."
    },
    {
      "url": "https://firedoor.com.au/about/",
      "text": "About Firedoor | Lennox Hastie | Firedoor Home About Chef’s Set Menu Reservations News Events Gift Shop Contact Careers Instagram MAKE A RESERVATION MAKE A RESERVATION About Us At Firedoor, we work intuitively with fire and seasonal ingredients. The kitchen is entirely powered by wood and everything is cooked to order. We burn a variety of woods daily to create embers which are then used to cook in a way that enhances the natural characteristics of the ingredients. Our kitchen is open-plan, allowing guests a clear view of the action which unfolds in the kitchen. It is important for us to invite diners into our world and show them how simple cooking can be, and how good ingredients can become great ingredients when grilled over a wood fire. Chef and owner, Lennox Hastie is fascinated by fire; his dedication and uncompromising approach has established Firedoor as an eating experience unlike anything else in town. We don’t offer fine dining and we are not entirely casual either, choosing to strike a balance somewhere between the two. With Lennox at the grill, we focus on quality ingredients grilled to order, combined with friendly, informative service led by our General Manager, Zoë Burbage. LENNOX HASTIE Owner and Chef Lennox Hastie is fascinated by fire. He spent his early career working at Michelin Star restaurants in the UK, France and Spain. Whilst he honed his skills in these kitchens, he began to lose sight of what he loved most about cooking, the ingredients. After seeking out Etxebarri, a small asador with a strong tradition of wood-fired grilling, Lennox worked with Victor Arguinzoniz, pushing the limits of what could be cooked over a wood fire. He was exposed to a form of cooking that was so completely different, beautifully complex, yet simple, one that highlighted ingredients in their most natural state. It was a turning point. What began as one year at Asador Etxebarri soon grew into five. Returning to Australia in 2011, Lennox was ready for his next challenge and joined forces with leading restaurant group, Fink. He opened Firedoor in 2015, and in 2022, he opened Gildas , a Basque-inspired wine bar in Surry Hills. In 2025, Lennox became the sole owner of Firedoor and Gildas. Lennox released his first book, Finding Fire in November 2017. Find out about the book here. Shane Hennessy Head Chef Shane Hennessy is Firedoor’s Head Chef. With a career spanning over two decades, Shane developed his skills in some of Sydney’s most prestigious kitchens, including Lucio’s, Restaurant Balzac, Bert’s Bar and Brasserie, and Berowra Waters Inn, before joining the Firedoor team in December 2022. Shane has always loved the primitive and often therapeutic nature of cooking with fire. Growing up in Wiseman’s Ferry on the Hawkesbury River, his familiarity and passion for native produce translates seamlessly to the Firedoor kitchen. Shane relishes in the challenges and triumphs of leading a team and creating a daily-changing menu where many of his favourite proteins, like native school prawns, steal the show. Zoë Burbage General Manager Zoë is the General Manager of Firedoor. Hailing from rural England, Zoë has spent the last two decades in hospitality, spending time in respected kitchens, restaurants, bars, and the chalets of the Swiss Alps. Relocating to Australia in 2011, Zoë has held managerial positions at Spice Temple and OTTO Sydney, before moving to Firedoor in January 2020. She was drawn to Firedoor’s focus on highlighting native ingredients, the theatre of the restaurant, and the strong attention to each detail of the Firedoor dining experience. Zoë is passionate about creating a connection between Firedoor’s producers and guests through storytelling. Angelica Patawaran Maitre d’ Angelica’s career in hospitality has spanned over 15 years, having opened, and managed a number of hatted venues before joining the Firedoor team. Working her way through several positions from waiter to Floor Manager, Bar Manager, joint Acting Head Sommelier and Assistant Restaurant Manager, to Restaurant Manager, before becoming Maitre d’ in 2024. Angelica, affectionately known as Gel, loves working at Firedoor because of its intimate venue space, the skills displayed in the kitchen, floor and bar, and the team that moves together as one entity to ensure the most special guest experiences. Cecilia Mungai Head Sommelier Cecilia is Firedoor’s Head Sommelier. Cecilia embodies the power of passion and dedication. Her extensive experience and vibrant personality are just the beginning. Fondly known as Ceci, she brings a wealth of knowledge from renowned restaurants around the world, including the Michelin-starred Under in Lindesnes, the Grand Café in Oslo, and Essenziale in her native Florence. Cecilia’s trajectory at Firedoor is a testament to her abilities, starting as a sommelier in 2022, swiftly moving into the role of Assistant Head Sommelier, and then Head Sommelier a year later. Passionate about engaging with guests, Cecilia seeks to understand their comfort zone and then expertly guide them outside of it to discover the incredibly diverse world of wine. Rory Cornish Restaurant Manager Rory Cornish is Firedoor’s Restaurant Manager. With over two decades of experience in the hospitality industry, Rory is dedicated to creating unforgettable guest experiences and fostering strong connections with both customers and staff. Before taking on his current role, he managed renowned venues New York, including Mulberry Project and Chinese Tuxedo. Rory also brings a wealth of international perspective to Firedoor, having spent two years with the team before becoming the Floor Manager. Prior to joining Firedoor, Rory sharpened his skills at reputable Sydney establishments such as Pellegrino 2000, Hubert, Bopp & Tone, Glebe Point Diner, and the exclusive whiskey bar Neat Peat within Crown Sydney. KEEP UP TO DATE WITH FIREDOOR Sign up to receive special news and event updates from Firedoor. Sign Up Visit Gildas , a slice of Basque Country by Lennox Hastie in the heart of Surry Hills Sitemap About News Contact Reservation Policy Privacy Policy Social location 23-33 Mary Street Surry Hills, NSW Opening Hours Open Lunch Friday and Saturday Reservations from 12pm Open Dinner Wednesday to Saturday Reservations from 5pm reservations Make a Reservation We acknowledge the Traditional Custodians of this land upon which Firedoor sits, the Gadigal of the Eora Nation. We recognise their continuing connection and unique cultural and spiritual relationship to the land, water and community. We pay our deepest respects to them and their culture, and to Elders, past, present and emerging. T. 02 8204 0800 E. info@firedoor.com.au firedoor Gildas © Firedoor 2023. All rights reserved. MAKE A RESERVATION Gift Vouchers ×"
    }
  ]
}