{
  "fuentes": [
    {
      "url": "https://jobs.raisingcanes.com/meet-our-crew",
      "email": "accommodations@raisingcanes.com"
    },
    {
      "url": "https://raisingcanes.com/contact-us/",
      "email": "213f8bb2-8d06-464f-8599-a37b6d5e8c54_contact-us@2x.png"
    },
    {
      "url": "https://raisingcanes.com/contact-us/",
      "email": "5530cf44-4c70-477e-adab-9a704375bc51_news@2x.png"
    },
    {
      "url": "https://raisingcanes.com/contact-us/",
      "email": "6d64f16d-4a07-40c4-8bcd-325dce0ab7c9_caniac-club@2x.png"
    },
    {
      "url": "https://tampamagazines.com/directory-best_city/listing/cane-barrel-rooftop-bar/",
      "email": "logo_darkmode@2x.png"
    }
  ],
  "mails": [
    "213f8bb2-8d06-464f-8599-a37b6d5e8c54_contact-us@2x.png",
    "5530cf44-4c70-477e-adab-9a704375bc51_news@2x.png",
    "6d64f16d-4a07-40c4-8bcd-325dce0ab7c9_caniac-club@2x.png",
    "accommodations@raisingcanes.com",
    "logo_darkmode@2x.png"
  ],
  "nombre_sitio": "caneandbarrelstpete.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://jobs.raisingcanes.com/meet-our-crew",
      "text": "Meet our Crew: Discover the team at Raising Cane's Careers Career Home Why Cane's Career Path Meet Our Crew Benefits Search All Jobs Search All Jobs Meet the Cane’s crew MEET OUR CREW For over 25 years, Raising Cane’s has been the top brand for quality chicken finger meals. Being the\n              best isn’t easy – and\n              we have our Crewmembers to thank for it. We’re proud to say we’ve hired and fostered the best in the\n              industry. But don’t take\n              it from us – take it from them. Apply Now Meet KATELYN – Crewmember After a big move from New York to Texas, Katelyn found much more than quick cash and a job with Cane’s.\n              She made new\n              friends, a big family and a place to call home. Play Video Meet CALEB – Crewmember Even in his first months at Cane’s, Caleb already considers it a second home, working side-by-side with\n              high school\n              classmates who have grown to be like family. Play Video Meet Keren – Crew Support Coordinator Keren originally started working at Cane's to save money for flight school. The flexibility and support\n              she's received along the way have allowed her to balance two jobs, earn her degree and pursue her\n              passion for aviation. Play Video Meet Alan – Restaurant Partner Alan's commitment to working hard and having fun has helped him become a Restaurant Partner at Cane's,\n              giving him the chance to successfully lead his Restaurant while still being fully involved as a husband\n              and father. Play Video Meet RYAN – Regional Growth Leader Starting as a 16-year-old looking for his first job, Ryan quickly realized his passion for developing\n              Crewmembers. Now\n              he grows Raising Cane’s Restaurants around the globe. Play Video Open Jobs Keyword Search Positions Near Use your location Use your location Search Search filters Filter Results State Alabama 4 Alaska 21 Arizona 64 Arkansas 17 California 103 Colorado 58 Connecticut 24 Delaware 8 District of Columbia 6 City . 1 Abilene 8 Addison 2 Albuquerque 8 Alexandria 2 Algonquin 2 Alhambra 1 Aliso Viejo 3 Allen 1 Job Type Business Unit 21 Restaurant Crew 1771 Restaurant Management 402 Support Functions 14 Department Communications 2 Growth 2 Human Resources 1 Marketing 9 Office Services 1 Operations 2084 Recruiting 2 Restaurant Development 3 Restaurant Excellence 2 Clear Filter Showing 1 - 10 of 2208 jobs Sort By Posting Date Posting Date Job Title Restaurant Zone Manager Job Location 6401 Bluebonnet #FC6, Baton Rouge LA Restaurant Management Apply Now Restaurant Manager Job Location 19110 Stone Oak Parkway, San Antonio TX Restaurant Management Apply Now Restaurant Manager - Hourly Job Location 2705 West University Dr., Denton TX Restaurant Management Apply Now Restaurant Manager Job Location 13330 Tomball Parkway, Houston TX Restaurant Management Apply Now Restaurant Manager - Hourly Job Location 1507 South Loop 288, Denton TX Restaurant Management Apply Now Restaurant Manager Job Location 12056 W 95th St, Lenexa KS Restaurant Management Apply Now Restaurant Manager Job Location 203 South Providence Road, Columbia MO Restaurant Management Apply Now Cashier Job Location 175 Highland Avenue, Seekonk MA Restaurant Crew Apply Now Cashier Job Location 157 Grandview Blvd, Madison MS Restaurant Crew Apply Now Cashier - Dinner/Close Shift Job Location 930 E. County Line Road, Ridgeland MS Restaurant Crew Apply Now Go to first page Go to previous page 1 2 3 4 5 6 7 8 9 10 Go to next page Go to last page 10 20 Terms of Use Privacy Policy Your Privacy Choices Accommodations Candidate Privacy Notice UnitedHealthcare machine-readable files (MRF) Talent Community If you have a disability and you wish to discuss potential accommodations related to applying for employment, please contact us by\n      calling 972-769-3100 (and ask for Crew Relations) or emailing accommodations@raisingcanes.com ."
    },
    {
      "url": "https://raisingcanes.com/contact-us/",
      "text": "Raising Caneâs | Contact Us | Raising Cane's Dismiss Banner Skip to main content Our Menu Locations Careers Who We Are Community Partnerships Gift Cards & Gear e-Gift Cards Caniac Club News FAQ Contact Us Order Now Our Menu Locations Careers Who We Are Community Partnerships Gift Cards & Gear Order Now Check out our Frequently Asked Questions to find the answer you are looking for. Frequently Asked Questions Want to provide feedback? Our Customer Relations team is eager to provide you with support! Use the buttons below to select the type of feedback youâd like to share.Â  Thanks for the opportunity to serve you! Check out our Frequently Asked Questions HERE to find the answer you are looking for. Speak with our Customer Support staff by calling us toll-free at: 1-833-HICANES (442-2637) Monday â Friday 8:30 AM â 9:00 PM CT Saturday â Sunday 10:00 AM â 7:00 PM CT We Support Our Crew If you have any questions or concerns, we are here for you. Employee Support Food & Locations Food & Locations Our Menu Locations Food Preparation Allergen & Nutritional Information Catering Who We Are Who We Are Who We Are Community Partnerships Why The Dog? Caniac Club News Cane's Gear Cane's Gear Gift Cards & Gear Apparel e-Gift Cards Check My Gift Card Balance Careers Careers Search Jobs Why Cane's? Benefits Resources Resources Contact Us FAQ Promotions Gift Cards Treat someone this Fall season. Shop our assortment of physical and e-gift cards now. Shop Gift Cards Caneâs Gear Show your love for Caneâs and shop the new Fall collection! Shop Cane's Gear Terms of Use Privacy Policy Do Not Sell or Share My Personal Information Accessibility Statement California Supply Chains Act Crew W-2 Portal Cookie Preferences"
    },
    {
      "url": "https://tampamagazines.com/directory-best_city/listing/cane-barrel-rooftop-bar/",
      "text": "Cane & Barrel Rooftop Bar - Tampa Magazine No Result View All Result Local Knowledge Food & Drink Home & Garden Travel Moving Tampa Sporting Health Tampa Culture ADVERTISE SUBSCRIBE ABOUT PURCHASE A COPY DIGITAL ISSUES EMAIL NEWSLETTERS CONTACT US SHOP MY ACCOUNT Your Membership Profile Update Billing Card Login / Logout No Result View All Result No Result View All Result Cane & Barrel Rooftop Bar by Tampa Magazine April 24, 2025 Share on Facebook Share on Twitter All Listings 2020-21 Tampa Bay Charity Register > Cane & Barrel Rooftop Bar Cane & Barrel Rooftop Bar Category: First Date Restaurant Food + Drink Cane & Barrel Rooftop Bar 110 2nd St. North, St. Petersburg, FL 33701 (727) 610-5427 Visit Website Back to All Listings Back to Charity Register Instagram: @CaneAndBarrel 110 2nd St. North, St. Petersburg, FL 33701 St. Petersburg, [instagram-feed] Next Post TAMPA Magazines 2023 Best of the City: Best Urgent Care Local Knowledge Food & Drink Home & Garden Travel Moving Tampa Sporting Health Tampa Culture Advertise About Subscribe Purchase a Copy Digital Issues Email Newsletters Contact Privacy Policy © 2023 Tampa Magazine. All rights reserved. Part of the Tampa Magazines Network. No Result View All Result Tampa Culture Food and Drink Home & Garden Travel Moving Tampa Sporting Health Local Knowledge Advertise About Subscribe Purchase a Copy Shop Digital Issues Email Newsletters Contact MY ACCOUNT Your Membership Profile Update Billing Card Login / Logout © 2023 Tampa Magazine. All rights reserved. Part of the Tampa Magazines Network."
    }
  ]
}