{
  "fuentes": [
    {
      "url": "https://truelinecapital.com/contact-us/",
      "email": "info@truelinecapital.com"
    },
    {
      "url": "https://www.top100golfcourses.com/golf-course/capital-city-country-club",
      "email": "v.ep.dr-v@ofwb.aa"
    },
    {
      "url": "https://clubcarwash.com/contact-us/",
      "email": "contact@clubcarwash.com"
    },
    {
      "url": "https://www.capitalcityvillage.org/pages/5-staff-and-board-of-directors",
      "email": "aileen@capitalcityvillage.org"
    },
    {
      "url": "https://www.capitalcityvillage.org/pages/5-staff-and-board-of-directors",
      "email": "info@capitalcityvillage.org"
    },
    {
      "url": "https://www.capitalcityvillage.org/pages/5-staff-and-board-of-directors",
      "email": "johanna@capitalcityvillage.org"
    }
  ],
  "mails": [
    "aileen@capitalcityvillage.org",
    "contact@clubcarwash.com",
    "info@capitalcityvillage.org",
    "info@truelinecapital.com",
    "johanna@capitalcityvillage.org",
    "v.ep.dr-v@ofwb.aa"
  ],
  "nombre_sitio": "capitalcitycc.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://truelinecapital.com/contact-us/",
      "text": "Contact us - Trueline Capital Contact us Login Builder Login Investor Login Loan Programs Construction Loans Fix-and-Flip Loans Investment/Rental Loans Bridge Loans Borrower FAQs Builder Login Invest FAQ Investor Investor Login Recently Funded About 800-292-6561 Submit Your Project Get in touch Let’s discuss your next project 800.292.6561 541.640.8636 info@truelinecapital.com Seattle Office 11624 SE 5th St, Suite 210, Bellevue, WA 98005-36426 All Loans are originated through Trueline Capital Servicer, LLC NMLS# 2008435 Sponsored MLO Kristi Richter NMLS# 215186 Fill out the form and get connected to a specialist \" * \" indicates required fields First Name * Last Name * Email Address * Phone Number Company name Your Message Name This field is for validation purposes and should be left unchanged. Submit your information All Loans are originated through Trueline Capital Servicer, LLC . – NMLS# 2697973 Sponsored MLO Kristi Richter NMLS# 2151186 Trueline Capital Submit Your Project Recently Funded Projects About Contact Loan Programs Construction Loans Fix-and-Flip Loans Investment/Rental Loans Bridge Loans Borrower FAQ Builder Login Investments Fund III – Equity Investor FAQ Investor Login Contacts 800.292.6561 541.804.7100 info@truelinecapital.com Residential – Construction Property Loans Let’s connect! Copyright © 2025 Trueline Capital Privacy Policy Terms of Service Investing in commercial real estate entails risk. Please review all offering documents for a full set of risk disclosures by calling 800.292.6561 or emailing info@truelinecapital.com. Past performance does not guarantee future results."
    },
    {
      "url": "https://www.top100golfcourses.com/golf-course/capital-city-country-club",
      "text": "Capital City Country Club | United States | Top 100 Golf Courses Courses Rankings Collections Resorts Travel News Shop Capital City Country Club Florida, United States 56 Patrick Koenig Want to play Have played Founded in 1908, Capital City Country Club quickly had an elementary golf course in operation. A 9-hole track was in use by the end of the 1920s before AW Tillighast then expanded the course to 18 holes. Overall rating 3 Overall rating 3 Capital City Country Club Florida 32301, United States capitalcitycc.com +1 850 222 0419 Founded in 1908, Capital City Country Club quickly had an elementary golf course in operation. A 9-hole track was in use by the end of the 1920s before AW Tillighast then expanded the course to 18 holes. Capital City Country Club About Reviews Architect Capital City County Club was established as Tallahassee Country Club in 1908, when a small, elementary course with sand greens was brought into play. By the end of the 1920s, a 9-hole layout was in use and the club appeared to be thriving but, in August of 1935, ownership of the course passed to the City of Tallahassee, allowing it to become a municipal facility. A. W. Tillinghast was then called in to expand the layout to a regulation 18-hole course. All went well for the next twenty years, until the City felt unable to provide much needed funding for clubhouse improvements and so the property was leased back to Tallahassee Country Club in February 1956, with the club in turn assigning its lease to a newly formed Capital City Country Club. Additional land was acquired to build a new clubhouse and swimming pool soon after the new club took control, with tennis courts following in the early 1970s. The course is set out in rolling terrain through stands of pine and oak trees with elevation changes not commonly found in the Sunshine state. Golfers have a relatively difficult start to the round, as three of the first four holes are demanding par fours, rated 1,3 and 5 on the stroke index. There’s a little respite to be found on the remainder of the front nine, before the outward half ends with an uphill par five at the 9th hole. The signature hole arrives at the 386-yard 17th, where the doglegged fairway falls down to a pond-protected putting surface. Newly planted pine trees at the kink in the fairway and a rather narrow green combine to make this one of the toughest par fours on the card. The round then concludes with a long par five which favours approach shots from the left of the fairway as a massive oak tree guards the right side of the home green. More information Architect A. W. Tillinghast Getting there Capital City Country Club Florida 32301, United States capitalcitycc.com +1 850 222 0419 View Map World Top 100 Golf Courses The latest ranking of the Top 100 Golf Courses in the World serves as the ultimate global golf bucket list. Most members of our World Top 100 Panel are seasoned golfers, each playing 20-30 of these courses annually while travelling extensively over decades to form their opinions on others. We recognise that opinions vary—even among our panel members. Rankings are subjective, and there are undoubtedly 50 or more courses in the UK and USA alone that could easily fit onto this list. Links Golf Pilgrimages The rankings View all View all Cypress Point Club California, United States Pine Valley Golf Club New Jersey, United States Royal County Down (Championship) Northern Ireland, United Kingdom Shinnecock Hills Golf Club New York, United States National Golf Links of America New York, United States Explore All Other Great Courses Nearby View all View all Southwood Florida, United States Southwood Florida, United States Previous slide Next slide About Us FAQs Advertise With Us Ranking Guidance Ranking & Rating Guidance Review Guidance Panellist Guidance Contact Us The world's largest community of traveling golfers. Enter your email address Subscribe © top 100 golf courses inc. Terms & Conditions / Privacy Policy"
    },
    {
      "url": "https://clubcarwash.com/contact-us/",
      "text": "Contact Us | Club Car Wash We use cookies to help make our site better and make your experience on our site more enjoyable. Accept X Skip to content Washes Locations News Contact Us Washes Locations News Contact Us Search Manage Membership Reach out to us using the form below! We love to hear your feedback, and we are always looking to grow and improve! You're not able to cancel your membership through this form. To cancel your membership, click the manage membership button below! Manage Membership Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone Preferred Location Select preferred location... 10084 Coors Blvd NW Albuquerque, NM 87114 1075 Diffley Rd Eagan, MN 55123 11200 Timberland Blvd Fort Worth, TX 76177 11611 S 73rd St Papillion, NE 68046 118 N Fox River Dr Appleton, WI 54915 1202 Getwell Rd Memphis, TN 38111 12035 O'Connor Rd San Antonio, TX 78233 12225 E US-290 Manor, TX 78653 12322 W US Highway 90, San Antonio, TX - Montgomery 13046 Four Star Blvd Austin, TX 78737 1305 E Imhoff Rd - Norman OK 73071 1317 N Moore Ave Moore, OK 73160 14109 Culebra Rd San Antonio, TX 78254 15490 E 120th Ave Commerce City, CO 80603 1721 N Veterans Blvd Pharr, TX 78589 1725 S Valley Mills Dr Waco, TX 76711 1821 W Tyler Ave Harlingen, TX 78550 2002 Gateway Center Dr Belvidere, IL 61008 206 N Kingshighway Cape Girardeau, MO 63701 2550 Coon Rapids Blvd NW Minneapolis, MN 55433 2651 Telegraph Rd St. Louis, MO 63125 2909 Ford St Beloit, WI 53511 3028 S Seneca St Wichita, KS 67217 3031 23rd Ave Greeley, CO 80631 307 Greenbriar Rd Normal, IL 61761 3091 Goodman Rd W Horn Lake, MS 38637 3131 S 72nd St Omaha, NE 68124 3521 S Broadway Edmond, OK 3581 Hickory Hill Rd Memphis, TN 38115 3715 Sandman Ln Columbia, MO 65201 3900 Southern Blvd SE Rio Rancho, NM 87124 3910 S McColl Rd Edinburg, TX 78539 4406 Western Ave Knoxville, TN 37921 4441 Fredricksburg Rd Balcones Heights, TX 78201 4620 Old Greenwood Rd Fort Smith, AR 72903 4675 TX-121 The Colony, TX 75056 505 E 53rd St, Davenport, IA 52807 5404 Rogers Ave Fort Smith, AR 72903 5762 Rufe Snow Dr N Richland Hills, TX 76180 6609 N 99th St Omaha, NE 68122 6627 Governors Pkwy Edwardsville, IL 62025 681 Sycamore Dr Sullivan, MO 63080 701 Hillsboro Blvd Manchester, TN 37355 7323 Fairlawn Dr San Antonio, TX 78223 7514 S Zarzamora St San Antonio, TX 78224 8274 Hwy 64 Bartlett, TN 38133 9600 Sage Rd SW Albuquerque, NM 87121 Appleton, WI - E College Ave Appleton, WI - E Longview Dr Appleton, WI - N123 Eisenhower Drive Arnold, MO - JeffCo Blvd Augusta, KS - W 7th Ave Ballwin, MO - Manchester Rd Bastrop, TX - Old Austin Hwy Bastrop, TX - State Hwy 71 Bee Cave, TX - State Hwy 71 Belleville, IL - Belleville Crossing Belleville, IL - N Green Mount Commons Dr Bellevue, NE - S 22nd St Bellevue, WI - Monroe Rd Bentonville, AR - SE Walton Blvd Bloomington, IL - E Oakland Ave Boerne, TX - 28353 IH-10 Boerne, TX - S Main St Boonville, MO - Boonslick Dr Bryan, TX - E William Joel Bryan Pkwy Bryan, TX - W Villa Maria Burleson, TX - 797 SW Wilshire Blvd Cape Girardeau, MO - N Kingshighway Cape Girardeau, MO - Siemers Dr Clarksville, TN - 1493 Madison St. Clarksville, TN - 2021 Needmore Rd College Station, TX - Farm to Market Rd 2154 Collinsville, IL - N Bluff Rd Colorado Springs, CO - 1378 Republic Dr. Colorado Springs, CO - 301 E. Fillmore St. Colorado Springs, CO - 6653 Dalby Dr. Columbia, MO - Clark Ln Columbia, MO - Conley Rd Columbia, MO - Grindstone Pkwy Columbia, MO - N Providence Rd Columbia, MO - S Scott Blvd Columbia, MO - W Worley St Coralville, IA - 2nd St Cottleville, MO - 6088 Mid Rivers Mall Dr Council Bluffs, IA - W Broadway Davenport, IA - E 53rd St Decatur, IL - E Pershing Rd Denton, TX - E University Dr Derby, KS - N Rock Rd Edinburg, TX - N Jackson Rd Edmond, OK - Kelly & Covell Edmond, OK - N Kelley Ave Edmond, OK - NW 178th St Eureka, MO - Legends Pkwy Fairview Heights, IL - 6118 Illinois Dr Farmington, MO - Maple St Fayetteville, AR - Joyce Blvd Fayetteville, AR - N College Ave Fayetteville, AR - N Crossover Rd Fayetteville, AR - W MLK Blvd Fenton, MO - Bowles Ave Fenton, MO - Majestic Dr Festus, MO - N Creek Dr Florissant, MO - N Hwy 67 Fond du Lac, WI - N Country Ln Fond du Lac, WI - N Pioneer Rd Fond du Lac, WI - W Pioneer Rd Fort Worth, TX - E Blue Mound Rd Garland, TX - Foster Rd Georgetown, TX - W University Ave Georgetown, TX - Williams Dr Grain Valley, MO - N Main St Grand Junction, CO - 2122 North Ave Grand Junction, CO - 691 24 Road Green Bay, WI - University Ave Green Bay, WI - W Mason St Hazelwood, MO - Howdershell Rd Headquarters Hewitt, TX - Hewitt Dr Houston, TX - Huffmeister Rd Hutchinson, KS - E 17th Ave Independence, MO - E 39th St Iowa City, IA - Hwy 6 Iowa City, IA - IA-1 Jacksonville, IL - W Morton Ave Kansas City, MO - Lees Summit Rd Katy, TX - Fulshear Kearney, MO - Watson Dr Kyle, TX - Kyle Centre Dr Lake St. Louis, MO - Hawk Ridge Trl Lake St. Louis, MO - Hwy N Lakewood, CO - Alameda Pkwy Lansing, KS - W Eisenhower Rd Lawrence, KS - Bauer Farm Dr Lawrence, KS - E 23rd St Leander, TX - Ronald Reagan Lebanon, MO - S Jefferson Ave Leon Valley, TX - Bandera Rd Liberty Hill, TX - W State Hwy 29 Loves Park, IL - Deery Dr Lowell, AR - N Bloomington Rd Manitowoc, WI - Calumet Ave Maplewood, MO - Maplewood Commons Dr McAllen, TX - 1300 E Jackson Rd McAllen, TX - E Ridge Rd McKinney, TX - Stacy Rd Mead, CO - Highland Dr Melissa, TX - Sam Rayburn Hwy Menasha, WI - Midway Rd Mesquite, TX - 2121 N Belt Line Rd Mesquite, TX - Buckner Blvd Mission, TX - E Griffin Pkwy Moberly, MO - Hwy 24 Moline, IL - 41st Ave Dr Moore, OK - S Eastern Ave Murfreesboro, TN - Rutherford Blvd Muscatine, IA - Park Ave Nashville, TN - 3131 Lebanon Pike Nashville, TN - 3600 Murfreesboro Pike Nashville, TN - Hwy 70 S Neenah, WI - W Winneconne Ave New Braunfels, TX - TX-46 Norman, OK - 36th Ave Norman, OK - Classen Blvd O'Fallon, IL - Frank Scott Pkwy O'Fallon, MO - Monticello Dr O'Fallon, MO - Veterans Memorial Pkwy O'Fallon, MO - W Terra Ln Oklahoma City - SE 44th St Oklahoma City, OK - N Council Rd Oklahoma City, OK - N Rockwell Ave Oklahoma City, OK - SW 89th St Oklahoma City, OK - W Reno Ave Oklahoma City, OK - Western Ave Olathe, KS - S Harrison St Omaha, NE - 18318 Evans St Omaha, NE - Gold St Omaha, NE - N 108th St Omaha, NE - N 72nd St Omaha, NE - S 72nd St Ottawa, KS - S Princeton St Overland Park, KS - W 121st St Overland Park, KS - W 95th St Pearland, TX - Pearland Pkwy Peoria, IL - N Centerway Dr Peoria, IL - Sterling Ave Peoria, IL - W Glen Ave Peoria, IL - W Holiday Dr Pflugerville, TX - TX-130 Prosper, TX - E University Dr Rogers, AR - W Hudson Rd Rolla, MO - Fairgrounds Rd Round Rock, TX - 1051 N A.W. Grimes Blvd Saginaw, TX - 100 E McLeroy Blvd Salina, KS - Market Place Salina, KS - S Broadway San Antonio, TX - 2815 SE Military Drive San Antonio, TX - Culebra Rd San Antonio, TX - Hwy 151 San Antonio, TX - Marbach Rd San Antonio, TX - Medina Base Rd San Antonio, TX - NW Military Hwy San Antonio, TX - Perrin Beitel San Antonio, TX - Potranco Rd San Antonio, TX - SW Military Dr San Antonio, TX - W Interstate 10 San Antonio, TX - W Loop 1604 San Marcos, TX - S I-35 Sedalia, MO - Wisconsin Ave Shawnee, KS - Silverheel St Shawnee, KS - W 65th St Sheboygan, WI - Vanguard Dr Sherman, TX - Texoma Pkwy Sikeston, MO - S Main St Siloam Springs, AR - E Main St Springdale, AR - 3500 S. 48th St. Springdale, AR - E Robinson Ave Springdale, AR - N 45th St Springdale, AR - N Thompson St Springfield, IL - 1640 W Jefferson St Springfield, IL - Lincolnshire Blvd Springfield, IL - N Dirksen Pkwy Springfield, IL - Veterans Pkwy Springfield, TN - Memorial Blvd St. Ann, MO - St. Charles Rock Rd St. Charles, MO - 1st Capitol Dr St. Charles, MO - Zumbehl Rd St. Louis, MO - Gravois Ave St. Louis, MO - Hampton Ave St. Louis, MO - Lusher Rd St. Louis, MO - S Lindbergh Blvd St. Robert - Hwy Z Sterling, IL - 35th Ave Stillwater, OK - E 6th Ave Stillwater, OK - N Perkins Rd Sussex, WI - W248N5221 Executive Dr Taylor, TX - N Main St Topeka, KS - NW 25th St Topeka, KS - SE California Ave Topeka, KS - SW 30th Terrace Topeka, KS - SW Topeka Blvd Troy, MO - Merlin Dr Waco, TX - N Valley Mills Dr Warehouse Warrenton, MO - N State Hwy 47 Washington, MO - Willows Ct Waterloo, IA - E San Marnan Dr Wentzville, MO - Wilmer Meadow Dr Wichita, KS - 2965 N Maize Rd Wichita, KS - 3610 N Maize Rd Wichita, KS - 47th & Broadway Wichita, KS - 7931 E 37th St N Wichita, KS - N 127th St E Wichita, KS - N Woodlawn Blvd Wichita, KS - S Rock Rd Wichita, KS - W 21st St Yukon, OK - N Mustang Rd Optional: FastPass # or Last 4 Digits of Payment Method Comment or Message * Send (833) 416 - 9975 CONTACT@CLUBCARWASH.COM COMPANY Washes Unlimited Club Locations Business Accounts Acquisitions Employee Portal Washes Unlimited Club Locations Business Accounts Acquisitions Employee Portal COMMUNITY News Fundraising Community Donations Children’s Miracle Network Hospitals News Fundraising Community Donations Children’s Miracle Network Hospitals NEED HELP? Contact Us Survey Vehicle Restrictions Privacy Policy Contact Us Survey Vehicle Restrictions Privacy Policy CAREERS Our Story Careers Our Story Careers FOLLOW US X-twitter Facebook Instagram Youtube Tiktok Email us Fill out the form below and we will reach out as soon as possible. CLOSE"
    },
    {
      "url": "https://www.capitalcityvillage.org/pages/5-staff-and-board-of-directors",
      "text": "Staff, Board of Directors and Committees - Capital City Village Skip to header Skip to main content Skip to footer Sign in Donate Now Add me to your mailing list Village Info Organizational Info Frequently Asked Questions About our Village Our Service Area Staff and Board of Directors News and Resources Membership Info Member Benefits Member Levels Membership Agreement Volunteering About Volunteering Volunteer Interest Form Providers Info About Service Providers Provider Application Form Sponsors 10th Annual Golf Tournament 11th Annual KAW \"Fun\"raiser News and Resources Connect ATX (Findhelp) Events 10th Annual Golf Tournament 11th Annual KAW \"Fun\"raiser Events Listing Events Calendar Watch Past Programs Here Newsletters News & Resources Contact Us STAFF, BOARD and COMMITTEES Executive Director, Johanna Stahl-Mandel Johanna joined CCV in March 2019 as Volunteer Director, served as Operations Director, and was appointed Executive Director of Capital City Village in January 2023. She has direct experience with Alzheimer's and Parkinson's companion support, and over 25 years of organizational development, growth, and strategic performance management across public, private and nonprofit sectors. She has a Green Belt in Lean Six Sigma from the Texas Manufacturing Assistance Center, is a Leadership Irving graduate, and has served on the Board of Examiners for the Quality Texas Foundation. Johanna holds a Bachelor of Science from Texas Tech University and Master of Public Administration from the University of Texas at Arlington. Programs and Communications Coordinator, Aileen Truax Born and raised in Houston, Aileen moved around Texas, Colorado and Ireland before finally settling down again in Austin with her husband in 2015. After earning a bachelor’s degree in political science, Aileen says she “fell into a career with nonprofits”, preferring to work with community-oriented, mission-driven organizations and the passionate people they attract.  Aileen has spent more than 20 years in management and communication roles in various nonprofits focused on healthcare, the environment, education and the arts. In her spare time, Aileen enjoys cooking, attending music festivals and ‘glamping’ with her husband of 28 years, Eric and their current four-legged companion, Sona. UT School of Social Work Intern, coming soon... BOARD OF DIRECTORS Mart Hoffman, Past President Mart is a native of Dallas and has lived in Austin since 1975.  He received his Bachelor of Arts degree from SMU, his Master of Science in Social Work from the University of Texas at Austin and his Master of Business Administration from St. Edward’s University. Mart is a retired Clinical Social Worker, Administrator and Teacher. He has also served as a Lay Leader and Stephen Minister at his church. He is one of the founding members of Capital City Village. Mart is an active camper, canoeist and golfer. He and his wife Sue have two adult children and three grandchildren. Tom McHorse Tom describes himself as married to world’s best wife, Kay. Their three sons and their families live in Austin. Tom is a semi-retired gastroenterologist, a graduate of Millsaps College and the Baylor College of Medicine. Other interests include indigent healthcare at the Voluntary Healthcare Clinic, tennis, and membership at Tarrytown United Methodist Church. Laurie Brown, Treasurer Laurie Brown joined the Finance Committee as a member during early 2021 and is currently serving the board as Treasurer.  She has a BBA and master’s in accounting from Texas State University in San Marcos. She currently works at Texas State, as both Assistant Chair and Graduate Academic Advisor in the Department of Accounting at McCoy College of Business. She has also volunteered with CCV in other capacities. Laurie has a son and daughter, both living in the Austin area. When she is not working or volunteering, she enjoys traveling, tennis, and entertaining friends and family. Michele McInroy, Chair Michele McKay (Aynesworth) McInroy, a native Texan, has a PhD. in Comparative Literature from UT/Austin and an MA in French from Yale University. She studied at the Sorbonne in Paris and at the University of Buenos Aires in Argentina, where she lived for over 20 years. With Raymond McKay, she co-founded Lincoln University College in a suburb of Buenos Aires and was a professor for eight years at Huston-Tillotson University in Austin. She has translated an Argentine novel, Mad Toy, as well as a French WWII diary, Season of Infamy. Her son Max McKay teaches at St. Hilda’s in Hurlingham, Argentina. A longtime fan of the Houston G&S Society, Michele once directed an amateur production of The Pirates of Penzance. Barbara Epstein Barbara is an Austin attorney who provides low-cost legal advice primarily to older adults. Her work history includes assignments at the General Land Office, Texas Railroad Commission, Texas Legal Services, and private practice. She has provided legal advice statewide to Area Agency on Aging benefits counselors and ombudsmen, worked closely with CMS, Social Security, Department of Aging and Disability, Health and Human Services and Adult Protective Services staff. She is a graduate of Antioch College, holds a MA in History from the University of Sussex, and a JD from the University of Texas School of Law. Sandra Frellsen Sandra Frellsen is originally from the Chicago area and moved to Austin in 2013. She is a physician board certified in Internal Medicine and Hospice in Palliative Medicine and works as a Hospice Medical Director. Sandra received her undergraduate degree from Yale University and her M.D. from the University of Chicago. She is married and has two teenagers and two dogs. Sandra is active in Scouts BSA and her hobbies include hiking, reading and knitting. Gayle Hight Gayle Hight has broad career experience in marketing, sales promotion, higher education, and financial services. Gayle earned her BS and MBA at The University of Texas at Austin and her MS from Texas Woman’s University. She is the manager for Executive Professional Development Programs and UT Austin’s Cockrell School of Engineering. For many years, Gayle was a Marketing Manager at UT Austin McCombs School of Business, where she was recognized for Outstanding Community Outreach on behalf of the University of Texas. She is active in Tarrytown Methodist Church. Her interests include graphics, branding, marketing, and messaging — also poodles and antique clocks. She has three children and six grandchildren. Sandy Morris Sandy has long held a passion for the older adult population in Central Texas, having served on the Board of another local non-profit providing a host of services and housing for older adults for 12 years. She continues to work on housing for older adults who are unhoused within our community. Her “day job” is in the electric utility industry focusing on energy policy. On the side, she enjoys painting, sketching, and she’s a world traveler, avid reader, swimmer, and loves hiking. Her degrees include a Master of Science in Community and Regional Planning from the University of Texas in Austin, and a Bachelor of Science in Civil Engineering from Texas A&M University. She loves spending time with her miniature dachshund, Justin. Clark Ross Clark, his wife Julie and his three daughters are all Aggies, love sports and doing pretty much anything outdoors. Clark graduated in 1988 with a Bachelor of Science degree in Agricultural Economics. He has owned and operated several businesses in various industries throughout his career including insurance, legal technology, and a BBQ Trailer back before BBQ trailers were cool! He sat on the board of The Central Texas Better Business Bureau for many years and was a member of the Oak Hill Planning Committee Contact Team. He is a Eucharistic Minister at his church, and volunteered as a coach for all 3 of his girls over the years. He was also President of the Sader Dad's Volunteer group at a local high school while his kids attended. COMMITTEES Development and Marketing - Chair Rebecca Farrell Ewing, Ph.D Finance - Chair Laurie Brown Governance - Chair Sandy Morris Membership Services - Chair Sue Hoffman Nominating - Chair Rick Cloud, Barbara Gamble Programs - Chair Rick Cloud Village Connections - Chair Sue Hoffman Board Secretary (non-voting) - Sue Hoffman Anyone interested in serving on a committee may contact us at info@capitalcityvillage.org and we will connect you to the committee chair. © HelpfulVillage.com - All rights reserved. Terms of Use Privacy Policy Design: HelpfulVillage.com"
    }
  ]
}