{
  "fuentes": [
    {
      "url": "https://www.gnv.it/en/gnv/the-company/gnv-passengers-and-freight",
      "email": "cargo@gnv.it"
    },
    {
      "url": "https://www.gnv.it/en/gnv/the-company/gnv-passengers-and-freight",
      "email": "info@gnv.it"
    },
    {
      "url": "https://www.callgnv.com/contact-us",
      "email": "office@gnvheatcool.com"
    },
    {
      "url": "https://www.safehavencommunityservices.org/contact",
      "email": "info@safehavencommunityservices.org"
    },
    {
      "url": "https://getvows.com/contact-us/",
      "email": "jeni@getvows.com"
    },
    {
      "url": "https://www.gnv.co.in/GNV/ContactUs",
      "email": "kiruthik@gnvcommodities.com"
    },
    {
      "url": "https://www.giftly.com/gift-card/capones-gnv-gainesville",
      "email": "corporate@giftly.com"
    },
    {
      "url": "https://www.giftly.com/gift-card/capones-gnv-gainesville",
      "email": "merchants@giftly.com"
    },
    {
      "url": "https://www.mnsi.org.uk/contact-page/",
      "email": "enquiries@mnsi.org.uk"
    },
    {
      "url": "https://www.mnsi.org.uk/contact-page/",
      "email": "enquiries@mnsi.org.uk"
    }
  ],
  "mails": [
    "cargo@gnv.it",
    "corporate@giftly.com",
    "enquiries@mnsi.org.uk",
    "info@gnv.it",
    "info@safehavencommunityservices.org",
    "jeni@getvows.com",
    "kiruthik@gnvcommodities.com",
    "merchants@giftly.com",
    "office@gnvheatcool.com"
  ],
  "nombre_sitio": "caponesnightclub.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.gnv.it/en/gnv/the-company/gnv-passengers-and-freight",
      "text": "Ships and Ferries for Passengers and Freight : Company History | GNV My Booking myGNV Departures Calendar GNV Groups Mice Cargo Request Invoice Agencies Area en English Deutsch español français italiano shqip Toggle navigation en de es fr it sq Ferry Offers BEFORE DEPARTURE ON BOARD GNV DESTINATIONS PORTS Info Point Ferry Offers Offers to Sicily Experience Sicily in September from €35 Offers to Sardinia September in Sardinia from €35 BEFORE DEPARTURE Adavantages Payment methods Advance Booking Late Check-Out Priority Disembarking Food Pass Offers Onboard Dining Presale Vehicle insurance Passenger assistance: BOOK SAFE Active Agreements Travel Tips Pregnant Women People with Reduced Mobility Onboard Services Travelling with pets Oversized Luggage Vehicles on board At the port Check-in, embarking and disembarking Maps, Ticket Offices and Ports ON BOARD Accomodations Pullman Seat And Deck Ticket Suites and cabins onboard Food Restaurant Self-service Pizzeria Bar Halal Food Steakhouse Leisure Time Children Internet Free time on board Shopping Prayers' room GNV GNV Fleet GNV Polaris GNV Orion La Suprema Excellent Excelsior Fantastic Splendid Majestic Rhapsody Caroline Russ Elizabeth Russ Forza Tenacia GNV Sirio GNV Auriga GNV Azzurra GNV Cristal GNV Antares GNV Bridge GNV Spirit GNV Sealand Golden Bridge GNV Allegra GNV Atlas GNV Blu The company The MSC Group and GNV GNV: passengers and freight Rapporto di comunità General terms and conditions of purchase for the provision of goods and services Agencies Area Escola Europeas de short sea DESTINATIONS Sicily All destinations Sicily Genoa - Palermo (city) Genova - Palermo (T.Imerese) Civitavecchia - Palermo (city) Civitavecchia - Palermo (Termini Imerese) Naples - Palermo (city) Naples - Palermo (Termini Imerese) Sardinia All destinations Sardinia Civitavecchia - Olbia Genoa - Olbia Genoa - Porto Torres Morocco All destinations Morocco Civitavecchia - Tangier Genoa - Tangier Sète - Tangier Sète - Nador Barcelona - Tangier Barcelona - Nador Genoa - Barcelona Almería - Nador Tunisia All destinations Tunisia Genoa - Tunis Civitavecchia - Tunis Palermo (city) - Tunis Balearic Islands All Balearic destinations Barcelona - Mahón (Minorca) Barcelona - Palma de Mallorca Barcelona - Ibiza Valencia - Ibiza Valencia - Palma de Mallorca Albania All destinations Albania Bari - Durres Algeria Sète-Algiers Sète-Béjaïa PORTS Liguria Genoa Algeria Algiers Béjaïa Balearic Islands Ibiza Mahón (Menorca) Palma de Mallorca Latium Civitavecchia Sicily Palermo Termini Imerese Sardinia Olbia Porto Torres Campania Naples Tunisia Tunis Morocco Nador Tangier France Sète Spain Barcelona Valencia Apulia Bari Albania Durres Info Point Contacts Still book Book with a consultant Information and bookings Claims Site Info General Conditions of Passenger Transportation Rules for use Rights of Passengers Cookie policy Unsubscription Procedure for Promotions ETS (Emission trading system) FAQ GNV Upgrade Documentation for Balearic residents Luggages Travel documents Embarking and check-in Special needs Changes and cancellations Time changes and cancellations myGNV Bookings Food service on board Disembarking Additional services Accommodations on board Vehicles Travelling with pets Travelling with children My Booking myGNV Departures Calendar GNV Groups Mice Cargo Request Invoice Agencies Area Offers to Sicily Experience Sicily in September from €35 Offers to Sardinia September in Sardinia from €35 Adavantages Payment methods Advance Booking Late Check-Out Priority Disembarking Food Pass Offers Onboard Dining Presale Vehicle insurance Passenger assistance: BOOK SAFE Active Agreements Travel Tips Pregnant Women People with Reduced Mobility Onboard Services Travelling with pets Oversized Luggage Vehicles on board At the port Check-in, embarking and disembarking Maps, Ticket Offices and Ports Accomodations Pullman Seat And Deck Ticket Suites and cabins onboard Food Restaurant Self-service Pizzeria Bar Halal Food Steakhouse Leisure Time Children Internet Free time on board Shopping Prayers' room GNV Fleet GNV Polaris GNV Orion La Suprema Excellent Excelsior Fantastic Splendid Majestic Rhapsody Caroline Russ Elizabeth Russ Forza Tenacia GNV Sirio GNV Auriga GNV Azzurra GNV Cristal GNV Antares GNV Bridge GNV Spirit GNV Sealand Golden Bridge GNV Allegra GNV Atlas GNV Blu The company The MSC Group and GNV GNV: passengers and freight Rapporto di comunità General terms and conditions of purchase for the provision of goods and services Agencies Area Escola Europeas de short sea Sicily Genoa - Palermo (city) Genova - Palermo (T.Imerese) Civitavecchia - Palermo (city) Civitavecchia - Palermo (Termini Imerese) Naples - Palermo (city) Naples - Palermo (Termini Imerese) Sardinia Civitavecchia - Olbia Genoa - Olbia Genoa - Porto Torres Morocco Civitavecchia - Tangier Genoa - Tangier Sète - Tangier Sète - Nador Barcelona - Tangier Barcelona - Nador Genoa - Barcelona Almería - Nador Tunisia Genoa - Tunis Civitavecchia - Tunis Palermo (city) - Tunis Balearic Islands Barcelona - Mahón (Minorca) Barcelona - Palma de Mallorca Barcelona - Ibiza Valencia - Ibiza Valencia - Palma de Mallorca Albania Bari - Durres Algeria Sète-Algiers Sète-Béjaïa Liguria Genoa Algeria Algiers Béjaïa Balearic Islands Ibiza Mahón (Menorca) Palma de Mallorca Latium Civitavecchia Sicily Palermo Termini Imerese Sardinia Olbia Porto Torres Campania Naples Tunisia Tunis Morocco Nador Tangier France Sète Spain Barcelona Valencia Apulia Bari Albania Durres Contacts Still book Book with a consultant Information and bookings Claims Site Info General Conditions of Passenger Transportation Rules for use Rights of Passengers Cookie policy Unsubscription Procedure for Promotions ETS (Emission trading system) FAQ GNV Upgrade Documentation for Balearic residents Luggages Travel documents Embarking and check-in Special needs Changes and cancellations Time changes and cancellations myGNV Bookings Food service on board Disembarking Additional services Accommodations on board Vehicles Travelling with pets Travelling with children +39 0102094591 Book your trip with us We are available Mon-Sun 9 am- 8 pm. GNV England +39 0102094591 GNV Italy +39 0102094591 GNV France +33186261018 GNV Spain +34 931842499 GNV Germany +496996759093 GNV Morocco +212531887010 GNV Switzerland +41565880068 GNV Belgium +3232315650 GNV Albania +35552900400 Log in to MyGnv to earn points and get a discount on upcoming trips. Did you forget your password? Don’t have an account? Register Hello, do you know when you wish to go? Select your trip Outward trip only Round Trip GNV GNV Fleet GNV Polaris GNV Orion La Suprema Excellent Excelsior Fantastic Splendid Majestic Rhapsody Caroline Russ Elizabeth Russ Forza Tenacia GNV Sirio GNV Auriga GNV Azzurra GNV Cristal GNV Antares GNV Bridge GNV Spirit GNV Sealand Golden Bridge GNV Allegra GNV Atlas GNV Blu The company The MSC Group and GNV GNV Agents Agencies' Contacts GNV Agents GNV Agents GNV Agents GNV: passengers and freight Rapporto di comunità General terms and conditions of purchase for the provision of goods and services Agencies Area Agencies' Contacts GNV Agents Escola Europeas de short sea At GNV, every moment of the journey matters. Founded in 1992, GNV (Grandi Navi Veloci SpA) is today one of the leading shipping companies in the passenger and freight transport sector. With a fleet of 26 ships and 33 routes, it connects 8 countries: Italy, Spain, France, Albania, Tunisia, Morocco, Algeria, and Malta. Part of the MSC Group, GNV is pursuing an ambitious growth plan, supported by a strategic vision focused on innovation, sustainability, and fleet renewal. Alongside passenger services, GNV has historically promoted the development of the Motorways of the Sea, supporting more sustainable mobility. Maritime freight transport offers an efficient and competitive alternative to road transport, helping reduce road congestion and environmental impact, in line with the company's commitment to increasingly responsible and environmentally conscious logistics solutions. Our History 1992: GNV is founded. 1993: the first ship of the fleet , M/n Majestic, is launched. 1999: GNV – the only one at the time among Italian shipping companies – is listed on the Stock Exchange to finance the development of its fleet, the most modern and innovative in Europe. 2003: GNV arrives in the Maghreb and inaugurates the Genoa – Tunis line. 2004: the Grimaldi family and the Private Equity funds managed by Permira reach an agreement for the further development of the company, with Permira acquiring 80% of Grandi Navi Veloci and Grimaldi Holding retaining 20%. 2006: a new shareholding structure is established; shortly before the end of the year, new partners Investitori Associati, De Agostini, Charme, and part of the management join the share capital of Grandi Navi Veloci. 2007: GNV is chosen as Best Shipping Company by travel agents, receiving the Bit Tourism Award 2007. In June, Ariodante Valeri joins the company as General Manager. 2008: the Genoa – Barcelona – Tangier line is inaugurated, starting connections with Morocco. The same year, an ad hoc service for pet owners is developed and offered to passengers on board the ships La Superba, La Suprema, Fantastic, Excellent, and Majestic. 2009: the Grimaldi family permanently leaves the shareholding structure and management of GNV. The shareholding is divided into Investitori Associati (67.1%), IDeA Co-Investment Fund (20.1%), Charme (9.2%), management (2.1%), other shareholders (1.5%). 2010: Roberto Martinoli becomes CEO of GNV. 2011: on May 2, the Extraordinary Shareholders' Meeting of GNV approves a capital increase reserved for Marinvest Srl, which is allocated a 50% shareholding in GNV. Marinvest joins the shareholding of GNV through a capital increase consisting of a mixed contribution, in cash and three ships (SNAV Toscana, SNAV Lazio, SNAV Sardegna). The new shareholding is divided between Marinvest (50%), Investitori Associati (35%), IDeA (9.2%), Charme (4.6%), and other shareholders (1.2%). 2012: on May 26, GNV inaugurates two new maritime connections between the French port of Sète and the Moroccan ports of Tangier and Nador. On August 2, 2012, the Shareholders' Meeting of GNV approves a capital increase worth 30 million euros; during the meeting, the Board of Directors is also delegated the power to carry out a possible subsequent increase of up to 20 million euros. The Company is thus owned by Marinvest (50%), Investitori Associati (43.40%), IDeA Co-Investment Fund (3.66%), Charme (1.83%), and other shareholders (1.11%). On December 20, Roberto Martinoli is appointed Chairman of the Company; Giovanni Battista Vacchi joins the Board and becomes CEO. 2013: on board GNV, the project \"SailOr, the Ship for Career and Maritime Professions Guidance\" is launched, promoted by the Liguria Region, in collaboration with the Regional School Office and supported by the Nautical Institute San Giorgio and the Hospitality Institutes Bergese and Marco Polo; the training activity involves the University of Genoa, the Italian Academy of the Merchant Marine, the Port Authority-Coast Guard, and the Auxiliary Coast Guard. On December 11, 2013, a capital increase to €169,999,988.97 is approved. The shareholding percentages are divided among Marinvest S.r.l. (57.39%), Investitori Associati (36.97%), Idea Capital Funds s.g.r. S.p.a (3.12%), Charme Investment S.C.A. (1.56%), and others (0.96%). 2014: GNV launches a project to define a new branding strategy during its repositioning process, begun with expansion into foreign markets. The project leads to a redefinition of the logo, thanks to which the Company wins two awards at the Brand Identity GrandPrix. In November, GNV presents on board the ship La Superba the 2014 Community Report, a document providing a detailed and precise analysis, in quantitative and qualitative terms, of the Company's social, economic, environmental, and cultural presence in Genoa, highlighting the deep bond between the Company and the Genoese territory. 2015: in June, GNV presents the new fleet livery to the press in the port of Genoa; the ship Rhapsody joins the fleet, and the Company inaugurates the Bari-Durrës route, GNV's first in the Adriatic. 2016: the company’s ownership changes and Pierfrancesco Vago becomes Chairman of GNV . In June, the Company wins the \"Best Ferry Company\" award at the Italia Travel Awards. 2017: GNV strengthens its offer for Morocco and in June inaugurates the new Barcelona – Nador line. The Company joins the plastic-free campaign for environmental protection promoted by the MAREVIVO association. In May, GNV again wins the \"Best Ferry Company\" award at the Italia Travel Awards. 2018: GNV is the main sponsor of Palermo Italian Capital of Culture 2018, a cross-sector project that, throughout 2018, hosts art, music, theatre, major events, meetings, conferences, and sports in the Sicilian capital. For the third consecutive year, GNV is acclaimed by travel agents and wins the \"Best Ferry Company\" award at the Italia Travel Awards. 2019: in May, GNV resumes operating the historic seasonal Genoa – Olbia line. 2020: on Monday, March 23, the M/n Splendid is delivered to the Liguria Region, ready to welcome the first COVID patients discharged from hospital: from March to June, around 200 people were hosted on board – both those in ‘protected discharge’ from hospitals, for a convalescence period before returning home, and those who had to carry out quarantine in complete isolation. The project was developed together with RINA, in close coordination with the Local Health Authority and Civil Protection; thanks to the professionalism and work of all colleagues, and to the partners who provided products and services, in just a few days GNV managed to implement an important project to counter the COVID emergency. Thanks to this experience, the Company also distinguished itself in terms of safety: in June 2020, GNV became the first shipping company to obtain the RINA Biosafety Trust Certification ; this innovative certification scheme, implemented by RINA, verifies through rigorous periodic audits the application of management systems aimed at preventing the occurrence of bacterial and viral infections, and at containing their spread if detected during the travel experience, in order to ensure the safety of passengers, employees, and crew. 2021: M/n GNV Sealand and the newbuild M/n GNV Bridge join the fleet. In June, GNV opens connections to the Balearic Islands , with routes from and to Valencia and Barcelona to Palma de Mallorca, Ibiza, and Ciutadella, offering single-leg tickets. GNV announces an order for four new ro-pax vessels with GSI shipyards in Canton, China, in collaboration with MSC Group. 2022: GNV expands its fleet with GNV Spirit, strengthening international routes, especially to Spain and Morocco, and opens new offices in Valencia. 2023: The company celebrates 30 years of activity. 2024: GNV Polaris officially joins the fleet, the first of four next-generation vessels with high environmental and passenger comfort standards, operating on the Genoa-Palermo route. 2025: In April, GNV inaugurates the new France (Sète) – Algeria (Algiers and Bejaia) route. In May, the new brand positioning is announced, with the payoff \"Every moment of the journey counts,\" emphasizing service quality, safety, sustainability, and customer care. In July, GNV Orion is baptized in Genoa, operating on the Genoa-Palermo route. The company announces an order for four additional LNG-powered ro-pax vessels. By year-end, GNV Virgo, the first LNG-powered ferry in Italy, is expected, reducing CO₂ emissions by over 50% compared to previous-generation vessels. Grandi Navi Veloci SpA, Via Balleydier 7 - 16149 Genoa - www.gnv.it Chairman: Pierfrancesco Vago Chief Executive Officer: Matteo Catani Passenger Contact Center: 010.2094591 - info@gnv.it Cargo Contact Center: 010.5509339 - cargo@gnv.it myGNV Rewards Earn points with myGNV Reserved area Regulation Info point Information and Booking Claims FAQ Request Invoice Offers Albania offers Morocco offers Sardinia offers Sicily offers Tunisia offers Routes Civitavecchia - Palermo Civitavecchia - Tunis Genoa - Palermo (city) Genoa - Porto Torres Genoa - Tangier Destinations Albania Morocco Sardinia Sicily Balearic Islands Tunisia Explore GNV MSC Group FAQ Need help? Contact us Chiama + 39 010 2094591 Write us an email Follow us on our Social Media Grandi Navi Veloci S.p.A. P.IVA 13217910150 General conditions Cargo: General terms and conditions for transport Cookie Policy RIghts of Passengers Unsubscription Procedure for Promotions Rules for use Privacy Request invoice This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."
    },
    {
      "url": "https://www.callgnv.com/contact-us",
      "text": "Contact Us | GNV Heating & Air Conditioning About Service Areas Roselle, IL Elgin, IL Barrington, IL Aurora, IL Hoffman Estates, IL Lake in the Hills, IL Algonquin, IL Glen Ellyn, IL Elmhurst, IL Carol Stream, IL Hanover Park, IL Lombard, IL Bloomingdale, IL Addison, IL Streamwood, IL Specials Faqs Reviews HVAC Heating Furnace Installation & Maintenance Furnace Repair & Replacement Heat Pump Installation & Maintenance Heat Pump Service & Conversion Heat Pump Repair & Replacement Cooling AC Installation AC Service & Repair AC Maintenance & Replacement Ductless Mini-Split Service Commercial Cooler Service Air Handler Service Thermostat Service Air Quality Indoor Air Quality Services Air Quality Testing High Efficiency Air Filters Ductwork Services Air Filtration Systems Whole House Humidifiers Dehumidifier Services HVAC Zoning Dryer Vent Cleaning Plumbing Standard and Tankless Water Heater Maintenance Water Heater Repair & Replacement Blog Contact 820 Lake Street Suite 208, Roselle, IL, 60172 Open 24/7 About Service Areas Roselle, IL Elgin, IL Barrington, IL Aurora, IL Hoffman Estates, IL Lake in the Hills, IL Algonquin, IL Glen Ellyn, IL Elmhurst, IL Carol Stream, IL Hanover Park, IL Lombard, IL Bloomingdale, IL Addison, IL Streamwood, IL Specials Faqs Reviews HVAC Heating Furnace Installation & Maintenance Furnace Repair & Replacement Heat Pump Installation & Maintenance Heat Pump Service & Conversion Heat Pump Repair & Replacement Cooling AC Installation AC Service & Repair AC Maintenance & Replacement Ductless Mini-Split Service Commercial Cooler Service Air Handler Service Thermostat Service Air Quality Indoor Air Quality Services Air Quality Testing High Efficiency Air Filters Ductwork Services Air Filtration Systems Whole House Humidifiers Dehumidifier Services HVAC Zoning Dryer Vent Cleaning Plumbing Standard and Tankless Water Heater Maintenance Water Heater Repair & Replacement Blog Contact Request  Quote Call Now: +1 (844) 468-4768 Contact Us Today! Home Contact Contact us - gnv hvac roselle il Call Us Today! +1 (844) 468-4768 Email us - gnv hvac roselle il Email Us office@gnvheatcool.com Address: 820 Lake Street Suite 208, Roselle, IL, 60172 Address 820 Lake Street Suite 208, Roselle, IL, 60172 Questions? Send Us A Message! Contact Us Full Name Phone: Email: Message: Thank you for contacting us. We will get back to you as soon as possible. Oops, there was an error sending your message. Please try again later. Call Us Today!\n+1 (844) 468-4768 Contact Us by Phone Our helpful office team is ready to answer your questions or schedule the heating or AC service you need. For after-hours requests, our answering service will quickly connect you with a technician to handle any emergency heating or AC repairs 24/7. Email Us\noffice@gnvheatcool.com Use Our Convenient Contact Form If you prefer, reach out via our easy online contact form. It’s a quick and simple way to connect with us for any non-urgent HVAC questions or service needs. Questions? Send Us A Message! We're Here to Help! Get in touch with GNV Residential Heating & Air today. We’re here to assist with all your indoor comfort needs! Call us now or Schedule an Appointment → Schedule An Appointment Call Now: +1 (844) 468-4768 About GNV Founded on a commitment to excellence, GNV Residential Heating & Air is more than just an HVAC company. Email: office@gnvheatcool.com Phone: +1 (844) 468-4768 Address: 820 Lake Street Suite 208, Roselle, IL, 60172 Heating Furnace Installation & Maintenance Furnace Repair & Replacement Heat Pump Installation & Maintenance Heat Pump Service & Conversion Heat Pump Repair & Replacement Plumbing Standard and Tankless Water Heater Maintenance Water Heater Repair & Replacement Cooling AC Installation AC Service & Repair AC Maintenance & Replacement Ductless Mini-Split Service Commercial Cooler Service Air Handler Service Thermostat Service Air Quality Indoor Air Quality Services Air Quality Testing High Efficiency Air Filters Ductwork Services Air Filtration Systems Whole House Humidifiers Dehumidifier Services HVAC Zoning Dryer Vent Cleaning Privacy Policy Terms of Use Sitemap © 2025 All Rights Reserved. Website Designed & Managed by Oamii . Share by:"
    },
    {
      "url": "https://www.safehavencommunityservices.org/contact",
      "text": "Contact Safe Haven Community Services: Get in Touch for Foster, Kinship, and Adoption Support — Safe Haven Community Services 0 Skip to Content About Services Foster Care Kinship Care Adoption Training Annual Training New Family Training New Family Training Resources Contact Information Session Volunteer Community Resources Kids Waiting For Adoption Care Giver Portal Care Giver  Portal (Extended Reach) Care Giver Portal Tutorials Family Gallery FAQs Foster FAQs Kinship FAQs Adoption FAQs Donate English Back-To-School Open Menu Close Menu Open Menu Close Menu About Services Foster Care Kinship Care Adoption Training Annual Training New Family Training New Family Training Resources Contact Information Session Volunteer Community Resources Kids Waiting For Adoption Care Giver Portal Care Giver  Portal (Extended Reach) Care Giver Portal Tutorials Family Gallery FAQs Foster FAQs Kinship FAQs Adoption FAQs Donate English Back-To-School About Folder: Services Back Foster Care Kinship Care Adoption Folder: Training Back Annual Training New Family Training New Family Training Resources Contact Information Session Volunteer Community Resources Kids Waiting For Adoption Folder: Care Giver Portal Back Care Giver  Portal (Extended Reach) Care Giver Portal Tutorials Family Gallery Folder: FAQs Back Foster FAQs Kinship FAQs Adoption FAQs Donate English Back Back-To-School We take pride in delivering exceptional customer service. We Would Love To Connect With You… If you have any questions, please don't hesitate to contact us through the contact form. You can also reach us by email or phone from 9 a.m. to 5 p.m. CST, Monday through Friday. Click on one of the forms below and we will get back to you promptly . Foster Care Foster Care Inquiry Form What services are you interested in? Foster to adopt Foster (only) Respite (only) Caregiver 1 Name * First Name Last Name Caregiver 1 DOB MM DD YYYY Caregiver 1 Phone * (###) ### #### Caregiver 1 Email * Caregiver 2 Name First Name Last Name Caregiver 2 DOB MM DD YYYY Caregiver 2 Phone (###) ### #### Caregiver 2 Email Address Address 1 Address 2 City State/Province Zip/Postal Code Country Number of beds available for foster children? * Gender preference to foster: * boy(s) girl(s) Any gender Age preference to foster: * 0-6 7-12 13-18 Any age How did you hear about us? * Parent / Friend Referral DFPS Community / Church Group Instagram Facebook X (Formally Twitter) LinkedIn YouTube Other Thank you for reaching out to Safe Haven with your foster care inquiry! We are committed to providing exceptional customer service and will respond to your inquiry as soon as possible. If you require immediate assistance, please don't hesitate to call us at 713.988.7233 (SAFE) . kinship care Kinship Care Inquiry Form What services are you interested in? Kinship-Foster to Adopt Kinship Straight to Adopt Kinship to Permanent Legal Conservatorship (PMC) Caregiver 1 Name * First Name Last Name Caregiver 1 DOB MM DD YYYY Caregiver 1 Phone * (###) ### #### Caregiver 1 Email * Caregiver 2 Name First Name Last Name Caregiver 2 DOB MM DD YYYY Caregiver 2 Phone (###) ### #### Caregiver 2 Email Address Address 1 Address 2 City State/Province Zip/Postal Code Country How did you hear about us? * Parent / Friend Referral DFPS Community / Church Group Instagram Facebook X (Formally Twitter) LinkedIn YouTube Other Name of child's kinship worker: First Name Last Name Phone of Child's kinship worker: (###) ### #### Name of caregiver(s) DFPS worker: First Name Last Name Phone of caregiver(s) DFPS worker (###) ### #### List all children placed in your care by DFPS: Child 1 First Name Last Name Child 1 DOB MM DD YYYY Child 2 First Name Last Name Child 2 DOB MM DD YYYY Child 3 First Name Last Name Child 3 DOB MM DD YYYY Child 4 First Name Last Name Child 4 DOB MM DD YYYY Child 5 First Name Last Name Child 5 DOB MM DD YYYY Child 6 First Name Last Name Child 6 DOB MM DD YYYY Thank you for reaching out to Safe Haven with your kinship care inquiry! We are committed to providing exceptional customer service and will respond to your inquiry as soon as possible. If you require immediate assistance, please don't hesitate to call us at 713.988.7233 (SAFE) . Adoption Adoption Inquiry Form What services are you interested in? Foster to adopt Straight Adopt Caregiver 1 Name * First Name Last Name Caregiver 1 DOB MM DD YYYY Caregiver 1 Phone * (###) ### #### Caregiver 1 Email * Caregiver 2 Name First Name Last Name Caregiver 2 DOB MM DD YYYY Caregiver 2 Phone (###) ### #### Caregiver 2 Email Address Address 1 Address 2 City State/Province Zip/Postal Code Country Number of beds available for adoption/foster children? * Gender preference to adopt: * boy(s) girl(s) Any gender Age preference to adopt: * 0-6 7-12 13-18 Any age How did you hear about us? * Parent / Friend Referral DFPS Community / Church Group Instagram Facebook X (Formally Twitter) LinkedIn YouTube Other Thank you for reaching out to Safe Haven with your adoption inquiry! We are committed to providing exceptional customer service and will respond to your inquiry as soon as possible. If you require immediate assistance, please don't hesitate to call us at 713.988.7233 (SAFE) . General Info General Information Name * First Name Last Name Email * Phone (###) ### #### Subject * Message * Thank you for reaching out to Safe Haven! We are committed to providing exceptional customer service and will respond to your inquiry as soon as possible. If you require immediate assistance, please don't hesitate to call us at 713.988.7233 (SAFE) . Email info@safehavencommunityservices.org Phone (713) 988-7233 (SAFE) Address 8100 Washington Ave. Suite 167 Houston, TX 77007 Sign Up For Our Newsletter Family Focused Treatment Association Partner Affiliates Texas Department of Family and Protective Services Child Welfare League of America Greater Houston Permanency Collaborative Safe Haven Community Services Safe Haven Community Services is a licensed and funded 501(c)(3) nonprofit child-placing agency under the Texas Department of Family and Protective Services EIN: 74-3025434 Additional Services Safe Haven Youth Ranch Selim Behavioral Health Contact Us 713.988.7233 (SAFE) Office Location 8100 Washington Ave, Suite 167 Houston, TX 77007 Site Home About Volunteer Family Gallery Sign Up For Our Newsletter Services Foster Care Adoption Kinship Care Training Annual Training New Family Training Donate CELEBRATING 20 YEARS OF SERVICE!"
    },
    {
      "url": "https://getvows.com/contact-us/",
      "text": "Contact Us - Get Vows Skip to content Home About GetVows Ceremonies Resources Event Staffing Contact Us Calendar New Jersey/New York Area (732) 763-2730 jeni@getvows.com Facebook Twitter Pinterest Flipboard Home About GetVows Ceremonies Resources Event Staffing Contact Us Calendar CONTACT US Send Message GET IN TOUCH If you’re interested in our services or have any questions, please reach out to us thru the contact information below or fill out our form on the right. jeni@getvows.com (732) 763-2730 New Jersey/New York Area CONTACT INFO jeni@getvows.com (732) 763-2730 New Jersey/New York Area SOCIAL Facebook Twitter Pinterest Flipboard NEED TO MAKE A PAYMENT? Payment Options Copyright © All Rights Reserved"
    },
    {
      "url": "https://www.gnv.co.in/GNV/ContactUs",
      "text": "GNV | Contact Us Home Who We Are Brands where to buy Contact Us × Modal Header Some text in the modal. Close Get in touch Submit Talk To Us +91-9755098668 +91-7607502222 +91-9600149494 Contact Us kiruthik@gnvcommodities.com Location Survey No. 120-14A, Plot Nos- 1,2,3,4,23,24,25&26, Raj Nagar Layout, Sendrambakkam Village, Chennai - 600052 Opening Hours Monday to Saturday 10:00 am to 7pm Chennai GNV COMMODITIES PVT LTD Prateek Raj Singh(Director) Survey No. 120-14A, Plot Nos- 1,2,3,4,23,24,25&26, Raj Nagar Layout, Sendrambakkam Village, Chennai - 600052 NOIDA GNV COMMODITIES PVT LTD Prateek Raj Singh(Director) C-201, Ground Floor, B Block, Sector 63, Noida, Uttar Pradesh - 201301 MUMBAI GNV COMMODITIES PVT LTD Prateek Raj Singh(Director) F-7, Hatkesh Udyog Nagar, Kashi Mira-Bhayandar Road, Mira Road (East), Thane - 401104 × About Us First and foremost, we are pet lovers. It is this emotion that drives us to bring the best of global pet care to our furry friends here in India. Contact Us Registered Office: K-1/124, LGF, Chittranjan Park, New Delhi-110019 GNV Commodities Pvt Ltd Prateek Raj Singh(Director) Chennai:9755098668 Delhi:7607502222 Mumbai:9600149494 Quick Link Home Who We Are Where to buy Contact Us Legal Terms and Condition Jurisdiction GNV Commodities Pvt.Ltd© 2018"
    },
    {
      "url": "https://www.giftly.com/gift-card/capones-gnv-gainesville",
      "text": "Capones GNV Gift & Greeting Cards - Email, Text or Print - 104 S Main St, Gainesville, FL Restaurants Travel Spa & Beauty Activities Shopping Universal Brands Top Cities Multi-Place Corporate Restaurants Travel Spa & Beauty Activities Shopping Universal Brands Top Cities Multi-Place Corporate Gifts Gift Cards Gainesville Going Out Capones GNV Capones GNV Gift Card Capones GNV Giftly A beautiful gift card alternative for Capones GNV Capones GNV 100% satisfaction guarantee Gift Amount $25 $50 $75 $100 $250 $500 $1000 Other Gift Design Continue 100% satisfaction guarantee Enter an amount between $5 and $1,000 Confirm Amount Capones GNV (0) (352) 505-9119 Categories Dance Clubs Location 104 S Main St, Gainesville, FL Click here to send a gift up to $1,000 with the suggestion to use it at Capones GNV. Is this your business? Claim your business to update business information, customize this listing, and more! Learn more about Capones GNV Buy a gift for Capones GNV. Treat your friends with a Giftly to Capones GNV, located at 104 S Main St in Gainesville, FL. With Giftly, you can purchase a Capones GNV gift online and have it delivered instantly via email or text, print it yourself at home, or have it professionally printed and delivered by mail. It's like sending a gift card or gift certificate except that the recipient has more flexibility in how they spend it. Great Alternatives Buy a Gift & Greeting Card for University Club : Experience the epitome of elegance and sophistication at University Club, Gainesville's premier destination for fine dining, socializing, and unforgettable events. Updated: September 10, 2025 The Giftly Advantage With Giftly you strike a perfect balance, the thoughtfulness of a Capones GNV gift card with the flexibility of money. Easy to buy online. Have it delivered now or later Send it with a personalized greeting card 3 easy ways for your recipient to redeem the gift See a Sample Gift 100% satisfaction guaranteed No wasted balance Easy to customize How it works You customize a gift Gift up to $1,000 with the suggestion to use it at Capones GNV. Delivered in a personalized greeting card. They receive the gift Gifts can be sent by email, SMS*, mail or you can print it yourself. They enjoy it! They redeem the gift on our website and choose to deposit the funds in their bank account, Paypal account or to have a Visa Gift Card mailed to them. They can spend the money at Capones GNV or anywhere else they like! Top Related Gifts The Peabody Daytona Beach Melody and Elegance in the Heart of Daytona 600 Auditorium Blvd, Daytona Beach, FL 3.5 (19) • $$ • Music Venues Yellow Pony Pub & Garden Savor Moments at Yellow Pony Pub 8510 NW 17th Ln, Ocala, FL 3.7 (147) • $$ • Lounges St Augustine Amphitheatre Live Music in a Historic Setting 1340 A1A S, Saint Augustine, FL 4.1 (149) • $$ • Music Venues Flutes Champagne Bar Bubbles and Bliss Await You 480 N Orlando Ave, Winter Park, FL 4.7 (43) • Wine Bars Santa Fe Bar Good Times, Great Vibes High Springs, FL 4.9 (9) • $ • Dance Clubs Superette Tasteful sips and savory bites 1511 NW 2nd St, Gainesville, FL 4.1 (107) • $$ • Wine Bars Alpin Bistro French Flavors, Local Charm 15 SW 2nd St, Gainesville, FL 4.3 (165) • $$ • Wine Bars Cry Baby's Craft Cocktails, Classic Vibes 1 West University Ave, Gainesville, FL 4.0 (138) • $$ • Cocktail Bars More Nearby Businesses Lillian's Music Store 112 SE 1st St, Gainesville, FL 3.3 (41) • $$ • Bars The Bull 18 SW 1st Ave, Gainesville, FL 4.2 (51) • $ • Pubs Havana's Wine & Cigar Bar 112 SE 1st St, Gainesville, FL 3.8 (36) • Wine Bars Mom's OG 1017 W University Ave, Gainesville, FL 4.3 (3) • Irish Pub Loosey's 120 SW 1st Ave, Gainesville, FL 4.1 (204) • $$ • Pubs Sidecar Gainesville 115 SE 1st St, Gainesville, FL 4.3 (36) • $$ • Cocktail Bars The Venue 233 W University Ave, Gainesville, FL 3.0 (5) • Music Venues Baby J’s Bar 7 W University Ave, Gainesville, FL 4.0 (20) • $$ • Cocktail Bars Jack's Bar & Grill 24 S Main St, Gainesville, FL 3.8 (6) • $ • Sports Bars New Deal Cafe 3443 W University Ave, Gainesville, FL 3.3 (94) • $$ • Wine Bars Theatre of Memory 1705 NE 6th St, Gainesville, FL 5.0 (7) • Music Venues Little Wing Studios 4430 SW 35th Ter, Gainesville, FL 5.0 (4) • Music Production Services Munegin's On 13th 4005 NW 13th St, Gainesville, FL 3.1 (17) • $ • Dive Bars Balls 1716 W University Ave, Gainesville, FL 3.8 (44) • $ • Dive Bars The Midnight 223 S Main St, Gainesville, FL 4.1 (45) • $ • Pubs Signal 7 SW 1st St, Gainesville, FL 3.0 (2) • Bars Kin Cocktail Bar 9 W University Ave, Gainesville, FL 4.8 (17) • Cocktail Bars Silver Q Billiards & Sports Bar 225 W University Ave, Gainesville, FL 4.3 (17) • $ • Pool Halls The Atlantic 15 N Main St, Gainesville, FL 3.1 (30) • $ • Music Venues Heartwood Soundstage 619 South Main St, Gainesville, FL 4.3 (6) • Venues & Event Spaces The Wooly 20 N Main St, Gainesville, FL 4.0 (11) • $ • Music Venues Kavagator Coffee Shop 185 E University Ave, Gainesville, FL 4.2 (15) • Lounges Covey Kitchen + Cocktails 1514 SW 14th St, Gainesville, FL 4.1 (111) • $$ • Cocktail Bars MacDinton's Gainesville 1728 W University Ave, Gainesville, FL 2.4 (23) • Sports Bars Visors Rooftop 4860 Steve Spurrier Way, Gainesville, FL 4.6 (5) • Sports Bars Fat Tuesday At Celebration Pointe Gainesville 4949 Celebration Pointe Ave, Gainesville, FL 3.4 (5) • Cocktail Bars Gather: Social Lounge 5020 SW 30th Ln, Gainesville, FL 3.3 (4) • Lounges Reitz Union Game Room 655 Reitz Union Dr, Gainesville, FL 4.1 (7) • $ • Pool Halls Arcade Bar 6 E University Ave, Gainesville, FL 4.0 (62) • $ • Dive Bars The Traveler Bar 101 SE 2nd Pl, Gainesville, FL 4.3 (12) • Cocktail Bars Boxcar Beer & Wine Garden 201 SE Depot Ave, Gainesville, FL 4.5 (8) • Bars The Dime Bar 4 E University Ave, Gainesville, FL 3.5 (66) • $$ • Cocktail Bars Bo Diddley Downtown Community Plaza 111 E University Ave, Gainesville, FL 3.7 (7) • Local Flavor Shamrock Irish Restaurant and Pub 1017 W University Ave, Gainesville, FL 3.0 (3) • $ • Irish Pub Main Street Bar & Billiards 108 S Main St, Gainesville, FL 3.3 (34) • $$ • Sports Bars The Backyard Bar 232 1 2 SE 1st St, Gainesville, FL 3.2 (12) • Sports Bars Raise your glass wine bar 7415 NW 4th Blvd, Gainesville, FL Wine Bars Dugout Sports Club 3501 SW 2nd Ave, Gainesville, FL 3.7 (15) • $ • Sports Bars Mother's Pub North 5109 NW 39th Ave, Gainesville, FL 2.6 (56) • $$ • Sports Bars Cantina Añejo 1680 W University Ave, Gainesville, FL 4.2 (38) • Sports Bars Stage 7 Karaoke Bar & Event Venue 4110 SW 34th St, Gainesville, FL 3.7 (39) • $$ • Karaoke Lightnin' Salvage 1800 NE 23rd Ave, Gainesville, FL 4.9 (7) • $ • Bars See More Help If you have questions, need help, or want to modify, resend, or cancel a gift, please see our Support Center , where you can access an array of self-service tools and our FAQ. For other questions or issues, please contact support@giftly.com . Gift Disclosure The Giftly Prepaid Gift is redeemed for money through the Giftly website. It is not issued, endorsed, or accepted by any third-party merchant (including any third-party merchant explicitly referenced in this Giftly Prepaid Gift), and is not covered by the CARD Act. Giftly Prepaid Gifts never expire and there are no inactivity fees. Please see the Giftly Prepaid Gift Agreement for the complete terms. Dance Clubs 0.0 0 6 single place gcdp Gainesville, FL XL S Help Help Center How Giftly works FAQ support@giftly.com Corporate Why Giftly Sign Up Log In corporate@giftly.com Merchants Customize listing Remove listing Settlement Notice FAQ merchants@giftly.com About Team Press Blog Legal Terms Privacy Gift Agreement Business categories Restaurants Travel Shopping Activities Spa & Beauty Outdoors Going Out Nationwide Brands All Business Categories Business locations Atlanta Austin Boston Chicago Dallas Denver Detroit Houston Las Vegas Los Angeles Miami Minneapolis New York Oakland Philadelphia Phoenix Portland St. Louis San Diego San Francisco San Jose Seattle Wash, DC Browse All Restaurants Seafood Steakhouses Italian French Asian Fusion Pizza Sushi Burgers Mexican Japanese All Restaurant Types Gift Ideas Multi-Place Gift Ideas The Giftly Prepaid Gift is issued by Sunrise Banks N.A., St. Paul, MN 55103, Member FDIC. * Standard data rates, fees, and charges may apply to send by text. Copyright © 2025 Giftly. All rights reserved."
    },
    {
      "url": "https://www.mnsi.org.uk/contact-page/",
      "text": "Contact Us | Get in touch | MNSI Contact Us | Get in touch | MNSI Skip to content Skip to main menu We're always looking to improve our website. If you spot an issue please email: Enquiries@mnsi.org.uk . News, events and blog Jobs Accessibility MNSI Menu Search Menu About us Our team Our governance HSIB legacy For families Investigation overview for families Consent Investigation process for families Information in other languages and formats Help and support for families NHS Resolution Early Notification scheme Family feedback For NHS Investigation overview for NHS Refer a case to us Investigation process for NHS Information collection Staff interviews Help and support for NHS staff Staff feedback Health Equity Assessment and Resource Toolkit (HEART) and Health Equity Warning Score (HEWS) Information sharing between MNSI and CQC For other professionals Coroners Police service Position statement for regulatory bodies Publications Work with us Jobs Subject Matter Advisors Contact us Make a complaint about MNSI About us Our team Our governance HSIB legacy For families Investigation overview for families Consent Investigation process for families Information in other languages and formats Help and support for families NHS Resolution Early Notification scheme Family feedback For NHS Investigation overview for NHS Refer a case to us Investigation process for NHS Information collection Staff interviews Help and support for NHS staff Staff feedback Health Equity Assessment and Resource Toolkit (HEART) and Health Equity Warning Score (HEWS) Information sharing between MNSI and CQC For other professionals Coroners Police service Position statement for regulatory bodies Publications Work with us Jobs Subject Matter Advisors Contact us Make a complaint about MNSI News, events and blog Jobs Home > Contact us Contact us You can contact us by email or using the form on this page. You can find out how to ask us for information we hold on our Information requests page. Email Enquiries@mnsi.org.uk Alternatively, please use this form. Name* Email* Subject* Message* Privacy policy accepted MNSI Get in touch Contact us Share family feedback Share NHS staff feedback Statements Accessibility Privacy notice Modern slavery and human trafficking statement enquiries@mnsi.org.uk Share this page: X Share on Twitter LinkedIn Share on LinkedIn Facebook Share on Facebook WhatsApp Share on whatsapp Email Share over email © 2025 MNSI. All rights reserved."
    }
  ]
}