{
  "query": "casaespanatapasyvinos.com email",
  "fuentes": [
    {
      "url": "http://casaespanatapasyvinosweston.com.siterate.org/",
      "email": "noc@cloudflare.com"
    },
    {
      "url": "http://casaespanatapasyvinosweston.com.siterate.org/",
      "email": "rir@cloudflare.com"
    },
    {
      "url": "https://www.trustindex.io/reviews/casaespanatapasyvinosweston.com",
      "email": "info@trustindex.io"
    }
  ],
  "mails": [
    "rir@cloudflare.com",
    "info@trustindex.io",
    "noc@cloudflare.com"
  ],
  "nombre_sitio": "casaespanatapasyvinos.com",
  "origen_extraccion": "Busqueda externa paso: email",
  "textos_fuente": [
    {
      "url": "http://casaespanatapasyvinosweston.com.siterate.org/",
      "text": ""
    },
    {
      "url": "https://www.trustindex.io/reviews/casaespanatapasyvinosweston.com",
      "text": "Casaespanatapasyvinosweston.com Reviews 2025 | Trustindex.io - Trustindex.io Categories For Businesses For Businesses Categories Food, Beverages & Tobacco Bakery & Pastry casaespanatapasyvinosweston.com casaespanatapasyvinosweston.com Reviews Good rating 4.1 | 36 reviews Verified Company casaespanatapasyvinosweston.com Visit this website Write a review Reviews 4.1 | 36 total 5 stars 28 pcs 4 stars 0 pc 3 stars 0 pc 2 stars 1 pc 1 star 7 pcs Source filter 36 pcs Verified All languages English (22 pcs) Spanish (14 pcs) Rafael Betancourt 2024.12.21 Qué gusto, muy muy bueno Useful Report Cristian Gonzalez 2024.12.15 Excelente local de eventos, los salones tienen una muy buena acústica tanto para la música en vivo como la música envasada. La barra funcionando en todo momento y la comida muy muy buena… 👍🏼 Useful Report Michael Mathura 2024.11.05 Lo mejor en Bonaventure en eventos recomendado 100% Useful Report Iván Vargas 2024.09.29 Bonaventure 19th is hands down the best spot in Weston! From the moment you walk in, you’re greeted with a warm and inviting atmosphere that makes you feel right at home. The decor is charming, and the staff treats you like family, ensuring that every visit is a delightful experience.\n\nThe menu offers a fantastic variety of dishes that are both delicious and beautifully presented. Whether you’re in the mood for a hearty meal or a light snack, there’s something for everyone. I highly recommend trying their signature dishes – you won’t be disappointed!\n\nWhat truly sets Bonaventure 19th apart is the sense of community. It’s a place where friends and families gather, making it perfect for any occasion. The live music adds an extra touch, creating a lively yet relaxed vibe.\n\nIf you’re looking for a place to eat and feel at home, Bonaventure 19th is the perfect choice. I can’t wait to return! Useful Report Advertisement Luis Vera 2024.08.20 Useful Report Tony Moonen 2024.07.18 Useful Report Oscar HENAO 2024.06.11 Bonaventure 19th is definitely one of the best places in Weston, FL, to hold any business meeting, business expo, formal or casual dining or any other business, social, or family celebration. Totally recommended! Recent significant improvements make it the venue of choice for anyone! Useful Report Miryam Miranda 2024.06.09 Useful Report Advertisement Carol Chenoweth 2024.06.09 The worst experience that I ever had in a restaurant. The food was very mediocre, poor quality and tasteless.\nThe Manager of the restaurant was rude, offensive and very disrespectful. He's a very poor choice for any business to be successful. Useful Report Annie Olin 2024.06.08 Last Friday we had 40 women,s party, one of their appetizers crroqueta de Jamon was very salty and they burn 🔥 t when they fried them, it was disgusting, !!! the manager instead of coming and spologize for the inconvenience or offer something else hey wanted to charge us for these dishes were like 3 orders, dish that we returned because it was disgusting!! He came to the stage where the DJ was singing to speak in front of everybody to say he was NOT going to take those plates from the bill and it had to be paid but he was cursing and speaking very aggressive, it was really really very bad experience!!  They should fire that manager!! Very unpolite!!  I think a place like this deserves better management?! Hope this gets to the owners!! Useful Report Rocio Sherwood 2024.06.08 Last Friday we celebrated a birthday party at the Bonaventure 19th! We were a group of 35 ladies.My friend ordered Croketas and  asked the waiter to change the dish since it was too salty and for medical reasons, she can no eat too much salt. The waiter came back from the kitchen with the same plate on his hands and stated: \"Chef said ...that is the way the croketas are made\" we can not take it back\".!!! We were having a blast, we were dancing at the moment, when the music stopped and the Manager grabbed the microphone to interrupted the music and started yelling and using offensive words against all of us. He did not only disrespected us,  but the entire people that was dining that night felt offended and expressed us their discomfort. \"..I am a customer service manager for a well known retail store, Customers are the most important for me and for everyone who run a business, without customers there is not business. There is not reason to badly misbehave and miss-treated your guests the way this manager did it. It was heartbreaking to hear that someone has  been verbally abused. And the only reason I am writing  this review is to express my deep concern not about the food but the poor management of the restaurant. I travel all around the world just to eat, and all I am use to is just the most amazing hospitality. This Señor should not be dealing with people at all. Useful Report Ana Ruth 2024.06.07 The worst experience ever. We were a group of about 35 ladies celebrating the month birthdays. The food wasn't good and we were treated poorly and disrespectful by the manager. Useful Report Advertisement Karim C 2024.06.07 La peor experiencia. En cualquier restaurant te permiten devolver un plato que está salado y te lo cambian u ofrecen otra alternativa. Pues eso no pasó con el restaurant Bonaventure 19th. El administrador no sólo no permitió la devolución del plato sino tomó el micrófono del DJ y en frente de todos los comensales calumnió y maltrató de una manera totalmente grosera no sólo a las personas de nuestro evento sino a todos los comensales. Que indignante espectáculo! Useful Report Ave Alfaro 2024.06.02 The current administrator is a disrespectful and uneducated person, he disrespected the group of ladies who were celebrating a birthday. Useful Report yolanda leib 2024.06.01 The worst Rest the new management is so rude 😒 I don't recommend Useful Report Basil Mathura 2024.03.22 this place is amazing welcome back weston Useful Report Reply from casaespanatapasyvinosweston.com 2024.03.25 Thank you very much for your kind words, we hope to see you soon Advertisement Derek Hughes 2024.03.10 We eat lunch here on Saturday with our kids.  The staff were very friendly and attentive.  The chef made us delicious thin-sliced eggplant chips, lightly breaded and fried crispy, drilled with honey.  My ground chicken sandwich with caramelized onions was mouth watering.  My girls enjoyed the French fries, sweet potato fries and chicken tenders, which all had just the right amount of crispness.  Next visit I can’t wait to try the paella, which smelled amazing, and that fresh ceviche. Useful Report Reply from casaespanatapasyvinosweston.com 2024.03.11 We are thrilled to hear that you and your family enjoyed your dining experience at Bonaventure 19th! Thank you for taking the time to share your positive feedback. We look forward to serving you again soon. ELIAS CABRERA 2024.02.24 Excellent Useful Report Reply from casaespanatapasyvinosweston.com 2024.02.26 We appreciate your positive feedback, Elias! Thank you for choosing Bonaventure 19th. Hector Romero 2024.02.17 La mejor atención y la comida es de otro nivel, la presentación y sabor son lo máximo, felicidades al chef Jose Baiocchi. Useful (2) Report Reply from casaespanatapasyvinosweston.com 2024.02.17 Thank you for your kind words, Hector! We're thrilled to hear that you enjoyed our exceptional service and delicious food. We'll be sure to pass along your compliments to Chef Jose Baiocchi. We appreciate your support and hope to see you again soon at Bonaventure 19th. Roman Novoa 2024.01.30 Just Deliciously. I recently had the pleasure of dining at Bonaventure 19th and enjoyed the cozy ambiance. I was greeted by an attentive and friendly staff member who guided and served me well. José A. was my waitress. I had lentil soup, and I had fish. I can't remember the name of the fish entree, but it was delicious. The price-value ratio was great, and I will certainly come back. Bonaventure 19th is a hidden gem that has earned its place in my heart as a must-visit destination for any food lover. FYI, they offer a  Happy hour with an amazing 2x1 drink. I will have my Old Parr there pretty soon, for sure. Useful (1) Report Reply from casaespanatapasyvinosweston.com 2024.01.31 Thank you for your positive review of Bonaventure 19th, Roman! We're thrilled to hear that you enjoyed our cozy ambiance and friendly staff. We're glad José A. provided excellent service during your visit. It's great to know that you found our fish entree delicious and enjoyed the price-value ratio. We appreciate your recommendation and look forward to serving you again soon. Don't forget to check out our Happy Hour for some amazing 2x1 drinks. See you soon! Advertisement More Company activity Claimed Profile Displaying Reviews Top Rated Certificate About casaespanatapasyvinosweston.com <a href='https://casaespanatapasyvinosweston.com/' target='_blank'>https://casaespanatapasyvinosweston.com/</a> Advertisement Contact casaespanatapasyvinosweston.com +1 954-892-4183 Location HQ Address 200 Bonaventure Blvd, Weston 33326, United States Trustindex for Business 600.000+ businesses use Trustindex to collect and display Google reviews easily. Create a Free account TOP 5 Trustindex Features 100+ Review Platforms 40 Breathtaking review widgets Easy review collection Review image generator Review e-mail signatures Create a Free account Welcome My reviews Log out Login for Reviewers To write a review, you can log in here. Login Skyrocket Your Sales with Customer Reviews. No coding required. Create a Free Account Email support@trustindex.io Free Workshop Book an appointment now About Us Trustindex Ltd. Cheapest Review Management Software 1095 Budapest, Hungary\n                                Lechner Ödön fasor 3. support@trustindex.io Trustindex Community Copyright © 2025 All Rights Reserved www.trustindex.io | info@trustindex.io Trustindex Prices About Us Resources Contact Affiliate Program For Businesses Login Sign Up Terms of Use Privacy Policy Review Guidelines Google Seller Rating FAQ For Reviewers Login Review Guidelines Categories Trustindex"
    }
  ]
}