{
  "fuentes": [
    {
      "url": "https://guidetoflorida.com/st-augustine/food-drink/casadevino57",
      "email": "directory@guidetoflorida.com"
    },
    {
      "url": "https://guidetoflorida.com/st-augustine/food-drink/casadevino57",
      "email": "name@yoursite.com"
    },
    {
      "url": "https://www.casadelvino.com.au/contact-us/",
      "email": "info@casadelvino.com.au"
    },
    {
      "url": "https://www.visitstaugustine.com/restaurant/casa-de-vino-57",
      "email": "info@casadevino57.com"
    },
    {
      "url": "https://www.vilaviniteca.es/en/quienes-somos",
      "email": "eshop@vilaviniteca.es"
    },
    {
      "url": "https://www.casadevinos.com.au/contact-us",
      "email": "sales@casadevinos.com.au"
    }
  ],
  "mails": [
    "directory@guidetoflorida.com",
    "eshop@vilaviniteca.es",
    "info@casadelvino.com.au",
    "info@casadevino57.com",
    "name@yoursite.com",
    "sales@casadevinos.com.au"
  ],
  "nombre_sitio": "casadevino57.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://guidetoflorida.com/st-augustine/food-drink/casadevino57",
      "text": "Casa De Vino 57 - Guide to Florida www.guidetoflorida.com - Guide to Florida Search Home Best of Florida Best of Florida Results 2025 Best of Florida Results 2024 Best of Florida Results 2023 Best of Florida Results Best of Florida Print Annual 2024 Best of Florida Print Annual 2023 Best of Florida Print Annual Nominate a Business Vote for Your Faves How It Works Campaign Kit Stories Directory Browse Categories Browse Regions Big Bend Coastal Region Bradenton & Sarasota Region Central Panhandle Region Destin & Fort Walton Beach Region Florida Keys Region Greater Fort Lauderdale Region Greater Gainesville Region Greater Miami & Miami Beach Region Greater Orlando Region Heartland Region Jacksonville Metro & Beaches Region Lakeland & Polk County Region Nature Coast Region North Central Countryside Region Ocala, Lake & Sumter Region Palm Beach County Region Panama City & Panama City Beach Region Pensacola & Western Panhandle Region Port St. Lucie & Treasure Coast Region Southwest Florida Coast Region Space Coast Region St. Augustine Historic Coast Region St. Petersburg & Clearwater Peninsula Region Suwannee River Region Tallahassee Region List Your Business About Us Advertise Contact Us Member Login Menu Home Best of Florida Best of Florida Results 2025 Best of Florida Results 2024 Best of Florida Results 2023 Best of Florida Results Best of Florida Print Annual 2024 Best of Florida Print Annual 2023 Best of Florida Print Annual Nominate a Business Vote for Your Faves How It Works Campaign Kit Stories Directory Browse Categories Browse Regions Big Bend Coastal Region Bradenton & Sarasota Region Central Panhandle Region Destin & Fort Walton Beach Region Florida Keys Region Greater Fort Lauderdale Region Greater Gainesville Region Greater Miami & Miami Beach Region Greater Orlando Region Heartland Region Jacksonville Metro & Beaches Region Lakeland & Polk County Region Nature Coast Region North Central Countryside Region Ocala, Lake & Sumter Region Palm Beach County Region Panama City & Panama City Beach Region Pensacola & Western Panhandle Region Port St. Lucie & Treasure Coast Region Southwest Florida Coast Region Space Coast Region St. Augustine Historic Coast Region St. Petersburg & Clearwater Peninsula Region Suwannee River Region Tallahassee Region List Your Business About Us Advertise Contact Us Member Login Home United States Florida Food & Drink Casa De Vino 57 Casa De Vino 57 Share 2025 Best of Florida Regional Winner Bars 57 Treasury St, Saint Augustine, Florida, 32084 Send Message 904-217-4546 Vote for Us! | Bars Best of Florida Vote Confirmation × Don't show this confirmation for the next 24 hours First Name Last Name Email Address Save my information and enable one-click voting for future votes on this device. I want to receive the Guide to Florida newsletter. Please complete the reCAPTCHA challenge below. Cancel Submit Your Vote! You are voting with the email Click here to switch users. Close Overview Get Directions View On Larger Map Company Name Casa De Vino 57 Visit Website https://www.casadevino57.com Online Social Profiles Phone Number 904-217-4546 Location 57 Treasury St Saint Augustine , Florida , 32084 United States About Casa De Vino 57 Enjoy a bottle of wine, cheese and charcuterie, and music nestled in a secluded courtyard in the heart of downtown St Augustine. × Map View Get Directions Cancel FEATURED LISTINGS! Pink Fire Pizza North Port, FL 34287 Website 9415646151 Loyd Have Mercy Restaurant Titusville, FL 32780 Website 321-223-0107 The Boathouse On Naples Bay Naples, FL 34102 Website 239-643-2235 READ AND REAP! Englewood’s Sweet Spot! Southern Comfort With a Side of Soul! Barbecue That Speaks for Itself MORE TO EXPLORE! Best of Florida Voting Best Bars in Florida Guide to Alabama Georgia Business Journal Guide to Florida Get the Newsletter! Click to Subscribe Guide to Florida Subscribe Submit Story Idea Contact Us 904-515-5640 Directory List Your Company Advertise Your Company Member Login Browse Categories Best of Florida Vote For Your Favorites Download Campaign Kit Nominate a Business How it Works × Member Login * Email Address * Password Need to retrieve your password? Click Here × Get the Newsletter! The security check was not completed successfully."
    },
    {
      "url": "https://www.casadelvino.com.au/contact-us/",
      "text": "Contact Us | Casa Del Vino Skip to content Search for: Home About Us Our Menu Contact Us Bookings BEST TABLE IN TOWN Contact Us Contact Us admin 2025-05-15T14:33:31+10:00 Contact Details +61 420 440 772 [email protected] 1/127 Kent Street, Millers Point New South Wales 2000 Send Us a Message Feel to get in touch with us. we are always happy to answer your questions or discuss your ideas × Address: 1/127 Kent Street, Millers Point New South Wales 2000 Copyright 2023 Casa Del Vino | All Rights Reserved | Powered by SWE Go to Top"
    },
    {
      "url": "https://www.visitstaugustine.com/restaurant/casa-de-vino-57",
      "text": "Casa de Vino 57 | Visit St. Augustine Skip to main content Weddings Map & Guide Request Visitor's Info Things to Do ALL Things to Do Attractions Coupons & Deals Family Fun Ghost Tours Golfing Museums Night Life Recreation Shopping Tour Services Transportation Water Tours Weddings ALL Categories Places to Stay ALL Places to Stay Bed and Breakfasts Camping Condos and Resorts Hotels / Motels Pet Friendly Vacation Rentals Waterfront Eat & Drink ALL Restaurants Bars & Pubs Breakfast Family Dining Fine Dining Food Trucks Happy Hour Seafood Spanish ALL Categories Events Seasonal Events ALL Events Featured Events Sing Out Loud Music Festival Festivals LIVE Music Live Entertainment Arts & Culture Historical Events Sports & Outdoors For Kids Weddings Local Things to Do Food Events Event Venues Live Music ALL Live Music Blues Bluegrass Caribbean Comedy Country Easy Listening Electronic Folk Hip Hop Jazz Latin Pop R&B Rock Relocation Moving to St. Augustine? Featured Communities Neighborhoods Regions Guide Apartments Homes Construction Contractors Government Services Healthcare Home Services Lenders Places of Worship Real Estate Services Schools Utilities Search Casa de Vino 57 Offering a variety of wines to taste and purchase in historic downtown. Casa de Vino 57 (904) 217-4546 57 Treasury Street St. Augustine, FL 32084 Mon: 2:00 pm - 9:00 pm Tue: Closed Wed - Thu: 2:00 pm - 9:00 pm Fri - Sat: 2:00 pm - 11:00 pm Sun: 2:00 pm - 9:00 pm View Google Map Share This +2 more What was once a late-night conversation about owning a wine business came to fruition in 2018. For many years Terry and Patti, now owners of Casa de Vino 57, would dream about opening a wine house to introduce boutique wines to experienced wine devotees and newbies who wanted to learn. While on a trip to St. Augustine, they saw a \"For Lease\" sign, and a bulb above Patti's head lit up. They signed a lease and Casa de Vino 57 came to life. This local destination is a cozy historic house where guests can peruse the large selection of whites or reds from around the world, while enjoying a glass of wine with a cheese and charcuterie board in their beautiful backyard which also hosts local musicians. Located on Treasury Street, Casa de Vino 57 has a designated wine consultant with more than 40 years of experience, Wayne Lake. They celebrate happy hour from 4:00 to 6:00 p.m. on Sunday, Monday, Wednesday, and Thursday. Casa de Vino 57 offers wine tastings and accepts group reservations. Upcoming Live Music Wayne Lake Saturday, September 13th, 2025 2:30 pm - 5:30 pm Grant Peeples Saturday, September 13th, 2025 6:00 pm - 7:00 pm Trouble ON2 Saturday, September 13th, 2025 7:30 pm - 8:30 pm Wayne Lake Saturday, September 13th, 2025 9:00 pm - 10:00 pm Ivan Smith Sunday, September 14th, 2025 4:00 pm - 7:00 pm Bob Patterson Saturday, September 20th, 2025 6:00 pm - 7:00 pm Jolie Saturday, September 20th, 2025 7:00 pm - 10:00 pm Jolie Friday, September 26th, 2025 7:00 pm - 10:00 pm Bret Blackshear Saturday, September 27th, 2025 2:30 pm - 5:30 pm Bad Dog Mama Saturday, September 27th, 2025 7:00 pm - 10:00 pm Wayne Lake Sunday, September 28th, 2025 4:00 pm - 7:00 pm Bad Dog Mama Friday, October 3rd, 2025 7:00 pm - 10:00 pm Pagination Page 1 Next page ›› Casa de Vino 57 (904) 217-4546 57 Treasury Street St. Augustine, FL 32084 Mon: 2:00 pm - 9:00 pm Tue: Closed Wed - Thu: 2:00 pm - 9:00 pm Fri - Sat: 2:00 pm - 11:00 pm Sun: 2:00 pm - 9:00 pm Share This Profile Keywords Shopping Wine & Liquor Live Music Bar / Lounge / Pub Happy Hour Historic Downtown Things to Do nearby GhoSt Augustine: The Original Haunted Pub Tour within 1 block GhoSt Augustine within 1 block City Gate within 1 block St. George Street within 1 block Related categories Seafood Family Fare Bar / Lounge / Pub Breakfast Fine Dining Spanish Live Entertainment Italian Show 46 more Show 46 less Steaks Chinese C Catering Food Trucks Asian Fusion Bagels Bakery Barbeque British Brunch Burgers Cajun/Creole Caribbean Coffee / Espresso Country Food Cuban Deli Doughnuts Fast Food French German Gluten-free Greek Happy Hour Hot Dogs Ice Cream Indian Irish Japanese Latin American Mediterranean Mexican Pancakes/Waffles Pizza Polish Sandwiches Soul Food Soup & Salad Southern Sports Bar Sushi Tapas Thai Vegan Friendly Vegetarian Waterfront Request Visitor Information Request St. Augustine FREE information, direct to your inbox. Request Information Things to Do ALL Things to Do Attractions Tour Services Night Life Recreation Shopping Weddings Places to Stay ALL Places to Stay Bed & Breakfasts Condos & Resorts Hotels & Motels Pet Friendly Vacation Rentals Waterfront Eat & Drink ALL Restaurants Seafood Fine Dining Bar / Lounge / Pub Breakfast Family Fare Food Trucks Events ALL Events Featured Events Live Music Festivals Concerts Local Events Seasonal About Us About Visit St. Augustine Request Visitor Info Accessibility Statement Advertise with Us List your Business Submit an Event Map & Guide © 2003-2025 Visit St. Augustine — Designed & hosted by St. Augustine Web Design in beautiful St. Augustine Florida . Home Things to Do ALL Things to Do Attractions Family Fun Ghost Tours Golfing Tour Services Specialty Tours Shopping Museums Night Life Recreation Transportation Weddings LIVE Music ALL Categories Places to Stay ALL Places to Stay Bed and Breakfasts Condos and Resorts Hotels / Motels Pet Friendly Vacation Rentals Waterfront Camping Eat & Drink ALL Restaurants Bars & Pubs Breakfast Family Dining Fine Dining Food Trucks Happy Hour Seafood Spanish ALL Categories Events ALL Events 4th of July Fireworks Featured Events Festivals LIVE Music Live Entertainment Arts & Culture Historical Events Sports & Outdoors For Kids Weddings Seasonal Events Local Things to Do Food Events Event Venues LIVE Music ALL LIVE Music Blues Bluegrass Caribbean Comedy Country Easy Listening Electronic Folk Hip Hop Jazz Latin Pop R&B Rock Relocation Moving to St. Augustine? Featured Communities Neighborhoods Regions Guide Apartments Homes Construction Contractors Government Services Healthcare Home Services Lenders Real Estate Services Schools Utilities Deals & Coupons ALL Deals Attractions Hotels Night Life Recreation Restaurants Shopping Tour Services Weddings About Us Map & Guide"
    },
    {
      "url": "https://www.vilaviniteca.es/en/quienes-somos",
      "text": "Who we are The store will not work correctly in the case when cookies are disabled. JavaScript seems to be disabled in your browser. For the best experience on our site, be sure to turn on Javascript in your browser. Buy wines , sparkling wines ,& spirits , with free shipping to the Peninsula from €59.95 Buy wines , sparkling wines , & spirits , \r\n          with free shipping to the Peninsula from €59.95. Buy wines , sparkling wines ,& spirits , with free shipping to the Peninsula from €59.95 English Català Español Create Account / Login My Cart EN PRIMEUR Wines Sparkling wines Spirits Gourmet & Accesories El Club Tastings and events Who we are New products Professional area Home Who we are Fundada en 1932, en el barrio del Born de Barcelona Vila Viniteca es detallista, distribuidora, mayorista, importa y exporta. WHO WE ARE HISTORY PIONEER PROJECTS AND WINE CULTURE GROUP COMPANIES Who we are Founded in 1932, in the Born district of Barcelona, and managed by the 3rd generation, Vila VIniteca is one of the most important distributors of fine wines in Europe. Vila Viniteca is a retailer, distributor, wholesaler, importer and exporter and collaborates in different wine projects together with some of the most renowned winemakers in Spain. It currently has 10,500 wines and spirits and is considered one of the most important distributors of wines, spirits and gourmet products in Europe. Specifically, its gastronomic offer is based on more than 400 mature cheeses, the best hams and the most exclusive preserves and gourmet products. Vila Viniteca has shops and local offices in Catalunya and Madrid. Its 12,000 m2 logistics warehouse is located in Esparreguera (Barcelona), with a capacity for 6,000 pallets and a million bottles in stock. For delivery, it has its own fleet of 55 vehicles that deliver orders in 24-48 hours, reaching more than 1,000 deliveries a day (more than 50,000 bottles a day). Its wine shops and gastronomy shops, located in Barcelona's emblematic Born neighborhood, are a reference and meeting point for fans and gourmets. In May 2013, Vila Viniteca opened El Mostrador in the Salamanca neighborhood of Madrid. A meeting point for wine lovers, where we carry out wine tastings and tastings with the help of our sommeliers and the most reputable winegrowers and winemakers. History Founded in 1932, in the Born district of Barcelona, the « Vila » grocery store was already selling cases of wine and liquor to restaurants in the area in its early days. In 1993, Joaquim Vila teamed up with Francisco Martí - owner of the Ca N'Estruc winery in Esparreguera (Barcelona), whose family had been linked to the world of wine since 1548 - and they opened a new wine shop also in Agullers street, right next to the gastronomy shop. Over the years, they have expanded their offer, selecting emerging producers and adding them to their catalogue of exclusive wines. Currently, Vila Viniteca exclusively represents some of the best Spanish and international wineries and its greatest strength is distribution to the best restaurants and hotels. Pioneer In 1997 Vila Viniteca was the first Spanish company in the sector to have a website. In 2000 it was also a pioneer in Spain in offering the possibility of buying wines En Primeur, a common practice in prestigious areas such as Bordeaux, but which is relatively new in our country. Vila Viniteca works with more than 14 national wineries, 4 foreign wineries and offers more than 100 Bordeaux wines, as well as a parallel sale of wines from the acclaimed Château Latour. Since 2017, this initiative has been joined by the successful Bourgogne Wine Presale which, in its latest edition, offers wines from 28 domaines alongside 10 fantastic Rhône wineries. In 2021, it launched for the first time a Special Presale of 11 of America's most desirable wineries, which was repeated in 2022 with 13 wineries and in 2023 with 12 n 2008, Vila Viniteca created an unprecedented competition in Spain in terms of the prize money (40,000 euros) and the number of pairs (120 in each edition): the Vila Viniteca a Tasting Contest in Pairs, which is held annually in Barcelona and Madrid alternately. Projects and wine culture As part of its mission to promote and disseminate wine culture, Vila Viniteca includes an important wine tasting programme. From wine tasting initiations and monographic tastings of different areas or wineries, to pairing dinners with the most renowned winemakers. It also organises free presentations and tastings with the participation of national and international oenologists. Since 2000, it has been organising La Música del Vi, an internationally acclaimed event where wineries present the latest vintages of their wines and which is attended by more than 3,000 professionals. It is held every two years at the Llotja de Mar in Barcelona and is attended by an average of 230 wineries from 32 Spanish appellations and from countries such as the United States, New Zealand, South Africa, Slovenia, Turkey, France, Italy, Austria, Germany, Argentina and Portugal. From the concern to go a little further in the world of sensory perception and with the intention of improving the experience of the end consumer, in 2017, he created the Vila Viniteca Tasting Panel. It was made up of 15 professionals who were trained for two years to become expert tasters. They were able to answer questions such as: How does the temperature of the wine affect us? How do we perceive sugar and acidity? How is a wine best preserved once it has been opened? To decant or not to decant? And to decant a champagne? All Vila Viniteca products can be found in the extensive catalogue, which is illustrated each year by a great artist with an exclusive work. The year 2022 marked the 31st anniversary of its publication and so far these are the artists who have collaborated in this union between wine and art: Perico Pastor, Juliet Pomés Leiz, Xano Armenter, Javier Mariscal, Francesc Artigau, Guinovart, Arranz-Bravo, Robert Llimós, Medina-Campeny, Jordi Labanda, Miguel Rasero, Julio Vaquero, Santi Moix, Frederic Amat, Eduardo Arroyo, Joaquim Chancho, Carmen Galofré, Luis Gordillo, Milo Manara, José Manuel Broto, Moebius, Ferran García Sevilla, Bosco Sodi, Antonio López, Francisco Ibáñez, Juan Genovés, Perejaume, Juan Uslé, Lita Cabellut, Jaume Plensa and Miquel Barceló. This 2023, the artist who illustrates the catalogue is Joan Miró. Vila Viniteca has also collaborated with El Bulli Foundation in the preparation of Sapiens del Vino, a work divided into several volumes that aims to bring together the minimum knowledge necessary to understand the world of wine and the role it plays in a gastronomic context. A multidisciplinary team made up of scientific researchers, sommeliers, chefs, philosophers, historians and stylistic correctors has been involved in the writing of the book.  Vila Viniteca also has a collaboration agreement based on a Schoolarship agreement with Outlook Wine. Group companies Vila Viniteca participates in different wine-growing projects in association with some of the most renowned winemakers in Spain. These wines and cavas are exclusively distributed nationally and internationally. They produce the wines of Ca N'Estruc (DO Catalunya), L'Origan (DO Cava), El perro verde (DO Rueda), Fenomenal (DO Rueda), El Jardín de Lucía (DO Rías Baixas), Paxaro Tolo (DO Ribeira Sacra), Sospechoso (VT Castilla y León), Venta las Vacas (DO Ribera del Duero), Paisajes (DOCa Rioja), La Locomotora (DOCa Rioja), Viña al Lado de la Casa (DO Yecla), Viña Detrás de la Casa (DO Yecla), El Hombre Bala (DO Vinos de Madrid), La Mujer Cañón (DO Vinos de Madrid) and Reina de los Deseos (DO Vinos de Madrid) os de Madrid). It also has two distributors of great wines that are part of the group and are centred in Barcelona, Madrid, Girona and Tarragona. Both represent emblematic wineries exclusively for the province. It has a young independent commercial and administrative team and takes advantage of the infrastructure and logistics of Vila Viniteca. Get a Quote for Customer Name Customer Email Phone Number Comment Submit Our offer Our offer Bourgogne and Rhône wines En Primeur Wines En Primeur Great White Wines En Primeur Black Friday Shops El Club Help Help Frequently Asked Questions Shipping costs Legal warning Terms and Conditions Privacy Policy Cookie Policy Cookies configuration Sitemap Contact Contact Contact us through our chat , email [email protected] or by calling us at 937 777 017 . Monday to Friday from 9:00 a.m. to 6:00 p.m. GMT+2 WORK WITH US Find out how to become part of our team Secure payment Secure payment Vila Viniteca Vila Viniteca Agullers, 7 - 08003 Barcelona T. 937 777 017 [email protected] Vila Viniteca, Agullers 7, 08003, Barcelona Tel. 93 777 70 17 © Vila Viniteca 1997-2022. All rights reserved - Todos los derechos reservados Verify your age You must be at least 18 years old to purchase and enjoy our wines, spirits and gourmet products. By continuing, you confirm you are of legal drinking age."
    },
    {
      "url": "https://www.casadevinos.com.au/contact-us",
      "text": "Casa de Vinos - Contact Us Skip to main content FREE SHIPPING WITHIN AUSTRALIA FOR RETAIL ORDERS OVER $200 Facebook Twitter Youtube Instagram Contact Wholesale Newsletter Whisky Tastings Vouchers WSET Spirits Education 0 My Cart $0.00 Need help? 61 3 9681 8006 GO Exciting & New New Products Collectors Sullivans Cove Aberlour 15 Years Old 2008 ARTIST 14, 700ml $799.00 Add to Cart Rum/Rhum Browse All Agricole Blended Single Important Brands Neisson Caroni Hampden Samai Rum Night Rambler Transcontinental Rum Line 700 ml $80.00 Add to Cart Aperitif/Digestif Clase Azul Japanese Whisky Browse All Akkeshi Chichibu Kanosuke Nikka Yuza Ichiro's Malt and Grain World Blended Whisky 700ml $145.00 Add to Cart Scotch Whisky Brands Browse All Popular Springbank Balvenie Ben  Nevis Benriach Bowmore Bruichladdich Caol Ila Clynelish Glenfiddich Highland Park Laphroaig Macallan Regions Campbeltown Whisky Highlands Whisky Islands Whisky Islay Whisky Lowlands Whisky Speyside Whisky Independent Bottlers LMDW Signatory Vintage Auld Alliance Casa de Vinos Christian Dully Christian Dully Elixir Distillers Hidden Spirits Jack Wiebers Precious Liquor Sansibar Whisky Shinanoya Spirits Shop Selection The Nectar The Whisky Agency Valinch and Mallet Watt Whisky Night Rambler Transcontinental Rum Line 700 ml $80.00 Add to Cart Spirits All Whisky American Whiskey World Whisky Irish Whiskey Australian Whisky Blended Whisky Scotch Whisky Rum/Rhum Agave Tequila Mezcal Brandy Armagnac Cognac Calvados Vodka Liqueurs Gin Clase Azul ReposadoPure Blue Agave Tequila 200ml $140.00 Add to Cart Contact Wholesale Newsletter Whisky Tastings Vouchers WSET Spirits Education Exciting & New New Products Collectors Sullivans Cove Rum/Rhum Browse All Agricole Blended Single Important Brands Neisson Caroni Hampden Samai Rum Aperitif/Digestif Clase Azul Japanese Whisky Browse All Akkeshi Chichibu Kanosuke Nikka Yuza Scotch Whisky Brands Browse All Popular Springbank Balvenie Ben  Nevis Benriach Bowmore Bruichladdich Caol Ila Clynelish Glenfiddich Highland Park Laphroaig Macallan Regions Campbeltown Whisky Highlands Whisky Islands Whisky Islay Whisky Lowlands Whisky Speyside Whisky Independent Bottlers LMDW Signatory Vintage Auld Alliance Casa de Vinos Christian Dully Christian Dully Elixir Distillers Hidden Spirits Jack Wiebers Precious Liquor Sansibar Whisky Shinanoya Spirits Shop Selection The Nectar The Whisky Agency Valinch and Mallet Watt Whisky Spirits All Whisky American Whiskey World Whisky Irish Whiskey Australian Whisky Blended Whisky Scotch Whisky Rum/Rhum Agave Tequila Mezcal Brandy Armagnac Cognac Calvados Vodka Liqueurs Gin Contact Wholesale Newsletter Whisky Tastings Vouchers WSET Spirits Education Home Contact Us Casa de Vinos - Whisky - South Melbourne - Australia Location: 283 Coventry Street, South Melbourne, 3205, Victoria By Phone: +61 (3) 9681 8006 Opening Hours Monday: 10am - 5pm Tuesday: 10am - 5pm Wednesday: 10am - 5pm Thursday: 10am - 5pm Friday: 10am - 8pm Saturday: 10am - 7pm Sunday: 11am - 6pm *CLOSED All Public Holidays Email Enquiry Form Complete this form to email us your enquiry. First Name Required Surname Contact Phone Number Email Address Required Preferred Method of Contact Email Phone Message Service My Account Track Order Resolution Centre About Us About Us Contact Us Information Terms of Use Privacy Policy Returns Policy Security Policy Casa de Vinos Lounge Our Tastings This online store is part of Casa de Vinos Pty. Ltd, Liq License Number 31960790. Casa de Vinos Supports the responsible service of alcohol. Warning Under the Liquor Control Reform Act 1998 it is an offence To supply alcohol to a person under the age of 18 years [Penalty Exceeds $6000] For a person under the age of 18 to purchase or receive liquor [ Penalty exceeds $500] 61 3 9681 8006 sales@casadevinos.com.au 283 Coventry Street, South Melbourne, 3205, Victoria Facebook Twitter Youtube Instagram © 2025 Casa de Vinos. ABN: 78075570669. All rights reserved. Bank Deposit Retail Web Payments Web Payments American Express - Retail MasterCard PayPal Checkout Visa Terms & Conditions × Welcome to our website. If you continue to browse and use this website, you are agreeing to comply with and be bound by the following terms and conditions of use, which together with our privacy policy govern Casa de Vinos’s relationship with you in relation to this website. If you disagree with any part of these terms and conditions, please do not use our website. The term ‘Casa de Vinos’ or ‘us’ or ‘we’ refers to the owner of the website whose registered office is . Our ABN is 78075570669. The term ‘you’ refers to the user or viewer of our website. The use of this website is subject to the following terms of use: The content of the pages of this website is for your general information and use only. It is subject to change without notice. Neither we nor any third parties provide any warranty or guarantee as to the accuracy, timeliness, performance, completeness or suitability of the information and materials found or offered on this website for any particular purpose. You acknowledge that such information and materials may contain inaccuracies or errors and we expressly exclude liability for any such inaccuracies or errors to the fullest extent permitted by law. By proceeding with your purchase, you acknowledge that you are over 18 years of age. You further acknowledge that your order must be received by someone over 18 years old Your use of any information or materials on this website is entirely at your own risk, for which we shall not be liable. It shall be your own responsibility to ensure that any products, services or information available through this website meet your specific requirements. This website contains material which is owned by or licensed to us. This material includes, but is not limited to, the design, layout, look, appearance and graphics. Reproduction is prohibited other than in accordance with the copyright notice, which forms part of these terms and conditions. All trademarks reproduced in this website, which are not the property of, or licensed to the operator, are acknowledged on the website. Unauthorised use of this website may give rise to a claim for damages and/or be a criminal offence. From time to time, this website may also include links to other websites. These links are provided for your convenience to provide further information. They do not signify that we endorse the website(s). We have no responsibility for the content of the linked website(s). Your use of this website and any dispute arising out of such use of the website is subject to the laws of Australia. Close Privacy Policy × This privacy policy sets out how we uses and protects any information that you give us when you use this website. We are committed to ensuring that your privacy is protected. Should we ask you to provide certain information by which you can be identified when using this website, then you can be assured that it will only be used in accordance with this privacy statement. We may change this policy from time to time by updating this page. You should check this page from time to time to ensure that you are happy with any changes. What we collect We may collect the following information: name and job title contact information including email address demographic information such as postcode, preferences and interests other information relevant to customer surveys and/or offers What we do with the information we gather We require this information to understand your needs and provide you with a better service, and in particular for the following reasons: Internal record keeping. We may use the information to improve our products and services. We may periodically send promotional emails about new products, special offers or other information which we think you may find interesting using the email address which you have provided. From time to time, we may also use your information to contact you for market research purposes. We may contact you by email, phone, fax or mail. We may use the information to customise the website according to your interests. Security We are committed to ensuring that your information is secure. In order to prevent unauthorised access or disclosure, we have put in place suitable physical, electronic and managerial procedures to safeguard and secure the information we collect online. How we use cookies A cookie is a small file which asks permission to be placed on your computer's hard drive. Once you agree, the file is added and the cookie helps analyse web traffic or lets you know when you visit a particular site. Cookies allow web applications to respond to you as an individual. The web application can tailor its operations to your needs, likes and dislikes by gathering and remembering information about your preferences. We use traffic log cookies to identify which pages are being used. This helps us analyse data about webpage traffic and improve our website in order to tailor it to customer needs. We only use this information for statistical analysis purposes and then the data is removed from the system. Overall, cookies help us provide you with a better website by enabling us to monitor which pages you find useful and which you do not. A cookie in no way gives us access to your computer or any information about you, other than the data you choose to share with us. You can choose to accept or decline cookies. Most web browsers automatically accept cookies, but you can usually modify your browser setting to decline cookies if you prefer. This may prevent you from taking full advantage of the website. Links to other websites Our website may contain links to other websites of interest. However, once you have used these links to leave our site, you should note that we do not have any control over that other website. Therefore, we cannot be responsible for the protection and privacy of any information which you provide whilst visiting such sites and such sites are not governed by this privacy statement. You should exercise caution and look at the privacy statement applicable to the website in question. Controlling your personal information You may choose to restrict the collection or use of your personal information in the following ways: whenever you are asked to fill in a form on the website, look for the box that you can click to indicate that you do not want the information to be used by anybody for direct marketing purposes if you have previously agreed to us using your personal information for direct marketing purposes, you may change your mind at any time by writing to or emailing us. We will not sell, distribute or lease your personal information to third parties unless we have your permission or are required by law to do so. We may use your personal information to send you promotional information about third parties which we think you may find interesting if you tell us that you wish this to happen. If you believe that any information we are holding on you is incorrect or incomplete, please write to or email us as soon as possible at the above address. We will promptly correct any information found to be incorrect. Close"
    }
  ]
}