{
  "fuentes": [
    {
      "url": "https://casacook.com/information/contact-us",
      "email": "development@casacollectivehotels.com"
    },
    {
      "url": "https://casacook.com/information/contact-us",
      "email": "marketing@casacollectivehotels.com"
    },
    {
      "url": "https://casamarinaresort.com/contact-us/",
      "email": "casa_marina_resort@hilton.com"
    },
    {
      "url": "https://casamarinaresort.com/contact-us/",
      "email": "daniella@dtcreative.co"
    },
    {
      "url": "https://casamarinaresort.com/contact-us/",
      "email": "katie@dtcreative.co"
    },
    {
      "url": "https://marinafiestaresort.com/contact-us",
      "email": "reservations@marinafiestaresort.com"
    },
    {
      "url": "https://www.restauranttucasa.com/contactus",
      "email": "info@restauranttucasa.com"
    },
    {
      "url": "https://www.casagrand.co.in/about-us/management-page/",
      "email": "sales@casagrand.co.in"
    },
    {
      "url": "https://www.casamarinabeachhotel.com/contact_us.asp",
      "email": "info@vacationstoremiami.com"
    },
    {
      "url": "https://www.casamarinabeachhotel.com/contact_us.asp",
      "email": "reservations2@vacationstoremiami.com"
    },
    {
      "url": "https://www.lacasaamman.com/en/contact_us.html",
      "email": "info@lacasaamman.com"
    },
    {
      "url": "https://www.lacasaamman.com/en/contact_us.html",
      "email": "info@thimpress.com"
    },
    {
      "url": "https://americanahotel.co.uk/contact-us/",
      "email": "info@americanahotel.co.uk"
    },
    {
      "url": "https://avion-hotel-mumbai.hotelsgds.com/contact-us/",
      "email": "avion-hotel-mumbai-2@hotelsgds.com"
    },
    {
      "url": "https://avion-hotel-mumbai.hotelsgds.com/contact-us/",
      "email": "info-2@hotelsgds.com"
    },
    {
      "url": "https://www.casamarinareefresort.com/contact_us.asp",
      "email": "reservations2@vacationstoremiami.com"
    },
    {
      "url": "https://www.casamarinahotel.com/contact",
      "email": "agavin@casamarinahotel.com"
    },
    {
      "url": "https://www.casamarinahotel.com/contact",
      "email": "aperkner@casamarinahotel.com"
    },
    {
      "url": "https://www.casamarinahotel.com/contact",
      "email": "mvandeloo@casamarinahotel.com"
    },
    {
      "url": "https://www.casamarinahotel.com/contact",
      "email": "vmartin@casamarinahotel.com"
    }
  ],
  "mails": [
    "agavin@casamarinahotel.com",
    "aperkner@casamarinahotel.com",
    "avion-hotel-mumbai-2@hotelsgds.com",
    "casa_marina_resort@hilton.com",
    "daniella@dtcreative.co",
    "development@casacollectivehotels.com",
    "info-2@hotelsgds.com",
    "info@americanahotel.co.uk",
    "info@lacasaamman.com",
    "info@restauranttucasa.com",
    "info@thimpress.com",
    "info@vacationstoremiami.com",
    "katie@dtcreative.co",
    "marketing@casacollectivehotels.com",
    "mvandeloo@casamarinahotel.com",
    "reservations2@vacationstoremiami.com",
    "reservations@marinafiestaresort.com",
    "sales@casagrand.co.in",
    "vmartin@casamarinahotel.com"
  ],
  "nombre_sitio": "casamarinahotel.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://casacook.com/information/contact-us",
      "text": "Contact us for Reservations, Restaurants & Spa Enquiries | Casa Cook Our Hotels Casa Cook El Gouna Casa Cook Madonna Casa Cook North Coast Casa Cook Rhodes Casa Cook Samos All Hotels Offers About Contact us Home Contact us contact us Book your stay Where Select accommodation Casa Cook Rhodes Casa Cook El Gouna Casa Cook Madonna Casa Cook North Coast Casa Cook Samos Select your dates Who Rooms – + DO YOU HAVE A CODE? book now × reach out to us For any questions or further information, we’re here to help. Get in touch by phone or email, and let us make your stay as relaxing as possible. Casa Cook El Gouna call property (+20) 120 811 62 35 Casa Cook North Coast call property (+20) 100 363 4003 Casa Cook Rhodes call property (+30) 22410 56333 Casa Cook Samos call property (+30) 2273440300 CASA COOK MADONNA call property (+39) 0465 364010 other contacts Business Development Enquiries development@casacollectivehotels.com Marketing & PR Enquiries marketing@casacollectivehotels.com manage your booking Change your reservation, update details or make special requests. We’re here to ensure your Casa Cook experience is exactly as you envision it. manage my booking Casa Cook El Gouna Casa Cook Madonna Casa Cook North Coast Casa Cook Rhodes Casa Cook Samos About us Manage my Booking Company Information Contact us Career Sitemap explore our other brand Privacy Policy Cookie Policy User Generated Content Casa Cook, All rights reserved Select Accommodation Please select a hotel from the list before continuing. Select Dates Please select a date range before continuing."
    },
    {
      "url": "https://casamarinaresort.com/contact-us/",
      "text": "Contact Us - Casa Marina Key West, Curio Collection by Hilton Skip to content Contact Location Gallery Offers Contact Location Gallery Offers Check Rates Check-in/out Rooms Rooms 1 2 3 4 5 6 7 8 9 Contact Location Gallery Offers Toggle Navigation Our Resort Resort Overview Resort Amenities Map of Resorts History Photo Gallery News Stay Rooms & Suites Overview Beachfront Suites Special Amenities Special Offers Dining Recreation Recreation Overview Event Calendar Resort Day Pass Live Beach Cam Meetings & Events Meetings Overview Meeting Guide Banquet/Dining Menus Group Offers Weddings Weddings Overview Wedding Celebrations Menus Spa Spa Al Maré Spa Packages Make a Reservation Toggle Navigation Our Resort Resort Overview Resort Amenities Map of Resorts History Photo Gallery News Stay Rooms & Suites Overview Beachfront Suites Special Amenities Special Offers Dining Recreation Recreation Overview Event Calendar Resort Day Pass Live Beach Cam Meetings & Events Meetings Overview Meeting Guide Banquet/Dining Menus Group Offers Weddings Weddings Overview Wedding Celebrations Menus Spa Spa Al Maré Spa Packages Contact Us casamarinares 2024-08-05T14:27:43-04:00 We Want to Hear from You First Name (Required) Last Name (Required) Email Address (Required) Phone Reason for Contacting Us* (Required) Reason for contacting us: Hotel Stay Wedding Business Meeting Special Event Other Message CAPTCHA Casa Marina Key West, Curio Collection by Hilton 1500 Reynolds Street Key West, Florida 33040 USA Tel: +1.305.296.3535 Press & Media Inquiries Katie Lisi at Katie@DTcreative.co Daniella Turchin at Daniella@DTcreative.co General Hotel Information Casa_Marina_Resort@Hilton.com Current Key West Weather Key West Climate Averages in Key West > Arrivals By Land: Enjoy a 160 scenic drive from Miami, over 42 bridges with scenic views. By Sea: Key West Express Ferry servicing Ft. Myers and Marco Island By Air: 2.7 miles to Key West international Airport Get Directions Key West Location Casa Marina Key West, Curio Collection by Hilton 1500 Reynolds Street Key West, Florida 33040 USA Tel: +1.305.296.3535 Get Directions | Map of Resorts Contact Us Site Map Web Accessibility Careers Press Contact Us Site Map Web Accessibility Careers Press Hilton Honors Discount Terms & Conditions Global Privacy Statement Site Usage Agreement Modern Slavery and Human Trafficking Personal Data Requests Hilton Honors Discount Terms & Conditions Global Privacy Statement Site Usage Agreement Modern Slavery and Human Trafficking Personal Data Requests © Casa Marina Key West, Curio Collection by Hilton | All Rights Reserved | Produced by MGR Consulting Group Page load link Go to Top"
    },
    {
      "url": "https://marinafiestaresort.com/contact-us",
      "text": "Get in Touch | Downtown Cabo Hotel | Marina Fiesta Resort +1 (844) 278 6596 BOOK NOW STAY Stay Experience luxurious accommodations at Marina Fiesta Resort in Cabo San Lucas. Choose from a variety of spacious suites with stunning marina views. EXPLORE ALL Nautical Suites Grand Luxe Suite Multibedroom Suites EXPERIENCE Experience Experience the vibrant heart of Cabo San Lucas at Marina Fiesta Resort & Spa. Amenities Things to Do Activities Shopping Cart DINING Cuisine Indulge in a culinary adventure at Marina Fiesta Resort Cabo San Lucas. With a variety of restaurants to choose from, you're sure to find something to satisfy your cravings. Dine Out All Inclusive Plan On-site Restaurants Off-site Restaurants AMURA SPA MEET & CELEBRATE OFFERS Special Offers Don't miss out on these incredible offers! Book your dream Cabo vacation today and experience the best of Marina Fiesta Resort. EXPLORE ALL OFFERS Fall in the Heart of Los Cabos 55% off + $100USD Resort Credit Hotel + Air Bundle Easy Escapes With Our Airfare Package Deal +1 (844) 278 6596 BOOK NOW DEALS CALL US BOOK NOW × MENU HOME Stay STAY EXPLORE ALL Nautical Suites Grand Luxe Suite Multibedroom Suites Experience EXPERIENCE Amenities Things to Do Activities Shopping Cart Dining DINING Dine Out All Inclusive Plan On-site Restaurants Off-site Restaurants Amura Spa Celebrate Offers OFFERS EXPLORE ALL OFFERS Fall in the Heart of Los Cabos Hotel + Air Bundle MORE Contact Us Gallery News Travel Agent FAQs Privacy Policy Select your language ES MX Contact Marina Fiesta Resort Connect with Marina Fiesta Resort directly via phone or email. Address Paseo de la Marina Lotes 37 y 38 Col. Centro C.P. 23450 Cabo San Lucas, BCS, Mexico. Room Reservations Phone: US: +1 (844) 278 6596 MX: +52 (800) 942 2436 Email: This email address is being protected from spambots. You need JavaScript enabled to view it. General Inquieres Phone: +52 (624) 163 5999 Email: This email address is being protected from spambots. You need JavaScript enabled to view it. Explore Cabo's Exotic Charms The Arch Marina Cabo San Lucas Desert Park Natural Reserve Cabo Real Golf Course Chileno Beach Cabo San Lucas Country Golf Course Los Cabos Convention Center Sport Fishing Luxury Avenue Puerto Paraiso Mall Medano Beach Nightlife San Jose del Cabo Art District Dolphinarium Zip Lines ATV Tours BE THE FIRST Sign up and receive the latest information and updates from The Residences at Hacienda Encantada I agree to subscribe to the newsletter to receive commercial communications SIGNUP × Subscription Confirmed Thank you for subscribing. You'll now receive our latest updates, tips, and exclusive offers. Hacienda Encantada Resort & Residences El Encanto All Inclusive Resort Vista Encantada Spa Resort & Residences The Residences at Hacienda Encantada ABOUT Contact Us FAQs Photo Gallery Privacy Policy Invoicing Marina Fiesta Resort & Spa Paseo de la Marina Lotes 37 y 38 Col. Centro, 23450 Cabo San Lucas, BCS, Mexico. Toll Free: +1 (844) 278 6596 reservations@marinafiestaresort.com Marina Fiesta Resort & Spa TOLL FREE: +1 (844) 278 6596 reservations@marinafiestaresort.com CONTACT US FAQ's GALLERY PRIVACY POLICY"
    },
    {
      "url": "https://www.restauranttucasa.com/contactus",
      "text": "Contact Us | Tu Casa Restaurant top of page Home Menu Our Story Contact Us ORDER ONLINE Menu Close Home Menu Our Story Contact Us Bienvenidos a Tu Casa Restaurant! 🌿🍽️✨ Visit Us Today! Open every day Contact Us First Name * Last Name * Email * Message * SUBMIT Find your way home to Tu Casa Restaurant Your cozy haven of authentic flavors and family warmth. Every visit is a journey back to the heart of our community 528 Cranbrook Rd. Cockeysville, MD 21030 ​ (410) 888-2272 info@restaurantTuCasa.com TU CASA RESTAURANT 10:30 am - 9:30 pm 528 Cranbrook Rd Cockeysville, MD 21030 (410) 888-2272 info@restaurantTuCasa.com MENU Home Menu Contact Us SOCIALS Facebook Instagram Tik Tok © 2025 by Tu Casa Restaurant Home Menu Our Story Contact Us bottom of page"
    },
    {
      "url": "https://www.casagrand.co.in/about-us/management-page/",
      "text": "Casagrand Board of Directors and Key Management Team Residential Commercial Industrial Warehouse NRI Ancillary Others About About Casagrand – Building Homes, Shaping Dreams Management Team Media Awards Newsletters Media Coverage Videos Blog Channel Partner Joint Developments Testimonials Standard Resale Rentals Referrals Customer Portal Login Customer Queries Careers Contact Us Investors About About Casagrand Board of members Media Awards Newsletters Media Coverage Videos Blog Channel Partner Joint Developments Testimonials Standard Resale Rentals Referrals Customer Portal Login Customer Queries Careers Tools Stamp Duty Calculator Land Area Calculator Home Loan Prepayment Calculator Contact Us ☰ Residential Commercial Industrial Warehouse NRI Ancillary Others About About Casagrand – Building Homes, Shaping Dreams Management Team Media Awards Newsletters Media Coverage Videos Blog Channel Partner Joint Developments Testimonials Standard Resale Rentals Referrals Customer Portal Login Customer Queries Careers Contact Us Investors Ongoing Projects Ready to Occupy Completed Projects Bengaluru Chennai Coimbatore Bengaluru Chennai Coimbatore Pre-Launch Projects Future Projects BENGALURU CHENNAI COIMBATORE KODAIKANAL BENGALURU CHENNAI COIMBATORE BOARD OF DIRECTORS Arun Mn Founder, Chairman and Managing Director × Arun Mn Founder, Chairman and Managing Director He holds a Bachelor’s degree in Engineering from Hindustan University and a Post Graduate Diploma in Management from the Symbiosis Centre for Management and Human Resource Development. He has over 19 years of experience in the real estate industry and was previously associated with Wipro Limited as a Senior Marketing Executive. Sumanth Krishna Raghunathan Director × Sumanth Krishna Raghunathan Director He has been associated with Casagrand since June 1,2015. He holds a Bachelor’s degree in Engineering from Anna University and a Post Graduate Diploma in Management from the Management Development Institute, Gurgaon. He was previously associated with CRISIL Limited as Head – DEP IRV COM, Kumaran Systems Private Limited as Senior Executive – Marketing and HCL Technologies Limited as a Senior Project Manager. Mr Sathish CG Deputy Managing Director, Casagrand Premier Builder Limited × Mr Sathish CG Deputy Managing Director, Casagrand Premier Builder Limited Mr Sathish CG is a significant pillar of Casagrand’s phenomenal growth story and a dynamic leader whose vision, execution excellence, and strategic foresight have helped transform the company into one of India’s most formidable real estate brands. With 20+ years of expertise in real estate , Mr. Sathish brings a rare blend of deep industry knowledge and proven business-building expertise. Joining Casagrand in 2012, Sathish quickly emerged as a driving force behind the company’s sales engine. As Controlling Director of Sales, he crafted and executed strategies that generated 40x revenue in order to achieve an extraordinary ₹7601 Cr in just 13 years. Under his leadership, sales teams have been transformed into agile, result-oriented units backed by robust systems and processes, ensuring efficiency and long-term scalability. In 2018, Sathish took on the additional responsibility of leading the Bengaluru Zone, a market that he transformed beyond expectations. Through precise positioning, strategic partnerships, and operational discipline, he drove a 60x growth in just six years, turning Bengaluru into one of Casagrand’s most successful zones. Expanding his portfolio further, Sathish launched and has been leading Casagrand’s resale and rental business (SARA) since 2022. In his current role as Deputy Managing Director, Sathish is working alongside Founder & Managing Director Mr .Arun Mn, sharing responsibility for strategic initiatives, operational control, and tactical decision-making across both residential and non-residential ventures. Raju Venkatraman Independent Director × Raju Venkatraman Independent Director He has been associated with our Company since July,2024. He has completed his Bachelor’s degree in Technology from the Indian Institute of Technology, Madras. He was previously associated with Medall Healthcare Private Limited as the promoter and Managing Director and Firstsource Solutions Limited as the Joint Managing Director and Chief Operating Officer.He was also previously a member of the Board of Directors of American International School – Chennai and has also received the Udyog Rattan Award from the Institute of Economic Studies. K V Ganesh Independent Director × K V Ganesh Independent Director He has been associated with Casagrand since August,2024. He holds a Bachelor’s degree in Commerce (Honours) from the University of Delhi and has also completed the Senior Management Program from the Indian Institute of Management,Calcutta.He is an associate of the Institute of Chartered Accountants of India and an Associate of the Institute of Company Secretaries of India.He was previously associated with Logix Microsystems Limited as chief financial officer,Subex Limited as Chief Financial Officer, Global Head – Legal and Company Secretary and TVS Srichakra Limited as the Chief Financial Officer.He was recognised in the 9th edition of the CFO Vision & Innovation Summit & Awards 2023 in appreciation for knowledge sharing.He was presented with a recognition of excellence at the 8th Annual CFO 100 for exceptional calibre and contribution to the world of finance and has also been named as one of the “Most Influential CFOs of India” by the Chartered Institute of Management Accountants. Rohini Manian Independent Director × Rohini Manian Independent Director She has been associated with Casagrand since August,2024. She holds a Bachelor’s degree in Science (Liberal Studies) from Northeastern University, Boston,Massachusetts,USA.She has been a director of Global Adjustments Services Private Limited since 2016 and Go Fashion (India) Limited since 2021. BOARD OF DIRECTORS Arun Mn Founder, Chairman and Managing Director He holds a Bachelor’s degree in Engineering from Hindustan University and a Post Graduate Diploma in Management from the Symbiosis Centre for Management and Human Resource Development. He has over 19 years of experience in the real estate industry and was previously associated with Wipro Limited as a Senior Marketing Executive. × Arun Mn Founder, Chairman and Managing Director He holds a Bachelor’s degree in Engineering from Hindustan University and a Post Graduate Diploma in Management from the Symbiosis Centre for Management and Human Resource Development. He has over 19 years of experience in the real estate industry and was previously associated with Wipro Limited as a Senior Marketing Executive. Sumanth Krishna Raghunathan Director He has been associated with Casagrand since June 1,2015. He holds a Bachelor’s degree in Engineering from Anna University and a Post Graduate Diploma in Management from the Management Development Institute, Gurgaon. He was previously associated with CRISIL Limited as Head – DEP IRV COM, Kumaran Systems Private Limited as Senior Executive – Marketing and HCL Technologies Limited as a Senior Project Manager. × Sumanth Krishna Raghunathan Director He has been associated with Casagrand since June 1,2015. He holds a Bachelor’s degree in Engineering from Anna University and a Post Graduate Diploma in Management from the Management Development Institute, Gurgaon. He was previously associated with CRISIL Limited as Head – DEP IRV COM, Kumaran Systems Private Limited as Senior Executive – Marketing and HCL Technologies Limited as a Senior Project Manager. Mr Sathish CG Deputy Managing Director, Casagrand Premier Builder Limited Mr Sathish CG is a significant pillar of Casagrand’s phenomenal growth story and a dynamic leader whose vision, execution excellence, and strategic foresight have helped transform the company into one of India’s most formidable real estate brands. With 20+ years of expertise in real estate , Mr. Sathish brings a rare blend of deep industry knowledge and proven business-building expertise. Joining Casagrand in 2012, Sathish quickly emerged as a driving force behind the company’s sales engine. As Controlling Director of Sales, he crafted and executed strategies that generated 40x revenue in order to achieve an extraordinary ₹7601 Cr in just 13 years. Under his leadership, sales teams have been transformed into agile, result-oriented units backed by robust systems and processes, ensuring efficiency and long-term scalability. In 2018, Sathish took on the additional responsibility of leading the Bengaluru Zone, a market that he transformed beyond expectations. Through precise positioning, strategic partnerships, and operational discipline, he drove a 60x growth in just six years, turning Bengaluru into one of Casagrand’s most successful zones. Expanding his portfolio further, Sathish launched and has been leading Casagrand’s resale and rental business (SARA) since 2022. In his current role as Deputy Managing Director, Sathish is working alongside Founder & Managing Director Mr .Arun Mn, sharing responsibility for strategic initiatives, operational control, and tactical decision-making across both residential and non-residential ventures. × Mr Sathish CG Deputy Managing Director, Casagrand Premier Builder Limited Mr Sathish CG is a significant pillar of Casagrand’s phenomenal growth story and a dynamic leader whose vision, execution excellence, and strategic foresight have helped transform the company into one of India’s most formidable real estate brands. With 20+ years of expertise in real estate , Mr. Sathish brings a rare blend of deep industry knowledge and proven business-building expertise. Joining Casagrand in 2012, Sathish quickly emerged as a driving force behind the company’s sales engine. As Controlling Director of Sales, he crafted and executed strategies that generated 40x revenue in order to achieve an extraordinary ₹7601 Cr in just 13 years. Under his leadership, sales teams have been transformed into agile, result-oriented units backed by robust systems and processes, ensuring efficiency and long-term scalability. In 2018, Sathish took on the additional responsibility of leading the Bengaluru Zone, a market that he transformed beyond expectations. Through precise positioning, strategic partnerships, and operational discipline, he drove a 60x growth in just six years, turning Bengaluru into one of Casagrand’s most successful zones. Expanding his portfolio further, Sathish launched and has been leading Casagrand’s resale and rental business (SARA) since 2022. In his current role as Deputy Managing Director, Sathish is working alongside Founder & Managing Director Mr .Arun Mn, sharing responsibility for strategic initiatives, operational control, and tactical decision-making across both residential and non-residential ventures. Raju Venkatraman Independent Director He has been associated with our Company since July,2024. He has completed his Bachelor’s degree in Technology from the Indian Institute of Technology, Madras. He was previously associated with Medall Healthcare Private Limited as the promoter and Managing Director and Firstsource Solutions Limited as the Joint Managing Director and Chief Operating Officer.He was also previously a member of the Board of Directors of American International School – Chennai and has also received the Udyog Rattan Award from the Institute of Economic Studies. × Raju Venkatraman Independent Director He has been associated with our Company since July,2024. He has completed his Bachelor’s degree in Technology from the Indian Institute of Technology, Madras. He was previously associated with Medall Healthcare Private Limited as the promoter and Managing Director and Firstsource Solutions Limited as the Joint Managing Director and Chief Operating Officer.He was also previously a member of the Board of Directors of American International School – Chennai and has also received the Udyog Rattan Award from the Institute of Economic Studies. K V Ganesh Independent Director He has been associated with Casagrand since August,2024. He holds a Bachelor’s degree in Commerce (Honours) from the University of Delhi and has also completed the Senior Management Program from the Indian Institute of Management,Calcutta.He is an associate of the Institute of Chartered Accountants of India and an Associate of the Institute of Company Secretaries of India.He was previously associated with Logix Microsystems Limited as chief financial officer,Subex Limited as Chief Financial Officer, Global Head – Legal and Company Secretary and TVS Srichakra Limited as the Chief Financial Officer.He was recognised in the 9th edition of the CFO Vision & Innovation Summit & Awards 2023 in appreciation for knowledge sharing.He was presented with a recognition of excellence at the 8th Annual CFO 100 for exceptional calibre and contribution to the world of finance and has also been named as one of the “Most Influential CFOs of India” by the Chartered Institute of Management Accountants. × K V Ganesh Independent Director He has been associated with Casagrand since August,2024. He holds a Bachelor’s degree in Commerce (Honours) from the University of Delhi and has also completed the Senior Management Program from the Indian Institute of Management,Calcutta.He is an associate of the Institute of Chartered Accountants of India and an Associate of the Institute of Company Secretaries of India.He was previously associated with Logix Microsystems Limited as chief financial officer,Subex Limited as Chief Financial Officer, Global Head – Legal and Company Secretary and TVS Srichakra Limited as the Chief Financial Officer.He was recognised in the 9th edition of the CFO Vision & Innovation Summit & Awards 2023 in appreciation for knowledge sharing.He was presented with a recognition of excellence at the 8th Annual CFO 100 for exceptional calibre and contribution to the world of finance and has also been named as one of the “Most Influential CFOs of India” by the Chartered Institute of Management Accountants. Rohini Manian Independent Director She has been associated with Casagrand since August,2024. She holds a Bachelor’s degree in Science (Liberal Studies) from Northeastern University, Boston,Massachusetts,USA.She has been a director of Global Adjustments Services Private Limited since 2016 and Go Fashion (India) Limited since 2021. × Rohini Manian Independent Director She has been associated with Casagrand since August,2024. She holds a Bachelor’s degree in Science (Liberal Studies) from Northeastern University, Boston,Massachusetts,USA.She has been a director of Global Adjustments Services Private Limited since 2016 and Go Fashion (India) Limited since 2021. Key Management Mr. Siva Sankar Reddy Deputy Managing Director, Group Ventures, Casagrand An instrumental leader behind Casagrand’s growth story, Mr. Siva Sankar Reddy has been an integral part of Casagrand leadership since 2012. As one of the most versatile and trusted leaders within the organization, he has played a defining role in Casagrand’s evolution, taking on critical responsibilities across departments and verticals with unmatched dedication and precision. Mr. Reddy began his journey in Casagrand as the Head of Finance and steadily grew into a leadership powerhouse, taking on multifaceted roles such as Controlling Director of CRM , Controlling Director of Engineering , Zonal Director of Chennai (the company’s primary operational zone), and Director of Casa Grande PropCare . In his current role as Deputy Managing Director, Group Ventures , Mr. Reddy works closely with the CEOs and Managing Directors of each vertical in Casagrand and co-leads all Casagrand’s non-residential businesses to steer performance, drive growth, and explore new opportunities. His portfolio covers Casagrand’s ventures in Commercial, Spaceintell, School, Hospitality, Propcare, PGT Ventures, Contracts, and other emerging businesses. Notably, under his supervision, Casa Grande Propcare has grown multifold, evolving into a robust foundation for becoming one of India’s most respected facilities management players. Over the last 13 years, Mr. Reddy has helped shape Casagrand’s culture of performance, trust, and continuous innovation and continues to be a driving force in propelling the organization into its next phase of growth. × Mr. Siva Sankar Reddy Deputy Managing Director, Group Ventures, Casagrand An instrumental leader behind Casagrand’s growth story, Mr. Siva Sankar Reddy has been an integral part of Casagrand leadership since 2012. As one of the most versatile and trusted leaders within the organization, he has played a defining role in Casagrand’s evolution, taking on critical responsibilities across departments and verticals with unmatched dedication and precision. Mr. Reddy began his journey in Casagrand as the Head of Finance and steadily grew into a leadership powerhouse, taking on multifaceted roles such as Controlling Director of CRM , Controlling Director of Engineering , Zonal Director of Chennai (the company’s primary operational zone), and Director of Casa Grande PropCare . In his current role as Deputy Managing Director, Group Ventures , Mr. Reddy works closely with the CEOs and Managing Directors of each vertical in Casagrand and co-leads all Casagrand’s non-residential businesses to steer performance, drive growth, and explore new opportunities. His portfolio covers Casagrand’s ventures in Commercial, Spaceintell, School, Hospitality, Propcare, PGT Ventures, Contracts, and other emerging businesses. Notably, under his supervision, Casa Grande Propcare has grown multifold, evolving into a robust foundation for becoming one of India’s most respected facilities management players. Over the last 13 years, Mr. Reddy has helped shape Casagrand’s culture of performance, trust, and continuous innovation and continues to be a driving force in propelling the organization into its next phase of growth. Nisha Abhishek Jha Company Secretary & Compliance Officer She has been associated with Casagrand since August 4, 2021.She holds a Bachelor’s degree in Commerce from H.L. Commerce College, Ahmedabad.She is also an associate member of the Institute of Company Secretaries of India.She was previously associated with Zwilling Kitchen India Private Limited,Plastene India Limited, Uber9 Business Process Services Private Limited and Archetype Engineering & Industry Private Limited as a Company Secretary. × Nisha Abhishek Jha Company Secretary & Compliance Officer She has been associated with Casagrand since August 4, 2021.She holds a Bachelor’s degree in Commerce from H.L. Commerce College, Ahmedabad.She is also an associate member of the Institute of Company Secretaries of India.She was previously associated with Zwilling Kitchen India Private Limited,Plastene India Limited, Uber9 Business Process Services Private Limited and Archetype Engineering & Industry Private Limited as a Company Secretary. Senior Management Jagmohan T Executive Vice President, Sales He joined our company on July 7, 2014, as a Manager – Sales. He holds a Bachelor’s degree in Tourism and Mass Communication from Delhi University and a Master’s degree in Business Administration from Crescent Business School, B.S. Abdur Rahman University, Chennai. × Jagmohan T He joined our company on July 7, 2014, as a Manager – Sales. He holds a Bachelor’s degree in Tourism and Mass Communication from Delhi University and a Master’s degree in Business Administration from Crescent Business School, B.S. Abdur Rahman University, Chennai. Karthik R G Vice President, Profit & Loss He joined our Company on May 4, 2013 as an Executive.He holds a Bachelor’s degree in Science (Computer Science)from the University of Madras. × Karthik R G He joined our Company on May 4, 2013 as an Executive.He holds a Bachelor’s degree in Science (Computer Science)from the University of Madras. Bharaneeshwaran N Senior Vice President Legal He joined our Company on June 22, 2009 as an Executive- Legal in our Company. He holds a Bachelor’s degree in Law from Tamil Nadu Dr. Ambedkar Law University. × Bharaneeshwaran N He joined our Company on June 22, 2009 as an Executive- Legal in our Company. He holds a Bachelor’s degree in Law from Tamil Nadu Dr. Ambedkar Law University. Sai Pratap Reddy Executive Vice President, Land Acquisition He has been associated with Casagrand since June 30, 2014. He holds a Bachelor’s degree in Engineering (Electronics and Communication) from the Sri Venkateswara College of Engineering. He has previously worked with Purvankara Projects Limited. × Sai Pratap Reddy He has been associated with Casagrand since June 30, 2014. He holds a Bachelor’s degree in Engineering (Electronics and Communication) from the Sri Venkateswara College of Engineering. He has previously worked with Purvankara Projects Limited. Gautam Agarwaal Executive Vice President, Product Development He has been associated with Casagrand since March 10, 2014. He holds a Bachelor’s degree in Technology (Bio-medical Instrumentation) from Dr. M.G.R. University and a Post Graduate Diploma in Industrial Management from the National Institute of Industrial Engineering, Mumbai. He was previously associated with Swastik Surgical Industries and Auraley Foods Private Limited as Manager – Business Development and Marketing. × Gautam Agarwaal He has been associated with Casagrand since March 10, 2014. He holds a Bachelor’s degree in Technology (Bio-medical Instrumentation) from Dr. M.G.R. University and a Post Graduate Diploma in Industrial Management from the National Institute of Industrial Engineering, Mumbai. He was previously associated with Swastik Surgical Industries and Auraley Foods Private Limited as Manager – Business Development and Marketing. × Jagmohan T Executive Vice President, Sales He joined our company on July 7, 2014, as a Manager – Sales. He holds a Bachelor’s degree in Tourism and Mass Communication from Delhi University and a Master’s degree in Business Administration from Crescent Business School, B.S. Abdur Rahman University, Chennai. × Karthik R G Vice President, Profit & Loss He joined our Company on May 4, 2013 as an Executive.He holds a Bachelor’s degree in Science (Computer Science)from the University of Madras. × Bharaneeshwaran N Senior Vice President Legal He joined our Company on June 22, 2009 as an Executive- Legal in our Company. He holds a Bachelor’s degree in Law from Tamil Nadu Dr. Ambedkar Law University. × Sai Pratap Reddy Executive Vice President, Land Acquisition He has been associated with Casagrand since June 30, 2014. He holds a Bachelor’s degree in Engineering (Electronics and Communication) from the Sri Venkateswara College of Engineering. He has previously worked with Purvankara Projects Limited. × Gautam Agarwaal Executive Vice President, Product Development He has been associated with Casagrand since March 10, 2014. He holds a Bachelor’s degree in Technology (Bio-medical Instrumentation) from Dr. M.G.R. University and a Post Graduate Diploma in Industrial Management from the National Institute of Industrial Engineering, Mumbai. He was previously associated with Swastik Surgical Industries and Auraley Foods Private Limited as Manager – Business Development and Marketing. X Enquire Now Get updates on Whatsapp Submit X Enquire Now --Select City-- Chennai Coimbatore Bengaluru Hyderabad --Select Location-- Submit X Enquire Now --Select City-- Chennai Coimbatore Bengaluru Hyderabad --Select Location-- Submit X Enquire Now Submit X Download Brochure I agree to the Privacy Policy . Submit Get in touch CHENNAI (Registered office) Casagrand Premier Builder Limited CIN No. - U70101TN2003PLC051989 5TH FLOOR, NPL DEVI, NEW NO -111, OLD NO 59 L.B.ROAD, THIRUVANMIYUR, CHENNAI, Tamil Nadu, India, 600041 Phone:  044-44111111 Fax : 044-43150512 Phone : +91-99629 44444 NRI : +91-91763 44444 BANGALORE Casagrand Premier Builder Limited No. 34/1, 4th Floor Salma Bizhouse Meanee Avenue Road, Opp to Lakeside Hospital, Ulsoor Road, Near Ulsoor lake Bangalore-560042 Phone : 080-46668666 Phone : +91-98848 00062 HYDERABAD Casagrand Premier Builder Limited AR Square, Plot No.13, Door No. 4-50, Jayabheri Enclave, Gachibowli, Hyderabad - 500032. Phone : +91 90475 60000 MUMBAI Casagrand Premier Builder Limited Regus, 11th Floor, Tower B, Peninsula Business Park Senapati Bapat Marg, Lower Parel Mumbai – 400 013 Phone : +91 93848 71045 DELHI Casagrand Premier Builder Limited 3rd Floor, Landmark Cyber Park, Sector - 67, Gurugram, Haryana - 122002 Phone : +91-73388 66895 PUNE Casagrand Premier Builder Limited The Platinum Towers, LG - 11, Lower ground floor, Kharadi Road, Mahapalikemadhye samavishta, Tukaram Nagar, Kharadi - 411014, Pune Phone : +91-82200 34547 DUBAI (International office) Casagrand Premier Builder Limited Single Business Tower, 25th Floor, Office No.2501-2506, Business Bay, Shaikh Zayed Road, Dubai , UAE. Phone : +971 44205777 Icare Enquiry Phone : 18002020017 Phone : 8001780017 E-mail : [email protected] Our Projects Chennai Configuration 1 BHK Flats in Chennai 2 BHK Flats in Chennai 3 BHK Flats in Chennai 4 BHK Flats in Chennai 5 BHK Flats in Chennai Apartments Apartments in Chennai Apartments in Adyar Apartments in Alwarpet Apartments in Arumbakkam Apartments in Annanagar Apartments in Ashok Nagar Apartments in Ayanambakkam Apartments in Nanganallur Apartments in Nolambur Apartments in Nungambakkam Apartments in OMR Apartments in Pallikaranai Apartments in East Tambaram Apartments in ECR Apartments in Gopalapuram Apartments in Guindy Apartments in Kelambakkam Apartments in Kundrathur Apartments in Kolapakkam Apartments in Kilpauk Apartments in Pallavaram Apartments in Perambur Apartments in Perumbakkam Apartments in Perungudi Apartments in Saidapet Apartments in Saravanampatti Apartments in Shenoy Nagar Apartments in Sholinganallur Apartments in Korattur Apartments in Kotturpuram Apartments in Kovilancheri Apartments in Iyyappanthangal Apartments in Madhavaram Apartments in Madipakkam Apartments in Manapakkam Apartments in Kattupakkam Apartments in Mandaveli Apartments in Medavakkam Apartments in Mogappair Apartments in Mount Road Apartments in Mylapore Apartments in T Nagar Apartments in Tambaram Apartments in Thalambur Apartments in Thiruvanmiyur Apartments in Thoraipakkam Apartments in Perungalathur Apartments in Porur Apartments in West Mambalam Apartments in Navalur Apartments in Vandalur Price Range Apartments Between 30L – 40L in Chennai Apartments Between 40L – 50L in Chennai Apartments Between 50L – 60L in Chennai Apartments Between 60L – 70L in Chennai Apartments Between 70L – 80L in Chennai Apartments Between 80L – 90L in Chennai Apartments Between 90L – 1Cr in Chennai Apartments Above 1Cr Villas Villas in Chennai Villas in Chrompet Villas in East Tambaram Villas in Kilpauk Villas in Kelambakkam Villas in Navalur Villas in OMR Villas in Oragadam 3 BHK Villas in Chennai 4 BHK Villas in Chennai 5 BHK Villas in Chennai Villas in Pallavaram Villas in Pallikaranai Villas in Perumbakkam Villas in Perungalathur Villas in Perungudi Villas in perambur Villas in Ponmar Villas in Sholinganallur Villas in Sriperumbudur Villas in Thalambur Villas in Thoraipakkam Villas in Uthandi Plots Plots in Maraimalai Nagar Plots in OMR Plots In Ponmar Plots in Poonamallee Plots in Thaiyur Bengaluru Configuration 1 BHK Flats in Bengaluru 2 BHK Flats in Bengaluru 3 BHK Flats in Bengaluru 4 BHK Flats in Bangalore Apartments Apartments in Bengaluru Apartments in Bannerghatta Road Apartments in Begur Apartments in Electronic City Apartments in Kengeri Apartments in Kanakapura Road Apartments in KR Puram Apartments in Hennur Main Road Apartments in Hennur Junction Apartments in HSR Layout Apartments in Talaghattapura Apartments in Nagavara Jn Villas Villas in Bengaluru 5 BHK Villas in Bengaluru Villas in Kanakapura Road Coimbatore Configuration 1 BHK Flats in Coimbatore 2 BHK Flats in Coimbatore 3 BHK Flats in Coimbatore 4 BHK Flats in Coimbatore Apartments Apartments in Coimbatore Apartments in Tiruppur Apartments in Sulur Villas Villas in Coimbatore Villas in Tiruppur Villas in Avinashi Road 3 BHK Villas in Coimbatore 4 BHK Villas in Coimbatore Price Range Apartments between 20L-30L In Coimbatore Apartments between 40L-50L In Coimbatore Apartments between 70L-80L In Coimbatore Apartments Above 1cr In Coimbatore Others Plots in Kodaikanal Hyderabad Villas Projects in Hyderabad Villas in Hyderabad Villas in Gowdavalli 5 BHK Villas in Hydrabad Pune Apartments Apartments in Pune 2 BHK in Pune 3 BHK in Pune Disclaimer I authorize Casagrand and its representatives to Call, SMS, Email or WhatsApp me to provide information about their products and offers. This consent overrides any registration for DNC / NDNC. PRIVACY POLICY © 2025 Casagrand Premier Builder Limited About Casagrand Channel Partners Media Blog Testimonials Referrals NRI Call Us Chennai 99629 44444 Coimbatore 72993 70000 Bangalore 98848 00062 Delhi 73388 66895 Hyderbad 73581 35136 Pune 82200 34547 Dubai 44205777 NRI 91763 44444 Enquire Now Call Now Call us X Chennai 99629 44444 Coimbatore 72993 70000 Bangalore 98848 00062 Delhi 73388 66895 Hyderabad 73581 35136 Pune 82200 34547 Dubai 44205777 NRI 91763 44444"
    },
    {
      "url": "https://www.casamarinabeachhotel.com/contact_us.asp",
      "text": "Casa Marina Beach â Sousa, Puerto Plata, Casa Marina Beach and Reef All Inclusive Resort  - Contact Us Casa Marina Beach Resort Amhsa Marina Resort - Puerto Plata All Inclusive - Dominican Republic 1 (888) 774 0040 or (305) 774 0040 Book now! Number of persons Number 0 Persons 0 Rooms Occupation is incorrect Date of arrival Arrival Arrival date empty INCORRECT DATE Date of departure Departure Departure date empty INCORRECT DATE Search Resorts Grand Paradise Playa Dorada Grand Paradise SamanÃ¡ Casa Marina Reef Casa Marina Beach Accommodations Restaurants & Bars All Inclusive Details Home Resorts Grand Paradise Playa Dorada Grand Paradise SamanÃ¡ Casa Marina Reef Casa Marina Beach + Accommodations Restaurants & Bars All Inclusive Details Gallery Weddings Contact Us Home Weddings Select Gallery Contact Us All Inclusive: Breakfast, Lunch, Afternoon Tea and Dinner Unlimited Domestic Drinks Including Wine w/ Dinner Daily Activities Including a Scuba Diving Lesson, Volleyball, Biking and Aerobics Non-Motorized Watersports Including Kayaking and Snorkeling, and Motorized Watersports Such as Banana Boat, Deep Sea Fishing Excursions and Snorkeling Nightly Entertainment Including Disco Supervised Children Program Ages 4 - 12 All Current Hotel Taxes, Gratuities, and Service Charges are Included Contact Us Vacation Store Miami offers All Inclusive Vacations at unbelievable discounts on an extensive selection of resorts in the Caribbean. Let our professional staff help you find your perfect family vacation, weekend getaway, spring break vacation or that special honeymoon. Why choose Vacation Store Miami? Guaranteed best prices on Caribbean Vacations. Over 15 years of experience. Did we mention BEST PRICES? Satisfying our Guests is our principal aim. Therefore we would like to facilitate the reservations process with our telephone reservations service. If you need help, contact us by phone or EMAIL US Call Us Nationally at 1 (888) 774 0040 or (305) 774 0040 EMAIL US Phone: 1 (888) 774 0040 or (305) 774 0040 Casa Marina Beach - All Inclusive - Puerto Plata - Dominican Republic - Call us Toll Free at 1 (888) 774 0040 or (305) 774 0040 Grand Paradise Playa Dorada Grand Paradise SamanÃ¡ Casa Marina Reef Casa Marina Beach ®Vacation Store Miami Accommodations Restaurants & Bars All Inclusive Contact Us"
    },
    {
      "url": "https://www.lacasaamman.com/en/contact_us.html",
      "text": "Contact - La Casa Hotel Amman Need help? Call us now:\r\n        +962 64005400 Need help? Call us now:\r\n            +962 64005400 English English Arabic Home About Us Accommodation Restaurant Meeting and Events Special Offer Gallery Contact Us Close Home About Us Accommodation Restaurant Meeting and Events Special Offer Gallery Contact Us Contact Us Stay in Touch Check-In Check-Out Promo Code Adult 1 2 3 4 5 6 7 Reach us on: +962 64005400 Check Availability Information La Casa Hotel Amman Contact Details Contact us using the details provided below. At La Casa Hotel Amman, we are always here to help. Please feel free to contact our Hotel on the telephone number below or, by all means, pay us a visit. If you prefer, you can also reach us via our contact form below. Address and Postal Code: Tlaa Al Ali - Amman,Jordan General Enquiries and Reservations: E: info@lacasaamman.com General phone number of accommodation: T: +962 64005400 Contact Form Submit 185 Tla'a Alali, Natfeh street, 11953 Amman, Jordan info@lacasaamman.com +962 64005400 ©\r\n              2025 La Casa Hotel Amman by Bookingwhizz . All Rights Reserved."
    },
    {
      "url": "https://americanahotel.co.uk/contact-us/",
      "text": "Contact Us - The Americana Hotel Book a Room Transfers About Us Rooms Experiences Contact Us Blog About Us Rooms Experiences Contact Us Blog Contact Us Home Contact Us Need help with your online booking, have a question or need more information? Just drop us a line! Get in touch Planning your stay in the heart of London? Have questions, special requests, or eager to book your dream room? We’re here for you! Name Email Message Phone Number Send Our location 172-174 Gloucester Pl, London NW1 6DY, United Kingdom {\"settings\":{\"zoom\":17,\"mapTypeControl\":false,\"mapTypeId\":\"roadmap\",\"styles\":[{\"featureType\":\"administrative\",\"elementType\":\"all\",\"stylers\":[{\"visibility\":\"on\"},{\"lightness\":33}]},{\"featureType\":\"landscape\",\"elementType\":\"all\",\"stylers\":[{\"color\":\"#f2e5d4\"}]},{\"featureType\":\"poi.park\",\"elementType\":\"geometry\",\"stylers\":[{\"color\":\"#c5dac6\"}]},{\"featureType\":\"poi.park\",\"elementType\":\"labels\",\"stylers\":[{\"visibility\":\"on\"},{\"lightness\":20}]},{\"featureType\":\"road\",\"elementType\":\"all\",\"stylers\":[{\"lightness\":20}]},{\"featureType\":\"road.highway\",\"elementType\":\"geometry\",\"stylers\":[{\"color\":\"#c5c6c6\"}]},{\"featureType\":\"road.arterial\",\"elementType\":\"geometry\",\"stylers\":[{\"color\":\"#e4d7c6\"}]},{\"featureType\":\"road.local\",\"elementType\":\"geometry\",\"stylers\":[{\"color\":\"#fbfaf7\"}]},{\"featureType\":\"water\",\"elementType\":\"all\",\"stylers\":[{\"visibility\":\"on\"},{\"color\":\"#acbcc9\"}]}],\"zoomControl\":true,\"scaleControl\":false,\"streetViewControl\":false,\"fullscreenControl\":true,\"scrollwheel\":true,\"draggable\":true,\"center\":[\"51.524711441516715\",\" -0.1606182251465699\"]},\"marker\":[{\"position\":[\"51.524711441516715\",\" -0.1606182251465699\"]}],\"overlay\":[{\"position\":[\"51.524711441516715\",\" -0.1606182251465699\"],\"content\":\"\\u003Cdiv class=\\u0022nuss-map-overlay nuss-map-overlay- elementor-repeater-item-b00edcc\\u0022\\u003E\\u003Cdiv class=\\u0022gmap-info-wrapper style-signal\\u0022\\u003E\\u003Cdiv class=\\u0022animated-dot\\u0022\\u003E\\u003Cdiv class=\\u0022middle-dot\\u0022\\u003E\\u003C\\/div\\u003E\\u003Cdiv class=\\u0022signal signal-1\\u0022\\u003E\\u003C\\/div\\u003E\\u003Cdiv class=\\u0022signal signal-2\\u0022\\u003E\\u003C\\/div\\u003E\\u003C\\/div\\u003E\\u003Cdiv class=\\u0022nuss-map-overlay-template\\u0022\\u003E\\u003Cdiv class=\\u0022nuss-map-overlay-content\\u0022\\u003E\\u003Cdiv class=\\u0022nuss-map-overlay-info\\u0022\\u003E\\u003Cdiv class=\\u0022map-marker-image\\u0022\\u003E\\u003C\\/div\\u003E\\u003Cdiv class=\\u0022map-marker-content\\u0022\\u003E\\u003Ch5 class=\\u0022map-marker-title\\u0022\\u003EAmericana Hotel\\u003C\\/h5\\u003E\\u003Cdiv class=\\u0022map-marker-description\\u0022\\u003E172-174 Gloucester Pl, London NW1 6DY, United Kingdom\\u003C\\/div\\u003E\\u003C\\/div\\u003E\\u003C\\/div\\u003E\\u003C\\/div\\u003E\\u003C\\/div\\u003E\\u003C\\/div\\u003E\\u003C\\/div\\u003E\"}]} Reservations please call/email Phone: +442077231452 Email: info@americanahotel.co.uk Having Trouble with Our Contact Form? If you’re experiencing any issues with our contact form or want to ensure your message reaches us, you can always reach out to us directly through email. Please send your inquiries or messages to info@americanahotel.co.uk using your preferred email client, and we’ll get back to you promptly. Directions Heathrow Airport: From Heathrow Airport you should take the Heathrow Express to Paddington Station. From Paddington Underground Station you should board the Bakerloo line train which will take you to Baker Street Station which is a 3 minute walk from the hotel. Gatwick Airport: From Gatwick Airport you should take the Thameslink Train to London Bridge. From London Bridge Underground Station board the Jubilee line train which will take you to Baker Street Station. Stanstead Airport: From Stanstead Airport you should take the Inter-City Rail Service to Tottenham Hale. From Tottenham Hale you should Board the Victoria line train to Oxford Circus Station. Finally, from Oxford Circus Underground Station you should take the Bakerloo line train to Baker Street Station. In the heart of London! Connect Contact Us E. info@americanahotel.co.uk +442077231452 172-174 Gloucester Pl, London NW1 6DY, United Kingdom Copyright ©  2025 The Americana Hotel – Member of the G.A.P. Vassilopoulos Group Privacy Policy Terms of Use Check Availability Check in - Check out Rooms / Guests 1 Room , 1 Adult , 0 Children Rooms Adults Childrens Check Availability WhatsApp Hi Hello 👋, welcome to Americana Hotel - London Can we help you? Open Chat"
    },
    {
      "url": "https://avion-hotel-mumbai.hotelsgds.com/contact-us/",
      "text": "Reach Us at Avion Hotel Mumbai India for Bookings Asia Hotels and Resorts Book Now Avion Hotel Toggle navigation Home About Hotel About Us Amenities Restaurants Conf & Banquet Rooms Tariffs Packages Photos Contact Us Contacts Home Contacts Welcome to Asia Hotels and Resorts, India Hotel Name: Avion Hotel Address: Domestic Airport, Nehru Road, Vile Parle (East), Mumbai - 400 057. For Enquiry and Booking Contact Asia Hotels and Resorts 2nd Floor, Plot No 921, Gali No 1, Mahipalpur Bypass, Near Water Booster, Mahipalpur, New Delhi 110037,India info-2@hotelsgds.com Fill below form for Enquiry Check in Check out Name Email Mobile no. Adults 1 2 3 4 5 6 7 8 8+ Kids 0 1 2 3 4 4+ Requirement Avion Hotel Get in touch at Mumbai, Avion Hotel, on the contact no. given at website. Avion Hotel provides online booking rooms from anywhere.  Mumbai, Avion Hotel has round the clock active contact number. Location: Domestic Airport, Nehru Road, Vile Parle (East), Mumbai - 400 057. For Enquiry and Booking Contact Asia Hotels and Resorts 2nd Floor, Plot No 921, Gali No 1, Mahipalpur Bypass, Near Water Booster, Mahipalpur, New Delhi 110037,India Our Other Hotels Hotel VD Palace Bargarh Hotel Vinayak Bargarh OYO 47586 J J Residency Bargarh Hotel Royal Palace Bargarh Hotel The Residency Bargarh || Mumbai guest house | Last Minute Guest Houses Deal Mumbai | Phone No. Of Avion Hotel Mumbai | Places to Stay in Mumbai || This website managed by Asia Hotels and Resorts not from Avion Hotel. Home About us Policies Terms and Conditions Sitemap Contact Us"
    },
    {
      "url": "https://www.casamarinareefresort.com/contact_us.asp",
      "text": "Casa Marina Reef Resort â Sousa - Casa Marina Reef and Beach All Inclusive Resort  - Contact Us Casa Marina Reef Beach Resort Amhsa Marina Resort - Puerto Plata All Inclusive - Dominican Republic 1 (888) 774 0040 or (305) 774 0040 Book now! Number of persons Number 0 Persons 0 Rooms Occupation is incorrect Date of arrival Arrival Arrival date empty INCORRECT DATE Date of departure Departure Departure date empty INCORRECT DATE Search Resorts Grand Paradise Playa Dorada Grand Paradise SamanÃ¡ Casa Marina Reef Casa Marina Beach Accommodations Restaurants & Bars All Inclusive Details Home Resorts Grand Paradise Playa Dorada Grand Paradise SamanÃ¡ Casa Marina Reef Casa Marina Beach + Accommodations Restaurants & Bars All Inclusive Details Gallery Weddings Contact Us Home Weddings Gallery Contact Us All Inclusive: Breakfast, Lunch, Afternoon Tea and Dinner Unlimited Domestic Drinks Including Wine w/ Dinner Daily Activities Including a Scuba Diving Lesson, Volleyball, Biking and Aerobics Non-Motorized Watersports Including Kayaking and Snorkeling, and Motorized Watersports Such as Banana Boat, Deep Sea Fishing Excursions and Snorkeling Nightly Entertainment Including Disco Supervised Children Program Ages 4 - 12 All Current Hotel Taxes, Gratuities, and Service Charges are Included Contact Us Vacation Store Miami offers All Inclusive Vacations at unbelievable discounts on an extensive selection of resorts in the Caribbean. Let our professional staff help you find your perfect family vacation, weekend getaway, spring break vacation or that special honeymoon. Why choose Vacation Store Miami? Guaranteed best prices on Caribbean Vacations. Over 15 years of experience. Did we mention BEST PRICES? Satisfying our Guests is our principal aim. Therefore we would like to facilitate the reservations process with our telephone reservations service. If you need help, contact us by phone or EMAIL US Call Us Nationally at 1 (888) 774 0040 or (305) 774 0040 EMAIL US Phone: 1 (888) 774 0040 or (305) 774 0040 Casa Marina Reef - All Inclusive - Puerto Plata - Dominican Republic - Call us Toll Free at 1 (888) 774 0040 or (305) 774 0040 Grand Paradise Playa Dorada Grand Paradise SamanÃ¡ Casa Marina Reef Casa Marina Beach ®Vacation Store Miami Accommodations Restaurants & Bars All Inclusive Contact Us"
    },
    {
      "url": "https://www.casamarinahotel.com/contact",
      "text": "CONTACT | Casa Marina top of page HOME ROOMS MENUS DRINKS PENTHOUSE LOUNGE SUNDAY BRUNCH PENTHOUSE BRUNCH EVENT SPACE WEDDINGS PRIVATE EVENTS HOTEL HISTORY CONTACT More Use tab to navigate through the menu items. Contact Us Casa Marina Hotel & Restaurant 691 N. 1st Street Jacksonville Beach, FL 32250 Tel: (904) 270 - 0025 General Manager - Mark Vandeloo mvandeloo@casamarinahotel.com Director of Catering & Events - Virginia Martin vmartin@casamarinahotel.com Corporate Sales & Marketing Manager-Allison Perkner aperkner@casamarinahotel.com Reservations Manager - Alicia Gavin agavin@casamarinahotel.com CONTACT 691 1st Street N Jacksonville Beach, FL 32250 Tel: 904-270-0025 © 2020 by The Historic Casa Marina. Proudly created with Wix.com bottom of page"
    }
  ]
}