{
  "fuentes": [
    {
      "url": "https://www.outbackteambuilding.com/team-building/corporate-castaways/",
      "email": "info@outbackteambuilding.com"
    },
    {
      "url": "https://castaway.younglife.org/parents/",
      "email": "castawayc@castaway.younglife.org"
    }
  ],
  "mails": [
    "castawayc@castaway.younglife.org",
    "info@outbackteambuilding.com"
  ],
  "nombre_sitio": "castawayslife.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.outbackteambuilding.com/team-building/corporate-castaways/",
      "text": "Corporate Castaways | Outdoor Team Building Activity Join the Spooktacular Fun! Register now for our FREE demo of our newest seasonal offering: Halloween Friendly Feud! Team Building In Person Top Activities Indoor Team Building Activities Outdoor Scavenger Hunts Charity & Philanthropic Game Shows Virtual Virtual Escape Rooms Charity & Philanthropic Trivia Seasonal Self Hosted Escape Rooms Scavenger Hunts Charity/Philanthropic Professional Development Individual Leadership Group Leadership Interpersonal Skills Behavioural Assessments Resources Free Guides Podcasts Case Studies About Us Our Story Meet Our Team Join Our Team We Care Frequently Asked Questions Contact Us Become a Guest Blogger Team Building Locations in the USA Blog Request a Quote Menu Request A Quote Team Building Corporate Castaways Turn your team into survivors with Corporate Castaways, a high-energy activity where teamwork and strategy determine who will thrive in a series of fun and competitive challenges. Request A Quote Learn More Activity: Moderate/High Group Size: 25-2,000+ Team Size: Any Number Duration: 2-3 hrs Best Venue: Outdoor Season: year-round Corporate Castaways is recommended by organizations, such as: About What Is Corporate Castaways Corporate Castaways takes your team off the beaten path and onto an adventure inspired by survival-style competitions. Divided into “tribes,” participants will face a series of physical and mental challenges that require collaboration, creativity, and communication to succeed. From problem-solving tasks to light physical activities, each challenge brings your group closer together while fostering a healthy sense of competition. As tribes earn points and navigate the road to victory, your team will build stronger bonds and create lasting memories. Perfect for energizing your group, enhancing teamwork, and sparking friendly rivalry, Corporate Castaways delivers a unique and engaging team building experience that’s as exciting as it is rewarding. Corporate Castaways Agenda Welcome The event will begin with a welcome from your event host, who will assist in organizing the group into teams at the specified location. Following this, participants will receive a detailed briefing on the activity. 10 minutes Team Formation Participants will divide into teams. In this team, they will create their team name, team bandana, and team cheer. Once the teams are presented, the competition will begin! 15 minutes Corporate Castaways Teams will compete in 20 challenges using supplies provided in your team bag. Teams will choose the challenges they want to accomplish as a team. Challenges are a mix of mental and physical challenges. Some that are head-to-head, and others that are self-guided. Event hosts will assist teams to complete challenges. Teams will earn points for each challenge that is successfully completed. 120-150 minutes Wrap Up, Recognition and Photo Op Teams will reconvene to exchange experiences and review their efforts. The event host will facilitate discussions on key takeaways and lessons learned, culminating in the announcement of the winning team. Winning teams will be awarded Outback Team Building medals. The event will wrap up with congratulations all around to commemorate a successful event. 15 minutes What's Included With Your Corporate Castaways Included Professional Event Host All Games and Activities Unique Game Design Team Photos Medals for the Winning Team Dedicated Event Planner Event Set Up and Tear Down Required From You Park or Green Space Any Necessary Park Permits Appropriate Clothing and Footwear for the Weather Corporate Castaways Brochure Enter your details below to receive the event brochure: Download File Explore Corporate Castaways Photos Learn More Corporate Castaways Frequently Asked Questions What happens if we have inclement weather on the day of our activity? (For outdoor activities) We appreciate that weather is not always predictable, so we have a back-up plan in the event of poor weather.  We can switch your event to our indoor app-based Team Pursuit event at no extra charge.  You would need to arrange a backup space for the activity, and we need notice of 2 hours to make the switch. What if I need to change the date of my event? We understand that plans can change, so please reach out as early as possible, and we’ll do our best to accommodate your needs. Date changes may incur a change fee, please reach out to your Sales Engagement Consultant to discuss further. Where do these events take place? Our events can take place anywhere. We have event coordinators located across North America who can come directly to you—whether it’s your office, a venue of your choice, a meeting space, or a unique location that best suits your needs. We’re flexible and ready to make your event seamless, no matter the location! What if I need to make a last-minute change to my activity? Depending on what the change is, we recommend discussing all changes with your dedicated Event Manager to see if we can accommodate the change. Let's Get Started First Name: Last Name: Email: Number of Participants: Request A Quote Testimonials What Our Clients Are Saying You put together an organized, well-structured, and energetic activity I wanted to extend my greatest appreciation to you and your team for helping us create an unforgettable Corporate Castaways event. Your staff did an excellent job. You put together an organized, well-structured, and energetic activity that had everyone laughing and working their hardest to outwit, outlast, and outplay the other teams. Tillinger's It was exciting and engaging all the way through Excellent planning – the day ran smoothly – all of the Outback staff was friendly and knew exactly how to run all of the activities, so there was no down time. ll who attended raved about how fun the event was. Excellent! 10/10! Microsoft We could not have asked for a better crew What an amazing opportunity it was for some of our team members, who don’t regularly get to spend time with each other, come together for the day and really demonstrate their leadership and commitment. We could not have asked for a better crew. Such a high energy day and we really had a great time. Seasons Retirement Communities The Outback Team Building & Training staff were friendly, and it was a fun... The Outback Team Building & Training staff were friendly, and it was a fun event that incorporated leadership skills, listening skills, and communication. It was great! Time Warner Cable Everyone enjoyed it to the fullest The Corporate Castaways event was phenomenal and everyone enjoyed it to the fullest. There was a lot of team building that got competitive – and that was the fun part. The organization was phenomenal with all the tasks and puzzles we had to do. The team was great. We really loved the enthusiasm. Creation Technologies Never seen everyone with smiles as big as the ones they had on their faces as today Today we had a wonderful day with the Corporate Castaways activity. We had the whole company here – about 80 people. We were all competing, having fun, having laughs. I’ve never seen everyone with smiles as big as the ones they had on their faces as today. If you want laughter, you want fun, and want to make friends .. this is the way to do it. We can’t wait for next year. Puratos See More Explore Similar Events The Olympiad Challenge Ignite your team’s competitive spirit with Olympiad Challenge, an action-packed series of team-based games and challenges designed to boost morale, collaboration, and fun. Learn More Do-Good Games Make a difference while having fun with The Do-Good Games, a spirited team building activity where challenges combine teamwork with giving back to the community. Learn More Hollywood Murder Mystery Unravel the drama in Hollywood Murder Mystery, a thrilling activity where your team solves a high-profile case set in the glitz and glamour of Tinseltown. Learn More City Chase: Scavenger Hunt Discover your city like never before with City Chase, a thrilling team building adventure packed with challenges, puzzles, and exploration. Learn More Game Show Extravaganza Play in a game show-style competition and tackle photo and trivia challenges covering everything from pop culture to politics. Learn More Charity Bike Buildathon This indoor challenge will give you and your team the chance to build bicycles for children in need, bond as a group, and get creative with a fun, hands-on activity. Learn More Team Pursuit Unite your group with Team Pursuit, a dynamic activity where teams tackle a variety of mental, physical, and skill-based challenges to achieve shared success. Learn More Wild Goose Chase Turn your city into a playground with Wild Goose Chase, a fast-paced scavenger hunt where teams explore, strategize, and compete in a race to complete creative challenges Learn More Minute to Win It Turn up the energy with Minute to Win It, a fast-paced team building activity where your group races to complete fun, quirky challenges in just 60 seconds. Learn More The Amazing Chase Embark on The Amazing Chase, an exhilarating team building adventure that transforms your city into a thrilling racecourse filled with interactive challenges and excitement. Learn More Corporate Escape Rooms Challenge your team with Corporate Escape Rooms, where collaboration and quick thinking are essential to solve puzzles and escape before time runs out. Learn More Domino Effect Challenge Unleash your team’s creativity with Domino Effect Challenge, a hands-on activity where collaboration is key to building an elaborate chain reaction masterpiece. Learn More CI: The Crime Investigators Step into the role of detectives with CI: The Crime Investigators, a thrilling mystery-solving activity where teamwork and problem-solving take center stage. Learn More Clue Murder Mystery Dive into Clue Murder Mystery, a captivating team building activity where your group works together to solve a thrilling whodunit. Learn More Random Acts of Kindness Inspire positivity with Random Acts of Kindness, a heartwarming team building activity where your group works together to spread goodwill in your community. Learn More Cardboard Boat Building Challenge Unleash your team’s ingenuity in the Cardboard Boat Building Challenge, a thrilling activity where collaboration meets creativity as you design, construct, and race boats from cardboard. Learn More Campus Goose Chase Discover your campus in a whole new way with Campus Goose Chase, a fast-paced scavenger hunt filled with fun challenges and friendly competition. Learn More Picnic Party Games Add excitement to your outdoor event with Picnic Party Games, a lively collection of classic and creative challenges designed to bring your team together. Learn More Request A Quote Buy Now > Team Building In Person Virtual Self Hosted Charity & Philanthropic Team Building Events Escape Room Indoor Team Building Activities Outdoor Top Blog Posts 5 Low-Cost Team-Building Activities for Holiday Office Parties An Event Planner’s Guide to Epic Company Kick-Off Meetings 8 Essential Topics to Cover in Your Kick-Off Meeting Agenda Building Engagement Through Employee-Led Initiatives Additional Links Team Building Locations in the USA Team Building Locations in Canada Frequently Asked Questions Some of Our Satisfied Clients Outback Team Building & Training Blog Free Downloadable Resources for Team Building, Training, and Coaching Contact Us 1-800-565-8735 info@outbackteambuilding.com Proud Member Of: © 2025 Outback Team Building, All Rights Reserved Site Map Privacy Policy"
    },
    {
      "url": "https://castaway.younglife.org/parents/",
      "text": "Parents - Castaway Club Young Life Camp Home At Camp Scrapbook Videos Parents Volunteers Wranglers Interns Bookings Development Contact GIVE Home At Camp Scrapbook Videos Parents Volunteers Wranglers Interns Bookings Development Contact If your child is planning a future trip to Castaway or is here right now, we want you to have the information you need to rest easy while he or she is away. There are many activities at camp in which your child may be participating. Whether they are challenged on the climbing tower, kayaking or playing in the game room, their safety is our top concern. Safety Health Forms Summer What to Bring: Hangout at camp clothes Sunscreen and bug spray Bathing suit Beach towel At least one pair of long pants for some activities Spending money for snack bar, store & coffee shop Pajamas Warmer clothes for cold evenings Close-toed shoes for some activities There may be a Themed dinner/evening. Check with your Leader for details. Messy outfit (that can be thrown out) Toiletries Rain Jacket Camera (not a phone) Medication, if needed NOTE: Camps will stock OTC medications or their generic equivalent. These do not need to be brought to camp. If a camper brings OTC medications to camp, they will be collected and administered along with prescription medications. Castaway does provide sheets or bath towel. Safety Young Life and Castaway Club maintain the highest level of safety and standards in operation of all of our activities at camp.Â All ofÂ Castaway'sÂ challenge course elementsÂ (climbing tower, swing and zip line) are inspected annually by a registered Preferred Vendor Member of The Association of Challenge Course Technology. All elements are operated and supervised by our staff who have been fully trained and certified to do so, ensuring your child's comfort and safety. Castaway's Waterfront Program is also facilitated by trained and experienced staff. Your child willÂ be in good hands while atÂ Castaway Club. In the event of an unexpected accident, there is always a qualified medical professional on call to tend to your child's needs. Also, if needed, the local hospital is only a short drive away. Learn More Accessibility We welcome kids of all abilities to our camps. At Castaway, all of our main buildings are accessible to strollers or wheelchairs, and we have a handful of cabins that are designed to be accessible (special housing needs may be requested by your child's trip leader). Walkways around camp are paved. We will also do our best to help every guest participate in activities. We want every kid to have the best week of their life as they come to camp! Contacting Your Child Phone: 218-325-3550 Campers will not have access to office phones. If you call, the office staff can take a message and get it to your camper. Email: castawayc@castaway.younglife.org Â Physical and Mailing Address: Castaway Club â â â â â â â â â â â â â â â â â â â â â â â â â â â â â â â â â â â â â â â â â â â â â â â â â â â â â â â â â â Attn: (Child's name): Camper â â â â â â â â â â â â â â â â â â â â â â â â â â â â â â â â â â 51709 County Hwy 31 Detroit Lakes, MN 56501 Office Hours Summer Hours: 8:00 a.m. to 6:00 p.m. CST â â â â Every Day School Year Hours: 8:00 a.m. to 4:00 p.m. CST â â â â Monday through Friday â Sign Up for Camp For summer and weekend camps, all spots are given out to individual Young Life areas and retreat groups. These areas and groups fill their allocated spots with students from their local town. If you are interested in attending camp or finding out how to send your child to Young Life camp, contact your local Young Life office . They might not be attending camp at Castaway, but they most likely have a trip planned to one of Young Life's other fabulous properties! To find the Young Life office nearest to you, go here: younglife.org/find Contact Us: Contact Us: This form is for general questions. If youâd like to book a retreat, please do so here . If you want to sign up for a retreat or camp trip, please contact the organizer of the trip. To sign up for a Young Life camp week, use our locator to find your local Young Life Office website. YOUNGLIFE.ORG CONTACT GIVE â Â© 2004-2024 Young Life. All rights reserved."
    }
  ]
}