{
  "fuentes": [
    {
      "url": "https://catellicigars.com/about-us",
      "email": "contact@sansoxygen.com"
    },
    {
      "url": "https://creeksidecigarco.com/pages/contact-us",
      "email": "info@creeksidecigarco.com"
    }
  ],
  "mails": [
    "contact@sansoxygen.com",
    "info@creeksidecigarco.com"
  ],
  "nombre_sitio": "catellicigarlounge.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://catellicigars.com/about-us",
      "text": "Catelli Cigar Company Catelli Cigar Company Catelli Cigar Company Catelli Cigar Company Catelli Cigar Company Home Cigars Photo  Gallery About Us Contact Us More Home Cigars Photo  Gallery About Us Contact Us Catelli Cigar Company Catelli Cigar Company Catelli Cigar Company Catelli Cigar Company Home Cigars Photo  Gallery About Us Contact Us About Us CATELLI'S BACK! We are extremely happy to announce: CATELLI'S BACK! The past few years brought many questions and changes to the cigar industry. In the wake of all the uncertainty, we decided to take a break and try our hand in the retail side of cigars. With two shops under our belt, first, Riverside Cigar Bar and now, the Catelli Cigar Lounge in Vero Beach, Florida, we are now more educated in the retail and the wholesale sides of the cigar business. During this time, we received many inquiries about our cigars returning to the market. Making the difficult decision to take a break from our brand was eased knowing that when the time was right, we would be back. And now, we are. We are excited to bring our first release, the Catelli Boxare, back to market. The Boxare, a rich box-pressed San Andreas Mexican Maduro with a  Nicaraguan binder and filler comes in Boxare's three original sizes: Robusto, Toro, and Gordo.  Simply delicious! So, stay tuned. The cigars are currently aging and we will continue adding information to this site to keep you updated. If you have any questions, please use our \"Contact Us\" page and we will answer you. We're excited to be back and can't wait to share our Favorite Girls with you! Thank you, Catelli Cigar Company Copyright © 2024 Catelli Cigar Company - All Rights Reserved. Home Cigars Photo  Gallery About Us Contact Us This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://creeksidecigarco.com/pages/contact-us",
      "text": "Get in Touch With Us – Creekside Cigar Co Skip to content Pause slideshow Play slideshow Voted PCA Best of the Leaf 2025 – Cigar Lounge of the Year Voted PCA Best of the Leaf 2025 – Cigar Lounge of the Year . . . Site navigation Search Search Close Creekside Cigar Co Search Account 0 Cart . . . Site navigation Close Search Search Close Cigars New Arrivals Las Calaveras Sampler Foundation Wise Man Lancero Sampler Aganorsa Brand Sampler OZ Family Karatoba Warped Corto Maduro Rojas Blue Bonnet Samplers Crowned Heads Premium Sampler Connecticut Sampler Habano Sampler Maduro Sampler Espresso Pairing Sampler Shop All Samplers Boxes Las Calaveras 2025 Robusto Jeremy Jack El Chapo Warped La Colmena Rodriguez Reserva Privada Avowed 'The Vow' Creekside Customs Latest Release: Frontier Limited Edition HVC Edicion Especiales LE Merch Hats Accessories Watch Our Content Visit the Lounge Hours & Location Membership FAQ Join the Club Search Search Close Goes great with Quick shop Add to cart Crowned Heads Premium Sampler $55 00 $55.00 Quick shop Add to cart Foundation Wise Man Lancero Sampler $60 00 $60.00 Quick shop Sold Out Espresso Pairing Sampler from $65 00 from $65.00 Quick shop Sold Out Best with Bourbon Sampler $70 00 $70.00 Add order note Close Subtotal $0.00 Check out Shipping, taxes, and discount codes calculated at checkout. Your cart is currently empty. Cigars Expand submenu Cigars New Arrivals Expand submenu New Arrivals Las Calaveras Sampler Foundation Wise Man Lancero Sampler Aganorsa Brand Sampler OZ Family Karatoba Warped Corto Maduro Rojas Blue Bonnet Samplers Expand submenu Samplers View all Crowned Heads Premium Sampler Connecticut Sampler Habano Sampler Maduro Sampler Espresso Pairing Sampler Shop All Samplers Boxes Expand submenu Boxes Las Calaveras 2025 Robusto Jeremy Jack El Chapo Warped La Colmena Rodriguez Reserva Privada Avowed 'The Vow' Creekside Customs Expand submenu Creekside Customs Latest Release: Frontier Limited Edition Expand submenu Limited Edition HVC Edicion Especiales LE Merch Expand submenu Merch View all Hats Accessories Watch Our Content Visit the Lounge Expand submenu Visit the Lounge Hours & Location Membership FAQ Join the Club Confirm your age Are you 21 years old or older? No Yes Come back when you're older Sorry, the content of this store can't be seen by a younger audience. Come back when you're older. Oops, I entered incorrectly Hours Sunday: 12pm-9pm Monday: 11am-9pm Tuesday: 11am-9pm Wednesday: 11am-9pm Thursday: 11am-11pm Friday: 11am-11pm Saturday: 11am-11pm Contact 513-630-1044 1381 US-22 Maineville, OH 45039 info@creeksidecigarco.com Lounge Address 1381 US-22 Maineville, OH 45039 Creekside Cigar Co. Privacy Policy Creekside Cigar Co respects your privacy. If you sign up for any of our engagement and outreach programs, including those that use SMS text messaging, we ONLY use information you provide to transmit your mobile messages and, upon request, respond to you directly. This includes sharing information with our program partners, message content providers, phone companies, and vendors who assist us in the delivery of mobile messages. EXCEPT AS SET FORTH IN THIS SECTION, WE DO NOT SELL, RENT, LOAN, TRADE, LEASE OR OTHERWISE TRANSFER FOR PROFIT ANY PHONE NUMBERS OR CUSTOMER INFORMATION COLLECTED THROUGH PROGRAMS TO ANY THIRD PARTY. We do reserve the right at all times to disclose any information as necessary to satisfy any law, regulation or governmental request, to avoid liability, or to protect our rights or property. When you complete forms online or otherwise provide us information at point of sale, you agree to provide accurate, complete, and true information. Subscribe today to hear first about our sales Enter your email Subscribe Subscribe Shop Cigars Merch Visit the Lounge Watch our Content Join the Club Customer Care Manage Subscriptions Contact Us FAQ Return Policy Shipping Policy My account About About Us Visit the Lounge Get in touch Email us Follow us Facebook Instagram TikTok YouTube We accept American Express Apple Pay Diners Club Discover JCB Mastercard Visa © 2025\n              Creekside Cigar Co\nNamed Lounge of the Year by PCA Best of the Leaf Awards 2025, located in Cincinnati, Ohio Privacy Policy Terms of Service Get in Touch With Us"
    }
  ]
}