{
  "fuentes": [
    {
      "url": "https://thecocktailpost.co.uk/",
      "email": "events@thecocktailpost.co.uk"
    },
    {
      "url": "https://pbjacksonville.com/local-vendors/wedding-catering-and-beverage-services/catered-cocktails/",
      "email": "ann@premierbridenefl.com"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "email": "info@scibpaints.com"
    },
    {
      "url": "https://catered-cocktails.com/",
      "email": "cateredcocktails@comcast.net"
    },
    {
      "url": "https://catered-cocktails.com/contact/",
      "email": "cateredcocktails@comcast.net"
    },
    {
      "url": "https://catered-cocktails.com/about/",
      "email": "cateredcocktails@comcast.net"
    },
    {
      "url": "https://catered-cocktails.com/services/",
      "email": "cateredcocktails@comcast.net"
    },
    {
      "url": "https://www.zola.com/wedding-vendors/wedding-bar-services/catered-cocktails-llc",
      "email": "clara-and-bradley-invitation@2x-3299068d7eaf55fe79c0.png"
    },
    {
      "url": "https://talesofthecocktail.org/everything-you-need-know-about-cocktail-catering/",
      "email": "info@talesofthecocktail.org"
    },
    {
      "url": "https://www.cateredcreationsinc.com/contact-us/",
      "email": "orders@cateredcreationsinc.com"
    },
    {
      "url": "https://catered-cocktails.com/faq/",
      "email": "cateredcocktails@comcast.net"
    },
    {
      "url": "https://www.cocktailscatering.com",
      "email": "info@cocktailscatering.com"
    },
    {
      "url": "https://www.cocktailscatering.com",
      "email": "info@cocktailscatering.com"
    }
  ],
  "mails": [
    "ann@premierbridenefl.com",
    "cateredcocktails@comcast.net",
    "clara-and-bradley-invitation@2x-3299068d7eaf55fe79c0.png",
    "events@thecocktailpost.co.uk",
    "info@cocktailscatering.com",
    "info@scibpaints.com",
    "info@talesofthecocktail.org",
    "orders@cateredcreationsinc.com"
  ],
  "nombre_sitio": "catered-cocktails.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://thecocktailpost.co.uk/",
      "text": "Mobile Bar Hire - The Cocktail Post Home Info About us FAQs Weddings Parties Corporate Mocktails Our Menu 07881 025173 Get quote Home About us Our Menu FAQs Weddings Parties Corporate Mocktails Menu 07881 025173 The Cocktail Post: Mobile Bar Hire Professional mobile bar and Cocktail Bar Hire. The Cocktail Post provides drinks which create stories for you and your\r\n                    guests. Get A Quote Call Now AWARD WINNING CATERERS OUR MOBILE BAR SERVICES Wedding Bar Congratulations! Your big day is approaching.  As you make plans for one of the most important days of your life, we want to help keep the stress at a minimum. With our professional mobile bars for your wedding, we will create an unforgettable day for your family, guests and most importantly you and your partner. Our bespoke Wedding Cocktail Bar Hire services allow us to tailor to your needs and budgets. View Weddings Company Parties Whether it’s a staff party, client evening, company party or team building you want to organise, our mobile cocktail bar from The Cocktail Post is the perfect addition. Pick your cocktails, choose a bar, and let us provide a professional and stress free service. Combined with our delicious cocktails and drinks, we have it all View Corporate Private Events Let the barty begin! Whether its an 18th birthday, 21st, 30th or 50th, our mobile bar hire is the best to hire for the occasion. No matter the celebration our style of mobile bars will add the finishing touches to the event. We cater for all types of events. Our professional mixologists and bar staff will create a stress free experience with speed. View Parties Alchemy & Mixology Our mocktail bar/menu has been designed for those who do not drink alcohol or would like not too. We very much encourage a mocktail menu/bar at your event. With guests more and more not drinking alcohol, its a good idea! The drinks are delicious! View Mocktails Reinventing Mobile Bar Catering Brothers Harry and Charlie were quite literally born and raised in the catering industry. Their parents owned and operated a restaurant, so they understood every facet of running a successful catering business. Creating great food, and providing a customer experience second to none, is practically in their DNA. Harry and Charlie in the last few years created a pizza van company now with 10 pizza vans operating around the UK. With their family owned company they now employ not only family members but also a full team who look after each customers events to ensure their event is a success and with other 300+ 5* reviews, they have created a trusted customer base. The CockTail Post is there new venture. Already doing drinks from their food vans, they decided it was time to bring a mobile bar to their brand. With customers constantly asking them for a mobile bar, they knew it was time to create one. Mobile Bar Hire: What Makes Our Mobile Bar so Different? Our mobile bars have been created by top mixologists in order to create the best experiecence for you and your guests, That means a fast flow of beautiful crafted cocktails and drinks. Mixologists who put on the best performance and drinks on display. The owners, Harry & Charlie wanted to create the best mobile bars. No cut corners or poorly designed bars but instead the most efficient and best looking mobile bars the UK has seen. We dont just pour drinks for you and your guests we put on a show. Our mixologists have years of experience and the team are dedicated to putting on the best experience for you and your guests. We don't tie you down to a standard menu either. We will work with you to put together a bespoke menu for your event. We have our signature cocktails famous in the mixologist world however we are unique to taste buds and will create a bespoke menu for you and your guests to match the event or theme. Book Now As featured in ... Alchemist Mixologists Step into the enchanting world of The Cocktail Post, where alchemist mixologists take your event to the next level! Our skilled bartenders use the magic of dry ice and creative mixology to create cocktails that are as mesmerizing as they are delicious. Each drink is crafted with precision, swirling with mist and bubbling with mystery, to bring an unforgettable sensory experience to your guests. Perfect for adding a touch of intrigue and sophistication, our mobile bar transforms any event into a captivating cocktail journey—tailored to be as unique as your celebration. Contact Now Read what our guests think For our Birthday Party we had that cocktail set up in the garden, it looked super cute and he made awesome cocktails. We had a section of four different drinks, served in proper glasses and they were very professional made. Definitely would go for it again! 😊👍 Sophia Came to my party and it was a blast! They were very quick and professional throughout the whole night. The cocktails went down really well with everyone and the variety of choices were great too. Would definitely have them back again! Navarra C Would definitely recommend!! The Scarlett sip was amazing and so were the mocktails!! Which were so creative Sandrine M Incredible Cocktails! The mixologist was very professional and charismatic! G.K Mixologist really knew his stuff and was really friendly, good vibes! Fast as well, really impressed 👍 Alex B Read All Reviews Who's partied with us How We Work No matter the event or style we will accommodate for you and your guests. Get in touch with us either by phone or email and we will take you through the set up options and the best service to suit your event. No ask is out of reach with The CockTail Post. We will do everything we can to cater for you in order to create the best experience possible. However, let's leave our Mixologists with their clothes on please. Once you have sent a web form off to us for a quote we will guarantee a quote sent back within 24 hours . That way you can book our mobile bar with ease knowing The Cocktail Post is taking all the stress away from you. Book Now Wedding Mobile Bar \"Bloody Marry Me!\" Whether set in the city or the countryside, this is your special day. And here at The Cocktail Post we go the extra mile to make sure that you and your guests really get the best unique and stress free experience. With a family run business and the best team, our only job is to ensure that you don't need to worry about us but instead your big day. Our mixologists will put together the best bespoke menu for you and your guests. We're available for bookings at all times of the day or night however we recommend day drinkers to take a break.... Our team of friendly professional Mixologists and servers will be on hand to take the very best care of your guests. Book Now Mobile Bar for Parties \"Trust me you can dance\" - Vodka When you are planning a party, be it for yourself, or for somebody else, you want to know that the mobile bar you have hired know what they are doing. Well our mixologists are artists in their own right. Every now and then they throw a move as if they are starred in the Tom Cruise movie “Cocktail”. “Alcohol may be man’s worst enemy, but the bible says love your enemy.” — Frank Sinatra Our stylish mobile bar fit all style of events and parties. They have been designed in a bespoke manner in order to capture efficiency, speed, good looking and style. View Menu Corporate Bar With a wealth of experience in corporate events, The Cocktail Post can be trusted to create stress free event for you and your team/clients. Our team of bartenders and mixologists have worked around the world for all types of clients in all sectors, and for events of all sizes. Our stress free mobile bar will flair the feet off you and your guests. Having worked with big brands such as Lamborghini, Netflix, Warner Bros, Dior and other big hollywood names and brands, we know what it takes to put on a good catering experience and bring joy to the event with our mobile bar. Our experienced team of mixologists and staff will help deliver the best experience for you and your guests. Book Now Cocktails or Mocktails: A Drink For Everyone No matter who you have coming to your event, our mobile bar will be there to cater for everyone. As well as our alcoholic drinks we also craft delicious mocktails and non alcoholic drinks. In fact around 25% of guests at weddings prefer to not drink alcoholic drinks. So weather its at wedding or a party, our mocktail drinks will be on hand. That way you dont need to worry about any of your guests as The Cocktail Post caters for all. To make it special for our light drinkers, our mixologists have concocted a lovely variety of mocktails and non alcoholic drinks to satisfy all taste buds. Choose your mocktail from our menu and wow your guests. Book Now Our Packages Include With our full Events and Mobile Bar packages, you can just sit back, relax and leave it all to us to\r\n                organise the whole event from start to finish, leaving you free to focus on your guests. We cater for\r\n                all events, whether it’s a staff party, wedding, corporate event, birthday party. Stess free for you. DRINKS FROM MENU MIXOLOGISTS & BAR STAFF MOBILE BAR GLASSWARE SPIRITS & INGREDIENTS View Menu Ready to book, or just want to chat? Give us a call or fill out the form below: First Name* Last Name* Company Email* Phone* Event Postcode* Event Type Select Event Type Party Wedding Corporate Other Nº of Guests* Date of Event* Serving Time* How Did You Hear About Us?* How did you hear about us? Google Email Referral Instagram Facebook LinkedIn TikTok Feast It Add To Event Leaflet Bark Poptop Existing Customer Additional Information NOTE: By submitting this form I consent to The Cocktail Post contacting me in accordance with their Privacy Policy . 07881 025173 events@thecocktailpost.co.uk THE PIZZA POST LTD: Company # 13431962 Turners Hill Road, Crawley Down RH10 4HQ 51 Arnhem Place, London, E14 3RU Menu Privacy Policy © 2025 All rights reserved. Owned by: The Pizza Post LTD: Company # 13431962 Website by Click Tweak Digital Marketing"
    },
    {
      "url": "https://pbjacksonville.com/local-vendors/wedding-catering-and-beverage-services/catered-cocktails/",
      "text": "Catered Cocktails - Catered Cocktails Sign In Forgot Password? Create an Account User Registration Email Address * Password * If you are human, leave this field blank. Next FL - Gainesville/Ocala FL - Jacksonville & St. Augustine FL - Orlando WI - Madison WI - Milwaukee / SE WI WI - North East / Central Advice & Planning Blog Galleries Wedding Planning Guide Real Weddings Local Vendors 2023 Favorite Wedding Pros 2024 Best Wedding Pros Accommodations - Bed & Breakfasts Animal Rentals - Butterfly & Dove Release Beauty, Hair & Makeup Cakes & Sweets Catering & Beverage Services Celebrations - Bachelorette Parties - Bridal Showers - Rehearsal Dinners & Restaurants Ceremony Sites & Chapels Coordinators & Wedding Planners Dance Instruction Decor, Linens & Rentals - Favors & Gifts DJ's, Music & Entertainment - Bands - Ceremony Musicians & Vocalists Flowers Free Copy of Premier Bride Grooms Guest Experiences Health & Fitness Home Services Honeymoons & Travel Agents - Destination Weddings Invitations & Calligraphy Jewelers Officiants & Clergy Other Photo Booths Photographers Premier Bride Expo Exhibitors Reception Venues - Reception Sites - Not in NE Florida Registries & Gifts Rehearsal Dinner Restaurants Resources & Associations Things To Do in the 904 Transportation Unique Products & Services Videographers Wedding Dresses & Bridal Salons - Alterations - Custom Design - Bridal Accessories Featured Vendor Fern Oak Estate Pomona Park, FL Shows & Events Submit Your Event View Magazine View Book – Summer/Fall 2025 View Book – Winter/Spring 2025 View Book – Summer/Fall 2024 View Book – Winter/Spring 2024 View Book – Summer/Fall 2023 Feature My Wedding Advertise with Premier Bride of the 904 Contact Sign Up/Login Home Vendors Catering & Beverage Services Catered Cocktails Catered Cocktails Login to bookmark vendors! Address 1833 Kings Way, Neptune Beach, FL, USA Phone 904-246-4410 Website View Site Contact Us Get Directions About Catered Cocktails is a mobile bar service company in Jacksonville Florida.  They were nominated for 2023 Favorite Bar Tending Companies in the 904. About Us The Premier Bride Brand Terms of Use Privacy Policy Contact Us Email Us at ann@premierbridenefl.com Call Us at 904-502-4919 Designed and developed by Sperling Interactive . Follow Us Sign Up for Special Offers Newsletter Signup Email * reCAPTCHA If you are human, leave this field blank. Submit Advice & Planning ▼ Blog Galleries Wedding Planning Guide Real Weddings Local Vendors 2023 Favorite Wedding Pros 2024 Best Wedding Pros Accommodations - Bed & Breakfasts Animal Rentals - Butterfly & Dove Release Beauty, Hair & Makeup Cakes & Sweets Catering & Beverage Services Celebrations - Bachelorette Parties - Bridal Showers - Rehearsal Dinners & Restaurants Ceremony Sites & Chapels Coordinators & Wedding Planners Dance Instruction Decor, Linens & Rentals - Favors & Gifts DJ's, Music & Entertainment - Bands - Ceremony Musicians & Vocalists Flowers Free Copy of Premier Bride Grooms Guest Experiences Health & Fitness Home Services Honeymoons & Travel Agents - Destination Weddings Invitations & Calligraphy Jewelers Officiants & Clergy Other Photo Booths Photographers Premier Bride Expo Exhibitors Reception Venues - Reception Sites - Not in NE Florida Registries & Gifts Rehearsal Dinner Restaurants Resources & Associations Things To Do in the 904 Transportation Unique Products & Services Videographers Wedding Dresses & Bridal Salons - Alterations - Custom Design - Bridal Accessories Featured Vendor Fern Oak Estate Pomona Park, FL Shows & Events ▼ Submit Your Event View Magazine ▼ View Book – Summer/Fall 2025 View Book – Winter/Spring 2025 View Book – Summer/Fall 2024 View Book – Winter/Spring 2024 View Book – Summer/Fall 2023 Feature My Wedding Advertise with Premier Bride of the 904"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "text": "Contact Us: Get In Touch With Asian Paints for your Painting Needs Contact Us: We’d Love To Hear From You 16815 Popular searches Interior Paints Exterior Paints Shade cards SEARCH RESULTS {{searchItem.map.shadeCode}} {{searchItem.map.shadeFamilyName}}: {{searchItem.map.shadeName}} {{searchItem.map.title}} RELATED SEARCH NO MATCHES FOUND! Did you mean? {{spellCheck}} Log-In Hello! Hello! Signout en ar {{minicart.cartcount > 0 ? minicart.cartcount : 0}} ↻ Processing... You have {{minicart.cartcount}} items {{item[\"product\"][\"name\"]}} - + ₹ {{item[\"totalPrice\"][\"value\"]}} Total ₹ {{minicart.totalprice}} Checkout ↻ Menu PAINTS & COLOUR PAINTS & COLOUR Services Services WATERPROOFING WATERPROOFING INSPIRATION INSPIRATION Login/Register PAINTS & COLOUR All PAINTS & COLOUR EXPLORE COLOURS Colour Catalogue Home Colour Guide PAINT PRODUCTS Interior Paints Exterior Paints Waterproofing Wood Paints Metal Paints Undercoats RESOURCES Paint Budget Calculator Ideas Gallery Colour visualizer SERVICES Paint Store Near Me Book Painting Services Services All Services Beautiful Homes Painting Service Scib Stars WATERPROOFING All WATERPROOFING Bathrooms Terrace and Tanks Roof & Basement Interiors Tiling All Products INSPIRATION All INSPIRATION Get Inspired Paint calculator Gallery Colour Next Guides DecorPro Resources Colour Visualizer Ideas Gallery Please enter your mobile number To receive the dealer details on SMS Mobile * SUBMIT Get in Touch We’d love to hear from you Head Office Scib Chemical S.A.E 6th of October Cirt, 4th Industrial (1/3/B)B Tel:            (+202)38281090-99 Fax: (+202)38331271 Scib Paints Helpline* For enquiries, feedback and complaints please call on 16815 or write to us at info@scibpaints.com Mobile number +91 00:59 ↻ ↻ Need help with your painting needs? Fill the form below to book a free site evaluation by a Scib Paints Beautiful Homes Painting Service expert. Name Mobile Number +20 Governorate * Email By proceeding, you are authorizing Scib Paints and its suggested contractors to get in touch with you through calls, sms, or e-mail. Book an appointment ↻ Thank you! We value your interest in Scib Paints Beautiful Homes Service. We will get in touch with you shortly to schedule a visit by an expert. Try again! Oops! Something went wrong. We couldn't process your request. Please try again? Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Our Divisions More about Asian Paints Congratulations You have subscribed. Contact Us 16815 EMAIL ABOUT Research & Technology Careers Contact Us Certificates RESOURCES FAQs POLICIES Quality Policy Customer Policy Cookie Policy Environment Policy EHS Policy TOOLS Colour Catalogue Color with AP APP/Website​ COUNTRY EGYPT Country EGYPT India GLOBAL BANGLADESH MIDDLE EAST FIJI NEPAL SRI LANKA ETHIOPIA CONNECT DOWNLOAD OUR PAINTING APP CONNECT WITH US ©Scib Paints - All rights reserved Congratulations You have subscribed. Welcome User Login OR Continue as guest You have been successfully logged out Login An OTP has been sent to your registered mobile number and email id. 00:00 Resend By clicking submit, I agree to terms and conditions SUBMIT Register Please enter the 5 digit OTP sent via SMS to verify your mobile number! 00:00 Resend I agree to terms and conditions SUBMIT Please enter your mobile number To receive the dealer details on SMS SUBMIT Provide a delivary address Fullname* Email* Mobile* +91 Flat/House No/Floor* Colony/Street/Locality* Landmark City* Pincode* SUBMIT User already exist redirecting you for the login page Waterproofing Calculator Get an instant estimate Calculate now"
    },
    {
      "url": "https://catered-cocktails.com/",
      "text": "Home | Catered Cocktails Top Facebook Instagram Pinterest Catered Cocktails bar services Book Now Services Gallery About Us FAQ Contact Blog About Bar Experiences YOUR GUESTS WILL THANK YOU FOR Hi, Welcome! We are so happy you are here visiting with Catered Cocktails. You must have a great social event coming up where you need a bar, bartenders, and an excellent bar experience for your gathering. We are just the people to make that happen, and we make it easy! Let’s face it, there are typically two main concerns when you are planning your bar; having a well stocked bar and getting a drink in your guests hands quickly.  Our expertise ensures we’ve got that covered as well as all the other details! Our personable, warm, smiling, fun, experienced and professional team are here to gather all the information you have, ask the questions to get the details maybe you hadn’t thought of yet, guide you through any questions and ultimately provide you and your guests a top-notch bar experience that your guests will be raving about! Cheers! We’d love to discuss your upcoming event GET IN TOUCH WITH US here's what our clients have to say “Thank you for being so thorough.  It’s nice to work with someone who knows their stuff!...” “I was in awe at the wedding of their presentation and quality of work” “Catered Cocktails took care of every detail and one of *the best* investments of all our wedding vendors…” “Everyone at my event loved the bartenders!” “Melissa & her team were amazing and made the bar one less thing to worry about.  Melissa was always available for questions, no matter how small…” tell us about your event Your name Please enter your name. Your email Please enter a valid email. Your message Please enter a message. Send Message Sent! Message failed. Please try again. CONTACT US cateredcocktails@comcast.net 904.246.4410 Office 904.502.0562 Cell LET’S GET SOCIAL Facebook Instagram Pinterest FOLLOW US ON INSTAGRAM @CATEREDCOCKTAILSJAX Copyright © 2025 · Catered Cocktails · Designed by Fancy Girl Designs · Strategy by Ginny Krauss"
    },
    {
      "url": "https://catered-cocktails.com/contact/",
      "text": "Contact | Catered Cocktails Top Facebook Instagram Pinterest Catered Cocktails bar services Book Now Services Gallery About Us FAQ Contact Blog About Contact Us Contact Form Please fill out the form below and we will be in touch. CONTACT US cateredcocktails@comcast.net 904.246.4410 Office 904.502.0562 Cell LET’S GET SOCIAL Facebook Instagram Pinterest FOLLOW US ON INSTAGRAM @CATEREDCOCKTAILSJAX Copyright © 2025 · Catered Cocktails · Designed by Fancy Girl Designs · Strategy by Ginny Krauss"
    },
    {
      "url": "https://catered-cocktails.com/about/",
      "text": "About | Catered Cocktails Top Facebook Instagram Pinterest Catered Cocktails bar services Book Now Services Gallery About Us FAQ Contact Blog About About Us We are family owned and operated business that started in 2003 by husband and wife, Melissa & Erik.  We met many years ago when we were both in the hospitality industry.  Now we have been married almost 25 years, together for 30 years, and have raised 2 awesome kids.  #Blessed We LOVE hosting and making sure everyone always feels welcome and has a good time, whether it’s in our home or at your event.  Our southern upbringing and years and years of experience as hospitality professionals has a big role in how we approach our events Our Promise To You We treat our clients like family, and it’s not unusual for our meetings to end in hugs instead of handshakes.  We believe every occasion deserves warm, genuine and authentic connections.  It’s our goal to provide that to you. Large Scale Events Catered Cocktails has been a part of 7 large-scale events over the years such as One Spark, Sea & Sky Spectacular, World of Nations, and the Jacksonville Jazz Festival.  This experience gives us the advantage in logistics and management of multi day, multi serving station events.  If you are planning an event in Northeast Florida or South Georgia and need assistance in managing the bar piece of the event, please contact Melissa to schedule a consultation. LET'S CHAT CONTACT US cateredcocktails@comcast.net 904.246.4410 Office 904.502.0562 Cell LET’S GET SOCIAL Facebook Instagram Pinterest FOLLOW US ON INSTAGRAM @CATEREDCOCKTAILSJAX Copyright © 2025 · Catered Cocktails · Designed by Fancy Girl Designs · Strategy by Ginny Krauss"
    },
    {
      "url": "https://catered-cocktails.com/services/",
      "text": "Services | Catered Cocktails Top Facebook Instagram Pinterest Catered Cocktails bar services Book Now Services Gallery About Us FAQ Contact Blog About Bar Services Our job is to provide a service that best meets YOUR needs.  Therefore, we can provide as much or as little as you like. Some people prefer to do the legwork, shopping (we offer a list!), and hauling so they pay less out of pocket to us.  But we find the best bang for your buck is our full service. Life is busy, time is valuable and so is your money. With our full-service choice, you can truly check the bar off your to-do list and be confident that everything you need (remember that well-stocked bar?) will be there.  No shopping, no hauling back and forth, no loading and unloading, no worries... Priceless! There are a lot of combinations when it comes to what type of bar to have but we find these full-service options to be the most popular. We will work with you to create the best bar experience for you! BOTTLED BEER & WINE Bartender Bar Rental From Our Inventory Plastic Drinkware for Wine Cocktail Napkins Coolers & Ice for Chilling of Bottled Beer & Wine General & Liquor Liability Insurance Set Up & Breakdown Suggested Purchase Guideline Alcohol Consultation, Ordering & Delivery of Bottled Beer & Wine (with our partner vendor) starting at $425 BOTTLED BEER & WINE AND TWO SPECIALTY COCKTAILS Bartender Bar Rental From Our Inventory Plastic Drinkware for Wine & Cocktails Cocktail Napkins Straws Ice for Making Cocktails Coolers & Ice for Chilling of Bottled Beer & Wine General & Liquor Liability Insurance Set Up & Breakdown Suggested Purchase Guideline Alcohol Consultation, Ordering & Delivery of Bottled Beer, Wine & Specialty Cocktail Liquors (with our partner vendor) starting at $575 BOTTLED BEER & WINE AND UP TO FOUR LIQUORS Bartender Bar Rental From Our Inventory Plastic Drinkware for Wine & Cocktails Cocktail Napkins Straws Mixers Garnish Ice for Making Cocktails Coolers & Ice for Chilling of Bottled Beer & Wine General & Liquor Liability Insurance Set Up & Breakdown Suggested Purchase Guideline Alcohol Consultation, Ordering & Delivery of Bottled Beer, Wine & Liquor (with our partner vendor) starting at $750 Booking for Summer 2024 Planning a summer event? Let Catered Cocktails elevate your gathering with our premier bar catering service! Based in Jacksonville, FL, we specialize in providing everything you need for an amazing experience. We work with you to make sure your event has everything you need. Our offerings include professional bartenders, a wide selection of alcohol, and all the essentials to keep the drinks flowing. Whether it's a private party, corporate event, or any celebration, we're here to ensure your guests enjoy a seamless and delightful experience. Book us now to make your summer event truly exceptional! @cateredcocktailsjax Festivals Catered Cocktails is Jacksonville Florida’s leading premiere bar and beverage catering service.  Having been the bartending service for major city festivals such as One Spark, Sea & Sky Spectacular, and Jacksonville Jazz Festival among others, we have the experience your event will benefit from.  Managing eleven bars across six city blocks downtown, serving 250,000 people gives us successful logistical management for multi-day events in our city and yours too! Contact Melissa for assistance on your city’s next big event making the bar experience a great one! LET'S CHAT “We’d love to discuss your upcoming event, get in touch with us!” LET'S CHAT CONTACT US cateredcocktails@comcast.net 904.246.4410 Office 904.502.0562 Cell LET’S GET SOCIAL Facebook Instagram Pinterest FOLLOW US ON INSTAGRAM @CATEREDCOCKTAILSJAX Copyright © 2025 · Catered Cocktails · Designed by Fancy Girl Designs · Strategy by Ginny Krauss"
    },
    {
      "url": "https://www.zola.com/wedding-vendors/wedding-bar-services/catered-cocktails-llc",
      "text": "Catered Cocktails LLC | Wedding Bar Services & Beverages | Cost, Reviews & Photos | Zola Web Accessibility Find gifts, vendors, couples... Log in Get started Wedding websites Wedding venues Vendors Registry Invites and paper Guest list Budget Boutique Albums Mobile app Team-Z advisors Expert Advice Inspiration Honeymoons FAQs Contact us Find a couple Zola Baby Zola Home Zola for vendors Zola Baby Zola Home Zola for vendors Plan your wedding Expert advice Find a couple Log in Get started Wedding Vendors / Bar services and beverages / Wisconsin bar services and beverages / Madison, WI bar services and beverages / Catered Cocktails LLC View all ( 32 +) 32 Catered Cocktails LLC 5.0 ( 2 reviews ) About Catered Cocktails LLC Catered Cocktails LLC Get a quote Catered Cocktails is your professional on-site bartending and bar catering solution in South Central Wisconsin. For a custom proposal, please complete the contact form on our website (sorry, no pricing info provided here). Established in 2012, we have worked one on one with hundreds of wedding couples to execute their beverage service vision. Our partnered venues have grown to include Madison area parks, Event Centers, and wedding barns where we serve parties large and small. Unlike other vendors, we offer optional a la carte add-ons for a more comprehensive bar service experience. In addition to our licensed and insured bartenders, let us cater your ice, disposable cups, cocktail garnishes, beverages, and additional event staff for your convenience (some limitations apply). Included with each booking is our customized consultation service where we provide bar stock guidance and a specific event plan tailored to your unique needs. Services Services Bartenders Cleanup and breakdown Beverage services Bartending Beverage servingware rentals Mixers/non-alcoholic options Drink types Beer Liquor Mobile bar Non-alcoholic Signature cocktails Wine Extra costs Bartender services Extra hour of service Gratuity Rentals - beverage ware Service Fee Reviews Write a review 5.0 out of 5 2 reviews Write a review Catered Cocktails was great! • Verified review • Nicole O. • May 12, 2025 Catered Cocktails LLC was an excellent choice for our wedding bar services and beverages. From the very beginning, their communication was efficient, easy, and reliable, which made the planning process a breeze. The quality of their work and value was equally impressive - they were laid back and flexible, helping us decide on the perfect drink menu and shopping list for our special day. The bartenders were professional and attentive, ensuring our guests had everything they needed throughout the night. We were thrilled with the service Catered Cocktails provided and would highly recommend them to any couple planning their wedding. Response from vendor • May 13, 2025 Thank you for such a thorough review Nicole. It was a pleasure working with you in the months before your wedding and I'm thrilled things came together nicely. I'm happy to have been available on short notice for the rehearsal as well. Congrats to you! Would recommend! • Verified review • Tatiana E. • Nov 4, 2024 Catered cocktails bartended our wedding and did a phenomenal job! They were quick to meet our guests’ needs, and everyone loved our “signature cocktail!” Thanks so much!! Want to learn more about their pricing? Get a quote Want to learn more about their pricing? Get a quote Book a vendor on Zola and get 65% off save the dates . Terms Explore other vendors serving Madison, WI Howard Productions, LLC Aloha Erica Music - Acoustic Wedding Singer Rockton Sanctuary Spa Natashia Nicole Photography MoonTide Media Til Death Photo Film Yellowmoon Entertainment Lilylux Studio Allison Joy Photography LLC Maddie Shea Photography Charlie's Angels Photography, LLC DICK PRESTON | All-American Country Complete your dream team Madison Venues Madison Photographers Madison Beauty Professionals Madison Bands & DJs Madison Florists Madison Caterers Madison Planners Madison Cakes & Desserts Madison Videographers Madison Officiants Madison Event Extras Other bar services & beverages in Madison Zest in Class Dr. Bartender Tavern Team WI Refined Mixology Free Rein Mobile Bar Straight Up Sideways Alco-Haul North Village Coffee City Sips Mobile Bar Other wedding services nearby Janesville, WI Wedding Venues Beloit, WI Wedding Venues Plan your wedding Venues and vendors Guest list Wedding websites Registry Invites and paper Budget Boutique Albums Seating chart Mobile app About Our story Become a Zola vendor Reviews Zola Baby Careers Press Advice and support Expert advice FAQs Track order Start a return Return policy Contact us Team Z advisors Plan your wedding Venues and vendors Guest list Wedding websites Registry Invites and paper Budget Boutique Albums Seating chart Mobile app About Our story Become a Zola vendor Reviews Zola Baby Careers Press Advice and support Expert advice FAQs Track order Start a return Return policy Contact us Team Z advisors For all the days along the way Log in Find a couple Find a baby registry Get started Privacy Terms Do Not Sell / Share My Personal Information Web accessibility © 2025 Zola, Inc. All rights reserved."
    },
    {
      "url": "https://talesofthecocktail.org/everything-you-need-know-about-cocktail-catering/",
      "text": "Everything You Need to Know About Cocktail Catering - Tales of the Cocktail Foundation Skip to content About Our Mission Board of Directors Team Committees Tales of the Cocktail Foundation Code of Conduct 2023 Annual Report Tales of the Cocktail® Spirited Awards® Spirited Awards® Directory Spirited Awards® Archive Tales Catalyst Tales of the Cocktail TOTC Merch powered by Mover & Shaker Initiatives Cocktail Courier Beyond the Bar® Cocktail Apprentice Program® Philanthropy & Development Scholarship Program Grant Recipients Policy Initiative Virtual Cocktail Tour Past Initiatives Singapore x Tales Tales on Tour Contact Contact Us Privacy Policy Work with Tales Get Involved Partnerships Seminar Proposals TOTC Scholarship Stories Recent Behind the Bar Culture Destinations History Industry News In-Depth People Products Recipes Techniques Tours Wellness To search this site, enter a search term Events Partnerships Tales of the Cocktail Foundation Tales of the Cocktail Foundation platform seeks to act as a catalyst to Educate, Advance, and Support the global drinks industry and communities we touch. Everything You Need to Know About Cocktail Catering Posted on: Apr. 24, 2017 | Behind the Bar | By: Gray Chapman Facebook Tweet LinkedIn Pin Email Anyone who’s attended a wedding or a conference knows the crucial importance of a decent bar setup at an event — but for years, this realm of event planning somehow kept getting the shaft. Yet, as the cocktail movement has evolved over the last decade, private events are finally starting to get the hint that drinks require a little more thought, care and curation than “red or white?”. At the forefront of this sea change is the small but growing industry of cocktail catering, created to heed the call of event planners who want to put the same amount of detail and foresight into the bar as they do into things like decor and DJ. It only makes sense: drinks are, more often than not, the lifeblood of a good event. Why would someone shell out all that cash for Pinterest-perfect table settings while leaving thirsty guests hung out to dry? https://instagram.com/p/BS1d_IOjTMv/ This is good news not just for event-goers who enjoy a nice drink — it’s also great news for bartenders who are curious about alternative career options. Working for a cocktail catering company — or even starting your own — comes with its own unique set of rewards, challenges and surprises for those accustomed to a more traditional bar setting. To get the scoop, we chatted with two founders of successful cocktail catering companies: Belinda Kelly of Happy Camper Cocktail Co. in Washington state, and Michael Esposito of Snake Oil Cocktail Company in San Diego. Read below to see how they did it — and what it takes to pull it off while keeping their clients happy, their guests well served and their employees motivated: Tell us a little bit about yourself: what were you doing before you started doing this? Belinda Kelly, Happy Camper Cocktail Co. : Before starting my cocktail catering business I was a recruiter and event planner for Microsoft and sideline foodie/cocktail enthusiast. I had a couple of catering and waitressing jobs in college but never tended bar professionally. Michael Esposito, Snake Oil Cocktail: Prior to starting Snake Oil Cocktail I worked in Beverly Hills for a high-end technical AV company, which produced special events in L.A., New York and San Francisco. Basically, I would fly around the country on private jets helping produce extraordinary high-end events and fundraisers for world-class corporate clients and celebrities. The events were spectacular and the experience gave me insight to a world I didn’t even know existed. https://instagram.com/p/BSzqE-PFdw-/?taken-by=snakeoilcocktail Why did you decide to start your company? Kelly: With Microsoft recruiting I planned a couple hundred events per year and often found myself exasperated by the lack of options for a good happy hour event caterer. I noticed a surprising lack of farm to bar options in the Seattle area and too many “6 foot table, black linen” bars, and I decided to start a business that addressed both. Esposito: In the process of producing events, I realized that bar service was usually one of the last things that was considered in the total budget. This struck me as really strange because from an event flow perspective the bar at cocktail hour is usually the very first thing event guests encounter. Think about it, while most guests at corporate events likely have no interaction with the production team or the caterer, you can pretty much guarantee that every guest will have an interaction with a bartender and the quality of that interaction plays a huge role in setting the tone for the event experience to come. From a sociological perspective bartenders and mixologists at events aren’t just back of house staff; they serve a much more important role as direct proxies for the parties hosting the event and the brands who are sponsoring the event. The best event planners know the value of an elevated bar service and are increasingly selective about who they entrust with the privilege of representing their vision and interacting with their guests. What was that transition like? Kelly: I worked to start my business while still working a fulltime job and I highly recommend that. It gave me both the motivation and the security in the first year to continue on. I was used to long hours, so pulling double duty with the two jobs didn’t bother me, but entering a new industry and starting a business from scratch definitely involved a learning curve. I needed to immerse myself more deeply in craft cocktail knowledge and tradition, source locally farmed cocktail ingredients, supplement growing what I couldn’t source, start an LLC, navigate the Health Department, Department of Labor and our state’s liquor control board, market myself to applicable industries, hire a staff, do my own book keeping, etc. I tend to be pretty scrappy, so this challenged and inspired me and kept me going until we launched, and solving these problems on a daily basis is what continues to engage me. https://instagram.com/p/BQWnQ8BjoBR/ How has the industry changed since you launched? Esposito: When we started Snake Oil Cocktail Company, we wanted to provide a different kind of bar option to clients and create a bar service that would help consult with other bars to elevate the craft of cocktails. I remember after we did the bar at the Sundance Film Festival in 2010 I started handing out new business cards; people would get a kick out of the fact that we called ourselves “cocktail consultants” … and now it seems you can’t go to even a dive bar without running into a newly minted mixologist. When we founded our company pretty much all cocktails at local bars came from cans, it was such a shame because Southern California at the time had more local farms than anywhere in the US. Watching craft cocktail culture explode into suburbia and Middle America in less than a decade with bartending going from a thankless job to a full-blown profession and passionate mixologists billed as modern celebrities has been a remarkable journey. Do you think that, in general, guests’ expectations for the quality and creativity of cocktails at events has risen in recent years? Esposito: Absolutely! When we started Snake Oil Cocktail Company in 2010, clients rarely asked us to do a “tasting” prior to their event and they did not have the language to talk about cocktails. They loved fresh culinary cocktails because that style and our attention to detail was so foreign to them. Now, however, pretty much every wedding and corporate event wants to “see” and “taste” the signature cocktails in advance, it is not uncommon to talk to clients about their preferences on how to make a Manhattan, and for them to come into the initial client meeting with a Pinterest board of what style of cocktail they would like executed. With the rise of Instagram culture and the easy ordering availability of fresh produce ingredients that were not otherwise available locally, the creativity level is always getting pushed. https://instagram.com/p/BQwIGlBF8bL/ How do you market your business? Kelly: I rely on a combination of networking, social media, and a good website. I try to meet as many people who I might possibly learn from and may be able to help me as possible, and this effort constantly leads me to new opportunities. It’s also helped me to establish a good reputation among vendors, which leads to referrals. I also started building up my website, Instagram and Facebook accounts far before the camper bar (our initial service offered) was ever ready to be booked. Building my website and growing an online following took daily effort and was learned 100% from free Youtube videos and blogs from other entrepreneurs, because I had no money to spare. I’d say the majority of events our first year came from two sources: Instagram, and one public event that we did for a non-profit company at a pretty steep discount that lead to exposure to 3,000+ people. How did you decide what kind of (and how many) services you wanted to offer in the beginning? Kelly: Nailing down what I wanted to offer my clients really came down to me determining what kind of business I wanted to be and whether that business could be profitable. I knew I wanted to share Washington state’s awesome distilleries, wineries, breweries, and cideries with my clients because we have so much to offer here in Seattle and I am passionate about helping people discover their new favorites. I knew I wanted a seasonal, craft, farm to bar menu and for all of our mobile bars to have draft options. There are a lot of other cocktail caterers, and to be different and still take home a paycheck, Happy Camper Cocktail Co. needs to operate differently. I tried to fill holes I saw in the existing market with things I admired elsewhere, and my own ideas. https://instagram.com/p/BQbnLYKDl_a/?taken-by=happycampercocktails When you’re hiring bartenders for catering, what qualities do you look for? How is event catering different from regular bartending? Kelly: It’s definitely a different gig. The bartending we do at events tends to have a fixed menu, especially because for us, the client provides the alcohol according to our recommendations. That means you’re never going to be serving from a full bar, so I don’t need to waste time quizzing my bartenders on obscure recipes. The flow is also different, so while speed is important, we don’t tend to see more than 400 guests per night. However, the same guests are coming to you, over and over, all night, on some of the happiest occasions of their lives: weddings, birthdays, galas, retirement parties. What I look for in my staff is someone who is comfortable with ambiguity because no two catering jobs are ever the same, someone obsessed with creating a consistent, happy client experience, and creativity. A question I might ask would be, “if you have these 3 liquors, and these 7 mixers, and a fixed menu, but a guest asks for something different, what would you make them?” I also like to ask “what annoys you about customers?” In the service industry, it’s easy to become jaded behind a bar, night after “$3 well Friday” night. Our clients are celebrating and they want someone happy to serve them, so I look for someone who can bring that fun vibe. Esposito: Event cocktail catering is definitely not for everyone. When you are bartending at a traditional brick and mortar bar, everything is set up for you. It is easy to take for granted the perks of having a kitchen, a dishwasher, running water, a barback to assist you and to do the hard work of stocking your bar, and servers to take orders and pickup glassware. Prep work needs to get done pre shift but most of the time you can do it at a leisurely pace, then once your shift starts the harder you work the more money you make in tips. Event bar service is a completely different beast. First and foremost it is critical to understand that you are only one piece of someone else’s event vision. You have to know your role and be able to take direction from event planners, the end client, event sponsors, the venue manager, and everyone on the catering team. Oftentimes this is too much to ask for standard bartenders who are used to just showing up, pouring drinks, and making tips. There is simply no place for egos in event beverage catering. The number one problem I see is that many mixologists used to running their own ship simply fail to understand what this means. Not only do you have to provide great customer service to all guests but you also have to be willing to play the role of the bar back, the set up crew, and the clean up crew. Remember, everything you bring onsite needs to be unloaded set up and then broken down and reloaded out at the end of the event. At Snake Oil Cocktail, we hire staff based on personality and their ability to think on their feet. Anyone can be taught how to pour a great drink but very few can be taught how to be polite and how to play well as a team. https://instagram.com/p/BNSaqCXgECf/ What were some of the unexpected challenges you’ve encountered along the way? And perhaps any happy surprises? Kelly: Rules and regulations are rampant with mobile bartending, especially from a mobile rig like our camper bar. You have to do your own research into these issues first and be able to speak knowledgeably to the folks you encounter in their offices, because they don’t necessarily know how to categorize or regulate you. As far as happy surprises: the response from the people has been incredible validating. People want more than a soda and spirit drink at their big events, they love our “garden to glass” cocktails and they love our delivery. My new catch phrase is “special days deserve special drinks,” and it’s working. Plus, when our camper bar pulls up people just start smiling. They know happy hour just arrived. It makes every event worth every hour of preparation. Esposito: When we started the business it was really hard to work with hotels and full service banquet centers because they did not want to allow outside vendors into their space. But over the past seven years, craft cocktails went from “what is that?” to “Why does your venue not have the ability to make us a signature cocktail.” It has been an incredible shift to see huge corporate players like Hilton and Hyatt Hotel chains allowing outside mixologists to come into their space to elevate the event experience. I never thought I would see that happen! Any advice for a working bartender who is contemplating a similar move into the catering/events field? Kelly: Do a lot of soul searching about why you want to do it, and do your research first. It isn’t easy moving from employee to self employed and it requires a huge mind shift. Events-only work also means working seasonally on weekends, so your schedule and family life should accommodate that. If you know you’ve got the chutzpah and want to make the move, figure out the type of bar business you want to offer, really study whether the demand is out there, and work backwards from the salary you need to make when you start to determine your pricing. Too many new entrepreneurs start at what they think they can charge, and then they can’t actually make any money. Budgeting is not the most glamorous part of business ownership but it beats early burn out . And really listen to the market, your customers: we all want to make the best and most exciting drink we can, and our clients want something special too, but they might not want to drink Fernet all night long at an event. Finally: measure your pours. Clients at a bar may order just one drink from you and then move on to another bar, but at an event it’s just you, so they expect the same drink on every trip to the bar. Esposito: Event beverage catering can be a lot of fun and very lucrative but keep in mind that it is a serious business and that it is important to limit risk involved with responsible mobile alcohol service. For traditional bars you typically only have to get licensed once and you’re done but for mobile catering service each county and state has different rules that you need to understand. You should expect that you will be dealing with a lot of permitting questions. It is a great idea to talk with a qualified liquor license consultant and a good insurance broker in your State to freshen up on what services you can and cannot provide before you embark on the journey and don’t be afraid to ask questions of event planners to make sure they have secured the proper event permits and government sign-offs before you provide any service. https://instagram.com/p/BKWMitwj755/?taken-by=happycampercocktails Anything else to add? Esposito: Don’t be afraid to be creative and document your creativity. Event planners are always looking for you to propose ideas to make their events unforgettable but remember that you should always think hard about the demographic you are serving. One of the unique differences between a standard bar and event beverage catering is that in the standard bar scenario, the people in the bar share a lot of affinities. But with events, it’s a totally different ballgame: the audience demographic factor is much more mercurial and guests of different generations don’t have the same kinds of tastes. Sometimes drinks with mescal and bitters might be the exact right choice for the crowd and other times it’s all about vodka and vermouth. Before creating the cocktails you want to create, you have to do your homework and ask the right questions about the crowd and listen to what they want and then employ your skill as a mixologist to create something delicious. Kelly: All of it will be harder than you think, but it will feel pretty damn good once you do it. https://instagram.com/p/BS7Mi9bFn4w/?taken-by=snakeoilcocktail Recent Posts Tales Of The Cocktail® Announces Date and Theme, Seminar, and Scholarship Details for 2026 Conference The New Orleans Spirits Competition 2025 “Spirits of the Year” Winners Announced at Tales of the Cocktail Tales Of The Cocktail Foundation Announces 2025 Spirited Awards® Winners Watch Live: Tales of the Cocktail 19th Annual Spirited Awards® ShakeStir’s Cocktail Courier and Tales of the Cocktail Foundation Announce Strategic Partnership to Celebrate the Art of Cocktails Archives Archives Select Month September 2025 July 2025 June 2025 May 2025 April 2025 March 2025 February 2025 January 2025 December 2024 November 2024 September 2024 August 2024 July 2024 June 2024 May 2024 April 2024 March 2024 February 2024 January 2024 December 2023 November 2023 October 2023 September 2023 August 2023 July 2023 June 2023 May 2023 April 2023 March 2023 February 2023 January 2023 November 2022 October 2022 September 2022 August 2022 July 2022 June 2022 May 2022 April 2022 March 2022 February 2022 January 2022 September 2021 August 2021 July 2021 June 2021 May 2021 April 2021 March 2021 February 2021 December 2020 September 2020 August 2020 May 2020 April 2020 March 2020 February 2020 January 2020 October 2019 September 2019 July 2019 June 2019 May 2019 April 2019 March 2019 February 2019 January 2019 November 2018 October 2018 September 2018 August 2018 July 2018 June 2018 May 2018 April 2018 March 2018 February 2018 January 2018 December 2017 November 2017 October 2017 September 2017 August 2017 July 2017 June 2017 May 2017 April 2017 March 2017 February 2017 January 2017 December 2016 November 2016 October 2016 September 2016 August 2016 July 2016 June 2016 May 2016 April 2016 March 2016 February 2016 January 2016 December 2015 November 2015 October 2015 September 2015 August 2015 July 2015 June 2015 February 2015 Related Posts Celebrating Asian & Pacific American Heritage Month: Unapologetically Normal Tales of the Cocktail Foundation and Bombay Sapphire Announce the 2024 Most Imaginative Bartender, Elise Hanson Tales of the Cocktail Foundation and Bombay Sapphire Announce the 2024 Most Imaginative Bartender, Elise Hanson Subscribe to Our E-Newsletter Stay up-to-date with everything the Tales of the Cocktail Foundation does year-round. Name (Required) First Last Email (Required) Agree to Privacy Policy (Required) I have read and agree to the Privacy Policy By clicking submit below, you consent to allow TOTCF to store and process the personal information submitted above to provide you the content requested. By subscribing to this list, you certify that you are of legal age to consume alcohol as defined by the laws in your country of residence. Email This field is for validation purposes and should be left unchanged. Δ Our Mission Contact Us Blog Privacy Policy Code of Conduct Tales of the Cocktail® Spirited Awards® Cocktail Apprentice Program® Contact Us info@talesofthecocktail.org facebook-square Link to Facebook instagram-square Link to Instagram twitter-square Link to Twitter Copyright © 2025 Tales of the Cocktail Foundation. Manage Cookie Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent To search this site, enter a search term Tales of the Cocktail Foundation Tales of the Cocktail Foundation platform seeks to act as a catalyst to Educate, Advance, and Support the global drinks industry and communities we touch. About Our Mission Board of Directors Team Committees Tales of the Cocktail Foundation Code of Conduct 2023 Annual Report Tales of the Cocktail® Spirited Awards® Spirited Awards® Directory Spirited Awards® Archive Tales Catalyst Tales of the Cocktail TOTC Merch powered by Mover & Shaker Initiatives Cocktail Courier Beyond the Bar® Cocktail Apprentice Program® Philanthropy & Development Scholarship Program Grant Recipients Policy Initiative Virtual Cocktail Tour Past Initiatives Singapore x Tales Tales on Tour Contact Contact Us Privacy Policy Work with Tales Get Involved Partnerships Seminar Proposals TOTC Scholarship Stories Recent Behind the Bar Culture Destinations History Industry News In-Depth People Products Recipes Techniques Tours Wellness"
    },
    {
      "url": "https://www.cateredcreationsinc.com/contact-us/",
      "text": "Contact Catered Creations | Grand Rapids Catering Services top Effortless Events Start Here - (616) 361-6165 About Weddings Corporate Events Corporate Catering Corporate Drop-Off Social Events Social Event Catering Services Get Started Graduation Catering Holiday Catering Birthday Party Catering Picnics Funerals & Celebration of Life Bridal & Baby Shower Catering Family Reunion Catering Resources Venues Vendors All Menus All Menus Contact Us Get in touch! We canât wait to start a conversation. (616) 361-6165 orders@cateredcreationsinc.com Address: 1724 Coit Ave NE. Grand Rapids, MI 49505 Office Hours: Monday - Friday:Â 9am - 5pm Saturday & Sunday:Â Closed First Name Last Name Email Address Phone Number What type of Event are you having? Choose an option Wedding Corporate Event Picnic Social Event Date of Event What time is the event being held? Please confirm your event's day of the week Choose an option Monday Tuesday Wednesday Thursday Friday Saturday Sunday Venue where event will be held Would you like to start planning your event now? Yes (It's faster!) No thanks, maybe later Are you interested in bar services? Yes No How Many guests (estimate) will be at your Event? Message Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. About Our Company All Menus Weddings Get Started Corporate Corporate Catering Corporate Drop-Offs Social Events Graduation Picnics Holiday Funerals Birthday Reunion Bridal &Â Baby Shower Grand Rapids Catering 1724 Coit Ave NE, Grand Rapids, MI 49505 @ Catered Creations Inc. 2025 All Rights Reserved. | Website Built by Austin at Launch Kit"
    },
    {
      "url": "https://catered-cocktails.com/faq/",
      "text": "FAQ | Catered Cocktails Top Facebook Instagram Pinterest Catered Cocktails bar services Book Now Services Gallery About Us FAQ Contact Blog About Frequently Asked Questions How much does it cost? Collapse We tailor each of our quotes to your particular needs so you get everything you want and don’t pay for anything you don’t need.  There are several variables that go into the pricing.  To be able to create a quote for you we need to know details.  Some of the details needed are; event location, date, start and end time, number of guests, and what you’d like to serve from the bar.  Click here to fill out the questionnaire to get a tailored quote started for you! Can I have a cash bar? Expand In the state of Florida no mobile bartending company can legally take cash for drinks at the bar. Contact us for more information Are you insured? Expand Yes, we have general and liquor liability insurance and are able to provide a Certificate of Insurance to your venue Who provides the beer, wine, or liquor? Expand The client always pays for beer, wine and liquor.  You can either shop it yourself at the location of your choice (we’ll provide you with a shopping guideline), OR we can do an alcohol consultation, order and have delivered to your venue when you work with us and our partnered vendor Can we have shots? Expand For liquor liability reasons, we cannot serve shots. Will you card my guests? Expand We are responsible vendors and follow all rules and regulations regarding the serving of alcohol. We will not serve guests under 21 and do require ID from anyone that looks under 30. What is your payment policy? Expand We require a 50% non-refundable deposit to secure your date.  Balance is due 10 days prior to event. How far will you travel? Expand We love an adventure!  If we can make it happen for you, we will. CONTACT US cateredcocktails@comcast.net 904.246.4410 Office 904.502.0562 Cell LET’S GET SOCIAL Facebook Instagram Pinterest FOLLOW US ON INSTAGRAM @CATEREDCOCKTAILSJAX Copyright © 2025 · Catered Cocktails · Designed by Fancy Girl Designs · Strategy by Ginny Krauss"
    },
    {
      "url": "https://www.cocktailscatering.com",
      "text": "Event Catering | Cocktails Catering | Florida top of page 9640 Boggy Creek Rd. Suite #5 Orlando, FL 32824 COCKTAILS CATERING Home Weddings & Social Corporate & B2B Services Quick Orders Venues Contact Us More... Use tab to navigate through the menu items. LIFE HAPPENS AROUND GOOD FOOD COCKTAILS CATERING EVENT RENTALS, BEVERAGES, & STAFFING Your One Stop Shop For Your Event Needs. Not only do we offer the best cuisine in Orlando, FL, we also offer many other services for your stunning event. Our design team can help plan the creative details of your party, including buffet styling, tablescape designs, and much more. Best of Orlando Event Caterer As a full service catering company, Cocktails Catering provides everything from sensational cuisine and entertainment to seamless planning and design for events of any size. Primarily serving Orlando, Daytona, Tampa, and Central Florida areas. Learn More Here > Read More Here > PARTY PLATTERS & BOXED LUNCHES View Our Menu \"WOW! is all that sums this up. We dealt with Alycia...and words cannot express how grateful we are to have met her and have her guidance, expertise and professionalism! The food at our wedding was DELICIOUS!! (currently drooling)! Thank you soo much for all the amazing food, great staff and quality service!\" - Tati & Jeannette LOCATION & HOURS 9640 Boggy Creek Rd. Suite 5 Orlando, FL 32824 (407) 446-2878 Monday - Saturday 9am - 6pm Info@CocktailsCatering.com CAREERS | PREFERRED VENDORS bottom of page"
    }
  ]
}