{
  "fuentes": [
    {
      "url": "https://www.mycedarbrae.ca/home/board-and-staff/",
      "email": "info@mycedarbrae.ca"
    },
    {
      "url": "https://cedarlakeswoodsandgarden.com/upcoming",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://cedarlakeswoodsandgarden.com/upcoming",
      "email": "info@indiantypefoundry.com"
    },
    {
      "url": "https://cedarandoak.com/contact-us",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://cedarandoak.com/contact-us",
      "email": "info@cedarandoak.com"
    },
    {
      "url": "https://cedarbliss.ca/contact-us/",
      "email": "info@cedarbliss.ca"
    },
    {
      "url": "https://cedarlakeswoodsandgarden.com/history",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://cedarlakeswoodsandgarden.com/history",
      "email": "info@indiantypefoundry.com"
    },
    {
      "url": "https://cedarlakeswoodsandgarden.com/vendor-information",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://cedarlakeswoodsandgarden.com/vendor-information",
      "email": "info@indiantypefoundry.com"
    },
    {
      "url": "https://cedarlakeswoodsandgarden.com/visitor-information",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://cedarlakeswoodsandgarden.com/visitor-information",
      "email": "info@indiantypefoundry.com"
    },
    {
      "url": "https://cedarlakeswoodsandgarden.com/group-visit-reservation",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://cedarlakeswoodsandgarden.com/group-visit-reservation",
      "email": "info@indiantypefoundry.com"
    },
    {
      "url": "https://www.homesteadtinyresorts.com/post/cedar-lake-woods-and-gardens-in-williston-florida",
      "email": "cyndi@homesteadtinyenterprises.com"
    },
    {
      "url": "https://www.homesteadtinyresorts.com/post/cedar-lake-woods-and-gardens-in-williston-florida",
      "email": "sunny@homesteadtinyenterprises.com"
    },
    {
      "url": "https://cedarlakeswoodsandgarden.com/contact-us",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://cedarlakeswoodsandgarden.com/contact-us",
      "email": "info@indiantypefoundry.com"
    },
    {
      "url": "https://cedarlakeswoodsandgarden.com/sponsor",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://cedarlakeswoodsandgarden.com/sponsor",
      "email": "info@indiantypefoundry.com"
    },
    {
      "url": "https://cedarlakescasino.com/contact-us/",
      "email": "info@cedarlakescasino.com"
    },
    {
      "url": "https://cedarlakeswoodsandgarden.com/garden-map",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://cedarlakeswoodsandgarden.com/garden-map",
      "email": "info@indiantypefoundry.com"
    },
    {
      "url": "https://cedarlakeswoodsandgarden.com/",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://cedarlakeswoodsandgarden.com/",
      "email": "info@indiantypefoundry.com"
    }
  ],
  "mails": [
    "cyndi@homesteadtinyenterprises.com",
    "filler@godaddy.com",
    "info@cedarandoak.com",
    "info@cedarbliss.ca",
    "info@cedarlakescasino.com",
    "info@indiantypefoundry.com",
    "info@mycedarbrae.ca",
    "sunny@homesteadtinyenterprises.com"
  ],
  "nombre_sitio": "cedarlakeswoodsandgarden.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.mycedarbrae.ca/home/board-and-staff/",
      "text": "Board and Staff - My Cedarbrae Board and Staff Memberships Community Garden Programs Pickleball 2025 Special Events Rental Spaces Birthday Party Packages Contact Us Select Page The Cedarbrae Community League Association Board of Directors The Cedarbrae Community League Association is led by a volunteer Board of Directors nominated by the members of our community association. It is through the countless volunteer hours donated by the CCLA Board of Directors and the many volunteers of the Cedarbrae Community League Association that we can bring a vibrant and viable community centre that provides recreational, social & educational opportunities for the residents of Cedarbrae and by extension, the citizens of Calgary. All current Cedarbrae Community League Association members are welcome to attend as observers. If you are interested in attending a board meeting as an observer please purchase a membership ahead of time and contact the centre for meeting time/location. Please note, when attending all Board Meetings: Be an active listener, Be respectful (even if you disagree with any viewpoints or ideas), and of course, BE KIND! The Board of Directors meet at the Cedarbrae Community Centre on the second Tuesday of every month, with exceptions of July and August at 6:30pm. Tuesday March 11, 2025  |  Tuesday April 8, 2025 Tuesday May 13, 2025  |  Tuesday June 10, 2025 Tuesday September 16, 2025 Current Board of Directors President John Seagrave Vice-President Anna Aubrecht Secretary Belinda Halischuk Treasurer Darrell Ogden Member at Large Cathy Roczkowsky Member at Large Frank Forte Member at Large Cathy Heys Member at Large Joyce Wright Do you have a question for the Board of Directors? Please submit your questions by following the link below! Submit your question here! Our Government Partners Office of the Councillours Coming Soon – Ward 11 City of Calgary Neighbourhood Partner Jenna Findlander MLA for Calgary-Glenmore Nagwan Al-Guneid New Democratic The Cedarbrae Community Centre Team Paige Scalet Office Administrator Ethan Minde Recreation Assistant Land Acknowledgment In the spirit of reconciliation, we acknowledge that we live, work and play on the traditional territories of the Blackfoot Confederacy (Siksika, Kainai, Piikani), the Tsuut’ina, the Îyâxe Nakoda Nations, the Métis Nation (Region 3), and all people who make their homes in the Treaty 7 region of Southern Alberta. Contact Us Email: info@mycedarbrae.ca Phone: 403-251-2101 Our Address 11024 Oakfield Drive SW Calgary, Alberta, T2W 5G6 1-403-251-2101 Office Hours Monday to Friday: 10AM to 3PM Saturday and Sunday: Closed"
    },
    {
      "url": "https://cedarlakeswoodsandgarden.com/upcoming",
      "text": "Upcoming 4990 NE 180th Ave, Williston, FL 32696 (352) 529-0055 (352) 529-0055 Home PLAN YOUR VISIT Visitor Information Rules and Policies Garden Map Scavenger Hunt Nearby Attractions Group Visit Reservation Membership ABOUT US History Mission Statement Gallery Blog EVENTS Upcoming Vendor Information CONSERVATION EDUCATION Insights Raise The Roof Campaign Flora and Fauna Citizen Science Health Benefits of Nature DONATE MORE CONTACT US VOLUNTEER RENTALS SPONSOR Merchandise More Home PLAN YOUR VISIT Visitor Information Rules and Policies Garden Map Scavenger Hunt Nearby Attractions Group Visit Reservation Membership ABOUT US History Mission Statement Gallery Blog EVENTS Upcoming Vendor Information CONSERVATION EDUCATION Insights Raise The Roof Campaign Flora and Fauna Citizen Science Health Benefits of Nature DONATE MORE CONTACT US VOLUNTEER RENTALS SPONSOR Merchandise Sign In My Account Signed in as: filler@godaddy.com My Account Sign out Signed in as: filler@godaddy.com Home PLAN YOUR VISIT Visitor Information Rules and Policies Garden Map Scavenger Hunt Nearby Attractions Group Visit Reservation Membership ABOUT US History Mission Statement Gallery Blog EVENTS Upcoming Vendor Information CONSERVATION EDUCATION Insights Raise The Roof Campaign Flora and Fauna Citizen Science Health Benefits of Nature DONATE MORE CONTACT US VOLUNTEER RENTALS SPONSOR Merchandise Account My Account Sign out Sign In My Account only service animals PERMITTED. no pets allowed during special events. only service animals PERMITTED. no pets allowed during special events. only service animals PERMITTED. no pets allowed during special events. only service animals PERMITTED. no pets allowed during special events. only service animals PERMITTED. no pets allowed during special events. only service animals PERMITTED. no pets allowed during special events. Events & Festivals 2025 RSVP Calendar 10/11/2025 FALL FESTIVAL 2025 9:30AM - 5:00 pm Cedar Lakes Woods & Gardens Event Details 10/11/2025 FALL FESTIVAL 2025 Enjoy live music  , explore a curated vendor market, and savor delicious offerings from local food trucks. Immerse yourself by walking aroun... Event Details 9:30AM - 5:00 pm Cedar Lakes Woods & Gardens Saturday 12/ 13/25  Sunday 12/14/25 Thursday 12/18/25 Saturday 12/20/25 SUNDAY 12/21/25 Monday 12/22/25 Tuesday 12/23/25 christmas in the quarry 5:30PM - 8:00pm Cedar Lakes Woods & Gardens Event Details Saturday 12/ 13/25  Sunday 12/14/25 Thursday 12/18/25 Saturday 12/20/25 SUNDAY 12/21/25 Monday 12/22/25 Tuesday 12/23/25 christmas in the quarry Christmas in Quarry returns at Cedar Lakes Woods & Gardens! Explore our gardens in our magical winter wonderland. Don't miss out ! Additiona... Event Details 5:30PM - 8:00pm Cedar Lakes Woods & Gardens Copyright © 2024 Cedar Lakes Woods and Gardens - All Rights Reserved. Powered by"
    },
    {
      "url": "https://cedarandoak.com/contact-us",
      "text": "Contact Information - Cedar & Oak Cedar & Oak Cedar & Oak Cedar & Oak Cedar & Oak Cedar & Oak Cedar & Oak Cedar & Oak Cedar & Oak Home Products Products Living & Bedroom Home Office Storage & Entryway Rustic Finish Contact Us More Home Products Products Living & Bedroom Home Office Storage & Entryway Rustic Finish Contact Us Sign In Create Account Orders My Account Signed in as: filler@godaddy.com Orders My Account Sign out Signed in as: filler@godaddy.com Home Products Products Living & Bedroom Home Office Storage & Entryway Rustic Finish Contact Us Account Orders My Account Sign out Sign In Orders My Account Contact Us for Further Questions & Information Drop Us a Line! Name* Email* Phone Number* Subject Send This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Cedar & Oak 22 Jericho Road, Berlin, New Hampshire 03570, United States Phone: +1(603) 264-0355 Email Us: info@cedarandoak.com Business Hours I'm Open 24/7 Get directions Copyright © 2022, Cedar & Oak. All Rights Reserved. Terms of Service Powered by GoDaddy This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://cedarbliss.ca/contact-us/",
      "text": "Contact Us | Cedar Bliss Event Venue in Lanark Highlands Skip to Content Home Tour The Cedar Grove The Buildings The Barn The Gardens Split Rail Fences The Forest The Meadow Contact Us Member Directory Cedar Bliss Cedar Bliss in Lanark Highlands Cedar Bliss Cedar Bliss in Lanark Highlands Looking for Something? Search anything and hit enter. Home Tour The Cedar Grove The Buildings The Barn The Gardens Split Rail Fences The Forest The Meadow Contact Us Member Directory Home <span class=\"hpt_headertitle\">Contact Us</span> Contact Us You can also reach us by using the form below. Your Name (required) Your Email (required) Subject Your Message Photo Credits: Alix Heise, Connor Heise, Irene Hofmann, Doug Batten. Get in touch with us now to book your event or tour Cedar Bliss evolves with the seasons and is equally beautiful throughout the year. Tim and Cathy welcome you to their property and will help you plan the perfect event. Whether you are celebrating a Wedding, Birthday, Anniversary, Family Reunion or just want to get family or friends together to enjoy a great day – Cedar Bliss is a great gathering place. Give us a call at 613-259-5074 or email us at info@cedarbliss.ca We would love to meet you and make your event one to remember. © Copyright 2025 Cedar Bliss . All Rights Reserved. iM Inc. | Developed By iMedia Northside Inc . Powered by WordPress . Looking for Something? Search anything and hit enter. We use cookies on our website to give you the most relevant experience by remembering your preferences and repeat visits. By clicking “Accept All”, you consent to the use of ALL the cookies. However, you may visit \"Cookie Settings\" to provide a controlled consent. Cookie Settings Accept All Manage consent Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website, anonymously. Cookie Duration Description cookielawinfo-checkbox-analytics 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\". cookielawinfo-checkbox-functional 11 months The cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Functional\". cookielawinfo-checkbox-necessary 11 months This cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\". cookielawinfo-checkbox-others 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other. cookielawinfo-checkbox-performance 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Performance\". viewed_cookie_policy 11 months The cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Functional Functional Functional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features. Performance Performance Performance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. Advertisement Advertisement Advertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads. Others Others Other uncategorized cookies are those that are being analyzed and have not been classified into a category as yet. SAVE & ACCEPT"
    },
    {
      "url": "https://cedarlakeswoodsandgarden.com/history",
      "text": "History 4990 NE 180th Ave, Williston, FL 32696 (352) 529-0055 (352) 529-0055 Home PLAN YOUR VISIT Visitor Information Rules and Policies Garden Map Scavenger Hunt Nearby Attractions Group Visit Reservation Membership ABOUT US History Mission Statement Gallery Blog EVENTS Upcoming Vendor Information CONSERVATION EDUCATION Insights Raise The Roof Campaign Flora and Fauna Citizen Science Health Benefits of Nature DONATE MORE CONTACT US VOLUNTEER RENTALS SPONSOR Merchandise More Home PLAN YOUR VISIT Visitor Information Rules and Policies Garden Map Scavenger Hunt Nearby Attractions Group Visit Reservation Membership ABOUT US History Mission Statement Gallery Blog EVENTS Upcoming Vendor Information CONSERVATION EDUCATION Insights Raise The Roof Campaign Flora and Fauna Citizen Science Health Benefits of Nature DONATE MORE CONTACT US VOLUNTEER RENTALS SPONSOR Merchandise Sign In My Account Signed in as: filler@godaddy.com My Account Sign out Signed in as: filler@godaddy.com Home PLAN YOUR VISIT Visitor Information Rules and Policies Garden Map Scavenger Hunt Nearby Attractions Group Visit Reservation Membership ABOUT US History Mission Statement Gallery Blog EVENTS Upcoming Vendor Information CONSERVATION EDUCATION Insights Raise The Roof Campaign Flora and Fauna Citizen Science Health Benefits of Nature DONATE MORE CONTACT US VOLUNTEER RENTALS SPONSOR Merchandise Account My Account Sign out Sign In My Account HISTORY AND GROWTH It started as a 110-year-old abandoned limestone quarry.. ..and after 32 years of hard work and growth.. ...it's become a beautiful botanical garden that everyone can enjoy! From 1991 to... NOW Cedar Lakes Woods & Gardens was founded by Dr. Raymond Webber and opened for public enjoyment in January of 2014. The creation of the gardens began over 32 years ago when Ray discovered the 100+ year old retired lime rock quarry in 1991. (Over one hundred years ago, miners were harvesting lime rock from the property to create the foundation of Highway 27). In 1991, Ray found that the property had been abandoned long ago, and it was a polluted swamp. He purchased the property for his own private use, initially intending to use the quarry as a giant fishing pond. He dug out what was left behind, including old mining remnants, and began to transform the old swampy quarry. Rock by rock, each rolled in by wheelbarrows and strategically placed by human hands, the walkways and walls of the gardens were created. With a small team of workers, he created different islands throughout the quarry, concrete walkways, separate pools, waterfalls, pavilions, gazebos, and bridges made of Brazilian walnut. With the structures now intact, Ray assumed gardening as his hobby to add greenery to his creation. He discovered that he was just as enthusiastic for gardening as he was for fishing, and now Ray is responsible for one of the most unique botanical creations you will ever see. In 2014, Ray created the 501(c)(3) non-profit Cedar Lakes Woods and Gardens, Inc. He donated the entire 20-acre botanical garden to the non-profit and opened it to the public. He then donated the entire 64-acre surrounding woodlands to Conservation Florida in order to keep them protected in the future. While the property has strayed far from its original purpose, Ray is so happy to see the property growing and being enjoyed by so many people. The quarry walls are lined with concrete and rock planters, filled with hundreds of species of plants and flowers. The surrounding trees and the topography of the quarry allow temperate and semitropical plants to flourish year-round. Birds of prey, owls, doves, numerous songbirds, butterflies, turtles, frogs, and other wildlife may be encountered along the trail. Cedar Lakes Woods & Gardens is also home to domesticated animal friends including many cats, two swans named Guenevere and Olivia, several ducks, pheasants, a goose, a squirrel named Delilah, a rose-breasted cockatoo named Rosie, numerous Koi fish, and a 100-pound blue catfish named Big Ben. There are many benches and picnic tables throughout the trails to allow visitors to sit and enjoy the spectacular views. We also suggest bringing a picnic lunch to snack on while enjoying these views.  Today, thanks to the help of staff members and Ray's dedication to his artistic dream, the garden continues to grow with the addition of new garden displays, scenic features, and expansion of education programs. You may also wander through our surrounding woods and enjoy the Oaks, Cedars, Pines, Pecans, Hickories, and Dogwoods in an adjacent 64-acre nature conservation easement maintained by \"Conservation Florida.\" Ray Webber onlooking one of the old quarries on the property Dr. Raymond T. Webber was born in 1942 and served in the Army for eight years before being called up for Operation Desert Shield and Desert Storm in 1990 and 1991 while in the reserves. He earned his M.S. degree alongside his Endodontic certification in 1974 and practiced until his retirement in 2014. From 1977 to 1982, he taught at the University of Florida and contributed to dental textbooks. He also spent 14 years lecturing nationally and internationally. In his free time, he enjoys traveling, fishing, and, of course, gardening. Copyright © 2024 Cedar Lakes Woods and Gardens - All Rights Reserved. Powered by"
    },
    {
      "url": "https://cedarlakeswoodsandgarden.com/vendor-information",
      "text": "Vendor Information 4990 NE 180th Ave, Williston, FL 32696 (352) 529-0055 (352) 529-0055 Home PLAN YOUR VISIT Visitor Information Rules and Policies Garden Map Scavenger Hunt Nearby Attractions Group Visit Reservation Membership ABOUT US History Mission Statement Gallery Blog EVENTS Upcoming Vendor Information CONSERVATION EDUCATION Insights Raise The Roof Campaign Flora and Fauna Citizen Science Health Benefits of Nature DONATE MORE CONTACT US VOLUNTEER RENTALS SPONSOR Merchandise More Home PLAN YOUR VISIT Visitor Information Rules and Policies Garden Map Scavenger Hunt Nearby Attractions Group Visit Reservation Membership ABOUT US History Mission Statement Gallery Blog EVENTS Upcoming Vendor Information CONSERVATION EDUCATION Insights Raise The Roof Campaign Flora and Fauna Citizen Science Health Benefits of Nature DONATE MORE CONTACT US VOLUNTEER RENTALS SPONSOR Merchandise Sign In My Account Signed in as: filler@godaddy.com My Account Sign out Signed in as: filler@godaddy.com Home PLAN YOUR VISIT Visitor Information Rules and Policies Garden Map Scavenger Hunt Nearby Attractions Group Visit Reservation Membership ABOUT US History Mission Statement Gallery Blog EVENTS Upcoming Vendor Information CONSERVATION EDUCATION Insights Raise The Roof Campaign Flora and Fauna Citizen Science Health Benefits of Nature DONATE MORE CONTACT US VOLUNTEER RENTALS SPONSOR Merchandise Account My Account Sign out Sign In My Account Vendor Information Interested in vending other events and festivals? Submit your information below and we'll add you to our Vendor Contact List for future opportunities! interested Food Vendors Click Here TO SUBMIT YOUR INFORMATION interested Arts & CRAFTS VENDORS CLICK HERE TO SUBMIT YOUR INFORMATION Interested Plant Vendors Click here to submit your information Copyright © 2024 Cedar Lakes Woods and Gardens - All Rights Reserved. Powered by"
    },
    {
      "url": "https://cedarlakeswoodsandgarden.com/visitor-information",
      "text": "Visitor Information 4990 NE 180th Ave, Williston, FL 32696 (352) 529-0055 (352) 529-0055 Home PLAN YOUR VISIT Visitor Information Rules and Policies Garden Map Scavenger Hunt Nearby Attractions Group Visit Reservation Membership ABOUT US History Mission Statement Gallery Blog EVENTS Upcoming Vendor Information CONSERVATION EDUCATION Insights Raise The Roof Campaign Flora and Fauna Citizen Science Health Benefits of Nature DONATE MORE CONTACT US VOLUNTEER RENTALS SPONSOR Merchandise More Home PLAN YOUR VISIT Visitor Information Rules and Policies Garden Map Scavenger Hunt Nearby Attractions Group Visit Reservation Membership ABOUT US History Mission Statement Gallery Blog EVENTS Upcoming Vendor Information CONSERVATION EDUCATION Insights Raise The Roof Campaign Flora and Fauna Citizen Science Health Benefits of Nature DONATE MORE CONTACT US VOLUNTEER RENTALS SPONSOR Merchandise Sign In My Account Signed in as: filler@godaddy.com My Account Sign out Signed in as: filler@godaddy.com Home PLAN YOUR VISIT Visitor Information Rules and Policies Garden Map Scavenger Hunt Nearby Attractions Group Visit Reservation Membership ABOUT US History Mission Statement Gallery Blog EVENTS Upcoming Vendor Information CONSERVATION EDUCATION Insights Raise The Roof Campaign Flora and Fauna Citizen Science Health Benefits of Nature DONATE MORE CONTACT US VOLUNTEER RENTALS SPONSOR Merchandise Account My Account Sign out Sign In My Account visitor information DAILY ADMISSION FEES Adults (Ages 13+): $12.00 + TAX Children (Ages 6 - 13): $7.00 + TAX Children 5 and Under: Free Military (with ID): $6.00 + TAX Members: Free We are CLOSED Christmas Day *All prices are subject to 7% sales tax. Planning a group visit of more than 12 people to Cedar Lakes Woods & Gardens? Click here for more information. Hours of operation during special events differ from hours listed above (please see events). We do NOT offer senior citizen discounts. Admission prices vary for days with special events (please see events). Consider applying the price of your admission towards an annual membership to Cedar Lakes Woods and Gardens on the day of your visit. Simply ask someone at admissions to convert today's admission to an annual membership. Only valid on the same day and in-person. Cedar Lakes Woods and Gardens DOES NOT permit walk-ins for special occasions, including but not limited to elopements, wedding ceremonies, small gatherings, etc. All such occasions are required to book a rental reservation with the Garden’s Rental Coordinator. See Rental information under our More tab. VISITOR INFORMATION Admission includes a brief overview of the garden map and a self-guided tour through 20 acres of botanical creations , featuring a diverse collection of flora that changes with the seasons. Not everything blooms at once , making each visit a unique experience as the gardens evolve throughout the year. Trails are well-marked and numbered, taking approximately 90 minutes to complete, with benches and rest areas along the way. Explore the Gardens from 9:30 AM to our 5:00 PM closing time. Last admission into the gardens is 4:45 PM. We recommend bringing a bottle of water for your visit, light snacks and beverages are available for purchase at the Welcome Center. For the safety of all our guests, staff, and wildlife: Picking or clipping plants or flowers is strictly prohibited. Climbing trees, rocks, or ledges is not allowed. Guests are requested to dispose of their trash responsibly. Swimming is not allowed in any of the quarries on the property Alcohol is not permitted on the premises. Glass items are prohibited. Fishing poles/gear are not allowed Touching or feeding the cats/wildlife on the property is prohibited Thank you for your understanding and cooperation as you enjoy the beauty of Cedar Lakes Woods and Gardens. ACCESSIBILITY Please be aware that our gardens are not handicap accessible. The garden layout is integrated into a lime rock quarry, and to access the lower levels, there is a steep ramp. However, for those exploring the upper trail, we have created wonderful overlooks. It's important to note that the trail isn't perfectly level throughout; there are changes in elevation and rocky, bumpy sections. To provide accessibility to the overlook trail circling the quarry rim, we've installed ramps. From this vantage point, you can enjoy stunning views of the lakes and gardens below. Keep in mind that the overlook trail does have a few small inclines and occasional rugged surfaces. Accessibility depends on the design and size of the wheels on one's mobility scooter or wheelchair. Many guests have successfully navigated the upper trail with different models. While we allow visitors to explore the lower level of the gardens, we want to emphasize that using the ramp with a wheelchair or similar mobile device requires strength and confidence. On a positive note, our restrooms are considered wheelchair accessible. They were constructed with wheelchairs and powerchairs in mind, providing a more comfortable experience for all visitors. Copyright © 2024 Cedar Lakes Woods and Gardens - All Rights Reserved. Powered by"
    },
    {
      "url": "https://cedarlakeswoodsandgarden.com/group-visit-reservation",
      "text": "Group Visit Reservation 4990 NE 180th Ave, Williston, FL 32696 (352) 529-0055 (352) 529-0055 Home PLAN YOUR VISIT Visitor Information Rules and Policies Garden Map Scavenger Hunt Nearby Attractions Group Visit Reservation Membership ABOUT US History Mission Statement Gallery Blog EVENTS Upcoming Vendor Information CONSERVATION EDUCATION Insights Raise The Roof Campaign Flora and Fauna Citizen Science Health Benefits of Nature DONATE MORE CONTACT US VOLUNTEER RENTALS SPONSOR Merchandise More Home PLAN YOUR VISIT Visitor Information Rules and Policies Garden Map Scavenger Hunt Nearby Attractions Group Visit Reservation Membership ABOUT US History Mission Statement Gallery Blog EVENTS Upcoming Vendor Information CONSERVATION EDUCATION Insights Raise The Roof Campaign Flora and Fauna Citizen Science Health Benefits of Nature DONATE MORE CONTACT US VOLUNTEER RENTALS SPONSOR Merchandise Sign In My Account Signed in as: filler@godaddy.com My Account Sign out Signed in as: filler@godaddy.com Home PLAN YOUR VISIT Visitor Information Rules and Policies Garden Map Scavenger Hunt Nearby Attractions Group Visit Reservation Membership ABOUT US History Mission Statement Gallery Blog EVENTS Upcoming Vendor Information CONSERVATION EDUCATION Insights Raise The Roof Campaign Flora and Fauna Citizen Science Health Benefits of Nature DONATE MORE CONTACT US VOLUNTEER RENTALS SPONSOR Merchandise Account My Account Sign out Sign In My Account Group Visit Reservation Planning a Large Group Visit to Cedar Lakes Woods & Gardens? For groups of more than 12 people , please complete the reservation form at the bottom of the page. All requests must be submitted at least 48 hours in advance . After your request is processed, you’ll receive an email confirmation with visit details. Important Policies for Large Group Visits : Group visits cannot be paid for in advance. Group rates are only available when payment for all members is consolidated into a single payment. Split payments do not qualify for group rates. Tax-exempt organizations must either email their tax-exempt form ahead of time or bring it on the day of the visit to qualify. The reservation form must be completed in advance to secure your group’s visit and group rate. Group Admission Rate : Groups of 12 to 25 people: $11 + tax per adult Groups of 26 or more people: $10 + tax per adult School/Field Trip Admission Rate : School Child: $5 + tax per child School Chaperone: $7 + tax per adult Please Note : All prices are subject to a 7% sales tax unless a tax-exempt form is submitted in advance or presented on-site. We look forward to providing your large group with a memorable experience at Cedar Lakes Woods & Gardens! GROUP RESERVATION FORM Copyright © 2024 Cedar Lakes Woods and Gardens - All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.homesteadtinyresorts.com/post/cedar-lake-woods-and-gardens-in-williston-florida",
      "text": "Cedar Lake Woods and Gardens in Williston, Florida top of page HOMESTEAD TINY RESORT Home Bookings More... Use tab to navigate through the menu items. Cedar Lake Woods and Gardens in Williston, Florida Homestead Tiny Resort Jun 3 2 min read Just a stone's throw from Williston Highlands, Florida, lies a true masterpiece of nature and human ingenuity: Cedar Lakes Woods and Gardens . This isn't just a garden; it's a breathtaking transformation of an old limestone quarry into a vibrant, diverse botanical paradise, complete with stunning waterfalls, tranquil koi ponds, and meandering walking paths. Every visit reveals something new, as the ever-evolving flora ensures a unique experience with each season. More than just a beautiful landscape, Cedar Lakes Woods and Gardens is deeply committed to environmental education and community engagement. They are actively involved in programs like the Florida Youth Conservation Centers Network (FYCCN), fostering a future rooted in conservation and youth empowerment. Keep an eye on their calendar for exciting educational workshops and lectures throughout the year, covering topics from local flora and fauna to citizen science initiatives. These programs offer fantastic opportunities to learn about Florida's unique ecosystems and how to protect them. But the gardens are also a hub for vibrant community events, often featuring fantastic live music ! Imagine strolling through picturesque pathways, surrounded by lush greenery, with the sounds of talented musicians filling the air. Cedar Lakes Woods and Gardens hosts a variety of engaging events that often include musical performances: Spring Festival: A highly anticipated annual event, typically held in early May, featuring an incredible array of rare and unique plants from over 90 vendors. You can browse handcrafted goods, savor delicious offerings from local food trucks, and enjoy live entertainment that sets a festive atmosphere. Fall Festival: Usually in October, this delightful event for all ages transforms the garden into a lively hub of activity. Expect a curated selection of artisans, more delicious food trucks, and a diverse range of live music performances , from folk and bluegrass to DJs, capturing the spirit of autumn. Reggae in the Gardens: This special event brings an unforgettable celebration of reggae music , culture, and community to the gardens. Held annually, often in April, it features live bands and DJs on multiple stages, creating non-stop reggae vibes from noon to late afternoon. It's a perfect blend of music, delicious food from on-site trucks, and the natural beauty of the gardens. \"Christmas in the Quarry\": As the holidays approach, the gardens transform into a dazzling winter wonderland. This magical event features beautifully illuminated gardens, festive lights, seasonal music filling the air, and often special performances to celebrate the season. Beyond these major festivals, the gardens frequently host other special events, including unique concert experiences like \"Harmony in the Gardens,\" which has featured renowned acoustic guitarists. Always check their official website for the most up-to-date schedule of upcoming events , education programs , and live music performances . Whether you're a nature enthusiast, a music lover, or looking for educational opportunities for the whole family, Cedar Lakes Woods and Gardens offers an enriching experience. It's a testament to vision and dedication, creating a truly unique and thriving destination in Williston, Florida . For for affordable places to stay in Williston, please contact out host at the Homestead Tiny Resort. We offer partnership discounts with Cedar Lakes Woods and Gardens. Contact us cyndi@homesteadtinyenterprises.com 102 NE 2nd Avenue, Williston FL 32696 (678) 530-7435 Discover Williston's Affordable Tiny Home AirBNB Homestead Tiny Home Resort Florida's Lifeline: The Unsung Heroes and a Touch of Home Retreat Why Our Hearts Belong to Cedar Key and the Nature Coast sunny@homesteadtinyenterprises.com 102 NE 2nd Avenue, Williston FL 32696 (678) 530-7435 Contact us Contact us cyndi@homesteadtinyenterprises.com 102 NE 2nd Avenue, Williston FL 32696 (678) 530-7435 Home Bookings bottom of page"
    },
    {
      "url": "https://cedarlakeswoodsandgarden.com/contact-us",
      "text": "CONTACT US 4990 NE 180th Ave, Williston, FL 32696 (352) 529-0055 (352) 529-0055 Home PLAN YOUR VISIT Visitor Information Rules and Policies Garden Map Scavenger Hunt Nearby Attractions Group Visit Reservation Membership ABOUT US History Mission Statement Gallery Blog EVENTS Upcoming Vendor Information CONSERVATION EDUCATION Insights Raise The Roof Campaign Flora and Fauna Citizen Science Health Benefits of Nature DONATE MORE CONTACT US VOLUNTEER RENTALS SPONSOR Merchandise More Home PLAN YOUR VISIT Visitor Information Rules and Policies Garden Map Scavenger Hunt Nearby Attractions Group Visit Reservation Membership ABOUT US History Mission Statement Gallery Blog EVENTS Upcoming Vendor Information CONSERVATION EDUCATION Insights Raise The Roof Campaign Flora and Fauna Citizen Science Health Benefits of Nature DONATE MORE CONTACT US VOLUNTEER RENTALS SPONSOR Merchandise Sign In My Account Signed in as: filler@godaddy.com My Account Sign out Signed in as: filler@godaddy.com Home PLAN YOUR VISIT Visitor Information Rules and Policies Garden Map Scavenger Hunt Nearby Attractions Group Visit Reservation Membership ABOUT US History Mission Statement Gallery Blog EVENTS Upcoming Vendor Information CONSERVATION EDUCATION Insights Raise The Roof Campaign Flora and Fauna Citizen Science Health Benefits of Nature DONATE MORE CONTACT US VOLUNTEER RENTALS SPONSOR Merchandise Account My Account Sign out Sign In My Account CONTACT US Lori Wallace Assistant Manager (352) 529-0055 cedarlakeswoodsgardens@gmail.com Jesse Chisholm Head Groundskeeper Contact Us Have a general question?? Name Email* Send This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Come see us and our beautiful gardens in person! We love our guests, so feel free to visit during business hours. We can't wait! Cedar Lakes Woods and Gardens 4990 NE 180th Ave, Williston, Florida 32696, United States (352) 529-0055 Hours Open today 09:30 am – 05:00 pm Get directions Subscribe to our mailing list Sign up to receive our monthly newsletter. Email Sign up Copyright © 2024 Cedar Lakes Woods and Gardens - All Rights Reserved. Powered by"
    },
    {
      "url": "https://cedarlakeswoodsandgarden.com/sponsor",
      "text": "SPONSOR 4990 NE 180th Ave, Williston, FL 32696 (352) 529-0055 (352) 529-0055 Home PLAN YOUR VISIT Visitor Information Rules and Policies Garden Map Scavenger Hunt Nearby Attractions Group Visit Reservation Membership ABOUT US History Mission Statement Gallery Blog EVENTS Upcoming Vendor Information CONSERVATION EDUCATION Insights Raise The Roof Campaign Flora and Fauna Citizen Science Health Benefits of Nature DONATE MORE CONTACT US VOLUNTEER RENTALS SPONSOR Merchandise More Home PLAN YOUR VISIT Visitor Information Rules and Policies Garden Map Scavenger Hunt Nearby Attractions Group Visit Reservation Membership ABOUT US History Mission Statement Gallery Blog EVENTS Upcoming Vendor Information CONSERVATION EDUCATION Insights Raise The Roof Campaign Flora and Fauna Citizen Science Health Benefits of Nature DONATE MORE CONTACT US VOLUNTEER RENTALS SPONSOR Merchandise Sign In My Account Signed in as: filler@godaddy.com My Account Sign out Signed in as: filler@godaddy.com Home PLAN YOUR VISIT Visitor Information Rules and Policies Garden Map Scavenger Hunt Nearby Attractions Group Visit Reservation Membership ABOUT US History Mission Statement Gallery Blog EVENTS Upcoming Vendor Information CONSERVATION EDUCATION Insights Raise The Roof Campaign Flora and Fauna Citizen Science Health Benefits of Nature DONATE MORE CONTACT US VOLUNTEER RENTALS SPONSOR Merchandise Account My Account Sign out Sign In My Account Sponsorship Sponsorship Opportunities As a 501(c)(3) non-profit botanical garden, the operations of Cedar Lakes Woods & Gardens are currently funded solely on donations, admission charges, and the financial contributions of the creator, Dr. Ray Webber. In order to expand, maintain what has already been created, develop education programs for children and adults, and generally improve as an organization, sponsorships and donations are necessary and deeply appreciated. We will be glad to demonstrate our sincere appreciation of your support by promoting your company at the gardens, as well as on our website. Thank you for your consideration. Cedar Lakes Woods & Gardens invites local businesses to support our events and connect with our vibrant community through our exclusive sponsorship opportunities. Showcase your brand to thousands of visitors while supporting one of Williston’s most treasured destinations. Package 1: Standard Sponsorship ($250) What You Get: Website Recognition: Your business will be featured on our website’s sponsor section for a full year, offering visibility to our 50,000 annual website viewers. Spring Festival saw record attendance in 2024 with 3,800 visitors over two days. Christmas In The Quarry saw record attendance in 2024 with over 7,000 visitors over seven different nights in December. Business Card/Rack Card Placement: Option to leave your business cards or rack cards at our admissions office, available to all guests visiting the gardens year-round. Package 2: Premium Sponsorship ($500) Includes Everything in the Standard Package , PLUS: Spring Festival Vendor Map Ad Space: A dedicated 3.5\" x 2 ad space on our Spring Festival Vendor Map, handed to every attendee at the gate. Why Sponsor Cedar Lakes Woods & Gardens? Unmatched Exposure: We have over 70,000 annual visitors offering high visibility for your business. Community Connection: Partner with a beloved local institution and demonstrate your support for the arts, environment, and community engagement. Cost-Effective Marketing: Reach a broad audience while supporting a non-profit organization. If interested in sponsorship opportunities, please contact Brenda Standridge or Rahel Faruque at cedarlakeswoodsgardens@gmail.com . THANK YOU TO OUR SPONSORS! SPARR 240 S Main St, Williston, FL 32696 (352) 528-6177 7 AM - 6 PM A/C PRINTING 115 NE 6th Blvd, Williston, FL 32696 (352) 528-0845 https://willistonprinter.com/ Copyright © 2024 Cedar Lakes Woods and Gardens - All Rights Reserved. Powered by"
    },
    {
      "url": "https://cedarlakescasino.com/contact-us/",
      "text": "Contact Us - Cedar Lakes Casino Skip to content Toggle Navigation CASINO GAMING RESPONSIBLE GAMBLING PROMOTIONS PLAYERS CLUB BENEFITS DINING & BAR PUB 33 THIRD RIVER FOOD COURT SANDBAR HOTEL/RV HOTEL RV ENTERTAINMENT OUTDOOR SUMMER POW WOW CALENDAR AREA TRAIL MAPS EVENT CENTER AMENITIES GIFT SHOP POOL & PARTY ROOM Toggle Navigation CASINO GAMING RESPONSIBLE GAMBLING PROMOTIONS PLAYERS CLUB BENEFITS DINING & BAR PUB 33 THIRD RIVER FOOD COURT SANDBAR HOTEL/RV HOTEL RV ENTERTAINMENT OUTDOOR SUMMER POW WOW CALENDAR AREA TRAIL MAPS EVENT CENTER AMENITIES GIFT SHOP POOL & PARTY ROOM Book Now Careers Contact Us Contact Us fsol 2024-08-06T11:46:26-05:00 Contact Us We would love to hear from you Get in touch ways to reach us Need answers or support? Our staff is here for you. Reach out to us and we will respond as quickly as possible. Get started by filling out our form below and a team member will be in touch shortly. Call us 1-844-554-2646 Find us 6268 Upper Cass Frontage Road NW Cass Lake, MN 56633​ Email us info*AT*cedarlakescasino.com Quick Contact send us a message Your Name Your Email Subject Message Submit Thank you for your message. It has been sent. × There was an error trying to send your message. Please try again later. × Win big at all four of our locations Made possible by Leech Lake Gaming Walker, MN Cass Lake, MN Deer River, MN Walker, MN EVENTS PROMOTIONS Partner’s Cribbage Tournament Get a Gift Sept 2025 Sept 7, 2025 – Oct 1 2025 All Promotions Cedar Lakes Casino 6268 Upper Cass Frontage Road NW Cass Lake, MN 56633​ info@cedarlakescasino.com 1-844-554-2646 Responsible Gambling Hotline: 800-333-HOPE NAVIGATION Player’s Club Benefits Responsible Gambling Pub 33 Third River Food Court Sandbar Hotel Careers Contact Us Book a Room Management reserves the right to alter, suspend, or withdraw casino promotions at any time without prior notice. Prizes may vary from those shown. All rights reserved. A Leech Lake Gaming publication, proudly owned and operated by the Leech Lake Band of Ojibwe. © 2025 Cedar Lakes Casino, Hotel, and Event Center | Website Developed by Faster Solutions | All Rights Reserved | Site Map | Privacy Policy Page load link Go to Top"
    },
    {
      "url": "https://cedarlakeswoodsandgarden.com/garden-map",
      "text": "Garden Map | Cedar Lakes Woods and Gardens 4990 NE 180th Ave, Williston, FL 32696 (352) 529-0055 (352) 529-0055 Home PLAN YOUR VISIT Visitor Information Rules and Policies Garden Map Scavenger Hunt Nearby Attractions Group Visit Reservation Membership ABOUT US History Mission Statement Gallery Blog EVENTS Upcoming Vendor Information CONSERVATION EDUCATION Insights Raise The Roof Campaign Flora and Fauna Citizen Science Health Benefits of Nature DONATE MORE CONTACT US VOLUNTEER RENTALS SPONSOR Merchandise More Home PLAN YOUR VISIT Visitor Information Rules and Policies Garden Map Scavenger Hunt Nearby Attractions Group Visit Reservation Membership ABOUT US History Mission Statement Gallery Blog EVENTS Upcoming Vendor Information CONSERVATION EDUCATION Insights Raise The Roof Campaign Flora and Fauna Citizen Science Health Benefits of Nature DONATE MORE CONTACT US VOLUNTEER RENTALS SPONSOR Merchandise Sign In My Account Signed in as: filler@godaddy.com My Account Sign out Signed in as: filler@godaddy.com Home PLAN YOUR VISIT Visitor Information Rules and Policies Garden Map Scavenger Hunt Nearby Attractions Group Visit Reservation Membership ABOUT US History Mission Statement Gallery Blog EVENTS Upcoming Vendor Information CONSERVATION EDUCATION Insights Raise The Roof Campaign Flora and Fauna Citizen Science Health Benefits of Nature DONATE MORE CONTACT US VOLUNTEER RENTALS SPONSOR Merchandise Account My Account Sign out Sign In My Account Download PDF Copyright © 2024 Cedar Lakes Woods and Gardens - All Rights Reserved. Powered by"
    },
    {
      "url": "https://cedarlakeswoodsandgarden.com/",
      "text": "Cedar Lakes Woods and Gardens - Home 4990 NE 180th Ave, Williston, FL 32696 (352) 529-0055 (352) 529-0055 Home PLAN YOUR VISIT Visitor Information Rules and Policies Garden Map Scavenger Hunt Nearby Attractions Group Visit Reservation Membership ABOUT US History Mission Statement Gallery Blog EVENTS Upcoming Vendor Information CONSERVATION EDUCATION Insights Raise The Roof Campaign Flora and Fauna Citizen Science Health Benefits of Nature DONATE MORE CONTACT US VOLUNTEER RENTALS SPONSOR Merchandise More Home PLAN YOUR VISIT Visitor Information Rules and Policies Garden Map Scavenger Hunt Nearby Attractions Group Visit Reservation Membership ABOUT US History Mission Statement Gallery Blog EVENTS Upcoming Vendor Information CONSERVATION EDUCATION Insights Raise The Roof Campaign Flora and Fauna Citizen Science Health Benefits of Nature DONATE MORE CONTACT US VOLUNTEER RENTALS SPONSOR Merchandise Sign In My Account Signed in as: filler@godaddy.com My Account Sign out Signed in as: filler@godaddy.com Home PLAN YOUR VISIT Visitor Information Rules and Policies Garden Map Scavenger Hunt Nearby Attractions Group Visit Reservation Membership ABOUT US History Mission Statement Gallery Blog EVENTS Upcoming Vendor Information CONSERVATION EDUCATION Insights Raise The Roof Campaign Flora and Fauna Citizen Science Health Benefits of Nature DONATE MORE CONTACT US VOLUNTEER RENTALS SPONSOR Merchandise Account My Account Sign out Sign In My Account A century-old abandoned limerock quarry transformed into a 20-acre botanical garden in Williston, FL Upcoming Food and Beverage Vendors Weekend of 9/12/2025 Friday 9/12 Lucas' All-American Dogs Saturday 9/13 Peruvian Blessings Sunday 9/14 Sol Cup Taco Trailer Explore the Beauty of Plants at Cedar Lakes Woods and Gardens Recent News and Announcements: Check out some of our merchandise. All of our merchandise is only available for purchase at our location. It is not for sale online. FYCCN Partnership We're thrilled to share that Cedar Lakes Woods & Gardens is now in collaboration with the Florida Youth Conservation Centers Network ! Together, we're cultivating a future rooted in environmental education, conservation, and youth empowerment. Stay tuned for updates on our upcoming projects and initiatives Raise The ROOF AT CLWG Cedar Lakes Woods & Gardens needs your help! Watch the video to learn about our Raise The Roof campaign- dedicated to raising money for a new Conservation Education Center. Donate Contact Us Drop us a line! Name Email* Send This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Cedar Lakes Woods and Gardens 4990 NE 180th Ave, Williston, FL 32696 (352) 529-0055 Hours Mon 09:30 am – 05:00 pm Tue 09:30 am – 05:00 pm Wed 09:30 am – 05:00 pm Thu 09:30 am – 05:00 pm Fri 09:30 am – 05:00 pm Sat 09:30 am – 05:00 pm Sun 09:30 am – 05:00 pm HOLIDAY HOURS Thanksgiving: 11:00 am - 5:00 pm Christmas Eve: 9:30 am - 3:00 pm Christmas Day: Closed New Years Eve: 9:30 am - 4:00 pm New Years Day: 9:30 am - 5:00 pm Connect With Us Cedar Lakes Woods and Gardens Charitable Acts Organizations  Donated to or Joined Alachua Conservation Trust Florida Youth Conservation Network National Wildlife Federation Conservation Florida Arbor Day Foundation Florida Wildlife Federation Friends of the Earth National Park Foundation Defenders of Wildlife The Nature Conservancy World Wildlife Fund National Audubon Society Tunnels & Towers Humane Society-Wildlife Land Trust Red Cross National Parks Conservation Association THANK YOU Copyright © 2024 Cedar Lakes Woods and Gardens - All Rights Reserved. Powered by"
    }
  ]
}