{
  "fuentes": [
    {
      "url": "https://cedarkeymemory.com/contact",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://cedarkeyhistory.org/photos",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://cedarkeyhistory.org/history-behind-exhibits",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://cedarkeyhistory.org/",
      "email": "director@cedarkeyhistory.org"
    },
    {
      "url": "https://cedarkeyhistory.org/",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://cedarkeyhistory.org/the-cedar-key-cemetery",
      "email": "info@cedarkeycemetery.com"
    },
    {
      "url": "https://cedarkeyhistory.org/the-cedar-key-cemetery",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://cedarkeyhistory.org/the-cedar-key-cemetery",
      "email": "info@cedarkeycemetery.com"
    },
    {
      "url": "https://cedarkeyhistory.org/cedar-key-history",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://www.chronicleonline.com/weeklies/levy_county_citizen/local_news/cedar-key-historical-society-and-museum-making-progress-following-helene/article_cccb47c5-73b2-5a5a-a81e-d94c28ea7b9d.html",
      "email": "webadmin@chronicleonline.com"
    },
    {
      "url": "https://cedarkeyhistory.org/museum-buildings",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "gabe@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "info@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "leadershipboard@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "olivia@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "oliviac@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "scott@journeysherwood.org"
    },
    {
      "url": "https://cedarkeyhistory.org/african-american-in-ck",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://cedarbliss.ca/contact-us/",
      "email": "info@cedarbliss.ca"
    }
  ],
  "mails": [
    "director@cedarkeyhistory.org",
    "filler@godaddy.com",
    "gabe@journeysherwood.org",
    "info@cedarbliss.ca",
    "info@cedarkeycemetery.com",
    "info@journeysherwood.org",
    "leadershipboard@journeysherwood.org",
    "olivia@journeysherwood.org",
    "oliviac@journeysherwood.org",
    "scott@journeysherwood.org",
    "webadmin@chronicleonline.com"
  ],
  "nombre_sitio": "cedarkeyhistory.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://cedarkeymemory.com/contact",
      "text": "Contact | Cedar Key Memory Welcome to Cedar Key Photos Browse by Theme Cedar Key Memory Photographs Browse Images by Theme Aerials Boats Bridges & Causeways Buildings & Businesses Cedar Key School Churches & Cemeteries Fiber Factory & Fenimore Fishing & Seafood Houses Maps Military Postcards Railroad Seahorse Key Lighthouse Storms & Fires Street Scenes Water (Scenic View) Contact Legal More Cedar Key Memory Photographs Browse Images by Theme Aerials Boats Bridges & Causeways Buildings & Businesses Cedar Key School Churches & Cemeteries Fiber Factory & Fenimore Fishing & Seafood Houses Maps Military Postcards Railroad Seahorse Key Lighthouse Storms & Fires Street Scenes Water (Scenic View) Contact Legal Sign In Create Account Orders My Account Signed in as: filler@godaddy.com Orders My Account Sign out Signed in as: filler@godaddy.com Cedar Key Memory Photographs Browse Images by Theme Aerials Boats Bridges & Causeways Buildings & Businesses Cedar Key School Churches & Cemeteries Fiber Factory & Fenimore Fishing & Seafood Houses Maps Military Postcards Railroad Seahorse Key Lighthouse Storms & Fires Street Scenes Water (Scenic View) Contact Legal Account Orders My Account Sign out Sign In Orders My Account Send Email to Museum Name* Email* Attach Files Attachments (0) Send ➥ This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Better yet, see us in person! Cedar Key Historical Society Museum Location: 609 2nd Street, Cedar Key, Florida 32625, United States Mail Address:\nP.O Box 222 Cedar Key, Florida 32625 , United States\n\nPhone Numbers:\nMuseum: (352)  543-5549 Executive Director\n(Anna White Hodges): (352)  949-2733 Hours Open today 01:00 pm – 04:00 pm Get directions Cedar Key Historical Society PRESERVING UNIQUE ISLAND HISTORY The Cedar Key Historical Society (CKHS) Museum– founded as a non-profit educational facility in 1977 – houses a rich archival collection of thousands of photographs, maps, personal letters, historic newspapers, and other materials which chronicles the uniqueness of Cedar Key's Historic and Archaeological District. Open to the public, the Museum complex is composed of the local renowned Lutterloh Building & The Andrews House; located on the corner of 2nd Street and D Street (Hwy 24). VISIT THE MUSEUM WEBSITE WWW.CedarKeyHistory.org Cedar Key Memory Program Thanks to a Small Matching Grant awarded by the State Department Division of Historical Resources, we were able to digitize the Cedar Key Historical Society Museum's photo archive as well as provide funding for the creation of this website to share these photos with anyone in the world for free! Cedar Key Memory Browse Images by Theme Contact Legal Cedar Key Historical Society Museum 609 2nd Street (PO BOX 222) , Cedar Key, Florida 32625, United States cedarkeyhistory@gmail.com Anna White Hodges Executive Director 352.543.5549 cedarkeyhistory.org Copyright © 2022 All Rights Reserved Hurricane Idalia The Cedar Key Historical Society Museum Archives are currently CLOSED due to Hurricane Idalia. Please consider making a donation to help speed up our recovery efforts Donate This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Decline Accept"
    },
    {
      "url": "https://cedarkeyhistory.org/photos",
      "text": "Cedar Key Historical Society Museum - Archive Use Policy, Cedar Key Memory How to Become a Member Online Click Here Home About us & the Board The Museum and Society Museum Buildings Gift Shop Archives & Garden Membership/Volunteer Society Legal Policies Members Only MEDIA-BLOG-EVENTS Blog & Events Videos Oral Histories Photos HISTORY Cedar Key History History Behind Exhibits The Seminoles of Florida Cedar Mills The Cedar Key Cemetery Memberships More Home About us & the Board The Museum and Society Museum Buildings Gift Shop Archives & Garden Membership/Volunteer Society Legal Policies Members Only MEDIA-BLOG-EVENTS Blog & Events Videos Oral Histories Photos HISTORY Cedar Key History History Behind Exhibits The Seminoles of Florida Cedar Mills The Cedar Key Cemetery Memberships Sign In Create Account Orders My Account Signed in as: filler@godaddy.com Orders My Account Sign out Signed in as: filler@godaddy.com Home About us & the Board The Museum and Society Museum Buildings Gift Shop Archives & Garden Membership/Volunteer Society Legal Policies Members Only MEDIA-BLOG-EVENTS Blog & Events Videos Oral Histories Photos HISTORY Cedar Key History History Behind Exhibits The Seminoles of Florida Cedar Mills The Cedar Key Cemetery Memberships Account Orders My Account Sign out Sign In Orders My Account Photos Online Visit Cedar Key Memory to View More Photos. More to come! What is Cedar Key Memory? The Cedar Key Archives houses an array of artifacts containing thousands of historic photos, slides, maps, and documents - many still untapped.  Our team has been hard at work uploading and organizing images for the online archive we call \"Cedar Key Memory,\" so you can explore them right from your laptop or mobile device! Check back  often to see what's new - from Cedar Key's past! View photos Theme of the Month \" The Cedar Key Coast-to-Coast Florida Railroad Train \" Seaboard Air line (SAL) Tain  Depot, Cedar Key, 1912 1911 Map of Seaboard Air Line Railway. Railroad repair crew on the big dock, early 1900s Railroad tracks east end of on Way Key in Cedar Key (circa early 1900s) Seaboard Train Number 375 at New Cedar Key Depot Dock Street after the Railroad (circa 1949) Photo Credit - Francis Johnson FROM THE MAP OF 1884 The First Coast to Coast Florida Railroad and Cedar Key David Levy Yulee In 1853, U.S. Senator David Levy Yulee chartered the Florida Railroad with an ambitious vision to link the Gulf of Mexico to the Atlantic Ocean by rail. Construction began in 1855, with Fernandina as its bustling starting point on the east coast; just six years later, it came to bridge 155.5 miles arriving at the western terminus in the Cedar Keys on March 1, 1861. The success was primarily attributed to Senator Yulee’s efforts as president and chief stockholder; his grand project brought much-needed growth opportunities for Floridians and a new era for the growing island port of the Cedar Keys. Learn more about the history of the first coast-to-coast Florida Railroad and Cedar Key by visiting the Cedar Key Historical Society Museum, or come back to our website soon! \"Father of the Florida Railroad\" Archive Use Policy (2018) PDF Download Download PDF Back to top This site copyright @2022 The Cedar Key Historical Society Inc. Website Developed and Maintained By -Anna White Hodges- Executive Director Home About us & the Board Museum Buildings Archives & Garden Membership/Volunteer Society Legal Policies Members Only Blog & Events Oral Histories History Behind Exhibits Cedar Mills The Cedar Key Cemetery Memberships Powered by This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. Accept"
    },
    {
      "url": "https://cedarkeyhistory.org/history-behind-exhibits",
      "text": "Cedar Key Historical Society Museum - Exhibits, History How to Become a Member Online Click Here Home About us & the Board The Museum and Society Museum Buildings Gift Shop Archives & Garden Membership/Volunteer Society Legal Policies Members Only MEDIA-BLOG-EVENTS Blog & Events Videos Oral Histories Photos HISTORY Cedar Key History History Behind Exhibits The Seminoles of Florida Cedar Mills The Cedar Key Cemetery Memberships More Home About us & the Board The Museum and Society Museum Buildings Gift Shop Archives & Garden Membership/Volunteer Society Legal Policies Members Only MEDIA-BLOG-EVENTS Blog & Events Videos Oral Histories Photos HISTORY Cedar Key History History Behind Exhibits The Seminoles of Florida Cedar Mills The Cedar Key Cemetery Memberships Sign In Create Account Orders My Account Signed in as: filler@godaddy.com Orders My Account Sign out Signed in as: filler@godaddy.com Home About us & the Board The Museum and Society Museum Buildings Gift Shop Archives & Garden Membership/Volunteer Society Legal Policies Members Only MEDIA-BLOG-EVENTS Blog & Events Videos Oral Histories Photos HISTORY Cedar Key History History Behind Exhibits The Seminoles of Florida Cedar Mills The Cedar Key Cemetery Memberships Account Orders My Account Sign out Sign In Orders My Account The History Behind the Exhibits The Historical Society Museum is filled with captivating collections, each telling its unique story. Journey through tales from long ago as we share the history behind museum exhibits online or visit and learn firsthand. The U.S.S. Fort Henry Union Blockade Ship - Museum Exhibit Donated & Crafted by the Crystal River Boat Builders Cedar Keys were blockaded by Union warships during the civil war! Union forces sacked the Cedar Keys rail terminal and seaport in January 1862. For the rest of the war, to prevent desperately needed supplies from reaching the Confederate forces, the US Navy maintained a warship just off the Cedar Keys. One of these warships, the USS Fort Henry, was stationed at Cedar Keys from November 1862 through October 1863. The USS Fort Henry was originally built in Brooklyn as a New York ferry, but was purchased by the US Navy before it saw service as a ferry. Fitted out as a warship she was sent to Key West to join the East Gulf Blockading Squadron. The U.S.S. Fort Henry , “The Terror on Florida’s Gulf Coast.” was named after the Union’s and Gen. Ulysses S. Grant’s February 1862 victory in the Battle of Fort Henry in Tennessee. Under its first commander, Lt. Edward Yorke McCauley, the U.S.S. Fort Henry patrolled between the Suwannee River in Dixie County and Anclote Key off of Pasco County. On July 20, 1863, a USS Fort Henry boat crew ascended the Crystal River in hopes of securing cotton exporters upriver before they could attempt to run through the blockade. An ambush by 50-60 confederates killed two of her men. Their bodies were buried on Seahorse Key, in the Cedar Keys the next day. A grave marker for one of the sailors is in our museum. At the end of the war, she sailed back north to New York and was decommissioned on July 8, 1865. The Long Island Rail Road purchased her at an auction on August 15, 1865, renamed her Huntington and used her as a ferry between Manhattan and Hunter’s Point Queens. After 2 ½ years in ferry service, she was destroyed in a fire at Hunter’s Point on February 22, 1868. The Crystal River Boat Builders crafted a beautiful ship replica and donated it to the Cedar Key Historical Society, where it is on display at the museum in the Lutterloh Building. Submitted by Bob Wooley Some interesting Cedar Key history facts include: This exhibit is on display in the museum’s Lutterloh Building. Edward J. Lutterloh moved to Cedar Key from North Carolina, where he worked as an agent for the Lutterloh Steamship Company the Lutterloh Line. Before the civil war, it operated as one of the largest steamship fleets in the southeast, with hopes of bringing steamships to the Cedar Keys, which did not transpire due to the Civil War. CEdar Keys was invaded at the beginning of the war and under marshal law through out the duration. The Lutterloh family would become politics and merchants. Learn more about the Lutterloh Family History in CEdar Key Vessel Description and Location Map Federal Blockading Ships Stationed off of the Cedar Keys FREE PDF DOWNLOAD PRINT BELOW Listing of Blockaders off Cedar Keys (Navy O.R.) Download PDF This site copyright @2022 The Cedar Key Historical Society Inc. Website Developed and Maintained By -Anna White Hodges- Executive Director Home About us & the Board Museum Buildings Archives & Garden Membership/Volunteer Society Legal Policies Members Only Blog & Events Oral Histories History Behind Exhibits Cedar Mills The Cedar Key Cemetery Memberships Powered by This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. Accept"
    },
    {
      "url": "https://cedarkeyhistory.org/",
      "text": "Hidden Gem - Cedar Key Historical Society Museum How to Become a Member Online Click Here Home About us & the Board The Museum and Society Museum Buildings Gift Shop Archives & Garden Membership/Volunteer Society Legal Policies Members Only MEDIA-BLOG-EVENTS Blog & Events Videos Oral Histories Photos HISTORY Cedar Key History History Behind Exhibits The Seminoles of Florida Cedar Mills The Cedar Key Cemetery Memberships More Home About us & the Board The Museum and Society Museum Buildings Gift Shop Archives & Garden Membership/Volunteer Society Legal Policies Members Only MEDIA-BLOG-EVENTS Blog & Events Videos Oral Histories Photos HISTORY Cedar Key History History Behind Exhibits The Seminoles of Florida Cedar Mills The Cedar Key Cemetery Memberships Sign In Create Account Orders My Account Signed in as: filler@godaddy.com Orders My Account Sign out Signed in as: filler@godaddy.com Home About us & the Board The Museum and Society Museum Buildings Gift Shop Archives & Garden Membership/Volunteer Society Legal Policies Members Only MEDIA-BLOG-EVENTS Blog & Events Videos Oral Histories Photos HISTORY Cedar Key History History Behind Exhibits The Seminoles of Florida Cedar Mills The Cedar Key Cemetery Memberships Account Orders My Account Sign out Sign In Orders My Account Museum is Closed Due to Repairs Hurricane Relief Donations Below  Tax Deductible Or Mail a Check to: Cedar Key Historical, PO Box 222, Cedar Key, Fl. 32625 352-325-2172 Click Here to make A Donation From the Directors Desk December 28th Update on Repairs and Restoration Three Months Since Hurricane Helene It has been three months since Hurricane Helene caused significant damage to the Cedar Key Historical Society Museum. As we reflect on the challenges we’ve faced, it’s important to share our progress and plans for the future. The Lutterloh Building, one of our historic buildings has already been repaired. This building is now being used for fundraisers and events while we prepare to install the museum displays. We are excited about the future exhibits and the stories they will share with our visitors. The Andrews House, which suffered the most damage during the hurricane, is progressing well in its restoration. We are currently in the process of installing drywall, which is an important step in bringing this historic building back to life. The upstairs area of the Andrews House is particularly significant, as it houses our archives and the director's office. This space is crucial because it currently stores all of the exhibit items from both buildings which were saved from the storm.. Alongside the repairs, we are also upgrading the director's office. Over the last two years, it has become a hub of activity, especially during and after the hurricanes. We want this office and our incredible archives to be functional and welcoming. One of the last phases of our restoration will involve the museum grounds. We plan to give them a complete makeover, incorporating new ideas to help prepare for potential future hurricanes and floods, making the museum grounds more resilient to future threats. We want to acknowledge the incredible support we have received from our community. Many generous individuals and organizations have donated both time and funds to help us rebuild. We would also like to extend a special thank you to Linda Parker Hudson. Her unwavering support has been instrumental in sustaining the museum for well over a decade. Her dedication and passion for preserving Cedar Key's history have made a lasting impact on our island community. The Cedar Key Historical Society Museum is on the path to recovery, and we look forward to sharing our restored buildings and exhibits with everyone in the near future. Happy Holidays Hurricane Helene Update November 8, 2024 The Lutterloh building T he first Phase of Hurricane Cleanup is Complete Note: All Exhibit Items Were Removed and Secured Upstairs Hurricane Helene caused 9 feet of flooding outside the Lutterloh Building. Fortunately, because the building was reconstructed years ago to meet FEMA specifications—featuring hurricane windows, steel-framed walls, and hurricane-proof doors—only 3 feet of water entered the structure . The Lutterloh Building suffered significant damage from mud and destroyed display cases. The cleanup involved removing the wrecked cases and hand scrubbing the tile floors, which took weeks. Doors were shaved, doorknobs and hinges replaced, and walls cleaned and sanitized multiple times. Electrical outlets were replaced, ductwork repaired, and the exterior pressure washed. A mold inspection was passed, and the next phase focuses on restoring and recreating this museum building. The Lutterloh building is being prepared for reopening with cleaning, wood oiling, repainting, and window shining. Fundraising events will support the restoration of the Andrews House and courtyard. The opening is on Nov. 8th, featuring Kerry Gordon, the History of the Cedar Key Music Scene, with tickets selling for $25 and selling out in 2 weeks. The event will also include a silent auction. We have arranged a selection of exhibit items from the upstairs safe zone and displayed them in the lobby. This allows attendees to explore aspects of Cedar Key's history during their time at the museum. Exhibits can be rotated, offering a different selection for each event. Check back for dates The Andrews House The First Phase of Hurricane Cleanup Continues Note: All Exhibit Items Were Removed and Secured Upstairs Hurricane Helene caused a 8-foot rise in water near the parking lot side of the building, which flooded up to 4ft inside of the building. The damage is severe. We have been in discussions with the Director of the Historic Preservation Department at the University of Florida regarding strategies for rebuilding with greater resilience. The Andrews House faces a lengthy and costly journey for proper restoration. However, given the ongoing storms and surges, this is truly the best path forward. It may take up to eight months to reopen, contingent on available funding and the procurement of necessary materials . Museum Grounds Grounds The courtyard fence that suffered damage from Hurricane Idalia was entirely obliterated by Hurricane Helene. While one section remains intact, the rest will require replacement. The walkway, wheelchair ramp, and porches linking the Andrews House and shed were heavily damaged. A team has demolished these structures and cleared the wood. Temporary stairs now lead to the Andrews House porch, with a makeshift wooden walkway to the back of the Lutterloh. Hurricane Cleanup Workers and Volunteers Numerous local residents have faced job losses due to the hurricane. In response to this situation, members of the historical society have generously donated funds to help several individuals secure. employment for cleanup efforts at the museum during this difficult time. A big thank you to our amazing volunteers! We especially appreciate Lohse Beeland for her dedication and for organizing a wonderful button collection exhibit before the hurricane. As we work on rebuilding and revamping exhibits, we are grateful to have her on our team! Special Recognition: Linda Parker Hudson We want to gratefully acknowledge Linda Parker Hudson for her incredibly generous donation. Over the years, the museum has faced many hurricanes and the financial difficulties brought on by COVID shutdowns. Without a doubt, Linda’s ongoing support has been crucial in saving our island museum and safeguarding the history of Cedar Key! Hurricane Helene Damages to the Museum On September 26, 2024, Hurricane Helene slammed into Cedar Key, causing severe and widespread damage. The video below is of the Museum's Andrews House. Update on Hurricane Helene and Thank You! Hurricane Helene Update We just wanted to take a moment to shine a light on the incredible value of our amazing volunteers who stepped up to help clean up the muddy mess in the  Cedar Key Historical Society Museum after Hurricane Herlene. This storm left its mark on our beloved museum, a treasure trove of history for our community! We are coming back, it will take time but rest asured that ALL artifacts have been saved by moving them to the upstairs floor! Please consider a donation the buildings recover! Thank You! Hurricane Helene A terrible, historic Storm has caused damage beyond expected. Thankfully, ALL artifacts were secured upstairs, but downstairs is a \"Disaster.\" But fear not—we will return and restore everything to its former glory  and do whatever it takes to once again share the history of Cedar Key with people far and wide! Museum Information Plan your visit! Tour two historic buildings filled with rich island history. With showcases of prehistoric and Indian artifacts exhibits, from commercial fishing to Florida‘s first coast-to-coast Railroad, there’s something for people of all ages! We are leashed pet friendly, and wheelchair accessible. LOCATION 609 2nd Street Cedar Key, Florida 32625 PHONE 352-325-2172 CLOSEDN DUE TO HURRICANE HERLENE Contact us Learn More About Us Past and Present The Cedar Key Historical Society  Museum ESTABLISHED IN 1979 The Cedar Key Historical Museum is a hidden gem in the heart of the beautiful island of Cedar Key on the Gulf Coast of Florida. Uncover fascinating stories of how this coastal community has evolved over various periods - all while marveling at its captivating charm. Resilience and Strength are Hallmarks of the History of Cedar Key! Learn more about how the beginning of the Cedar Key Historical Society Click the About Us -Past & Present button below. Become a Member This is a content preview space you can use to get your audience interested in what you have to say so they can’t wait to learn and read more. Pull out the most interesting detail that appears on the page and write it here. BECOME A MEMBER Stay Up To Date Oral Histories: are known as \"the first kind of history.” The Cedar Key Historical Society is proud to bring oral histories from cassette tapes in their archives to their website to be enjoyed online. Many recordings are well over 40 years old and on cassette tape, which deteriorates over time. However, preserving and remastering to WAV.files for easy listening over modern/mobile devices provides an incredible opportunity to share these significant. Voices of the Past. Click the \"Tune In\" Button Tune in History, Videos, Photos and More... VIDEOS Learn MORE HISTORY and Museum Exhibits PHOTOGRAPHS The Cedar Key History Channel features videos about the history of Cedar Key and more... The Cedar Key History Channel PHOTOGRAPHS Learn MORE HISTORY and Museum Exhibits PHOTOGRAPHS The Cedar Key Archives holds thousands of photographs. View a selection at  Cedar Key Memory. Cedar Key Memory Photo Selections The Cedar Key Cemetery Learn MORE HISTORY and Museum Exhibits Learn MORE HISTORY and Museum Exhibits Information pertaining to the Cedar Key Cemetery can be found here, with the interactive map! The Cedar Key Cemetery Learn MORE HISTORY and Museum Exhibits Learn MORE HISTORY and Museum Exhibits Learn MORE HISTORY and Museum Exhibits Resilience and strength are hallmarks of Cedar Key's history. Also, get a glimpse at museum exhibits and learn about their history. Learn More.... Subscribe Email Sign up Connect With Us Thank You for Visiting! Top of page Contact Us Drop us a line! Name Email* Send This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. The Cedar Key Historical Society Museum 609 2nd Street, Cedar Key, Florida 32625, United States By Phone: 352-325-2172 Executive Director \nAnna White Hodges Director@cedarkeyhistory.org Mobile: 352-949-2733 Hours Open today 11:00 am – 03:00 pm Private Tours are Available Contact Director for More Info Get directions Thank you for your support! Donate today This site copyright @2022 The Cedar Key Historical Society Inc. Website Developed and Maintained By -Anna White Hodges- Executive Director Home About us & the Board Museum Buildings Archives & Garden Membership/Volunteer Society Legal Policies Members Only Blog & Events Oral Histories History Behind Exhibits Cedar Mills The Cedar Key Cemetery Memberships Powered by This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. Accept"
    },
    {
      "url": "https://cedarkeyhistory.org/the-cedar-key-cemetery",
      "text": "Cedar Key Historical Society Museum - Cemetery, History How to Become a Member Online Click Here Home About us & the Board The Museum and Society Museum Buildings Gift Shop Archives & Garden Membership/Volunteer Society Legal Policies Members Only MEDIA-BLOG-EVENTS Blog & Events Videos Oral Histories Photos HISTORY Cedar Key History History Behind Exhibits The Seminoles of Florida Cedar Mills The Cedar Key Cemetery Memberships More Home About us & the Board The Museum and Society Museum Buildings Gift Shop Archives & Garden Membership/Volunteer Society Legal Policies Members Only MEDIA-BLOG-EVENTS Blog & Events Videos Oral Histories Photos HISTORY Cedar Key History History Behind Exhibits The Seminoles of Florida Cedar Mills The Cedar Key Cemetery Memberships Sign In Create Account Orders My Account Signed in as: filler@godaddy.com Orders My Account Sign out Signed in as: filler@godaddy.com Home About us & the Board The Museum and Society Museum Buildings Gift Shop Archives & Garden Membership/Volunteer Society Legal Policies Members Only MEDIA-BLOG-EVENTS Blog & Events Videos Oral Histories Photos HISTORY Cedar Key History History Behind Exhibits The Seminoles of Florida Cedar Mills The Cedar Key Cemetery Memberships Account Orders My Account Sign out Sign In Orders My Account Welcome This webpage houses the Cedar Key Cemetery Interactive Map updated as of June 2022. The Cedar Key Historical Society (CKHS) was awarded a Grant by the Department of State, Division of Historical Resources and the State of Florida. The purpose of this grant project in short was;  to conduct a full mapping of marked graves, complete inventory, ground penetrating radar (GPR) survey of several areas likely associated with unmarked burials, identify marked African American burials in the cemetery, create an interactive (GIS) Map containing all aspects, which you can find below. Use the navigational buttons below for quick access. Photogrammetry Documentation - Headstone Identification Cemetery Grant Project Survey Report - Locating Anomalies Ground Penetrating Radar (GPR) Cedar Key Cemetery Interactive Map Cedar Key Historical Society Cemetery Grant Info Cemetery Mapping and Ground Penetrating Radar Survey-REPORT Cemetery Mapping and Ground Penetrating Radar Survey-REPORT Cemetery Mapping and Ground Penetrating Radar Survey-REPORT The Cedar Key Historical Society (CKHS) was awarded a Grant by the Department of State, Division of Historical Resources and the State of Florida, commencing July 1, 2021. The Cedar Key Cemetery project scope of work was contracted by Digital Heritage Interactive LLC. ( see procurement process to left) The purpose of this grant project in short was;  to conduct a full mapping of marked graves, complete inventory, ground penetrating radar (GPR) survey of several areas likely associated with unmarked burials, identify marked African American burials in the cemetery, create an interactive  (GIS) Map, produce a survey report and update the Florida Master Site File. This project uses an interdisciplinary approach combining field mapping, GPR survey, and documentary research to produce an accurate map for use by the City of Cedar Key to manage the cemetery’s burials. In addition, this project equally focuses on identifying marked African American burials, locating  all unmarked graves as possible. The results of this project includes an interactive map based on the field mapping of approximately 1,250 marked burials and other cemetery furniture (e.g., walls, benches) in the Cedar Key Cemetery. This interactive map and the GIS that informs it also includes the results of a GPR survey to identify subsurface anomalies.This project provides new historical information through a complete inventory of all marked burials (as of June 2022) as well as GPR survey of 18 grids containing approximately 90 unmarked burials. The grant contract deliverables include an interactive GIS map of the results of the mapping and GPR survey report and updated Florida Master Site File (FMSF) form for the cemetery and archival research resulted in a final archaeological survey report conforming to Chapter 1A-46, Florida Administrative Code. A central goal of this project centers on identifying African American marked burials in the cemetery. As such, photogrammetry documentation of 16 grave markers and historical research related to African American burials in the site was also conducted. Results demonstrate far more African American burials that previously thought, in additional areas and many of them clearly marked, and historical documentary research revealed 2 dozen marked African American burials in the eastern areas of the cemetery, most of which were not previously thought to be African American because of their location or the illegi The distribution of marked African American graves in the cemetery does not conform to typically segregated cemeteries in the rural South. Typically, if Black and White burials occur in the same location, they are spatially separated in a clear way.  Deliverables were submitted and accepted by the State of Florida on August 2022. REPORT SUMMARY MORE DETAILED/TECHNICAL INFORMATION BELOW. The outputs of this work include, not limited to : Report on the findings of the GPR Survey Mapping GIS Files of all Findings, Updated Florida Master Site File forms An interactive Map for the CKHS to host on their website.- . The survey report  and GIS Files, Mapping are  secured are on a hard drive in the Archives of the Cedar Key Historical Society . Updated Florida Master Sight File PDF Below Interactive map is on this website, click button below. GRANT PROCUReMENT PROCESS / CREDITS Cemetery Mapping and Ground Penetrating Radar Survey-REPORT Cemetery Mapping and Ground Penetrating Radar Survey-REPORT Procurement Process: The Grantee shall provide maximum open competition when procuring goods and services related to the grant-assisted project. Procurement documentation supporting leading open competition must be submitted to the Division for review and approval before the execution of project contracts. The Grantee shall submit survey project contracts to the Division for review and approval before execution. Procurement documentation supporting maximum open competition must be submitted to the Division for review and approval before the execution of project contracts. Following state procurement guidelines, the proposal submitted by Digital Heritage Interactive LLC was accepted by the Cedar Key Historical Society Board of Directors and the Division of HIstoric Preservation and the State of Florida. Digital Heritage Interactive LLC Diana González-Tennant, MA, RPA Project Manager Edward González-Tennant, PhD, RPA GPR Specialist (DHI) Digital Heritage Interactive LLC has undertaken similar survey, GIS, GPR, and interactive mapping projects in Levy County and elsewhere. This includes Dr. Edward Gonzalez-Tennant's cemetery documentation work in  Rosewood and Shiloh cemeteries, funded by a Florida Small Matching Grant, and significant work directing similar projects elsewhere in the state. This work has resulted in approved reports submitted to the same state agency funding the current project. Credits: Cedar Key City Commission and City Staff expressed their strong and unanimous backing to the cause championed by the Cedar Key Historical Society, bolstered further by a widespread show of public support from both those residing in the city and its extended community. The Cedar Key Historical Society Board of Directors, members, and sponsors strongly endorsed this project to preserve and promote the reminiscences of this historic city. Historic Preservation Grants -  Florida Department of State Division of Historical Resources This investigation was conducted to comply with Section 106 of the National Historic Preservation Act (as amended) and its implementing regulation 36 CFR 800 (Protection of Historic Properties). All work performed is consistent with the FDHR recommendations for such projects as stipulated in the FDHR's Cultural Resource Management Standards & Operations Manual, Module Three: Guidelines for Use by Historic Preservation Professionals. This study complies with Chapter 267 of the Florida Statutes and Rule Chapter 1A‐46, Florida Administration Code. This project also adheres to Chapter 872 of the 2015 Florida Statutes, which protects all memorials, grave ornaments, and burial enclosures from destruction and removal. These statutes extend to unmarked burials as well. Chapter 3 includes procedures for dealing with unexpected discoveries. No graves were disturbed for this project. The Cedar Key Historical Society Board of Directors and the Executive Director did not receive any financial compensation from this grant. Photogrammetry Documentation - Headstone Identification What is photogrammetry? New technologies have come to the rescue, offering ways to recover those lost inscriptions without damaging the stone. The Cedar Key Cemetery Progect provided this much needed resource. The first grave marker to be documented sat all alone on top of a hill ( photo on the left). Photogrammetry is the process of extracting physical information about real-world objects from a series of photographic images. The most common form used by historical archaeologists is structure from motion (SfM), a technique that creates 3D models from a series of images. This process can help to make worn away or indecipherable objects visible. Metashape Standard edition was used for the Cedar Key Cemetery by Digital Heritage Interactive LLC . ••Metashape uses a computer’s graphics processing unit (GPU) to aid in processing time and overall quality of resulting 3D models. • Metashape typically uses still images to calculate an initial sparse point cloud, which is further processed resulting in a dense point cloud (similar to LiDAR point clouds) and final textured 3D models. However, videos were recorded of each grave marker and individual frames extracted using Metashape’s Import Video function to reduce field collection time Some historic gravestones have become so weathered, it’s almost impossible to read them. . The first grave marker documented with photogrammetry was that of Adeline Tape (see photo above). A total of 86 still images were used to construct the initial sparse point cloud, which was then converted into a 3D mesh/model in Metashape illustrates several stages of this processing and shows how legible the 3D model becomes, aiding in identifying who is buried at this location. Historical research identified Tape as an African American woman present in Cedar Key for the 1920 federal census. It lists her age as 60 and her occupation as a laborer at the town’s fiber factory. However, efforts to locate a death certificate for Adeline Tape were unsuccessful. The grave marker provided clues about other potential African American burials in the cemetery. It is a poured concrete marker that stands approximately 1.5 feet high. Photogrammetry was used to Identify worn Headstone Inscriptions. Several other markers across the road from the area containing Tape’s grave had similar characteristics. These graves were also documented using photogrammetry. They all measure the same base proportions (roughly 60 x 40 cm) with varying heights. These graves are Crummie Alston, Willie Chance, Della Collins, Lillie E Conyers, Christina Smith, Ann Steward, and a shared grave marker for Lewis and Dan Thomas. The location of these graves alerted researchers to the fact that other African American graves were present to a far greater extent than previously thought. - HISTORICAL RESEARCH - The historical research accompanying the archaeological field mapping and GPR survey provided important contextual information for this project; to locate and document these and other African American burials with visible markers. Historical documents consulted include state and federal census and State of Florida Certificates of Death. These revealed 24 MARKED African American graves in the Cedar Key Cemetery, and ALL individuals have been identified through historical research. The distribution of marked African American graves in the cemetery does not conform to typically segregated cemeteries in the rural South. Typically, if Black and White burials occur in the same location, they are spatially separated in a clear way, making the Cedar Key Cemetery historically unique. A solemn silence flows in the air.\n A sorrowful sight that lies so bare. \nThe unmarked graves, their stories untold. A moment of silence, a prayer to the souls. dedicated to the unknown burials ~ Anna White Hodges Ground Penetrating Radar (GPR) -Locating Anomalies Digital Heritage Interactive LLC Contracted to Conduct Ground Penetrating Radar (GPR) - Equipment Digital Heritage Interactive LLC Contracted to Conduct Ground Penetrating Radar (GPR) - Equipment Digital Heritage Interactive LLC Contracted to Conduct Ground Penetrating Radar (GPR) - Equipment GPR is a geophysical method offering a non‐invasive option for archaeological surveys. GPR uses electromagnetic waves generated from an antenna – pushed along the ground – from which reflective signals are collected, processed, and interpreted. The theory of operation and applications for GPR in archaeology are well-known, having been synthesized by Conyers (2004, 2006a, 2006b) and Goodman et al. (2009). In brief, a GPR unit records reflected radar energy. It uses a lapse in travel time and varying amplitude to create 2D transects, commonly referred to as radargrams or reflection profiles. Profiles can be compiled to create 2‐D and 3‐D imagery (Goodman et al. 2009). Data is collected in linear transects arranged in a grid. Typically, GPR surveys are oriented perpendicular to the objects they hope to detect. In the case of graves, which generally are oriented east-west, transects are arranged north-south, perpendicular to the potential objects. Marked burials in the Cedar Key Cemetery were roughly oriented in this manner. However, considerable variety did exist, with many graves being oriented up to 45 degrees off an accurate east-west line. A series of grids oriented north-south were created, and transects were spaced .5m apart, allowing for several hits or returns per buried anomaly/feature. As historic graves typically span 1-2 meters, they will appear in 4-6 transects. Ground Penetrating Radar Equipment The GPR equipment used for this project was a 500MHz antenna mounted on a four-wheel cart. Recent GPR testing in Florida suggests frequencies between 250MHz and 500MHz are ideal for locating unmarked historical burials (Schultz and Martin 2011). However, most archaeologists prefer the 400MHz - 500MHz range because it offers a superior resolution for identifying subsurface anomalies likely to be historic burials. A four-wheel cart marked distance in the data. GPR DATA Collection and Process: Typically post, processed, and the transects are analyzed to identify potential anomalies that may be unmarked burials. In essence, hyperbolas in each transect are noted and tracked across neighboring hyperbolas. These features are referred to as anomalies, which are identified as potential unmarked burials if they meet several aspects. This project used four characteristics to determine if an anomaly is likely to be an unmarked burial. A four-part classification scheme was adopted for this project, and anomalies considered potential candidates to be unmarked burials if they met one or more of the following: crosses multiple transects (2-3+), roughly oriented east-west, rectangular/appearance, and other additional aspects (e.g., grave marker present). Potential graves were given confidence values of 1 - 3, with 1 being the highest confidence and meeting three or more of the above characteristics. A confidence value of 2 means at least two characteristics are met, and a value of 1 means only one was met. The GPR data for this project was recorded in the .dzt format, and post-processing was completed with GSSI’s Radan software, which natively works with the .dzt data format. Radan was used to filter the field data and construct horizontal slices interpolated from individual transects (aka radargrams). Transects for each grid were grouped and batch processed. Although individual settings differed, each transect was time zeroed, filtered, migrated, and varying degrees of gain applied. The Time Zero processing step aligns the subsurface data with the earth’s surface. Findings: A careful examination of 450 transects across 18 grids revealed 90 anomalies. Digital Heritage Interactive LLC. GPR Data Processing Software -Cemetery Mapping and Interactive Map - Timeline Work Schedule Digital Heritage Interactive LLC Contracted to Conduct Ground Penetrating Radar (GPR) - Equipment Digital Heritage Interactive LLC Contracted to Conduct Ground Penetrating Radar (GPR) - Equipment For this project, FIR or IIR filters were applied, and the decision was made with each batch of files based on which set of filters best-removed noise from the transects. FIR is an older filter set meant to remove noise and horizontal banding. IIR is a newer filter type that is less resource intensive and focuses on eliminating noise. In practice, these filters remove signals above and below a specified set of frequencies. These can remove or lessen interference from subsurface metallic objects, cellular phone interference (4G uses 750-900MHz range), and so forth. In practice, most transects for this project had Low Pass set to 750MHz and High Pass between 125 and 250MHZ. If FIR filtering was used, a boxcar background removal filter was also applied, typically with a length range of 21-41. If IIR filters were used, the Radan Background Removal filter was also involved (which effectively mirrors the Noise Band Removal filter). Ranges were adjusted to equalize data vertically, making deeper anomalies more visible. Cemetery Mapping and Interactive Map Marked burials were mapped using a combination of total station and RTK GNSS receiver. Features mapped include headstones, footstones, slabs, and areas where the shell has been deposited to mark/outline graves. In addition, features not associated with specific burials were also mapped, including walls, benches, and similar features typically placed alongside family plots. All parts were organized as a series of shapefiles in QGIS. Information from legible markers was added to the attribute table of relevant GIS features. Users of the GIS and interactive map can locate every visible part present as of mid-June 2022. Users simply choose the Identify tool and click on features to access this information. In addition, when available, a hyperlink to the grave’s Find A Grave page is also included in the attribute table. The Interactive Map mirrored the appearance of the GIS map document and was created using the QGIS 2 Web plugin. This freely available plugin converts a QGIS map document into a set of standalone files that can be uploaded to the most popular web hosting platforms and then intuitively accessed in a web browser. The interactive map for this project is provided as a zip archive/file that can be copied to any folder on a user’s computer and accessed by clicking the index.html file. DHI has previously provided similar interactive mapping content to the Cedar Key Historical Society. The interactive map allows the historical society, the City of Cedar Key, and members of the public to access an up-to-date map of the entire cemetery. This also includes the results of the GPR survey. TIMELINE: Fieldwork took place over eight weeks between December 2021 and June 2022. The first week in December 2021 consisted of a site visit, which included surveying possible GPR areas with CKHS staff and establishing a preliminary mapping grid. Two additional weeks of mapping took place in March 2022. They consisted of mapping several sections of the cemetery using the dual channel, real-time kinematic (RTK) global navigation satellite system (GNSS) receivers. The additional mapping occurred during two other visits, including one week in April and four weeks in late May through mid-June. The GPR survey was conducted during the final four weeks, following the clearance of areas considered to have a high likelihood of containing unmarked graves, which the city of Cedar Key facilities department completed in late May 2022. Historical research and report preparation occurred primarily in June and July 2022. Cemetery Interactive  Map Cedar Key cemetery interactive map The interactive map created by Digital Heritage Interactives, mirrored the appearance of the GIS map document and was created using the QGIS 2 Web plugin. If you have problems, questions or need assistance contact link below. info@cedarkeycemetery.com Info@cedarkeycemetery.com The Cedar Key Historical Society Home Page HISTORICAL CEMETERY FORM FLORIDA MASTER SITE FILE UPDATED - LV00227 Download PDF Return to the top Visit the cedar key historical society museum This site copyright @2022 The Cedar Key Historical Society Inc. Website Developed and Maintained By -Anna White Hodges- Executive Director Home About us & the Board Museum Buildings Archives & Garden Membership/Volunteer Society Legal Policies Members Only Blog & Events Oral Histories History Behind Exhibits Cedar Mills The Cedar Key Cemetery Memberships Powered by This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. Accept"
    },
    {
      "url": "https://cedarkeyhistory.org/cedar-key-history",
      "text": "Cedar Key Historical Society Museum - Nostalgia, Cedar Key History How to Become a Member Online Click Here Home About us & the Board The Museum and Society Museum Buildings Gift Shop Archives & Garden Membership/Volunteer Society Legal Policies Members Only MEDIA-BLOG-EVENTS Blog & Events Videos Oral Histories Photos HISTORY Cedar Key History History Behind Exhibits The Seminoles of Florida Cedar Mills The Cedar Key Cemetery Memberships More Home About us & the Board The Museum and Society Museum Buildings Gift Shop Archives & Garden Membership/Volunteer Society Legal Policies Members Only MEDIA-BLOG-EVENTS Blog & Events Videos Oral Histories Photos HISTORY Cedar Key History History Behind Exhibits The Seminoles of Florida Cedar Mills The Cedar Key Cemetery Memberships Sign In Create Account Orders My Account Signed in as: filler@godaddy.com Orders My Account Sign out Signed in as: filler@godaddy.com Home About us & the Board The Museum and Society Museum Buildings Gift Shop Archives & Garden Membership/Volunteer Society Legal Policies Members Only MEDIA-BLOG-EVENTS Blog & Events Videos Oral Histories Photos HISTORY Cedar Key History History Behind Exhibits The Seminoles of Florida Cedar Mills The Cedar Key Cemetery Memberships Account Orders My Account Sign out Sign In Orders My Account Nostalgia from the Old Website Nostalgic  1998  Overview of  History from the Old Website ( the updated version coming soon) The many shell mounds and the abundant Indian artifacts found in \"The Cedar Keys\" are ample proof that this area has been attractive to humans for thousands of years. From Spanish archives, we find that \"Las Islas Sabinas\" (the Cedar Keys), provided temporary shelter for Spanish sailors and traders in the 18th Century, including Renato Beluche, an associate of the pirates were known as the Laffiite brothers, and William Augustus Bowles, an early 19th Century mercenary who supplied arms to the Indians. . These Indian Wars were important in Cedar Key History. The big island of Atsena Otie, which can be seen a half-mile south of the Cedar Key (Way Key) dock area,Later, these islands--or keys--played a role in the Seminole Indian Wars, which resulted in the removal of most of the Seminoles to western reservations was the site of a hospital and military depot and staging area between 1839 and 1842 and became known as Depot Key. At this time there were few(if any) people living here on Way Key, the site of our present city. The words Atsena Otie mean “cedar island\" in the Creek Indian language, and at one time there was an official United States post office by that name located on the island. Later it was renamed as the first Cedar Key post office, and later still, it was moved to Way Key.(Cedar Key) In 1843, at the end of the Second Seminole War, a New Englander namedAugustus Steele bought the military structures there for $227.00, and was granted ownership of the 167 acres of Atsena Otie. This island then became the nucleus of the first organized white settlement in the area. With a good deep-water dock, it soon became the major port for trans-shipment of cotton, sugar, tobacco and lumber produced around the Gulf and on inland plantations. Judge Steele had a friend, Davld Levy Yulee(one of Florida's first US. Senators) who organized and eventually built the first cross- Florida railroad. The line ran from Fernandina on the Atlantic (just north of Jacksonville) to Way Key on the Gulf of Mexico, the site of present day Cedar Key. As the railroad neared its western terminus, Yulee was able to acquire most of the land on Way Key, and in 1859 had a town plat issued which comprised a street grid for the City of Cedar Key. This plat was used by the Florida Railroad Company, and suddenly Cedar Key became a company town. in 1854, the Cedar Key Lighthouse was completed on Seahorse Key. The first train rolled into Cedar Key in March, 1861. Yulee’s resident manager of the Town Improvement Company was Edward Lutterloh, a lawyer and local politician who controlled much of the early growth of the city. About the only land on the island not owned by the Town Improvement Company was a homestead owned by Thomas Parsons. Subsequently, lots changed hands, houses were built, and the town began to grow. The Civil War found only about 200 people on the Cedar Keys. Union forces shelled the old gun emplacements near the lighthouse on Seahorse Key and fired a salvo on Atsena Otie and WayKey, (a cannon ball from Seahorse Key may be seen in the museum). The railroad, the depot, ships at anchor, and public buildings were damaged or destroyed and the port facilities were blockaded. Blockade running became a common occupation of local citizens. In 1864 the Cedar Keys became the headquarters for a Union force called the 2nd Florida Cavalry. A skirmish occurred on the mainland near \"Number Four Station\" where the salt works was located. Although both ends of the railroad were in Union hands, the mainland remained in Confederate control. After the war, the railroad terminus at Cedar Key served as the main port for coastal shipping and for travelers and settlers trying to reach places along the southwest coast of Florida. By 1867, the railroad had been repaired and in 1869, the City of Cedar Key was incorporated. Many new homes were constructed, sidewalks were built, and by 1870 the population was 400. A local newspaper, the “Florida State Journal” was published by Ira Gore, and a boatyard was started by Eugene Coons on Piney Point near the present airport. A new wharf and warehouse were built in 1870, and Cedar Key was headed for a boom--with three hotels, three restaurants and bars, and several mercantile establishments, including Parsons and Hale in the building now known as the Island Hotel. Early oyster shell concrete (or \"tabby\") construction was inexpensive and \"as durable as brick if carefully poured,\" was used for some residential and commercial structures. The two communities on Atsena Otie and Way Key continued to coexist and prosper with only the busy waterway between. There were two sawmills on Atsena Otie, the larger being the Eberhard Faber mill which cut red cedar slats for pencils. This mill was set up in 1865. Also cutting cedar slats for pencils and pencil boxes was The Eagle Pencil Company Mill on Way Key at 3rd and G Streets. . Both mills were so badly damaged by the 1896 hurricane and fire that they ceased operations soon after. The 1884 Sanbor Birdseye Map, available at the museum, shows how these two separate communities functioned as a single city. In 1886, it was reported that the 17 sawmills inCedar Key were turning out nearly half a million board feet per week, much of it going to the West Indies and Mexico! In 1867, the famed naturalist and founder of the Sierra Club, John Muir, walked from Kentucky to Way Key and stayed with one of the millers, W.B. Hodgson, while he recovered from the malaria he had contracted on his walk across Florida. There is a John Muir exhibit in the Historical Society Museum. While early accommodations for travelers to the Cedar Keys were still considered “primitive” according to Sidney Lanier, great improvements were being made. The business of commercial fishing, boat building, sponging, green turtling, oystering, and turpentine distilling all flourished, providing employment for several thousand people in the area. Those employed included squatters on the out islands as well as those living in the small mill towns of Lukens, Sumner and Rosewood, located along the railroad between Cedar Key and Otter Creek. Thousands of pounds of seafood were shipped from the commercial fish houses on the “Big Dock” via the railroad on tracks laid out to the end of the dock. Two of the largest of these seafood wholesalers were W.R. Hodges and B.C. Wadley. The first true road between Cedar Key and the mainland, three miles distant, was proposed by Lutterloh in 1876. It was not completed until much later, at that time eliminating the need to take a boat at high tide. The old road, made of oyster shells pounded into the mud was a low tide road and was passable only when the tide was out! Of course, one could always use the railroad if one had urgent business on the mainland.  No thought had been given to the conservation of either the land or sea resources, and because of this, both were being depleted. In 1884 Henry Plant's rival railroad connecting Tampa to the east coast began cutting into Cedar Key’s shipping industry. As if to seal the city's doom, an 1896 hurricane brought a drastic storm surge, locally called “the tidal wave” which badly damaged the Faber Cedar Mill and the Suwannee Lumber Company Pine Mill on Atsena Otie. As a result of this as well as the dwindling cedar stands, the Faber Mill soon closed operations. Both of these industries were located by the shore where the logs were boomed, and so took the brunt of the storm. More than thirty-five houses on Atsena Otie’s high ground survived the surge, however, and families continued to live there until the remaining house were bought in 1904 by fish house owner W.R. Hodges and barged here to Way Key to be used as rental housing and industry buildings.  The 1896 storm also brought destruction all of the islands, where the storm surge was accompanied by high winds and an ensuing fire. Atsena Otie ceased to be a settlement in the early 20th century, and Cedar Key gradually became a small fishing village as people left for greener pastures. In 1910, Dr. Dan Andrews established the Standard Manufacturing Company (the “Fiber Factory”) 'to make brushes and brooms from cabbage palm fiber. This operation employed more than 100 men and women, and although damaged by the hurricane of 1950, continued operation until 1952. A number of people were also employed by the Cedar Key Seafood Cannery, including 75 crabbers. Boat. building continued in Cedar Key during the 1920s and 1930s. The railroad that had played such a prominent role in Cedar Key history was abandoned in 1932, leaving only the seafood and service industries to support the population of approximately 900. COMING SOON! The History of Cedar Key is forever growing and being uncovered. Enjoy the nostalgia from the past written history. A more up-to-date edition will be added shortly! home This site copyright @2022 The Cedar Key Historical Society Inc. Website Developed and Maintained By -Anna White Hodges- Executive Director Home About us & the Board Museum Buildings Archives & Garden Membership/Volunteer Society Legal Policies Members Only Blog & Events Oral Histories History Behind Exhibits Cedar Mills The Cedar Key Cemetery Memberships Powered by This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. Accept"
    },
    {
      "url": "https://www.chronicleonline.com/weeklies/levy_county_citizen/local_news/cedar-key-historical-society-and-museum-making-progress-following-helene/article_cccb47c5-73b2-5a5a-a81e-d94c28ea7b9d.html",
      "text": "Please wait while we attempt to load the requested page"
    },
    {
      "url": "https://cedarkeyhistory.org/museum-buildings",
      "text": "Cedar Key Historical Society Museum - Historic Buildings, Surrounding Areas How to Become a Member Online Click Here Home About us & the Board The Museum and Society Museum Buildings Gift Shop Archives & Garden Membership/Volunteer Society Legal Policies Members Only MEDIA-BLOG-EVENTS Blog & Events Videos Oral Histories Photos HISTORY Cedar Key History History Behind Exhibits The Seminoles of Florida Cedar Mills The Cedar Key Cemetery Memberships More Home About us & the Board The Museum and Society Museum Buildings Gift Shop Archives & Garden Membership/Volunteer Society Legal Policies Members Only MEDIA-BLOG-EVENTS Blog & Events Videos Oral Histories Photos HISTORY Cedar Key History History Behind Exhibits The Seminoles of Florida Cedar Mills The Cedar Key Cemetery Memberships Sign In Create Account Orders My Account Signed in as: filler@godaddy.com Orders My Account Sign out Signed in as: filler@godaddy.com Home About us & the Board The Museum and Society Museum Buildings Gift Shop Archives & Garden Membership/Volunteer Society Legal Policies Members Only MEDIA-BLOG-EVENTS Blog & Events Videos Oral Histories Photos HISTORY Cedar Key History History Behind Exhibits The Seminoles of Florida Cedar Mills The Cedar Key Cemetery Memberships Account Orders My Account Sign out Sign In Orders My Account Two Historic Buildings House Museum Exhibits The Lutterloh Building The Andrews House Historic Buildings of the Museum The Lutterloh Building Edward J. Lutterloh completed the construction of his residence in 1870, which now houses the Cedar Key Historical Society Museum. MORE COMING SOON! Supreme Court Case - E.J. Lutterloh V.S. the the Mayor and Council of the Town of Cedar Key 1873 - E.J. sued the town of Cedar Key. The city had plans to build a public market with live hogs and jail too close to his building. 1875- the case was presented to the Supreme Court of Florida. In a landmark ruling the court ruled in favor of Edward J. Lutterloh against the Mayor and Council of the Town Cedar Key regarding their obstruction on public highway rights-of-way. Furthermore, it was determined that the town had no more right to erect such an obstruction in the highway than any private citizen. The right of occupancy of the street by the public is a mere easement or right of passage. Learn more about the notable Cedar Key Lutterloh decendants Historic Buildings of the Museum The Andrews House The original part of the house was built on Atsena Otie in Cedar Key before the devastating 1896 hurricane and had a history of survival and perseverance. After the storm, it was salvaged by W. R. Hodges and floated on a barge across the channel to Way Key Island. This island was located near the big dock, cargo ship areas, train loading areas, and train station and was ideal for industrial use. In 1910, Dr. Dan Andrews purchased the building and land to build the Standard Manufacturing Company, using the small building as an office and home. It also served other entities, including Western Union during WWII and Island City Investment  Company, which raised funds to redeem delinquent city bonds during the Great Depression. Later, Dr. Dan started a family and added more rooms and a second-story addition to the building to make it a home. As his family grew, so did his business, and for over forty years, it provided Cedar Key with economic development and employment opportunities and carried many through the Great Depression. After  years of success, the company closed permanently in 1952. The building was vacant from 1984-1995 but still owned by the Andrews family. After years of deterioration, they donated it to the Cedar Key Historical Society, where it could be given new life as a premier showcase for ever-expanding museum exhibits. It was moved to the Historical Society property next to the Lutterloh Building and underwent extensive renovations, allowing it to be saved again. A substantial grant from the State Division of Cultural Affairs of $500,000, plus additional community contributions of skills, time, and money, brought new life to this historic structure! MORE COMING SOON! The Standard Manufacturing Company \"the Fiber Factory\" Founded by Dr. Dan Andrews in 1910, Standard Manufacturing Co.'s pioneering work in making brushes from sabal palm fiber breathed new life into Cedar Key's economy. His company's growth provided an economic boost for Cedar Key and employment opportunities for locals for over four decades - a source of pride still remembered today. To learn more about this history-making endeavor and hear first-hand accounts, watch the video by clicking below featuring Dr. John Andrews (Dr. Dan's son), born in the same house that inspired such an enterprise! Video - History of the Fiber Factory by Dr. John Andrews Notable Lutterloh Descendants in Cedar Key John Brooks Lutterloh 1853-1934 John Brooks Lutterloh was the son of Frederic Lutterloh and Angelette Brooks, both born in North Carolina. Frederic was the brother of E.J. Lutterloh making John a nephew of Edward Lutterloh (1824-1905) He was a successful merchant. Both John and Edward served as mayors of Cedar Key in Levy County, FL, and they sometimes worked together on official town business and were prominent figures in the development of Cedar Key! Jhn Brooks Lutter On May 2nd 1891, the Levy Times-Democrat reported John's horse kicked him in the head, fortunately his injuries were not fatal, the article referred to John Brooks Lutterloh as being Mayor. He passed away in 1934 at 76yrs while visiting family members in North Carolina but was returned for burial to his beloved Cedar Key. https://www.findagrave.com/memorial/55882620/john-brooks-lutterloh Charles Buxton Rogers (1852 - 1926) Charles Buxton Rogers (1852 - 1926) was the son of John Rogers a prosperous plantation owner in N.C, and Joanna Lutterloh Rogers, sister of E.J. Lutterloh. John Rogers died as a confederate prisoner at Point Look Out Prisoner-of-War Camp in Maryland during the Civil War in 1864. In 1869 Charles, at 17 yrs, moved to Cedar Key, where his Uncle E.J. Lutterloh was living, to work as a clerk in the Florida Railroad Company. He opened a general mercantile business in Cedar Key in 1872. back to top This site copyright @2022 The Cedar Key Historical Society Inc. Website Developed and Maintained By -Anna White Hodges- Executive Director Home About us & the Board Museum Buildings Archives & Garden Membership/Volunteer Society Legal Policies Members Only Blog & Events Oral Histories History Behind Exhibits Cedar Mills The Cedar Key Cemetery Memberships Powered by This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. Accept"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "text": "Leadership Team — Journey Church New Here? Find Us Plan a Visit Leadership Team About Us Who We Are What We Believe Journey Kids Journey Youth Journey Women Journey Men Partners Next Steps Discipleship Bands Connection Card Serve Need Prayer? Journey Groups Be Baptized Membership at Journey Need Help? Summer at Journey Messages Give LiveStream New Here? Find Us Plan a Visit Leadership Team About Us Who We Are What We Believe Journey Kids Journey Youth Journey Women Journey Men Partners Next Steps Discipleship Bands Connection Card Serve Need Prayer? Journey Groups Be Baptized Membership at Journey Need Help? Summer at Journey Messages Give LiveStream Leadership Team New Here Find Us Plan a Visit Leadership Team Journey Church Staff Team Scott Edinger Lead Pastor scott@journeysherwood.org Olivia Pothoff Pastor of Worship & Care olivia@journeysherwood.org Gabe Nielsen Director of Journey Youth gabe@journeysherwood.org Olivia Cuddeford Director of Journey Kids oliviac@journeysherwood.org Journey Church Leadership Board The Leadership Board at Journey Church is made up of six members of the Journey Church family and the Lead Pastor. They are assigned to help guide, equip, and empower the pastors and staff at Journey Church to fulfill the mission and vision that God has uniquely given us. Our current Leadership Board members: Megan O’Connell, Jon Burgi, Lacey McNay, Ed Hatch, Amy Schlapper, Josh Thoreson. If you have any questions for the Leadership Board please email: leadershipboard@journeysherwood.org Back to Top Events Messages FOLLOWING JESUS TOGETHER Phone 503.610.0759 Email info@journeysherwood.org Gather 22689 SW Pine Street, Sherwood, OR Mail PO Box 322, Sherwood, OR 97140 Subscribe To Our Weekly Update Sign up with your email address to receive our weekly email updates. First Name Last Name Email Address Sign Up We respect your privacy. Thank you for signing up for our Weekly Update!"
    },
    {
      "url": "https://cedarkeyhistory.org/african-american-in-ck",
      "text": "Cedar Key Historical Society Museum - Surrounding Areas, African American History How to Become a Member Online Click Here Home About us & the Board The Museum and Society Museum Buildings Gift Shop Archives & Garden Membership/Volunteer Society Legal Policies Members Only MEDIA-BLOG-EVENTS Blog & Events Videos Oral Histories Photos HISTORY Cedar Key History History Behind Exhibits The Seminoles of Florida Cedar Mills The Cedar Key Cemetery Memberships More Home About us & the Board The Museum and Society Museum Buildings Gift Shop Archives & Garden Membership/Volunteer Society Legal Policies Members Only MEDIA-BLOG-EVENTS Blog & Events Videos Oral Histories Photos HISTORY Cedar Key History History Behind Exhibits The Seminoles of Florida Cedar Mills The Cedar Key Cemetery Memberships Sign In Create Account Orders My Account Signed in as: filler@godaddy.com Orders My Account Sign out Signed in as: filler@godaddy.com Home About us & the Board The Museum and Society Museum Buildings Gift Shop Archives & Garden Membership/Volunteer Society Legal Policies Members Only MEDIA-BLOG-EVENTS Blog & Events Videos Oral Histories Photos HISTORY Cedar Key History History Behind Exhibits The Seminoles of Florida Cedar Mills The Cedar Key Cemetery Memberships Account Orders My Account Sign out Sign In Orders My Account African American History Africans During Spanish and British Rule: 1513 - 1821 Peoples of African descent have been an integral part of Florida’s history since the first European explorers visited the area. Free Africans were crew members – often vital ones – who assisted early explorers like Pedro Menéndez de Avilés and Hernando de Soto.Peoples of African descent have been a part of Florida’s history since the initial discovery of the lands referred to by the Spanish as La Florida. Free Africans were among the crews of the first European explorers to reach this area. Two individuals of African descent, Juan Gárrido and Juan González de Léon, accompanied Juan Ponce de Léon when he “discovered” the North American continent in 1513. The expeditions of other explorers such as Lucas Vázquez de Ayllón, Pánfilo de Narváez, and Hernando de Soto included unknown numbers of Africans, both free and enslaved (Landers 2000:19; Rivers 2000:3; Landers 2013:180-181). While many of these expeditions proved disastrous for their leaders, numerous persons of African descent escaped during the first half of the 1500s, learned native customs and languages, and remained in Florida for years (Rivers 2000:1-2; Landers 2000, 2013). Many of those Africans who stayed in Florida would meet later explorers. In some cases, they even returned to living among the Spanish. In several locations, these early populations of free Africans would eventually give rise to self-governing groups such as the free Black militias that formed in the late-1600s. Service in these militias allowed free Blacks to acquire titles, own property, and earn military privileges (Landers 2013:183). Throughout the late- 1600s and early 1700s enslaved Africans from nearby locations continued to seek sanctuary in St. Augustine, which would grant it if one converted to Catholicism. A large number of runaway slaves were granted sanctuary and eventually received a town unto their own in 1738. Located just two miles north of St. Augustine (Figure 2.3), this new town was named Gracia Real de Santa Teresa de Mosé. The town was abandoned for more than a decade following the attack by British forces from Georgia in 1740. Eventually, the town was fortified and reoccupied until Spain lost Florida to the British in 1763 (Landers 1995; Deagan and MacMahon1995), which coincided with the end of the First Spanish Period in Florida (1513-1763).Although slavery remained a feature of the First Spanish Period, people of African descent had many paths towards freedom, including purchasing their way out of slavery. Within several years, Africans became the largest segment of Florida’s population (Schafer 1995; Landers 2013).The beginning of the American Revolution (1775) exacerbated this trend and Loyalists flooded into East Florida (Figure 2.4). Under British rule White Floridians restricted the movement of both enslaved and free Blacks, adopted Slave Codes similar to those in South Carolina, and increasingly subjected slaves to inhumane treatment (Landers 2013:186-187). After the Revolution, British Loyalists fled Florida and the Second Spanish Period commenced(1783-1821). Enslaved Blacks once again sought sanctuary in Florida, and the  population of free Blacks continued to grow. They worked for the Spanish government as laborers, guards, and skilled craftsmen. While laws in the newly formed United States of America forbade Africans from competing with Whites, no such laws existed in Spanish Florida. Free Blacks could own land and operate businesses of their choosing. Lizzie Hogan, circa 1930, Deaconess of African American Baptist Church at 757 6th Street, Cedar Key, History of Cedar Key’s African American Community THE CEDAR KEY HISTORICAL SOCIETY DHI report Although their contributions have largely been forgotten, African Americans are central to the history of Cedar Key. The destruction of Prospect Bluff in 1816 triggered a migration of maroons from the panhandle to South Florida. This migration passed through areas of Levy County where members may have settled prior to statehood. African Americans were also present on Atsena Otie and across the Cedar Keys area from the 1840s onward. This includes enslaved and free workers. According to the 1860 Slave Census, Levy County was home to 435 enslaved persons and 52 slave owners. Most enslaved African Americans lived on small farms. The average owner had around 5 enslaved persons working on their property. Some had as few as one, while a handful had dozens. During the Civil War Union troops in the vicinity of Cedar Key included members of the U.S. Colored Troops Infantry. The end of the Civil War brought an end to the US blockade. Cedar Key experienced rapid economic growth during Reconstruction (1865-1877) when African Americans became a political force in town. This included the election of town council members Arthur Simmons and John G. Williams in 1873. A year later voters elected Williams as mayor, F. E. Miller as the town marshal, and three Black aldermen (William Canty, Peter Hart, and Jeff McQueen). Ultimately, these wins were short lived (Fishburn 1997). In the 1877 election there were no African Americans elected to office, although a year later Charles Benson and Bully Wiley were both elected as Black members 32 of the town council.Cedar Key’s African American community continued into the 20th century. An African American school was built with funds from the city. The Mount Pisgah Baptist Church, Bethlehem Methodist Episcopal (ME) Church, and African Methodist Episcopal (AME) church all served the community in the early 1900s. Of course, segregation remained an aspect of life, and African Americans were even buried in a section of the town cemetery that was initially separate from White burials. African Americans held various jobs in Cedar Key during the 20th century. This includes working for the Fiber Factory, in public works, and at various privately owned companies. African Americans lived in a portion of Cedar Key referred to as The Hill during this time. Residents of The Hill included the Island Hotel’s African American cook Catherine “Big Buster” Johnson and her husband Ivory Johnson, who supplied fish and oysters to many downtown hotels. Cedar Key’s African American community dwindled by the late 1900s. Earlier accounts incorrectly state the town’s Black community left following the 1923 Rosewood riot. Census records (Figure 2.12), city directories, property deeds, and death certificates all document a Black presence in the town until at least the 1940s. African Americans continued to vote in Cedar Key during this time as well. While prejudice may have played a role, hard economic times and other aspects likely played a central part in driving rural African Americans to relocate to urban centers across Florida. Today, although it remains a mostly White town, Cedar Key and other rural areas across the state are home to growing minority populations. Learn More This is a content preview space you can use to get your audience interested in what you have to say so they can’t wait to learn and read more. Pull out the most interesting detail that appears on the page and write it here. Find out more AFRICAN AMERICAN HISTORY IN THE CEDAR KEYS EXHIBIT UNVEILING THIS VIDEO IS FROM THE EXHIBIT UNVEILING OF THE AFRICAN AMERICAN HISTORY IN THE CEDAR KEYS AT THE HISTORICAL SOCIETY MUSEUM. This site copyright @2022 The Cedar Key Historical Society Inc. Website Developed and Maintained By -Anna White Hodges- Executive Director Home About us & the Board Museum Buildings Archives & Garden Membership/Volunteer Society Legal Policies Members Only Blog & Events Oral Histories History Behind Exhibits Cedar Mills The Cedar Key Cemetery Memberships Powered by This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. Accept"
    },
    {
      "url": "https://cedarbliss.ca/contact-us/",
      "text": "Contact Us | Cedar Bliss Event Venue in Lanark Highlands Skip to Content Home Tour The Cedar Grove The Buildings The Barn The Gardens Split Rail Fences The Forest The Meadow Contact Us Member Directory Cedar Bliss Cedar Bliss in Lanark Highlands Cedar Bliss Cedar Bliss in Lanark Highlands Looking for Something? Search anything and hit enter. Home Tour The Cedar Grove The Buildings The Barn The Gardens Split Rail Fences The Forest The Meadow Contact Us Member Directory Home <span class=\"hpt_headertitle\">Contact Us</span> Contact Us You can also reach us by using the form below. Your Name (required) Your Email (required) Subject Your Message Photo Credits: Alix Heise, Connor Heise, Irene Hofmann, Doug Batten. Get in touch with us now to book your event or tour Cedar Bliss evolves with the seasons and is equally beautiful throughout the year. Tim and Cathy welcome you to their property and will help you plan the perfect event. Whether you are celebrating a Wedding, Birthday, Anniversary, Family Reunion or just want to get family or friends together to enjoy a great day – Cedar Bliss is a great gathering place. Give us a call at 613-259-5074 or email us at info@cedarbliss.ca We would love to meet you and make your event one to remember. © Copyright 2025 Cedar Bliss . All Rights Reserved. iM Inc. | Developed By iMedia Northside Inc . Powered by WordPress . Looking for Something? Search anything and hit enter. We use cookies on our website to give you the most relevant experience by remembering your preferences and repeat visits. By clicking “Accept All”, you consent to the use of ALL the cookies. However, you may visit \"Cookie Settings\" to provide a controlled consent. Cookie Settings Accept All Manage consent Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website, anonymously. Cookie Duration Description cookielawinfo-checkbox-analytics 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\". cookielawinfo-checkbox-functional 11 months The cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Functional\". cookielawinfo-checkbox-necessary 11 months This cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\". cookielawinfo-checkbox-others 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other. cookielawinfo-checkbox-performance 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Performance\". viewed_cookie_policy 11 months The cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Functional Functional Functional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features. Performance Performance Performance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. Advertisement Advertisement Advertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads. Others Others Other uncategorized cookies are those that are being analyzed and have not been classified into a category as yet. SAVE & ACCEPT"
    }
  ]
}