{
  "query": "celerycitycraft.com contact",
  "fuentes": [
    {
      "url": "https://www.yelp.com/biz/celery-city-craft-sanford",
      "email": "40x40_claim_your_page_v2@2x.yji-bd2968af3654281a8794.png"
    }
  ],
  "mails": [
    "info@celeryfarms.com",
    "pressinquiries@medium.com",
    "40x40_claim_your_page_v2@2x.yji-bd2968af3654281a8794.png"
  ],
  "nombre_sitio": "celerycitycraft.com",
  "origen_extraccion": "Busqueda externa paso: contact",
  "textos_fuente": [
    {
      "url": "https://www.yelp.com/biz/celery-city-craft-sanford",
      "text": "CELERY CITY CRAFT - Updated September 2025 - 318 Photos & 217 Reviews - 114 S Palmetto Ave, Sanford, Florida - Bars - Restaurant Reviews - Phone Number - Yelp Back to Search Yelp Celery City Craft 4.3 (217 reviews) Unclaimed $ Bars , Sandwiches Open 11:00 AM - 2:00 AM (Next day) See hours See all 331 photos Loading... Loading... Loading... Loading... Loading... Loading... Loading... Loading... Loading... Loading... Loading... Loading... Loading... Loading... Loading... Loading... Loading... Loading... Loading... Write a review Add photos/videos Share Save Do you recommend this business? Yes No Maybe Menu Popular Dishes Avocado Tower 5 Photos 9 Reviews Cigar City Apple Pie 2 Photos 3 Reviews Funky Buddha Paloma 1 Photo 3 Reviews What's the vibe? See all 70 Inside 70 photos See all 64 Outside 64 photos See all 318 All photos 318 photos Live music Casual Moderate noise Outdoor seating Good for groups People also searched for Breweries Lunch Sushi Dinner Happy Hour Dog Friendly Restaurants Location & Hours Suggest an edit 114 S Palmetto Ave Sanford, FL 32771 Get directions Mon 11:00 AM - 12:00 AM (Next day) Tue 11:00 AM - 12:00 AM (Next day) Wed 11:00 AM - 12:00 AM (Next day) Thu 11:00 AM - 2:00 AM (Next day) Fri 11:00 AM - 2:00 AM (Next day) Open now Sat 11:00 AM - 2:00 AM (Next day) Sun 11:00 AM - 12:00 AM (Next day) Amenities and More Health Score Met Inspection Standards Powered by Health Department Intelligence Offers take-out Takes reservations Offers delivery 22 More Attributes Ask the Community Ask a question Q: Out door music? A: Yes and they do have live music. Suzie S. See question details Q: Is this place dog friendly? A: Whitney beat me to it.  Lots of dogs, in the big outdoor seating area (Probably the biggest outdoor area in Sanford) Rob S. 2 people found this helpful See 2 more answers Recommended Reviews Loading... Loading... Loading... Business website celerycitycraft.com Phone number (407) 915-5541 Get Directions 114 S Palmetto Ave Sanford, FL 32771 Suggest an edit Verify this business for free People searched for Bars 1,753 times last month within 10 miles of this business. Verify this business Explore benefits About About Yelp Careers Press Investor Relations Trust & Safety Content Guidelines Accessibility Statement Terms of Service Privacy Policy Ad Choices Your Privacy Choices Discover Yelp Project Cost Guides Collections Talk Events Yelp Blog Support Yelp Mobile Developers RSS Yelp for Business Yelp for Business Business Owner Login Claim your Business Page Advertise on Yelp Yelp for Restaurant Owners Yelp Guest Manager Business Resources Business Support Marketing & Advertising Agencies Yelp Data for B2B Yelp Data for B2C Agentic AI Languages English Cities Explore a City Austin Baltimore Charlotte Chicago Colorado Springs Columbus Dallas Denver Detroit El Paso Fort Worth Houston Indianapolis Jacksonville Las Vegas Los Angeles Miami Nashville New York Oklahoma City Philadelphia Phoenix Portland Sacramento San Antonio San Diego San Francisco San Jose Seattle Washington About Blog Support Terms Privacy Policy Your Privacy Choices Yelp for Business Yelp for Restaurant Owners Marketing & Advertising Agencies Yelp Data for B2B Copyright © 2004–2025 Yelp Inc. Yelp, Elite Squad, , and related marks are registered trademarks of Yelp."
    }
  ]
}