{
  "fuentes": [
    {
      "url": "https://citruscitycraft.com/",
      "email": "info@citruscitycraft.com"
    },
    {
      "url": "https://roonieyt.medium.com/how-to-build-the-perfect-staff-team-f3700b44b57a",
      "email": "pressinquiries@medium.com"
    }
  ],
  "mails": [
    "info@citruscitycraft.com",
    "pressinquiries@medium.com"
  ],
  "nombre_sitio": "celerycitycraft.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://citruscitycraft.com/",
      "text": "Citrus City Craft | Lake Mary Craft Beer & Cocktails Something Fresh is Brewing... Our Site’s Getting a Makeover but We’re Still Pouring! Our website is getting a makeover, but Citrus City Craft is open and ready for good times! Stop by for craft beers, cocktails, live music, and a backyard vibe that feels like home. Bring your friends, family, and even your furry companions—there’s always a reason to hang out. Follow us for updates and sneak peeks, and come enjoy the real thing in person today! hours Sunday-Tuesday 11 AM - 12 AM Wednesday-Saturday 11 AM - 2 AM Instagram Facebook Google Socials address 101 N Country Club Rd #101, Lake Mary, FL 32746 Phone number (407) 732-4039 Email info@citruscitycraft.com"
    },
    {
      "url": "https://roonieyt.medium.com/how-to-build-the-perfect-staff-team-f3700b44b57a",
      "text": "How To Build The Perfect Staff Team | by Roonie | Medium Sitemap Open in app Sign up Sign in Medium Logo Write Sign up Sign in How To Build The Perfect Staff Team Roonie 4 min read · Aug 1, 2022 -- Listen Share Article by Suyash Raj in Netcord. Press enter or click to view image in full size Discord is growing every second. It’s no surprise, then, that Discord servers are popping up for all sorts of communities. But what does it take to build a great Discord server? A perfect staff. In this article, we’ll share some tips on how to build the perfect staff team for your Discord community. As the saying goes, “There’s no I in team.” And that’s especially true for Discord communities. A Discord community is only as strong as the staff team that moderates it. You need a perfect staff team behind you who are trustworthy and can manage the server even when you are offline. Have Active Staff Members If you’re looking for a way to get your staff members more active in Discord, there are a few things you can do. First, make sure you have a channel set up specifically for announcements and/or questions. This will give staff members a place to go to get information and to ask questions. You can also set up a bot to help with tasks such as moderating chats and keeping track of conversations. Another great way to get staff members active in Discord is to host events. This can be anything from a simple Q&A session to a more complex game night. Whatever you do, make sure it’s something that will interest your staff members and that will get them talking. Finally, remember to be active yourself! As the owner or administrator of a Discord server, you set the tone for the whole community. Have a staff structure This contains the staff positions that candidates can apply for. You should at least make a Helper, Moderator, Admin and a Manager for your community server. These are the staff positions that you would usually see in an everyday server. Some servers may have other roles that still contain to these positions/roles. Press enter or click to view image in full size It’s important to establish a system, especially when making big decisions. Often, there are decisions that need to be done right at the very moment. Make a Guide Channel Your staff won’t last a day if you don’t make a beginner’s guide to moderating your community. You can make a separate channel or even a Trello Board for your moderators to get themselves oriented with the working of the server. This may include : What punishments to give for a violation? What are the basic commands they would need Make a Application system You can’t just go on selecting random members and promoting them to Admin or Moderator. You need to make a staff application on any platform (like Google Forms) and analyze the answers and choose accordingly. You can have more than 2 rounds for selection of staff Give them Freedom It’s very important to give every moderator freedom so they don’t have to ask every time before they can take action, but it’s also important to hear out as many opinions on any major server changes as possible, if time allows it. Tips if you are a Moderator You need to maintain a professional image- this includes things like choosing your profile picture, status, nickname, or any other highly visible identifiers wisely. DO NOT mess around with the server settings, or create/delete channels, or do anything like that without owner’s permission. Make sure you are actively checking the staff announcements channel for important news and updates for staff members. Make everyone talk in the place they are supposed to. For example, if people are talking inside media, you have to let them know to chat in the proper chat channel. Let people know to NOT flood the chat with gifs/images and such in the chat channel. It gets really annoying, and it won’t look good. You will often face the situation of members not agreeing to actions taken against them. In those often heated conversations with an irate member, you need to keep self control by staying calm and resolving the issue. Resources Discord Moderator Academy (by Discord) : https://discord.com/moderation Trello Discord Server Guide (by Xynox): https://trello.com/b/KpOyYPjn/discord-server-rules-by-xynox NaviKings’s Tools and Templates : https://drive.google.com/drive/folders/1yiyiDPEckcwG9NgpCFPFSroEzgLfASQC?usp=sharing That’s all for today, hope you enjoyed today’s article. Make sure to join our official Discord server to discuss further on this topic or suggest new articles! Originally published at https://netcord.site on August 1, 2022. Discord Moderation Staff Community Gaming -- -- Written by Roonie 173 followers · 7 following Your local Discord enthusiast | Founder and CEO of NetcordHQ No responses yet Help Status About Careers Press Blog Privacy Rules Terms Text to speech"
    }
  ]
}