{
  "fuentes": [
    {
      "url": "https://www.naplesnews.com/story/news/government/2019/08/01/celebration-park-parking-lot-draws-concerns-east-naples-neighborhood/1794681001/",
      "email": "patrick.riley@naplesnews.com"
    },
    {
      "url": "https://celebrationparknaples.com/contact/",
      "email": "info@celebrationparknaples.com"
    },
    {
      "url": "https://celebrationparknaples.com/private-parties-party-event-venue-rental-naples-florida/",
      "email": "info@celebrationparknaples.com"
    }
  ],
  "mails": [
    "info@celebrationparknaples.com",
    "patrick.riley@naplesnews.com"
  ],
  "nombre_sitio": "celebrationparknaples.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.naplesnews.com/story/news/government/2019/08/01/celebration-park-parking-lot-draws-concerns-east-naples-neighborhood/1794681001/",
      "text": "Celebration Park parking lot draws concerns from East Naples neighborhood News Sports Real Estate Restaurants Opinion Advertise Obituaries eNewspaper Legals GOVERNMENT Without proper permits, Celebration Park parking lot draws concerns from some neighbors Patrick Riley Naples When Ken Young left his Becca Avenue home in East Naples for a trip to Wisconsin in May 2018, his property bordered a residential home, typical for the quiet neighborhood off Bayshore Drive. Young, a disabled Vietnam veteran, returned in November to find the home next to him had been replaced by a gravel lot. Eight feet from his bedroom now sat a parking lot that frequently filled up with cars from patrons of a new food truck park across the street, known as Celebration Park. “It was a conventional residential neighborhood,” said Young, 72, who has lived at the home on and off for six years and had some relatives staying there as caregivers. But with the widely popular food truck park opening in the fall of last year, noise, congestion and traffic moved into Young’s neighborhood. “The first month, the opening was terrible,” said Young, a retired land-use planning engineer in Brown County, Wisconsin. Previous coverage: Food truck mecca Celebration Park draws hundreds to Bayshore in East Naples The food truck park — launched by local entrepreneur Rebecca Maddox, who also owns Three60 Market, a waterfront restaurant and wine store close by — and its parking situation soon caught the eye of county code enforcement after Young lodged a complaint with Collier officials. The food truck park had become so popular that it needed the “overflow” parking, said Jamie French, the county’s deputy department head for the growth management department. The park currently has 12 on-site parking spaces, according to county officials. And although the owners of Celebration Park had agreements with other businesses to allow parking for food truck patrons, including at Three60 Market, “people started parking in the empty lot,” French said. The problem? The property owners of the empty lot were using it for parking without having the proper permits in place. “They jumped the gun, so to speak,” French said. Code enforcement staff issued a notice of violation in December, noting “unpermitted construction work,” including “lot clearing and the introduction of gravel fill” on the property at 2831 Becca Ave., which is owned by Bayshore Redevelopment GP LLC. The limited liability company lists Maddox as its manager and registered agent, state business records show. The home that once stood on the now-empty lot was demolished with the proper approvals, French said. When code enforcement staff first visited the site Dec. 17, the house was gone and the current parking lot was already built and in use, county officials said. “They were essentially in violation the day they started to build the permanent commercial parking lot without county approvals,” county spokeswoman Connie Deane said in an email. The property owners can seek the use of a parking lot based on the county’s rules for the specific area, but they have to go through the application process for a parking exemption, French said. County documents show representatives for the property owners submitted an application, dated Oct. 22, for a parking exemption for the lot at 2831 Becca Ave. The county’s online records show the parking exemption request went back and forth between county staff and the applicant a few times, with county officials asking for corrections and the property owners resubmitting the application three times before it was accepted in July. The matter is now headed before the county’s hearing examiner, who is scheduled to hear the petition for a parking exemption Aug. 22. Although the property is in violation at the moment, French said the issue is on a path to compliance. The latest design meets the county’s criteria to schedule it before the hearing examiner and includes plans for a decorative wall that would channel pedestrians toward a crosswalk to safely cross Becca Avenue to get to and from the food truck park, he said. “Our goal really is to get the community back into compliance ...,” French said. “We want a long-range solution.” The proposed parking lot would include 76 parking spots, county officials said. If the use is not approved by the county’s hearing examiner, the property will have to be restored to a vacant lot and can’t have the current material on it, French said. “That all has to be removed if it doesn’t get approved,” he said. Patrick Johnson, the general manager for Celebration Park, said the group is working hand in hand with the county. The permitting process “takes some time” and “we’ve had open communication with all the neighbors,” Johnson added. “We’re just trying to make Naples a better place,” he said. Photos: What JLB ate (and more) at Celebration Park in Naples The latest in restaurant inspections: Immokalee restaurant accrues 16 violations Maddox said she bought the lot across from her food truck park with the expectation of turning it into a parking lot. With no parking garage or on-street parking on Bayshore Drive, she said her intent was to provide some parking for the Bayshore area, “which is sorely needed.” She thought her food truck venture would be successful, but the instant popularity exceeded expectations. “The multiplier of the success was two and three times of what we thought it would be,” Maddox said. The first couple nights, people parked everywhere, and her focus was to prevent them from parking on the street or residents’ properties, she said. “People started parking in that lot,” Maddox said. Maddox said she wished the process had not taken so long, and said the plan is to have the permits by September to build the parking lot and have it in place by the end of the year. “If we made mistakes, I take full responsibility,” she said. Commissioner Penny Taylor, whose district includes the area off Bayshore Drive, said the food truck park’s popularity brought Collier to the East Naples area, causing a big shift from what the community there was used to. “No one dreamed it would be this busy,” she said. “This food truck park was a new animal for us.” The neighbors have been patient, Taylor said, but the situation needs to be moved toward a solution. “We need to really make this right,” she said. Related: Cousins Maine Lobster food truck coming to Celebration Park in Naples To some in the neighborhood, the current situation also presents a safety concern. Robert Messmer has lived on nearby Orange Street for 21 years. Food truck patrons cross the street diagonally to get from the parking lot to the venue, at times texting, intoxicated or not paying attention, he said. He worries about an accident with visitors crossing the street and cars turning in and out of Becca Avenue. “I’m surprised nobody’s been hit yet,” said Messmer, 75. If the parking lot situation becomes a life-safety issue, county officials said, it can be closed down while it is going through the approval process. “We maintain the ability to shut that lot down,” French said. More: 'Collier Has Talent' pairs performers, audiences for a $5,000 prize Messmer — who sits on the Bayshore Beautification Municipal Service Taxing Unit advisory committee but did not speak in his capacity as a committee member — said the county should not have allowed Maddox to continue to use the lot for parking without a permit. “The county could have stopped her use of the parking lot and they did not,” he said. Young said that he would want at least a buffer of trees or a berm to shield his property from the parking spaces, although he would prefer a nice residential lot. Since he remarried in February 2018, he has spent less time at the house, Young said. His relatives who lived at the Becca Avenue home moved to Golden Gate Estates because “they couldn’t take the noise,” he said. Young said he tried to sell the home but was unsuccessful. He wonders what the situation has done to his property value. So far, a solution to his problem has been elusive. “Everybody is sympathetic to me, but nothing happens,” Young said. Connect with the reporter at patrick.riley@naplesnews.com or on Twitter @PatJRiley . Things to do in Naples this summer: Here are 11 of our top spots NCH Healthcare System switching vendor for electronic medical records in early June Naples' boxcar benefactor follows a calling to Ukraine refugee camps In the Know: Too expensive? More evidence of housing slowing. Naples nightly hotel stays rise to $416 No more hotel? Developers seek tweaks to Metropolitan Naples as construction nears Staff Directory Corrections Careers Accessibility Support Sitemap Public Notices Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Businesses Advertise Your Business Promote your Event Licensing & Reprints Help Center Subscriber Guide Manage Account Give Feedback Subscribe Today Newsletters Mobile Apps Facebook X eNewspaper Archives Jobs Cars Real Estate Classifieds Education Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.naplesnews.com. All rights reserved."
    },
    {
      "url": "https://celebrationparknaples.com/contact/",
      "text": "Contact - Celebration Park - Naples, FL's premier food truck and waterfront bar with bock dock destination happy hour & live music | food menus | full liquor bar (239)316-7253 | 2880 Becca Ave, Naples, FL 34112 Home Menus Full Liquor Bar Authentic Greek Gigi Gourmet Gigi’s Chicken Coop OCN Rick’s Tacos All Food Truck Menus About Happenings Food Trucks Full Liquor Waterfront Bar Authentic Greek Gigi Gourmet Gigi’s Chicken Coop OCN Seafood Rick’s Tacos See All Food Trucks Private Parties Shop Contact Home About us Food Trucks Authentic Greek Gigi Gourmet Gigi’s Chicken Coop OCN Seafood Rick’s Tacos All Food Trucks Food Menus Full Liquor Waterfront Bar Happenings & Events Private Parties Contact contact have questions? Contact us Thank you for your interest in contacting Celebration Park – Naples, Florida’s premier waterfront full liquor bar and food truck park destination featuring live music 7 days a week. If you are interested in booking a private party, please fill out the form on Private Parties by clicking here . For any other inquiries submit a message in the form on this page or call/email us. Sun, Tues- Thurs: 12p - 9p Fri - Sat: 12p - 10p 2880 Becca Ave, Naples, FL 34112 +12393167253 info@celebrationparknaples.com Click Here to Email Us! Celebration Park Naples is a vibrant waterfront destination offering a unique blend of gourmet food trucks, a full liquor bar, and live music. Located in the Bayshore Arts District, it provides a relaxed, outdoor atmosphere perfect for enjoying delicious food, refreshing drinks, and scenic views. Whether you’re here for a casual meal, dancing to live performances, or hosting a special event, Celebration Park is your go-to spot for a fun and memorable experience in Naples, Florida. have a look around Home About us Contact Events Full Liquor Waterfront Bar Happenings Menus News & Updates Press Shop Now Our Food Trucks All Food Trucks Arepa Express Authentic Greek Dragonfly Gigi Gourmet Gigi’s Chicken Coop Molto Street Food OCN Seafood Rick’s Tacos © Celebration Park Naples Privacy Sitemap Terms Built with Love by Solve Design Create Come Happenings Call X"
    },
    {
      "url": "https://celebrationparknaples.com/private-parties-party-event-venue-rental-naples-florida/",
      "text": "Private Parties - Celebration Park - Naples, FL's premier food truck and waterfront bar with bock dock destination happy hour & live music | food menus | full liquor bar (239)316-7253 | 2880 Becca Ave, Naples, FL 34112 Home Menus Full Liquor Bar Authentic Greek Gigi Gourmet Gigi’s Chicken Coop OCN Rick’s Tacos All Food Truck Menus About Happenings Food Trucks Full Liquor Waterfront Bar Authentic Greek Gigi Gourmet Gigi’s Chicken Coop OCN Seafood Rick’s Tacos See All Food Trucks Private Parties Shop Contact Home About us Food Trucks Authentic Greek Gigi Gourmet Gigi’s Chicken Coop OCN Seafood Rick’s Tacos All Food Trucks Food Menus Full Liquor Waterfront Bar Happenings & Events Private Parties Contact private events host an event with us Celebrate With Us! the perfect venue for your next event What if your next event could have it all? A casual, fun environment, stunning waterfront views, live music, signature cocktails, and a variety of eclectic food truck choices to please any crowd. Whether it’s a corporate luncheon, an epic birthday, or an extravagant wedding celebration, **Celebration Park Naples** offers a unique outdoor venue for events that leave a lasting impression. From baby showers to celebrations of life, we cater to every occasion with space for groups from 25 to 500 guests. Inquire today to plan your perfect celebration! Contact Us Today craft your signature experience Our team is ready to help you plan the perfect event. Contact us at (239) 529-4346 or click the inquiry button below to get started! Event Types We Host Birthdays & Anniversaries Holiday Parties Corporate Outings & Parties Wedding Welcome Parties & Rehearsal Dinners Bachelor/Bachelorette Parties Baby & Bridal Showers Non-Profit Fundraisers Social Luncheons & Dinners Theme Events Family Reunions Celebrations of Life Graduations inquire now Celebrate With Us! the perfect venue for your next event Please email us with your: Full Name, Phone Number, Email and Company Event Date, Start and End Time, Type of Event, and # of guests and any additional information you think will be useful we will get back you within 24 to 48 business hours. Alternatively you can call us at 239-316-7253 Click Here to Email Us! Your Contact Details: Your Event Date: Event Start Time: Event End Time: Type of Event: Alumni Bachelor / Bachelorette Birthday Cocktail Reception Corporate Lunch Engagement Fundraiser Graduation Holiday Meeting / Presentation Photo / Film Shoot Private Dinner Rehearsal Dinner Shower Sporting Event Wedding Other Number of People: Additional Information: latest news & updates event tips, specials, and what’s happening Stay updated with the latest from **Celebration Park Naples**! From new event packages to seasonal specials and exciting happenings, there’s always something fresh to elevate your private event. Whether you’re planning a corporate outing or a family celebration, we’re constantly introducing new ways to enhance your experience. Follow our updates to discover event ideas, drink specials, and upcoming celebrations. Make your next event unforgettable by staying in the know! Yoga With a View: Yoga Lab Pop-Up at Celebration Park Thank you to everyone who came out for our pop up Yoga Event by Yoga Lab New Website Launch! See All happenings See All News & Updates Explore More at Celebration Park Naples A world of flavors for your private event When you book your event with us, your private event is elevated by a variety of gourmet food trucks offering flavors from around the world. From fresh seafood to mouthwatering street food, we have something to please every guest. Pair the culinary experience with handcrafted cocktails from our full liquor bar and enjoy the vibrant atmosphere by the waterfront. Every event promises a unique and memorable experience. Check out our lineup of food trucks below and start planning your event today! keep up with us Facebook Instagram Youtube Map-marker-alt [instagram-feed-1] Celebration Park Naples is a vibrant waterfront destination offering a unique blend of gourmet food trucks, a full liquor bar, and live music. Located in the Bayshore Arts District, it provides a relaxed, outdoor atmosphere perfect for enjoying delicious food, refreshing drinks, and scenic views. Whether you’re here for a casual meal, dancing to live performances, or hosting a special event, Celebration Park is your go-to spot for a fun and memorable experience in Naples, Florida. have a look around Home About us Contact Events Full Liquor Waterfront Bar Happenings Menus News & Updates Press Shop Now Our Food Trucks All Food Trucks Arepa Express Authentic Greek Dragonfly Gigi Gourmet Gigi’s Chicken Coop Molto Street Food OCN Seafood Rick’s Tacos © Celebration Park Naples Privacy Sitemap Terms Built with Love by Solve Design Create Come Happenings Call X"
    }
  ]
}