{
  "fuentes": [
    {
      "url": "https://www.celtic.nl/contact-8",
      "email": "ethiopia@celtic.nl"
    },
    {
      "url": "https://www.celtic.nl/contact-8",
      "email": "ghana@celtic.nl"
    },
    {
      "url": "https://www.celtic.nl/contact-8",
      "email": "info@celtic.nl"
    },
    {
      "url": "https://www.celtic.nl/contact-8",
      "email": "kenya@celtic.nl"
    },
    {
      "url": "https://www.celtic.nl/contact-8",
      "email": "sales@celtic.nl"
    },
    {
      "url": "https://www.celticfc.com/help-and-faqs/contact-us/",
      "email": "20matchdayhospitality@celticfc.co.uk"
    },
    {
      "url": "https://www.celticfc.com/help-and-faqs/contact-us/",
      "email": "accessibleseating@celticfc.co.uk"
    },
    {
      "url": "https://www.celticfc.com/help-and-faqs/contact-us/",
      "email": "alexis.dobbin@celticfc.co.uk"
    },
    {
      "url": "https://www.celticfc.com/help-and-faqs/contact-us/",
      "email": "brandprotection@celticfc.co.uk"
    },
    {
      "url": "https://www.celticfc.com/help-and-faqs/contact-us/",
      "email": "celticview@celticfc.co.uk"
    },
    {
      "url": "https://www.celticfc.com/help-and-faqs/contact-us/",
      "email": "cfcfoundation@celticfc.co.uk"
    },
    {
      "url": "https://www.celticfc.com/help-and-faqs/contact-us/",
      "email": "courses@celticfc.co.uk"
    },
    {
      "url": "https://www.celticfc.com/help-and-faqs/contact-us/",
      "email": "dataprotection@celticfc.co.uk"
    },
    {
      "url": "https://www.celticfc.com/help-and-faqs/contact-us/",
      "email": "events@celticfc.co.uk"
    },
    {
      "url": "https://www.celticfc.com/help-and-faqs/contact-us/",
      "email": "hr@celticfc.co.uk"
    },
    {
      "url": "https://www.celticfc.com/help-and-faqs/contact-us/",
      "email": "jptaylor@celticfc.co.uk"
    },
    {
      "url": "https://www.celticfc.com/help-and-faqs/contact-us/",
      "email": "pools@celticfc.co.uk"
    },
    {
      "url": "https://www.celticfc.com/help-and-faqs/contact-us/",
      "email": "safeguarding@celticfc.co.uk"
    },
    {
      "url": "https://www.celticfc.com/help-and-faqs/contact-us/",
      "email": "sign-for-celtic@2x.png"
    },
    {
      "url": "https://www.celticfc.com/help-and-faqs/contact-us/",
      "email": "stadiumtours@celticfc.co.uk"
    },
    {
      "url": "https://www.celticfc.com/help-and-faqs/contact-us/",
      "email": "store@celticfc.co.uk"
    },
    {
      "url": "https://www.celticfc.com/help-and-faqs/contact-us/",
      "email": "tickets@celticfc.co.uk"
    },
    {
      "url": "https://www.celticfc.com/help-and-faqs/contact-us/",
      "email": "travel.enquiries@celticfc.co.uk"
    },
    {
      "url": "https://www.celticfc.com/help-and-faqs/contact-us/",
      "email": "u003eaccessibleseating@celticfc.co.uk"
    },
    {
      "url": "https://www.celticfc.com/help-and-faqs/contact-us/",
      "email": "u003ealexis.dobbin@celticfc.co.uk"
    },
    {
      "url": "https://www.celticfc.com/help-and-faqs/contact-us/",
      "email": "u003ebrandprotection@celticfc.co.uk"
    },
    {
      "url": "https://www.celticfc.com/help-and-faqs/contact-us/",
      "email": "u003ecelticview@celticfc.co.uk"
    },
    {
      "url": "https://www.celticfc.com/help-and-faqs/contact-us/",
      "email": "u003ecfcfoundation@celticfc.co.uk"
    },
    {
      "url": "https://www.celticfc.com/help-and-faqs/contact-us/",
      "email": "u003ecourses@celticfc.co.uk"
    },
    {
      "url": "https://www.celticfc.com/help-and-faqs/contact-us/",
      "email": "u003edataprotection@celticfc.co.uk"
    },
    {
      "url": "https://www.celticfc.com/help-and-faqs/contact-us/",
      "email": "u003eevents@celticfc.co.uk"
    },
    {
      "url": "https://www.celticfc.com/help-and-faqs/contact-us/",
      "email": "u003ehr@celticfc.co.uk"
    },
    {
      "url": "https://www.celticfc.com/help-and-faqs/contact-us/",
      "email": "u003ejptaylor@celticfc.co.uk"
    },
    {
      "url": "https://www.celticfc.com/help-and-faqs/contact-us/",
      "email": "u003ematchdayhospitality@celticfc.co.uk"
    },
    {
      "url": "https://www.celticfc.com/help-and-faqs/contact-us/",
      "email": "u003epools@celticfc.co.uk"
    },
    {
      "url": "https://www.celticfc.com/help-and-faqs/contact-us/",
      "email": "u003esafeguarding@celticfc.co.uk"
    },
    {
      "url": "https://www.celticfc.com/help-and-faqs/contact-us/",
      "email": "u003estadiumtours@celticfc.co.uk"
    },
    {
      "url": "https://www.celticfc.com/help-and-faqs/contact-us/",
      "email": "u003estore@celticfc.co.uk"
    },
    {
      "url": "https://www.celticfc.com/help-and-faqs/contact-us/",
      "email": "u003etickets@celticfc.co.uk"
    },
    {
      "url": "https://www.celticfc.com/help-and-faqs/contact-us/",
      "email": "u003etravel.enquiries@celticfc.co.uk"
    },
    {
      "url": "https://www.celticfc.com/help-and-faqs/contact-us/",
      "email": "u003ewebhelp@celticfc.com"
    },
    {
      "url": "https://www.celticfc.com/help-and-faqs/contact-us/",
      "email": "u003eyhc@celticfc.co.uk"
    },
    {
      "url": "https://www.celticfc.com/help-and-faqs/contact-us/",
      "email": "webhelp@celticfc.com"
    },
    {
      "url": "https://www.celticfc.com/help-and-faqs/contact-us/",
      "email": "yhc@celticfc.co.uk"
    },
    {
      "url": "https://www.yellowbook.com/people/ray-molina/",
      "email": "icn_location@1x.svg"
    },
    {
      "url": "https://store.celticfc.com/pages/contact-us",
      "email": "store@celticfc.co.uk"
    },
    {
      "url": "https://theirishgifthouse.com/contents/en-us/contactus.html",
      "email": "andrew@theirishgifthouse.com"
    }
  ],
  "mails": [
    "20matchdayhospitality@celticfc.co.uk",
    "accessibleseating@celticfc.co.uk",
    "alexis.dobbin@celticfc.co.uk",
    "andrew@theirishgifthouse.com",
    "brandprotection@celticfc.co.uk",
    "celticview@celticfc.co.uk",
    "cfcfoundation@celticfc.co.uk",
    "courses@celticfc.co.uk",
    "dataprotection@celticfc.co.uk",
    "ethiopia@celtic.nl",
    "events@celticfc.co.uk",
    "ghana@celtic.nl",
    "hr@celticfc.co.uk",
    "icn_location@1x.svg",
    "info@celtic.nl",
    "jptaylor@celticfc.co.uk",
    "kenya@celtic.nl",
    "pools@celticfc.co.uk",
    "safeguarding@celticfc.co.uk",
    "sales@celtic.nl",
    "sign-for-celtic@2x.png",
    "stadiumtours@celticfc.co.uk",
    "store@celticfc.co.uk",
    "tickets@celticfc.co.uk",
    "travel.enquiries@celticfc.co.uk",
    "u003eaccessibleseating@celticfc.co.uk",
    "u003ealexis.dobbin@celticfc.co.uk",
    "u003ebrandprotection@celticfc.co.uk",
    "u003ecelticview@celticfc.co.uk",
    "u003ecfcfoundation@celticfc.co.uk",
    "u003ecourses@celticfc.co.uk",
    "u003edataprotection@celticfc.co.uk",
    "u003eevents@celticfc.co.uk",
    "u003ehr@celticfc.co.uk",
    "u003ejptaylor@celticfc.co.uk",
    "u003ematchdayhospitality@celticfc.co.uk",
    "u003epools@celticfc.co.uk",
    "u003esafeguarding@celticfc.co.uk",
    "u003estadiumtours@celticfc.co.uk",
    "u003estore@celticfc.co.uk",
    "u003etickets@celticfc.co.uk",
    "u003etravel.enquiries@celticfc.co.uk",
    "u003ewebhelp@celticfc.com",
    "u003eyhc@celticfc.co.uk",
    "webhelp@celticfc.com",
    "yhc@celticfc.co.uk"
  ],
  "nombre_sitio": "celticray.net",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.celtic.nl/contact-8",
      "text": "Contact | Celtic Cooling top of page Menu Close HOME ABOUT US TEAM BLOG Contact Contact Get in Touch Have a question, need a quote, or want to discuss your next project? Our team is ready to help. Reach out to us anytime—we're happy to assist with advice, service requests, or customized solutions. Simply fill out the contact form, and we’ll get back to you as soon as possible. Let's Chat General info@celtic.nl Sales sales@celtic.nl Social Media First Name Last Name Email Message Send Thanks for submitting! info@celtic.nl Bethlehemlaan 4, 2181 HN Hillegom , Netherlands ethiopia@celtic.nl Bole, friendship building 7th floor, office no 704/5 Addis Ababa, Ethiopia ​ ghana@celtic.nl 1st floor JK Owusu plaza Weija barrier kenya@celtic.nl Airport North Road Nairobi, Kenya bottom of page"
    },
    {
      "url": "https://www.celticfc.com/help-and-faqs/contact-us/",
      "text": "Contact Celtic FC | Help and FAQs Celticfc.com Tickets Store Celtic TV SIGN IN HERE Official Celtic FC Website EN News Tickets Hospitality Fixtures Teams Shop Visit Celtic Park SIGN IN HERE EN News Fixtures Teams Celtic TV Celtic FC Foundation æ¥æ¬èª íêµ­ì´ The celts are here Facebook X X Instagram YouTube Snapchat Tiktok Linkedin Weibo Tickets New eticketing sign-in process Kilmarnock v Celtic Tickets Digital Tickets at Celtic Park Accessible Tickets Forms, Guides & Policies Unauthorised Ticket/Season Ticket Resale Group Bookings First Time Fans Hospitality UEFA Europa League VIP Experience New eticketing sign-in process Single Match Hospitality Waiting List Celtic Park VIP Digital Tickets Lounges, Suites & Boxes Club 67 Number 7 Hospitality T&Cs Player Sponsorship Visit Celtic Park Celtic Park Events Celtic Park Sports Bar The Warm-Up Area at Celtic Park Matchday Information Stadium Tours Wedding Venue in Glasgow Getting To Celtic Park Venue & Function Room Hire Fans Latest Score Young Hoops Celtic FC Quiz Match Highlights Podcasts Supporter Liaison Officer Fans' Forum Supporter Charter Disabled Fans Disability Access Officer Invisible Disability Lanyard Form Sensory Room Accessible Matchdays at Celtic Park Accessible Fan Facilities Disabled Supporters FAQs Accessible Routes & Parking Celtic FC Women Meet the team Fixtures & Results Latest News About Celtic FC Women Supporting the Ghirls Official Partners Girls' Academy Celtic FC B Team Meet the B Team Fixtures & Results Latest News Supporting Celtic FC B Excelsior Stadium Celtic FC Academy Safeguarding Celtic FC Academy Celtic FC Boys' Academy Celtic FC Girls' Academy Boys' Academy Coaches Boys' Academy Success Stories Girls' Academy Coaches Girls' Academy Success Stories Safeguarding Shop Celtic Online Celtic Store Bricks and Paving Stones Big Screen Messages Celtic View Hub Celtic FC Travel Skills Schools Celtic Store Locations History History Timeline Legends Trophy Cabinet Results Archive Historical League Tables The Managers Celtic Park Stadium Club Celtic plc Investor Centre Club Partners Jobs At Celtic Safeguarding Social Mission Statement Social Charter Equality Policy Gender Pay Gap Reports Help & FAQs Frequently Asked Questions Contact Us Celtic FC Privacy Policy celticfc.com Cookie Policy Modern Slavery Statement 2023/24 Website Terms Of Use Website Feedback Celtic Pools Celtic Pools Weekly Lottery Paradise Windfall Celtic Pools Prize Draws Celtic FC Academy Update Celtic Pools FAQs How to Gamble Responsibly Celtic Soccer Academy Celtic Soccer Academy - Scotland International Partners Programme Celtic Soccer Academy Partners Book a course Meet the team Players Code of Conduct The celts are here Facebook X X Instagram YouTube Snapchat Tiktok Linkedin Weibo Search Search All results All Results Exact Matches Date Added Date Added Relevance Contact Us Club Email Club Telephone Number Existing Enquiries Fan Liaison In-Kind Donations Safeguarding Frequently Asked Questions A CLUB LIKE NO OTHER The celts are here Facebook X X Instagram YouTube Snapchat Tiktok Linkedin Weibo Facebook X X Instagram YouTube Snapchat Tiktok Linkedin Weibo Enter now for your chance to be a winner Our exclusive 'SIGN FOR CELTIC' competitions with the chance to win some fantastic prizes. SIGN FOR CELTIC Official Celtic FC Website Terms of Use Privacy Policy Modern Slavery Statement Cookie Policy Safeguarding Policy Accessibility Working at Celtic FC Investor Relations Celtic FC Pools Celtic FC Foundation Contact Us Quick Links Visit Celtic Park Celtic TV Shop Celtic View Celtic Soccer Academy News Fixtures Teams Tickets Hospitality Official Celtic FC Website Terms of Use Privacy Policy Modern Slavery Statement Cookie Policy Safeguarding Policy Working at Celtic FC Investor Relations Celtic FC Pools Celtic FC Foundation Contact Us Accessibility Quick Links Visit Celtic Park Celtic TV Shop Celtic View Celtic Soccer Academy News Fixtures Teams Tickets Hospitality Â©Celtic Football Club"
    },
    {
      "url": "https://www.yellowbook.com/people/ray-molina/",
      "text": "Ray Molina Address, Phone Number, Email Address - YellowBook Ray Molina in the US : 62 records available First Name Last Name City All States Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware DC Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington West Virginia Wisconsin Wyoming US AF Americas US AF Europe US AF Pacific Puerto Rico Guam Am. Samoa US Virgin Is. N. Mariana Is. Palau Marshall Is. Micronesia State We found public records for Ray Molina. Find Ray's age, current and past home addresses, mobile phone numbers, email addresses, and known relatives. Search records by state to find the best match for Ray Molina. Select a record to see additional public records data. Filter by age or state to narrow your search to find the person you are looking for. YellowBook > Search People > Ray Molina State Filter Arizona (8) Arkansas (3) Colorado (3) Connecticut (1) Florida (5) Idaho (1) Kansas (1) Maryland (1) New Mexico (2) New York (1) North Carolina (1) We found public records for Ray Molina. Browse our public records directory to see Ray's age, current and past home addresses, mobile phone numbers, email addresses, and known relatives. Filter by age or state to narrow your search to find the person you are looking for. filters Filter By Age: Filter By Age All Ages 21-30 (1) 41-50 (5) 51-60 (3) 61-70 (1) 71-80 (2) 81+ (1) Filter By State: Filter By State All states Arizona (8) Arkansas (3) Colorado (3) Connecticut (1) Florida (5) Idaho (1) Kansas (1) Maryland (1) New Mexico (2) New York (1) North Carolina (1) Reset Filters Name Phone Number Address History Email Address Associated People Ray S Molina 44 years old Avondale, Arizona, 85392 602-532-XXXX, 909-889-XXXX 602-532-XXXX 909-889-XXXX Phoenix, AZ, Avondale, AZ Phoenix, AZ Avondale, AZ @aol.com, @socal.rr.com, @yahoo.com @aol.com @socal.rr.com @yahoo.com Alamar Molina, Roy Molina, Carmen Molina Alamar Molina Roy Molina Carmen Molina Ray Molina Pharr, Texas, 78577 956-787-XXXX, 956-702-XXXX 956-787-XXXX 956-702-XXXX Pharr, TX Pharr, TX Ana Molina, Ray Molina, Ana Anstee Ana Molina Ray Molina Ana Anstee Ray Molina 80 years old Los Angeles, California, 90076 818-956-XXXX 818-956-XXXX Laredo, TX, Los Angeles, CA Laredo, TX Los Angeles, CA Vicente Molina, Robert Molina, Vicente Molina Vicente Molina Robert Molina Vicente Molina Ray Molina West Hollywood, California, 90069 424-274-XXXX, 424-313-XXXX 424-274-XXXX 424-313-XXXX Denver, CO, West Hollywood, CA Denver, CO West Hollywood, CA Carlos Molina, Yolanda Acevedo, Yolanda Molina Carlos Molina Yolanda Acevedo Yolanda Molina Ray Molina Falls City, Texas, 78113 210-535-XXXX, 210-535-XXXX 210-535-XXXX 210-535-XXXX Falls City, TX Falls City, TX Ray Molina Rockport, Texas, 78382 Rockport, TX Rockport, TX R Malina R Malina Ray Molina 30 years old Huntington Park, California, 90255 323-589-XXXX 323-589-XXXX Huntington Park, CA Huntington Park, CA @yahoo.com @yahoo.com Maria Molina, Maria Molina Maria Molina Maria Molina Ray Molina 46 years old San Antonio, Texas, 78256 619-204-XXXX 619-204-XXXX Edcouch, TX, San Antonio, TX Edcouch, TX San Antonio, TX @comcast.net, @aol.com, @yahoo.com, @gmail.com @comcast.net @aol.com @yahoo.com @gmail.com Espirio Molina, Andrea Chamblin, Rene Molina Espirio Molina Andrea Chamblin Rene Molina Ray Molina 44 years old Oxnard, California, 93030 805-571-XXXX 805-571-XXXX Oxnard, CA Oxnard, CA @hotmail.com @hotmail.com Ray Molina Falls City, Texas, 78113 210-535-XXXX 210-535-XXXX Falls City, TX Falls City, TX Josefa Molina, Ray Molina, David Delafuentes Josefa Molina Ray Molina David Delafuentes Ray Molina 60 years old Poth, Texas, 78147 Ahoskie, NC, Falls City, TX Ahoskie, NC Falls City, TX @yahoo.com, @hotmail.com @yahoo.com @hotmail.com Joe Molina, Alberto Gonzales, Alberto Gonzales Joe Molina Alberto Gonzales Alberto Gonzales Ray Molina 93 years old Galveston, Texas, 77550 409-763-XXXX, 409-789-XXXX 409-763-XXXX 409-789-XXXX Las Vegas, NV, Galveston, TX Las Vegas, NV Galveston, TX @yahoo.com, @aol.com @yahoo.com @aol.com Bobby Molina, Andrea Chamblin, Ray Molina Bobby Molina Andrea Chamblin Ray Molina Ray Molina 55 years old Sacramento, California, 95833 707-449-XXXX 707-449-XXXX Sacramento, CA Sacramento, CA Ray Molina Calexico, California, 92231 730-200-XXXX 730-200-XXXX Calexico, CA Calexico, CA @prodigy.net, @juno.com, @aol.com, @angelfire.com @prodigy.net @juno.com @aol.com @angelfire.com Patricia German, Armando Molina, Angel German Patricia German Armando Molina Angel German Ray Molina 62 years old Guaynabo, Puerto Rico, 969 787-615-XXXX 787-615-XXXX Miami Beach, FL, Surfside, FL Miami Beach, FL Surfside, FL @hotmail.com @hotmail.com Olga Agosto, Rafael Molina, Esther Agosto Olga Agosto Rafael Molina Esther Agosto Ray A Molina Florida, Puerto Rico, 650 954-577-XXXX 954-577-XXXX Davie, FL, Florida, PR Davie, FL Florida, PR @att.net, @gte.net @att.net @gte.net Iris Molina, Virginia Molina, Iris Molina Iris Molina Virginia Molina Iris Molina Ray D Molina 45 years old Robstown, Texas, 78380 361-387-XXXX 361-387-XXXX Kingsville, TX, Robstown, TX Kingsville, TX Robstown, TX @yahoo.com @yahoo.com Adam Molina, Sagrario Molina, Rafael Molina Adam Molina Sagrario Molina Rafael Molina Ray G Molina 50 years old San Jose, California, 95133 Santa Clara, CA, San Jose, CA Santa Clara, CA San Jose, CA @dugoutrecords.com @dugoutrecords.com Gregory Molina, Efren Molina, Beatrice Molina Gregory Molina Efren Molina Beatrice Molina Ray M Molina 74 years old Huntington Beach, California, 92647 Temple City, CA, Duarte, CA Temple City, CA Duarte, CA Rachelle Molina, Ryan Molina, Robyn Molina Rachelle Molina Ryan Molina Robyn Molina Ray T Molina 56 years old Pomona, California, 91766 909-364-XXXX 909-364-XXXX Montclair, CA, Pomona, CA Montclair, CA Pomona, CA Laura Molina, Toni Molina, Jessica Molina Laura Molina Toni Molina Jessica Molina 1 2 3 Next Possible Match for Ray Molina Our top match for Ray Molina lives in Avondale, Arizona \n                    and may have previously resided in Avondale, Arizona. \n                    Ray is 44 years of age and may be related to Alamar Molina, Roy Molina and Carmen Molina. \n                    Run a full report on this result to get more details on Ray. Another possible match for Ray Molina is 80 years old \n                    and resides in Laredo, Texas. Ray may also have previously lived in Laredo, Texas \n                    and is associated to Vicente Molina, Robert Molina and Vicente Molina. \n                                        Run a full report to get access to phone numbers, emails, social profiles and much more. State Filter Arizona (8) Arkansas (3) Colorado (3) Connecticut (1) Florida (5) Idaho (1) Kansas (1) Maryland (1) New Mexico (2) New York (1) North Carolina (1) Back to Top Please Confirm To use our site, you must agree to our Privacy Policy and Terms & Conditions and that you WILL NOT use our site or the information provided for any purpose subject to FCRA compliance. Please review our \"Do's & Don'ts\" for more information governing permitted and prohibited uses. I Agree Continue About Us Corporate Hibu Blog Careers Contact Us Search Tools People Search Small Business Profiles Advertising Advertise With Us Hibu Inc Customer T&Cs Small Business Resources General Dental Pets Home Improvement Travel Legal Arts and Entertainment Automotive Business Computers and Technology Finance Food and Drink Health and Fitness Insurance Family and Home Recreation and Sports Education and Reference Fashion and Lifestyle Disclaimer: People search is provided by BeenVerified, Inc., our third party partner. BeenVerified does not provide private\n        investigator services or consumer reports, and is not a consumer reporting agency per the Fair Credit Reporting Act . You may not use this site or service or the information provided to make decisions\n        about employment, admission, consumer credit, insurance, tenant screening or any other purpose that would require\n        FCRA compliance. For more information governing permitted and prohibited uses, please review BeenVerified's “Do’s & Don’ts” and Terms & Conditions . Remove My Info. Conditions of Use Privacy Policy California Privacy Rights Accessibility © 2025 Hibu Inc. All rights reserved."
    },
    {
      "url": "https://store.celticfc.com/pages/contact-us",
      "text": "Contact Us\n – Official Celtic Store Skip to content CELTICFC.COM TICKETS STORE CELTIC TV SIGN IN/REGISTER Search Official Celtic Store Country/region Australia\n                                                        (AUD $) Austria\n                                                        (EUR €) Bahrain\n                                                        (GBP £) Belgium\n                                                        (EUR €) Bulgaria\n                                                        (BGN лв.) Canada\n                                                        (CAD $) China\n                                                        (CNY ¥) Croatia\n                                                        (EUR €) Cyprus\n                                                        (EUR €) Czechia\n                                                        (CZK Kč) Denmark\n                                                        (DKK kr.) Estonia\n                                                        (EUR €) Finland\n                                                        (EUR €) France\n                                                        (EUR €) Germany\n                                                        (EUR €) Gibraltar\n                                                        (GBP £) Greece\n                                                        (EUR €) Guernsey\n                                                        (GBP £) Hong Kong SAR\n                                                        (HKD $) Hungary\n                                                        (HUF Ft) Iceland\n                                                        (ISK kr) India\n                                                        (INR ₹) Indonesia\n                                                        (IDR Rp) Ireland\n                                                        (EUR €) Isle of Man\n                                                        (GBP £) Italy\n                                                        (EUR €) Japan\n                                                        (JPY ¥) Jersey\n                                                        (GBP £) Kuwait\n                                                        (GBP £) Latvia\n                                                        (EUR €) Lithuania\n                                                        (EUR €) Luxembourg\n                                                        (EUR €) Malaysia\n                                                        (MYR RM) Malta\n                                                        (EUR €) Mexico\n                                                        (GBP £) Monaco\n                                                        (EUR €) Netherlands\n                                                        (EUR €) New Zealand\n                                                        (NZD $) Nigeria\n                                                        (NGN ₦) Norway\n                                                        (GBP £) Philippines\n                                                        (PHP ₱) Poland\n                                                        (PLN zł) Portugal\n                                                        (EUR €) Qatar\n                                                        (QAR ر.ق) Romania\n                                                        (RON Lei) San Marino\n                                                        (EUR €) Saudi Arabia\n                                                        (SAR ر.س) Serbia\n                                                        (RSD РСД) Singapore\n                                                        (SGD $) Slovakia\n                                                        (EUR €) Slovenia\n                                                        (EUR €) South Korea\n                                                        (KRW ₩) Spain\n                                                        (EUR €) Sweden\n                                                        (SEK kr) Switzerland\n                                                        (CHF CHF) Taiwan\n                                                        (TWD $) Thailand\n                                                        (THB ฿) United Arab Emirates\n                                                        (AED د.إ) United Kingdom\n                                                        (GBP £) United States\n                                                        (USD $) Uruguay\n                                                        (UYU $U) Vatican City\n                                                        (EUR €) Update country/region Country/region GBP\n      £ | United Kingdom AUD\n              $ | Australia EUR\n              € | Austria GBP\n              £ | Bahrain EUR\n              € | Belgium BGN\n              лв. | Bulgaria CAD\n              $ | Canada CNY\n              ¥ | China EUR\n              € | Croatia EUR\n              € | Cyprus CZK\n              Kč | Czechia DKK\n              kr. | Denmark EUR\n              € | Estonia EUR\n              € | Finland EUR\n              € | France EUR\n              € | Germany GBP\n              £ | Gibraltar EUR\n              € | Greece GBP\n              £ | Guernsey HKD\n              $ | Hong Kong SAR HUF\n              Ft | Hungary ISK\n              kr | Iceland INR\n              ₹ | India IDR\n              Rp | Indonesia EUR\n              € | Ireland GBP\n              £ | Isle of Man EUR\n              € | Italy JPY\n              ¥ | Japan GBP\n              £ | Jersey GBP\n              £ | Kuwait EUR\n              € | Latvia EUR\n              € | Lithuania EUR\n              € | Luxembourg MYR\n              RM | Malaysia EUR\n              € | Malta GBP\n              £ | Mexico EUR\n              € | Monaco EUR\n              € | Netherlands NZD\n              $ | New Zealand NGN\n              ₦ | Nigeria GBP\n              £ | Norway PHP\n              ₱ | Philippines PLN\n              zł | Poland EUR\n              € | Portugal QAR\n              ر.ق | Qatar RON\n              Lei | Romania EUR\n              € | San Marino SAR\n              ر.س | Saudi Arabia RSD\n              РСД | Serbia SGD\n              $ | Singapore EUR\n              € | Slovakia EUR\n              € | Slovenia KRW\n              ₩ | South Korea EUR\n              € | Spain SEK\n              kr | Sweden CHF\n              CHF | Switzerland TWD\n              $ | Taiwan THB\n              ฿ | Thailand AED\n              د.إ | United Arab Emirates GBP\n              £ | United Kingdom USD\n              $ | United States UYU\n              $U | Uruguay EUR\n              € | Vatican City Language English 日本語 Deutsch Update language Language English English 日本語 Deutsch Kits HOME KIT AWAY KIT THIRD KIT GOALKEEPER KIT adidas COLLECTIONS PRIDE US PACK ORIGINS ORIGINALS LOVE UNITES GOLF ACCESSORIES FOOTWEAR ADIDAS TRAINING MEN'S TRAINING WOMEN'S TRAINING JUNIOR TRAINING ADIDAS SALE CLOTHING COLLECTIONS SUMMER ESSENTIALS CLOVER CROSS CREST RETRO 3 FOR £12 SOCKS NEW ERA MENS JACKETS HOODIES & SWEATSHIRTS POLOS T-SHIRTS NIGHTWEAR WOMENS HOODIES & SWEATSHIRTS T-SHIRTS NIGHTWEAR ACCESSORIES JUNIOR JACKETS HOODIES & SWEATSHIRTS T-SHIRTS NIGHTWEAR ACCESSORIES BABY & INFANT ACCESSORIES HATS SCARVES & GLOVES SOCKS & UNDERWEAR TIES SHOES SLIPPERS SOUVENIRS & GIFTS COLLECTIONS CHAMPIONS 2024/25 HENRIK LARSSON CELTIC FC WOMEN MATCH DAY ESSENTIALS LISBON PRIDE EXECUTIVE GIFTS WATCHES JEWELLERY WALLETS SIGNED MEMORABILIA GLENCAIRN GLASSWARE SOUVENIRS BADGES, KEYRINGS & MAGNETS WRISTBANDS CARDS & GIFT WRAP SWEETS & CHOCOLATE FLAGS & PENNANTS SOFT TOYS STATIONERY ENTERTAINMENT BOOKS CELTIC VIEW DVDS & CDS TOYS & GAMES MOBILE ACCESSORIES BIG SCREEN HOME LIVING BACK TO SCHOOL FAN CAVE BEDROOM PRINTS & POSTERS GLASSWARE & MUGS CELTIC X YETI EQUIPMENT FOOTBALL GOLF PETS TRAVEL LUGGAGE Sale MEN'S WOMEN'S JUNIOR ADIDAS NIGHTWEAR GIFTS ACCESSORIES NEW ARRIVALS Cart Kits Kits HOME KIT AWAY KIT THIRD KIT GOALKEEPER KIT adidas adidas COLLECTIONS COLLECTIONS PRIDE US PACK ORIGINS ORIGINALS LOVE UNITES GOLF ACCESSORIES FOOTWEAR ADIDAS TRAINING ADIDAS TRAINING MEN'S TRAINING WOMEN'S TRAINING JUNIOR TRAINING ADIDAS SALE CLOTHING CLOTHING COLLECTIONS COLLECTIONS SUMMER ESSENTIALS CLOVER CROSS CREST RETRO 3 FOR £12 SOCKS NEW ERA MENS MENS JACKETS HOODIES & SWEATSHIRTS POLOS T-SHIRTS NIGHTWEAR WOMENS WOMENS HOODIES & SWEATSHIRTS T-SHIRTS NIGHTWEAR ACCESSORIES JUNIOR JUNIOR JACKETS HOODIES & SWEATSHIRTS T-SHIRTS NIGHTWEAR ACCESSORIES BABY & INFANT ACCESSORIES ACCESSORIES HATS SCARVES & GLOVES SOCKS & UNDERWEAR TIES SHOES SLIPPERS SOUVENIRS & GIFTS SOUVENIRS & GIFTS COLLECTIONS COLLECTIONS CHAMPIONS 2024/25 HENRIK LARSSON CELTIC FC WOMEN MATCH DAY ESSENTIALS LISBON PRIDE EXECUTIVE GIFTS EXECUTIVE GIFTS WATCHES JEWELLERY WALLETS SIGNED MEMORABILIA GLENCAIRN GLASSWARE SOUVENIRS SOUVENIRS BADGES, KEYRINGS & MAGNETS WRISTBANDS CARDS & GIFT WRAP SWEETS & CHOCOLATE FLAGS & PENNANTS SOFT TOYS STATIONERY ENTERTAINMENT ENTERTAINMENT BOOKS CELTIC VIEW DVDS & CDS TOYS & GAMES MOBILE ACCESSORIES BIG SCREEN HOME HOME LIVING BACK TO SCHOOL FAN CAVE BEDROOM PRINTS & POSTERS GLASSWARE & MUGS CELTIC X YETI EQUIPMENT FOOTBALL GOLF PETS TRAVEL LUGGAGE Sale Sale MEN'S WOMEN'S JUNIOR ADIDAS NIGHTWEAR GIFTS ACCESSORIES NEW ARRIVALS Country/region Australia (AUD\n                                                            $) Austria (EUR\n                                                            €) Bahrain (GBP\n                                                            £) Belgium (EUR\n                                                            €) Bulgaria (BGN\n                                                            лв.) Canada (CAD\n                                                            $) China (CNY\n                                                            ¥) Croatia (EUR\n                                                            €) Cyprus (EUR\n                                                            €) Czechia (CZK\n                                                            Kč) Denmark (DKK\n                                                            kr.) Estonia (EUR\n                                                            €) Finland (EUR\n                                                            €) France (EUR\n                                                            €) Germany (EUR\n                                                            €) Gibraltar (GBP\n                                                            £) Greece (EUR\n                                                            €) Guernsey (GBP\n                                                            £) Hong Kong SAR (HKD\n                                                            $) Hungary (HUF\n                                                            Ft) Iceland (ISK\n                                                            kr) India (INR\n                                                            ₹) Indonesia (IDR\n                                                            Rp) Ireland (EUR\n                                                            €) Isle of Man (GBP\n                                                            £) Italy (EUR\n                                                            €) Japan (JPY\n                                                            ¥) Jersey (GBP\n                                                            £) Kuwait (GBP\n                                                            £) Latvia (EUR\n                                                            €) Lithuania (EUR\n                                                            €) Luxembourg (EUR\n                                                            €) Malaysia (MYR\n                                                            RM) Malta (EUR\n                                                            €) Mexico (GBP\n                                                            £) Monaco (EUR\n                                                            €) Netherlands (EUR\n                                                            €) New Zealand (NZD\n                                                            $) Nigeria (NGN\n                                                            ₦) Norway (GBP\n                                                            £) Philippines (PHP\n                                                            ₱) Poland (PLN\n                                                            zł) Portugal (EUR\n                                                            €) Qatar (QAR\n                                                            ر.ق) Romania (RON\n                                                            Lei) San Marino (EUR\n                                                            €) Saudi Arabia (SAR\n                                                            ر.س) Serbia (RSD\n                                                            РСД) Singapore (SGD\n                                                            $) Slovakia (EUR\n                                                            €) Slovenia (EUR\n                                                            €) South Korea (KRW\n                                                            ₩) Spain (EUR\n                                                            €) Sweden (SEK\n                                                            kr) Switzerland (CHF\n                                                            CHF) Taiwan (TWD\n                                                            $) Thailand (THB\n                                                            ฿) United Arab Emirates (AED\n                                                            د.إ) United Kingdom (GBP\n                                                            £) United States (USD\n                                                            $) Uruguay (UYU\n                                                            $U) Vatican City (EUR\n                                                            €) Update country/region Country/region GBP\n      £ | United Kingdom AUD\n              $ | Australia EUR\n              € | Austria GBP\n              £ | Bahrain EUR\n              € | Belgium BGN\n              лв. | Bulgaria CAD\n              $ | Canada CNY\n              ¥ | China EUR\n              € | Croatia EUR\n              € | Cyprus CZK\n              Kč | Czechia DKK\n              kr. | Denmark EUR\n              € | Estonia EUR\n              € | Finland EUR\n              € | France EUR\n              € | Germany GBP\n              £ | Gibraltar EUR\n              € | Greece GBP\n              £ | Guernsey HKD\n              $ | Hong Kong SAR HUF\n              Ft | Hungary ISK\n              kr | Iceland INR\n              ₹ | India IDR\n              Rp | Indonesia EUR\n              € | Ireland GBP\n              £ | Isle of Man EUR\n              € | Italy JPY\n              ¥ | Japan GBP\n              £ | Jersey GBP\n              £ | Kuwait EUR\n              € | Latvia EUR\n              € | Lithuania EUR\n              € | Luxembourg MYR\n              RM | Malaysia EUR\n              € | Malta GBP\n              £ | Mexico EUR\n              € | Monaco EUR\n              € | Netherlands NZD\n              $ | New Zealand NGN\n              ₦ | Nigeria GBP\n              £ | Norway PHP\n              ₱ | Philippines PLN\n              zł | Poland EUR\n              € | Portugal QAR\n              ر.ق | Qatar RON\n              Lei | Romania EUR\n              € | San Marino SAR\n              ر.س | Saudi Arabia RSD\n              РСД | Serbia SGD\n              $ | Singapore EUR\n              € | Slovakia EUR\n              € | Slovenia KRW\n              ₩ | South Korea EUR\n              € | Spain SEK\n              kr | Sweden CHF\n              CHF | Switzerland TWD\n              $ | Taiwan THB\n              ฿ | Thailand AED\n              د.إ | United Arab Emirates GBP\n              £ | United Kingdom USD\n              $ | United States UYU\n              $U | Uruguay EUR\n              € | Vatican City Language English 日本語 Deutsch Update language Language English English 日本語 Deutsch Twitter Facebook Instagram TikTok Snapchat YouTube Item added to your cart View cart CHECKOUT Continue shopping Contact Us You can get in touch with our Customer Service Team by using our Contact Form here or by email, X or phone using the details below; Email: store@celticfc.co.uk X: @celticfcshop Call: 0141 230 1967 (Option 2, then Option 1) Monday - Friday  10am - 4pm Contact form Name Email * Phone number Comment Send A CLUB LIKE NO OTHER Sponsors https://www.adidas.com https://www.dafabet.co.uk https://www.fleetalliance.co.uk/ Sponsors https://www.jdsports.co.uk https://www.williamhill.com/ https://www.skysports.com https://www.ea.com/en/games/ea-sports-fc/fc-26 QUICK LINKS Your Privacy Shipping Returns & Refunds Terms Cookie Preferences Contact Us adidas Big Screen Messages Visit Celtic Park Celtic Stores Celtic TV Celtic View Celtic Soccer Academy Young Hoops Club News Fixtures Teams Tickets Hospitality Facebook Instagram YouTube TikTok Twitter Snapchat © 2025, Celtic Football Club Choosing a selection results in a full page refresh. Opens in a new window."
    },
    {
      "url": "https://theirishgifthouse.com/contents/en-us/contactus.html",
      "text": "Contact Page for The Irish Gift House 0 Jewelry Sale, 15% Off - Free Shipping After $99.00 â Discounted Shipping After $49.00*. The Irish Gift House 0 Home > Contact Contact Contact Page for The Irish Gift House Contact Page for The Irish Gift House Please contact Andrew and Kerry at The Irish Gift House if we may be of any assistance. Thank you for visiting The Irish Gift House. If you have any problems or questions, please send us an email, andrew@theirishgifthouse.com , or call us, 480 731-9755. When you shop at The Irish Gift House, you are ordering from our store, not from a 3rd party. The Irish Gift House is located in Arizona and was established in 1994 by Kerry OâNeal-Costanzo and Andrew Costanzo, who continue to own and operate this family business. Regular Business Hours (Mountain Standard Time - No daylight savings time in Arizona) Monday through Friday - 10:00 to 6:00. Saturday hours are maybe yes, maybe no. We are often working early or late and if we are available, we will answer the phone. ! Sign Up for Email Updates For Email Newsletters you can trust. SITEMAP LINK The Irish Gift House is proud to feature Irish made jewelry from Solvar Jewelry . Â© The Irish Gift House, 1994-2025 Mobile mode To create online store ShopFactory eCommerce software was used. Home Desktop mode Mobile mode 0"
    }
  ]
}