{
  "fuentes": [
    {
      "url": "https://www.centralfloridazoo.org/news/conservation-expert-dr-laurie-marker-visits-the-central-florida-zoo-botanical-gardens-for-a-cheetah-chat/",
      "email": "information@centralfloridazoo.org"
    },
    {
      "url": "https://www.centralfloridazoo.org/get-involved/volunteer/teenteam/",
      "email": "information@centralfloridazoo.org"
    },
    {
      "url": "https://www.centralfloridazoo.org/get-involved/volunteer/teenteam/",
      "email": "volunteers@centralfloridazoo.org"
    },
    {
      "url": "https://www.centralfloridazoo.org/media/",
      "email": "communications@centralfloridazoo.org"
    },
    {
      "url": "https://www.centralfloridazoo.org/media/",
      "email": "events@centralfloridazoo.org"
    },
    {
      "url": "https://www.centralfloridazoo.org/media/",
      "email": "information@centralfloridazoo.org"
    },
    {
      "url": "https://www.centralfloridazoo.org/media/",
      "email": "marketing@centralfloridazoo.org"
    },
    {
      "url": "https://www.centralfloridazoo.org/media/",
      "email": "press@centralfloridazoo.org"
    },
    {
      "url": "https://www.centralfloridazoo.org/discounts/",
      "email": "information@centralfloridazoo.org"
    },
    {
      "url": "https://www.centralfloridazoo.org/contact-us/",
      "email": "information@centralfloridazoo.org"
    },
    {
      "url": "https://www.centralfloridazoo.org/contact-us/",
      "email": "information@centralfloridazoo.org"
    },
    {
      "url": "https://www.centralfloridazoo.org/tickets/",
      "email": "information@centralfloridazoo.org"
    },
    {
      "url": "https://www.centralfloridazoo.org/news/get-to-know-the-zoo-qa-with-director-of-animal-operations-chris-torge/",
      "email": "information@centralfloridazoo.org"
    },
    {
      "url": "https://www.centralfloridazoo.org/visit/",
      "email": "information@centralfloridazoo.org"
    },
    {
      "url": "https://www.linkedin.com/company/central-florida-zoological-&-botanical-gardens",
      "email": "hr@centralfloridazoo.org"
    },
    {
      "url": "https://www.centralfloridazoo.org/about-the-zoo/central-florida-zoological-society/",
      "email": "development@centralfloridazoo.org"
    },
    {
      "url": "https://www.centralfloridazoo.org/about-the-zoo/central-florida-zoological-society/",
      "email": "emiliea@centralfloridazoo.org"
    },
    {
      "url": "https://www.centralfloridazoo.org/about-the-zoo/central-florida-zoological-society/",
      "email": "events@centralfloridazoo.org"
    },
    {
      "url": "https://www.centralfloridazoo.org/about-the-zoo/central-florida-zoological-society/",
      "email": "information@centralfloridazoo.org"
    },
    {
      "url": "https://www.centralfloridazoo.org/about-the-zoo/central-florida-zoological-society/",
      "email": "jennyb@centralfloridazoo.org"
    },
    {
      "url": "https://www.centralfloridazoo.org/about-the-zoo/central-florida-zoological-society/",
      "email": "leep@centralfloridazoo.org"
    },
    {
      "url": "https://www.centralfloridazoo.org/about-the-zoo/central-florida-zoological-society/",
      "email": "marketing@centralfloridazoo.org"
    },
    {
      "url": "https://www.centralfloridazoo.org/about-the-zoo/central-florida-zoological-society/",
      "email": "matthewe@centralfloridazoo.org"
    },
    {
      "url": "https://www.centralfloridazoo.org/about-the-zoo/central-florida-zoological-society/",
      "email": "membership@centralfloridazoo.org"
    },
    {
      "url": "https://www.centralfloridazoo.org/about-the-zoo/central-florida-zoological-society/",
      "email": "press@centralfloridazoo.org"
    },
    {
      "url": "https://www.centralfloridazoo.org/about-the-zoo/central-florida-zoological-society/",
      "email": "volunteers@centralfloridazoo.org"
    },
    {
      "url": "https://business.seminolebusiness.org/news/details/central-florida-zoo-botanical-gardens-welcomes-new-coo",
      "email": "shellya@centralfloridazoo.org"
    },
    {
      "url": "https://business.seminolebusiness.org/news/details/central-florida-zoo-botanical-gardens-welcomes-new-coo",
      "email": "info@seminolebusiness.org"
    },
    {
      "url": "https://www.centralfloridazoo.org/visit/location/",
      "email": "information@centralfloridazoo.org"
    },
    {
      "url": "https://www.centralfloridazoo.org/employment-opportunities/careers/",
      "email": "hr@centralfloridazoo.org"
    },
    {
      "url": "https://www.centralfloridazoo.org/employment-opportunities/careers/",
      "email": "information@centralfloridazoo.org"
    },
    {
      "url": "https://www.centralfloridazoo.org/spacerental/",
      "email": "events@centralfloridazoo.org"
    },
    {
      "url": "https://www.centralfloridazoo.org/spacerental/",
      "email": "information@centralfloridazoo.org"
    },
    {
      "url": "https://www.centralfloridazoo.org/",
      "email": "information@centralfloridazoo.org"
    }
  ],
  "mails": [
    "communications@centralfloridazoo.org",
    "development@centralfloridazoo.org",
    "emiliea@centralfloridazoo.org",
    "events@centralfloridazoo.org",
    "hr@centralfloridazoo.org",
    "info@seminolebusiness.org",
    "information@centralfloridazoo.org",
    "jennyb@centralfloridazoo.org",
    "leep@centralfloridazoo.org",
    "marketing@centralfloridazoo.org",
    "matthewe@centralfloridazoo.org",
    "membership@centralfloridazoo.org",
    "press@centralfloridazoo.org",
    "shellya@centralfloridazoo.org",
    "volunteers@centralfloridazoo.org"
  ],
  "nombre_sitio": "centralfloridazoo.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.centralfloridazoo.org/news/conservation-expert-dr-laurie-marker-visits-the-central-florida-zoo-botanical-gardens-for-a-cheetah-chat/",
      "text": "Central Florida Zoo & Botanical Gardens Conservation expert Dr. Laurie Marker visits the Central Florida Zoo & Botanical Gardens for a “Cheetah Chat” - Central Florida Zoo & Botanical Gardens Skip to Content VISIT ANIMALS SUNSET Toggle navigation Visit General Admission Annual Pass Group Rates Special Discounts Location Zoo Rules Zoo Accessibility Dining Map of the Zoo Animals & Attractions Amphibians Invertebrates Birds Mammals Reptiles Botanical Gardens Barnyard Buddies Petting Zoo Keeper Chats Giraffe Feeding Wharton-Smith Tropical Splash Ground Private Experiences Wild Explorer VR Experience Events Education School & Group Programs K-3 STEM Programs Ambassador Animal Experiences Tours Create Your Own ZOOventure Camp Information Children & Adult Programs Nighttime Adventures Family and Adult Programs Homeschool ZOOventure Programs Scout Programs Resources and Activities Zoo to You! Videos and Outreach Programs Preschool – Adult In Person & Virtual Outreach Programs Zoo to You! Video Series ZOOper Birthday Parties Venue Rental Get Involved Donate Commemorate Protect Partner Adopt an Animal Internship Opportunities Volunteer Opportunities Donate Search for: Subscribe to our newsletter News Media Events ZOOper Birthday Parties Venue Rental About the Zoo Subscribe to our newsletter Visit Admission & Hours Annual Pass Group Rates Special Discounts Group Location Zoo Rules Zoo Accessibility Dining Shopping Map of the Zoo Animals & Attractions Animals Group 1 Animals Amphibians Invertebrates Birds Mammals Reptiles Botanical Gardens 🌿 Botanical Garden Tours Animals Group 2 Attractions Wild Explorer VR Experience Giraffe Feeding Barnyard Buddies Wharton-Smith Tropical Splash Ground Train Ride Keeper Chats Private Experiences Education and Conservation Education Group 1 School & Group Programs K-3 STEM Programs Ambassador Animal Experiences Tours Create Your Own ZOOventure Camp Information Spring Camps Summer Camps Education Group 2 Children & Adult Programs Homeschool ZOOventures Cub Club Nighttime Adventures Family and Adult Programs Scout Programs Teacher Workshops Resources and Activities Education Group 3 Zoo to You! Videos and Outreach Programs Outreach Programs Zoo to You! Video Series Conservation Initiatives Orianne Center for Indigo Conservation (OCIC) Conservation Days at the Zoo Get Involved Donate Group 1 Donate There Is No Zoo Without You Commemorate Your gift can change our world. Donate Group 2 Protect Conservation in action Partner Help the Zoo make a difference Donate Group 3 Internship Opportunities Adopt an Animal Message from an Animal Volunteer Opportunities Tickets Donate × \\ Central Florida Zoo & Botanical Gardens › News › Conservation expert Dr. Laurie Marker visits the Central Florida Zoo & Botanical Gardens for a “Cheetah Chat” Conservation expert Dr. Laurie Marker visits the Central Florida Zoo & Botanical Gardens for a “Cheetah Chat” Thursday, April 20, 2023 Conservation expert Dr. Laurie Marker visits the Central Florida Zoo & Botanical Gardens for a “Cheetah Chat” On Monday, April 17, the Central Florida Zoo & Botanical Gardens had a truly remarkable opportunity. We hosted Dr. Laurie Marker, F ounder and Executive Director of the Cheetah Conservation Fund . An expert in her field, she has been working closely with the breeding and reintroduction of cheetahs for nearly 50 years, including building the CCF in 1990. After a tour of the facilities and an up-close introduction to the Zoo’s own handsome cheetah brothers Cheeto and Frito , Dr. Marker lent some of her expertise and insight to the carnivore keeper team, covering a range of topics from behaviors and nutrition to genetics and habitat. In the evening, Dr. Marker gave a presentation on cheetah conservation to guests and VIPs, tracing her journey from winery and goat farm owner to managing hundreds of thousands of acres of land devoted to cheetah conservation in both Namibia and Somaliland. Cheetah populations once hovered around 100,000 in the year 1900, dropping significantly over the century to less than 7,100 animals today. Now extinct in over 20 countries where they once lived, these beautiful and unique cats still need our help. “Education is key”, she emphasized, sharing stories about developing laws in the Middle East to prevent illegal wildlife trade that puts wild cheetahs at risk. From teaching African farmers not to kill these animals out of fear to introducing the concept that wildlife is an important part of people’s lives, she’s been spreading awareness on a human level. The CCF in Namibia has also done incredible work with habitat restoration, developing systems that clear wild thornbush from overgrown and unusable  land, as well as a program that introduces livestock guard dogs to local farmers in order to deter the old “kill on sight” policy when it comes to these natural wild predators. Their facility in Namibia has also performed critical research for reproduction, stating that ‘There is hope!’ when it comes to cheetah conservation and repopulation. Tracking genetic traits among cheetahs in zoos, Dr. Marker has worked closely with the AZA SAFE: Saving Animals From Extinction program to create cheetah studbooks to promote genetic diversity. “Your own Zoo cheetahs may someday be part of the saving grace of cheetahs living in the wild,” she said. We at the Central Florida Zoo & Botanical Gardens were honored to host Dr. Marker. It was, as one of our animal team leaders says, a career highlight of a day. And you, too, can make a difference! If you’d like to help, visit http://www.cheetah.org to donate, volunteer, or simply spread awareness about cheetah conservation. We know Cheeto and Frito will also be waiting on your visit! More News Zoo Boo Bash, presented by Orlando Health, returns for... Read More Top tips for a day at the best zoo in Florida Read More Central Florida Zoo welcomes rare Fossa cubs Read More Contact Us Careers Privacy Policy Donor Privacy Gift Guidelines Central Florida Zoo & Botanical Gardens 3755 W. Seminole Blvd. Sanford, FL 32771 407.323.4450 | information@centralfloridazoo.org x"
    },
    {
      "url": "https://www.centralfloridazoo.org/get-involved/volunteer/teenteam/",
      "text": "Central Florida Zoo & Botanical Gardens Teen Team - Central Florida Zoo & Botanical Gardens Skip to Content VISIT ANIMALS SUNSET Toggle navigation Visit General Admission Annual Pass Group Rates Special Discounts Location Zoo Rules Zoo Accessibility Dining Map of the Zoo Animals & Attractions Amphibians Invertebrates Birds Mammals Reptiles Botanical Gardens Barnyard Buddies Petting Zoo Keeper Chats Giraffe Feeding Wharton-Smith Tropical Splash Ground Private Experiences Wild Explorer VR Experience Events Education School & Group Programs K-3 STEM Programs Ambassador Animal Experiences Tours Create Your Own ZOOventure Camp Information Children & Adult Programs Nighttime Adventures Family and Adult Programs Homeschool ZOOventure Programs Scout Programs Resources and Activities Zoo to You! Videos and Outreach Programs Preschool – Adult In Person & Virtual Outreach Programs Zoo to You! Video Series ZOOper Birthday Parties Venue Rental Get Involved Donate Commemorate Protect Partner Adopt an Animal Internship Opportunities Volunteer Opportunities Donate Search for: Subscribe to our newsletter News Media Events ZOOper Birthday Parties Venue Rental About the Zoo Subscribe to our newsletter Visit Admission & Hours Annual Pass Group Rates Special Discounts Group Location Zoo Rules Zoo Accessibility Dining Shopping Map of the Zoo Animals & Attractions Animals Group 1 Animals Amphibians Invertebrates Birds Mammals Reptiles Botanical Gardens 🌿 Botanical Garden Tours Animals Group 2 Attractions Wild Explorer VR Experience Giraffe Feeding Barnyard Buddies Wharton-Smith Tropical Splash Ground Train Ride Keeper Chats Private Experiences Education and Conservation Education Group 1 School & Group Programs K-3 STEM Programs Ambassador Animal Experiences Tours Create Your Own ZOOventure Camp Information Spring Camps Summer Camps Education Group 2 Children & Adult Programs Homeschool ZOOventures Cub Club Nighttime Adventures Family and Adult Programs Scout Programs Teacher Workshops Resources and Activities Education Group 3 Zoo to You! Videos and Outreach Programs Outreach Programs Zoo to You! Video Series Conservation Initiatives Orianne Center for Indigo Conservation (OCIC) Conservation Days at the Zoo Get Involved Donate Group 1 Donate There Is No Zoo Without You Commemorate Your gift can change our world. Donate Group 2 Protect Conservation in action Partner Help the Zoo make a difference Donate Group 3 Internship Opportunities Adopt an Animal Message from an Animal Volunteer Opportunities Tickets Donate × Teen Team Central Florida Zoo & Botanical Gardens › Get Involved › Volunteer Opportunities › Teen Team Youth ages 13–17 VOLUNTEER POSITION OVERVIEW Central Florida Zoo & Botanical Garden’s Teen Team, teenagers ages 13 to 17, can make new friends, learn something new, and play a vital role in educating Zoo visitors. Teens will receive special hands-on training, including educating the public about conservation, presenting wildlife biofacts, and handling animals. They’ll participate in special events and share their new knowledge on wildlife and conservation issues with guests, learning the skills they’ll need later in life and gaining valuable work experience. Duties Educate members of the public of all ages Facilitate learning opportunities Animal handling, interpretation, and observations Utilize bio-facts to educate guests Educate the public about animal conservation at Zoo events Assist with zoo projects Monitor guest interactions and enforce Zoo policies to keep animals and guests safe How to Apply ​We bring on new Teen Team volunteers once a year. The annual process starts in February when we open applications, where applications remain open for two months. You will be able to complete the application using the link below at that time. Three required documents need to be attached to the application, and those documents will be available on the application when it opens. How it Works Teens must apply for the Teen Team program and complete an interview on a pre-scheduled interview date. If selected, teens must attend a multi-day training program and pass a final exam. Training classes will be during the summer, on the weekends. Upon successful completion of training, teens volunteer on select Saturdays and Sundays each month. During Summer break, teens may have the opportunity to volunteer on weekdays by assisting with Summer Camp. For Parents & Guardians The Teen Team program is designed to foster independence, professionalism, and responsibility in teens. Our program is designed to provide a healthy boost to teens’ self-confidence, self-esteem, and life satisfaction. While parental support is important, it’s crucial that teens take the initiative in managing their volunteer commitments just as they would in a paid position. This means they should be the primary contact for communications and be proactive in handling their schedules and responsibilities. Please encourage your teen to fill out the application themselves, have them use their own email and phone number in the application, and encourage them to communicate directly with Volunteer Services staff. This experience is not only about volunteering but also about growing into responsible, professional, and self-sufficient young adults. Important Dates The application and onboarding process is as follows: February – Applications Open April – Applications Close & Interview Invites Are Sent Out May – Selected Applicants Will Interview June – Training Begins Requirements Must be between ages 13-17 years old at the start of the program in June. Accepted teens who turn 18 years old during the program and are finishing out their senior year are permitted to stay in the program through the end of their graduating summer. After that, they will have aged out from the program and are eligible for our adult volunteer programs. Pass training program with 80% or higher. Pay a $35 tuition fee for onboarding materials and uniform. If this fee creates a financial hardship, please contact us for assistance. Must be able to commit to volunteering 30 hours annually. Able to complete volunteer shifts during Zoo operating hours. Participate in volunteer orientation and training. Successfully completed introductory period. Abide by policies in the Volunteer Handbook. Provide excellent customer service and demonstrate the ability to work well with visitors. Must successfully pass a background check. Must be able to tolerate Florida’s weather conditions. Be interested in educating the public about conservation. Apply Now Questions? Email Volunteer Services at volunteers@centralfloridazoo.org News Zoo Boo Bash, presented by Orlando Health, returns for... Read More Top tips for a day at the best zoo in Florida Read More Central Florida Zoo welcomes rare Fossa cubs Read More Contact Us Careers Privacy Policy Donor Privacy Gift Guidelines Central Florida Zoo & Botanical Gardens 3755 W. Seminole Blvd. Sanford, FL 32771 407.323.4450 | information@centralfloridazoo.org x"
    },
    {
      "url": "https://www.centralfloridazoo.org/media/",
      "text": "Central Florida Zoo & Botanical Gardens Central Florida Zoo Media Requests | Contacts & Information Skip to Content VISIT ANIMALS SUNSET Toggle navigation Visit General Admission Annual Pass Group Rates Special Discounts Location Zoo Rules Zoo Accessibility Dining Map of the Zoo Animals & Attractions Amphibians Invertebrates Birds Mammals Reptiles Botanical Gardens Barnyard Buddies Petting Zoo Keeper Chats Giraffe Feeding Wharton-Smith Tropical Splash Ground Private Experiences Wild Explorer VR Experience Events Education School & Group Programs K-3 STEM Programs Ambassador Animal Experiences Tours Create Your Own ZOOventure Camp Information Children & Adult Programs Nighttime Adventures Family and Adult Programs Homeschool ZOOventure Programs Scout Programs Resources and Activities Zoo to You! Videos and Outreach Programs Preschool – Adult In Person & Virtual Outreach Programs Zoo to You! Video Series ZOOper Birthday Parties Venue Rental Get Involved Donate Commemorate Protect Partner Adopt an Animal Internship Opportunities Volunteer Opportunities Donate Search for: Subscribe to our newsletter News Media Events ZOOper Birthday Parties Venue Rental About the Zoo Subscribe to our newsletter Visit Admission & Hours Annual Pass Group Rates Special Discounts Group Location Zoo Rules Zoo Accessibility Dining Shopping Map of the Zoo Animals & Attractions Animals Group 1 Animals Amphibians Invertebrates Birds Mammals Reptiles Botanical Gardens 🌿 Botanical Garden Tours Animals Group 2 Attractions Wild Explorer VR Experience Giraffe Feeding Barnyard Buddies Wharton-Smith Tropical Splash Ground Train Ride Keeper Chats Private Experiences Education and Conservation Education Group 1 School & Group Programs K-3 STEM Programs Ambassador Animal Experiences Tours Create Your Own ZOOventure Camp Information Spring Camps Summer Camps Education Group 2 Children & Adult Programs Homeschool ZOOventures Cub Club Nighttime Adventures Family and Adult Programs Scout Programs Teacher Workshops Resources and Activities Education Group 3 Zoo to You! Videos and Outreach Programs Outreach Programs Zoo to You! Video Series Conservation Initiatives Orianne Center for Indigo Conservation (OCIC) Conservation Days at the Zoo Get Involved Donate Group 1 Donate There Is No Zoo Without You Commemorate Your gift can change our world. Donate Group 2 Protect Conservation in action Partner Help the Zoo make a difference Donate Group 3 Internship Opportunities Adopt an Animal Message from an Animal Volunteer Opportunities Tickets Donate × Media Central Florida Zoo & Botanical Gardens › Media Welcome to the Zoo's media page, where you can find information on all digital inquiries and latest happenings at the Zoo. Media Contacts Please send all media and digital requests to: press@centralfloridazoo.org Please send all marketing and paid advertising requests to: marketing@centralfloridazoo.org Media Policy View the Zoo’s Privacy and Copyright policy regarding images, documents, etc. All media inquiries should be directed to the Zoo’s Communications team. Photos taken for private, personal use are welcome. Taking photos or video for commercial purposes, including stock images, commercial products or purposes is strictly prohibited. Complimentary admission can be arranged for media professionals. The more lead time we have, the more available opportunities we may have. Media requests, if approved, are only available during off-peak days and times. Credentials are required for those visiting for media events. We will request links or copies of all published articles, photographs, or videos. Behind-the-scenes coverage is prohibited unless otherwise arranged in advance. All imaging equipment must remain in public areas and not cross into animal habitats. If you’d like to take photos or film at the Central Florida Zoo & Botanical Gardens for any reason besides personal use, you must submit a request in writing to the Zoo’s Communications team in advance with the following information: Individual or company name, phone number, and e-mail address Explain the purpose of your project If an interview is requested, please provide the detailed questions so we can arrange the appropriate representative The number of people involved in the shoot List of the number and types of equipment being used Request for particular animals Include the area of the Zoo you’d like to shoot Any additional details the Central Florida Zoo & Botanical Gardens should be aware of We reserve the right to deny and request or cancel any shoot if at any time it is not in the best interest of the animals, visitors, or does not align with the Zoo’s mission. Members of the Press & Media The Central Florida Zoo & Botanical Gardens’ policy requires all media requests to be screened by our communications department. For breaking news or developing stories, media representatives are asked to contact 407-323-4450 ext. 106 to schedule filming opportunities and interviews. To be added to our press release contact list, please send a request to communications@centralfloridazoo.org . We understand the nature of minute-by-minute news and will try to accommodate all stations as possible. Commercial Filming & Photography Permission is required for all photo and video obtained for commercial purposes on Central Florida Zoo & Botanical Gardens’ grounds. This includes all property past the front entrance off of West Seminole Boulevard including, but not limited to—the train, Seminole Aerial Adventures, Wayne M. Densch Discovery Center, and the entirety of the Zoo. The Zoo reserves the right to determine acceptable requests and appropriate use of any content obtained on premises. All content must uphold the Zoo’s mission and respect our facilities, animals, staff, visitors, and overall Zoo image. You must make a request at least two weeks in advance so a member of the communications team can accompany you during your visit. Please contact us with specific details of your request and affiliation. Photo Shoots The Central Florida Zoo & Botanical Gardens has a variety of aesthetically desirable locations for professional photography. All photo shoots are subject to fees and must be scheduled with our events manager. If you are looking to book a photoshoot on our property, please contact our events team at 407-323-4450 ext. 103 or events@centralfloridazoo.org . Student Projects Students interested in conducting interview, photo, or video projects at the Central Florida Zoo & Botanical Gardens must request permission through the Zoo’s Communications Team. We believe in the value of education and will try to accommodate academic requests, however, depending on staff availability, not all requests can be approved. You must make a request at least two weeks in advance so a member of the communications team can accompany you during your visit. Please contact us with specific details of school, course, project, and deadline. Include requests about interviews, specific animals, etc. Freelance Writers & Social Media Influencers We are often contacted by community members looking to obtain digital content at the Central Florida Zoo & Botanical Gardens. We would like to consider all media requests that may be mutually beneficial. If you are interested in sharing your Zoo or Seminole Aerial Adventure experience with your online community or following, please contact us at least one week prior to your proposed visit and include: Topic of interest (wildlife, travel, family fun, adventure, etc.) Information about your platform including the target audience and demographics of your followers Links to your posts Number and statistics of your followers Date(s) your content will be published If your proposed content is approved, the Central Florida Zoo & Botanical Gardens will provide up to two complimentary single-day tickets  for use only on weekdays (Monday–Thursday). Only one request will be considered per 12-month period per writer/influencer. Use of Central Florida Zoo & Botanical Gardens for Personal Photography We encourage guests to take personal video and photographs while enjoying your visit! All photographs must be taken in public guest areas or within spaces designated for special events, programs, etc. The Central Florida Zoo & Botanical Gardens has the right to withdraw consent of use for any photograph or video and to reproduce photographs taken on grounds. Don’t forget to use #CentralFloridaZoo when posting! View Current Zoo News Here News Zoo Boo Bash, presented by Orlando Health, returns for... Read More Top tips for a day at the best zoo in Florida Read More Central Florida Zoo welcomes rare Fossa cubs Read More Contact Us Careers Privacy Policy Donor Privacy Gift Guidelines Central Florida Zoo & Botanical Gardens 3755 W. Seminole Blvd. Sanford, FL 32771 407.323.4450 | information@centralfloridazoo.org x"
    },
    {
      "url": "https://www.centralfloridazoo.org/discounts/",
      "text": "Central Florida Zoo & Botanical Gardens Special Discounts - Central Florida Zoo & Botanical Gardens Skip to Content VISIT ANIMALS SUNSET Toggle navigation Visit General Admission Annual Pass Group Rates Special Discounts Location Zoo Rules Zoo Accessibility Dining Map of the Zoo Animals & Attractions Amphibians Invertebrates Birds Mammals Reptiles Botanical Gardens Barnyard Buddies Petting Zoo Keeper Chats Giraffe Feeding Wharton-Smith Tropical Splash Ground Private Experiences Wild Explorer VR Experience Events Education School & Group Programs K-3 STEM Programs Ambassador Animal Experiences Tours Create Your Own ZOOventure Camp Information Children & Adult Programs Nighttime Adventures Family and Adult Programs Homeschool ZOOventure Programs Scout Programs Resources and Activities Zoo to You! Videos and Outreach Programs Preschool – Adult In Person & Virtual Outreach Programs Zoo to You! Video Series ZOOper Birthday Parties Venue Rental Get Involved Donate Commemorate Protect Partner Adopt an Animal Internship Opportunities Volunteer Opportunities Donate Search for: Subscribe to our newsletter News Media Events ZOOper Birthday Parties Venue Rental About the Zoo Subscribe to our newsletter Visit Admission & Hours Annual Pass Group Rates Special Discounts Group Location Zoo Rules Zoo Accessibility Dining Shopping Map of the Zoo Animals & Attractions Animals Group 1 Animals Amphibians Invertebrates Birds Mammals Reptiles Botanical Gardens 🌿 Botanical Garden Tours Animals Group 2 Attractions Wild Explorer VR Experience Giraffe Feeding Barnyard Buddies Wharton-Smith Tropical Splash Ground Train Ride Keeper Chats Private Experiences Education and Conservation Education Group 1 School & Group Programs K-3 STEM Programs Ambassador Animal Experiences Tours Create Your Own ZOOventure Camp Information Spring Camps Summer Camps Education Group 2 Children & Adult Programs Homeschool ZOOventures Cub Club Nighttime Adventures Family and Adult Programs Scout Programs Teacher Workshops Resources and Activities Education Group 3 Zoo to You! Videos and Outreach Programs Outreach Programs Zoo to You! Video Series Conservation Initiatives Orianne Center for Indigo Conservation (OCIC) Conservation Days at the Zoo Get Involved Donate Group 1 Donate There Is No Zoo Without You Commemorate Your gift can change our world. Donate Group 2 Protect Conservation in action Partner Help the Zoo make a difference Donate Group 3 Internship Opportunities Adopt an Animal Message from an Animal Volunteer Opportunities Tickets Donate × Special Discounts Save on your Zoo visit. Central Florida Zoo & Botanical Gardens › Special Discounts There are so many ways to experience the Zoo Guests wanting to use one of the discounts listed below must purchase their tickets in person at the Zoo’s Admissions Window. Single Day Admission Discounts Military Discount ( Active duty; Current Guard/Reserve; Non-Active Duty; Retirees; and Veterans )— Receive 20% off daily admission for service member and entire party. Must show valid I.D. and present valid military I.D. or DD214. Law Enforcement and First Responders ( All Branches )— Receive 10% off general admission for yourself and entire party. Must show proper I.D. Healthcare Workers (Doctors, Nurses, and Hospital Staff )— Receive 10% off general admission for yourself and entire party. Must show proper I.D. Teachers— All public or private school instructional employees (teachers) receive 20% off general admission. Must provide copy of school/teacher ID or printout verification. College Students— Receive 10% off of a single day general admission purchase. Must show valid college or university I.D. Local Hotel Guests— Show your hotel key card to receive 10% off single day admission for your entire party. Please Note: These special discounts are only available for Zoo and Seminole Aerial Adventure single day admission tickets purchased at the Zoo’s Admission window. Reciprocal Programs View the current list of AZA-accredited facilities that participate by clicking on the current AZA Reciprocal Admissions Program List on the AZA’s website here . The Central Florida Zoo & Botanical Gardens is proud to participate in the AZA Reciprocal Admissions Program . We offer 50% off admission for up to two (2) adults and six (6) children listed on a participating AZA zoo or aquarium’s membership card. (Entry is based on the issuing facility’s valid membership card, with the above limitations.) The Central Florida Zoo & Botanical Gardens also offers reciprocal admission to annual pass holders, including: Bok Tower Gardens , Florida Clearwater Marine Aquarium , Florida Henson Robinson Zoo , Illinois Salisbury Zoo , Maryland Santa Ana Zoo , California Reciprocal admission benefits are for 50% off general admission for current annual pass holders only ( must present valid pass card from reciprocal attraction and photo I.D. ), and do not apply to guests. Discounts apply to Zoo admission only and does not apply to Seminole Aerial Adventures, train or carousel rides, education programs, special events, and cannot be combined with any other offers or discounts. Questions? Please contact the Zoo prior to your visit at 407-323-4450 News Zoo Boo Bash, presented by Orlando Health, returns for... Read More Top tips for a day at the best zoo in Florida Read More Central Florida Zoo welcomes rare Fossa cubs Read More Contact Us Careers Privacy Policy Donor Privacy Gift Guidelines Central Florida Zoo & Botanical Gardens 3755 W. Seminole Blvd. Sanford, FL 32771 407.323.4450 | information@centralfloridazoo.org x"
    },
    {
      "url": "https://www.centralfloridazoo.org/contact-us/",
      "text": "Central Florida Zoo & Botanical Gardens Contact the Zoo About Birthdays, Admission, or Family Activities Skip to Content VISIT ANIMALS SUNSET Toggle navigation Visit General Admission Annual Pass Group Rates Special Discounts Location Zoo Rules Zoo Accessibility Dining Map of the Zoo Animals & Attractions Amphibians Invertebrates Birds Mammals Reptiles Botanical Gardens Barnyard Buddies Petting Zoo Keeper Chats Giraffe Feeding Wharton-Smith Tropical Splash Ground Private Experiences Wild Explorer VR Experience Events Education School & Group Programs K-3 STEM Programs Ambassador Animal Experiences Tours Create Your Own ZOOventure Camp Information Children & Adult Programs Nighttime Adventures Family and Adult Programs Homeschool ZOOventure Programs Scout Programs Resources and Activities Zoo to You! Videos and Outreach Programs Preschool – Adult In Person & Virtual Outreach Programs Zoo to You! Video Series ZOOper Birthday Parties Venue Rental Get Involved Donate Commemorate Protect Partner Adopt an Animal Internship Opportunities Volunteer Opportunities Donate Search for: Subscribe to our newsletter News Media Events ZOOper Birthday Parties Venue Rental About the Zoo Subscribe to our newsletter Visit Admission & Hours Annual Pass Group Rates Special Discounts Group Location Zoo Rules Zoo Accessibility Dining Shopping Map of the Zoo Animals & Attractions Animals Group 1 Animals Amphibians Invertebrates Birds Mammals Reptiles Botanical Gardens 🌿 Botanical Garden Tours Animals Group 2 Attractions Wild Explorer VR Experience Giraffe Feeding Barnyard Buddies Wharton-Smith Tropical Splash Ground Train Ride Keeper Chats Private Experiences Education and Conservation Education Group 1 School & Group Programs K-3 STEM Programs Ambassador Animal Experiences Tours Create Your Own ZOOventure Camp Information Spring Camps Summer Camps Education Group 2 Children & Adult Programs Homeschool ZOOventures Cub Club Nighttime Adventures Family and Adult Programs Scout Programs Teacher Workshops Resources and Activities Education Group 3 Zoo to You! Videos and Outreach Programs Outreach Programs Zoo to You! Video Series Conservation Initiatives Orianne Center for Indigo Conservation (OCIC) Conservation Days at the Zoo Get Involved Donate Group 1 Donate There Is No Zoo Without You Commemorate Your gift can change our world. Donate Group 2 Protect Conservation in action Partner Help the Zoo make a difference Donate Group 3 Internship Opportunities Adopt an Animal Message from an Animal Volunteer Opportunities Tickets Donate × Central Florida Zoo & Botanical Gardens › Contact Us Contact Us Get in Touch Physical Address: 3755 W. Seminole Blvd., Sanford, FL 32771 Mailing Address: PO Box 470309, Lake Monroe, FL 32747 Phone: 407.323.4450 Email: Information@centralfloridazoo.org Request a Donation Drop us a line Contact Us Careers Privacy Policy Donor Privacy Gift Guidelines Central Florida Zoo & Botanical Gardens 3755 W. Seminole Blvd. Sanford, FL 32771 407.323.4450 | information@centralfloridazoo.org x"
    },
    {
      "url": "https://www.centralfloridazoo.org/tickets/",
      "text": "Central Florida Zoo & Botanical Gardens General Admission - Central Florida Zoo & Botanical Gardens Skip to Content VISIT ANIMALS SUNSET Toggle navigation Visit General Admission Annual Pass Group Rates Special Discounts Location Zoo Rules Zoo Accessibility Dining Map of the Zoo Animals & Attractions Amphibians Invertebrates Birds Mammals Reptiles Botanical Gardens Barnyard Buddies Petting Zoo Keeper Chats Giraffe Feeding Wharton-Smith Tropical Splash Ground Private Experiences Wild Explorer VR Experience Events Education School & Group Programs K-3 STEM Programs Ambassador Animal Experiences Tours Create Your Own ZOOventure Camp Information Children & Adult Programs Nighttime Adventures Family and Adult Programs Homeschool ZOOventure Programs Scout Programs Resources and Activities Zoo to You! Videos and Outreach Programs Preschool – Adult In Person & Virtual Outreach Programs Zoo to You! Video Series ZOOper Birthday Parties Venue Rental Get Involved Donate Commemorate Protect Partner Adopt an Animal Internship Opportunities Volunteer Opportunities Donate Search for: Subscribe to our newsletter News Media Events ZOOper Birthday Parties Venue Rental About the Zoo Subscribe to our newsletter Visit Admission & Hours Annual Pass Group Rates Special Discounts Group Location Zoo Rules Zoo Accessibility Dining Shopping Map of the Zoo Animals & Attractions Animals Group 1 Animals Amphibians Invertebrates Birds Mammals Reptiles Botanical Gardens 🌿 Botanical Garden Tours Animals Group 2 Attractions Wild Explorer VR Experience Giraffe Feeding Barnyard Buddies Wharton-Smith Tropical Splash Ground Train Ride Keeper Chats Private Experiences Education and Conservation Education Group 1 School & Group Programs K-3 STEM Programs Ambassador Animal Experiences Tours Create Your Own ZOOventure Camp Information Spring Camps Summer Camps Education Group 2 Children & Adult Programs Homeschool ZOOventures Cub Club Nighttime Adventures Family and Adult Programs Scout Programs Teacher Workshops Resources and Activities Education Group 3 Zoo to You! Videos and Outreach Programs Outreach Programs Zoo to You! Video Series Conservation Initiatives Orianne Center for Indigo Conservation (OCIC) Conservation Days at the Zoo Get Involved Donate Group 1 Donate There Is No Zoo Without You Commemorate Your gift can change our world. Donate Group 2 Protect Conservation in action Partner Help the Zoo make a difference Donate Group 3 Internship Opportunities Adopt an Animal Message from an Animal Volunteer Opportunities Tickets Donate × General Admission Central Florida Zoo & Botanical Gardens › General Admission Save money and time when you buy online today! Save up to $5 per ticket when you purchase tickets online in advance of your Zoo visit. Online tickets are valid for one year from the date of purchase. No refunds or rainchecks. Non-Peak Pricing Ticket Booth Online Adult $26.95 $21.95 Child (Ages 3 – 12) $18.95 $16.95 Child (Ages 2 and under) Free Free Senior (Ages 55+) $22.95 $17.95 Peak Pricing Ticket Booth Online Adult $28.95 $23.95 Child (Ages 3 – 12) $19.95 $17.95 Child (Ages 2 and under) Free Free Senior (Ages 55+) $24.95 $19.95 Peak days fall on all weekends, select holidays and other select dates throughout the year. Each individual entering the Zoo requires a ticket, including children 2 and under which are free. No discounts* are available for tickets purchased online. For online purchases, tickets will be sent to your email and can be scanned directly from your phone, via that email. By purchasing a ticket to the Zoo, you are agreeing to comply with all Zoo Rules . Parking is free. The Zoo is open daily from 9 a.m. to 4 p.m. Each order will include a $3 transaction fee to cover order processing. This fee is per charged per transaction/order and not per ticket. Purchase General Admission Tickets Please note: If you are purchasing admission tickets as a gift, the purchaser’s name and contact information will print directly on each ticket. This will not prevent the ticket from being used by the recipient. * Guests wishing to use the AZA Reciprocal Admission Discount, or another discount offered on single-day Zoo admission, must purchase their tickets at the Zoo’s Admission Window. Proper identification is required to receive a discount. Electric Vehicle Information We offer EV Chargers onsite, free of charge for visiting Zoo guests only . Violators will be towed at vehicle owner’s expense. EV drivers can download the FPL EVolution app to find and navigate to the closest FPL charging station. The app will route users to the selected station where drivers will scan a code and connect their EV to the station to begin charging. The app will also provide users with information about port availability, outages, charging history, trends, nearby amenities, and more. The Zoo’s parking lot is accessible daily from 8 a.m. to 5 p.m. The charging stations are compatible with all major EV models, including those manufactured by Audi, Chevrolet, Honda, Kia, Nissan, Tesla, and Volkswagen. News Zoo Boo Bash, presented by Orlando Health, returns for... Read More Top tips for a day at the best zoo in Florida Read More Central Florida Zoo welcomes rare Fossa cubs Read More Contact Us Careers Privacy Policy Donor Privacy Gift Guidelines Central Florida Zoo & Botanical Gardens 3755 W. Seminole Blvd. Sanford, FL 32771 407.323.4450 | information@centralfloridazoo.org x"
    },
    {
      "url": "https://www.centralfloridazoo.org/news/get-to-know-the-zoo-qa-with-director-of-animal-operations-chris-torge/",
      "text": "Central Florida Zoo & Botanical Gardens Get to know the Zoo: Q&A with Director of Animal Operations Chris Torge Skip to Content VISIT ANIMALS SUNSET Toggle navigation Visit General Admission Annual Pass Group Rates Special Discounts Location Zoo Rules Zoo Accessibility Dining Map of the Zoo Animals & Attractions Amphibians Invertebrates Birds Mammals Reptiles Botanical Gardens Barnyard Buddies Petting Zoo Keeper Chats Giraffe Feeding Wharton-Smith Tropical Splash Ground Private Experiences Wild Explorer VR Experience Events Education School & Group Programs K-3 STEM Programs Ambassador Animal Experiences Tours Create Your Own ZOOventure Camp Information Children & Adult Programs Nighttime Adventures Family and Adult Programs Homeschool ZOOventure Programs Scout Programs Resources and Activities Zoo to You! Videos and Outreach Programs Preschool – Adult In Person & Virtual Outreach Programs Zoo to You! Video Series ZOOper Birthday Parties Venue Rental Get Involved Donate Commemorate Protect Partner Adopt an Animal Internship Opportunities Volunteer Opportunities Donate Search for: Subscribe to our newsletter News Media Events ZOOper Birthday Parties Venue Rental About the Zoo Subscribe to our newsletter Visit Admission & Hours Annual Pass Group Rates Special Discounts Group Location Zoo Rules Zoo Accessibility Dining Shopping Map of the Zoo Animals & Attractions Animals Group 1 Animals Amphibians Invertebrates Birds Mammals Reptiles Botanical Gardens 🌿 Botanical Garden Tours Animals Group 2 Attractions Wild Explorer VR Experience Giraffe Feeding Barnyard Buddies Wharton-Smith Tropical Splash Ground Train Ride Keeper Chats Private Experiences Education and Conservation Education Group 1 School & Group Programs K-3 STEM Programs Ambassador Animal Experiences Tours Create Your Own ZOOventure Camp Information Spring Camps Summer Camps Education Group 2 Children & Adult Programs Homeschool ZOOventures Cub Club Nighttime Adventures Family and Adult Programs Scout Programs Teacher Workshops Resources and Activities Education Group 3 Zoo to You! Videos and Outreach Programs Outreach Programs Zoo to You! Video Series Conservation Initiatives Orianne Center for Indigo Conservation (OCIC) Conservation Days at the Zoo Get Involved Donate Group 1 Donate There Is No Zoo Without You Commemorate Your gift can change our world. Donate Group 2 Protect Conservation in action Partner Help the Zoo make a difference Donate Group 3 Internship Opportunities Adopt an Animal Message from an Animal Volunteer Opportunities Tickets Donate × \\ Central Florida Zoo & Botanical Gardens › News › Get to know the Zoo: Q&A with Director of Animal Operations Chris Torge Get to know the Zoo: Q&A with Director of Animal Operations Chris Torge Friday, July 14, 2023 Get to know the Zoo: Q&A with Director of Animal Operations Chris Torge Visitors to the Central Florida Zoo & Botanical Gardens know that our institution is full of interesting animals, from tiny scorpions to towering giraffes . But we are lucky enough to have some pretty interesting humans on staff, too! If you haven’t had a chance to attend a Keeper Chat or meet one of our knowledgeable education staff members, definitely make it a point on your next visit! They have so much to share. Today, we wanted to introduce you to one of those very special Zoo staff members to give you a behind-the-scenes look at just how much goes into caring for the collection of animals at our Orlando Zoo and how to become a zoo keeper. We sat down with Christopher Torge, our Director of Animal Operations, to learn more. See what he had to say below! Question: How long have you been at the Zoo? Answer: I started February 2021, so a little over two years. Q: What was your experience before coming here? A: I have been in the zoological field since 1998. I have worked at the Central Park Zoo, Rosamond Gifford Zoo, and Disney’s Animal Kingdom and Animal Kingdom Lodge. I have been an intern, animal keeper, senior keeper, zoological manager, and now Director of Animal Operations. Q: What are some things people might not know about you and your work with animals? I’ve ridden more elephants than horses. Vultures are one of my favorite animals to work with. And I have spent over 6,768 hours working with giraffes! Q: As Director of Animal Operations, what are your main job duties? A: I am responsible for our entire animal collection and the team of 30 people that take care of them. I focus on providing my team with all the tools they need to be successful at their job and to enjoy their job. I partner with all the other teams at the Zoo to provide the best possible care for our animal collection. Q: What kind of education and experience does someone need to get to your position ? A: First, I have a degree in Zoology.  For someone in my role, it’s also important to have experience with project management, zoological park attractions and operations, and a solid leadership style. Q: What drew you to this work to begin with? A: I’ve always been fascinated with animal behavior. That naturally led to me wanting to work with them. Q: What’s your favorite thing about working at the Zoo? A: I really enjoy providing for the people on my team and watching them grow professionally. I enjoy providing new experiences for them, like exhibit design and animal training. These allow them to build on their strengths and are things that make our profession unique. Q: What’s something a visitor might not know that you want them to know? A: That a large percentage of time is spent evaluating and improving the wellbeing of our animal collection. Our staff spends hours on assessments, evaluations and behavioral husbandry to truly provide the highest level of care for our animals. Q: What’s the hardest part about your job? A: Because the staff spend so much time with the animals, they develop deep bonds with them. Watching my team have to say goodbye to an animal is always the hardest, even when it is the best and necessary decision. Q: What’s one thing people can do to help animals or further the Zoo’s mission? A: Our guests can do their part for conservation through some simple actions ! Recycle, plant a butterfly garden, donate to a conservation organization, volunteer, and spread the word to others to do the same. They all make a difference! We hope Chris has taught you something new about the Zoo or inspired you to help. After all, our mission is to create connections that inspire people to take action on behalf of wildlife! Be sure to say hi to Chris or the other Zoo staff members on your next visit. Learn more here . More News Zoo Boo Bash, presented by Orlando Health, returns for... Read More Top tips for a day at the best zoo in Florida Read More Central Florida Zoo welcomes rare Fossa cubs Read More Contact Us Careers Privacy Policy Donor Privacy Gift Guidelines Central Florida Zoo & Botanical Gardens 3755 W. Seminole Blvd. Sanford, FL 32771 407.323.4450 | information@centralfloridazoo.org x"
    },
    {
      "url": "https://www.centralfloridazoo.org/visit/",
      "text": "Central Florida Zoo & Botanical Gardens Family Fun in Central Florida | Plan Your Visit To The Zoo Today Skip to Content VISIT ANIMALS SUNSET Toggle navigation Visit General Admission Annual Pass Group Rates Special Discounts Location Zoo Rules Zoo Accessibility Dining Map of the Zoo Animals & Attractions Amphibians Invertebrates Birds Mammals Reptiles Botanical Gardens Barnyard Buddies Petting Zoo Keeper Chats Giraffe Feeding Wharton-Smith Tropical Splash Ground Private Experiences Wild Explorer VR Experience Events Education School & Group Programs K-3 STEM Programs Ambassador Animal Experiences Tours Create Your Own ZOOventure Camp Information Children & Adult Programs Nighttime Adventures Family and Adult Programs Homeschool ZOOventure Programs Scout Programs Resources and Activities Zoo to You! Videos and Outreach Programs Preschool – Adult In Person & Virtual Outreach Programs Zoo to You! Video Series ZOOper Birthday Parties Venue Rental Get Involved Donate Commemorate Protect Partner Adopt an Animal Internship Opportunities Volunteer Opportunities Donate Search for: Subscribe to our newsletter News Media Events ZOOper Birthday Parties Venue Rental About the Zoo Subscribe to our newsletter Visit Admission & Hours Annual Pass Group Rates Special Discounts Group Location Zoo Rules Zoo Accessibility Dining Shopping Map of the Zoo Animals & Attractions Animals Group 1 Animals Amphibians Invertebrates Birds Mammals Reptiles Botanical Gardens 🌿 Botanical Garden Tours Animals Group 2 Attractions Wild Explorer VR Experience Giraffe Feeding Barnyard Buddies Wharton-Smith Tropical Splash Ground Train Ride Keeper Chats Private Experiences Education and Conservation Education Group 1 School & Group Programs K-3 STEM Programs Ambassador Animal Experiences Tours Create Your Own ZOOventure Camp Information Spring Camps Summer Camps Education Group 2 Children & Adult Programs Homeschool ZOOventures Cub Club Nighttime Adventures Family and Adult Programs Scout Programs Teacher Workshops Resources and Activities Education Group 3 Zoo to You! Videos and Outreach Programs Outreach Programs Zoo to You! Video Series Conservation Initiatives Orianne Center for Indigo Conservation (OCIC) Conservation Days at the Zoo Get Involved Donate Group 1 Donate There Is No Zoo Without You Commemorate Your gift can change our world. Donate Group 2 Protect Conservation in action Partner Help the Zoo make a difference Donate Group 3 Internship Opportunities Adopt an Animal Message from an Animal Volunteer Opportunities Tickets Donate × Visit Plan a fun-filled day for the whole family. Central Florida Zoo & Botanical Gardens › Visit Open 9am - 4pm Purchase online now to take advantage of our best available rates General Admission Save $2 per ticket and use our QUICK SCAN entrance when you purchase tickets online in advance of your Zoo visit. Single-Day Tickets Online Save $2 per ticket At the Zoo Adults $21.95 - $23.95 $26.95 - $28.95 Seniors Ages 55+ $17.95 - $19.95 $22.95 - $24.95 Children Ages 3 - 12 $16.95 - $17.95 $18.95 - $22.95 Children Ages 2 and under Free Free Get Tickets At the Zoo Adults $26.95 - $28.95 Seniors Ages 55+ $22.95 - $24.95 Children Ages 3 - 12 $18.95 - $22.95 Children Ages 2 and under Free Pricing based on dates selected. Peak days fall on all weekends, select holidays and other select dates throughout the year. Online tickets are valid for one year from the date of purchase. No refunds or rain checks. Please note: If you are purchasing admission tickets as a gift, the purchaser’s name and contact information will print directly on each ticket. This will not prevent the ticket from being used by the recipient. * Guests wishing to use the AZA Reciprocal Admission Discount, or another discount offered on single-day Zoo admission, must purchase their tickets at the Zoo’s Admission Window. Proper identification is required to receive a discount. Annual Passes With an Annual Pass, you and your family can see our Zoo’s residents year-round, for one low price. Group Rates Group rates start at 15 or more paying guests. Seminole Aerial Adventures Tickets Seminole Aerial Adventures Tickets Join us for an adventure up in the trees! Navigate your way from tree to tree using rope bridges, zips, suspended disks, and a variety of unique elements for this exciting challenge for your body and mind. Reserve a Time Planning Your Visit Where we are located 3755 W. Seminole Blvd. Sanford, Florida 32771 Get Directions Updated ZOO Operations Each individual entering the Zoo requires a ticket, including children 2 and under which are free. No discounts* are available for tickets purchased online. To allow for limited contact admission, tickets will be sent to your email and can be scanned directly off of your phone, from that email. By purchasing a ticket to the Zoo, you are agreeing to comply with all Zoo Rules. Parking is free. The Zoo is open daily from 9 a.m. to 4 p.m. The Zoo will be CLOSED on Thursday, November 28, 2024, and Wednesday, December 25, 2024. Electric Vehicle Information EV drivers can download the FPL EVolution app to find and navigate to the closest FPL charging station. The app will route users to the selected station where drivers will scan a code and connect their EV to the station to begin charging. The app will also provide users with information about port availability, outages, charging history, trends, nearby amenities, and more. The Zoo’s parking lot is accessible daily from 8 a.m. to 5 p.m. The charging stations are compatible with all major EV models, including those manufactured by Audi, Chevrolet, Honda, Kia, Nissan, Tesla, and Volkswagen. Contact Us Careers Privacy Policy Donor Privacy Gift Guidelines Central Florida Zoo & Botanical Gardens 3755 W. Seminole Blvd. Sanford, FL 32771 407.323.4450 | information@centralfloridazoo.org x"
    },
    {
      "url": "https://www.linkedin.com/company/central-florida-zoological-&-botanical-gardens",
      "text": "Central Florida Zoo & Botanical Gardens | LinkedIn Skip to main content LinkedIn Top Content People Learning Jobs Games Sign in Join now Central Florida Zoo & Botanical Gardens Non-profit Organizations Sanford, Florida 2,343 followers We seek to create connections that inspire people to take action for wildlife. Follow View all 121 employees Report this company About us MISSION: To create connections that inspire people to take action for wildlife.\n\nVISION: A world where all animals and people thrive together.\n\nCORE VALUES:\nWelcome All – We all have something to offer and something to learn from each other. Empower all people to share their experiences and perspectives.\n\nBe Our Best – We strive for excellence. Be open to new ideas and to the change that makes us a stronger team and organization.\n\nCare Wholeheartedly – We prioritize the well-being of the animals, our team, our communities, and our planet.\n\nBe Sustainable – We care deeply about wildlife and conservation and are committed to sharing that passion with others. Strive to be more sustainable in each decision and action. Website http://www.centralfloridazoo.org/ External link for Central Florida Zoo & Botanical Gardens Industry Non-profit Organizations Company size 51-200 employees Headquarters Sanford, Florida Type Nonprofit Founded 1975 Locations Primary 3755 W Seminole Blvd Sanford, Florida 32771, US Get directions Employees at Central Florida Zoo & Botanical Gardens Richard Glover, Jr. Executive Leader Richard Riga Executive Vice President, AnswerX Rosie Miller Chief Development Officer Dawn Danzi Education Manager at Central Florida Zoo & Botanical Gardens See all employees Updates Central Florida Zoo & Botanical Gardens 2,343 followers 1mo Report this post We're #hiring a new Associate Veterinarian in Sanford, Florida. Apply today or share this post with your network. Associate Veterinarian Central Florida Zoo & Botanical Gardens, Sanford, FL 2 Like Comment Share Central Florida Zoo & Botanical Gardens 2,343 followers 2mo Report this post We’re #hiring . Know anyone who might be interested? Please submit your cover letter and resume to HR@centralfloridazoo.org Development Database Specialist Central Florida Zoo & Botanical Gardens, Sanford, FL 13 Like Comment Share Central Florida Zoo & Botanical Gardens 2,343 followers 4mo Report this post We're looking for an experienced and talented Safety & Security Manager to join our team. Attraction experience is a plus, and zoo experience is a big plus. https://lnkd.in/eUUxbBRt Safety & Security Manager Central Florida Zoo & Botanical Gardens, Sanford, FL 3 1 Comment Like Comment Share Central Florida Zoo & Botanical Gardens 2,343 followers 6mo Report this post We're #hiring a new Chief Development Officer in Sanford, Florida. Apply today or share this post with your network. Chief Development Officer Central Florida Zoo & Botanical Gardens, Sanford, FL 12 1 Comment Like Comment Share Central Florida Zoo & Botanical Gardens 2,343 followers 8mo Report this post We're looking for a talented and experienced educator to join our leadership team. It's an opportunity to impact a lot of lives and help further the zoo's mission of conservation and education. Director of Education Central Florida Zoo & Botanical Gardens, Sanford, FL 12 Like Comment Share Central Florida Zoo & Botanical Gardens 2,343 followers 9mo Report this post We're #hiring . We're looking for an experienced, dynamic fundraising leader to join our growing team and help support our conservation and education mission. Chief Development Officer Central Florida Zoo & Botanical Gardens, Sanford, FL 32 Like Comment Share Central Florida Zoo & Botanical Gardens 2,343 followers 9mo Report this post We're #hiring an experienced operations pro, ideally with significant previous experience at attractions, to be our new Chief Operating Officer in Sanford, Florida. Apply today or share this post with your network. Chief Operating Officer Central Florida Zoo & Botanical Gardens, Sanford, FL 38 2 Comments Like Comment Share Central Florida Zoo & Botanical Gardens 2,343 followers 10mo Report this post We're #hiring a talented, experienced Human Resources Associate to join the Zoo's growing team in Sanford, Florida. Be part of an organization that's doing impactful conservation and education work. Apply today or share this post with your network. Human Resources Associate Central Florida Zoo & Botanical Gardens, Sanford, FL 4 Like Comment Share Join now to see what you are missing Find people you know at Central Florida Zoo & Botanical Gardens Browse recommended jobs for you View all updates, news, and articles Join now Similar pages Brevard Zoo Museums, Historical Sites, and Zoos Melbourne, FL Orlando Science Center Museums, Historical Sites, and Zoos Orlando, FL Orlando Museum of Art Museums Orlando, Florida ZooTampa at Lowry Park Hospitality Tampa, FL The Florida Aquarium Museums, Historical Sites, and Zoos Tampa, FL Dr. Phillips Center for the Performing Arts Performing Arts Orlando, FL Jacksonville Zoo and Botanical Gardens Recreational Facilities Jacksonville, Florida SSA Group Hospitality Denver, CO Florida State Parks Foundation Non-profit Organizations Tallahassee, Florida Visit Orlando Travel Arrangements Orlando, Florida Show more similar pages Show fewer similar pages Browse jobs Director of Continuing Education jobs 3,896 open jobs Education Manager jobs 79,259 open jobs Reading Specialist jobs 10,678 open jobs Educational Consultant jobs 3,801 open jobs Director of Learning jobs 14,544 open jobs Instructional Designer jobs 5,603 open jobs Academic jobs 306,913 open jobs Online Tutor jobs 190,128 open jobs Animal Keeper jobs 3,422 open jobs Researcher jobs 195,654 open jobs Associate Product Manager jobs 76,300 open jobs Construction Specialist jobs 43,818 open jobs Director of Education jobs 50,568 open jobs Director jobs 1,220,357 open jobs Senior Manager jobs 181,836 open jobs Coordinator jobs 545,033 open jobs Intern jobs 71,196 open jobs Machine Operator jobs 24,475 open jobs Manager jobs 1,880,925 open jobs Procurement Specialist jobs 44,900 open jobs Show more jobs like this Show fewer jobs like this More searches More searches Director jobs General Manager jobs Director of Education jobs Editor jobs Planning Assistant jobs Teacher jobs President jobs Vice President jobs Senior Manager jobs Education Manager jobs Animal Technician jobs Wildlife Biologist jobs Manager jobs Builder jobs Technician jobs Human Resources Intern jobs Naturalist jobs Guide jobs Education Coordinator jobs Interpreter jobs Advocacy Manager jobs Bookkeeper jobs Legislative Assistant jobs Government Affairs Specialist jobs Officer jobs Director of Professional Development jobs Policy Analyst jobs Professor jobs Education Instructor jobs Professor of Education jobs Assistant Superintendent jobs Human Resources Generalist jobs Operational Specialist jobs Talent Acquisition Specialist jobs Human Resources Specialist jobs Program Specialist jobs Contract Analyst jobs Corporate Trainer jobs Executive jobs Learning And Development Specialist jobs Property Accountant jobs Instructional Designer jobs Accounts Payable Specialist jobs Business Development Representative jobs Chief Executive Officer jobs Learning Center Director jobs Business Development Specialist jobs Preschool Director jobs Accountant jobs Executive Director jobs Biologist jobs Coordinator jobs Museum Educator jobs Park Ranger jobs Assistant jobs Digital Marketing Specialist jobs Legal Administrator jobs Administrative Coordinator jobs Videographer jobs Copywriter jobs LinkedIn © 2025 About Accessibility User Agreement Privacy Policy Cookie Policy Copyright Policy Brand Policy Guest Controls Community Guidelines العربية (Arabic) বাংলা (Bangla) Čeština (Czech) Dansk (Danish) Deutsch (German) Ελληνικά (Greek) English (English) Español (Spanish) فارسی (Persian) Suomi (Finnish) Français (French) हिंदी (Hindi) Magyar (Hungarian) Bahasa Indonesia (Indonesian) Italiano (Italian) עברית (Hebrew) 日本語 (Japanese) 한국어 (Korean) मराठी (Marathi) Bahasa Malaysia (Malay) Nederlands (Dutch) Norsk (Norwegian) ਪੰਜਾਬੀ (Punjabi) Polski (Polish) Português (Portuguese) Română (Romanian) Русский (Russian) Svenska (Swedish) తెలుగు (Telugu) ภาษาไทย (Thai) Tagalog (Tagalog) Türkçe (Turkish) Українська (Ukrainian) Tiếng Việt (Vietnamese) 简体中文 (Chinese (Simplified)) 正體中文 (Chinese (Traditional)) Language Agree & Join LinkedIn By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to see who you already know at Central Florida Zoo & Botanical Gardens Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy ."
    },
    {
      "url": "https://www.centralfloridazoo.org/about-the-zoo/central-florida-zoological-society/",
      "text": "Central Florida Zoo & Botanical Gardens About The Central Florida Zoological Society Information Skip to Content VISIT ANIMALS SUNSET Toggle navigation Visit General Admission Annual Pass Group Rates Special Discounts Location Zoo Rules Zoo Accessibility Dining Map of the Zoo Animals & Attractions Amphibians Invertebrates Birds Mammals Reptiles Botanical Gardens Barnyard Buddies Petting Zoo Keeper Chats Giraffe Feeding Wharton-Smith Tropical Splash Ground Private Experiences Wild Explorer VR Experience Events Education School & Group Programs K-3 STEM Programs Ambassador Animal Experiences Tours Create Your Own ZOOventure Camp Information Children & Adult Programs Nighttime Adventures Family and Adult Programs Homeschool ZOOventure Programs Scout Programs Resources and Activities Zoo to You! Videos and Outreach Programs Preschool – Adult In Person & Virtual Outreach Programs Zoo to You! Video Series ZOOper Birthday Parties Venue Rental Get Involved Donate Commemorate Protect Partner Adopt an Animal Internship Opportunities Volunteer Opportunities Donate Search for: Subscribe to our newsletter News Media Events ZOOper Birthday Parties Venue Rental About the Zoo Subscribe to our newsletter Visit Admission & Hours Annual Pass Group Rates Special Discounts Group Location Zoo Rules Zoo Accessibility Dining Shopping Map of the Zoo Animals & Attractions Animals Group 1 Animals Amphibians Invertebrates Birds Mammals Reptiles Botanical Gardens 🌿 Botanical Garden Tours Animals Group 2 Attractions Wild Explorer VR Experience Giraffe Feeding Barnyard Buddies Wharton-Smith Tropical Splash Ground Train Ride Keeper Chats Private Experiences Education and Conservation Education Group 1 School & Group Programs K-3 STEM Programs Ambassador Animal Experiences Tours Create Your Own ZOOventure Camp Information Spring Camps Summer Camps Education Group 2 Children & Adult Programs Homeschool ZOOventures Cub Club Nighttime Adventures Family and Adult Programs Scout Programs Teacher Workshops Resources and Activities Education Group 3 Zoo to You! Videos and Outreach Programs Outreach Programs Zoo to You! Video Series Conservation Initiatives Orianne Center for Indigo Conservation (OCIC) Conservation Days at the Zoo Get Involved Donate Group 1 Donate There Is No Zoo Without You Commemorate Your gift can change our world. Donate Group 2 Protect Conservation in action Partner Help the Zoo make a difference Donate Group 3 Internship Opportunities Adopt an Animal Message from an Animal Volunteer Opportunities Tickets Donate × Central Florida Zoological Society Acting on behalf of wildlife. Central Florida Zoo & Botanical Gardens › About the Zoo › Central Florida Zoological Society About the Central Florida Zoological Society A 501(c)3, non-profit education and conservation organization that operates the Central Florida Zoo & Botanical Gardens in Sanford, FL. The Zoo was founded in 1923 and enjoyed a rich & storied history in downtown Sanford, prior to moving to its current location across from Lake Monroe in the summer of 1975. Twenty-three acres of the property feature lush plantings and space dedicated to the care of the 350 animals representing over 100 species in our collection. The Central Florida Zoological Society, Inc. is governed by a 21-member Board of Trustees, chaired by Chandler Robertson of Sanford, Florida. Finances & Effectiveness: The Central Florida Zoological Society, Inc. is a smart choice for charitable giving and consistently receives high ratings from the independent rating service, Charity Navigator . The Central Florida Zoological Society, Inc. operates the Central Florida Zoo & Botanical Gardens. Contributions are tax deductible to the extent allowed by law. We strive to keep fundraising and administrative costs to a minimum, so that more of the contributions we receive can go directly to program support. Information on the Central Florida Zoological Society, Inc.’s most recently completed fiscal years, which run from July 1 through June 30, are provided below. Form 990 Filing 2023 | 2022 | 2021 | 2020 | 2019 | 2018 | 2017 | 2017 – Short Year | 2016 Audited Financial Statements 2023 | 2022 | 2021 | 2020 | 2019 | 2018 | 2017 | 2017 – Short Year | 2016 Key Staff Members: Richard Glover, Chief Executive Officer Robert Chabot, Chief Operation Officer Stephen Gensel Jr. , Chief Financial Officer Rosie Miller , Chief Development Officer James E. Bogan Jr., DVM, DABVP, CertAqV, Chief Veterinary Officer and Director, Orianne Center for Indigo Conservation Anthony Guastella, Director, Park Operations Maggie Holley, Director, Education Paul Pagello, Director, Facilities Will Wellons, Director, Marketing & Communications Emilie Alfonso , Manager, Volunteers Erin Bussom, Curator& Acting Director, Animal Care Shelly Allen , Development Officer Anita Coogan , Manager, Gift Shop Dawn Danzi , Manager, Education Justin Dempsey , Manager, Attractions Cindi Eberhart, Manager, Human Resources Matthew Eldridge , Manager, Marketing & Communications Dave Michaud, Manager, IT Kendall Turnipseed , Manager, Events Devin Walsh, Manager, Safety & Security Additional Zoo Contacts: Private Events events@centralfloridazoo.org Marketing and Advertising marketing@centralfloridazoo.org Volunteer Services volunteers@centralfloridazoo.org Zoo Annual Passes membership@centralfloridazoo.org Donations development@centralfloridazoo.org Please send all media requests via email to press@centralfloridazoo.org . Central Florida Zoological Society Board of Trustees Chair: Judy Desrosiers, Orlando Sanford International Airport Vice Chair: Carrie Vanderhoef, Wekiva Island Secretary: Esther McIlvain, Hawkers Asian Street Food Treasurer: Robert Connelly, Carr, Riggs & Ingram LLC Members, in Alphabetical Order: Brendan Burke, Merrill Lynch Bank of America Commissioner Lee Constantine, Seminole County Board of County Commissioners Traci Houchin, City of Sanford Tom Laputka, Retired Jeremy McCauley, Appliances of Orlando Inc. Alecia Meulendyk, Self-Help Credit Union Geoffrey Moore, Moore Payne Law Robert Morrison, Morrison VFS Trenton Newton, Contract Land Staff, LLC Abby Sanchez, Chair, Seminole County Public Schools Tim Smith, Wharton-Smith, Inc. Samuel Weissman, Weissman / Paul, PLLC Proud member of The Seminole County Regional Chamber of Commerce The DeLand Area Chamber of Commerce News Zoo Boo Bash, presented by Orlando Health, returns for... Read More Top tips for a day at the best zoo in Florida Read More Central Florida Zoo welcomes rare Fossa cubs Read More Contact Us Careers Privacy Policy Donor Privacy Gift Guidelines Central Florida Zoo & Botanical Gardens 3755 W. Seminole Blvd. Sanford, FL 32771 407.323.4450 | information@centralfloridazoo.org x"
    },
    {
      "url": "https://business.seminolebusiness.org/news/details/central-florida-zoo-botanical-gardens-welcomes-new-coo",
      "text": "Central Florida Zoo & Botanical Gardens Welcomes New COO - Member News - Seminole County Chamber Skip to content Join Why Join Member Benefits Apply Now Events Chamber Calendar Community Calendar Directory Full Directory Membership Map Restaurants Government & Education Non-profits Health Care Meeting Facilities Banking & Finance Our Groups Ambassadors Area Councils Chamber Committees Your Savings News Community News Chamber News Expert Advice Government News About Us Board Staff Trustees Other programs ChamberCast Certificate of Origin I’m Here! Chamber Crush Jobs Privacy Policy Contact Us Central Florida Zoo & Botanical Gardens Welcomes New COO March 20, 2025 Member The Central Florida Zoo & Botanical Gardens is looking toward the future and strengthening its leadership team with the appointment of an industry veteran. With nearly three decades of experience in zoo operations, horticulture and conservation, Bob Chabot brings a wealth of knowledge to the role of Chief Operating Officer, particularly in Florida where he played a key part in shaping Jacksonville Zoo and Gardens. “We are thrilled to welcome Bob Chabot to the Central Florida Zoo & Botanical Gardens as our new COO,” said Richard E. Glover, Jr., CEO. “As we look toward the future of the Zoo, Bob’s extensive background makes him a valuable addition, and his experience will improve efficiencies and further our conservation efforts and overall guest experience.” As a respected leader in the zoological and botanical fields, Chabot brings deep-rooted experience in Florida. He spent more than a decade at Jacksonville Zoo and Gardens, where he served as Director of Horticulture, Facilities, and Exhibits from 2006 to 2017. During that time, he played a lead role in the design and execution of major construction and landscape projects, as well as special exhibits. Prior to that, Chabot served as Director of Horticulture at Jacksonville Zoo and Gardens, managing the design, installation, and maintenance of landscapes, gardens, and exhibits while leading educational tours and presentations. “I’m excited to bring my nearly 30 years of experience to the Central Florida Zoo & Botanical Gardens and support the critical conservation related work of the Zoo,” Chabot said. “I hope to build on the Zoo’s mission with storytelling in a way that inspires guests to take action on behalf of wildlife and the environment.” Chabot most recently served as Chief Operating Officer at Zoo New England, where he managed the day-to-day operations of Franklin Park Zoo in Boston and Stone Zoo in Stoneham, Massachusetts. He also previously held the role of Director of Horticulture at the New England Botanical Gardens in Providence, Rhode Island. Chabot succeeds Stephanie Williams, who retired after 25 years at the Zoo. Under Williams’ leadership, the Zoo saw significant growth in guest engagement, conservation initiatives and facility improvements. In his new role with the Central Florida Zoo & Botanical Gardens, Chabot will oversee the Zoo’s daily operations and strategic initiatives aimed at advancing the Zoo’s mission of conservation and education. He will also focus on optimizing operational efficiencies and elevating the Zoo’s botanical gardens, as well as improving visitor experience. For more information about the Central Florida Zoo & Botanical Gardens, visit www.centralfloridazoo.org . To view or download Bob Chabot’s headshot, click here . About the Central Florida Zoo & Botanical Gardens The Central Florida Zoo & Botanical Gardens is home to more than 350 animals in Sanford, Florida. As a not-for-profit organization, it is a leader in conservation, creating connections that inspire people to take action for wildlife. More information is available at www.centralfloridazoo.org . Central Florida Zoo & Botanical Gardens Shelly Allen Development Officer March 20, 2025 (407) 356-2210 Send Email Business Directory News Releases Events Calendar Hot Deals Member To Member Deals Marketspace Job Postings Contact Us Information & Brochures Join The Chamber Share × Print Facebook Twitter LinkedIn Close © 2025 Seminole County Chamber | Site by GrowthZone Privacy Policy Contact Us 407.708.4600 1055 AAA Drive, Suite 153, Heathrow, FL 32746 info@seminolebusiness.org © Seminole County Chamber.  All Rights Reserved. Site by GrowthZone Scroll To Top"
    },
    {
      "url": "https://www.centralfloridazoo.org/visit/location/",
      "text": "Central Florida Zoo & Botanical Gardens Location - Central Florida Zoo & Botanical Gardens Skip to Content VISIT ANIMALS SUNSET Toggle navigation Visit General Admission Annual Pass Group Rates Special Discounts Location Zoo Rules Zoo Accessibility Dining Map of the Zoo Animals & Attractions Amphibians Invertebrates Birds Mammals Reptiles Botanical Gardens Barnyard Buddies Petting Zoo Keeper Chats Giraffe Feeding Wharton-Smith Tropical Splash Ground Private Experiences Wild Explorer VR Experience Events Education School & Group Programs K-3 STEM Programs Ambassador Animal Experiences Tours Create Your Own ZOOventure Camp Information Children & Adult Programs Nighttime Adventures Family and Adult Programs Homeschool ZOOventure Programs Scout Programs Resources and Activities Zoo to You! Videos and Outreach Programs Preschool – Adult In Person & Virtual Outreach Programs Zoo to You! Video Series ZOOper Birthday Parties Venue Rental Get Involved Donate Commemorate Protect Partner Adopt an Animal Internship Opportunities Volunteer Opportunities Donate Search for: Subscribe to our newsletter News Media Events ZOOper Birthday Parties Venue Rental About the Zoo Subscribe to our newsletter Visit Admission & Hours Annual Pass Group Rates Special Discounts Group Location Zoo Rules Zoo Accessibility Dining Shopping Map of the Zoo Animals & Attractions Animals Group 1 Animals Amphibians Invertebrates Birds Mammals Reptiles Botanical Gardens 🌿 Botanical Garden Tours Animals Group 2 Attractions Wild Explorer VR Experience Giraffe Feeding Barnyard Buddies Wharton-Smith Tropical Splash Ground Train Ride Keeper Chats Private Experiences Education and Conservation Education Group 1 School & Group Programs K-3 STEM Programs Ambassador Animal Experiences Tours Create Your Own ZOOventure Camp Information Spring Camps Summer Camps Education Group 2 Children & Adult Programs Homeschool ZOOventures Cub Club Nighttime Adventures Family and Adult Programs Scout Programs Teacher Workshops Resources and Activities Education Group 3 Zoo to You! Videos and Outreach Programs Outreach Programs Zoo to You! Video Series Conservation Initiatives Orianne Center for Indigo Conservation (OCIC) Conservation Days at the Zoo Get Involved Donate Group 1 Donate There Is No Zoo Without You Commemorate Your gift can change our world. Donate Group 2 Protect Conservation in action Partner Help the Zoo make a difference Donate Group 3 Internship Opportunities Adopt an Animal Message from an Animal Volunteer Opportunities Tickets Donate × Location Find your way to wild. Central Florida Zoo & Botanical Gardens › Visit › Location Central Florida Zoo & Botanical Gardens 3755 W. Seminole Blvd. Sanford, Florida 32771 Getting Here Orlando On I-4 , travel east to Exit 104 (HWY 17-92). Take a left off of exit ramp onto 17-92. The Zoo is 1/8 mile on the right on HWY 17-92. On the Central Florida Greenway (417) , travel north until it ends in Sanford at I-4. Head east on I-4 to Exit 104 (HWY 17-92). Take a left off the exit ramp onto 17-92. The Zoo is 1/8 mile on the right on HWY 17-92. Volusia County On I-4 , travel west to Exit 104. Exit right off the ramp onto HWY 17-92. The Zoo is 1/4 mile on the right. On HWY 17-92 , travel south through Volusia County toward Sanford. The Zoo is on the right side, just past the St. Johns River Bridge. Brevard County Take Interstate 95 to State Road 46, Exit 81 (Sanford/Mims). Travel west to Sanford. Turn right on HWY 17-92 and follow through Sanford and around the lakefront. The Zoo is two miles past the Central Florida Regional Hospital on the left. Lake County Take Highway 441 south to State Road 46. Go east on 46 to Interstate 4. Take I-4 east one exit. Exit at #104. Follow the signs to the Zoo. _______________________________________________________________________________________________________________________________________________________________________________ Learn more about I-4 Express and get updates here . News Zoo Boo Bash, presented by Orlando Health, returns for... Read More Top tips for a day at the best zoo in Florida Read More Central Florida Zoo welcomes rare Fossa cubs Read More Contact Us Careers Privacy Policy Donor Privacy Gift Guidelines Central Florida Zoo & Botanical Gardens 3755 W. Seminole Blvd. Sanford, FL 32771 407.323.4450 | information@centralfloridazoo.org x"
    },
    {
      "url": "https://www.centralfloridazoo.org/employment-opportunities/careers/",
      "text": "Central Florida Zoo & Botanical Gardens Careers - Central Florida Zoo & Botanical Gardens Skip to Content VISIT ANIMALS SUNSET Toggle navigation Visit General Admission Annual Pass Group Rates Special Discounts Location Zoo Rules Zoo Accessibility Dining Map of the Zoo Animals & Attractions Amphibians Invertebrates Birds Mammals Reptiles Botanical Gardens Barnyard Buddies Petting Zoo Keeper Chats Giraffe Feeding Wharton-Smith Tropical Splash Ground Private Experiences Wild Explorer VR Experience Events Education School & Group Programs K-3 STEM Programs Ambassador Animal Experiences Tours Create Your Own ZOOventure Camp Information Children & Adult Programs Nighttime Adventures Family and Adult Programs Homeschool ZOOventure Programs Scout Programs Resources and Activities Zoo to You! Videos and Outreach Programs Preschool – Adult In Person & Virtual Outreach Programs Zoo to You! Video Series ZOOper Birthday Parties Venue Rental Get Involved Donate Commemorate Protect Partner Adopt an Animal Internship Opportunities Volunteer Opportunities Donate Search for: Subscribe to our newsletter News Media Events ZOOper Birthday Parties Venue Rental About the Zoo Subscribe to our newsletter Visit Admission & Hours Annual Pass Group Rates Special Discounts Group Location Zoo Rules Zoo Accessibility Dining Shopping Map of the Zoo Animals & Attractions Animals Group 1 Animals Amphibians Invertebrates Birds Mammals Reptiles Botanical Gardens 🌿 Botanical Garden Tours Animals Group 2 Attractions Wild Explorer VR Experience Giraffe Feeding Barnyard Buddies Wharton-Smith Tropical Splash Ground Train Ride Keeper Chats Private Experiences Education and Conservation Education Group 1 School & Group Programs K-3 STEM Programs Ambassador Animal Experiences Tours Create Your Own ZOOventure Camp Information Spring Camps Summer Camps Education Group 2 Children & Adult Programs Homeschool ZOOventures Cub Club Nighttime Adventures Family and Adult Programs Scout Programs Teacher Workshops Resources and Activities Education Group 3 Zoo to You! Videos and Outreach Programs Outreach Programs Zoo to You! Video Series Conservation Initiatives Orianne Center for Indigo Conservation (OCIC) Conservation Days at the Zoo Get Involved Donate Group 1 Donate There Is No Zoo Without You Commemorate Your gift can change our world. Donate Group 2 Protect Conservation in action Partner Help the Zoo make a difference Donate Group 3 Internship Opportunities Adopt an Animal Message from an Animal Volunteer Opportunities Tickets Donate × Central Florida Zoo & Botanical Gardens › Employment Opportunities › Careers Careers Come Spend the day with Us. Volunteer Internships It’s a question team members of the Central Florida Zoo & Botanical Gardens get asked most frequently: How can I get a job at the Zoo? Many people have a passion for animals, but one of the most important qualifications for a position on the Zoo team is a commitment to our mission to be an education and conservation resource providing experiences that excite and inspire children and adults to learn and act on behalf of wildlife. As a non-profit organization, the Central Florida Zoo & Botanical Gardens has many employment opportunities throughout the year in various departments including Animal Care, Education, Guest Experience, Horticulture, Facilities/Maintenance, as well as Administration. Join us at the Zoo! Thank you for your interest in a position with the Central Florida Zoo & Botanical Gardens! Please view open positions below. Please email your resume, cover letter & 3 professional references to HR@CentralFloridaZoo.org and indicate which position you are interested in. Please note that a cover letter is required for consideration . Facilities: Groundskeeper – Full Time & Part Time Positions Available Special Opportunity for Veterinary Post-Graduates: 1-Year Veterinary Internship in Zoo Medicine Veterinary: Associate Veterinarian SSA Group Opportunities SSA Group is a third-party vendor that handles ticketing and food & beverage at the Central Florida Zoo & Botanical Gardens. SSA Staff are not employed by the Central Florida Zoo & Botanical Gardens. There are no SSA Group opportunities posted at this time. Don’t see what you’re looking for? Click here for volunteer opportunities. All other job openings will be posted to Indeed or the Association of Zoos & Aquariums (AZA). Please visit those sites for information on employment opportunities. How do I apply? Applications should be submitted as directed for each open position. Follow-up calls are not accepted. The Central Florida Zoo & Botanical Gardens and the Orianne Center for Indigo Conservation are operated by the Central Florida Zoological Society, Inc. (CFZS), a 501(c)3 non-profit organization. We are an Equal Opportunity Employer and a Drug-Free Workplace. A pre-employment drug test will be performed. Equal Employment Opportunity The Central Florida Zoological Society is an equal opportunity employer and makes decisions related to compensation and all terms, conditions, or privileges of employment on the basis of merit. Company policy prohibits unlawful discrimination based on race, color, creed, sex (including pregnancy), gender orientation, religion, marital status, age, national origin or ancestry, physical or mental disability, medical condition, genetic characteristic, military status, or any other consideration made unlawful by federal, state or local laws. All such discrimination is unlawful and prohibited by the CFZS. Contact Us Careers Privacy Policy Donor Privacy Gift Guidelines Central Florida Zoo & Botanical Gardens 3755 W. Seminole Blvd. Sanford, FL 32771 407.323.4450 | information@centralfloridazoo.org x"
    },
    {
      "url": "https://www.centralfloridazoo.org/spacerental/",
      "text": "Central Florida Zoo & Botanical Gardens Space Rental - Central Florida Zoo & Botanical Gardens Skip to Content VISIT ANIMALS SUNSET Toggle navigation Visit General Admission Annual Pass Group Rates Special Discounts Location Zoo Rules Zoo Accessibility Dining Map of the Zoo Animals & Attractions Amphibians Invertebrates Birds Mammals Reptiles Botanical Gardens Barnyard Buddies Petting Zoo Keeper Chats Giraffe Feeding Wharton-Smith Tropical Splash Ground Private Experiences Wild Explorer VR Experience Events Education School & Group Programs K-3 STEM Programs Ambassador Animal Experiences Tours Create Your Own ZOOventure Camp Information Children & Adult Programs Nighttime Adventures Family and Adult Programs Homeschool ZOOventure Programs Scout Programs Resources and Activities Zoo to You! Videos and Outreach Programs Preschool – Adult In Person & Virtual Outreach Programs Zoo to You! Video Series ZOOper Birthday Parties Venue Rental Get Involved Donate Commemorate Protect Partner Adopt an Animal Internship Opportunities Volunteer Opportunities Donate Search for: Subscribe to our newsletter News Media Events ZOOper Birthday Parties Venue Rental About the Zoo Subscribe to our newsletter Visit Admission & Hours Annual Pass Group Rates Special Discounts Group Location Zoo Rules Zoo Accessibility Dining Shopping Map of the Zoo Animals & Attractions Animals Group 1 Animals Amphibians Invertebrates Birds Mammals Reptiles Botanical Gardens 🌿 Botanical Garden Tours Animals Group 2 Attractions Wild Explorer VR Experience Giraffe Feeding Barnyard Buddies Wharton-Smith Tropical Splash Ground Train Ride Keeper Chats Private Experiences Education and Conservation Education Group 1 School & Group Programs K-3 STEM Programs Ambassador Animal Experiences Tours Create Your Own ZOOventure Camp Information Spring Camps Summer Camps Education Group 2 Children & Adult Programs Homeschool ZOOventures Cub Club Nighttime Adventures Family and Adult Programs Scout Programs Teacher Workshops Resources and Activities Education Group 3 Zoo to You! Videos and Outreach Programs Outreach Programs Zoo to You! Video Series Conservation Initiatives Orianne Center for Indigo Conservation (OCIC) Conservation Days at the Zoo Get Involved Donate Group 1 Donate There Is No Zoo Without You Commemorate Your gift can change our world. Donate Group 2 Protect Conservation in action Partner Help the Zoo make a difference Donate Group 3 Internship Opportunities Adopt an Animal Message from an Animal Volunteer Opportunities Tickets Donate × Central Florida Zoo & Botanical Gardens › Space Rental Space Rental Host your next gathering at the Zoo. Contact Us to Host Your Event at the Zoo Host your group at the Wayne M. Densch Discovery Center at the Central Florida Zoo & Botanical Gardens. This versatile event space features an outdoor courtyard, covered porch, and a 3,400 square foot banquet hall. You can also enjoy your function immersed in natural surroundings at the Rainforest Pavilion. This private, covered facility has seating for up to 200, a kitchenette, private restrooms, and plenty of space for games and activities. It is available from February 1 – October 10 of each year. Come see us! Site visits are available 7 days a week. For more information, send an email to events@centralfloridazoo.org or call 407-323-4450 ext. 103. Corporate Meetings and Functions Whether your group is 25 or 200, the Central Florida Zoo & Botanical Gardens has the space and equipment you need to host the perfect meeting, staff retreat, holiday party, or company picnic. In addition to the space, we also offer audio visual and projection equipment, a stage, and other add-ons to meet all of your event needs. We do the heavy lifting! The room is set up by our incredible staff so that you can focus on your program and guests. Weddings Located in Sanford, Florida, the Central Florida Zoo & Botanical Gardens is ideally situated close to Orlando’s main attractions, and is adjacent to I-4 for ease of travel and transportation. We have many different venue spaces to suit weddings of any style. We offer both indoor and outdoor ceremonies, a reception space, as well as small wedding spaces. The possibilities are endless here, and the Zoo’s natural surroundings make for beautiful and unique photography. Our events team is here to make sure your special day goes smoothly, and our caterers are fully versed in delighting everyone’s taste buds. Let us help create your happy ending when you say “I Do” at the Central Florida Zoo! Social Events Your family, friends, and employees will have the time of their lives when you invite them to our Zoo for your life celebrations, company picnics, and family reunions. We have the ideal menus to provide your social event a delicious touch, and all sorts of fun things for people of all ages to indulge in. Our inside spaces and outdoor spaces will suit your needs any time of year. Group rates, scavenger hunts, giraffe feedings, and much more will give your guests a memorable experience they’ll be eager to repeat. Come have fun with us at the Central Florida Zoo! Venues The Wayne M. Densch Discovery Center is home to our Safari Room, a large banquet hall perfect for parties or corporate meetings. Attached to that space is our beautiful, rustic covered porch, perfect for mingling or a hosted bar. Just past the porch you’ll see our Gazebo Courtyard. This space is surrounded by lush, seasonal flowers and greenery, making it the ideal location for a wedding ceremony. Inside the lobby you’ll find our Insect Zoo; with a hair-raising ambiance, any event held here will be unforgettable. Dimming lights, staging, cocktail tables, and more are set up by our event staff so that you can focus on having fun! The Rainforest Pavilion is tucked away under our magnificent canopy of trees near the front of the property. It is fully covered, and our large trees keep the space shaded and cool year-round. With nearby parking and plenty of outdoor space, this is the perfect venue for a company picnic or family event, giving you access to private restrooms and a kitchenette. Make Your Event Unforgettable At the Zoo, we don’t just offer you a space to host your event — we offer you unforgettable experiences! Bundle any of these add-ons into your event: -Giraffe Feedings -Animal Encounters -Team Building Scavenger Hunt -Seminole Aerial Adventures -Tours -Night Hikes Audio Visual Equipment Available: -Anchor Podium -Wireless Microphones -Overhead Speakers -Wi-Fi -Projection Equipment -Wireless Slide Remote -Laptop Computer ZOOper Birthday Parties Most of us have cherished birthday party memories that last us a lifetime. This is your opportunity to help the little ones in your life have their own unforgettable moments. Bring the whole family and plenty of friends to the Zoo for the most exciting, stress-free, and WILD party around! Read More Contact Us Careers Privacy Policy Donor Privacy Gift Guidelines Central Florida Zoo & Botanical Gardens 3755 W. Seminole Blvd. Sanford, FL 32771 407.323.4450 | information@centralfloridazoo.org x"
    },
    {
      "url": "https://www.centralfloridazoo.org/",
      "text": "Central Florida Zoo & Botanical Gardens Central Florida Zoo & Botanical Gardens in Sanford, FL Skip to Content VISIT ANIMALS SUNSET Toggle navigation Visit General Admission Annual Pass Group Rates Special Discounts Location Zoo Rules Zoo Accessibility Dining Map of the Zoo Animals & Attractions Amphibians Invertebrates Birds Mammals Reptiles Botanical Gardens Barnyard Buddies Petting Zoo Keeper Chats Giraffe Feeding Wharton-Smith Tropical Splash Ground Private Experiences Wild Explorer VR Experience Events Education School & Group Programs K-3 STEM Programs Ambassador Animal Experiences Tours Create Your Own ZOOventure Camp Information Children & Adult Programs Nighttime Adventures Family and Adult Programs Homeschool ZOOventure Programs Scout Programs Resources and Activities Zoo to You! Videos and Outreach Programs Preschool – Adult In Person & Virtual Outreach Programs Zoo to You! Video Series ZOOper Birthday Parties Venue Rental Get Involved Donate Commemorate Protect Partner Adopt an Animal Internship Opportunities Volunteer Opportunities Donate Search for: Subscribe to our newsletter News Media Events ZOOper Birthday Parties Venue Rental About the Zoo Subscribe to our newsletter Visit Admission & Hours Annual Pass Group Rates Special Discounts Group Location Zoo Rules Zoo Accessibility Dining Shopping Map of the Zoo Animals & Attractions Animals Group 1 Animals Amphibians Invertebrates Birds Mammals Reptiles Botanical Gardens 🌿 Botanical Garden Tours Animals Group 2 Attractions Wild Explorer VR Experience Giraffe Feeding Barnyard Buddies Wharton-Smith Tropical Splash Ground Train Ride Keeper Chats Private Experiences Education and Conservation Education Group 1 School & Group Programs K-3 STEM Programs Ambassador Animal Experiences Tours Create Your Own ZOOventure Camp Information Spring Camps Summer Camps Education Group 2 Children & Adult Programs Homeschool ZOOventures Cub Club Nighttime Adventures Family and Adult Programs Scout Programs Teacher Workshops Resources and Activities Education Group 3 Zoo to You! Videos and Outreach Programs Outreach Programs Zoo to You! Video Series Conservation Initiatives Orianne Center for Indigo Conservation (OCIC) Conservation Days at the Zoo Get Involved Donate Group 1 Donate There Is No Zoo Without You Commemorate Your gift can change our world. Donate Group 2 Protect Conservation in action Partner Help the Zoo make a difference Donate Group 3 Internship Opportunities Adopt an Animal Message from an Animal Volunteer Opportunities Tickets Donate × ZOO HOURS: OPEN 9 AM - 4 PM UPCOMING EVENTS - September 10, 2025 Storytime at the Zoo! – September Listen to stories and meet an Animal Ambassador up-close during this exciting FREE program! UPCOMING EVENTS - September 12, 2025 Free Admission for Our First Responders On Friday, September 12, the Central Florida Zoo & Botanical Gardens will honor the brave men and women who keep our community safe. As a heartfelt thank-you, all first responders will receive… UPCOMING EVENTS - September 20, 2025 PJ’s Goodbye Party | World Rhino Day Celebrate PJ and rhinos worldwide at the Central Florida Zoo! UPCOMING EVENTS - September 26, 2025 Sunset at the Zoo: Celebrating Hispanic Heritage CELEBRATING HISPANIC CULTURE (En español abajo) Presented by   Entertainment sponsored by   Join us at the Central Florida Zoo & Botanical Gardens for our final Sunset at the Zoo event of… UPCOMING EVENTS - October 4, 2025 Scouting America Merit Badge Day Participate in these exciting interactive programs that will help you to earn your Reptile & Amphibian or Mammal Study merit badge. Supplies will be provided. Space is limited. Date:  October 4, 2025… UPCOMING EVENTS - October 4, 2025 🌿 Botanical Garden Tour – October Join us for a guided stroll through the Central Florida Zoo’s lush grounds during our Botanical Garden Tour on Saturday, October 4. Led by one of our expert horticulture technicians, this one-hour… View More Events Donate Show your support for the Zoo. Learn More Education Making learning a hands-on, wildly fun experience. With education programs for all ages, the Central Florida Zoo makes growing your knowledge of local, endangered and exotic species feel like an adventure you will never want to end. From up-close animal encounters and Zoo Camps to overnight adventures to see the Zoo’s wild residents after dark, you’re sure to find the perfect program for you, your kids or your class. View Programs Careers Come Spend the day with Us. Available Opportunities Use #CentralFloridaZoo on Instagram We want to see your wild Central Florida Zoo adventure! Share your best snapshots on Instagram using #CentralFloridaZoo and your photo might just get featured on our social channels! Load More Contact Us Careers Privacy Policy Donor Privacy Gift Guidelines Central Florida Zoo & Botanical Gardens 3755 W. Seminole Blvd. Sanford, FL 32771 407.323.4450 | information@centralfloridazoo.org x"
    }
  ]
}