{
  "fuentes": [
    {
      "url": "https://tampamagazines.com/centro-asturiano/",
      "email": "logo_darkmode@2x.png"
    },
    {
      "url": "https://www.centroasturianotampa.org/the-grand-ballroom",
      "email": "seal_weddingwire_small_en_us@2x.png"
    },
    {
      "url": "https://www.centroasturianotampa.org/salon-asturias",
      "email": "seal_weddingwire_small_en_us@2x.png"
    },
    {
      "url": "https://www.centroasturianotampa.org/host-your-event",
      "email": "seal_weddingwire_small_en_us@2x.png"
    },
    {
      "url": "https://www.centroasturianotampa.org/history",
      "email": "seal_weddingwire_small_en_us@2x.png"
    },
    {
      "url": "https://www.centroasturianotampa.org/memorial-park",
      "email": "seal_weddingwire_small_en_us@2x.png"
    },
    {
      "url": "https://www.centroasturianotampa.org/membership",
      "email": "seal_weddingwire_small_en_us@2x.png"
    },
    {
      "url": "https://tampamagazines.com/directory-best_city/listing/centro-asturiano-de-tampa/",
      "email": "logo_darkmode@2x.png"
    },
    {
      "url": "https://www.centroasturianotampa.org/support",
      "email": "seal_weddingwire_small_en_us@2x.png"
    },
    {
      "url": "https://www.tickeri.com/venues/57ab5b00810a25fcd73ecf92",
      "email": "info@tickeri.com"
    },
    {
      "url": "https://www.theatrenantucket.org/about-us/staff-and-board-of-directors",
      "email": "info@theatrenantucket.org"
    },
    {
      "url": "https://www.centroasturianotampa.org/",
      "email": "seal_weddingwire_small_en_us@2x.png"
    },
    {
      "url": "https://www.centroasturianotampa.org/board-of-directors",
      "email": "seal_weddingwire_small_en_us@2x.png"
    },
    {
      "url": "https://www.centroasturianotampa.org/contact",
      "email": "ansley@centroasturianotampa.org"
    },
    {
      "url": "https://www.centroasturianotampa.org/contact",
      "email": "seal_weddingwire_small_en_us@2x.png"
    }
  ],
  "mails": [
    "ansley@centroasturianotampa.org",
    "info@theatrenantucket.org",
    "info@tickeri.com",
    "logo_darkmode@2x.png",
    "seal_weddingwire_small_en_us@2x.png"
  ],
  "nombre_sitio": "centroasturianotampa.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://tampamagazines.com/centro-asturiano/",
      "text": "The Centro Asturiano - Culture Club - Tampa Magazine No Result View All Result Local Knowledge Food & Drink Home & Garden Travel Moving Tampa Sporting Health Tampa Culture ADVERTISE SUBSCRIBE ABOUT PURCHASE A COPY DIGITAL ISSUES EMAIL NEWSLETTERS CONTACT US SHOP MY ACCOUNT Your Membership Profile Update Billing Card Login / Logout No Result View All Result No Result View All Result The newly renovated ballroom. Executive director Ginny Pannier says Columbia restaurant owner Richard Gonzmart said the previous chandelier was too small for the room. Their solution? Install five larger light fixtures. Made in Tampa: Centro Asturiano The history of one of Tampa’s oldest event venues by McKenna Kelley November 20, 2019 Share on Facebook Share on Twitter Daniel Martinez III (left) and Ginny Pannier (right). Pannier grew up visiting the club with her grandfather, who emigrated to the U.S. from Asturias, Spain, via Cuba and Mexico. Martinez says he didn’t spend much time at the club as a child, but his parents have become more involved, and he is on the board of directors. For many in Tampa, the Centro Asturiano — on the corner of Nebraska and Palm — is one of those buildings you’ve driven past hundreds of times, but what’s inside is a total mystery. On any given day, it’s mostly a group of older Tampeños playing cards in the morning and dominoes in the afternoon; a comedian doing stand-up in the theatre; or a bingo game hosted by a drag queen in the ballroom. A walk through its halls is a window into how the club connects Tampa’s past with its present. The Centro Asturiano de Tampa began in 1902 as a branch of the Centro Asturiano de la Habana, founded by a group of immigrants from Asturias, Spain, by way of Havana. The Tampa branch became independent from its Cuban counterpart in 1968 — “for obvious reasons,” the club’s executive director, Ginny Pannier, says with a smile. Like the Italian Club, Cuban Club and Centro Español, the Centro Asturiano was a mutual aid society, an organization designed to give social and medical support to its members, most of whom belonged to the same ethnic group. Now primarily an event venue, the building as it stands today was built in 1914. The club’s original location on Seventh Avenue burned down a few years earlier. (An interesting aside: The original Italian Club, Cuban Club and Centro Asturiano buildings all burned down in the 1910s. A cigarette was blamed for the Italian Club fire, but it’s unclear what ignited the other two buildings.) Club members have preserved a remarkable amount of its original features, including tin ceilings, terrazzo floors, and what is believed to be the world’s longest onyx bar in the event space called the Cantina. How difficult is it to maintain these kinds of details in a 105-year-old building? Pannier and Daniel Martinez III, vice president of the club’s board of directors, don’t even answer the question; they just laugh. “It can be difficult,” Pannier hedges. Martinez says the club’s leadership and board have a laundry list of changes and additions they wish to make, like converting a former handball court to a bar that Pannier has cheekily suggested be called The Gym. But the building’s age makes even the simplest fix challenging. “Nothing’s cheap when the building is over 100 years old,” Martinez says. “There’s always something that needs to be fixed. It’s a constant figuring out, prioritizing, do we want to fix the window leaks, or do we want to fix the roof leaks? [If we had] a thousand members, it might be a lot easier to pay for it.” Membership peaked in the mid-20th century with around 6,000 members; today, the Centro Asturiano has about 200 members, according to Martinez. Membership saw a precipitous decline after the club’s hospital closed in 1990. Health care was the main benefit of mutual aid societies like the Centro Asturiano, which cared for its members from cradle to grave. Club members founded the Covadonga Sanatorium in 1905 on Ola Street in Tampa Heights with 54 beds. The club’s membership quickly outgrew the hospital, and they built a new facility on 21st Avenue in 1928. Members paid about 50 cents per week to ensure their health care was covered throughout their lifetime. Martinez says the club still has many members who were born in the Centro Asturiano hospital, and many of them will eventually be buried in the Centro Asturiano Memorial Park Cemetery. Today, the club makes most of its revenue by hosting events like weddings, parties, galas and receptions in the Cantina and newly renovated ballroom. Its history as an event venue dates back to its earliest days, when it welcomed theatre troupes, dancers, musicians, comics and other performers. “There really wasn’t a lot of entertainment back in the day because there was no TV, so people came here,” Pannier says. Famous musicians, like the Cuban pianist and composer Ernesto Lecuona (“Malagueña”), visited the club, and the Depression-era Works Progress Administration funded performances of plays and musicals. These performances are held in what Martinez calls one of Tampa’s best-kept secrets. The Centro Asturiano is home to a 1,000-seat theatre that is well maintained but virtually unchanged from the club’s opening. Though each of the city’s mutual aid societies had a theatre at some point, the Italian Club’s has since been demolished, and the Cuban Club’s is less than half the size of the Centro Asturiano’s. Pannier says some couples choose to get married in the theatre, but it is typically used for shows by comedians, musicians and singers, like folk-rock singer Todd Snider, coming to the club for a show sponsored by radio station WMNF in January. The club’s main priority right now is finding benefits that are cost-effective and attractive to new and returning members, while also hosting events that will introduce the Centro Asturiano to new groups of people. “We’re still evolving as far as how we appeal to people. We still want to keep the club heritage, but we also want to be able to appeal to everyone else, [too],” Martinez says. “Everyone used to live around here. As times changed, now people live in Carrollwood, New Tampa, Citrus Park. It’s not like those same families that used to be involved are able to do as much [with the club]… It’s something we’re constantly working on.” For Pannier, who grew up coming to the Centro Asturiano with her grandfather when she visited Tampa from her home in South America, keeping the club going is personal. “It is important to me that the Centro Asturiano remains open because it is part of Tampa’s early history and my heritage,” she says. “The building is historical and we must work hard to preserve it.” Tags: Centro Asturiano club culture club Event history Tampa Tampenos venue Next Post Una Garvey: Tampa Convention Center and Tourism Director Una Garvey on connecting Tampa’s past to its future development Local Knowledge Food & Drink Home & Garden Travel Moving Tampa Sporting Health Tampa Culture Advertise About Subscribe Purchase a Copy Digital Issues Email Newsletters Contact Privacy Policy © 2023 Tampa Magazine. All rights reserved. Part of the Tampa Magazines Network. No Result View All Result Tampa Culture Food and Drink Home & Garden Travel Moving Tampa Sporting Health Local Knowledge Advertise About Subscribe Purchase a Copy Shop Digital Issues Email Newsletters Contact MY ACCOUNT Your Membership Profile Update Billing Card Login / Logout © 2023 Tampa Magazine. All rights reserved. Part of the Tampa Magazines Network."
    },
    {
      "url": "https://www.centroasturianotampa.org/the-grand-ballroom",
      "text": "Grand Ballroom | Centroasturiano top of page Home History Host Your Event Grand Ballroom Covadonga Salón Asturias Cigar Lounge & Cantina Theatre Memberships Join the Centro Las Damas Members Los Caballeros Members Renew your Membership Club Events Contact Booking Inquiries Social Club Inquiries Reach Our Team History Tours Gallery Donate & Support Shop Sponsors & Supporters Board of Directors & Staff FAQ Memorial Park More Use tab to navigate through the menu items. Grand Ballroom The Ballroom is the most elegant setting in Tampa. From the hardwood floors to the fine crystal chandeliers, this room epitomizes elegance. Seating 300 guests with a dance floor, you have the space to create the event of your dreams. press to zoom press to zoom press to zoom press to zoom press to zoom press to zoom press to zoom press to zoom 1/1 Articles of Incorporation Resolution By-Laws Centro Asturiano de Tampa 1913 N Nebraska Avenue Tampa, FL 33602 813-229-2214 Centro Asturiano de Tampa, Inc. is a 501(c)3 nonprofit organization. © 2021 Centro Asturiano de Tampa bottom of page"
    },
    {
      "url": "https://www.centroasturianotampa.org/salon-asturias",
      "text": "Salón Asturias | Centroasturiano top of page Home History Host Your Event Grand Ballroom Covadonga Salón Asturias Cigar Lounge & Cantina Theatre Memberships Join the Centro Las Damas Members Los Caballeros Members Renew your Membership Club Events Contact Booking Inquiries Social Club Inquiries Reach Our Team History Tours Gallery Donate & Support Shop Sponsors & Supporters Board of Directors & Staff FAQ Memorial Park More Use tab to navigate through the menu items. Salón Asturias This room envelops the original historic charm of Ybor City. Original terrazzo floors, tin ceiling, and 50-foot one of a kind king onyx bar will take you back in time. press to zoom press to zoom press to zoom press to zoom press to zoom press to zoom press to zoom press to zoom 1/1 Articles of Incorporation Resolution By-Laws Centro Asturiano de Tampa 1913 N Nebraska Avenue Tampa, FL 33602 813-229-2214 Centro Asturiano de Tampa, Inc. is a 501(c)3 nonprofit organization. © 2021 Centro Asturiano de Tampa bottom of page"
    },
    {
      "url": "https://www.centroasturianotampa.org/host-your-event",
      "text": "Host Your Event | Centroasturiano top of page Home History Host Your Event Grand Ballroom Covadonga Salón Asturias Cigar Lounge & Cantina Theatre Memberships Join the Centro Las Damas Members Los Caballeros Members Renew your Membership Club Events Contact Booking Inquiries Social Club Inquiries Reach Our Team History Tours Gallery Donate & Support Shop Sponsors & Supporters Board of Directors & Staff FAQ Memorial Park More Use tab to navigate through the menu items. Event Spaces Built in 1914. Historic charm, sparkling chandeliers, and stunning details. Heart of Tampa location. S teps from Ybor's 7th Avenue Create Your Dream Grand Ballroom The Ballroom is the most elegant setting in Tampa. From the hardwood floors to the fine crystal chandelier's this room epitomizes elegance. Seating 250 guests with a dance floor, You have the space to create a socially responsible event. Theatre This historic Theatre is a stunning option for your big event. The picturesque room offers a backdrop you and your guests will never forget. The details make the room - from ornate walls, velvet chairs, and a stunning chandelier, it is everything you could ever want and more.  You can accommodate 730 in guests in style and grandeur. Covadonga The Covadonga Room is named for a municipality in Northern Spain, and is just as warm and inviting. This space accommodates 64 guests with a dance floor. This room features the original tin ceiling and a retro bar that adds charm and character. Salón Asturias This room envelops the original historic charm of Ybor City. Original terrazzo floor, tin ceiling, and a 50-foot one of a kind King Onyx Bar that will take you back in time.  This room accommodates 100 with a dance floor. Cigar Lounge & Cantina Our Cigar Lounge & Cantina is a room that allows you to experience everything Ybor City. You can take in a good cigar, pair it with a libation from our vintage bar, play a game of pool, or simply sit down for dominoes on tables that have been played on for over 100 years. ​ Articles of Incorporation Resolution By-Laws Centro Asturiano de Tampa 1913 N Nebraska Avenue Tampa, FL 33602 813-229-2214 Centro Asturiano de Tampa, Inc. is a 501(c)3 nonprofit organization. © 2021 Centro Asturiano de Tampa bottom of page"
    },
    {
      "url": "https://www.centroasturianotampa.org/history",
      "text": "History | Centroasturiano top of page Home History Host Your Event Grand Ballroom Covadonga Salón Asturias Cigar Lounge & Cantina Theatre Memberships Join the Centro Las Damas Members Los Caballeros Members Renew your Membership Club Events Contact Booking Inquiries Social Club Inquiries Reach Our Team History Tours Gallery Donate & Support Shop Sponsors & Supporters Board of Directors & Staff FAQ Memorial Park More Use tab to navigate through the menu items. History Centro Asturiano de Tampa In the late 1880s the immigrants who came to the Americas from Spain were largely bachelors or, if married came unaccompanied and sent for their families after earning sufficient funds for their passage. Consequently, there were a large number of Spaniards who had no one to care for them if they became ill or unable to work. Cuba was a Spanish possession until 1898 and Havana was the destination for many immigrants from Asturias, a province in northern Spain on the Bay of Biscay. In Havana, there existed organizations representing other regions in Spain such as Galicia, Cataluña and Castilla. On May 2, 1886, Centro Asturiano de La Habana was formed to provide medical assistance for the collective benefit of its members. Immigration from Cuba was not as restricted as it was from Europe. When the cigar industry came to Ybor City, there was a wave of immigration from Havana, where many had been employed in cigar manufacturing. In 1902, a group of 546 immigrants from the province of Asturias founded the Centro Asturiano de Tampa, one of the city's first mutual aid societies and a branch of the original club established in Havana, Cuba. Centro Asturiano began in a two-room, wood-frame building on Seventh Avenue. Membership rapidly grew and the club moved to an impressive new building at the corner of Palm and Nebraska. When a fire destroyed the club, a beautiful three-story yellow brick and stone building in the Renaissance Mediterranean style was built in its place for $110,000. It still stands today as an iconic piece of Tampa's history. The entrance featured a sweeping stone staircase and the sides of the building were adorned with traditional Doric columns, round-arch windows and stone balustrades surrounding the roof. The local paper reported the Bonfoey and Elliot-designed club as \"the most beautiful building in the South.\" The club provided a variety of entertainment. The theatre drew international actors and artists including Cuban composer and pianist Ernesto Lecuona who wrote 406 songs including the popular Malagueña. The theatre's zarzuelas, a form of Spanish musical theatre, attracted so many stars to its stage that the Spanish publication El Arte de Teatro sent a full-time writer to Ybor City to cover productions. The Centro Asturiano offered a large gymnasium, a Cantina for dominoes and chess, billiard tables and bowling alleys. Offices for the directors of the club were located on the second floor, as well as the library, educational rooms, a smoking room, a ladies' parlor, and a theater with elegant balconies. The Grand Ballroom on the third floor has fourteen original mirrors. Families that have been members for generations still speak of card games, dominoes, and the galas held in the Ballroom. Today, the Centro Asturiano hosts wedding receptions, comedy shows, musicals, recitals, bingo nights, auctions and more. The Centro Asturiano was added to the National Register of Historic Places in 1974 and is a designated heritage structure in the Ybor City Historic District. Today Articles of Incorporation Resolution By-Laws Centro Asturiano de Tampa 1913 N Nebraska Avenue Tampa, FL 33602 813-229-2214 Centro Asturiano de Tampa, Inc. is a 501(c)3 nonprofit organization. © 2021 Centro Asturiano de Tampa bottom of page"
    },
    {
      "url": "https://www.centroasturianotampa.org/memorial-park",
      "text": "Memorial Park | Centroasturiano top of page Home History Host Your Event Grand Ballroom Covadonga Salón Asturias Cigar Lounge & Cantina Theatre Memberships Join the Centro Las Damas Members Los Caballeros Members Renew your Membership Club Events Contact Booking Inquiries Social Club Inquiries Reach Our Team History Tours Gallery Donate & Support Shop Sponsors & Supporters Board of Directors & Staff FAQ Memorial Park More Use tab to navigate through the menu items. Memorial Park Centro Asturiano Memorial Park 5402 E Dr Martin Luther King Jr Blvd, Tampa, FL 33619 (813) 229-2214 Office Hours: Monday - Friday 8:00 AM - 4:00 PM To Purchase Plots or Make Funeral Arrangements Elizabeth Cabrera ​ Centro Asturiano de Tampa, Inc. 1913 N Nebraska Avenue Tampa, FL 33602 (813) 229-2214 Office (813) 224-9185 Fax View Cemetery Records Get Section / Lot / Space Information Hint: If record not found, the name may have an accent Make a Donation First name Last name Email * I'm donating in the name of Honoree name Leave us a comment Tell us how you heard of us Enter the amount you wish to donate * $ Submit Flowers Placement Service Flowers are placed four times a year on your loved one(s) gravestone or mausoleum plaque for a donation. Flowers will be placed by the first week of the following months: March, June, September and December. Package Options Basic: $50 silk flowers placed 4 times a year Deluxe: $150 real flowers placed 4 times a year Additional: $25 for birthday flowers added to Basic or Deluxe package Note: Donations are per separate grave markers. Make check payable to: Centro Asturiano Memorial Park ​ Mail your package option to: ​ ℅ Susan Rodriguez 3010 Lake Ellen Lane Tampa, FL 33618 Articles of Incorporation Resolution By-Laws Centro Asturiano de Tampa 1913 N Nebraska Avenue Tampa, FL 33602 813-229-2214 Centro Asturiano de Tampa, Inc. is a 501(c)3 nonprofit organization. © 2021 Centro Asturiano de Tampa bottom of page"
    },
    {
      "url": "https://www.centroasturianotampa.org/membership",
      "text": "Memberships | Centroasturiano top of page Home History Host Your Event Grand Ballroom Covadonga Salón Asturias Cigar Lounge & Cantina Theatre Memberships Join the Centro Las Damas Members Los Caballeros Members Renew your Membership Club Events Contact Booking Inquiries Social Club Inquiries Reach Our Team History Tours Gallery Donate & Support Shop Sponsors & Supporters Board of Directors & Staff FAQ Memorial Park More Use tab to navigate through the menu items. Centro Asturiano de Tampa Memberships Centro Asturiano de Tampa has become an well respected historic icon in our community, our goal is to fulfill our mission every day. That mission is to preserve and honor the culture, traditions and heritage of the immigrants from Asturias, Spain who settled in Tampa and to maintain the historical facility as a functioning memorial to the working-class immigrants. Our most important method of honoring this mission is through the dues and contributions provided by the members, their families, friends, and local businesses. In return we will add value to the membership by providing social activities, fellowship, and culture; these activities will provide for growth and stability in the membership, creating a safe and comfortable environment for both members and their families. ​ We offer a variety of events and activities throughout the year for our members and the community at large. Our events focus on celebrating culture and traditions in new and exciting ways. We work diligently to target new audiences, from all communities – both for membership and for event attendees. ​ We are always happy to welcome new members, whether from the Asturian Community or from all walks of life. As you may be aware membership dues are essential to the club’s continued viability and revitalization efforts. We thank you for your support and we look forward to working with you to help our membership grow. Each and every one of you are part of our family. ​ Centro Asturiano de Tampa Memberships include... ​ Discounted Centro Facility Rentals Discounted Member Events or Free Drink Tickets Reduced Drink Prices at Centro Events Voting Privileges Cantina Privileges Eligible to serve on the Board of Directors Cemetery Benefits Articles of Incorporation Resolution By-Laws Centro Asturiano de Tampa 1913 N Nebraska Avenue Tampa, FL 33602 813-229-2214 Centro Asturiano de Tampa, Inc. is a 501(c)3 nonprofit organization. © 2021 Centro Asturiano de Tampa bottom of page"
    },
    {
      "url": "https://tampamagazines.com/directory-best_city/listing/centro-asturiano-de-tampa/",
      "text": "Centro Asturiano de Tampa - Tampa Magazine No Result View All Result Local Knowledge Food & Drink Home & Garden Travel Moving Tampa Sporting Health Tampa Culture ADVERTISE SUBSCRIBE ABOUT PURCHASE A COPY DIGITAL ISSUES EMAIL NEWSLETTERS CONTACT US SHOP MY ACCOUNT Your Membership Profile Update Billing Card Login / Logout No Result View All Result No Result View All Result Centro Asturiano de Tampa by Tampa Magazine April 24, 2025 Share on Facebook Share on Twitter All Listings 2020-21 Tampa Bay Charity Register > Centro Asturiano de Tampa Centro Asturiano de Tampa Category: Best of City Winner Services Special Event Venue Centro Asturiano de Tampa 1913 N Nebraska Ave Tampa FL 33602 813-229-2214 Visit Website Back to All Listings Back to Charity Register 1913 N Nebraska Ave, Tampa, FL 33602 Tampa [instagram-feed] Next Post Vote Now for the Best of the City! Local Knowledge Food & Drink Home & Garden Travel Moving Tampa Sporting Health Tampa Culture Advertise About Subscribe Purchase a Copy Digital Issues Email Newsletters Contact Privacy Policy © 2023 Tampa Magazine. All rights reserved. Part of the Tampa Magazines Network. No Result View All Result Tampa Culture Food and Drink Home & Garden Travel Moving Tampa Sporting Health Local Knowledge Advertise About Subscribe Purchase a Copy Shop Digital Issues Email Newsletters Contact MY ACCOUNT Your Membership Profile Update Billing Card Login / Logout © 2023 Tampa Magazine. All rights reserved. Part of the Tampa Magazines Network."
    },
    {
      "url": "https://www.centroasturianotampa.org/support",
      "text": "Donate & Support | Centroasturiano top of page Home History Host Your Event Grand Ballroom Covadonga Salón Asturias Cigar Lounge & Cantina Theatre Memberships Join the Centro Las Damas Members Los Caballeros Members Renew your Membership Club Events Contact Booking Inquiries Social Club Inquiries Reach Our Team History Tours Gallery Donate & Support Shop Sponsors & Supporters Board of Directors & Staff FAQ Memorial Park More Use tab to navigate through the menu items. Support Us The Centro Asturiano de Tampa relies on the generous support of our members and friends to help us preserve our rich cultural heritage. Our founding members came from Northern Spain and many of the same families remain in Tampa today. All over Ybor City clubs like ours helped people feel at home in a new land at the turn of the century. As a social club we would take care of our members who mainly came here to work in the cigar industry, from medical care to entertainment they had a place to feel part of something special. Your charitable donation will support our buildings maintenance, our programs, and allow our story to continue to be told. We are a Tampa treasure on the fringe of Ybor City, and we invite you to help our legacy live on. Donation Centro Asturiano de Tampa relies on the generous support of our members and friends to help us preserve the rich cultural heritage of our beautiful and historical building. Help our legacy continue by donating to our upkeep, maintenance, and rising cost of operation. ​ ​ ​ Donate Now Corporate Sponsor In exchange for your support, Centro Asturiano provides brand awareness for your company via multi-platform media and public relations efforts, and exposure to our membership base. You also gain free daytime use of the Board Room, Library or Cantina, if available. Lastly, You will have discounted rental rates of other rooms in the building. ​ Donate Now Sponsor a Seat Become a vital part of Centro Asturiano by sponsoring a seat in our beautifully restored Cigar Workers Theatre! Choose from various seating sections, each offering a unique level of support. Seat sponsorships range from $250 - $1,000. Donate Now Tribute/Memorial Gift Honor someone special through a tribute gift in their name. ​ In the donation form comments section, please include the name of the person you are honoring and provide an address or email where we can notify them or their family. ​ ​ ​ ​ Donate Now Sponsor a Brick Join us in building a legacy by sponsoring a brick on our vibrant mural wall! With a generous donation of $1,000, you have the unique opportunity to make a lasting impact and become a cherished part of our community. Donate Now Memorial Park Donations The Centro Asturiano Memorial Park relies on the generous support of our community for continued upkeep, maintenance, and operation. We deeply appreciate all contributions that assist us in continuing our legacy for generations to come. Donate Now Articles of Incorporation Resolution By-Laws Centro Asturiano de Tampa 1913 N Nebraska Avenue Tampa, FL 33602 813-229-2214 Centro Asturiano de Tampa, Inc. is a 501(c)3 nonprofit organization. © 2021 Centro Asturiano de Tampa bottom of page"
    },
    {
      "url": "https://www.tickeri.com/venues/57ab5b00810a25fcd73ecf92",
      "text": "Centro Asturiano de Tampa Open main menu Search for events Log In Register Help ES Venue Centro Asturiano de Tampa 1913 North Nebraska Avenue, Tampa, 33602, United States, Florida Upcoming events Gianmarco en Tampa Sun, September 14 Tampa, FL Event organizer About us Help Contact us Terms Privacy policy El Shop Browse by city Miami Orlando Tampa Atlanta Charlotte DMV (DC, MD, VA) Philadelphia Tri-State (NY, NJ, CT) Chicago Dallas Houston Las Vegas Los Angeles San Francisco Phoenix Salt Lake City Columbus Gulf Port Indianapolis St. Louis Browse by country United States 🇺🇸 Puerto Rico (Coming Soon) 🇵🇷 Canada (Coming Soon) 🇨🇦 Mexico (Coming Soon) 🇲🇽 Peru (Coming Soon) 🇵🇪 Colombia (Coming Soon) 🇨🇴 Chile (Coming Soon) 🇨🇱 Popular Events 🏆 Made with mucho by your Tickeri familia © 2011- 2025 Tickeri, Inc. All Rights Reserved."
    },
    {
      "url": "https://www.theatrenantucket.org/about-us/staff-and-board-of-directors",
      "text": "Team SUPPORTÂ US BUY TICKETS SHOWS & TICKETS 2025 SEASON SEASON SUBSCRIPTIONS & GIFT CARDS WHAT TO EXPECT AT THE THEATRE PAST SEASONS GALLERY ABOUT US OUR MISSION & HISTORY STAFF AND BOARD OF DIRECTORS JOBS & VOLUNTEER OPPORTUNITIES AUDITIONS CONTACT US SPOTLIGHT ON SUPPORT SEASON PRODUCERS BUSINESS SPONSORS BUY TICKETS PRODUCING ARTISTIC DIRECTOR Justin Cerne EXECUTIVE DIRECTOR Bethany Oliver ARTISTIC DIRECTOR EMERITUS John Shea COMPANY MANAGER Emily Dunn THEATRE OPERATIONS Katy Feldhahn AUDIENCE ENGAGEMENT Johannah Johnson RESIDENT COSTUME DESIGNER Casey Sayre Boukus RESIDENT LIGHTING DESIGNER Stephen Petrelli RESIDENT SOUND DESIGNER Tony Wagner BOARD OF DIRECTORS Kay Bernon Beth English Ellie Gottwald, VP* David Handy Cecelia Johnson Holly Johnson David Kaytes, President* Karen Keelan Susan Lucier, Clerk* Linda Mason Jean Doyen de Montaillou Chris Mortenson, Treasurer* Helene Patterson Maureen Phillips, Treasurer Designate* Maria Roach, VP* Lisa Soeder* David Southwell, VP* * Executive Committee EMERITUS DIRECTORS Max N. Berry Barbara L. Elder Toby Greenberg Frank Morral Judith Greenberg Seinfeld THEATRE COUNCIL Rebecca Becker Bruce Beni Jane Forman Kathryn Garre-Ayars Victoria Girvan Jill Karp Peggy Kaufman Christina Rose Manca Terry Schubach Les Silverman FRIENDS OF THE THEATRE Amb. Elizabeth Frawley Bagley Jim Bennett Kate Brosnan Jane Condon Fritz Michel Join Our Newsletter Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. EMAIL info@theatrenantucket.org PHONE 508-228-4305 MAILINGÂ ADDRESS POÂ BOX 1297 Nantucket, MA 02554 STAGE Bennett Hall 62 Centre Street VIRTUAL BOX OFFICE Online:Â Â Â www.theatrenantucket.org Email: info@theatrenantucket.org Tickets can be purchased one hour prior to showtime at Bennett Hall."
    },
    {
      "url": "https://www.centroasturianotampa.org/",
      "text": "Event Venue | Centro Asturiano de Tampa | Tampa, Fl top of page Home History Host Your Event Grand Ballroom Covadonga Salón Asturias Cigar Lounge & Cantina Theatre Memberships Join the Centro Las Damas Members Los Caballeros Members Renew your Membership Club Events Contact Booking Inquiries Social Club Inquiries Reach Our Team History Tours Gallery Donate & Support Shop Sponsors & Supporters Board of Directors & Staff FAQ Memorial Park More Use tab to navigate through the menu items. History - Elegance - Tradition The Centro Asturiano de Tampa was a social club for immigrants and the descendants of immigrants from Asturias, Spain. Historically, membership included hospital benefits, cemetery benefits and health insurance. The purpose of the club was to take care of its members from cradle to grave. Our beautiful building now hosts our clubs, weddings, parties, celebrations, corporate functions, and galas. Our historical venue welcomes you. View our history Leave your Legacy in our historic theatre! Sponsor A Seat Help support the restoration of our gorgeous 110 year old theatre. HOST YOUR EVENT MEMBERSHIPS MEMORIAL PARK CLUB EVENTS Articles of Incorporation Resolution By-Laws Centro Asturiano de Tampa 1913 N Nebraska Avenue Tampa, FL 33602 813-229-2214 Centro Asturiano de Tampa, Inc. is a 501(c)3 nonprofit organization. © 2021 Centro Asturiano de Tampa bottom of page"
    },
    {
      "url": "https://www.centroasturianotampa.org/board-of-directors",
      "text": "Board of Directors & Staff | Centroasturiano top of page Home History Host Your Event Grand Ballroom Covadonga Salón Asturias Cigar Lounge & Cantina Theatre Memberships Join the Centro Las Damas Members Los Caballeros Members Renew your Membership Club Events Contact Booking Inquiries Social Club Inquiries Reach Our Team History Tours Gallery Donate & Support Shop Sponsors & Supporters Board of Directors & Staff FAQ Memorial Park More Use tab to navigate through the menu items. Centro Asturiano de Tampa Board of Directors and Staff Officers Cristal Lastra - President Daniel Martinez - Vice President Garry Hasara - Treasurer K.R. Lombardia - Secretary Directors Rick Russo Grace Gonzalez Rick Caldevilla Terin Barbas Cremer David Caldevilla Ramon Favata Gilbert Fernandez Glenn Fulgueira Liana Fuente Staff Elizabeth Cabrera - Memorial Park & Centro Finances Ansley Blackwell - Director of Sales and Community Partnerships Kaleigh Gonzalez - Marketing and Event Coordinator Not pictured: Ernesto Jesus Prida - Memorial Park Operations Bailey Damschroder - Events Coordinator In Loving Memory of Our Friend Oscar Cardoso Articles of Incorporation Resolution By-Laws Centro Asturiano de Tampa 1913 N Nebraska Avenue Tampa, FL 33602 813-229-2214 Centro Asturiano de Tampa, Inc. is a 501(c)3 nonprofit organization. © 2021 Centro Asturiano de Tampa bottom of page"
    },
    {
      "url": "https://www.centroasturianotampa.org/contact",
      "text": "Contact | Centroasturiano top of page Home History Host Your Event Grand Ballroom Covadonga Salón Asturias Cigar Lounge & Cantina Theatre Memberships Join the Centro Las Damas Members Los Caballeros Members Renew your Membership Club Events Contact Booking Inquiries Social Club Inquiries Reach Our Team History Tours Gallery Donate & Support Shop Sponsors & Supporters Board of Directors & Staff FAQ Memorial Park More Use tab to navigate through the menu items. Contact Contact Us Booking Inquiries If you are interested in booking an event at our historic venue, please fill out our event request form and a team member will get back to you shortly. Event Inquiry Address 1913 North Nebraska Ave Tampa, FL 33602 Contact (813) 229-2214 ansley@centroasturianotampa.org Social Club Inquiries If you would like to contact us in regards to our social club or, please fill out our contact form and a team member will get back to you shortly. Contact Form Office Hours Mon - Fri 9:00 am – 5:00 pm Articles of Incorporation Resolution By-Laws Centro Asturiano de Tampa 1913 N Nebraska Avenue Tampa, FL 33602 813-229-2214 Centro Asturiano de Tampa, Inc. is a 501(c)3 nonprofit organization. © 2021 Centro Asturiano de Tampa bottom of page"
    }
  ]
}