{
  "fuentes": [
    {
      "url": "https://www.islander.org/2024/11/whats-happening-anna-maria-bradenton-beach-holmes-beach/",
      "email": "info@islander.org"
    },
    {
      "url": "https://www.islander.org/2024/11/whats-happening-anna-maria-bradenton-beach-holmes-beach/",
      "email": "news@islander.org"
    },
    {
      "url": "https://www.islander.org/2024/11/whats-happening-anna-maria-bradenton-beach-holmes-beach/",
      "email": "sales@islander.org"
    },
    {
      "url": "https://annamariaislandchamber.org/bod/",
      "email": "info@annamariaislandchamber.org"
    },
    {
      "url": "https://www.islander.org/",
      "email": "info@islander.org"
    },
    {
      "url": "https://www.islander.org/",
      "email": "news@islander.org"
    },
    {
      "url": "https://www.islander.org/",
      "email": "sales@islander.org"
    },
    {
      "url": "https://centerami.org/programs/culture/",
      "email": "culture@centerami.org"
    },
    {
      "url": "https://centerami.org/programs/culture/",
      "email": "culture@centerami.org"
    },
    {
      "url": "https://centerami.org/programs/seniors/",
      "email": "chris@centerami.org"
    },
    {
      "url": "https://centerami.org/programs/seniors/",
      "email": "seniors@centerami.org"
    },
    {
      "url": "https://www.islander.org/2018/05/center-operations-director-named-new-executive-director/",
      "email": "info@islander.org"
    },
    {
      "url": "https://www.islander.org/2018/05/center-operations-director-named-new-executive-director/",
      "email": "news@islander.org"
    },
    {
      "url": "https://www.islander.org/2018/05/center-operations-director-named-new-executive-director/",
      "email": "sales@islander.org"
    },
    {
      "url": "https://centerami.org/giving/legacy/generations-of-community/",
      "email": "development@centerami.org"
    },
    {
      "url": "https://annamariaislandchamber.org/event/bingo-at-the-center/2025-03-14/",
      "email": "info@annamariaislandchamber.org"
    },
    {
      "url": "https://centerami.org/donate/",
      "email": "development@centerami.org"
    },
    {
      "url": "https://annamariaislandchamber.org/contact/",
      "email": "info@annamariaislandchamber.org"
    },
    {
      "url": "https://centerami.org/about/center-pr/",
      "email": "info@centerami.org"
    },
    {
      "url": "https://www.islander.org/anna-maria-i-love-you/",
      "email": "info@islander.org"
    },
    {
      "url": "https://www.islander.org/anna-maria-i-love-you/",
      "email": "news@islander.org"
    },
    {
      "url": "https://www.islander.org/anna-maria-i-love-you/",
      "email": "sales@islander.org"
    },
    {
      "url": "https://apm.activecommunities.com/amicommunitycenter",
      "email": "info@centerami.org"
    },
    {
      "url": "https://www.annamarialifevacationrentals.com/blog/anna-maria-island-community-center/",
      "email": "lindsey@annamarialifevacationrentals.com"
    },
    {
      "url": "https://thefeastrestaurantami.com/contact-us/",
      "email": "accessibility@example.org"
    },
    {
      "url": "https://thefeastrestaurantami.com/contact-us/",
      "email": "info@thefeastrestaurantami.com"
    },
    {
      "url": "https://centerami.org/about/join-our-team/",
      "email": "tyler@centerami.org"
    }
  ],
  "mails": [
    "accessibility@example.org",
    "chris@centerami.org",
    "culture@centerami.org",
    "development@centerami.org",
    "info@annamariaislandchamber.org",
    "info@centerami.org",
    "info@islander.org",
    "info@thefeastrestaurantami.com",
    "lindsey@annamarialifevacationrentals.com",
    "news@islander.org",
    "sales@islander.org",
    "seniors@centerami.org",
    "tyler@centerami.org"
  ],
  "nombre_sitio": "centerami.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.islander.org/2024/11/whats-happening-anna-maria-bradenton-beach-holmes-beach/",
      "text": "What’s happening Anna Maria? Bradenton Beach? Holmes Beach? - The Anna Maria Islander 33 Body of missing Bean Point swimmer recovered Holmes Beach, county officials discuss paid beach parking Bradenton Beach moves to adopt $5M budget Cortez Marina neighbors push back on public boat ramp plan Toggle navigation E Edition News Latest News Streetlife Real Estate Obituaries Sports Sports Fishing Classifieds This weeks ads Place an AD Contact Us islander Store Submit Subscribe Today! Island news brings us together Subscribe for unlimited digital access to the news that matters to your community. #AMITOGETHER What’s happening Anna Maria? Bradenton Beach? Holmes Beach? November 5, 2024 | Be the first to comment Facebook Twitter Subscribe The Bradenton Beach Post Office remains closed Nov. 1 from the impacts of Hurricanes Helene and Milton. The post office first opened in the 1970s. Islander Photo: Bonner Joy The Anna Maria Post Office has been operating out of several mail trucks at the Anna Maria City Pier Park but expects to move into an office trailer the week of Nov. 4. Islander Courtesy Photo Mayor Dan Murphy checked in with The Islander Nov. 2 to let readers know: Debris removal continues in the city. The majority of the household debris has already been removed from the city and placed in the landfill. The focus this week has been landscaping debris. We expect to have the majority of the yard waste removed by Sunday evening, Nov. 3. Any remaining household or landscaping debris after Monday will be addressed individually. Due to the post office being located in City Pier Park, the farmers’ market has been postponed from opening at that location. However, the city and the Center of Anna Maria Island are exploring the viability of moving the market on a temporary basis to the community center. The Veterans Day parade and celebration planned for City Pier Park have been canceled. On sending regrets to the mayor, he commented, “My heart is broken.” Bradenton Beach Mayor John Chappie did not respond. Holmes Beach Mayor Judy Titsworth responded to our request for info with a public works “recovery” graphic. It can be found online at islander.org. Around the island… Anna Maria Elementary kids returned to their campus Monday, Nov. 4, with cheers and enthusiasm. The Manatee and Coquina public beaches reopened to the public but Kingfish and the Coquina boat ramps remain closed. The moratorium on vacation rentals in Holmes Beach was lifted. The Moose Lodge in Bradenton Beach remains closed for storm renovations. As for who is open and who is not, it’s complicated. Some restaurants still have no kitchen, but they’re opening the doors by working magic on grills and customers seem happy to get out of the house. The Doctor’s Office opened its cocktail bar a couple of weeks ago and reopened the Doctor’s Garden to beautiful “sweater” weather with an abbreviated menu that includes the “big beef sammich” and the gut-buster hot dog, among other temptations. Chateau AMI at the Waterline opened almost after the wind died down from Milton with minimal damage. Anna Maria Island Beach Café at the Manatee Public Beach opened a week ago on Friday with a sunset party hosted by Mike Sales. Minnie’s Beach Cafe is hoping now to reopen soon although they were ready to go last week — but then learned the shopping center management would be mitigating damages in the entire building. And Ugly Grouper announced its reopening for Nov. 2. Holy Cow has ice cream! Hurricane Hanks also is open. In Bradenton Beach, Anna Maria Oyster Bar, Island Time Bar and Grill and Daiquiri Deck are open. Bridge Tender Inn has reopened the tiki bar. Slim’s Place, Bortell’s and the Porch in Anna Maria are open. Jason Suzor, owner of the Waterfront Restaurant, said they’re shooting to reopen by Thanksgiving. Ginny’s and Jane E’s Café at the old IGA store will be a bit longer. Paul Foster said the roof and the upstairs is almost done but they’re waiting for interior drywall and trim. They’re still looking at opening in mid-December, “In time for Christmas.” Things are looking up in Cortez with Star Fish, Tide Tables and Swordfish open, while the Seafood Shack remains in ruin and Slicker’s is slow to recover. The city of Anna Maria canceled its Veterans Day celebration and parade — and the city-run farmer’s market is on hold while the U.S. Postal Service operates at City Pier Park. As for the post office, employees were servicing 34216 customers out of box trucks under the shade sails, however, a trailer arrived that they hope to work out of by the end of the week. The Anna Maria Island Privateers announced the annual Christmas Parade and visits with Santa Clause have been canceled due to safety concerns. The Bradenton Beach Post Office, which serves Holmes Beach and Bradenton Beach with mail delivery, remains closed. The only update we heard was from a Longboat Key USPS staff member, who said it may be two years before Bradenton Beach reopens. The BB postal employees are working from Longboat Key, but there’s no word on whether mail box customers will continue to be served at Longboat. More from The Islander November 5, 2024 VOTE! September 9, 2025 Body of missing Bean Point swimmer recovered September 9, 2025 Holmes Beach, county officials discuss paid beach parking September 9, 2025 Bradenton Beach moves to adopt $5M budget Facebook Twitter Subscribe To advertise here, please visit our rates page or contact us at: sales@islander.org Phone: (941) 778-7978 Fax: (941) 778-9392 The Islander Poll: Do you swim at Bean Point? Yes. I used to. Never did. Where’s that? View Results Loading ... 3-Day Weather Forecast Newsletter signup Sign up to receive FREE email alerts when we update our site with news and classfieds. Email Please wait... Subscribe Thank you for sign up! Popular News Islander E-Edition For $36 a year , you can view all the news, photos, opinions, columns and community announcements To access this content, you must Subscribe here , or log in if you are a member. View our e-Edition Members On your mobile On your tablet Get news alerts Contact us Contact Us The Anna Maria Islander 10303 Spoonbill Road W., Bradenton FL 34209 Phone: (941) 778-7978 Fax: (941) 778-9392 For general information: info@islander.org Site design & maintained by Wayne Ansell Islander News Headlines E Edition Classifieds Place a Classified Ad Fishing Obituaries Real Estate Sports Streetlife Other Links About Us Legislative Contacts Privacy Copyright Archives Island Links Islander Store Web Services Subscribe Newsletter signup Sign up to receive FREE email alerts when we update our site with news and classfieds. Email Please wait... Subscribe Thank you for sign up! Social Media We use cookies to ensure that we give you the best experience on our website. If you continue to use this site we will assume that you are happy with it. Ok"
    },
    {
      "url": "https://annamariaislandchamber.org/bod/",
      "text": "BOD - Anna Maria Island Chamber of Commerce Call us Anna Maria Island Chamber of Commerce Call today 941-778-1541 Facebook Twitter Instagram Youtube Pinterest LinkedIn Jobs Request Info Join Now MENU MENU Directory Where to Stay Where to Eat Where to Shop Fun & Leisure Weddings Special Events Home Services Professional Services Relocation Resources Community Resources View All Categories Events About our Island Events Community Events Chamber Events Submit Your Event Event & Scholarship Forms About Demographics, Climate, Wildlife Anna Maria Island History Volunteer Opportunities Job Listings Subscribe to Our Newsletter Community Coupons Island Trolley About the Trolley Track the Trolley Advertise on the Trolley Trolley Giving Back Program Membership Membership Account Become a Member Learn How We Can Help You Staff Ambassadors Board of Directors Contact Board of Directors Katy Demick Chairman of the Board Originally from England, Katy moved to Anna Maria in 2000, planning to stay and work here for a year. After that first year, she decided this was where she wanted to live. Eighteen years later and counting, she is still here. Katy is married to David, has 2 dogs and lives in Bradenton. Katy has worked for Anna Maria Island Resorts (Tortuga Inn; Tradewinds; Seaside Inn and Tropic Isle Inn) since its inception in 2009 but has worked for David Teitelbaum since 2003. She is now Assistant General Manager and attributes her knowledge of business to the very supportive mentoring from David and the general manager, Barbara Baker. Katy has been a committee member with Symphony on the Sand since 2013 and also enjoys volunteering with Manatee County Animal Services. Wayne Gunter Treasurer Wayne’s commitment to superior client service along with his attention to detail has helped position him as a top mortgage originator in his area. Wayne graduated from the College of Business at the University of Florida in 1995 and has been originating mortgage loans over the past 27 years. His high level of expertise, strong commitment to his community and dedication to his field are just a few things that set Wayne apart as a true professional as well as a highly sought-after expert in his field. A native of Manatee County, Wayne has spent his life watching Anna Maria Island grow; he has been a member of the AMI Chamber of Commerce for 20 years and contributes his early career success to the membership. William Romberger Secretary Years of island small business ownership has shaped William’s professional   approach to real estate.  He and his family owned and operated the Tropic Isle Inn in Bradenton Beach for 12 years, transforming this island eye sore into one of the leading boutique hotels on the Island, leaving a lasting mark on the island accommodations industry. Living and working on the island since 1995 he is proud father of three and currently works as a Realtor on island.  William is a founding member of the Anna Maria Island Chamber of Commerce as well as a Board of Director, acts as Suncoast Surfrider island representative and engages in numerous other community activities with other islanders to help protect our island. Dan Alderson Dan and wife Sandy became residents of Cortez in 1998, moving from Minnesota. In 2008 their son, Rob, and his wife Laura, purchased Tyler’s Ice Cream, a 24-year-old business needing TLC. Since, they changed operations and recipes back to founders Larry and Gerri Tyler’s vision, ice cream is made and served with love. All of Tyler’s ice cream is made on-site. Tyler’s was honored with the AMI Chamber Small Business of the Year for 2013. Dan enjoys small business and continues to help with the growth of Tyler’s in Cortez and Longboat Key. Joann Baker Joann previously lived in New York and moved to Holmes Beach in 1974. She then established permanent roots in the Palma Sola area in 1985. She also has two children who reside in Manatee County and an amazing grandson who is her pride and joy. Joann has been an ambassador for the AMI Chamber since she became a member in 2017. She has also been involved with Sertoma Club of Bradenton for over eight years and has been the President for three years. She received an award as Sertoman of the Year 2021-2022 and has raised money throughout Manatee County while giving back to non-profits in the area. Joann currently works for United Community Bank as a Universal Banker II.  She has 30+ years’ experience in the banking industry. “I feel the AMI Chamber is a close-knit group: We help each other, and we care about people.” David Berube David is the owner of CG&B Publishing, LLC of Bradenton. David moved to Bradenton with his wife, Cindy & son, Matthew in 1990 from Westbrook, Maine, where he worked in the printing, paper and publishing industries. In Florida, he continued in the printing industry, in sales, for Coastal Printing of Sarasota. He also owned his own company, Book Binders of Florida, Inc., a hardcover book binding firm. In 1996, he opened Book Binders Printing & Publishing, Inc. and in 2008 he opened CG&B Publishing, LLC of Bradenton. CG&P is the official Publisher of the Visitor’s Guidebook for the Anna Maria Island Chamber of Commerce, the 2011 Bayfest Booklet and the Manatee County Chamber’s monthly “Current” Magazine. David is very active in AMI Chamber events and volunteers at the AMI Chamber office. Kellie Spring An Anna Maria Island native, Kellie has deep seated roots in community involvement, and you will find her at most local events. An Account Manager for SERVPRO of Bradenton since 2020, she serves not only on the AMI Chamber Board but also the Longboat Key Chamber Board of Directors as well as a part of the Leadership Committee for the Manatee Young Professionals group from the Manatee County Chamber of Commerce. She also volunteers with multiple organizations throughout the community. Eric Cairns Eric came to Anna Maria from Ohio where he was a general contractor for 25 years and successfully operated his own business. He has been an Anna Maria Island businessman and manager of Cedar Cove Resort since 1999. Years ago, Cedar Cove Resort became one of the original founders of the Anna Maria Island Chamber of Commerce. Eric continued this tradition when he became a Founders Club Member. Eric has been an active member of the AMI Chamber of Commerce and presently serves on several of the Chamber’s committees. Special Interests: Cedar Cove Resort donates regularly to the MS Foundation and Breast Cancer Foundation. Eric is an army veteran and a helicopter pilot. Cedar Cove Resort has been voted the “Best Beach Resort and Hotel” on the Island for the last several years. John Campora With over 18 years of hands-on work in the investing and banking experience, helping others reach their financial goals is a passion of mine. Being adopted and raised by a single mother generated an understanding of the challenges of single income families and the value that saving can have on a person’s future. Manatee County has been my home for over 42 years. Serving the community and helping maintain and improve where we live is very important to me. Currently, I sit on the Anna Maria Island Chamber of Commerce board of directors as well as volunteer in other areas of the island life. Spending time with my wife and young son is a source of true enjoyment for me. Nikita Fosmore Nikita Fosmore is an enthusiastic member of the Chamber of Commerce’s Board of Directors with 14 years in business at Salon Salon of AMI and as a third generation hairstylist/salon owner-she has a deep-rooted passion for cultivating relationships in her business and our community. Nikita’s certification as an educator with Fierce Conversations reflects her dedication to empowering others and facilitating meaningful dialogues within the business community. Leading with empathy, she values communication and embraces personal and professional growth. As a forward-thinker, Nikita brings innovative ideas, dynamic strategies and a millennial voice to the table. Her goal is to create a warm, inviting atmosphere where professionals feel inspired to collaborate, learn, and thrive together. Karen LaPensee Karen LaPensee graduated from State College of Florida with a nursing degree. She spent 14 years working in emergency care, intensive care, surgery and as an Air Force Reserve Flight Nurse prior to starting LaPensee Plumbing with her husband Michael LaPensee in 1985. Karen became the President of LaPensee Plumbing • Pools • Air after Michael’s retirement in 2009. She continues to run and expand the business with her daughter, Shawn LaPensee. Karen has been a long-time active member of the Chamber of Commerce, serving as Treasurer, Secretary, and Chairman of the Board. With the help of a very capable staff LaPensee Plumbing • Pools • Air has been honored to receive the 2011 Manatee Chamber Small Business of The Year Award, the 2016 Anna Maria Island Chamber Small Business of The Year Award and the 2017 Longboat Key Chamber Small Business Person of the Year Award. Janet Mixon Janet Mixon and her husband, Dean Mixon are owners of Mixon Fruit Farms, an over 78-year-old family-owned business. Mixon’s is one of the top gift fruit shippers in Florida. Mixon also squeezes and bottles their juice for the community. Janet and Dean have diversified the business and Mixon’s has become one of the top Gulf Coast Destinations according to the Travel Channel. The Mixon Groveside Market is a wonderful experience. They have also added a tram tour through the grove where their customers learn about the history of citrus and the Mixon family and enjoy a visit to the wildlife rescue with crocodiles, alligators, raccoons, hawks, owls and much more. Injured animals that can’t be released into the wild that would normally be euthanized are provided sanctuary by the Mixons. During the year the Mixon’s host many non-profit organizations for fundraisers, sponsor a cooking competition for the local high school culinary arts programs, and also sponsor art events with students and local artists. Logan Nichols Logan moved to the area and started with Island Real Estate Vacations June 15, 2020 after getting out of the Air Force. Logan is the Owner Relations Manager (ORM) of Island Real Estate Vacations (IREV). The ORM is the main point of contact for property owners on the IREV vacation rental program responding to owner concerns and acting as the liaison between the owner and IREV’s internal departments. This position supports the IREV operations department and retention efforts by providing comprehensive assistance, support, and interactive communications and services to our current owners. Prior to working for IREV, Logan served 9 years in the United States Air Force. During his time in the military Logan learned valuable professional skills such as project management, productivity improvement, and staff training. While in the Air Force, Logan served 2 tours in Afghanistan. He received 3 Medals of Commendation and 2 Medals of Achievement for his accomplishments and leadership. Logan has earned his Bachelor’s Degree in Health Care Management graduating with honors and is currently enrolled in a Masters of Business program. Logan is married and has 3 amazing children. Bob Slicker Originally from a small town in Michigan called Houghton Lake, Bob Slicker successfully started his career in restaurant business management in New Orleans and Boston. After hiking the Appalachian Trail over 35 years ago, he went to visit a friend on Anna Maria Island… and found his ideal destination, the place he’d call home. Currently, the Owner/Operator at Slicker’s Eatery in Cortez. Slicker’s Eatery is a family-built restaurant boasting fresh, chef-driven food at a great price. One of the main pillars in his business plan is to not look the other way and make a difference. He is a proud member of the Anna Maria Island Chamber and is eager at the opportunity to continue supporting our wonderful small businesses and vibrant local community. Mike Southwick Mike attended AMI Elementary, played football at the youth center, recalls the private air strip where Holmes Beach City Hall resides and the lack of paved roads. Mike moved to Tallahassee as a child, but was drawn back to the island in 1996 due in part to a strong family presence (Mary Norman, co-owner of the Sterling Anvil, and Mike Norman Realty). Mike is currently co-owner of AAA Payroll Service, which was honored to be awarded the AMI Small Business of the Year Award for 2017. His professional background includes 10 years in the real estate industry followed by 20 years in the PEO industry. Mike supports local charities such as Wildlife, Inc., Manatee Children’s Services and the Navy Seal Foundation. Mike’s support of our military is due in part to his father, Captain C.E. Southwick who was a highly decorated Naval Aviator and former POW during the Vietnam War. Mike resides in Bradenton Beach with his wife Sheryl. They love boating, cooking, gardening, local and Alaska fishing trips. Anna Maria Island 5313 Gulf Drive, Holmes Beach, FL 34217 941-778-1541 info@annamariaislandchamber.org Facebook Twitter Instagram Youtube Pinterest LinkedIn © Anna Maria Island Chamber of Commerce . All rights reserved. Digital marketing by Two Oceans Digital . Site Map | ADA Website Compliance | Privacy Policy Please ensure Javascript is enabled for purposes of website accessibility"
    },
    {
      "url": "https://www.islander.org/",
      "text": "The Anna Maria Islander - The Anna Maria Islander Newspaper - \"The Award Winning & Best News on Anna Maria Island, FL Since 1992\" 33 Body of missing Bean Point swimmer recovered Holmes Beach, county officials discuss paid beach parking Bradenton Beach moves to adopt $5M budget Cortez Marina neighbors push back on public boat ramp plan Toggle navigation E Edition News Latest News Streetlife Real Estate Obituaries Sports Sports Fishing Classifieds This weeks ads Place an AD Contact Us islander Store Submit Subscribe Today! Island news brings us together Subscribe for unlimited digital access to the news that matters to your community. #AMITOGETHER This week on Anna Maria Island: Wednesday, Sep 10, 2025 Photographer Jacob Merrifield put his drone up Sept. 4 to catch a thunderstorm’s western approach on the Gulf of Mexico at Longboat Pass between Anna Maria Island to the north, Longboat Key to the south and Cortez to the east. Islander Photo: Jacob Merrifield Body of missing Bean Point swimmer recovered by Robert Anderson | Be the first to comment The body of a 20-year-old man who disappeared while swimming off Bean Point Aug. 31 was recovered Sept. 1, the […] Category: 09-10-2025 , Community , Feature , News Holmes Beach, county officials discuss paid beach parking by Ryan Paice | Be the first to comment The discussion of paid parking at the beach in Holmes Beach continues — this time with Manatee County officials chiming […] Category: 09-10-2025 , Community , Feature , News HB requests county assist with traffic, causeway beach vendors by Ryan Paice | Be the first to comment Commercial activity on and around Anna Maria Island is blowing up. And the city of Holmes Beach is requesting Manatee […] Category: 09-10-2025 , Community , News Bradenton Beach moves to adopt $5M budget by Robert Anderson | Be the first to comment Bradenton Beach commissioners moved Sept. 4 to advance a proposed $5 million budget for fiscal year 2025-26, holding the city’s […] Category: 09-10-2025 , Community , Feature , News As the world terns – 09-10-2025 Be the first to comment Category: 09-10-2025 , Community , News , terns Cortez Marina neighbors push back on public boat ramp plan by Robert Anderson | Be the first to comment Residents near the former Seafood Shack site in Cortez say they want Manatee County to scrap plans for a public […] Category: 09-10-2025 , Community , Feature , News Dark weather arrives Be the first to comment Photographer Jacob Merrifield put his drone up Sept. 4 to catch a thunderstorm’s western approach on the Gulf of Mexico at Longboat Pass between Anna Maria Island to the north, Longboat Key to the south and Cortez to the east. Islander Photo: Jacob Merrifield Category: 09-10-2025 , Community , Featured Image , News Bradenton man arrested for repeated petit theft by Ryan Paice | Be the first to comment Holmes Beach police arrested Bradenton resident Lawrence Beach, 62, Sept. 2 on a third-degree felony charge for alleged petit theft […] Category: 09-10-2025 , Community , News , Police Roadwatch-09-10-2025 by Lisa Neff | Be the first to comment Eyes on the road Cortez Bridge utility relocation project: Pipe installation and related activities are ongoing in preparation for the […] Category: 09-10-2025 , News 2 mayors agree on response to FL legislators by Ryan Paice | Be the first to comment State pressure for consolidation on Anna Maria Island is back on the front burner. Anna Maria Mayor Mark Short and […] Category: 09-10-2025 , Community , News Tourist tax numbers for July climb by Lisa Neff | Be the first to comment Tourist development tax dollars in Manatee County climbed more than 15% in July compared with July 2024, but the spike […] Category: 09-10-2025 , Community , News , tax , Tourism Top Notch Honorable Mention Be the first to comment Category: 09-10-2025 , Community , News , Top Notch 2025 Do you swim at Bean Point? by Lisa Neff | Be the first to comment Last week’s question Should the island governments institute paid parking systems? No, keep access free. 69% Yes, in limited areas. […] Category: 09-10-2025 , Community , Poll Holmes Beach to host rental workshop by Lisa Neff | Be the first to comment The city of Holmes Beach will host a workshop at 8 a.m. Wednesday, Sept. 10, for “vacation rental stakeholders.” The […] Category: 09-10-2025 , Community , News Ramping up Be the first to comment Holmes Beach Mayor Judy Titsworth emailed The Islander Sept. 4 with news fresh from a joint meeting Sept. 3 with […] Category: 09-10-2025 , Community , News Health dept. lifts advisory for Palma Sola by Lisa Neff | Be the first to comment The Florida Department of Health in Manatee County Sept. 4 lifted a water quality health advisory for the Palma Sola […] Category: 09-10-2025 , Community , News Nesting notes: Excellent emergence rate by Lisa Neff | Be the first to comment Nesting season on Anna Maria Island has produced more than 27,000 sea turtle hatchlings and there are still 100 nests […] Category: 09-10-2025 , Community , News , turtle , turtles Top Notch Honorable Mention Top Notch photo contest rules The Islander’s Top Notch contest begins anew. The contest celebrates what still is known as the ‘Kodak moment,’ despite Kodak’s downfall in the switch from film to digital technology. Look to July 6 for the first of six weekly deadlines and don’t forget your July 4 holiday photos in the coming weeks. Last week's roundup Marketwatch – 09-10-2025 | by Lisa Neff | Be the first to comment Update: Search ends for missing swimmer off Bean Point | Be the first to comment Anna Maria moves forward with Bean Point no-swim zone | by Ryan Paice | Be the first to comment 3 incumbents retain seats in Anna Maria | by Ryan Paice | Be the first to comment 3 Bradenton Beach incumbents secure seats, plus a vacancy | by Robert Anderson | Be the first to comment Holmes Beach has a race, 4 for 3 seats | by Ryan Paice | Be the first to comment Roadwatch-09-03-2025 | by Lisa Neff | Be the first to comment Anna Maria building dept. changes ‘in motion’ | by Ryan Paice | Be the first to comment Pines Trailer Park lawsuit settled | by Robert Anderson | Be the first to comment Holmes Beach commissioner dredges up paid beach parking concept | by Ryan Paice | one comment Islander E-Edition The Anna Maria Islander FREE e-Edition will be expired at the end of September 2025 Click Here to Subscribe View our e-Edition The Islander Poll: Do you swim at Bean Point? Yes. I used to. Never did. Where’s that? View Results Loading ... Popular News Newsletter signup Sign up to receive FREE email alerts when we update our site with news and classfieds. Email Please wait... Subscribe Thank you for sign up! Feature Stories The Bay is Full of Rum Anna Maria I Love You Editorial Headline News Fishing Obituaries Real Estate Sports Streetlife Your Comments Your Local Weather Classifieds Classifieds Place a Classified Ad To advertise here, please visit our rates page or contact us at: sales@islander.org Phone: (941) 778-7978 Fax: (941) 778-9392 3-Day Weather Forecast Islander Store Donate to Keep The Islander Free $ 5 – $ 100 Price range: $5 through $100 Subscribe to receive the print version The Islander The Islander T-shirt $ 10 – $ 17 Price range: $10 through $17 Anna Maria Island Sticker $ 2 Members Facebook The Islander Sports Center football goes to playoffs, KRC hosts Labor Day tourney by Kevin P. Cassidy The regular season of the adult flag football league at the Center of Anna Maria Island is over and it’s […] Recent Stories 1 week to playoffs in center flag football, soccer on horizon 2nd September 2025 | Be the first to comment Center expands adult soccer; golf, horseshoes dodge rain 26th August 2025 | Be the first to comment Fishing Mourning the loss of a beloved captain by Capt. Danny Stasny The fishing community of Anna Maria Island is mourning the loss of one of its beloved charter captains after his […] Recent Stories Manatee River flushes fresh water, pushing fish into bays 2nd September 2025 | Be the first to comment Grab your gear for holiday opening: Snook season kicks in Sept. 1 26th August 2025 | Be the first to comment Real Estate Island real estate transactions – 09-10-2025 by Bonner Joy Nothing to report Streetlife Streetlife – 09-10-2025 Island police reports Anna Maria       Aug. 23, 200 block of Magnolia Avenue, drugs. The Manatee County Sheriff’s Office dispatched […] Classifieds The Islander Classifieds:  Wednesday, Sept, 10, 2025 ITEMS FOR SALE 100-YEAR-OLD brass ship’s compass and two wooden Maine lobster buoys, $250. 773-575-8189. OFFICE CHAIRS: BLACK. Two, like-new, […] On your mobile On your tablet Get news alerts Contact us Contact Us The Anna Maria Islander 10303 Spoonbill Road W., Bradenton FL 34209 Phone: (941) 778-7978 Fax: (941) 778-9392 For general information: info@islander.org Site design & maintained by Wayne Ansell Islander News Headlines E Edition Classifieds Place a Classified Ad Fishing Obituaries Real Estate Sports Streetlife Other Links About Us Legislative Contacts Privacy Copyright Archives Island Links Islander Store Web Services Subscribe Newsletter signup Sign up to receive FREE email alerts when we update our site with news and classfieds. Email Please wait... Subscribe Thank you for sign up! Social Media We use cookies to ensure that we give you the best experience on our website. If you continue to use this site we will assume that you are happy with it. Ok"
    },
    {
      "url": "https://centerami.org/programs/culture/",
      "text": "Culture/Education - The Center of Anna Maria Island The Center of Anna Maria Island The community's gathering place Donate Join Contact About Center Schedule Forms Staff Awards and Distinctions Join Our Team Board Members Center Financials When is The Center Open? Center History Programs Wellness Youth Beyond The Classroom: Before & After School: K-5th Graders All Day Camps Youth Classes Teens Dolly Parton’s Imagination Library Sports Farmers Market Culture/Education Wellness Group Fitness Classes Fitness Instructors Specialty Fitness & Wellness Personal Training Massage & Acupuncture Sports Youth Sports Adult Sports Tennis Pickleball Concerts Events Memberships Support Become a Sponsor Volunteer JvZ Scholarship Rock ‘N’ Support Grant Giving Legacy Generations of Community Donate Culture/Education The Center is interested in bringing new art, educational, and cultural classes to our community. If you are looking to enrich your mind or lives, learn about a new subject or art form, or just want to be creative, join in one of our many offered classes. For more information please contact The Center (941) 778-1908 or culture@centerami.org . Interested in teaching a class? Request for Proposals Full Moon & New Moon Women’s Circles Mondays | 6:00 PM – 8:00 PM Upcoming Dates: 🌕 Full Moon Circles: October 6 November 3 December 1 🌑 New Moon Circles: September 22 October 20 November 17 December 22 Pricing Members: $25 Non-Members: $30 About the Facilitator Carly Burdick is a local Reiki Master and Women’s Guidance Facilitator with a heartfelt mission to support women on their paths of self-discovery and empowerment. Through sacred circles, Carly offers a safe, nurturing environment for connection, healing, and inner transformation. Her work is centered on creating community and guiding women to embrace their true selves. What to Expect Each Women’s Circle is a unique and sacred gathering that includes: ✨ Group Meditation ✨ Journaling & Self-Reflection ✨ Sharing Circle ✨ Sound Healing ✨ Connection & Community These circles are open to all women, regardless of spiritual background or experience. Just bring an open heart and a willingness to connect. Full Moon Circle Step into the glow of the Full Moon and join Carly in a transformative evening of reflection, connection, and renewal. Harness the powerful lunar energy to illuminate your path, release what no longer serves you, and celebrate the divine feminine within. New Moon Circle Align with the energy of new beginnings during this sacred New Moon gathering. Set clear intentions, plant seeds for your future, and embrace fresh starts through ritual, meditation, and sisterhood. The New Moon is a perfect time to reconnect with your vision and move forward with clarity and purpose. Pre-registration required. Call (941) 778-1908 to reserve your spot. Spaces are limited—join us in sacred sisterhood and honor the cycles of the moon together. Co-Ed Community Circle Class Dates Wednesday, September 17, 2025 Wednesday, October 15, 2025 Wednesday, November 12, 2025 Time 6:00 PM – 8:00 PM Cost Members: $25 Non-Members: $30 Class Description A Monthly Gathering for Support, Connection & Presence Open to everyone, this monthly community circle offers a safe, welcoming space for honest reflection, deep listening, and meaningful connection. This is not therapy — it’s a space to simply be, to speak from the heart, and to be witnessed without judgment. Through shared presence and gentle practices, we create an atmosphere of support, vulnerability, and soul-level connection. Led by Carly Burdick , a compassionate guide experienced in meditation, sound healing, and heart-centered community work, this circle is designed to nurture the mind, body, and soul. Carly brings warmth, intuitive guidance, and a deep respect for creating safe, inclusive spaces for all participants. Who Can Join? Men, women, couples, friends — anyone with an open heart and interest in connecting is welcome! Each Gathering Includes: Guided meditation to ground and center Journaling prompts to explore your inner world Heart-led share circle (with no pressure to speak) Sound healing with crystal singing bowls and other calming instruments Partner or group connection exercises to foster trust and community Whether you’re seeking space to recharge, a place to be seen, or the warmth of authentic human connection — this circle is for you. Pre-registration required. For more info: (941) 778-1908 or culture@centerami.org Cooking with “Chef” Geag’s Class Day: Saturday, September 20, 2025 Time: 12:00 PM – 2:00 PM Cost: Members: $10/Non-Members: $15 Island resident and member of The Center of Anna Maria, Chris Geag’s (aka “Geag’s”) is not only a Personal Trainer but also an enthusiastic amateur “chef.” With a degree in Exercise Physiology from Springfield College and over 35 years of experience teaching proper form and exercise techniques, Geag’s has dedicated his career to health and fitness. An advocate for healthy eating, Geag’s often tells his clients, “You don’t have to be a rocket scientist to understand how the body uses food after you eat it!” Geag’s was also featured on Season 14 (2024) of MasterChef —where he became the first chef to get Gordon Ramsay and Chef Aarón Sánchez to do push-ups on national television! Known for his fun, straightforward personality, Geag’s will share behind-the-scenes stories from his TV experience while demonstrating how to cook a delicious and healthy dish —explaining exactly why it’s good for your body. So, if you love great food, healthy cooking, and lots of laughs, join Geag’s this fall at The Center of Anna Maria for an educational experience of a lifetime! Menu Chef Geag’s will demonstrate how to cook a healthy and flavorful meal featuring: Chicken Thighs Jasmine Rice Broccoli Contact Information For any questions or concerns regarding this program, please contact: The Center of Anna Maria Island Phone: (941) 778-1908 Email: Culture@centerami.org Think Better, Live Free Date: Monday, November 3, 2025 Time: 12:00 pm – 2:00 pm Cost: Members: $5 / Non-Members: 10 “Break Free from Negative Thought Loops & Step into Your Beautiful Future” Do you ever feel: Stuck in self-doubt and fear? Overwhelmed by decisions and constant overthinking? Trapped in a battle with your own mind? Unworthy of happiness, success, or love? It doesn’t have to be this way—you can take back control. You’re not alone, and you’re not “broken.” You simply need the right strategies to shift your thoughts and step into the confident, joyful person you were created to be. In This Class, You’ll Learn How To: Identify and overcome negative thought patterns Build confidence and inner peace Gain clarity and direction in life Step into the joy and fulfillment you deserve Your transformation starts NOW. Are you ready? Life Coaching with Sheri Sekafetz Island Photography Workshop Date: Saturday, November 22, 2025 Time: 9:30am – 11:30am Ages: 16+ Cost: Members: $65/ Non-Members: $75 Bring your own camera or smartphone Discover the art of photography in this fun, hands-on workshop led by Island resident and professional photographer Jim Rimi . With his laid-back and approachable teaching style, Jim will guide you through the fundamentals of lighting, composition, and technique. The session begins indoors, where you’ll learn practical tips and strategies, then moves outside to put your new skills into practice. You’ll receive personal guidance and critiques to help you see immediate improvement in your photography—whether you’re using a DSLR, point-and-shoot, or smartphone. Jim’s photography is featured in the permanent collection of the South Street Seaport Museum, NYC , and his book New York Underground is part of the permanent collection at the Museum of Modern Art Library, NYC . Tech U Classes Instructor: Loretta Estabrooks Dates & Focus: Tuesday, November 11, 2025 – Beginner’s Thursday, November 13, 2025 – Q&A Tuesday, December 9, 2025 – Beginner’s Thursday, December 11, 2025 – Q&A Tuesday, January 13, 2026 – Beginner’s Thursday, January 15, 2026 – Q&A Time: 10:30 AM – 11:45 AM Location: Learning Center Cost: Free Class Description This hands-on class will explore both iPhone and iPad topics based on participant interests. Possible areas include digital photography, device security, “Find My Phone,” settings navigation, photo sharing, text messaging, and using Siri. iPhone Beginner’s Course Includes: Navigating the home screen and using gestures Managing settings, Apple ID, and iCloud Using essential apps like Mail, Messages, and Safari Making calls and sending messages Customizing the iPhone and using Siri Exploring camera features and taking photos Downloading and managing apps in the App Store Tips, tricks, and hidden features Center Book Club Our Book Club is open to all and free to join ! We meet on the third Monday of each month to share conversation, community, and a love of reading. September’s meeting is September 15th at 1pm September’s Pick: Broken Country by Clare Leslie Hall In this compelling novel, Hall weaves together themes of resilience, identity, and family against the backdrop of a fractured land. Broken Country explores how history, memory, and personal choices shape the present, offering readers a powerful and thought-provoking story that lingers long after the final page. Come join us, whether you’ve finished the book or are just curious to listen in! For more info: hello@centerami.org DBTB Juice Bar & Bakery DBTB Juice Bar & Bakery is open Tuesdays-Saturdays 8am-12pm. Scratch-made with organic flour and produce, they offer a delicious selection of breads, pastries, desserts, juices, coffee, and smoothies. Our mission is to nourish our community with real, unprocessed food, free of preservatives and seed oils. Dev's Bevs Ice Baths Ice Baths with Dev’s Bevs Wednesdays & Saturdays 12 pm to 1 pm (5 minute interval, must pre-register) Cost: $20 Members | $25 Non-Members There will be no Ice Baths June 18th or 25th Drop in and experience the benefits of ice baths at The Center with Devinne Whittaker of Devs Bevs. Take a few minutes out for yourself at Devs Bevs Ice Bath Wednesday! Ice baths can reduce inflammation and swelling, relieve sore muscles, improve exercise recovery, improve mental health, and support immunity. Please per-register. For more info: email hello@centerami.org or call us at (941) 778-1908. Massage & Acupuncture At The Center of Anna Maria Island, we are dedicated to supporting your overall wellness through a variety of therapeutic and recovery services. Whether you’re looking to relieve stress, improve mobility, or support recovery, we have options tailored to your needs. Our Wellness Services: Massage Therapy Massage therapy is a powerful tool for relaxation, stress relief, and muscle recovery. We offer two types of massage: Swedish Massage – A gentle, relaxing massage that promotes circulation, reduces stress, and improves overall well-being. Deep Tissue Massage – A therapeutic massage designed to target deep layers of muscle and connective tissue, ideal for relieving chronic tension and muscle pain. Acupuncture Therapy Acupuncture is a traditional Chinese medicine practice that promotes healing, reduces pain, and enhances overall well-being by stimulating specific points on the body. Cupping Therapy Cupping therapy is an ancient practice that uses suction cups to stimulate blood flow, relieve muscle tension, and promote healing. Click here for prices or book your session by calling The Center at (941)778-1908 Quick Info and Links Center Hours: Monday - Thursday 7 AM - 8 PM Friday 7 AM - 7 PM Saturday 8 AM - 3 PM Center Schedule Sports Schedules Phone: 941.778.1908 Email: hello@centerami.org Annual Impact Report: Leaving a legacy supports growth for future generations! Dear Center Community,\r\n\r\nAs I reflect on this past year, I am filled with gratitude for the unwavering support and trust you place in The Center of Anna Maria Island. My name is Jillian Ptak, and I am proud to serve as … Read More Center Contact 407 Magnolia Avenue PO Box 253 Anna Maria, FL 34216 Phone: 941.778.1908 Email: hello@centerami.org Center Hours: Monday - Thursday 7 AM - 8 PM Friday 7 AM - 7 PM Saturday 8 AM - 3 PM Public Rights Refund Policy Code of Conduct Copyright © 2025 The Center of Anna Maria Island"
    },
    {
      "url": "https://centerami.org/programs/seniors/",
      "text": "Senior - The Center of Anna Maria Island The Center of Anna Maria Island The community's gathering place Donate Join Contact About Center Schedule Forms Staff Awards and Distinctions Join Our Team Board Members Center Financials When is The Center Open? Center History Programs Wellness Youth Beyond The Classroom: Before & After School: K-5th Graders All Day Camps Youth Classes Teens Dolly Parton’s Imagination Library Sports Farmers Market Culture/Education Wellness Group Fitness Classes Fitness Instructors Specialty Fitness & Wellness Personal Training Massage & Acupuncture Sports Youth Sports Adult Sports Tennis Pickleball Concerts Events Memberships Support Become a Sponsor Volunteer JvZ Scholarship Rock ‘N’ Support Grant Giving Legacy Generations of Community Donate Senior The Center offers a variety of programs for people 60 years of age and older. Activities include traveling, pursuing old hobbies and learning new ones, socializing with friends, meeting new people, increasing knowledge, becoming and staying physically fit, and much more! For more information please contact Debbie at seniors@centerami.org Annual Memberships are for available Seniors (age 60 +) at $50/month for 12 consecutive months. Annual Senior Memberships are ideal for anyone who lives in the area and/or plans to attend The Center for a total 6 months or more within a 12 month calendar. For more information about other membership options, click here Community Connections Community Connections at The Center Friday, April 21 5-8 p.m. Join us for this potluck event where you can meet people from our community and make new friends. Here at The Center, we care about community, and we hope that these monthly events will bring people together and form connections. Bring your own drinks and a dish to share. This event is free of charge. No registration required. For more info: email chris@centerami.org or call us at (941) 778-1908. VIP Center Outings VIP Center Outings April 14th: Explore Perico Preserve and dine at Danny’s Pizzeria Leaving The Center at 9:15 a.m. and returning at 2 p.m. April 19th: Detwiler’s Farm Market Leaving The Center at 9:15 a.m. and returning at 2 p.m. April 27th: Dinner at Floridays Woodfire Bar & Grille Leaving The Center at 4 p.m. and will return by 8 p.m. Cost: $5 for van ride + additional fees for adventure. Only 14 spots available in van. Call The Center at (941) 778-1908 to RSVP. For more info: Contact Debbie Drummond at seniors@centerami.org or call (941) 778-1908 VIP Center Programs VIP Center Programs Tuesday, April 11 th – Tuesday Trivia at 10:30 a.m. Thursday, April 13 th – Table Games at 10:30 a.m. Monday, April 17 th – Lawn Games at 10:30 a.m. Monday, April 24 th – VIP Lunch Bunch at the Center 12-2 p.m. Wednesday, April 26 th – Word Games & Wisdom at 10:30 a.m. For more info: Contact Debbie Drummond at seniors@centerami.org or call (941) 778-1908 Quick Info and Links Center Hours: Monday - Thursday 7 AM - 8 PM Friday 7 AM - 7 PM Saturday 8 AM - 3 PM Center Schedule Sports Schedules Phone: 941.778.1908 Email: hello@centerami.org Annual Impact Report: Leaving a legacy supports growth for future generations! Dear Center Community,\r\n\r\nAs I reflect on this past year, I am filled with gratitude for the unwavering support and trust you place in The Center of Anna Maria Island. My name is Jillian Ptak, and I am proud to serve as … Read More Center Contact 407 Magnolia Avenue PO Box 253 Anna Maria, FL 34216 Phone: 941.778.1908 Email: hello@centerami.org Center Hours: Monday - Thursday 7 AM - 8 PM Friday 7 AM - 7 PM Saturday 8 AM - 3 PM Public Rights Refund Policy Code of Conduct Copyright © 2025 The Center of Anna Maria Island"
    },
    {
      "url": "https://www.islander.org/2018/05/center-operations-director-named-new-executive-director/",
      "text": "Center operations director named new executive director - The Anna Maria Islander 33 Body of missing Bean Point swimmer recovered Holmes Beach, county officials discuss paid beach parking Bradenton Beach moves to adopt $5M budget Cortez Marina neighbors push back on public boat ramp plan Toggle navigation E Edition News Latest News Streetlife Real Estate Obituaries Sports Sports Fishing Classifieds This weeks ads Place an AD Contact Us islander Store Submit Subscribe Today! Island news brings us together Subscribe for unlimited digital access to the news that matters to your community. #AMITOGETHER Center operations director named new executive director May 8, 2018 | Be the first to comment Facebook Twitter Subscribe By Bianca Benedí and Kathy Prucnell Islander Reporter The Center of Anna Maria Island has a new executive director, and it looks like the solution was close to home. Chris Culhane, a lifelong islander who has served as the center’s operations director since 2015, will succeed interim director Carl Weeks as the leader of the nonprofit at 407 Magnolia Ave., Anna Maria. The center board issued a statement May 4 announcing the hire. Former executive director Kristen Lessig announced in January she was leaving for a position at the Sarasota YMCA. Human resources consultant Margaret Beck was employed to lead a hiring committee. More than 170 people applied for the position, which took nearly three months to fill. In a statement, board chair David Zaccagnino said Culhane emerged as a “top choice” in the selection process, citing his work in recent months to keep the center running during the search. “He is a natural, and has stepped into the leadership position with purpose,” Zaccagnino wrote. Culhane also issued a statement thanking the center board for selecting him. “As executive director, I pledge to steer our center to a path of sustainable success as we enter this next phase of history,” he wrote. Culhane said he spent his childhood at the community center, participating in sports, volunteering at the concession stand or “simply having fun.” He said in the past four decades, he has spent his time contributing to the center through coaching, volunteering and as a member. His short-term plans for the center include filling vacant staff positions, preparing for the summer’s camp program and finalizing the budget for the 2018-19 fiscal year, which begins July 1. Center leader, sovereign citizen? Run-ins with the law for driver’s license violations and forgeries point to Chris Culhane’s belief in a sovereign citizenry. Culhane, 43, was arrested in 2012 and 2013 for driving with a suspended license and, the following year, he was arrested for forging court documents. A pre-trial diversion contract was the end of the road for Culhane on two counts of forgery brought by the Manatee County Sheriff’s Office in April 2014 for filing more than 300 illegitimate court papers in a domestic relations action that resulted in divorce. Twelfth Circuit Judge Robert Farrance dismissed his 2012 arrest for driving with a suspended or revoked license in Bradenton. Farrance withheld adjudication in Culhane’s 2013 case for driving in Holmes Beach with a suspended license. A withhold means there’s no court record of a conviction despite a finding of guilt. Both license cases show multiple filings from Culhane as a pro-se litigant. So what’s up? A March 2013 probable cause affidavit from Holmes Beach Police Officer Garrett Shaffer sheds some light: “The defendant has previously informed the Holmes Beach Police Department as well as the Manatee County Sheriff’s Office that the defendant is a sovereign citizen and is not subject to state laws.” According to the HBPD report, Culhane was uncooperative and told the HBPD he did not require a driver’s license because he held “an international license.” According to Wikipedia, sovereign citizens “see themselves as answerable only to their particular interpretation of the common law … not subject to any government statutes or proceedings.” Culhane did not respond May 7 before press time to a phone call for comment. Zaccagnino said May 7 the board was aware of the charges and also unconcerned. He claimed the charges were related to a foreclosure on property Culhane owned. More from The Islander May 8, 2018 Cortez Bridge: Battle fatigue or new resolve? May 8, 2018 Bradenton Beach officials address Cortez Bridge concerns May 8, 2018 Prosecutor: Bradenton Beach officer justified in shooting May 8, 2018 It’s 38 years since fateful day the Sunshine Skyway went down Facebook Twitter Subscribe To advertise here, please visit our rates page or contact us at: sales@islander.org Phone: (941) 778-7978 Fax: (941) 778-9392 The Islander Poll: Do you swim at Bean Point? Yes. I used to. Never did. Where’s that? View Results Loading ... 3-Day Weather Forecast Newsletter signup Sign up to receive FREE email alerts when we update our site with news and classfieds. Email Please wait... Subscribe Thank you for sign up! Popular News Islander E-Edition For $36 a year , you can view all the news, photos, opinions, columns and community announcements To access this content, you must Subscribe here , or log in if you are a member. View our e-Edition Members On your mobile On your tablet Get news alerts Contact us Contact Us The Anna Maria Islander 10303 Spoonbill Road W., Bradenton FL 34209 Phone: (941) 778-7978 Fax: (941) 778-9392 For general information: info@islander.org Site design & maintained by Wayne Ansell Islander News Headlines E Edition Classifieds Place a Classified Ad Fishing Obituaries Real Estate Sports Streetlife Other Links About Us Legislative Contacts Privacy Copyright Archives Island Links Islander Store Web Services Subscribe Newsletter signup Sign up to receive FREE email alerts when we update our site with news and classfieds. Email Please wait... Subscribe Thank you for sign up! Social Media We use cookies to ensure that we give you the best experience on our website. If you continue to use this site we will assume that you are happy with it. Ok"
    },
    {
      "url": "https://centerami.org/giving/legacy/generations-of-community/",
      "text": "Generations of Community - The Center of Anna Maria Island The Center of Anna Maria Island The community's gathering place Donate Join Contact About Center Schedule Forms Staff Awards and Distinctions Join Our Team Board Members Center Financials When is The Center Open? Center History Programs Wellness Youth Beyond The Classroom: Before & After School: K-5th Graders All Day Camps Youth Classes Teens Dolly Parton’s Imagination Library Sports Farmers Market Culture/Education Wellness Group Fitness Classes Fitness Instructors Specialty Fitness & Wellness Personal Training Massage & Acupuncture Sports Youth Sports Adult Sports Tennis Pickleball Concerts Events Memberships Support Become a Sponsor Volunteer JvZ Scholarship Rock ‘N’ Support Grant Giving Legacy Generations of Community Donate Generations of Community Families have called The Center home for generations. It’s about grandparents who built this place, parents who volunteered their time, kids who grew up playing on our fields, and now their children doing the same. We’ve been collecting stories from these incredible families, some with four and even five generations connected to The Center. Their stories remind us that The Center is more than a facility, it’s a part of what makes our island feel like home. If you have a story to share, please send it to Jillian Ptak at development@centerami.org Give today and help us keep The Center thriving for the next generation: Click here Hutchinson Family In the 1950s, a group of devoted community members—Patsy and Fred Hutchinson, Bennie Scanio, and others—recognized the need for a place where island youth could gather, play, and grow. They lobbied the School Board and the city to secure land adjacent to the old schoolhouse, an overgrown stretch of mangroves affectionately known as “Fiddler’s Flat.” “It was covered with mangroves and filled with fiddler crabs,” recalled Marie Scanio Franklin. “Hartley Blackburn, who was superintendent of public instruction, got the School Board’s approval because everyone felt it was important to give the kids something to do.” With community backing and land swaps with local property owners, the area was designated as a youth center. But progress was slow—until heartbreak turned into hope. In 1959, after the tragic death of Bennie Scanio’s son, Benji, the grieving father asked that donations be made toward building a baseball field in his son’s memory. Fred Hutchinson, Bennie Scanio, Dr. Roy Gunther, and others began clearing the land and raising funds. Major league players Warren Spahn and Earl Torgeson, along with local pharmacist J.D. Webb, joined the effort. Together, they built what would become more than just a field—it became the heart of a community. “In those days, there were so few of us here,” remembered Chris Torgeson Shaw. “We laughed together; we cried together. When Benji died, it broke all our hearts. It reflects what our community was like—from young to old, we were involved in each other’s lives.” The baseball field was completed and dedicated to Benji Scanio in 1960. Soon after, the community came together to renovate and expand the old schoolhouse. The Anna Maria Island Youth Center was officially incorporated in May 1960 and formally dedicated on July 2, 1961. That spirit of community and connection lives on today—especially through families like the Hutchinsons, whose legacy stretches across three generations. Fred Hutchinson, one of the original founders, helped build the baseball field. His children grew up playing at The Center, and now, his grandson continues the tradition. Just like his father, aunts, and uncles before him, he grew up here—on the same fields his grandfather helped create. “I started playing sports at The Center when I was just six years old—and I’m still playing today in the adult soccer league,” he shared. “Some of my favorite memories are the youth lock-ins and just hanging out with friends. It was always the place where we gathered.” Through the years, The Center has been more than just a place for activities—it’s been a place of belonging. “It’s the cornerstone of Anna Maria,” he said. “I hope to bring my children here one day and give them the same experiences I had.” And his hope for the future? “That The Center continues to offer youth sports and a safe place for kids to grow up and learn—just like I did.” Katrina Lathrop & Trevor Bystrom I have been a part of The Community Center for 2 generations now.  I moved to Anna Maria in 1992 in kindergarten, and attended the very new after school program (I think it was me, my brother, and Jeff Ambut), and played just about every sport/ extra-curricular activity offered. I’m pretty sure my Husband (Trevor Bystrom)’s family has been a part of it from the start. Most of my core childhood memories happened at The Community Center. I remember attending my first celebration of life for a counselor there, (I believe his name was David), who passed away from Leukemia.  Not a happy memory, but a core one for sure. Lots of lessons learned under that roof.  So many summer camps, field trips, sports/seasons, and friendships made there. I had some of my first responsibilities of working the concession stand or helping announce a baseball game there. Although I played pretty much every sport offered, I wasn’t good at very many. Pretty sure they needed a certain number of girls for the major leagues though, so I somehow ended up on those teams, but my skills and depth perception weren’t always up to par.. Sorry coaches. I’ll never forget Jolly Rancher Bill, the OG Island Van, the payphone out front or the whole original building for that matter, nor the 5+ bikes I had stolen from the center over the years 😉 A childhood full of good memories at AMICC! Being raised on the Island by a single mother, meant the Community Center was our village. It no doubt had an integral part of my brother and I’s upbringing, and I don’t know what our childhood would have looked like without it. It was so special watching my Daughter attend summer camps and play soccer at the place where I truly grew up. I hope The Center continues to provide a safe place for kids to go to experience new opportunities, develop lifelong friendships, and have fun!  And keep that music coming Holmes/Holiday Family I am 4th generation and my son is 5th generation.  We have been a part of the center for that long.  My grandfather went to school there when it was the school house.  I grew up going to the center for my brother’s soccer, baseball games.  I worked the concession stand- (some will ask where that was) haha- bubble gum 25 cent I volunteered there as a teenager.  My father sat on the board and I grew up knowing The Center truly was the heart of the island.  From there I have always made the center my main focus for donations, time, anything they need. I am not sure I should talk about some of my favorite memories there (learning pool), playing kick ball, but let’s just say I learned a lot growing up there.  My favorite memories as a child is just how simple life was and how you didn’t run into a single person that was mean or not helpful.  Watching my brother and his bud’s play on the field, my dad and then myself chipping in and decorating, cleaning up, lending a hand when needed.  The laughs, the people.  As a mom it came full circle watching my son play on the very same field. The Center, being led by one of my childhood friends. Who was always there the same as myself.  My son is now there often and it brings tears to my eyes that the island has preserved this piece of history for generations to come. The Center should always be a home for all kids that want to come play, pick up a sport, hang out, and check in.  If you are an islander, you raise island kids and they are free range- the center lets them be just that.  I hope it is always a place where we can come together as a community and laugh, cry, inspire, celebrate, help out.  I love the gym and the classes and the ability to have the cafe with juices, breads, etc.  It is very in line with the authenticity to inspire new businesses and give them a chance.  That is what The Center is about… Hunt/Moore Family I’m Kelly Hunt and my family grew up on Anna Maria Island, and The Center was a huge part of my childhood. I have so many fond memories of spending time there.. whether it was watching my brother Justin Moore play T-ball, participating in different sports like tennis and I remember taking a dance class with Nicole Wagner now (Plummer) in about 2nd grade, or simply running around the grass fields with my brother Justin Moore and sister Katie Moore and other local Islanders. Some of my earliest memories are of being at The Center, playing, learning, and making lifelong friendships. How many generations of your family have been part of The Center? My parents raised us and now we take our son Kellan and my brother and sister take all their kids to the center for sports and community events. My family has been connected to The Center for multiple generations. From my childhood days spent playing sports and making friends to my own children experiencing the same sense of community, The Center has always been a place where our family has come together. Some of my favorite memories include cheering for my brother during his T-ball games, working the concession stand with my mom during the games, playing sports with my friends, and just enjoying the simple joy of running around the fields. The Center was where I learned teamwork, made lasting friendships, and felt a true sense of belonging. The Center has always been more than just a sports and recreation facility. It’s been a hub for the community. It provided a safe and welcoming place for us to grow, play, and connect. Over the years, it has remained a special part of our family’s story, offering opportunities to stay active, meet new people, and be part of something bigger. But beyond just childhood memories, The Center has also been a lifeline for our community in times of need. When the recent hurricane nearly destroyed our island, The Center became a place of refuge and support. It was where people came together to collect supplies, provide food, and offer help to those who lost so much. It was a powerful reminder of how strong our community is and how The Center has always been more than just a place for sports…it’s the heart of the island, bringing people together in both good times and bad. I hope The Center continues to be a place where kids can play freely, learn valuable life lessons through sports and activities, and create lasting friendships like I did. More than anything, I hope it remains a welcoming space where the island community can come together and support one another. Sato Family Barbara Sato Four Generations!  My parents, me, my kids, my grandkids! My favorite memories are my 5 boys playing all kind of sports there and now my grandkids!  I am most proud to see my kids and even my daughter in law coach taking after my husband who coached for many many years. I gave of my time serving on the board and am now proud to be able to give financial. It has been the hub of our family times together! I pray it continues to serve the children! Josh Sato As a kid we used to bike up there almost every day to meet our friends. That was the meet up spot before cell phones. Some of my best friends I met here. My dad coach us growing up here. It was and still is a very big part of my life for sports and connection with other adults. I hope that it continues to provide youth sports for kids to make friends and memories like I did as a child. Lauren Sato One of my favorite memories of The Center was right after Covid, when everyone was finally able to gather again. Being back at The Center, outside with friends, felt so special. The kids were smiling, laughing, and just so happy to be together. The Center is important because it truly encompasses family values. It’s a place where you’re surrounded by like-minded people who care about community and fostering relationships. The Center genuinely gathers people together. I hope The Center continues to foster a strong sense of traditional values and integrity for future generations. It’s hard to put into words, but it’s that classic, close-knit feeling, where neighbors look out for one another, kids play freely, and families make memories. Time spent at The Center is always time well spent and I hope generations have the same experience. Webb Family Four Generations of Community at The Center of Anna Maria Island Our family’s connection to The Center of Anna Maria Island runs deep—four generations deep, in fact. It all began in the early 1950s, when my grandmother, Polly Archer Beaver, first came to Anna Maria Island from Wrightsville, Georgia. By the 1960s, she began going to The Center along with my mother, Jacqueline Webb, father JD Webb SR. and my sister, Paulette Webb. The Center quickly became a part of their daily lives and the heart of our growing family’s island experience. My grandmother Polly was also deeply involved in the community beyond The Center—she became the first city clerk of Holmes Beach, setting an example of service and leadership that continues in our family to this day. My father, JD Webb Sr., contributed in his own lasting way by opening the island’s first drug store and soda fountain, which quickly became a favorite gathering spot for locals. My brother Joe Webb and I were both born at Manatee Memorial Hospital and have lived on the island all of our lives. We grew up in The Center. From an early age, it became our playground, our classroom, and our gathering place. Joe and I both married and raised families here, and our children have carried on the tradition. My three children—JD Webb, Nicole Webb Chastain, and Ben Webb Jr.—along with Joe’s two children—Erica and Joey Webb—all spent their youth at The Center, involved in countless activities. Now, the fifth generation is growing up with The Center, just as we did. Nicole’s children, Harper and Jase, and Ben Jr.’s son, Archer, are all part of The Center’s youth sports programs and daycare. Seeing them run around the same fields and halls that shaped our own childhoods is something truly special. Personally, I don’t even remember my first time going to The Center—I was still a baby when my parents brought me to a community clambake there. But some of my earliest memories include playing baseball, football, and soccer on the fields. Summers were magical—spent full-time at The Center and freely roaming the island with friends made through its programs. Some of my favorite memories are milestones celebrated at The Center. My mother’s 75th birthday was held there, filled with family and laughter. My daughter’s wedding reception was another beautiful moment shared in that same space. Now, I have the honor of serving on the board of directors and volunteering my time to give back to the place that gave so much to me. The Center of Anna Maria Island has been more than just a community facility—it’s been a constant, grounding force in our family’s life. Socially, emotionally, and physically, it’s helped shape who we are. It’s brought us closer as a family, and it’s given us a strong sense of belonging. That was especially evident during this past year, as the community came together after the Hurricanes. The support The Center provided during those difficult times showed its true value—not just to our family, but to everyone on the island. Looking ahead, my hope is that The Center continues to thrive for generations to come. I want it to be the place where my grandchildren and great-grandchildren learn, play, celebrate, and grow. I want it to remain a cornerstone of the community—a safe, welcoming space for every family, just like it’s always been for ours. Yes, you are welcome to share our story and a family photo on your social media pages. We’re proud to be a part of The Center of Anna Maria Island’s legacy—and even prouder to watch that legacy continue. Franklin Family We have 4 generations of our family who have been a part of the center. Our Grandparents, (Bennie & Antoinette Scanio) Our Parents (Norm and Marie Franklin), and ourselves (Dina Franklin, and Dawn (Franklin) Bates) and our kids (Tyler Brewer and Travis Bates) It all starts with our Grandparents, Bennie and Antoinette.  Our Mom had a younger brother (Benji Scanio) who passed away when he was 6 years old.  At that time there was no real spot for kids to play therefore in Benji’s memory, our Grandfather along with Professional Baseball Pitcher/Manager, Fred Hutchinson worked together along with several members of the island community back then,  to build the baseball field at the center. It was the spot all age kids could hang out and parents knew they were safe.  Through all the years we have attended wedding receptions, personal parties and local events at The Center. One of the most memorable and fun was back in the late 80’s/90’s on 4th of July the Anna Maria Privateers would put on a cookout. Everyone contributed donations. It included food, drink, and lots of local musicians who would perform throughout the day.  It was an all-day affair. Come and go as you please.  Just so much fun and back then everyone knew everyone. The Center has always been something on Anna Maria Island that always has brought the community together and continues to do.  Both of our sons, Tyler Brewer and Travis Bates, have grown up in this center playing sports from ages 4 to their present ages, 22 & 20.  Through those years they have made long lasting friendships.  My son Tyler Brewer is now an employee here along with his best friend he has known since 2 years old, Tuna McCracken.  Now my sister and her husband (Dawn and Dusty Bates) have their granddaughter (Ariyah) playing sports here. We hope it continues to do what it is presently doing.  Providing all types of events, sports, classes, concerts, etc. that appeal to all the variety of ages in our Island Community so everyone can enjoy it. We LOVE EVERYTHING about The Center:  Dina Franklin, and Dawn (Franklin) Bates.  Sisters who are born and raised on Anna Maria Island and have been fortunate to raise our families in the wonderful Island Community. Tyler Brewer I’m a 4th generation (great grandparents, grandparents, mom, me) Everything. I’ve been around the center my entire life. Playing sports when I was a kid to now working there, continuing to play sports in the adult leagues and going to the gym. I spend 3/4 of my life there lol, but it’s been nothing but amazing. It’s the center stone of the community. The heart of the Island. The center brings everyone together. Hosting all sorts of events and activities. It provides comfort and support from everyone involved. (Coaches, volunteers, workers, etc) I hope the center continues to keep the island culture alive. I hope it continues to make youth a big priority. They are the future. I hope The Center continues to be the reason the community is what is now. Without The Center that’s all gone. Rudacille Family My family and I have been part of The Center for 3 generations. I have many fond memories at The Community Center as a youth myself. From all the summer camps, to Basketball games (where I had a sweet spot), T-ball (when I realized I was horrible at sports), Miss Lisa’s Dance class where I FINALLY got to really shine! BUT, my fondest memories now are those built with my own kids and husband. The community center has really defined a lot of our friendships and our kids’ lives. We have created so many friendships that will last a lifetime. The Center creates a sense of home for everyone. It is not one person’s space, but a place where we can all feel like we belong. It has a feeling of community where it brings families together, young toddlers, all the way to the silver sneakers group. All ages in one place where we all love and respect each other. There are not many places that can do that. There’s something special about a place that makes you feel at home weather you have lived here your whole life or just moved into town. It’s the place to be to make friends, have fun, and create lasting memories. I wouldn’t trade this place for the world! I hope The Center continues to live on for many more generations to come. Without The Center our island has no sense of community. It is the glue who holds us all together. I will forever be grateful for this one of a kind SPECIAL, SPECIAL place. Quick Info and Links Center Hours: Monday - Thursday 7 AM - 8 PM Friday 7 AM - 7 PM Saturday 8 AM - 3 PM Center Schedule Sports Schedules Phone: 941.778.1908 Email: hello@centerami.org Annual Impact Report: Leaving a legacy supports growth for future generations! Dear Center Community,\r\n\r\nAs I reflect on this past year, I am filled with gratitude for the unwavering support and trust you place in The Center of Anna Maria Island. My name is Jillian Ptak, and I am proud to serve as … Read More Center Contact 407 Magnolia Avenue PO Box 253 Anna Maria, FL 34216 Phone: 941.778.1908 Email: hello@centerami.org Center Hours: Monday - Thursday 7 AM - 8 PM Friday 7 AM - 7 PM Saturday 8 AM - 3 PM Public Rights Refund Policy Code of Conduct Copyright © 2025 The Center of Anna Maria Island"
    },
    {
      "url": "https://annamariaislandchamber.org/event/bingo-at-the-center/2025-03-14/",
      "text": "Bingo at The Center - Anna Maria Island Chamber of Commerce Call us Anna Maria Island Chamber of Commerce Call today 941-778-1541 Facebook Twitter Instagram Youtube Pinterest LinkedIn Jobs Request Info Join Now MENU MENU Directory Where to Stay Where to Eat Where to Shop Fun & Leisure Weddings Special Events Home Services Professional Services Relocation Resources Community Resources View All Categories Events About our Island Events Community Events Chamber Events Submit Your Event Event & Scholarship Forms About Demographics, Climate, Wildlife Anna Maria Island History Volunteer Opportunities Job Listings Subscribe to Our Newsletter Community Coupons Island Trolley About the Trolley Track the Trolley Advertise on the Trolley Trolley Giving Back Program Membership Membership Account Become a Member Learn How We Can Help You Staff Ambassadors Board of Directors Contact « All Events This event has passed. Event Series: Bingo at The Center Bingo at The Center March 14 @ 6:00 pm - 8:00 pm « Coquina Beach Market 2025 Savor the Sounds » COME JOIN THE FUN AT THE CENTER!!!! Bingo is a game of CHANCE…and a great way to come out, socialize with friends (or make new ones), and support your community’s gathering place! Tell your friends and neighbors and be sure not to miss out on the action. Prizes are available to winners!!! Gift certificates from restaurants or other local businesses. 2025 Dates: January 17th, February 21st, March 14th, and April 18th 6pm-8pm We will have drinks & snacks available for donation. Add to calendar Google Calendar iCalendar Outlook 365 Outlook Live Details Date: March 14 Time: 6:00 pm - 8:00 pm Series: Bingo at The Center Event Category: Community Events Website: https://centerami.org/events/ Organizer The Center of Anna Maria Island Phone 941-778-1908 Venue The Center of Anna Maria Island 407 Magnolia Avenue Anna Maria , 34216 United States + Google Map Phone 941-778-1908 View Venue Website « Coquina Beach Market 2025 Savor the Sounds » Anna Maria Island 5313 Gulf Drive, Holmes Beach, FL 34217 941-778-1541 info@annamariaislandchamber.org Facebook Twitter Instagram Youtube Pinterest LinkedIn © Anna Maria Island Chamber of Commerce . All rights reserved. Digital marketing by Two Oceans Digital . Site Map | ADA Website Compliance | Privacy Policy Please ensure Javascript is enabled for purposes of website accessibility"
    },
    {
      "url": "https://centerami.org/donate/",
      "text": "Donate - The Center of Anna Maria Island The Center of Anna Maria Island The community's gathering place Donate Join Contact About Center Schedule Forms Staff Awards and Distinctions Join Our Team Board Members Center Financials When is The Center Open? Center History Programs Wellness Youth Beyond The Classroom: Before & After School: K-5th Graders All Day Camps Youth Classes Teens Dolly Parton’s Imagination Library Sports Farmers Market Culture/Education Wellness Group Fitness Classes Fitness Instructors Specialty Fitness & Wellness Personal Training Massage & Acupuncture Sports Youth Sports Adult Sports Tennis Pickleball Concerts Events Memberships Support Become a Sponsor Volunteer JvZ Scholarship Rock ‘N’ Support Grant Giving Legacy Generations of Community Donate Donate Support your Center! To learn about donating contact Jillian Ptak, Director of Development, at (941)778-1908 ext. 201 or development@centerami.org Help us sustain and enhance community impact for another 65 years. Building community, one donation at a time. General Support A donation to The Center’s annual fund help ensure The Center can continue to maintain our community wellness programs. Help sustain our ability to lead in providing the highest level of programs, events, and instructors at an extremely competitive price. Click here to give general support to The Center. If you have questions or want more information please contact our Director of Development, Jillian Ptak at development@centerami.org or (941)778-1908 ext.201 Scholarships- Sliding Scale Program Make a gift today of and make a difference in someone’s life: $1,500 and provide 1 child 20 weeks of after-school care $1,000 and provide 1 child 6 weeks of Summer Camp $500 and provide 5 monthly family memberships $200 and provide 8 seniors funding for senior adventures The Center of Anna Maria Island’s mission is to serve as the community’s gathering place where people of all ages: children, teens, adults, and seniors can come together and make friends. At The Center they may play sports, be apart of our Beyond the Classroom after school program, come to work out, enjoy an afternoon tea for companionship. We know that people sometimes need help in order to participate in these activities and so we offer a sliding fee scale for those who qualify…we will NEVER turn anyone away for their inability to pay. To make a donation you can mail a check to The Center at PO BOX 253 Anna Maria, FL 34216 or click the link to make a donation online. If you have questions or want more information please contact our Director of Development, Jillian Ptak at development@centerami.org or (941)778-1908 ext.201 Thank you for Foundation and Grant Support! Quick Info and Links Center Hours: Monday - Thursday 7 AM - 8 PM Friday 7 AM - 7 PM Saturday 8 AM - 3 PM Center Schedule Sports Schedules Phone: 941.778.1908 Email: hello@centerami.org Annual Impact Report: Leaving a legacy supports growth for future generations! Dear Center Community,\r\n\r\nAs I reflect on this past year, I am filled with gratitude for the unwavering support and trust you place in The Center of Anna Maria Island. My name is Jillian Ptak, and I am proud to serve as … Read More Our Sponsors thank you, thank you, thank you Center Contact 407 Magnolia Avenue PO Box 253 Anna Maria, FL 34216 Phone: 941.778.1908 Email: hello@centerami.org Center Hours: Monday - Thursday 7 AM - 8 PM Friday 7 AM - 7 PM Saturday 8 AM - 3 PM Public Rights Refund Policy Code of Conduct Copyright © 2025 The Center of Anna Maria Island"
    },
    {
      "url": "https://annamariaislandchamber.org/contact/",
      "text": "Contact - Anna Maria Island Chamber of Commerce Call us Anna Maria Island Chamber of Commerce Call today 941-778-1541 Facebook Twitter Instagram Youtube Pinterest LinkedIn Jobs Request Info Join Now MENU MENU Directory Where to Stay Where to Eat Where to Shop Fun & Leisure Weddings Special Events Home Services Professional Services Relocation Resources Community Resources View All Categories Events About our Island Events Community Events Chamber Events Submit Your Event Event & Scholarship Forms About Demographics, Climate, Wildlife Anna Maria Island History Volunteer Opportunities Job Listings Subscribe to Our Newsletter Community Coupons Island Trolley About the Trolley Track the Trolley Advertise on the Trolley Trolley Giving Back Program Membership Membership Account Become a Member Learn How We Can Help You Staff Ambassadors Board of Directors Contact Contact Us For more information about Anna Maria Island, the Anna Maria Island Chamber or our members, you may visit, call or fill out the form below. Your Name (required) Email (required) Address (required) Address Line 2 City (required) State (required) Zip Code (required) Please send me an Information Packet Yes No I would like members to email me about: PLEASE NOTE: Checking boxes will result in multiple members e-mailing you independently on their products/services. Attractions Community Resources Fishing/Sailing Charters Galleries and Museums Golf - Courses/Instruction/Rental/Equipment Health and Wellness Home Services Professional Services Recreational - Adventures/Tours Recreational Rentals - Water/Air/Land Relocation Resources Spas and Salons Transportation and Shuttle Services Weddings and Special Events Where to Eat Where to Shop Where to Stay Should you elect to receive e-mails from our members, DO NOT mark them as SPAM as you are agreeing to solicit information from our membership. Details about your stay Arrival Departure Number of Adults Number of Children Smoking? Yes No Pets? Yes No How did you hear about our chamber? Questions/Comments PLEASE CLICK \"SUBMIT\" ONLY ONCE. It may take a moment to process your request and duplicate submissions will result in duplicate responses from vendors. Thank you. Anna Maria Island 5313 Gulf Drive, Holmes Beach, FL 34217 941-778-1541 info@annamariaislandchamber.org Facebook Twitter Instagram Youtube Pinterest LinkedIn © Anna Maria Island Chamber of Commerce . All rights reserved. Digital marketing by Two Oceans Digital . Site Map | ADA Website Compliance | Privacy Policy Please ensure Javascript is enabled for purposes of website accessibility"
    },
    {
      "url": "https://centerami.org/about/center-pr/",
      "text": "Center News - The Center of Anna Maria Island The Center of Anna Maria Island The community's gathering place Donate Join Contact About Center Schedule Forms Staff Awards and Distinctions Join Our Team Board Members Center Financials When is The Center Open? Center History Programs Wellness Youth Beyond The Classroom: Before & After School: K-5th Graders All Day Camps Youth Classes Teens Dolly Parton’s Imagination Library Sports Farmers Market Culture/Education Wellness Group Fitness Classes Fitness Instructors Specialty Fitness & Wellness Personal Training Massage & Acupuncture Sports Youth Sports Adult Sports Tennis Pickleball Concerts Events Memberships Support Become a Sponsor Volunteer JvZ Scholarship Rock ‘N’ Support Grant Giving Legacy Generations of Community Donate Center News Center Closed March 24, 2020 AMI Center Community, Thank you for all the positive messages of support and encouragement over these last few days. We are grateful to have such a strong AMI community – supporting each other and The Center. We’re all in this together. And in times like this, our community is more important than ever. On Friday, March 20th at 4:00 pm Eastern Standard Time, Florida Gov. Ron DeSantis ordered all gyms and fitness centers to shut down. The move was part of an executive order released that also mandated all restaurants and food establishments in Florida to suspend on-premises food and alcohol consumption, effective immediately. This unprecedented order ceases all operations at The Center effective immediately. For the first time in our 60 years of existence, The Center and our staff are not able to serve the community that we love. The Center Staff, Management and Board are heartbroken. We know you’d prefer to be here with us, working out, attending a group fitness class or having your children surrounded by their friends, playing sports, learning and growing in our youth or family programs. But our overall safety is paramount. We are forever grateful for the community support that allowed The Center to turn the corner financially over these past few years and we are hopeful such support continues during this difficult time so that we might reopen our doors as soon as possible to once again serve our AMI community for another 60 years. As The Center responds to our community’s needs during this unprecedented time, we ask that you retain your membership with us. Not as a facility member, but as a cause-driven member. We ’re asking that you stay with us, as we respond to and support our neighbors and community – together. With our temporary suspension of facility access and programs, we are actively working to make our facility available to provide child care for our medical professionals, first responders, and other critical support organizations. Staying with us ensures The Center remains strong during this difficult time and is poised to come back quickly and support our community who need us most. Our website is the best place to stay up to date with the latest Center information. Please visit www.CenterAMI.org to stay up to date. Our focus on The Center’s Mission remains unwavering even in these unsteady times. Thank you for your partnership, your support, and your trust. Stay safe y’all. Christopher M Culhane Executive Director The Center of Anna Maria Island | 407 Magnolia Ave, PO Box The Center of Anna Maria Island Hires Executive Director After thorough search by The Center Hiring Committee Christopher Culhane named Executive Director Anna Maria, FL (February 16, 2018) The Board of Directors of The Center of Anna Maria Island is pleased to announce the appointment of life long islander Christopher Culhane as the organization’s new Executive Director. The search for Executive Director began this past February after Kristen Lessig resigned from the leadership role. The Board of Directors quickly formed a Hiring Committee and hired HR consultant Margaret Beck to fill the vacant position. The Committee included Center Board Members Karen Harllee, David Zaccagnino, John Munn, business owner Barbara Sato, and County Commissioner Steve Jonsson.  Margaret Beck is a senior human resources professional who brought over 25 years of experience to the committee. Beck has lived in the area for over 30 years and has done recruitment for numerous organizations within the area. The Center received over 170 applicants for the position. Each resume was evaluated to see if they met the qualifications and characteristics The Center was looking for in the new Executive Director. Applicants were then narrowed down through phone interviews by Beck. Then meeting to discuss the candidates, the committee did a series of in depth face to face interviews with the finalists. After a long and thorough search the Board of Directors voted and confirmed the committee’s decision and choice to make Christopher Culhane The Center’s next Executive Director. David Zaccagnino – Board Chairman states: “Thanks to the leadership from the prior Board of Directors and former Executive Director Kristen Lessig, the Center is in a great position, and is excited to seamlessly promote from within. After an extensive search and many months of committee work, Chris Culhane came out as our top choice. He has proven himself over the years and has earned the opportunity of Executive Director. During the past couple months, Chris has been working closely with interim Executive Director, Carl Weeks, the Finance committee, the Board of Directors, and several grant & fundraising committees. He is a natural and has stepped into the leadership position with purpose. We are pleased to have Chris as our new Executive Director. Come up to the Center and give him a high five. “ Christopher Culhane has been a life long island resident and is humbled by The Boards appointment. For more information please refer to the brief introduction letter, along with several pictures of him as a child at The Center. About The Center of Anna Maria Island The Center of Anna Maria Island is a nonprofit community center on Florida’s Anna Maria Island, focusing on the community and welcoming all, as the community’s gathering place . Its mission is to enhance the overall well-being of individuals of all ages—serving children, teens, families, adults and senior citizens—while preserving a sense of community through creative programs and partnerships. The Center strives for excellence to meet the human service needs of all those living on or near the barrier island. Known as the community’s gathering place , the Center is open to all. It is often seen as an “Educational Center,” “Recreational Center,” “Youth/Teen Center,” “Fitness Center” and “Senior Citizen Center.” The Center is all of these and much more. Join programs , sports , events , and learn more at www.centerami.org . The Center of Anna Maria is located at 407 Magnolia Avenue in Anna Maria. Contact The Center at 941)778-1908 or info@centerami.org . Dear Center Community, It is with great pleasure that I have accepted the offer which has been bestowed upon me by The Center’s Board of Directors and the Hiring Committee to become The Center of Anna Maria Island’s next Executive Director. I am humbled and ultimately grateful for the opportunity and I would like to thank The Board, The Committee, local business owners that participated in the search, the dedicated staff, and the AMI community as a whole. As many of you may know, I am of a thinning breed of native islanders that grew up here in this tiny piece of paradise. The Center was truly my backyard. If I was not biking the 7 mile stretch of the island or swinging from a tree, I was definitely at The Center engaging with my island community, playing sports or just simply having fun. Proudly, The Center still provides these same attributes today and my three children are lucky enough to get to experience what I once had. Over the past four decades, I have been an active participant in the community and at The Center by either coaching, volunteering or just playing sports. Almost three years ago I accepted an administrative position which furthered my involvement with The Center and it has been a road of growth, learning and development. Now as Executive Director I pledge to steer our Center to a path of sustainable success as we enter this next phase of history. Upon accepting this position, I will have the urgency to visit goals I would like to see for The Center. And over the next weeks, I will be meeting with our board, our dynamite team, our local business leaders, and other community members to get feedback on how we can ultimately achieve a “best in class” facility the entire community can be proud of. Some items we will be addressing in the short term are: Interviewing and hiring for our current vacant staff positions, preparing for summer camp to give the children the greatest opportunities and experiences imaginable, and finalizing next fiscal year’s budget with The Board and finance committee. “You can only become truly accomplished at something you love.” ~Maya Angelou I love this community and I love The Center. With the goals set high we will be working with our integral community leaders, The Board, and The Center Team to review the strategic plan in order to build a sustainable model that drives The Center to success and truly leaves a legacy…a legacy that will hopefully inspire executive directors all the way down the line. Best Regards, Christopher M Culhane Center Earns 4 Star Rating The Center of Anna Maria Island Earns COVETED 4-Star Rating from Charity Navigator Demonstrating financial accountability and good governance, Largest independent charity evaluator gives Center exceptional rating Anna Maria, FL (February 19, 2018) – The Center of Anna Maria Island’s strong financial health, and commitment to accountability and transparency have earned it a 4-star rating from Charity Navigator , America’s largest independent charity evaluator. This is the first time the Center has earned this top distinction. “The Center of Anna Maria Island’s exceptional 4-star rating sets it apart from its peers and demonstrates its trustworthiness to the public,” according to Michael Thatcher, President and  CEO, Charity Navigator. “Only a quarter of charities rated by Charity Navigator receive the distinction of our 4-star rating. This adds the Center of Anna Maria Island to a preeminent group of charities working to overcome our world’s most pressing challenges. Based on its 4-star rating, people can trust that their donations are going to a financially responsible and ethical charity when they decide to support the Center of Anna Maria Island.” The Center’s rating and other information about charitable giving are available free of charge on www.charitynavigator.org . More-detailed information about the Center’s rating is available to Charity Navigator site visitors who become registered users, another free service. “Since becoming the Center’s executive director three years ago, it has been a priority for our donors to trust that we’re using their donations wisely to fulfil the Center’s mission—to enhance the overall well-being of individuals of all ages, while preserving a sense of community through creative programs and partnerships,” said Kristen Lessig, Executive Director, The Center of Anna Maria Island. “Our 4-star Charity Navigator rating demonstrates and reconfirms to our supporters the Center’s good governance and financial accountability.” Since 2002, using objective analysis, Charity Navigator has awarded only the most fiscally responsible organizations a 4-star rating. In 2011, Charity Navigator added 17 metrics, focused on governance and ethical practices as well as measures of openness, to its ratings methodology. These Accountability and Transparency metrics, which account for 50 percent of a charity’s overall rating, reveal which charities operate in accordance with industry best practices  and whether they are open with their donors and stakeholders. On June 1, 2016, Charity Navigator upgraded its methodology for rating each charity’s’ financial health with CN 2.1. These enhancements further substantiates the financial health of our four star charities. The Center’s exceptional Charity Navigator rating comes on the heels of positive financial and membership news at the close of 2017, with a $130,000 donation, record enrollment and participation that nearly doubled during the year. It also follows the award of two new grants, being named in a trust, and notified as the recipient of a donation from the sale of a local estate—all in early 2018. This follows the announcement that the Center’s executive director, Kristen Lessig, accepted a new position with the Sarasota YMCA, after successfully rehabilitating the Center to its current financially positive standing. Under Lessig’s leadership, and working in very close step with the Board, the Center paid off its $1.1 million commercial loan. About Charity Navigator Charity Navigator, www.charitynavigator.org , is the largest charity evaluator in America and its website attracts more visitors than all other charity rating groups combined. The organization helps guide intelligent giving by evaluating the Financial Health, and Accountability and Transparency of more than 8,000 charities. Charity Navigator accepts no advertising or donations from the organizations it evaluates, ensuring unbiased evaluations, nor does it charge the public for this trusted data. As a result, Charity Navigator, a 501 (c) (3) public charity itself, depends on support from individuals, corporations and foundations that believe it provides a much-needed service to America’s charitable givers. Charity Navigator, can be reached directly by telephone at (201) 818-1288, or by mail at 139 Harristown Road, Suite 101, Glen Rock, NJ, 07452. The Center partners with Island Fitness The Center of Anna Maria Island, located at 407 Magnolia Avenue on Anna Maria, is  GETTING FIT FOR OUR COMMUNITY!! We are excited to announce that  Island Fitness will soon be joining the Center as we work to fulfill our mission to enhance the overall wellbeing of individuals of all ages while preserving a sense of community through creative programs and partnerships . Following an operational review several weeks ago and a strategic analysis of our strengths, weaknesses, opportunities, and threats- the team at the Center, including key members of the staff, board, community, and city of Anna Maria identified the need to work more collaboratively within the community, driving partnerships to be even more successful in serving as a resource for overall wellness in our community. Further, the Center is grateful for the opportunity to be able to assist a local island business. The Center and Island Fitness are currently working through the specifics of the partnership agreement, as it relates to the transition of Island Fitness members. In the meantime, we are welcome all Island Fitness members to come in and tour the facility, trial one of our amazing classes. Additional details and finalized timeline will be released to both member groups  via email. Anna Maria CrossFit will still remain a key Center partner offering close to 30 hours of direct programming to benefit the Center and its membership development efforts. Additionally, Anna Maria CrossFit will be able to focus efforts on growing its active membership base with the inclusion of Cross Fit Kids programs beginning in November. The Center is always looking for ways to team up with other partners and businesses to improve our services provided to our community. Quote from Brenda Canning, Island Fitness owner,  “ I am looking forward to bringing my years of fitness experience to the community center to both increase the service offerings for Island Fitness members and to the community centers current members. I am confident that through this relationship we will be able to create a mutually beneficial opportunity for growth and community involvement.” Kristen Lessig, Executive Director of The Center added, “I am extremely excited about the opportunity to work with Brenda and the Island Fitness team. The Center team is looking forward to expanding our reach within the community through true collaboration. Brenda has an amazing reputation and following in the community, as well as expertise in the fitness industry that will add great value to the services we provide, while our expansive programs and committed staff  will allow for Island Fitness members to truly be part of our efforts to preserve the sense of community on the island.” Quick Info and Links Center Hours: Monday - Thursday 7 AM - 8 PM Friday 7 AM - 7 PM Saturday 8 AM - 3 PM Center Schedule Sports Schedules Phone: 941.778.1908 Email: hello@centerami.org Annual Impact Report: Leaving a legacy supports growth for future generations! Dear Center Community,\r\n\r\nAs I reflect on this past year, I am filled with gratitude for the unwavering support and trust you place in The Center of Anna Maria Island. My name is Jillian Ptak, and I am proud to serve as … Read More Center Contact 407 Magnolia Avenue PO Box 253 Anna Maria, FL 34216 Phone: 941.778.1908 Email: hello@centerami.org Center Hours: Monday - Thursday 7 AM - 8 PM Friday 7 AM - 7 PM Saturday 8 AM - 3 PM Public Rights Refund Policy Code of Conduct Copyright © 2025 The Center of Anna Maria Island"
    },
    {
      "url": "https://www.islander.org/anna-maria-i-love-you/",
      "text": "Anna Maria, I Love You - The Anna Maria Islander 33 Body of missing Bean Point swimmer recovered Holmes Beach, county officials discuss paid beach parking Bradenton Beach moves to adopt $5M budget Cortez Marina neighbors push back on public boat ramp plan Toggle navigation E Edition News Latest News Streetlife Real Estate Obituaries Sports Sports Fishing Classifieds This weeks ads Place an AD Contact Us islander Store Submit Subscribe Today! Island news brings us together Subscribe for unlimited digital access to the news that matters to your community. #AMITOGETHER Anna Maria, I Love You You be the judge: Test your knowledge of Anna Maria to see if you can figure out what year the following story was written, and what has changed and hasn’t changed about this Island since the story first published. Send your thoughts to news@islander.org. Anna Maria, I Love You By Wyatt Blassingame Twenty years ago my wife and I came to Anna Maria to spend the winter. We are still here. In that time the island has changed considerably; but then, I suppose, so have we. Twenty years is apt to change most things. We came down on the train. Friends met us in Bradenton and drove us out. There was, and still is, a long rickety bridge that swayed like a swing as the car went across it. At the island end of the bridge was a small cluster of houses. Then for five miles the road twisted, for no apparent reason, between jungle on the right and one great white sweeping beach on the left with the Gulf blue and green beyond it. Where a sign said “City of Anna Maria,” with nothing whatsoever except the sign to indicate it was a city, three pheasants ran across the road. I thought: “Some city!” Later I learned the pheasants belonged to Harry Ditmas who drove the mail truck. He hoped to populate the island with them, but they never prospered. I suppose raccoons ate the eggs. This island always has been a paradise for raccoons. We rented a house on the bay, with no nearby neighbors. It had two bedrooms, a living room, a dining room, kitchen, bath, three mice, several giant Florida spiders, a chameleon, and a blacksnake. Our first morning when I went across the road to swim, the blacksnake, which was basking on the front step, went with me. Gertie, my wife, watched from the window. When I got back she was packing. She was, she told me, on her way back to New York. She didn’t go. Before the end of the month something had happened to Gertie, who never before had seen an island — in fact she had seen hardly anything smaller than Philadelphia. Marjorie Rawlings once wrote, “There is an affinity between people and places … If there be any such thing as racial memory, the consciousness of land and water must lie deeper in the core of us than any knowledge of our fellow beings … And along with that deep knowledge of the earth is a preference of each of us for certain kinds of it.” Gertie had found her affinity. In those days fiddler crabs by the millions would retreat from the tides, going back and forth with a sound like wind in dead leaves. For a week Gertie was terrified of them. Then one day in sheer desperation she picked up one, put it on a fishhook, and caught a 2-pound sheepshead. After that you couldn’t have got her away from here with dynamite. Which is one of the strange things about this island. People love it — and I mean the word as something beyond mere liking — or they can’t abide it at all. Usually it takes only a short time to learn which. But there is no way of knowing ahead of time how the individual will react. There was a time when most of us who lived here claimed — and not without some justification — that people who really loved this island had at least one thing in common: we were all a little cracked. We claimed this happily and pointed with pride to some of our better examples: The lady who would hold her dog up to the telephone so it could bark for a faith-healer in Boston; the dog had a cold and the lady didn’t trust Florida veterinarians. And the old lady with arthritis who swam nude because she couldn’t get full benefit of the water in a bathing suit; if the tide carried her down the beach she might walk home again along the road, explaining placidly that no one could possibly take offense since we all understood the situation. We did. Everyone knew I wrote for a living, but no one paid the slightest attention to what I wrote, with the exception of one story. In the opening paragraph of this one was the statement that: “If you unscrew a screwball anywhere in the United States, blindfold him, turn him around twice and turn him loose, he’ll wind up in Anna Maria.” Within two days after the magazine came out everybody on the island had read that story and most of them had mailed copies to their northern friends. After the war change caught up with us. New bridges are going up now to connect us to the mainland and to Longboat Key to the south. Bulldozers are doing away with the mangroves; dredgelines are changing fiddler crab flats into canals and building sites. As a result we have more people, fewer fiddler crabs, fewer mosquitoes. No one person any longer knows every other person on the island. And most of our new arrivals either have no flamboyant characteristics or prefer to keep them cautiously hidden. But it is still a good island. There is still the water, and the gulls, and the great white sweep of beach. There are still a few bits of jungle where a man can walk and think and see no life except the birds. The fishing is not what it used to be — no old timer anywhere in the world will admit that it is — but I can still walk out my front yard into the Gulf and catch whiting and trout and redfish; and if the fish aren’t biting I can put down the rod and swim. And here a man can have as much privacy as he wants, or he can have companions to whoop it up all night long. Even better, he can have as much of each as he wants when he wants it. For I have never known a place so free of group-made social restrictions. The individual can make restrictions for himself, of course; but he is also free to make his friends among any and all the people he wishes. And we have them here from almost every profession and every walk of life. The big difference between this island and a city is that here you can know any of them you want to know — the new and the old, the cracked and the uncracked. I love it. * Editor’s note. According to Wyatt’s daughter, Peggy Diamant, who lives in Anna Maria with husband Bill, her father wrote the story around 1956 for the Ford Times, a travel magazine published by the Ford Motor Co. Peg’s father and mother moved to Anna Maria in 1936, bringing along 6-year-old Peggy, who was fascinated by such a wild and beautiful place as Anna Maria Island. The first home the family lived in is now the site of the Waterfront Restaurant on South Bay Boulevard in Anna Maria. “Our nearest neighbor was at the Roser Cottage,” said Peggy. “And that was about the edge of town. There were just a few buildings around here.” “My how things have changed since then,” said Peggy. One of Peg’s friends dates back to 1937. She is Polly Moore Senseman, whose parents, Jack and Sally Moore, opened Moore’s Stone Crab Restaurant. Polly comes back occasionally to visit her daughter Susan (owner of the former Nica Rose jewelry boutique) and other family members on Anna Maria and in Cortez. “But then again, a lot of things haven’t changed,” she added. Her father’s story of Anna Maria is “reprinted” with her permission. To advertise here, please visit our rates page or contact us at: sales@islander.org Phone: (941) 778-7978 Fax: (941) 778-9392 The Islander Poll: Do you swim at Bean Point? Yes. I used to. Never did. Where’s that? View Results Loading ... 3-Day Weather Forecast Newsletter signup Sign up to receive FREE email alerts when we update our site with news and classfieds. Email Please wait... Subscribe Thank you for sign up! Popular News Islander E-Edition For $36 a year , you can view all the news, photos, opinions, columns and community announcements To access this content, you must Subscribe here , or log in if you are a member. View our e-Edition Members On your mobile On your tablet Get news alerts Contact us Contact Us The Anna Maria Islander 10303 Spoonbill Road W., Bradenton FL 34209 Phone: (941) 778-7978 Fax: (941) 778-9392 For general information: info@islander.org Site design & maintained by Wayne Ansell Islander News Headlines E Edition Classifieds Place a Classified Ad Fishing Obituaries Real Estate Sports Streetlife Other Links About Us Legislative Contacts Privacy Copyright Archives Island Links Islander Store Web Services Subscribe Newsletter signup Sign up to receive FREE email alerts when we update our site with news and classfieds. Email Please wait... Subscribe Thank you for sign up! Social Media We use cookies to ensure that we give you the best experience on our website. If you continue to use this site we will assume that you are happy with it. Ok"
    },
    {
      "url": "https://apm.activecommunities.com/amicommunitycenter",
      "text": "The Center of Anna Maria Island  - Online Recreation Activities"
    },
    {
      "url": "https://www.annamarialifevacationrentals.com/blog/anna-maria-island-community-center/",
      "text": "Anna Maria Island Community Center Homes For Sale Owner Login Blog Home Vacation Rentals All Rentals Newest Properties Anna Maria Vacation Homes Bradenton Beach Vacation Homes Holmes Beach Vacation Homes Search by Amenity Beachfront Rentals Last-Minute Rentals Pet Friendly Rentals Search by View Search by Bedroom View All Availability About Us About The Team FAQ’s Join Our E-Mail List Terms and Conditions Privacy Policy Area Guide Attractions Journeys Beaches Restaurants About The Area Blog Explore Here Getting Here Island History Local Services Supply Rentals Weddings Property Management Property Management Contact 941-567-6253 Properties 5 O'Clock Somewhere - 216 Chilson AMI Boathouse - 520 Loquat AMI Dreaming - 4200 Gulf 105 AMI Lucky - 524 South Dr AMI Retreat - 746 Jacaranda AMI Sand Dollar - 6403 B Holmes AMI Starfish - 6403 A Holmes AMI Swedish Beach House - 306 S. Bay Blvd. A Reel Beauty - 4803 2nd Ave Above It All - 111 81st St Absolute Paradise - 2114 Avenue A Aloha Fern - 702 Fern Anna Banana - 501 N Shore Dr Anna Cabana A - 770 Jacaranda Anna Cabana B - 301 Poinsettia Anna Maria Beach Condo at Bradenton Beach Club - 1706 Gulf Dr. N Anna Maria Grand Beach House- 1604 Gulf Dr. N Arts and Vines - 6836 Pine St. (LBK) BON AMI - 804 N Bay Back To Blue - 850 N Shore Dr Banyan Beach - 104 Beach Ave Barefoot Bungalow - 213 70th St Barefoot Dreams - 201 76th E Bay 2 Bay - 803 South Bay Blvd Bay to Beach - 1407 Gulf 101 Beach Bound - 205 69th St Beach Breezes - 401 80th St. Beach Potato - 3404 Gulf Dr. #5 Beach Walk - 6250 Holmes #31 Beach n It - 410 Bay Palms Beachology - 749 Jacaranda Rd Bean Point Bliss - 820 North Shore Dr Beauty And The Beach - 205 73rd St Bermuda Bay - 213 Magnolia Ave. Bikini's & Martini's Beachfront - 2802 Ave. E Bikini's & Martini's Waterfront Canal - 215 Chilson Ave. Bikini Bottom - 302 Spring Ave Bimini Bay - 312 Hardin Ave. Bimini Sunrise - 515 Loquat Dr. Blissful Bay - 1801 Gulf Dr N #188 Blue Bayou - 201 76th W Blue Egret - 306 61st St, Unit A (East) Blue Osprey - 111 Los Cedros Dr. Blue Palm Paradise - 205 65th Blue Pelican - 306 61st St, Unit B (West) Bradenton Beach Club 301 - 301 17th St. N Buena Vista #2  - 101 67th Street #2 Cabin 1 Spinnakers Cottages - 204 56th 1 Cabin 2 Spinnakers Cottages - 204 56th 2 Canal Place - 238 Chilson Ave Canal Walk - 223 Oak Ave. Captain's Quarters Spinnakers - 202 56th 1 Chiki Tiki West - 303 64th Street Unit A Coco's Island Retreat - 308 2nd 102 Coconut Cottage - 207 67th Street Coconut Hut - 213 Coconut Ave. Coral Reef - 118 Mangrove Ave. Cottage by the Sea - 102 34th St. Crooked Coconut - 12204 45th Avenue Dr W Crows Nest Spinnakers Cottages - 202 56th 2 Da Beach House - 304 66th St Day Dream - 207 77th St. Deja Blu - 208 Palm Ave Dilly Dally By The Sea - 7005 Gulf Dr. Dock Holiday - 235 Chilson Dolce Vita - 848 N Shore Dr. Dolphin Tales - 836 S Bay Dragonfly Harbour - 511 Loquat Dr Dreamscape - 773 Jacaranda Drop Inn - 305 Pine Ave Endless Summer - 210 56th St Endless Summer AMIC 23 - 2600 Gulf 23 Fancy Flamingo - 319 Hardin Ave. Fancy That - 209 77th St. Fins to the Left - 2812 Ave. E, Unit A Fins to the Right - 2812 Ave. E, Unit B Fish Stix - 110 72nd St Glory Days - 206 Archer Way Happy Place - 210 55th St. Hart Of The Gulf - 305 67th St Hav'Anna Daydreamin' - 204 Archer Way Hav'Anna Hideaway - 202 Archer Way Hav'Anna Holiday - 211 Periwinkle Plaza Hawaiian Punch - 125 Crescent Dr Island Breeze - 119 Beach Ave Island Delight - 424 62nd St. Island Getaway - 205 56th Island Hideaway East - 308B 67th St. Island Pineapple - 404 80th St Island Serenity - 6250 Holmes #54 Island Therapy - 103 Gull Island Time - 426 Spring Island Time on Cedar - 110 Cedar Ave. La Coconut - 3610 Gulf Dr La Hacienda - 103 Los Cedros La Ola Verde - 503 71st St LaPlage #1 - 6430 Gulf Dr Lazy Daze - 105 75th St Lazy Lagoon - 220 Chilson Lazy Loggerhead - 3306 4th Ave. Liddie's Place - Sun Plaza West 209 - 5608 Gulf Dr. Unit 209 Mahi Mahi - 213 Elm Ave Manatee Bay - 402 S Bay Blvd. Manatee Lookout - 214 Oak Ave McBean Point - 795 Jacaranda Rd. - Unit A Meant To Be - 804 Jacaranda Rd Mon AMI Beach House - 311 Pine Ave My Grand Floridian - 207 North Harbor Dr. Nautical Tides - 303 Church Ave. Nirvana - 235 Oak Ave No R-Egrets - 127 50th Street Oceanside Oasis - 102 43rd St. Octopus Cottage - 209 69th St. On Point - 811 Jacaranda Rd Once Upon a Tiki - 211 Chilson Ave One Day More - 403 72nd Park n Chill - 117 Park Ave Peace of Paradise - 604 N Bay Blvd. Periwinkle Getaway - 207 Periwinkle Pineapple Cay - 305 74th St Playing Hooky - 513 Loquat Precious Memories - 753 Jacaranda Rd Rainbow Fish - 210 Archer Way Rainbow Reef - 720 Holly Rd. Reel Deal - 505 S Bay Rose Quartz - 308 Magnolia Ave. Royal Palm - 5701 Holmes Blvd Unit A Salt Dreams - 836 North Shore Dr. Sand Dollar - 6604 Holmes Blvd Sapphire Gulf - 117 Peppertree Ln. Sea Creatures Cottage - 112 Mangrove Ave Sea La Vie - 205 55th Seabatical - 209 76th St. Sea for Two - 101 73rd Street Unit #4 - Seashell Oasis - 2313 Avenue B Sentimental Sunset - 755 Jacaranda Serenity Cove - 606 N Shore Dr Unit #5 Ship Watch - 895 North Shore Snail's Pace - 606 N Shore Dr Unit #4 Snook Lookout - 211 Oak Ave Soulshine - 322 Tarpon St Starfish Cottage - 202 64th St Stay Salty - 6906 Holmes Blvd Stuck on 'Cation - 1810 80th St. NW Summer Breeze - 606 N Shore Dr Unit #0 Sunsational - 215 83rd St. Sunset Beach 102 - 2716 Gulf Surf's Up - 214 75th St The Blue Heron - 309 A 63rd St. The Laguna Beach - 212 Willow Ave. The Sweet Spot - 7402 Marina Dr. The Willow Inn - 201 Willow Ave Thrill of the Chase - 325 Hardin Ave Tiki Cottage - 303 64th Street Unit B Tipsy Turtle - 104 43rd St. Toes in the Water - 110 Palm Ave Turtle Cove - 112 72nd St Turtle Tyme - 4601 Gulf Drive Turtle Tyme 2 - 203 73rd St Villa Maria - 307 Spring Ave Villa Marianne - 111 Maple Wade 'N Sea - 104 Gull Dr. Water's Edge - 221 Oak Ave Willow Walk - 110 Willow Ave Yellowbird - 705 N Shore x × Name * First Email * Phone * Message * URL This field is for validation purposes and should be left unchanged. The Center of Anna Maria Island The Center of Anna Maria Island has been the heart of the Island community for over 50 years. From its humble beginnings as a one-room center for teens to its new larger building with something for everyone in the community, it has always been envisioned that the Center would be a place of creative discovery, exploration and enlightenment. Whether you are a permanent or temporary visitor, the AMICC has great programs for all ages. Three different memberships are available as well as day passes. Available activities and programs include: Pilates, aerobics, ballet, yoga, tai chi, zumba, photography, art classes, bridge lessons and more! There is also space available to rent for parties, meetings, conferences, wedding receptions, and banquets. Visit: 407 Magnolia Avenue, Anna Maria, Florida 34216 Contact: 941-778-1908 Connect: Website Popular Posts Trolley Stop Locations Bradenton Beach Regulations Bean Point Start Your Vacation Now Browse Rentals Browse Categories About the Island Activities Anna Maria Anna Maria Aquariums, Museums & Zoos Around the Island Arts, Culture & Theatre Audiologists Beaches Boat Rentals | Charters Bradenton Beach Bradenton Beach Chiropractors Day Trips Dental & Medical Dentists Eco-Tours | Tours Equipment Rental Events Fishing & Dolphin Watching Fitness Grooming & Pet Sitting Holidays Holmes Beach Holmes Beach Hospitals Island History Jet Skiing Kayaking Kid Friendly Libraries Local Links Local Services Nature & Wildlife Off-Island Off-Island Optometrists Organizations Paddleboarding Parasailing Pediatricians Pet Friendly Pharmacies Photographers Physicians Podiatrists Property Walkthrough Rainy Day Rental Management Restaurants Rules & Regulations Salons & Spas Shopping Snorkeling Sports & Recreation Spring Vacation Summer Theme Parks Things to Do Transportation Uncategorized Vacation Rentals Veterinarians Water Sports Winter Worship contact us find your rental Our Address Anna Maria Life Vacation Rentals 9908 Gulf Drive Suite A Anna Maria, FL 34216 Our Mailing Address P.O. Box 1178 Anna Maria, FL 34216 Give Us A Call 941-567-6253 Subscribe To Our Mailing List Email * First Name Last Name Quick Links Anna Maria Island Private Pool Homes AMI Pet Friendly Rentals Anna Maria Island Condos AMI 1 Bedroom Rentals AMI 2 Bedroom Rentals AMI 3 Bedroom Rentals AMI 4+ Bedroom Rentals AMI Last Minute Rentals AMI Staycation Rentals Anna Maria Island Weekly Rentals AMI Short Term Rentals AMI Seasonal Rentals AMI Rentals for the Holidays Alphabetical Property List About Us FAQs © 2025 Anna Maria Life Vacation Rentals | Terms & Conditions | Privacy Policy"
    },
    {
      "url": "https://thefeastrestaurantami.com/contact-us/",
      "text": "Contact Us - Holmes Beach Restaurant - The Feast Restaurant on Anna Maria Island Skip to main content Skip to footer (941)778-5092 5406 Marina Drive Holmes Beach, FL 34217 Menus Dinner Menu Craft Cocktails Wine Menu Beer Menu Specials Menu Spirits and Liquors Menu About us What’s New Local Links Privacy Policy Disclaimer Photo Gallery Order Online Contact Us Menus Dinner Menu Craft Cocktails Wine Menu Beer Menu Specials Menu Spirits and Liquors Menu About us What’s New Local Links Privacy Policy Disclaimer Photo Gallery Order Online Contact Us Menus Dinner Menu Craft Cocktails Wine Menu Beer Menu Specials Menu Spirits and Liquors Menu About us What’s New Local Links Privacy Policy Disclaimer Photo Gallery Order Online Contact Us 5406 Marina Drive Holmes Beach, FL 34217 (941)778-5092 Menus Dinner Menu Craft Cocktails Wine Menu Beer Menu Specials Menu Spirits and Liquors Menu About us What’s New Local Links Privacy Policy Disclaimer Photo Gallery Order Online Contact Us Menus Dinner Menu Craft Cocktails Wine Menu Beer Menu Specials Menu Spirits and Liquors Menu About us What’s New Local Links Privacy Policy Disclaimer Photo Gallery Order Online Contact Us Contact us Contact us Our Location The Feast Restaurant 5406 Marina Drive Holmes Beach, FL 34217 Contact Us (941) 778-5092 The Restaurant phone number is (941) 778-5092. This number may be used for reservations, catering, or to speak to an employee or manager if you have any questions. We answer calls from 3:30 a.m. until 9:00 p.m. 7 days a week. If you cannot reach us during this time we are on the other line or busy helping another customer and will be available momentarily so please call back. Please do not leave food orders or messages on this line as it is not regularly checked. DIRECTIONS From Anna Maria City We are located in Holmes Beach in the Island Shopping Center. If you are traveling from Anna Maria city you can proceed south on Gulf Drive or Marina Drive until you reach the intersection of Gulf and Marina. The plaza is on the left hand side as you approach the light and either enterence will take you in front of the restaurant. Parking is free and available anywhere in the lot. DIRECTIONS From State Rd. 64 (Manatee Avenue) Proceed west on Sr 64 until you reach the stop light at the intersection of Gulf Dr. and Sr 64. Veer right at the light and you will follow Gulf Drive until you reach the intersection of Gulf and Marina (approx. 1/2 mile). At the light if you look ahead to your right you will see the Island Shopping Center, and our sign. Parking is free and available anywhere in the lot. DIRECTIONS From Longboat Key Proceed north on Gulf Dr. until you reach the intersection at Gulf and East Bay Drive. You may take either of these roads as they both eventually rejoin in the same place. Continue north until you reach the intersection of Gulf Dr. and Marina. At the light if you look ahead to your right you will see the Island Shopping Center, and our sign. Parking is free and available anywhere in the lot. Lets Order The Best Food Now Order online Address 5406 Marina Drive Holmes Beach, FL 34217 Phone (941) 778-5092 Quick Links Home About Us Dinner Menu Order Online What’s New Contact Us Local Links The Anna Maria Islands Sun The Islander ConsideritDoneAMI.com Anna Maria Island Chamber of Commerce Legal Disclaimer Privacy Policy Copyrights@2023. Feast Restaurant. All Rights Reserved ACCESSIBILITY STATEMENT FOR FEAST RESTAURANT This is an accessibility statement from Feast Restaurant URL: https://thefeastrestaurantami.com/ Feast Restaurant is committed to ensuring digital accessibility for people with disabilities. We are continually improving the user experience for everyone, and applying the relevant accessibility standards. Efforts to support accessibility Hurricane Liquors takes the following measures to ensure accessibility: Accessibility is part of our mission statement. Accessibility is part of our internal policies. Clear accessibility targets and responsibilities exist within the organization. Formal accessibility quality assurance methods exist within the organization Conformance status Current accessibility standard of the site: WCAG 2.1 level AA Current content conformance status: Fully conformant: the content fully conforms to the accessibility standard without any exceptions. Compatibility with browsers and assistive technology This site is designed to be compatible with the following browsers: chrome internet explorer firefox Technologies Accessibility of this site relies on the following technologies to work: HTML WAI-ARIA CSS JAVASCRIPT SMIL Assessment methods Feast Restaurant assessed the accessibility of this site using the following method(s): Self-evaluation: the site was evaluated internally by the company or organization. Feedback process We welcome your feedback on the accessibility of this site. Please contact us via one of the following methods: Phone: +12 34 56 89 E-mail: accessibility@example.org Postal Address: 1 Example Street, Suburb, Country, Postcode We aim to respond to feedback within 7 business days. PRIVACY POLICY FOR FEAST RESTAURANT This Privacy Policy explains how FEAST RESTAURANT (“we”, “us”, or “our”) collects, uses, and discloses your personal information when you use our website, hurricanehanks.com (“Site”), and when you interact with us as a customer of our restaurant. We are committed to protecting the privacy of our customers and ensuring the security of their personal information. By using our Site or our restaurant, you agree to the terms of this Privacy Policy. Information We Collect We collect information that you provide to us, such as your name, email address, telephone number, and credit card information when you make a reservation or place an order through our Site or in-person. We may also collect information from you through our loyalty program, social media pages, and surveys. We may also collect information about your device and your usage of our Site, such as your IP address, browser type, and pages visited. Use of Information We use the information we collect to: Fulfill your reservations and orders and provide customer support Improve our products and services Communicate with you about promotions and updates Personalize your experience with our restaurant and Site Comply with legal obligations We may use third-party service providers to assist us in these activities, such as payment processors, email service providers, and website analytics providers. Disclosure of Information We may disclose your personal information to: Service providers who assist us in providing our products and services Law enforcement or other government officials as required by law Other third parties with your consent We do not sell or rent your personal information to third parties for their marketing purposes. Data Security We take reasonable measures to protect the security of your personal information, including using encryption technology to transmit sensitive data. Children’s Privacy Our Site and restaurant are not intended for children under the age of 13. We do not knowingly collect personal information from children under the age of 13 without parental consent. Changes to this Privacy Policy We may update this Privacy Policy from time to time. We will post any changes on this page and, if the changes are significant, we will provide a more prominent notice. You should check this page periodically to review any changes. Contact Us If you have any questions about this Privacy Policy or our privacy practices, you may contact us at info@thefeastrestaurantami.com DISCLAIMER RESTAURANT Last updated February 06, 2023 Website Disclaimer The information provided on our menu, website [ https://thefeastrestaurantami.com/], or any other promotional material is for general informational purposes only. We make every effort to ensure the accuracy of the information, however, we cannot guarantee that all information is up to date and free from errors. Prices and availability of menu items may be subject to change without notice. In addition, we cannot guarantee that our menu items are free from allergens or cross-contamination. Please inform your server of any food allergies or dietary restrictions prior to ordering. Thank you for dining with us. Testimonials Disclaimer The Site may contain testimonials by users of our products and/or services. These testimonials reflect the real-life experiences and opinions of such users. However, the experiences are personal to those particular users, and may not necessarily be representative of all users of our products and/or services. We do not claim, and you should not assume, that all users will have the same experiences. YOUR INDIVIDUAL RESULTS MAY VARY. The Site may contain testimonials by users of our products and/or services. These testimonials reflect the real-life experiences and opinions of such users. However, the experiences are personal to those particular users, and may not necessarily be representative of all users of our products and/or services. We do not claim, and you should not assume, that all users will have the same experiences. YOUR INDIVIDUAL RESULTS MAY VARY. Testimonials on our website or social media pages are provided by our customers voluntarily and are their personal opinions. We do not claim or guarantee that these testimonials are representative of everyone’s experience with our restaurant. Results may vary based on individual preferences and experiences. We appreciate all feedback and strive to provide excellent service to all of our customers."
    },
    {
      "url": "https://centerami.org/about/join-our-team/",
      "text": "Join Our Team - The Center of Anna Maria Island The Center of Anna Maria Island The community's gathering place Donate Join Contact About Center Schedule Forms Staff Awards and Distinctions Join Our Team Board Members Center Financials When is The Center Open? Center History Programs Wellness Youth Beyond The Classroom: Before & After School: K-5th Graders All Day Camps Youth Classes Teens Dolly Parton’s Imagination Library Sports Farmers Market Culture/Education Wellness Group Fitness Classes Fitness Instructors Specialty Fitness & Wellness Personal Training Massage & Acupuncture Sports Youth Sports Adult Sports Tennis Pickleball Concerts Events Memberships Support Become a Sponsor Volunteer JvZ Scholarship Rock ‘N’ Support Grant Giving Legacy Generations of Community Donate Join Our Team Come make a positive difference in the lives of the youth, adults, and families in our community while developing the values of caring, honesty, respect and responsibility. Employment Front Desk/Volunteer Coordinator The Center of Anna Maria Island is hiring Front Desk Staff. The Front Desk staff must demonstrate a personal understanding and appreciation of The Center’s mission and purpose. This position is part time position offered up to 20 hours per week. The schedule will vary by season/events. The position requires excellent interpersonal, verbal, and written communication skills. The person must demonstrate an ability to work effectively with people and be a team member. The person also must work effectively on their own. This position requires good organizational skills, strong human relation skills, general knowledge of business procedures, good communication skills, and willingness to adapt to change. This position will help execute the daily functions of the front desk and also coordinate our volunteer program. This person must have a working knowledge of operating computers, be able to work in a fast pace environment, be flexible, provide a professional and friendly service to all customers, be able to handle and help resolve member concerns, and be able to multi-task. Must be proficient in word, excel, and have a general knowledge of software systems overalls. Must be able to work flexible schedule. Send resumes to Tyler@centerami.org . Internships The Center of AMI offers Internships in the following departments: Recreation & Sports Management Nonprofit Program Administration Sports Marketing & Public Relations Early Childhood Education Exercise Science/ Fitness Senior Programming Social Work Internship will include but is not limited to the following experiences: Attending trainings addressing program disciplines. Planning, implementing, facilitating, and evaluating programming. Assisting staff with programming and administration. Planning, assisting, overseeing and chaperoning group and community programming. Driving the Center vehicles. Maintaining and gaining experience with various technology, to include management of donor software and volunteer management software. Creating and complete an intern project to be determined from your interests and the needs of the Center. Assisting with both administrative duties, as well as facility/fields management duties as needed. Gaining experience with the administrative aspects of fundraising. Coordinating special events and fundraisers Executing the Center Communications Plan to include Social Media Platform management, as needed and when appropriate. Website maintenance as well. Complete college/university assignments as needed Maintain Center Staff and University Internship professional protocols and expectations Internship Description & Application Volunteer The Center of Anna Maria is looking for individuals interested in helping at “the community’s gathering place”. We are are looking for people to help with coaching, tutoring, events, and welcoming guests at the front desk and more. Why volunteer at The Center? 1. It’s fun! 2. You can help make an impact on the lives of children, seniors, and your community. 3. There is something for everyone (be a coach, tutor, mentor, help at events and more) 4. Be a part of an amazing team and make new friends! 5. Learn something new or teach someone else something new! Interested in sharing your talent and helping out others? For more information about volunteering please contact Morgan Blackburn at hello@centerami.org or call (941) 778-1908. If interested in volunteering please click here to fill out a volunteer form Click here to fill out a Volunteer form online or Click Here to print a PDF. Quick Info and Links Center Hours: Monday - Thursday 7 AM - 8 PM Friday 7 AM - 7 PM Saturday 8 AM - 3 PM Center Schedule Sports Schedules Phone: 941.778.1908 Email: hello@centerami.org Annual Impact Report: Leaving a legacy supports growth for future generations! Dear Center Community,\r\n\r\nAs I reflect on this past year, I am filled with gratitude for the unwavering support and trust you place in The Center of Anna Maria Island. My name is Jillian Ptak, and I am proud to serve as … Read More Center Contact 407 Magnolia Avenue PO Box 253 Anna Maria, FL 34216 Phone: 941.778.1908 Email: hello@centerami.org Center Hours: Monday - Thursday 7 AM - 8 PM Friday 7 AM - 7 PM Saturday 8 AM - 3 PM Public Rights Refund Policy Code of Conduct Copyright © 2025 The Center of Anna Maria Island"
    }
  ]
}