{
  "fuentes": [
    {
      "url": "https://www.theatrenantucket.org/about-us/staff-and-board-of-directors",
      "email": "info@theatrenantucket.org"
    },
    {
      "url": "https://www.clickorlando.com/news/local/2025/02/10/orlando-caps-off-lunar-new-year-events-with-dragon-parade-festival-sunday/",
      "email": "czizo@wkmg.com"
    },
    {
      "url": "https://www.orlandoweekly.com/arts/the-dragon-parade-returns-to-orlandos-mills-50-neighborhood-this-weekend-36231153",
      "email": "tips@orlandoweekly.com"
    },
    {
      "url": "https://www.managementcenter.org/staff-board/",
      "email": "info@managementcenter.org"
    },
    {
      "url": "https://www.gottagoorlando.com/post/the-year-of-the-snake-marks-the-13th-annual-central-florida-dragon-parade-lunar-new-year-in-orlando",
      "email": "info@gottagoorlando.com"
    },
    {
      "url": "https://www.cf.edu/about-cf/contact-us/",
      "email": "cfinfo@cf.edu"
    },
    {
      "url": "https://www.clickorlando.com/news/local/2023/02/05/central-florida-dragon-parade-dances-down-mills-50/",
      "email": "jaskin@wkmg.com"
    }
  ],
  "mails": [
    "cfinfo@cf.edu",
    "czizo@wkmg.com",
    "info@gottagoorlando.com",
    "info@managementcenter.org",
    "info@theatrenantucket.org",
    "jaskin@wkmg.com",
    "tips@orlandoweekly.com"
  ],
  "nombre_sitio": "centralfloridadragonparade.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.theatrenantucket.org/about-us/staff-and-board-of-directors",
      "text": "Team SUPPORTÂ US BUY TICKETS SHOWS & TICKETS 2025 SEASON SEASON SUBSCRIPTIONS & GIFT CARDS WHAT TO EXPECT AT THE THEATRE PAST SEASONS GALLERY ABOUT US OUR MISSION & HISTORY STAFF AND BOARD OF DIRECTORS JOBS & VOLUNTEER OPPORTUNITIES AUDITIONS CONTACT US SPOTLIGHT ON SUPPORT SEASON PRODUCERS BUSINESS SPONSORS BUY TICKETS PRODUCING ARTISTIC DIRECTOR Justin Cerne EXECUTIVE DIRECTOR Bethany Oliver ARTISTIC DIRECTOR EMERITUS John Shea COMPANY MANAGER Emily Dunn THEATRE OPERATIONS Katy Feldhahn AUDIENCE ENGAGEMENT Johannah Johnson RESIDENT COSTUME DESIGNER Casey Sayre Boukus RESIDENT LIGHTING DESIGNER Stephen Petrelli RESIDENT SOUND DESIGNER Tony Wagner BOARD OF DIRECTORS Kay Bernon Beth English Ellie Gottwald, VP* David Handy Cecelia Johnson Holly Johnson David Kaytes, President* Karen Keelan Susan Lucier, Clerk* Linda Mason Jean Doyen de Montaillou Chris Mortenson, Treasurer* Helene Patterson Maureen Phillips, Treasurer Designate* Maria Roach, VP* Lisa Soeder* David Southwell, VP* * Executive Committee EMERITUS DIRECTORS Max N. Berry Barbara L. Elder Toby Greenberg Frank Morral Judith Greenberg Seinfeld THEATRE COUNCIL Rebecca Becker Bruce Beni Jane Forman Kathryn Garre-Ayars Victoria Girvan Jill Karp Peggy Kaufman Christina Rose Manca Terry Schubach Les Silverman FRIENDS OF THE THEATRE Amb. Elizabeth Frawley Bagley Jim Bennett Kate Brosnan Jane Condon Fritz Michel Join Our Newsletter Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. EMAIL info@theatrenantucket.org PHONE 508-228-4305 MAILINGÂ ADDRESS POÂ BOX 1297 Nantucket, MA 02554 STAGE Bennett Hall 62 Centre Street VIRTUAL BOX OFFICE Online:Â Â Â www.theatrenantucket.org Email: info@theatrenantucket.org Tickets can be purchased one hour prior to showtime at Bennett Hall."
    },
    {
      "url": "https://www.clickorlando.com/news/local/2025/02/10/orlando-caps-off-lunar-new-year-events-with-dragon-parade-festival-sunday/",
      "text": "Orlando caps off Lunar New Year events with Dragon Parade, festival Sunday Skip to main content Open Main Menu Navigation Open Search Clear icon 74 º Go to the WKMG homepage Join Insider Sign In Open the WKMG News 6 & ClickOrlando Help Desk Search News Watch Live Insider Investigators Local News Florida National World Politics Space News Entertainment Strange Florida Weather Weather News PinIt! Hurricane Weather Wise Forecasting Change Alerts Live Orlando Cam Live Beach Cam Live Port Cam Live Mount Dora Cam Live Palm Island Park Cam News 6+ Watch News 6+ Insider I-4 Food Tour Florida Foodie Solutionaries Black Men Sundays NEXTGEN TV The Hecht Effect Real Estate Getting Results. Results Desk Driving Change Protecting Our Community Getting Results In Our Schools Getting Results At Home Need Results? Traffic Ask Trooper Steve On Patrol Features Insider Events Calendar 6 Things To Do Theme Parks Pets Food Health Travel Tech Pros Who Know Branded Content Sports Orlando Magic Orlando Magic - Stats UCF Knights UCF Knights - Stats Florida Gators Florida Gators - Stats Orlando City SC Orlando Pride Miami Dolphins Dolphins - Stats Tampa Bay Buccaneers Buccaneers - Stats Jacksonville Jaguars Jaguars - Stats Player of the Week Olympics Contact Us Results Desk Insider Meet The Team Careers at WKMG Advertise with us Contests & Rules TV Listings Community Calendar Newsletters Newsletters News Weather News 6+ Getting Results. Traffic Features Sports Contact Us Newsletters News Weather News 6+ Getting Results. Traffic Features Sports Contact Us Newsletters WEATHER ALERT 2 warnings and 3 advisories in effect for 4 regions in the area Show Breaking News Bar Close Local News Christie Zizo , Digital Editor Published: February 10, 2025 at 3:53 PM Updated: February 10, 2025 at 4:11 PM Tags: Orlando , Orange County , Asian-Americans , Lunar New Year , Central Florida Happenings , Florida Foodie RELATED STORIES A performer dressed in a lion costume scares a girl as he dances the traditional Chinese Lion Dance at the start of Chinese Lunar New Year celebrations in Havana, Tuesday, Jan. 28, 2025. (AP Photo/Ramon Espinosa) Millions around the world celebrate Lunar New Year and ring in the Year of the Snake Read full article: Millions around the world celebrate Lunar New Year and ring in the Year of the Snake Opening ceremony held at Wah Lum Kung Fu Temple Lunar New Year comes to Central Florida as Asian Americans celebrate Year of the Dragon Read full article: Lunar New Year comes to Central Florida as Asian Americans celebrate Year of the Dragon Chinese-style lanterns Usher in the year of the snake with these Orlando Lunar New Year events Read full article: Usher in the year of the snake with these Orlando Lunar New Year events LATEST NEWS File photo of Florida Highway Patrol cruiser 43 minutes ago Pickup driver killed in Brevard County rollover crash after speeding through red light, troopers say Read full article: Pickup driver killed in Brevard County rollover crash after speeding through red light, troopers say Areas south of Orlando could get 2-4 inches of rain 1 hour ago Scattered downpours more likely in this part of Central Florida. Is comfortable weather on the way? Read full article: Scattered downpours more likely in this part of Central Florida. Is comfortable weather on the way? Trooper Steve answers viewer traffic questions 2 hours ago My neighbor says I can’t park in front of their house. Is that true in Florida? Read full article: My neighbor says I can’t park in front of their house. Is that true in Florida? Matt Aungst says policy unconstitutional 1 hour ago Is Apopka’s sign ordinance a violation of free speech? Mayoral candidate making that case Read full article: Is Apopka’s sign ordinance a violation of free speech? Mayoral candidate making that case Sign up for our events newsletter: Sign Up Local News Orlando caps off Lunar New Year events with Dragon Parade, festival Sunday Tet festival, Avalon SpringFest also happening Christie Zizo , Digital Editor Published: February 10, 2025 at 3:53 PM Updated: February 10, 2025 at 4:11 PM Tags: Orlando , Orange County , Asian-Americans , Lunar New Year , Central Florida Happenings , Florida Foodie The Central Florida Dragon Parade in Orlando in 2023. (AsiaTrend.org) ORLANDO, Fla. – Lunar New Year celebrations continue in Orange County this weekend with three festivals, including the big annual Dragon Parade in Orlando on Sunday. This is the 13th year for the Lunar New Year parade in the Mills 50 area, which is considered one of the largest in Florida. Recommended Videos The parade starts at 11 a.m. Sunday at Mills Avenue and Lake Highlands Drive. The parade will proceed across the intersection and down Lake Highlands to Thornton Avenue, and down Thornton Avenue to just before East Colonial Drive. That’s where food vendors will be set up for a Lunar New Year Festival hosted by Small Food Group, which is run by Domu founder Sonny Nguyen. The festival will feature around three dozen local vendors with food ranging from boba drinks to char siu to onigiri. The parade itself features dragon and lion dances, local cultural groups, music and more. More information, including parking information, is available on the Central Florida Dragon parade website. It’s not the only Lunar New Year event happening this weekend. The Vietnamese Community Association of Central Florida is holding a Tết Lunar New Year Festival on Friday, Saturday and Sunday at the Central Florida Fairgrounds on West Colonial Drive. The event has free admission, free parking, food and merchandise vendors, live entertainment and a concert on Saturday night. Find more information HERE. Also on Saturday, the third annual Avalon SpringFest will take place in Avalon Park in East Orange County from noon to 6 p.m. This festival also is free to attend and features folk dancing, martial arts demonstrations, Japanese Taiko performances, vendors and more. Find more information on the Asia Trend website. Central Florida Happenings More Stories Like This In Our Email Newsletter Email Address Sign Up Now Copyright 2025 by WKMG ClickOrlando - All rights reserved. About the Author Christie Zizo headshot Christie Zizo Christie joined the ClickOrlando team in November 2021. email RELATED STORIES Millions around the world celebrate Lunar New Year and ring in the Year of the Snake Read full article: Millions around the world celebrate Lunar New Year and ring in the Year of the Snake Lunar New Year comes to Central Florida as Asian Americans celebrate Year of the Dragon Read full article: Lunar New Year comes to Central Florida as Asian Americans celebrate Year of the Dragon Usher in the year of the snake with these Orlando Lunar New Year events Read full article: Usher in the year of the snake with these Orlando Lunar New Year events Loading... Recommended Videos BACK TO TOP TV Listings Email Newsletters RSS Feeds Contests and Rules Contact Us / Follow on Social Media Careers at WKMG Closed Captioning / Audio Description Public File Current EEO Report Terms of Use Privacy Policy Do Not Sell My Info FCC Applications EEO Report Disability Assistance Cookie Preferences Follow Us Visit our YouTube page (opens in a new tab) Visit our Facebook page (opens in a new tab) Visit our Instagram page (opens in a new tab) Visit our X page (opens in a new tab) Visit our RSS Feed page (opens in a new tab) Get Results With Omne If you need help with the Public File, call (407) 291-6000 At WKMG, we are committed to informing and delighting our audience. In our commitment to covering our communities with innovation and excellence, we incorporate Artificial Intelligence (AI) technologies to enhance our news gathering, reporting, and presentation processes. Read our article to see how we are using Artificial Intelligence. Copyright © 2025 ClickOrlando.com is managed by Graham Digital and published by Graham Media Group, a division of Graham Holdings."
    },
    {
      "url": "https://www.orlandoweekly.com/arts/the-dragon-parade-returns-to-orlandos-mills-50-neighborhood-this-weekend-36231153",
      "text": "The Dragon Parade returns to Orlando's Mills 50 neighborhood this weekend Close Search for: Search News Open dropdown menu Abortion Rights Orlando Area News Florida News LGBTQ+ Pulse Views + Opinions Orlando Guides Digital Issue News Photos Arts + Culture Open dropdown menu Arts Stories + Interviews Things to Do Orlando Theme Parks Arts + Culture Photos Food + Drink Open dropdown menu Food News Drinking + Bars Restaurant Reviews Find a Restaurant Food + Drink Photos Music Open dropdown menu Music Stories + Interviews Orlando Music News Live Music Picks + Previews Find a Concert Music Photos Movies Open dropdown menu Movie Reviews Streaming Find a Theater Movie Times Cannabis Open dropdown menu Cannabis News Legislative Updates Dispensary Directory Calendar Open dropdown menu Today’s Events This Weekend Free Events Submit an Event Best Of Orlando® Open dropdown menu 2025 Voting Arts + Entertainment Attractions + Recreation City Life Drinking + Nightlife Food + Dining Health, Beauty + Wellness Local Music Local Notables Services Shopping + Retail Shop Best of Awards Orlando Photos Support Open dropdown menu Support Subscribe Advertise Instagram Twitter Facebook Facebook Bluesky TikTok Instagram Apple News Google News Close Skip to content EARLY BIRD SALE TICKETS TO ORLANDO BEER FEST NOW AVAILABLE. BUY YOURS NOW! Facebook Bluesky TikTok Instagram Apple News Google News Orlando Weekly Open Search Search for: Search Support Us Menu News Open dropdown menu Abortion Rights Orlando Area News Florida News LGBTQ+ Pulse Views + Opinions Orlando Guides Digital Issue News Photos Arts + Culture Open dropdown menu Arts Stories + Interviews Things to Do Orlando Theme Parks Arts + Culture Photos Food + Drink Open dropdown menu Food News Drinking + Bars Restaurant Reviews Find a Restaurant Food + Drink Photos Music Open dropdown menu Music Stories + Interviews Orlando Music News Live Music Picks + Previews Find a Concert Music Photos Movies Open dropdown menu Movie Reviews Streaming Find a Theater Movie Times Cannabis Open dropdown menu Cannabis News Legislative Updates Dispensary Directory Calendar Open dropdown menu Today’s Events This Weekend Free Events Submit an Event Best Of Orlando® Open dropdown menu 2025 Voting Arts + Entertainment Attractions + Recreation City Life Drinking + Nightlife Food + Dining Health, Beauty + Wellness Local Music Local Notables Services Shopping + Retail Shop Best of Awards Orlando Photos Support Open dropdown menu Support Subscribe Advertise Instagram Twitter Facebook Posted in Arts + Culture The Dragon Parade returns to Orlando’s Mills 50 neighborhood this weekend Celebrate the Lunar New Year in style by Sarah Harwell February 21, 2024 March 24, 2025 Share this: Click to email a link to a friend (Opens in new window) Email Click to share on Reddit (Opens in new window) Reddit Click to share on Facebook (Opens in new window) Facebook Click to share on X (Opens in new window) X Click to share on Nextdoor (Opens in new window) Nextdoor Click to share on Bluesky (Opens in new window) Bluesky The Dragon Parade returns to Mills 50 Credit: Photo courtesy Central Florida Dragon Parade As we step into the Year of the Dragon — a year said to symbolize good fortune, prosperity and luck — here comes the annual Mills 50 Dragon Parade for a 12th year. The parade route starts at the corner of Lake Highland Drive and Mills Avenue, before going down Thornton Avenue all the way to Colonial. Local officials will lead the parade along with representatives of numerous Asian organizations and, of course, a serpentine and flowing dragon as the star. (That won’t be the only dragon on-site, though — the Orlando Magic’s mascot Stuff will also be marching.) Expect food vendors and music, too. This is a celebration that brings Orlandoans together with hopes for fresh beginnings, all without the usual Jan. 1 hangover. 11 a.m., Sunday, Feb. 25, Mills 50. Mills 50 Main Street District 320 N. Fern Creek Ave., Orlando, FL 775-573-8864 Subscribe to Orlando Weekly newsletters. Follow us: Apple News | Google News | NewsBreak | Reddit | Instagram | Facebook | Twitter | Or sign up for our RSS Feed This article appears in Spring Guide . WE LOVE OUR READERS! Since 1990, Orlando Weekly has served as the free, independent voice of Orlando, and we want to keep it that way. Becoming an Orlando Weekly Supporter for as little as $5 a month allows us to continue offering readers access to our coverage of local news, food, nightlife, events, and culture with no paywalls. Join today because you love us, too. Tagged: Apple News , Dragon Parade , Lunar New Year , Mills 50 Main Street District , Orlando event , Orlando parade , Parade , things to do in Orlando SEND A NEWS TIP Trending Florida’s first H Mart finally opens in Orlando this month September 4, 2025 Here are the 20 most miserable places in Orlando July 25, 2024 All the Guy Fieri ‘Diners, Drive-Ins and Dives’ restaurants within driving distance of Orlando August 29, 2025 Orlando restaurants open for 25 years or more that every local should know April 10, 2025 Newsletters Join Orlando Weekly Newsletters Subscribe now to get the latest news delivered right to your inbox. SIGN UP NOW Arts + Culture Photos Photos: Halloween Horror Nights kicks off with 10 new haunted houses, food, merch As DeSantis creates ‘Hulk Hogan Day,’ here are eight controversies that marked the wrestler’s life in Florida Gala of Ghouls’ glittering and ferocious drag-meets-runway event ‘Birth of Nova’ took over the Veranda at Thornton Park The Miss Sizzlin’ Summer Pinup Contest at Lil Indie’s made summer even hotter for a local duck rescue More » News News Abortion Rights Orlando Area News Florida News LGBTQ+ Pulse Informed Dissent Views + Opinions Orlando Sports Savage Love Reader Reactions Comics Digital Issue News Photos Movies Movies Movie Reviews Streaming Find a Theater Movie Times Arts + Culture Arts + Culture Arts Stories + Interviews Live Active Cultures Things to Do Orlando Theme Parks Astrology Performing Arts Visual Arts Arts + Culture Photos Calendar Calendar Orlando Weekly Events Today’s Events This Weekend Free Events Submit an Event Social Media Facebook Instagram Bluesky TikTok Food + Drink Food + Drink Food News Drinking + Bars Restaurant Reviews Find a Restaurant Food + Drink Photos Best Of Orlando® Best Of Orlando® 2025 Voting Arts + Entertainment Attractions + Recreation City Life Drinking + Nightlife Food + Dining Health, Beauty + Wellness Local Music Local Notables Services Shopping + Retail Shop Best of Awards 🥇 Sponsored Links Apartments Near UCF Apartments Near Full Sail Orlando Apartments Music Music Music Stories + Interviews Orlando Music News Live Music Picks + Previews This Little Underground Find a Concert Music Photos Cannabis Cannabis Cannabis News Legislative Updates Dispensary Directory Orlando Guides Orlando Guides City Guide Bite Fall Guide Holiday Guide Newcomers Guide Summer Guide Legal Advertising Sponsored Orlando Weekly Events Bite30 Orlando Beer Festival Whiskey Business Tacos & Tequila Brunch in the Park Beer ‘Merica Orlando Taco Week About Contact Us Work for Us Staff Directory Where to find us FAQs Policies Support Subscribe Advertise Chava Communications Read our sister publications SUPPORT US Orlando Weekly PO Box 953127. Lake Mary, FL 32795 © 2025 Orlando Weekly Powered by Newspack Facebook Bluesky TikTok Instagram Apple News Google News Loading Comments... Write a Comment... Email (Required) Name (Required) Website"
    },
    {
      "url": "https://www.managementcenter.org/staff-board/",
      "text": "Team Members Archive - The Management Center Skip to content Instagram Instagram About Our Approach Our Clients Our Team Work With Us News & Updates Trainings For Managers For Staff In-House Training for Teams Management Workouts Training FAQ Coaching Success Stories￼ Resources Check-ins Culture & Relationships Delegation Equity & Inclusion Hiring Investing in People Managing Managers Managing Up & Sideways Performance Problems Roles & Goals Recursos en Español Other Topics Newsletter Archive Educational Equity Newsletter Archive Book Search for... Hi friends! We use cookies to improve your experience of our site. In certain instances, we ask for personal info so we can be unusually helpful in delivering services (like trainings!). If you continue browsing, we assume you accept our Privacy Policy . TL;DR we take data privacy seriously. Accept Home // // About // Our Team Our Team Filter By Pick Team to filter by All Teams Admin CEO Coaching Content Education Sector Leadership Progressive Sector Public Sector Training Residents The Management Center Staff Jakada Imani Pronouns he/him Position Chief Executive Officer Jessica Anderson Pronouns she/her Position Managing Partner, Trainer Jamilyn Bailey Pronouns she/her Position Partner, Trainer Adriana Barboza Pronouns she/her Position Partner, Trainer Taylor Broome Pronouns She/Her Position Training Operations Coordinator R. Burke Pronouns she/her Position Manager, Client Support Hanna Campbell Pronouns she/her Position Partner, Trainer Diana Cerda Pronouns she/her Position Director, Finance Jackson Darling-Palacios Pronouns he/him Position Senior Partner, Progressive Sector Head, Partnerships, and Planning Qasim Davis Pronouns he/him Position Partner, Trainer Chloe Davis-Carden Pronouns they/them Position Vice President, Trainer Kendan Elliott Pronouns he/they Position Director, Client Support Valerie Evans Pronouns she/her Position Chief Operating Officer Johari Farrar Pronouns she/her Position Communications Coordinator Amy Faulring Pronouns she/her Position Partner, Coach Cosmo Fujiyama Ghaznavi Pronouns she/her Position Partner, Progressive Sector Engagement and Partnerships Reilly Furellis Pronouns she/her Position Managing Partner, Finance & Data Brian Gómez Pronouns He/Him Position Finance Manager Marissa Graciosa Pronouns she/her Position Partner, Coach Jenny Griggs Pronouns she/her Position Vice President, Progressive Partnerships Wendy Guyton Pronouns she/her Position Managing Partner, Client Support Nancy Hanks Pronouns she/her Position Senior Partner, Education Sector Head Megan Hanson Pronouns she/her Position Senior Partner, Trainer Cedric Harmon Pronouns he/him Position Partner, Coach Sarah Hodgdon Pronouns she/her Position Partner, Coach Cicely Horsham-Brathwaite Pronouns she/her Position Managing Partner, Coach Valerie Jiggetts Pronouns she/her Position Vice President, Client Support Cindy Kang Pronouns she/her Position Senior Partner, Coach Stacy McAuliffe Pronouns she/her Position Managing Partner, Coach Stephen McClain Pronouns he/him Position Partner, Education Sector Engagements and Partnerships 1 2 In Residence Bex Ahuja Pronouns they/them Position Adjunct Trainer Jumoke Balogun Pronouns she/her Position Adjunct Coach Cheyenne E. Batista Pronouns she/her Position Adjunct Trainer Megan Bellamy Pronouns she/her Position Adjunct Trainer Meredith Bliss Pronouns she/her Position Adjunct Trainer, Hotline Coach Briana  Brown Pronouns she/her Position Administrative Director of Talent & HR Consultant Betsy Buckley Pronouns she/her Position Interim Chief Financial Officer Jen Chau Fontán Pronouns she/her Position Adjunct Coach Linara Davidson Greenidge Pronouns she/her Position Adjunct Coach De-Lea Deane-Allen Pronouns she/her Position Adjunct Coach Jennifer Epps-Addison Pronouns she/her Position Adjunct Trainer Michelle Hallerdin Pronouns she/her Position Hotline Coach Eva Hernandez Pronouns she/her Position Adjunct Coach José Luis Marantes Pronouns he/him Position Adjunct Trainer Lenny Noisette Pronouns he/him Position Adjunct Coach Kimberly Osagie Pronouns she/her Position Adjunct Trainer Julien Ross Pronouns he/him/él Position Progressive Partnerships and Strategy Contractor Melinda Spooner Pronouns she/her Position Adjunct Trainer Sujata Tejwani Pronouns she/her Position Adjunct Trainer Shannon Wheatley Pronouns he/him Position Adjunct Trainer Yamani Yansa Hernandez Pronouns she/they Position Adjunct Coach Contact Us Call Us Send contact email About Trainings Coaching Resources Book Tax Exemption Copyright Privacy Policy Site Credits Back to top"
    },
    {
      "url": "https://www.gottagoorlando.com/post/the-year-of-the-snake-marks-the-13th-annual-central-florida-dragon-parade-lunar-new-year-in-orlando",
      "text": "The Year of the Snake marks the 13th Annual Central Florida Dragon Parade Lunar New Year in Orlando top of page Search News Orlando News Space Coast News Daytona Beach News Tampa Bay News Travel & Tourism News Orlando International Airport News Weather News Hotel & Resort News Retail News Deals & Special Offers Theme Parks Theme Park News Walt Disney World News Universal Orlando News Seaworld Orlando News Busch Gardens Tampa News Legoland Florida News Attractions Attraction News Water Park News Dinner Show News Entertainment Entertainment News Events & Festival News Concerts & Live Music News Stand-Up Comedy News Bar & Nightlife News Theater & The Arts News Museum & Gallery  News Film &  Movie Theater News Sports News Weekend Guide Events & Things To Do This Weekend Free  &  Cheap Things To Do This Weekend Food & Drink Events Event Calendar Submit Event Things To Do Top 10 Things To Do In Orlando Monthly Events Guide Theme Park Guide Attractions Guide Water Park Guide Dinner Show Guide Concerts & Music Guide Theater & The  Arts Guide Events & Festival Guide Restaurant Guide Bars & Nightlife Guide Movie Theater Guide Museums & Gallery Guide Shopping Guide Seasonal Valentine's Day Guide St Patrick's Day Guide Easter Guide Mother's Day Guide Father's Day Guide Memorial Day Guide 4th Of July Guide Halloween Guide Thanksgiving Guide Holiday & Christmas Guide New Year's Eve Guide What's New Contact Contact Us Newsletter About Us Advertise More Use tab to navigate through the menu items. The Latest News The Year of the Snake marks the 13th Annual Central Florida Dragon Parade Lunar New Year in Orlando Alastair Mac Feb 14 2 min read Join with many local business and Asian cultural organizations to celebrate the year of the snake! Lunar New Year is the most celebrated holiday in East Asia. Cities like Sydney, London, New York, Los Angeles, Orlando and San Francisco have also held many successful Lunar New Year Parades that attract thousands of attendees each year. Orlando's Dragon Parade will celebrate its13th anniversary as the largest Lunar New Year Parade in Florida. The Year of the Snake marks the 13th annual Central Florida Dragon Parade Lunar New Year held in Orlando, Florida. This event has received overwhelming response from local and distant communities alike. Asia Trend Magazine is partnering with Mills 50 (an Orlando Main Street District), R.E.A.C.H. (Recognizing, Experiencing Asian Cultural Heritage) and Y.E.S.S. (Youth Enrichment and Senior Services) to host the Dragon Parade Lunar New Year 2024 on Sunday, February 16 from 11 am to 12 pm. The festival parade starts at the corner of Lake Highland Dr. and N. Mills Ave, and ends at N. Thornton Ave and Colonial Drive (728 N. Thornton Ave., Orlando, FL 32803). The City of Orlando and the Orange County officials will lead this community parade along with representatives of numerous Asian organizations. For more parade information, please visit http://www.centralfloridadragonparade.org . Check out all the latest news and more from Orlando and throughout Central Florida . Gotta Go Orlando offers the latest entertainment news, together with all the latest events and things to do throughout Central Florida. We feature concerts, theater, culture, nightlife, food & drink. theme parks, attractions, festivals, events, and more. With news and information being released on a daily basis, we encourage you to sign up for our newsletter and stay in the loop with all the latest exciting news from our local community. You can also join the local conversation on X , Facebook , Instagram , and YouTube . Contact Us Got a story to tell Orlando? Contact us now . To advertise with us, click here , and to list your upcoming event with us, submit it here . Tags: Mills 50 District Lunar New Year Events & Festival News Florida News Central Florida News Meet The GGO Team Emma Walton News Producer Contact Shane Walton News Producer Contact Alastair Mac News Editor Contact The Latest Headlines Ivanhoe Village, Milk District, Mills 50, and Curry Ford West team up for The Golden Girls Gone Wild Pub Crawl Get ready for a bizarre and brilliant night with Buckethead at The Plaza Live in Orlando! The Totally Rad Vintage Fest is coming to Tampa for the first time on September 13 Orlando Pride hosting a Teddy Bear Toss this weekend, a first in Inter&Co Stadium history! Hero's and Villains Unite - Fandom Kissimmee is back! Your Orlando Plans Are Here Orla n do Events This Weekend​ Orlando Events This Month Things To Do In Orlando Gotta Go Orlando is your local source for the latest entertainment news , events and things to do throughout Central Florida. We feature concerts , theater, arts & culture , nightlife , food & drink . theme parks & attractions, festivals, events , and more. © 2025  Gotta Go Orlando  -  All Rights Reserved Privacy Policy bottom of page"
    },
    {
      "url": "https://www.cf.edu/about-cf/contact-us/",
      "text": "Contact Us < College Of Central Florida Contact Us Apply Toggle navigation Admissions Expand Menu Explore our new interactive guide to CF! Get Viewbook Getting Started at CF Why CF? How to Apply Dates and Deadlines Schedule a Tour Placement Testing Admissions and Enrollment Forms New Student Orientation Contact Admissions Paying for College Types of Financial Aid Cost of Attendance Net Price Calculator Cashier’s Office Financial Aid Consumer Information Contact Financial Aid Information for Students Dual Enrollment / High School First Time in College International Transfer Transient Veteran Spanish Speakers Academics Expand Menu CF makes transferring to FAMU, UCF or USF easy! See How Degrees and Certificates Areas of Study Online Learning University Partners Workforce Programs Honors Noncredit Courses Adult Education / GED® Study Abroad Service Learning Academic Resources 2024-2025 Academic Calendar 2025-2026 Academic Calendar Academic Pathways Bookstore Canvas College Catalog Course Schedule Course Syllabi Library Program Code List Academic Services Academic Advising Testing and Assessment Tutoring Enrollment Services Career Pathways Graduation Student Life Expand Menu Tons of events and activities are in your future. See Calendar Get Involved Arts and Culture Athletics Campus Events Clubs and Organizations Wellness About Our Campuses Campus Amenities Student Housing Campus Dining Campus Safety Student Services Disability Services Career Services Counseling Services Veterans Affairs TRIO Programs About CF Expand Menu CF is ranked among the top 150 colleges in the nation for quality. Learn About CF Locations Appleton Museum of Art Citrus Campus Hampton Center Levy Campus Ocala Campus Vintage Farm Campus Venue Rentals and Catering CF at a Glance Accreditation Consumer Information HEERF Reporting Employee Directory Departments Directory Policies Procedures Employer Connection Work at CF Happening at CF Events Calendar News Administration Office of the President Board of Trustees Institutional Research I am a future student Expand Menu CF College of Central Florida. Learn About CF current student former student parent or guardian guidance counselor employer MyCF Patriots Mail Canvas A-Z Sitemap CF Careers CF Foundation I am a future student current student former student parent or guardian school counselor employer Contact Us Apply Please ensure Javascript is enabled for purposes of website accessibility Home > About CF > Contact Us Contact Us Thank you for your interest in the College of Central Florida. Please fill out the form below, email cfinfo@cf.edu or call 352-873-5800 to reach us. About CF CF at a Glance Awards & Recognition Consumer Information Social Security Collection, Usage, Release Website Privacy FERPA Identity Theft Title IX and Compliance Textbook Affordability Hazing Prevention and Awareness Employee Directory Departments Directory Human Resources Drug-Free Campus Policy Employee Benefits Veterans’ Preference Volunteer Program Job Descriptions Work at CF Marketing and Public Relations Postal Services Purchasing Child Care / Learning Lab School Facilities Printing Services AFC CF Chapter Policies Sustainability Procedures Accreditation Quality Enhancement Plan Student Achievement Data Higher Education Emergency Relief Fund (HEERF) Required Reporting Employer Connection CF Foundation Alumni Distinguished Alumni Alumni Board About CF Foundation Foundation News Volunteer Opportunities Board Members Publications and Financial Reports Foundation Events Giving Give Online Reaching Higher Campaign Establish a scholarship Patriot Fund Gift and Estate Planning STEPS to CF News Office of the President Board of Trustees Notice of Rule Adoption Notice of Rule Development Notice of Meeting Board of Trustees Minutes Archive Contact Us Locations Wilton Simpson Citrus Campus Hampton Center Levy Campus Ocala Campus Vintage Farm Campus Venue Rentals and Catering Citrus Campus Venues Levy Campus Venues Contact CF Conference Services Vintage Farm Rentals Ocala Campus Venues Institutional Research Institutional Research FAQs Fill out my online form . Learn More Receive an email with details about CF. Email First Name Last Name Apply to CF Take a Tour View Calendar Give to CF Departments at CF Campus Safety Conference Services Corporate College Facilities Human Resources Learning Lab School Marketing and Public Relations Postal Services Printing Services Purchasing © 2024 College of Central Florida  | 3001 S.W. College Road, Ocala, FL 34474 Accessibility | Title IX / Compliance | Work at CF"
    },
    {
      "url": "https://www.clickorlando.com/news/local/2023/02/05/central-florida-dragon-parade-dances-down-mills-50/",
      "text": "Central Florida Dragon Parade dances down Mills 50 Skip to main content Open Main Menu Navigation Open Search Clear icon 74 º Go to the WKMG homepage Join Insider Sign In Open the WKMG News 6 & ClickOrlando Help Desk Search News Watch Live Insider Investigators Local News Florida National World Politics Space News Entertainment Strange Florida Weather Weather News PinIt! Hurricane Weather Wise Forecasting Change Alerts Live Orlando Cam Live Beach Cam Live Port Cam Live Mount Dora Cam Live Palm Island Park Cam News 6+ Watch News 6+ Insider I-4 Food Tour Florida Foodie Solutionaries Black Men Sundays NEXTGEN TV The Hecht Effect Real Estate Getting Results. Results Desk Driving Change Protecting Our Community Getting Results In Our Schools Getting Results At Home Need Results? Traffic Ask Trooper Steve On Patrol Features Insider Events Calendar 6 Things To Do Theme Parks Pets Food Health Travel Tech Pros Who Know Branded Content Sports Orlando Magic Orlando Magic - Stats UCF Knights UCF Knights - Stats Florida Gators Florida Gators - Stats Orlando City SC Orlando Pride Miami Dolphins Dolphins - Stats Tampa Bay Buccaneers Buccaneers - Stats Jacksonville Jaguars Jaguars - Stats Player of the Week Olympics Contact Us Results Desk Insider Meet The Team Careers at WKMG Advertise with us Contests & Rules TV Listings Community Calendar Newsletters Newsletters News Weather News 6+ Getting Results. Traffic Features Sports Contact Us Newsletters News Weather News 6+ Getting Results. Traffic Features Sports Contact Us Newsletters WEATHER ALERT 2 warnings and 3 advisories in effect for 4 regions in the area Show Breaking News Bar Close Local News Jerry Askin , Anchor/Reporter Published: February 5, 2023 at 2:19 PM Updated: February 6, 2023 at 12:17 AM Tags: Orlando , Orange County , Mills 50 , AAPINH Heritage , Lunar New Year RELATED STORIES Rep. Judy Chu, D-Calif., left, addresses the media with Los Angeles County Sheriff Robert Luna, right, outside the Civic Center in Monterey Park, Calif., Sunday, Jan. 22, 2023. A mass shooting took place at a dance club following a Lunar New Year celebration, setting off a manhunt for the suspect. (AP Photo/Damian Dovarganes) Asian community reeling after Lunar New Year shooting Read full article: Asian community reeling after Lunar New Year shooting Senator says legislation wouldn’t add financial cost to schools State senator announces bill to require Asian American studies in Florida schools Read full article: State senator announces bill to require Asian American studies in Florida schools FILE- The Yelp app is seen on an iPad in Baltimore on March 19, 2018. There's been a sharp increase in the number of hate-filled business reviews spotted by Yelp's content moderators. (AP Photo/Patrick Semansky, File) Anti-Asian hate 'runs the gamut,' racist Yelp reviews show Read full article: Anti-Asian hate 'runs the gamut,' racist Yelp reviews show LATEST NEWS File photo of Florida Highway Patrol cruiser 44 minutes ago Pickup driver killed in Brevard County rollover crash after speeding through red light, troopers say Read full article: Pickup driver killed in Brevard County rollover crash after speeding through red light, troopers say Areas south of Orlando could get 2-4 inches of rain 1 hour ago Scattered downpours more likely in this part of Central Florida. Is comfortable weather on the way? Read full article: Scattered downpours more likely in this part of Central Florida. Is comfortable weather on the way? Trooper Steve answers viewer traffic questions 2 hours ago My neighbor says I can’t park in front of their house. Is that true in Florida? Read full article: My neighbor says I can’t park in front of their house. Is that true in Florida? Matt Aungst says policy unconstitutional 1 hour ago Is Apopka’s sign ordinance a violation of free speech? Mayoral candidate making that case Read full article: Is Apopka’s sign ordinance a violation of free speech? Mayoral candidate making that case Sign up for our events newsletter: Sign Up Local News Central Florida Dragon Parade dances down Mills 50 11th annual parade honors culture, Lunar New Year Jerry Askin , Anchor/Reporter Published: February 5, 2023 at 2:19 PM Updated: February 6, 2023 at 12:17 AM Tags: Orlando , Orange County , Mills 50 , AAPINH Heritage , Lunar New Year ORLANDO, Fla. – It was a big celebration Sunday morning as hundreds came out for the 11th annual Central Florida Dragon Parade in Orlando’s Mills 50 district. From dancers to great music, the parade honored Asian culture and showed off their many traditions, also celebrating the Lunar New Year. Agnes Chau is president of Youth Enrichment and Senior Services (YESS) and helped organize the parade, alongside Mills 50 and other organizations. “With this year of the rabbit, we’re going to set it out with prosperity, health, good fortune,” Chau said. “We’re Asian Americans, but we always want to be part of the community, the bigger community, including our culture.” [TRENDING: Florida firefighter to donate organs in selfless last act after surfing accident, family says | Chinese balloon’s downing creates spectacle over tourism hub | Become a News 6 Insider ] For Simon Choy, the vice president and general manager of payroll company ADP, the annual parade is personal for him. He was born and raised in Malaysia and said it means so much to see his culture celebrated and honored right here in Central Florida. “This is very meaningful for me,” Choy said. “We (ADP) are also the title sponsor. We just want to be part of this community and just giving back.” Orlando Mayor Buddy Dyer and other local elected leaders took part in Sunday’s celebrations, including Orlando City Commissioner Patty Sheehan who covers part of the district where the parade happened. “It’s so important now more than ever to realize that we are better together. We are stronger when we unite,” Sheehan said. “It says that we are welcoming inclusive and decent people.” Get today’s headlines in minutes with Your Florida Daily : Copyright 2023 by WKMG ClickOrlando - All rights reserved. About the Author Jerry Askin headshot Jerry Askin Jerry Askin is an Atlanta native who came to News 6 in March 2018 with an extensive background in breaking news. email facebook twitter RELATED STORIES Asian community reeling after Lunar New Year shooting Read full article: Asian community reeling after Lunar New Year shooting State senator announces bill to require Asian American studies in Florida schools Read full article: State senator announces bill to require Asian American studies in Florida schools Anti-Asian hate 'runs the gamut,' racist Yelp reviews show Read full article: Anti-Asian hate 'runs the gamut,' racist Yelp reviews show Loading... Recommended Videos BACK TO TOP TV Listings Email Newsletters RSS Feeds Contests and Rules Contact Us / Follow on Social Media Careers at WKMG Closed Captioning / Audio Description Public File Current EEO Report Terms of Use Privacy Policy Do Not Sell My Info FCC Applications EEO Report Disability Assistance Cookie Preferences Follow Us Visit our YouTube page (opens in a new tab) Visit our Facebook page (opens in a new tab) Visit our Instagram page (opens in a new tab) Visit our X page (opens in a new tab) Visit our RSS Feed page (opens in a new tab) Get Results With Omne If you need help with the Public File, call (407) 291-6000 At WKMG, we are committed to informing and delighting our audience. In our commitment to covering our communities with innovation and excellence, we incorporate Artificial Intelligence (AI) technologies to enhance our news gathering, reporting, and presentation processes. Read our article to see how we are using Artificial Intelligence. Copyright © 2025 ClickOrlando.com is managed by Graham Digital and published by Graham Media Group, a division of Graham Holdings."
    }
  ]
}