{
  "fuentes": [
    {
      "url": "https://mymhcommunity.com/Florida/",
      "email": "logo@2x.png"
    },
    {
      "url": "https://rocusa.org/why-resident-ownership/",
      "email": "contact_us@rocusa.org"
    },
    {
      "url": "https://ocalacep.com/the-cep/team",
      "email": "amie@ocalacep.com"
    },
    {
      "url": "https://ocalacep.com/the-cep/team",
      "email": "andrea@ocalacep.com"
    },
    {
      "url": "https://ocalacep.com/the-cep/team",
      "email": "arin@ocalacep.com"
    },
    {
      "url": "https://ocalacep.com/the-cep/team",
      "email": "beth@ocalacep.com"
    },
    {
      "url": "https://ocalacep.com/the-cep/team",
      "email": "bryce@ocalacep.com"
    },
    {
      "url": "https://ocalacep.com/the-cep/team",
      "email": "chris@ocalacep.com"
    },
    {
      "url": "https://ocalacep.com/the-cep/team",
      "email": "dawn@ocalacep.com"
    },
    {
      "url": "https://ocalacep.com/the-cep/team",
      "email": "diane@ocalacep.com"
    },
    {
      "url": "https://ocalacep.com/the-cep/team",
      "email": "donna@ocalacep.com"
    },
    {
      "url": "https://ocalacep.com/the-cep/team",
      "email": "erin@ocalacep.com"
    },
    {
      "url": "https://ocalacep.com/the-cep/team",
      "email": "evelyn@ocalacep.com"
    },
    {
      "url": "https://ocalacep.com/the-cep/team",
      "email": "foundation@ocalacep.com"
    },
    {
      "url": "https://ocalacep.com/the-cep/team",
      "email": "freddie@ocalacep.com"
    },
    {
      "url": "https://ocalacep.com/the-cep/team",
      "email": "heather@ocalacep.com"
    },
    {
      "url": "https://ocalacep.com/the-cep/team",
      "email": "jess@ocalacep.com"
    },
    {
      "url": "https://ocalacep.com/the-cep/team",
      "email": "jessica@ocalacep.com"
    },
    {
      "url": "https://ocalacep.com/the-cep/team",
      "email": "jessica@ocalacep.com"
    },
    {
      "url": "https://ocalacep.com/the-cep/team",
      "email": "jim@ocalacep.com"
    },
    {
      "url": "https://ocalacep.com/the-cep/team",
      "email": "joe@belleviewcep.com"
    },
    {
      "url": "https://ocalacep.com/the-cep/team",
      "email": "judy@ocalacep.com"
    },
    {
      "url": "https://ocalacep.com/the-cep/team",
      "email": "kaylin@ocalacep.com"
    },
    {
      "url": "https://ocalacep.com/the-cep/team",
      "email": "louisa@ocalacep.com"
    },
    {
      "url": "https://ocalacep.com/the-cep/team",
      "email": "matt@ocalacep.com"
    },
    {
      "url": "https://ocalacep.com/the-cep/team",
      "email": "norman@ocalacep.com"
    },
    {
      "url": "https://ocalacep.com/the-cep/team",
      "email": "ron@ocalacep.com"
    },
    {
      "url": "https://ocalacep.com/the-cep/team",
      "email": "tamara@ocalacep.com"
    },
    {
      "url": "https://ocalacep.com/the-cep/team",
      "email": "tom@ocalacep.com"
    },
    {
      "url": "https://ocalacep.com/the-cep/team",
      "email": "amie@ocalacep.com"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/59384-cala-springs-mobile-home-village-3323-ne-14th-st-c-18-ocala-fl-34470",
      "email": "ic-check@3x-5a3e2144a9a4acf45458273b69b15bbaa81ecbe06f309c300d93a895399c26f7.png"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/59384-cala-springs-mobile-home-village-3323-ne-14th-st-c-18-ocala-fl-34470",
      "email": "ic-keyboard-arrow-left@3x-08f6b0510226b0efcfdc2666cba73263553b72f2d32e5f011c9c98784c76587c.png"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/59384-cala-springs-mobile-home-village-3323-ne-14th-st-c-18-ocala-fl-34470",
      "email": "ic-keyboard-arrow-right@3x-7946a10e2ef7d450d52e62227f39f8caec9bffc3c60879d9a44778ef5e31e5c8.png"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/59384-cala-springs-mobile-home-village-3323-ne-14th-st-c-18-ocala-fl-34470",
      "email": "ic-phone@3x-4e4130ef14f1e4dbef232698ad04bf6ffcd9c9f1b9b1500598e1580f86f28fdb.png"
    },
    {
      "url": "https://www.suncommunities.com/florida/fairfield-village",
      "email": "fairfieldvillage@suncommunities.com"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/48879-cherry-hill-mobile-home-park-3531-south-pine-avenue-ocala-fl-34471",
      "email": "ic-check@3x-5a3e2144a9a4acf45458273b69b15bbaa81ecbe06f309c300d93a895399c26f7.png"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/48879-cherry-hill-mobile-home-park-3531-south-pine-avenue-ocala-fl-34471",
      "email": "ic-keyboard-arrow-left@3x-08f6b0510226b0efcfdc2666cba73263553b72f2d32e5f011c9c98784c76587c.png"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/48879-cherry-hill-mobile-home-park-3531-south-pine-avenue-ocala-fl-34471",
      "email": "ic-keyboard-arrow-right@3x-7946a10e2ef7d450d52e62227f39f8caec9bffc3c60879d9a44778ef5e31e5c8.png"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/48879-cherry-hill-mobile-home-park-3531-south-pine-avenue-ocala-fl-34471",
      "email": "ic-phone@3x-4e4130ef14f1e4dbef232698ad04bf6ffcd9c9f1b9b1500598e1580f86f28fdb.png"
    },
    {
      "url": "https://ocoee.org/1149/About-Us",
      "email": "dabdo@ocoee.org"
    },
    {
      "url": "https://ocoee.org/1149/About-Us",
      "email": "mjohnson@ocoee.org"
    },
    {
      "url": "https://ocoee.org/1149/About-Us",
      "email": "mark.johnson@ci.ocoee.fl.us"
    },
    {
      "url": "https://ocoee.org/1149/About-Us",
      "email": "thogan@ocoee.org"
    },
    {
      "url": "https://www.suncommunities.com/florida/paddock-park-south",
      "email": "paddockpark@suncommunities.com"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/48854-westwood-mobile-home-park-600-sw-38th-ave-ocala-fl-34474",
      "email": "ic-check@3x-5a3e2144a9a4acf45458273b69b15bbaa81ecbe06f309c300d93a895399c26f7.png"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/48854-westwood-mobile-home-park-600-sw-38th-ave-ocala-fl-34474",
      "email": "ic-keyboard-arrow-left@3x-08f6b0510226b0efcfdc2666cba73263553b72f2d32e5f011c9c98784c76587c.png"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/48854-westwood-mobile-home-park-600-sw-38th-ave-ocala-fl-34474",
      "email": "ic-keyboard-arrow-right@3x-7946a10e2ef7d450d52e62227f39f8caec9bffc3c60879d9a44778ef5e31e5c8.png"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/48854-westwood-mobile-home-park-600-sw-38th-ave-ocala-fl-34474",
      "email": "ic-phone@3x-4e4130ef14f1e4dbef232698ad04bf6ffcd9c9f1b9b1500598e1580f86f28fdb.png"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/40450-fairfield-village-5866-sw-58th-place-ocala-fl-34474",
      "email": "ic-check@3x-5a3e2144a9a4acf45458273b69b15bbaa81ecbe06f309c300d93a895399c26f7.png"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/40450-fairfield-village-5866-sw-58th-place-ocala-fl-34474",
      "email": "ic-keyboard-arrow-left@3x-08f6b0510226b0efcfdc2666cba73263553b72f2d32e5f011c9c98784c76587c.png"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/40450-fairfield-village-5866-sw-58th-place-ocala-fl-34474",
      "email": "ic-keyboard-arrow-right@3x-7946a10e2ef7d450d52e62227f39f8caec9bffc3c60879d9a44778ef5e31e5c8.png"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/40450-fairfield-village-5866-sw-58th-place-ocala-fl-34474",
      "email": "ic-phone@3x-4e4130ef14f1e4dbef232698ad04bf6ffcd9c9f1b9b1500598e1580f86f28fdb.png"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/40450-fairfield-village-5866-sw-58th-place-ocala-fl-34474",
      "email": "suncommunities@3x-46822945c5fcb8384c012a499105d3bc998b3619cd559add91c8f894338da44a.png"
    },
    {
      "url": "https://www.sweetwateroaksmhc.com/about/",
      "email": "sweetwater@legacymhc.com"
    }
  ],
  "mails": [
    "amie@ocalacep.com",
    "andrea@ocalacep.com",
    "arin@ocalacep.com",
    "beth@ocalacep.com",
    "bryce@ocalacep.com",
    "chris@ocalacep.com",
    "contact_us@rocusa.org",
    "dabdo@ocoee.org",
    "dawn@ocalacep.com",
    "diane@ocalacep.com",
    "donna@ocalacep.com",
    "erin@ocalacep.com",
    "evelyn@ocalacep.com",
    "fairfieldvillage@suncommunities.com",
    "foundation@ocalacep.com",
    "freddie@ocalacep.com",
    "heather@ocalacep.com",
    "ic-check@3x-5a3e2144a9a4acf45458273b69b15bbaa81ecbe06f309c300d93a895399c26f7.png",
    "ic-keyboard-arrow-left@3x-08f6b0510226b0efcfdc2666cba73263553b72f2d32e5f011c9c98784c76587c.png",
    "ic-keyboard-arrow-right@3x-7946a10e2ef7d450d52e62227f39f8caec9bffc3c60879d9a44778ef5e31e5c8.png",
    "ic-phone@3x-4e4130ef14f1e4dbef232698ad04bf6ffcd9c9f1b9b1500598e1580f86f28fdb.png",
    "jess@ocalacep.com",
    "jessica@ocalacep.com",
    "jim@ocalacep.com",
    "joe@belleviewcep.com",
    "judy@ocalacep.com",
    "kaylin@ocalacep.com",
    "logo@2x.png",
    "louisa@ocalacep.com",
    "mark.johnson@ci.ocoee.fl.us",
    "matt@ocalacep.com",
    "mjohnson@ocoee.org",
    "norman@ocalacep.com",
    "paddockpark@suncommunities.com",
    "ron@ocalacep.com",
    "suncommunities@3x-46822945c5fcb8384c012a499105d3bc998b3619cd559add91c8f894338da44a.png",
    "sweetwater@legacymhc.com",
    "tamara@ocalacep.com",
    "thogan@ocoee.org",
    "tom@ocalacep.com"
  ],
  "nombre_sitio": "ceqfl.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://mymhcommunity.com/Florida/",
      "text": "Mobile Homes in Florida | Manufactured Home Communities in Florida Toggle navigation Menu Find A Community Move-In Ready Homes Find A Home Referral Program Home Find A Community Community Search Map Search List All Communities Communities with RV Sites States & Metro Areas Meet Our Newest Communities Find A Home Home Search Rental Search Move-In Ready Homes Sell Your Home My Favorite Homes Find an RV Resort About myMH About Us Frequently Asked Questions Contact myMH myMH Referral Program Come work for us! Helpful Articles Open New Doors Referral Program LP Home Find a Florida Mobile Home Community Discover Florida Communities Clover Leaf Farms Clover Leaf Farms Crystal Lake - Zephyrhills Forest Lake Estates Down Yonder Village East Bay Oaks Eldorado Village Glen Ellen Hillcrest - Florida Holiday Ranch Holiday Travel Park Lake Haven Paradise Park Largo Serendipity Shady Lane Oaks Shady Lane Village Shangri La Silk Oak Lodge Whispering Pines - Largo Bulow Plantation Bulow Plantation RV Resort Carriage Cove Holiday Village - Ormond Beach Lighthouse Pointe at Daytona Beach Pickwick Village Southern Palms Resort Breezy Hill Resort Carefree Cove Cheron Village Coral Cay Plantation Everglades Lakes Park City West Sunshine Holiday Buccaneer Estates Crystal Lakes - Fort Myers Emerald Lake Fort Myers Beach Resort Gulf Air Island Vista Estates Lake Fairways Country Club Pine Lakes Country Club Pioneer Village The Heritage Tropical Palms Windmill Village Beacon Hill Colony Beacon Terrace Kings and Queens Lakeland Harbor Lakeland Junction Coachwood Colony Grand Island Resort Haselton Village Lakeside Terrace Mid Florida Lakes Parkwood Communities Southernaire Indian Oaks Lakewood Village Foxwood Farms Oak Bend The Villas at Spanish Oaks Audubon Village Covington Estates Encore Tropical Palms Hidden Valley Lake Magic RV Resort Orange Lake Sherwood Forest Starlight Ranch The Arbors at CountryWood The Lakes at CountryWood The Meadows at CountryWood The Oaks at CountryWood Gulf View Bay Indies Bay Lake Estates Colony Cove Encore Winter Quarters Manatee Lake Village Ridgewood Estates Royal Coachman The Oaks at Colony Cove The Winds of St. Armands North The Winds of St. Armands South Windmill Manor Coquina Crossing Carefree Village Country Place Crystal Lake - Zephyrhills Encore Winter Quarters Pasco Featherock Hacienda Village Harborview Mobile Manor Kingswood Silver Dollar Resorts Sixth Avenue Tarpon Glen Countryside at Vero Beach Heritage Plantation Heron Cay Vero Palm Estates Village Green Lake Worth Village Maralago Cay Palm Beach Colony Palm Lake Estates The Meadows FL Crystal Lake - Zephyrhills Forest Lake Estates Sixth Avenue Water, Sun and Famous Attractions from a Florida Mobile Community There is a reason we refer to Florida as “The Sunshine State.” Miles of sandy beaches, crisp blue skies and endless activity under the sun ensures the nickname fits the bill. Home to famous vacation destinations like Orlando, Florida Keys and Fort Myers, Florida attracts thousands of visitors every year. Explore popular attractions like Disney World and Key West, or get in touch with your adventurous side with some of the best snorkeling and scuba diving in the country. Fine dining, fabulous shopping and world-class golf are other attractions that make Florida the perfect getaway. Search Florida mobile homes and make your next Florida trip an extended stay. Explore Florida Florida Manufactured Home Communities Brooksville Region Manufactured Home Communities Clover Leaf Farms 900 North Broad Street Brooksville, FL Central Florida Region Manufactured Home Communities Clover Leaf Farms 900 North Broad Street Brooksville, FL Crystal Lake - Zephyrhills 4604 Lake Crystal Blvd Zephyrhills, FL Forest Lake Estates 41200 Roselle Loop Zephyrhills, FL Clearwater-Largo Region Manufactured Home Communities Down Yonder Village 7001 N. 142nd Avenue Largo, FL East Bay Oaks 601 Starkey Road Largo, FL Eldorado Village 2505 East Bay Drive Largo, FL Glen Ellen 2882 Gulf to Bay Blvd. Clearwater, FL Hillcrest - Florida 2346 Druid Road East Clearwater, FL Holiday Ranch 4300 East Bay Drive Clearwater, FL Holiday Travel Park 1622 Aires Dr. Holiday, FL Lake Haven 1415 Main Street Dunedin, FL Paradise Park Largo 7111 142nd Avenue North Largo, FL Serendipity 29081 US Highway 19 N Clearwater, FL Shady Lane Oaks 15777 Bolesta Rd Clearwater, FL Shady Lane Village 15777 Bolesta Rd Clearwater, FL Shangri La 249 Jasper Street N.W. Largo, FL Silk Oak Lodge 28488 US Highway 19 N Clearwater, FL Whispering Pines - Largo 7501 142nd Ave North Largo, FL Daytona Beach Region Manufactured Home Communities Bulow Plantation 3165 Old Kings Rd S Flagler Beach, FL Bulow Plantation RV Resort 3345 Old Kings Road South Flagler Beach, FL Carriage Cove 5 Carriage Cove Way Daytona Beach, FL Holiday Village - Ormond Beach 1335 Fleming Avenue Ormond Beach, FL Lighthouse Pointe at Daytona Beach 155 Spring Drive Port Orange, FL Pickwick Village 4500 South Clyde Morris Blvd. Port Orange, FL Eustis Region Manufactured Home Communities Southern Palms Resort One Avocado Lane Eustis, FL Fort Lauderdale Region Manufactured Home Communities Breezy Hill Resort 800 N. E. 48th Street Pompano Beach, FL Carefree Cove 3273 NW 37th Ft. Lauderdale, FL Cheron Village 13222 SW 9th Court Davie, FL Coral Cay Plantation 2801 NW  62nd Avenue Margate, FL Everglades Lakes 2900 SW 52nd Avenue Davie, FL Park City West 10550 W. State Road 84 Davie, FL Sunshine Holiday 2802 W. Oakland Park Fort Lauderdale, FL Fort Myers Region Manufactured Home Communities Buccaneer Estates 2210 North Tamiami Trail N.E. North Fort Myers, FL Crystal Lakes - Fort Myers 5010 Country Lakes Drive Fort Myers, FL Emerald Lake 24300 Airport Road Punta Gorda, FL Fort Myers Beach Resort 16299 San Carlos Blvd. Ft. Myers, FL Gulf Air 17279 San Carlos Blvd. SW Ft. Myers Beach, FL Island Vista Estates 3000 N. Tamiami Trail N. Fort Myers, FL Lake Fairways Country Club 19371 Tamiami Trail North Fort Myers, FL Pine Lakes Country Club 10200 Pine Lakes Boulevard North Fort Myers, FL Pioneer Village 7974 Samville Rd. North Ft. Myers, FL The Heritage 3000 Heritage Lakes Boulevard North Fort Myers, FL Tropical Palms 17100 Tamiami Trail Punta Gorda, FL Windmill Village 16131 North Cleveland Avenue North Fort Myers, FL Lakeland Region Manufactured Home Communities Beacon Hill Colony 1112 W. Beacon Rd. Lakeland, FL Beacon Terrace 2425 Harden Blvd. Lakeland, FL Kings and Queens 2808 N. Florida Ave. Lakeland, FL Lakeland Harbor 4747 North Road 33 Lakeland, FL Lakeland Junction 202 E. Griffin Rd. Lakeland, FL Leesburg Region Manufactured Home Communities Coachwood Colony 2607 Leisure Lane Leesburg, FL Grand Island Resort 13318 Sea Breeze Ln Grand Island, FL Haselton Village 14 Coral Street Eustis, FL Lakeside Terrace 24 Sunrise Lane Fruitland Park, FL Mid Florida Lakes 199 Forest Drive Leesburg, FL Parkwood Communities 414 Springlake Road Wildwood, FL Southernaire 1700 Sanford Rd. Mt. Dora, FL Melbourne-Titusville Region Manufactured Home Communities Indian Oaks 780 Barnes Boulevard Rockledge , FL Lakewood Village 3171 Hanson Avenue Melbourne, FL Ocala Region Manufactured Home Communities Foxwood Farms 4705 NW 20th Street Ocala, FL Oak Bend 10620 S.W. 27th Avenue Ocala, FL The Villas at Spanish Oaks 3150 N.E. 36th Avenue Ocala, FL Orlando-Kissimmee Region Manufactured Home Communities Audubon Village 6565 Beggs Rd. Orlando, FL Covington Estates 3942 Glenwick Drive Saint Cloud, FL Encore Tropical Palms 2650 Holiday Trail Kissimmee, FL Hidden Valley 8950 Polynesian Ln. Orlando, FL Lake Magic RV Resort 9600 Hwy 192 West Clermont, FL Orange Lake 15840 SR 50, Lot 32 Clermont, FL Sherwood Forest 5302 W. Irlo Bronson Highway Kissimmee, FL Starlight Ranch 6000 Pershing Ave. Orlando, FL Plant City Region Manufactured Home Communities The Arbors at CountryWood 745 Arbor Estates Way Plant City, FL The Lakes at CountryWood 745 Arbor Estates Way Plant City, FL The Meadows at CountryWood 745 Arbor Estates Way Plant City, FL The Oaks at CountryWood 745 Arbor Estates Way Plant City, FL Punta Gorda Region Manufactured Home Communities Gulf View 10205 Burnt Store Road Punta Gorda, FL Sarasota-Bradenton Region Manufactured Home Communities Bay Indies 950 Ridgewood Avenue Venice, FL Bay Lake Estates 1200 East Colonia Lane Nokomis, FL Colony Cove 101 Amsterdam Avenue Ellenton, FL Encore Winter Quarters Manatee 800 Kay Road NE Bradenton, FL Lake Village 400 Lake Drive Nokomis, FL Ridgewood Estates 3461 Stephanie Lane Ellenton, FL Royal Coachman 1070 Laurel Road East Nokomis, FL The Oaks at Colony Cove 101 Amsterdam Avenue Ellenton, FL The Winds of St. Armands North 4000 North Tuttle Avenue Sarasota, FL The Winds of St. Armands South 3000 North Tuttle Avenue Sarasota, FL Windmill Manor 4920 Windmill Manor Ave. Bradenton, FL St. Augustine Region Manufactured Home Communities Coquina Crossing 4536 Coquina Crossing Drive Elkton, FL Tampa Region Manufactured Home Communities Carefree Village 8000 Sheldon Road Tampa, FL Country Place 2601 Country Place Boulevard New Port Richey, FL Crystal Lake - Zephyrhills 4604 Lake Crystal Blvd Zephyrhills, FL Encore Winter Quarters Pasco 21632 State Road 54 Lutz, FL Featherock 2200 Highway 60 East Valrico, FL Hacienda Village 7107 Gibraltar Avenue New Port Richey, FL Harborview Mobile Manor 6617 Louisiana Avenue New Port Richey, FL Kingswood 10109 Oak Forest Drive Riverview, FL Silver Dollar Resorts 12515 Silver Dollar Drive Odessa, FL Sixth Avenue 39345 6th Ave. Zephyrhills, FL Tarpon Glen 1038 Sparrow Ln. Tarpon Springs, FL Vero Beach Region Manufactured Home Communities Countryside at Vero Beach 8775 20th Street Vero Beach, FL Heritage Plantation 1101 82nd Avenue Vero Beach, FL Heron Cay 1400 90th Avenue Vero Beach, FL Vero Palm Estates 1405 82nd Avenue Vero Beach, FL Village Green 7300 20th Street Vero Beach, FL West Palm Beach Region Manufactured Home Communities Lake Worth Village 4041 Roberts Way #3 Lake Worth, FL Maralago Cay 6280 South Ash Lane Lantana, FL Palm Beach Colony 1273 Dianne Drive #148 West Palm Beach, FL Palm Lake Estates 7272 42nd Way North West Palm Beach, FL The Meadows FL 2555 PGA Boulevard Palm Beach Gardens, FL Zephyrhills/Wesley Chapel Region Manufactured Home Communities Crystal Lake - Zephyrhills 4604 Lake Crystal Blvd Zephyrhills, FL Forest Lake Estates 41200 Roselle Loop Zephyrhills, FL Sixth Avenue 39345 6th Ave. Zephyrhills, FL Find A Community Find A Home List All Communities Helpful Articles About Us Come work for us! Like Us on Facebook MHC Property Management, L.P. 1-800-274-7314 © 2025 MHC Property Management, L.P. Terms, Conditions and Privacy Policy Specifications, options, layout, and pricing vary by model and are subject to change without notice. Pictures may include optional features. Details apply to specific homes only and are subject to change without notice. We shall not be responsible for any typographical errors, misinformation, misprints and shall be held totally harmless. Information deemed reliable but not guaranteed. Prospective residents to verify all information to their own satisfaction. Additional restrictions may apply, see associate for full details."
    },
    {
      "url": "https://rocusa.org/why-resident-ownership/",
      "text": "What is a ROC? - ROC USA Skip to content ROC Association Election Nominations are LIVE! Click here to submit a nomination and learn more about the Midwest Election in 2025. Get Involved Our Work Resident Ownership Purchase Process Financing Training & Learning Support Grants Policy and Advocacy Communities Communities Gallery Resources Overview ROCKET ROC Management Guides Our Impact Research Training & Learning Ownership Matters Podcast Videos ROC Association About Us Overview Meet the Team Careers News Blog Media Center Contact Us Search Get Involved Why Resident Ownership? ROCKET Sell Your Community ROC Association Donate ROC USA Headquarters 6 Loudon Road, Suite 306 Concord, NH 03301 ROC USA Washington D.C. 1200 G St. NW, Suite 220 Washington, DC 20005 Call 603.513.2791 Email contact_us@rocusa.org Menu Why Resident Ownership? Control sits with the landowners. In traditional manufactured home communities (sometimes still outdatedly called “mobile home parks” or “trailer parks”), even though residents own their homes, the community owners control the land, set the site fees and make the park rules. They also control the condition of the community – including roads, water, electric, waste-water systems and landscaping. Each time the community is sold to a new owner, the rent is likely to increase. English Español Benefits of a ROC? Security, control and zero profit margin. Unlike traditional manufactured home communities, ROCs are not subject to market-based rent increases, and there is no profit margin in monthly site fees. This cooperative ownership gives homeowners the ability to control costs, improve facilities and make their own rules while providing the peace of mind of land ownership. What makes a ROC different? Control Members have a say in their ROC, with major decisions made by democratic vote. An elected Board of Directors appoints committees and hires a property manager to manage daily tasks and oversee the community’s needs. Eviction Security Members continue to own their own homes individually and own an equal share of the land beneath the entire neighborhood. They sign perpetual leases and enjoy lifetime security against unfair eviction. Liability Protection Members are not personally liable for loans made by the cooperative. Their only personal financial investment in the ROC is their Member share, which is typically $250-$500 and paid back when they move out. Strong Sense of Community Homeowners in ROCs get to know their neighbors like never before. They help one another, check in on one another, and get together for potlucks, cleanup days or simply to enjoy their secure neighborhood. Site Fees Compared Use our Site Fee Predictor to see firsthand the savings homeowners in ROCs experience. Each year, ROC USA commissions a market rent study to measure how ROCs are doing relative to the market on the important question of affordability. The data is remarkably consistent: ROCs are not just secure, they’re stable, too. And the affordability in ROCs gets better with time. Our longitudinal study by a national appraisal firm shows ROC Members’ site fees are already 11% below market after just five years, and 21% below market after 10 years. Site Fee Predictor Resident Owned Communities vs. Commercially Owned Communities This tool compares site fee increases in two communities, one a ROC where annual increases average 0.9% and the other a commercially owned community, where annual increases average 7.1%.* Starting Monthly Fee $ Years From Now 5 10 15 20 25 30 $0 Future Monthly Rent Resident Owned $0 Future Monthly Rent Commercially Owned $0 Lifetime Savings For ROC Residents *MHInsider Magazine, May/June 2024 A tale of two communities The journeys to resident ownership in Longmont and Golden, Colo., involved overcoming challenges related to rent increases and unstable living conditions under private ownership. Both communities benefited from the support of nonprofits like ROC USA and Thistle, as well as local government. Longmont’s success hinged on a significant loan from the Longmont City Council and robust community collaboration. In Golden, the community’s purchase involved a larger financial transaction and more direct city involvement. Click below to see what happened in Golden when first a large out-of-state owner took over and then see how things changed when the residents purchased and where they are one-year later. Residents in Golden deal with the aftermath of a private company buying their mobile home park Read the Article How life — and rent — improved when residents took ownership of a Longmont mobile home park Read the Article How does a ROC impact the homeowners who live there? No fear of the community being sold and being forced to move Part of the uncertainty of living in an investor-owned manufactured home community is not knowing if, someday, the community will be sold and homeowners will be forced to move their family and their home. Homeowners in ROCs can live there as long as they choose so long as they pay their site fees and follow the community rules, which are voted on by the Membership. ROC homeowners build more equity in their homes Homes in ROCs are naturally more desirable and sell more quickly than homes in investor-owned communities. Their monthly site fees are lower and, research shows , they have a 12% higher price per square foot when they sell. Resident ownership inspires investments and improvements With the knowledge that their homes – their largest assets – are secure, homeowners increasingly invest in their homes and yards. Beautification committees enhance neighborhood landscaping, boost curb appeal, and improve signage, fostering a more welcoming community and increasing community pride. ROC homeowners connect with their peers near and far The cooperative structure of a ROC fosters an enhanced feeling of community as neighbors come together to help one another and work for the betterment of the entire ROC. They get to know one another like never before and are able to connect with homeowners in ROCs from coast to coast through the ROC Association and ROCKET, ROC USA’s Online Community for Knowledge, Education and Training . We set out to make improvements, and in just the first year finished all the tree work, treated septic systems, upgraded electric panels, and painted speed bumps and fire hydrants. We’re able to pick and choose vendors. We’ve made capital improvements, and saved money in reserves for the future. It’s the best thing we ever did. Kathy Zorotheos Oak Hill Taunton Resident Association Taunton, Mass The reason I’m very happy that we have become to be a ROC is that we’ve become a very close community throughout the process. Plus, we are able to control maintenance and rent. Tom Mikesell Board Treasurer, Meadowood Community Cooperative Littleton, Colo. Your support empowers ROCs and contributes to vital improvement projects. Together, we can build stronger, more vibrant neighborhoods for all residents. Every contribution makes a difference. Join us in making positive change happen! Donate Take Action ROC USA Headquarters 6 Loudon Road, Suite 306 Concord, NH 03301 ROC USA Washington D.C. 1200 G St. NW, Suite 220 Washington, DC 20005 Call 603.513.2791 Email contact_us@rocusa.org Our Work Resident Ownership Purchase Process Financing Training & Learning Support Grants Policy and Advocacy Communities Communities Gallery Resources Overview ROCKET ROC Management Guides Our Impact Research Training & Learning Ownership Matters Podcast Videos ROC Association About Us Overview Meet the Team Careers News Blog Media Center Contact Us Get Involved Partner With Us ROC Association Sell Your Community Take Action Policy and Advocacy Donate ©2025 ROC USA. All rights reserved. Privacy Policy Terms Cookies Policy Consent Preferences"
    },
    {
      "url": "https://ocalacep.com/the-cep/team",
      "text": "Team | Ocala CEP CONTACT US JOIN US About Ocala Live Life Here Ocala Metro Economic Overview Metro Profile CEP on the Scene The Catalyst History Job Openings Visit Ocala Ocala Metro Arts Scene CEP Network Programs Growing Jobs The CEP Who We Are Partner Services Ambassadors Foundation Leadership - Board of Directors Top Investors Team Strategic Plan 2025 Sponsorship Guide Team Alphabetical by Last Name - All Executive Team Job Creation & Business Growth Communications & Operations Partner Programs & Services Andrea Bailey Director of Business Services 352.629.8051 x114 Andrea@OcalaCEP.com Read More about Andrea Bailey... What my friends think I do: Whatever it is, my friends know that I am probably laughing and trying to help someone, which is close enough. Official Bio: Andrea grew up in the Midwest but has lived in nine states. She is married to Jeff and they have two wonderful daughters together named Hannah and Emery. They have lived in Ocala since 2010 and love it! Andrea has had what seems to be a very diverse career, including being a server, nanny, hotel concierge, hotel catering manager, meetings director, account manager, office assistant, and award-winning business owner. While they all were in different industries, all revolved around helping people. She is hoping to bring that same service-minded mentality to her new position at the CEP. Read More Less Louisa Barton Director of Equine Initiative 352.629.8051 x107 Louisa@OcalaCEP.com Read More about Louisa Barton... What my friends think I do: Talk about horses for a living in a British accent and go to all the big horse races and events! Official Bio: Louisa was born in England and lived in Stratford-Upon-Avon, the home of the great Bard, William Shakespeare. She was on a horse before she could walk, competed in England locally in the hunter/jumper horse shows and dabbled in some eventing. She moved to America and rode in a Western saddle for the first time on a Tennessee Walker, and she has been hooked ever since. She now enjoys relaxing trail rides on the beautiful Florida Greenway Trails.  She has been in sales, marketing and communication-related positions most of her life. While recording some radio commercials at a local sports radio station three years ago, she was offered an opportunity to host her own horse radio show right here in ‘the Horse Capital’ and has talked about horses on the radio dial and on the Internet worldwide for a living ever since. Her friends were correct on their thoughts about her!! She loves Marion County and the community we have here and all that we have to offer, so she was delighted to accept the position here at the Chamber and Economic Partnership to help to grow Marion County even more. She takes the most joy out of her children, her horses and helping new businesses to connect with others in this area and her favourite part is meeting new people. Every one of them has a fascinating story. Her specialty is connecting all the people from a great variety of equine disciplines with one another, while also making sure equestrians and non-equestrians connect and begin to understand and appreciate one another. She is thrilled to be a part of this team! Read More Less Chris Blankenship Senior Partner Relations Associate 352.629.8051 x120 Chris@OcalaCEP.com Read More about Chris Blankenship... What my friends think I do: That I work in sales, and that I get paid on the spot after each sale! Official Bio: Chris joined the CEP in December 2022 as Partner Relations Associate, driving new partnerships for the CEP. Chris was born and raised in Savannah, GA and just recently moved to Ocala in June 2022. He graduated from Armstrong State University in 1999 with a BS in Mathematics and Master of Education from Troy University in 2005. From 1999-2008 Chris was a high school Math teacher, Defensive Coordinator for the football team and head Baseball coach. After leaving teaching he got into the health sales industry, pharmaceuticals for 6 years and home health sales for 8 years. In his free time Chris enjoys going to the gym and is a huge sports fan. When not watching sports on TV he travels to Aiken, SC to watch his 2 sons play college baseball. Chris has been married for 4 years to his wife Jamie and they have a blended family of 6. Read More Less Dawn Bowman Director of Downtown Market 352.629.8051 x128 Dawn@OcalaCEP.com Read More about Dawn Bowman... What my friends think I do: Do Facebook live videos and shop. Official Bio: Raised as an Air Force brat, I was not from anywhere. Nov. 2006 in the early hours of dawn, the morning dew was thick, the temperature was cool, horses were galloping in the pastures, the morning was perfect.  We were driving on US 301 where horse farms and Oak Trees lined the road, somewhere between Citra and Anthony. My first visit to Ocala and that was it, I had found my home. Now I can finally say.. “I’m from Ocala” Married to my perfect for me person Matt Cornelison since 1991, we have three wonderful sons, that brought us three amazing daughters-in-law’s that have given us 6 ‘n counting grandchildren. We also have a small petting farm “Finally Home Farm” that we have many rescued fur/feather babies… dogs, cat, chickens, goats, and horses. I am proud to say I have been a part of the CEP since 2012. I started as partner, became an Ambassador, Ambassador Co-chair,  Director of Partner Relations, graduate of LOM class XXVIII, LOM Regent and now Director of Ocala Downtown Market. Prior to the CEP my background includes being a Territory Manager for Nabisco, Owner of B.E.S.Trucking and a Licensed Insurance Agent. Read More Less Arin Conrad Director of Communications & Marketing 352.629.8051 x118 Arin@OcalaCEP.com Read More about Arin Conrad... Official Bio: With a strong background in brand building, strategic marketing, and community outreach, Arin is passionate about helping Ocala grow and thrive. Born and raised in Ocala, Arin has a deep-rooted love for her hometown, which inspires everything she does. She’s held communications roles with the City of Ocala, Marion County Public Schools, and the College of Central Florida—giving her a well-rounded perspective on the area and the people who call it home. Her skills range from video production and graphic design to public engagement, making her a powerful storyteller and advocate for local businesses and initiatives. Arin earned her Bachelor’s degree in Communication from the University of Central Florida. When she’s not working to promote Ocala, you’ll likely find her out and about in the community—volunteering, meeting new people, or discovering some of the city’s hidden gems. Read More Less Kaylin Cornelison Ocala Downtown Market Admistrative Coordinator 352.629.8051 x130 Kaylin@OcalaCEP.com Read More about Kaylin Cornelison... What my friends think I do: Work in public relations and shop at the market every Saturday. Official Bio: Born and raised here in Ocala Kaylin has always felt like this was where she was meant to live. She has always loved being here and never dreamed of leaving her little abode. Most of her family lives in or near here and family is one of the most important parts of her life. After graduating from Forest High School, shoutout to the class of 2011, she went down to Indian River State College for two years to play volleyball at the junior college level. After returning home to Ocala at the end of 2012, she started working at her first job at Publix in Belleview. During that summer of 2013 she started talking to her now husband, Eric. They dated, got engaged, and married all within two years of being together. After getting married in August of 2015, Kaylin moved to Pooler, Georgia since Eric was an active Army soldier stationed there. she was thankfully able to transfer to a Publix store up there and continue to work. Family is very important to them, so living roughly four hours from home was nice as they were able to visit often. In October of 2017, Eric’s new orders took them to Colorado Springs, Colorado. Being over 1,500 miles from home was an adjustment and being there was extremely lonely at times. Now fast forward to now, they are living back home in Ocala with two beautiful little girls that are able to grow up with such a large family that loves them both. Eric is a diesel mechanic at Gary Yeomans Ford in Ocala and until recently Kaylin was in school to become a Medical Coder and Biller. She feels very fortunate for the opportunity to work at the Ocala Downtown Market as an Administrative Coordinator working with two amazing women. Read More Less Tamara Fleischhaker, CCE, IOM, FCCP Interim CEO and Chief eXperience Officer 352.629.8051 x102 Tamara@OcalaCEP.com Read More about Tamara Fleischhaker, CCE, IOM, FCCP... What my friends think I do: Most of them think I work for the government. Always fun to explain how we advocate for business to government. Official Bio: As the CXO for the Ocala Metro Chamber & Economic Partnership, Tamara oversees the programs that help partners acheive the greatest return on their investment. These include advocacy, education, equine initiative, leadership, networking, and partner services. She joined the CEP in April of 2006 with a background in marketing, events, and public policy. Tamara earned her Certified Chamber Executive (CCE) designation, representing only 4% of chamber professionals nationwide. She is also a Florida Certified Chamber Professional (FCCP) and U.S. Chamber of Commerce Foundation Institute for Organization Management (IOM) program graduate. She was the 2016 Professional of the Year for Florida Association of Chamber Professionals (FACP). She was the 2022-23 Chair of the FACP Board of Directors. Tamara’s professional experience includes communications & marketing, brand development, contract management, as well as account management and event production. She also has over 35 years of festival and event management experience with various international festivals and events. She grew up working in her dad's screen printing company, so she is glad to be supporting small business, which is dear to her heart. Read More Less Jessica Gilbert Vice President, Foundation 352.629.8051 x113 Foundation@OcalaCEP.com Read More about Jessica Gilbert... What my friends think I do: I think they are still trying to figure that out – somewhere between having a lot of fun and always being busy. Official Bio: Born and raised in Ocala, Florida, where she attended Forest High School, laying the groundwork for her future endeavors. Fueling her passion for communication and storytelling, she pursued a degree in Communications and Broadcasting at the University of South Florida. Immersed in Florida's vibrant racing community from a young age, Jessica's career trajectory took an exhilarating turn when she joined Turner Broadcasting in Atlanta, contributing her talents to NASCAR's digital team. Despite her success in Atlanta, Jessica's heart remained anchored to her hometown, Ocala. Driven by her dedication to family, she made the pivotal decision to return, prioritizing, Elizabeth and Bradley, and raising them in the familiar embrace of the Ocala community. Jessica's professional journey reflects her diverse skill set, encompassing marketing, brand development, event management, fundraising, and communications. These multifaceted abilities were showcased during her tenure as Director of Community Affairs at Kids Central Inc., where her unwavering commitment to fostering connectivity between the organization and the community flourished over six years. Now, poised for a new chapter, Jessica eagerly embraces the opportunity to merge her love for Ocala/Marion County with her skill set at the CEP. In her free time, you'll find Jessica passionately cheering on players #52 and #28 at the ball fields, or on the water, enveloped in the pages of a book. Read More Less Ron Hipner Partner Relations Associate 352.629.8051 x119 Ron@OcalaCEP.com Read More about Ron Hipner... What my friends think I do: Network 24/7 Official Bio: Ron was born in 1965 in Garden City Michigan, Military family. He was stationed in San Diego 1970. He briefly attended Southwestern College 1984-85.  Ron became a State Contractor in 1990, recognized as an Industry Leader Specializing in Floor and Wall Installations for Clean Rooms, Medical, Pharmaceutical and Manufacturing Facilities. Ron gifted the business to his office staff in 2004 when he moved to Florida. He then became a Real Estate investor 1997 – current. He is Master Captain Certified and the CEO of West Florida Sportfishing 2004-2012. Ron is the owner and operator of a small IT services company from 2008-2010. He was a  Direct Sales Professional and Global Trainer for Enagic USA 2011 to present. Ron is a two time graduate of Rapport Mastery training under Joe Pici of Pici & Pici. 2016,2017. Rons hobbies include and avid fisherman, outdoors enthusiast, playing guitar and enjoys snowboarding. Currently, he is learning Aquaponics and improving his skills at growing food. He also has some Electronics Circuitry Design and Computer Skills both inspired by wanting to know how things work. Read More Less Tom James Director of Executive Engagement 352.629.8051 x117 Tom@OcalaCEP.com Read More about Tom James... What my friends think I do: Smile & shake hands. Schmooze, just like your dad! Sell memberships. Official Bio: Tom James is a born & bred multi-generation Ocala, Florida, Kingdom of the Sun kid, who earned a Bachelors in Communications from UCF. As Director of Executive Engagement, Tom oversees Sponsorship procurement, as well as managing relationships with CEP's Executive Tier partners. Locally, Tom is a long time Elk, a United Way volunteer, and a regular emcee for various community events. Before returning to his hometown in 2012 with his wife Heather, Tom worked as an Account Executive at Sun Broadcasting in Fort Myers/Naples. He spent seven (7) years helping Fox News Radio become the #1 billing station in the Southwest Florida market. Additionally, Tom is a freelance Sportscaster with over 2 decades in the business. A 2-Time Edward R. Murrow Award Winner & former 2-time NBC-TV affiliate Sports Director/Main Anchor, Tom currently does Play-by-Play & Studio Hosting for the ESPN Family of Networks, CBS Sports Network, Lacrosse Sports Network, the Pro Watercross circuit & Florida Gulf Coast University basketball. Locally, he does radio play-by-play for high school football and College of Central Florida basketball and is a regular contributor to the weekly regional Southern Pigskin Tonight college football show. Read More Less Erin A. Jones Director of Healthcare Development 352.629.8051 x111 Erin@OcalaCEP.com Read More about Erin A. Jones... What my friends think I do: Go to lunches and posting said lunches on social media and attend events… they aren’t wrong! Official Bio: Erin is the Director of Healthcare Development, a newly developed position for the CEP. Erin started her healthcare journey with CVS Pharmacy as a Cpht and Pharmacy Recruiter/Intern Program Manager. As she transitioned into PR, Erin taught Intro to Pharmacy at Rasmussen College for a short time.  She is very excited to bring her mix of public relations, networking and passion for healthcare to the CEP and help grow and align the healthcare through the Sphere initiative, in the Ocala Metro. Born in Hollywood, FL, and relocating to Ocala when she was wee lass. She is no stranger to the growth and economic vitality of the Ocala Metro.  The daughter of a developer, she has seen first hand the growth in our area and is so proud to call this her home. In her spare time, she likes to travel, cook, and spend time with her Bassett Hound, Bella. Read More Less Judy Kopp Chief Financial Officer 352.629.8051 x104 Judy@OcalaCEP.com Read More Less Donna Marseco Director of First Impressions 352.629.8051 x100 Donna@OcalaCEP.com Read More about Donna Marseco... What my friends think I do: Answer phones and emails. Official Bio: Donna was born and raised in Florida. Originally from West Palm Beach but moved to Ocala in 2002. She holds an associate degree in Business Management with focus on Entrepreneurship, as well as a certificate in Wedding and Event Planning. Has worked retail and customer service for the last 13 years, her first and only job but is now looking forward to her time with the CEP. When not working she enjoys reading and genealogy. Read More Less Amie Marsh Director of Finance & Operations 352.629.8051 x131 Amie@OcalaCEP.com Read More about Amie Marsh... What my friends think I do: Answer the phone, talk to people and go to events. My friends think I just have fun all day! Official Bio: Amie was born and raised in a very small town in Lafayette, TN. She married her husband Jason in 2000 and they have 3 great kids (one of which is her dog Jax whom she considers her child). She is Mimi to the most precious grandbaby ever! Amie has spent most of her career in the logistics and supply side of the industry while working for Nestle Waters North America for over 14 years.  Her family moved to Ocala in May 2020 due to her husband’s job and they absolutely fell in love with the area. She has been a stay at home mom for the past several years but finds herself more of a busy body and decided to get back to work. Amie did not want to go back into the industry so she was looking for a job where she could socialize and learn more about the area, so this was the perfect fit at the Ocala CEP.  Her southern accent is always a great conversation starter as she is asked at least once daily “where I am from” and apparently everyone just loves to hear her talk, except her husband. Read More Less Beth McCall Director of Advocacy and Talent Development 352.629.8051 x116 Beth@OcalaCEP.com Read More about Beth McCall... What my friends think I do: They know I love the arts and assume in my leisure time,  if I am not directing or singing in a choir I am attending a concert, art show, or enjoying a book with classical music playing in the background. Official Bio: Beth holds a bachelor’s degree in Education and Music, as well as a master’s degree in Leadership and Management. She became a Certified Fund Raising Executive in 2008. With over 30 years of experience in the non-profit sector, Beth has served in Executive Director roles for the Public Education Foundation of Marion County, the Munroe Regional Medical Center Foundation, and the Marion County Children’s Alliance. In 2013, she launched her own consulting business to support non-profits with strategic planning and fund development. Beth was elected to the Marion County School Board in 2016, serving through June 2021. Deeply committed to her community, she continually seeks opportunities to help make it a better place to live, work, and play. Read More Less Jessica Michel Director of Incubators 352.629.8051 x 124 Jessica@OcalaCEP.com Read More about Jessica Michel... What my friends think I do: Ecosystem builder for entrepreneurs. Official Bio: Jessica is a native Ocalan. She graduated from the College of Central Florida in Fall 2014 with a Bachelor's of Applied Science in Business and Organizational Management. She has grown within the organization starting as an intern for Business Services to her now current position as Director of Business Creation.Jessica is a lead organizer for a community lead event each week for entrepreneurs called 1 Million Cups Ocala and enjoys creating an ecosystems to help entrepreneurs thrive in the Ocala Community. She is also a member of League Ocala since 2020 and is in the process of becoming Incubator Management Certified. In her off time you can find her scoping out the coolest places in in Florida with her camera by her side, capturing moments. Read More Less Freddie Morris Director of Entrepreneurship Services 352.629.8051 x122 Freddie@OcalaCEP.com Read More about Freddie Morris... What my friends think I do: Send emails and hop on Zoom calls. Official Bio: Freddie, a Palm Beach County native, ventured to Tampa and earned a Mass Communications Degree from the University of South Florida. He then soared into the airwaves as a traffic reporter and Camera Operator at iHeartMedia. Transitioning into business development as a Business Associate at Florida Commerce. Now, as the Director of Entrepreneurship Services, Freddie aims to make a significant mark on the Ocala business scene. Read More Less Bryce Morrison Director of Business Development 352.629.8051 x106 Bryce@OcalaCEP.com Read More about Bryce Morrison... What my friends think I do: Fly drones all day. Official Bio: Bryce leads the CEP's Talent Attraction efforts, Live Life Here. He works to both directly recruit talented individuals to call the Ocala Metro home and assists local companies with their recruitment efforts. Bryce is also the CEP's resident drone pilot having earned his FFA license. Read More Less Jim Pazda Director of Partner Services 352.629.8051 x125 Jim@OcalaCEP.com Read More about Jim Pazda... What my friends think I do: “… He works for the City of Ocala, I think...\"    (Freely distributes maps of Ocala and re-directs phone calls to staff. One ringy-dingy, two ringy-dingy) Official Bio: Jim is originally from Rochester, NY. He endured harsh winters in upstate NY, particularly where he attended college at the State University of NY @Oswego. “They literally erected rope guides / fences in winter on campus as the winds off Lake Ontario were known to lift lighter weight students off the icy grounds and make projectiles out of them“. He graduated with a Bachelor of Fine Arts degree. Jim worked briefly as a teacher after college and has also work extensively in banking customer service, research and fulfillment and loan servicing. He moved to the Tampa Bay area in 1998, where he resided for 20 years in close proximity to the Gulf coast enjoying the beaches. Jim now enjoys living in Dunnellon, FL, with his partner, Baxter, and their persistent cat, GiGi. He enjoys gardening, bicycling, photography, and exploring Florida’s numerous freshwater springs, particularly Rainbow River. Read More Less Joe Reichel Director of Belleview CEP 352.462.1251 Joe@BelleviewCEP.com Read More about Joe Reichel... What my friends think I do: Coming soon! Official Bio: Joe Reichel began his career in general construction in the Pittsburgh,  PA metro. After relocating to the Ocala Metro, he transitioned into the restoration construction industry. When he took over the marketing and business development side of the business, he found that his true talent was creating connections for himself and others for the betterment of the community. He began working in Partner Relations at the Ocala CEP in 2015, and has since committed his efforts to building relationships within the business and greater local community, now for Belleview with the Belleview CEP. Read More Less Evelyn Reyes VP, Business Creation 352.629.8051 x108 Evelyn@OcalaCEP.com Read More about Evelyn Reyes... What my friends think I do: Attend events and meet important people. Official Bio: Evelyn is a senior-level business executive with over two decades of experience and proven leadership. She is a subject matter expert in economic development, procurement, supplier diversity, advertising, marketing, and communications. Armed with a Business Administration degree from the Interamerican University of Puerto Rico, Evelyn is a determined bilingual leader known for establishing enduring relationships and delivering impactful results within the business community. Evelyn has held key roles, including Program Manager at The Florida Department of Commerce, Manager for Enterprise Florida's Small & Minority Capital Program, and was a Senior Business Consultant for the U.S. Department of Commerce. Recognized for her the impact of her outstanding work, she received the US Department of Commerce’s MBDA Senior Business Consultant of the Year Award in 2017 and 2018, alongside other accolades such as the \"Coqui De Oro\" in communications from \"La Casa de Puerto Rico\" in 2012. Evelyn is celebrated for her exceptional career in sales and community involvement, receiving the \"Homenaje a Ti Mujer\" Award from \"Tu Revista Mujer\" in 2011. Read More Less Jess Schultz VP, Partner Engagement 352.629.8051 x127 Jess@OcalaCEP.com Read More about Jess Schultz... What my friends think I do: Make best friends with every single person in Ocala! Official Bio: As Senior Director of Partner Engagement, Jess oversees partnership development, the CEP Ambassador program, as well as all CEP networking events including: Net>Works groups & Leadership Council, Networking University, CEO Network Receptions, NetPerking, Business After Hours, CEP 101: Partner Orientation, & Marion Business Advantage Jess is from Huntsville, Alabama, and is a high school/ middle school English teacher turned yoga and fitness trainer/ instructor, and holds multiple wellness certifications. Jess is a networking machine, helping businesses grow through CEP partnerships and making connections. She has been married since 2006 and has four kids and two grands. Read More Less Heather Shubirg, MEDP Chief Growth Officer 352.629.8051 x103 Heather@OcalaCEP.com Read More about Heather Shubirg, MEDP... What my friends think I do: Bring businesses to town. Official Bio: Heather Shubirg serves as the Chief Growth Officer for the Ocala Metro Chamber and Economic Partnership. Prior to joining the Ocala Metro CEP, Heather served as the Executive Vice President of Team Volusia Economic Development Corporation.  She served as the Senior Director of Business Development in the Advanced Manufacturing and Technology sectors at the Orlando Economic Partnership. Heather   started in economic development with of Enterprise Florida - the public private partnership responsible for leading Florida’s statewide economic development efforts, and served as Vice President of Business Development.  Heather worked on new-to-market projects including many Amazon.com fulfillment centers across the State of Florida, Blue Origin with 330 new jobs and a $200 million capital investment and Northrop Grumman ’s expansion of 1,800 jobs and a $500 million investment. Prior to joining Enterprise Florida, Heather worked for Volusia County Government as an Environmental Specialist under the Florida Department of Environmental Protection’s Petroleum Cleanup Program, and later as the Sustainability Associate under the Energy Efficiency and Conservation Block Grant Program. Heather received her Bachelor of Science in Economics and Master of Science in Economics from the University of Central Florida.  In addition, Heather earned a Graduate Certificate in Sustainable Management from Anaheim University. Heather published her master’s thesis in the Journal of Environment Economics and is certified in Basic Economic Development as well as Business Recruitment and Retention by the International Economic Development Council. In 2021, Heather received a Master Economic Development Practitioner (MEDP) Certification through the Advanced Economic Development Leadership Program in partnership with the University of New Mexico, The University of Southern Mississippi, Clemson University & Texas Christian University.  Locally, Heather serves on the Board for the SMA Healthcare Foundation. In 2021, Governor Ron DeSantis appointed Heather Shubirg to the Board of the Florida Development Finance Corporation for a one-year appointment. Heather hails originally from Attica, New York and currently lives in Ocala, Florida with her husband, two daughters and three dogs! Read More Less Diane Thomason Partner Relations Associate 352.629.8051 Diane@OcalaCEP.com Read More about Diane Thomason... What my friends think I do: Ambassador for the Ocala Metro.  Connecting businesses and community. Loves to give out hugs. Official Bio: Diane was born in Cincinnati, Ohio and grew up in Richmond, Indiana. Known as \" The Rose City”.  She graduated with a BA degree from Indiana University in Communications. One of her passions is Radio.  She started her broadcasting career at age 15 for a 50,000-watt radio station in her hometown.  Diane was a radio broadcaster for 22 years and finished in the top 100 market in Knoxville, Tennessee.  Her favorite platform was classic rock where she got to meet and hang out with several rock bands from the 80’s. She could tell you some cool stories. Diane is the owner and CEO of her company Ocala Promotions.  This company is award-winning and well known for how they connect their business with other businesses in the Ocala metro with Branded Merchandise.  This is where she can help Brand your business small to corporate. Her passion is entrepreneurs and small businesses. Diane also was involved with the Chambers Ambassador program for the past 7 years. Helping chair the ambassadors for most of it. Leading with a good example on how to connect with several businesses in the community.  She is still involved with teaching networking classes for the chamber. Diane is a trusted source, being in the community and being active for many years. Diane's hobbies are playing tennis, Loves football: Dallas Cowboys fan and college football. Read More Less Norman Velásquez Álvarez Director IMPACT Entrepreneurship Services 352.629.8051 x124 Norman@OcalaCEP.com Read More about Norman Velásquez Álvarez... Official Bio: Norman Velásquez Álvarez is a visionary leader dedicated to helping small businesses grow through innovation, sustainability, and business development. Trained as a Social Communicator – Journalist at the University of Antioquia, he specializes in senior management, business training, and entrepreneurship. With a strong background in negotiation and non-violent conflict resolution, he has led major projects like Antioquia Vision 21st Century and the Colombian Chamber of Commerce Network. His work spans collaborations with universities, business federations, and government institutions, positioning him as a key connector between public and private sectors. Recognized for his contributions to entrepreneurship, he holds prestigious awards, including the Order of Dignity and Homeland from the Colombian Congress. Now residing in Ocala, Florida, under the EB2 National Interest Visa, he continues to drive business transformation locally and internationally. Read More Less Matt Wilkerson Director of Partner Success 352.629.8051 x112 Matt@OcalaCEP.com Read More about Matt Wilkerson... What my friends think I do: Having lunch with folks everyday and take selfies with them. Official Bio: Matt was born in Tampa, Florida. He has lived up and down the east coast and settled in Ocala in 1985. Matt comes from a retail background directly correlating to the power of networking. Networking built his business and created long lasting relationships. Matt has a Bachelors degree in Finance/Accounting and understands the importance of building business relationships. Read More Less 310 SE 3rd St. Ocala, FL 34471 Tel: 352.629.8051 Fax: 352.629.7651 ABOUT OCALA PROGRAMS GROWING JOBS THE CEP Privacy Policy | Refund Policy Chat with us , powered by LiveChat"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/59384-cala-springs-mobile-home-village-3323-ne-14th-st-c-18-ocala-fl-34470",
      "text": "Cala Springs Mobile Home Village | 3323 Ne 14th St C-18, Ocala, FL 34470 | MHBO.com SEARCH Buy Rent Explore Parks My Property Feed favorite_border Favorites Sign Up or Login COMMUNITY PROFILE Cala Springs Mobile Home Village 3323 Ne 14th St C-18 location_on Map It Ocala, FL 34470 | ID: 59384 hotel_class Review this Park Inquire About Homes Lot Rent Info Inquire About Homes Lot Rent Info 55 + PET FRIENDLY PHOTOS VIDEO STREET VIEW 29.2039178 -82.0895438 971214 3323 Ne 14th St C-18, Ocala, FL 34470 Details Name Cala Springs Mobile Home Village Type of community Age-restricted community ? Lot rent $310 Office Phone (866) 482-1771 Total # of lots 113 Pet policy check Pet friendly Community owner type Company, privately held Community owner Park Village LLC & Ganbatle LLC Year built 1972 Average monthly HOA/Lot Rent fees $310 Water type City Sewer type City provided Street width Average Parking On-street Street type Paved Community operator Park Village LLC & Ganbatle LLC Climate Zone Rating HOT-HUMID MORE OWNER/MANAGER? CLAIM THIS COMMUNITY Call Us (866) 482-1771 Sales & Leasing input SEND TO MY PHONE About lot rent check Trash pickup check Landscaping check Water Disclaimer Lot rent and other fees can change at any time without notice. MHBO is not responsible for quoting current monthly fees,\n          lot rent, or any dues/fees associated with the community or home. Additional fees for certain amenity privileges may apply.\n          All applicable community fees are the responsibility of the buyer to obtain and community manager/owner to disclose prior to ownership or occupancy. Description Cala Springs Mobile Home Village is an age-restricted (55+) manufactured home community located in 3323 Ne 14th St C-18, Ocala, FL 34470. Cala Springs Mobile Home Village is a land-lease community was built in 1972. and has a total of 113 home sites. Home site lot rent ranges from $310 per month and includes the following: Trash pickup Landscaping Water The streets in the community are paved, and are of an average street width. The water in the community is sourced from the city and the sewer system is city provided. Parking is on-street The community has 0 parking spaces available for RVs. Managed on-site by Park Village LLC & Ganbatle LLC. Cala Springs Mobile Home Village is an affordable housing choice for active, friendly, age-qualified living. This well-maintained retirement community has easy access to local recreation, shopping and entertainment. Equal Housing Opportunity Amenities check Clubhouse check Recreation facilities check Swimming pool check Laundry facilities check Library Local Climate HOT-HUMID Cala Springs Mobile Home Village is located in Climate Zone 1.\n      A HOT-HUMID climate is defined as a region that receives more than 20 inches (50 cm) of annual precipitation, and where the monthly average outdoor temperature remains above 67°F (19.5°C) throughout the year. Knowing your area’s climate zone (as assigned by the U.S. Department of Energy’s Building America Program into one of eight zones), can help you predict your heating and cooling needs. Humidity and temperature can of course vary, even by county. The Building America HOT-HUMID climate zone corresponds to the portions of IECC zones 2 and 3 in the dry category. READ MORE ABOUT CLIMATE ZONES > Inquire about this Community I was searching on MHBO.com and found your community. Please send me more information about Cala Springs Mobile Home Village at 3323 Ne 14th St C-18, Ocala, FL 34470 Send Message Share Share Email email Share on Facebook Share on Twitter Information Requested A detailed information sheet has been sent to your email. CLOSE Similar Mobile Home Parks You might be interested in these nearby communities. The Villas at Spa... Ocala, FL Features pool Pool Cliftwood Ocala, FL Community Type group_add Age Restricted Rolling Greens Vi... Ocala, FL Features pool Pool About Contact Accessibility Services Terms & Privacy Blog Sitemap © 2025 MHBO.com Equal Housing Opportunity Send Inquiry to Plant Prefab Model Type One Two Three Status One Two Three Create an alert for new models like this Send Message × Send to Your Phone"
    },
    {
      "url": "https://www.suncommunities.com/florida/fairfield-village",
      "text": "Manufactured Homes in Ocala, Florida | Fairfield Village Skip to main content Sun Communities/Sun Outdoors - Michigan About Amenities Find A Home Specials More Investor Relations https://www.suninc.com/investor-relations Fairfield Village Referrals https://www.refersun.com/ Fairfield Village Customer Portal https://www.sunwebportal.com/ Fairfield Village Search Homes Investor Relations https://www.suninc.com/investor-relations Fairfield Village Referrals https://www.refersun.com/ Fairfield Village Customer Portal https://www.sunwebportal.com/ Fairfield Village https://www.suncommunities.com/florida/fairfield-village Fairfield Village Seacrh Bar Toggle Investor Relations https://www.suninc.com/investor-relations Fairfield Village Referrals https://www.refersun.com/ Fairfield Village Customer Portal https://www.sunwebportal.com/ Fairfield Village Search Homes https://www.suncommunities.com/ Fairfield Village Menu Call Map Search Homes Please enter a valid query Search query must be between 5 and 200 characters Search query must be between 5 and 200 characters Clear Text user search query search widget - Fairfield Village Search AI Tooltip Refine your search by specifying a property type or additional features. recent searches search inspiration Search for 3-bedroom pet friendly apartments in Florida. List houses in Indiana with at least 2 bathrooms, priced below $95,000. Find a 3-bedroom house for rent in Michigan below $1,200. Leave Feedback How was your search experience? Positive experience Negative experience Please select like/ dislike Got Suggestions? We’d love to hear them! (optional) https://www.suncommunities.com/florida/fairfield-village Fairfield Village SEND FEEDBACK Thank you for your feedback! Generated with AI Yes. All-age manufactured home communities offer friendly neighborhoods and amenities for families, such as basketball and pickleball courts, playgrounds, community centers, outdoor pools, and dog parks. Title goes here lorem ipsum Lorem ipsum a eu dignissim nunc nascetur sed nibh imperdiet porttitor imperdiet duis viverra pharetra... Title goes here lorem ipsum Lorem ipsum a eu dignissim nunc nascetur sed nibh imperdiet porttitor imperdiet duis viverra pharetra... Title goes here lorem ipsum Lorem ipsum a eu dignissim nunc nascetur sed nibh imperdiet porttitor imperdiet duis viverra pharetra... No Results Found. Try refining your search or click one of the commonly asked questions below. Search for 3-bedroom pet friendly apartments in Florida. List houses in Indiana with at least 2 bathrooms, priced below $95,000. Find a 3-bedroom house for rent in Michigan below $1,200. Seacrh Bar Toggle Searching with AI... Fairfield Village Active 55+ Community Share Home Facebook Copy Link Send to Mail Share via SMS Click on View Full Gallery 5866 SW 58th Place, Ocala, FL 34474 Phone: (866) 466-1288 https://www.suncommunities.com/florida/fairfield-village Fairfield Village Office Hours: Monday - Friday: 8 a.m. - 5 p.m. | 1st and 3rd Saturday: 9 a.m. - 1 p.m. Contact Us About Contact Us Contact Us Fairfield Village View Site Plan about Property Fairfield Village Fairfield Village close map modal + - Fairfield Village Active 55+ Community Living in Ocala, Florida Nestled in a peaceful setting in Ocala, this 55+ manufactured home community is surrounded by thoroughbred horse farms and scenic views of central Florida. Lush landscapes form the tranquil neighborhood setting amid numerous wonderful amenities, all provided to promote an active, social lifestyle. At Fairfield Village, you'll find life is anything but re-tiring. Realize your shark aspirations in the billiards room of our plantation-style clubhouse. Grab a lounge chair and a good book on the sundeck of our heated swimming pool and spa. Cancel that gym membership and get your workout routine done in our fully-equipped fitness center. Meet your neighbors on the shuffleboard and horseshoe courts. Join our hobby groups or social committees with scheduled meetings or show up if you have time, when the mood strikes; you decide your level of involvement at Fairfield Village. Read More View Homes about Active 55+ Community Living in Ocala, Florida Active 55+ Community Living in Ocala, Florida Fairfield Village Amenities and Activities At Fairfield Village, you'll enjoy a peaceful community with beautiful common areas and numerous amenities to keep you active and energized. Swimming Pool Clubhouse Fitness Center Dog Park Library View All Amenities About Amenities and Activities Amenities and Activities Fairfield Village Featured Homes Find Your Dream Home Sale Pending Share Home Facebook Copy Link Send to Mail Share via SMS $70,000* Additional fees may apply, click here for details 3 beds | 2 baths | 1568 sqft | Site: #FFV-002K 5925 SW 56th Place , FL, 34474 View This Home Click on FFV Fairfield Village Property details button Find Your Dream Home Fairfield Village Share Home Facebook Copy Link Send to Mail Share via SMS $69,900* Additional fees may apply, click here for details 3 beds | 2 baths | 1222 sqft | Site: #FFV-028G 5852 SW 57th Place , FL, 34474 View This Home Click on FFV Fairfield Village Property details button Find Your Dream Home Fairfield Village Share Home Facebook Copy Link Send to Mail Share via SMS $69,000* Additional fees may apply, click here for details 2 beds | 2 baths | 960 sqft | Site: #FFV-035G 5922 SW 57th Place , FL, 34474 View This Home Click on FFV Fairfield Village Property details button Find Your Dream Home Fairfield Village Share Home Facebook Copy Link Send to Mail Share via SMS $68,500* Additional fees may apply, click here for details 2 beds | 2 baths | 1176 sqft | Site: #FFV-053A 5847 SW 55th Place , FL, 34474 View This Home Click on FFV Fairfield Village Property details button Find Your Dream Home Fairfield Village Previous Previous Slide Next Next Slide View All Homes Click on View All Homes Find Your Dream Home Fairfield Village Discover Come home to a lushly landscaped 55+ community located in beautiful Ocala, Florida. This area is known for its scenic horse farms and natural landmarks, including Silver Springs and the Ocala National Forest. Excellent shopping, restaurants, cultural centers, medical facilities, golf courses, banking and other services are minutes away in Ocala to enhance your retirement living. Things to Do Airports The Canyons Zip Line and Adventure Park Sholom Park Farm Tours of Ocala Ocala/Marion County Veterans Memorial Park Silver Springs State Park Orlando Sanford International Airport (SFB) Gainesville Regional Airport (GNV) Fairfield Village Gallery Fairfield Village - Play Area Fairfield Village - Garden Area Fairfield Village - Side View Fairfield Village - Front View Fairfield Village - Library Area Fairfield Village - Fitness Area Fairfield Village - Sports Club View Fairfield Village - Dinning Hall Fairfield Village - Road View Fairfield Village - Road View Fairfield Village - Road View Expand Gallery About Gallery Ask Our Team Frequently Asked Questions Phone: (866) 466-1288 https://www.suncommunities.com/florida/fairfield-village Fairfield Village Contact Us FAQ Contact Us Is Ocala, Florida, a good place to live? Is Ocala, Florida, a good place to live? Ocala, Florida, is a fantastic place to live. With its beautiful natural surroundings, affordable cost of living, vibrant community and abundant recreational activities, it offers an excellent quality of life for residents. How much is a new manufactured home in Ocala, Florida? How much is a new manufactured home in Ocala, Florida? The cost of our quality-built manufactured homes varies based on unit size and site location. Please get in touch with our team for pricing and more information. What recreational activities are offered at Fairfield Village? What recreational activities are offered at Fairfield Village? Fairfield Village offers a range of recreational facilities including a clubhouse, swimming pool, and shuffleboard courts. The community also hosts various social events and activities for residents to enjoy. What are the best things to do in Ocala, Florida? What are the best things to do in Ocala, Florida? Experience the best of Ocala, Florida, by exploring the stunning Silver Springs State Park, visiting the renowned Ocala National Forest, indulging in horseback riding, and discovering the vibrant downtown area with its unique shops and dining. Phone: (866) 466-1288 https://www.suncommunities.com/florida/fairfield-village Fairfield Village Contact Us FAQ Contact Us Don’t Take it From Us. Hear From our Residents. \"It's a nice place… peaceful… safe.. conveniently located near shopping just about every thing a person needs.\" Don’t Take it From Us. Hear From our Residents. \"Very friendly community.\" Don’t Take it From Us. Hear From our Residents. \"We have recommended family and friends . For the most part it's clean and well maintained…\" Previous Click on Previous Slide Next Click on Next Slide Close Fairfield Village selected interest First Name * Last Name * Email * Mobile Phone I’m interested in * Select Home Type Buying a Home Renting a Home Message: * By checking this box, you have read and agreed to our Terms of Use Send Connect With Us: map-Fairfield Village 5866 SW 58th Place , Ocala , Florida 34474 (866) 466-1288 https://www.suncommunities.com/florida/fairfield-village Fairfield Village click on social link Visit Facebook Page SUN COMMUNITIES All Age Overview All Age Overview All Age Lifestyle All Age Homes Active 55+ Communities 55+ Overview 55+ Lifestyle 55+ Homes 55+ Florida HOMES FOR SALE HOMES FOR RENT Additional Fees STATE LOCATIONS CITY LOCATIONS OUR BUILDER Our Blog About Sun Investor Relations Acquisitions Join Our Team Contact Us Vacation Home Sales Find A Resort Instagram Instagram Facebook Facebook Youtube Youtube © 2025 Sun Communities. All rights reserved. Sitemap Terms Of Use Accessibility Privacy Policy"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/48879-cherry-hill-mobile-home-park-3531-south-pine-avenue-ocala-fl-34471",
      "text": "Cherry Hill Mobile Home Park | 3531 South Pine Avenue, Ocala, FL 34471 | MHBO.com SEARCH Buy Rent Explore Parks My Property Feed favorite_border Favorites Sign Up or Login COMMUNITY PROFILE Cherry Hill Mobile Home Park 3531 South Pine Avenue location_on Map It Ocala, FL 34471 | ID: 48879 hotel_class Review this Park Inquire About Homes Lot Rent Info Inquire About Homes Lot Rent Info ALL AGES PHOTOS VIDEO STREET VIEW 29.1535809 -82.122961 954346 3531 South Pine Avenue, Ocala, FL 34471 Details Name Cherry Hill Mobile Home Park Type of community All-ages community ? Lot rent range $450 - $750 Office Phone (352) 732-2898 Community owner type Company, privately held Water type City Sewer type City provided Street width Narrow Parking Off-street Street type Paved Climate Zone Rating HOT-HUMID MORE OWNER/MANAGER? CLAIM THIS COMMUNITY Call Us (352) 732-2898 Les Smith input SEND TO MY PHONE About lot rent The lot rent ranges from $450 - $750 per month and includes: check Trash pickup check Water check Sewer Disclaimer Lot rent and other fees can change at any time without notice. MHBO is not responsible for quoting current monthly fees,\n          lot rent, or any dues/fees associated with the community or home. Additional fees for certain amenity privileges may apply.\n          All applicable community fees are the responsibility of the buyer to obtain and community manager/owner to disclose prior to ownership or occupancy. Description Cherry Hill Mobile Home Park is an all-ages manufactured home community located in 3531 South Pine Avenue, Ocala, FL 34471. Cherry Hill Mobile Home Park is a land-lease community Home site lot rent ranges from $450 - $750 per month and includes the following: Trash pickup Water Sewer The streets in the community are paved, and are of an narrow street width. The water in the community is sourced from the city and the sewer system is city provided. Parking is off-street The community has 0 parking spaces available for RVs. Cherry Hill Mobile Home Park is an affordable housing choice for active, family-friendly living. This well-maintained community has easy access to local schools, recreation, shopping and entertainment. Equal Housing Opportunity Local Climate HOT-HUMID Cherry Hill Mobile Home Park is located in Climate Zone 1.\n      A HOT-HUMID climate is defined as a region that receives more than 20 inches (50 cm) of annual precipitation, and where the monthly average outdoor temperature remains above 67°F (19.5°C) throughout the year. Knowing your area’s climate zone (as assigned by the U.S. Department of Energy’s Building America Program into one of eight zones), can help you predict your heating and cooling needs. Humidity and temperature can of course vary, even by county. The Building America HOT-HUMID climate zone corresponds to the portions of IECC zones 2 and 3 in the dry category. READ MORE ABOUT CLIMATE ZONES > Inquire about this Community I was searching on MHBO.com and found your community. Please send me more information about Cherry Hill Mobile Home Park at 3531 South Pine Avenue, Ocala, FL 34471 Send Message Share Share Email email Share on Facebook Share on Twitter Information Requested A detailed information sheet has been sent to your email. CLOSE Similar Mobile Home Parks You might be interested in these nearby communities. Paddock Park South Ocala, FL Features pool Pool Oakwood Mobile Manor Ocala, FL Community Type family_restroom All Ages Rolling Greens Vi... Ocala, FL Homes Ranging From $5K - $190K About Contact Accessibility Services Terms & Privacy Blog Sitemap © 2025 MHBO.com Equal Housing Opportunity Send Inquiry to Plant Prefab Model Type One Two Three Status One Two Three Create an alert for new models like this Send Message × Send to Your Phone"
    },
    {
      "url": "https://ocoee.org/1149/About-Us",
      "text": "About Us | Ocoee, FL Skip to Main Content Search City of Ocoee Phone: 407-905-3100 1 North Bluford Avenue, Ocoee, FL 34761 About Us Events Programs Facilities Parks Community Relations Home City Government Departments Parks & Leisure Services About Us About Us The City of Ocoee Parks and Leisure Services Department strives to provide the citizens of Ocoee with safe and enjoyable programs, parks and facilities that will enhance the quality of life for city residents and promote an overall sense of community. We are committed to providing quality recreational services and welcome your comments, suggestions and ideas. Ocoee Lakeshore Center The Ocoee Lakeshore Center is West Orange County’s premier event destination. From wedding to conventions, the Lakeshore Center can host your event in style. Enjoy lovely lake views and modern amenities from all areas of our facility. The Lakeshore Center features banquet seating for more than 200 people, a modern catering kitchen, additional rooms for use and a state of the art audio-visual system. The historic Withers-Maguire House is suited for bridal party preparations and smaller meetings and events. For more information contact the Parks and Leisure Services Administrative office at 407-877-5803. Facilities The Parks and Leisure Services Department manages six recreation centers located throughout the city. A variety of programs for youth, adults and seniors are offered at these centers throughout the week. All centers are available during weekday evenings and on weekends to rent for family gatherings, parties, meetings, receptions, banquets and other special occasions. For more information contact the Parks and Leisure Services Administrative office at 407-877-5803. Parks The Parks and Leisure Services Department operates and maintains thirteen parks throughout the city with some of the following amenities: picnic areas, playgrounds, basketball and tennis courts, baseball, softball, football and soccer fields, and pavilions. Discover a park close to you. Programs The Parks and Leisure Services Department provides a variety of year-round recreational programs and events for youth , adults and seniors to enhance the quality of life for the residents of Ocoee. For more information on the programs and classes, please contact the Jim Beech Recreation Center at 407-905-3180 or check out our Facebook Page . Family Aquatic Center The Ocoee Family Aquatic Center provides a safe and relaxing setting for families to enjoy their day. Special features include a zero depth entry for easy access and spray features for the kids to splash the day away. For more information on programs and classes at the aquatic center, contact the Jim Beech Recreation Center at 407-905-3180. Ocoee Music Festival The City of Ocoee’s Fall Music Festival is celebrated annually drawing more than 20,000 people each year. The festival includes both local and national entertainment and one of the best fireworks displays in Central Florida. It is non-stop fun! For more information please contact Mark Johnson , Parks & Leisure Services Director or check the Festival website . Contact Us Mark Johnson Parks and Recreation Director Email Dan Abdo Parks Operations Manager Email Toren Hogan Recreation Operations Manager Email 1 N. Bluford Ave Ocoee, FL 34761 Directions Ph: 407-877-5803 Hours Monday - Thursday 7:30 a.m. - 5:30 p.m. Friday 8:00 a.m. - 5:00 p.m. Staff Directory Parks & Recreation Advisory Board Helpful Links Accessibility Employment Site Map Ocoee CRA Website /QuickLinks.aspx FAQs How many counselors and/or children can I bring? How many counselors do I need to have? What days can I schedule a visit? How can I pay for my camp visit? What happens if it is raining or there is a storm prior to or during my visit? /FAQ.aspx Under Florida law, e-mail addresses are public records. If you do not want your e-mail address released in response to a public records request, do not send electronic mail to this entity. Instead, contact this office by phone or in writing. To Top Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.suncommunities.com/florida/paddock-park-south",
      "text": "Manufactured Homes in Ocala, Florida | Paddock Park South Skip to main content Sun Communities/Sun Outdoors - Michigan About Amenities Find A Home Specials More Investor Relations https://www.suninc.com/investor-relations Paddock Park South Referrals https://www.refersun.com/ Paddock Park South Customer Portal https://www.sunwebportal.com/ Paddock Park South Search Homes Investor Relations https://www.suninc.com/investor-relations Paddock Park South Referrals https://www.refersun.com/ Paddock Park South Customer Portal https://www.sunwebportal.com/ Paddock Park South https://www.suncommunities.com/florida/paddock-park-south Paddock Park South Seacrh Bar Toggle Investor Relations https://www.suninc.com/investor-relations Paddock Park South Referrals https://www.refersun.com/ Paddock Park South Customer Portal https://www.sunwebportal.com/ Paddock Park South Search Homes https://www.suncommunities.com/ Paddock Park South Menu Call Map Search Homes Please enter a valid query Search query must be between 5 and 200 characters Search query must be between 5 and 200 characters Clear Text user search query search widget - Paddock Park South Search AI Tooltip Refine your search by specifying a property type or additional features. recent searches search inspiration Search for 3-bedroom pet friendly apartments in Florida. List houses in Indiana with at least 2 bathrooms, priced below $95,000. Find a 3-bedroom house for rent in Michigan below $1,200. Leave Feedback How was your search experience? Positive experience Negative experience Please select like/ dislike Got Suggestions? We’d love to hear them! (optional) https://www.suncommunities.com/florida/paddock-park-south Paddock Park South SEND FEEDBACK Thank you for your feedback! Generated with AI Yes. All-age manufactured home communities offer friendly neighborhoods and amenities for families, such as basketball and pickleball courts, playgrounds, community centers, outdoor pools, and dog parks. Title goes here lorem ipsum Lorem ipsum a eu dignissim nunc nascetur sed nibh imperdiet porttitor imperdiet duis viverra pharetra... Title goes here lorem ipsum Lorem ipsum a eu dignissim nunc nascetur sed nibh imperdiet porttitor imperdiet duis viverra pharetra... Title goes here lorem ipsum Lorem ipsum a eu dignissim nunc nascetur sed nibh imperdiet porttitor imperdiet duis viverra pharetra... No Results Found. Try refining your search or click one of the commonly asked questions below. Search for 3-bedroom pet friendly apartments in Florida. List houses in Indiana with at least 2 bathrooms, priced below $95,000. Find a 3-bedroom house for rent in Michigan below $1,200. Seacrh Bar Toggle Searching with AI... Paddock Park South Active 55+ Community Share Home Facebook Copy Link Send to Mail Share via SMS Click on View Full Gallery 8880 SW 27th Ave., Ocala, FL 34476 Phone: (888) 325-6466 https://www.suncommunities.com/florida/paddock-park-south Paddock Park South Office Hours: Monday - Friday: 8 a.m. - 5 p.m. | 1st and 3rd Saturday: 10 a.m. - 2 p.m. Contact Us About Contact Us Contact Us Paddock Park South View Site Plan about Property Paddock Park South Paddock Park South close map modal + - Paddock Park South Gorgeous Manufactured Home Living in Ocala Take in the picturesque hills and trees of the famous Ocala horse country at Paddock Park South. Live an enviable lifestyle at our 55+ manufactured home community in the heart of central Florida, surrounded by beautiful forests and well-maintained grounds. Our friendly neighborhood offers impressive amenities and activities that promote active and engaged living. Our great location is close to theaters, restaurants, shopping, beautiful walking paths, and scenic views. Stop by our spacious clubhouse for a game of billiards, catching up with friends, or browsing through our library. Go for a dip in our heated swimming pool, stay fit with aqua-aerobics, relax in the hot tub, or lounge poolside and work on your tan. When it comes to recreational activities, we offers horseshoes, shuffleboard, and fishing on our two catch-and-release ponds. Have a relaxed retirement lifestyle your way at Paddock Park South. Read More View Homes about Gorgeous Manufactured Home Living in Ocala Gorgeous Manufactured Home Living in Ocala Paddock Park South Amenities and Activities Embrace a relaxed country lifestyle in our active 55+ community with a hometown feel. Live at your own pace. Swimming Pool Clubhouse Fitness Center Recreational Activities Hot Tub View All Amenities About Amenities and Activities Amenities and Activities Paddock Park South Featured Homes Find Your Dream Home New Model Share Home Facebook Copy Link Send to Mail Share via SMS $170,995* Rent For: $1,399/mo* Additional fees may apply, click here for details 2 beds | 2 baths | 972 sqft | Site: #PPS-B043 8880 SW 27th Ave #B043 , FL, 34476 View This Home Click on PPS Paddock Park South Property details button Find Your Dream Home Paddock Park South Coming Soon Share Home Facebook Copy Link Send to Mail Share via SMS $119,995* Rent For: $1,399/mo* Additional fees may apply, click here for details 3 beds | 2 baths | 1196 sqft | Site: #PPS-B055 8880 SW 27th Ave #B055 , FL, 34476 View This Home Click on PPS Paddock Park South Property details button Find Your Dream Home Paddock Park South Just Reduced Share Home Facebook Copy Link Send to Mail Share via SMS $98,000* Additional fees may apply, click here for details 2 beds | 2 baths | 864 sqft | Site: #PPS-B013 8880 SW 27th Ave #B013 , FL, 34476 View This Home Click on PPS Paddock Park South Property details button Find Your Dream Home Paddock Park South Just Reduced Share Home Facebook Copy Link Send to Mail Share via SMS $78,000* Additional fees may apply, click here for details 2 beds | 2 baths | 960 sqft | Site: #PPS-A053 8880 SW 27th Ave #A053 , FL, 34476 View This Home Click on PPS Paddock Park South Property details button Find Your Dream Home Paddock Park South Previous Previous Slide Next Next Slide View All Homes Click on View All Homes Find Your Dream Home Paddock Park South Discover Living in the Paddock Park South community, residents have access to a myriad of activities and outdoor adventures. Take a glass-bottom boat tour at Silver Springs State Park. For horse lovers, the World Equestrian Center is a premier destination for events and shows. Art and history buffs will appreciate the Appleton Museum of Art and the Fort King National Historic Park. Head to the Ocala Downtown Square, with its quaint shops, restaurants, and events that showcase the vibrant spirit of this unique Florida city. Things to Do Airports World Equestrian Center Appleton Museum of Art The Canyons Zip Line and Adventure Park Ocala/Marion County Veterans Memorial Park Silver Springs State Park Gainesville Regional Airport (GNV) Paddock Park South Gallery Paddock Park South - Scenic View Paddock Park South - Side View with Garden Paddock Park South - Outside View with Garden Paddock Park South - Outside View Paddock Park South - A view from above Paddock Park South - View of Lake Paddock Park South - Gym View Paddock Park South - Sitting View Paddock Park South - Sitting View Paddock Park South - Library View Paddock Park South - Sports Club Paddock Park South - Kitchen View Paddock Park South - Swimming Pool Paddock Park South - Swimming Pool View Paddock Park South - Front View Paddock Park South - Lake View Paddock Park South - Road View Paddock Park South - Property View Paddock Park South - Sports View Paddock Park South - Sitting View Expand Gallery About Gallery Ask Our Team Frequently Asked Questions Phone: (888) 325-6466 https://www.suncommunities.com/florida/paddock-park-south Paddock Park South Contact Us FAQ Contact Us Is Ocala, Florida, a good place to live? Is Ocala, Florida, a good place to live? Ocala, Florida, offers a desirable living environment with its pleasant climate, culture, and natural beauty. It's particularly appealing for those seeking a laid-back lifestyle and an abundance of outdoor activities. How much is a new manufactured home in Ocala, Florida? How much is a new manufactured home in Ocala, Florida? The cost of our quality-built manufactured homes varies based on unit size and site location. Please get in touch with our team for pricing and more information. What recreational activities are offered at Paddock Park South? What recreational activities are offered at Paddock Park South? Paddock Park South provides various recreational activities, including community events, swimming, fitness facilities, and outdoor sports like pickleball. These amenities encourage an active and engaging lifestyle for residents. What are the best things to do in Ocala, Florida? What are the best things to do in Ocala, Florida? In Ocala, Florida, you can explore attractions like the Ocala National Forest, Silver Springs State Park, and the Appleton Museum of Art. Enjoy outdoor adventures, horseback riding, and cultural experiences in this charming city. Phone: (888) 325-6466 https://www.suncommunities.com/florida/paddock-park-south Paddock Park South Contact Us FAQ Contact Us Don’t Take it From Us. Hear From our Residents. \"I absolutely love it here! Felt like home immediately. I definitely made the right choice. Thanks!\" Don’t Take it From Us. Hear From our Residents. \"Nice place to live.\" Don’t Take it From Us. Hear From our Residents. \"The entire process was great and all the people that I came across in the park are very fine adults. Had I known this place was so sweet I would have cut out from up north a year ago.\" Previous Click on Previous Slide Next Click on Next Slide Close Paddock Park South selected interest First Name * Last Name * Email * Mobile Phone I’m interested in * Select Home Type Buying a Home Renting a Home Message: * By checking this box, you have read and agreed to our Terms of Use Send Connect With Us: map-Paddock Park South 8880 SW 27th Ave. , Ocala , Florida 34476 (888) 325-6466 https://www.suncommunities.com/florida/paddock-park-south Paddock Park South SUN COMMUNITIES All Age Overview All Age Overview All Age Lifestyle All Age Homes Active 55+ Communities 55+ Overview 55+ Lifestyle 55+ Homes 55+ Florida HOMES FOR SALE HOMES FOR RENT Additional Fees STATE LOCATIONS CITY LOCATIONS OUR BUILDER Our Blog About Sun Investor Relations Acquisitions Join Our Team Contact Us Vacation Home Sales Find A Resort Instagram Instagram Facebook Facebook Youtube Youtube © 2025 Sun Communities. All rights reserved. Sitemap Terms Of Use Accessibility Privacy Policy"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/48854-westwood-mobile-home-park-600-sw-38th-ave-ocala-fl-34474",
      "text": "Westwood Mobile Home Park | 600 Sw 38TH Ave, Ocala, FL 34474 | MHBO.com SEARCH Buy Rent Explore Parks My Property Feed favorite_border Favorites Sign Up or Login COMMUNITY PROFILE Westwood Mobile Home Park 600 Sw 38TH Ave location_on Map It Ocala, FL 34474 | ID: 48854 hotel_class Review this Park Inquire About Homes Lot Rent Info Inquire About Homes Lot Rent Info ALL AGES PHOTOS VIDEO STREET VIEW 29.1805054 -82.1876257 954320 600 Sw 38TH Ave, Ocala, FL 34474 Details Name Westwood Mobile Home Park Type of community All-ages community ? Lot rent range $450 - $750 Office Phone (352) 410-7162 Community owner type Company, privately held Water type City Sewer type City provided Street width Average Parking Off-street Street type Paved Climate Zone Rating HOT-HUMID MORE OWNER/MANAGER? CLAIM THIS COMMUNITY Call Us (352) 410-7162 Sales & Leasing input SEND TO MY PHONE About lot rent The lot rent ranges from $450 - $750 per month and includes: check Trash pickup check Water check Sewer Disclaimer Lot rent and other fees can change at any time without notice. MHBO is not responsible for quoting current monthly fees,\n          lot rent, or any dues/fees associated with the community or home. Additional fees for certain amenity privileges may apply.\n          All applicable community fees are the responsibility of the buyer to obtain and community manager/owner to disclose prior to ownership or occupancy. Description Westwood Mobile Home Park is an all-ages manufactured home community located in 600 Sw 38TH Ave, Ocala, FL 34474. Westwood Mobile Home Park is a land-lease community Home site lot rent ranges from $450 - $750 per month and includes the following: Trash pickup Water Sewer The streets in the community are paved, and are of an average street width. The water in the community is sourced from the city and the sewer system is city provided. Parking is off-street The community has 0 parking spaces available for RVs. Westwood Mobile Home Park is an affordable housing choice for active, family-friendly living. This well-maintained community has easy access to local schools, recreation, shopping and entertainment. Equal Housing Opportunity Local Climate HOT-HUMID Westwood Mobile Home Park is located in Climate Zone 1.\n      A HOT-HUMID climate is defined as a region that receives more than 20 inches (50 cm) of annual precipitation, and where the monthly average outdoor temperature remains above 67°F (19.5°C) throughout the year. Knowing your area’s climate zone (as assigned by the U.S. Department of Energy’s Building America Program into one of eight zones), can help you predict your heating and cooling needs. Humidity and temperature can of course vary, even by county. The Building America HOT-HUMID climate zone corresponds to the portions of IECC zones 2 and 3 in the dry category. READ MORE ABOUT CLIMATE ZONES > Inquire about this Community I was searching on MHBO.com and found your community. Please send me more information about Westwood Mobile Home Park at 600 Sw 38TH Ave, Ocala, FL 34474 Send Message Share Share Email email Share on Facebook Share on Twitter Information Requested A detailed information sheet has been sent to your email. CLOSE Similar Mobile Home Parks You might be interested in these nearby communities. Foxwood Farms Ocala, FL Features pool Pool Sweetwater Oaks MHP Ocala, FL Homes Ranging From $44K - $129K Oakwood Mobile Manor Ocala, FL Community Type family_restroom All Ages About Contact Accessibility Services Terms & Privacy Blog Sitemap © 2025 MHBO.com Equal Housing Opportunity Send Inquiry to Plant Prefab Model Type One Two Three Status One Two Three Create an alert for new models like this Send Message × Send to Your Phone"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/40450-fairfield-village-5866-sw-58th-place-ocala-fl-34474",
      "text": "Fairfield Village Of Ocala| 5 Homes Available | 5866 Sw 58th Place, Ocala, FL 34474 | MHBO.com SEARCH Buy Rent Explore Parks My Property Feed favorite_border Favorites Sign Up or Login COMMUNITY PROFILE Fairfield Village Of Ocala 5866 Sw 58th Place location_on Map It Ocala, FL 34474 | ID: 47581 Available Homes ( 5 ) Lot Rent Info Available Homes ( 5 ) Lot Rent Info RV RESORT 55 + PHOTOS VIDEO STREET VIEW Active 55+ Community launch 29.1287032 -82.216431 997427 5866 Sw 58th Place, Ocala, FL 34474 Details Name Fairfield Village Of Ocala Type of community Age-restricted community ? Office Phone (866) 466-1288 Total # of lots 293 Pet policy check Pet friendly check Pet restrictions apply Pet Friendly. Call for details. - Pet restrictions Community owner type REIT Community owner Sun Communities, Inc Property manager on site check Year built 1991 Water type City Sewer type City provided Street width Average Parking Off-street Street type Paved Climate Zone Rating HOT-HUMID Security check Secured with walls or fences MORE HOMES RANGING FROM $66K - $70K Schedule a Visit Check out Fairfield Village... Call Us (866) 466-1288 Tarrah Smith input SEND TO MY PHONE Available Listings Loading... About lot rent Disclaimer Lot rent and other fees can change at any time without notice. MHBO is not responsible for quoting current monthly fees,\n          lot rent, or any dues/fees associated with the community or home. Additional fees for certain amenity privileges may apply.\n          All applicable community fees are the responsibility of the buyer to obtain and community manager/owner to disclose prior to ownership or occupancy. Description Fairfield Village Of Ocala is an age-restricted (55+) manufactured home community located in 5866 Sw 58th Place, Ocala, FL 34474. Fairfield Village Of Ocala is a land-lease community was built in 1991. and has a total of 293 home sites. The streets in the community are paved, and are of an average street width. The water in the community is sourced from the city and the sewer system is city provided. Parking is off-street The community has 0 parking spaces available for RVs. Managed on-site by Sun Communities, Inc. Fairfield Village Of Ocala is an affordable housing choice for active, friendly, age-qualified living. This well-maintained retirement community has easy access to local recreation, shopping and entertainment. Equal Housing Opportunity Amenities check Billiards check Bingo check Boat storage check Fitness center check Horseshoes check Kids playscape check Clubhouse check Recreation facilities check Shuffleboard courts check Swimming pool check Laundry facilities check On-site customer service check Tennis courts check Activities check Banquet room check Bocce ball check Library check Game room check Whirlpool/Spa/Hot Tub check Picnic area check Badminton courts check Walking trails check Mini golf check Ping pong table check Pickleball court check Paddleball court check Social Events check Community Center with Fully Equipped Kitchen check Dances check Cards check Common Area Free WiFi check Heated Swimming Pool check Dog Park check Restrooms check Free Wifi check Community Dinners check Computer Center w/ Free WiFi check Crafting check Meeting Rooms check Planned Activities check Hot Tubs MORE Local Climate HOT-HUMID Fairfield Village Of Ocala is located in Climate Zone 1.\n      A HOT-HUMID climate is defined as a region that receives more than 20 inches (50 cm) of annual precipitation, and where the monthly average outdoor temperature remains above 67°F (19.5°C) throughout the year. Knowing your area’s climate zone (as assigned by the U.S. Department of Energy’s Building America Program into one of eight zones), can help you predict your heating and cooling needs. Humidity and temperature can of course vary, even by county. The Building America HOT-HUMID climate zone corresponds to the portions of IECC zones 2 and 3 in the dry category. READ MORE ABOUT CLIMATE ZONES > Inquire about this Community I was searching on MHBO.com and found your community. Please send me more information about Fairfield Village Of Ocala at 5866 Sw 58th Place, Ocala, FL 34474 Send Message Share Share Email email Share on Facebook Share on Twitter Information Requested A detailed information sheet has been sent to your email. CLOSE Similar Mobile Home Parks You might be interested in these nearby communities. Saddle Oak Club Ocala, FL Features pool Pool Paddock Park South Ocala, FL Features pool Pool Shady Road Villas Ocala, FL Features golf_course Golf About Contact Accessibility Services Terms & Privacy Blog Sitemap © 2025 MHBO.com Equal Housing Opportunity Send Inquiry to Plant Prefab Model Type One Two Three Status One Two Three Create an alert for new models like this Send Message × Send to Your Phone"
    },
    {
      "url": "https://www.sweetwateroaksmhc.com/about/",
      "text": "About Sweetwater Oaks | Manufactured Home Community Ocala FL Toggle Navigation Homes For Sale Directions 352-620-0188 Schedule a Tour Apply For Residency About Us Gallery Amenities Blog Community map Virtual Tour Contact Us Resident Portal Resident Login Directions 352-620-0188 Schedule a Tour Homes For Sale Option-1: Option-2: ABOUT Celebrate Your Leisure Years at Sweetwater Oaks 55+ Retirement Community in Ocala, FL Sweetwater Oaks is a peaceful 55+ manufactured home community, spread across 45 acres with 242 beautifully maintained homes in the heart of Ocala, Marion County, Florida. Whether you’re looking for a tranquil place to relax or an active, social lifestyle, Sweetwater Oaks offers the ideal setting to enjoy your leisure years. We invite you to connect with neighbors and enjoy a wide variety of on-site amenities and social events. Nestled in the natural beauty of Ocala, you’ll be surrounded by nearby state parks and world-class equestrian facilities. Known as the “Horse Capital of the World”, Ocala is home to over 400 thoroughbred training centers and hosts prestigious horse shows throughout the year. Option-1: Option-2: Sweetwater Oaks’ Convenient Location in Ocala, FL Located on 44th Avenue, Sweetwater Oaks provides easy access to US 27, a major east-west route. You’ll find nearby comfort food eateries, major retailers like Publix and Walgreens, and essential services such as banks, all just a short drive away. Sweetwater is a desirable residence located on 44th Avenue which is a frontage road that connects to US 27. It is a major East/West, four-lane thoroughfare that contains many comfort food eateries along with major banks and retailers, including Publix and Walgreens. Option-1: Option-2: Become of Resident of Sweetwater Oaks in Ocala, FL Join our vibrant 55+ community at Sweetwater Oaks, where you’ll enjoy beautifully maintained homes, a range of on-site amenities, and a welcoming environment. Our residents love the peaceful, active lifestyle surrounded by Ocala’s natural beauty and the convenience of nearby shopping, dining, and recreation. Experience the perfect blend of comfort, community, and affordability at Sweetwater Oaks. Manufactured Homes for Sale in Ocala, Florida Explore our selection of manufactured and mobile homes for sale in Ocala, Florida at Sweetwater Oaks. Our homes are designed for comfort and convenience, with various layouts to fit your lifestyle, all within a thriving 55+ community. Browse our current listings to find your perfect home in this peaceful and vibrant setting. Available listings Option-1: Option-2: Contact Sweetwater Oaks in Ocala, FL Got a question, or ready to learn more about joining our community? Contact us today to get in touch with our team! Contact Us Our Address Sweetwater Oaks 3151 NW 44th Ave Lot 1 Ocala,\n                                FL 34482 Get Directions Phone Number 352-620-0188 Email Us sweetwater@legacymhc.com Office Hours: Monday – Friday 9:00am – 4:00pm Saturday: 10:00am – 2:00pm Sunday: By Appointment About Us Homes For Sale Careers Contact Us Resident Portal Facebook Google © 2025\n                        Sweetwater Oaks \n                        | Privacy Policy | ADA Compliance | Website by Big Rig Media LLC ® Please ensure Javascript is enabled for purposes of website accessibility"
    }
  ]
}