{
  "fuentes": [
    {
      "url": "https://www.givemiamiday.org/organization/CGAF",
      "email": "givemiamiday@miamifoundation.org"
    },
    {
      "url": "https://www.givemiamiday.org/organization/CGAF",
      "email": "info@cgaf.com"
    },
    {
      "url": "https://cgaf.com/artists/",
      "email": "festivalartist@cgaf.com"
    },
    {
      "url": "https://www.mhfestival.com/about/contact/",
      "email": "aeaton-lewis@mentalhealth.org.uk"
    },
    {
      "url": "https://www.mhfestival.com/about/contact/",
      "email": "galdam@mentalhealth.org.uk"
    },
    {
      "url": "https://www.mhfestival.com/about/contact/",
      "email": "rdickie@mentalhealth.org.uk"
    },
    {
      "url": "https://www.mhfestival.com/about/contact/",
      "email": "smhaf@mentalhealth.org.uk"
    },
    {
      "url": "https://cgaf.com/faq/",
      "email": "festivalartist@cgaf.com"
    },
    {
      "url": "https://cgaf.com/",
      "email": "festivalartist@cgaf.com"
    },
    {
      "url": "https://new.cgaf.com/artist-faq/",
      "email": "festivalartist@cgaf.com"
    },
    {
      "url": "https://new.cgaf.com/artist-faq/",
      "email": "festivalartist@cgaf.com"
    },
    {
      "url": "https://cgaf.com/coconut-grove-arts-festival-awards-30000-in-scholarships-to-fiu-students-to-foster-careers-in-the-arts/",
      "email": "festivalartist@cgaf.com"
    },
    {
      "url": "https://cgaf.com/coconut-grove-arts-festival-awards-30000-in-scholarships-to-fiu-students-to-foster-careers-in-the-arts/",
      "email": "camille@cgaf.com"
    },
    {
      "url": "https://cgaf.com/the-team/",
      "email": "festivalartist@cgaf.com"
    },
    {
      "url": "https://cgaf.com/the-team/",
      "email": "camille@cgaf.com"
    },
    {
      "url": "https://cgaf.com/contact/",
      "email": "festivalartist@cgaf.com"
    },
    {
      "url": "https://cgaf.com/contact/",
      "email": "festivalartist@cgaf.com"
    },
    {
      "url": "https://cgaf.com/contact/",
      "email": "info@cgaf.com"
    },
    {
      "url": "https://www.wlrn.org/arts-culture/2024-02-16/coconut-grove-arts-festival-celebrates-60th-year",
      "email": "jmarch@wlrn.org"
    },
    {
      "url": "https://www.zapplication.org/event-gallery.php?ID=10372&embed=true",
      "email": "camille@cgaf.com"
    },
    {
      "url": "https://cgaf.com/neighborhood-festivities/",
      "email": "festivalartist@cgaf.com"
    },
    {
      "url": "https://cgaf.com/artist-faq/",
      "email": "festivalartist@cgaf.com"
    },
    {
      "url": "https://cgaf.com/artist-faq/",
      "email": "festivalartist@cgaf.com"
    },
    {
      "url": "https://gmfea.org/event/coconut-grove-arts-festival-2025/",
      "email": "info@festivalsmiami.com"
    },
    {
      "url": "https://new.cgaf.com/experience/",
      "email": "festivalartist@cgaf.com"
    },
    {
      "url": "https://cgaf.com/info/",
      "email": "festivalartist@cgaf.com"
    },
    {
      "url": "https://cgaf.com/info/",
      "email": "info@cgaf.com"
    }
  ],
  "mails": [
    "aeaton-lewis@mentalhealth.org.uk",
    "camille@cgaf.com",
    "festivalartist@cgaf.com",
    "galdam@mentalhealth.org.uk",
    "givemiamiday@miamifoundation.org",
    "info@cgaf.com",
    "info@festivalsmiami.com",
    "jmarch@wlrn.org",
    "rdickie@mentalhealth.org.uk",
    "smhaf@mentalhealth.org.uk"
  ],
  "nombre_sitio": "cgaf.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.givemiamiday.org/organization/CGAF",
      "text": "Coconut Grove Arts Festival | Give Miami Day Search Log in Coconut Grove Arts Festival A nonprofit organization Donate Fundraise Share this organization 0% complete $10,000 Goal About Custom Tab Why should you become a friend of the festival?  You already know that the Coconut Grove Arts Festival brings incredible art to Miami each February.  But what most people don’t realize, it’s also a year-round organization with a mission to support the Greater Miami arts community.  We fund scholarships, we host a robust mentoring program for new and emerging artists, we bring artists into Miami-Dade county schools with our Visiting Artist Program, we donate art supplies to schools in and around Coconut Grove, the list goes on. Visiting Artist Program In 2024, we re-introduced our nationally recognized Visiting Artist Program. Festival artists are invited to local schools to introduce their art practice. More than just bringing art to the schools, we are encouraging students to pursue art as a career. Mixed media renowned artist Ben Frey, the festival’s 2023 poster artist, recently shared a success story about a young woman who recently approached him at a festival. Nine years ago, after attending a class during which Ben shared his mixed media magic, she was so moved and inspired that she became a mixed media artist herself. She is now finishing up her BA. This is precisely why we do this. Last year one artist was so impressed by the students and their need for supplies that she left them with her entire traveling kit of supplies. Scholarships We were also able to earmark funds for up to $75,000 in scholarships for graduating students in the Miami-Dade County school system and students at Florida International University. We plan to continue to strengthen this initiative. But with arts funding dwindling in Florida, we feel it’s more important than ever to continue these projects.  We need the community's help to keep these initiatives alive. Every gift, big or small, helps keep this program alive. Emerging Artist Program In 2023, we completely revamped our Emerging Artist program. Many artists choose outdoor shows like CGAF as their career path because it is a viable, alternative option for earning a living. CGAF’s two-year program gives them the foundation to begin their careers.  While the 12-14 participants are primarily from Miami, the program has drawn attention nationwide with artists from out of state applying as well. During the first year, this next-generation of artists work with a variety of mentors during the show.  They are shown everything from loading a vehicle and setting up a tent to selling their work.  We work with them during the year to hone their portfolios and offer financial advice with the help of FIU finance professors.  The second year, these arts are giving a free booth space to sell their work.  It’s incredibly rewarding to see them succeed. Community Involvement Each year we donate supplies to area summer programs, camps and churches.  We let the organization select the supplies the need the most.   This summer we are hoping to contribute to Grove based summer arts program geared towards middle school students. Inner Artist/Young Collector’s Tent Our Inner Artist area, hosted each year during the festival,  has been revamp as a family friendly art workspace.   We installed easels so families could experience the joy of painting, we added art projects and introduced family entertainment. Our very favorite new addition is our Young Collector’s Tent. CGAF Executive Director, Camille Marchese says, “As much as we need to encourage young artists, we also need to encourage young patrons to appreciate and purchase their art.” Artists generously donate a small piece that children can purchase for $5, the only rule is that the child must be the one to choose the art. In this way, we instill a passion for collecting early on. About the Festival: Founded in 1963 by Charlie Cinnamon as a publicity stunt for the Coconut Grove Playhouse, it quickly became a treasured yearly event. We will celebrate the 61st festival this President’s Day Weekend, February 15-17, 2025. Last year more than 1,000 fine artists from across the nation applied for one of the coveted 285 spaces. Our jury, composed of art professionals, reviewed and scored each applicant. The top 285 were invited to participate  with media ranging from clay, glass, and wood, to painting, photography and digital arts. Mission The mission of the Coconut Grove Arts & Historical Association is a year-round non-profit organization whose mission is to foster culture in all its forms and provide access to a broad and diverse array of arts experiences and activities while enhancing art appreciation, art education and the community at large. Media gallery More Organization Data Summary 0 Programs 0 Summary Organization name Coconut Grove Arts Festival Tax id (EIN) 59-1652630 Address 3390 Mary Street Suite 260 Coconut Grove, FL 33133 Phone 305-447-0401 Email 0 info@cgaf.com Website 0 http://www.coconutgroveartsfest.com Social Media 0 Show more Manage this organization Donate Home Support Terms & Privacy Give Miami Day is brought to you by The Miami Foundation . Powered by Mightycause Copyright © 2025 The Miami Foundation How can we help? Browse help topics Contact Chat"
    },
    {
      "url": "https://cgaf.com/artists/",
      "text": "Artists - Coconut Grove Arts Festival Coconut Grove Arts Festival ARTIST APPLICATIONS NOW OPEN! Facebook Twitter Instagram Apply Today! 0 0 Home For Artists Artist FAQ Application Info Artist 2025 Artists 2025 Award Winners Emerging Artists Info Event Information Blogs FAQ Partners Support Contact Volunteer Shop About Our Story The Team Initiatives 2025 Scholarship Recipients ARTISTS CLAY DIGITAL ARTS DRAWING & PASTEL FIBER GLASS JEWELRY METAL MIXED MEDIA - 2D MIXED MEDIA - 3D PAINTING PHOTOGRAPHY PRINTMAKING SCULPTURE WATERCOLOR WOOD EMERGING ARTIST CLAY Larry Allen Leeds, AL https://larryallenpottery.com Booth Number: 910 Julie Berndt Dawson, MN Booth Number: 513 Barry Bernstein Marquette, MI Booth Number: 417 Ed Brownlee Kalamazoo, MI Booth Number: 209 Zack Callaghan & Lisa Tantillo Atlanta, GA https://www.caloucalay.com Booth Number: 933 Kimmy Cantrell College Park, GA https://kimart.com Booth Number: 104 & 105 Dwo Wen Chen Providence, RI www.threewheelstudio.com Booth Number: 109 Joey Chessey Dayton, OH https://www.Facebook.com/sunrysepottery Booth Number: 238 Rebecca Grant Alton, IL https://rebeccagrantceramics.com Booth Number: 634 Erica Iman Kansas City, MO http://ericaiman.com/ Booth Number: 428 William Kidd St. Petersburg, FL https://williamkiddceramics.net Booth Number: 739 Ethan Lillemoe Eastpointe, MI https://leiretidstudios.com Booth Number: 826 Christine Lush-Rodriguez Fredericksburg, VA www.fruitoid.com Booth Number: 332 & 333 Gail Markiewicz Woodbridge, CT gmceramicart.com Booth Number: 721 Kyle Osvog Jackson, GA https://instagram.com/kyleosvog/ Booth Number: 725 Tim Peters Winter Haven, FL Booth Number: 616 Tom Radca Port Washington, OH https://tomradca.com Booth Number: 920 Kaiser Suidan Ferndale, MI http://nextstepstudio.com / Booth Number: 433 Reiko Uchytil Grimes, IA https://www.helloimreiko.com/ Booth Number: 313 Lisa Zolandz Manassas, VA https://www.lisazolandzpottery.com Booth Number: 836 DIGITAL ARTS Rick Abrams DeLand, FL Booth Number: 515 Tanya Doskova Phoenix, AZ https://www.fineartoncanvas.com/ Booth Number: 924 LJ Eidolon Charleston, SC https://ljeidolon.com Booth Number: 708 & 709 Geoffrey Harris Lexingtonm, SC http://www.GeoffreyAaronHarris.com Booth Number: 325 Lissa Hatcher Lutz, FL https://lissahatcher.com Booth Number: 816 Monika Jones Hollywood, FL http://www.monjones.com Booth Number: 613 Alex Lanier Miami, FL https://www.alexlanierart.com Booth Number: 714 Mark MacKinnon Wappingers Falls, NY https://www.markmackinnon.com Booth Number: 407 & 408 Andrew Mosedale Saint Augustine, FL https://www.andrewmosedale.com Booth Number: 126 Craig Roderick Jasper, AL https://www.bellafioreimages.com/ Booth Number: 518 DRAWING & PASTEL Abdiel Acosta Coral Gables, FL Booth Number: 817 Jeribai Andrew-jaja Fort Worth, TX https://andrewjajaart.com Booth Number: 123 Diane French St. Augustine ,FL https://www.dianefrenchart.com Booth Number: 505, 506 Robin Frisella Candia, NH https://www.robinfrisella.com/ Booth 912 Anne London Mandeville, LA http://aelondonstudio.com Booth Number: 614 Collin Margerum Winter Springs, FL https://www.collinmargerum.com/ Booth Number: 717 Lawrence Packard Winter Haven, FL https://www.packardnauticalart.com Booth Number: 439 Ella Richards New York, NY scissorsdrawings.com Booth Number: 434 jacqueline roch Miami ,FL www.jacquelineroch.com Booth Number: 220 Tai Taeoalii Hannibal, MO https://artbytai.com/ Booth Number: 301 & 302 R. Michael Wommack Langhorne, PA https://rmichaelwommack.com Booth Number: 926 FIBER Amos Amit Los Angeles, CA https://batikbyamit.com Booth Number: 118 Andres Arango Miami, FL Booth Number: 328 Alejandra Avila Dallas, TX https://www.alejaavila.com/ Booth Number: 627 Billie Barthelemy Pinewood, MN birdofparadisedesigns.com Booth Number:837 Kate Beck New Orleans, LA https://www.katebeckneworleans.com Booth Number: 410 & 411 Annie Bisone Milwaukee, WI https://www.LaloWorkshop.com Booth Number: 802 Kristen Faircloth Bogart, GA https://www.bubohandmade.com Booth Number: 913 Betsy Giberson Warner, NH https://www.betsygiberson.com Booth Number: 504 Diane Harty Frisco, CO https://www.dianeharty.com Booth Number: 507 Kiersten Heitmann Naples, FL http://www.KierstenFIBERART.com Booth Number: 608 & 609 Selma Karaca Beacon, NY http://www.selmakaraca.com/ Booth Number: 720 Heather Laurie Denver, CO www.heatherlaurie.com Booth Number: 314 Susan Otterson Madison, WI https://www.susanotterson.com Booth Number: 935 Bounkhong Signavong Secaucus, NJ http://www.laodesignonline.com Booth Number: 517 Michael Smith Asheville, NC https://www.manifestcolor.com Booth Number: 925 Shani Solomon Henderson, NV http://www.scarlettsilkskirts.com/ Booth Number: 820 Sharon Tesser Cape Coral, FL https://www.sharontesser.com Booth Number: 501 & 502 GLASS Tom Bloyd Stilwell, KS https://www.bloydartglass.com Booth Number: 834 Tony Cray New Melle, MO https://www.tonycray.com Booth Number: 401 John Denis Miami Beach, FL https://www.johnjosephdenis.com Booth Number: 906 & 907 Angelo Fico & Karen Naylor Wilmot, WI https://www.angelofico.com Booth Number: 932 Jeremy Griffith & Chelsea Griffith Murphysboro, IL delishglass.com Booth Number: 730 & 731 Scott Hartley Benton, KS www.infinityartglass.com Booth Number: 124 & 125 Michael Hayes Spruce Pine, NC https://michaelhayesglass.com Booth Number: 740 Robin Kittleson Geneva, IL https://robinkittleson.com Booth Number: 303 Mark lewanski Portland, MI www.glassweavers.com Booth Number: 713 Andrew Madvin Royal Oak, MI https://www.axiomglass.com Booth Number: 624 & 625 Steve Palmer Minnetonka, MN https://starglassworksdesign.com/ Booth Number: 706 Wesley Rasko Naples, FL https://www.wnrglass.com/pages/index.jsp Booth Number: 411 & 412 Richard Ryan Bourbonnais, IL https://www.vmglassart.com Booth Number: 723 Thomas Spake Jasper, TN https://www.thomasspakestudios.com Booth Number: 222 Nicholas Stelter Kaukauna, WI stelterglass.com Booth Number: 511 James Wilbat Deerfield, IL www.wilbatglass.com Booth Number: 234 JEWELRY Chelsea Bird Pawtucket, RI www.ChelseaEBird.com Booth Number: 823 Spirit & Samuel Bush Woodstock, GA https://spiritlala.com Booth Number: 921 Ann Marie Cianciolo Milwaukee, WI annsjewelry.com Booth Number: 231 KIM COY Casselberry, FL https://www.nicolewayne.com/ Booth Number: 329 Wendy  and Joe Edwards Waynesville, NC https://wendykaydesigns.com Booth Number: 218 Susan Elnora Santa Fe, NM https://susanelnora.com Booth Number: 427 Kate Rothra Fleming Charleston, SC https://www.katerothrafleming.com/ Booth Number: 936 Pam Fox Sarasota, FL pamfoxjewelry.com Booth Number: 321 Leigh Griffin New Smyrna Beach, FL https://leighgriffinjewelry.com Booth Number: 336 Oliver Hampel Naples, FL https://oliverjewelry.com Booth Number: 306 & 307 Melissa Hampton Saint Louis, MO https://www.ascendantjewelry.com Booth Number: 243 Sharon Johnston Dallas, TX www.sharonjohnstonjeweler.com Booth Number: 733 Jacob Keleher Chicago, IL Booth Number: 523 Karen Klinefelter Boise, ID https://www.klinefelterstudio.com / Booth 832 Cecilia Labora Kansas City, MO https://www.clabora.com Booth Number: 719 Mindy Lind-Terk Pembroke Pines, FL Booth Number: 916 Sandra Matasick Gainesville, FL https://www.matasick.com/ Booth Number: 623 Joan Michlin & Skip Ennis Sarasota, FL https://joanmichlin.com Booth Number: 903 & 904 Dawn Middleton Greenville, IN https://www.dawnmiddleton.com Booth Number: 628 Matthew Naftzger Pittsburgh, PA https://www.matthew.works / Booth 803 Christian Nevin Orlando, FL http://www.cndesigns.com Booth Number: 705 Melissa Schmidt St. Louis, MO www.melissaschmidt.etsy.com Booth Number: 436 Toni Tischer Salida, CO https://tischerstudios.com Booth Number: 510 Michael & nurit Vagner North Port, FL https://nurit-and-mick-arts-inc.square.site/ Booth Number: 113 METAL Juan Giron Weston, FL https://www.juangiron.com Booth Number: 606 Cherie Haney Ann Arbor, MI https://www.artandelement.com Booth Number: 422 & 423 Royal Miree Birmingham, AL http://royalmiree.com/ Booth Number: 715 & 716 Matthew Naftzger Pittsburgh, PA https://www.matthew.works Booth Number: 803 Luke Proctor Mt. Horeb, WI www.lproctorironworks.com Booth Number: 440 & 441 Nicholas Ricaurte Lawrenceburg, TN Booth Number: 901 & 902 Wendy Stevens Boyertown, PA https://wendystevens.com Booth Number: 718 David Vigo Pensacola, FL https://Www.davidvigofineart.com Booth Number: 406 Carl Zachmann Fergus Falls, MN www.carlzachmann.com Booth Number: 938 Jeffrey Zachmann Fergus Falls, MN www.Zachmann.com Booth Number: 201 MIXED MEDIA - 2D Kathrine Allen Jackson, GA https://www.kathrineallencoleman.com/shop Booth Number: 724 William Armstrong Santa Fe, NM https://www.willarmstrongart.com Booth Number: 425 & 426 Sally Austin Carrollton, GA http://sallyaustinartist.com Booth Number: 305 Joseph Bradley Greenville, SC www.josephbradleystudio.com Booth Number: 508 & 509 Elissa Brown Grandview, MO http://www.thefreckledarmy.com/p/mina-page.html Booth Number: 819 Gaston Carrio Miami Beach, FL https://www.artbyarchitect.com Booth Number: 402 Carolina Cleere St Petersburg, FL www.carolinacleere.com Booth Number: 915 Sarah Collier Wilmington, NC https://thecharmschooldropout.com Booth Number: 939 Daphne Covington Smyrna, GA www.daphnecovington.com Booth Number: 414 Erin Curry Dallas, TX Booth Number: 825 Michel Delgado Chicago, IL https://www.micheldelgado.com Booth Number: 107 Ummarid Eitharong DeLand, FL Booth Number: 521 & 522 Janina Ellis Greenville, SC http://www.janinaellis.com Booth Number: 638 Leslie Emery Winthrop Harbor, IL https://leslieemery.com Booth Number: 311 Jana Epstein Atlanta, GA www.janaepstein.com Booth Number: 807 Kim Eubank Madrid, NM https://www.kimeubank.com Booth Number: 337 Benjamin Frey Buena Vista, VA https://www.benjaminfrey.com Booth Number: 527 Jonah Green Madrid, NM https://www.jonahgreenart.com/ Booth Number: 338 & 339 Debo Groover Tallahassee, FL https://ww.debortinastudio.com Booth Number: 430 Kana Handel Gainesville, FL https://www.kanasarts.com Booth Number: 617 Jenny Henley Marietta, GA www.henleystudios.com Booth Number: 812 & 813 tanya kirouac McHenry, IL https://tanyakirouac.com Booth Number: 240 Jennifer Lashbrook Dallas, TX http://www.jenniferlashbrook.com Booth Number: 944 & 945 Margaret Luttrell Knoxville, TN http://www.margeluttrell.com Booth Number: 909 Robert Matthews Des Moines, IA https://www.hiddenspringdesigns.com Booth Number: 235 Mark MOHRENWEISER Brighton, MI https://www.beyondletters.com/ Booth Number: 432 Christine Adele Moore Bonita Springs, FL https://ChristineAdeleArts.com Booth Number: 119 & 120 Amanda Outcalt Washington, DC https://www.amandaoutcalt.com Booth Number: 804 Jean Rim Miami, NY https://www.jeanrim.com Booth Number: 737 Susan Roche Point Pleasant, NJ https://www.susanjroche.com Booth Number: 712 Lyn Sedlak-Ford Portland, OR https://www.Sedlak-Ford.com Booth Number: 232 & 233 MIXED MEDIA -  3D Myra Burg & liz Cummings Santa Monica, CA www.myraburg.com Booth Number: 728 & 729 Athlone Clarke Douglasville, GA https://athloneclarke.com/ Booth Number: 923 Chris Cumbie Mobile, AL https://www.ChrisCumbieArt.com Booth Number: 106 Todd K Fox Orlando, FL https://www.toddkfox.com Booth Number: 210 Alex Grimmer Dallas, TX https://deawaxart.com/ Booth Number: 619 & 620 Jeffrey Kennedy Ormond Beach, FL https://jeffreykennedyart.com Booth Number: 824 Trent Manning Winter Haven, FL https://www.trentmanningstudio.com Booth Number: 829 Kipley Meyer Clarkston, GA https://www.kipleyameyer.com Booth Number: 811 Annette Silkwood Saint Charles, MO http://silkwoodatmospheres.art Booth Number: 524 Bob Stern Moreland Hills, OH https://www.theperfectview.com/ Booth Number: 707 Michael & Joah Thiele Flagstaff, AZ www.hardwoodmusiccompany.com Booth Number: 519 & 520 Lara Venema Chicago, IL https://www.laravenema.com/ Booth Number: 622 Kimberly Willcox Gainesville, FL http://www.kimberlywillcox.com Booth Number: 315 PAINTING Rick Abrams DeLand, FL Booth Number: 515 Linda Apriletti Miami Springs, FL https://lindaapriletti.com Booth Number: 316 Gustavo Castillo Port Saint Lucie, FL Booth Number: 229 John Blackwell Denver, CO Booth Number: 403 & 404 Kate Carney Orlando, FL https://katecarneyfineart.com Booth Number: 211 Gaston Carrio Miami Beach, FL https://www.artbyarchitect.com/ Booth Number: 402 Amy Leigh Carstensen Tampa, FL www.amyleighcarstensen.com Booth Number: 413 George Ceffalio Gallatin, TN https://www.ceffalio.com Booth Number: 605 Soo Chang Darien, IL https://www.schangfineart.com/ Booth Number: 738 Rosa Chavez Naples, FL rosachavezartwork.com Booth Number: 632 & 633 Tony Chimento Pompano Beach, FL https://www.chimentostudio.com Booth Number: 629 Rey D'Alfonso Greenville, SC https://reyalfonsostudio.com Booth Number: 247 & 248 Rachel Dory Austin, TX https://racheldory.com Booth Number: 703 & 704 Ummarid Eitharong Deland, FL Booth Number: 521 Janina Ellis Greenville, SC http://www.janinaellis.com/ Booth Number: 638 Leslie Emery Winthrop Harbor, https://leslieemery.com Booth Number: 311 Annie Flynn Wildwood, MO www.annieflynn.com Booth Number: 431 Julia Gilmore Jefferson, NH http://www.juliagilmore.ca Booth Number: 237 Jonah Green Madrid, NM https://www.jonahgreenart.com Booth Number: 338 & 339 Signe & Genna Grushovenko Greenville, SC https://www.grushovenko.com Booth Number: 100 Harut Hakobyan Granada Hills, CA https://Harutstudio.com Booth Number: 726 & 727 Ali Hasmut Park Ridge, IL https://www.alihasmut.com Booth Number: 911 Erica Iman Kansas City, MO http://ericaiman.com Booth Number: 428 Martin Karadzhov Pompano Beach, FL www.instagram.com/martin.karadzhov.77 Booth Number: 610 Sooro Kim Lawrenceville, GA https://surokart.com Booth Number: 442 Tanya Kirouac McHenry, IL https://tanyakirouac.com/ Booth Number: 240 Barbara Krupp Vero Beach, FL Booth Number: 244 Carmen Lagos Port Saint Lucie, FL Booth Number: 230 Edwin Lester Newark, DE artistedwinlester.com Booth Number: 110 Karina Llergo Northbrook, IL https://karinallergoart.com Booth Number: 223 & 224 Anne London Mandeville, LA aelondonstudio.com Booth Number: 615 michelle mardis Tarpon Springs, FL www.michellemardis.com Booth Number: 905 & 906 Corinne Migraine Le Havre, Normandie https://www.corinne-migraine.art/en Booth Number: 635 Brian Murphy Newport News, VA www.bmurphy.net Booth Number: 937 David oleski West Chester, PA http://www.davidoleski.com Booth Number: 207 & 208 Scott Olson Williams Bay, WI https://scottolsonfineart.com Booth Number: 611 Ken Orton Venice, FL https://www.kenorton.com Booth Number: 626 Steven Penafiel West Palm Beach, FL https://stevenpenafielfineart.net Booth Number: 941 Antwan Ramar Orlando, FL https://www.antwanramar.com Booth Number: 801 Hernan Rodriguez Homestead, FL https://hernanart.com Booth Number: 917 Carol Ryan Chicago, IL https://carolryanfineart.com Booth Number: 810 Sharon Spillar Kansas City, MO https://www.spillarstudios.com Booth Number: 927 & 928 Lou Ann Townsend Albuquerque, NM https://www.louanntownsend.com Booth Number: 227 Hua Tung Waltham, MA https://tungart.com Booth Number: 103 Danilo Vinardell & Igris Morales Miami, FL https://www.vinardell.art Booth Number: 934 Tyler Wagner Downers Grove, IL https://wagsart.us Booth Number: 203 Chloe Wang Jericho, NY https://Chloefineart.com Booth Number: 304 Li Wang Palm Coast, FL Booth Number: 217 R. Michael Wommack Langhorne, PA https://rmichaelwommack.com / Booth Number: 926 Karen Watson-Newlin Verona, WI http://www.karenwatsonnewlin.com/ Booth Number: 621 David Yuan Virginia Beach, VA Booth Number: 324 Yu Zhou & Yan Ma Winter Garden, FL http://www.zhouyufinearts.com Booth Number: 943 Jie Zhou Kingwood, TX https://Jiezhoufineart.com Booth Number: 831 PHOTOGRAPHY Richard Auger Jupiter, FL http://www.richardauger.com/ Booth Number: 334 Michael Behr Minneapolis, MN www.mikebehrphotography.com Booth Number: 330 & 331 H. Allen Benowitz Miami, FL https://www.H-AllenArt.com Booth Number: 612 Gerome Bonner Parker, TX http://www.bonnerfineart.com Booth Number: 929 & 930 Michael Chen New York, NY https://www.michaelchenphotography.com Booth Number: 320 Micheal Paul Cole Hannibal, MO https://hwww.michealpaulcole.com/ Booth Number: 219 James Cole Plainfield, IL www.jamesmcarthurcole.com Booth Number: 121 & 122 John Galbo Saginaw, MI https://www.impressionistic.com Booth Number: 228 Chris Gug Lauderdale by the Sea, FL https://www.GugUnderwater.com Booth Number: 437 & 438 Clifton Henri Chicago, IL https://www.cliftonhenri.com Booth Number: 308 & 309 Joe Hiltabidel Travelers Rest, SC https://www.hiltabidel.com Booth Number: 420 Cali Hobgood Urbana, IL https://www.photographsbycali.com Booth Number: 435 Jesper Johansen Denver, CO WWW.TINYPEOPLEBIGLAUGHS.COM Booth Number: 833 Lisa Kristine Sonoma, CA https://lisakristine.com Booth Number: 415 & 416 Angela Kullmann & Russell Grace Harvard, IL https://www.BestLightCollection.com Booth Number: 225 Ken Laffal Saint Augustine, FL Booth Number: 525 Nancy Ney Miami, FL https://www.nancyney.com Booth Number: 815 Xavier Nuez Chicago, IL https://www.nuez.com Booth Number: 212 & 213 Christos Palios Baltimore, MD https://www.christospalios.com Booth Number: 512 Evan Reinheimer Boca Raton, FL www.evanreinheimer.com Booth Number: 205 & 206C Steve Riley La Veta, CO https://steverileyeditions.com Booth Number: 603 Ernesto Rodriguez Miami, FL https://www.rocofoto.com Booth Number: 112 John Scanlan Glenwood, IA https://www.scanlan.com Booth Number: 630 & 631 Andrew Sovjani Conway, MA www.andrewsovjani.com Booth Number: 405 Kyle Spears Bloomington, IN www.kylespears.com Booth Number: 732 Allan Teger Vero Beach, FL www.bodyscapes.com Booth Number: 245 & 246 Jason Weiss Fort Collins, CO https://www.jasonweissphotography.com/ Booth Number: 101 & 102 Paige Whitcomb Springfield, MO https://www.paigewhitcomb.com Booth Number: 701 PRINTMAKING John Costin Tampa, FL www.costingraphics.com Booth Number: 822 Helen Gotlib Dexter, MI www.helengotlib.com Booth Number: 418 & 419 James Hilton Miami, FL https://www.22ndofnever.com Booth Number: 931 Layla Messkoub New Orleans, LA www.laylamesskoub.com Booth Number: 514 Allison & Jonathan Metzger Des Moines, IA www.midnightoilstudioworkshop.com Booth Number: 322 & 323 Michael Nemnich Indialantic, FL https://nemnichart.com/ Booth Number: 526 Leslie Peebles Gainesville, FL www.lesliepeebles.com Booth Number: 828 SCULPTURE Nobe Babayan Tujunga, CA www.nobeart.com Booth Number: 116 & 117 Todd Babb Ft. Myers, FL www.toddandrewbabb.com Booth Number: 942 Domenico Belli Sarasota, FL https://www.domenicobelli.com Booth Number: Garden 3 lori betz Porter, TX https://www.betzartfoundry.com Booth Number: 636 & 637 Kimber Fiebiger Minneapolis, MN https://www.ArtbyKimber.com Booth Number: Garden 1 Michael Gard San Francisco, CA https://www.michaelgard.com Booth Number: 114 & 115 Will Grant Bradenton, FL Booth Number: Garden 4 boris kramer Harrisburg, PA kramersculptures.com Booth Number: 710 & 711 Ryan Kvande Thornton, CO www.spunwheel.com Booth Number: 516 James LaCasse Denver, CO https://www.lacassestudios.com Booth Number: 814 Steven Olszewski Pinckney, MI Booth Number: 310 Dakota Pratt San Diego, CA Booth Number: 914 Ed Pribyl McHenry, IL https://www.edpribyl.com Booth Number: 242 Sabra Richards Aurora, NY sabrarichardsglass.com Booth Number: 601 & 602 lorena ricaurte Bradenton, FL Booth Number: 604 Marlene Rose Clearwater, FL https://www.MarleneRose.com Booth Number: 805 & 806 Bonnie Shanas Cherry Hill, NJ http://www.BonnieShanasArt.com Booth Number: 326 & 327 Lewis Tardy Mattawan, MI www.tardysculpture.com Booth Number: 216 Seth Vandable Cedar Hill, TX www.VandableSculpture.com Booth Number: 827 Mark Wallis Spencer, IN www.mawstudio.com Booth Number: Garden 2 Thomas Wargin Menomonee Falls, WI https://www.wargin.com Booth Number: 735 & 736 Mick Whitcomb Springfield, MO https://www.artifactsbynomad.com Booth Number: 702 WATERCOLOR Jennifer Ardolino Homosassa, FL http://www.jaart.com Booth Number: 808 & 809 Gustavo Castillo Port Saint Lucie, FL Booth Number: 229 Farhana Hemming Buchanan, VA Booth Number: 239 Carmen Lagos Port Saint Lucie, FL Booth Number: 230 Robbie Lee Orlando, FL https://www.robbielee-illustrator.com Booth Number: 202 Gwendolyn Redfern Raleigh, NC https://gwendolynEredfernartist.com Booth Number: 111 Michael Williams Fort Lauderdale, FL https://MichaelWilliamsArtist.com Booth Number: 734 Bryan Yung Palm Coast, FL http://bryanyung.com / Booth Number: 919 WOOD Nicholas Barnes Woolwine, VA Booth Number: 818 David Bergeron Thibodaux, LA https://bergeronwoodworks.net Booth Number: 940 Magali Cereghino-Groves Orlando, FL https://magaligroves.com Booth Number: 618 Alan Davis Tequesta, FL https://Nativevessels.com Booth Number: 108 Larry Fox Omena, MI https://www.lfoxstudio.com/ Booth Number: 424 Luis Gonzalez Miami, FL www.mamaluwood.com Booth Number: 317 & 318 Matthew Hatala Danielsville, GA Booth Number: 335 C.G. Woody Jones Decatur, GA Booth Number: 221 Bill Lepak St Louis, MO Booth Number: 830 Clifford Lounsbury Tawas City, MI www.riverturnings.com Booth Number: 918 Jay McDougall Otter Tail County, MN https://www.jaymcdougall.com Booth Number: 214 Thomas Tyers Omro, WI tltcarving.com Booth Number: 607 Steve Uren Grand Rapids, MI www.steveuren.com Booth Number: 503 Emerging artists Christina\tBernadotte Hollywood, FL Annabella\tCamise Princeton, FL https://annabellatheartist.com Stephan\tCelestin Lauderdale Lakes, FL https://nahpetsart.myportfolio.com/ Shareen\tDookie Cutler Bay, FL sarah\tFerrer Miami lakes, FL Samantha Ferrer hialeah, FL Sureily\tMarestein Florida, FL https://instagram.com/suki_the_artist Miriam\tRovirosa Miami, FL https://www.miriamrovirosa.com Zion\tRozier Homestead, FL https://Zionrozier.com Lauren\tWalker Miami, FL https://lawalker.myportfolio.com CGAF Details The 62nd Annual Coconut Grove Arts Festival takes place Presidents Day Weekend, February 14∙15∙16, 2026 Sat, Feb 14: 10AM – 6PM Sun, Feb 15: 10AM – 6PM Mon, Feb 16: 10AM – 5PM About CGAF The Coconut Grove Arts Festival® is presented by the nonprofit, 501(c)(3), Coconut Grove Arts and Historical Association. Proceeds help fund year-round arts programs. Facebook Instagram Twitter #CGAF2025 Contact CGAF 3390 Mary Street Suite 260 Coconut Grove, FL 33133 ARTIST INQUIRIES FestivalArtist@CGAF.com Phone: 305-447-0401 PRODUCED BY SUBSCRIBE TO OUR NEWSLETER Email Send © COCONUT GROVE ARTS And Historical Association INC.  ALL RIGHTS RESERVED | CGAF.com"
    },
    {
      "url": "https://www.mhfestival.com/about/contact/",
      "text": "Contact Us | Scottish Mental Health Arts Festival Skip to content Scottish Mental Health Arts Festival Home Events Explore News Get Involved About Join Newsletter About > Contact Us For general enquiries, please email us at smhaf@mentalhealth.org.uk or use the contact form below. Alternatively, if you know who you would like to contact, you can get in touch with the festival team using the contact details on this page. Arts and Events Manager Gail Aldam galdam@mentalhealth.org.uk 0141 226 9845 Arts and Festival Officer Rob Dickie rdickie@mentalhealth.org.uk 0141 226 9857 Arts Programme Officer Andrew Eaton-Lewis aeaton-lewis@mentalhealth.org.uk Contact Us Name (Required) First Last Email (Required) Enter Email Confirm Email Your Message (Required) Δ Events Explore News Get Involved About Contact Join Newsletter Scottish Mental Health Arts Festival © 2025 All rights reserved. Website by Pooka & Co Ltd. Cookie Policy (UK) Privacy Policy Terms of use Manage Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent"
    },
    {
      "url": "https://cgaf.com/faq/",
      "text": "Faq - Coconut Grove Arts Festival Coconut Grove Arts Festival ARTIST APPLICATIONS NOW OPEN! Facebook Twitter Instagram Apply Today! 0 0 Home For Artists Artist FAQ Application Info Artist 2025 Artists 2025 Award Winners Emerging Artists Info Event Information Blogs FAQ Partners Support Contact Volunteer Shop About Our Story The Team Initiatives 2025 Scholarship Recipients Faq FREQUENTLY ASKED QUESTIONS General Where is the Coconut Grove Arts Festival located? The Festival is located just south of downtown Miami, adjacent to beautiful Biscayne Bay. It runs along the streets of McFarlane Road, South Bayshore Drive and Pan American Drive. The address is 2700 S. Bayshore Drive, Miami FL 33133 What are the times of operation? The festival runs on Presidents Day Weekend from Saturday to Sunday from 10am to 6pm, and Monday from 10am to 5pm What items are allowed/not allowed? o Bag Policy – All bags 12×12 and smaller are allowed. o NO Bags larger than 12×12. o NO Weapons of any kind. o NO Illegal substances or drug paraphernalia. o NO Outside food, liquor, or beverages of any kind. * Exception: Food allergies with a Doctor’s note or Religious reasons. o NO Glass bottles, glass containers or cans of any kind. o NO Pro Cameras (defined as multiple detachable lenses), selfie sticks, go pros, or drones. o NO Fireworks or explosives of any kind. o NO Animals of any kind. * Exception: Services animal with proper vest for Identification o NO Large signs or placards or any kind o NO Sharpies, markers, or spray paint o NO Tents, large umbrellas, or shade structures of any kind o NO Bicycles, In–line skates, roller skates, skateboard, scooters or one-wheels o NO Grills or cooking devices of any kind o NO Wagons of any kind. *Exception: Being used as a stroller with a child o NO Personal Chairs, camping chairs, folding chairs, or chairs of any kind o NO Motorized vehicles Are we accepting any food vendors? Please stay tuned for food vendor information for our 2026 festival! CGAF does not accept craft vendors as this is a juried outdoor art festival.  Please see our “ Artist FAQ ” for more information. Can you bring your pets? NO Animals of any kind. * Exception: Services animal with proper vest for Identification How can I apply to become an artist? Artist applications are now open.  Please CLICK HERE to apply! CGAF Details The 62nd Annual Coconut Grove Arts Festival takes place Presidents Day Weekend, February 14∙15∙16, 2026 Sat, Feb 14: 10AM – 6PM Sun, Feb 15: 10AM – 6PM Mon, Feb 16: 10AM – 5PM About CGAF The Coconut Grove Arts Festival® is presented by the nonprofit, 501(c)(3), Coconut Grove Arts and Historical Association. Proceeds help fund year-round arts programs. Facebook Instagram Twitter #CGAF2025 Contact CGAF 3390 Mary Street Suite 260 Coconut Grove, FL 33133 ARTIST INQUIRIES FestivalArtist@CGAF.com Phone: 305-447-0401 PRODUCED BY SUBSCRIBE TO OUR NEWSLETER Email Send © COCONUT GROVE ARTS And Historical Association INC.  ALL RIGHTS RESERVED | CGAF.com"
    },
    {
      "url": "https://cgaf.com/",
      "text": "Home - Coconut Grove Arts Festival Coconut Grove Arts Festival ARTIST APPLICATIONS NOW OPEN! Facebook Twitter Instagram Apply Today! 0 0 Home For Artists Artist FAQ Application Info Artist 2025 Artists 2025 Award Winners Emerging Artists Info Event Information Blogs FAQ Partners Support Contact Volunteer Shop About Our Story The Team Initiatives 2025 Scholarship Recipients Years 0 Artists 0 + Mediums 0 A Heartfelt Thank You from the Coconut Grove Arts Festival To our incredible community, patrons, sponsors, and the thousands of festival attendees who joined us – thank you for making the 61st Annual Coconut Grove Arts Festival an unforgettable celebration of art, culture, and creativity. A special appreciation goes to our dedicated volunteers, and to Chairman David Hill, Jr., and the entire Board of Directors for their unwavering support. And to Executive Director Camille Marchese, whose behind-the-scenes leadership brought together hundreds of talented artists and orchestrated an event that exceeded all expectations – your passion and dedication made this festival truly extraordinary. Most of all, to the artists who shared their vision and creativity with us, you are the heart and soul of this festival. Thank you for making this year’s CGAF a resounding success! We can’t wait to welcome you back next year. press play below to catch our 2025 EveNt Recap video! THANK YOU TO OUR 2025 SPONSORS FESTIVAL SPONSORS IN-KIND SPONSORS MEDIA SPONSORS CGAF Details The 62nd Annual Coconut Grove Arts Festival takes place Presidents Day Weekend, February 14∙15∙16, 2026 Sat, Feb 14: 10AM – 6PM Sun, Feb 15: 10AM – 6PM Mon, Feb 16: 10AM – 5PM About CGAF The Coconut Grove Arts Festival® is presented by the nonprofit, 501(c)(3), Coconut Grove Arts and Historical Association. Proceeds help fund year-round arts programs. Facebook Instagram Twitter #CGAF2025 Contact CGAF 3390 Mary Street Suite 260 Coconut Grove, FL 33133 ARTIST INQUIRIES FestivalArtist@CGAF.com Phone: 305-447-0401 PRODUCED BY SUBSCRIBE TO OUR NEWSLETER Email Send © COCONUT GROVE ARTS And Historical Association INC.  ALL RIGHTS RESERVED | CGAF.com"
    },
    {
      "url": "https://new.cgaf.com/artist-faq/",
      "text": "Artist faq - Coconut Grove Arts Festival 60Th Coconut Grove Arts Festival 60Th FEB 17 • 18 • 19 - Early Bird Tickets on Sale Now! Facebook Twitter Instagram Buy Tickets Home About Our Story The Team Initiatives 2023 SCHOLARSHIP RECIPIENTS Artist 2023 Artist Award Winners Emergin Artist Experience 2023 Experience 2023 Event Programming Info Partners Support Volunteer Contact For Artists Application Info Artist FAQ 2024 Artist Map Shop FREQUENTLY ASKED QUESTIONS ARTIST FAQ’s Most frequent questions and answers Where can I apply? Applications for 2024 are currently CLOSED What does it cost to apply? General Application Fee: $40. The application fee for 2023 Coconut Grove Arts Festival Award Winners is waived. Please contact FestivalArtist@cgaf.com via email to receive the code. When is the deadline to apply? Midnight Friday, September 15, 2023. When does blind jurying take place? September 18 through September 22, 2023 When are artists notified of the jury results? Wednesday, October 18, 2023 at noon EDT (subject to change with advance notification). Artists notified via e-mail of jurying results. Once I am accepted, when are booth fees due? The deadline to pay booth fee and accept the invitation to participate is Wednesday, November 18, 2023. What if I have an emergency and can't make it to the festival? Last day to cancel and receive a full refund of the booth fee is Thursday, November 30, 2023 (less $80 processing fee). Last day to cancel with a 50% refund of booth fee is Friday, December 31, 2023. After this date, no refunds will be processed. What are the dates and times of load-in? Friday, February 16, 2024. Artist check-in and set-up begins AFTER 12:00PM. What are some important details I should know? It is critical that each accepted artist and waitlist artist maintains an accurate and up-to-date artist profile in ZAPP through February 2024, especially telephone, email, website, and postal mail. In addition, it is important to check your email often as all acceptances and pertinent Festival information will be communicated electronically. Can I apply in multiple categories? Each exhibiting artist must complete an online application with only one artist per entry unless you are entering as collaborating artists. A separate online application must be completed for each medium in which you would like to apply. Each application requires a jury fee and its own set of images. If an artist wishes to apply in more than one category a separate application form, jury fee, and set of images must be submitted for each category. Artists may apply in up to 3 categories, but only two entries can be accepted into the show. Artists may not apply twice in the same category. May I apply with collaborating artist? Collaborating artists is defined as a group of two (2) artists that work together on any one piece of art. If two artists collaborate, it is regarded as one joint entry. If accepted, only finished work that is the result of the collaborative process may be displayed and sold. Both artists are required to sign in and present photo identification prior to setting up. Both artists must be present during the Festival hours in the booth during the entire three-day festival. Assistants, employees, office, or other support staff are NOT considered to be collaborators. If an artist has a helper who assists the artists with frames, setup, selling, paperwork, etc., but is not producing the work, this person is not a collaborator, but may certainly assist at the Festival. What kind of images should I use to apply? Five (5) images are to be submitted for each individual media category entered by the artist. Four (4) images of individual work and a booth shot which is mandatory. The purpose of the booth shot is to ensure that the artist has a complete body of professional work. It also helps to identify the scale of the work. If a booth shot is not available, an image of a grouping of the artist’s work will be acceptable. NOTE: This is a blind jury process; please avoid submitting booth images with any identifiable sign, or photo of the artist themselves. How does jurying work? The Coconut Grove Arts Festival selects 285 artists to participate through a blind jurying process. A jury panel of five independent judges consisting of the finest museum curators, gallery owners, professional artists, and art educators will gather on two separate days; Two-dimensional artwork is juried on the first day and three-dimensional artwork on the second. The jury process will take place in person in Coconut Grove and is open to the public. Decisions of the jury are based solely on the quality of the artwork. If the jury requests, Artist statements are read. All Jury scores are final. Recent history shows that approximately 1/3 of our artists each year are exhibiting for the first time. What if i don't get accepted, is there a waitlist? A waitlist will be developed based on jury scores. Artists will be selected to be on the waitlist in each of the 13 categories. Artists on the waitlist are notified via Zapplication and email of their acceptance. Waitlisted artists will be contacted should there be a cancellation in their medium. We cannot predict when or if this will happen. There is no need to contact us. What are the accepted categories? Claywork, Digital Arts, Drawing & Pastels, Emerging Artist, Fiber, Glass, Jewelry, Metal, Mixed Media – 2-Dimensional, Mixed Media – 3-Dimensional, Painting, Photography, Printmaking, Sculpture, Watercolor & Wood. Once I am accepted, what are the fees I should Expect? Standard Booth (10’X11′): $850 (Includes 7% FL Sales Tax) ● Double Booth (10’x22′): $1,700 (Includes 7% FL Sales Tax) ● Corner Booth Upgrade (10’x11′): $350 (Includes 7% FL Sales Tax) ● Corner Booth Mid-row Upgrade: $250 (Includes 7% FL Sales Tax) ● Sculpture Garden (10’x22) $1600, (Includes 7% FL Sales Tax – Note: The sculpture garden does not allow for a tent, so work must be able to withstand all natural conditions. ) ● Jury fees are submitted via Zapp and are non-refundable ● Booth fees are payable upon your invitation to participate in the festival.  Please do not send booth fees until notification of your selection. Booth fees are payable through zapplication.com. What are some amenties for artists? The Coconut Grove Arts Festival wants to ensure that your participation is a positive experience. During the Festival, the following amenities are offered to all artists: ● Artist Hospitality Area, centrally located ● Artists’ Only restroom trailer ● Breakfast/lunch provided, as well as coffee in the morning and cold water throughout the day ● Artist Gallery and contact information on the CGAF website through the event ● Individualized Discount Code to send to your collectors for the opportunity to purchase Festival tickets ahead of time and for a discounted rate ● 24-hour security ● Booth sitting staffed by volunteers on call. ● Extensive media promotions throughout South Florida leading up to and during the Festival. Any other rules I should be aware of? Artists MUST be present all three days of the Festival. No commercial dealers or agents are permitted to represent the artist. The Festival reserves the right to close down or remove any booth if the artist is not in attendance. ● If accepted, an artist may not exhibit in other Festivals during The Coconut Grove Arts Festival. ● All artists are required to check-in at the Artist Check-In any time after 12 pm Friday the 16th. Photo ID is required. ● Artists may NOT set up their booth before 12:00 pm on Friday, February 16, 2024. ● All work must be the artist’s original work, no representations, and all artwork must be available for sale ● Artists may exhibit artwork only in the category in which accepted. ● No artwork from molds, kits or other commercial methods is allowed. Ready-made objects (i.e., clothing furniture) which have been embellished, painted, decorated, dyed, or batiked will not be accepted. ● No offset reproductions of paintings, drawings, prints, photographs, or any other media may be exhibited or sold (including hand-colored offset reproductions). ● All two-dimensional work must be framed, matted, or stretched. ● All photography must be printed by the artist or under the artist’s supervision in limited editions no greater than 250 including all sizes, properly signed and numbered on archival materials. ● Photographers and Digital Artists may only sell signed and numbered works of limited editions of 250 or less. ● No posters, postcards, t-shirts, or personal merchandise can be sold at the Festival. ● Artists who break down displays or depart before closing time on any day of the Festival will not be allowed to return the following day and may not be invited to future festivals unless proof of an emergency is presented. ● Artists who sell their entire body of work must remain with their booths for the duration of the show. ● Artists are responsible for collecting and paying the State of Florida seven percent sales tax. No commission on sales will be paid to the Coconut Grove Arts Festival. ● All fees, application and booth fees, must be paid in full two (2) weeks prior to the registration date. ● Any breach of the rules forfeits all rights of the artist and will result in immediate removal from the show without a refund. CGAF Details The 60th Annual Coconut Grove Arts Festival Opens February 17·18·19, 2024 About CGAF The Coconut Grove Arts Festival® is presented by the nonprofit, 501(c)(3), Coconut Grove Arts and Historical Association. Proceeds help fund year-round arts programs. Facebook Instagram Twitter #CGAF2024 Contact CGAF 3390 Mary Street Suite 260 Coconut Grove, FL 33133 ARTIST INQUIRIES FestivalArtist@CGAF.com Phone: 305-447-0401 PRODUCED BY © COCONUT GROVE ARTS And Historical Association INC.  ALL RIGHTS RESERVED | CGAF.com"
    },
    {
      "url": "https://cgaf.com/coconut-grove-arts-festival-awards-30000-in-scholarships-to-fiu-students-to-foster-careers-in-the-arts/",
      "text": "CGAF Awards $30,000 in Scholarships to FIU Students to Foster Careers in Arts - Coconut Grove Arts Festival Coconut Grove Arts Festival ARTIST APPLICATIONS NOW OPEN! Facebook Twitter Instagram Apply Today! 0 0 Home For Artists Artist FAQ Application Info Artist 2025 Artists 2025 Award Winners Emerging Artists Info Event Information Blogs FAQ Partners Support Contact Volunteer Shop About Our Story The Team Initiatives 2025 Scholarship Recipients September 9, 2024 CGAF Awards $30,000 in Scholarships to FIU Students to Foster Careers in Arts The Coconut Grove Arts Festival (CGAF) is proud to continue its commitment to nurturing the next generation of artists through its ongoing scholarship program in partnership with Florida International University’s (FIU) Department of Art + Art History. For the 2024-25 academic year, nine talented undergraduate and graduate students have been awarded a total $30,000 in scholarships, providing both financial support and valuable mentorship opportunities at the festival. The scholarship recipients were honored at a special reception on September 4, 2024. Over the course of three years, starting in 2023, CGAF is disbursing a total of $90,000 in scholarships directly to FIU students. This initiative reflects the festival’s dedication to fostering artistic talent and offering young creatives a foundation for building successful careers in the visual arts. “The Coconut Grove Arts Festival organization is deeply committed to giving back to our community by nurturing the next generation of artists,” said Dave Hill, Jr., CGAF Chairman of the Board. “Our scholarship programs, along with initiatives like our visiting-artist and emerging-artist programs, are designed to inspire and empower young creatives to step into their futures as professional artists. Partnering with FIU amplifies our impact, helping us further our mission to cultivate a thriving arts community and provide life-changing opportunities for aspiring artists.” Camille Marchese, Executive Director of the Coconut Grove Arts Festival, echoed Chairman Hill’s remarks, stating, “Our goal is to inspire and motivate these emerging artists to pursue their dreams with confidence. By providing them with practical, hands-on experience in the art world, we are helping them lay the groundwork for their future careers.” The students will have the opportunity to work closely with seasoned artists during the festival, gaining invaluable insight into building sustainable careers through art festivals. Since its inception in 1963, CGAF has played a pivotal role in shaping the arts and cultural landscape of South Florida, most notably through its iconic outdoor festival held each year during Presidents’ Day weekend. This scholarship initiative is an extension of the festival’s mission to promote arts education and support local talent. Tori Arpad-Cotta, Chair of FIU’s Department of Art + Art History, highlighted the value of the partnership, stating, “The Coconut Grove Arts Festival Scholarship is more than just financial aid. It’s about creating lasting relationships between students and experienced artists, allowing our students to learn practical skills that go beyond the classroom. We are grateful to Camille Marchese and the CGAF team for this unique opportunity.” Brian Schriner, Dean of FIU’s College of Communication, Architecture + The Arts (CARTA), echoed this sentiment, adding, “We are thrilled to collaborate with the Coconut Grove Arts Festival, a cornerstone of our community’s creative and cultural economy. This partnership provides our visual arts students with both the financial resources and career-ready experiences they need to thrive in today’s competitive arts landscape.” The scholarship presentation took take place at a monthly “Frost After Dark” event at the Patricia & Phillip Frost Art Museum, Sept. 4, on FIU’s main campus in Miami. This celebration served as a back-to-school mixer for the FIU students and faculty – and on this special night, for members of the CGAF Board of Directors and staff, as well. They each had a chance to meet the scholarship recipients and hear firsthand about their passion for the arts and their eagerness to participate in the festival. Established through the partnership between CGAF and FIU’s CARTA, the Coconut Grove Arts Festival Visual Arts Scholarship Fund continues to strengthen the bond between academia and South Florida’s thriving creative economy. Open to both undergraduate and graduate students at FIU, the fund represents a powerful investment in the future of the arts in the region. For more information on the scholarship program and the Coconut Grove Arts Festival, please visit http://cgaf.com/initiatives or contact Camille Marchese via email at camille@cgaf.com or call 305-447-0401. For FIU student application information, visit: https://carta.fiu.edu/arts/students/scholarships/ # # # About the College of Communication, Architecture + The Arts: The College of Communication, Architecture + The Arts (CARTA), is an interdisciplinary college within Florida International University. Ranked #10 in Innovation among U.S. Public Institutions in 2022 by World’s Universities with Real Impact (WURI), CARTA is developing the next generation of creators. CARTA embodies Creative Forces At Work. Students learn from and work with award-winning faculty, in nationally ranked, accredited programs. Each of the disciplines housed in CARTA informs the way we think, interact, and relate with each other. CARTA inspires and feeds creativity, problem-solving skills, and resiliency – sparking dialogue through design, visual and performing arts, immersive technology, and communication. About FIU: Florida International University is a top public university that drives real talent and innovation in Miami and globally. Very high research (R1) activity and high social mobility come together at FIU to uplift and accelerate learner success in a global city by focusing in the areas of environment, health, innovation, and justice. Today, FIU has two campuses and multiple centers. FIU serves a diverse student body of more than 56,000 and 290,000 Panther alumni. U.S. News and World Report places dozens of FIU programs among the best in the nation, including international business at No. 2. Washington Monthly Magazine ranks FIU among the top 20 public universities contributing to the public good. Never miss our post, Subscribe now! Enter your email below to stay updated. Send CGAF Details The 62nd Annual Coconut Grove Arts Festival takes place Presidents Day Weekend, February 14∙15∙16, 2026 Sat, Feb 14: 10AM – 6PM Sun, Feb 15: 10AM – 6PM Mon, Feb 16: 10AM – 5PM About CGAF The Coconut Grove Arts Festival® is presented by the nonprofit, 501(c)(3), Coconut Grove Arts and Historical Association. Proceeds help fund year-round arts programs. Facebook Instagram Twitter #CGAF2025 Contact CGAF 3390 Mary Street Suite 260 Coconut Grove, FL 33133 ARTIST INQUIRIES FestivalArtist@CGAF.com Phone: 305-447-0401 PRODUCED BY SUBSCRIBE TO OUR NEWSLETER Email Send © COCONUT GROVE ARTS And Historical Association INC.  ALL RIGHTS RESERVED | CGAF.com"
    },
    {
      "url": "https://cgaf.com/the-team/",
      "text": "The Team - Coconut Grove Arts Festival Coconut Grove Arts Festival ARTIST APPLICATIONS NOW OPEN! Facebook Twitter Instagram Apply Today! 0 0 Home For Artists Artist FAQ Application Info Artist 2025 Artists 2025 Award Winners Emerging Artists Info Event Information Blogs FAQ Partners Support Contact Volunteer Shop About Our Story The Team Initiatives 2025 Scholarship Recipients THE TEAM OUR TEAM Our team is comprised of a professional staff and a volunteer board of directors with a diversity of experience in the arts, non-profit and business world. Highly motivated by the desire to showcase the highest caliber of arts and entertainment, our team produces a festival especially designed for our visitors and collectors. EXECUTIVE COMMITTEE DAVE HILL, JR Chair Pam Mayer Chair- Elect Marshall Steingold Secretary Flavio Carrillo Treasurer Michelle Barton King Past Chair BOARD OF DIRECTORS Nathan Kurland CURTIS CRIDER JACK EADS LILIA GARCIA LOLA GARCIA THOMAS KORGE BENEDICT KUEHNE EXECUTIVE DIRECTOR Camille marchese camille@cgaf.com ATTORNEY MARK NEUBERGER Foley and Lardner, L.L.P President Emeritus Monty Trainer EMERITUS BOARD MEMBERS DAN EGGLAND JANE BLAKE CARLOS CHIALASTRI DARYL GRICE Dave Hill, SR Jose Matute Donna Sweeny Mario Toca HONORARY BOARD MEMBERS TODD CARPENTER TEOFILO CHAPA PAT DAHNE THELMA GIBSON JUDGE JEFFREY ROSINEK CGAF Details The 62nd Annual Coconut Grove Arts Festival takes place Presidents Day Weekend, February 14∙15∙16, 2026 Sat, Feb 14: 10AM – 6PM Sun, Feb 15: 10AM – 6PM Mon, Feb 16: 10AM – 5PM About CGAF The Coconut Grove Arts Festival® is presented by the nonprofit, 501(c)(3), Coconut Grove Arts and Historical Association. Proceeds help fund year-round arts programs. Facebook Instagram Twitter #CGAF2025 Contact CGAF 3390 Mary Street Suite 260 Coconut Grove, FL 33133 ARTIST INQUIRIES FestivalArtist@CGAF.com Phone: 305-447-0401 PRODUCED BY SUBSCRIBE TO OUR NEWSLETER Email Send © COCONUT GROVE ARTS And Historical Association INC.  ALL RIGHTS RESERVED | CGAF.com"
    },
    {
      "url": "https://cgaf.com/contact/",
      "text": "Contact - Coconut Grove Arts Festival Coconut Grove Arts Festival ARTIST APPLICATIONS NOW OPEN! Facebook Twitter Instagram Apply Today! 0 0 Home For Artists Artist FAQ Application Info Artist 2025 Artists 2025 Award Winners Emerging Artists Info Event Information Blogs FAQ Partners Support Contact Volunteer Shop About Our Story The Team Initiatives 2025 Scholarship Recipients Contact We are here to assist you and make of every edition the most grateful experience. General Info Address: 3390 Mary St, Suite 260 Coconut Grove, FL. 33133. Phone: 305-447-0401. Email: info@cgaf.com Artist Inquiries Email: FestivalArtist@cgaf.com Office Hours Monday through Friday: 9:00AM to 5:00M CONTACT INFORMATION First Name Last Name Email Submit CGAF Details The 62nd Annual Coconut Grove Arts Festival takes place Presidents Day Weekend, February 14∙15∙16, 2026 Sat, Feb 14: 10AM – 6PM Sun, Feb 15: 10AM – 6PM Mon, Feb 16: 10AM – 5PM About CGAF The Coconut Grove Arts Festival® is presented by the nonprofit, 501(c)(3), Coconut Grove Arts and Historical Association. Proceeds help fund year-round arts programs. Facebook Instagram Twitter #CGAF2025 Contact CGAF 3390 Mary Street Suite 260 Coconut Grove, FL 33133 ARTIST INQUIRIES FestivalArtist@CGAF.com Phone: 305-447-0401 PRODUCED BY SUBSCRIBE TO OUR NEWSLETER Email Send © COCONUT GROVE ARTS And Historical Association INC.  ALL RIGHTS RESERVED | CGAF.com"
    },
    {
      "url": "https://www.wlrn.org/arts-culture/2024-02-16/coconut-grove-arts-festival-celebrates-60th-year",
      "text": "Coconut Grove Arts Festival celebrates 60 years in Miami | WLRN Search Query Show Search HOME News Latest Headlines News In Brief Government & Politics Education Americas Environment Law & Justice Business & Economy Investigations Arts & Culture PolitiFact Florida Health Weather Special Series Archive Latest Headlines News In Brief Government & Politics Education Americas Environment Law & Justice Business & Economy Investigations Arts & Culture PolitiFact Florida Health Weather Special Series Archive Radio & Podcasts Radio Radio Schedule How to listen to WLRN Classical Podcasts Americas Decoded Killer Train The Florida Roundup The South Florida Roundup Bright Lit Place Detention By Design Tallahassee Takeover Folk & Acoustic Music The Public Storyteller Radio Radio Schedule How to listen to WLRN Classical Podcasts Americas Decoded Killer Train The Florida Roundup The South Florida Roundup Bright Lit Place Detention By Design Tallahassee Takeover Folk & Acoustic Music The Public Storyteller Newsletters TV Television TV Schedule WLRN Passport WLRN Documentaries Watch WLRN Producing For WLRN Ways To Watch WLRN Television TV Schedule WLRN Passport WLRN Documentaries Watch WLRN Producing For WLRN Ways To Watch WLRN Support Members Membership Drawing Giveaways Vehicle Donation WLRN Passport Planned Giving Tax Savvy Giving More ways to give Member Portal Login Sponsorship Corporate Sponsorship Corporate Circle Members Membership Drawing Giveaways Vehicle Donation WLRN Passport Planned Giving Tax Savvy Giving More ways to give Member Portal Login Sponsorship Corporate Sponsorship Corporate Circle About WLRN Mission and Vision WLRN Management Miami-Dade County Public School Board WLRN Staff WLRN Jobs Privacy Policy Comment Policy Source Tracking Policy WLRN Public Files and Records Commitment to Equal Employment Opportunities Local Content and Service Report Annual Programming Report WLRN's Community Advisory Board WLRN Captioning Certificate WLRN Mission and Vision WLRN Management Miami-Dade County Public School Board WLRN Staff WLRN Jobs Privacy Policy Comment Policy Source Tracking Policy WLRN Public Files and Records Commitment to Equal Employment Opportunities Local Content and Service Report Annual Programming Report WLRN's Community Advisory Board WLRN Captioning Certificate MORE Events Calendar Shop WLRN Station Tours Producing For WLRN Mobile Listening Troubleshooting Events Calendar Shop WLRN Station Tours Producing For WLRN Mobile Listening Troubleshooting © 2025 WLRN Menu Show Search Search Query DONATE Play Live Radio Next Up: 0:00 0:00 0:00 0:00 Available On Air Stations On Air Now Playing WLRN NPR News On Air Now Playing WLRN Classical All Streams HOME News Latest Headlines News In Brief Government & Politics Education Americas Environment Law & Justice Business & Economy Investigations Arts & Culture PolitiFact Florida Health Weather Special Series Archive Latest Headlines News In Brief Government & Politics Education Americas Environment Law & Justice Business & Economy Investigations Arts & Culture PolitiFact Florida Health Weather Special Series Archive Radio & Podcasts Radio Radio Schedule How to listen to WLRN Classical Podcasts Americas Decoded Killer Train The Florida Roundup The South Florida Roundup Bright Lit Place Detention By Design Tallahassee Takeover Folk & Acoustic Music The Public Storyteller Radio Radio Schedule How to listen to WLRN Classical Podcasts Americas Decoded Killer Train The Florida Roundup The South Florida Roundup Bright Lit Place Detention By Design Tallahassee Takeover Folk & Acoustic Music The Public Storyteller Newsletters TV Television TV Schedule WLRN Passport WLRN Documentaries Watch WLRN Producing For WLRN Ways To Watch WLRN Television TV Schedule WLRN Passport WLRN Documentaries Watch WLRN Producing For WLRN Ways To Watch WLRN Support Members Membership Drawing Giveaways Vehicle Donation WLRN Passport Planned Giving Tax Savvy Giving More ways to give Member Portal Login Sponsorship Corporate Sponsorship Corporate Circle Members Membership Drawing Giveaways Vehicle Donation WLRN Passport Planned Giving Tax Savvy Giving More ways to give Member Portal Login Sponsorship Corporate Sponsorship Corporate Circle About WLRN Mission and Vision WLRN Management Miami-Dade County Public School Board WLRN Staff WLRN Jobs Privacy Policy Comment Policy Source Tracking Policy WLRN Public Files and Records Commitment to Equal Employment Opportunities Local Content and Service Report Annual Programming Report WLRN's Community Advisory Board WLRN Captioning Certificate WLRN Mission and Vision WLRN Management Miami-Dade County Public School Board WLRN Staff WLRN Jobs Privacy Policy Comment Policy Source Tracking Policy WLRN Public Files and Records Commitment to Equal Employment Opportunities Local Content and Service Report Annual Programming Report WLRN's Community Advisory Board WLRN Captioning Certificate MORE Events Calendar Shop WLRN Station Tours Producing For WLRN Mobile Listening Troubleshooting Events Calendar Shop WLRN Station Tours Producing For WLRN Mobile Listening Troubleshooting Arts & Culture As ‘fresh’ as ever, Coconut Grove Arts Festival celebrates 60 years in Miami WLRN Public Media | \n                    By Amanda Rosa | Miami Herald Published February 16, 2024 at 8:00 AM EST Facebook Twitter LinkedIn Email Daniel A. Vrela / The Miami Herald Art lovers check out the works at the 2022 Coconut Grove Arts Festival, which began in 1963 and has become one of Miami’s premiere outdoor events. This year’s festival runs throughout Presidents Day Weekend. There’s one spot where you can see it all. Tony Albelo stood on the corner of a road that curves just right to see the entirety of the Coconut Grove Arts Festival stretch from east to north and the thousands of people making their way through artists’ tents. It was 2022, the festival’s return after it took a hiatus during the height of Covid-19. “The streets were jam packed with people, and there was just this feeling in the air,” said Albelo, the CEO of EngageLive!, the company that produces the festival. “We actually came through and kept the festival going and made it as good as it’s ever been.” READ MORE: Celebrating diversity and the African diaspora at Broward's Afro-Carib Festival In the young, growing and rather inconsistent city of Miami, few institutions make it past adolescence. This Presidents’ Day Weekend, the Coconut Grove Arts Festival reaches seniority as it celebrates its 60th anniversary with hundreds of artists selling their work. The festival seems to have cracked the code on longevity in the 305. What started as a one-off publicity stunt turned into a beloved cultural institution. Its been able to experiment and reinvent itself. It has come back from a pandemic hiatus with a vengeance, with total audience numbers growing from 30,000 before the pandemic to 80,000. And its reputation as one of the top art fairs in the country remains impeccable. Courtesy of CGAF An aerial shot of the Coconut Grove Arts Festival. The festival celebrates its 60th anniversary from Feb. 17 to 19. Courtesy of CGAF But maybe the key to long term success isn’t the weather, the waterfront location, the food, the live music or even the 80-foot diameter high-tech dome. It’s the art: The paintings, sculptures, woodwork, ceramics, posters, prints, glass and textiles that line the streets. The festival’s reputation grew exponentially over the years, as artists from around the country submit applications to participate in the show. It’s been a launchpad for several careers, from nature photographer Clyde Butcher to pop artist Romero Britto. “If there was a Mount Rushmore of festivals and events in Miami, the Coconut Grove Arts Festival is definitely up there,” Albelo said. “It’s a staple of Miami. It’s a cornerstone of the event scene. And it’s true to its mission of being a world class art show.” The Stunt The story begins with a man by the name of Charlie Cinnamon. Cinnamon, who died in 2016 at age 94, was a pillar in South Florida’s arts community who preferred to call himself a “press agent,” not a publicist. In 1963, inspiration struck when he was promoting a production of the French musical “Irma La Douce” at the Coconut Grove Playhouse. “In those days, it was tough to get people to cross the causeway or from wherever to come to the Grove Playhouse,” Cinnamon told the Herald for a 2013 story on the festival’s 50th anniversary. “As a press agent looking for some sort of gimmick, since the show was set in Paris, let’s do a Left Bank Art Show. We booked the whole weekend around it when it really was an arts colony here.” Miami Herald file Charlie Cinnamon, legendary Miami theatrical press agent and founder of the Coconut Grove Arts Festival, pictured in his office in 2013. Cinnamon was still working when he died in 2017 at age 94. C.W. Griffith In order to get more eyes on the Playhouse, Cinnamon turned the surrounding streets into a Parisian-inspired “clothesline art show” complete with a French poodle show outside the theater’s front door. Here’s the funny part. “People started to come,” Cinnamon told the Herald, chuckling. “We never figured out if they bought any tickets [to the musical.]” The festival proved to be a bigger hit than the musical. It returned the following year -- and following decades -- as the Coconut Grove Arts Festival. This year marks another milestone for the festival. Its president Monty Trainer, the business owner and local legend known as the “Grove Father,” is stepping down from the role after 15 years. Courtesy of CGAF Coconut Grove Arts Festival president Monty Trainer and executive director Camille Marchese shake hands with artist Benjamin Frey at the festival. Trainer has been involved in the festival since the early ‘70s when he was asked to be a sponsor. He appreciated the “labor of love” artists put into the festival and watched as they’d unload their work from vans to set up and packed everything back in after the weekend. He was asked to join the board and later became chairman and president. Running an arts festival in Miami always has its ups and downs, Trainer said. Like the time the festival dealt with a power outage. Or the other time a hurricane pushed boats onto the dock. Or the many times it has rained. But there’s also the fulfilling moments. Trainer said he enjoys seeing the festival award scholarships to local public magnet arts high school students each year. His favorite thing to do is hop on a little golf cart and zip around the festival, greeting visitors and meeting artists. “Art is the number one thing,” he said. “We’re an art community, and that’s what we focus on first.” The revamp Keeping a decades-old institution fresh is a challenge, Albelo said. Before the pandemic, Albelo said, attendance had dipped and there was talk that “people were used to the way that it was.” The board, which still focuses on selecting the artists, hired EngageLive! to handle everything else; the festival’s logistics, marketing, ticketing and permitting. It’s like a “division between church and state,” he said. READ MORE: How West Palm Beach is using art to draw more people to outdoor public spaces “One of the goals that we set out was to freshen up the festival,” Albelo said. “Realign it with it’s core value that it’s an art festival first, but that it is a festival and it has a big social component.” The festival focused on attracting younger families and new South Florida transplants. There are The Stacks, a pyramid of containers for muralists to paint during the festival. Over 100 artists donated their works to the Young Collectors Club, where children can browse on their own and buy their first piece of art for just $5. Daniel A. Varela / The Miami Herald Attendees enjoying an interactive art installation during the 2022 Coconut Grove Arts Festival on Feb. 20, 2022. For the first time this year are Flavors of The Grove, a signature dish contest for local restaurants, and the Art & Drafts Beer Garden, where guests can sip craft beer while artists create new work. And then there’s a giant white dome that offers an immersive, 360 art exhibition inside. The artists The pride of the Coconut Grove Arts Festival is still the artists. “These are artists you’re not going to see anywhere else. I’m not exaggerating when I say these are some of the best,” said executive director Camille Marchese. “I had artists calling me when our list was released saying, ‘Damn, you’ve got a good lineup.’” The festival uses an anonymous jury process to score artists’ submissions based on skill, creativity and originality and select who will participate. In the past, the festival received about 500 applications for about 240 spots. This year, jurors had to sift through 1,100. “It’s just a good show, artists make money here and that’s why it’s attractive,” Marchese said. “The artists in our show now are as good as any artists you’re gonna find in Basel.” The festival’s 60-year run is a testament to the power of centering artists, Marchese said. Above all, she credits the festival’s board, volunteers and founders for creating something the community loves. She still gets phone calls from longtime festival goers asking how to buy tickets. She recently got an email from a guy who sent her a photo of a poster from the 1983 festival asking for more information about the artist. Daniel A. Varela / The Miami Herald A festivalgoer checks out a booth during the 2022 Coconut Grove Arts Festival. “It’s just part of people’s year. It’s part of the community,” she said. “I run into people all the time that feel like this is their festival because this is their town.” Artist Annie Bisone felt that energy when she showed her work at the Coconut Grove Arts Festival for the first time last year. She’s one of 45 returning artists who were invited back after receiving awards from the festival last year. “The thing that I remember most is how engaged the audience was with my work and also excited to see something new,” Bisone said. “It felt fresh to have new eyes and conversations. It seemed like a mutual sparkle situation.” Bisone, a Milwaukee-based fiber artist who runs Lalo Workshop, makes zero-waste, one-of-a-kind sustainable clothing made from leftover fabric scraps that otherwise would’ve been thrown away. She was happy to see that the Coconut Grove audience was so receptive to her work and her passion for slow fashion. Daniel A. Varela / The Miami Herald Two festivalgoers look at a piece of art during the 2022 Coconut Grove Arts Festival. Before applying to the festival, she had asked fellow artists for advice on where she should go. “Coconut Grove always came up as number one,” she said. As an artist, she said she is heartened to see such a supportive event celebrate 60 years. “It’s about the community. It’s about the collective,” she said. “It’s about like deciding that this is important, that this is necessary, that we need this in our lives. It’s life enriching. And yeah, without art, life is pretty boring.” Coconut Grove Arts Festival 2024 When: Feb. 17 - 19 Where: 2700 S. Bayshore Drive, Miami. (Festival runs along streets of McFarlane Road, South Bayshore Drive and Pan American Drive.) Info: $25 for general admission. Tickets available online . This story was produced with financial support from The Pérez Family Foundation , in partnership with Journalism Funding Partners, as part of an independent journalism fellowship program. The Miami Herald maintains full editorial control of this work. Tags Arts & Culture News Local News Coconut Grove Culture & Arts Facebook Twitter LinkedIn Email Amanda Rosa | Miami Herald See stories by Amanda Rosa | Miami Herald Public funding is gone. But WLRN is still here—because of YOU. WLRN has lost over $3 million in federal and state support. Your donation today helps fill the gap and keeps trusted, local journalism alive. If you value the stories you read, please give now. Support WLRN Latest Stories Environment Warm seas help stone crabs reach the Chesapeake. What does that mean for crabs in Florida? Commentary America's new war doctrine includes drug criminals. Problem is, that's criminal Government & Politics Poll: Floridians, including Republicans, oppose mid-decade redistricting National Politics 33 million voters have been run through a Trump administration citizenship check More On This Topic Lights, Camera, Miami: Local film festival launches workshop for future filmmakers Miami's legendary Churchill's Pub stages a comeback after five-year hiatus Jayne Kennedy reflects on breaking NFL barriers, personal struggles, and her iconic Muhammad Ali moment Monthly art event gives artists a voice and community in Little Havana Stay Connected twitter instagram youtube pinterest facebook linkedin © 2025 WLRN About Contact Us Donate Underwrite Shop Newsletters FCC Public Files WLRN-TV FCC Public File WLRN-FM FCC Public File WKWM-FM FCC Public File WLRN Public Files and Records EEO Report Station Public Files Contact - James March  (305) 995-2446 or JMarch@wlrn.org WLRN Management"
    },
    {
      "url": "https://www.zapplication.org/event-gallery.php?ID=10372&embed=true",
      "text": "ZAPP - Event Gallery - Coconut Grove Arts Festival® 2023 Coconut Grove Arts Festival® 2023 Event Dates: {{ galleryMetaData.eventStart | moment(\"l\") }} - {{ galleryMetaData.eventEnd | moment(\"l\") }} Location: {{ galleryMetaData.fairLocation }} {{ galleryMetaData.fairType }} Visit Event Website Artist Name: Location: Reset Search Show List View Show Grid View Sort By: Filter By Medium (Select multiple) {{discipline.discipline}} Artists/Artwork: Page {{currentPage}} of {{totalApps > 0 ? Math.ceil(totalApps/maxResults) : \"?\"}} Sort By: {{application.artist_name}} {{application.collaborator}} Booth: {{application.booth_number}} Not Assigned Artwork Artist Name Medium Location Booth Number {{application.title}} {{application.artist_name}} {{application.collaborator}} {{application.event_discipline}} {{application.location}} Booth: {{application.booth_number}} Not Assigned Filter By Medium: (Select multiple) {{discipline.discipline}} Loading gallery... Oops! It looks like the gallery isn't available for Coconut Grove Arts Festival® 2023. Contact the show administrator for more information at Camille@CGAF.com . Powered by ZAPP® Loading Artists... Artwork Information {{currentApp.first_name}} {{currentApp.last_name}} {{currentApp.collabs}} {{currentSample.title}} {{currentApp.event_discipline_desc}} {{currentSample.metadata.retail_price | toCurrency}} {{currentApp.city}}, {{currentApp.state}} Visit Website Artwork Information {{currentApp.first_name}} {{currentApp.last_name}} {{currentApp.collabs}} {{currentSample.title}} {{currentApp.event_discipline_desc}} {{currentSample.metadata.retail_price | toCurrency}} {{currentApp.city}}, {{currentApp.state}} Visit Website SHOWS SHOWS: Previous Artist Next Artist"
    },
    {
      "url": "https://cgaf.com/neighborhood-festivities/",
      "text": "Neighborhood Festivities - Coconut Grove Arts Festival Coconut Grove Arts Festival ARTIST APPLICATIONS NOW OPEN! Facebook Twitter Instagram Apply Today! 0 0 Home For Artists Artist FAQ Application Info Artist 2025 Artists 2025 Award Winners Emerging Artists Info Event Information Blogs FAQ Partners Support Contact Volunteer Shop About Our Story The Team Initiatives 2025 Scholarship Recipients Neighborhood Festivities Neighborhood Festivities Experience the neighborhood energy of Coconut Grove during the festival! We’ve got your pre- and post-festival plans covered. Eva & Oyster Bar Eva transforms into a vibrant venue offering two unique experiences: a colorful brunch in the morning and a dynamic after party at night. Both events are part of the CGAF festival, where art meets culinary delight. Official Brunch Sunday Morning – Feb 16 Complimentary personal dip trio – feta, tzatziki, & hummus Complimentary kataifi dessert Complimentary brunch cocktail of choice Oyster Bar – $1 oysters during brunch 10% off coupon for your next visit in February (cannot be used with other offers) With CGAF ticket and $25 purchase per guest Reserve Now Official After Party Sunday Night – Feb 16 Complimentary Happy Hour beverage of choice Happy Hour specials all night Oyster Bar – $1 oysters during the after party 10% off coupon for your next visit in February (cannot be used with other offers) With CGAF ticket and $25 purchase per guest Reserve Now Bayshore Club Keep the party going after Day 1 of the festival with an official after party complete with live music, light bites, and limited drink specials. Official After Party Saturday Night – Feb 15 The first 150 guests with a CGAF ticket or wristband receive a complimentary beverage. Live music Complimentary appetizers served during the first hour. Sip on exclusive drink deals all night long. Weekend Perk: Show your CGAF ticket/wristband at Bayshore Club or Glass & Vine during festival weekend and get 15% off your bill! Reserve Now Jaguar For 20 years, Jaguar has brought Latin American flavors, warmth, and hospitality to the heart of Coconut Grove. Post-Festival Dinner Spot For two decades, Jaguar has been a gathering place where Latin American flavors, warmth, and hospitality come to life in the heart of Coconut Grove. The anniversary celebration began during the Coconut Grove Arts Festival, a perfect tribute to the culture and vibrancy that define its identity. But the festivities aren’t over— Jaguar is hosting a special anniversary party in March, inviting the community to celebrate 20 years of sabor, tradition, and togetherness. Learn More CGAF Details The 62nd Annual Coconut Grove Arts Festival takes place Presidents Day Weekend, February 14∙15∙16, 2026 Sat, Feb 14: 10AM – 6PM Sun, Feb 15: 10AM – 6PM Mon, Feb 16: 10AM – 5PM About CGAF The Coconut Grove Arts Festival® is presented by the nonprofit, 501(c)(3), Coconut Grove Arts and Historical Association. Proceeds help fund year-round arts programs. Facebook Instagram Twitter #CGAF2025 Contact CGAF 3390 Mary Street Suite 260 Coconut Grove, FL 33133 ARTIST INQUIRIES FestivalArtist@CGAF.com Phone: 305-447-0401 PRODUCED BY SUBSCRIBE TO OUR NEWSLETER Email Send © COCONUT GROVE ARTS And Historical Association INC.  ALL RIGHTS RESERVED | CGAF.com"
    },
    {
      "url": "https://cgaf.com/artist-faq/",
      "text": "Artist FAQ - Coconut Grove Arts Festival Coconut Grove Arts Festival ARTIST APPLICATIONS NOW OPEN! Facebook Twitter Instagram Apply Today! 0 0 Home For Artists Artist FAQ Application Info Artist 2025 Artists 2025 Award Winners Emerging Artists Info Event Information Blogs FAQ Partners Support Contact Volunteer Shop About Our Story The Team Initiatives 2025 Scholarship Recipients FREQUENTLY ASKED QUESTIONS ARTIST FAQ’s Most frequent questions and answers What are the dates of the 2026 festival? The 2026 Coconut Grove Arts Festival will take place February 14-16, 2026. Where can I apply? Artist applications are now open.  Please CLICK HERE to apply! What does it cost to apply? Application Fee: $40. The application fee for the 2026 Coconut Grove Arts Festival Award Winners is waived. Please contact FestivalArtist@cgaf.com via email to receive the code. Can I apply in multiple categories? Each exhibiting artist must complete an online application with only one artist per entry unless you are entering as collaborating artists. A separate online application must be completed for each medium in which you would like to apply. Each application requires a jury fee and its own set of images. If an artist wishes to apply in more than one category a separate application form, jury fee, and set of images must be submitted for each category. Artists may apply in up to 3 categories, but only two entries can be accepted into the show. Artists may not apply twice in the same category. May I apply with collaborating artist? Collaborating artists is defined as a group of two (2) artists that work together on any one piece of art. If two artists collaborate, it is regarded as one joint entry. If accepted, only finished work that is the result of the collaborative process may be displayed and sold. Both artists are required to sign in and present photo identification prior to setting up. Both artists must be present during the Festival hours in the booth during the entire three-day festival. Assistants, employees, office, or other support staff are NOT considered to be collaborators. If an artist has a helper who assists the artists with frames, setup, selling, paperwork, etc., but is not producing the work, this person is not a collaborator, but may certainly assist at the Festival. What are some amenities for artists? The Coconut Grove Arts Festival wants to ensure that your participation is a positive experience. During the festival, the following amenities are offered to all artists: Artist Hospitality Area, centrally located Dedicated artist restroom trailers Complimentary breakfast/lunch as well as coffee in the morning and cold water throughout the day Artist gallery and contact information on the CGAF website through the event. Individualized discount code to send to your collectors for the opportunity to purchase Festival tickets ahead of time and for a discounted rate 24-hour security Booth sitting staffed by volunteers on call. Extensive media promotions throughout South Florida leading up to and during the festival. What kind of images should I use to apply? IMAGES Five (5) images are to be submitted for each individual media category entered by the artist. Four (4) images of individual work and a mandatory booth shot. The booth image is IMPORTANT . It is factored into the jury’s decision. The booth image is used to show how you will present your work at the Coconut Grove Arts Festival.  Outdoor booth shots are best. Booth images may not be created in a computer program. Booth Image must be blind and must not contain any identifiable sign or photo of the artist themselves. If you do not have a booth image (because you are new to the art show world), please provide an image of a grouping of your body of work to give an idea of how you will present your work at the show and how your work looks grouped together, and a brief explanation of why there is no booth image, in the title part of your “booth image.” How does jurying work? THE JUDGES AND JURY PROCESS The Coconut Grove Arts Festival selects up to 285 artists to participate through a blind jurying process. A jury panel of five independent judges consisting of museum curators, gallery owners, professional artists, and art educators will gather to review each application. Jury may include peer jurors. The jury process is virtual and will not be open to the public. Decisions of the jury are based solely on the quality of the artwork. All Jury scores are final. Recent history shows that approximately 1/3 of our artists each year are exhibiting for the first time. What are the accepted categories? Claywork, Digital Arts, Drawing & Pastels, Fiber, Glass, Jewelry, Metal, Mixed Media – 2-Dimensional, Mixed Media – 3-Dimensional, Painting, Photography, Printmaking, Sculpture, Watercolor & Wood. If I am accepted, what kind of fees can I expect? If I am accepted, the fees I should expect are as follows: Standard Booth (10’X11′): $875 (Includes 7% FL Sales Tax) Double Booth (10’x22′): $1,750 (Includes 7% FL Sales Tax) Corner Booth Upgrade (10’x11′): $375 (Includes 7% FL Sales Tax) Corner Booth Mid-row Upgrade: $275 (Includes 7% FL Sales Tax) Sculpture Garden (10’x22) $1700, (Includes 7% FL Sales Tax – Note: The sculpture garden does not allow for a tent, so work must be able to withstand all natural conditions. ) Jury fees are submitted via Zapp and are non-refundable Booth fees are payable upon your invitation to participate in the festival.  Please do not send booth fees until notification of your selection. Booth fees are payable through zapplication.com. What is the Emerging Artist Program? Are you an aspiring artist? Are you interested in beginning a career in outdoor art shows?  Then click here for more info! Any other rules I should be aware of? Artists MUST be present all three days of the festival. No commercial dealers or agents are permitted to represent the artist. The festival reserves the right to close down or remove any booth if the artist is not in attendance. If accepted, an artist may not exhibit in other festivals during the Coconut Grove Arts Festival. All artists are required to check-in at the Artist Check-In any time after 12 pm Friday, February 13th. Photo ID is required. Artists may NOT set up their booth before 12:00 pm on Friday, February 13, 2026. All work must be the artist’s original work, no representations, and all artwork must be available for sale. Artists may exhibit artwork only in the category in which accepted. No artwork from molds, kits or other commercial methods is allowed. Ready-made objects (i.e., clothing furniture) which have been embellished, painted, decorated, dyed, or batiked will not be accepted. No offset reproductions of paintings, drawings, prints, photographs, or any other media may be exhibited or sold (including hand-colored offset reproductions). All two-dimensional work must be framed, matted, or stretched. All photography must be printed by the artist or under the artist’s supervision in limited editions no greater than 250 including all sizes, properly signed and numbered on archival materials. Photographers and digital artists may only sell signed and numbered works of limited editions of 250 or less. No posters, postcards, t-shirts, or personal merchandise can be sold at the festival. Artists who break down displays or depart before closing time on any day of the festival will not be allowed to return the following day and may not be invited to future festivals unless proof of an emergency is presented. Artists who sell their entire body of work must remain with their booths for the duration of the show. Artists are responsible for collecting and paying the State of Florida seven percent sales tax. No commission on sales will be paid to the Coconut Grove Arts Festival. All fees, application and booth fees, must be paid in full two (2) weeks prior to the registration date. Any breach of the rules forfeits all rights of the artist and will result in immediate removal from the show without a refund. CGAF Details The 62nd Annual Coconut Grove Arts Festival takes place Presidents Day Weekend, February 14∙15∙16, 2026 Sat, Feb 14: 10AM – 6PM Sun, Feb 15: 10AM – 6PM Mon, Feb 16: 10AM – 5PM About CGAF The Coconut Grove Arts Festival® is presented by the nonprofit, 501(c)(3), Coconut Grove Arts and Historical Association. Proceeds help fund year-round arts programs. Facebook Instagram Twitter #CGAF2025 Contact CGAF 3390 Mary Street Suite 260 Coconut Grove, FL 33133 ARTIST INQUIRIES FestivalArtist@CGAF.com Phone: 305-447-0401 PRODUCED BY SUBSCRIBE TO OUR NEWSLETER Email Send © COCONUT GROVE ARTS And Historical Association INC.  ALL RIGHTS RESERVED | CGAF.com"
    },
    {
      "url": "https://gmfea.org/event/coconut-grove-arts-festival-2025/",
      "text": "Coconut Grove Arts Festival - Greater Miami Festivals & Events Association HOME ABOUT Conference MEMBERSHIP Membership Directory : Vendor Membership Benefits & Application Log In EVENT CALENDAR BLOG CONTACT DIGITAL PROGRAM « All Events This event has passed. Coconut Grove Arts Festival February 15 - February 17 « Moonlight & Music: Valentines Day Concert MIGF 2025 GuitART FESTIVAL PASS » Coconut Grove Arts Festival 2025 Celebrating 61 years of artistic expression. The art event of the year! Our three-day outdoor art festival focuses on one thing: world-class art. But we are not just about art though. We offer something for everyone with culinary displays, live performances, and family areas to keep your team busy while you peruse all the art! (Shhh, that’s our secret) Held every Presidents’ Day Weekend, the Arts Festival is one of the nation’s premier arts festivals and is hosted right here in the charming waterfront village of Coconut Grove. More than 280 internationally recognized and jury-selected artists showcase their spectacular works with Biscayne Bay as the backdrop. We invite you to visit the Arts Festival this February and learn why we’ve been at the top of everyone’s list for over 60 years. Join us for a mesmerizing weekend where imagination takes center stage and creativity knows no bounds. Hours: Saturday, February 15: 10AM – 6PM Sunday, February 16: 10AM – 6PM Monday, February 17: 10AM – 5PM Add to calendar Google Calendar iCalendar Outlook 365 Outlook Live Details Start: February 15 End: February 17 Website: https://cgaf.com/ Organizer Coconut Grove Arts and Historical Association Phone 305-447-0401 Email camille@cgaf.com View Organizer Website Venue Coconut Grove 2700 S. Bayshore Drive Miami , FL 33133 United States + Google Map « Moonlight & Music: Valentines Day Concert MIGF 2025 GuitART FESTIVAL PASS » GMFEA is comprised of South Florida’s major annual festivals with the central purpose of promoting the year-round schedule of special events to residents and visitors. Facebook Twitter Youtube Instagram GMFEA About Us Membership Conference Events Blog Contact Us 12555 Biscayne Blvd. #821 -- Miami, FL 33181 info@festivalsmiami.com 305-651-9404 Sign-Up For Our Newsletter Email (required) * Select list(s) to subscribe to Newsletter Sign-Up Example: Yes, I would like to receive emails from gmfea. (You can unsubscribe anytime) Constant Contact Use. Please leave this field blank. With the support of the Miami-Dade County Department of Cultural Affairs, the Tourist Development Council, the Cultural Affairs Council, the Mayor and the Miami-Dade County Board of County Commissioners. © 2025 g mfea.org . All Rights Reserved. Terms of use Privacy policy"
    },
    {
      "url": "https://new.cgaf.com/experience/",
      "text": "Experience - Coconut Grove Arts Festival 60Th Coconut Grove Arts Festival 60Th FEB 17 • 18 • 19 - Early Bird Tickets on Sale Now! Facebook Twitter Instagram Buy Tickets Home About Our Story The Team Initiatives 2023 SCHOLARSHIP RECIPIENTS Artist 2023 Artist Award Winners Emergin Artist Experience 2023 Experience 2023 Event Programming Info Partners Support Volunteer Contact For Artists Application Info Artist FAQ 2024 Artist Map Shop experience The heart and soul of the festival!  Visit our juried artists and browse through hundreds of pieces you'll want to make part of your home. Get Started Don't know where to start? Here is a map to get you started. Get Started Find more about the event like dates, time of operation, and other details. Get Started Where people of all ages and sizes get to create and take home their own art.  Come express your inner artist and get inspired! Get Started Grove VS The World!  Top Grove chefs and mixologists showdown against local South Florida rivals, ready to take the Golden Coconut! Get Started A six-container pyramid stack serving as a giant canvas where South Florida’s top muralists will be live painting throughout the festival. Get Started CGAF Details The 60th Annual Coconut Grove Arts Festival Opens February 17·18·19, 2024 About CGAF The Coconut Grove Arts Festival® is presented by the nonprofit, 501(c)(3), Coconut Grove Arts and Historical Association. Proceeds help fund year-round arts programs. Facebook Instagram Twitter #CGAF2024 Contact CGAF 3390 Mary Street Suite 260 Coconut Grove, FL 33133 ARTIST INQUIRIES FestivalArtist@CGAF.com Phone: 305-447-0401 PRODUCED BY © COCONUT GROVE ARTS And Historical Association INC.  ALL RIGHTS RESERVED | CGAF.com"
    },
    {
      "url": "https://cgaf.com/info/",
      "text": "Info - Coconut Grove Arts Festival Coconut Grove Arts Festival ARTIST APPLICATIONS NOW OPEN! Facebook Twitter Instagram Apply Today! 0 0 Home For Artists Artist FAQ Application Info Artist 2025 Artists 2025 Award Winners Emerging Artists Info Event Information Blogs FAQ Partners Support Contact Volunteer Shop About Our Story The Team Initiatives 2025 Scholarship Recipients GENERAL INFO FESTIVAL LOCATION DRIVING DIRECTIONS TRANSIT PARKING TIPS PETS POLICY ALCOHOL POLICY PROHIBITED ITEMS PHOTO POLICY ADA & ACCESSIBILITY Click here to view our FAQ FESTIVAL LOCATION DRIVING DIRECTIONS TRANSIT PARKING TIPS PETS POLICY ALCOHOL POLICY PROHIBITED ITEMS PHOTO POLICY ADA & ACCESSIBILITY GETTING HERE FESTIVAL LOCATION & HOURS Festival Address : 2700 S. Bayshore Drive, Miami, FL 33133. The Festival is located just south of downtown Miami, adjacent to beautiful Biscayne Bay. It runs along the streets of McFarlane Road, South Bayshore Drive and Pan American Drive. Festival Hours : Saturday, February 14: 10 AM - 6 PM Sunday, February 15: 10 AM - 6 PM Monday, February 16: 10 AM - 5 PM DRIVING DIRECTIONS When driving to the festival please be aware of the traffic on I-95 SB at Exit 1A, Rickenbacker Causeway. If you chose to travel I-95 SB please make sure to follow US1 to 27th Avenue. We recommend taking 836 West and then 27th Avenue south to the festival. When driving, please take advantage of the 511 Traveler Information Service. Call 511 and get all your traffic updates. TRANSIT Looking for a convenient way to get to the Coconut Grove Arts Festival ? Consider riding with a ride share service for a hassle-free journey! Simply open your preferred ride share app, enter your destination as “Coconut Grove Arts Festival,” and your driver will take you right to the heart of the action PARKING TIPS There is plenty of parking available in Coconut Grove to accommodate visitors to the Coconut Grove Arts Festival. Options include parking garages, on-street parking meters and private parking lots. EVENT RULES PETS POLICY Be kind to your pets and leave them at home when you visit the Arts Festival. NO Animals of any kind. * Exception: Services animal with proper vest for Identification ALCOHOL POLICY Alcoholic beverages purchased at the event remain on-site. Festival security will ask you to dispose of any alcoholic beverages before you exit. Please do not bring outside beverages into the Arts Festival. For safety reasons, cans and glass bottles are prohibited within the site. PROHIBITED ITEMS Weapons of any kind are not permitted. Skateboards, roller blades, bicycles, scooters, large signs and placards which may endanger or inconvenience the public attending the Festival are prohibited. Festival organizers reserve the right to decline admittance to anyone who violates the reasonable policies established for public safety or to restrict activities such as public address to designated areas. For more information, visit our FAQ PHOTO POLICY Photo Policy – While cameras are permitted into the Festival, patrons are not allowed to take photos of the artists’ work at their individual booth areas. Many participating artists will have signs reminding patrons of this policy. ADA & ACCESSIBILITY If you need assistance for accessibility in order to participate in one of our events, please contact us 72 hours in advance. You can reach by phone at (305) 447-0401 or by email at info@cgaf.com . CGAF Details The 62nd Annual Coconut Grove Arts Festival takes place Presidents Day Weekend, February 14∙15∙16, 2026 Sat, Feb 14: 10AM – 6PM Sun, Feb 15: 10AM – 6PM Mon, Feb 16: 10AM – 5PM About CGAF The Coconut Grove Arts Festival® is presented by the nonprofit, 501(c)(3), Coconut Grove Arts and Historical Association. Proceeds help fund year-round arts programs. Facebook Instagram Twitter #CGAF2025 Contact CGAF 3390 Mary Street Suite 260 Coconut Grove, FL 33133 ARTIST INQUIRIES FestivalArtist@CGAF.com Phone: 305-447-0401 PRODUCED BY SUBSCRIBE TO OUR NEWSLETER Email Send © COCONUT GROVE ARTS And Historical Association INC.  ALL RIGHTS RESERVED | CGAF.com"
    }
  ]
}