{
  "fuentes": [
    {
      "url": "https://www.usabaseball.com/about/staff",
      "email": "isaiahjones@usabaseball.com"
    },
    {
      "url": "https://www.usabaseball.com/about/staff",
      "email": "alexnash@usabaseball.com"
    },
    {
      "url": "https://www.usabaseball.com/about/staff",
      "email": "allisongupton@usabaseball.com"
    },
    {
      "url": "https://www.usabaseball.com/about/staff",
      "email": "ashleybratcher@usabaseball.com"
    },
    {
      "url": "https://www.usabaseball.com/about/staff",
      "email": "benkelley@usabaseball.com"
    },
    {
      "url": "https://www.usabaseball.com/about/staff",
      "email": "bradyoung@usabaseball.com"
    },
    {
      "url": "https://www.usabaseball.com/about/staff",
      "email": "brettcurll@usabaseball.com"
    },
    {
      "url": "https://www.usabaseball.com/about/staff",
      "email": "carringtonaustin@usabaseball.com"
    },
    {
      "url": "https://www.usabaseball.com/about/staff",
      "email": "carringtonnicholson@usabaseball.com"
    },
    {
      "url": "https://www.usabaseball.com/about/staff",
      "email": "cicelymclaughlin@usabaseball.com"
    },
    {
      "url": "https://www.usabaseball.com/about/staff",
      "email": "colebeeker@usabaseball.com"
    },
    {
      "url": "https://www.usabaseball.com/about/staff",
      "email": "davisperruccio@usabaseball.com"
    },
    {
      "url": "https://www.usabaseball.com/about/staff",
      "email": "develops@usabaseball.com"
    },
    {
      "url": "https://www.usabaseball.com/about/staff",
      "email": "drakesacenti@usabaseball.com"
    },
    {
      "url": "https://www.usabaseball.com/about/staff",
      "email": "ericcampbell@usabaseball.com"
    },
    {
      "url": "https://www.usabaseball.com/about/staff",
      "email": "hannahburrows@usabaseball.com"
    },
    {
      "url": "https://www.usabaseball.com/about/staff",
      "email": "info@usabaseball.com"
    },
    {
      "url": "https://www.usabaseball.com/about/staff",
      "email": "isaacbrown@usabaseball.com"
    },
    {
      "url": "https://www.usabaseball.com/about/staff",
      "email": "isaiahjones@usabaseball.com"
    },
    {
      "url": "https://www.usabaseball.com/about/staff",
      "email": "jadewilliams@usabaseball.com"
    },
    {
      "url": "https://www.usabaseball.com/about/staff",
      "email": "jamesmotter@usabaseball.com"
    },
    {
      "url": "https://www.usabaseball.com/about/staff",
      "email": "jamesvick@usabaseball.com"
    },
    {
      "url": "https://www.usabaseball.com/about/staff",
      "email": "jefffeltman@usabaseball.com"
    },
    {
      "url": "https://www.usabaseball.com/about/staff",
      "email": "jimkoerner@usabaseball.com"
    },
    {
      "url": "https://www.usabaseball.com/about/staff",
      "email": "jimmy.frush@learfield.com"
    },
    {
      "url": "https://www.usabaseball.com/about/staff",
      "email": "jordan.baker@learfield.com"
    },
    {
      "url": "https://www.usabaseball.com/about/staff",
      "email": "jordanbaker@usabaseball.com"
    },
    {
      "url": "https://www.usabaseball.com/about/staff",
      "email": "jordangrandison@usabaseball.com"
    },
    {
      "url": "https://www.usabaseball.com/about/staff",
      "email": "joshspitz@usabaseball.com"
    },
    {
      "url": "https://www.usabaseball.com/about/staff",
      "email": "kevinjones@usabaseball.com"
    },
    {
      "url": "https://www.usabaseball.com/about/staff",
      "email": "laurenkern@usabaseball.com"
    },
    {
      "url": "https://www.usabaseball.com/about/staff",
      "email": "lisabraxton@usabaseball.com"
    },
    {
      "url": "https://www.usabaseball.com/about/staff",
      "email": "lizziehattrich@usabaseball.com"
    },
    {
      "url": "https://www.usabaseball.com/about/staff",
      "email": "makenziekelly@usabaseball.com"
    },
    {
      "url": "https://www.usabaseball.com/about/staff",
      "email": "mannyportugal@usabaseball.com"
    },
    {
      "url": "https://www.usabaseball.com/about/staff",
      "email": "mariahvargas@usabaseball.com"
    },
    {
      "url": "https://www.usabaseball.com/about/staff",
      "email": "markjenkins@usabaseball.com"
    },
    {
      "url": "https://www.usabaseball.com/about/staff",
      "email": "markosullivan@usabaseball.com"
    },
    {
      "url": "https://www.usabaseball.com/about/staff",
      "email": "mediarelations@usabaseball.com"
    },
    {
      "url": "https://www.usabaseball.com/about/staff",
      "email": "parislapoint@usabaseball.com"
    },
    {
      "url": "https://www.usabaseball.com/about/staff",
      "email": "philipberger@usabaseball.com"
    },
    {
      "url": "https://www.usabaseball.com/about/staff",
      "email": "play@usabaseball.com"
    },
    {
      "url": "https://www.usabaseball.com/about/staff",
      "email": "raydarwin@usabaseball.com"
    },
    {
      "url": "https://www.usabaseball.com/about/staff",
      "email": "russellhartford@usabaseball.com"
    },
    {
      "url": "https://www.usabaseball.com/about/staff",
      "email": "samholder@usabaseball.com"
    },
    {
      "url": "https://www.usabaseball.com/about/staff",
      "email": "sarahwood@usabaseball.com"
    },
    {
      "url": "https://www.usabaseball.com/about/staff",
      "email": "taylorclayton@usabaseball.com"
    },
    {
      "url": "https://www.usabaseball.com/about/staff",
      "email": "tullyscott@usabaseball.com"
    },
    {
      "url": "https://www.usabaseball.com/about/staff",
      "email": "tylercollins@usabaseball.com"
    },
    {
      "url": "https://www.mainstreetdailynews.com/business/newberrys-champions-park-generates-11m-in-2021_id_1e285356-7421-11ec-b628-93a2f642ea0f",
      "email": "editor@mainstreetdailynews.com"
    }
  ],
  "mails": [
    "alexnash@usabaseball.com",
    "allisongupton@usabaseball.com",
    "ashleybratcher@usabaseball.com",
    "benkelley@usabaseball.com",
    "bradyoung@usabaseball.com",
    "brettcurll@usabaseball.com",
    "carringtonaustin@usabaseball.com",
    "carringtonnicholson@usabaseball.com",
    "cicelymclaughlin@usabaseball.com",
    "colebeeker@usabaseball.com",
    "davisperruccio@usabaseball.com",
    "develops@usabaseball.com",
    "drakesacenti@usabaseball.com",
    "editor@mainstreetdailynews.com",
    "ericcampbell@usabaseball.com",
    "hannahburrows@usabaseball.com",
    "info@usabaseball.com",
    "isaacbrown@usabaseball.com",
    "isaiahjones@usabaseball.com",
    "jadewilliams@usabaseball.com",
    "jamesmotter@usabaseball.com",
    "jamesvick@usabaseball.com",
    "jefffeltman@usabaseball.com",
    "jimkoerner@usabaseball.com",
    "jimmy.frush@learfield.com",
    "jordan.baker@learfield.com",
    "jordanbaker@usabaseball.com",
    "jordangrandison@usabaseball.com",
    "joshspitz@usabaseball.com",
    "kevinjones@usabaseball.com",
    "laurenkern@usabaseball.com",
    "lisabraxton@usabaseball.com",
    "lizziehattrich@usabaseball.com",
    "makenziekelly@usabaseball.com",
    "mannyportugal@usabaseball.com",
    "mariahvargas@usabaseball.com",
    "markjenkins@usabaseball.com",
    "markosullivan@usabaseball.com",
    "mediarelations@usabaseball.com",
    "parislapoint@usabaseball.com",
    "philipberger@usabaseball.com",
    "play@usabaseball.com",
    "raydarwin@usabaseball.com",
    "russellhartford@usabaseball.com",
    "samholder@usabaseball.com",
    "sarahwood@usabaseball.com",
    "taylorclayton@usabaseball.com",
    "tullyscott@usabaseball.com",
    "tylercollins@usabaseball.com"
  ],
  "nombre_sitio": "championsballpark.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.usabaseball.com/about/staff",
      "text": "Staff/Contact Us | USA Baseball Team USA WBC Home Schedule Roster Women's Home Schedule Roster Collegiate Home Schedule Roster 18U Home Schedule Roster 15U Home Schedule Roster 12U Home Schedule Roster History Alumni: Coaches/Admin Alumni: Players History Events 13U/14U Athlete Development 16U/17U NTDP Champs-Arizona Champs-North Carolina 10U/11U Futures Invitational NHSI NTIS Event Registration NTC Pipeline Prospect Development Pipeline Performance Assessments Resources Appalachian League DREAM Series Breakthrough Series Hank Aaron Invitational Girls Baseball Development Growth Baseball5 Coach Clinics Courses Fun At Bat Homegrown Clinics Kids Club Mobile Coach PLAY BALL Umpire Clinics Govern Governance Anti-Doping International Sanctions National Member Organizations Pitch Smart USABat About USABat FAQ Bat Advisory Committee Approved Bat List Approved Tee Ball List Decertified Bat List Tampering is Cheating 2025 USABat Guide Athlete Safety Report Abuse Ineligible List Background Checks BASE U.S. Center for SafeSport Resources & Policies About Awards & Honors Board of Directors Calendar Employment FAQ Golden Spikes Award Licensing Media Partners Staff/Contact Us Video Donate Foundation Home Foundation Overview Ways to Donate Break Barriers Amplify the Game Ignite a Passion About Us News Organizational and National Team News Features and Event Stories Shop Team USA Events NTC Pipeline Growth Govern USABat Athlete Safety About Donate News Shop Staff/Contact Us USA Baseball 280 Brooks Park Lane, Suite 200 Cary, NC 27519 Phone: (919) 474-8721 For information about USA Baseball, please email info@usabaseball.com .  \nInterested in playing for Team USA? Email play@usabaseball.com .  \nInterested in information about our USA Baseball Develops initiatives? Email develops@usabaseball.com . MEDIA INQUIRIES Email mediarelations@usabaseball.com for media inquiries, or you can find more information on our Media Services page. Latest News Team USA Pours It on Late, Beats Australia To Finish Pool Play Sweep Sampson’s Efficient Outing Leads U.S. to 10-0 Win Over China Team USA Remains Unbeaten With 9-3 Win Over Germany USA Baseball Mourns the Loss of Longtime Manager Davey Johnson More News EXECUTIVE LEADERSHIP Title Extension Email Paul Seiler Executive Director/CEO David Perkins COO Ray Darwin CFO 216 Email Ray ACCOUNTING & FINANCE Title Extension Email Cicely McLaughlin Director, Accounting & Finance 257 Email Cicely Lauren Kern Assistant Director, Accounting & Finance 276 Email Lauren ADMINISTRATION Title Extension Email Paris LaPoint Coordinator, Administration 241 Email Paris ATHLETE SAFETY Title Extension Email Lisa Braxton Director, Athlete Safety 243 Email Lisa Taylor Clayton Coordinator, Athlete Safety 238 Email Taylor BASEBALL OPERATIONS Title Extension Email Ashley Bratcher General Manager, National Teams 219 Email Ashley Eric Campbell General Manager, Collegiate & Professional National Teams 222 Email Eric Cole Beeker Director, 12U National Team 230 Email Cole Brett Curll Director, 18U National Team 218 Email Brett Ben Kelley Director, 15U National Team 229 Email Ben Jim Koerner Director, Player Development 231 Email Jim Mark O'Sullivan Director, Scouting 272 Email Mark Makenzie Kelly Assistant Director, Baseball Operations (Women's National Team) 224 Email Makenzie Jeff Feltman Assistant Director, Baseball Operations 273 Email Jeff Davis Perruccio Coordinator, Baseball Operations 268 Email Davis COMMUNICATIONS Title Extension Email ATHLETIC COMMUNICATIONS Lizzie Hattrich Director, Athletic Communications (Collegiate, Women's, Golden Spikes Award, NTIS) 255 Email Lizzie Josh Spitz Assistant Director, Athletic Communications (Professional, 18U, NHSI) 260 Email Josh Tully Scott Coordinator, Athletic Communications (12U, Futures Invitational, Baseball5, PDP) 271 Email Tully STRATEGIC COMMUNICATIONS Brad Young Senior Director, Strategic Communications 212 Email Brad DEVELOPMENT (FUNDRAISING) Title Extension Email Drake Sacenti Director, Development 277 Email Drake Jordan Baker Coordinator, Partnership & Donor Services 279 Email Jordan MARKETING & CREATIVE SERVICES Title Extension Email Kevin Jones Senior Director, Marketing 227 Email Kevin Mark Jenkins Director, Creative Services 259 Email Mark Isaiah Jones Assistant Director, Creative Services 262 Email Isaiah James Motter Coordinator, Creative Services 264 Email James Hannah Burrows Coordinator, Creative Services 281 Email Hannah NATIONAL TRAINING COMPLEX OPERATIONS Title Extension Email James Vick Senior Director, National Training Complex Operations 221 Email James Phil Berger Coordinator, National Training Complex Operations 265 Email Philip PARTNER & PLAYER RELATIONS Title Extension Email Allison Gupton Director, Partner & Player Relations 234 Email Allison RETAIL OPERATIONS Title Extension Email Carrington Austin Senior Director, Retail 240 Email Carrington Sam Holder Coordinator, Retail 263 Email Sam TECHNOLOGY & SPORT PERFORMANCE Title Extension Email Russell Hartford Senior Director, Technology 232 Email Russell Mariah Vargas Director, Technology Operations 239 Email Mariah Manny Portugal Assistant Director, Systems & Analytics 256 Email Manny Jade Williams Coordinator, PDP Operations 258 Email Jade Jordan Grandison Coordinator, Systems & Analytics 278 Email Jordan USA BASEBALL SPORTS PROPERTIES Title Extension Email Jimmy Frush General Manager, USA Baseball Sports Properties Email Jimmy Jordan Baker Coordinator, Partnership & Donor Services 279 Email Jordan YOUTH PROGRAMS & EDUCATION Title Extension Email Tyler Collins Senior Director, Youth Programs & Education 244 Email Tyler Jim Koerner Director, Player Development 231 Email Jim Sarah Wood Director, Education 220 Email Sarah Isaac Brown Coordinator, Youth Programs 269 Email Isaac Department Executive Leadership Accounting & Finance Administration Baseball Administration Baseball Operations Communications & Social Media Creative Services Development (Athlete Safety, Education) Development (Fundraising) Governance NTC Operations Retail Operations Sports Properties Technology & Sport Performance arrow-expand-633075 arrow-contract-633076 Executive Leadership Accounting & Finance Administration Baseball Administration Baseball Operations Communications & Social Media Creative Services Development (Athlete Safety, Education) Development (Fundraising) Governance & Strategy NTC Operations Retail Operations Sports Properties Technology & Sport Performance Executive Leadership accordion-contract-633077 accordion-expand-633078 Paul Seiler - Executive Director/CEO Paul V. Seiler assumed the duties of Executive Director/CEO of USA Baseball in October 2000, after previously serving the organization as Director of National Team Operations from 1997 to 1999 and in varying capacities since being hired in 1988. During Seiler's tenure as the Executive Director/CEO, USA Baseball has forged a long-term partnership with Major League Baseball, experienced unprecedented success in its amateur national teams, renewed its international friendship series with Cuba, and now fields seven national teams and hosts more than 100 nation-wide events. In 2000, Seiler worked closely with Major League Baseball, the MLB Players Association and the United States Olympic Paralympic Committee (USOPC) to help lead Team USA to its first Olympic gold medal at the Sydney Games. The Trenton, N.J., native was elected to the Executive Committee of the World Baseball Softball Confederation (WBSC) in 2017, and serves as the Second Vice Chairman for the WBSC’s Baseball Division. Seiler was also one of two technical delegates for baseball in the Athens 2004 Olympic Games and Beijing 2008 Olympic Games. Seiler holds a Bachelor of Science degree in biology (pre-med) from the University of Scranton where he played soccer for the nationally ranked Royals. Paul and his wife, Wendi live in Cary, N.C., with their son, Braden, and daughter, Abigail. accordion-contract-633079 accordion-expand-633080 David Perkins - Chief Operating Officer David Perkins is the Chief Operating Officer for USA Baseball, a position he has held since 2008. He is responsible for the ongoing business operations for the federation and works to further develop the organization's revenue opportunities through both on-field programs and marketing programs, which include USA Baseball's multiyear marketing partnership with Major League Baseball. He continues to oversee all marketing and sponsorship programs, including the organization's trading-card licensing program, which provides some of the trading-card industry's most high-profile products. Perkins joined USA Baseball in March 1998, first working on the organization's Junior Olympic Baseball Championships. The then-56-team tournament has grown into the annual USA Baseball 14U/15U/16U/17U National Team Championships in Arizona and North Carolina. Following his internship with the Junior Olympics, he was named director, merchandise and apparel sales, in 1999 and launched and assumed responsibility for USA Baseball's merchandise and retail programs. One year later, prior to the 2000 Olympic Games in Sydney, Perkins moved into the role of associate director of business development. In 2003, Perkins was promoted to director of marketing and licensing and was part of a five-person relocation committee that selected North Carolina's Triangle-area as the new home for USA Baseball. Following the organization's relocation, he was named the Chief Operating Officer. Under his guidance as the COO, he has headlined numerous successful endeavors. Perkins formalized the organization's internship program, which has seen more than 250 interns successfully complete the program and go on to full-time positions in sports or opportunities of higher education. Twenty-one of USA Baseball's current full-time employees were interns with the organization. He oversaw the development of the organization's ecommerce and digital media strategies, including multiple web site launches with Major League Baseball Advanced Media and Shopify, national television broadcasts on MLB Network, growth on social media platforms, and the creation of the organization's digital media department -- which is recognized as one of the top five most \"socialed\" National Governing Body sites. Perkins also developed and launched the USA Baseball Prospect Classic, an exhibition series between the USA Baseball Collegiate and 18U National Teams, which was broadcast nationally on MLB Network. Additionally, he oversaw the tour contact, venue relations and logistic for the 2013, 2015, 2017 and 2019 USA/Cuba International Friendship Series in the United States, which was the first time the teams have played on U.S. soil since 1996. More recently he guided the launch and branding of the USA Baseball bat licensing program – USABat – and he has been on the leadership team for the 2021 U-18 WBSC Baseball World Cup in Sarasota and Bradenton which will mark the first time the event has been hosted in the United States since 1995. Perkins graduated from the University of Arizona with a bachelor's of science degree in Finance with a concentration in International Business. Currently serving on the advisory board with the Greater Raleigh Sports Alliance (GRSA), he resides in Raleigh, N.C., with his wife, Liz, and sons, Lincoln and Dayton. accordion-contract-633081 accordion-expand-633082 Ray Darwin - Chief Financial Officer Ray Darwin serves as USA Baseball's Chief Financial Officer, responsible for the accounting, financial affairs and human resources for the organization, with a focus toward maximizing efficiency. In addition, Darwin assists in the planning, selection and administration of USA Baseball's various professional teams that participate in the World Baseball Classic and Olympic Games. Darwin started at USA Baseball as the media relations intern in 1997 before joining the organization full time in January 1998 as the Youth National Team Director (16U and 18U). Under his guidance, the USA Baseball 18U National Team program won four medals from 2004 to 2008 including the silver medal at the 2008 IBAF \"AAA\" World Junior Championships. From 1998 to 2003, the 16U National Team program compiled an overall record of 34-3 and won three consecutive IBAF \"AA\" World Youth Championships. Before joining USA Baseball, Darwin gained sports management experience working for the Texas Rangers and the University of Pennsylvania athletic department. Darwin holds a bachelor's degree in economics with a concentration in marketing from the Wharton School of Business at the University of Pennsylvania (1997) and has extended his education in accounting at North Carolina State University. He also completed the Major League Baseball Scouting Bureau's scout development program in 2000. Darwin lives in Raleigh, N.C., with his wife, Stacy, and two children, Miranda and Sam. arrow-up-633083 Back to Top Accounting & Finance accordion-contract-633084 accordion-expand-633085 Cicely McLaughlin - Director, Accounting & Finance Cicely McLaughlin serves as the Director, Accounting and Finance, for USA Baseball, overseeing the day-to-day financial needs of the federation. McLaughlin joined USA Baseball in 2013 as a coordinator of retail and finance. She was promoted to a full-time staff member, the Assistant Director, Accounting and Finance, in July 2013 before being promoted again in the fall of 2017. McLaughlin has a bachelor's degree from East Carolina University in Business Administration with a concentration in Accounting (2013). She competed on the Pirates' softball team as a utility player, helping the team to NCAA regional appearances in 2010 and 2011. She also received her master's degree in Accounting from North Carolina State University in 2015. She currently resides in Fuquay-Varina, N.C., with her sons, Caydien and Koda. email-633086 Email Cicely accordion-contract-633087 accordion-expand-633088 Lauren Kern - Assistant Director, Accounting & Finance Kern rejoined USA Baseball in 2023 as the Assistant Director of Accounting and Finance after initially interning in the accounting department in 2022. In this internship, Kern took on an assortment of responsibilities such as providing high level analysis of the organization’s finances, overseeing financial reconciliations for various USA Baseball events, and assisted in the design of the organization’s record keeping and internal accounting. In her current capacity, Kern serves to address the day-to-day financial needs of USA Baseball. Kern earned a bachelor’s of science degree in Accounting with a minor in Parks, Recreation and Tourism from North Carolina State University in 2023. She also obtained her Master’s degree in Accounting from NC State in May 2024. While pursuing her undergraduate degree, Kern not only served roles as the Secretary and Vice President of the NC State Women’s Club Basketball team, but participated as a player. In these positions Kern helped with various operational needs such as tournament planning and merchandise management. Kern currently resides in Raleigh, N.C. email-633089 Email Lauren arrow-up-633090 Back to Top Administration accordion-contract-633091 accordion-expand-633092 Paris LaPoint - Coordinator, Administration Paris LaPoint was named Coordinator, Administration in September 2024 after serving as Coordinator, Athlete Safety and Education since January 2023. LaPoint, who initially started as an Education Intern in February 2022, is responsible for managing USA Baseball's internship program in addition to assisting with other organizational administrative needs. Prior to her switch to Administration, LaPoint worked on the Athlete Safety team and focused on growing the BASE Organizational Compliance program, assisted with on-site compliance at events, and helped with educational resources such as the USA Baseball Develops Blog. As an intern, LaPoint assisted in building the USA Baseball Develops website and mobile app. She edited, published, and managed USA Baseball Develops Blog and social media content, assisted in the development of 27 free courses, and helped with on-site compliance at various tournaments. She also helped orchestrate COVID-19 safety policies and procedures at the WBSC U-18 Baseball World Cup in Bradenton and Sarasota, Fla. LaPoint has experience with the sports marketing practicum with the University of Iowa Sport and Recreation Management Agency. LaPoint graduated from the University of Iowa in 2022 with a bachelor's degree in communication studies and a minor in sport and recreation management. She currently resides in Apex, North Carolina. email-633093 Email Paris arrow-up-633094 Back to Top Baseball Administration accordion-contract-633095 accordion-expand-633096 Allison Gupton - Director, Baseball Administration Allison Gupton was promoted to Director of Baseball Administration in January of 2021 after serving as Assistant Director of Travel Services since November 2017. Gupton–who was named the 2024 WISE Greater Raleigh Woman to Watch, which is awarded to a rising star within the sports industry with less than ten years of experience who is passionate, innovative, and showcases a commitment to meaningful work–manages the administrative needs of the baseball operations department, leads various marketing and sponsorship programs for the organization, facilitates the organization’s annual awards and honors, inclusive of the Golden Spikes Award, and supports alumni relations. Gupton oversees the operation and administration of the Professional National Team, Collegiate National Team, and national team development programs. The Collegiate National Team annually sees great success against international opponents including Chinese Taipei and Japan. In addition to working on various marketing and sponsorship programs for USA Baseball, including the organization's trading-card licensing program–which provides some of the trading-card industry's most high-profile products–and the organization’s sports fuel provider. Gupton also works with partners and interested partners on licensing and intellectual property usage. Gupton assists with recognizing teams and players for their outstanding performance with USA Baseball. She works with ESPN and Chinook Seedery annually to host an award show for the Golden Spikes Award honoring the top amateur baseball player in the nation. Gupton manages the player identification process for the award with the Golden Spikes Award Advisory Board comprised of national baseball media, select professional baseball personnel, previous Golden Spikes Award winners, and select USA Baseball staff. Gupton initially worked as an hourly employee at the National Training Complex before joining USA Baseball as a Coordinator, Baseball Operations in May 2017. She was responsible for assisting with operations for the National Team Championships in Florida and with the 14U National Team Development Program. Before joining USA Baseball, Gupton worked for the Jacksonville Jaguars in ticket sales and member relations, as well as for the North Carolina State University football team as a recruiting intern. She graduated from North Carolina State University in May of 2018 with a bachelor's degree in Sport Management, as well as minors in Business Administration and Health. Gupton currently resides in Raleigh, North Carolina. email-633097 Email Allison accordion-contract-633098 accordion-expand-633099 Makenzie Kelly - Coordinator, Baseball Administration After initially joining USA Baseball as an intern in March 2022, Makenzie Kelly was named Coordinator, Baseball Administration in July 2022. She coordinates operations for the USA Baseball National High School Invitational and 16U/17U National Team Development Program. Kelly assists in the management of day-to-day office activities and staff outings, alumni relations, the Golden Spikes Award, Collegiate National Team, and more. In addition, Kelly serves as the main point of contact for all TrackMan operators at the National Training Complex. Kelly joined USA Baseball after serving on the marketing and matchday staff for the Columbus Crew. Kelly graduated from Ashland University in 2021, where she earned a BSBA in Marketing and Sport Management. She currently resides in Cary, N.C. email-633100 Email Makenzie arrow-up-633101 Back to Top Baseball Operations (National Teams & Events) accordion-contract-633102 accordion-expand-633103 Ashley Bratcher - General Manager, National Teams Ashley Bratcher was named the General Manager of National Teams in January 2023. In that role, Bratcher oversees and supports all three youth national team programs, the Women's National Team program, national team and athlete development programs, and national team identification events. Bratcher–who was named a 2023 WISE Greater Raleigh Woman of Inspiration–has helped lead Team USA to world championships at all three youth age groups, including the 12U National Team in 2023, the 15U National Team in 2018, and the 18U National Team in 2022. Bratcher was part of a pair of gold medals at the 12U level in 2023 as the stars and stripes claimed titles at the World Baseball Softball Confederation (WBSC) U-12 Baseball World Cup in Taiwan and the World Cup Qualifier in Mexico. Before her promotion to General Manager of National Teams, Bratcher served as the 18U National Team Program Director. Bratcher led the U.S. to a pair of gold medals in 2022, as the program won championships at both the WBSC U-18 Baseball World Cup and the WBSC U-18 Baseball World Cup Americas Qualifier. Bratcher previously served as the organization's Senior Director, Baseball Operations and was responsible for overseeing the general management of the USA Baseball 12U, 15U and Women's National Teams in that role. In addition to running three national team programs, she also oversaw the National Team Identification Series (NTIS), the National Team Championships and the 13U/14U Athlete Development Program (ADP). Under her guidance, the 15U National Team won its first-ever WBSC U-15 Baseball World Cup gold medal in 2018, as well as the program's second gold medal in a row at the COPABE Pan Am 'AA' Championships in 2017. In 2019, Bratcher led the 15U program to a gold medal in the WBSC U-15 Baseball World Cup Americas Qualifier, marking the program’s fifth overall and third consecutive gold medal. Bratcher first joined USA Baseball in April 2009 as an operations intern, working at camps and clinics and other events at the National Training Complex in Cary, N.C. She joined USA Baseball full time in October 2009 as the Director of Operations and the Women's National Team, managing all operational needs at the National Training Complex, USA Baseball camps and clinics and the Women's National Team program. Bratcher was promoted to Director, National Team Development Programs and Women's National Team, in December 2012, continuing oversight of the Women's National Team program and overseeing the USA Baseball National Team Championships - West, which grew to more than 230 teams and 4,000 participants. She was also responsible for the 14U and 17U National Team Development Programs. In January 2015, Bratcher organized the inaugural Women's National Open and led the USA Baseball Women's National Team to its first-ever Pan American Games gold medal. In 2019, the Women’s National Team won its first-ever COPABE Women's Pan-American Championships gold medal. Bratcher graduated from the University of North Carolina at Chapel Hill in May 2009 with a degree in exercise and sports science with a focus in sport administration. She also worked with the 21-time NCAA National Champion women's soccer program as both a team manager and camp administrator. Bratcher also completed the Major League Baseball Scouting Bureau’s scout development program in 2017. She currently resides in Durham, N.C., with her wife, Brittany. email-633104 Email Ashley accordion-contract-633105 accordion-expand-633106 Eric Campbell - General Manager, Collegiate & Professional National Teams Eric Campbell is USA Baseball's General Manager, Collegiate National Team and Professional Team. Campbell joined the USA Baseball staff in January 2000 as the primary administrator to the Junior National Team (now 18U program) after serving as a volunteer administrator at two United State Olympic Committee (USOC) Olympic Festivals and an administrator and coach to various USA Baseball teams and events. After four years, he was promoted to the General Manager position. In his 21 years at USA Baseball, Campbell has served as the primary or assistant team administrator for nearly 50 national teams. USA Baseball's Collegiate National Team won gold medals at the 2004, 2006 and 2008 FISU World Collegiate Championships, and he helped guide the 2008 U.S. Olympic Baseball Team to a bronze medal in Beijing. Campbell also served on the technical committee for the inaugural World Baseball Classic in 2006 and was the team leader for the 2009 squad. In 2007 and 2009, Campbell helped lead the U.S.A. to consecutive gold medals in the IBAF World Cup. Campbell has taken three national teams to the Pan American Games with silver medals in 2007, 2011 and 2015. Campbell played a vital role in the 2017 World Baseball Classic team claiming the U.S.'s first gold medal in the event. Campbell has guided national teams in the first two WBSC Premier 12 events. The Collegiate National Teams team competes each summer with traditional series vs. Taiwan, Japan and Cuba on an annual and/or bi-annual basis. Campbell helped lead Omaha Burke High School to the 1979 Nebraska state high school championship. As a player at Creighton from 1981-84, Campbell played a variety of positions and even played all nine positions in a college baseball game. After being drafted by the Chicago White Sox as a pitcher and catcher, Campbell was released from professional baseball in 1985 and began his coaching/administrative career. After serving nine years in assistant-coach roles at Creighton, St. Thomas University (Fla.) and the United States Air Force Academy (AFA), Campbell served as the head baseball coach at the AFA from 1995-98. Campbell has been fortunate to be mentored by baseball legends Paul Mainieri and Jim Hendry at the collegiate level. Campbell has worked for senior GM’s on national teams to include Sandy Alderson, Joe Torre, Bob Watson and Joe Garagiola, Jr. Campbell graduated from Creighton University in 1986 and currently resides in Raleigh, N.C., with his wife, the former Janette Bushyager, and two daughters, Tillie (North Carolina State University) and Lucy (Coastal Carolina University). email-633107 Email Eric accordion-contract-633108 accordion-expand-633109 Mark O'Sullivan - Scouting Director Mark O’Sullivan joined USA Baseball as the organization’s Scouting Coordinator in 2021 before being named Scouting Director in September 2022. In his role, O’Sullivan is responsible for scouting and evaluating players for selection to the 12U, 15U, 18U and Collegiate National Teams. He also leads the selection process for players that will take part in USA Baseball’s development programs, including the 13U/14U Athlete Development Program and the 16U/17U National Team Development Program. Additionally, O’Sullivan leads USA Baseball Task Force members at the National Team Championships in Arizona and North Carolina in identifying players for national teams and development programs. O’Sullivan also assists the 18U National Team staff in advance scouting during international competition, including the WBSC U-18 Baseball World Cup and World Cup Qualifiers. Prior to joining USA Baseball, O’Sullivan served as an area scout for seven years with the San Francisco Giants. In that role, he covered the Northeast region for four years and the Carolinas for three years, identifying and evaluating amateur prospects for the MLB Draft. He previously had assistant coaching positions at Louisburg College (NC) and Springfield College (MA) as well as the Duluth Huskies of the Northwoods League. O’Sullivan earned a bachelor’s degree in economics from Rollins College, where he played college baseball. After graduation, he was a 25th round draft choice of the Los Angeles Angels and spent five years pitching in their minor league system. He also earned a master’s degree in sports management from Springfield College. O’Sullivan currently resides in Durham, N.C., with his wife, Jocelyn, and son, Colin. email-633110 Email Mark accordion-contract-633111 accordion-expand-633112 Brett Curll - Director, 18U National Team Program Brett Curll was named 18U National Team Program Director in January 2023. Curll initially joined the USA Baseball organization as an Assistant Director of Baseball Operations in April 2018 and was promoted to Director of Baseball Operations in December of that same year. In his current role as 18U National Team Program Director, Curll manages all aspects of the 18U National Team program, including the 16U/17U National Team Development Program (NTDP). In his first year with the organization, Curll helped lead the 15U National Team to its first-ever World Baseball Softball Confederation (WBSC) U-15 Baseball World Cup gold medal. He helped guide the 18U National Team to two gold medals in a supporting role in 2022 as the program won both the WBSC U-18 Baseball World Cup and the WBSC U-18 Baseball World Cup Americas Qualifier. Curll came to USA Baseball via Aberdeen, Maryland, and Ripken Baseball where he was the Assistant Director of Amateur Baseball Operations. In his seven-year tenure with Ripken Baseball, he oversaw local tournaments and the organization's Chevy Camp Tour. After two years on the University of Maryland baseball team, Curll finished his collegiate playing career at Liberty University, where he earned his bachelor's degree in Sport Management in 2010. He currently resides in Fuquay-Varina, N.C., with his wife, Mariah, and son, Keegan. email-633113 Email Brett accordion-contract-633114 accordion-expand-633115 Ben Kelley - Director, 15U National Team Program After being named Assistant Director, Baseball Operations in November 2017 before a promotion to Director of Baseball Operations in December 2018, Ben Kelley was named 15U National Team Program Director in January 2023. In that role, he oversees all baseball operations associated with the USA Baseball 15U National Team, as well as its identification events. Kelley is responsible for the selection of the 15U National Team through the National Team Championships in both North Carolina and Arizona as well as the 13U/14U Athlete Development Program (ADP) and the National Team Identification Series (NTIS). In his latest stint as 15U National Team Program Director, Kelley managed all baseball operations concerning the team's involvement in the 2023 International Friendly Series held in the Dominican Republic. In the inaugural event, Kelley oversaw the U.S. squad in its undefeated, title-capturing run in which the stars and stripes went 5-0 and outscored opponents 47-5. In his previous role as Director of Baseball Operations, Kelley was responsible for the planning and execution of the annual National Team Championships Arizona, which includes tournament administration along with working onsite at the tournament facilities. Prior to his time with USA Baseball, Kelley worked with North Carolina State University Athletics Marketing, Wolfpack Sports Properties, the Holly Springs Salamanders and assisted with tournament operations for the Rex Hospital Open. He first joined the USA Baseball organization as a Coordinator, Operations in March 2017, assisting with day-to-day operations at the National Training Complex. This included facility maintenance, coordinating game-day logistics for USA Baseball events, and the staffing and scheduling of part-time workers at the National Training Complex. Kelley received a bachelor's degree of science in Sport Management from North Carolina State University in 2017 along with a minor in Coaching Education and Agricultural Business Management. He currently resides in Raleigh, N.C. email-633116 Email Ben accordion-contract-633117 accordion-expand-633118 Cole Beeker - Director, 12U National Team Program After initially serving as a Baseball Operations Intern for the 18U National Team in 2021, Cole Beeker re-joined USA Baseball in 2022 as Assistant Director, Baseball Operations before being promoted to 12U National Team Program Director in January 2023. In that role, he oversees all baseball operations associated with the USA Baseball 12U National Team, as well as its identification events. He is responsible for the selection of the 12U National Team through the 10U and 11U Futures Invitationals and National Team Identification Series (NTIS). Beeker brings a bevy of experience across multiple levels of baseball to the role. Most recently, he served as an Amateur Scouting Assistant for the Detroit Tigers. There, he assisted with the operation of the 2022 MLB Draft, which included the pre-draft workout, draft meetings, player video and player contract terms. He has also held roles as a Marketing and MLB Special Services Intern for Jet Sports Management and a Baseball Operations Intern for the Winston-Salem Dash. Beeker played college baseball at Swarthmore College–where he helped lead the program to the Division III College World Series in 2018–before spending a season as a graduate student at The George Washington University. He owns a bachelor’s degree in economics from Swarthmore College and a master’s degree in sports management from The George Washington University. Beeker currently resides in Apex, N.C.. email-633119 Email Cole accordion-contract-633120 accordion-expand-633121 Ann Claire Roberson - Director, Women's National Team accordion-contract-633122 accordion-expand-633123 Jim Koerner - Director, Player Development Jim Koerner joined USA Baseball as the Director of Player Development in 2021. In that role, he is responsible for developing on-field programming for USA Baseball’s six national teams and three national team development programs. He will also produce curriculums related to player development for USABDevelops.com, the organization’s free online educational resource center. Koerner runs the 13U/14U Athlete Development Program (ADP) and 16U/17U National Team Development Program (NTDP), a role he assumed in January 2023. The ADP and NTDP both serve as idenitifcation events for national team programming, while also providing the nation’s top athletes an opportunity to connect with USA Baseball coaches, task force and national team staff to better prepare for a future national team experience. Participants take part in skill development sessions, off-field educational seminars, and a series of intrasquad games to assist in the development of the athletes as both a player and a person. Additionally, Koerner helps run the Prospect Development Pipeline (PDP) Premier Winter Camps in the offseason, which give the top players in the nation the chance to continue within USA Baseball programming while learning from the best coaches in the nation. The camp is offered to both men and women. Koerner was the head coach at North Carolina Central University (NCCU) from 2011-21. As just the second head coach in the program’s modern-day history, Koerner took NCCU baseball to new heights in his 10 years at the helm, culminating with a Mid-Eastern Athletic Conference (MEAC) Southern Division Championship, and MEAC Coach of the Year recognition during the 2021 season. Under his guidance, the Eagles set the school record for wins twice, in 2013 (27) and again in 2018 (28). He also coached seven MLB Draft picks or free agent signees with NCCU, including 12th round selection Corey Joyce, 28th round selection Andrew Vernon, and Austin Vernon, who became the highest player drafted in program history when he was taken in the 10th round by the Tampa Bay Rays in 2021. Koerner helped lead NCCU’s transition to the NCAA Division I level in the Mid-Eastern Athletic Conference during the 2011-2012 season and has since coached 39 All-MEAC selections, including the 2014, 2017, 2019 and 2021 MEAC Rookies of the Year, the 2018 and 2019 MEAC Players of the Year, and the 2021 MEAC Pitcher of the Year. Before his time at NCCU, Koerner was an assistant coach and recruiting coordinator at the University of Buffalo from 2007-2011, helping the Bulls reach their best offensive performances in program history in 2009 and 2010. The team recorded an all-time high in wins since 1999 during the 2009 season and set the records for team batting average (.312), home runs (46) and stolen bases (71) in 2010. In those two seasons combined, the Bulls broke over 25 season, career, team, and individual records. He began his coaching career in 2001 as the head coach at Medaille College, where he helped found the program and was named the 2003 North Eastern Athletic Conference Coach of the Year. In 2004, he moved to the Division I ranks as an assistant coach at Monmouth University before taking the assistant coach and recruiting coordinator role at Marshall University from 2005-2006. During that time, Marshall ranked highly among NCAA teams in most offensive categories and Koerner helped Adam Frederick break the program’s all-time hits record (250) while also recruiting and signing several of the Top 100 rated players in the Northeast. Koerner received his bachelor’s degree in economics in 1997 from St. John Fisher College (N.Y.) and a master’s degree in athletic administration from Marshall University. Koerner currently resides in Durham, N.C., with his wife, Kylie, and two children, Sam and Elizabeth. email-633124 Email Jim accordion-contract-633125 accordion-expand-633126 Jeff Feltman - Coordinator, Baseball Operations Jeff Feltman joined USA Baseball in the summer of 2022 as an Intern, Baseball Operations before being named Coordinator, Baseball Operations in November 2022. In his role, Feltman assists with all baseball operations duties pertaining to the National Team Championships Arizona in addition to the National Team Identification Series (NTIS). Before joining USA Baseball, Feltman spent four years as a student manager for the Stetson Hatters baseball program. He assisted in many aspects on the program including practice and gameday operations, analytics, travel, meals, and compiance. Feltman also served as a Baseball Operations Intern for the Appalachian League’s Bristol State Liners in 2021 before working as a Baseball Operations Intern for USA Baseball in 2022, where his main responsibilities were the National Team Championships Arizona and both USA Baseball development programs. He also assisted at 15U National Team Training Camp in Tempe, Arizona, and at the WBSC U-18 Baseball World Cup in Sarasota, Florida. Feltman currently lives in Cary, North Carolina. email-633127 Email Jeff arrow-up-633128 Back to Top Communications & Social Media accordion-contract-633129 accordion-expand-633130 Lizzie Hattrich - Director, Communications Lizzie Hattrich joined USA Baseball in June of 2022 and currently serves as Director, Communications. In this role, she manages USA Baseball's day-to-day internal communications needs, including press box operations, copyediting press releases and content, as well as its external communications needs. Additionally, Lizzie is responsible for executing USA Baseball's e-news plan as well as participant communication in event. She helps develop, plan, execute and manage the organization's content calendar for USABaseball.com, social media channels, e-news and other platforms as needed. Hattrich came to USA Baseball after spending eight years at North Carolina State University in the athletic communications department. Most recently, she served as the primary contact for the baseball, women's soccer, and women's golf programs. Hattrich was a student-athlete at UNC-Pembroke, where she played golf and won the PBC Championship in 2014. She earned a degree in Mass Communication/Media Studies - Journalism and Public Relations. Hattrich currently resides in Raleigh with her husband, Brantley, and son, Bobby. email-633131 Email Lizzie accordion-contract-633132 accordion-expand-633133 Josh Spitz - Assistant Director, Communications Josh Spitz joined USA Baseball in July 2021 as Coordinator, Media Relations and was promoted to Assistant Director, Communications in January 2023. Spitz assists with media relations and communications for the organization, including USA Baseball's national teams and programs. Originally from Cortlandt Manor, New York, Spitz graduated from Stony Brook University in May 2021 with a degree in journalism. During his time at Stony Brook, he worked in the Athletic Communications Office, serving as sports information director for several sports. Spitz has previously held internships with Major League Baseball and the Metropolitan Golf Association. He currently resides in Durham, N.C. email-633134 Email Josh accordion-contract-633135 accordion-expand-633136 Alex Nash - Director, Social Media Alex Nash joined USA Baseball in July 2022 as Director, Social Media. In his role, Nash is responsible for developing and implementing USA Baseball’s social media strategy through day-to-day social messaging and large-scale campaigns in support of the brand. He oversees all organic and paid social media campaigns while increasing brand recognition and awareness. Prior to joining USA Baseball, Nash served as the Communications and Social Media Manager for the Fiesta Bowl Organization in Scottsdale, Ariz. Previously, he has held roles as a Sports Information Director and Graduate Assistant at Grand Canyon University, Operations Manager and Producer at Skyview Satellite Networks as well as Media Relations Assistant for the Arizona Cardinals, Los Angeles Dodgers and Arizona State University. Nash also served as Arizona State University's mascot, Sparky the Sun Devil for four years as an undergrad. Nash graduated from Arizona State University in 2015 with a bachelor’s degree in communications and media analysis. He also owns a master’s degree in sports management from Grand Canyon University. Nash currently lives in Garner, N.C., with his wife, Rachel. email-633137 Email Alex accordion-contract-633138 accordion-expand-633139 Tully Scott - Coordinator, Communications and Social Media email-633140 Email Tully arrow-up-633141 Back to Top Creative Services accordion-contract-633142 accordion-expand-633143 Kevin Jones - Director, Brand Kevin Jones returned to USA Baseball as the Director, Digital Media, in January 2017 before being named Director, Brand in January 2023. In his current role, Jones oversees and develops the identity of USA Baseball in an expanding digital landscape. Jones started with the organization in April 2012 as the Coordinator, Multimedia, before being hired full-time in November of that year as the Director, Digital and Social Media. At that time, he was responsible for creating video highlights and packages, as well as all graphic design for USA Baseball. Prior to joining USA Baseball, he worked as a student manager for the North Carolina State baseball team in 2009 and served as the production intern for CanesVision with the Carolina Hurricanes during the 2011-12 season. Jones graduated with a bachelor's degree in Communication (Media) from North Carolina State University in 2012. He currently resides in Holly Springs, N.C., with his wife, Catherine. email-633144 Email Kevin accordion-contract-633145 accordion-expand-633146 Mark Jenkins - Director, Creative Services Mark Jenkins joined USA Baseball in April 2021 as Assistant Director, Creative Services before being promoted to Director, Creative Services in January 2023. In this role, Jenkins oversees the creative services department and works with graphic design, photography, and videography to create content for USA Baseball to help further establish its brand. Prior to joining the organization, Jenkins worked as the Assistant Director for Creative Media for SMU Football where he was responsible for all graphic design for the program, including internal, social, recruiting and print. Additionally, he helped shoot and edit video as well as photography for practices and recruiting visits. He received his bachelor’s degree in Sports Management from the University of Memphis in 2018 where he was a student manager and creative intern for the football team. He currently resides in Cary, N.C. email-633147 Email Mark accordion-contract-633148 accordion-expand-633149 James Motter - Coordinator, Creative Services After fulfilling an internship with USA Baseball in 2021, Motter returned in 2023 and currently serves as Creative Services Coordinator. In this role, he captures photography and produces footage for USA Baseball national teams, tournaments and related programs. Motter also assists in developing creative interns over the summer and during their time with USA Baseball. Motter started his tenure at USA Baseball as a video production intern in 2021 where he captured and produced a variety of film work including highlight videos, tournament recaps and interviews. Motter graduated from the University of South Carolina with a bachelor’s degree in Visual Communications with a Concentration in Sports Media. Motter began working with the athletics department as a freshman, where he helped produce photo and video content for Gamecock Athletics. As a Junior, Motter took on a lead role in developing creative content for the baseball team, in this role, he helped develop department wide content plans and served as the baseball team’s primary content creator. He currently resides in Raleigh, N.C. email-633150 Email James accordion-contract-633151 accordion-expand-633152 Isaiah Jones - Coordinator, Creative Services email-633153 Email Isaiah arrow-up-633154 Back to Top Development (Athlete Safety, Education) accordion-contract-633155 accordion-expand-633156 Andrew Bartman - Director, Coaching Development Andrew Bartman joined the USA Baseball Staff in March 2019 at the Director of Coaching Development. Bartman is in charge of developing coaching resources and working with the Develops team to assess and grow the organization's coaching education offerings. He also manages the Coaches Clinics program, growing the free Community Clinics program to include both in-person and virtual events that are attended by thousands of coaches each year. Bartman launched the Regional Clinics program in December of 2019, where USA Baseball partners with MLB clubs to host two-day coaching immersion events with high level presenters at MLB ballparks. Prior to joining USA Baseball, Bartman was the Youth Division Liaison at the American Baseball Coaches Association (ABCA) for two years. While there, he coordinated Community Clinics and manager the Youth Clinics at the organization's national convention. He also served as a baseball coach at the collegiate level for 12 years. Bartman graduated with a Bachelor's Degree in Physical Education from MacMurray College in 2006 before earning his Master's Degree in Sports Management from American Public University in 2011. He currently lives in High Point, N.C., with his wife, Nicole, and their two daughters, Kendall and Micah, along with acting as a foster parent when the need arises. email-633157 Email Andrew accordion-contract-633158 accordion-expand-633159 Lisa Braxton - Director, Athlete Safety Lisa Braxton joined USA Baseball in January 2020 as the Director of Pure Baseball. The Pure Baseball program was rebranded in 2021 to BASE (Baseball Athlete Safety Education). In March 2021 she became Assistant Director, Athlete Safety. She was promoted to Director, Athlete Safety in January 2023. Prior to her time at USA Baseball, Braxton spent nearly a decade at soccer.com in Hillsborough, North Carolina, managing team sales, marketing, and institutional and club business. She also worked for two years as an intern for the NCAA. She earned an associate degree in Physical Education from Mitchell College in 2005. Lisa graduated from Mitchell College in 2007 with a bachelor's degree in Sport Management and then again from the College of Notre Dame of Maryland in 2009 with a master's degree in Management. email-633160 Email Lisa accordion-contract-633161 accordion-expand-633162 Tyler Collins - Director, Youth Programs Tyler Collins was named Director of Youth Programs at USA Baseball in January 2017 where his primary responsibility is overseeing the Fun At Bat program. The program is part of the PLAY BALL initiative and is an introductory level bat-and-ball program for kids with an emphasis on character development, functional movement, literacy, active play and fun delivered through elementary physical education. Since Collins has taken over the Fun At Bat program, it has grown exponentially, reaching more than three million students in all 50 states, Washington, D.C., and internationally. Collins managed the NFL FLAG program at USA Football prior to joining USA Baseball. During his nearly five years with USA Football, he worked on a number of youth football initiatives and played an integral role in increasing the participation in the NFL FLAG program from an estimated 150,000 participants in 2011 to over 370,000 in 2016. In addition to growing the flag football landscape in the U.S., he managed a number of annual youth flag football tournaments held at NFL team facilities, as well as national championship events held in collaboration with NFL jewel events such as the Super Bowl, Pro Bowl and NFL Draft. He received his bachelor's degree in Sport Administration in 2011 from Ball State University. Collins currently resides in Apex, N.C., with his wife, Nina, stepdaughter, Abby Kate, and son, Quinn. email-633163 Email Tyler accordion-contract-633164 accordion-expand-633165 Sarah Wood - Director, Education Sarah Wood was promoted to the role of Director, Education in January 2024, after serving as Assistant Director since 2021. In this role, she assists in the improvement of the amateur programming experience, including increasing participation rate and improving player safety within the game. She also aids in the creation and maintenance of all educational initiatives, such as online education courses, Coach, Umpire, and Parent Certification Pathways, the American Development Model (ADM), the High School and Youth Baseball Manuals, the USA Baseball Develops Blog, drills and practice planning, and the USA Baseball app. In addition, she oversees the Pitch Smart Compliance Program and is responsible for researching and analyzing existing educational trends throughout the sports industry. Wood initially began working with USA Baseball in January 2020 as the Educational Resources Intern. During her internship, she helped launch USA Baseball Develops, aiming to grow the game through youth programs, player development, and safety and educational initiatives. Wood graduated from UNC Wilmington in 2019 with a bachelor's degree in exercise science and a minor in psychology. She then graduated from Western Carolina with a master's degree in sport management. Wood currently lives in Raleigh, N.C., with her husband, Cory. email-633166 Email Sarah accordion-contract-633167 accordion-expand-633168 Taylor Clayton - Coordinator, Athlete Safety Taylor Clayton joined USA Baseball in March 2022 as Coordinator, Athlete Safety. In that role, Clayton assists the Senior Director of Athlete Safety and Education in ensuring all adult participants for USA Baseball events are SafeSport compliant. Additionally, she serves as the primary lead for event compliance tracking and on-site check-ins. Prior to joining USA Baseball, Taylor worked as a behavioral therapist serving families with autism. Previously, she worked as a youth sports coordinator for the YMCA of Middle Tennessee while coaching diving. She was also a member of the Illinois State women's swimming and diving team and a graduate assistant coach for Western Illinois men's and women's swimming and diving teams. Clayton earned a bachelor’s degree in Psychology from Illinois State University, and also has a master’s degree in Sport Management from Western Illinois University. In addition, Clayton owns a master’s degree in Education in Human Development Studies from Vanderbilt University, graduating in December 2022. Taylor currently resides in Cary, N.C. email-633169 Email Taylor accordion-contract-633170 accordion-expand-633171 Isaac Brown - Coordinator, Youth Programs After initially starting at USA Baseball as an intern, Isaac Brown was promoted to Coordinator, Youth Programs in January 2024. Brown is responsible for assisting with the Fun At Bat Program, which is part of the PLAY BALL initiative and is an introductory level bat-and-ball program for kids with an emphasis on character development, functional movement, literacy, active play and fun delivered through elementary physical education. Brown is also tasked with the development of USA Baseball's mascot, Freedom, as well as other initiatives throughout USA Baseball's youth programs. As an intern, Brown helped grow the Fun At Bat program through outreach to boys and girls clubs, elementary schools and youth leagues across the country. He also assisted in the planning and execution of Homegrown events with USA Baseball alumni Max Clark, Michael Cuddyer and Curtis Granderson. In addition, Brown was the lead USA Baseball representative for the New York Mets First Annual Youth Camp. Prior to joining USA Baseball, Brown was a hospitality leader, team leader, and Tarheel Ambassador for UNC Athletics Event Management. He also worked with the PGA Tour to assist in putting on the REX Open on the Korn Ferry Tour. Brown graduated from UNC Chapel Hill in 2023 with a bachelor's degree in sport administration and a minor in religious studies. email-633172 Email Isaac arrow-up-633173 Back to Top Development (Fundraising) accordion-contract-633174 accordion-expand-633175 Drake Sacenti - Director, Development Drake Sacenti joined USA Baseball in April 2024 as the organization’s Director of Development. Sacenti is responsible for developing and managing all of USA Baseball’s fundraising programs. He also focuses on building and enhancing relationships with existing and potential donors as well as all those who care about the game of baseball at the amateur level nationally. Prior to joining USA Baseball, Sacenti served as the Associate Athletic Director for Development at the University of Houston. While at Houston, Drake launched a $150 million fundraising campaign in support of UH moving to the Big 12. Previously, he worked at the University of Nevada, Reno and Oregon State University in athletics fundraising roles. Sacenti graduated from the University of Nevada, Reno with a bachelor’s degree in accounting and finance in 2016 before getting his master’s in sport administration from Ohio University  in 2018. Sacenti currently resides in Raleigh, North Carolina. email-633176 Email Drake arrow-up-633177 Back to Top Governance & Strategy accordion-contract-633178 accordion-expand-633179 Brad Young - Senior Director, Governance & Strategy After initially joining the organization in a full-time capacity in 2016, Brad Young was named the Senior Director of Governance & Strategy for USA Baseball in 2023. In this role, Young serves as a compliance manager, overseeing adherence to United States Olympic & Paralympic Committee (USOPC) standards for national governing bodies. He aids in policy development and maintenance, and crafts new policies for the organization. Additionally, Young is responsible for developing and implementing strategies for the organization, both internally and in collaboration with third-party entities, while also overseeing the creation and upkeep of the organization's official Strategic Plan. Young originially joined USA Baseball as the Director of Communications and National Team Travel in January of 2016 and was later promoted to Senior Director of Communications (formerly Media Relations) in August of 2019. In that role, Young was responsible for the organization's internal and external communications, and media and public relations. Young also oversaw the Communications and Creative Services departments, and was the primary media contact for the Professional National Team and the Golden Spikes Award. Young first joined the organization in a joint internship between USA Baseball and the International Baseball Federation (IBAF) in May of 2008. During this time, he served as the on-site media contact for Field 2 of the Wukesong Olympic Baseball Complex at the Beijing 2008 Olympic Games and later served as a USA Baseball press officer for the the gold medal-winning 2008 14U National Team, the 2009 College National Team and the gold medal-winning 2009 USA Baseball World Cup Team. He also simultaneously served as the baseball operations coordinator during his 2009 tours with the Collegiate National and World Cup Teams. Before rejoining USA Baseball, Young worked for the Falls Church City Public Schools district in Falls Church, Va. Young graduated with a bachelor's degree in Communication Studies with a concentration in Organizational and Interpersonal Communications from the University of North Carolina at Chapel Hill in 2008. During his undergraduate career, he worked within the Office of Athletic Communications, serving as a student assistant for women's tennis and wrestling, as well as working closely with the baseball, field hockey and soccer teams. Young currently resides in Apex, N.C. email-633180 Email Brad arrow-up-633181 Back to Top National Training Complex Operations accordion-contract-633182 accordion-expand-633183 James Vick - Senior Director, National Training Complex Operations James Vick currently serves as the Senior Director, National Training Complex (NTC) Operations, for USA Baseball. In this role he is responsible for the day-to-day operations, field scheduling and maintenance of game-day logistics for the organization’s official training complex in Cary, N.C. Additionally, he is the national governing body’s project manager for Phase II development at the NTC which includes the construction of USA Baseball’s national headquarters and high performance training center. Vick began with USA Baseball as a coordinator in 2012 and 2013. In 2012, he worked with the National Team Championships in Arizona, while in 2013, he oversaw National Training Complex operations. He was named the Assistant Director of Operations in 2014 before being promoted to Director, NTC Operations and then Senior Director, National Training Complex Operations in September of 2020. Vick has a bachelor's degree in Sports Management from North Carolina State University. He currently resides in Apex, N.C., with his wife, Chelsea, and son, James. email-633184 Email James accordion-contract-633185 accordion-expand-633186 Phil Berger - Coordinator, National Training Complex Operations Berger returned to USA Baseball as National Training Complex Operations Coordinator after initially serving as a NTC Operations intern in the summer of 2023. In his current role, Berger assists in the field scheduling and day-to-day operations at the NTC. Berger graduated with a bachelor’s degree of science in Business Administration from William Peace University where he also played baseball and helped lead the Pacers to three straight conference tournament appearances. There, he also interned with the athletic department before joining USA Baseball. Berger currently resides in Hillsborough, N.C. email-633187 Email Phil arrow-up-633188 Back to Top Retail Operations (USA Baseball Shop) accordion-contract-633189 accordion-expand-633190 Carrington Austin - Senior Director, Retail Carrington Austin was named USA Baseball's first-ever Director, Retail, in May 2013 before being named Senior Director, Retail, in January 2017. In that role, her responsibilities involve the management of the USA Baseball online shop and fulfillment center in Durham, North Carolina. Austin initially joined USA Baseball as a licensing and retail coordinator in April 2012. During her time as a coordinator, Austin's responsibilities included managing merchandise at the 15U East National Team Championships in Florida and working in the USA Baseball Team Store in Cary, North Carolina. She recently led the launch of the new USABaseballShop.com in November 2015. Austin graduated from North Carolina State University in May 2013 with a bachelor's degree in business administration with a concentration in finance. While at NC State, she spent time working with University Recreation in the event-planning department. She currently resides in Apex, N.C. email-633191 Email Carrington arrow-up-633192 Back to Top Sports Properties (Sponsorship Opportunities) accordion-contract-633193 accordion-expand-633194 Jimmy Frush - General Manager, USA Baseball Sports Properties Jimmy Frush joined USA Baseball as the General Manager of Sports Properties in February of 2020. His responsibilities include developing and managing sponsor relationships with brands looking to align with USA Baseball, its events and programming. Prior to joining USA Baseball, Frush served the American Baseball Coaches Association (ABCA) as Assistant Executive Director, Corporate Partnerships. During his time at the ABCA, total sponsorship revenue increased by 63%, with new benchmarks set in annual sponsorship revenue, number of official partners and overall sponsorship participation. Previously, he worked at Texas A&M University-Corpus Christi as the Associate Athletics Director for External Development. In that role, he directed all fundraising activities of the Islander Athletic Fund while supervising the areas of athletics marketing, corporate sponsorships, ticket sales/operations and communications. His 16+ year professional career also includes leadership roles at Belmont University, SMU and Texas Tech University. As an undergraduate at Texas Tech University, Frush was a pitcher on the baseball team from 1994-1997 where he earned All-Southwest Conference First Team and Academic All-America First Team honors. He currently ranks in the top ten in the program in career appearances, wins, strikeouts and saves and was selected in the 19th round of the 1997 MLB First-Year Player Draft by the Philadelphia Phillies. He graduated from Texas Tech in 1997 with a Bachelor’s Degree in History before earning a Master’s Degree in Sports Management from Texas Tech in 2002. Frush currently resides in Cary, N.C. email-633195 Email Jimmy accordion-contract-633196 accordion-expand-633197 Jordan Baker - Coordinator, Partnership & Donor Services Jordan Baker joined USA Baseball in July 2024 as Coordinator, Partnership and Donor Services. In this role, Baker is responsible for activating corporate partnership elements to ensure an enjoyable game day experience for USA Baseball partners and fans, and assisting with the organization's fundraising initiatives. Baker graduated from East Carolina University in 2024 with a B.S. in Communications and a Minor in Sports Studies. While at ECU, she interned with the Athletics Marketing and Fan Engagement department and also the ECU Sports Properties team, gaining experience in marketing, client services, social media brand development, communications, and event photography. Baker currently resides in Cary, North Carolina. email-633198 Email Jordan arrow-up-633199 Back to Top Technology & Sport Performance (PDP Performance Evaluations) accordion-contract-633200 accordion-expand-633201 Russell Hartford - Senior Director, Technology Russell Hartford was named Senior Director, Technology, in May 2020. He is responsible for the administration of USA Baseball's technology partnerships as well as the organization’s bat licensing program (USABat). Prior to taking on his current role, he served as Director, National Team Championships from 2015-16 and Director, USABat Program from 2017-20. Hartford first joined USA Baseball as Coordinator, National Team Championships, in 2015. During his internship, he was responsible for the championships but also worked with the 15U National Team as an operations assistant. In November 2015, he was hired full time as the Director, National Team Championships, and was responsible for the annual USA Baseball National Team Championships held in Peoria, Ariz., and the 17U National Team Development Program. Prior to joining USA Baseball, he worked in residential construction as a site manager for Silverwood, Inc. Hartford earned a bachelor's of science degree in sport and event management from Elon University in 2014. He currently resides in Durham, N.C. email-633202 Email Russell accordion-contract-633203 accordion-expand-633204 Manny Portugal - Coordinator, Systems and Analytics After initially serving as a PDP Operations Intern in 2022, Portugal re-joined USA Baseball in 2023 as PDP Operations Coordinator before being named Coordinator, Systems and Analytics. In this role, he organizes USA Baseball Player Development Pipeline (PDP) events and facilitates the day-to-day planning of the PDP program. This program serves high school prospects in their development as athletes and educated individuals utilizing development sessions, gameplay, and educational seminars. Portugal has a dual bachelor's degree in Sports Administration and Political Science from the University of North Carolina at Chapel Hill. There, he also served as a four-year student manager for the baseball team. He currently resides in Raleigh, N.C. email-633205 Email Manny accordion-contract-633206 accordion-expand-633207 Mariah Vargas - Director, Technology Operations After first joining USA Baseball as a Prospect Development Pipeline (PDP) intern in 2021, Mariah Vargas joined the organization in a full-time capacity as Coordinator, Baseball Technology in 2022. She was promoted to Director, Technology Operations in January 2024. In that role, Vargas assists in all PDP-related events and helps evaluate athletes through on-site activations while collecting and analyzing performance data. Additionally, Vargas provides organizational and administrative support for all USA Baseball programming with a primary focus on the USABat program. Vargas graduated from the University of North Carolina at Chapel Hill in 2022 with a bachelor's degree in exercise and sport science. email-633208 Email Mariah accordion-contract-633209 accordion-expand-633210 Jade Williams - Coordinator, PDP Operations Williams rejoined USA Baseball after initially serving two stints as a Prospect Development Pipeline (PDP) intern in 2021 and 2022. Williams now serves as the Coordinator of PDP Operations where she plays a pivotal role in managing various aspects of the PDP testing program. Her current role involves close collaboration with MLB Develops, particularly covering joint events at the Jackie Robinson Training Complex in Vero Beach. Recently, Williams became responsible for overseeing the PDP operations intern screening process, as well as organizing equipment and technology for USAB-sponsored events. Additionally, Williams travels across the country, conducting PDP assessments and collecting on-field data for top prospects. Prior to USA Baseball, Williams attended Catawba College where she was a double-major, earning bachelor of science degrees in both Psychology and Sport Management in 2022. She also obtained her master’s degree in Sport Management from Catawba College in 2023. While pursuing her undergraduate degree, Williams was a student-athlete as she played women’s lacrosse. Outside of lacrosse, Williams held various positions within Catawba’s athletic department including roles with the football team and as a graduate assistant in 2022. Williams is currently enrolled at North Carolina Central University where she is a student in the licensed clinical mental health counseling graduate program. Williams currently resides in Raleigh, North Carolina. email-633211 Email Jade arrow-up-633212 Back to Top Terms of Use Privacy Policy Media Services Copyright © 2025"
    },
    {
      "url": "https://www.mainstreetdailynews.com/business/newberrys-champions-park-generates-11m-in-2021_id_1e285356-7421-11ec-b628-93a2f642ea0f",
      "text": "Newberry's Champions Park generates $11M in 2021 Skip to content Become a Member Become a Member Home Jobs 27 News All News Local News Business Government + Politics Elections Covid-19 Education Health Crime National News Sports All Sports News All Area Teams Athlete of the Week Local Sports Sports Live Stream High School Scoreboard The Prep Zone Local Living Food + Drink Citizens of the Month All Local Living Events Outdoors History Florida Finds Faith + Inspiration Obituaries Legals Browse Notices Place Notices Video Help Marketplace Cars For Sale Keepsakes About About Us Meet the Team Advertise Become A Member Careers Contact E-Edition Print edition locations Newspaper Delivery Search Jobs 27 News Local News Business Government + Politics Elections Education Covid-19 Health Crime National News Sports All Area Teams Athlete of the Week Sports Live Stream High School Scoreboard The Prep Zone Local Living Food + Drink Citizens of the Month Events Outdoors Health Faith + Inspiration History Florida Finds Obits Legals Browse Notices Place Notices Video Help Marketplace Cars For Sale Keepsakes About Us Meet the Team Advertise Become A Member Careers Contact E-Edition Print Edition Locations Newspaper Delivery Menu Jobs 27 Events News Sports Obits Cars close Get Our Free Newsletter Business Newberry’s Champions Park generates $11M in 2021 Suzette Cook Jan 12, 2022 10:26 pm Newberry turned into a mecca for softball and baseball tournaments in 2021, drawing thousands of people to the area and generating more than $11 million in revenue. Richard Blalock, CEO and president of RADDSPORTS, and manager of the 16-field Champions Park, presented the numbers to the Newberry Commission at Tuesday night’s meeting. According to Blalock, Champions Park hosted 23 weekend and multi-day events involving 1,029 teams. Become A Member Mainstreet does not have a paywall, but pavement-pounding journalism is not free. Join your neighbors who make this vital work possible. See Member Benefits “One of the main focuses was to go after two, three, four-day events,” Blalock said. “We accomplished that.” Blalock reported that during showcases and camps, 150 colleges came to Newberry, representing every SEC and ACC school, along with most of the Big 10 universities, Arizona, Arizona State and the University of Washington. “The University of Washington coach told me on that Saturday morning that when the COVID restrictions were lifted on D1 schools on that Friday, he knew he was going to get on a plane and go somewhere in the country to watch softball, and he ended up in Newberry, Florida, from Spokane, Washington. He offered two scholarships during that event.” Blalock reported that 42,932 people used Champions Park in 2021. He broke down the number to 6,179 out of state, 28,822 out of county and 7,931 from Alachua County. The impact of that activity resulted in $2,093,829 in sales of 15,142 hotel room nights. More than $1.86 million of that was in direct room sales, which raised $93,474 in bed tax and $130,866 sales tax. Blalock also reported an estimate of $9.28 million in indirect sales, which includes restaurant revenue, gas sales and other purchases made by travelers. A typical adult from out of state spends $210 a day. In a three-year review of operations since Blalock took over managing the park, he reported that 2,520 teams used the fields. A total of 101,817 people came through the park in that time, including 15 percent out of state, 67 percent out of county, and 18 percent local. “Out of state and out of county add up to most generating bed tax,” he said. “More than 40,000 stay in hotels generating $4.28 million in hotel revenue.” The park visitors filled 32,248 rooms in three years and the $4.28 million in room sales generated $281,000 in sales tax and $200,000 in bed tax collection. “For a total $4.5 million direct impact to hotels in Alachua County,” Blalock reported, adding that the indirect impact for the last three years is more than $21 million. Blalock said the Gainesville Sports Commission paid $114,000 over three years and that money delivered a high return on investment of $192 per dollar. “I think investors would be pretty happy with those returns on their investment,” he said. “The park is doing exactly what it was supposed to do when it was built with the bed tax.” The schedule of events for 2022 includes even more multiple-day tournaments than last year. During the upcoming Presidents’ Day three-day weekend, Blalock said “every single double hotel room in Alachua County is sold out,” adding that rates are between $329 to $350 a night. Some of the tournaments are so big that nearby fields at the Easton Newberry Sports Complex and in Jonesville Baseball Park are being reserved. Blalock also reported that colleges that visited in 2021 are putting pressure on events to come to Newberry because Champions Park has 16 fields and coaches can go from field to field to scout and recruit players. After Blalock spoke, Rebecca Lamb, past president of Alachua County Hospitality Council , came to the podium to present a plaque to the City of Newberry. “If it was not for your support and Champions Park, we would not have had anything during COVID,” she said. “They brought business in when everything was shut down.” The plaque stated that Newberry has “visionary leadership” and serves as “a model for others of what is possible.” In November 2021, the Newberry Commission gave staff the green light to apply for a grant to upgrade Champions Park. Blalock reported on replacing water systems and pitching mounds and a continued commitment to make sure Champions Park continues to offer top rated facilities. Editor’s note: This story has been updated to remove claims that Champions Park generated more local hotel stays than the University of Florida in 2021. Share this post: Share on X (Twitter) Share on Facebook Share on Email Tags: none Suzette Cook Suzette Cook is a former reporter for Mainstreet. View all posts Subscribe Notify of new follow-up comments new replies to my comments Label Name* Email* Website Label Name* Email* Website 0 Comments Oldest Newest Most Voted Inline Feedbacks View all comments Featured Local Savings Sign Up Local news in your inbox. Newsletter Form (#3) Subscribe Email Join Free Got a news tip or story? Let us know Recent Job Openings Conestogas – Night Grill Cook Conestogas Restaurant Pretrial Officer – Pretrial Services Alachua County Board of County Commissioners Senior Environmental Specialist (Land Conservation) Alachua County Board of County Commissioners Sustainability Manager Alachua County Board of County Commissioners Part-time Police Officer Santa Fe College Post A Job | View All Jobs Events Most Read High Springs teenager dies after motorcycle collides with car UF/IFAS to aid Florida farmers switching to bamboo crops Certain, Democrats criticize antisemite ‘on pedestal’ High Springs withdraws criticism of Alachua County Fire Rescue, cites misinformation Gainesville votes to demolish Thelma Boltin Center after price spike Chiefland teen dies in collision with semi Alachua County has 6 official scenic roads, Newnans Lake residents want another High Springs man sentenced to 10 years for child pornography distribution Motor Marketplace 2025 BMW X3 30 xDrive Sports Activity Vehicle $ 49,985 6K Miles Tomlinson Motor Company View Vehicle 2023 GMC Terrain AWD 4dr SLT $ 24,285 47K Miles Tomlinson Motor Company View Vehicle 2025 Kia Carnival SX WITH REAR ENTERTAINMENT ($2,500 VALUE) $ 46,985 19K Miles Tomlinson Motor Company View Vehicle 1 2 3 … 69 Next » View All Inventory Member-supported Mainstreet Daily News keeps you informed about news, sports and events, so you can stay safe, cast informed votes, and be a better neighbor in Alachua County and the surrounding area mainstreetdailynews.com 100 NW 76th Drive #2 Gainesville, FL 32607 Phone: 352-313-3150 Email: editor@mainstreetdailynews.com Discussion and Submission Guidelines Terms of Use Privacy Policy Contest Rules Cookie Notice 2024 Community Impact Report Public Notice Certification X Get Our Daily Newsletter Local news delivered right to your inbox Mobil Modal Newsletter Form Contact Email Submit Become a Member! Mainstreet does not have a paywall, but journalism is not free. Join your neighbors who make this work possible. See Member Benefits close arrow-circle-o-down chevron-left chevron-right facebook-square angle-down ellipsis-v instagram square-x-twitter cross menu wpDiscuz Insert"
    }
  ]
}