{
  "fuentes": [
    {
      "url": "https://www.charlesfdodgecitycenter.com/location/the-frank-at-charles-f-dodge-city-center-pembroke-pines",
      "email": "cbrix@ppines.com"
    },
    {
      "url": "https://thevendry.com/venue/212989/charles-f.-dodge-city-center-pembroke-pines-pembroke-pines-fl",
      "email": "jcanaday@asmglobal.com"
    },
    {
      "url": "https://thevendry.com/venue/212989/charles-f.-dodge-city-center-pembroke-pines-pembroke-pines-fl",
      "email": "rsilva@ppines.com"
    },
    {
      "url": "https://exhibitcitynews.com/the-charles-f-dodge-city-center-in-pembroke-pines-fla-managed-by-smg-opens/",
      "email": "eaca_color_logo@0.5x.png"
    },
    {
      "url": "https://www.charlesfdodgecitycenter.com/p/about/team",
      "email": "agallagher@ppines.com"
    },
    {
      "url": "https://www.charlesfdodgecitycenter.com/p/about/team",
      "email": "agardiner@ppines.com"
    },
    {
      "url": "https://www.charlesfdodgecitycenter.com/p/about/team",
      "email": "brodriguez@ppines.com"
    },
    {
      "url": "https://www.charlesfdodgecitycenter.com/p/about/team",
      "email": "cbrix@ppines.com"
    },
    {
      "url": "https://www.charlesfdodgecitycenter.com/p/about/team",
      "email": "dguerrero@ppines.com"
    },
    {
      "url": "https://www.charlesfdodgecitycenter.com/p/about/team",
      "email": "jbolgrien@ppines.com"
    },
    {
      "url": "https://www.charlesfdodgecitycenter.com/p/about/team",
      "email": "jhill@ppines.com"
    },
    {
      "url": "https://www.charlesfdodgecitycenter.com/p/about/team",
      "email": "mboudreau@ppines.com"
    },
    {
      "url": "https://www.charlesfdodgecitycenter.com/p/about/team",
      "email": "rsilva@ppines.com"
    },
    {
      "url": "https://www.charlesfdodgecitycenter.com/location/charles-f-dodge-city-center-pembroke-pines",
      "email": "cbrix@ppines.com"
    },
    {
      "url": "https://www.charlesfdodgecitycenter.com/p/about",
      "email": "cbrix@ppines.com"
    },
    {
      "url": "https://www.ppines.com/162/City-Managers-Office",
      "email": "cdodge@ppines.com"
    }
  ],
  "mails": [
    "agallagher@ppines.com",
    "agardiner@ppines.com",
    "brodriguez@ppines.com",
    "cbrix@ppines.com",
    "cdodge@ppines.com",
    "dguerrero@ppines.com",
    "eaca_color_logo@0.5x.png",
    "jbolgrien@ppines.com",
    "jcanaday@asmglobal.com",
    "jhill@ppines.com",
    "mboudreau@ppines.com",
    "rsilva@ppines.com"
  ],
  "nombre_sitio": "charlesfdodgecitycenter.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.charlesfdodgecitycenter.com/location/the-frank-at-charles-f-dodge-city-center-pembroke-pines",
      "text": "The Frank at Charles F. Dodge City Center Pembroke Pines skip to main content About Meet The Team Partners Photo Gallery Employment Opportunities Contact Attendees Event Calendar Buy Tickets Now Know Before You Go Directions & Parking Hotels Host An Event Client Portfolio Floor Plans  > Great Hall First Floor Meeting Rooms Mezzanine Second Floor Meeting Rooms Catering & Menus Proposal Request Form Tech Specs Buy Tickets Contact Skip Navigation Links Home > > The Frank at Charles F. Dodge City Center Pembroke Pines The Frank at Charles F. Dodge City Center Pembroke Pines 954-392-9480 cbrix@ppines.com 601 City Center Way Pembroke Pines, FL 33025 Home | Contact | Site Map | Cookie Preferences | Privacy Policy Copyright ©2025, Charles F. Dodge City Center. All Rights Reserved. Powered by Back to Top My Account Log Out Log In Search Search Buy Tickets Hours & Directions Site Map Privacy Policy Purchase Policy Contact"
    },
    {
      "url": "https://thevendry.com/venue/212989/charles-f.-dodge-city-center-pembroke-pines-pembroke-pines-fl",
      "text": "Charles F. Dodge City Center Pembroke Pines - Event Space in Pembroke Pines, FL | The Vendry by by Search Inspiration Circles Log In Sign Up by The community and marketplace for event pros. Join Us List My Business The Vendry Organizations The Memo About the Vendry Contact Us Groupize Keep me posted with industry news, cool case studies, and events. Your email address Subscribe © 2025 THE VENDRY LLC. Privacy Terms & Conditions Terms of Use Overview Spaces Nearby Hotels Charles F. Dodge City Center Pembroke Pines Event Space 601 City Ctr Wy, Pembroke Pines, FL 33025, USA Charles F. Dodge City Center Pembroke Pines 601 City Ctr Wy, Pembroke Pines, FL 33025, USA Request Pricing # of Spaces 4 Space s Capacity Max Seated: 3200 Max Standing: 2100 Discover a world of possibilities for your next event at the Charles F. Dodge City Center, where sophistication meets versatility. Our state-of-the-art venue is the perfect canvas for creating unforgettable experiences, whether you're planning a corporate conference, a gala celebration, a trade show, or a social gathering. Nestled in the heart of Pembroke Pines, our center offers an unparalleled setting designed to elevate your event to new heights. Show more Request Pricing 601 City Center Way, Pembroke Pines, FL Show on the map Spaces The Great Hall Max Seated: 3,200 Max Standing: 2,100 Outdoor Patio Conference Rooms Mezzanine Max Seated: 504 The Great Hall Max Seated: 3,200 Max Standing: 2,100 Outdoor Patio Conference Rooms Mezzanine Max Seated: 504 Do you work for Charles F. Dodge City Center Pembroke Pines ? Contact us to learn more about who's managing this profile or gain access. Other Venues in Pembroke Pines for Your Event Pembroke Pines Event Spaces Pembroke Pines Performance Spaces Pembroke Pines Hotels Pembroke Pines Restaurants Pembroke Pines Convention Centers Pembroke Pines Boats / Yachts Pembroke Pines Stadiums Pembroke Pines Museums / Galleries Pembroke Pines Movie Theaters Pembroke Pines Bars / Clubs Pembroke Pines Private Clubs Pembroke Pines Golf Courses Pembroke Pines Coworking Spaces Pembroke Pines Breweries / Distilleries Pembroke Pines Banquet Halls Pembroke Pines Aquariums / Zoos Pembroke Pines Cultural Centers Pembroke Pines Corporate Offices Pembroke Pines Private Group Activites Pembroke Pines Historic Buildings Pembroke Pines Photo Studios Pembroke Pines Public Spaces Pembroke Pines Event Spaces Pembroke Pines Performance Spaces Pembroke Pines Hotels Pembroke Pines Restaurants Pembroke Pines Convention Centers Pembroke Pines Boats / Yachts Pembroke Pines Stadiums Pembroke Pines Museums / Galleries Pembroke Pines Movie Theaters Pembroke Pines Bars / Clubs Pembroke Pines Private Clubs Pembroke Pines Golf Courses Pembroke Pines Coworking Spaces Pembroke Pines Breweries / Distilleries Pembroke Pines Banquet Halls Pembroke Pines Aquariums / Zoos Pembroke Pines Cultural Centers Pembroke Pines Corporate Offices Pembroke Pines Private Group Activites Pembroke Pines Historic Buildings Pembroke Pines Photo Studios Pembroke Pines Public Spaces"
    },
    {
      "url": "https://exhibitcitynews.com/the-charles-f-dodge-city-center-in-pembroke-pines-fla-managed-by-smg-opens/",
      "text": "The Charles F. Dodge City Center in Pembroke Pines, Fla., Managed by SMG Opens » Exhibit City News Skip to content Facebook Instagram Linkedin eNewblasts eNewblasts September 11, 2025 5:28 AM Search News North America International Associations New Products Webinars Features Columns As the Saw Turns Andy’s Apps Ask An Expert Convention Center/Airport Spotlight Digital Experience Green Piece Guest Columnist International Focus International Man The Tradeshow Times The Wow Booth Industry Profiles I&D Shop to Showfloor People People on the Move Women in the Industry Obituaries Tradeshow Strategies The D.E.A.L. Tradeshow Calendar Service Guide Employment Advertise Advertise Media Kit Editorial Calendar 30 Years About About Us Award Programs ExSys Awards Boss Awards Ace Awards ACE Awards FAQs Ace Award Winners Videos Testimonials Contact Us News North America International Associations New Products Webinars Features Columns As the Saw Turns Andy’s Apps Ask An Expert Convention Center/Airport Spotlight Digital Experience Green Piece Guest Columnist International Focus International Man The Tradeshow Times The Wow Booth Industry Profiles I&D Shop to Showfloor People People on the Move Women in the Industry Obituaries Tradeshow Strategies The D.E.A.L. Tradeshow Calendar Service Guide Employment Advertise Advertise Media Kit Editorial Calendar 30 Years About About Us Award Programs ExSys Awards Boss Awards Ace Awards ACE Awards FAQs Ace Award Winners Videos Testimonials Contact Us Share this post: The Charles F. Dodge City Center in Pembroke Pines, Fla., Managed by SMG Opens May 4, 2017 By Exhibit City News Staff The Charles F. Dodge City Center managed by SMG, the worldwide leader of public assembly facility management, has opened in Pembroke Pines, Fla., the second largest city in Broward County. Illustration Credit: Jose Gonzalez Pictured at right: Charles F. Dodge City Center General Manager Steve Clark, Broward Center for the Performing Arts President and CEO Kelley Shanley, SMG Executive Vice President Gregg Caren, City of Pembroke Pines Recreation Director Christina Sorensen and SMG COO and Senior Vice President Bob McClintock at the ribbon-cutting  – Photo Credit: Kara Starzyk Leveraging their long-standing success and market knowledge at the Broward County Greater Ft. Lauderdale Convention Center, SMG has teamed with the Broward Center for the Performing Arts – recognized nationally for its leadership in arts and entertainment as well as its innovative approaches to community engagement. Designed to accommodate banquets, conventions, meetings, tradeshows and performance events, the new 175,000 square-foot Charles F. Dodge City Center features the impressive Great Hall which offers room for more than 3,200 guests seated theater style, 2,400 for concerts, 1,300 classroom style, 1,120 banquet style and more than 100 exhibits for trade shows. Opening concerts included DRUMLine Live! and One Night of Queen with future performances of Kool & The Gang, Kansas and Shopkins Live! currently on sale. The Charles F. Dodge City Center is located at 601 City Center Way, Pembroke Pines, Fla.. For more information visit pembrokepinescitycenter.org . Exhibit City News Staff Founded in 1994, Exhibit City News is a premier print and digital news resource for the one million industry professionals who produce tradeshows and events year-round. Based in Las Vegas, Nevada, Exhibit City News works with companies across the United States and the globe. To be added to the distribution list for the quarterly print magazine, please email newsdesk@exhibitcitynews.com. Author Archive You Might Also Like: International Convention Centers Expand Reach with Investments in Science, Sustainability, and Sector Growth International Convention Centers Spotlight Sustainability, Science, and Smart Growth Convention Centers Spotlight Innovation, Inclusion, and International Appeal Trending Now How Big is One Trillion Dollars? Inside the Growth Strategies of Four Tradeshow Companies on the 2025 Inc. 5000 List EDPA and IFES Collaborate on First-Ever U.S. MasterClass The Rise and Fall of COMDEX 1979-2006 BOE International 2025: New Structural Addition in the Form of STRUCTURES INTERNATIONAL Watch the Latest Episode Here 037 - The EDPA Advantage: Networking, Education, and Growth Proud Supporter of Copyright © 2025 Exhibit City News Facebook-f Instagram Youtube Linkedin Exhibit City News"
    },
    {
      "url": "https://www.charlesfdodgecitycenter.com/p/about/team",
      "text": "Meet The Team skip to main content About Meet The Team Partners Photo Gallery Employment Opportunities Contact Attendees Event Calendar Buy Tickets Now Know Before You Go Directions & Parking Hotels Host An Event Client Portfolio Floor Plans  > Great Hall First Floor Meeting Rooms Mezzanine Second Floor Meeting Rooms Catering & Menus Proposal Request Form Tech Specs Buy Tickets Contact Home > About > Meet The Team Meet The Team Charles F. Dodge City Center Pembroke Pines 601 City Center Way Pembroke Pines, Florida 33025 954-392-9480 of Transcript of Transcript Corey Brix General Manager email: cbrix@ppines.com phone: (954) 392-9480 of Transcript of Transcript Marie Boudreau Director of Operations email: mboudreau@ppines.com phone: (954) 392-9480 of Transcript of Transcript Rolando Silva Senior Sales & Event Manager email: rsilva@ppines.com phone: (954) 392-9480 of Transcript of Transcript Amanda Gallagher Sales Manager email: agallagher@ppines.com phone: (954) 392-9480 of Transcript of Transcript Danny Guerrero Event Coordinator email: dguerrero@ppines.com phone: (954) 392-9480 of Transcript of Transcript Joshua Hill executive Chef email: jhill@ppines.com phone: (954) 392-9480 of Transcript of Transcript John Bolgrien Operations Manager email: jbolgrien@ppines.com phone: (954) 392-9480 of Transcript of Transcript Ansel Gardiner Finance Manager email: agardiner@ppines.com phone: (954) 392-9480 of Transcript of Transcript Brenda Rodriguez Box Office Manager email: brodriguez@ppines.com phone: (954) 392-9480 of Transcript 954-392-9480 cbrix@ppines.com 601 City Center Way Pembroke Pines, FL 33025 Home | Contact | Site Map | Cookie Preferences | Privacy Policy Copyright ©2025, Charles F. Dodge City Center. All Rights Reserved. Powered by Back to Top My Account Log Out Log In Search Search Buy Tickets Hours & Directions Site Map Privacy Policy Purchase Policy Contact"
    },
    {
      "url": "https://www.charlesfdodgecitycenter.com/location/charles-f-dodge-city-center-pembroke-pines",
      "text": "Charles F. Dodge City Center Pembroke Pines skip to main content About Meet The Team Partners Photo Gallery Employment Opportunities Contact Attendees Event Calendar Buy Tickets Now Know Before You Go Directions & Parking Hotels Host An Event Client Portfolio Floor Plans  > Great Hall First Floor Meeting Rooms Mezzanine Second Floor Meeting Rooms Catering & Menus Proposal Request Form Tech Specs Buy Tickets Contact Skip Navigation Links Events > Keiser University Online Graduation > Charles F. Dodge City Center Pembroke Pines Charles F. Dodge City Center Pembroke Pines 954-392-9480 The beloved TV classic soars off the screen and onto the stage this\r\nholiday season. Come see all your favorite characters from the\r\nspecial including Santa and Mrs. Claus, Hermey the Elf, Bumble the\r\nAbominable Snow Monster, Clarice, Yukon Cornelius and, of course,\r\nRudolph, as they come to life in Rudolph the Red-Nosed Reindeer:\r\nThe Musical. It’s an adventure that teaches us that what makes you\r\ndifferent can be what makes you special. Don’t miss this wonderful\r\nholiday tradition that speaks to the misfit in all of us. Based on the\r\nanimated television special Rudolph the Red-Nosed Reindeer and\r\nthe stage production directed and conceived by Jeff Frank and First\r\nStage. Script adaptation by Robert Penola. Arrangements and\r\norchestrations by Timothy Splain.\r\nRudolph the Red-Nosed Reindeer animated television special\r\nadapted from a story by Robert L. May and the song by Johnny\r\nMarks, music and lyrics by Johnny Marks. All elements © and ™\r\nunder license to Character Arts, LLC. Learn more about Charles F. Dodge City Center Pembroke Pines .\r\n    \r\n    View Google Map . Events at this location Event Schedule Name Details Keiser University Online Graduation Keiser University Online Graduation Sept 12, 2025 Joe Dimaggio's Special Needs & Inclusion Fair Joe Dimaggio's Special Needs & Inclusion Fair Sept 13, 2025 Florida National University Graduation Florida National University Graduation Sept 14, 2025 GL Homes Company Meeting GL Homes Company Meeting Sept 15 - Sept 16, 2025 Memorial Healthcare LDI Memorial Healthcare LDI Sept 18, 2025 Keiser University Pines Graduation Keiser University Pines Graduation Sept 19, 2025 Touch A Truck - FREE Event Touch A Truck - FREE Event Sept 20, 2025 South Florida Project Managers Institute South Florida Project Managers Institute Sept 26, 2025 Hispanic Heritage Festival - FREE Event Hispanic Heritage Festival - FREE Event Sept 27, 2025 Brunch on Purpose Brunch on Purpose Oct 04, 2025 Memorial Healthcare LDM Memorial Healthcare LDM Oct 08 - Oct 09, 2025 Prestige Club Annual Gala Prestige Club Annual Gala Oct 11, 2025 Brazil Expo Brazil Expo Oct 18 - Oct 19, 2025 South Florida Mental Wellness Summit & Expo South Florida Mental Wellness Summit & Expo Oct 23, 2025 8:00 AM Pines Night Out - FREE Event Pines Night Out - FREE Event Oct 24, 2025 Boo-Ville - FREE Event Boo-Ville - FREE Event Oct 29, 2025 The Home Show Lasso Lasso Nov 06, 2025 As We Honor Her: Fundraising Gala Imagine Dance Competition Broward College Student Life Awards in10sity Dance Competiton Schott Communities Models of Inspiration Gala Pines Day Somerset Academy Dance Recital South Florida Home Show Keiser University Graduation - Fort Lauderdale Florida Youth Orchestra Celebration Concert Savor the Sounds: FREE Concert Mater Elementary Graduation Mater Lakes Academy Graduation Pastor Robert Stewart Celebration of Life Alex Campos 8:30 PM iMater Graduation COHEA Graduation Mater Academy High Graduation Pembroke Pines Charter High Graduation Caribbean Jazz Fusion Heroes of Hip Hop Somerset Academy Miramar Graduation Summer Symphony: FREE Concert SFHHA Annual Healthcare Summit SFMA 45th Annual Recognition of Excellence Mayor's Kids Day American Bullies Against Bullying Memorial Healthcare LDI Caribbean Heritage Celebration Associated Builders & Contractors Graduation Summer Symphony - FREE CONCERT Memorial Healthcare LDM Florida National University Graduation BYB Brawl in the Pines III Perros Criollos Comedy Show Summer Symphony - FREE CONCERT Broward Health Awards Gala The Stompdown: National Step Dance Competition Willy Chirino y Sus Amigos Keiser University Pembroke Pines Graduation September 11th Ceremony Broward Mental Health Summit Keiser University Online Graduation Joe DiMaggio's Special Needs and Inclusion Fair GL Homes Company Meeting Memorial Healthcare LDI Brazil Expo Florida Touch A Truck HR Association of Broward County Annual Meeting South Florida PMI South Florida Wellness Network \"Butterflies and Bridges\" Gala Brunch on Purpose Hispanic Heritage Celebration G12 Church ATOM 30th Anniversary Dinner Prestige Club Annual Gala Savor the Sounds - FREE CONCERT Memorial Healthcare LDM Pines Night Out Archbishop McCarthy High School Homecoming Booville Art Festival SFMA Annual Meeting Don't Dream Your Life, Live Your Dreams Veterans Day Ceremony Broward Health Small Business Expo Nursing Consortium Annual Meeting Eddy Herrera South FL Church of Christ - Tri-County Church Service VITAS Town Hall South Florida Home Show Savor the Sounds - FREE Concert BYB Brawl in the Pines IV Snow Fest US Cheerleading Heroes of Hip Hop AYFLC Cheerleading Savor the Sounds - FREE CONCERT Somerset Academy Dance Recital Movie Night on the Plaza Repticon: Exotic Animal Tradeshow Ft. Lauderdale Orchid Show Florida National University Graduation Martin Luther King Jr. Event ADA State Competition Savor the Sounds - FREE Concert Broward Quilt Expo Judging & Quilt Collection Kindness 2025- It Starts With You Memorial Healthcare LDI US Cheerleading Sunshine State Nationals Star Systems Talent Storywalk on the Plaza Taste of Pines NexStar Dance Competition Savor the Sounds - FREE Concert Miami Herald Spelling Bee StarPower Dance Competition State of the CIO Broward Quilt Expo Memorial Healthcare LDM Dream Maker Dance Competition Greater Love KAR Dance Competition Savor the Sounds - FREE Concert As We Honor Them Prestige Club Exotic Car & Jazz Festival Imagine Dance Competition in10sity Dance Competition Broward College Student Life Awards Charlie Zaa in Concert Miss Pembroke Pines Pageant Pines Day Spring into Art Show South Florida Home Show Schott Communities Fashon Show Florida Youth Orchestra Savor the Sounds - FREE Concert Monsignor Pace High School Graduation Mater Lakes Academy Graduation Pooches in Pines Annual Gala iMater Graduation COHEA Graduation Mater Academy High School Graduation Pembroke Pines Charter High School Graduation Somerset Academy Miramar Graduation Mater Elementary Graduations Heroes of Hip Hop Summer Symphony Series - FREE Concert Trible B We OUtchea Dog Show Juneteenth Celebration - FREE Event Mayors Kids Day - FREE Event One City at a Time - FREE Event SFMA Recognition of Excellence Ceremony Caribbean Festival - FREE Event Associated Builders & Contractors Graduation Summer Symphony Series - FREE Concert Memorial Healthcare LDI Memorial Healthcare LDM Broward Health Meeting Boogie on Wheels: An 80's Block Party Broward Health Awards Gala Skellyfest: A Coral & Aquatic Expo Summer Symphony Series Repticon: Reptile & Exotic Animal Show 954-392-9480 cbrix@ppines.com 601 City Center Way Pembroke Pines, FL 33025 Home | Contact | Site Map | Cookie Preferences | Privacy Policy Copyright ©2025, Charles F. Dodge City Center. All Rights Reserved. Powered by Back to Top My Account Log Out Log In Search Search Buy Tickets Hours & Directions Site Map Privacy Policy Purchase Policy Contact"
    },
    {
      "url": "https://www.charlesfdodgecitycenter.com/p/about",
      "text": "About skip to main content About Meet The Team Partners Photo Gallery Employment Opportunities Contact Attendees Event Calendar Buy Tickets Now Know Before You Go Directions & Parking Hotels Host An Event Client Portfolio Floor Plans  > Great Hall First Floor Meeting Rooms Mezzanine Second Floor Meeting Rooms Catering & Menus Proposal Request Form Tech Specs Buy Tickets Contact Home > About Our Venue The Charles F. Dodge City Center Pembroke Pines, is in the heart of Pembroke Pines, the second-largest city in Broward County, and is nestled between Mediterranean style residences, casual-chic and family-style restaurants featuring international cuisine and numerous name-brand stores and shopping malls. The city center is a multi-use facility that serves the community by hosting events such as Banquets, Conferences, Concerts, Meetings, Social Events,Trade Shows, and facilitating local events which will promote civic, educational and community pride. This facility offers 45,000 square feet of flexible indoor and outdoor event space. Besides its intelligent design, the City Center is also visually striking, attendees will notice the modern contemporary architecture with its sleek lines and the unique layout of the facility. The City Center's largest space is the Great Hall which measures over 23,000 square-feet. This impressive space offers room for over 3,200 guests seated theater style, 2100 standing for concerts, 1,300 classroom style, 1,120 banquet style and over 100 exhibits for trade shows. The Mezzanine is 4,544 square-feet and can seat up to 210 guests for banquets. The center also offers nine (9) flexible meeting rooms with of state-of-the art amenities and accommodates up 220 attendees. Supporting these spaces are the City Center's well-equipped catering facilities by SAVOR which means, that everything from coffee breaks to five-course banquets, will run seamlessly. Ample space for freight access into the Great Hall offers added convenience for larger events. If you can imagine it, we can make it happen. of Transcript of Transcript Our Mission The mission of the Charles F. Dodge City Center Pembroke Pines is to serve the community by offering a state-of-the-art facility with professional management, and by hosting local events, conventions, trade shows, meetings, and concerts generating significant economic impact for the City of Pembroke Pines as well as promoting education, entertainment and community pride, in a fiscally responsible manner. In addition, the City Center will support and encourage actions and programs that enhance the desirability and attractiveness of Pembroke Pines to neighboring communities. Our History The city broke ground on the Pembroke Pines city center in the summer of 2015. This 175,000 square-foot facility has been designed to accommodate banquets, conventions, meetings, trade shows, and performance events with maximum seating around 3,200. The unique venue is complemented by new City Hall and The Frank Art Gallery adjacent to the City Center. The privately developed 160 acre mixed used project that has approximately 1,800 residential units, hotels, retail shops, restaurants, and entertainment uses. In April 2017, The City of Pembroke Pines named its new City Center Complex, the “Charles F. Dodge City Center” in honor of its City Manager Charles F. Dodge. Dodge was hired by the City of Pembroke Pines in 1975 to serve as the City’s first Community Services Director. He was instrumental in developing Broward County’s first center to assess and provide social services specifically for senior citizens. Dodge was then promoted through the ranks of City government, serving as the City’s Director of Code Enforcement, City Clerk, Assistant City Manager and Acting City Manager before being appointed by the City Commission to serve as City Manager in 1989. In 1996, he worked with the City Commission to implement their vision and create the City of Pembroke Pines Charter School System, which is a nationally recognized system operating seven public schools K-12 throughout the City. During his tenure as City Manager, the population of Pembroke Pines has expanded from just over 65,000 to currently well over 170,000. Dodge has overseen this extensive growth and development, playing a pivotal role in the acquisition and development of land for the City Center Complex, as well as harmonizing residents’ need for roads, parks, public safety and schools. of Transcript Funding for this project was provided in part by The State of Florida, Department of State, Division of Cultural Affairs and the Florida Council on Arts and Culture. The Broward County Board of County Commissioners are recommended by the Broward Cultural Council and Greater For Lauderdale Convention & Visitors Bureau of Transcript 954-392-9480 cbrix@ppines.com 601 City Center Way Pembroke Pines, FL 33025 Home | Contact | Site Map | Cookie Preferences | Privacy Policy Copyright ©2025, Charles F. Dodge City Center. All Rights Reserved. Powered by Back to Top My Account Log Out Log In Search Search Buy Tickets Hours & Directions Site Map Privacy Policy Purchase Policy Contact"
    },
    {
      "url": "https://www.ppines.com/162/City-Managers-Office",
      "text": "City Manager's Office | Pembroke Pines, FL - Official Website Skip to Main Content Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In City Government City Departments Business Opportunities Resident Resources How Do I…? Search Home City Government City Manager's Office City Manager's Office City Manager Charles F. Dodge A municipal employee of the City of Pembroke Pines for nearly 50 years, Charles F. Dodge was appointed City Manager in 1989, at a time when the community not only began to double in population, but there was also an increase in demand for roads, parks, public safety and schools. Today, under his management, the City has grown to be Florida’s tenth largest municipality, with over 170,000 residents, and home to the largest municipally-owned Charter School System in Broward County. Mr. Dodge was hired by the City of Pembroke Pines in 1975 as the City’s first Community Services Director. Under his direction, the first senior citizen center in Broward County was opened in Pembroke Pines. It was also his vision that advanced the development of the City’s 50,000-square-foot Senior Complex which also includes residential apartments for senior citizens. He has held several department director positions, including Director of Code Enforcement, City Clerk, and Assistant City Manager. In 1998, Mr. Dodge opened the City’s Charter Schools, a school system with four elementary, two middle, and one high school, with a total student population of more than 5,900. Background Originally from Worcester, Massachusetts, Mr. Dodge has been a resident of Broward County since 1972. He received a Bachelor of Arts degree from St. Vincent de Paul Seminary in Boynton Beach, FL. He is married with four children and three grandchildren. Mr. Dodge is the recipient of numerous awards, and a member of various professional and community organizations. Contact Us Charles F. Dodge City Manager Email Ph: 954-450-1040 Staff Directory About Pembroke Pines City Attorney's Office City Clerk's Office Legal Ads / Postings Business Impact Estimates Open Government Public Records Request City Boards and Committees Affordable Housing Advisory Committee Arts & Culture Board Auditor Selection Committee Board of Adjustment Charter Elementary / Middle School Advisory Charter High School Board Charter Review Board Citizens Budget Advisory Board Diversity and Heritage Advisory Board Economic Development Board Education Advisory Board Environmental Advisory Board FSU Charter Elementary School Advisory Board Planning & Zoning Board Police & Fire Pension Board Social Media Committee Youth Advisory Board Budget Committee (Commissioner Castillo) City Charter and Code of Ordinances City Charter and Code of Ordinances Land Development Code City Elections Upcoming Elections Election Packet Municipal Qualifying Sample Ballot Municipal Election Polling Stations District Map Candidate Campaign Finance Reporting Florida Election Laws Links to other websites with important information on elections: Commission Meetings Agendas & Minutes Meeting Calendar Watch Meeting - Live Stream Youtube Pembroke Pines Channel HOA Contact Update Form Forms, Requests & Other Applications Boards & Committees Application For Businesses Application for At Home Family Day Care Lien Search Local Business Tax Receipt Garage Sale Application Lobbyist Information Permit Search Public Records Request Abandoned/Vacant Property Registration City Commission Mayor Angelo Castillo Vice Mayor Michael Hernandez Commissioner Thomas Good, Jr. Commissioner Maria Rodriguez Commissioner Jay D. Schwartz Pembroke Pines Representatives City Manager's Office City Wide Commission Map Pines Web Services Utilities (Citizens Self Service - CSS) Development HUB Passport Services Lien Search Fire Rescue Lobbyists Login Agendas & Minutes City Commission, Code Compliance & Other Boards Watch Commission Meeting When Live Streaming Pines Web Services Building Permits/Inspections, Passports, Lien Searches, Utilities, Fire Inspections Careers Available Career Descriptions/Application Utilities Customer Service, Billing/Payment, Water Quality Reports City Alerts Emergency Situations or Critical Community Alerts Contact Us 601 City Center Way Pembroke Pines, FL 33025 Phone: 954-450-1060 Quick Links Pines Media Shop Local Demographics Location Chamber of Commerce /QuickLinks.aspx Site Links Home Contact Us Webmail Site Map Ethics Hotline /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    }
  ]
}