{
  "fuentes": [
    {
      "url": "https://finewineliquors.com/contact-us/",
      "email": "sales@finewineliquors.com"
    },
    {
      "url": "https://www.charlie1horsehats.com/pages/about-us",
      "email": "help@charlie1horsehats.com"
    },
    {
      "url": "https://www.charlie1horsehats.com/pages/about-us",
      "email": "info@stagheaddesigns.com"
    },
    {
      "url": "https://www.charlie1horsehats.com/pages/about-us",
      "email": "mrange@hat-co.com"
    },
    {
      "url": "https://www.enterprisenews.com/story/news/politics/county/2016/12/13/charlie-horse-restaurant-in-west/24257023007/",
      "email": "cshepard@enterprisenews.com"
    },
    {
      "url": "https://www.ocalamarion.com/directory/charlie-horse-restaurant/",
      "email": "exploreocalamarion@marionfl.org"
    },
    {
      "url": "https://business.ormondchamber.com/list/member/charlie-horse-restaurant-760",
      "email": "info@ormondchamber.com"
    },
    {
      "url": "https://www.squishandcharlie.com/contact-us/",
      "email": "squish@squishandcharlie.com"
    },
    {
      "url": "https://foursquare.com/v/charlie-horse-restaurant/4b4e581af964a5202bea26e3",
      "email": "icon-go_foursquare8@2x-8104e4d03ad47b81f079c1f043220e75.png"
    }
  ],
  "mails": [
    "cshepard@enterprisenews.com",
    "exploreocalamarion@marionfl.org",
    "help@charlie1horsehats.com",
    "icon-go_foursquare8@2x-8104e4d03ad47b81f079c1f043220e75.png",
    "info@ormondchamber.com",
    "info@stagheaddesigns.com",
    "mrange@hat-co.com",
    "sales@finewineliquors.com",
    "squish@squishandcharlie.com"
  ],
  "nombre_sitio": "charliehorserestaurant.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://finewineliquors.com/contact-us/",
      "text": "Contact us Fine Wine Liquors Shop By Department Wine Red wine Menu Shiraz Cabernet Sauvignon Pinot Noir Red Blends Other Red Varietals Rosé Cabernet Merlot Shiraz Cabernet Merlot Grenache Tempranillo Sangiovese Nebbiolo Bordeaux Barossa Valley white Wine Menu Chardonnay Riesling Sauvignon blanc Pinot gris grigio Other white varietals White blends Dessert white Popular Regions Menu Bordeaux Barossa Valley Mclaren Vale Coonawarra Margaret River Burgundy Clare Valley Fortified Wine Menu Port Tawny Sherry Apera Vermouth Muscat Mead Tokay Topaque Popular Brands Menu Penfolds Under Wraps Wynns Wendouree Wolf Blass Tyrrell’s Top Selling Macallan 15 Year Old Double Cask $ 165.00 Availability: In Stock Glenfiddich Project XX $ 61.00 Availability: In Stock Glendronach 15 Year Old Revival $ 86.25 Availability: In Stock Beer Discover Beer Menu Craft Beer International Beer Australian Beer Mid Strength Light Beer Low Carb Beer Alcoholic Ginger Beer Home Brew Stout Pilsner Wheat Beer Dark Beer Golden Ale Porter Categories Menu Kegs Cider Craft Beer Domestic Beer Hard Seltzers Import Beer Non-Alcoholic Beer Popular Brands Menu 4 Pines Balter Coopers Little Creatures Stone & Wood Zytho New & Trending Menu New Arrivals Top Rated Craft Beer Light Low Pool Packs Cool Off Craft Beer The Lemonade Stand Country Menu Australia Sweden New Zealand France Spain From to Ready to Drink Organic Wine $69.99 Whiskey Discover whiskey Menu Scotch Whisky American Whiskey Japanese Whisky Australian Whisky Irish Whiskey Canadian Whisky Indian Whisky Discover Vodka Menu Absolut Smirnoff Hunter Distillery Stolichnaya Royal Dragon Crystal Head Poliakov Popular Brands Menu Johnnie Walker Jack Daniel’s Glenfiddich Highland Park Glen Moray Stone & Wood Fortified Wine Menu Whiskey Of The Month Flavored Whiskey Blended Scotch Rye Whiskey Single Malt Scotch Small Batch Bourbon Hot deals of summer Fresh Beer Save up $49.99 Jameson Whiskey Father’s Day Sale 40% off Sitewide! Cogac Cocktail Tequila What’s New New Gift & Accessories Best Sellers Sales & Offers -20% Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Menu Sign In or Register 0 0 $ 0.00 Contact us Home Page Contact us Don’t  hesitate to contact us \nif you need help. Whether you have a question about your order, need assistance with a product, or just want to reach out, you’re in the right place. Feel free to contact us using the details below, and we’ll get back to you as quickly as possible! Address 8560 S Cottage Grove Ave, Chicago, IL 60619, United States Call Us (630) 354-9222 Openning Monday – Friday: 8am – 10pm Saturday – Sunday: 9am – 5pm Contact sales@finewineliquors.com finewineliquorsinfo@gmail.com Got Any Questions? Use the form below to get in touch with the sales team Message Send your message Δ Search Account Cart Same-day local delivery Ground shipping directly to you Free in-store pickup 24/7 customer support Customer Service Menu Help Center My account Track my order Return policy About Us Menu Company info Press Releases Careers Reviews Investor relations Quick Links Menu Search Become a reseller Contact us Terms of service Categories Menu Brandy White Wine Champagne Vodka Tequila Get exclusive offers & rewards Sign up for our members portal to receive some exclusive offer & rewards. It’s easy and free! sign up Leave this field empty if you're human: stay connect Facebook-f Twitter Instagram Pinterest we accept Careers About Us Affiliates Privacy Settings Help Site map Copyright ©  2022 Liquory . All rights reserved. Sign in Create an Account Username or email * Password * Login Lost your password? Main menu Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Home About Us Account Blog Careers Cart Checkout Contact us Legal Notice My account Order Tracking Privacy Policy Refund and Returns Policy Reviews Sample Page Shipping Shop Terms & Conditions Track Wishlist Search for: Search All category All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell’s Black Lebel Blanton’s Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester’s Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell's Black Lebel Blanton's Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester's Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine Hide similarities Highlight differences Select the fields to be shown. Others will be hidden. Drag and drop to rearrange the order. Image SKU Rating Price Stock Availability Add to cart Description Content Weight Dimensions Additional information Click outside to hide the comparison bar Compare Top Shopping cart close ×"
    },
    {
      "url": "https://www.charlie1horsehats.com/pages/about-us",
      "text": "C1H - About Us\n– Charlie 1 Horse Skip to content Pause slideshow Play slideshow Free Shipping on Domestic Orders Over $100. Instagram Facebook TikTok Currency United States (USD $) Argentina (USD $) Australia (AUD $) Austria (EUR €) Belgium (EUR €) Brazil (USD $) Canada (CAD $) Chile (USD $) Colombia (USD $) Czechia (CZK Kč) Denmark (DKK kr.) France (EUR €) Germany (EUR €) Greece (EUR €) Iceland (ISK kr) Ireland (EUR €) Israel (ILS ₪) Italy (EUR €) Japan (JPY ¥) Liechtenstein (CHF CHF) Luxembourg (EUR €) Mexico (USD $) Monaco (EUR €) Netherlands (EUR €) New Zealand (NZD $) Norway (USD $) Poland (PLN zł) Portugal (EUR €) South Korea (KRW ₩) Spain (EUR €) Sweden (SEK kr) Switzerland (CHF CHF) Taiwan (TWD $) United Kingdom (GBP £) United States (USD $) Charlie 1 Horse LAINEY WILSON FALL 25 HATS Felt Straw Caps COLLECTIONS The Cowgirl Hat C1H  X LAINEY WILSON Felt Straw Western Merch Youth Gift Cards Size Chart Stories Search Account 0 Cart Site navigation Close Search Search Cancel Subtotal $ 0.00 Check out Shipping, taxes, and discount codes calculated at checkout. Your cart is currently empty. LAINEY WILSON FALL 25 HATS Expand submenu HATS Felt Straw Caps COLLECTIONS Expand submenu COLLECTIONS The Cowgirl Hat C1H  X LAINEY WILSON Felt Straw Western Merch Youth Gift Cards Size Chart Stories About Us / Contact Us At Charlie 1 Horse Hat Company, we specialize in western apparel that breaks the mold. We have something for everyone: traditional cowboy hats for purists, fun yet functional summer hats for beachgoers and road-trippers, and fashion-forward designs for country girls and city folks alike. The straw and felt hats in our collection demonstrate an exquisite eye for detail that shows up in every line, texture, and accent. It’s not just about how our hats look either. Working cowgirls wear Charlie 1 Horse, which means quality, durability, and affordability are built into our manufacturing process. In the same breath, we pride ourselves on being trendsetters, whether it’s on the streets of Nashville, in the fashion houses of Europe, or along the banks of the Pecos River. Charlie 1 Horse hats have shown up on stage, on screen, and in renowned publications such as Vogue since 1978. As of 2024, we are proud to offer our Charlie 1 Horse by Lainey Wilson Collection, where we present designs inspired by the artist’s hit songs and iconic look. Lainey Wilson is not the first country music star to wear Charlie 1 Horse, but she may be our all-time favorite. Whether you are classic country, a rock and roll rebel, or a woman on her way to Cabo or Fiji, Charlie 1 Horse Hat Company has you covered. We invite you to check us out. *One more thing. The Charlie 1 Horse fire brand on your hat’s crowns was hand pressed for a unique, personalized look. An off-center brand is not an imperfection. It is a mark of beauty. To send us a message or to ask a question, please use the chat feature in the bottom right hand corner. You can also email us directly at help@charlie1horsehats.com . We should get back to you shortly during our standard business hours, 9AM – 5PM CST. KEEP ME UPDATED! NEWSLETTER Sign Up to get the latest news on sales and new offerings! Enter your email Subscribe Subscribe FAQ Shipping & Returns About Us / Contact Us Gift Cards Size Chart Sponsorships What is Prop 65? Retailers Become a Retail Partner Search Privacy policy Terms of Service We accept American Express Apple Pay Bancontact Diners Club Discover Google Pay iDEAL JCB Maestro Mastercard Shop Pay Union Pay Visa \"Close (esc)\" icon-chevron C1H - About Us"
    },
    {
      "url": "https://www.enterprisenews.com/story/news/politics/county/2016/12/13/charlie-horse-restaurant-in-west/24257023007/",
      "text": "Charlie Horse restaurant in West Bridgewater to return as Barrett's Alehouse News Sports Entertainment Lifestyle Advertise Obituaries eNewspaper Legals COUNTY Charlie Horse restaurant in West Bridgewater to return as Barrett's Alehouse Cody Shepard cshepard@enterprisenews.com WEST BRIDGEWATER – The closure was abrupt, leaving many stunned during the summer, but the former Charlie Horse location will soon be filled again. Mike Barrett, the owner of Barrett’s Alehouse, is opening another restaurant at the West Center Street location — and he hopes to be up and running within the next six months. “You won’t be disappointed. It will be a first-class operation,” Barrett recently told West Bridgewater selectmen, as he asked the board to transfer the existing liquor license to his business. The Charlie Horse closed at the beginning of August when co-owner Mary Barrett-Costello cited declining business and the large building, which is 22,000 square feet. But her brother, Mike Barrett, who is no longer part of the family business, is moving in. He owns Barrett’s Alehouse in Bridgewater, North Attleboro and Fall River; Fireside Grille in Middleboro; and Castaways Bar and Grille in Bridgewater. “The standard for granting a liquor license is showing a public need – west of 24, one liquor establishment in the town of West Bridgewater,” attorney Mark Gildea said. “I think that’s some indication of the need for an alcohol establishment in that area.” The restaurant will undergo major renovations before it opens. There will be a second entrance added on the Pleasant Street side of the building to accommodate a new parking lot, for which the plan is still being developed. The bowling alley is being removed and a large function room that can hold 152 people will take its place. The room can also be split into three sections to accommodate smaller gatherings. “They’re going to have a game room that’s a little larger than the existing game room that was there,” Gildea said. The main bar is going to be larger than was at the Charlie Horse and the stage where musicians performed is being removed. The dance floor is also being relocated. The outside patio will have a new layout, but not undergo any structural changes. One of the exterior changes that residents said will make a big difference is blocking the driveway access from the Lowe’s parking lot. People complained of cars speeding through the lot to get into the restaurant parking lot. The restaurant owners are currently working with the property manager to put a fence there so that people going to the restaurant have to use the Route 106 entrance. “We hope to have a similar success. We hope to be there for 25 years,” Gildea said. “The Barretts in all their places become a part of the community and they want to become a part of the West Bridgewater community.” Selectman Jerry Lawrence said the board likes when businesses work together in town and commended Barrett for speaking to other businesses about moving into town. “It’s a great concept and we’re happy to see the building come back,” he said. Selectman Anthony Kinahan asked Barrett if he allows workers to drink while on the job, as he suspected he saw several employees drinking at the Bridgewater location recently. “I would be surprised,” Barrett said, adding he has a zero-tolerance policy. Kinahan also questioned how often police respond to Barrett’s restaurants. The owner said he always has police respond if there’s an issue and that the Alehouse in Bridgewater can have more calls because of live entertainment. “We call no matter what – any confrontation or problem, we call the police and let them deal with it rather than ourselves,” Barrett said. West Bridgewater Police Chief Victor Flaherty said the police response might look bad on paper, but that they hope he does the same in town. “The Barretts have always worked well with police,” he said. “They call all the time. I’d much rather have them do that than hide it.” The three-member board voted unanimously to grant Barrett’s Alehouse the liquor license. Barrett said he originally hoped to open in March or April, but it could be May or June as they need to develop a site plan for additional parking. “The Charlie Horse has always been a great selling point for people to come over – conferences, seminars or retirement parties,” Lawrence said. “When they leave your establishment, they buy their gas in the convenience stores and their goods. It’s a great reason for people to get off Route 24 and stop in town. I think it’s a great proposal.” Careers Staff Directory Accessibility Sitemap Legals Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Business Advertise Your Business Buy and Sell Licensing & Reprints Help Center Subscriber Guide Manage Account Give Feedback Subscribe Today Newsletters Facebook X eNewspaper Archives Jobs Real Estate Classifieds Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.enterprisenews.com. All rights reserved."
    },
    {
      "url": "https://www.ocalamarion.com/directory/charlie-horse-restaurant/",
      "text": "Charlie Horse Restaurant | Ocala / Marion County Florida Skip to content 0 Saved Plan Your Trip Get Our App Equestrian Content Navigation Things to Do Equestrian Outdoor Adventures Indoor Adventures Shopping Arts & Culture Golf Agritourism Spas & Wellness Day Trips & Scenic Drives Events Annual Events Horse Shows & Events Submit Your Event Community Calendar Where to Stay Hotels & Motels Campgrounds & RV Parks Vacation Rentals Bed & Breakfasts Food & Drink Wineries, Breweries & Distilleries Plan Your Visit Transportation Weather & Avg Temperatures FAQs Area Vacation Guide OcalaMarion Travel Guide App E-Newsletter Signup Tropical Weather Updates Plan Your Trip Get Our App Equestrian Content Meetings & Events Blog Sports Events Weddings About Us Partners Download Vacation Guide Email Newsletter Signup Get Exclusive Deals Home Website Menu Charlie Horse Restaurant 2426 E Silver Springs Blvd Ocala, Florida 34470 United States Details Open in Google Maps Map Charlie Horse Restaurant 2426 E Silver Springs Blvd Ocala, Florida 34470 (352) 622-4050 Share Overview Come join us for burgers and wings! Enjoy some Karaoke or stop by on Trivia Night. Hours We host karaoke nightly! Live music 7 days a week on our outside deck. Cuisines Amenities Details Bar & Grill American Cuisine Amenities Accessible Catering Family Friendly Outdoor Seating Parking Available Start Planning Your Stay In Ocala Vacation Guide Email Newsletter Visitor Center 109 West Silver Springs Boulevard | Ocala, FL 34475 Phone (352) 438-2800 | 1-888-FL-OCALA About Us Blog Media Contact Us Tour Operators Terms of Use Partners Privacy Policy Accessibility Â©2025 Ocala/Marion County Visitors and Convention Bureau This site uses cookies to provide you with an optimized experience. Privacy Policy Accept Quick Search Search Location Map"
    },
    {
      "url": "https://business.ormondchamber.com/list/member/charlie-horse-restaurant-760",
      "text": "Charlie Horse Restaurant | Restaurants Skip to content Menu The Chamber Board of Directors About Us Ambassador Committee Partners Staff Contact Us Membership Member Application Member Map Membership Benefits Hot Deals Member-to-Member Deals Member Login Events/Programs Signature Events & Programs Chamber Calendar Community Calendar Visitor Information Welcome to Ormond Beach Weather Information Request Lodging Dining Real Estate Business Resources Resources Job Postings What’s New Menu The Chamber Board of Directors About Us Ambassador Committee Partners Staff Contact Us Membership Member Application Member Map Membership Benefits Hot Deals Member-to-Member Deals Member Login Events/Programs Signature Events & Programs Chamber Calendar Community Calendar Visitor Information Welcome to Ormond Beach Weather Information Request Lodging Dining Real Estate Business Resources Resources Job Postings What’s New Charlie Horse Restaurant Categories Restaurants 810 S. Atlantic Ave. Ormond Beach FL 32176 (386) 672-4347 (386) 672-0484 http://www.charliehorserestaurant.com About Us RESTAURANTS/CLUBS Share × Print Email Facebook Twitter LinkedIn Close Tell a Friend × Send Request Cancel © 2025 Ormond Beach Chamber of Commerce | Site by GrowthZone Get In Touch! 386. 677.3454 map and address 165 W. Granada Blvd, Ormond Beach, FL 32174 email info@ormondchamber.com Additional Resources FAQ Privacy policy Terms and conditions Stay Connected! facebook linked in youtube Instagram icon © 2025 Ormond Beach Chamber of Commerce. All Rights Reserved | Site by GrowthZone Scroll To Top"
    },
    {
      "url": "https://www.squishandcharlie.com/contact-us/",
      "text": "Contact Us | Squish and Charlie's Doggy Daycare Skip to content squish@squishandcharlie.com 403-471-1563 Squish and Charlie's Doggy Daycare Toggle menu visibility. Home Services Doggy Daycare Dog Walking Dog Grooming Register Now Contact Us Find all our Socials, including the intake form here: Squish and Charlie’s Linktree #squishandcharlie #yyc #yycdoggydaycare #yycdogs #dogsofcalgary #calgarydogs #doglife #calgarypets #yycpets Get in Touch We are here to answer any questions you may have. Reach out to us and we’ll respond as soon as we can. Email squish@squishandcharlie.com Phone 403-471-1563 Address 3644 Manchester Road SE, Calgary AB Squish and Charlie’s is: Squish and Charlie's Doggy Daycare Toggle menu visibility. facebook instagram TikTok Useful Links Toggle menu visibility. Dog Walking Price List Contact Us Contact Us 403-471-1563 squish@squishandcharlie.com 3644 Manchester Road SE, Calgary AB"
    },
    {
      "url": "https://foursquare.com/v/charlie-horse-restaurant/4b4e581af964a5202bea26e3",
      "text": "Log in Foursquare City Guide Sign Up Nearby: Get inspired: Top Picks Trending Food Coffee Nightlife Fun Shopping Log in to Foursquare Email or Phone Number: Password: (Forgot password?) Sign up for Foursquare Log in with Facebook You must enable JavaScript to use foursquare.com We use the latest and greatest technology available to provide the best possible web experience. Please enable JavaScript in your browser settings to continue. Download Foursquare for your smart phone and start exploring the world around you!"
    }
  ]
}